{
 "id": "100092",
 "text": "The Council of Trent was the 19th Ecumenical council of the Roman Catholic Church.Wetterau, Bruce. World history. New York: Henry Holt and company. 1994. Important members of the Catholic Church met in Trento three times between 13 December 1545 and 4 December 1563, in reaction to the Protestant Reformation. It reinforced Catholic doctrine while claiming to answer all disputes regarding salvation, the sacraments, and the Biblical canon. The council often could not meet when they wanted to, and sometimes could not meet at all, because of resistance from the popes and revolt against the emperor.Cross, F. L., ed. The Oxford dictionary of the Christian church. New York: Oxford University Press. 2005.Charles V, Holy Roman Emperor wanted the council to meet, and Pope Paul III summoned the council in 1537, but the plans fell through. In 1538, ideas for a council again failed. The pope asked for the council to meet in 1542, but it did not actually meet until 1545. The council was not active between 1547 and 1551. It again met from 1551 to 1552, when it was suspended due to a revolt against the emperor. Pope Paul IV (1555-59) strongly disliked Protestant ideas and the council could not start again until his succesor took office. The council met for the last time from 1562-63. The Council of Trent was part of the Counter-Reformation. It would be over 300 years until the next Ecumenical Council. Pope Paul III saw that the Protestant Reformation was getting bigger. Before, a small number of priests were part of the reformation, but soon many princes, particularly in Germany, supported its ideas. Therefore, Pope Paul III desired a council. But the council could not meet until 1545 and met right before Martin Luther's death. The council was moved to Bologna in March 1547 with the excuse of avoiding a plague; without any plans to meet again, 17 September 1549. The council was reopened at Trento, 1 May 1551, by Pope Julius III (1550–55); broken up 1552, recalled by Pope Pius IV (1559–65) for the last time, 18 January 1562, when it continued until 4 December 1563. ==Objects and general results== Objects were: #To stop the ideas and practice of Protestantism and to support the Catholic Church's ideas. #To change the parts of the church and actions of church leaders that damaged or hurt the Catholic Church's ideas and image. The results were: #The church's interpretation of the Bible was final. Any Christian who did not agree with the interpretation was a heretic. Also, the Bible and Church Tradition had equal authority. #The relationship of faith and works in salvation was defined, following disagreements over Martin Luther's doctrine of \"justification by faith alone\". #Catholic practices such as pilgrimages, the veneration of saints and relics, especially the Virgin Mary were strongly reaffirmed. #The selling and buying of false indulgences were banned. The doctrinal decisions of the council are divided into decrees (decreta), which contain the positive statement of the conciliar dogmas, and into short canons (canones), which condemn the differing Protestant views with the concluding \"anathema sit\" (\"let him be anathema\"). ==List of dogmatic decrees== Doctrine Session Date Canons Decrees On the Symbol of the Faith 3 February 4, 1546 None 1 The Holy Scriptures 4 April 8, 1546 None 1 Original sin 5 June 7, 1546 5 4 Justification 6 January 13, 1547 33 16 The Sacraments in General 7 March 3, 1547 13 1 Baptism 7 March 3, 1547 14 None Confirmation 7 March 3, 1547 3 None Holy Eucharist 13 October 11, 1551 11 8 Penance 14 November 15, 1551 15 15 Extreme Unction 14 November 4, 1551 4 3 Holy Eucharist, On Communion 21 June 16, 1562 4 3 Holy Eucharist, On the Sacrifice of the Mass 22 September 9, 1562 9 4 Holy Orders 23 July 15, 1563 8 3 Matrimony 24 November 11, 1563 12 1 Purgatory 25 December 4, 1563 None 1 Cults: Saints Relics Images 25 December 4, 1563 None 3 Indulgences 25 December 4, 1563 None 1 ==Related pages== *Counter-Reformation ==References== ==Other websites== *A Catholic View of the Council from the Catholic Encyclopedia *The text of the Council of Trent translated by J. Waterworth, 1848 Trent Category:Province of Trento Category:16th century in Italy Category:16th-century disestablishments Category:1540s establishments in Europe Category:Disestablishments in Italy Category:Counter-Reformation",
 "title": "Council of Trent"
}