{
 "id": "100099",
 "text": "The Gospel of Matthew is a book of the Bible. (Its full name is the Gospel According to Matthew, but it is often called the Gospel of Matthew or just Matthew). It is one of the four gospels of the New Testament that tell the story of Jesus' life and teachings. It is not thought to have been written by the apostle Matthew, who was one of Jesus' twelve apostles (see below). The Gospel of Matthew is called one of the synoptic gospels because it has some of the same stories and language as the Gospels of Mark and Luke. Matthew wrote the gospel mainly for the Jewish people, to show them that Jesus is really the Messiah. Like the Gospels of Mark and Luke, Matthew tells many stories about Jesus' life. Matthew's gospel also talks about Jewish scripture. == Date and author == Early Christian tradition attributes the gospel to the apostle Matthew. This is now rejected by modern scholars.Burkett, Delbert 2002. An introduction to the New Testament and the origins of Christianity. Cambridge University Press. ISBN 978-0-521-00720-7This view is based on three arguments: (a) the setting reflects the final separation of Church and Synagogue, about 85 AD; (b) it reflects the capture of Jerusalem and destruction of the Temple by the Romans in 70 AD; (c) it uses Mark, usually dated around 70 AD, as a source: see R.T. France 2007. The Gospel of Matthew, p. 18. The name of the author is not known. Likely it was written in Syria, in the last quarter of the first century AD. Because it spread rapildly, it was likely written in a city. A city commonly cited is Antioch on the Orontes. the mdern-day city of Antakya. The writer was likely the head of a community. The Gospel of Mark was the first one to be written down. It is dated to the 40s, or perhaps 50s AD. The gospels of Luke and Mark used it as a source. But Matthew did not simply copy Mark, he used the text to show that Jesus had his place in Jewish tradition. He also included details that cannot be found in the Gospel of Mark. In addition, Matthew probably used a collection of sayings, known as the Q source, which is now lost. == Related pages == * Bible * Beatitudes * Bethlehem * Magi == References == *1 Category:New Testament books",
 "title": "Gospel of Matthew"
}