{
 "id": "1000935",
 "text": "Atropa is a genus of flowering plants, in the nightshade family. They are herbaceous perennials, with large leaves, and shiny berries. These berries are particularly dangerous to children, because they look like cherries, but they are highly poisonous.A Colour Atlas of Poisonous Plants : A Handbook for Pharmacists, Doctors, Toxicologists, and Biologists by Frohne, Dietrich and Pfänder, Hans Jürgen of University of Kiel, translated from second German edition by Norman Grainger Bisset, London : a Wolfe Science Book and one of the volumes in the illustrated series Wolfe Atlases, pub. Wolfe Publishing Ltd. 1984. Atropa species prefer temperate climates and alkaline soils. They often grow in light shade in woodlands near limestone hills and mountains.Flora Europaea, Tutin T.G., Heywood V.H. and Burgess N.A. pub. Cambridge University Press 2010 Flora Iberica http://www.floraiberica.es/floraiberica/texto/pdfs/11_134_10_Atropa.pdf Their seeds can remain viable in the soil for long periods, germinating when the soil of sites in which plants once grew (but from which plants have long been absent) is disturbed by human activityHERRERA, C.M.(1987). Distribucion, ecologia y conservacion de Atropa baetica Willk. (Solanaceae) en la Sierra de Cazorla. Anales Jard. Bot. Madrid 43(2):387-398. http://dialnet.unirioja.es/descarga/articulo/2965654.pdf or by natural causes, e.g. the windthrow of trees.Flora Britannica pps. 300-301, Mabey, Richard, pub. Sinclair-Stevenson 1996 The best-known member of the genus Atropa is deadly nightshade (A. belladonna) - the poisonous plant par excellence in the minds of many. Atropa species contain chemicals that are used in medicine, such as atropine, scopolamine, and hyoscyamine. These are all tropane alkaloids that have anticholinergic, deliriant, antispasmodic and mydriatic properties. The genus is named for Άτροπος (Atropos) - lit. 'she who may not be turned (aside)' - one of the Three Fates and cutter of the thread of life / bringer of death. They are named after her because of the extreme toxicity of A. belladonna and its fellow species.The Biology and Taxonomy of the Solanaceae edited by Hawkes, J.G., Lester, R.N. and Skelding, A.D. (Linnean Society Symposium Series Number 7) Published for the Linnean Society of London by Academic Press 1979. In some older classifications, the mandrake (Mandragora officinarum) has been placed in the genus Atropa, with the scientific name Atropa mandragora. == References == Category:Solanaceae",
 "title": "Atropa"
}