{
 "id": "1000592",
 "text": "Harlan Hubbard (January 4, 1900 – January 16, 1988) was an American artist and writer. Hubbard was born in Bellevue, Kentucky, on January 4, 1900, across the Ohio River from Cincinnati, Ohio. His father died in 1907. In 1915, he and his mother went to New York City to live with two older brothers. He went to school at Childs High School in the Bronx. Then he studied art at the New York National Academy of Design. Later he went to the Art Academy of Cincinnati. Hubbard's wife, Anna Eikenhout, was born in Michigan on September 7, 1902. She was a musician who played the piano and cello. She read in three languages other than English. She taught college for a while, but moved to Cincinnati to work in the fine arts department at the public library. She met Hubbard there. They married in 1943 and lived for a short time in Fort Thomas, Kentucky. They lived for a while in a shack beside the river. Then, in 1944, they decided to live in a shanty boat (a small houseboat) and travel on the Ohio and Mississippi Rivers to New Orleans. They spent about five years doing this. At New Orleans they sold their boat and bought a car. They drove for the next ten months to see much of the American West. Then they went back to Kentucky in 1951 and bought seven acres of land in what was called Payne Hollow, across the Ohio River from Hanover and Madison, Indiana. The Hubbard's built a small house at Payne Hollow and lived there for the rest of their lives. They lived a very simple life that was not modern. They \"grew their own food, made their own furniture (except for a grand piano that Anna played each evening), and lived without electricity or running water.\" Harlan Hubbbard died of cancer in 1988 at age 88, about two years after his wife Anna. ==Works== * Shantyboat (1953, 1977) * Payne Hollow: Life on the Fringe of Society (1974, 1997) * Harlan Hubbard Journals, 1929-1944 (1987) * Oyo: An Ohio River Anthology with Don Wallis (1987) * Shantyboat on the Bayous (1990) * Shantyboat Journal (1994) * The Woodcuts of Harlan Hubbard: From the Collection of Bill Caddell (1994) * Payne Hollow Journal (1996) * A Visit with Harlan Hubbard with Wade H. Hall (1996) * The Watercolors of Harlan Hubbard (2021) ==Related works== * Harlan Hubbard: Life and Work by Wendell Berry (1990) * Sonata at Payne Hollow: A Play by Wendell Berry (2001) ==References== Category:1900 births Category:1988 deaths Category:American painters Category:Writers from Kentucky",
 "title": "Harlan Hubbard"
}