{
 "id": "1000742",
 "text": "On February 3, 2023, a train accident happened in East Palestine, Ohio, at 8.55pm EST (UTC−5). A train carrying dangerous chemicals derailed. Several of the 38 railcars caught fire, and started to burn. Some burned for more than two days. Emergency crews burned several of them in a controlled fire. This fire released hydrogen chloride and phosgene into the air. Phosgene is used only in specially equipped plants. Today, it is used to produce certain plastics, and other chemicals, such as dyes. In the past, it was also used as a chemical weapon. For this reason, the residents within a radius were evacuated. Emergency response was started from agencies in Ohio, Pennsylvania, and West Virginia. East Palestine is about half way between Cleveland and Pittsburgh. == Background == The derailed train was running from Madison, Illinois to Conway, Pennsylvania, on the Fort Wayne Line. Aboard the train were an engineer, conductor, and conductor trainee. The train consisted of 141 loaded cars and 9 empty ones. Other reports say there was one more car, for a total of 151 cars, weighing 18,000 tons. Of those cars, 20 were carrying dangrous materials, including chloroethene (vinyl chloride), butyl acrylate, 2-ethylhexyl acrylate, ethylene glycol monobutyl ether, isobutylene, flammable liquids, and benzene residue. The train left Madison on February 1, and had had at least one mechanical failure before the derailment. == Derailment == Security footage from a business in Salem, Ohio ( northwest from East Palestine), and a Ring doorbell camera from New Waterford, Ohio ( northwest from East Palestine), show fire coming from underneath a rail car. After this, at around 8:55 pm EST on February 3, 2023, 51 cars derailed on the east side of town, near the border with Pennsylvania. 49 of the cars ended up in a derailment pile, which caught fire and burned for several days. Of the 51 derailed cars, 11 were tank cars which dumped 100,000 gallons of hazardous materials, including vinyl chloride, benzene residue, and butyl acrylate. For a list of related EPA documents, which includes this one, see About 48 hours later, the NTSB released a first report that stated that the derailment was caused by a mechanical problem on one of the railcars' trucks. This may be connected to reports that an axle was observed throwing sparks about an hour before. The crew received an alarm from a wayside defect detector shortly before the derailment indicating a mechanical problem, and then an emergency brake application initiated. == Emergency response and burn off == Nearly 70 emergency agencies from Ohio, West Virginia, and Pennsylvania mobilized in response. East Palestine Mayor Trent Conaway declared a state of emergency. Norfolk Southern personnel were first to respond on February 3. On February 4, they noticed water spillage into Sulphur Run and Leslie Run, and installed barriers to separate the floating pollutant. The U.S. Environmental Protection Agency (EPA) began monitoring air quality on February 3. They said humans can smell butyl acrylate at a concentration lower than the screening level (exposure limit). The National Institute for Occupational Safety and Health (NIOSH) recommended exposure limit for butyl acrylate is time-weighted average 10 ppm (55 mg/m3). On February 5, the temperature changed in one of the train cars. This caused fears of an explosion with the potential to disperse shrapnel as the fires continued to burn. Although five cars containing vinyl chloride remained intact after the crash, the relief valve on one of the cars had malfunctioned. Ohio Governor Mike DeWine activated the Ohio National Guard to assist local authorities in what he called \"a matter of life and death\". Pennsylvania Governor Josh Shapiro ordered an evacuation in areas of Beaver County which bordered the site. Officials in both states went door-to-door to evacuate residents. The fire from the accident burned until February 5. File:Air_monitoring_device_in_East_Palestine,_Ohio_(Uva9Xup).jpg|Air monitoring device File:Digging_up_the_creek_and_filtering_water.at_the_to_a_park_in_East_Palestine,_Ohio_(eBRpwim).jpg|Workers digging up a creek and filtering the water at the entrance to a park == Reactions == Commentary following the derailment centered around industry working conditions and safety concerns, such as the lack of modern brake safety regulations, the implementation of precision scheduled railroading (PSR), had reduced railway workers per train, and increased train lengths and weight. Critics said that train companies had failed to invest in train maintenance to prevent accidents, even though they conduct stock buybacks, in which money that could be used on maintenance and safety measures is instead distributed to shareholders. On February 14, Governor Mike DeWine told reporters that he was not seeing any problems in the area after the controlled release of chemicals and that President Joe Biden had offered federal assistance but DeWine said that no further assistance was necessary. == References == Category:2020s disasters in the United States Category:2023 disasters Category:2023 in the United States Category:2020s fires in the United States Category:Transport disasters in the United States Category:21st century in Ohio Category:February 2023 events Category:2023 fires",
 "title": "2023 Ohio train accident"
}