{
 "id": "1000743",
 "text": "Joseph Cornell (December 24, 1903 – December 29, 1972) was an American visual artist and film-maker. For his art, he did not paint or draw. He put together pictures and objects that he found. This kind of art is called \"collage\" and \"assemblage.\" He often arranged things inside of wooden boxes that he made himself. Cornell was born in Nyack, New York in 1903. He had two sisters. His younger brother Robert had cerebral palsy. After his father's death in 1917, the family moved to a house on Utopia Avenue in Bayside, Queens in New York City. He lived there from 1929 until he died in 1972. From 1917 to 1921, Cornell went to Phillips Academy in Andover, Massachusetts, but he did not graduate. After that, he worked as a salesman and, later, as a textile designer in New York. He walked around the city and found many things to collect in used bookstores and junk shops. In the 1930s he started making movies out of parts of other old movies. These and his collages and boxes were influenced by surrealism, an art and literature movement that made things that felt strange, like dreams. His first public show was in Surréalisme at the Julien Levy Gallery in 1932, along with art by Salvador Dali and Marcel Duchamp. Cornell died of a heart attack at home in 1972, a few years after the deaths of his mother and brother. ==Selected films== *Rose Hobart (1936) *Children's Party (c. 1940) *Cotillion (c. 1940) *The Midnight Party (c. 1940) *The Aviary (1955) *Gnir Rednow (1956) (made with Stan Brakhage) *Mulberry Street (1957) *Boys' Games (1957) *Centuries of June (1955) (made with Stan Brakhage) *Nymphlight (1957) *Flushing Meadows (c. 1965) (made with Larry Jordan) *A Legend for Fountains (1957–1965) *Bookstalls (1973) *By Night with Torch and Spear (1979) ==References== ==Other websites== * Joseph Cornell at the Art Institute of Chicago * Joseph Cornell at the Guggenheim Museum * Joseph Cornell at the Tate Museum * Joseph Cornell at the Museum of Modern Art * Joseph Cornell at The Royal Academy of Arts Category:1903 births Category:1972 deaths Category:American filmmakers Category:American artists",
 "title": "Joseph Cornell"
}