{
 "id": "1000020",
 "text": "The Iranic peoples in Turkey are mainly Kurds and Zazas and also Persians and Ossetians. ==Military == * Halid Beg Cibran (1882–1925) Kurd of Cibran tribe, he fought against Russo-Armenian forces in World War I, founding of Azadî organization later took part in the Kurdish nationalist Beytuşsebap and Sheikh Said rebellions and was executed in 1925 * Alisher Efendi (1882–1937) Kurd of Koçgiri tribe, he joined Russian army and fought against Turkish forces in World War I, member of Society for the Rise of Kurdistan, also an intellectual and poet, one of organizators of Koçgiri rebellion and one of the leaders of Dersim rebellion * Sheikh Mehmed Said (1865–1925) Zaza: \"During a routine search gendarmes were engaged in a gunbattle with a group loyal to Sheikh Mehmed Said (1865–1925), member of a Zaza family originally from Piran and revered sheikh of the Naqshbandi Sufi order.\" religious figure, leader of Kurdish nationalist Sheikh Said rebellion * Seyid Riza (1863–1937) Zaza of Abasan tribe, he saved Armenians during Armenian genocide, fought against Russo-Armenian forces in World War I, organizator of Dersim rebellion and was executed in 1925 * İhsan Nuri Pasha (1893–1976) Kurd of Jalali or Cibran tribe, founding member of Xoybûn, while he was a soldier in the Ottoman army, he participated in unsuccessful suppressing the Albanian revolts and Arab revolts in Yemen, fought against Russo-Armenian forces in World War I, then fought against the Armenians in Turkish war of Independence, and eventually led the Ararat revolt against the Turks, then went to Iran as a refugee == Politics == * Bekir Sami Kunduh (1867–1933) of Ossetian origin, served as the first Minister of foreign affairs of Turkey * Hikmet Çetin (b. 1937) of Kurdish origin,\"Joe Biden's misguided views on 'the Kurds' are a cause for concern\". TRT World. \"Before Kurdish-dominated parties, Turkey has been led by prime ministers, presidents and parliament speakers with Kurdish roots, which included Turgut Ozal, Bulent Ecevit and Hikmet Cetin, serving on both sides of the political spectrum.\" \"Hikmet Çetin'in Afghanistan görevi\". Hürriyet. \"Beni şaşırtan, Hikmet Çetin'in “Kürt Kökenli” bir siyasetçi olduğu haberinin gazetelerde yayınlanması. Dört dönem milletvekilliği yapan Hikmet Çetin'in “Kürt kökenli” olması CHP'de önemli görevler almasına, Türkiye Cumhuriyeti'nin Dışişleri Bakanı ve TBMM Başkanı olmasına engel olmamış...\" former minister of foreign affairs, leader of Republican People's Party and deputy prime minister * Mehdi Eker (b. 1956) of Kurdish origin,\"Mehdi Eker: Türkiye'de Kürt sorununu İttihatçı zihniyet çıkardı\". Milliyet. \"Kendisinin Diyarbakırlı olduğunu söyleyen Mehdi Eker, “Ben Diyarbakırlıyım. Ben Kürdüm. Kürtlerin, örfünü de geleneklerini de değerlerini de biliyorum. Onlara sahibim, onlara saygılıyım ve onları yaşıyorum. Bu dönem partim İstanbul ‘da aday gösterdi. Bu da benim için büyük onur” şeklinde konuştu.\" former minister of agriculture and forestry * Bekir Bozdağ (b. 1965) of Kurdish origin,\"Yeni başbakan bir Kürt mü?\". Rûdaw. \"Türkiye’de yeni başbakanın, Yozgatlı Kürt Bekir Bozdağ olacağı iddia edildi. [...] Recep Tayyip Erdoğan, başbakan olduğu 2012’de, Çin gezisinin son gününde medyaya şunları söylemişti: “Bütün etnik yapıları kuşatan bir partiyiz. 60 civarında Kürt kökenli milletvekili arkadaş var. Kabinemde 5 bakan arkadaşım Kürt. Süs eşyası diye taşımıyorum. Bekir Bey (Bekir Bozdağ) Kürt’tür.\" \"Türkiye'de yeni kabine: 3 Kürt bakan/Babacan liste dışı/Erdoğan'ın damadı Enerji Bakanı\". Rûdaw. \"Listede Başbakan Yardımcısı Mehmet Şimşek, Kalkınma Bakanı Cevdet Yılmaz ve Adalet Bakanı Bekir Bozdağ Kürt bakanlar olarak göze çarpıyor.\" current minister of justice * Cevdet Yılmaz (b. 1967) of Zaza origin, former minister of state, development and deputy prime minister * Mehmet Şimşek (b. 1967) of Kurdish origin,\"Kabineye 4 Kürt, 1 Zaza\". Hürriyet. \"Yeni Gıda ve Tarım Bakanı Kutbettin Arzu’nun yanı sıra Maliye Bakanı Mehmet Şimşek ve AB Bakanı Ali Haydar Konca’nın Kürt, Başbakan Yardımcısı Cevdet Yılmaz’ın ise Zaza olduğu biliniyor.\" former minister of finance and deputy Prime minister * Bülent Ecevit (1925–2006) of partial Kurdish origin,\"Kürt kökenli olabilirim\". Akşam. \"Yani ben Kürt kökenli olduğumuzu duydum, öğrendim. Ama babam da böyle şeylere izin vermediği için, bu konuları bana hiç açmadı, açmazdı. O da sonuna kadar Türkiye Cumhuriyeti'ne bağlı ve cumhuriyetin bütün değerlerini paylaşan biriydi. Merhum olmadan önce kendisine bunu sormamıştım. Ona soramadım. Ama eminim ona sorsaydım 'evet' derdi.\" \"Joe Biden's misguided views on 'the Kurds' are a cause for concern\". TRT World. \"Before Kurdish-dominated parties, Turkey has been led by prime ministers, presidents and parliament speakers with Kurdish roots, which included Turgut Ozal, Bulent Ecevit and Hikmet Cetin, serving on both sides of the political spectrum.\" former prime minister, he consiered on of the significant politicians in Turkey * Kutbettin Arzu (b. 1955) of Kurdish origin, former minister of agriculture and forestry * Turgut Özal (1927–1993) of partial Kurdish origin,\"Joe Biden's misguided views on 'the Kurds' are a cause for concern\". TRT World. \"Before Kurdish-dominated parties, Turkey has been led by prime ministers, presidents and parliament speakers with Kurdish roots, which included Turgut Ozal, Bulent Ecevit and Hikmet Cetin, serving on both sides of the political spectrum.\" \"Turgut Özal'ı rahmetle anıyoruz\". Yeni Akit. \"Babası Malatya/Çırmıktı'lı Ünlüoğulları'ndan banka memuru Mehmet Sıddık Özal, annesi ise Tunceli Çemişgezekli, ilkokul öğretmeni Hafize Hanım (d. 1906 - ö. 1988) olan Turgut Özal kısmen Kürt kökenlidir.\" former prime minister and president, he consiered on of the significant politicians in Turkey == Related pages == * Iranic peoples in Turkey == References == == Sources == * * Category:Lists of people Category:Ethnic groups in Turkey Category:Turkey-related lists",
 "title": "List of Iranic peoples from Turkey"
}