{
 "id": "10005",
 "text": "Fiji is an island country in the Pacific Ocean. It has 322 islands. The most important islands are Vanua Levu and Viti Levu. The capital city and the city with the most people is Suva. There are about 844,330 people in Fiji. The official languages of Fiji are Fijian, English and Hindustani (a mix of Hindi and Urdu). Fiji is part of the Pacific Rim. About 313000 speak Fiji Hindi. In the 17th and 18th centuries, the Dutch and the British explored Fiji. Fiji was a British colony up until 1970; British occupation lasted almost a century. Fiji has many forest, mineral, and fish resources. ==Divisions and provinces== Fiji is divided into Four Major Divisions: * Central * Eastern * Northern * Western These divisions are divided into 14 provinces: * Ba * Bua * Cakaudrove * Kadavu * Lau * Lomaiviti Province * Macuata * Nadroga-Navosa * Naitasiri * Namosi * Ra * Rewa * Serua * Tailevu ==Cities== * Lautoka * Nadi * Nausori * Suva ==Incorporated towns== Fijian law defines \"towns\" as urbanized areas incorporated as municipal bodies, governed by Town Councils. * Ba * Labasa * Lami * Levuka * Savusavu * Sigatoka * Tavua * Rakiraki * Navua * Korovou ==Unincorporated towns== The following localities are urbanized, but have not been municipally organized. * Dreketi * Lomawai * Korolevu * Navua * Natumbua * Vatukoula * Nakasi, 9½ Miles ==Tourism== Fiji has a lot of tourism and many people go to the Nadi and Denarau islands.Fiji Travel Information and Travel Guide. Lonely Planet. Retrieved April 2010. Most visitors are from Australia, New Zealand and the USA.\"Arrivals information \" Bureau of Statistics. Fiji has many soft coral reefs. Scuba diving is a common tourist activity. More budget resorts are being opened in remote areas, which provides more tourism opportunities. ==Related pages== * Fiji at the Olympics * Fiji national football team * List of rivers of Fiji ==Other websites== * Pictures of Fiji * UN Fiji LESA - Association ==References== Category:Commonwealth member states Category:1970 establishments in Oceania Category:Archipelagos Category:English-speaking countries",
 "title": "Fiji"
}