{
 "id": "1000761",
 "text": "Mommie Dearest is a 1981 American biographical psychological drama movie directed by Frank Perry and starring Faye Dunaway, Steve Forrest, Mara Hobel, Diana Scarwid and Xander Berkeley. The movie shows Christina Crawford's adoptive mother, Hollywood actress Joan Crawford, as an abusive, controlling and manipulative mother. Christina and her brother Christopher are suffering child abuse from their mother. ==Cast== ==Production== The movie was adapted for the screen by Robert Getchell, Tracy Hotchner, Frank Perry, and Frank Yablans from Christina's 1978 autobiography of the same name. The executive producers were Christina's husband, David Koontz, and Terry O'Neill, Dunaway's then-boyfriend and soon-to-be husband. The movie was distributed by Paramount Pictures, the only one of the \"Big Eight\" movie studios for which Crawford had never appeared in a movie. ==Reception== The movie was not considered successful at the box office, making just over $19 million in North America from a $10 million budget. Despite receiving mostly negative reviews from movie critics, the movie's melodramatic script and Faye Dunaway's acting, made it a cult movie and an \"unintentional comedy\". It is often considered one of the worst movies ever made. It was nominated for nine Golden Raspberry Awards (Razzies) at the 2nd Golden Raspberry Awards, and won five, including \"Worst Picture\" and \"Worst Actress\" for Faye Dunaway. ==References== ==Other websites== * * * Category:American biographical movies Category:1980s biographical movies Category:1981 drama movies Category:1980s American drama movies Category:American psychological movies Category:1980s psychological movies Category:Paramount Pictures movies Category:Cult movies Category:Movies based on books Category:Movies about actors Category:Movies about child abuse Category:Movies about dysfunctional families Category:Movies about adoption Category:Movies set in Los Angeles Category:Movies set in California Category:Movies set in New York City Category:Movies set in the 1930s Category:Movies set in the 1940s Category:Movies set in the 1950s Category:Movies set in the 1960s Category:Movies set in the 1970s",
 "title": "Mommie Dearest (movie)"
}