{
 "id": "1000607",
 "text": "Joss paper is a type of paper that is burned as an offering during Chinese ancestral worship and in the worship of deities in Chinese folk religion. People believe it helps the dead get what they need in the afterlife. In Taiwan people spent US$400 million on Joss paper in 2014. Different types of spirit money are given to distinct types of spirits.衣紙2 There are three main types of joss paper: cash (also known as copper), silver, and gold. Cash paper is given to newly deceased and unknown spirits. Golden joss paper is offered to deities such as the Jade Emperor. Silver joss paper is given only to ancestral spirits and other spirits. It is important to follow these distinctions. If you burn the wrong paper, it may confuse spirits or insult them. Origin of name: \"It ... comes from the Portuguese [word,] deos\" ('God'),https://www.scmp.com/magazines/post-magazine/short- reads/article/3099183/how-we-got-joss-paper-and-joss-sticks-appease. Retrieved 2024-07-01 \"which in turn [comes from, or] derives from the Latin [word] deus\", according to media. == Pictures == == Related pages == * Zhong Yuan Festival * Ancestral tablet == Sources == * Adler, J. (2002). Chinese Religious Traditions. London: Laurence King Publishing, Ltd. * Asian Joss Paper: Rubber Trouble. Retrieved October 23, 2008 from http://rubbertrouble.com/joss.php * Burning of Joss Paper. Retrieved October 23, 2008 from https://web.archive.org/web/20070713050534/http://app.nea.gov.sg/cms/htdocs/article.asp?pid=720 * Feuchtwang, S. (2001). Popular Religion in China. Surrey: Curzon Press. * Gates, H. (1987, July). Money for the Gods. Modern China, 13(3), 259–277. Retrieved from JSTOR database. * Hell bank notes - Library - Collection - Studio - Collectors Software. Retrieved October 23, 2008 from * Joss Paper. Retrieved October 24, 2008 * Seaman, G. (1982 Fall). Spirit Money: An Interpretation. Journal of Chinese Religions. * Thompson, L. (1989). Chinese Religion. Belmont, California: Wadsworth Publishing Company. Category:Death customs Category:Bamboo",
 "title": "Joss paper"
}