{
 "id": "1001623",
 "text": "Tolulope Arotile (December 13, 1995 - July 14, 2020), also known as Tolulope Oluwatoyin Sarah Arotile, was Nigeria's first female combat helicopter pilot in the Nigerian Air Force. She was credited with fighting against insecurity in the northern states of Nigeria. On 29 July 2020, Isaiah Ogedegbe praised Arotile in his tribute, describing her as \"a young, brilliant, and brave lady with a promising future\". ==Birth, education and career== Tolulope Arotile was born in Kaduna, Nigeria on 13 December 1995 to the family of Mr and Mrs Akintunde Arotile, but she came from the Iffe area in Ijumu Local Government Area of Kogi State, Nigeria. She attended Air Force Primary School, Kaduna from 2000 to 2005 and Air Force Secondary School, Kaduna from 2006 to 2011 before she later gained admission into the Nigerian Defence Academy, Kaduna as a member of 64 Regular Course on 22 September 2012, where she got Bachelor of Science degree in Mathematics. Arotile had said she joined the military because of her love for the military. She had also said to be a military officer was her long time dream. She was commissioned into the Nigerian Airforce on 16 September 2017 as a member of the Nigerian Defence Academy Regular Course 64. She held a commercial pilot license and also underwent tactical flying training with the Agusta 109 Power Attack Helicopter in Italy. In October 2019, the Nigerian Air Force had decorated her as the first female pilot that the service would get in 55 years. ==Death and burial== On 14 July 2020, less than eight months since her decoration, Tolulope Arotile died at the age of 24 in Kaduna, Nigeria. The Nigeria President, the NAF, and the Nigerian masses were deeply touched by the news of her premature death resulting from a head injury she sustained in a car accident. She was buried on 23 July 2020. She was remembered as a good woman who could have impacted the lives of many young Nigerian girls and women in the future. ==References== Category:1995 births Category:2020 deaths Category:Nigerian military people Category:People from Kaduna State",
 "title": "Tolulope Arotile"
}