{
 "id": "1001130",
 "text": "Iain David McGeachy (11 September 1948 – 29 January 2009) was a Scottish singer, guitar player and songwriter. His stage name was John Martyn. He made music for over 40 years. He made 23 studio albums. Most of his music was folk rock and blues. Martyn started making music when he was 17. He was in the Scottish folk music community. His music was inspired by English folk music and American blues. He joined Island Records and started making albums. He started to make his music sound similar to jazz and rock. His most popular albums were Bless the Weather (1971), Solid Air (1973) and One World (1977). He made music with other people, such as Phil Collins. He kept making music until he died in 2009. == Career == === 1960s and 1970s === Martyn became a musician when he was 17. He played a mix of folk music and blues. This made him an important person in the British folk music community in the 1960s. In 1967, he joined Island Records, a record label. He released an album named London Conversation in 1967. One year later, he released The Tumbler. Martyn had a special way of playing the guitar. He played the acoustic guitar, but used many effect pedals with it. This made the guitar sound different. The first time he played the guitar in this way was on Stormbringer! in 1970. He made this album with his wife, Beverley Martyn. He made two albums with his wife. The second is named The Road to Ruin. In February 1973, Martyn released Solid Air. The song \"Solid Air\" was made for singer Nick Drake. The album sold many copies. In 2009, a new version of Solid Air was made. It had more songs on it. A few months later, he made Inside Out. This album was about improvised music. Later, he made more music. He visited Jamaica, and met Lee Perry. Perry was a music producer, and worked with Martyn to make new music. In 1977, he released One World. Many musicians helped Martyn make the album, such as Rico and Steve Winwood. Lee Perry helped him make the song \"Big Muff\". The album was influenced by dub music because of Perry.His obituary in The Times states that \"The record's dubby, echoing soundscapes have been claimed as the forerunner of the 'trip-hop' style that emerged in the 1990s.\" In 1978, he played guitar on Harmony of the Spheres by Neil Ardley. === 1980s and 1990s === At the end of the 1970s, Martyn's marriage got worse. Some say that this was because he was addicted to drugs and was an alcoholic.Obituary: \"John Martyn: guitarist and singer\" , The Times, 30 January 2009, pg. 75. Beverly said that John hurt her.Beverley Martyn, Jacki Dacosta, Sweet Honesty – The Beverley Martyn Story; , Grosvenor, 2011 Martyn said this was a \"very dark\" time in his life. Because of this, he made the album Grace and Danger. Phil Collins played the drums on the album. It was released in October 1980. Chris Blackwell, the owner of Island Records, did not want to release the album. This was because he was a good friend of Martyn and Beverley. He thought the album was too sad to release. Martyn wanted him to release the album, so he did. In the late 1980s, Martyn said Grace and Danger was his favorite album. It is one of his most popular albums. In 1981, Martyn left Island Records. He joined WEA, another record label. He made two more albums: Glorious Fool and Well Kept Secret. Both of these albums went into the top 30 on the UK Albums Chart. He left WEA after making the albums, and joined Island Records again. He made three albums with Island, and then left the record label again in 1988. Martyn joined Permanent Records and made two albums. These were The Apprentice (1990) and Cooltide (1991).Some People Are Crazy - the John Martyn Story - John Neil Munro (Polygon 2007) Phil Collins helped him make No Little Boy in 1993. This album had new versions of some of his older songs. In the late 1990s, Martyn started mixing his music with trip-hop. Some of his albums that had this type of music were And and Glasgow Walker. === 2000s === Martyn had to have his right leg amputated below the knee. This was because a cyst opened on his leg, and he got sepsis. In July 2006, BBC made a documentary named Johnny Too Bad about this time. The documentary was also about Martyn writing and making music for On the Cobbles. This was an album that was released in 2004. The album had a more acoustic sound. On January 29, 2009, Martyn died in Thomastown, County Kilkenny, Ireland. He died because of acute respiratory distress syndrome. He had been living in Thomastown with his wife, Theresa Walsh. Martyn was put in the Order of the British Empire in 2009. Walsh accepted the award at Buckingham Palace for him. His last studio album, Heaven and Earth, was finished in 2011. == Studio albums == * London Conversation (1967) * The Tumbler (1968) * Stormbringer! (1970) * The Road to Ruin (1970) * Bless the Weather (1971) * Solid Air (1973) * Inside Out (1973) * Sunday's Child (1975) * One World (1977) * Grace and Danger (1980) * Glorious Fool (1981) * Well Kept Secret (1982) * Sapphire (1984) * Piece by Piece (1986) * The Apprentice (1990) * Cooltide (1991) * Couldn't Love You More (1992) * No Little Boy (1993) * And (1996) * The Church with One Bell (1998) * Glasgow Walker (2000) * On the Cobbles (2004) * Heaven and Earth (2011) == Other websites == * Official website – johnmartyn.com * Big Muff – johnmartyn.info == References == Category:1948 births Category:2009 deaths Category:British guitarists Category:British folk musicians",
 "title": "John Martyn"
}