{
 "id": "1001195",
 "text": "Dheghom (Proto-Indo-European: *dʰéǵʰōm or *dʰǵʰōm; lit. 'earth'), or Plethwih (PIE: *pleth₂wih₁, lit. the 'Broad One'), is an Earth-goddess from Proto-Indo- European mythology. She is often called Mother Earth (*Dʰéǵʰōm Méh₂tēr), and is called vast (*pleth₂wih₁) and dark (*dʰengwo-) . She represents the place where people and animals live. She takes care of everything and everyone, like plants and animals. She is often thought of together with Dyēus, who is the god of the sky and where the other gods live. They are different but work together. Dyēus can make it rain which helps things grow and makes people happy. People who speak certain languages believe that the Mother Earth helps things grow and die. They think she is where people come from and where they go when they die. == Name and etymology == The word for 'earth' in Proto-Indo- European is *dʰ(é)ǵʰōm. This word is found in many different languages that come from Proto-Indo-European. For example, it is in Albanian dhe and toka, Hittite tēkan and tagān, Sanskrit kṣám, Greek khthṓn, Latin humus, Avestan zam, Tocharian tkaṃ, Old Irish dú, Lithuanian žẽmė, and Old Slavonic zemlja. This is why it is considered to be one of the most certain words we know from Proto-Indo-European.. However, there isn't much proof from language that the name *Dheghom was used for rituals. In fact, she was also known by other names, such as *Pleth₂-wih₁ (the 'Broad One'). But these other names aren't found as much in the different languages that came from Proto-Indo-European. If we can trust that the Earth-goddess in Proto-Indo-European was called Dheghom and that Plethwih was one of her nicknames, it's likely that people thought of her as the Earth as a god-like being, not just a goddess who ruled over the Earth. This is because Proto-Indo-European mythology was strongly influenced by animism, which means people believed that everything had a spirit or soul. == Other websites == * piereligion.org page == Footnotes == == Sources == ==Bibliography== * * * * * * * * * * * * * * * * * * * * * * * * * * * == Further reading == Category:Paganism Category:European mythology Category:Proto-Indo-European gods and goddesses Category:Pages with unreviewed translations",
 "title": "Dheghom"
}