{
 "id": "1001368",
 "text": "When talking about journalism, a listicle in an article that is published as a list. The titles of such articles will usually contain a number, and often a superlative: \"The 10 most important things...\", \"The 30 best places...\" are examples of such titles. The article will then give this numbered list, and often also an explanation, for each item. Many of these listicles are presented in a count-down order, so that the best item is at the end. This also implies a ranking. Other listicles give no ranking directly, and simply discuss the items, perhaps gropuing them by theme: \"20 things to do in ..\".The word is a portmanteau derived from list and article. The word is similar to \"popsicle\". This stresses the fun but \"not too nutritious\" nature of the listicle. Listicles also have the benefit that they can be produced more rapidly than in-depth articles or essays, which may require a lot of research. ==Media== While conventional reportage and essay-writing often require the careful crafting of narrative flow, the building-block nature of the listicle lends itself to more rapid production. It can also be a means of \"recycling\" information, as often it is the context, not the content, that is original. For example, one can construct a listicle by adding captions to YouTube clips. For these reasons, the form has come under criticism as a \"kind of cheap content-creation\". > It's so easy you wonder why everyone doesn't do it until you realize that > now it's all they do: Come up with an idea (\"Top 10 Worst [X]\") on the L > train ride to the office that morning, [and] slap together 10 (or 25, or > 100) cultural artifacts ripe for the kind of snarky working over that won't > actually tax you at all as a writer/thinker. The blogger and technologist Anil Dash has disparaged the proliferation of listicles, particularly within the blogosphere, characterizing them in 2006 as the \"geek equivalents of Cosmo coverlines\". Nevertheless, the form remains a mainstay of the newsstand and of the web. The covers of magazines such as Cosmopolitan and Men's Journal regularly sport at least one, if not several listicles. Some websites, such as BuzzFeed, generate hundreds of listicles daily. == History == Alex Johnson, writing for The Independent, suggested that an 1886 speech by Sir John Lubbock which gave a list of around 100 books \"which on the whole are perhaps best worth reading\" was an early form of listicle, and that Lubbock should be considered the 'godfather' of the format. Steven Poole suggested that listicles have literary precursors like Jorge Luis Borges's \"The Analytical Language of John Wilkins\". He also compares it to more high-art versions like Umberto Eco's The Infinity of Lists, a book composed entirely of lists. In 2009, posts in the format \"25 Random Things About Me\" became an Internet meme, starting on Facebook but spreading to the broader web, and attracting considerable media coverage in the process. ==References== ==Other websites== * * What Is a Listicle?, by Jo Christy * 23 Reasons Why We Should Snort at Listicles, by Alfred A. Yuson Category:Journalism Category:Lists",
 "title": "Listicle"
}