{
 "id": "1001915",
 "text": "The Uplift Mofo Party Plan is the third studio album by Red Hot Chili Peppers. Red Hot Chili Peppers is an American rock band. The album was released by Manhattan Records on September 29, 1987. The Uplift Mofo Party Plan is the band's only album that has the founding members on every song. These people are singer Anthony Kiedis, bass guitar player Flea, guitar player Hillel Slovak and drummer Jack Irons. This is the last Red Hot Chili Peppers album with Slovak on it. This is because he died from a drug overdose in 1988. The album had one single. It is named \"Fight Like a Brave\". In 1992, \"Behind the Sun\" was released as a single as well. This was because it was on What Hits!?, a greatest hits album. The album was much more successful than the band's first two albums. It was the band's first album to go on the Billboard 200 music chart. The Uplift Mofo Party Plan was certified gold by the RIAA. The band went on tour to make the album more popular. Slovak died after the tour. Because of this, Irons left the band.Kiedis, Sloman, 2004. p. 224 == Background == Red Hot Chili Peppers joined EMI in 1983. After the band did this, Hillel Slovak and Jack Irons left the band. They did this so they could focus on their other band, What Is This?. The other members of the Chili Peppers, Anthony Kiedis and Flea, got new members to join. They hired Jack Sherman and Cliff Martinez. The band made an album in 1984 named The Red Hot Chili Peppers. Kiedis and Flea did not like how the album sounded.(2002) \"Behind the Music: Red Hot Chili Peppers episode\". VH1. They replaced Sherman with Slovak, because Slovak left What Is This? a few weeks earlier. Freaky Styley (1985) was the band's first album with Slovak on it. In early 1986, the band started working on their next album. EMI gave the Chili Peppers $5,000 to make a demo tape. The band worked with Keith Levene, one of the original members of the Clash, to make the album.Kiedis, Sloman, 2004. p. 187 Levene and Slovak saved $2,000 dollars from the money to spend on drugs. They did not tell this to the rest of the band. This made the other members mad. Kiedis and Flea fired Martinez. After this, they hired Jack Irons again.Kiedis, Sloman, 2004. p. 188 Kiedis and Slovak were addicted to heroin. Their addictions got worse as the band was making The Uplift Mofo Party Plan. Kiedis was not helping the band make much music because of his addiction.Kiedis, Sloman, 2004. p. 191 He was asked to leave the band to go to a treatment place. While he was there, the band won the LA Weekly Band of the Year Award. Because of this, Kiedis decided to stop using heroin. He visited his mother in Michigan, and she took him to another treatment place owned by the Salvation Army.Kiedis, Sloman, 2004. p. 193 He lived with his mother after being treated for 20 days. It was the first time he was not using drugs since he was 11 years old.Kiedis, Sloman, 2004, p. 198 After he was done, Kiedis felt much better. He wrote the lyrics to \"Fight Like a Brave\" while on an airplane going back to Los Angeles.Kiedis, Sloman, 2004. p. 200 He joined the band again to record the album. == Recording == While Kiedis was getting treated, the band wanted to get a new producer. Michael Beinhorn was looking for work at EMI after he had produced other music. None of it was very successful. A man from EMI talked to Beinhorn, and asked him to work with the Red Hot Chili Peppers.Mullen, 2010. p. 161 Beinhorn liked the band's music and how they acted. He wanted to meet the band. They told him to meet them at a club in New Orleans named Tipitina's. Beinhorn decided to work with the band. Kiedis talked to Beinhorn about how the album was going to be made. Kiedis wanted to record the album in ten days, and write the songs during this time.Kiedis, Sloman, 2004. p. 201 The album was recorded in Capitol Studios Studio B in Hollywood. Kiedis was having withdrawal while making the album, and did not make as much music as he did before. After not doing drugs for fifty days, he decided to take drugs again because he made new music. This made him addicted to drugs again. Making the album was difficult, because Kiedis left many times to find drugs. Beinhorn said that he \"really thought the record wasn't gonna get made.\"Mullen, 2010. p. 164 Kiedis felt bad whenever he was not recording music with the band, so he tried to write music and find drugs at the same time. The band was not happy that he was using drugs and did not show up to make music. However, they were impressed with how much music he wrote.Kiedis, Sloman, 2004. p. 205 The band had fun recording the album. They were inspired by Jack Irons being in the band again. Beinhorn wanted the band to do different things with the music on the album. Although the band wanted to make the same type of music they already made, they later thought Beinhorn was helping them make better music. Slovak helped Kiedis record his singing on the album. In between recording songs, Slovak ran around and said \"This is the most beautiful thing we've ever done.\"Kiedis, Sloman, 2004. p. 206 During a jam session, Slovak made a guitar riff that sounded different from the band's music. Slovak almost stopped using the riff because it was very different from the music the band had already made. However, Beinhorn helped him make it into a full song. Every member of the band started making music for it. The song became one of the album's singles. It was named \"Behind the Sun\".Kiedis, Sloman, 2004. p. 204 == Music == While the album was being made, Beinhorn told Kiedis to rap less, and sing more. At the time, Kiedis did not like his singing voice. He also thought the new style was too cliché. On The Uplift Mofo Party Plan, Slovak played music that was different from funk, such as reggae and extreme metal. Slovak used a talk box on the song \"Funky Crime\".Kiedis, Sloman, 2004. p. 112 He sang into a tube to use the talk box. This let him make different sounds while playing the guitar. Flea used a different style of playing the bass guitar on the album. He would slap the strings to make different sounds. This was something he did on many of the band's other albums. The album has a cover version of \"Subterranean Homesick Blues\" by Bob Dylan. It is in a Red Hot Chili Peppers style. Many of the lyrics on the album were about the band members, sex, and life in Los Angeles. Many of the lyrics were inspired by Slovak, Kiedis, Flea and Irons being in the band again. They were happy that they could make music together again.Mullen, 2010. p. 161 Kiedis was also inspired by his own life when writing music. While the band was making Freaky Styley, Kiedis and Slovak used cocaine a lot. When Slovak was high, he would wear brightly colored clothes and dance in a weird way. This inspired the song \"Skinny Sweaty Man\". The song \"No Chump Love Sucker\" was also inspired by Slovak. While the album was being made, Slovak's girlfriend left him. She started dating someone who had \"more money and more drugs\".Kiedis, Sloman, 2004. pp. 203–204 The band made the song about this. \"Funky Crime\" was inspired by a conversation between the band and George Clinton. Clinton was the producer for Freaky Styley. Kiedis said that the song was a description of the conversation. It is about how music is \"color-blind\" but it separated by the media based on what it thinks about musicians.Kiedis, Sloman, 2004. p. 203 Kiedis wrote \"Me and My Friends\" while driving home from San Francisco with his friend Joe Walters. \"Backwoods\" is about the history of rock and roll. Kiedis said that \"Love Trilogy\" is one of the band's favorite songs. It is about loving things that are not perfect. == Release == EMI did not want to release the album unless the band changed the name of the song \"Party on your Pussy\". The band renamed the song to \"Special Secret Song Inside\".Kiedis, Sloman, 2004. p. 203 The Uplift Mofo Party Plan was released on September 29, 1987. It got to number 148 on the Billboard 200. This was much more successful than the band's other albums. It was the band's first album on the Billboard 200. The album has been certified gold in the United States. The band made a music video for the song \"Fight Like a Brave\". This was the album's main single. It did not go on any Billboard charts. \"Behind the Sun\" was released as a single in 1992. It was released for a compilation album named What Hits!?. It got to number 7 on the Billboard Alternative Songs chart. The album also helped Red Hot Chili Peppers get more fans in Los Angeles. One of these fans was John Frusciante.Mullen, 2010. p. 108 He later joined the band to play the guitar after Slovak died. Frusciante's way of playing the guitar was inspired by Slovak.Apter, 2004, p. 181. == Concert tour and Slovak's death == The band went on a long concert tour for the album. They went to many different countries for it. The band noticed that there were more people at their concerts. Kiedis said that the fans had more energy as well.Mullen, 2010. p. 165 Flea said that \"We were in love with those songs and how much fun we were having playing them.\" The band was happy that they had more fans. However, Kiedis and Slovak were still addicted to drugs. Both of them stopped using heroin before the tour. They helped each other not use the drug.Kiedis, Sloman, 2004. p. 208 During the tour, both of them had drug withdrawal. Slovak had much worse symptoms than Kiedis. He was worse at playing the guitar because of his withdrawal. At one concert, Slovak had a mental breakdown and did not play the guitar.Kiedis, Sloman, 2004. p. 216 The band played the concert without Slovak. They did not have anyone playing the guitar. Slovak got better, but the band did not want it to happen again. They hired DeWayne McKnight to play guitar at a few concerts.Kiedis, Sloman, 2004. p. 219 After a few days playing with McKnight, the band wanted to let Slovak play again. He played with the band at many concerts in Europe. Kiedis tried to get a counselor for Slovak to help him. However, Slovak did not think his addiction was bad enough to need treatment.Kiedis, Sloman, 2004. p. 221 When the band came back to Los Angeles, Slovak stayed away from the other members of the band. When he was not getting support from his friends, Slovak had trouble avoiding drugs. A few weeks after the band got to Los Angeles, they tried to find Slovak. They could not find him for many days. Slovak was found dead by police in his apartment on June 27, 1988. He died because of a heroin overdose. Irons left the band because of Slovak's death. He said he did not want to be in a group his friends were dying in. Kiedis and Flea did not know if they should keep making music. They decided to make more music to continue what Slovak \"helped build\".Kiedis, Sloman, 2004. p. 224 The two hired John Frusciante. Frusciante was a fan of the Chili Peppers, and liked how Slovak played the guitar. The group also needed a new drummer, because Irons left. They hired Chad Smith. == Track listing == ==Credits== Red Hot Chili Peppers *Anthony Kiedis – lead vocals *Hillel Slovak – guitar, sitar (on \"Behind the Sun\"), vocoder, backing vocals *Flea – bass, backing vocals *Jack Irons – drums, backing vocals Other musicians *Michael Beinhorn – background vocals *John Norwood Fisher – background vocals *David Kendly – background vocals *Angelo Moore – background vocals *Annie Newman – background vocals Production *Michael Beinhorn – production *Russell Bracher – mixing assistant *Judy Clapp – recording engineer *Stan Katayama – mixing assistant *John Potoker – mixing *Howie Weinberg – mastering engineer Design *Nels Israelson – photography *Henry Marquez – art *Gary Panter – cover art ==Certifications== == References == ===Books=== * * * ==Other websites== * Category:1987 albums Category:Red Hot Chili Peppers albums Category:Rock albums",
 "title": "The Uplift Mofo Party Plan"
}