{
 "id": "1001767",
 "text": "Dr. David Gunn was a medical doctor, specialized in gynecology and obstetrics. On March 10, 1993, Michael Frederick Griffin shot and killed Dr. Gunn, in Pensacola, Florida. It was the first documented killing of an obstetrics and gynaecology doctor where the killer said he wanted to prevent a doctor from performing abortions in an act of anti-abortion violence in the United States. A jury deliberated three hours before finding Griffin guilty on March 4, 1994. He was sentenced to 25 years to life in prison, which he is serving at Okaloosa Correctional Institution in Crestview, Florida.Florida DoC Details , dc.state.fl.us; accessed November 6, 2014. In November 2017, the Florida Commission on Offender Review set Griffin's tentative release date for March 4, 2043. Griffin can have his release date reviewed in 2024, and additional reviews after no more than 7 years. == Shooting == On March 10, 1993, anti- abortion protesters had been demonstrating in front of Gunn's Pensacola Women's Medical Services clinic. Griffin waited outside, then ambushed Gunn by shooting him three times in the back with a shotgun, shouting \"Don't kill any more babies\" before opening fire. Griffin did not deny his actions after shooting Gunn and told police \"We need an ambulance.\" == Aftermath == Griffin claimed to be acting on behalf of God. During his trial, Griffin's lead defense attorney, Robert Kerrigan, argued that anti-abortion activist John Burt had brainwashed Griffin and drove him to commit murder. At the time, Burt was the Northwest Florida regional director of the national pro-life group Rescue America. Burt was also a former member of the Ku Klux Klan and self- professed \"spiritual adviser\" to a group of activists who bombed three abortion clinics in 1984. A jury deliberated three hours before finding Griffin guilty on March 4, 1994. The murder was one of reasons why in 1994 the federal Freedom of Access to Clinic Entrances Act was passed.\"Griffin trial first test of access laws\", Palm Beach Post, October 3, 1994. From March 1993 through May 2009, Gunn was the first of a total of four doctors murdered by anti-abortion extremists. Others killed were doctors Barnett Slepian, John Britton and George Tiller. Gunn's murder helped lead to the passage of the Freedom of Access to Clinic Entrances Act. Gunn's murder also prompted Paul Jennings Hill to issue the Defensive Action Statement,First Defensive Action Statement , armyofgod.com; accessed November 6, 2014. signed by 30 anti- abortion leaders, which stated their belief that the killing of doctors who perform abortions was justified. Hill went on to murder physician John Britton and Britton's bodyguard in 1994. == References == Category:Abortion Category:1990s murders in the United States Category:Deaths by person in the United States Category:Religious terrorism",
 "title": "Murder of David Gunn"
}