{
 "id": "1001289",
 "text": "Rutanya Alda (born Rūta Skrastiņa; October 13, 1942) is a Latvian-American actress. ==Life== Rutanya Alda was born Rūta Skrastiņa in Riga, in German- occupied Latvia, the daughter of Vera (née Ozoliņa), a businesswoman, and Jānis Skrastiņš, a poet.Rutanya Alda Biography Alda, her grandmother, her mother and her brother spent seven years in a refugee camp in Allied-occupied Germany after World War II. She then moved with her family to the United States, briefly living in Chicago before settling in Flagstaff, Arizona. == Career == She began her career in the late 1960s, and went on to have supporting movie roles in The Deer Hunter (1978), Rocky II (1979), and Mommie Dearest (1981). She also appeared in a lead role in the horror movies Amityville II: The Possession and Girls Nite Out (both 1982). She was nominated for the Golden Raspberry Awards (Razzies) as \"Worst Supporting Actress\" two years in succession (1982 and 1983) for Mommie Dearest and Amityville II: The Possession. She has also won a Clio Award and is a member of the Academy of Motion Picture Arts and Sciences. ==Personal life== She was married to actor Richard Bright from 1977 until his death in 2006, when he was hit by a bus in New York City. They had one son, Jeremy. ==Filmography== ===Movies=== Year Title Role Notes 1968 Greetings Linda (Shoplifter) 1970 Hi, Mom! Member of audience ('Be Black Baby' section) 1970 The People Next Door Nurse 1971 The Panic in Needle Park Admitting Nurse 1973 The Long Goodbye Rutanya Sweet 1973 Scarecrow Woman in Camper 1973 Pat Garrett and Billy the Kid Ruthie Lee 1973 Blume in Love Welfare Client Uncredited 1974 Can Ellen Be Saved? Rachael Television movie 1976 Deadly Hero 1976 Next Stop, Greenwich Village Party Guest Uncredited 1976 Swashbuckler Bath Attendant 1978 The Fury Kristen 1978 The Deer Hunter Angela 1979 Rocky II Doctor Cooper 1979 When a Stranger Calls Mrs. Mandrakis 1980 Christmas Evil Theresa Credited as Ratanya Alda 1981 Mommie Dearest Carol Anne 1982 Girls Nite Out Barney / Katie Cavanaugh 1982 Amityville II: The Possession Dolores Montelli 1983 Vigilante Vickie Marino 1984 Racing with the Moon Mrs. Nash 1985 Rappin' Cecilia 1985 The Stuff Psychologist 1987 Black Widow Irene 1987 Hotshot Georgia Kristidis 1988 Apprentice to Murder Elma Kelly 1988 Winnie Mrs. Paretti Television movie 1989 Last Exit to Brooklyn Georgette's Mother 1989 Gross Anatomy Mama Slovak 1989 Prancer Aunt Sarah 1990 Rainbow Drive Marge Crawford Television film 1992 Article 99 Ann Travis 1992 Leaving Normal Palmer Hospital Nurse 1993 The Dark Half Miriam Cowley 1993 Children of the Mist Sue Madehearst 1994 The Ref Linda 1994 Safe Passage Beth 1996 Innocent Victims Lorraine Taylor Television movie 1996 Double Jeopardy Gabriel Neuland Television movie 1997 American Perfekt Gloria 1997 Steel Mrs. Hunt 1998 The Souler Opposite Thea's Mom 2001 My First Mister Woman at Apartment 2001 The Glass House Vice Principal 2003 Love Comes Softly Wanda Marshall Television movie 2004 Murder Without Conviction Virginia McAlpin Television movie 2005 Mystery Woman: Snapshot Marsha Television movie 2005 Detective Judge Beatrice Agannis Television movie 2009 Handsome Harry Mrs. Schroeder 2009 Stolen Older Sally Ann 2010 You Don't Know Jack Vendor Television movie 2010 Unring the Bell Belle Short movie 2011 Return Mrs. Miller 2011 Too Big to Fail Admiral Evans Television movie 2014 Late Phases Gloria Baker 2015 Ovum Barbara 2016 Split Melissa ===Television series=== ===Web=== *Old Dogs & New Tricks (2014–16) – Barbara Fiere ==References== ==Other websites== * * Category:1942 births Category:Living people Category:20th-century American actors Category:21st-century American actors Category:American movie actors Category:American television actors Category:Latvian movie actors Category:Refugees Category:Actors from Riga",
 "title": "Rutanya Alda"
}