{
 "id": "1002733",
 "text": "The Turkish War of Independence (also known as the Turkish War of Liberation) was a military conflict between the Turkish National Movement and the Allied Powers after World War I. The war lasted from 1919 to 1923. It established the Republic of Turkey in 1923. After World War I, the Ottoman Empire was partitioned by the victorious Allied Powers. The Treaty of Sèvres, signed in 1920, stripped the Ottoman Empire of its territories and imposed severe restrictions on its sovereignty. Mustafa Kemal Atatürk, a former Ottoman military commander, led a national movement to resist foreign occupation and defend Turkish independence. The Turkish National Movement fought a successful campaign against the Allied Powers and their local proxies, including the Armenian, Greek, and French forces. There were several key battles, including the Battle of the Sakarya in 1921 and the Battle of Dumlupınar in 1922. In 1922, the Turkish National Movement launched a major offensive that pushed the Greek forces out of western Anatolia. This victory paved the way for the signing of the Treaty of Lausanne in 1923. That recognized the independence of the Republic of Turkey and established its modern borders. Mustafa Kemal Atatürk became the first president of Turkey. He oversaw a series of sweeping reforms to modernize the country and transform it into a secular, democratic state. The Turkish War of Independence is a significant event in Turkish history. It marked the end of the Ottoman Empire and the beginning of a new era in Turkish history, characterized by secularism, modernization, and a strong sense of national identity. The demographics of Anatolia was mainly effected by the massacres during the war. * Üngör, Uğur Ümit (2011). The Making of Modern Turkey: Nation and State in Eastern Anatolia, 1913–1950. Oxford University Press. p. 121. ISBN 978-0-19-965522-9. As such, the Greco- Turkish and Armeno-Turkish wars (1919–23) were in essence processes of state formation that represented a continuation of ethnic unmixing and exclusion of Ottoman Christians from Anatolia. Kieser, Hans-Lukas (2007). A Quest for Belonging: Anatolia Beyond Empire and Nation (19th-21st Centuries). Isis Press. p. 171. ISBN 978-975-428-345-7. Archived from the original on 15 January 2023. Retrieved 4 May 2021. The Treaty of Lausanne in 1923 officially recognized the \" ethnic cleansing \" that had gone on during the Turkish War of Independence ( 1919 - 1922 ) for the sake of undisputed Turkish rule in Asia Minor . Avedian, Vahagn (2012). \"State Identity, Continuity, and Responsibility: The Ottoman Empire, the Republic of Turkey and the Armenian Genocide\". European Journal of International Law. 23 (3): 797–820. doi:10.1093/ejil/chs056. ISSN 0938-5428. Archived from the original on 7 May 2021. Retrieved 14 April 2021. The 'War of Independence' was not against the occupying Allies – a myth invented by Kemalists – but rather a campaign to rid Turkey of remaining non-Turkish elements. In fact, Nationalists never clashed with Entente occupying forces until the French forces with Armenian contingents and Armenian deportees began to return to Cilicia in late 1919. Kévorkian, Raymond (2020). \"The Final Phase: The Cleansing of Armenian and Greek Survivors, 1919–1922\". In Astourian, Stephan; Kévorkian, Raymond (eds.). Collective and State Violence in Turkey: The Construction of a National Identity from Empire to Nation-State. Berghahn Books. p. 165. ISBN 978-1-78920-451-3. The famous 'war of national liberation', prepared by the Unionists and waged by Kemal, was a vast operation, intended to complete the genocide by finally eradicating Armenian, Greek, and Syriac survivors. Gingeras, Ryan (2016). Fall of the Sultanate: The Great War and the End of the Ottoman Empire, 1908-1922. Oxford University Press. p. 288. ISBN 978-0-19-967607-1. While the number of victims in Ankara's deportations remains elusive, evidence from other locations suggest that the Nationalists were as equally disposed to collective punishment and population politics as their Young Turk antecedents... As in the First World War, the mass deportation of civilians was symptomatic of how precarious the Nationalists felt their prospects were. Kieser, Hans-Lukas (2018). Talaat Pasha: Father of Modern Turkey, Architect of Genocide. Princeton University Press. pp. 319–320. ISBN 978-1-4008-8963-1. Thus, from spring 1919, Kemal Pasha resumed, with ex- CUP forces, domestic war against Greek and Armenian rivals. These were partly backed by victors of World War I who had, however, abstained from occupying Asia Minor. The war for Asia Minor— in national diction, again a war of salvation and independence, thus in- line with what had begun in 1913— accomplished Talaat's demographic Turkification beginning on the eve of World War I. Resuming Talaat's Pontus policy of 1916– 17, this again involved collective physical annihilation, this time of the Rûm of Pontus at the Black Sea. Lay summary in: Kieser, Hans-Lukas. \"Pasha, Talat\". 1914-1918-online. International Encyclopedia of the First World War. Levene, Mark (2020). \"Through a Glass Darkly: The Resurrection of Religious Fanaticism as First Cause of Ottoman Catastrophe\". Journal of Genocide Research. 22 (4): 553–560. doi:10.1080/14623528.2020.1735560. ISSN 1462-3528. S2CID 222145177. Ittihadist violence was as near as near could be optimal against the Armenians (and Syriacs) and in the final Kemalist phase was quantitively entirely the greater in an increasingly asymmetric conflict where, for instance, Kemal could deport \"enemies\" into a deep interior in a way that his adversaries could not..., it was the hard men, self-styled saviours of the Ottoman-Turkish state, and – culminating in Kemal – unapologetic génocidaires, who were able to wrest its absolute control. Ze'evi, Dror; Morris, Benny (2019). The Thirty-Year Genocide: Turkey's Destruction of Its Christian Minorities, 1894–1924. Cambridge, MA: Harvard University Press. p. 672. ISBN 9780674916456. Levon Marashlian, \"Finishing the Genocide: Cleansing Turkey of Armenian Survivors, 1920-1923,\" in Remembrance and Denial: The Case of the Armenian Genocide, ed. Richard Hovannisian (Detroit: Wayne State University Press, 1999), pp. 113-45: \"Between 1920 and 1923, as Turkish and Western diplomats were negotiating the fate of the Armenian Question at peace conferences in London, Paris, and Lausanne, thousands of Armenians of the Ottoman Empire who had survived the massacres and deportations of World War I continued to face massacres, deportations, and persecutions across the length and breadth of Anatolia. Events on the ground, diplomatic correspondence, and news reports confirmed that it was the policy of the Turkish Nationalists in Angora, who eventually founded the Republic of Turkey, to eradicate the remnants of the empire's Armenian population and finalize the expropriation of their public and private properties.\" Marashlian, Levon (1998). \"Finishing the Genocide: Cleansing Turkey of Armenian Survivors, 1920-1923\". In Hovannisian, Richard G. (ed.). Remembrance and Denial: The Case of the Armenian Genocide. Detroit: Wayne State University Press. pp. 113–45. ISBN 978-0-8143-2777-7. Between 1920 and 1923, as Turkish and Western diplomats were negotiating the fate of the Armenian Question at peace conferences in London, Paris, and Lausanne, thousands of Armenians of the Ottoman Empire who had survived the massacres and deportations of World War I continued to face massacres, deportations, and persecutions across the length and breadth of Anatolia. Events on the ground, diplomatic correspondence, and news reports confirmed that it was the policy of the Turkish Nationalists in Angora, who eventually founded the Republic of Turkey, to eradicate the remnants of the empire's Armenian population and finalize the expropriation of their public and private properties. Shirinian, George N. (2017). Genocide in the Ottoman Empire: Armenians, Assyrians, and Greeks, 1913-1923. Berghahn Books. p. 62. ISBN 978-1-78533-433-7. The argument that there was a mutually signed agreement for the population exchange ignores the fact that the Ankara government had already declared its intention that no Greek should remain on Turkish soil before the exchange was even discussed. The final killing and expulsion of the Greek population of the Ottoman Empire in 1920–24 was part of a series of hostile actions that began even before Turkey's entry into World War I. Adalian, Rouben Paul (1999). \"Ataturk, Mustafa Kemal\". In Charny, Israel W. (ed.). Encyclopedia of Genocide: A-H. ABC-CLIO. ISBN 978-0-87436-928-1. Archived from the original on 16 May 2021. Retrieved 4 May 2021. Mustafa Kemal completed what Talaat and Enver had started in 1915, the eradication of the Armenian population of Anatolia and the termination of Armenian political aspirations in the Caucasus. With the expulsion of the Greeks, the Turkification and Islamification of Asia Minor was nearly complete. Morris, Benny; Ze'evi, Dror (2019). The Thirty-Year Genocide: Turkey's Destruction of Its Christian Minorities, 1894–1924. Harvard University Press. ISBN 978-0-674-91645-6. The Greek seizure of Smyrna and the repeated pushes inland— almost to the outskirts of Ankara, the Nationalist capital—coupled with the largely imagined threat of a Pontine breakaway, triggered a widespread, systematic four- year campaign of ethnic cleansing in which hundreds of thousands of Ottoman Greeks were massacred and more than a million deported to Greece... throughout 1914–1924, the overarching aim was to achieve a Turkey free of Greeks. Meichanetsidis, Vasileios Th. (2015). \"The Genocide of the Greeks of the Ottoman Empire, 1913–1923: A Comprehensive Overview\". Genocide Studies International. 9 (1): 104–173. doi:10.3138/gsi.9.1.06. S2CID 154870709. Archived from the original on 23 November 2022. Retrieved 8 December 2022. The genocide was committed by two subsequent and chronologically, ideologically, and organically interrelated and interconnected dictatorial and chauvinist regimes: (1) the regime of the CUP, under the notorious triumvirate of the three pashas (Üç Paşalar), Talât, Enver, and Cemal, and (2) the rebel government at Samsun and Ankara, under the authority of the Grand National Assembly (Türkiye Büyük Millet Meclisi) and Kemal. Although the process had begun before the Balkan Wars, the final and most decisive period started immediately after WWI and ended with the almost total destruction of the Pontic Greeks ... ==Notes== ==References== Category:Wars involving France Category:Wars involving Greece Category:Wars involving the United Kingdom Category:Wars involving the United States Category:1920s in Turkey",
 "title": "Turkish War of Independence"
}