{
 "id": "1002281",
 "text": "Kulturzentrum Bremgarten (KuZeB) is a Swiss community place where events can be held. It began in 1992 as a result of a squat (illegally taken over building). It is located at Zürcherstrasse 2 in Bremgarten. It is an important place for autonomous people in the canton of Aargau and for people who are interested in social, cultural and political issues. There are many events there such as concerts, readings, discussions, information and advice. The buildings are from a former clothing factory that was built in 1893. It consists of a house and two factory buildings. == History of the textile factory== The Biedermeier home is located on Obertorplatz in Bremgarten. It was built in 1838 by a builder called Fidel Leimbacher. It housed many famous people before it went to the brothers Max and Simon Meyer. They started a business there in 1893, making clothes for men and for people who work for a job. The factory grew bigger and better. It is a typical example of a small factory and an important example of New Building (this is a special type of building). The core building (main part) is a two-storey Biedermeier house with an attic (a special room under the roof). There are also other parts that were added to the back in 1880, 1911/1912 and 1928/1929. The Meyer & Co. factory building was built in 1928/1929. The architect's name is Johann Emil Ganz. It is made of concrete, has a lot of windows and is flat on the top. It follows the ideas of the New Building Movement (a group of people who wanted buildings to look a certain way). There are two big rooms in the building, which measure 12 x 19.6 metres. They are very bright. It is an example of factory architecture of pre-modernism. It shows the rich history of the clothing factory. Today, the building complex does not look the same. It is included (listed) in the Inventory of Swiss Heritage Sites (ISOS) (a list of places that are important to Swiss history and culture) because this place is important for Bremgarten. == History of the social centre == In June 1990, some young people took control of the buildings. That had not been used for a long time. A Spanish club and a single person lived in the living part of the building. The squatters turned the building into an \"autonomous space\" (a place where they could do whatever they wanted). They built a half pipe (a U-shaped ramp for skateboarding) and two band rooms (places for musical groups to practice) in the basement. Max Meyer, one of the owners, knew they were using the building, but he did nothing. That's why the authorities couldn't do anything. So the factory project ran until New Year's Day 1991. === Threat of leave === In spring 1991, the squatters started the . They wanted to talk about a rent with the owners. But the discussions did not work. In April 1991, the city had said they must leave. But parties were still held in the old buildings. On 7 December 1991, a group of people with extreme right-wing views entered the factory and tried to take over. The owners had to close the buildings by 15 February 1992. At the same time, the electricity company threatened to cut off the power. === Forming of the organization === The activists started a fresh attempt to form the organization \"KuZeB\" to keep up. They made a concept of use and gave it to the owners of the property and the authorities. There was a suggestion to close the building. But the activists argued and asked the owners not to and the owners said yes. The people liked it and the city government confirmed that they never said no to renting. So 18 March 1992 is the day when the Kulturzentrum Bremgarten started. === Rental contract === The Whitsun market was very popular (an annual event). In August 1992, the Spanish club moved away and KuZeB took over the place. On 27 August 1992 KuZeB signed a rental contract which was not returned (agreed to by the other side). But the relatives of the previous owner of the factory still get a small rent since 30 years. The rest is 'squatted'. Now the concept for how the building will be used was put in place bit by bit. Now, KuZeB is the oldest self-governing social centre in Switzerland, it comes without any public money. === Troubles === On 7 June 2002, the police of Aargau canton searched the Kulturzentrum Bremgarten. They took a banner that was hanging from the house. The banner had a symbol of a swastika crossed out inside a sign that means \"no.\" The search happened because someone was accused of breaking the law against racism. In a statement, the people who run KuZeB described the action as both strange and a form of political satire. Authorities tried to control the KuZeB. They made a rule which would have put the centre under the rules for providing a place to stay. That would have meant the end of KuZeB. But the government decided that KuZeB should not be thought of as a business and so was not covered by the hospitality law. On 29 May 2018, a group of police searched the buildings. A young man from Aargau is suspected of having done bad things in Hamburg during the G20 riots. He was not there when the police searched. But they searched his home and the social centre anyway and took many data carriers (things that can store information, like a computer or a phone). Later he was arrested (taken into custody) near Winterthur. Andreas Glarner is a hardliner of the SVP (Swiss People's Party, a party and politician who holds strong right-wing views). He wants to remove the KuZeB. Max Meyer has people who want to buy the KuZeB, but he doesn't want to sell it. Bremgarten had been in the news in 2013. Asylum seekers (people looking for safety) were forbidden to go to public institutions. Glarner said that he would buy the building to prevent asylum seekers from going to KuZeB. Then unknown persons sprayed paint the meeting place of the SVP general meeting. Now Glarner is even more against the KuZeB. == Today's programme == The KuZeB has many things to offer. There are concerts, readings, film screenings and lectures. It has two stages with bars, a cinema (for watching films), a hackerspace (for people interested in computer technology), a freeshop (a shop where people can get things for free), an infoshop (a shop where people can get information), studios for sewing (using fabric to make clothes), printing and painting. It also has a wood and metal workshop (for making things out of wood or metal), a multi-purpose hall (a room for many different kinds of activities) with a half-pipe (for skateboarding) and a fitness area (for exercising), a room for bands (for rehearsing music) and a large garden. You can do a lot there. KuZeB wants to find new ways in which everyone has equal rights and responsibilities. These ideas include humanity (being kind and caring), solidarity (working together), freedom of expression (being able to say what you think), trust (believing people), integration (bringing different people together), diversity (having different types of people) and openness (being welcoming). These paths are to show others that there are other possibilities. The association offers young people the chance to try out their ideas. == References == == Literature == * KulturZentrum Bremgarten, Kleiderfabrik Bremgarten: [20 Jahre KuZeB], Bremgarten, 2012. NB 001768822 == Other websites == * * Kleiderfabrik Meyer & Co. Bremgarten um 1937 in the Swiss Social Archives Category:Music venues Category:Anarchism Category:Youth organizations Category:Bremgarten District Category:Organizations based in Switzerland Category:Buildings and structures in Switzerland Category:Swiss culture",
 "title": "Kulturzentrum Bremgarten"
}