{
 "id": "1002066",
 "text": "Kishore Kumar (born Abhas Kumar Ganguly; ; 4 August 1929 – 13 October 1987) was an Indian playback singer and actor. He is widely regarded as one of the greatest, most influential and dynamic singers in the history of Indian music.*\"Remembering Kishore Kumar: Unforgettable Jewels from India’s Greatest Playback Singer\" https://www.news18.com/amp/news/movies/remembering-kishore- kumar-unforgettable-jewels-from-indias-greatest-playback-singer-2755463.html *https://m.timesofindia.com/home/sunday-times/deep-focus/unforgettable- kishore/articleshow/2435600.cms *https://www.hindustantimes.com/music/the- legend-of-kishore-kumar-why-he-remains-relevant-even-today/story- yS95qQmejzEBIlpacKVexN.html He was one of the most popular singers in the Indian subcontinent, notable for his yodeling and ability to sing songs in different voices. He used to sing in different genres but some of his rare compositions, considered classics, were lost in time. According to his brother and legendary actor Ashok Kumar, Kishore Kumar was successful as a singer because his \"voice hits the mike, straight, at its most sensitive point\". Besides Hindi, he sang in many other Indian languages, including Bengali, Marathi, Assamese, Gujarati, Kannada, Bhojpuri, Malayalam, Odia and Urdu. He also released a few non-film albums in multiple languages, especially in Bengali, which are noted as all-time classics. He won 8 Filmfare Awards for Best Male Playback Singer and holds the record for winning the most Filmfare Awards in that category. He was awarded the Lata Mangeshkar Award by the Madhya Pradesh government in 1985. He died on 13 October 1987, at the age of 58, coinciding with his eldest brother, Ashok Kumar's 76th birthday, due to a heart attack in Bombay. In 1997, the Madhya Pradesh Government initiated an award called the \"Kishore Kumar Award\" for contributions to Hindi cinema. In 2012, his unreleased last song sold for 15.6 lakh at the Osian's Cinefan Auction in New Delhi. == References == Category:Indian singers Category:1929 births Category:Bengali musicians",
 "title": "Kishore Kumar"
}