{
 "id": "1002850",
 "text": "Henry Dundas, 1st Viscount Melville (28 April, 1742 – 28 May 1811) was a Scottish politician and lieutenant of Prime Minister William Pitt. He was the most powerful politician in Scotland and held various different positions in the British government. Dundas served as MP of Edinburgh, Lord Advocate of Scotland, Home Secretary, President of the Board of Control, Secretary of State for War and First Lord of the Admiralty during his career. == Controversy == He was, however a figure. In 1792, Dundas advocated for the gradual abolition of the Atlantic slave trade over four years. There is a statue of him in Edinburgh named the Melville Monument. A street in Canada was named after him but in 2020 Toronto City Council voted to rename the street due to Dundas' actions in delaying the end of the slave trade. === Academic dispute over Dundas' impact on abolition === Modern historians are divided over whether Dundas should be held responsible for prolonging the slave trade. Historians of the slave trade and the abolitionist movement, including David Brion Davis, Roger Anstey, Robin Blackburn, and Stephen Tomkins have commented that Dundas' actions delayed rather than facilitated abolition. According to Davis, \"By making the abolition of the slave trade dependent on colonial reforms, Dundas suggested possibilities for indefinite delay.\" Stephen Mullen, a research associate at Glasgow University and historian of slavery and the Atlantic slave trade, has called Dundas \"a great delayer\" of abolition. Other historians of British history have argued that delay was inevitable. Angela McCarthy notes that the revolutionary wars with France, and opposition in the House of Lords and in the royal family, presented enormous obstacles. Sir Tom Devine, whose publications include editing Recovering Scotland's Slavery Past: The Caribbean Connection (Edinburgh University Press, 2015), has said that blaming Dundas for delay in the abolition of the slave trade is \"bad history\" and ignores the wider political and economic factors that were the true causes of delay. Brian Young notes that in 1792, the motion for immediate cessation of the slave trade was heading for certain defeat. By inserting the word \"gradual\" into the motion, Young says Dundas ensured a successful vote for the ultimate abolition of the trade in slaves. == Sources == Category:1742 births Category:1811 deaths Category:Members of the British House of Commons for Scottish constituencies Category:Politicians from Edinburgh",
 "title": "Henry Dundas"
}