{
 "id": "1003012",
 "text": "The period of human development – a concept derived from psychoanalysis, in which the leading role is given to the conscious actions of the individual under the influence of the environment. Development is understood as an evolutionary process in which an individual achieves an increasingly higher level of integration through psychosocial crises. It is accomplished by solving difficulties related to changes on the levels on which it takes place: biological, psychological and social. Development is therefore the mutual adaptation of the individual and the environment. == Ego == The ego is a configuration that includes and controls conscious activities that synthesize and integrate past experiences with tasks currently appearing in the perceptual-cognitive field of the individual. * It is equivalent to id and superego. * The basic processes of the ego: play, speech, thinking and acting. The driving force behind development is the occurrence of opposing tendencies and aspirations in man. This polarization occurs in two dimensions: # Striving for progression - striving for regression: * Progression - implies the desire to live, to obtain gratification, the desire to expand beyond self * Regression - a return to the stage of less psychological complexity, implies a tendency to self-destruction # Bisexual polarization: * It consists in the co- occurrence of the male and female elements. Development occurs in successive phases. Its course depends on the experience previously acquired by the individual. In each phase, a new system of biological, social, psychological obstacles emerge, causing crisis and exacerbating the struggle between the aspirations for progression and regression. To move to the next phase, all obstacles must be overcome. The solution to a psychosocial crisis occurs when the obstacles and pressures that have arisen at a given moment are incorporated into the structure of the ego as elements of a harmonious whole. Then the relative equilibrium is not so much recovered as achieved at a higher level of complexity. == Theoretical paradigms in developmental psychology == === Attachment theory, attachment theory === Attachment theory is a theoretical system developed by British physician and psychoanalyst John Bowlby, focusing on the developmental importance of close, intimate, emotionally meaningful relationships. Attachment in this theoretical current has been described as a system of biological impulses necessary to ensure survival in the first years of his life. This trend deals with the effects of the negative impact on development of the loss of significant objects, i.e. biological caregivers as a result of depreciation of attention and involvement.In 1965, Mary Ainsworth created the Strange Situation Procedure as a way of assessing individual differences in attachment behavior through individual stress responses and safe shelter concepts.The theory of attachment is used in therapeutic practice, especially in the field of civil partnerships and in the ethological model of developmental psychology. An early attachment style can affect relationships with people. The attachment style model is established in early childhood and is a relational style in adulthood. === Constructivism === Constructivism is one of the paradigms in psychology that characterizes the concept of intellectual development as a process of active knowledge building. The individual independently creates the meaning of new information – by selecting, organizing and integrating information from other knowledge, often in the context of social interaction. The concept of intellectual development can be realized in an individual or social way. This theory assumes that the integration and building of knowledge is realized through cognitive processes and personal experiences, not through memorizing facts. == Psychological periodization of stages of human development == === According to WHO === Period Age range infancy 0-2 post-infancy 2-4 early childhood 4-7 late childhood 7-10 adolescence 10-25 adulthood 25-50 middle age 50-65 senility 65+ == Bibliography == Psychology of human development. Volume 2. Characteristics of human life periods, Wydawnictwo Naukowe PWN 2000 Warsaw. Category:psychoanalysis",
 "title": "Human developmental periods"
}