{
 "id": "100313",
 "text": "The Democratic-Republican Party was founded by Thomas Jefferson and James Madison in 1792. It became the most popular political party until the 1820s. In the 1824 United States presidential election it split into several factions, one of which became the modern-day Democratic Party. Its members spoke of the party as the Republicans, Jeffersonians, Democrats,Address of the Republican committee of the County of Gloucester, New-Jersey ... Gloucester County, December 15, 1800 and the last nominating caucus of the Party. or combinations of these (Jeffersonian republicans, etc.).Mathews, Dictionary of Americanisms (1951) A left-wing party, the party was based primarily on the concept of liberalism. Jefferson and Madison created the party in order to oppose the economic and foreign policies of the Federalists, a party created a year or so earlier by Treasury Secretary Alexander Hamilton. Foreign policy issues were central; the party opposed the Jay Treaty of 1794 with Britain (then at war with France) and supported good relations with France before 1801. The party was against many of Hamilton's proposals concerning the Constitution. Note that this party is different from the modern-day Republican Party. == References == * Henry Adams, History of the United States during the Administrations of Thomas Jefferson (1889; Library of America ed. 1986) * Henry Adams, History of the United States during the Administrations of James Madison (1891; Library of America ed. 1986) === Biographies === * Cunningham, Noble E. In Pursuit of Reason The Life of Thomas Jefferson () (1987) === State studies === * Prince, Carl E. New Jersey’s Jeffersonian Republicans: The Genesis of an Early Party Machine, 1789-1817 (1967) === Newspapers === * Stewart, Donald H. The Opposition Press of the Federalist Era (1968), highly detailed study of Republican newspapers * The complete text, searchable, of all early American newspapers are online at Readex America’s Historical Newspapers, available at research libraries. === Primary sources === * Adams, John Quincy. Memoirs of John Quincy Adams: Comprising Portions of His Diary from 1795 to 1848 Volume VII (1875) edited by Charles Francis Adams; (). Adams, son of the president, switched and became a Republican in 1808 * Cunningham, Noble E., Jr., ed. The Making of the American Party System 1789 to 1809 (1965) excerpts from primary sources * Cunningham, Noble E., Jr., ed. Circular Letters of Congressmen to Their Constituents 1789-1829 (1978), 3 vol; reprints the political newsletters sent out by congressmen * Kirk, Russell ed. John Randolph of Roanoke: A study in American politics, with selected speeches and letters, 4th ed., Liberty Fund, 1997, 588 pp. ; Randolph was a leader of the \"Old Republican\" faction * Smith, James Morton, ed. The Republic of Letters: The Correspondence of Thomas Jefferson and James Madison, 1776-1826 Volume 2 (1994) == Notes == == Other websites == * A New Nation Votes: American Election Returns 1787-1825 Category:Political parties in the United States Category:1792 establishments in the United States Category:1820s disestablishments in North America Category:19th-century disestablishments in the United States Category:Liberal parties",
 "title": "Democratic-Republican Party"
}