{
 "id": "1003612",
 "text": "Hayden Silas Anhedönia (born March 24, 1998), known by her stage name Ethel Cain, is an American singer-songwriter. She was born in Tallahassee and lives in Pittsburgh. Cain first started making music in 2017 under the name White Silas. She was inspired by Christian music and Gregorian chants. She released some music under that name on sites including Spotify, SoundCloud and Tumblr. In 2019, she changed to an alternative sound and started using the name Ethel Cain. Her music is Southern Gothic themed. She sings about poverty, substance abuse, domestic violence, death, and more. Cain put out her first album in 2022 called Preacher's Daughter. Many music critics called it one of the best albums of the year. == Early life == Hayden Silas Anhedönia was born in Tallahassee, Florida and raised in Perry. Her family is Southern Baptist. She is the oldest out of all her siblings. Her father was a deacon and she sang in the choir at his church when she was young. Cain started playing the piano when she was 8 years old because she was inspired by Karen Carpenter, the Steve Miller Band, and Christian music. She came out as a gay man to her family when she was 12. She left the church when she was 16. When she turned 20, she came out as a trans woman. == Career == === 2017–2019: career beginnings === In 2017, Cain thought about going to the film school at Florida State University. She started making choral inspired music on GarageBand with a lot of reverb. From 2017 to 2018, she posted some music just for her close friends and followers on Twitter and Instagram. She used the names White Silas and Atlas. In 2019, she released her first song as Ethel Cain, called 'Bruises'. Then she opened for Nicole Dollanganger at her concert in Chicago. In September 2019, she released an EP called Carpet Bed. She released another one called Golden Age three months later. Wicca Phase Springs Eternal said in an interview that he likes Ethel Cain's music. === 2020–2021: Inbred === In January 2020, Cain met a rapper named Lil Aaron. He invited her to sign with a publishing company called Prescription Songs. In August 2020, Cain moved from Florida to Richmond, Indiana. In Richmond, she made an EP called Inbred, which was released on April 23, 2021. === 2022–present: Preacher's Daughter === In May 2022, Cain released her first album called Preacher's Daughter. == Personal life == Ethel Cain still considers herself a Southern Baptist, but she says she is not a Christian and does not care about religion that much. Cain is autistic, bisexual and transgender. == Notes == == References == Category:Living people Category:1998 births Category:Transgender women Category:Bisexual people Category:American singer-songwriters Category:LGBT people from Florida Category:People on the autism spectrum",
 "title": "Ethel Cain"
}