{
 "id": "1003747",
 "text": "Taylor Swift is the self-titled debut studio album by singer Taylor Swift. In the United States and Canada, it came out on October 24, 2006. In the rest of the world, it came out on March 18, 2008. It was released by Big Machine Records. This is a record label. == Background == Taylor Swift decided to be a country singer when she watched a movie about Faith Hill. She wanted to move to Nashville, Tennessee because it is known as the home of country music. She started making some songs to see if record labels would like them. She eventually joined Big Machine Records. She moved to Hendersonville, Tennessee because it is close to Nashville. She was one of the first people to be in Big Machine Records. The first song on the album is called \"Tim McGraw\". It was released early on June 19, 2006. The full album came out on October 24, 2006 in the United States and Canada. It came out on March 18, 2008 for the rest of the world. == Reviews == Most critics liked the album Taylor Swift. Some said the lyrical themes were childish and didn't have depth. Most said Swift's songwriting was good and used popular skills in a way that sounded new. On Metacritic, the album got 67 out of 100 points, based on five reviews. But fans instantly loved it and on a billboard poll, Our Song got the best song voted on the album closely followed by Teardrops on My guitar and Picture To Burn. == Charts == In the United States, Taylor Swift didn't chart high at first. It became more popular over time. In its first week, it went to number 19 on the Billboard 200 chart and sold 40,000 copies. Because albums often drop in sales after they come out, Swift did not think it would stay on the chart for a long time: \"I would be incredibly lucky to see this a, thelbum certified Gold.\" She was wrong, however, and Taylor Swift kept selling a similar amount each week. By November 2007 album had sold over a million copies. At its highest, Taylor Swift was at number 14 on the Canadian Albums Chart and was certified Platinum by Music Canada (MC). In the Australian Albums Chart, it reached number 33 in March 2010, and was certified Platinum by the Australian Recording Industry Association (ARIA). It reached number 81 on the United Kingdom albums chart and was certified Gold by the British Phonographic Industry (BPI) because it sold more than 100,000 copies. As of October 2022, the album had sold 198,000 copies in the United Kingdom. It also appeared on the charts in New Zealand (number 38, at its highest point), Japan (53), Ireland (59) and Scotland (71). === Weekly charts === Taylor Swift reached its highest position on different days in each country. Chart performance of Taylor Swift Chart (2006–2009) Peak position Chart (2010–2015) Peak position Australian Country Albums (ARIA) 3 Japanese Albums (Oricon) 53 Chart (2021–2023) Peak position Argentine Albums (CAPIF) 10 Greek Albums (IFPI) 40 === Year-end charts === Year-end charts for Taylor Swift Chart Position US Billboard 200 (2007) 19 US Billboard 200 (2008) 5 US Billboard 200 (2009) 24 US Billboard 200 (2010) 62 US Billboard 200 (2011) 164 US Top Country Albums (2007) 3 US Top Country Albums (2008) 2 US Top Country Albums (2009) 6 US Top Country Albums (2010) 19 === Decade-end charts === 2000s decade-end charts for Taylor Swift Chart (2000–2009) Position US Billboard 200 53 US Top Country Albums (Billboard) 9 === All-time charts === 1963–2017 all-time chart for Taylor Swift Chart (1963–2017) Position US Billboard 200 18 US Billboard 200 (Women) 9 == Track listing == All the songs were written by Taylor Swift and Liz Rose and produced by Nathan Chapman, unless someone else is listed. == References == Category:Taylor Swift albums Category:2006 albums",
 "title": "Taylor Swift (album)"
}