{
 "id": "1003545",
 "text": "The Midcourse Space Experiment (MSX) is a Ballistic Missile Defense Organization (BMDO) satellite experiment (unmanned space mission) to map bright infrared sources in space. MSX offered the first system demonstration of technology in space to identify and track ballistic missiles during their midcourse flight phase.Williams, Frank. \"Space-Based Surveillance Operations Advanced Concept Technology Demonstration,\" Space Tactics Bulletin, Vol 6, Issue 4 == History == On 24 April 1996, the BMDO launched the MSX satellite on a Delta II booster from Vandenberg AFB, California. MSX was placed in a sun- synchronous orbit at 898 km and an inclination of 99.16 degrees. MSX's mission was to gather data in three spectral bands (long wavelength infrared, visible, and ultraviolet). From 13 May 1998, MSX became a giving sensor to the Space Surveillance Network. == Launch debris incident == Lottie Williams was exercising in a park in Tulsa on January 22, 1997, when she was hit in the shoulder by a piece of blackened metallic material. U.S., Space Command confirmed that a used Delta II rocket from the April 1996 launch of the Midcourse Space Experiment had crashed into the atmosphere 30 minutes earlier. The object tapped her on the shoulder and fell off harmlessly onto the ground. Williams collected the item and NASA tests later showed that the piece was matching up with the materials of the rocket, and Nicholas Johnson, the agency's chief scientist for orbital debris, believes that she was in fact hit by a piece of the rocket.; == Operations == Operational from 1996 to 1997, MSX mapped the galactic plane and areas either missed or identified as especially bright by the Infrared Astronomical Satellite (IRAS) at wavelengths of 4.29 μm, 4.35 μm, 8.28 μm, 12.13 μm, 14.65 μm, and 21.3 μm. It carried the 33-cm SPIRIT III infrared telescope and interferometer–spectrometer with solid hydrogen-cooled five line-scanned infrared focal plane arrays (rows).The Spatial Infrared Imaging Telescope III (SPIRIT III) Calibration of MSX created a challenge for designers of the experiment, as baselines (measures of what occurs naturally) did not exist for the bands it would be observing under. Engineers solved the problem by having MSX fire projectiles of known composition in front of the detector, and calibrating the instruments to the known black-body curves of the objects. The MSX calibration serves as the basis for other satellites working in the same wavelength range, including AKARI (2006-2011) and the Spitzer Space Telescope (SST). MSX data is now available in the Infrared Science Archive (IRSA) given by NASA's Infrared Processing and Analysis Center (IPAC). Group efforts between the Air Force Research Laboratory and IPAC has resulted in an archive containing images for about 15 percent of the sky, including the whole Galactic Plane, the Large Magellanic Cloud, and areas of the sky missed by IRAS.Spitzer Space Telescope at IPAC == References == Category:American satellites",
 "title": "Midcourse Space Experiment"
}