{
 "id": "100366",
 "text": "In dimensional analysis, a dimensionless quantity (or more precisely, a quantity with the dimensions of 1) is a quantity without any physical units and thus a pure number. Such a number is typically defined as a product or ratio of quantities which do have units, in such a way that all the units cancel out. == Example == \"out of every 10 apples I gather, 1 is rotten.\" -- the rotten-to-gathered ratio is (1 apple) / (10 apples) = 0.1 = 10%, which is a dimensionless quantity. == List of dimensionless quantities == There are infinitely many dimensionless quantities and they are often called numbers. Some of those that are used most often have been given names, as in the following list of examples (alphabetical order): Name Field of application Abbe number optics (dispersion in optical materials) Albedo climatology, astronomy (reflectivity of surfaces or bodies) Archimedes number motion of fluids due to density differences Bagnold number flow of grain, sand, etc. Biot number surface vs. volume conductivity of solids Bodenstein number residence-time distribution Bond number capillary action driven by buoyancy Brinkman number heat transfer by conduction from the wall to a viscous fluid Brownell Katz number combination of capillary number and Bond number Capillary number fluid flow influenced by surface tension Coefficient of static friction friction of solid bodies at rest Coefficient of kinetic friction friction of solid bodies in translational motion Colburn j factor dimensionless heat transfer coefficient Courant-Friedrich-Levy number numerical solutions of hyperbolic PDEs Damköhler numbers reaction time scales vs. transport phenomena Darcy friction factor fluid flow Dean number vortices in curved ducts Deborah number rheology of viscoelastic fluids Decibel ratio of two intensities of sound Drag coefficient flow resistance e mathematics Eckert number convective heat transfer Ekman number geophysics (frictional (viscous) forces) Elasticity (economics) widely used to measure how demand or supply responds to price changes Eötvös number determination of bubble/drop shape Euler number hydrodynamics (pressure forces vs. inertia forces) Fanning friction factor fluid flow in pipes Feigenbaum constants chaos theory (period doubling) Fine structure constant quantum electrodynamics (QED) Foppl–von Karman number thin- shell buckling Fourier number heat transfer Fresnel number slit diffraction Froude number wave and surface behaviour Gain electronics (signal output to signal input) Galilei number gravity-driven viscous flow Graetz number heat flow Grashof number free convection Hatta number adsorption enhancement due to chemical reaction Hagen number forced convection Karlovitz number turbulent combustion Knudsen number continuum approximation in fluids Kt/V medicine Laplace number free convection within immiscible fluids Lewis number ratio of mass diffusivity and thermal diffusivity Lockhart-Martinelli parameter flow of wet gases Lift coefficient lift available from an airfoil at a given angle of attack Mach number gas dynamics Magnetic Reynolds number magnetohydrodynamics Manning roughness coefficient open channel flow (flow driven by gravity) Marangoni number Marangoni flow due to thermal surface tension deviations Morton number determination of bubble/drop shape Nusselt number heat transfer with forced convection Ohnesorge number atomization of liquids, Marangoni flow Péclet number advection–diffusion problems Peel number adhesion of microstructures with substrate Pi mathematics (ratio of a circle's circumference to its diameter) Poisson's ratio elasticity (load in transverse and longitudinal direction) Power factor electronics (real power to apparent power) Power number power consumption by agitators Prandtl number forced and free convection Pressure coefficient pressure experienced at a point on an airfoil Radian measurement of angles Rayleigh number buoyancy and viscous forces in free convection Refractive index electromagnetism, optics Reynolds number flow behavior (inertia vs. viscosity) Richardson number effect of buoyancy on flow stability Rockwell scale mechanical hardness Rossby number inertial forces in geophysics Schmidt number fluid dynamics (mass transfer and diffusion) Sherwood number mass transfer with forced convection Sommerfeld number boundary lubrication Stanton number heat transfer in forced convection Stefan number heat transfer during phase change Stokes number particle dynamics Strain materials science, elasticity Strouhal number continuous and pulsating flow Taylor number rotating fluid flows van 't Hoff factor quantitative analysis (Kf and Kb) Weaver flame speed number laminar burning velocity relative to hydrogen gas Weber number multiphase flow with strongly curved surfaces Weissenberg number viscoelastic flows Womersley number continuous and pulsating flows == Other websites == * Biographies of 16 scientists with dimensionless numbers of heat and mass transfer named after them * How Many Fundamental Constants Are There? by John Baez * Michael Sheppard, Systematic Search for Expressions of Dimensionless Constants using the NIST database of Physical Constants, 2007 Category:Mathematics",
 "title": "Dimensionless quantity"
}