{
 "id": "1003587",
 "text": "Princess Märtha of Sweden (Märtha Sofia Lovisa Dagmar Thyra; 28 March 1901 - 5 April 1954) was Crown Princess of Norway She was the wife of the future King Olav V from 1929 until her death in 1954. The current King Harald V is her only son. Princess Märtha was also a sister of Queen Astrid of Belgium, and a maternal aunt of Grand Duchess Joséphine-Charlotte of Luxembourg, King Baudouin of Belgium and King Albert II of Belgium. == Early life == Märtha was born at her parents' home of Arvfurstens Palats in Stockholm on 28 March 1901, the second child of Prince Carl of Sweden, Duke of Västergötland, and his wife Princess Ingeborg of Denmark. Her father was the younger brother of King Gustav V of Sweden (making her a first cousin twice removed of the present King of Sweden) and her mother was the younger sister of King Christian X of Denmark and of King Haakon VII of Norway. Märtha had an elder sister, Princess Margaretha of Denmark, a younger sister, Queen Astrid of the Belgians, and a younger brother, Prince Carl Bernadotte. Märtha grew up to be much more confident and outgoing and so the daughter most admired by her mother. As a child, Märtha was taught at home by private tutors and completed courses in childcare and first aid. She and her sisters were occasionally seen shopping unaccompanied on the streets of Stockholm.www.kungligaslotten.se == Crown Princess == During the 1928 Summer Olympics in Amsterdam, Princess Märtha of Sweden became engaged to her first and second cousin, Prince Olav, the only son and heir apparent of her uncle the King of Norway and grandson of her grandfather King Frederick VIII of Denmark's younger sister. News of the engagement was very well received. An excellent match for strengthening royal ties, it was also clearly a match based on love. Initially, her younger sister, Astrid, was expected to marry Olav, being younger than Olav by two years, while Märtha was two years older. Astrid was also considered more beautiful, but she instead married the future King of the Belgians Leopold III. Following a year-long engagement, she married Crown Prince Olav in Oslo Cathedral on 21 March 1929. Märtha's was the first royal wedding in Norway in 340 years. The marriage is widely believed to have been a success due in large part to their genuine mutual love. They had three children: Ragnhild (1930-2012); Astrid (b. 1932); and the much awaited heir, Harald (b. 1937). Crown Princess Märtha soon became a popular and respected member of the royal family. She performed a range of official engagements. She also gave many speeches, unusual for royal females in that era. Crown Prince Olav and Crown Princess Märtha of Norway lived at the country estate of Skaugum. It was a wedding gift from Baron Fritz Wedel Jarlsberg. When the main house at Skaugum was destroyed by fire in 1930, the Crown Princess was actively involved in its rebuilding. Tragedy struckin 1935 when her sister Queen Astrid of the Belgianswww.monarchie.be was killed in a car crash. The two sisters had been very close. Later King Olav said that it took his wife more than ten years to come to terms with her sister's death. He did not think that she ever really got over it. Märtha and elder sister Margaretha became a great support for Astrid's children in Belgium. In 1939, shortly before the outbreak of World War II, the Crown Prince and Princess visited the United States. The couple befriended President Franklin Roosevelt and his wife, Eleanor. In 1938 upon the death of her mother-in-law, Queen Maud, Crown Princess Märtha became the royal Norwegian court's senior lady. ===World War II=== Crown Princess Märtha contributed greatly towards Norway mobilizing for self-defence by making a public announcement on 26 January 1940. She encouraged Norwegian women to participate in the mobilization work. During the flight from the German invasion in 9–10 April 1940, the Norwegian government decided that the Crown Princess and her children were to flee across the border to her native Sweden while her husband and father-in-law remained. When they arrived at the Swedish border, they were first denied entry because they could not provide passports. She then instructed her driver to run through the border gate, thus gaining entry into her native Sweden. In Sweden she stayed at first at a tourist hotel in Sälen, before travelling on to Stockholm where her parents and relatives lived. Her presence in Sweden became problematic. Some people considered her presence put Sweden's neutrality in jeopardy. President Roosevelt then offered her a personal invitation to the United States. Her uncle, King Gustav V of Sweden, telegraphed her father-in-law King Haakon and advised against the trip, but Märtha insisted on accepting the invitation. Roosevelt sent the US Army transport to the then Finnish port city of Petsamo to pick her up. In the U.S., she and her children initially stayed at the White House. Crown Prince Olav accompanied his father to the United Kingdom with the Norwegian government-in-exile. Thus the Norwegian royal couple, like many other couples during that time, were separated for much of the war. In August 1941, Crown Princess Märtha traveled with President Roosevelt aboard the presidential yacht, , and sailed to Newfoundland and the Atlantic Charter meetings with Winston Churchill. Princess Märtha spent much of World War II in the United States. She worked tirelessly to keep up support for Norway among the American public and government. === Post-war period === When she returned to Norway following the war in 1945, Princess Märtha received a hero's welcome and was referred to as \"Mother of the Nation\". She wholly embraced her role as Crown Princess of Norway and made tremendous efforts towards ensuring the stability and well-being of all Norwegians. As King Haakon’s health declined, the Crown Prince and Crown Princess assumed a growing number of official engagements. The Crown Princess became involved in many official tasks, and even made the annual New Year’s Eve speeches in 1946 and 1950. After the war, Crown Princess Märtha suffered from poor health. ==Death== After a long period of ill-health, Märtha died of cancer at The National Hospital in Oslo on 5 April 1954 and was buried at Akershus Castle.www.burkespeerage.com Her death came at the time her elder daughter Princess Ragnhild was expecting her first child and just over three years before her husband ascended the throne as King. ==Legacy== A 970,000 km² area in Antarctica is named Princess Martha Coast in her honor. A statue of the princess, created by Kirsten Kokkin was erected outside the Norwegian embassy in Washington, D.C. in 2005. In 2007, a replica of the statue was erected in the courtyard of the Royal Palace in Oslo. A third replica was erected outside The Norwegian Seamen`s Church in Stockholm, Sweden, unveiled by her daughter, Princess Astrid in 2008. This church, Kronprinsesse Märthas kirke is named after her. Crown Princess Märtha’s Memorial Fund is a charitable trust administered by the Norwegian Crown. The Crown Princess's youngest daughter, Princess Astrid, serves as chairperson. Initially established as Her Royal Highness Crown Princess Märtha’s Fund on 1 April 1929, the fund \"is to provide financial support to social and humanitarian initiatives carried out by non-governmental organizations.\" In 2005, the Fund had assets of approximately 28 million Norwegian krone (NOK), and issued grants totaling about 1.5 million NOK for roughly 300 recipients.Royal House web page on Crown Princess Märtha’s Memorial Fund Retrieved 6 November 2007 Her son King Harald V named his daughter Princess Märtha Louise after her grandmother. The popular Swedish layer Princess cake was named for Märtha and her two sisters when they were children. The ship MS «Kronprinsesse Märtha», launched in 1929, was named after her. This ship which helped to save hundreds of passengers from the sinking German cruise ship Dresden in 1934 has, since 2000, been used as a hotel ship in Stockholm. Märtha is depicted in the historical docudrama television miniseries, Atlantic Crossing, a co-production of Cinenord and the state broadcaster, NRK. ==Ancestry== ==References== ===Citations=== ===Bibliography=== * * ==Other websites== *Website of the Royal House of Norway: Crown Princess Märtha Category:1901 births Category:1954 deaths Category:House of Bernadotte Category:Norwegian princesses Martha 1901 Category:World War II people Category:Crown Princesses of Norway",
 "title": "Princess Märtha of Sweden"
}