{
 "id": "1003892",
 "text": "Caitlin Clark (born 22 January 2002) is an American professional basketball player. She currently plays at the point guard position in the Women's National Basketball Association college for the Indiana Fever. She is the current NCAA All-time Division I Scoring Leader. == Education == She went to high school at Dowling Catholic High School in West Des Moines, Iowa. Many colleges aimed to get her to play for their women's basketball program. Clark chose to stay in her home state and play for the Hawkeyes. Clark led Division I in scoring as a freshman, sharing Freshman of the Year honors and being named an All-American. She again led Division I in scoring as a sophomore, but also led in assists, being the first to lead in both in a single season. For her second season, she was named a unanimous All-American. In her junior season at Iowa, she led the Hawkeyes to a national championship game appearance for the first time in the school's history. She was again named a Unanimous All-American and was named the Player of the Year by many media publications. ==College career== ===Freshman year=== Clark began her freshman season at Iowa as the team's starting point guard. She played her first game on November 25, 2020 against Northern Iowa, which ended in a 96–81 win for the Hawkeyes. In the win, she scored 27 points and also had eight rebounds and four assists. In her next game, she posted her first career double-double with 30 points and 13 assists in a win over Drake. On December 22, she posted her first career triple-double as Iowa beat Western Illinois. Clark shot the ball at a low percentage, but still scored 13 points, and had 13 rebounds and 10 assists. On February 11, 2021 she scored a season-high 39 points in a win against Nebraska. Clark added 10 rebounds and seven assists in the game. She finished the regular season being named the Big Ten Freshman of the Year and a unanimous first-team All-Big Ten selection. Clark and Iowa finished as the runners-up of the Big Ten Tournament. In the second round of the NCAA Division I women's tournament, Clark scored 35 points and made 6 three-pointers in a win against Kentucky. Both were schools records in tournament play. With the win, Iowa reached the Sweet 16 round. In that round, Clark scored 21 points as Iowa lost to UConn 92–72. At the end of the season, the United States Basketball Writers Association (USBWA) named her a first-team All-American. The Associated Press (AP) also named her as a second-team All-American. Clark was also named to the Women's Basketball Coaches Association (WBCA) Coaches' All-America team. She became the first freshman to win the Dawn Staley Award, which is given to Division I's best point guard. Additionally, Clark and UConn's Paige Bueckers were named the WBCA Co-Freshmen of the Year. The two also shared that year's Tamika Catchings Award, the USBWA's Freshman of the Year honor. Clark finished her freshman season averaging 26.6 points, 7.1 assists, and 5.9 rebounds per game (rpg). Her 26.6 points per game (ppg) led Division I women's basketball in scoring and also set an Iowa freshman record. ===Sophomore year=== Clark began her second season at Iowa with 26 points, eight rebounds, and six assists in a 93–50 win against New Hampshire. On January 2, 2022, Clark scored 44 points in a big 93–56 win over Evansville. During the game, she reached 1,000 career points, setting a Big Ten women's record as the fastest player to do so. Later in January, she had two triple- doubles in a row in wins over Nebraska and Minnesota. She scored 30 points in both games, becoming the first NCAA Division I player in either men's or women's basketball to post two 30-point triple-doubles in a row. Then on January 25, she had 18 assists in a win against Penn State. This set an an Iowa record and tied the Big Ten Conference record for assists in a single game. On February 6, she scored her career high of 46 points, but Iowa lost to Michigan. Clark was named the Big Ten Conference's Player of the Year by coaches and media. She also was named a unanimous All-Big Ten player. Clark helped Iowa win the Big Ten conference tournament and was named the tournament's most outstanding player (MOP). Iowa was expected to make a run in the NCAA tournament but Creighton upset the Hawkeyes in the second round. Clark had a season-low 15 points against Creighton and shot poorly, making only 4-of-19 attempts. For her performance in her second season, Clark was named a unanimous All-American. Clark also won the Dawn Staley Award again, becoming the first player to win it twice and in back-to-back seasons. Clark also won the Nancy Lieberman Award, another award given to Division I's top point guard. Clark finished the season averaging 27 points, eight rebounds, and eight assists per game (apg). She led Division I in ppg and apg, becoming the first player to do so. ===Junior year=== During the preseason of her junior year, basketball coaches and media set high expectations of Clark. She was unanimously picked to be on the AP preseason All-America team. Early into the season, Clark suffered an ankle injury with just a few seconds left in a game against Kansas State. The Hawkeyes lost that game 83–84. Despite the injury, Clark played the next game to help the Hawkeyes win against Belmont. On December 1, she scored her season-high of 45 points, but Iowa lost to North Carolina State. === Senior year === Clark won many awards and highlights during her senior year at Iowa. She became the new NCAA All-time Division I Scoring Leader. She became well-known for her skill at three-point shooting. Women's college basketball became one of the most watched sports during March Madness 2024. Iowa made it to the Final Four National Championship, but lost to the South Carolina Gamecocks. == WNBA career == On April 15, 2024, Clark was selected in the first round, first overall pick by the Indiana Fever in the 2024 WNBA Draft. ==References== Category:2002 births Category:Living people Category:American basketball players Category:American philanthropists Category:American Roman Catholics Category:Point guards Category:Sportspeople from Des Moines, Iowa Category:Women's basketball players",
 "title": "Caitlin Clark"
}