{
 "id": "1003412",
 "text": "Cosmic time, or cosmological time, is the time coordinate commonly used in the Big Bang models of physical cosmology.In mathematical terms, a cosmic time on spacetime M is a fibration t \\colon M \\to R. This fibration, having the parameter t, is made of three-dimensional manifolds S_t.On the physical basis of cosmic time by S.E. Rugh and H. Zinkernagel Such time coordinate may be defined for a homogeneous, expanding universe so that the universe has the same density everywhere at each moment in time (the fact that this is possible means that the universe is, by definition, homogeneous). The clocks measuring cosmic time should move along the Hubble flow. Cosmic time t is a measure of time by a physical clock with zero peculiar velocity (weird speed) without matter over-/under-densities (to prevent time expanding due to relativistic effects or confusions caused by expansion of the universe). Unlike other measures of time such as temperature, redshift, particle horizon, or Hubble horizon, the cosmic time (similar and combining in a way to make something better to the comoving coordinates) is blind to the expansion of the universe. There are two main ways for establishing a reference point for the cosmic time. The most easy way is to take the present time as the cosmic reference point (sometimes referred to as the lookback time). In a different way, the Big Bang may be taken as reference to define t as the age of the universe, also known as time since the big bang. The current physical cosmology estimates the present age as 13.8 billion years.How Old is the Universe? The t=0 doesn't necessarily have to go along with a physical event (such as the cosmological singularity) but rather it refers to the point at which the scale factor would dissappear for a standard cosmological model such as Lambda-CDM model. For instance, in the case of inflation, In other words a non-standard cosmology, the hypothetical moment of big bang is still decided using the test result cosmological models which may happen at the same time as the end of the inflationary epoch. For technical purposes, ideas such as the average temperature of the universe (in units of eV) or the particle horizon are used when the early universe is the goal of a study since understanding the interaction among particles is more important and related than their time coordinate or age. Cosmic time is the standard time coordinate for specifying the Friedmann–Lemaître–Robertson–Walker solutions of Einstein field equations. == References == Category:Time",
 "title": "Cosmic time"
}