{
 "id": "1003870",
 "text": "Võro language (also called Võro kiil, Võru language, or Seto-Võro language) is a Finno-Ugric language spoken primarily in the Võru County of southeastern Estonia. With an estimated 75,000 speakers, the Võro language is recognized as a minority language in Estonia. Võro language is a unique and important part of Estonia's cultural heritage. It has its own unique grammar, vocabulary, and pronunciation. Despite being a minority language, it has played a significant role in Estonian cultural identity. Efforts continue to promote the use of Võro and preserve its cultural heritage. == History == The Võro language has a complex history. Its roots can be traced back to the Finno-Ugric language family, which includes other languages spoken in northern and eastern Europe. Throughout its history, the Võro language has evolved and changed, influenced by cultural and linguistic factors from the region. Today, it is recognized as an important regional language of Estonia, with its own distinct grammar, vocabulary, and cultural identity. === 18th century === During the 18th century, Estonia was part of the Swedish Empire, and the Võru County was located on the eastern border of the empire. The region was sparsely populated, with small villages and farms scattered throughout the countryside. The economy was largely based on agriculture and forestry, with some trade and handicrafts also present. Because the region was so isolated with so much poverty, Võro was probably a rural and traditional language during the 18th century. It was spoken primarily by the peasant class, who made up the majority of the population. The language was transmitted orally from generation to generation, with little or no formal education in the language. One of Võro's defining features is its rich set of vowel sounds and its complex system of cases. 18th-century Võro probably had these features, though they may have changed over time. Võro at the time also had a unique vocabulary, with many words related to traditional agricultural practices, crafts, and other parts of rural life. During the 18th century, there were few opportunities to read or write in the Võro language. For this reason, there is little direct information about the language at that time. Some traditional songs, poems, and stories may have been passed down orally, but these were not known outside the Võro region. === 19th and 20th centuries === In the 19th and 20th centuries, Võro speakers began to use their language in written form. This was part of a wider movement to promote the use and preservation of minority languages. == Features == One of the defining features of the Võro language is its distinctive accent and pronunciation. Võro language has a rich set of vowels and consonants, and its intonation patterns and stress placement are unique compared to other languages. The language also has a rich vocabulary, with many words borrowed from neighboring languages such as Latvian and Russian, as well as its own unique terminology for cultural concepts and traditional practices. === Grammar === In terms of grammar, Võro language has a complex system of cases. Võro uses several different cases to indicate the subject, object, and other grammatical elements in a sentence. The language also has a rich system of verb conjugation and agreement, with different verb forms used to indicate tense, aspect, and mood. == Dialects == The Võro language has a rich and diverse set of dialects. This reflects the language's long history and the many influences which have shaped it over time. These dialects are typically used in specific regions within the historical Võrumaa area. They can vary in their pronunciation, vocabulary, and grammar. They are not static; they change over time due to migration, social and cultural shifts, contact with other languages, and other factors. Even though there are many Võro dialects, efforts have been made to promote a standard written form of the language, known as \"Võro kiil\". This standard form is based on the central dialect of Võru, and is used in written materials such as books, newspapers, and online publications. However, many speakers of Võro continue to use their own regional dialect in everyday conversation, and there is a strong sense of pride in the diversity of dialects that make up this unique and vibrant language community. === Seto === Seto is one of the most distinctive dialects of Võro. It is spoken in southeastern Estonia and southwestern Russia. It uses a unique writing system known as the \"Old Orthography.\" Some linguists think Seto is a unique language, not a dialect. === Others === Other major dialects include Central Võro, Haanja Võro, Leelo Võro, Mulgi (spoken in the Mulgimaa region), and Karula (spoken in the Karula National Park area). Speakers of different Võro dialects can generally understand one another. In fact, there is a strong sense of linguistic unity among the Võro community. Linguists have identified a number of features that distinguish the different Võro dialects. For example, the Seto dialect is known for its use of the velar fricative /x/ in place of the standard Võro /h/, while the Mulgi dialect is known for its use of the sound /ɨ/ in place of the standard Võro /i/. == Cultural importance == Despite being a minority language, the Võro language has played an important role in Estonian cultural heritage. It has been the subject of numerous works of literature, including poetry, fiction, and drama. Many traditional songs and dances are performed in Võro language. Efforts have been made to promote the use of Võro. These include the the establishment of the Võro Institute in 1995; it is dedicated to the study and preservation of Võro language and culture. In addition, Võro language is taught in some schools in the Võru County, and there are cultural events and festivals that celebrate the language and its heritage. Category:Uralic languages Category:Estonian culture",
 "title": "Võro language"
}