{
 "id": "1003244",
 "text": "Arcosanti is an experimental town in Yavapai County, central Arizona, United States. It is 70 mi (110 km) north of Phoenix, at an elevation of . The main activity of the town is making bells. Italian-American architect Paolo Soleri (1919–2013) proposed a concept he called arcology. He started constion in 1970. He wanted to show how urban conditions could be improved, while looking at minimizing the negative impact. He influenced many architects and designers, who worked with him on the project. == Overview == The goal of Arcosanti is to explore the concept of arcology, which combines architecture and ecology. The project also wants to minimize resource use and keep access to the natural environment. The experimental town has been built on of a land preserve, of which are owned by the Cosanti Foundation, with the remainder leased from the state. The building has happened at varying speeds, but still continues. The most recently completed building was finished in 1989. The population has varied between 50 and 150 people. Many of them are students and volunteers. The goal was for Arcosanti to house a population of 5,000 people. So far, thirteen major structures have been built on the site. ==Gallery== File:020 Arcosanti-Buildings & Fall Foliage 11-22-2011.jpg|Part of the complex with fall foliage File:The Cafe at Arcosanti.jpg|The cafe's dining area, two stories below the Arcosanti Visitors' Center and Gallery File:Cosanti Work Room.jpg|A work room File:022 Arcosanti-Ceramics Apse 11-22-2011.jpg|The Ceramics Apse File:Arcosanti vaults 04.jpg|The Vaults == References == == Other websites == * Official Arcosanti website * Arcosanti alumni address book * Lonely Planet Travel Guide Description of Arcosanti * The Arcosanti Work Song (c)1972 * Andrea Sachs, \"Arcosanti: A 'City' Grows Green in the Arizona Desert\", Washington Post, April 20, 2008 * Bishop, Snowden, \"The Genius of Arcology: The Sustainable Theories of Paolo Soleri, AZ Green Magazine, February 6, 2011 * Chris Colin, \"Sipping From a Utopian Well in the Desert\", New York Times, September 16, 2007 * Duncan Geere, \"Five real-world arcologies under construction\" , Wired.co.uk, June 21, 2011 * Tortorello, Michael, \"An Early Eco-City Faces the Future\", New York Times, February 15, 2012 Category:Cities in Arizona",
 "title": "Arcosanti"
}