{
 "id": "1003436",
 "text": "State Academic Folk Dance Ensemble Faizi Gaskarov is a professional folk dance company of the Republic of Bashkortostan. The ensemble was formed in 1936-38. The first dancers were graduates of the ballet school and amateur dancers. In 1938, the ensemble was part of the Bashkir State Philharmonic. On March 11, 1939, Faizi Gaskarov, a student of Igor Moiseev, became the artistic director of the ensemble. In 1940 the group was formed as an independent ensemble. In the same year there were the first tours of Bashkortostan. Later there were tours to the USS, Turkey and other countries. In 1988, the ensemble was named after Fayzi Gaskarov.The regional encyclopedic portal \"Bashkortostan\" (ru) The repertoire of the ensemble includes Bashkir dances 'Seven Girls', 'Gulnazira', 'Zarifa' and others. The ensemble also performs dances of the peopl of Russia. Folklore of Bashkortostan People: Encyclopedia / [Scientific. Collegium: F. A. Nadrshina (chap. Ed.), S. I. Apsatarova, L. A. Afanasyeva, V. Ya. Babenko, F. G. Galieva, M. Kh. Idelbaev, I.E. Karpukhin, T. G. Minnihmetova, I. G. Petrov, R. R. Sadikov, U. G. Saitov (ed.), R. A. Sultangareeva, I.K. Fazlutdinov, G. R. Khusainova;. - Per. in English. Yaz.: LLC \"Center for Intercultural Cooperation\". -Ufa: \"Bashkir Encyclopedia\", 2020.- . (en) The audience likes the American Country dance, the Argentine Gaucho dance, the Spanish Andalusian Evenings dance, and the Indian dance. The repertoire of the ensemble includes more than 140 folk dances of the world. Thanks to the performances of the ensemble, people in different countries of the world learn about the Bashkir culture, about Bashkortostan. Only in recent years, the folk dance ensemble has toured in France, Italy, Spain, Switzerland and Germany. Turkey, Great Britain, in the countries of Southeast Asia.History on the ensemble's official website (ru) == Awards == * Salawat Yulayev Award * In 1994, the ensemble won the bronze prize of the Stars of the World festival (Turkey). * In October 2013, at the UNESCO, the ensemble was awarded the UNESCO Gold Medal \"Five Continents\", the diploma \"Ambassador of the World\" (ru) == References == Category:Bashkortostan Category:Dance",
 "title": "State Academic Folk Dance Ensemble Faizi Gaskarov"
}