{
 "id": "100303",
 "text": "Singapore Changi Airport , or simply Changi Airport, is a commercial airport serving Singapore, and is one of the largest transportation hubs in Asia. It is located in Changi, at the eastern part of the island of Singapore, on a site. The airport also consists of Jewel Changi Airport. The airport is operated by the Civil Aviation Authority of Singapore (CAAS), and is the home base of Singapore Airlines, Singapore Airlines Cargo, Jetstar Asia Airways and Scoot. Singapore Changi Airport has been rated the best airport in the world by Skytrax for 8 years in a row. The airport has also been rated as being one of the world's cleanest airports and highly rated international transit airports. == History == Changi Airport opened on July 1, 1981, and was the largest airport in Asia at the time of its opening. The first flight to arrive at the new airport came from Kuala Lumpur International Airport in Malaysia and the first flight to leave was for Penang, also in Malaysia. When the airport first opened, it only handled about 8 million passengers a year. This number has grown, and in 2015, the airport handled a record of 55,448,964 passengers, a 2.5% increase over the previous year. ==Design== The airport currently has four terminal buildings: * Terminal 1 is the oldest and opened with the airport in 1981. * Terminal 2 was the next to open, doing so in 1990. * Terminal 3 is quite new, having opened only in 2008. * Terminal 4 is the newest terminal, having opened on 31 October 2017. There used to be a terminal just for budget airlines, but it was destroyed to make way for Terminal 4. Terminal 4 now sits on the land that the old terminal for budget airlines used to occupy. People can go between Terminals 1, 2, and 3 (but not Terminal 4) using an automatic, driverless train called the Skytrain. The system opened in 1990 and received new trains in 2006. A new building with shops and hotels is being built that will connect to each of these three terminals directly. It is called Jewel Changi Airport and will be ready in early 2019. A new terminal building, Terminal 5, is being built on an empty piece of land opposite the current airport terminals. It will open in the 2020s and be bigger in size than Terminals 1, 2, and 3 combined. ==Ground transportation== It is very easy to get to and from Changi Airport. One of the stations on Singapore's MRT network is called Changi Airport, and it is located at the end of a two-stop branch of the East West Line. The station, which opened in 2002, is located between Terminals 2 and 3 of the airport and can be reached from both terminals. To get into the city one has to change to another East West Line train at Tanah Merah or, since 2017, to the Downtown Line at Expo. Terminal 5 could possibly be served by an extension of the Thomson-East Coast Line when it is completed. == References == == Other websites == * Singapore Changi Airport Official Site Category:1981 establishments in Singapore Category:Airports in Asia Category:Buildings and structures in Singapore Category:Changi Category:Transport in Singapore",
 "title": "Singapore Changi Airport"
}