{
 "id": "1003796",
 "text": "Princess Birgitta of Sweden (Birgitta Ingeborg Alice; 19 January 1937 – 4 December 2024) was an elder sister of King Carl XVI Gustaf. ==Family== She was born at Haga Palace in Stockholm. She is the second child of Prince Gustaf Adolf, Duke of Västerbotten, and Princess Sibylla of Saxe-Coburg and Gotha, and a granddaughter of King Gustaf VI Adolf. Her sisters are Princess Margaretha, Mrs. Ambler, Princess Désirée, Baroness Silfverschiöld, and Princess Christina, Mrs. Magnuson. She was a first cousin of Queen Margrethe II of Denmark and Queen Anne-Marie of Greece. ==Marriage== In 1959, Birgitta met Prince Johann Georg of Hohenzollern at a cocktail party in Germany. On 15 December 1960, their engagement was announced. The couple married in a civil ceremony in the Hall of State of the Royal Palace of Stockholm on 25 May 1961. The bridesmaids were the bride’s sister Princess Christina and cousin Princess Benedikte of Denmark; the groomsmen were the bride's brother Crown Prince Carl Gustaf and her cousin Count Michael Bernadotte of Wisborg (son of Sigvard Bernadotte). A Roman Catholic ceremony was held at Sankt Johann Church at the groom's family seat of Sigmaringen, Germany, on 30 May 1961. Princess Birgitta and Prince Johann Georg had three children: * Prince Carl Christian of Hohenzollern (b. 5 April 1962 in Munich) * Princess Désirée of Hohenzollern (born 27 November 1963, Munich) * Prince Hubertus of Hohenzollern (born 10 June 1966 in Munich) Prince Johann Georg and Princess Birgitta separated in 1990, although they stayed legally married (they did not divorce). She lived on the island of Majorca in Spain, while her husband lived in Munich. He died in 2016. ==Death== On 4 December 2024, Princess Birgitta died in Mallorca, Spain, at the age of 87. ==Ancestry== ==References== ==Other websites== Category:1937 births Category:2024 deaths Category:House of Bernadotte Category:Swedish princesses Category:Royal Order of the Seraphim",
 "title": "Princess Birgitta of Sweden"
}