{
 "id": "1003524",
 "text": "New York City is a painting by Piet Mondrian. The painting was completed in 1942. It used to be known as New York City I It is on display in the Musée National d'Art Moderne at the Centre Pompidou in Paris, France. There is an unfinished version of the work, called New York City I. It has strips of paper tape, which the artist could re-arrange to try what different designs would look like. The unfinished version is shown at the Kunstsammlung Nordrhein- Westfalen in Düsseldorf, Germany. In 2022, people discovered that the artwork had been hanging upside down for years. To avoid damaging the painting, its orientation was not changed. == New York City I == The Guardian states that the painting was first shown at the Museum of Modern Art (MoMA) in New York City in 1945. The Netherlands Institute for Art History has no record of this exhibition, and says that the painting was first shown at the Valentine Gallery in New York City in 1946 for about three weeks. The estate of Piet Mondrian in New York City owned the painting until they sold it to the city's Sidney Janis Gallery in 1958. It was then briefly in the hands of Galerie Beyeler in Basel, Switzerland, in 1980. Kunstsammlung Nordrhein-Westfalen bought it later that same year. Art historian Susanne Meyer-Büser announced in October 2022 that the artwork had been displayed upside down at the Kunstsammlung Nordrhein-Westfalen for decades. The other artwork New York City has a denser group of lines at the top of the painting, which were said to represent the sky, while New York City I was displayed with those lines at the bottom. A picture of the painting in the artist's studio also showed the painting with the denser lines at the top. There is no signature on the canvas. This might have added to the confusion. Mondrian had not signed the work, possibly because it was unfinished. After the issue was pointed out, a number of people stated that the error was obvious. Because the work is very fragile, the museum decided to keep the painting oriented upside down. Changing the orientation of the painting might have caused parts of it to disintegrate; the adhesive used has deteriorated, some of the tapes are \"hanging by a thread\". == Notes == == References == Category:1940s paintings",
 "title": "New York City (painting)"
}