{
 "id": "1004528",
 "text": "Duncan M W Penn is an entrepreneur, executive producer, angel investor, and #1 NYT bestselling author, Duncan is an early investor in SpaceX, xAI, Tesla, Lyft, and Neuralink. His brother Jonathan Penn is an A.I. professor and researcher at the University of Cambridge. In 2024 Duncan was voted a Top 100 Influential People. == Executive producer == Duncan is the creator and executive producer of 5 television shows, including Letterkenny on Hulu and CraveTV, Movie Night With Karlie Kloss on Freeform, Dare to Live on MTV, and Greatest Party Story Ever on MTV. He is also the creator, executive producer, and star of the MTV documentary series The Buried Life, named after the poem by Mathew Arnold, written in 1852. The Buried Life follows four friends as they go after a bucket list of dreams and ask the world the question, \"What do you want to do before you die?\" For everything they accomplished on their list, they helped a stranger do something on theirs. He is also the co-author of the No. 1 New York Times Best Selling book \"What Do You Want To Do Before You Die?\". In 2024, The Buried Life announced the production of a new documentary series sharing the story of The Buried Life. The series will be executive produced by singer-songwriter Shawn Mendes and YouTube creators The Yes Theory. The documentary will star David Dobrik, Taylor Swift, Barak Obama, Jake Paul, Logan Paul, Shawn Mendes, The Yes Theory, as well as The Buried Life cast, Duncan, Dave, Ben, and Jonnie. == Investor == Duncan does primary private capital placements into pre-ipo tech companies. Duncan is an early investor in SpaceX, xAI, Tesla, Lyft, and Neuralink. Duncan is the co-creator of the gag gift Burnt Hair Perfume with Elon Musk, and was released as a joke by The Boring Company in 2023. == Philanthropy == Duncan is a Major Gift Officer for The Givepower Foundation, a charity that deploys Tesla, solar, and desalination technology to help solve electricity and freshwater problems around the world. Givepower currently operates in Kenya, Haiti, the Philippines, Guatemala, and Columbia. Duncan has helped provide fresh water and electricity to over 2 million people worldwide. In 2011, Duncan, with the Buried Life cast, made a $300,000 donation to The Keep America Beautiful foundation. == The Buried Life on MTV == After high school, Duncan founded The Buried Life with his brother Jonnie Penn and two childhood friends, Ben Nemtin and Dave Lingwood. The Buried Life asks the world the question, \"What do you want to do before you die?\" Together, The Buried Life cast accomplished 86 items on the list out of 100, including Play Ball Against Obama, Deliver a Baby, Crash the Playboy Mansion, Reunite a Family, Tell a Joke on Late Night Television, Survive on Deserted Island, Streak a Professional Sports Game, Make a Million Dollars, Ride a Bull, Get Married in Vegas, Ask out Megan Fox. In 2011, Duncan and The Buried Life cast appeared on The Oprah Winfrey Show to announce a new season of The Buried Life and to discuss crossing off #95: Play Ball with President Barack Obama.. The Buried Life was recorded by the Guinness World Records for the largest roulette spin in Las Vegas history. The spin was made at the Golden Nugget in Las Vegas, with all benefits going to the World Food Programme. The Buried Life still holds this record. In 2012, Duncan swam from Alcatraz Island in San Francisco to the mainland in the winter wearing a speedo. In 2011, The Buried Life successfully organized the biggest speed dating event in history with the University of South Florida. In July 2011, Duncan asked out Taylor Swift at the Country Music Awards and went on a date later that year after the VMAs in Los Angeles. == Awards == * In 2011 and 2013, Duncan and The Buried Life team were nominated for a Prism Award. * In 2011, President Obama called The Buried Life series “Television for a new generation.” * Oprah called The Buried Life series “inspirational.” Duncan appeared on the Oprah Winfrey Show in 2011. * Duncan has appeared as himself on The Ryan Seacrest Show OnAir, Rachel Ray Show, The Oprah Winfrey Show, MTV Awards, VMA Awards, Howard Stern Show, and Maxim Radio. * In 2024, Duncan was nominated for The Order of the British Empire. * In 2024, Duncan was voted a Top 100 Influential People. == Atticus == It has been rumored Duncan is the NYT's best selling anonymous poet, Atticus. Atticus is one of the best selling living poets. == References == == Other websites == * Category:1983 births Category:Writers from British Columbia Category:Living people Category:Canadian television producers Category:People from Vancouver",
 "title": "Duncan Penn"
}