{
 "id": "1004524",
 "text": "Global66 is a Latin American fintech founded on December 18, 2018 in Chile by Tom치s Bercovich and Crist칩bal Forno. It offers a global account with financial services to Latin Americans for currency conversion, international money transfers to bank account, collection link and Mastercard prepaid cards available in Colombia, Chile and Peru. It operates in 6 countries (Chile, Colombia, Peru, Mexico, Argentina, and Ecuador) and supports money transfers to more than 80 countries. The platform also has a financial services segment for companies. During 2021, Global66 transferred more than 1 trillion dollars in volume.Since its creation it has registered more than 700 thousand users. The company has raised investments totaling more than US$20 million from Angels, Family Offices and venture capital firms in Latin America, the United States and the United Kingdom. == History == Global66 is a Chilean fintech founded on December 18, 2018 by Tom치s Bercovich and Crist칩bal Forno. Bercovich and Forno met as partners and friends at Columbia Business School in 2012. In 2017, after a trip to London where Forno witnessed the impact of technology on people's financial lives in Europe, he invited Bercovich to join him as a partner in building a financial marketplace for Latin America, with an interest in creating a global digital bank in the region. They moved to London with their families to study the industry in depth. During this time, they tried to partner with major fintech companies in Europe, but many turned them down. With a small team, they started their first project, transferenciaperu.com,12 a single-broker money transfer service from Chile to Peru. Eventually the project grew and consequently, they increased their team to build infrastructure in Latam. Finally, by the end of 2018, they managed to open more routes and launched Global66.com.In 2021, they closed their Series A and raised $12 million there in a round led by Quona Capital. Magma Partners, Venrex Investment Management and Clocktower Ventures. == References == Category:Organisations based in Chile Category:Banks Category:Technology companies",
 "title": "Global66"
}