{
 "id": "1004380",
 "text": "Moriah Rose Pereira (born January 1, 1995), known by her stage name Poppy is an American musician. She used to go by the name That Poppy. She first became famous in 2014, when she was in satire YouTube videos where she pretended to be a robot. Now she makes music. == Early life == Moriah Rose Pereira was born on January 1, 1995 in Boston, Massachusetts. She moved to Nashville, Tennessee when she was 14. She took dance lessons for 11 years, but decided she wanted to be a musician instead. She got bullied at school, so she was home-schooled for a while. She moved to Los Angeles, California when she was 18. == Career == === 2011–2014: Moriah Poppy and ThatPoppyTV === Poppy sang in front of people for the first time in August 2011. She sang an Alanis Morissette song. She made two YouTube channels: \"Moriah Poppy\" and \"ThatPoppyTV\". \"Moriah Poppy\" was later deleted, and \"ThatPoppyTV\" was renamed to \"Poppy\". Poppy sang at social media events in 2012 and 2013. === 2015–2016: YouTube partnership, Bubblebath, and 3:36 (Music to Sleep To) === Poppy moved to Los Angeles in 2013 to become famous in music. Then she met Titanic Sinclair and they made videos on her YouTube channel called \"ThatPoppyTV\". Her YouTube video titled \"I'm Poppy\" went viral in 2015. In June 2015, Poppy put out her first song. It was called \"Everybody Wants to Be Poppy\". She sang at a music festival in Mexico in November 2015. Then she made a song called \"Lowlife\" and put it on her first pop music EP called \"Bubblebath\". On October 17, 2016, Poppy made an instrumental album called 3:36 (Music to Sleep To) to help people sleep, but it is not considered her first album. === 2017–2018: Poppy.Computer, Poppy.Church, and Am I a Girl? === In 2017, Poppy won the 'Breakthrough Artist' award at the Streamy Awards. Poppy's first album came out on October 6, 2017 and it was called Poppy.Computer. She went on a tour. In April 2018, Titanic Sinclair's old partner named Mars Argo filed a big lawsuit against him and Poppy for copyright infringement. She said that Poppy's videos were copied from hers. She also said that Sinclair abused her. Poppy's case was dismissed. Poppy released her second album on October 31, 2018. It was called Am I a Girl?. Poppy made a website called Poppy.Church, where her fans could chat. It is not available anymore. === 2019–2020: Choke, Genesis 1, I Disagree, and Poppy's Inferno === On July 10, 2019, Poppy put out a comic book called Genesis 1. The book came with an instrumental album called I C U: Music to Read To. On June 28, 2019, Poppy put out her second EP. It is called Choke. Poppy stopped working with Titanic Sinclair in 2019. She said he manipulated her. On January 10, 2020, she put out her third album, called I Disagree. The album has more of a metal sound. In August, she added three more songs and called it I Disagree (more). She put out her second comic book, Poppy's Inferno on October 20, 2020. It came with a noise album called Music to Scream To. She also made a Christmas-themed EP in 2020 called A Very Poppy Christmas. === 2021–2022: Eat, Flux, and Stagger === Poppy's song \"Bloodmoney\" got nominated for a Grammy Award. She was the first solo female artist to be nominated in the metal category. She did not win the award. She made the soundtrack for a wrestling show called WWE NXT. She called it Eat (NXT Soundtrack). Her fourth album, Flux, came out on July 29, 2021. She did a lot of concerts in 2022 called the Never Find My Place Tour. It was her first time doing a concert tour since her shows in 2020 were cancelled because of COVID. Poppy released the Stagger EP on October 14, 2022. === 2023–present: Zig and Negative Spaces === Poppy released her fifth album Zig on October 27, 2023. Her 6th album, Negative Spaces, is set to release on the 15th of November, 2024. == Personal life == Poppy had trouble choosing her gender, but she has decided she is a woman. Poppy dated a rapper named Ghostemane between 2019 and 2021. They planned to get married before they broke up. Poppy is friends with Marilyn Manson. == Discography == === Studio albums === * Poppy.Computer (2017) * Am I a Girl? (2018) * I Disagree (2020) * Flux (2021) * Zig (2023) === Soundtrack albums === * 3:36 (Music to Sleep To) (2016) * I C U (Music to Read to) (2019) * Music to Scream To (2020) === Extended plays === * Bubblebath (2016) (using the name \"That Poppy\") * Choke (2019) * A Very Poppy Christmas (2020) * Stagger (NXT Soundtrack) (2021) * Stagger (2022) ==== Remix EPs ==== * Poppy.Remixes (2018) == Books == * The Gospel of Poppy (2017) * Genesis 1 (2019) * Poppy's Inferno (2020) * Tit Tat (2023) == Tours == * Poppy.Computer Tour (2017–2018) * Am I a Girl? Tour (2018–2019) * Threesome Tour (2019) (with Bring Me the Horizon and Sleeping with Sirens) * I Disagree Tour (2020) * Never Find My Place Tour (2022) * Godless/Goddess Tour (2023) (with Pvris) * Zig Tour (2024) == References == Category:1995 births Category:American singer-songwriters Category:People from Boston",
 "title": "Poppy (singer)"
}