{
 "id": "1004813",
 "text": "The Shrine Consolidation Policy was a plan by the Meiji Japanese government to get rid of many small Shinto shrines and combine their duties with bigger regional shrines.. In 1900, a government branch called the Bureau of Shrines (Jinja kyoku) was formed as part of the Home Ministry. This branch was in charge of carrying out the Shrine Consolidation Policy. The Shrine Consolidation Policy was made to decrease the power of Shinto, and the government wanted to control the remaining shrines. The goal was to make the shrines easier to manage. Even though many people didn't like it, 77,899 Shinto shrines were closed in the first twenty years of the policy. The Shrine Consolidation Policy was in effect until the end of World War II, but it had the biggest impact in the first six years after it started in 1906. By 1912, the number of shrines that were closed decreased significantly. == Overview == To strengthen shrines, the government either moved the deities from smaller shrines to larger ones or combined multiple shrines' deities into one shrine. The result was fewer, larger shrines under government control. During the Meiji and Taisho eras, the Japanese government merged smaller, unprofitable shrines in an effort to enhance the presence of shrines overall. The Bureau of Shrines in the Home Ministry was responsible for this reorganization, focusing on village shrines and unranked shrines. The government's goal was to organize existing shrines and limit the number of shrines receiving offerings. However, there were accusations of corruption and attempts to seize land for financial gain. In 1906, an imperial edict called \"With Regard to the Provision of Offerings to Shrines of Prefectural Rank and Below\" was issued to financially support thriving shrines only, leading to the merging of many shrines. Under the edict, merged shrines, temples, and other sacred sites were required to surrender their land without compensation. Local authorities in Wakayama and Mie prefectures in particular carried out mergers, resulting in a significant reduction in the number of shrines by 1914. Some intellectuals and politicians resisted the merger policy, leading to its eventual eschewal by the Bureau of Shrines. == Shrine merger at the end of the Meiji period == === Purpose of Shrine merger === The \"Shrine merger\" policy aimed to decrease the number of shrines in Japan and focus resources on those remaining. This was done to ensure that the remaining shrines had facilities and properties that met a certain standard, and to maintain their dignity while establishing their continuous management. Additionally, the Meiji government recognized sect Shinto as a religion, but considered shrines as \"national religious ceremonies\" rather than religious. The policy of reducing the number of shrines was also implemented to make it financially possible for local governments to provide public funds to prefectural shrines and smaller shrines, according to the Ministry of the Interior.「日本的霊性」を問い直す 鎌田東二、千葉大学公共研究 第3巻第1号（2006 年6月） The Ministry of Home Affairs' Bureau of Shrines was responsible for implementing this policy. However, it seems that the Ministry's Regional Bureaus also played a role. These local bureaus were not willing to let local governments use public funds to support shrines below the prefectural level, which was one of the goals of merging shrines. This was because it would increase the financial burden on the local governments. Nevertheless, this was still included in the policy. The \"shrine-centered theory\" is the belief that local communities in Japan should focus on their shrines as a way to promote self-governance. This led to a policy of enshrining one shrine per town or village, which was called \"one town, one village, one shrine.\" By using the Ujiko area associated with the shrine to align with administrative divisions, the government aimed to make the shrine the central hub of local activities. == Background of the ritual policy == In 1906, the Japanese Minister of the Interior, Takashi Hara, created a policy called the \"shrine ritual policy.\" This policy aimed to regulate how people used shrines in Japan. At first, it was not strictly enforced, but later, the Minister of Interior of the Second Katsura Cabinet, Tosuke Hirata, made it stronger. Consequently, many shrines were demolished, especially in Mie, Wakayama, and Ehime prefectures. However, the degree of implementation varied in different regions, and some areas, like Kyoto, did not see significant changes. By 1914, about 200,000 shrines were affected nationwide, as 70,000 of them were destroyed. The shrine consolidation policy, which was based on bureaucratic rationalism, was not always implemented in accordance with the wishes of the shrine parishioners and worshippers. Settlements and administrative divisions did not always match, which resulted in some Ujigami being moved to places far from their worshippers due to the shrine mergers. As a result, some Ujigami were unable to be worshipped. Although some shrine parishioners refused to worship, in some places they were forced to worship. === Opposition movement === The parishioners and worshippers of the affected shrines did sometimes hold meetings to voice their opposition, but for the most part, they couldn't fight against the policy. Their dissatisfaction was often expressed in the form of stories about how the deities of the abolished shrines caused supernatural occurrences or hauntings. That said, intellectuals such as Kumagusu Minakata, a naturalist and folklore scholar known for his research on slime molds, strongly opposed this policy. In the south, the shrine merger movement was # weakening the godly thought, # hindering the harmony of the people, # debilitating the regions, # depriving the people of comfort, diminishing humanity and harming customs, # damaging patriotism, and # damaging security of the land. # historic sites and ancient traditions would be destroyed # natural landscapes and natural monuments would be destroyed. The opposition movements against the Shrine Consolidation Policy eventually stopped, and the Imperial Diet responded by temporarily halting the sudden increase in shrine merging after 1910 (1910-1943). However, the policy had already caused significant damage, resulting in the loss of many rituals and customs, and harming religious beliefs. Although the policy was eventually halted, the damage caused by it was significant and long-lasting. == Reconstruction of destroyed shrines == After World War II, the system of non- religious shrines that existed before the war was abolished, and all shrines became religious corporations. Many shrines that were previously merged were later restored. Even after a shrine was officially enshrined, some of its facilities were left behind, making it easier to restore them. It was generally easier to restore shrines in places where the traditional reverence for the shrine was maintained, but if the community that supported the shrine disappeared or changed due to changes in administrative boundaries or other circumstances, restoration was more difficult. == Related pages == * Shinto ** State Shinto ** Glossary of Shinto * Haibutsu kishaku == Sources == Category:Pages with unreviewed translations Category:State Shinto Category:Shinto shrines",
 "title": "Shrine Consolidation Policy"
}