{
 "id": "1004396",
 "text": "The Robert F. Kennedy Jr. presidential campaign was launched on April 5, 2023, when Robert F. Kennedy Jr. filed with the Federal Election Commission to run in the 2024 United States presidential election. He made his official campaign announcement on April 19 in Boston, Massachusetts. Early polling put Kennedy down at 14% against incumbent Joe Biden, who announced his own campaign on April 25. Kennedy was the second prominent figure to launch a campaign for the Democratic Party's nomination, being preceded by Marianne Williamson, who launched her own campaign on March 4, 2023. He first ran for the Democratic Party nomination, but announced on October 9, 2023, that he would instead run as an independent candidate. Attorney and philanthropist Nicole Shanahan was announced as Kennedy's running mate on March 26, 2024. In August 2024, Kennedy ended his campaign and announced his support for former President Donald Trump. ==Background== Kennedy is the eldest son of former U.S attorney general Robert Kennedy, who was a Democratic candidate for president in 1968. Kennedy is a nephew of John F. Kennedy, who was the 35th president of the United States from 1961 until his death in 1963. Kennedy is also the nephew of former U.S Senator Ted Kennedy, who was a Democratic candidate for president in 1980. Kennedy has received significant support from independents, youth, and those with low trust in traditional American politics. A November 2023 poll showed that he would win 22 percent of the vote if the 2024 presidential election was held then. However, ever since Super Tuesday, Kennedy has mostly stayed under 10% in the polls. == Ballot access == Ballot access has been a major issue for the Kennedy campaign. In some states, he has obtained signatures to be listed on the ballot as an independent candidate. In other states, he has been nominated by parties with ballot access or has formed political parties to obtain ballot access. Kennedy has obtained ballot access in the following states (with political party affiliations listed in paranthesis): In January 2024, he formed the We the People Party in order to ease ballot access requirements. In April 2024, he received the nomination of the Natural Law Party in Michigan and the American Independent Party in California. In May 2024, he received the nomination of the Independent Party of Delaware in Delaware, the Reform Party in Florida, and the Alliance Party in South Carolina. In July 2024, he received the nomination of the Libertarian Party of Colorado in Colorado. Kennedy also wanted, but did not receive, the nominations of the Alaskan Independence Party, the Unity Party of Colorado, and the Ecology Party of Florida. * Alaska * California (American Independent Party) * Colorado (Libertarian Party of Colorado) * Delaware (Independent Party of Delaware) * Florida (Reform Party) * Hawaii (We the People Party) * Idaho * Illinois * Iowa * Michigan (Natural Law Party) * Minnesota * Mississippi (We the People Party) * Nebraska * Nevada * New Hampshire * New Jersey * New Mexico * New York * North Carolina (We the People Party) * Ohio * Oklahoma * Pennsylvania * South Carolina (Alliance Party) * Tennessee * Texas (Texas Independent Party) * Utah * Washington Kennedy formed the Texas Independent Party in January 2024 to obtain ballot access in Texas, but is reportedly still struggling to meet signature requirements. He claimed in May 2024 that he has enough signatures to appear on the ballot in New York, but the campaign is hoping to gather even more before submitting their petition. Kennedy has attempted to get around ballot access signature requirements by seeking out the nominations of existing third parties that already have ballot access in certain states. On April 18, 2024, Kennedy got on the ballot in Michigan by receiving the nomination of the Natural Law Party. On April 28, Kennedy got on the ballot in California by receiving the nomination of the American Independent Party. On May 7, Kennedy got on the ballot in Delaware by receiving the nomination of the Independent Party of Delaware. On May 23, Kennedy received the nomination of the Reform Party (which got him on the ballot in Florida on June 5). On May 31, Kennedy got on the ballot in South Carolina by receiving the nomination of the Alliance Party. On July 2, Kennedy got on the ballot in Colorado by receiving the nomination of the Libertarian Party of Colorado, which refused to accept national Libertarian Party nominee Chase Oliver. == Views == === Abortion === In August 2023, Robert F. Kennedy Jr. suggested that he would support a three-month federal abortion ban. The Kennedy campaign clarified afterwards that Kennedy is pro-choice. In May 2024, Kennedy claimed that he didn't trust the government to interfere with abortion at all. Kennedy's campaign website lists Kennedy as believing in \"More Choices, More Life\", a position of supporting reproductive rights and implementing government policies that make child care easier for parents, which keeps abortion legal while reducing the number of abortions. ==Suspension== On August 20, 2024, Nicole Shanahan accused the Democratic Party of sabotaging their campaign and said that the Kennedy campaign would support former President Donald Trump during a podcast interview. The next day, the Kennedy campaign announced that it would hold a press conference in Phoenix, Arizona on August 23 talking about the future of the campaign. Sources also told ABC News that Kennedy is thinking about dropping out by the end of the week and supporting Trump, with hopes to stop Vice President Kamala Harris's lead in the polls after the 2024 Democratic National Convention. On August 23, 2024, Kennedy Jr. suspended his campaign and endorsed former President Donald Trump. == References == Kennedy, Robert F.",
 "title": "Robert F. Kennedy Jr. 2024 presidential campaign"
}