{
 "id": "1004851",
 "text": "Jerome and Jeremiah Valeska are fictional characters from the television show Gotham and are its version of The Joker. They are played by Cameron Monaghan. ==Season One== In the episode The Blind Fortune Teller, Detective James Gordon looks into the murder of a female snake dancer at a circus and talks to her eighteen year old son Jerome Valeska. At the end of the episode, it turns out Jerome killed her for fun and when he’s caught, he admits it and laughs. ==Season Two== Jerome Valeska is broken out of Arkham Asylum for the Criminally Insane by the new villain and becomes the leader of a gang of terrorists who call themselves Maniax! They kill the Mayor. They kill the person in charge of the Police. They massacre the police station and they steal a bus full of high school cheerleaders and try to kill them with explosives. Jerome also kills his father, a blind fortune teller. Jerome kills a magician and pretends to be him so that he can try to kill Bruce Wayne. Jerome kills the other terrorists for fun once he doesn’t need them anymore and he tries to kill Bruce. But then Theodore Galavan, who broke Jerome out of Arkham, kills Jerome so that Bruce will trust him. ==Season Three== A cult which worships Jerome Valeska finds his body and uses a machine they stole from mad scientist Hugo Strange to bring him back to life. When it doesn’t work, the cult leader cuts off Jerome’s face and wears it like a mask. Then Jerome comes back to life, kills the cult leader and takes the mask back. Then Jerome shuts down all the electricity in all of Gotham City and people start rioting. Jerome then kidnaps Bruce Wayne and takes him to his circus which he took over to kill him. Jerome tells Bruce what he wants is to prove that everyone is evil and that “there are no heroes in Gotham”. Jerome also tries to have Alfred Pennyworth murdered. Bruce manages to fight Jerome and beat him but he refuses to kill him even after Jerome loses his face in the fight. The police send Jerome to a hospital where he gets plastic surgery to get his face back and then put him back in Arkham Asylum. ==Season Four== After The Penguin is sent to Arkham Asylum for murder he meets Jerome Valeska. Jerome wants The Penguin to be the supervillain everyone says he is and when he’s not, he has everyone else attack, threaten, harass beat up and bully The Penguin to get him to show how dangerous he is. When that doesn’t happen Jerome decides to kill the Penguin. Then the Penguin outsmarts him, fights him, while miming, and beats him and after that Jerome starts to respect The Penguin. Later Jerome escapes with the Scarecrow, The Mad Hatter and other violent supercriminals and starts his own team called The Legion of Horribles with The Penguin Solomon Grundy, Firefly and Victor Freeze. Scarecrow creates a poison gas for Jerome that causes insanity and Jerome kidnaps the Mayor and city council and says that he’ll kill them unless his identical twin brother Jeremiah Valeska and his enemy Bruce Wayne surrender to him. Jeremiah refuses to do that until Bruce convinces him that it’s the right thing. Jerome tries to kill them both but Captain James Gordon rescues them. So instead Jerome decides to drop his insanity gas from a blimp so that everyone will be violent and insane. The Penguin then decides to tell Captain Gordon but Gordon ignores him since he doesn’t trust The Penguin. When The Penguin tries to convince Scarecrow and Mad Hatter not to go through with Jerome’s plan, they lock him in the Blimp. Jerome attacks Gotham City and Captain Gordon fights him and Jerome loses and falls to his death but he warns that what he did is just the beginning. The Penguin escapes and steers the blimp out of Gotham City. Jerome realized that that might happen so he sent Jeremiah his insanity gas turning Jeremiah’s skin white and making him a psychopath. Jeremiah then tries to convince his friend Bruce Wayne to help him destroy Gotham City. When Bruce doesn’t, Jeremiah uses Jerome’s cult to try to kill Bruce. When that doesn’t work, Jeremiah teams up with Ra’s al-Ghul, stabs Bruce’s girlfriend Selina Kyle, destroys every bridge out of Gotham City with bombs and shuts down all electricity in Gotham City. The police then abandon Gotham except Captain Gordon and some others and criminals take over the city. ==Season Five== Jeremiah Valeska fakes his own death with the help of his sidekick Echo and has people kidnapped, enslaved and forced to tunnel out of Gotham City so that he can flood the island. He also kidnaps Bruce Wayne and mind controls Alfred Pennyworth and two people who look like Bruce’s dead parents so that he can make Bruce relive the night his parents were murdered. Jeremiah also kidnaps and tries to kill Captain James Gordon and his psychiatrist girlfriend in front of Bruce. Later on, Jeremiah and Bruce fight and Bruce pushes Jeremiah into a tank of dangerous chemicals. Jeremiah survives but ends up in a coma and stays in it for the next 10 years during which The Riddler stabbed him for fun. So as revenge, Jeremiah tricked The Riddler into escaping Arkham Asylum for the Criminally Insane and framed The Penguin for it. Jeremiah also killed Echo after she stopped being useful to him. And Jeremiah tried to kill Commissioner James Gordon and tells him his name isn’t Jeremiah anymore but something else that starts with the letter J. Then Jeremiah is attacked by a man dressed up as a bat and the Batman sends him back to Arkham. Category:DC Comics characters",
 "title": "Jerome and Jeremiah Valeska"
}