{
 "id": "1004366",
 "text": "\"(Nice Dream)\" is a song by English alternative rock band Radiohead. It is the sixth track of their second studio album The Bends. The song was made at Manor Studio under the supervision of producer John Leckie. His intention was to recreate an atmosphere similar to that of the song My Sweet Lord by George Harrison, putting it appropriately to the phrases a \"good angel\", a \"garden\" and a sense of mysterious belonging. == History == (Nice Dream) was written in 1992. Ed O'Brien remembered Thom Yorke playing him a cassette with a demo version of the song in the car in late 1992. On 11 February 1993 Thom along with Jonny Greenwood had premiered the song acoustically at the Studio Café, Disley, UK for Signal Radio. Towards the end of the tour for Pablo Honey, the lyrics had progressed. The first version with the whole band was probably on September 3, 1993. When the recording sessions began in March 1994 at RAK Studios in London (Nice Dream) was one of four songs to be recorded first. They were possible candidates for the next single (the others being Sulk, The Bends and Killer Cars). The song was released on the album The Bends in March 1995. ==Lyrics and meaning== The song is a fantasy where the protagonist lives, where he is loved and cared for by the people around him. The narrator doesn't want to get out of this fantasy: he prefers the \"nice dream\" that lulls him into a sense of peace and security. But the beautiful dream is just a fantasy he dreamed, a fantasy he would like to live in. He actually lives in it, but is starting to recognize that it's a dream. The phrase \"nice dream\", is sung repeatedly as a lullaby. That song refers to a story by Kurt Vonnegut Cat's Cradle where a crystal had been found that turns all water completely solid and someone drops it into the sea. \"If you want to kill yourself you just put your finger into the water.\" ==References== Category:1995 songs Category:Radiohead songs Category:Alternative rock songs",
 "title": "(Nice Dream)"
}