{
 "id": "1004839",
 "text": "Jingūkyō Predecessor Ise Grand Shrine local administration Successor Association of Shinto Shrines Parent organization Institute of Divinities (1940-1946) Jingūkyō was a Shinto organization that was established during the Meiji era in Japan. While it was not included as one of the thirteen sects of prewar Shinto, it possessed characteristics of sect Shinto until the mid-Meiji period. It was organized by Urata Nagatami and others, with Tanaka Yoritsune as its first Superintendent.https://archive.today/20230318052044/https://d-museum.kokugakuin.ac.jp/eos/detail/?id=9812 In 1872, Urata Nagatami asked for permission to start a Shinto church called Jingū Kyōkai, shortly after the Ministry of Religion was created. He opened teaching centers and religious groups to organize his disciples, then combined them under the name Divine Wind Religious Association in 1873. Popular pilgrimage groups that were already established were also included. The Jingūkyo Institute started spreading its teachings throughout the country after the dissolution of the Daikyōin in 1875. In 1882, the Kyodo Shoku was abolished, which led to the Jingūkyo Institute declaring itself independent from the official Grand Shrine Administration Office and renaming itself Jingūkyō. Tanaka Yoritsune became the first superintendent after Urata resigned. Membership increased until the late 1880s, but there was little growth afterward. In 1898, Japan's Civil Law was passed, and there was a movement to make the Jingūkyō a service organization for the Grand Shrines of Ise. As a result, the Jingūkyō was reorganized into the Jingū Hōsaikai in September 1899. It was reorganized as such in part because it had a major burden of distrubiting Jingu Taima and this was criticized as that was used all across Japan. The Jingū Hōsaikai still follows the same basic ideals as Jingūkyō, focusing on the Grand Shrines of Ise, Emperor worship, studying kokugaku. Even today, the legacy of Jingūkyō can be seen in Japanese society and culture. With the help of the National Association of Shinto Priests, the Office of Japanese Classics Research it founded the Association of Shinto Shrines. == References == Category:Pages with unreviewed translations Category:13 Shinto Sects",
 "title": "Jingu-kyo"
}