{
 "id": "1004145",
 "text": "The Third Wave was an experimental social campaign made by California high school history teacher Ron Jones in 1967. This experiment was meant to explain to the students how the German population could accept the actions of the Nazis during the rise of the Third Reich and the Second World War. Jones taught his students about Nazi Germany. During his senior level World History class, he found it difficult to explain to his students how the German population could accept the actions of the Nazis. He decided to make a fake social movement as an example of the appeal of fascism. The experiment took place over the course of 5 days (or nine, according to student Sherry Toulsey). Jones started a series of exercises in his classroom mainly focusing on discipline and community. This was intended to model certain traits of the Nazi movement. The experiment started to get out of control. The movement grew outside of his class and members began to increase in the hundreds. He convinced the students to attend a rally where he claimed that the classroom project was part of a nationwide movement, and that the announcement of a Third Wave presidential candidate would be televised. When the students arrived, they were shown a blank channel. Jones told his students that the movement was an experiment about fascism. He showed his students a short film about the actions of Nazi Germany., and This project was turned into an American film, The Wave, in 1981, and a very praised German film, Die Welle, in 2008. == Background == The experiment started at Cubberley High School in Palo Alto, California, during the first week of April, 1967. Jones was a member of the SDS, sponsor of the Cubberley United Student Movement, and a supporter of the Black Panthers. Jones decided to create this experiment after finding it hard to tell his students how the German people could have ignored the Holocaust. Jones started a movement called \"The Third Wave\" and told his students that the movement wanted to end democracy. The idea that democracy focuses on individuals was seen as a drawback, and Jones focused this main point of the movement in its motto: \"Strength through discipline, strength through community, strength through action, strength through pride.\" The experiment was not well documented, being briefly mentioned in two issues of the Cubberley High School student newspaper, The Cubberley Catamount. Another issue of the paper has a longer description of the experiment when it was finished. Jones wrote a detailed recollection about nine years after. Articles from other authors followed, some featuring an interview with Jones and the students involved. == Notes == == References == Category:1967 in California Category:Fascism Category:Experiments",
 "title": "The Third Wave (experiment)"
}