{
 "id": "1004765",
 "text": "Shendao teaching () is a Chinese philosophy about religion. It originally meant following the natural way of things and setting up teaching to make people behave. Later on, it was used to educate people by talking about how good and bad things happen as a result of their actions. The idea of Shendao started in the early Western Zhou period and later became important in Confucianism as a way to teach character. Some people believe that it helped China understand and adopt the Western idea of religion. == Shang Dynasty == During the Shang dynasty in China, people believed in many gods. The most important god was called \"Shangdi,\" but some people thought of Shangdi as just a part of the natural order of things, which they called \"Tiandao.\" They believed that the emperor did not have control over this natural order. During Shang sacrifices, people didn't offer sacrifices to the emperor, but they would ask for the emperor's help. The Shang people believed in ghosts and gods, which was similar to what people believed in prehistoric times. They didn't use religion as a way to control people like some later dynasties did.. 晁福林《论殷代神权》，《中国社会科学》1990年第1期 晁福林《说商代的“天”和“帝”》,《史学集刊》2016年第3期 == Zhou dynasty == The Zhou dynasty of ancient China believed in the divinity of Shangdi, the supreme god, and diminished the importance of other ancestral and natural gods that were worshipped during the previous dynasty. The king of Zhou set up an \"imperial registry\" to worship God,《清华简·系年》：昔周武王监观商王之不恭上帝，禋祀不寅，乃作帝籍，以登祀上帝天神，名之曰千亩，以克反商邑，敷政天下。 and built a god of the land with chestnut wood to inspire fear in the people. The Zhou also created an \"imperial court\" as the emperor's office. The Zhou believed that the emperor could send down a great Lu order to protect his house and people. Book of Documents, Book of Zhou, Lü Xing, God oversees the people. The world of the gods, mainly the \"emperor\" and \"heaven,\" became the foundation for the kingship of the Zhou Dynasty. They established the concept of rule with \"Mandate of Heaven\" as the core, and the king was referred to as \"Son of Heaven.\" This practice of the Zhou was Shendao's establishment of religion, which became a tool for political rule and adapted to the needs of patriarchal kingship.雷晓鹏:从清华简《系年》看周宣王“不籍千亩”的真相，《农业考古》，2014,(4)Confucianism,, on the other hand, believed in the fear of heaven, adults, and the words of the saints, but did not believe in gods. == Belief, worship and ritual == Shendao is a religion that believes in ghosts and gods. It originated from the Tuan Chuan of the Zhou Yi.《周易·观卦·彖传》：“观天之神道，而四时不忒，圣人以神道设教，而天下服矣。”《礼记·祭义》：“明命鬼神，以为黔首则，百众以畏，万民以服。”Kong Yingda《》：\"Shen Dao, subtlety, no direction, the reason is not known, the eye is not visible, do not know so however is called Shen Dao, and the four seasons of the season is seen.\" The ancient Chinese rulers used religious beliefs to strengthen their power, which is called the divine right of \"Heaven and Man\". This involved using practices like sacrifice and divination to gain support from the people. However, some thinkers did not believe in ghosts and gods, like Fan Zhen. He still believed in the importance of Shendao as a way to govern the country, bring peace to the people, and change traditions. == Related pages == * Sacrifice to Heaven * Feng Shan * Noble lie * American civil religion * State Shinto == Notes == == Sources == Category:Religious Confucianism",
 "title": "Shendao shejiao"
}