{
 "id": "1004589",
 "text": "The Guardians of the Temple are five fictional characters and villains from the film The Game of Death. The Leopard Temple contains the five-story wooden pagoda, is located at Beopjusa (Buddhist temple). Palsangjeon is a five story wooden pagoda, guarded by trained fighters - martial artist. The temple has five floors. The martial artists guard each level of the temple. Antagonists versus Hai Tien and the Gang. == The guardians == * Ten guards all black belts in Karate, after dispatching the Karate men, Hai Tien and the gang heads for the pagoda. * The ground floor was to be guarded by a group of kung-fu fighters. === Guardian of the first floor Hall === Guardian of the first floor Hall is a fictional character and the titular protagonist of the The Game of Death film. The character is a guardian temple on the first floor.The character was created by Bruce Lee and portrayed by Hwang In-shik, only a 1972 short footage outdoors. The first floor will be protected expert kicker his kicks are devastatingly powerful and incredibly fast. * === Guardian of the Praying Mantis Hall === Guardian of the Praying Mantis Hall is a fictional character and the titular protagonist of the The Game of Death film. The character is a guardian temple on the second floor.The character was created by Bruce Lee and portrayed by Taky Kimura, has never been filmed. This guardian is a Wing Chun and Praying Mantis master. * === Guardian of the Tiger Hall === * Guards the third level of the pagoda the Hall of the Tiger, he has also been known to be an exponent of the nunchaku. === Guardian of the Dragon Hall === * Guards the fourth level there is a Hapkido master. === Mantis === * The fifth livel there is Mantis. * After defeating the fifth guardian, Hai Tien turns around and descends the staircase, there is no mention of others fighters and anyone going up. == Other websites == * Guardian of the first floor Hall on IMDb * Guardian of the Praying Mantis Hall on IMDb Category:The Game of Death characters Category:The Game of Death",
 "title": "The Guardians of the Temple"
}