{
 "id": "1004660",
 "text": "The 1986-87 Austrian Cup was the national cup competition in Austrian football. FK Austria Wien were the defending champions. Austria Soccer == Second round == First round with teams from the first and second league. The match started half an hour late after a downpour. The game had to be interrupted for 20 minutes in the 63rd minute due to a thunderstorm. The game was stopped for 20 minutes after a power failure (3 of the 8 floodlights were affected). The game was canceled on 19 August due to rain and postponed to 20 August. ==Round of 32== ==Round of 16== On April 23, 1987, Austria Vienna received a 3-0 penalty after Krems used the player Milosavljevic (4 yellow cards) without authorization. ==Quarter finals== ==Semi-finals == ==Final first leg== *SK Rapid Wien: Michael Konsel – Leo Lainer, Kurt Garger, Heribert Weber, Robert Pecl, Reinhard Kienast (62. Rudolf Weinhofer), Petar Brucic, Peter Hrstic (60. Karl Brauneder), Gerald Willfurth, Zlatko Kranjčar, Sulejman Halilović coach: Otto Barić * FC Tirol: Tomislav Ivković – Gerald Messlender, Michael Streiter, Rudolf Steinbauer, Heinz Peischl, Manfred Linzmaier, Arnold Koreimann, Robert Idl (80. Alfred Hörtnagl), Alfred Roscher, Peter Pacult coach:Felix Latzke ==Final second leg== * FC Tirol: Tomislav Ivković – Gerald Messlender, Ivica Kalinić, Robert Auer (55. Alfred Hörtnagl), Michael Streiter, Heinz Peischl, Manfred Linzmaier, Arnold Koreimann, Rudolf Steinbauer, Alfred Roscher, Peter Pacult coach:Felix Latzke *SK Rapid Wien: Michael Konsel – Leo Lainer, Kurt Garger, Heribert Weber, Karl Brauneder, Robert Pecl, Reinhard Kienast, Petar Brucic (88. Peter Hrstic), Gerald Willfurth, Zlatko Kranjčar (81. Rudolf Weinhofer), Sulejman Halilović coach: Otto Barić ==Top goalscorers== Rank Player Club Goals 1 Peter Pacult FC Tirol 9 2 Sulejman Halilovic SK Rapid Wien 5 3 Peter Hristic SK Rapid Wien 4 3 Anton Polster FK Austria Wien 4 3 Walter Knaller Admira Wacker 4 Scorerlist(German) ==References== Category:Austrian Cup Category:1987 in association football Category:1980s in Austria",
 "title": "1986–87 Austrian Cup"
}