{
 "id": "1004738",
 "text": "Brigada Mass Media Corporation (BMMC) is a newspaper company and media network in the Philippines. It is the first-ever local Tri-media organization to have emerged from the Soccsksargen area as a national network with its array of Brigada News FM stations. BMMC is part of Brigada Group of Companies of Entrepreneur Elmer Catulpos which also maintains eight newspaper editions in the Philippines, four TV Stations, distribution of food supplements, medicines, cosmetics and engine care, a drug pharmacy a garden resort and two public security agencies. ==History== In October 14, 2012, it expanded its operations once more to television with Brigada News TeleRadyo 46 (now Channel 39) Eye of Mindanao, acquired from Asian Multimedia and Production, which is the first-ever local television station and neighboring areas of General Santos its launch on January 6, 2013, which devotes 70-80％ of its programs to local issues and concerns. Given its still very short stint in the television industry, it has already eaten up a big slice of the pie of viewership especially its news and public affairs programs in the prime time slots morning and afternoon. Since December 2015, Brigada News TeleRadyo moved to Channel 34, until september 2019, when it moved to its present Channel 39 with 10,000 Watts of power. Since Febtuary 2013, Brigada News FM expanded to 25 cities and municipalities in the Philippines through its subsequent acquisition and 100％ takeover of Baycomms Broadcasting Corporation, its owned and operated stations and other small radio networks. In April 2014, Brigada News FM National Offices in Makati was inagurated and relocated Brigada News FM Batangas to became Brigada News FM National, which later moved to Mareco- owned 105.1 in July 1, 2023, and completing the three broadcast centers of the network, Manila, Cebu and General Santos. As of 2022, BMMC has now 60 owned and operated stations in the country, larger than its main all-news and talk radio competitor Radyo5 News FM, but is ahead of another news and talk radio competitor of Bandera News Philippines and another one ahead of news and talk radio competitor of XFM Philippines. ==Brigada News Philippines (Newspaper)== * Brigada News General Santos * Brigada News Davao * Brigada News Cagayan de Oro * Brigada News Zamboanga * Brigada News Cebu * Brigada News Baguio * Brigada News Nationwide ==Brigada News FM== ===Overview=== Brigada News FM Stations are collectively known as Brigada News FM with its current taglines The Music and News Authority and In the Heart of Changing Lives. Currently, Brigada News FM has 60 owned and operated FM stations across the country, the most number of stations for a news-formatted radio network compared to their other networks in AM radio and more are planned to be opened. ===Stations=== Branding Callsign Frequency Location Brigada News FM General Santos DXYM 89.5 MHz General Santos Brigada News FM Mega Manila DWBM 105.1 MHz Mega Manila Brigada News FM Mega Manila DZBM 105.1 MHz Baguio Brigada News FM Mega Manila DWCL 92.7 MHz San Fernando, Pampanga Brigada News FM Dagupan DWYA 101.5 MHz Dagupan Brigada News FM Tuguegarao DWVX 92.5 MHz Tuguegarao Brigada News FM Cauayan DWVA 92.9 MHz Cauayan Brigada News FM Olongapo DWTY 93.5 MHz Olongapo DZBB 107.3 MHz Palauig DWBD 99.9 MHz Iba Brigada News FM Batangas DWEY 104.7 MHz Batangas Brigada News FM Lucena DWKL 92.7 MHz Lucena Brigada News FM Mindoro DWBY 93.3 MHz Roxas, Oriental Mindoro Brigada News FM Daet DWYD 102.9 MHz Daet Brigada News FM Naga DWKM 103.1 MHz Naga City DWZA 87.7 MHz Goa Brigada News FM Legazpi DWED 91.5 MHz Legazpi Brigada News FM Legazpi DWQY 98.9 MHz Tabaco Brigada News FM Sorsogon DWLH 101.5 MHz Sorsogon City Brigada News FM Palawan DWYO 103.1 MHz Puerto Princesa DZBI 96.5 MHz Narra DWBP 95.7 MHz Brooke's Point DWYB 98.3 MHz Quezon DWTQ 101.3 MHz Coron DWBJ 100.5 MHz Roxas, Palawan Brigada News FM Cebu DYAC 90.7 MHz Cebu City Brigada News FM Toledo DYBD 88.5 MHz Toledo Brigada News FM Bogo DYMM 90.9 MHz Bogo Brigada News FM Kalibo DYYQ 89.3 MHz Kalibo Brigada News FM Antique DYYC 104.5 MHz San Jose Brigada News FM Capiz DYYB 95.7 MHz Roxas, Capiz Brigada News FM Iloilo DYIG 104.7 MHz Iloilo City Brigada News FM Bacolod DYMG 103.1 MHz Bacolod Brigada News FM Kabankalan DYZD 99.7 MHz Kabankalan Brigada News FM San Carlos DYBA 89.3 MHz San Carlos Brigada News FM Dumaguete DYBW 89.5 MHz Dumaguete Brigada News FM Tacloban DYTY 93.5 MHz Tacloban DYCZ 93.5 MHz Ormoc Brigada News FM Calbayog DYIX 100.5 MHz Calbayog Brigada News FM Cagayan de Oro DXMM 102.5 MHz Cagayan de Oro Brigada News FM Davao DXAC 93.1 MHz Davao City DXGB 90.3 MHz Digos Brigada News FM Koronadal DXCE 95.7 MHz Koronadal DXBR 104.5 MHz Tacurong Brigada News FM Mati DXBW 103.1 MHz Mati Brigada News FM Tagum DXBY 97.5 MHz Tagum Brigada News FM Cotabato DXZA 89.3 MHz Cotabato Brigada News FM Valencia DXBX 105.7 MHz Valencia Brigada News FM Iligan DXZD 95.1 MHz Iligan Brigada News FM Oroquieta DXBK 95.3 MHz Oroquieta Brigada News FM Butuan DXVA 96.7 MHz Butuan Brigada News FM Kidapawan DXZC 97.5 MHz Kidapawan DXEN 106.1 MHz Midsayap Brigada News FM Trento DXYD 105.5 MHz Trento Brigada News FM Surigao DXEH 105.5 MHz Surigao Brigada News FM Lebak DXBI 91.3 MHz Lebak Brigada News FM Dipolog DXID 107.7 MHz Dipolog Brigada News FM Pagadian DXVV 105.7 MHz Pagadian Brigada News FM Zamboanga DXZB 89.9 MHz Zamboanga City Majority of BMMC's stations are acquired from Baycomms (prior to the merger in 2013), hence becoming Brigada's official broadcast licensee, except the following stations that are either acquired or operated under airtime lease agreement: *DWBM Mega Manila, DZBM Baguio, DYAC Cebu and DXAC Davao: Owned by Mareco Broadcasting Network. *DWKM Naga and DWED Legazpi: Owned by Century Broadcasting Network. *DWLH Sorsogon: Acquired from Hypersonic Broadcasting Center. *DYMG Bacolod and DYBW Dumaguete: Acquired by Armed Forces of the Philippines. *DWCL Pampanga: Owned by UBC Media Ministries, Inc. *Brigada News FM Zamboanga first utilized 93.1 FM under airtime lease from Audiovisual Communicators, Inc. in 2013 before moving to Baycomms-owned 89.9 FM in 2015. *DXVA Butuan: Owned by Nation Broadcasting Corporation. ==Brigada TV== ===Analog=== Branding Callsign Ch. # Power (kW) Station Type Location Brigada TV General Santos DXYM-TV TV-37 10 kW Originating General Santos Brigada TV Mega Manila DWDE-TV¹ TV-35 40 kW Originating Mega Manila Brigada TV Pampanga DWCL-TV TV-12 10 kW Originating San Fernando, Pampanga Brigada TV Cebu DYWF-TV TV-36 20 kW Originating Cebu City ¹ - frequency used by DBS in Metro Manila ===Digital=== Branding Callsign Ch. # Frequency Power (kW) Station Type Area of Coverage Brigada TV General Santos DXYM-DTV 37 611.143 MHz 1 kW Originating General Santos Brigada TV Mega Manila DWDE-DTV 42 641.143 MHz 1 kW Originating Mega Manila Brigada TV Cebu DYWF-DTV 32 581.143 MHz 1 kW Originating Cebu ===Cable TV=== Cable/Satellite Provider Channel Location Sky Cable 35 General Santos Sto. Niño Cable TV System 52 General Santos Marbel Service and TV System 21 Koronadal JVL Star Cable 15 South Cotabato Midsayap Sultan Kudarat Midsayap Cable and Telecommunication Services, Inc. 10 Midsayap Sky Cable Polomolok 15 Polomolok Sky Cable Maguindanao 44 Cotabato Sky Cable 161 Mega Manila Bulacan Batangas Cavite Laguna Antipolo Cablelink 78 Mega Manila Bacoor Imus Concepcion Cainta San Pedro Cignal 114 Nationwide Category:Companies of the Philippines",
 "title": "Brigada Mass Media Corporation"
}