{
 "id": "1004515",
 "text": "Manson crater Manson impact location shown in red on bedrock map of Iowa Impact crater/structure Confidence Confirmed Diameter 35 km (22 mi) Age 73.8 ± 0.3 Ma Late Cretaceous Exposed No Drilled Yes Bolide type Chondrite Location Coordinates 42°35′N 94°33′W﻿ / ﻿42.583°N 94.550°W﻿ / 42.583; -94.550Coordinates: 42°35′N 94°33′W﻿ / ﻿42.583°N 94.550°W﻿ / 42.583; -94.550 Country United States State Iowa Municipality Manson Location of the crater in Iowa, United States Show map of the United States Manson crater (Iowa) Show map of Iowa The Manson crater is an impact crater near the site of Manson, Iowa. An asteroid or comet nucleus struck the Earth during the Cretaceous Period, approximately 74 million years ago. The event was one of the largest known impact events in North America. Until they found the ages of certain isotopes at the site, people believed that the event caused extinction of the dinosaurs. The ages sugges that the crater is too old. == Description == As the site was covered by a glacial hill fairly recently, no eveidence of the crater can be seen on the surface. Today, the site of the crater is a flat landscape. Below the surface, hidden about below the surface is a buried structure about in diameter. It lies under the southeast corner of Pocahontas County and extends under portions of three counties. That an anomalous structure underlaid the area was known from unusual water well drill cuttings in 1912 of deformed rock, \"crystalline clast breccia with a melt matrix\" as a later report described it. A research investigation was started in 1955, and it was labeled a \"cryptovolcanic structure\" (a hypothetical volcanic steam explosion). Robert S. Dietz did some more investtifatiom and proposed an impact origin in 1959. Nicholas Short found evidence of shocked quartz grains in 1966. This confirmed the impact origin of the structure. In 1991 and 1992 the U.S. Geological Survey along with others including the Iowa Geological Survey conducted detailed research in part to test the possible connection of the Manson Crater with the Cretaceous–Paleogene extinction event. The / isotope ratio dating of the core from the impact structure gave an age of about 74 Ma, or about 10 Ma older than the K–T boundary. The impactor is considered to have been a stony meteorite about in diameter. The site at the time was the shore of a shallow inland sea. the Western Interior Seaway. The impact disrupted granite, gneiss, and shales of the Precambrian basement as well as sedimentary formations of Paleozoic age, Devonian through Cretaceous. Limestone layers that give the rest of Iowa hard water were instantaneously vaporized down to the basement rocks, giving Manson the anomalous soft water that it has today. == References == === Bibliography === * Christian Koeberl and Raymond R. Anderson, eds; 1996, The Manson Impact Structure, Iowa: Anatomy of an Impact Crater, Geological Society of America Special Paper 302, == Further reading == * Raymond R. Anderson, 1999, Iowa's Manson Impact Structure, Iowa DNR * Additional material from Iowa DNR with image links * Detailed illustrated time sequence of the Manson impact event from NASA == Other websites == * Aerial Exploration of the Manson Impact Structure Category:Geography of Iowa",
 "title": "Manson crater"
}