{
 "id": "1004656",
 "text": "Prince Vincent of Denmark, Count of Monpezat (Vincent Frederik Minik Alexander; born 8 January 2011) is a member of the Danish royal family. He is the third child and younger son of King Frederik X and Queen Mary of Denmark, the sixth grandchild and youngest grandson of Queen Margrethe II and Prince Henrik, and the older twin brother of Princess Josephine. Vincent is third in line to the Danish throne, after his father, older brother Prince Christian, and older sister Princess Isabella. ==Birth and early life== Prince Vincent was born at Rigshospitalet, the Copenhagen University Hospital, in Copenhagen, at 10:30 am local time, 26 minutes before his twin sister. Kronprinsesse Mary har født Vincent and Josephine were christened on 14 April 2011, at the chapel of the Church of Holmen. His name was announced as Vincent Frederik Minik Alexander. His godparents are his maternal uncle, John Stuart Donaldson; his father's first cousin, the Prince of Sayn-Wittgenstein-Berleburg (then the Hereditary Prince); his mother's lady-in-waiting, Caroline Heering; and friends of his parents, the King of Spain (then the Prince of Asturias), Count Michael Ahlefeldt-Laurvig-Bille and Baroness Helle Reedtz-Thott. ==Titles, styles and honours== 8 January 2011: His Royal Highness Prince Vincent of Denmark, Count of Monpezat. === National Honor === * Knight of the Order of the Elephant (R.E.) (14 January 2024) === Medals and Decorations === * Queen Margrethe II's Ruby Jubilee Medal (14 January 2012) * Queen Margrethe II's 75th Birthday Medal (16 April 2015) * Queen Margrethe II and Prince Henrik's Golden Wedding Anniversary Medal (10 June 2017) * Prince Henrik's Memorial Medal (11 June 2018) * Queen Margrethe II's 80th Birthday Medal (16 April 2020) * Queen Margrethe II's Golden Jubilee Medal (14 January 2022) ==References== ==Other websites== * Official website Category:Danish princes and princesses Category:House of Monpezat Category:2011 births Category:Living people Category:Royal children Category:People from Copenhagen",
 "title": "Prince Vincent of Denmark"
}