{
 "id": "1004016",
 "text": "On March 30, 2023, Donald Trump, president of the United States from 2017 to 2021, was indicted by a Manhattan grand jury. It is alleged that he paid hush money to pornographic movie actress Stormy Daniels during the 2016 United States presidential election. (Hush money is a bribe to maintain secrecy - to prevent bad publicity or to prevent the discovery of a crime.) The \"Hush\" money was actually apart of an agreement that was meant to be secret, and the money was to make sure that it was agreed upon, not bribing. Trump became the first former U.S. president to be indicted and to face criminal and felony charges. He was the first president to be arrested since Ulysses S. Grant was arrested in 1872. ==Background== In 2021, Alvin Bragg was elected Manhattan District Attorney. In February 2022, the two prosecutors that were leading the investigation of Trump, quit their jobs. Those two - Mark F. Pomerantz and Carey Dunne - said that Bragg was not pursuing charges against Trump aggressively enough. ==Arrest and arraignment== On April 4, 2023, Trump's motorcade drove him to the Manhattan Criminal Courthouse. As he went into the courthouse, he was arrested. Trump was formally placed under arrest without being handcuffed or having a mugshot taken. Trump came into the courtroom an hour later, and got 34 felony charges of falsifying business records. However, media says that each charge can range from a misdemeanor to a felony. Trump pleaded not guilty to all the charges. After the court hearing, Trump traveled by plane back home to Florida.https://www.bbc.com/news/world-us- canada-65182264. BBC. Retrieved 2023-04-05 In the evening, he met with and spoke to a crowd of supporters. The indictment has been unsealed and published by New York Supreme Court, but it does not show or reveal the district attorney's specific legal theory behind the case. ==Trial== Jury selection began on April 15, 2024. On May 30, 2024, Donald Trump was convicted by the jury of 34 counts related to falsifying business records. On January 10, 2024, the verdict is supposed to be (given or) handed down; The judge has said that Trump must be in court, in person or [by video-link or] digitally.https://www.nettavisen.no/nyheter/krever-at-donald-trump-moter-i- retten-ti-dager-for-han-blir-president/s/5-95-2215872. Retrieved 2025-01-04 ==Related pages== *Stormy Daniels–Donald Trump scandal == References == Category:March 2023 events Category:April 2023 events Category:Donald Trump Category:Criminal investigation Category:2023 in the United States Category:Living people",
 "title": "Prosecution of Donald Trump in New York"
}