{
 "id": "1004251",
 "text": "Shantae is a indie video game series developed and published by WayForward Technologies. The series was created by Matt Bozon and Erin Bozon whose create the series main protagonist Shantae, a half-genie and the guardian of her town. The series had five games and many other appearances including Super Smash Bros. Ultimate. In 2020, the series had sold three million copies. == History == The character Shantae was created by Erin Bell the wife of Matt Bozon, the series's creator. Erin got a flash of inspiration while coming back from her camping days and created the character, naming her \"Shantae\" after one of the campers and developing her dance moves. == Gameplay == Shantae is an action-adventure game series whose the player control as Shantae. The series gameplay was similar to The Legend of Zelda and Metroid and the player can progress by collecting new powers, solving puzzles and getting information in town. The main character, Shantae main attack was whipping her long hair and transform herself by belly dancing. In the third installment, Shantae has lost her power as a genie. == Characters == * Shantae is a half-genie and the daughter of a human father and genie mother. She was a guardian genie and having magical powers including her whipping hair and magical dances that change her into magical animals. *Mimic is a member of the Relic Hunters who has made many discoveries. He is also Shantae's adoptive uncle, as he raised her after her parents' disappearance. *Risky Boots is a pirate and the series' primary antagonist known for her love of wealth and powers. She normally seeks to take over Sequin Land or take revenge on Shantae. She also commands an army of Tinkerbats, a silent shadow humanoid creatures. *Sky is Shantae's life-long friend and the daughter of a Relic Hunter herself. Never seen without her pet war bird Wrench. *Bolo is Shantae's friend and sparring partner. He is described as being rather slow and very easily attracted to girls, though he tires to prove himself as capable of being a hero. *Rottytops is undead zombie girl who often friendly but never had a friend. She was described as normally looking for trouble for fun. == References == Category:Metroidvania games Category:Indie video games Category:Video game series Category:Video games about genies Category:Video games about shapeshifting",
 "title": "Shantae"
}