{
 "id": "1005355",
 "text": "A is a type of Shinto shrine that honors the three Kumano mountains: Hongū, Shingū, and Nachi. Encyclopedia of Shinto, Kumano Shinkō, accessed on October 6, 2008There are over 3,000 Kumano shrines in Japan, and each one receives its kami from another Kumano shrine through a process called or . The Kumano cult originally came from the Kumano Sanzan shrine complex in Wakayama Prefecture. == Kumano Sanzan == The Kumano Sanzan shrines are considered the main shrines among all Kumano shrines and are located between 20 to 40 kilometers from each other. They are linked by the pilgrimage route called . In addition to the three shrines, there are two Buddhist temples, Seiganto-ji and Fudarakusan-ji, that are also part of the Kumano Sanzan complex. The Kumano region has been significant religiously since ancient times, even before modern religions in Japan. It is known as a place for physical healing. Initially, each Kumano shrine had its own form of nature worship, but in the 10th century, they began to be worshipped together as the three deities of Kumano under the influence of Buddhism.. During the time when Japanese kami were believed to be emanations of buddhas, known as the honji suijaku theory, the three deities of Kumano became associated with Buddhas. Kuniyasutamahime, one of the deities, was associated with Sahasrabhūja Avalokiteśvara (also known as Senju Kannon, meaning \"Thousand-Armed Avalokiteśvara\"), Bhaisajyaguru (Yakushi Nyōrai), and Amitābha (Amida Nyōrai). The site of Kumano became a unique example of the fusion between Buddhism and Japanese indigenous religion known as shinbutsu- shūgō.. After the three shrines were associated with Buddhism, the Kumano Sanzan site gained popularity and attracted many worshipers, making it a popular pilgrimage destination.. During the 11th century, pilgrims who visited the Kumano Sanzan site were mainly members of the imperial family or aristocrats. However, by the 15th century, the majority of the pilgrims were commoners.. In the past, the pilgrimage to Kumano was also known as the . This was because the pilgrims could be seen walking in long lines, winding through the valleys, and resembling a trail of ants. == Related pages == * Kumano Shrine (Yamagata) * The Tale of the Heike * Acts of Worship == References == == Sources == * D. Max Moerman, Localizing Paradise: Kumano Pilgrimage and the Religious Landscape of Premodern Japan. Harvard University Press, 2004. ISBN 0674013956 * Moerman, David (1997). The ideology of landscape and the theater of state: Insei pilgrimage to Kumano (1090–1220), Japanese Journal of Religious Studies 24 (3-4), 347-374 == Other websites == * Tanabe City Kumano Tourism Bureau Category:Beppyo shrines",
 "title": "Kumano shrine"
}