{
 "id": "1005171",
 "text": "Chokaisan Omonoimi Shrine (鳥海山大物忌神社) is a Shinto shrine located on Mount Chōkai. In the middle ages it became a sacred spot for shugendo, a religion of mountain worship. People worship a lake called Maruikesama at the shrine. It is a Kannabi and worshippers believe a god lives in it. It is the Dewa Province Ichinomiya, or the first ranked shrine in the Dewa Province. It is related to the Three Mountains of Dewa https://d-museum.kokugakuin.ac.jp/eos/detail/id=8579 It has a festival every year on July 14 called Hi-awase shinji. where people light fires for good harvest and good fishing.https://archive.today/20230425181001/https://d-museum.kokugakuin.ac.jp/eos/detail/?id=9228 It has three subshrines. Fukura-kuchinomiya and Warabioka-kuchinomiya at the foot of the mountain and Sancho-Gohonsha at the peak It had a legal battle after World War II because people were confused about who owned the summit == Fukura-kuchinomiya == Fukura-kuchinomiya is a subshrine located at the foot of the mountain The Honden is located on a hill and faces southhttps://archive.today/20230411014431/https://okunomichi.wordpress.com/2014/08/28/1301/ Tsukuyomi-no-Mikoto is enshrined here == Sanchō-Gohonsha == This Shrine is on the peak of Mount Chokai. It was built in 564 in the reign of Emperor Kinmei. It looks like an ordinary cabin on the outsidehttps://archive.today/20230425185131/https://akitajet.com/wiki/Mount_Ch%C5%8Dkai The shrine is rebuilt once every 20 years, it was rebuilt in 1997. == Warabioka-kuchinomiya == Warabioka-kuchinomiya is a subshrine located at the foot of the mountain. The shrine worships agricultural deities Toyoke- Ookami and Ukanomitama no Mikoto. The shrine has four Hokora or small shrines on its grounds. There is a festival on May 3rd called Daimonbei Matsuri. There are three torii gates and the movie Rurouni Kenshin: The Legend Ends was filmed there == Related pages == * Three Mountains of Dewa ** Gassan Shrine ** Dewa Shrine ** Yudonosan Shrine *Chōkai gassan ryōsho-gu == References == Category:Beppyo shrines Category:Kokuhei Chūsha Category:Ichinomiya Category:Myōjin Taisha Category:Mountain faith Category:Tōhoku region",
 "title": "Chōkaisan Ōmonoimi Shrine"
}