{
 "id": "1005198",
 "text": "Whale mounds, also known as Kujira Tsuga in Japanese, are mounds that are dedicated to whales that have been washed up on the shore. This is a unique custom to Japan. == Overview == Mounds are created to remember Cetacean stranding, a type of whale that was hunted for food and resources, and to show appreciation for the area being saved and enriched. Whales were considered gods and some were called Ebisu, so they were enshrined to prevent them from becoming angry gods after they died on the shore or were hunted. The mound is also built to prevent the god from becoming angry. These mounds can be found at Toda Shrine in Shinagawa, Tokyo and Whale Shrine in Miyake-jima, Tokyo. After organized whaling was established during the Edo period, mounds were also built in areas where whaling was a livelihood to serve as memorials and expressions of gratitude. Examples include the Ryujima area near Ukishima Shrine in Chiba Prefecture and Taiji. People believed that whales had spiritual power as their arrival in an area often coincided with the arrival of fish. Therefore, they were used as fishing guides and regarded as auspicious. This led to the enshrinement of whales, often in the form of Ebisu, as a fishing deity to bring good fortune to fishermen and as a sea god to pray for safety at sea. Similarly, there are whale graves and monuments in areas where whaling has been a source of livelihood since ancient times, as well as for passive and accidental whaling. When combined with whale mounds, there are about 100 of them in Japan. == Whalebone Torii == A whalebone torii is a type of torii where the gate of the shrine is constructed using whale bones, primarily the ribs of the whale. The oldest one in Japan is the torii of the Ebisu Shrine in Taiji Town, Wakayama Prefecture. This is mentioned in Ihara Saikaku's \"Nihon Eitaigura\" published in 1688 (Jōkyō5): \"In the village of Taiji, Ominato, Kiiro, the wife and children sing. This place is prosperous and Wakamatsu village is standing. According to records, the current torii is the third generation, and it is unknown what it was made of before that. According to records, the current torii is the third generation, and it is not known what it was made of before that. These are all the whale torii gates that exist in Japan today, but there is also a Cape Eluanbi Shrine in Eluanbi, the southernmost point of Taiwan under Japanese rule at the time. There were also whale torii gates at three other shrines: Fudato Ebisu Shrine in Sakhalin, and Shikotan Shrine on Shikotan Island in the Northern Territories. Each of these five locations is either directly or indirectly related to whaling (such as whaling bases). == Related pages == * Whale ** Ebisu (mythology) * Whaling == Footnotes == == References == Category:Pages with unreviewed translations Category:Whales Category:Japanese customs Category:Shinto shrines",
 "title": "Whale mounds"
}