{
 "id": "100547",
 "text": "World War I reparations means the payments and transfers of property and equipment that Germany was forced to make after its defeat during World War I. Article 231 of the Treaty of Versailles (the 'war guilt' clause) declared Germany and its allies responsible for all 'loss and damage' of the Allies during the war and set up the basis for reparations. In January 1921, the total sum due was decided by an Inter-Allied Reparations Commission and was set at 132 billion gold marks, about £6.096 billion or $33 billion Billion US dollars in 1919 (roughly $12,370.53 Billion US dollars as of 2024The Inflation Calculator). This was a sum that many economists believed to be too much. Later that year, the amount was reduced to 132 billion marks, which still seemed too much for most German observers, both because of the amount itself as well as the terms. Germany stopped paying the reparations after Hitler's Nazi Party took power in 1933, with about one-eighth of the reparations having been paid by then. The final payments were made on the day exactly 20 years after German reunification. ==Evolution of Reparations== Event German gold marks (billions) Gold standard U.S. dollars (billions) 2011 US$ (billions) Inter-Allied Reparations Commission 1921 269 64.0 785 Young Plan 1929 112 26.6 341 Lausanne Conference 1932 20 4.8 81 There was large debate about the justice and likely impact of the reparations decided. John Maynard Keynes resigned form the British Treasury in 1919 to protest this high sum of money demanded.Markwell, Donald (2006). John Maynard Keynes and International Relations: Economic Paths to War and Peace (2006 ed.). Oxford University Press. . p. 777 The 1924 Dawes Plan changed Germany's reparation payments. In May 1929, the Young Plan reduced further payments to 112 billion gold marks ($28.35 billion over a period of 59 years, which was 1988). In addition, the Young Plan divided the yearly payment, set at two billion gold marks (US$473 million), into two parts: one part equal to one third of the sum and could not be postponed and a postponable part for the remaining two-thirds. Because of the Great Depression there was an attempt to delay further payments. It failed, but in the Lausanne Conference of 1932, it was decided to cancel reparations. By this time Germany had paid one eighth of the sum required under the Treaty of Versailles. But Germany refused to continue paying upon Hitler's rise to power. ==Opinions in Germany == Only a few German people accepted that they lost the war. The German High Command blamed many civilian parts in the society, especially socialists, communists and Jews. The idea was known as Dolchstoßlegende (stab-in-the-back myth).Lentin, Antony (1998). \"A Comment, From Armistice to Dolchstosslegende\". In Boemeke, Manfred F.; Gerald D. Feldman, Elizabeth Glaser. The Treaty of Versailles: A Reassessment after 75 Years (1998 ed.). Cambridge University Press. . p. 236 The Germans were unhappy with the sum of reparations, which seems terrible, partly because German leaders could not represent in the decision.Domarus, Max; Hitler, Adolf (2007). Patrick Romane. ed. The Essential Hitler: Speeches and Commentary (2007 ed.). Bolchazy-Carducci Publishers. . p. 25, 96, 240, 443, 670 == Impact on German economy == Economic problems from the payments were said to be an important factor that led to the end of the Weimar Republic and the beginning of dictatorship of Adolf Hitler. John Maynard Keynes, a British economist, said this would weaken German economy as well as German politics. However, many historians disagreed. Margaret MacMillan, a Canadian historian, showed her idea that Germany could have paid all the payments if they wanted to. She said that the problem was Germany would not like to pay.Taylor, Alan John Percivale (1991). The origins of the second world war (1991 ed.). Penguin Books. . p. 70 Sally Marks, an American historian, also thought that Germany could pay the reparations. She said the Germans paid the reparations in full and on time as long as the French occupied Düsseldorf in 1921, but stopped after the French were no longer stationed there in 1922.Marks, Sally (September 1978). \"The Myths of Reparations\". Central European History (Cambridge University Press on behalf of Conference Group for Central European History of the American Historical Association) 11 (3): 231–255. doi:10.1017/S0008938900018707. ISSN 1569-1616. Retrieved October 5, 2010 p. 237-238 Later that year, the problem became more serious as French and Belgian representatives urged an occupation of the Ruhr Area to force Germany to pay, while the British wanted to lower the reparations.Marks, Sally (September 1978). \"The Myths of Reparations\". Central European History (Cambridge University Press on behalf of Conference Group for Central European History of the American Historical Association) 11 (3): 231–255. doi:10.1017/S0008938900018707. ISSN 1569-1616. Retrieved October 5, 2010 p. 239-240 Occupation of the Ruhr began in January 1923.Marks, Sally (September 1978). \"The Myths of Reparations\". Central European History (Cambridge University Press on behalf of Conference Group for Central European History of the American Historical Association) 11 (3): 231–255. doi:10.1017/S0008938900018707. ISSN 1569-1616. Retrieved October 5, 2010 p. 240-241 The Allies felt that the German government's refusal to pay was done to test whether the Allies willed to enforce reparations.Marks, Sally (September 1978). \"The Myths of Reparations\". Central European History (Cambridge University Press on behalf of Conference Group for Central European History of the American Historical Association) 11 (3): 231–255. doi:10.1017/S0008938900018707. ISSN 1569-1616. Retrieved October 5, 2010 p. 240 As a \"quiet fight\" in the Ruhr, the German government began the hyperinflation that destroyed the German economy in 1923.Marks, Sally (September 1978). \"The Myths of Reparations\". Central European History (Cambridge University Press on behalf of Conference Group for Central European History of the American Historical Association) 11 (3): 231–255. doi:10.1017/S0008938900018707. ISSN 1569-1616. Retrieved October 5, 2010 p. 245 In 2008, a British historain Richard J. Evans said that the German government was responsible for the hyperinflation as they preferred this to paying reparations. The Germans won the world's pity, and after that, the French were forced to agree to the Dawes Plan of April 1924, which lowered the reparations.Marks, Sally (September 1978). \"The Myths of Reparations\". Central European History (Cambridge University Press on behalf of Conference Group for Central European History of the American Historical Association) 11 (3): 231–255. doi:10.1017/S0008938900018707. ISSN 1569-1616. Retrieved October 5, 2010 p. 245-246 Under this new plan, Germany paid 1 billion marks in 1924 and reached the total of 2.25 billion by 1927. After that year, Germany was able to pay 2.5 billion marks per year. However, the Germans still stop paying the reparations.Marks, Sally (September 1978). \"The Myths of Reparations\". Central European History (Cambridge University Press on behalf of Conference Group for Central European History of the American Historical Association) 11 (3): 231–255. doi:10.1017/S0008938900018707. ISSN 1569-1616. Retrieved October 5, 2010 p. 249 To deal with this, the Allies met in a conference in London in July-August 1924,Marks, Sally (September 1978). \"The Myths of Reparations\". Central European History (Cambridge University Press on behalf of Conference Group for Central European History of the American Historical Association) 11 (3): 231–255. doi:10.1017/S0008938900018707. ISSN 1569-1616. Retrieved October 5, 2010 p. 248 and was the first time that Germany challenged the Versailles Treaty. The Germans complained that payments under the Dawes Plan were still too high, so the Young Plan of 1928 was set up and the Germans were not required to pay higher than 2.5 billion until 1988.Marks, Sally (September 1978). \"The Myths of Reparations\". Central European History (Cambridge University Press on behalf of Conference Group for Central European History of the American Historical Association) 11 (3): 231–255. doi:10.1017/S0008938900018707. ISSN 1569-1616. Retrieved October 5, 2010 p. 250 Gustav Stresemann demanded that Rhineland must returned to Germany in order that Germany accept the plan. Under strong pressure, the French left Rhineland in June 1930.Marks, Sally (September 1978). \"The Myths of Reparations\". Central European History (Cambridge University Press on behalf of Conference Group for Central European History of the American Historical Association) 11 (3): 231–255. doi:10.1017/S0008938900018707. ISSN 1569-1616. Retrieved October 5, 2010 p. 251-252 The British historain A. J. P. Taylor wrote that the reparations was harsh enough to be seen as a punishment, but not enough to stop Germany from regaining its great power status, and can be blamed for the rise of Adolf Hitler.Taylor, Alan John Percivale (1991). The origins of the second world war (1991 ed.). Penguin Books. . p. 47-55 ==Notes== ==Other websites== *Modern Reparation Discussions Category:World War I",
 "title": "World War I reparations"
}