{
 "id": "1005174",
 "text": "The Ōarai Isosaki Shrine (大洗磯前神社, Ōarai Isosaki jinja) is a Shinto shrine located in Ōarai City, Ibaraki Prefecture, Japan. It has three torii gates leading into the ocean. == Overview == The shrine is believed to have been established in 856 A.D. and was destroyed during the 16th-century war. It was later rebuilt in the 17th century. The shrine has three torii gates, each offering a unique view and environment. The Kamiiso-no-Torii is the most impressive gate, providing a prime location to watch the sunrise as it faces east. As the sun appears on the horizon, its rays shine through the gate, giving it a beautiful red hue. At night, the gate is equally stunning when illuminated by moonlight. == Geographic location == Ōarai Isosaki Shrine is located on the Kantō Plain, northeast of Ibaraki Prefecture, situated next to the Pacific Ocean. Address: 〒311-1301, 6890 Isohama-chō, Ōarai-machi, Higashiibaraki-gun, Ibaraki-ken, Japan. Plans and satellite views of the sanctuary. Plans and satellite views of the Kamiiso torii gate (神磯). == History == The Ōarai Isosaki shrine has a long history and was established in the year 856. During the war from 1558 to 1570, the shrine was destroyed. However, it was rebuilt in 1690 by patrons, including . The Ibaraki Prefecture has designated the shrine as a cultural property. == Worshiped Deity == Ōarai Isosaki Shrine is dedicated to the deity Ōnamuchi-no-Mikoto (大己貴命), known as a kami of family safety and prosperous business. == Characteristics == The Oarai Isosaki-jinja shrine has three torii gates in separate locations. The main torii gate is a huge reinforced concrete structure that is 15.60 m high and 22.42 m wide, located on a path. Behind it, a second Torii rises, and as you pass this second torii, you see the shrine buildings. The third torii, Kamiiso Torii (神磯鳥居), is located on the coast and faces east towards the Pacific Ocean, it faces east to the ocean and the rising sun, representing the spot where the gods landed. The shrine is about two and a half kilometers away from Oarai Station and can be accessed by taxi or bus. . Oarai Isosaki-jinja is dedicated to two deities, Onamuchi-no-Mikoto and Sukunahikona-no-Mikoto, who are believed to have created Japan. The shrine also has an impressive worship hall, guarded by statues of frogs instead of the typical lion-dogs. The frog is considered a symbol of good luck in Japan as it sounds like \"safe return\" or \"return of something lost\" in Japanese. The ocean is a Kannabi for the deities == Hassaku Matsuri == The Hassaku Matsuri, a traditional festival of the shrine, is held annually on August 25th. == References == Category:Beppyo shrines Category:Myōjin Taisha Category:Kokuhei Chūsha Category:Shinto shrines in Ibaraki Prefecture",
 "title": "Ōarai Isosaki Shrine"
}