{
 "id": "1005472",
 "text": ", is a mountain in the city of Tsuruoka. It was part of the ancient province of Dewa in Japan. It is one of the Three Mountains of Dewa and stands at 414 meters (1,358 feet), making it the shortest of the three. However, unlike the other two mountains, it is accessible throughout the year. It has the famous Dewa Shrine on it. There is a path that has 2,446 stone steps leading to its summit. The mountain has 600-year-old trees, and along the way to the top, you will see famous landmarks like the Gojūnotō five-story pagoda, Grandpa cedar (jijisugi 爺杉), a 1000-year-old cedar tree, and many shrines. The steps and the pagoda are important and are listed as National Treasures. At the summit of the mountain is the Sanjingōsaiden shrine (三神合祭殿), which honors the spirits of all three mountains. You can also reach the summit of the mountain by bus service. Besides religious pilgrims, travelers often stay at the Saikan temple lodgings. In the Edo period there used to be 336 shukubo on the mountainEarhart, H. B. (1965). Four Ritual Periods of Haguro Shugendō in Northeastern Japan. History of Religions, 5(1), 93–113. http://www.jstor.org/stable/1061805 == Gallery == File:Hagurosan Syoro 2006.jpg|Shōrō File:Hagurosan Gohaiden 2006.jpg|Sanzan Gosai-den temple File:Hagurosan Gohaiden kohai 2006.jpg|Gosai-den-haiden File:Hagurosan Gojunto 2006-B.jpg|Gojū-tō File:Hagurosan Path to the summit 2006.jpg|The path to the summit File:Hagurosan Haniyamahime jinja 2006.jpg|Haniyamahime-jinja File:Five tier pagoda at Mt. Haguro 2006-10-29.jpg|The Gojū-tō Pagoda, near the base of Mount Haguro File:HaguroSan1.jpg|The grounds of the Saikan lodgings. File:HaguroSan2.jpg|A temple at the top of Mount Haguro. File:HaguroSan3.jpg|Detailed engraving work on top of a temple. File:HaguroSan4.jpg|Bell and torii File:HaguroSan5.jpg|Incense File:HaguroSan6.jpg|Sculpture File:HaguroSan7.jpg|The path to the summit == References == == Other websites == * Mount Haguro Page (English) * English information about Mount Haguro Category:Pages with unreviewed translations Category:Three Mountains of Dewa",
 "title": "Mount Haguro"
}