{
 "id": "1005314",
 "text": "The 2024 Democratic National Convention was an event in which delegates of the United States Democratic Party picked the party's nominees for president and vice president in the 2024 United States presidential election. Vice President Kamala Harris was formally nominated for president while Governor of Minnesota Tim Walz was formally nominated as vice president. It was held at the United Center in Chicago, Illinois from August 19 to 22. ==Selection process== Top Democrats from Illinois such as Governor J. B. Pritzker, Senator Tammy Duckworth, and Mayor Lori Lightfoot supported the city's bid to host the convention. Chicago has hosted the most major-party presidential nominating conventions of any city (14 Republican, 11 Democrat). The 1968 Democratic National Convention had violent protests between anti-war demonstrators and the Chicago Police Department. Facilities in Chicago that had been mentioned as possible primary venues include the United Center, Wintrust Arena, and Navy Pier. In April 2023, the United Center and McCormick Place were chosen as venues for the convention. Atlanta, Houston, and New York City were also candidates to host the convention. ==Security== In the aftermath of the assassination attempt on Donald Trump on July13, the Secret Service secured the United Center and the area surrounding it, and the Chicago Police Department secured everything outside the inner perimeter, with both agencies securing rooftops of all buildings that may have had a line of sight to the United Center. ==Protests== Several protests about the Israel-Hamas war took place. Chicago is home to the nation's largest Palestinian neighborhood, also known as \"Little Palestine,\" and Chicago is the largest American city to pass a cease-fire resolution about the Israel–Hamas war. The first of seven permitted protests took place the day before the convention started. Hundreds marched along Michigan Avenue to Grant Park. ==References== Category:2024 United States presidential election Category:Democratic Party (United States) Category:2020s in Chicago Category:August 2024 events",
 "title": "2024 Democratic National Convention"
}