{
 "id": "1005209",
 "text": "The Bataan Death March was a war crime committed by the Imperial Japanese Army during World War II. Japanese soldiers forced 76,000 prisoners of war (66,000 Filipinos and 10,000 Americans) to march 65 miles (105 km) across the Philippines. The Japanese soldiers abused the prisoners of war severely and killed many of them during this death march. The death march began on 9 April 1942, after the three-month Battle of Bataan in the Philippines during World War II. It started in the municipalities of Baguc and Mariveles on the Bataan Peninsula. It ended eight days later in Camp O'Donnel via San Fernando. == Conditions == Conditions along the death march were terrible. Lester Tenney, an American soldier who survived the march, said in an oral history: > Number one, we had no food or water. Number two, you just kept walking the > best way you could. It wasn’t a march. It was a trudge. . . . Most of the > men were sick, they had dysentery, they had malaria, they had a gunshot > wound. A man would fall down and [Japanese soldiers] would holler at him to > get up. I saw a case where they didn’t even holler at him. The man fell > down, the Japanese took a bayonet and put it in him. I mean, two seconds. According to the National Museum of the United States Air Force: > Some of the guards made a sport of hurting or killing the POWs. The Marchers > were beaten with rifle butts, shot or bayoneted without reason. Most of the > POWs [lost] their helmets because some Japanese soldiers on passing trucks > hit them with rifle butts. Some enemy soldiers savagely toyed with POWs by > dragging them behind trucks with a rope around the neck. Japanese guards > also gave the POWs the \"sun treatment\" by making them sit in the sweltering > heat of the direct sun for hours at a time without shade. [...] Sympathetic > Filipinos alongside the road tried to give POWs food and water, but if a > guard saw it, the POW and the Filipino helper could be beaten or killed. > Some POWs had the water in their canteens poured out onto the road or taken > by the Japanese just to be cruel. Although thirst began to drive some of the > men mad, if a POW broke ranks to drink stagnant, muddy water at the side of > the road, he would be bayoneted or shot. Groups of POWs were often > deliberately stopped in front of the many artesian wells. These wells poured > out clean water, but the POWs were not allowed to drink it. Some were killed > just because they asked for water. == Deaths == Sources do not agree on how many prisoners of war died before reaching Camp O'Donnell. Estimates say that 5,000 to 18,000 Filipinos died during the march, while 500 to 650 Americans did. The United States Department of Defense's web page on the Bataan Death March lists the number of deaths as 10,000. == Aftermath == After the war, the Japanese commander, General Masaharu Homma, and two of his officers, Major General Yoshitaka Kawane and Colonel Kurataro Hirano, were tried for war crimes by the United States military commissions. They were convicted of failing to prevent their subordinates from committing atrocities, and all three were sentenced to death. Homma was executed in 1946, while Kawane and Hirano were executed in 1949. ==References== Category:War crimes Category:World War II Category:History of the Philippines Category:1942 in the United States Category:1940s in Asia Category:Bataan",
 "title": "Bataan Death March"
}