{
 "id": "1005123",
 "text": "Arthur Henderson (13 September 1863 – 20 October 1935) was a British iron moulder and Labour politician. He was the first Labour cabinet minister, won the Nobel Peace Prize in 1934 and, uniquely, served three separate terms as Leader of the Labour Party in three different decades. He was popular among his colleagues, who called him \"Uncle Arthur\". He was born in Glasgow, His father was a textile worker who died when Arthur was ten years old. The Hendersons then moved to Newcastle upon Tyne. When he was 12 he worked as an apprentice at Robert Stephenson and Sons' General Foundry Works until he was 17. Then he moved to Southampton for a year and then returned to work as an iron moulder. In 1892 he was elected as a paid organiser for the Friendly Society of Iron Founders. He was involved in setting up the Labour Representation Committee in 1900. In 1903, he was elected Treasurer of the Committee and was also elected as Member of Parliament for Barnard Castle at a by-election. From 1903 to 1904, Henderson he was also mayor of Darlington. In 1908 he was elected Leader of the Labour Party. He resigned in 1910. In 1914 he was elected leader again when Ramsay MacDonald resigned. In 1915, Prime Minister H. H. Asquith's created a coalition government, Henderson became the first member of the Labour Party to become a member of the Cabinet, as President of the Board of Education. In 1916, David Lloyd George forced Asquith to resign and replaced him as Prime Minister. Henderson became a member of the small War Cabinet with the post of Minister without Portfolio. He resigned on 11 August 1917 after his proposal for an international conference on the war was rejected by the rest of the Cabinet. In 1918 he concentrated on building up the membership and organisation of the Labour Party. Henderson lost his seat parliament in the \"Coupon Election\" of 14 December 1918 which was a landslide victory for a coalition formed by Lloyd George. Henderson returned to Parliament in 1919 after winning a by-election in Widnes. He then became Labour's Chief Whip. Henderson lost his seat again, at the general election of 1922. He returned to Parliament via another by- election, this time representing Newcastle East, but again, he was unseated at the general election of 1923. He returned to Parliament just two months later after winning another by-election in Burnley. In 1924, Henderson was made Home Secretary in the first-ever Labour government, led by MacDonald. In 1929 MacDonald appointed Henderson as Foreign Secretary. MacDonald formed an emergency National Government in 1931 with members from all parties. MacDonald was expelled from the Labour Party. Henderson accepted the leadership of the main Labour Party and led it into the general election on 27 October against the cross-party National coalition. It was a disastrous result for Labour, which was reduced to a small minority of 52. MacDonald won the largest landslide in British electoral history. Henderson lost his seat, at Burnley. The following year, he resigned the party leadership. Henderson returned to Parliament after winning a by-election at Clay Cross in 1933. He was elected a total of five times at by-elections in constituencies where he had not previously been the MP. He holds the record for the greatest number of comebacks from losing a previous seat. Henderson spent the rest of his life trying to halt the gathering storm of World War II. He worked with the World League of Peace and chaired the Geneva Disarmament Conference, and in 1934 he was awarded the Nobel Peace Prize. == References == Category:Labour Party (UK) MPs Category:1863 births Category:1935 deaths Category:UK MPs 1900–1906 Category:UK MPs 1906–1910 Category:UK MPs 1910 Category:UK MPs 1910–1918 Category:UK MPs 1918–1922 Category:UK MPs 1922–1923 Category:UK MPs 1923–1924 Category:UK MPs 1924–1929 Category:UK MPs 1929–1931 Category:UK MPs 1931–1935 Category:Nobel Peace Prize winners",
 "title": "Arthur Henderson"
}