{
 "id": "1005210",
 "text": "John Boyd Orr, 1st Baron Boyd-Orr, CH, DSO, MC, FRS, FRSE (23 September 1880 – 25 June 1971) was a Scottish teacher, medical doctor, biologist, nutritional physiologist, politician, businessman and farmer who was awarded the Nobel Peace Prize for his scientific research into nutrition and his work as the first Director-General of the United Nations Food and Agriculture Organization. He started and was the first President (1960–1971) of the World Academy of Art and Science. In 1945, he was elected President of the National Peace Council and was President of the World Union of Peace Organisations and the World Movement for World Federal Government. He was born near Kilmarnock, and in 1885 the family moved to West Kilbride. He became a pupil teacher and then studied at the University of Glasgow. His first job as a teacher was in the slums of Glasgow. He was shocked by the condition of the children and left after a few days. He then taught for three years at Kyleshill School in Saltcoats. Then he went back to the university to study biology and medicine. He graduated in 1914. He got a job as a ship's surgeon and then as a general practitioner, but quickly moved into biological research, working with Edward Provan Cathcart and then moved to a new research institute in Aberdeen to study animal nutrition. This was delayed by the First World War, during which he worked as a doctor caring for the soldiers and spent three months in the naval hospital at Chatham. He went back to Aberdeen in early 1919 to set up the Rowett Research Institute, named after John Quiller Rowett, who donated a lot of money to it. He set up an experimental farm of around 1,000 acres. He raised a lot of money but later he said, \"I still look with bitter resentment at having to spend half my time in the humiliating job of hunting for money for the Institute.\" He moved from animal nutrition research to human nutrition. In 1927 he proved the value of milk being supplied to school children, which led to free school milk in the UK. His 1936 report \"Food, Health and Income\" showed that at least one third of the UK population were so poor that they could not afford to buy enough food to provide a healthy diet. It showed that there was a link between low-income, malnutrition and children doing badly in schools. In October 1945, Orr was elected Rector of the University of Glasgow after standing as an Independent Progressive candidate. He was elected as an independent Member of Parliament for the Combined Scottish Universities in a by-election in April 1945, and kept his seat at the general election shortly after. He resigned in 1946. After the Second World War, Boyd Orr resigned from the Rowett Institute, and took several posts, most notably as Director-General of the United Nations' new Food and Agriculture Organization. When he got the Nobel Peace Prize in 1949, he donated the entire financial award to organizations devoted to world peace and a united world government. He was elevated to the peerage in 1949 as Baron Boyd-Orr, of Brechin Mearns in the County of Angus. In 1960 Boyd Orr was elected the first president of the World Academy of Art and Science, which was set up by eminent scientists of the day concerned about the potential misuse of scientific discoveries, most especially nuclear weapons. == References == Category:Nobel Peace Prize winners Category:1880 births Category:1971 deaths Category:Politicians from Glasgow Category:UK MPs 1945–1950 Category:People from Ayrshire Category:Scottish scientists",
 "title": "John Boyd Orr"
}