{
 "id": "1005317",
 "text": "The Three Mountains of Dewa, also known as Dewa Sanzan in Japanese, are three special mountains in the ancient Dewa Province of Yamagata Prefecture. The three mountains are Mount Haguro, Mount Gassan, and Mount Yudono. These mountains are considered sacred in the Shinto religion and are particularly significant for the Shugendo mountain ascetic cult. Many people, including the well-known haiku poet Matsuo Bashō, visit Dewa Sanzan as a popular pilgrimage site. The Haguro Five-story Pagoda is a national treasure of Japan. It has three subshrines # Gassan Shrine # Hagurosan Shrine # Yudonosan Shrine == History == Over 1400 years ago in 593, Prince Hachiko opened the Dewa Sanzan mountains as a religious center, which is now considered the oldest history of mountain worship in Japan. After fleeing the Soga clan upon the killing of his father, Emperor Sushun, Prince Hachiko arrived in Dewa province, where he devoted the rest of his life to religious pursuits. He endured difficult ascetic exercises and a period of penance, leading to his worship of Haguro Gongen, the mountain deity. The prince began worshiping at the Gassan and Yudono mountains, leading to the enshrinement of all three deities at the temple on the peak of Mount Haguro. People started to visit Dewa Sanzan mountains regularly after it was established as a place for religious beliefs. They would sometimes travel thousands of miles during the summer months to pay their respects at the shrines. The mountains were important to many religions and were a place of learning for various belief systems, but especially for shugendō. Famous people like En no Gyōja, who created shugendō asceticism, and Kūkai, who founded the Shingon Sect, made the pilgrimage to Dewa Sanzan. After the Meiji Restoration in 1868, Japan's government decided to separate Shinto and Buddhism, making Shinto the official state religion. This affected shugendo negatively, and many of its priests left their religious life. After World War II, shugendo regained its status as a minor religious group. These changes also affected the Dewa Sanzan shrines' designations. In the Empire of Japan, Hagurosan Shrine and Yudonosan Shrine were designated as kokuhei shosha, while Gassan Shrine on Mount Gassan was considered a kanpei taisha. Today all three are considered equal Beppyo shrines == Significance in Japanese religion == Folk religion has been a significant part of the daily lives of Japanese people for a long time. One of its prominent aspects is the connection between religious beliefs and practices with sacred mountains. Mountain worship is a widespread practice in Japan, and it has been observed that almost every high mountain top has had its own dedicated shrine at some point. Many of these shrines receive thousands of worshippers each year for annual pilgrimages. This combination of religious practices and beliefs associated with sacred mountains is known as sangaku shinkō. The Dewa Sanzan are considered very holy in both Shinto and Buddhism religions, but especially important to the Shugendo religious beliefs. Each of the three sacred mountains, Mount Haguro, Mount Gassan, and Mount Yudono, has its own shrine, but the main Dewa Shrine is situated at the top of Mount Haguro. What makes the primary shrine unique is that it honors all three of the sacred mountains. Each year, lay practitioners of shugendo, known as yamabushi, pay homage to the Dewa Sanzan. Mount Haguro is particularly important in this practice as it serves as the gateway to Mount Gassan and Mount Yudono. Mount Haguro, despite being the smallest of the three Dewa mountains, is unique in that it remains accessible year-round unlike Mount Gassan and Mount Yudono, which are closed during winter due to heavy snowfall. As a result, it is the most renowned mountain of the three, and is well-known locally and internationally. One of Japan's national treasures, the Haguro Five-story Pagoda, is situated on Mount Haguro. Hagurosan Shrine is its shrine, and also called Dewa Shrine Mount Gassan is the tallest of the three sacred mountains and is famous for its natural scenery and beauty. It is home to many rare alpine plants and other marsh vegetation. The hiking path to the peak of Mt. Gassan is the second-highest point in the Shonai Region of Japan. However, due to heavy snowfall, the mountain is usually accessible only from late spring to early fall. Gassan Shrine is its shrine Mount Yudono is the most sacred and significant mountain of the Dewa Sanzan, considered the heart of the three sacred mountains. It is highly regarded as a training ground for ascetic discipline, and many yamabushi and ascetics believe that their pilgrimage is not complete until they reach the summit of Mount Yudono. The mountain is renowned for its goshintai, a sacred object believed to be connected to a god. The shrine on Mount Yudono is regarded as holy ground and is kept secret, with photography and video recordings being strictly prohibited even today. Yudonosan Shrine is its shrine. == Related pages == * Dewa Mountains == References == * Earhart, H. Byron. (1965). Four ritual periods of Haguro shugendo in northeastern Japan. History of Religions, 5(1), 93-113. * Earhart, H. Byron. (1968). The celebration of \"Haru-Yama\" (Spring Mountain): An example of folk religious practices in contemporary Japan. Asian Folklore Studies, 27(1), 1-24 * Hori, Ichiro. (1966) Mountains and their importance for the idea of the other world in Japanese folk religion. History of Religions, 6(1), 1-23 == Other websites == * Dewa Sanzan Guide * Dewa Sanzan Shrine * Haguro (Dewa Sanzan) Travel Guide * Dewa Sanzan | Welcome to Yamagata * Japan National Tourism Organization | Yamagata | Dewa Sanzan * Dewa Sanzan Monzenmachi Project Website * Yamabushi Training on The Dewa Sanzan Category:Myōjin Taisha Category:Beppyo shrines Category:Mountain faith Category:Pages with unreviewed translations Category:Three Mountains of Dewa Category:Shugendo",
 "title": "Three Mountains of Dewa"
}