{
 "id": "100581",
 "text": "Lojban is a constructed language that some people speak. It is an unusual language because it is based on predicate logic, and because it is made to have no syntactic ambiguity. These qualities make many people call Lojban a \"logical language.\" People from all countries can learn and speak Lojban. A person who speaks Lojban is sometimes called a lojbanist. Lojban was made between 1987 and 1997 by an organization called the \"Logical Language Group\". The rules (grammar) of Lojban are written in a book called The Complete Lojban Language. This book was published in 1997, and written by John Woldemar Cowen. Lojban grammar terms are ordered in a structure: *lojbo gerna Lojban grammar *├ jufra sentence, in view of etymology from Chinese 句 jù, Spanish frase, Russian фра́за *│└ bridi predicate structure *│ ├ selbri verb construction consisting of brivo *│ │└ tanru consists of more than one brivo, derived from English metaphor, Chinese 隐喻 yǐnyù, Hindi रूपक rupak *│ │ ├ seltau left word in a tanru *│ │ └ tertau right word in a tanru *│ └ terbri argument structure *│ └ sumti argument, equalling subject/object *│ └ gadri initiating article such as la, le, lo, derived from Chinese 冠词 guàncí, Arabic أداة adah, Spanish artículo *└ valsi word, derived from Hindi वचन vachan, Russian слово, Chinese 词 sí * ├ cmavo structure word, from ‘cmalu valsi’ = small word * │├ selma'o cmavo class * │└ terma'o (or cmavo smuni) cmavo meaning * ├ brivo, brivla * │├ gismu 5-letter root word, from Chinese 根基源 gēnjīyuán, Hindi मूल mul * │├ lujvo compound word made from ‘rafsi’ * ││├ rafsi affix, suffix, prefix, derived also from Hindi प्रत्यय pratyay, Chinese 词缀 sízhuì * ││├ reljvo, cibjvo, vonjvo, ... lujvo consisting of 2, 3, 4, ... rafsi * ││├ jvotau (or veljvo) tanru or metaphor construct (without shortenings to rafsi) of lujvo * ││├ zevlyjvo lujvo formed from zi'evla via a morphological extension using -(')y(')- hyphens * ││├ nibysucyjvo implicit-abstraction lujvo * ││├ (sizy)jvomi'u (concept of) equivalent, alternative lujvo form(s) with equal meaning, from ‘(si'o) lujvo mintu’ * ││├ jvova'i lujvo score, from ‘lujvo vamji’ * ││└ xlajvo bad / poorly-made lujvo, from ‘xlali lujvo’ * │└ fu'ivla loanword, from ‘fukpi valsi’ = copied word * │ ├ pavyfu'ivla in stage 1 the original word’s spelling is kept * │ └ zevla, zi'evla (zifre valsi = ‘free word’) * │ └ relfu'ivla, cibyfu'ivla, ... in higher stages foreign spellings are changed * └ cmevo, cmevla property word ending in a consonant, ‘cmene’ is a cmevo word(s) construction * └ jvocmevo lujvo-like cmevo Lojban is based on an earlier language called Loglan. Loglan was the first \"logical language\". It was created by a man named James Cooke Brown, who wanted to test a hypothesis called the Sapir-Whorf hypothesis. The Sapir-Whorf hypothesis says that languages affect and limit how their speakers think. == Goals == As with Loglan, one of Lojban's goals is to test the Sapir-Whorf Hypothesis. Lojban is meant to change how people think. This is because it is unlike any natural language, and because it forces its speakers to focus on the logic of what they say. Another goal of Lojban is to be simple and easy to learn, so Lojban only has 1300 main words. Anyone can combine these \"root words\" to make more complex words. If you speak Lojban correctly, it is unlikely for someone else to be confused by what you are saying. This is because one goal of Lojban was to eliminate syntactic ambiguity from language. One of the problems with natural languages like English is that they have very much ambiguity. This means that not everything a person might say has one clear meaning in these languages. Linguistic relationships are always very clear in Lojban, so such ambiguity cannot exist in the language. == Examples == Here are some examples of words and sentences in Lojban: Word Meaning coi (sounds like shoy) Hello coi rodo (sounds like shoy row-doe) Hello, everybody mi'e ... (sounds like me-heh) My name is.. (see below) co'o (sounds like show-hoe) Goodbye pe'u (sounds like peh-who) Please ki'e (sounds like key-heh) Thanks go'i (sounds like go-hee) Yes (see below) nago'i (sounds like nah-go-hee) No mi na jimpe (sounds like me nah zheem-peh) I do not understand xu do se jbobau (sounds like khoo doe seh zhboh-bow, bow rhymes with now) Do you speak Lojban? mi'e is used when you are telling somebody your name. There is no country where everyone speaks Lojban, so nobody is born with a name in Lojban. But, some Lojbanists make up lojban names for themselves that they use. Because they know most other people do not speak lojban, they usually keep their real name as well, and only use their lojban name when speaking to other lojbanists. If someone is telling you their real name, they usually say mi'e la'oi (sounds like miheh lahoy) followed by the name. go'i means \"yes, I agree with you\". Sometimes in English, the word 'yes' is used to mean other things. For example, you might say \"Yes\" (or \"OK\" or \"uh-huh\") to tell someone that you heard what they are saying. In Lojban you do not say go'i for this; instead you say je'e (sounds like zhehheh). This is part of the idea of lojban: to make words easier to understand by making sure that one word can only mean one thing. == References == Category:Constructed languages",
 "title": "Lojban"
}