{
 "id": "1005195",
 "text": "is a term in ancient Shinto that refers to rocks believed to contain the spirits of Kami. These rocks, which are the object of worship, are also known as Yorishiro. == Overview == People in Japan have been practicing nature worship for a very long time. This means they believe that gods and spirits live in nature. In Shinto ceremonies, they believe the gods come from a special rock called shintai. They use a special object called yorishiro, which represents the gods' power and is placed at the center of the ceremony. As time went by and temples became more permanent, the focus of worship shifted from the body of the gods to the shrines themselves. Sacred trees and stones, decorated with shimenawa ropes, can still be found in many temple grounds. Alongside the belief in rocks, Japan also has various other forms of nature worship. For instance, Chinju no Mori is a belief where certain areas are considered forbidden and off-limits. Munakata Taisha's Okinoshima is another example of a sacred island where the spirits of ancestors are believed to reside. Additionally, there are mountain worships, such as Rokko Himei Shrine and Mount Miwa, as well as beliefs in natural elements like fire, waterfalls, wind, rain, and lightning. Another rock-related object in Shinto is called Iwasaka, which is believed to be a ritual site that centers on a rock. However, compared to Iwaza, there is little evidence of its existence. The Nihon Shoki (Chronicles of Japan) distinguishes Iwasaka from Iwaza, suggesting that it is a distinct object. Additionally, a banjiki is similar to a stone circle and serves as a boundary that marks the divine realm and preserves the sacredness of the site. Along the Kaido, some megaliths have carvings related to Buddhism, while others have legends associated with them, such as the tale of a famous samurai who bridged horses. The Iwakura Gakkai research group believes that the worship of rock formations and megaliths can be traced back to the Jomon period. They argue that some rock formations were artificially arranged to represent certain figures, directions, or even the shape of a constellation. However, the Iwakura Society disputes this view, stating that the Iwakura ritual did not begin until the Kofun period.Tsutomu Tokieda, Archaeological Study of Mountain Sacred Sites, Yusankaku Inc. 2018 Additionally, there is criticism of the idea that megaliths are human-made artifacts. === === An iwasaka is a type of stone altar or mound used in ancient Shinto practices as a yorishiro, or an object used as a dwelling place for a kami, or a god or spirit. The purpose of an iwasaka is to call upon the kami for worship. The words iwasaka and iwakura are often used interchangeably since their meanings are very similar.Sugiyama, \"Iwasaka\" == Gallery == File:Yagyu-Yamaguchi-jinja,_Tateiwa-jinja,_iwakura.jpg|Tachiban Shrine File:Yoki-tenman-jinja_Shrine_-_Iwakura.jpg|Yoiki Tenma Shrine File:Omiwa- jinja_Iwakura.jpg|Okami Shrine == Related pages == * Shrine * Shinto shrine * Himorogi * Megalith * Cinnabar == References == == Other websites == * イワクラ（磐座）学会 Category:Shinto religious objects",
 "title": "Iwakura"
}