{
 "id": "1005172",
 "text": "In road transport, a yield or give way sign indicates that merging drivers must prepare to stop if necessary to let a driver on another approach proceed. A driver who stops or slows down to let another vehicle through has yielded the right of way to that vehicle. In contrast, a stop sign requires each driver to stop completely before proceeding, whether or not other traffic is present. Under the Vienna Convention on Road Signs and Signals, the international standard for the modern sign is an inverted equilateral triangle with a red border and either a white or yellow background. Particular regulations regarding appearance, installation, and compliance with the signs vary by some jurisdiction. ==Gallery== Image:Vienna Convention road sign B1-V1.svg|International standard with white background (most countries around the world use this version) Image:CA-MUTCDC_RA-002.svg|Canada Image:Vienna Convention road sign B1-V2.svg|International standard with yellow background (Finland, Greece, Iceland, Kuwait, Poland, Sweden, Vietnam) Image:SACU road sign R2.svg|SACU standard (Botswana, Eswatini, Lesotho, Namibia, South Africa) (no longer used, the blue background has since been phased out in favour of white) ===Signs with text in English=== Image:UK traffic sign 602.svg|Antigua and Barbuda, Bahamas, Barbados, Bhutan, Gambia, Ghana, Grenada, Guernsey, India, Isle of Man, Jamaica, Jersey, Kenya, Malta, Mauritius, Montserrat, Pakistan, Saint Kitts and Nevis, Saint Lucia, Saint Vincent and the Grenadines, Seychelles, Tanzania, Trinidad and Tobago, Uganda, United Kingdom Image:Australia road sign R1-2.svg|Australia, Papua New Guinea, Tonga, Vanuatu Image:Dominica Give Way sign.svg|Dominica Image:New Zealand road sign R2-2.svg|Fiji, New Zealand, Samoa Image:IE road sign RUS-026.svg|Ireland Image:Liberian Road Signs - Regulatory Sign - Yield.svg|Liberia Image:Nigeria road sign - Give Way.svg|Nigeria Image:Singapore road sign - Mandatory - Give way.svg|Singapore Image:MUTCD R1-2.svg|United States Image:Give Way sign in Zimbabwe.svg|Zimbabwe, Malawi, Zambia (no longer used) ===Signs with text in Spanish=== Image:Mexico road sign SR-07.svg|Argentina, Bolivia, Ecuador, Mexico, Paraguay, Peru, Uruguay Image:Panama road sign R-2.svg|Colombia, Costa Rica, Dominican Republic, El Salvador, Nicaragua, Panama, Venezuela Image:Cuban Give Way sign.svg|Cuba Image:MUTCD-PR R1-2.svg|Puerto Rico ===Signs with text in French=== CA-ON road sign Ra-002 + Ra-002t (B).svg|Canada (Ontario) France road sign AB3a.svg|Benin, Burkina Faso, Chad, Cameroon, Congo, Côte d'Ivoire, France, Gabon, Guinea, Madagascar, Mali, Monaco, Niger, Rwanda, Senegal, Togo Breton_yiels_sign.png|France (Brittany) Haiti Yield sign.svg| Haiti ===Signs with text in other languages=== Yield sign (Tunisia).svg|Algeria, Morocco, Tunisia Brunei road sign - Give Way.svg|Brunei CN road sign 禁 2.svg|Mainland China Taiwan road sign f2.svg|Republic of China Hong Kong Road Sign 102.svg|Hong Kong IE road sign RUS-026G.svg|Ireland (Gaeltacht) Malaysia road sign RP13.svg|Malaysia Maldives Give Way sign.svg|Maldives Philippines road sign R1-2P.svg|Philippines QA road sign R101.svg|Qatar KR road sign 228.svg|South Korea Thailand road sign บ-2.svg|Thailand Give way sign (United Arab Emirates).svg|United Arab Emirates UK traffic sign 602 (Wales).svg|Wales ==References== Category:Traffic signs",
 "title": "Yield sign"
}