{
 "id": "1005120",
 "text": "Edith Frank (; 16 January 1900 – 6 January 1945) was the mother of Holocaust diarist Anne Frank, and her older sister Margot. After the family were discovered in hiding in Amsterdam during the Nazi occupation, she was transported to Auschwitz-Birkenau concentration camp. == Biography == === Early life === Edith was the youngest of four children, having been born into a German Jewish family in Aachen, Germany. Her father, Abraham Holländer (1860–1928) was a successful businessman in industrial equipment who was active in the Aachen Jewish community together with Edith's mother, Rosa Holländer (1866–1942). Edith had two older brothers, Julius (1894–1967) and Walter (1897–1968), and an older sister, Bettina. Bettina died at the age of 16 from appendicitis when Edith was 14. Both Julius and Walter immigrated to the United States, surviving afterwards. === Family === She met Otto Frank in 1924 and they married on his 36th birthday, 12 May 1925, at Aachen's synagogue. They had two daughters born in Frankfurt: Margot (born 16 February 1926) and Anne (born 12 June 1929). At the time Anne was born, the family lived in a house at Marbachweg 307 in Frankfurt-Dornbusch, where they rented two floors. Her daughters played almost every day in the garden with the children in the neighborhood. They all had different backgrounds; Catholic, Protestant or Jewish. They shared a curiosity about each other's religious holidays. Margot was invited to the communion celebration of one of her friends, and the neighbors' children were sometimes invited to the Frank's celebration of Hanukkah. Later the family moved to Ganghoferstrasse 24 in a fashionable liberal area of Dornbusch called the Dichterviertel (Poets' Quarter). Both houses still exist. === Immigration === The appointment of Adolf Hitler on 30 January 1933, to the position of chancellor in Germany and the following rise of antisemitism and start of discriminatory laws in Germany forced the family to emigrate to Amsterdam in 1933. In the Dutch capital Otto established a branch of his spice and pectin distribution company, called Opekta. Edith found emigration to the Netherlands difficult. The family lived in confined conditions and she had trouble with the new language. She remained in contact with her family and friends in Germany, but also made new friends in Amsterdam, most of them fellow German refugees. Edith became involved in Amsterdam's Liberal Jewish community, and attended synagogue with her oldest daughter regularly. On Friday evenings, the Franks often went to visit German- Jewish friends to eat together, and many Jewish holidays were also celebrated. Edith was an open-minded woman who educated her daughters in a modern way. Her older brothers Walter and Julius immigrated to the United States after 1938, and Rosa Holländer-Stern left Aachen in 1939 to join the Frank family in Amsterdam, where she died in January 1942. Anne Frank's cousin Bernhard (\"Buddy\") Elias has said that \"Edith never felt well in Holland. Edith was German, and she missed Germany. She did not learn Dutch very well. She did not feel at home in Amsterdam.\". IMG Entertainment. Originally broadcast on BBC in 1996. === Persecution and death === In 1940, the Nazis invaded the Netherlands and began their persecution of the country's Jews. Edith's children were removed from their schools, and her husband Otto Frank was forced by the Germans to give up his companies Opekta and Pectacon. Otto made his businesses look \"Aryan\" by giving over control to his Dutch colleagues Johannes Kleiman and Victor Kugler, who helped the family when they went into hiding at the company premises on 6 July 1942. The two-year period the Frank family spent in hiding with four other people (their friends Hermann van Pels, his wife Auguste van Pels and his son Peter van Pels, and Miep Gies's dentist Fritz Pfeffer) was recorded in Anne Frank's posthumously published diary. The diary ended three days before they were anonymously betrayed and arrested on 4 August 1944. After detainment in the Gestapo headquarters on the Euterpestraat and three days in prison on the Amstelveenseweg, Edith and those with whom she had been in hiding were transported to the Westerbork transit camp. From there, they were deported to Auschwitz concentration camp on 3 September 1944, on the last train to be sent from Westerbork to Auschwitz. Edith and her daughters were separated from Otto when they arrived, and they never saw him again. Edith looked for ways of keeping her children alive. Survivors later described them as an inseparable trio. On 30 October, another selection separated Edith from Anne and Margot. Edith was selected for the gas chambers, and her daughters were transported to Bergen-Belsen. Edith escaped with a friend to another section of the camp, where she remained through the winter. Edith became very ill and was taken to the sick barracks, where she died of weakness and disease on 6 January 1945, three weeks before the Red Army liberated the camp and 10 days before her 45th birthday. Her daughters outlived her by one month. == Her daughter's diary == Otto Frank was the only member of his family who survived the Holocaust and returned to Amsterdam in June 1945. One of the helpers, Miep Gies, gave him Anne's diary papers. She had saved parts of them, just like the other female secretary, Bep Voskuijl. == References == == Other websites == * Biography Edith Frank * Short profile of Edith Frank * Short quote by Miep Gies about Edith Frank in hiding * Video: Edith Frank and the relationship with her daughters Margot and Anne Frank (Buddy Elias) Category:1900 births Category:1945 deaths Category:German Jews Category:Dutch Jews Category:People who died in prison custody Category:People from Aachen Category:Anne Frank Category:Holocaust victims Category:Refugees from Nazism",
 "title": "Edith Frank"
}