{
 "id": "1005383",
 "text": "Inbe Shrine is a Shinto shrine in Nikenya-cho, Tokushima City, Tokushima Prefecture. It used to be a Myojin Taisha. It is a beppyo shrine under the Association of Shinto Shrines. == Deity == * (天日鷲命) Inbe Shrine's deity is believed to be the Oyagami or the ancestor deity of the . The shrine's deity is known to have played a role in the story of Amaterasu Omikami hiding in the cave, where Tentagyoku-no-mikoto led him to plant a tree and make a white coin woven from kozo fibers. The deity is also believed to have introduced cotton (also called Yu) to Japan. == History == Inbe Shrine was originally in Mashoku County, Awa Province and was listed in the 'Engishiki Jinmyocho' and 'Myojin Taisha Shrine'. However, due to fires and other factors, its location became unknown during the Middle Ages. In the early modern period, multiple shrines were built in Shikinai and Inbe Shrines claiming to be the original Inbe Shrine. In 1871, it was temporarily promoted to Kokuhei Chusha with \"location unknown\". In 1874, Inbe-jinja Shrine in Yamakawa-cho was replaced by Gosho- jinja Shrine. In 1881, Gosho-jinja Shrine was changed to Shikinaibu-jinja Shrine, but Yamazaki opposed it. In 1885, the current location on the slopes of Mt. Bizan was selected and Kotohira-jinja Shrine was enshrined there. It was moved to Gosho-jinja Shrine as a temporary subsidiary shrine before being relocated to its present location on May 15, 1892, following the completion of the shrine building. The shrine was built in the year 1892. But during the year 1945, a big part of the main buildings got destroyed because of war- related incidents. To rebuild it, the current main hall was constructed in 1953, which has a 3-bay front and a 2-bay roof on the remaining three sides. To decorate the roof, chigi and bonito were placed on the ridge. A loom is placed in the weaving hall. There the fabric for imperial succession is woven == Festival == * The Spring Reitaisai Washigae Shinto ritual is performed on May 15th to commemorate the Inbe Shrine's relocation in 1892. == References == == Sources == * Shikinaisha Kenkyukai, Shikinaisha Research Report, Volume 23, Nankaido, Kogakkan University Press, 1987 Category:Beppyo shrines Category:Kokuhei Chūsha Category:Myōjin Taisha Category:Inbe clan Category:Tokushima Prefecture",
 "title": "Inbe Shrine"
}