{
 "id": "1005623",
 "text": "This is a list of cricketers who play One Day International for India. ==Key== General * – Captain * – Wicket-keeper **: an innings that ended not out *Mat: number of matches played Batting *Inn: number of innings *NO: number of times an innings ends not out *Runs: number of runs scored by batsman/off bowler's bowling *HS: highest score *Avg: batting average Bowling *Balls: number of deliveries bowled *Mdn: number of maiden overs (overs off which no runs were scored) *Wkt: number of wickets taken *BBM: best bowling figures for the match *Avg: bowling average Fielding *Ca: number of catches taken *St: number of stumpings made ==Players== The list is arranged in the order in which each player won his first ODI cap. Where more than one player won his first ODI cap in the same match, those players are listed alphabetically by last name at the time of debut. The statistics in this table only include ODI matches played for India (some players have also played for the Asia XI or World XI). Statistics are correct as of 22 March 2023. General General General General General Batting Batting Batting Batting Batting Bowling Bowling Bowling Bowling Bowling Bowling Fielding Fielding No Name First Last Mat Inn NO Runs HS Avg Balls Mdn Runs Wkt BBM Avg Ca St 1 Syed Abid Ali 2 Bishan Singh Bedi 3 Farokh Engineer 4 Sunil Gavaskar 5 Madan Lal 6 Sudhir Naik 7 Brijesh Patel 8 Eknath Solkar 9 Srinivasaraghavan Venkataraghavan 10 Gundappa Viswanath 11 Ajit Wadekar 12 Gopal Bose 13 Ashok Mankad 14 Mohinder Amarnath 15 Anshuman Gaekwad 16 Karsan Ghavri 17 Syed Kirmani 18 Parthasarathy Sharma 19 Dilip Vengsarkar 20 B. S. Chandrasekhar 21 Pochiah Krishnamurthy 22 Sudhakar Rao 23 Surinder Amarnath 24 Chetan Chauhan 25 Kapil Dev 26 Yashpal Sharma 27 Bharath Reddy 28 Surinder Khanna 29 Kirti Azad 30 Roger Binny 31 Dilip Doshi 32 Sandeep Patil 33 T. E. Srinivasan 34 Yograj Singh 35 Randhir Singh 36 Ravi Shastri 37 Krishnamachari Srikkanth 38 Suru Nayak 39 Arun Lal 40 Ashok Malhotra 41 Ghulam Parkar 42 Balwinder Sandhu 43 Maninder Singh 44 T. A. Sekhar 45 Chetan Sharma 46 Raju Kulkarni 47 Manoj Prabhakar 48 Ashok Patel 49 Rajinder Ghai 50 Kiran More 51 Mohammad Azharuddin 52 Sadanand Viswanath 53 Lalchand Rajput 54 Laxman Sivaramakrishnan 55 Gopal Sharma 56 Shivlal Yadav 57 Chandrakant Pandit 58 Raman Lamba 59 R. P. Singh 60 Bharat Arun 61 Navjot Singh Sidhu 62 Arshad Ayub 63 Woorkeri Raman 64 Ajay Sharma 65 Sanjeev Sharma 66 Sanjay Manjrekar 67 Narendra Hirwani 68 V. B. Chandrasekhar 69 Rashid Patel 70 M. Venkataramana 71 Robin Singh 72 Salil Ankola 73 Vivek Razdan 74 Sachin Tendulkar 75 Venkatapathy Raju 76 Atul Wassan 77 Gursharan Singh 78 Anil Kumble1 79 Saradindu Mukherjee 80 Vinod Kambli 81 Javagal Srinath 82 Pravin Amre 83 Subroto Banerjee 84 Sourav Ganguly1 85 Ajay Jadeja 86 Vijay Yadav 87 Rajesh Chauhan 88 Nayan Mongia 89 Venkatesh Prasad 90 Atul Bedade 91 Bhupinder Singh, Sr. 92 Aashish Kapoor 93 Prashant Vaidya 94 Utpal Chatterjee 95 Rahul Dravid2 96 Vikram Rathour 97 Paras Mhambrey 98 Sunil Joshi 99 Sujith Somasunder 100 Pankaj Dharmani 101 Saba Karim 102 Dodda Ganesh 103 Abey Kuruvilla 104 Noel David 105 Nilesh Kulkarni 106 Harvinder Singh 107 Debashish Mohanty 108 Sairaj Bahutule 109 Hrishikesh Kanitkar 110 Rahul Sanghvi 111 Ajit Agarkar 112 V. V. S. Laxman 113 Harbhajan Singh1 114 Gagan Khoda 115 M. S. K. Prasad 116 Nikhil Chopra 117 Jatin Paranjpe 118 Sanjay Raul 119 Laxmi Ratan Shukla 120 Gyanendra Pandey 121 Amay Khurasiya 122 Sadagoppan Ramesh 123 Virender Sehwag2 124 Jacob Martin 125 Vijay Bharadwaj 126 Thirunavukkarasu Kumaran 127 Devang Gandhi 128 Sameer Dighe 129 Sridharan Sriram 130 Hemang Badani 131 Amit Bhandari 132 Vijay Dahiya 133 Zaheer Khan1 134 Yuvraj Singh1 135 Reetinder Singh Sodhi 136 Dinesh Mongia 137 Ashish Nehra1 138 Shiv Sunder Das 139 Deep Dasgupta 140 Ajay Ratra 141 Sanjay Bangar 142 Mohammad Kaif 143 Sarandeep Singh 144 Murali Kartik 145 Tinu Yohannan 146 Jai Yadav 147 Lakshmipathy Balaji 148 Parthiv Patel 149 Gautam Gambhir 150 Aavishkar Salvi 151 Amit Mishra 152 Abhijit Kale 153 Irfan Pathan 154 Rohan Gavaskar 155 Ramesh Powar 156 Dinesh Karthik 157 M.S. Dhoni1 158 Joginder Sharma 159 Suresh Raina 160 Yalaka Venugopal Rao 161 R. P. Singh 162 S. Sreesanth 163 Munaf Patel 164 V. R. V. Singh 165 Robin Uthappa 166 Wasim Jaffer 167 Piyush Chawla 168 Rohit Sharma 169 Ishant Sharma 170 Praveen Kumar 171 Manoj Tiwary 172 Yusuf Pathan 173 Manpreet Gony} 174 Pragyan Ojha 175 Virat Kohli 176 Subramaniam Badrinath 177 Ravindra Jadeja 178 Abhishek Nayar 179 Sudeep Tyagi 180 Abhimanyu Mithun 181 Murali Vijay 182 Ashok Dinda 183 Vinay Kumar 184 Umesh Yadav 185 Ravichandran Ashwin 186 Naman Ojha 187 Pankaj Singh 188 Shikhar Dhawan 189 Saurabh Tiwary 190 Wriddhiman Saha} 191 Ajinkya Rahane 192 Varun Aaron 193 Rahul Sharma 194 Bhuvneshwar Kumar 195 Mohammed Shami 196 Ambati Rayudu 197 Jaydev Unadkat 198 Cheteshwar Pujara 199 Mohit Sharma 200 Stuart Binny 201 Parvez Rasool 202 Axar Patel 203 Dhawal Kulkarni 204 Karn Sharma 205 Kedar Jadhav 206 Manish Pandey 207 Barinder Sran 208 Rishi Dhawan 209 Gurkeerat Singh 210 Jasprit Bumrah 211 Yuzvendra Chahal 212 Karun Nair 213 KL Rahul 214 Faiz Fazal 215 Hardik Pandya 216 Jayant Yadav 217 Kuldeep Yadav 218 Shardul Thakur 219 Shreyas Iyer 220 Washington Sundar 221 Siddarth Kaul 222 Khaleel Ahmed 223 Deepak Chahar 224 Rishabh Pant 225 Mohammed Siraj 226 Vijay Shankar 227 Shubman Gill 228 Shivam Dube 229 Navdeep Saini 230 Mayank Agarwal 231 Prithvi Shaw 232 T. Natarajan 233 Krunal Pandya 234 Prasidh Krishna 235 Ishan Kishan 236 Suryakumar Yadav 237 Rahul Chahar 238 Krishnappa Gowtham 239 Nitish Rana 240 Chetan Sakariya 241 Sanju Samson 242 Venkatesh Iyer 243 Deepak Hooda 244 Avesh Khan 245 Ruturaj Gaikwad 246 Ravi Bishnoi 247 Shahbaz Ahmed 248 Arshdeep Singh 249 Umran Malik 250 Kuldeep Sen Notes: *1 Anil Kumble, Sourav Ganguly, Harbhajan Singh, Zaheer Khan, Yuvraj Singh, Ashish Nehra and Mahendra Singh Dhoni also played ODI cricket for ACC Asian XI. Only their records for India are given above. *2 Rahul Dravid and Virender Sehwag have played ODI cricket for both the ICC World XI and the ACC Asian XI. Only their records for India are given above. ==Other websites== *Howstat *Cricinfo *International Cricket Council == References == Category:Lists of One Day International cricketers Test cricketers *",
 "title": "List of India ODI cricketers"
}