{
 "id": "100528",
 "text": "The Knights of the Round Table were characters in the legends about King Arthur. They were the best knights in King Arthur's kingdom, and lived in King Arthur's castle, Camelot. They were called the Knights of the Round Table because of a special table that was in Camelot, that was round instead of rectangular. This meant that everyone who sat around it was seen as trustworthy and equal. == Code of Chivalry == In order to become a Knight of the Round Table, a knight had to prove he was chivalrous (polite) enough. In the legend, the knights swore a Code of Chivalry, which is much like an oath is today. This meant that they promised to uphold the rules given to them once they became a Knight of the Round Table. Sir Thomas Malory wrote a book based on the legend of King Arthur. It was called Le Morte d'Arthur. In it, he wrote his version of the Code of Chivalry: * To never do outrage nor murder (not to assault or murder anybody) * Always to flee treason (do not commit treason, a crime against your country or king) * To by no means be cruel but to give mercy unto him who asks for mercy (Do not be cruel. Grant mercy to those who ask, even in combat.) * To always do ladies, gentlewomen and widows succor ('succor' is an old word for help; this means that the knight must promise to help women if they need it.) * To never force ladies, gentlewomen or widows (never 'harm' women.) * Not to take up battles in wrongful quarrels for love or worldly goods (do not ever join in fights over anything less than God or country) * To fear God and maintain His Church == List of the Knights of the Round Table == In different stories, there are different numbers of knights, ranging from 12 to more than 150. The Winchester Round Table shows 25 Knights. The most commonly mentioned in literature include: This is a list of other knights mentioned as being Knights of the Round Table. == References in other works == === Kingsman: The Secret Service === In the 2014 movie, Kingsman: The Secret Service, each of the Kingsman agents is named after one of the knights of the Round Table. Gary \"Eggsy\" Unwin, the main character, has the code name 'Galahad'. This is also the code name of Harry Hart, Eggsy's mentor. Roxy Morton, the only female Kingsman, has the codename 'Lancelot'. 'Arthur' is the codename for the leader of Kingsman, while 'Merlin' is the codename for their trainer and tech coordinator. These characters are also mentioned in \"Kingsman: The golden circle\", the second part of the franchise. One of the fictional Fate media franchise's most well known characters, \"Saber\" aka Artoria Pendragon, is a female character based on King Arthur. In the mobile game Fate/Grand Order, she alongside various other Knights of the Round Table (Lancelot, Gawain, Bedivere, Tristan), as well as Mordred, can be summoned as usable characters. Additionally, in Fate/Grand Order, Sir Galahad is the Heroic Spirit that was summoned into the body of another character in the game, Mash Kyrielight, and therefore is the one to bestow her his powers. ==Related pages== *Round Table == Other websites == *Timeless Myths page for Knights of the Round Table Category:Arthurian legend Category:Fictional knights",
 "title": "Knights of the Round Table"
}