{
 "id": "1005957",
 "text": "Amenota Nagao Shrine (Ame no Tanaga Ojinja,『日本廻国記 一宮巡歴』 pp.278-281『日本歴史地名大系 43 長崎県の地名』 pp.814-815『長崎県の歴史散歩』 p.202 Amanotanaga Ojinja 『日本廻国記 一宮巡歴』 p.294 『別冊歴史読本 7 諸国一宮と謎の神々』 p.150 『日本全国 一の宮巡拝完全ガイド』 p.139 ) is a Shinto shrine in Iki City, Nagasaki Prefecture. It is a Myojin Taisha and the Ichinomiya of Iki Province. Although people think the Shrine was listed in the \"Engishiki Jinmyocho\", the evidence supporting this claim is not very convincing. == Gallery == File:Hachigatayama.JPG|alt=鉢形山（はちがた‐）この山の頂に当社は鎮座している。|The shrine is at the top of mount Hachigatayama File:Amanotanagao_jinja_Honden_and_Haiden.JPG|alt=社殿拝殿（黄色い壁の部分）から続く屋根覆い（白い壁の部分）により本殿は雨風から保護されている。|The main shrine is sheltered from the rain and wind by a roof cover, which is a white wall that extends from the worship hall (a yellow wall part). File:Remain_of_Amanotanagahime_jinja.JPG|alt=村社 天手長比売神社址天手長比売神社は昭和40年（1965年）に当社へ合祀された。物部布都神社、若宮神社、宝満神社および粟島神社も同時期に合祀。|The Atenagahime Shrine ruins were incorporated into the shrine in 1965. == Sources == == Reference material == * \" Dai Nihonkoku Ichinomiya Chronicle \" ( Hokiichi Hanawa \" Gunrokuju vol.2 Jingibu\" April 15, 1977 Correction 3rd edition 3rd edition (published October 15, 1932), Sequel Gunrokuju Completion Meeting .) * Yoshida Togo \"Augmented Great Japan Geographical Dictionary (4) Saigoku\" Aug. 20, 1976 Augmented 3rd Edition (December 3, 1901 First Edition, Jun. 25, 1971 Augmented Edition), Toyamabo . ISBN 4-572- 00030-1 * Jiro Kawamura \"Nippon Kaikoku Ichinomiya Tour\" May 8, 1987 First edition, Kawade Shobo Shinsha . ISBN 4-309-22131-9 * Edited by Seiichiro Seno and Mikio Toyama \" Kadokawa Japanese Geographic Dictionary 42 Nagasaki Prefecture\" July 8, 1987, Kadokawa Shoten . ISBN 4-040-01420-0 * Supervised by Seiichiro Seno \"Japanese Historical Place Names 43 Place Names in Nagasaki Prefecture\" October 14, 2001 1st edition 1st edition, Heibonsha . ISBN 4-582-49043-3 . * History Subcommittee, Nagasaki Prefectural High School Education Study Group, Geohistory Civic Subcommittee, History Walk 42 Nagasaki Prefecture History Walk June 25, 2005 1st edition, Yamakawa Publishing Co., Ltd. ISBN 4-634-24642-2 * \"Separate Volume Historical Reading Book 7 Ichinomiya of the Countries and Mysterious Gods\" May 2008, 5, New Person Oraisha . ISBN 978-4-404-03607-0 * Invitation quest pilgrimage meeting \"Complete Guide to Pilgrimage to Ichinomiya in Japan\" June 15, 2011 First edition 1st edition, Mates Publishing . ISBN 978-4-7804-0963-5 * Iki City Ichikoku Museum website == Other websites == * Ametenagao Shrine (Kokugakuin University 21st Century COE Program \"Shinto and Shrine Historical Materials Compilation\") Category:Ichinomiya Category:Myōjin Taisha Category:Min-sha Category:Son-sha Category:Shinto shrines in Nagasaki Prefecture",
 "title": "Amanotanagao Shrine"
}