{
 "id": "1005267",
 "text": "Kokusai himitsu keisatsu series (国際秘密警察シリーズ, International Secret Police Series) is an action movie produced by Toho from 1963 to 1967. A total of five films were produced by Toho and stars Tatsuya Mihashi, a look-alike Cary Grant. == Overview == This series was produced in 1963 when the first James Bond film \"Dr. No\" (directed by Terrence Young) was released and became a hit in Japan. It is said to be \"the first spy movie in the world to be influenced by 007\". The basic story is that Jiro Kitami, an agent working for the International Secret Police/I.S.P. (国際秘密警察, Kokusai himitsu keisatsu), destroys evil organizations, just like the \"Japanese James Bond\" played by Mihashi. The highlights are the bizarre gadgets used during the missions and his skillful gun handling. The first work \"Interpol Code 8\" and the second work \"Tiger Fang\" were produced as pure spy action movies with a serious mood, but the third work \"Director Takashi Tsuboshima\" written by Shinichi Sekizawa and directed by Takashi Tsuboshima. From \"Keg of Gunpowder\" onwards, elements of sex appeal are added and Kitami becomes sloppy with women, the appearance of unrealistic enemy characters, elements of comedy touches is also included. It has become a work of entertainment for audiences looking to watch something different from other film genres they watched like kaiju and tokusatsu. In 1966, Toho invited American actor and producer Roger Smith, who was also popular in Japan with \"77 Sunset Strip\", a one-hour TV series planned starring a Japanese-American duo with Mihashi. Although the project fell through with many script changes, Shinichi Sekizawa rewrote the 5th and final film, \"The Killing Bottle,\" by reusing the novel \"Desperate Situation\" ( 絶体絶命, Zettai zetsumei) written by novelist Michio Tsuzuki for the pilot episode. == Films == === Kokusai himitsu keisatsu shirei dai 8-gō/Interpol Code 8 === : First installment・Release date: August 31, 1963 (Produced and distributed by Toho) :* Plot: Quyen, a government official was killed in Saigon, South Vietnam, and Akimoto, an employee of a Japanese trading company who had been in contact with the government official, disappeared. Jiro Kitami is dispatched to Japan from the International Secret Police (ISP) Headquarters in Paris, as the merchant of death, Rudolf Kent, is involved in this case. Together with Natsuo Ezaki, Akimoto's colleague, Kitami stands up to break the Kent gang's secret trading route. Category:Japanese movies",
 "title": "Kokusai himitsu keisatsu series"
}