{
 "id": "1005802",
 "text": "refers to the 492 shrines listed as Shikinai Taisha in the Engishiki Jinmyocho in the early Heian period, or shrines that call themselves ``~ taisha. The term became more strict in the Empire of Japan. In the past, simply speaking of Ōyashiro (Kunyomi of Taisha) generally meant Izumo Taisha ( Izumo City , Shimane Prefecture ). After the war, many shrines with the rank of taisha, such as the former Kanpei Taisha Shrine and the former Kokupei Taisha Shrine, called themselves taisha. An example is shown below. == Shikinai Taisha == Shikinai Taisha (式内大社) are shrines that are listed in volumes 9 and 10 of the \"Engishiki\" as Shinto shrines, also known as Shikinaisha, that are ranked as major shrines. There are 492 of these shrines listed. This category includes both the historical shrines and their modern equivalents. However, shrines that are designated as \"Myojin Taisha\" are not included in this category. See the category Shikinai Taisha for a list of such Taisha not also listed as Myojin Taisha == List of Taisha == Prior to World War II only two shrines were called Taisha: Izumo-taisha and Kumano Taisha, but after the war many historical taishas changed their names back to Taisha. Here is the list of such shrines. Shikinai Taisha are not included because of how large the list would be Current shrine name Former shrine name 近代社格制度下における神社名 Final shrine rank Location 現在の地名で表記 Prewar Izumo Taisha Shrine Kanpei Taisha Shrine Izumo City, Shimane Prefecture prewar Kumano Taisha Kumano Taisha Shrine Kokuhei Taisha Shrine Matsue City, Shimane Prefecture prewar Postwar Mishima Shrine Kanpei Taisha Shrine Mishima City, Shizuoka Prefecture postwar Sengen Shrine Kanpei Taisha Shrine Fujinomiya City, Shizuoka Prefecture postwar Suwa Shrine Kanpei Taisha Shrine Suwa City, Nagano Prefecture postwar Keta Shrine Kokuhei Taisha Shrine Hakui City, Ishikawa Prefecture postwar Nangu Shrine Kokuhei Taisha Shrine Tarui Town, Fuwa District, Gifu Prefecture postwar Tado Shrine Kokuhei Taisha Shrine Kuwana City, Mie Prefecture postwar Taga Shrine Kanpei Taisha Shrine Taga Town, Inukami District, Shiga Prefecture postwar Takebe Shrine Kanpei Taisha Shrine Otsu City, Shiga Prefecture postwar Hiyoshi Shrine Kanpei Taisha Shrine Otsu City, Shiga Prefecture postwar Kasuga Shrine Kanpei Taisha Shrine Nara City, Nara Prefecture postwar Tatsuta Shrine Kanpei Taisha Shrine Misato Town, Ikoma District, Nara Prefecture postwar Hirose Shrine Kanpei Taisha Shrine Kawai Town, Kitakatsuragi District, Nara Prefecture postwar Inari Shrine Kanpei Taisha Shrine Fushimi Ward , Kyoto City, Kyoto Prefecture postwar Matsuo Shrine Kanpei Taisha Shrine Nishikyo Ward, Kyoto City , Kyoto Prefecture postwar Umenomiya Shrine Kanpei Chusha Ukyo Ward, Kyoto City , Kyoto Prefecture postwar Sumiyoshi Shrine Kanpei Taisha Shrine Sumiyoshi Ward, Osaka City, Osaka Prefecture postwar Otori Shrine Kanpei Taisha Shrine Nishi Ward, Sakai City, Osaka Prefecture postwar Kumanoimasu Shrine Kanpei Taisha Shrine Tanabe City, Wakayama Prefecture postwar Kumano Hayatama Shrine Kanpei Taisha Shrine Shingu City, Wakayama Prefecture postwar Kumano Nachi Shrine Kanpei Chusha Nachikatsuura Town, Higashimuro District, Wakayama Prefecture postwar Munakata Shrine Kanpei Taisha Shrine Munakata City, Fukuoka Prefecture postwar Kora Shrine Kokuhei Taisha Shrine Kurume City, Fukuoka Prefecture postwar == Former Taisha == There are some shrines which formerly called themselves Taisha but not anymore. All of them were ranked as Kanpei-Taisha or the highest rank in the Shakaku * - The word \"Hikawa Taisha\" appears on the bag of votive offerings. * - There used to be a sign that said \"Hirano Taisha\" on the gate. * - A sign that reads \"Hiraoka Taisha\" is still present in front of the old station of Hiraoka. * - Generally referred to as \"Omamazu Ikoma Shrine\". == Controversy over the Taisha name == Izumo Taisha has expressed its concern about other shrines using the title \"Taisha\" as it goes against the traditional beliefs and values of shrines. According to an article in the Izumo Taisha organ paper 'Yugen', their parent deity, Ogami, is revered as \"Oyashiro\" and Izumo Taisha is the only shrine that has been inscribed as a \"taisha\" since the Nara Heian period. In the past, when people spoke of \"Taisha\", they were referring to Izumo Oyashiro, which was the residence of the Omikami (great god). However, over time, other shrines started using the name \"Taisha\". Izumo Taisha believes that this goes against the traditional belief in only one god and may cause confusion and misunderstanding among people. They fear that the prayers of their predecessors over many generations may not be conveyed correctly and that the people of today will use their own ways of calling things as they please, which could ultimately damage the virtues of the gods. 出雲大社教務本庁発行『幽顕』 == Related pages == * Myojin Taisha * Kokushi genzaisha == References == Category:Shikinai Taisha",
 "title": "Shikinai Taisha"
}