{
 "id": "1006656",
 "text": "are forests around Shinto shrines. The name means \"Guardian forest\". These forests may also surround temples, sando (approach paths), and other places of worship. == Meaning == Chinju no mori refers to the Forest that surrounded many Shinto shrine.祠を含む小さな神社で、神殿のすぐ隣まで人家などが建てられている神社は除く。 The character \"mori\" is frequently used in this context. In certain instances, the term \"shrine\" (社) is written and pronounced as \"mori,\" (森) indicating that Shrine Shinto may have originated from Koshinto where natural yorishiro such as kannabi or chinju no mori were more prevalent over built shrines.「みそぎ神社」 建物・施設紹介 In modern Shinto, people worship the shrine itself, which includes the main hall and other Shinto architecture decorated with shimenawa ropes. The surrounding forests are known as chinju-no-mori. However, in Koshinto, the original form of Shinto, nature itself is considered an object of faith, including Himorogi, Iwakura, Kannabi, forests, mountains, land covered with forests, seas, rivers, and other special places like reefs and waterfalls. People in Koshinto worship nature. Many sacred trees can be found in shrine precincts and mountains, including trees with unique trunks and branches, and large trees. Shinto shrines were often constructed at the boundary between the eternal and present worlds or at sites with sacred rocks or stones. For instance, Omiwa Shrine in Nara Prefecture worships Mount Miwa, which is regarded as the Shintai. Some shrines don't have a main shrine or a Honden and instead use hills and forests as their sacred objects or Kannabi. These shrines follow the ancient form of Shinto, which is also known as animism in Japan.神奈備祭について === Artificial Chinju no Mori === Some Shinto shrines have forests called \"Chinju no Mori\" created by planting trees. Meiji Shrine is a famous example. Although some trees were donated from other countries, they tried to match the natural vegetation in the area. The goal is for the forest to look like a natural shrine forest through natural growth over time. Kasugayama Primeval Forest was registered as a World Heritage Site and was designated as a cultural heritage site instead of a natural heritage site because of this. == Vegetation == Township forests are believed to have been preserved since ancient times, making their forest vegetation an original part of the area's nature. They are one of the few remaining clues to the former nature of the area, as surrounding nature is often destroyed. Because of this, they are often surveyed and protected as natural monuments. In Forest ecology in Japan, township forests are emphasized and referred to as shrine and temple forests, as they are often associated with these religious sites. Similarly, the forests associated with Utaki in Okinawa are also valuable and protected. It is important to note that the original vegetation in chinju forests may not have been fully preserved. If the surrounding area is developed and only the chinju forest remains isolated, the originally wide and continuous vegetation will have been fragmented. This can change the population in the area. For example, camphor, which is commonly seen in shrines, is not believed to have been originally found in the forests of central and southern Japan. Additionally, deciduous trees such as Keyaki and Mucunoki should not be present much in the climax community south of the plains in central Honshu. In addition, fragmented vegetation does not provide enough space for animals to move around and maintain their populations. Therefore, animal communities in such areas are believed to be more degraded than plant communities. This is a problem because many plants require specific animals for pollination and seed dispersal. The degradation of animal communities can therefore affect the vegetation in various ways. Humans also directly disturb the forest vegetation in shrine precincts. Non-native plants are often planted within the area. When a tree falls in the forest, the gap created by the fall is often filled by planting cedar or cypress, which is not necessarily the original vegetation of the area. Historical records show that forest resources within the precincts were utilized in advanced ways as early as the early modern period.. 鳴海邦匡・小林茂「近世以降の神社林の景観変化」歴史地理学48-1、2006年。Recently, some forests have been cleared and their leaves raked, but this type of maintenance is not necessary and can even cause more harm in natural forests. Additionally, forests are often cut off or trimmed due to road expansions or other reasons, which can destroy the forest's mantle and sod communities. As a result, the forest floor may dry out, leading to devastation. To restore these areas, concrete spraying is becoming more common, but this method is not conducive to natural recovery and can be harmful to the environment. However, unlike the so-called satoyamas, which are forests tended to for human use, these forests are more familiar to people and are treated differently. They continue to have a certain presence. == Decline == In modern times, people think shinto deities are more abstract and don't care much about the forests in Shinto shrines. Some believers don't think they're necessary. Although some shrines are still well-respected, many shrine forests have been cut down to make way for things like road repairs and buildings. This has happened especially in cities, where forests have been completely lost. Some shrines only have torii gates and main shrines, and the importance of nature worship in shrines has decreased. However Meiji Jingu and Tadasu Forest are two highly preserved ones. Before the Meiji era, villages had shrines of different sizes, and many of them had a forest for their Shinto shrine. However, the Shrine Consolidation Policy decree greatly reduced their numbers. As a result, many shrines were abolished, and their guardian forests were cut down. Minakata Kumagusu opposed Shrine merging as it would lead to large-scale destruction of nature due to logging. The Shrine Consolidation Policy aimed to have only one shrine per village, but some think it was for controlling wood resources or by-products like camphor. Shrines in central Honshu and southward have many large camphor and tabunoki trees, which could have been sold for a high price. It's now rare to see large plants of furan and sekkok on sacred trees in shrines due to the popularity of wildflowers. In the past, Minakata Kumagusu found a magnificent epiphytic orchid at a shrine in Wakayama Prefecture and happily told the priest. The priest was angry with him and scolded him for promoting something rare that could be stolen. == Revaluation and restoration == After the Pacific War, there was a lot of deforestation in Japan as part of national land development. This was not related to the Shinto religion. This caused people to start thinking about the negative consequences of too much development, depopulation, and a lack of land. As a result, initiatives such as the national trust movement were created to protect and restore forests and green spaces. The national trust movement has been successful in its efforts to conserve and rehabilitate forests and other vegetation. After the 2011 Tōhoku earthquake and tsunami, there was a focus on preserving and restoring the forests affected by the disaster.鎮守の森プロジェクト（2018年5月19日閲覧）鎮守の森を再び シャクナゲなど130本植樹 二里町大里地区住民『佐賀新聞』LiVE（2018年3月7日）2018年5月19日閲覧。 == Related pages == * Kannabi * Shinboku == References == == Other websites == * 国柄探訪：「鎮守の森」を世界へ Category:Shinto shrines Category:Religion in Japan Category:Pages with unreviewed translations",
 "title": "Chinju no Mori"
}