{
 "id": "1006044",
 "text": "Living worship, also known as seishi (生祀) in Japanese or shengci in Chinese, is a cultural practice in East Asia where living people are worshipped. In China, this practice takes place at sheng shrines (Chinese: 生祠, Shengci), where two types of enshrinement occur. The first is the enshrinement of the spirit of a living person who has made a significant contribution. The second type is the enshrinement of one's own spirit. The practice of living worship became associated with corruption in China after it was used by Wei Zhongxian, and subsequently declined. In Japan, it was most prominent during the period of imperial State Shinto from the late 19th century until 1945, particularly in the worship of the Emperor. == In China == During the time when Reunobu was the prime minister of Yan in the Former Han dynasty, he constructed a shrine called the \"Reun Gong Shrine\" between the states of Yan and Qi. Similarly, when Shiqing was the prime minister of Qi, the people of Qi built a shrine in his honor called the \"Shiqing Shrine\". These are considered to be the earliest examples of sheng shrines..Zhao Yi, \"The New New Ancestral Hall\", Volume 32, \"Ancestral Hall\", \"This is the beginning of the establishment of an ancestral hall. During the Tang dynasty, officials in office faced restrictions when it came to building monuments and shrines. The Tang Rulings and Ordinances stated that anyone who erected shrines or monuments without permission could be penalized with one year of imprisonment..The Tang Code, Volume 11 (The Law of Office) During the Ming dynasty, peasants in Tengzhou, China built a shrine to commemorate Zhao Bangqing, who was known for his clean politics and was appointed to Yanjing. The shrine was built to honor his memory and achievements. During the reign of the Tianqi Emperor in the Ming Dynasty, the eunuch Wei Zhongxian had a lot of power and made a sheng shrine for himself. People who wanted to please him or were scared of him were given these shrines too. In 1627, Lu Wanling, a government official, wrote about the famous philosophers Confucius and Chung-Hsien. In the same year, two other officials named Yuan Chonghuan and Yan Mingtai asked the government to praise Wei Zhongxian and build shrines for him. Many shrines were built, costing a lot of money and causing harm to the people. Huang Yun Yasushi even made a statue to honor Wei Zhongxian.\"Ming Xi Zong Jizhu\": \"in April of the seventh year of the reign of Emperor Tianqi, the governor of Thistle Liaoning, Yan Mingtai, and the governor of Fuxing Yuan Chong Huan, praised the merits of Wei Zhongxian, and requested the construction of a shrine in front of Ning, giving the name Mao De.\" The government of the Liaoning Province has been inscribed in gold and stone, and there is no room for extra duties. The minister's single- mindedness in patrolling, strict warning of the battalion generals, do not dare to greed cowardly selfishness, do not dare to give away the hidden string, change the virtual into the real, into the real, easy timid into brave, to have today. Sustainability ancient internal minister who has the right!\" (\"Ming Xi Zong seven years of the Imperial Court of the Department of the Experiment\" Tianqi six years in October) Wei Zhongxian's behavior has been strongly condemned in modern times. Gu Yanwu expressed his sorrow about the widespread practice of officials building sheng shrines during his time. He observed that every official seemed to be building one, but then after they left their position, they would destroy the statues and change the master of the shrine..《Nichi Chi Roku》 vol. 23 (Sheng Shi), p. 644. == In Japan == During the Edo period (1603-1868), the practice of seishi became popular, which involved creating one's own spiritual memorial site where their soul would be worshiped after death. One famous example of this is Matsudaira Sadanobu, who established his own seishi at Okuzawa Hachiman-gu in 1797. During the Edo period in Japan, the practice of seishi, or the establishment of one's own spiritual memorial site, became popular. It was influenced by Edo neo-Confucianism, which was introduced from China, and Yamazaki Ansai was a notable figure who developed rituals for seishi based on Confucian ceremonies. He established his own seishi in 1671 at his home in Kyoto. The practice spread to Shinto and the Hirata school of kokugaku, and each group had their own unique rituals. Seishi were believed to bring longevity in life or enable one to become a god after death, and its origin is traced back to the myth of Amaterasu, who enshrined her divine spirit at Mount Miwa.. Genchi Kato is known for his extensive study of seishi and has identified a total of 670 known seishi. The most recent seishi was established in 1931 at the Nishi- Chogo Shrine in Higashikokura, Hokkaido. The seishi of Emperor Meiji, Empress Shōken, Emperor Taisho, and Empress Teimei were also established in various locations throughout Japan, including Hokkaido, Hiroshima, and Himeji. Emperor Meiji's seishi was established in 1876 in Ishinomaki, Miyagi Prefecture, and again in 1893 at the Yahiko Shrine in Tatsuno, Nagano Prefecture. == Related pages == * Tamaya * * Hitogami == References == Category:Shinto Category:Religious Confucianism Category:Pages with unreviewed translations",
 "title": "Worship of the living"
}