{
 "id": "1006053",
 "text": "Ame-no-Minakanushi is a god in Japanese stories. They were one of the earliest gods, who appeared when the world was made. They are also called \"Lord of the August Center of Heaven\". == Mythology == According to the Kojiki, Ame-no- Minakanushi was the first deity to emerge in the heavenly realm of Takamagahara after the creation of heaven and earth from the primeval chaos. In the main narrative of the Nihon Shoki and in many of its variant accounts, the first kami is identified as Kuni-no-Tokotachi, and Ame-no-Minakanushi only appears briefly in one of these variants. * == Analysis == It is unknown whether people actually worshipped him, as there was no direct evidence historically. Some scholars believe the lack of evidence of worship is not enough to say he wasn't worshipped. == Worship == In Japan, the Buddhist deity Myōken has been worshiped since the 7th century. During the early modern period, Myōken became associated with the Big Dipper and the northern pole star, which led to its conflation with Ame-no-Minakanushi. When the Meiji government required the separation of Buddhism and Shinto, many shrines dedicated to Myōken became shrines to Ame-no-Minakanushi. Ame-no-Minakanushi was also a patron deity of the , which aimed to fuse Buddhism and Shinto under a state-sponsored initiative after the initial separation policy was deemed too divisive. == Related pages == * Kuni-no-Tokotachi * Yin and yang Counterparts of Ame-no-Minakanushi in other cultures * Para Brahman, the Hindu counterpart * Jade Emperor, the Chinese counterpart * Adi Buddha, the Esoteric Buddhist counterpart * Yuanshi Tianzun, the Taoist counterpart * Monad, the Gnostic counterpart * Yahweh or Jehovah (referred as Allah (\"the god\") in Arabic), the Abrahamic counterpart * Haneullim, the Korean counterpart * Ông Trời, the Vietnamese counterpart == References == == Sources == * Joseph Mitsuo Kitagawa. On Understanding Japanese Religion. Princeton University Press, 1987. ISBN 0691102295 == Other websites == * Encyclopedia of Shinto * Amenominakanushi on the Japanese History Database. Category:Japanese mythology Category:Pages with unreviewed translations Category:Amatsukami",
 "title": "Ame-no-Minakanushi"
}