{
 "id": "1006156",
 "text": "Danila Sergeevich Bagrov is the leading person in the movies called \"Brother\" and \"Brother-2\", directed by Alexei Balabanov. The character is portrayed by Sergei Bodrov Jr. in both films . Danila Bagrov is a veteran of the First Chechen War and has completed his military service. He was born on August 5, 1975, making him 22 years old in the first film. Danila's fellow soldiers, Kostya and Ilya, think that he is the most skilled fighter among them. However, Danila is modest and doesn't like to boast about his achievements during the war. He often says that he worked as a clerk at the headquarters, but he is actually highly skilled in hand-to-hand combat, mine explosives, and shooting. He is also good at using combat tactics in urban environments and can even make and repair firearms in artisanal conditions. Despite his quirky appearance, Danila is tough on injustice and shows no mercy to his enemies. He enjoys listening to Russian rock bands such as Nautilus Pompilius and DDT, but he dislikes pop music, which he calls \"fake\" since they didn't listen to it during the war. Film critic Elena Stishova describes him as a \"folk hero\" and \"gentleman thief\". == Biography == === Family === Before joining the Russian army, Danila lived with his retired mother, whose name is unknown. His father, Sergei Platonovich Bagrov, was a repeat offender who died in prison in January 1982. Danila was mostly raised by his older brother Viktor, who served in the Soviet army, as seen from a photo in the family album in the movie \"Brother\". Viktor Sukhorukov portrays Viktor, who is much loved by Danila and acts as a father figure to him. Unlike Danila, Viktor is outgoing, sociable, and expresses emotions openly. However, Viktor lacks moral integrity and is too frivolous. He is even willing to commit crimes for money. In \"Brother 2\", Danila mentions their grandfather who died during the Great Patriotic War, but his name is not mentioned. === Events of the first film === After being discharged from the army, Danila returns to his hometown where he gets into a fight with a security guard on the set of the music video for the song \"Wings\" by Nautilus Pompilius. He is arrested by the police but is eventually released. Danila finds life in his hometown boring and decides to go to St. Petersburg, where his older brother Viktor has settled down and is doing well. Danila soon learns that his older brother Viktor is a hired killer known as Tatar. Viktor involves Danila in his work, sending him to do all the dangerous and illegal tasks. The first task Danila completes is killing a Caucasian man who was a former Chechen militant and the owner of a city market. The man was disliked by the gangsters, and during the ensuing chase, Danila seriously injures one of them. Later, at the request of Viktor, Danila participates in an ambush with two accomplices. However, after completing the task, Danila kills both accomplices in order to save a random witness from being harmed. Following the betrayal of his brother, Victor, Danila confronts and defeats the bandits, and forgives his brother. With his friends lost and disillusioned with the justice system, Danila decides to leave St. Petersburg and move to Moscow, where he hopes to attend university and become a doctor. === Events of the second movie === Danila meets with his friends Kostya and Ilya from Chechnya in Moscow. Kostya's twin brother Mitya plays in the NHL, but the money he earns goes to an American businessman who does bad things. Kostya wants to help his brother, so he asks his boss Belkin to talk to the American. But Belkin has his own interests in illegal gambling, and he tells his people to \"sort out\" Kostya, which leads to them trying to kill him. Danila wants to help and get justice for his friend. Meanwhile, Danila's brother Viktor comes to Moscow to be with him. Danila learns that the American businessman is behind Kostya's troubles, so he decides to go to America with his brother to find him. To avoid suspicion, they fly on different flights: Victor to Chicago and Danila to New York. Danila befriends a truck driver who helps him get to Chicago, but he can't find his brother and runs out of money. He then meets a Russian prostitute named Dasha who is in trouble and saves her with the help of his weapons. Finally, he tracks down the American and forces him to return all the money owed to the hockey player. Danila meets with his brother in America but they are chased by the police and Ukrainian mafia. Viktor is captured by the police after a shootout in a restaurant. Danila and Dasha manage to escape the American police and leave the United States by plane. It is unknown what happens to Danila after the events of the second film. == Influence == The character created by Sergei Bodrov was very popular with the Russian audience. Despite the fact that Alexei Balabanov treated Danil Bagrov as an object of directorial irony, the audience saw him as a national hero. In September 2014, the graffiti team from Vitebsk \"HoodGraff\" painted a portrait of Danila Bagrov on the wall of the transformer box, the creation is located near the Alexander Nevsky Lavra, next to the Prospect Obukhovskoy Oborona stop in St. Petersburg. In 2015, in the Perm club \"House of Culture\", the artist Vyacheslav Nesterov, working under the pseudonym Slava Triptych, made a huge portrait of Danila Bagrov. In 2017, according to the results of online voting, Danila Bagrov was recognized as the national superhero of Russia. In August 2018, Danila Bagrov was parodied in Monetochka's video \"90\". In September 2018, the popular video blogger Enjoykin created the music video \"Brother\", which gained more than one and a half million views in a day after publication and took second place in the top YouTube site. The teaser for “Brother 3” (in which rapper Ptakha asks an armed man with a beard a question: “Tell me, gypsies, what is the truth?” And receives the answer “In force”) had a wide resonance, and caused almost universal indignation among Runet users: in they saw disrespect for the memory of Alexei Balabanov and Sergei Bodrov Jr. == Other appearances == * The Nautilus Pompilius group released a music video for the song \"In the Rain\", which was directed by Alexei Balabanov and featured new footage with Danila Bagrov (played by Sergey Bodrov Jr.) from the first film. . [ significance of the fact? ] * Sergei Bodrov mentioned in an interview with the editors of the magazine Art of Cinema that the character Danila Bagrov makes an appearance in his film \"Sisters.\" Danila Bagrov is portrayed as the guy who arrives in a jeep to the song \"No one writes to the Colonel\" and then shoots at a shooting range. Bodrov considers this appearance to be a \"cheerful greeting\" to Alexei Balabanov, the director of \"Brother.\" . * Danila Bagrov and Viktor Bagrov appear in the videogame \"Brother 2: Back to America\" * Danila Bagrov appears in the comic \"Brother 25 years\" released on the 25th anniversary of the first movie. == Titles == The Russian cargo ship Danila Bagrov is named after him. == Sweater == The sweater worn by Danila Bagrov in the movie was found by Nadezhda Vasilyeva, the costume designer and wife of director Alexei Balabanov, by chance during the filming of the first movie. It became an important part of Danila's image. > I went to a second-hand store because we didn't have enough money for > costumes. While searching, I found a sweater that cost thirty-five rubles. I > realized it was perfect for Bodrov's character, and when I put it on him, > everyone thought he looked really cool. We argued for a while, but Bodrov > really wanted to wear it, so we convinced Balabanov to buy it. Balabanov > agreed, as long as Bodrov wore something waterproof over it. So, Bodrov wore > a windbreaker over the sweater. The boys dressed in a similar way for the > film. I consider this my biggest achievement in life. Everything else, like > costumes and clothing, was secondary . == Criticism == Literary critic and publicist Viktor Toporov pointed out that there are similarities between two works by director Alexei Balabanov - the short story \"Trofim\" from the film almanac \"The Arrival of the Train\" (1995) and the film \"Brother\" (1997). The critic noticed that in two works of director Alexei Balabanov, \"Trofim\" from the film \"The Arrival of the Train\" and \"Brother\", the main characters both went to St. Petersburg and then to Moscow, just like Danila Bagrov did in \"Brother 2\". Additionally, both films showed the arrival in St. Petersburg at the same station, Vitebsk. [ source not specified 566 days ] . Sergei Kudryavtsev, a film critic, agrees with the previous observation and suggests that \"Brother\" and \"Trofim\" cannot be understood separately. Both the main characters, Danila and Trofim, arrive in a city that is equally unfriendly and scary. The only difference is that the modern city does not have the characteristics of an imperial capital, but rather resembles a \"lifeless graveyard.\" Tatyana Semyonova and Maria Erokhina, who hold degrees in Philosophy and Cultural Studies respectively, suggest that Danila Bagrov represents the traditional \"Russian wanderer\" image, but in the context of the 1990s. In the first movie, he returns from the war in Chechnya and travels to St. Petersburg to see his killer brother. In the second movie, he is sent from Moscow to the United States. The Russian wanderer is known for embarking on a never-ending journey through time and space, facing countless challenges in search of truth or God. == Related pages == * Strength is in truth == References == Category:Fictional murderers Category:Fictional war veterans Category:Articles with unsourced statements from September 2021 Category:Pages with unreviewed translations Category:Russian military people",
 "title": "Danila Bagrov"
}