{
 "id": "1006042",
 "text": ", or \"man-god,\" is a belief in Shinto where humans are worshipped as gods during their lifetime or after their death. The word \"Hitogami\" comes from the Japanese words \"hito,\" meaning \"human,\" and \"kami,\" meaning \"god.\" In Japan, this belief is also called \"ikigami\" or \"arahitogami,\" especially when the deity is still alive. The hitogami belief system is distinct from the ujigami belief system in that the latter is centered on the deity's association with a particular family or geographical area. In contrast, the hitogami belief system places more emphasis on individual faith as the foundation for belonging to the group of followers.. People who become human deities include sorcerers, priests, and others who possess special and unusual magical powers, tribal chiefs, kings, and others with superior skills, such as outstanding dancers, soldiers, and others, as well as physically disabled people, Confucian scholars, and foreign aliens who are different from ordinary people. Hitogami are diverse and can be divided into those who are deified during life and those who are worshipped as human deities after death. In Japan, people worship humans after they die to help resolve any lingering negative feelings. Those who are worshipped during life include head priests, shrine maidens, and masquerading deities in the rituals of the miya-za. The hitogami and ujigami belief systems have interacted for a long time in Japanese history. Examples of the hitogami belief system include the worship of heroes like Hachiman and Tenjin, as well as the enthusiastic singing and dancing of festival processions, and the charismatic leadership of some of Japan's \"new religions.\" In the past, when societies were more hierarchical, it was typical for members of the ruling class who lost political battles to express their resentment through curses even after they died. They would also offer sacrifices to the gods in order to pacify their grudges.. == People as Yorishiro == In Shinto belief, people can act as a yorishiro and are referred to as yorimashi (憑坐, lit. 'possessed person') or kamigakari (神懸り/神憑, lit. 'kami possession').Iwanami Kōjien (広辞苑) Japanese dictionary, 6th Edition (2008), DVD version == Related pages == * Worship of the Living == References == Category:Shinto Category:Pages with unreviewed translations",
 "title": "Hitogami"
}