{
 "id": "1006629",
 "text": "Sugōisobe-jinja (菅生石部神社) Shinto Shrine Haiden Country Japan Region Chūbu City Kaga, Ishikawa prefecture coordinates 36°18′47″N 136°19′15″Ö﻿ / ﻿36.3130°N 136.3208°Ö﻿ / 36.3130; 136.3208 Address 585 e.Kr. Website: http://www.tenjin.or.tv/ Sugōisobe-jinja (菅生石部神社) is a Shinto shrine in Kaga, Ishikawa Prefecture, on the Daishōji grounds. It was mentioned in the engishiki of 927 and held the shakaku rank of kokuhei shōsha, which is the national shrine of the 3rd rank. During the feudal era, it was of the second-highest rank in Kaga Province. Currently, the shrine is directly controlled by the Association of Shinto Shrines. Locally, it is referred to as \"Shikichi Tenjin\" or \"Sugō Tenjin.\" == Worshiped kami == The deity worshipped at Sugōisobe-jinja shrine is Sugōisobe no Kami. This name represents three deities, namely Hoori, Toyotama-hime no Mikoto, and Ugayafukiaezu no Mikoto. There are several theories about the true identity of the deity at Sugōisobe- jinja shrine. Some scholars suggest that the deity is actually Sukunabikona, rather than Sugōisobe no Kami. == History == According to legend, Sugōisobe no Kami was brought to the area from the imperial court in 585 when a serious illness spread throughout the region. The shrine was recorded in the engishiki jinmyōchō, a record of all shrines in Japan compiled in 927, as shōsha, and it held the second highest rank (ni no miya) in Kaga province. The shrine was highly respected by the imperial court and the samurai class, and in 940, the deity was elevated to shōshii no ge, an upper fourth rank, lower degree. The Heike monogatari, a Japanese epic of the 12th century, also mentioned that Minamoto no Yoshinaka donated to the shrine. During the Middle Ages, the entire area was incorporated into the territory of Kitano Tenmangū, and Sugōisobe-jinja came to be known as \"Tenjin\" due to the god worshipped there. A bull statue, associated with Tenjin, still stands as a reminder of that time. == Festivals == Every year on February 10th, the Gongan Shinji festival, also known as \"Takewari-matsuri,\" is held at Sugōisobe-jinja. In 1987, Ishikawa Prefecture designated the festival as an Intangible Cultural Heritage.. == The area == File:Sugoisobe-jinja,_honden-2.jpg|alt=本殿|main shrine File:Sugoisobe-jinja,_shaden.jpg|alt=拝殿|worship hall File:Sugoisobe- jinja,_kaguraden.jpg|alt=神楽殿|Kaguraden File:Sugoisobe- jinja,_shamusho.jpg|alt=社務所|shrine office File:Sugoisobe-jinja, shinmon from outside.jpg|alt=神門（加賀市指定文化財）|Shinmon Gate (Kaga City Designated Cultural Property) File:Sugoisobe-jinja, shinmon from inside.jpg|alt=神門（境内側）|Shrine gate (inside the precincts) File:Sugoisobe-jinja, keidaisha for Hakusan (1).jpg|alt=白山社|Hakusansha File:Sugoisobe-jinja, keidaisha for Inari.jpg|alt=敷地稲荷社|Site Inari Shrine == References == Category:Ishikawa Prefecture Category:Shinto shrines Category:Kokuhei Shōsha Category:Ninomiya",
 "title": "Sugōisobe Shrine"
}