{
 "id": "1006733",
 "text": "Adolf Blutsch (born 18 August 1940 in Vienna) is a former Austrian football player and coach. As a midfielder he won championships with FK Austria Wien and Linzer ASK. ==Career== He started his professional career with FK Austria Wien. From 1961 to 1962 he played in Australia for Hakoah Sydney. After a short time with Austria again he moved to LASK. He there was part of the team which won, as first team outside of Vienna, the Championship. This was followed by one-year engagements at the Wiener Sport-Club, Schwarz-Weiß Bregenz, FC Wacker Innsbruck and again in Bregenz. From 1969 to 1973 he played three seasons at SV Austria Salzburg. He then played again for a year at Bregenz before retiring after relegation in 1973/74 with FC Vorarlberg. He appeared in 252 games in Austria's top division and scored 18 goals. ==Manager== His coaching career has brought Adolf Blutsch to Salzburg several times. At SAK 1914 he worked as a supervisor in the 1976 autumn season. In his coaching era from 1977 to 1978, Blutsch led USK Anif directly from the Salzburg league to the second division. At SV Austria Salzburg he followed Hannes Winklbauer in 1986. Blutsch was also a coach at SW Bregenz, the second division team SV Rapid Lienz (ÖFB Cup semifinals 1976 as player coach), Linzer ASK, which he led to promotion to the first division in 1978/79, where he finished third in 1980, and Grazer AK. For the 1992/93 season he became the first western coach in Poland after the fall of the \"iron curtain\" David Forster: „Die Legionäre“: Österreichische Fußballer in aller Welt, LIT Verlag, Münster, 2011, S. 131–132. and led GKS Kattowitz to the 1993 cup victory. He also coached the Wiener Sportclub (12/1993 to 5/1995), Vorwärts Steyr (1996 to March 1998), SV Spittal (1999/2000), LASK Amateurs (2000-2004), BNZ Linz and came to FC Blau-Weiss Linz in spring 2005, where he stayed until the end of the 2006 autumn season in the Regionalliga Mitte. In April 2008, Blutsch was hired by SV Gmunden to save the club from the threat of relegation from the Regionalliga Mitte, but he failed to do so.OÖN ==Honours== **as player * Austrian Champion: 1963 (Austria Wien), 1965 (LASK) *Austrian Cup: 1960, 1963, 1965 (LASK) **as manager *Polish cup: 1993 ==References== ==Other websites== * Österreichisches Pressebüro :Adolf Blutsch Category:1940 births Category:Austrian footballers Category:Austrian football managers Category:LASK managers Category:FC Red Bull Salzburg managers Category:FC Red Bull Salzburg players Category:LASK players Category:Austrian football champions Category:Living people Category:Austrian football midfielders",
 "title": "Adolf Blutsch"
}