{
 "id": "1006399",
 "text": "A is a special kind of altar used in Shinto religion to remember and honor family members who have died. The altar usually has a mirror or tablet with the names of the deceased and is also used to honor people who are not related but are respected. Mitamaya altars are not as commonly found in Japanese households as their Buddhist counterpart, the butsudan, because Buddhist funeral rites are more commonly practiced in Japan. Mitamaya altars are considered less valuable than kamidana altars, which are highly respected in Japanese culture. == Ritual == The mitamaya altar is usually placed in an inner chamber on a shelf called \"mitama-san-no-tana,\" which is attached to the wall at a height of about six feet. It is positioned lower than the kamidana altar.. Rituals are performed for the mitamaya altar every tenth day up to the fiftieth day after the death of the family member. After that, rituals are performed on the one-hundredth day and on the one-year anniversary of the death. After the one-year ritual, another ritual is performed to mark the spirit's joining of the ancestors at the family shrine.. == History == In ancient times, people held domestic rites called kinensai in the February or April and Niinamesai in November. During these rites, people worshiped their ancestors, the god of food, and the hearth deity. They believed the spirits of their ancestors (Oyagami) came to them through the rice. During the Heian period cults of Goryō developed and people changed to honoring the dead in July for Urabon-e, and in January. During the medieval period, people started to enshrine the spirits of dead individuals, like Retired Emperor Gotoba (1180-1239) whose memory was kept through memorial tablets. In the early modern period, there was a rise in \"Shinto funerals\" (shinsōsai) where people were treated like kami. The Yoshida clan gave spirit ranks like Myōjin-gō, Reisha-gō, and Reijin-gō to the dead, who were sometimes worshipped at shrines. The spread of Kokugaku led to an increased interest in Miyamaya, and more people enshrined their ancestors in their homes. The first modern mitamaya was constructed in 1599 at the Toyokuni Shrine in Kyoto, Japan for Toyotomi Hideyoshi. Screen paintings and the remains of the shrine suggest that it was designed based on the Kitano Tenman-gū. Unfortunately, it was later destroyed by the Tokugawa clan. Later on, the mitamaya became a symbol of high status and was mainly established for Japanese nobles, military heroes, and other respected individuals. This practice became more widespread during the Edo period. As part of the Kokugaku movement, it became more common for ordinary households to erect mitamaya altars. These altars played a central role in Shinto funeral rituals known as \"shinsōsai\" (神葬祭). == References == == Other websites == * Kinensai explanation Category:Veneration of the dead Category:Goryō faith Category:Pages with unreviewed translations Category:Shinto religious objects",
 "title": "Mitamaya"
}