{
 "id": "1006624",
 "text": "Nunakuma Shrine is a Shinto shrine in Tomo, Fukuyama City, Hiroshima Prefecture. It is a Shikinaisha. Currently, it is a beppyo shrine under the Shinto shrine headquarters. The shrine is commonly referred to as 'Gion-san' together with 'Tomogi Ongu'. == Enshrined deities == Two deities are enshrined at the shrine.祭神の記載は由緒（公式サイト）。 ; Main enshrined deity :* Owatatsumi no Mikoto - The enshrined deity of the old Watarimori Shrine. ; Secondary enshrined deity :* Susano-no-mikoto - see Gion worship for more info == History == In the Meiji era, Watasu Shrine and Tomo Gion Shrine were combined and renamed as Numana Shrine according to the Engishiki Jinmyocho.『広島県の地名』沼名前神社項。 according to the Shrine Consolidation Policy. The shrine continues to enshrine two deities, Owatatsumi-no-Mikoto and Susanoo-no-Mikoto, who were originally enshrined separately by each shrine. In addition, Watarimori Shrine, listed in the Engishiki Jinmyocho, is located on the side of the shrine and is still in operation today.由緒（公式サイト）。 === Watarimori Shrine === Legend has it that Watarimori Shrine, now known as Numana Shrine, was established in the second year of Emperor Chuai's reign. Empress Jingu headed to western Japan and enshrined Watatsumi-no-mikoto on a local sacred stone, praying for safe sea routes. On her way back, she reportedly said to Watatsumi no Mikoto, \"Takatomo Izuno.\" The name \"Tomo\" is said to have originated from the fact that \"tomo\" was one of the tools used for bows. In the Engishiki Jinmyocho, a document from the middle of the Heian period, there is a description of a Shikinaisha called 'Numakuma-jinja Shrine' located in Numakuma District, Bingo Province. The book offers two possible readings of the name, \"Nunasaki\" and \"Nunakuma\". However, the location of this Shikinaisha remained unknown. Through historical research after the early modern period, it is currently identified as Watarimori-jinja Shrine, but it is unclear whether it is located in Tomo. In modern times, Watarimori Shrine is said to enshrine Sarutahiko-no-kami and Funatama-no-mikoto. The shrine was originally located in Gojihira Village or Tomonoseki-cho and was moved to its current location during the Keicho era (1596-1615) as a precinct shrine of Gion Shrine. In the Meireki era (1655-1658), the main shrine was rebuilt by the feudal lord Katsutada Mizuno.『日本の神々』では、渡守神社は鞆の西町にあったが、慶長4年（1599年）に焼失して後地村麻谷に遷座、のち貞享2年（1674年）に再建されるにあたって祇園社境内地に移転したと記載する。 === Tomo Gion Shrine === The shrine itself has no information about the establishment of Tomo Gion Shrine.由緒（公式サイト）。 It is said to have been founded during the Tencho era (824-834) or during the Hojo era (1156-1159). The deity enshrined at the Numana Shrine is Susanoo no Mikoto. The shrine was originally located in Tomonoseki-cho but was destroyed in a fire in 1599 and later relocated to its current location.『日本の神々』沼名前神社項。 Some believe that the Tomo Gion Palace may be associated with the \"Enokumanokuni Tsuyashiro\" mentioned in an excerpt from the \"Bingo Province Fudoki\". The shrine was worshipped as the local deity of Tomo and received many donations from the lord of the Fukuyama domain, with a shrine site in the area. === Both shrines after the early modern period === The history of the two companies since the early modern period is as follows.『日本の神々』沼名前神社項。 * In the Edo period, Tomo Gion Shrine was enshrined here, and Watarimori Shrine was built in the precincts of the shrine. * In 1868 , the name of Tomo Gion Shrine was changed to Susanari Shrine. * In 1871, this Susanari Shrine became a Shikinaisha, renamed 'Nunana Shrine', and was ranked as a Kokuheishosha under the modern shrine ranking system . * In May 1875, Watarimori Shrine was changed to Shikinaisha. * In July 1876, the spirit of Tomori-jinja Shrine was enshrined in the main hall, and the Gion deity was changed to Aiden (master-servant reversal). Funatama- no-mikoto, the enshrined deity of Tomori-sha Shrine, was changed to Owatatsumi-no-mikoto. == References == == Sources == * Shrine history book * Precincts explanation board * \"Place names in Hiroshima Prefecture, which are historical place names in Japan \" ( Heibonsha ), Fukuyama City, Numanei Shrine * \"Numana Shrine\" (Edited by Kenichi Tanikawa \"Japanese Gods - Shrines and Holy Lands - 2 Sanyo Shikoku\" ( Hakusuisha )) == Related books == * Edited and supervised by Motohiko Yasutsu and Yoshihiko Umeda, Shinto Dictionary, Jinja Shimposha, 1968, pp. 45-46 * Edited by Eiji Shirai and Masanori Toki, \"Jinja Dictionary\" Tokyodo Publishing, 1979, 267 pages == Other websites == * Category:Beppyo shrines Category:Gion shrines Category:Kokuhei Shōsha Category:Pages with unreviewed translations Category:Shinto shrines in Hiroshima Prefecture",
 "title": "Nunakuma Shrine"
}