{
 "id": "1006013",
 "text": "are creatures that look like lions and are often called lion-dogs in English. Pairs are found guarding shinto shrines. Sometimes they are at the entrance and other times they are inside the shrine. The first type is called which was made during the Edo period. This type is usually placed at the entrance. The second type is called which is much older and is placed inside the shrine. Komainu can also be found at Buddhist temples, nobility residences or even private homes. Kotera, pages 1 and 2 == Symbolic meaning == Komainu statues are made to keep away bad spirits. Usually one lion has an open mouth (a) and the other has a closed mouth (un). But this is not always true.Shogakukan Encyclopedia, Komainu Together, they are known as a-un.Iwanami Japanese dictionary, 6th Edition (2008), DVD version A-un is the Japanese pronounciation of aum and together they represent this Buddhist idea.JAANUS, A un, accessed on July 10, 2010 == History == Komainu statues strongly resemble Chinese guardian lions and were originally from the Tang dynasty in China.Encyclopedia of Shinto, Komainu Chinese guardian lions are thought to have been inspired by pelts of Asiatic lions and depictions of lions that were brought through trade from the Middle East or India. The lion was a symbol of strength in those countries.Shisa Travelogue, Culture of the lion around the world; roots of the shisa As the symbol traveled along the Silkroad, it changed and took on a unique appearance. The first lion statue in India was made around the 3rd century BC and was placed on top of a column by King Ashoka. Later, this tradition arrived in China where it developed into the guardian lion that was later exported to Korea, Japan, and Okinawa. In the Nara period (710–794), which was similar to the rest of Asia, the pair always had two lions.Kyoto National Museum Dictionary They were made mostly of wood and were used only indoors until the 14th century. During the Heian period (794–1185), pairs made of wood or metal were used as weights and door-stops. In the Imperial Palace, they were used to support screens or folding screens. In the early Heian period (ninth century), the tradition of the statue pairs changed, and they started to look different and have different names. One of the statues had an open mouth and was called shishi (獅子, which means 'lion') because it resembled a lion like before. The other statue had a closed mouth, looked more like a dog, and was called komainu or \"Goguryeo dog\". Sometimes, it even had a single horn on its head. Gradually, the animals returned to being identical except for their mouths and were called komainu.JAANUS, Komainu, accessed on July 16, 2010 Komainu have been used outdoors only since the 14th century, despite being ubiquitous at shrines now. In Asia, people believed that lions had the power to repel evil, and for this reason, they were commonly used to guard gates and doors. In Japan, they were installed at the entrance of shrines and temples next to the lion-dog.Shogakukan Encyclopedia, Shishi To protect against Japan's rainy weather, komainu started being carved in stone. The shīsā (シーサー) are stone animals that guard the gates or roofs of houses in Okinawa. They are close relatives of the shishi and the komainu, and they share the same origin, function, and symbolic meaning.Shisa Travelogue, The Chinese lion-Guardian dogs The name \"shīsā\" is a regional variant of \"shishi-san\" (獅子さん, lit. 'Mr. Lion') that has been used for centuries. == Foxes at Inari shrines == Foxes are the most common type of statue that guards Inari shrines in Japan. There are around 30,000 Inari shrines in Japan and each one has two fox statues guarding the entrance.Scheid, Inari Fuchswächter The fox statues often have a sūtra roll, key or jewel in their mouth. The fact that sūtras are Buddhist texts shows that the Inari cult has Buddhist origins.On the fusion of Shintō and Buddhism, see the article Shinbutsu shūgō The statues do not represent the foxes' bad behavior but rather their magical powers. Sometimes the fox statues are painted white, as white foxes are thought to be messengers of the kami. Kami is sometimes shown as a fox too. Even though it's uncommon to see, the left fox statue is believed to be male and the right one is believed to be female.Smyers (1999:229) The fox statues at Inari shrines sometimes wear red votive bibs. The bibs are similar to bibs worn by Jizo but the meaning is unknown. == Gallery == == Related pages == * Kitsune == Notes == == References == * * * * * * * * * Category:Pages with unreviewed translations Category:Shinto religious objects",
 "title": "Komainu"
}