{
 "id": "1006049",
 "text": "Syntheism is a New religious movement that seeks to provide atheists and pantheists with a sense of community and awe that is comparable to what is often found in traditional theistic religions... The Syntheist Movement sees itself as coming from the philosophers Baruch Spinoza and Alfred North Whitehead's process theology.Whitehead, A.N. (1926). Religion in the Making (New York: Fordham University Press, 1996).Whitehead, A.N. (1929). Process and Reality. An Essay in Cosmology. Gifford Lectures Delivered in the University of Edinburgh During the Session 1927–1928, Macmillan, New York, Cambridge University Press, Cambridge. Syntheism can be described as a response to the absence of atheistic and pantheistic belief systems in Western cultures, which are more prevalent in Eastern cultures. Many forms of Buddhism are all Eastern belief systems that embody these concepts. Epicureanism is an example of a Western philosophy that does incorporate some of these ideas, but overall they are not as widely represented in Western culture.. == Etymology == The term \"Syntheism\" was created from the Greek word \"syntheos\", which combines \"syn-\" meaning \"with\" or \"creating with\" and \"-theos\" meaning \"god\". This suggests that the correct way to understand the concept of God is that humans have created, are creating, or will create God. This is different from the traditional monotheistic view that God created the world and humanity. In addition to The Syntheist Movement, a syntheistic philosophy and approach to religion has also been promoted by American philosopher Ray Kurzweil in his concept of the Singularity that is yet to come. French philosopher Quentin Meillassoux also supports this approach and has proposed the idea that \"God is a concept far too important to leave to the religious\" in his book After Finitude.Meillassoux, Quentin (2006). Après la finitude. Essai sur la nécessité de la contingence, Paris, Seuil, coll. L'ordre philosophique (foreword by Alain Badiou). == Communities == There is a big international Facebook community for Syntheism, which has over 1,500 members.The Syntheist Movement [ca. 2012], in Facebook [The Syntheist Movement]. Retrieved 2015-01-01 from https://www.facebook.com/groups/109834425805191/. The website of Syntheism has a blog, information about holy festivals, and links to media and other resources. In Sweden, there is a community of over 700 members who have organized various local events...Synteisterna [ca. 2012], in Facebook [Synteisterna]. Retrieved 2015-01-01 from https://www.facebook.com/groups/341167132580625/. == Notable works == In October 2014, two Swedish philosophers, Alexander Bard and Jan Söderqvist, wrote a book called \"Syntheism - Creating God in the Internet Age\". It was the first book to use the term \"Syntheism\" in its title. In the book, Bard & Söderqvist quoted Stuart Kauffman, Sam Harris, Robert Corrington, and Simon Critchley. They also drew inspiration from various modern phenomena such as digitalisation, globalisation, participatory culture, psychedelic practices, quantum physics, and the science of cosmology to create a syntheist worldview... == Beliefs == Syntheism is a belief system that considers the traditional division between theism and atheism in theology as outdated and no longer relevant for fulfilling contemporary and future spiritual needs. In order to address these needs, Syntheism acknowledges that all metaphysical beliefs ultimately revolve around a man-made focal point or divinity. As a result, all religious beliefs - both existing and those that may emerge in the future - are created by humans. This includes philosophical systems like Individualism, which were developed by thinkers such as René Descartes and Immanuel Kant. Despite being created by humans, it is essential that these beliefs are compatible with and supportive of science, rather than in conflict with it. As such, these beliefs should be developed within a monist worldview, which holds that there is only one world, and everything within it can affect everything else. In a more poetic sense, French philosopher Georges Bataille describes his atheology as \"the art of non-knowledge.\" He advocates for a syntheistic religion without a core set of beliefs, instead emphasizing participatory festivals with utopian themes. Examples of such practices include Burning Man, which are viewed as syntheistic expressions. == Criticisms == Some scholars, including Dr. Stephen O'Leary, have expressed concerns about the lack of central leadership and core beliefs within Syntheism, which they believe may lead to its failure as a religion. Additionally, the idea has been criticized for its potential lack of mystery, which is a core element of many traditional religions.. == References == == Other websites == * Category:Pages with unreviewed translations Category:New religious movements",
 "title": "Syntheism"
}