{
 "id": "1006474",
 "text": "The ,Kenkyusha's New Japanese-English Dictionary, Kenkyusha Limited, also known as the Great Council of State, was the highest decision-making body in Japan's premodern Imperial government under the Ritsuryō legal system during and after the Nara period. It was briefly restored to power after the Meiji Restoration, but soon replaced with the Cabinet. The Daijō-kan was consolidated in the Taihō Code of 701-702, which codified the Ritsuryō system of government in Japan. The Asuka Kiyomihara Code of 689 also played a role in the development of the Daijō-kan as it marked the initial appearance of this central administrative body, composed of the three ministers: the Daijō-daijin (Chancellor), the Sadaijin (Minister of the Left), and the Udaijin(Minister of the Right).Hall, John Whitney et al.. (1993). The Cambridge History of Japan, p. 232. The Daijō-kan was responsible for all secular administrative affairs of the country and its subsidiary ministries, while the Department of Divinities, oversaw all matters related to Shintō ritual, clergy, and shrines. However, this structured organization gradually lost power over the course of the 10th and 11th centuries. The Fujiwara clan began to dominate the Daijō-kan as well as the post of Imperial regent. It became common for the regent to hold the post of chancellor or other office simultaneously.Mesheryakov, Alexander (2003). \"On the Quantity of Written Data Produced by the Ritsuryō State\" , Japan Review, 15:187–199. By the 12th century, the council was essentially powerless as a separate entity. However, the system was never formally dismantled. Over the course of centuries, the ritsuryō state produced more and more information which was carefully archived. But, with the passage of time in the Heian period, ritsuryō institutions evolved into a political and cultural system without feedback. During the reign of Emperor Kōmei, the aristocracy in Kyoto teamed up with influential provincial leaders to bring back the power and reputation of the Imperial center. But because of many important issues that needed immediate attention, little effort was made to restructure the Daijō-kan, the highest decision-making body of the Imperial government. == Related pages == * Engishiki * Imperial Household Agency * Taihō Code == References == == Other websites == * National Archives of Japan Drawings of the Dajokan Building (November, 1877) * National Archives of Japan – Illustration of the new Dajokan Building (1877) * National Archives of Japan – Drawings for construction of the new building housing the ministries of Home Affairs and Finance (1874) * National Archives of Japan – Request concerning family registration statistics (1869) Category:History of Japan",
 "title": "Daijō-kan"
}