{
 "id": "1006233",
 "text": "is an island country that existed in the past in Japan. It is mentioned in Chinese history books like the Wajinden. == Description in the Wajinden == The Wajinden said Tsukaikoku island did not have good farming land. But, Ōe Masafusa wrote there were places to grow crops. The island often gave soybeans as a gift. The records show the island had a lot of precious things. These included silver, lead, tin, pearls, gold, and lacquer. Pearls were especially important. But the pearls might not be real. They could be red paint made from a stuff called cinnabar. This stuff is found mixed with minerals in mountains... In old records from the Wei dynasty, it is written that the king of Wa gave about 11 kg of pearls to Queen Himiko. It is also known that people in Korea knew about the island. The island had more than 1000 homes, but no king. Only officials called the \"Higo\" and \"Hinokumari\" were written about. Officials from the \"Bando\" area only came to ports for a short time because it was easier for traveling. They wrote down the names and traits of the administrative areas. So, other areas like Motsu, Keiji, and Kashi might have had kings. But the names from the Yayoi period and the Engishiki records may not be the same.. == Location == Some history experts say that the old country called Tsukaikoku is the same as the island of Tsushima today. But others think it is in Shimane prefecture. === Shimane theory === The names of the shrines written in the Engishiki shrine records match the shrines in Shimane prefecture. This helps the idea of its location. In Shimane prefecture, there were four areas: Kashi, Keiji, Tamamochi, and Motsu. The island has four regions naturally split by mountains. You can see this on a map. You can tell where Kashi, Keiji, and Motsu are by their names today. But we don't know where Tamamochi is. The west coast area that's mostly empty is later called Sasu district. But this name isn't in old books. Scholars think the area might have changed its name from Tamamochi to Sasu long ago. == Related pages == * Yamatai == References == Category:History of Japan",
 "title": "Tsukaikoku"
}