{
 "id": "1006289",
 "text": "Bruce Harold Broughton (born March 8, 1945) is an American composer. He writes music for television, movie, and video games. Usually, his music is for an Orchestra. He has also written concert works. He has composed several soundtracks over his long career. One of the pieces he wrote is the 1994 version of the 20th Century Fox fanfare. Another thing he has done is conducting the Cinergi Pictures logo composed by Jerry Goldsmith. He has won ten Emmy Awards and has been nominated for the Academy Award for Best Original Score. Broughton is currently a lecturer in composition at UCLA. ==Film== Year Title Director Studio Notes 1983 The Prodigal James F. Collier Worldwide Entertainment 1984 The Ice Pirates Stewart Raffill Metro-Goldwyn-Mayer United Artists 1985 Silverado Lawrence Kasdan Columbia Pictures Nominated - Academy Award for Best Original Score Young Sherlock Holmes Barry Levinson Amblin Entertainment Paramount Pictures Won - Saturn Award for Best Music 1986 Sweet Liberty Alan Alda Universal Pictures The Boy Who Could Fly Nick Castle Lorimar Motion Pictures 20th Century Fox 1987 Square Dance Daniel Petrie Michael Nesmith Island Pictures NBC Productions Harry and the Hendersons William Dear Amblin Entertainment Universal Pictures The Monster Squad Fred Dekker HBO Pictures TriStar Pictures Nominated - Saturn Award for Best Music Big Shots Robert Mandel Lorimar Motion Pictures 20th Century Fox Cross My Heart Armyan Bernstein Universal Pictures 1988 The Presidio Peter Hyams Paramount Pictures The Rescue Ferdinand Fairfax Touchstone Pictures Moonwalker Jerry Kramer Will Vinton Jim Blashfield Colin Chilvers MJJ Productions Lorimar Motion Pictures Warner Bros. Underscore for the \"Speed Demon\" and \"Smooth Criminal\" segments Last Rites Donald P. Bellisario Metro-Goldwyn-Mayer 1989 Jacknife David Jones Kings Road Entertainment Cineplex Odeon Films 1990 Betsy's Wedding Alan Alda Touchstone Pictures Narrow Margin Peter Hyams Carolco Pictures TriStar Pictures (US) Universal Pictures (International) The Rescuers Down Under Hendel Butoy Mike Gabriel Walt Disney Pictures Walt Disney Feature Animation Broughton's first score for animated film 1991 All I Want for Christmas Robert Lieberman Paramount Pictures 1992 Honey, I Blew Up the Kid Randal Kleiser Walt Disney Pictures Stay Tuned Peter Hyams Morgan Creek Productions Warner Bros. 1993 Homeward Bound: The Incredible Journey Duwayne Dunham Walt Disney Pictures So I Married an Axe Murderer Thomas Schlamme TriStar Pictures For Love or Money Barry Sonnenfeld Imagine Entertainment Universal Pictures Tombstone George P. Cosmatos Cinergi Pictures Hollywood Pictures (US) Entertainment Film Distributors (UK) 1994 Holy Matrimony Leonard Nimoy Interscope Communications PolyGram Filmed Entertainment Hollywood Pictures Baby's Day Out Patrick Read Johnson 20th Century Fox Miracle on 34th Street Les Mayfield 1996 Carried Away Bruno Barreto CineTel Films Fine Line Features Homeward Bound II: Lost in San Francisco David R. Ellis Walt Disney Pictures House Arrest Harry Winer Rysher Entertainment Metro-Goldwyn-Mayer Infinity Matthew Broderick First Look Pictures 1997 Shadow Conspiracy George P. Cosmatos Cinergi Pictures Hollywood Pictures A Simple Wish Michael Ritchie The Bubble Factory Universal Pictures 1998 Krippendorf's Tribe Todd Holland Touchstone Pictures Lost in Space Stephen Hopkins Jim Henson's Creature Shop New Line Cinema One Tough Cop Bruno Barreto Stratosphere Entertainment 2004 Last Flight Out Jerry Jameson Worldwide Entertainment River Stone Productions Mickey, Donald, Goofy: The Three Musketeers Donovan Cook DisneyToon Studios Walt Disney Pictures Direct-to-video 2006 Bambi II Brian Pimental DisneyToon Studios Walt Disney Pictures Direct-to-video 2011 The Pledge J.W. Myers Phase 4 Films 2013 A Christmas Tree Miracle J.W. Myers Route 40 Films Flyover Films 2017 Shot Jeremy Kagan Paladin Category:American composers Category:Television composers Category:Video game composers Category:1945 births Category:Living people",
 "title": "Bruce Broughton"
}