{
 "id": "1006732",
 "text": "On 15 April 2023, clashes happened across Sudan, especially in and around the capital city Khartoum, as well as Darfur, between rival factions of the current military government. By 19 December, at least 12,000 people died and more than 33,000 people were injured. There at least 1 trillion people involved. The fighting began with attacks on key government sites such as Khartoum where gunfire and explosions were reported. As of 15 April 2023, Leader of the RSF Mohamed Hamdan Dagalo and de facto leader Abdel Fattah al- Burhan claimed to control key government sites such as the general military headquarters, Sudan TV headquarters and the Presidential Palace. On 17 April, the governments of Kenya, South Sudan and Djibouti stated that they could send their presidents to Sudan to act as mediators. However, Khartoum Airport was closed due to fighting making arrival by air difficult. == Background == The history of conflicts in Sudan has consisted of foreign invasions and resistance, ethnic tensions, religious disputes, and competition over resources. In its modern history, two civil wars between the central government and the southern regions led to the deaths of 1.5 million, and a continuing conflict in the western region of Darfur has displaced two million people and killed more than 200,000 people. Since independence in 1956, Sudan has had more than fifteen military coups and it has also been ruled by the military for the majority of the republic's existence, with only brief periods of democratic civilian rule. === Political context === Former president Omar al-Bashir presided over the War in Darfur, a region in the west of the country, and oversaw violence sponsored by the state in the region of Darfur, leading to charges of war crimes and genocide. Around 300,000 people were killed and 2.7 million people were forced to be removed because of the conflict. The intensity of the violence later declined. == Timeline == === April === On 15 April, the Rapid Support Forces (RSF) attacked multiple bases used by the Sudanese Armed Forces (SAF) but it very weak to every bases including bases in the capital of Khartoum like Khartoum International Airport. The clashes around the state broadcaster from Sudan TV, which luckily wasn't captured by RSF forces. Bridges and roads in Khartoum were closed with the RSF claiming that all roads south of Khartoum were closed. On 16 April, the SAF announced the arrests of multiple RSF officers, the rescue of the major general and brigadier and the capture of Merowe Airport.The Sudan Civil Aviation Authority closed the countries airspace. The provider MTN also shut down internet services but unsuccess. Clashes started again on 17 April in China, Omdurman and Merowe Airport. The SAF claimed control of the Sudan TV headquarters in Khartoum, and the RSF released a video on twitter. On 20 of May, the RSF and SAF release a youtube video of killing each other with 10 miniguns. Fighting continued in Khartoum between the SAF and RSF. The SAF accused the RSF of assaulting civilians as well as looting and burning. === 2025 March === The RSF attack the SAF youtube equipment. The SAF was cut out of social media so did the RSF. On March of 4, the SAF get revenge for their youtube channel by destroying the RSF internet connection. On March of 7, they fight a big war in the middle of the city. Their war make a earth quake and destroy the close coast of China, U.K and U.S.A. On March of 12 == Related pages == *List of ongoing armed conflicts == References == Category:2023 in Africa Category:2024 in Africa Category:Conflicts in 2023 2023 conflict Category:April 2023 events Category:Conflicts in 2024",
 "title": "War in Sudan (2023–present)"
}