{
 "id": "1006522",
 "text": "As Aventuras de Gui & Estopa (also known as Gui & Estopa) is a Brazilian Flash animated television series created by Mariana Caltabiano. It aired on Cartoon Network Brazil from 2009 to 2017. The second season aired on 2010. The third season aired on 13 November 2011. The series also aired in Latin America on 2 December 2013 by Tooncast and Boomerang. The fourth season aired on 7 September 2015 by Cartoon Network. In April 2021, the series returns to Boomerang with the fifth season premiere. == Characters == * Gui \"Iguinho\" () a young male West Highland White Terrier who is the protagonist of the series. * Estopa () a fat grey male dog who is Gui's best friend. * Cróquete Spaniel () a brown female English Cocker Spaniel who is Gui's girlfriend. * Pitiburro () a beige male Pit bull who is Gui's friend and rival. * Dona Iguilda () a female West Highland White Terrier who is Gui's mother. * Fifivelinha () a girl with a purple hair. * Ribaldo \"Riba\" () a grey mouse. * Róquete Spaniel () a French beige female Cocker Spaniel who is Cróquete's older cousin sister. * Professora Jararaca a green snake. * Pitibela a beige female Pit bull who is Pitiburro's girlfriend. * Pitbalinha a little beige male Pit bull who is Pitiburro's younger brother. * Jaiminho a male pig. * Nerdson a boy who is Gui's neighbour. * Irmãozão a big and strong beige male dog. He appears in the episode Irmãozinho. * Justin Bibelô a yellow male teenager bird. * Lívia a tan female dog. She appears in the episode Queridinha. * Birdy a red male bird. * Jack Pé D'Curry a French pink male dog. * Bisa an old beige female dog who is Gui's great grandmother. * Rafael Chacal a Spanish tennis player who is a parody of Rafael Nadal. He appears in the episode Cuecas Conforto. == References == == Other websites == * * * * * * Category:Fictional dogs Category:2009 television series debuts Category:2000s animated television series Category:Children's television series Category:Brazilian animated television series",
 "title": "As Aventuras de Gui & Estopa"
}