{
 "id": "1006818",
 "text": "Some examples of Shinto architecture Shinto architecture is the architecture of Japanese Shinto shrines. == History == In Japan, the practice of designating sacred areas started in the Yayoi period (500 BC - 300 AD) based on the fundamental beliefs of Shintoism. Land features like mountains, waterfalls, rocks, and islands were considered capable of drawing kami and hence were revered as yorishiro.. In the beginning, sacred locations were likely marked with only a fence surrounding the area and a torii gate, at the entrance. Afterwards, temporary structures resembling modern portable shrines were built to receive the deities at the holy site. As time passed, the temporary structures used to welcome the gods evolved into permanent structures that were dedicated solely to the gods. Ancient shrines were constructed in different styles such as dwellings (for example, Izumo Taisha) or storehouses (for example, Ise Grand Shrine). The ancient shrine buildings had gabled roofs, raised floors, plank walls, and were either thatched with reed or covered with hinoki cypress bark.. In the past, the early shrines didn't have an area for people to worship.. Three important forms of architecture styles exist: , , and . Izumo Taisha, Nishina Shinmei Shrine and Sumiyoshi Taisha have each type respectively and were built at or before 552. The tradition of Shikinen sengū-sai states that buildings or shrines are regularly rebuilt according to the original design. This has been done throughout the centuries to preserve ancient styles up to the present day..Presently only the Ise Grand Shrine is being rebuilt every 20 years. == Common features == The following is a diagram illustrating the most important elements of a Shinto shrine: # – Shinto gate # Stone stairs # – the approach to the shrine # Chozuya or Temizuya – fountain to cleanse one's hands and face # – decorative stone lanterns # – building dedicated to or the sacred dance # – the shrine's administrative office # Ema – wooden plaques bearing prayers or wishes # Setsumatsusha – small auxiliary shrines # – the so-called \"lion dogs\", guardians of the shrine # – oratory # – fence surrounding the # – main hall, enshrining the . # On the roof of the and are visible (forked roof finials) and (short horizontal logs), both common shrine ornamentations. == Gallery == File:Kashima-jinja_(Takasago,Hyogo)_torii1.JPG|A metal torii File:Hushimi-inari-taisha_omotesando.jpg|A sandō File:Yamatohime-no- miya_03.JPG|A temizuya File:ItsukushimaKomainu7374.jpg|A komainu File:IzumoTaisha_Honden_(detail).jpg|Izumo Taisha's honden File:Hanazono- jinja_haiden.jpeg|Hanazono Jinja's haiden File:Kasuga- taisha05n3200colortuned.jpg|Kasuga Taisha's heiden File:Shinra_Zenjin_Hall.jpg|Hirairi style: entrance on the non-gabled side File:Hiyoshi-taisha_nishihongu2.jpg|The typical shape of the back of a Hiyoshi-zukuri roof File:Hokora-DSC2202.jpg|A hokora File:Ootori_Zukuri.jpg|Ōtori-zukuri File:Ōtori-taisha, Principal Shrine 001.jpg|Ōtori Taisha's honden File:Katsuragi- jinja_(Gose,_Nara)_massha.jpg|Some setsumatsusha File:Ise_Shrine_Meizukuri.jpg|Shinmei-zukuri File:Sumiyoshi_shrine_Honden.jpg|Sumiyoshi-zukuri File:Izumo_Shrine_Honden.jpg|Taisha-zukuri, Izumo Taisha == Related pages == * List of Shinto shrines == Notes == == References == == Sources == * * * * * * Category:Shinto Category:Pages with unreviewed translations",
 "title": "Shinto architecture"
}