{
 "id": "100634",
 "text": "Albert Fert (born 7 March 1938) is a French physicist. He discovered giant magnetoresistance which was used to make gigabyte hard disks much easier to build. He is a professor at Université Paris-Sud in Orsay and scientific director of a laboratory called Unité mixte de recherche. The laboratory is part of the Centre national de la recherche scientifique (National Scientific Research Centre) and Thales Group. He was awarded the 2007 Nobel Prize in Physics together with the German physicist Peter Grünberg. ==Studies== Fert graduated in 1962 from the École Normale Supérieure in Paris. He received his master's degree in 1963 at the University of Paris, and earned his PhD in 1970 at the Université Paris-Sud. In 1988 Fert discovered Giant magnetoresistance (GMR) in iron and chromium which began spintronics; GMR was also discovered by Peter Grünberg from the Jülich Research Centre but Peter Grünberg did not work with Fert. Since 1988, Albert Fert has helped to improve spintronics. In 2004 he was elected to the French Academy of Sciences. In 2009 he was elected to the Academia Europaea. ==Awards== * American Physical Society International Prize for New Materials (1994) * Grand prix de physique Jean Ricard of the French Physical Society (1994) * International Union of Pure and Applied Physics Magnetism Award (1994) * Hewlett-Packard Europhysics Prize (1997) * Centre National de la Recherche Scientifique Gold Medal (2003) * Wolf Prize in Physics (2006) * Japan Prize (2007) * Nobel Prize in Physics (2007) ==References== * * == Works == * Fert, Albert. 2006. \"Summary of Symposium D on \"Magnetoelectronics\". Journal of Alloys and Compounds. 423, no. 1: 147. * Fert, Albert, and Shang-Fan Lee. 1996. \"Theory of the Bipolar Spin Switch\". Physical Review. B, Condensed Matter. 53, no. 10: 6554. * Fert, Albert, Jean-Luc Duvail, and Thierry Valet. 1995. \"Spin Relaxation Effects in the Perpendicular Magnetoresistance of Magnetic Multilayers\". Physical Review. B, Condensed Matter. 52, no. 9: 6513. * Fert, Albert, Jean-Marie George, Henri Jaffres, Richard Mattana, and Pierre Seneor. 2003. \"The New Era of Spintronics\". Europhysics News. 34, no. 6: 227. * Hueso, Luis E, Jose M Pruneda, Valeria Ferrari, Gavin Burnell, Jose P Valdes-Herrera, Benjamin D Simons, Peter B Littlewood, Emilio Artacho, Albert Fert, and Neil D Mathur. 2007. \"Transformation of Spin Information into Large Electrical Signals Using Carbon Nanotubes\". Nature. 445, no. 7126: 410. * Fert, Albert, Jean-Luc Duvail, Tierry Henri. 2006. \"Supersymmetric Spin Information is Contained in Large Spinning Carbon Nanotubes\". Europhysics Lett.. 80, no. 3: 117. * Levy, Peter M, and Albert Fert. 2006. \"Condensed Matter: Electronic Properties, Etc. - Spin Transfer in Magnetic Tunnel Junctions with Hot Electrons\". Physical Review Letters. 97, no. 9: 97205. ==References== ==Other websites== *webpage of Albert Fert's lab Category:1938 births Category:Living people Category:French academics Category:French Nobel Prize winners Category:French physicists Category:People from Aude Category:Wolf Prize winners Category:Members of Academia Europaea",
 "title": "Albert Fert"
}