{
 "id": "100627",
 "text": "The armistice treaty between the Allies, who fought Germany during World War I, and Germany was signed in a railway carriage in Compiègne Forest on 11 November 1918, and marked the end of the First World War on the Western Front. Marshal Ferdinand Foch, the Allied Commander-in-chief, and Matthias Erzberger, Germany's representative were the most important persons who signed it. The Armistice was agreed at 5 AM on 11 November, to come into effect at 11 AM Paris time. Acting German commander Paul von Hindenburg had requested arrangements for a meeting from Ferdinand Foch via telegram on 7 November. He was under pressure of imminent revolution in Berlin, Munich and elsewhere across Germany. This stopped the fighting, but it took much longer to get a complete settlement. The actual terms, largely written by Foch, included: * ending hostilities, the withdrawal of German forces to behind the Rhine, *Allied occupation of the Rhineland and bridgeheads further east, the surrender of aircraft, warships, and military materiel, *the release of Allied prisoners of war and interned civilians, *eventual reparations, no release of German prisoners and no relaxation of the naval blockade of Germany. Although the armistice ended the fighting on the Western Front, it had to be prolonged three times until the Treaty of Versailles. This took effect on 10 January 1920.Czernin, Ferdinand 1964. Versailles, 1919. New York: G.P. Putnam's Sons.Leonhard, Jörn 2014. Die Büchse der Pandora: Geschichte des Ersten Weltkriegs [Pandora's Box: History of the First World War] (in German). Beck. ISBN 978-3-406-66191-4 These terms were severe. The later abdication of the Kaiser, and the economic troubles of Germany in the 1920s, led towards the later rise of Adolf Hitler.Shirer, William Lawrence 1960. The rise and fall of the Third Reich: a history of Nazi Germany. Simon and Schuster. == Main people == For the Allies, the personnel involved were entirely military: * Marshal of France Ferdinand Foch, the Allied supreme commander * First Sea Lord Admiral Rosslyn Wemyss, the British representative * General Maxime Weygand, Foch's Chief of staff For Germany: * Matthias Erzberger, a civilian politician; * Count Alfred von Oberndorff, from the Foreign Ministry; * Major General Detlev von Winterfeldt, the army; * Captain Ernst Vanselow, the navy. General Weygand and General von Gruennel are not mentioned in the (French) document. The peace between the Allies and Germany that followed this armistice was the Treaty of Versailles in 1919. == References == ==Related pages== * Remembrance Day * Treaty of Versailles (1919) == Other websites == * La convention d'armistice du 11 novembre 1918 (in French) * The Armistice Demands, translated into English from German Government statement The World War I Document Archive, Brigham Young University Library, accessed July 27, 2006 Category:1918 in Europe Category:1910s in France Category:World War I Category:1910s in Germany",
 "title": "Armistice of 11 November 1918"
}