{
 "id": "1007104",
 "text": "Hōnensai Hōnensai at Tagata Shrine in Komaki Observed by Japan Type Religious Significance Celebrates the blessings of a bountiful harvest and all manner of prosperity and fertility Date 15 March Next time 15 March 2024 (2024-03-15) The Harvest Festival, known as Hōnensai in Japan, is a fertility festival that takes place annually on March 15th. The word \"Hōnen\" means \"prosperous year\" in Japanese, signifying a plentiful harvest, and \"matsuri\" refers to a festival or celebration. The Hōnen festival and ceremony are held to express gratitude for a bountiful harvest and to celebrate prosperity and fertility in various forms. The venerated Shinto deities in this context are Mitoshi (御歳神, Mitoshi-no-kami) and Tamahime (玉姫命, Tamahime-no-mikoto). Mitoshi is the son of Toshigami (年神) or locally known as Ōtoshi (大歳神, Ōtoshi-no-kami), a male Shinto deity, and the grandson of Susanoo, another Shinto deity. Tamahime is a princess and the daughter of Ō'arata (大荒田命, Ō'arata-no-Mikoto), the matriarch of the Owari clan (尾張氏), and her husband Take'inadane (健稲種命, Take'inadane-no-mikoto), who had two sons and four daughters. After her husband's death, she returned to his hometown Arata (situated close to Komaki) and, with the help of her father Ō'arata, encouraged cultivation and achieved his accomplishments in his honor. The most well-known of these festivals occurs in the town of Komaki, located just north of Nagoya City in Japan. The festival is characterized by Shinto priests playing musical instruments, a parade of participants dressed in ceremonial attire, free-flowing sake (Japanese rice wine) for all to enjoy, and a prominent wooden phallus as a symbol of fertility. The festival involves carrying a large wooden phallus called \"youbutsu\" or \"ō-owase-gata,\" which weighs 280 kg (620 pounds) and measures 2.5 meters (96 inches) in length. The phallus is made of Japanese cypress and is estimated to be 200-250 years old. It is carried from a shrine called Shinmei Sha in Komaki on a large hill during even-numbered years, or from Kumano-sha Shrine during odd-numbered years, to a shrine called Tagata Jinja in Komaki, Tagata, Aichi Prefecture. The festival begins with celebrations and preparations at 10:00 a.m. at Tagata Jinja, where various types of food and souvenirs, often in the shape of phallus or related themes, are sold. Free sake is also distributed from large wooden barrels. Around 2:00 p.m., everyone gathers at Shinmei Sha to start the procession. Shinto priests perform prayers and blessings for the participants, mikoshi (portable shrines), and the large wooden phallus, which will be carried along the parade route. As the procession reaches Tagata Jinja, the wooden phallus in its mikoshi is spun vigorously before being set down, and additional prayers are offered. Afterwards, everyone gathers in the square outside Tagata Jinja and eagerly awaits the mochi nage, a highlight of the festival. During the mochi nage, officials throw small rice cakes down from raised platforms, showering the crowd with these treats. The festival typically concludes around 4:30 p.m. == References == * Tagata Shrine Honen Festival 田縣神社 豊年祭 (contains photos showing many of the events described above) * Japan: Nothing says springtime like a penis festival (Global Post, March 16, 2010) == Other websites == * http://www.tagatajinja.com/index.html (Japanese; official homepage of Tagata-Jinja) * Yamasa Institute Tagata Jinja - Hounen Matsuri site (English) * http://farstrider.net/Japan/Festivals/HounenMatsuri/ * Phallus photos and bits of info Category:Shinto Category:Articles containing Japanese-language text Category:Pages with unreviewed translations",
 "title": "Hōnensai"
}