{
 "id": "1007346",
 "text": "Karl Skerlan (3 January 1940 – 7 February 2017) was an Austrian football player. He played for Austria between 1958 and 1964. He also played for club teams mainly Wiener Sport-Club and Admira Energie Wien. ==Career== Karl Skerlan came to the Wiener Sport-Club from the small Burgenland club ASV Kittsee in 1957. In this season he became champion. For two years(41 games in a row) he remained undefeated with his team and was able to win the championship in 1958/59. Karl Skerlan also achieved great success with the Dornbachers in the European Cup. The highlight was the legendary 7-0 victory over the Italian champions Juventus Turin, in which he also scored a goal. In 1961, Karl Skerlan decided to move to Admira Wien. The first title win at the new club was in the 1964 cup. In 1966 he was able to win the double with the club. At the end of his career, after a year at the German regional league club FK Pirmasens, Karl Skerlan went to SC Schwarz-Weiß Bregenz in the first and second leagues and was also a player-coach there. 1969/70 he reached the club cup semi-finals, where the team was only - after two draws against Linzer ASK - lost by drawing of lots against them. Website:«Fußball in Österreich», Jahr 1969/70 ==International== He played 14 matches for the Austrian national football team and scored 3 goals. His first appearance was on 19 November 1958 in a 2-2 against Germany. His last match was on 11 October 1964 in a 1-0 against Russia.ÖFB Profile Karl Skerlan == Team Management == Skerlan managed FC Vorarlberg between 1 December 1973 and 30 June 1975. This was the only management he performed during his career. ==Honours== * 2 × Quarterfinals European Cup: 1959, 1960 * 3 × Austrian Champion: 1958, 1959, 1966 * 2 × Austrian Cup: 1964, 1966 * UEFA Euro 1960: Quarterfinals * 14 matches and 3 goals for Austria 1958 to 1964 ==Other websites== * * ==References== Category:1940 births Category:2017 deaths Category:Austrian footballers Category:Players of the Austrian national football team Category:Austrian football managers Category:Association football forwards Category:Austrian football forwards Category:Austrian football champions",
 "title": "Karl Skerlan"
}