{
 "id": "1007111",
 "text": "Hiroshima Electric Railway Co., Ltd. Native name 広島電鉄株式会社 Romanized name Hiroshima Dentetsu kabushiki gaisha Type Public (Kabushiki gaisha) Traded as TYO: 9033 Industry Transportation (streetcar, bus), real estate Founded June 18, 1910 Headquarters 2-9-29 Higashisenda-machi, Naka-ku, Hiroshima 730-8610, Japan Owners * Hiroshima Hino Motors dealer (3.85%) * Hiroshima Bank (3.44%) * MUFG Bank (2.89%) * Penta-Ocean (2.49%) * Idemitsu Kosan (2.47%) Number of employees 1,377 Website www.hiroden.co.jp . is a company in Japan. It runs streetcars and buses in and around Hiroshima Prefecture, and is commonly referred to as \"Hiroden\" for short. The company has a diverse collection of trams from various parts of Japan and Europe, which has earned it the nickname \"The Moving Streetcar Museum\". From January 2008 the company has accepted PASPY, a smart card ticket system. This is the longest tram network in Japan, with . On 6 August 1945, Hiroshima was devastated by the atomic bombing during World War II. The bombing resulted in the deaths of 185 employees of the local tramway company and caused damage or destruction to 108 out of its 123 trams. However, within just three days, the tramway system resumed operations. Remarkably, three trams that survived or were rebuilt after the bombing are still in operation even 75 years later.. ==Gallery== Hiroden-5100-2.jpg|Green Mover Max Hiroden6566.jpg|Regular and vintage Hiroden streetcars Hiroden-A-Bombed- Tramcar-651-652-at-Genbaku-Dome-mae-Station-in-2006-08-06-A-Bomb-memorial- day.jpg|Hiroden cars 651 and 652, which survived the atomic bomb 車両紹介 - 単車 (Cars: Single cars) of the Hiroshima Electric Railway official website. Retrieved on February 15, 2008. and were still running in Hiroshima as of 2015 Hiroshima_A-Bomb_Tram_651.jpg|Damaged and derailed Hiroden 651 on August 9, 1945 HirodenBus.jpg|Hiroden bus == References == == Other websites == * Hiroshima Electric Railway * Streetcars in the Hiroden system Category:Companies listed on the Tokyo Stock Exchange Category:Articles containing video clips Category:Pages with unreviewed translations",
 "title": "Hiroshima Electric Railway"
}