{
 "id": "1007876",
 "text": "A1 Telekom Austria Group is a provider of fixed-line, broadband Internet, multimedia services, data, and IT systems, wholesale as well as mobile payment services. It is a subsidiary of Mexican telecommunications conglomerate América Móvil since 2014. Its headquarters are in Vienna.Address Headquarter The company operates subsidiaries in seven European countries: Austria, Belarus, Bulgaria, Croatia, North Macedonia, Serbia, and Slovenia. Its largest subsidiary is the Austrian telecommunications provider A1 Telekom Austria.Ownership structure - Telekom Austria. Retrieved 2 July 2013. ==History== The state-owned PTT agency K.K Post- und Telegraphenverwaltung (PTV), was formed in 1887. All telephone and mail services in Austria-Hungary were taken over by the state. After World War I, the Austrian portion of the company became Post- und Telegraphenverwaltung. In 1996 under the Post Restructuring Act, PTV was restructured as a public corporation, Post-und Telekom Austria AG (PTA AG). Two years later, the telecommunications sector was fully deregulated. PTA was split, with the telecom side becoming Telekom Austria. The company was fully privatised in 2000 and was listed on the Vienna Stock Exchange and the New York Stock Exchange (it delisted from New York in 2007). In June 2000, the company invested about 15 million euros to rebrand itself as Jet2Web. Jet2Web did not ucceed in the market, because it was perceived as unreliable. The use of the name was discontinued in 2002.The company name Telekom Austria was revived as the brand name with a new logo. In June 2006, the company was split into the holding company Telekom Austria Group, with the public switched telephone network becoming Telekom Austria FixNet AG, which was later renamed Telekom Austria TA AG. Telekom Austria FixNet AG became a sister company of affiliate Mobilkom Austria AG. They merged in 2010 to form A1 Telekom Austria. Foreign subsidiaries of Mobilkom Austria were transferred to the holding company, so that A1 Telekom Austria would only deal with the Austrian market. In 2011, misdemeanours by company directors between 2004 and 2006 became public. The scandal was known as the Telekom-Affäre. At the end of 2016, Telekom Austria Group had 18,203 employees and generated about €4.2 billion in revenues. In 2020, all shares of Telecom Liechtenstein were sold to the Principality. ==Stakeholders== On 23 April 2014 Carlos Slim, owner of America Movil, took control of Telekom Austria. He formed a syndicate agreement between ÖIAG and America Movil, spending $2 billion to buy out minority shareholders and investing up to 1 billion euros ($1.38 billion) into the company. America Movil sees Telekom Austria as a \"platform for expansion into Central and Eastern Europe\". Labour representatives boycotted the decision on the syndicate agreement at the ÖIAG supervisory board meeting for 12 hours because of the lack of explicit job guarantees. ==Subsidiaries== A1 Telekom Austria Group operates the following subsidiaries: * A1 Telekom Austria * A1 Belarus * A1 Bulgaria * A1 Hrvatska * A1 Macedonija * A1 Srbija * A1 Slovenija == Controversy == A1 Telekom reduced mobile Internet bandwidth in Minsk during 2020 Belarusian protests at the request of Belarusian officials. ==References== ==Other websites== * *Vienna Stock Exchange: Telekom Austria AG Category:1998 establishments in Europe Category:1990s establishments in Austria Category:Vienna Category:Companies of Austria Category:Telecommunications",
 "title": "A1 Telekom Austria Group"
}