{
 "id": "1007257",
 "text": "Gosha-Suwa-jinja, is a Shinto shrine located in Hamamatsu, Shizuoka Prefecture, Japan. It is in Naka Ward, which is in the central part of Hamamatsu City.(ja) Institut d'études géographiques du Japon, « GSI Maps », sur www.gsi.go.jp (consulté le 29 novembre 2016). It is located about 6.5 kilometers away from the right bank of the Tenryū River, in a straight line. The shrine is also near the railway station, approximately 1 kilometer away, and the city's castle, which is about 500 meters to the north. == Description == The Gosha-Suwa religious complex consists of typical architectural elements commonly found in Shintō shrines, including an entrance gate called torii, a building for worship called haiden which is guarded by a traditional pair of creatures, a main building known as honden, an ablution pavilion called temizuya, a temple office referred to as shamusho, and supports for hanging votive plaques. The main axis of the shrine's enclosure is an alley that runs from the entrance torii to the haiden, oriented east-west parallel to the Enshū Sea and perpendicular to the ancient Tōkai road that leads north to the castle entrance in Hamamatsu. The shrine is distinguished by the presence of two hokora, one dedicated to ancestor worship and the other honoring Inari. Additionally, there is a shed used for storing mikoshi, which are portable shrines used during religious processions.. Gosha-Suwa Shrine is affiliated with Kasuga-taisha in Nara City, Nara Prefecture, and Suwa Grand Shrine near Lake Suwa, Nagano Prefecture. It venerates Shinto deities such as Takemikazuchi, the \"thunder god\", Ama-no-Koyane-no-mikoto, Futsunushi, Suwa Myojin, and Kotoshironushi, who are considered as the sons of Ōkuninushi. Devotees visit the shrine to convey their wishes for various blessings, such as prosperity, happiness, finding a soul mate, successful fishing, abundant harvests, or safe childbirth.. == History == === Gosha Shrine === In the early 16th century, the leader of the Imagawa clan built a castle called Hikuma Castle in the province of Tōtōmi, which also had a shrine within its enclosure. Later in the same century, Tokugawa Ieyasu, who would become the ruler of unified Japan, seized the castle, expanded it, and renamed it Hamamatsu Castle. In 1579, after the birth of his son Tokugawa Hidetada, he converted the shrine into a place of worship for the Shintō deity Futsunushi. The following year, he had the holy place rebuilt outside the castle's enclosure. In 1914, the Gosha sanctuary was classified as a national treasure. However, on June 18, 1945, an air raid by the American army destroyed all the buildings.. === Suwa Shrine === In 761, Sakanoue no Tamuramaro, a general in the service of Emperor Kammu, had a Shintō shrine built in Tōtōmi province. This shrine was later moved in 1556 to the foot of Hikuma Castle, and then in the 1580s it came under the control of the Tokugawa dynasty. In 1641, the sanctuary was rebuilt stone by stone near the Gosha-jinja. In 1938, the Suwa sanctuary was classified as a national treasure. However, on June 18, 1945, during an aerial bombardment, several buildings of the religious complex were reduced to ashes. === Gosha-Suwa Shrine === In 1962, in the city of Hamamatsu, two Shintō shrines, Gosha-jinja and Suwa-jinja, merged to form the religious complex Gosha-Suwa. The construction of Gosha-Suwa was completed in 1982, including the opening of its honden (main hall) to the faithful. During World War II, the shrines of Gosha-jinja and Suwa-jinja were heavily damaged by bombings, resulting in the loss of their national treasure status. Unfortunately, the damage could not be repaired. == Events == On November 15th, during the traditional annual festival called shichi-go-san, parents come to Gosha-Suwa Shrine as a family to pray for the good health of their children. The shrine's enclosure is crowded with families who participate in this festival.. == Related pages == * Hamamatsu * Hamamatsu-juku * Hamamatsu Castle == References == * == Other websites == * Category:Ken-sha Category:Pages with unreviewed translations Category:Shizuoka Prefecture *[(ja)]: Langue : japonais",
 "title": "Gosha Suwa Shrine"
}