{
 "id": "1007056",
 "text": "Yeson Entertainment (alternatively spelled Yaeson) is a Seoul-based South Korean animation studio founded in 1993. ==Shows and Movies worked on by Yeson Entertainment== * _The Adventures of Rocky and Bullwinkle_ (2018) * _Allen Gregory_ * _The Amazing Spiez!_ * _The Awesomes_ (\"No Mo' Sumo\" only; the other episodes were done in-house) * _Angel's Friends_ * _Baby Looney Tunes_ * _Baby Looney Tunes: An Eggs-traordinary Adventure_ (with Yearim Productions, opening titles by Wang Film Productions) * _The Batman_ (15 episodes) * Blazing Dragons: The Movie (Animation production; with Hanho Heung-Up Co., Ltd., Studios Animage, Le Studio Ellipse, Pixibox Studios, Mercury Filmworks, Animation Services Hong Kong Ltd., Jade Animation International Limited, Funbag Animation Studios, Elliott Animation, Bardel Entertainment, Studio B Productions, Atomic Cartoons, Philippine Animation Studio Inc., and Nick Digital) * _The Big Knights_ * _The Big Knights Movie_ * _Bob's Burgers_ (starting in season 2) * _Brickleberry_ (two episodes: \"Ranger Games\", \"Scared Straight\") * _Caillou_ (Seasons two and three) * _Cartoon Cartoon_ short: \"Major Flake\" * _ChalkZone_ (Season four only with Wang Film Productions and Toonzone Entertainment, while Rough Draft Studios, Korea in Season one) * _Class of 3000_ (11 episodes) * _Clifford's Puppy Days_ (season 1 with Sunwoo Entertainment; season 2 solo) * _Code Lyoko_ * _The Daltons_ * _Dead End: Paranormal Park_ * _Di-Gata Defenders_ * _Dilbert_ (11 episodes) (Rough Draft Studios and AKOM did other episodes) * _Doug_ * _Duck Dodgers_ (14 episodes) ; Wang Film Productions, Big Star and Yearim Productions worked on others. * _Ed, Edd n Eddy_ * _The Fairly OddParents!_ (seasons 1-10a) * _Family Guy_ (seasons 2-6) (30 episodes) * _Fat Albert_ (Animation cleanup services) * _The Goode Family_ (8 episodes) * _The Great North_ (season 3, episode 10) * _Beavis and Butt-Head_ (seasons 13-14) (33 episodes) * _Harvey Beaks_ * _Harvey Girls Forever!_ (with Digital eMation, Wang Film Productions, AKOM, Yearim and Starburst Animation) * _Horseland_ (2006) (10 episodes) *Rusty Rivets (1994) (Universal Pictures & Amblimation) * _Huntik: Secrets and Seekers_ * _Jumanji_ (15 episodes) * _Kappa Mikey_ * _King of the Hill_ (starting in the third season) (100 episodes) * The Lizzie McGuire Movie (The Fairly OddParents character animation, with Sunwoo Entertainment for Invader Zim character animation and Rough Draft Korea Co., Ltd. for The Powerpuff Girls character animation, Tapehouse Toons for the Animated Lizzie character sequences, C.O.R.E. Toons, Nick Digital, Pixel Magic and Rainmaker Entertainment Group) * Lizzie McGuire: Timmy Turner, Cosmo and Wanda's First Day of HillRidge Junior High School: The Movie (The Fairly OddParents character animation, with Sunwoo Entertainment for Invader Zim character animation and Rough Draft Korea Co., Ltd. for The Powerpuff Girls character animation, Tapehouse Toons for the Animated Lizzie character sequences, C.O.R.E. Toons, and CGI animation and visual effects by Nick Digital) * The Loud House: The Louds' First Movie (with Jam Filled Entertainment, Digital eMation, Snipple Animation Studios, Mercury Filmworks, Bardel Entertainment and Nick Digital) * The Loud House Movie (with Jam Filled Entertainment, Digital eMation, Snipple Animation, Mercury Filmworks, Bardel Entertainment, Yowza! Animation, Mighty Animation, Digitoonz Media & Entertainment, Screen Novelities, Stoopid Buddy Stoodios and Nick Digital) * _Matt's Monsters_ * _Maya & Miguel_ (alternating with Starburst Animation) * _The Mighty B!_ (22 shorts) * _Monster Allergy_ * _MP4orce_ * _Oh Yeah! Cartoons_ (among other companies) * _Oggy and the Cockroaches_ * _Pig Goat Banana Cricket_ (21 episodes) * _Random! Cartoons_ * _Rick and Morty_ * _The Ren & Stimpy Show_ (seasons 4 and 5) (Ink and paint) * _Sammy_ (alternating with Rough Draft Studios) * _Scooby-Doo and Guess Who?_ * _Spike Team_ * _Staines Down Drains_ * _Teen Titans_ (season 2) * _T.U.F.F. Puppy_ * _The Wacky World of Tex Avery_ (1997) * _Wheel Squad_ * _Wishfart_ * _Winx Club_ (26 episodes) * _Winston Steinburger and Sir Dudley Ding Dong_ (Animation production; with Hanho Heung- Up Co., Ltd., Studios Animage, Le Studio Ellipse, Pixibox Studios, Mercury Filmworks, Animation Services Hong Kong Ltd., Jade Animation International Limited, Top Draw Animation, Elliott Animation, Bardel Entertainment, Atomic Cartoons, Philippine Animation Studio Inc., and Wang Film Productions) * _Zig & Sharko_ Category:1992 establishments in Asia Category:South Korean animation studios Category:1990s establishments in South Korea",
 "title": "Yeson Entertainment"
}