{
 "id": "1007923",
 "text": "The Astrakhan Tatars (Tatar: Əsterxan tatarları, Әsterhan tatarlary) are a Muslim Tatars population of about 80,000 people in the Astrakhan Oblast, Russia. They are descended from the nomadic Kypchaks, Volga Bulgarians and Khazars. After the breakup of the Golden Horde, they founded the Khanate of Astrakhan (1459-1556) on the Lower Volga. The related Nogai also lived here, by whom they were strongly influenced. The Volga Bulgarians also had trading settlements in the area, and the so-called Agryzjan Tatars, were the Muslim descendants of 51 Indian Hindu traders from India, who settled in Astrakhan in 1649 and married local Muslim Astrakhan Tatar women. The families lived in the Agryzjan suburb in Astrakhan and the descendants were named after this suburb. Since the 17th century there was an increasing influence of the also Muslim Volga Tatars, who lived in the middle course of the river. During the Soviet period, the Astrakhan Tatars were counted among the Volga Tatars. In the 2010 census, most simply listed themselves as \"Tatars\". A large number of Volga Tatars also live in the oblast, and the differences between them are gradually disappearing. Astrakhan Tatar is a mixed dialect. Around 43,000 speakers have assimilated to the much more widely spoken Kazan Tatar language. == Sources == * DM Iskhakov Astrakhan Tatars, ethnic settlement and population dynamics in the XVIII - beginning of XX century. / / Astrakhan Tatars. - Kazan, 1992. - S. 5-33. * The Tartars. The people of Russia. Encyclopedia. - M., 1994. - S. 320–321. == References == *First site Astrakhan Tatars * *https://theprint.in/opinion/security-code/forgotten-story-of-great-hindu- merchants-in-central-asia-shows-enterprise-can-defeat-china/1132477/ *https://brill.com/display/book/9789047401209/B9789047401209_s009.xml * *https://www.rbth.com/blogs/2014/09/12/early_traces_of_indian_life_in_russia_38261 *http://www.punjabmonitor.com/2013/04/punjabi-colony-in-astrakhan-russia.html",
 "title": "Astrakhan Tatars"
}