{
 "id": "1007158",
 "text": "In astronomy, an equinox is either of two places on the celestial sphere at which the ecliptic divides the celestial equator. Although there are two such intersections, the equinox connected with the Sun's ascending node is used as the ordinary origin of celestial coordinate systems and referred to simply as \"the equinox\". In contrast to the common usage of spring/vernal and Autumn/autumnal equinoxes, the celestial coordinate system equinox is a direction in space rather than a moment in time. In a cycle of about 25,800 years, the equinox moves westward with respect to the celestial sphere because of perturbing forces; therefore, in order to define a coordinate system, it is necessary to specify the date for which the equinox is chosen. This date should not be confused with the epoch. Astronomical objects show real movements such as orbital and proper motions, and the epoch defines the date for which the position of an object applies. Therefore, a complete detailed description of the coordinates for an astronomical object needs both the date of the equinox and of the epoch. The now used standard equinox and epoch is J2000.0, which is January 1, 2000 at 12:00 TT. The prefix \"J\" shows that it is a Julian epoch. The previous standard equinox and epoch was B1950.0, with the prefix \"B\" showing that it was a Besselian epoch. Before 1984 Besselian equinoxes and epochs were used. Since that time Julian equinoxes and epochs have been used. == Movement of the equinox == The equinox moves, in the sense that as time goes forward it is in a different location with respect to the distant stars. As a result, star catalogs over the years, even over the course of a few decades, will list different ephemerides. This is due to precession and nutation, both of which can be modeled, as well as other minor perturbing (disturbing) forces which can only be decided by observation and are this way tabulated in astronomical almanacs. === Precession === Precession of the equinox was first noted by Hipparchus in 129 BC, when noting the location of Spica with respect to the equinox and comparing it to the location followed by Timocharis in 273 BC. It is a long term movement with a period of 25,800 years. === Nutation === Nutation is the oscillation of the ecliptic plane. It was first followed by James Bradley as a difference in the declination of stars. Bradley published this discovery in 1748. Because he did not have a correct enough clock, Bradley was unaware of the effect of nutation on the movement of the equinox along the celestial equator, although that is in the present day the more significant aspect of nutation. The period of oscillation of the nutation is 18.6 years. ==Equinoxes and epochs== ===Besselian equinoxes and epochs=== A Besselian epoch, named after German mathematician and astronomer Friedrich Bessel (1784–1846), is an epoch that is based on a Besselian year of 365.242198781 days, which is a tropical year measured at the point where the Sun's longitude is exactly 280°. Since 1984, Besselian equinoxes and epochs have been superseded by Julian equinoxes and epochs. The current standard equinox and epoch is J2000.0, which is a Julian epoch. Besselian epochs are calculated according to: :B = 1900.0 + (Julian date − 2415020.31352) / 365.242198781 The previous standard equinox and epoch were B1950.0, a Besselian epoch. Since the right ascension and declination of stars are constantly changing due to precession, astronomers always specify these with reference to a particular equinox. Historically used Besselian equinoxes include B1875.0, B1900.0, B1925.0 and B1950.0. The official constellation borders were defined in 1930 using B1875.0. ===Julian equinoxes and epochs=== A Julian epoch is an epoch that is based on Julian years of exactly 365.25 days. Since 1984, Julian epochs are used in preference to the earlier Besselian epochs. Julian epochs are calculated according to: :J = 2000.0 + (Julian date − 2451545.0)/365.25 The standard equinox and epoch now in use are J2000.0, which is equal to January 1, 2000 12:00 Terrestrial Time (TT). ====J2000.0==== The J2000.0 epoch is exactly Julian date 2451545.0 TT (Terrestrial Time), or January 1, 2000, noon TT. This is equal to January 1, 2000, 11:59:27.816 TAI or January 1, 2000, 11:58:55.816 UTC. Since the right ascension and declination of stars are constantly changing due to precession, (and, for relatively nearby stars due to proper motion), astronomers always specify these with reference to a particular epoch. The earlier epoch that was in standard use was the B1950.0 epoch. When the mean equator and equinox of J2000 are used to define a celestial reference frame, that frame may also be represented J2000 coordinates or simply J2000. This is different from the International Celestial Reference System (ICRS): the mean equator and equinox at J2000.0 are seperate from and of lower (high) quality than ICRS, but agree with ICRS to the limited (high) quality of the first thing mentioned. Use of the \"mean\" locations means that nutation is averaged out or left out. This means that the Earth's rotational North pole does not point quite at the J2000 celestial pole at the epoch J2000.0; the true pole of epoch nutates away from the mean one. The same differences relate to the equinox. The \"J\" in the prefix shows that it is a Julian equinox or epoch rather than a Besselian equinox or epoch. === Equinox of Date === There is a special meaning of the expression \"equinox (and ecliptic/equator) of date\". This reference frame is defined by the positions of the ecliptic and the celestial equator as of the date/epoch on which the position of something else (usually a solar system object) is being specified. === Other equinoxes and their corresponding epochs === Other equinoxes and epochs that have been used include: * The Bonner Durchmusterung started by Friedrich Wilhelm August Argelander uses B1855.0 * The Henry Draper Catalog uses B1900.0 * Constellation borders were defined in 1930 along lines of right ascension and declination for the B1875.0 epoch. * Every once in a while, non-standard equinoxes have been used, such as B1925.0 and B1970.0 * The Hipparcos Catalog uses the International Celestial Reference System (ICRS) coordinate system (which is almost completely equinox J2000.0) but uses an epoch of J1991.25. For objects with a significant proper motion, assuming that the epoch is J2000.0 leads to a large position error. Assuming that the equinox is J1991.25 leads to a large error for nearly all objects. Epochs and equinoxes for orbital elements are usually given in Terrestrial Time, in many different formats, including: * Gregorian date with 24-hour time: 2000 January 1, 12:00 TT * Gregorian date with fractional day: 2000 January 1.5 TT * Julian day with fractional day: JDT 2451545.0 * NASA/NORAD's Two-line elements format with fractional day: 00001.50000000 ==Sidereal time and the equation of the equinoxes== Sidereal time is the hour angle of the equinox. However, there are two types: if the mean equinox is used (that which only includes precession), it is called mean sidereal time; if the true equinox is used (the actual location of the equinox at a given instant), it is called apparent sidereal time. The difference between these two is known as the equation of the equinoxes, and is counted in the Astronomical Almanac. A related idea is known as the equation of the origins, which is the arc length between the Celestial Intermediate Origin and the equinox. Or, the equation of the origins is the difference between the Earth Rotation Angle and the apparent sidereal time at Greenwich. ==Reducing role of the equinox in astronomy== In modern astronomy the ecliptic and the equinox are reducing in importance as needed, or even convenient, reference ideas. (The equinox remains important in ordinary civil use, in defining the seasons, however.) This is for many reasons. One important reason is that it is very hard to be exact what the ecliptic is, and there is even some confusion in the books about it. Should it be centered on the Earth's center of mass, or on the Earth-Moon barycenter? Also with the introduction of the International Celestial Reference Frame, all objects near and far are put basically in relationship to a large frame based on very distant fixed radio sources, and the choice of the origin is random and defined for the convenience of the problem at hand. There are no significant problems in astronomy where the ecliptic and the equinox need to be defined. == References == Category:Astronomy",
 "title": "Equinox (celestial coordinates)"
}