{
 "id": "1007878",
 "text": "The Minister of Home Affairs (or simply, the Home Minister; ) is the head of the Ministry of Home Affairs of the Government of Nepal. One of the senior- most officers in the Federal Cabinet, the chief responsibility of the Home Minister is the maintenance of Nepal's internal security; the country's large police force comes under its jurisdiction. Occasionally, they are assisted by the Minister of State of Home Affairs and the lower-ranked Deputy Minister of Home Affairs. == List of Ministers of Home Affairs == This is a list of former Ministers of Home Affairs since Nepal was declared Federal Democratic Republic of Nepal: Name Party Assumed office Left office Tenure in days 1 Bam Dev Gautam Communist Party of Nepal (Unified Marxist–Leninist) 18 August 2008 25 May 2009 2 Bhim Bahadur Rawal Communist Party of Nepal (Unified Marxist–Leninist) 23 May 2009 6 February 2011 3 Krishna Bahadur Mahara Communist Party of Nepal (Maoist Centre) 6 February 2011 29 August 2011 4 Bijay Kumar Gachhadar Madhesi Jana Adhikar Forum (Loktantrik) 4 September 2011 14 March 2013 5 Madhav Ghimire Chief secretary (Independent) 14 March 2013 11 February 2014 6 Bam Dev Gautam Communist Party of Nepal (Unified Marxist–Leninist) 25 February 2014 12 October 2015 7 Shakti Bahadur Basnet Communist Party of Nepal (Maoist Centre) 19 October 2015 4 August 2016 8 Bimalendra Nidhi Nepali Congress 4 August 2016 7 June 2017 9 Janardhan Sharma Communist Party of Nepal (Maoist Centre) 7 June 2017 17 October 2017 10 Prime Minister Sher Bahadur Deuba Nepali Congress 17 October 2017 15 February 2018 11 Ram Bahadur Thapa Communist Party of Nepal (Maoist Centre) until 17 May 2018 Nepal Communist Party from 17 May 2018 26 February 2018 20 May 2021 12 Khagaraj Adhikari CPN(UML) 10 June 2021 22 June 2021 13 Bishnu Prasad Paudel CPN(UML) 24 June 2021 13 July 2021 14 Bal Krishna Khand Nepali Congress 13 July 2021 26 December 2022 15 Rabi Lamichhane Rastriya Swatantra Party 26 December 2022 27 January 2023 16 Prime Minister Pushpa Kamal Dahal Communist Party of Nepal (Maoist Centre) 27 January 2023 31 March 2023 17 Narayan Kaji Shrestha Communist Party of Nepal (Maoist Centre) 31 March 2023 Incumbent == Reference == ==Other websites== * Official Website of Ministry of Home Affairs Home Affairs",
 "title": "Minister of Home Affairs (Nepal)"
}