{
 "id": "1007451",
 "text": "Leopold Grausam (29 June 1943 – 8 September 2023) was an Austrian retired footballer. He played mainly for SK Rapid Wien as striker. He also played for the Austrian national football team. ==Career== His first club was FC Hellas Kagran, where he played from 1953 to 1956. He then moved to SV Pressbaum and finally came in 1958 in the youth department of SK Rapid Wien. Leopold Grausam made his debut in the A-League against Kapfenberg SV on10 November 1963. He scored four goals in the 5-0 home win. Already in his first season in 1963–64 he was Austrian champion and also in 1966/67 and 1967/68. He won the ÖFB Cup in 1968 and 1969. In 1970 he moved to FC Wacker Innsbruck for a season and won his fourth championship title. Internationally, he made a name for himself when he scored the winning goal in the 1-0 win over Real Madrid in the European Cup Winners' Cup. After another season at Linzer ASK, Leopold Grausam ended his career in the Swiss National League A with FC Grenchen and in the Austrian Regional League East with SV Rechnitz. ==International== He made his debut FOR the Austrian national team under Béla Guttmann on 12 April 1964 against the Netherlands. His last match was on 5 November 1967 in a 1-1 draw against Greece. He played 8 matches and scored 3 goals. ÖFB Profile Leopold Grausam ==Manager== He managed SV Gablitz, Floridsdorfer AC, ASK-BSC Bruck/Leitha and Gaswerk/Straßenbahn. == Honours== * 2 × European Cup Quarterfinals: 1967, 1969 * 1 × Footballer of the year: 1967 * 4 × Austrian Bundesliga: 1964, 1967, 1968, 1971 * 2 × Austrian Cup: 1968, 1969 * 8 matches and 3 goals for the Austrian national football team from 1964 to 1967 ==References== ==Other websites== * Rapid Archiv Category:1943 births Category:2023 deaths Category:Austrian footballers Category:Players of the Austrian national football team Category:Association football forwards Category:SK Rapid Wien players Category:Austrian football managers Category:Floridsdorfer AC managers Category:Austrian football forwards Category:LASK players Category:Austrian football champions",
 "title": "Leopold Grausam"
}