{
 "id": "1008837",
 "text": "In May 1968, a period of civil unrest happened in France. There were similar movements around the same time across the world. They inspired a generation of protest art in the form of songs, imaginative graffiti, posters, and slogans. On 22 March, far-left groups, a small number of well-known poets and musicians, and 150 students occupied a building at the University of Paris at Nanterre. They held a meeting in the university council room about class discrimination in French society and the political bureaucracy that controlled the university's funding. The university called the police, and the students left. There were more conflicts between students and authorities at Nanterre, and the university was shut down on 2 May 1968. Students at the Sorbonne campus of the University of Paris met on 3 May to protest the closure and the threats to expel several students at Nanterre. On Monday, 6 May, the national student union, the Union nationale des étudiants de France, as well as the union of university teachers, marched to protest against the police invasion of the Sorbonne. More than 20,000 students, teachers, and supporters marched towards the Sorbonne, which was still sealed off by the police, which charged and hit people with their batons. Most of the crowd left, but some began to make barricades out of whatever was at hand. Some people threw stones and forced the police to retreat. The police then used tear gas and charged the crowd again. Hundreds of students were arrested. The next day, secondary school student unions went to the Arc de Triomphe to demand all criminal charges against arrested students to be dropped, the police should leave the university, and the Nanterre and Sorbonne universities should be reopened. On Friday, 10 May, another huge crowd gathered on the city's Left Bank. When the Compagnies Républicaines de Sécurité blocked them from crossing the river, the crowd again made barricades, which the police attacked at 2:15 a.m. after negotiations had stopped. Hundreds of people were arrested and injured. They were seen on television the next day. The government had acted in a way that made people support the strikers. Many French singers and poets joined after the police brutality had come to light. American artists also began to support the strikers. The large union federations, the Confédération générale du travail and the Force ouvrière, called for a one-day general strike and demonstration for Monday, 13 May. More than a million people marched through Paris that day. The police stayed out of sight. Prime Minister Georges Pompidou personally announced the release of the prisoners and the reopening of the Sorbonne, but the protests did not stop. Students occupied the Sorbonne, declared it an independent \"people's university,\" and went on national television. Many people thought them foolish, but 401 popular action committees were set up in Paris and other parts of France to complain about the government and French society. The demonstrations spread to factories. The unions tried to get people interested in pay rises, but the workers wanted a new government and to get rid of President Charles de Gaulle. Some tried to run their factories themselves. The unions got agreements, which would increase the minimum wage by 35% and all salaries by 10%, more protection for workers and a shorter working day. However, the workers were not satisfied. On the morning of 29 May, de Gaulle postponed the meeting of the Council of Ministers that was due that day and secretly removed his personal papers from Élysée Palace. He told his son-in-law, Alain de Boissieu, \"I do not want to give them a chance to attack the Élysée. It would be regrettable if blood were shed in my personal defense. I have decided to leave: nobody attacks an empty palace.\" De Gaulle refused Pompidou's request to dissolve the National Assembly, as he believed that their party, the Gaullists, would lose if there was an election. At 11:00 a.m., he told Pompidou, \"I am the past; you are the future; I embrace you.\" He left by helicopter but did not say where he was going. For more than six hours, nobody in France knew where he was. He had gone to the headquarters of the French Forces in Germany, in Baden-Baden, to meet General Jacques Massu. In the evening, de Gaulle went to his country home in Colombey-les-Deux-Églises. On 30 May, 400,000 to 500,000 protesters, many more than the 50,000 the police were expecting, were led by the Confédération générale du travail. They marched through Paris and chanted, \"Adieu, de Gaulle!\" (\"Farewell, de Gaulle!\"). Maurice Grimaud, the head of the Paris police, played a key role in avoiding revolution by both speaking to and spying on the revolutionaries and by carefully avoiding the use of force. People thought that the Communists were going to seize power in Paris, and Pompidou prepared the army. At 2:30 p.m. on 30 May, Pompidou persuaded de Gaulle to dissolve the National Assembly and call a new election by threatening to resign. At 4:30 pm, de Gaulle broadcast his own refusal to resign. He announced an election would be held on 23 June, ordered workers to return to work, and threatened to institute a state of emergency if they did not. The government had leaked to the media that the army was outside Paris. Immediately after the speech, about 800,000 supporters marched through the Champs-Élysées waving the national flag. The Gaullists had planned the rally for several days, and it attracted a crowd of mixed ages, occupations, and politics. The Communists agreed to the election, and the threat of revolution was over. Workers gradually returned to work or were taken from their factories by the police. The national student union called off street demonstrations. The government banned a number of leftist organizations. The police retook the Sorbonne on 16 June. De Gaulle's fears were wrong since his party won the greatest victory in French parliamentary history in the election held in June by taking 353 of the 486 seats. The Communists got only 34 and the Socialists 57. May 1968 was an important moment in French politics. It represented for some the possibility of liberation and for others the dangers of anarchy. Someone who took part in or supported the period of unrest is referred to as soixante-huitard (literally a \"Sixty-Eighter\") . == Slogans == Sous les pavés, la plage! (\"Under the paving stones, the beach!\"), is a slogan coined by student activist Bernard Cousin. When the students lifted the pavement to make barricades, they found sand under it. * Il est interdit d'interdire (\"It is forbidden to forbid\"). * Jouissez sans entraves (\"Enjoy without hindrance\"). * Élections, piège à con (\"Elections, a trap for idiots\"). * CRS = SS. * Je suis Marxiste—tendance Groucho. (\"I'm a Marxist—of the Groucho persuasion.\") * Cela nous concerne tous. (\"This concerns all of us.\") * Soyez réalistes, demandez l'impossible. (\"Be realistic, demand the impossible.\") * \"When the National Assembly becomes a bourgeois theater, all the bourgeois theaters should be turned into national assemblies.\" (Written above the entrance of the occupied Odéon Theater) * \"I love you!!! Oh, say it with paving stones!!!\" * \"Read Reich and act accordingly!\" (University of Frankfurt; similar Reichian slogans were scrawled on the walls of the Sorbonne, and in Berlin, students threw copies of Reich's The Mass Psychology of Fascism (1933) at the police). * Travailleurs la lutte continue[;] constituez-vous en comité de base. (\"Workers[,] the fight continues; form a basic committee.\") or simply La lutte continue (\"The struggle continues\") == References == Category:1960s in France Category:1968",
 "title": "May 1968 events in France"
}