{
 "id": "100878",
 "text": "Azua is a Dominican province; it is in the southern part of the country, along the Caribbean coast. Its capital is Azua de Compostela. After the Dominican independence from Haiti, Azua was one of the five original provinces of the country; all the southwestern part of the country was part of this province, including some regions that now are part of Haiti. ==Name== The province takes the name from its capital city, Azua de Compostela. Azua was the Taíno name of the region where the city was founded ==Location== Azua has the La Vega province to the northeast, the San José de Ocoa and Peravia provinces to the east, the Caribbean Sea to the south, the Barahona and Baoruco provinces to the west, and the San Juan province to the northwest. ==History== There were people living in the region since a very long time, most of them along the coast. When the Spanish people came here, only Taínos were living here. During colonial times, Azua de Compostela was one of the most important city of the Hispaniola island because there were several factories to produce sugar. Hernán Cortés, conquistador of Mexico, was one of the persons who lived here for some time. After the independence in 1844, there were several important battles in this region between the Haitian and Dominican armies and Azua de Compostela was burned several times by the Haitian armies. Padre Las Casas is a municipality of the province since 1942; later, other municipalities were created: Peralta in 1978; Las Charcas, Las Yayas de Viajama and Estebanía in 2001; Sabana Yegua and Pueblo Viejo in 2003; and Tábara Arriba and Guayabal in 2004. The municipal districts of the province were created in: * 2000 : Palmar de Ocoa * 2001 : Villarpando * 2003 : Las Barias-La Estancia, Los Jovillos, Proyecto 4, Ganadero, Proyecto 2-C, El Rosario and Los Toros * 2004 : Barro Arriba, Las Lagunas, La Siembra, Tábara Abajo and Amiama Gómez * 2005 : Puerto Viejo, Barreras, Doña Emma Balaguer Vda. Vallejo, Clavellina and Monte Bonito * 2006 : Las Lomas, Hato Nuevo Cortés and Los Fríos ==Population== In (last national census), there were people living in the Azua province, and 165,703 () living in towns and cities. The population density was persons/km². Its population represents of the total population of the country and the province is ranked as the 23th (out of 31 plus the National District) more populated province. , the total estimated propulation of the province is 219,856 inhabitants. The largest city of the province is Azua de Compostela, its head municipality or capital, with an urban population (in ) of 59,319 inhabitants. ==Geography== The Azua province has a total area of . It has of the area of the Dominican Republic and it is ranked as the 5th (out of 31 provinces plus the National District) largest province. The altitude of Azua de Compostela, provincial capital, is . Most of the Azua province is in a very dry valley (the Azua Valley or Azua Plain); cacti and other plants of dry regions are common in this valley. The Cordillera Central (\"Central mountain range\") runs along the northern half of the province. To the east, there is the Sierra de Ocoa (part of the Cordillera Central) that separates this province from the Peravia province. To the west, there are the Sierra Martín García and Sierra de Neiba. The most important rivers are the Yaque del Sur and its tributaries Las Cuevas and Grande or Del Medio. Other rivers are Ocoa, Jura and Vía (that flows through the city of Azua de Compostela). The only important road in the province is the Carretera Sánchez (Sánchez National Road) that goes through the southern part of the province; the road goes from Santo Domingo to the western part of the country, to the border with Haiti. The other roads are not so important and they go from the different municipalities or municipal districts to the Carretera Sánchez or to the city of Azua de Compostela. The Azua port is in the municipal district of Puerto Viejo; it is a small port. ===Municipalities=== There are 10 municipalities and 22 municipal districts (M.D.) in the province. The municipalities and its municipal districts (M.D.) are: Municipalities of the Azua province Municipality (code) Municipal Districts (code) Population (2010) Area (km2) Density Altitude (m) Azua de Compostela (020101) Azua de Compostela (020101) 59,319 14.4 22 Barro Arriba (020102) 5,262 35.8 172 Las Barías-La Estancia (020103) 6,882 13.5 37 Los Jovillos (020104) 5,962 46.9 44 Puerto Viejo (020105) 2,194 56.1 6 Barreras (020106) 2,364 97.8 129 Doña Emma Balaguer Vda. Vallejo (020107) 2,759 8.2 43 Clavellina (020108) 2,672 44.6 42 Las Lomas (020109) 3,931 99.0 582 Azua de Compostela (020100) Azua de Compostela (020100) 91,345 416.3 Las Charcas (020201) Las Charcas (020201) 8,191 187.6 137 Palmar de Ocoa (020202) 3,052 59.4 10 Las Charcas (020200)) Las Charcas (020200)) 11,243 247.0 Las Yayas de Viajama (020301) Las Yayas de Viajama (020301) 6,358 91.1 226 Villarpando (020302) 7,160 154.8 357 Hato Nuevo Cortés (020303) 4,102 185.2 237 Las Yayas de Viajama (020300) Las Yayas de Viajama (020300) 17,620 431.1 Padre Las Casas (020401) Padre Las Casas (020401) 8,487 128.0 1,030 Las Lagunas (020402) 4,290 247.9 904 La Siembra (020403) 1,538 37.6 907 Monte Bonito (020404) 3,291 114.3 1,107 Los Fríos (020405) 2,435 46.1 1,061 Padre Las Casas (020400) Padre Las Casas (020400) 20,041 573.9 Peralta (020501) Peralta (020501) 15,257 129.4 1,184 Peralta (020500) Peralta (020500) 15,257 129.4 Sabana Yegua (020601) Sabana Yegua (020601) 10,313 1.6 130 Proyecto 4 (020602) 3,584 13.3 43 Ganadero (020603) 2,240 3.2 52 Proyecto 2-C (020604) 2,883 95.7 84 Sabana Yegua (020600) Sabana Yegua (020600) 19,020 113.8 Pueblo Viejo (020701) Pueblo Viejo (020701) 7,191 34.5 15 El Rosario (020702) 4,044 13.6 13 Pueblo Viejo (020700) Pueblo Viejo (020700) 11,235 48.1 Tábara Arriba (020801) Tábara Arriba (020801) 3,066 17.0 316 Tábara Abajo (020802) 5,423 165.0 131 Amiama Gómez (020803) 2,765 15.4 373 Los Toros (020804) 6,393 77.3 235 Tábara Arriba (020800) Tábara Arriba (020800) 17,647 274.7 Guayabal (020901) Guayabal (020901) 5,263 235.6 727 Guayabal (020900) Guayabal (020900) 5,263 235.6 Estebanía (020911) Estebanía (020911) 5,640 212.7 81 Estebanía (02910) Estebanía (02910) 5,640 212.7 Azua province (020000) Azua province (020000) 214,311 2,682.5 ==Economy== The main economic activity in the province is farming. In the valley, the most important crops are and the main products are banana, plantain, vegetables and fruits like mango. High on the northern mountains, coffee and beans are important products. Fishing is important along the Caribbean coast. ==Related pages== * Provinces of the Dominican Republic ==References== Category:Provinces of the Dominican Republic",
 "title": "Azua Province"
}