{
 "id": "1008560",
 "text": "Alan John Percivale Taylor FBA (25 March 1906 – 7 September 1990) was a British historian who specialised in 19th- and 20th-century European diplomacy. He was a journalist and a broadcaster. His television lectures made him famous. He was called \"the Macaulay of our age\". He was born in Southport. His parents were pacifists. He was sent to Bootham School in York, a Quaker school. Then he went to Oriel College, Oxford. He and his parents were in the Communist Party in the 1920's. He left it because of the 1926 General Strike. He graduated from Oxford in 1927 with first-class honours. His first book, The Italian Problem in European Diplomacy, 1847–49 was published in 1934. He was a lecturer in history in the University of Manchester from 1930 to 1938. From 1938 to 1976 he was a Fellow of Magdalen College, Oxford, and a lecturer at the University of Oxford until 1964. He was stopped from lecturing because of the controversy around his book The Origins of the Second World War. He said the outbreak of war in 1939 was an unfortunate accident caused by mistakes on everyone's part and was not a part of Hitler's plan. On 17 March 1942 Taylor made the first of seven appearances on The World at War – Your Questions Answered broadcast by BBC Forces' Radio. After the war Taylor became one of the first television historians. He had public arguments with the historian Hugh Trevor-Roper and with Malcolm Muggeridge. He was mentioned in an episode of Monty Python's Flying Circus. The Course of German History (1945) was a best-seller in both the United Kingdom and the United States. He said Nazi racial imperialism was the same as policies pursued by every German ruler. His 1965 book English History 1914–1945 was very popular. He liked to make his books funny. == Works == * The Italian Problem in European Diplomacy, 1847–1849, 1934. * (editor) The Struggle for Supremacy in Germany, 1859–1866 by Heinrich Friedjung, 1935. * Germany's First Bid for Colonies 1884–1885: a Move in Bismarck's European Policy, 1938. * The Habsburg Monarchy 1809–1918, 1941, revised edition 1948, reissued in 1966 . * The Course of German history: a Survey of the Development of Germany since 1815, 1945. Reissued in 1962. * Trieste, (London: Yugoslav Information Office, 1945). 32 pages. * Co-edited with R. Reynolds British Pamphleteers, 1948. * Co-edited with Alan Bullock A Select List of Books on European History, 1949. * From Napoleon to Stalin, 1950. * Rumours of Wars, 1952. * The Struggle for Mastery in Europe 1848–1918 (Oxford History of Modern Europe), 1954. * Bismarck: the Man and Statesman, 1955. Reissued by Vintage Books in 1967 . * Englishmen and Others, 1956. * co- edited with Sir Richard Pares Essays Presented to Sir Lewis Namier, 1956. * The Trouble Makers: Dissent over Foreign Policy, 1792–1939, 1957. * Lloyd George, 1961. * The Origins of the Second World War, 1961. Reissued by Fawcett Books in 1969 . * The First World War: an Illustrated History, 1963. American edition has the title: Illustrated history of the First World War. * Politics in Wartime, 1964. * English History 1914–1945 (Volume XV of the Oxford History of England), 1965. * From Sarajevo to Potsdam, 1966. 1st American edition, 1967. * From Napoleon to Lenin, 1966. * The Abdication of King Edward VIII by Lord Beaverbrook, (editor) 1966. * Europe: Grandeur and Decline, 1967. * Introduction to 1848: The Opening of an Era by F. Fejto, 1967. * War by Timetable, 1969. * Churchill Revised: A Critical Assessment, 1969. * (editor) Lloyd George: Twelve Essays, 1971. * (editor) Lloyd George: A Diary by Frances Stevenson, 1971. * Beaverbrook, 1972. * (editor) Off the Record: Political Interviews, 1933–43 by W. P. Corzier, 1973. * A History of World War Two: 1974. * \"Fritz Fischer and His School,\" The Journal of Modern History Vol. 47, No. 1, March 1975 * The Second World War: an Illustrated History, 1975. * (editor) My Darling Pussy: The Letters of Lloyd George and Frances Stevenson, 1975. * The Last of Old Europe: a Grand Tour, 1976. Reissued in 1984. * Essays in English History, 1976. * \"Accident Prone, or What Happened Next,\" The Journal of Modern History Vol. 49, No. 1, March 1977 * The War Lords, 1977. * The Russian War, 1978. * How Wars Begin, 1979. * Politicians, Socialism, and Historians, 1980. * Revolutions and Revolutionaries, 1980. * A Personal History, 1983. * An Old Man's Diary, 1984. * How Wars End, 1985. * Letters to Eva: 1969–1983, edited by Eva Haraszti Taylor, 1991. * From Napoleon to the Second International: Essays on Nineteenth-century Europe. Ed. 1993. * From the Boer War to the Cold War: Essays on Twentieth-century Europe. Ed. 1995. * Struggles for Supremacy: Diplomatic Essays by A.J.P. Taylor. Edited by Chris Wigley. Ashgate, 2000. == References == Category:People from Lancashire Category:English historians Category:1906 births Category:1990 deaths",
 "title": "A. J. P. Taylor"
}