{
 "id": "1008315",
 "text": "The Loud House Movie is a 2021 American animated musical fantasy comedy movie. It is based on Nickelodeon's The Loud House. It was produced by Paramount Animation, Nickelodeon Movies, and Nickelodeon Animation Studios. The movie was originally going to be theatrically released in 2020 by Paramount Pictures. Instead, the movie was released on Netflix on August 20, 2021. The film's animation was done by Jam Filled Entertainment in Ottawa, Ontario, Canada, with the former having provided the animation for the television series. It was directed by Chris Savino, co-directed by Dave Needham in his directorial debut. It stars the voices of Asher Bishop, David Tennant, Michelle Gomez and Katy Townsend, and the regular voice cast of the series; consisting of Tex Hammond, Jill Talley, Brian Stepanek, Catherine Taber, Liliana Mumy, Nika Futterman, Cristina Pucelli, Jessica DiCicco, Grey Griffin, Lara Jill Miller, and Andre Robinson, reprising their respective roles, and includes a mix of hand-drawn animation and computer animation. The film tells the story of the Louds going to Scotland where they learn that they are descended from royalty. A live-action Christmas movie, A Loud House Christmas (also known as A Really Loud House Christmas) was released on Paramount+ on November 26, 2021. == Cast == * Asher Bishop as The Duke * David Tennant as Angus * Michelle Gomez as Morag * Tex Hammond as Lincoln Loud * Jill Talley as Rita Loud * Brian Stepanek as Lynn Loud Sr. * Catherine Taber as Lori Loud * Liliana Mumy as Leni Loud * Nika Futterman as Luna Loud * Cristina Pucelli as Luan Loud * Jessica DiCicco as Lynn Loud Jr. and Lucy Loud * Grey Griffin as Lola Loud, Lana Loud, Lily Loud and Scoots * Lara Jill Miller as Lisa Loud * Katy Townsend as Lucille Loud * Andre Robinson as Clyde McBride === Animation === Unlike the series and its spin-off series The Casagrandes, which was animated in hand-drawn/traditional animation with Toon Boom Harmony produced by the series' original animation service provider Jam Filled Entertainment, an animation studio based in Ottawa, Ontario, Canada. The additional animation was produced by Yowza! Animation, an animation studio based in Toronto, Ontario, Canada, Digital eMation in Seoul, South Korea (Martin Mystery, Team Galaxy, Totally Spies!, The Amazing Spiez!, Totally Spies! The Movie, The Grim Adventures of Billy & Mandy, Evil Con Carne, Robotboy, Grim & Evil, Billy & Mandy's Big Boogey Adventure, Be Cool, Scooby-Doo!, Underfist: Halloween Bash, Time Squad, My Gym Partner's a Monkey, Batman: The Brave and the Bold, Scooby- Doo! Mystery Incorporated, Megas XLR, Xiaolin Showdown, The 7D, Mixels, Gravity Falls, Super Duper Sumos, Shaggy & Scooby-Doo Get a Clue!, The Secret Saturdays, Dawn of the Croods, The LeBrons, and Famous 5: On the Case), Mercury Filmworks, an animation studio based in Ottawa, Ontario, Canada (Mickey Mouse (2013), Looney Tunes: Back in Action, Team Hot Wheels: The Origin of Awesome!: The Movie, Ruby Gloom, The Little Bear Movie, Kick Buttowski: Suburban Daredevil, Weird Years, Dark Oracle, World of Quest, Class of the Titans, Ned's Newt, Star vs. the Forces of Evil, Fish Hooks, Toot and Puddle, What About Mimi?, The New Woody Woodpecker Show, Fish Hooks, Yvon of the Yukon, Gerald McBoing-Boing (2005 TV Series), Penn Zero: Part-Time Hero, Jimmy Two-Shoes, and Grossology), Sunwoo Entertainment, an animation studio based in Seoul, South Korea (Invader Zim, Buzz Lightyear of Star Command, Rugrats, All Grown Up!, Rocket Power, As Told by Ginger, Johnny Bravo, American Dragon: Jake Long, Lilo & Stitch: The Series), Bardel Entertainment, an animation studio based in Vancouver, British Columbia, Canada (Titan A.E., Silverwing, Dragons: Fire & Ice and Dragons II: The Metal Ages, Viva Piñata, Chaotic, Edgar & Ellen, The Christmas Orange, Zeke's Pad, The Adventures of Puss in Boots, Rainbow Butterfly Unicorn Kitty, Pearlie, Rescue Heroes, Jake and the Never Land Pirates, Project GeeKeR, The Road to El Dorado, Seven Little Monsters, Space Jam, Flying Rhino Junior High, Angry Birds Blues, Spirit: Stallion of the Cimarron, Eight Crazy Nights, Mother Up!, Mack and Moxy, Planet Sheen, Maggie and the Ferocious Beast, Teenage Mutant Ninja Turtles (2012 TV series), Anastasia, Monsters vs. Aliens (2013 TV Series), The Buzz on Maggie, ¡Mucha Lucha!, The Pink Panther (1993 TV series), Marco Polo: Return to Xanadu, Wow! Wow! Wubbzy!, Wubbzy's Big Movie!, Teen Titans Go!, El Tigre: The Adventures of Manny Rivera, Fanboy & Chum Chum, and Rick and Morty), Rough Draft Korea Co., Ltd., an animation studio based in Seoul, South Korea (The Powerpuff Girls, SpongeBob SquarePants, Dexter's Laboratory, ChalkZone, Johnny Bravo, American Dragon: Jake Long, Kim Possible, Phineas and Ferb, CatDog, Lilo & Stitch: The Series, Adventure Time, Catscratch, Danny Phantom), Snipple Animation Studios, an animation studio based in Quezon City, Philippines (New Looney Tunes/Wabbit: A Looney Tunes Production, Be Cool, Scooby-Doo!, Big Hero 6: The Series, Ducktales (2017 TV Series), Dude, That's My Ghost!, Unikitty!, Bunnicula, Dora and Friends: Into the City!, Wacky Races, Geronimo Stilton, Right Now Kapow, Nerds and Monsters), Yeson Animation Studios, an animation studio based in Seoul, South Korea (The Fairly OddParents), Mighty Studios in Guadalajara, Mexico (the team who made The Casagrandes Movie), and Digitoonz Media & Entertainment PVT. Ltd., an animation studio based in Noida, India. The visual effects was produced by Nickelodeon Digital Animation Studios, an animation studio based in Burbank, California, with the CGI animation for the vehicles, objects and camera backdrops that matches the show's 2D backgrounds. == References == Category:2020s English-language movies Category:2021 animated movies Category:2021 comedy movies Category:Movies based on TV series Category:American comedy movies Category:American animated movies Category:Movies set in Scotland __FORCETOC__ Category:Movies set in Michigan Category:Movies about families Category:Movies about vacationing Category:Netflix movies Category:Traditional animation Category:Flash animation Category:American family comedy movies Category:American children's adventure movies Category:American family movies",
 "title": "The Loud House Movie"
}