{
 "id": "1009871",
 "text": "Hans-Gerd Schildt (born 12 June 1952) is a former German football player. After the end of his career he became football manager. He played in Germany for different clubs among them Werder Bremen and Borussia Dortmund. In Austria he played for SV Austria Salzburg. ==Career== Schildt played for Bremerhaven 93 from 1971 to 1973. Then he moved to Bundesliga club SV Werder Bremen. On the first day of the 1973–74 season he made his debut in the Bundesliga . Schildt scored the 1-0 lead in the 30th minute and his first Bundesliga goal. He played in 20 games and scored 3 goals in his only Bundesliga season with Werder. Schildt then moved to Borussia Dortmund in the new 2nd Bundesliga. With Borussia he played in the northern season in the 2nd division. In his second year (1975–76) he was runner-up behind Tennis Borussia Berlin. Borussia qualified for the relegation games for promotion to the Bundesliga against the runner-up in the southern season of the 2nd Bundesliga, 1. FC Nuremberg. Schildt played in both relegation games over the full length and was promoted with Borussia to the Bundesliga. He then moved to Arminia Bielefeld and played again in the 2nd Bundesliga North. With Arminia he was champion in the 2nd league North. Schildt stayed a year He then moved to Austria Salzburg. With Austria he played in the Austrian Bundesliga until 1985. In 1985 he ended his professional career. ==Manager== He coached SV Hohenlimburg in Hagen from 1986 to 1989 as a player-coach Reviersport.de (German) In 1989, Schildt finally ended his career and moved back to northern Germany. From 1989 to 1991 he was coach of Holstein Kiel. In 1991/92 he led the league club VfB Kiel to the Oberliga promotion round. In 1992 he moved to the Oberliga club TuS Hoisdorf, in November 1992 he was fired.Hamburger Abendblatt He also worked as a coach at FC Kilia Kiel. In 2012 he became coach of the traditional team in Holstein Kiel. From November 2018 he was a board member of the traditional club KSV Holstein. ==References== Category:1952 births Category:German footballers Category:German football managers Category:FC Red Bull Salzburg players Category:Borussia Dortmund players Category:Living people",
 "title": "Hans-Gerd Schildt"
}