{
 "id": "1009833",
 "text": "In Australia, a Premier is the head of government of a state, while a Chief Minister is the head of government of a territory. ==History and background== In colonial times, the five British colonies on mainland Australia, along with the Van Diemen's Land colony of Tasmania and the colony of New Zealand, had their own Governor, a title that eventually was changed to \"Premier\". Back then, the two territories did not exist, so the colonies represented what we today know as the six states and New Zealand, which is not part of Australia and now has a Prime Minister. Today, the Governor serves as the head of state of a state. The King is the head of state of Australia and is represented by the Governor-General when he is absent. Until the creation of the Australian Labor Party (a centre-left, social democratic party), there were no political parties in Australia, so the Premiers were all independents. On a federal level, Australia's head of government is called the Prime Minister. Because Australia formed as a federation of six British colonies, each state and territory has their own level of government, which is the second-highest level in Australia, the lowest being local government, which is made up of different councils. Like the Prime Minister, Premiers and Chief Ministers are the state/territory leader of the party that forms government. Currently, the Labor Party forms a majority government in four states (Victoria, Queensland, Western Australia and South Australia) and in the Northern Territory, as well as federally. In Tasmania, the Liberal Party (a centre-right, liberal conservative party) currently governs with a majority. In New South Wales, the Labor Party governs in a minority government, with the support of three independents on confidence and supply, meaning they can vote differently to the Government but still allow them to govern. In the Australian Capital Territory (ACT), the Labor Party forms a coalition government (meaning more than one party is in the Cabinet) with the Greens, a left-wing, progressive green party, meaning they mostly focus on issues like climate change. When a party is unable to win a majority of seats in the Lower House, the party with the most seats must seek support from the crossbench. A crossbencher is someone who is not from either the Government or the Opposition. Then they can form either a coalition government with the crossbenchers or they crossbenchers can give them confidence and supply. For example, it is very common federally and in New South Wales and Victoria for the Liberal Party and the National Party to form a coalition, regardless of if they are in Government or Opposition. This is commonly called the Coalition. In Queensland and the Northern Territory, these two parties merged to become the Liberal National Party (LNP) and the Country Liberal Party (CLP), respectively. In Western Australia, it is common for the Liberals and the Nationals to form the Coalition, but the agreement is different there in that the parties are still independent of each other. In South Australia and Tasmania, the Coalition has existed before but currently does not exist, as the Nationals have not very much activity there and they have no seats in those states. In the ACT the Coalition does not exist, because the Nationals do not have a branch there, only the Liberals do. This is because the Nationals represent regional, rural and remote interests, called agrarianism, but almost all of the ACT is the city of Canberra. ==Current premiers of the states and current chief ministers of the territories== State Portrait Name Term start Current duration Party Title State government Andrew Barr Labor Chief Minister Aust. Cap. Territory Chris Minns Labor Premier New South Wales Lia Finocchiaro Country Liberal Chief Minister Northern Territory David Crisafulli Liberal National Premier Queensland Peter Malinauskas Labor Premier South Australia Jeremy Rockliff Liberal Premier Tasmania Jacinta Allan 27 September 2023 Labor Premier Victoria Roger Cook Labor Premier Western Australia ==References==",
 "title": "Premiers and chief ministers of the Australian states and territories"
}