{
 "id": "1009772",
 "text": "Samuel Vimes is a fictional character created by Terry Pratchett for the Discworld books and is the leader of the police in the city of Ankh-Morpork. ==Guards!Guards!== In Guards! Guards!, Samuel Vimes is the captain of the Night Watch and is an alcoholic because he has a disease which makes him less drunk than people are supposed to be. And Captain Vimes has as his men, a corporal named Nobbs who is a kleptomaniac and a sergeant named Colon who is an idiot so Captain Vimes has given up because of all the crime and corruption in Ankh-Morpork. Then a person named Carrot Ironfounderson joins the police and actually believes in the law so Captain Vimes ends up helping to stop a dragon, save the city, rescue The Patrician and falling in love with a woman named Sibyl Ramkin who marries him. ==Men at Arms== In Men at Arms, Captain Vimes has to train a dwarf, a female werewolf and a troll to become police and he trains Carrot Ironfounderson to take over as captain of the Night Watch when he retires and in the end Lord Havelock Vetinari is impressed enough that he decides to put Vimes in charge of all the police to fight against corruption and has Vimes start to call himself Commander Vimes. ==Feet of Clay== In the book, Feet of Clay, Commander Vimes is hates by the aristocrats because his ancestor killed the last king. In the end, Commander Vimes saves the city from an evil plan involving a golem so Lord Vetinari gives Vimes a knighthood. ==Jingo== In Jingo, Ankh-Morpork almost gets into a war with a country called Klatch and Commander Vimes is fired so he starts his own regiment and later goes to Klatch to find and stop the villains of the book and at one point arrests Lord Vetinari who later makes Commander Vimes a duke. ==The Fifth Elephant== In The Fifth Elephant, Lord Vetinari makes Commander Vimes ambassador to a place called Überwald where Vimes has to stop an evil racist werewolf baron by killing him. ==Night Watch== In Night Watch, Commander Vimes accidentally time travels to the past while chasing a murderer who then kills Vimes’s old friend John Keel before Keel actually died so Vimes pretends to be John Keel and teaches the young Samuel Vimes everything that Keel ever taught him. And after Vimes goes back to the present, his wife gives birth to a son. ==Thud!== In Thud!, Commander Vimes tried to prevent a war between the dwarf king and the trolls and ends up being mind controlled by a demon called the Summoning Dark but Vimes escapes its control so that he can read a children’s book to his son. ==Snuff== In Snuff (Pratchett novel), Commander Vimes tried to stop a man named Stratford who is a murderer and drug dealer while Vimes’s inner demon The Summoning Dark helps him. Category:Characters in written fiction",
 "title": "Samuel Vimes"
}