{
 "id": "1009443",
 "text": "Lone Elm is a city in Anderson County, Kansas, United States. Lone Elm, Kansas, located in Lone Elm Township of southeast Anderson County, is officially extinct because it no longer has a post office. However, as of the 2020 census, its population was 27.Kathy Weiser-Alexander, owner/editor, Legends of America, https://www.legendsofamerica.com. In 1873, Isaac K. Reeve arrived in Anderson County from Pennsylvania, looking for suitable land to settle. His sister and husband, J.B. Rhodes family, lived near Elizabethtown, southeast of Colony. Reeve purchased several hundred acres of land from the railroad for $1.50 to $2.50 per acre, where Lone Elm is located today. After purchasing property, he returned to Pennsylvania to marry Hannah Louisa Winters, and they returned and built a home a half mile southwest of Lone Elm. A post office called Lone Elm was established near Reeve’s home on March 14, 1879, and he became the first postmaster. It was named for a nearby lone elm tree. When the St. Louis and Emporia Railroad passed through Reeve’s land, he and his wife platted a town in May 1886. The new town was named Reeve, and the post office moved to the new town. However, because the post office was named Lone Elm, the town’s name was changed to Lone Elm. Reeve erected several buildings in Lone Elm to encourage businesses to move into town. The railroad ran along the south side of town, and a stockyard was built on the north side of the tracks. Lone Elm became a shipping center for livestock, grain, and hay. Before Lone Elm became a town, the Walker schoolhouse was to the north, and another school was south of the townsite. One of the school buildings was moved into town and became Lone Elm District No. 67. A mile and a half northeast of Lone Elm was a town called Equity. This place expected the railroad to run through it. However, most homes and buildings were moved to Lone Elm or Kincaid when it didn’t. As the small town grew, it soon boasted a hardware store, an implement store, a furniture store, a lumberyard, two general merchandise stores, a very barn, a drug store, a physician, and a veterinarian. Isaac K. Reeve was also the original stockholder of the Lone Elm State Bank and the Bank of Kincaid. In 1910, Lone Elm was situated on the Missouri Pacific Railroad and had a bank, a dozen or more retail establishments, an express office, and a money order post office. At that time, its population peaked at 175. In the subsequent decades, the population would gradually fall. A new school was built just north of the first school building in about 1915. The new building had four classrooms upstairs and two half-basement rooms downstairs. The first high school class graduated in 1923. In 1933, the Lone Elm Bank was forced to consolidate with the Kincaid Bank because several fires had heavily damaged the community. That year, the railroad was abandoned due to more accessible truck transportation, which greatly affected the small town’s economy. Afterward, the Lone Elm Depot was purchased and moved to Garnett, which still stands on the west side of Highway 59, next to the Anderson County Hospital property. The building now serves as a business office. The high school closed in 1946 due to a lack of students. In later years, the Lone Elm Elementary School closed due to consolidation. Lone Elm’s post office closed on January 31, 1956. Lone Elm once had a Methodist and a Presbyterian Church. After the Presbyterian Church closed, it was converted into a barn. The old Methodist Church now serves as a Community Building. ==References== Category:Cities in Anderson County, Kansas",
 "title": "Lone Elm, Kansas"
}