{
 "id": "1010074",
 "text": "Nordreisa (Northern Sami: ; Kven: ) is a municipality in Troms county, Norway. It was created on January 1, 1886, when Skjervøy Municipality was split in two. The southern part of Skjervøy was broken to form the new municipality. It has an area of . Its administrative center is the village of Storslett, where the river Reisaelva meets the Reisafjorden. Other villages in the municipality include Oksfjordhamn, Sørkjosen, and Rotsund. == Etymology == The municipality is named after the Reisafjorden, named after the river Reisaelva. The prefix Nord- was added to the name to distinguish the municipality from the nearby Sørreisa Municipality to the south. The coat of arms of Nordreisa has two salmon, which were chosen to represent the local Reisaelva river. == History == Most people living in Nordreisa have ancestors who were settlers from Finland who came over in the 18th century, escaping famine and war. Some people living there have Sámi or Norwegian ancestors. Today the Norwegian language is most commonly used. Few old buildings survive in Nordreisa; virtually everything was destroyed in early 1945 by retreating German troops. However, in the old trading post at Havnnes, there are old homes that escaped the damages of the war. There is also the waterfall of Mollisfossen, which is high. == Government == All municipalities in Norway, including Nordreisa, are run by a municipal council. The members of that council, will again choose a mayor in 2027. The municipality is in charge of things like schools, healthcare for people who don't stay in the hospital, support for senior citizens or older adults, helping people without jobs, planning land use, improving the economy, and keeping the roads in good shape. Nordreisa's legal cases are handled by the Nord-Troms District Court and the Hålogaland Court of Appeal. == Geography == Nordreisa Municipality is located by a fjord and a valley. It also includes part of an island and a mountain. Other municipalities and countries surround it. === Climate === The weather is mostly cold, and the rainy season is in the autumn. It can get very hot in the summer sometimes. The highest temperature recorded was in August 2018. A weather station has been there since 1974 to record the weather. ==Related pages== *List of mayors in Norway that are elected until 2027 == References == Category:Municipalities of Troms",
 "title": "Nordreisa"
}