{
 "id": "1010990",
 "text": "Febrero Amargo is an independent documentary by Gastón Goicoechea Pérez and Agustín Lorenzo Arana. The documentary narrates the military insurrection that took place in Uruguay on February 9, 1973. It details the resistance put up by the National Navy in defense of democratic institutions, along with the speculations of the political system as well as social organizations at the time regarding the possibilities of a civil-military regime based on Communiqués 4 and 7. The title of the documentary was taken from the book \"Febrero Amargo\", written by Senator Amílcar Vasconcellos in March 1973, which was republished in 2017 as part of the Uruguayan Classics Collection of the National Library. The film was completed in January 2019, and prepared for premiere at the Punta del Este Film Festival. == Plot == Febrero Amargo focused on collecting testimony from academic historians, journalists who conducted historical research, political and union figures, as well as protagonists who lived through the period. The co-directors discarded the use of photography in order to use the historical video archive, applying Roland Barthes conception that film represents a \"being there of things\", as opposed to the \"having been there\" of photography. In other words, the aim was for the documentary to become a \"time machine\".. In addition, he not only sought to \"document\" what happened, but also to construct and reconstruct a history experienced in the present. For this reason, it questions the traditional date of the anniversary of the 1973 civil-military coup, which is celebrated on June 27, with the dissolution of the cameras. Instead, the film states that the coup took place on February 9, 1973, when the military insurrection of the Army and the Air Force took place, and that the National Navy opposed it in defense of democratic institutions. == Filming == In 2018, we participated in a call of the Audiovisual Incentive Fund of the Municipality of Maldonado to finance the production costs of \"Febrero Amargo\". The film won first place and the amount of money needed to cover expenses related to filming, post- production and editing. It was completed in January 2019 and prepared for its premiere at the Punta del Este Film Festival. Since then, it has been screened at international film festivals in Uruguay, such as the Piriápolis International Film Festival, the Montevideo International Film Festival (MONFIC), the New DETOUR Film Festival and Atlantidoc 16 - International Documentary Film Festival. == References == Category:2019 documentary movies Category:Uruguayan movies",
 "title": "Febrero Amargo"
}