{
 "id": "1011854",
 "text": "Theloderma, the bug-eyed frogs, mossy frogs, or warty frogs, is a genus of frogs in the family Rhacophoridae, subfamily Rhacophorinae. They live in northeastern India and southern China, through Southeast Asia, to the Greater Sunda Islands; the highest species richness is in Indochina. Some species, especially T. corticale, can live in captivity, with humans. They are small and medium-sized frogs with maximum snout–vent lengths that range from . Their skin can be smooth or it can have warts or bumps on it. Some of the species look very different from each other, but most have good camouflage: Their colors make them look like plants or bird droppings so that animals that want to eat them cannot see them. Scientists do not know much about what these frogs do, but they eat small animals without bones, for example insects. Scientists have seen some of these species lay eggs in small pools of water in holes in trees, in bamboo, or in karst rocks. The female lays 4–20 eggs just above the water. After about one to two weeks they hatch into tadpoles that fall into the water. They become small frogs after a few months or a year. ==Species and taxonomy== The sister taxon of Theloderma is Nyctixalus. Scientists have changed their minds about exactly which species should be in the genus Theloderma and which in Nyctixalus, especially with Theloderma moloch. Today both AmphibiaWeb and Amphibian Species of the World say the two genera are both good. Amphibian Species of the World says there are 26 species in the genus Theloderma: * Theloderma albopunctatum (Liu and Hu, 1962) * Theloderma annae Nguyen, Pham, Nguyen, Ngo, and Ziegler, 2016 * Theloderma asperum (Boulenger, 1886) * Theloderma auratum Poyarkov, Kropachev, Gogoleva, and Orlov, 2018 * Theloderma baibengense (Jiang, Fei, and Huang, 2009) * Theloderma bicolor (Bourret, 1937) * Theloderma corticale (Boulenger, 1903) * Theloderma gordoni Taylor, 1962 * Theloderma horridum (Boulenger, 1903) * Theloderma lacustrinum Sivongxay, Davankham, Phimmachak, Phoumixay, and Stuart, 2016 * Theloderma laeve (Smith, 1924) * Theloderma lateriticum Bain, Nguyen, and Doan, 2009 * Theloderma leporosum Tschudi, 1838 * Theloderma licin McLeod and Norhayati, 2007 * Theloderma moloch (Annandale, 1912) * Theloderma nagalandense Orlov, Dutta, Ghate, and Kent, 2006 * Theloderma nebulosum Rowley, Le, Hoang, Dau, and Cao, 2011 * Theloderma palliatum Rowley, Le, Hoang, Dau, and Cao, 2011 * Theloderma petilum (Stuart and Heatwole, 2004) * Theloderma phrynoderma (Ahl, 1927) * Theloderma pyaukkya Dever, 2017 * Theloderma rhododiscus (Liu and Hu, 1962) * Theloderma ryabovi Orlov, Dutta, Ghate, and Kent, 2006 * Theloderma stellatum Taylor, 1962 * Theloderma truongsonense (Orlov and Ho, 2005) * Theloderma vietnamense Poyarkov, Orlov, Moiseeva, Pawangkhanant, Ruangsuwan, Vassilieva, Galoyan, Nguyen, and Gogoleva, 2015 * Theloderma khoii Ninh, Nguyen, Nguyen, Hoang, Siliyavong, Nguyen, Le, Le & Ziegler, 2022 ==References== Category:Frogs of Asia",
 "title": "Theloderma"
}