{
 "id": "1011368",
 "text": "Josef Adelbrecht (8 January 1910 – 15 September 1941) was an Austrian football player at the position of a striker. ==Career== Josef Adelbrecht began his professional career at Vienna in 1928. The striker won the Austrian Cup (1929, 1930) and the championship (1931, 1933) twice with Döblinger. His greatest success was winning the Mitropacup, the forerunner of today's European Cup, in 1931. In the final Josef Adelbrecht scored a goal to win 2:3 in the first leg in Zurich against Wiener AC . Vienna also won the second leg on the Viennese Hohe Warte. In 1934 Josef Adelbrecht decided to go to France. There he was rarely used at Racing Club de Paris. He left the club in 1935. He then worked in Switzerland at the Grasshopper Club Zurich. After a year and a half abroad, Josef Adelbrecht returned to Vienna in January 1936 . Then he played for FK Austria Wien for a season and a half. In 1937 he moved to SK Rapid Wien. This season he was able to become Austrian champion for the third time with Rapid. In the years that followed, the striker played a few more games for Austro Fiat, Red Star Vienna and Floridsdorfer AC . ==Death== In March 1940 he was drafted into the Wehrmacht. On 15 September 1941 he was killed during the invasion of Russia at Ivashkovo, about a hundred kilometers northwest of Moscow. Bernhard Hachleitner, Matthias Marschik, Rudolf Müllner, Johann Skocek: Ein Fußballverein aus Wien. Der FK Austria im Nationalsozialismus 1938–1945, Böhlau Verlag, Wien-Köln-Weimar 2019, S. 278–279. ==Honours== * 1 × Mitropa Cup: 1931 * 3 × Austrian Champion: 1931, 1933, 1938 * 2 × Austrian Cup: 1929, 1930 * 3 matches for the Austrian national football team ==References== ==Other websites== * Josef Adelbrecht im Rapidarchiv (German) * Josef Adelbrecht im Austriaarchiv (German) Category:1910 births Category:1941 deaths Category:Association football forwards Category:Austrian footballers Category:Players of the Austrian national football team Category:SK Rapid Wien players Category:Austrian football forwards Category:Austrian football champions",
 "title": "Josef Adelbrecht"
}