{
 "id": "1011444",
 "text": "Güzel İstanbul is a sculpture made of concrete, located in Yıldız Park in Istanbul, Turkey. The statue shows a naked woman and was created by an artist named Gürdal Duyar. In 1973, the Istanbul Municipality asked artists to create 20 sculptures to celebrate the 50th anniversary of the Turkish Republic. Güzel İstanbul is one of these sculptures, and it shows a naked woman to represent the city. The base of the sculpture has pictures that represent the history of Istanbul. Originally, Güzel İstanbul was placed at Karaköy Square. But some conservative politicians and media outlets said it was offensive and wanted it taken down. In March 1974, the sculpture caused a big argument in the government. After nine days of debate, Güzel İstanbul was removed and damaged on March 18th. It was left in Karaköy Square for over a month. Eventually, on May 2nd, the statue was moved to Yıldız Park and put back up on a temporary base. It still remains in Yıldız Park today, but nobody has fixed the damage done to it. == Commission == In 1972, the governor's office in Istanbul created a group called the Board for the Celebration of the 50th Anniversary of the Republic. The board was made to plan for the anniversary which would happen in the next year. The Istanbul Metropolitan Municipality, the Istanbul Fine Arts Academy, and the State College of Fine and Applied Arts worked together to make the Fine Arts Committee. This committee was part of the Board for the Celebration of the 50th Anniversary of the Republic. The committee included Şadi Çalık, Mustafa Aslıer, and Hüseyin Gezer. They asked 50 artists to make sculptures to celebrate the anniversary. The sculptures were put in many places around Istanbul, like parks and squares. There was not enough money to make 50 sculptures, so the number was changed to 20. The Board also made the qualifications to be a sculptor stricter. They only picked artists who lived in Istanbul and who had either won a state award or were well-known in the art world. This meant 30 artists were not able to participate. The artists that did participate included Kuzgun Acar, Tamer Başoğlu, Zerrin Bölükbaşı, Ali Teoman Germaner, Yavuz Görey, Zühtü Müritoğlu, Füsun Onur, Kamil Sonad, Nusret Suman, Seyhun Topuz and Gürdal Duyar. The Fine Arts Committee did not tell the artists what kind of sculpture to make, so they could create something in their own unique style. The committee wanted the sculptures to be diverse and represent the different styles of sculpture in Turkey at the time. The artists were also not told where their sculptures would be placed. They could be put in a park, a square, or on the side of a road. The artists had to submit their ideas for the sculpture they wanted to make to the State Art and Sculpture Museum by 20 August 1973. Gürdal Duyar submitted a sketch of a nude female figure which he named \"Beautiful Istanbul\" (Güzel İstanbul in Turkish) as his proposal. The board approved his proposal during a meeting attended by local government officials, and selected Karaköy Square as the location for the sculpture. The design and nudity of the sculpture were not considered problematic at any point during the selection process. The sculpture is also known as Ah Güzel İstanbul (\"Oh Beautiful Istanbul\"). == Design == Gürdal Duyar's idea was to symbolize Istanbul through a sculpture of a naked woman whose arms were tied by a chain, which represented the defensive chain put up by the Byzantine Empire in 1453 to block the Ottoman fleet from entering the Golden Horn. The woman in the sculpture was trying to break free from the chains, which was supposed to represent the Ottoman conquest of Constantinople, which was later renamed Istanbul. Duyar explained that he associated his hometown, Istanbul, with the natural beauty of the female form. In Duyar's final design, the female figure is depicted leaning slightly backwards with her arms wrapped behind her, and her head inclined backwards as she gazes at the sky. Her hands are bound by a chain, which is not visible from the front. The upper part of the sculpture sits on a decorated plinth adorned with reliefs of pomegranates, figs, honeysuckle, and a bee. According to Duyar, the pomegranates represent Istanbul's many legends, figs represent its divinity, honeysuckle represents its air, and the bee represents its population density, dynamism, and abundance. Apart from its historical and political significance, Duyar's work has also been interpreted as a universal representation of women's liberation. The sculpture, which used 7,000 kilograms (15,000 lb) of poured concrete, was 4.8 meters (15.7 ft) tall when it was first installed. == Erection and removal == On March 10, 1974, Güzel İstanbul was installed in Karaköy Square, which is an open and busy area located near the northern end of Galata Bridge in Istanbul. The sculpture received a lot of attention and caused controversy. According to Ahu Antmen, the controversy was caused by the sculpture's placement in a crowded area. On the other hand, Onat Kutlar believed that the controversy was due to the sensuality or realism present in Duyar's sculptures, including Güzel İstanbul. === Güzel İstanbul Affair === Before Duyar's sculpture, there were other nude sculptures displayed in public areas of Istanbul, and at that time, the Istanbul State Art and Sculpture Museum had numerous nude sculptures on display without any controversy. It has been suggested that the officials who commissioned Duyar's sculpture did not expect its nakedness to be a source of controversy. However, after the sculpture was installed in Karaköy Square, it faced immediate backlash and calls for its removal from politicians who perceived it to be indecent, particularly members of the National Salvation Party, who were part of the coalition government at the time. This sparked a public debate that was fueled by prominent Turkish political figures and covered by major media outlets, which is now known as the Güzel İstanbul Affair. A media campaign against Güzel İstanbul started shortly after it was installed in Karaköy Square. For ten days, various newspapers described the sculpture as indecent and erotic. One newspaper, Sabah, even printed a front-page article on 21 March 1974 that accused the sculpture of corrupting the morals of Muslim Turks. This led to the sculpture becoming a topic of discussion in the government. Deputy-Prime Minister Necmettin Erbakan called the sculpture immoral and suggested its removal on 17 March. The Minister of the Interior, Oğuzhan Asiltürk, said that the sculpture was disgraceful to Turkish mothers and should be removed. The mayor of Istanbul, Ahmet İsvan, said he disliked the sculpture because he found it tasteless, not because it was a nude. The Governor of Istanbul, Namık Kemal Şentürk, stated that he could not judge the sculpture on an artistic level, but that it had been placed in the wrong location and thus had it removed. The controversy over Güzel İstanbul led to a heated debate, with some Republican intellectuals and others defending the sculpture and arguing for its right to remain. However, the controversy also had political implications, almost leading to the collapse of Turkey's newly formed governing coalition. The CHP, the other party in the coalition, supported the National Salvation Party's position that the sculpture was indecent in order to avoid political conflict, despite this going against their own ethical values. Some scholars, such as Hüseyin Gezer, defended the sculpture, stating that there is a difference between a naked woman and a nude sculpture. === Removal and public backlash === On the night of 18 March 1974, nine days after its installation, Güzel İstanbul was removed from Karaköy Square. In a midnight intervention, the sculpture was broken off its base and damaged: its arm was broken off. It was removed from the park and placed on a pile of sand near the Kumkapı municipal construction site. The front page of the newspaper Milliyet showed a photograph of people standing on top of the empty plinth on the night the sculpture was removed, as well as the rubble resulting from the plinth's destruction. An article in the newspaper Sabah stated the goal of their campaign to have the sculpture removed had been accomplished. This was countered by articles in the newspapers Milliyet and Cumhuriyet, which described the sculpture's right to remain as a necessity for democracy. Some Turkish intellectuals reacted to the events. Burhan Felek criticized the removal, saying a sculpture should not be removed just because a minister does not like it, and that there is not a referendum of beliefs for every issue. Melih Cevdet Anday criticized the government for choosing what the people should and should not like. Hıfzı Veldet Velidedeoğlu stated dominance of the mentality that puts forward religious conservative traditions in the context of fine arts would regress Turkey to a desert of bigotry. Güzel İstanbul was also defended by cartoonists and caricaturists such as Erdoğan Bozok, Altan Erbulak, Nejat Uygur, Yalçın Çetin, Ferruh Doğan, and Nehar Tüblek, who made cartoons commenting on its removal. One of the cartoons showed those that removed the sculpture as backwards and outdated, another criticized the politicization of art, and another criticized censorship; and others asked why fake issues were being made in the news. Cartoonists and artists who opposed the removal wanted to protesting it by covering all sculptures in Istanbul in black cloth but they cancelled their protest. The removal from Karaköy Square was seen as being against freedom of expression in art; to protest this, the Association of Turkish Sculptors organized an exhibition around the theme of nudity to show that the creative will of artists would continue. Many sculptors participated in the show, including Füsun Onur. The debate about Güzel İstanbul spread beyond Istanbul; provinces Manisa and Zonguldak offered to have Güzel İstanbul moved to their cities. Güzel İstanbul was one of 20 sculptures of which many others were damaged or removed. === Charges === On 20 March 1974, the Istanbul Public Prosecutors Office, considering the articles published about the sculpture in newspapers as charges, opened an inquiry to decide whether the sculpture was obscene. According to a news report, if the sculpture was found to be obscene, the 50th Anniversary Committee would face prosecution under articles 426 and 576 of Turkish law. Mustafa Aslıer, a member of the committee, reflected on the events that led to the removal of Güzel İstanbul; he had been implicated in the statements and publications by the press and the MSP that led to the charges. == Relocation == On 3 May 1974, through the secret intervention of Bülent Ecevit, Güzel İstanbul was taken to Yıldız Park and left lying on its side underneath a tree. The move ended the heated political and public debate regarding the sculpture which had lasted almost two months, although Güzel İstanbul was left in an poor physical condition. In the subsequent months, photographs of the sculpture lying on its side in the park appeared; several newspapers published opinion pieces — including articles by Burhan Felek and Bedi Faik — describing the sculpture being left in this state and asking why the process was disrespectful to the artwork and the artist. The statue was eventually mounted onto a new makeshift plinth without the motifs, all of which had been destroyed. , the sculpture stands in a small corner near the park's Ortaköy entrance. According to some press accounts, it has not been well maintained; parts of its concrete are crumbling and its inner structure is exposed. == Later events == Gürdal Duyar, the sculptor of Güzel İstanbul, said little about the statue's fate and did not participate in the controversy. In 1995, Turkish journalist Nebil Özgentürk asked Duyar about the repeated removals of the artist's work. Duyar said his role as the artist was limited to creation of sculptures, adding: \"Our job is making sculptures; removing, breaking or changing their location is a different area of expertise\". In 2017, the Istanbul Municipality hid the sculpture by surrounding it with a fence made of saplings after parents had complained about it being visible from a nearby playground. After news of this censorship spread, a campaign on social media criticized the censorship and succeeded in having the saplings removed. == References == === Notes === === Citations === === Bibliography === * * * * * * * * * * * * * * * * * * * * * * * == Other websites == * Güzel İstanbul documentary Hiç Bilmiyordum, Season 2. Episode 8. – via GAİN (subscription required) * Güzel İstanbul, Beşiktaş Kültür Sanat – via Beşiktaş Municipality Category:Istanbul Category:Sculpture",
 "title": "Güzel İstanbul"
}