{
 "id": "1012422",
 "text": "Jörn Bjerregaard (born 19 January 1943) is a retired Danish footballer and coach. ==Career== He started his career at Aarhus GF at the age of 12. Aarhus was Denmark's top team in the 1950s. In addition to football, he began studying economics, which he ended prematurely in the mid-1960s in favor of sports. In 1962 he made his debut for Aarhus in the first Danish league. He scored 13 goals in his first season. This made him to the club's second-best goalscorer. In 1965, Bjerregaard won his first title by winning the cup. 1966 he went to Austria and signed a contract with SK Rapid Wien. This was his first professional contract, since a professional league was not introduced in Denmark until 1978. In his first game for Rapid he scored three goals against Kapfenberger SV and three in the first round of the European Cup against Galatasaray Istanbul. In the 1971/72 season he had problems with the new coach Ernst Hlozek. So he went to SC Eisenstadt. After 23 goals in his first season for Eisenstadt, he played as midfielder the following year . At the age of 32 he ended his career as defender. The reason for the end of his career was physical problems. ==International career== Between 1962 and 1966 he played five matches for the Danish U-21 national team. Bjerregaard never played in an official game for the Danish national football team.National team matches He became a professional player when he switched to Rapid and Denmark was an amateur team. ==Managing career== In 1976, Bjerregaard became coach of his first club Aarhus GF. In this season Aarhus was promoted to the 1st division After this resigned and returned to Austria. ==Personal== Bjerregaard's son, Carsten Bjerregaard, was also a professional footballer. He played for Vienna and Admira Wacker in the Austrian Bundesliga between 1990 and 1995.Rapid Archiv ==Honours== *Austrian champion: 1967, 1968 *Austrian Cup: 1968, 1969, 1972 *Austrian footballer of the year: 1968, 1970 *Austrian top scorer: 1968 *Danish Cup: 1965 ==References== ==Other websites== * Rapid Archiv * Sturm Archiv Category:1943 births Category:Living people Category:Association football forwards Category:SK Rapid Wien players Category:Danish football managers Category:Austrian Football Bundesliga top scorers Category:Austrian football champions",
 "title": "Jörn Bjerregaard"
}