{
 "id": "1012762",
 "text": "The names of China are expressed differently in different languages and different times. Some of these names come from ancient times, while others are from modern times. In Chinese, the name of China is Zhōngguó (/, \"central country\") in its national language, Standard Mandarin. China, while the name in English for the country, came from Portuguese in the 16th century. This became common usage in the West in the subsequent centuries. It is believed to come from Middle Persian. Though some people thought it traced further back to Sanskrit. Some also thought that the ultimate source of the name China is the Chinese word \"Qin\" (), the name of the dynasty of China. However, others have different opinions. In addition to these names, names of China also include Zhōnghuá (/, \"central beauty\"), Huáxià (/, \"beautiful grandness\"), Shénzhōu (, \"divine state\") and Jiǔzhōu (, \"nine states\"). Hàn (/) and Táng () . The People's Republic of China () and Republic of China () are the official names for the two sovereign states now claiming sovereignty over the traditional area of China. \"Mainland China\" is used to refer to areas under the control of the PRC, usually not including Hong Kong and Macau. Zuozhuan \"Duke Min - 1st year - zhuan \" quote: \"諸夏親暱不可棄也\" translation: \"The various Xia are close intimates and can not be abandoned\"Zuozhuan \"Duke Xiang - 4th year - zhuan \" quote: \"諸華必叛\" translation: \"The various Hua would surely revolt\"Du Yu, Chunqiu Zuozhuan - Collected Explanations, \"Vol. 15\". p. 102 of 162 quote: \"諸華中國\" There are also names for China used around the world. \"Cathay\" from the Khitan language and \"Tabgach\" from Tuoba are examples. == List of derived terms == * Afrikaans: Sjina, spelling now obsolete and spelled as China (pronunciation is the same) () * Albanian: Kinë () * Amharic: Chayna (from English) * Armenian: Չինաստան () * Assamese: (pronounced [sin]) * Azeri: Çin () * Basque: Txina () * Bengali: () * Burma: တရုတ် () * Catalan: Xina () * Chinese: Zhīnà (obsolete and considered offensive due to historical Japanese usage; originated from early Chinese translations of Buddhist texts in Sanskrit) * Chinese: Zhèndàn transcription of the Sanskrit/Pali \"Cīnasthāna\" in the Buddhist texts. * Czech: Čína () * Danish: Kina () * Dutch: China () * English: China * Esperanto: Ĉinujo or Ĉinio, or Ĥinujo (archaic) * Estonian: Hiina () * Filipino: Tsina () * Finnish: Kiina () * French: Chine () * Galician: China () * Georgian: ჩინეთი () * German: China ( and , in the southern part of the German-speaking area also ) * Greek: Κίνα (Kína) () * Gujarati: Cīn (IPA ) * Hindustani: Cīn or (IPA [ˈtʃiːn]) * Hungarian: Kína () * Icelandic: Kína () * Indonesian: Cina () * Interlingua: China * Irish: An tSín () * Italian: Cina () * Japanese: Shina () – considered offensive in China, now largely obsolete in Japan and avoided out of deference to China (the name Chūgoku is used instead); See Shina (word) and kotobagari. * Javanese: Cina (low speech level); Cinten (high speech level) * Kapampangan: Sina * Khmer: () * Korean: Jina (; ) * Latvian: Ķīna () * Lithuanian: Kinija () * Macedonian: Кина (Kina) () * Malay: Cina () * Malayalam: Cheenan/Cheenathi * Maltese: Ċina () * Marathi: Cīn (IPA [ˈtʃiːn]) * Nepali: Cīn (IPA ) * Norwegian: Kina () * Pahlavi: Čīnī * Persian: Chīn () * Polish: Chiny () * Portuguese: China () * Romanian: China () * Russian: Китай (Kitai) () * Serbo-Croatian: Kina or () * Sinhala: Chinaya චීනය * Slovak: Čína () * Spanish: China () * Somali: Shiinaha * Swedish: Kina () * Tamil: Cīnam () * Thai: ( ) * Tibetan: Rgya Nag () * Turkish: Çin () * Vietnamese: Chấn Đán (震旦) ( or Chi Na (支那) () (in Buddhist texts). * Welsh: Tsieina () * Yiddish: כינע Khine () == References == Category:Geographical naming disputes",
 "title": "Names of China"
}