{
 "id": "1013702",
 "text": "\"Four Seasons in One Day\" is a 1992 song by Crowded House. It is from their third studio album Woodface. It went to number 26 in the United Kingdom, number 33 in New Zealand, number 47 in Australia, number 50 in the Netherlands and number 68 in Canada. It did not chart in the United States. ==Track listings== UK 7-inch and cassette single # \"Four Seasons in One Day\" – 2:48 # \"There Goes God\" – 3:50 UK CD single # \"Four Seasons in One Day\" – 2:48 # \"Dr. Livingston\" – 3:57 # \"Recurring Dream\" – 3:24 (remix from \"Tequila sunrise soundtrack) # \"Anyone Can Tell\" – 3:36 Track 2; outtake from the Woodface sessions later to be released on \"Afterglow\", track 3: remix version from \"Tequila sunrise\" soundtrack, track 4; outtake from the Woodface sessions\" previously released on the \"Chocolate Cake\" CD single and later to be released on \"Afterglow\". Alternate UK CD single \"Weather with You\" and \"Italian Plastic\" were recorded at The Town & Country Club, London, 9 November 1991. \"Message to My Girl\" was recorded live at the Birmingham Town Hall on 5 March 1992 and not previously recorded by Crowded House. # \"Four Seasons in One Day\" – 2:48 # \"Weather with You\" (live) – 6:17 # \"Italian Plastic\" (live) – 3:28 # \"Message to My Girl\" (live) – 3:05 Australian CD \"There Goes God\" was recorded in Maastricht, Netherlands. # \"Four Seasons in One Day\" – 2:48 # \"There Goes God\" (live) # \"Tall Trees\" – 2:19 Australian extended single \"Italian Plastic\" was recorded at the State Theatre, Sydney. \"Love You til the Day I Die\", \"It's Only Natural\" and \"Four Seasons in One Day\" were recorded at the Newcastle Civic Theatre, Australia. # \"Four Seasons in One Day\" – 2:48 # \"Italian Plastic\" (live) – 3:34 # \"Love You till the Day I Die\" (live) – 4:50 # \"It's Only Natural\" (live) – 4:27 # \"Four Seasons in One Day\" (live) – 2:59 ==References== Category:1992 songs Category:Crowded House songs",
 "title": "Four Seasons in One Day"
}