{
 "id": "1013747",
 "text": "The Kurds are an Iranic ethnic group in the Middle East. They live in the mountainous areas to the south of Lake Van and Lake Urmia, a geographical area collectively referred to as Kurdistan. Most Kurds speak Northern Kurdish Kurmanji and Central Kurdish (Sorani). == Shaddadids == The Shaddadids were a Kurdish dynasty that ruled in Armenia and Arran between 951 and 1174. It was between the Kura and Araxes rivers. They dominated a large part of the Caucasus until the Seljuk ruler Toghrul came to the region.KHACHATRyAN, A. A. (1979), Nijnetalinskaya Arabskaya Nadpis 570/11'74 Goda, PatmaBanasirakan Handes, IV, page. 1 88-198.The dynasty was first established in Dvin, and it also dominated Barda and Ganja. The Shaddadis army organized expeditions against the Bagratuni dynasty and the Khazars from 1020 onwards. Fadl I successful in the beginning, but on his way back from a successful campaign in 1030, he met Georgian and Armenian forces and was defeated. They fought against the Byzantine army between 1047 and 1057. Then the influence of the Shaddadis in the region dwindled. From 1067 onwards, the Shaddadis dynasty was occupied by the Seljuks. It continued as a dependent dynasty until 1174.Shaddadids, C.E. Bosworth, The Encyclopedia of Islam, Vol.IX, page 169.Andrew C. S. Peacock, Nomadic Society and the Seljūq Campaigns in Caucasia, page 216. The cities of Ani and Tbilisi were given as gifts due to his service to the Seljuks.Caucasica in the History of Mayyāfāriqīn, V. Minorsky, Bulletin of the School of Oriental and African Studies, Cilt 13, No. 1, 1949, Cambridge University Press, p. 29. === Rawwadids === Originally of Azdi Arab descent,The Encyclopaedia of Islam: MAH-MID the Rawadids ruled Tabriz and northeastern Adharbayjan in the late 8th and early 9th centuries. === Marwanids === The Marwanids were a Kurdish dynasty in the Diyar Bakr region of Upper Mesopotamia and Armenia. The founder of the Marwanids, Bad or Baz was a shepherd, took up arms and became a war chief. He was popular. From the middle of the tenth century he made conquests in Eastern Anatolia. He first came from the south and took Erciş and the fortified positions around it. Baz strengthening his influence, captured Diyarbakir (Amid) and Silvan and Nusaybin, which were under the control of the Buyids.Catherine Holmes, Basil II And the Governance of Empire, 976-1025, (Oxford University Press, 2005), 308. In 984 he defeated Samsam al-Dawla, the sultan of the Buyids, and captured Mosul.İbn Şeddâd, \"Nusaybin Tarihi\", çeviren: Doç. Dr. Hüseyin Güneş, Şırnak Üniversitesi İlahiyat Fakültesi Dergisi, 2018/1, cilt: IX, sayı: 19, p. 232. (in Turkish). Although he wanted to take Baghdad, he failed and had to leave Mosul. In 991, Baz, who tried to capture Mosul again, was defeated by the Hamdanids, the rulers of the city, and died in this battle. His sister's son Abu Ali Hasan ibn Marwan ascended the throne in 990.Catherine Holmes, Basil II And the Governance of Empire, 976-1025, (Oxford University Press, 2005), 309. Marwan made Mayyafariqin (Silvan) his capital. He continued to fight against the Hamdanids and defeated them twice. When Hasan ibn Marwan was assassinated in Diyarbakır in 997, he was replaced by his brother Said ibn Marwan.Marwanids, Carole Hillenbrand, The Encyclopaedia of Islam, Vol. VI, ed. C.E. Bosworth, E. van Donzel, B.Lewis and C. Pellat, (Brill, 1991), 626. The Marwanid dynasty, enjoyed considerable economic and cultural prosperity, but the Kurdish languagedoesnot appear. In 1085, the Seljuk army captured most of the region after a fierce battle. == References == == Sources == * * * * * * * * * * * * * * * * * * * * * * * * * * * Category:Kurdistan",
 "title": "History of Kurds"
}