{
 "id": "1013295",
 "text": "Scandic Hotels is a company that owns and manages hotels. It is based in Stockholm, Sweden, and mostly operates in countries like Sweden, Norway, Finland, and Denmark. They also have hotels in Germany and Poland. As of the end of 2018, the company had 11,560 employees and ran 283 hotels with 51,693 rooms for guests. They have been committed to being environmentally friendly since 1994. == History == The first hotel that started the Scandic chain was called Esso Motor Hotel. It opened in 1963 in Laxå, Sweden, and was popular because people were traveling more by car. The chain grew to 59 hotels in Europe by 1972. Esso then sold the hotels outside of Scandinavia, and the remaining 32 hotels, including five in Norway and Denmark, became the biggest hotel chain in Sweden in 1973. In 1983, a Swedish group led by Ratos bought the company and named it Scandic Hotels. Ratos became the sole owner in 1985. In 1986, they opened their first hotel outside Scandinavia in Germany. During the Gulf Crisis in 1990/91, the business was affected, and new management took over in 1992. In 1996, they bought Reso Hotels and became a publicly traded company. They expanded into Finland and Estonia in the following years. In 2001, Scandic Hotels was bought by the Hilton Group, which is based in London. Then, in 2007, a Swedish company called EQT purchased the hotel chain for 833 million euros.Scandic Hotels Corporate Information, http://www.scandichotels.com/settings/Side-foot/About-us-Container/Corporate- information/History/ . Accessed 2012-12-06. In July 2013, Scandic Hotels teamed up with Swiss Hospitality to improve its digital systems. In 2014, Scandic Hotels acquired the Rica Hotels chain, which included 72 hotels in Norway and Sweden. In December 2015, Scandic Hotels went back on the Stockholm Stock Exchange. In 2014, Scandic Hotels introduced a new brand called HTL hotels, but in June 2016, they stopped using it and turned the four hotels in Stockholm and Oslo back into Scandic Hotels. In 2017, Scandic Hotels bought 43 Restel hotels in Finland, including Cumulus and Holiday Inn, for 114.5 million euros. In March 2020, due to the Coronavirus pandemic, many Scandic employees were laid off. By April of that year, Scandic Hotels had a very low occupancy rate of only six percent, which caused them to lose over six billion in 2020. == Description == By the end of 2018, the company had 11,560 employees and ran 283 hotels with 51,693 rooms for guests. In 2018, they made a profit of SEK 1,957 million. == Sustainability== Scandic Hotels has been committed to being environmentally friendly since 1994. They teach their employees about sustainability and have eco-friendly rooms. In 2001, their breakfasts in Swedish hotels received a special ecological certificate, and by 2004, all Swedish hotels had earned the \"Swan\" ecolabel. Since 2015, Scandic Hotels has aligned with the UN's Sustainable Development Goals. They have teamed up with Too Good To Go and Karma to reduce food waste in their hotels. == References == Category:Companies based in Stockholm Category:Hotel chains",
 "title": "Scandic Hotels"
}