{
 "id": "1013829",
 "text": "The 1892 United States presidential election was the 27th presidential election in the United States. It happened on November 8, 1892. Grover Cleveland, the Democratic candidate and former President of the United States, won the election. He defeated the incumbent president, Benjamin Harrison, and the third-party candidate James B. Weaver, a former Congressman from Iowa, who ran as a member of the Populist Party. == Candidates == === Republican Party === ==== Presidential ==== * Benjamin Harrison, 23rd President of the United States from Indiana (1889-1893) (Nominee) * William McKinley, Governor of Ohio (1892-1896) (Draft Effort) * James G. Blaine, Former United States Secretary of State from Maine (1881; 1889-1892) (ran against Cleveland in 1884) (Draft Effort) * John Sherman, Senator of Ohio (1861-1877; 1881-1897) (Draft Effort) ==== Vice-Presidential ==== * Whitelaw Reid, former United States Minister to France from New York (1889-1892) (Vice-Presidential Nominee) * Thomas B. Reed, former Speaker of the United States House of Representatives from Maine (1889-1891; 1895-1899) (Nominated - Withdrawn) === Democratic Party === === Presidential === * Grover Cleveland, 22nd President of the United States from New York (1885-1889; 1893-1897) * David B. Hill, Senator of New York (1885-1889; 1893-1897) * Horace Boies, Governor of Iowa (1890-1894) ==== Vice- Presidential ==== * Adlai E. Stevenson, former Congressman from Illinois (1875-1877; 1879-1881) (Vice-Presidential Nominee) * Isaac P. Gray, former Governor of Indiana (1880-1881; 1885-1889) * Allen B. Morse, former Chief Justice of the Michigan Supreme Court (1885-1892) * John L. Mitchell, Congressman from Wisconsin (1891-1893) === Populist Party === * James B. Weaver, former Congressman from Iowa (1879-1881; 1885-1889) (Nominee) * James H. Kyle, Senator of South Dakota (1891-1901) * Leonidas L. Polk, former North Carolina Commissioner of Agriculture (1877-1880) (Co-Founder of Populist Party) (Died on June 11, 1892) * Walter Q. Gresham, Judge of the United States Court of Appeals for the Seventh Circuit (1891-1893) ==References== Category:United States presidential elections Category:1892 in North America Category:1890s in the United States",
 "title": "1892 United States presidential election"
}