{
 "id": "101363",
 "text": "E.T. the Extra-Terrestrial is a 1982 American science fiction movie produced and directed by Steven Spielberg, and written by Melissa Mathison. It follows an alien, who is stranded on Earth. A boy and his family keep it hidden from the group of government agents, while bringing it home. Filming took place from September to December 1981 on a budget of $10.5 million (equivalent to $25 million in 2019 dollars). Released on June 11, 1982, by Universal Pictures, E.T. was an immediate blockbuster, surpassing Star Wars to become the highest grossing movie that anyone had made yet—a record it held for 11 years until Jurassic Park, another Spielberg movie, surpassed it. E.T. was widely acclaimed by critics and is considered to be one of the greatest movies of all time. It was re-released in 1985, and again in 2002, to celebrate its 20th anniversary, with altered shots and additional scenes. ==Cast== * Henry Thomas as Elliott, a ten-year-old boy who forms a bond with E.T.. * Robert MacNaughton as Michael, Elliott's brother. * Drew Barrymore as Gertie, Elliott's sister. * Dee Wallace as Mary, Elliott's mother. She does not notice the alien's presence in her household. * Peter Coyote as \"Keys\", one of the government agents. * K. C. Martel, Sean Frye and C. Thomas Howell as Greg, Steve and Tyler, Michael's friends. * Erika Eleniak as the girl whom Elliott kisses. Having worked with Cary Guffey on Close Encounters of the Third Kind, Spielberg felt confident in working with a cast of mostly child actors. The major voice work for E.T. was Pat Welsh, an elderly woman who lived in Marin County, California. Welsh smoked two packets of cigarettes a day, which gave her voice a quality that sound effects creator Ben Burtt liked. Burtt also recorded 16 other people and various animals to create E.T.'s \"voice\". These included Spielberg; Debra Winger; Burtt's sleeping wife, who had a cold; a burp from his USC movie professor; and raccoons, sea otters, and horses.\"The Making of E.T.: The Extra-Terrestrial\"--from the \"E.T. Signature Collection LaserDisc\", MCA/Universal Home Video, 1996 Doctors working at the USC Medical Center were recruited to play the doctors who try to save E.T. Spielberg felt that actors in the roles, performing lines of medical talking, would come across as unnatural. ==Reception== The movie was first shown at the closing gala of the 1982 Cannes Film Festival. It started in the United States on June 11, 1982. It opened at number one with a gross of $11 million. The movie was re-released in 1985 and 2002. On September 17, 1982, the movie was shown at the United Nations, and Spielberg received the U.N. Peace Medal. The movie was nominated for nine Oscars at the 55th Academy Awards, including Best Picture. Gandhi won that award, but its director, Richard Attenborough, declared \"I was certain that not only would E.T. win, but that it should win. It was inventive, powerful, [and] wonderful. I make more mundane movies.\" It won four Academy Awards: Best Original Score, Best Sound, Best Sound Effects Editing, and Best Visual Effects. At the 40th Golden Globe Awards, the movie won Best Picture in the Drama category and Best Score; it was also nominated for Best Director, Best Screenplay, and Best New Male Star for Henry Thomas. The Los Angeles Film Critics Association awarded the movie Best Picture, Best Director, and a \"New Generation Award\" for Melissa Mathison. The movie won Saturn Awards for Best Science Fiction Film, Best Writing, Best Special Effects, Best Music, and Best Poster Art, while Henry Thomas, Robert McNaughton, and Drew Barrymore won Young Artist Awards. Composer John Williams won a Grammy and a BAFTA for the score. It was nominated for a BAFTA Award for Best Screenplay. In 1994, E.T. was selected to keep in the U.S. National Film Registry. == References == == Other websites == * * * Asogian on Wookiepedia Category:1982 drama movies Category:1982 science fiction movies Category:1980s family movies Category:1980s American drama movies Category:American family drama movies Category:American science fiction movies Category:1980s English- language movies Category:Golden Globe Award winning movies Category:Movies composed by John Williams Category:Movies directed by Steven Spielberg Category:Saturn Award winning movies Category:United States National Film Registry movies Category:Universal Pictures movies Category:Movies about extraterrestrial life Category:Movies set in California Category:Movies set in the 1980s Category:Movies about mother–son relationships Category:Movies that won the Best Visual Effects Academy Award",
 "title": "E.T. the Extra-Terrestrial"
}