{
 "id": "1013725",
 "text": "Middle Eastern music is a form of art created in the region named Middle East. Rhythm is key in the Middle East, think about Quranic texts, prayercalls, and everyday conversations. Its characteristics are the use of quarter tones and the lack of chords. Middle Eastern music uses a lot of different instruments. A characterizing instrument is the qanun, a zither instrument. Other instruments are the oud, and the saz, both string instruments, similar to a guitar.Rhythmic cycles and structures in the art music of the Middle East. Zeynep Helvacı, Jacob Olley, Ralf Martin Jäger, Universität Münster. Würzburg. 2017. ISBN 978-3-95650-172-2. OCLC 982053847 == Musical terms == These musical terms will come often in this page. A short guide with definitions of these terms could be useful. Scale = a collection or group of musical notes that are organized in a specific order. It gives music its characteristic sound in a particular culture. Mode = a collection of notes that are related to a central note, and together they create a specific type or style of music. They determine the rules and conditions for playins this music.Rhythm = Arrangement of sounds and pauses that form a song's beat. It sets the pace and makes you feel the groove. It controls the length and timing of each sound. Beat = The basic unit of time in music. A constant, regular pulse that repeats throughout a piece.Wallace, Berry (1976/1986). Structural Functions in Music. p. 349\\. ISBN 0-486-25384-8 Musical tone = A steady periodic sound. Pitch = The position of a sound in the full range of sounds. How high or low a sound is. Chords = combination of three or more notes, with a harmonic pitch. Instrument = Anything that is used to produce a musical sound. Genre = Category that groups music together based on shared traditions and conventions. == History == The main religion in the Middle East is Islam. There is very little ceremonial music as music is seen as problematic in Islam. Rhythms are used for to recite the Qu'ran but not music itself. Rhythmic modes are used in Islamic music, these modes are called īqāʿāt in Arabic. Folk music and art music are similar and common in the Middle East. Music was already known in the pre-islamic society. Musicians at that time had a high rank in society. The Muezzin is the person that calls for the daily prayers. Prophet Muhammad would ask the Muezzin to do a call for prayers as his soothing voice was comforting. During the time of the Prophet, music was not tolerated but recitation and rhythm were commonly used. Many musicians appeared during the Umayyad and Abbasid Caliphates. Culture was exchanged: Arabs, Persians, Turks and Byzantines were coming together through music and creating new styles and forms. Later, the Islamic Empire grew even bigger. This led to more musical exchanges in Asia, Europe, Africa and Byzantium. Arab music became more and more popular over time. Today, Arab music is considered as one of the richest and most unique musical traditions. The music reflects historical interactions with various genres and types. Middle Eastern musicians continue impressing the world with their musical talent. == Turkish Music == Turkish music is a form of art created in Turkey. It was formed through Central Asian Turkic people, the Ottoman Empire and modern Western music. The music from Turkey is different from the music from other Middle Eastern countries. When you explore the heart of Turkish music, you will find two main genres: classical and folk music. The key elements of Turkish music include being experimental, melodic, and easy to understand. Turkish music is characterized by unique scales and rhytmic patterns. Just like Middle Eastern music, Turkish music also uses a lot of instruments. The instruments are the oud, the saz, the ney (type of flute), the kemenche (string instrument that is bowed), and the darbuka (a type of hand-drum). === Classical === Turkish classical music is called \"Klasik Türk Musikisi\" in Turkish. It is a genre on its own under Turkish music. It has the human voice as its basis. The classical music of Turkey is based on a scale. This scale has seven notes and a specific pattern of breaks between each note. This system of notes and breaks is called makam in Turkish, which is essential for Turkish classical music. There are different makamlar (plural of makam) and they each have their own set of rules. The scale covers a wide range of musical pitches, because of the wide range of high and low notes. This wide range of high and low notes is referred to as \"two and a half octaves\" in the music world. Also important is singing. Skilled vocalists, which are called sanatkar, are known for their ability to give rise to emotions of the lyrics.KAÇAR, Gülçin YAHYA. \"TRACES OF MUSIC FROM DIFFERENT CULTURES IN TURKISH MUSIC.\" (2022). Reading about Turkish Classical music is helpful, but hearing it can be too. Clicking on the name of the video will give a chance to listern to Turkish Classical music. The video is called \"Yaşar Kurt - Yaz Günleri\". === Pop === Turkish pop music was born in the 1950's. It started with the making of covers of popular styles from other countries. \"Hafif-batı\" means \"light western\" and refers to these imported songs. Later, Turkish artists began writing their own songs and develop their own style. Turkish pop music has been influenced by the West, yet it continues to promote national values. Turkish ordinary music is said to be multicultural as it mixes Western cultures with Eastern cultures. Turkish pop songs promote modern sounds as well as traditional sounds. Names that are big in this genre are: Tarkan, Hadise, Aleyna Tilki and Mustafa Sandal. Reading about Turkish Pop music is helpful, but hearing it can be too. Clicking on the name of the video will give a chance to listen to Turkish pop music. The video is called \"Mustafa Sandal - Araba\". === Rock === Turkish Rock is also known as \"Anatolian Rock\". This is a genre under Turkish music. Lund, Holger. \"Anatolian Rock: Phenomena of Hybridization.\" Beitrag im Rahmen der Tagung „This Is The Modern World–For A Social History Of Rock Music “, Université Charles-de-Gaulle Lille 3 (2013). This genre is a mix of Turkish folk music and Western rock. Atatürk, founding father of Turkey, wanted to make Turkey more like the West (more European and American). Thus, music also became more like that of the West, but still with some Ottoman elements. It combines Turkish and Western elements in language, instruments, rhythm, melody, and harmony. Lund H.(2013) “ Holger Anatolian Rock: Phenomena of Hybridization” Norient Network for Local and Global Sounds and Media Culture Magazine. Seen as Western elements, instruments like the electric guitar, bass guitar and drums are used. Names that are big in this genre are: Barış Manço, Erkin Koray and Selda Bağcan. Reading about Turkish Rock music is helpful, but hearing it can be too. Clicking on the name of the video will give a chance to listen to Turkish Rock music. The video is from one of the artists mentioned above, Barış Manço. The video is called \"Barış Manço - Dönence (1982-TRT)\". == References == Category:Music Category:Middle Eastern culture",
 "title": "Middle Eastern music"
}