{
 "id": "1013919",
 "text": "Middle Eastern and North African Cinema is a term for the movie productions that have taken place in any of the Middle East and North African countries. Arab cinema includes Arabic films. In the 19th Century, the region was divided between France and the United Kingdom. They had claimed protection over the countries through agreements and deals made between them (ie. Sykes-Picot Agreement). Because these countries did not have control over their economies and their political structures it was very hard to build national film industries. Only European movies were available. Culture was also repressed, especially in the French-protected countries, which made it even harder to produce films. == The Timeline of Middle Eastern and North African Cinema == === _1896 - The First Screening of a Movie in the Region_ === The Lumière Brothers were the first film producers to present a movie to audiences in the region. They screened a movie for a selected audience in Egypt in Cairo and Alexandria. In 1896 the first movie exhibition took place within the Ottoman Empire, in Istanbul. After the success of the first screenings, in 1897 screenings took place in cities at Algeria (Algiers, Oran), at Tunisia (Tunis), at the Moroccan royal palace Fez. In 1900 screenings were taking place at Jerusalem in the Europa Hotel. All the movies that were shown were only addressing the tastes of the European colonizers. Watching movies as a form of entertainment was directed towards Europeans. There was no representation of the local cultures and there were no moves to make movies more approachable to locals. === _1896-1908 - The Creation of the First Cinemas_ === Cinemas, also known as movie theaters, were soon built. The first was built in 1896 in Algiers and, shortly after, the Lumière Brothers built the Cinematographé Lumière in Alexandria. Between 1906 and 1908 the French movie company Pathé built cinemas in Cairo and Alexandria, and in Tunis. The first cinemas, like the first screenings of movies, were not addressed towards the native people. Egypt was the first country in which movies had voice-overs in Arabic allowing native audiences to watch as well. While cinema, as a form of entertainment, was widely accepted in North Africa, in much of the Arabian Peninsula it was not because of religious reasons. === _First Productions in the region_ === Similarly to the first cinemas, the first movie productions were also in the hands of foreigners, mostly Europeans. Algeria, Egypt, and Palestine (specifically Jerusalem) attracted many European film producers who shot movies in what they called the \"Orient.\" The Lumière company and Thomas Edison were some of the production companies that shot movies there. Those film productions were dominated by Westerners. Not only were they not made for natives, but they also included very few natives in the production processes. This was not the case for the Ottoman empire. In 1911 the Manaki Brothers, who were of Balkan origins and Ottoman citizens, filmed the journey of Sultan Reşat Mehmet to different cities in Macedonia. Egypt was the first colonized country to develop a national film industry. Already in 1909, the funeral of Mustafa Kamil was filmed by an Egyptian person, and by 1920 Egyptian actors and actresses were already given main parts in movies, as well as directorial roles. === _1920s - Growth of Film Industries_ === The 1920s were important for the development of film industries in Middle East, and especially North Africa. Egypt became the center of the local film industry. Many popular short and long films were filmed in Egypt, and production companies collaborated with Egyptian actors, cameramen, and directors. The American Aunt (الخالة الأمريكانية) is a short movie produced by Bonvelli in 1920. It is one of the first to have an Egyptian actor play an important role. In 1921, the film The Country of Tutankhamun (في بلاد توت عنخ أمون) was produced by an Egyptian cameraman, Muhammad Bayyumi. In 1927 the first full-length _silent_ film, Layla, was made in Egypt and it was fully produced by a native woman, Aziza Amir, who also played the female leading role. In Egypt, in 1928, there were two full length films produced, more than other countries in the region at the time. Opinions regarding who directed Layla differ. What is known for sure is that Aziza Amir was the producer and the owner of her own production company Isis Films. In the beginning, it seems like the movie was to be directed by Wedad Orfi, who was the leading male actor; however, the movie was at the end directed by another man, Stephane Rosti. It is not known why this change happened, and it could explain why the filming process began in 1925 but was completed in 1927. In 1922 the first short film was produced in Tunisia, named Zohra, and shortly after the first long film was produced. In 1928 the first movie was produced in Syria with a native director and leading actor, and in 1929 Jordano Pidutti an Italian director, directed a film about a Lebanese immigrant in the United States. Badr and Ibrahim Lama were the first Palestinian filmmakers. They were born in Chile but moved to Egypt to produce their first film in 1927. They are significant figures of Arab cinema. === _1930s - Growth of National Cinema_ === The 1930s begin with Egypt leading another successful production of a full length silent movie, Zeinab, and with the first Iranian movie being produced, Abi and Rabi. 1932 was a groundbreaking year. The first two movies with sound were produced. For technical reasons, they had to be recorded in Paris, France. 1932 was also the year that the first movie with clear Zionist ideas emerged, Oded The Wanderer. There were big waves of immigration of Zionist Jews in the area of Palestine in the 1920s and 1930s because of the Balfour Declaration. In 1933 Herta Gargour, a Lebanese woman, financed the opening of a Lebanese production company called The Lumnar Film Company. This production company produced the first film that was fully financed by Lebanese producers, In the Ruins of Baalbek. It was also the first movie in which the Lebanese dialect of Arabic was spoken. The official start of Palestinian cinema is in 1935, when Ibrahim Hassan Sarhan filmed and produced Saudi Crown Prince Saud bin Abdulaziz‘s visit to Palestine. In 1934-35 the Studio Misr was established in Egypt. The film studio was founded by the Banque Misr, which is still a functioning bank, and under Talaat Harb a very well-known economist and co-founder of Banque Misr. Banque Misr was founded in 1920 and it had the goal of nationalizing Egypt's economy. The initiative to open their own film studio was part of Egypt's nationalization process. Harb managed to send young men abroad to learn the newest European techniques in film production and then with funding from Banque Misr acquired sophisticated equipment. The Studio Misr was a very successful project. It produced many successful movies, such as Wedad, Munyet Shababi, al-‘Azeema, Salama fi Kheir, and many more. The success of many of these movies was due to the movie touching on important social issues of the time such as poverty. Many big stars also grew through this company, such as Umm Kulthum who was already a successful singer, but started a successful acting career. Unfortunately, not all the countries saw the growth of national industries, especially those occupied by France, where native culture was repressed and only French culture was promoted. From the 1920s, especially in the 1930s many French movies were produced in Algeria, Morocco, and Tunisia. These countries were used as backgrounds due to their \"exotic\" look and the perceptions that Europeans had about the \"Orient.\" The use of these countries for their \"exotic\" features caused the reproduction of many negative stereotypes against the natives. === _1940s-1950s - Fight for Independence in the MENA Region_ === In 1941 Iran's Shah, Reza Shah, had to step down from his position to due foreign pressures. Syria started an independence movement from France. In 1943, the French granted independence to Lebanon. These independence movements increased film production in the region. In 1943, the first post-independence movie was produced in Lebanon called The Rose Seller. The same year in Turkey the first fully dubbed movie was produced, Troubled Spring. In 1944 the Centre Cinématographique Marocain was founded with the goal of producing Moroccan films. In 1946, France established Studios Africa in the Maghreb (Algeria, Tunisia, Morocco) to produce documentaries with material from the colonies. Both of these studios had the purpose of creating and sharing propaganda regarding the revolts that were taking place in French colonies. By 1946, the studios were producing films in Arabic, not only French, and they became much more approachable to the audience by producing content that discussed Islam. Nevertheless, the movies' purpose was to spread propaganda especially against resistance fighters that were requesting independence from the French. In 1948, Turkey, Iran, and Iraq saw growth in their film industries. In Iran, Esmail Kushan founded the Mitra film company which could produce sound movies. This was important because until then sound movies had to be filmed in Europe. In Iraq, Alia and Issam the first Iraqi movie was produced. In Turkey, the government decreased the tax on cinema tickets which increased the demand for films and the production of films. The State of Israel was established and in 1949, the Israeli Motion Picture Studios opened. Egypt managed to gain independence from the British in 1952 with the Free Officers overthrowing the monarch and establishing the Ministry of National Culture and Language. Just two years later, in 1954, war broke out in Algeria. Algeria demanded independence from the French colonial forces. In 1956, Egypt gets attacked by Israel during the Suez Crisis. Morocco and Tunisia are granted independence by France in 1959 as well, but not Algeria, and Spain also gives up its territories in Morocco. By 1958 the first Lebanese Civil War begins. Despite all the setbacks, film industries still managed to grow. Youssef Chahine is an important Egyptian director who always included some political commentary in his movies. He lived through very turbulent times in Egypt and he is well-known for not accepting censorship. He discussed topics such as the British occupation, Nasser's rule, Islamism, and the changing relationships between the Arab world and the Western world. One of his most important films is Jamila the Algerian, produced in 1958. This is his first film in which the message was clearly political. Another important work of his is the documentary Cairo, As Told By Chahine, released in 1991, which showed the two sides of Cairo: an opulent center of the Arab world and a city ridden by poverty and religious intolerance. In 1953 the first Turkish color film was produced by Muhsin Ertuğrul, called Carpet-weaving Girl. In Lebanon the Baalbek (Baalbeck) Studios were founded. In 1957 the first Jordanian film was produced, Struggle in Jarash. It was the first movie which was fully produced in Jordan by locals, and it was produced in Arabic. In the same year Where to? by George Nasser was the first fully Lebanese movie that was presented at the Cannes Festival. === _1960s - Independence and Resistance in National Film Industries_ === The 1960s were a decade of change in the region. This change is connected to liberation, especially in North Africa, and it, can be seen through the expansion of national film industries. Algeria gained its independence in 1962 after 8 years of war. At the time that liberation was granted, Algeria had 424 cinemas, many more than other countries of the Maghreb. Non-print sources of information were very important in Algeria when forming a national identity because of the very high illiteracy rates. The use of cinema, or radio, played such a significant role in the independence war that the French declared those mediums colonial propaganda. By 1964, Algeria had managed to nationalize its film industry with a very important figure of Algerian cinema Mohammed Lakhdar-Hamina. Algeria is home to a native group, Amazigh which speaks Berber. This group was always the most suppressed under French colonization, but it continued being suppressed even under an Algerian government. This can be seen in productions of ONCIC, an Algerian government- owned production company, where Berber languages were strictly forbidden. Palestinian cinema also grew in the 60s as a form of resistance. Mustapha Abu Ali, Hany Jawhariya, and Sulafa Jadallah established a film unit in Jordan which was owned by Fatah, which at the time was the liberation force in Palestine. It produced documentaries about the Israeli occupation of Palestine. Other organizations such as the PFLP, the PDFLP, and the PLO also started producing documentaries to spread their cause, but they couldn't be as successful as the Algerian organizations because they had no access to the occupied territories. Their films focused more on the life conditions in refugee camps and in military actions and attacks that were taking place out of the occupied territories. An example of such a documentary is the Aftermath which is a short documentary the depicts the humanitarian conditions at the refugee camps after the 1967 war with the goal of gaining humanitarian aid for the Palestinians. What was different about this documentary is that it included interviews from natives speaking Arabic which made the message stronger. However, this movie as well as many others of that time fail to address the problem behind the refugees and present the refugees as \"a problem that needs to be solved.\" Morocco gained its independence from France in 1956. The Moroccan state took no control over the cinemas. The first feature films were produced in 1968 by the national film organisation Centre Cinématographique Marocain, which was founded by colonial authorities in 1944. It is still the heart of Moroccan national cinema today. During the 60s Tunisia still struggled for independence so the movies produced in Tunisia were either French productions or films that demonstrated the struggle for independence. The Night of Counting the Years or The Mummy was produced in Egypt in 1969 by Shadi Abdel Salam and it is based on a true story. The Egyptian star Nadia Lufti who was featured in this film was an important figure in Egyptian cinema. It is considered to be one of the best Egyptian movies to have ever been produced as it marks the start for the age of realism in Egyptian cinema. Moreover, it was shot in Classical Arabic which is very uncommon for Egyptian films. === _1970s - Decade of Turmoil_ === The 1970s were a decade of instability in many of these countries. In 1970-71 the situation between Israel and Palestine evolved rapidly with thousands of Palestinians losing their life due to the Black September events. While this was a tragic escalation of the conflict, it allowed Palestinian Resistance Cinema to grow. Palestinian Resistance Cinema is different compared to other resistance cinemas because it did not change public opinion on the conflict, but it did work as a mobilization force for many Europeans as well as a unitary force between Arabs and Palestinians. These were documentary-style films that had the ultimate goal of educating and informing people. One example of such a film is With Soul, With Blood which was produced by the Palestinian Film Unit in 1971. It discusses the conflict between the army of the Jordanian king, King Hussein, and the PLO, and the attacks that followed (Black September). It was directed by Mustafa Abu Ali and it was a cornerstone for Palestinian and MENA Resistance Cinema as it made commentary on Western Imperialism in the Middle East in general. In 1976 in Lebanon, which so far was experiencing its \"golden-age\" in cinema, the second Lebanese Civil War broke out which put an abrupt end to the success of Lebanese cinema for some time. In Morocco, the film industry did not experience much growth. That is partly due to the fact that Moroccan film production was not nationalized so there was very little incentive to produce films, and partly because cinema did not seem to be that popular in Morocco. That led to many Moroccan films being very popular internationally but not in Morocco. Tunisian cinema did not grow much either, as the film industry was dominated by European and French productions. At a time more approximately 60% of all available films were European. Other countries were experiencing growth in their national film industries. In 1972, Egypt saw one of its greatest productions Watch Out for Zuzu featuring one of the greatest Egyptian actresses, Souad Hosni. In the same year, Syria organized the first International Film Festival for Young Arab Cinema in Damascus, and the Yeşilçam production in Turkey reached an average of about 300 productions annually. Algeria also experienced growth in the 70s. In 1975 Mohammed Lakhdar-Hamina produced Chronicle of the Years of Ashes, a movie about resistance and the fight for independence in Algeria. Lakhdar won the Palme D'or at the Cannes Film Festival in 1975 for the production of that film. This was the most expensive Algerian production so far, and it popularized Algerian cinema internationally. In 1978, The Nubah of the Women of Mount Chenoua was the first Algerian film directed by a woman, Assia Djebar === _1980s - National Film Industries and War_ === The 1980s inherited much turmoil from the previous decades. Lebanon was still going through Civil War (started 1976 - lasted 15 years), a new war breaks out between Iran and Iraq in 1980, Turkey went through a three year long dictatorship from 1980 to 1983, and in 1982 Israel invaded the south of Lebanon. These developments were a major setback for the film industries of the countries. The Israeli attack on Beirut affected the Palestinian film industry significantly. The PLO's headquarters were located in Beirut and many important documents, pictures, videos, etc. were stored there. The destruction of the headquarters caused a decrease in the production of Palestinian films. The loss, however, was not detrimental with a new famous movie being produced in 1987 by director Michel Khleifi. The movie Wedding in Galilee was the first fictional Palestinian movie and it was inspired by the challenges Palestinians faced living in territories controlled by the Israeli military. The war between Iran and Iraq inspired a new movie genre \"sacred defence.\" About 50 films were produced in that genre during the war. Despite the production of such films, the Iranian regime was overall against cinema. After the 1979 Islamic Revolution and in the first three years of Khomeini's rule more than 150 cinemas were destroyed throughout the country. This was because cinema and film production was seen as a way for the west to \"inject\" its values into Iran and Islamic states in general. Later on, cinema proved to be a necessary medium for the regime as it could easily spread information. The movies that could be produced from then and on had to be approved by The Ministry of Culture and Islamic Guidance (established in 1982) and had to fit in some specific \"boxes.\" By 1983, the Iranian regime seemed more keen on producing and exporting films and the Farabi Cinema Foundation was established. During the 1980s few films were produced in Iran but they were successful. In 1986 two major movies were produced that put Iran on top of film productions internationally, The Runner by Amir Naderi and Bashu, The Little Stranger by Bahram Beyzai. Three years later, the movie Where Is My Friend's House? was the first by Abbas Kiarostami, famous Iranian director. By the 1980s most film industries were well-established. Lebanon plaid a significant role in the distribution of Egyptian films internationally due its colonial connections with France. Algeria and Syria provided funds to young native film-makers but Morocco provided no resources to native film-makers and focused all its funds to foreign documentaries. Even the countries that made efforts to nationalize their film industries were missing one main factor, money. Many countries in the region were fighting for survival and depended on foreign funding. During the 1980s Palestinian productions saw a decrease because of the ongoing conflict. Despite the harsh conditions that film producers and directors had to work under they still managed to produce few influential movies. One of them was a documentary-style film Children, Nonetheless (also known as Children, Nevertheless) which came out on the UN-declared year as Year of the Child and pointed out the discrepancy between the declaration and the living conditions of Palestinian children. === _1990s - Fundamentalism and Conflict_ === The 1990s were marked by a new wave of Islamic Fundamentalism in the region, and increased violent conflicts. These two main factors had some effect on the growth of national film industries. Egypt, previously known as one of the countries with the most vibrant and successful film industries, started a \"witch-hunt\" against artists, including actors/actresses, directors, and script writers. The peak of this era of \"witch-hunts\" in Egypt was in 1994 when Youssef Chahine, arguably the most important and successful Egyptian director, got sent to court for one of the movies he produced. That movie is called The Exiled and Chahine was sent to court for it because it depicted the Prophet Joseph, which according to the religious rulings in Egypt and Islam was not allowed. Despite the court ruling that the movie should be removed from movie theaters, it remained one of the most popular and successful movies of Chahine. Despite the regime's response, in 1997 Chahine went on to create another very successful movie which challenged Islamic Fundamentalism, Destiny. Not all countries had the same response to the rise in Islamic Fundamentalism. Tunisia in 1994 saw the production of the film Beb El-Oued City, a film which demonstrated the consequences that Islamic and religious fundamentalism could have in the society. That movie made it to the Cannes Film Festival and won the International Critics' Prize by the F.I.P.R.E.S.C.I., as well as a lot of global recognition. In 1990, Iraq invaded Kuwait, and in 1991 the U.S.A. invaded Iraq starting the Gulf War. Just a year later, in 1992, Algeria gets in a 10-year-long Civil War. These conflicts put a rough end, or long pause, to the film industries of these countries. Algerian cinema, once very successful, crumbled with the cinema sector being privatized in 1993 and the government organization responsible for funding closing down by 1998. Palestinian films kept getting produced at a steady pace, and got a boost when Rashid Masharawi established the Cinema Production and Distribution Center in Ramallah in 1996. In 1995 Khleifi produced what is considered to be one of the greatest Palestinian productions, Tale of the Three Jewels. It was a successful movie internationally and it made a difference by not showing any violent scenes or scenes from war in general, but rather demonstrating the effects of the war on people, and children more specifically. In 1990 the first privately-owned television channel opened in Turkey, with the name of Magic Box Inter Star 1. This was a first for the region and it put an end to the Yeşilçam era of the Turkish film industry as many professionals started working for the TV. However, in 1996 The Bandit (Eşkiya) is the first film to be released in the _new_ cinema of Turkey, which managed to somewhat revive domestic film production. Iranian cinema flourished in the 1990s. In 1991 Rakshan Bani-Etemad became the first woman to receive the \"Best Director\" award at the Fajr Internation Film Festival in Iran. She won this award for her movie Nargess. Later, in 1997, Abbas Kiarostami won the Palme d'or at the Cannes Film Festival for the film Taste of Cherry. Also, a wider range of films were allowed to be released, because the rules for Iranian cinema become less strict. === _2000s - Inspiration Through Struggle_ === In the 2000s, regional cinema grew a lot as some directors started discussing certain taboo topics such as homosexuality and transsexuality. A film released in the year 2000, Room to rent (Khaled al- Haggar), is about an Egyptian man called Ali who is studying in London. He becomes friends with Mark, a gay photographer. This creates a fresh perspective on sexuality and socially prescribed sexual roles. The 2002 film Une minute de Soleil en moins, directed by Nabil Ayouch depicts a police inspector who starts a friendship with a transvestite. These are quite well- known examples, but other films that critique sexual repression of queer people more obviously did not reach such a wide audience. Examples are the Lebanese How much I love you by Akram Zaatari and Palestinian Tawfik Abu Wad's Diary of a Male Whore. Most national film industries grew in the 2000s, while others had a setback because of conflicts. Egypt still dominated the Arab film scene. However, it has also progressed a lot in the 21st century compared to the three decades beforehand. In the 70s, 80s and 90s cinema in the country was slowed down largely due to government film institutions being made private. Since then, more movies have been produced and have also improved in quality. In the year 2000, three Iranian movies won awards at International Film Festivals, The Apple by Samira Makhmalbaf, Djomeh by Hassan Yektepanah, and A Time for Drunken Horses by Bahman Qobadi. These movies became well-known and established Iranian cinema on the global stage. In 2004 the Palestinian Film Foundation was created in the United Kingdom to organize Palestinian cinema in the UK. The Palestinian film Paradise Now directed by Hany Abu-Assad was released in 2005. This was the first Palestinian film allowed to enter in the United States Academy Awards. The non-governmental organization Shashat was founded in Ramallah,. Its primary objective is to encourage women's filmmaking. Many young Palestinian women joined the documentary filmmaking scene in the 2000s. Three important Palestinian documentary filmmakers are Rima Essa, Suha Arraf and May Oday. All of them work and live in Palestine. The dominant themes in modern Palestinian films are \"Palestinian displacement, exile, diaspora and statelessness\". In Turkey, domestic cinema brings in more money than international films in 2008. In fact, the top ten films in terms of profit are all national films. It is the first time for this to happen since the Yeşilçam years. In post-Yeşilçam Turkey, new themes have appeared in films. Examples are \"novel interpretations of Turkification and of Turkey's relationship to digital technologies, globalization and transnationalism\". A new country that has entered the international film industry in the Middle East is the United Arab Emirates. Its first domestically produced film Dream was released in 2005 and directed by Hani Al-Shibani. It takes place in the desert, where a group of actors is moving around. Film festivals are taking place in the U.A.E., such as the Middle East International Film Festival, the Dubai International Film Festival, the Emirates Film Competition, and the Gulf Film Festival. The financial base and infrastructure to support filmmaking now exist in the Emirates, as well as film training schools. == References == Category:Middle Eastern culture Category:North Africa Category:Cinema by country",
 "title": "Middle Eastern and North African cinema"
}