{
 "id": "101364",
 "text": "Sir Alexander Chapman Ferguson (born 31 December 1941) is a retired Scottish footballer and retired manager. He has managed St. Mirren, Aberdeen, and Manchester United. He is widely considered to be the greatest football manager of all time, and has won more trophies than anyone else in the history of English football. As a player, he played as a forward. He play for multiple Scottish teams, including Dunfermline Athletic and Rangers. After retiring from playing, he started managing at East Stirlingshire. He would be hired by St Mirren, Aberdeen, and the Scotland national team, due to the death of Jock Stein. He was the manager of Scotland at the 1986 FIFA World Cup. In November 1986, he was appointed the manager of Manchester United. He won 38 trophies with Manchester United, including 13 Premier Leagues, 5 FA Cups, 4 Football League Cups, 10 FA Community Shields, 2 UEFA Champions Leagues. He Became The Only Best Coach Ever For Manchester United Dues to Everyday Winning Trophy making his team one of the best ever in premier League then.He manage the team until his retirement in year 2013. ==Playing Career== He made his debut for Queen's Park at age 16. He would score 20 goals in 31 games for Queens Park. He joined St Johnstone in 1960 to try to get regular gametime. He would score a hat-trick for St Johnstone against Rangers. He signed for Dunfermline in 1964. In the 1964-65 season, Dunfermline finished 3rd with 49 points. They finished 1 point behind Hearts and Kilmarnock. Ferguson was dropped for the 1964–65 Scottish Cup final. In that final, Dunfermline lost 3-2 against Celtic. He was the joint top scorer in the 1965–66 Scottish Division One season. He and Joe McBride both scored 31 goals. He joined Rangers in 1967, for a Scottish record of £65,000. He would only spend 2 season at Rangers, before joning Falkirk in 1969. He retired in 1974, after spending 1 season at Ayr United. He scored 171 goals in 317 games throughout his career. == Managerial Career == === Early career as manager === In June 1974, Ferguson became the manager of East Stirlingshire. A year after that, St Mirren offered Ferguson the job as their manager. Ferguson took the job. In 1974, St Mirren were playing in the second division. By 1978, Ferguson had led the club to the First Division title. St Mirren fired Ferguson from his role in 1978. === Aberdeen === Ferguson became Aberdeen manager in 1978. At that time, Aberdeen had only won the league title once. Ferguson was still a young manager. His start with Aberdeen did not go very well. Aberdeen lost the Scottish Cup semi-final and the Scottish League Cup final in his first season, and finished fourth in the league. In the 1979-80 season, Aberdeen won the Scottish league. In 1982, the team won the Scottish Cup. As a result of winning the cup, Aberdeen played in the European Cup Winners' Cup the following season (1982-83). Impressively, Aberdeen beat Bayern Munich on their way to the final. They faced Real Madrid in the final. Aberdeen won that game 2-1 and won the competition. In the next season, Aberdeen beat the European Cup champions Hamburger SV to win the European Super Cup. Aberdeen won the league title in 1983-84 and 1984-85 seasons and won a couple of domestic cups. He left for Manchester United in November 1986. === Manchester United === On 6 November 1986, Manchester United appointed Ferguson as their manager. The team was in the 21st position (out of 22) when he took over, but they finished 11th. Manchester United finished second in the following season, 1987-88. ==Career statistics== ===As a player=== Appearances and goals by club, season and competition Club Season League League Cup Cup League Cup League Cup Europe Europe Total Total Club Season Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Queen's Park Queen's Park 1958–59 8 4 – – 8 4 Queen's Park 1959–60 23 11 – – 23 11 Queen's Park Total 31 15 – – 31 15 St Johnstone 1960–61 – – St Johnstone 1961–62 – – St Johnstone 1962–63 – – St Johnstone 1963–64 – – St Johnstone Total 37 19 – – Dunfermline Athletic 1964–65 Dunfermline Athletic 1965–66 Dunfermline Athletic 1966–67 Dunfermline Athletic Total 89 66 Rangers 1967–68 29 19 5 0 6 2 6 3 46 24 Rangers 1968–69 12 6 1 0 4 2 3 3 20 11 Rangers Total 41 25 6 0 10 4 9 6 66 35 Falkirk 1969–70Rothmans Football Yearbook 1970–71, pp. 724, 740–741. Queen Anne Press, London. 21 15 3 3 – – Falkirk 1970–71Rothmans Football Yearbook 1971–72, pp. 563, 537. Queen Anne Press, London. 28 13 0 0 – – Falkirk 1971–72Rothmans Football Yearbook 1972–73, pp. 648–649, 683–684, 688. Queen Anne Press, London. 28 9 2 1 9 4 – – 39 14 Falkirk 1972–73Rothmans Football Yearbook 1973–74, pp. 572–573, 626–628. Queen Anne Press, London. 18 0 2 1 0 0 – – 20 1 Falkirk Total 95 37 7 5 – – Ayr United 1973–74Rothmans Football Yearbook 1974–75, pp. 570–571, 642–644. Queen Anne Press, London. 24 9 4 1 0 0 – – 28 10 Ayr United Total 24 9 4 1 0 0 – – 28 10 Career total Career total 317 171 6 0 ===As a manager=== Managerial record by team and tenure Team From To Record Record Record Record Record Team From To East Stirlingshire June 1974 October 1974 St Mirren October 1974 May 1978 Aberdeen June 1978 6 November 1986 Scotland 1 October 1985 30 June 1986 Manchester United 6 November 1986 19 May 2013 Total Total Total — ==Honours== ===Player=== St Johnstone * Scottish Division Two: 1962–63 Falkirk * Scottish Division Two: 1969–70 Individual * Scottish Division One top scorer: 1965–66 ===Manager=== St Mirren * Scottish First Division: 1976–77 Aberdeen * Scottish Premier Division: 1979–80, 1983–84, 1984–85 * Scottish Cup: 1981–82, 1982–83, 1983–84, 1985–86 * Scottish League Cup: 1985–86 * Drybrough Cup: 1980 * European Cup Winners' Cup: 1982–83 * European Super Cup: 1983 Manchester United * Premier League: 1992–93, 1993–94, 1995–96, 1996–97, 1998–99, 1999–2000, 2000–01, 2002–03, 2006–07, 2007–08, 2008–09, 2010–11, 2012–13 * FA Cup: 1989–90, 1993–94, 1995–96, 1998–99, 2003–04 * Football League Cup: 1991–92, 2005–06, 2008–09, 2009–10 * FA Charity/Community Shield: 1990 (shared), 1993, 1994, 1996, 1997, 2003, 2007, 2008, 2010, 2011 * UEFA Champions League: 1998–99, 2007–08 * European Cup Winners' Cup: 1990–91 * European Super Cup: 1991 * Intercontinental Cup: 1999 * FIFA Club World Cup: 2008 Individual * LMA Manager of the Decade: 1990s * LMA Manager of the Year: 1998–99, 2007–08, 2010–11, 2012–13 * LMA Special Merit Award: 2009, 2011 * Premier League Manager of the Season: 1993–94, 1995–96, 1996–97, 1998–99, 1999–2000, 2002–03, 2006–07, 2007–08, 2008–09, 2010–11, 2012–13 * Premier League Manager of the Month: August 1993, October 1994, February 1996, March 1996, February 1997, October 1997, January 1999, April 1999, August 1999, March 2000, April 2000, February 2001, April 2003, December 2003, February 2005, March 2006, August 2006, October 2006, February 2007, January 2008, March 2008, January 2009, April 2009, September 2009, January 2011, August 2011, October 2012 * UEFA Manager of the Year: 1998–99 * UEFA Team of the Year: 2007, 2008 * Onze d'Or Coach of the Year: 1999, 2007, 2008 * IFFHS World's Best Club Coach: 1999, 2008 * IFFHS World's Best Coach of the 21st Century: 2012 * Laureus World Sports Award for Team of the Year: 2000 * BBC Sports Personality of the Year Coach Award: 1999 * BBC Sports Personality Team of the Year Award: 1999 * BBC Sports Personality of the Year Lifetime Achievement Award: 2001 * World Soccer Greatest Manager of All Time: 2013 * ESPN Greatest Manager of All Time: 2013 * France Football 2nd Greatest Manager of All Time: 2019📸 France Football ranks the 50 greatest managers of all-time - OneFootball * FourFourTwo Greatest Manager of All Time: 2020FourFourTwo have ranked the 100 greatest managers of all-time | GiveMeSport * BBC Sports Personality Diamond Award: 2013 * English Football Hall of Fame (Manager) : 2002 * Scottish Football Hall of Fame: 2004 * European Hall of Fame (Manager): 2008 * FIFA Presidential Award: 2011 * Premier League 10 Seasons Awards (1992–93 – 2001–02) ** Manager of the Decade ** Most Coaching Appearances (392 games) * Premier League 20 Seasons Awards (1992–93 – 2011–12) ** Best Manager * FWA Tribute Award: 1996 * PFA Merit Award: 2007 * Premier League Merit Award: 2012–13 * Mussabini Medal: 1999 ===Orders and special awards=== * Officer of the Order of the British Empire (OBE): 1985 * Commander of the Order of the British Empire (CBE): 1995 * Knight Bachelor (Kt.): 1999 * Freedom of the City of Aberdeen: 1999 * Freedom of the City of Glasgow: 1999 * Freedom of the City of Manchester: 2000 * Freedom of the Borough of Trafford: 2013 ===Honorary degrees=== Ferguson has received at least eight honorary degrees. These Include: Country Date University Degree 1996 University of Salford Master of Arts (MA)http://www.salford.ac.uk/__data/assets/pdf_file/0005/1060871/Honorary-Graduates-as-at-20161013.pdf December 1997 Robert Gordon University Doctor of Laws (LL.D) 2001 Glasgow Caledonian University Doctorate 2002 University of St Andrews Doctorate 2009 Manchester Metropolitan University Doctor of Business Administration (DBA) 29 June 2011 University of Stirling Doctor of the University (D.Univ) 12 October 2011 University of Manchester Doctorate 2014 University of Ulster Doctor of Science (D.Sc) ==References== ==Other websites== * Sir Alex Ferguson's Manchester United Managerial Record at mufcinfo.com * * * Scottish Football Hall of Fame profile * Aberdeen Manager profile at AFC Heritage Trust Category:1941 births Category:Living people Category:Footballers from Glasgow Category:Association football forwards Category:Scottish football managers Category:Commanders of the Order of the British Empire Category:Knights Bachelor Category:Manchester United F.C.",
 "title": "Alex Ferguson"
}