{
 "id": "1014966",
 "text": "Geoffrey Everest Hinton One or more of the preceding sentences incorporates text from the royalsociety.org website where: (born 6 December 1947) is a British-Canadian cognitive psychologist and computer scientist. He is known for his work on artificial intelligence (AI). He has been called the \"godfather of artificial intelligence\". From 2013 to 2023, he worked for Google (Google Brain) and the University of Toronto. In May 2023, he left Google so that he could 'freely' talk about the risks of AI. Hinton received the 2018 Turing Award for his work on deep learning. Hinton was awarded with the 2024 Nobel Prize in Physics, sharing it with John Hopfield, becoming the first person to win both the Turing and Physics Nobel awards. ==Early life== Hinton was born in Wimbledon, London. He studied at Clifton College in Bristol and King's College, Cambridge. He originally studied natural sciences, history of art, and philosophy, but graduated in 1970 with a Bachelor of Arts in experimental psychology. He continued his study at the University of Edinburgh where he was awarded a PhD in artificial intelligence in 1978. ==Career== Hinton co-wrote a highly cited paper published in 1986 that made the backpropagation algorithm for training multi-layer neural networks popular. Hinton's research focuses on using neural networks for machine learning, memory, perception, and symbol processing. He has written or co-written more than 200 peer reviewed publications. In 1985, Hinton co-invented Boltzmann machines with David Ackley and Terry Sejnowski.Ackley, David H; Hinton Geoffrey E; Sejnowski, Terrence J (1985), \"A learning algorithm for Boltzmann machines\", Cognitive science, Elsevier, 9 (1): 147–169 In May 2023, Hinton announced his resignation from Google to be able to \"freely speak out about the risks of A.I.\" He has voiced concerns about deliberate misuse by malicious actors, technological unemployment, and existential risk from artificial general intelligence. He noted that establishing safety guidelines will require cooperation among those competing in use of AI in order to avoid the worst outcomes.Erlichman, Jon, '50-50 chance' that AI outsmarts humanity, Geoffrey Hinton says, BNN Bloomberg, June 14, 2024 ==Personal life== Hinton's second wife, Rosalind Zalin, died of ovarian cancer in 1994; his third wife, Jackie, died in September 2018, also of cancer. Hinton has two children. Hinton moved from the United States to Canada because he did not like the Ronald Reagan-era politics and military funding of artificial intelligence. ==Notes== ==References== Category:1947 births Category:Living people Category:Scientists from London Category:Canadian psychologists Category:British psychologists Category:British computer scientists Category:Canadian computer scientists Category:Writers from London Category:Academics of the University of Toronto Category:Turing Award winners",
 "title": "Geoffrey Hinton"
}