{
 "id": "1014076",
 "text": "Colonel Louis Majou is a French politician born in 1764 in Mouilleron-en- Pareds ( Vendée ) and died on February, 25 1832 in Sainte-Hermine . ==Biography== Colonel Majou was born as Louis Jacques Luc Majou des Grois on November, 11 1764 in Mouilleron-en-Pareds, although his parents had resided in the nearby market town of La Couture. He was baptized as a Protestant the next day. His father was a landowner (lord of Pacaudières and Cars) and died early, leaving him an orphan at 17 years old. We know only a few elements of his life before the Revolution. Inheriting some business in La Rochelle, he probably studied law in this city, where he certainly resided during his youth. In 1792, Louis Majou was recognized enough in La Rochelle to be elected lieutenant of the free company. He took part as an infantryman in the siege of Toulon. ==Career== Enlisted in the active army, Majou follows Bonaparte to Italy. In his Memoirs, Antoine Sérieys reports that the latter, then commander of the place of Legnague, was close to being summarily executed by peasants. The scene takes place on 25 germinal year V : Sent as an emissary by General Monleau, Majou negotiates with the authorities of a village located near Florence . An Italian aimed his gun at the officer, who was saved only by the intervention of the priest. On November 30, 1799, Louis Majou was appointed battalion commander and assigned to the 11 light demi-brigade. During the Egyptian campaign, he befriended General Belliard, also from Vendée. Reformed in 1803, he was reinstated in the army with the rank of lieutenant-colonel and became aide-de-camp to Belliard in Spain . During the Russian campaign, he belonged to the cavalry staff. As such, he was made a legionary knight on the decision of Major-General Berthier de Wagram, in 1812. Placed on half pay during the first Restoration, Majou was elected deputy of Charente-Maritime on March 11, 1815 for the period of the Hundred Days. He returns to his business in La Rochelle at the end of his mandate. In April 1816, Colonel Majou took part in a subscription of officers in favor of King Louis XVIIl. He died on February 25, 1832 at La Barre in Sainte-Hermine. == References == ==Other websites== * « Louis Majou », dans Adolphe Robert et Gaston Cougny, Dictionnaire des parlementaires français, Edgar Bourloton, 1889-1891 [détail de l’édition] * Journal du colonel Majou, Louis-Jacques-Luc Majou, publié par Gaston Duval, 1899, A. Fontemoing Category:Politicians from Pays de la Loire Category:1764 births Category:1832 deaths Category:People from Vendée",
 "title": "Louis Majou"
}