{
 "id": "101481",
 "text": "The Book of Revelation, which is sometimes called Revelation to John, Apocalypse of John, or Revelation of Jesus Christ is the last book of the New Testament in the Bible. == Title == The last book of the New Testament is usually called the Book of Revelation or simply Revelation. While some of the earliest manuscripts are entitled \"The Revelation of John\" (), later manuscripts are usually entitled \"The Revelation of the Theologian\" (). For this reason, the Authorized King James Version calls Revelation the Revelation of Saint John the Divine (divine was a seventeenth century word for theologian.) In Greek, the word apocalypse means revealing or unveiling.Nestle-Aland. Novum Testamentum Graece. 27th ed. Deutsche Bibelgesellschaft, Druck: 1996, p. 632. == Introduction == Over the course of Revelation, which many regard as the most difficult book in the Bible, the author has two visions. There are many different ways to interpret these visions, and there has been substantial disagreement over which is right. Greg, Steve. \"Revelation, Four Views, Revised and updated\", Thomas Nelson, 2012, There are four main formats for interpreting the Book of Revelation: * Futurism believes that most if not all of the book speaks about events in the future of our world. * Historicism believes that the Book of Revelation references events between John's time and the end of the world. * Preterism believes that the events in the Book of Revelation occurred in the past, most notably surrounding the time of the Emperor Nero and the destruction of the Jerusalem Temple in A.D. 70. * Idealists focus more on the practical takeaway from the visions of Revelation, while not denying various fulfillments in the past, present and future. While preterism is a common approach in liberal circles, it faces a major challenge because the Early Church Fathers and most conservative scholars maintain that the Book of Revelation was written at the end of the First Century A.D., making it doubtful that the book is a foretelling of events such as the destruction of the Jerusalem Temple that occurred decades before. ==Authorship== The person writing Revelation, who called himself \"John\",Rev. 1:1, 4, 9; 22:8 claims he was on the island of Patmos in the Aegean Sea when he saw his first vision.Rev 1:9; 4:1-2 But there is disagreement over whether he is the same person as the Bible's other two Johns: the author of the letters of John and the author of The Gospel of John. ==Content== Revelation begins by introducing John as its author, and has letters to seven churches of that day. Some think these churches also represent periods of history. Various visions follow that are highly symbolic, allow many different interpretations, and are often thought to represent past and future events. Some believe that many of these prophecies have already been fulfilled, some believe they will be fulfilled at the end of time, and some believe they do not refer to any specific events but instead describe the victory of Christ over all enemies. Parts of the book seem to use symbols and codes in order to hide their meaning from outsiders, including the mysterious \"number of the beast,\" or 666. The book ends with a vision of faithful souls in the next life rejoicing around the throne of God. Christians often discuss topics from the book of Revelation, including the Millennium,Revelation 20:1-4) a 1000-year period when Christ will rule the earth. Revelation also describes a final war between good and evil known as the Battle of Armageddon,Revelation 16:16 though the word \"Armageddon\" is also sometimes used to describe any large war that ends the world. Both of these events are thought to be literal by some and figurative by others. While virtually all Christians agree that there will be a Second Coming of Christ, it is the subject of conflicting accounts in Revelation and therefore much disagreement about its details. Throughout history, Revelation has been especially important to Christians who were suffering persecution and felt parts of the book could have been referring to them. Some verses that mention the afterlife have also traditionally been used at funerals. Rev. 21: 1-7 ==Related pages== * Apocalypse * Eschatology *Number of the Beast * Rapture * The Grapes of Wrath == References == Relevation Category:Christian eschatology",
 "title": "Book of Revelation"
}