{
 "id": "101433",
 "text": "Aerosol spray is a system used in certain containers, like spray cans. The contents of the can, like color or deodorant are pressurized. The can has a valve. When this valve is opened, the liquid is forced out. It will emerge as an aerosol or mist. Apart from the liquid, there is another substance in the container, usually called propellant. When the valve is opened, some propellant will be forced inside the container. That way the pressure in the container is kept constant. == History == Around 1790, it was discovered that a carbonated beverage was pushed out of a container in France. In 1837, the syphon was invented. In 1862, several experiments with liquid spraying using compressed gas were held. In 1927, Norwegian engineer Eric Rotheim proposed the first usable aerosol balloon construction. In 1943, Americans Lyle Goodhugh and William Sullivan, commissioned by the US government, developed a bug bomb (World War II was going on, and it was necessary to find a way to quickly spray insecticide in order to control insect-borne diseases). This date is considered to be the beginning of the mass production of aerosol balloons. In 1947, aerosolized insecticides appeared on the mass market. In 1949, Robert Abplanalp invented the modern spray valve. In the same year, Edward Seymour started the production of spray paint. == Safety == The instructions for most aerosols warn that it is forbidden to spray it near open flames, electric stoves, and so on. It is also forbidden to overheat balloons and put them in the sun in hot weather, as well as on heaters. There were many cases of balloon explosions in hot weather, as well as pyrotechnic entertainment of detonating aerosols on fires, which is a rather dangerous activity. == In detail == * A - Donut (indicating the color of the paint) * B - Valve system * C - Safety ring * D - Mixture balls (characteristic for paint cans) * E - The valve itself == Related pages == * Graffiti * Pepper spray Category:Tools Category:Air pollution Category:Art materials Category:Environmental issues",
 "title": "Aerosol spray"
}