{
 "id": "1014255",
 "text": "Marie-Aurore-Lucienne Gagnon, simply known as Aurore Gagnon (31 May 1909 –12 February 1920), was a Canadian girl who was a victim of child abuse and died of exhaustion and blood poisoning (sepsis). She had about 52 wounds inflicted by her stepmother, Marie-Anne Houde, and by her father, Télesphore Gagnon. The story of l'enfant martyre (English: The Child Martyr) received great attention in the media. Aurore became an icon of Quebec society and popular culture. ==Life== Aurore was born into and raised in a Roman Catholic family. She was the second of five children of the farmer Télesphore Gagnon and of his first wife, Marie-Anne Caron. Her parents married in September 1906. They lived in Fortierville, Quebec, a small village on the south shore of the St. Lawrence River. The villiage was southwest of Quebec City. The Gagnons' first child, Marie-Jeanne, was born in August 1907. The birth of Aurore was soon followed by that of Lucina and then Georges in 1910 and of Joseph in 1915. In 1916, not long after Joseph's birth, Marie-Anne Caron was hospitalized for tuberculosis. Marie-Anne Houde, the widow of a cousin of Télesphore, soon moved into the Gagnons' home. She claimed that she wanted to \"take care of the house and children.\" She was a mother of two sons, Gerard and Henri-Georges, and was in her thirties. She was born in Sainte-Sophie-de-Lévrard, a nearby viollage of Fortierville. On November 6, 1917, the two-year-old Joseph was found dead in his bed. A coroner's inquest showed that it had been a natural death. Some villagers thought that Marie-Anne Houde had something to do with the death. On 23 January 1918, Marie-Anne Caron died of tuberculosis at the Beauport Asylum. The next week, Télesphore married Marie-Anne Houde. The villagers were suspicious when two of her children soon died, but there was no investigation. During this time, Télesphore beat Aurore with an axe handle. Aged ten in September 1919, Aurore was hospitalized for more than a month at the Hôtel- Dieu de Québec. She had a very bad infection in her leg that was caused by a beating. When she was released from the hospital, the beatings started again. ==Death== Aurore died on February 12, 1920. The cause was listed as poisoning. It was not known if she had been poisoned, or if the poisoning had been caused by an infection from her many wounds. Télesphore Gagnon and Marie-Anne Houde were arrested as they tried to leave the church after her funeral on February 16, 1920. Houde was sentenced to be hanged for murder. The sentence was changed to life imprisonment. After serving 15 years, she was paroled for \"health reasons.\" She died of breast cancer in May 1936. Télesphore Gagnon was convicted of manslaughter and sentenced to life imprisonment. He was released from prison in 1925 for \"good behaviour\" after he had served only five years. He returned to his hometown and previous life, where he wrote several letters to Houde, still in prison. After Houde's death, Télesphore remarried. He died peacefully in 1961. ==Culture== Aurore is still a popular cultural icon in Quebec. She has almost mythical status. Many books have been published about her life. In 1920, the first dramatic production was written by Louis Petitjean and would eventually become his most famous play. Télesphore tried unsuccessfully to block the release of the 1952 movie. ===Movies=== * La petite Aurore: l'enfant martyre (1952) * Aurore (2005) Category:Children victims of violence Category:People from Quebec Category:1909 births Category:1920 deaths",
 "title": "Aurore Gagnon"
}