{
 "id": "1014087",
 "text": "Antoine Dominique Bordes (1815-1883) was a French shipowner and trader, founder of the shipping company Armement Bordes, for a long time the largest in the world. ==Career== Born on July 21, 1815 in Gers, France where his father was a medical doctor (graduated from the University of Paris), he joined his older brother Antoine Dominique at the age of 16, who ran a grain and flour trade in Bordeaux. He took the name of his brother for his business. Antoine Dominique Bordes left France at the age of 18 to South America and arrived in Valparaíso, Chile. He then began to work as a shipping agent and to create a commercial entourage. In 1837 he founded a consignment house. At the age of 25, he joined forces with Captain Casimir LeQuellec to create a trading company between Bordeaux and Valparaíso, which was shaped into a shipping company with headquarters in Bordeaux. After the death of LeQuellec, the Armement Bordes brand was created in 1868. Until the death of the founder, the company established on Boulevard Malesherbes in Paris and organized its traffic from the ports of Bordeaux, Nantes, Dunkirk and Le Havre. From the 1870s its ships also carried Chilean nitrate to Liverpool and Glasgow. From February 1857 to July 1859, the Pereire brothers hired him to straighten out the helm of the Compagnie Générale Maritime. During this period, he was the extraordinary manager of the firm. He died in Bordeaux at the age of 67. Alexandre Bordes was also his son. == References == === Related article === *Bordes Company === Bibliography === * Francis Roger, Marins Cap-Horniers du Nitrate, Books on Demand, 2014 * Marthe Barbance, Commercial Life of the Cape Horn Route in the 19th Century: Armement A.-D. Bordes et fils, Editions of the School of Advanced Studies in Social Sciences, January 1969, * \"L'Épopée des grands cap-horniers dunkerquois\", Dunkirk magazine 184, April 2008 * Henri Queffélec, These are sailboats that the wind carries away, Presses de la Cité, 1984 * Robert Chevet, Une transat bordelaise, Itarkeo editions, 2017 * Louis Lacroix, The Last French Cap-Horniers, Maritime and Overseas editions, January 1968 == Other websites == * VIAF * ISNI * BnF (données) * LCCN * Pays-Bas * WorldCat Category:Articles with authority control information",
 "title": "Antoine Dominique Bordes"
}