{
 "id": "1014336",
 "text": "Navina Jafa is a cultural heritage professional, Kathak classical dancer, author, cultural historian, performing arts scholar, cultural activist, and curator of signature heritage tours. She has made contributions in the field of cultural diplomacy and sustainable development through her work as a Fulbright Scholar at the Smithsonian Museum and various other prestigious roles. == Early life and education == Navina Jafa was born on June 6, 1964, in Shillong, Meghalaya. She completed her schooling at the Convent of Jesus and Mary in Delhi and Convent High School in Dominica, West Indies. She further pursued her education at St. Mary's Convent (Ramnee) in Nainital. Navina Jafa earned her Bachelor's degree in English Honors from St. Stephen's College (1983-86) and went on to specialize in Culture Management and Cultural Diplomacy as a Fulbright Fellow at the Smithsonian Centre for Folklife & Cultural Heritage in Washington, D.C. (2005-2006). She also pursued a Ph.D. in History & Culture with a focus on the Socio Economics of North Indian Performing Arts at Jamia Milia Islamia under the guidance of Kapila Vatsyayan and Narayani Gupta (1991-1999).https://m.timesofindia.com/city/delhi/new- heritage-walk-mehrauli-park-enthrals-visitors/articleshow/8499556.cms == Career and achievements == Navina Jafa studied Art History and Indian Cultural Heritage in the guru-shishya parampara (traditional teacher-student relationship) with Kapila Vatsyayan. As a cultural heritage professional, Jafa has conducted extensive research on Indian temples in collaboration with archaeologists such as M.N. Deshpande and Krishna Dev, both former Directors- General of the Archaeological Survey of India. She has also made notable contributions to the field of cultural heritage skill mapping, data analysis, and application in sustainable development programs. In addition to her academic pursuits, Jafa has actively engaged in cultural diplomacy and public diplomacy. As a Fulbright Scholar, she delivered a lecture on \"Brokering Indian Culture In The United States: Perspectives On Cultural Management\" as part of the Fulbright Lecture series. She has participated in various cross- cultural projects, including collaborations with Cambridge University on Culture and Artificial Intelligence. Some of her notable accolades include the Shakti Women's Achiever award by the Travel Agents Association of India (TAAI) for her contributions to Heritage Tourism, the Woman of Wonder award by the Vodafone Foundation, and the CBSE Sahodaya Award for her contributions to Multi-disciplinary Learning - Heritage Education in Schools. Jafa has been involved in electoral awareness and development communication through Indian performing arts. She worked with the Election Commission of India in 2019 to curate interactive folk performances in 56 villages in Rajasthan to motivate registered women voters. These performances, featuring traditional impersonators and acrobats, were accompanied by surveys to understand the reasons behind women's low voter turnout. Subsequently, Navina Jafa initiated a follow-up program advocating for the formation of jal panchayats (water councils) through a Bahurupiya Jal Yatra. == Notable works == * Research on Socio Economics of North Indian Performing Arts: During her Ph.D. studies at Jamia Milia Islamia, Jafa conducted extensive research on the socio-economic aspects of North Indian performing arts. Her research shed light on the interplay between the performing arts and society, providing valuable insights into this cultural tradition. * Collaboration with Cambridge University on Culture and Artificial Intelligence: Jafa worked on projects related to culture and artificial intelligence in collaboration with Cambridge University. Her contributions in this area explored the intersection of technology, culture, and sustainable development. * Electoral Awareness and Development Communication: Driven by her commitment to civic engagement, Jafa collaborated with the Election Commission of India on initiatives to increase voter awareness. She curated interactive folk performances in Rajasthan's villages to motivate registered women voters, contributing to efforts to strengthen democratic processes. * Cultural Heritage Skill Mapping and Sustainable Development: Jafa has made significant contributions to cultural heritage skill mapping, data analysis, and its application in sustainable development programs. Her work in this area has helped to preserve and promote traditional skills, contributing to the sustainable development of communities. * Curator of Signature Heritage Tours: As a curator of signature heritage tours, Jafa has designed and led immersive experiences that showcase the rich cultural heritage of India. These tours provide participants with a deep understanding of the country's diverse cultural traditions and historical significance. * Authorship: Jafa has authored several articles and publications on cultural heritage, performing arts, and cultural diplomacy. Her writings contribute to the scholarly discourse and public understanding of these fields, providing valuable insights into the importance of cultural preservation and its impact on society. == References == Category:1964 births Category:Indian dancers Category:Living people",
 "title": "Navina Jafa"
}