{
 "id": "1014601",
 "text": "Desert kites () are dry stone wall structures found in Southwest Asia (Middle East, but also North Africa, Central Asia and Arabia). They were first discovered form the air, in the 1920s. These structures were built in the stone age, from about 10.000 years ago, to about 2.500 years ago. They consist of two walls, at an angle. Very likely, they were used for hunting. Today, over 6.000 structures are known. The sizes range from less than to several kilometres in length. Very often, they are shaped like a kite. Usually, they are made of stone walls, less than high. Little is known about their ages, but the few dated examples appear to span the entire Holocene. Most peole think that they were used as traps for hunting game animals such as gazelles, which were driven into the kites and hunted there. == Description == Desert kites are stone structures with a convergent shape. They are made of linear piles of stones. The structures have lengths between less than a hundred metres to several kilometres and heights of less than one metre, even accounting for erosion. Often, there are gaps in the lines. These gaps may have been left by the builders on purpose. They may also have been the result of lines formed by alignments of cairns rather than a continuous row. There are different shapes that are referred to as \"desert kites\". The lines usually form two walls (\"antennae\") that converge into an enclosure (\"head\") with attached cells. The common kite type varies by region. Sometimes the existence of these cells is considered essential for a desert kite. Research published in 2022 has identified that pits several metres deep often lie at the edge of enclosures: these have been interpreted as traps and killing pits. The kites enclose surface areas with a median of . Much larger and much smaller sizes are also known. Dating kites is difficult; various dating methods like radiocarbon dating and optically stimulated luminescence have given ages ranging from the early to the late Holocene. Sometimes, there are reports of their use in travel records. Some kites have been replaced by later archaeological structures, eroded or flooded. Sometimes they were used to build more complex shapes. In some places, structures like cairns, tombs or square walls occur alongside kites. They are typically found in massifs or topographically complex terrain. They almost never occur in sloping terrain, mountainous regions, or within endorheic basins, although they occur at the margins of mountains. Often, the terrain within the kite is much more open than the outside terrain, lacking vegetation and rocks. In general, the visibility of the kites from their inside is poor, which appears to be a purposeful feature of their construction; for example, the ends and entrances of the kites often coincide with slope breaks (places where the slope changes). Within a given region, the kites tend to have a preferred orientation. They are absent from humid climates and from certain hyperarid areas, and their use may have been influenced by Holocene climate changes. Their often enormous size and conspicuousness in arid or semiarid terrain renders them visible in aerial images, while their construction in rough terrain makes them almost invisible on the ground. Sometimes, natural features like cliffs are used in conjunction with the artificial walls to form a kite. Clearing vegetation around the lines or using rocks with a different colour from the background has been documented in volcanic terrain. In Arabia, cairns and linear stone alignments have been found associated with kites. Kites are known from the Middle East and Central Asia, with examples known mainly from Armenia, Egypt, Iraq, Israel-Palestine, Jordan, Kazakhstan, Lebanon, Libya, Saudi Arabia, Syria, Turkey, Uzbekistan and Yemen. They have also been found in South Africa. , there were over 6,000 known kites in Asia and the Middle East, and in some parts of Syria there are as many as 1 kite every , to the point that they are partially overlapping or form complicated structures. Similar large enclosures that were presumably used as traps have been found in Europe, where they were dated to Mesolithic and Neolithic age; North America, where structures known as drive lines have been used into the 19th century AD; South America; and Japan. == References == === Sources === * * * * * * == Other websites == * Globalkites, worldwide database of kites Category:Hunting Category:Stone Age",
 "title": "Desert kite"
}