{
 "id": "1014332",
 "text": "The Spyker F1 Team was a Formula One team owned by Spyker, a Dutch car brand. It existed only in 2007. The team was bought from Midland in 2006 and was sold to become Force India later on in 2007. == History == === 2006 === In 2006, during the 2006 Formula One season, it was announced that Spyker had bought the struggling Midland F1 team. Every race that was left would be raced under the Spyker name and the livery would be changed to orange, because that's the national colour of the Netherlands. === 2007 === In the 2007 season, the team was fully in the hands of Spyker. However, to the public, the team did not perform better than Midland. It was known as a backmarker, a team that almost always finds itself at the back of the grid. ==== Firing of Albers ==== On the tenth of July it was announced that the only Dutch driver with Spyker, Christijan Albers, would be fired because his sponsors failed to pay the Spyker F1 team. He would be replaced by Winkelhock and, later on, Yamamoto. ==== 2007 European Grand Prix ==== During the 2007 European Grand Prix, held at the Nürburgring, Markus WInkelhock found himself leading the field in his only race for Spyker and in F1. This was because he was the only driver to make a pitstop before the race started. It was a rainy day and the team decided on wet tyres, as they work better in the rain than other compounds. This move put him in last, but many people in front of him either spun off or decided to get wet tyres for themselves. Suddenly, after passing the man in front, he was leading the race. At the height of his triumphant drive, he was 33 seconds in front of the driver in second. However, this wouldn't last long. Because of a series of crashes caused by the rain, the race was red-flagged. After the race restart, he was quickly overtaken by the faster cars behind him. He later on retired because of a hydraulics issue. ==== Spyker F1 Sold ==== At the end of 2007, Spyker F1 was sold to an Indian holding company called Orange India Holdings. This was officially the end for Spyker in Formula One. The team turned into Force India for the start of 2008. == Formula One Results == === 2007 === Year Chassis Engine Tyres Drivers 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 Points WCC 2007 F8-VII F8-VIIB Ferrari 056 2.4 V8 AUS MAL BHR ESP MON CAN USA FRA GBR EUR HUN TUR ITA BEL JPN CHN BRA 1 10th Adrian Sutil 17 Ret 15 13 Ret Ret 14 17 Ret Ret 17 21† 19 14 8 Ret Ret Christijan Albers Ret Ret 14 14 19† Ret 15 Ret 15 Markus Winkelhock Ret Sakon Yamamoto Ret 20 20 17 12 17 Ret == References == Category:Formula One constructors",
 "title": "Spyker F1"
}