{
 "id": "1015247",
 "text": "Helicoprion is an extinct genus of shark-like cartilaginous fish. Almost all fossil specimens of this genus are of spirally arranged clusters of the individuals' teeth, called tooth whorls, which in life were embedded in the lower jaw. As with most extinct cartilaginous fish, the skeleton is mostly unknown. It is one of the most popular ancient sharks of all time, aside from megalodon. It was always assumed that the Helicoprion was a shark, but in reality, it is more closely related to ratfish. Like all chondrichthyan taxa, Helicoprion had a cartilaginous skeleton. == Description == It had skeletons made of cartilage. As a result, the entire body of this fish disintegrated once it began to decay, unless it is preserved by exceptional circumstances. This can make it hard to draw illustrations of the full body appearance of Helicoprion. The tooth was unusual-looking. It looked like a circular saw. The tooth is popularly known as a tooth whorl. The largest known Helicoprion tooth whorl, specimen IMNH 49382 representing an unknown species, reached 56 cm (22 in) in diameter and 14 cm (5.5 in) in crown height, which would have belonged to an individual over 7.6 m (25 ft) in length. Some types of Eugeneodont fish with preserved postcrania include the Pennsylvanian to Triassic sharks Caseodus, Fadenia, and Romerodus. === Tooth whorls === A tooth whorl is a structure found on Helicoprion. Almost all Helicoprion specimens are known solely from tooth whorls, which is a name shark lovers call when they see a tooth whorl. They consist of many enameloid-covered teeth. The youngest and first tooth at the center of the spiral, referred to as the \"juvenile tooth arch\", is hooked, but all other teeth are generally triangular in shape, laterally compressed and often serrated. === Other material === Several large whorls are difficult to assign to any particular species group, H. svalis among them. IMNH 14095, a specimen from Idaho, appears to be similar to H. bessonowi, but it has unique flange-like edges on the apices of its teeth. IMNH 49382, also from Idaho, has the largest known whorl diameter at 56 cm (22 in) for the outermost volution (the only one preserved), but it is incompletely preserved and still partially buried. H. mexicanus, named by F.K.G. Müllerreid in 1945, was supposedly distinguished by its tooth ornamentation. == Species == * Helicoprion bessonowi Karpinsky, 1899 (type) * Helicoprion davisii Woodward, 1886 * Helicoprion ergassaminon Bendix-Almgreen, 1966 === H. bessonowi === H. bessonowi is perhaps the best-known species of this genus. It was not the first species of Helicoprion, to be described, but it's the first one to be described from complete tooth whorls, which reveals Helicoprion is a distinct taxon from Edestus. As a result, H. bessonowi serves as the type species for Helicoprion. === H. davisii === The first specimen of this genus was discovered along a tributary of the Gascoyne River. Henry Woodward named it Edestus davisii, commemorating the man who found it. Later, in 1899, Alexander Karpinsky reassigned it to the genus Helicoprion, and renamed it to H. davisii. === H. ergassaminon === H. ergassaminon is known from the Phosphoria Formation of Idaho, just like H. davisii, though it is comparatively much rarer. H. ergassaminon was named and described in detail by Svend Erik Bendix-Almgreen. == Historical depictions == === Earliest depictions === Hypotheses for the placement and identity of Helicoprion's tooth whorls were controversial from the moment it was discovered. Woodward (1886), who referred the first known Helicoprion fossils to Edestus, discussed the various hypotheses concerning the nature of Edestus fossils. Karpinsky's hypothesis of the placement of the tooth whorl was putting it on the nose. Many people said that \"the tooth whorl on the nose looks so weird.\" It now has its tooth whorl in its lower jaw. === Later depictions === By the mid-20th century, the tooth whorl was usually depicted as being on the lower jaw. The utility of the tooth whorl in this type of reconstruction was inferred based on sawfish, which have the ability to incapacitate and slice through prey using lateral blows of their spiky snouts. == In popular culture == Helicoprion was a famous animal because it has been found in many websites. People have given it the name buzzsaw shark. == Related pages == * Caseodus * Edestus * Fadenia * Dracopristis == References == == Other websites == Category:Cartilaginous fish",
 "title": "Helicoprion"
}