{
 "id": "1015376",
 "text": "Dr. R. K. Mishra, also known as Dr. Rajneesh Kumar Mishra, is an Indian laparoscopic and robotic surgeon. He has written many scientific articles that discuss new surgical methods, improvements, and results in minimally invasive surgery. He is a member of the Society of Gastrointestinal Laparoscopic Surgeons (SAGES). Dr. Mishra is also the president of the International College of Robotic Surgeons and the chief editor of the World Journal of Laparoscopic Surgery. He is also a founding member of the Indian chapter of the Clinical Robotic Surgery Association (CRSA). == Works Published == * Laparoscopic versus open appendectomy for the treatment of acute appendicitis * Optimum shadow-casting illumination for endoscopic task performance * The Impact of the learning curve in laparoscopic surgery * Role of OT table height on the task performance of minimal access surgery * History of minimal access surgery * Changing role of laparoscopy in the management of patients with cirrhosis * Critical view of safety technique during laparoscopic cholecystectomy in prevention of biliary injuries * Laparoscopic tissue approximation techniques * Complications of laparoscopic surgery * Minimal Access Surgery Educational Needs of Trainees from Africa: Perspectives from an Asian Training Institution. * Different techniques of tissue retrieval from abdominal cavity during minimal access surgery * Study of port site complications in laparoscopic surgeries * Minimally invasive surgical techniques vs open myomectomy for treatment of uterine fibroids * Laparoscopic Hernia Repair * Textbook of practical laparoscopic surgery * Textbook of Laparoscopy for Surgeons and Gynecologists * Is There an Ideal Port Position for Laparoscopic Urological Procedures? * Comparison of PMAT camera holder with human camera holder * Comparison between Roux-en-Y gastric bypass and mini-gastric bypass in patients of developing countries * Comparing extracorporeal knots in laparoscopy using knot and loop securities * Utilization of Laparoscopic Surgery in Cirrhosis of the Liver * Single incision laparoscopic surgery (SILS) inguinal hernia repair-recent clinical experiences of this novel technique. * Review of the Effectiveness of Composite Barrier Mesh Used for Laparoscopic Ventral Hernia Repair * Role of indocyanine green in laparoscopic cholecystectomy * Efficacy of near-infrared fluorescence cholangiography using indocyanine green in laparoscopic cholecystectomy: A retrospective study == References == == Other websites == *Google scholar profile Category:Living people Category:Surgeons Category:Indian physicians",
 "title": "Rajneesh K. Mishra"
}