{
 "id": "1015222",
 "text": "The Old World silversides are a family, the Atherinidae, of marine and freshwater fish belonging to the order Atheriniformes. Atherinidae are abundant and considered bony fish (teleosts) that are widespread globally, living in rivers, estuaries, and coastal waters. They occur worldwide in tropical and temperate waters. About two-thirds of the species are marine, and the others live in fresh water. There are 74 species in 13 genera. The genus Craterocephalus is the most diverse with 25 species. Four genera are monotypic. == Subfamilies and genera == * Subfamily Atherininae Risso, 1827 ** Atherina Linnaeus, 1758 (7 species) ** Atherinason Whitley, 1934 (monotypic) ** Atherinosoma Castelnau, 1872 (2 species) ** Kestratherina A. Pavlov, Ivantsoff, Last & Crowley, 1988 (2 species) ** Leptatherina Pavlov, Ivantsoff, Last & Crowley, 1988 (2 species) * Subfamily Atherinomorinae Dyer & Chernoff, 1996 ** Alepidomus C. L. Hubbs, 1944 (monotypic) ** Atherinomorus Fowler, 1903 (9 species) ** Doboatherina Sasaki & Kimura, 2019 (10 species) ** Hypoatherina Schultz, 1948 (15 species) ** Stenatherina Schultz, 1948 (monotypic) ** Teramulus J.L.B. Smith, 1965 (2 species) * Subfamily Bleheratherininae Aarn & Ivantsoff, 2009 ** Bleheratherina Aarn & Ivanstoff, 2009 (monotypic) * Subfamily Craterocephalinae Dyer & Chernoff, 1996 ** Craterocephalus McCulloch, 1912 (26 species) ** Sashatherina Ivantsoff & Allen, 2011 (monotypic) == Size of Atherinidae == Silversides are relatively small with most being less than 20 cm (7.9 in) in length, with several not attaining lengths of more than 5 cm (2.0 in). The body is generally elongated. Distinctive characters include two dorsal fins widely separated, with the first consisting of flexible spines and the second having one spine followed by soft rays, while the anal fin has one spine on the leading edge followed by soft rays. The pectoral fins tend to be high, and there is no lateral line. On the flanks is a broad, silvery band. The scales are relatively large. Some species, such as the hardyhead silverside, Atherinomorus lacunosus, are commercially fished. The family Atherinopsidae (Neotropical silversides) is closely related, while the genus Atherion has been given family status in the Atherionidae by some authorities. == Subfamily Atherininae == === Origin of Atherininae === The separation between the ancestors of Craterocephalinae and Atherininae caused Atherininae lineage to form in Southern Australia, which has cooler habitats than Northern Australia. The subfamily Atherininae has five genera. One is Atherina, which is found near the Eastern Atlantic and Mediterranean oceans; however, the remaining four are restricted to Australia’s southern coastal waters. Since Atherina’s biogeographic location is significantly different, it is likely that Atherina and the four genera are not monophyletic or do not descend from a common ancestor. Instead, Atherina is hypothesized to have a sister lineage with the ancestors of Atherininae and the Craterocephalinae. == References == # Allen, G.R. (1998). Paxton, J.R.; Eschmeyer, W.N. (eds.). Encyclopedia of Fishes. San Diego: Academic Press. pp. 153–154. ISBN 0-12-547665-5. # Froese, Rainer, and Daniel Pauly, eds. (2015). \"Atherinidae\" in FishBase. February 2015 version. Category:Teleosts",
 "title": "Old World silverside"
}