{
 "id": "1015080",
 "text": "The Luttra Woman is a bog body that was found near Luttra, Sweden, on 20 May 1943. The body has been dated to the Early Neolithic period, of about 3800-3600 BC. In Swedish, the body is called Hallonflickan(), in Danish, she is called Hindbærpigen. Both names are translated as Raspberry Girl. This name comes from the fact that when she was found, her stomach showed that raspberries had likely been her last meal. At the time of her death, she was a teenager, or a young adult. There are no traces of injuries or fatal diseases on her body. She was likely tied up before her death, and drowned on purpose. Axel Bagge, an archeolgoist who assisted in the first investigation, said that she had either been a human sacrifice, or she had been executed. Since 1994, her body has been on permanent display at a museum in Falköping. , she was the earliest-known Neolithic person from Western Sweden. == Looking at the body == When experts looked at the body, they concluded that she must have been a pretty girl or young woman. She was was a little smaller than other women her age. She was tall. Other women of her age, in the region usualy were beteen and tall. In the area where her stomach must have been, a large number of raspberry seeds were found. In the stone age, there were no technologies that would allow to keep raspberries for a longer time period. For this reason, her death must have been in summer, likely in July or August. This makes her a special case, as the other bog bodies found in Sweden all died during the winter months. In the 1990s, scientists tried to determine her age. They found that she must have been at least eighteen years old, more likely 20-25 years. Radiocarbon dating found that the woman had died about 1000 years later than first thought, between 3105 and 2935 BC. When looking at the surrounding soil, remains of freshwater snails were found. Likely, the woman was drowned in open water. Later, the area became a bog. == Arrowhead == Three years before the body of the woman was found, people had found an arrowhead, made of flintstone, about away. People thought, the arrow had missed the woman, and that she had been hit by another arrow. Later her body moved into the water. Further excavations were done, but they neither found another arrowhead, nor any wounds that would explain that an arrow had hit her. Therefore, the arrowhead is likely unrelated to the woman. == Reconstruction and exhibition == , her body has been on a permanent exhibition titled Forntid på Falbygden () at the Falbygdens Museum, Falköping, since 1994. There is also a bust of what she might have looked like, displayed at the museum. Stockholm-based model-maker Oscar Nilsson created it. ==References== Category:Bog bodies Category:History of Sweden",
 "title": "Luttra Woman"
}