{
 "id": "1015847",
 "text": "Heat pump cycles, refrigeration cycles or thermodynamic cycles are the fundamentals for heat pump, air conditioning and refrigeration systems and how they work. A heat pump is a mechanical system that allows for the transfer of heat from one location to another. They work under thermodynamic laws.The Systems and Equipment volume of the ASHRAE Handbook, ASHRAE, Inc., Atlanta, GA, 2004 == Thermodynamic cycles == According to the second law of thermodynamics, heat cannot move from a colder location to a hotter area by itself. Work is required to achieve this.Fundamentals of Engineering Thermodynamics, by Howell and Buckius, McGraw-Hill, New York. An air conditioner requires action to cool a living space by moving heat from the interior being cooled to the outdoors. A refrigerator moves heat from inside the cold interior area to the warm room temperature air of the kitchen. This idea of an ideal heat engine was explained using the Carnot cycle by Sadi Carnot in 1824. A refrigerator or heat pump is an example of a heat engine that is running in a reverse Carnot cycle. Heat pump cycles and refrigeration cycles can be vapor compression, vapor absorption, gas cycle, or Stirling cycle types. === Vapor compression cycle === The vapor compression cycle is used by many refrigeration, air conditioning, and other cooling applications. It is also used within heat pumps for heating applications. The vapor compression cycle has two heat exchangers. One of them is the condenser, which is hot and releases heat. The other is the evaporator, which is cold and takes heat. For applications that need to operate in both heating and cooling modes, such as heat pumps, a reversing valve is used to switch the roles of the heat exchangers. At the start of the cycle, the refrigerant enters the compressor as a low pressure and low temperature vapor. The pressure is then increased and the refrigerant leaves as a higher temperature and higher pressure gas. This hot pressurized gas then moves through the condenser coil, where it releases heat to the area as it cools and condenses completely. The cooler high-pressure liquid next passes through the expansion valve which lowers the pressure suddenly and causes the temperature to drop a lot. The cold low pressure mixture of liquid and vapor next travels through the evaporator coil where it vaporizes completely when accepts heat from the area around it before returning back to the compressor as a low pressure low-temperature gas to start the cycle again. Simple systems with a normal temperature range, such as a refrigerator, may use a fixed speed compressor and fixed orifice expansion valve. Systems that need to operate in different conditions, such as air conditioning, where outside temperatures and heat demand change a lot through the seasons, will sometimes use a variable speed inverter compressor which can run slow or fast and an adjustable expansion valve to control the speed of the cycle better. === Vapor absorption cycle === During the 20th century, the vapor absorption cycle using water and ammonia systems was popular and widely used but after work on the vapor compression cycle, it lost much of its use because of its low efficiency (about one-fifth of the vapor compression cycle). It is now only used where heat is more available than electricity, such as industrial waste heat, solar thermal energy by solar collectors, or propane refrigerators in motorhomes. The absorption cycle is similar to the compression cycle, but depends on the partial pressure of the refrigerant vapor. In the absorption system, the compressor is replaced by an absorber and a generator. The absorber dissolves the refrigerant in a suitable liquid and a dilute solution becomes a strong solution. In the generator, the temperature increases, which also increases the partial pressure of the refrigerant vapor released from the strong solution. The generator needs a heat source. This consumes a lot of energy unless waste heat is used. Absorption refrigeration systems can be powered by combustion of fossil fuels (e.g., coal, oil, natural gas, etc.) or renewable energy (such as waste heat recovery, biomass combustion, or solar energy). ==Gallery== File:Lednička Zanussi ZRA 319 SW, kompresor s odpařovací miskou (002).JPG|The compressor seen on a household refrigerator File:HVAC Air Handler Unit, pic2.JPG|Industrial air handler. Inside is a way to heat and cool the air coming through it. File:Absorption fridge.jpg|Absorption refrigerator such as that seen in a motorhome File:Rooftop Packaged Units.JPG|Rooftop Packaged Unit ==References== ==Other websites== * \"The Basic Refrigeration Cycle\" Category:HVAC Category:Heat transfer Category:Thermodynamics",
 "title": "Heat pump and refrigeration cycle"
}