{
 "id": "101537",
 "text": "The BT postcode area (also called the Belfast postcode area) is how each area in Northern Ireland has postcodes. Northern Ireland was the last part of the United Kingdom to get post codes. The BT postcode area was made between 1970 and 1974. ==Belfast== The Belfast post town districts are BT1 to BT17, BT58 and part of BT29. \"BT\" is short way of saying \"Belfast\". The postcode for Belfast city centre starts BT1. The Royal Mail office in Belfast has a postcode of BT1 1AA. Postal district Post town Coverage BT1 BELFAST Belfast BT2 BELFAST Belfast BT3 BELFAST Belfast BT4 BELFAST Belfast, Sydenham BT5 BELFAST Belfast, Castlereagh, Crossnacreevy, Gilnahirk, Knock BT6 BELFAST Belfast, Castlereagh, Knockbreda BT7 BELFAST Belfast, Ormeau BT8 BELFAST Belfast, Carryduff, Knockbreda, Newtownbreda BT9 BELFAST Belfast, Malone, Lisburn Road, Taughmonagh, Stranmillis BT10 BELFAST Belfast, Finaghy BT11 BELFAST Belfast, Andersonstown BT12 BELFAST Belfast, Falls BT13 BELFAST Belfast BT14 BELFAST Belfast, Ballysillan, Upper Ballysillan BT15 BELFAST Belfast BT16 BELFAST Dundonald BT17 BELFAST Belfast, Derriaghy, Dunmurry, Hannahstown BT29 BELFAST Belfast, Crumlin, Aldergrove, Dundrod, Glenavy, Nutts Corner BT58 BELFAST Belfast BT99 BELFAST Belfast ==Rest of Northern Ireland== The rest of Northern Ireland has 43 other post towns. The post town districts for the 43 post towns are BT18 to BT57, BT60 to BT82, BT92 to BT94 and part of BT29. Postal district Post town Coverage Local Government Districts BT18 HOLYWOOD Holywood, Craigavad. North Down BT19 BANGOR Bangor, Crawfordsburn, Groomsport, Helens Bay North Down, Ards BT20 BANGOR Bangor. North Down BT21 DONAGHADEE Donaghadee Ards BT22 NEWTOWNARDS Newtownards, Ardkeen, Ballyhalbert, Ballywalter, Carrowdore, Cloughey, Greyabbey, Kircubbin, Millisle, Portaferry, Portavogie. Ards BT23 NEWTOWNARDS Newtownards, Ballygowan, Comber, Conlig, Killinchy, Moneyrea. Ards, Castlereagh, North Down BT24 BALLYNAHINCH Ballynahinch, Drumaness, Saintfield Down, Lisburn BT25 DROMORE Dromore, Dromara, Finnis, Waringsford. Banbridge, Lisburn BT26 HILLSBOROUGH Hillsborough, Annahilt, Culcavy. Lisburn BT27 LISBURN Lisburn, Cargacreevy, Drumalig, Drumbo, Hilden, Hillhall, Lambeg. Lisburn BT28 LISBURN Lisburn, Ballinderry Lower, Ballinderry Upper, Stoneyford Lisburn BT29 BELFAST Belfast, Crumlin, Aldergrove, Dundrod, Glenavy, Nutts Corner Belfast BT30 DOWNPATRICK Downpatrick, Ardglass, Ballyhornan, Ballykinler, Castleward, Clough, Crossgar, Kilclief, Killard, Killough, Killyleagh, Loughinisland, Seaforde, Strangford, Toye Down BT31 CASTLEWELLAN Castlewellan, Ballyward. Down, Banbridge BT32 BANBRIDGE Banbridge, Annaclone, Ballinaskeagh, Ballyroney, Corbet, Katesbridge, Lenaderg, Loughbrickland, Seapatrick. Banbridge BT33 NEWCASTLE Newcastle, Bryansford, Dundrum. Down BT34 NEWRY (County Down) Newry, Annalong, Ballymartin, Cabra, Hilltown, Kilcoo, Kilkeel, Mayobridge, Poyntzpass, Rathfriland, Rostrevor, Warrenpoint Newry and Mourne BT35 NEWRY (County Armagh) Jerrettspass, Bessbrook, Camlough, Crossmaglen, Newtownhamilton Newry and Mourne, Banbridge, Down BT36 NEWTOWNABBEY Newtownabbey, Mossley Newtownabbey BT37 NEWTOWNABBEY Newtownabbey Newtownabbey BT38 CARRICKFERGUS Carrickfergus, Ballycarry, Greenisland, Kilroot, Whitehead. Carrickfergus BT39 BALLYCLARE Ballyclare, Ballynure, Doagh, Parkgate, Straid, Templepatrick. Newtownabbey, Antrim, Ballymena, Larne BT40 LARNE Larne, Ballygally, Gleno, Glynn, Islandmagee, Kilwaughter, Magheramorne, Millbrook. Larne BT41 ANTRIM Antrim, Dunadry, Muckamore, Randalstown, Toomebridge. Antrim BT42 BALLYMENA Broughshane,Cullybackey, Galgorm. Ballymena BT43 BALLYMENA Cargan, Knockanully Ballymena BT44 BALLYMENA Portglenone, Carnlough, Glenarm, Clogh Mills, Rasharkin, Glenariff/Waterfoot, Cushendun, Cushendall, Dunloy, Loughguile, Glarryford. Ballymena, Ballymoney, Magherafelt, Moyle, Larne BT45 MAGHERAFELT Magherafelt, Ballyronan, Bellaghy, Castledawson, Desertmartin, Draperstown, Knockloughrim, Moneymore, Tobermore, Fallalea, Fallaghloon Magherafelt BT46 MAGHERA Maghera, Lisnamuck, Swatragh, Upperlands Magherafelt BT47 LONDONDERRY Londonderry, Waterside, Claudy, Feeny, Dungiven, Eglinton, Park, New Buildings. Derry BT48 LONDONDERRY Londonderry, Cityside, Ballynagard, Coshquin, Rosemount, The Collon, Culmore. Derry BT49 LIMAVADY Limavady, Ballykelly Limavady BT51 COLERAINE Coleraine, Aghadowey, Articlave, Bellany, Blackhill, Castlerock, Castleroe, Garvagh, Kilrea, Macosquin, Ringsend Coleraine BT52 COLERAINE Coleraine, Ballyvelton, Cloyfin Coleraine BT53 BALLYMONEY Ballymoney, Dervock, Armoy, Ballybogy. Ballymoney, Moyle BT54 BALLYCASTLE Ballycastle, Ballintoy, Ballypatrick, Ballyvoy, Cape Castle, Glenshesk, Maghercashel, Maghernahar, Moyarget, Torr, Rathlin Island. Moyle BT55 PORTSTEWART Portstewart Coleraine BT56 PORTRUSH Portrush, Craigahullier, Urbalreagh. Coleraine BT57 BUSHMILLS Bushmills, Castlecatt, Dunseverick, Portballintrae Moyle BT60 ARMAGH Killylea, Tynan, Belcoo, Middletown, Keady, Darkley, Markethill, Kingsmills Armagh, Newry & Mourne BT61 ARMAGH Armagh, Collone, Hamiltonsbawn, Kilmore, Loughgall, Richhill. Armagh BT62 CRAIGAVON Craigavon, Portadown, Tandragee, Clare, Scotch Street. Craigavon, Armagh BT63 CRAIGAVON Gilford, Laurencetown, Portadown, Scarva Craigavon, Banbridge BT64 CRAIGAVON Craigavon (West), Knockmenagh, Mandeville. Craigavon BT65 CRAIGAVON Craigavon (East), Drumgor, Legaghory, Tullygally, Brownlow. Craigavon BT66 CRAIGAVON Derryadd, Derrytrasna, Dollingstown, Donaghcloney, Lurgan, Waringstown Craigavon BT67 CRAIGAVON Aghagallon, Aghalee, Gawley's Gate, Lurgan, Magheralin, Moira Craigavon BT68 CALEDON Caledon Dungannon and South Tyrone BT69 AUGHNACLOY Aughnacloy, Carnteel Dungannon and South Tyrone BT70 DUNGANNON Dungannon, Ballygawley, Cappagh, Castlecaulfield, Donaghmore, Galbally, Garvaghy, Pomeroy, Rock, Seskilgreen Dungannon and South Tyrone BT71 DUNGANNON Dungannon, Benburb, Blackwatertown, Bush, Coalisland, Killycolpy, Moy, Moygashel, Stewartstown Dungannon and South Tyrone BT74 ENNISKILLEN Fermanagh BT75 FIVEMILETOWN Fivemiletown, Clabby Fermanagh BT76 CLOGHER Clogher Dungannon and South Tyrone BT77 AUGHER Augher Dungannon and South Tyrone BT78 OMAGH Omagh, Dromore, Drumquin, Eskra, Fintona, Killynure, Newtownstewart, Seskanore, Trillick Omagh BT79 OMAGH Omagh, Drumlea, Glengawna, Gortin, Mountfield, Plumbridge, Rosnamuck, Sheskinshule, Sixmilecross Omagh BT80 COOKSTOWN Cookstown, Coagh, Tullyhogue Cookstown BT81 CASTLEDERG Castlederg, Aghyaran, Clare, Garvetagh, Killen, Killeter, Mournebeg, Spamount Strabane BT82 STRABANE Strabane, Artigarvan, Ballymagorry, Bready, Clady, Douglas Bridge, Dunamanagh, Sion Mills, Victoria Bridge Strabane BT92 ENNISKILLEN Lisnaskea Fermanagh BT93 ENNISKILLEN Belleek Fermanagh BT94 ENNISKILLEN Irvinestown Fermanagh Category:Geography of Northern Ireland",
 "title": "BT postcode area"
}