{
 "id": "1015604",
 "text": "Charge CCCV LLC, also known as C4V, is an American lithium-ion battery technology company headquartered in New York with expertise in battery performance and in gigafactory design. == History == C4V was founded in 2012 by Shailesh Upreti and Robert Dobbs. In 2017, the company won a clean energy business competition, 76West, earning a $500,000 cash prize. In 2017, C4V along with Magnis Energy Technologies, Primet, BEI and C&D; Assembly started the United States' largest home-grown gigafactory. In one the battery safety testing program company outperform the safety of its BMLMP Technology. In 2018, C4V got its first strategic investment from Magnis Energy Technologies, an Australian Securities Exchange-listed company with assets in mining; Magnis took a 10% holding in C4V. In January 2022, C4V introduced LiSER (Lithium Slim Energy Reserve), a patented in-house cell technology platform with fast charge and discharge capabilities. C4V's American gigafactory, the first home-grown factory in north America, started commercial production in August 2022. In February 2023, C4V and its gigafactory partner Recharge Industries bought the UK-based Britishvolt out of administration, planned to resume gigafactory construction in late 2023 and initially focus on batteries for energy storage before manufacturing products for sports cars. C4V technology would enter UK and Europe market via this strategic acquisition. == Partnerships == In 2021, C4V partnered with Omega Seiki Mobility to provide its cobalt- and nickel-free lithium-ion batteries to be integrated in India’s last mile delivery segment. In 2022, C4V further extended its partnership with Simple Energy in India to support growing demand for the company's electric scooters. Through a subsidiary (Celgard, itself a subsidiary of Polypore International), Japan's Asahi Kasei signed a global strategic partnership agreement with C4V to foster high voltage battery separators. Asahi Kasei would also work with C4V to deploy large scale manufacturing gigafactories in different global locations. In July 2023, Trot Solutions, a UAE-based company specialising in comprehensive infrastructure solutions for ports, shipping, and logistics, has signed a memorandum of understanding with C4V to collaborate on developing green, self-sustainable ports in India. == References == Category:Lithium compounds Category:Companies based in New York City Category:Batteries",
 "title": "Charge CCCV"
}