{
 "id": "1015836",
 "text": "Ingushetia (; ; ), also spelled Ingushetiya, officially the Republic of Ingushetia, is a republic of Russia. It is in the North Caucasus region of Eurasia. The republic is in the North Caucasian Federal District. It borders the country of Georgia to the south, and the Russian federal subjects of North Ossetia–Alania to the west, Chechnya to the east, and Stavropol Krai to the north. Its capital is the town of Magas. Its largest city is Nazran. At 3,600 square km, the republic has the smallest area of Russia's non-city federal subjects. It was made on June 4, 1992. This was after the Checheno-Ingush Autonomous Soviet Socialist Republic was split in two. The republic is home to the indigenous Ingush people. The 2021 Census said its population was estimated to be 509,541. Ingushetia is one of the poorest and most unstable regions of Russia. This is mostly because of the insurgency in the North Caucasus. The violence has slowed down in recent years. However, the insurgency in Chechnya has sometimes came over the border into Ingushetia. According to Human Rights Watch in 2008, the republic has lots of corruption, crime, anti-government protests, attacks on soldiers and officers, and low human rights. == Etymology == The name Ingushetia comes from the Russian name of the region's people (Ingush) and the Georgian suffix -éti. Ingushetia literally means \"the place where the Ingush live\". Other names like \"Dzurdzuketi\", \"Kistetia\", \"Gligveti\", \"Gelia\", \"Galga\", and \"Ingushiya\" have also been used for the region. ==Notes== ==References== == Sources == === Documents === * * * === Literature === * * * * * * * ==Other websites== *News from Ingushetia *News and History of Ingushetia *Official website of Ingushetia *Unofficial website of Ingushetia *Ingush Music/Video/Literature website *Magas, Ingush youth website *Head of Ingushetia's website *Ingushetia's Republic News Portal *Ingushetia Videos *National Project: People of Ingushetia Category:Republics of Russia Category:States and territories established in the 1990s",
 "title": "Ingushetia"
}