{
 "id": "1016194",
 "text": "Teréz Zsolnay, married Mattyasovzky (21 March 1854 – 16 May 1944) was a Hungarian applied artist in the medium of ceramics who worked for the Zsolnay Ceramic Factory, founded by her father Vilmos Zsolnay in Pécs, in 1868. Along with her younger sister Julia and Ármin Klein, she was the most important artist of that factory during its rapid growth and worldwide success in the late 19th and early 20th centuries.Romváry 1989, 18; Kovács 1989, 34 ==Life and art== Teréz based her artistic expression on Hungarian folk motifs, and for this purpose she collected more than 10,000 folk art objects. In her memoirs, she also mentions that in addition to collecting folk treasures from around Pécs, she also had the opportunity to study the most typical motifs of other parts of Hungary, thanks to the friendliness of the then director of the Hungarian National Museum, who made many objects available to her.Kovács 1989, 34 In addition, she closely followed trends in contemporary applied art, and in her memoirs she mentions the writings of Jacob von Falke, the director of the Museum of Applied Art in Vienna, who relied on the ideas of Gottfried Semper.Kovács 1989, 33 Moreover, together with her sister Julija, she visited the then-famous painter and applied artist Hans Makart in his Viennese studio.Kovács 1989, 35 Among the sources she used was Jost Amman's book with 122 woodcuts of women's clothing, published in 1586.Kovács 1989, 36 Her husband, Jakab Mattyasovzky, was a geologist who traveled across Hungary, and was of great help to his wife`s father Vilmos in finding the best clay deposits needed to make fine ceramics. She largely devoted her life to her family, and at the age of 70, she began writing the History of the Zsolnay Factory, which she wrote in the form of memoires for over 20 years, on almost 2,500 pages of text. She was already over 70 years old when she got involved in the work of the factory again, painting Egyptian, figural and geometric motifs on vases (the so-called Tutankhamun series).Romváry 1989, 22 She was buried, together with other family members, in the family mausoleum in Pécs. ==Literature== Romváry 1989 - Ferenc Romváry: Keramika Zsolnay, in: Keramika Zsolnay, exhibition catalogue, Zagreb, 1989., p. 16-22 Kovács 1989 - Orsolya Kovács: Ármin Klein, umjetnik - projektant tvornice Zsolnay (1855 - 1883), in: Keramika Zsolnay, exhibition catalogue, Zagreb, 1989., p. 33-37 ==Footnotes== Category:1854 births Category:1944 deaths Category:Ceramists Category:Hungarian people",
 "title": "Teréz Zsolnay"
}