{
 "id": "1016893",
 "text": "Yubo, or Yellow, is an French social networking app. The app has 60 million users as of 2022. == History == Yubo's creators consisted of three people. Back then, they were engineering students at CentraleSupélec Graduate school of the Paris-Saclay University and Télécom Paris. It was first released in 2015. The COVID-19 pandemic gave the app its popularity. The daily signups reached 30,000 per day in mid-April. In September 2020, Yubo started in the U.S. in Jacksonville, Florida. At the same time, Yubo opened a new office in London. Yubo raised over $47.5 million (€40 million) in November 2020. In November 2021, they made another office in New York City. Live streaming video is the main feature. There can be up to ten people recording. Viewers can choose which livestreams to go to. Users can filter out what content they like. The same goes for rating people. There is no like button or any number of \"followers\". === Verified profiles === The programming contains face recognition. It is useful for verifying ages. Those who go against the technology have to download Yoti. == Negative impact == === Safety issues === Yubo had increased media attention after the app popularized in 2019. The app was described as a \"Tinder for Teens\", paying attention to the swiping feature. People were suspicious of their children engaging in online dating. Illegal actions have been reported, such as predatory behavior, grooming, and child pornography. Using the facial recognition technology, Yubo has deleted accounts that are under 13. In 2018, Yubo worked to prevent cyberbullying. In 2020, Yubo created a program with the National Center for Missing & Exploited Children that scans for any bad content. The livestream is deleted when bad content is found. In July 2021, Yubo was updated with the Muted Words feature. Users can choose to block people by muting them. === Uvalde school shooting === The Robb Elementary School shooting caused the app to receive negative feedback. The one who shot everyone still had his profile up on Yubo. After four days, the account was taken down. == References == == Other websites == * Category:Social networking Category:French websites",
 "title": "Yubo"
}