{
 "id": "1016872",
 "text": "Yaacob II ben Uzzi ben Yaacob ben Aaharon (1899-1987) was the 127th High Priest of the Samaritans.Gaster, M. “The Chain of Samaritan High Priests: A Synchronistic Synopsis: Published for the First Time.” Journal of the Royal Asiatic Society of Great Britain and Ireland, 1909, pp. 393–420. JSTOR, www.jstor.org/stable/25210743. Accessed 21 Sept. 2020. He was the grandson of Yaacob I ben Aaharon ben Shalma. He served from 1984-1987 This man is famous in the study of Samaritans. He is a respected Samaritan High Priest. He was born in a smart and religious family. Yaacob II learned a lot about the Samaritan religion and ways from his granddad. His grandfather, Yaacob I ben Aaharon ben Shalma, took care of him when his parents died young. When he was a kid, Yaacob II was good at learning and languages. He learned Hebrew, Arabic, and English fast. He was the head of a big Samaritan Cohen group called Sons of Jacob. People in the Samaritan community respected him a lot for his intelligence and wisdom. In 1984, Yaacob II became the Samaritan High Priest. He got this role from Phinehas X ben Matzliach ben Phinehas. While he was High Priest, he worked hard. He made the Samaritan community stronger and helped them get along with other religions. Yaacob II cared a lot about keeping and sharing the history and ways of the Samaritans. He wrote a lot about this. He wrote many books that people who want to learn about Samaritans must read. Yaacob II had many hard times. But he never stopped caring for the Samaritan people. He was smart and knew a lot about the Samaritan religion and ways. He is a famous person in the study of Samaritans. People will remember him and learn from him for many years to come. In 1987 he died and Yoseph ben Ab-Hisda ben Yaacov ben Aaharon became the high priest. == References == Category:1899 births Category:1987 deaths Category:Samaritans Category:Samaritan high priests",
 "title": "Yaacob II ben Uzzi ben Yaacob ben Aaharon"
}