{
 "id": "1016870",
 "text": "The Ranipatti Estate (1775–1949) was a zamindari estate in erstwhile Bhagalpur district (now in Madhepura) of Bihar, India. It was one of the prominent Ahir zamindar family of Kosi region. Mandal title was used by the yadav landlord of Ranipatti, which means the head of the village. The chieftains of Ranipatti Estate had zamindari of 56 mauza (revenue villages), which was spread with an area of thousands acres in the modern-day districts of Madhepura, Saharsa and Bhagalpur. ==Origin and History== The estate of Ranipatti was controlled by Majhraut Ahir zamindars. The Kosi and it's adjoining region was once dominated by the Majhraut clan of Ahirs and many zamindaris were in the hands of this clan. The Ranipatti Zamindar family had close links with the Zamindars of the Murho Estate and both these Zamindar families were the most prominent families of the Kosi region, who has played a major role in the development of the region since the pre-independence period. ===Babu B.N. Mandal=== Babu Bhupendra Narayan Mandal, the last zamindar of Ranipatti, was an Indian politician. He was a Member of Parliament, representing Bihar in the Rajya Sabha the upper house of India's Parliament as a member of the Samyukta Socialist Party ==List of Zamindars== *Babu Ramchandra Mandal, He had three sons of whom the eldest and the youngest died without any heir, so his middle son Babu Govind Mandal succeeded him. *Babu Govind Mandal, He had three sons, of whom the middle son Kumar Pitambar Mandal became his successor. *Babu Pitambara Mandal, He had two son Makhan Mandal and Saheb Mandal *Babu Makhan Mandal, He had three sons Baburam Mandal, Bahadur Mandal and Sanphool Mandal *Babu Baburam Mandal, He had two sons Babu Kanhaiya Lal Mandal and Babu Dwarika Lal Mandal. *Babu Dwarika Lal Mandal, he had five sons: Jai Narayan, Krit Narayan, Girwar Narayan, Ram Narayan, Jagat Narayan Mandal. *Babu Jai Narayan Mandal, He had two sons Bhupendra Narayan and Narendra Narayan. *Babu Bhupendra Narayan Mandal, He was the last zamindar of Ranipatti as the zamindari system was abolished after India's independence in 1947. ==See also== *Murho Estate *Tintanga Estate ==References== Category:Bihar Category:Yadav",
 "title": "Ranipatti Estate"
}