{
 "id": "1016808",
 "text": "Partant pour la Syrie, (Departing for Syria) also known as Le beau Dunois was a national anthem of the Second French Empire, dated to 1807. The music was composed by Queen Hortense de Beauharnais and the lyrics were written by Comte Alexandre de Laborde. == Lyrics == === French === Partant pour la Syrie, Le jeune et beau Dunois, Venait prier Marie De bénir ses exploits : Faites, Reine immortelle, Lui dit-il en partant, Que j'aime la plus belle Et sois le plus vaillant. On lui doit la Victoire. Vraiment, dit le seigneur ; Puisque tu fais ma gloire Je ferai ton bonheur. De ma fille Isabelle, Sois l'Epoux à l'instant, Car elle est la plus belle, Et toi le plus vaillant. Il trace sur la pierre Le serment de l'honneur, Et va suivre à la guerre Le Comte son seigneur ; Au noble voeu fidèle, Il dit en combattant : Amour à la plus belle, Honneur au plus vaillant. A l'Autel de Marie, Ils contractent tous deux Cette union Chérie Qui seule rend heureux. Chacun dans la chapelle Disait en les voyant : Amour à la plus belle, Honneur au plus vaillant. === English === Leaving for Syria, The young and handsome Dunois Went to ask the Virgin Mary, His heroic deeds to bless, Make it so, immortal Queen He said on his leaving, That I love the most beautiful (woman) And be the bravest. We owe you the victory Verily! says the lord, Since you have established my glory, I will make you happy! My daughter Isabella Will be your wife For she is the most beautiful (woman) And you the bravest. He writes on stone The oath of honor And follows into war The earl, his lord. Faithful to his noble vow, He said while fighting: Love to the most beautiful (woman) Honor to the bravest. At the altar of Mary, They pledged both This dear union Which alone brings happiness. Everyone in the chapel Said seeing them: Love to most beautiful (woman) Honor to the bravest. == References == Category:Historical anthems Category:French anthems Category:1800s works",
 "title": "Partant pour la Syrie"
}