{
 "id": "1016871",
 "text": "The Varman Dynasty (also known as Yadava-Varman) was a Hindu Yadava dynasty of Indian subcontinent which ruled the East Bihar (Anga) and Bengal. The Varmans established their supremacy after replacing the Chandra Dynasty. Their first capital was at Chamapuri in present-day Bhagalpur, later on it was shifted to Bikrampur in present-day Munshiganj District of Bangladesh. History of Varman Dynasty is known from three copperplates and the Bhuvanesvara inscription of Bhatta Bhavadeva. ==Origin== The rulers of Varman dynasty belonged to Majhraut clan of Yadava race and were related to royal Yadava family of Simhapura. There was controversy relating to identification and location of Simhapura. R.C Majumdar says, one to the north of salt range in Punjab; a second in the Kalinga which has been identified with modern Singapuram in Kalinga (northern Orissa) between Chicacole and Narasannapeta; and third in the Radha, generally identified with Singur of Hooghly district. From the Lakhmandal inscription, it is clear that Simhapura was in Punjab and was ruled by the Varman family, the only other Varman family, who belonged to Yadava race. There can therefore be hardly any doubt that these Varman rulers were an offshoot of the Yadava- Varman of Simhapura in the Punjab region. The information about Yadava rulers of Simhapura in the Yamuna valley is extracted from Lakhmandal inscription of princess Ishvara. There has been mentioned of Simhapura kingdom, which spread from the Giri/Tonse river to the Ganga and from Lakhmandal to Ambala and Saharanpur in the plains. ==History== The Varmans most probably came to Bengal in the train of Kalachuri Karna's invasion of Vanga. Vajravarman seems to have invaded southeastern Bengal from Orissa, probably following the same route as Rajendra Chola's army. It is quite likely that the Vajravarman accompanied Karna, stayed in Bengal, and at an opportune moment carved out an independent Kingdom for themselves. ===Early Rulers=== Vajra Varman was the earliest ruler of this dynasty and victory over Vanga was achieved under his leadership. According to Mr. R.D Banerjee and Dr. D.C Ganguly Varman Kingdom in Eastern Bengal was founded by Vajravarman. The only record mentioning Vajra Varman's name is the Belava inscription, which praised him only as a poet, brave warrior, and an intellectual. Adideva was minister of Vajra Varman, whose grandson Bhatta Bhavadeva served as the minister of war and peace under King Harivarman. ===Jatavarman=== Jatavarman was the son of Vajravarman and it is believed that Jatavarman accompanied Karna in latter's expedition of Bengal. The reference to Jatavarman's marriage with Virashri, daughter of Karna, and to Jatavarman's war with Kaivarta chief Divya, who wrested northern Bengal from the Palas, help us in fixing the date of Jatavarman's rise to power sometime in between 1050 and 1075 AD. He attacked Varendra with a hostility towards Buddhism. Though the Kaivarta regime there did not suffer any loss, a part of Buddhist monastery of Somapura was destroyed by fire set by Jatavarman's army. The account of Jatavarman's military conquests is given in the Belava plate of Bhojavarman. Jatavarman's marriage with Karna's daughter Virashri was significant and was perhaps a great factor in the rise of the political fortunes of the Varman Dynasty. Jatavarman's assault on Anga, as mentioned in the Belava plate, must have involved him in a struggle with the Pala Empire but he made himself powerful in the region after capturing the parts of Anga. Jatavarman's other two adversaries were Govardhana and the King of Kamarupa. He snatched away a part of Pundravardhana , then under the sovereign rule of Kamarupa. ===Harivarman=== Harivarman, under whom Bhatta Bhavadeva of the Bhuvanesvara Prashasti served as the minister of war and peace. On the basis of the colophon of the manuscript it can be assumed that Harivarman had a long reign of 46 years. It confirms to the information of the Bhuvanesvara inscription, where it is recorded that he ruled for a long time. Harivaman, having seen Ramapala's success in recovering northern Bengal, propitiated Ramapala in order to avoid a Pala attack on his territory. It is doubtful whether Harivarman extended his rule towards Orissa. There is reference to a son of Harivarman both in the Bhuvanesvara inscription and Vajrayogini plate, but hardly anything is known about him. ===Samalavarman=== Samalavarman, another son of Jatavarman, was the next king. His name figures prominently in the genealogical accounts of the Vaidik Brahmins, who are said to have migrated to Bengal from Madhyadesha during his reign. There was matrimonial relation between the Varmans and the Lankan King Vijayabahu I; in all probability Trailokyasundari, daughter of Samalavarman, was married to the Lankan king. Besides Bhojavarman, King Samalavarman had another son named Udayin, who is said to be a great warrior, whom none could approach in the battlefield. ===Decline=== Bhoja Varman, son of Samalavarman was the last independent ruler of Varman Dynasty and the Belava plate was issued in his fifth regnal year from the jayaskandhavara situated at Bikramapura. He was defeated by Vijaysena of Sena Dynasty and rule of Varmans over southeast Bengal came to an end. ==Related pages== *Yadav *Majhraut (Ahir) ==References== Category:Yadav Category:Indian royalty Category:History of India",
 "title": "Yadava-Varman Dynasty"
}