{
 "id": "1016013",
 "text": "The Confederation of the Equator () was a short-lived state established in the northeastern region of Brazil during that nation's struggle for independence from Portugal. The secessionist movement was led by wealthy landowners who opposed early reforms by the nation's first leader, Emperor Pedro I. Pernambuco and Ceará were the first of five Northeastern provinces to secede. A Confederação do Equador , Brazil From multirio.rj.gov.br. Retrieved June 28, 2006. == Background of conflict == The Confederation ceased to exist after being crushed by Brazilian forces under Thomas Cochrane. The rebellion in the Northeast followed a similar uprising in Pernambuco only five years earlier. Before independence, North Brazil had been one of the two separate viceroyalties, Grão-Pará, besides the Viceroyalty of Brazil in the South. Pedro I combined the two into one Imperial State. However, the North was historically more averse to secession from Portugal and had fought to remain part of the Portuguese empire, before being defeated by Pedro I and being annexed. The Confederation was a second popular attempt. Both the secession of Brazil from Portugal and the suppression of the Loyalist Viceroyalty of the North were aided by Britain, militarily and with personnel, such as Thomas Cochrane, on loan to Pedro I, a Freemason and Anglophile. ==Aftermath== Pedro I sent troops to the Northeast to quell the rebellion, with all three provinces falling by September of that year. The state of Ceará managed to survive until November, and the last stronghold of the Confederation in the Sertão was the site of the final resisting leaders of the fallen nation. Several rebels were condemned by a military tribunal to death. One notable execution was that of Frei Caneca an intellectual and religious mentor supporting the cause of the Confederation, in which some soldiers refused to fire. After briefly escaping, he was eventually executed in 1825. ==References== Category:History of Brazil Category:19th-century rebellions Category:1824 establishments Category:1820s disestablishments Category:States and territories established in the 19th century Category:States and territories disestablished in the 19th century",
 "title": "Confederation of the Equator"
}