{
 "id": "101690",
 "text": "Prince Philip, Duke of Edinburgh (born Prince Philip of Greece and Denmark;Multiple sources: * * * * 10 June 1921 – 9 April 2021; ) was the husband of Queen Elizabeth II. He was originally a Prince of Greece and Denmark. He was born on the dining room table in a villa on the Greek island of Corfu, on 10 June 1921. He was the only son and fifth and final child of Prince Andrew of Greece and Denmark and Princess Alice of Battenberg. ==Early life== Prince Philip was on active service in the Royal Navy throughout the Second World War. At the end of the war he was on the destroyer HMS Whelp in the Pacific, and was in Tokyo Bay for the Japanese surrender on 2 September 1945. After he changed his nationality, he became known as Philip Mountbatten. His cousin was Patricia Knatchbull, 2nd Countess Mountbatten of Burma. On 19 November 1947, he was made a Knight of the Garter,Members of the Order of the Garter and given the style of \"Royal Highness\". ==Consort to Queen Elizabeth II== On 20 November 1947, he married Princess Elizabeth, the heiress presumptive to King George VI, he became the Duke of Edinburgh. He was made a Prince of the United Kingdom in 1957. In 2021, he was admitted to King Edward VII's Hospital as a “precautionary measure” after feeling unwell. On 23 February 2021 it was announced that he had an infection. ==Death== On 9 April 2021, it was announced by Buckingham Palace that Prince Phillip had died inside his home at Windsor Castle. An official statement by Buckingham Palace was released on Twitter. > \"It is with deep sorrow that Her Majesty The Queen has announced the death > of her beloved husband, His Royal Highness The Prince Philip, Duke of > Edinburgh. His Royal Highness passed away peacefully this morning at Windsor > Castle.\" His funeral was held on 17 April 2021 and he was buried at St. George's Chapel at Windsor Castle that same day. ==References== ;Notes Category:1921 births Category:2021 deaths Category:British Anglicans Category:British Army officers Category:British military personnel of World War II Category:British royalty Category:Danish royalty Category:Greek royalty Category:House of Windsor Category:Kings and Queens consort of the United Kingdom Category:Knights and Dames Grand Cross of the Order of the British Empire Category:Knights of the Garter Category:Knights of the Thistle Category:Naturalised citizens of the United Kingdom Category:Order of Australia Category:Order of Merit Category:Order of Merit of the Federal Republic of Germany Category:Members of the Privy Council of the United Kingdom Category:Recipients of the Decoration for Services to the Republic of Austria Category:Royal Navy officers Category:United Kingdom Dukes Category:Elizabeth II Category:Exiled royalty",
 "title": "Prince Philip, Duke of Edinburgh"
}