{
 "id": "101693",
 "text": "William IV (William Henry; 21 August 1764 – 20 June 1837) was King of the United Kingdom of Great Britain and Ireland and of Hanover from 26 June 1830 until his death. William, the third son of George III of the United Kingdom and younger brother and successor to George IV was the last person to rule both the United Kingdom and Hanover. His niece, Victoria, ruled only the United Kingdom, not Hanover. He lived for 20 years with Dorothea Jordan. They had ten children. ==Early life== William, Henry was born in 21 August 1765 to the king of England, George III at Buckingham House. He was baptized on 20 September 1765. He joined the royal navy at the age of 13, as a midshipman. He served in the battle of Cape St. Vincent. In 1785, he became a lieutenant and was transferred to the West Indies. He wanted to be a duke like his older brothers, but his father refused. He had an affair with a woman named Doro Jordan from 1791, and she mothered 10 children of his. In 1820 when his father died he became second in line for him to be king. In 1827, he became the first when his older brother died. And in 1830 June 26th when one of his older brothers died too, he became king and was crowned in 8 September, 1831. == Ancestors == William IV of the United Kingdom Father: George III of the United Kingdom Paternal Grandfather: Frederick, Prince of Wales Paternal Great-grandfather: George II of Great Britain Paternal Great-grandmother: Caroline of Ansbach Paternal Grandmother: Princess Augusta of Saxe-Gotha Paternal Great-grandfather: Frederick II, Duke of Saxe-Gotha-Altenburg Paternal Great-grandmother: Magdalena Augusta of Anhalt-Zerbst Mother: Charlotte of Mecklenburg-Strelitz Maternal Grandfather: . Duke Charles Louis Frederick of Mecklenburg-Strelitz, Prince of Mirow Maternal Great-grandfather: Adolf Frederick II, Duke of Mecklenburg-Strelitz Maternal Great-grandmother: Christiane Emilie of Schwarzburg-Sondershausen Maternal Grandmother: Princess Elizabeth Albertine of Saxe-Hildburghausen Maternal Great- grandfather: Ernest Frederick I, Duke of Saxe-Hildburghausen Maternal Great-grandmother: Sophia Albertine of Erbach-Erbach ==Other websites== Category:1765 births Category:1837 deaths Category:People Buried in St. George's Chapel at Windsor Castle Category:Kings and Queens of Hanover Category:19th-century British monarchs Category:Monarchs of the United Kingdom",
 "title": "William IV of the United Kingdom"
}