{
 "id": "1016772",
 "text": "The Ranghar are a community of Muslims Rajputs who were classified as an “agricultural tribe” by the British Raj administration. They were especially associated with the 1st Horse regiment, known as Skinner's Horse. File:The 4th Irregular Cavalry.jpg|2nd Regiment of Skinner's Horse The Ranghar are a community of Muslim Rajputs who were classified as an “agricultural tribe” by the British Raj administration. They were especially associated with the 1st Horse regiment, known as Skinner's Horse. The Ranghar can be found in the provinces of Sindh, Punjab, and Pakistan, as well as in the Indian states of Haryana, Himachal Pradesh, Delhi, and Uttar Pradesh. Historically, they were native to Haryana and also settled in the Doab region of Uttar Pradesh and Delhi. Presently, many Ranghars from Haryana reside in Sindh and Punjab (Pakistan), while those from western Uttar Pradesh remain in India. The Ranghar use titles such as Rana, Rao, and Kunwar before their given names, and commonly adopt Khan as a surname. They speak Ranghari, a dialect of Haryanvi, which is still used by many in both Pakistan and India. Ranghars from Uttar Pradesh often speak Khariboli among themselves and Urdu with outsiders. Following the independence of Pakistan in 1947, a large number of Ranghars from Uttar Pradesh migrated to Sindh, mostly settling in Karachi. The Ranghars are Sunni Muslims of the Hanafi school and follow both Deobandi and Barelvi traditions of South Asia. == History and origin == Ranghars were known as Muslim Rajputs. The Ranghar can be roughly divided into sub-groups, conveniently divided by the Yamuna river. Those to the west of the river remained as pastoralists much longer than the Yamuna Ranghar, who were all settled agriculturist by the start of the 19th century. The partition of India further divided these two groups, with the trans Yamuna Ranghar emigrating to Pakistan, while those of the Doab region remaining in India. They comprise a large numbered of dispersed intermarrying clans. These exogamous groups are made up of myriad landholding patrilineages of varying genealogical depth, ritual, and social status called biradaries or brotherhoods scattered in the various districts of western Uttar Pradesh. The biradari, or lineage is one of the principal point of reference for the Ranghars, and all biradaris claim descent from a common ancestor. Often biradaris inhabit a cluster of villages called chaurasis (84 villages), chatisis (36 villages) and chabisis (26 villages). An example of a chatisa is that of the Chauhan Ranghar of the Agauta pargana of Bulandshahr District. ==References== Category:Rajputs",
 "title": "Ranghar"
}