{
 "id": "1017264",
 "text": "The Auburn Tigers men's basketball team is an American college basketball team. The team plays for Auburn University. The team plays in Division I of the NCAA. The team plays in the Southeastern Conference (SEC). The team started playing in 1906. As of 2023, it is coached by Bruce Pearl. Many good players have been on the Auburn Tigers men's basketball team, such as Charles Barkley. == NCAA tournament == Auburn has been in the NCAA tournament 13 times. Their combined record is 23 wins and 13 losses. 1984 5 East First Round Charlotte, NC 12 Richmond L 71–72 1985 11 Mideast First Round Second Round Sweet Sixteen South Bend, IN South Bend, IN Birmingham, AL 6 Purdue 3 Kansas 2 North Carolina W 59–58 W 66–64 L 56–62 1986 8 West First Round Second Round Sweet Sixteen Elite Eight Long Beach, CA Long Beach, CA Houston, TX Houston, TX 9 Arizona 1 St. John's 4 UNLV 2 Louisville W 73–63 W 81–65 W 70–63 L 76–84 1987 8 Midwest First Round Second Round Indianapolis, IN Indianapolis, IN 9 San Diego 1 Indiana W 62–61 L 90–107 1988 8 Southeast First Round Second Round Atlanta, GA Atlanta, GA 9 Bradley 1 Oklahoma W 90–86 L 87–107 1999 1 South First Round Second Round Sweet Sixteen Indianapolis, IN Indianapolis, IN Knoxville, TN 16 Winthrop 9 Oklahoma State 4 Ohio State W 80–41 W 81–74 L 64–72 2000 7 Midwest First Round Second Round Minneapolis, MN Minneapolis, MN 10 Creighton 2 Iowa State W 72–69 L 60–79 2003 10 East First Round Second Round Sweet Sixteen Tampa, FL Tampa, FL Albany, NY 7 Saint Joseph's 2 Wake Forest 3 Syracuse W 65–63OT W 68–62 L 78–79 2018 4 Midwest First Round Second Round San Diego, CA San Diego, CA 13 Charleston 5 Clemson W 62–58 L 53–84 2019 5 Midwest First Round Second Round Sweet Sixteen Elite Eight Final Four Salt Lake City, UT Salt Lake City, UT Kansas City, MO Kansas City, MO Minneapolis, MN 12 New Mexico State 4 Kansas 1 North Carolina 2 Kentucky 1 Virginia W 78–77 W 89–75 W 97–80 W 77–71OT L 62–63 2022 2 Midwest First Round Second Round Greenville, SC Greenville, SC 15 Jacksonville State 10 Miami (FL) W 80–61 L 61–79 2023 9 Midwest First Round Second Round Birmingham, AL Birmingham, AL 8 Iowa 1 Houston W 83–75 L 64–81 2025 1 South First Round Second Round Sweet Sixteen Elite Eight Final Four Lexington, KY Lexington, KY Atlanta, GA Atlanta, GA San Antonio, Texas 16 Alabama State 9 Creighton 5 Michigan 2 Michigan State 1 Florida W 83–63 W 82-70 W 78-65 W 70-64 L 79-73 == References == Category:Basketball teams in the United States",
 "title": "Auburn Tigers men's basketball"
}