{
 "id": "1017277",
 "text": "Cornelius Adam Igbudu (1914-1981) simply known as Adam Igbudu was the founding evangelist of the Anglican Adam Preaching Society (A.A.P.S), an evangelical group in the Nigerian Anglican Church. In 1992, Professor Michael Y. Nabofa wrote a book about his life titled: \"Adam: The Evangelist\". In May 1998, Professor Sam U. Erivwo wrote that Cornelius Adam Igbudu was held \"in very high regard\" by Bishop Agori Iwe, his contemporary. In August 2022, Linus Edeigba also wrote a book about his life. ==Legacy== Today, the origin of several existing Nigerian independent churches, such as God's Grace Ministry led by D. D. Mimeyeraye (now known as D. D. Miyerijesu) and New Glory Revival Ministry led by S. U. Ayanyen, has been traced to the evangelistic ministry of Cornelius Adam Igbudu in the Nigerian Anglican Church. In recognition of his evangelistic achievements in the Nigerian Anglican Church, Cornelius Adam Igbudu was promoted to the status of a saint and a church was named after him (St. Adam's Anglican Church at Oghio in the Olomu area of Delta State). A secondary school in Araya (Adam Igbudu Memorial Secondary School) was named after him, including a bible school in Emevor (Adam Igbudu Christian Institute). The Anglican Adam Preaching Society (A.A.P.S) has not ended along with Cornelius Adam Igbudu in 1981. In fact, it has expanded over the years and, according to Professor Sam U. Erivwo, through this movement the Urhobo, the Isoko and the Itsekiri witnessed (and is still witnessing) unusual revival. According to Professor Amos Utuama, the Isoko nation has long been evangelized, noting that as far back as 1950, they had a great Evangelist in the person of late Cornelius Adam Igbudu. He was credited with healing ability. He was said to have \"visited church after church winning converts and strengthening believers\". He was also said to have had a disagreement with a prominent Nigerian Isoko cleric, Archbishop Christian Aggrey Apena, whom he accused of \"disturbing his ministry\" in the Nigerian Anglican Church. He was also said to have \"left unbeatable legacies in the Christian race in Isoko\". Archbishop Cyril Odutemu was born on 2 May 1972 at a crusade ground during the evangelical exploits of the late popular evangelist, Cornelius Adam Igbudu. On 30 October 2023, Cornelius Adam Igbudu's contribution to the spread of Christianity in Nigeria was again recognized and he was also described as \"Isoko's greatest evangelist\". Professor Peter Palmer Ekeh, Founder of Urhobo Historical Society, later wrote in his book: History of the Urhobo People of Niger Delta, that \"The evangelical movement of Adam's Anglican Preaching Society (A.A.P.S.), which he founded, bestrode the Anglican Communion in the Former Bendel State. It created waves of mass conversions\". Noted for his great contribution to the growth of the Church of Nigeria (Anglican Communion) through the Anglican Adam Preaching Society,https://web.archive.org/web/20200225221947/http://www.waado.org/UrhoboCulture/Religion/Nabofa/BibleTranslation/BiblePage.html Cornelius Adam Igbudu was said to have \"won thousands to Christ\".https://web.archive.org/web/20231101013547/https://newsngr.com/2023/10/30/cornelius- adam-igbudu-isokos-greatest-evangelist/ Igbudu was also later praised for \"his immense contributions to the spread of the gospel of Christ across Nigeria\", with a tribute by Isaiah Ogedegbe describing him as \"a reputable evangelistic catalyst for gospel propagation and church growth\".https://web.archive.org/web/20240609224326/https://www.nigeriantimes.com.ng/2024/06/exploring- the-life-of-evangelist-cornelius-adam- igbudu/https://web.archive.org/web/20240609224848/https://nggossips.com/2024/06/09/exploring- the-life-of-evangelist-cornelius-adam-igbudu/ In spite of being \"one of the most Isoko influential pastors we had then\", who was said to have \"left unbeatable legacies in the Christian race in Isoko\", yet it is only the AAPS members and few Isoko gospel singers that celebrate Igbudu's life today. ==Death and burial== Cornelius Adam Igbudu died aged 67 on March 12, 1981 and was buried at his compound at Araya on April 4, 1981. ==Related pages== * Anglican Adam Preaching Society ==References== ==Other websites== * Missionary website Category:1914 births Category:1981 deaths Category:People from Delta State Category:Nigerian Christian clergy",
 "title": "Cornelius Adam Igbudu"
}