{
 "id": "1017216",
 "text": "Oscar Gloukh (sometimes Gloch or Gluh, ; born ) is an Israeli professional footballer who plays as an attacking midfielder for Austrian Bundesliga club RB Salzburg and the Israel national team. ==Club career== He started his career in the youth teams of Maccabi Sha'arayim. At the age of 6 he moved to Maccabi Tel Aviv. Gloukh made his professional debut with Maccabi on 8 August 2021 at the 1-1 draw against Hapoel Jerusalem at the Israeli Toto Cup. On 11 April 2022 he also made his Israeli Premier League debut for the club at the 1-1 draw against Maccabi Haifa. There he scored his debut senior goal in the 28th minute. On 27 January 2023 Gloukh signed a contract with Austrian Bundesliga club Red Bull Salzburg. The contract runs till June 2027. He made his debut on 26 February 2023 in a league match versus SV Ried.FC Salzburg Wiki Gloukh scored his first goal in a away victory versus SK Austria Klagenfurt on 2 April 2023.Soccerway ==International career== Gloukh played for the Israel under-19 team since 2021. He was in the team when they qualified qualification to the 2022 UEFA European Under-19 Championship. He scored 4 goals and made 2 assists, including a goal in the final against England which ended in a 1–3 defeat after extra time. Gloukh was named as one of the championship's best performers by ESPN. At this tornament he was in UEFA's team of the tournament., and his goal in the final won the goal of the tournament. Gloukh also plays for the Israel under-21 team.. He made his debut on 2 June 2022, The team was qualified for the 2023 UEFA European Under-21 Championship. On 17 November 2022 he made his debut for the national team . He came in in the 59th minute in a friendly match against Zambia. On 20 November 2022 he was in the starting team versus Cyprus. Gloukh scored his first goal for the senior national team. ==Honours== Red Bull Salzburg * Austrian Bundesliga: 2023 == Other websites == *Oscar Gloukh at the Maccabi Tel Aviv F.C. website * ESPN.com: European U19 Championship men's stars, June 26, 2022 * UEFA.com: 2022 Under-19 EURO finals: Who was the top scorer?, July 1, 2022 * UEFA.com: 2022 Under-19 EURO Team of the Tournament, July 5, 2022 * UEFA.com: Oscar Gloukh wins 2022 Under-19 EURO Goal of the Tournament, July 5, 2022 ==References== Category:2004 births Category:Living people Category:Israeli footballers Category:FC Red Bull Salzburg players Category:Austrian football champions",
 "title": "Oscar Gloukh"
}