{
 "id": "1017385",
 "text": "The Florida Gators men's basketball team is an American college basketball team. The team plays for the University of Florida. The team plays in Division I of the NCAA. The team plays in the Southeastern Conference (SEC). == NCAA tournament results == Florida has been in the NCAA tournament 22 times. Their combined record is 48 wins and 20 losses. However, their appearances in 1987 and 1988 have been vacated by the NCAA. This makes their official record 45 wins and 18 losses. They were NCAA National Champions in 2006 and 2007. 1987* No. 6 Round of 64 Round of 32 Sweet Sixteen No. 11 NC State No. 3 Purdue No. 2 Syracuse W 82–70 W 85–66 L 81–87 1988* No. 6 Round of 64 Round of 32 No. 11 St. John's No. 3 Michigan W 62–59 L 85–108 1989 No. 7 Round of 64 No. 10 Colorado State L 46–68 1994 No. 3 Round of 64 Round of 32 Sweet Sixteen Elite Eight Final Four No. 14 James Madison No. 11 Penn No. 2 Connecticut No. 9 Boston College No. 2 Duke W 64–62 W 70–58 W 69–60 OT W 74–66 L 65–70 1995 No. 10 Round of 64 No. 7 Iowa State L 61–64 1999 No. 6 Round of 64 Round of 32 Sweet Sixteen No. 11 Penn No. 14 Weber State No. 10 Gonzaga W 75–61 W 82–74 OT L 72–73 2000 No. 5 Round of 64 Round of 32 Sweet Sixteen Elite Eight Final Four National Championship Game No. 12 Butler No. 4 Illinois No. 1 Duke No. 3 Oklahoma State No. 8 North Carolina No. 1 Michigan State W 69–68 OT W 93–76 W 87–78 W 77–65 W 71–59 L 76–89 2001 No. 3 Round of 64 Round of 32 No. 14 WKU No. 11 Temple W 69–56 L 54–75 2002 No. 5 Round of 64 No. 12 Creighton L 82–83 2003 No. 2 Round of 64 Round of 32 No. 15 Sam Houston State No. 7 Michigan State W 85–55 L 46–68 2004 No. 5 Round of 64 No. 12 Manhattan L 60–75 2005 No. 4 Round of 64 Round of 32 No. 13 Ohio No. 5 Villanova W 67–62 L 65–76 2006 No. 3 Round of 64 Round of 32 Sweet Sixteen Elite Eight Final Four National Championship Game No. 14 South Alabama No. 11 Milwaukee No. 7 Georgetown No. 1 Villanova No. 11 George Mason No. 2 UCLA W 76–50 W 82–60 W 57–53 W 75–62 W 73–58 W 73–57 2007 No. 1 Round of 64 Round of 32 Sweet Sixteen Elite Eight Final Four National Championship Game No. 16 Jackson State No. 9 Purdue No. 5 Butler No. 3 Oregon No. 2 UCLA No. 1 Ohio State W 112–69 W 74–67 W 65–57 W 85–77 W 76–66 W 84–75 2010 No. 10 Round of 64 No. 7 BYU L 92–99 2OT 2011 No. 2 Round of 64 Round of 32 Sweet Sixteen Elite Eight No. 15 UC Santa Barbara No. 7 UCLA No. 3 BYU No. 8 Butler W 79–51 W 73–65 W 83–74 OT L 71–74 OT 2012 No. 7 Round of 64 Round of 32 Sweet Sixteen Elite Eight No. 10 Virginia No. 15 Norfolk State No. 3 Marquette No. 4 Louisville W 71–45 W 84–50 W 68–58 L 68–72 2013 No. 3 Round of 64 Round of 32 Sweet Sixteen Elite Eight No. 14 Northwestern State No. 11 Minnesota No. 15 Florida Gulf Coast No. 4 Michigan W 79–47 W 78–64 W 62–50 L 59–79 2014 No. 1 Round of 64 Round of 32 Sweet Sixteen Elite Eight Final Four No. 16 Albany No. 9 Pittsburgh No. 4 UCLA No. 11 Dayton No. 7 Connecticut W 67–55 W 61–45 W 79–68 W 62–52 L 53–63 2017 No. 4 Round of 64 Round of 32 Sweet Sixteen Elite Eight No. 13 East Tennessee State No. 5 Virginia No. 8 Wisconsin No. 7 South Carolina W 80–65 W 65–39 W 84–83 OT L 70–77 2018 No. 6 Round of 64 Round of 32 No. 11 St. Bonaventure No. 3 Texas Tech W 77–62 L 66–69 2019 No. 10 Round of 64 Round of 32 No. 7 Nevada No. 2 Michigan W 70–61 L 49–64 2021 No. 7 Round of 64 Round of 32 No. 10 Virginia Tech No. 15 Oral Roberts W 75–70OT L 78–81 * Vacated by the NCAA == References == Category:Basketball teams in the United States Category:University of Florida",
 "title": "Florida Gators men's basketball"
}