{
 "id": "1018281",
 "text": "Roman Kienast (born 29 March 1984) is a former Austrian professional footballer. He played as striker for different clubs in Austria and Norway. He also played for the Austrian national football team. ==Club career== Kienast joined the youth team of Rapid Wien at the age of 14. He debuted in the club's first team in 2002. In the next two seasons he played 24 matches in the Austrian Bundesliga but he did not score a goal. In 2004 he went on loan to SC Rheindorf Altach in the Austrian Football First League (Austria's second highest professional league). After scoring four goals in six games and was called back by Rapid. In 21 appearances for the Vienna side he scored his first goal in the Bundesliga. Rapid won the title. Just before the start of the 2006 season, Kienast came to the Norwegian club Hamarkameratene (Ham-Kam) on loan. He played well during the first spring games, and Ham-Kam decided to buy him. However, he could not prevent the team from going down that season. In the next season, Ham-Kam got promoted back to the Norwegian Premier League, with Kienast playing an integral part in the campaign by scoring 14 goals.Kienast – Ham-Kam presentation After relegation in the meantime, he managed to return to the first-class Tippeligaen with his club at the end of 2007. He himself scored 14 league goals. 30 Julyb 2008b Kienast signed on loan for Helsingborgs IF for four months. Then he went back and played for Ham-Kam until his contract expired in 2009 in the second highest Norwegian league. On January 19, 2010, Roman Kienast moved back to Austria. He moved to SK Sturm Graz. In the 2010/2011 season he scored 19 goals in the championship and thus played a key role in winning the championship. In January 2012 he moved to FK Austria Wien. move from Kienast to Wiener Austria. In the 2013/2014 season he scored the decisive goal to qualify for the group stage of the Champions League, in which he scored Austria Wien's first goal in Champions League history in a 1-1 draw against FC Porto. In January 2015, Roman Kienast returned to SK Sturm Graz. He signed a contract until 2017. He left Sturm after the 2016/17 season. In September 2017 he moved to the Swiss second division club FC Wil. After the contract ended he returned to Austria. There he played for the 2nd league club SC Wiener Neustadt.After the relegation from Wiener Neustadt he went to the regional league (3rd tier) club SV Stripping for the 2019/20 season. He ended his career with the lower-class amateur teams SC Lockenhaus-Rattersdorf‼️ T R A N S F E R U P D A T E ‼️, facebook.com, 10 February 2021 in Burgenland and DSG Milord BLANCO-trainCo in Vienna. Beside that, Kienast was also appointed manager of First Vienna FC's U-18 squad on 14 June 2021.Roman Kienast wird Vienna-U18-Trainer, firstviennafc.at, 14 June 2021 ==International career== Kienast made 11 appearances for the Austria national team. He scored one goal on 27 May in a 1–0 goal win Nigeria in a friendly. After that game coach Josef Hickersberger chose him in the final squad for the UEFA Euro 2008. He played in all three group games. He came on as a substitute against Croatia in the 74th minute and against Poland in the 64th minute. Kienast went off against Germany in the 67th minute. In June 2011 he played his last international match in a 3-1 win in a friendly against Latvia. Players profilr öfb.at ==Personal life== Roman is the son of former Rapid Wien player Wolfgang Kienast and the nephew of former Austria international Reinhard Kienast.Kienast player profile – EURO2008 ==Honours== * Austrian Bundesliga: 2005 (Rapid Wien), 2011 (Sturm Graz), 2013 (Austria Wien) *Austrian Cup: 2010 (Sturm Graz) * Topscorer Austrian Bundesliga: 2011 ==References== ==Other websites== * Player profile at Hamarkameratene's official web site (Norwegian) * Category:1984 births Category:Living people Category:Association football forwards Category:Austrian footballers Category:Players of the Austrian national football team Category:FK Austria Wien players Category:SK Sturm Graz players Category:UEFA Euro 2008 players Category:Austrian football forwards Category:Austrian Football Bundesliga top scorers Category:Austrian football champions",
 "title": "Roman Kienast"
}