{
 "id": "1018425",
 "text": "Smriti Shriniwas Mandhana (18 July 1996) is an Indian cricketer. Smriti represents the Indian women's national team and took part in Royal Challengers Bangalore in the Women's Premier League (WPL). In 2018 Smriti received Arjuna, BCCI and Rachael Heyhoe-Flint Award awards. In 2021, she became the Women's Cricketer of the year. She is regarded as one of the Greatest Opener in women's cricket history. ==Career== Smriti Mandhana’s father Shrinivas and brother Shravan both played cricket at the district level for Sangli and since she watched her brother closely playing for Maharashtra in the Under-16 tournament she too was inspired to play cricket. At the age of nine, Smriti Mandhana's introduction to cricket began when she decided to participate in cricket trials for enjoyment. Despite being naturally right-handed, she had observed her older brother's sessions closely enough to develop her skills as a left-handed batter. Her exceptional talent could be seen when, at the age of 11, she swiftly advanced to represent the Maharashtra Under-19 cricket team. Just four years later in 2011, she found herself a part of the senior team. In just her second match for Maharashtra, she made headlines as she scored an impressive 125 balls 155 runs against Saurashtra, marking her entry into the cricketing scene. On her debut test match against England, she scored a 50, playing a crucial hand in India's historic Test win in England in 2014. Later she scored a brilliant century scoring 127 runs in the only Test against Australia, which was also the first century of her career and was awarded the Player of the Match. She also became the first Indian woman to hit a century in Day-night Tests. ==Achievements== In July 2018, Smriti received the Arjuna Award from Indian minister of youth affairs and sports Kiren Rijiju for her outstanding achievements in women's cricket. ==References== ==Other websites== * Category:1996 births Category:Living people Category:Indian cricketers Category:People from Mumbai Category:Arjuna awardee Category:Sportspeople from Maharashtra",
 "title": "Smriti Mandhana"
}