{
 "id": "1018648",
 "text": "Cúc Phương National Park () is a park in Vietnam. It is in Ninh Bình Province, in the Red River Delta. Cuc Phuong was Vietnam's first national park. It is the largest nature reserve in Vietnam. == History == Cúc Phương was made into a forest reserve in 1960. Human beings have lived in this place since 7,000-12,000 years ago. Modern people have found things that belonged to ancient people in caves in the park: places where human bodies are buried, stone axes, bone spears, oyster shell knives, and tools for turning food into powder. In 1789, Nguyễn Huệ and Thăng Long fought a Vietnamese Civil War battle in the Quen Voi part of the park. In modern times, the 2,500 Muong people who live, farm, and hunt in the park have disagreed with the government of Vietnam. In 1987, the government made 500 Muong move away from the park because they were catching animals and using the land in ways the government did not allow. == Land and weather== Cúc Phương is in the hills of the northern Annamite Mountain Range. The park has mountains with karst rock and valleys with plants in them. The lowest elevation is 150 meters (500 feet) above sea level and the highest is 656 m (2,152 feet), at the summit of May Bac Mountain, or Silver Cloud Mountain. The limestone mountains have many caves, and visitors can go into some of them. The average temperature in Cúc Phương is 21 Celsius (70 Fahrenheit), 9C (48F) in the winter. The highest temperatures can be over 30C (85 F) and lows are just above zero (32 F). In the valleys, the weather is hot and humid. High in the hills, the temperature drops are low enough for people to get frostbite. It rains more than 200 days a year and the average annual rainfall is 2,100mm (7 feet). The dry season is November to February. == Plants and animals == The park has 97 species of mammals. Endangered langurs live in the park. The park has 300 species of birds; 36 reptiles; 17 amphibians; 11 fish; 2,000 species of plants with veinss, and thousands of species of insects. Many of them are on Vietnam's Red Book of endangered species. The park has some Northern Vietnam lowland rain forests and Northern Indochina subtropical forests.Cuc Phuong. DOPA Explorer. Retrieved 30 May 2023. There are many apes and monkeyss in the park: macaques, gibbon, François's leaf monkey and the slow loris. It also has bats, porcupines, flying squirrels, small striped squirrels, belly-banded squirrels, and the black giant squirrels. The park used to have Asiatic black bears, wild dogs, elephants, rhinos, and tigers, but human beings either killed them or killed the animals they eat Leopards, clouded leopards, and jungle cats may still live in the park, but scientists are not sure. Many birds live in the park: bar-backed partridges, scaly-breasted partridges, silver pheasants, red junglefowl, grey peacock-pheasants, laughingthrushes, red-vented barbets, green-eared barbets, scimitar-billed babblers, brown boobooks, scarlet minivets, racket-tailed drongos, racket-tailed treepies, white-winged blue magpies. Some birds only live there for part of the year: thrushes, flycatchers, tits, finches, and pipits. People have also seen hornbills in the forest. There is one subspecies of underground cave fish is also found in the park. It is also the place where scientists first found many invertebrate species, including Zaxiphidiopsis bazyluki. Many plants grow in the park, which has a multi-layered canopy. Tall trees can be 70m high. It also has many flowers, including, orchids; and an abundance of liana and cauliflory. The ferns have very tall leaves. Some of the plants are good spices, medicines, and edible fruits, nuts and shoots. == Conservation programs == There are three conservation programs in the Cúc Phương National park: === Endangered Primate Rescue Center === The primate center has langurs, loris, and gibbon species, include the Delacour's langur, golden-headed langur, and black crested gibbon. These three species are critically endangered. The Frankfurt Zoological Society helped make the center in 1993. It has 180 animals in 50 cages, 4 houses, and two semi-wild places surrounded by fences. === Carnivore and Pangolin Conservation Program === The Carnivore and Pangolin Conservation Program (CPCP) works with small meat-eating animals: (civets, linsangs, small cats, weasels, otters and badgers) and pangolins in Vietnam. The program started in 1995, but then it was only for Owston's civet. In 2006, the program started working with Vietnam's two species of pangolin, the Chinese pangolin and the Sunda pangolin. All of these species are threatened by the illegal wildlife trade. The CPCP rescues animals that have been caught illegally by human beings. It teaches the animals to live in the wild again and teaches people about the animals. === Turtle Conservation Center === People started the turtle conservation center in 1998. It has the most endangered turtles in Vietnam, including the Vietnamese pond turtle which is nearly extinct in the wild. == Visiting the park== Many visitors like come to Cúc Phương National Park. It is one of the most popular nature places in Vietnam. Tens of thousands of Vietnamese and many people from other places visit the park each year. There are places to eat and sleep in the park and nearby. There is a paved road through the park and many hiking paths. Park rangers guard Cuc Phuong and tourists can pay them to show them places to see. == References == == Other websites == *Carnivore & Pangolin Conservation Program *Cúc Phương Turtle Conservation Center *Cuc Phuong Endangered Primate Conservation Center * * Category:National parks in Vietnam Category:IUCN Category II Category:Ninh Bình province",
 "title": "Cúc Phương National Park"
}