{
 "id": "1018969",
 "text": "Leopold Hofmann (31 October 1905 – 9 January 1976) was an Austrian football midfielder. He played for First Vienna FC. He also played for Austrian national football team .Copa do Mundo da FIFA Itália 1934 ==Career== He started his career at Gersthofer SV. 1925 he went to Vienna. There he stayed till the end of his career in 1939. He became Champion and Cup-winner twice with the Vienna.1939 he came back to Gersthofer SV and finished his career there. ==International== He played 29 matches for the Austrian national football team and scored one goal. His first match was on 24 May 1925 a 3-1 away-loss versus Czechoslovakia. His last one was also a loss versus this team on 24 October 1937.ÖFB Players profile He was also a member of the team for the 1934 FIFA World Cup. ==Statistics== ===International=== Appearances and goals by national team and year National team Year Apps Goals Austria Austria 1925 1 0 Austria 1927 5 0 Austria 1928 2 0 Austria 1930 4 0 Austria 1931 2 0 Austria 1932 4 0 Austria 1934 3 0 Austria 1935 3 1 Austria 1936 1 0 Austria 1937 2 0 Total Total 27 1 ===International goals=== :As of match played 24 October 1937. Austria score listed first, score column indicates score after each Hofmann goal. International goals by date, venue, cap, opponent, score, result and competition No. Date Venue Cap Opponent Score Result Competition 1 6 October 1935 Praterstadion, Vienna, Austria 24 4–4 4–4 1933–35 Central European International Cup ==Manager== From 1953 to 1958 he was manager at First Vienna FC. There he coached youth teams and the first team. In 1954–55 Vienna was Austrian champion for the last time. ==Honours== * 1 × Mitropacup: 1931 * 2 × Austrian Champion: 1931, 1933 * 3 × Austrian Cup: 1929, 1930, 1937 * 27 matches and one goal for the Austria national football team (1925 to 1937) ==References== ==Other websites== *FIFA profile Category:1905 births Category:1976 deaths Category:Austrian footballers Category:Players of the Austrian national football team Category:Association football midfielders Category:Austrian football managers Category:First Vienna FC managers Category:Austrian football midfielders",
 "title": "Leopold Hofmann"
}