{
 "id": "101877",
 "text": "The arrondissement of Privas is an arrondissement of France. It is part of the Ardèche department. Its capital, and prefecture of the department, is the city of Privas. ==History== When the Ardèche department was created on 4 March 1790, the arrondissement of Privas was part of that original department. ==Geography== The arrondissement of Privas is bordered to the north by the arrondissement of Tournon-sur-Rhône, to the east by the Drôme department, to the southeast by the Vaucluse department, to the south by the Gard department and to the west by the arrondissement of Arrondissement of Largentière. It is in the southeast of Ardèche. It is the smallest of the arrondissements of the department, with an area of . It has 87,774 inhabitants and a density of inhabitants/km². ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. In the arrondissement of Privas, there are 3 cantons whose communes are in the arrondissement: Bourg-Saint-Andéol, Le Pouzin and Privas. The Canton of Le Cheylard has 33 communes in the arrondissement of Tournon-sur-Rhône and 13 in Privas, the Canton of Le Teil has 13 communes in the arrondissement of Largentière and 6 in Privas, the Canton of Vallon-Pont-d'Arc has 1 commune Privas and 29 in Largentière, and the Canton of La Voulte-sur-Rhône has 9 communes in Tournon-sur-Rhône and 8 in Privas. ===Communes=== The arrondissement of Privas has 66 communes; they are (with their INSEE codes): # Ajoux (07004) # Alba-la-Romaine (07005) # Alissas (07008) # Aubignas (07020) # Baix (07022) # Beauchastel (07027) # Beauvène (07030) # Bidon (07034) # Bourg- Saint-Andéol (07042) # Chalencon (07048) # Châteauneuf-de-Vernoux (07060) # Chomérac (07066) # Coux (07072) # Creysseilles (07074) # Cruas (07076) # Dunière-sur-Eyrieux (07083) # Flaviac (07090) # Freyssenet (07092) # Gilhac- et-Bruzac (07094) # Gluiras (07096) # Gourdon (07098) # Gras (07099) # Larnas (07133) # Lyas (07146) # Marcols-les-Eaux (07149) # Meysse (07157) # Les Ollières-sur-Eyrieux (07167) # Pourchères (07179) # Le Pouzin (07181) # Pranles (07184) # Privas (07186) # Rochemaure (07191) # Rochessauve (07194) # Rompon (07198) # Saint-Apollinaire-de-Rias (07214) # Saint-Bauzile (07219) # Saint-Cierge-la-Serre (07221) # Saint-Étienne-de-Serre (07233) # Saint- Fortunat-sur-Eyrieux (07237) # Saint-Jean-Chambre (07244) # Saint-Julien-du- Gua (07253) # Saint-Julien-en-Saint-Alban (07255) # Saint-Julien-le-Roux (07257) # Saint-Just-d'Ardèche (07259) # Saint-Lager-Bressac (07260) # Saint- Laurent-du-Pape (07261) # Saint-Marcel-d'Ardèche (07264) # Saint- Martin-d'Ardèche (07268) # Saint-Martin-sur-Lavezon (07270) # Saint-Maurice- en-Chalencon (07274) # Saint-Michel-de-Chabrillanoux (07278) # Saint-Montan (07279) # Saint-Pierre-la-Roche (07283) # Saint-Priest (07288) # Saint- Sauveur-de-Montagut (07295) # Saint-Symphorien-sous-Chomérac (07298) # Saint- Thomé (07300) # Saint-Vincent-de-Barrès (07302) # Saint-Vincent-de-Durfort (07303) # Silhac (07314) # Le Teil (07319) # Valvignères (07332) # Vernoux-en- Vivarais (07338) # Veyras (07340) # Viviers (07346) # La Voulte-sur-Rhône (07349) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 07319 Le Teil 8,376 Berg-Helvie Ardèche Rhône Coiron 07186 Privas 8,313 Privas CA Privas Centre Ardèche 07042 Bourg-Saint- Andéol 7,236 Bourg-Saint-Andéol Le Rhône aux Gorges de l'Ardèche 07349 La Voulte-sur-Rhône 5,124 Rhône-Eyrieux CA Privas Centre Ardèche 07346 Viviers 3,788 Bourg-Saint-Andéol Le Rhône aux Gorges de l'Ardèche 07066 Chomérac 3,040 Privas CA Privas Centre Ardèche 07076 Cruas 2,959 Le Pouzin Ardèche Rhône Coiron 07181 Le Pouzin 2,809 Le Pouzin CA Privas Centre Ardèche 07264 Saint- Marcel-d'Ardèche 2,429 Bourg-Saint-Andéol Le Rhône aux Gorges de l'Ardèche 07191 Rochemaure 2,291 Le Pouzin Ardèche Rhône Coiron ==Related pages== * Arrondissements of the Ardèche department * List of arrondissements of France ==References== Privas",
 "title": "Arrondissement of Privas"
}