{
 "id": "1019219",
 "text": "The Bordes family is a French family, which comes from Armagnac, Gascony, and has established in Chile, Bordeaux and Paris. == History == Antoine Dominique Bordes (born in 1815, son of Barthélémy, a physician, and Geneviève Bordes) married Victoire Moser-Pelecier on July 19, 1857 in Besançon. Then three generations of shipowners had been continuing the company he founded. Henri Bordes also created a steamship company and his son Antoine was notably member of the Board of directors of the Compagnie Générale Maritime. Barthélémy Bordes (1766-1840) came from an old and well-known family from Agenais, including royal officers since the 17th century. == Genealogy == Pierre de Bordes, consul of Puymirol: * Jean Raymond de Bordes (1670-1735), surgeon at Céran: ** Margueritte Bordes (1703-) ** Marie Anne Bordes (1715-) ** Jean Blaise Bordes (1706-), surgeon at Fleurance: *** Marie *** Jean (1746-1806), surgeon at Flamarens: **** Antoine Dominique (1773-1816), pharmacist, including posterity. **** Barthélémy (1766-1840), physician, deputy mayor of Gimbrède: * Antoine Aimé Dominique (1800-1850), trader in Bordeaux: ** Henri Bonaventure (1842-1911), member of the Academy of Bordeaux, shipowner, deputy director of Armement Bordes: *** Antoine Pierre Jean (1870-1951), French Navy officer, regional director of the Compagnie Générale Transatlantique, including posterity. *** Jean Henri (1879-1957), cavalry officer, member of the Bordeaux port commission. * Antoine Dominique Apollinaire (1815-1883), shipowner, manager of the Compagnie Générale Maritime: ** Charles Casimir Adolphe (1858-1918), chief executive of Armement Bordes, who married Marthe Lesca. ** Marie Blanche Henriette (1859-1938) Prom. ** Alexandre Louis Barthélemy (1860-1943), secretary of State for the Navy, who married Madeleine Bertera-Wappers, granddaughter of Gustaf Wappers. ** François Joseph Antonin (1863-1940), deputy director of Armement Bordes, who married Louise Charpin. ** Caroline Élise Alexandrine (1865-1924) Lataillade. ** Valentine Irène Marie Thérèse (1869-1921) de Secondat de Montesquieu de Roquefort. == Coat of arms == Picture coat of arms Bordes family : Gules, a border Or charged with eight pomegranates Vert. As described on the grant of arms to King's prosecutor Pierre de Bordes, at the registration of d'Hozier in 1696.Charles-René d'Hozier, Armorial général de France. Guienne, vol.13 page 679,(read online) == Tributes == * Rue Louise Bordes, Villefranche-sur-Mer. * National Museum of the Cape Horners, Saint-Malo. == References == == Bibliography == * * * * * * * Category:Families Category:French people",
 "title": "Bordes family"
}