{
 "id": "1019384",
 "text": "Eliszewa \"Elsa\" Binder (between 31 January and 13 March 1920 on or after 18 June 1942), was a Polish–born Jewish girl who kept a diary in which she documented her life as a Jew during the Holocaust. During the Holocaust, she also courageously helped the other Jews imprisoned in her quarter, by smuggling food, money, and other supplies. She died around the age of 22. She gained some posthumous fame in her homeland because of her diary, in which she documents her life as a Jew during the Holocaust in 1941 and 1942. Binder was born in Stanislawów, Poland, in modern-day Ivano-Frankivsk, Ukraine, between January and March 1920, where she was raised. In September 1939, the Germans began invading Poland (with the help of the Soviet Union) and after occupation began in October, they began persecuting Jews in Poland. In June 1941, the Binder family were trapped in Stanislawów, when the Germans eventually reached their city. Binder lost her citizenship and became stateless. As the persecutions of the Jewish population increased in December 1941, the Binder family were taken into captivity in a quarter in Stanislawów, where Binder lost her younger sister Dora there in 1942. From 23 December 1941 until 18 June 1942, she had kept a diary which she wrote in it regularly. After World War II ended in 1945, Andrea Axt, Binder's cousin, who had escaped Poland and fled to the United Kingdom, returned to Poland after the war ended, and was given Binder's diary. Axt tried to publish the diary but to no avail. ==Early life== In September 1939, Germany invaded and occupied the western part of Poland with the help of the Soviet Union, who attacked the eastern side of Poland, when Binder was 19 years old. In June 1941, the Germans eventually reached Stanislawów, the city where the Binder family lived. This was because, Germany attempted to invade the Soviet Union and occupy the remainder of Poland. Under the Soviet occupation of Poland, conditions were crucial for the Binder family. On October 12, 1941, Germans killed ten thousand Jews in Stanislawów (where Binder lived) in a massacre where Binder lost her sister Bronek in the massacre. In December 1941; two months later, the Binder family were taken into captivity in a ghetto (in the same city where Binder lived), where Binder lost her younger sister Dora there in 1942. ==Period chronicled in Binder's diary== On 23 December 1941, Binder wrote the first entry in her diary. In an entry dated 27 December 1941 (four days after the first one), she wrote about the dangers in the quarter, and that people who live in the ghetto are in constant threat and fear of poverty, violence, starvation, and death. Binder then writes that she had a fight with her mother and were upset at each other for a few days. She then goes on to write that no matter what moods the two are in, she is Binder's most favorite person, and that Binder loves her the most, for she is her \"best friend\", but that when she sees her mother treats her younger sister Dora, this always makes her \"blood boil\" and that she becomes \"jealous\" of her younger sister. She also writes that she does not believes that her mother \"loves her younger sister Dora as much as she loves her, but that she demands more from her and is indulgent to Dora\". Binder then writes that \"she has to express herself more often and more sincerely\". She also writes that \"she thinks it is very naive and silly, for her to read what she just wrote in her diary\". Then she writes that this is her way of thinking. Then she writes \"that she apologizes for writing that in her diary without realization\", \"but that regardless of this discovery, she will continue to write her diary, but that next time she will not read what she just wrote in her diary, right away\". Writing this, Binder was apparently aware that the atmosphere of continual crisis was distorting her normal attitudes and emotions. She felt the need to discuss her feelings but that she could only confide safely in her diary. The last entry written in Binder's diary is dated 18 June 1942. ==Death== Nothing is known about the death of Elsa Binder, but she was obviously still alive by 18 June 1942, when she wrote the final entry in her diary. She most likely died in the quarter in Stanislawów or the Bełżec extermination camp. The exact circumstances of her death are not known for certain, but it is certain that Binder and her parents died during the Holocaust. Due to the fact that Binder's last diary entry dated 18 June 1942, ended abruptly in mid-sentence, and that Binder's diary was found in a ditch not far away from a cemetery (used in the Stanislawów ghetto to shoot Jews to death) in June 1943, a death date of 18 June 1942, can be assumed. However, it is unknown how accurate that death date is. ==Related pages== * The Holocaust, a genocide of around six million European Jews and other people which lasted for four years (1941 – 1945) * Anne Frank, a diarist from Amsterdam * Rutka Laskier, a diarist from the Będzin concentration camp * Renia Spiegel, a diarist from Przemyśl * Ruthka Lieblich, a diarist from Andrychów * Věra Kohnová, a diarist from Plzeň * Jerzy Feliks Urmam, a diarist from Drohobych * David Koker, a diarist from the Herzogenbusch prison * Sarah Fishkin, a diarist from modern-day Belarus * Jacques Biélinky, a diarist from Paris * Eva Heyman, a diarist from Oradea * Czesława Kwoka, a Polish Catholic girl, known for being one of the thousands of children who had their \"identity photographs\" taken at Auschwitz. Those photographs are stored in the so-called Death Books. * Yitskhok Rudashevski, a diarist from the Wilno Ghetto * Mary Berg, a diarist from German-occupied Poland. * Elsa Katz, a diarist from German-occupied Czechoslavkia. * Miriam Korber-Bercovici * Petr Ginz * Sorella Epstein * The Secret Holocaust Diaries: The Untold Story of Nonna Bannister (2009) Category:1920 births Category:1942 deaths Category:Holocaust victims Category:Polish Jews",
 "title": "Elsa Binder"
}