{
 "id": "1019007",
 "text": "Anna Erika Shay (January 30, 1961 — June 1, 2023) was an American socialite, businesswoman, philanthropist, and television personality. She was best known as a cast member on the Netflix reality television series Bling Empire. == Early life == Anna Erika Shay was born in Tokyo, Japan, on January 30, 1961, as the eldest of two children to Edward Shay, an American businessman, and Ai Oizumi Shay, a Japanese-Russian businesswoman who came from Russian aristocracy. Her younger brother was Allen Shay. Her older half-brother from her mother's first marriage was Jun Oizumi. Shay graduated from the Buckley School, a private school in Sherman Oaks. She attended the University of Southern California and other colleges. == Career == Shay made her television debut on January 15, 2021, as an original cast member on the Netflix reality television series Bling Empire. She quickly became a breakout star and was often named a fan-favorite. When Jeff Jenkins, the show's executive producer, approached her with the opportunity to join the show, Shay thought she was being asked to help in a behind-the-scenes consultant capacity. She appeared in 22 episodes. == Charity work == Shay was a board member for the George Lopez Foundation; raising awareness about kidney disease and organ donation. == Personal life == Shay had an estimated net worth of $600 million at the time of her death. Shay's date of birth was January 30, 1961, however, the media have consistently reported her birth date to be December 31, 1960. Shay had been married and divorced four times. One of her ex-husbands was from Ireland, with whom she visited Ashford Castle once. Shay's marriage to Kenneth John Kemp, a third generation firefighter with the LAFD, lasted three years and resulted in the birth of her only son, Kenneth Edward \"Kenny\" Shay-Kemp, on October 5, 1993. She raised her son as a single mother after the couple divorced. Her legal name during this marriage was Anna Erika Kemp, later switching back to Shay. She had one granddaughter. == Death == Shay died from a stroke on June 1, 2023. She was 62. == Filmography == Year Title Notes 2021 2021 MTV Movie & TV Awards: Unscripted Presenter 2021 Celebrity Family Feud 1 episode 2021–2022 Bling Empire 22 episodes Source: == References == Category:1961 births Category:2023 deaths Category:Participants in American reality television series",
 "title": "Anna Shay"
}