{
 "id": "1019782",
 "text": "Josef \"Pepi\" Stroh (5 March 1913 in vienna, Austria-Hungary – 7 January 1991 in Vienna) was an Austrian football midfielder and football manager. He played club football mainly with FK Austria Wien. ==Career== He started his career with Floridsdorfer SC. At the age of 17 he moved to Floridsdorfer AC. He debuted on 5 October 1930 and had two other caps in this season. After the first half of the 1932/33 season he moved to FK Austria Vienna in January 1933. Stroh won his first title with the violets in his debut year by winning the ÖFB Cup. He won twice the Mitropapokal in 1933 against Inter Milan and in 1936 against Sparta Prague. During the National Socialist period Josef Stroh also made four appearances in the German national team . He also took part in the 1938 World Cup in France. In this time he played temporary work as a guest player at Arminia Hannover. After the end of the Second World War, he made seven more appearances for Austria. He ended his playing career by winning the championship at the end of the 1948/49 season. For Austria Wien he played 200 matches and scored 94 goals. == International career == He was part of Austria’s team for the 1934 FIFA World Cup. There he didn’t play any match. With Austria national football team, he was also part of the squad for the 1948 Summer Olympics but he didn’t play. He also played for the Germany national football team. and was part of the German squad for the 1938 FIFA World Cup He played one match, the lost replay against Switzerland, as Germany were knocked out in the first round. == Coaching career == He coached SC Wiener Neustadt, FC Wien, SC Schwechat, Jönköpings Södra IF,http://www.sportdenny.se/historik.html Malmö FF, IFK Göteborg, SK Brann, Sandvikens IF and Wiener Sport-Club. ==Honours== *Mitropa-Cup: 1933, 1936 * Austrian Champion: 1949 * Austrian Cup 1933, 1935, 1936 == References == Category:1913 births Category:1991 deaths Category:Austrian footballers Category:Players of the Austrian national football team Category:German footballers Category:FK Austria Wien players Category:Austrian football managers Category:Austrian football forwards Category:Austrian football champions",
 "title": "Josef Stroh"
}