{
 "id": "1019866",
 "text": "A microstateMicrostate, Demography of or ministate is a country that is very small in size, or has very little amounts of people living in it. Usually, both cases are true. However, there are no set definitions of the terms \"state\" and \"very small\".Warrington, E. (1994). \"Lilliputs Revisited\". Asian Journal of Public Administration, 16(1). Some examples that are usually called microstates include Andorra, Bahamas, Comoros, Djibouti, Equatorial Guinea, Fiji, Guyana, Iceland, Kiribati, Liechtenstein, Monaco, Nauru, Palau, San Marino, Tuvalu, Vanuatu and Western Sahara. The smallest state in the world is Sealand, in the U.K. In addition, Greenland has been included here for its possible wishes or chances of independence. Bougainville is also there for the same reason. == Criteria == This is a criteria table to make sure that other countries are connected to its smallness. Generally speaking, only a few countries of the world are so small, remote or lack a few resources that someone else uses these for even part of this year. These countries are tiny Islands, tiny landlocked countries, city states and sparsely populated countries. In function of area In function of population Less than 6000 km22 34 countries Less than 1,000,0002 54 countriesIncluding Bougainville and Greenland Less than 1000 km22 26 countries Less than 500,0002 35 countries Less than 500 km22 19 countries Less than 100,0002 22 countries == Origin == The origin of the word \"microstate\" is Europe, specially in Andorra, Liechtenstein, Malta, Monaco, San Marino and Vatican City. Countries like Cyprus, Djibouti, Guyana, Iceland and Suriname are also microstates because their populations are so small. However, the qualifier for this is having an area of less than 6000 km² or a population of less than 1 000 000 people. == List of microstates == This is a table of all microstates according to the current CIA Factbook. In addition, states with limited recognition are included. Country Area (km2 or sq mi)CIA - The World Factbook PopulationCIA - The World Factbook Capital Continent Subregion 1,000 Vatican City Europe Southern Europe 31,597 Monaco City Europe Western Europe 9,852 Yaren Oceania Micronesia 11,639 Funafuti Oceania Polynesia 34,892 San Marino Europe Southern Europe 39,993 Vaduz Europe Western Europe 80,966 Majuro Oceania Micronesia 7,939 Avarua Oceania Polynesia 2,000 Alofi Oceania Polynesia 54,817 Basseterre Americas Caribbean 389,568 Malé Asia Southern Asia 467,138 Valleta Europe Southern Europe 114,299 St George's Americas Caribbean 100,804 Kingstown Americas Caribbean 303,831 Bridgetown Americas Caribbean 101,489 St John's Americas Caribbean 97,617 Victoria Africa Eastern Africa 21,779 Ngerulmud Oceania Micronesia 85,468 Andorra la Vella Europe Southern Europe 167,591 Castries Americas Caribbean 100,319 Palikir Oceania Micronesia 5,975,383 Singapore Asia Southeast Asia 105,221 Nuku'alofa Oceania Polynesia 74,656 Roseau Americas Caribbean 1,553,886 Manama Asia Western Asia 115,372 South Tarawa Oceania Micronesia 220,372 São Tomé Africa Central Africa 888,378 Moroni Africa Eastern Africa 1,309,448 Port Louis Africa Eastern Africa 660,924 Luxembourg City Europe Western Europe 207,501 Apia Oceania Polynesia 156,300 Stepanakert Asia Western Asia 356,262 North Nicosia Europe Southern Europe 63,118 Tskhinvali Asia Western Asia 603,901 Praia Africa Western Africa 531,365 Tiraspol Europe Eastern Europe 1,409,460 Port of Spain Americas Caribbean 484,991 Bandar Seri Begawan Asia Southeast Asia 962,232 Nicosia Europe Southern Europe 259,323 Sokhumi Asia Western Asia 95% of the population voted for independence. 310,013 Tendoo Oceania Melanesia 313,046 Port Vila Oceania Melanesia 602,445 Podgorica Europe Southern Europe 358,508 Nassau Americas Caribbean 947,760 Suva Oceania Melanesia 419,137 Belmopan Americas Central America 976,143 Djibouti City Africa Eastern Africa 714,766 Honiara Oceania Melanesia 876,181 Thimphu Asia Southern Asia 360,872 Reykjavík Europe Northern Europe 639,759 Paramaribo Americas South America 791,739 Georgetown Americas South America 646,191 Laayoune Africa Northern Africa Greenland effort 95% of autonomy and started a referendum for independence from Denmark. 57,777 Nuuk Americas North America == References == Category:States Category:Microstates",
 "title": "Microstate"
}