{
 "id": "102046",
 "text": "Albi () is a commune in southern France. It is the prefecture of the Tarn department, in the Occitanie region. It is on the side of the Tarn river, about to the northeast of Toulouse. It is the seat of the Archbishop of Albi. The cathedral and the part of the city around it (the Episcopal City) was made a World Heritage Sites in 2010.UNESCO World Heritage Centre – World Heritage Committee inscribes five new cultural sites on World Heritage List and approves two extensions to existing properties. Whc.unesco.org. Retrieved on 28 May 2014. ==History== The first human settlement in Albi was in the Bronze Age (3000-600 BC). After the Roman conquest of Gaul in 51 BC, the town became Civitas Albigensium, the city of the Albigeois. The Cathars had their main centre at Albi and so they were known also as Albigens after the city. The Cathar movement was a branch of Christianity which was persecuted in the Middle Ages. Because of this, the city was almost completely destroyed in a crusade between 1209 and 1229. Since 1678, the city is the seat of an archbishop. Since 1790, it is the capital city of the Tarn department. ==Geography== Albi is in southern France, in the centre of the Tarn department. The Tarn flows through the city and splits it in two; the historical city is on the left side of the river. Several small rivers, tributaries of the Tarn, flows also through the city. It has an area of and its average altitude is ; at the city hall, the altitude is . Albi and its neighboring communes The commune is at northeast of Toulouse and the closest cities are Castres, Toulouse, Mazamet, Graulhet, Lavaur, Gaillac, Montauban, Rodez et Carmaux. It is surrounded by the communes Lescure-d'Albigeois to the north; Saint-Juéry to the northeast; Cunac and Cambon to the east; Fréjairolles to the southeast; Puygouzon to the south; Le Sequestre, Carlus and Saliès to the southwest; Terssac, Marssac-sur-Tarn, Florentin, Rouffiac, Cagnac-les-Mines, Castelnau-de-Lévis. === Climate === The climate of Albi is an oceanic climate with template summers, Cfb (Marine West Coast Climate) in the Köppen climate classification. The average temperature for the year in Albi is . The warmest month, on average, is July with an average temperature of . The coolest month on average is January, with an average temperature of . The highest recorded temperature in Albi is , which was recorded in August. The lowest recorded temperature in Albi is , which was recorded in January. The average amount of precipitation for the year in Albi is . The month with the most precipitation on average is November with of precipitation. The month with the least precipitation on average is July with an average of . ==Population== The inhabitants of Albi are known, in French, as Albigeois (women: Albigeoises). The city of Albi has a population, in 2014, of 49,531; its population density is of inhabitants/km2. ==Administration== Albi is the prefecture of the Tarn department since 1797. It is also the capital of four Cantons: # Albi-1, formed with a part of Albi (15,740 inhabitants) (2014) # Albi-2, formed with a part of Albi and 5 other communes (18,332 inhabitants) (2014) # Albi-3, formed with a part of Albi and 8 other communes (18,145 habitants) (2014) # Albi-4, formed with a part of Albi and 2 other communes (19,064 inhabitants) (2014) It is part of the intercommunality Albigeois (). == Cathedral == St. Cecile´s cathedral is built like a fortress, in a gothic style. The cathedral is built in a very special style. Inside, there are frescoes from the Renaissance, worth a visit. The cathedral has walls which are up to thick. This makes it the biggest brick building in the world. ==Museum== There is a museum dedicated to Henri de Toulouse-Lautrec in the city. De Touluose-Lautrec was born in the city. There are also paintings of other people in the museum. ==People from Albi== * Henri de Toulouse- Lautrec,1864-1901, painter * Jean-François de La Pérouse, 1741-1788, French geographer; sailed around the world. == Education == * École nationale supérieure des mines d'Albi-Carmaux * Institut national universitaire Jean- François Champollion ==Sister cities== Albi is twinned with: * Girona, Spain * Palo Alto, United States * Randwick City Council, Australia * Abomey, Benin == Gallery == (Albi) Eglise Sainte-Marie-Madeleine vue du second niveau du Palais épiscopal.jpg|St-Madeleine Church. (Albi) Palais de la Berbie - Jardin ancienne place d'arme.jpg|Palais de la Berbie garden. (Albi) Cité épiscopale d'Albi - Le palais de la Berbie et la cathédrale Ste Cécile.jpg|Palais de la Berbie and the Ste Cécile cathedral. ==Related pages== * Arrondissement of Albi * Communes of the Tarn department ==References== ==Other websites== * Ville d'Albi - Official website * Albi Tourist Office * France for visitors - Albi Category:World Heritage Sites in France",
 "title": "Albi"
}