{
 "id": "102063",
 "text": "National Parks of Costa Rica National Parks of Costa Rica Manuel Antonio National Park Manuel Antonio National Park Manuel Antonio National Park Manuel Antonio National Park Manuel Antonio National Park Manuel Antonio National Park Manuel Antonio National Park Manuel Antonio National Park Manuel Antonio National Park Manuel Antonio National Park * * * First Park Poás Volcano National Park, 1955 Smallest Park Manuel Antonio National Park, 16 km² Largest Park La Amistad International Park, 1991 km² Governing body SINAC There are 26 National parks in Costa Rica. These parks are managed by SINAC (Sistema Nacional de Areas de Conservacion). SINAC is part of Costa Rica's Ministry of Environment and Energy. == List of National Parks of Costa Rica == *Arenal Volcano National Park *Barbilla National Park *Barra Honda National Park *Braulio Carrillo National Park *Cahuita National Park *Carara National Park *Chirripó National Park *Cocos Island National Park *Corcovado National Park *Diria National Park *Guanacaste National Park *Irazú Volcano National Park *Juan Castro Blanco National Park *La Amistad International Park *La Cangreja National Park *Las Baulas National Marine Park *Manuel Antonio National Park *Maquenque National Park (proposed) *Palo Verde National Park *Piedras Blancas National Park *Poás Volcano National Park *Rincón de la Vieja Volcano National Park *Santa Rosa National Park *Tapantí National Park *Tenorio Volcano National Park *Tortuguero National Park *Turrialba Volcano National Park == Santa Rosa == The Santa Rosa National Park in the province of Guanacaste is one of the most important historic areas of the country. == Manuel Antonio == Manuel Antonio National Park was listed by Forbes as one of the world's 12 most beautiful national parks. This park is located on the Pacific coast of Costa Rica, in the province of Puntarenas. It has an area of 682.7 mm. It is one of Costa Rica's most scenic parks. Manuel Antonio receives a lot of national and international tourism. An important attraction is the tropical rainforest inhabited by species of flora and fauna in danger of extinction, such as the Tití monkey. == Cocos Island == The island is regarded as a natural laboratory for the study of the evolution of species. Cocos Island is a territory rich landscape and a true laboratory for the study of nature. Many ferns, bromeliads, rivers, creeks and waterfalls, valleys, cliffs and islands frequented by many seabirds and place of nesting gulls. ==References== * Costa Rica",
 "title": "National Parks of Costa Rica"
}