{
 "id": "1020731",
 "text": "Kupala Kupala is a fictional goddess from Slavic stories. She symbolizes peace, water, magic, plants, and the ability to have babies, even though old Slavic folks didn't actually pray to her. She has a twin brother named Kupalo who stands for male ability to have babies. Together with other gods, they make up a god of fertility. There's a special celebration called that her name comes from. The festival is Christian not pagan. == History == Jacob Grimm wrote a book called \"Deutsche Mythologie\" in 1835. In this book, he mentioned that Russians called their summer solstice bonfires \"kupala\". He also wrote that some people said \"kupala\" is the name of Kupulo. Kupulo is a god of harvest. Many experts say the word \"kupala\" means someone who takes a bath. The word comes from \"kupat(i)\" which means to take a bath. But not all experts agree. They say \"kupala\" is the name of a god. People believed in this god before Christianity came. They say it is not about John the Baptist. Vyacheslav Ivanov, Vladimir Toporov. Kupala./В. В. Иванов, В. Н. Топоров. Купала. Мифы народов мира, М:Российская энциклопедия, 1994. Vyacheslav Ivanov and are two of these experts. They think \"kupala\" comes from the same old Indo-European word as \"Cupid\". Cupid is the Roman god of love. This old word means 'passion' or 'desire'. == Etymology == Scholars now believe that nobody worshipped Kupala. They believe the name is derived from Kupala Night. Kupala Is believed to derive from the past tense conjugation of meaning to bathe, possibly to baptize in the name of John the Baptist. This special day marks the beginning of summer and the sun. People call it Kupalo. In the 4th century AD, it became a day to celebrate John the Baptist's birth. He lived before Jesus Christ. When people turned to Christianity, they connected the name \"Kupala\" with the Christian name \"Ivan\". This special day is known as \"Ivan\" and \"Kupala\" in Ukraine and Belarus. \"Ivan\" is another way to say John, like John the Baptist. \"Kupala\" may come from an older Slavic word, \"kump\". \"Kump\" means a group of people together. Some people think these two holidays are related. They think it's because John baptized people by putting them fully in water. But the Kupala celebration happened before Christianity. When people became Christian, they changed the Kupala celebration a little. They made it part of the Christian traditions that also have local stories. == References == Category:Slavic gods and goddesses Category:Slavic pseudo-deities",
 "title": "Kupala"
}