{
 "id": "1020391",
 "text": "Minnale is a 2001 Indian Tamil-language romance movie. It was directed and written by Gautham Vasudev Menon. This is the debut movie of music composer, Harris Jayaraj. This movie stars R. Madhavan, Reema Sen, Abbas, Vivek and Nagesh. The movie released on February 2nd, 2001 to positive reviews. It became a commercial success. This movie was a turning point in R. Madhavan's career. The movie was remade in Hindi as Rehnaa Hai Terre Dil Mein in the same year. Madhavan did the same role, which did average at the box office. == Summary == The story follows Rajesh, a young man who falls in love with Reena, a woman he sees at a friend's wedding. He becomes obsessed with her, but when he tries to approach her, he discovers that she is engaged to Rajiv, an NRI living in the U.S.. Rajesh is shocked but after learning that the last time Reena and Rajiv saw each other was during childhood, Rajesh's grandfather encourages Rajesh to impersonate as Rajiv to win Reena’s love. Rajesh (known as Rajiv) spends some time with Reena under this false identity, they fall in love. However, after 5 days, just before Rajesh decides to reveal the truth, the real Rajiv soon returns to India, leading to a conflict between the two men and Reena feeling betrayed. When Rajesh goes to her house to apologize to Reena, she gets frustrated with him and cancels their relationship. One day, Rajesh meets Rajiv to confront him, but he is shocked to notice that Rajiv is the same rival from his old college. They try to convince him several times to break up with Reena but he refuses to listen to him. Eventually, Rajesh realizes that what he did was wrong and decides to let Rajiv be with Reena, much to his friends' dismay. However, eventually, Reena starts falling in love with Rajesh, despite her deception towards her, which Rajiv doesn't realize until the day of the wedding. Rajiv brings Reena to Rajesh, who is at the airport about to board his plane to Singapore for his new job. Reena and Rajiv are happily reunited again. == Cast == * Madhavan as Rajesh Shivakumar (Porki/Rajiv (Fake)) * Abbas as Rajiv Samuel (Sam) * Reema Sen as Reena Joseph * Nagesh as Subramanyam \"Subbuni\" * Vivek as Chockalingam 'Chokku' * Kitty as Joseph, Reena's father * Fathima Babu as Shanthi, Reena's mother * Rajiv Choudhry as Rajiv's father * Janaki Sabesh as Rajiv's mother * A. C. Murali Mohan * Raji Iyer as Vasuki, Reena's friend * Pondy Ravi as Ravi, Reena's neighbour in Chennai * Manish Borundia as Manish, Rajesh's classmate * Krishna as the lorry driver * Vidharth as Rajesh's classmate (uncredited) * Gautham Vasudev Menon as the flower deliveryman to Reena (uncredited) * R. D. Rajasekhar as the flower deliveryman to Reena (uncredited) * Nagendra Prasad as a dancer in Azhagiya Theeye song (uncredited) * Shobi as a dancer in Azhagiya Theeye song (uncredited) * Sridhar as a dancer in Azhagiya Theeye song (uncredited) ==References== Category:2000s Indian movies",
 "title": "Minnale"
}