{
 "id": "1020772",
 "text": "Josef Epp (1 March 1920 - 28 February 1989) was an Austrian footballer and manager. He played at the 1948 Summer Olympic Games with the Austrian national football team. He played in the forward position. Epp played mainly for Wiener Sport-Club and LASK. ==Career== At the beginning of his sporting career, Epp was also an athlete with the Vienna Cricket and Football Club before deciding to play football. He started with SC Metallum Wien and went to Wiener Sport- Club in 1937. In his first full season in the top division, he was runner-up with the Sport-Club in 1937–38 and was also able to take second place in the scorer list behind Franz Binder with 15 goals. Even after the annexation of Austria by Germany Epp continued to be one of the most successful strikers in the league and was third in the top scorers list twice in a row in 1939 and 1940. At the end of the war Epp was in Upper Austria . He played for SV Libertas Bad Hall . In early 1946 he went back to Sport-Club. In the spring of 1946, Epp was the subject of a controversy in the daily newspapers about his status as a National Socialist. The player had already worked for the National Socialist secondary school students before the Anschluss and became a Hitler Youth functionary in 1938.Gerhard Urbanek: Österreichs Deutschland-Komplex. Paradoxien in der österreichischdeutschen Fußballmythologie. Der Fall des Josef Epp. Goalgetter des Wiener Sportklub mit HJ- und NS-Vergangenheit. Wien März 2009, S. 229–233 The player was briefly banned in February and March 1946 . Then the Vienna Football Association decided that Epp was not required to be registered and allowed to play. In the years that followed Epp was was regularly his club's top scorer and in 1949 he was second in the top scorer list behind Erich Habitzl. At the end of 1950 he moved on to LASK, who had just been promoted to the top flight. After a year Epp returned to Vienna. He played two more seasons for Vienna. In 1953 he moved to the Swiss first division club Servette Geneva. After his return, he took over the position of player-coach at SV Stickstoff Linz. Epp accepted an offer from LASK and reached the championship title with them in his last season as an active player in 1958. With 195 championship goals Epp is still one of the most successful goal scorers in Austria's top division. ==International== Epp received his first call-up in August 1937 when he won 6-3 with the amateur national team against Hungary and scored a goal. After the annexation of Austria, Epp was used several times in the Vienna city team. His first game for the Austrian national team followed against Hungary in a 3-2 winin Vienna on 14 April 1946. His last match was on 3 October 1948 in a 2-1 loss also versus Hungary. He played eight matches and scored five goals.ÖFB Players profile ==References== ==Other websites== * *Josef Epp's profile at Sports Reference.com Category:1920 births Category:1989 deaths Category:Austrian footballers Category:Players of the Austrian national football team Category:Association football forwards Category:Austrian football managers Category:Austrian football forwards Category:LASK players",
 "title": "Josef Epp"
}