{
 "id": "1020632",
 "text": "Ethan Mathias is an American actor, singer, dancer, and musician based in New York City. He is better known for his roles on films, such as Caleb on the Miracle on Christmas (2020) along with Erin Bethea, Young Michael on the Curtain Call (2023). ==Early life== Ethan Mathias was born and raised in Ada Township, Michigan. He attended Ada Vista Spanish Immersion in Forest Hills Public Schools thru 5th grade. He is enrolled in Michigan Connections Academy, an online virtual high school. == Career == Ethan's first major acting role was an appearance in the 2020 film Miracle on Christmas (2020). In 2023 Ethan was cast on the thriller drama film Curtain Call (2023), playing the role of young Michael Murphy. Notably, Ethan was cast as Schroeder, a young autistic artist in 2023 independent short film The Shocking Backpack. The film currently in the middle of pre-production. In July 2024, Ethan was a top 40 finalist in Songbook Academy, hosted by Michael Feinstein's Great American Songbook Foundation. In August 2024, Ethan participated as a Junior Fellow at the Cabaret & Performance Conference at the Eugene O'Neill Theatre Center. Ethan is fluent in Spanish, proficient in Italian and German. He was homeschooled remotely thru Connections Academy through May 2024. Having been involved in various cabarets around NYC, Ethan will make his solo cabaret debut, titled Outside the Lines, on 4/28/2025 at Don't Tell Mama in New York City. Additional dates will be May 17 and July 9. ==Filmography== ===Movie=== Year Title Role Notes 2020 Miracle on Christmas (2020) Caleb Lead 2023 Curtain Call (2023) Young Michael Young version 2023 HOMEWORK (2023) Faulkner Short 2023 Curls (2023) Efraim Short 2023 The Last Boy (2022) Ralph (Play) 2023 On Golden Pond (2022) Billy (Play) 2023 Matlida Jr (2023) Trunchbull (Play) 2024 Teenage Waistband (2024) Kippy (Lead) ===Television=== Year Title Role Notes 2021 Evil Lives Here Young Daniel 1 episode 2020 Next Neighbor (uncredited) 2020 Fargo Italian Child (uncredited) ==References== == Other websites == * * Category:Actors from New York City Category:Living people Category:21st- century American actors Category:American movie actors Category:American television actors",
 "title": "Ethan Mathias"
}