{
 "id": "1020279",
 "text": "The American eel (Anguilla rostrata) is a catadromous teleost fish in the family Anguillidae. It occurs in the Americas, from Greenland to Brazil. It has an elongated body like a snake. It lives in rivers and lakes, mostly in North and Central America. These eels are active during the night. At day they hide on the ground of the river or lake. They feed on insect larvae, worms, smaller fish and small crustaceans. To spawn, they migrate to the Sargasso Sea in the Atlantic Ocean. They grown to a length of about and a weight of up to . == Life cycle == === Eggs === The eggs hatch within a week of deposition in the Sargasso Sea. Fertilization is external, and adult eels are presumed to die after spawning. None has been reported to migrate up rivers. === Leptocephali === The leptocephalus is the larval form, a stage strikingly different from the adult form the eels will grow into. Growth has been evaluated at about 0.21 to 0.38 mm per day. === Glass eel === As they enter the continental shelf, leptocephali metamorphose into glass eels (juveniles), which are transparent and have the typical snake shape of eels. === Elvers === Glass eels become progressively pigmented as they approach the shore; these eels are termed elvers. === Yellow eel === This is the sexually immature adult stage of American eel. They begin to develop a yellow color and a creamy or yellowish belly. In this phase, the eels are still mainly nocturnal. === Silver eel === As the maturation process proceeds, the yellow eel now turns into a silver eel. == Feeding == American eels are nocturnal and most of their feeding occurs at night. They have a keen sense of smell, meaning they most likely depend on scent to find food. === Leptocephalus === Little is known about the food habits of leptocephali. Recent studies suggest that leptocephali do not feed on zooplankton. They likely consume detrital particles such as marine snow and fecal pellets or particles such as discarded houses of larvacean tunicates. === Glass eel and elver === Based on laboratory experiments on European glass eels, Lecomte-Finiger (1983) reported that they were morphologically and physiologically unable to feed. However, Tesch (1977) found that elvers at a later stage of pigmentation, stage VIA4, were feeding. Elvers feed primarily on larvae. === Yellow eel === Yellow eels are benthic omnivores that eat fish, mollusks, bivalves, crustaceans, insect larvae, surface-dwelling insects, worms, frogs and plants. == Related pages == * European eel * Acanthopterygii * List of fish common names == References == # Nelson JS (1994) Fishes of the world. John Wiley and Sons, New York # Froese, Rainer; Pauly, Daniel (eds.) (2005). \"Anguilla rostrata\" in FishBase. 10 2005 version. Category:Eels Category:IUCN Red List endangered species __FORCETOC__",
 "title": "American eel"
}