{
 "id": "102052",
 "text": "Bambi II, originally called Bambi and the Great Prince and then Bambi and the Great Prince of the Forest, is a 2006 American animated drama movie and the sequel to the 1942 movie Bambi. Although it was eventually released in theatres in 25 countries, in the United States and some other countries it was a direct-to-video release (released on February 7, 2006). Taking place in the middle of Bambi during the title character’s adolescence, it shows the Great Prince of the Forest struggling to raise the motherless Bambi, and Bambi's doubts about his father's love. This movie is produced by DisneyToon Studios. == The Story == Picking up shortly after his mother's death, Bambi follows his father, the Great Prince, into the forest. With the help of Thumper and Flower, Bambi must win his father's approval, but the Great Prince finds that his high-spirited son may have a lesson or two to teach him as well. == Production == Many of the backgrounds used in the movie are exactly the same that were used in the original 1942 movie. The old backgrounds were put through the computer to create a clearer image. == Voice Cast == * Patrick Stewart - The Great Prince * Alexander Gould - Bambi * Keith Ferguson - Friend Owl * Brendon Baerg - Thumper * Nicky Jones - Flower * Andrea Bowen - Faline * Anthony Ghannam - Ronno * Makenna Cowgill, Emma Rose Lima and Ariel Winter - Thumper's Sisters * Brian Pimental - Groundhog/Porcupine * Carolyn Hennesy - Bambi's Mother * Cree Summer - Mena * Mary Day, Jordan Orr, Alexis Restrum and George Shenusay - Various Animals * Kath Soucie - Thumper's Mother and Ronno's Mother * Frank Welker - The Hunter Dogs Additional voices were provided by Bob Bergen, Jennifer Darling, Debi Derryberry, Harrison Fahn, Bill Farmer, Jess Harnell, Butch Hartman, Christopher Knights, Jane Krakowski, Sherry Lynn, Mickie McGowan, Mike Myers, Ryan O'Donohue, Devika Parikh, Bob Peterson, Phil Proctor, Jan Rabson-Nyman, Grace Rolek, Jennessa Rose, Tara Strong, Russi Taylor and Joe Whyte. == Release == The movie was released on home video at differing dates, due to it being a theatrical release in some countries. While the movie was a direct-to-video release in countries like the United States, Japan, Canada, mainland China, Hong Kong and Taiwan, it was a theatrical release in some countries like the United Kingdom, France, Austria, Mexico, Dominican Republic, Brazil, Australia and some other European countries. It broke the world record for the longest amount of time between two related movies made in a series, being released 63 and a half years after the first movie. As major studios continue to phase out VHS, this was the last Disney animated movie released on VHS. Following its moratorium strategy, in which releases are made available for a limited time only, Disney gave the DVD a 70-day window for its US release. The movie sold 2.6 million DVDs in its first week in the United States. == Reception == The movie received mixed ratings from professional critics. It holds a score of 44% \"Rotten\" in Rotten Tomatoes and has a rating of 6.1 stars out of 10 in IMDb.Bambi II - Movie Reviews, Trailers, Pictures - Rotten Tomatoes It was praised for its animation - regarded as some of the best among the Disney direct-to-video sequels - but the story was thought to be lacking and easy to make. Movie fans were much more positive, according to ratings on Amazon.com.Amazon.com: Bambi II == Soundtrack == Bambi II's musical score includes instrumental pieces by Bruce Broughton, and new vocal songs by several noted artists, including Alison Krauss, Martina McBride, and Anthony Callea. Coinciding the with film's DVD release, the soundtrack was released by Walt Disney Records in the United States on February 7, 2006. Produced by Matt Walker, the CD included 9 songs from the movie, as well as three tracks from the original movie. # \"There is Life\" (Alison Krauss) – 2:19 # \"First Sign of Spring\" – (Michelle Lewis) – 3:49 # \"Through Your Eyes\" – (Martina McBride) – 4:07 # \"The Healing of a Heart\" – (Anthony Callea) – 2:43 # \"Snow Flakes in the Forest\" – (Bruce Broughton) – 1:40 # \"Bambi's Dream (Broughton) – 1:27 # \"Being Brave (Part 1) (Broughton) – 1:22 # \"Being Brave (Part 2) (Broughton) – 1:13 # \"Bambi and the Great Prince/End Credit Suite\" (Broughton) – 3:34 # \"Sing the Day\" (Various) – 1:53 # \"Main Title (Love is a Song)\" (Donald Novis) – 2:56 # \"Little April Shower\" (Chorus) – 3:54 # \"Let's Sing a Gay Little Spring Song\" (Chorus) – 1:44 == Time period changes == In the original book on which Bambi was based, Ronno was already a stag when Bambi was born, instead of being mere weeks-to- months older than he was as in the movie. An additional twist is that in the book, Ronno was quite respectable (though a bit of a whiner as he is portrayed in the movie), and there was nothing at all personal about his rivalry with Bambi over Faline. Ronno's character is never named in the original movie. However, documentation from Disney clearly indicates that the Ronno in Bambi II is the same deer which Bambi fought in the original, right down to the same moves each deer makes during their fight in the sequel. The age of the Great Prince changes as compared to the original movie. In the original, the Great Prince is said to be twice as old as the oldest deer. In this movie, the Great Prince is said to have been the same age as Bambi's mother. == Double-Takes == There are several scenes in Bambi II which are noticeably similar to scenes from the first movie, Bambi. For example: * In one scene Bambi is shown following his father through snow that, while barely knee-deep on the Great Prince, is neck-deep (and at one point even deeper) on Bambi. The scene is reminiscent of Bambi's first encounter with snow in the original movie. * The scene where Bambi and Thumper wake Flower up for Groundhog Day is quite similar to the scene in Bambi where the animals all go to see Bambi in the beginning. \"*Friend Owl* Well... [chuckle] this is quite an occasion.\" In this movie, he says \"Oh! The young prince! This is a special occasion. Also, when Bambi and Thumper wake up Flower, the entire background painting used for Flower's den is the same painting used when they woke him up in the original movie. * When the song \"Let's Sing a Gay Little Spring Song\" was played in Bambi, Friend Owl was annoyed by all the singing birds keeping him awake. In Bambi II, after the groundhog announces that spring has come, all the gathered animals start singing the song, to which Friend Owl moans, \"Oh, not that song.\" * When Ronno meets Bambi and Faline, he says \"Where's everybody going? Forest on fire?\" This was similar to the end of the first movie when Bambi and the Great Prince escape the forest fire. * In Bambi II, Ronno finds himself buried in snow when a great heap of it falls on him from a branch, similar to what happened to Bambi in the first movie. The difference is that Bambi suffered it only by curiosity, whereas Ronno quite literally brought it upon himself. * While trying to teach Bambi to growl, Thumper adjusts the position of Bambi's front legs much as he did while trying to teach Bambi to ice-skate in the original movie. * Following Bambi's less-than-fortunate encounter with a porcupine, Ronno attempts to drive Faline along with his budding antlers, much the same as he did in Bambi when he tried to break up a romantic scene between the pair. * Bambi's jump across the small chasm over a stream while fleeing from Ronno mirrors his jump across a larger chasm in the first movie after he buried a pack of dogs in a rockslide. * After Bambi's fight with Ronno and Mena's encounter with the trap in Bambi II, she shouts at Bambi the same words that his mother spoke before she was shot: \"Faster, Bambi! Don't look back! Keep running! Keep running!\" * When Bambi is trying to escape the pack of dogs later in the movie, after deterring them from Mena, he struggles and jumps up a cliff which is reminiscent of the cliff that Faline tried to escape the dogs from in the original. * A scene in which the Great Prince repeatedly tells Bambi to get up is reminiscent of a scene in the original movie when Bambi had been shot. The Great Prince says the same words as the forest fire closes in. * Towards the end, as Bambi's antlers begin to emerge, they are momentarily snagged in a low-hanging branch laden with what appear to be cherry blossoms. This directly mirrors the scene where he becomes \"twitterpated\" in the original movie. * After Bambi and Faline kiss, Friend Owl says \"Oh, twitterpated!\" Flower wonders what \"twitterpated\" is, and Friend Owl responds \"I'll tell you when you're older.\" Naturally, Friend Owl did explain what \"twitterpated\" is when Bambi, Thumper, and Flower got older in the original movie. * The scene in which Bambi and Ronno fight mirrors their fight over Faline in the original movie. == Third sequel == In 2007, Pimental expressed interest of making a third movie, which was supposed to continue were the original left off. The movie was originally meant to be released direct-to-DVD in the U.S and in European theaters in late 2011. However, the movie was cancelled and the project was never revived since DisneyToon Studios was shut down and the director of most Pixar movies, John Lasseter was nominated Disney's new chief creative officer. ==Awards== Award Category Winner/Nominee Result Annie Awards Best Animated Feature Brian Pimental Annie Awards Best Voice in an Animated Feature Alexander Gould == References == == Other websites == * * Bambi II at the Big Cartoon DataBase(BCDb) Category:Bambi Category:2006 movies Category:2006 animated movies Category:Disney direct-to-video movies Category:American family movies Category:Sequel movies Category:Movies about father–son relationships",
 "title": "Bambi II"
}