{
 "id": "1020180",
 "text": "The Wikimedia movement is a worldwide community of people who improve projects like Wikipedia. They work together to create and manage these projects. They use open standards and software to create and manage them. It was originally made by volunteers who edit Wikipedia. The movement has grown to include other projects such as Wikimedia Commons and Wikidata. It also includes volunteers who are software engineers and developers. They help make the software called MediaWiki better. MediaWiki is what is used to run the Wikimedia projects. ==Projects== ===Content projects=== Wikimedia has many content projects. These include: * Wikipedia: An online encyclopedia. * Meta-Wiki: A place for talking about ideas about Wikimedia projects. * Wikibooks: A collection for educational books. * Wikidata: A shared collection of data that can be accessed by other projects. * Wikifunctions: A collection of code. * Wikimedia Commons: A shared collection of free images, videos, and sounds. Things there can be used by other projects. * Wikinews: A collection of news articles. * Wikiquote: A collection of quotes. * Wikisource: A library of source texts and documents. * Wikispecies: A taxonomic collection of species. * Wikiversity: A collection of educational materials. * Wikivoyage: A travel guide. * Wiktionary: A dictionary. === Infrastructure projects=== There are other projects that help the Wikimedia movement's infrastructure and interface. They do this by making them work smoothly. These include: * Kiwix: A community project that allows offline access to content projects.Sutherland, Joe. Emmanuel Engelhart, Inventor of Kiwix: the Offline Wikipedia Browser. In: Wikimedia Blog. 12 September 2014. Accessed on 26 November 2014. * MediaWiki: The open-source platform that powers the Wikimedia projects. * Toolforge: A community space that hosts software projects. * Volunteer Response Team: A community group that handles email inquiries. * Wikimedia Cloud Services: A platform for shared cloud computing, based on OpenStack. * Wikitech: A group of developers with a wiki and mailing list. == References == ==Other Websites== * Wikimedia home page * Wikimedia movement structure description at Meta-Wiki Category:Wikimedia Foundation",
 "title": "Wikimedia movement"
}