{
 "id": "1021998",
 "text": "Kuldeep Singh Sisodiya (born January 11, 1994) is an Indian basketball player and coach. Known for his notable awards and his achievements District Collector Award, Open 3x3 Gold Medal (2021), Elite Pro Basketball League Selection (2023), Head Coach of Team Montex Mavericks (2023), Best Sports Personality Award.https://www.vtvgujarati.com/news-details/basketball-fans- more-than-3000-players-scored-goals-see-who-is-kuldeep-singh-selected == Early life and Education == Kuldeep Singh Sisodiya was born on January 11, 1994. He pursued his education and holds a Bachelor's degree in Arts (BA) and Bachelor's degree in Physical Education (BPED). He also holds certification from the National Institute of Sports (NIS).https://www.outlookindia.com/outlook-spotlight/kuldeep-singh-sisodiya- selected-for-elite-pro-basketball-league-in-2023-and-is-set-to-lead-montex- mavericks-in-corporate-basketball-league-news-285241 == Career == Sisodiya's career in basketball began in 2009 when he was selected by the Sports Authority of India as a player. Over the next five years, he participated in various state and national-level competitions, where he consistently showcased his exceptional skills and talent, earning several medals and trophies. In 2015, Sisodiya became a certified professional basketball coach, opening new opportunities for him to share his knowledge and passion for the sport. The same year, he led his team to victory in the Gujarat College Basketball League, solidifying his reputation as an outstanding coach. In 2017, Sisodiya's coaching abilities were recognized on a national level when he was selected as the coach for the Indian Basketball Team during the Traditional Olympic Youth Games held in Nepal. Under his guidance, the team achieved a gold medal, highlighting his exceptional coaching skills and ability to bring out the best in his players. Throughout his career, Sisodiya has received numerous awards and honors for his contributions to basketball. He was honored with the District Collector Award in Ajmer, Rajasthan, for his outstanding achievements in sports. Additionally, he received the Best Sports Personality Award from the Home Minister of Rajasthan and was recognized by the Rajput Khel Mahasangh in Rajasthan. In 2019, Sisodiya's coaching prowess earned him a selection as a coach for the Thailand Traditional Olympic Games. Simultaneously, he continued to excel as a player, participating in the Senior Nationals and emerging victorious in the Teenager Basketball League. The year 2021 proved to be another successful year for Sisodiya, as he won the Open 3x3 Gold Medal and the Ahmedabad Basketball League Gold Medal in the Women's category. In 2022, he led his team to the runners-up position in the Corporate Basketball League and received a cash prize of 1 lakh for his remarkable achievements in sports. In 2023, Sisodiya took on the role of head coach for Team Montex Mavericks in the Corporate Basketball League, further solidifying his reputation as a respected coach. He also continued to excel as a player by participating in the ELITE pro Basketball League and was selected as a player for the Corporate Basketball League Champion Season 2. Furthermore, he led his team to victory in the Teenager Basketball League. == Awards and Achievements == * District Collector Award - In recognition of his exceptional achievements in sports, Sisodiya was honored with the District Collector Award in Ajmer, Rajasthan. * Best Sports Personality Award - Sisodiya received the prestigious Best Sports Personality Award from the Home Minister of Rajasthan for his remarkable accomplishments in basketball. * Rajput Khel Mahasangh Recognition - The Rajput Khel Mahasangh in Rajasthan recognized Sisodiya for his significant contributions to the sport of basketball. * Gold Medal in the Traditional Olympic Youth Games - As the coach of the Indian Basketball Team, Sisodiya led the team to a gold medal victory in the Traditional Olympic Youth Games held in Nepal in 2017. * Victory in the Gujarat College Basketball League - Sisodiya showcased his coaching skills by guiding his team to victory in the Gujarat College Basketball League in the 2015-16 season. * Open 3x3 Gold Medal - Sisodiya emerged victorious and won the Open 3x3 Gold Medal in 2021, demonstrating his prowess as a player. * Ahmedabad Basketball League Gold Medal (Women's) - Sisodiya displayed his skills in the women's category and secured the gold medal in the Ahmedabad Basketball League in 2021. * Runners-up in the Corporate Basketball League - Leading his team, Sisodiya guided them to the runners-up position in the Corporate Basketball League in 2022, showcasing his coaching abilities. * Cash Prize for Best Achievements in Sports - In recognition of his exceptional achievements in sports throughout the year, Sisodiya received a cash prize of 1 lakh. * Head Coach of Team Montex Mavericks - In 2023, Sisodiya assumed the role of head coach for Team Montex Mavericks in the Corporate Basketball League, solidifying his reputation as a respected coach. * Elite Pro Basketball League Selection - Sisodiya's skills as a player earned him a selection as a player in the Elite Pro Basketball League in 2023. * Corporate Basketball League Champion - Sisodiya achieved success as a coach by leading his team to victory in the Corporate Basketball League Champion Season 2 in 2023. * Teenager Basketball League Champion - Sisodiya's leadership skills were evident as he guided his team to become champions in the Teenager Basketball League. == References == == Other websites == * IMDb Category:Living people Category:1994 births Category:Basketball coaches Category:Basketball players Category:Indian sportspeople",
 "title": "Kuldeep Singh Sisodiya"
}