{
 "id": "1021766",
 "text": "Gandhinagar University is a state university located in Ahmedabad/Gandhinagar, Gujarat, India. It was established under the Gujarat Private Universities Act of 2009. == History and Foundation == Gandhinagar University was founded in 2023 by Mr. Harish Rohera, who serves as the President of the university, and Ms. Vinita Rohera, who holds the position of Vice President of the university. The institution aims to offer a diverse range of educational programs under one roof, providing students with an integrated ecosystem of education. == Academics and Programs == Gandhinagar University offers more than ten diverse disciplines and boasts a comprehensive range of ninety courses of study. The university prioritizes a multidisciplinary approach, encouraging students to explore various fields of knowledge and develop a well-rounded understanding. By aligning its educational framework with the National Education Policy 2020, Gandhinagar University ensures that students receive a contemporary and skill- oriented education, preparing them for the challenges of the 21st century. == Recognitions == Gandhnagar University is recognized by the University Grants Commission (UGC). There are also courses which are also approved by the All India Council for Technical Education (AICTE), National Council for Hotel Management and Catering Technology (NCHMCT), Bar Council of India (BCI), Pharmacy Council of India (PCI), Council of Architecture (COA), National Council for Teacher Education (NCTE), member of Association of Indian Universities (AIU), member of Computer Society of India (CSI), member of International Association of Universities (IAU), member of Association of Commonwealth Universities (ACU), member of Institute of Electrical and Electronics Engineers (IEEE), member of The American Society of Mechanical Engineers (ASME) and member of American Chemical Society (ACS). == References == Category:Colleges and universities in India Category:Gujarat",
 "title": "Gandhinagar University"
}