{
 "id": "102154",
 "text": "Sir Brian Harold May (born 19 July 1947) is an English musician, songwriter, producer and astrophysicist, best known as the lead guitarist of the rock band Queen. He uses a guitar he built himself with the help of his father. The guitar they built is called the \"Red Special\". Apart from music, May earned his PhD in astrophysics in 2007 and is currently the Chancellor of Liverpool John Moores University. Together with Patrick Moore and Chris Lintott, he wrote a book called Bang! The Complete History of the Universe. May was ranked 39th in Rolling Stone Magazine's list of the \"100 Greatest Guitarists of All Time.\" == Early life == Brian Harold May, the only child of Harold and Ruth May, was born on 19 July 1947 at Gloucester House Nursing Home in Hampton, Middlesex and attended Hampton Grammar School (now Hampton School). During this time he formed his first band with vocalist and bassist Tim Staffell named Nineteen Eighty-Four after George Orwell's novel of the same name. He graduated from Hampton Grammar School with ten GCE Ordinary Levels and four Advanced Levels in Physics, Mathematics, Applied Mathematics and Additional Mathematics. May's father Harold worked as a draughtsman at the Ministry of Aviation and had been a long-time cigarette-smoker. As a result, May dislikes smoking, even to the point where he has prohibited smoking indoors at his more recent concerts. == Marriage and children == From 1974 to 1988, May was married to Chrissie Mullen, who is the mother of his three children: Jimmy, who was born on 15 June 1978; Louisa, who was born on 22 May 1981 and Emily Ruth, who was born on 17 February 1987. Chrissie and Brian separated in 1988. == Personal life and other musical collaborations == He has stated in interviews that he suffered from depression in the late 1980s, even to the point of contemplating suicide, for reasons having to do with his troubled first marriage and his perceived failure as a husband and a dad, his father Harold's death, and Freddie Mercury's illness. May is married to former Eastenders actress Anita Dobson, whom he met in 1986, and who gained fame in the 1980s for providing vocals to the theme tune to the aforementioned soap, entitled \"Anyone Can Fall in Love\". May himself produced the song, which reached #4 in the UK Singles Chart in August 1986. In May 2020, May had stents put in after suffering a small heart attack. In 2024, May revealed that he had a small stroke which left him unable to play the guitar. He was eventually able to regain movement and play again. == References == Category:1947 births Category:Living people Category:British astrophysicists Category:English rock guitarists Category:English rock singers Category:English singer-songwriters Category:English physicists Category:Musicians from Middlesex Category:Progressive rock singers Category:Queen (band) members",
 "title": "Brian May"
}