{
 "id": "1021407",
 "text": "Kenneth Marshall (born June 27, 1950) was an American actor. == Acting credits == ===Filmography=== Year Title Role Notes 1979 How the West Was Won Pvt. Andrew Willow Episode: \"The Forgotten\" 1979 Tilt Neil Gallagher 1981 The Skin Jimmy Wren 1982–83 Marco Polo Marco Polo Title role, miniseries 1983 Krull Colwyn Journey to Krull Himself / Colwyn Documentary short film On Trial Himself/Guest Documentary 1988 Feds Brent Shepard 1989 Double Exposure: The Story of Margaret Bourke-White Chappie TV movie In the Heat of the Night Stephen Ainslee Episode: \"Rape\" Baywatch Chuck Episode: \"The Drowning Pool\" 1990 Over My Dead Body John Stanton Episode: \"No Ifs, Ands or Butlers\" 1991 Hunter Professor Gleason 2 (combined) episodes: \"Fatal Obesession Part 1+2\" Quantum Leap Rodney Owens Episode: \"A Hunting We Will Go\" 1992 The Commish Sullivan Godfrey Episode: \"True Believers\" 1993 Berlin '39 Hans Message from Nam Dr. George Andrews TV movie 1994 On Trial Himself Documentary Oldest Living Confederate Widow Tells All Ned TV movie Empty Nest Agent #1 Episode: \"Mrs. Clinton Comes to Town\" Amberwaves Dean Deamon 1994–97 Star Trek: Deep Space Nine Lt. Commander Michael Eddington 9 episodes 1993, 1997 Silk Stalkings Bill Marshall, Egan / Babalocia 2 episodes 2000 Dov'è mio figlio Cameron Ellis TV movie 2001 JAG Capt. O'Bryan Episode: \"Liberty\" Shaka Zulu: The Citadel Henry Francis Fynn TV movie 2003 The District Bartender 2 episodes ===Theatre=== Year Title Role Notes 1974 Pericles 2nd Pirate/Lord Delacorte Theater 1975 Hamlet Stagehand Delacorte Theater 1977 Shenandoah Sam Tour 1979 West Side Story Tony Miami, Florida 1980 West Side Story Tony Broadway 1986–87 Into the Woods Cinderella’s Prince Premiere at The Old Globe Theatre == Other websites == * Category:1950 births Category:2023 deaths Category:American movie actors Category:American television actors Category:Actors from New York City Category:University of Michigan alumni",
 "title": "Kenneth Marshall"
}