{
 "id": "102125",
 "text": "Beatles for Sale is The Beatles' fourth album. It was released in late 1964. Many of its songs went into an American release, Beatles '65, from Capitol Records, while the rest went into Beatles VI, a compilation album. John Lennon and Paul McCartney, who wrote most of the band's songs, had filled their earlier album, A Hard Day's Night, with original songs. The band began recording their next album only a week after finishing A Hard Day's Night, and they had little time to compose new music. The band filled the album with cover versions, of songs they had performed live in Hamburg, Germany and the Cavern in Liverpool, their hometown, before the Beatles were famous. Press agent Derek Taylor explained in the album's liner notes that all the recordings on Beatles for Sale were how the band played the music onstage. The original songs on the album were praised, for showing Lennon and McCartney had grown and improved as writers. \"I'm A Loser\" was compared to Bob Dylan's work. \"I'll Follow The Sun\" was an early song, that was given a rewrite. \"What You're Doing\" imitated the musical style of The Byrds, who were just becoming popular. Several live versions of the album's songs have since appeared, that the Beatles played in Germany, and for BBC Radio. ==Album songs== #\"No Reply\" + #\"I'm a Loser\" + #\"Baby's in Black\" + #\"Rock and Roll Music\" (Chuck Berry) + #\"I'll Follow the Sun\" + #\"Mr. Moonlight\" (Roy Lee Johnson) + #\"Kansas City\" (Jerry Leiber and Mike Stoller)/\"Hey, Hey, Hey, Hey\" (Richard Penniman) ++ #\"Eight Days a Week\" ++ #\"Words of Love\" (Buddy Holly) ++ #\"Honey Don't\" (Carl Perkins) + #\"Every Little Thing\" ++ #\"I Don't Want to Spoil the Party\" ++ #\"What You're Doing\" ++ #\"Everybody's Trying to Be My Baby\" (Carl Perkins) + All songs by Lennon/McCartney, unless credited differently \\+ Also appeared on Beatles '65 in the United States ++ Also appeared on Beatles VI Category:The Beatles albums Category:1964 albums Category:Rock and roll albums Category:Folk albums",
 "title": "Beatles for Sale"
}