{
 "id": "1021061",
 "text": "Martin Hiden (born 11 March 1973 in Stainz) is a former Austrian football player. He played as defender for different clubs. He also played for the Austrian national football team. ==Club career== He played for clubs such as Sturm Graz, SV Austria Salzburg (where he claimed his first league title),1988–1997: Austria Salzburg's \"Golden Years\" – Austria Salzburg Rapid Wien, Leeds United (England) and FK Austria Wien. Joining Leeds United in 1998, he was the first-ever Austrian outfield player to play in the Premier League. 2003 he returned to Rapid Wien, winning the Austrian championship once more in 2005. In 2006 he was the new captain of Rapid and in 2007, after the injuries of Andreas Ivanschitz and Martin Stranzl. He was also captain of the national team for two matches. ==International career== He made his debut for Austria in a March 1998 friendly match against Hungary and was a participant at the 1998 FIFA World Cup but did not play. He earned 50 caps, scoring one goal.Appearances for Austrian National Team – RSSSF He also was part of the Euro 2008 squad. ==Coaching career== Hiden has a UEFA B License. He was head coach of FC Pasching from 5 September 2013 to when he was appointed interim head coach of LASK Linz. His first match was a 3–1 win against Villacher SV. His final match was a 3–1 win against Union Gurten. Hiden was named interim head coach of LASK Linz after Karl Daxbacher was sacked. The club had won two of their last eight matches and lost one of their last six. In his debut on 17 March 2015, Linz and SV Horn finished in a 1–1 draw. After one season with Admira Wacker he now works for SK Rapid Wien as individualcoach for the second team.https://www.transfermarkt.at/martin-hiden/profil/trainer/19780 ==Career statistics== ===National team statistics=== Austria national team Austria national team Austria national team Year Apps Goals 1998 7 1 1999 0 0 2000 3 0 2001 7 0 2002 5 0 2003 3 0 2004 7 0 2005 0 0 2006 5 0 2007 11 0 2008 2 0 Total 50 1 ===International goal=== :Scores and results list Austria's goal tally first. # Date Venue Opponent Score Result Competition 1\\. 14 October 1998 Stadio Olimpico (San Marino), Serravalle 3–0 4–1 Euro 2000 qualifier ==Honours== * 4 × Austrian Champion: 1995, 2003, 2005, 2008 * 2 × Austrian Cup: 1997, 2003 * 1 × Champion Regionalliga West: 2011 * 1 × Salzburg Cup: 2011 * 50 matches and 1 goal for the Austrian national football team ==References== ==Other websites== * * Player profile – EURO2008 * * Profile and stats – Austria Archive * Stats – Rapid Archive * National Football Teams * Category:1973 births Category:Living people Category:Austrian footballers Category:Players of the Austrian national football team Category:1998 FIFA World Cup players Category:UEFA Euro 2008 players Category:SK Sturm Graz players Category:FC Red Bull Salzburg players Category:SK Rapid Wien players Category:Premier League players Category:Association football defenders Category:Austrian football defenders Category:Austrian football champions",
 "title": "Martin Hiden"
}