{
 "id": "1021530",
 "text": "Lee Rafkin is a branding expert, marketing strategist, communications professional and CEO of Rafkin Brand Consulting, a boutique consulting firm based in New York City and founded in 2002. == Early Life & Education == Lee Rafkin was born in Brockton, Massachusetts, the youngest of four children. He graduated magna cum laude with a degree in International Relations from Brown University in Providence, RI. He earned an MBA with honors in marketing from the Kellogg School of Management at Northwestern University in Evanston, IL. He also studied at the London School of Economics and as a Rotary International exchange student in Rio de Janeiro, Brazil. == Career == Rafkin has over 25 years of experience as a brand manager, CMO, start-up co-founder, senior executive at large global brand consulting firms, and as founder and CEO of his own brand consulting practice. Rafkin Brand Consulting serves clients in the media, advertising, entertainment, technology, health care, consumer brands, financial services, higher education, and nonprofit sectors, among others. Rafkin has held senior management and practice leadership roles at global brand consulting firms Futurebrand (IPG), Siegel+Gale (Omnicom), and Consumer Dynamics (Independent). Earlier in his career, Lee was marketing director at the kids cable network Nickelodeon and a Brand Manager at Nabisco and Pillsbury. He started his career in the management training program at Merrill Lynch in New York City. Since 2011, Rafkin has served as a fractional CMO in the outdoor advertising industry, working with organizations like OUTFRONT Media, NextGrad Networks, Boldsite Media, Trailhead Media, Motionworks, Adams Outdoor Advertising, national trade association OAAA, and the industry ratings and measurement organization, Geopath. Rafkin is responsible for naming OUTFRONT, Geopath, NextGrad, Boldsite, and Motionworks, among others. Rafkin teaches a strategic branding course and mentors start-up CEO’s at XRC Labs, a business accelerator at The New School at Parsons School of Design in New York, and also at Entrepreneurship for All, an incubator based in Berkshire County, Massachusetts. In December 2021, Rafkin Brand Consulting won a Silver Davey Award from the Academy of Interactive and Visual Arts (AIVA), for the design of its own website, www.rafkin.com. == Personal Life == Rafkin lives in Montclair, New Jersey and New Marlborough, Massachusetts. He is married to Keri (Patton) Rafkin and has two children, Hannah and Alex. == References == Category:American company founders Category:Living people",
 "title": "Lee Rafkin"
}