{
 "id": "1021952",
 "text": "Pantsing is pulling down someone else’s pants and sometimes their underwear without them wanting it It is sometimes a prank and sometimes bullying. ==History== In colleges in the United States before WWII it was extremely common for male sophomores to pants male freshmen. Pantsing was also used in fraternity hazing. In 1971, the journalist Gail Sheehy said that it happened a lot to girls in elementary school and that it was actually sexual assault. ==Nicknames== Pantsing is also called debagging in England, dacking in Australia, breeking in Scotland, down-trou in New Zealand, and jocking in Ireland. It’s also sometimes called sharking but only when it’s used for sexual assault. Another prank that is like this one is giving someone a wedgie where the underwear is pulled up instead of down. Depantsing, debagging, dacking, flagging, sharking, and scanting are other terms for Pantsing. ==Bullying== Pantsing is sometimes used by kids who are bullying other children. In 1996, a woman named Juanita Ross Epp wrote a book saying that teachers who didn’t have a problem with their students pantsing other students were doing a bad job because pantsing was bullying. ==In fiction== In The Simpsons, the nerdy character Martin Prince wears a lot of different bathing suits at the same time when swimming in a pool since he knows Bart Simpson will pull them down but then so many other people pull them down that Martin ends up naked. In Harry Potter and the Order of the Phoenix, Harry is upset when he finds out that when his dead father James Potter was 15, he was a bully to Severus Snape who would use magic to take off Snape’s trousers and maybe his underwear in front of a lot of people and also made him eat soap. ==References== ==Other websites== * * https://m.belfasttelegraph.co.uk/news/northern-ireland/fourth-charge-put-to- lisburn-teen-accused-of-sexual-assault-by-sharking/31576647.html * * https://slate.com/human-interest/2012/07/gretchen-hamel-pantsing-where-did- pantsing-and-depantsing-come-from.html * Pantsing victim awarded $5K in human rights case * https://www.khou.com/amp/article/news/local/6th-grade-students- punished-for-pantsing/285-148654445 * https://www.mugglenet.com/2018/02/james- potter-jerk/ Category:Bullying",
 "title": "Pantsing"
}