{
 "id": "102258",
 "text": "Home education or homeschooling is a form of education where the parent or guardian is the instructor. The reason for this form of education is usually the guardian is not happy with the nearby schools, or sometimes for religious or moral purposes. Many people also want to protect children from bullying and violence. In recent years, it became popular in many countries. Before starting homeschooling, it can be a good idea to deschool first. In some countries, such as the United Kingdom, any homeschool arrangement must by law satisfy inspectors that the children's education is sound. This is because, under the Education Act of 1944, parents or guardians are legally obliged to send children to school. The possibility of other methods has been added as a possibility, subject to certain checks. A common situation is for several families to come together to provide the skills needed. This serves two purposes. First, the range of knowledge and skills is wider, and the schooling has a more social angle, which itself is good for the development of children. In most countries, homeschooling is a legal alternative to going to a school. Unschooling has (much) freedom in its homeschooling. Unschooling is a very free type of homeschooling. == History and publications == The idea of home schools came to life in the 1960s, when the effectiveness of classroom education was challenged. There were a number of critical publications: *Skinner B.F. 1968. The technology of teaching. New York: Appleton-Century- Crofts. The book has discussion of the weaknesses of classroom teaching. *Illich, Ivan 1971. Deschooling society. . In the book, one of his main objections to traditional schooling was its tendency to train young people to fit in to the existing society. Illich was motivated by leftist political ideas. *Holt, John 1963. How children fail. 2nd ed 1982. According to him, schooling does more harm than good to a child's ability and desire to truly learn. *Holt, John 1963. How children learn. 2nd ed 1983. == Alternatives and dangers == Some private schools try to achieve similar objectives by other means. Some private schools attempt to make a school more flexible and responsive to the needs of individual children. Dangers of home education include the possibility of it being used for religious and political propaganda, and the vulnerability of children to unsupervised adults. Education may be uneven, leaving children with a patchy grasp of many subjects. The children would also get to know fewer other children than they would ordinarily. Also, it is obvious that some parents are better placed to organise home education than others. In theory, visits by the inspectors of schools might be able to identify problems. However, at least in the United Kingdom, schools are not inspected every year. If we cannot inspect all schools annually, how can we expect to monitor individual families?Woodhead, Chris 2002. Class war. London: Little, Brown. ==Related pages== *Deschooling *Unschooling *Fushūgaku == References == ==Other websites== *National Home Education Research Institute Category:Education",
 "title": "Home education"
}