{
 "id": "1022797",
 "text": "Zeze Millz (real name Zalika Miller), is a British TV presenter and personality best known as the host of her YouTube show The Zeze Millz Show where she has interviewed Fireboy DML, Wiley, Big Narstie, Beenie Man and Black police officers from the Metropolitan Police. She has been described as \"a big name in the TV and media industry.\" One of her shows featured Tobi Adegboyega saying “The Black Community Have Nothing To Offer Me”. She has also interviewed Ambush Buzzworl. From November 2021 she has hosted a weekly late- night topical discussion programme with Yinka Bokinni on Channel 4 called Unapologetic where \"Black guests talk freely about the big issues of the day and what's new on social media.\" It's been described as a “late-night discussion programme that doesn't hold back” and as \"ever-present and ever- popular\". Her interview with White Yardie where she and Bokinni discussed what defines Black culture was criticised because Yardie was asked when he ‘decided’ to be Jamaican. She says she started her career after she and her friends were stopped from going to a West End nightclub because they were dark-skin Black women and “too big”. She then started an Instagram series, #headscarfdiaries. At that time she had a 9-5 job in events marketing, but was made redundant during the pandemic. She concentrates on issues that affect Black women, and she has talked about being opinionated, getting into social commentary, and colourism in the music industry. She was interviewed on the Wunmi Bello show in April 2022. In December 2021 she said on BBC1 Extra that she was getting ‘tired of being the strong black woman’. She has been involved with the MOBO Awards in the audience, working behind the scenes, as a nominee and, in 2021, as a guest host. She appeared with Harry Pinero in a four-part series Drama vs. Reality in December 2021 for Complex UK and ITV where she represented Reality TV. She appeared in Aml Ameen's film Boxing Day as herself and in Stormzy's video Mel Made Me Do It. She appeared in Dine Hard With Rosie Jones in July 2022. She was a presenter at the GRM Daily Rated Awards for 2022 and was nominated for Personality of the year. In 2022 she was interviewed at length by GRM. She produced a feature for Channel 4 in November 2022 Young, Black and Right-Wing. She points out that the family values and morals of Black people in Britain tend to be more skewed towards the conservative, even though they generally vote Labour. She says Black people need to stop being seen as homogenous. ==References== Category:British activists Category:British television presenters",
 "title": "Zeze Millz"
}