{
 "id": "1022908",
 "text": "Fernando Alcibiades Villavicencio Valencia (11 October 1963 - 9 August 2023) was an Ecuadorian politician, activist and journalist who was a candidate for President of Ecuador in the 2023 general election. He was a member of the National Assembly from 2017 until his assassination in 2023. ==Career== Villavicencio was the first to report about detailed security logs on Julian Assange that staff and security guards at Ecuador's UK embassy kept. In 2015, Cynthia Viteri and Villavicencio sent secret documents to WikiLeaks showing that Ecuador was using an Italian company to run a surveillance program that was spying on journalists and political enemies. During the 2013-2014 National Assembly session, Villavicencio accused President Rafael Correa of having ordered an armed attack at a hospital during a police revolt in September 2010. He was sued by Correa for libel, and Villavicencio was sentenced to 18 months in prison. He traveled to Washington, D.C., to look for help from the Inter-American Commission on Human Rights, but when he returned to Ecuador, he already had an arrest warrant against him. Instead of turning himself in, he hid in the Amazon region until his sentence expired. In May 2023, after President Guillermo Lasso's dissolution of the National Assembly, Villavicencio announced his candidacy for President of Ecuador in the upcoming 2023 election. ==Death== In September 2022, Villavicencio claimed he had many assassination attempts after his home was allegedly attacked by gunfire. On 9 August 2023, Villavicencio was shot in the head after finishing a campaign rally in Quito. He was pronounced dead at the scene. He was 59 years old. One of the suspects, Johan David Castillo, who shot Villavicencio was fatally shot by a police force. Nine others were injured in the attack. ==References== Category:1963 births Category:2023 deaths Category:Ecuadorian politicians Category:Ecuadorian journalists Category:Assassinated people",
 "title": "Fernando Villavicencio"
}