{
 "id": "1022924",
 "text": "Tatyana Nikolayevna Savicheva (Russian: Татья́на Никола́ыевна Са́вичева; 23 January 1930 – 1 July 1944) was a Soviet schoolgirl who during the Siege of Leningrad, used her notebook as a diary. Almost the entire family of Tanya Savicheva died during the siege from December 1941 to May 1942. Her diary consists of nine pages, six of which contains the death dates of her family members. Tanya died after evacuation on 1 July 1944, at the age of 14. Her hospital registration card stated that she suffered from scurvy, dystrophy, neurosis, blindness, and intestinal tuberculosis. Only her older sister Nina and her brother Mikahil had survived the siege, thanks to whom Tanya's diary has survived and has become one of the mournful symbols of the Great Patriotic War. During the 20th century, only excerpts of Tanya's diary were published. The diary was digitized in 2016, and exhibited at the Rumyantsev Mansion. == Biography == Tanya was born on 23 Janaury 1930 in the village of Dvorishchi near Gdov, not far from Lake Peipus, but, liker her brothers and sisters, she grew up in Leningrad (which is why Leningrad is often erroneously indicated as her birthplace). Tanya was the fifth and youngest child of Nikolai Rodionovich Savichev (1884 – 5 March 1936) and Maria Ignatievna Fedorova (1889 – 13 May 1942). She had two sisters named Evgenia (1909 – 28 December 1941) and Nina (23 November 1918 – 6 February 2013), and two brothers named Leonid \"Lyoka\" (1917 – 17 March 1942) and Mikhail (1921–1988). She also had two older sisters and a brother whom she never knew because they died in infancy from scarlet fever in 1916, before she was born. Maria decided in advance that she would not give birth in Leningrad, and in the last month of her pregnancy, she went to Dvorishchi to her sister Kapitolina, whose husband was a doctor and helped Maria give birth. She returned to Leningrad with her infant daughter Tanya, being already a few months old. It is unknown exactly when Tanya was born, though three possible dates are known: * 25 January 1930 – this date is found in many sources, and is probably adjusted to Tatyana's Day. * 23 February 1930 – this date is written on a memorial plague in the courtyard of her house. * 23 January 1930 – Lilia Markova claims that this date is the real birth date of Tanya, in her article \"Tanya Savicheva's Siege Chronicle\". This date is also found on the records of the orphanage, where Tanya arrived as part of evacuation. Tanya's father, Nikolai, owned the Labor Artel of the Savichev brothers, opened by him in 1910 on the 2nd line of Vasilevsky Street in the Sovietskaya Street. Nikolai himself, Maria, and Nikolai's three brothers named Dmitry, Vasily, and Alexei, all worked in the bakery. In the 1930's, Nikolai, who was a Nepman, became \"a lishenet\" and in 1935 the NKVD evicted the Savichevs from Leningrad, to put them on the 101st kilometer for the village of Borovichi, but after sometime the family were able to return to the city, however Nikolai fell ill in exile and died from cancer on 5 March 1936 at the age of 52. He was buried at the Smolensk Orthodox Cemetery not far from the chapel of Xenia the Blessed, where three of his other children were buried earlier in 1916. Being the children of a \"deprived person\" all five Savichevs could not join the Komsomol and were limited in their choice of higher education. By the beginning of the war, Nina and Evgenia worked together at the Nevsky Plant named after Lenin (Evgenia worked in the archive and Nina worked in the design bureau). Leonid served as planer at the Admiralty Shipyards. Misha graduated from factory school and worked as a fitter. Maria was a seamstress, and worked as a homeworker in the sewing company \"May 1 Artel\" and was considered as one of the best embroiders there. Leonid was fond of music and together with his friends formed an amateur string orchestra. They often held rehearsals in Leonid's apartment. The Savichevs had many musical instruments that included a piano, guitars, a banjo, a balalaika, and a mandolin. In their free time, the Savichevs organized home concerts. Leonid and Mikhail played the instruments, Maria and Tanya sang, and the rest kept on with the chorus. Nina and Misha remembered Tanya as \"a very shy and not childishly serious girl\". According to them, \"Tanya was a golden girl. Inquisitive, with a easy and even character. She was very good at listening. We told her about everything. About work, about sports, about friends, etc.\" Tanya had a particularly good relationship with her uncle Vasily. He had a small library in his apartment, and Tanya asked him questions, mostly about life. They often took walks along the Neva. Category:Writers from Saint Petersburg Category:Diarists Category:1930 births Category:1944 deaths",
 "title": "Tanya Savicheva"
}