{
 "id": "1022824",
 "text": "The 2023 FIFA Women's World Cup Final was a football game that decided the winner of the tournament. It happened on August 20, 2023, at Stadium Australia in Sydney, Australia. The teams playing were Spain and England. A total of 75,784 fans were in the stadium to watch, and the referee was Tori Penso from the United States. Both Spain and England were in their first-ever Women's World Cup final. They wanted to achieve a rare feat by winning both the men's and women's World Cups, something only Germany had done before in 2003. Also, they wanted to be the first team from Europe to win the tournament since Germany in 2007. This was the third time in the Women's World Cup history that two European teams faced each other in the final. In the past, new champions emerged in these matches. Spain won the final with a score of 1-0. Olga Carmona scored the only goal, and Mariona Caldentey assisted her. Spain not only became the second country to win both the men's and women's World Cups, but they also achieved another remarkable milestone by holding all three World Cups of the same gender (senior, U-20, and U-17) at the same time, following in the footsteps of Brazil's male teams between 2003 and 2005. == Where it all started == Both teams, Spain and England, were making their Women's World Cup final debut. Spain had participated in two previous Women's World Cups, reaching the round of 16 in 2019, while England had a more extensive history, having played in five previous World Cups, with their best performance in 2015 when they finished number three. This final marked the third all-European final in Women's World Cup history, following 1995 when Norway won against Germany in Stockholm — and 2003 when Germany won against Sweden and won their first title to become the first country to have won both senior World Cups; at the time, their men's team had won three world titles. The 2023 final's winner would be the first European team to win since Germany in 2007 and the first new champion since Japan in 2011. In their previous 17 meetings, England had the upper hand with seven wins, while Spain had three victories, and six matches ended in draws, including the ones at the UEFA Women's Championship. Spain's coach, Jorge Vilda, was managing in his fourth major championship in a row, becoming the first man to lead a Women's World Cup-winning side since Norio Sasaki with Japan in 2011 and the first European man since Even Pellerud in 1995 to achieve this. England's manager, Sarina Wiegman, was in her fourth big tournament. She won the 2017 Euros, came second in the 2019 Women's World Cup with the Netherlands, and won the Women's Euro 2022 with England. She made history by leading different nations in multiple men's or women's World Cup finals and sought to become the first manager to win the tournament with a foreign national team. Unfortunately, she lost, becoming the first manager to lose two successive World Cup finals. == Path to the final == === Spain === Spain's path to the final Phase Opponent Result 3–0 5–0 0–4 5–1 2–1 2–1 Spain qualified for a big women's tournament in 1997 and reached the semi-finals in their first European Championship. They also made it to their first Women's World Cup in 2015. Their best result in the Women's World Cup before was getting to the round of 16 in 2019. Before the tournament started, Spain was ranked sixth in the FIFA Women's World Ranking. They were in group C with Costa Rica, Zambia, and 2011 champions Japan. In their first game of the World Cup against Costa Rica, there was an own goal from Costa Rican player Valeria del Campo. Then, Aitana Bonmatí and Esther González scored two more goals in four minutes, and Spain won 3–0. In their next game, Spain beat Zambia 5–0, with Teresa Abelleira scoring the opening goal in the ninth minute. Alba Redondo and Jennifer Hermoso also scored goals, and it was Jennifer Hermoso's 100th match. In the last group game against Japan, Spain lost 4–0, with two goals from Hinata Miyazawa. In the round of 16, Spain played against Switzerland, who won Group A. Aitana Bonmatí scored first, but then there was an own goal from Laia Codina that gave Switzerland a goal. Spain then scored three more goals in the first half to lead 4–1 at halftime. In the second half, Spain scored one more goal, and the match ended 5–1. In the quarter- finals, Spain played against the Netherlands. Mariona Caldentey scored from a penalty in the 81st minute to give Spain the lead. The Netherlands equalised later, and the game went into extra time. Salma Paralluelo scored the winning goal in extra time. In the semi-finals, Spain faced Sweden. Spain scored first through Salma Paralluelo, but Sweden equalised with a goal from Rebecka Blomqvist. Shortly after, Olga Carmona scored a great goal, sending Spain to their second-ever senior World Cup final. This was Spain's first final since the men's team won the World Cup in 2010. === England === England's path to the final Phase Opponent Result 1–0 1–0 6–1 0–0 2–1 3–1 England made their first appearance in a big women's tournament in 1984, where they finished as runners-up in the European Championship. They also qualified for the Women's World Cup for the first time in 1995. The best they had done in the tournament before was coming in third place in 2015. Before the tournament, the Lionesses had achieved some important victories. They won their first big trophy at the Women's Euro 2022, which they hosted. They also beat Brazil, who had won the Copa América Femenina, in the first ever Women's Finalissima match, played at Wembley. Under manager Sarina Wiegman, they had only lost one match, which was a friendly against Australia. They were ranked fourth in the FIFA Women's World Ranking. In their group, Group D, they had teams like Haiti, Denmark, and China. In the first two games of the tournament, England won 1–0 against both Haiti and Denmark. Georgia Stanway scored a penalty in one match, and Lauren James scored a goal in the other. Needing only a draw in their last group game, England defeated China 6–1, with Lauren James scoring two goals. In the round of 16, England faced Nigeria, who finished second in their group. The match was tough, and England struggled against Nigeria. Lauren James got a yellow card and was later shown a red card after a VAR check. After a goalless 120 minutes, the match went to a penalty shootout. England won the shootout 4–2, with Georgia Stanway missing a penalty but Nigeria missing two. In the next round, England played against Colombia, who had never reached the quarter-finals before. After Colombia scored, England equalised through Lauren Hemp before the first half ended. A goal from Alessia Russo in the 63rd minute secured England's place in the semi-finals against Australia. In the semi- finals, England played against co-hosts Australia. Ella Toone scored first for England, but Australia equalised through Sam Kerr. Lauren Hemp and Alessia Russo scored to help England reach their first Women's World Cup final. ==Match== The game was described as exciting, with Spain having more clear chances to score towards the end. At the beginning, England played energetically and Spain was patient. The first shot happened in the 5th minute when England's Lauren Hemp kicked the ball at Spain's goalkeeper, Cata Coll. Spain then attacked and sent a cross into the box, but it didn't result in a goal. England had some good opportunities too, especially with passes to their forward Alessia Russo. In the 16th minute, Hemp had a great chance to score but hit the crossbar. The match got more intense when Spain attacked and forced England's goalkeeper Mary Earps to make a quick save. Both teams had chances over the next few minutes. In the 23rd minute, a person ran onto the field and interrupted the game briefly. Spain got the ball back but their counterattack didn't work. Then, Spain's Olga Carmona scored a goal in the 29th minute after taking a shot that went between the goalkeeper and the post. Spain's goal came from a fast attack, not from their usual possession style. After this, England struggled and Spain had more chances to score. In the second half, England changed their formation and brought in new players. They tried to defend better and create more opportunities, but they faced challenges. Spain got a penalty kick, but their shot was saved by England's goalkeeper. The game had some pauses due to injuries and video reviews. Spain controlled the game more in the later part, and despite England's efforts, they couldn't score. The match ended after extra time with Spain winning. ===Details=== {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 23 Cata Coll RB 2 Ona Batlle CB 4 Irene Paredes CB 14 Laia Codina LB 19 Olga Carmona (c) DM 3 Teresa Abelleira CM 6 Aitana Bonmatí CM 10 Jennifer Hermoso RF 17 Alba Redondo CF 18 Salma Paralluelo LF 8 Mariona Caldentey Substitutions: Substitutions: Substitutions: DF 12 Oihane Hernández DF 5 Ivana Andrés FW 11 Alexia Putellas Manager: Manager: Manager: Jorge Vilda Jorge Vilda Jorge Vilda Player of the Match: Olga Carmona (Spain) Assistant referees: Brooke Mayo (United States) Kathryn Nesbitt (United States) Fourth official: Yoshimi Yamashita (Japan) Reserve assistant referee: Mijensa Rensch (Suriname) Video assistant referee: Tatiana Guzmán (Nicaragua) Assistant video assistant referee: Pol van Boekel (Netherlands) Offside video assistant referee: Ella De Vries (Belgium) Support video assistant referee: Armando Villarreal (United States) |} Match rules *90 minutes. *30 minutes of extra time if necessary. *Penalty shoot-out if scores still level. *Maximum of twelve named substitutes. *Maximum of five substitutions, with a sixth allowed in extra time. == Aftermath == === With the teams === Spain has become the second country to win both the men's and women's World Cups. They're also the second country, after Brazil's male teams in 2003-2005, to hold all three World Cups of the same gender (senior, under-20, and under-17) at the same time. Salma Paralluelo is the first player, regardless of gender, to win all three World Cups in the same category. In a match, Spain's captain and goalscorer, Olga Carmona, was named the best player. After scoring, she lifted her shirt to show an undershirt with \"Merchi\" written on it, which was the name of her friend's mother who had recently died. In the press room after the match, she dedicated the victory to her. Sadly, she was informed shortly after that her own father had also died before the match. The Spain team took an overnight flight back to Madrid for a public celebration on the evening of 21st August, which was held at Madrid Río park and attended by several thousand people. The victory of the team was prominently featured on the front pages of newspapers on 21st August with strong headlines. The England team stayed overnight in Sydney before returning to London, and they are set to arrive on 22nd August. The Women's Super League won't begin its season until October. Keir Starmer, the UK Leader of the Opposition, has called for the team to be honoured for reaching a World Cup final, something that has happened before in men's sports. The match was also featured on the front pages of all British newspapers on 21st August, mostly showing images of the team looking disappointed, with headlines expressing pride at reaching the final. === Rubiales affair === During the ceremony where medals were given out, the president of the Royal Spanish Football Federation (RFEF), Luis Rubiales, kissed Jennifer Hermoso on the lips, even though she clearly didn't like it. This action was criticized, especially because it highlighted the ongoing issue of sexism in sports, and many people called for Rubiales to step down from his position. In a different situation at the end of the game, Rubiales was caught on camera pointing at the Spanish players and making an inappropriate gesture by grabbing his private area. This rude gesture received further criticism because he was standing next to Infanta Sofía, a teenage member of the Spanish royal family. After Hermoso expressed that she didn't expect or appreciate the kiss, Rubiales went into the players' changing room. He reportedly put his arm around Hermoso and made a joke about marrying her in Ibiza. Later, while on a layover on his way back from Australia, Rubiales posted a video in which he apologized. He said he didn't have bad intentions and was sorry for taking attention away from the celebration. He mentioned that being the president requires being more careful. Rubiales faced a lot of criticism for his actions, and many people, including various Spanish football organizations and the government, called for him to resign. He and the national team coach, Vilda, tried to get Hermoso to support Rubiales by issuing a fake statement when she wouldn't. However, Hermoso released a statement through her union, Futpro, stating that the kiss was unacceptable, and they were working to see that it was appropriately addressed. The RFEF scheduled an extraordinary general meeting for 25th August to discuss this matter. ==Notes== == References == Category:2023 FIFA Women's World Cup Category:FIFA Women's World Cup finals",
 "title": "2023 FIFA Women's World Cup final"
}