{
 "id": "1022333",
 "text": "The 2024 FIM Moto2 World Championship is the premier class of the 76th F.I.M. Road Racing World Championship season. == Teams and riders == Team Constructor Chassis Riders No. Rider names MT Helmets – MSi Boscoscuro B-24 3 Sergio García 79 Ai Ogura Speed Up Racing 21 Alonso López 54 Fermín Aldeguer Klint Forward Factory Team Forward F2 9 Jorge Navarro 17 Alex Escrig 40 Unai Orradre 43 Xavier Artigas CFMoto Aspar Racing Team Kalex Moto2 28 Izan Guevara 96 Jake Dixon Elf Marc VDS Racing Team 12 Filip Salač 14 Tony Arbolino Fantic Racing 20 Xavier Cardelús 31 Roberto García 44 Aron Canet Idemitsu Honda Team Asia 34 Mario Aji 35 Somkiat Chantra Italtrans Racing Team 10 Diogo Moreira 71 Dennis Foggia Liqui Moly Husqvarna Intact GP 15 Darryn Binder 81 Senna Agius OnlyFans American Racing 16 Joe Roberts 24 Marcos Ramírez Preicanos Racing Team 5 Jaume Masià 17 Daniel Muñoz 64 Bo Bendsneyder QJmotor Gresini Moto2 18 Manuel González 75 Albert Arenas Red Bull KTM Ajo 13 Celestino Vietti 32 Marcel Schrötter 53 Deniz Öncü RW-Idrofoglia Racing GP 7 Barry Baltus 84 Zonta van den Goorbergh Yamaha VR46 Master Camp Team 22 Ayumu Sasaki 52 Jeremy Alcoba All teams use series-specified Pirelli tyres and Triumph 765cc 3-cylinder engines. ===Team changes=== *Pons Racing will leave Grand Prix motorcycle racing entirely, ending Sito Pons' 42-year presence in MotoGP as both a rider and team owner. The team has competed in the intermediate class since 2009, the final year of the 250cc class. They will be replaced by MT Helmets – MSi, which will enter Moto2 after having fielded a Moto3 team since 2022. MT Helmets – MSi will use Boscoscuro bikes, instead of the Kalex bikes used by Pons Racing. *Aspar Team will switch from GasGas to CFMoto branding. ===Rider changes=== * Filip Salač will move to Elf Marc VDS Racing Team from QJmotor Gresini Moto2. replacing Sam Lowes who will to the Superbike World Championship with the same team. * Jaume Masià will make his Moto2 debut with Pertamina Mandalika SAG Team, replacing Taiga Hada. Masià was the 2023 Moto3 champion. * Diogo Moreira will make his Moto2 debut with Italtrans Racing Team, replacing Joe Roberts. Moreira raced in the 2023 Moto3 World Championship. * Celestino Vietti and Deniz Öncü will race for Red Bull KTM Ajo, replacing Pedro Acosta who will move up to MotoGP, and Albert Arenas. Vietti will move from Fantic Racing, while Öncü will make his Moto2 debut, having raced in the 2023 Moto3 World Championship. * Sergio García and Ai Ogura will race for the newly-formed MT Helmets – MSi. García will move from the now defunct Pons Racing, while Ogura will move from Idemitsu Honda Team Asia. * Senna Agius will make his full-time Moto2 debut with Liqui Moly Husqvarna Intact GP, replacing Lukas Tulovic who will move to MotoE with the same team. Agius previously served as a replacement rider in 2022 and 2023, and is also the 2023 Moto2 European Champion. * Mario Aji will make his Moto2 debut with Idemitsu Honda Team Asia, replacing Ai Ogura. Aji raced in the 2023 Moto3 World Championship with the same team. * Manuel González and Albert Arenas will race for QJmotor Gresini Moto2, replacing Filip Salač and Jeremy Alcoba. González will move from Correos Prepago Yamaha VR46 Team, while Arenas will move from Red Bull KTM Ajo. * Joe Roberts and Marcos Ramírez will race for OnlyFans American Racing Team. Roberts will move from Italtrans Racing Team and return to the team where he last raced for in 2020. Roberts' supposed teammate is Rory Skinner, who is contracted to race for the team until 2024. However, his contract was terminated and the team signed Ramírez. Ramírez was Skinner's teammate in the last 11 races of the 2023 season after replacing Skinner's original teammate Sean Dylan Kelly, who was sacked by the team midway through the season. Ramírez will also race for the team in a full season for the first time since 2021. * Ayumu Sasaki and Jeremy Alcoba will race for Correos Prepago Yamaha VR46 Team, replacing Kohta Nozane and Manuel González. * Xavier Artigas will make his Moto2 debut with Forward Team. Artigas raced in the 2023 Moto3 World Championship. * Xavier Cardelús and Arón Canet will race for Fantic Racing, replacing Celestino Vietti and Mattia Casadei. Cardelús, who is the 2023 Moto2 European runner-up, will return to Moto2 after having last raced full-time in the class in 2019, while Canet will move from the now defunct Pons Racing. ====Mid-season changes==== * Ayumu Sasaki missed the Americas round after having double arm pump surgery. He was not replaced. * Álex Escrig missed the French round due to left hand and shoulder pain sustained from a training accident. He was replaced by Jorge Navarro. * Bo Bendsneyder missed the French and Catalan rounds after suffering a fractured collarbone in the Spanish race. He was replaced for both races by Daniel Muñoz. * Deniz Öncü missed the Dutch, German, and British rounds after having surgery on his left hand that was fractured during training. He was replaced for all races by Marcel Schrötter. * Xavi Cardelús missed the German round after injuring his right foot at the previous Dutch round. He was replaced by Roberto García. == Calendar == The following Grands Prix are provisionally scheduled to take place in 2024: Round Date Grand Prix Circuit 1 10 March Grand Prix of Qatar Losail International Circuit, Lusail 2 24 March Grande Prémio de Portugal Algarve International Circuit, Portimão 3 14 April Grand Prix of the Americas Circuit of the Americas, Austin 4 28 April Gran Premio de España Circuito de Jerez – Ángel Nieto, Jerez de la Frontera 5 12 May Grand Prix de France Circuit Bugatti, Le Mans 6 26 May Gran Premi de Catalunya Circuit de Barcelona-Catalunya, Montmeló 7 2 June Gran Premio d'Italia Autodromo Internazionale del Mugello, Scarperia e San Piero 8 30 June TT Assen TT Circuit Assen, Assen 9 7 July Motorrad Grand Prix Deutschland Sachsenring, Hohenstein-Ernstthal 10 4 August British Grand Prix Silverstone Circuit, Silverstone 11 18 August Motorrad Grand Prix von Österreich Red Bull Ring, Spielberg 12 1 September Gran Premio de Aragón MotorLand Aragón, Alcañiz 13 8 September Gran Premio di San Marino e della Riviera di Rimini Misano World Circuit Marco Simoncelli, Misano Adriatico 14 22 September Emilia Romagna Grand Prix 15 29 September Pertamina Grand Prix of Indonesia Mandalika International Street Circuit, Central Lombok 16 6 October Grand Prix of Japan Mobility Resort Motegi, Motegi 17 20 October Australian Motorcycle Grand Prix Phillip Island Grand Prix Circuit, Phillip Island 18 27 October Thailand Grand Prix Chang International Circuit, Buriram 19 3 November Petronas Grand Prix of Malaysia Sepang International Circuit, Sepang 20 17 November Gran Premio de la Comunitat Valenciana Circuit Ricardo Tormo, Valencia === Calendar changes === * The Grand Prix of Qatar will return as the season opener after being the penultimate round in 2023. * The Kazakhstan Grand Prix is set to make its debut this season after its cancellation in 2023 due to homologation works at the circuit along with global operational challenges. * The Grand Prix of Aragon will return this season after not being held in 2023. * The Grand Prix of Kazakhstan was \"postponed until later in the season\" on 3 May, due to the on-going Central Asian flooding. It was announced on 29 May that it will be held on 22 September, the date which the Grand Prix of India is scheduled to be held. It was also announced on the same day the Grand Prix of India will not be held in 2024 and will be postponed to March 2025. On 15 July, it was announced that the Kazakhstan Grand Prix would not take place, and its date would be replaced by a second round at Misano. ==Notes== == References == Category:2024 in sports Category:Grand Prix motorcycle racing Category:2020s in motorsport",
 "title": "2024 Moto2 World Championship"
}