{
 "id": "1022455",
 "text": "The Braak Base Line was the baseline for the state survey of the Duchy of Holstein, the Danish state, the city of Hamburg and the Kingdom of Hanover (Gaussian state survey). Its length was measured in 1820/21 by Heinrich Christian Schumacher between the two trigonometric points near Braak in the district of today's Brunsbek in the district of Langelohe and Ahrensburg. After the reduction by Christian August Friedrich Peters in 1853, the length was determined to be 3,014.45115 toises (5,875.2747 meters). == Position == For the Danish survey, a route in a flat area was chosen: * Today, the North Base point is located at the transition between the Ahrensburg site \"Brauner Hirsch\" and the Stellmoorer Tunneltal on private property, 51.2 meters above sea level. * The South Base point is located between the villages of Braak and Langelohe on a field at 68.0 meters above sea level. Observing the points from the Michaeliskirche in Hamburg and the Friedenskirche in Siek, which later burned down, resulted in the first major side of the triangle for the Danish and Hanoverian triangulation. The points are still preserved but difficult to reach. The formerly open plain between the base points is now developed with the village of Braak, the federal highway 1, the industrial area of Stapelfeld/Braak and the residential area at the southern end of Ahrensburg. == Cooperation == Heinrich Christian Schumacher had a good relationship with the Danish King Friedrich VI., which enabled him to set up the observatory in Altona near Hamburg, which was then in Denmark. His teacher in Göttingen was Carl Friedrich Gauss . So Schumacher initiated the Danish king's request to the Hanoverians to let Gauss participate in the measurement of the baseline. Both were on location from 12. September to 25. October 1820 to combine the surveys of both kingdoms across the Elbe river. Gauss was thus able to forego his own length measurement. Schumacher and Gauss were also in close contact with Johann Georg Repsold . Schumacher used a base measuring device of his friend Repsold to measure the base. Repsold also made important contributions to the determination of the Altona meridian and the meridian circle of the Göttingen Observatory (distance 7.5 toises or 14.618 meters) in the form of his excellent instruments and improvements to existing instruments. == Notes == Category:Geography of Lower Saxony Category:Geography of Schleswig- Holstein Category:Geography of Denmark",
 "title": "Braak Base Line"
}