{
 "id": "1022188",
 "text": "Wilhelm Hahnemann (14 April 1914 – 23 August 1991) was an Austrian football player. He started his career at Admira Vienna. He also played for the Austrian national football team. After the occupation of Austria by Nazi- Germany he also played for the German national football team. ==Club career== Willy Hahnenmann began his football career at SR Donaufeld. 1931 he came to SK Admira Wien in the first division. In the period up to 1939 he won five Austrian championships and the ÖFB Cup twice. In the famous 8-0 victory over Rapid in the cup final in 1934, he scored three goals. The highlight of Hahnemann's Admira career was reaching the 1934 final of the Mitropacup, where he also scored two goals against Naples and goals against Sparta and Juventus. In the 1935-36 Austrian league season he scored 23 goals for his club to become the league's top scorer. On 13 September 1943 Hahnemann played in a friendly for Slavia Prague. Hahnemann scored 9 and Josef Bican scored 8 in a 20-1 victory against SK Uhonice. After the end of the war, the Admiran was forced to transfer to SC Wacker Wien due to his place of residence in Vienna. As the club's top scorer in the championship and with two goals in the cup final in a 4-3 win against Austria, he played a key role in Wacker's only two national titles. ==International career== Hahnemann played 23 games from 1935 to 1948 for the Austria national football team and scored four goals in these appearances. After the Anschluss Hahnemann played 23 matches for Germany's national team between 1938 and 1941, scoring 16 goals. He also appeared with the German squad that took part in the 1938 World Cup in France.Wilhelm Hahnemann – International Goals – RSSSF In a 1940 international match he managed the feat of a double hat-trick in a 13:0 victory over Finland. The only player to score more goals for Germany in a single match was Gottfried Fuchs who scored 10 times against Russia at the 1912 Olympic games in Stockholm. He also played for Austria at the 1948 Summer Olympics. ==Manager== After his player career he became coach for First Vienna FC. He then replaced Hans Krauss as coach of SpVgg Fürth in the German Oberliga Süd in 1953. He stayed two seasons. and in Switzerland. Then he went to Switzerland to Grasshopper Club Zurich . In three seasons he won the double of championship and Swiss Cup in 1956. In 1958 he moved to the National League B to FC Biel- Bienne for a year. Hahnemann went then back to Wacker after the black and white team got more and more into trouble. The former striker had to substitute himself in an match against Vienna due to a lack of players. At the age of 45, he scored his 230th championship goal. 1961/62 he accepted another engagement at FC Biel-Bienne. 1961/62 he coached FC Wacker Innsbruck before retiring from professional football. As player-coach of the Hütteldorfer AC in the 3rd Vienna class he was top scorer . Then he went to Switzerland again and coached Lausanne-Sports for the 1966/67 season. From 1968 to 1970 Hahnemann coached the second-class Wiener AC and then FV Biberach 1970/71. ==Honours== *Austrian Football Championship (6): ** 1932, 1934, 1936, 1937, 1939, 1947 *Austrian Cup (3): ** 1932, 1934, 1947 *Austrian Bundesliga Top Goalscorer (1): ** 1936 ==References== ==Other websites== * * Goldene Tage am Goldenen Horn – Der Spiegel * Category:1914 births Category:1991 deaths Category:Austrian footballers Category:Players of the Austrian national football team Category:German footballers Category:Austrian football managers Category:First Vienna FC managers Category:Association football forwards Category:Austrian football forwards Category:Austrian Football Bundesliga top scorers Category:Austrian football champions",
 "title": "Wilhelm Hahnemann"
}