{
 "id": "1022293",
 "text": "Oswald Cobblepot is a fictional character in the show Gotham who is played by Robin Lord Taylor and based on The Penguin. ==Season One== Oswald Cobblepot holds umbrellas for a woman named Fish Mooney who is a criminal. He tells the police she helped with the murder of two people so she breaks his leg and nicknames him Penguin. When she tries to have him killed a Detective named James Gordon saves him instead. Cobblepot comes back for revenge and kills so many people that he manages to take over crime in Gotham City and call himself The Penguin. ==Season Two== A man named Galavan kidnaps Oswald’s mother and tells Oswald he’ll kill her unless Oswald kills everyone that Galavan wants him to kill. When Oswald does, Galavan kills Oswald’s mother and Oswald teams up with Detective Gordon to kill Galavan for revenge. Oswald is tortured by Hugo Strange and Oswald later meets his father. After Oswald’s stepmother kills his father, he kills her son and daughter and tricks her into eating them and then cuts off her head. Oswald also wants revenge against Hugo Strange. ==Season Three== Oswald fights a lot of monsters and becomes Mayor of Gotham City. Oswald falls in love with his friend Ed Nygma, so he kills Ed’s girlfriend and Ed gets revenge on Oswald by becoming The Riddler. Oswald traps The Riddler in an iceberg. ==Season Four== Oswald, now called The Penguin kills all criminals except the ones who agree to work for him and says he’s created a new Pax Romana. A woman named Sofia Falcone gets The Penguin involved in an orphanage. The Penguin meets a mute child named Martin and helps him get revenge on two bullies who gave him a wedgie. Sofia kidnaps Martin so The Penguin pretends to kill Martin and actually sends him out of Gotham City. Captain Gordon thinks The Penguin actually killed Martin so he puts him in Arkham Asylum but The Penguin escapes with the help of The Riddler. ==Season Five== The Penguin teams up with Captain Gordon and helps save Gotham City but he still goes back to being a criminal with The Riddler but is stopped by Batman. Category:Fictional people Category:Television characters",
 "title": "Oswald Cobblepot"
}