{
 "id": "102284",
 "text": "Homo erectus (Latin: \"upright man\") is an extinct species of the genus Homo.Dutch anatomist Eugene Dubois (1890s) first described it as Pithecanthropus erectus, based on a skullcap and a modern-looking thigh bone found from the bank of a river in Java. Most of the early discoveries were at Zhoukoudian in China. Fossil remains were found in Java (1890s) and in China (1921). Nearly all of them were lost during World War II, but there are casts that are considered to be reliable evidence. Early in the 20th century it was believed that the first modern humans lived in Asia. But during the 1950s and 1970s, many fossil finds from East Africa (Kenya) showed that the oldest hominins came from there.H. erectus may be a descendant of earlier hominins such as H. habilis. However, H. habilis and H. erectus may have lived at the same time and have come from a common ancestor. == Some characteristics == === Skull and brain === H. erectus had a cranial capacity (brain size) greater than that the earlier Homo habilis. The earliest H. erectus remains have a cranial capacity of 850 cm³, while the latest Javan specimens measure up to 1100 cm³.Java Man, Curtis, Swisher and Lewin, . This overlaps that of H. sapiens: the frontal bone is less sloped and the dental arcade smaller than in australopithecines. The face is more vertical (less protrusive) than either the australopithecines or H. habilis, with large brow-ridges and less prominent cheekbones. === Hair === This obvious difference between apes and men often goes without comment. It is hard to explain. Body hair protects the skin from wounds, bites, heat, cold, and UV radiation. Also, it is used as a communication tool and as a camouflage. The first member of the genus Homo to be hairless was Homo erectus, originating about 1.6 million years ago.Hermansen, Ralph D. 2018. Down from the trees : Man's amazing transition from tree-dwelling ape ancestors. Apple Academic Press. ISBN 978-0-429-46595-6. p278–281. The dissipation of body heat remains the most widely accepted evolutionary explanation for the loss of body hair in early members of the genus Homo. The reduction in hair, and the increase in sweat glands, made it easier for their bodies to cool. Man's ancestors moved from living in shady forest to open savanna. This change in environment resulted in a change in diet, from largely vegetarian to hunting. Hunting game on the savanna also increased the need for the regulation of body heat. Anthropologist and paleo-biologist Nina Jablonski thinks the ability to lose body heat through sweating helped make possible the dramatic enlargement of the brain. The brain is the most temperature-sensitive human organ.Jablonski, Nina G. & Chaplin, George 2000. The evolution of human skin coloration. Journal of Human Evolution. 39 (1): 57–106. The loss of fur was also a factor in other adaptations. Some of these changes are thought to be the result of sexual selection. By selecting more hairless mates, humans accelerated changes which were first done by natural selection. Sexual selection may also account for the remaining human hair in the pubic area and armpits, which are sites for pheromones, while hair on the head continued to provide protection from the Sun. Humans had hairlessness, upright posture, and high brain capacity by 260,000 to 350,000 years ago.Schlebusch C.M. et al. 2017. Southern African ancient genomes estimate modern human divergence to 350,000 to 260,000 years ago. Science. 358 (6363): 652–655. Bibcode:2017Sci...358..652S. doi:10.1126/science.aao6266. PMID 28971970. S2CID 206663925. === Height and sexual dimorphism === These early hominins stood about . Only 17 percent of modern male humans are taller. They were slender, with long arms and legs. The sexual dimorphism between males and females was slightly greater than modern man, with males being about 25% larger than females. The discovery of the skeleton KNM-WT 15000, \"Turkana boy\" (Homo ergaster), made near Lake Turkana, Kenya by Richard Leakey and Kamoya Kimeu in 1984, is one of the most complete hominid-skeletons discovered. It has helped greatly our understanding of human physiological evolution. == Tools == The most distinctive tool of erectus was the Acheulean hand axe, first invented 1.8 million years ago (mya). This hand axe was made by chipping a suitable stone with a hammer stone. Later, the neanderthals used a soft hammer made of deer antler bone to make better tools. The Acheulean hand axe lasted for over a million years as the main tool. Its main use was for butchering meat. This we know because different uses leave different micro-wear on the hand axe surfaces.Haten N. 2010. The reliability of microscopic use-wear analysis on Monterey chert tools. SCA Proceedings 24, 1-6. Odell, George 1980. Verifying the reliability of lithic use-wear assessments by 'blind tests': the low-power approach. Journal of Field Archaeology 7 1-34. == Descendants and subspecies == Homo erectus remains one of the most successful and long-lived species of the Homo genus. It is generally considered to have given rise to a number of descendant species and subspecies. The oldest known specimen of the ancient human was found in southern Africa. * Homo erectus: Homo ergaster, Homo erectus pekinensis, *Other related species: Homo antecessor, Homo cepranensis, Homo floresiensis, Homo georgicus Homo heidelbergensis, Homo neanderthalensis, Homo rhodesiensis, Homo sapiens, == Individual fossils == Some of the major Homo erectus fossils: * Indonesia (island of Java): Trinil 2 (holotype), Sangiran collection, Sambungmachan collection, Ngandong collection * China: Lantian (Gongwangling and Chenjiawo), Yunxian, Zhoukoudian, Nanjing, Hexian * India: Narmada (taxonomic status debated!) * Kenya: WT 15000 (Nariokotome), ER 3883, ER 3733 * Tanzania: OH 9 * Vietnam: Northern, Tham Khuyen, Hoa Binh * Republic of Georgia: Dmanisi collection * Turkey: Kocabas fossil === Recent research === Fossil H. erectus skulls found in Java in the 1930s have recently been redated. There are 12 skullcaps (top part of skull) and two lower leg bones. The recent research shows that on Java, H. erectus survived to about 100,000 years ago. The research gives a definitive age of between 117,000 and 108,000 years ago. That is much a much longer survival than in any other part of the world, so far as is known.Rincon, Paul 2019. Homo erectus: ancient humans survived longer than we thought. BBC News Science & Environment. This means, says the report, that H. erectus was still around when our own species was [elsewhere] walking the Earth. Java is an island, and presumably it had not yet been discovered by Neanderthals or our own species. Remains suggest that our own species did not reach Java until about 39,000 years ago. == References == ==Related pages== * Australopithecus * Human timeline * Life timeline == Other websites == * MNSU * Archaeology Info * Smithsonian * Homo erectus at Stanford University * Possible co-existence with Homo Habilis - BBC News * John Hawk's discussion of the Kocabas fossil Category:Hominins Category:Prehistoric Africa",
 "title": "Homo erectus"
}