{
 "id": "1022779",
 "text": "Wales (West and North) Television seen by viewers as Teledu Cymru and often called WWN was ITV franchise for North and West Wales. It was the first ITV station to lose its franchise. The name Teledu Cymru that was seen on screens was Welsh for Television Wales. The station was awarded the franchise on the 6 June 1961. WWN started broadcasting on 14 September 1962 and ended on 26 January 1964. The station ended broadcasting due to financial failure.After the failure of WWN, the franchise region was merged with South Wales and the West, served by TWW (Television Wales and the West) but the name Teledu Cymru would be used in the former region.Graham, Russ. \"Teledu Cymru\" . Electro Musicians Ident. Transdiffusion Broadcasting System. Retrieved 20 June 2023. Contains a detailed account of WWN's life and some images of WWN's idents. On 20 May 1968, the Teledu Cymru name was dropped, due to Harlech taking over the franchise. == History == The geography of Wales was a problem for the Independent Television Authority (ITA). The more inhabited South was already served by Television Wales and the West, which started in 1958, while the north east and a lot of the north coast was served by Granada and ABC, started in 1956. The central regions of north wales couldn't obtain ITV programmes. The ITA was pressured by a group of Welsh-speaking businessmen to setup a North and West Wales region. The ITA asked the Postmaster General to allow it, which he did with conditions. The conditions were: #The service must not offer a choice that other viewers did not. #The station should produce ten hours a week of programmes in Welsh, without using the Welsh language programmes from TWW, ABC or Granada. These conditions were accepted by the ITA. On 6 June 1961, the contract was given to Wales Television Limited. The name was changed to Wales (West and North) Television Limited following opposition from TWW. The station was to use three VHF transmitters, Preseli (for the south west), Arfon (for the north west) and Moel-y-Parc (for the north east). The Preseli station was finished in 14 September 1962. WWN launched the same day as the Preseli transmitter, becoming the last original ITV station to start broadcasting. The Arfon and Moel-y-parc transmitters were delayed until later 1963, causing damage to workers morale and WWN's profits. The free programming from the ITV network, plus support from their neighbours, ABC, ATV and TWW were able to barely keep the station up and running. The fatal problem was when Granada Television stopped production of all Welsh programming, stopping an important stream of money to WWN. In May 1963, WWN stopped production of local programming and turned their studio into a master control station until they could find a successor to WWN. == References == Category:ITV (TV network)",
 "title": "Wales West and North Television"
}