{
 "id": "1022917",
 "text": "Daniel Roy-Gilchrist Noboa Azin (born 30 November 1987) is an American-born Ecuadorian politician and businessman. He became the President of Ecuador after winning the 2023 election. He was a member of the National Assembly of Ecuador, between 2021 and 2023. He was born in Guayaquil, Ecuador. His father is businessman and former presidential candidate Álvaro Noboa. Noboa was re- elected in 2025. ==Early life== Noboa was born on 30 November 1987, in Miami, Florida. He is the son of businessman Álvaro Noboa, and of doctor Anabella Azin. He was raised in Guayaquil, Ecuador. After studying at the New York University Stern School of Business, he earned a degree in business administration in 2010. ==Business career== At the age of 18, he founded his own company, DNA Entertainment Group. His father Álvaro Noboa's Noboa Corporation business is an exporter of bananas. He is seen as an heir to the company. He was the Shipping Director of Noboa Corporation. He was also commercial and logistics director, between 2010 and June 2018. ==Political career== Noboa was elected to the National Assembly in the 2021 legislative elections. He was inaugurated on 14 May of the same year. In that same May, he became president of the Commission for Economic, Productive and Microenterprise Development. In March 2023, he was in favour of the muerte cruzada and supported President Guillermo Lasso during his impeachment proceedings. On 17 May 2023, Lasso used muerte cruzada to the National Assembly's current term and ended Noboa's term in the assembly. ===2023 presidential campaign=== In May 2023, after his term in the National Assembly ended, he announced his candidacy for the presidential elections of the same year, by the political movement National Democratic Action (ADN). His running mate was businesswoman Verónica Abad Rojas. On 20 August, Noboa won 23.47% of the actual votes and advanced to the run-off election set for 15 October, facing Luisa González. His second place finish was seen as surprising. In the second round, Noboa was elected, winning 52% of the vote. At age 35, he is the youngest president to be elected in Ecuadorian history. ==Presidency== Noboa was inaugurated as president on 23 November 2023, becoming the country's youngest person to assume the office. President of Colombia Gustavo Petro was the only foreign head of state to attend his inauguration. His inaugural address lasted seven minutes. In May 2024, Noboa registered to run for re- election in the 2025 general election. In February 2025, Noboa advanced to the run-off after coming in first place with 44.17% of the vote. In April 2025, he was re-elected after winning 55% of the vote. ==Personal life== In 2018, he married Gabriela Goldbaum. They had a daughter. They later divorced. In June 2021, a complaint filed by Noboa was accepted by a Spanish court to investigate the insurance company Mapfre. This was related to an alleged violation of privacy and disclosure of secrets involving data used by Goldbaum during their divorce. In 2021, he married social media figure Lavinia Valbonesi. They have one son. In October 2023, it became known that Noboa and Valbonesi will have their second son in February 2024. ==Notes== ==References== ==Other websites== *Campaign website (in Spanish) *Biography by CIDOB (in Spanish) Category:1987 births Category:Living people Category:Presidents of Ecuador Category:Politicians from Guayaquil Category:Current national leaders Category:Ecuadorian businesspeople Category:Businesspeople from Miami Category:Politicians from Miami",
 "title": "Daniel Noboa"
}