{
 "id": "102222",
 "text": "Cathar castles (Châteaux cathares in French) is a term used by the French tourist industry. It is used for castles in the Languedoc-Roussillon, usually built by the enemies of the Cathars during the Albigensian Crusade. ==The true Cathar castles== The Cathars built fortified homesteads, but not castles. The legend of Cathar architects and builders is no more than a myth. The cathar church did not build anything. For this reason, the only ones which can claim the description \"Cathar\" are the small castles, often totally unknown to the public. Their unspectacular ruins are often far-away from tourist routes. ==The royal citadels== Because Raimond II was unable to recapture Carcassone in 1240, the city walls were strengthened by the French King. He also destroyed small castra in the Corbières region and built citadels to protect the border with the kingdom of Aragon. These five castles are often called the cinq fils de Carcassonne (five sons of Carcassonne): * Château d'Aguilar * Peyrepertuse castle * Puilaurens castle * Quéribus castle * Château de Termes These five fortresses resisted various assaults led by the Aragonese army. ==The abandonment of the citadels== In 1659, Louis XIV and the Philip IV of Spain signed the Treaty of the Pyrenees. The French king also married the Infanta Marie Therese. The treaty changed the borders. It gave Rousillon to France and moved the frontier south to the crest of the Pyrenees, where it is now. The fortresses therefore lost their importance. Some maintained a garrison for a while, a few until the French Revolution, but they slowly fell into decay, often becoming sherpherds' shelters or bandits hideouts. ==Other \"Cathar castles\"== * Château d’Arques * Château de Durfort * Châteaux de Lastours * Château de Montségur * Château de Padern * Château de Pieusse * Château de Puivert * Rennes-le-Château * Château de Roquefixade * Château de Saissac * Château d'Usson ==Sources and further reading== Category:Castles in France Category:13th-century buildings and structures",
 "title": "Cathar castles"
}