{
 "id": "102338",
 "text": "The death zone is the name used by mountain climbers for high altitude where there is not enough available oxygen for humans to breathe. Sometimes, the death zone is also given specific names as \"Rainbow Valley\" for the Everest death zone. This is usually above 8,000 metres (26,247 feet). Fourteen mountains have peaks that are in the death zone; Those mountains are in Asia, and they are part of the Himalaya and Karakoram. \"People are advised not to stay in the death zone for more than 16 to 20 hours\", media said;https://www.indiatoday.in/fyi/story/all-you-need-to-know-about-the- everest-death-zone-326029-2016-05-28. Retrieved 24 November 2021 Shorter stays can also be deadly. Most of the 200+ climbers who have died on Mount Everest have died in the death zone.Due to the inverse relationship of atmospheric pressure to altitude, the average person takes in about 30% as much oxygen as at sea level at the top of Everest. Thus, a normal human person accustomed to breathing air at sea level could only be there for a few minutes before becoming unconscious. Most climbers have to carry oxygen bottles to be able to reach the top. Visitors become weak and have the inability to think clearly and make decisions, especially under stress. Since helicopters also perform poorly in thin air, many bodies of dead visitors are left on the mountain. Reports suggest that more than 150 of these bodies, older than 30 years, are still lying in the Everest death zone. ==Alive in the death zone for more than one night== In 2008, Pemba Gyalje stayed in K2's Death Zone for 90 hours.https://www.theglobeandmail.com/arts/film/one-sherpas-brave-actions-on- an-uncompromising-mountain/article15043482/. Retrieved 24 November 2021 Among 96 total death in Mount K2, 56 have occurred in the death zone. In 2006, climber Lincoln Hall, had been left for dead on Everest on May 25, 2006. He did survive the event. The lack of oxygen in his blood made it easier for him to get frostbite. He also had headaches, nausea, vomiting and hallucinations. He said later this was caused by cerebral edema. This is a swelling of the brain. This is caused at high altitude when blood leaks into the brain. It can kill a person if the brain becomes too compressed. Hall was left for dead after his breathing and heartbeat stopped. He was found the next morning. A team of four, led by American climber Daniel Mazur, found Hall was sitting cross-legged near a ten-thousand foot cliff's edge. He was not wearing his gloves or hat. He also did not have any oxygen equipment and his climbing suit was not zipped . Mazur later said that Hall seemed lucid. He said that Hall's first words were, \"I imagine you're surprised to see me here.\" A very large rescue operation was created and Hall was rescued. He lived for seven years after the event.. He spoke and wrote books about his experiences on Everest,. Hall died in 2012 from mesothelioma. == References == Category:Atmosphere",
 "title": "Death zone"
}