{
 "id": "1023596",
 "text": "Daniel Morales (born in September 11th, 1996), also known as 'Duniel', is a Venezuelan-American guitarist, business man, entrepreneur, composer & songwriter best known as the founder of the instrumental project Aurora Dream. Additionally, Morales releases solo music under his personal name, where he takes the opportunity to further explore his creative ideas as he continues to take influence from progressive rock, metal, math rock, pop music, and experimental music. == Early life == Morales was born in Mérida, Venezuela. He pursued a degree in Audio Visual Technologies in Full Sail University (Winter Park, Florida) in November 2014 and graduated in November 2016. Morales participated in several Audio-Visual internships for different companies and events such as Vans Warped Tour, House of Blues, WWE NXT, and ESPN Wide World of Sports. During these internships, he took on various roles including Stagehand, Broadcast Engineering, Video Engineering, Video Technical Direction, Video Direction, Camera Operation, Shader, Lighting Assistance, Lighting Design, Simulcast Engineering, FOH Assistance and Video Utility. == Career == === Daniel Morales === Morales began playing guitar in 2010 when his mother gave him an Ibanez six-string electric guitar for his birthday. He taught himself guitar through YouTube videos and also took some classes with Venezuelan guitarist David González. In 2012, Morales began recording his first covers with GarageBand on his father's MacBook. He covered many of his favorite bands including Opeth, Dream Theater, Children of Bodom, Scale the Summit, The Fall of Troy, Bring Me The Horizon, Porcupine Tree, Rishloo, Iron Maiden, Gojira, and many others. Starting March of 2020, Morales decided to record all of his unused material and release a series of 36 short songs on a weekly basis throughout the whole year; These tracks included original songs along with some covers of his favorite animes. Morales took this opportunity to feature fellow internet musicians and some other friends he had made over the years. In December 2020, Morales compiled all these 36 short songs into his first solo album release, titled DUNNY TUNES. In 2023, Moises D’ Bello produced, remixed and remastered the album. In 2021, Morales decided to work on a remixed and remastered version of his track SHARKY and renamed it SHARKY 2.0. This time drums where live tracked by Chris Allison (Plini's drummer), mix was done by Simon Grove (Plini's bassist) and mastering was done by Moises D' Bello. The track was later released in 2023. === Aurora Dream === In 2016, Morales founded Aurora Dream during his final months of university. He started the project with the release of a single titled Parallel Colors. This single was produced, mixed and mastered by Alejandro Hernández. This single was later retitled Parallel Colors - 2016 Version. Aurora Dream went through a hiatus phase shortly after Morales moved to Miami in early 2017 when he decided to pursue new business opportunities; around this time, Morales spent most of his time working corporate jobs and saving up to start his own businesses and consequently make a higher income that could help fund his music projects. Starting 2019, Morales reached to his friends Mangus Steed and Alejandro Hernández to help him record bass and program drums for 8 newer songs he had written. Around June 2019, Morales attended Polyphia's Music Camp hosted by the Music Masters Collective. During the camp, he was invited to perform on stage by Tim Henson. During his performance he decided to play two songs from Aurora Dream. Later in the same year, he rerecorded Parallel Colors with a much better production approach. He later combined all new 8 tracks along with the new version of Parallel Colors and turn them into the first Aurora Dream album he titled RUBIX. In early 2020, Morales asked well-known producer Randy Slaugh to work on RUBIX. Additionally, he asked keyboardist and synth player Eric Guenther from The Contortionist to co-produce the record. As Morales continued working on the album, he realized it was very important to continue learning from other talented musicians that could inspire his writing journey. Therefore, he decided to attend a music webinar hosted by guitarist Jesse Cash from Erra, followed by an exclusive lesson he scheduled with guitarist Thomas Erak from The Fall of Troy and finally a guitar lesson with Marcos Mena from Standards. Additionally, Morales received some artist coaching from guitarists Angel Vivaldi & Jason Richardson. Morales also reached out to guitarists Tim Henson, Nick Johnston, Javier Reyes from Animals as Leaders, Sithu Aye, Angel Vivaldi, Ichika Nito, Mark Holcomb from Periphery, Felix Martin and Josh Martin from Little Tybee to be featured on RUBIX, to which they all agreed and greatly contributed to the project. During the beginning of 2021, Morales decided to contact Simon Grove and asked him to mix RUBIX. He also asked Chris Allison to track real drums for the record. Shortly after he reached out to Moises D' Bello who helped with mastering for the album. While RUBIX mixing was taking place, Morales wrote a new song for Aurora Dream titled A New Infinite. He featured Simon Grove and Plini as double guest artists. This song was strongly inspired by the online culture at the time and the new hyperpop, drum&bass; & glitchcore movements. Around the same time, Morales decided to work on a remake version Parallel Colors - 2016 Version. This time drums were performed and recorded by Chris Allison, mixing was handled by Simon Grove and mastering was done by Moises D' Bello. In September 2022, Morales combined some guitar parts from Parallel Colors - 2016 Version with beats, trap-lofi production and other electronic elements that helped creating a new remix he titled Parallel Beats. This single came right after RUBIX and it features guitarists KEYAN, Jake Howsam Lowe from Plini, and Charles Caswell from Berried Alive. Finally, right after Parallel Beats was released, Morales decided to work with a well known YoutTuber that makes 8-bit music named Kevin Weaver. This collaboration resulted in the creation of an 8-bit remix of Parallel Colors - 2016 Version that was titled Parallel 8its. Shortly after, this single led to the creation of 8-bit album remix of RUBIX that was titled RUBIT. This single and album was produced and mixed by Kevin Weaver while mastering was handled by Moises D' Bello. In August 2023, Morales attended the John Petrucci's Guitar Universe (JPGU) 4.0 in Fort Lauderdale, Florida. This enriching experience provided him with invaluable lessons from world-renowned musicians and guitarists such as John Petrucci from Dream Theater, Tosin Abasi from Animals as Leaders, Fredrik Åkesson from Opeth and Ghost, Lari Basilio, Ola Englund, Guthrie Govan, Tim Henson from Polyphia, Dave LaRue, Scott LePage from Polyphia, Mike Mangini from Dream Theater, Aaron Marshall from Intervals, Rena Petrucci, Plini, Jason Richardson, Joscho Stephan, and Zakk Wylde. The insights and skills acquired continue to shape his solo endeavors and contributions to Aurora Dream. == Business Ventures == In addition to being a guitarist, Morales founded several companies and projects, these include: Duniel AV, Novatoshi, Chromalize and Zelvox. == Personal Life == Morales is strongly passionate about art & technology; Aside from that, he is a huge fan of video games, anime, science & space. == Influences == Morales cites several influential musicians and bands from various genres. Notably, he cites Buckethead, Guthrie Govan, John Petrucci, Ron Jarzombek, Keith Merrow, Thomas Erak, Will Swan, Chris Letchford, Steve Vai, Steven Wilson, Porcupine Tree, Dream Theater, Opeth, Protest the Hero, The Fall of Troy, Linkin Park, and Deftones as being important for his development as a guitar player and songwriter. == Discography == === Daniel Morales === * DUNNY TUNES - Album (2023) * SHARKY 2.0 - Single (2023) === Aurora Dream === * Parallel Colors - Single (2016) * A New Infinite - Single (2023) * Comfy - Single (2023) * RUBIX - Album (2023) * Parallel Beats - Single (2023) * Parallel 8its - Single (2023) * RUBIT - Album (2023) === Music Videos === Title Year Director Album Comfy (feat. Ichika Nito) 2023 Daniel Morales & 4102 Productions RUBIX == References == == Other websites == *Aurora Dream Category:1996 births Category:Living people Category:American singer-songwriters Category:American rock guitarists Category:American rock singers Category:Musicians from Miami Category:American rock drummers",
 "title": "Daniel Morales"
}