{
 "id": "102318",
 "text": "The Palaeolithic (or Paleolithic)Ancient Greek: palaios = old; and lithos = stone. Coined by John Lubbock in 1865. was a period of prehistory when humans made stone tools. It was the first and longest part of the Stone Age. It began around 3.3 million years ago and ended around 11,650 years ago. About 99% of human history happened in the Palaeolithic. The Palaeolithic began when hominids (early humans) started to use stones as tools for bashing, cutting, and scraping. All members of the genus Homo made stone tools, starting with relatively crude tools made by Homo habilis and Homo erectus. In Europe, the large-brained Neanderthal Man (Homo neanderthalensis) made tools of high quality. Our own species, Homo sapiens, made even higher-quality tools. These tools are the first cultural products which have survived to modern times.Klein, Richard G. 2009. The human career: human biological and cultural origins. 3rd ed, Chicago.Hosfield R.T., Wenban-Smith F.F. & Pope M.I. 2009. Great prehistorians: 150 years of Palaeolithic research, 1859–2009. Lithics 30. The oldest stone tools ever found are about 3.3 million years old. Archaeologists found these tools in the Great Rift Valley of Africa.Morelle, Rebecca 2015. Oldest stone tools pre-date earliest humans. BBC News Science & Environment. Harmand, Sonia et al 2015. 3.3-million-year-old stone tools from Lomekwi 3, West Turkana, Kenya. Nature 521, 310–315. Australopithecines probably made them. Archaeologists have found stone tools in continental Europe from about one million years ago, and in Britain from about 700,000 years ago. During the Palaeolithic Age, humans grouped together in small bands. They lived by gathering plants and hunting wild animals. Page 6-12 They made tools out of wood and bone as well as stone. They probably also used leather and vegetable fibers, but these do not last as long as stone and have not survived to modern times. The Palaeolithic ended around 11,650 years ago, when humans began to make smaller, finer tools. In Western Europe, this was the beginning of the Mesolithic period. In warmer climates like Africa, the Epipaleolithic period came after the Palaeolithic.Mesolithic Period. 2008. In Encyclopædia Britannica. Retrieved April 10, 2008, from Encyclopædia Britannica Online.\"Stone Age,\" Microsoft® Encarta® Online Encyclopedia 2007 © 1997-2007 Microsoft Corporation. Contributed by Kathy Schick and Nicholas Toth The Pleistocene geological epoch (also called the Ice Age) happened at the same time as the Palaeolithic. In some areas, like Western Europe, this ice age affected the way people lived. In the Middle East, people began to switch from hunting and gathering to agriculture. Both the Palaeolithic and the Pliestocene ended around the same time. == Cultures == === Oldowan === Hominids began to make Oldowan tools around 2.6 million years ago. They continued to make these tools until about 1.7 million years ago. After that, hominids began to make more sophisticated tools, which archaeologists call Acheulean. Oldowan tools are named after Olduvai Gorge in Tanzania, where Oldowan tools were first found. The archaeologist Louis Leakey made this discovery in the 1930s. For a long time after that, archaeologists thought that the Oldowan were the earliest tools ever made. Now they know that hominids made stone tools much earlier in history - about 3.3 million years ago. This was before the genus Homo had evolved. Archaeologists do not know for sure which species actually created and used Oldowan tools. The use of these tools reached its peak with early species of Homo, such as H. habilis and H. ergaster. Archaeologists think that early Homo erectus inherited Oldowan technology, then refined it into the Acheulean industry beginning about 1.7 million years ago. Oldowan tools are sometimes called pebble tools, because the blanks chosen for their production already resemble, in pebble form, the final product.Napier, John. 1960. Fossil hand bones from Olduvai Gorge. Nature, December 17th. They are sometimes subdivided into types, such as choppers, scrapers and pounders, based on their main uses.Vrba E. & Y.H.-Selassie 1994. African Homo erectus: old radiometric ages and young Oldowan assemblages in the middle Awash Valley, Ethiopia. Science 264: 1907-1909. === Acheulean === Around 1.7 million years ago, Homo habilis began to make oval- and pear-shaped hand axes. Archaeologists call these tools Acheulean. They were more sophisticated than Oldowan tools, and had more uses. Early humans made these tools in Africa, western Asia, and Europe during the Lower Palaeolithic era. They are usually found with Homo erectus remains. Acheulean tools were the dominant technology for most of human history. More than a million years ago, Acheulean tool users left Africa to colonize Eurasia. Although it developed in Africa, the Acheulean industry is named after the type site of Saint-Acheul, where archaeologists first found Acheulean tools in the 19th century. This area is now a suburb of Amiens in northern France. John Frere was the first to suggest in writing that hominids started making Acheulean tools during \"a very ancient period.\" In 1797, Frere sent two examples of Acheulean tools to the Royal Academy in London from Hoxne in Suffolk. He had found them in prehistoric lake deposits, along with the bones of extinct animals. He concluded that they were made by people \"who had not the use of metals\" and said they belonged to a \"very ancient period indeed, even beyond the present world\". However, other archaeologist still held a pre-Darwinian view of human evolution, and they ignored Frere's ideas. ==== Dating the Acheulean ==== Based on radiometric dating (often potassium- argon dating), hominids began to use Acheulean techniques around 1.65 million years ago, and continued to use these tools until about 100,000 years ago. Archaeologists found the oldest known Acheulean tools in the West Turkana region of Kenya. These tools are 1.65 million years old. Some archaeologists think that hominids began to use Acheulean techniques earlier, around 1.8 million years ago. In individual regions, scientists can use radiometric dating to determine the age of a tool much more precisely. For example, Acheulean methods did not reach Europe until around 400,000 years ago. In smaller study areas, scientists can narrow down a tool's age even more. However, numerical dates can be misleading. It is common to associate examples of this early human tool industry with one or more glacial or interglacial periods, or with a particular species of early human. The earliest user of Acheulean tools was Homo ergaster, who first appeared about 1.8 million years ago. Some researchers prefer to call these hominids early Homo erectus. Later forms of early humans also used Acheulean techniques. These are described below. There is considerable time overlap in early prehistoric stone-working industries. In some regions, Acheulean tool-using groups were contemporary with other, less sophisticated industries such as the Clactonian. Then, later, Acheulean tools occur at the same time as the more sophisticated Mousterian. The Acheulean was not a neatly defined period, but a tool-making technique which flourished especially well in early prehistory. It was a basic method for making stone tools which was shared across much of the Old World. === Clactonian === In Europe, early humans began to make flint tools during the early part of the interglacial period, around 400,000 years ago.known as the Hoxnian, the Mindel-Riss or the Holstein stage Archaeologists call these Clactonian tools. Homo erectus made Clactonian tools; modern humans did not. Early, crude flint tools from other regions, made using similar methods, are either called Clactonian tools or core & flake technology. These tools are named after Clacton-on-Sea in the English county of Essex. There, in 1911, archaeologists found Clactonian artifacts along with the remains of a giant elephant and hippopotamus. These artifacts included flint chopping tools, flint flakes, and the tip of a worked wooden shaft. Archaeologists have found other Clactonian tools at sites in Swanscombe, Kent, and Barnham in Suffolk. Evidence shows that early humans made this type of tool throughout Northern Europe. To make Clactonian tools, early humans struck thick, irregular flakes from a core of flint. They used the flint core as a chopper, and used the flakes as crude knives or scrapers. Archaeologists have found Clactonian tools which were notched, implying that they were attached to a handle or shaft. The Clactonian and Acheulean industries might have existed at the same time. However, in 2004, archaeologists excavated a butchered Pleistocene elephant near Dartford, Kent. They found many Clactonian flint tools, but no hand axes. Since hand axes would have been more useful than choppers to dismember an elephant carcass, this is evidence that the Clactonian was a separate industry. Flint of sufficient quality was available in the area, so archaeologists think the people who carved up the elephant did not know how to make hand axes. === Mousterian === The Mousterian is an industry of stone tools associated with Neanderthal Man (Homo neanderthalensis). Early humans started making these tools around 300,000 years ago, and continued to make them until about 30,000 years ago. There are up to thirty types of Mousterian tools, compared to about six in the Acheulean style. The Mousterian was named after the type site of Le Moustier, a rock shelter in the Dordogne region of France. Smithsonian: Middle Stone Age tools. Archaeologists have found similar flintwork all over unglaciated Europe, as well as the Near East and North Africa. Mousterian hand axes usually had long blades and points. Overall, these tools are finished more perfectly than any previous style of toolmaking. To make Mousterian tools, early humans used the Levallois technique. This is a prepared-core technique: the toolmaker works on the core of the stone for so that they can strike off a long, fine blade. For this quality of work, early humans had to use a 'soft' hammer made of something like deer antler, not a stone hammer. Neanderthals had larger brains than humans; this may have helped them develop Mousterian technology. All cultures of modern humans, Homo sapiens, used the Mousterian style. It is characteristic of our species to produce many more tools, all specialised for particular tasks. There are at least 100 types of tools in the Upper Palaeolithic, compared to a maximum of 30 tools in the Mousterian. == Chronology of Palaeolithic and following periods == The Palaeolithic is sometimes divided into three (somewhat overlapping) periods which mark technological and cultural advances in different human communities: * Palaeolithic ** Lower Palaeolithic (c2.6 or 2.5 million years ago–100,000 years ago) ** Middle Palaeolithic (c300,000–30,000 years ago) ** Upper Palaeolithic (c45,000 or 40,000–10,000 years ago). The Mesolithic and Neolithic eras followed the Palaeolithic. The Neolithic ended around 1900 BC. At this time, the Stone Age ended and the Bronze Age began. Later, when the Bronze Age ended, the Iron Age began. === Overview of the main features of these periods === Age Period Tools Economy Dwelling Sites Society Religion Stone age Palaeolithic Sharpened flint or stone tools: hand axes, scrapers, wooden spears Hunting and gathering Caves, huts, or simple shelters, mostly by rivers and lakes; early humans lived a mobile lifestyle Tribes of plant gatherers and hunters (25-100 people) In the Upper Palaeolithic, early humans began to use burial rituals and worship ancestors, which shows that they believed in the afterlife. Priests and sanctuary servants appear in prehistory. Mesolithic (known as the Epipalaeolithic in areas where people did not switch from hunting and gathering to agriculture) Fine small tools: bow and arrow, harpoons, fish-basket, boats Tribes and Bands Neolithic Specialized tools: chisel, hoe, plough, reaping-hook, grain pourer, barley, loom, pottery and weapons Agriculture; hunting and gathering; fishing; domestication Early humans settled on farmsteads during the Neolithic and the Bronze Age; cities formed during the Bronze Age Tribes and chiefdoms in some societies at the end of the Neolithic; states and civilisations during the Bronze Age. Bronze Age Writing; copper and bronze tools; potter's wheel Agriculture; cattle-breeding; crafts; trade Iron Age Iron tools ==== Venus figurines ==== Venus figurines may be some of the first pieces of art ever made. These are very small statues of women, mostly pregnant with visible breasts. Archaeologists have found them in areas of Western Europe, stretching to Siberia. Most of the Venus figurines that archaeologists have found are between 20,000 and 30,000 years old. However, they have found two figurines that are much older. The Venus of Tan- Tan, found in Morocco, is 300,000 to 500,000 years old. The Venus of Berekhat Ram, found on the Golan Heights, is between 200,000 and 300,000 years ago. These may be the some of the earliest things that show the human form. Early humans used different kinds of stone, bones, and ivory to make these figurines. They also made Venus figurines out of clay, then hardened the clay by heating it in a fire. This is one of the earliest known uses of ceramics. Archaeologists do not know what these figurines meant to the people who made them. There are two basic theories: * They may be representations of human fertility, or they may have been made to help increase fertility. * They may represent (fertility) goddesses. Scientists know that these figurines were not linked to the fertility of fields, because agriculture had not been discovered when the figurines were made. The two older Venus figurines may have formed mostly through natural processes. The Venus of Tan-Tan was covered with a substance that could have been some kind of paint. The substance contained traces of iron and manganese. The figurine of Berekhat Ram has traces of tool marks. A study done in 1997 states that nature alone could not have left these traces. ==== Cave paintings ==== Cave paintings have been found in about 350 caves in Europe. Many were done in the Palaeolothic Age, between about 15,000 and 30,000 years ago. Some of the most famous are in the Cave of Altamira in Spain and the Lascaux Cave in France.p545 Usually, cave paintings show animals, like aurochs, bisons or horses. Nobody knows why these paintings were done. However, archaeologists know that people did not create cave paintings just to decorate their living spaces. Usually, there are no signs that humans ever lived in the caves where people painted. The oldest known cave paintings are in the Chauvet Cave in France. There are two groups of paintings in this cave. The first group was painted 33,000 to 30,000 years ago. The second group was done 26,000 to 27,000 years ago.p546 We know this because scientists did radiocarbon dating of \"black from drawings, from torch marks and from the floors\".Quotes from Clottes 2003b p214. By 1999, scientists had dated 31 samples from the cave. The oldest were from 33,390-32,410 years ago.Archaeologists sometimes use the phrase \"B.P.\" (before the present day) to mean \"years ago\"Clottes 2003b p33. The oldest is sample Gifa 99776 from \"zone 10\". See also Chauvet (1996 p131, for a chronology of dates from various caves. Bahn's foreword and Clottes' epilogue to Chauvet 1996 discuss dating. Some archaeologists say this timeline is incorrect. Christian Züchner studied the style of the Chauvet paintings and compared it to paintings done at other caves. He thought one group of paintings was done between 28,000 and 23,000 years ago. He said the other group was between 18,000 and 10,000 years old. Clottes (2003b), pp. 213-214, has a response by Clottes. Pettitt and Bahn also think the Chauvet painting styles do not match the dates identified through radiocarbon dating. People from the Palaeolithic era drew well. They knew about perspective, and they knew of different ways to draw. They were able to observe the behaviour of animals they painted. Some of the paintings show how the animals behaved. The paintings may have been important for rituals. == Diet and nutrition == ===In general=== Paleolithic hunter-gatherers ate leafy vegetables, fruit, nuts, insects, meat, shellfish, and other types of fish. Because there is little direct evidence, it is almost impossible to determine how much of their diet was plant food and how much was meat. Even the idea that most humans of a given period shared the same diet is problematic. The Paleolithic was an extended period of time. During that time, there were many technological advances, many of which had impact on human dietary structure. For example, until the Middle Palaeolithic, humans probably did not have control of fire, or the tools needed to do extensive fishing. On the other hand, archaeologists generally agree that both of these technologies were widely available to humans by the end of the Paleolithic. (This allowed humans in some regions of the planet to rely heavily on fishing and hunting.) In addition, in the Palaeolithic, human populations spread across a wide geographical area. Archaeologists think that during the Lower Paleolithic, ancestors of modern humans lived only in Africa east of the Great Rift Valley. During the Middle and Upper Paleolithic, humans greatly expanded their area of settlement, reaching ecosystems as diverse as New Guinea and Alaska. The needed to adapt their diets to the local resources that were available. Anthropologists have different opinions about the proportions of plant and animal foods consumed. Just as with still existing hunters and gatherers, there were many varied \"diets\" - in different groups -of fruit and vegetables. The relative proportions of plant and animal foods in the diets of Paleolithic people often varied between regions; in colder regions, more meat was necessary. These regions were not populated by anatomically modern humans until 30,000-50,000 BP.) It is generally agreed that many modern hunting and fishing tools, such as fish hooks, nets, bows, and poisons, were not introduced until the Upper Palaeolithic and possibly even Neolithic. The only hunting tools widely available to humans during any significant part of the Paleolithic period were hand-held spears and harpoons. There's evidence of Paleolithic people killing and eating seals and elands as far as 100,000 years BP. On the other hand, buffalo bones found in African caves from the same period are typically of very young or very old individuals, and there's no evidence that pigs, elephants or rhinos were hunted by humans at the time. ===Developments=== Another view is that until the Upper Paleolithic, humans were frugivores (fruit eaters) who supplemented their meals with carrion, eggs, and small prey such as baby birds and mussels. Only on rare occasions did they manage to kill and consume big game such as antelopes. This view is supported by studies of higher apes, particularly chimpanzees. Chimpanzees are the closest to humans genetically. They share more than 96% of their DNA code with humans, and their digestive tract is functionally very similar. Chimpanzees are primarily frugivores, but they could and would consume and digest animal flesh, given the opportunity. In general, their actual diet in the wild is about 95% plant-based, with the remaining 5% filled with insects, eggs, and baby animals. In some ecosystems, however, chimpanzees are predatory, forming parties to hunt monkeys. Some comparative studies of human and higher primate digestive tracts do suggest that humans have evolved to obtain greater amounts of calories from sources such as animal foods, allowing them to shrink the size of the gastrointestinal tract relative to body mass and to increase the brain mass instead. Paleolithic peoples suffered less famine and malnutrition than the Neolithic farming tribes that followed them. Pages 9–13Page 70 Pages 2 This was partly because Paleolithic hunter-gatherers accessed to a wider variety natural foods, which allowed them a more nutritious diet and a decreased risk of famine. Many of the famines experienced by Neolithic (and some modern) farmers were made worse by their dependence on a small number of crops. It is thought that wild foods may have a significantly different nutritional profile to cultivated foods. The greater amount of meat obtained by hunting big game animals in Paleolithic diets than Neolithic diets may have also allowed Paleolithic hunter-gatherers to enjoy a more nutritious diet than Neolithic agriculturalists. It has been argued that the shift from hunting and gathering to agriculture resulted in an increasing focus on a limited variety of foods, with meat likely taking a back seat to plants. It is also unlikely that Paleolithic hunter-gatherers were affected by modern diseases of affluence such as Type 2 diabetes, coronary heart disease and cerebrovascular disease, because they ate mostly lean meats and plants and frequently engaged in intense physical activity, and because the average lifespan was shorter than the age of common-onset of these conditions. Large- seeded legumes were part of the human diet long before the Neolithic agricultural revolution, as evident from archaeobotanical finds from the Mousterian layers of Kebara Cave, in Israel. There is evidence suggesting that Paleolithic societies were gathering wild cereals for food use at least as early as 30,000 years ago. However, seeds, such as grains and beans, were rarely eaten and never in large quantities on a daily basis. Recent archeological evidence also indicates that winemaking may have originated in the Paleolithic, when early humans drank the juice of naturally fermented wild grapes from animal-skin pouches. Paleolithic humans consumed animal organ meats, including the livers, kidneys and brains. Upper Paleolithic cultures appear to have had significant knowledge about plants and herbs and may have, albeit very rarely, practiced rudimentary forms of horticulture.; p 61 In particular, bananas and tubers may have been cultivated as early as 25,000 BP in southeast Asia. Late Upper Paleolithic societies also appear to have occasionally practiced pastoralism and animal husbandry, presumably for dietary reasons. For instance, some European late Upper Paleolithic cultures domesticated and raised reindeer, presumably for their meat or milk, as early as 14,000 BP.Lloyd, J & Mitchinson, J: \"The Book of General Ignorance\". Faber & Faber, 2006. Humans also probably consumed hallucinogenic plants during the Paleolithic period. The Australian Aborigines have been consuming a variety of native animal and plant foods, called bushfood, for an estimated 60,000 years, since the Middle Paleolithic. People during the Middle Paleolithic, such as the Neanderthals and Middle Paleolithic Homo sapiens in Africa, began to catch shellfish for food as revealed by shellfish cooking in Neanderthal sites in Italy about 110,000 years ago and Middle Paleolithic Homo sapiens sites at Pinnacle Point, in Africa around 164,000 BP. Although fishing only became common during the Upper Paleolithic,African Bone Tools Dispute Key Idea About Human Evolution National Geographic News article. fish have been part of human diets long before the dawn of the Upper Paleolithic and have certainly been consumed by humans since at least the Middle Paleolithic.\"Stone Age,\" Microsoft Encarta Online Encyclopedia 2007 Contributed by Kathy Schick, Ph.D. and Nicholas Toth, Ph.D. For example, the Middle Paleolithic Homo sapiens in the region now occupied by the Democratic Republic of the Congo hunted large -long catfish with specialized barbed fishing points as early as 90,000 years ago. The invention of fishing allowed some Upper Paleolithic and later hunter- gatherer societies to become sedentary or semi-nomadic, which altered their social structures.Bahn, Paul (1996) \"The atlas of world archeology\" Copyright 2000 The Brown Reference Group PLC Example societies are the Lepenski Vir as well as some contemporary hunter-gatherers such as the Tlingit. In some instances (at least the Tlingit) they developed social stratification, slavery and complex social structures such as chiefdoms. Anthropologists such as Tim White suggest that cannibalism was common in human societies prior to the beginning of the Upper Paleolithic, based on the large amount of “butchered human\" bones found in Neanderthal and other Lower/Middle Paleolithic sites. Cannibalism in the Lower and Middle Paleolithic may have occurred because of food shortages. However, it may have been for religious reasons, and would coincide with the development of religious practices thought to have occurred during the Upper Paleolithic. Nonetheless, it remains possible that Paleolithic societies never practiced cannibalism, and that the damage to recovered human bones was either the result of ritual post-mortem bone cleaning or predation by carnivores such as saber tooth cats, lions and hyenas. == Related pages == *Stone tool *Hand axe == References == == Other sources == * Christopher Boehm 1999. \"Hierarchy in the forest: the evolution of egalitarian behavior\" page 198 Harvard University Press. * Leften Stavros Stavrianos 1991. A global history from prehistory to the present. New Jersey, USA: Prentice Hall. * Bahn, Paul 1996. The atlas of world archeology. The Brown Reference Group PLC. == Other websites == * Early voices: the leap to language, by Nicolas Wade * Human Evolution, Microsoft® Encarta® Online Encyclopedia 2007 © 1997-2007 Microsoft Corporation. Contributed by Richard B. Potts. * Stone Age, Microsoft® Encarta® Online Encyclopedia 2007 © 1997-2007 Microsoft Corporation. Contributed by Kathy Schick and Nicholas Toth. * Middle and Upper Paleolithic hunter-gatherers the emergence of modern humans: the Mesolithic * Map of Earth during the late Upper Paleolithic, by Christopher Scotese Category:Stone Age Category:Prehistory Category:Anthropology",
 "title": "Palaeolithic"
}