{
 "id": "1023164",
 "text": "Luigi Eugenio Tagliaferri di Pagnona (Pagnona, November 14, 1841 - Mandello del Lario, September 30, 1927) was a Italian sculptor, painter, draftsman. He stayed for a long time in Lierna, where he created many of his works. == Biography == Luigi Tagliaferri, known as Luigi di Pagnona, was born in Pagnona in Valsassina, but grew up in Mandello, descendant of a family of artists specialized in frescoes. The first artist of the Tagliaferri dynasty was Giambattista Tagliaferri, author of a leather frontal for the church of Pagnona (1752), according to a then widespread taste. Luigi Tagliaferri is the son of Giovanni Maria Tagliaferri (1809-1879) who was for a long time in Venice as an engraver in the art of iron and then in Milan where, as an engraver, he invented a particular decoration technique on marble, of which some essays remain Margno and in Vendrogno. Giovanni Maria Tagliaferri in Milan also became a painter and created the paintings for the chapel of San Rocco in Premana, with a cycle on the plague (the frescoes in the parish church of San Dionigi have however been lost) and he painted the frescoes on the facades of churches such as San Martino of Indovero (1841), the church of Vimogno (1853) or the church of Barcone (1870). His works can be found both in the villages of the valley (Premana, Taceno, Casargo, Indovero and Pasturo) and beyond the lake and in Lecco. The painter was also a teacher in Pagnona and taught the art to his son Luigi Tagliaferri, who moved to Lecco and finally to Mandello. Luigi Tagliaferri's works are numerous and he worked in Valsassina, in Lecco, in the villages of the lake and also beyond the lake and also in the Milan area. Luigi works with other artists of the family such as the brothers Achille and Basilio and his nephew Giovanni. The activity of the group continued until the 1940s, so that the Tagliaferris are to be considered among the most interesting sacred artists of Lake Como. Among the best known works by Luigi Tagliaferri is the Via Crucis of Lierna on Lake Como.Tagliaferri frescoed many sacred buildings with paintings both on Lake Como and in Valtellina.Tagliaferri is buried in the family chapel of Mandello del Lario on Lake Como. == Style == In his paintings he affirms a profound theological knowledge, his decisive brushstrokes have classical and baroque reminiscences, but used with sobriety, taste, sense of balance and proportion. == Related pages == * Lierna == Bibliography == * Giuseppe Fusari, La chiesa di Santa Maria Maggiore in Chiari, 2010 *Mariuccia Belloni Zecchinelli, Cappelle e dipinti votivi: nelle \"Tre Pievi\" altolariane, 2002 * Federico Cereghini, Damiano Cereghini, Nobiallo di Menaggio e il suo santuario, 2002 *M.Gianasso, Guida turistica della provincia di Sondrio,1979 ==Other websites== Category:1901 births Category:1966 deaths Category:Italian sculptors",
 "title": "Luigi Tagliaferri"
}