{
 "id": "1023754",
 "text": "On 23 June 2023, Wagner Group leader Yevgeny Prigozhin said that soldiers of the Russian Ministry of Defense were attacking his soldiers. Prigozhin promised to take revenge on the Ministry of Defense. Prigozhin said the \"evil\" military leaders must be stopped and said he would \"march for justice\". Prigozhin also said that Russia's reasons for invading Ukraine were lies and that Ukraine and NATO were not planning an attack on the Donbas and Crimea in 2022. He said Sergei Shoigu, the Russian Minister of Defence, was making Russia lose in the war. He also said the military attacked the Wagner Group. The Federal Security Service (FSB) opened a criminal case against him after these statements. Prigozhin took his 25,000 soldiers out of Ukraine and into Rostov-on-Don in Rostov Oblast, Russia. He said, \"If anyone gets in our way, we will destroy everything!\" Putin responded to PMC Wagner's attack by saying its actions were \"treason\" and a \"stab in the back\". == Background == === Wagner Group and Yevgeny Prigozhin === In 2014, Russian oligarch Yevgeny Prigozhin founded the Wagner Group. It is a Russian private military company. Because of the Russian invasion of Ukraine in 2022, Yevgeny Prigozhin and Wagner Group got more influence in the military. The estimated number of Wagnerites grew from \"several thousand\" fighters in 2017–2018 to around 50,000 fighters by January 2023. === Russian invasion of Ukraine === According to news website Meduza, right before a Russian invasion of Ukraine, Prigozhin had tense relations with the Russian leadership. Prigozhin criticized Sergei Shoigu for the actions of the Russian army in Syria. He said that the Russian military was using \"outdated methods.\" The growth of the influence of Wagner Group was because the first Russian plans failed to quickly beat Ukraine. In the first months of the Russian invasion of Ukraine, the Russian army lost many soldiers. The Russian leaders began to recruit mercenaries to fight for Russia. Prigozhin was given many resources. He able to recruit prisoners into Wagner. PMC Wagner became a private army for Prigozhin. The Russian Ministry of Defense and the Russian General Staff did not like this began trying to limit Prigozhin's growing influence. Prigozhin began to criticize the Ministry of Defense of the Russian Federation. On 5 June, Prigozhin showed a video on his social media channels claiming to show a captured Russian colonel, Lt. Colonel Roman Venevitin of Russia’s 72nd Brigade, admitting to have told his troops to attack Wagner troops. == Timeline == === 23 June === On 23 June 2023, a video was shown in Telegram channels for PMC Wagner. According to Prigozhin, it had been recorded at a Wagner Group mercenary camp that had been attacked by a missile. Bellingcat journalist Arik Toler said that the place of the alleged attack is the same as earlier videos of war correspondent Alexander Simonov, who went to the camp. That evening, Prigozhin announced the beginning of an armed conflict with the Ministry of Defense. The message showed up in the Telegram channel of his press service. Prigozhin told anyone who wanted to join the conflict against the Ministry of Defense to do so. He also said that Shoigu had used artillery and helicopters to attack PMC Wagner. The Russian Defense Ministry said they didn't attack PMC Wagner. After that, the Prosecutor General's Office of the Russian Federation said that a criminal case had been started against Prigozhin under Article 279 of the Criminal Code of the Russian Federation (armed rebellion). Generals Sergey Surovikin and Vladimir Alekseev tried to tell the Wagner PMC fighters to stop. Russia's state-run First Channel announced an \"emergency newscast\". In it, the host Ekaterina Andreeva claimed that Prigozhin's statements about attacks by the Ministry of Defence on PMC Wagner were fake and that Putin had been told about the situation. In response to Prigozhin, Russia's military and its national guard deployed armored vehicles in both Moscow and Rostov-on-Don. Rostov-on- Don is a large city near the frontlines in Ukraine where PMC Wagner troops had been attacking from. It is also where Prigozhin had said that PMC Wagner troops were going to. During the night from 23 to 24 June, Prigozhin claimed that PMC Wagner was going into Rostov-on-Don and told forces of Ministry of Defence not to oppose his army. Prigozhin also claimed on 23 June that the head of the General Staff of Russian military had told the country's air force to attack PMC Wagner soldiers, who were moving next to civilian vehicles. He said the General Staff didn't care about the lives of innocent people, \"just as they have been killing their own population for a year and half instead of fighting the enemy\". He also claimed that some pilots refused to follow the General Staff's orders, and thanked them. Putin's press secretary Dmitry Peskov said the situation was an \"attempted mutiny\" and said that Russia's military agencies were telling Putin about the events. Russia blocked Google News because of the situation. === 24 June === On 24 June, Prigozhin claimed that Wagner PMC fighters shot down a military helicopter that opened fire on Wagner. Unconfirmed footage showed a battle in Rostov-on-Don between Wagner and Russian military forces. On 24 June 2023, Yevgeny Prigozhin was charged by the Russian government with organizing an armed uprising after he threatened to attack Russian forces in answer to an air strike on his soldiers. Russian security forces said he was launching a coup. Russian generals told Wagner's fighters to go back. Meanwhile Russia's national security service, FSB, said it had filed criminal charges against Prigozhin and moved to arrest him. According to Russian state media reports, and some Western media, Wagner Group forces have taken control of the Southern Military District building in Rostov. Yevgeny Prigozhin released a video showing him in the military headquarters in Rostov-on-Don. He said that all military buildings in the city were under control of PMC Wagner. Prigozhin also said they had taken the city's military airport. Mayor of Moscow, Sergei Sobyanin, announced that anti-terrorist actions were being used in the federal city of Moscow. Rostov- on-Don is connected to Moscow by the M-4 Highway. There have been reports of Wagner troops using the highway to get closer to Moscow. The governments of Lipetsk Oblast and Voronezh Oblast have told all civilians to stay inside after reports of fighting along the highway. The company Avtodor, which manages Russian highways, told civilians to stay off the M-4 highway on Telegram. The Russian news agency TASS said that traffic was blocked on the M-4 and that cars were being turned around. Social media posts showed videos of fighting between Wagner PMC troops and Russian military in Voronezh, with Reuters showing Russian military reports. Voronezh is halfway between Rostov and Moscow. According to reports, the PMC Wagner has taken control of all military buildings in Voronezh. After this, a state of counter-terrorism started in Voronezh, similar to the one in Moscow. Russian President Vladimir Putin addressed the country for the first time since the beginning of the rebellion in a televised address. He said the actions of the PMC Wagner were \"treason\" and he promised to take \"harsh steps\" to get rid of the rebellion. Putin said that the fighting was a threat to Russia itself. He said the rebellion was a \"stab in the back\". He compared the rebellion to the 1917 Russian Revolution. On the 24th June, at approximately 17:30 UTC, the first reports of a peace deal arose. In them, Prigozhin allegedly stated that he has \"made his point\" and that the Wagner column en route to Moscow was turning around and heading back to field camps. It was rumoured that Belarusian President Alexander Lukashenko was a mediator and a third party to the negotiations between the Russian Government and the Wagner Group. === Peace Deal === In the afternoon, the citizens of Moscow have all been panicking because of the rebellion. The mayor of Moscow had earlier announced to all citizens of Moscow to “Stay at homes at all times without leaving and travelling around the city.” When late evening was coming in Russia, whilst Moscow was in panic and the Wagner tanks were a 4-hour drive from Moscow, ready to take the capital, Yevgeny Prigozhin announced that his troops are “halting”, and turning back to avoid “bloodshed”. Alexander Lukashenko, President of Belarus said that there were day-long negotiations between him and Prigozhin, until finally a deal was made. Later on in the night of 24/25 June 2023, Prigozhin, under the conditions of the deal, was told that he shall not face criminal charges, and instead, move to Belarus, to Alexander Lukashenko. == Related pages == * Russian Revolution * 1917–1923 Russian Civil War * 1991 Soviet coup d'état attempt *1993 Russian Constitutional Crisis == Notes == == References == Category:2023 in Europe Category:Conflicts in 2023 Category:Rebellions in Europe Category:June 2023 events",
 "title": "Wagner Group rebellion"
}