{
 "id": "1023633",
 "text": "Itatehyozu Shrine (Japanese: 板手兵主神社, Itatehyōzu Jinja) is a Shinto shrine in Himeji, Hyōgo, Japan. It is renowned for its Single Mountain Rite held every 60 years and Three Mountains Rite held every 20 years. The shrine's rituals are related to rituals at Iwa Shrine a famous nearby shrine.https://archive.today/20230623235608/https://d-museum.kokugakuin.ac.jp/eos/detail/id=9220 It is a Sōja shrine and enshrines all the gods of Harima Province. == Background == The Itatehyozu Shrine is believed to have an ancient connection with the Iwa Shrine, especially in terms of the deity worshipped and the rituals performed. While the Iwa Shrine is primarily dedicated to the deity Ōnamuchi-no-mikoto, associated with Mount Miya, Itatehyozu Shrine’s rites are said to have been established at the request of the Iwa Deity. == Single Mountain Rite and Three Mountains Rite == The Itatehyozu Shrine follows a distinct cycle for its two principal rites. The Single Mountain Rite is performed once every sixty years, while the Three Mountains Rite takes place every twenty years. === Single Mountain Rite === The Single Mountain Rite is an elaborate ceremony that pays homage to a single sacred mountain. This ritual involves a week-long sacred carnival event (kami-nigiwai gyōji) that sees the construction of a bamboo and cloth mountain, which is approximately fifteen meters in height. This structure is placed at the entrance of the shrine. A mountaintop shrine or 'hokora' is placed at the summit of this artificial mountain. Atop the shrine gate, a small hall is established. During the ceremony, sacred food offerings, including a variety of mochi, are presented to the deity. === Three Mountains Rite === The Three Mountains Rite is focused on worshipping the three mountains surrounding the Iwa Shrine – Mount Takahata, Mount Hanasaki, and Mount Shirakura. Although this rite is performed every twenty years, it is similar in nature to the Single Mountain Rite in terms of the offerings and rituals. == Connection to Iwa Shrine == As mentioned earlier, the rituals at Itatehyozu Shrine are believed to have been established upon the request of the Iwa Deity. Iwa Shrine has its own set of rites, namely the Single Mountain Rite and Three Mountains Rite. However, the frequency of these rituals at Iwa Shrine is exactly the opposite of those at Itatehyozu Shrine: the Single Mountain Rite at Iwa Shrine is held every twenty years, and the Three Mountains Rite every sixty years. Moreover, at Iwa Shrine, the rituals involve carrying a new mountaintop shrine to the summit of the mountain, and a white flag is raised. == Cultural Significance == The rituals at Itatehyozu Shrine are highly significant culturally, and are awaited with anticipation due to their infrequent occurrence. They play an important role in the religious and cultural life of the local community. The rites are believed to ensure protection, prosperity, and harmony for the region, as they involve offering respects and homage to the sacred mountains and the deities associated with them. == Related pages == * Iwa Shrine * Shinto * Hyōgo Prefecture ==References== Category:Soja shrines Category:Beppyo shrines Category:Ken-sha Category:Shinto shrines in Hyōgo Prefecture",
 "title": "Itatehyōzu Shrine"
}