{
 "id": "1023919",
 "text": "Khudadad Khan, VC (20 October 1888 - 8 March 1971) was a Pakistani recipient of the Victoria Cross, the highest award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces. During the First World War, on 31 October 1914 at Hollebeke, Belgium, 26-year-old Khan, serving in the British Indian Army, performed an act of bravery for which he was awarded the Victoria Cross. He was the first British India subject to earn the Victoria Cross, after members of the British Indian Army became eligible for the Victoria Cross in 1911, replacing the Indian Order of Merit first class. ==Life== Born on 20 October 1888 in the village of Dab in Chakwal District of the Punjab Province, British India (now Pakistan) in a Punjabi Muslim Rajput family of Minhas Clan, Khudadad Khan was a Sepoy in the 129th Duke of Connaught's Own Baluchis, British Indian Army (now 11th Battalion The Baloch Regiment of Pakistan Army). The battalion formed part of the Indian Corps, which was sent to France and Flanders in 1914 to reinforce the British forces fighting on the Western Front during the First World War. He took part in the defence of Lille until it was overrun by the Germans. In October 1914, when the Germans launched the First Battle of Ypres, the newly arrived 129th Baluchis were rushed to the frontline to support the hard-pressed British troops. On 31 October, two companies of the Baluchis bore the brunt of the main German attack near the village of Gheluvelt in Hollebeke Sector. The out- numbered Baluchis fought gallantly but were overwhelmed after suffering heavy casualties. Sepoy Khudadad Khan's machine-gun team, along with one other, kept their guns in action throughout the day, preventing the Germans from making the final breakthrough. The other gun was disabled by a shell and eventually, Khudadad Khan's own team was overrun. All the men were killed by bullets or bayonets except Khudadad Khan who, despite being badly wounded, had continued working his gun. He was left for dead by the enemy but managed to crawl back to his regiment during the night. Thanks to his bravery, and that of his fellow Baluchis, the Germans were held up just long enough for Indian and British reinforcements to arrive. They strengthened the line, and prevented the German Army from reaching the vital ports; Khan was awarded the Victoria Cross. === Official citation === He was supposed to be awarded the medal on the same day, 5 December 1914, as Darwan Singh Negi VC but Khan was too sick. Khan was presented with the Victoria Cross by King George V during a visit to troops in France on 26 January 1915. As such Khan is regarded as the first Indian recipient, as Negi's VC action was on a later date. === Later life and legacy === Khan was subsequently sent for treatment at the Royal Pavilion military hospital in Brighton. Khan retired as a Subedar in 1929, after which he settled in the Punjab. He made several visits to Britain in connection with the Victoria Cross, including the Victoria Cross centenary review parade in Hyde Park, London, in June 1956. He died on 8 March 1971 aged 82, and is buried in Chak No. 25, Mandi Bahauddin. His Victoria Cross is on display at his ancestral house in Village Dab (Chakwal), Pakistan. He was at the time of his death the last surviving British India World War I veteran who had served on the Western Front. A statue of Khudadad Khan is at the entrance of the Pakistan Army Museum in Rawalpindi. In 2016 a play by Ishy Din, Wipers, about Khudadad Khan's feat was put on in a number of English theatres. ==Notes== ==References== Category:1888 births Category:1971 deaths Category:Victoria Cross winners Category:People of British India Category:British people of World War I Category:Chakwal District Category:Pashtun people",
 "title": "Khudadad Khan"
}