{
 "id": "102357",
 "text": "Soundgarden was an American rock band. They began in Seattle, Washington, in 1984. Soundgarden helped create the sound of grunge music. This is a genre of alternative rock that first became popular in Seattle. They were first signed to a local record label Sub Pop. Later, they were the first grunge band to sign to a major label, A&M; Records, in 1988. Soundgarden became well known with the 1994 album Superunknown. It debuted at number one on the Billboard charts. Two singles won Grammy Awards; \"Black Hole Sun\" and \"Spoonman\". VH1 has ranked Soundgarden at number 14 in their special 100 Greatest Artists of Hard Rock. In 1997, the band broke up because they could no longer agree on the sound of their musical future. The members worked on other projects for more than ten years. Soundgarden got back together in 2010. Two years later, they released their sixth studio album, King Animal. On May 17, 2017, frontman Chris Cornell was found dead in his Detroit hotel room, the night after a concert at the city's Fox Theatre. An autopsy on his body revealed that Cornell had killed himself. The band broke up after Cornell's death. == Early band history == Soundgarden began in 1984. They first had three members: singer and drummer Chris Cornell, lead guitarist Kim Thayil, and bassist Hiro Yamamoto.DeRogatis, Jim 2003. Milk It!: collected musings on the alternative music explosion of the 90's. Cambridge: Da Capo, p69. The band named themselves after a wind-channeling pipe sculpture, \"A Sound Garden\". The art work is in Magnuson Park, in Seattle.\"Nirvana and the Story of Grunge\". Q. p102. December 2005. At first, Cornell played drums while singing, but in 1985 the band hired Scott Sundquist so that Cornell could just sing.George-Warren, Holly, Patricia Romanowski, and Jon Pareles. The Rolling Stone Encyclopedia of Rock & Roll. Rolling Stone Press. 2001. . The band's first recordings were three songs on a compilation album for C/Z Records named Deep Six. Also appearing on the album were early grunge artists Green River, Skin Yard, Malfunkshun, The U-Men and the Melvins. In 1986, Sundquist left the band. He was replaced by Matt Cameron, who had been the drummer for Skin Yard. A Seattle radio station DJ, Jonathan Poneman, liked Soundgarden after seeing them perform. He later said, \"I saw this band that was everything rock music should be\".Azerrad, Michael. Our Band Could Be Your Life. Little Brown and Company, 2001. , pg. 422 Poneman offered to pay for a record to be made by the band. Teaming up with Bruce Pavitt, Poneman also contributed $20,000 to the financially struggling Sub Pop. This helped turn Sup Pop into a popular, successful record label that attracted more success with grunge bands.Berkenstadt, Jim, and Charles R. Cross. Classic Rock Albums: Nevermind. Schirmer, 1998. , pg. 19 Sub Pop then released Soundgarden's Screaming Life EP in 1987, and the Fopp EP in 1988. A combination of the two was issued as Screaming Life/Fopp in 1990. Though major labels were asking Soundgarden to sign with them, in 1988 the band chose a small independent label, SST Records. SST released their debut album, Ultramega OK. The album was nominated for a Grammy for Best Metal Performance in 1990. The band's first music video, \"Flower\", became popular; airing regularly on MTV's 120 Minutes. In 1989, Soundgarden promoted Ultramega OK with a tour of the United States and then went to Europe. This was their first overseas tour.\"Haughty Culture\". Kerrang!. April 8, 1989. == Major labels == In 1989, Soundgarden released their first album for a major label, A&M; Records. Louder Than Love became the band's first to chart on the Billboard 200. It reached number 108 on the chart in 1990. The band supported the album with tours of North America and Europe. A month before touring for Louder Than Love began, bassist Hiro Yamamoto left to go back to college.Loera, Carlos. \"Soundgarden\". Loud. 1990. Yamamoto was unhappy because he felt he was not important enough to the band.\"How Does Your Garden Grow?\". Sounds. October 21, 1989. Former Nirvana bassist Jason Everman took his place for the tour. Everman was fired immediately after Soundgarden got back from Europe in mid-1990. An EP Loudest Love and the video compilation Louder Than Live, were both released in 1990. The video shows five live tracks made during the Louder Than Love tour. ===Badmotorfinger: 1990–1993=== Bassist Ben Shepherd joined Soundgarden in 1990. Their next album, Badmotorfinger was released in 1991. It had some success, reaching number 39 on the album charts. But it got less attention because of the surprise success of Nirvana's Nevermind, released the same month as Badmotorfinger.Erlewine, Stephen Thomas. \"[ Soundgarden]\". AllMusic. Retrieved on 6 May 2016. Two singles got popular airplay on alternative radio stations and MTV. The first single from Badmotorfinger, \"Jesus Christ Pose\", got negative attention when MTV banned its music video in 1991.Gilbert, Jeff. \"Primecuts: Kim Thayil\". Guitar School. May 1994. Many listeners were outraged by the song and its video, calling it anti-Christian. The band received death threats while on tour in the United Kingdom in support of the album.\"I Don't Care About Performing for 20,000!\". Raw. September 15, 1993. Badmotorfinger was nominated for a Grammy Award for Best Metal Performance in 1992. After a tour of North America in 1991, the band opened for Guns N' Roses in North America on the band's \"Use Your Illusion Tour\".Sherry, James. \"Soundgarden\". Metal Hammer. December 1991. After several tours to promote the album, they rejoined Guns N' Roses in the summer of 1992 in Europe as part of the Use Your Illusion Tour with another opening act, Faith No More.Neely, Kim. \"Soundgarden: The Veteran Band from Seattle Proves There's Life After Nirvana\". Rolling Stone. July 9, 1992. The band took part in the 1992 Lollapalooza tour with the Red Hot Chili Peppers, Pearl Jam, and Ministry. The band later released a video compilation Motorvision. It was made in 1992 at the Paramount Theatre. Also that year, they appeared in the movie Singles. They were show performing \"Birth Ritual\". The song appeared on the soundtrack, as did a Chris Cornell solo song, \"Seasons\". ===Superunknown: 1994–1995=== Soundgarden released Superunknown in 1994. It became the band's best-selling album, partly because of the popular singles \"Black Hole Sun\", \"Spoonman\", \"My Wave\", and \"Fell on Black Days\". Upon its release in March 1994, Superunknown debuted at number one on the Billboard 200 album chart.\"Changing of the Garden\" . Entertainment Weekly. March 25, 1994. Retrieved on May 2, 2004. The lyrics of the songs were dark and sad; much of them seem to be talking about substance abuse, suicide, and depression. Reviewer J.D. Considine of Rolling Stone said Superunknown \"demonstrates far greater range than many bands manage in an entire career.\" He also stated, \"At its best, Superunknown offers a more harrowing depiction of alienation and despair than anything on In Utero.\"Consideine, J.D. \"Soundgarden: Superunknown\" . Rolling Stone. July 31, 1997. The music video for \"Black Hole Sun\" received the MTV Video Music Award for \"Best Rock Video|Best Metal/Hard Rock Video\" award in 1994. Soundgarden won two Grammy Awards in 1995; \"Black Hole Sun\" received the award for Best Hard Rock Performance and \"Spoonman\" received the award for Best Metal Performance. ===Down on the Upside: 1996–1997=== After a worldwide tour to promote Superunknown, the band members began working on what would become their last studio album for more than 15 years. It was released in 1996. Four singles were released from the album: \"Pretty Noose\", \"Blow Up the Outside World\", \"Burden in My Hand\", and \"Ty Cobb\". The music was less heavy metal and grunge sounding than the group's previous albums. The band members said that they wanted to experiment with other sounds.Turman, Katherine. \"Soundgarden: Seattle's Sonic Boom\". Hypno. 1996. In a review, David Browne of Entertainment Weekly said, \"Few bands since Led Zeppelin have so crisply mixed instruments both acoustic and electric.\"Browne, David. \"Down on the Upside\" . Entertainment Weekly. May 24, 1996. However, the writing and recording of the album was stressful for the group. Thayil and Cornell seemed to not agree on a change from the heavy guitar riffs that had become the band's trademark.Colopino, John. \"Soundgarden Split\". Rolling Stone. May 29, 1997. The album got favorable reviews, but did not sell as well as Superunknown. The band played on the 1996 Lollapalooza tour with Metallica, who had asked for them to appear.Bell, Max. \"Soundgarden - Like Falling Off a Hog\". Blah Blah Blah. June 1996. After Lollapalooza, the band left for a world tour.Waters, Rodney. \"Getting Down with Soundgarden\". Hit Parader. October 1996. Tensions continued to increase during the tour. When asked if the band hated touring, Cornell said, \"We really enjoy it to a point and then it gets tedious, because it becomes repetitious. You feel like fans have paid their money and they expect you to come out and play them your songs like the first time you ever played them. That's the point where we hate touring.\"\"Gardener's Question Time\". Kerrang!. March 1, 1997. At the tour's final stop in Honolulu, Hawaii on February 9, 1997, Shepherd threw his bass guitar into the air in frustration after his equipment failed. He then stormed off the stage.\"Nirvana and the Story of Grunge\", pg. 100. The band then also left the stage, but Cornell returned to play a solo as an encore.Berger, John. \"'Garden' of supersonic delight\". Honolulu Star-Bulletin. February 10, 1997. == Breakup and reunion == On April 9, 1997, the band announced they were breaking up. Thayil said, \"It was pretty obvious from everybody's general attitude over the course of the previous half year that there was some dissatisfaction.\"Gilbert, Jeff. \"Sound of Silence\". Guitar World. February 1998. A best-of album named A-Sides, was released in November 1997 through A&M; Records. After almost 13 years, on January 1, 2010, Chris Cornell wrote on his Twitter, \"The 12-year break is over and school is back in session. Sign up now. Knights of the Soundtable ride again!\" The message linked to a website for fans to enter their e-mail addresses to get updates on the reunion. On May 18, 2017, hours after the band performed a concert in Detroit, Michigan, Chris Cornell committed suicide by hanging. ==Members== *Chris Cornell - vocals, rhythm guitar (1984 – 2017) *Kim Thayil - lead guitar (1984 - 2017) *Ben Shepherd - bass (1990 – 2017) *Matt Cameron - drums (1986 - 2017) == Discography == Release year Album US chart UK chart 1988 Ultramega OK -- -- 1989 Louder Than Love 108 -- 1991 Badmotorfinger 39 39 1994 Superunknown 1 4 1996 Down on the Upside 1 7 1997 A-Sides 63 90 2010 Telephantasm ==References== Category:Musical groups from Seattle Category:1980s American music groups Category:1990s American music groups Category:2000s American music groups Category:2010s American music groups Category:American heavy metal bands Category:Grunge bands Category:Musical groups established in 1984 Category:1984 establishments in the United States Category:1980s establishments in Washington (state) Category:Musical groups disestablished in 1997 Category:1990s disestablishments in Washington (state) Category:Musical groups established in 2010 Category:2010 establishments in the United States Category:21st-century establishments in Washington (state) Category:2017 disestablishments in the United States Category:Musical groups disestablished in the 2010s Category:21st-century disestablishments in Washington (state)",
 "title": "Soundgarden"
}