{
 "id": "1023126",
 "text": "P5 (also known as Class Act) was a short-lived comic strip in the UK comic The Dandy, Which had run between 1998 and 2002. It was drawn by Dennis the Menace artist Jimmy Hansen. It first appeared in issue #2965 (dated September 19, 1998). ==Overview== The series focussed on a class of prepubescent children in a school – Class P5, similar to The Bash Street Kids of The Beano. Each strip would sometimes focus on an individual in the group, and how they deal with situations that came up in school. As the series went on, the character of Kim was joined to Class P5 from issue #3034 dated January 15, 2000, and the character of Dotty was moved from preschool class into P5. The strips also moved away from individual stories and focussed more on the group as a whole. In Issue #3000, the kids had grown up to become adults with a school reunion theme, with Miss Truncheon now working in a job centre, until the last frame of the story when she immediately resigned, saying she wanted to stay away from \"that lot\", who had all since taken jobs at the same job centre. They appeared in a one-off in July 2002. P5 returned as a reprint on 4 November 2006 under the new title of Class Act. The reprints are mainly from 1998 and 1999 for DC Thomson's policy of comic strips being at least 7 years old before they are reprinted. These reprints ended when The Dandy relaunched in August 2007. ==Characters== *Den – The class leader, who sometimes appreciates lessons so that he can get away from his sister, Dotty. *Dotty – Den's annoying little sister, who later attends P5 after passing a set test with flying colours, much to Den's annoyance. *Jackie – A vain, self-centred blonde often seen with ponytails and high-heel shoes. *Kim – A Chinese student, who introduced to Class P5 from issue #3034, dated January 15, 2000. *Liam & Noel - Two rough, violent twin brothers who are almost always fighting with each other. Named after Noel and Liam Gallagher, who founded the band Oasis. *PC – a nerdy inventor who uses a robotic backpack to help him with his lessons. *Miss Truncheon – Their long-suffering teacher who seems to have little power over P5, allowing them to stage their own plans and ideas without much opposition. Category:Comic strips",
 "title": "P5 (comics)"
}