{
 "id": "1023316",
 "text": "The African locust bean (Parkia biglobosa) is a type of tree that grows in Africa. It is also known as the African mesquite, néré, or dawadawa tree. People in many African countries use the seeds and fruits of this tree in their cooking. ==Description== The African locust bean tree is a medium-sized tree that can grow up to 20 meters (65 feet) tall. It has a dense crown of leaves and produces long, brown pods that contain seeds. The seeds are surrounded by a sweet pulp. ==Uses== # Food: The seeds are used to make a traditional seasoning called \"dawadawa\" or \"iru.\" People ferment the seeds, dry them, and grind them into a powder. This powder is added to soups and stews to give them a rich flavor. The sweet pulp around the seeds can also be eaten as a snack or used in cooking. # Medicine: Different parts of the tree, such as the bark, leaves, and roots, are used in traditional medicine. The bark and leaves are believed to have medicinal properties and are used to treat ailments like diarrhea and stomachaches. # Livestock feed: The leaves and pods of the African locust bean tree can be used as fodder for livestock, providing a source of nutrition for animals. # Soil improvement: The tree's leaves and pods can be used as organic fertilizer, enriching the soil and improving its fertility. ==Importance to Communities== The African locust bean tree is important to many communities in Africa. It provides a source of food, traditional medicine, and additional income. People sell the seeds, powder, and other products made from the tree in local markets. ==Conservation== Conserving the African locust bean tree is important to ensure its availability for future generations. Deforestation and unsustainable harvesting practices threaten the tree's survival. Efforts are being made to promote sustainable cultivation, protect the tree's natural habitats, and raise awareness on how to combat desertification, halt and reverse land degradation and halt biodiversity loss. Another possible reason for the need for conservation is the wildfires found in the regions from 2001-2006 ==References == Category:Mimosoideae Category:Trees",
 "title": "African locust bean"
}