{
 "id": "1023795",
 "text": "Gopal Krishna Agarwal (born June 1, 1962) is an Indian politician, economist, and spokesperson of the Bharatiya Janata Party (BJP). With a background in finance, business and economics, and management consultancy, Agarwal has been actively involved in the formulation and advocacy of the BJP's economic policies for over two decades. He is known for his expertise in economic policy matters and his articulate arguments on economic issues. == Early Life and Education == Gopal Krishna Agarwal was born on June 1, 1962, in Buldhana, Maharashtra, India. He pursued his Bachelor of Commerce (Honours) degree and went on to become a Chartered Accountant. Agarwal is a fellow member of the Institute of Chartered Accountants of India (ICAI) and has also completed post-graduate studies in M.sc economics. == Political Career == Agarwal's association with the Bharatiya Janata Party (BJP) spans over two decades. He has actively participated in the party's economic policy formulation and has been a member of various committees and forums related to the economy and finance. Notably, Agarwal has served on the Board of Bank of Baroda and North Eastern Electrical Power company. As the spokesperson of the BJP on economic affairs, Agarwal plays a crucial role in articulating the party's economic policies and positions to the media and the public. He has been a vocal advocate of economic liberalization and reforms, and his contributions in this field have earned him recognition as an expert on economic matters.https://www.aninews.in/news/national/general-news/india-will-benefit- from-drop-in-oil-prices-says-bjps-gopal-krishna-agarwal20200309222737 He is on the board of Bharat Petroleum Corporation Limited as an independent Director == Books == Issue Date Title Author(s) 2019-05-04 The appeasement of none Agarwal, Gopal Krishna 2019-05-04 At ease with the world Agarwal, Gopal Krishna 2019-05-04 BJP's change of guard Impact on India;s Economic Fortunes Agarwal, Gopal Krishna 2019-05-04 By Third Quarter Of Current Fiscal Job Market Set To Revive - BW people Agarwal, Gopal Krishna 2019-05-04 Capital market are an instrument for capital formation Agarwal, Gopal Krishna 2019-05-04 Contrarian view is fine, but govt is trying hard. Agarwal, Gopal Krishna 2019-05-04 Day After, BJP takes the lead in collecting funds online Agarwal, Gopal Krishna 2019-05-04 Demonetisation The strategy for a corruption Free and Transparent Ecosystem Agarwal, Gopal Krishna 2019-05-04 Ease of Doing Business icsi Agarwal, Gopal Krishna 2019-05-04 Ease of Doing Business Organizer Agarwal, Gopal Krishna 2019-05-05 Economic Implication of PM Modi's Foreign Policy Agarwal, Gopal Krishna 2019-05-05 The Economy Diplomacy is a key to enhancing Nepal- India Relation Agarwal, Gopal Krishna 2019-05-04 Employment - The Indian Perspective Agarwal, Gopal Krishna 2019-05-04 Facts on Demonetisation and Road Map ahead Agarwal, Gopal Krishna 2019-05-04 Farmers' woes, land acquisition objectives separate Agarwal, Gopal Krishna 2019-05-04 For our programmes, we need far more revenue Agarwal, Gopal Krishna 2019-05-04 Four years of responsive and effective governance Agarwal, Gopal Krishna 2018-07-07 Fuel for Development Agarwal, Gopal Krishna 2019-05-04 Fuel for development Agarwal, Gopal Krishna 2019-05-04 Fuel price crisis_ Issues behind petroleum rates explained in 7 points; lowering dependency on oil a long drawn process Agarwal, Gopal Krishna == Notable Works and Contributions == * Shree Jee Gaushala Sthapna * Jaladhikar Sthapna * Role in the Anti-Corruption Movement * COVID-19 Relief Work == Recognition and Achievements == * Expertise in economic affairs and recognized as a spokesperson for the Bharatiya Janata Party (BJP) on economic matters. * Active participant in the formulation of BJP's economic policies for over three decades. * Served on the Central Board of Direct Taxes (CBDT) and the Task Force on Direct Taxes. * Instrumental in the establishment and promotion of gaushalas, shelters for cows. * Actively involved in initiatives promoting water conservation and management. * Prominent figure in the anti-corruption movement in India. * Contributions to relief efforts during the COVID-19 pandemic. * Widely respected for knowledge and insights on economic policies. * Recognized for professional accomplishments as a Chartered Accountant and economist. * Reputation as a well-rounded professional in finance, taxation, and management consultancy.https://www.ptinews.com/news/national/budget-to-ensure-all-round- growth-bjp-spokesperson-gopal-krishna-agarwal/505509.html == References == Category:Living people Category:1961 births Category:Bharatiya Janata Party politicians Category:Indian economists Category:Accountants Category:Spokespersons Category:People from Etawah Category:People from Uttar Pradesh",
 "title": "Gopal Krishna Agarwal"
}