{
 "id": "1024558",
 "text": "Werner Gregoritsch (born 22 March 1958) is an Austrian football manager and former player. He manages the Austria U21 national team.ÖFB Teams ==Career== He started with Grazer AK. There he won the Austrian youth championship in 1976. In this year he also made his debut in the GAK first team at the age of 17. From 1981 to 1983 he played for VOEST Linz from 1981 to 1983. Then he played another season in Graz. In the 1984/1985 season he played for Vienna in the Bundesliga. Here ended his career in Austria's top division. Between 1986 and 1987 he played one and a half seasons in the 2nd Bundesliga at DSV Leoben. Another station as a player was Deutschlandsberger SC. His coaching career began in 1989 with the Burgenland club SV Güssing as a player-coach. With a stop at ASK Schlaining, he came back to Graz and played for ESK Graz. In the beginning he was player-coach, then only coach. ==Manager== He began his coaching career in April 2000 as head coach at Grazer AK. He was already working as a youth coach and amateur coach at his home club. In autumn 2001, however, after a few defeats and disagreements with the team, he was dismissed by the GAK Presidium and replaced by Christian Keglevits. From 2002 to mid-2004 he was coach of SV Mattersburg. In the 2002/03 season he reached the promotion to the Bundesliga. From 2004 till 2006 he became coach of LASK. In September 2006 Werner Gregoritsch became new coach of SV Kapfenberg. With the team he was promoted to the Bundesliga in the 2007/08 season. On 22 November 2011 it was announced that Kapfenberg SV has dissolved the contract with Gregoritsch. The reason given was the consistently poor performance of the Kapfenberg team in this season. On 20 January 2012, the ÖFB told that Werner Gregoritsch had been appointed as the successor to Andreas Herzog as coach of the Austria U21 team. ==Personal life== Gregoritsch's son, Michael, is the youngest goalscorer in the history of the Austrian Bundesliga. He scored his first goal at the age of 15 years and 361 days.Werner Gregoritsch vergleicht Sohn Michael mit Janko, relevant.at. Accessed 21 August 2022. ==References== Category:1958 births Category:Living people Category:Association football forwards Category:Austrian footballers Category:Austrian football managers Category:Grazer AK managers Category:LASK managers Category:Kapfenberger SV managers Category:Austrian football forwards",
 "title": "Werner Gregoritsch"
}