{
 "id": "1024597",
 "text": "Fawad Afzal Khan is a Pakistani actor, producer, screenwriter, model and singer. He has received several awards including a Filmfare Award. == Filmography == === Films === Key Denotes titles that have not yet been released * All films are in Urdu unless otherwise noted. Year Title Role Country Notes Ref 2007 Khuda Kay Liye Sarmad Pakistan Debut film 2014 Khoobsurat Vikram Singh Rathore India Hindi debut film 2016 Ho Mann Jahaan Rafael Pakistan Cameo appearance Kapoor & Sons Rahul Kapoor India Hindi film Ae Dil Hai Mushkil DJ Ali 2018 Jawani Phir Nahi Ani 2 Tipu Shah Pakistan Cameo appearance 2019 Parey Hut Love Himself 2022 The Legend of Maula Jatt Maula Jatt Punjabi film 2023 Money Back Guarantee Manager Bilal Bux Neelofar Mansoor Ali Khan Completed Aan Filming Abir Gulaal United Kingdom Filming === Television series === Year Title Role Network Notes 2001 Jutt and Bond Bond Indus Vision Acting debut 2008 Dil De Ke Jayengy Arsalan Geo Entertainment Satrangi Behzad 2010 Daastan Hassan Hum TV 2011 Akbari Asghari Asghar Kuch Pyar Ka Pagalpan Mujtaba ARY Digital Humsafar Ashar Hussain Hum TV 2012 Ashk Rohail Hayat Geo Entertainment Zindagi Gulzar Hai Zaroon Junaid Hum TV 2013 Numm Wali Bakht Khan Geo Entertainment 2022 Ms. Marvel Hassan Disney+ Episodes 4 & 5 ===Web series=== Year Title Role Notes Ref 2022 Baarwan Khiladi Kamran Cameo appearance; Tapmad 2024 Barzakh Shehryar Web series for ZEE5 Mehmood Akhtar Filming ===Telefilms=== Year Title Role Network Notes 2006 Kal Haroon PTV Home Opposite Saba Qamar 2010 Aaj Kuch Na Kaho Rehan Hum TV 2013 Behadd Jamal Ahmad 2013 Armaan Armaan PTV Home Also co-writer & co-producer ===Others=== Year Song Ref. 2015 \"Urain Ge\" ==Personal life== Khan married Sadaf Khan in 2005 after a seven-year courtship. They have three children. Khan and his wife founded Silk by Fawad Khan, a clothing line, whose debut collection was launched in August 2012 in Lahore. He was diagnosed with Type 1 diabetes at age 17, after an accident which damaged his pancreas. The accident occurred behind a swimming pool, where Khan was scratched and jumped into untreated water. He later realized he had the disease when he lost . Khan performed Hajj, the annual pilgrimage of Muslims to Makkah, along with his family in 2018 and was therein invited to the Annual Hajj Lunch by King Salman and Crown Prince Mohammed bin Salman of Saudi Arabia. ==References== Category:1981 births Category:Living people Category:Pakistani actors",
 "title": "Fawad Khan"
}