{
 "id": "1024045",
 "text": "The Mercedes-Benz GLE, previously known as the M-Class, is a mid-size luxury SUV produced by Mercedes-Benz since 1997. Initially, the M-Class was built with a body-on-frame structure, but in 2005, it switched to a unibody design. In 2015, the M-Class was renamed to GLE, with hybrid models available since 2005. ==First generation (1997-2005)== The first M-Class (W163), launched in 1997, was intended to replace the Mercedes-Benz G-Class. A plan to develop it based on the Mitsubishi Pajero was canceled in 1993 due to technical issues. The car was manufactured in Tuscaloosa, Alabama, with production starting in 1997. It received a minor update in 2001. == Second generation (2005-2011) == The second-generation M-Class (W164) was launched in 2005 with a unibody structure, sharing its platform with the Mercedes-Benz GL-Class. It was larger than its predecessor and had updated design elements. == Third generation (2011-2019) == The third-generation M-Class (W166) debuted in 2011 for the 2012 model year. This version offered more interior space, improved styling, and advanced features, including full-LED headlights and taillights. ===GLE Introduction=== In 2015, the M-Class was rebranded as the GLE. Alongside the standard SUV, a new coupe version (C292) was introduced. The GLE was positioned between the GLC and the GLS as part of Mercedes' updated naming strategy. ==Fourth generation (2019-Present)== The fourth-generation GLE (V167) was unveiled at the 2018 Paris Motor Show. It introduced two plug-in hybrid options in Europe and two petrol variants in the U.S. For the first time, a 7-seat option was offered. The plug-in hybrid has an all-electric range of 90 to 99 km (56 to 62 miles). A longer wheelbase version is available in China. The coupe SUV version is codenamed C167. == References == ==Other websites== * Category:1990s automobiles Category:2000s automobiles Category:2010s automobiles Category:2020s automobiles GLE Category:Sport utility vehicles",
 "title": "Mercedes-Benz GLE"
}