{
 "id": "1024979",
 "text": "The Volvo XC90 is a mid-sized luxury CUV made by Volvo since August 2002. The first XC90 was shown to the public in 2002, at a motor show, called the North American International Motor Show. The 1st gen XC90 is related to the Volvo S80 and is based on the Volvo P2 platform. The second-gen XC90 was unveiled at the end of 2014, and is based on the Volvo SPA platform. It is related to the Volvo S90 and the Volvo V90 station wagon. ==1st gen== The first-gen XC90 was designed by Doug Frasher in 1999, and shown to the public in November 2001, previewed by a concept in November 2001. It was Volvo's first SUV, and its full body was shown at the North American International Motor Show in January 2002. It was able to be bought and ordered in August 2002, and at first had 2 trims. It has 2 choices of seats, 5, and 7-seat. It is code named 'P28'. ===Changes=== ====2007 change==== In 2007, the XC90 had gotten a small change, including new front and rear, and a new interior. The new XC90 was shown in New York in April 2006. Also, the 'Sport' line was introduced. The 'Sport' line was inspired on the earlier 'R' line of sporty wagons. Later, the 'Sport' became the bridge to 'R Design'. ====2009 changes==== In 2009, the XC90 had larger spaces in between the rear Volvo logos. In 2010, the front Volvo logo got larger. For 2012-13, it had received LED-taillights and DRLs. ==2nd gen== In May 2012, Volvo Cars said that the new XC90 would start in 2014, with orders starting in 2014, and it starting in 2015. The XC90 is based on Volvo's SPA platform, which stands for Scalable Product Architecture, and cars in this platform basically have newer technology, and try to have as low weight as possible, while having as much safety as possible. The new XC90 is longer, wider and lower than the older one, while all being powered by an eight-speed automatic transmission. It was already sold out after 47 hours of orders being open on 3 September 2014. ===T8/XC90 Recharge=== The T8 is a plug-in hybrid version of the XC90. It has an all electric range of 43 km (27 mi), and has the same technology as the Volvo V60 PHEV. In 2021, the T8 was renamed to the 'XC90 Recharge'. ===Change=== The XC90 had gotten a small change in 2020, adding a new front and back, including a new front grille. Category:Sport utility vehicles Category:2000s automobiles Category:2010s automobiles Category:2020s automobiles",
 "title": "Volvo XC90"
}