{
 "id": "1024532",
 "text": "In the Night Garden... is a British - Canadian preschool children's television series created, written and composed by Teletubbies co-creator Andrew Davenport for CBeebies and BBC Two and CBBC. produced by Ragdoll Productions and distributed by WildBrain. The show was aimed at children aged from one to six years old. The programme is narrated by Derek Jacobi. It is filmed mostly in live action and features a mix of actors in costume, stop motion, puppetry and CGI animation. In 2010, the BBC confirmed that it would not be commissioning a third series. == Episodes == == Characters == * Little Igglepiggle is a tall, blue teddy bear with four red hairs on his head. He carries a red blanket everywhere, and sometimes he loses it. Igglepiggle makes squeaking and jingling sounds. Igglepiggle falls over when he is worried, and he is the one who is not in bed at the end of the episodes. Igglepiggle is played by Nick Kellington. * Little Upsy Daisy is a ragdoll with colourful hair that looks like gummy worms, and wears a red/white skirt which fills up with air when she wants to dance. Upsy Daisy has a megaphone on a pole which she uses as a microphone and likes to sing her name into it across the Night Garden. Upsy Daisy has a bed which runs on wheels and whistles as it moves, which only she is allowed to zinkyzonk, or sleep, in. Upsy Daisy is played by Rebecca Hyland. * Little Makka Pakka is a short, beige stuffed creature with three cone bits sticking out of his head. He lives in his rock cave, where he zinkyzonks on his stone bed with one of his rocks. He rides around on his Og- Pog, a three-wheeled pushcart with a place for his trumpet and one for his soap and sponge. The Og-Pog additionally holds Makka Pakka's hair dryer called an Uff-Uff. Makka Pakka is played by Justyn Towler. * The Tombliboos are a family of three dolls who have five round bits on their heads, stripy tops and spotty trousers. The Tombliboos' names are Unn (who is red and green) Ooo (who is brown and pink) and Eee (who is pink and yellow). The Tombliboos live in a big tall bush which has branches and different platforms inside. The Tombliboos like to play the drums and the piano, and brush their teeth on some occasions before zinkyzonktime. The Tombliboos' zinkyzonking bags are colour coded to match who zinkyzonks in which zinkyzonking bag. Unn is played by Andy Wareham, Ooo is played by Isaac BlakeTombliboo Ooo was played by Isaac Blake until January 2008, when he was fired by Ragdoll Productions and suffered from injuries during production. and Holly Denoon and Eee is played by Elisa Laghi. * The Pontipines and the Wottingers are two families of ten wooden peg dolls. The Pontipines are dressed in red and the Wottingers are dressed in blue. There are a mother, father and eight children in each family. Mr Pontipine wears a big fake moustache which sometimes flies off and makes whistling noises. Mrs Pontipine carries binoculars everywhere to look for the children. The Pontipines like having dinners outside, and sometimes invite the Wottingers to have dinner with them. * The Haahoos are a family of five large inflatable dolls. They consist of a Blue Crisscross, Purple Pear, Checkered Ball, Yellow Star and Orange Flower respectively. The Haahoos move slowly through the Night Garden, and close their eyes when it is time to go to zinkyzonk. * Little Ninky Nonk is a toy trackless train dragon with five different carriages. The first is shaped like a banana and is red/orange with a green light, the second carriage is shape a bit like a pumpkin and is green and yellow which is rode by the Tombliboos and Makka Pakka, the third carriage looks like a house and is rode by the Pontipines, the fourth carriage looks a bit like the tardis and is rode by Upsy Daisy and Igglepiggle,when Igglepiggle is travelling with Upsy Daisy. and the final carriage is tall and rounded and is rode by Igglepiggle.when Igglepiggle is travelling alone. The Ninky Nonk goes up and down trees and the lights on top flash when the Ninky Nonk stops. * Little Pinky Ponk is a toy airship fish which is a teal colour and is covered in pink/yellow spots, orange fins and purple propellers. The Pinky Ponk has a large pink propeller at the back, three white lights on top and a pink nose which flashes from time to time. The passengers drink Pinky Ponk Juice when riding the Pinky Ponk, and there is a deck inside near the ceiling where the Pontipines sit inside the Pinky Ponk, and a deck outside which is used by Igglepiggle and Upsy Daisy a lot of time so they can look around the Night Garden. The Pinky Ponk likes to bump into trees, and on the rarest occasions, it gets stuck in a tree and the characters have to rock back and forth to get it out again. * The Tittifers are a family of birds. They consist of a toucan, two turacoes, three hoopoes and four finches. One of the four groups sings during segments in each episode, and all of them sing together before zinkyzonktime. == References == Category:2007 television series debuts Category:2000s British television series Category:2000s children's television series Category:British children's television series Category:2000s British television series debuts Category:2007 establishments in the United Kingdom Category:English-language television programs",
 "title": "In the Night Garden..."
}