{
 "id": "1024763",
 "text": "Virendra Singh Jafa (2 February 1934 – 2 November 2020) was an Indian bureaucrat and administrator known for his contributions to the finance and administration of various departments and ministries of the Government of India.https://www.mha.gov.in/sites/default/files/2023-01/NominationPadmaAwards-2014_0%5B1%5D%5B1%5D_0.pdf == Early life and education == Virendra Singh Jafa was born on 2 February 1934 in Budaun, Uttar Pradesh, India. He obtained his education from Lucknow University, Allahabad University, and the Massachusetts Institute of Technology (MIT) in the United States. == Career == Jafa joined the Indian Defense Accounts Service (IDAS) in 1955 and served in several important positions within the Government of India. He worked in various ministries and departments, including the Ministry of Finance, Ministry of Defense, Ministry of Industry, and the Post and Telegraph Department. Jafa also served as Secretary Public Grievances in the Cabinet Secretariat and worked as an advisor to the Government of Dominica under the United Nations Development Program (UNDP). During his career, Jafa played a significant role in the modernization and efficiency of government processes. He was instrumental in the introduction of speed post services in India as a member of the Postal Services Board. Jafa also led the overhaul and modernization of pension administration and disbursement for the armed forces, and his contributions were crucial to the development of the Indian missile program. == Notable positions held == * Chairman, Tenth Finance Commission of the Union Territories * Secretary Defense Finance, Ministry of Defense, Government of India * Secretary Public Grievances, Ministry of Personnel, Public Grievances and Pensions * Chairman, Bureau of Industrial Costs and Prices * Member, Postal Services Board * Advisor to the Government of Dominica, West Indies, under the United Nations Development Program (UNDP) == References == Category:1934 births Category:2020 deaths Category:Massachusetts Institute of Technology alumni Category:Indian civil servants",
 "title": "Virendra Singh Jafa"
}