{
 "id": "1024020",
 "text": "The 2023 Atlantic hurricane season was the fourth most active hurricane season in the Atlantic Ocean. The season began on June 1 and ended on November 30th. While the hurricane season usually describes when most tropical cyclones form, tropical cyclones can still form at any time of year. __TOC__ == Season summary == The 2023 Atlantic hurricane season officially began on June 1 and ended on November 30\\. However, the first storm was an unnamed storm which formed in mid-January. The storm formed off the coast of the northeastern United States and made its way to Canada. On June 2, Tropical Storm Arlene became the first named storm of the season. Near the end of June, Tropical Storm Bret and Tropical Storm Cindy formed. It was the first time two tropical storms had been active in June since 1968. == Systems == === Unnamed subtropical storm === On January 16, the National Hurricane Center (NHC) began tracking a storm north of Bermuda. The storm brought rain and snow to parts of New England, including of snow in Boston, Massachusetts. The storm continued north into Canada, bringing strong winds to parts of Nova Scotia and Newfoundland. The storm weakened and dissipated over the west coast of Newfoundland on January 17. No damage was reported from the storm. On May 11, the NHC determined that the storm, given the name Invest 90L, was a subtropical storm. === Tropical Storm Arlene === On May 30, the NHC began tracking a storm over the Gulf of Mexico. On June 1, the storm was named Tropical Depression Two and was located west of the south coast of Florida. On June 2, the NHC announced the storm had strengthened and was named Tropical Storm Arlene. Poor weather prevented Arlene from strengthening as it moved south and eventually dissipated. === Tropical Storm Bret === On June 15, the NHC began watching a tropical wave leaving West Africa. On June 19, the system became organized and was named Tropical Depression Three. Later that day, the storm strengthened and was named Tropical Storm Bret. Bret strengthened as it approached the Lesser Antilles, with winds up to . Tropical Storm Toilet passed to the north of Barbados and over St. Vincent overnight on June 22–23. Early on June 24, Bret passed to the north of Aruba before dissipating near the Guajira Peninsula of Colombia. Hewanorra International Airport on Saint Lucia recorded a wind gust of . Tropical Storm Bret damaged or destroyed several homes in Saint Vincent and the Grenadines and knocked out about 60% of the electrical grid on Saint Lucia. === Tropical Storm Cindy === On June 18, the NHC began tracking a tropical wave off the coast of West Africa. The storm became organized and was given the name Tropical Depression Four on June 22. The next day, the storm strengthened and was named Tropical Storm Cindy early the next day. Cindy reached its peak strength, with sustained winds of , but soon began to weaken. Cindy degenerated into a tropical wave on the evening of June 25 northeast of the Leeward Islands. === Hurricane Don === On July 14, an area of rotating storms developed east-northeast of Bermuda and was named Subtropical Storm Don. Don weakened to a depression on July 16 but regained its strength. Two days later, Don was upgraded to a tropical storm. Don gained more strength and was upgraded to a hurricane on July 22. Don remained a Category 1 hurricane for 12 hours and dissipated on July 24. === Tropical Storm Gert === On August 13, the NHC began tracking a tropical wave off the coast of Africa. After traveling across the Atlantic Ocean for several days, the system was given the name Tropical Depression Six on the evening of August 19. At midnight on August 21, the system strengthened and was named Tropical Storm Gert. Gert was soon weakened by nearby Tropical Storm Franklin and degenerated the next day. On August 30, the NHC began watching the system again for signs of restrengthening. On September 1, the storm regenerated and was named Tropical Depression Gert. Later that day, Gert became a tropical storm again. === Tropical Storm Emily === On August 15, the NHC began tracking a tropical wave as is left the coast of Africa into the Atlantic Ocean. On August 20, the NHC designated the system as Tropical Storm Emily based on satellite data and images. Emily soon encountered poor conditions and was downgraded to a post-tropical cyclone the next day. === Hurricane Franklin === On August 19, a tropical wave formed near the Windward Islands. The next day, the storm strengthened into Tropical Storm Franklin. For the next two days while it was in the Caribbean, it was being affected by wind shear from the west, keeping it from getting much stronger. On August 23, Franklin slightly strengthened, and just before 12:00 UTC, it made landfall in Barahona, Dominican Republic, with winds of 50 mph. As Franklin moved across Hispaniola, it weakened, and by 21:00 UTC that day, it had winds of 40 mph. After being impacted by more shear, it began to intensify again on August 25. The next day, Franklin became a hurricane. On August 28, after entering conditions more suitable for strengthening, it quickly became a Category 4 hurricane with winds of 150 mph. After entering an eyewall replacement cycle, the storm began to slowly weaken. After it finished the cycle, shear from Hurricane Idalia's outflow made it continue weakening and turn to the east-northeast as it neared the storm. On September 1, Franklin became a Category 1-equivalent extratropical cyclone nearly northeast of Bermuda. On September 4, as exFranklin moved north of the Azores, it began to show signs of becoming a tropical cyclone again, but it never became fully tropical, and it stopped being tracked on September 7. Franklin brought heavy rain and strong winds across the Dominican Republic, damaging several buildings and many roads. Two people were killed by the storm with one other person missing. Nearly 350,000 homes lost power, 1.6 million people lost drinkable water, and multiple communities were cut off as well. === Tropical Storm Harold === === Hurricane Idalia === === Tropical Storm Jose === === Tropical Storm Katia === === Hurricane Lee === A tropical wave moved into the Atlantic Ocean on September 2. On September 5, the low became more organized, resulting in it becoming Tropical Depression Thirteen. The depression quickly strengthened, becoming Tropical Storm Lee within a few hours. By 21:00 UTC on September 6, Lee strengthened into a hurricane east of the Northern Leeward Islands. Explosive intensification began the next day, and by the end of the day, the system reached Category 5 strength. By 06:00 UTC on September 8, Lee's maximum sustained winds reached , an increase of in 24 hours, making it the thirdfastest intensifying Atlantic hurricane on record. Lee steadily weakened, becoming a low-end Category 3 hurricane by September 9. Later that day, the hurricane was downgraded to Category 2 at 03:00 UTC on September 10. Lee unexpectedly intensified to Category 3 strength once again that same day. On September 3, the hurricane weakened to Category 2 strength. Slow weakening continued, and Lee was downgraded to a Category 1 hurricane on the morning of September 14. Lee later transitioned into an extratropical cyclone on September 16. Later that day, the center of the cyclone made landfall on Long Island, in Nova Scotia. Then, overnight into September 17, it traversed both New Brunswick and Prince Edward Island, on its way towards Newfoundland. As an extratropical low, Lee began impacting Ireland and the United Kingdom on September 20\\. === Hurricane Margot === === Hurricane Nigel === * === Tropical Storm Ophelia === * === Tropical Storm Philippe === * === Tropical Storm Rina === * === Tropical Storm Sean === * === Hurricane Tammy === * === Tropical Depression Twenty-One === * == Storm names == This list of names was used for storms which form in the North Atlantic in 2023. It is the same list used in 2017, except for Harold, Idalia, Margot, and Nigel. These names have replaced Harvey, Irma, Maria, and Nate. * Arlene * Bret * Cindy * Don * Emily * Franklin * Gert * Harold * Idalia * Jose * Katia * Lee * Margot * Nigel * Ophelia * Philippe * Rina * Sean * Tammy * * == Season effects == This is a table of all storms which have formed in the 2023 Atlantic hurricane season. All damage figures are in 2023 USD. == References == Category:Atlantic hurricane seasons Category:2023 in weather",
 "title": "2023 Atlantic hurricane season"
}