{
 "id": "1024502",
 "text": "Zhiyi (; 538–597 CE) also Chen De'an (陳德安), was an important Chinese Buddhist philosopher. Zhiyi is famous for developing a well developed philosophical system for Chinese Buddhism. He is also known for having made a big break with Indian Buddhist traditions. According to David W. Chappell, Zhiyi \"has been ranked with Thomas Aquinas and al-Ghazali as one of the great systematizers of religious thought and practice in world history.\" == References == == Works == * Dharmamitra (trans.): The Essentials of Buddhist Meditation by Shramana Zhiyi, Kalavinka Press 2008, * Donner, Neal & Daniel B. Stevenson (1993). The Great Calming and Contemplation. Honolulu: University of Hawai‘i Press. * Shen, Haiyan. The Profound Meaning of the Lotus Sutra: T'ien-t'ai Philosophy of Buddhism volumes I and II. Delhi: Originals, 2005. ISBN 8188629413 * Swanson, Paul L.; trans. (2004). The Great Cessation and Contemplation (Mo-ho Chih-kuan, Chapter 1-6), CD-ROM, Tokyo: Kosei Publishing Co. * Tam, Wai Lun (1986). A Study and Translation on the Kuan-hsin-lun of Chih-i (538-597) and its Commentary by Kuan-Ting, Hamilton, Ontario: McMaster University * Thich Tien Tam, trans. (1992). Ten Doubt about Pure Land by Dharma Master Chi-I (T. 47 No. 1961). In: Pure Land Buddhism - Dialogues with Ancient Masters, NY: Sutra Translation Committee of the United States and Canada & Buddha Dharma Education Association, pp. 19–51. == Secondary sources == * Chappell, David W. (1987). 'Is Tendai Buddhism Relevant to the Modern World?', Japanese Journal of Religious Studies 14/2-3, 247–266. * Dumoulin, Heinrich (1993). \"Early Chinese Zen Reexamined ~ A Supplement to 'Zen Buddhism: A History'\", Japanese Journal of Religious Studies 1993 20/1. * Dumoulin, Heinrich (author); Heisig, James W. (trans.) & Knitter, Paul, trans. (2005). Zen Buddhism: A History. Volume 1: India and China. World Wisdom. ISBN 978-0-941532-89-1 * Hurvitz, Leon (1962). Chih-i (538–597): An Introduction to the Life and Ideas of a Chinese Buddhist Monk. Mélanges Chinois et Bouddhiques XII, Bruxelles: Institut Belge des Hautes Études Chinoises. * Kantor, Hans-Rudolf (2002). Contemplation: Practice, Doctrine and Wisdom in the Teaching of Zhiyi (538-597), Inter-Religio 42, 21-37 * Rhodes, Robert (2012). The Development of Zhiyi´s Three Contemplations and its Relation to the Three Truths Theory. In Conference Papers: Tiantai Buddhist Thought and Practice, Taipei: Huafan University, pp. 312–357 * Stevenson, Daniel B. (1986). The Four Kinds of Samādhi in Early T'ien-t'ai Buddhism. In: Peter N. Gregory: Traditions of Meditation in Chinese Buddhism Vol. 1, Honolulu: University of Hawaii Press, pp. 45–98. ISBN 0-8248-1088-0. Category:538 births Category:590s deaths Category:Chinese philosophers Category:Buddhists Category:Pages using religious biography with multiple nickname parameters Category:Articles having same image on Wikidata and Wikipedia",
 "title": "Zhiyi"
}