{
 "id": "1024841",
 "text": "Al-Jami al-Kamil Fi al-Hadith al-Sahih al-Shamil (), known in English as The Comprehensive Collection of all Authentic Prophetic Narrations or The Authentic Hadith Encyclopaedia, is a secondary hadith collection book, compiled by the Islamic scholar Imam Ziya-ur-Rahman Azmi (1943 CE – 30 July 2020 CE). In this book, the author claims that he has compiled all authentic prophetic narrations (called sahih and hasan hadiths) from more than two hundred books. Zakir Naik highly praised the book and he stated that he is working on the publication of the English translation of the book. The final second edition contains 16,546 sahih or hasan hadiths. Zakir Naik describes his direct experience with the book. According to Islamic scholar Muhammad Ishaq Bhatti, \"this is such a work that no one has done before.\" The book has been translated into a number of languages. == Number of Hadith == Azmi states that in his estimation the entire hadith corpus equates to 40,000 hadiths (from a texts/mutun perspective) when repetition is removed. He breaks this down as 8,000 in the kutub al-sittah; 19,000 exist in the \"zawaid\" (musnad Ahmed, musnad Bazzar, musnad Abi Ya'la, and Tabrani's three); and about 10,000 in the 12 \"zawaid\". As for the sahih and hasan hadiths, he does not consider more than 2,000 exist in books other than the sihah sittah, musnad Ahmed and Malik's Muwatta. ==Publication== *Arabic: Al-Jami al-Kamil fi al-Hadith al- Sahih al-Shamil (12 Volumes). Published by Dar-us-salam Publications KSA, author Ziya-ur-Rahman Azmi *Arabic: Second (and final) edition; 2019; al-Jami al-Kamil Fi al-Hadith al-Sahih al-Shamil (19 Volumes), Dar Abi Tayyib (Pakistan); and Dar Ibn Bashir (Pakistan). *Arabic: Abridged edition of the second edition (Talkhis) Talkhis al-Jami al-Kamil Fi al-Hadith al-Sahih al- Shamil (4 Volumes), Dar Abi Tayyib (Pakistan); and Dar Ibn Bashir (Pakistan). *Urdu Translation of second edition. 2024. al-Jami al-Kamil Fi al-Hadith al- Sahih al-Shamil, Dar Abi Tayyib (Pakistan); and Dar Ibn Bashir (Pakistan). *Abubakar Muhammad Zakaria published the first volume of the Bengali translation. ==References== Category:Sunni hadith collections Category:Books by Ziaur Rahman Azmi Category:Salafi literature",
 "title": "Al-Jami Ul-Kamil"
}