{
 "id": "1024875",
 "text": "Anton \"Toni\" Pfeffer (born 17 August 1965) is a former Austrian profedsional footballer. He played for FK Austria Wien and the Austrian national football team as defender. ==Career== Pfeffer's youth club was SV Türnitz. In 1985, at the age of 20, he moved to FK Austria Wien. There he stayed till the end of his career in 2000. He played 395 league matches for the team and scored 24 goals. He also was captain of the team a long time. ==International career== Pfeffer made his debut for Austria in an April 1988 friendly match against Greece. He was a participant at the 1990 and 1998 FIFA World Cup.Record at FIFA Tournaments - FIFA He earned 63 caps, scoring one goal.Appearances for Austrian National Team - RSSSF His last international was the 0-9 demolition by Spain in a European Championship qualification match in March 1999. ==After the career== After ending his football career in 2000, Pfeffer ran unsuccessfully in local elections for the Austrian People's Party. In 2005, he joined the board of SKN St. Pölten and advises the executive committee on sporting issues. Pfeffer has also developed a folk singing career . He released two collections of Austrian folk songs. He currently works as one of Sky Austria's main football experts . ==Honours== Austria Wien * Austrian Bundesliga: 1986, 1991, 1992, 1993 * Austrian Cup: 1986, 1990, 1992, 1994 ==Other websites== * Player profile - Austria Wien archive * Manager profile - Austria Wien archive * ==References== Category:1965 births Category:Living people Category:Austrian footballers Category:Association football defenders Category:Players of the Austrian national football team Category:1990 FIFA World Cup players Category:1998 FIFA World Cup players Category:FK Austria Wien players Category:Austrian football managers Category:FK Austria Wien managers Category:Austrian football defenders Category:Austrian football champions Category:Austria at the 1990 FIFA World Cup Category:Austria at the 1998 FIFA World Cup",
 "title": "Anton Pfeffer"
}