{
 "id": "1024345",
 "text": "The 2019 New South Wales state election was held on 23 March 2019 to elect the 57th Parliament of New South Wales, including all 93 seats in the Legislative Assembly and 21 of the 42 seats in the Legislative Council. It was conducted by the New South Wales Electoral Commission (NSWEC). The incumbent Liberal/National Coalition government, led by Premier Gladys Berejiklian, won a third consecutive term in government, opposed by the Labor Party, led by Michael Daley. It was the first time since 1971 that the Coalition won a third term in government in New South Wales. Berejiklian became the third woman to lead a party to a victory at a state election in Australian history (after Queensland's Anna Bligh and Annastacia Palaszczuk; note that the territories are not states) and the first non-Labor woman to do so, as well as the first woman outside Queensland to win a state election.https://www.smh.com.au/nsw- election-2019/gladys-berejiklian-praised-as-she-becomes-nsw-s-first-elected- female- premier-20190323-p516xr.htmlhttps://www.abc.net.au/news/2019-03-24/gladys- berejiklian-rules-out-alliances-with/10934276 In the Legislative Assembly, Coalition held on to its majority, winning 48 seats, while the Labor Party won 36 and the crossbench was made up of nine seats, three each for the Greens, the Shooters, Fishers and Farmers Party and independents. In the Legislative Council, the Coalition won eight seats, Labor won seven, the Greens won two, One Nation won two and the Shooters, Fishers and Farmers Party and the Animal Justice Party won a seat each. This brings the seat totals to 17 for the Coalition, 14 for Labor, four for the Greens, two each for One Nation, the Shooters, Fishers and Farmers Party and the Animal Justice Party and one seat for the Christian Democrats.https://www.smh.com.au/politics/nsw/one-nation- wins-two-upper-house-seats-in-the-nsw-parliament-20190415-p51e7i.html ==References== Category:Elections in New South Wales Category:2019 elections",
 "title": "2019 New South Wales state election"
}