{
 "id": "102424",
 "text": "The Mesolithic from the Greek \"mesos,\" \"middle,\" and \"lithos,\" \"stone\". However, it is not right to use the term 'Middle Stone Age' here because that is used for a much earlier stage in African archaeology. was a period in the development of human technology between the Paleolithic and Neolithic periods of the Stone Age. In the Palaeolithic, people were pure hunter-gatherers. In the Neolithic they were farmers in settlements with domesticated animals and wheat, with over 100 kinds of tools and with pottery. The Mesolithic was a transitional period between the two. It happened at different times in different places. Mesolithic tools are small tools produced by chipping, and are hunter-gatherer tools, often arrowheads and points. Neolithic tools are often polished and far more varied. They are tools of more settled societies with some agriculture. The term 'Mesolithic' was introduced by Hodder Westrop in 1877, though the idea had been used earlier.Trigger, Bruce G. 1989. A history of archaeological thought. Cambridge University Press. p148 It was not much used until V. Gordon Childe popularized it in his book The dawn of Europe (1947). There is another term, 'Epipalaeolithic', which is sometimes used instead. == Distinctive features == The type of tool is the diagnostic factor. The Mesolithic featured devices made with small chipped stone tools. The Neolithic mainly abandoned this mode in favor of polished, not chipped, stone tools. The Mesolithic culture can be set apart from that of the Palaeolithic in these ways: #the tool kit is more varied than Palaeolithic tools. #the emphasis is on small, even tiny, tools rather than the larger tools used previously. These small tools are called microliths. The Mesolithic also saw greater use of wooden handles for tools. #they used the adze, a carpentry tool with a wooden handle at right angle to the blade. #the domestication of animals has begun.Dienekes' Anthropology Blog : Dog domestication in the Aurignacian (c. 32kyBP)MSNBC : World's first dog lived 31,700 years ago, ate bigScott, John Paul & Fuller, John L. 1974. Dog behavior: the genetic basis. 2nd ed, University of Chicago Press. . , . p54] Perhaps the earliest clear cultural evidence for this domestication is the first dog found buried together with human, 12,000 years ago in Palestine.James Serpell 1995. The domestic dog: its evolution, behaviour, and interactions with people. Cambridge University Press. p10-12SJM Davis and FR Valla 1978. Evidence for domestication of the dog 12,000 years ago in the Natufian of Palestine, Nature 276, 608-610. == The Fertile Crescent == The Fertile Crescent was the first part of the world to move out of the Palaeolithic. In some areas, such as the Near East, agriculture was already underway by the end of the Pleistocene, and there the Mesolithic is short. In areas with limited influence of ice age, the term \"Epipaleolithic\" is sometimes preferred. Regions that experienced greater environmental effects as the last ice age ended have a much more evident Mesolithic era. This lasted millennia. In Northern Europe, societies were able to live well on rich food supplies from the marshlands. Such conditions produced distinctive human behaviours which are preserved in characteristic finds. These conditions also delayed the coming of the Neolithic until as late as 4000 BC (6,000 before present) in northern Europe. == Mesolithic people in Europe == Genetic research has been done on the skeleton of a 7,000-year-old man from north-west Spain. It shows he had blue eyes and a dark skin.Morelle, RebeccA 2014. Hunter-gatherer European had blue eyes and dark skin. BBC News Science & Technology. The analysis showed that he had ancestral alleles in several skin pigmentation genes. This means he had dark hair and brown skin. Researchers were surprised because they thought that European populations evolved light skin quite quickly. In lower latitudes dark skin protects from UV rays in sunlight. In northern latitudes this is not such a problem, but the supply of vitamin D is a problem. Vitamin D is synthesised by the action of sunlight on skin. Therefore, it is an advantage in much of Europe to have a light skin. Earlier research was done on data using 2,196 samples from 185 diverse populations. It showed that at least three ancestral groups contributed to present-day Europeans.Lazaridis I. et al 2013. Ancient human genomes suggest three ancestral populations for present-day Europeans. bioRXiv == Burial of Thèviec – Museum of Toulouse == File:Sépulture de Teviec Global.jpg File:Sépulture de Teviec (5).jpg File:Sépulture de Teviec (2).jpg File:Téviec_Crane_Profil_Droit_II.jpg == Other websites == * Mesolithic Miscellany- Newsletter and Information on the European Mesolithic * 20th Century Mesolithic Sites in Mandla (Madhya Pradesh), India, discovered by Dr. Babul Roy: , , and * Picture Gallery of the Paleolithic (reconstructional palaeoethnology) , Libor Balák at the Czech Academy of Sciences, the Institute of Archaeology in Brno, The Center for Paleolithic and Paleoethnological Research == References == Category:Stone Age",
 "title": "Mesolithic"
}