{
 "id": "1024341",
 "text": "The 2023 New South Wales state election was held on 26 March 2023 to elect the 58th Parliament of New South Wales, including all 93 seats in the Legislative Assembly and 21 of the 42 seats in the Legislative Council. It was conducted by the New South Wales Electoral Commission (NSWEC). The incumbent minority Liberal/National Coalition government, led by Premier Dominic Perrottet, tried to win a fourth four-year term in government, but lost to the Labor Party, led by Chris Minns. This election ended 12 years of Coalition government in New South Wales, the longest period of conservative government in the state's history. It was also the second time in history that the Labor Party has controlled the federal government and all mainland state/territory governments (leaving Tasmania as the last state with a Liberal government); this was first achieved in 2007 when Labor controlled the federal government and all state and territory governments until 2008.https://www.9news.com.au/national/nsw- election-2023-mainland-australia-turn-red-as-labor-wins-nsw- election/50a42d1d-2374-479f-837d-c57bbdf28b71https://theconversation.com/australia- is-now-almost-entirely-held-by-labor-but-that-doesnt-necessarily-make-life- easier-for-leaders-202049 Although the Coalition lost, Labor did not win a majority government, falling two seats short. Three independents (Alex Greenwich, Joe McGirr and Greg Piper) agreed to give confidence and supply to the Labor Party, allowing them to form government, just like before when they gave confidence and supply to the Coalition when it went into a minority government in 2022.https://www.smh.com.au/politics/nsw/majority-government-in- the-balance-as-independents-promise-labor-supply-20230327-p5cvls.html Piper made a deal to become Speaker of the Legislative Assembly, a role he prepared for by being Deputy Speaker.https://newcastleweekly.com.au/order-order-lake- mac-mp-greg-piper-new-lower-house-speaker In the Legislative Assembly, Labor Party won 45 seats (two short of the 47 needed for a majority), the Coalition won 36 (with the Liberals winning 25 and the Nationals winning 11), the Greens won three and independents won nine. In the Legislative Council, Labor won eight seats, the Coalition won seven, the Greens and One Nation won two each and the Legalise Cannabis party, the Liberal Democrats and the Shooters, Fishers and Farmers Party all won a seat each. This brings the Legislative Council totals to 15 seats each for Labor and the Coalition, four seats for the Greens, three seats for One Nation, two seats for the Shooters, Fishers and Farmers Party and a seat each for the Legalise Cannabis party, the Liberal Democrats and the Animal Justice Party. ==Notes== ==References== Category:Elections in New South Wales Category:2023 elections Category:March 2023 events Category:2020s in New South Wales",
 "title": "2023 New South Wales state election"
}