{
 "id": "1024988",
 "text": "Jeff Hordley (born 7 March 1970) is an English actor, best known for portraying the role of Cain Dingle in the ITV soap opera Emmerdale (2000–2006, 2009–present). For his portrayal of Cain, he has been nominated for the British Soap Award for Best Actor at three ceremonies. == Personal life == In 1996, Hordley was diagnosed with Crohn's disease. He has experienced symptoms since the age of 20 and has been hospitalised three times from his condition. Hordley married Emmerdale co-star Zoë Henry in 2003; they have two children. ==Career== In addition to his work on Emmerdale, he has also made appearances in various other television series including Coronation Street, Heartbeat, Always and Everyone, City Central and Children's Ward. ==Awards and nominations== Year Award Category Result 2010 British Soap Awards Sexiest Male 2010 British Soap Awards Villain of the Year 2011 16th National Television Awards Serial Drama Performance 2011 British Soap Awards Sexiest Male 2011 British Soap Awards Villain of the Year 2011 British Soap Awards Best On- Screen Partnership (shared with Emma Atkins) 2012 17th National Television Awards Serial Drama Performance 2012 British Soap Awards Sexiest Male 2012 British Soap Awards Villain of the Year 2012 British Soap Awards Best Actor 2012 British Soap Awards Best On-Screen Partnership (shared with Atkins) 2012 British Soap Awards Best Dramatic Performance 2012 Inside Soap Awards Best Bad Boy 2013 All About Soap Awards Forbidden Lovers (shared with Natalie J. Robb) 2013 British Soap Awards Sexiest Male 2013 British Soap Awards Best Actor 2013 TV Choice Awards Best Soap Actor 2013 Inside Soap Awards Best Bad Boy 2013 Inside Soap Awards Best Actor 2014 19th National Television Awards Serial Drama Performance 2014 British Soap Awards Best Actor 2014 Inside Soap Awards Best Bad Boy 2014 Inside Soap Awards Sexiest Male 2014 Inside Soap Awards Best Actor 2015 20th National Television Awards Serial Drama Performance 2015 Inside Soap Awards Best Actor 2016 Inside Soap Awards Sexiest Male 2016 Inside Soap Awards Best Bad Boy 2018 23rd National Television Awards Serial Drama Performance 2018 British Soap Awards Best Actor 2018 Inside Soap Awards Best Actor 2019 24th National Television Awards Serial Drama Performance 2019 British Soap Awards Best Actor 2019 TV Choice Awards Best Soap Actor 2019 Inside Soap Awards Best Actor 2019 Digital Spy Reader Awards Best Soap Actor (Male) 2020 25th National Television Awards Serial Drama Performance 2020 RadioTimes.com Soap Awards Best Actor 2020 Inside Soap Awards Best Actor 2022 27th National Television Awards Serial Drama Performance 2022 Inside Soap Awards Best Actor 2022 Inside Soap Awards Best Double Act (shared with Jonny McPherson) 2023 British Soap Awards Best Leading Performer ==References== ==External links== * Category:1970 births Category:Living people Category:People with Crohn's disease Category:English television actors Category:Soap opera actors Category:People from Oldham",
 "title": "Jeff Hordley"
}