{
 "id": "102465",
 "text": "Romani or Romany (native name: ) is the language of the Roma. The Indo-Aryan Romani language should not be confused with either Romanian (spoken by Romanians), or Romansh (spoken in parts of southeastern Switzerland), both of which are Romance languages. The language developed outside from India, in Roman province Egypt, by Indian traders from different areas of India, who settled at the red sea coast in Egypt. It is based by Sanskrit and Prakrit, but strongly influenced by Ancient Greek, and Persian language, Old Church Slavonic, some words from the Coptic language, like rōmi man.Loanwords from other languages in Romani make it possible to trace the pattern of their migration westwards. There are many different dialects. == Distribution == The following table shows the distribution of Romani speakers in Europe according to Bakker et al. (2000) . The last column shows the percentage of Romani speakers in the Roma population in each country. Country Speakers % Albania 90,000 95% Austria 20,000 80% Belarus 27,000 95% Belgium 10,000 80% Bosnia and Herzegovina 40,000 90% Bulgaria 350,000 80% Croatia 28,000 80% Czech Republic 140,000 50% Denmark 1,500 90% Estonia 1,100 90% Finland 3,000 90% France 215,000 70% Germany 85,000 70% Greece 160,000 90% Hungary 260,000 50% Italy 42,000 90% Latvia 18,500 90% Lithuania 4,000 90% Macedonia 215,000 90% Moldova 56,000 90% Netherlands 3,000 90% Poland 4,000 90% Romania 433,000 80% Russia 405,000 80% Serbia and Montenegro 380,000 90% Slovakia 300,000 60% Slovenia 8,000 90% Spain 1,000 1% Sweden 9,500 90% Turkey 280,000 10% Ukraine 113,000 90% United Kingdom 1,000 0.5% == Notes and references == * Bakker Peter et al. 2000. What is the Romani language? Hatfield: University of Hertfordshire Press. * Hancock, Ian. 2001. Ame sam e rromane džene / We are the Romani People. The Open Society Institute, New York. * Lee, Ronald. 2005. Learn Romani Das-dúma Rromanes Hatfield: University of Hertfordshire Press * Masica, Colin. 1991. The Indo-Aryan Languages. Cambridge: Cambridge University Press. * Matras, Yaron. 2002. Romani: A linguistic introduction. Cambridge: Cambridge University Press. * Sarău, Gheorghe. 1997. Rromii, India şi limba rromani. Bucureşti. * Sarău, Gheorghe. 2000. Dicţionar rrom-român / Dikcionaro rromano- rumunikano. Dacia, Cluj-Napoca. . == Other websites == * Detailed discussion of the language * Outline of Romani Grammar (Victor A. Friedman) * Romani Origins - Veda encyclopedia Category:Indo-Aryan languages Category:Roma",
 "title": "Romani language"
}