{
 "id": "1025119",
 "text": "Sometimes a person's body is wrong for their gender identity. They may have male sex organs but feel that they are a female, or they may have female sex organs but identify as male. Young people with \"wrong\" bodies are often called transgender youth. Medical operations by doctors and hormone pills can change the body, but those operations are not done on young people. Instead, doctors can give drugs that slow down or stop puberty so the person has more time to decide what to do. Also, it should lower the number of transgender young people who kill themselves. That sometimes happens because they are bullied by other people, or because they feel very unhappy having their body become an adult body that they do not want because they feel it is the wrong body. As of 2023, some states in the United States say doctors cannot give these drugs to young people. The talk about these drugs has become very political. These drugs were usually made for other reasons, such as stopping cancer. These drugs can also be used if a child starts puberty at a very early age, such as 7 or 8. The name for that situation is \"precocious puberty.\" Going through puberty too early creates medical and psychological problems. The person might not grow as tall as they could. They might feel very different from their friends and other children in school. Girls who go through puberty early have a bigger chance of being sexually assaulted. They also have a bigger chance of becoming pregnant while still a young teenager. There is a bigger chance that later in life they might get a cancer such as breast cancer, because there is a higher risk associated with the number of years the woman had between puberty (usually defined as menarche for studies) and the first time she has a baby. One of the drugs that can be given to people with boy bodies is called Lupron Depot. It works by causing a very big drop in testosterone levels. The drugs to block or slow puberty can be given with a needle in the leg, or sometimes the shoulder. In a young person with a boy body, for some drugs, the needle is put in a testicle. Sometimes the drugs are in a patch that is under the skin of an upper arm. The patch is usually changed once a year. There is a chance that unwanted things could happen because of these drugs. These things are called side effects. There are some short term side effects, most of which are not huge problems for most people getting the drugs. The more important thing is that these drugs might have long-term effects on: * Growth spurts (times when the body grows very quickly) * Bone growth. * Bone density. * Fertility, depending on when the medicine is started. With drugs involving body chemicals called hormones that regulate things like growth, there might be a slight chance of increasing cancer risk, even though these drugs are often used as anticancer drugs. The use of puberty blockers in transgender youth is supported by 12 major American medical associations, including the American Medical Association, the American Psychological Association, the American Academy of Pediatrics, and the Endocrine Society the American Academy of Child and Adolescent Psychiatry, the American Psychiatric Association, the Pediatric Endocrine Society, the American College of Obstetricians and Gynecologists, the American College of Physicians, the American Academy of Family Physicians, the American Osteopathic Association, the American Association of Clinical Endocrinologists, the American Nurses Association, four Australian medical associations, and the World Professional Association for Transgender Health. == Politicization == The talk about these drugs has become very political. People who do not want puberty blockers used for young people think it is better to let the young person's body go through puberty, even though that will permanently change their body. Some of them have religious reasons. They may believe that people should not interfere with how a human body was made because they believe it was made by God. These people also say the child might just be imagining the problem or might change how they feel about their gender identity when they are older. People who oppose transgender rights are often called transphobic. Some people might really question whether the treatment works, while others might simply hate or be afraid of transgender people. People who do not want puberty blockers used for transgender youth are often classified as social conservatives. ==References== Category:Drugs Category:Gender",
 "title": "Puberty blockers"
}