{
 "id": "1025079",
 "text": "The Samaritan High Priest is the head of the Samaritan religion. They were originally the same person as the Jewish High Priest until a disagreement in succession led to the two splitting apart == Pummer's list == The following list gives the names and terms of office according to Reinhard Pummer.Reinhard Pummer: An Update of Moses Gaster’s \"Chain of Samaritan High Priests\", Berlin / Boston 2018, S. 154–172. Pummer uses a spelling for the name of the high priest that is based on the English Bible for the bearers of biblical names, while he chooses a more scientific transcription for the full name (last column). The traditional counting begins with the first post-biblical high priest Sheshai. It differs in order in some cases from the list prepared by Moses Gaster and Reinhard Pummer on the basis of the ancient Samaritan sources, and includes additional names (italics here). Traditional Numbering High Priest Name Term Comments Civil name and life data Aaron I. (אהרן) Biblical figure, brother of Moses. He is considered in the Torah to be the \"ancestor of the legitimate Levitical-Aaronid priesthood.\"Joachim Schaper: Aaron. In: Religion in Geschichte und Gegenwart (RGG). 4. Auflage. Band 1, Mohr-Siebeck, Tübingen 1998, Sp. 2–3., vgl. Exodus Kap. 28–29; Levitikus Kap. 8–10; Numeri Kap. 3–4; 8 und 16–18. Eleazar I. (אלעזר) Biblical figure, son of Aaron and his successor as high priest. Phinehas I. (פינחס) Biblical figure, son of Eleazar. Because of his religious \"zeal\" he and his descendants are awarded a perpetual priesthood. Abishua I. (אבישע) According to Samaritan tradition, Aaron's great-grandsonIn der Tora nicht erwähnt, aber in und (Schriften des jüdischen Kanons) als Sohn des Phinehas aufgeführt. is said to have written down a Pentateuch scroll that is first mentioned by Abū l'Fatḥ in the 14th century and, in a very poor state of preservation, is kept by the Samaritan community as a precious possession. The Abisha Scroll is considered the original of all Samaritan Torah scrolls.Alan D. Crown: The Abisha Scroll – 3000 Years Old? In: Bible Review 7, 5 (1991), online: Center for Online Judaic Studies. 1 Sashai ben Abishua 2 Bakhi ben Sashai probably identical to the Jewish High Priest Bukki 3 Uzzi ben Sashai According to Samaritan tradition, Uzzi hid the tent sanctuary of the desert migration (Mishkan) in a cave at Garizim when the Israelites introduced the cult at Shiloh, which was illegitimate from the Samaritan point of view.Moses Gaster: The Chain of Samaritan High Priests: A Synchronistic Synopsis, 1909, p. 417. 4 Shashai II ben Uzzi 5 Bakhi II ben Sashai 6 Shembet ben Bakhi who served at the shrine to God at Shechem alone 7 Shalom I ben Shembet 8 Hezekiah I ben Shalom 9 Jonathan I ben Abiathar (ben Hezekiah?) According to Samaritan tradition, he is said to have been a contemporary of King David.Moses Gaster: The Chain of Samaritan High Priests: A Synchronistic Synopsis, 1909, S. 412. (2 Samuel 15:27), served as a messenger during Absalom's rebellion (2 Samuel 15:36, 17:17) 10 Jair I ben Jonathan 11 Daliah I 12 Jair II ben Daliah In his time the Jerusalem temple is said to have been built. 13 Jonathan II ben Jair 14 Ishmael ben Jonathan 15 Tabia I This high priest is said to have been murdered by the Ishmaelites.Moses Gaster: The Chain of Samaritan High Priests: A Synchronistic Synopsis, 1909, S. 413. 16 Zedekiah I 17 Ahid 18 Jair III 19 Jehozadak 20 Zadok (צדוק) 21 Amram I. (עמרם) 22 Hilkiah or Hezekiah II 23 Amram II. (עמרם) 24 Akkub 25 Akkubiah I According to the Samaritan chronicler Abū l'Fatḥ (14th century), Aqabiah was a contemporary of Nebuchadnezzar II and thus of the conquest of Jerusalem by the Babylonians (587 B.C.).Reinhard Pummer: An Update of Moses Gaster’s \"Chain of Samaritan High Priests\", Berlin / Boston 2018, S. 159 Anm. 34. He is said to have been led into Babylonian exile with the Israelites. 26 Hillel I 27 Seriah He is said to have returned with his people from exile. 28 Levi I. (לוי) 29 Netaniel I 30 Azariah In the 10th year of his high priesthood he is said to have been captured by the Chaldeans. 31 Aabed-El I This high priest returned from exile; in his time the Samaritan community is said to have had 300,000 members. 32 Hezekiah III 33 Hananiah 34 Amram III. (עמרם) His son is said to have married the daughter of King \"Derus\"; according to tradition, the Samaritans made a riot and killed both of them. 35 Hillel II/Hanan This high priest is said to have married the daughter of the king of Assyria and to have been killed by the Samaritans.Moses Gaster: The Chain of Samaritan High Priests: A Synchronistic Synopsis, 1909, S. 414. 36 Hezekiah IV According to the Samaritan historian Abū l'Fatḥ, Hezekiah was high priest when Alexander III of Macedonia defeated the Persian king Darius.Reinhard Pummer: An Update of Moses Gaster’s \"Chain of Samaritan High Priests\", Berlin / Boston 2018, S. 161 Anm. 35. 37 Daliah II 38 Akkub II 39 Akkubiah II 40 Levi II. (לוי) 41 Eleazar II 42 Manasseh the son-in-law of Sanballat the Horonite 43 Jair IV 44 Netaniel II 45 Joachim According to Samaritan tradition, Jesus of Nazareth was born during the tenure of Jehoiakim.Reinhard Pummer: An Update of Moses Gaster’s \"Chain of Samaritan High Priests\", Berlin / Boston 2018, S. 162 Anm. 36. 46 Jonathan III In his time Jesus is said to have been killed \"in the cursed Shalem\" (= Jerusalem). 47 Elishama 48 Shemaiah 49 Tabia II 50 Amram IV. (עמרם) 51 Akabon I 52 Phinehas II 53 Levi III. (לוי) early 2nd century Emperor Hadrian (r. 117–138 CE) is said to have shown special favors to the Samaritans in the time of the high priest Levi III.Moses Gaster: The Chain of Samaritan High Priests: A Synchronistic Synopsis, 1909, S. 414f. 54 Eleazar III 55 Baba I. (בבא) 56 Eleazar IV 57 Akabon II 58 Netaniel III 59 Baba II Rabba c. 308– 328 The Samaritan reformer Baba Rabba was a historical figure (early 4th century CE). He organized synagogue construction, worship and community structure. 60 Akabon III 61 Netaniel IV This high priest is said to have burned his maid at the stake because she fell in love with his son.Moses Gaster: The Chain of Samaritan High Priests: A Synchronistic Synopsis, 1909, S. 415. 62 Akabon IV 63 Eleazar V 64 Akabon V 65 Eleazar VI 66 Akabon VI late 6th century 67 Eleazar VII 68 Netaniel V early 7th century He is said to have been a contemporary of the \"cursed king Zinon.\" 69 Eleazar VIII c. 630 In the tenure of this high priest, Abū l'Fatḥ dated the appearance of the Prophet Muhammad.Reinhard Pummer: An Update of Moses Gaster’s \"Chain of Samaritan High Priests\", Berlin / Boston 2018, S. 165 Anm. 40. 70 Netaniel VI 71 Eleazar IX 72 Akabon VII This high priest was drowned in the Jordan River according to tradition.Moses Gaster: The Chain of Samaritan High Priests: A Synchronistic Synopsis, 1909, S. 416. 73 Eleazar X 74 Akabon VIII 75 Eleazar XI 76 Akabon IX 77 Eleazar XII 78 Simeon (שמעון) In his time, \"Karozai the King of Assur\" (perhaps the Sassanid ruler Khosrow I or II) is said to have enlisted many Samaritans as soldiers. The Byzantine emperor Heraclius conquered the Holy Land. Then the Ishmaelites came and conquered all the cities, and the inhabitants of Caesarea Maritima were led into captivity. 79 Levi IV. (לוי) 80 Phinehas III 81 Netaniel VII. (נתנאל) 82 Baba III. (בבא) 83 Eleazar XIII 84 Netaniel VIII 85 Eleazar XIV 86 Phinehas IV 87 Netaniel IX 88 Aabed-El II 89 Eleazar XV 90 Aabed-El III 91 Eleazar XVI 92 Aabed-El IV Here there are discrepancies Eleazar, his son Abdeel and his brother Aaron are said to have officiated together as high priests for 69 years, but not in Shechem, but in Damascus.Moses Gaster: The Chain of Samaritan High Priests: A Synchronistic Synopsis, 1909, S. 417. 93 Aaron II. (אהרן) 95 Tsedaka I 96 Amram V. (עמרם) 97 Aaron III. (אהרן) In his time the Samaritan synagogue of Shechem was built. 98 Amram VI. (עמרם) 99 Uzzi II In his time, the Muslims took away from the Samaritans their synagogue and the \"piece of land\" in Shechem.Moses Gaster: The Chain of Samaritan High Priests: A Synchronistic Synopsis, 1909, S. 418. 100 Joseph I. (יוסף) This high priest also came from Damascus.Moses Gaster: The Chain of Samaritan High Priests: A Synchronistic Synopsis, 1909, S. 419. 101 Phinehas V His son Raban Abishah composed liturgical chants. Pinḥas ben Josef, der Sohn des Vorigen. 102 Eleazar XVII. (אלעזר) 1362/63–1387 Eleazar ben Pinḥas ben Josef 103 Phinehas VI haNatzri (פינחס) This high priest was the son of the hymn writer Raban Abishah. Pinḥas ben Abisha ben Pinḥas ben Josef 104 Abishua II. (אבישע) Abisha ben Pinḥas ben Abisha; Sohn des Vorigen. 105 Eleazar XVIII. (אלעזר) Eleazar ben Abisha ben Pinḥas 106 Itamar (איתמר) The high priest Itamar ben Aaron ben Itamar in Damascus was one of the scribes of a Pentateuch codex (Ms. London, British Library, Cotton Claudius B. viii).British Library, Digitized Manuscripts: Cotton MS Claudius B VIII . 107 Amram VII. (עמרם) In his time Samaria was conquered and many Samaritans were captured and taken to Damascus, but the Samaritan community in Damascus bought them free. 108 Uzzi III 109 Phinehas VII. (פינחס) In 1516, Ottoman rule began in Palestine. The total number of Samaritans at that time is given as 500 people who lived in Cairo, Gaza and Damascus in addition to Nablus. The census of 1538/39 mentions 29 Samaritan households in Nablus, from which a number of 178 persons can be estimated.Reinhard Pummer: The Samaritans. A Profile. Eerdmans, Grand Rapids 2016, S. 155f. Pinḥas ben Eleazar 110 Eleazar XIX. (אלעזר) 1549–1595/96 In his time a ritual bath was built for the Samaritans in Shechem. Eleazar ben Pinḥas 111 Phinehas VIII. (פינחס) 1595/96–1614/15 Pinḥas ben Eleazar 112 Shalma I ben Phinehas 1614/15–1623/24 With Shelemya, who was murdered,Monika Schreiber: The Comfort of Kin: Samaritan Community, Kinship, and Marriage. Brill, Leiden / Boston 2014, S. 91. ended the original high priestly dynasty, which traced itself back to Phinehas, the grandson of Aaron. Centuries later, the Samaritan community was still researching whether there might have been members of the Phinehas dynasty living in Europe. Shelemia ben Pinḥas 113 Tsedaka II ben Tabia ha'Åbtå'i 1623/24–1650 Ṣadaqa II was the first high priest from the family that has been in office since then, tracing back to Itamar, the brother of Phinehas. This family was considered Levitical until then; since it was the only surviving Levitical family, Levitical and Aaronid descent has been synonymous among the Samaritans since then. Ṣadaqa ben Ṭabia Halevi 114 Yitzhaq I ben Tsedaka 1650–1694 Jiṣḥaq ben Ṣadaqa 115 Abram ben Yitzhaq 1694–1732 Abraham ben Jiṣḥaq ben Ṣadaqa 116 Levi V ben Abram 1733–1752 Levi ben Abraham 117 Tabia III ben Yitzhaq ben Abram 1752–1787 This high priest settled in the Samaritan community in Gaza.Moses Gaster: The Chain of Samaritan High Priests: A Synchronistic Synopsis, 1909, S. 420. Ṭabia ben Jiṣḥaq 118 Shalma II ben Tabia 1798–1828 Salama was four years old at his father's death and the only surviving member of the high priestly family. He assumed the office of high priest at the age of 15.Reinhard Pummer: An Update of Moses Gaster’s \"Chain of Samaritan High Priests\", Berlin / Boston 2018, S. 170 Anm. 55. In 1810 he sent a letter to the French senator Henri Grégoire, in which he lamented the distressed situation of the Samaritans. Since 1785 it was no longer possible to offer the Passover sacrifice on the Garizim; it had to take place in the city.Reinhard Pummer: The Samaritans. A Profile. Eerdmans, Grand Rapids 2016, S. 161. Salama ben Ṭabia ben Jiṣḥaq (1784–1855) 119 Amram VIII ben Shalma 1828–1859/60 In 1832 the pilgrimages to Mount Garizim could be resumed. In the 1840s, Muslim ulama demanded that all Samaritans be forcibly converted to Islam because they did not belong to any book religion. The Sephardic chief rabbi of Jerusalem produced an expert opinion that the Samaritans belonged to the people of Israel and lived according to the Torah. This (together with a gift of money) averted the danger from the Samaritan community.Reinhard Pummer: The Samaritans. A Profile. Eerdmans, Grand Rapids 2016, S. 162.Monika Schreiber: The Comfort of Kin: Samaritan Community, Kinship, and Marriage. S. 50. Upon British intervention, the Passover sacrifice on Mount Garizim was again permitted by the Ottoman authorities in 1849.Monika Schreiber: The Comfort of Kin: Samaritan Community, Kinship, and Marriage. S. 51. 120 Yaacob I ben Aaharon ben Shalma 1859/60–1916 Jacob I promoted the opening to the West and to the Jewish community, seeing opportunities for the small Samaritan community in the interest of the world public.Steven Fine: Abgrenzung – und Annäherung. Die Geschichte von Juden und Samaritanern. In: Welt und Umwelt der Bibel 26/2 (2021), S. 48–54, hier S. 50. Jaaqob ben Aharon ben Salama (1840/41–1916) 121 Yitzhaq II ben Amram ben Shalma ben Tabia. (יצחק) 1917/18–1932 Jiṣḥaq ben Amram ben Salama (1855–1932) 122 Matzliach ben Phinehas ben Yitzhaq ben Shalma (מצליח) 1933–1943 Maṣliaḥ ben Pinḥas ben Jiṣḥaq ben Salama (1868–1943) 123 Abisha III ben Phinehas ben Yitzhaq ben Shalma. (אבישע) 1943–1960 Brother of Matzliach Abisha ben Pinḥas ben Jiṣḥaq ben Salama (1880–1960) 124 Amram IX ben Yitzhaq ben Amram ben Shalma. (עמרם) 1960–1980 Amram ben Jiṣḥaq ben Amram ben Salama (1889–1980) 125 Asher ben Matzliach ben Phinehas (אשר) 1980–1982 Asher ben Maṣliaḥ ben Pinḥas (1895–1982) 126 Phinehas X ben Matzliach ben Phinehas. (פינחס) 1982–1984 Brother of Asher Pinḥas ben Maṣliaḥ (1899–1984) 127 Yaacob II ben Uzzi ben Yaacob ben Aaharon - Abu Shafi (יעקב) 1984–1987 A highly respected High Priest, grandson of Yaacob I ben Aaharon ben Shalma. Jaaqob ben Azi ben Jaaqob (1900–1987) 128 Yoseph II ben Ab-Hisda ben Yaacov ben Aaharon. (יוסף) 1987–1998 Josef ben Ab Ḥisda ben Jaaqob (1919–1998) 129 Levi VI ben Abisha ben Phinehas ben Yitzhaq. (לוי) 1998–2001 Levi ben Abisha (1920–2001) 130 Shalom II ben Amram ben Yitzhaq/Salum Is'haq al-Samiri (שלום) 2001–2004 Shalom ben Amram (13. Januar 1922–9. Februar 2004)The Samaritan Update zum Tode von Shalom ben Amram (englisch) 131 Elazar XX ben Tsedaka ben Yitzhaq. (אלעזר) 2004–2010 Eleazar ben Ṣedaqah ben Jiṣḥaq (16. Januar 1927–3. Februar 2010)The Samaritan Update zum Tode von Eleazar ben Ṣedaqah (englisch) 132 Aharon IV ben Ab-Chisda ben Yaacob (אהרן) 2010–2013 Brother of High Priest Josef II.Moses Gaster: The Chain of Samaritan High Priests: A Synchronistic Synopsis, 1909, p. 413 Aharon ben Ab-Ḥisdah ben Jaaqob ben Aharon (1. Februar 1927–19. April 2013)The Samaritan Update zum Tode von Aharon ben Ab-Ḥisdah. 133 Aabed-El V ben Asher ben Matzliach (עבדאל) 2013– Abdel ben Asher ben Maṣliaḥ (* 1935) ==References== Category:Samaritan high priests",
 "title": "Samaritan High Priest"
}