{
 "id": "1025423",
 "text": "The Mercedes-Benz A-Class is a small luxury subcompact car made by the luxury car brand Mercedes-Benz. == First generation (1996 to 2004) == From 1996 to 2004, Mercedes made a hatchback car named A-Class, It was launched at the Frankfurt Motor Show in Germany. In early 2001, the A-Class was updated, It had new front and back bumpers and new front and back headlights. === Gallery === File:Mercedes A 160 Elegance (W168) front 20090926.jpg|(before change) Mercedes A 160 Elegance (W168) rear 20090926.jpg|Back (before change) 2003 Mercedes-Benz A160 Avantgarde 1.6 LWB (Front).jpg|Front (after change) 2003 Mercedes-Benz A160 Avantgarde 1.6 LWB (Rear).jpg|Back (after change) == Second generation (2004 to 2012) == From 2004 to 2012, Mercedes made a hatchback car named A-Class. In 2008, the A-Class was updated, It had new front and back bumpers, new front and back headlights and longer doors === Gallery === File:Mercedes-Benz A 180 CDI Elegance (W 169) – Frontansicht (1), 30. März 2011, Wülfrath.jpg|4-door (before change) Mercedes-Benz C169 A150 Heck.JPG|3-door rear (before change) Mercedes A 150 Elegance (W169) rear 20100405.jpg|5-door rear (before change) Mercedes-Benz A 160 BlueEFFICIENCY Serienausstattung (W 169, Facelift) – Frontansicht, 13. November 2011, Heiligenhaus.jpg|5-door (after change) White 2012 Mercedes-Benz 169 (Mercedes A-Klasse A 160 (169), 70kw, ABE).JPG|5-door rear (after change) Mercedes A 150 BlueEFFICIENCY Coupé Classic (C169) Facelift rear 20101016.jpg|3-door rear (after change) == Third generation (2012 to 2018) == From 2012 to May 2018, Mercedes made a hatchback car named A-Class. It was launched at the Geneva Motor Show in 2012. In 2015, the A-Class was updated, It had new front and back bumpers and new front and back headlights. ===Gallery=== Mercedes-Benz A 180 BlueEFFICIENCY Urban (W 176) – Frontansicht, 3. März 2013, Düsseldorf.jpg|Front (before change) Mercedes-Benz A 180 BlueEFFICIENCY Urban (W 176) – Heckansicht, 3. März 2013, Düsseldorf.jpg|Back (before change) 2017 Mercedes-Benz A 200 (W 176) hatchback (2018-10-29) 01.jpg|Front (after change) 2017 Mercedes-Benz A 200 (W 176) hatchback (2018-10-29) 02.jpg|Rear(after change) == Fourth generation (2018–present) == From April 2018 to the present day, Mercedes made a hatchback and sedan car named A-Class. It was launched at the Geneva Motor Show in 2018. === Gallery === 2018 Mercedes-Benz A200 AMG Line Premium+ 1.3 Front.jpg|Front (before change) 2018 Mercedes-Benz A200 AMG Line Premium+ 1.3 Rear.jpg|Back (before change) Mercedes-Benz A 180 Progressive (W 177) – f 16032019.jpg|front (This model is a Progressive/SE trim. It is the lower-level trim, and looks a bit less cooler than the other model. It is a cheaper version of the W177.) Mercedes-Benz A 180 Progressive (W 177) – h 16032019.jpg|rear (This model is a Progressive/SE trim. It is the lower-level trim, and looks a bit less cooler than the other model. It is a cheaper version of the W177.) File:Mercedes-Benz V177 IMG 4845.jpg|Front (sedan, before change) File:Mercedes-Benz V177 IMG 2037.jpg|Rear (sedan, before change) == References == ==Other websites== * Category:1990s automobiles Category:2000s automobiles Category:2010s automobiles Category:2020s automobiles A-Class Category:Hatchbacks",
 "title": "Mercedes-Benz A-Class"
}