{
 "id": "1025262",
 "text": "Connected Fashion is a philosophy and business model that uses technology to recreate brand images and reinvent consumer experiences, as well as between the virtual and physical world. The goal of connected fashion is to create products, by making a digital twin of the physical object. This is very similar to digital fashion and includes many features of this trend. == Concept == The growth of blockchain technology and NFTs (Non-Fungible Tokens) has played a big part in creating connected fashion. The internet made shopping very easy, and social media apps led to a big increase in the number of influencers. But, the way customers and brands interacted was still mostly one-sided. Customers didn't have a real way to be a part of their favorite brands. NFT technology lets people create and own unique tokens. In this case, the tokens can represent items that people have bought. They can be used in many ways, like getting into exclusive groups, voting and making decisions, and even keeping track of an item's history. Plus, since NFTs can prove ownership, they can be used to confirm the authenticity of a high-end item. This gives the owner a digital proof that they own the real item. As technology has gotten better and more things are done online, the idea of having an online identity or an online brand has become more important. Connected fashion also lets customers prove that they own certain items online and include these items in their online identity and virtual worlds. == Uses == === Tracking origin and sustainability === Connected fashion can share more details about where an item comes from and how it was made. The item could have a QR code or something similar that contains information about it. This is very important for ethical or slow fashion. === Proving ownership === High- end fashion often has problems with fakes and copies. Connected fashion can be used as proof of ownership and to show that an item is real and not fake. This is really helpful for influencers and fashion bloggers who want to prove that they own real items. It's also useful for markets where people buy used items and want to know if they are real. === Virtual world and online realities === Connected fashion helps solve the problem of people feeling a disconnect between their real-world fashion and branding and their online identity. === Special experiences === Connected fashion can also give owners access to special experiences. The NFT of the item can work like a passport, giving the owner access to exclusive events. === Voting and making decisions === Brands and members of the community can put proposals up for a vote. This doesn't just give customers a voice, but it also lets brands get immediate and provable feedback from their community. == History == Gucci was the first luxury clothing brand to launch an NFT series with the NFT Aria collection which launched at Christie's in June 2022 for $25,000 to commemorate its 100th anniversary. Proceeds from the sale were donated to UNICEF USA. Also in 2022, Nike launched a digital collection of sports shoes called Cryptokicks. Balmain used NFTs during the Paris Fashion Week F/W 2022 for gated membership experiences, giving holders access to exclusive events and perks. Connected fashion began to develop in 2023, with the blockchain company ChromaWay pioneering the term and acquiring clothing brand BLK DNM. In March 2023, Balmain has released a limited edition NFT sneaker based on its Unicorn shoe line, each with a pair of matching limited edition sneakers from the real world. ==References== Category:Sociology",
 "title": "Connected fashion"
}