{
 "id": "1025290",
 "text": "Super Mario Bros. Wonder is a platform game for the Nintendo Switch that released on October 20, 2023. It was published by Nintendo and is the first original side-scrolling Super Mario game since New Super Mario Bros. U, which released in 2012. The main mechanic is the Wonder Flower, which transforms the level or the player character. There are 12 playable characters. ==Plot== Mario, Luigi, Princess Peach, Princess Daisy, Blue Toad, Yellow Toad, and four Yoshis are invited to the Flower Kingdom by Prince Florian to see a demonstration of the Wonder Flower. Just then, Bowser attacks and uses the Wonder Flower to combine himself with Prince Florian's castle. Mario decides to help Prince Florian, and his friends do the same. The prince rides in Mario's cap, and the group sets off to stop Castle Bowser. Meanwhile, Castle Bowser wreaks havoc on the kingdom by imprisoning the Poplins (the people who live in the Flower Kingdom) in fortresses. They go to six different worlds (sections of the Flower Kingdom) to find Royal Seeds, which weaken Castle Bowser. After collecting all six, Mario and co. enter Castle Bowser to face him. After Bowser's defeat, he and the Flower Kingdom go back to normal. ==Gameplay== Super Mario Bros. Wonder is similar to previous Super Mario games; the player goes from left to right and must reach the goal pole at the end while collecting coins, hitting blocks, and defeating enemies. This time, the Wonder Flower appears once in every level, often being hidden. When a Wonder Flower is collected, its effect is different for every level. Wonder effects include blocks coming alive, enemies singing, the player character transforming, gravity changing, among many others. After reaching the goal pole, players are rewarded with Wonder Seeds. These can be used to unlock required levels. The game also includes a new multiplayer mode where the player can see other people as ghosts playing in real time. They can exchange power-ups, place standees, and rescue each other from dying. ==Reception== Super Mario Bros. Wonder is one of the most liked Mario games of all time. Nintendo Life said in their review of the game that it was best one since Super Mario World (1991). ==Notes== ==References== Category:2023 video games Category:Mario platform games Category:Cooperative video games Category:Multiplayer and single-player video games Category:Nintendo Entertainment Planning & Development games Category:Nintendo Switch games Category:Nintendo Switch-only games Category:Side-scrolling platform games Category:Video games about shapeshifting Category:Video games developed in Japan",
 "title": "Super Mario Bros. Wonder"
}