{
 "id": "1025187",
 "text": "Abdul Haq Vidyarthi (1888–1977) known as Maulana Abdul Haq Vidyarthi () is a Pakistani scholar, author, writer, Islamic preacher and a prominent figure of Lahore Ahmadiyya movement, joined in 1907. In 1914, Maulana Muhammad Ali and his associates founded the Ahmadiyya Anjuman Isha‘at Islam missionary society in Lahore and Maulana Abdul Haq joined. He spent the rest of his life there as missionary, journalist, lecturer, writer and scholar. He studied Sanskrit and other languages and Hindu scriptures, to discover what he believed to be prophecies about Muhammad and to refute negative criticism of Islam. He earned the title vidyarthi due to his extensive knowledge of the Vedas. From 1918 to the 1940s, he participated in public debates against Arya Samaj Hindus and Christian missionaries. He published an Urdu translation of part of a Hindu scripture, the Yajur Veda. == Works == ===Muhammad in world scriptures=== Muhammad in World Scriptures is a book by Abdul Haq Vidyarthi. It was first published in 1936. When written it was called Mithaq-al-Nabiyeen (میثاق النبیین, Promise of the prophets). It was written in Urdu in 1936. The book was translated to English in 1942 and called Muhammad in World scriptures. After publication of the translation, the book became very popular across the world. The book claims the mention of Muhammad in scriptures of the world's major religions including Abrahamic religions and Indian religions. The english translation has 3 editions with 3 volumes. The book has been translated in many languages including turkish, Indonesian, french etc. The book has been quoted extensively by many inter-faith scholars including Ahmed Deedat, Zakir Naik, Ved Prakash Upadhyay (Kalki Avatar and Muhammad), Abbas Mahmoud al-Aqqad, Muḥammad Jawād Mughnīyya etc. ====Editions==== * Mithaq-un- nabiyyin (Urdu), 1936 * Muhammad in World Scriptures English translation of Urdu Mithaq-un-nabiyyin, 1940 * Mohammad in World Scriptures, Buddha foretells the advent of [the] prophet of Islam, Evergreen Press, 1955 * Muhammad in Parsi, Hindoo and Buddhist scriptures, Islamic Book Service, 1983 * Mohammad in World Scriptures, Adam Publishers & Distributors, 2nd edition, 1994 ==References== ==Other websites== * Maulana Abdul Haq Vidyarthi biography * Maulana Abdul Haq Vidyarthi Sahib photo Category:1888 births Category:1977 deaths",
 "title": "Abdul Haq Vidyarthi"
}