{
 "id": "1025397",
 "text": "Sárospatak (; or ) is a town in Borsod-Abaúj-Zemplén County in northern Hungary. == Location == It is about 70 kilometers northeast of Miskolc, by the Bodrog. Most of the town is on the right side of the river, but there are also important areas on the left side, along with some separate neighborhoods. Its area is next to many nearby villages. It is next to Nagyhuta, Kovácsvágás, Mikóháza, and Alsóregmec to the north, Sátoraljaújhely to the northeast, Vajdácska to the east, Bodroghalom and Tiszakarád to the southeast, Györgytarló and Kenézlő to the south, Sárazsadány to the southwest, Bodrogolaszi and Komlóska to the west, and Makkoshotyka and Hercegkút to the northwest. === Connection === The main road 37 is the most important route, linking the county seat Miskolc and the western parts of the country, as well as Sátoraljaújhely. Smaller nearby places are connected: Kenézlő by road 3803, Györgytarló by road 3811, Vajdácska by road 3805, and Cigánd by road 3814. It connects directly to Makkoshotyka and Hercegkút: the former from main road 37 at the 3814 junction, and the latter from road 37 133 offshoot in the Hercegkút area. By train, the city can be reached via the Budapest–Sátoraljaújhely railway line, which has a stop here. == History == People lived in the area of Sárospatak long ago. In 1201, King Emeric granted it city rights. In the Middle Ages, it was a key trading center, especially for Poland. King Andrew I built the city's castle. Some say Elizabeth of Hungary was born here. Today, Sárospatak is a well-known school town and a popular place for tourists because of its beautiful history. == Politics == * 1990–1994: Dr. Gábor Jánosdeák (unknown) * 1994–1998: Dr. Gábor Jánosdeák (independent) * 1998–2002: Dr. Gábor Jánosdeák (independent) * 2002–2006: Dr. Gábor Jánosdeák (independent) * 2006–2010: Dr. Richárd Hörcsik (Fidesz-KDNP- NF) * 2010–2014: János Aros (Fidesz-KDNP) * 2014–2019: János Aros (Fidesz- KDNP) * 2019–2024: János Aros (Fidesz-KDNP) * 2024– : Dr. Szabolcs Farkas (independent) == Population == In 2022, 90.3% of the population identified as Hungarian, 1.9% as Roma, 1.6% as German, 0.4% as Rusyn, 0.2% as Ukrainian, 0.2% as Slovak, 0.1% as Polish, 0.1% as Romanian, and 2.6% as other non-native nationalities (9.5% did not respond; due to dual identities, the total may exceed 100%). According to their religion, 26.5% were Roman Catholic, 22.9% were Reformed, 11% were Greek Catholic, 1% were other Christian, 0.2% were Lutheran, 0.1% were Orthodox, and 4.7% were non-denominational (33.1% did not respond). == Sights == * Sárospatak Castle - The most valuable work of late Renaissance architecture in Hungary and the most significant monument of Sárospatak * St. Elisabeth Basilica \\- One of the largest churches in Northern Hungary. In 2007, Pope Benedict XVI elevated it to the rank of basilica. * Trinitarian Monastery - The monastery is located in the castle district. * Thermal Bath and Camping \\- Thermal water was discovered in the city in 1959. * Tokaj-Hegyalja University * Sárospatak Reformed College - This school is one of the oldest educational institutions in the country, founded in 1531, in the spirit of the Reformation. == Twin towns == Sárospatak is twinned with: * Bardejov, Slovakia * Collegno, Italy * Eisenach, Germany * Izvoru Crișului, Romania * Krosno, Poland * Nokia, Finland * Soest, Germany * Tekirdağ, Turkey * Næstved, Denmark * Trešnjevac, Serbia * Oberschützen, Austria * Ogulin, Croatia * Jindřichův Hradec, Czech Republic == Notes == Category:Towns in Hungary Category:Settlements in Borsod-Abaúj-Zemplén County",
 "title": "Sárospatak"
}