{
 "id": "1025073",
 "text": "Kevin de León (born December 10, 1966) is an American politician and environmental advocate. He served as the President pro tempore of the California State Senate from 2014 to 2018. De León is a member of the Democratic Party. Born and raised in Los Angeles, California, de León began his political career as a community organizer before being elected to the California State Assembly in 2006, representing the 45th district. He later served as the State Senator for the 22nd district from 2010 to 2018. De León has been a vocal advocate for immigrant rights and has pushed for policies to address Climate change and environmental issues. He has championed legislation to expand healthcare access, increase renewable energy usage, and enhance protections for undocumented immigrants. In 2018, de León ran for the United States Senate against incumbent Dianne Feinstein, but was unsuccessful in his bid. Despite the loss, he gained recognition for his progressive platform and was credited with shifting the conversation within the Democratic Party in California. Outside of politics, de León has been involved in various environmental organizations and initiatives. He has been a strong proponent of clean energy and has worked to reduce greenhouse gas emissions. De León continues to be an influential figure in California politics, advocating for progressive policies and fighting for social and environmental justice. == Early life and education == Kevin de León was born on December 10, 1966, in Los Angeles, California. He grew up in the San Diego, California barrio of Logan Heights, a predominantly Mexican American neighborhood. De León's parents emigrated from Guanajuato, Mexico, and his mother worked as a housekeeper while his father was a factory worker. As a child, de León experienced the challenges faced by many working-class families. He witnessed the struggles of his mother, who raised him as a single parent after his father died when he was young. These experiences influenced his later political career and commitment to advocating for marginalized communities. De León attended San Diego State University, where he earned a Bachelor of Arts degree in Political science and Chicano Studies. During his time in college, he became involved in activism and community organizing, working on issues such as affordable housing and immigrant rights. These early experiences sparked his passion for social justice and laid the foundation for his future political career. After completing his undergraduate studies, de León continued his education at the University of California, Santa Barbara, where he pursued a Master's degree in public administration. He further honed his leadership skills and deepened his understanding of public policy, preparing him for his future roles in government. De León's upbringing and educational background played a significant role in shaping his perspective and commitment to fighting for the rights of marginalized communities. These early experiences instilled in him a determination to address the systemic inequalities and barriers faced by many Californians, particularly those from immigrant backgrounds. == California State Assembly == Kevin de León served in the California State Assembly, representing the 45th district from 2006 to 2010. During his tenure, he worked on various legislative initiatives and advocated for policies that aimed to address social and environmental issues. As a member of the California State Assembly, de León focused on a range of issues affecting his constituents. He was particularly passionate about affordable housing, healthcare, and education. He championed legislation aimed at expanding access to healthcare services, improving educational opportunities, and promoting affordable housing options for low-income individuals and families. De León also played a key role in advancing environmental policies during his time in the Assembly. He worked to increase renewable energy usage and reduce greenhouse gas emissions. As a strong advocate for clean energy, he co-authored the California Global Warming Solutions Act of 2006, also known as AB 32, which set ambitious goals for reducing the state's greenhouse gas emissions. During his tenure, de León demonstrated a commitment to representing the needs and concerns of his constituents. He actively engaged with community organizations and worked to amplify the voices of underrepresented communities. His efforts earned him recognition as a champion for social and environmental justice. De León's experience in the California State Assembly provided him with a solid foundation for his future political career. His work on critical issues and his dedication to serving the people of California laid the groundwork for his subsequent roles in the California State Senate and his bid for the United States Senate. == California State Senate == Kevin de León served in the California State Senate, representing the 22nd district from 2010 to 2018. During his tenure, he played a significant role in shaping California's legislative landscape, focusing on issues such as immigration, environmental policy, and social justice. As a State Senator, de León became a prominent voice for immigrant rights. He authored the California Trust Act, which aimed to limit local law enforcement's cooperation with federal immigration authorities. The act sought to protect undocumented immigrants who were otherwise law-abiding residents and fostered a more inclusive approach to immigration enforcement. De León also prioritized environmental issues and worked towards advancing renewable energy and reducing greenhouse gas emissions. He authored Senate Bill 350, which aimed to increase California's renewable energy usage and improve energy efficiency in buildings. This legislation played a crucial role in shaping the state's clean energy goals and commitment to combating climate change. In addition to his work on immigration and environmental policy, de León advocated for social justice initiatives. He supported criminal justice reforms and efforts to address economic inequality. De León's focus on social and economic equity was evident in his efforts to increase the minimum wage and expand access to affordable housing. During his time in the California State Senate, de León served as the President pro tempore from 2014 to 2018. As the leader of the Senate, he played a pivotal role in shaping the legislative agenda and guiding policy discussions. De León's tenure in the California State Senate solidified his reputation as a progressive leader and a staunch advocate for marginalized communities. His work on immigration, environmental policy, and social justice contributed to his influence within the Democratic Party and his subsequent bid for the United States Senate. == 2018 U.S. Senate bid == Kevin de León ran for the United States Senate in 2018, challenging incumbent Dianne Feinstein. Although unsuccessful in his bid, his campaign made a significant impact and helped shift the conversation within the Democratic Party in California. De León's campaign focused on progressive policy positions and a vision for a more inclusive and equitable future. He emphasized issues such as healthcare, immigration reform, and income inequality. De León advocated for a universal healthcare system and championed the idea of Medicare for All, aiming to ensure that all Californians had access to affordable and quality healthcare. His strong stance on immigration reform resonated with many voters. De León supported comprehensive immigration reform and sought to protect undocumented immigrants from deportation. He emphasized the contributions immigrants make to California's economy and society, advocating for policies that would provide a pathway to citizenship and protect the rights of undocumented individuals. Throughout his campaign, de León also highlighted his commitment to combatting climate change and advancing clean energy solutions. He stressed the need for California to lead the nation in addressing environmental issues, and he proposed bold initiatives to reduce carbon remissions and expand renewable energy sources. De León's bid for the U.S. Senate demonstrated his continued dedication to advocating for progressive policies and fighting for social and environmental justice. His campaign left a lasting impact on the political landscape in California and contributed to ongoing discussions about the future direction of the Democratic Party. == Los Angeles City Council == Kevin de León is currently serving on the Los Angeles City Council, a position he has held since 2020. As a council member, he represents the 14th district of Los Angeles and works on various issues affecting the city and its residents. De León's tenure on the Los Angeles City Council has been marked by his dedication to addressing the needs of his constituents and advocating for progressive policies. He has been actively involved in initiatives related to affordable housing, homelessness, and public safety. One of de León's primary focuses has been tackling the city's homelessness crisis. He has worked to expand access to shelter and services for individuals experiencing homelessness while also pushing for long-term solutions to address the root causes of homelessness. De León has supported measures to increase affordable housing options and has sought to improve coordination between city agencies and community organizations in addressing the issue. Public safety has also been a significant area of concern for de León. He has championed efforts to enhance community policing strategies and improve relations between law enforcement and the communities they serve. De León has advocated for investments in community-based programs and initiatives that prioritize proactive and preventive approaches to public safety. Additionally, de León has been committed to addressing environmental and climate-related issues in Los Angeles. He has worked on policies to promote renewable energy, reduce pollution, and enhance sustainability efforts. De León has emphasized the importance of transitioning to a clean energy economy and has supported initiatives that promote environmental justice. As a council member, de León has brought his experience in state and national politics to his work at the local level. He continues to be an influential figure in shaping policies and advocating for the needs of his district and the broader Los Angeles community. == 2022 Los Angeles Mayoral Bid == Kevin de León's 2022 Los Angeles Mayoral Bid was an unsuccessful campaign in which he competed against Karen Bass and Rick Caruso. Despite his efforts, de León came in third place in the election, failing to advance to the runoff stage. Throughout his campaign, de León presented himself as a progressive candidate with a focus on addressing the pressing issues facing Los Angeles. He emphasized his experience in state politics, particularly his time in the California State Senate, and sought to bring his advocacy for social and environmental justice to the mayoral role. During the campaign, de León received endorsements from Representatives Jimmy Gomez and Lou Correa, two influential figures within the Democratic Party. Their support highlighted de León's standing among fellow politicians and his commitment to advancing progressive policies. Despite his notable endorsements and experience, de León was unable to secure enough votes to move forward to the runoff stage. The runoff eventually took place between Karen Bass and Rick Caruso, with Bass emerging as the winner of the mayoral race. In a departure from endorsing either candidate in the runoff, de León decided not to endorse any candidate for the mayoral position. While he did not secure the mayoral seat himself, his campaign contributed to the broader political discourse in Los Angeles and brought attention to important issues facing the city. Although his bid for mayor was ultimately unsuccessful, de León remains an active figure in Los Angeles politics and continues to advocate for progressive policies and social and environmental justice. Category:Politicians from California Category:Democratic Party (United States) politicians Category:1966 births Category:Living people",
 "title": "Kevin de León"
}