{
 "id": "1026204",
 "text": "Thames Water Utilities Ltd, known as Thames Water, is a large private utility company. It supplies water and waste water treatment in most of Greater London, Luton, the Thames Valley, Surrey, Gloucestershire, north Wiltshire, far west Kent, and some other parts of England. It was started in 1989 during privatisation of the water industry in England and Wales. The water is mostly sourced from the Thames as well as some other rivers and boreholes. It is the biggest water and wastewater services company in the United Kingdom. It runs the Thames Water Ring Main around London, one of Europe's largest wastewater treatment works and the UK's first large-scale desalination plant—both at Beckton in east London—and the £4.2 billion Thames Tideway sewer currently under construction. It supplies 2.5 billion litres (550 million imperial gallons) of drinking water and treats 4.6 billion litres (1,000 million imperial gallons) of wastewater a day. It serves a population of 15.5 million people—about a quarter of the UK population—but its ageing infrastructure often leaks and causes pollution. == History == The New River was started in 1604 by Edmund Colthurst to carry fresh water from Hertfordshire into London. The business of the New River was taken over by the New River Company, officially founded by royal charter in 1619. This developed into the Thames Conservancy which started in 1857 when Joseph Bazalgette started building the London sewers. Thames Water plc was bought by the German utility company RWE in 2001. They sold it for £8 billion to Kemble Water Holdings Ltd in 2006. This is owned by the Australian Macquarie Group. In 2017, Macquarie Group sold it to the Canadian pensions group OMERS and the Kuwait Investment Authority. In 2022 it was losing money with current debt amounting to 80% of the value of the business. It was the most heavily indebted of England and Wales' water companies. This problem was seen by the regulator Ofwat in December 2022 and there were discussions about a possible collapse and state bail-out. In June 2018 regulators made Thames Water pay £65 million to customers among other problems because they failed to fix leaks.Thames Water to pay back £65m to customers as part of penalty package The Guardian In June 2023 leak levels were at their highest for five years. It was estimated to be losing a day. In July 2023 it was fined £3.3 million after it discharged millions of litres of undiluted sewage into the Gatwick Stream in Sussex and River Mole in Surrey. ==References== Category:Companies of England Category:Water infrastructure",
 "title": "Thames Water"
}