{
 "id": "1026300",
 "text": "Juan Alberto \"Pepe\" Schiaffino Villano (; 28 July 1925 – 13 November 2002) was an Italian-Uruguayan football player who played as an attacking midfielder or forward. A highly skilful and creative playmaker, at club level, he played for CA Peñarol in Uruguay, and for A.C. Milan, and Roma in Italy. At international level, he won the 1950 FIFA World Cup with the Uruguay national team, and also took part at the 1954 FIFA World Cup; he later also represented the Italy national football team. He was ranked as the best Uruguayan footballer of all time by an IFFHS poll, and the 17th greatest player of the twentieth century. Slender and physically thin, he was a complete and versatile midfielder. In possession of an extraordinary talent and technique, he had the habit of scoring thanks to a precise shot but not too powerful. An inside left very skilled in finishing, with excellent game vision, able to read the development of the game in advance. Gianni Brera always defined it as an incomparable interior, while Cesare Maldini, his former teammate, said: he had a radar instead of a brain. Often regarded as one of the greatest Uruguayan footballers of all time. ==Early days== Schiaffino kicked his first shots in the fields of Pocitos, beach in Montevideo. At the age of 8 in 1933, he joined the team in his barrio, Palermo. He was employed as a right winger. His first real club was Olimpia, which he joined in 1937 at the age of 12. Then it was the turn of the Nacional, where he had a brief experience. ==Club career== The son of Italian immigrants started football very early and played for series champion Peñarol Montevideo at the age of 18 (from 1943). There, the dribbling artist quickly became a regular player. With his club he won the Uruguayan football championship in 1949, 1951, 1953 and 1954 and dominated the national league with his great local rivals Nacional Montevideo. After the 1954 FIFA World Cup, Schiaffino moved to Europe for the then world record transfer of £ 72,000 and joined top Italian side AC Milan. There he played together with Cesare Maldini, Nils Liedholm, Gunnar Gren and goalscorer Gunnar Nordahl. He made his debut in September 1954 in the Serie A game against US Triestina and promptly scored two goals. Schiaffino as a midfielder in Italy as a playmaker and ball distributor, and continued to be a goal threat. He was also successful in Europe and won with the Rossoneri won the Scudetto in 1955, 1957 and 1959 and the Coppa Italia in 1956. In 1958, AC Milan were the only European team to bring Real Madrid to the brink of defeat in a European Cup final. Milan lost the final in Brussels 2-3 after extra time. At the age of 35 he left Milan in 1960 and joined AS Roma, where he played as a libero until 1962. It was also here that he met old club-mate Alcides Ghiggia and both won the 1961 Inter-Cities Fairs Cup with Roma. ==International career== He made his debut for Uruguay on January 9, 1946 in the Copa Rio Branco game against Brazil, which was stopped after 78 minutes at a score of 1-1. The highlight of his international career was undoubtedly the 1950 World Cup in Brazil. Schiaffino was Uruguay's best player at the World Cup alongside his Penarol teammates Alcides Ghiggia and Óscar Míguez. The trio led the team to the decisive match against Brazil. The Brazilians took the lead but Schiaffino equalized in the 66th minute and Ghiggia scored the 2-1 winner in the 79th minute. With this historic victory for Uruguay in the famous Maracanã stadium, Uruguay were football world champions for the second time. Four years later, at the 1954 FIFA World Cup in Switzerland, Schiaffino came with Uruguay to the semifinals against Hungary. After being 2-0 behind, his team fought back a 2-2, but then had to give up the game with 4-2. On July 3, 1954, Uruguay lost 3-1 to Austria in the third-place match. This was also the last of his 21 international appearances in the Celeste, in which he scored a total of 8 goals. There are also two other national team appearances against Argentina (December 29, 1945 and December 5, 1948), which are not counted as full international matches. From 1954 to 1958 he played for the Italy national football team, but only made four appearances for his parents' home country. ==Managerial career== Schiaffino returned to Montevideo and embarked on a brief coaching career. In 1974 he was entrusted with the Uruguayan national team, with which he participated in the Copa América the following year. Shortly afterwards he also coached the Peñarol youth team until 1976. However, he did not have good results, and decided to devote himself solely to entrepreneurial activity. ==Death== Schiaffino died on 13 November 2002. His remains are buried at the Cementerio del Buceo, Montevideo. ==International career statistics== |- |1946||1||0 |- |1947||1||0 |- |1948||1||1 |- |1949||0||0 |- |1950||8||3 |- |1951||0||0 |- |1952||0||0 |- |1953||1||0 |- |1954||9||4 |- !Total||21||8 |} |- |1954||1||0 |- |1955||0||0 |- |1956||0||0 |- |1957||2||0 |- |1958||1||0 |- !Total||4||0 |} ==Honours== ===Club=== ;Peñarol *Primera División Uruguaya (Uruguayan championship): 1949, 1951, 1953, 1954 ;Milan *Serie A: 1954–55, 1956–57, 1958–59 *Latin Cup: 1956 ;Roma *Inter-Cities Fairs Cup: 1961 ===International=== ;Uruguay *FIFA World Cup: 1950 *Copa Río Branco: 1946, 1948 *Copa Río Branco Runner-up: 1947, 1950 ===Individual=== *FIFA World Cup All-Star Team: 1950 *IFFHS Uruguayan Player of the 20th Century *IFFHS South American Player of the 20th Century (6th place) *IFFHS Player of the 20th Century (17th place) *World Soccer: The 100 Greatest Footballers of All Time *A.C. Milan Hall of Fame *IFFHS Legends *FIFA World Cup Silver Ball (2nd Best Player): 1950 *Latin Cup Top Goalscorer: 1956 ==References== ==Other websites== * * Juan Alberto Schiaffino on RSSSF * SuperFutbol profile Category:1925 births Category:2002 deaths Category:Italian footballers Category:Italian football managers Category:Footballers from Montevideo Category:Uruguayan football managers Category:Association football forwards",
 "title": "Juan Alberto Schiaffino"
}