{
 "id": "1026318",
 "text": "The Izumo clan is a family who runs the shrine Izumo Taisha. The shrine is part of the religion Izumo-taishakyo They are descended from Ame no Hohi and used to rule Izumo Province. Accoring to Japanese mythology, Ame no Hohi was sent by his mother Amaterasu to help Susanoo after she went down from heaven to rule Earth. They ran Izumo Taisha for him. The clan were originally Kuni no miyatsuko or provincial governors. After the Emperor ended that role during the Taika Reform they switched jobs. They became the priests of Izumo-taisha. Other clans did this like the Aso clan of Aso Shrine, the Owari clan of Atsuta Shrine, the Munakata clan of Munakata Taisha, the Amabe clan of Kono Shrine, and the Yamato clan of Ōyamato Shrine. From the beginning the role of Izumo no Kuni no Miyatsuko was seen as more important than the other provincial governors, like a lesser Emperor of Japan. They used to be a rival group to the Emperor, and later on myths were made about their voluntary submission. The head of the family was still called the Kokuzo or Kuni no Miyatsuko in the medieval period, long after nobody else used the title. In 1340 the family split into two lines: and . They split because of a conflict about an initiation ritual. The older sons descendants became and the younger sons descendants became . The families took turns running the shrine. But during the Meiji Restoration the shrine was taken by the government. Takatomi Senge was the 80th high priest of Izumo-taisha and founded Izumo-taishakyo after the shrine was seized by the government. When Japan lost WWII America occupied it. , the 83rd Izumo Kokuzo, was given the shrine in 1947. He died in February 2002 at the age of 89. On October 5, 2014, Kunimaro Senge, eldest son of the current leader Takamasa Senge, married Princess Noriko at the shrine.\"Japantimes - Princess Noriko to wed\" , Tokyo, 27 May 2014. Retrieved on 4 October 2014 Princess Noriko is one of the few princesses of Japan. She is a second cousin of the retired Emperor Akihito. == Related pages == * Izumo Taisha * Yamato no Kuni no Miyatsuko ==References== == Further reading == * Ancient Izumo in the spotlight. (2007, February 26, p. 19). The Daily Yomiuri (Tokyo), 1. Retrieved July 12, 2008, from the LexisNexis Academic database. * Guide to Izumo Oyashiro. (n.d.). (Pamphlet available to visitors at the shrine) * Izumo Shrine Find Points to Huge Ancient Building. (2000, April, p. 29). The Daily Yomiuri (Tokyo), 1. Retrieved July 12, 2008, from the LexisNexis Academic database. * Lucas, B. (2002, May 7). History and Symbolism in Shinto Shrine Architecture. Harvey Mudd College Web. Retrieved July 26, 2008 * Nishi, K., & Hozumi, K. (1985). What is Japanese Architecture?: A survey of traditional Japanese architecture, with a list of sites and a map. New York, NY: Harper & Row. * Ponsonby-Fane, Richard Arthur Brabazon. (1959). The Imperial House of Japan. Kyoto: Ponsonby Memorial Society. OCLC 194887 * Senge, chief priest of Izumo Shrine, dies at 89. (2002, April 18). Japan Economic Newswire. Retrieved July 28, 2008, from the LexisNexis Academic database. Category:Japanese nobility Category:Izumo Grand Shrine Category:Izumo Province Category:Shake clans Category:Izumo clan Category:Japanese clans",
 "title": "Izumo clan"
}