{
 "id": "1026745",
 "text": "Dominik Thalhammer (born 2 October 1970) is an Austrian football manager. He is the manager of Belgian Pro League club Oostende. ==Career== Thalhammer trained from 1997 to 2000 the lower class SC Brunn am Gebirge. From the 2000/01 season, Thalhammer worked for Bundesliga club VfB Admira Wacker Mödling as academy manager, amateur coach and academy coach. With the amateur team he managed to get promoted to the Regionalliga Ost. He became Austrian champion with the U17 and U19 academy team. In September 2004 he became coach of the first team.He was the youngest coach for a team in the Bundesliga. Admira separated from him in August 2005.Der Standard.at From December 2005 to October 2006 he was the head coach of Wiener Sport-Club in the third level. From June 2007 to May 2008 Thalhammer worked for the Bundesliga club LASK as an assistant to head coach Karl Daxbacher. He then briefly looked after the regional league team Floridsdorfer AC. From 2020 to 2011 he was coach for lower league clubs in Upper Austria. In February 2011 Thalhammer became head of thenational center for women's football in St. Pölten and head of the Austrian women's U-17 national team. In April 2011 he also took over the Austrian senior women's national team. He reached the playoffs for the European Championship in Sweden in 2012 for the first time in the history of Austrian women's football. In 2013, with the U-17 national team, Thalhammer achieved the first qualification of an Austrian women's national team for a final round for the European championship in England in 2014. In February 2016, Thalhammer became sporting director of the Austrian Football Association's coaching training . This ended his work as sporting director of the National Center for Women's Soccer and as coach of the women's U-17 national team. In September 2016 Thalhammer and the women's national team made the historic first qualification for a European Championship, which took place in the Netherlands in 2017.http://derstandard.at At the European Championships in the Netherlands, Dominik Thalhammer's team sensationally qualified as group winners for the quarter-finals after beating Switzerland (1-0), drawing against France (1-1) and beating Iceland (3-0). After more than nine years at the ÖFB he returned to LASK for the 2020/21 season. He became head coach and sports director. LASK had a bad start in the 2021/22 season. As a result LASK fired Thalhammer in September 2021. In November 2021 Thalhammer took over Cercle Bruges in Belgium.Cercle Brugge Homepage They separated from Thalhammer in September 2022. In November 2022 he became coach of KV Ostend also in Belgium.KVO Homepage Thalhammer was relegated with Oostende at the end of the 2022–23 Belgian Pro League season. ==References== ==Other websites== * Category:1970 births Category:Living people Category:Austrian football managers Category:FC Admira Wacker Mödling managers Category:LASK managers Category:Floridsdorfer AC managers",
 "title": "Dominik Thalhammer"
}