{
 "id": "1027763",
 "text": "Hubertus Jozef Margaretha \"Huub\" Stevens (; born 29 November 1953) is a former Dutch professional football manager and player. ==Playing career== Stevens was born in Sittard. He played for Fortuna Sittard and PSV. With PSV, he won the Eredivisie three times, the KNVB Cup once and the UEFA Cup in 1978. He also played for the Netherlands national team. He played 18 matches and scored one goal. With the team he played in the 1980 European Championship finals. ==Managerial career== He started his career as head of youth development at PSV. In 1993 Stevens became the manager of Roda JC Kerkrade. From October 1996 to June 2002, he managed German Bundesliga club Schalke 04, With them he won the UEFA Cup in 1997 and the DFB-Pokal in 2001 and 2002. In 1999, Schalke fans picked Stevens as manager of the century. Then Stevens was manager of Hertha BSC,. He was sacked on 4 December 2003. He went to 1. FC Köln, which he managed from 14 June 2004 to 27 May 2005. In 2005 he went to Roda JC. Under Stevens 1. FC Köln became champions of the 2. Bundesliga and were promoted to the Bundesliga. In 2007 he returned to the German Bundesliga and managed Hamburger SV. Stevens took over the managing vacancy at PSV after his Hamburg contract expired at the end of the 2007–08 season.On 28 January 2009, he resigned as manager,.He then signed a contract with Red Bull Salzburg in the Austrian Bundesliga on 22 April 2009. On 9 February 2010, Stevens extended his contract with Red Bull Salzburg until 2012, On 8 April 2011 he was sacked. On 27 September 2011 he returned to Schalke 04 and signed a contract lasting until 2013. On 16 December 2012 Stevens was sacked by Schalke. On 25 June 2013 Stevens became manager of PAOK Saloniki. PAOK fired him on 2 March 2014 due to poor results. Stevens was appointed manager of VfB Stuttgart on 9 March 2014. Stevens started his new position with training on 10 March 2014. He resigned as manager of Stuttgart on 10 May 2014 following a 1–0 loss to Bayern Munich. On 25 November 2014, Stevens returned to VfB Stuttgart. He left Stuttgart at the end of the 2014–15 season. Stuttgart finished in the 14th position in the Bundesliga. Stevens was appointed manager of 1899 Hoffenheim on 26 October 2015. He resigned on 10 February 2016 due to health problems. On 14 March 2019, he returned to Schalke as an interim until the end of the season.On 18 December 2020, he returned to Schalke once again as an interim. This time he coached the club for only two matches. ===Player=== PSV *Eredivisie: 1976, 1978, 1986 *KNVB Cup: 1976 *UEFA Cup: 1978 ===Manager=== Roda JC *Eredivisie runner-up: 1995 Schalke 04 *UEFA Cup: 1997 *DFB-Pokal: 2001, 2002 *Bundesliga runner-up: 2001 Hertha BSC *DFB-Ligapokal: 2002 1\\. FC Köln *2. Bundesliga: 2005 Hamburger SV *UEFA Intertoto Cup: 2007 PSV *Johan Cruyff Shield: 2008 Red Bull Salzburg *Austrian Bundesliga: 2010 ==References== Category:Living people Category:1953 births Category:Association football defenders Category:Eredivisie managers Category:Bundesliga managers Category:FC Schalke 04 managers Category:Hamburger SV managers Category:1. FC Köln managers Category:Hertha BSC managers Category:FC Red Bull Salzburg managers Category:PAOK FC managers Category:VfB Stuttgart managers Category:TSG 1899 Hoffenheim managers",
 "title": "Huub Stevens"
}