{
 "id": "1027580",
 "text": "Matías González (6 August 1925 – 12 May 1984) was a Uruguayan footballer, who played for C.A. Cerro. He was known as a complete defender who stood out for his leadership, man-marking, toughness tackling and pace. Commonly considered as one of the finest Uruguayan defenders of all time. He won the 1950 FIFA World Cup with Uruguay, he was in the starting lineup for the Uruguayan national team at Maracanaço, where he had a defensive performance described as \"impeccable\", sticking to top scorer Ademir and also annulling Friaça in the first half. ==Club career== González only defended Cerro, a small club from Montevideo that never won the Uruguayan championship. The team rose in 1946 back to the tournament's first division, from which it had been absent since relegation in 1929. From there until González officially stopped playing for the club, aged 35, the most common placement was fifth place, as in 1949, 1950 and 1951, achieving third place as the best position precisely in 1955 and 1956. He won the Torneo Cuadrangular in 1953 and 1956. He was known as a fan favourite of the club and is recognized one of the most successful players. ==International career== Because of good performances at Cerro, González debuted for the Uruguayan national team on April 13, 1949. The date corresponded to Celeste's debut in the 1949 Copa América. He was the only Cerro player called up to the competition; the club was last in the Uruguayan league the previous year when it ended, after the first round of the second round. The Uruguayan championship of 1948 was interrupted by a strike that would only end in April 1949, when Copa America took place. Thus, it was decided that the home title would go to the then leader Nacional, and that there would be no relegation. The strike meant that secondary players were called to the Copa América, with youth, athletes from the interior or anyone who had not joined the protest - this was the case of González. In the campaign that yielded only a sixth place out of eight participants, González was in the starting line-up, as well as the only man called up for the 1950 FIFA World Cup. He, Rubén Morán and Héctor Vilches became Cerro's first players called up to a FIFA World Cup. Of them, González was the first to debut, participating in all of the team's games in the tournament. Morán was only in the Maracanaço, enough to make Cerro the third most represented team in the decision against Brazil, behind only Nacional (with three) and Peñarol (six). Uruguay came into the World Cup in a turbulent environment; Obdulio Varela even reported that the players were close to not going to Brazil, in protest against reprisals by leaders against the recent strike. In addition, coach Juan López had been chosen just a month before the tournament, after Celeste Olímpica got bad results against the Brazilians themselves, which, in addition to the defeats for the Copa Rio Branco, also included a defeat for Brazil in Pelotas and, in Montevideo, two draws against Fluminense; Uruguayan players found themselves out of shape after two months of inactivity. Before López chose the Uruguayan Football Association, Peñarol even vetoed the call up of its players: the AUF despised the coach of the aurinegra team, the Hungarian Emérico Hirschl, desired by the fans and the media. With little time to put the team together, López called exactly the players who played in the Copa Rio Branco weeks before the world cup. The Río Branco Cup unfolded in three matches, with Matías González playing all of them, repeating in the first two the defense duo with Vilches, later replaced by Eusebio Tejera, who would be González 's partner in the world cup. González's presence in the team was favored by the intervention of Obdulio Varela, who told the captin that if they wanted to win the world cup they need González. González had been boycotted by colleagues for not having joined the 1948 strike and for his overall attitude toward everyone. González was a hero in a complicated game against Spain, already in the final quadrangular. The South Americans started winning, but suffered the comeback and needed a risky long-distance shot by Obdulio Varela to equalize in the last twenty minutes. The defender saved at the top of the line what could have been the Spanish victory in the last bid and he was named hero of the match. At Maracanazo, González was the most defensive Uruguayan player, not coming out much beyond the half moon. He was in charge of personally marking top scorer Ademir, sticking to him with support from Rodríguez Andrade on the left, Gambetta on the right and Tejera in the center. González also annulled Friaça in the first half, in which the Uruguayan tactics worked to prevent the tables between Ademir, Zizinho and Jair, key moves for the routs imposed by the Brazilians in the matches prior to the decision. González was the absolute starting Uruguayan defender also in the Copa América in 1953, with William Martínez being his most frequent partner. Uruguay finished third; González ended up not being called up for the 1954 FIFA World Cup, he was called up for the 1955 Copa América, but played in just one game, precisely in the 6-1 defeat suffered by champion Argentina. The Uruguayans were fourth. González last played for the national team on October 10, 1956, date of the 2-1 defeat by Argentina in Paysandú. He had been left out of that year's Copa América, held in January in Uruguay and won by the country. ==Later life and death== González went on to work as a civil servant for the National Congress, earning a good salary without much work. He married his wife in 1953 and had a son with her in 1965. He had another son with a different woman in 1953. Sadly, he suffered from alcoholism throughout his whole life and died due to his addiction. The Lion died without his family by his side on May 12, 1984. Even though he pushed away his family, he was and still is a World Cup champion and played an important role in the World Cup and the final game. May he rest in peace. ==Honours== ===Club=== ;Cerro *Torneo Cuadrangular: 1953, 1956 ===International=== ;Uruguay *FIFA World Cup: 1950 *Copa Río Branco Runner-up: 1950 *Copa América third place: 1953 *Copa América fourth place: 1955 ===Individual=== *FIFA World Cup All-Star Team: 1950 ==References== *World Cup Champions Squads 1930 - 2002 *A primeira grande zebra do Mundial (in Spanish) *Uruguay - Record International Players Category:1925 births Category:1984 deaths Category:Uruguayan footballers Category:1950 FIFA World Cup players Category:Association football defenders",
 "title": "Matías González"
}