{
 "id": "102802",
 "text": "Secondary sex characteristics are features which make it possible to tell the sexes of a species apart. They are not directly linked to reproduction. Male birds usually have much more colourful feathers (plumage). Females are usually better able to hide, and their plumage is camouflaged. This makes sense, because the female birds carry the \"precious package\". Well-known secondary sex characteristics in humans are for men: low voice tone, facial hair (mustache and beard) and more muscular build, shoulders wider, bones heavier, hands and feet bigger, height taller. In women, those characteristics usually cited are more prominent breasts, lips, eyes, long/fast growing hair, no facial hair, height shorter, wider hips, more fat, and a higher voice tone. Average length of the tongue is greater in females, sometimes quite noticeably. It is reasonable to think this is also a secondary sexual character. Faces, generally, make a big impact. It is the part other people interact with when meeting each other. Some features are based on necessity. The wider hips of women are needed to give birth. Babies are born through the space between the three bones of a woman's pelvis. So is doubtful to call this a secondary characteristic, except so far as the width helps attract mates. Breasts are also essential, but in humans they are much larger in proportion to other mammals, and they do serve to attract males. == Evolutionary ideas == Charles Darwin thought that sexual selection, or competition within a species for mates explains many of the differences between sexes.Darwin C. 1871. The Descent of Man and selection in relation to sex. John Murray, London. Behaviour, such as male-to-male combat and female choice of males is a kind of secondary sex characteristic. Many 'ornaments' such brighter plumage, colouration, and other features have no immediate function except to improve the male's chances of being selected by females for breeding. Weapons such as antlers may serve both as defence against predators, and as status symbols advertising health and fitness. == Related pages == *Sexual dimorphism *Sexual selection *Sexual reproduction == References == Category:Sexuality",
 "title": "Secondary sex characteristic"
}