{
 "id": "1028297",
 "text": "Alexander Schlager (born 1 February 1996) is an Austrian professional footballer. He plays as goalkeeper for Austrian Bundesliga club FC Red Bull Salzburg and the Austria national team. ==Career== Schlager began his career at ASK Salzburg. He then moved to FC Red Bull Salzburg. From April to August 2007 he played in the youth team of ASK Maxglan. In August 2007 he moved to SV Austria Salzburg. In 2009 he returned to the youth team of Red Bull Salzburg. He played then for the Red Bull Salzburg academy. In May 2012 he made his debut for the Red Bull Salzburg Juniors in the Regionalliga West . He was in the stgarting team. But this was his only appearance for the Red Bull Juniors. In May 2013, he made his debut in Salzburg's professional squad against FK Austria Wien, but did not play. For the 2014–15 season he was loaned to Germany to the A-Juniors of RB Leipzig. In October 2014 he made his first appearance in the A-Junior Bundesliga against Dynamo Dresden. In November 2014 he was in the squad for the fifth-rate second team in Leipzig for the first time against the second team of FC Carl Zeiss Jena, but was not used. By the end of the season he had played 18 games in the A-Junior Bundesliga. Leipzig became champion of the North/Northeast season. In the relegetion round they failed in the semifinals at TSG 1899 Hoffenheim. For the 2015–16 season he was loaned to Bundesliga club SV Grödig. He made his Bundesliga debut for Grödig in July 2015 when he started against SCR Altach. During his loan, he made ten Bundesliga appearances for SV Grödig. They were relegated from the Bundesliga at the end of the season. For the 2016–17 season Schlager moved to the second division club Floridsdorfer AC.FAC Homepage In July 2016 he played his first game in the second division against WSG Wattens. By the end of the season he had made 23 appearances for Floridsdorf. For the 2017–18 season he went to Bundesliga club LASK.LASK Homepage In his first season he was behind Pavao Pervan. So he only played one match for LASK in the Bundesliga. After Pervan left, Schlager became LASK's first goalkeeper in the summer of 2018 and also played his first international competition at club level against Lillestrøm SK. In September 2018, his contract was extended until June 2021.Oberösterreichische Nachrichten (German) In the 2018–19 season he made 31 Bundesliga appearances and finished runners-up with LASK. In December 2022, LASK announced that Schlager leave LASK after the 2022–23 season. He then returned to Red Bull Salzburg for the 2023/24 season and signed till June 2027.FC Red Bull Salzburg Homepage ==International career== He played for Austria U-21 and also the other youth teams from U16 to U19. He was the captain for Austria U-21 in Euro U-21 2019. On 16 November 2019, Schlager played his first match for Austria's national team in the deciding UEFA Euro 2020 qualifier against North Macedonia in Vienna. ==References== Category:1996 births Category:Living people Category:Players of the Austrian national football team Category:FC Red Bull Salzburg players Category:FC Liefering players Category:Austrian football goalkeepers Category:LASK players Category:Association football goalkeepers",
 "title": "Alexander Schlager"
}