{
 "id": "1028468",
 "text": "Carlsbad Caverns National Park is an American national park in the Guadalupe Mountains of southeastern New Mexico. It is in the Delaware Basin. Most people come here to see the show cave Carlsbad Cavern. Visitors to the cave can hike down the natural entrance. They could also take an elevator from the visitor center. The park entrance is by US Highway 62/180, roughly southwest of Carlsbad, New Mexico. The park has two entries on the National Register of Historic Places: The Caverns Historic District and the Rattlesnake Springs Historic District. Roughly two-thirds of the park has been set aside as a wilderness area. This means that there will be no future changes to the habitat. Carlsbad Cavern has a large limestone chamber, named the Big Room, which is almost long, wide, and high at its highest point. ==History== In 1898, a teenager named Jim White went into the cavern with a homemade wire ladder. He named many of the rooms. Until 1932, visitors had to walk down a ramp that took them below the surface. The walk back up made some of them tired. In 1932, the national park opened a large visitor center building. It had two elevators that would take visitors in and out of the caverns below.\"Elevators Whisk Tourist to Bottom of 750-Foot Cave\" Popular Science, May 1932, drawings of visitor center and elevators ==Climate== According to the Köppen climate classification system, the Carlsbad Caverns Visitor Center has a cool semi-arid climate (BS). ==Bats== Seventeen species of bats live in the park. Many of the bats in the cave are Mexican free-tailed bats. People say that the number of Mexican free-tailed bats used to be several million, but has gone down a lot in modern times. The cause is unknown, but organochlorine pesticides (specifically DDT and dieldrin) are likely part of the reason. A 2009 study by a team from Boston University says that there may have never been millions of bats in the caves. Scientists have tried to count the bats in many different ways. Using thermal imaging cameras to track the bats worked the best. The Mexican free-tailed bats are there from April or May to late October or early November. They fly out of the cave in a dense group, corkscrewing upwards. They usually start flying out around sunset. The event usually lasts about three hours. Every evening from Memorial Day weekend to mid October, a ranger talks about the bats while visitors sitting in the amphitheater wait to watch them fly out. ==References== Category:National parks in the United States Category:World Heritage Sites in the United States Category:Geography of New Mexico Category:1930 establishments in the United States",
 "title": "Carlsbad Caverns National Park"
}