{
 "id": "1028419",
 "text": "The 2023 Pacific hurricane season was a hurricane season in the Pacific Ocean in the Northern Hemisphere. The season began on May 15 in the eastern Pacific (east of 140°W) and on June 1 in the central Pacific (from 140°W to the International Date Line). The season ended for both on November 30. == Seasonal summary == The beginning of the season had little activity. The first storm, Hurricane Adrian, did not develop until June 27. Hurricane Beatriz formed two days later along the coast of Mexico. == Systems == === Hurricane Adrian === On June 23, the National Hurricane Center (NHC) began monitoring an area of low pressure which formed off the coast of southern Mexico. On June 27 the storm became organized and the NHC began posting advisories for Tropical Storm Adrian. Adrian strengthened and became the first hurricane of the season on June 28 while southwest of Manzanillo, Cloima. On June 30, Adrian reached Category 2 status, with sustained winds of up to . Adrian began weakening and degenerated into a remnant low on July 2. === Hurricane Beatriz === On June 25 an area of low pressure formed off the cost of Costa Rica. The NHC began posting advisories for the system, named Potential Tropical Cyclone Two-E on June 28. The next day, the system became organized and was named Tropical Storm Beatriz that evening. Beatriz traveled along the coast of Mexico and was upgraded to a Category 1 hurricane on June 30, with sustained winds of up to . Beatriz weakened to a tropical storm early on July 1, and dissipated later that day. One person drowned in Mazatlán, Sinaloa, on July 1, while surfing high waves created by the remains of Beatriz. === Hurricane Calvin === === Tropical Depression Four-E === === Hurricane Dora === === Tropical Storm Eugene === === Hurricane Fernanda === === Tropical Storm Greg === === Hurricane Hilary === === Tropical Storm Irwin === === Hurricane Jova === === Tropical Depression Twelve-E === === Tropical Storm Kenneth === === Tropical Depression Fourteen-E === === Hurricane Lidia === === Tropical Storm Max === === Hurricane Norma === === Hurricane Otis === === Tropical Depression Nineteen-E === ==== Current storm information ==== As of 4:00 p.m. AST (21:00 UTC) October 28, Tropical Depression Nineteen-E is located about southwest of San Salvador, El Salvador. Maximum sustained winds are , with gusts up to . The minimum barometric pressure is , and the system is stationary. For the latest official information, see: * The NHC's latest public advisory on Tropical Depression Nineteen-E * The NHC's latest forecast advisory on Tropical Depression Nineteen-E * The NHC's latest forecast discussion on Tropical Depression Nineteen-E == Storm names == This list of names will be used for storms which form in the North Pacific east of 140°W in 2023. It is the same list used in 2017. * Adrian * Beatriz * Calvin * Dora * Eugene * Fernanda * Greg * Hilary * Irwin * Jova * Kenneth * Lidia * Max * Norma * Otis * * * * * * * * * The names for storms which form in the North Pacific from 140°W to the International Date Line are from a set of four lists. The names are used one after another, no matter the year. The next four names are: * * * * == Season effects == This is a table of all storms which have formed in the 2023 Pacific hurricane season. All damage figures are in 2023 USD. == References == Category:Pacific hurricane seasons Category:2023 in weather",
 "title": "2023 Pacific hurricane season"
}