{
 "id": "1029809",
 "text": "Andrea Victoria Aguilera Paredes (born April 27, 2001) is an Ecuadorian model and beauty pageant titleholder who was crowned Miss Supranational 2023 pageant in Nowy Sącz, Poland. She was previously crowned Miss Grand Ecuador 2021, and represented Ecuador at the Miss Grand International 2021 pageant where she finished first runner-up. == Early life and education == Aguilera was born in Ventanas, Ecuador on April 27, 2001. She was studying medicine at the University of Guayaquil in Guayaquil. In 2022, she entered the Universidad de Especialidades Espíritu Santo in Guayaquil to pursue a bachelor’s degree in international business. In the same year, she joined the Ecuadorian reality show Soy el Mejor but left the show early after three judges made derogatory comments about her participation in Miss Grand International. In 2022, Aguilera entered the Universidad de Especialidades Espíritu Santo in Guayaquil to pursue a bachelor’s degree in international business. == Pageantry == === Miss Grand Ecuador 2021 === On May 7, 2021, Aguilera was officially crowned Miss Grand Los Rios 2021. On June 26, 2021, she represented Los Rios at Miss Grand Ecuador 2021 at TC Televisión in Guayaquil, Ecuador and went on to win the title. === Miss Grand International 2021 === On December 4, 2021, Aguilera represented Ecuador at Miss Grand International 2021 and competed against 59 other candidates at the SHOW DC Retail and Entertainment Mega Complex in Bangkok, Thailand and placed as 1st runner-up to Nguyen Thúc Thuy Tiên of Vietnam. === Miss Supranational 2023 === On July 14, 2023, Aguilera also represented Ecuador at the Miss Supranational 2023 pageant in Nowy Sącz, Poland. In the competition, Aguilera advanced to the top twenty-four, then the top twelve and ultimately the top five, before being announced as the competition's winner and was succeeded by Lalela Mswane of South Africa. Aguilera became the first woman from Ecuador to be crowned Miss Supranational. ==References== ==Other websites== * Category:2001 births Category:Living people Category:Models (profession) Category:Beauty pageant winners",
 "title": "Andrea Aguilera (model)"
}