{
 "id": "102986",
 "text": "Yves Chauvin (10 October 1930 - 28 January 2015) was a French chemist, born in Menen, Belgium. He was awarded a Nobel Prize in Chemistry in 2005. He was the honorary research director at the Institut français du pétrole and a member of the French Academy of Science. Chauvin received his degree from the Lyon's School of Chemistry, Physics and Electronics in 1954. He was awarded the 2005 Nobel Prize in Chemistry, along with Robert H. Grubbs and Richard R. Schrock, for his work from the early 1970s on olefin metathesis. Chauvin was embarrassed to receive his award and at first did not want to accept it . In the end, he accepted the award from the King of Sweden and gave a big speech . == Publications == * A. Martinato, Y. Chauvin, G. Lefebvre, Kinetic aspects of the \"period of adjustment\" during polymerization (of propylene) with titanium trichloride-triethylaluminium, Compt. Rend. 1964, 258(17), 4271-4273. * M. Uchino, Y. Chauvin, G. Lefebvre, Dimerization of propylene by nickel complexes, Compt. Rend. C 1967, 265(2), 103-106. * J. L. Herisson, Y. Chauvin, Catalysis of olefin transformations by tungsten complexes. II. Telomerization of cyclic olefins in the presence of acyclic olefins, Makromol. Chem. 1971, 141, 161-176. (Dieser Artikel wird aufgrund eines typographischen Fehlers in der Orginalpublikation gelegentlich mit 1970 als Jahr der Veröffentlichung zitiert.) * Y. Chauvin, B. Gilbert, I. Guibard, Catalytic dimerization of alkenes by nickel complexes in organochloroaluminate molten salts, Chem. Comm. 1990, 23, 1715-1716. * L. Magna, G. P. Niccolai, Y. Chauvin, J.-M. Basset, The importance of imidazolium substituents in the use of imidazolium based room temperature ionic liquids as solvents for palladium catalyzed telomerization of butadiene with methanol, Organometallics 2003, 22(22), 4418 – 4425. == Other websites == * Details about his Nobel Prize * General information about the Nobel Prize 2005 * Yves Chauvin's U.S. Patents * Information relating to recent work in the CNRS CPE-Lyon laboratory * Yves Chauvin Nobel Lecture, December 8, 2005 Category:1930 births Category:2015 deaths Category:French chemists Category:French Nobel Prize winners Category:People from West Flanders",
 "title": "Yves Chauvin"
}