{
 "id": "1029511",
 "text": "Charline Avenel (b, 24 May 1978) is a French official. She was the head of the Versailles Academy from 24 October 2018Conseil des ministres du mercredi 24 octobre 2018 to 13 July 2023. She started her career at the Ministry of Economy and Finance (2004-2007), as assistant to the head of the education and higher education office.MESR > les nouveaux membres du cabinet In 2008, she was nominated advisor to Valérie Pécresse, Minister of Higher Education and Research, then assistant Director of her cabinet.CHARLINE AVENEL She was then assistant chief of staff to Minister Laurent Wauquiez at the same ministry. From 2012 to 2013, she was assistant Director of the French agency for Research. In 2013, she was appointed Secretary General of the National Foundation for Political Science, which oversees the Sciences Po, by Frédéric Mion. She remained in this position for 5 years. She worked on various topics.“CAMPUS 2022 : UNE QUALITÉ DE VIE ET D’ÉTUDES EXCEPTIONNELLE” She also created “Sciences Mômes”,Parents et enfants réunis sur les bancs de Sciences Po pour la journée de la parentalité an operation created in order to opeg the doors of the institution to the children of employees. She took up the theme of gender equality by creating the first anti-harassment unit at Sciences Po. A decree on October 24, 2018 appointed her Head of the Academy of Versailles. It is the largest academy in France with 1,200,000 students and 100,000 staff. She replace the retiring Daniel Filâtre. Décret du 24 octobre 2018 portant nomination de la rectrice de l'académie de Versailles - Mme AVENEL (Charline) She left her job in July 2023 to join the private higher education group Ionis.La rectrice de Versailles rejoint un groupe privé d’enseignement supérieur Charline Avenel studied at Sciences Po and the École nationale d'administration.Arrêté du 9 avril 2004 portant affectation aux carrières des élèves de la promotion 2002-2004 « Léopold Sédar Senghor » de l'Ecole nationale d'administration ayant terminé leur scolarité au mois de mars 2004, élèves issus des concours externe, interne et troisième concours == Recognition == * Commander of the Ordre des Palmes académiquesDécret n°55-1323 du 4 octobre 1955 portant institution d'un ordre des Palmes académiques. * Officier of the Ordre des Arts et des LettresNomination dans l'ordre des Arts et des Lettres – hiver 2021 == References == Category:1978 births Category:Living people Category:Alumni of the Institut d'études politiques de Paris Category:French academics",
 "title": "Charline Avenel"
}