{
 "id": "1030954",
 "text": "Raorchestes is a genus of frogs. This genus is in the subfamily Rhacophorinae. These frogs live in the mountains in China and other parts of Asia. Scientists say Raorchestes is a sister taxon of Pseudophilautus. Scientists started using this genus in 2010. Before that, the frogs now in Raorchestes had been in Ixalus (which scientists do not use now), Philautus, and Pseudophilautus. The genus is named for C. R. Narayan Rao. He worked on Indian batrachology. The part of the name, orchestes, is from the name of an older genus, Orchestes Tschudi 1838. Scientists have gone to the Western Ghat Mountains in India to look for these frogs, and they say there are even more species than people think. Scientists believe that the fact that groups of Western Ghat mountains are far from each other caused these frogs to become so many different species. ==Description== Most frogs in Raorchestes move around at night instead of during the day. They are small frogs. The adult frog is from nose to rear end. They do not have vomerine teeth in their jaws. Male frogs have a large vocal sac that they use to sing for female frogs. The skin of the vocal sack is transparent--the human eye can see through it. All species in Raorchestes grow from frogs into eggs in direct development: they do not swim as tadpoles. Raorchestes tinniens eggs hatch in 36 days, but it can be longer or shorter depending n how hot or cold it is. Different frogs in the same species can look very different from each other because they can be different colors. Species of the genus Raorchestes also have different variations in their iris and pupil coloration. This makes it difficult for scientists to tell species apart and where they live. People call the frogs in Raorchestes \"bush frogs\" in English. All of them live in trees except for Raorchestes resplendens. It lives on the ground high in the mountains, on Anamudi. == Distribution == One group of frogs live in the mountains in southern India (in the Western Ghats and Eastern Ghats). Others live in northeastern India to Nepal, Myanmar, Thailand, and Laos to southern China and Vietnam and Peninsular Malaysia. Many species live in the Western Ghats of India. Only eight species live in southeast Asia and China. == Conservation == The IUCN has looked at 38 species of Raorchestes. Many are Critically Endangered. Scientists thought Raorchestes travancoricus was extinct, but they found more in 2004. Of the 38 speices, eight are data deficient and 23 are in the critically endangered, endangered, and vulnerable Red List groups. The Amphibian Specialist Group's list of \"lost frogs\" (frogs not seen for decades) includes 10 Raorchestes species. There are not enough data or detailed studies about these frogs. Many of the frogs live in only a few places and can only live in places where the habitat is just right. Several species in Raorchestes live in protected areas. ==Species== Scientists have found many more species in India since 2000. The following species are in the genus Raorchestes:. ==References== Category:Frogs of Asia",
 "title": "Raorchestes"
}