{
 "id": "1030386",
 "text": "The 2024 Northern Territory general election was held on 24 August 2024 to elect all 25 members of the Northern Territory Legislative Assembly. It was conducted by the Northern Territory Electoral Commission. The incumbent Labor government, led by Chief Minister Eva Lawler, tried to win a third term in government. However, they were defeated by the Country Liberal Party, led by Lia Finocchiaro, in a landslide. It was the second-worst defeat of a sitting government in Northern Territory history, and Labor got its lowest ever vote share at a Northern Territory election. The CLP vote increased by a lot in the three main cities of Darwin, Palmerston and Alice Springs, as well as in the nearby rural areas and in major towns like Katherine, Nhulunbuy and Tennant Creek, while Labor did better in a lot of remote Aboriginal communities. Labor lost all of its urban seat, including Lawler's own seat of Drysdale in Palmerston to the CLP's Clinton Howe and her predecessor Natasha Fyles' seat of Nightcliff in Darwin (which used to be the safest Labor seat in the Northern Territory) to the Greens' Kat McNamara. Both leaders were women and both represented seats in Palmerston (Finocchiaro was once the member for Lawler's seat of Drysdale before changing to her current seat of Spillett). In remote Aboriginal communities, there was a big decrease in turnout. Some say this was because of the heavy defeat of the 2023 Australian Indigenous Voice referendum, while others said it was because they were tired of voting for so many things so often and because people did not want to vote, even though everyone over 18 in Australia has to vote or else they have to pay a fine for not voting.https://www.abc.net.au/news/2024-08-27/nt-election-remote-voter- turnout-linked-to-voice-referendum/104269394 ==Notes== ==References== Category:2024 elections in Australia Category:Elections in the Northern Territory Category:21st century in the Northern Territory",
 "title": "2024 Northern Territory general election"
}