{
 "id": "1030280",
 "text": "The corona of glans penis or penis crown is the rounded edge or flare that forms at the base of the glans (which is the end of the penis) in human males. The glans, and therefore the corona, are exposed (seen) when the foreskin (or prepuce) of the penis is pulled back (retracted.) The appearance of the glans penis is often slightly different between an uncircumcised and a circumcised male. A circumcised male has had the foreskin shortened or removed. This is a very common procedure (medical operation) done in many cultures or countries. It is often done shortly after birth. If the foreskin is completely removed, the corona will always be exposed. If the foreskin is just shortened, the corona may still be covered by the foreskin when it is in the forward (unretracted) position. The corona overhangs a mucosal surface, called the neck of the penis, which separates the shaft (the long middle part of the penis) and the glans. The edge of the corona has a great number of nerve endings and is a very sexually sensitive part of the glans. == Anatomy == === Development === During the embryonic development of the male fetus, a thickening on the epidermis (outer layer of skin) appears around the base of the developing glans. The thickening layer of skin separates from the glans, creating the foreskin. === Vascularization === The corona and the neck are highly vascularized areas of the penis. The axial and dorsal penile arteries merge together at the neck before entering the glans. === Blood supply === The corona and the neck are highly vascularized areas of the penis, meaning they have many blood vessels providing a good blood supply. === Nerve endings === The circumference (edge) and the underside of the corona are densely innervated by several types of nerve endings. The corona is a highly erogenous (easily sexually stimulated) part of the penis. The area is very sensitive to stimulation and an area of intense sexual pleasure. Category:Penis == Penile papules == In some males, small skin-colored bumps, known as pearly penile papules, may appear at the circumference of the corona. Their appearance may vary from being hardly noticeable in some men to get more prominent and well- defined in others. The papules are painless, harmless and non sexually transmitted. They usually appear in late puberty and are thought to disappear with age.[13] Even though they do not require treatment, they can easily be removed, especially for aesthetic purposes.[14]",
 "title": "Corona of glans penis"
}