{
 "id": "103083",
 "text": "Most Haunted Live is a British paranormal television program based on investigating possible paranormal activity. It is shown on the satellite and cable channels Living, Living2 and Virgin 1 (Formerly Ftn), mainly for the UK market. It is the Live version of Most Haunted which is going into its 10th series on February 19, 2008. It is made by Antix Productions, and is led by Yvette Fielding and her husband Karl Beattie. ==Production== The team's latest series leads them to travel to Italy, Turin. Investigating possible paranormal 'hotspots' for 24 hours witihn the city. ==Episodes (Satan's City)== Night Place 26th March '08 San Pietro in Vincoli 27th March '08 Lucedio church & priest's house 28th March '08 Lucedio Monastary 29th March '08 Pietro Micca tunnels 30th March '08 Moncaleiri Castle ==Team (Satan's City)== Investigators Name Function Paranormal Status Yvette Fielding Exec. Producer/Presenter Open- minded sceptic Karl Beattie Director/Producer Sceptic Ciaran O'Keeffe Parapsychologist Open-minded sceptic Brian Shepherd Medium and psychic artist Open Patrick Matthews Medium Very much a believer... since I talk to spirits everyday Cath Howe Make-up Artist Sceptic Stuart Torevell Lighting Rigger Believer Iain Cash (A.K.A. Wigan) Camera Operator Open-minded Sceptic Geoff Adams Director of Photography Open-minded Presenters Name Function Paranormal Status Paul Ross Presenter Open-minded Julian Clegg Interactive Host Open-minded Lesley Smith Historian Open-minded ==Related pages== *List of Most Haunted episodes *Most Haunted == References == ==Other websites== * The Official Most Haunted Live Homepage * The Official Most Haunted Homepage * Antix Productions - Production company for Most Haunted * The Official Site and Forum for Karl Beattie * The Official Fansite and Forum for David Wells * Most Haunted blog Offers an alternative view on Most Haunted Category:British reality television series Category:English-language television programs",
 "title": "Most Haunted Live!"
}