{
 "id": "103027",
 "text": "Charles III (Charles Philip Arthur George; born 14 November 1948) is the Head of the Commonwealth and the King of the United Kingdom and 14 other countries since 2022.. Moreover, Charles is next in line for the British Throne, direct successor and heir of Queen Elizabeth II. Prince of Wales' biography He was Prince of Wales between 1958 and 2022. ==Early life== King Charles III was born at Buckingham Palace in London. He is the first son of Elizabeth II and Prince Philip of Greece and Denmark. He is the grandson of George VI of the United Kingdom and Queen Elizabeth The Queen Mother. He was baptised at Buckingham Palace. Charles went to school at Gordonstoun and to university at Trinity College, Cambridge. He became the first British royal heir to earn a university degree.Prince Charles, Cambridge B.A. (With Honors)Prince Charles Fast Facts == Prince of Wales == Charles was officially made the Prince of Wales in 1958. As Prince of Wales, Charles fulfilled many public engagements and charity work, such as creating the Prince's Trust. He has also spent time in the Royal Air Force. He has spent a lot of time advocating for the prevention of climate change. As the heir to the throne, Charles also represented his mother on numerous occasions, such as the independence days of Fiji, the Bahamas, Papua New Guinea, Zimbabwe and Brunei, as well as the day Hong Kong was given back to China. In 2021, Prince Charles attended the celebration of Barbados becoming a republic and removing Queen Elizabeth as their leader. It was the first time that a British royal attended the transition of a Commonwealth realm in a republic. ==Reign== ===Accession=== Charles became king on 8 September 2022, after the death of his mother, Queen Elizabeth II. Holding the titles Prince of Wales, Duke of Cornwall, and Duke of Rothesay, Charles was the longest-serving British heir apparent, passing Edward VII's record on 20 April 2011. When he became monarch at the age of 73, he was the oldest person to do so. In an announcement after the death of Queen Elizabeth II, Prime Minister Liz Truss called Charles \"King Charles III\". This was the first time anyone had used that name officially. soon after Clarence House confirmed that he would use the regnal name \"Charles III\". When a British monarch becomes king or queen, they are allowed to change their name if they want to. For example, Charles' grandfather changed his name from \"Albert\" to \"George\", and he was \"King George VI\". ===Coronation=== Charles' coronation took place at Westminster Abbey on 6 May 2023. HM Queen consort Camilla was crowned at the same occasion. Charles' eldest son William, Prince of Wales attended and was the only noble to swear allegiance to The King. ==Personal life== He was married to his first wife, Diana, Princess of Wales, from 1981 until they divorced in 1996. They had two sons, Prince William and Prince Harry. Charles and Diana's divorce attracted a lot of media coverage and attention. Charles has been married to his second wife, Camilla, Queen Consort formerly the Duchess of Cornwall, since 2005. On 25 March 2020, Charles tested positive for COVID-19. On 5 February 2024, it was announced by Buckingham Palace that Charles had been diagnosed with cancer. == Titles == * 14 November 1948-6 February 1952: His Royal Highness Prince Charles Philip Arthur George of Edinburgh * 6 February 1952-9 September 2022: His Royal Highness The Duke of Cornwall, His Royal Highness Duke of Rothesay, His Royal Highness The Earl of Carrick, Baron of Renfrew, Lord of the Isles * 26 July 1958- 9 September 2022: Royal Highness The Prince of Wales, His Royal Highness The Earl of Chester * 9 April 2021-10 March 2023: His Royal Highness The Duke of Edinburgh, His Royal Highness The Earl of Merioneth, Baron of Greenwich * 8 September 2022: His Majesty The King ==Notes== ==References== ==Other websites== * Official website of HRH The Prince of Wales * Official Duchy of Cornwall Cottages website * Official website of 'The Prince's Trust' * Category:House of Windsor Category:Princes and Princesses of Wales Category:Knights of the Garter Category:Order of Merit Category:Royalty from London Category:Members of the Privy Council of the United Kingdom Category:1948 births Category:Living people Category:21st-century British monarchs Category:Monarchs of the United Kingdom Category:Heads of state of Canada",
 "title": "Charles III"
}