{
 "id": "1031323",
 "text": "Mads Bidstrup (born 25 February 2001) is a Danish footballer. He plays as midfielder for Austrian Bundesliga club Red Bull Salzburg. ==Career== Bidstrup began his career in the youth systems at Herfølge, Brøndby and Copenhagen. In January 2018, he moved to German club RB Leipzig. Bidstrup was a part of the RB Leipzig U19 team which reached the 2019 DFB-Pokal Junior Final and despite having three years remaining on his contract, he left the club in July 2020 and went to Brentford F.C.. After returning to fitness after a injury Bidstrup made his B team debut in a match versus a Stevenage XI on 14 February 2021 and three days later, he was called for the first team squad for a league match versus West London rivals Queens Park Rangers. He remained an unused substitute during the 2–1 defeat and was there after a regular inclusion on the bench. Bidstrup moved on loan to thr Danish Superliga club FC Nordsjælland until the end of the 2021–22 season. He signed a new two-year contract during the 2022 off-season. Bidstrup stayed with Nordsjælland on loan for the 2022–23season. He became club's Player of the Year award. On 17 July 2023 Bidstrup went to Austrian Bundesliga club Red Bull Salzburg and signed a five- year contract. ==International career== Bidstrup made 31 matches and scored one goal for Denmark on U16 to U21 level. ==Honours== Brentford *EFL Championship play-offs: 2021 Individual * FC Nordsjælland Player of the Year: 2022–23 ==Career statistics== Appearances and goals by club, season and competition Club Season League National cup League cup Europe Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Brentford 2020–21 Championship 4 0 0 0 0 0 ― 2Appearances in Championship play-offs 0 6 0 2021–22 Premier League 4 0 1 0 3 0 ― ― 8 0 Total 8 0 1 0 3 0 ― 2 0 14 0 Nordsjælland (loan) 2021–22 Danish Superliga 13 0 ― ― ― ― 13 0 Nordsjælland (loan) 2022–23 Danish Superliga 30 0 4 0 ― ― ― 34 0 Total 43 0 4 0 ― ― ― 57 0 Red Bull Salzburg 2023–24 Austrian Bundesliga 0 0 0 0 ― 0 0 ― 0 0 Career total 51 0 5 0 3 0 0 0 2 0 61 0 ==References== ==Other websites== * Category:2001 births Category:Living people Category:Association football midfielders Category:Premier League players Category:Brentford F.C. players Category:FC Red Bull Salzburg players",
 "title": "Mads Bidstrup"
}