{
 "id": "1031026",
 "text": "A polygenic score is a concept in genetics. It is a number which adds up different aspects of a person as shown by their genetics. Bear in mind that is is now possible to have a very complete sequence of a person's genetic material (roughly, genes). Polygenic scores are usually created from large scientific studies that look at the DNA of many people. These are called genome-wide association studies (GWASs). They can find out how important certain variants are. \"Effect\" is the name for the importance of a variant. Polygenic scores are made by adding up the effects of a large number of genetic variants. These genetic variants are known as alleles or SNPs. It is used to estimate how likely a person is to have a trait or disease. It suggests how likely a person is to, for example, suffer a disease or disability as a result of their genetics. A polygenic score is the effect of many genetic variants on a trait. Polygenic scores can also tell how much of a trait or disease someone will have. Polygenic scores can be used in adult humans. Polygenic scores are also sometimes used to decide if embryos are likely to have a disease. == Uses == Polygenic scores can make prediction of disease better. They help to know who will get the disease. Polygenic scores tell something new about a person's risk for a disease. This means that polygenic scores can be useful even if there are other already known risks. For example, a risk for lung cancer is smoking and a risk for heart disease is obesity. Some risks for diseases are only possible to know later in someone's life. However, polygenic scores can be made at the very beginning of someone's life. This way, polygenic scores can help to know someone's risk for disease earlier on. Some people have polygenic scores that say they are at high risk for a disease. These people can be helped earlier so they are less likely to get a disease. Polygenic scores are very useful for diseases involving the heart, or blood. Some of the names of these diseases are coronary artery disease (plaque in the heart), hypertension (high blood pressure), atrial fibrillation (not-normal heartbeat), cerebrovascular disease (problems with blood in the brain). This means polygenic scores may be useful in diseases related to the heart, or diseases related to metabolism (how the body uses food). Polygenic scores can help find people who are at risk of coronary artery disease (plaque staying inside the arteries near the heart) even if their family members don't have it. Hyperlipidemia is when there are too many fats in the blood. It is a condition that happens when there is a lot of cholesterol and triglycerides (lipids) in someone's blood. Polygenic scores can help to know a person's risk of getting hyperlipidemia. Polygenic scores might also help a doctor treat a person who already has hyperlipidemia. Someone who has family members with hyperlipidemia has less risk of getting hyperlipidemia if their polygenic score says that they have low risk. ADHD is a disorder where someone has hyperactivity or issues with attention. There are polygenic scores for ADHD. These scores are related to if someone will be diagnosed with ADHD. These scores are also related to how severe their ADHD is. Polygenic scores for ADHD might help find which children have ADHD earlier in their lives. Polygenic scores are good at predicting if someone will get Alzheimer's disease or not. Polygenic scores for Alzheimer's disease can help determine if the hippocampus, a part of the brain, will get smaller. Some polygenic scores tell about, or predict, cognitive ability and how many years someone has gone to school. Some other polygenic scores have been made, such as for schizophrenia, depression, bipolar disorder, neuroticism, externalizing behaviors, extraversion, and anxiety. Polygenic scores are used commonly in animal breeding and plant breeding. They help improve livestock and crops. Polygenic scores are also used to see if embryos are at risk of developing various diseases. This lets parents choose the baby that will be the healthiest. == Making polygenic scores == Polygenic scores are made by finding lots of people who have a disease, and lots of people who do not. The DNA of these people is studied. Scientists see if DNA variations happen more in the people with the disease, or happen less in the people with the disease. This figures out which DNA variations, or genes, are important. Because some of these DNA variations are more important than others, the more important DNA variations affect the polygenic score more. Often, very big groups of people are used to make polygenic scores. One of these big groups of people is the UK Biobank. Populations sometimes have different frequencies of genes. Before making a polygenic score, the data is changed so that genes that are different between populations will not affect the results. Scientists can use different ways of making polygenic scores more accurate. They choose to not use very correlated DNA variations that are close together, to avoid counting the same DNA variation twice. They can include only the DNA variations that they are sure of, or they can include even DNA variations that they are not sure of. They can use machine learning to do this better. They can also use DNA variations about traits related to the trait or disease that they are studying, in order to have more data. == References == Category:Genetics Category:Medical procedures",
 "title": "Polygenic score"
}