{
 "id": "1031896",
 "text": "Oppenheimer is a 2023 epic biographical thriller movie written and directed by Christopher Nolan. It is based on the 2005 biography American Prometheus by Kai Bird and Martin J. Sherwin. The movie is about the life of J. Robert Oppenheimer, a theoretical physicist who helped create the first nuclear weapons as part of the Manhattan Project. It was released on July 21, 2023 to positive reviews. With $975 million at the box office, Oppenheimer is the highest-grossing biographical movie of all time, beating Bohemian Rhapsody (2018). The movie has won multiple awards including five Golden Globe Awards and seven at the 77th British Academy Film Awards, including Best Film. It is nominated for 13 categories at the 96th Academy Awards, which includes the Best Picture category. At the 96th Academy Awards, Oppenheimer would win seven awards including Best Picture. ==Background== Cillian Murphy plays Oppenheimer, with Emily Blunt as Oppenheimer's wife, Katherine \"Kitty\" Oppenheimer, Matt Damon as General Leslie Groves, Oppenheimer's military handler, Robert Downey Jr. as Lewis Strauss, a senior member of the United States Atomic Energy Commission, and Florence Pugh as psychiatrist and Oppenheimer's mistress Jean Tatlock. Other members of the supporting cast include Josh Hartnett, Casey Affleck, Rami Malek, Kenneth Branagh, Benny Safdie, Jason Clarke, Dylan Arnold, Gustaf Skarsgård, David Krumholtz, Matthew Modine and Tom Conti. ==Cast== * Cillian Murphy as J. Robert Oppenheimer, a theoretical physicist and director of the Los Alamos National Laboratory. * Emily Blunt as Katherine \"Kitty\" Oppenheimer, Robert Oppenheimer's wife and a former Communist Party USA member. * Matt Damon as Gen. Leslie Groves, a USACE officer and director of the Manhattan Project. * Robert Downey Jr. as Lewis Strauss, a high-ranking member of the U.S. Atomic Energy Commission. * Florence Pugh as Jean Tatlock, a psychiatrist, Communist Party USA member, and Robert Oppenheimer's romantic interest. * Josh Hartnett as Ernest Lawrence, a Nobel-winning nuclear physicist who worked with Oppenheimer at the University of California, Berkeley. * Casey Affleck as Boris Pash, a U.S. Army military intelligence officer and commander of the Alsos Mission. * Rami Malek as David L. Hill, a nuclear physicist at the Met Lab, who helped to create the Chicago Pile. * Kenneth Branagh as Niels Bohr, a Nobel-winning physicist, philosopher and Oppenheimer's personal idol. * Benny Safdie as Edward Teller, a theoretical physicist known for being the \"father of the hydrogen bomb. * Jason Clarke as Roger Robb, a U.S circuit judge who was a special counsel at Oppenheimer’s security hearing. * Dylan Arnold as Frank Oppenheimer, Robert’s younger brother and a particle physicist who worked on the Manhattan Project. * Gustaf Skarsgård as Hans Bethe, a German-American Nobel-winning theoretical physicist and the head of the Theoretical Division at Los Alamos. * David Krumholtz as Isidor Isaac Rabi, a Nobel Prize-winning physicist who worked as a consultant on the Manhattan Project. * Matthew Modine as Vannevar Bush, head of the Office of Scientific Research and Development. * Tom Conti as Albert Einstein, Nobel-winning theoretical physicist known for developing the theory of relativity. * David Dastmalchian as William L. Borden, a lawyer and executive director of the JCAE. * Michael Angarano as Robert Serber, a physicist who worked on the Manhattan Project. * Jack Quaid as Richard Feynman, a Nobel-winning theoretical physicist who worked in the Theoretical Division at Los Alamos. * Josh Peck as Kenneth Bainbridge, a physicist who was the director of the Manhattan Project’s Trinity nuclear test. * Olivia Thirlby as Lilli Hornig, a Czech-American scientist who worked on the Manhattan Project. * Dane DeHaan as Maj Gen. Kenneth Nichols, a U.S Army officer and the deputy district engineer of the Manhattan Project. * Danny Deferrari as Enrico Fermi, a Nobel-winning physicist and creator of the Chicago Pile. * Alden Ehrenreich as a Senate aide to Lewis Strauss, a fictional character who is an aide during Strauss’ nomination for United States Secretary of Commerce. * Jefferson Hall as Haakon Chevalier, a Berkeley professor who became friends with Oppenheimer at university. * James D'Arcy as Patrick Blackett, Oppenheimer’s college professor and Nobel-winning physicist at Cambridge University. * Tony Goldwyn as Gordon Gray, a government official and chairman of the committee deciding the revoking of Oppenheimer security clearance. * Devon Bostick as Seth Neddermeyer, a physicist who discovered the muon and advocated for the implosion-type nuclear weapon used in the Trinity Test. * Alex Wolff as Luis Walter Alvarez, a Nobel-winning physicist who worked on the Manhattan Project. * Josh Zuckerman as Giovanni Rossi Lomanitz, a physicist who became Oppenheimer’s protégé at Berkeley. * Matthias Schweighöfer as Werner Heisenberg, a German Nobel Prize-winning physicist who worked in the country's nuclear weapons program during World War II. * Christopher Denham as Klaus Fuchs, a German-born physicist and communist spy who worked on the Manhattan Project. * David Rysdahl as Donald Hornig, a chemist who worked on the firing unit at Los Alamos. * Guy Burnet as George Eltenton, a chemical engineer in the US with ties to the Soviet Union. * Louise Lombard as Ruth Tolman, a psychologist close to Oppenheimer during the development of the atomic bomb. * Tom Jenkins as Richard C. Tolman, Ruth's husband and General Groves' chief scientific adviser on the Manhattan Project * Harrison Gilbertson as Philip Morrison, a physics professor who worked on the Manhattan Project. * Emma Dumont as Jackie Oppenheimer, Frank’s wife and Robert’s sister-in-law. * Trond Fausa Aurvåg as George Kistiakowsky, a Harvard professor who took part in the Manhattan Project. * Olli Haaskivi as Edward Condon, a nuclear physicist who helped with the development of radar and briefly took part in the Manhattan Project. * Gary Oldman as Harry S. Truman, the 33rd President of the United States. * Macon Blair as Lloyd K. Garrison, a lawyer who helped to represent Oppenheimer at his security clearance hearing. * Harry Groener as Sen. Gale W. McGee * James Remar as Henry L. Stimson, Secretary of War under President Truman. * Gregory Jbara as Sen. Warren Magnuson, Chairman, Senate Commerce Committee * Tim DeKay as Sen. John Pastore * James Urbaniak as Kurt Gödel, a mathematician known for his theorems that revolutionized mathematics and had far-reaching implications for philosophy and computer science. ==Release== Oppenheimer premiered at Le Grand Rex in Paris on July 11, 2023, and was released in the United States and United Kingdom on July 21, by Universal Pictures. It is Nolan's first movie not to be distributed by Warner Bros. Pictures domestically or internationally since Memento (2000). The movie had strong positive reviews with a 93% on Rotten Tomatoes. The movie was released on the same day as Barbie, a fantasy comedy movie directed by Greta Gerwig. Since the two movies have completely different tones and genres, many social media users have taken to making memes about how the two movies represent different audiences, and how they should be seen as a double feature. The trend has been called \"Barbenheimer\". ==References== ==Other websites== * * * Category:2023 movies Category:2020s biographical movies Category:2023 thriller movies Category:2020s war movies Category:American epic movies Category:American biographical movies Category:American thriller movies Category:Movies set in New Mexico Category:Movies set in California Category:Movies produced by Charles Roven Category:Movies directed by Christopher Nolan Category:Universal Pictures movies Category:IMAX movies Category:2020s English-language movies Category:British biographical movies Category:Movies about nuclear war and weapons Category:Movies about scientists Category:Nonlinear narrative movies Category:Golden Globe Award winning movies Category:BAFTA Award winning movies Category:Movies composed by Ludwig Göransson Category:Best Picture Oscar",
 "title": "Oppenheimer (movie)"
}