{
 "id": "1031927",
 "text": "Yoshi's Cookie is a 1992 tile-matching puzzle video game. It was developed by Tose and published by Nintendo for the NES and the Game Boy in 1992. A version for the Super NES was released in 1993. That version was developed and published by Bullet-Proof Software. ==Gameplay== Yoshi's Cookie is a tile- matching video game. The player is given a playing field with a lot of cookies on it. The cookies are in a rectangular grid. The player controls a cursor on the grid. The cursor is used to rotate rows or columns, like on a Rubik's Cube. To win, the player has to get rid of all of the cookies. The player must match entire rows or columns to make sure that only one type of cookie is in that row or column. When all of the cookies in a row or column match, those cookies are removed from the grid. The grid gets bigger as new cookies come in through the top and right sides of the playing field. A game over occurs when the grid overflows. ===Game modes=== Yoshi's Cookie has different game modes. In the single-player Action Mode, the player finishes a set of levels that slowly get harder. In the multiplayer VS Mode, two players fight each other using a split-screen. The Super NES version has a single-player VS Mode in which the player fights a computer player. ==Release== Yoshi's Cookie was first released in Japan on November 21, 1992 for the Nintendo Entertainment System (NES) and Game Boy. It was released in North America in April 1993. It was released in Europe on April 28, 1994. The Super NES version was released in June 1993 in North America. It was released on July 9, 1993, in Japan. It was released in Europe in the same year. ===Yoshi no Cookie: Kuruppon Oven de Cookie=== National, a brand of Panasonic, released 500 copies of a special limited edition of Yoshi's Cookie for the Super Famicom. They were titled . The game works with a special device called the Kuruppon Oven to teach the player to make real versions of the cookies in the game. A copy of this edition in 2010 was worth at ¥157,500 (equivalent to US$1, 924 in 2010). ===Remake and emulation=== Yoshi's Cookie was remade in the Nintendo Puzzle Collection for the GameCube. It released in Japan on February 7, 2003. The collection also contained the NES emulated version on the disc. That version could be moved to the Game Boy Advance using the GameCube – Game Boy Advance link cable. The NES version was also re-released for the Wii's Virtual Console service on April 4, 2008, in Europe and Australia. It was re-released on April 7, 2008, in North America. It was re-released on June 10, 2008, in Japan, and November 11, 2008, in South Korea. It was removed from the service on October 11, 2013, in Japan and Europe. In North America, it was removed from the service on October 18, 2013. ==Related pages== *Yoshi (video game) *Tetris Attack ==Notes== ==References== Category:1992 video games Category:Game Boy games Category:Multiplayer and single-player video games Category:Nintendo Entertainment System games Category:Puzzle video games Category:Super Nintendo Entertainment System games Category:Video games about food and drink Category:Video games developed in Japan Category:Yoshi games",
 "title": "Yoshi's Cookie"
}