{
 "id": "1032925",
 "text": "Ariadina Alves Borges, also known as Ary Borges, is a Brazilian football player. She plays as a forward for the National Women's Soccer League club called Racing Louisville FC and also represents the Brazil women's national team. == Club Career == Ary Borges was born in São Luís, Maranhão, Brazil, but she moved to São Paulo when she was ten years old. There, she joined the youth team of Santos FC, and she was one of the three girls who played alongside the boys. Her father signed a document to protect the club from legal action if she got injured while playing with the boys. When she was 11, she switched to Centro Olímpico and played in the girls' under-15 team because there was no under-13 team available. In 2017 and 2018, Ary Borges went back to her hometown in the Northeast Region of Brazil to play professional football with Sport Recife. After that, she joined São Paulo, which had just been re-formed, in 2019. She played a crucial role in helping the team get promoted to the Campeonato Brasileiro de Futebol Feminino Série A1 (the top league for women's football in Brazil). She showed her support for the club on social media and even had a birthday party themed after São Paulo FC. However, she left the club after one year to join rivals Palmeiras, as they offered her a better contract. In December 2022, Ary Borges signed with an American club called Racing Louisville FC. == International Career == Ary Borges also played for the Brazil women's national under-20 football team in the 2018 South American U-20 Women's Championship and the 2018 FIFA U-20 Women's World Cup. She received her first call-up to the senior Brazil women's national football team in September 2020. Another substitute appearance against the same opponents followed three days later, The coach, Pia Sundhage, selected her for a training camp at Nova Granja Comary, which included only home-based players due to the COVID-19 pandemic in Brazil. Ary made her first appearance for the senior national team as a substitute in a friendly match against Argentina on 17th September 2021, replacing Debinha in the 63rd minute. She continued to be part of the team for more friendly matches, including ones against Australia in Sydney. Ary scored her first two goals for the national team in a match against India at the 2021 International Women's Football Tournament of Manaus, which was also the farewell appearance of Formiga, a well-known Brazilian footballer. On 24th July 2023, Ary scored three goals (a hat trick) in Brazil's 4-0 victory against Panama in their opening game of the World Cup. ==References== Category:1999 births Category:Living people Category:Footballers from Maranhão",
 "title": "Ary Borges"
}