{
 "id": "1032457",
 "text": "A skimmer or surface separator (separates a substance from the surface of a liquid), is an essential accessory for the maintenance and cleaning of the water in a swimming pool . It is used to remove all the surface dirt floating on the water surface, such as leaves, tanning oil and human secretions. These impurities remain suspended on the surface, affect the appearance of the water and are not always removed by the conventional vacuuming process. The skimmer is installed directly in the surface water suction system and also has the function of controlling the water level to prevent accidental overflows. Weir Type Oil Skimmers In the United States and Portugal, the use of skimmers in the construction of swimming pools is mandatory, regulated and standardized by competent bodies. == Drainage opening == Typically, a skimmer draws water from the pool through a rectangular opening in the wall, at the top of the pool, connected through a device installed in one (or more) walls of the pool. The internal parts of the skimmer are accessed from the pool deck through a circular or rectangular cover, approximately one foot in diameter. If the pool's water pump is operational, it draws water from the pool through a hinged floating chute (which operates from a vertical position at a 90-degree angle to the pool, to prevent leaves and debris from being washed back into the pool by wave action), and down into a removable \"skimmer basket\", whose purpose is to catch leaves, dead insects and other larger floating debris. == Types == There are different types of skimmers that can be used for different purposes. The most common types of skimmers include: * Manual Skimmers: These are basic skimmers that consist of a strong net strung on the end of a long pole. They are used to remove waste and pollutants from the surface of the water. * Automatic Skimmers: These are the most common variety of skimmers and the one you will most likely see running in any given pool. They are installed at surface level and are designed to remove debris and contaminants from the surface of the water. * Standalone Skimmers: These skimmers are designed to be used in conjunction with a pump and filter system. They are installed at surface level and are designed to remove debris and contaminants from the surface of the water == Oil and grease on the surface == The density of fresh water is 1,000 kilograms per cubic meter, while the density of seawater varies between 1,020 and 1,030 kilograms per cubic meter. Oil is less dense than fresh water and seawater, so it floats in both types of water, but due to the difference in density the oil and fat particles, dispersed in the water, will reach the surface more quickly in a saltwater or seawater pool, being in both cases, \"the only possible means\" to remove them, to recirculate the water surface through skimmers . == References == == Other websites == * * Category:Spa towns Category:Water infrastructure",
 "title": "Skimmer (spa)"
}