{
 "id": "1032388",
 "text": "Love Island is a British reality television series. It is a revival of an earlier show Celebrity Love Island, but this time the contestants were normal people. It began in 2015 and is currently hosted by Maya Jama. Previous hosts include Caroline Flack and Laura Whitmore. The show is about group of contestants, referred to as Islanders, living in a villa on an island, constantly under video surveillance. On the first day, the Islanders couple up for the first time based on first impressions, but over the duration of the series they must \"re-couple\" or choose to remain with their current partner. Any Islander who remains single after the re-coupling is eliminated from the game. Islanders can also be eliminated by the public vote. Sometimes, the Islanders will have to choose which one of them will be leaving. In the final, the public vote towards which couple they want to win the series and therefore take home £50,000. The series has had very mixed reviews. It is one of the UK's most popular reality TV shows. However, the show has also received criticism from many people for potentially making viewers feel insecure about their bodies. There is also worry about the impacts contestants may face from appearing on the show. Several contestants have become famous after appearing on the show, including Molly-Mae Hague, Ekin-Su Cülcüloğlu, Laura Anderson, Wes Nelson and Gemma Owen. == Overview == Year Series Location Winners Islanders Days Episodes Average viewers (Millions) 2015 1 Mallorca Jess Hayes Max Morley 23 41 29 0.57 2016 2 Cara De La Hoyde Nathan Massey 26 45 37 1.47 2017 3 Amber Davies Kem Cetinay 32 52 43 2.52 2018 4 Dani Dyer Jack Fincham 38 59 49 3.96 2019 5 Amber Gill & Greg O'Shea 36 58 5.61 2020 6 Cape Town Finn Tapp Paige Turley 32 44 36 3.96 2021 7 Mallorca Liam Reardon Millie Court 37 58 49 4.17 2022 8 Davide Sanclimenti Ekin-Su Cülcüloğlu 36 4.46 2023 9 Franschhoek Kai Fagan Sanam Harrinanan 35 TBA 10 Mallorca TBA 32 TBA Category:British reality television series",
 "title": "Love Island (2015 TV series)"
}