{
 "id": "1032213",
 "text": "The Eurovision Dance Contest was an international ballroom dancing competition which was organised by the European Broadcasting Union and the World DanceSport Federation. == Format == Each country had one pair of dancers, each pair performing a dance in which the cultures of the individual countries could be showcased to the rest of Europe. In addition to being judged by a panel of dance experts, European audiences could cast their vote for their favourite couple via telephone or text messaging to determine winner of the competition. == 2007 Contest == The Eurovision Dance Contest 2007 was hosted in London, United Kingdom. Each couple performed two 1 minute 30 seconds dances: the first dance was a ballroom or Latin dance while the second was a freestyle dance. The event was hosted by Graham Norton and Claudia Winkleman. The viewers from each country (except for Greece, who used a jury) were able to vote for their favorite entries. The ten favorite entries from each countries televote were given a set of points, with 12 points going to the most voted entry and 1 point going to the 10th. === Participants === R/O Country Dancers Dance Styles Points Place Dance 1 Dance 2 01 Switzerland Denise Biellmann and Sven Ninnemann Paso Doble Swing 0 16th 02 Russia Mariya Sittel and Vladislav Borodinov Rumba Paso Doble 72 7th 03 Netherlands Alexandra Matteman and Redmond Valk Cha-Cha-Cha Rumba 34 12th 04 United Kingdom Camilla Dallerup and Brendan Cole Rumba Freestyle 18 15th 05 Austria Kelly and Andy Kainz Jive Paso Doble 74 5th 06 Germany Wolke Hegenbarth and Oliver Seefeldt Samba Freestyle 59 8th 07 Greece Ourania Kolliou and Spiros Pavlidis Jive Sirtaki 31 13th 08 Lithuania Gabrielė Valiukaitė and Gintaras Svistunavičius Paso Doble Traditional Lithuanian Folk Dance 35 11th 09 Spain Amagoya Benlloch and Abraham Martinez Cha-Cha-Cha Paso Doble 38 10th 10 Ireland Nicola Byrne and Mick Donegan Jive Fandango 95 3rd 11 Poland Katarzyna Cichopek and Marcin Hakiel Cha-Cha-Cha Showdance 84 4th 12 Denmark Mette Skou Elkjær and David Jørgensen Rumba Showdance 38 9th 13 Portugal Sónia Araújo and Ricardo Silva Jive Tango 74 6th 14 Ukraine Yulia Okropiridze and Illya Sydorenko Quickstep Showdance 121 2nd 15 Sweden Cecilia Ehrling and Martin Lidberg Paso Doble Disco Fusion 23 14th 16 Finland Katja Koukkula and Jussi Väänänen Rumba Paso Doble 132 1st == 2008 Contest == The Eurovision Dance Contest 2008 was held in Glasgow, United Kingdom. Both Graham Norton and Claudia Winkleman returned as the hosts. All pairs had to include one professional and one celebrity dancer. Only one, 2 minute dance, was performed by each couple. A professional jury was introduced to the competition having approximate weight of 20% of the outcome, while the remaining 80% came from televoting. The jurors consisted of four experts from non-participating countries: Singapore, France, Germany and Slovenia. === Participants === R/O Country Competing dancers Dance styles Points Place 01 Sweden Danny Saucedo and Jeanette Carlsson Cha-Cha-Cha 38 12th 02 Austria Dorian Steidl and Nicole Kuntner Slowfox/Jive/Hip-Hop 29 13th 03 Denmark Patrick Spiegelberg and Katja Svensson Samba/Tango/Paso Doble/Jazz Dance 102 6th 04 Azerbaijan Eldar Dzhafarov and Anna Sazhina Paso Doble/Rumba/Tango/Azeri Folk Dance 106 5th 05 Ireland Gavin Ó Fearraigh and Dearbhla Lennon Paso Doble/Rumba/Hard Shoe Irish Dance 40 11th 06 Finland Maria Lund and Mikko Ahti Tango 44 10th 07 Netherlands Thomas Berge and Roemjana De Haan Rumba/Show Dance 1 14th 08 Lithuania Karina Krysko and Saulius Skambinas Rumba/Cha-Cha/Acrobatic Elements 110 4th 09 United Kingdom Louisa Lytton and Vincent Simone Paso Doble/Jive/Tango 47 9th 10 Russia Tatiana Navka and Alexander Litvinenko Cha- Cha/Samba/Rumba/Paso Doble/Russian Folk Dance 121 2nd 11 Greece Jason Roditis and Tonia Kosovich Latin dances 72 7th 12 Portugal Raquel Tavares and João Tiago Rumba/Tango 61 8th 13 Poland Edyta Herbuś and Marcin Mroczek Rumba/Cha- Cha/Jazz Dance 154 1st 14 Ukraine Lilia Podkopayeva and Sergey Kostetskiy Jive/Ukrainian Folk Dance/Rock'n'Roll 119 3rd Category:2007 establishments in Europe",
 "title": "Eurovision Dance Contest"
}