{
 "id": "1033213",
 "text": "Lewis Lichtenstein Strauss (January 31, 1896January 21, 1974) was an American businessman, philanthropist and naval officer. He was one of the original members of the U.S. Atomic Energy Commission (AEC). In the 1950s he was the chairman of the commission. Strauss was a major figure in the creation of nuclear weapons after World War II, nuclear energy policy, and nuclear power in the United States. ==Early Life== Lewis Lichtenstein Strauss was born in Virginia in 1896. His parents were Ashkenazi Jews. When he was a child, Strauss was interested in physics. He wanted to become a scientist but sold shoes instead. In World War One, Strauss worked for Herbert Hoover. He also helped Hoover try to become President of the United States of America in the 1920s. After Strauss's mother died of cancer, he met Leó Szilárd because he wanted to learn if radiation could be used to cure cancer. ==Career== In the 1930s, Strauss joined many American Jewish groups. He helped raised money to help Jewish refugees come to the United States to save them from the Nazis. Strauss also joined the United States Navy in the Second World War . In the Navy, he helped make weapons. After the war, President Harry S Truman hired Strauss to lead the Atomic Energy Commission. Strauss told Truman to develop a hydrogen bomb because the Soviet Union had an atomic bomb but Dr. Robert Oppenheimer thought he should not have done that. ==Political Career== After Dwight Eisenhower became president, Lewis Strauss called J. Edgar Hoover and told him that Robert Oppenheimer was a Communist. The FBI then tried to decide if Oppenheimer were a spy for the Soviet Union. Many of Oppenheimer’s friends said that Strauss was unfair to Oppenheimer. President Eisenhower wanted to make Strauss the Secretary of Commerce but the United States Senate did not approve of this choice. One of the reasons was because people were angry about Oppenheimer. It is because of Strauss's role in Oppenheimer's security clearance being removed, many historians have seen him as a villain in American history.Pfau, No Sacrifice Too Great, pp. 169–170.Young, \"Strauss and the Writing of Nuclear History\", p. 4.Young and Schilling, Super Bomb, p. 144. The main reason why he had Oppenheimer's clearance removed was because of a personal vendetta against him. Strauss's failed confirmation was the first time that a United States Cabinet nominee failed to be confirmed since 1925 and the eighth overall. Senators who voted against Strauss's nomination included future U.S. presidents John F. Kennedy and Lyndon B. Johnson. ==Later life and Death== In 1962, Strauss wrote a book called Men and Decisions. In the 1970s, Strauss got sick with lymphosarcoma. He died in 1974. Strauss was buried in a Jewish cemetery in Virginia. ==In popular culture== Phil Brown played Strauss for the television program Oppenheimer. Robert Downey Jr. played Strauss in the movie Oppenheimer. ==References== Category:1896 births Category:1974 deaths Category:Businesspeople from West Virginia Category:American bankers Category:Military people from West Virginia Category:American Jews Category:People from Charleston, West Virginia",
 "title": "Lewis Strauss"
}