{
 "id": "1033175",
 "text": "Atrial fibrillation is when the heart beats in a fast and irregular way that is not normal. During atrial fibrillation (AF) it is the upper chambers of the heart that beat in an abnormal way. AF may not have any symptoms and the patient may not notice that it is happening at all. It often begins as short periods of abnormal beating, which then become longer or start to happen all the time. It may also start as other forms of arrhythmia such as atrial flutter that then become AF. Episodes with symptoms may involve heart palpitations, fainting, light-headedness (dizziness), shortness of breath, or pains in the chest. AF is may cause an increased risk of heart failure, dementia, and stroke. Although the causes of AF are not exactly known it is associated with heart disease, high blood pressure, obesity, COPD, being older, sleep apnoea, excess alcohol intake, tobacco smoking, diabetes mellitus, and thyrotoxicosis. About 50% of AF cases are not associated with these risk factors. Doctors might suspect AF after feeling the pulse and then order an ECG to confirm the diagnosis. Atrial fibrillation is the most common serious abnormal heart rhythm and, as of 2020, affects more than 33 million people worldwide. Treatment of AF includes medications to slow the heart rate to a near-normal range (known as rate control) or to convert the rhythm (beating pattern) to normal sinus rhythm (known as rhythm control). A treatment called electrical cardioversion can convert AF to normal heart beats and is often necessary for emergency use. A form of surgery called cardiac ablation (burning away part of the heart) may be done to treat AF. A healthy lifestyle may also be prescribed by health-care professionals. For those at low risk of stroke, AF does not always require blood-thinning though some healthcare providers may prescribe aspirin or other anti-clotting medication. For those at medium or high risk doctors will generally recommend an anti- clotting medication such as warfarin and other oral anticoagulants. Most people are at a higher risk of getting stroke and while these medications reduce stroke risk, they increase rates of major bleeding. Category:Heart disease",
 "title": "Atrial fibrillation"
}