{
 "id": "1033396",
 "text": "The Royal Marines are a group of soldiers in the United Kingdom that are deployed from sea to the land. Marines are specially trained in operating from landing craft, boarding ships at sea, and attacking a wide range of enemies. == History == The first British Marine unit was formed in 1664 after King Charles II ordered a regiment of soldiers trained to operate at sea to be raised. They were called the Admiral’s Regiment. Marines were important due to the expansion of the British Empire. By 1740, 10 sea service regiments were active however regiments often only lasted short amounts of time because they were raised when they were necessary to serve during wars. As well as boarding ships, Marines would be tasked to attack enemy coastal positions. In 1746 the 10 Marine regiments were brought together to form a corps and were placed under command of the Admiralty. After taking part in many battles on land and at sea, such as the Battle of Trafalgar, the Marines were awarded the “Royal” title by King George III, so they are now called the “Royal Marines”. By 1900 there were about 18,800 Royal Marines, 15,000 Light Infantry and 4,000 Artillery. During the First World War, the Marines numbers increased to 55,000. They took place in a variety of battles and won 5 Victoria Crosses. During the beginning of the Second World War Marines were trained to defend ports however, due to a shortage of army units trained to take place in raids, Royal Marines were trained in this role. These Marines were trained in a variety of skills such as fighting in buildings and rock climbing. 17,000 Marines took place in D-Day. Since the end of WW2 Royal Marines have served in many conflicts including the Korean War, the Falklands War and Afghanistan. == Structure == The Royal Marines are structured into Battalions called “Commandos”, Companies called “Squadrons” and Platoons called “Troops”. Royal Marine Commando Units are supported by Specialist Army Commando Units. The Royal Marines are currently structured as follows: * 3 Commando Brigade ** 40 Commando ** 42 Commando ** 43 Commando ** 45 Commando ** 47 Commando (Raiding Group) ** 30 Commando (Information Exploitation Group) ** Commando Logistic Regiment * Royal Marine Band Service ** RM Band Collingwood ** RM Band Lympstone ** RM Band Plymouth ** RM Band Portsmouth ** RM Band Scotland ** RM School of Music * Special Boat Service ==References== Category:Military of the United Kingdom",
 "title": "Royal Marines"
}