{
 "id": "1033739",
 "text": "Jharrel Jerome (born October 9, 1997) is an American television and film actor. He has starred in various TV series such as Mr. Mercedes (2017–2019), When They See Us (2019), I'm a Virgo (2023) and Full Circle (2023). He has also starred in the films Moonlight (2016), First Match (2018), Selah and the Spades (2019) and Concrete Cowboy (2020). == Biography == Jerome was born and raised in The Bronx, New York City. His parents are Dominican. He attended and graduated from Fiorello H. LaGuardia High School and commuted to Manhattan each day by train. Shortly after Jerome enrolled as an undergraduate at Ithaca College, he was cast in his first professional acting role in the 2016 independent film Moonlight, as young Kevin. == Filmography == === Film === Year Title Role Notes 2016 Her Coloring Book Artist Short film 2016 Wheels Narrator Short film 2016 Moonlight Teen Kevin Austin Film Critics Association Special Honorary Award for Best Ensemble Gotham Special Jury Award – Ensemble Performance Independent Spirit Robert Altman Award MTV Movie Award for Best Kiss Nominated–Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture 2018 Monster Osvaldo Cruz 2018 First Match Omari Credited as Jharrel A. Jerome 2019 Selah and the Spades Maxxie 2019 Robu Rob Short film 2020 Concrete Cowboy Smush 2023 Spider-Man: Across the Spider-Verse Miles G. Morales / Prowler (Earth-42) Voice 2024 Unstoppable Anthony Robles Filming === Television === Year Title Role Notes 2017 Tales Deacon Episode: \"Children's Story\" 2017–2019 Mr. Mercedes Jerome Robinson Main role 2019 When They See Us Korey Wise Lead role Black Reel Award for Outstanding Actor, TV Movie or Limited Series Critics' Choice Television Award for Best Actor in a Movie/Miniseries NAACP Image Award for Outstanding Actor in a Television Movie, Limited-Series or Dramatic Special Primetime Emmy Award for Outstanding Lead Actor in a Limited Series or Movie Nominated—Satellite Award for Best Actor – Miniseries or Television Film Nominated—Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Miniseries or Television Movie 2019 Live in Front of a Studio Audience Jimmy Pearson Episode: \"All in the Family and Good Times\" 2023 I'm a Virgo Cootie Lead role; also executive producer 2023 Full Circle Aked Miniseries ==References== ==Other websites== * Category:1997 births Category:Living people Category:American television actors Category:American movie actors Category:American voice actors",
 "title": "Jharrel Jerome"
}