{
 "id": "1033226",
 "text": "\"Dance the Night\" is a song by British and Albanian singer Dua Lipa from Barbie: The Album, the soundtrack of the movie Barbie (2023). Atlantic and Warner Records released it as the soundtrack's first song on 25 May 2023. ==Background== A disco song that has cello, violin, viola, strings, and bass in its music, \"Dance the Night\" is about dancing throughout the night despite a lot of sadness. Before signing on to produce the Barbie soundtrack, producer Mark Ronson received a text from his friend George Drakoulias that simply stated, \"Barbie?\" Before production, director Greta Gerwig needed a disco song that would be the main song of a dance scene in the movie, so she sent Ronson a playlist of what she was looking for. Ronson and colleague Andrew Wyatt created a track that Gerwig loved and used for dance rehearsals. This song would later become \"Dance the Night\". \"Dance the Night\" is two minutes and 56 seconds long. In the chorus, Lipa sings the lyrics: \"Watch me dance the night away / My heart could be burnin' but you won't see it on my face / Watch me dance, dance the night away / I still keep the party running\". She compares the tears streaming down her face while she cries to diamonds. ==Music video== The music video for \"Dance the Night\" was released alongside the song. It features a cameo appearance of Barbie director Greta Gerwig, and clips from the movie featuring Margot Robbie, Issa Rae, Emma Mackey, and other cast members. The video has a pink set, and Lipa learns new choreography in it after discovering a disco ball that had been ordered for the shoot has fallen to the ground. She dances atop a huge Barbie heel, and the cameos happen during a disco party, after which Gerwig leaves her director's chair to support Lipa's performance and question the events that led up to the disco ball being destroyed. Fans said that the smashed disco ball was a symbolism of the end of Lipa's Future Nostalgia era. This theory was supported by Ronson in an interview with Vulture. ==Reception== On 28 May 2023, Billboard listeners voted \"Dance the Night\" as their favorite new release of the week. At the end of the year, Billboard named the song the 15th best song of the year. Official Charts Company said the song sounded like a return \"to the disco-soaked sonics of Future Nostalgia...with a plastic sheen, of course\". == References == Category:2023 songs Category:Dua Lipa songs",
 "title": "Dance the Night"
}