{
 "id": "1033297",
 "text": "EA Sports FC 24 (FC24 or EA FC24) is a new football video game made by Electronic Arts (EA), a game developer. It's the first game in the EA Sports FC series after EA's partnership with FIFA ended. The game is being developed by EA Sports and will be released worldwide on 29th September 2023. It will be available for Nintendo Switch, PlayStation 4, PlayStation 5, Windows, Xbox One, and Xbox Series X/S. The special version of the game, called the Ultimate Edition, has a cover with more than 30 famous players from different parts of the world. These players come from top football leagues like the Premier League, La Liga, Ligue 1, and Bundesliga. Some of the well-known players featured on the cover include Vinícius Júnior, Sam Kerr, Virgil van Dijk, Son Heung-min, Erling Haaland, Zinedine Zidane, Pelé, and David Beckham. == Licenses == On May 10, 2022, EA Sports and FIFA announced that their agreement to work together would end on December 31, 2022. They had been working together for a long time. But they decided to extend the agreement for one more year to release FIFA 23, the latest version of the football video game. Starting in 2023, EA Sports will change the name of their football video game franchise from FIFA to EA Sports FC. However, even with the new name, the game will still have permission to use the names and likenesses of more than 19,000 players, over 700 teams, more than 100 stadiums, and more than 30 leagues. They will also add new licenses for Spain's Liga F and Germany's Frauen- Bundesliga. Meanwhile, FIFA has plans to collaborate with a different video game company. They want to create a game with the FIFA name that they believe will be the only authentic one. In EA Sports FC 24, players will also get to experience the licensed Ballon d'Or for the first time in the game's history. == New features added == New players have been added including Female football players , new ‘’heroes’’ and ‘’icons\". New heroes like Carlos Tevez , Bixente Lizarazu, Ludovic Giuly, Enzo Francescoli and icons like Mia Hamm, Franck Ribéry, Kelly Smith, Zico. == Sales == EA Sports FC 24 reached 11.3 million players in its first week. It was the best-selling video game for physical children in the UK in the two weeks after its release. == References == Category:2023 video games Category:Association football video games Category:Nintendo Switch games Category:PlayStation 4 games Category:PlayStation 5 games Category:Windows games Category:Xbox One games Category:Xbox Series X and Series S games",
 "title": "EA Sports FC 24"
}