{
 "id": "1033168",
 "text": "Baku State University (BSU) () is a public university located in Baku, Azerbaijan. Established on 1 September 1919 by the Parliament of Azerbaijan Democratic Republic, the university started with faculties of history, philology, physics, mathematics, law and medicine, with an initial enrollment of 1,094 students. The first rector of BSU was Vasili Razumovsky, a former professor of surgery at Kazan University. == History == In 1930, the government of the Azerbaijan Soviet Socialist Republic ordered the university shut down in accordance with a reorganization of higher education. Then the university was replaced with the Supreme Pedagogical Institute. However, in 1934, the university was reestablished again and continued to work through the difficult years of World War II experiencing a shortage of faculty members. By its 40th anniversary in 1959, the university already had 13 faculties. The Azerbaijan Medical University and Azerbaijan State Economic University were both spun-offs of the medicine and economy faculties at BSU. Among the graduates of BSU were two former presidents of Azerbaijan, Abulfaz Elchibey and Heydar Aliyev. Elchibey graduated from the Faculty of Arabic Language and Literature, while Aliyev, who dominated Azerbaijan's political life for over 30 years, from the Faculty of History. Nobel Prize-winning physicist Lev Landau studied at BSU between 1922 and 1924. BSU is the only university from Azerbaijan ranked by international ranking organizations, such as University Ranking by Academic Performance and currently ranks at 1872 in the University Ranking by Academic Performance. == Related pages == * List of universities in Baku == References == == Other websites == *Official website Category:Technical colleges and universities in Azerbaijan Category:Buildings and structures in Baku Category:20th-century establishments in Azerbaijan Category:1919 establishments in Asia Category:1919 establishments in Europe",
 "title": "Baku State University"
}