{
 "id": "1033348",
 "text": "Gary Francis Poste (November 8, 1937 - August 23, 2018) was an American painter. He is suspected to be the Zodiac Killer. In 2021, a group known as the \"Case Breakers\", consisting of former police officers, forensic analysts, and retired military investigators, stated publicly that it had identified Poste as a suspect in the killings. The FBI has officially declared the case to be \"open and ongoing.\" == Early life == Gary Francis Poste was born on November 8, 1937 to his father Glenn Poste and his mother Elva Marie Robinson Poste. He had two siblings. At a young age, Poste joined the Air Force. == Personal life == Poste married a woman named Mary sometime in the 1970s. They had one child. When Poste was 20 years old, he was involved in a car accident. He was working at an Air Force radar station near Rockville, Indiana at the time. The accident occurred when Poste was riding as a passenger in a Jeep that crashed into a railroad tunnel wall, resulting in the driver's death. Poste's forehead bore significant scarring, resulting from the severe skull and brain injuries he sustained. Afterwards, he had to undergo the removal of all his teeth. After the recovery, Poste was shipped out to a radar station in Greenland, known to some as one of the “loneliest and most isolated” bases in the world. Poste allegedly instructed a group of young men on the process of transforming pipe bombs into explosive devices intended for house demolition. In 2016, Poste was arrested for domestic violence. The arrest came after he allegedly pushed his wife down the stairs. He was placed in Toulumne County Jail and charged with the crime. Poste was later found not to be mentally capable to stand trial for the crime and was put in the California State Hospital. == Death == Poste died on August 23, 2018, according to his death certificate, his passing was attributed to sepsis, septic shock, dysphagia, and vascular dementia. His remains were scattered in the Sierra Mountains. Before his passing, he had given his weapons, pistol components, gunpowder, bullets, and over a thousand shell casings of various calibers, to his \"favorite\" individuals. == References == Category:1937 births Category:2018 deaths Category:American criminals",
 "title": "Gary Francis Poste"
}