{
 "id": "1034270",
 "text": "The following is a list of notable deaths in July 2000. Entries for each day are listed _alphabetically_ by surname. A typical entry lists information in the following sequence: * Name, age, country of citizenship at birth, subsequent country of citizenship (if applicable), reason for notability, cause of death (if known), and reference. ==July 2000== ===1=== *Burt Douglas, 69, American film, stage and television actor. *Raymond Robert Forster, 78, New Zealand arachnologist and museum director. *John Albert Axel Gibson, 83, British flying ace during World War II. *Steve Hokuf, 89, American football player and coach, stroke. *Begum Om Habibeh Aga Khan, 94, fourth wife of Sir Sultan Muhammad Shah. *Cub Koda, 51, American rock and roll musician and record compiler, kidney failure. *Ganju Lama, 75, Sikkimese Gurkha and recipient of the Victoria Cross. *Walter Matthau, 79, American actor (winner of Academy Award for Best Supporting Actor, BAFTA, Golden Globe and Tony awards), heart attack. *Pierre Petit, 78, French composer. ===2=== *Mina Aoe, 59, Japanese female enka singer, pancreatic cancer. *Joey Dunlop, 48, Northern Irish motorcycle racer, motorcycle accident. *Constance Howard, 89, English textile artist and embroiderer. *Paul McLaughlin, 80, Canadian sailor and Olympian. *Karl Sweetan, 57, American gridiron footballplayer, complications following surgery. *Georgi Tringov, 63, Bulgarian chess grandmaster. ===3=== *Walter Cassel, 90, American operatic baritone and actor. *Nancy Cato, 83, Australian writer and poet. *James Grogan, 68, American figure skater and Olympian, multiple organ failure. *André Guinier, 88, French physicist. *Michael Hamilton, 81, British politician. *Paul G. Hatfield, 72, American attorney and politician. *John Hejduk, 70, Czech-American architect, artist and educator. *Leonard Hilton, 52, American long-distance runner. *János Kamara, 73, Hungarian communist politician. *Enric Miralles, 45, Spanish architect, brain tumor, brain cancer. *Harold Nicholas, 79, American dancer (Nicholas Brothers), heart attack. *Fiorentino Sullo, 79, Italian politician. *Kemal Sunal, 55, Turkish actor, heart attack. ===4=== *Donald Blessing, 94, American rower and Olympic champion. *Jack T. Bradley, 82, US Army Air Force fighter ace during World War II. *Allan Fakir, 68, Pakistani folk singer. *Gustaw Herling-Grudziński, 81, Polish writer and political dissident. *Yuri Klinskikh, 35, Russian singer, songwriter and arranger, heart failure. *Marina Kroschina, 47, Ukrainian tennis player, suicide. *Philip Lever, 3rd Viscount Leverhulme, 85, British aristocrat. *Vladimír Ráž, 77, Czechoslovak film actor. *Shōji Ueda, 87, Japanese photographer. ===5=== *Franta Belsky, 79, Czech sculptor, prostate cancer. *Giovanni Bettinelli, 65, Italian racing cyclist. *Edgar Cardoso, 87, Portuguese civil engineer and university professor. *Mehrangiz Manoochehrian, 94, Iranian lawyer, musician and feminist. *Peter Bullfrog Moore, 68, Australian rugby league administrator, esophageal cancer. *Dorino Serafini, 90, Italian motorcycle road racer and racing driver. *Gloria Williams, 57, American singer, diabetes. *Joseph Wohlfart, 80, Luxembourgian politician. *Lord Woodbine, 71, Trinidadian calypsonian and music promoter, house fire. ===6=== *Roderic Coote, 85, British Anglican prelate. *Eric Fraser, 69, English rugby player. *Lazar Koliševski, 86, Yugoslav communist political leader. *Fred Lane, 24, American football player, shot. *Akira Miyazawa, 72, Japanese jazz saxophonist, clarinetist, and flautist. *Ľudovít Rajter, 93, Slovakian-Hungarian composer and conductor. *Władysław Szpilman, 88, Jewish-Polish pianist and Holocaust survivor portrayed in the 2002 film The Pianist. *Marcella Comès Winslow, 95, American photographer and portrait painter. ===7=== *Dame Stella Casey, 76, New Zealand social activist. *Kenny Irwin, 30, American stock car racing driver, racing accident. *Ursula Kuczynski, 93, German communist activist and spy. *James C. Quayle, 79, American newspaper publisher. *William J. Randall, 90, American politician. *Johann Urbanek, 89, Austrian football player. *Charles Alan Wright, 72, American constitutional lawyer. *Dmitry Alexandrovich Zavadsky, 27, Belarusian journalist, homicide. ===8=== *FM-2030, 69, Iranian-American author, transhumanist philosopher and futurist, pancreatic cancer. *Pieter Goemans, 75, Dutch composer (\"Aan de Amsterdamse grachten\"). *Anne Mueller, 69, British civil servant and academic, Parkinson's disease. *Maurice Owen, 76, English footballer. *Cliff Sear, 63, Welsh footballer, heart attack. ===9=== *Doug Fisher, 59, English actor, heart attack. *Henri Gault, 70, French food journalist, heart attack. *Herbert Hunger, 85, Austrian byzantinist. *Erkki Koiso, 66, Finnish ice hockey player. *John Morgan, 41, British etiquette expert, domestic accident. *Joe Sostilio, 85, American racing driver. *John Vitale, 34, American football player, cancer. ===10=== *Gertrud Arndt, 96, German photographer and designer. *Denis O'Conor Don, 87, English noble and hereditary Chief of the Name O'Conor. *Dick Glasser, 65, American singer, songwriter, and record producer, lung cancer. *Vakkom Majeed, 90, Indian politician. *Ursule Molinaro, French-American writer. *Bill Munson, 58, American gridiron football player, drowned. *Francisco Matos Paoli, 85, Puerto Rican poet, critic, and essayist. *Justin Pierce, 25, British skateboarder and actor (Kids, Next Friday), suicide. *Apostolos Vakalopoulos, 90, Greek historian. *Norma Wilson, 90, New Zealand athlete and Olympian. ===11=== *Bill Alexander, 90, British political activist. *Jaroslav Filip, 51, Slovak musician, composer, dramaturge, and actor, heart attack. *Pedro Mir, 87, Dominican poet and writer (Poet Laureate). *Robert Runcie, 78, British Archbishop of Canterbury, cancer. *Barry Tabobondung, 39, Canadian ice hockey player, traffic accident. ===12=== *Al Butler, 62, American basketball player, cancer. *Tom Galley, 84, English football player. *Charles Merritt, 91, Canadian war hero and recipient of the Victoria Cross. *Prince Tomislav of Yugoslavia, 72, Yugoslav prince. ===13=== *A. D. Hope, 92, Australian poet. *Dick Edgar Ibarra Grasso, 86, Argentine historian and researcher. *Jan Karski, 86, Polish resistance fighter and academic. *Mauno Rintanen, 75, Finnish football player and basketball player. *Indira Sant, 86, Marathi poet from Maharashtra, India. ===14=== *Bill Barth, 57, American blues guitarist, heart attack. *Finn-Egil Eckblad, 76, Norwegian mycologist. *Alvin Hollingsworth, 72, American painter and comics artist. *Meredith MacRae, 56, American actress (My Three Sons, Petticoat Junction), complications of brain cancer. *Georges Maranda, 68, Canadian baseball player, cancer. *Mark Oliphant, 98, Australian physicist, Governor of South Australia. *Pepo, 88, Chilean cartoonist. ===15=== *Paul Bühlmann, 73, Swiss comedian, radio personality, and actor. *Johnny Duncan, 67, American bluegrass musician. *Juan Filloy, 105, Argentine writer. *Jocko Henderson, 82, American radio disc jockey, and hip hop music pioneer, cancer. *Leo Hoegh, 92, U.S. Army officer, lawyer, and politician. *John O. Pastore, 93, American lawyer and politician, kidney failure. *Louis Quilico, 75, Canadian opera singer. *Kalle Svensson, 74, Swedish footballer. *Paul Young, 53, British singer and songwriter (Sad Café, Mike + The Mechanics), heart attack. ===16=== *Igor Domnikov, 41, Russian journalist and editor, murdered. *György Petri, 56, Hungarian poet, cancer. *Barbosa Lima Sobrinho, 103, Brazilian lawyer, writer, journalist and politician. *Jean Vercoutter, 89, French Egyptologist. *Bernie Whitebear, 62, American Indian activist, colon cancer. *William Foote Whyte, 86, American sociologist. ===17=== *Pascale Audret, 64, French actress, traffic collision. *Thomas Quinn Curtiss, 85, American writer, and film and theater critic. *Zhao Lirong, 72, Chinese singer and film actress, cancer. *Aligi Sassu, 88, Italian painter and sculptor. *Jean Swain, 76, American singer. *Berthe Villancher, 91, French gymnastics judge and official. ===18=== *René Chocat, 79, French basketball player. *Roberto Contreras, 71, American actor. *Paul Coverdell, 61, American politician, Senator from Georgia, cerebral hemorrhage. *John F. Davis, 93, American lawyer and law professor. *Enrique de Gandía, 94, Argentine historian and author. *Francisco Javier Sáenz de Oíza, 81, Spanish architect. *José Ángel Valente, 71, Spanish poet and essayist. ===19=== *James B. Clark, 92, American film and television director. *Stephen Gendin, 34, American AIDS activist, AIDS-induced lymphoma. *Kamala Das Gupta, 93, Indian freedom fighter. *Hananiah Harari, 87, American painter and illustrator. *Owen Maddock, 74, British engineer and racing car designer. *Tommy O'Boyle, 82, American football coach. *Allen Paulson, 78, American businessman. ===20=== *Eyvind Earle, 84, American artist, author and illustrator, esophageal cancer. *Joseph F. Enright, 89, American submarine commander. *James Hobson Morrison, 91, American politician (member of the United States House of Representatives), heart attack. *Béla Rajki, 91, Hungarian swimming coach and water polo coach. *Murray G. Ross, 90, Canadian sociologist, author, and academic administrator. *Mabel Scott, 85, American gospel music and R&B; vocalist. *Jim Suchecki, 72, American baseball player. *Alexis P. Vlasto, 84, British historian and philologist. *Malaclypse the Younger, 59, American author. ===21=== *Vladimir Bagirov, 63, Soviet-Latvian grandmaster of chess, chess author, and trainer, heart attack. *Constanze Engelbrecht, 50, German actress, cancer. *Iain Hamilton, 78, Scottish composer. *Maria Kleschar- Samokhvalova, 84, Soviet Russian painter and graphic artist. *Frank Miller, 73, Canadian politician, Premier of Ontario. *Vladimir Novikov, 92, Soviet- Russian politician and statesman. *Eddie Pequenino, 72, Argentine film actor. *Yosef Qafih, 82, Yemenite-Israeli zionist orthodox rabbi. *Oliver Henry Radkey, 91, American historian of Russian and Soviet history. *Stanojlo Rajičić, 89, Serbian composer and musicologist. *Marc Reisner, 51, American environmentalist and writer, colon cancer. *Åke Senning, 84, Swedish cardiac surgeon. *Yoshio Watanabe, 93, Japanese photographer. ===22=== *John Butterfield, Baron Butterfield, 80, British medical researcher and academic administrator. *Eric Christmas, 84, British actor. *Alexander Dallin, 76, American historian and political scientist. *Raymond Lemieux, 80, Canadian organic chemist. *Staffan Burenstam Linder, 68, Swedish economist and politician, lung cancer. *Claude Sautet, 76, French film director and screenwriter, liver cancer. *Archie W. Straiton, 92, American physicist. *Teleco, 86, Brazilian football player. ===23=== *Ralph Evans, 76, American competitive sailor and Olympic medalist. *Carmen Martín Gaite, 74, Spanish author. *Oiva Lommi, 78, Finnish rower and Olympic medalist. *Vittorio Mangano, 59, Italian mobster, cancer. *Kao Pao-shu, 61, Chinese actress, producer, writer and film director. *Mars Rafikov, 66, Soviet cosmonaut. *Ahmad Shamloo, 74, Iranian poet, writer and journalist. ===24=== *Anatoli Firsov, 59, Russian ice hockey player, heart attack. *Pierre Hardy, 92, French sport shooter and Olympic medalist. *Jim Kremer, 81, Luxembourgian football player. *Dharmasiri Senanayake, 67, Sri Lankan politician. *Oscar Shumsky, 83, American violinist and conductor. *G. Wood, 80, American film and television actor, congestive heart failure. ===25=== *Julia Pirotte, 92, Polish photojournalist. *Aleksander Rokosa, 64, Polish gymnast. *Fred C. Sheffey, 71, United States Army major general, lung cancer. *Elizabeth Wilson, 86, American screenwriter and playwright. * Notable people killed in the crash of Air France Flight 4590: **Rudi Faßnacht, 65, German football manager. **Christian Götz, 60, German trade unionist and politician. **Jean Marcot, 50, French first officer of Flight 4590. **Christian Marty, 54, French windsurfer and captain of Flight 4590. **Andreas Schranner, 64, German property magnate. ===26=== *Abhayadev, 87, Indian poet and lyricist. *U. R. Jeevarathinam, Tamil actress, singer and producer. *Dalkhan Khozhaev, 39, Chechen historian, field commander, brigadier general and author, murdered. *John Tukey, 85, American mathematician, infarction. *Don Weis, 78, American film and television director. ===27=== *Virginia Admiral, 85, American painter and poet. *Bruce Douglas-Mann, 73, British politician. *Val Dufour, 73, American actor, cancer. *Paddy Joyce, 77, Irish actor, stroke. *Vladimir Lisunov, 60, Russian nonconformist artist, murdered. *Constance Stuart Larrabee, 85, English photographer and war correspondent. *Gordon Solie, 71, American wrestling commentator, throat cancer. ===28=== *Jaime Cardriche, 32, American actor, complications during gall bladder surgery. *Leslie Martin, 91, English architect. *Abraham Pais, 82, Dutch-American physicist, cardiovascular disease. *Jonas M. Platt, 80, United States Marine Corps officer. *Jerome Smith, 47, American guitarist (KC and the Sunshine Band), accident. *Chic Stone, 77, American comic book artist. *John Wells, 93, British artist. ===29=== *Kobie Coetsee, 69, South African lawyer and politician, heart attack. *Eladio Dieste, 82, Uruguayan engineer. *René gerónimo favaloro, 77, Argentine cardiologist, suicide by gunshot. *Benny Fenton, 81, English football player and manager. *Åke Hodell, 81, Swedish fighter pilot, poet, author, text-sound composer, and artist. *Richard Kerry, 85, American Foreign Service officer and lawyer, prostate cancer.Associated Press, Richard Kerry, Father of Sen. John Kerry, Dies, Lewiston Sun-Journal, July 31, 2000 *Bobby Reid, 63, Scottish football player. *Bob Welch, 72, Canadian politician. ===30=== *Ab Box, 91, Canadian football player. *Jim Clark, 71, American gridiron football player. *Derek Hill, 83, English portrait and landscape painter. *Nan Leslie, 74, American actress, pneumonia. *Max Showalter, (aka Casey Adams), 83, American actor, composer, pianist, singer, cancer. *Jack Smiley, 77, American basketball player. ===31=== *István Gulyás, 68, Hungarian tennis player. *Lars Jansson, 73, Finnish author and cartoonist. *William Keepers Maxwell, Jr., 91, American novelist, short story writer, essayist and children's author. *Constance Babington Smith, 87, British journalist and writer. *Armando Trindade, 72, Pakistani prelate of the Roman Catholic Church. *Hendrik C. van de Hulst, 81, Dutch astronomer and mathematician. *Thomas Wolff, 46, American mathematician, car accident. == References == *7 Category:July 2000 events",
 "title": "Deaths in July 2000"
}