{
 "id": "1034451",
 "text": "A septic tank is an underground chamber made of concrete, fiberglass, or plastic through which sewage flows for basic sewage treatment. Settling and anaerobic digestion processes reduce solids and organic material. The treated liquid effluent is commonly disposed of in a septic drain field. This provides further treatment. Nonetheless, groundwater pollution may occur and can be a problem. The term \"septic\" refers to the anaerobic bacterial environment that develops in the tank that decomposes or mineralizes the waste discharged into the tank. Septic tanks can be coupled with other onsite wastewater treatment units such as biofilters or aerobic systems involving artificially forced aeration. ==Description== A septic tank has one or more concrete or plastic tanks between 4,500 and 7,500 liters (1,000 and 2,000 gallons). One end is connected to a pipe coming from a building and the other to a septic drain field. These pipe connections are made with a T-shaped pipe, allowing liquid to enter and exit without disturbing anything on the top of the water. New tanks usually have two chambers. Each has an access opening and cover and is separated by a dividing wall with openings located about midway between the floor and the roof of the tank. A septic system that is working correctly is odor-free. The tank only needs periodic inspection and emptying. Concrete, fiberglass, or plastic tanks often will last about 50 years. == Septic tank additives == Septic tank additives have been promoted by some manufacturers with the aim to improve the effluent quality from septic tanks, reduce sludge build-up, and reduce odors. These additives are usually expensive in the long term and fail to live up to expectations.Foxon, K., Still, D. (2012). \"Do pit additives work?\" Water Research Commission (WRC), University of Kwazulu-Natal, Partners in Development (PiD), South Africa It has been estimated that in the U.S. more than 1,200 septic system additives were available on the market in 2011. Very little peer-reviewed and replicated field research exists regarding the efficacy of these biological septic tank additives.S. Pradhan, Michael T. Hoover, G.H. Clark, M. Gumpertz, C. Cobb, J. Strock (2011) \"Impacts of biological additives; Part 2 Septic Tank Effluent Quality and Overall Additive Efficacy\" , Journal of Environmental Health, Volume 74, Number 5, p. 22–28 ==Environmental concerns== A properly maintained and installed septic tank has no higher amount of environmental problems than a cities sewage treatment plant., Problems could start with a septic tank in an unsuitable location, and septic tank failures are normally more expensive to fix or replace than city sewer. Since septic systems require large drainfields, they are not good for densely built areas. == Use == In the United States an 2007 American Housing Survey showed that about 20 percent of all homes have septic tanks and that most systems are in rural (50%) and suburban (47%) areas. Indianapolis is one example of a big city where a lot of the city's neighborhoods still have septic systems at every house. == Related pages == * Cesspit * Sanitation ==References== ==Other websites== * Septic Systems - U.S. Environmental Protection Agency Category:Waste management",
 "title": "Septic tank"
}