{
 "id": "1034568",
 "text": "When someone who is not yet an adult decides to end his or her own life, this is called youth suicide. In Western societies, there are many people who want to end their lives, and at least try to commit suicide. Suicide is the one of the leading cause of death amongst children, teens and young adults. Suicides attempts are more common among girls than boys. Many girls try, but boys more often succeed in committing suicide. Girls are more likely to use techniques such as overdoses and boys are more likely to try violent means like gunshot or hanging themselves. Between the 1960s and the 1980s, the number of youth suicides nearly tripled. In Australia for example, youth suicides are the leading cause of death in young people between 15 and 25. Only traffic accidents cause more deaths. In the U.S., according to the National Institute of Mental Health, the suicide rate is the 2nd leading cause of death for adolescents between the ages of 10 and 14, and the third leading cause of death for those between 15 and 19. In 2021, the American Academy of Pediatrics, the American Academy of ChiId and Adolescent Psychiatry, and the Children's Hospital Association released a joint statement announcing a mental health crisis among our youth. Emergency room visits for mental health issues have dramatically increased, especially after the COVID-19 pandemic. ==Warning signs of youth suicide== People thinking about suicide don't often tell others about it and there are not always ways to tell if someone if thinking bout killing themselves. Warning signs include: talking about death or about feeling trapped; withdrawing from talking to family, friends and community leaders such as school teachers and health professionals; increasing drug and alcohol use; doing dangerous things; giving away personal possessions; mental health problems such as hearing voices or seeing things that are not really there. Suicide is often lead by a change in mood or starting to self-harm. ==Cultural indications== Young people in highly developed countries are more likely to kill themselves than in poor or less-economically developed countries. In some cultures suicide is either unknown or mostly unknown. Forest and jungle tribes do not have significant problems with youth suicide and countries with people who are known for general happiness, such as Nepal, have less problems with suicide. == Suicide contagion == The Commission for Children and Young People and Child Guardian did a study in 2007. That study found that 39% of the young people committing suicide had lost someone who was important to them. The person they lost had also committed suicide. The commission calls this suicide contagion. It also recommends that young people and communities need to be protected against it. ==Risk factors== Suicide may be linked to many risk factors, including: mental health problems; committing self-harm; pressure from school or university; being bullied; not have lots of friends; poor family environment; pressure to succeed by parents and family deaths; cultural attitudes to suicide; problems with boyfriends or girlfriends; drug abuse; poor physical health or family neglect. The more risk factors a person has or if they go on for a long time add up to a greater chance of suicide. There are many teenagers who are at risk. One of the problems they have is to get psychiatric counselling when it is needed. A study done in 2020 shows that younger teens more often think that things such as cyberbullying and despair will drive people to commit suicide. One study says, \"In teenagers, depression is considered a major – if not the leading – cause of teen suicide.\" Other things that lead young people to commit suicide are academic pressure, drinking alcohol, or losing an important relationship. Changing the place where they live and losing friends when they move or changing places often and not making new friends, and families that are not able to support them also contribute. Harassment or abuse can make a teen commit suicide. Gay teens, and those unsure about their gender are more likley to commit suicide. Many of them have been bullied, harassed or abused. === Sexual minority youth and suicide === People who are part of sexual minorities often suffer from depression. To cope with depression, they often injure and harm themselves. 28% of the people in this group say that they had tried committing suicide, or thought about it. Lesbian and gay youth are the group most likely to face negative experiences. According to mental care professionals, they are more likely to develop suicidal thoughts . The same is the case for bisexual people: they are five times more likely to report suicidal thoughts and actions. People who are part of sexual minorities have a problem with drug abuse five times more often than heterosexual people of the same age group. Studies also found that these groups can be helped by reducing the bad image that is associated with being part of a sexual minorty. === Factors of influence === Factors such as being exposed to a suicide, having tried suicide in the past, and age impact the probablility of a young person committing suicide. Some researchers have found that someone who has seen a classmate commit suicide. They therefore thought that suicide may be contagious. They note how a child's exposure to suicide predicts ideas about suicide and attempts. A parent trying to commit suicide similarly has an influence: it will increase the chance of the adolescent of thinking about suicide by 3.5%, and the chance of trying to commit suicide by 2.6%. Another cause which can lead youngsters to a suicide attempt is that parents are violent at home. === Young people who lost loved ones === Suivcide prevention also focuses on helping those who survived a suicide attempt. Many attempted suicide, because they lost a person they loved or cared for. Helping them with their grief can help them in the long run. Many of them develop depression or anxiety disorders, and suicidal behaviour. 42% of the youth suicides are either because the person committing suicide lost a loved one, or they committed suicide because someone else did, too. == Epidemiology == People who have been sexually abused, or who have been faced with physical violence are likely to try to commit suicide. Two things that might affect suicide attempts are lifetime sexual abuse and adult physical violence. Among participants aged 18–25, the odds ratios for lifetime sexual abuse and adult physical violence are 4.27 and 3.85 . In other words, those who died by suicide are 327% more likely to have experienced lifetime sexual assault. Similarly, a suicide victim is 285% more likely to have suffered physical violence as an adult. Based on a survey done on American high school students, 16% reported considering suicide and 8% reported attempting suicide sometime within the year before taking the survey. Between 1980 and 1994, the suicide rates of young black males doubled. American Indians and Alaska Natives die by suicide at a higher rate than any other ethnic group in the United States. In India, one-third of suicides are young people 15–29. In 2002, 154,000 suicides were recorded in India. In the United States, about 60 percent of suicides are carried out with a gun. Some Aboriginal teens and gay or lesbian teens are at high risk, depending on their community and their own self-esteem. Several campaigns have been started to give them hope and help them to feel less isolated. The 2019 Youth Risk Behavior Survey, which was conducted by the CDC, found that between 2009 and 2018, suicide rates among adolescents aged 14-18 years increased by 61.7%. Furthermore, the CDC reported that in 2019, among American adolescents in grades 9 to12: * 18.8% of students reported seriously considering attempting suicide * 15.7% of students made a suicide plan * 8.9% of students attempted suicide ==Getting Help== There are many ways that a person thinking about suicide can get help. Firstly, it is important to talk about their feelings to someone they respect and trust. Just talking to someone else about their feelings can be a great source of help. Encouraging someone to talk to their family doctor or someone at school can be a way of getting help as all doctors and most teachers are trained to help people thinking about suicide. One can help prevent adolescent suicide by discouraging isolation, addressing a child's depression which is correlated with suicide, getting rid of any objects that a child could use to attempt suicide, and simply paying attention to what the child does or feels. Schools can also help educate people and prevent suicides. At that age, students spend most of their time at school. They either feel comfortable at school, or the school provides triggers for them to commit suicide. Their peer group also inflences how they feel and act. There are also websites either locally in their country or globally that can give advice to people thinking about killing themselves. Some websites are listed below; ===Help Just for Kids=== * Canada - Kids Help Phone - Phone:1-800-668-6868, Text:686868, Web:https://kidshelpphone.ca/ * UK - Childline - Phone:0800 1111, Web:https://www.childline.org.uk/ * Australia - Kids Helpline Phone:1800 55 1800, Web:https://kidshelpline.com.au/ * Belarus - For Children Phone:801-100-1611 * Czech Republic - For Children Phone:116 111, Web:https://www.linkabezpeci.cz * France - Young People (Fil santé jeunes) Phone: 0800 235 236 * Gibralter - Children Phone:8008, Web:https://childline.gi * Greece - National Helpline for Children Phone:1056, Web:https://www.hamogelo.gr/gr/en/sos-1056/ * Hungary - Blue Line Phone:116-111, Web:https://kek-vonal.hu/ * India - Childline Phone:1098 * Lithuania - Vaikų liniją (Childline) Phone:116 111, Web:https://www.vaikulinija.lt/ * Malaysia - Buddy Bear Phone:03-9779 5550, Web:https://www.humankind.my/buddybear-helpline * New Zealand - Youth line Phone:0800 376 633, Text 234, Web:https://www.youthline.co.nz/ == References == == Other websites == * Your Life Counts!, Canada * Suicide Prevention Lifeline, U.S. * The It Gets Better Project created by Dan Savage * Reducing Youth Suicide in Queensland * Report on early intervention programs aimed at preventing youth suicide Australia Category:Suicide",
 "title": "Youth suicide"
}