{
 "id": "1034338",
 "text": "Rao's bubble-nest frog, tinkling Nilgiri bush frog, tinkling Nilgiri bush frog, black bush frog, or spotted bush frog (Raorchestes tinniens) is a frog. It lives in southern India. Scientists have seen it between 1700 and 2000 meters above sea level. ==Habitat== This frog lives in grasslands. People have seen it on plants, on shola plants, and on the ground. People have seen this frog in gardens, but not in cities. People have seen this frog between 1780 and 2465 meters above sea level. ==Life cycle== Like other frogs in Raorchestes, this frog hatches out of its egg as a small frog and never swims as a tadpole. ==Threats== Scientists say this frog is in danger of dying out because it lives in such a small place. This frog is dying out because human beings change the places where it lives. People cut down forests to make farms for eucalyptus, wattle, and pine trees. People also cut down forests to build places to live and make places for cows to eat grass. Chemicals meant to kill pests and meant to kill weed plants can also kill this frog. Visitors to the hills can frighten this frog or leave garbage that hurts the frog. Human beings have come to live near the places where the frog lives. They brought animals with them, for example cats, that catch and eat this frog. Scientists think climate change can hurt this frog. Climate change means storms and rain come at different times. This causes large amounts of earth to fall away and slide down the mountain. Because the frog lives high in the hills, it cannot move north easily if its home gets too hot. Scientists think the fungus Batrachochytrium dendrobatidis can also make this frog sick. Batrachochytrium dendrobatidis causes the fungal disease chytridiomycosis. One of the places this frog lives is a protected park: Anamalai Tiger Reserve. Scientists have seen some frogs with strange bodies. They think this could be because there is more ultraviolet light pollution than before. Because this frog is small, Ahaetulla perroteti and Salea horsfieldii eat it. ==Taxonomy== Scientists think this, Raorchestes punctatus, and R. melanensis might all be the same species of frog. ==References== Category:Frogs of Asia",
 "title": "Raorchestes tinniens"
}