{
 "id": "1034609",
 "text": "The term \"trial by media\" gained popularity in the late 20th and early 21st centuries, referring to the influence of television and newspaper coverage on an individual's reputation, creating a widespread perception of guilt or innocence even before a verdict is reached in a court of law. This phenomenon is especially pertinent in cases involving high-profile individuals facing trial, as there is a concern that the impartiality of the jury may be compromised due to the exposure to extraneous information. As a result, the due process of law may be disrupted, leading to the possibility of an unfair trial. == Description == The criminal jurisprudence practiced in India is founded on the principle that an accused person has the right to a fair trial and is presumed innocent until proven guilty beyond any reasonable doubt. However, in cases of extensive media coverage, the media often plays a significant role in covering and publishing interviews with witnesses, victim's relatives, and comments from members of the legal community. Unfortunately, this extensive coverage can potentially prejudice the trial proceedings, including the impartiality of the judicial mind. India, a sovereign nation, stands proudly as a thriving democracy. Its journey towards independence and establishment as a democratic nation was shaped by four fundamental pillars that laid the groundwork for its governance and progress. These pillars are: * Legislature * Executive * Judiciary * Media The four pillars of democracy in India efficiently carry out their designated roles. Among these pillars, the fourth pillar, the media, plays a crucial role as a bridge between the three branches of government and the common people of society. An accountable media serves as a supportive ally to effective judicial administration. It goes beyond merely disseminating information about cases and trials; instead, it subjects every aspect of the justice system, including the police, prosecutors, lawyers, judges, and courts, to public scrutiny. Through free and robust reporting, criticism, and open debate, the media contributes to public comprehension of the rule of law and fosters a better understanding of the entire justice system. == Media Trials == As per Choudhary (2015), the term \"media trial\" or 'Trial by Media' emerged in the early 1980s to describe the influence of media coverage (including print, electronic, and online media) on an ongoing legal trial, shaping public perceptions of right or wrong. It can be seen as a form of public protest through the media. In simple terms, media trial refers to the impact of television and newspaper coverage on an individual's or an institution's reputation, creating a widespread perception of guilt or innocence even before the court of law reaches a verdict. In certain cases, media trials may continue even after the verdict is announced, especially when the public is dissatisfied with the judgment. == Related pages == * Supreme Court of India * R. Venkataraman * Court of public opinion * Femme fatale * Trial by ordeal == References == Category:Mass media in India",
 "title": "Trial by media"
}