{
 "id": "1035117",
 "text": "The Gunhild Cross () is a crucifix from the 12th century. It is made of walrus tusk. It is named for its first owner, Gunhild, a daughter of Svend III of Denmark. It is carved. It has inscriptions both in Latin, and in runes. It is in the collection of the National Museum of Denmark. == History == The cross was probably created around 1150. There is a Latin inscription, \"Liutgerus who carved me at the behest of Helena, who is also called Gunnhildr\". After doing some research, Harald Langberg believes that King Svend refers to Svend III Grathe, who died in 1157. Before that, people believed it referred to Sweyn II Estridsen. This seems to be the only work of the artist Luitger. The cross is first mentioned in 1650. At that time, it belonged to Holger Rosenkrantz' wife, Sophie Axelsdottir Brahe. The Royal Cabinet of Curiosities (Kunskammer) bought it in 1684. In 1945, it was transferred to the National Museum of Denmark. == Description == The cross is carved in two blocks of walrus tusk. It measures . It was originally painted in red, blue and golden colours. The central Christ figure on the front side is missing. The four cross arms is decorated with carved medallions of female figures, symbolizing \"Life\" (top), \"Death\" (bottom), the \"victorious church\" (left) and the \"defeated synagogue\" (right). The rear side of the cross is also decorated with carvings. In the centre is a Last Judgement representation of Christ in Majesty. The four medallions show scenes from Heaven (top) and Hell (bottom) as well as the saved (left) and damned souls (right). The Latin inscriptions are written carved in relatively wide capital letters. Ligatures and abbreviations are used often. The name Gunhild is also written in runes on the edge of the bottom medallion. The Latin inscription reads: English translation Jesus of Nazareth, king of the Jews. Life, Death, the Holy Church, the Synagogue. Regard my hands and my feet says the Lord. Come here, into my Father's blessing, go away from me, you accursed, to (eternal) fire. Father Abraham, take pity on me and send Lazarus, that he may dip his finger in water and cool (my tongue). Son, remember that you received good things in your life. Gunnhildr. He who sees me shall pray to Christ for Helena, daughter of King Suenono Magnus, who has had me made in remembrance of the Lord's suffering. Those who believe in the crucified Christ, shall in their prayers remember Liutgerus who carved me at the behest of Helena, who is also called Gunnhildr. In Latin == References == Category:Christian art",
 "title": "Gunhild Cross"
}