{
 "id": "1035443",
 "text": "Rut Laskier, nicknamed Rutka Laskier (12 June 1929 – December 1943), was a Polish girl of Jewish background, who kept a diary in the Będzin concentration camp, in early 1943. == Life == Rutka Laskier was born Rut Laskier on 12 June 1929 in Kraków, Poland, the eldest of two children. Her mother was a housewife, whilst her father Jakub Laskier, worked as a bank officer. In late 1939, the Germans invaded Poland. When the Germans eventually reached Kraków, the family escaped to Będzin, a nearby city, from where her father's family originally came from. The Germans reached Będzin too, shortly after, and after the Polish surrendered to the Germans, the Germans began occupying the country. A few months later, all the Jews from Będzin were deported to a concentration camp, which was located near the city. == Death == In August 1943, Rutka and her family were deported by train to a extermination camp. Her mother and brother were gassed upon arrival, whilst her father was sent to do forced labor. Rutka was originally believed to have died in the gas chambers with her mother and brother, but when her diary was published, a Holocaust survivor Zofia Minc said that she was friends with a girl named Rutka Laskier in the camp, whom she said came from Będzin. She also said that she was friends with her until she died from a cholera epidemic in the camp in December 1943. She then stated that Rutka was taken to the gas chambers. She then said that Rutka begged her [Zofia] to take her to the electric fence, so she could kill herself. She did so, but an SS guard following them would not allow it. He then grabbed Rutka and took her away. She said that she did not know what happened to Rutka, after that. Zofia assumed that Rutka died the same day she last saw her. == Diary == In early 1943, without her family's knowledge, Rutka kept a diary in an exercise book, writing in both ink and pencil. In it, she wrote about witnessing the Nazis persecuting the Jews, her daily life in the Będzin concentration camp, as well as about boys whom she had a crush on. The diary begins on 19 January, with the entry \"I can not grasp that it is already 1943, four years since this hell began\". According to her diary, she used to believe in God, but became a atheist when the Nazis began persecuting the Jews in Poland. The diary ends three months later on 24 April 1943, with Rutka noting how beautiful and sunny the weather looked outside of her house. Category:1929 births Category:1943 deaths Category:Diarists Category:Holocaust victims Category:Polish Jews",
 "title": "Rutka Laskier"
}