{
 "id": "1035351",
 "text": "Western Nebraska Community College (WNCC) is a public community college in Scottsbluff, Nebraska. It also has campuses in Sidney, Nebraska, and Alliance, Nebraska. WNCC had different names in the past: Scottsbluff Junior College, Scotts Bluff County College, and Nebraska Western College. Its athletics teams are known as the Cougars. It has 2,400 students. == Structure == The college has six broad areas of study (Business and Accounting; Computer Information and Sciences; Health Sciences; Humanities and Social Sciences; Science, Engineering And Math; and Trades). WNCC also has three adult-education programs: adult basic education, adult secondary education and English as a second language. WNCC has an active music and theater program. The main campus is at 1601 E. 27th Street, Scottsbluff, NE 69361, phone: (800) 348-4435. ==History== In September 1926 the college began as an extension of the University of Nebraska. The college was given the name Scottsbluff Junior College. The college became inactive after one year. Then it opened again, in September 1929, as part of the Scottsbluff Public Schools System. In September 1932, though, it became a public, two-year college. In June 1968, Scotts Bluff County College became Nebraska Western College. The State Legislature formed the Western Technical Community College Area in 1973. This included Nebraska Western College, Western Nebraska Technical College and the Alliance School of Practical Nursing. On July 1, 1978, the Area Board of Governors placed all three schools into a single college, with three campuses. July 1, 1988, the Board of Governors discontinued the separate campus names and changed the name of the college to Western Nebraska Community College. ==Notable alumni== * Bobby Jackson, professional basketball player * Dick \"Night Train\" Lane, professional football player * Sedric Toney, professional basketball player == Other websites == * College home-page: https://www.wncc.edu/ == References == Category:Colleges and universities in Nebraska",
 "title": "Western Nebraska Community College"
}