{
 "id": "1035913",
 "text": "\"Cneoridium dumosum (Nuttall) Hooker F. Collected March 26, 1960, at an Elevation of about 1450 Meters on Cerro Quemazón, 15 Miles South of Bahía de Los Angeles, Baja California, México, Apparently for a Southeastward Range Extension of Some 140 Miles\" is a humorous, but factual, scientific paper. It was written by American botanist Reid Moran who was from the San Diego National History Museum. == Contents == The paper is about a plant species called Cneoridium dumosum. Because of its long title, which has all of Moran's key points, and its many acknowledgements, the paper only contains the words: which only has five words, the reference number of the specimen collected (inside parentheses), and a period. Moran's closing acknowledgement contains the text: which was also used by biologist George Yatskievych in 1982. In an obituary to Moran, published by The San Diego Union-Tribune, another botanist Tom Oberbauer said that Moran \"had a dry sense of humor\". == Publishing == The paper was published in 1962. It was published in volume 16, page 272 of the California Botanical Society's scientific journal called Madroño. The whole paper was later published again, in 2013, with the title \"Reprinted Classic Madroño Articles\" in Madroño, volume 60, page 359. This was the California Botanical Society's centennial (100th) year. This paper is not the shortest paper ever published. A 2003 paper written by John H. Conway and Alexander Soifer has the title \"Can n2+ 1 unit equilateral triangles cover an equilateral triangle of side > n, say n + ε?\". The paper only has two words: \"n2+2 can\", and two figures. An even shorter paper is titled \"Chemiefreie Haushaltsprodukte\" (which is German for \"Chemical-free household products). It has zero words after the abstract. == References == == Other websites == * Full paper, including acknowledgements Category:Documents Category:Biology",
 "title": "Cneoridium dumosum (Nuttall) Hooker F. Collected March 26, 1960, at an\nElevation of about 1450 Meters on Cerro Quemazón, 15 Miles South of Bahía de\nLos Angeles, Baja California, México, Apparently for a Southeastward Range\nExtension of Some 140 Miles"
}