{
 "id": "103513",
 "text": "Bolesław I the Brave (Polish Bolesław I Chrobry) (967 June 17, 1025) was the duke of Poland from 992 to April 18, 1025 and King of Poland from April 18 to June 17, 1025.Boleslaw I of Poland, Encyclopaedia Britannica. He was also a duke of Bohemia known as Boleslav IV from 1003 to 1004. He was the son of Mieszko I, first known ruler of Poland. ==Conquests== Boleslav wasn't aggressive as long as his friend - the emperor of the Holy Roman Empire lived. After his death in 1002, Boleslav started the imperial policy. During the chaos in Reich, duke conquered the border areas : Lusatia and Meissen. When finally Henry II took over the German Throne, he accepted annexiation of Lusatia, giving it to Bolslav as a fiefdom, and giving Meissen to his ally - Gunzelin. In 1003 the duke of Bohemia - Vladivoj, died. This death caused intervention in Czechia, where Boleslav put on the throne Boleslav III, that was banished before. In the same year, probably thanks to requests of the Czech opposition, Boleslav (Polish one) put out the Boleslav's (Czech one) eyes and become the Duke of Bohemia himself. He wouldn't like to pay tribute to the German Emperor, like did the Czech dukes, and that was an excuse, that started Polish - German War from 1003 -1018. We know 7 children of Bolesław I. Two of them, Mieszko II Lambert and Bezprym ruled Poland after his death. == Interesting Facts == * The King introduced new law - any man that will sleep with multiple woman will be taken to the bridge and his private areas will be nailed to it. Then he will be left with knife and choice - either die on the bridge over the time or cut himself. This simple rule caused - until now pogan - culture to promote sacred life with one partner only.\"Przewrotna historia Polski, Mac Edukacja, 2001\" * Image of Bolesław the Brave is on 20 zlotys paper money == References == Category:967 births Category:1025 deaths Category:Polish dukes Category:Kings of Poland Category:Piast dynasty",
 "title": "Bolesław I the Brave"
}