{
 "id": "1035098",
 "text": "Yuri Ivanovich Ryabinkin (Russian: Юрий Иванович Рябинкин; 2 September 1925 – between 8 January and 2 March 1942), was a Russian boy who endured the Siege of Leningrad. He kept a personal diary from 22 June 1941 (the day the Germans invaded the Soviet Union) to 6 January 1942. He gained posthumous fame a few years later after World War II ended, when his diary was printed by a press. His diary was first published in 1970. Yuri's fate remains unknown. It is known that he did not survive the siege of Leningrad, and that he died between 8 January and 2 March 1942 (due to records confirming it). The exact date of his death and his burial place has not been recorded. == Life and family == === Early life and family background === Yuri Ivanovich Ryabinkin was born on 2 September 1925 in Saint Petersburg (then Leningrad). His younger sister, Irina, was born on 30 April 1933. His mother, Antonina Mikhailovna Riabinkina (née Pankina), was born on 13 August 1903 and came from a family belonging to the intelligentsia. She completed her education at the gymnasium and was fluent in French, German, and Polish. Yuri and his family lived in an apartment that even had a library. By 1941, when the Germans invaded the Soviet Union, Antonina worked as a librarian and was also a member of the Communist Party of the Soviet Union. Yuri's father left the family in April 1933, remarried, and lived with his new wife in a Russian village near Finland before being sent to the Gulag in 1937. === Education and early interests === Living with his aunt alone until he was seven, Yuri and his aunt later moved in with his mother. In 1933, he began attending school, and by the age of 15, he had completed eighth grade. In 1938, while still in school, Yuri studied the sea in Kuybyshev for one year. In 1941, he began studying history at the House of Pioneers of Leningrad. Yuri lived with Irina, Antonina, and his aunt on Sadova Street (today named July 3 Street) in Leningrad. When the Ryabinkin family learned about the German invasion of the Soviet Union, they chose to stay in Leningrad due to Antonina's membership in the Communist Party. === Health and attempt to join the navy === Yuri suffered from poor eyesight and lung disease, which prevented him from attempting to join the Red Army. During the siege of Leningrad in the fall of 1941, his mother advised him to enroll in a navy school to improve his living conditions and secure evacuation from Leningrad. However, Yuri did not pass the test and was rejected from the Navy. === The diary === Yuri began writing a diary on 22 June 1941 without mentioning his reasons for doing so. His sister Irina was unaware of the diary, and the only known person to be aware of it was his mother, Antonina, who reportedly did not want him to keep it. In an entry dated December 1941, Yuri mentioned that his family was included in an evacuation list. The list initially indicated that they would be evacuated within one to seven days, but the evacuation was postponed for nearly a month. Later, his mother received a work card, his sister Irina a child card, and Yuri received one slice of bread. His last entry for 1941, dated 24 December, reflected on their life before the war and the happiness they once knew. === The siege and final days === In the first week of January 1942, Yuri and his family began suffering from severe stomach disease. His final diary entry, dated 6 January, ended mid-sentence. On 8 January, the family was evacuated, but Yuri, gravely ill and weak, was left behind. He died alone in the family's apartment a few days later from starvation. === The fate of his family === After traveling for two weeks, the remaining family members arrived in Vologda, where Antonina died the same day from exhaustion. Irina, still alive, was sent to an orphanage in the city. On 11 February, she was transferred to another orphanage in the village of Nikitskaya. She spent most of her life unaware of what had happened to her brother Yuri. === Irina's search for Yuri === As an adult, Irina searched for her brother and sought records from archivists to uncover his fate. === Discovery of Yuri's fate === In February 2021, an archivist found records from the siege of Leningrad indicating that Yuri Ryabinkin had died in 1942. Irina was later informed of her brother's death. == The fate of Yuri's diary == Sometime in 1942 in Volgoda, a schoolteacher was taken to a hospital, suffering from tuberculosis. There, he gave a nurse named Rebekah Trifonovah in the hospital, a notebook which was Yuri Ryabinkin's diary. The schoolteacher was so weak that he could not talk, and therefore, he did not say where he got the diary. He died a few days later in the hospital. The nurse published the diary in 1970. ==References== Category:1925 births Category:1942 deaths Category:Writers from Saint Petersburg Category:Diarists",
 "title": "Yuri Ryabinkin"
}