{
 "id": "1035418",
 "text": "Onatejiro \"AJ\" Odudu (born 12 February 1988) is an English television presenter from Blackburn. She began her career in 2009. == Television appearances == Odudu became famous in 2013 after she was the co-host of Big Brother's Bit on the Side alongside Rylan Clark. In 2019, she was a backstage presenter of The Voice UK and The Voice Kids. In 2022, Odudu announced the United Kingdom's jury points in the Eurovision Song Contest 2022. In 2023, it was announced that AJ Odudu and Will Best are the presenters of the new version of Big Brother UK. In addition to television presenting, AJ Odudu has been a celebrity contestant on multiple reality television shows including SAS: Who Dares Wins, Cooking with the Stars and Strictly Come Dancing. ==Filmography== Year Title Role 2009 The Almost Perfect Guide to Life Co- presenter The 5:19 Show Co-presenter 2010 Teensville: Teen Witches Presenter 2011 Dirty Digest Panellist Comedy Lab Herself 2012 Isle of Wight Festival 2012 Co-presenter 2013 Big Brother's Bit on the Side Co-presenter Celebrity Big Brother's Bit on the Side Co-presenter 2015–2016 The Hot Desk Presenter 2018 Manhunting with My Mum Presenter 2019 The Voice UK Backstage presenter The Voice Kids Backstage presenter Celebrity SAS: Who Dares Wins Contestant 2020 The Great British Bake Off: An Extra Slice Series 4; Episode 1 - Herself Richard Osman's House of Games Series 4; Episodes 16-20 - Herself Don't Rock the Boat Co-presenter 2021 Would I Lie To You? Herself Celebrity Karaoke Club Winner The Wheel Expert Cooking with the Stars Contestant Rolling In It Contestant Apocalypse Wow Presenter The Big Breakfast Co-presenter Strictly Come Dancing Series 19; Finalist Married at First Sight UK: Afters Presenter Emma and AJ Get to Work Co-presenter; alongside Emma Willis 2022 The Great Comic Relief Prizeathon Co-presenter; alongside Vernon Kay Eurovision Song Contest 2022 Spokesperson for the UK's votes The Bridge: Race to a Fortune Presenter Platinum Jubilee Pageant Presenter Rosie Jones' Trip Hazard Herself Red Bull Soapbox Race: London 2022 Co-presenter; alongside Will Best The Hit List Contestant RuPaul's Drag Race UK Special guest; Series 4 The Last Leg: Christmas Bash Special guest The Weakest Link Contestant 2023 The Big Interiors Battle Presenter Time For A Check In Presenter Eurovision Song Contest 2023: Handover and Allocation Draw Co-host; alongside Rylan Clark Pointless Celebrities Contestant The Great Stand Up to Cancer Bake Off Herself The Greatest Auction Host Shopping with Keith Lemon Herself; one episode Big Brother Co-presenter; alongside Will Best Big Brother: Late & Live Co-presenter; alongside Will Best Mary Makes It Easy Guest 2024 Celebrity Big Brother Co-presenter Celebrity Big Brother: Late & Live RuPaul's Drag Race UK Guest judge; Series 6 M&S;: Dress the Nation Co- presenter; alongside Vernon Kay TBC The Big Blow Out Host == References == == Other websites == * Category:1988 births Category:Living people Category:English television presenters",
 "title": "AJ Odudu"
}