{
 "id": "1035110",
 "text": "Pace count beads, pacer beads or ranger beads are a manual counting tool used to keep track of distance travelled through a pace count. It is used in military land navigation or orienteering. A typical example for military use is keeping track of distance travelled during a foot patrol. ==Description== The tool is usually constructed using a set of 13 beads on a length of cord. The beads are divided into two sections, separated by a knot. Nine beads are used in the lower section, and four or more beads are used in the upper section. There is often a loop in the upper end, making it possible to attach the tool to the user's gear with a simple Larks head hitch (knot). 13 individual beads (divided 4:9) allow the user to keep pace of up 5000 separate paces (about 5km at an average pace), without relying on GPS or electronics. ===Metric ranger beads=== Metric ranger beads are split into 4 upper beads (representing clicks or kilometers) with 9 lower beads (representing 100 meters). ===US Standard ranger beads=== US Standard ranger beads are split into 6 upper beads (representing 1/2 miles) with 7 lower beads (representing 110 yards or 1/16th miles). ===Foresters chain (modification)=== A Foresters chain modification can be found on both metric and US Standard ranger beads. This uses an additional 4 beads (representing 20 meters in metric or 22 yards in US standard) sectioned off at the bottom from the previously mentioned examples. ==Usage== The beads can be used to count paces or a distance calculated from the number of paces. Both methods require the user to know the relationship between the paces walked, and the distance travelled. There are two main ways to use the beads. One is to represent the distance a person has walked, and the other is to represent the distance they need to walk. In the latter, beads may be used to count down the distance to a destination. ===Counting paces=== As users walk, they typically slide one bead on the cord for every ten paces taken. On the tenth pace, the user slides a bead in the lower section towards the knot. After the 90th pace, all nine beads are against the knot. On the 100th pace, all nine beads in the lower section are returned away from the knot, and a bead from the upper section is slid upwards, away from the knot. In this manner, the user calculates the distance travelled by keeping track of the paces taken. To use this method, the user must know the length of their pace to calculate the distance accurately travelled. Also, the number of paces to be walked must be precalculated (example: 2,112 paces= one mile, based on a 30-inch pace), and then the distance travelled has to be calculated from the walked paces. ===Distance walked=== For every 100 meters the user walks, one of the lower beads is pulled down. When the ninth of the lower beads is pulled, the user has walked 900 meters. When the user has walked 1000 meters, one of the upper beads is pulled down, and all the lower beads are pulled back up. Using this method, the user must know the number of paces walked in 100 meters. An experienced user can also adapt the pace count for each hundred meter depending on the terrain. When using this method, the user does not have to calculate distance from the number of paces. This method can, of course, be used for non-metric distances as well, though with the beads arranged in a different manner. ==References== Category:Beadwork Category:Length, distance, or range measuring devices Category:Mechanical calculators Category:Military personal equipment Category:Navigational equipment Category:Numeral systems",
 "title": "Pace count beads"
}