{
 "id": "103522",
 "text": "DuckTales, also spelled \"Duck Tales\", is an animated Disney television series. The main characters of the series are Scrooge McDuck and his grandnephews Huey, Dewey, and Louie. The series was originally shown from September 18, 1987 to November 28, 1990. It had a total of 100 episodes. There has been a movie, a spinoff TV show, and a reboot ==Basic story== DuckTales is about the adventures of Scrooge and his nephews. The nephews used to live with their uncle, Donald Duck. They were left with Scrooge when Donald went off to join the Navy. Scrooge is the richest duck in the world. He has no want for anything. This does not stop him from finding ways to try to get more money. Other common plots deal with him protecting his wealth from villains. In general, there were several different plotlines that were used many times in many of the episodes. Some of these plotlines included: * Scrooge learns about an ancient treasure or civilization. When he goes to find it, he finds more trouble than he thought he would find. (Home Sweet Homer, Master of the Djinni, Sweet Duck of Youth, A Ducktale's Valentine) * In a similar plot, Scrooge is having trouble with one of his businesses. When he goes to fix the problem, he gets involved in an adventure of some sort. (Where No Duck Has Gone Before, Bermuda Triangle Tangle, Ducks of the West, Back Out in the Outback) * Gyro creates a new invention. The invention usually either causes problems when it does not work properly or it is stolen and used for evil. (Armstrong, Bubba's Big Brainstorm, Time Teasers) * Scrooge loses all of his money, often to the Beagle Boys, and tries to get it back. This plotline is often used with one of the other common plotlines. (The Money Vanishes, Scrooge's Last Adventure, Time is Money) * Flintheart Glomgold tries to become better than Scrooge. This usually deals with Glomgold trying to become the richest duck in the world. (Duckman of Aquatraz, The Uncrashable Hindentanic, The Attack of the Metal Mites) * Magica de Spell tries to steal the first money that Scrooge ever earned. This is his first dime, which he calls his \"Number One Dime\". Her plans involve using the special dime to create a magic spell that will give her great wealth. (Send in the Clones, Nothing to Fear, Magica's Shadow War). * Scrooge remembers some business, voyages or adventures from when he was young. (Ducktales:Treasure of the Golden Suns, Duck in the Iron Mask, Status Seeker, Launchpad's First Crash, Once Upon a Dime, The Curse of Castle McDuck, Back to the Klondike, Super DuckTales). ==Characters== ===Heroes=== * Scrooge McDuck is the richest duck in the world. He owns factories, mines, railroads and oils wells. He keeps all of his money in the Money Bin and lives at Manor McDuck in the make-believe city of Duckburg. * Huey, Dewey, and Louie are Scrooge's great nephews. They live with him at McDuck's mansion. They like to play in the pool and to go with the rich uncle on his adventures. * Webby is a pretty girl who lives at McDuck's mansion with his adoptive family, the Duck family. * Duckworth is the butler of McDuck's mansion. * Launchpad McQuack is Scrooge's accident-prone pilot. ===Villains=== * Flintheart Glomgold is a South African billionaire and the second richest duck in the world, who wants to destroy Scrooge's wealth in order to become the richest duck in the world. * The Beagle Boys are a group of thieves in Duckburg who try to steal Scrooge's money. * Magica de Spell is a witch who tries to steal Scrooge's lucky dime. ===Minor characters=== * Bubba, pre- historic duck that meet Scrooge in the movie Time is money. * Fenton Crackshell is an accountant who is also the superhero Gizmoduck. He met Scrooge in the movie Super DuckTales. * Donald Duck is Scrooge's nephew. * Gladstone Gander is Scrooge's lucky nephew. ==Selected episodes== Summary Episode name Date first shown Something is attacking Scrooge's sheep and taking their wool. Scrooge goes to Australia to find out what is going on. Back Out in the Outback November 10, 1987 Scrooge has trouble in the Bermuda triangle when his boat starts to sink. Bermuda Triangle Tangle Scrooge finds Aladdin's map but Glomgold tries to steal it. Master of the Djinni Scrooge contacts an accountant named Fenton. After losing Scrooge's fortune, Fenton becomes a hero to get Scrooge's money back. Super Ducktales ===Back Out in the Outback=== Somebody is sabotaging Scrooge's ranch when McDuck and his nephews go by plane to Australia. Scrooge, the Manager and MacQuack go by airplane to explore but they are attacked by light swords. Meanwhile, Webby loses herself in the jungle and sleeps on the woods. The next day, Webby and some animals find an opal mine and discover that the Manager is responsible. The manager wants to buy Scrooge's ranch and become a rich man. Fortunately, Webby and the animals show who is the Manager and Scrooge preserves his ranch. Scrooge asked Webby when, how she made up to captured the bandit, she said \"group work\". ===Master of the Djinni=== Scrooge McDuck and Huey, Dewey and Louie go to the Sahara desert to find Aladdin's lamp. Flintheart Glomgold follows them. The ducks find the lamp's vault but Scrooge and Glomgold rub it at the same time. The djinni comes out and because he can't tell who rubbed the lamp first, he decides to have a race between Scrooge and Glomgold. By Scrooge's suggestion, the djinni decides live in Manor McDuck during the race. Once the djinni and the nephews go to the mansion, Scrooge fights Glomgold's tramps (like the villain trying to kill him with a rock avalanche). Scrooge decides to win the race to Glomgold leave his nephews without a dime. At McDuck's mansion, the djinni starts to like the luxuries of Scrooge's house (because he can eat burgers, swim in the pool and watch TV). He likes it so much that he decides to send Scrooge and Glomgold to back in time so he can live free forever. Because the two billionaires do not know about the time voyage, they continue running when they find a palace. The Sultan, thinking that they are spies of Hemir, decides to give them to crocodiles. But Schewebazade, the Sultan's young wife, saves them and they escape from the palace. The guards follow them and Glomgold go for his count. Meanwhile, the nephews and Webby, who witnessed the evil act of the djinni, put the djinni back in the lamp and let him leave only when he agrees to bring Scrooge back from the past. At this moment, Scrooge and Glomgold come back to the present-day. Unfortunately, Glomgold finds and explores and make over win the race. Obviously, Scrooge can make over come to Duckburg only to discover that Glomgold won the race. Glomgold's first wish is to send Scrooge to a desert island. Glomgold uses his second wish by mistake to go to the desert island with Scrooge (he said he wishes he could see the look on Scrooge's face face when he gets there). At the island, Glomgold wishes that the lamp was never found in the first place. This puts everything back in time to when the ducks open the vault entrance. The explosion made the lamp fall and despite the ducks can back to Duckburg alive, the lamp stays in the vault as never found. ===Sweet Duck of Youth=== One night, Scrooge McDuck and Launchpad go back to Manor McDuck. When Scrooge enters the mansion, he discovers that it is his birthday (which is weird because the show depicts it as a summer night whereas Scrooge's real birthday is in the winter or very late fall) and his family prepared a surprise party. Scrooge is unhappy because he is old. When Mrs. Beakley mentions the fountain of youth, Scrooge runs to the library. There he finds a book that talks about \"Ponce de Loon\", a Spanish explorer who said he found the fountain of youth in Florida. The next day, in Florida, the ducks are in a tropical forest when they meet an old man who is also trying to find the fountain of youth. After finding a map, the guys find the Fountain of Youth. However, they find out that the fountain only makes their reflection look youthful. Scrooge goes home and realizes that people have to age. ===Where No Duck Has Gone Before=== One day, at Manor McDuck, Huey, Dewey and Louie are watching the television show \"Ducks of the Galaxies\" when Scrooge buys the Duckburg studios, the place where \"Ducks of the Galaxies\" is filmed. Scrooge tells Gyro to build a toy spaceship, but Gyro builds an real spaceship. The spaceship sends the Captain, Huey, Dewey, Louie, and McQuack to space where they are captured by aliens. The nephews find out that the Captain is evil. Eventually, Huey, Dewey, and Louie go back to Earth where Scrooge punishes the Captain. === Back to the Klondike === On Valentine's Day, Scrooge tells his nephews and Webby his only love story: :When Scrooge worked at White Agony Creek he went to Blackjack Saloon where he met Goldie, a pretty singer. After Scrooge lost his gold nugget by Dangerous Dan, he bet that Goldie can't make honest money. Goldie and Scrooge work for many months to get a lot of gold. But Dangerous Dan stole the gold, and Scrooge thought that Goldie stole it. Scrooge and the others go to Klondike where they try to get the lost gold back. Scrooge meets Goldie and their relationship is of hate\\love at the end of the episode. Scrooge discovers that Dangerous Dan is the real thief and, when he tries to tell that to Goldie, she discovers a goldmine. Before the episode ends, Scrooge realizes that Goldie did not steal his gold, she stole his heart. ==Home video releases== ===VHS=== ====Video Chile: ADV Garantía Original Video==== Thirdteen VHS cassettes contaning 26 episodes were released on Argentinina/Chile. VHS Name Episode Titles Release date DuckTales (Volume 1): Earthquack \"Earth Quack\" \"Back to the Klondike\" April 17, 1992 DuckTales (Volume 2): Micro Ducks from Outer Space \"Micro Ducks from Outer Space\" \"Scrooge's Pet\" DuckTales (Volume 3): The Lost Crown of Genghis Khan \"The Lost Crown of Genghis Khan\" \"The Money Vanishes\" DuckTales (Volume 4): Hotel Strangeduck \"Hotel Strangeduck\" \"Superdoo!\" September 12, 1992 DuckTales (Volume 5): 1001 Arabian Ducks \"Master of the Djinni\" \"Merit-Time Adventure\" DuckTales (Volume 6): High Sea Adventures \"Maid of the Myth\" \"Send in the Clones\" DuckTales (Volume 7): Ducks on Parade \"Ducks on Parade\" \"Scroogerello\" April 2, 1993 DuckTales (Volume 8): Jungle Duck \"Jungle Duck\" \"Home Sweet Homer\" DuckTales (Volume 9): Aquaducks \"Aquaducks\" \"Magica's Shadow War\" DuckTales (Volume 10): Jailhouse Duck \"Duckman of Aquatraz\" \"Where No Duck has Gone Before\" September 18, 1993 DuckTales (Volume 11): Fool of the Nile \"Sphinx of the Memories\" \"Top Duck\" DuckTales (Volume 12): Little Duckaroos \"Ducks of the West\" \"Sir Gyspo de Gearloose\" DuckTales (Volume 13): Runaway Robots \"Robot Robbers\" \"The Curse of Castle McDuck\" ===DVD=== ====Video Chile: ADV Garantía Original Video==== The sets from Germany and the United Kingdom have also been released on Argentinina/Chile. The First Collection came out on September 15, 2012. The Second Collection was released on April 12, 2013. The Third Collection was released on September 14, 2013. DVD Name Ep# Release date DuckTales: The First Collection (Volumes 1-3) 1-27 September 15, 2012 DuckTales: The Second Collection (Volumes 4-6) 28-49 April 12, 2013 DuckTales: The Third Collection (Volumes 7-9) 50-71 September 14, 2013 == Other websites == * * * Category:Nicktoons Category:Television series by Disney Category:Animated television series Category:First run syndicated television programs Category:1987 American television series debuts Category:1990 American television series endings Category:English-language television programs Category:American children's television series",
 "title": "DuckTales"
}