{
 "id": "1035175",
 "text": "Edward Edmund Maximilian George Windsor, Lord Downpatrick (born 2 December 1988), known professionally as Eddy Downpatrick, is a British travel specialist, adventurer, photographer, and writer. He is a co-partner of an expedition and adventure travel company called Wheeler-Windsor Expeditions and the founder of Aristeia Travel, an exclusive travel curator. He has led expeditions to various locations worldwide, including the Himalayas of Nepal - the Himalaya Helicopter Expedition, Central Asia, Scottish Highlands, Norwegian Arctic, Ethiopia, British Columbia, and Balkans. In August 2022, Lord Downpatrick was elected as a Member International of The Explorer's Club, a professional society promoting scientific exploration and field study, founded in 1904 in the United States. Downpatrick is a member of the British Royal Family, and holds the title of Baron (Lord) Downpatrick. He is second- in-line to the Dukedom of Kent, and his grandfather was a first cousin to Queen Elizabeth II. The late Diana, Princess of Wales, was his godmother. A second cousin once removed of Charles III, Downpatrick is the most senior member of the House of Windsor to be excluded from the line of succession to the British throne due his Roman Catholic faith. He, along with his sisters, holds Canadian citizenship through his mother. == Early life and family == Downpatrick was born on 2 December 1988 at St Mary's Hospital, London, and grew up in Cambridge. He is the eldest child of George Windsor, Earl of St Andrews, son and heir apparent of Prince Edward, Duke of Kent. He is a member of the British Royal Family and was a first cousin and confidant of the late Queen Elizabeth II. His mother is Sylvana, Countess of St Andrews, who is a Canadian historian with Austro-Italian and French heritage and a fellow of St. John’s College, Cambridge, where she holds the position of Sir Harry Hinsley Lecturer in History. Diana, Princess of Wales, was Downpatrick's godmother, but she died before he got to know her well. Downpatrick is close to his third cousin Princess Beatrice and to his younger sisters Lady Marina and Lady Amelia Windsor, a fashion model. His great-grandmother Princess Marina, Duchess of Kent, was the British royal family's fashion icon in the post-war era. == Education == Downpatrick was educated at Eton College and gained his B.A. and M.A. degrees from Keble College, Oxford, where he studied Modern Languages with a specialisation in French and German. During his time at Oxford, he served as the president of the Bullingdon Club. He wanted to join the British Army after the university, but had not recovered from rugby injuries. == Career == Downpatrick has had a passion for adventure and exploration since his childhood. He has curated, designed, and led private expeditions during his 20s and early 30s, which led to the establishment of his own business, Aristeia Travel in 2021. Later that year, he partnered with Dr. Jack Wheeler to create Wheeler Windsor Expeditions. Downpatrick, along with Dr Jack Wheeler and independently, designs and guides exclusive expeditions across various regions around the world, including the Scottish Highlands, Ireland, Norway, Saharan, East and sub-Saharan Africa, Brazil, Patagonia, Canada, the Himalayas, Central Asia, and old-world Europe. He is an avid hiker, mountaineer, skier, wild swimmer, linguist, and horseman. Downpatrick first had the idea to launch a fashion brand while hiking in Scotland in 2009, but decided to first focus on his studies and career as a financial analyst at JP Morgan. Downpatrick left JP Morgan and began working as a fashion designer in 2016. He was a co-founder and the creative director of the fashion label FIDIR, which he launched in 2017. The brand is a collection of outdoor-wear and accessories. His designs were inspired by the Scottish Highlands. == Succession rights == In 2003, aged 15, following the example of his grandmother the Duchess of Kent and his uncle Lord Nicholas Windsor, Downpatrick, who was baptised in the Church of England, chose to be confirmed into the Catholic Church. He was therefore barred from the line of succession to the British throne according to the Act of Settlement 1701. As a second cousin once removed of King Charles III, Downpatrick is the most senior person excluded from the line of succession for being a Catholic. , he would have been 42nd in line. He remains second in the line of succession, after his father, to the Dukedom of Kent. Title 2 December 1988 Lord Downpatrick == References == Category:1988 births Category:Living people Category:British photographers Category:Writers from London Category:British royalty Category:House of Windsor Category:British businesspeople Category:British Roman Catholics Category:Fashion designers Category:British swimmers Category:Linguists Category:British explorers",
 "title": "Edward Windsor"
}