{
 "id": "1035157",
 "text": "Chip and Potato is an Canadian-British animated children's television series that launched on 15th October 2018 on Family Jr. It was created by Billy Macqueen, Catherine Williams, and Maddy Darrall. == Plot == The series is about a friendship of the pug Chip and the white mouse Potato. == Characters == * Chip Pug (voiced by Abigail Oliver; Ava Talbot in the UK dub in season 1 and Megan Heavey in season 2 and onwards in the UK dub), a friendly, curious, and big-hearted five-year-old female pug. * Potato (voiced by Andrea Libman) a white female mouse who is Chip's best friend. * Spud Pug (voiced by Chance Hurstfield; Sam Day in the UK dub and Ben Riley in season 2 and onward in the UK dub) a male pug who is Chip's older brother. * Little Momma Pug (voiced by Briana Buckmaster; Kate Harbour in the UK dub) a female pug who is Chip's mother. * Little Poppa Pug (voiced by Brian Dobson; Wayne Forester in the UK dub) a male pug who is Chip's father. * Nico Panda (voiced by Dominic Good) a male panda who is Chip's best friend. * Totsy Tot Pug a little female pug who is Chip's younger sister. * Grandma Pug (voiced by Christina Jastrzembska; Joanna Ruiz in the UK dub) a old female pug who is Chip's grandmother. * Stomp and Stamp Fant (voiced by Evan Byarushengo and Scotia Andersen; Dexter Norbury and Abi Kelly in the UK dub) a twin elephants who are Chip's friends and neighbours. * Pa Fant (voiced by Vincent Tong) a male elephant who is the father of Stomp and Stamp. * Ma Fant (voiced by Kathleen Barr) a female elephant who is the mother of Stomp and Stamp. * Granny Fant (voiced by Kathleen Barr; Joanna Ruiz in the UK dub) a female elephant who is the grandmother of Stomp and Stamp. * Amanda Panda (voiced by Teryl Rothery; Jackie Davis in the UK dub) a female panda who is Nico's mother. * Bodi Panda a little male panda is Nico's younger brother. * Andy Panda (voiced by Deven Mack) a male panda who is Nico's father. * Mr. Desmond Diggerty (voiced by Alessandro Juliani; Paul J. Rose in the UK dub) a male mole who is the kindergarten teacher of Rainbow Forest School. * Gigglish Grand (voiced by Emma Jayne Maas; Betty Heavey in the UK dub) a female giraffe who is one of Chip's friends and neighbours. * Howie Hyena (voiced by Brenden Sunderland; Lawrence Matthews in the UK dub) a male hyena who is mischievous kindergartener at Rainbow Forest School. * Gordie Pug (voiced by Garry Chalk; Mark Crook in the UK dub) a male pug who is Grandma Pug's husband. * Glenda (voiced by Naomi Tan) a female dalmatian who is Gordie's granddaughter. * Hop Hippo (voiced by Melody Nosipho Niemann; Nellie Pickerill in the UK dub) a female hippopotamus who is a 2nd grader at Rainbow Forest School and is a member of the After School Club. * Henrietta Hippo a female hippopotamus who is Hop's sister. * Roxy Rhino (voiced by Claire Corlett; Joanna Ruiz in the UK dub) a female rhinoceros. * Eva Rhino a female rhinoceros who is Roxy's sister. * Mr. Rhino (voiced by Alessandro Juliani; John Harley in the UK dub) a male rhinoceros who is the father of Roxy and Eva. * Mrs. Rhino a female rhinoceros who is the mother of Roxy and Eva. == Episodes == === Season 1 (Season 1 & 2 on Netflix) === # Morning Potato! # Chip Starts Kindergarten # Chip Gets Lost # Car Wash Chip # Chip Goes Rollerskating # Chip n Grandma Day # Nico’s First Day # Sporty Chip # Stomp and Stamp’s Slide # Show and Tell Chip # Chip and Deely Bear # Chip’s Piano Lesson # A Playdate at Nico’s # Roxy the Babysitter # Chip’s Class Show # Double Playdate Chip! # Chip’s First Sleepover # Doctor Chip # Chip’s Swimming Lesson # Spud’s Homework # Police Pug Chip # Pumpkin Picking Chip # Chip’s School Trip # Big Sister Chip # Chip’s Baby Sister # After School Chip # Grandma Pug’s Birthday # Puggy House Guest # Puggy Butterfly # Itchy Chip # Back to School Chip # Chip’s Big Bike Ride # Bye Bye Dazzles # Puggy Parent-Teacher Day # Chip’s First Piano Exam # Chip’s Homework Project # Hospital Trip Chip # Chip Without Potato # Chip’s Birthday # Snow School Chip === Season 2 (Season 3 & 4 on Netflix) === # Fairground Chip # Chip, Meet Mrs. Whale # Chip and Glenda # Chip, the Picnic Entertainer # Chip’s Haircut # Chip’s Sleepaway T-shirt # Tot’s New Bed # Chip’s Cake Bake # Kevin Comes to Stay # Tot’s First Birthday # Bridespup Chip # Chip and Nico’s Fun Day # Chip is Sorry # Grandma and Gordie’s Taqueria # Flingo’s Show # Boo-bam’s School Visit # Tot and Potato # Howie Has Heart # Wedding Rehearsal Chip # Grandma and Gordie’s Big Puggy Wedding # Chip and Potato: Flying Chip # Chip and Potato: Chip’s Holiday # Chip and Potato: Chip’s Thanksgiving == Related pages == * Go, Dog. Go! (TV series) * As Aventuras de Gui & Estopa == References == == Other websites == * * * * * Category:Fictional dogs Category:Fictional mice and rats Category:2018 television series debuts Category:2010s Canadian television series Category:2010s British television series Category:2018 Canadian television series debuts Category:2022 Canadian television series endings Category:Canadian children's television series Category:British children's television series",
 "title": "Chip and Potato"
}