{
 "id": "103586",
 "text": "David Paul Boreanaz (born May 16, 1969) is an American actor. He is best known for his role on the television series Buffy the Vampire Slayer and Angel. On both of these shows, he played the character Angel. From fall of 2005 to spring of 2017, he has played FBI agent Seeley Booth on Bones. == Biography == === Early life === David Boreanaz was born on May 16, 1969 in Buffalo, New York. He grew up in Philadelphia, Pennsylvania. His father is a television weatherman and his mother is a travel agent.David Boreanaz Biography (1971-) He is of Italian descent. The surname Boreanaz is of Slovene origin.In Step With...David Boreanaz | PARADE Magazine He was raised Catholic.USA WEEKEND Magazine Boreanaz went to high school in Malvern, Pennsylvania. He went to college at Ithaca College in Ithaca, New York. After graduating, Boreanaz moved to Hollywood, California to become an actor. === Career === Boreanaz' first television acting job was a single episode on the hit American sitcom, Married... with Children. He played Kelly Bundy's biker boyfriend. He was cast in the television series Buffy the Vampire Slayer, after being seen by a producer when Boreanaz was walking his dog. In the series, he played Angel, a vampire with a soul. The series became very successful and Boreanaz starred in a spin-off series, Angel. This new series gave the character a chance to evolve. It was mainly about on Angel's battle for redemption. He appeared on Buffy from 1997 to 1999, at which point he began starring in Angel, which ran until 2004. Totalling all of his appearances on Buffy & Angel, including guest appearances, Boreanaz has been in more episodes of the 2 series than any other actor. Boreanaz's only starring role in a major theatrical movie was in 2001's slasher horror movie, Valentine. This movie also starred Denise Richards and Katherine Heigl. In 2003, he appeared in the music video for singer Dido's \"White Flag\". He was also the voice of Leon (aka Squall Leonhart) in the video game Kingdom Hearts. In 2005, Boreanaz began starring along with Emily Deschanel on the prime time television series, Bones. He most recently appeared in These Girls, a Canadian movie in which he played a biker. The movie was first shown at the Toronto Film Festival and the Vancouver International Film Festival. It was later shown in a small number of theaters in Canada in March 2006. His future roles include parts in the independent films Mr. Fix it and Suffering Man's Charity. It is also rumored that Boreanaz will star in the upcoming movie Jurassic Park 4 which will be released some time in 2008. In that same year, he also voiced Hal Jordan in the direct to video DC Comics animated movie Justice League: The New Frontier. === Personal life === Boreanaz lives in Los Angeles, California. He was married to Ingrid Quinn from June 7, 1997 to October 1999. He married actress and model Jaime Bergman on November 24, 2001. The couple has a son, Jaden Rayne Boreanaz, who was born on May 1, 2002. He and his wife are also good friends with Raven Symone. David attended her 21st birthday in December 2006. == Filmography == === Movies === Year Film Role Other notes 1993 Best of the Best 2 Extra uncredited Aspen Extreme Extra uncredited 1996 Macabre Pair of Shorts Vampire's victim 2001 Valentine Adam Carr 2002 I'm With Lucy Luke 2005 The Crow: Wicked Prayer Luc Crash 2006 These Girls Keith Clark limited release Mr. Fix It Lance Valenteen The Hard Easy Roger Hargitay 2007 Suffering Man's Charity Sebastian direct-to-video 2008 Justice League: The New Frontier Hal Jordan/Green Lantern (voice) direct-to-video animated movie 2010 The Mighty Macs Ed Rush awaiting release === TV shows === Year Show Role Other notes 1993 Married... with Children Frank 1 Episode - Movie Show 1997 - 2003 Buffy the Vampire Slayer Angel 57 Episodes - series regular season 2-3, guest star season 1, 4-5, 7 1999 - 2004 Angel Angel 110 Episodes 2002 Baby Blues Johnny 1 Episode - Teddy-Cam 2006 Punk'd Himself Boreanaz and wife Punk'd at a diner 2005 - 2017 Bones Seeley Booth 94 episodes; co-producer since Season 3 with Emily Deschanel, Producer with Emily Deschanel since season 4 === Video games === Year Game Role Other notes 2002 Buffy the Vampire Slayer Angel Kingdom Hearts Squall Leonhart Did not return for Kingdom Hearts 2 == References == == Other websites == * * Bullz-Eye.com interview (November 1, 2006) * the Globe & Mail interview (October 10, 2005) Category:1969 births Category:Living people Category:American movie actors Category:American Roman Catholics Category:American television actors Category:American voice actors Category:Actors from Buffalo, New York Category:Actors from Philadelphia Category:American movie directors Category:American movie producers Category:American television directors Category:American television producers Category:Saturn Award winners",
 "title": "David Boreanaz"
}