{
 "id": "1035286",
 "text": "The Kurds of Central AnatoliaIngvar Svanberg, Kazak Refugees in Turkey: A Study of Cultural Persistence and Social Change, Academiae Ubsaliensis, 1989, , p. 28. Rohat Alakom, Orta Anadolu Kürtleri, Evrensel Basım Yayım, 2004, . (Kurdish: Kurdên Anatolya Navîn) are the Kurdish people who have immigrated and been in Central Anatolia (present day Aksaray, Ankara, Çankırı, Çorum, Eskişehir, Karaman, Kayseri, Kırıkkale, Kırşehir, Konya, Nevşehir, Niğde, Sivas, Yozgat provinces) since about 16th century.Rohat Alakom, ibid, p. 14. Ayşe Yıldırım, Ç. Ceyhan Suvari, İlker M. İşoğlu, Tülin Bozkurt, Artakalanlar: Anadolu'dan etnik manzaralar, E Yayınları, , p. 166. They number between 50,000 and 100,000 people. The core of the Kurds of Central Anatolia is formed by Tuz Gölü Kürtleri () who live in the provinces Ankara, Konya and Aksaray.Müslüm Yücel, \"Tuz Gölü Kürtleri\", I-VIII, Yeni Gündem gazetesi, 2000, İstanbul. == Early Kurdish migration == The Germiyanids, were promient Anatolian beylik, consisting of both Turks and Yazidi Kurdish tribesmen, who had been brought to western Anatolia by the Seljuks as militia guards against threatening Turkish tribesmen. Some sources described Germiyanids as Turkish and Kurdish mixed origin others described them as Turkomans. They joined Ottomans in 1428. == Tribes == The largest tribes of the Kurds of Central Anatolia are the Bazaini or Shaikh Bazaini, Judikan, Saifkan, Chelebi, Janbeki, Jehanbegli, Khallikan, Mutikan, Hajibani, Barakati, Badeli, Ukhchizhemi, Rashvan, Sherdi, Urukchi, Milan, Zirikan, Atmanikan, and Tirikan. Formerly, some of the Janbegli, Rashvan and Milan tribes were of Alevi origin and followed Alevism.Rohat Alkom, ibid, p. 63. Two or the four primary languages are used by the Central Anatolian Kurds. These are Kurmanji dialect of Kurdish and Zaza. Generally, their mother language is Kurmanji Kurdish who have difficulty understanding the dialect spoken in Haymana where the Şêxbizin tribe live.Peter Alford Andrews, Türkiye'de Etnik Gruplar, ANT Yayınları, Aralık 1992, , s. 155. It is said that the new generation of Kurdish people in some settlements no longer speak Kurdish.Dr. Mikaili, \"Devlet Kürtçe'ye Kapıları Açtı, Ya Biz Orta Anadolu Kürtleri ?\" , Bîrnebûn, Sayı: 45, Bahar 2010, === Koçgiri tribe === The Koçgiri (Kurdish: Qoçgirî) is a Kurdish tribal conferedation mainly live in Sivas Province, Turkey.: \"Bu aşiretler katgısız Kürt aşiretleri olup, Sivas vilayetine bağlı Zara ilçesinin Ümraniye, Karacaviran, Bulucan ve Beypınar nahiyeleri mıntıkasında 300 köylere yerleşmişlerdir. [These tribes are unadulterated Kurdish tribes and settled in 300 villages in Ümraniye, Karacaviran, Bulucan and Beypınar districts of Zara district of Sivas province.]\" The Koçgiri tribes claim to have left Dersim and arrived in this region several centuries ago, and their customs, culture and physiognomy are completely similar to those of the Dersimites and they retain their links with Dersim. They spoke Kurmanji and are Alevis. It is possible that the Koçgiri tribes came to this region by forced deportation during the reign of Selim I. But this tribes; It never came under the influence of the Ottoman Empire. They are always armed and have a wealth of rifles and ammunition. The tribe staged a rebellion in 1921 against Turkish Government of Ankara and brutally suppressed. == References == == Sources == * * * * * Category:Central Anatolia Region Category:Turkish people",
 "title": "Central Anatolian Kurds"
}