{
 "id": "1036372",
 "text": "The Family Association Gräff-Graeff () is an organization for descendants of the dynastic Von Graben family. These include the De Graeff noble house with its lines De Graeff, De Graaff, Graeff and Gräff, descendants of the Austrian nobleman Wolfgang von Graben († 1521). The Op den Graeff family with his main lines Updegraff and Updegrove is part of the Family Association as an associated family because, according to their tradition, they also descend from Wolfgang von Graben. The Association also offers memberships for the former princely and countal von Orsini-Rosenberg family, which also comes from the House of Graben. The Association was created in 2013 and officially registered in Austria. ==History== The idea for the creation of a Family Association was thought up by the cousins Senator Andreas Gräff, Doris Bogner- Gräff and Matthias Laurenz Gräff, members of an extramarital branch of the Dutch (De) Graeff family now located in Austria, in order to strengthen the links between the family lines. Following a family reunion in 2013, the founders then wrote to all the Graeffs inside and outside Austria and Europe who had been in communication with their immediate family and it was agreed that a Family Association should be created. In that year the Gräff-Graeff Family Association (Familienverband Gräff-Graeff e. V.) was formed and officially registrated in Austria with Matthias Laurenz Gräff as chairman.www.gars.at Familienverband Gräff-Graeff e. V.Austrian association register (Vereinsregister-Abfrage Online) (Code 597756615) The Family Association is an organization of the alleged descendants of the Austrian noble Wolfgang von Graben, known by the names Gräff, Graeff, De Graeff, De Graaff respectively.Genealogisches Taschenbuch der Ritter- u. Adels- Geschlechter, Band 3, p 229 (1870)De Graeff (Pieter Graeff) and Von Graben in the dutch \"DBNL\"Der deutsche Herold: Zeitschrift für Wappen-, Siegel- u. Familienkunde, Band 3, p 91/92, von Verein Herold Note: De Graeff was the Dutch spelling of Von Graben during the 14th and 15th century.Wörterbuch der deutschen Sprache in Beziehung auf Abstammung und Begriffsbildung, p 254, by Conrad Schwenck (1834) The Family Association pursues the following goals: * Our Association serves to get to know, communicate, exchange ideas, research and bring together the Graeff families, alleged and claimed natural descendents of the Austrian noble Wolfgang von Graben († 1521). The chairmanship and administration of the Family Association must not be confused with the function of a head of the whole family and their different branches. The Association also offers associate Memberships to the partners, children and grandchildren of Graeff members, as well as members of the family of Orsini-Rosenberg, who share the same ancestors as the Graeff family, the Von Graben. In 2014, the Association founded branches in The Netherlands and South Africa with official representatives. That same year, members and representatives of the US-families Updegraff and Updegrove were also admitted as associate members into the Family Association. They are descendants from the originally Dutch-German Op den Graeff family, which according to their family tradition also descended from Wolfgang von Graben. Togetjer eith the Updegraff and Updegrove families the Association has around 150 members. The official statement of the family association on the Op den Graeff family states: * The origin of the originally german or dutch Op den Graeff family from the von Graben family cannot be proven, since no source is given. This theory is only maintained by their descendants.Family Association Gräff-Graeff In 2014, on the occasion of 530 years of family Graeff, a reunion took place at Schloss Kornberg in Styria, Austria, the former seat of Wolfgang von Graben. In 2022, Karl von Habsburg, head of the Habsburg-Lorraine family, the former Roman-German and Austrian imperial family, attended a presentation of the family flag with the dates of the anniversary. In 2024, the family association founded a sixth country representation in Oceania / Australia. Reunion \"530 Jahre Graeff\" auf Schloss Kornberg.jpg|Reunion 530 years Graeff at Castle Kornberg (2014) Matthias Laurenz Gräff und Karl von Habsburg vor dem Graeff-Wappen.jpg|Matthias Laurenz Gräff and Karl von Habsburg in front of the family flag of the anniversary (2022) === Letter of honor from the Gräff- Graeff family association === The Letter of honor (german: Ehrenbrief) is awarded as an official award by the Family Association Gräff-Graeff. Since 2024, the Association has been honoring people who have made outstanding contributions to cultural life. This award is intended to continue a tradition that the De Graeff family maintained as patrons of the arts during the Dutch Golden Age. These included in particular the painters Rembrandt, Govaert Flinck, Gerard ter Borch, Jacob van Ruisdael, Caspar Netscher, Gerard de Lairesse, the sculptor Artus Quellinus and the poet Joost van den Vondel. The pin with the coat of arms of (De) Graeff was chosen as a badge of honor for the letter of honor in order to emphasize the tradition and solidarity. The letter of honor will be presented by Matthias Laurenz Gräff in his capacity as chairman of the Family Association.Family Association Gräff-Graeff, Letter of honor ==== List of awards ==== In 2024, the awarded ones will come from the European cultural country of Greece. * Cultural association Nei Pori and the board members Evfrosini Papamichail (Chairwoman), Vasiliki Bouziota (Chairwoman-deputy) and Katerina Douga (Secretary) for their invaluable and tireless contribution to the cultural events of the community * Evelyn Wallner Papadopoulou, the Honorary Consul of Austria in Thessaloniki because of her unifying work as Honorary Consul of Austria in Thessaloniki and as artistAustrian newspaper www.meinbezirk.at, NEOS X - International in Griechenland. Empfang von Matthias Laurenz Gräff im Österreichischen KonsulatAustrian newspaper www.noen.at, Garser bei Auslandstreff. NEOS Respresentative Gräff: Über Kunst und Politik in Griechenland * Giorgos Vrontinos, painter and teacher from Litochoro at Mount Olympus who receives this award because of his cultural activity as a painter and because of his \"invaluable and tireless contribution\" to the community, the cultural events of the municipality of Dion-Olympos ==Board members== Board and Representatives (Reps) as since 2024 * Chairman: Matthias Laurenz Gräff (Rep Austria, Germany and Greece) * Treasurer: Christine Elaine Updegraff (Rep United States of America) * Secretary: Ann Updegraff Spleth * Jkvr. Inge Josina Agneta van Hartskamp-De Graeff (Rep The Netherlands) * Sarah de Graeff (Rep South Africa) * Jhr. Maurits de Graeff (Rep Australia / Oceania) * Stephen Craig Updegrove (Rep United States of America) ==Chairmen== Name Coat of arms State Start term End term Matthias Laurenz Gräff (* 1984) Austria 2013 / ==References== == Other websites == * Official Website * www.gars.at, Familienverband Gräff-Graeff e. V. * Austrian association register (Vereinsregister-Abfrage Online) (Code 597756615) * Freiwilligencenter Niederösterreich. Vereinsdatenbank G",
 "title": "Family Association Gräff-Graeff"
}