{
 "id": "1036147",
 "text": "A travel clock, travel alarm clock and in some cases pouch alarm clock, is an alarm clock whose primary characteristic is that it must have a dimension, design and weight, that make it easily transportable during a trip, so it is usually contained in a box or case. In the case of an alarm clock, the box must let the acoustic signal pass through in order to wake up from sleep at the set time or remember a specific date. == History == For a long time, watches were luxury items. For the majority of the population, sleep ended when it got light or when the rooster crowed. The few who had to rise before dawn were awakened by the night watchman. However, watches with an additional alarm function have been around for as long as classic watches, that is, since the 14th century. In Dante's masterpiece, his Divine Comedy of 1320, there is a very precise description of a clock equipped with a bell mechanism. Dante Alighieri: Die Göttliche Komödie. Übersetzt v. Karl Witte, Berlin (1916), S. 326: „gleich dem Uhrwerk, das zur Stunde (…) / Uns ruft, und, wie die Räder zieh’n und treiben, / Tin Tin erklingen läßt, so süßen Tones.“ Descriptions of water clocks have been preserved from antiquity, where the water level in a vessel indicated the time. Most had floats inserted, which activated bells or figures through a lever when it reached a certain level of filling. Landels, John: Water-clocks and time measurement in classical antiquity, in: Endeavour Jg. 3, 1979, H. 1, S. 32–37. doi:10.1016/0160-9327(79)90007-3 In 12th-century monasteries, alarm clocks with bell signals reminded people to observe prayer times. However, these \"clocks\" have not survived to this day, except in the form of manuscripts. Dohrn-van Rossum, Gerhard: Die Geschichte der Stunde. Uhren und moderne Zeitordnungen, München / Wien 1992, S. 102. == Pouch alarm clock == With the invention of portable clocks in the 16th century, the travel alarm clock became mobile thanks to the spring as an energy accumulator and the steering wheel . In the 1920s, travel alarm clocks were mass-produced with increasing mobility. At first resembling the travel alarm clocks of earlier eras, they were covered in an elegant case that protected the watch while traveling. At night the watch was taken out of its protective case and placed on the bedside table. Later, the machinery was permanently attached by a hinge to the pouch-like sheath. So the case not only protected the alarm clock, but was also its support. Hölig, Claire: Nur für mich, in: Hölig, Claire: Rasselbande – Kleine Kulturgeschichte des Weckers, Furtwangen 2017, S. 42 f. == Manufacturers of pocket watches == * Europe, Micro (watches), Peter == References == == Bibliography == * Charles Allix and Peter Bonnert, Carriage Clocks. Their history and development, Antique Collector's club, 1974 == Other websites == Category:Clocks Category:Travel",
 "title": "Travel clock"
}