{
 "id": "1036535",
 "text": "Cairo was the codename of an unreleased software project by Microsoft, intended to bring next-generation technologies to Windows NT. The project was originally announced at the 1991 PDC (Professional Developers Conference) and later demoed at the 1993 PDC. == SKUs == Three different retail SKUs were planned for Microsoft Cairo, all aimed at the enterprise market: * Cairo Advanced Desktop would include the core OS, new user interface, and networked storage/printer sharing. It was designed as the client for Cairo Servers. * Cairo Advanced Server would be a superset of Advanced Desktop that would additionally include all the server roles, as well as domain services, networked messaging, and management tools. * Cairo Design Environment would be intended for developers to build Cairo-friendly applications, including a Smart Folders SDK, authoring tools, design tools, debugger, documentation, and Visual Basic for Applications. === Windows NT 3.1 === * DCE RPC implementation (Remote Procedure Call, allows inter-machine or inter-process procedure calls, for example, to use with distributed computing) * COM (Component Object Model, a standardized communication model meant to be used with RPC) * OLE (Object Linking and Embedding, allowing files from one app to be embeddable and editable in other OLE-compliant apps) === Windows NT 3.5x / 4.0 === * Cairo OFS (Object File System, a relational filesystem meant to replace NTFS) * Cairo OFS Indexing (metadata system for OFS, later turned into Content Indexing and Windows Desktop Search) * Cairo Domains (based on x.500 Directory Services, later turned into Active Directory for Windows 2000) === Windows 95 / NT 4.0 / other === * Cairo User Interface (later turned into the Windows 95/NT 4.0 Shell) * Cairo Messaging (based on x.400 Messaging Services, later turned into Microsoft Exchange) * Cairo Smart Folders (would later influence Windows 7 libraries) == List of known builds == Build list legend # Available build i Confirmed build ? Unconfirmed build x Fake build \\---- == References == * https://web.archive.org/web/20070513113123/http://www.windowsitpro.com:80/Articles/Index.cfm?ArticleID=48&DisplayTab;=Article * https://web.archive.org/web/20070301102726/https://sigchi.org/chi96/proceedings/desbrief/Sullivan/kds_txt.htm Category:Operating systems",
 "title": "Cairo (operating system)"
}