{
 "id": "1036687",
 "text": "A constitutional court is a high court that deals primarily with constitutional law. Its main authority is to rule on whether laws that are challenged violted with constitutionally established rules. == History == === Before establishment of independent constitutional court === Prior to 1919, the United States, Canada and Australia had adopted the concept of judicial review by their courts, following shared principles of their similar common law legal system. === After establishment of independent constitutional court === In 1919 the First Austrian Republic established the first dedicated constitutional court, the Constitutional Court of Austria, which however existed in name only until 10 October 1920, when the country's new constitution came into effect, upon which the court gained the power to review the laws of Austria's federal states. The 1920 Constitution of Czechoslovakia, which came into effect on 2 February 1920, was the first to provide for a dedicated court for judicial review of parliamentary laws, but the court did not convene until November 1921. Subsequently, this idea of having a separate special constitutional court that only heard cases concerning the constitutionality of the national legislature's acts got adopted by many other countries such as Greece (1927), Spain (1931) and Germany (1949). == List of independent constitutional courts == The list below consists countries with separate constitutional courts. Yet some other countries do not have separate constitutional courts, but instead delegate constitutional judicial authority to their ordinary court system, with the final decision-making power resting in the supreme court. Nonetheless, such courts are sometimes also called \"constitutional courts\". For example, the Supreme Court of the United States has been called the world's oldest constitutional court because it was one of the earliest courts in the world to strike down a law as unconstitutional (Marbury v. Madison), even though it is not a separate constitutional court. * Albania * Angola * Armenia * Austria * Azerbaijan * Belarus * Belgium * Benin * Bosnia and Herzegovina * Bulgaria * Myanmar * Chad * Chile * Colombia * Democratic Republic of the Congo * Croatia * Czech Republic * Dominican Republic * Ecuador * Egypt * Gabon * Georgia * Germany * Guatemala * Hungary * Indonesia * Iran * Italy * Jordan * Kazakhstan * Republic of Korea (South Korea) * Kosovo * Kuwait * Kyrgyzstan * Latvia * Lebanon * Lithuania * Luxembourg * North Macedonia * Malta * Moldova * Mongolia * Montenegro * Niger * Peru * Poland * Portugal * Romania * Russia * Serbia * Singapore * Slovakia * Slovenia * South Africa * Spain * Suriname * Syria * Thailand * Turkey * Uganda * Ukraine * Uzbekistan * Zambia * Zimbabwe Category:Courts (law)",
 "title": "Constitutional court"
}