{
 "id": "1036297",
 "text": "Haian Dukhan (born 1980) is a British Syrian scholar and researcher known for his work on Syria's tribal networks and their interactions with the state. == Early life and education == Haian Dukhan was born in the 1980s in Palmyra, Syria. He has lived under an authoritarian regime almost all his life. His family's life was disrupted by the rise of ISIS, forcing them to flee their home. His mother was the director of a school and a teacher for 30 years. Haian Dukhan obtained BA degree in English Literature from Al-Ba'th University in Syria in 2003 and later earned master’s degree in International Development from the University of East Anglia. His academic excellence was recognized with the prestigious Chevening Scholarship in 2009. In 2012, Dukhan left Syria and pursued his academic career in Scotland. He completed a Ph.D. in International Relations at the University of St Andrews, ocusing on the complex relationships between the Syrian state and tribal communities International Relations. His doctoral thesis, \"Syrian Regime and Arab Tribes: Informal Alliances and Conflict Patterns in Contemporary Syria,\" contributed to his reputation as a knowledgeable scholar. Haian Dukhan is a Carnegie postdoctoral research fellow of the Central European University and a fellow of the Centre for Syrian Studies at the University of St Andrews. == Career == Dukhan worked for governmental and non-governmental entities inside and outside Syria, on issues related to counterterrorism and peace agreements. He taught Middle Eastern Politics at the University of Edinburgh and taught at the University of St Andrews and the University of Leicester previously. His research focuses on the issue of identity and political violence, with a particular focus on the tribal community associated with the Syrian state. He established the St Andrews Access Group (SAAG), which worked with the University’s equality and diversity officer to create a website called ‘Reporting accessibility difficulties across Fife’. Work continues to ensure St Andrews and other learning institutes; Students with disabilities have access to accommodation and a library. Dukhan's dedication to advocacy is further exemplified by his fundraising efforts for Children 1st, a prominent Scottish children's charity. === Scholarly work === Year Title Publisher 2021 The Politics of Tribalization in Syria International Journal of Middle East Studies 2021 Social change in Syria Family, Village and Political Party Contemporary Levant 2021 Iran’s Growing Network of Influence among Eastern Syrian Tribes Washington Institute 2021 Syria is a warning of climate disaster that region cannot ignore Middle East Eye 2021 Oil and water: what the ‘war on terror’ missed Asia Times 2020 Trusted networks: How the Assad regime subverts clan ties in Daraa Middle East Institute 2020 The civil war is threatening an ancient way of life in Syria Al Jazeera 2019 Critical analysis of attempts to co-opt the tribes in Syria Conflict Research Programme Blog 2018 State and tribes in Syria: Informal alliances and conflict patterns Routledge 2017 A Thematic Analysis of Vocal Hymns (Nasheeds) by the So-Called Islamic State of Iraq and Syria (ISIS) Journal for Intelligence Propaganda and Security Studies 2016 Tribes of Syria: Pieces on a chessboard? Hate speech International 2014 Tribes and tribalism in the Syrian uprising Syria Studies 2014 The Islamic State and the Arab Tribes in Eastern Syria E-International Relations 2014 'They Talk to Us but Never Listen to Us': Development-Induced Displacement among Syria's Bedouin Nomadic Peoples 2013 Tribes and tribalism in the Syrian revolution Open Democracy 2013 Syria and the risk of Somalisation Open Democracy 2012 Tribes and tribalism in the Syrian revolution Open Democracy == References == Category:Syrian people Category:Scottish academics Category:1980s births Category:Living people",
 "title": "Haian Dukhan"
}