{
 "id": "103662",
 "text": "{{Infobox Writer | image = 216 2310-Fernando-Pessoa.jpg | name = Fernando Pessoa | caption = photographed in 1914 | birth_date = | birth_place = Lisbon, Portugal | death_date = | death_place = Lisbon, Portugal | occupation = Poet, writer and translator | language = Portuguese, English (bilingual) | nationality = Portuguese | awards = |signature = Assinatura pessoa fernando.jpg |footnotes = }} Fernando António Nogueira Pessoa (Lisbon, 13 June 1888 - Lisbon, 30 November 1935), also known as Fernando Pessoa, was a Portuguese poet and writer. Pessoa is considered one of the greatest Portuguese poets. He has been compared to Luís Vaz de Camões. He was born in Lisbon and lost his father and younger brother when he was just five years old. At the age of seven, he relocated to Durban, South Africa, with his mother. There, the English language he learned would shape his writing. He remained in Durban until he turned seventeen. Pessoa composed poetry and other works as if they were authored by diverse personalities. Each character had their unique life experiences, physical traits, relationships with others, poetic voices, and perspectives. These characters are referred to as \"heteronyms.\" Pessoa created at least 72 of these alternative personas. His three primary poets, for instance, are characterized as follows: \"Alberto Caeiro, a simple, rural poet with profound ideas who wrote in free verse; Ricardo Reis, a physician who crafted formal odes inspired by Horace; and Álvaro de Campos, an adventurous naval engineer from London influenced by Walt Whitman and the Italian Futurists.\" Pessoa passed away from liver disease at the age of 47 in Lisbon. His final recorded words were in English: \"I know not what tomorrow will bring.\" ==Works== *Antinous: a poem, Lisbon: Monteiro & Co., 1918. *35 Sonnets, Lisbon: Monteiro & Co., 1918. *English Poems, Lisbon: Olisipo, 1921. *Selected Poems, tr. Edwin Honig, Swallow Press, 1971. *Selected Poems, tr. Peter Rickard, University of Texas Press, 1972. *The Book of Disquiet, (first published in Portugese in 1982; see below). *Always Astonished: Selected Prose, tr. Edwin Honig, San Francisco, USA: City Lights Books, 1988. *Fernando Pessoa: Self-Analysis and Thirty Other Poems, tr. George Monteiro, Gavea-Brown Publications, 1989. *Message, tr. Jonathan Griffin, Menard Press, 1992. *The anarchist banker and other Portuguese stories, Carcanet Press, 1996. *The Keeper of Sheep, tr. Edwin Honig & Susan M. Brown, Sheep Meadow, 1997. *Poems of Fernando Pessoa, tr. Edwin Honig & Susan Brown, San Francisco: City Lights Books, 1998. *Fernando Pessoa & Co: Selected Poems, tr. Richard Zenith, Grove Press, 1999. *Selected Poems: with New Supplement, tr. Jonathan Griffin, Penguin Classics; 2nd edition, 2000. *The Selected Prose of Fernando Pessoa ,tr. by Richard Zenith, New York, USA: Grove Press, 2001. *Sheep's Vigil by a Fervent Person: A Translation of Alberto Caeiro/Fernando Pessoa, tr. Erin Moure, House of Anansi, 2001. *The Education of the Stoic, tr. Richard Zenith, Exact Change, 2004. *A Little Larger Than the Entire Universe: Selected Poems, tr. Richard Zenith, Penguin Classics, 2006. *A Centenary Pessoa, tr. Keith Bosley & L. C. Taylor, Carcanet Press, 2006. *Selected English Poems, Exeter, UK: Shearsman Books, 2007. *The Collected Poems of Alberto Caeiro, tr. Chris Daniels, Exeter, UK: Shearsman Books, 2007. *Collected Later Poems of Álvaro de Campos, 1928–1935 tr. Chris Daniels, Exeter, UK: Shearsman Books, 2009. *Forever Someone Else: Selected poems, tr. Richard Zenith, Lisbon, Portugal: Assírio & Alvim, 2010. *Philosophical Essays: A Critical Edition, New York: Contra Mundum Press, 2012. *The Transformation Book—or Book of Tasks, New York: Contra Mundum Press, 2014. *The Complete Works of Alberto Caeiro, tr. Margaret Jull Costa and Patricio Ferrari. New Directions, 2020. *The Complete Works of Álvaro de Campos, tr. Patricio Ferrari and Margaret Jull Costa. New Directions, 2023. ==The Book of Disquiet in English== * The Book of Disquiet, tr. Alfred Mac Adam (New York: Pantheon Books, 1991.) * The Book of Disquiet, tr. Margaret Jull Costa (London, New York: Serpent's Tail, 1991.) * The Book of Disquiet, tr. Richard Zenith (London: Allen Lane, 2001.) * The Book of Disquiet: A Selection, tr. Iain Watson (London: Quartet Books, 1991.) *The Book of Disquiet: The Complete Edition, tr. Margaret Jull Costa (New York: New Directions, 2017.) * The Book of Disquietude, tr. Richard Zenith (Manchester: Carcanet Press, 1991.) ==References== Category:Writers from Lisbon Category:Portuguese poets Category:Deaths from liver disease Category:Disease-related deaths in Portugal Category:1888 births Category:1935 deaths",
 "title": "Fernando Pessoa"
}