{
 "id": "1036988",
 "text": "Kyle Preston (born 28 August 1984) is an American composer and sound designer. He works in the styles of ambient, cinematic, experimental and modern classical music. He composes music for short and feature films, mobile apps and video games. ==Biography== Preston was born and raised in Seattle on 28 August 1984. He has a background in astronomy and astrophysics, and his music is based on scientific realism. Among the musicians who have influenced his work are Max Richter, Ólafur Arnalds, Hildur Guðnadóttir and Jóhann Jóhannsson. In 2015, he created the soundtrack and sound effects for the indie game Prune. The developer of the game, Joel McDonald, decided to bring in Kyle Preston to record the music and minimalist soundtrack for the game. Preston also suggested redesigning the game to be more minimalist. He composed mainly ambient, with a calm atmosphere predominating, as well as emotional and intense moments. The game won Apple's 2015 iPad Game of the Year award, and Prune was also named mobile game of the year by Time magazine. On 20 May 2016, he released the album Scattered Silence. The album consists of short ambient pieces, each of which conveys the feeling of \"disarray and disturbance\". In 2022, composed the soundtrack for the narrative exploration game Hindsight. On 23 May 2022, the new album Vistas was released, which traces the impact of personal loss in Kyle's family. ==Reception== The American magazine The New Yorker described Kyle Preston's ambient music as \"minimalist in instrumentation but maximal in tension and emotion\". Todd Martens, a game critic who writes for the Los Angeles Times, called his music as \"otherworldly\". ==Discography== ===Albums=== Year Title 2015 Prune 2016 Scattered Silence 2017 Geo Ten Cues for No One 2018 Minimal Piano Sketches Acushla Paper Piano 2019 Ethos 2020 Like Clockwork Dead Video Game Pacific Northwest 2021 Lightless Voids 2022 Penrose Avenue Vistas Hindsight 2023 Críocha ===EPs=== Year Title 2016 Waltz of the Ghost Choir The Tale of Lucius Livius Minimal Piano Songs 2017 Geo Sketches Waves 2018 Beta Themes 2019 Paragon Emergence 2020 Alpha Themes 2022 Delicate Moments ==Awards and nominations== Year Recipient Award Category Notes Result References 2015 Prune App Store Awards Game of the Year Shared with: Joel McDonald and others 2023 Hindsight Apple Design Awards Social Impact Shared with: Team Hindsight ==References== ==Other websites== * Official website * Kyle Preston on Spotify Category:1984 births Category:Living people Category:21st-century American composers Category:American movie score composers Category:Video game composers",
 "title": "Kyle Preston"
}