{
 "id": "1036773",
 "text": "Connecticut Shotgun Manufacturing Co. is an American company that makes guns. It was started in 1975 by Antony S. Galazan in New Britain, Connecticut. At first, the company made small parts for guns. But now, it's known for making expensive and high-quality shotguns. == History == In 1975, Antony S. Galazan started Connecticut Shotgun Manufacturing Company. He learned how to make guns from an Austrian gunmaker in Connecticut. The government visited Galazan because he was making a lot of guns. They told him he needed a license. After getting the license, the company officially started. At the beginning, Galazan made gun parts and sold them. His first product was a tool to measure parts of a gun called a choke and barrel gauge. By 1989, Galazan was making almost every part of a shotgun. In 1990, he made his first gun. It was a special kind of shotgun called a sidelock over-and-under. He made it like a famous shotgun from Boss & Co. He made this gun in his factory in New Britain, and it was much cheaper than the ones made in London. Other people who made guns saw how good Galazan's work was. In 1992, Connecticut Shotgun got the permission to make A.H. Fox's guns. Galazan made these high-quality shotguns in different sizes. People said his Fox shotguns were even better than the original ones. In 1994, Connecticut Shotgun started making the Winchester Model 21 again. They bought a shop that used to make these guns. They also fixed old Model 21s. Another company, Remington, asked Galazan to make special Parker shotguns. From the 1990s to the early 2000s, Galazan made more amazing shotguns and better versions of the Fox, Parker, and Winchester guns. The company grew bigger and got more attention. Many skilled workers from different countries joined the team. The company's headquarters moved to a big space in New Britain. In 2006, Connecticut Shotgun made a good and affordable shotgun called the RBL. They also made other types of shotguns like the Inverness and A-10 American. They started selling B. Rizzini shotguns too. For a long time, Connecticut Shotgun was known for making special guns. They made limited edition Model 21s, .22 rifles, and big double rifles. They also made other special shotguns like the CSMC Model 21 O/U, CSMC Pointer Superlight, CSMC Superbird, CSMC Revelation, and CSMC G1. == Products == * A. Galazan - The highest quality shotgun from CSMC. An over-and-under full sidelock shotgun built to order in 12ga, 16ga, 20ga, 28ga, and .410 Bore. * A-10 American - An over-and-under full sidelock shotgun with removable sideplates built to order in 12ga, 20ga, 28ga, and .410 Bore. * Christian Hunter - * A.H. Fox - Side-by- side hand-built American shotgun based on the 20th century originals. CSMC has been making the A.H. Fox since purchasing the rights in 1994. * G1 - An over- and-under modular 12ga shotgun built for competition and trap shooting. Featuring a specially made vent rib and removable inspection ports. * Inverness - An over-and-under round action 20ga shotgun featuring a French Gray or Case Colored receiver. * Model 21 SxS - A side-by-side American shotgun based on the 20th century originals. CSMC has been making Model 21s since purchasing the Winchester Custom Shop in 1996. Available in 12ga, 20ga, 28ga, and .410 Bore. .22 double rifles are also made through special ordering. * Model 21 O/U - * Pointer Superlight - An over-and-under 20ga round action shotgun built for the field. Features a game scene engraving over a French- grayed finish on each side of the receiver with quail on the bottom. * Revelation - Considered CSMC's \"premier\" gun. An over-and-under 20ga round action shotgun featuring a traditional case colored or blued finish that covers the receiver entirely. * Superbird - An side-by-side target shotgun made with heavy duty engagements that add to longevity. Features a case colored receiver with \"Superbird\" engraved on the bottom. * Connecticut Shotgun also owns used/consignment brands from brands such as A.H. Fox (original), Beretta, Boss & Co., Browning, Fabbri, Holland & Holland, John Dickson & Son, L.C. Smith, Lebeau-Courally, Parker, Parker Reproduction, Perazzi, Piotti, Rizzini, Merkel, Westley Richards, Winchester, etc. == References == Category:Shotguns Category:Connecticut Category:Firearm manufacturers Category:1975 establishments in the United States Category:Manufacturing companies of the United States",
 "title": "Connecticut Shotgun"
}