{
 "id": "1036381",
 "text": "Neil Irwin Crone (born May 29, 1960) is a Canadian actor and writer. == Filmography == === Film === Year Title Role(s) Notes 1991 The Homework Bureau Chuck Spence Short film 1994 The Killing Machine Main Nurse 1998 Cousins Stan Direct-to-video 1999 Pushing Tin Tom 2000 Bruiser Boss Thomas and the Magic Railroad Gordon the Big Engine, Diesel 10, Splatter (voices) Replacement voice(s) of Keith Scott and Patrick Breen. Tumbleweed Uncredited voice Troublesome Trucks Original voice with Kevin Frank; Also creative consultant Bait Supervisor Left Behind: The Movie Ken Ritz Direct-to-video 2002 American Psycho II: All American Girl Harvey Rolie Polie Olie: The Great Defender of Fun Dr. Geary (video) Cube 2: Hypercube Jerry Whitehall 2003 The Recruit Farm Instructor #3 Rhinoceros Eyes Security Guard Love, Sex and Eating the Bones Anthony Mingelli Eloise at Christmastime Agent Kringle 2004 Against the Ropes HBO Commentator New York Minute Officer Strauss Care Bears: Journey to Joke-a- lot Bidel (voice) 2005 Re-Entering the Nightmare Jerry Whitehall Short film Direct-to-video Archival footage 2006 Hollywoodland Chuck Homie Spumoni Irish Cop 2007 Leader of the Track Hairspray Cop At Protest 2008 Eating Buccaneers Pilot 2011 Down the Road Again Jimmy 2014 Pushers Teacher Short film A Very Larry Christmas Santa 2015 The Rainbow Kid Keith 2017 Bon Cop, Bad Cop 2 Middle Brook Police Chief It Chief Borton Christmas Inheritance Jim Langford 2018 Through Black Spruce George Ode to Rita Lloyd Short film 2019 It Chapter Two Chief Borton An Assortment of Christmas Tales in No Particular Order Lloyd 2021 PAW Patrol: The Movie Tony (voice) Thomas and Friends: Race For the Sodor Cup Gordon the Big Engine (voice) U.S. dub 2022 Thomas & Friends: The Mystery of Lookout Mountain U.S. dub; uncredited 2022 Tehranto Dr. Urowitz 2022 Hotel for the Holidays Milton 2023 World's Best Sportscaster Cameo === Television === Year Title Role Notes 1990 My Secret Identity Phillipe The Concierge Episode: \"Sour Grapes\" 1991 Hammerman Additional voices The Red Green Show 'Doc' Render 4 episodes 1992 Stunt Dawgs Needham, Whiz Vid (voices) 11 episodes 1994 Free Willy Mr. Naugle (voice) RoboCop: The Series Coroner / Schmidt 3 episodes 1995 Cagney & Lacey: The View Through the Glass Ceiling Son Television movie The Magic School Bus Mr. Flack (voice) Episode: \"Out of This World\" 1995–96 The NeverEnding Story Additional voices 26 episodes 1995–97 Mr. Men and Little Miss Mr. Bump / Mr. Jelly / Mr. Messy / Mr. Rush / Mr. Nosey / Mr. Small US voices 4 episodes 1995–98 The New Adventures of Sherlock Holmes Wesley (voice) 78 episodes 1996 The Abduction Mr. Williams Television movie 1996–2000 Wind at My Back Ollie Jefferson 21 episodes 1997–2000 Freaky Stories Narrator (voice) 3 episodes 1997–1999 Monster Hunters Paul Crawford (voice) 52 episodes 1997 Dead Silence Airport Security Officer Television movie Once a Thief: Brother Against Brother The King Franklin Mr. Badger (voice) Unknown episodes The Adventures of Sam & Max: Freelance Police Additional voices Episode: \"We Drop at Dawn\" Goosebumps Blek / Host / Makeup Artist 2-part episode: \"One Day at Horrorland\" 1998 Mr. Chesney 2-part episode: \"The Ghost Next Door\" Dumb Bunnies Politician / Snow Bunny / Mr. Big's Assistant, Weatherman (voices) 4 episodes My Date with the President's Daughter Agent Kelly Television movie Nothing Too Good for a Cowboy Bartender Once a Thief The King Episode: \"Family Reunion\" Eerie, Indiana: The Other Dimension Mr. Crawford 15 episodes 1998–2000 Power Play Coach Harry Strand 22 episodes 1999 Coming Unglued Cop Television movie 1999–2000 Noddy Bud Topper Season 2 26 episodes Blaster's Universe Additional voices 13 episodes 2000 PSI Factor: Chronicles of the Paranormal Hank Kemper Episode: \"Force Majeure\" Babar Additional voices 13 episodes The Pooch and the Pauper Jim Corbett Television movie Mail to the Chief Gallagher 2001 Kiss My Act Joke Exchange M.C. The Wandering Soul Murders Jerry Murder Among Friends Melvin Jarvis The Day Reagan Was Shot Lyn Nofziger Screech Owls Muck 2 Sessions 26 episodes Blue Murder Jerry Kish Episode: \"Baby Point\" The Pretender: Island of the Haunted Alley Sports Bar Owner Uncredited Television movie Hippo Tub Co. Norton / Mayor Drip (voices) 3 episodes The Zack Files Marlon Episode: \"Captain Sonic\" 2001–03 Pecola Dr. Chu 15 episodes English voice 2002 The Associates Ralph Fort Episode: \"Winner Take All\" Tracker Chuck / Sedra Episode: \"Love, Cirronian Style\" Puppets Who Kill Councillor Trump Episode: \"Buttons, the City Councillor and the City Councillor's Wife\" Rescue Heroes Bickering Neighbor #1 (voice) Episode: \"Fiery Differences\" Widows Eddie Episode: \"Hour One\" Television miniseries Monk Terry T Episode: \"Mr. Monk and the Red-Headed Stranger\" Sue Thomas: F.B.Eye Patrol Man Episode: \"Pilot\" Verdict in Blood Coroner Television movie Our America Paxton Wade Master Spy: The Robert Hanssen Story Big FBI Man The Red Sneakers Coach Blake Moville Mysteries Mr. Caliente (voice) Episode: \"The Day Rico Became Smart\" 2002, 2003 RoboRoach RoboReg / Sluggies / Ivan (voices) 2 episodes 2002–03 I Love Mummy Ed Barnes 26 episodes 2002–07 American Bikers Theo Pickles (voice) Recurring cast 2003 Doc Dr. Englstad 2 episodes Odd-Job Jack Dr. Murphy / Tooth Fairy (voices) Episode: \"Fatal Extraction\" Mickeypalooza Himself Television special Street Time Congressman Reemer Episode: \"Cop Killer\" Jasper, Texas Principal Television movie 2004 Judgment Call Frank Bury the Lead Frank Bonero Episode: \"Cowboy\" 2004–10 Franny's Feet Additional voices 6 episodes 2005 True Crimes: The First 72 Hours Detective Reid Episode: \"Murder on Campus\" Documentary series Slam Dunk Dr. T (voice) English version 2005–08 Miss BG Dad (voice) 52 episodes 2006 At the Hotel Deacon 3 episodes Solar Attack Security Guard Television movie The Path to 9/11 Dorsey George Canyon's Christmas Guardian Angel 2006–07 Erky Perky Perky (voice) 24 episodes 2007 The Future Is Wild Zuma (voice) Episode: \"A Poggie's Not a Pet... Yet\" Storm Hawks Additional voices Season 1 only Iggy Arbuckle Robert 2007 (voice) Episode: \"Iggy vs. the Volcano/A Dip in the Pole\" Stir of Echoes: The Homecoming Gary Television movie True Crimes: The First 72 Hours Detective Alan Comeau 2 episodes: \"Predator\" and \"Lust\" Documentary series 2007–12 Little Mosque on the Prairie Fred Tupper Main cast 90 episodes 2008 The Summit General Stevens 2 episodes Gotta Catch Santa Claus Kiosk Santa / Snowman (voices) Television movie 2009 Warehouse 13 Mr. Ives Episode: \"Nevermore\" 2009–10 Pearlie Additional voices 4 episodes 2010 Super Why! Episode: \"King Midas\" Majority Rules Emcee Episode: \"Becky for a Day\" The Dating Guy Greg (voice) Episode: \"Brother from Another Tanning Booth\" 2011 King Hank Oclum Episode: \"Eleni Demaris\" The Adventures of Chuck and Friends Coach (voice) Episode: \"Chuck Atomic/Chuck's Big Break\" Reel Love Tom Meyer Television movie Wingin' It Mr. Cakebread Episode: \"Lucy in the Sky with Carl\" 2011–13 Really Me Ray Cooper 26 episodes 2012 Saving Hope Anthony Episode: \"The Fight\" XIII: The Series Joe Wolf Episode: \"Punchout\" 2013 Rookie Blue Wilson Burr Episode: \"Surprises\" Republic of Doyle Clark Cooper Episode: \"Firecracker\" 2013–14 Ella the Elephant Captain Gray / Captain Kelp (voices) 26 episodes 2013–16 Murdoch Mysteries Chief Crown Attorney Gordon 3 episodes 2014 The Adventures of Napkin Man! Monsieur Boulanger (voice) Episode: \"Hurry Up and Wait\" Dear Viola Earl Bellamy Television movie Midnight Masquerade Sam One Starry Christmas Ken Jensen The Stanley Dynamic Officer Ben Episode: \"The Stanley Crime\" The Strain Dr. Box Episode: \"Gone Smooth\" Odd Squad Santa Episode: \"Reindeer Games\" 2015 Remedy Clay Parr Episode: \"Our Friend, Chaos\" The Secret Life of Marilyn Monroe Ben Lyon 2 episodes Television miniseries Odd Squad Frustrated Man Episode: \"Puppet Show/Mystic Egg Pizza\" Total Drama Presents: The Ridonculous Race Dwayne (voice) 17 episodes 2016 Terrific Trucks Save Christmas Nick Television movie The Girlfriend Experience James Reade Episode: \"Home\" Rogue Earl Emmerson Episode: \"A Piece of Wood\" 2016–17 Luna Petunia Ashton 26 episodes 2017 Love on Ice Dave Shelton Television movie The Great Northern Candy Drop Bruce Good Witch Mr. Borba Episode: \"Without Magic for a Spell\" Mysticons Malachite Goldenbraid Episode: \"Heart of Gold\" 2017–18 Kody Kapow Mogo (voice) Main cast 2018 Carter Derwyn Episode: \"Happy Campers\" 2019 Northern Rescue Mayor Johnson 2 episodes: \"Making Lemonade\" and \"D-U-A-L-I-T-Y\" 2019; 2021 When Hope Calls Ronnie Stewart recurring role season 1; main role season 2 (12 episodes) 2019 Hotel Transylvania: The Series Additional voices Episode: \"A Year without Creepmas\" The Ninth Benjamin 'The Berg' Berger Main cast 2019–2020 Corn & Peg Mayor Montagu (voice) Main cast 2020–present Endlings Mr. Leopold Series regular 2020 Nurses Sal Episode: \"What Size Are Your Feet?\" 2021–present Thomas & Friends: All Engines Go Gordon the Big Engine (voice) Recurring role, U.S. dub Big Blue Captain No Beard/Spoony (voices) Supporting roles 2022 Ghosts Benjamin Franklin Episode: \"The Liquor License\" and \"The Christmas Spirit, Part 2\" 2023 Essex County Dr. Byrne Television miniseries == References == Category:1960 births Category:Living people Category:Canadian actors",
 "title": "Neil Crone"
}