{
 "id": "1036514",
 "text": "The Lok Sabha, the lower house of the Parliament of India, is currently made up of 543 constituencies. These constituencies each elect one Member of Parliament (MP). ==Summary== State/ Union Territory Seats Population (2011) Population per seat Gen. SC ST Total Andhra Pradesh 20 4 1 25 49,577,103 1,983,084 Arunachal Pradesh 2 - - 2 1,383,727 691,864 Assam 11 1 2 14 31,205,576 2,228,970 Bihar 34 6 - 40 104,099,452 2,602,486 Chhattisgarh 6 1 4 11 25,545,198 2,322,291 Goa 2 - - 2 1,458,545 729,273 Gujarat 20 2 4 26 60,439,692 2,324,604 Haryana 8 2 - 10 25,351,462 2,535,146 Himachal Pradesh 3 1 - 4 6,864,602 1,716,151 Jharkhand 8 1 5 14 32,988,134 2,356,295 Karnataka 21 5 2 28 61,095,297 2,181,975 Kerala 18 2 - 20 33,406,061 1,670,303 Madhya Pradesh 19 4 6 29 72,626,809 2,504,373 Maharashtra 39 5 4 48 112,374,333 2,341,132 Manipur 1 - 1 2 2,570,390 1,285,195 Meghalaya - - 2 2 2,966,889 1,483,445 Mizoram - - 1 1 1,097,206 1,097,206 Nagaland 1 - - 1 1,978,502 1,978,502 Odisha 13 3 5 21 41,974,219 1,998,772 Punjab 9 4 - 13 27,743,338 2,134,103 Rajasthan 18 4 3 25 68,548,437 2,741,937 Sikkim 1 - - 1 610,577 610,577 Tamil Nadu 32 7 - 39 72,147,030 1,849,924 Telangana 12 3 2 17 35,003,674 2,059,040 Tripura 1 - 1 2 3,673,917 1,836,959 Uttar Pradesh 63 17 - 80 199,812,341 2,497,654 Uttarakhand 4 1 - 5 10,086,292 2,017,258 West Bengal 30 10 2 42 91,276,115 2,173,241 Andaman and Nicobar Islands 1 - - 1 380,581 380,581 Chandigarh 1 - - 1 1,055,450 1,055,450 Dadra and Nagar Haveli and Daman and Diu 1 - 1 2 585,764 292,882 Jammu and Kashmir 5 - - 5 12,267,032 2,453,406 Ladakh 1 - - 1 274,000 274,000 Lakshadweep - - 1 1 64,473 64,473 Delhi 6 1 - 7 16,787,941 2,398,277 Puducherry 1 - - 1 1,247,953 1,247,953 Total 412 84 47 543 1,210,569,573 2,229,410 ==Andhra Pradesh (25)== Constituency No. Constituency Name Reserved for (SC/ST/None) 1 Araku ST 2 Srikakulam None 3 Vizianagaram None 4 Visakhapatnam None 5 Anakapalli None 6 Kakinada None 7 Amalapuram SC 8 Rajahmundry None 9 Narasapuram None 10 Eluru None 11 Machilipatnam None 12 Vijayawada None 13 Guntur None 14 Narasaraopet None 15 Bapatla SC 16 Ongole None 17 Nandyal None 18 Kurnool None 19 Anantapur None 20 Hindupur None 21 Kadapa None 22 Nellore None 23 Tirupati SC 24 Rajampet None 25 Chittoor SC ==Arunachal Pradesh (2)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Arunachal West None 2 Arunachal East None ==Assam (14)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Karimganj SC 2 Silchar None 3 Autonomous District ST 4 Dhubri None 5 Kokrajhar ST 6 Barpeta None 7 Gauhati None 8 Mangaldoi None 9 Tezpur None 10 Nowgong None 11 Kaliabor None 12 Jorhat None 13 Dibrugarh None 14 Lakhimpur None ==Bihar (40)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Valmiki Nagar None 2 Paschim Champaran None 3 Purvi Champaran None 4 Sheohar None 5 Sitamarhi None 6 Madhubani None 7 Jhanjharpur None 8 Supaul None 9 Araria None 10 Kishanganj None 11 Katihar None 12 Purnia None 13 Madhepura None 14 Darbhanga None 15 Muzaffarpur None 16 Vaishali None 17 Gopalganj SC 18 Siwan None 19 Maharajganj None 20 Saran None 21 Hajipur SC 22 Ujiarpur None 23 Samastipur SC 24 Begusarai None 25 Khagaria None 26 Bhagalpur None 27 Banka None 28 Munger None 29 Nalanda None 30 Patna Sahib None 31 Pataliputra None 32 Arrah None 33 Buxar None 34 Sasaram SC 35 Karakat None 36 Jahanabad None 37 Aurangabad None 38 Gaya SC 39 Nawada None 40 Jamui SC ==Chhattisgarh (11)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Sarguja ST 2 Raigarh ST 3 Janjgir–Champa SC 4 Korba None 5 Bilaspur None 6 Rajnandgaon None 7 Durg None 8 Raipur None 9 Mahasamund None 10 Bastar ST 11 Kanker ST ==Goa (2)== Constituency No. Constituency Reserved for (SC/ST/None) 1 North Goa None 2 South Goa None ==Gujarat (26)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Kachchh SC 2 Banaskantha None 3 Patan None 4 Mahesana None 5 Sabarkantha None 6 Gandhinagar None 7 Ahmedabad East None 8 Ahmedabad West SC 9 Surendranagar None 10 Rajkot None 11 Porbandar None 12 Jamnagar None 13 Junagadh None 14 Amreli None 15 Bhavnagar None 16 Anand None 17 Kheda None 18 Panchmahal None 19 Dahod ST 20 Vadodara None 21 Chhota Udaipur ST 22 Bharuch None 23 Bardoli ST 24 Surat None 25 Navsari None 26 Valsad ST ==Haryana (10)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Ambala SC 2 Kurukshetra None 3 Sirsa SC 4 Hisar None 5 Karnal None 6 Sonipat None 7 Rohtak None 8 Bhiwani–Mahendragarh None 9 Gurgaon None 10 Faridabad None ==Himachal Pradesh (4)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Kangra None 2 Mandi None 3 Hamirpur None 4 Shimla SC ==Jharkhand (14)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Rajmahal ST 2 Dumka ST 3 Godda None 4 Chatra None 5 Kodarma None 6 Giridih None 7 Dhanbad None 8 Ranchi None 9 Jamshedpur None 10 Singhbhum ST 11 Khunti ST 12 Lohardaga ST 13 Palamau SC 14 Hazaribagh None ==Karnataka (28)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Chikkodi None 2 Belgaum None 3 Bagalkot None 4 Bijapur SC 5 Gulbarga SC 6 Raichur ST 7 Bidar None 8 Koppal None 9 Bellary ST 10 Haveri None 11 Dharwad None 12 Uttara Kannada None 13 Davanagere None 14 Shimoga None 15 Udupi Chikmagalur None 16 Hassan None 17 Dakshina Kannada None 18 Chitradurga SC 19 Tumkur None 20 Mandya None 21 Mysore None 22 Chamarajanagar SC 23 Bangalore Rural None 24 Bangalore North None 25 Bangalore Central None 26 Bangalore South None 27 Chikballapur None 28 Kolar SC ==Kerala (20)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Kasaragod None 2 Kannur None 3 Vatakara None 4 Wayanad None 5 Kozhikode None 6 Malappuram None 7 Ponnani None 8 Palakkad None 9 Alathur SC 10 Thrissur None 11 Chalakudy None 12 Ernakulam None 13 Idukki None 14 Kottayam None 15 Alappuzha None 16 Mavelikara SC 17 Pathanamthitta None 18 Kollam None 19 Attingal None 20 Thiruvananthapuram None ==Madhya Pradesh (29)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Morena None 2 Bhind SC 3 Gwalior None 4 Guna None 5 Sagar None 6 Tikamgarh SC 7 Damoh None 8 Khajuraho None 9 Satna None 10 Rewa None 11 Sidhi None 12 Shahdol ST 13 Jabalpur None 14 Mandla ST 15 Balaghat None 16 Chhindwara None 17 Hoshangabad None 18 Vidisha None 19 Bhopal None 20 Rajgarh None 21 Dewas SC 22 Ujjain SC 23 Mandsour None 24 Ratlam ST 25 Dhar ST 26 Indore None 27 Khargone ST 28 Khandwa None 29 Betul ST ==Maharashtra (48)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Nandurbar ST 2 Dhule None 3 Jalgaon None 4 Raver None 5 Buldhana None 6 Akola None 7 Amravati SC 8 Wardha None 9 Ramtek SC 10 Nagpur None 11 Bhandara–Gondiya None 12 Gadchiroli–Chimur ST 13 Chandrapur None 14 Yavatmal–Washim None 15 Hingoli None 16 Nanded None 17 Parbhani None 18 Jalna None 19 Aurangabad None 20 Dindori ST 21 Nashik None 22 Palghar ST 23 Bhiwandi None 24 Kalyan None 25 Thane None 26 Mumbai North None 27 Mumbai North West None 28 Mumbai North East None 29 Mumbai North Central None 30 Mumbai South Central None 31 Mumbai South None 32 Raigad None 33 Maval None 34 Pune None 35 Baramati None 36 Shirur None 37 Ahmednagar None 38 Shirdi SC 39 Beed None 40 Osmanabad None 41 Latur SC 42 Solapur SC 43 Madha None 44 Sangli None 45 Satara None 46 Ratnagiri–Sindhudurg None 47 Kolhapur None 48 Hatkanangle None ==Manipur (2)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Inner Manipur None 2 Outer Manipur ST ==Meghalaya (2)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Shillong ST 2 Tura ST ==Mizoram (1)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Mizoram ST ==Nagaland (1)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Nagaland None ==Odisha (21)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Bargarh None 2 Sundargarh ST 3 Sambalpur None 4 Keonjhar ST 5 Mayurbhanj ST 6 Balasore None 7 Bhadrak SC 8 Jajpur SC 9 Dhenkanal None 10 Bolangir None 11 Kalahandi None 12 Nabarangpur ST 13 Kandhamal None 14 Cuttack None 15 Kendrapara None 16 Jagatsinghpur SC 17 Puri None 18 Bhubaneswar None 19 Aska None 20 Berhampur None 21 Koraput ST ==Punjab (13)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Gurdaspur None 2 Amritsar None 3 Khadoor Sahib None 4 Jalandhar SC 5 Hoshiarpur SC 6 Anandpur Sahib None 7 Ludhiana None 8 Fatehgarh Sahib SC 9 Faridkot SC 10 Firozpur None 11 Bathinda None 12 Sangrur None 13 Patiala None ==Rajasthan (25)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Ganganagar SC 2 Bikaner SC 3 Churu None 4 Jhunjhunu None 5 Sikar None 6 Jaipur Rural None 7 Jaipur None 8 Alwar None 9 Bharatpur SC 10 Karauli–Dholpur SC 11 Dausa ST 12 Tonk–Sawai Madhopur None 13 Ajmer None 14 Nagaur None 15 Pali None 16 Jodhpur None 17 Barmer None 18 Jalore None 19 Udaipur ST 20 Banswara ST 21 Chittorgarh None 22 Rajsamand None 23 Bhilwara None 24 Kota None 25 Jhalawar–Baran None ==Sikkim (1)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Sikkim None ==Tamil Nadu (39)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Thiruvallur SC 2 Chennai North None 3 Chennai South None 4 Chennai Central None 5 Sriperumbudur None 6 Kancheepuram SC 7 Arakkonam None 8 Vellore None 9 Krishnagiri None 10 Dharmapuri None 11 Tiruvannamalai None 12 Arani None 13 Villupuram SC 14 Kallakurichi None 15 Salem None 16 Namakkal None 17 Erode None 18 Tiruppur None 19 Nilgiris SC 20 Coimbatore None 21 Pollachi None 22 Dindigul None 23 Karur None 24 Tiruchirappalli None 25 Perambalur None 26 Cuddalore None 27 Chidambaram SC 28 Mayiladuturai None 29 Nagapattinam SC 30 Thanjavur None 31 Sivaganga None 32 Madurai None 33 Theni None 34 Virudhunagar None 35 Ramanathapuram None 36 Thoothukkudi None 37 Tenkasi SC 38 Tirunelveli None 39 Kanyakumari None ==Telangana (17)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Adilabad ST 2 Peddapalle SC 3 Karimnagar None 4 Nizamabad None 5 Zahirabad None 6 Medak None 7 Malkajgiri None 8 Secunderabad None 9 Hyderabad None 10 Chevella None 11 Mahbubnagar None 12 Nagarkurnool SC 13 Nalgonda None 14 Bhongir None 15 Warangal SC 16 Mahabubabad ST 17 Khammam None ==Tripura (2)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Tripura West None 2 Tripura East ST ==Uttar Pradesh (80)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Saharanpur None 2 Kairana None 3 Muzaffarnagar None 4 Bijnor None 5 Nagina SC 6 Moradabad None 7 Rampur None 8 Sambhal None 9 Amroha None 10 Meerut None 11 Baghpat None 12 Ghaziabad None 13 Gautam Buddha Nagar None 14 Bulandshahr SC 15 Aligarh None 16 Hathras SC 17 Mathura None 18 Agra SC 19 Fatehpur Sikri None 20 Firozabad None 21 Mainpuri None 22 Etah None 23 Badaun None 24 Aonla None 25 Bareilly None 26 Pilibhit None 27 Shahjahanpur SC 28 Kheri None 29 Dhaurahra None 30 Sitapur None 31 Hardoi SC 32 Misrikh SC 33 Unnao None 34 Mohanlalganj SC 35 Lucknow None 36 Rae Bareli None 37 Amethi None 38 Sultanpur None 39 Pratapgarh None 40 Farrukhabad None 41 Etawah SC 42 Kannauj None 43 Kanpur Urban None 44 Akbarpur None 45 Jalaun SC 46 Jhansi None 47 Hamirpur None 48 Banda None 49 Fatehpur None 50 Kaushambi SC 51 Phulpur None 52 Prayagraj None 53 Barabanki SC 54 Ayodhya None 55 Ambedkar Nagar None 56 Bahraich SC 57 Kaiserganj None 58 Shrawasti None 59 Gonda None 60 Domariyaganj None 61 Basti None 62 Sant Kabir Nagar None 63 Maharajganj None 64 Gorakhpur None 65 Kushi Nagar None 66 Deoria None 67 Bansgaon SC 68 Lalganj SC 69 Azamgarh None 70 Ghosi None 71 Salempur None 72 Ballia None 73 Jaunpur None 74 Machhlishahr SC 75 Ghazipur None 76 Chandauli None 77 Varanasi None 78 Bhadohi None 79 Mirzapur None 80 Robertsganj SC ==Uttarakhand (5)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Tehri Garhwal None 2 Garhwal None 3 Almora SC 4 Nainital–Udhamsingh Nagar None 5 Haridwar None ==West Bengal (42)== Constituency No. Constituency Reserved for (SC/ST/None) 1 Cooch Behar SC 2 Alipurduars ST 3 Jalpaiguri SC 4 Darjeeling None 5 Raiganj None 6 Balurghat None 7 Maldaha Uttar None 8 Maldaha Dakshin None 9 Jangipur None 10 Baharampur None 11 Murshidabad None 12 Krishnanagar None 13 Ranaghat SC 14 Bangaon SC 15 Barrackpore None 16 Dum Dum None 17 Barasat None 18 Basirhat None 19 Jaynagar SC 20 Mathurapur SC 21 Diamond Harbour None 22 Jadavpur None 23 Kolkata Dakshin None 24 Kolkata Uttar None 25 Howrah None 26 Uluberia None 27 Srerampur None 28 Hooghly None 29 Arambag SC 30 Tamluk None 31 Kanthi None 32 Ghatal None 33 Jhargram ST 34 Medinipur None 35 Purulia None 36 Bankura None 37 Bishnupur SC 38 Bardhaman Purba SC 39 Bardhaman–Durgapur None 40 Asansol None 41 Bolpur SC 42 Birbhum None == Union territories (19)== ===Andaman and Nicobar Islands (1)=== Constituency No. Constituency Reserved for (SC/ST/None) 1 Andaman and Nicobar Islands None ===Chandigarh (1)=== Constituency No. Constituency Reserved for (SC/ST/None) 1 Chandigarh None ===Dadra and Nagar Haveli and Daman and Diu (2)=== Constituency No. Constituency Reserved for (SC/ST/None) 1 Dadra and Nagar Haveli ST 1 Daman and Diu None ===Delhi (7)=== Constituency No. Constituency Reserved for (SC/ST/None) 1 Chandni Chowk None 2 North East Delhi None 3 East Delhi None 4 New Delhi None 5 North West Delhi SC 6 West Delhi None 7 South Delhi None ===Jammu and Kashmir (5)=== Constituency No. Constituency Reserved for (SC/ST/None) 1 Baramulla None 2 Srinagar None 3 Anantnag–Rajouri None 4 Udhampur None 5 Jammu None === Ladakh (1)=== Constituency No. Constituency Reserved for (SC/ST/None) 1 Ladakh None ===Lakshadweep (1)=== Constituency No. Constituency Reserved for (SC/ST/None) 1 Lakshadweep ST ===Puducherry (1)=== Constituency No. Constituency Reserved for (SC/ST/None) 1 Puducherry None ==References== Lok Sabha",
 "title": "List of constituencies of the Lok Sabha"
}