{
 "id": "1036450",
 "text": "Josef Haist (31 December 1894 – 21 January 1950) was an Austrian football player and coach. He played for Vienna AF from 1912 to 1919. He also played for the Austrian national team. He worked as a trainer for various clubs. ==Career == At the age of 15 he joined Normannia . From there he went to Neptune. At the age of 17 he became a player for Wiener AF. After two years he suffered a broken leg, which forced him to take a long break. Then came the First World War. Between 1914 and 1917 he played five times for the Austrian national team, when he was back from the Russian front. Another broken leg in 1917 saw the end of his time as a player. ==Manager== He began his time as a coach at WAF. He led them to the Austrian Cup win with a 2-1 final victory over the Wiener Amateur SV. After the decline of the WAF, he coached Sturm Graz. He was the first full-time coach in the club's history. Occasionally he also played for Sturm. In 1926–27 he took over at Brigittenauer AC, which he led to runners-up. From 1927 to 1930 he worked for SC Brühl in Switzerland. In February 1930 he took over the Grazer AK. At the same time he also trained the Grazer Hakoah. In January 1934 he followed Karl Kurz at FC Basel, where he remained until the middle of the year. After he coached the Slovakian club Trenčín, he took over a club in Eskilstuna in Sweden for two years. In January 1938 he went to the Swiss second division club FC Winterthur. In April 1941 he became coach of Admira Vienna. In July 1947 Haist was hired by the Styrian Football Association as an association coach. From 1939 on Haist also worked as a gymnastics and sports teacher at a high school in Vienna. ==Honours== *as player *Austrian champion:1914 *Austrian champion runners-up:1913, 1915 *as manager *Austrian Cup: 1922 with WAF Category:1894 births Category:1950 deaths Category:Association football midfielders Category:Austrian footballers Category:Players of the Austrian national football team Category:Austrian football managers Category:Austrian football champions",
 "title": "Josef Haist"
}