{
 "id": "1037816",
 "text": "The Kabul synagogue is a abandoned Jewish synagogue in Kabul, Afghanistan. Local people know it as the \"Jewish Mosque\". It was built in the 1960s. At that time, there were thousands of Jews in the city. Because it was damaged in the Second Afghan Civil War, and many Jews left, it fell into disrepair in the last decades of the 20th century. Also, the Taliban persecuted Jews. In the early years of the 21st century, the synagogue was home to Zablon Simintov and Yitzhak Levin, believed to be the last two Jews in Afghanistan, who served as the synagogue's caretakers. Levin died at the synagogue in 2005, and Simintov was evacuated from Afghanistan in 2021 after the Taliban takeover of the country. == Description and early history == In 1948, there were about 5,000 Jews in Afghanistan. In the early 1960s, the community built a synagogue around a small courtyard on Flower Street in downtown Kabul. The two-story building has two sanctuaries and was dedicated on March 29, 1966. The synagogue's door was made of corrugated iron and laden with Stars of David. There is also a Jewish cemetery on the outskirts of the city where 1,000 people are reportedly buried. By the 1960s, most Jews had emigrated. There were better economic opportunities in the United States and Israel. At the time, Afghanistan was the only country in the Muslim world that allowed Jews to emigrate and keep their citizenship. == Late 20th century == The country's last rabbi fled in 1988, and the last formal prayer services were held at the synagogue in 1990. In the mid-1990s, Zablon Simintov moved into the synagogue. At the time, the synague was the only functioning one in Kabul He moved there because his home was damaged during the Second Afghan Civil War. The Taliban had come to power in 1996, and the synagogue had been deserted and left in disrepair. The civil war left much of Kabul in ruins. All the Jews had left Afghanistan. After a brief stay in Turkmenistan, Simintov returned to Kabul in 1998 or 1999 and was the synagogue's live-in caretaker. He also operated a carpet business out of the synagogue. The Taliban considered the synagogue un- Islamic and as such, pillaged the synagogue. The regime frequently arrested Simintov and fellow resident Yitzhak Levin as part of the Islamist government's effort to remove non-Islamic influences from Afghanistan. In 1998, the Taliban confiscated almost all of the synagogue's items of value, such as a silver yad for reading the Torah and four silver bells. An unidentified Taliban commander, who was reportedly later held at Guantánamo Bay detention camp, confiscated the synagogue's Torah scroll estimated to be 400 years old. Simintov and Levin argued frequently about who was the rightful owner of the synagogue, and they lived in different wings of the synagogue. Each would complain to the Taliban about the other, to the point that the Taliban imprisoned both men. == 21st century == To disguise the synagogue from the outside, Simintov operated a kebab restaurant from the building called Balkh Bastan (Ancient Balkh) beginning in 2009. Levin lived downstairs until his death in 2005, when Simintov became the last Jew believed to be in Afghanistan and the synagogue's only live-in caretaker. Every Shabbat, Simintov would read the Torah from the synagogue's bimah. Simintov left Afghanistan in 2021. == References == Category:Kabul Category:Synagogues",
 "title": "Kabul synagogue"
}