{
 "id": "1037650",
 "text": "The Dinner Party is an art installation that was created by artist Judy Chicago from 1974 through 1979. Chicago made the art work with the help of many volunteers. It was first shown in 1979 at the at the San Francisco Museum of Modern Art. It is considered to be an important early part of the Feminist Art movement. It was purchased by the Brooklyn Museum in 2002. The table is triangular and measures 48 feet (14.63 m) on each side. There are 13 place settings on each of the table's sides, making 39 in all. Wing I honors women from Prehistory to the Roman Empire, Wing II honors women from the beginnings of Christianity to the Reformation and Wing III from the American Revolution to feminism. Each place setting features a table runner embroidered with the woman's name and images or symbols relating to her accomplishments, with a napkin, utensils, a glass or goblet, and a plate. Many of the plates feature a butterfly- or flower-like sculpture representing a vulva. A cooperative effort of female and male artisans, The Dinner Party is created with artistic techniques historically thought to be work done by women. These techniques include textile arts (weaving, embroidery, sewing) and china painting. ==Women represented in the place settings== The 39 women with places at the table are: Wing I: From Prehistory to the Roman Empire 1\\. Primordial Goddess 2\\. Fertile Goddess 3\\. Ishtar 4\\. Kali 5\\. Snake Goddess 6\\. Sophia 7\\. Amazon 8\\. Hatshepsut 9\\. Judith 10\\. Sappho 11\\. Aspasia 12\\. Boadicea 13\\. Hypatia Wing II: From the Beginnings of Christianity to the Reformation 14\\. Marcella 15\\. Saint Bridget 16\\. Theodora 17\\. Hrosvitha 18\\. Trota of Salerno 19\\. Eleanor of Aquitaine 20\\. Hildegard of Bingen 21\\. Petronilla de Meath 22\\. Christine de Pisan 23\\. Isabella d'Este 24\\. Elizabeth I 25\\. Artemisia Gentileschi 26\\. Anna van Schurman Wing III: From the American to the Women's Revolution 27\\. Anne Hutchinson 28\\. Sacajawea 29\\. Caroline Herschel 30\\. Mary Wollstonecraft 31\\. Sojourner Truth 32\\. Susan B. Anthony 33\\. Elizabeth Blackwell 34\\. Emily Dickinson 35\\. Ethel Smyth 36\\. Margaret Sanger 37\\. Natalie Barney 38\\. Virginia Woolf 39\\. Georgia O'Keeffe ==References== Category:1979 works Category:Installation art",
 "title": "The Dinner Party"
}