{
 "id": "1037706",
 "text": "The following list of prehistoric fishes is not a completely comprehensive list. Not all are listed here, only the ray-finned fish. Genera will have links to their corresponding articles, but species will not have any links. This list of prehistoric bony fish is an attempt to create a simple yet comprehensive listing of not all genera, but only a few examples. == List of prehistoric bony fish == Abadzekhia is an extinct genus of Oligocene snake mackerel. Aeoliscoides is an extinct genus of prehistoric bony fish that lived from the early to middle Eocene. Aglyptorhynchus is an extinct genus of prehistoric bony fish from the order Scombriformes. Allomorone is an extinct genus of prehistoric bony fish. Amphiperca is an extinct genus of prehistoric ray-finned fish that lived from the early to middle Eocene. Amiopsis is an extinct genus of prehistoric bony fish. Aeduella is an extinct genus of prehistoric bony fish. Aulorhamphus is an extinct genus of prehistoric bony fish that lived from the early to middle Eocene. Ascalabos is an extinct genus of prehistoric actinopterygian fish known from the Late Jurassic Solnhofen Limestone of Germany. It contains one species, A. voithii. Archaeolepidotus is an extinct genus of prehistoric bony fish that lived during the Early Triassic epoch. Bolinichthyes is an extinct genus of prehistoric ray-finned fish, a member of the order Myctophiformes. Its only species is Bolinichthyes longipes. Beerichthys ingens is an extinct prehistoric bony fish that was a member of the Ypresian London Clay fauna of lower Eocene England. Bawitius is an extinct genus of gargantuan bichir from the Upper Cretaceous. Bobasatrania is an extinct bony fish from the Triassic. Caturus (from Greek: κατω kato, 'down' and Greek: οὐρά ourá 'tail') is an extinct genus of prehistoric bony fish related to the modern-day bowfin. It is possibly non-monophyletic. Chibapsetta dolichurostyli is an extinct, prehistoric right-eye flounder that lived during the Pleistocene epoch in what is now Japan. Calamostoma is an extinct genus of prehistoric bony fish that belongs to the order Syngnathiformes. It lived from the early to middle Eocene. Cimolichthys is an extinct genus of nektonic aulopiformid fish. Dalpiazella brevicauda is an extinct species of eel. Daedalichthys is an extinct genus of prehistoric ray- finned fish. Gabanellia is an extinct, prehistoric perleidiform from the Late Triassic. Heterolepidotus is an extinct genus of prehistoric ray-finned fish, a member of the Amiiformes. Ichthyokentema (meaning \"fish-goad\") is an extinct genus of stem-teleost fish that has one species called Ichthyokentema purbeckensis. Kyphosichthys is an extinct genus of basal actinopterygian. Leedsichthys is an extinct genus of giant pachycormid. It has two species, the type being Leedsichthys problematicus, and the other being Leedsichthys notocetes. Leedsichthys is the largest fish known, with an estimated length of up to 16 metres. Lompoquia retropes is an extinct species of ray-finned fishes belonging to the family Sciaenidae. Palaeoatherina is an extinct genus of prehistoric bony fish. Rhenanoperca is an extinct genus of prehistoric perciform fish that lived from the early to middle Eocene. It is a kind of fossil fish. Robustichthys Scombroclupea is an extinct, prehistoric clupeiform that lived during the Cenomanian. Serenoichthys kemkemsis is an extinct genus of small bichir. Trachicaranx tersus is an extinct, prehistoric jackfish from what is now Turkmenistan. Tungtingichthys is an extinct, prehistoric perciform that lived during the middle division of the Eocene epoch of China. Uarbryichthys is an extinct genus of freshwater ray-finned fish that lived during the Upper Jurassic of Australia. Urosphen is an extinct genus of prehistoric bony fish that lived from the early to middle Eocene. Xiphactinus (from Latin and Greek for \"sword-ray\") was a large, 4.5 to 5 m (15 to 20 feet) long predatory bony fish that lived during the late Albian to the late Maastrichtian. It looked like a giant, fanged tarpon. Zignoichthys is an extinct genus of prehistoric pufferfish. In life, it would have resembled a paunchy triggerfish. Zaphlegulus is an extinct genus of mackerel-like fish found off the coast of what is now California during the late Miocene. It belongs to the family Euzaphlegidae. The type species is Zaphlegulus venturaensis. Zeuchthiscus is an extinct genus of prehistoric ray-finned fish that lived in Australia during the Early Triassic Period. == Related pages == * Amia ocellicauda * Hammerjaw * Aeoliscoides * Helicoprion * Evolution of fish * Alien invasion * Nelumbo nucifera * Mata mata * Belantsea * Bluefieldius * Bourbonnella * Alligator gar * Rhizodus * Acanthopleurus * Pleuropholis * Onchopristis == References == * Sepkoski, Jack (2002). \"A compendium of fossil marine animal genera\". Bulletins of American Paleontology. 364: 560. Archived from the original on 2011-07-23. Retrieved 2009-02-23. * Friedman, Matt (2007-08-10). \"Styloichthys as the oldest coelacanth: implications for early osteichthyan interrelationships\" (PDF). Journal of Systematic Palaeontology. 5 (3): 289–343. doi:10.1017/S1477201907002052. S2CID 83712134. Retrieved 2007-12-28. Category:Lists Category:Bony fish",
 "title": "List of prehistoric bony fish genera"
}