{
 "id": "1037310",
 "text": "The banded archerfish (Toxotes jaculatrix) is a brackish water fish of the genus Toxotes. It's famous for its ability to shoot water at prey. They are very difficult to take care of, so you may not want one in your aquarium. Banded archerfish are found in Indo-Pacific and Oceanian waters, generally in river mouths and mangrove estuaries. == Defenses == === Water shooting === The banded archerfish shoots a jet of water at its prey to knock them down and into the water. The way it works is because it shoots the jet of water by raising its tongue against the roof of its mouth, forming a \"tube\". The opercula then close quickly, pressurizing water along the tube. A study found that banded archerfish could be trained to hit moving targets at an accuracy rate of greater than 50%. == Description == Banded archerfish have four dorsal spines, 11 to 13 dorsal soft rays, three anal spines (of which the third is longest) and 15 to 17 anal soft rays. The first one is the shortest. The dorsal fin is yellowish-green and located towards the posterior end, and its base is shorter than that of the anal fin. The caudal fin is dirty green and about the same height until the point of attachment, where it becomes shallower. The anal fin is silver in color. == Behaviour == === Breeding === The breeding habits of an archerfish aren't well known. Banded archerfish first begin to breed when they are about 10 centimetres (3.9 in) long. The banded archerfish reproduces by spawning. The reports that archerfish go to saltwater reefs to spawn are not confirmed. == Distribution == It inhabits the Indo-Pacific and waters off northern Australia, and less frequently those on the southern coast of Australia. It can be found from India eastwards to the Philippines, southwards to Australia, as well as in waters off the Solomon Islands and the Indonesian Archipelago. == In aquaria == Toxotes jaculatrix is often kept as an aquarium fish, but sometimes, they can be aggressive. Banded archerfish are usually not recommended for average home aquaria despite their attractive appearance because they are so difficult to care for and require special conditions. == Related pages == * Toxotes chatareus == References == # Hoese, D. (2012). \"Toxotes jaculatrix\". IUCN Red List of Threatened Species. 2012: e.T196451A2458352. doi:10.2305/IUCN.UK.2012.RLTS.T196451A2458352.en. Retrieved 19 November 2021. # Froese, Rainer; Pauly, Daniel (eds.) (2010). \"Toxotes jaculatrix\" in FishBase. January 2010 version. # Weber, Max Carl Wilhelm; Lieven Ferdinand de Beaufort (1936). The Fishes of the Indo- australian Archipelago VII. The Fishes of the Indo-australian Archipelago. Vol. 7. Leiden: E. J. Brill Ltd. pp. 200–201. # McGrouther, Mark (15 May 2009). \"Banded Archerfish, Toxotes jaculatrix (Pallas, 1767)\". Australian Museum. Retrieved 11 February 2011. # Walker, Matt (2007). Fish That Fake Orgasms: And Other Zoological Curiosities (illustrated ed.). Macmillan. pp. 105. . # \"Toxotes jaculatrix\". Integrated Taxonomic Information System. Retrieved 18 February 2010. Category:IUCN Red List least concern species Category:Perciformes",
 "title": "Banded archerfish"
}