{
 "id": "1037978",
 "text": "The evolution of fish began about 530 million years ago during the Cambrian explosion. One of the earliest jawless fish evolved, including Haikouichthys, who dates back from the Middle Cambrian. The conodonts were another Agnatha. The earliest jawed vertebrates developed during the late Ordovician period. During the Devonian period, a great increase in fish variety occurred, especially among the ostracoderms and placoderms, and also among the lobe- finned fish and early sharks, which meant that this was the age of fishes. == Agnatha == The Agnatha (meaning \"no jaws\") is a superclass of fish in the phylum Chordata, subphylum Vertebrata. Agnatha comes from the Greek. The first armoured agnathans were the ostracoderms, precursors to the bony fish and hence to the tetrapods. === Conodonts === The conodonts are an extinct group of agnathans that looked like eels. They appeared in a different time and died out 200 million years ago. One of them is a creature called Promissum. == Chondrichthyes == The Chondrichthyes, consisting of sharks, rays and chimaeras, appeared by about 395 million years ago, in the middle Devonian. === Extinct cartilaginous fishes === * Helicoprion - a fish famous for its tooth whorls. * Goodrichthys - another genus of fish. * Megalodon - the largest Cenozoic predator ever to exist on Earth. == Living fossils == * Frilled shark * Gars * Australian lungfish * Protanguilla palau * Bowfin * Coelacanth * Bichir == Bony fish == === Actinopterygii === Actinopterygii is the class of ray-finned fish. Actinopterygians are the largest class of vertebrates. === Sarcopterygii === Lobe-finned fishes, class Sarcopterygii, are mostly extinct bony fishes. They lived a very long time ago. Most of them died already, while few, such as the coelacanths, have survived. The first tetrapodomorphs, which included the rhizodonts, had the same general anatomy as the lungfish, who were their closest kin, but they appear not to have left their water habitat until the late Devonian epoch (385 - 359 Ma), with the first appearance of tetrapods. == Devonian fish == === Placodermi === The placoderms were a class of armoured prehistoric fish. ==== Dunkleosteus ==== Dunkleosteus was a giant creature that lived during the Devonian period. ==== Materpiscis ==== Materpiscis was an organism from the Late Devonian. == References == * Lecointre, G; Le Guyader, H (2007). The Tree of Life: A Phylogenetic Classification. Harvard University Press Reference Library. * Haines, Tim; Chambers, Paul (2005). The Complete Guide to Prehistoric Life. Firefly Books. Category:Evolution",
 "title": "Evolution of fish"
}