{
 "id": "1037087",
 "text": "== About == The Student World Impact Film Festival or SWIFF is an annual international film festival founded by student Mark Leschinsky that focuses on showcasing films created by filmmakers with a strong emphasis on social issues. It is the world's leading platform for broadcasting films for students. In 2023, the organization received the Diana Award for its commitment to humanitarian work in the arts.The 2023 Diana award roll of honour on diana-awardPrince William and Prince Harry Unite for Award in Name of Late Mother Princess Diana on people.com == Founding History == The Student World Impact Film Festival was first established in 2020 by Leschinsky with the goal of encouraging student filmmakers to tackle pressing social and environmental issues through their creative storytelling. In March of 2022, it was certified as a 501(c)(3) nonprofit organization. Since then, it has grown to become a prominent event among other student film festivals, attracting entries from young filmmakers in 149 countries. == Mission == SWIFF is dedicated to promoting films that address and bring awareness to critical global issues. The festival aims to: * Empower student filmmakers to use their creativity for social change. * Create a platform for open dialogue and discussion about important global challenges. * Showcase the diverse perspectives and voices of the next generation of filmmakers. * Encourage the use of film as a powerful tool for positive change in society. == Location == The Student World Impact Film Festival is based in the United States in the State of New Jersey. It has a Post Office Box in Waldwick, NJ. On March 11, 2023, the festival received the support and recognition of the Governor of New Jersey, Phil Murphy == Festival Format == The festival typically runs for about a week, during which a wide variety of films are screened. These films cover a broad range of topics, including but not limited to environmental sustainability, social justice, human rights, and cultural diversity. In addition to film screenings, SWIFF often hosts panel discussions, Q&A; sessions with filmmakers, workshops, and other events that facilitate conversations about the themes explored in the films. Speakers are typically students from colleges or universities in the United States. In the past, SWIFF has hosted speakers from Harvard University, Yale University, Columbia University, Princeton University, and the American Film Institute. This format enables attendees to engage with the issues raised in the films and encourages a deeper understanding of the subject matter. == Winners == ===Mention of Jury=== * 2022 : King Max, short fiction movie by Adèle Vincenti-Crasson . === Honorable Mention === * 2022 : Appointment with Diego, medium-length movie by Lucas Morales * 2023 : Eclipse, animated short movie by Léna Stein * 2023 : The Venus Chained, medium-length documentary by Guillaume Gevart == Notes and references == == Other websites == * (en) Producer Dylan Besseau receives an honorable mention at SWIFF 2023, sur The Washington Mail * (en) Frank Dzikunu’s ‘Kindness Right Back At You’ Nominated For 2023 Student World Impact Film Festival, on theghanareport.com * (pt) Filme produzido por Marcela Coêlho, estudante da SP, é premiado pelo Student World Impact Film Festival, on spescoladeteatro.org.br * (en) Finalist Award for Best Documentary Announced at 2023 Student World Impact Film Festival, on yorku.ca * (en) “The Recess” nominated at Student World Impact Film Festival / 147th Official Selection, on stage32.com * (en) Student’s submission earns recognition at Student World Impact Film Festival, on psu.edu * (en) World Impact Film Festival 2023 : emergence of new talents, on Big News Network Category:Movie festivals",
 "title": "Student World Impact Film Festival"
}