{
 "id": "1038393",
 "text": "Herren von Graben, also known as vom Graben,In Upper Carynthia and East Tyrol, they are called generally vom Graben. Die Salzburger Lehen in Kärnten bis 1520 Grabner, ab dem Graben, von dem Graben, von Graben von (zum) Stein, Graben zu Kornberg, Grabner zu Rosenburg, were an ancient family of the Austrian aristocracy. == History == Originally from Carniola,Dizionario biografico dei friulani: \"Virgil von Graben\", by Sergio Tavano it was a cadet branch of the Gorizian dynasty, the Meinhardinians.Rudolf Granichstaedten-Czerva (1948): \"Brixen - Reichsfürstentum und Hofstaat\".Google book search: Das Land Tirol: mit einem Anhange: Vorarlberg: ein Handbuch für Reisende. Von Beda Weber The Von Graben originated in Carniola. the knight Conrad von Graben is mentioned in 1070 as the first reported member. He owned the old castle of Graben near Rudolfswerth (Novo mesto).Johann Weichard Freiherr von Valvasor: Die Ehre dess Hertzogthums Crain: das ist, Wahre, gründliche, und recht eigendliche Belegen- und Beschaffenheit dieses Römisch-Keyserlichen herrlichen Erblandes; Laybach (Ljubljana) 1689Adalbert Sikora: Die Herren vom Graben in Zeitschrift des historischen Vereines für Steiermark. 51. Jahrgang, Graz 1960, p 43Von Graben Forschung (german) The first member to emerge in history was Conrad of Graben († 1307), councilor of Styria. The Orsini-Rosenberg family is a junior branch of the Graben family, which began with Conrad II of Graben († before 1356), son of Conrad I, lord of Graben, Alt-Grabenhofen and Rosenberg.Collegium Res Nobilis Austriae: Orsini und Rosenberg Gothaischer Hofkalender: genealogisches Taschenbuch der fürstlichen Häuser, 1942, p. 274Genealogisches Handbuch des Adels. Ostsee, C. A. Starke., 2004, p. 264, Orsini u. Rosenberg Other important lines were the Lords of Graben at Kornberg (1328-1564) in Styria and at Sommeregg (1442-1534) in Carinthia. In 1487 the Grabner family bought the Rosenburg in Lower Austria. This line exists until the middle of the 17th century. There are numerous members of the family who have reached important positions such as politicians, soldiers and diplomats over the centuries. Old sources state that Wolfgang von Graben († 1521) was an ancestor of the De Graeff family. The Dutch family De Graeff has the same coat of arms. Family De Graeff at the Nieuw Nederlandsch Biographisch Woordenboek, part II However in 1776 Felix Jakob von Graben died and with him the noble family Von Graben. === Family lines === A detailed list of the lines and branches: # (Princly) Counts of Gorizia, Meinhardin ## Line Am Graben (Carniola), before 1170-13th century ### Line Am Graben, Grabenhofen (Graz, Styria), before 1259-1468 #### Branch at Thal, early 14th century-after 1341 #### Rosenberger branch (later House of Orsini-RosenbergI), after 1322 #### Line Grabner zu Rosenburg (Second line in Lower Austria), before 1314-mid 17th century #### Kornberg line (Styria), before 1325-1564 ##### First line in Lower Austria, 1324-1421 ##### First Tyrolean line, 2nd half 15th century-after 1519 ###### Swiss line, unknown ##### Graeff / De Graeff family (The Netherlands), around 1484 ##### Sommeregg line (Carinthia), before 1436-early 17th century ###### Line am Stein (Carinthia), 1500-1664 in male line ###### Second Tyrolean line, early 16th century-1776/80 == Family Association == In 2013 the worldwide Family Association Gräff-Graeff (Familienverband Gräff-Graeff e.V.) was founded for the claimed Graeff lineage of Wolfgang von Graben. The chairmanship and administration of the Family Association must not be confused with the function of a head of the whole family and their different branches. == References == Category:Noble families Category:Austrian nobility",
 "title": "Von Graben"
}