{
 "id": "1038037",
 "text": "The alligator gar (Atractosteus spatula) is a species of freshwater fish belonging in the genus Atractosteus that is closely related to the bowfin. Their common name was derived from their resemblance to the alligators. These gars are often referred to as living fossils. They have become an invasive species in Mainland China, where it can be purchased as an exotic pet fish. On September 4, 2009, a 3 ft 3 in (0.99 m) alligator gar was found in Tak Wah Park in Tsuen Wan, Hong Kong. Officials with Leisure and Cultural Services removed all the alligator gar from the ponds because they were concerned they would harm children. == Description == Alligator gar are the largest species in the gar family, and among the largest freshwater fishes found in North America. The alligator gar has a torpedo-shaped body. It resembles that of an alligator, which is a type of reptile. == Distribution == Alligator gar are a diverse fish species. They inhabit a wide variety of aquatic habitats, but most are found in the Southern United States in reservoirs and lakes, in the backwaters of lowland rivers, and in the brackish waters of estuaries, bayous, and bays. == Spawning == As with most ancestral species, alligator gar are long-lived, and sexually late maturing. == Taxonomy == In 1803, Lacépède first described the alligator gar. The old name was Lepisosteus spatula, but was changed by E.O. Wiley in 1976 to Atractosteus spatula. == In the aquarium == Despite their large size, they are kept as aquarium fish. These fishes require a very large aquarium or pond. In many areas, it is illegal for alligator gar to become your pets. == Related pages == * Atractosteus * Freshwater fish * Atractosteus africanus * List of fish common names * List of prehistoric bony fish genera == References == # \"Atractosteus spatula (Bernard Germain de Lacépède)\". Paleontological database. # Thompkins, Shannon (April 19, 2014). \"Once a nuisance, alligator gar increasingly protected\". Houston Chronicle. # Froese, Rainer; Pauly, Daniel (eds.) (2005). \"Lepisosteus spatula\" in FishBase. October 2005 version. == Other websites == * Alligator Gar Ad hoc Technical Committee Southern Division of the American Fisheries Society Taxon identifiers * Wikidata: Q522735 * Wikispecies: Atractosteus spatula Category:Freshwater fish Category:IUCN Red List least concern species Category:Animals of North America Category:Gars",
 "title": "Alligator gar"
}