{
 "id": "1038019",
 "text": "Walter Ludescher (born October 5, 1942) is a former Austrian football player and coach. He played as defender. By profession he was teacher. He later was a professor and head of the Bundesgymnasium/Bundesrealgymnasium Klagenfurt, Mössingerstraße. ==Career== Ludescher first played in the youth team at Klagenfurter AC. He began his career at SK Austria Klagenfurt in the then \"Tauernliga\" (league of the federal states of Carinthia and Salzburg). After a total of seven years, he briefly switched back to Klagenfurter AC and then to SK Rapid Wien. From 1964 to 1968 he played for FC Wacker Innsbruck. ==International== Walter Ludescher played seven matches for the Austrian national football team. His debut was on 27 September 1964 in a 3-2 win versus Jugoslavija. His last match was on 18 June 1966 in a 1-0 loss versus Italy.ÖFB profile ==Manager== He started as a junior coach at Wacker Innsbruck in the late 1960s. There he was Austrian champion in 1968/69 with the junior team. Ludescher began his coaching career with SV St. Veit, later FC St. Veit. In July 1980 he moved to the then second division team Austria Klagenfurt. In his second season they were champions and promoted to the Bundesliga. In his six years as head coach he not only led Klagenfurt's Austria back to the first Bundesliga, but also to the top eight four seasons in a row. In 1986 he went to SK Sturm Graz. In 1989 he switched to SV Spittal for a year. He then ended his coaching career in the 1990s. He concentrated on his work as teacher at a high school in Klagenfurt. After that he was taking over the coaching position of FC St. Veit in 1999/2000. From 2001 to 2008 he worked as a coachat \"FC KAC 1909\" (Klagenfurter AC), in April 2008 he took over the position of sports director. ==References== Category:1942 births Category:Living people Category:Austrian footballers Category:Players of the Austrian national football team Category:SK Rapid Wien players Category:Association football defenders Category:Austrian football managers Category:Austrian football defenders",
 "title": "Walter Ludescher"
}