{
 "id": "1038391",
 "text": "The 1880 United States presidential election was the 24th election in the history of the United States. It occurred on November 2, 1880. This election was between Congressman James A. Garfield of Ohio and Major General Winfield S. Hancock of Pennsylvania. Garfield won the election with 244 electoral votes, while Hancock got only 155 electoral votes. However, Garfield was assassinated during his first year in office in September 1881, and would be succeeded by his vice president, Chester A. Arthur. == Republican Party == === Presidential === * James A. Garfield, Congressman of Ohio's 19th District (1863-1880) (Nominee) * Ulysses S. Grant, 18th President of the United States (1869-1877) * James G. Blaine, Senator from Maine (1876-1881) * John Sherman, Senator of Ohio (1861-1877; 1881-1897) and Secretary of the Treasury (1877-1881) === Vice-presidential === * Chester A. Arthur, Chairman of the New York Republican Party (1879-1881) (Vice-Presidential Nominee) * Elihu B. Washburne, Former United States Minister to France (1869-1877) * Marshall Jewell, Chairman of the Republican National Committee (1880-1883) * Horace Maynerd, Postmaster General of the United States (1880-1881); Minister to the Ottoman Empire (1875-1880) * Blanche Bruce, Senator of Mississippi (1875-1881) * James L. Alcorn, former Senator of Mississippi (1871-1877) * Edmund J. Davis, former Governor of Texas (1870-1874) * Thomas Settle, Judge of the United States District Court for the Northern District of Florida (1877-1888) * Stewart L. Woodford, United States Attorney for the Southern District of New York (1877-1883) == Democratic Party == * Winfield Scott Hancock, Major General of the United States Army (1866-1886) (Nominee) * Samuel J. Tilden, former Governor of New York (1875-1876) and 1876 Democratic Nominee * Thomas F. Bayard, Senator of Delaware (1869-1885) * Stephen J. Field, Associate Justice of the Supreme Court from California (1863-1897) * Thomas A. Hendricks, former Governor of Indiana (1873-1877) and 1876 Democratic Vice- Presidential Nominee * William R. Morrison, Congressman of Illinois' 12th District (1873-1887) * Henry B. Payne, former Congressman of Ohio's 20th District (1875-1877) * Samuel J. Randall, Speaker of the House (1876-1881) and Congressman from Pennsylvania (1863-1875; 1875-1890) * Allen G. Thurman, President Pro Tempore of the United States Senate (1879-1880) and Senator from Ohio (1869-1881) === Vice-presidential nominee === * William H. English, former Congressman of Indiana's 2nd District (1853-1861) == References == Category:1880 in the United States Category:United States presidential elections",
 "title": "1880 United States presidential election"
}