{
 "id": "1038129",
 "text": "Javier Gerardo Milei (born 22 October 1970) is an Argentine politician, businessman, and economist who is the 58th and current President of Argentina since 2023. He was also a member of the Argentine Chamber of Deputies (parliament) from 2021 to 2023. ==Early life== Javier Gerardo Milei was born on 22 October 1970 in Palermo, Buenos Aires. For over 21 years, Milei has been a professor of macroeconomics, economics of growth, microeconomics, and mathematics for economists. Milei obtained an economics degree from the private University of Belgrano and two master's degrees from the Instituto de Desarrollo Económico y Social (Institute for Economic and Social Development) and the private Torcuato di Tella University. ==Political views== Milei has strongly criticized the presidencies of Cristina Fernández de Kirchner, Mauricio Macri, and Alberto Fernández. He is also critical of government economic policies that cause inflation and hurt the nation's economy. In order to solve Argentina's high inflation rate, high unemployment rate and other economic problems, he wants to abolish the Central Bank of Argentina and abolish the Argentine peso and replace it with the U.S. dollar as the national currency. Milei is a libertarian economist and has taught economics classes at the university. He got famous appearing on television shows, hosting a radio show and singing with a rock band. In 2019, Milei appeared in a yellow-and- black costume as the character \"General AnCap\", saying he comes from Liberland, a libertarian country of seven square kilometers between Serbia and Croatia, where the government does not make you pay taxes and individual freedom is supported. He is a member of La Libertad Avanza (Liberty Advances) coalition in Argentina. In foreign policy, he gives more importance in having ties with US and Israel. He also supports Ukraine against Russia during the Russian invasion of Ukraine. ==Presidency== ===2023 campaign=== Milei ran for president in Argentina's 2023 general election with Victoria Villarruel as his running mate. In August 2023, he was the most voted candidate in the primary elections which is considered a big upset. Subsequently, he was elected president in the runoff election on November 19. ===Tenure=== Milei took office as president on 10 December 2023. One of his biggest challenges as president include triple-digit inflation at 200 percent, rising poverty, and unpopularity of his ideas to the public. In a major foreign policy reversal, the Milei administration ended plans to join BRICS, which Argentina was set to join on January 1. ==Personal life== Milei is not married, and said that if elected president, he would have his sister take the role of First Lady. In August 2023, he announced that he is dating actress Fátima Flórez. He described himself as a sex instructor in 2020. Milei as Catholic. However, he has been critical of the Catholic Church under Pope Francis, calling him a communist and \"piece of shit\". ==References== ==Other websites== * Javier Milei's Government Plan Unveiled (in English) * Bases de acción política y plataform electoral nacionale 2023 (in Spanish) * Biography by CIDOB (in Spanish) Category:1970 births Category:Living people Category:Argentine economists Category:Businesspeople from Buenos Aires Category:Politicians from Buenos Aires Category:Libertarians Category:Writers from Buenos Aires Category:Presidents of Argentina Category:Current national leaders",
 "title": "Javier Milei"
}