{
 "id": "1038915",
 "text": "The Fußballgemeinschaft Salzburg was a wartime syndicate of three football clubs in the city of Salzburg, Austria (then Ostmark) during World War II and existed from April 1943 to April 1945. ==History== After Austria was taken over by the German Reich in 1938, the clubs in the Salzburg 1st Class and the Western Division League were qualified to take part in the promotion rounds to the then Gauliga. However, the political situation as well as the service obligations, conscription into the German Wehrmacht or the Reichsarbeitsdienst brought football to an almost complete standstill. SV Austria Salzburg, with German guest players who were stationed in Salzburg, became the strongest club in Salzburg's 1st class and won the championship in the 1939/40 and 1940/41 seasons. In 1941, after beating SK Amateure Steyr, the champion of the Oberdonauer 1st class, they made it into the promotion round to the Ostmark division class. In the promotion games, however, Salzburg failed because of the overwhelming opponents SK Sturm Graz, Post SV Wien and BSG Traisen. After this season, it was difficult to maintain the game in the Salzburg class. With the declaration of \"total war\" and the forced enlisting into the military of almost all capable players, the club didn't have enough players. In April 1943, the traditional clubs Salzburger AK 1914, SV Austria Salzburg and 1. Salzburger SK 1919 decided to join together to form the Fußballgemeinschaft Salzburg in order to be able to continue playing. The management of the association was divided between the officials of the individual clubs. When the new club started, there were only three established players from Austria Salzburg in the squad and young players from the other two clubs were added to the squad. The 1942/43 season had to be canceled because the new syndicate had only one competitor, Reichsbahn SG Salzburg.Austria Salzburg was declared champion.All promotion games against the competitors SK Amateure Steyr and 1. FFC Vorwärts 06 Wien were clearly lost. The Salzburg youth team only scored three goals and was hopelessly worse than their opponents. In the 1943/44 season, the FG Salzburg was the only Salzburg representative to play in the Oberdonau-Salzburg league, finishing eighth out of eleven teams. FG Steyr, which also emerged from the war-related merger of the Steyr clubs Amateure and Vorwärts, became champions of this league. In the aborted and unranked game season 1944/45, the matches were played exclusively by youth players. On April 8, 1945, shortly before the surrender of the German Reich, the FG Salzburg was dissolved. As early as autumn 1945, the three traditional clubs SAK, SSK and Austria set up their own teams again and occupied the first three places in the new Salzburg 1st class. Category:Football clubs of Salzburg Category:Austrian football clubs Category:Defunct football clubs",
 "title": "Fußballgemeinschaft Salzburg"
}