{
 "id": "1038997",
 "text": "Gian Carlo Riccardi (October 21, 1933 - February 7, 2015) was an Italian artist, painter, theatre director, sculptor and writer. M. R. Testa, New Art 2000, Casalpusterlengo, New Art Promotion, 2000, p.88. == Biography == Gian Carlo Riccardi was born on October 21, 1933 in Frosinone, Italy. His father, Armando Riccardi, was a lawyer and his mother, Rosa Amati, was a pianist. In 1961 Gian Carlo Riccardi graduated with honors in scenography at the Academy of Fine Arts in Rome in via Ripetta. Furthermore, during the academic period Riccardi was a pupil of Toti Scialoja and Mario Rivosecchi. After a few years, he obtained a diploma in Theater and Film Direction at the Experimental Center of Rome. He has been defined by the art critic Enrico Crispolti as a «multimedia artist» and has frequented writers and artists such as Achille Bonito Oliva, Alberto Moravia, Cesare Zavattini, Filiberto Menna, Giuseppe Bonaviri and Vito Riviello. Writers and journalists such as Angelo Maria Ripellino, Elio Pagliarani, Mario Lunetta and André Pieyre de Mandiargues have also written about him. Between the 60s and 70s he worked as a set designer and director at Rai and as assistant to set designers Carlo Cesarini from Senigallia and Giorgio Aragno. He is also editor of satirical magazines such as Il Travaso delle Idee, Marc'Aurelio, La Tribuna Illustrata, Simplicissimus and Il Borghese. He is part of the Roman Theater Avant-garde collaborating with Pino Pascali, Carmelo Bene, Mario Ricci, Memè Perlini and others. These experiences lead him to open in Frosinone, in 1961, the Visual Arts Laboratory Theater Group and later, in 1962, the Theater Club where he sets up, with various actors, artistic performances and shows theatrical. He takes part in events such as: the Teatro da Voi 1977 at the Spazio Uno theater in Rome, the New Theater Week (1978) and the 1984 Incontri at the Centro Associazione Stampa Grattacielo in Milan. The director's shows and performances are based on gestures and the need to express the condition of contemporary man, imprisoned in the daily routine and in the contradictions of life. In 1997 he founded the Theater of the Image. Riccardi's pictorial production deals with various themes such as the grotesque, the double, irony, but also the world of childhood, through drawing, caricature and abstract painting. The latter is achieved through the use of collage and ready-made. His works have been exhibited in solo and group exhibitions in Italy and abroad such as the ArtExpo exhibition in Geneva (1984), the British Art Fair in the City of London (1985 ), the Center International D'art Contemporain in Paris (1988), the Kodama Gallery in Osaka (1993) and the Fundació Antoni Tàpies in Barcelona (1999 ). In his sculptures Gian Carlo Riccardi uses poor materials such as plexiglas, paper, wood and iron. The Rooms, built since the 80s, are installations always made with simple and recycled elements (mainly wood and iron). These are examples of site specific works capable of building a dialogue with the surrounding space and with the observer. Riccardi exhibited his installations at the European Parliament in 1991, at the XLV Venice Biennale of Art in 1993, and at the Festival dei Due Mondi in Spoleto in 1995. He writes theatrical scripts, prose and poetic texts. In the latter various themes emerge (already addressed in the pictorial, theatrical and sculptural fields) concerning the surreal, the improbable and the memory. Gian Carlo Riccardi disappeared on February 7, 2015 in his hometown. == References == Category:Italian theatre directors Category:20th-century Italian painters Category:2015 deaths Category:1933 births",
 "title": "Gian Carlo Riccardi"
}