{
 "id": "1039080",
 "text": "An overseas constituency or an overseas electoral district is a constituency located outside a country's borders that represents people from that country who live overseas. ==Countries with overseas constituencies== ===Current=== Country Number of overseas seats Notes 8 Algeria reserves eight of its 382 parliamentary seats for Algerians living overseas, many of whom live in France. 3 Angola has passed legislation to create three overseas constituencies, but has not yet created them. 6 Six representatives are elected by Cape Verdians overseas: two to represent Cape Verdians living in Africa, two for the Americas and two for Europe and the rest of the World. 1 One seat in the Chamber of Representatives is reserved for Colombians living overseas. 3 One at-large, multi-member constituency is available for Croatians living overseas. 7 Seven representatives are elected by Dominicans living overseas: two to represent Dominicans living in the Caribbean and Latin America, two for Europe, and three for Canada and the United States. This was first introduced for the 2012 Dominican presidential election, when Dominicans living overseas could vote in by-elections for the new seats. 6 Six representatives are elected by Ecuadorians living overseas: two to represent Ecuadorians living in Latin America, the Caribbean and Africa; two for the United States and Canada; and two for Europe, Asia and Oceania. 11 In 2010, before the 2012 legislative election, the world was divided into eleven single-seat constituencies for French people living overseas to be represented in the National Assembly. 2 Guinea-Bissau has two overseas constituencies: one for Africa (Senegal, Gambia, Guinea, Cape Verde and Mauritania) and one for Europe (Portugal, Spain, France, Belgium and England).\"LISTA DOS DEPUTADOS ELEITOS\", National Election Commission, 20 March 2019. 12 Italy has four overseas constituencies, which elect members to both the Senate and Chamber of Deputies. 1 For Saeima elections, Latvians living overseas vote in the Riga constituency. 1 Lithuania has one overseas constituency since 2020. 3 Ahead of the 2011 election Macedonia created three parliamentary seats for its citizens abroad. They were divided into three constituencies comprising Europe/Africa, Americas, and Asia/Oceania. 2 Mozambique has overseas constituency one for citizens living in the rest of Africa, and one for those in the rest of the world. 2 As of 2021, 2 of Peru's 130 members of Congress are reserved for Peruvians living overseas. 4 Portugal's Assembly of the Republic has four reserved seats for Portuguese people living overseas: two for those living in the rest of Europe and the other two for those in the rest of the world. 6 Romania's bicameral Parliament consists of the Senate (136 seats, 2 reserved for Romanians living overseas; members serve 4-year terms) and the Chamber of Deputies (329 seats, 17 reserved for non-Hungarian national minorities and 4 for Romanians living overseas; members serve 4-year terms); 18 18 of the 217 members of the Constituent Assembly of Tunisia (elected in 2011) represent Tunisians living overseas. Almost a million Tunisians live overseas, including about 500,000 in France. At the last election, voting for Tunisians living overseas took place in 80 countries around the world. France, Tunisia's former colonial ruler, elected 10 representatives; Italy three; Germany one; North America and the rest of Europe two; and other Arab states two. ===Former=== Country Number of overseas seats Notes 1 The Cook Islands had one seat for Cook Islanders living overseas from 1981 until 2003. ==Related pages== * Reserved political positions * Right of immigrants to vote in their country of origin ==References== Category:Overseas constituencies",
 "title": "Overseas constituency"
}