{
 "id": "1039545",
 "text": "Masters of the Universe is a 1987 American superhero science fantasy movie. It is based on the 1983 animated television series He-Man and the Masters of the Universe, but does not follow the same timeline or story, with many details changing. == Plot == On the planet Eternia, the evil warlord Skeletor has taken over Castle Grayskull and imprisoned the Sorceress who guards it. Skeletor's enemies - superhero He-Man, veteran soldier Man-At-Arms and his daughter Teela - rescue Gwildor (an alien inventor) from Skeletor's soldiers. Gwildor reveals that Skeletor has stolen his invention: a \"Cosmic Key\" that can open a portal to anywhere by using musical notes. This is how Skeletor entered Castle Grayskull. He-Man, Gwildor and the others travel to Castle Grayskull and try to defeat Skeletor. However, Skeletor's army overwhelms them and they use the Cosmic Key to teleport away. He-Man, Gwildor, Man-At-Arms and Teela arrive on Earth but have lost the Cosmic Key. The Key is found by two California teenagers, Julie and Kevin, who accidentally transmit a signal which allows Evil-Lyn and Skeletor's minions to track it. They arrive on Earth at attack Julie, who is then rescued by He-Man. The damage destroys a school and Kevin cannot find Julie. The Cosmic Key is confiscated by a detective named Lubic. Evil-Lyn recovers the Key and summons Skeletor, who then breaks the Key. He-Man surrenders himself to save his friends and is taken back to Eternia. Skeletor becomes Master of the Universe using the powers of Castle Grayskull. On Earth, Gwildor, Kevin, Julie, Teela and Man-At-Arms fix the Key and are transported to Eternia. He-Man manages to get his sword back and fights Skeletor. After the battle, Julie and Kevin return to Earth. == Cast == * Courteney Cox as Julie, a teenage girl from California whose parents are dead * Robert Duncan McNeill as Kevin, the boyfriend of Julie * Dolph Lundgren as He-Man, a superhero from the planet Eternia who wields a magical sword * Frank Langella as Skeletor, an evil demon who wants to take over the universe * Meg Foster as Evil-Lyn, a wicked witch who works for Skeletor * James Tolkan as Lubic, a detective * Billy Barty as Gwildor, a short alien inventor who creates the Cosmic Key * Jon Cypher as Man-At-Arms, a veteran soldier who works with He-Man * Chelsea Field as Teela, the daughter of Man-At-Arms * Barry Livingston as Charlie, Kevin and Julie's friend * Christina Pickles as Sorceress, the guardian of Castle Grayskull * Anthony De Longis as Blade, a cyborg servant of Skeletor * Tony Carroll as Beast Man, a monster servant of Skeletor * Pons Maar as Saurod, an evil alien warrior who is killed by Skeletor * Robert Towers as Karg, a servant of Skeletor * Peter Brooks as Narrator == Reception == Masters of the Universe was released theatrically in the United States on August 7, 1987. It received mostly negative reviews from critics and fans. It earned $17 million at the box office, against a budget of $22 million, making it a commercial failure. However, as time went on, it has become a cult movie and is viewed more positively. == Sources == Category:1987 movies Category:American superhero movies Category:Movies about witchcraft Category:Cult movies",
 "title": "Masters of the Universe (movie)"
}