{
 "id": "1039161",
 "text": "The Sunrise of Lords in Lierna Lake Como (also known as Alba dei Signori) is a 20th-century divisionism oil painting by the Baron Vittore Grubicy de Dragon,Museo Civico Giovanni Fattori, Livorno, VITTORE GRUBICY DE DRAGON, Alba di lavoro; La vela; Alba di signori built on the shore of Borgo Villa in Lierna Lake Como in 1910. Grubicy's painting is part of the permanent collection of the Giovanni Fattori Civic Museum of Livorno.. Grubicy's paintings are exhibited in the last room that closes the long central hall together with Pollastrini's \"Gli esuli di Siena\", with a single number and title: «5», «Triptych».Pinacoteca livornese, Elenco delle opere, Livorno, Ortalli, 1920 The other works in the triptych are: \"Alba di Lavoro\" and \"La Vela\". == Museum == * Civic Museum of Livorno (Inv. n. 157/513, 1991/1106) == Description == The work created on the shore of Lierna on Lake Como. Among the other aspects of Grubicy's art, the practice of «continuously returning to himself, therefore also to canvases that have already been painted for years» is underlined to better render the impression he had in front of nature and «the character in itself of the natural spectacle ». The work is in fact connected to a triptych, whose first work dates back to 1887, when he was 36 years old, while this painting dates back to 1920, when the Baron was 60 years old.Primo Levi, \"L’Italico\", Il fenomeno Grubicy nella vita e nell’arte, «Rivista politica e letteraria», october 1900, Livorno, Ed. Officine grafiche Chiappini, 1910, pgg. 12 The work is a reworking of his whole life, and is the last work done by Baron Grubicy de Dragon before his death.Il Trittico di Vittore Grubicy, in «Il Telegrafo», Livorno, 7 august 1920 The horizontal paintings \"Alba di lavoro a Lierna\" and \"Alba di Signori a Lierna\" were donated by the artist to the Municipality of Livorno in 1920, shortly before his death, with the explicit intention of placing them side by side with the painting \"The sail in Lierna \" to make up the triptych. A testament to their importance for the artist and his link with the ancient village of Lierna on Lake Como. Barone Grubicy L'Alba dei Signori dettagli.jpg|L'Alba dei Signori in Lierna, winter effect,1880 Giovanni Fattori Civic Museum * == Bibliography == * Primo Levi, \"L’Italico\", Il fenomeno Grubicy nella vita e nell’arte, «Rivista politica e letteraria», october 1900, Livorno, Ed. Officine grafiche Chiappini, 1910 * Il Trittico di Vittore Grubicy, in «Il Telegrafo», Livorno, 7 august 1920 * Pinacoteca livornese, Elenco delle opere, Livorno, Ortalli, 1920 == References == ==Other websites== * Museo Civico Giovanni Fattori, Livorno, VITTORE GRUBICY DE DRAGON, Alba di lavoro; La vela; Alba di signori Category:1920s paintings",
 "title": "Sunrise of Lords in Lierna Lake Como"
}