{
 "id": "1039591",
 "text": "Ruslan Rishatovich Yunyaev (, born August 17, 1988, Sterlitamak, Bashkortostan, USSR) is a Russian musician, songwriter, journalist, TV correspondent. == Biography == Ruslan was born and grew up in a simple working family. His father, Rishat Jamilievich Yunyaev, worked as a pipe-laying machine operator at Lukoil; his mother, Klara Garafutdinovna Fakhretdinov, worked there as a control panel dispatcher. With the birth of his older brother Ruslan, they moved together from Sterlitamak to Langepas, but five years later Ruslan was born in Bashkiria, where he spent the first years of his life. From 2004 to 2005, he was a freelance youngster for the local TV company \"Langepas\". During the period of his work, he created and came up with more than 100 stories on topical issues for the programs \"Cheshuya\", \"Doors\", and \"Dobrye Novosti\". In 2005, Ruslan entered the faculty of journalism at St. Petersburg State University of Film and Television. During his studies he did not work in his specialty. At the end of 2009, he created his television project \"NEformat\", as part of University Television. When creating the program, he acted as a director, host, scriptwriter, set designer, editor, sound engineer, prepared stories, and selected guests. Due to Ruslan's first experience, the talk show failed miserably. But despite the merciless criticism of the audience, the program took part in the Open Festival \"Generation: A New Look\" of SPbSUKiT within the framework of the Week of Science and Creativity of SPbSUKiT, where it was appreciated. In 2011, he moved to Moscow, where he began his career in television. After graduating from university, Ruslan moved to Moscow, where he immediately got a job at the NTV TV channel, in the program \"Chrezvychaynoye proisshestviye\". In parallel, his reports were aired on the Segodnya program. Since 2012 he has been working in the program \"Good Morning\", on Channel One. He released a music single for the first time in 2019 \"Ненавижу\". == Creativity == === Musical career and first singles === Ruslan has no musical education. As a student, the performer was trained in a vocal studio. At the same time he wrote lyrics for his future songs. In 2008 the ballad \"Ненавижу\" was written, a year later the singer wrote the song \"Устал, поэтому ушёл\". For about 12 years the compositions lay unreleased . Only in 2019, Ruslan decided to return to music, recorded and released these two singles. In early 2021, work began on the debut music album. Ruslan recovered his lyrics. The music to them was written by the singer and composer Nadia Kodes. In late November 2021, the EP \"Первый\" was released. On December 13, 2021, Ruslan released an acoustic version of the album \"Первый\". == TV == * 2004-2005 — correspondent of the programs \"Cheshuya\", \"Doors\", \"Dobrye Novost\" (LTV, ). * 2011-2012 — correspondent for the program \"Extraordinary Incident\" (NTV, Moscow). * Since 2012 — correspondent for the program \"Good Morning\" (Channel One, Moscow). == Awards and nominations == === 2005 === * Winning in the nomination \"Best TV report on youth topics\" at the I District Festival of Youth Journalism (Khanty- Mansiysk). === 2014 === * Journalist award \"For objectivity and honesty\" at the III Congress of the movement \"Right to Arms\" (Moscow). * Medal \"20 Years of the Association of Veterans and Employees of the SBP\" (Moscow). == Discography == Studio albums Year Title Songs 2019 Ненавижу (Single) * Released: October 30, 2019 * Label: Ruslan Yunyaev * Format: Digital distribution 1 2020 Устал, поэтому ушёл (Single) * Released: February 29, 2020 * Label: Ruslan Yunyaev * Format: Digital distribution 1 2021 Не смогла (Single) * Released: June 23, 2021 * Label: Ruslan Yunyaev * Format: Digital distribution 1 2021 Всё решено (Single) * Released: July 29, 2021 * Label: Ruslan Yunyaev * Format: Digital distribution 1 2021 Первый (EP) * Released: November 29, 2021 * Label: Ruslan Yunyaev * Format: Digital distribution 6 2021 Первый. Акустическая версия (EP) * Released: December 13, 2021 * Label: Ruslan Yunyaev * Format: Digital distribution 6 2023 Игра (Single) * Released: March 12, 2023 * Label: Ruslan Yunyaev * Format: Digital distribution 1 == Videography == Music videos Year Clip Director 2021 «Не смогла» Ruslan Yunyaev, Yuri Tarabanov 2021 «Всё решено» Ruslan Yunyaev, Yuri Tarabanov 2021 «Устал, поэтому ушёл» Anna Bazhaikina 2023 «Игра» Ruslan Yunyaev == References == Category:1988 births Category:Living people Category:Russian singer- songwriters Category:21st-century Russian singers Category:21st-century Russian songwriters Category:People from Bashkortostan Category:Russian television presenters",
 "title": "Ruslan Yunyaev"
}