{
 "id": "1039739",
 "text": "The Estonian War of Independence was an armed conflict between the Republic of Estonia and Soviet Russia that lasted from November 28 , 1918 to February 2, 1920. There was also the Landesveer War, fought in southern Estonia and northern Latvia between June 5 and July 3, 1919, against the Baltic German forces. The troops of the German Empire, which occupied the territory of Estonia during the First World War, left Estonia due to the end of the World War. Taking advantage of the favorable situation, Soviet Russia decided to take over the Estonian territories again. The Red Army's attack on Narva on November 28, 1918 was the beginning of the war. The city was captured and the underequipped and significantly outnumbered units of the Estonian National Army were defeated. On November 20, the Deputy Foreign Minister of the United Kingdom Robert Cecil, expressed support for Estonia and promised military help. On December 12, the British ships under the command of Admiral Sir Edwyn Alexander-Sinclair arrived from Liepaja for a raid on Tallinn. The arrival of the fleet succeeded in the second attempt. In the first attempt, the light cruiser HMS Cassandra was sunk by a mine near Saaremaa, and the fleet turned back. They delivered 6,500 rifles, 200 machine guns, and two field guns. By the end of 1918, the 7th Red Army controlled Estonia along the front line 34 kilometers east of Tallinn, west from Tartu and south of Ainaži. By the beginning of 1919, the Estonian Army had 13,000 men. A 1,000-strong Finnish- Estonian force landed at Utria behind the Soviet 6th Rifle Division on 17 January. Narva was liberated the next day. The Estonians used armoured trains very successfully.Traksmaa, August: Lühike vabadussõja ajalugu, Olion, 1992, The British fleet brought weapons and equipment to Estonia and protected the northern coast of Estonia until January 5, 1919 , when it left the Baltic Sea . USA helped Estonia primarily with humanitarian aid. On December 31, 1919, Estonia and Soviet Russia concluded an armistice, which entered into force on January 3, 1920. The official end of the war came with the Treaty of Tartu on February 2, 1920 . With this, Soviet Russia recognized the independence of Estonia and forever renounced all rights that Russia had regarding the land and people of Estonia. League of Nations Treaty Series, vol. 11, pp. 30–71. ==References== Category:History of Estonia Category:Wars involving Russia Category:1910s conflicts",
 "title": "Estonian War of Independence"
}