{
 "id": "1039660",
 "text": "Bhagwan Ahir (died 1923) was born in Gorakhpur district, Uttar Pradesh. On 4 February 1922, an incident occurred outside the Chaura police station in Gorakhpur district, where a group of constables and watchmen clashed with a crowd of 2000-2500 peasants from neighboring villages. Most of the crowd did not have any weapons. The officer-in-charge of the police station, Gupteshwar Singh, made a fatal mistake by ordering the police to fire first in the air and then at the crowd, resulting in the death of some peasants and injuries to hundreds of others. This incensed the peaceful satyagrahi crowd, who retaliated by killing 22 policemen and chowkidars, and setting the police station on fire. ==Early life== Bhagwan Ahir was born to Shri Ram Nath Ahir in the Gwalbans subset of Ahirs.Chauri Chaura: 1922 by Vijay Shankar Chaturvedi. (1992). p. 201. \"Sita Ahir in an interview with me explicitly told that, ' hum sabhēn ta gwāl hayī, aūr Bhagwan chacchō uha rahalēn bāki Komal ke nāhī bata sakīt kahe kī onkar gaon lāme rahal aūr on uha nāhi rahat rahlēn'.\"Gorakhpur ke Shaheed by Amar Nath Prasad (1984) During the time of Chauri-Chaura incident, he was residing at one of his relative's house which lied in between Dumari and Chaura villages. He was a pronounced wrestler of his time too. ==Revolutionary activities== Bhagwan Ahir played a prominent role in the events that followed. He was a leading volunteer along with Bikram Ahir and drill instructor who taught others to march in formation and follow whistle commands. According to witness accounts, he brought thatching grass to burn the police station, helped to carry the body of the Sub-Inspector to the flames, and participated in the beating of constables who were subsequently killed. He was also accused of leading the volunteer crowd. Bhagwan Ahir was found guilty under section 302/149 of the Indian Penal Code and sentenced to death by the session court. He appealed to the High Court, but his appeal was rejected and he was executed in July 1923. ==In popular culture== Ahir and the events of the police station incident are the basis for the 2023 movie 1922 Pratikaar Chauri Chaura.https://www.amarujala.com/entertainment/movie- review/1922-pratirak-chauri-chaura-review-the-characters-of-gandhi-and- ancestors-played-slaves-role-read-here-2023-06-30?pageId=1 ==References== Category:1923 deaths Category:Indian criminals Category:People from Uttar Pradesh",
 "title": "Bhagwan Ahir"
}