{
 "id": "1039657",
 "text": "Souvlaki (, , ; plural: , ) is a Greek food made up of small pieces of meat and sometimes vegetables grilled on a skewer or spit. It is often eaten straight off the skewer while still hot. Souvlaki can be served with or inside a rolled pita, typically with lemon, sauces, vegetables like sliced tomato and onion, and fried potatoes. The meats used are pork, chicken, beef, and lamb. ==Name== The word souvlaki is a diminutive of the Greek word ( meaning \"skewer\") itself borrowed from the Latin word .Georgios Babiniotis, Λεξικό της Νεας Ελληνικής Γλώσσας, s.v.; Andriotis et al., Λεξικό της Κοινής Νεοελληνικής, s.v. σουβλάκι, s.v. σούβλα. ==History== In Greek culture, the cooking of meat on skewers goes back to the Bronze Age.. Sets of cooking supports made of stone were found on the Greek island of Santorini. They were used by the natives to cook souvlaki, \"a popular delicacy in Santorini back in 2000 BC\", before the volcanic eruption on the island of Thera in the 17th century BC. There are dents in the stone cooking supports likely used for holding skewers and the line of holes in the base allowed the coals to be supplied with air.Utilitarian terracotta object, Museum of Cycladic Culture, Akrotiri excavation artifacts, Santorini, Cyclades, Hellas (Greece). In Mycenaean Greece, \"souvlaki trays\" were found in Gla, Mycenae, and Pylos. The \"souvlaki trays\", or portable grills, used by the Mycenaean Greeks were rectangular ceramic pans that sat below skewers of meat. It is unclear whether these trays were put directly over a fire or if the pans held hot coals like a portable barbecue pit. Spit supports used for cooking food appear to \"continue in use into the Early Iron Age at Nichoria.\" In Greek literature, the Iliad of Homer mentions pieces of meat cooked on spits called obelos (ὀβελός).Homer. Iliad, 1.465. Obelos is also mentioned in the works of Aristophanes,Aristophanes. Acharnians 1007, Clouds 178, Wasps 354, Birds 388, 672. Xenophon,Xenophon. Hellenica, HG3.3.7. Aristotle,Aristotle. Politics, 1324b19. and others.Homer. Iliad, 1.465.. In Classical Greece, a small spit or skewer was called an obeliskos ().: ὀβελίσκος, diminutive of ὀβελός (obelos). Aristophanes mentions such small skewers being used to cook birds.Aristophanes. Acharnians, 1007. In the Byzantine Empire, the Greek author of the Prodromic Poems (4.231) mentions \"the hot meat shops\" of Constantinople giving customers slices of meat cooked on spits like souvlaki called .. In modern times, the French traveler Gustave Flaubert saw Greeks \"grilling pieces of meat on a bamboo stick\" when he visited the Greek countryside of Boeotia in 1850.. But modern souvlaki was not widespread in Greece until after World War II. Souvlaki skewers served as fast food began to be sold widely in the 1960s after their introduction by sellers from Boeotia. The word souvlaki in the English language was first used in 1942. ==Gallery== Image:Souvlaki Platter.jpg|Souvlaki take-out platters. File:Chicken souvlaki pita with french fries.jpg|Chicken souvlaki pita served with French fries in a restaurant in the United States. ==Related pages== *Doner kebab *Satay *Shish kebab ==References== ===Citations=== ===Sources=== * * * * * * * * ==Other websites== * Category:Greek food Category:Meat dishes",
 "title": "Souvlaki"
}