{
 "id": "1039745",
 "text": "Arndale Centres were the first \"American style\" malls to be built in the United Kingdom. In total, 23 Arndales have been built in the United Kingdom, and three in Australia. The first opened in Jarrow, County Durham, in 1961, as a pedestrianised shopping area. Many had high rise tower blocks built on top of the mall. The Arndale Property Trust was started in 1950 and closed in 2012. ==List of Arndale Centres== ===United Kingdom=== *Aberdeen – now known as Mastrick Shopping Centre *Accrington, Arndale House – built in 1961 on Broadway; Arndale Centre opened October 1987 *Blackburn Arndale House – demolished in 2008 for the extension of The Mall Blackburn *Bolton – now known as Crompton Place Shopping Centre *Bradford – now known as Kirkgate Shopping Centre *Dartford – now known as Priory Shopping Centre *Doncaster – now known as Frenchgate Shopping Centre *Eastbourne – now known as The Beacon *Jarrow – now known as the Viking Centre *Keighley – now known as the Airedale Centre *Lancaster – demolished to make way for a market building, later replaced by a Primark store *Leeds, Armley – shopping precinct no longer carries a name; shop addresses usually referred to as Town Street *Leeds, Cross Gates – now known as Crossgates Shopping Centre *Leeds, Headingley – now known as Headingley Central *Liverpool – Arndale House on Pembroke Road *Longbenton – on West Farm Avenue, Newcastle upon Tyne. Built in 1962 and demolished in 2004 *Luton – purchased in 2006 by The Mall Company, and now known as The Mall Luton *Manchester – the largest of the Arndale Centres *Middleton – now known as Middleton Shopping Centre *Morecambe – on Market Street *Nelson – now known as the Pendle Rise Shopping Centre, previously Admiral Shopping Centre *Nottingham – known as the Broadmarsh Centre, now demolished *Poole – now known as the Dolphin Shopping Centre *Shipley – on Market Street *Sunderland – on High Street West *Stretford – now known as Stretford Mall *Wandsworth – now known as Southside *Wellingborough – now known as Swansgate Shopping Centre ===Australia=== *Armada Arndale, Adelaide *Westfield Marion – previously known as Marion Arndale, now Westfield Marion *Frenchs Forest – now known as Forestway Shopping Centre *Springwood, Queensland – on Cinderella Driveurl=www.arndale.com.au ==References== Category:Malls",
 "title": "Arndale Centre"
}