{
 "id": "1039184",
 "text": "Labyrinth is a 1986 musical fantasy movie directed by Jim Henson with George Lucas as executive producer. The movie was written by Terry Jones. Labyrinth is well-known because many of its characters are strange monsters portrayed by puppets. == Plot == A 16-year old girl named Sarah must babysit her infant half-brother. She doesn't enjoy babysitting him and wishes that he disappeared. Then, the Goblin King arrives and takes the baby away. He says that Sarah will get her brother back if she manages to navigate through his labyrinth and make it to his castle before her brother is turned into a goblin, While in the labyrinth, Sarah encounters many creatures and monsters that she becomes friends with, including Hoggle (a dwarf), Ludo (a large beast), Sir Didymus (a anthropomorphic fox). During the movie, it is revealed that Hoggle is working for the Goblin King and has been tasked with leading Sarah back to the beginning of the labyrinth. Hoggle eventually turns good and helps Sarah and the others on their journey. When they finally arrive at the castle. Sarah confronts the Goblin King and manages to defeat him at the last second. Her baby brother is returned and she is transported back home. == Cast == * Jennifer Connelly as Sarah, a 16-year old girl who searches through the labyrinth to find her baby brother * David Bowie as Jareth, the king of the goblins and ruler of the labyrinth * Christopher Malcolm as Sarah's father * Shelley Thompson as Sarah's mother === Creatures === Character Role Puppeteer Voice Hoggle A dwarf who Sarah meets in the Labyrinth Shari Weiser Brian Henson Ludo A large beast who becomes Sarah's friend Rob Mills Ron Mueck Sir Didymus An anthropomorphic fox Dave Goelz David Shaughnessy The Worm A talking worm Karen Prell Timothy Bateson The Wiseman Creature in the Labyrinth Frank Oz Michael Hordern The Hat A talking bird David Goelz David Shaughnessy The Junk Lady A villain who tries to stop Sarah Karen Prell Denise Bryer Category:1986 musical movies Category:1986 fantasy movies Category:British musical movies Category:British fantasy movies Category:American musical fantasy movies Category:Movies directed by Jim Henson",
 "title": "Labyrinth (1986 movie)"
}