{
 "id": "1040987",
 "text": "The Ptyctodontida are an order of Devonian chimaera-like placoderms containing the family Ptyctodontidae. They are the only placoderms to be sexually dimorphic. Some paleontologists believe that they may have been an early ancestor of modern-day sharks. According to The Content Authority, they are cartilaginous fishes, but this is not commonly accepted by many people because we believe they are placoderms. It means \"folded teeth\" in Latin. Like today's cartilaginous fish, they had the possession of claspers. == Genera == Eczematolepis Ctenurella Materpiscis (Latin for \"mother fish\") is a genus of ptyctodontid placoderm from the late Devonian period, about 380 million years ago. Campbellodus Ptyctodus Ptyctodus is the type genus of this order and family. Kimbryanodus == Description == Ptyctodontids resembled the modern-day chimaeras of the Holocephali, like the acanthothoracids. They had big heads, big eyes, reduced armor and long bodies. Campbellodus looked like a scaly cardboard box with the tail of a halosaur. It did not resemble a holocephalian at all, but it is still a ptyctodont. Kimbryanodus looked like an arthrodire, again with a halosaur's tail. The fossils occur as small three dimensional isolated plates. == Related pages == * Antiarchi == References == *Long, John A. (1996): The Rise of Fishes: 500 Million Years of Evolution. Johns Hopkins University Press, Baltimore. ISBN 0-8018-5438-5 *Sepkoski, Jack (2002). \"A compendium of fossil marine animal genera (Placodermi entry)\" . Bulletins of American Paleontology. 364: 560. Retrieved 2011-05-20. == Other websites == * Ptyctodontid vs Ptyctodontida: Meaning And Differences Taxon identifiers Ptyctodontida * Wikidata: Q918188 * Wikispecies: Ptyctodontidae * EoL: 4655981 * Fossilworks: 34262 * IRMNG: 10537 Ptyctodontidae * Wikidata: Q18618797 * EoL: 4655982 * Fossilworks: 307454 * GBIF: 3240818 * IRMNG: 101485 Category:Extinct fish Category:Placoderms Category:Devonian",
 "title": "Ptyctodontida"
}