{
 "id": "1040969",
 "text": "The 21 grams experiment was a scientific study. It was published in 1907. The author was Duncan MacDougall. He was a physician from Haverhill, Massachusetts. MacDougall thought that souls have physical weight. He tried to measure the mass lost by a human when the soul left the body. MacDougall tried to measure the mass change of six patients at the moment of death. One of the six subjects lost three-quarters of an ounce (21.3 grams). MacDougall said his experiment would have to be repeated many times before any conclusion could be obtained. The experiment is not considered good science. This is because of the small sample size, the methods used, and the fact only one of the six subjects met the hypothesis. The case has been used as an example of selective reporting. Despite its rejection by scientists, MacDougall’s experiment made people think that the soul has weight. Specifically, that it weighs 21 grams. == Experiment == In 1901, Duncan MacDougall wanted to find out if a soul had weight. He found six patients in nursing homes who were going to die soon. Four had tuberculosis, one had diabetes, and one had other causes. MacDougall chose people who were very tired because of their illness. He needed them to be still when they died so he could measure them accurately. When the patients were close to death, their whole bed was put on a big scale. The scale was sensitive within two tenths of an ounce (5.6 grams). MacDougall thought that humans have souls but animals do not. So he later measured the weight changes of fifteen dogs after they died. MacDougall wanted to use sick or dying dogs for his experiment. But he could not find any. So it is thought that he poisoned healthy dogs. === Results === One patient lost weight. But then gained it back again. Two other patients lost weight at death. But then lost even more weight a few minutes later. One patient lost “three-fourths of an ounce” (21.3 grams) in weight at the time of death. MacDougall did not count the results of another patient because the scales were “not finely adjusted”. He also did not count the results of another patient because the patient died while the equipment was being set up. MacDougall said that none of the dogs lost any weight after death. MacDougall thought that his experiment showed that the human soul might have weight. But his report said that the experiment would have to be done many times before any conclusion could be reached. The report was not published until 1907. == Reaction == The New York Times wrote about the experiment before MacDougall could publish the results. The article was called “Soul has Weight, Physician Thinks”. MacDougall’s results were published in April of the same year. They were in the Journal of the American Society for Psychical Research, and the medical journal American Medicine. === Criticism === After the experiment was published in American Medicine, physician Augustus P. Clarke criticized it. Clarke said that at the time of death, the body temperature suddenly rises. This is because the lungs are not cooling blood anymore. This causes more sweating which could explain MacDougall’s missing 21 grams. Clarke also said that dogs do not have sweat glands. So they would not lose weight this way after death. Clarke’s criticism was published in the May issue of American Medicine. Arguments between MacDougall and Clarke argued about the experiment in the journal until at least December that year. The scientific community has rejected MacDougall’s experiment. He has been accused of using bad methods and even cheating to get his results. Karl Kruszelnicki said that this is a case of selective reporting, This is because only one of the six patients measured supported the hypothesis. MacDougall also ignored most of the results. Kruszelnicki also said that the sample size was too small. He asked how MacDougall could know the exact moment when a person died with the technology at that time. Physicist Robert L. Park said that MacDougall’s experiments are not considered good science “today”. Psychologist Bruce Hood said that the weight loss was not reliable or repeated, so MacDougall’s findings were not scientific. Professor Richard Wiseman said that scientists think the experiment is “almost certainly not true”. An article by Snopes in 2013 said that the experiment was flawed. The methods used were not good, the sample size was too small, and it was not possible to measure weight changes accurately. The article said that we should not believe that his experiments proved anything, “let alone that they measured the weight of the soul as 21 grams.” The fact that MacDougall probably poisoned and killed fifteen healthy dogs to support his research has also been criticized. === Aftermath === In 1911, The New York Times reported that MacDougall wanted to do experiments to take photos of souls. But he did not continue any more research into this area and died in 1920. His experiment has not been done again. == Similar experiments == In December 2001, physicist Lewis E. Hollander Jr. published an article. It was in Journal of Scientific Exploration. He showed the results of a similar experiment. He tested the weight of one male sheep, seven female sheep, three young sheep and one goat at the moment of death. He wanted to learn more about MacDougall’s findings. His experiment showed that seven of the adult sheep changed their weight when they died. But they did not lose weight, they gained weight. They gained between 18 and 780 grams. This weight was lost again over time until they returned to their first weight. In 2009, Masayoshi Ishida reviewed Hollander Jr.'s experiment in the same journal. Ishida said that Hollander’s statement about a temporary gain of weight was not a good way to describe the result. But he said that the cause of the force event is still not known. He also warned about possible problems with the weighing platform in two cases. Another person who was inspired by MacDougall’s research was physician Gerard Nahum. In 2005, he suggested a new experiment. It would use many electromagnetic detectors to try to find any energy that escaped at the moment of death. He offered to sell his idea to engineering, physics, and philosophy departments at Yale, Stanford, and Duke University. He also offered it to the Catholic Church. But they all said no. == In popular culture == Even though scientists do not accept it as true, MacDougall’s experiment made people think that the soul has weight. Specifically, that it weighs 21 grams. The movie 21 Grams is named after the experiment. A similar experiment appears in the narrative Dan Brown book, The Lost Symbol. The experiment is conducted by the character Katherine Solomon in her noetic sciences lab. The idea that a soul weighs 21 grams has been mentioned in many media. For example, in a 2013 issue of the manga Gantz, a 2013 podcast of Welcome to Night Vale, the 2015 movie The Empire of Corpses a 2021 episode of Ted Lasso, and a 2023 issue of the manga One Piece. There are also songs called “21 Grams” that talk about the weight of a soul. These songs were released by Looptroop Rockers (2005), Niykee Heaton (2015), Fedez (2015), August Burns Red (2015), Thundamentals (2017) and Arena (2022). Travis Scott mentioned the idea in his 2018 song “No Bystanders”. MacDougall and his experiments are talked about in the 1978 documentary movie Beyond and Back, and episode five of the season one of Dark Matters: Twisted But True. A made-up American scientist named “Mr. MacDougall” is in Gail Carriger's 2009 novel Soulless. Mr. MacDougall is an expert in measuring souls. == Related pages == * Fringe science == References == == Other websites == * Duncan MacDougall's original report Category:Experiments",
 "title": "21 grams experiment"
}