{
 "id": "104091",
 "text": ", also called the Tokugawa period (徳川時代 Tokugawa-jidai), is the time between 1600 and 1868 in the history of Japan. During this long time Japanese society was ruled by the Tokugawa shogunate and the country's 300 regional feudal lords. These years come after the Azuchi-Momoyama period, and before the Meiji Restoration and the development of modern Japan.Library of Congress Country Studies, Japan (LOC), \"Tokugawa Period\". Retrieved 2012-5-1. The Tokugawa shogunate was established at Edo in 1603 by the shogun Tokugawa Ieyasu.Hall, John Whitney. (1991). Japan: From Prehistory to Modern Times, pp. 160-164. The period was marked by the influence of neo-Confucianism and Shinto.Hall, pp. 181-185. The 15th and last shogun was Tokugawa Yoshinobu.Hall, pp. 262-264. The period ended with the Meiji Restoration, which was the restoration of imperial rule. The Edo period is also known as the beginning of the early modern period of Japan.Hall, pp. 265-272. ==Timeline== In 1600, the Battle of Sekigahara establishes a context for the next two centuries. Tokugawa Ieyasu defeats a coalition of daimyo and establishes hegemony over most of Japan.Hall, p. 359. * 1603 ( Keichō 8): The emperor appoints Ieyasu as shogun. * 1605 ( Keichō 10): Ieyasu resigns as shogun and is succeeded by his son Tokugawa Hidetada. * 1607 ( Keichō 12): Korean Joseon Dynasty sends an embassy to Tokugawa shogunate. * 1611 ( Keichō 16): Ryūkyū Islands become a vassal state of Satsuma domain. * 1613 ( Keichō 16): to Americas and Europe. \"Japan, Spain to Seek UNESCO Heritage Ratification,\" Yomiuri Shimbun. October 18, 2011. Retrieved 2011-11-17; note that Keichō means the Japanese era name (nengō) for the years from 1596 through 1615. * 1614 ( Keichō 17): Shogunate bans Christianity from Japan. * 1615 ( Keichō 18): Battle of Osaka; Ieyasu destroys Osaka Castle and the Toyotomi clan. * June 1, 1616 (Genna 2, 17th day of the 4th month): Ieyasu died at Suruga Castle.Titsingh, p. 410. * 1623 (Genna 9): Tokugawa Iemitsu becomes the third shogun. * 1633 (Kan'ei 12) Shogunate forbids travelling abroad and reading foreign books. * 1635 (Kan'ei 12): Shogunate formalizes the system of mandatory alternate residence (sankin kotai) in Edo. * 1637 (Kan'ei 14): Shimabara Rebellion (1637-38) mounted by overtaxed peasants. * 1638 (Kan'ei 15): Shogunate forbids ship building. * 1639 (Kan'ei 16): Edicts establish a policy of National Seclusion (Sakoku). * 1641 (Kan'ei 18): Shogunate bans all foreigners, except Chinese and Dutch, who may only live in Nagasaki. * 1650 (Kei'an 3): With peace, there evolved a new kind of noble, literate warrior according to bushido (\"way of the warrior\"). * 1657 (Meireki 3): T The Great Fire of Meireki destroys most of the city of Edo. * 1700 (Genroku 13): Kabuki and ukiyo-e become popular. * December 16, 1707 (Hōei 4, 23nd day of the 11th month): Eruption of Mt. Fuji, * 1774 (An'ei 3): Kaitai shinsho, the first complete Japanese translation of a Western medical work, is published by Sugita Gempaku and Maeno Ryotaku. * 1787 (Tenmei 7): Matsudaira Sadanobu becomes the shogunate's senior official (rōjū). * 1792 (Kansei 4): Russian envoy Adam Laxman arrives at Nemuro in eastern Ezo (now Hokkaidō). * 1804 (Kyōwa 4): Russian envoy Nikolai Rezanov reaches Nagasaki and unsuccessfully seeks the establishment of trade relations with Japan. * 1837 (Tenpō 8): Ōshio Heihachirō and Ikuta Yorozu lead uprising was known as Tempo Jiken * 1841 (Tenpō 12): Tempo Reforms * 1854 (Kaei 7): Commodore Perry forces the Japanese agreement to the Treaty of Kanagawa. The chief Japanese negotiator was Hayashi Akira.Sewall, John. (1905). The Logbook of the Captain's Clerk: Adventures in the China Seas, p. lxiv; Cullen, Louis M. (2003). A History of Japan, 1582-1941: Internal and External Worlds, p. 178 n11. * 1855 (Ansei 2): Russia and Japan establish diplomatic relations. * September 5–6, 1864 (Genji 1, 5th-6th day of the 8th month): Bombardment of Shimonoseki by British, French, Dutch and American warships In 1868, Tokugawa Yoshinobu resigns, the Tokugawa shogunate ends. This marks the end of the Edo period. Emperor Meiji establishes his Imperial capital in Edo, which is renamed Tokyo (\"eastern capital\").Hall, p. 360. ==Picture gallery== File:Tokugawa_Ieyasu2.JPG|Tokugawa Ieyasu, first shogun of the Tokugawa shogunate File:KokyoTowerM1105.jpg |A yagura, or turret, at Edo Castle in Tokyo. File:Hasekura in Rome.JPG |Hasekura Tsunenaga, a Samurai and Japan's first official ambassador to the Americas and Europe, 1613-1620. File:MatsumotoCastle.jpg|Matsumoto Castle in Nagano Prefecture File:Nihonbashi-Fish-Market-Prosperity-Ukiyoe-Utagawa-Kuniyasu.png|Nihonbashi Fish Market Prosperity (Edo period) by Utagawa Kuniyasu File:Bungaku- Bandai_no-Takara-Terakoya-School-by-Issunshi-Hanasato.png|Terakoya, private educational school File:Le Musée Paul Dupuy - Horloge japonaise à double foliot (Wadokei) - Période Edo.jpg|Wadokei, Japanese-made clockwatch, 18th century. File:First_Japanese_treatise_on_Western_anatomy.jpg|Kaitai Shinsho, Japan's first treatise on Western anatomy, published in 1774. File:The Great Wave off Kanagawa.jpg|The Great Wave off Kanagawa by Katsushika Hokusai (1760-1849). ==Economy Trade Diplomacy== In the Edo period, Japan developed very much economically, and accumulation of the capital became the driving force of the economic development after the Meiji Restoration. Because many daimyos stayed at the inn along the highway by daimyo's alternate-year residence in Tokyo, the circulation of the economy became active. And due to the stable economy, Japanese special culture such as Nou or Kabuki or Ukiyoe had also developed very well. The Shogunate instituted a foreign policy of isolationism. Therefore trade relations carried out by the Shogunate are only in Nagasaki, and the Netherland in Dejima. == Related pages== * List of Japanese eras ==References== ==Other websites== * Metropolitan Museum of Art, Art of the Edo Period (1615–1868) * British Museum, Edo period (AD 1600-1868) * Japan-guide.com, Edo Period (1603 - 1867) Category:Periods in Japanese history Category:Samurai Category:1603 establishments Category:17th-century establishments in Japan Category:1868 disestablishments in Japan Category:1600s establishments in Asia",
 "title": "Edo period"
}