{
 "id": "1040216",
 "text": "Salma Celeste Paralluelo Ayingono (born 13 November 2003) is a Spanish footballer and former sprinter. She is known for her achievements in both track and field events and football. Paralluelo plays as a left winger for FC Barcelona in the Liga F league and represents the Spain women's national football team. == Early Life and Background == Salma Celeste Paralluelo Ayingono was born in Zaragoza, Spain. Her father is Spanish, and her mother is from Equatorial Guinea. Her mother moved to Spain to get better medical treatment for her son from a previous relationship who had a severe congenital vision deficiency. This move allowed Salma's family to receive medical support for her brother's condition. Apart from her brother, she also has two more brothers, José Jaime and Lorenzo, both of whom are footballers. == Athletic and Football Career == Paralluelo's sporting journey began in athletics. She joined the San José Athletics club in Zaragoza and later the Scorpio-71 club in Zaragoza. She quickly gained attention in the athletics world. In 2019, she won a bronze medal at the Spanish Indoor Athletics Championships in the 400-meter event, setting a Spanish national record for her age category. === Changing to Football === Paralluelo's talents extended beyond athletics. She also excelled in football. She started her football career with UD San José in Zaragoza and played for Zaragoza CFF and Villarreal in Spain. After her contract with Villarreal ended, she signed with FC Barcelona at the end of the 2021/22 season. === International Achievements === Salma Paralluelo achieved remarkable success in international competitions. She won the 2018 UEFA Women's Under-17 Championship, the 2018 FIFA U-17 Women's World Cup, and the 2022 FIFA U-20 Women's World Cup with the Spanish national teams. She made her senior debut for the Spain women's national football team on 11 November 2022, scoring a hat-trick in a friendly match against Argentina. Notably, Paralluelo was a nominee for the 2022 FIFA Puskás Award, recognizing outstanding goals in football. In the 2023 FIFA Women's World Cup, Paralluelo was a key player for the Spain women's national team. She scored crucial goals in the quarter-final and semi-final matches, helping Spain reach the World Cup final for the first time in history. On 15 August 2023, she scored a goal in Spain's 2–1 victory over Sweden, contributing to her team's journey to the World Cup final. == Career statistics == === Club === Appearances and goals by club, season and competition Club Season League National cup Other UWCL Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Villarreal 2021–22 Primera División 8 3 1 0 – – 9 3 Barcelona 2022–23 Primera División 15 10 1 2 2 1 6 1 24 14 Career total 23 13 2 2 2 1 6 1 33 17 === International === : List of international goals scored by Salma Paralluelo No. Date Venue Opponent Score Result Competition 1 11 November 2022 Estadio Municipal Álvarez Claro, Melilla, Spain 3–0 7–0 Friendly 2 4–0 3 5–0 4 6 April 2023 Estadi Municipal de Can Misses, Ibiza, Spain 3–1 4–2 Friendly 5 4–1 6 5 July 2023 Gladsaxe Stadium, Gladsaxe, Denmark 2–0 2–0 Friendly 7 11 August 2023 Wellington Regional Stadium, Wellington, New Zealand 2–1 2–1 2023 FIFA Women's World Cup 8 15 August 2023 Eden Park, Auckland, New Zealand 1–0 2–1 2023 FIFA Women's World Cup ==References== Category:2003 births Category:Living people Category:Spanish footballers Category:Spanish sprinters",
 "title": "Salma Paralluelo"
}