{
 "id": "1040675",
 "text": "Waterfox is a free and open-source browser based on Firefox. It was designed for 64-bit systems, back when Firefox was only for 32-bit. Now, the main features of Waterfox are based on speed and privacy. == Waterfox Current == Also called Waterfox G. Waterfox Current is almost the same as Firefox. They both use Gecko and SpiderMonkey to show websites. It also works with Firefox, Chrome, and Opera extensions. It turns off telemetry (data collection) and Pocket (web service). But, it collects details about the user's device to send the right updates (new changes) to the user's browser. == Waterfox Classic == Waterfox Classic is a copy of the browser that uses the older copy of Gecko that still works with XUL and XPCOM add-ons. These add-ons do not work anymore on copies after Firefox 57. The browser can also be easily seen as similar to Firefox 57, showing the default Australis theme. It is still being kept up with the security changes from Waterfox Current and Firefox ESR. But, it has some security problems that are not fixed yet. This is because some new changes would not work on it. == History == On March 27, 2011, Waterfox was first posted and distributed (given) by Alex Kontos for 64-bit Windows. The copy for Mac was posted on May 14, 2015, after version 38.0 was posted. The copy for Linux was posted on December 20, 2016, after version 50.0 was posted. From July 22, 2015, to November 12, 2015, Waterfox had its search engine called \"Storm\" based on Yahoo! Search. It was made with investor funding and it raised money for Waterfox and charity (giving money to the needy). In December 2019, System1, an advertising (paid notice) company that claims to be focused on privacy, bought Waterfox. In July 2023, Alex Kontos said that Waterfox is an independent and separate project again. == References == == Related pages == * Web browsers based on Firefox * Waterfox in English Wikipedia * Official Waterfox Website Category:Web browsers Category:Free software",
 "title": "Waterfox"
}