{
 "id": "1040664",
 "text": "María Francesca Caldentey Oliver (born 19 March 1996), often known as Mariona Caldentey or simply Mariona, is a professional football player from Spain. Her dad, Miguel Ángel Caldentey, was a coach for football, and her mum, María Oliver, works as a nurse. Mariona has an older brother in her family. == Football career == From a very young age of four, Mariona showed a keen interest in playing football. She started playing football after school. She also enjoyed a variation of football known as futsal in Manacor. In futsal, she achieved great success, winning many awards and taking part in three Spanish championships. Mariona's journey in football started with local teams like CD Felanitx and CD CIDE. At the age of 14, she got the chance to play in an all-women's team for the first time with UD Collerense. Her skills improved during her time there. In 2014, Mariona's impressive performance in the U19 European Championship caught the attention of FC Barcelona, and she joined the team on 30 July 2014. During the 2014–2015 season, she made her debut in the Copa de la Reina tournament, scoring a goal in a match against Levante. === International Youth Success === Mariona also represented Spain in youth tournaments. She played in the U17 European Championship in 2013, where Spain secured third place. She played a significant role in the U19 European Championship in 2014, where she scored a goal in the semifinals. === Senior National Team === Mariona's hard work paid off in 2017 when she received her first call-up to the senior national team of Spain. She made her debut in an Algarve Cup match against Japan. Spain went on to win the tournament, giving Mariona her first international title. Mariona continued to contribute to the Spanish national team's successes. She played in the Euro 2017 tournament and the 2019 Algarve Cup. She also participated in the 2019 World Cup, where Spain reached the Round of 16. == Notable Achievements == Mariona was part of a group of players who chose not to play for the national team temporarily in 2022 due to concerns about the coach.Jorge Vilda Recalls Players Who Resigned Back Into His Spanish World Cup Squad, Asif Burhan, Forbes, June 12, 2023Spain v Sweden: Las 15+3, An International Team In Chaos And Lonely Jorge Vilda, Simon Lillicrap, The Sportsman, 14 August 2023 However, she was later selected to play again. In the 2023 FIFA Women's World Cup final, she played a crucial role as Spain defeated England 1–0, securing their first-ever trophy. ==References== Category:Living people Category:1996 births Category:Spanish footballers",
 "title": "Mariona Caldentey"
}