{
 "id": "1040938",
 "text": "Flemish Brabant is a constituency of Belgium. ==Members== Representatives of Flemish Brabant Election Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) Rep. (Party) 2014 Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle- Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle- Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle- Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle- Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle- Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle- Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle- Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde Created from the dissolution of Brussels-Halle-Vilvoorde 2014 Sonja Becq (CD&V;) Koen Geens (CD&V;) Eric Van Rompuy (CD&V;) Anne Dedry (Groen) Inez De Coninck (N-VA) Theo Francken (N-VA) Jan Spooren (N-VA) Kristien Van Vaerenbergh (N-VA) Hendrik Vuye (N-VA) Patricia Ceysens (Open Vld) Maggie De Block (Open Vld) Luk Van Biesen (Open Vld) Tim Vandenput (Open Vld) Hans Bonte (SP.A) Karine Jiroflée (SP.A) 2019 Els Van Hoof (CD&V;) Koen Geens (CD&V;) Katleen Bury (Vlaams Belang) Jessika Soors (Groen) Darya Safai (N-VA) Theo Francken (N-VA) Jan Spooren (N-VA) Kristien Van Vaerenbergh (N-VA) Katrien Houtmeyers (N-VA) Goredele Liekens (Open Vld) Maggie De Block (Open Vld) Dries Van Langenhove (Vlaams Belang) Tim Vandenput (Open Vld) Dieter Vanbesien (Groen) Karine Jiroflée (SP.A) ==References== Category:Constituencies of the Chamber of Representatives (Belgium)",
 "title": "Flemish Brabant (Chamber of Representatives constituency)"
}