{
 "id": "1040474",
 "text": "Clare Langan (b. 1967) is an Irish artist and movie maker. She has shown her movies at many festivals and museums such as: Kino der Kunst Festival, Munich (2020); Physical Cinema Festival, Reykjavik (2019); Shaping Ireland, National Gallery of Ireland, Dublin (2019); The Best of Kino der Kunst, Dirimart, Istanbul (2018), B3 Biennial of the Moving Image, Frankfurt (2017), Lyon Biennale (2007), and Film Trilogy, MoMA, New York (2004). Her movies have won many awards, including the Prix Video Formes 2014, Clermont-Ferrand; the Principle Prize at the Oberhausen International Short Film Festival (2007) and she represented Ireland at the 25th Bienal de São Paolo (2002). In 2019, she was elected a member of Aosdána. == Life and Work == Clare Langan studied Fine Art at the National College of Art and Design, Dublin. She completed a film workshop at NYU on a Fulbright Scholarship. In 2017 she was awarded an Honorary Doctorate in Fine Arts from The National University of Ireland. She has represented Ireland in many international Biennales. Her movies and photographs are in a number of international public and private collections including IMMA, The Arts Council of Ireland, The OPW, the Tony Podesta Private Collection, Washington, and the Hugo and Carla Brown Collection, UK. For the last 20 years, Langan's movies deal with existential issues, where humanity and our relationship to the planet and climate have always been at the fore. Her first trilogy – Forty Below (1999), Too Dark for Night (2001), and Glass Hour (2002) – were shot in a drowned world; in the town being consumed by the desert, and across a molten volcanic landscape. With Langan's 2015 movie Flight from the City made for the late Icelandic composer Johann Johannsson, the camera was turned from focus on the landscape, to focus on humanity itself. Since then the work has combined elements of choreography, landscape, performance with music being a crucial element of the works. Flight from the City premiered at the B3 Biennale of the Moving Image 2015 in Frankfurt, before touring to Beijing and Shanghai. Jóhann Jóhannsson went on to use Flight from the City to launch his 2016 album Orphee. Langan has made movies in Namibia, Iceland, at Skellig Michael, in the sky above the city of Dubai, and on the largely abandoned island of Montserrat. Langan started making movies in the late 1990s on 16mm film. She use hand-painted glass filters that workedlike eyelids. Later, she started using unusual film stock, including black and white infra-red. == Exhibitions == Her movie Metamorphosis (2007) won the Principal Prize at the Oberhausen International Short Film Festival, Germany. In 2007 it was exhibited at the Lyon Biennale; Houldsworth Gallery, London; Loop, Barcelona; NCA Gallery, Tokyo; Pratt Art Gallery New York and the Miguel Marcos Gallery, Barcelona. Langan's State of Suspension (2012) was shown in Galerie Anita Beckers, Frankfurt, and The Rubicon Gallery, Dublin. She participated in the Glen Dimplex Artists’ Award 2000 at The Irish Museum of Modern Art. The Floating World premiered at Kino der Kunst in 2013, where it was really well received by the jury and the audience. The film went on to win the Prix Videoformes 2014 | Conseil Général du Puy de Dôme at VIDEOFORMES 2014, Clermont-Ferrand, France. It was exhibited as a 3-screen installation in VISUAL Center of Contemporary Art in 2015, and has since been exhibited in Städtische Galerie, Delmenhorst, Germany and The Tom Tomson Art Gallery, Canada, where she also exhibited The Winter of 13 Storms, (2016/17). This movie was also exhibited at the B3 Biennal of the Moving Image Frankfurt 2017 curated by Kelly Gordon. In 2017, she exhibited her movie The Human Flock at Lismore Castle Arts, Waterford. The movie travelled to Dirimart, Istanbul in July 2018, as part of The Best of Kino der Kunst curated by Heinz Peter Schwerfel. In 2019, she had retrospective show at The Dock, Carrig on Shannon featuring a number of recent and older works, including The Winter of 13 Storms, 2017 and A Film Trilogy 1999-2002 from the IMMA Collection. It also included the 3-screen movie installation River (2015), with a selection of music curated by Gary Sheehan, director of The National Concert Hall. In 2019, her work was also included in, Of Music and Making, Solstice, Navan; Moving Women, Magda Danysz Gallery, Paris, Shaping Ireland, The National Gallery of Ireland, The Gifts of Tony Podesta, American University Museum, Katzen Arts Center, Washington. Recent festivals include Ritratti Di Poesia, Poetry Festival, Rome alongside the poets Kate Tempest and Ingrid de Kok, and Physical Cinema Festival, in Reykjavk. In 2020, her movie The Heart of a Tree premiered at Kino Der Kunst, Munich. The Heart of a Tree was then part of Lightmoves Film Festival, Limerick in 2021 before being part of Fondazione In Between Art Film in 2022. In 2021, her movieFlight from the City (2015) was screened as part of Artist Film International (AFI). In 2022, Langan's movie River (2015) was part of Living Canvas, Dublin City's new cultural program by IPUT. Recently, a photograph captured from her movie The Heart of A Tree won The Progressive Vision Curtin O' Donoghue Photography Prize as selected by The RHA Annual Exhibition 2022. She was also interviewed by John Kelly in The Works Presents on RTÉ. Most recent exhibitions include At The Gates of Silent Memory, Luan Gallery, The New Dawn Fades, Golden Thread Gallery, and Elizium at Sarah Walker Gallery. == Publications == Photography books by the artist * 2023, At The Gates of Silent Memory, Luan Gallery * 2013-15, The Floating World, Carlow: VISUAL Centre for Contemporary Art, 978-1-907537-12-7 * 2004, Essays by Patrick T. Murphy and Aidan Dunne, A Film Trilogy, Dublin: The Royal Academy * 2002, Too dark for night: Representing Ireland at the 25th Bienal de Sao Paulo Brazil, Dublin: Arts Council of Ireland * Forty Below, Dublin: The Green On Red Gallery, 0-9524564-8-6 Photography books with contribution by the artist * 2021, In Conversation with Cristin Leach, Kevin Barry and Olivia Smith (ed.), And Now With Feeling, Winter Papers, Vol.7, Dublin: Arts Council of Ireland, Curlew Editions, 978-0-9933029-6-1 * 2018, Texts by Jack Rasmussen, Klaus Ottmann, Susan Fisher Sterling, Kathryn Wat, The Gifts of Tony Podesta, American University Museum, 978-1-7321553-2-9 * 2011, Noel Kelly and Sean Kissane, Creative Ireland: The Visual Arts, Arts Council of Ireland, 978-1-907683-11-4 * 2010, Busan Biennale, Busan Museum of Art, Gwangalli Beach, 2010 * 2009, Sounds & Visions: Artists’ Films and Videos from Europe, The Last Decade, Milano, Silvana Editoriale * 2008, Representing Art in Ireland, Cork, The Fenton Gallery, 978-0-9544843-8-5 * 2008, Singapore Biennale, Singapore, National Arts Council Singapore, 978-981-08-1684-1 * 2009, Paysage – Video: Dialogue avec les collections #2, 978-2-905985-69-9 * 2005, World Without End, Australian Centre for Moving Image, Australia, 1-920805-11-7 * 2005, Irish Museum of Modern Art: The Collection, 1-903811-48-1 * 2002, Catalogue, Shimmering Substance, Bristol, Arnolfini, 0-907738-71-0 * 2022, Liverpool Biennial, Liverpool Biennial of Contemporary Art Ltd, 0-953671-4-5 == Awards == * 2022, Winner of The Progressive Vision Curtin O’ Donoghue Photography Prize, RHA Dublin * 2019, Elected as a member of Aosdana, The Arts Council Ireland * 2017, Awarded an Honorary Doctorate in Fine Art from The National University of Ireland * 2014, Prix Videoformes, Conseil Général du Puy de Dôme at VIDEOFORMES, Clermont-Ferrand * 2007, Premier Prize, Oberhausen International Film Festival, Germany * 1992, Fulbright Scholarship to attend NYU Film New York * 1994 - Present, Numerous Film Project Funding, Visual Arts Bursaries from The Arts Council of Ireland & The Irish Film Board, Ireland == References == Category:1967 births Category:Living people Category:Irish movie directors",
 "title": "Clare Langan"
}