{
 "id": "104000",
 "text": "Arran or the Isle of Arran Scots Gaelic: Eilean Arainn is the largest island in the Firth of Clyde, Scotland. With an area of it is the seventh largest Scottish island. Just over 5,000 people live there. Arran shares with the Hebrides cultural and physical similarities. Arran is mountainous and has been described as a \"geologist's paradise\".p11/17 People have lived there since the early Neolithic period, from which time on there are numerous prehistoric remains. From the 6th century on peoples from Ireland colonised the island and it became a centre of religious activity. During the troubled Viking Age, Arran became the property of the Norwegian crown before becoming formally absorbed by the Kingdom of Scotland in the thirteenth century. The 19th century \"clearances\" led to significant reductions in population and the end of the Gaelic language and way of life. The economy and population have recovered in recent years, the main industry being tourism. There is diversity of wildlife, including three species of tree endemic to the area. There are regular field trips in the summer by geology and biology students. == Geology == The island is sometimes referred to as \"Scotland in miniature\", as it is divided into \"Highland\" and \"Lowland\" areas by the Highland Boundary Fault which runs northeast to southwest across Scotland.McKirdy, Alan Gordon, John & Crofts, Roger 2007. Land of mountain and flood: the geology and landforms of Scotland. Edinburgh. Birlinn. p297/301 The island is a popular destination for geologists, who come to see intrusive igneous landforms such as sills and dykes as well as sedimentary and metasedimentary rocks ranging in age from Precambrian to Mesozoic. Most of the interior of the northern half of the island is taken up by a large granite batholith that was created by substantial volcanic activity around 60 million years ago in the Tertiary period. There is an older outer ring of coarse granites and an inner core of finer grained material. Sedimentary rocks dominate the southern half of the island, especially Old and New Red Sandstone. Sand dunes are preserved in Permian sandstones near Brodick, there are localised outcrops of Triassic rocks,p143/4/9 and even some Cretaceous chalk.The implications of this small chalk outcrop are considerable. It suggests that like much of southern England, Scotland once had considerable deposits of this material that have been subsequently eroded away. See McKirdy et al. 2007 p298 Visiting in 1787, the geologist James Hutton found his first example of an unconformity to the north of Newton Point near Lochranza. It showed evidence for his Plutonist theories of uniformitarianism, and about the age of the Earth. This spot is one of the most famous places in the study of geology.Montgomery, Keith 2008. Siccar Point and teaching the history of geology. The site was not sufficiently convincing for him to publish his find until the discovery of a second site near Jedburgh. The Pleistocene glaciations almost entirely covered Scotland in ice. After the last retreat of the ice at the close of the Pleistocene epoch sea levels were up to lower than at present and it is likely that circa 14,000 years ago the island was connected to mainland Scotland.Murray W.H. 1973. The islands of western Scotland. London. Eyre Methuen. SBN 413303802p68/69 Sea level changes and the isostatic rise of land makes charting coastlines a complex task, but the island is clearly ringed by post glacial raised beaches.p28 What this means is that the huge weight of ice pressed down the Earth's crust here, and so the beaches were much higher up than now. Gradually, long after the ice melted, the island came back up. King's Cave on the south west coast is an example of such a raised beach. This cave, which is over long and up to high, lies well above the present day sea level.Downie (1933) pp. 70-71.This cave is one of several associated with the legend of Robert the Bruce and the spider. See McKirdy et al. (2007) p301 There are tall sea cliffs to the north east including large rock slides under the heights of Torr Reamhar and at Scriden (An Scriodan) at the far north end of the island. The Scriden rocks fell \"some two hundred years ago, with a concussion that shook the earth and was heard in Bute and Argyllshire\".p19 == References == Category:Islands of Scotland",
 "title": "Isle of Arran"
}