{
 "id": "1040050",
 "text": "This is a list of soccer stadiums in Australia. ==Existing stadiums== Stadium Image City Capacity Team(s) Notes Melbourne Cricket Ground Melbourne Australia men's national soccer team Australia women's national soccer team Stadium Australia Sydney Australia men's national soccer team Australia women's national soccer team Commercially known as Accor Stadium. Docklands Stadium Melbourne Australia men's national soccer team Australia women's national soccer team Commercially known as Marvel Stadium. Adelaide Oval Adelaide Australia men's national soccer team Lang Park Brisbane Australia men's national soccer team Australia women's national soccer team Brisbane Roar Commercially known as Suncorp Stadium. Queensland Sport and Athletics Centre Brisbane Australia women's national soccer team Sydney Cricket Ground Sydney Australia men's national soccer team Sydney Football Stadium Sydney Australia women's national soccer team Sydney FC Commercially known as Allianz Stadium. The Gabba Brisbane Australia men's national soccer team Kardinia Park Geelong Australia women's national soccer team Commercially known as GMHBA Stadium. Melbourne Rectangular Stadium Melbourne Australia men's national soccer team Australia women's national soccer team Melbourne City Melbourne Victory Commercially known as AAMI Park. Newcastle International Sports Centre Newcastle Australia men's national soccer team Australia women's national soccer team Newcastle Jets Commercially known as McDonald Jones Stadium. Western Sydney Stadium Sydney Australia men's national soccer team Australia women's national soccer team Western Sydney Wanderers Commercially known as CommBank Stadium. Canberra Stadium Canberra Australia men's national soccer team Australia women's national soccer team Commercially known as GIO Stadium. Penrith Stadium Penrith Australia women's national soccer team Commercially known as BlueBet Stadium. Wollongong Showground Wollongong Australia women's national soccer team Wollongong Wolves Commercially known as WIN Stadium. Perth Rectangular Stadium Perth Australia men's national soccer team Australia women's national soccer team Perth Glory Commercially known as HBF Park. Central Coast Stadium Gosford Australia men's national soccer team Australia women's national soccer team Central Coast Mariners Commercially known as Industree Group Stadium. Jubilee Oval Sydney Australia women's national soccer team Sydney FC ALW Commercially known as Netstrata Jubilee Stadium. Leichhardt Oval Sydney Australia men's national soccer team Australia women's national soccer team WACA Ground Perth Australia men's national soccer team Campbelltown Stadium Sydney Australia women's national soccer team Macarthur FC Belmore Sports Ground Sydney Sydney Olympic Hindmarsh Stadium Adelaide Australia men's national soccer team Australia women's national soccer team Adelaide United Commercially known as Coopers Stadium. Manuka Oval Canberra Australia men's national soccer team Australia women's national soccer team Knights Stadium Melbourne Melbourne Knights Norwood Oval Adelaide Australia men's national soccer team Commercially known as Coopers Stadium. Seiffert Oval Queanbeyan Canberra United Carrington Park Bathurst Australia women's national soccer team Lakeside Stadium Melbourne Australia men's national soccer team Australia women's national soccer team South Melbourne Latrobe City Stadium Morwell Falcons 2000 Lavington Sports Ground Albury Australia women's national soccer team Olympic Village Melbourne Heidelberg United St George Stadium Sydney Australia men's national soccer team St George Coffs Harbour International Stadium Coffs Harbour Australia men's national soccer team Australia women's national soccer team Epping Stadium Melbourne Brunswick Juventus Melbourne Victory ALW Green Gully Reserve Melbourne Bentleigh Greens Melita Stadium Sydney Parramatta Newcastle Number 1 Sports Ground Newcastle Australia men's national soccer team North Sydney Oval Sydney Australia women's national soccer team Queen Elizabeth Oval Bendigo Australia men's national soccer team Sunshine Coast Stadium Brisbane Australia women's national soccer team Sydney United Sports Centre Sydney Sydney United 58 Casey Fields Melbourne Melbourne City ALW Clive Berghofer Stadium Toowomba Toowoomba Raiders Marconi Stadium Sydney Australia women's national soccer team Marconi Stallions Western Sydney Wanderers ALW Robertson Oval Wagga Wagga Australia women's national soccer team Morshead Park Ballarat Australia women's national soccer team Ballarat City Western United ALW Oakes Oval Lismore Australia women's national soccer team Ballymore Stadium Brisbane Australia women's national soccer team Brisbane Roar ALW Kensington Oval Adelaide Australia men's national soccer team Lambert Park Sydney APIA Leichhardt State Centre for Football Adelaide Adelaide Comets Adelaide United ALW Commercially known as ServiceFM Stadium. Ilinden Sports Centre Sydney Rockdale Ilinden Darwin Football Stadium Darwin Darwin Olympic Marden Sports Complex Adelaide Australia men's national soccer team Australia women's national soccer team Adelaide Blue Eagles Inglewood Stadium Perth Inglewood United Bonnyrigg Sports Club Sydney Bonnyrigg White Eagles B.T. Connor Reserve Melbourne Preston Lions Cromer Park Sydney Manly United Sydney FC ALW Gabbie Stadium Sydney Blacktown City Hills United Gungahlin Enclosed Oval Gungahlin Gungahlin United Jack McLaughlin Oval Newcastle Edgeworth Lions Stadium Brisbane Lions FC Litis Stadium Perth Floreat Athena Newcastle Number 2 Sports Ground Newcastle Newcastle Jets ALW Percy Doyle Reserve Perth Sorrento FC Joondalup United Perry Park Brisbane Australia women's national soccer team Brisbane Strikers Seymour Shaw Park Sydney Australia women's national soccer team Sutherland Sharks Spencer Park Brisbane Australia women's national soccer team Brisbane City Summit Sports Park Mount Barker Mount Barker United Other Listed Stadiums Wellington Regional Stadium Wellington Wellington Phoenix Wellington Phoenix ALW In New Zealand, but used by Wellington Phoenix in the A-League Men and A-League Women. Commercially known as Sky Stadium. Macedonia Park Perth Stirling Macedonia Perth Glory ALW Under 5,000, used by Perth Glory in the A-League Women Valentine Sports Park Sydney Australia women's national soccer team Under 5,000, used by the Australia women's national soccer team. McKellar Park Canberra Australia women's national soccer team Belconnen United Canberra United Under 5,000, used by the Australia women's national soccer team and Canberra United. A.J. Kelly Park Brisbane Peninsula Power Brisbane Roar ALW Under 5,000, used by Brisbane Roar in the A-League Women. City Vista Recreation Reserve Melbourne Caroline Springs George Cross Western United ALW Under 5,000, used by Western United in the A-League Women. The Gardens Greyhound and Sporting Complex Newcastle Australia men's national soccer team Australia women's national soccer team Under 5,000, used by the Australia men's national soccer team and Australia women's national soccer team. SS Anderson Reserve Melbourne Australia women's national soccer team Port Melbourne Under 5,000, used by the Australia women's national soccer team. Wanderers Football Park Sydney Blacktown Spartans Western Sydney Wanderers ALW Under 5,000, used by Western Sydney Wanderers in the A-League Women. ==Future stadiums== Stadiums that are still being built include: Stadium Capacity City Club Notes Wyndham City Stadium c. 15,000 Melbourne Western United In March 2022, construction of the first two phases of stadium expansion began starting with a 5,000 capacity training facility to be built, before completing the full capacity venue. ==References== Category:Sports lists",
 "title": "List of soccer stadiums in Australia"
}