{
 "id": "1040473",
 "text": "Dancing on Ice is a British television series currently presented by Stephen Mulhern and Holly Willoughby. Former hosts include Phillip Schofield, who hosted from 2006 to 2023, and Christine Lampard, who hosted in Willoughby's absence from 2012 to 2014. The series features celebrities and their professional partners figure skating in front of a panel of judges. The series, broadcast on ITV, started on 14 January 2006 and initially ended on 9 March 2014. On 4 September 2017, it was announced that a revived series would air on ITV from 7 January 2018 with Schofield and Willoughby returning as hosts. Jayne Torvill and Christopher Dean assumed new roles as head judges, alongside original judge Jason Gardiner and new judge Ashley Banjo. In 2020, John Barrowman replaced Gardiner as a judge, however on 3 October 2021, it was announced that Barrowman would not be returning to the judging panel. His replacement was later announced as Strictly Come Dancing professional Oti Mabuse. During the finale of the fifteenth series, it was confirmed that the show would return in 2024 for its sixteenth series. In 2023, It was announced that Schofield would not be returning to the show. His replacement was later announced as Catchphrasepresenter Stephen Mulhern. == Cast == === Presenters === In 2004, Holly Willoughby and Phillip Schofield announced they are presenting the show together. In 2012, Christine Lampard was announced as the new co-presenter of the show replacing Holly Willoughby. In 2023, Schofield resigned from ITV after admitting to having had a relationship with a young male ITV employee, ultimately confirming his departure from both This Morning and Dancing on Ice. Stephen Mulhern, who previously stood in for Schofield as presenter during the fourteenth series, was announced as his replacement and will co-host alongside Willoughby Series Presenters Guest 1 2 1 1 Holly Willoughby Phillip Schofield rowspan=\"13\" 2 3 4 5 6 7 Christine Lampard 8 9 10 Holly Willoughby 11 12 13 14 Stephen Mulhern 15 rowspan=\"2\" 16 Stephen Mulhern === Judge === In 2004, Robin Cousin, Karen Barber, Nicky Slater and Jason Gardiner, Karen Kresge joined the show as the judges. In 2007, Natalia Bestemianova joining the ice panel as a replacement for Karen Kresge In 2008, Ruthie Henshall joined the panel as a replacement for Natalia Bestemianova. In 2010, Emma Bunton joined the panel as a replacement for Ruthie Henshall and will be joining alongside Barber, Cousins, Gardiner and Slater In 2011, Nicky Slater did not return as a judge and was not replaced In 2012, Louie Spence, and Katarina Witt joined the Ice Panel In 2013, Ashley Roberts joined the Ice Panel as Katarina Witt's replacement In 2018, Creative directors and mentors Christopher Dean and Jayne Torvill became head judges and alternated the role on a weekly basis, joined on the panel by newcomer Ashley Banjo and Jason Gardiner, who returned for his ninth series as judge In 2020, John Barrowman joined the Ice Panel as Jason Gardiner's replacement In 2022, Strictly Come Dancing professional Oti Mabuse was confirmed as Barrowman's replacement. Arlene Phillips also joined the panel on 20 February as a guest judge. In 2024, Christopher Dean and Jayne Torvill have announced they will be retiring together in 2025. Series Judges 1 2 3 4 5 1 Robin Cousins Karen Barber Nicky Slater Jason Gardiner Karen Kresge 2 Natalie Bestemianova 3 Ruthie Henshall 4 5 Emma Bunton 6 rowspan=\"4\" 7 Louie Spence Katerina Witt 8 Jason Gardiner Ashley Roberts 9 10 Christopher Dean Jayne Torvill Jason Gardiner Ashley Banjo rowspan=\"7\" 11 12 John Barrowman 13 14 Oti Mabuse 15 16 Category:BBC Television programmes",
 "title": "Dancing on Ice"
}