{
 "id": "1040956",
 "text": "Thomas Janeschitz (born 22 June 1966) is an Austrian professional football manager and former player. He is head coach of 2. Liga club FC Dornbirn. ==Career== Thomas Janeschitz made his debut for the Wiener Sport-Club in the 1st division in 1985. He had only made a few appearances.Then he moved to Kremser SC in the 2nd division. The club was promoted in 1989 . 1988 they won the cup as a second division team in 1988. Thomas Janeschitz scored the second goal in the first leg win. Then he went back to Wiener Sport-Club. 1992 the club was promoted to the firdt league. After scoring 16 goals in 1992/93 the newly founded FC Tirol signed the striker, and Thomas Janeschitz played in Innsbruck for a total of four seasons. In his last active season, 1997/98, he played for Wiener Austria, where he started his career in the youth team. On 9 May 1993 he played one match for the Austrian national football team versus Sweden.ÖFB Player profile After the end of his playing career he began working as a youth coach at Rapid (1999-2001), Admira (2001-2002) and Austria (2002-2005). After a period as assistant coach of Austria Wien, he took over as head coach of the amateur team in June 2006 in the second-class first division. At that time he was also the mentor of David Alaba. He let him play on 18 April 2008 when Alaba was just 15 years old.transfermarkt. de From 2009 to 2011 he was head coach of the Austrian U16, U17 and U18 national football team. Then he was assistance coach to Marcel Koller in the Austrian national football team. In addition, Janeschitz worked in the ÖFB between 2009 and 2016 as head of trainer training and further education. After Koller left the ÖFB Janeschitz made also this step. He then followed Koller as assistant coach to FC Basel in Switzerland in August 2018. In August 2020 he left FC basel. For the 2022/23 season he took over the second division club FC Dornbirn 1913 as head coach. ==Private life== Thomas Janeschitz studied physical education and mathematics at the University of Vienna and is learned teacher. ==References== Category:1966 births Category:Living people Category:Players of the Austrian national football team Category:Austrian football managers Category:FK Austria Wien players Category:Association football forwards",
 "title": "Thomas Janeschitz"
}