{
 "id": "1040222",
 "text": "Thomas Ricca (born June 7, 1968) is an American professional wrestler, better known by the ring names Tony Ricca and The Pharaoh. He is also the promoter of the New Jersey-based promotion Arena Kaged Wrestling (AKW). Tony Ricca is a founder of Cannoli World. He is in the top 10 list of WWE superstars on Cameo. ==Early life & Career== Thomas Ricca was born and raised in Hammonton, New Jersey. He graduated from Hammonton High School in 1986. He trained as a professional wrestler underLarry Sharpe and debuted November 9, 1990, as one- half of the tag team \"The Hammonton Hitmen\". His debut was at a charity event that benefited the troops that were serving in the Gulf War. After his debut, Ricca was asked to work independently as \"The Hammonton Hitman\". On July 29, 1991, Ricca wrestled for WWE at a television taping for an episode of the World Wrestling Federation (WWF)s Superstars of Wrestling and wrestled Hacksaw Jim Duggan. The episode aired on August 31, 1991. In 1992, at \"The Brawl at the Hall\", Ricca debuted as The Pharaoh against Glen \"Madman\" Osbourne in the first main event. The Pharaoh pinned Osbourne after a flying back flip off the top rope. In June 1998, Ricca opened up Powerslam, a professional wrestling training center in Hammonton, New Jersey. Powerslam officially opened during the Red, White and Blueberry Festival. In 2000, Ricca unveiled his promotion, Arena Kaged Wrestling (AKW), at the same location as Powerslam. Matches aired on WMCN-TV. For a February 2002 AKW event, Ricca added headliners that included Disco Inferno, Vito LoGrasso, Daffney, Lou Albano, Dick Woehrle and Gary Wolfe. In 2015, a limited amount of Retro Action Figures of Ricca was made that brought attention to him in the media. ==Community== In 2019, Ricca brought together groups in Hammonton, New Jersey, to identify its Little Italy district that had been designated for over ten years without any identity. Hammonton is one of the towns in the United States with the highest percentage of residents who claim Italian ancestry. Ricca is working to include signs, banners, a website and an interactive map of the area. The first signage installed for Little Italy is located at one of the district's entrances near Cannoli World, a company owned by Ricca's wife. ==Personal life== In June 2014, Ricca's daughter, Gabriella Ricca, won the USAIGC/IAIGC Gymnastics International World Championships as the 12-year-old division's All-Around Champion and Bar Champion in Orlando, Florida. ==References== ==Other websites== Tony Ricca on IMDB Tony Ricca on CrunchBase Category:1968 births Category:Living people",
 "title": "Tony Ricca"
}