{
 "id": "104178",
 "text": "Dilemma Nelly single featuring Kelly Rowland from the albums Nellyville and Simply Deep Released 15 October 2002 Genre Length 4:49 Label Writer Producer Ryan Bowser Nelly singles chronology Hot in Herre (2002r.) Dilemma Air Force Ones (2002r.) Kelly Rowland singles chronology Separated (1999r.) Dilemma Stole (2002r.) Nellyville CD track listing On The Grind (9) Dilemma (10) Splurge (11) Simply Deep CD track listing Stole (1) Dilemma (2) Haven't Told You (3) \"Dilemma\" is the 2002 hit single by the rapper Nelly. The song featured Kelly Rowland from Destiny's Child. It was released from the 2002 album Nellyville. \"Dilemma\" was Kelly Rowland's first international solo song away from Destiny's Child. She had previously appeared on Avant's \"Separated\", which was released in the United States only. It was also the first single from her debut album Simply Deep. It is based melodically on and uses lyrical elements of Patti LaBelle's \"Love, Need and Want You\" from her 1983 album I'm In Love Again. LaBelle also plays a part in the music video, as Kelly Rowland's mother. Kelly Rowland's part in \"Dilemma\" was originally offered to Christina Aguilera, but Aguilera declined the offer. Two years later, Nelly approached Aguilera once again for the recording of \"Tilt Ya Head Back\", a critically-acclaimed but less successful track (in terms of the Billboard Hot 100 chart) on Nelly's later album Sweat. The song won Best Melodic Rap Performance at the 45th Annual Grammy Awards. ==Formats and tracklistings== ;International Vinyl Side A # \"Dilemma\" (radio edit) # \"Dilemma\" (UK Garage radio edit) Side B # \"Dilemma\" (Jason Nevin's club remix) ;International CD # \"Dilemma\" (radio edit) # \"Dilemma\" (Jason Nevin's remix edit) # \"King's Highway\" # \"Dilemma\" (video) ==References== ==Other websites== * Category:2002 songs Category:2000s ballads Category:Kelly Rowland songs Category:Nelly songs Category:Billboard Hot 100 number one songs Category:Grammy Award-winning songs Category:Songs about infidelity",
 "title": "Dilemma (song)"
}