{
 "id": "1041874",
 "text": "Chrysiptera hemicyanea, known commonly as the azure damselfish, azure demoiselle, half-blue demoiselle, and yellow-dipped damsel, is a species of damselfish. == Etymology == The generic name, Chrysiptera, is a compound of the Greek words chrysos, meaning \"golden\" and pteron meaning \"fin\" or \"wing\", while the specific name, hemicyanea, means \"half blue\" referring to the blue head and upper body. == Distribution == It is native to the eastern Indian Ocean and western Pacific. It has also recently been filmed in the Mediterranean Sea off Malta.Atlas of Exotic Fishes in the Mediterranean Sea (Chrysiptera hemicyanea). 2nd Edition. 2021. 366p. CIESM Publishers, Paris, Monaco.https://ciesm.org/atlas/fishes_2nd_edition/Chrysiptera_hemicyanea.pdf Being a reef species, these fish are found in greatest population in what's known as the Coral triangle, which is one of the largest concentrations of coral reefs in the world, located form the Solomon Islands to Indonesia, Bali and the Philippines. Typically found in waters 1 to 38m deep and are non migratory. ==Appearance== This tropical marine fish reaches in length. It is mostly bright blue in color, with a bright yellow bottom. Different species in this genus have varied amounts of gold coloring. == Habitat == As a tropical species, these species are found in coral reefs near the equator. They inhabit (live in) lagoons or near shore reefs and are typically found in rock structures or around branching corals like Acropora corals. This species is a reef dependent species that needs corals or other structures for protection from predators. Primary eat plankton and small invertebrates. == Reproduction == The reproduction of Chrysiptera hemicyanea is not well studied. Reproduction in the genus Chrysiptera involves mating pairs, followed by a benthic egg-laying life cycle, where eggs are stuck to a substrate and a male stays around to guard and aerate the eggs. In addition this genus has a shorter larval stage when compared to other damselfish and because of these two things have issues distributing. Population has the ability to double in 15 months. == Conservation == The primary way to protect this species is to maintain their primary living areas which is coral reefs. In current times coral reefs are beginning to disappear in most areas due to coral bleaching. Coral bleaching occurs when warmer average temperatures cause corals to begin to overheat and die, turning them white. Global warming is thought of as the primary cause reef destruction, and will only worsen in the coming decades. It is projected that by the middle of the century there will be severe damage to global coral reefs. As coral reefs die out it may become necessary to supplement structure like artificial reefs or any type of structure that fish has hide in. ==In the aquarium== This fish is a popular species in the home aquarium along with some closely related species like Chrysiptera talbotiand C. rollandi. In captivity they are quite hardy and easy to take care of. They can tolerate some minor changes in water chemistry and are recommended for beginners in the saltwater aquarium trade. This species will eat just about anything including fish flakes and frozen brine shrimp. Even though they are considered a schooling fish, they are quite aggressive and territorial. Fish that invade the area are harassed, sometimes to death. The best way to avoid this is to place fish in a large enough tank with plenty of structure like coral or live rock. Recently this species has been successfully bred in captivity to try and increase the supply to the aquarium trade and decrease the environmental impact. ==References== Category:Fish of the Pacific Ocean Category:Pomacentridae",
 "title": "Chrysiptera hemicyanea"
}