{
 "id": "1041115",
 "text": "The Kudremukh yellow bush frog (Raorchestes tuberohumerus) is a frog. It lives in southern India. Scientists have seen it in the Western Ghat mountains between 500 and 1100 meters above sea level. ==Appearance== This is a small frog. The adult male frog is about 18 mm long from nose to rear end. The skin of its back is brown with yellow spots on the tops of the legs. Some frogs have a mark like an hourglass on their backs. There are large red or yellow marks near where the back legs meet the body. This frog can change color: it is darker during the day than at night, and its marks are clearer. A part of the front leg bone sticks out. This bone is called the humerus. Scientists think this is the only frog that has a front leg bone like this. This is why they gave the frog the Latin name tuberohumerus. It means \"knobbed humerus bone.\" The scientists who wrote the first paper only found male frogs, so they do not know whether the female frogs also have these colors or spiked arm bones. Scientists think this frog looks like Raorchestes bombayensis but smaller. ==Home== People have seen this frog in evergreen forests and in places that human beings have changed. People have seen this frog in small pieces of forest and in people's gardens. People have seen this frog between 500 and 1100 meters above sea level. The female frog lays her eggs in moss in dead leaves on the ground. Scientists say this frog hatches out of its egg as a small frog and never swims as a tadpole. ==Danger== Scientists say this frog is not in danger of dying out, but it is in some danger. When human beings change the place where it lives to farms or change from a farm where the frog can live to a farm where it can't life, the frog is in danger. Scientists say climate change is also a danger for this frog. Scientists think the fungus Batrachochytrium dendrobatidis can also make this frog sick. Batrachochytrium dendrobatidis causes the fungal disease chytridiomycosis. ==References== Category:Frogs of Asia",
 "title": "Raorchestes tuberohumerus"
}