{
 "id": "1041602",
 "text": "Gustave Emmanuel Roy is a (November 13, 1823 in Paris - December 20, 1912 in Paris) was a French merchant of the second half of the 19th century. Son of Auguste Emmanuel Roy, merchant and textile industrialist in Reims, and Annette Carcenac (sister of Henry-Gustave Carcenac), he has a sister, Clara, younger than him. His family has been Protestant for generations. He became an associate of \"Carcenac & Roy\" in 1847, then of \"Gustave Roy & Cie\" in 1862. At the head of his company \"Roy frères\", he became famous. He even became a millionaire, which enabled him, to thank his wife, née Berger, for the birth of her daughter Isabelle, after the infant death of one of the eldest, Hélène, to buy the castle of Faÿ. Elected to the Board of Directors of the Paris Chamber of Commerce and Industry in 1878, he creates the École des hautes études commerciales de Paris (known today as HEC Paris). On December 3, 1881, he inaugurated the school, which then moved to Boulevard Malesherbes. Gustave Roy was also chairman of the board of the insurance company \"La France\" and a member of the board of directors of the Chemins de fer de l'État, a position in which he campaigned for a revolution in pricing methods. He was also chairman of the board of directors of the newspaper L'Économiste français. He was the owner of Château du Faÿ, located in Andrésy, Château d'Issan and Château Brane-Cantenac with his brother-in-law Casimir Berger. Married to the sister of Georges Berger, he is the father of Gustave Roy (married to Marie Mirabaud) and Ferdinand Roy (married to Hélène Seydoux), as well as the stepfather of Emile Thurneyssen. His second (Hélène) and fifth (Georges) children died at an early age. He is buried in the Père Lachaise Cemetery. == Bibliography == * Question des banques, 1865 * 1823-1906. Souvenirs, 1906 == References == * Albert Maumene, Le Château d'Issan. À la famille de Gustave Roy, Cantenac (Gironde), 1921 * La Chambre de commerce et d'industrie de Paris (1803-2003): histoire d'une institution, 2003 * Alain Plessis, La Banque de France et ses deux cents actionnaires sous le Second Empire, 1982 * Vincent Gourdon, Les grands-parents en France du XVIIe siècle au début du XXe, Volume 1, 2001 * Gustave Emmanuel Roy, Souvenirs, 1912 Category:HEC Paris Category:1823 births Category:Recipients of the Order of the Legion of Honour Category:1912 deaths Category:Year of birth missing (living people) Category:Burials at Père Lachaise Cemetery",
 "title": "Gustave Emmanuel Roy"
}