{
 "id": "1041037",
 "text": "Presidential elections were held in Singapore on 1 September 2023. It was the sixth elected Singaporean presidential election and the third where more than one candidate was contesting in the election. The then-president Halimah Yacob did not want to seek re-election. The candidates who contested in the election are Tharman Shanmugaratnam, Ng Kok Song, and Tan Kin Lian, who are independent candidates. The Constitution states that candidates running for president must be an independent. The winner of the election was announced on 2 September. It was revealed that Tharman Shanmugaratnam was the winner, getting 70.40% of the vote. He would be the first non-Chinese president to be elected. He was inaugurated on 14 September as the ninth President of Singapore. == Background == Halimah Yacob was the eighth President of Singapore. She started playing her role on 14 September 2017. It was due to her being elected unopposed in the 2017 Singaporean presidential elections. In 2023, since then-president Halimah Yacob's term was three months from expiring, there was a need for an election to occur. She announced that she would not be contesting in the election. On 11 August 2023, Prime Minister Lee Hsien Loong announced that there would be an election and the details about the election. == Selection of candidates == Many people wanted to contest in the election. However, only three candidates were able to. They are Tharman Shanmugaratnam, Ng Kok Song, and Tan Kin Lian. Ng, who was formerly the Chief Investment Officer of a government company, had the experience to run for the presidency. His role as the Chief Investment Officer was comparable to a Chief Executive Officer. He also served in the role for more than 3 years. Tharman was able to run for the presidency as he served as a minister for more than three years. Tan, formerly the Chief Executive Officer of NTUC Income, was able to contest. He served in the role for more than three years. His role can be compared to a chief executive of a big company.https://www.eld.gov.sg/press/2023/PR%20on%20Issuance%20of%20Certificate%20of%20Eligibility%20for%20PE2023.pdf == Candidate information == === Candidates' symbols and slogans === Candidate Details of symbol Slogan Ng Kok Song Hand with a heart shape at its palm United for our future Tharman Shanmugaratnam Pineapple Respect for all Tan Kin Lian Four person living in harmony, holding a flower Bring back trust, give us hope === Team of Assenters === Candidates Ng Kok Song Tan Kin Lian Tharman Shanmugaratnam Assenter Name Name Name Proposer Quah Wee Ghee Tan Jee Say Thomas Chua Kee Seng Seconder Carol Tan Lim Tean Mohammad Alami Musa Assenter 1 Ameerali Abdeali Leong Sze Hian Mary Liew Assenter 2 Ho Tian Yee Yeo Gim Beng Lim Siong Guan Assenter 3 Chua Cher Choon Manmeet Singh s/o Bahadar Singh Ho Kwon Ping Assenter 4 Mohamed Salleh Marican Vigneswari d/o V Ramachan-dran Kamisinah Sadar Assenter 5 Margaret Chan Vincent Tan Hun Cheong Veera Sekaran Assenter 6 Abdul Hamid Abdullah Chiu Shin Kong Hassan Ahmad Assenter 7 Tjio Hans Chen Jun Hao Kim Whye Kee Assenter 8 Angelene Chan Khuan Jia Hui Royston Tan == Campaigning == Ng Kok Song stated that he is an independent candidate and has never been part of any political party in Singapore. He shared the importance of his experience protecting the reserves of Singapore with GIC. He said that he would protect the three treasures of Singapore: past reserves, public services and social stability. Tharman Shanmugaratnam said he wanted \"fair, dignified and honourable contest\" for voters, and wanted to \"unites Singaporeans and not divide us\". Tan Kin Lian highlighted the importance of having an independent candidate. He wanted voters to vote for him as he is \"truly independent\". All candidates put up posters except Ng Kok Song. He believed it hurts the environment. Also, he did not have the ability to put up posters. He would appeal to voters on the internet. All candidates used social media to campaign for the elections. == Polling and results == The day for polling was held on 1 September 2023 from 8 a.m. to 8 p.m. SST (UTC+08:00). The election would have 2,709,455 voters that can cast their votes for the next president. A sample count was released at about 11:42 p.m. The sample count was included to prevent people from speculating or relying on unofficial sources for information when the counting of votes was still going on. The count showed that Tharman was leading with 70% of the votes, followed by Ng with 16% and Tan with 14%. The final result was released at about 12:23 a.m. on 2 September, and is shown below (which excludes overseas votes): == Notes == == References == Category:Presidential elections singaporean presidential Category:Politics of Singapore Category:2023 in Asia Category:2020s elections in Asia Category:2020s in Singapore",
 "title": "2023 Singaporean presidential election"
}