{
 "id": "1041655",
 "text": "High Efficiency Video Coding (short: HEVC / H.265), also known as MPEG-H Part 2, is a video compression standard succeeding AVC (H.264). It offers 25-50% better compression or improved quality at the same bit rate. Supporting up to 8K resolution, HEVC employs diverse block sizes (4x4 to 32x32) with both integer DCT and DST. HEIF is based on HEVC. == Concept == HEVC is made by working up from H.264/MPEG-4 AVC. Both look into video frames to find repeated things within and between them. Those parts are replaced with simple descriptions. HEVC does this better by comparing areas that are bigger, up to 64x64 pixels, making variable-block-size segmentation finer, allowing better \"intra\" prediction within frames, improving motion prediction and compensation, and adding sample-adaptive offset filtering. These good changes increase compression processing, but decompression is less affected. HEVC was standardized by the Joint Collaborative Team on Video Coding (JCT-VC), a group made up of ISO/IEC MPEG and ITU-T Study Group 16 VCEG. It is known as MPEG-H Part 2 by ISO/IEC and as H.265 by ITU-T. Its first version was set in January 2013 and published in June 2013. The second version, including multiview, range, and scalability extensions, was approved in 2014 and published in 2015. 3D and screen content coding extensions followed in 2015 and 2017 respectively, that works for graphics-rich content. In 2017, HEVC got a Primetime Emmy Engineering Award for its great thing done for television technology. == History == HEVC was made by over a dozen global organizations working together. The main ones were Samsung Electronics (4,249 patents), General Electric (1,127 patents), M&K; Holdings (907 patents), NTT (878 patents), and JVC Kenwood (628 patents). Some patents are held by Fujitsu, Apple, Canon, Columbia University, KAIST, Kwangwoon University, MIT, Sungkyunkwan University, Funai, Hikvision, KBS, KT, and NEC. ==References== Category:Computer file formats Category:ISO standards",
 "title": "High Efficiency Video Coding"
}