{
 "id": "1041363",
 "text": "CN Real (short for Cartoon Network Real) is a former programming block that aired on Cartoon Network. It featured live-action reality shows that usually aired on Wednesdays and Saturdays, the block was promoted by rock musician Andrew W.K. The block was created so the network could more effectively compete with Nickelodeon and Disney Channel, both of which had a large number of Live Action programming. == Programming == ===Original programming=== Title Premiere date End date The Othersiders June 17, 2009 October 30, 2009 BrainRush June 20, 2009 July 22, 2009 Destroy Build Destroy June 20, 2009 May 28, 2010 Bobb’e Says August 19, 2009 September 23, 2009 Dude, What Would Happen August 19, 2009 May 28, 2010 === Acquired programming === Title Premiere date End date Survive This June 17, 2009 August 19, 2009 == Reception == Network executives and credits expressed concern about alienating Cartoon Network’s core audience with this block, which heavily promoted live-action programming over cartoons. The concerns were well-founded, as none of the shows ended up building any ratings momentum, not even breaking the top 10 programs aired on the network. Common complaints included the shows being ripoffs of established shows (such as Survive This being similar to Survivor, Bobb'e Says being similar to Tosh.0, and Dude, What Would Happen being similar to MythBusters and Jackass), and the fact that the shows were being heavily advertised, while animated series were effectively pushed to the side. Due to very poor reception, low & declining ratings and very negative reviews, many of the shows on the CN Real block was cancelled, except for Destroy Build Destory & Dude, What Would Happen. == Closing == The block closed down in 2010. Although new live-action shows were produced, the CN Real block was ultimately dropped after deeming the block a critical failure. Following this, it was also considered a inappropriate idea for the network as Cartoon Network has since been classified as a cartoon channel. After CN Real closed down, two of its original shows, Destroy Build Destroy and Dude, What Would Happen were renewed for additional seasons and the two shows still aired on Cartoon Network until September 21, 2011, when both of the shows were canceled. == References == Category:Cartoon Network series",
 "title": "CN Real"
}