{
 "id": "1041302",
 "text": "\"Rich Men North of Richmond\" is a song by American folk singer Oliver Anthony. It was released in August 2023. The song became very popular fast. It was the number 1 on the Billboard Hot 100. This means that Anthony is the first artist to do this without Billboard success before. == The song == The song was first uploaded to YouTube on August 8, 2023. It had 5 million views in three days. Anthony self-recorded songs on his cell phone before. \"Rich Men North of Richmond\" was Anthony's first professional song. The song lyrics mentioned working long hours, but not being payed much. In a video explaining his songwriting, Anthony said that his lyrics are attempting to speak for the working class and that he aspires to be a \"voice for those people\", noting that \"whatever it is they're doing, they can't quite get ahead\". Anthony has described his politics as \"dead center\". The song was played at a debate for the Republican presidential primary. Anthony said he did not like this because the song critiques them. == Success of the song == \"Rich Men North of Richmond\" was at the number one spot on Billboard Hot 100 on August 26, 2023, with 147,000 downloads and 17.5 million streams that week. == Charts == Chart performance for \"Rich Men North of Richmond\" Chart (2023) Peak position Australia (ARIA) 13 Ireland (IRMA) 13 Netherlands (Global Top 40) 11 New Zealand (Recorded Music NZ) 17 Sweden (Sverigetopplistan) 58 ==References== Category:Single chart usages for Canada Category:Single chart called without song Category:Single chart usages for Billboardglobal200 Category:Single chart usages for UK Category:Single chart called without artist Category:Single chart usages for UKindie Category:Single chart usages for Billboardhot100 Category:Single chart usages for Billboardcountryairplay Category:Single chart usages for Billboardcountrysongs Category:Protest songs Category:2023 songs Category:Billboard Hot 100 number one songs Category:Country songs Category:Folk songs",
 "title": "Rich Men North of Richmond"
}