{
 "id": "104175",
 "text": "Times Square is a section of Manhattan, New York City. It is a major center for tourism, show business and commerce. The square is at the meeting point of Broadway, 7th Avenue and 42nd street. One of the biggest stations in the New York City Subway system is under Times Square. The well-known city street area is probably most famous for its New Year's Eve ball drop that happens every year. It is one of the most famous sights of New York. ==Early history== When Dutch people first came to Manhattan, there were three small streams. They came together near what is now 10th Avenue and 40th Street. These three streams were part of a big stream called the \"Great Kill\" (Dutch: Grote Kill). From there the Great Kill went through the low-lying Reed Valley, known for fish and other water animals.Gerard T. Koeppel, Water for Gotham: A History, 2001:10. Its end was a deep bay in the Hudson River at present-day 42nd Street.Edric W. Sanderson, Mannahatta: A Natural History of New York City, 2009: Appendix A p 253; refs. G.E. Hill and G.E. Waring Jr, \"Old wells and water-courses on the isle of Manhattan\", in Historic New York, M.W. Goodwin, A.C. Royce, and R. Putnam, 1897; and others. People lived in a small area named Great Kill, where carriages were made. The higher land to the south and east was called Longacre.Edwin G. Burrows and Mike Wallace, Gotham: A History of New York City to 1898, 1999, p.721. When the American Revolution was happening, John Morin Scott owned the land. Scott was in the army, which was led by George Washington. During the early 1800s, John Jacob Astor bought the land, then built houses and hotels for the rich on the land. By 1872, carriages were mainly made in Longacre. The city government named the area Longacre Square after Long Acre, a place in London where carriages were also made.Kelly, Frank Bergen. Historical Guide to the City of New York New York: Frederick A. Stokes Co., 1909 Soon after, Broadway theaters were created around Longacre Square.Burrows and Wallace 1999:1149. In 1904, New York Times moved to a new building on 42nd Street at Longacre Square. Under there, a New York City Subway station was built. The area has been called \"Times Square\" since April 8, 1904. The square took its name from the newspaper. In 1913, the Times moved again. The old Times Building, One Times Square, is best known for the Times Square Ball drop that happens every December 31. Since 1913, the Lincoln Highway, the first road across the United States, has ended in Times Square. During the early 20th century, theatres, music halls, and very fancy hotels were built here. People called the area The Tenderloin because many people wanted to come to Times Square. Still, there were some gangsters in Times Square. By the 1930s, Times Square was becoming a bad place to visit. ==Later history== By the 1960s, The New York Times said that 42nd Street in Times Square was \"the 'worst' [block] in town\",Milton Bracker, \"Life on W. 42nd St. a study in decay,\" New York Times, March 14, 1960, at 1, 26. By 1984, 2,300 crimes happened in Times Square; 460 were very bad crimes like murders. The NYPD did not help to get rid of the crime in Times Square.William J. Bratton and William Andrews, \"What we've learned about policing,\" City Journal, Spring 1999, available at http://www.city- journal.org/html/9_2_what_weve_learned.html (accessed February 3, 2009).George L. Kelling and James Q. Wilson, \"Broken Windows,\" The Atlantic, March 1982, available at https://www.theatlantic.com/doc/198203/broken-windows (accessed February 3, 2009). People moved out of Times Square, and it became empty. In the 1980s through the mid-1990s, Rudolph Giuliani cleaned up the area. People did not want to go to Times Square in the 1970s. Giuliani got rid of prostitutes and drug dealers, and put in Disney stores and other places that tourists wanted to go. There are many big signs on buildings in Times Square.\"Architect Robert A.M. Stern: Presence of the Past\" (PBS video) on the Arch Daily website There are as many big signs in Times Square than in Las Vegas. After the September 11, 2001 attacks, more than seven thousand police officers came to Times Square. Before, there were only 3,500 officers. On March 6, 2008, a bomb went off in Times Square. No one was hurt.BBC News March 6, 2008 On May 1, 2010, another bomb was found in Times Square, and everyone was asked to leave. The bomb did not go off. On February 26, 2009, Mayor Michael Bloomberg closed Broadway to cars for a year. On February 11, 2010, Bloomberg said that Broadway in Times Square would be closed to cars forever. Starting in February 2011, New York City stopped people from smoking in Times Square. ==Number of visitors== Times Square is the most visited place in the world. 360,000 people come here in a day, and 131 million visit Times Square in a year. Even if people who live here are not counted, Times Square is the second most visited place in the world, behind the Las Vegas Strip. Because of the high number of visitors, Times Square gets $4.8 billion per year from stores, hotels, and attractions.Times Square Economic Impact Update, Times Square Alliance / HRA , March 2012 In fact, 22 cents out of every dollar spent by visitors to New York City is spent within Times Square. == References == == Other websites == * * Official Times Square website Category:Town squares in the United States Category:Manhattan",
 "title": "Times Square"
}