{
 "id": "104173",
 "text": "The Southern Baptist Convention (SBC) is a United States-based Christian denomination. While most of the churches that make up the SBC are in the USA, some are outside of the USA. The Convention began in the Southern United States, it is now \"in name only\" that the denomination is Southern and more members are in that region than in other regions. The name Southern Baptist Convention refers both to the denomination and to its annual meeting of members. They split from the northern Baptists in 1845 over the slavery question. At the time, the SBC was against ending slavery. In 1995 the SBC apologized and denounced slavery as evil and sinful. Some Southern Baptists refer to the convention as the Great Commission Baptist Convention, which the denomination also accepts. The Southern Baptist Convention has many avenues of ministry, including but not limited to compassion ministries such as Disaster Relief and children's homes, seminaries for training and equipping men and women for ministry and theological/philosophical education, the International Mission Board and North American Mission Board equipping and sending missionaries to spread the Gospel and seek the lost and glorify God. The SBC is different from other denominations as it respects and upholds each individual church's right of autonomy. This means the SBC has no jurisdiction, power, or direct influence on how a state convention, local association, or church operates. In fact, the SBC is the only denomination operating with a bottom-to-top leadership and voting style. Each church sends messengers (voters) to the associational meeting (if applicable), state convention, and the meeting of the SBC. One of the goals of this style of operation is to keep everything clear, above reproach, and (above all) biblical. Year Membership 1845 350,000 1860 650,000 1875 1,260,000 1890 1,240,000 1905 1,900,000 1920 3,150,000 1935 4,480,000 1950 7,080,000 1965 10,780,000 1980 13,700,000 1995 15,400,000 2000 15,900,000 2005 16,600,000 2015 15,300,000 SourceHistorical Statistics of the U.S. (1976) series H805 (with 2005 estimate from Convention figures) visit http://www.baptisthistory.org/sbaptistbeginnings.htm == References == == Other websites == *Official SBC website Category:1845 establishments in the United States Category:Christian organizations based in the United States",
 "title": "Southern Baptist Convention"
}