{
 "id": "1042198",
 "text": "Pomacentrinae is one of four subfamilies in the family Pomacentridae which includes the clownfishes and the damselfishes. It is the most diverse of the subfamilies in the Pomacentridae with around 21 genera and approximately 200 species. ==Characteristics== The species within the Pomacentrinae have orb- like to partly long bodies and they do not have spiny caudal rays projecting out of the caudal peduncle. The majority of species asre territorial and they defend their feeding territory from members of their own species and other species which compete with them for food. They feed on algae, which they appear to farm, actively increasing the algal productivity within their territories. Many species lay demersal eggs, which are guarded and fanned by the male. One species, the freshwater demoiselle Neopomacentrus taeniurus is known to enter rivers and even reaches into the lowest stretches of streams. == Classification == The 5th Edition of Fishes of the World states that the Pomacentrinae is most likely to be paraphyletic but does not break the subfamily into different lineages. Other authorities split the Pomacentrinae into the subfamilies Abudefdufinae and Stegastinae and include the Amphiprioninae, the clownfishes as the tribe Amphiprionini within the Pomacentrinae. ===Genera=== The following genera are classified in the subfamily Pomacentrinae: * Abudefduf Forsskål, 1775 * Amblyglyphidodon Bleeker, 1877 * Amblypomacentrus Bleeker, 1877 * Cheiloprion M.C.W Weber, 1913 * Chrysiptera Swainson, 1839 * Dischistodus Gill, 1863 * Hemiglyphidodon Bleeker, 1877 * Hypsypops Gill, 1861 * Mecaenichthys Whitley, 1929 * Microspathodon Günther, 1862 * Neoglyphidodon Allen, 1991 * Neopomacentrus Allen, 1975 * Nexilosus Heller and Snodgrass, 1903 * Parma Günther, 1862 * Plectroglyphidodon Fowler & Ball, 1924 * Pomacentrus Lacépède, 1802 * Pomachromis Allen & Randall, 1974 * Pristotis Rüppell, 1838 * Similiparma Hensley, 1986 * Stegastes Jenyns, 1840 * Teixeirichthys J.L.B. Smith, 1953 ==References==",
 "title": "Pomacentrinae"
}