{
 "id": "1042073",
 "text": "Almedin Hota (born 22 July 1976 in Sarajevo) is a Bosnian retired professional footballer. ==Career== Hota began his career at FK Željezničar Sarajevo. His next club was NK Olimpik. In Bosnia he played also for NK Bosna and FK Sarajevo. In 2000 he went to FC Kärnten in Austria. In the 2000/01 season they were promoted to the Bundesliga and also won the ÖFB-Cup against FC Tirol Innsbruck and the Supercup. In the summer of 2006 Almedin Hota moved to LASK Linz. In September 2008 he went to FC Admira Wacker Mödling. He then moved to Aluminum Hormozgan in Iran in January 2010. In the summer of 2010 he left Asia again. In January 2011 Hota returned to Austria and joined fourth-tier FC Welzenegg. For the 2011–12 season he moved to regional league club SK Austria Klagenfurt. For the 2012/13 season he joined SVG Bleiburg. For the 2013–14 season he returned to Klagenfurt and joined the fourth-rate Annabichler SV. With the Annabichlers he was promoted to the regional league in 2015, from which the club was relegated directly at the end of the 2015–16 season. After Klagenfurt was relegated from the state league in 2018, Hota left the club. He then moved to the sixth-rate SK Kühnsdorf for the 2018–19 season. After 14 matches he returned to Klagenfurt again during the winter break. He joined the fifth-class ASK Klagenfurt. ==International career== He made his debut for Bosnia and Herzegovina in a May 1998 friendly match away against Argentina and has earned a total of 22 caps, scoring 3 goals. His final international was an October 2002 friendly against Germany. ==Honours== ===Player=== Bosna Visoko *Bosnian Cup: 1999 Kärnten *Austrian Football Second League: 2001 *Austrian Cup: 2001 *Austrian Supercup: 2001 LASK *Austrian Football Second League: 2006–07 ==References== ==Other websites== * Category:1976 births Category:Living people Category:Association football midfielders Category:Azadegan League players Category:Bosnia and Herzegovina footballers Category:LASK players",
 "title": "Almedin Hota"
}