{
 "id": "1042718",
 "text": "This is a list of Iranic states, dynasties and empires. == Current == === Independent === Name Status of Iranic lanaguage Years Iran Persian is the official languageConstitution of Iran, Article 15. 1979 Tajikistan Tajik is the state (national) languageConstitution of Tajikistan, Article 2. 1991 Afghanistan Pashto and Dari is the official langugeConstitution of Afghanistan, Article 16. First Islamic Emirate in between 1996 and 2001 second emirate since the 2021 === Autonomous === Federal subjects (Republics) of Russia Name Years North Ossetia–Alania 2010 – 65.1% Ossetians 1992 Dagestan 2010 – 0.01% Tats 1992 Other autonomy Taxkorgan Tajik Autonomous County 2020 – 80.9% Sarkoli (referred to as \"Tajiks\")塔什库尔干塔吉克自治县基本概况 [Basic Situation of Taxkorgan Tajik Autonomous County]. (in Mandarin). \"塔什库尔干塔吉克自治县（简称塔县）地处祖国西部边陲，帕米尔高原东麓，平均海拔4000米以上。全县总面积2.5万平方公里，辖12个乡镇50个村（社区），总人口4.1万人，塔吉克族占80.9%，是全国唯一的塔吉克民族自治县，外与巴基斯坦、阿富汗、塔吉克斯坦及克什米尔地区接壤，边境线长793.6公里，\" [\"The county has a total area of 25,000 square kilometers, governs 12 townships and 50 villages (communities), and has a total population of 41,000. Tajiks account for 80.9%. It is the only Tajik ethnic autonomous county in the country. The region borders with a border line of 793.6 kilometers long.\"] 1954 AANES 2013 Gorno-Badakhshan Autonomous Region 1991 Self-governing provinces subject to the federal government in Pakistan Balochistan 2017 – by language, 35.49% Balochi, 35.34% Pashto\"Census Final Results – Mother Tongue\". (PDF). Pakistan Bureau of Statistics. 2017. 1970 Khyber Pakhtunkhwa 2017 – by language, 76.86% Pashto 1970 ==Historical == === Current Iranic peoples === Ethnicity Native name Name of their land Persians پارسیان (Pārsīān) Persia Pashtuns پښتانه (Pax̌tāna) Pashtunistan Kurds کوردان (Kūrdān) Kurdistan Tajiks Тоҷикон (Toǰikon) Tajikistan Balochs بلۏچان (Balòčān) Balochistan Mazandaranis مازرون (Māzarūn) Mazandaran Lurs لﺭ (Lor) Luristan Gilaks گيلکون (Gīlak'ūn) Gilan Hazaras ازره (Āzrə) Hazaristan Aimaqs ایماق (Aīmāq) Zazas/Dimli Dimlī Zazakistan Ossetians/Alanians Аланиæгтæ (Alanægtæ) Ossetia/Alania Tats (Iran) تاتون (Tatün) Basseri باصری Lohijon Lohijon Dehwars دهوار (Dehwār) Achomis اچم (Ačom) Achomestan Talyshs تالشان (Tōlışōn) Talish Semnanis سمنی (Samani) Semnan Wakhis وخیک (Woḵīk) Yaghnobis Yaγnōbī́t Yaghnob Kumzaris کومزاريان (Kūmzārīān) Kumzar Yidgha یدغا (Yidġā) Munjis مونجی (Mūnǰī) Kuran wa Munjan === Historical Iranic peoples and tribal conferedations === * Alans * Sogdians * Scythians: \"SCYTHIANS, a nomadic people of Iranian origin (...)\" : \"The rise of the Scythian kingdom represented an event of intra-ethnic character, since both Cimmerians and Scythians were Iranian peoples.\" : \"During the first half of the first millennium B.C., c. 3,000 to 2,500 years ago, the southern part of Eastern Europe was occupied mainly by peoples of Iranian stock [...] [T]he population of ancient Scythia was far from being homogeneous, nor were the Scyths themselves a homogeneous people. The country called after them was ruled by their principal tribe, the \"Royal Scyths\" (Her. iv. 20), who were of Iranian stock and called themselves \"Skolotoi\" (...)\" : \"[T]rue Scyths seems to be those whom [Herodotus] calls Royal Scyths, that is, the group who claimed hegemony [...] apparently warrior-pastoralists. It is generally agreed, from what we know of their names, that these were people of Iranian stock (...)\" : \"The physical characteristics of the Scythians correspond to their cultural affiliation: their origins place them within the group of Iranian peoples.\" : \"The Scythian kingdom [...] was succeeded in the Russian steppes by an ascendancy of various Sarmatian tribes — Iranians, like the Scythians themselves.\" : \"The general view is that both agricultural and nomad Scythians were Iranian.\" * Dahaeans * Parthians * Cimmerians * Sarmatians * Sakas * Medes * Daylamites * Massagetaeans * Khwarezmians === Iranic states and dynasties === * Scythian kingdoms ** Scythian Kingdom in West Asia (c. 7th century BC–c. 600s BC) ** Scythian Kingdom in Pontic Steppe (c. 600s BC–c. 3rd century BC) * Cimmerian Kingdom (early 7th-century B.C.E. – 630s B.C.E.) of Cimmerian origin * Medes (ca. 678 BCE–549 BCE) of Median origin * Orontid dynasty (570–200 BC) Persianized, of Bactrian origin * Tespid dynasty (mid-7th century BC-550 BC) of disputed origin, could be either Elamite or Persian origin, could be a branch of Achaemenid Dynasty * Pharnacid dynasty (c. 550–320 BC) of Persian origin * Achaemenid Empire (550–330 BC) of Persian origin * Parthian/Arsacid Empire (\"Arsacid dynasty of Parthia\"; 247 BC–224 AD) Heavily Parthianized, of either Scythian or Bactrian origin ** Arsacid dynasty of Armenia (52–428) ** Arsacid dynasty of Iberia (c. 189–284) ** Arsacid dynasty of Caucasian Albania (1st century–510) * Xiongnu (220–2nd Century AD) of Sogdian origin, later Turkified * Indo-Scythians (200 BCE–400 AD) of Scythian origin * Shule Kingdom (200 BC–790 AD) of Sakan origin * Artaxiad dynasty (190 BC–12 AD) of Iranian origin * Indo-Parthian Kingdom (12 BC–before 100 AD?) of Parthian origin * Κoϸano Empire (30–375 AD) of Yuezhi Saka origin * Kingdom of Khotan (56–1006) of Khotanese Sakan origin * Sasanian Empire (224–651) of Persian origin * House of Kayus (226–380) Probably of Palewani Kurdish origin * Chosroid dynasty (284–807) of Parthian origin * Afrighids (305–995) of Khwarazmian origin * Kingdom of the Alans (409–426) of Alan origin * Mihranids (330–821) of Parthian origin * Dabuyid dynasty (642–760) of Persian origin * Masmughans of Damavand (650–760) of Parthian origin * Bavand dynasty (651–1349) of Parthian origin * Paduspanids (665–1598) of Mazandarani origin * Bukhar Khudahs (before 681–890s) of Sogdian origin * Principality of Ushrusana (?–892/3) of Sogdian origin * Qarinvand dynasty (7th-century–11th-century) of Parthian origin * Rustamid dynasty (767–909) of Persian origin * Sadakiyans (770–828) of Kurmanji Kurdish origin * Justanids (791–974) of Daylamite origin * Samanids (819–999) of Persian origin * Tahirid dynasty (821–873) they are culturally highly Arabicized, but of Persian origin * Banijurids (848–908) of Iranic origin * Saffarid dynasty (861–1003) of Persian origin * Ghurid dynasty (before 879–1219) Persianized, of eastern Iranian origin * Sajid Dynasty (889–929) of Sogdian origin: \"The Sājids were a line of caliphal governors in north-western Persia, the family of a commander in the 'Abbasid service of Soghdian descent which became culturally Arabised.\" * Qarmatians (899–1077) of Persian origin * Alania (late 9th century–1238/1239) of Alan origin * Farighunids (9th century–1010) of Persian origin * Ziyarid dynasty (931–1090) of Gilaki origin * Banu Ilyas (932–968) of Sogdian origin * Buyid dynasty (934–1062) of Daylamite origin * Hasanwayhids (950–1121) Probably of Laki Kurdish origin * Shaddadids (951–1199) probably of Kurmanji Kurdish origin * Kilwa Sultanate (957-1913) of Persian origin * Marwanids (983/990–1085) likely assimilated into Kurmanji Kurdish culture & spoke Kurmanji Kurdish, probably of Laki Kurdish origin * Annazids (990–1116) of Kurdish origin, it is not known what dialect of Kurdish they spoke * Ma'munids (995–1017) of Khwarazmian origin * Kakuyids (1008–1141) of Daylamite origin * Nasrid dynasty (Sistan) (1029–1225) Persianized, of eastern Iranian origin * Hazaraspids (1115–1424) of Kurmanji Kurdish origin * Atabegs of Yazd (1141–1319) of Persian origin * Qurid dynasty (1148-1215) of Persian orgin * Khorshidi dynasty (1184–1597) of Lur origin * Ayyubid dynasty (1171–1260/1341) later Arabized, of Kurmanji Kurdish origin * Principality of Bitlis (1182–1847) of Kurdish origin * Emirate of Hasankeyf (1232–1524) of Kurdish origin * Kurt Dynasty (1244–1381) of eastern Iranian origin * Pervâneoğlu (1261–1326) of Persian origin * Zirqanids (1335–1835) of Kurmanji Kurdish origin * Afrasiab dynasty (1349–1504) of Mazandarani origin * Marʿaši Dynasty (1359–1596) of Mazandarani origin * Lodi dynasty (1451–1526) of Pashtun origin * Mirani dynasty (1476–1787) of Baloch origin * Emirate of Palu (1495–1850) of Kurdish origin * Muzaffarids (Somalia) (late 15th-1700) of Persian origin * Safavid Empire (1501–1736) Turkified of Kurmanji Kurdish origin * Emirate of Bradost (1510–1609) of Kurmanji Kurdish origin * Soran Emirate (1514–1836) of Sorani Kurdish origin * Sur Empire (1540–1556) of Pashtun origin * Ardalan (14th century–1865/1868) of Sorani Kurdish origin * Baban (1649–1850) of Palewani Kurdish origin * Karrani Dynasty (1564–1576) of Pashtun origin * Hotaki dynasty (1709–1738) of Pashtun origin * Nawab of Awadh (1732–1856) of Persian origin * Sarab Khanate (1747–?) of Kurmanji Kurdish origin * Durrani Empire (1747–1862) of Pashtun origin * Zand dynasty (1750–1794) of Laki Kurdish origin * Talpur dynasty (1783–1843) of Baloch origin * Emirate of Herat (1793–1863) of Pashtun origin * Barakzai dynasty (1826–1973) of Pashtun and Persian origin * Pahlavi dynasty (1925–1979) of Mazandarani origin * Islamic republic (1979-now) current leader is of Persian origin === Sinicized Iranic dynasties === * Yan dynasty (756–764) of Sogdian and Göktürk origin === Hellenized Iranic states === * Kingdom of Pontus (281 BC–36 BC) Ruled by the Mithridatic dynasty of Persian origin until 36 BC * Kingdom of Cappadocia (320s BC–36 BC) Ruled by the Ariarathid dynasty until 96 BC, by Ariobarzanid dynasty until 36 BC, both are Persian origin == Former and defunct Iranic governments == Name Notes Years Capital Map Mountainous Republic of the Northern Caucasus was a country in the North Caucasus formed by the unification of many North Caucasian peoples including Ossetians 1917–1922 Buynaksk Kingdom of Kurdistan short-lived Kurdish state proclaimed in the city of Sulaymaniyah following the collapse of the Ottoman Empire 1921–1924/1925 Sulaymaniyah Republic of Ararat was a self-proclaimed Kurdish state, located in eastern Turkey, centred on Karaköse Province 1927–1931 Doğubayazıt Republic of Kurdistan short-lived Kurdish self-governing unrecognized state in present- day Iran who was puppet of Soviet Union 1945–1946 Mahabad Republic of Afghanistan was the first republic in Afghanistan, often called the Daoud Republic, as it was established in July 1973 after General Sardar Mohammad Daoud Khan deposed his cousin, King Mohammad Zahir Shah, in a coup d'état 1973–1978 Kabul Interim Government of Iran provisional government after the Islamic Revolution in Iran 1979 Tehran == Teritories == === Russian Empire === * Caucasus Viceroyalty (1801–1917) including the many Ossetian, Tat and Kurdish populated lands. There are fourteen provinces called governorate, oblast, okrug and gradonachalstvo === Soviet Union === * Persian Socialist Soviet Republic (1920–1921) short-lived Soviet republic in Gilak and Talysh populated regions of Iran * North Ossetian ASSR (1936–1992) Ossetian republic in northern Ossetian-populated lands * South Ossetian AO (1922–1990) Ossetian autonomous oblast in southern Ossetian-populated lands *Kurdistan uezd (1923–1929) Kurdish uezd of Kurdish-populated lands in Karabakh * North Ossetian AO (1924–1936) Ossetian autonomous oblast in northern Ossetian- populated lands * Tajikistan SSR (1929–1991) Tajik soviet republic in Tajik populated lands == Notes == == References == ==Sources== *Gregoratti, Leonardo. \"The kings of Parthia and Persia: some considerations on the ‘Iranic’ Identity in the Parthian Empire.\" Dabir 1.1 (2015): 14-16. *Toops, Stanley. \"The Population Landscape of Xinjiang/East Turkestan.\" Inner Asia 2.2 (2000): 155-170. *Gnoli, Gh. \"Iranic Identity as a historical problem: the beginnings of a national awareness under the Achaemenians.\" The East and the Meaning of History (1992): 147-167. *Lambton, Ann KS. \"Persia.\" Journal of the Royal Central Asian Society 31.1 (1944): 8-22. *Lohrasp, G. \"Some remarks on Farabi's background: Iranic (Soghdian/Persian) or (Altaic)?.\" (2009). *صدرا, علیرضا. \"Making Discourse and Realization, Monitoring of Islamic–Iranic Progress' Olgou (executive necessaries of Olgou and Political Plans).\" سیاست متعالیه 10.38 (2022). *Waghmar, Burzine. \"Settled rather than saddled Scythians: the easternmost Sakas.\" (2020): 639-649. *Gregoratti, Leonardo. \"The journey east of the Great King: East and West in the Parthian kingdom.\" The Journey East of the Great King: East and West in the Parthian kingdom (2013): 43-52. *Khudaverdyan, A. Yu. \"A bioarchaeological analysis of the population of the Armenian Highland and Transcaucasus in the Antiquity.\" The Mankind Quarterly 53.1 (2012): 3-35. *Foltz, Richard. The Ossetes: Modern-day Scythians of the Caucasus. Bloomsbury Publishing, 2021. *Watson, William. \"The Chinese contribution to eastern nomad culture in the pre‐Han and early Han periods.\" World Archaeology 4.2 (1972): 139-149. *Kümmel, Martin Joachim. \"“Prothetic h-” in Khotanese and the reconstruction of Proto-Iranic.\" Script and Reconstruction in Linguistic History. *Sharkey, Benjamin. \"Predators and Prey: Cosmological Perspectivism in Scythian Animal Style Art.\" Arts. Vol. 11. No. 6. MDPI, 2022. N *Turchin, Peter. \"A theory for formation of large empires.\" Journal of Global History 4.2 (2009): 191-217. *Farrokh, Kaveh. \"Lion and Sun Emblem of Iran, a Pictorial Historical Analysis Historical Analysis in 3 Parts Part 3: Qajars and After.\" *Bekhrad, Joobin. \"Kiss my lips: Female poets in the Persian language.\" TLS. Times Literary Supplement 6099 (2020): 28-29. *Sharif, Nemat. \"A Brief History of Kurds and Kurdistan: Part I: From the Advent of Islam to AD 1750.\" The International Journal of Kurdish Studies 10.1/2 (1996): 105. *Lee, Joo-yup. \"The Sogdian Descendants in Mongol and post-Mongol Central Asia: The Tajiks and Sarts.\" Acta Via Serica 5.1 (2020): 187-198. *Ethington, Michael David. \"The Hunnic Dilemma: Between Identity and Environmental-Economic Crises.\" Journal of Asian Civilizations 44.2 (2021): 109-120. *Turchin, Peter, Thomas E. Currie, and Edward AL Turner. \"Mapping the spread of mounted warfare.\" Cliodynamics 7.2 (2016). *Waghmar, Burzine. \"Settled rather than saddled Scythians: the easternmost Sakas.\" (2020): 639-649. *Scarborough, Matthew JC. \"Bactrian χϸονο ‘(calendar) year,(regnal) year’.\" Journal of the Royal Asiatic Society 31.3 (2021): 599-607. *BORJIAN, Habib. \"NORTH IRANIC PEOPLES IN THE ENCYCLOPÆDIA IRANICA.\" NARTAMONGæ (2019): 413. *Grønbech, Kaare. \"The steppe region in world history. II.\" Acta Orientalia 24 (1959): 14-14. *Salvatori, Sandro. \"Bactria and Margiana seals: a new assessment of their chronological position and a typological survey.\" East and West 50.1/4 (2000): 97-145. *Häberl, Charles. \"Balaybalan.\" (2015). *Mengal, Mir Aqil Khan. \"\" THE BARKI TRIBE AND LANGUAGE.\" Mut̤ālaʻah-yi Pākistān 2 (1991): 83. *Ethington, Michael David. \"The Hunnic Dilemma: Between Identity and Environmental-Economic Crises.\" Journal of Asian Civilizations 44.2 (2021): 109-120. * Kovalevskaia, V. B \"Central Ciscaucasia in Antiquity and Early Middle Ages: Caucasian Substratum and Migrations of the Iranic-Speaking Tribes.\" (1988). Category:Lists of countries Category:History of Iran",
 "title": "List of Iranic dynasties and countries"
}