{
 "id": "1042604",
 "text": "The Coup Belt is a term used to talk about a part of West Africa and the Sahel, where there are a lot of coups (where a group of people take over a government by force) happening. This term became popular recently because there were many coups in the early 2020s. Some examples include coups in Mali, Guinea, Chad, Sudan, Burkina Faso, Niger, and Gabon. After a coup in Niger in 2023, these countries formed a line across Africa from the east coast to the west coast. == Where it started == Since 1990, most of the coups in sub- Saharan Africa happened in countries that used to be ruled by France. Some people think that French influence might be causing instability in Africa. The military leaders in Mali, Burkina Faso, and Niger stopped letting French troops operate in their countries. They also stopped using French as an official language. There was supposed to be French troops in Niger after they left Mali and Burkina Faso. But because of a crisis in Niger and problems with France, this didn't happen. A group called ECOWAS tried to change the bad image of this region, but they couldn't. They suspended Mali and Guinea after coups happened in those countries. The coups in these countries are often similar. They usually happen because the military is unhappy with how the government is dealing with problems like protests or Islamic groups. The new leaders also don't have good relationships with Western countries. Instead, they look for support from Russia, Turkey, or other places. == Summary of coups d'état in West Africa and the Sahel region == Date Country Event Head of state or government Coup leader(s) Outcome 1963 Dahomeyan coup d'état Christophe Soglo Hubert Maga Coup successful 1963 Togolese coup d'état Sylvanus Olympio Coup successful 1963 Nigerian coup d'état attempt Hamani Diori Hassan A. Diallo Coup failure 1966 Upper Voltan coup d'état Maurice Yaméogo Sangoulé Lamizana Coup successful 1966 Nigerian coup d'état Nnamdi Azikiwe Chukwuma Kaduna Nzeogwu Coup failure 1966 Ghanaian coup d'état Kwame Nkrumah Emmanuel Kwasi Kotoka Coup successful 1966 Nigerian counter-coup Johnson Aguiyi-Ironsi Yakubu Gowon Coup successful First 1967 Sierra Leone coup d'état Siaka Stevens David Lansana Coup successful Second 1967 Sierra Leone coup d'état David Lansana Andrew Juxon-Smith Coup successful 1968 Malian coup d'état Modibo Keïta Moussa Traoré Coup successful 1974 Nigerien coup d'état Hamani Diori Seyni Kountché Coup successful 1980 Upper Volta coup d'état Sangoulé Lamizana Saye Zerbo Coup successful 1982 Upper Voltan coup d'état Say Zerbo Jean-Baptiste Ouédraogo Coup successful 1983 Upper Voltan coup d'état attempt Jean-Baptiste Ouédraogo Saye Zerbo Coup failure 1983 Upper Voltan coup d'état Jean-Baptiste Ouédraogo Thomas Sankara Coup successful 1984 Guinean coup d'état Louis Lansana Beavogui Lansana Conté Coup successful 1987 Sierra Leonean coup d'état attempt Joseph Saidu Momoh Francis Minah Coup failure 1987 Burkina Faso coup d'état Thomas Sankara Blaise Compaoré Coup successful 1990 Chadian coup d'état Hissène Habré Idriss Déby Coup successful 1991 Malian coup d'état Moussa Traoré Amadou Toumani Touré Coup successful 1992 Sierra Leonean coup d'état Joseph Saidu Momoh Valentine Strasser Coup successful 1996 Nigerien coup d'état Mahamane Ousmane Ibrahim Baré Maïnassara Coup successful 1999 Nigerien coup d'état Ibrahim Baré Maïnassara Daouda Malam Wanké Coup successful 2003 Burkina Faso coup d'état attempt Blaise Compaoré Coup failure 2005 Togolese coup d'état Fambaré Ouattara Natchaba Coup successful 2008 Guinean coup d'état Aboubacar Somparé Moussa Dadis Camara Coup successful 2010 Nigerien coup d'état Mamadou Tandja Salou Djibo Coup successful 2011 Nigerien coup d'état attempt Mahamadou Issoufou Coup failure 2012 Malian coup d'état Amadou Toumani Touré Amadou Sanogo Coup successful 2014 Burkina Faso uprising Blaise Compaoré Uprising successful 2015 Burkina Faso coup d'état attempt Michel Kafando Gilbert Diendéré Coup failure 2019 Sudanese coup d'état Omar al-Bashir Coup successful 2020 Malian coup d'état Ibrahim Boubacar Keïta Coup successful 2021 Nigerien coup d'état attempt Mohamed Bazoum Sani Saley Gourouza Coup failure Death of Idriss Déby Idriss Déby Mahamat Déby Regarded as a coup by regional opposition 2021 Malian coup d'état Bah Ndaw Assimi Goïta Coup successful 2021 Guinean coup d'état Alpha Condé Mamady Doumbouya Coup successful 2021 Sudan coup d'état Abdalla Hamdok Coup successful January 2022 Burkina Faso coup d'état Roch Marc Christian Kaboré Paul-Henri Sandaogo Damiba Coup successful September 2022 Burkina Faso coup d'état Paul-Henri Sandaogo Damiba Ibrahim Traoré Coup successful 2023 Sudan conflict Abdel Fattah al-Burhan Hemedti Inconclusive; led to civil conflict 2023 Nigerien coup d'état Mohamed Bazoum Coup successful 2023 Sierra Leone coup attempt Julius Maada Bio Coup failure 2023 Gabonese coup d'état Ali Bongo Ondimba Brice Oligui Coup successful == References == Category:2020s in politics Category:Africa",
 "title": "Coup Belt"
}