{
 "id": "1042029",
 "text": "Christopher Morad Salmanpour (born 1977) is a British-Iranian screenwriter of movie and television. He is best known for the action-thriller Retribution (2023 film), starring Liam Neeson. Salmanpour is also a winner of TheBlackList annual writers competition, securing script deals with industry giants Warner Bros and StudioCanal. ==Early life and education== Salmanpour was born in Iran and raised in London. He attended L’Ecole Lycee-Francais and Highgate Secondary School. Inspired by his family’s experience escaping their home country after the 1979 Iranian Revolution, he studied International Affairs at Warwick University and later pursued a Masters degree from UCLA Film School. ==Career== Prior to his screenwriting career, he had a 17-year executive career in the tech industry including 7 years at Microsoft from 2006-2012. In 2001, Salmanpour was cast as an Arab voice-over artist in a comedy-drama Room to Rent (2001). After his grandfather’s death, Salmanpour wrote The Promise in 2016 – a screenplay about his grandfather’s escape from the notorious Ervin Prison in Tehran. This script earned the distinction as the first-ever double winner of The Black List Writers competition, taking home two out of the three contests that secured script deals with Warner Brothers and StudioCanal. According to Hollywood Reporter, \"Salmanpour was selected for the deal in accordance with the partnership formed last February between StudioCanal, TheBlackList, and The Picture Company to find a new voice among European Union writers for a blind script deal. His talent was showcased in his sample script The Promise.\" In 2023, Salmanpour’s feature film Retribution (2023 film) directed by Nimród Antal and produced by StudioCanal and The Picture Company, premiered on August 25, 2023, starring Liam Neeson, Matthew Modine, Arian Moayed, Noma Dumezweni, and Embeth Davidtz. Retribution was released worldwide for theatrical distribution, including in the United States, Canada, and India by Lionsgate Films. ==Personal Life== Salmanpour lives with his wife and two children in London. == Filmography == Film Year Title Director Notes 2023 Retribution (2023 film) Nimród Antal Action thriller film Television Year Title Notes 2023 FBI: Most Wanted 2 episodes (4.11, 4.19) ==References== == Other websites == * Christopher Salmanpour at IMDb Category:1977 births Category:Living people Category:British television writers Category:British screenwriters",
 "title": "Christopher Salmanpour"
}