{
 "id": "1042996",
 "text": "The Evil Queen (also known as the Wicked Queen, Queen Grimhilde, Queen Ingrid, the witch or the hag) is a fictional character who is the antagonist of the fairy tale Snow White (written by the Brothers Grimm) and its many adaptations. == Character == The exact personality of the Evil Queen is different depending on which version of the story is being told but one thing (almost) always stays the same: she is obsessed with beauty. In the story, she is the stepmother of Snow White. In some versions, she married Snow White's father (the King) so that she could become Queen and kill him. The Evil Queen is jealous of Snow White because she is told that the princess is more beautiful than she is. === Character biography === The Evil Queen owns a magic mirror, which one day tells her that her young stepdaughter Princess Snow White is now more beautiful than she is. The Queen orders her Huntsman to take the princess into the forest and murder her. The Huntsman takes pity on Snow White, and instead, brings the Queen the lungs and liver of a wild boar. The Queen has the cook prepare the lungs and liver and she eats what she believes are Snow White's organs. While questioning her mirror again, the Queen learns that Snow White is still alive. Planning to kill Snow White herself, she dresses up as an old hag. She sells Snow White laces for a corset that she laces too tight to suffocate her to death. When that doesn’t work, the Queen comes back as a comb seller and tricks Snow White into using a poisoned comb. When the comb, too, fails to kill Snow White, the Queen again visits Snow White disguised as a farmer's wife and gives Snow White a poisoned apple. She eats the poisoned apple and falls into a deep sleep. Snow White is awakened by the Prince from another kingdom, and they invite the Queen to their wedding. There, she is forced to put on red-hot iron shoes and \"dance\" until she dies. === Different versions of the Evil Queen's defeat === The Evil Queen's death changes depending on which version of the story. In more modern times, the Evil Queen no longer dies due to dancing in red-hot iron shoes. Some versions say she died from anger after finding out Snow White survived the apple while others have Snow White forgive the Queen.https://www.siraj.co/products/snow- white-an-islamic-tale == Adaptations == The Evil Queen appears in many adaptations of the story but her most famous appearance is in Snow White and the Seven Dwarfs, a Disney movie. Here, her character is mostly the same except she is also a witch. In the Disney movie, the Evil Queen transforms into a hag using magic and travels to give Snow White a poisoned apple, which she eats and dies. The Evil Queen is then chased by the Seven Dwarfs and falls off a cliff. In the 2024 remake, she will be played by Gal Gadot. == Sources == Category:Disney characters Category:Fictional royalty Category:Fictional dictators Category:Supervillains",
 "title": "Evil Queen"
}