{
 "id": "1043057",
 "text": "Robert Körner (21 August 1924 – 22 June 1989) was an Austrian footballer. In the late 1940s and 50s, together with his younger brother Alfred Körner, he played for SK Rapid Wien and for the Austrian national team. ==Club career== Robert Körner came to Rapid's youth team in 1938. Robert Körner(Körner I) made his debut for Rapid at the right wing position on August 23, 1942 in a 10-1 victory over Wiener Austria. His brother Alfred (Körner II) soon played as a left winger. His first title win in Hütteldorf was in the first post-war championship in 1945/46. The striker was also able to triumph in the Cup final against Vienna. Robert Körner was able to receive a total of seven championships He ended his career after the 1956/57 season. ==International career== Körner made his debut for Austria in November 1948 against Sweden He was a participant at the 1954 FIFA World Cup. He earned 16 caps and one goal. ==Managger== After his active career, Robert Körner became a coach. First he worked at Rapid from 1959 to 1966. He won the championship two more times . Then he went Germany. He spent a season at SV Waldhof Mannheim Then he was assistant coach in the Bundesliga under his former colleague Max Merkel at 1 .FC Nuremberg. Winning the German championship in 1968 was his greatest success. In the 1968/69 season he succeeded Merkel as coach of 1. FC Nürnberg. He was released after just 18 days, on April 12, 1969. Later, Robert Körner always jumped in at Rapid when there was a need, so he worked three times as head coach: 1969/70, 1972 and 1975/76. ==Honours== ===Player=== * Austrian Football Bundesliga: 1946, 1948, 1951, 1952, 1954, 1956, 1957 * Austrian Cup: 1946 * Zentropa Cup: 1951 ===Managerial=== * Austrian Football Bundesliga: 1960, 1964 * Austrian Cup: 1961, 1972, 1976 ==Other websites== *Profile and stats - Rapid Archive *UEFA On This Day * Category:1924 births Category:1989 deaths Category:1954 FIFA World Cup players Category:Austrian footballers Category:Austrian football managers Category:Sportspeople from Vienna Category:Austrian football forwards Category:SK Rapid Wien players Category:First Vienna FC managers Category:SK Rapid Wien managers Category:Austrian football champions",
 "title": "Robert Körner"
}