{
 "id": "1043155",
 "text": "Lucille La Verne (November 7, 1872 – March 4, 1945) was an American actress who was famous for her appearances in early sound films (the first films that were not silent). In modern times, she is most known for voicing the Evil Queen in Snow White and the Seven Dwarfs, which happened to be her final film role. == Life == Lucille La Verne was born near Nashville, Tennessee in 1872. From the age of 14, La Verne began acting on stage. She made her film debut in 1915 in the movie Over Night. Her best known part is that of the voice of the Evil Queen, from Disney's 1937 animated film Snow White and the Seven Dwarfs, which makes her the first person to voice a villain in a feature-length animated film. La Verne died in 1945, in California after suffering from cancer. == Filmography == *1915: Over Night as Minor Role *1916: Sweet Kitty Bellairs as Lady Maria (as Lucille Lavarney) *1916: The Thousand-Dollar Husband as Mme. Batavia (as Lucille La Varney) *1917: Polly of the Circus as Mandy *1918: The Life Mask as Sarah Harden *1918: Tempered Steel as Old Mammy *1919: The Praise Agent as Mrs. Eubanks *1921: Orphans of the Storm as Mother Frochard *1923: The White Rose as 'Auntie' Easter (as Lucille Laverne) *1923: Zaza as Aunt Rosa *1923: Among the Missing as The Mother *1924: America as Refugee Mother (as Lucile La Verne) *1924: His Darker Self as Aunt Lucy *1925: Sun-Up as Mother *1928: The Last Moment as Innkeeper *1930: Abraham Lincoln as mid-wife *1930: Sinners' Holiday as Mrs. Delano (as Lucille LaVerne) *1930: Du Barry, Woman of Passion as Minor Role (voice, uncredited) *1930: The Comeback (Short) *1931: Little Caesar as Ma Magdalena (uncredited) *1931: The Great Meadow as Elvira Jarvis *1931: An American Tragedy as Mrs. Asa Griffiths *1931: 24 Hours as Mrs. Dacklehorse *1931: The Unholy Garden as Lucie Villars *1932: Union Depot as lady with pipe (uncredited) *1932: She Wanted a Millionaire as Mother Norton *1932: Alias the Doctor as Martha Brenner, Karl's foster mother (as Lucille LaVerne) *1932: While Paris Sleeps as Mme. Golden Bonnet *1932: Hearts of Humanity as Mrs. Sneider *1932: Breach of Promise as Mrs. Flynn *1932: Babes in the Woods (Short) as Witch (voice, uncredited) *1932: A Strange Adventure as Miss Sheen *1932: Wild Horse Mesa as Ma [The General] Melberne *1933: Father Noah's Ark (short) as Noah's Wife *1933: Pilgrimage as Mrs. Kelly Hatfield *1933: The Last Trail as Mrs. Wilson *1934: Beloved as Mrs. Briggs *1934: School for Girls as Miss Keeble *1934: Kentucky Kernels as Aunt Hannah (as Lucille LaVerne) *1934: The Mighty Barnum as Joice Heth *1935: A Tale of Two Cities as The Vengeance (as Lucille LaVerne) *1936: Hearts of Humanity as Minor Role *1936: Ellis Island as Radio (voice, uncredited) *1937: Snow White and the Seven Dwarfs as the Evil Queen / Old Hag (voice, uncredited) (final film role) == Sources == Category:1872 births Category:1986 deaths Category:Actors from Nashville, Tennessee",
 "title": "Lucille La Verne"
}