{
 "id": "104387",
 "text": "A waterspout is a funnel cloud over water. It is a nonsupercell tornado over water. Waterspouts do not suck up water; the water seen in the main funnel cloud is actually water droplets formed by condensation. It is weaker than most of its land counterparts.Glossary of Meteorology. Waterspout. Retrieved on 2006-10-25. == Types == === Non-tornadic === Waterspouts that are not associated with a rotating updraft of a supercell thunderstorm, are known as \"nontornadic\" or \"fair-weather waterspouts\", and are by far the most common type.Gale Schools. Fair weather waterspout. Retrieved on 2006-10-25. Fair- weather waterspouts occur in coastal waters and are associated with dark, flat-bottomed, developing convective cumulus towers. ===Snowspout=== A winter waterspout, also known as a snow devil, an icespout, an ice devil, a snonado, or a snowspout, is a very rare meteorological phenomenon in which a vortex from snow develops that looks like a waterspout. One does not know much about this rare happening and there are only six known pictures of this event so far. There are three main things that produce a winter waterspout: * Very cold temperatures present over a body of warm water enough to produce fog that looks like steam above the water's surface. This usually needs temperatures of -18 °C or colder if the water temperature is no warmer than 5 °C. * Lake- effect snows in a small, enclosed or banded formation must be present and going on. * The wind speed has to be slow, usually less than 5 knots (9.25 km/h). ==Related pages== * Winter waterspout * Funnel cloud * Tornado == References == == Other websites == * British and European Tornado Extremes * A series of pictures from the boat Nicorette getting impressively close to the south coast tornadic waterspout. * USA Today online article on waterspouts * Home video of a waterspout on Long Island Sound on 27 September 2006 * Pictures of cold-core waterspouts over Lake Michigan on 30 September 2006. Archived from the original on March 102007. * http://aoss- research.engin.umich.edu/PlanetaryEnvironmentResearchLaboratory/ Category:Weather",
 "title": "Waterspout"
}