{
 "id": "1043702",
 "text": "A gunboat is a naval watercraft. It is designed for carrying one or more guns to bombard coastal targets, as opposed to those military craft designed for naval warfare, or for ferrying troops or supplies. Gunboats were used since prior to the stream era, they changed with it. They were used in the American Civil War and were also used in e.g. World War I and II, and the Vietnam War. ==History== ===Pre-steam era=== In the age of sail, a gunboat was usually a small undecked vessel carrying a single smoothbore cannon in the bow, or just two or three such cannons. A gunboat could carry one or two masts or be oar- powered only, but the single-masted version of about length was most typical. Some types of gunboats carried two cannons, or else mounted a number of swivel guns on the railings. All navies of the sailing era kept a number of gunboats on hand. ===Steam era=== With the introduction of steam power in the early 19th century, the Royal Navy and other navies built considerable numbers of small vessels propelled by side paddles and later by screws. Initially, these vessels retained full sailing rigs and used steam engines for auxiliary propulsion. Gunboats experienced a revival during the American Civil War (1861–1865). Union and Confederate forces quickly converted existing passenger-carrying boats into armed sidewheel steamers. Later, some purpose- built boats, such as , joined the fray. They frequently mounted 12 or more guns, sometimes of rather large caliber, and usually carried some armor. At the same time, Britain's gunboats from the Crimean War period were starting to wear out, so a new series of classes was ordered. Construction shifted from a purely wooden hull to an iron–teak composite.Preston (2007), pp. 68–69 In the later 19th century and early 20th century, \"gunboat\" was the common name for smaller armed vessels. These could be classified, from the smallest to the largest, into river gunboats, river monitors, coastal-defense gunboats (such as ), and full-fledged monitors for coastal bombardments. In the 1870s and 1880s, Britain took to building so-called \"flat-iron\" (or Rendel) gunboats for coastal defence.Preston (2007), pp. 162–63 When there would be few opportunities to re-coal, vessels carrying a full sailing rig continued in use as gunboats; , a sloop preserved at Chatham Historic Dockyard in the United Kingdom, exemplifies this type of gunboat. In the United States Navy, these boats had the hull classification symbol \"PG\", which led to their being referred to as \"patrol gunboats\". They usually displaced under , were about long, draught and sometimes much less, and mounted several guns of calibers up to . An important characteristic of these was the ability to operate in rivers, enabling them to reach inland targets in a way not otherwise possible before the development of aircraft. In this period the naval powers used gunboats for police actions in colonies or in weaker countries, for example in China (see e.g. Yangtze Patrol). This category of gunboat inspired the term \"gunboat diplomacy\". With the addition of torpedoes, they became \"torpedo gunboats\", designated by the hull classification symbol \"PTG\" (Patrol Torpedo Gunboat). ===Vietnam War=== US riverine gunboats in the Vietnam War, included Patrol Boats River (PBR), constructed of fiberglass; Patrol Craft Fast (PCF), commonly known as Swift Boats, built of aluminum; and Assault Support Patrol Boats (ASPB) built of steel. U.S. Coast Guard 82-foot s supplemented these US Navy vessels. The ASPBs were commonly referred to as \"Alpha\" boats and primarily carried out mine-sweeping duties along the waterways, due to their all-steel construction. The ASPBs were the only US Navy riverine craft specifically designed and built for the Vietnam War.Friedman (1987). All of these boats were assigned to the US Navy's \"Brownwater Navy\". ==Surviving vessels (incomplete)== * (1776) – USS Philadelphia resides at the National Museum of American History in Washington D.C. * (1861) – USS Cairo is on display at the Vicksburg National Military Park in Vicksburg, Mississippi. * (1863) – The remains of the CSS Chattahoochee are currently on display at the National Civil War Naval Museum in Columbus, Georgia. * (1905) – BAP América resides in Iquitos Peru. * (1912) – SS Zhongshan is currently preserved in Wuhan, China. * (1930) – ARP Humaitá (C2), Museum ship as of 1992 located in Asunción, Paraguay. * (1936) – ARM Guanajuato (C-07), located in Boca del Río, Veracruz and is undergoing restoration. == Related pages == * Gunboat diplomacy ==Notes== ==References== * Anderson, Roger Charles, Oared Fighting Ships: From classical times to the coming of steam. London. 1962. * Chapelle, Howard, The History of the American Sailing Navy Norton. 1949. * Friedman, Norman. US Small Combatants: An Illustrated Design History. 1987; Naval Institute Press. . * Glete, Jan, Navies and Nations: Warships, Navies and State Building in Europe and America 1500–1860 (vol 2) Almqvist & Wiksell International, Stockholm. 1993. * Preston, John Antony, Send a Gunboat! The Victorian Navy and Supremacy at Sea, 1854–1904. Conway Maritime, London. 2007. . ==Other websites== * HMS Gannet Category:Ship types Category:Warships",
 "title": "Gunboat"
}