{
 "id": "1044686",
 "text": "Olivia is the self-titled debut studio album by American singer and songwriter Olivia. It was released on May 15, 2001, through J. As Olivia was the first artist signed to the record label, Olivia was referred to as \"the First Lady of J\". Its lyrics revolve around sexuality and romance. Critics noticed two distinct tones on the album, which Olivia identified as \"softer R&B;\" alongside \"harder hip hop\" sounds. Olivia wrote six of the album's twelve tracks where she sings and raps. ==Composition and lyrics== Olivia is a R&B; album consisting of twelve tracks. Critics had different opinions on its influences. According to MTV News' Shaheem Reid, the album features \"R&B; with elements of jazz and hip-hop\". Billboard's Richard B. Henderson referred to the songs as \"a mixture of rap, R&B;, and dance. The Morning Call's Len Righi wrote the compositions were \"sweet instrumental R&B;\" similar to those for Alicia Keys. ==Critical reception== Olivia received a mixed response from critics. A Honey reviewer saw Olivia as a \"real voice\" in hip hop soul, and a CMJ critic saw the album as \"unique and ground-breaking\". A Q magazine reviewer wrote that Olivia was \"well-versed in the not always noble art of the R&B; ballad\" and the music had \"a list of saucy demands that would make Lil' Kim blush\". In a The Source review, a contributor found Olivia to be the \"most memorable when she's in woman-scorned mode\" and compared her to \"a thugged-out Aaliyah and pissed-off Mýa\". ==Track listing== Notes * denotes a co-producer == Personnel == Credits adapted from the liner notes of Olivia, J, BMG Rights Management: Performance credits *Tavia Ivey – vocals (background) *Olivia Longott – primary artist *Tamara Powell – vocals (background) Visuals and imagery *Eric Altenburger – retouching *June Ambrose – stylist *Marc Baptiste – photography *Sheryl Lutz-Brown – design *Ralph Robinson – assistant Instruments *Eddie Allen – horn *Baby Paul – drum programming *Everett Collins – keyboards *Angel Papo Vasquez – horn *Bruce Williams – horn *Warren Wilson – bass, composer, producer, vocal producer Technical and production *Charles \"Prince Charles\" Alexander – engineer, mixing, producer *Louis Alfred III – engineer *Doug Allen – composer, guitar, keyboards *Scott Andrews – arranger, engineer, programming *Rufus Blaq – producer, vocals (background) *Earl Cohen – engineer, mixing *Tom Coyne – mastering *Jimmy Cozier – composer, guest artist, vocal arrangement *Cheri Dennis – composer *Rob Fusari – composer, producer *Pete Karam – engineer *Khadejia Bass – composer *Manny Marroquin – mixing *Tony Maserati – mixing *Harvey Mason Jr. – composer, producer *Victor McCoy – assistant *Bart Migal – assistant *Lamar Mitchell – composer *Francisco G. Palacios – composer *Trina Powell – composer, vocals (background) *Warren Robinson – composer *John Roper – digital transfers *Steve Russell – composer *Damon Thomas – composer, producer *Joshua Thompson – composer *Elai Tubo – engineer, mixing ==Charts== Chart performance for Olivia Chart (2001) Peak position == References == ===Citations=== ===Book sources=== * Category:2001 albums Category:Debut albums Category:Hip hop albums Category:Jazz albums Category:R&B; albums",
 "title": "Olivia (Olivia album)"
}