{
 "id": "1044143",
 "text": "Vedaranyam () (also known as Vedaraniam and Vedaranniyam) is a town in Nagapattinam district in Tamil Nadu, India. The town is named after the deity, or god of the Vedaranyeswarar Temple. The known history of Vedaranyam is from the old Chola period in the 800s. It has also been ruled by the Later Cholas, Later Pandyas, Vijayanagar Empire and the British Empire. While India was fighting for independence, the freedom for India to be ruled by itself, C. Rajagopalachari, who would later become independent India's first Governor- General, started a salt walk in Vedaranyam that was similar to the Dandi March started by Gandhi in 1930 to fight against the sales tax forced on getting salt from the sea.http://www.assembly.tn.gov.in/Const_map/map.htm Vedaranyam is in the Vedaranyam assembly constituency which selects a person to the Tamil Nadu Legislative Assembly once every five years. It is a part of the Nagapattinam (Lok Sabha constituency) which selects its Member of Parliament (MP) once in five years. The town is ruled by the Vedaranyam municipality, which rules an area of . The town had a population of 34,266 people in 2011. Vedaranyam was a part of Thanjavur District up to 1991. The town is a part of the Cauvery delta region which is very good for farming. Most people work to raise prawn and finding salt inside the sea. Roads are the most used way of movement to Vedaranyam. The nearest airport is Tiruchirapalli Airport and it is from the town. On 17 November 2018 Vedaranyam was was badly hurt by cyclone Gaja. == Origin of word == Vetharanyam is named after Vedaranyeswarar, the main deity, or god of the Vedaranyeswarar Temple. It is a Hindu temple that was created for Shiva. The place was also known as \"Tirumaraikadu\", this means that the oldest Hindu writing, or Vedas came from. The Saiva music work Tevaram by Appar and Tirugnanasambandar names the place as \"Tirumaraikadu\". Hindu writing says the Vedas practiced Shiva in this place and gave the name \"Vedaranyam\" to the place. == References == Category:Towns in Tamil Nadu Category:Nagapattinam district",
 "title": "Vedaranyam"
}