{
 "id": "1044257",
 "text": "Sim Racing, short for simulated racing, is a sub-genre of racing video game that seeks to replicate the experience of real-world auto racing within a virtual environment. This immersive form of entertainment has gained a substantial following among motorsport enthusiasts and gaming communities worldwide. == Overview == Sim racing involves the use of specialized racing simulation software and hardware peripherals to create a realistic racing experience. Unlike conventional racing video games, sim racing places a strong emphasis on accuracy, striving to recreate the intricacies of real-world racing, including factors such as: * Physics Simulation: Sim racing games employ advanced physics engines to emulate how vehicles respond to various conditions. This includes factors like acceleration, braking, suspension, and tire dynamics. * Realistic Environments: Simulators recreate iconic racetracks from around the world with meticulous attention to detail, providing players with the opportunity to virtually race on tracks like the Nürburgring or Indianapolis Motor Speedway. * Vehicle Dynamics: Sim racing titles model the behavior of different types of vehicles, from Formula 1 cars to stock cars and off-road vehicles, each with unique handling characteristics. * Weather and Environmental Effects: Some simulators incorporate changing weather conditions and time-of-day effects, further enhancing the realism of the racing experience. == History == === Arcade simulator era (1982–1989) === Before arcade-style and sim racing split, there were early driving simulation games, like Namco's 1982 game Pole Position. Atari promoted it as very realistic Formula 1 racing at the time. === Emergence of sim racing genre (1989–1997) === Sim racing really started to grow in 1989 when Papyrus Design Group made Indianapolis 500: The Simulation. This game, created by David Kaemmer and Omar Khudari on 16-bit computers, is often seen as the first true racing simulation for personal computers. === Graphics accelerator era (1997–2002) === F1 Racing Simulation by Ubisoft was one of the first to use this tech in 1997. Later, Microprose released Grand Prix 3 with a better graphics engine, but it lacked full online multiplayer. Modders liked it because they could use stuff from the older game, GP2. In 1998, Papyrus released Grand Prix Legends, praised for its physics and sound. It became a hit and led to online racing with VROC. Even though it's old, GPL is still important in sim racing. They improved the physics and made expansions for later seasons, like 1969. In 1997, Wired magazine had an article about racing sims called \"Hard Drive.\" === Further developments (2003–present) === == References == * Category:Racing video games Category:Video game genres",
 "title": "Sim racing"
}