{
 "id": "1044750",
 "text": "Africa has a long history of slavery. Slavery proably existed there even before there was writing. Even today, it is one of the regions affected by contemporary slavery. ==Background== The slave trade intensified with the trans-Saharan and trans-Atlantic slave trade and again with the trans-Atlantic slave trade; Because there was a high demand for slaves, this created a number of kingdoms in the Sahel-zone. These kingdoms were at war with each other all the time, as this was the only way to get prisoners of war, which could be turned into slaves to be exported. ===Age of colonialism=== During the age of colonialism in Africa, in the 18th and 19th centuries,as well as the early 20th century, these patterns continued. The colonial authorities tried to stop slavery, starting from about 1900, but they were not very successful. After decolonization, slavery continued in many parts of Africa even though it is technically illegal. ===Sahel region and Horn of Africa=== Slavery in the Sahel region and the Horn of Africa exists along racial and cultural boundaries: There are Arabized Berbers in the north, and darker Africans in the south.\"The mobilization of local ideas about racial difference has been important in generating, and intensifying, civil wars that have occurred since the end of colonial rule in all of the countries that straddle the southern edge of the Sahara Desert. ... contemporary conflicts often hearken back to an older history in which blackness could be equated with slavery and non- blackness with predatory and uncivilized banditry.\" (cover text), Hall, Bruce S., A History of Race in Muslim West Africa, 1600–1960. Cambridge University Press, 2011. In the Sahel states of Mauritania, Mali, Niger, Chad and Sudan there is a concept called hereditary servitude: One family serves another family. This is passed on from the parents to the children. The pattern is centuries old, and slavery can make use of it. Other forms of slavery exist in parts of Ghana, Benin, Togo and Nigeria. Other forms of slavery in Africa involve human trafficking, the recruiting or enslavement of child soldiers and child labourers. Human trafficking occurs in Togo, and children are trafficked from Togo, Benin and Nigeria to Gabon and Cameroon. \"Traditional Slavery in Niger\", Anti-Slavery International, Society's Secretary-General broadcast on the ABC on 9 March 2005 at 9.30 pm. As per the AntiSlavery Society, modern day slavery in Africa means that whole groups of people are exploited, even when this is not called \"slavery\". Forced labor in Sub-Saharan Africa is estimated at 660,000. This includes people involved in the illegal diamond mines of Sierra Leone and Liberia, which is also a direct result of the civil wars in these regions. In 2017, the International Labour Office estimated that 7 in every 1,000 people in Africa are victims of slavery. ==Types== ===Sex slavery=== While institutional slavery has been banned worldwide, there are many reports of female sex slaves in areas without an effective government control, such as Sudan and Liberia,\"Liberia's Taylor appears in court\". BBC News (3 July 2007). Retrieved 2011-03-08. Sierra Leone,\"Sierra Leone: Sexual Violence Widespread in War\". Human Rights Watch. Retrieved 2011-03-08. northern Uganda,\"Uganda: No Amnesty for Atrocities\" . Human Rights Watch.org (4 March 2011). Retrieved 2011-03-08. Congo, NigerAndersson, Hilary. (11 February 2005) \"Born to be a slave in Niger\". BBC News. Retrieved 2011-03-08. and Mauritania.\"Mauritanian MPs pass slavery law\". BBC News (9 August 2007). Retrieved 2011-03-08. In Ghana, Togo, and Benin, a form of (forced) religious prostitution known as trokosi (\"ritual servitude\") forcibly keeps thousands of girls and women in traditional shrines as \"wives of the gods\", where priests perform the sexual function in place of the gods. ===Forced labour=== Forced labor, which can be different from slavery, is defined as any work or services which people are forced to do against their will under the threat of some form of punishment. In the Democratic Republic of the Congo, the indigenous people are usually victims of their Bantu neighbors, who have replaced the positions once held by Arabs and Europeans. ===Child slave trade=== The trading of children has been reported in modern Nigeria and Benin. The children are kidnapped or purchased for $20–70 each by slavers in poorer states, such as Benin and Togo, and sold into slavery in sex dens or as unpaid domestic servants for $350 each in wealthier oil-rich states, such as Nigeria and Gabon. In April 2014, Boko Haram kidnapped 276 female students from Chibok, Borno. More than 50 of them soon escaped, but the others have not been released. Instead, the leader of Boko Haram, Abubakar Shekau, announced his intention of selling them into slavery. ===Ritual slavery=== Ritual servitude (Trokosi) is a practice in Ghana, Togo, and Benin where traditional religious shrines take human beings, usually young virgin girls, in payment for services, or in religious atonement for alleged misdeeds of a family member—almost always a female. In Ghana and in Togo, it is practiced by the Ewe people in the Volta Region, and in Benin, it is practiced by the Fon.FAQ About the Form of Slavery Called Trokosi, ECM Publications, 2002, p. 1 ==Related pages== * Racism * Afrophobia * Oppression * Discrimination * Scientific racism * Human trafficking ==References== Category:Modern-day slavery",
 "title": "Slavery in contemporary Africa"
}