{
 "id": "1044038",
 "text": "Les' Copaque Production Sdn Bhd is an animation company with MSC status based in Shah Alam, Selangor, Malaysia. Les' Copaque not only works in the field of animation but even becomes a full-fledged production organization which also involves idea submission, sound recordings and post-publishing that are included with the animation work. This studio involves a lot of workforce from young talents. ==History== Les' Copaque was founded by Haji Burhanuddin Md Radzi and Hajah Ainon Ariff as publishers. They named their studio for a Malay language network \"last kopek\" which means \"last chance\" and changed the spelling to look like French. Les Copaque's logo is a little frog named Si Polan. This symbol was born from the Malay proverb like a frog under a shell, which means someone with broad insight, ignorance, and a person whose vision is not broad, the breadth is like a shell. The Polan, however he sits on top of the coconut shell, which means the desire to dream big and their ability to think outside the box Their first animated film project entitled Misi Mustahak which was made under the auspices of the two founders as a nomination by their institution, MMU, then won four awards in 2005: Best Work (\"Best of the 10th MVA 2005\") and Gold Medalist Film Short Animation (Open) at the 10th Anugerah Video Malaysia (MVA); Tertiary Student Projects (Creative Multimedia) at MSC- APICTA 2005; and Best of Multimedia University Collection 2005 at Creative Pixels, State Art Gallery. Khidmat Les' Copaque was assigned to create a mobile public order as well as a GT Jepun commercial in 2006.The organization also stepped into making the short fictional animation Geng: the Beginning at the wish of Mohd Anas Abdul Aziz who had won the overall title, best animated film. and best animation maker at the 2006 Short Film Award; In 2007, Les' Copaque introduced Malaysia's famous animated character, Upin & Ipin, to welcome Ramadan and Eid, while working on the film Geng: Pengembaraan Bermula which also featured the twins. The film Gang finally came out on February 12, 2009. It succeeded in earning an income from the cinema of around RM 6.3 million, making it among the Malaysian films that achieved the highest citation in history. Nizam and Safwan who created the characters Upin and Ipin have left Les' Copaque and have opened a new animation company called Animonsta Studios where they are working on a new animation called BoBoiBoy. Even so, Les' Copaque still publishes the animated series Upin & Ipin. ==Filmography== ===Feature films=== *Geng: The Adventure Begins (2009) *Upin & Ipin: The Lone Gibbon Kris (2019) ===TV series=== *Upin & Ipin (2007–present) *Upin & Ipin Iqra *Upin & Ipin: The Helping Heroes *Pada Zaman Dahulu *Puteri *DaDuDiDo *Ingat! ==References== * Category:Selangor Category:Animation studios in Asia",
 "title": "Les' Copaque Production"
}