{
 "id": "1044049",
 "text": "FC Libertas Wien (Latin for freedom) was an Austrian football club from Ottakring, a district of Vienna. From 1932 to 1937 he played for a total of five seasons in the first division. ==History== Libertas was founded in 1914 by some high school students. Among them were Josef Gerö, later ÖFB President, UEFA Vice President and Minister of Justice, and Karl Zankl, later WFV President. The rapid-enthusiastic students chose green and white as the colors of their club. The club played in the lower Viennese leagues for several years. A brief merger in 1922 with the Josefstädter Sportfreunde broke up, until 1928 the club did not get beyond the third class. Nevertheless, the club produced two later internationally very successful players in Josef Horejs and Walter Nausch, who were able to win the Mitropapokal with Sparta Prague and FK Austria Wien. In 1927 the club merged with the second-rate SC International Vienna to form the International Libertas. The club appeared as FC Libertas Vienna from the following season in 1928/29. They reached the 2nd division championship in 1931/32 and were promoted to the 1st division. The first game in Austria's highest division took place in front of 16,000 spectators on 27 August 1932 against Rapid and ended 0-0. Libertas played the first few years against relegation. Since the Libertas sports field was too small for the 1st league, the club first played at Dornbacher Sport-Club-Platz and later at Wacker Wien Schönbrunner Platz. The 1934/35 season was the highlight of the club's history, and the club finished fifth behind Rapid, Vienna, Admira and Wacker. In 1936 the club was able to reach to the semi-finals of the ÖFB Cup. In 1937, due to the reduction of the league to ten clubs, the club was relegated. The outbreak of the Second World War meant that the Libertas merged with the district rivals SC Red Star Vienna in 1941 in order to be able to guarantee further game operations. This ended the history of the only Ottakringer first division club since there was no reactivation after the end of the war. ==Famous players== * Ludwig Brousek * Eduard Frühwirth * Josef Frühwirth * Josef Horejs * Willibald Kirbes * Josef Lebeda * Walter Nausch * Rudolf Schlauf Category:Austrian football clubs Category:Football clubs of Vienna Category:Defunct football clubs",
 "title": "FC Libertas Wien"
}