{
 "id": "1044266",
 "text": "Saluri Rajeswara Rao ( Telugu : Saluru Rajeswara Rao) (11 October 1922 – 25 October 1999) was an Indian composer, conductor, singer, lyricist, actor and musician. He has mostly worked in South Indian movies.M. L. Narasimham, \"Trend-setter in Light Music\". The Hindu, 12 March 1993. Retrieved 2011-03-25. He had made music for over 50 years and was known as a very good composer. == Movies == Year Film Language Director Banner Notes 1935 Sri Krishna Leelalu Telugu Ch. Narasimha Rao Actor 1936 Maya Bazar Telugu P. V. Das Vel Pictures Actor 1939 Jayaprada Telugu Ch. Narasimha Rao Sree Sarada Rayalaseema Films Ltd Actor and Music director 1940 Illalu Telugu Gudavalli Ramabrahmam Indira Devi Films Actor and Music director 1940 Jeevanmukti Telugu T. V. Neelakantan Gemini Studios 1941 Apavadu Telugu Gudavalli Ramabrahmam Kasturi Films 1941 Kamadhenu Tamil Nandalal Jaswantalal The Madras United Artists Corporation with Kalyanaraman 1941 Madana Kama Rajan Tamil B. N. Rao Gemini Studios with M. D. Parthasarathy 1942 Bala Nagamma Telugu C. Pullaiah Gemini Studios with M. D. Parthasarathy 1942 Bhaktha Naradar Tamil S. Soundararajan Tamil Nadu Talkies Background Score 1942 Nandanar Tamil Murugadasa Gemini Studios with M. D. Parthasarathy 1943 Chenchu Lakshmi Telugu S. Saundara Rajan Tamil Nadu Talkies 1943 Dhaasippen Tamil Ellis R. Dungan Devi Films with Lalitha Venkatraman 1943 Mangamma Sabatham Tamil Acharya Gemini Studios with M. D. Parthasarathy 1944 Dasi Aparanji Tamil B. N. Rao Gemini Studios with M. D. Parthasarathy 1944 Bhishma Telugu Ch. Narayana Murthy Bhavani Pictures 1945 Paduka Pattabhishekam Telugu K. B. Nagabhushanam Gemini Studios 1947 Miss Malini Tamil Kothamangalam Subbu Gemini Studios with Parur S. Anantharaman 1948 Chandralekha Hindi S. S. Vasan Gemini Studios with M. D. Parthasarathy 1948 Chandralekha Tamil S. S. Vasan Gemini Studios with M. D. Parthasarathy 1948 Vindya Rani Telugu C. Pullayya Vyjayanthi Pictures with Emani Sankara Sastry 1949 Apoorva Sagodharargal Tamil Acharya Gemini Studios with M. D. Parthasarathy & R. Vaidyanathan 1949 Apoorva Sahodarulu Telugu Acharya Gemini Studios with M. D. Parthasarathy & R. Vaidyanathan 1949 Nishaan Hindi Acharya Gemini Studios with M. D. Parthasarathy & R. Vaidyanathan 1950 Aahuti Telugu R. S. Junnarkar Naveena Films 1951 Malliswari Telugu B. N. Reddy Vauhini Studios 1951 Mantra Dandam Telugu K. S. Ramachandra Rao Sri Gnanambika Pictures Background Score 1952 Priyuralu Telugu Gopichand Bharathalakshmi Productions with Addepalli Rama Rao 1953 Manam Pola Mangalyam Tamil P. Pullayya Narayanan and Company 1953 Pempudu Koduku Telugu L. V. Prasad Prasad Art Pictures 1953 Vayyari Bhama Telugu P. Subba Rao Ajantha Pictures 1953 Vazha Pirandhaval Tamil T. R. Ramanna R. R. Pictures with G. Ramanathan 1954 Raju Peda Telugu B. A. Subba Rao B. A. S. Productions 1954 Vipra Narayana Telugu P. S. Ramakrishna Rao Bharani Studios 1955 Missamma Telugu L. V. Prasad Vijaya Vauhini Studios 1955 Missiamma Tamil L. V. Prasad Vijaya Vauhini Studios 1954 Vipra Narayana Tamil P. S. Ramakrishna Rao Bharani Studios 1956 Balasanyasamma Katha Telugu P. Subbarao 1956 Bhale Ramudu Telugu Vedantam Raghavayya Narasu Studios 1956 Prema Pasam Tamil Vedantam Raghavayya Narasu Studios 1956 Charana Daasi Telugu T. Prakash Rao Lalitha Films 1956 Mathar Kula Manickam Tamil T. Prakash Rao Lalitha Films 1957 Aandi Petra Selvan Tamil B. A. Subba Rao B. A. S. Productions 1957 Alladin Ka Chirag Hindi T. R. Raghunath Jai Sakthi Pictures with S. Hanumantha Rao 1957 Allauddin Adhbhuta Deepam Telugu T. R. Raghunath Jai Sakthi Pictures with S. Hanumantha Rao 1957 Allavudeenum Arputha Vilakkum Tamil T. R. Raghunath Jai Sakthi Pictures with S. Hanumantha Rao 1957 Bhale Ammayilu Telugu Vedantam Raghavayya Narasu Studios 1957 Iru Sagodharigal Tamil Vedantam Raghavayya Narasu Studios 1957 Sathiyavan Savithri Tamil K. B. Nagabhushanam Varalakshmi Pictures with Babu Rao 1958 Aada Pettanam Telugu Adurthi Subba Rao Prabha Productions with Master Venu 1958 Chenchu Lakshmi Tamil B. A. Subba Rao Navayuga Films 1958 Chenchu Lakshmi Telugu B. A. Subba Rao Navayuga Films 1958 Kadan Vaangi Kalyaanam Tamil L. V. Prasad Vijaya Vauhini Studios 1958 Paanai Pidithaval Bhaagyasaali Tamil T. S. Durairaj Marakatha Pictures with S. V. Venkatraman 1959 Appu Chesi Pappu Koodu Telugu L. V. Prasad Vijaya Vauhini Studios 1959 Aval Yaar Tamil K. J. Mahadevan Sudarsanam Pictures 1960 Nammina Bantu Telugu Adurthi Subba Rao Navayuga Films with Master Venu 1960 Pattaliyin Vetri Tamil Adurthi Subba Rao Navayuga Films with Master Venu 1960 Petra Manam Tamil A. Bhimsingh National Pictures 1960 Rani Ratnaprabha Telugu B. A. Subba Rao B. A. S. Productions 1961 Bhakta Jayadeva Telugu P. V. Rama Rao Lalitha Kala Nikethan 1961 Iddaru Mitrulu Telugu Adurthi Subba Rao Annapurna Pictures 1961 Bharya Bharthalu Telugu K. Pratyagatma Prasad Art Pictures 1962 Aradhana Telugu V. Madhusudhana Rao Jagapathi Art Productions 1962 Vikramaadhithan Tamil T. R. Raghunath & N. S. Ramadas Jaya Bharat Productions 1962 Bhishma Telugu B. A. Subba Rao B. A. S. Productions 1962 Kula Gothralu Telugu K. Pratyagatma Prasad Art Pictures 1963 Chaduvukunna Ammayilu Telugu Adurthi Subba Rao Annapurna Pictures 1964 Amara Shilpi Jakkanna Telugu B. S. Ranga Vikram Studios 1964 Amarashilpi Jakanachari Kannada B. S. Ranga Vikram Studios 1964 Bobbili Yuddham Telugu C. Seetaram Republic Productions 1964 Desa Drohulu Telugu Bolla Subba Rao Sri Rama Pictures 1964 Doctor Chakravarti Telugu Adurthi Subba Rao Annapurna Pictures 1964 Mahiravana Telugu B. A. Subba Rao 1964 Manchi Manishi Telugu K. Pratyagatma Chaya Chitra with T. Chalapathi Rao 1964 Pooja Phalam Telugu B. N. Reddy Sri Sambu Pictures 1964 Sirpiyin Selvan Tamil B. S. Ranga Vikram Studios 1965 Aatma Gowravam Telugu K. Viswanath Annapurna Pictures 1965 Dorikithe Dongalu Telugu P. Subrahmanyam Chandamama Films 1966 Aatma Gowravam Telugu K. Viswanath Annapurna Pictures 1966 Bala Nagamma Kannada P. R. Kaundinya Sanathana Kalamandira 1966 Chilaka Gorinka Telugu K. Pratyagatma 1966 Palnati Yudham Telugu Gutha Ramineedu Sri Anurupa Films 1966 Rangula Ratnam Telugu B. N. Reddy with B. Gopalam 1966 Sangeeta Lakshmi Telugu Giduturi Suryam Seetaramanjaneya Pictures 1967 Bhakta Prahlada Tamil Chitrapu Narayana Rao AVM Productions 1967 Bhakta Prahlada Telugu Chitrapu Narayana Rao AVM Productions 1967 Gruhalakshmi Telugu P. S. Ramakrishna Rao Bharani Studios 1967 Pula Rangadu Telugu Adurthi Subba Rao Annapurna Pictures 1967 Vasantha Sena Telugu B. S. Ranga Vikram Studios 1968 Bangaru Panjaram Telugu B. N. Reddy Vijaya Vauhini Studios with B. Gopalam 1968 Veeranjaneya Telugu Kamalakara Kameswara Rao 1969 Aatmiyulu Telugu V. Madhusudhana Rao Saradhi Studios 1969 Aadarsa Kutumbam Telugu K. Pratyagatma Prasad Art Pictures 1969 Bhale Basava Kannada B. S. Ranga Vikram Productions 1970 Chitti Chellelu Telugu M. Krishnan Nair AVM Productions 1970 Desamante Manushuloyi Telugu C. S. Rao 1970 Jai Jawan Telugu D. Yoganand Navayuga Films 1971 Amaayakuraalu Telugu V. Madhusudhana Rao Annapurna Pictures 1971 Pavitra Bandham Telugu V. Madhusudhana Rao Venus Pictures & Ashok Movies 1971 Ramalayam Telugu K. Babu Rao with Ghantasala 1972 Neeti-Nijayiti Telugu Singeetam Srinivasa Rao 1972 Bala Baratham Tamil Kamalakara Kameswara Rao 1972 Bala Bharatha Kannada Kamalakara Kameswara Rao 1972 Bala Bharatam Telugu Kamalakara Kameswara Rao 1972 Bal Mahabharat Hindi Kamalakara Kameswara Rao 1972 Kalam Marindi Telugu K. Viswanath Venus Pictures 1973 Mannina Magalu Kannada B. S. Ranga Vikram Productions 1973 Neramu Siksha Telugu K. Viswanath 1974 Bangaaru Kalalu Telugu Adurthi Subba Rao Annapurna Pictures 1974 Ram Raheem Telugu B. A. Subba Rao Raja Lakshmi Combines 1974 Tatamma Kala Telugu N. T. Rama Rao Ramakrishna Cine Studios 1975 Manushulanta Okkate Telugu Dasari Narayana Rao Aditya Chitra 1975 Yashoda Krishna Telugu C. S. Rao Premier Studios 1976 Dasavatharam Tamil K. S. Gopalakrishnan Karpagam Studios 1976 Manchiki Maro Peru Telugu C. S. Rao Sree Ramakrishna Films 1976 Manushulanta Okkate Telugu Dasari Narayana Rao Aditya Chitra 1977 Kurukshetram Telugu Kamalakara Kameswara Rao Madhavi Padmalaya Combines 1977 Radhakrishna Telugu 1978 Devadasu Malli Puttadu Telugu Dasari Narayana Rao Devi Art Productions 1978 Sneha Sedu Kannada V. Madhusudhana Rao Maheeja Films 1980 Sri Vinayaka Vijayamu Telugu Kamalakara Kameswara Rao Jaganmatha Arts 1980 Ondu Hennu Aaru Kannu Kannada V. Madhusudhana Rao Maheeja Films 1983 Muddula Mogudu Telugu K. S. Prakash Rao Maheeja Films 1984 Adarsavanthudu Telugu Kodi Ramakrishna Maheeja Films 1986 Tandra Paparayudu Telugu Dasari Narayana Rao Annapurna Studios & Padmalaya Studios == Awards and honours == * Andhra University awarded him a Ph.D * Appointed as Asthan Vidhuvan of Tirumala Tirupati Devasthanam * Kalaimamani award from Tamil Nadu Art, Music and Drama Forum * 1992 Raghupathi Venkaiah Award for his work in Telugu film fndustryBiography at IMDB * 1980 Nandi Award for music in Sri Vasavi Kanyaka Parameshwari Mahatmyam.http://ipr.ap.nic.in/New_Links/Film.pdf == References == Category:1999 deaths Category:1922 births Category:Indian composers",
 "title": "S. Rajeswara Rao"
}