{
 "id": "1044245",
 "text": "Marie Jean Antoine Nicolas Caritat, Marquis de Condorcet (1743-1794) was a French philosopher, mathematician, and politician. He was a liberal thinker. Today, people see him as as one of the thinkers of the Age of Enlightenment. In 1790, after the French Revolution, the Declaration of the Rights of Man and of the Citizen was published. The declaration gives certain rights to people. As it says in the declaration, they only applied to men. Condorcet said these rights should also be given to women. He published an essay, Sur l’admission des femmes au droit de cité (On the admission of women on rights of the citizen). In it, he postulated that women should get the right to vote in elections. He also said that black people should have the same rights as white people, that slavery should be abolished and there should be free trade. In 1786, he married Sophie de Grouchy (1764-1822), a translator, who was said to be among the most beautiful women of her time. Because of one of his works, there was an arrest warrant against him, so he had to flee from Paris. He was found in Clamart, and arrested. Two days later, he was found dead in his prison cell. The circumstances of his death are unsolved, he might have poisoned himself, someone might have killed him, or died from Pulmonary edema. == Works == In mathematics, worked on probability theory, philosophy of mathematics, and mathematical analysis. He also worked on the three-body problem. In 1786 he published Essai sur l’application de l’analyse à la probabilité des décisions rendues à la pluralité des voix, which had a great influence on probability theory. Today he is known for the Condorcet method, the Condorcet paradox, and Condorcet's jury theorem. Category:1743 births Category:1794 deaths Category:French mathematicians Category:French philosophers Category:Politicians from Hauts-de-France Category:People from Aisne Category:18th-century French people",
 "title": "Marie Jean Antoine Nicolas Caritat, Marquis de Condorcet"
}