{
 "id": "1044945",
 "text": "The 2022 Women's Africa Cup of Nations (, ), also known as WAFCON 2022. They officially called it the 2022 TotalEnergies Women's Africa Cup of Nations because of sponsorship. It was the 14th time they had this tournament, and it happens every two years. Organized by Confederation of African Football (CAF), and it was held in Morocco from 2nd to 23rd July 2022. This tournament also decided which African teams could go to the 2023 FIFA Women's World Cup. The top four teams got to go to the World Cup, and two more teams had a chance to get in through play-offs with teams from other parts of the world. Before this tournament, Nigeria had won it three times in a row in 2014, 2016, and 2018. But this time, they got knocked out in the semi-finals by Morocco after a penalty shootout. It was the first time that neither Nigeria nor Equatorial Guinea made it to the final match. In the final, Morocco lost to South Africa, and that was the first time South Africa had ever won this tournament. They had tried five times before and never won it. With this win, South Africa became only the second country, after Nigeria, to win both the men's and women's competitions. This was also the first time they had 12 teams in the tournament because the 2020 edition, which should have been the first one with 12 teams, got canceled because of the COVID-19 pandemic in Africa. The semi- final between Morocco and Nigeria had a record number of people watching, with 45,562 spectators. == Qualification == Morocco got into the competition because they were the hosts. The other eleven places were decided by the games that teams played to get in. Team Finals appearance Last appearance Date of qualification Previous best performance Previous World Cup appearances FIFA ranking at start of event (hosts) 3rd 2000 15 January 2021 (1998, 2000) 0 77 2nd 2000 28 January 2022 (2000) 0 156 1st — 21 February 2022 0 169 4th 2018 22 February 2022 (1995) 0 103 2nd 2012 22 February 2022 (2012) 0 89 1st — 23 February 2022 0 118 14th 2018 23 February 2022 (1991, 1995, 1998, 2000, 2002, 2004, 2006, 2010, 2014, 2016, 2018) 8 39 2nd 2008 23 February 2022 (2008) 0 72 1st — 23 February 2022 0 138 1st — 23 February 2022 0 152 13th 2018 23 February 2022 (1991, 2004, 2014, 2016) 2 54 13th 2018 23 February 2022 (1995, 2000, 2008, 2012, 2018) 1 58 == Venues == The competition took place in Casablanca and Rabat. Morocco Rabat Casablanca Prince Moulay Abdellah Stadium Stade Moulay Hassan Stade Mohammed V Capacity: 45,800 Capacity: 12,000 Capacity: 45,891 == Group stage == === Group A === ==== Morocco vs Burkina Faso ==== ==== Senegal vs Uganda ==== ==== Burkina Faso vs Senegal ==== ==== Uganda vs Morocco ==== ==== Morocco vs Senegal ==== ==== Burkina Faso vs Uganda ==== === Group B === ==== Cameroon vs Zambia ==== ==== Tunisia vs Togo ==== ==== Zambia vs Tunisia ==== ==== Togo vs Cameroon ==== ==== Cameroon vs Tunisia ==== ==== Zambia vs Togo ==== === Group C === ==== Nigeria vs South Africa ==== ==== Burundi vs Botswana ==== ==== South Africa vs Burundi ==== ==== Botswana vs Nigeria ==== ==== South Africa vs Botswana ==== ==== Nigeria vs Burundi ==== == Knockout stage == === Bracket === === Quarter-finals === ==== Zambia vs Senegal ==== ==== Morocco vs Botswana ==== ==== Cameroon vs Nigeria ==== ==== South Africa vs Tunisia ==== === Semi-finals === ==== Zambia vs South Africa ==== ==== Morocco vs Nigeria ==== === Third place play-off === === Final === == Goalscorers == == Qualified teams for the 2023 FIFA Women's World Cup == In the 2023 FIFA Women's World Cup, these teams from Africa participated, and two more teams may also get a chance to join them in the playoffs between different football regions. Team Qualified on Previous appearances in FIFA Women's World Cup1 0 (debut) 0 (debut) 8 (1991, 1995, 1999, 2003, 2007, 2011, 2015, 2019) 1 (2019) : 1 Bold indicates champions for that year. Italic indicates hosts for that year. == References == Category:2022 in women's association football",
 "title": "2022 Women's Africa Cup of Nations"
}