{
 "id": "104488",
 "text": "The Life and Times of Scrooge McDuck is a comic book painted and written by Don Rosa. To make it, Rosa needed to see Carl Barks's stories and the more important facts of Scrooge's fictional life. == Chapters == The story has 12 original parts, with more added later, that tell Scrooge's life: Part number Chapter title Pages 1 \"The Last of the Clan McDuck\" 15 The story takes place between 1877 and 1880. As a child, Scrooge comes in conflict with the Whiskervilles, earns his Number One Dime and heads for the United States on a cattle boat. The story takes place between 1877 and 1880. As a child, Scrooge comes in conflict with the Whiskervilles, earns his Number One Dime and heads for the United States on a cattle boat. The story takes place between 1877 and 1880. As a child, Scrooge comes in conflict with the Whiskervilles, earns his Number One Dime and heads for the United States on a cattle boat. The story takes place between 1877 and 1880. As a child, Scrooge comes in conflict with the Whiskervilles, earns his Number One Dime and heads for the United States on a cattle boat. The story takes place between 1877 and 1880. As a child, Scrooge comes in conflict with the Whiskervilles, earns his Number One Dime and heads for the United States on a cattle boat. 2 \"The Master of the Mississippi\" 28 The story takes place between 1880 and 1882. Scrooge works for his Uncle Angus \"Pothole\" McDuck and has his first encounter with Blackheart Beagle and his sons, the Beagle Boys. The story takes place between 1880 and 1882. Scrooge works for his Uncle Angus \"Pothole\" McDuck and has his first encounter with Blackheart Beagle and his sons, the Beagle Boys. The story takes place between 1880 and 1882. Scrooge works for his Uncle Angus \"Pothole\" McDuck and has his first encounter with Blackheart Beagle and his sons, the Beagle Boys. The story takes place between 1880 and 1882. Scrooge works for his Uncle Angus \"Pothole\" McDuck and has his first encounter with Blackheart Beagle and his sons, the Beagle Boys. The story takes place between 1880 and 1882. Scrooge works for his Uncle Angus \"Pothole\" McDuck and has his first encounter with Blackheart Beagle and his sons, the Beagle Boys. 3 \"The Buckaroo of the Badlands\" 15 The story takes place between 1882 and 1883. Scrooge becomes a cowboy and winds up having to recover a prize bull for his boss Murdo MacKenzie, and meets future President Theodore Roosevelt while doing so. Scrooge suggests that Roosevelt take up politics. The story takes place between 1882 and 1883. Scrooge becomes a cowboy and winds up having to recover a prize bull for his boss Murdo MacKenzie, and meets future President Theodore Roosevelt while doing so. Scrooge suggests that Roosevelt take up politics. The story takes place between 1882 and 1883. Scrooge becomes a cowboy and winds up having to recover a prize bull for his boss Murdo MacKenzie, and meets future President Theodore Roosevelt while doing so. Scrooge suggests that Roosevelt take up politics. The story takes place between 1882 and 1883. Scrooge becomes a cowboy and winds up having to recover a prize bull for his boss Murdo MacKenzie, and meets future President Theodore Roosevelt while doing so. Scrooge suggests that Roosevelt take up politics. The story takes place between 1882 and 1883. Scrooge becomes a cowboy and winds up having to recover a prize bull for his boss Murdo MacKenzie, and meets future President Theodore Roosevelt while doing so. Scrooge suggests that Roosevelt take up politics. 4 \"Raider of the Copper Hill\" 15 The story takes place between 1883 and 1885. Scrooge takes some prospecting lessons from Howard Rockerduck and almost takes over the Anaconda Copper Mine of Butte, Montana, from Marcus Daly. The story takes place between 1883 and 1885. Scrooge takes some prospecting lessons from Howard Rockerduck and almost takes over the Anaconda Copper Mine of Butte, Montana, from Marcus Daly. The story takes place between 1883 and 1885. Scrooge takes some prospecting lessons from Howard Rockerduck and almost takes over the Anaconda Copper Mine of Butte, Montana, from Marcus Daly. The story takes place between 1883 and 1885. Scrooge takes some prospecting lessons from Howard Rockerduck and almost takes over the Anaconda Copper Mine of Butte, Montana, from Marcus Daly. The story takes place between 1883 and 1885. Scrooge takes some prospecting lessons from Howard Rockerduck and almost takes over the Anaconda Copper Mine of Butte, Montana, from Marcus Daly. 5 \"The New Laird of Castle Mcduck\" 15 The story takes place in 1885. Scrooge returns to Scotland to save Castle McDuck from being bought by the Whiskervilles. The story takes place in 1885. Scrooge returns to Scotland to save Castle McDuck from being bought by the Whiskervilles. The story takes place in 1885. Scrooge returns to Scotland to save Castle McDuck from being bought by the Whiskervilles. The story takes place in 1885. Scrooge returns to Scotland to save Castle McDuck from being bought by the Whiskervilles. The story takes place in 1885. Scrooge returns to Scotland to save Castle McDuck from being bought by the Whiskervilles. 6 \"The Terror of the Transvaal\" 12 The story takes place between 1886 and 1889. Scrooge goes to the South African Republic where he first encounters Flintheart Glomgold. The story takes place between 1886 and 1889. Scrooge goes to the South African Republic where he first encounters Flintheart Glomgold. The story takes place between 1886 and 1889. Scrooge goes to the South African Republic where he first encounters Flintheart Glomgold. The story takes place between 1886 and 1889. Scrooge goes to the South African Republic where he first encounters Flintheart Glomgold. The story takes place between 1886 and 1889. Scrooge goes to the South African Republic where he first encounters Flintheart Glomgold. 7 \"Dreamtime Duck of the Never Never\" 15 The story takes place between 1893 and 1896. Scrooge goes to Australia and learns about the Dreamtime. The story takes place between 1893 and 1896. Scrooge goes to Australia and learns about the Dreamtime. The story takes place between 1893 and 1896. Scrooge goes to Australia and learns about the Dreamtime. The story takes place between 1893 and 1896. Scrooge goes to Australia and learns about the Dreamtime. The story takes place between 1893 and 1896. Scrooge goes to Australia and learns about the Dreamtime. 8 \"King of the Klondike\" 24 The story takes place between 1896 and 1897. Scrooge finally goes to the Yukon, participating in the Klondike Gold Rush, and strikes some gold, but not before being kidnapped by crooked profiteer Soapy Slick. The story takes place between 1896 and 1897. Scrooge finally goes to the Yukon, participating in the Klondike Gold Rush, and strikes some gold, but not before being kidnapped by crooked profiteer Soapy Slick. The story takes place between 1896 and 1897. Scrooge finally goes to the Yukon, participating in the Klondike Gold Rush, and strikes some gold, but not before being kidnapped by crooked profiteer Soapy Slick. The story takes place between 1896 and 1897. Scrooge finally goes to the Yukon, participating in the Klondike Gold Rush, and strikes some gold, but not before being kidnapped by crooked profiteer Soapy Slick. The story takes place between 1896 and 1897. Scrooge finally goes to the Yukon, participating in the Klondike Gold Rush, and strikes some gold, but not before being kidnapped by crooked profiteer Soapy Slick. 9 \"The Billionaire of Dismal Downs\" 15 The story takes place between 1898 and 1902. After becoming a billionaire, Scrooge goes back to Scotland only to realize that he does not really belong there anymore. The story takes place between 1898 and 1902. After becoming a billionaire, Scrooge goes back to Scotland only to realize that he does not really belong there anymore. The story takes place between 1898 and 1902. After becoming a billionaire, Scrooge goes back to Scotland only to realize that he does not really belong there anymore. The story takes place between 1898 and 1902. After becoming a billionaire, Scrooge goes back to Scotland only to realize that he does not really belong there anymore. The story takes place between 1898 and 1902. After becoming a billionaire, Scrooge goes back to Scotland only to realize that he does not really belong there anymore. 10 \"The Invader of Fort Duckburg\" 15 The story takes place in 1902. Scrooge and his sisters move to Duckburg, Calisota, US and meet the Duck family and the founding three members of The Junior Woodchucks. Scrooge has his first run in with The Beagle Boys since his riverboat days and is reacquainted with President Theodore Roosevelt. The story takes place in 1902. Scrooge and his sisters move to Duckburg, Calisota, US and meet the Duck family and the founding three members of The Junior Woodchucks. Scrooge has his first run in with The Beagle Boys since his riverboat days and is reacquainted with President Theodore Roosevelt. The story takes place in 1902. Scrooge and his sisters move to Duckburg, Calisota, US and meet the Duck family and the founding three members of The Junior Woodchucks. Scrooge has his first run in with The Beagle Boys since his riverboat days and is reacquainted with President Theodore Roosevelt. The story takes place in 1902. Scrooge and his sisters move to Duckburg, Calisota, US and meet the Duck family and the founding three members of The Junior Woodchucks. Scrooge has his first run in with The Beagle Boys since his riverboat days and is reacquainted with President Theodore Roosevelt. The story takes place in 1902. Scrooge and his sisters move to Duckburg, Calisota, US and meet the Duck family and the founding three members of The Junior Woodchucks. Scrooge has his first run in with The Beagle Boys since his riverboat days and is reacquainted with President Theodore Roosevelt. 11 \"The Empire-Builder from Calisota\" 24 The story takes place between 1902 and 1930. Scrooge goes around the world making all kinds of business deals, notably including forcing the Voodoo tribe of sorcerer Foola Zoola off their land. In revenge, the sorcerer curses him to be constantly haunted by Bombie the Zombie. He returns to Duckburg and first meets his ten-year-old nephew Donald Duck, along with his twin sister Della Thelma Duck. On the same day, he loses contact with his family and becomes the richest duck in the world. The story takes place between 1902 and 1930. Scrooge goes around the world making all kinds of business deals, notably including forcing the Voodoo tribe of sorcerer Foola Zoola off their land. In revenge, the sorcerer curses him to be constantly haunted by Bombie the Zombie. He returns to Duckburg and first meets his ten- year-old nephew Donald Duck, along with his twin sister Della Thelma Duck. On the same day, he loses contact with his family and becomes the richest duck in the world. The story takes place between 1902 and 1930. Scrooge goes around the world making all kinds of business deals, notably including forcing the Voodoo tribe of sorcerer Foola Zoola off their land. In revenge, the sorcerer curses him to be constantly haunted by Bombie the Zombie. He returns to Duckburg and first meets his ten-year-old nephew Donald Duck, along with his twin sister Della Thelma Duck. On the same day, he loses contact with his family and becomes the richest duck in the world. The story takes place between 1902 and 1930. Scrooge goes around the world making all kinds of business deals, notably including forcing the Voodoo tribe of sorcerer Foola Zoola off their land. In revenge, the sorcerer curses him to be constantly haunted by Bombie the Zombie. He returns to Duckburg and first meets his ten- year-old nephew Donald Duck, along with his twin sister Della Thelma Duck. On the same day, he loses contact with his family and becomes the richest duck in the world. The story takes place between 1902 and 1930. Scrooge goes around the world making all kinds of business deals, notably including forcing the Voodoo tribe of sorcerer Foola Zoola off their land. In revenge, the sorcerer curses him to be constantly haunted by Bombie the Zombie. He returns to Duckburg and first meets his ten-year-old nephew Donald Duck, along with his twin sister Della Thelma Duck. On the same day, he loses contact with his family and becomes the richest duck in the world. 12 \"The Richest Duck in the World'\" 16 The story takes place in 1947. After 17 years of having lost contact with his family, Scrooge invites Donald and Huey, Dewey and Louie to Christmas dinner. He introduces them to his old money bin, and the new generation of Beagle Boys also introduce themselves. The story takes place in 1947. After 17 years of having lost contact with his family, Scrooge invites Donald and Huey, Dewey and Louie to Christmas dinner. He introduces them to his old money bin, and the new generation of Beagle Boys also introduce themselves. The story takes place in 1947. After 17 years of having lost contact with his family, Scrooge invites Donald and Huey, Dewey and Louie to Christmas dinner. He introduces them to his old money bin, and the new generation of Beagle Boys also introduce themselves. The story takes place in 1947. After 17 years of having lost contact with his family, Scrooge invites Donald and Huey, Dewey and Louie to Christmas dinner. He introduces them to his old money bin, and the new generation of Beagle Boys also introduce themselves. The story takes place in 1947. After 17 years of having lost contact with his family, Scrooge invites Donald and Huey, Dewey and Louie to Christmas dinner. He introduces them to his old money bin, and the new generation of Beagle Boys also introduce themselves. Category:American comic books Category:The Walt Disney Company",
 "title": "The Life and Times of Scrooge McDuck"
}