{
 "id": "1044132",
 "text": "The 2023–24 Premier League is the 32nd season of the Premier League and the 125th season of top-level English football. The league announced the matches on 15th June 2023 at 09:00 BST. Manchester City has won the championship three times in a row and could be the first men's team to win four times in a row in English football history. The summer transfer window opened on 14th June 2023 and closed at 23:00 BST on 1st September 2023. The winter transfer window will open on 1st January 2024 and close at 23:00 GMT on 1st February 2024. The league will have a winter break between 14th and 30th January 2024, during which no Premier League games will be played. == Summary == For only the third time in Premier League history, a team had points taken away. On 17 November 2023, Everton lost 10 points for breaking the league's money rules. This was the biggest points deduction ever in Premier League history. After an appeal, the points loss was reduced to six on 26 February 2024. Then, on 8 April, Everton lost another two points for breaking more rules, making a total of eight points lost for the season. On 30 September 2023, during a game between Tottenham and Liverpool, the video assistant referee (VAR) made a mistake and disallowed a goal that should have counted. Liverpool lost the game 2–1. It was later revealed that the referees had just returned from a long trip to the UAE the day before, which raised questions about whether they should have been allowed to take other jobs in the UAE. On 5 December 2023, Sheffield United became the first team to fire their manager this season after a 5–0 loss to Burnley. Paul Heckingbottom was replaced by Chris Wilder. At that time, Sheffield United were at the bottom of the league with only five points from 14 games. On 16 December 2023, the game between Bournemouth and Luton Town was stopped after 65 minutes when Luton's captain, Tom Lockyer, collapsed on the pitch. He had a heart problem and was taken to the hospital but later recovered. The game was replayed on 13 March 2024, and Bournemouth made an amazing comeback to win 4–3 after being 3–0 down at halftime. On 19 December 2023, Nottingham Forest fired their manager, Steve Cooper, after winning just one of 13 games. He was replaced by Nuno Espírito Santo. In his second game, Nuno led Forest to a 3–1 win against Newcastle, ending their winless streak. On 26 January 2024, Liverpool's manager Jürgen Klopp announced he would leave at the end of the season after more than eight years with the team. On 19 February 2024, Crystal Palace's manager Roy Hodgson resigned. Palace had lost ten of their last 16 games and were close to the relegation zone. Hodgson was replaced by Oliver Glasner. On 18 March 2024, Nottingham Forest lost four points for breaking the league's money rules. Their appeal was rejected on 7 May. On 27 April 2024, Sheffield United was the first team relegated to the Championship after losing 5–1 to Newcastle. They were 10 points away from safety with only three games left. On 4 May, they became the first team to let in 100 goals in a 38-game season. By the end of the season, they had let in 104 goals, the most in the top league since Ipswich Town let in 121 goals in 1963–64. On 6 May 2024, West Ham United said their manager, David Moyes, would leave at the end of the season when his contract ended. On 11 May 2024, Burnley became the second team relegated after losing 2–1 to Tottenham. They were five points from safety with one game left. On the same day, Luton Town lost 3–1 to West Ham, which left them needing a miracle to stay up. Their relegation was confirmed on the last day as they lost 4–2 to Fulham, and Nottingham Forest won 2–1 against Burnley. On 18 May 2024, Brighton & Hove Albion announced they had agreed with their manager Roberto De Zerbi to end his contract after the last game of the season.https://x.com/premierleague/status/1791733072385241592 On 19 May 2024, the final day of the season, Manchester City beat West Ham 3–1 to win the title with 91 points. Arsenal finished second with 89 points. This season, Aston Villa did very well under their manager Unai Emery, securing a spot in the Champions League for the first time since 1983. Meanwhile, Manchester United had their worst Premier League season ever, finishing eighth with 14 losses. However, they still won the FA Cup, beating Manchester City, which got them a place in the Europa League next season. Chelsea, who finished 12th last season, improved to sixth under their new manager Mauricio Pochettino, earning a spot in the Conference League playoff round. Newcastle United finished seventh but missed out on European football because Manchester United won the FA Cup. If Manchester City had won the FA Cup, Chelsea would have moved to the Europa League, Newcastle to the Conference League, and Manchester United would have missed out on European football. ==League table== ==Results== ==Season statistics== ===Top scorers=== Rank Player Club Goals 1 Erling Haaland Manchester City 27 2 Cole Palmer Manchester City Chelsea 22 3 Alexander Isak Newcastle United 21 4 Phil Foden Manchester City 19 Dominic Solanke Bournemouth Ollie Watkins Aston Villa 7 Mohamed Salah Liverpool 18 8 Son Heung-min Tottenham Hotspur 17 9 Jarrod Bowen West Ham United 16 Jean-Philippe Mateta Crystal Palace Bukayo Saka Arsenal ====Hat- tricks==== Player For Against Result Date Son Heung-min Tottenham Hotspur Burnley 5–2 (A) 2 September 2023 Erling Haaland Manchester City Fulham 5–1 (H) Evan Ferguson Brighton & Hove Albion Newcastle United 3–1 (H) Ollie Watkins Aston Villa Brighton & Hove Albion 6–1 (H) 30 September 2023 Eddie Nketiah Arsenal Sheffield United 5–0 (H) 28 October 2023 Nicolas Jackson Chelsea Tottenham Hotspur 4–1 (A) 6 November 2023 Dominic Solanke Bournemouth Nottingham Forest 3–2 (A) 23 December 2023 Chris Wood Nottingham Forest Newcastle United 3–1 (A) 26 December 2023 Elijah Adebayo Luton Town Brighton & Hove Albion 4–0 (H) 30 January 2024 Matheus Cunha Wolverhampton Wanderers Chelsea 4–2 (A) 4 February 2024 Phil Foden Manchester City Brentford 3–1 (A) 5 February 2024 Jarrod Bowen West Ham United 4–2 (H) 26 February 2024 Phil Foden Manchester City Aston Villa 4–1 (H) 3 April 2024 Cole Palmer Chelsea Manchester United 4–3 (H) 4 April 2024 Cole Palmer4 Everton 6–0 (H) 15 April 2024 Erling Haaland4 Manchester City Wolverhampton Wanderers 5–1 (H) 4 May 2024 Jean-Philippe Mateta Crystal Palace Aston Villa 5–0 (H) 19 May 2024 :Note: 4 – player scored 4 goals ===Clean sheets=== Rank Player Club Clean sheets 1 David Raya Arsenal 16 2 Jordan Pickford Everton 13 3 Bernd Leno Fulham 10 Ederson Manchester City 5 André Onana Manchester United 9 6 Alisson Liverpool 8 Emiliano Martínez Aston Villa 8 Mark Flekken Brentford 7 Neto Bournemouth Guglielmo Vicario Tottenham Hotspur ===Discipline=== ====Player==== * Most yellow cards: 13 ** João Palhinha (Fulham) ** Marcos Senesi (Bournemouth) * Most red cards: 2 ** Yves Bissouma (Tottenham Hotspur) ** Reece James (Chelsea) ** Oli McBurnie (Sheffield United) ====Club==== * Most yellow cards: 105 **Chelsea * Fewest yellow cards: 52 **Manchester City * Most red cards: 7 **Burnley * Fewest red cards: 0 **Luton Town == References == Category:Premier League seasons Category:2023–24 in European football Category:2023 in England Category:2024 in the United Kingdom",
 "title": "2023–24 Premier League"
}