{
 "id": "1044466",
 "text": "Miss Meyers (1949 – March 1963) was an American Quarter Horse racehorse and broodmare, the 1953 World Champion Quarter Running Horse. She won $28,725 and also 17 races, the money would be worth around $337,000 today. When she was a broodmare, she was the mother of the first American Quarter Horse Association (AQHA) Supreme Champion, who was called Kid Meyers. She also was the mother of three other foals, and was put into the AQHA Hall of Fame in 2009. == Early life == Miss Meyers was a chestnut-colored mare born in 1949, fathered by Leo, a member of the AQHA Hall of Fame. Miss Meyers' mother was Star's Lou. Star's Lou's father was Oklahoma Star P-6, another AQHA Hall of Fame member.Mattson Real American Quarter Horse pp. 2–3 She was bred by O. C. Meyer, and by Bruce A. Green.AQHA Official Produce of Dam Record for Miss Meyers == Race career == Miss Meyers started racing in 1952 and stopped in 1955, she won seven stakes races, came second in seven others, and came third in two more. She won 17 of her 59 starts on the racetrack. She came second in another 15 races and third in 5. She made $28,727 from the track, which would be $ today because of inflation.AQHA Official Produce of Dam Record for Miss Meyers Some of her wins in stakes races were the 1952 Buttons and Bows Stakes, the 1953 California Championship, the 1953 Billy Anson Stakes, the 1953 Rocky Mountain Quarter Horse Association World Championship Dash, the 1955 Bart B Stakes, the 1955 Barbara B Stakes and the 1955 Traveler Stakes. She set four track records, twice at , once at , and once at . In 1953, she was made the AQHA World Champion Quarter Running Horse, also the High Money Earning Horse; the AQHA also gave her the title of Superior Race Horse in 1954. The highest speed index she got to, a measure of how fast she was able to run, during her racing career was AAAT, which was the highest possible at the time.Nye Speed and the Quarter Horse pp. 227–228 Only in 1953, when she was four-years-old did Miss Meyers, performed well and started winning on the track. That year she won $15,398 which would be $ today and seven of her seventeen career wins.Chamberlain \"Leo\" Quarter Horse Journal pp. 79–80 == Broodmare, death and legacy == After Miss Meyers retired from the racetrack, she became the mother of the first AQHA Supreme Champion, Kid Meyers, whose father was another Hall of Famer Three Bars.Mattson Real American Quarter Horse pp. 2–3 A Supreme Champion is a horse that is very good on the racetrack, as a riding horse at horse shows. Kid Meyers was a 1963 stallion, he had 23 starts on the racetrack and won 6 times. He won $10,655 from the track, which would be $ today.AQHA Official Produce of Dam Record for Miss Meyers After retiring from the racetrack, he earned his AQHA Champion in 1966 and his AQHA Supreme Champion in 1967. His highest speed index was AAA. He was orphaned when he was one month old in March 1963.Groves \"Kid Meyers\" Quarter Horse Journal p. 36 Miss Meyers had three other foals. Oh My Oh, a 1957 bay mare fathered by the Thoroughbred stallion Spotted Bull, started 30 times, won eight races, $12,592 which would be $ today and came in second place in a stakes race. She got an AAAT speed index. When she was a broodmare, she was the dam of Three Oh's, who was an All American Futurity winner .American Quarter Horse Association (AQHA) \"Miss Meyers\" AQHA Hall of Fame Miss Meyers' 1958 foal was Mr. Meyers, a sorrel stallion father by fellow Hall of Famer Go Man Go, who started 41 times, won 9 times and got third in four stakes races. He won $25,656 which would be $ today. He went on to earn an AQHA Champion title along with a Superior Race Horse award, to go with his AAAT speed index. Miss Meyers died in March 1963 after having Kid Meyers. She was put into the AQHA's American Quarter Horse Hall of Fame in 2009. == Pedigree == == Citations == == References == * * American Quarter Horse Association (AQHA) (1996). AQHA Official Produce of Dam Record for Miss Meyers American Quarter Horse Association Records Department. Category:Racehorses",
 "title": "Miss Meyers"
}