{
 "id": "1044719",
 "text": "In the early hours of November 13, 2022, a mass murder took place in Moscow, Idaho, in the United States. Four University of Idaho students were stabbed to death in an off-campus three-story rented home. The authorities identified 28-year-old Pennsylvania-native Bryan Christopher Kohberger as a suspect who was taken into custody in Pennsylvania. The investigation has been marked by a reversal of police statements as to whether the community may be at risk, and a lack of apparent progress in solving the crime. == Background == Five female University of Idaho students lived in a rented off-campus home in the 25,000-person rural college town of Moscow, Idaho, which had previously not seen a murder since 2015. A sixth person was listed on the lease but not home at the time of the murders. The three-story, home had six bedrooms; two on each floor.Mike Baker and Nicholas Bogel-Burroughs (November 19, 2022). \"New Details Emerge in University of Idaho Killings: What We Know; The phone log of one victim showed a series of unanswered calls to her longtime boyfriend the night of the attack in Moscow, Idaho, her sister revealed. The police have not identified a suspect.\" , The New York Times. The three female victims – Madison Mogen, Kaylee Goncalves, and Xana Kernodle – lived at the house, while the fourth victim, Ethan Chapin, was Kernodle's boyfriend who was sleeping over on the night of the attacks. Two other female roommates also lived at the house; they slept through the attacks, and were not injured. == Events == In the early morning hours of Sunday, November 13, 2022, between 3am and 4am, four University of Idaho college students were stabbed to death in a shared rental home close to campus, in which three of them resided.Marisa Iati and Justine McDaniel (November 19, 2022). \"What we know about Idaho students’ killing,\" The Washington Post. Earlier on Saturday evening, two of the four victims, Chapin and Kernodle, were at an on-campus party at the nearby Sigma Chi fraternity from 8pm to 9pm. Both returned home at 1:45am. That same evening, the other two victims, lifelong best friends Mogen and Goncalves, had gone to The Corner Club, a downtown sports bar at Main and 'A' Streets, at 10 pm, from which they departed at 1:30 am. A livestreamed video from Twitch from The Grub Truck, a food truck four blocks south at Friendship Square (Main and Fourth Streets), showed Mogen and Goncalves at 1:41 am, chatting and smiling, getting their food ten minutes later, and leaving to take what the police initially said was an Uber ride home, a trip of about . The police later rephrased their statement to say the ride was provided by a \"private party,\" arriving home at 1:56 am. All four individuals were home by 1:56am. Seven uncompleted phone calls were made from the phone of Goncalves to her former longtime boyfriend, Jack DuCoeur, a fellow student, from 2:26 to 2:52am. Mogen also called the boyfriend three times with similar results from 2:44 to 2:52am. These calls were investigated with the police concluding they do not believe he was involved in the crime. The two surviving roommates had returned home by 1:00am, and were in their beds on the ground floor of the home at the time of the murders. They were not attacked or held hostage, and did not awaken until later that morning. The four victims were stabbed to death on the second and third floors in the home, where they had been sleeping. The victims were not gagged or restrained, and the walls at the scene were splattered with blood. No calls to 911 were made until 11:58 am, many hours after the early morning killings. At that time, a call was made from inside the residence, from the cellphone of one of the surviving students who lived at the residence, asking for aid for an \"unconscious\" person. When police arrived, the door to the home was open, there was no sign of forced entry or damage inside the home, and nothing appeared to be missing. The two surviving roommates were in the residence when the police arrived, as were other friends of the victims, as the surviving roommates had called friends over to the home because they believed one of the second-floor victims was unconscious and was not waking up. The identity of the 911 caller was not released, and the person was not considered a suspect. All four victims were pronounced deceased at 12:00 pm. That night, officers came upon Goncalves's dog, which she shared with Jack DuCoeur, alive and unharmed at the house; it was ultimately handed over to what police said was a 'responsible party'. == Victims == Four college students were killed: Ethan Chapin, 20, of Conway, Washington; Kaylee Goncalves, 21, of Rathdrum, Idaho; Xana Kernodle, 20, of Avondale, Arizona (later Post Falls, Idaho); and Madison \"Maddie\" Mogen, 21, of Coeur d’Alene, Idaho. Chapin was a freshman, Kernodle was a junior, and Goncalves and Mogen were both seniors. All of the victims were also part of the university's Greek life, with Chapin a member of Sigma Chi, Goncalves a member of Alpha Phi, and Kernodle and Mogen members of Pi Beta Phi. == Aftermath == On Sunday night, the university canceled classes for Monday, November 14; it also scheduled a candlelight vigil to be held on the UI administration building lawn on Wednesday evening, then postponed it two weeks. Fall break was scheduled to begin after Friday, November 18, with classes resuming on Monday, November 28. Many students and other Moscow residents, not trusting the initial assurances of the police and fearing for their own safety, began an early Thanksgiving holiday exodus from the area, while others who stayed were anxious and cautious, and a number of professors canceled their classes.\"‘Targeted’ Killings and No Arrest Bring Fear to University of Idaho,\" The New York Times, November 21, 2022. Because of weather concerns, the candlelight vigil was moved indoors to the Kibbie Dome and held on the evening of Wednesday, November 30\\. == Investigation == The investigation of the murders is being conducted by the Moscow police (who had in their force four detectives and 24 patrol officers working on it), supported by the Idaho State Police (20 investigators, 15 troopers, and a Forensics Services and mobile crime scene team), the FBI (22 investigators, 20 assigned agents, and 2 Behavior Analysis Units), and the Latah County Sheriff's Office. In all, almost 130 members of law enforcement from three different agencies began working on the case. A phone tip line and email were created for students and others to submit potential evidence to officials. By December 5, it was reported that there had been more than 2,600 emailed tips, 2,700 phone calls, and 1,000 digital media submissions from the public to these tip lines. The Latah County coroner conducted autopsies on the four victims on November 17. She said they all appeared to have been stabbed multiple times (with fatal wounds in the chest and upper body) with a large knife (if not the same knife, very similar ones). At least one victim (with what were apparently defensive stab wounds on her hands) and possibly more appear to have tried to fend off their attacker, and the victims may have been attacked while sleeping in their beds. None showed signs of sexual assault, and toxicology reports are pending. All four deaths were deemed homicide by stabbing. They were not tied and gagged. No weapon has been recovered, though the police believe the killer or killers used a fixed- blade knife. The police have ruled out: (a) a fellow student wearing a white hoodie seen in the video footage speaking to Mogen and Goncalves by the food truck; (b) the person who drove Mogen and Goncalves home; (c) the two surviving roommates, who were home during the killings; and (d) Goncalves's former long term boyfriend whom she and Mogen had called a total of ten times that night.'Hoodie Guy' Seen With Idaho Victims At Food Truck Was Allegedly Kicked Out Of Fraternity & Has Left The Country The authorities left open the possibility that there could be more than one perpetrator. In a November 23 press conference, the Moscow police chief said that authorities had received a number of tips including that Goncalves allegedly had a stalker, but were unable to verify that claim or identify any such individual at that time. On December 27th, a screengrab was posted on Reddit, showing Gonclaves and Mogen conversing with a patron at a local bar, the Corner Club, at 1:32 am on the night of the killings. Moscow Police reported that they have reviewed the footage but provided no other information. == Suspect == In the early morning hours of December 30th, authorities in Monroe County, Pennsylvania outside Stroudsburg, announced that they had taken a suspect into custody. The person, identified as 28-year-old Bryan Christopher Kohberger of Albrightsville, Pennsylvania (born November 21, 1994), was referred to as a person of interest in the investigation.https://www.nbcnews.com/news/us-news/person-interest- linked-university-idaho-slayings-taken-custody-rcna63728 Kohberger's previous life before the massacre has not been detailed yet, but Kohberger was a former graduate at the Washington State University in Pullman, Washington, and had pursued his Ph.D. in criminal justice and criminology. == Response == The incident has been marked by a reversal of police statements as to whether the community might be at risk, and a perceived lack of apparent progress in solving the crime. From the day of the killings, investigators initially said that there was no risk to the community. Three days later, however, Moscow Police Chief James Fry said: \"We cannot say that there is no threat to the community.\" Due to the slow release of details about the crime to the public, some began to speculate and spread misinformation about the case on social media. Three days after the killings, the father of Ethan Chapin spoke out about the lack of information from the University of Idaho and local police, highlighting the spread of rumors due to the silence from officials. The father of Kaylee Goncalves spoke of the lack of flow of information from police to the families of the victims about 11 days after the attack, saying: \"They’re just so vague with everything that they say and then they like slowly peel it back later until you like find the real story\". == Related pages == * Ted Bundy, killed university sorority house roommates in Florida == References == Category:2022 murders in the United States Category:Mass murder in 2022 Category:Mass murder in the United States Category:Murders by blade weapons",
 "title": "2022 University of Idaho killings"
}