{
 "id": "1044413",
 "text": "The 2022 AFC Women's Asian Cup was the 20th edition of the AFC Women's Asian Cup a competition where national teams from Asia, which are part of the Asian Football Confederation (AFC), play against each other. India was chosen to be the host country in June 2020, and it was the first time they hosted it since 1979. Originally, the tournament was supposed to happen in late October and early November, but they changed the dates to 20 January to 6 February 2022. This time, there were twelve teams in the tournament instead of the usual eight. The reason for this was that it also decided which Asian teams would get to play in the 2023 FIFA Women's World Cup in Australia and New Zealand. Australia was already in the World Cup because they were hosting it. Five teams got to go to the World Cup straight from this tournament, and two more had a chance to play in a special playoff. Japan had won the tournament the last two times, but this time they got knocked out in the semi-finals by China on penalties. China then won the tournament by beating South Korea 3-2 in the final. == How the Host was picked == Three football associations showed that they wanted to host the tournament before the deadline on 31st May 2019. # # # India had already hosted the 1980 AFC Women's Championship, which was initially planned for 1979. Chinese Taipei had hosted the tournament in 1977 and 2001. The AFC Women's Football Committee suggested that India should host the tournament on 19th February 2020. Then, on 5th June 2020, India was officially given the rights to host the tournament. == Group stage == ; Tiebreakers Teams were ranked based on the number of points they earned in matches. They got 3 points for a win, 1 point for a draw, and 0 points for a loss. If two or more teams had the same number of points, the following rules were used to decide who is ranked higher: # First, they looked at the points earned in matches between the tied teams. # If that didn't settle it, they checked the goal difference in matches between the tied teams. # If it was still tied, they counted the total number of goals scored in matches between the tied teams. # If there were more than two tied teams, they repeated these three steps only for those teams. # If it was still tied, they considered the goal difference in all the matches played in the group. # After that, they looked at the total number of goals scored in all the matches in the group. # If only two teams were tied and they played against each other in the last round of the group, they might have a penalty shootout. # If everything else failed to break the tie, they looked at the number of disciplinary points each team had. A yellow card counted as 1 point, a red card resulting from two yellow cards counted as 3 points, and a direct red card counted as 3 points. If a player got a yellow card and then a direct red card, it counted as 4 points. # Finally, if none of the above resolved the tie, they resorted to drawing lots to decide the rankings. All the times mentioned are in the local time zone, which is IST (UTC+5:30). === Group A === ==== China PR vs Chinese Taipei ==== ==== India vs Iran ==== ==== Iran vs China PR ==== ==== Chinese Taipei vs India ==== ==== India vs China PR ==== ==== Chinese Taipei vs Iran ==== === Group B === ==== Australia vs Indonesia ==== ==== Thailand vs Philippines ==== ==== Philippines vs Australia ==== ==== Indonesia vs Thailand ==== ==== Australia vs Thailand ==== ==== Philippines vs Indonesia ==== === Group C === ==== Japan vs Myanmar ==== ==== South Korea vs Vietnam ==== ==== Myanmar vs South Korea ==== ==== Vietnam vs Japan ==== ==== Japan vs South Korea ==== ==== Vietnam vs Myanmar ==== === Ranking of third-placed teams === The top two teams qualified for the quarter finals. Due to the withdrawal of India in group A, results against the fourth-placed teams of each group B and C were not counted in determining the ranking of the third-placed teams. == Knockout stage == === Bracket === == Quarter-finals == === China PR vs Vietnam === === Australia vs South Korea === === Japan vs Thailand === === Chinese Taipei vs Philippines === == Semi-finals == === China PR vs Japan === === South Korea vs Philippines === == Final == == Related pages == * Women's soccer ==References== Category:2022 AFC Women's Asian Cup Category:AFC Women's Asian Cup tournaments",
 "title": "2022 AFC Women's Asian Cup"
}