{
 "id": "1045847",
 "text": "The 2022–23 UEFA Europa League was the 52nd season of Europe's second-tier club football competition organized by UEFA. It's the 14th season since it was changed from the UEFA Cup to the UEFA Europa League. In the final match, Sevilla beat Roma at the Puskás Aréna in Budapest, Hungary. They won 4–1 in a penalty shootout after the game ended 1–1 even after extra time. This victory marked their seventh win in this competition, which is more than any other team. Originally, Budapest was supposed to host the final for the 2021–22 UEFA Europa League, but plans changed due to the COVID-19 pandemic, which caused delays and relocations. Because they won the tournament, Sevilla automatically got a spot in the 2023–24 UEFA Champions League group stage. They also earned the right to play against the winners of the 2022–23 UEFA Champions League, Manchester City, in the 2023 UEFA Super Cup. As the previous champions, Eintracht Frankfurt qualified for the 2022–23 UEFA Champions League, but they couldn't keep their title because they were eliminated in the knockout stage. == When matches will take place == The plan for the 2022–23 UEFA Europa League games. Phase Round Draw date First leg Second leg Qualifying Third qualifying round 18 July 2022 4 August 2022 11 August 2022 Play-offs Play-off round 2 August 2022 18 August 2022 25 August 2022 Group stage Matchday 1 26 August 2022 8 September 2022 Matchday 2 15 September 2022 Matchday 3 6 October 2022 Matchday 4 13 October 2022 Matchday 5 27 October 2022 Matchday 6 3 November 2022 Knockout phase Knockout round play-offs 7 November 2022 16 February 2023 23 February 2023 Round of 16 24 February 2023 9 March 2023 16 March 2023 Quarter-finals 17 March 2023 13 April 2023 20 April 2023 Semi-finals 11 May 2023 18 May 2023 Final 31 May 2023 at Puskás Aréna, Budapest == Group stage == === Group A === === Group B === === Group C === === Group D === === Group E === === Group F === === Group G === === Group H === == Statistics == Statistics exclude qualifying round and play-off round. === Top goalscorers === Rank Player Team Goals Minutes played 1 Marcus Rashford Manchester United 6 560 Victor Boniface Union Saint-Gilloise 777 3 Santiago Giménez Feyenoord 5 432 Paulo Dybala Roma 668 5 Vitinha Braga 4 406 Wissam Ben Yedder Monaco 528 Ángel Di María Juventus 554 Youssef En-Nesyri Sevilla 720 Robin Knoche Union Berlin 892 Lorenzo Pellegrini Roma 1167 === Top assists === Rank Player Team Assists Minutes played 1 Evander Midtjylland 5 514 2 Tasos Bakasetas Trabzonspor 4 463 Loïc Lapoussin Union Saint-Gilloise 740 Bruno Fernandes Manchester United 866 Tammy Abraham Roma 868 Lorenzo Pellegrini Roma 1167 7 Diego Rossi Fenerbahçe 3 278 Cody Gakpo PSV Eindhoven 370 Oussama Idrissi Feyenoord 404 Simon Adingra Union Saint-Gilloise 410 Amine Gouiri Rennes 453 Juan Miranda Real Betis 540 Ludovic Blas Nantes 675 Sebastian Szymański Feyenoord 680 Jesús Navas Sevilla 690 Teddy Teuma Union Saint-Gilloise 776 === Team of the season === The UEFA technical study group selected the following players as the team of the tournament. Player Team Yassine Bounou Sevilla Marcos Acuña Sevilla Chris Smalling Roma Jonathan Tah Bayer Leverkusen Jesús Navas Sevilla Lorenzo Pellegrini Roma Nemanja Matić Roma Ivan Rakitić Sevilla Marcus Rashford Manchester United Victor Boniface Union Saint-Gilloise Paulo Dybala Roma === Player of the Season === * Jesús Navas ( Sevilla) === Young Player of the Season === * Florian Wirtz ( Bayer Leverkusen) ==References== 2022-23",
 "title": "2022–23 UEFA Europa League"
}