{
 "id": "1045781",
 "text": "An at-large constituency is a single constituency that represents an entire region, generally one with a lower population relative to other regions. ==By country== ===Australia=== Australia no longer uses at-large electorates (called divisions) to elect the House of Representatives. Under the Constitution, each state has to have at least five seats in the House of Representatives and 12 seats in the Senate. However, this does not include the territories, which currently have two Senate seats each and between two and three House seats each (the Australian Capital Territory (ACT) has three while the Northern Territory has two). At certain points in time, the two territories had one at-large division each. From 1949 until 1974, the ACT was represented by one division: the Division of Australian Capital Territory. It was then split into two divisions: Canberra and Fraser (named after Jim Fraser). A third division, Namadgi, was created in 1996 but abolished in 1998. In 2016, Fraser was abolished and a new Melbourne-based seat called Fraser was created in honour of Malcolm Fraser. The old seat of Fraser was replaced by Fenner. A third division was created again in 2019, this time named Bean. Currently, there are three divisions: Bean (which includes most of the ACT's land area, including the southern suburbs of Canberra and some smaller towns, as well as the overseas territory of Norfolk Island), Canberra (which includes the inner and eastern suburbs of Canberra) and Fenner (which includes the northern and western suburbs of Canberra, as well as the Jervis Bay Territory). From 1922 until 2001, the Northern Territory was represented by only one division: the Division of Northern Territory. In 2001, it was split into two divisions: Lingiari (covering the majority of the Northern Territory's land area, as well as the overseas territories of Christmas Island and the Cocos (Keeling) Islands) and Solomon (covering the majority of the Northern Territory's population, including its two largest cities: Darwin and Palmerston). ===Canada=== The Canadian House of Commons electoral districts of Northwest Territories, Nunavut and Yukon are considered at-large because they represent the entire territories of the same name, respectively. ===European Parliament=== Most European Parliament constituencies represent an entire country and are therefore at-large. ===Philippines=== Several congressional districts of the House of Representatives of the Philippines are at-large. ===United States=== Of the 435 voting members of the United States House of Representatives, there are currently six that are elected from at-large congressional districts, as well as all six non-voting delegates. ====States that are currently represented at-large==== * Alaska * Delaware * North Dakota * South Dakota * Vermont * Wyoming ====States that were formerly represented at-large==== * Alabama * Arizona * Arkansas * California * Colorado * Connecticut * Florida * Georgia * Hawaii * Idaho * Illinois * Indiana * Iowa * Kansas * Kentucky * Louisiana * Maine * Maryland * Massachusetts * Michigan * Minnesota * Mississippi * Missouri * Montana * Nebraska * Nevada * New Hampshire * New Jersey * New Mexico * New York * North Carolina * Ohio * Oklahoma * Oregon * Pennsylvania * Rhode Island * South Carolina * Tennessee * Texas * Utah * Virginia * Washington * West Virginia ====Current non-voting delegates==== * American Samoa * American Virgin Islands * District of Columbia * Guam * Northern Mariana Islands * Puerto Rico ====Former non-voting delegates==== * Alabama Territory * Alaska Territory * Arizona Territory * Colorado Territory * Dakota Territory * Florida Territory * Hawaii Territory * Idaho Territory * Illinois Territory * Indiana Territory * Iowa Territory * Kansas Territory * Mississippi Territory * Missouri Territory * Montana Territory * Nevada Territory * New Mexico Territory * Northwest Territory * Oklahoma Territory * Oregon Territory * Orleans Territory * Philippines * Southwest Territory * Utah Territory * Washington Territory * Wisconsin Territory * Wyoming Territory ==References== Category:Constituencies",
 "title": "At-large"
}