{
 "id": "1045913",
 "text": "The 2022–23 UEFA Europa League knockout stage started on 16th February with the knockout round playoffs and finished on 31st May 2023 with the final match at the Puskás Aréna in Budapest, Hungary, to determine the winners of the 2022–23 UEFA Europa League. In this stage, 24 teams competed. The times mentioned are in Central European Time (CET) or Central European Summer Time (CEST) if applicable. If there were any local time differences, they are shown in brackets. == Qualified teams == The knockout phase involved 24 teams: the 16 teams which qualified as winners and runners-up of each of the eight groups in the group stage, and the eight third-placed teams from the Champions League group stage. === Europa League group stage winners and runners-up === Group Winners (advance to round of 16 and seeded in draw) Runners-up (advance to play-offs and seeded in draw) A Arsenal PSV Eindhoven B Fenerbahçe Rennes C Real Betis Roma D Union Saint-Gilloise Union Berlin E Real Sociedad Manchester United F Feyenoord Midtjylland G SC Freiburg Nantes H Ferencváros Monaco === Champions League group stage third-placed teams === Group Third-placed teams (advance to play-offs and unseeded in draw) A Ajax B Bayer Leverkusen C Barcelona D Sporting CP E Red Bull Salzburg F Shakhtar Donetsk G Sevilla H Juventus == Bracket == == Knockout round play-offs == The draw for the knockout round play-offs was held on 7 November 2022, 13:00 CET. === Summary === The first legs were played on 16 February, and the second legs were played on 23 February 2023. |} === Matches === Manchester United won 4–3 on aggregate. \\---- Juventus won 4–1 on aggregate. \\---- Sporting CP won 5–1 on aggregate. \\---- 3–3 on aggregate. Shakhtar Donetsk won 5–4 on penalties. \\---- Union Berlin won 3–1 on aggregate. \\---- 5–5 on aggregate. Bayer Leverkusen won 5–3 on penalties. \\---- Sevilla won 3–2 on aggregate. \\---- Roma won 2–1 on aggregate. == Round of 16 == The draw for the round of 16 was held on 24 February 2023, 12:00 CET. === Summary === The first legs were played on 9 March, and the second legs were played on 16 March 2023. |} === Matches === Union Saint-Gilloise won 6–3 on aggregate. \\---- Sevilla won 2–1 on aggregate. \\---- Juventus won 3–0 on aggregate. \\---- Bayer Leverkusen won 4–0 on aggregate. \\---- 3–3 on aggregate. Sporting CP won 5–3 on penalties. \\---- Manchester United won 5–1 on aggregate. \\---- Roma won 2–0 on aggregate. \\---- Feyenoord won 8–2 on aggregate. == Quarter-finals == The draw for the quarter-finals was held on 17 March 2023, 13:00 CET. === Summary === The first legs were played on 13 April, and the second legs were played on 20 April 2023. |} === Matches === Sevilla won 5–2 on aggregate. \\---- Juventus won 2–1 on aggregate. \\---- Bayer Leverkusen won 5–2 on aggregate. \\---- Roma won 4–2 on aggregate. == Semi-finals == The draw for the semi-finals took place on 17th March 2023 at 1:00 PM CET, right after the quarter-final draw. === Summary === The first matches also know as the first leg happened on 11th May, and the second matches took place on 18th May 2023. |} === Matches === Sevilla won 3–2 on aggregate. \\---- Roma won 1–0 on aggregate. == Final == The final was played on 31 May 2023 at the Puskás Aréna in Budapest. A draw was held on 17 March 2023, after the quarter-final and semi-final draws, to determine the \"home\" team for administrative purposes. == Notes == == References == knockout phase",
 "title": "2022–23 UEFA Europa League knockout phase"
}