{
 "id": "1045180",
 "text": "The B Line, named the Red Line from 1993–2020, is a rapid transit line in the Los Angeles Metro Rail system. It opened on January 30, 1993, and was fully completed on June 24, 2000. It stops at 14 stations in the San Fernando Valley, Central Los Angeles, and Downtown Los Angeles. The B Line is completely underground. The line is one of the two rapid transit lines (along with the D Line) in Los Angeles. The two lines share tracks between Downtown Los Angeles and Koreatown and run for about 20 hours every day. Around 25 million people used the B and D Lines in 2023. == History == === Planning === The B Line (formerly the Red Line) was part of a plan to connect Downtown Los Angeles with a rapid transit line to central and western parts of Los Angeles. Most parts of Los Angeles had streetcar and train lines. However, these stopped running by 1963. The last streetcar line from Los Angeles to San Fernando Valley closed in 1952. In the 1980s, the new rapid transit line was planned to go west from Downtown Los Angeles along Wilshire Boulevard for most of the route. Then, it would go north to the San Fernando Valley using Fairfax Avenue. Many locals near Fairfax and Congressman Henry Waxman did not like the plan. This was because the line would affect their area. They did not want gentrification and more traffic. In 1985, a methane explosion happened at a Ross Dress for Less clothing store near Fairfax Avenue. Although the explosion was unrelated to the line, Henry Waxman and others helped make the area a \"methane zone\". This stopped plans for a rapid transit line on Fairfax Avenue. Because of the explosion, the line changed to travel north on Vermont Avenue instead of Fairfax Avenue. The line would then turn northeast to the San Fernando Valley using Hollywood Boulevard and travel under the Santa Monica Mountains. The route on Vermont Avenue was going to be above ground. It was changed to underground due to complaints from nearby businesses, hospitals, and media studios in Hollywood. === Construction and opening === The rapid transit line was built in four phases (parts). The Southern California Rapid Transit District (SCRTD) was in charge of the project. On September 29, 1986, construction started on the first phase of the B Line. The first phase went from Union Station in Downtown Los Angeles to Westlake/MacArthur Park station. It opened as the Red Line on January 30, 1993. The second phase went from Westlake/MacArthur Park station to Wilshire/Western station in Koreatown. That extension began service in 1996. The third phase extended the line from Wilshire/Vermont to the Hollywood/Vine station. However, there were major problems during the construction of that phase. A sinkhole formed in the ground on Hollywood Boulevard. This nearly hurt many workers and damaged some buildings on the street. This problem stopped construction until experts fixed it safely. The third phase later opened in 1999. The project's fourth phase completed the rapid transit line from Hollywood/Highland to North Hollywood station. It opened on June 24, 2000. This phase dug a 3.1-mile train tunnel under the Santa Monica Mountains. Metro had plans to make the line longer, but those plans were stopped. The city of Los Angeles decided not to use more money to build more rapid transit in 1998. They thought they were too expensive. Instead, those plans were replaced with new light rail lines and busways. Overall, the construction of the current line cost $4.5 billion ($8.2 billion in 2024). Once the line was complete, trains ran on two routes: Union Station to Wilshire/Western and Union Station to North Hollywood. For clarity, the route to Wilshire/Western was renamed the Purple Line in 2006. In 2020, the Red Line was renamed to the B Line, and the Purple Line became the D Line. This happened because Metro started using letters instead of colors for all train and busway line names. == Operations == The B Line begins service daily at 4:30 a.m. and ends around midnight. During the day, trains are scheduled to come every 12 minutes. In the early mornings and late nights, trains are scheduled to come every 20 minutes. The rolling stock (trains) used on the B and D Line are called the Breda A650. Metro operates those trains with six cars during rush hours and four cars at other times. The B Line and D lines operates out of the Division 20 Yard (Santa Fe Yard). This yard also stores and gives maintenance to the trains. The yard is located east of Union Station. In 2017, Metro bought new rolling stock for the rapid transit lines. One of the new trains is called the CRRC HR4000. They will start operating in 2024 and replace some older Breda A650 trains. The other trains are called Hyundai Rotem HR5000 which will replace the other ones. == Route and stations == The B Line stops at 14 stations from Union Station to North Hollywood. All stations are underground. The line's northern station is North Hollywood station in the San Fernando Valley. Heading towards Union Station, the line turns southeast and passes underneath the Santa Monica Mountains. When it reaches the Hollywood/Highland station, the line travels east underneath Hollywood Boulevard. At the intersection of Vermont and Hollywood, the line turns south under Vermont Avenue until it connects to the D Line's tracks at Wilshire/Vermont Station. B Line shares the same track and 6 stations with the D Line from Wilshire/Vermont to Union Station. Stations Opened Neighborhood Connections North Hollywood June 24, 2000 North Hollywood G Line Universal City/Studio City Studio City Hollywood/Highland Hollywood Hollywood/Vine June 12, 1999 Hollywood/Western East Hollywood Vermont/Sunset Vermont/Santa Monica Vermont/Beverly Wilshire/Vermont July 13, 1996 Mid-Wilshire/Koreatown D Line Westlake/MacArthur Park January 30, 1993 Westlake D Line 7th Street/Metro Center Downtown Los Angeles A Line D Line E Line J Line Pershing Square D Line Civic Center/Grand Park D Line Union Station A Line D Line J Line Metrolink Amtrak ==References== Category:Transport in California Category:Rapid transit systems in the United States Category:1993 establishments in California Category:Rapid transit",
 "title": "B Line (Los Angeles Metro)"
}