{
 "id": "1045023",
 "text": "The 2023 FIFA Women's World Cup qualification, were qualifications matches to decide which 30 out of 32 teams would take part in the 2023 FIFA Women's World Cup. Australia and New Zealand, who are hosting the event, didn't need to qualify; they got automatic spots. This tournament is the ninth one of its kind and happens every four years, featuring women's international football teams. What's special about this Women's World Cup is that it's the first time it's being held in more than one country. This time, it's happening in both Australia and New Zealand. It's also the third time a Women's World Cup is hosted by a member of the AFC, with the previous times being in China in 1991 and 2007. It's the first time the tournament is taking place in the Southern Hemisphere (the lower part of the world), and it's the first major FIFA tournament in Oceania (the region that includes Australia and New Zealand). Additionally, it's the first time a FIFA tournament is being hosted by different confederations (Australia is in the AFC, and New Zealand is in the OFC). In the 2023 edition of the Women's World Cup, they expanded the number of teams from 24 in the 2019 edition to 32 teams. == Qualified teams == Out of all 32 places available (29 for direct entry and 3 for playoffs), some teams earned their spots directly to take up the 29 direct places. The other 3 places for the playoffs were decided through matches that took place in February 2023 in New Zealand during the 2023 FIFA Women's World Cup qualification games between teams from different regions. Team Qualified as Qualification date Appearance in finals Last appearance Consecutive streak Previous best performance Co-hosts 8th 2019 8 Co-hosts 6th 2019 5 2022 AFC Women's Asian Cup QF winners 9th 2019 9 2022 AFC Women's Asian Cup QF winners 4th 2019 3 2022 AFC Women's Asian Cup QF winners 8th 2019 3 2022 AFC Women's Asian Cup QF winners 1st — 1 2022 AFC Women's Asian Cup play-offs winners 1st — 1 UEFA qualification Group A winners 9th 2019 9 UEFA qualification Group B winners 3rd 2019 3 UEFA qualification Group I winners 5th 2019 4 UEFA qualification Group E winners 5th 2007 1 2022 CONCACAF W Championship Group A winners 9th 2019 9 2022 CONCACAF W Championship Group B winners 8th 2019 8 2022 CONCACAF W Championship Group B runners-up 2nd 2015 1 2022 CONCACAF W Championship Group A runners-up 2nd 2019 2 2022 Women's Africa Cup of Nations QF winners 1st — 1 2022 Women's Africa Cup of Nations QF winners 1st — 1 2022 Women's Africa Cup of Nations QF winners 9th 2019 9 2022 Women's Africa Cup of Nations QF winners 2nd 2019 2 2022 Copa América Femenina SF winners 3rd 2015 1 2022 Copa América Femenina SF winners 9th 2019 9 2022 Copa América Femenina third-place winners 4th 2019 2 UEFA qualification Group F winners 9th 2019 9 UEFA qualification Group H winners 9th 2019 9 UEFA qualification Group D winners 6th 2019 5 UEFA qualification Group G winners 4th 2019 2 UEFA qualification Group C winners 3rd 2019 3 UEFA play-offs 1st ranking 2nd 2015 1 UEFA play-offs 2nd ranking 1st — 1 Inter-confederation play-offs Group B winners 1st — 1 Inter-confederation play-offs Group A winners 1st — 1 Inter- confederation play-offs Group C winners 1st — 1 == References == Category:2023 FIFA Women's World Cup qualification Category:2023 FIFA Women's World Cup",
 "title": "2023 FIFA Women's World Cup qualification"
}