{
 "id": "1045888",
 "text": "The 2022–23 UEFA Europa League group stage started on 8th September 2022 and finished on 3rd November 2022. In this stage, 32 teams played to figure out which 16 teams would move on to the next round of the 2022–23 UEFA Europa League. Teams like Bodø/Glimt, Nantes, Union Berlin, and Union Saint-Gilloise were taking part in the Europa League group stage for the first time. Union Saint-Gilloise was appearing in a UEFA competition group stage for the first time ever. Teams from 23 different countries were part of the group stage. == Draw == The drawing to decide the groups happened on 26th August 2022 in Istanbul, Turkey. There were 32 teams, and they were split into eight groups, each containing four teams. To make it fair, the teams were separated into four pots, each pot having eight teams. This separation was based on how well the teams did in the 2022 UEFA club rankings. Teams from the same country couldn't end up in the same group. Before the drawing, UEFA matched up teams from the same country and decided which groups they would go in. This was done to make sure that these teams had different starting times for their matches. They did this based on which teams had more people watching on TV. After they knew which teams were in the group stage, UEFA told us which teams were matched up from the same country. This was important because it affected when these teams played their matches. * A Roma and Lazio * B Manchester United and Arsenal * C Red Star Belgrade and Partizan (UECL) * D Dynamo Kyiv and Dnipro-1 (UECL) * E Feyenoord and PSV Eindhoven * F Rennes and Monaco * G Real Sociedad and Real Betis * H Malmö FF and Djurgårdens IF (UECL) * I Midtjylland and Silkeborg (UECL) * J Bodø/Glimt and Molde (UECL) * K Union Berlin and SC Freiburg * L Fenerbahçe and Trabzonspor * M Nantes and Nice (UECL) * N Sturm Graz and Austria Wien (UECL) * O AEK Larnaca and Omonia * P Zürich and Basel (UECL) == Teams == Key to colours Group winners advance directly to round of 16 Group runners-up advance to knockout round play-offs Third-placed teams enter Europa Conference League knockout round play-offs {| class=\"wikitable\" Team Notes Roma 100.000 Manchester United 105.000 Arsenal 80.000 Lazio 53.000 Braga 46.000 Red Star Belgrade 46.000 Dynamo Kyiv 44.000 Olympiacos 41.000 Notes == Groups == The fixtures were announced on 27 August 2022, the day after the draw. The matches were played on 8 September, 15 September, 6 October, 13 October, 27 October and 3 November 2022. The scheduled kick-off times were 18:45 and 21:00 CET/CEST. Times are CET/CEST, as listed by UEFA (local times, if different, are in parentheses). === Group A === \\---- \\---- \\---- \\---- \\---- \\---- === Group B === \\---- \\---- \\---- \\---- \\---- === Group C === \\---- \\---- \\---- \\---- \\---- === Group D === \\---- \\---- \\---- \\---- \\---- === Group E === \\---- \\---- \\---- \\---- \\---- === Group F === \\---- \\---- \\---- \\---- \\---- === Group G === \\---- \\---- \\---- \\---- \\---- === Group H === \\---- \\---- \\---- \\---- \\---- == References == == Others notes == group stage",
 "title": "2022–23 UEFA Europa League group stage"
}