{
 "id": "1045321",
 "text": "The 2022 OFC Women's Nations Cup, and they do it every four years. Different countries from Oceania took part in this tournament. It was the 9th time they had this competition. Originally, they were going to play the matches in July and August 2022. But they had to change the dates to January and February because of some schedule changes by the FIFA Women's International Match Calendar. Also, they had to move it because of the COVID-19 pandemic. Finally, they decided to have the tournament in Fiji from 13th to 30th July 2022. This tournament was a way for teams in Oceania to try to qualify for the 2023 FIFA Women's World Cup which was to take place in Australia and New Zealand. However, New Zealand, one of the countries in Oceania, didn't have to compete because they were hosting the World Cup, so they were automatically in. The team from Papua New Guinea won this special tournament and became the champions. It was the first time they won the OFC Women's Nations Cup. == Teams == Team Appearance Previous best performance FIFA rankingat start of event 5th Third place (2010, 2014) 102 (H) 5th Runners-up (2018) 69 3rd Third place (1983) 100 10th Runners-up (2007, 2010, 2014) 49 4th Fourth place (2003) 109 3rd Fourth place (2007, 2010) 120 3rd Group stage (2010, 2018) 104 5th Third place (2007) 92 2nd Group stage (2010) 121 == Venue == All the games where played in one place called the ANZ Stadium. This stadium is on an island called Viti Levu, in a town called Suva. Suva ANZ Stadium Capacity: 4,300 == Draw == On 10th May, they had an event to decide which teams will play against each other in the first part of the competition. They put the teams into different groups. This was based on how well the FIFA rankings of 25 March. == Group stage == === Group A === ==== Matches ==== ===== Samoa vs Tonga ===== ===== Tonga vs Cook Islands ===== ===== Cook Islands vs Samoa ===== === Group B === ==== Matches ==== ===== Vanuatu vs Papua New Guinea ===== ===== Papua New Guinea vs Tahiti ===== ===== Tahiti vs Vanuatu ===== === Group C === ==== Matches ==== ===== Solomon Islands vs Fiji ===== ===== Fiji vs New Caledonia ===== ===== New Caledonia vs Solomon Islands ===== == Knockout stage == === Bracket === == Quarter-finals == === Samoa vs New Caledonia === === Papua New Guinea vs Tonga === === Fiji vs Cook Islands === === Tahiti vs Solomon Islands === == Semi-finals == === Samoa vs Papua New Guinea === === Fiji vs Solomon Islands === == Third place match == == Final == == Goalscorers == == Awards == Award Winner Golden Ball Cema Nasau Golden Boot Meagen Gunemba Ramona Padio Jayda Stewart Golden Glove Camille Andre Fair Play == Qualified teams for FIFA Women's World Cup == Only New Zealand got a spot to play in the 2023 FIFA Women's World Cup because they are hosting the tournament together Australia. They didn't have to qualify like the other teams. Team Qualified on Previous appearances in FIFA Women's World Cup1 5 (1991, 2007, 2011, 2015, 2019) == References == Category:2023 FIFA Women's World Cup qualification",
 "title": "2022 OFC Women's Nations Cup"
}