{
 "id": "1045301",
 "text": "Ayda Field (birth name: Ayda Sabahat Evecan; born May 17, 1979) is an American-Turkish actress and television personality. She is married to Robbie Williams. Field is the daughter of a Turkish father, contactmusic.com, Retrieved on 2010-08-10. and an American Jewish mother. She became famous for her role on Days of Our Lives. She has since acted in several films and television shows. She is also known in the United Kingdom for her regular appearances on Loose Women and being a judge on The X Factor, alongside her husband Robbie Williams. == Filmography == === Film === Year Title Role Notes 2001 Young Blades Daughter 2002 Romeo Fire Slutka Television film 2003 Platonically Incorrect Television film 2007 Making It Legal Elise Television film 2008 Strange Wilderness Mountain Nurse 2008 Fourplay Audrey Television film 2009 Play Dead Marissa Direct-to-video 2011 The Short Cut Ayda Field Short film 2013 Austenland Molly === Television === Year Title Role Notes 1998 City Girls Girl #2 Episode: \"Party of Three\" 2000 Arliss Episode: \"You Can Pick Your Friends\" 2000–01 Days of Our Lives Angela Moroni 65 episodes 2001 Men, Women & Dogs Kim Episode: \"A Bone of Contention\" 2004–06 Blue Collar TV Various Characters 5 episodes 2005 Eve Carla Episode: \"Model Behavior\" 2006 Will & Grace Barbara Episode: \"Partners 'n' Crime\" 2006–07 Studio 60 on the Sunset Strip Jeannie Whatley 15 episodes 2007–08 Back to You Montana Diaz Herrera 11 episodes 2011 Love Bites Sapphire Episode: \"How To...\" 2012 2 Broke Girls Constance Episode: \"And the Big Buttercream Breakthrough\" 2014 The Exes Vanessa Episode: \"Nun Like It Hot\" 2016 Fresh Meat Rosa 5 episodes 2016 Power Monkeys Bea 6 episodes 2016 Paranoid Sheri 3 episodes 2016–2019 Loose Women Herself - Ayda Field 47 episodes 2018 The X Factor UK Herself, judge series fifteen; 22 episodes == Sources == Category:1979 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:Actors from Los Angeles",
 "title": "Ayda Field"
}