{
 "id": "1045824",
 "text": "\"Could I Have This Kiss Forever\" is a 2000 mid-tempo song by Whitney Houston featuring Enrique Iglesias. It was taken from her first greatest hits album Whitney: The Greatest Hits and from his fourth studio album Enrique. It went to number 7 in the United Kingdom, Norway and New Zealand, number 52 in the United States, number 12 in Australia, number 8 in Canada and Austria, number 1 in Poland, Croatia and Switzerland, number 9 in Scotland and number 2 in Iceland, the Netherlands and Sweden. ==Track listings and formats== *Australia CD maxi single # \"Could I Have This Kiss Forever\" (Metro mix) – 3:55 # \"I'm Your Baby Tonight\" (Dronez mix) – 5:03 # \"I'm Every Woman\" (Clivillés & Cole mix) – 4:31 # \"Queen of the Night\" (CJ Mackintosh mix) – 5:19 *Canadian CD maxi single # \"Could I Have This Kiss Forever\" (Metro radio mix) – 3:55 # \"Could I Have This Kiss Forever\" (original version) – 4:21 # \"Love Will Save the Day\" (Jellybean & David Morales 1987 Classic Underground mix) – 7:30 *European CD single # \"Could I Have This Kiss Forever\" (Metro mix) – 3:55 # \"Could I Have This Kiss Forever\" (original version) – 4:21 *European CD maxi single # \"Could I Have This Kiss Forever\" (Metro mix) – 3:55 # \"Could I Have This Kiss Forever\" (original version) – 4:21 # \"Could I Have This Kiss Forever\" (Tin Tin Out mix) – 4:04 # \"Could I Have This Kiss Forever\" (Tin Tin Out mix edit) – 3:38 # \"If I Told You That\" (Johnny Douglas mix) – 4:48 # \"I'm Every Woman\" (Clivillés & Cole mix) – 4:31 *Europe 12-inch vinyl single :A1: \"Could I Have This Kiss Forever\" (Metro mix) – 3:55 :A2: \"Could I Have This Kiss Forever\" (Tin Tin Out mix edit) – 3:38 :A3: \"Could I Have This Kiss Forever\" (original version) – 4:21 :B1: \"Could I Have This Kiss Forever\" (Tin Tin Out mix) – 4:02 :B2: \"If I Told You That\" (Johnny Douglas mix) – 4:48 ==References== Category:2000 songs Category:2000s ballads Category:Pop ballads Category:Latin pop songs Category:Whitney Houston songs Category:Enrique Iglesias songs",
 "title": "Could I Have This Kiss Forever"
}