{
 "id": "1045778",
 "text": "All Out (2022) was a professional wrestling pay-per-view show made by All Elite Wrestling (AEW). It took place on September 4, 2022 at the Now Arena in Hoffman Estates, Illinois. It was the fourth All Out event made by AEW. The main event saw CM Punk defeat Jon Moxley to win the AEW World Championship. Punk hit Moxley with the Go 2 Sleep twice and got the pinfall victory. While Punk was celebrating in the ring, a returning MJF appeared on stage and revealed himself to be The Masked Joker. There was controversy during the post-event media scrum when Punk insulted his former best friend Colt Cabana, AEW executive vice presidents Kenny Omega, Matt Jackson and Nick Jackson (known together as The Young Bucks), and \"Hangman\" Adam Page. This led to a real life backstage fight between Punk, Omega, The Young Bucks, and Ace Steel, a coach. Steel was fired and the rest were stripped of their championships and suspended. ==Matches== No. Results Stipulations Times 1 The Jericho Appreciation Society (Sammy Guevara and Tay Melo) (c) defeated Ortiz and Ruby Soho Mixed tag team match for the AAA World Mixed Tag Team Championship 6:00 2 Hook (c) defeated Angelo Parker (with Matt Menard) by submission Singles match for the FTW Championship 3:55 3 Pac (c) defeated Kip Sabian Singles match for the AEW All-Atlantic Championship 10:00 4 Eddie Kingston defeated Tomohiro Ishii Singles match 13:25 5 The Joker (with Stokely Hathaway, Ethan Page, Lee Moriarty, Colten Gunn, Austin Gunn, and W. Morrissey) defeated Claudio Castagnoli, Wheeler Yuta, Penta El Zero Miedo, Rey Fénix (with Alex Abrahantes), Rush, Andrade El Idolo (with José the Assistant), and Dante Martin Casino Ladder match 14:15 6 The Elite (Kenny Omega, Matt Jackson, and Nick Jackson) (with Brandon Cutler and Michael Nakazawa) defeated \"Hangman\" Adam Page and The Dark Order (Alex Reynolds and John Silver) Tournament final for the AEW World Trios Championship 19:50 7 Jade Cargill (c) (with Kiera Hogan and Leila Grey) defeated Athena Singles match for the AEW TBS Championship 4:20 8 Wardlow and FTR (Cash Wheeler and Dax Harwood) defeated Jay Lethal and The Motor City Machine Guns (Chris Sabin and Alex Shelley) (with Satnam Singh and Sonjay Dutt) Six-man tag team match 16:30 9 Powerhouse Hobbs defeated Ricky Starks Singles match 2:05 10 Swerve In Our Glory (Keith Lee and Swerve Strickland) (c) defeated The Acclaimed (Anthony Bowens and Max Caster) (with Billy Gunn) Tag team match for the AEW World Tag Team Championship 22:30 11 Toni Storm defeated Dr. Britt Baker, D.M.D. (with Rebel), Jamie Hayter, and Hikaru Shida Four-way match for the interim AEW Women's World Championship 14:20 12 Christian Cage (with Luchasaurus) defeated \"Jungle Boy\" Jack Perry Singles match 0:20 13 Chris Jericho defeated Bryan Danielson Singles match 23:40 14 Darby Allin, Sting, and Miro defeated The House of Black (Malakai Black, Brody King, and Buddy Matthews) (with Julia Hart) Six-man tag team match 12:10 14 CM Punk defeated Jon Moxley (c) Singles match for the AEW World Championship 19:55 ==References== Category:2022 in American sports Category:AEW All Out Category:2020s in sports in Illinois Category:2022 in Illinois",
 "title": "All Out (2022)"
}