{
 "id": "1045361",
 "text": "Khomeyni Shahr () is a city in Iran. It is in the Isfahan province. It is the capital of Khomeyni Shahr County. In 2006, 218,737 people lived in the city. In 2011, 244,696 people lived there. In 2016, 247,128 people lived there. The city was first called Sedeh. In the 1930s, the name changed to Homayunshahr. After 1979, the name changed to Khomeyni Shahr. This name is for Ayatollah Khomeini. Local people still call it Sedeh. Some people want to change the name to Mehrbin (). == History == The old name of the city was Sedeh (Persian: ). This name means \"three castles\" in Persian. \"Dezh\" () means \"castle\". People think the city started from three castles. These castles are Kohan Dezh, Gar Dezh, and another Dezh. People think Se-dezh was a Sassanian military base. It had an old fire temple on the mountain near the city. The three main villages are Khouzan, Foroushan, and Varnosfaderan. They are still part of the city. There are also two more villages that are part of the city. Some people think the name Sedeh is linked to the old Persian festival Sadeh. The name changed to Homayunshahr when Reza Shah Pahlavi was king. This name means \"happy city\". Homayun was also a title of the Shah. After the revolution of 1979, the city got the name Khomeyni Shahr. This name is for Ayatollah Khomeini, the leader of the revolution. == History == The city's original name, Sedeh (Persian: ), comes from Se-dezh, meaning \"three castles\" in Persian. Dezh () means castle. It is said the town grew around three neighboring castles: Kohan Dedge, Gar Dedge, and another Dedge. Se-dezh likely served as a Sassanian military base with an old fire temple (atash gah) on a nearby mountain. The city includes three main villages: Khouzan (Khizoon), Foroushan (originally Parishan meaning angel face), and Varnosfaderan (Venesfohoon). There are actually five former villages that are part of the city. Some believe the name might be connected to the ancient Persian festival of Sadeh. During Reza Shah Pahlavi's reign, the city's name changed to Homayunshahr, meaning auspicious city. Homayun was also a title of the Shah, reflecting the Pahlavi dynasty. After the 1979 revolution, the city was renamed Khomeyni Shahr, honoring Ayatollah Khomeini, the revolution's leader. == References == Category:Cities in Isfahan Province",
 "title": "Khomeyni Shahr"
}