{
 "id": "1046994",
 "text": "A Baritone Guitar is a musical instrument used for genres like funk, metal, pop, and a huge range of other genres and styles. The baritone guitar was initially a German acoustic guitar innovation over 100 years ago. When adapted for the early electric guitar market of the 1950s and 60s by manufacturers such as Fender and Danelectro, the instrument found its first popular footing in the hands of rockabilly forefather Duane Eddy. From that point, the scene expanded into 60s surf rock, the popular sounds of Glen Campbell and other country music contemporaries, and perhaps even more iconically, the spaghetti western soundtracks of Ennio Morricone. In the past 20 years, there has been a marked increase in baritone electric guitar use and interest. The baritone guitar is often used by musicians of all stylistic backgrounds looking to replace or augment sounds produced by more conventional instruments or simply to add a new sound that is both familiar and strikingly fresh. In the early days of the electric baritone guitar, Nashville names like Duane Eddy, and Glen Campbell put the instrument on the map in a big way along with the even lower-tuned Fender Bass VI. Furthering the signature sound of 1960s popular music, the Beach Boys founder and revered songwriter/producer Brian Wilson often used a baritone to arrange and write songs, finding a range of notes and tones that were otherwise unavailable to guitarists. More recently, baritone guitars have been found in the hands of metal aficionados James Hetfield of Metallica, Brian ‘Head' Welch of Korn, John Petrucci of Dream Theater, Pat O'Brian of Cannibal Corpse, and countless others. On another side of the rock spectrum, Eddie Van Halen, Dave Matthews, and Robert Smith have used the baritone frequently for recording. Jazz giant Pat Metheny used a baritone guitar to record his 2003 solo album One Quiet Night and his 2011 solo album What's It All About. The recordings of Ani DiFranco are another great example of the baritone guitar's contributions to both jazz and sounds that bend and defy the constraints of genre. In 2019, Snarky Puppy's Mark Lettieri released a baritone-centric solo album, Deep: The Baritone Sessions. Since then, he has since played both standard guitar and baritone guitar in Vulfpeck side-project The Fearless Flyers, and brought a new wave of popularity to the instrument among funk players. Countless musicians look to Eastwood when considering baritone electric guitar options. Pat Smear of the Foo Fighters, Ian Mackaye from Minor Threat, and Albert Bouchard of the Blue Oyster Cult are all known to frequently use the Eastwood Sidejack Baritone on stage. The legacy of the baritone electric extends well beyond the status of a “drop-tuned metal guitar”“. The acoustic versions have been around since the 1800s, but the electric baritones – as we know them today – only hit the scene in the 1950s. Category:Plucked string instruments",
 "title": "Baritone Guitar"
}