{
 "id": "1046698",
 "text": "The 2023 UEFA Europa League final was the last game of the 2022–23 UEFA Europa League, which is Europe's second-tier club football competition run by UEFA. It's been around for 52 seasons, and it's been called the UEFA Europa League for 14 seasons now. The final match happened at the Puskás Aréna in Budapest, Hungary, on 31 May 2023. The teams playing were Sevilla from Spain and Roma from Italy. Sevilla won the match 4–1 in a penalty shootout after the game ended 1–1 even after extra time. This win gave them their seventh UEFA Cup/Europa League title. Because they won, they got a spot in the group stage of the 2023–24 UEFA Champions League, and they also got to play against the winners of the 2022–23 UEFA Champions League, which was Manchester City, in the 2023 UEFA Super Cup. The final game was talked about because there were some controversial decisions made by the referee, Anthony Taylor. == How the teams got here == Just to make it simple, here are the scores of the teams that made it to the final match, with the team playing at their home ground listed first (H) and the team playing away listed second (A). Sevilla Round Roma Champions League Europa League Opponent Result Group stage (CL, EL) Opponent Result Manchester City 0–4 (H) Matchday 1 Ludogorets Razgrad 1–2 (A) Copenhagen 0–0 (A) Matchday 2 HJK 3–0 (H) Borussia Dortmund 1–4 (H) Matchday 3 Real Betis 1–2 (H) Borussia Dortmund 1–1 (A) Matchday 4 Real Betis 1–1 (A) Copenhagen 3–0 (H) Matchday 5 HJK 2–1 (A) Manchester City 1–3 (A) Matchday 6 Ludogorets Razgrad 3–1 (H) Group G third place Final standings Group C runners-up Europa League Opponent Agg. 1st leg 2nd leg Knockout stage Opponent Agg. 1st leg 2nd leg PSV Eindhoven 3–2 3–0 (H) 0–2 (A) Knockout round play- offs Red Bull Salzburg 2–1 0–1 (A) 2–0 (H) Fenerbahçe 2–1 2–0 (H) 0–1 (A) Round of 16 Real Sociedad 2–0 2–0 (H) 0–0 (A) Manchester United 5–2 2–2 (A) 3–0 (H) Quarter-finals Feyenoord 4–2 0–1 (A) 4–1 (H) Juventus 3–2 1–1 (A) 2–1 (H) Semi-finals Bayer Leverkusen 1–0 1–0 (H) 0–0 (A) == Match == In the 35th minute of the match, Roma scored a goal when Paulo Dybala kicked the ball into the right corner of the net after receiving a pass from Gianluca Mancini. However, Sevilla evened the score at 1-1 ten minutes into the second half when Mancini accidentally put the ball into his own net after a cross from Jesús Navas on the right. The game continued for almost 130 minutes, and then it had to be decided by a penalty shootout. Roma missed two of their penalties during the shootout. One was saved by the Sevilla goalkeeper, Bono, and the other one hit the goalpost. Gonzalo Montiel, who had also scored the winning penalty for Argentina in the 2022 FIFA World Cup final against France, scored the winning penalty for Sevilla. His penalty was initially missed, but it was retaken because of a rule violation. === Details === {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 13 Yassine Bounou RB 16 Jesús Navas (c) CB 44 Loïc Badé CB 6 Nemanja Gudelj LB 3 Alex Telles CM 20 Fernando CM 10 Ivan Rakitić RW 55 Lucas Ocampos AM 21 Óliver Torres LW 25 Bryan Gil CF 15 Youssef En-Nesyri Substitutes: GK 1 Marko Dmitrović GK 31 Alberto Flores DF 2 Gonzalo Montiel DF 14 Tanguy Nianzou DF 23 Marcão MF 8 Joan Jordán MF 24 Papu Gómez MF 43 Manu Bueno FW 7 Suso FW 12 Rafa Mir FW 17 Erik Lamela Manager: José Luis Mendilibar Man of the Match: Yassine Bounou (Sevilla) Assistant referees: Gary Beswick (England) Adam Nunn (England) Fourth official: Michael Oliver (England) Reserve assistant referee: Stuart Burt (England) Video assistant referee: Stuart Attwell (England) Assistant video assistant referee: Chris Kavanagh (England) Support video assistant referee: Bastian Dankert (Germany) Match rules * 90 minutes * 30 minutes of extra time if necessary * Penalty shoot-out if scores still level * Twelve named substitutes * Maximum of five substitutions, with a sixth allowed in extra time ==Other Notes== == References == Category:2023 UEFA Europa League Category:UEFA Europa League",
 "title": "2023 UEFA Europa League final"
}