{
 "id": "1046799",
 "text": "On 31 August 2023, a fire burned down an illegally occupied abandoned building in Johannesburg, South Africa. The fire killed 77 people and badly hurt 88 others. It was one of the deadliest fires in South African history. ==Fire== The fire started early in the morning on 31 August 2023, in the Central Business District. It was at a five-story abandoned building on the corner of Delvers and Albert Streets that is owned by the city government and was taken over by gangs. It was being illegally occupied by as many as 400 impoverished people. Many of them were foreign nationals, economic migrants, and asylum seekers. The gangs were charging the illegal occupants rent. The cause of the fire is not currently known. It spread through the building and trapped many people. Many were trapped because of the weak partitions and gates between makeshift rooms made by residents. Many residents jumped out of the windows of the building to escape. Some of them did not survive the jump. ==Aftermath== Some people who survived the fire would not get on buses to be moved to community halls after the fire. They were worried that the relocation would be used by government officials as an excuse to deport them. They also did not want to leave behind the remains of their possessions in the burnt building. ==Response== President Cyril Ramaphosa visited the site of the fire after it happened. Gauteng Premier Panyaza Lesufi said that there would be an inquiry into the fire. Government officials said that NGOs, who stopped the government from evicting people in similar buildings. NGOs and people who own property in the city said that the City of Johannesburg was supposed to take care of buildings and enforce safety rules. South Africa's courts have ruled that evictions cannot happen unless the people being evicted are given a different place to live under the 1998 Prevention of Illegal Eviction Act. ==References== Category:2023 fires Category:2023 in Africa Category:2020s disasters in Africa Category:2020s in South Africa Category:August 2023 events 2023 building fire",
 "title": "2023 Johannesburg building fire"
}