{
 "id": "1046932",
 "text": "\"Vibeology\" is a song recorded by American singer and dancer Paula Abdul. It was written by Sandra St. Victor, Peter Lord and V. Jeffrey Smith, with the production handled by the last two and was released as the fourth single from Abdul's second studio album, Spellbound (1991). It was originally going to be released as Spellbounds third single after Abdul had performed it live at the 1991 MTV Video Music Awards, but at the time \"Blowing Kisses in the Wind\" was being sent to radio airplay and was a popular choice for listeners. == Chart history == \"Vibeology\" reached at number 63 in Australia in December 1991 and at number 19 in the UK in January 1992. The single reached number 16 on the US Billboard Hot 100 in February 1992, becoming Abdul's first single to reach outside the top 10 in the US since the original release of \"(It's Just) The Way That You Love Me\" in 1988. ==Track listings== * US 12-inch record # Vibeology - Keith Cohen's House Mix (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Keith Cohen's Club Mix (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Keith Cohen's Vibe the House Dub (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # The Promise of a New Day - 12-inch Mix (Peter Lord; V. Jeffrey Smith) # Vibeology - Humphrey's Full-length Hip-Hop Mix (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Humphrey's House Mix (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Humphrey's Hip-House Mix (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Humphrey's Hip-Hop Instrumental (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Keith Cohen's LP Version (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) * European 7-inch single # Vibeology - 7-inch Edit (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Hurley's House 7-inch (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) * European 12-inch record # Vibeology - Hurley's House Mix (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Silky Sax Dub (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Hurley's Underground Mix (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Hurley's Underground Sax Dub (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Album Version (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) * UK 5-inch CD # Vibeology - 7-inch Edit (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Hurley's House Mix (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Silky Sax Dub (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Hurley's Underground Mix (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) # Vibeology - Hurley's Underground Sax Dub (Peter Lord; Sandra St. Victor; V. Jeffrey Smith) ==Charts== Chart (1991–1992) Peak position Australia (ARIA) 63 Canada Retail Singles (The Record) 7 Canada Contemporary Hit Radio (The Record) 4 Europe (Eurochart Hot 100) 40 Europe (European Dance Radio) 3 UK Dance (Music Week) 16 ==Release history== Region Date Format(s) Label(s) Japan October 21, 1991 Mini-CD Australia November 18, 1991 Virgin United Kingdom January 6, 1992 ==References== Category:1991 songs Category:Paula Abdul songs Category:Dance-pop songs Category:New jack swing songs Category:R&B; songs",
 "title": "Vibeology"
}