{
 "id": "1046448",
 "text": "In Norse mythology, Ýdalir (\"yew-dales\"Orchard (1997:185).) is a place where the god Ullr lives. This information comes from the Poetic Edda, a collection of old Norse stories and poems written down in the 13th century. Scholars have different ideas about what Ýdalir might mean in the mythology. == Attestations == Ýdalir is mentioned only in stanza 5 of the poem Grímnismál, found in the Poetic Edda. In this stanza, Odin (disguised as Grímnir) informs young Agnar that Ullr has a home in Ýdalir. Here's a translation of the stanza (Ýdalir is translated as Ydalir): > : Ydalir it is called, where Ullr : has himself a dwelling made. : Alfheim > the gods Frey gave : in days of yore for a tooth-gift.Thorpe (1907:21). == Theories == Talking about Ýdalir, Henry Adams Bellows says that \"the wood of the yew-tree was used for bows in the North just as it was long afterwards for England\".Bellows (2004:88). Rudolf Simek also says that \"this connexion of the god with the yew-tree, of whose wood bows were made, has led to Ullr being seen as a bow-god\".Simek (2007:375). Andy Orchard suggests that Ýdalir is a fitting home for the archer-god, Ull. Hilda Ellis Davidson mentions that while Valhalla is well-known in Norse mythology for its association with warfare and death, the significance of other halls like Ýdalir and the goddess Freyja's afterlife realm, Fólkvangr, has been largely forgotten.Davidson (1993:67). Udale in Cromarty, Scotland, was first recorded in 1578, which is believed to have its roots in the Old Norse word \"y-dalr\". Robert Bevan-Jones suggests a connection between the veneration of Ullr and Ýdalir among the Norse settlers in Scotland, possibly influencing the naming of the location as \"ydalr\".Bevan- Jones (2002:134). ==Notes== ==References== * Bellows, Henry Adams (Trans.) (2004). The Poetic Edda: The Mythological Poems. Courier Dover Publicans. * Bevan-Jones, Robert (2002). The Ancient Yew: A History of Taxus baccata. Windgather Press. * Davidson, Hilda Roderick Ellis (1993). The Lost Beliefs of Northern Europe (illustrated edition). Routledge. * Thorpe, Benjamin (Trans.) (1907). The Elder Edda of Saemund Sigfusson. Norrœna Society. * Orchard, Andy (1997). Dictionary of Norse Myth and Legend. Cassell. * Simek, Rudolf (2007) translated by Angela Hall. Dictionary of Northern Mythology. D.S. Brewer. Category:Places in Norse mythology",
 "title": "Ýdalir"
}