{
 "id": "1046909",
 "text": "Lukas Aurednik (20 February 1918 in Vienna – 2 June 1997) was an Austrian football player. In Austria he played as striker mainly for Austria and Rapid. He also played in France. He also played for the Austrian national football team. He later continued his career as a coach. As coach he worked mainly in Greece. ==Career== Lukas Aurednik began his football career as a goalkeeper Sportclub Staatsfabrik. Soon he was used on the field due to his playing skills. From the right wing-back position he changed into a successful center forward. He got his first professional contract with Rapid Vienna in 1935. In 1938 they became the last football champion in Austria before its annexation to the German Reich. From 1938 he played for several years in different teams before moving to the military SV Brünn in the Protectorate of Bohemia and Moravia. He played with the Brno team in the Gauliga Sudetenland, which he won with his club in 1943 and played therefore in the final round of the German championship. But Aurednik was transferred to the Markersdorf Air Force Sports Club in Markersdorf an der Pielach in the same year. There were already players as Karl Durspekt, Karl Sesta, Max Merkel, Walter Dzur and Paul Zielinski. They reached the sixth place in the Gauliga Ostmark in the 1943–44 season. In 1944 Aurednik was able to return to Rapid, where he remained until 1946. With them he became the first Austrian football champion and cup winner in post-war Austria in the 1945–46 season. As a left winger, he contributed 28 goals in 20 championship games and 7 goals in 3 cup games. In 1946 he went abroad to Club Olympique Roubaix-Tourcoing in France. He returned to Austria in 1948 and played for FK Austria Wien . With Austria Wien he won the Austrian championship title three times in 1949, 1950 and 1953 and also the cup competition in 1949. After becoming player-coach at the lower-class SC Austria Lustenau in 1953, the striker went again to France again in 1954. He played in Lens for two years and scored six goals in 29 appearances in the French Division 1 in his first season. In the 1955–56 season he and his team reached the runner-up position together with Erich Habitzl. From 1956 to 1958 he was active in Division 2 at Le Havre AC and scored 12 goals in 60 championship games. ==International== Aurednik made it into the Austrian national team in 1948 when he was already 30 years old. He made his debut for Austria in the game against Czechoslovakia on 31 October 1948 in Preßburg. His last match was on 13 December 1950 versus Scotland. In total, he played 14 international matches for the national team and scored two goals.ÖFB Players profile ==Manager== In 1953–54 he was the player-manager of SC Austria Lustenau. After he stopped playing in 1958, he went to Greece, where he became manager of the first division club AEK Athens between July 1959 and December 1960 as head coach and until the end of the 1960–61 season as a tactical advisor in the coaching team. With AEK Athens he reached the runners-up position in 1960. With the exception of his time with Anorthosis Famagusta in Cyprus, he remained in Greece until 1967. He then returned to Austria and looked after 1. Wiener Neustädter SC for two years.100 Jahre 1. Wiener Neustädter SC, Die Chronik 1908 bis 2008, Herbert Geissler & Rainer Spenger, Eigenverlag des 1. Wiener Neustädter SC, S. 34 For the 1970–71 season he was hired by Sporting Charleroi under whom the Belgians became runners-up in 1969, which was the best placement in the club's history. On Aurednik's initiative, the midfielder Gerhard \"Bobby\" Böhmer was signed by Vienna's Admira, who was to acquire legendary status at Charleroi. == Honours== ;Player * 5 × Austrian champion: 1938, 1946 (Rapid), 1949, 1950, 1953 (Austria) * 2 × Austrian Cup: 1938 (Rapid), 1949 (Austria) * 1 × Sudetendeutscher champion: 1943 (Brünn) * 1 × French championship runner-up: 1956 (Lens) * 14 matches and 2 goals for the Austrian national football team 1948-1950 ;Coach * Cypriot Cup: 1964 (Anorthosis) ==References== Category:Austrian footballers Category:Austrian football managers Category:1918 births Category:1997 deaths Category:SK Rapid Wien players Category:Austrian football forwards Category:FK Austria Wien players Category:Austrian football champions",
 "title": "Lukas Aurednik"
}