{
 "id": "1046389",
 "text": "Dillon Brooks (born January 22, 1996) is a Canadian professional basketball player. He is a small forward-shooting guard for the Houston Rockets of the National Basketball Association (NBA). He has also played for the Memphis Grizzlies. Brooks is known for his trash talk on and off the court with media and fans calling him Villain Brooks. Brooks said he likes the negative reaction and that it was a persona. ==Career== ===College=== Brooks played college basketball at University of Oregon. During his time with the Ducks, Brooks would help them win the Pac-12 Conference regular season title. He was also chosen to be on the first-team All-Pac-12 and was named a third-team All- American by the Sporting News. The United States Basketball Writers Association named Brooks the District IX player of the year along with coach Dana Altman. ===NBA=== Brooks was selected 45th overall by the Houston Rockets in the 2017 NBA draft. The same day, the Rockets traded Brooks and Ivan Rabb to the Memphis Grizzlies in exchange for a future second round picks. On April 11, 2018, he was able to score a career-high 36 points in a 137–123 loss against the Oklahoma City Thunder. He had to miss some of the 2018-19 season because he ruptured a ligament in his right big toe. He was able to earn a starting role the next season. On February 5, 2020, Brooks and he Grizzlies agreed to a three-year, $35 million extension. On December 19, 2021, Brooks scored a new career high 37 points during a 105–100 loss to the Portland Trail Blazers. During Game 2 of the Western Conference semifinals against the Golden State Warriors, Gary Payton II fell and fractured his elbow after being hit by Brooks when he was going for a layup.Brooks was ejected and suspended for the next game. On February 2, 2023, he punched Donovan Mitchell in the groin which caused a brawl. He was then ejected from the game. He was suspended for a game afterwards. During a game against the Miami Heat on March 17, Brooks pushed a cameraman to the ground and was fined $35,000 by the NBA. Brooks was named to the NBA All-Defensive Second Team for the 2022–23 season. During the 2023 NBA playoffs, Brooks said that he \"pokes bears\" and called LeBron James \"old\". During Game 3 of the Western Conference first round between the Grizzlies and the Los Angeles Lakers, Brooks punched LeBron in the groin and was ejected from the game. The Lakers would go on to win the series. Brooks was criticized for the punch and was fined for not speaking to media after the loss. On July 8, 2023, Brooks was part of a sign-and-trade deal where he joined the Houston Rockets and signed a four-year, $80 million contract. ==National team== Brooks plays for the Canada men's national basketball team. He played for them during the FIBA Basketball World Cup in 2023. During the tournament, he helped Canada defeat France, Germany, and World champions Spain to help Canada clinch a spot in the Olympics for the first time since 2000. Canada would defeat the United States to win the bronze medal. It was Canada's first international medal since 1936. He would end up setting a Canadian single game scoring record with 39 points in the game. He was booed by the crowd during the tournament, but was cheered at the end and recieved chants of MVP. Brooks would be named the Best Defensive Player of the tournament. ==References== ==Other websites== Category:1996 births Category:Living people Category:Black Canadian sportspeople Category:Canadian basketball players Category:Houston Rockets players Category:Memphis Grizzlies players Category:Shooting guards Category:Small forwards Category:Sportspeople from Ontario",
 "title": "Dillon Brooks"
}