{
 "id": "1046091",
 "text": "Jacques Biélinky ( – 1943) was a Russian-born French Jewish journalist and art critic. == Biography == Jacques Biélinky was born into a Russian-born Jewish family. He survived a Russian Holocaust-like event, called the Kishinev pogrom in 1903. After the event ended, Biélinky was arrested and was charged with socialism. He was released. Biélinky emigrated to France in 1909 as a political refugee and in 1927 he got French citizenship. Biélinky was a journalist and art critic for The Israelite Universe. Jacques Biélinky was considered as one of the best connoisseurs to be Jewish. In May 1940, Nazi Germany invaded France. France surrendered one month later to Nazi Germany, and they began occupying France. Between 1940 and 1942, Biélinky kept a diary detailing daily life in Paris, and the persecution of the Jews. In the first months of the occupation, he noticed extremely few anti-Semitic allusions. On 27 September 1940, the Nazi German government of France ordered that a poster with a yellow star should be hanged up on the walls of any store that is operated by Jewish people. Yet people still could continue enter and buy stuff from those stores. Biélinky noticed that the support of the Parisians were fading away. Because the Jews there had supply difficulties and daily problems, most of them stopped communicating with non-Jews. Biélinky mainly wrote about the situation of his daily life as a Jew in Paris. For unknown reasons, after the last entry, he stopped writing his diary for almost two months. Biélinky was arrested on the night of 10–11 February 1943, during a razzia by the French police and was deported to the Drancy internment camp. One month later on 23 March 1943, he was deported from Drancy to the Chełm Ghetto in German-occupied Poland (modern-day Poland). Later that year, Biélinky was deported to the Sobibor extermination camp. He most likely died that same year. Biélinky was 61–62 years old when he died. == Publication of the diary == After World War II ended, Biélinky's diary was published posthumously as Journal 1940–1942. Un journaliste juif à Paris sous l'Occupation. (English: Diary 1940–1942. A Jewish journalist in Paris during the Occupation.) in 1993. Category:1881 births Category:1943 deaths Category:People from Vitebsk Region Category:French journalists Category:Holocaust victims Category:Jewish writers",
 "title": "Jacques Biélinky"
}