{
 "id": "1046921",
 "text": "Riccardo Ponzio (born 11 June 1997) is an Italian racing driver, from Pescara. After some appearances in the Italian Endurance Championship in 2015, he made his debut in the Italian F4 Championship, with the Teramo Racing Team, concluding with a 10th place as best placement in the Misano World Circuit. In 2016 his participation in the championship continues with the same team, but not taking part in the whole championship. == Career == === F2 Italian trophy === For 2017 the driver from Abruzzo participates in the F2000 Italian Formula Trophy, F2 Italian Trophy. Against the odds, he wins in 7 races out of 14 disputed (including the 1st position in the iconic circuit of Imola Circuit) and is crowned champion of the tricolor series during the last round of the season at the racetrack of Monza Circuit, scoring 420 points in total. He ends the season with 12 consecutive podiums including 7 wins and 3 Pole position. === Prototypes === During the winter of the same year he took part in a test with a Hyundai i30 N TCR, due to a possible participation in the World Touring Car Cup Drivers championship. On March 16th, 2018, the driver announces that he will participate in the European Le Mans Series championship with Oregon Team, driving a Norma M30 LMP3. He will conclude the season with 9 points and a 7th place conquered on the Belgian circuit of Circuit de Spa-Francorchamps. In 2019 he announced that, while waiting for the Formula One program that was being developed, he participated in the Italian sports prototype championship under the new SG Motors team with which he won 3 races, ending the season in 2nd place, winning the under 25 and rookie title. === Formula 1 - BOSS GP === During the period 2020-2021 he took part at the BOSS GP European Championship, in the Open Class, aboard a Formula One Jaguar R3, he participates in 3 races achieving two second places and a third place. === Championship GT === In 2022 he signed an agreement with Imperiale Racing to race in the 2022 Italian GT Championship with Lamborghini Huracan GT3. He shared the #9 car with James Roe Jr. and Sebastian Balthasar in the PRO-AM category. The first year in the category ended positively with a victory at the debut in the circuit of Vallelunga Circuit, and once again hitting the podium in the last race in Monza Circuit. == Trophies == * F2 Italian Trophy 2017 * Italian champion sports prototypes 2019 (under 25) == Racing record == === Italian Gran Turismo Endurance === === F4 === Italian Championship Year Team Car VAL MNZ IMO MUG ADR IMO MIS Points Position 2015 Teramo Racing Team Tatuus FA T014 13 17 15 16 13 13 21 17 21 20 22 Rit Rit ES ES 21 14 18 18 10 6 8 22º Year Team Car MIS ADR IMO MUG VAL IMO MNZ Points Position 2016 Teramo Racing Team Tatuus FA T014 15 13 27 14 19 25 16 20 24 Rit 19 15 0 38º === F2 === F2 Italian Trophy Year Team Car MIS IMO SPA MAG VAL MUG MNZ Points Position 2017 Puresport Dallara F308 - Volkswagen 10 4 1 1 1 2 3 2 3 1 1 2 1 1 337 1º === European Le Mans Series === LMP3 Year Team Car LEC MNZ RBR SIL SPA POR Points Position 2018 Oregon Team Norma M30 11 8 16 14 7 15 9 17º === Italian Championship Prototypes === Year Team Car MNZ VAL MIS IML VAL MUG Points Position 2019 SG Motors Wolf Gb Thunder 2 4 3 2 5 1 4 3 1 2 3 1 142 2° == References == Category:Italian Formula One drivers Category:Sportspeople from Abruzzo Category:People from Pescara Category:1997 births Category:Living people",
 "title": "Riccardo Ponzio"
}