{
 "id": "1047861",
 "text": "Leandro César Zdero (Born January 18, 1971) is an Argentine architect and politician belonging to the Radical Civic Union and Juntos por el Cambio who currently serves as governor of the Chaco Province. Since 2017, before his position as governor, he was a provincial deputy for the period 2017-2021 and Chief of Staff of the Municipality of Resistencia. ==Early life and career== He was born on January 18, 1971, he completed his secondary studies at the Nuestra Señora de Fátima Institute in Quitilipi and then studied architecture at the National University of the Northeast, graduating there in 1995. He began his political career at the University and joined the Radical Civic Union with which he became a provincial deputy between 2005 and 2009. After his time in the legislative chamber he was summoned by the mayor of Resistencia, Aída Ayala , to perform different positions at the municipal level. He first served as government secretary and after two years served as chief of staff until the end of Ayala's term. In 2015 he was the candidate of the Vamos Chaco front and tried to retain the mayor of Resistencia, but in September of that year, Governor Jorge Capitanich won the elections for mayor of the Chaco capital with 49.78%, beating Leandro Zdero, who It achieved 46.73. In this way, Peronism won the mayor's office after 12 years of radical governments. With the arrival of Mauricio Macri to the national government, Zdero was summoned to be the regional head of Anses in its Northeast section. He took office in March 2016 and served in that position until his resignation in 2017 to become a provincial deputy. In 2017 Zdero was one of the six provincial deputies who managed to obtain Cambiemos in the province. In 2019, he ran as a candidate for mayor of Resistencia, competing against the ruling party's candidate Gustavo Martínez. On that occasion, Zdero came out on the Chaco Somos Todos front, the local version of Together for Change, and achieved 34% of the support of the capital's residents, but he was not enough to be elected since Martínez obtained 41% of the votes. In 2021, Leandro was a candidate to renew his seat as a provincial deputy and achieved it after obtaining a total of 41.91% of the votes on the list of deputies, enough to obtain seven seats, one less than the ruling party, which achieved eight. He is currently second vice president of the Chamber. ===2023=== In 2023, he presented himself as a candidate for governor of Chaco for the Together for Change front, internally facing Juan Carlos Polini, national deputy of the UCR and in alliance with former governor Roy Abelardo Nikisch, whom he led as a candidate for mayor. Zdero won the election on June 18, 2023 with a total of 121,970 votes, surpassing Polini's 103,508, and the sum of their votes exceeded the number of votes obtained by Jorge Capitanich's ruling party. For this election, Zdero had the support of both presidential representatives of Juntos, such as Horacio Rodríguez Larreta and Patricia Bullrich. He also declared that Chaco was marked by a lot of darkness, in reference to the case of Cecilia Strzyzowski allegedly murdered by the Sena Family, directly linked to Governor Capitanich. ==2023 Governor of Chaco== In the 2023 Chaco provincial elections, he was elected with 46.39%, defeating Governor Jorge Capitanich. With this victory, radicalism returns to govern Chaco after 16 years. On December 9, Zdero was sworn in as governor of Chaco together with his vice-governor Silvana Schneider and the entire cabinet14 the cabinet is composed of: the Secretary of Cabinet Coordination, Livio Gutiérrez; the Secretary of Strategic Affairs, Marcos Resico; the Secretary General of the Government, Carolina Meiriño; the General Advisor of the Government, Alejandra Ferreyra; the Minister of Human Development, Carina Botteri Disoff; the Minister of Education, Sofía Naidenoff; the Minister of Government, Jorge \"Pato\" Gómez; the Minister of Treasury and Finance, Alejandro Abraam; the Minister of Infrastructure, Hugo Domínguez; the Minister of Production, Hernán Halavacs; the Minister of Health, Sergio Rodríguez; and the Minister of Security, Hugo Matkovich. Category:Argentine politicians Category:Argentine architects Category:Living people Category:1971 births Category:Chaco Province",
 "title": "Leandro Zdero"
}