{
 "id": "1047468",
 "text": "All Out (2021) was a professional wrestling pay-per-view show made by All Elite Wrestling (AEW). It took place on September 5, 2021 at the Now Arena in Hoffman Estates, Illinois. It was the third All Out event held by AEW. The main event saw Kenny Omega defeat Christian Cage to keep the AEW World Championship. Omega hit Christian with the One-Winged Angel off the top rope and got the pinfall victory.Although it was announced that Riho was eliminated by Hayter on the event, a video shown during the November 24 episode of Dynamite proved that Riho was not actually eliminated. Another notable match saw CM Punk return to the ring for the first time in seven years. He defeated Darby Allin with the Go to Sleep for the pinfall victory. The PPV also featured the AEW debuts of Minoru Suzuki, Ruby Soho, Adam Cole and Bryan Danielson. ==Matches== No. Results Stipulations Times 1 Best Friends (Orange Cassidy, Chuck Taylor, and Wheeler Yuta) and Jurassic Express (Jungle Boy and Luchasaurus) (with Marko Stunt) defeated Hardy Family Office (Matt Hardy), Private Party (Isiah Kassidy and Marq Quen), and The Hybrid 2 (Angélico and Jack Evans) (with The Blade) 10-man tag team match 9:25 2 Miro (c) defeated Eddie Kingston Singles match for the AEW TNT Championship 13:25 3 Jon Moxley defeated Satoshi Kojima Singles match 12:10 4 Dr. Britt Baker, D.M.D. (c) (with Jamie Hayter and Rebel) defeated Kris Statlander (with Orange Cassidy) Singles match for the AEW Women's World Championship 11:25 5 Lucha Brothers (Penta El Zero Miedo and Rey Fénix) (with Alex Abrahantes) defeated The Young Bucks (Matt Jackson and Nick Jackson) (c) (with Brandon Cutler) Steel cage match for the AEW World Tag Team Championship 22:05 6 Ruby Soho won by last eliminating Thunder Rosa 21-woman Casino Battle Royale for a AEW Women's World Championship match in the future 21:00 7 Chris Jericho defeated MJF Singles retirement match 21:15 8 CM Punk defeated Darby Allin Singles match 16:40 9 Paul Wight defeated Q. T. Marshall (with The Factory (Aaron Solo and Nick Comoroto)) Singles match 3:10 10 Kenny Omega (c) (with Don Callis) defeated Christian Cage Singles match for the AEW World Championship 21:20 === Casino Battle Royale entrances and eliminations === Draw Entrant Order Eliminated by Eliminations Clubs Hikaru Shida 6 Nyla Rose 1 Skye Blue 1 Abadon 0 Emi Sakura 3 Hikaru Shida 0 The Bunny 11 Anna Jay 1 Abadon 2 The Bunny 1 Diamonds Anna Jay 12 Penelope Ford 1 Kiera Hogan 4 Nyla Rose 0 KiLynn King 5 Nyla Rose 0 Diamante 8 Big Swole 0 Nyla Rose 19 Thunder Rosa 5 Hearts Thunder Rosa 20 Ruby Soho 1 Penelope Ford 17 Tay Conti 1 Riho 7 Jamie Hayter 0 Jamie Hayter 14 Jade Cargill 1 Big Swole 9 Jamie Hayter 1 Spades Tay Conti 18 Nyla Rose 1 Red Velvet 15 Jade Cargill 1 Leyla Hirsch 13 Jade Cargill 0 Jade Cargill 16 Nyla Rose 3 Rebel 10 Red Velvet 0 Joker Ruby Soho - Winner 1 ==References== Category:2021 in American sports Category:AEW All Out Category:2020s in sports in Illinois",
 "title": "All Out (2021)"
}