{
 "id": "1047870",
 "text": "Lamar Demeatrice Jackson Jr. (born January 7, 1997) is an American football quarterback. He plays for the Baltimore Ravens of the National Football League (NFL). He played college football with the Louisville Cardinals and was a Heisman Trophy winner. In 2019, he was voted as the Most Valuable Player with 50 out of 50 votes. He became the second person after Tom Brady in 2010 to become the unanimous MVP. ==College== He was recruited out of Boynton Beach High School as a three-year recruit by ESPN and a four-star recruit by Rivals.com. Jackson started his career by playing college football at University of Louisville for the Cardinals. He led the Cardinals to a 27-21 win over the Texas A&M; Aggies to win the 2015 Music City Bowl. He would be named MVP of the game. On December 10, 2016, Jackson won the 2016 Heisman Trophy, beating Deshaun Watson, Dede Westbrook, Jabrill Peppers, and Baker Mayfield. He was the first Cardinal to win the trophy and was also the youngest winner. Jackson was also third in the 2017 Heisman Trophy voting, finishing behind Bryce Love and winner Baker Mayfield. He was named the men's ACC Athlete of the Year in 2017. On January 5, 2018, Jackson said that he was going to enter the 2018 NFL Draft. ==NFL== On April 26, 2018, the Baltimore Ravens traded a second and fourth round pick in the draft and a second round pick in the 2019 NFL Draft to the Philadelphia Eagles for their first and fourth round picks. With the newly acquired 32nd pick, the Ravens drafted Jackson. After Ravens quarterback Joe Flacco injured his hip in a loss against the Pittsburgh Steelers, the Ravens announced that Jackson would be the starting quarterback. On April 27, 2023, Jackson signed a five-year; $260 million contract with $185 million guaranteed. This was the largest contract in NFL history at the time of signing. On December 25, the Ravens defeated the San Francisco 49ers 33–19. In the game, Jackson would throw for 252 yards, get two touchdowns and zero interceptions for a 105.9 passer rating. In the Ravens next game, they faced the Miami Dolphins and they defeated the Dolphins 56–19. The Ravens would clinch the top seed in both the AFC and AFC North. During the game, Jackson complete 18 of his 21 passes for 321 yards, score five touchdown passes, and zero interceptions. He also had a perfect passer rating for the third time in his NFL career. ==References== == Other websites == * *Baltimore Ravens profile Category:1997 births Category:Living people Category:African- American players of American football Category:American football quarterbacks Category:Baltimore Ravens players Category:Heisman Trophy winners Category:Sportspeople from Florida",
 "title": "Lamar Jackson"
}