{
 "id": "1047839",
 "text": "John Norman Warren, MBE, OAM (17 May 1943 – 6 November 2004), nicknamed \"Captain Socceroo\", was an Australian soccer player, coach, administrator and broadcaster, as well as a writer. ==Early life== Warren grew up in the suburb of Botany in Sydney. He had two older brothers: Geoff and Ross. ==Soccer career== Warren played for three different soccer clubs during his career (two in Australia and one in England), as well as for the Australian national team (nicknamed the \"Socceroos\") from 1965 until 1974, scoring seven goals. During his managing career, he managed two different clubs (both in Australia). ==Personal life, illness and death== In 1967, Warren married Marion Wilson, but they divorced in 1969. He later married Maryana, who was originally from Uruguay. In 1997, his first wife, Marion, went missing. For a lot of his life, he smoked a lot. In 2003, he announced that he had lung cancer. A few months later he was awarded the FIFA Centennial Award of Merit by FIFA president Sepp Blatter for his contributions to soccer in Australia. Warren's last public appearance was when the A-League was launched to replace the National Soccer League (NSL). In 2003, Warren died at Royal Prince Alfred Hospital in Sydney. A full state funeral was held for him, making him the first ever Australian sportsperson to have a full state funeral. ==Impact== Warren is still regarded as one of the most important figures of all time in Australian soccer. He really liked soccer and he worked hard to make the sport more popular in Australia. The Johnny Warren Medal in the A-League (the highest national soccer league in Australia and New Zealand), which is named after him, is awarded to the best A-League player in each season. ===I told you so!=== Warren was well known for his catchphrase \"I told you so!\". A few months after Warren died, the Socceroos defeated Uruguay during a penalty shootout and made it to the 2006 FIFA World Cup, making it the first time since 1974 (32 years before 2006) and only the second time in history that Australia made it to the FIFA World Cup. SBS analyst and former Socceroo Craig Foster shouted \"Johnny Warren! They've done it!\" live on air immediately after Australia won. During the 2006 FIFA World Cup, the phrase \"I told you so!\" appeared on the scoreboard in the backdrop of the SBS World Cup studio. Since 2006, the quote has become well-known and widely used by soccer fans in Australia, especially at international events such as the FIFA World Cup and the FIFA Women's World Cup. Australia left the Oceanian Football Confedetion (OFC) and joined the Asian Football Confederation (AFC) in 2006 and Australia has qualified for every FIFA World Cup and every FIFA Women's World Cup ever since (as well as having co-hosted the 2023 FIFA Women's World Cup with New Zealand). ==Books== * Sheilas, Wogs and Poofters: An Incomplete Biography of Johnny Warren & Soccer in Australia ==References== Category:1943 births Category:2004 births Category:Australian men's soccer players Category:Soccer players from Sydney Category:Australia at the 1974 FIFA World Cup",
 "title": "Johnny Warren"
}