{
 "id": "1047186",
 "text": "There were a number of incidents in Iranian schools, where schoolgirls reported that they did not feel well. Later, it was claimed they had been poisoned.In English, these cases are called Iranian schoolgirls mass poisoning reports. They have been classfied as chemical attacks. The ways in which this was done were not always the same. It is not known who carried out these attacks. These events started in November 2022, at the Isfahan University of Technology. There were thousands of cases in the following months. In early March, Iran's government announced that more than 100 arrests had been made in connection with the incidents. Iranian health authorities announced that most of the reported attacks were due to stress, anxiety, and other psychological factors. Some people have said it might have been a case of Mass psychogenic illness. The situation is similar to other claimed mass 'poisonings' of young girls which were due to MPI, in Afghanistan, the occupied West Bank, and other locations in the world throughout history. Researchers, human-rights groups and some governments have asked for an independent investigation to find the exact cause of the incidents.. On 29 April 2023, the Iranian Intelligence Ministry released the findings of a comprehensive investigation: It concluded that the reported illnesses were not caused by any toxic substances. Instead they have been due to a variety of reasons including exposure to a variety of non-toxic substances, mass hysteria, and malingering. == Proposed explanations == There have been different explanations: * The government wants to seek revenge for the protests against compulsory hijab. These protests became bigger with the death of Mahsa Amini; * There are hardliners, who want to establish a rule similar to that of Afghanistan's Taliban. It might also be a group similar to Nigeria's Boko Haram, who tried to stop parents from sending their girls to school. * There may be \"foreign enemiers\" of the Islamic Republic of Iran, who want to denigrate it. * Robert Bartholomew suggested that the people affected may have been suffering from \"mass psychogenic illness\". (also called mass hysteria). There were similar cases in Afghanistan between 2009 and 2016. There was the 1983 West Bank fainting epidemic. In all of these cases young Islamic girls fell ill from a mystery condition that was attributed to poison gas after someone drew attention to an unusual odor. In the Afghanistan case, other studies have also concluded that the affected girls, who were attending schools in defiance of the Taliban, were suffering from mass psychogenic illness. * Simon Wessely of King's College indicated that key epidemiological factors indicate that this is likely a case of mass hysteria. Some of these factors are the way the cases spread across Iran, that most people were young, and all had the same gender. Most of them also recovered quickly. * Dan Kaszeta, chemical weapons expert at the Royal United Services Institute, said that the incidents have similarities with a series of unproven poisonings in Afghan schools in the 2010s. Alastair Hay, professor of environmental toxicology at the University of Leeds, reviewed blood tests results from Iranian girls suspected of being poisoned, and found no evidence of toxins. Kaszeta and Hay also told Nature.com that they have not ruled out that the Iranian situation is yet another episode of mass psychogenic illness. John Drury, a psychologist at the University of Sussex, told Nature.com that previous poison scares \"led to symptoms such as nausea, fainting, and hyperventilation\" and that \"it is hard to distinguish between psychogenic effects and exposure to actual hazards.\" * On an interview on Voice of America's Persian service, Sina Foroutannejad a chemical expert at the Polish Academy of Sciences said after reviewing reports from affected children he had concluded that the chemical agent could not be home made. Students reported experiencing paralysis. One student developed symtoms similar to diabetes. He said that the chemical is an organophosphate compound. According to him, it might be Soman. == References == Category:2020s in Iran Category:Violence against women",
 "title": "Iranian schoolgirls mass poisoning reports"
}