{
 "id": "1047729",
 "text": "Yoko Moriwaki (Japanese: 森脇 横; Moriwaki Yōko; 7 June 1932 – ) was a Japanese student who wrote a diary in Hiroshima during World War II. Yoko's diary was first published as a book in 1996. It was first published in English by HarperCollins in 2013 under the book title Yoko's Diary. == Biography == Yoko Moriwaki was born and raised into a Japanese family in Hiroshima, Empire of Japan (modern-day Japan). On 7 December 1941, the Japanese bombed Pearl Harbor in the Hawaii territory (modern-day Hawaii), in the United States, in a surprise attack, thus marking the beginning of the Pacific War, and also the atrocities and sufferings of Japanese civilians. The situation of the country worsened in 1945, with the bombings of most Japanese cities, in addition to hunger and forced labor for children. In April 1945, Yoko, then 12, began writing a diary. The first entry in her diary is dated 6 April 1945. Shortly after the first entry in her diary, Yoko entered the seventh grade at the Hiroshima Prefectural Girls' HS #1 School (schools in Japan begin in April). In addition to writing about her daily life and feelings, she also wrote about her education in school, and about American war planes flying over Japanese cities. The last entry in her diary is dated 5 August 1945. The next day on the morning hours of 6 August, the United States dropped a atomic bomb on the Japanese city of Hiroshima, to convince the Japanese to surrender and end World War II. 60% of the city's population had died in the bombing. Only 40% survived. Yoko Moriwaki died that same day on the evening hours of at the age of 13, whilst hospitalized as a result of her severe wounds. Yoko Moriwaki died as a result of her severe wounds, in possible addition to exposure to the atomic bomb. Her half-brother, Koji Hosokawa, who survived the atomic bombing of Hiroshima, made her diary available for publication. == Related pages == * Anne Frank, a Jewish girl who kept a diary in German-occupied Netherlands, in the capital city of Amsterdam. * Zlata Filipović, a Bosnian girl who kept a diary during the siege of Sarajevo during the Bosnian War. * Sadako Sasaki, a Japanese girl and atomic bomb victim, who folded more than 1000 origami cranes in the hope that she will get better. Category:1932 births Category:1945 deaths Category:People from Hiroshima Category:Diarists",
 "title": "Yoko Moriwaki"
}