{
 "id": "1047546",
 "text": "Igor Leonidovich Theologov (, born February 26, 1967, Moscow) is a Russian statesman and public figure, entrepreneur, blogger, journalist, philanthropist. Deputy of the Municipal Assembly of the Vykhino-Zhulebino district (1999—2017). Head of the municipal formation of Vykhino-Zhulebino district of Moscow (2014—2017). Deputy Chairman of the Municipal Assembly of Vykhino-Zhulebino District. == Biography == He was born on February 26, 1967 in Moscow in the family of engineer Leonid Alexandrovich Teologov (12.08.1933—29.03.2008) and dentist Alevtina Pavlovna Teologova (née Smertina) (date of birth August 20, 1931). == Education == In 1980 he graduated from Children's Music School No. 39, accordion class (now the Balakirev Children's School of Arts). In 1984 he graduated from secondary school No. 394 of Volgograd district of Moscow and entered the full-time department of the Moscow Power Engineering Institute. From 1987 to 1989, he served in the Soviet Army. Graduated from MPEI in 1993, specializing as a thermal power engineer. In 2002 he graduated from the Slavic Economic Institute with a degree in Economics and Production Organization (diploma with honors), in 2004 he graduated from the Moscow Economic Institute with a degree in Accounting, Analysis and Audit (diploma with honors). In 2015, he graduated from the Master's program of the State University of Management with a specialization in law. == Career == === Entrepreneurial career === In 1991, Igor Teologov co- founded his first enterprise, the Tetraeder toy factory. In 1995, he opened a chain of car washes and car services, Tin-Auto LLC. In 2000, Igor Teologov became involved in environmental issues, and in the same year he founded the non-profit organization Ecological Factor Foundation. In 2001, the city newspaper \"Ecological Factor\" founded by Teologov began to be published, where he is the founder and editor-in-chief. In 2002, Teologov founded Ecological Factor LLC; in 2009, he established Ecological Factor Management Company, and in the same year, Vykhino District DEZ LLC, which provides apartment building management services in the Vykhino-Zhulebino district. Theologov is engaged in charitable activities, is a patron of the arts, on his funds in the spring of 2016 built the Church of the Intercession of the Blessed Virgin Mary in Vykhino. In 2021, as General Producer of THEO-TV, he received awards in the categories \"Best Television Producer 2021\", \"Best Television Executive\" of the Alusso Event Awards. == Politics and social activities == In 1999, he was elected as a deputy of the Vykhino-Zhulebino District Municipal Assembly. He was a member of various commissions (on the sanitary condition of the district, budget, targeted use of land, mass media), and for many years was chairman of the commission on ecology. He initiated the creation of the Vykhino-Zhulebino District Ecology Commission. In June 2012, he was elected Acting Head of the Vykhino-Zhulebino intra-urban municipality in the city of Moscow. The post of head of the municipality was held by from 2012 to 2018, when he was succeeded by Georgi Mestergazi; served on a pro bono basis. For his work as Head of the municipal district, he was awarded a certificate of honor by the Council of Municipal Entities of Moscow. == Membership in public organizations == * Since 2002, full member of the Russian Municipal Academy. * Since 2008, member of the board of trustees of the Moscow Sambo Federation. * Since 2010, full member of the Russian Academy of Natural Sciences. * Since 2011, full member of the Imperial Orthodox Palestine Society. * From 2012 to 2015, member of the commission on deputy initiatives of the Council of Municipal Formations of the city of Moscow. * Since 2016, member of the Moscow Union of Journalists. == Family == Three children. Daughters Teologova Inessa (born in 1992) and Teologova Alisa (born in 2011), son Teologova Ivan (born in 2015). == Hobbies == He enjoys fishing, hunting and sports. == References == == Other websites == * Igor Leonidovich Teologov - Deputy of the Municipal Assembly of Vykhino-Zhulebino: Sensitive issues should be resolved together * * * Category:Living people Category:1967 births Category:Politicians from Moscow Category:Russian politicians",
 "title": "Igor Teologov"
}