{
 "id": "1047835",
 "text": "Evika Siliņa (born 3 August 1975) is a Latvian politician who has been the 24th Prime Minister of Latvia since September 2023. She was Minister of Welfare and Member of the Saeima. ==Early life== Siliņa was born in Riga, Latvia on 3 August 1975. She studied law at the University of Latvia and at the Riga Graduate School of Law. From 2003 to 2012, Siliņa worked as a solo attorney focused on international and domestic business law. She also provided legal services to telecommunications and internet companies and helped establish and advise non-governmental organizations during this time. ==Priemership== On 16 August 2023, after the resignation of Krišjānis Kariņš, New Unity nominated Siliņa as candidate for prime minister. On 24 August, she was asked by President Edgars Rinkēvičs to form a government. On 29 August, United List said they did not want to be a part of a four-party coalition government after an offer by Siliņa. On 1 September, Siliņa said that she wanted to create a new parliamentary majority with the Union of Greens and Farmers (ZZS) and The Progressives (P). Twelve days later she created a new government, in which New Unity (JV) had seven ministries, ZZS four and P three, with Arturs Krišjānis Kariņš hired as Minister of Foreign Affairs. The government coalition led by Siliņa won the confidence of the parliamentary majority in the Saeima on 15 September 2023, winning 53 votes. Siliņa said that she supports the Russian-speaking minority in the country and creating an education system based on the Latvian language. She also wanted to increase the military budget and complete the construction of the barrier on the country's border with Russia and Belarus. Siliņa is the second woman to become prime minister of Latvia. ==Personal life== Siliņa is married to Aigars Siliņš. They couple have three children. == References == Category:Prime Ministers of Latvia Category:1975 births Category:Living people Category:Current national leaders Category:Politicians from Riga",
 "title": "Evika Siliņa"
}