{
 "id": "1047005",
 "text": "Arguin (, ) is an island off the western coast of Mauritania in the Bay of Arguin. It has big and dangerous reefs around it. The island is now part of the Banc d'Arguin National Park. ==History== The island was owned by a lot of different countries during the colonial era. The first European to visit the island was the Portuguese explorer Nuno Tristão in 1443. In 1445, Prince Henry the Navigator built a trading post on the island. The trading post got gum arabic and slaves for Portugal. By 1455, 800 slaves were shipped from Arguin to Portugal every year.Slave Routes - Europe Portugal . New raw archival- sourced data regarding Arguin slave trade in the early sixteenth century have been released in Ivana Elbl, \"Sand and Dreams: Daily Slave Purchases at the Portuguese Coastal Outpost of Arguim (Mauritania) (1519-1520) ~ Full Raw Serialized Data plus Archival Analysis Annotations,” Portuguese Studies Review 30 (1) (2022): 325-354. The data very simply supersedes other obsolete listings and / or previous unfounded speculations (\"estimates\"), for the period in question. Available on academia.edu.https://trentu.academia.edu/ivanaElbl Consulted 29 May 2023. In 1633, during the Dutch-Portuguese War, the Netherlands took over Arguin. It remained under Dutch rule until 1678, with the English owning it for a small amount of time in 1665. France took over the island in September 1678, but it was then abandoned until 1685. Arguin's aridity and it not having a good anchorage made it hard for the Europeans to live there. In 1685, Captain Cornelius Reers of the frigate occupied the old Portuguese fort on the island. He made a treaty with the native king in which Brandenburg was accepted as a protecting power. The treaty was ratified in 1687 and was renewed in 1698. Arguin remained a colony of Brandenburg until 1721 when the French successfully attacked the fort and then took over the island. The Dutch took the fort and island from the French the following year only to lose it again in 1724 to the French. This period of French rule lasted four years. In 1728, the indigenous peoples got control of the island. The island was included in the territory of the French colony of Mauritania, and it stayed Mauritanian when the country became independent in 1960. ==References== Category:Geography of Mauritania Category:Islands of Africa",
 "title": "Arguin"
}