{
 "id": "1047715",
 "text": "The E Line, named the Expo Line before 2019, is one of the six train lines part of the Los Angeles Metro Rail system. It stops at 29 light rail stations going from Santa Monica to East Los Angeles. The E Line's first stations from Downtown Los Angeles to the Westside opened in 2012. In 2023, the Regional Connector tunnel extended the line east from Downtown Los Angeles to East Los Angeles. It is the line's latest expansion. == History == The E Line was built on the path of the Los Angeles and Independence Railroad. The train route transported people and freight west from Los Angeles to Santa Monica since 1875. Passenger service stopped in 1953, and freight service stopped in 1988. This happened because fewer people were using transit as cars became more popular. The tracks on the railroad were also older than other nearby lines. A group called Friends 4 Expo Transit convinced Los Angeles Metro to buy the land of the old train route to build a new light rail line. Metro listened and later released a Major Investment Study in 2000 to compare bus and light rail transit options. Metro eventually decided to build a light rail line along that corridor. The project was built in two phases by the Exposition Metro Line Construction Authority. The first phase went from Downtown Los Angeles to Culver City, and it started construction in 2006. The second phase went from Culver City to Santa Monica. That phase started construction in 2012. The light rail line later became known as the Expo Line. The first 10 stations of the Expo Line from 7th Street/Metro Center to La Cienega/Jefferson station opened on April 18, 2012. On June 20, 2012, two more stations opened, expanding the line to Culver City. On May 20, 2016, the second phase finished construction, adding 7 stations west to Downtown Santa Monica. The line was renamed to the E Line in late 2019. The E Line continued to expand with another project called the Regional Connector tunnel. It opened on June 16, 2023. It added two new underground stations in Downtown Los Angeles. The project also connected the E Line to the track of the L Line at the eastern end of the underground tunnel. This allowed the E Line to reach East Los Angeles, using tracks and seven stations that the L Line served. Once this happened, the L Line stopped operating. In 2035, the E Line is planning to get another eastern expansion with the Eastside Transit Corridor Phase 2. It will extend the line from East Los Angeles to Whittier. == Operations == === Service === The E Line begins service at 4:30 a.m. and ends around 11:45 p.m. each night. During the day, trains on weekdays are scheduled to come every 8-10 minutes. Trains on the weekends are scheduled to come every 10 minutes. In the early mornings and late nights, trains are scheduled to come every 20 minutes. === Rolling stock === The rolling stock (trains) used on the E Line are called the Kinki Sharyo P3010. Metro operates those trains with three cars on weekdays and two on weekends, except for weekend days with big city events. The E Line is operated out of two divisions, a place for the maintenance or storage of the system's rolling stock. Division 14 is located right next to the line in Santa Monica. It opened in 2016 when the second phase of the E Line (Expo Line) opened. Division 21 is in Chinatown between Elysian Park and the Los Angeles River. To access it trains travel on the A Line tracks from Little Tokyo/Arts District station to the north of Chinatown station. The division was originally opened in 2003 for the A Line but is not used by A Line trains anymore. == Stations == The E Line stops at 29 stations from Downtown Santa Monica to Atlantic station. Most of those stations are above ground, however six of them are underground. The E Line shares the same station platform with the A Line at five stations in Downtown Los Angeles. The following table is the complete list of stations, from west to east: Stations Opened Neighborhood Connections Downtown Santa Monica May 20, 2016 Santa Monica 17th Street/SMC 26th Street/Bergamot Expo/Bundy West Los Angeles Expo/Sepulveda Westwood/Rancho Park Los Angeles (Rancho Park) Palms Los Angeles (Palms) Culver City June 20, 2012 Culver City La Cienega/Jefferson April 28, 2012 Los Angeles (West Adams) Expo/La Brea Farmdale June 20, 2012 Expo/Crenshaw April 28, 2012 Los Angeles (Jefferson Park) K Line Expo/Western Los Angeles (Exposition Park) Expo/Vermont Expo Park/USC Los Angeles (University Park) Jefferson/USC LATTC/Ortho Institute Los Angeles (North University Park) J Line Pico July 14, 1990 Downtown Los Angeles A Line J Line 7th Street/Metro Center February 15, 1991 A Line B Line D Line J Line Grand Avenue Arts/Bunker Hill June 16, 2023 A Line J Line Historic Broadway A Line Little Tokyo/Arts District November 15, 2009 Los Angeles (Little Tokyo/Arts District) A Line Pico/Aliso Los Angeles (Boyle Heights) Mariachi Plaza Soto Indiana East Los Angeles Maravilla East LA Civic Center Atlantic ==References== Category:Transport in California Category:Light rail",
 "title": "E Line (Los Angeles Metro)"
}