{
 "id": "1048660",
 "text": "A leather jacket is a short coat that people usually wear over their other clothes. It's made from the skin of animals that has been treated and turned into leather. Leather jackets are often black or different shades of brown, but they can come in many colors. People wear leather jackets for various reasons, and different groups like greasers, motorcyclists, bikers, mobsters, military pilots (especially after World War II), and fans of certain music styles (like punks, goths, metalheads and rivetheads) have worn them for protection, fashion, or to look tough. Today, most leather jackets are made in countries like Pakistan, India, Canada, Mexico, and the United States. They use the leftover animal skins from the meat industry to create the jackets. Some people also use fabrics that look like leather, such as polyurethane or PVC, instead of real animal leather. They do this for different reasons like if they follow a vegan lifestyle or want a more affordable option, as synthetic materials are usually cheaper than real leather. == History == In the early 1900s, aviators and soldiers in the military wore brown leather jackets. During World War II, these jackets were often called 'bomber jackets' because they were warm and had good insulation. Pilots wore them to stay warm at high altitudes. These jackets were usually part of a uniform that protected bomber pilots from the cold. They often had sheepskin inside to keep them warm. In Russia, during the Russian Civil War, Bolsheviks and later members of the Cheka, which was a government agency, often wore leather jackets. This became a kind of uniform, and it's said that Yakov Sverdlov started this tradition. Leon Trotsky, \"Jacob Sverdlov,\" 1925. == Popularity == In the second half of the 1900s, leather jackets became very famous and widely accepted because they were linked to Hollywood. Many movie stars in the 1940s and 1950s, like Jimmy Stewart and Gary Cooper, made these jackets popular in their films. Leather jackets were used in movies to make characters look cool. For example, Marlon Brando wore a Perfecto motorcycle jacket in The Wild One in 1953. This made leather jackets popular among American youth, especially in the 1950s and early 1960s. Later, TV shows like Happy Days and movies like Grease continued to show leather jackets as a symbol of coolness. Flight jackets, like the ones seen in Top Gun in 1986, also stayed fashionable for a long time. In the 1990s, there was a short trend where people wore leather jackets with an eight-ball pattern. Sometimes, this style comes back as a retro fashion. == Material == Leather jackets are usually made from the skin of animals such as antelope, buckskin, goatskin, sheepskin, horsehide, and cowhide. After the skin is removed from the animal at a meat processing plant, it's kept cold, covered in salt, or placed in barrels with a salty liquid. Then, it's sent to a tannery where the skin goes through several processes to preserve it and make it soft. Other materials like thread, lining, seam tape, buttons, snaps, and zippers are typically bought from different suppliers and stored in the factory where the jackets are made. == In popular culture == Many famous leather jackets have been worn by characters in movies and TV shows. For example, American actor Gary Cooper wore one as a guerrilla fighter in the Spanish Civil War in the movie For Whom the Bell Tolls. == Gallery == File:A-2 Jacket.jpg|An A-2 U.S. regulation bomber jacket File:Untilting an Intentional camera tilt with posing of the model - example in fashion photography for filling the frame - ModelTanja.jpg|A model wearing a leather jacket File:Young punk US-c1984.jpg|Punks wearing leather jackets in Evansville, Indiana ca. 1984 File:Black Faux Leather Moto Jacket with Bright Red Hair and Houndstooth Winter Shorts (23062524903).jpg|A young girl wearing leather jacket File:Motorcycle rider and passenger in leathers on Suzuki Bandit at Ace Cafe.jpg|Motorcycle pillion passenger wearing a two-piece leather suit styled with a short jacket == References == Category:Clothing Category:Tops (clothing) Category:Protective clothing",
 "title": "Leather jacket"
}