{
 "id": "1048083",
 "text": "901 (CMI) was a common year starting on Thursday. == Events == === By place === ==== Europe ==== * February - King Louis III (Louis the Blind), was crowned as the Holy Roman Emperor by Pope Benedict IV in a ceremony held in Rome. However, his rival, Berengar I, looked for a safe place in Bavaria and was welcomed at the court of King Louis IV (Louis the Child). * March - Abu Abbas Abdallah continues his military effort against the Byzantine territories in Sicily. He sends his ships towards Messina and attacks/bombs the walls of Damona town with weapon.Italian History: Timeline - Lombard Leagues Board history-timeline?page=10. * June 10 - Abu Abbas Abdallah crosses over the Messina Strait and goes to Reggio Calabria. When he arrives, the Byzantine soldiers run away, allowing the Aghlabids to take control of the city. * Summer - Abu Abbas Abdallah won a battle against a group of ships from Constantinople in Sicily. After the fight, he took over Messina and moved the treasure to Palermo. * July 10 - Battle of Zamora: In Al-Andalus, Ibn al-Qitt and Abū Naṣr ‘Abd Allāh ibn ‘Alī al-Sarrāj call for a small jihad, but are defeated by King Alfonso III. ==== Britain ==== * FallAnglo-Saxons.net : Edward the Elder . - Æthelwold (a son of Æthelred I) rebels against his cousin, King Edward the Elder. He comes with a fleet to Essex, and encourages the Danish Vikings of East Anglia to rise up. * Edward is declared the king of the Anglo-Saxons. His mother, Ealhswith, who was previously a queen, creates a nunnery called Nunnaminster in Winchester and lives a religious life there. * The first written mention is made of Shrewsbury (West Midlands). ==== Arabian Empire ==== * February 18 - Thābit ibn Qurra, who worked as an court astronomer for the Abbasid Caliph Al-Mutadid in Baghdad, passes away. He spent his life translating and teaching the works of Greek mathematicians as well as his own. * Abu 'Abdullah al-Shi'i leads a rebellion of the Kutama Berbers who were followers of the Shiʿite Fatimids against the ruling Aghlabid emirate in Ifriqiya, which is present-day Tunisia. ==== Asia ==== * January 24 - After being briefly removed from power by General Liu Jishu, Emperor Zhao Zong of the Tang Dynasty was reinstated as the ruler of China. Four eunuch family members of Liu Jishu were killed during this process. * January 25 - Sugawara no Michizane, a poet from Japan, was removed from his aristocratic rank and was exiled to a less important government job in Dazaifu (Chikuzen Province). * A rebel leader named Gung Ye established the Hu Goguryeo Kingdom by defeating other local rulers in the Korean Peninsula and declaring himself as the king. * The city of Fuzhou in China's Fujian Province was expanded with the construction of a new city wall called \"Luo City.\" * Abaoji was elected as the chieftain (leader) of the Yila tribe and was appointed as the commander of all Khitan military forces. * Abaoji is elected chieftain of the Yila tribe and becomes commander of all Khitan military forces. ==== Mesoamerica ==== * The Maya ruler Lord Chac dedicated the Mesoamerican ballgame court at Uxmal in modern-day Mexico. * The Toltecs settle in Tula and make it their capital after Teotihuacan's decline (estimated time period). === By topic === ==== Religion ==== * January -Arethas of Caesarea delivers a speech on the feast day of Epiphany. This leads to his appointment as the official rhetorician at the Byzantine court of Emperor Leo VI (the Wise) in Constantinople. Later, he is nominated to serve as the Archbishop of Caesarea in Cappadocia. * March 1 - Nicholas Mystikos, a layman who was a friend of Photios, becomes Patriarch of Constantinople. == Births == * Biagota, considered as the wife of duke Boleslaus I of Bohemia == Deaths == * January 24 – Liu Jishu, general of the Tang Dynasty * February 12 – Antony II, patriarch of Constantinople * February 18 – Thābit ibn Qurra, Syrian astronomer and physician (birth: 826) * April 12 – Eudokia Baïana, Byzantine empress and wife of Leo VI * July 8 – Grimbald, Frankish Benedictine monk (birth: 820) * November 10 – Adelaide, queen of the West Frankish Kingdom * Guaimar I of Salerno, Lombard prince * Lady Shuiqiu, wife of Qian Kuan * Lei Man, warlord of the Tang Dynasty * Muhammad ibn Abi'l-Saj, Abbasid general * Ubayd Allah ibn Sulayman, Abbasid vizier * Wu Renbi, Chinese Taoist and writer * Xu Yanruo, chancellor of the Tang Dynasty == References == Category:901",
 "title": "901"
}