{
 "id": "1048074",
 "text": "Subject librarians (sometimes called specialist librarians or academic liaison librarians or bibliographers in US-English) are librarians who are in charge a particular academic subject in a library, like maths or linguistics. Subject librarians usually work in academic libraries and special libraries (like legal libraries or medical libraries), but also sometimes large non-academic libraries like a national or state library. In academic libraries, they work with the teachers who teach their special subject to make sure the library has good resources (like books or journals) for their subject, including books teachers tell the students to read. Subject librarianship started in the 1960s, when schools and universities began to spend more money on their libraries. == Education == Subject librarians need both academic knowledge of their special subject and skills in library science. Some people think that formal education in the special subject is very important to be a good subject librarian but other people think it is not necessary. In Australia, most subject librarians have an undergraduate degree in their special subject and more education in an library sciences course, like a Master of Information Management. == Responsibilities == Subject librarians usually not work at the enquiry desk, but they sometimes answer questions online that library users ask about the librarians special topic. === Collection management and development === Having knowledge in a special topic gives a subject librarian extra skills that a general librarian might not have. They can know what resources are best for students and researchers. Subject librarians manage the collection of their special subject, which can include getting new materials labelling and sorting subtopics weeding (getting rid of) out-of-date resources, or resources that people don't use anymore. === Liaison with academic staff === Subject librarians are sometimes called \"academic liaison librarian\" because they liaison (communicate) with proffesors and teachers. This can include: * Helping teachers choose what they tell their studetns to read, based on what is already at the library * Deciding if a resource should be added to the library * Providing online resources * Encouraging professors to tell students about the library * Helping students and researchers find resources on a subject === Education === Having knowledge about their special subject and what information students can find in the library means subject librarians can be helpful to create classes and course plans in a university or school. == References == Category:Education occupations Category:Libraries",
 "title": "Subject librarian"
}