{
 "id": "10489",
 "text": "Vanuatu is a country in the Pacific Ocean. The official languages of Vanuatu are Bislama, English and French. In 2020, 300,019 people lived in Vanuatu. The capital of Vanuatu is Port Vila. The country was ruled as a colony by England and France. It got its independence in 1980. During the colonial time, it was named the \"New Hebrides\" or \"Nouvelles Hebrides\". == History == Evidence shows, that people lived in Vanuatu by 1300 BC. Portuguese explorer Pedro Fernández de Quirós first discovered the islands in 1606. British explorer, navigator James Cook discovered the islands in 1774. Cook mapped the islands and named them New Hebrides. ==Geography== Vanuatu is an island archipelago. It has about 82 small islands. The islands were made from volcanoes. People live on 65 of the islands. There is about north to south distance between the outermost islands. Two of the islands (Matthew and Hunter) are also claimed by France. Fourteen of Vanuatu's islands are larger than . The highest point in Vanuatu is Mount Tabwemasana, at , on the island of Espiritu Santo. ===Flora and fauna=== Even though it has tropical forests, Vanuatu has a small number of plant and animal species. There are no large mammals. The 19 species of native reptiles include the flowerpot snake, found only on Efate. The Fiji Banded Iguana (Brachylophus fasciatus) was introduced as a feral animal in the 1960s. There are 11 species of bats and 61 species of land and water birds. The region is rich in sea life. There are more than 4,000 species of marine molluscs. Coneshell and stonefish carry poison that will kill humans. The giant East African land snail arrived only in the 1970s but already has spread from the Port-Vila region to Luganville. There are three or possibly four adult saltwater crocodiles living in Vanuatu's mangroves and no current breeding population. It is said the crocodiles reach the northern part of the islands after cyclones. This is because of the island chain's closeness to the Solomon Islands and New Guinea, where crocodiles are very common. ===Cuisine=== The national dish of Vanuatu is the lap lap.The secrets of Vanuatu's national dish, the Lap Lap ==Locations== There are six provinces in Vanuatu. They are Malampa, Penama, Sanma, Shefa, Tafea and Torba. Some of the cities are: *Bunlap *Forari *Ipikil *Ipota *Isangel *Lakatoro *Lamap *Loltong *Longana *Lorevilko *Luganville *Lénakel *Port Olry *Port Vila - Capital *Rovo Bay *Sola *Sulphur Bay *Whitesands == Famous People From Vanuatu == Adele Willie is a sports commentator. == Gallery == Image:Vanuatu Tanna Yasur.JPG|Cinder plain of Yasur volcano on Tanna island. Image:National Cultural Centre, Vanuatu.jpg|National Cultural Centre, Port Vila. Image:National Council of Chiefs, Vanuatu.jpg|National Council of Chiefs, Port Vila. Image:A stream on Efate, Vanuatu.jpg|Stream on Efate island. Image:Street_band,_Port_Vila,_Vanuatu_-_Flickr_-_PhillipC.jpg|Port Vila street band. Image:Port Vila aerial.jpg|Aerial view of Port Vila. Image:Feuerreiben.gif|Early fire-making technique in Vanuatu. Image:Commercial agriculture, North Efate.jpg|North Efate. ==References== Category:Commonwealth member states Category:1980 establishments in Oceania Category:English-speaking countries Category:French-speaking countries",
 "title": "Vanuatu"
}