{
 "id": "1048322",
 "text": "Pieces are a type of graffiti. Their name is short for \"masterpieces\". Pieces are a big and very detailed type of graffiti made with letters. They are one of the main types of modern graffiti, along with tags and throw ups. People who usually don't like graffiti are less likely to dislike pieces and people are less likely to call them vandalism. Because they are so large, pieces are usually made with spray paint, but people also use paint rollers. == Form == Pieces are usually big, and have many different colours. They often have a background, and different shades. They sometimes have extra bits on to make them look nice, and are sometimes made to look 3D or have cartoons on or next to them. Because they are big and have a lot of detail, pieces take a long time to paint and design. This means pieces are more likley to be in places where it is legal to paint them. Illegal pieces are usually in places where there aren't many people, like train yards, tunnels, drains, the top of a building, or walls facing train tracks. Illegal pieces in busy places might be done over more than one night, or by many people at the same time. It can be hard for many people to tell what letters are in some pieces. Straight-letters are a type of piece with letters that are clear and easy to read, and wildstyle pieces have letters with unusual shapes and extra bits attatched, which can make them very hard to read. Some writers like that wildstyle is hard to read because it means only other writers can read them. Sometimes when a writer wants people to know they made the piece, they will write their Tag and their crews tag next to it. == History == People first notices pieces in the 1980s on trains in the New York Subway, but the metro decided not to send painted trains out because they didn't want people to write on the trains anymore. This made writers go and write in other places isntead of the trains. People are more likely to call pieces \"art\". Since the later 2000s, sometimes business with pay people to do pieces that advertise them and local governments will pay people do do pieces in places they don't want other less popular types of graffiti, like tags. This works because most graffiti writers don't write over another writers piece. == References == Category:Graffiti",
 "title": "Piece"
}