{
 "id": "1048792",
 "text": "Eyelar Mirzazadeh (Amsterdam; Netherlands; 16 December 1993) is a Dutch songwriter and artist based in London, UK. For her own music, she performs under her first name, Eyelar and is signed to RCA Records. Her parents are Iranian. ==Life== Eyelar Mirzazadeh was born in Amsterdam on 16 December 1993. She grew up in a musical household. Her family roots are in Iran and she grew up with Persian music. As a child, she entertained guests at house parties with her singing and improvised dancing. Later, influences from contemporary R&B; and hip-hop were added. At the age of 16 she appeared on Dutch television to the music of Mary J. Blige. Shortly thereafter she reached the semi-finals of The Voice of Holland. Eyelar made her name in the late 2010s, featuring on a variety of electronic dance tracks before developing her own grunge- and emo-laced pop sound, which she introduced on the 2019 solo single \"Voices.\"Eyelar auf top40.nl, abgerufen am 27. März 2022 (niederländisch) ==Purple Disco Machine - Dopamine== \"Dopamine\" is a song by German disco and house music producer and DJ Purple Disco Machine featuring Eyelar, released on 27 August 2021 as a single from Purple Disco Machine's second studio album Exotica. The song has received over 75 million streams on Spotify. == Fred again.. - Actual Life 3 == Eyelar featured and prominently contributed to Fred Again..s ' Actual Life 3' record. The album won best dance/electronic album at the GRAMMYs in 2024. In an Instagram post Fred again.. noted that 'Shutters', featuring Eyelar was the first song finished on Actual Life 3 and that it was finished on London's underground. == References == *The information in this article is based on that in its German Wikipedia equivalent. == Other websites == * * Eyelar on TikTok * Eyelar on Youtube * Eyelar on Spotify * Eyelar on Twitter == Writing Credits == Artist Track Title Release Year Album Written By Produced By Sevdaliza (with Pabllo Vittar & Yseult) Alibi 2024 N/A Eyelar Mirzazadeh, Mathias Janmaat, Nilusi Nisanka, Number Teddie, Pabllo Vittar, Reynard Bargmann, Rodrigo Gorky, Sevda Alizadeh, Summer Disbray, Will Knox, Yseult Onguenet N/A Raye Buss it Down. 2023 My 21st Century Blues Mike Sabath, Rachel Keen, Antoinette Smith, Eyelar Mirzazadeh Mike Sabath, Rachel Keen, Pete Miller Demi Lovato Anyone 2020 Sam Roman, Badriia \"Bibi\" Bourelly, Dayyon Alexander, Demi Lovato, Eyelar Mirzazadeh, Jay Mooncie Dayyon Alexander Charli xcx feat. Lil Yachty After the Afterparty 2016 N/A Charli xcx, Mikkel Eriksen (of Stargate), Raye, Tor Erik Hermansen, Eyelar Mirzazadeh, Fred Gibson, Lil Yachty, Mikkel Storleer Eriksen Fred Gibson, Stargate Little Mix Told You So 2018 LM5 Rachel Keen, Uzoechi Emenike, Eyelar Mirzazadeh MNEK Yellow Claw Roller 2015 Blood For Mercy Max Oude Weernink, Eyelar Mirzazadeh, Jim Taihuttu, Leo Roelandschap, Nils Rondhuis Jim Taihuttu, Leo Roelandschap, Max Oude Weenink, Nils Rondhuis Category:21st-century Dutch singers Category:1993 births Category:Living people Category:Musicians from Amsterdam",
 "title": "Eyelar Mirzazadeh"
}