{
 "id": "1049994",
 "text": "The Eurovision Song Contest 2024 was the 68th edition of the Eurovision Song Contest. Hosted in Malmö, the contest began on 7 May 2024 with the first semi- final. The second semi final took place on 9 May and the grand final took place on 11 May 2024. 37 countries took part in the contest, with Luxembourg participating for the first time in 31 years. The Netherlands were removed because of an incident with production crew at the contest despite having made it through to the finals. The Swedish Police Authority has launched an investigation. The winner was Nemo, representing Switzerland with the song \"The Code\". == Hosting == The contest was held in Malmö, Sweden, following their win at the 2023 contest with the song \"Tattoo\" by Loreen. The hosts are Malin Åkerman and Petra Mede, who hosted in 2013 and 2016. == Changes to the contest == * The EBU (the organisation which owns Eurovision) decided that every year following the 2023 Contest would use the same slogan \"United By Music\". * For the first time, the Big 5 (France, Germany, Italy, Spain and the United Kingdom) and the host country performed in the semi-finals. * Viewers were able to vote from the beginning of the first performance. This was done because many songs which perform earlier in the show do not often place high in the public vote. == Overview == The Grand Final of Eurovision 2024 was planned to have 26 countries taking part. These include the Big 5 (France, Germany, Italy, Spain and the United Kingdom), the host country Sweden and ten countries from each of the two semi-finals. On the day of the Grand Final, the Netherlands was removed from the contest, meaning that there were 25 countries in the final. === Semi-Final 1 === The first semi-final took place on 7 May 2024 at 21:00 CEST. Fifteen countries competed in this semi-final while Germany, Sweden and the UK also performed. Guest performers included past contestants Eleni Foureira, Eric Saade, Chanel Terrero, Benjamin Ingrosso and Johnny Logan, who was the first person to win Eurovision twice. All countries from this semi-final were able to vote, as well as viewers from non- participating countries under one \"rest of the world\" online vote. The ten countries with the most votes qualified for the final. First semi-final of the Eurovision Song Contest 2024 Country Artist Song Points Place 1 Silia Kapsis \"Liar\" 67 6th 2 Teya Dora \"\" 47 10th 3 Silvester Belt \"\" 119 4th 4 Bambie Thug \"Doomsday Blue\" 124 3rd 5 Alyona Alyona & Jerry Heil \"Teresa & Maria\" 173 2nd 6 Luna \"The Tower\" 35 12th 7 Baby Lasagna \"Rim Tim Tagi Dim\" 177 1st 8 Hera Björk \"Scared of Heights\" 3 15th 9 Raiven \"Veronika\" 51 9th 10 Windows95man \"No Rules!\" 59 7th 11 Natalia Barbu \"In the Middle\" 20 13th 12 Fahree feat. Ilkin Dovlatov \"\" 11 14th 13 Electric Fields \"One (One Blood)\" 41 11th 14 Iolanda \"\" 58 8th 15 Tali \"Fighter\" 117 5th === Semi-Final 2 === The second semi-final took place on 9 May 2024 at 21:00 CEST. Sixteen countries took part in this semi-final while France, Italy and Spain also performed their songs. Guest performers included winners from the 1999, 2003 and 2005 contests: Charlotte Perrelli, Sertab Erener and Helena Paparizou. All countries from this semi-final were able to vote, as well as viewers from non-participating countries under one \"rest of the world\" online vote. The ten countries with the most votes qualified to the final. Second semi-final of the Eurovision Song Contest 2024 Country Artist Song Points No. 1 Sarah Bonnici \"Loop\" 13 16th 2 Besa \"Titan\" 14 15th 3 Marina Satti \"Zari\" 86 5th 4 Nemo \"The Code\" 132 4th 5 Aiko \"Pedestal\" 38 11th 6 Kaleen \"We Will Rave\" 46 9th 7 Saba \"Sand\" 36 12th 8 Ladaniva \"\" 137 3rd 9 Dons \"Hollow\" 72 7th 10 Megara \"11:11\" 16 14th 11 Nutsa Buzaladze \"Firefighter\" 54 8th 12 Mustii \"Before the Party's Over\" 18 13th 13 & \"\" 79 6th 14 Eden Golan \"Hurricane\" 194 1st 15 \"\" 43 10th 16 Joost Klein \"\" 182 2nd === Grand Final === The final took place on 11 May 2024 at 21:00 CEST. The finalists included Sweden, the Big 5 and twenty countries which qualified from the semi-finals. A voting system of points was used to determine the winner. Half of the points were awarded by national juries from each participating country and the other half of the points were awarded by televotes from each country plus the \"Rest of the World\" online vote. The winner was Switzerland, with \"The Code\" by Nemo. The trophy was awarded to Nemo by Loreen, who also performed during the interval of the show. Netherlands was removed because of an incident with production crew at the contest despite having made it through to the Finals. The Swedish Police Authority has launched an investigation. Final of the Eurovision Song Contest 2024 Country Artist Song Points Place 1 Sweden Marcus & Martinus \"Unforgettable\" 174 9th 2 Ukraine Alyona Alyona & Jerry Heil \"Teresa & Maria\" 453 3rd 3 Germany Isaak \"Always on the Run\" 117 12th 4 Tali \"Fighter\" 103 13th ~~5~~ ~~~~~~Joost Klein~~ ~~\"\"~~ — — 6 Israel Eden Golan \"Hurricane\" 375 5th 7 Lithuania Silvester Belt \"\" 90 14th 8 Spain Nebulossa \"\" 30 22nd 9 Estonia & \"\" 37 20th 10 Bambie Thug \"Doomsday Blue\" 278 6th 11 Dons \"Hollow\" 64 16th 12 Marina Satti \"\" 126 11th 13 United Kingdom Olly Alexander \"Dizzy\" 46 18th 14 Norway \"\" 16 25th 15 Italy Angelina Mango \"\" 268 7th 16 Serbia Teya Dora \"\" 54 17th 17 Finland Windows95man \"No Rules!\" 38 19th 18 Portugal Iolanda \"\" 152 10th 19 Armenia Ladaniva \"\" 183 8th 20 Cyprus Silia Kapsis \"Liar\" 78 15th 21 Switzerland Nemo \"The Code\" 591 1st 22 Slovenia Raiven \"Veronika\" 27 23rd 23 Croatia Baby Lasagna \"Rim Tim Tagi Dim\" 547 2nd 24 Nutsa Buzaladze \"Firefighter\" 34 21st 25 France Slimane \"\" 445 4th 26 Austria Kaleen \"We Will Rave\" 24 24th == Controversies == === Israeli participation === The decision to allow Israel to compete was controversial because some people argued that they should have been excluded from the contest due to their actions in their conflict with Hamas, much like how Russia was excluded in 2022 for their invasion of Ukraine. The Israeli contestant, Eden Golan, was booed by the crowds during live shows. Several contestants showed their unhappiness over Israel's participation over the course of the contest including Bambie Thug and Iolanda. Additionally, Eric Saade, who performed in semi-final 1, had a keffiyeh around his arm, which Eurovision saw as a political move supporting Palestine and decided not to post footage of his performance on social media. === Dutch removal === On the day before the Grand Final, Dutch contestant Joost Klein was not present in rehearsals. It was later revealed that there was an incident between him and a female photographer. Eurovision decided to remove the Netherlands from the contest while the Swedish Police Authority investigated the situation. == References == == Other websites == * 2024 Category:2024 in music Category:2020s in Sweden Category:2024 in Europe Category:Malmö",
 "title": "Eurovision Song Contest 2024"
}