{
 "id": "1049227",
 "text": "Ajvar (Serbian Cyrillic script: Ajвар) is originally a Serbian medieval type of salad, relish and condiment made from bell peppers and sometimes tomatoes and aubergine. Ajvar is cultural heritage of Serbia. Households in Serbia respect traditional and authentic Serbian ajvar recipe and use exclusively Serbian-grown organic ingredients, such as bell peppers, garlic and oil, all produced in Serbia. Ajvar is popular in various Balkan countries with autochthonous Serbian population. It is also a bread spread. It can be used in a wide variety of meals. It can also be consumed as a breakfast bread spread paired with some Serbian kajmak, cheese and vurda, and traditional Serbian bread such as proja, lepinja and pogaca or slavski kolac. It can be eaten as a side dish for a bigger meal from Serbian cuisine, such as gibanica, proja, burek sa sirom, burek sa mesom, belmuz, banica, prepec, komplet lepinja, leskovacka muckalica, teletina ispod saca, sarma, punjene paprike, prebranac, mlado prasece pecenje, Karadjordjeva snicla, podvarak, jagnjeca kapama, pogacice sa cvarcima, ustipci, mekike, kiflice sa sirom i susamom etc. It pairs perfectly with the famous Serbian Leskovac barbecue or Leskovacki rostilj consisting of cevapi, pljeskavica, raznjici, leskovacki ustipci, dimljena vesalica, suvi vrat, rostiljska kobasica etc. Traditional Serbian meze (an appetizer consisting of Serbian cured meats, prosciutto, Uzicka prsuta, Pirotska peglana kobasica, Sremski kulen, cheese and kajmak, served on big silver or wooden platters) always includes ajvar. Ajvar originates from Serbia where bell peppers are grown for centuries. Colloquially, ajvar is known as 'the vegan caviar of Serbia'. The most famous ajvar is Leskovacki ajvar, from city of Leskovac, Serbia. Gastronomic site TasteAtlas rated Serbian Leskovacki domaci ajvar The Best Relish Type in the World. Category:Condiments Category:Spreads Category:Albanian food Category:Croatian food Category:Macedonian food Category:Serbian food",
 "title": "Ajvar"
}