{
 "id": "1049600",
 "text": "Elsie \"Elsa\" Katz (born Elsie Taussig; ) was a Czech-born Jewish woman who kept a diary documenting daily life of inmates in the Theresienstadt Ghetto during World War II. She began writing the diary in 1943 after her eldest daughter Eva died from disease in the ghetto. The diary is written in 1943 and 1944. The diary was first discovered in August 1944 (the same month she died), by Elsa's daughter Vera in her mother Elsa's bed. After the war ended, Vera made her mother's diary available for publication. == Biography == Elsie Katz was born as Elsie Taussig on in Prague, Austria-Hungary (modern-day Czech Republic). As a adult, she married Hugo Lederer, but when their marriage relationship ended (because he died or they got divorced), she had then married a man named Sigefried Katz. They had two daughters, Eva (the oldest) and Vera (the youngest), their birth dates (and/or rather their birth years) were ranging from 1924 to 1926. Their lives were disrupted by the German invasion of Bohemia and Moravia (provinces of Czechoslovakia) in March 1939. When those provinces surrendered, the Germans began occupying Bohemia and Moravia. Over the years, the persecution and deportation of the Jews began. On 8 May 1942, Elsa, her mother, her husband and their two daughters were put on transport to Theresienstadt. Elsa's mother was in a semi-conscious state, when they arrived in the ghetto, and therefore died shortly afterwards. After her, Elsa's daughter Eva died one year later in 1943 from a disease. The conditions of the ghetto were so horrible that Elsa, and many other inmates, catched tuberculosis and later got gravely ill and weak. == Death == In the first week of August 1944, the Nazis ordered inmates who had tuberculosis to be sent to Auschwitz, so they can die in the gas chambers. Vera wanted to go to Auschwitz with her mother Elsa, so she would not be alone, so Vera asked a Nazi guard whether she could also go, but to their surprise, the guard allowed both Elsa and her daughter Vera to stay behind in the Theresienstadt Ghetto. Elsa died sometime later on 6 August 1944, from tuberculosis, at the age of 51. Her body was later buried. Her husband died in the Theresienstadt Ghetto in 1944 (the same year Elsa died). The same month her mother died, Vera discovered a notebook in Elsa's bed. When she opened and read it, she found out that it was a diary which was written by her mother. Category:1892 births Category:1944 deaths Category:Czech Jews Category:Holocaust victims",
 "title": "Elsa Katz"
}