{
 "id": "1049007",
 "text": "The Muzeum Miniaturowej Sztuki Profesjonalnej Henryk Jan Dominiak in Tychy is a modern art museum in TychyDominiak Henryk Jan, Biografia Indeks według kodu Grup Zawodowych: Sztuka, kultura i muzea, [w:] Britishpedia, Encyklopedia Osobistości Rzeczypospolitej Polskiej, BPH – British Publishing House Ltd, t. III., 2017, s. 245. ISBN 978-1-912100-36-1.Dominiak Henryk Jan, Biografia Indeks według kodu Grup Zawodowych: Sztuka, kultura i muzea, [w:] Britishpedia, Encyklopedia Osobistości Rzeczypospolitej Polskiej, BPH – British Publishing House Ltd, t. VII., 2021, s. 251. ISBN 978-1-912100-46-0.HÜBNERS WHO IS WHO, wydanie drukowane 2013, Henryk Jan Dominiak. in Poland in Silesian Voivodeship. Is one of the youngest and smallest museums in the world.Polskie Radio Katowice – Wiadomości kulturalne – Złota polska jesień z agatami Jana Rzymełki w najmniejszym muzeum. (2023-09-22) The permanent exhibition gallery comprises with a total area of 6.15 m². The Museum was founded in 2013 in Tychy, street Żwakowska 8/66,Żwakowska Ul. (2023-11-17)Ulica Żwakowska. (2023-11-17) by entrepreneur and artist Henryk Jan Dominiak.Muzea utworzone przez osoby fizyczne s. 4, poz. 41. (2023-09-22) The Museum introduces the public to a fascinating world of a miniature collection of paintings, drawings, and graphics, sculptures, ceramics and historical objects,BIP Muzeum [dostęp 2023-11-17]. the works of professional artists from all over the world among others from Ukraine, Hungary, Sweden, Brazil and Poland.Planeta Ziemia – przegląd korzeni środowiska stanowiącego kolekcję rezydentury wystawienniczej. (2023-09-22) == Exhibition gallery == File:MAL127 Donald Trump 49 x 35 mm. Artysta malarz Paweł Brodzisz olej - alkid na miedzi 2025. Eksponat Muzeum Miniaturowej Sztuki Profesjonalnej Henryk Jan Dominiak w Tychach.jpg|\"Donald Trump\" (); is an 2025 miniature painting by Polish artist Paweł Brodzisz; oil and alkyd on copper; 49 × 35 mm.MAL127 Donald Trump. (2025-02-12) File:MAL128 Elon Musk 50 x 35 mm. Artysta malarz Paweł Brodzisz olej - alkid na miedzi 2025. Eksponat Muzeum Miniaturowej Sztuki Profesjonalnej Henryk Jan Dominiak w Tychach.jpg|\"Elon Musk\" (); is an 2025 miniature painting by Polish artist Paweł Brodzisz; oil and alkyd on copper; 50 × 35 mm.MAL128 Elon Musk. (2025-02-14) File:MAL129 Cristiano Ronaldo 40 x 30 mm. Artysta malarz Paweł Brodzisz olej - alkid na płótnie 2025. Eksponat Muzeum Miniaturowej Sztuki Profesjonalnej Henryk Jan Dominiak w Tychach.jpg|\"Cristiano Ronaldo\" (); is an 2025 miniature painting by Polish artist Paweł Brodzisz; oil and alkyd on canvas; 40 × 30 mm.MAL129 Cristiano Ronaldo. (2025-02-16) File:MAL131 David Beckham 40 x 30 mm. Artysta malarz Paweł Brodzisz olej - alkid na płótnie 2025. Eksponat Muzeum Miniaturowej Sztuki Profesjonalnej Henryk Jan Dominiak w Tychach.jpg|\"David Beckham\" (); is an 2025 miniature painting by Polish artist Paweł Brodzisz; oil and alkyd on canvas; 40 × 30 mm.MAL131 David Beckham. (2025-02-16) File:MAL132 Wołodymyr Ołeksandrowycz Zełenski 40 x 30 mm. Artysta malarz Paweł Brodzisz olej - alkid na płótnie 2025. Eksponat Muzeum Miniaturowej Sztuki Profesjonalnej Henryk Jan Dominiak w Tychach.jpg|\"Volodymyr Zelenskyy\" (); is an 2025 miniature painting by Polish artist Paweł Brodzisz; oil and alkyd on canvas; 40 × 30 mm.MAL132 Wołodymyr Ołeksandrowycz Zełenski. (2025-04-18) File:MAL124 Czterej jeźdźcy Apokalipsy 50 x 77 mm. Artysta malarz Paweł Brodzisz olej - alkid na miedzi 2025. Eksponat Muzeum Miniaturowej Sztuki Profesjonalnej Henryk Jan Dominiak w Tychach.png|\"Four Horsemen of the Apocalypse\" (); is an 2025 miniature painting by Polish artist Paweł Brodzisz; oil and alkyd on copper; 50 × 77 mm.MAL124 Czterej jeźdźcy Apokalipsy. (2025-01-29) File:Bitwa pod Racławicami 132x77 mm. Artysta Wojciech Łuka 13.7.2023. Eksponat Muzeum Miniaturowej Sztuki Profesjonalnej Henryk Jan Dominiak w Tychach.jpg|\"Battle of Racławice\" (); miniature painting by Wojciech Łuka; 2023; oil on malachite and lapis lazuli; 132 × 77 mm. File:Bitwa pod Cedynią 42x15 mm. Artysta Paweł Brodzisz 2022. Eksponat Muzeum Miniaturowej Sztuki Profesjonalnej Henryk Jan Dominiak w Tychach.png|\"Battle of Cedynia\" (); miniature painting by Paweł Brodzisz; 2022; oil on lapis lazuli; 15 × 42 mm. File:Cud nad Wisłą - najmniejszy obraz świata 44 x 22 mm. Autor Anna Januszewicz-Pitlok 2021. Akryl wykonany igłą na kamieniu zoisyt z rubinami.jpg|\"Miracle on the Vistula\" (); miniature painting by Anna Januszewicz-Pitlok; 2021; acrylic paint on anyolite (is a green zoisite and ruby); 22 × 44 mm; is the smallest in the world.Jak podaje „Dziennik Zachodni” – Cud nad Wisłą najmniejszy obraz świata dzieło Anny Januszewicz-Pitlok. (2023-09-23) File:Chrystus Frasobliwy nr 1 - wysokość 26 mm. Autor Henryk Jan Dominiak 2013 rok Tychy Polska Europa. Rzeźba srebro próby 925 i lapis lazuli.jpg|\"Pensive Christ\" (); miniature sculpture by Henryk Jan Dominiak; 2013; silver and lapis lazuli; height: 26 mm. File:Dwie siostry - wysokość 34 mm i 30 mm. Artysta rzeźbiarz Aleksandra Jeżyk 2013. Rzeźba technika szydełko. Nitka biała masa plastyczna kalcyt.jpg|\"Two sisters\" (); miniature sculpture by Aleksandra Jeżyk; 2013; clay and white thread (a crochet hook technique); height: 34 mm and 30 mm. File:Wykładowca - wysokość 32 mm. Artysta rzeźbiarz Aleksandra Jeżyk 2013. Rzeźba technika szydełko. Nitka biała oraz brązowa i masa plastyczna.jpg|\"Lecturer\" (); miniature sculpture by Aleksandra Jeżyk; 2013; clay and white and brown thread (a crochet hook technique); height: 32 mm. File:Srebrna Pani - wysokość 26 mm. Artysta rzeźbiarz Aleksandra Jeżyk 2013 r. Rzeźba technika szydełko. Drucik elektryczny skała jaspis czerwony.jpg|\"Silver Lady\" (); miniature sculpture by Aleksandra Jeżyk; 2013; Electrical wire to carry electricity and red jasper (a crochet hook technique); height: 26 mm. File:Taniec - wysokość 80 mm. Artysta rzeźbiarz Aranka Gérné Mezősi 2013 Węgry. Rzeźba drut papier farba klej.jpg|\"Dance\" (); miniature sculpture by Aranka Gérné Mezősi; 2013; wire, paper, glue and aerosol paint (developed her own technique); height: 80 mm. File:Gliniany dzban nr 1 - wysokość 18 mm. Artysta rzeźbiarz krytyk sztuki Danuta SAGA Tomaszewska 2013 Europa Polska. Ceramika glina wypalona.jpg|\"Clay pitcher no. 1\" (); miniature ceramic by Danuta Saga Tomaszewska; 2013; It was made of white clay (developed her own technique); height: 18 mm. File:Gar do zsiadłego mleka - wysokość 10 mm. Artysta rzeźbiarz historyk sztuki Danuta SAGA Tomaszewska 2013 r. Poznań. Ceramika glina wypalona.jpg|\"Clay pot into a soured milk\" (); miniature ceramic by Danuta Saga Tomaszewska; 2013; It was made of red clay (developed her own technique); height: 10 mm. File:Donica - wysokość 9 mm. Artysta rzeźbiarz krytyk sztuki ceramik Danuta SAGA Tomaszewska 2013 rok woj. wielkopolskie. Ceramika glina wypalona.jpg|\"A clay flowerpot\" (); miniature ceramic by Danuta Saga Tomaszewska; 2013; It was made of red clay (developed her own technique); height: 9 mm. File:Gliniany dzban na wino - wysokość 17 mm. Artysta rzeźbiarz historyk sztuki Danuta SAGA Tomaszewska 2013 rok. Ceramika glina wypalona.jpg|\"Clay pitcher into a wine\" (); miniature ceramic by Danuta Saga Tomaszewska; 2013; It was made of red clay (developed her own technique); height: 17 mm. == Awards == * For distinguished contributions to the Polish culture and heritage the award in arts awarded by the Ministry of Culture and National Heritage of the Republic of Poland the Decoration of Honor Meritorious for Polish Culture (2021);Przyznane muzeum odznaczenia, nagrody, wyróżnienia i certyfikaty. (2023-09-23) * The Gold Decoration of Meritorious for the Construction Industry (2021); * The Gold Decoration of Honor Meritorious for Silesian Voivodeship (2020); == References == == Other websites == * *Muzeum Miniaturowej Sztuki Profesjonalnej Henryk Jan Dominiak in Tychy * pl.wikivoyage.org/wiki/Muzeum Miniaturowej Sztuki Profesjonalnej Henryk Jan Dominiak w Tychach Category:Museums in Europe Category:History of Poland",
 "title": "Muzeum Miniaturowej Sztuki Profesjonalnej Henryk Jan Dominiak in Tychy"
}