{
 "id": "1049308",
 "text": "Ali Ammar (; 14 May 1930 – 8 October 1957), better known by his nickname Ali la Pointe, was an Algerian revolutionary fighter and guerrilla leader of the National Liberation Front who fought for Algerian independence against the French colonial regime, during the Battle of Algiers. ==Biography== Ali Ammar was born on 14 May 1930 in Miliana, Algeria. He belonged to a poor family. The young Ali had a very difficult childhood during which poverty was prominent by the outbreak of the First World War, while the Algerians were already suffering the horrors of French colonization. The family's financial situation did not allow him to attend school and hence, he used to work in the fields of the settlers. Later, his family moved to Casbah. At a young age, Ali Ammar faced many hardships as he tried to help his family survive. He strongly disliked the colonial system in Algeria that oppressed his people. Ali rebelled against this injustice. When he was just thirteen, he got into trouble for standing up to a French policeman. After serving time in prison, he learned masonry in Algiers. He also enjoyed boxing at the Algiers Sports Club. However, his rebellious nature led to more prison sentences for various crimes, including theft, assault, and attempted homicide. In 1954, when the Algerian War broke out, he escaped from the Barberousse prison (Prison de Barberousse) where he was serving a two-year sentence for an attempted murder. Seeing his potential, FLN (National Liberation Front) militants explained to him that Algeria was a victim of colonialism and recruited him to their cause. After a trial conducted by Yacef Saadi to test his commitment (which he successfully passed) he was hired in the FLN. Within few months he became an important member of FLN. Ali first suggested the idea to FLN leaders of a hidden passageway that, in case of alert, would let fighters reach the terraces of the houses near hideouts quickly. This idea was used often. Ali used his skill as a mason to make the tunnels. According to Christopher Cradock and M.L.R. Smith, \"the chief assassin\" for FLN. After some figures of the local underworld suspected of being informants were executed by Ali, such as Rafai Abdelkader, Said Bud Abbot and Hocine Bourtachi, he \"sowed terror\" in the casbah, according to Marie-Monique Robin, a documentary filmmaker and TV journalist by applying \"revolutionary instructions, such as not allowing drinking alcohol or smoking\". ==Death== After three years of armed struggle (April 1955-October 1957), Ali La Pointe was spotted on October 8, 1957 by the colonial armed forces in a Casbah building located at 5, rue des Abderrames. He was killed in the company of Mahmoud Bouhamidi, Hassiba Ben Bouali, Zohra Drif and Omar Yacef, known as P'tit Omar, aged twelve, after the paratroopers of the 3rd Foreign Parachute Regiment (REP), commanded by Colonel Bigeard, who blew up the house with explosive devices where they had taken refuge. This action led to the collapse of an adjoining building which caused the death of atleast 24 other Algerians, including 8 children. At the time of his death, Ali La Pointe was 27 years old. All the french press at the time reported on the events that “Ali La Pointe blowed himself up” with the stock of explosives he held instead of reporting that “he was attacked in his lair(a secret or hidden place) by paratroopers”. It is not much doubted that the objective of these propaganda was clearly aimed to not make him a martyr so as not to push young Algerians to follow his path. ==Legacy== The character of Ali la Pointe is portrayed in the Italian-Algerian film 'The Battle of Algiers,' by Brahim Haggiag directed by Italian director Gillo Pontecorvo. ==References== Category:1930 births Category:Algerian people Category:1957 deaths",
 "title": "Ali La Pointe"
}