{
 "id": "104999",
 "text": "The General Certificate of Secondary Education (GCSE) is a set of exams taken in England, Wales, Northern Ireland and other British territories. They are usually taken by students aged 15–16, after two years of study. Some students can take their exams early if their teachers think the students are capable. Most students taking their GCSEs study between 5 and 25 subjects. All pupils have to study English, mathematics and science until they are 15-16. They do not have to take the GCSE exams, but the large majority do so. In Wales, students must also study Welsh until they are 14. Most schools require that a pupil passes 5 or more GCSE exams at grades 4 or 5 or above before they can move on to study A-levels. In 2020, the exams were cancelled for the first time due to the COVID-19 pandemic. https://www.bbc.co.uk/news/education-51980831 == Subjects == Many of the subjects in this list are not offered by every school. ===Required=== In all schools students have to study Mathematics, Science, and English linguistics and literature. ===Creativity=== * Art * Art Textiles * Film studies * Textiles * Music * Design and Technology * Drama * Dance * Performing arts * Food technology ===Languages=== * Modern foreign languages including: Arabic, Bengali, Chinese, Danish, Dutch, French, German, Greek, Gujarati, Hebrew, Hindi, Hungarian, Irish, Italian, Japanese, Korean, Malay, Persian, Polish, Portuguese, Punjabi, Russian, Spanish, Somali, Turkish, Tamil, Urdu and Welsh * Classical languages including: Classical Greek, Biblical Hebrew and Latin ===Technology=== * Electronics * Engineering and Manufacturing (Double Award) * Graphic products * Information and Communication Technology (ICT) ** Applied ICT (Double Award) * Product Design ** Electronics with Resistant Materials ** Resistant Materials ** Systems and Control Technology ** Textiles ** IT ===Humanities=== * Humanities * Geography * Religious Studies * History * Citizenship * Philosophy & Ethics * Economics * Hinduism * Islamic Studies ===People and society-related=== * Citizenship (Personal Social Health Education) * Health and Social Care (Double Award) * Home Economics: Child Development * Home Economics: Food and Nutrition * Law * Psychology * Social Science * Sociology ===Natural sciences=== * Astronomy * Geology * Human Biology * Human Physiology and Health * Physics * Chemistry * Biology ===Others=== * Further Mathematics (Further Pure Mathematics for Edexcel IGCSE) * Applied Business (Double Award) * Archaeology (may not currently be available as a separate GCSE ) * Business Studies * Business and Communication Systems * General Studies * Outdoor Pursuits - Birdwatching - Fishing * Physical Education (PE) * Sports Studies * Statistics * Media Studies == A-levels - Exams taken after GCSEs == *International GCSE - GCSE exams for students whose first language is not English. *Standard Grades - Similar exams taken in Scotland == References == ==Other websites== Category:Education in the United Kingdom",
 "title": "General Certificate of Secondary Education"
}