{
 "id": "1049706",
 "text": "Ashfield is a constituency of the UK Parliament. It is in the county of Nottinghamshire in the East Midlands. The constituency is the Erewash Valley. It is is to the north west of the city of Nottingham, and alongside the border with the neighbouring county of Derbyshire. Ashfield was created in 1955, and is considered to be part of the Red Wall. The red wall is a term used in British politics to describe UK Parliament constituencies in Midlands and Northern England that traditionally vote Labour. However in 2019 many of these constituencies voted for the Conservative Party. Ashfield was one of these constituencies as it voted for Lee Anderson, a member of the Conservative Party. Anderson defected to Reform UK in March 2024, after having the whip removed. After defeating to Reform UK, he became thier first MP. Before 2019 Ashfield only voted for the Conservatives once, in a by-election in 1977 when Tim Smith won the constituency. Smith represented the constituency for two years until he lost it in the 1979 general election . Apart from 1977 and 2019, Ashfield has voted for Labour. In the 2016 referendum on membership of the European Union, they voted 70% in favour of Brexit. == Constituency profile == The constituency has the market towns of Kirkby-in-Ashfield, Sutton-in-Ashfield, Huthwaite, and Eastwood. Coal mining was once a significant part of the economy. Historically many people in the area were employed in the coal industry, and former coal miners live the area. Current MP Lee Anderson once worked as a coal miner. == Boundaries == 1955–1974: The Urban Districts of Eastwood, Kirkby-in-Ashfield, and Sutton-in-Ashfield. In the Rural District of Basford the parishes of Annesley, Bestwood Park, Brinsley, Felley, Linby, Newstead, Papplewick, and Selston. 1974–1983: The Urban Districts of Hucknall, Kirkby-in-Ashfield, and Sutton-in-Ashfield. In the Rural District of Basford the parishes of Annesley, Felley, and Selston. 1983–2010: The District of Ashfield wards of Jacksdale, Kirkby-in-Ashfield Central, Kirkby-in-Ashfield East, Kirkby-in-Ashfield West, Selston, Sutton-in- Ashfield Central, Sutton-in-Ashfield East, Sutton-in-Ashfield North, Sutton- in-Ashfield West, Underwood, and Woodhouse, and the Borough of Broxtowe wards of Brinsley, Eastwood East, Eastwood North, and Eastwood South. 2010–present: The District of Ashfield wards of Jacksdale, Kirkby-in-Ashfield Central, Kirkby-in-Ashfield East, Kirkby-in-Ashfield West, Selston, Sutton-in-Ashfield Central, Sutton-in-Ashfield East, Sutton-in-Ashfield North, Sutton-in-Ashfield West, Underwood, and Woodhouse. Also the Borough of Broxtowe wards of Brinsley, Eastwood North and Greasley Beauvale, and Eastwood South. == History == The Ashfield constituency has been represented by a Secretary of State. Between 1992 and 2010 the constituency was represented by Geoff Hoon. Between 1999 and 2005, Hoon was Defence Secretary in Tony Blair's cabinet. Between 2008 and 2009, Hoon was Transport Secretary in Gordon Brown's cabinet. For only two years since its creation in 1955 and up until 2019 has the constituency been represented by a party other than Labour. Tim Smith of the Conservative Party won the constituency in a by-election in 1977. Smith represented the constituency until he lost in the 1979 general election. In 2019 the constituency was won again by the conservatives. It was won by Lee Anderson. Anderson was a member of the Labour Party, however he joined the Conservatives in 2018, after he was suspended from Labour. Anderson defected to Reform UK in March 2024, after having the whip suspended. After defeating to Reform UK, he became thier first MP. Election Member Party 1955 Will Warbey Labour 1966 David Marquand Labour 1977 by-election Tim Smith Conservative 1979 Frank Haynes Labour 1992 Geoff Hoon Labour 2010 Gloria De Piero Labour 2019 Lee Anderson Conservative == Elections == === Elections in the 2010s === === Elections in the 2000s === === Elections in the 1990s === === Elections in the 1980s === === Elections in the 1970s === === Elections in the 1960s === === Elections in the 1950s === ==Notes== == References == == Sources == * Youngs, Frederic A., Guide to the Local Administrative Units of England, Vol II, Northern England, London, 1991 Category:Westminster Parliamentary constituencies in England Category:Nottinghamshire",
 "title": "Ashfield (UK Parliament constituency)"
}