{
 "id": "1049070",
 "text": "Hardeep Singh Nijjar (11 October 1977 – 18 June 2023) was an Indian-born Canadian Sikh separatist leader who was involved with the Khalistan movement, which calls for creating an independent Sikh state in India. While the Indian government alleged that Nijjar was a \"designated terrorist\", many Sikh groups viewed Nijjar as an advocate for Sikh independence. Upon India's request, International Interpol notices were issued against Nijjar, accusing him of being the leader of pro-Khalistan militant group, Khalistan Tiger Force. Sakshi Dayal, Hardeep Singh Nijjar: Who was the Sikh leader murdered in Canada? , Reuters (September 19, 2023): “Nijjar later became chief of the militant group Khalistan Tiger Force (KTF)..., according to a 2020 Indian government statement.\" ==Murder and aftermath== On 18 June 2023, Nijjar was sitting in his pickup truck at the Guru Nanak Sikh Gurdwara in Surrey, British Columbia when he was shot and killed by two masked men. During the 2023 G20 New Delhi summit, Canadian Prime Minister Justin Trudeau and Indian Prime Minister Narendra Modi both met at the meeting. Modi spoke about about Sikh protests and Trudeau told Modi about the accusations that India had Nijjar killed. On 18 September 2023, Trudeau publicly accused the Indian government of being linked to the killing of Nijjar, while speaking in parliament. He told India to cooperate with the investigation. The U.S. Ambassador to Canada, said that some intelligence related the murder was shared with Canada. India's foreign ministry denied any involvement in Nijjar's killing. After these allegations, diplomatic relations between India & Canada deteriorated. Canada expelled an Indian diplomat, and India also expelled a Canadian diplomat in a tit-for-tat move. As of September 2023, the Canadian authorities had not made any arrests in connection with the murder. In May 2024, Canadian police arrested three people who are allegedly members of a hit squad which, investigators claim, killed Nijjar on the orders of the Indian Government. Three other murders are also being investigated as having a connection with the group. ==References== Category:1977 births Category:2023 deaths Category:Assassinated people Category:Canadian murder victims Category:Canadian Sikhs Category:People from Surrey, British Columbia Category:People murdered in North America Category:Political activists",
 "title": "Hardeep Singh Nijjar"
}