{
 "id": "1050025",
 "text": "Yaroslav Hunka (; born 19 March 1925) is a Ukrainian-Canadian World War II veteran of the 14th Waffen Grenadier Division of the SS (1st Galician), which was part of the Nazi Germany military. ==Early life== Yaroslav Hunka was born in Urman, Second Polish Republic (now Ukraine) in 1925. In 1943, Hunka volunteered to join the 14th Waffen Grenadier Division of the SS (1st Galician). During his time in SS Galizien, he was photographed training in Munich and Neuhammer. In 1944, Hunka fought against Red Army forces on the Eastern Front of World War II. The Nuremberg Trials ruled that the Waffen-SS was a criminal organization responsible for mass atrocities including the “persecution and extermination of the Jews, brutalities and killings in concentration camps, excesses in the administration of occupied territories, the administration of the slave labor program, and the mistreatment and murder of prisoners” and that all of its members were guilty. After the war, Hunka moved to the United Kingdom. In 1951, he married Margaret Ann Edgerton and the couple moved to Canada with their sons. ==Controversy over visit== In late September 2023, Hunka was invited to the House of Commons of Canada, where he received a standing ovation. Canadian Prime Minister Justin Trudeau, Opposition Leader Pierre Poilievre and Ukrainian President Volodymyr Zelenskyy were part of the standing ovation. Later, it was revealed Hunka was a member of the Waffen-SS, and Canadian government officials apologized to the Jewish community. === Aftermath === On 26 September 2023, Poland's Education Minister Przemysław Czarnek said that he would try to extradite Hunka as a war criminal. On 20 October 2023, Russia's Investigative Committee said that it had charged Hunka with \"genocide of civilians on the territory of the Ukrainian SSR during the Great Patriotic War\". The statement also said that investigators were considering issuing an international arrest warrant for Hunka. ==References== ==Other websites== * * Category:1925 births Category:Living people Category:Naturalized citizens of Canada Category:Ukrainian military people Category:Waffen-SS people Category:Military personnel of World War II Category:People from Toronto",
 "title": "Yaroslav Hunka"
}