{
 "id": "1050110",
 "text": "The 2013 UEFA Champions League final was the big game of the 2012–13 UEFA Champions League season. It happened on May 25, 2013, at Wembley Stadium in London, England. The teams were Borussia Dortmund and Bayern Munich from Germany. Bayern won 2–1 with goals from Mario Mandžukić and Arjen Robben, while İlkay Gündoğan scored for Dortmund. Bayern Munich also won the 2012–13 DFB-Pokal and the 2012–13 Bundesliga, completing a treble. Because they won the Champions League, they got to play against Chelsea, who won the 2012–13 UEFA Europa League, in the 2013 UEFA Super Cup. They also qualified for the semi-finals of the 2013 FIFA Club World Cup as the UEFA representative, and they ended up winning both of these competitions. A lot of people watched the final – 21.6 million in Germany on ZDF and over 360 million worldwide, making it the most-watched sports event of 2013. == How the teams got here == Note: In the results below, the score of the team playing at home is listed first (H), and the score of the team playing away is listed second (A). Borussia Dortmund Round Bayern Munich Opponent Result Group stage Opponent Result Ajax 1–0 (H) Matchday 1 Valencia 2–1 (H) Manchester City 1–1 (A) Matchday 2 BATE Borisov 1–3 (A) Real Madrid 2–1 (H) Matchday 3 Lille 1–0 (A) Real Madrid 2–2 (A) Matchday 4 Lille 6–1 (H) Ajax 4–1 (A) Matchday 5 Valencia 1–1 (A) Manchester City 1–0 (H) Matchday 6 BATE Borisov 4–1 (H) Group D winners Final standings Group F winners Opponent Agg. 1st leg 2nd leg Knockout phase Opponent Agg. 1st leg 2nd leg Shakhtar Donetsk 5–2 2–2 (A) 3–0 (H) Round of 16 Arsenal 3–3 (a) 3–1 (A) 0–2 (H) Málaga 3–2 0–0 (A) 3–2 (H) Quarter-finals Juventus 4–0 2–0 (H) 2–0 (A) Real Madrid 4–3 4–1 (H) 0–2 (A) Semi-finals Barcelona 7–0 4–0 (H) 3–0 (A) ==Match== === Details === {| style=\"font-size: 90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Roman Weidenfeller (c) RB 26 Łukasz Piszczek CB 4 Neven Subotić CB 15 Mats Hummels LB 29 Marcel Schmelzer CM 6 Sven Bender CM 8 İlkay Gündoğan RW 16 Jakub Błaszczykowski AM 11 Marco Reus LW 19 Kevin Großkreutz CF 9 Robert Lewandowski Substitutes: GK 20 Mitchell Langerak DF 27 Felipe Santana MF 5 Sebastian Kehl MF 7 Moritz Leitner MF 18 Nuri Şahin MF 21 Oliver Kirch FW 23 Julian Schieber Manager: Jürgen Klopp UEFA Man of the Match: Arjen Robben (Bayern Munich) Fans' Man of the Match: Manuel Neuer (Bayern Munich) Assistant referees: Renato Faverani (Italy) Andrea Stefani (Italy) Fourth official: Damir Skomina (Slovenia) Additional assistant referees: Gianluca Rocchi (Italy) Paolo Tagliavento (Italy) Reserve assistant referee: Gianluca Cariolato (Italy) Match rules * 90 minutes * 30 minutes of extra time if necessary * Penalty shoot-out if scores still level * Seven named substitutes * Maximum of three substitutions === Statistics === First half Borussia Dortmund Bayern Munich Goals scored 0 0 Total shots 7 5 Shots on target 5 3 Saves 3 5 Ball possession 40% 60% Corner kicks 5 3 Fouls committed 5 2 Offsides 0 2 Yellow cards 0 1 Red cards 0 0 Second half Borussia Dortmund Bayern Munich Goals scored 1 2 Total shots 5 9 Shots on target 3 6 Saves 4 1 Ball possession 44% 56% Corner kicks 1 5 Fouls committed 6 5 Offsides 1 2 Yellow cards 1 1 Red cards 0 0 Overall Borussia Dortmund Bayern Munich Goals scored 1 2 Total shots 12 14 Shots on target 8 9 Saves 7 6 Ball possession 42% 58% Corner kicks 6 8 Fouls committed 11 7 Offsides 1 4 Yellow cards 1 2 Red cards 0 0 == References == == Other websites == * Category:UEFA Champions League finals",
 "title": "2013 UEFA Champions League final"
}