{
 "id": "1050148",
 "text": "In association football, an assistant referee, formerly known as a linesman, helps the main referee enforce the rules of the game during a match. While the rules don't require assistant referees, most organized football matches have a team of at least two officials, including the main referee and assistant referees. Assistant referees have specific roles, such as determining when the ball goes out of play, deciding if there's an offside, and letting the referee know about rule violations the referee might have missed. They usually stand along the sidelines on opposite sides of the field. In higher-level games, there's also a fourth official who handles administrative tasks like managing substitutions and stays near the teams' technical areas.If an official can't continue, there are procedures to replace them, with the fourth official often stepping in. Sometimes, there are reserve assistant referees on standby. In very high-level matches, there may be more assistant referees, including those watching incidents near the goals. Video assistant referees can review game footage and advise the referee on decisions that might be incorrect. It's important to note that the main referee has the final say on all decisions, and the assistant referees' calls are advisory and can be overruled by the referee. == Roles == === Assistant referee === According to Law 6 of the Laws of the Game, two assistant referees can be chosen. These assistant referees stay along the sides of the field, each responsible for one half of the field. Assistant referees help the main referee by: * Checking if the entire ball has gone out of the field. * Deciding which team gets to put the ball back into play. * Helping with offside decisions. * Managing substitutions when there's no fourth official. * Pointing out rule violations when the main referee can't see clearly. The main referee doesn't have to follow the assistant referees' advice; they can make their own decisions. Sometimes, the main referee might ask an assistant referee for their opinion on certain matters. Occasionally, the assistant referee helps with organizing free kicks and offers visual help during penalty kicks. They also assist with some administrative tasks. === Fourth official === The fourth official in football assists the main referee with various tasks and can step in for other officials if needed. This role was introduced in 1966 by English referee Ken Aston but officially established by IFAB in 1991. The fourth official's main job is to support the referee during the game. They stand near the sideline between the teams' technical areas and handle administrative tasks, check player equipment, manage substitutions, indicate extra time, and help maintain order. They also assist the referee by watching the game and advising on situations not seen by the referee. In high-level competitions, the fourth official, usually an experienced referee, may step in for the main referee if necessary. Their main jobs include: * Handling administrative tasks before, during, and after the match. * Checking players' equipment. * Managing player substitutions, often using a numbered board or electronic display. * Indicating how much extra time is added at the end of each half. * Serving as a point of contact between the officiating team and other staff at the stadium. * Keeping order in the teams' technical areas. * Notifying the referee of any rule violations or issues that may not be visible to the referee. === Additional assistant referee === The additional assistant referee (AAR) is a match official who supports the main referee by standing behind the goal line. Their job is to help the referee watch for any incidents near the penalty area. In some cases, they've tried adding two more assistant referees positioned behind the goal lines. These extra officials were there to ensure that the rules of the game were followed, especially in important areas like the penalty area. They communicated with the referee through a wireless system and also helped in situations like \"ghost goals.\" Experts from the International Football Association Board (IFAB) evaluated this trial. After testing it for two years in various competitions, including the UEFA Champions League and Europa League, IFAB officially approved the use of additional assistant referees in July 2012. They even used them in the 2013 Scottish Cup Final, marking the first time they were used in a Scottish domestic match. === Video assistant referee === The video assistant referee (VAR) is a referee who watches video footage and talks to the on-field referee using a headset. They can review decisions made during a game. It's up to the competition whether they want to use VAR or not. === Fifth official and reserve assistant referee === The fifth official used to be a backup for assistant referees in football matches, ready to step in if an assistant got injured. During the 2006 World Cup, FIFA had five officials for matches. The fifth official helped the fourth official with various tasks and could replace another official if needed, mainly due to injuries.Definition of the fifth official : PDF file (page 8) quoting the \"IFAB Agenda 2007\". Retrieved 14 May 2012. The fifth official could watch the match on TV but couldn't tell the on-field referees about any missed incidents. After the 2010 FIFA World Cup Final, Italy's coach claimed the referee received advice from the fourth and fifth officials watching video footage, but FIFA denied this. Now, the fifth official's role is reduced to being a reserve assistant referee (RAR), only stepping in if an assistant referee or fourth official can't continue. Starting from July 2023, the RAR can also replace an additional assistant referee and assist the main referee like other officials. == References == Category:Association football referees Category:Football (soccer) terminology",
 "title": "Assistant referee (association football)"
}