{
 "id": "1050672",
 "text": "The Women's Finalissima is a special women's football tournament organized by CONMEBOL and UEFA. It's played once every four years, and teams from South America and Europe compete in it. The teams that win the Copa América Femenina and UEFA Women's Championship take part. It's like a big championship match for women's football, similar to the CONMEBOL-UEFA Cup of Champions. They decided to have this tournament in 2022 as part of their partnership. == History == On 12th February 2020, UEFA and CONMEBOL (two football organizations) agreed to work together more closely. They formed a committee to think about having football matches between teams from Europe and South America, for both men and women of different ages. Then, on 15th December 2021, they agreed to work together until 2028. They also decided to open an office together in London and talked about organizing different football events. On 2nd June 2022, after the 2022 Finalissima, CONMEBOL and UEFA announced some new events involving teams from both regions. One of these events was a match between the winners of South America's Copa América Femenina and the winners of Europe's UEFA Women's Championship. The first time this happened was on 6th April 2023 at Wembley Stadium in London, England. Brazil, who won the 2022 Copa América Femenina, played against England, who won the UEFA Women's Euro 2022. England won the first edition after a penalty shootout, following a 1-1 draw in regular time. This new competition doesn't have extra time, so ties go straight to a penalty shootout. == Results == List of Women's Finalissima matches Year Winners Score Runners-up Venue Location Attendance 2023 1–1 Wembley Stadium London, England 83,132 == Performances == ===By nation=== Results by nation Team Winners Runners-up 1 (2023) 1 (2023) === By confederation === Results by confederation Confederation Winners Runners-up UEFA 1 0 CONMEBOL 0 1 == References == Category:Football competitions in Europe Category:Football competitions in South America Category:2022 establishments in Europe Category:2020s establishments in South America",
 "title": "Women's Finalissima"
}