{
 "id": "1050577",
 "text": "Junko Furuta (18 January 1971 – 4 January 1989) was a high school student. On November 25, 1988, Junko was kidnapped. She was beaten, raped, held captive for 44 days, and murdered. It is described as one of the worst cases in post- war Japan. ==Events == On November 25, 1988, Junko was on her bike and riding home from her part-time job at an electronics retailer. Miyano told his friend, Nobuharu Minato, to kick junko off her bike and run away. Miyano then asked to escort Furuta to her house. Miyano instead took junko to an abandoned warehouse where he raped and beat her. He told her that he had connections to the yakuza, knew where her family lived and would kill them if she told the police. ===B=== ===Torture=== ====Gang rape==== Miyano took Furuta to a hotel where he along with Minato, Jō Ogura and Yasushi Watanabe were waiting and all took turns raping her. They had recently also done this to another girl. They took Furuta to Minato's parent's house. They held her there for 44 days. After three days missing, Furuta's mother was working with the police to try and find her. Her captors knew this and forced Furuta to call her parents to tell them she ran away and to not look for her. Minato's brother and parents knew a girl was in the house. The captors tried to say that Furuta was a girlfriend to one of them but they did not believe them. Minato's brother and parents did not care, saying they were too scared because of Minato's anger, his yakuza ties and their reputation. The captors later gave up on their story. ====Health deterioration==== Due to dehydration, Furuta would vomit which cause the captors to become angry and beat her even more. They fed her water, milk, and her own urine due to not being able to control her bladder because of how badly they beat her. They also forced her to eat live cockroaches. They would force her to be naked most of the time, putting her in a freezer and making her sleep on the balcony in cold weather. After 20 days, she could not walk. They would dump lighter fluid on her legs, set her on fire and crush her hands with dumbbells. ====Escape attempt==== During a night where her captors got drunk, Furuta tried to escape. She crawled downstairs and tried to call the police but Miyano found her, took the phone, and told the police that he called the wrong number. ====Agonizing Torture==== They set her on fire, put her head on concrete and stomped on it. After a while, they had beaten her so badly that they didn't find her attractive anymore, so they used the same plan they had before to rape another 19-year-old. They hung her to the ceiling fan by her wrists and used her as a human punching bag, naked. They would force her to masturbate and dance naked in front of \"guests\". They shoved objects such as a lit match, metal pole, knives and wood up her vagina and anus. ===Murder=== On 4 January 1989, after a defeat in mahjong, Minato and the boys were angry so they beat and burned her for two hours. Furuta went into shock and died the next day. Minato's brother phoned him to tell them of her death so they rushed to the house. They put Furuta's body in a 55-gallon oil drum and filled it with concrete. They dumped the drum at a construction site in Kōtō. ==Aftermath== ===Investigation=== After being questioned about the rape of the 19-year-old, Hiroshi got confused, and thought they were talking about Furuta. He thought that the other boys had told police about her so he told police about what happened to Furuta and told them where her body was. They had to identify her by fingerprints because her face was so badly beaten. The autopsy also revealed that she was pregnant. After being told about the details of her murder, Furuta's mother fainted and was entered into a psychiatric hospital. The Japanese police did not reveal their names because they were underage, but Shūkan Bunshun, a Japanese magazine found and leaked their names saying that they were \"inhumane and didn't deserve human rights\". They were first going to be trialled as juveniles but it was later decided that they would be trialled as adults because of public backlash. ===Trial=== They got light sentences. They were not charged with murder, instead being charged with \"causing bodily injury resulting in death\". Hiroshi got 17 years but it was later upgraded to 20 after an appeal,\"Rapist, Murderer Given 20-Year Sentence\", The Daily Yomiuri, 13 July 1991. Page 2. Minato got 5 to 7 years, Watanabe got 9 years and Jō got 8 years. After being released, Minato changed his name to Shinji and was later arrested for the attempted murder of a businessman. Jō changed his name to Jō Kamisaku. He bragged about Furuta's murder. Jō's father felt shame and said that he would give his entire life savings to Furuta's family. Jō took the money and spent it on himself instead. Jō's mother blamed Furuta for ruining her son's life and allegedly vandalized Furuta's tombstone. == Similar cases == * Sylvia Likens * Ryoko Ishida * Alejandra Ico Chub ==References== Category:1989 Category:1980s crimes Category:1980s in Japan Category:Events in Japan Category:Murder in Asia Category:Murder in the 1980s Category:Murdered children Category:Violence against women Category:Torture victims",
 "title": "Murder of Junko Furuta"
}