{
 "id": "1050135",
 "text": "Taapsee Pannu is an Indian actress and model. who primarily works in Hindi, Telugu and Tamil language movies. She made her movie debut in 2010 by romantic musical movie Jhummandi Naadam and made her Hindi movie debut in 2013 by slapstick comedy movie Chashme Baddoor. == Movies == Year Title Role Language Notes 2010 Jhummandi Naadam Sravya Telugu 2011 Aadukalam Irene Claude Tamil Vastadu Naa Raju Pooja Tejugu Mr. Perfect Maggie Telugu Veera Aiki Telugu Vandhaan Vrendraan Anjana Tamil Mogudu Rajarajeshwari Telugu Doubles Saira Banu Malayalam 2012 Daruvu Swetha Telugu 2013 Gundello Godari Sarala Telugu Chashme Baddoor Seema Hindi Shadow Madhubala Telugu Sahasam Srinidhi Telugu Arrambam Anitha Tamil 2014 Kathai Thiraikathai Vasanam Iyakkam Herself Tamil Cameo appearance 2015 Baby Shabana Khan Hindi Kanchana 2 Nandini Tamil Vai Raja Vai Shreya Tamil Guest appearance Dongaata Herself Telugu Special appearance 2016 Pink Meenal Arora Hindi 2017 Running Shaadi Nimmi Hindi The Ghazi Attack Dr. Ananya Manirao Telugu Bilingual movie Hindi Naam Shabana Shabana Khan Hindi Anando Brahma Unnamed ghost Telugu Judwaa 2 Samaara Jain Hindi 2018 Dil Juunglee Koroli Nair Hindi Soorma Harpreet Sandhu Hindi Mulk Aarti Malhotra Mohammad Hindi Neevevaro Vennela Telugu Manmarziyaan Rumi Bagga Hindi 2019 Badla Naina Sethi Hindi Game Over Swapna Tamil Bilingual movie Telugu Mission Mangal Kritika Aggarwal Hindi Saand Ki Aankh Prakashi Hindi 2020 Thappad Amrita Sandhu Hindu 2021 Haseen Dillruba Rani Kashyap Hindi Annabelle Sethupathi Annabelle Sethupathi Tamil Rashmi Rocket Rashmi Baweja Hindi 2022 Loop Lapeta Savina Borkar Hindi Mishan Impossible Sailaja Telugu Shabaash Mithu Mithali Raj Hindi Dobaara Antara Awasti / Vashisht Hindi Tadka Nicole Anne Mascarenhas Hindi Blurr Gayatri / Gautami Hindi 2023 Dhak Dhak Hindi Producer Woh Ladki Hai Kahaan? ACP Komal Sharma Hindi Completed Dunki Hindi Filming Phir Aayi Haseen Dillruba Rani Kashyap Hindi Filming == Television == Year Show Role Language Notes 2017 Bigg Boss 1 Herself Telugu Guest appearance 2022 Bade Achhe Lagte Hain 2 Dr. Antara Hindi For Promoting her film Dobaaraa == Short movies == Year Title Role Language 2018 Baarish aur Chowmein Neelu Hindi Nitishastra Roshni Hindi == References == Category:Filmographies",
 "title": "Taapsee Pannu filmography"
}