{
 "id": "1050473",
 "text": "The Pokémon Trading Card Game is a collectible card game based on the Pokémon video game series. The gameplay of the card game is similar to the video game. Two players choose six Pokémon, creatures that live in the game series' fictional universe, to fight against each other. Both players can only play one Pokémon at a time, while the other five Pokémon wait on a \"bench\". Each player takes turns attacking the other player's Pokémon. The turn ends either if the attacking player attacks the other player or if they pass their turn. Each Pokémon has a certain number of Hit Points, or HP. Every Pokémon's HP is a multiple of 10. Many attacks take away the other player's Pokémon's HP, but many Pokémon also have attacks that do not do damage, but instead have other effects such as making the player's Pokémon not lose any HP for a turn, cause the other player's Pokémon to sleep, be paralyzed, be confused, or be paralyzed, or many other different effects. If your or the other player's Pokémon's HP reaches 0 HP, then the Pokémon is knocked out. This means the Pokémon cannot fight anymore and must be put in the discard pile. If a player's Pokémon knocks out the other player's, then the player can take a prize. The number of prizes that can be drawn is decided before the game begins. There can be two, three, four, fix, or six prizes, depending on what the players decide. If a player draws all of his prizes before the other player, or if the other player no longer has any Pokémon in play or in the bench, then the player wins. Like in the video game, each Pokémon has an Element. Most Elements have strengths, weaknesses, and resistances to other elements. However, there are fewer Elements in the trading card game (TCG) than in the video games. The video games have 18 Element Types while the TCG has 11. Some Element Types from the video games are combined in the TCG. For example, Fighting-, Rock-, and Ground-Type Pokémon from the video games are all Fighting-Type in the TCG. If a Pokémon's Element has a strength against another Element, then the Pokémon's attack will take away twice as much HP as the attack's normal attack power. Likewise, if a Pokémon's Element has a weakness against another Element, then the Pokémon will lose twice as much HP if it is attacked. For example, a Electric-Type Pokémon's strength is Water, which means that a Water-Type Pokémon's weakness is Electric. Therefore, if a Electric-Type Pokémon attacks a Water-Type Pokémon with an attack that takes away 30 HP, then the attack will take away 60 HP from the Water-Type Pokémon because of the Electric-Type's strength over Water. If an Element has resistance, then certain Elements will not take away any HP. For example, many Fighting-Type Pokémon have resistance to Electric-Type Pokémon, which means that attacks from Electric-Type Pokémon cannot take away any HP from those Fighting-Type Pokémon. As written before, Pokémon of a certain Element Type in the TGC will not always have the same strengths, weaknesses, and resistances as others of the same Element Type. This is because the TCG often combines multiple Element Types from the game into one. For example, Rock- and Ground- Type Pokémon from the games have resistance to Electric-Type attacks, but Fighting-Type Pokémon do not. Since the Fighting Element from the TCG was originally three different Element-Types from the game, this is why some Fighting-Type Pokémon have resistance to Electric-Type Pokémon but other Fighting-Type Pokémon do not. Category:Card games Category:Pokémon",
 "title": "Pokémon Trading Card Game"
}