{
 "id": "105075",
 "text": "D. B. Cooper (aka Dan Cooper) is an alias (false name) for a man who hijacked an airplane in November 24, 1971. At that time, airline passengers were not searched before boarding their planes. He carried a bomb onto a flight between Portland, Oregon and Seattle, Washington. He received the ransom payment of $200,000.Adjusted for inflation, $200,000 in 1971 has the buying power of $$1,118,128.40 in 2011. He jumped from the airplane, which was a Boeing 727. When he jumped, the airplane was in the Pacific Northwest, perhaps over Woodland, Washington. Hundreds of suspects have been named through the years, but no conclusive evidence has surfaced regarding who Cooper was, or where he lived. The FBI believes he did not survive the jump. Several people have tried to explain what happened after the jump. Some of these explanations contradict each other. Because no one expected he would jump and because little is known of what happened afterwards, people are still interested in the case. The Cooper case (code-named \"Norjak\" by the FBI) remains an unsolved mystery with Cooper's identity still a mystery. ==Background== The case is very famous for its lack of evidence. A few important clues have arisen nevertheless. In late 1978, a placard, which had instructions on how to lower the rear stairs of a 727, was found just a few flying minutes north of Cooper's projected drop zone. It is believed that this is from the rear stairway of the plane from which Cooper jumped. In February 1980, eight-year-old Brian Ingram found $5,880 in decaying $20 bills on the banks of the Columbia River. The official physical description of Cooper has remained unchanged and is considered reliable. Flight attendants Schaffner and Mucklow, who spent the most time with Cooper, were interviewed on the same night in separate cities and gave nearly identical descriptions: around tall, , mid-40s, with close-set, piercing brown eyes and swarthy skin. Because the tie clip was pinned on the left side, there is a possibility that Cooper was left handed. It is said he smoked Raleigh Cigarettes and drank Bourbon and soda. While he knew the airstair could be lowered, Cooper had to ask about how the airstair was operated, indicating that while he had knowledge of an airstair, he did not have practical experience on how to operate one. Agents theorized that Cooper took his alias from a popular French-language Belgian comics series featuring the fictional hero Dan Cooper, a Royal Canadian Air Force test pilot who took part in numerous heroic adventures, including parachuting. (One cover from the series, reproduced on the FBI website, depicts test pilot Cooper skydiving.) Because the Dan Cooper comics were never translated into English, nor imported to the U.S., they speculated that he had encountered them during a tour of duty in Europe. Because Cooper not only demanded a ransom in \"neogoatble American Currency\" but also may have used the Dan Cooper comic name there is speculation \"D.B. Cooper\" may have been a Canadian. In 2007 The FBI also disclosed that Cooper had chosen the older of the two primary parachutes supplied to him, rather than the technically superior professional sport parachute, and that from the two reserve parachutes, he selected a \"dummy\", an unusable unit with a sewn-shut chute intended for classroom demonstrations, although an experienced skydiver would have realized this was non-functional. He also used the cord from the functional parachute he jumped with to secure the money bag. Cooper appeared to be familiar with the Seattle area and may have been an Air Force veteran, based on testimony that he recognized the city of Tacoma from the air as the jet circled Puget Sound, and his accurate comment to Mucklow that McChord Air Force Base was approximately twenty minutes' driving time from Seattle-Tacoma Airport—a detail most civilians would not know or comment upon. His financial situation was very likely desperate. According to the FBI's retired chief investigator, Ralph Himmelsbach, extortionists and other criminals who steal large amounts of money nearly always do so because they need it urgently; otherwise, the crime is not worth the considerable risk. Assuming that Cooper was not a paratrooper but was an Air Force veteran, Special Agent Larry Carr, who led the Cooper investigative team from 2006 until its dissolution in 2016, suggested the possibility that he was an aircraft cargo loader. Such an assignment would have given him knowledge and experience in the aviation field; and loaders—because they throw cargo out of flying aircraft—wear emergency parachutes and receive rudimentary jump training. Such training would have given Cooper a working knowledge of parachutes—but \"not necessarily sufficient knowledge to survive the jump he made\".In Search of D.B. Cooper: New Developments in the Unsolved Case (March 17, 2009). FBI.gov Retrieved November 9, 2016. The FBI was skeptical of Cooper's odds of survival, concluding that he lacked crucial skydiving skills and experience. \"We originally thought Cooper was an experienced jumper, perhaps even a paratrooper\", said Carr. \"We concluded after a few years this was simply not true. No experienced parachutist would have jumped in the pitch-black night, in the rain, with a wind in his face wearing loafers and a trench coat. It was simply too risky. He also missed that his reserve parachute was only for training and had been sewn shut, something a skilled skydiver would have checked.\" Cooper also failed to bring or request a helmet, jumped with a non-functional parachute into a probable wind at in November over Washington state without proper protection against the extreme wind chill. The FBI speculated from the beginning that Cooper did not survive his jump. \"Diving into the wilderness without a plan, without the right equipment, in such terrible conditions, he probably never even got his chute open\", said Carr. Even if he did land safely, agents contended that survival in the mountainous terrain at the onset of winter would have been all but impossible without an accomplice at a predetermined landing point. This would have required a precisely timed jump—necessitating, in turn, cooperation from the flight crew. There is no evidence that Cooper requested or received any such help from the crew, nor that he had any clear idea where he was when he jumped into the stormy, overcast darkness. A 2009 National Geographic special \"Robbery in the Sky\" speculates on why Cooper and the larger part of the ransom have not been found .i.E. Cooper was killed when he fell into the Columbia River; the River at that time was part of a route for ocean going ships and Cooper remains and the ransom were caught by an ocean going ship. Part of the ransom money broke loose and drifted on to the sand bar where it was found. Cooper and the rest of the money received a burial at sea. In October 2007, the FBI announced it was able to get a partial DNA profile of Cooper from the tie he left on the hijacked plane. The FBI warehouse had lost other material with his DNA. On December 31, 2007, the FBI revived the unclosed case: They published never before seen composite sketches and fact sheets online. They did this because some people might remember them, and help identify Cooper. In a press release, the FBI said that it still does not believe Cooper survived the jump, but wanted to know who Cooper was. In March 2008, the FBI announced that another possible clue was being investigated after a torn, tangled parachute was found within the bounds of Cooper's probable jump site near the town of Amboy, Washington. However, the FBI announced on April 1, 2008 that the parachute in question was not D. B. Cooper's. The man responsible for packing the four parachutes said that the recently discovered parachute was not Cooper's, as his was nylon, and the newly discovered parachute was silk, dating from the 1940s. Normally, the criminal laws cannot work against people years after their crimes (statute of limitations). In 1976, to prevent D. B. Cooper from escaping punishment, a Portland grand jury charged D. B. Cooper with crimes. In March 2009, a group of \"citizen sleuths\" using GPS, satellite imagery, and other technologies unavailable in 1971, began reinvestigating components of the case. Known as the Cooper Research Team (CRT), the group included paleontologist Tom Kaye from the Burke Museum of Natural History and Culture in Seattle, scientific illustrator Carol Abraczinskas, and metallurgist Alan Stone. Although the CRT obtained little new information about the buried ransom money or Cooper's landing zone, they found, analyzed, and identified hundreds of organic and metallic particles on Cooper's tie. Using electron microscopy, the CRT identified Lycopodium spores, the source of which was likely pharmaceutical. The team also found minute particles of unalloyed titanium on the tie, along with particles of bismuth, antimony, cerium, strontium sulfide, aluminum, and titanium-antimony alloys. The metal and rare- earth particles suggested Cooper may have worked for Boeing or another aeronautical engineering company, at a chemical manufacturing plant, or at a metal fabrication and production facility. The material with the most significance, explained Kaye, was the unalloyed titanium. During the 1970s, the use of pure titanium was rare and would only be used in aircraft fabrication facilities, or at chemical companies combining titanium and aluminum to store extremely corrosive substances. The cerium and strontium sulfide were used by Boeing's supersonic transport development project, and by Portland factories in which cathode ray tubes were manufactured, such as Teledyne and Tektronix. Cooper researcher Eric Ulis has speculated the titanium-antimony alloys are linked to Rem-Cru Titanium Inc., a metals manufacturer and Boeing contractor. Since 1999, Ariel, Washington holds an annual D. B. Cooper celebration on the anniversary of his jump. == References == == Other websites == * * FBI FOIA Reading Room Files of the \"Norjak\" D.B. Cooper Case * Check-Six.com - Codename:Norjak - The Skyjacking of Northwest Orient Flight 305 * Radio interviews about D. B. Cooper's identity with major authors * Nov. 27, 1971, account of the hijacking in the Minneapolis Tribune * Radio interview with FBI lead investigator Larry Carr * Video tour of D.B. Cooper evidence with FBI lead investigator Larry Carr * PCGS Currency Notifies FBI of “D. B. Cooper” Serial Numbers Category:American criminals Category:Mysterious people Category:Missing people Category:1971 in the United States Category:20th-century births Category:Year of birth unknown Category:Year of death unknown Category:Federal Bureau of Investigation Category:Pseudonyms Category:Transport in Washington (state)",
 "title": "D. B. Cooper"
}