{
 "id": "1050994",
 "text": "Sel or SEL can be * Sel, Norway, a municipality * HNoMS Sel, three Royal Norwegian Navy boats * Sel (group), a Lithuanian band * \"Sel\" (song), from the 2019 album Dawn Chorus by Jacques Greene * Sel, abbreviation of Selenipedium, a genus of the orchid family ==People== * Sel Belsham (d. 2016), New Zealand rugby league player * Sel Hannah (d. 1991), American skier and ski-area architect * Sel Lisle (d. 1999), Australian rugby league player * Sel Murray (born 1917), Australian rules footballer ==SEL== *Signalling Equipment Ltd, a trading name used by the British toy manufacturer J & L Randall *Finnish Food Workers' Union, a trade union in Finland *Left Ecology Freedom (Sinistra Ecologia Libertà), Italian political party *Selkirkshire, historic county in Scotland, Chapman code *Single-event latchup *Social and Emotional Learning, a pedagogy focusing on the study and application of Emotional intelligence (EI) *Social Enterprise London *Swedish Elite League, the English unofficial name of the Elitserien ice hockey league *Système d'Échange Local, a French Local Exchange Trading System ===Art=== *Sensory Ethnography Lab, a filmmaking and anthropology center at Harvard University *Serial Experiments Lain, a 1998 anime series *Shankar–Ehsaan–Loy, a trio of music composers from India ===Language=== *Self-learning of English Language *SEL: Studies in English Literature, an academic journal *Skolta Esperanto Ligo, an Esperanto Scouting association ===Technology=== *Schweitzer Engineering Laboratories, a worldwide power systems company *Search Engine Land, a website covering search engine related news *Security-Enhanced Linux (SELinux) is a Linux kernel security module that provides a mechanism for supporting access control security policies, including mandatory access controls (MAC). *Standard Elektrik Lorenz, a German electronics firm *Station of Extreme Light, a Chinese laser laboratory. *Systems Engineering Laboratories, an early computer manufacturer specializing in realtime systems *System Event Log, the name for a server system logger used by a variety of servers ===Transportation=== *Mercedes-Benz SEL, an automobile model *The former IATA Airport code for Gimpo International Airport in Seoul, Korea (Currently GMP) *Southern Evacuation Lifeline, a proposed limited-access highway in Horry County, South Carolina",
 "title": "Sel"
}