{
 "id": "105072",
 "text": "Aladdin (also known as Aladdin and the Magic Lamp) is a 1992 American animated musical fantasy comedy movie. It was produced by Walt Disney Feature Animation and released by Walt Disney Pictures. Aladdin is the 31st animated movie in the Walt Disney Animated Classics series. It was part of the Disney movie era known as the Disney Renaissance. The movie was directed by John Musker and Ron Clements. It is based on the Arab folktale of Aladdin and the magic lamp from One Thousand and One Nights. The voice cast features Scott Weinger, Jonathan Freeman, Robin Williams, Linda Larkin, Frank Welker, Gilbert Gottfried and Douglas Seale. Aladdin was released on November 25, 1992. It got positive reviews and was the most successful movie of 1992, earning over $217 million in revenue in the United States, and over $504 million worldwide. The movie also won many awards, most of them for its soundtrack. Some people have accused it of being racist, because the heroes are light-skinned and have American accents while the villains are dark-skinned and have Arab accents. Aladdins success led to other material inspired by the movie, including two direct-to-video sequels, The Return of Jafar and Aladdin and the King of Thieves; an animated television series; toys, video games, spin-offs, and Disney merchandise. A Broadway adaptation debuted in 2014. ==Plot== In the city of Agrabah, the Sultan wants his daughter Princess Jasmine to marry a prince, but she rejects every suitor and temporarily leaves the palace. At the marketplace, she meets a \"street rat\" named Aladdin. Jafar, the Sultan's vizier, discovers that Aladdin is the only one who can enter the Cave of Wonders and find a magic lamp. Jafar orders him to get the lamp. Aladdin and his pet monkey, Abu, enter the cave, where they befriend a magic carpet and obtain the lamp. Abu inadvertently grabs a forbidden treasure and the cave collapses itself. Jafar believes Aladdin has died. After surviving, Aladdin rubs the lamp and meets the Genie, who grants three wishes for him. Aladdin uses the first one to disguise himself as a prince so that he can meet Jasmine again. Pretending to be a prince, he returns to the city, and meets the Sultan and Jafar. After Jasmine discovers the identity of Aladdin, the Sultan decides to promote him. When Jafar steals the lamp and releases the Genie. Jafar uses two of his wishes to become a sorcerer and to make himself the sultan. However, Aladdin tells Jafar that he is still not as powerful as the Genie. This makes Jafar wish to become a Genie as well, but this means that he is now trapped in a lamp forever along Iago, Jafar's parrot. Aladdin uses his third wish to free the Genie and he sets off to see the world. Aladdin and Jasmine plan their marriage. ==Cast and characters== * Scott Weinger as Aladdin, an 18-year-old prince. His uncredited singing voice was provided by Brad Kane. * Robin Williams as The Genie and the Peddler. The Peddler's singing voice was provided by Bruce Adler. * Linda Larkin as Princess Jasmine. Her uncredited singing voice was provided by Lea Salonga. * Jonathan Freeman as Jafar. * Frank Welker as Abu the Monkey, the Cave of Wonders and Rajah the Tiger. * Gilbert Gottfried as Iago the Parrot. * Douglas Seale as The Sultan. Additional voices * Charlie Adler as Gazeem, the Melon Merchant and the Nut Merchant. * Jack Angel as an Arab. * Corey Burton as Prince Achmed, the Necklace Merchant, the Fish Merchant, the Camel and a Sheep. * Philip Clarke, Bruce Gooch, Jerry Houser, Patrick Pinney and Phil Proctor as the Guards. * Jim Cummings as Razoul and Farouk. Razoul's name is inspired by animator Rasoul Azadani, who was a layout artist in this movie. * Jennifer Darling as the Agrabah Woman. * Debi Derryberry as the Harem Girl. * Vera Lockwood as the Portly Agrabah Woman. * Sherry Lynn as the Fat Woman with Red Lipstick. * Mickie McGowan as a Vendor. The non-speaking character * The Magic Carpet is a sentient carpet that is able to fly. ==International Versions== === Danish Dubbing år: 1993 === * Aladdin – Søren Launbjerg * Genie (Ånden) – Preben Kristensen * Jasmin (Dialog) – Ilia Swainson * Jasmin (Sang) – Louise Norby * Jafar – Nis Bank-Mikkelsen * Jago – Torben Zeller * Sultanen – Ove Sprogøe * Peddler – Kurt Ravn * Additional Voices: Peter Zhelder, Vibeke Dueholm, Peter Aude, Lasse Lunderskov, Lars Thiesgaard ==References== ;Notes ==Other websites== * * * * * * Category:1992 movies Category:1990s American adventure movies Category:1992 adventure movies Category:1992 romance movies Category:Aladdin (Disney) Category:American family movies Category:1990s American musical movies Category:1990s American romance movies Category:Movies about princesses Category:Movies based on fairy tales Category:Movies composed by Alan Menken Category:Movies composed by Harry Gregson-Williams Category:Movies set in palaces Category:Movies about treasure hunting Category:Movies about tigers Category:Movies about primates Category:1990s romantic comedy movies Category:American romantic comedy movies Category:American animated romance movies Category:Movies set in Asia",
 "title": "Aladdin (1992 movie)"
}