{
 "id": "105025",
 "text": "Sánchez Ramírez is a province of the Dominican Republic. It is in the central part of the country. Its capital city is Cotuí. It was created in 1952. It was a municipality of the Duarte province before being elevated to the category of province. ==Name== The province was named after Juan Sánchez Ramírez, who was born in Cotuí and who fought against the French army when the country was a colony of France. When the country was again a Spanish colony, Sánchez Ramírez was made the governor of the colony. ==History== The territory of the province was part of the La Vega Province from the Dominican independence (in 1844) until 1945 when most of the territory was made part of the Duarte Province. On 3 March 1952, the province was created with the territory of Cotuí, part at that moment of the Duarte Province, and the southeastern part of La Vega province. When it was created, it had only two municipalities: Cotuí, the provincial capital, and Cevicos. In 1961, Fantino became the third municipality of the province; in 2002, Villa La Mata became the fourth municipality. In 1979, La Cueva became a municipal district; La Bija and Angelina in 2001; Quita Sueño and Platanal in 2005; Hernando Alonzo, Caballero and Comedero Arriba in 2006; and Zambrana Abajo in 2010. ==Location== The Sánchez Ramírez province is in the centre of the country, in the southeast limit of the Cibao Valley (part of the region called Eastern Cibao). It is bordered to the north by the Duarte province, to the east and south by the Monte Plata province, to the southwest and west by the Monseñor Nouel province and to the northwest by the La Vega province. ==Population== In (last national census), there were people living in the Sánchez Ramírez province, and 85,207 () living in towns and cities. The population density was persons/km². Its population represents of the total population of the country and the province is ranked as the 19th (out of 31 plus the National District) more populated province. , the total estimated propulation of the province is 152,036 inhabitants. The largest city of the province is Cotuí, its head municipality or capital, with an urban population (in ) of 45,135 inhabitants. ==Geography== The Sánchez Ramírez province has a total area of . It has of the area of the Dominican Republic and it is ranked as the 21st (out of 31 plus the National District) largest province. There are two regions in the province: # The valley of the Yuna river, on the north and northeast of the province. It is part of the large region of Eastern Cibao; it is flat and with very good soils. # Sierra de Yamasá (Yamasá mountain range in the southern part of the province. It is an eastern branch of the Cordillera Central (\"Central mountain chain\") with low mountains. The highest point in the province is in this mountain range; it is La Naviza (sometimes written La Navisa), high. The altitude of Cotuí, provincial capital, is above sea level. The most important river is the Yuna river, that flows from west to east; the other rivers are all tributaries of this river. Other rivers are Cevicos, Chacuey and Maguaca; they flow from the Sierra de Yamasá into the River Yuna. ==Municipalities== There are 4 municipalities and 8 municipal districts (M.D.) in the province. Municipalities of the Sánchez Ramírez province Municipality (code) Municipal Districts (code) Population (2010) Area (km2) Density Altitude (m) Cotuí (240101) Cotuí (240101) 64,133 474.6 70 Quita Sueño (240102) 3,531 23.4 134 Caballero (240103) 2,521 53.9 131 Comedero Arriba (240104) 2,699 47.8 143 Platanal (240105) 3,670 61.6 106 Cotuí (240100) Cotuí (240100) 76,554 661.3 Cevicos (240201) Cevicos (240201) 8,693 199.0 84 La Cueva (240202) 5,066 46.2 104 Cevicos (240200) Cevicos (240200) 13,759 245.2 Fantino (240301) Fantino (240301) 22,117 89.0 62 Fantino (240300)) Fantino (240300)) 22,117 89.0 La Mata (240401) La Mata (240401) 13,040 36.4 57 La Bija (240402) 9,748 34.8 27 Angelina (240403) 11,589 40.9 41 Hernando Alonzo (240404) 4,585 78.1 115 La Mata (240400) La Mata (240400) 38,962 190.3 Sánchez Ramírez (240000) Sánchez Ramírez (240000) 1,185.8 ==Economy== The main economic activities in the province are farming and mining. Close to the town of Las Lagunas, in the Sierra de Yamasá, are the gold mines. The main products of farming in the Sierra de Yamasá are cacao, oranges and tobacco. In the Yuna valley, rice is the most important product but pineapple and orange are also produced. Cattle are also important in the province, mainly in the northwestern part of it. ==References== Category:Provinces of the Dominican Republic Category:1952 establishments in the Dominican Republic",
 "title": "Sánchez Ramírez Province"
}