{
 "id": "1050803",
 "text": "Demi Bennett (born 11 October 1996) is an Australian professional wrestler. She currently wrestles for the WWE, where she competes on the Raw brand under the ring name Rhea Ripley. She was a member of the stable The Judgment Day. During her time in WWE, she has been a one-time Raw Women's Champion, two-time WWE SmackDown Women's/Women's World Champion (with her and Bayley having the longest single reign of this title at 380 days), one-time WWE Women's Tag Team Champion, one-time NXT Women's Champion, one-time NXT UK Women's Champion, the winner of the Women's Royal Rumble in 2023, and the winner of the NXT UK Women's Championship Tournament. ==Career== ===WWE=== Ripley started her WWE career by competing in the first Mae Young Classic in 2017. She made it to the second round before losing to Dakota Kai. She then made her debut on the NXT brand on 25 October 2017 in a battle royal to become number one contender for the NXT Women's Championship. On the 22 March 2021 episode of Raw, Ripley made her main roster debut. She challenged Asuka to a match for the Raw Women's Championship at WrestleMania 37 which Asuka accepted. She defeated Asuka on the second night of WrestleMania 37 to win the Raw Women's Championship. She joined The Judgment Day at WrestleMania Backlash after she attacked AJ Styles in his match against Edge. At the Royal Rumble in 2023, Ripley competed in the women's Royal Rumble match. She entered at #1 and was able to win the match. She became the first woman to win the rumble at #1, had the longest time in a women's Royal Rumble match at 1:01:08, and was the fourth person overall to win from #1 (after Shawn Michaels in 1995, Chris Benoit in 2004, and Edge in 2021). On the first night of WrestleMania 39, Ripley defeated Charlotte Flair to become the SmackDown Women's Champion. The title was renamed \"Women's World Championship\" on June 12. On the April 15, 2024 episode of Raw, Ripley vacated the title after she injured her right arm. This ties her and Bayley for the longest single Women's World Championship reign at 380 days. ==Personal life== She is married to AEW wrestler Buddy Matthews. ==Championships== *CBS Sports **Breakthrough Wrestler of the Year (2019) *ESPN ** #2 on the list of the 30 best Pro Wrestlers Under 30. *Pro Wrestling Illustrated ** #11 out of the top 100 female wrestlers on the PWI Women's 100. (2020) *Riot City Wrestling **RCW Women's Championship (2 times) *Sports Illustrated ** #7 on the list of top 10 women's wrestlers in 2019. * WWE **WWE Raw Women's Championship (1 time) **WWE SmackDown Women's/Women's World Championship (2 times) **WWE Women's Tag Team Championship (1 time) (with Nikki A.S.H.) **NXT Women's Championship (1 time) **NXT UK Women's Championship (1 time, first) **Women's Royal Rumble (2023) **NXT UK Women's Championship Tournament (2018) **Seventh Women's Triple Crown Champion **Fifth Women's Grand Slam Champion == References == ==Other websites== * Category:1996 births Category:Living people Category:Australian professional wrestlers Category:Professional wrestling managers and valets Category:Sportspeople from Adelaide Category:WWE wrestlers",
 "title": "Rhea Ripley"
}