{
 "id": "1050108",
 "text": "The 2012–13 UEFA Champions League group stage, there were 32 teams: 22 that got in automatically and 10 that won in the play-off round (5 from the Champions Route and 5 from the League Route). These teams were divided into eight groups of four. They played each other twice, once at home and once away. The top two teams from each group moved on to the round of 16. The teams that finished third in their groups went down to the Europa League round of 32. == Teams == Key to colours in group tables Group winners and runners-up advanced to the round of 16 Third-placed teams entered the Europa League at the round of 32 {| class=\"wikitable\" Team ChelseaTH 135.882 Barcelona 157.837 Manchester United 141.882 Bayern Munich 133.037 Real Madrid 121.837 Arsenal 113.882 FC Porto 98.069 Milan 89.996 ; Notes * th Title holder (automatically gets the top position of seeding list) * CR Qualified through play-off round (Champions Route) * LR Qualified through play-off round (League Route) == Groups == === Group A === \\---- \\---- \\---- \\---- \\---- === Group B === \\---- \\---- \\---- \\---- \\---- === Group C === \\---- \\---- \\---- \\---- \\---- === Group D === \\---- \\---- \\---- \\---- \\---- === Group E === \\---- \\---- \\---- \\---- \\---- ; Notes * Note 1: FC Nordsjælland played their home matches at Parken Stadium, Copenhagen instead of their regular stadium, Farum Park, Farum. === Group F === ; Tiebreakers * Bayern Munich are ranked ahead of Valencia on head-to-head points. \\---- \\---- \\---- \\---- \\---- ; Notes * Note 2: BATE Borisov played their home matches at Dynamo, Minsk instead of their regular stadium, Gradski Stadium, Borisov as it did not meet UEFA criteria. === Group G === \\---- \\---- \\---- \\---- \\---- === Group H === ; Tiebreakers * Galatasaray are ranked ahead of CFR Cluj on head-to-head points. \\---- \\---- \\---- \\---- \\---- == References == Category:UEFA Champions League group stages",
 "title": "2012–13 UEFA Champions League group stage"
}