{
 "id": "1050478",
 "text": "The UEFA Women's Euro 2022 final was a last football match on 31 July 2022 at Wembley Stadium in London, England. It decided who would win the UEFA Women's Euro 2022. The teams playing were England and Germany, and England won 2-1. The final match had a full crowd of 87,192 people, which was a record for a women's international match in Europe and any European Championship final. England won the game 2–1 after extra time. This was their first time winning the European Championship, their first major women's international tournament, and the first time an English senior team had won a big football tournament since the 1966 FIFA World Cup, where they also beat Germany at Wembley. The match was very close, and both goals were scored in regular time in the second half and the last one in extra-time. The first goal was set up by England's Keira Walsh, who was named the best player of the match. The final between England and Germany, became a symbol of the women sports growing in Europe. == How the teams got here == === England === England's road to the final Opponent Result Austria 1–0 Norway 8–0 Northern Ireland 5–0 Spain 2–1 Sweden 4–0 England was chosen to host the UEFA Women's Euro 2022, so they automatically got a spot in the tournament. Before 2022, England, reached the final twice but didn't win. They lost to Sweden in 1984 after a penalty shootout and were runners-up again in 2009, losing 2-6 to Germany. As the host, England was placed in Group A with Austria, Norway (who had won the tournament twice before), and Northern Ireland, who were participating for the first time. England started their journey to win their first European title by defeating Austria 1-0. Then, they made history by beating Norway 8-0, which was the biggest win in the history of both men's and women's European Championships. After there being boosted by their record-breaking victory, England also defeated Northern Ireland 5-0, topping the group with a perfect record and no goals conceded. This set them up for a quarter-final match against Spain. In the quarter-finals, England allowed their first goal of the tournament, scored by Esther González. But they managed to equalize with a goal from Ella Toone before extra time. Then, a goal from Georgia Stanway secured a 2-1 win for England, taking them into the semi-finals against Sweden. In the semi-finals, England won over Sweden with a 4-0 victory, which included an impressive backheel goal by Alessia Russo and a mistake by Hedvig Lindahl. This win took England to the finals for the first time since 2009. === Germany === Germany's road to the final Opponent Result Denmark 4–0 Spain 2–0 Finland 3–0 Austria 2–0 France 2–1 Germany is the most successful women's team in Europe. They have won the Euro title eight times, with their most recent victory being a 6-2 win over England in 2009. In the qualifiers for the UEFA Women's Euro 2022, Germany was in Group I with Ukraine, Republic of Ireland, Greece, and Montenegro. They won all eight of their matches to secure a spot in the tournament held in England. During the main tournament, Germany was placed in Group B with Spain, Denmark, and Finland. They beat Denmark 4-0, avenging their loss in the previous edition's quarter-finals. They also defeated Spain 2-0 and Finland 3-0, finishing at the top of their group without conceding any goals. In the quarter-finals, Germany won 2-0 against Austria, earning them a place in the semi-finals where they faced France. In the semi-finals, Germany conceded their first goal of the tournament due to an own goal by their goalkeeper Merle Frohms, but they still managed to win with two goals from Alexandra Popp. This victory took them to the finals for the first time since 2013. == Match == === Details === {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Mary Earps RB 2 Lucy Bronze CB 6 Millie Bright CB 8 Leah Williamson (c) LB 3 Rachel Daly CM 10 Georgia Stanway CM 4 Keira Walsh RW 7 Beth Mead AM 14 Fran Kirby LW 11 Lauren Hemp CF 9 Ellen White Substitutions: MF 20 Ella Toone FW 23 Alessia Russo FW 18 Chloe Kelly DF 5 Alex Greenwood MF 16 Jill Scott FW 17 Nikita Parris Manager: Sarina Wiegman Player of the Match: Keira Walsh (England) Assistant referees: Maryna Striletska (Ukraine) Paulina Baranowska (Poland) Fourth official: Stéphanie Frappart (France) Reserve assistant referee: Karolin Kaivoja (Estonia) Video assistant referee: Paolo Valeri (Italy) Assistant video assistant referees: Maurizio Mariani (Italy) Pol van Boekel (Netherlands) |} Match rules * 90 minutes * 30 minutes of extra time if necessary * Penalty shoot-out if scores still level * Maximum of twelve named substitutes * Maximum of five substitutions, with a sixth allowed in extra time == Notes == == References == Category:UEFA Women's Euro 2022",
 "title": "UEFA Women's Euro 2022 final"
}