{
 "id": "105011",
 "text": "Korean food came from very old traditions in Korea. It has developed through many environmental, political, and cultural changes. There are special rules for eating meals in Korea. Korean food is mostly made up of rice, noodles, vegetables, and meats. Most Korean meals have many side dishes (called banchan) along with their steam-cooked rice.Fritscher, Lisa \"Korean Food Basics\". Kimchi is usually eaten at every meal. Sesame oil, doenjang, soy sauce, salt, garlic, ginger, pepper and gochujang are ingredients that are often used in the food. In different provinces of Korea, its ingredients and dishes are different, too. The Korean royal court cuisine used to serve all the best dishes from each province for the royal family. People follow special rules when they eat meals in Korea. == Sweets == Traditional rice cakes like tteok are eaten as treats during holidays and festivals. Tteok means all rice cakes made from pounded rice (메떡, metteok), pounded glutinous rice (찰떡, chaltteok), or glutinous rice that has not been pounded. It is usually filled or covered with sweet mung bean paste, red bean paste, raisins, or a sweet, creamy filling made with sesame seeds, pumpkin, beans, pine nuts, and honey. Tteok is usually eaten for dessert or as a snack. Sikhye is a traditional Korean beverage. Usually, people drink it during the Korean festive holidays (For example, New Year’s Day or Korean Harvest Festival). It is made with simple water ingredients, malted barley flour, sugar, and cooked rice. Yakgwa is a traditional Korean sweet pastry or cookie. Yakgwa is a type of yumil-gwa, which is a deep-fried, wheat-based hangwa made with powdered grains, honey, malt, and sugar. This food is enjoyed on festive days such as chuseok. == Dining manners == The oldest people are usually served first, and it is thought rude to pick up chopsticks or eat before the oldest people do so. In Korea, unlike in China and Japan, the rice bowl is not lifted up from the table. Spoons should not hit bowls while eating. You must not talk about dirty things. Some rules are now not important. For instance, talking used to be discouraged, but today people usually talk together at meals. Also, men usually ate at a different table than women, but now they eat all together. In Korea, they have both spoons and chopsticks, and together they are called sujeou (pronounced soo-juh - 수저). Usually, before they eat, people say, \"Jalmukgessemnidah (잘 먹겠습니다)\", and after they are finished, they say, \"Jalmuggussemnidah (잘 먹었습니다).\" Soups and stews must be set on the right side of the person who is eating. == List of Korean dishes == ===Meat dishes=== * Bulgogi (불고기): a popular dish of beef cooked on a grill. * Galbi (갈비): pork or beef ribs, thicker than bulgogi. It is often called \"Korean BBQ.\" * Samgyeopsal (삼겹살): Bacon, served like Galbi. It is often cooked with onions and garlic, and is eaten wrapped in lettuce. When it is wrapped in lettuce it is called ssam. The sauce spread on samgyeopsal when it is wrapped in lettuce is called ssamjang. ===Fish dishes=== * Hoe (pronounced 'hweh' - 회): raw seafood dish dipped in sauce and eaten wrapped up in lettuce or sesame leaves. * Sannakji (산낙지): Raw octopus. It is usually served alive. ===Soups and stews=== * Guk (국): soup * Tang (탕): stew * Jjigae (찌개): stew ===Grain dishes=== These dishes are usually made with rice. * Bibimbap (비빔밥): rice with vegetables (나물) * Boribap (보리밥) * Ogokbap (오곡밥): five-grain rice ===Snacks or simple foods=== These simple foods can be bought at shops on the street and are usually thought of as snacks rather than meals. * Bindaetteok (빈대떡): Meaning mung-bean pancake * Bungeoppang (붕어빵): A popular fish-shaped cake, pastry. * Kimbap (김밥) == References == === Bibliography === *Baek Un-hwa (백운화). Inje Food Science Forum (인제식품과학 FORUM), \"Part 3 Status quo and prospect about the industrialization of Korean traditional beverages (제 3 주제 전통 음청류의 산업화 현황과 전망)\" taken from on 2008-06-15. pp. 75~95. * Coultrip-Davis, Deborah, Young Sook Ramsay, and Deborah Davis (1998). Flavors of Korea: Delicious Vegetarian Cuisine. Tennessee: Book Publishing Company. . *Cost, Bruce. Asian ingredients: a guide to the foodstuffs of China, Japan, Korea, Thailand, and Vietnam. New York: Harper Perennial, 2000. *Crawford, Gary W. (2006) East Asian Plant Domestication. In Archaeology of East Asia, edited by Miriam Stark. Wiley-Blackwell, 2006 *Food in Korea, \"Jontongjoo - Kinds of Traditional Liquors\" taken from *Fritscher, Lisa. \"Korean Food Basics: What You Might Find On A Korean Food Menu\" taken from on 2007-11-17. *Herskovitz, Jon. Reuters, \"North Korean beer: great taste, low proliferation risk\", Mar 9, 2008, taken from *Hopkins, Jerry. Extreme Cuisine: The Weird & Wonderful Foods that People Eat, Singapore: Tuttle Publishing, 2004. *Korea Agro-Fisheries Trade Corporation. \"Introduction of Eumcheongryu\" taken from on 2008-05-22. *Korea Tourism Organization. \"Experience Royal Cuisine\" taken from on 2008-06-13. *Koryǒsa, The History of the Koryǒ Dynasty, Seoul, 1990. *National Assembly of the Republic of Korea. \"King Sejong's Humanism\" taken from on 2008-06-10. *Marks, Copeland. The Korean Kitchen: Classic Recipes from the Land of the Morning Calm. San Francisco: Chronicle Books, 1993. *O'Brien, Betsy. Let's Eat Korean Food. Elizabeth, NJ:Hollym, 1997. * *Sohn Gyeong-hee (손경희). Inje Food Science Forum (인제식품과학 FORUM), \"Part 1 HIstorical overview of Korean traditional eumcheongryu (제 1 주제 한국 전통 음청류의 역사적 고찰)\" taken from on 2008-06-16. *The Academy of Korean Studies. \"농사직설(農事直說), Nongsa jikseol\" taken from on 2008-06-10. *The Chosun Ilbo. \"Hanjeongsik, a full-course Korean meal\" taken from on 2008-06-11. *The Korea Economic Daily, \"Brew master.. the only beer in the world\" (브루 마스터 .. 세계 유일의 맥주) taken from *Yi Kyubo, Tongmyǒng-wang p'yǒn' (The lay of King Tongmyǒng) in Tongguk Yi Sangguk chip (The Collected Works of Minister Yi of the Eastern Country), Seoul, 1982. * Yi Yang-Cha, and Armin E. Möller (1999). Koreanisch vegetarisch: Die kaum bekannte, fettarme, phantasievolle und küchenfreundliche Art asiatisch zu kochen (Korean Vegetarian: Almost Unknown, Low Fat, Creative and Kitchen-friendly Way of Asian Cooking). . *Yi Tǒngmu, Sasojǒl (Elementary Etiquette for Scholar Families), quaoted in Sources of Korean Tradition, Volume Two: From the Twentieth Centuries, ed. Yǒongho Ch'oe, Peter H. Lee and W. Theodore de Bary. New York, 2000. *Yu Jisang (유지상). \"How about today? Pojangmacha, outing at night\" (오늘 어때? 포장마차 ‘밤마실’) taken from on 2008-06-13. == Other websites == https://mykoreankitchen.com/sikhye/https://kimchimari.com/yakgwa-or-yakwa/ * Korea National Tourism list of Korean food",
 "title": "Korean food"
}