{
 "id": "1051846",
 "text": "Romance movies are a genre of movies that involve romantic love stories. They are recorded in visual media for broadcast in theatres or on television. These movies focus on passion, emotion and the romantic involvement of the main characters. The story is normally about such things as dating, courtship or marriage. These main focus of the plot of these movies is the search for romantic love. There movies can also include problems for the characters to overcome. These can include problems with finances, physical illness, discrimination, psychological issues or family resistance. As in all romantic relationships, the problems of day-to-day life, temptations (of infidelity), and personal differences are often parts of the plots of romantic movies. Romantic movies often deal with many different types of love. These include love at first sight, young love, unrequited love, obsession, spiritual love, forbidden love and tragic love. For many people. romantic movies are escapes and fantasies. This is often the case if the two leads overcome their difficulties, fall in love and \"happily ever after\". In romantic television series, the development of such relationships may happen over many episodes or even seasons. Screenwriter Eric R. Williams list Romance Movies as one of eleven super-genres in his screenwriters' taxonomy. He says that all feature length narrative movies can be classified by these super-genres. The other ten super-genres are action, crime, fantasy, horror, science fiction, comedy, sports, thriller, war and western.Williams, Eric R. (2017). The screenwriters taxonomy : a roadmap to collaborative storytelling. New York, NY: Routledge Studies in Media Theory and Practice. . . P. 21 ==Subgenres== === Chick flick === Chick flick is a term used for romance movird targeted to a female audience. Movies of this genre include Gilda, The Red Shoes, Sense and Sensibility, Gentlemen Prefer Blondes, Dirty Dancing, The Notebook, Dear John, , Thelma & Louise, Fifty Shades of Grey, Sleepless in Seattle,You've Got Mail and Romeo + Juliet. === Historical romance === These are also known as epic romances. They are a romantic story with a historical period setting, They often include war, revolution or tragedy. This includes movies such as Gone with the Wind, Doctor Zhivago, , Titanic, A Very Long Engagement, and Cold War. === Paranormal romance === Paranormal romance is a popular genre of movie which features romantic relationships between humans and supernatural creatures. Popular tropes include vampirism, time travel and ghosts – things that cannot be explained by science. Examples of these movies include movies based on the Twilight Saga, The Exterminating Angel,, Warm Bodies, Vampire Academy and I Am Dragon. === Romantic action === Romantic action is a movie that blend romance and action. Examples include The Hunger Games, The Adventures of Robin Hood,, The Best Years of Our Lives, , The Quiet Man, Mr. & Mrs. Smith and Knight and Day. === Romantic comedy === Romantic comedies are a very common subgenre of romantic movies. They are also called rom-coms. These movies are a mix of romance and comedy. They usually have light-hearted, humorous plotlines, Rom-coms are often about romantic ideals such as that true love is able to overcome all obstacles. Movies in this genre include , A Night at the Opera, It Happened One Night, His Girl Friday, Roman Holiday, Lost In Translation, To All the Boys I've Loved Before, Four Weddings and a Funeral, Dave, Say Anything..., Moonstruck, Something's Gotta Give, When Harry Met Sally..., Annie Hall and The Apartment. === Romantic drama === Romantic dramas are often about something that prevents true love between two people. The end of a romantic drama typically does not show if a romantic union occurs. Some examples of romantic drama movies are Casablanca, Pride & Prejudice, Sommersby, The Bridges of Madison County, The English Patient, Shakespeare in Love, and An Officer and a Gentleman. Same-sex romantic dramas that deal with LGBT issues include Brokeback Mountain, Blue is the Warmest Colour, Moonlight, and Call Me by Your Name. === Romantic fantasy === Romantic fantasies tell fantasy stories using many of the elements of the romance genre. Some examples include The Lady Eve, Singin' in the Rain, Groundhog Day, Enchanted, Beauty and the Beast, Eternal Sunshine of the Spotless Mind, Midnight in Paris and The Shape of Water. === Romantic musical === Romantic musical (alternatively musical romance) is a genre that combines romance and musicals. They have romantic relationships and whose story is told with song and dance. This genre began on Broadway. It later moved to cinema because of to the popularity of the Rodgers and Hammerstein productions. Some examples include West Side Story and its 2021 remake, Grease, High School Musical, Across the Universe, Moulin Rouge! and La La Land. === Romantic thriller === Romantic thriller is a genre of movie that combines the romance movie with and the thriller genre. Some examples of romantic thriller movies are Vertigo, The Crying Game, , Unfaithful, The Phantom of the Opera and The Adjustment Bureau. ==Related pages== * Romantic comedy * Drama (movies and television) * Romance (love) ==References== ==Other websites== * Top-rated English-language Romance movies at IMDb Category:Movie genres Category:Relationships",
 "title": "Romance movie"
}