{
 "id": "1051999",
 "text": "Psychedelic trance or psytrance, is a subgenre of trance music characterized by special types of rhythms and several surfaces of melodies and high tempo riffs. The musical style offers variety in terms of mood, tempo, and style. Goa trance came before psytrance; when digital media became more commonly used- psytrance evolved. Goa continues to develop alongside the other genres. == History == === Origins === The first hippies who came to the city of Goa, in India in the middle of the 1960s ,came there for several reasons: the beaches, the low cost of living, the friendly local people, the Indian religious and spiritual practices and the accessible cannabis, which until the mid-1970s was completely legal. During the 1970s the first Goa DJs were generally playing music by psychedelic rock bands such as the Grateful Dead, Pink Floyd and The Doors. In 1979, the beginnings of electronic dance music could sometimes be heard in Goa in the form of music by artists such as Kraftwerk but only in 1983 that DJs Laurent and Fred Disko, closely followed by Goa Gil, began changing the Goa style over to electro-industrial/EBM which was at the time was controlling Europe. The tracks were remixed, the lyrics were removed, the melodies and beats and generally controlling the sounds in all kinds of ways before the tracks were finally presented to the dancers as custom Goa-style mixes. By the beginning of the 90's Goa was starting to draw attention and had become a popular destination for people to party. As the scene became bigger, Goa-style parties spread worldwide since 1993. Parties in the UK helped create several international labels in various countries (U.K. Australia, Japan, Germany and Israel) to promote psychedelic electronic music and local scenes that reflected the attitude and beliefs of Goa parties, Goa music, and Goa-specific artists, producers, and DJs. Goa Trance as commercial scene began gaining global traction in 1994. ==Characteristics== Psychedelic trance has a unique, energetic sound, usually faster than other forms of trance or techno music with beats generally ranging from 135 and up to 150 BPM . however some psytrance songs can also reach 190BPM, 200bpm, 210bpm and even 300bpm. It uses a very special bass beat that pounds the entire duration of the song and covers the bass with rhythms borrowed from funk, techno, dance, acid house, eurodance and trance using drums and other instruments. The different leads, rhythms and beats generally change every eight bars.Trance music. A definition of genre. . Retrieved 25 May 2013. Layering is a technique used to create effect in psychedelic trance, with new musical ideas being added at regular intervals, often every four to eight bars. New layers will continue to be added until a climax is reached, and then the song will break down and start a new rhythmic pattern over the constant bass line. Psychedelic trance tracks tend to be six to ten minutes long. This includes a developed and atmospheric introduction, and a breakdown in the middle of the track of around 30 seconds to over a minute. == Festivals == Psytrance festivals tend to be culturally and musically diverse. Earthdance, which is considered world's largest music and dance festival for peace, started from the psychedelic trance culture. At the 2004 Glastonbury Festival in the UK, psytrance was given a whole day on the Glade stage. The Boom Festival in Portugal began as a psytrance festival but has since adopted other styles such as world music. It is held in August every other year and combines social activism with cultural and spiritual elements. The Ozora Festival in Hungary is a music festival which focuses on art and emphasizes on connecting with nature and oneself. Psytrance is still very popular at this festival. In 2007- a research was conducted on the global psytrance scene. 600 people from 40 countries provided different detailed information via an online questionnaire. The results were published as \"Beyond Subculture and Post-subculture? The Case of Virtual Psytrance\" in the Journal of Youth Studies. In 2012 Graham St. John published Global Tribe: Technology, Spirituality and Psytrance, Equinox. (). == Related pages == * Trance music == References == == Sources == * St John, Graham. (ed) 2010. The Local Scenes and Global Culture of Psytrance . London: Routledge. (). * St John, G. 2011. DJ Goa Gil: Kalifornian Exile, Dark Yogi and Dreaded Anomaly. Dancecult: Journal of Electronic Dance Music Culture 3(1): 97–128. * St John, G. 2012. Seasoned Exodus: The Exile Mosaic of Psyculture. Dancecult: Journal of Electronic Dance Music Culture 4(1): 4–37. * St John, G. 2012. Global Tribe: Technology, Spirituality and Psytrance, Equinox. (). == Other websites == * Category:Trance music Category:Pages with unreviewed translations",
 "title": "Psychedelic trance"
}