{
 "id": "1051200",
 "text": "Krste Petkov Misirkov (; 18 November 1874 – 26 July 1926) was a journalist, historian and poet. He helped with creating the Macedonian language and the Macedonian alphabet. Misirkov wrote the book \"On Macedonian Matters\", the magazine \"Vardar\" and a large number of scientific articles published in many newspapers. He also helped out in the translation of books and the collection of folk songs. He was a member in pro-Macedonian organizations in Belgrade, Sofia and Saint Petersburg.Boehm, Eric (1996). Historical Abstracts: Modern history abstracts, 1775-1914. American Bibliographical Center. page. 253. A survey conducted in the Republic of Macedonia found Misirkov to be \"the most important Macedonian of the 20th century\".Македонија мора да го има Крсте Мисирков во своите пазуви (2001) by Ana Choreva For his efforts to create a standard Macedonian language, he is often considered \"the founder of the modern Macedonian literary language\". == Childhood == Krste Misirkov was born in November 1874 in the village of Postol, in Ottoman Empire. The village is located not far from the ancient Macedonian capital Pella. He completed six grades of primary school in his hometown, listening to classes in Greek. The poor financial condition of his family did not allow him to immediately continue his education. After a break of several years, Misirkov received a diploma from the Serbian society \"Sveti Sava\". through this was more of an attempt for Serbian influence in Macedonia and the installation of various scholarships for the education of the so-called own staff, as the Greek and Bulgarian propaganda in Macedonia had already done. Krste Petkov Misirkov, although he finished the gymnasium, still decided to go to another high school: the Belgrade teacher's school, which he completely finished in 1895. In this school, Misirkov founded a student group and called it \"Vardar\", with its own program that the members of the group should get to know each other and work out a single program. The members of the group in a certain sense continued the idea of the so-called \"Vinegrowers\". For Misirkov, that was the beginning of an organized national-political activity that would continue for about 30 years.Георги Сталев - Литература на Македонскиот јазик == Time in Russia == After finishing the teacher's school, Misirkov got a job in Pristina. But instead of showing up at his workplace, Misirkov secretly moved to Odessa. Misirkov was forced to enroll in a spiritual theology in Poltava and only after two years to begin his studies: at first at the Medical Faculty in Petrodonski Sloven. Getting involved in the Petrograd student environment, Misirkov became very active. Among other things, he also wrote a brilliant report entitled On the meaning of the Moravian or Resava dialect for the contemporary and historical ethnography of the Balkan Peninsula and published some of his works on local Russian newspapers. On his next visit to Petrograd, Misirkov became a member of a local Student Society and founded the Secret Macedonian-Odrina Committee with several like-minded people. However, Russia during the pre-revolutionary period decided to close the Petrograd University. Because of that, Misirkov had nothing else left, so he left Petrograd and moved to Odessa.Hugh Poulton (2000). Who are the Macedonians?. C. Hurst & Co. Publishers. p. 58. ISBN 978-1-85065-534-3. In the same year, the Macedonian Student Fellowship was founded in the Russian capital. Misirkov himself made a significant contribution to the organization of this society. Just one year later, this scientific-literary fellowship was renamed and since then it has been operating as the Macedonian Scientific-Literary Society \"Saint Kliment\", around this time he tried spreading awareness on the Macedonian language in Russia.Rutar, Sabine (2017). The Balkan Wars from Contemporary Perception to Historic Memory. Springer. стр. 301. ISBN 3319446428. == Late life and death == === Activities in Macedonia === Krste Misirkov returned in Bitola and worked on the plan for opening Macedonian schools. It was at that time that the Ilinden Uprising broke out, in which Misirkov did not personally participate. Around this time he wrote his infamous book which he gave the title On Macedonian Matters, as well as on some manuscripts for textbooks. In order to publish his book, Misirkov went to Sofia. Part of the Belgrade press and Sofia press fiercely attacked Misirkov for that lecture he gave in the hall of the Great School. === Emigrating to Bulgaria === he went to Moldovia to participate in the vote to establish a union between Bessarabia and Romania, Misirkov abstained. As an opponent of the annexation of Bessarabia to the Kingdom of Romania, that's why they expelled him from Chisinau to Odessa. He asked to receive service in Yugoslavia. His plea went unanswered. Unable to return to Russia, Misirkov fell into a crisis. IMRO considered him harmful to the crime, but after Misirkov's meeting with a representative of the Organization, it decided not to take specific steps against him.Промемория на Никола Трайков за разговор с проф. Петко Стоянов за Кръстю Мисирков, София, 8 март 1963. Misirkov fell seriously ill, so he ended up in the \"Alexandrov Hospital\" in Sofia, where he died on July 26, 1926. Misirkov was buried in the Sofia cemetery plot 89, row 17, grave 4 where the remains of Ekaterina Mihailovna-Misirkova (his wife), Sergej Misirkov and Boris Misirkov (his children) are also located. == Sources == Category:1874 births Category:1926 deaths Category:Macedonian writers",
 "title": "Krste Misirkov"
}