{
 "id": "1051382",
 "text": "Tyson Smith (born October 16, 1983) is a Canadian professional wrestler. He currently wrestles for All Elite Wrestling (AEW), where he competes under the ring name Kenny Omega. Besides wrestling, he is also the executive vice president of AEW. Smith has also competed in New Japan Pro-Wrestling (NJPW), Ring of Honor (ROH), Impact Wrestling, and Lucha Libre AAA Worldwide (AAA). As well as competing on the independent circuit for DDT Pro-Wrestling (DDT) and Pro Wrestling Guerrilla (PWG). Smith has won many Championships in many different companies. In AEW, he is a one-time AEW World Champion, one-time AEW International Champion, one-time AEW World Tag Team Champion, and two-time AEW World Trios Champion. This made him the first Grand Slam Champion in AEW history. ==Career== ===DDT Pro-Wrestling=== During his early career in DDT Pro-Wrestling, Omega was in a tag team with Kota Ibushi called the Golden☆Lovers. They would later team again in New Japan Pro-Wrestling (NJPW) and All Elite Wrestling (AEW). ===New Japan Pro-Wrestling=== During his time in New Japan Pro-Wrestling (NJPW), Omega was known by the nickname The Cleaner. He was the leader of the stable Bullet Club, a group of heel gaijin. He was kicked out of Bullet Club on the Night 2 of The New Beginning in Sapporo after he lost the IWGP United States Championship to Jay White and got hit with the Cross Rhodes by Cody Rhodes. ===All Elite Wrestling=== On February 7, 2019, Omega signed a four-year contract with All Elite Wrestling (AEW). Omega made his AEW in-ring debut at Double or Nothing on May 25, 2019 losing to Chris Jericho. At Chris Jericho's Rock 'N' Wrestling Rager at Sea Part Deux: Second Wave, Omega and Adam Page won the AEW World Tag Team Championship after defeating SoCal Uncensored (Frankie Kazarian and Scorpio Sky). They lost the titles to FTR (Cash Wheeler and Dax Harwood) at All Out. Omega focused on single matches afterwards. At Full Gear, he defeated his former tag parter Adam Page in the finals of a AEW World Championship number one contender tournament. He won the AEW World Championship at Winter Is Coming and turned heel after Don Callis got up from the commentary booth and distracted Jon Moxley. When Moxley turned around, Omega hit him in the head with a microphone and pinned him. Because of AEW's working relationship with Impact Wrestling at the time, Omega also appeared on episodes of Impact!. He defeated Rich Swann on Impact Wrestling's Rebellion pay-per-view to win the Impact World Championship. On the August 18 debut episode of Rampage, Omega lost the title to Christian Cage. At Full Gear, Omega also lost the AEW World Championship to Adam Page and took time off from wrestling to heal from injuries. On the August 17, 2022 episode of Dynamite, Omega returned to AEW and was revealed to be the third partner for The Young Bucks. The three competed in a tournament to crown the first AEW World Trios Champions. They won the Championships from Adam Page and The Dark Order (Alex Reynolds, and John Silver) at All Out. However, they were later suspended and stripped of them because of a real-life backstage fight that took place between Omega, the Young Bucks, CM Punk, and Ace Steel. Omega and the Young Bucks returned from suspension on November 19, 2022 and faced Death Triangle at Full Gear but lost. During their feud with the Blackpool Combat Club, Omega and the Young Bucks said that they had a mystery partner join them for their fight at Blood & Guts. On the July 13 episode of Dynamite, Omega and the Young Bucks revealed Kota Ibushi as their mystery parter, reuniting the Golden☆Lovers. They defeated the Blackpool Combat Club, Konosuke Takeshita, and Pac. On August 2, 2023, Omega signed a multi-year contract extension to stay with All Elite Wrestling. In December, he became inactive after being diagnosed with diverticulitis. He returned a year later on December 28 at Worlds End. At Revolution on March 9, 2025, he defeated Konosuke Takeshita to win the AEW International Championship for the first time. As a result, he became the first wrestler to hold four different AEW championships. ==Personal life== Smith is fluent in Japanese, having learned the language after spending many years living and working in Japan. He hosted a show called Cleaner's Corner on YouTube where he reviewed and played old video games. == References == ==Other websites== *Official website * Category:1983 births Category:Living people Category:All Elite Wrestling executives Category:All Elite Wrestling people Category:Canadian professional wrestlers Category:Canadian YouTubers Category:Sportspeople from Winnipeg Category:Twitch (service) streamers",
 "title": "Kenny Omega"
}