{
 "id": "1051630",
 "text": "Nath (transl. 'nose ring') is an Indian romantic drama television series. It premiered 23 August 2021, and it was aired on Dangal under Story Square Production. ==Cast== *Chahat Pandey as **Mahua Aditya Rathore: Dharma's younger daughter; Bablu and Boondi's younger sister; Shambhu and Aryan's widow; Aditya's wife; Krishna and Gauri's mother (2021–2023) (Dead) **Krishna Mishra Narayan: Aryan and Mahua's elder daughter; Gauri's elder twin sister; Garjan's elder granddaughter; Premlata's elder stepgranddaughter; Aditya's step-daughter; Jeet's first wife (2023–Present) ***Aditi Mishra as Child Krishna Mishra (2022–2023) *Arjit Taneja as Shambhu Singh Thakur: Mahua's first husband (2021–2022) (Dead) *Avinash Mishra as **Inspector Aryan Mishra: Garjan's elder twin son; Mahua's second husband; Premlata's step-son; Krishna and Gauri's father; Viren's elder twin brother; Shambhu's best friend; Jhelum, Kajal and Garima's ex-fiancé (2022–2023) (Dead) **Viren Mishra: Garjan's younger twin son; Aryan's younger twin brother; Mahua's one-sided obsessive lover (2022) (Dead) *Ankit Gera as Captain Aditya Rathore: Mahua's widower; Krishna and Gauri's step-father (2023) *Aalisha Panwar as Gauri Mishra Narayan: Aryan and Mahua's younger daughter; Garjan's younger granddaughter; Premlata's younger step-granddaughter; Aditya's step-daughter; Jeet's ex- girlfriend and one-sided obsessive lover; Sukant's wife (2023–Present) ***Puvika Gupta as Child Gauri Mishra (2022–2023) *Arjun Singh Dalal as Jeet Narayan:Gopala and Krishna's husband; Raghuvendra and Sarasvali's son; Sukant and Kalavati's nephew; Abhimanyu's cousin; Gauri's ex–boyfriend (2023–Present) *Ishita Ganguly as Gopala Narayan: Jeet's second wife (2023–Present) *Abhishek Tewari *Ajay Chaudhary as Sukant Narayan: Gauri's husband; Mahua's murderer; Jeet's uncle (2023–Present) *Anurag Sharma *Aditi Asija *Pratima Kazmi ==References== ==Other websites== * * * Nath – Zewar Ya Zanjeer on Dangal Play Category:Hindi-language television series Category:Romance television series Category:2020s Indian television series Category:2021 Indian television series debuts Category:2020s drama television series",
 "title": "Nath (TV series)"
}