{
 "id": "1051798",
 "text": "The AEW TNT Championship is a professional wrestling championship in All Elite Wrestling (AEW). It is the men's television championship and the secondary men's championship in AEW. ==History== On the March 30, 2020 episode of AEW's YouTube show Road to Dynamite, the championship was officially announced. The first champion was Cody. He defeated Lance Archer in the finals of a tournament at Double or Nothing. Cody was awarded the championship by boxer Mike Tyson after his win. During Cody's second reign, he was able to regain the trademark for the Rhodes name so his ring name was changed to Cody Rhodes. The original version of the TNT Championship had a red strap. The red strap version was retired on December 30, 2020 after Mr. Brodie Lee died. During the tribute show, AEW owner Tony Khan gave the red version to Lee's son, Brodie Lee Jr. and named him the \"TNT Champion for life\". The new version was introduced on the January 6, 2021 New Year's Smash episode of Dynamite. The current version has a black strap on the championship. Dynamite moved to TBS on January 5, 2022. Even though the show moved to TBS from TNT, Cody Rhodes announced that the TNT Championship wouldn't be renamed. AEW instead announced that a new championship called the AEW TBS Championship would be created for the women. During Rhodes' third reign as champion, he had to be pulled from his rematch with Sammy Guevara because his family had COVID-19 and he had to quarantine. AEW president Tony Khan said that Rhodes would keep the championship but a new interim champion would be crowned at Battle of the Belts. The interim champion would then face Rhodes after he returned from quarantine to see who would become the undisputed champion. Guevara defeated Cody's brother Dustin Rhodes at Battle of the Belts. On January 26, 2022, Rhodes would return and lose to Guevara in a ladder match at Beach Break. Adam Cole, who is in his first reign. He won the title by defeating Daniel Garcia at Dynasty on April 6, 2025. == Reigns == == Footnotes == == References == == Other websites == * Category:All Elite Wrestling championships",
 "title": "AEW TNT Championship"
}