{
 "id": "10512",
 "text": "Tom Hanks (born July 9, 1956) is an American actor, director, producer, screenwriter, and writer. ==Career== Many of Hanks' early movies were comedies. He was made famous by his roles in Splash and Big. He made his way into drama with A League of Their Own and Philadelphia. He combined the two genres with Forrest Gump. Hanks has starred in many more famous movies since, including Apollo 13, Saving Private Ryan, Toy Story (only his voice was used), Cast Away, The Terminal, The Da Vinci Code, The Green Mile, Captain Phillips, Sully, Bridge of Spies and The Post. Hanks played Fred Rogers in Marielle Heller's biographical movie A Beautiful Day in the Neighborhood (2019), a role which earned him a Golden Globe and Academy Award nominations. In 2022, Hanks played Colonel Tom Parker in the Elvis Presley biopic Elvis. That same year, he also played Geppetto in the Disney live-action remake Pinocchio. Hanks has won several awards for acting. He won both a Golden Globe and an Academy Award for Best Actor for his role in Philadelphia. He also won a Golden Globe, an Academy Award, a Screen Actors Guild Award, and a People's Choice Award for Best Actor for his role in Forrest Gump. In 2014, he received a Kennedy Center Honor and, in 2016, he received a Presidential Medal of Freedom from President Barack Obama, as well as the French Legion of Honor. ==Personal life== For his role in Saving Private Ryan, Hanks was honored as an honorary member of the United States Army Rangers Hall of Fame. In December 2019, he was naturalized as an honorary Greek citizen by the President of Greece. On March 12, 2020, Hanks announced that he and his wife Rita had tested positive for COVID-19 while shooting Elvis in Australia. ==Filmography== ===Film=== Title Year Credited as Notes Actor Producer Other Role(s) He Knows You're Alone 1980 Elliot Splash 1984 The Adventures of Buckaroo Banzai Across the 8th Dimension 1984 1985 Volunteers 1985 1986 Nothing in Common 1986 Every Time We Say Goodbye 1986 Limited release Dragnet 1987 Throw Momma from the Train 1987 Big 1988 1989 Turner & Hooch 1989 Joe Versus the Volcano 1990 1990 Radio Flyer 1992 Cameo 1992 Sleepless in Seattle 1993 Philadelphia 1993 Forrest Gump 1994 Apollo 13 1995 Toy Story 1995 Voice only That Thing You Do! 1996 Director and screenwriter Cats Don't Dance 1997 Voice only Saving Private Ryan 1998 1998 Spike Voice only You've Got Mail 1998 I Hate County 1999 Voice only Toy Story 2 1999 Voice only 1999 Cast Away 2000 Vanilla Sky 2001 My Big Fat Greek Wedding 2002 — Road to Perdition 2002 Catch Me If You Can 2002 2004 Connie and Carla 2004 — 2004 Elvis Has Left the Building 2004 Mailbox Elvis Cameo 2004 /Hero Boy/Father/Scrooge/Santa Claus/Hobo Voice and motion capture Executive producer 2005 Screenwriter and narrator — IMAX only 2006 Over the Hedge 2006 Woody Uncredited DreamWorks Animation films with Over the Hedge (May 19, 2006). Cars 2006 Woody Car Cameo Voice only 2006 — Starter for 10 2006 — For Your Consideration 2006 Fozzie Bear Voice only Evan Almighty 2007 — Executive producer Charlie Wilson's War 2007 2007 Himself Cameo Voice only Bee Movie 2007 Barry B. Benson Voice only Also co-writer and producer Nominated – Producers Guild of America Award – Animated Film Nominated – Kids Choice Award - Favorite Animated Voice Mamma Mia! 2008 — Executive producer City of Ember 2008 — 2009 Limited release My Life in Ruins 2009 — Executive producer Angels & Demons 2009 Where the Wild Things Are 2009 — Beyond All Boundaries 2009 Narrator — Short film Executive producer Toy Story 3 2010 Voice only Hawaiian Vacation 2011 Short film Voice only Larry Crowne 2011 Director and screenwriter Small Fry 2011 Short film Voice only Extremely Loud and Incredibly Close 2011 Cloud Atlas 2012 /Hotel Manager// /Cavendish Look-A-Like Actor/Zachry Partysaurus Rex 2012 Short film Voice only Parkland 2013 — Captain Phillips 2013 Saving Mr. Banks 2013 Bridge of Spies 2015 Ithaca 2015 TBA Post-production Executive producer 2015 Post-production My Big Fat Greek Wedding 2 2016 — Post-production Producer Inferno 2016 Post-production Sully 2016 Filming The Circle 2017 Bailey Filming Producer Toy Story 4 2019 Voice only ===Television=== Title Year Credited as Notes Actor Producer Other Role(s) 1980 Episode: \"Friends and Lovers/Sergeant Bull/Miss Mother\" Bosom Buddies 1980–82 Mazes and Monsters 1982 Television film Taxi 1982 Gordon Episode: \"The Road Not Taken: Part 1\" Happy Days 1982 Episode: \"A Little Case of Revenge\" Family Ties 1983–84 Episode: \"The Fugitive Part 1\" Episode: \"The Fugitive Part 2\" Episode: \"Say Uncle\" Saturday Night Live 1985– 2015 Host Various characters 8 times as host (1985–2006) 8 times as guest/ cameo (2001–15) Tales from the Crypt 1992 Director Baxter Episode: \"None but the Lonely Heart\" Rugrats 1992 Charlie The SWAT Officer Episode: \"Garage Sale\" Fallen Angels 1993 Director Trouble Boy #1 Episode: \"I'll Be Waiting\" 1993 Director — Episode: \"The Monkey's Curse\" From the Earth to the Moon 1998 Director and screenwriter Episode: \"Le voyage dans la lune\" Episode: \"\"Can We Do This?\" 4 episodes Executive producer Band of Brothers 2001 Director and screenwriter British Officer Miniseries Executive producer Episode: \"Crossroads\" Episode: \"Currahee\" Cameo Freedom: A History of US 2003 // 7 episodes Big Love 2006–11 — Executive producer Mona the Vampire 2006 Episode: \"Mona and the Talking Mice/The Ogre Hunters\" 2010 Narrator — Miniseries; 6 episodes Executive producer 30 Rock 2011 Himself Cameo Killing Lincoln 2013 Narrator — Television film Toy Story of Terror! 2013 Halloween Special Voice only 2013 — Documentary Executive producer 2014 — Documentary series Executive producer Olive Kitteridge 2014 — Miniseries Executive producer Toy Story That Time Forgot 2014 Christmas Special Voice only The Seventies 2015 — Documentary series Executive producer ===Music video appearances=== Title Year Artist I Really Like You 2015 Girls Night In 2015 ===Stage=== Production Year Theatre Role Notes 1977 Lakewood Civic Auditorium Grumio Hamlet 1977 Lakewood Civic Auditorium Soldier, Reynaldo Polly 1978 Lakewood Civic Auditorium Hacker 1978 Lakewood Civic Auditorium Proteus 1978 Lakewood Civic Auditorium Muz King John 1978 Lakewood Civic Auditorium Twelfth Night 1979 Lakewood Civic Auditorium Fabian Juno and the Paycock 1979 Lakewood Civic Auditorium Do Me a Favorite 1979 Lakewood Civic Auditorium Harold 1979 Riverside Shakespeare Theater Callimaco Lucky Guy 2013 Broadhurst Theatre New Toy Story 2020 Disney Theatrical Productions Voice only ==References== Category:1956 births Category:Living people Category:Actors from Contra Costa County, California Category:American Christians Category:American movie actors Category:American stage actors Category:American television actors Category:American voice actors Category:Best Actor Academy Award winners Category:Emmy Award winning actors Category:Golden Globe Award winning actors Category:People from Concord, California Category:People's Choice Award winners Category:Saturn Award winners Category:Screen Actors Guild Award winners Category:Writers from California",
 "title": "Tom Hanks"
}