{
 "id": "105192",
 "text": "George I (George Louis; 28 May 1660 – 11 June 1727) was the ruler of Hanover in North Germany and later also the King of Great Britain and Ireland. == Family == George was born in Osnabrück, Germany, on 28 May 1660. He lived most of his life in the Electorate of Hanover, one of the many German countries that was part of the Holy Roman Empire. This area is today part of Germany. He married his cousin Sophia Dorothea (the daughter of his father's brother George William) in 1682. On 10 November 1683, their first child and only son, George Augustus, was born. When George Louis was King of Great Britain, George Augustus was the Prince of Wales. When the father died, the son became king, as George II. On 16 March 1687, their second child and only daughter was born. She was called Sophia Dorothea, after her mother. She later married and became the Queen in Prussia. Because she was married, she did not live in Britain with her father, but in Prussia with her husband. George and his wife drifted apart, because he preferred his mistress Melusine, with whom he had three daughters, Anna, Melusine and Margaret. Meanwhile, his wife was having an affair with Count Philip Christopher of Königsmarck, who was found dead in a river, rumoured to have been murdered on George's orders. The marriage was ended in 1694, on the grounds that Sophia Dorothea had effectively abandoned George. Sophia Dorothea's father, George William, and George Louis, had Sophia Dorothea imprisoned in Ahlden Castle in Celle, where she was unable to see her father, former husband, or children. In 1698, his father died and George became the ruler (\"Prince-elector\") of Hanover. == King of Great Britain == When Queen Anne of Great Britain died in 1714, an act of parliament said the next ruler must be a Protestant. George was not the closest relative, but was the closest Protestant one. All the closer relatives were Roman Catholic, so George became King of Great Britain and Ireland on 1 August 1714. He was the first ruler of Great Britain from his family, the House of Hanover. Many of the British people did not like the new king. It is often said that he could not actually speak English. This may have been true at first, but he sometimes wrote in English later in his reign. George spent less time running the country than previous monarchs and allowed Parliament to have a bigger role. Later on, he left Robert Walpole in charge of running the country. Walpole became the first British prime minister, although the word \"prime minister\" was not used at the time. He died while travelling from England to Hanover on 11 June 1727. Category:1660 births Category:1727 deaths Category:Kings and Queens of Great Britain Category:People from Osnabrück",
 "title": "George I of Great Britain"
}