{
 "id": "1051606",
 "text": "Nikitin Dheer is an Indian actor who works in Hindi and Telugu language films, and television shows. He was a contestant on Fear Factor: Khatron Ke Khiladi 5. == Acting career == Dheer made his acting debut in 2008 with Ashutosh Gowariker's historical drama Jodhaa Akbar, in which he starred alongside Hrithik Roshan and Aishwarya Rai Bachchan, as Sharifuddin Hussain, Akbar's brother-in-law. Although the film received critical acclaim and box office success, Dheer received praise for his role, with noted critic Taran Adarsh of Bollywood Hungama calling it \"fantastic\". The same year he starred alongside Vivek Oberoi, Shriya Saran and Zayed Khan in Apoorva Lakhia's action thriller Mission Istanbul. In 2011, Dheer appeared in the comedy Ready directed by Anees Bazmee, alongside Salman Khan and Asin. The following year, she had a supporting role in the action film Arbaaz Khan Dabangg 2 alongside Salman Khan, Sonakshi Sinha and Prakash Raj. In 2013, she appeared as the main antagonist in the action comedy Rohit Shetty Chennai Express alongside Shahrukh Khan and Deepika Padukone. For his role as Tangaballi, a besieged Tamil criminal, Dheer was asked to gain more muscle and use his loghat. His physics in the film was received favourably; Mohar Basu stated that Dheer was \"strong\" even though \"almost did not have enough role to play\". == Personal life == Dheer is Punjabi and is the son of actor Pankaj Dheer. He married Kratika Sengar on September 3, 2014, in an arranged marriage. The couple has a daughter. == Filmography == year Title Role Language 2008 Jodhaa Akbar Sharifuddin Hussain Hindi Istanbul Mission Al Ghazni Hindi 2011 Ready Aryan Chaudhary Hindi 2012 Dabangg 2 Chunni Hindi 2013 Chennai Express Thangaballi Hindi 2015 Kanche Colonel Eeshwar Prasad Telugu 2016 Housefull 3 Rohan Patel Hindi Crazy Ali Danger Bhai Hindi 2017 Goutham Nanda Gowda Telugu Sir Rahul Wadayar Telugu 2018 Paak Waqar Hindi 2021 Shershaah Major Ajay Singh Jasrotia Hindi Sooryavanshi Mukhtar Ansari aka Vivek Shastry Hindi Antim: The Final Truth Power Hindi 2022 Khiladi Bala Singham Telugu Circus Dev Chohan (cameo) Hindi === Television === year Title Role Note 2011 Dwarkadheesh - Bhagwaan Shree Krishna King Kalyavan Special appearance 2014 Fear Factor: Khatron Ke Khiladi 5 participants 2nd runner-up 2016–2017 Naagarjuna – Yoddha Oak Astika 2017–2018 Ishqbaaaz Dr Veer Pratap Chauhan 2019 Naagin 3 Law 2020–2022 Raktanchal Waseem Khan Web series == References == == Other websites == * Category:Indian actors Category:Living people Category:Year of birth missing (living people)",
 "title": "Nikitin Dheer"
}