{
 "id": "1051321",
 "text": "Guillaume Gevart (born February 12, 1997) is a French filmmaker. == Career == After obtaining his literary baccalaureate at Lycée externat des Enfants- Nantais , he studied cinema at CinéCréatis then in an art school in Nantes. Since he was a child, he has been a fan of films from the 50s to the 90s. He began his career by following internships at Disney Channel. In 2019, he produced and directed his first film entitled Yearning Rose with an approximate budget of 13,000 dollars, a film which has the particularity of having been filmed in 7 days. He then worked as a camera operator on the documentary La légende de Thierry Mauvignier. His work is based on fast-movie, a cinematographic movement which consists of producing a feature film (sequence shot excluded) in less than 10 days with a low budget, prioritizing efficiency over quality. In October 2022, The film is distributed by Amazon Prime Video in USA. In 2023, he directed the medium-length film The Venus Chained produced by Jacob Rothschild and Dylan Besseau, in collaboration with the Mouvement du Nid on Prime Video distributed by Apple TV+Les Vénus Enchaînées on Apple TV+ and Tubi. At the end of the year he produced the film Anne Bouillon : Justice pour toutes !. In 2023, his film The Venus Chained wins honorable mention at Student World Impact Film Festival. The same year, he was selected for the prestigious Justice Documentary Festival Paris 2023. He was the youngest director in the selection. In 2024, he directed the documentary Gevart. ==Family== Born to a doctor father. == Filmography == Year Title Role Notes 2019 Yearning Rose () Director Feature film 2021 La légende de Thierry Mauvignier () Producer Feature film 2023 The Venus Chained () Director, Screenwriter Medium-length film 2023 Anne Bouillon : Justice for women ! () Producer Medium-length film 2023 Gevart () Director, Screenwriter Medium- length film ==Distinctions== *2023 Honorable Mention at Student World Impact Film Festivalon Big News Network *2023 Official Selection at Justice Documentary Festival Paris == References == * Category:1997 births Category:Living people Category:French filmmakers",
 "title": "Guillaume Gevart"
}