{
 "id": "1052289",
 "text": "Zlata Filipović (born ) is a Bosnian-born Irish woman who kept a diary documenting life in Sarajevo, when it was besieged, during the Bosnian War. Her diary was first published as a book in 1992 under the title Zlata's Diary: A Child's Life in Sarajevo (originally Dnevnik Zlatin: Dječij život u Sarajevu in Bosnian). The diary was republished one year later with more content in 1993. Thanks to the publication of her diary, the United Nations helped Filipović and her mother leave Sarajevo, Bosnia and Herzegovina and move to Paris, France, in December 1993. == Biography == Zlata Filipović was born into a Bosnian family in the city of Sarajevo, Socialist Republic of Bosnia and Herzegovina, Yugoslavia (modern-day Bosnia and Herzegovina). Filipović was the only child of an advocate and a chemist. She began writing in her diary in 1991, writing about her daily life. Shortly after Filipović began writing the diary, the Bosnian War broke out, and Sarajevo (the city she and her family lived in) was besieged. She wrote about the daily horrors of her life in Sarajevo, and even wrote (in her diary) about the tragic deaths of some of her friends. In a entry of her diary, she wrote that a girl was walking on a bridge, and while walking she was suddenly shot with a gun by a enemy soldier. She died shortly afterwards as a result of the gunshot wound. == Publication of the diary == The diary was first published as a book in Sarajevo in 1992, by a small press, and consisted of 45 pages. After the first publication of her diary, Filipović continued writing her diary (The diary was republished one year later in 1993 with more content). Thanks to the publication of her diary, Filipović became moderately famous, international journalists visisted the Filipović family's apartment and interviewed Filipović, and also, the United Nations helped Filipović and her mother flee Sarajevo, and go to Paris, France, in December 1993. Her diary has been adapted into a choral work by Anthony Powers. == Reception of the diary == Critical review of the diary was positive. In The New York Times Book Review, Francine Prose praised the \"pure innocence and desperation\" which is obvious to be seen in the book, describing Flipović as an everygirl. However, Prose was critical of publishers from North America and Europe considering Filipović's diary as similar to that of the diary of Anne Frank, lamenting the offensive action of \"judging the private writing of children in war\". Category:1980 births Category:Living people Category:Bosnia and Herzegovina writers Category:People from Sarajevo",
 "title": "Zlata Filipović"
}