{
 "id": "1052373",
 "text": "Jean-Yves Bilien is a French actor, director and producer of films, mainly documentaries born on November 23, 1958 in Paris. == Career == Jean-Yves Bilien was born in Paris on 23 november 1958 in the Parisian suburbs. He left school at the age of fifteen. He works as a courier, waiter, archivist or seller in the markets Biography on capuseen.com then works in a travel agency and meets Michel Jobert who invites him to a gala organized by the professor Luc Montagnier, he meets Charles Pasqua who will become his faithful friend and help him to the production of his first documentary. In 1984, he made his first professional actor debut then directed in 1986, his first short film. On the set of the film The Transporter casting profile The Transporter on Allociné in 2001 , he met the actor Jason Statham then unknown at the time, who passed on his passion for cinema to him and pushed him to continue writing plays , script for television and cinema. He then worked for more than 15 years as an actor, author, director and director and dedicated his work to research in the health field.http://www.lentrepot.fr/ent_entreprises.asp?iid=1316 In 2011, he was crowned officer of Ordre des Arts et des Lettres. A year later, he directed Les sacrifiés des ondes with professor Luc Montagnier. In 2014, he directed the film Cancer, Business Mortel with Laurent Baffie, Pascal Olmeta and Astrid Veillon then directed in 2018 a documentary on his friend Pierre Rabhi. In 2019, with a budget of €40,000, he co-produced the documentary Enfant Hypersensible, un present pour l'avenir featuring his friend Frédéric Lenoir. == Filmography == === Actor === * 2002 : The Transporter : Little Thug * 2002 : The Bourne Identity (2002 movie) : a bodyguard * 1992 : Un vampire au paradis * 1991 : Rossignol de mes amours === Director === * 1986 : Un jour peut-être * 1992 : Partition en cinq secousses,. short film * 1994 : Paulo et Lucienne',. short film * 1997 : Christian Belgy alias Claude François, documentary * 2007 : Entretiens avec René Jacquier,http://www.filmsdocumentaires.com/portail/jacquier.html documentary co-directed with Pantxo Arretz * 2007 et 2008 : Docteur André Gernez. Le Scandale du siècle (1 et 2), documentary on André Gernez * 2008 : Du Quinton contre la hernie discale * 2009 : Emmanuel Ransford, un autre regard sur la physique, documentary * 2010 : Les Guérisseurs, la foi, la science !,. documentary * 2010 : Entretien avec Franco Pereira Divaldo,. documentary * 2011 : Léon Raoul Hatem, l’horloger de l’univers, documentary * 2011 : Antonin Poncik, une perception dermo-optique,. documentary *2012 : Les sacrifiés des ondes with Luc Montagnier * 2012 : Fusion froide par le Dr Jean-Paul Biberian,http://www.filmsdocumentaires.com/portail/fusion_froide.html documentary * 2014 : Dr Olivier Soulier – Médecine du sens,. documentary * 2014 : Cancer Business Mortel, documentary with Nicole Delépine, Laurent Baffie, Pascal Olmeta and Astrid Veillon * 2015 : Thierry Janssen, De la psychologie à la spiritualité, documentary on Thierry JanssenCapuseen.com,Catalogue Bibliothèque National de France * 2017 : Sylvie Ouellet, au-delà du miroir, documentaire * 2018 : Confidence entre amis, with Pierre Rabhi * 2019 : Enfant hypersensible, un présent pour l'avenir, documentary with Frédéric LenoirCapuseen.com == Distinctions == === Décoration === * Ordre des Arts et des Lettres (2011) == Notes and references == Category:1958 births Category:Living people Category:French movie actors Category:French movie directors",
 "title": "Jean-Yves Bilien"
}