{
 "id": "10523",
 "text": "Maine is the northeast-most state in the United States. The capital is Augusta, although the city of Portland, farther south, is the largest in the state. Maine became the 23rd state, on March 15, 1820. It was previously a part of Massachusetts. Commercial Fishing, including lobster trapping, is a traditional and still vital part of the coastal economy. Tourism is a large industry in southern Maine because of its many beaches and picturesque coastal villages. Southern Maine is the part of the state that has the most people. Many other areas, to the North, are far more rural. ==Geography== To the south and east is the Atlantic Ocean and to the north and northeast is New Brunswick, and the country of Canada. The Canadian province of Quebec is to the northwest. Maine is both the northernmost state in New England and the largest, accounting for nearly half the region's whole land area. Maine also has the distinction of being the only state to border just one other state (New Hampshire to the west). The municipalities of Eastport and Lubec are the easternmost city and town in the United States. Estcourt Station is Maine's northernmost point and also the northernmost point in the New England region of the United States. Maine's Moosehead Lake is the biggest lake that is completely in New England (Lake Champlain is located between Vermont, New York, which is not considered part of New England, and the province of Quebec in Canada). A number of other Maine lakes, like as South Twin Lake, are said by Thoreau. Mount Katahdin is both the northern terminus of the Appalachian Trail, which to Springer Mountain, Georgia, and the southern of the new \"International Appalachian Trail\" which, when finished, will run to Belle Isle, Newfoundland and Labrador in Canada. Maine is the only state that shares its borders with only one other American state since it only borders New Hampshire and Canada. ===Climate=== Maine has a humid continental climate (Köppen climate classification: Dfb), with warm (although mostly not hot), humid summers. Winters are cold and snowy all over the state, and are mostly more severe in the northern parts of Maine. Coastal areas are moderated somewhat by the Atlantic Ocean. Daytime highs are mostly in the 75–80 °F (24–27 °C) range all over the state in July, with overnight lows in the high 50s°F (around 15 °C). January temperatures range from highs near 32 °F (0 °C) on the southern coast to overnight lows below 0 °F (−18 °C) in the far north. Maine is mostly safe from hurricanes and tropical storms. By the time they reach the state, many have become extratropical and few hurricanes have made landfall in Maine. Maine has fewer days of thunderstorms than any other state east of the Rockies, with most of the state with less than 20 days of thunderstorms a year. Tornadoes are rare in Maine, about two per year, mostly happening in the southern part of the state. Monthly Normal High and Low Temperatures °F (°C) For Various Maine Cities City Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec Caribou 19/0 °F (−7/−17 °C) 23/3 °F (−5/−16 °C) 34/15 °F (1/−9 °C) 47/29 °F (8/−1 °C) 63/41 °F (17/5 °C) 72/50 °F (22/10 °C) 76/55 °F (24/12 °C) 74/53 °F (23/11 °C) 64/44 °F (17/6 °C) 51/34 °F (10/1 °C) 37/24 °F (2/−4 °C) 25/8 °F (−3/−13 °C) Portland 31/12 (−0/−11 °C) 34/16 (1/−9 °C) 42/25 (5/−4 °C) 53/35 (11/2 °C) 63/44 (17/6 °C) 73/53 (22/11 °C) 79/59 (26/15 °C) 77/57 (25/14 °C) 69/48 (20/9 °C) 58/37 (14/3 °C) 47/30 (8/−1 °C) 36/19 (2/−7 °C) ==History== Humans have lived in Maine for many thousands of years. The Penobscot, Mi’kmaq, Maliseet, Passamaquoddy, and Penobscot Native American groups all lived there before Europeans found Maine. Early during the colonial time, Maine was part of Massachusetts. It became its own state in 1820, the 23rd state in the United States of America. Its northern border with Canada was set in 1842. ==Population== As of 2008, Maine has an estimated population of 1,321,504, which is an increase of 6,520, or 0.5%, from the past year and an increase of 46,582, or 3.7%, since the year of 2000. This has a natural increase since the last census of 6,413 people (that is 71,276 births minus 64,863 deaths) and an increase because of \"net migration\" of 41,808 people into the state. Immigration from outside the United States made a net increase of 5,004 people, and migration within the country made a net increase of 36,804 people. The population density of the state is 41.3 people per square mile. ==Economy== The Bureau of Economic Analysis estimates that Maine's total gross state product for 2007 was $48 billion. Its per capita personal income for 2007 was $33,991, 34th in the country. People in Maine produce agricultural goods like poultry, eggs, dairy products, cattle, wild blueberries (the state makes 25% of all blueberries in North America, making it the largest blueberry maker in the world), apples, maple syrup and maple sugar. Aroostook County is known for its potato crops. Commercial fishing, once a mainstay of the state's economy, maintains a presence, mostly lobstering and groundfishing. Western Maine and springs are a big source of bottled water. Maine's company outputs make paper, lumber and wood products, electronic stuff, leather things, food products, textiles, and bio-technology. Naval shipbuilding and building remain key as well, with Bath Iron Works in Bath and Portsmouth Naval Shipyard in Kittery. Naval Air Station Brunswick is also in Maine, and serves as a large support base for the U.S. Navy. However, the BRAC campaign recommended Brunswick's closing, despite a new government- funded effort to upgrade its facilities. ==References== Notes == Related pages == * Colleges and universities in Maine * List of counties in Maine * List of rivers of Maine Category:1820 establishments in the United States",
 "title": "Maine"
}