{
 "id": "1052632",
 "text": "\"No\" (written in capital letters) is a song by American singer-songwriter Meghan Trainor from her second major-label studio album, Thank You (2016). Ricky Reed produced the song and wrote it with Trainor and Jacob Kasher Hindlin; Epic Records released it as the album's lead single on March 4, 2016. A dance-pop song inspired by 1990s pop music and R&B;, \"No\" has lyrics about sexual consent and empowerment, encouraging women to reject unwanted advances from men. Music critics praised \"No\" as a showcase of Trainor's confident and mature side and deemed it an improvement from her earlier songs. In the United States, the song reached number three on the Billboard Hot100 and was certified 2× Platinum by the Recording Industry Association of America. It also reached the top 10 in Australia, Canada, Austria, Israel, Latvia, South Africa, and Scotland, attaining multi-platinum certifications in the former two and Poland. Fatima Robinson directed the music video for \"No\", which features Trainor performing choreographed dances in a warehouse and entwining her arms with accompanying female dancers. Critics compared it to the visuals of various 1990s female recording artists and praised her creative evolution, particularly the choreography. In further promotion, Trainor performed \"No\" on television shows such as the iHeartRadio Music Awards, The Ellen DeGeneres Show, and the Billboard Music Awards, and included it on the set list of her 2016 concert tour, The Untouchable Tour. ==Charts== ===Weekly charts=== Weekly chart positions for \"No\" Chart (2016) Peak position Argentina (Monitor Latino) 13 Finland Download (Latauslista) 23 Finnish Airplay (Radiosoittolista) 34 Israel (Media Forest) Note: On the page, select \"2016\" and \"18 01-05-16 07-05-16\" in the drop-down archive and then select the second \"שירים מובילים – רדיו – בינלאומי\" tab to obtain the corresponding chart. 3 Latvia (Latvijas Top 40) 1 Mexico Ingles Airplay (Billboard) 1 South Africa (EMA) 2 ===Year-end charts=== Year-end chart positions for \"No\" Chart (2016) Position Australia (ARIA) 63 Brazil (Brasil Hot 100) 31 Canada (Canadian Hot 100) 42 Germany (Official German Charts) 92 Spain (PROMUSICAE) 78 UK Singles (Official Charts Company) 89 US Billboard Hot 100 45 US Adult Top 40 (Billboard) 34 US Mainstream Top 40 (Billboard) 47 ==Certifications== ==References== Category:2016 songs Category:Dance-pop songs Category:Meghan Trainor songs Category:Songs with feminist themes",
 "title": "No (song)"
}