{
 "id": "1052143",
 "text": "Tom Büdgen (born 19 May 1985) is a Dutch professional wrestler. He is signed to WWE, wrestling on their SmackDown brand under the ring name Aleister Black. In his first run with the company, he was a one-time NXT Champion. He is also known for his time wrestling in All Elite Wrestling (AEW), where he wrestled under the ring name Malakai Black and was the leader if the stable The House of Black. As Tommy End, Büdgen has also competed for Insane Championship Wrestling (ICW), Progress, Pro Wrestling Guerrilla (PWG), and Westside Xtreme Wrestling (wXw). During his time in AEW, Black has been a one-time AEW World Trios Champion. ==Career== ===All Elite Wrestling=== On 7 July 2021 at Road Rager, Black debuted with All Elite Wrestling (AEW) by hitting the Black Mass on both Cody Rhodes and Arn Anderson. Black made his AEW in-ring debut on the 4 August at Homecoming where he defeated Cody Rhodes. Black would form a tag team with Brody King called the Kings of the Black Throne on the 12 January 2022 edition of Dynamite. Later on, the debuting Buddy Matthews would join them after their match and attack Death Triangle (Pac and Penta Oscuro). The three would call themselves The House of Black. At Double or Nothing, the House of Black defeated Death Triangle (Pac, Penta Oscuro, and Rey Fénix). After their win, Julia Hart betrayed The Varsity Blonds (Brian Pillman Jr. and Griff Garrison) by coming down to the ring and joined the House of Black after months of teasing it. On March 5, 2023 at Revolution, the House of Black defeated The Elite (Kenny Omega, Matt Jackson, and Nick Jackson) to win the AEW World Trios Championships. This gave Black his first championship in AEW. They would lose the titles to Billy Gunn and The Acclaimed (Max Caster and Anthony Bowens) at All In. On 10 February 2025, Black's contract with AEW ended. === Return to WWE (2025–present) === On the 25 April episode of SmackDown, Black made his return to WWE, attacking The Miz with a Black Mass. == Championships and accomplishments == *Adriatic Special Combat Academy **Super 8 Cup II (2013) *All Elite Wrestling **AEW World Trios Championship (1 time) – with Brody King and Buddy Matthews *Fiend Wrestling Germany ** FWG Lightweight Championship (1 time) ** FWG Lightweight Title Tournament (2009) *Fight Club: PRO ** FCP Championship (1 time) *Freestyle Championship Wrestling ** FCW Deutschland Lightweight Championship (1 time) *Insane Championship Wrestling ** ICW Tag Team Championship (1 time) – with Michael Dante ** ICW \"Match of the Year\" Bammy Award (2015) – *International Catch Wrestling Alliance ** ICWA Heavyweight Championship (1 time) ** ICWA World Junior Heavyweight Champion (1 time) **ICWA European Tag Team Championship/NWA European Tag Team Championship (1 time) – with Michael Dante * Pro Wrestling Guerrilla ** PWG World Tag Team Championship (1 time, current) – with Brody King *Pro Wrestling Holland ** PWH Tag Team Championship (1 time) – with Michael DanteTitle Reigns « PWH Tag Team Championship « Titles Database « CAGEMATCH – The Internet Wrestling Database. Cagematch.net. Retrieved on 6 June 2017. *Pro Wrestling Illustrated **Ranked No. 23 of the top 500 singles wrestlers in the PWI 500 in 2020 *Pro Wrestling Showdown ** PWS Heavyweight Championship (1 time) *Progress Wrestling **Progress Tag Team Championship (1 time) – with Michael Dante ** Super Strong Style 16 (2016)PROGRESS Chapter 30: Super Strong Style 16 Tournament Edition 2016 – Tag 2 « Events Database « CAGEMATCH – The Internet Wrestling Database. Cagematch.net. Retrieved on 6 June 2017. *Southside Wrestling Entertainment ** SWE Tag Team Championship (1 time) – with Michael Dante *Westside Xtreme Wrestling **wXw Unified World Wrestling Championship (1 time) ** wXw World Lightweight Championship (2 times) ** wXw World Tag Team Championship (2 times) – with Michael Dante ** 16 Carat Gold Tournament (2013, 2015) ** Chase The Mahamla (2011) ** World Lightweight Tournament (2006)wXw World Lightweight Tournament « Events Database « CAGEMATCH – The Internet Wrestling Database. Cagematch.net (16 September 2006). Retrieved on 6 June 2017. * WWE ** NXT Championship (1 time) ** NXT Year-End Award (3 times) *** Male Competitor of the Year (2017) *** Breakout Star of the Year (2017) *** Rivalry of the Year (2017) – ** Dusty Rhodes Tag Team Classic (2019) – with Ricochet == References == ==Other websites== * * * Category:1985 births Category:Living people Category:All Elite Wrestling alumni Category:Dutch sportspeople Category:WWE wrestlers Category:Professional wrestlers Category:Sportspeople from Alkmaar",
 "title": "Malakai Black"
}