{
 "id": "1052390",
 "text": "Jon Olav Fosse (born 29 September 1959 in Haugesund) is a Norwegian author, translator, and playwright. In 2023, he was awarded the Nobel Prize in Literature. Fosse has written more than seventy novels. He has also written poems, children's books, essays, and plays. His works have been translated into more than fifty languages. ==Biography== Jon Fosse was born in 1959 in Haugesund, Rogaland county, and grew up in Strandebarm, Hardanger (a traditional district in Vestland). He started writing when he was about twelve years old. When he was a teenager, Fosse was interested in becoming a rock guitarist. When he no longer thought he would be a rock star, he could spend more time writing. Fosse studied comparative literature at the University of Bergen. His first novel, Raudt, svart'' (Red, Black), was published in 1983. He earned a master's degree in comparative literature in 1987. It was also from the University of Bergen. Fosse's first play, Og aldri skal vi skiljast'' (And We'll Never Be Parted), was performed and published in 1994. The novelhttps://snl.no/Jon_Fosse. Retrieved 2023-10-08 Septology, has 7 volumes, and they are published as 3 books; The first of those books, came out in 2019. Fosse is the most performed Norwegian playwright after Henrik Ibsen. ==Awards== In 2003, Fosse was made a chevalier of the Ordre national du Mérite of France. In 2022, Fosse's novel A New Name: Septology VI-VII'', translated into English by Damion Searls, was shortlisted for the International Booker Prize. The book was also a finalist for the 2023 National Book Critics Circle Award in Fiction. In October 2023, Fosse was awarded the Nobel Prize in Literature. He is the third Norwegian to win it. ==Works== ===Prose=== * Red, Black; original title, Raudt, svart (1983). * Closed Guitar; original title Stengd gitar (1985). * Blood. The Stone Is; original title, Blod. Steinen er (1987). *['eternally late'] Uendelig Seint (1989). * Boathouse; original title, Naustet (1989). , trans. May-Brit Akerholt (Dalkey Archive, 2017). * Kant (1990) * The Bottle-Collector; original title, * Flaskesamlaren (1991). *Lead and Water; original title, Bly og vatn (1992). *[the Zoo, Hardanger] Dyrehagen Hardanger. (1993). == References == Category:1959 births Category:Living people Category:Norwegian writers Category:Norwegian playwrights Category:Nobel Prize in Literature winners",
 "title": "Jon Fosse"
}