{
 "id": "1052406",
 "text": "Franz Sedlacek (4 September 1892 in Vienna - 18 July 1933 in Vienna) was an Austrian football player and football coach. ==Career== Franz Sedlacek started playing football in the youth ranks of AC Viktoria Wien. Then he moved to Wiener AC. In the summer of 1910, during a foreign tour, serious differences arose between the players and the club management, which ultimately led to the departure of a number of players. In addition to established players such as Adolf Fischera or Richard Kohn, Sedlacek was also one of those who left the club The players founded the Vienna AF. The club was placed in the first division and took part in the first championship held in 1911. After Sedlacek was a supplementary player in the first championship season, he was a regular player as from the 1912/13 season and ended this season as runner-up with the WAF. The next season they won the the championship title. In the following seasons, the Reds were able to position themselves among the top four clubs in Vienna, but were unable to win another championship title. In May 1919, Sedlacek suffered a serious knee injury, which largely ended his career. He made comeback attempts at the WAF and at the WAC. There he made his last appearances in the 1920/21 relegation season before ending his active career. ==National team== He played eleven international matches for the Austrian national football team. He made his debut on 15 June 1913 in Vienna in a 2-0 victory over Italy. From 1915 to 1918, due to the war, ten games followed exclusively against the Hungarian national team, three of which were won and five lost; one ended in a draw and one game had to be abandoned when the score was 3:3.The Hungarian player Schaffer attacked the referee in the 70th minute, who did not recognize an offside goal he scored. Then excluded, Schaffer refused to leave the field.Only the Hungarian association captain Ede Herczog was able to calm the situation. The game was continued, but after a few minutes canceled due to darkness.Austria Soccer Sedlacek made his last appearance in a 2-0 defeat against Hungary on 2 June 2 1918 in Vienna.ÖFB Players profile ==Manager== After his active playing career Sedlacek became coach. His first job was at MTV Pirmasens. At the beginning of 1923 he moved to Italy and took over Vicenza Calcio. He then looked after Padua and AC Venice from October 1924 to 1926 . He then returned to Vienna and coached FK Austria Wien. In the 1927/28 season Sedlacek worked again in Italy, this time for Lazio Rom. In February 1929 he took over the coaching position at the Polish first division team Garbarnia Kraków. After the two years in Krakow, Sedlacek worked temporarily for several Upper Silesian clubs before signing with Karlsruher FV in mid-1931. In 1933 the coach returned to his hometown where he signed a contract with his former club WAC. On the day of the planned first training session Sedlacek died of a stroke at the age of 40. ==Honours== *Austrian champion: 1914 ==References== Category:1892 births Category:1933 deaths Category:Austrian footballers Category:Players of the Austrian national football team Category:Austrian football champions Category:Austrian football managers Category:FK Austria Wien managers Category:Austrian football midfielders",
 "title": "Franz Sedlacek"
}