{
 "id": "1052421",
 "text": "Richard Starks (born February 21, 1990) is an American professional wrestler. He currently wrestles for WWE on their NXT brand and competes under the ring name Ricky Saints. He is the current NXT North American Champion in his first reign. He is also known for his time wrestling in the National Wrestling Alliance (NWA) and All Elite Wrestling (AEW) under the ring name Ricky Starks. During his time in AEW, Starks was the winner of the 2023 Owen Hart Cup and a one-time AEW World Tag Team Champion. He also was a former one-time FTW Champion, however the championship was unsanctioned which means that AEW did not officially recognize it or Starks' reign. ==Career== ===All Elite Wrestling=== On the June 17, 2020 episode of Dynamite, Starks made both his surprise AEW debut and his AEW in-ring debut. He answered Cody's AEW TNT Championship open challenge but was defeated. Afterwards, it was announced by AEW owner Tony Khan that Starks signed a contract with All Elite Wrestling (AEW). On the July 21 episode of Dark, Starks defeated Griff Garrison and got his first win as a member of the AEW roster. Starks then joined Team Taz with Taz and Brian Cage. Will Hobbs joined later after attacking Cody and Darby Allin after their match. At Winter Is Coming, Starks teamed with Hobbs against Cody and Allin but lost. They then attacked Cody and Allin after the match but the debuting Sting made the save. On Night 1 of Fyter Fest, Hobbs hit Brian Cage with Cage's FTW Championship and kicked him out of the group. Starks pinned Cage to become the new FTW World Champion. This was Stark's first championship in AEW. However, the championship was unsanctioned and not officially recognized by AEW. At Fight for the Fallen, Starks issued an open challenge for the FTW Championship, which was answered by Danhausen. After Starks beat Danhausen, Hook came out and answered the challenge, where Starks lost the title to Hook. Afterwards, Starks cut a promo after and turned face after getting attacked by his tag partner Hobbs. On the December 7 episode of Dynamite, Starks won the Dynamite Diamond Ring after eliminating Ethan Page last in the Dynamite Dozen Battle Royale. Starks challenged AEW World Champion MJF to a match at Winter Is Coming. Starks put up his Dynamite Diamond Ring and MJF put up his world championship in a Winner Takes All match. At Winter is Coming, Starks lost the match and his ring. In 2023, Starks decided to enter the Owen Hart Foundation Men's Tournament. He made it to the finals, defeating Juice Robinson and Powerhouse Hobbs in the first two rounds. On July 15 episode of Collision, he defeated CM Punk to win the Owen Hart Cup. On the October 7 episode of Collision, Starks teamed with Big Bill. The two defeated FTR (Dax Harwood and Cash Wheeler) and won the AEW World Tag Team Championships. On the February 7, 2024 episode of Dynamite, Starks and Big Bill lost the championships to Sting and Darby Allin. On February 11, 2025, Starks's profile was removed from AEW's website and he was released from the company. ===WWE=== Starks made his WWE debut on the February 11, 2025 episode of NXT. The following week, his new ring name was announced to be Ricky Saints. On the April 1 episode of NXT, Saints defeated Shawn Spears to win the NXT North American Championship for the first time. == Championships and accomplishments == *All Elite Wrestling **AEW World Tag Team Championship (1 time) – with Big Bill **FTW Championship (1 time) **AEW World Championship Eliminator Tournament (2022) **Dynamite Diamond Battle Royale (2022) ** Men’s Owen Hart Cup (2023) *Anarchy Championship Wrestling **ACW Hardcore Championship (1 time) **ACW Televised Championship (1 time) **ACW Unified Championship (1 time, first) *Dojo Pro Wrestling **Dojo Pro White Belt Championship (1 time) *ESPN **Breakthrough wrestler of the year (2022) *Imperial Wrestling Revolution **IWR Revolutionary Championship (1 time) *Inspire Pro Wrestling **Inspire Pro Championship (1 time) **Inspire Pro Junior Crown Championship (1 time) **Inspire Pro Pure Prestige Championship (1 time) *National Wrestling Alliance **NWA World Television Championship (1 time, first) **NWA World Television Championship Tournament (2020) *NWA Houston **NWA Lone Star Junior Heavyweight Championship (1 time) *Pro Wrestling Illustrated ** Ranked No. 92 of the top 500 singles wrestlers in the PWI 500 in 2020 *VIP Wrestling **VIP Tag Team Championships (1 time) – with Carson **VIP Tag Team Championship Tournament (2015) *WrestleCircus **WC Big Top Tag Team Championships (1 time) – with Aaron Solow *WWE **NXT North American Championship (1 time, current) *Xtreme Championship Wrestling **XCW Heavyweight Championship (1 time) == References == ==Other websites== * * * Category:1990 births Category:Living people Category:All Elite Wrestling alumni Category:American professional wrestlers Category:Professional wrestling announcers Category:Sportspeople from New Orleans Category:WWE wrestlers",
 "title": "Ricky Starks"
}