{
 "id": "1052863",
 "text": "Kostruba Anatoliy is a Ukrainian academic whose specializations include Civil Law in Eastern European countries, particularly Corporate Law, Contract Law, and Tort Law. He earned his Doctor of Laws degree in 2015 and became a Professor in 2019. He's been teaching at Vasyl Stefanyk Precarpathian National University since 2015 and is also a Professor at Vilnius University as of 2022. Since 2023, he has been working as a contract researcher at the University Paris 1 Panthéon Sorbonne. == Background == Professor Kostruba was born in Simferopol, Ukraine, in 1978. He graduated from Tavrida National V.I. Vernadsky University in 2000 and obtained his PhD degree in 2004. In 2015, he became a Doctor of Law. == Career == Kostruba Anatoliy worked as a lawyer, legal adviser, and served as a deputy in the District Council of Simferopol. In 2005, he started private legal practice and became a lawyer in 2007. He's a member of the Ukrainian National Bar Association and involved in the Committee on Investment and Privatization. Anatoliy has been a researcher and educator since 2003 at Tavrida National V.I. Vernadsky University. Professor Kostruba Anatoliy has been teaching at Vasyl Stefanyk Precarpathian National University, Ukraine since 2015. Kostruba Anatoliy was invited to the Supreme Court of Ukraine as a member of the Scientific Council. In 2022, he accepted the invitation to joint the Vilnius University, Lithuania to teach courses to students from higher education institutions who had suspended their studies as a result of Russia's military aggression. Professor Kostruba assumed the role of a visiting professor at University of Bologna, Italy, and commencing from 2023, he is contracted as a researcher at University Paris 1 Panthéon - Sorbonne, France. Professor is an author of over 250 academic publications, including 45 articles published in Scopus (Scopus Author ID 57197823711) and Web of Science (Web of Science ResearcherID N-1070-2017) indexed journals. == References == Category:Academics Category:1978 births Category:Ukrainian lawyers",
 "title": "Kostruba Anatoliy"
}