{
 "id": "1052476",
 "text": "\"Lips Are Movin\" is a song by American singer-songwriter Meghan Trainor from her debut major-label studio album, Title (2015). It was written by Trainor and the album's producer, Kevin Kadish. Epic Records released the song to United States contemporary hit radio stations on October 21, as the second single from Title. A retro-tinged pop, doo-wop and R&B; song with girl-group harmonies and bubblegum pop hooks, \"Lips Are Movin\" was inspired by Trainor's conflict with her record label. However, critical commentary has described it as a song about Trainor leaving her significant other after discovering he is cheating on her. Critics drew similarities between the song's style and that of Trainor's debut single, \"All About That Bass\" (2014). Some said the song was catchy, while others criticized its lyrics. In the United States, \"Lips Are Movin\" reached number 4 on the Billboard Hot 100 and was certified quadruple platinum by the Recording Industry Association of America (RIAA). It received platinum or multi-platinum certifications in Australia, Canada, New Zealand, and the United Kingdom, and reached the top 10 on their charts among others. Philip Andelman directed the music video for \"Lips Are Movin\", which was commissioned by the technology company Hewlett-Packard. The first-ever music video created entirely by social media influencers, it portrays behind- the-scenes events of a video shoot. Trainor performed \"Lips Are Movin\" on televised shows such as Today, The Voice, and [Dancing with the Stars, and included it on the set lists for three of her concert tours: 2015's That Bass Tour and MTrain Tour and 2016's the Untouchable Tour. ==Charts== ===Weekly charts=== Weekly chart positions for \"Lips Are Movin\" Chart (2014–2015) Peak position Germany Airplay (BVMI) 1 Italy (Musica e Dischi) Set \"Tipo\" on \"Singoli\". Then, in the \"Artista\" field, search \"Meghan Trainor\". 46 Mexican Airplay (Billboard) 12 New Zealand (Recorded Music NZ) 5 Slovenia (SloTop50) 5 Venezuela (Record Report) 68 Venezuela (Top Pop General) 14 Venezuela (Top Anglo) 2 ===Year-end charts=== 2014 year-end chart position for \"Lips Are Movin\" Chart (2014) Position Australia (ARIA) 64 2015 year-end chart positions for \"Lips Are Movin\" Chart (2015) Position Australia (ARIA) 82 Austria (Ö3 Austria Top 40) 66 Canada (Canadian Hot 100) 34 Germany (Official German Charts) 68 Hungary (Rádiós Top 40) 33 Netherlands (Dutch Top 40) 55 Netherlands (Single Top 100) 97 Poland (ZPAV) 39 Slovenia (SloTop50) 10 Spain (PROMUSICAE) 75 UK Singles (Official Charts Company) 73 US Billboard Hot 100 22 US Adult Contemporary (Billboard) 12 US Adult Top 40 (Billboard) 21 US Mainstream Top 40 (Billboard) 31 2016 year-end chart position for \"Lips Are Movin\" Chart (2016) Position Hungary (Rádiós Top 40) 93 ==Certifications== ==References== Category:2014 songs Category:Meghan Trainor songs Category:Pop songs Category:Doo-wop songs Category:R&B; songs",
 "title": "Lips Are Movin"
}