{
 "id": "1052446",
 "text": "\"Dear Future Husband\" is a song by American singer-songwriter Meghan Trainor. It was included on Title, her 2014 extended play, and later on her 2015 studio album of the same name. Trainor wrote the song with its producer, Kevin Kadish. Epic Records released \"Dear Future Husband\" as the album's third single on March 17, 2015. A doo-wop and pop /R&B; song, it has lyrics about chivalry and dating. In the song, Trainor lists things a possible romantic suitor needs to do to win her love. Some music critics praised the playful nature of \"Dear Future Husband\" and compared its lyrics to different Trainor songs, while others were negative about the portrayal of gender roles in its lyrics. In the United States, the song reached number 14 on the Billboard Hot 100 and was certified 3× Platinum by the Recording Industry Association of America. It reached the top 10 in Australia, the Netherlands, Poland, South Africa, and Venezuela and received multi-platinum certifications in Australia and Canada. Fatima Robinson directed the music video for \"Dear Future Husband\", which depicts Trainor baking pies in the kitchen and scrubbing floors while various men audition to be her partner. It garnered controversy and online criticism over allegations of antifeminism and sexism. Trainor performed the song on television shows such as the iHeartRadio Music Awards, The Voice, and Today and included it on the set lists of her concert tours That Bass Tour (2015), MTrain Tour (2015), and the Untouchable Tour (2016). ==Charts== ===Weekly charts=== Weekly chart positions for \"Dear Future Husband\" Chart (2015–2016) Peak position Germany (Official German Charts) 37 Mexico (Top 20 Inglés) 17 Netherlands (Tipparade) 5 Poland (Polish Airplay New) 5 Slovenia (SloTop50) 17 South Africa (EMA) 3 Venezuela (Record Report) 94 Venezuela (Top Pop General) 18 Venezuela (Top Anglo) 4 ===Year-end charts=== Year-end chart positions for \"Dear Future Husband\" Chart (2015) Position Australia (ARIA) 39 Austria (Ö3 Austria Top 40) 68 Canada (Canadian Hot 100) 96 US Billboard Hot 100 74 ==Certifications== ==References== Category:2015 songs Category:Meghan Trainor songs Category:Pop songs Category:Doo-wop songs Category:R&B; songs",
 "title": "Dear Future Husband"
}