{
 "id": "1052044",
 "text": "Sadako Sasaki () was a Japanese girl who, at age 2, was caught in the atomic bombing of Hiroshima. She survived for another ten years after the bombing, becoming one of the best-known atomic bomb victims of Hiroshima and Nagasaki. She eventually developed leukemia from being exposed to the bomb's radiation, and is best known for folding one thousand origami cranes in hopes of recovery. Sasaki died on , at the age of 12, in Hiroshima, Japan. == Biography == Sadako Sasaki was born into a Japanese family in the city of Kusunoki. On the morning hours of 6 August 1945, Sadako was at home with her family when the United States Army Air Force dropped an atomic bomb on Hiroshima. During the bombings, she was thrown out of her house through the window. Though she had no apparent injuries, Sadako was exposed to the bomb's radiation and was caught in nuclear fallout while freeing with her mother. Sadako's grandmother died in the bombings. === Education === When she grew up, Sadako went to school and became an important member of her class' relay race. === Condition === In November 1954, Sadako got oedema on her neck and legs. Two months later, in January 1955, Sadako developed purpura on her legs. At age 12, she was diagnosed with leukemia. Doctors told her family that she had leukemia because she had been exposed to the radiation of the atomic bomb. She was hospitalized and given blood transfusions on 21 February 1955, and was expected to live for only a few months. == Folding origami cranes == In early August 1955, Sadako was moved into a room with a girl named Kiyo, a 14-year- old junior high school student. A local high school club brought origami cranes to their room. On 3 August, when Sadako asked why origami cranes were brought into her room, her friend Chizuko Hamamoto told her a legend that said a person could get their wish granted by folding 1000 paper cranes. Upon hearing this, Sadako began folding 1000 origami cranes, in the hope of recovering from her leukemia. Although she had plenty of free time during her days in the hospital, she began to run out of paper, and began using things like medicine wrappers. She even went to other patients' rooms and asked for paper wrappers from their get-well-soon gifts. However, given her illness, we do not know for certain whether Sadako managed to fold 1000 cranes. == Death == While she was hospitalized, Sadako's condition worsened. In October 1955, Sadako's left leg became purple and had oedema. In the last days of her life, when Sadako's family urged her to eat some food, Sadako asked for chazuke. While (or after) eating, she said \"It's tasty\" and thanked her family. These were probably her last words. She died in the morning hours of , at the age of 12. == Examination of body and cremation == After her death, Sadako's body was examined by the Atomic Bomb Casualty Commission (ABCC) for research on the effects of the atomic bomb on the human body. Her body was cremated after the examination. Category:1943 births Category:1955 deaths Category:Deaths from leukemia",
 "title": "Sadako Sasaki"
}