{
 "id": "1052636",
 "text": "\"Me Too\" is a song by American singer-songwriter Meghan Trainor from her second major-label studio album, Thank You (2016). Trainor wrote the song with Jacob Kasher Hindlin, Jason Derulo, Peter Svensson, and its producer, Ricky Reed. Epic Records released it as the album's second single on May 5, 2016. An electro and R&B; song with a simple musical bed of a synth bassline, finger snaps, and popping mouth sounds. \"Me Too\"'s lyrics are about loving yourself, and Trainor says she is confident about her looks. Music critics found the lyrics of \"Me Too\" difficult to relate to and Trainor's confidence fake, but some of them praised the track's production. In the United States, the song peaked at number 13 on the Billboard Hot 100 and was certified 3× Platinum by the Recording Industry Association of America. It reached the top 10 and received 4× Platinum certifications in Australia and Canada. Hannah Lux Davis directed the music video for \"Me Too\", showing Trainor partying in a car and travelling through Los Angeles before joining her backup dancers to film a dance. Shortly after its release, the video was removed after she noticed it had been changed to make her waist look smaller; it was reuploaded the next day. Trainor fell while performing the song on The Tonight Show Starring Jimmy Fallon, which some thought was for attention. She sang \"Me Too\" again on television shows such as Good Morning America and The Today Show, and included it in the set list of her concert tour The Untouchable Tour (2016). == Charts == === Weekly charts === Weekly chart positions for \"Me Too\" Chart (2016) Peak position Guatemala (Monitor Latino) 8 Israel (Media Forest TV Airplay) 1 Latvia (Latvijas Top 40) 26 Mexico (Monitor Latino) 20 Mexico Ingles Airplay (Billboard) 2 New Zealand Heatseekers (Recorded Music NZ) 10 ===Year-end charts=== Year-end chart positions for \"Me Too\" Chart (2016) Position Argentina (Monitor Latino) 57 Australia (ARIA) 51 Canada (Canadian Hot 100) 33 US Billboard Hot 100 62 US Adult Top 40 (Billboard) 48 ==Certifications== ==References== Category:2016 songs Category:Meghan Trainor songs Category:Electro-R&B; songs Category:Songs with feminist themes",
 "title": "Me Too (song)"
}