{
 "id": "1052770",
 "text": "Jack Perry (born June 16, 1997) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and New Japan Pro-Wrestling (NJPW). He wrestles under his real name and has also been known by his old ring name Jungle Boy. During his time in AEW, Perry has been a one-time TNT Champion, a one-time World Tag Team Champion and a one-time FTW Champion ==Career== ===All Elite Wrestling=== On January 24, 2019, Perry signed a contract with All Elite Wrestling (AEW). At Double or Nothing, Perry made his AEW in-ring debut. He fought in the Casino Battle Royal, being eliminated by Jimmy Havoc. Jungle Boy would create a stable called Jurassic Express with Luchasaurus and Marko Stunt. On the January 15, 2020 episode of Dark, Jungle Boy got his first win when Jurassic Express defeated Strong Hearts (Cima, El Lindaman and T-Hawk). Jungle Boy was able to win the Casino Battle Royal match at Double or Nothing and earned a shot at AEW World Championship. On the June 26 episode of Dynamite, he would go on to lose to AEW World Champion Kenny Omega. On the January 5, 2022 episode of Dynamite, Jurassic Express won the AEW World Tag Team Championship after defeating the Lucha Brothers (Pentagón Jr. and Rey Fénix). This was Jungle Boy's first championship in AEW. On June 15 at Road Rager, Jurassic Express would lose the championships to the Young Bucks. At Forbidden Door, Perry was being managed by Hook and faced Sanada for the IWGP World Heavyweight Championship. Perry lost the match and turned heel after by attacking his manager Hook. At Blood & Guts, Perry won the FTW Championship after he defeated Hook. At All In, Perry would lose the title back to Hook. There was controversy during the match and after it. Before the match, Perry wanted to do a spot with real glass to write himself off TV for a while. CM Punk told Perry that he didn't like the spot because Perry or Hook could get legitimately injured on the glass. Perry would do the spot anyways, look into the camera and say \"real glass, cry me a river\". When Perry went backstage, Punk choked him out and then jumped at AEW owner Tony Khan. Punk would be fired from the company and Perry was suspended indefinitely. === New Japan Pro-Wrestling (2024–present) === On January 13, 2024, at Battle in the Valley, Perry made his New Japan Pro-Wrestling (NJPW) debut and ripped up his AEW contract. ==Personal life== His father was American actor Luke Perry. He is in a relationship with professional wrestler Anna Jay. == Championships and accomplishments == * All Elite Wrestling ** AEW TNT Championship (1 time) ** AEW World Tag Team Championship (1 time) – with Luchasaurus ** FTW Championship (1 time) ** Men's Casino Battle Royale (2021) * All Pro Wrestling ** APW Junior Heavyweight Championship (1 time) * Revolution Eastern Wrestling ** REW Pakistan 24/7 Championship (1 time) * DDT Pro-Wrestling ** Ironman Heavymetalweight Championship (1 time) * ESPN ** Ranked No. 13 of the 30 best Pro Wrestlers Under 30 in 2023 * Pro Wrestling Illustrated ** Ranked No. 69 of the top 500 singles wrestlers in the PWI 500 in 2021 * Pro Wrestling Revolution ** PWR Tag Team Championships (1 time) – with El Prostipirugolfo * Underground Empire Wrestling ** West Coast Cruiser Cup (2016) * Wrestling Observer Newsletter ** Rookie of the Year (2019) == References == ==Other websites== * Category:1997 births Category:Living people Category:American professional wrestlers Category:All Elite Wrestling people Category:Sportspeople from Los Angeles",
 "title": "Jack Perry"
}