{
 "id": "1052370",
 "text": "The Arrowsmith School is a private school in Toronto, Ontario. It is for children in Grades 1 to 12 that have learning disabilities The Arrowsmith School was first founded in Toronto in 1980. It was founded by Barbara Arrowsmith Young. A second location was opened in May 2005 in Peterborough, Ontario. The Eaton Arrowsmith School is modelled on the Toronto school. It was founded by Howard Eaton. That school was opened in 2005 in Vancouver, British Columbia. It has two other schools in Canada and one in the United States. The school uses a program known as the Arrowsmith Program. This program was created by Arrowsmith Young in 1978. She created it from exercises that she had created for herself in 1977. She has said that they helped her to overcome her own learning difficulties. Her own problems with learning disability are talked about in her 2012 book The Woman Who Changed Her Brain. She says that her way of doing things is based on research into neuroplasticity. Her research suggests that the brain is always changing and rewiring itself. The program has been used into other public and private schools in Canada, the United States, Australia and New Zealand. Several cognitive psychologists and neuroscientists do not think is is a good program. ==History== Barbara Arrowsmith Young founded the original Toronto school in 1980 with her and her then-husband, Joshua Cohen. They created it to teach learning disabled children. They taught the children by using the program and exercises that Arrowsmith Young had begun creating for herself in 1978. She said the program helped her to overcome her own learning difficulties. In Arrowsmith Young's 2012 book, The Woman Who Changed Her Brain, she said she used her middle name for the school in honor of her paternal grandmother As a young girl, her grandmother had been one of the pioneer settlers of Creston, British Columbia. The Toronto school grew slowly over time. In 1991, she and Cohen chose to open a second school in Brooklyn, New York and stop using the school in Toronto.By 1994 the New York school had closed. The marriage of Arrowsmith Young and Cohen had also ended. She returned to Toronto and re-opened the school there. The school later moved to its present location in the Forest Hill neighborhood of Toronto. George, Lianne (7 November 2008). \"Dumbed down\", Maclean's. Retrieved 6 June 2015. Barbara Arrowsmith Young is still the director and owner of the school. She is also the owner and director of a second branch of the school in Peterborough, Ontario. It was opened in 2005. Both branches have had a growing numbers of students from outside Canada. This happened after Arrowsmith Young's 2012 speaking tour to New Zealand, Australia and the United Kingdom. This tour was for her to talk about her book The Woman Who Changed Her Brain. In October 2012, about one third of the students the Peterborough branch were from other countries. Seven students were from Australia, one student was from the United Arab Emirates and one student was from the United States).McCormick, Rob (9 October 2012). \"Global reach at school for learning disabled\" . Peterborough Examiner. Retrieved 6 June 2015. In 2005 Howard Eaton opened the Eaton Arrowsmith School in Vancouver. It is modelled on the Arrowsmith School in Toronto. The Eaton Arrowmith School opened branches in British Columbia at Victoria in 2009 and White Rock in 2012.EatonArrowsmithSchool.com. About us. Retrieved 6 June 2015. Eaton opened a branch in the United States at Redmond, Washington. This school, the Eaton Arrowsmith Academy, opened in September 2014.Shen, Molly (25 November 2014). \"New take on learning disabilities: change the brain\" . KOMO News. Retrieved 6 June 2015. Eaton is the owner and director of all four Eaton Arrowsmith schools. === Skepticism and criticism === In his 2008 book The Brain That Changes Itself, Norman Doidge, a Canadian psychiatrist and psychoanalyst wrote an entire chapter about Arrowsmith Young and the Arrowsmith Program. In it he writes about Arrowsmith Young dealing with her learning disabilities and how she created the program. He also includes some small case histories of children and adults who he says were helped by the program. No actual data to support this was presented.Clark, Elaine and Pompa, Janiece L. (2011). \"Advances in Neuroscience and Reading Disabilities\". The Oxford Handbook of School Psychology, pp. 183–184. Oxford University Press. He says that what she has done was \"an important discovery.\" He also said that it had \"major implications for education\". However, he also says that the Arrowsmith Program has been controversial. There has been a large amount of doubt and criticism from several psychologists, neuroscientists and learning experts. The main reason for this is the lack of scientific evidence that the program does what it says it does. and on its underlying rationale which its critics say represents an oversimplification and misapplication of neuroscientific concepts. In Canada, neuroscientist Adele Diamond and cognitive psychologist Linda Siegel were on a 2008 CBC documentary about the Arrowsmith program. It was filmed at the Arrowsmith School in Toronto. Siegel was very critical about the program. Part of what she said about the program was removed before it was broadcast after Arrowsmith Young's lawyers threatened the CBC with a lawsuit for libel.Hill, M. F. (29 December 2008). \"Education expert calling her lawyer\". Vancouver Sun. Retrieved 31 May 2015. Siegel was wrote a 2003 report to the Vancouver School Board (VSB) about The Arrowsmith program. At the time, VSB was running a three-year trial of the program, Siegel's report had a large effect in the VSB's decision to end the program.Eaton, Howard (2013). \"Siegel's Study: Points For Comment\" . EatonArrowsmithSchool.com. Retrieved 9 June 2015. ==Further reading== *Alferink, Larry A. and Farmer-Dougan, Valeri (2010). \"Brain-(not) Based Education: Dangers of Misunderstanding and Misapplication of Neuroscience Research\". Exceptionality, Vol. 18, pp. 42–52 *McArthur, Genevieve and Castles, Anne (April 2013). \"'Brain-training'... or learning as we like to call it\",Learning Difficulties Australia, Vol. 45, No 1 *Coltheart, Max (10 December 2012). \"Weird neuroscience: how education hijacked brain research\" retrieved from The Conversation. *Doidge, Norman (28 February 2001). \"Brain Building\". National Post (reprinted with permission on SocietyForQualityEducation.org) *Melby-Lervåg, M. and, Hulme, C. (February 2013). \"Is Working Memory Training Effective? A Meta-Analytic Review\". Developmental Psychology, Vol. 49, No. 2, pp. 270–291 from the University of Oslo in Norway. *Coltheart, Max \"Neuromyths\" . As published in the SPELD NSW Newsletter, March 2014 * ==Notes== ==References== Category:Schools in Ontario Category:Organizations based in Toronto Category:Learning Category:1980 establishments in North America Category:1980s establishments in Canada",
 "title": "Arrowsmith School"
}