{
 "id": "1052812",
 "text": "A Very Trainor Christmas is a Christmas album and the fourth album by American singer-songwriter Meghan Trainor. Honest OG Recording and Epic Records released it on October 30, 2020. Trainor's family helped make the album. She wrote its songs with her brothers, Ryan and Justin, among others. Featured artists include Earth, Wind & Fire, Seth MacFarlane, Trainor's cousins Jayden, Jenna, & Marcus Toney, and her father, Gary. The album includes cover versions of well-known Christmas songs, such as \"It's Beginning to Look a Lot Like Christmas\" (1951) and \"Last Christmas\" (1984), as well as six original recordings. Trainor promoted A Very Trainor Christmas with public appearances and televised performances. It was supported by the single release of Trainor and MacFarlane's cover of \"White Christmas\" (1942), which reached number one on the Adult Contemporary chart. Several other tracks received music videos. Critical commentary for the album was generally positive, with praise directed towards Trainor's charisma and the material. It reached number seven on the US Top Holiday Albums chart and the top 50 in the Netherlands and Sweden. A deluxe edition was released on October 29, 2021. ==Track listing== A deluxe edition of A Very Trainor Christmas adds the following songs as tracks 1–3, prior to all of the songs on the standard edition of the album:References for the digital release of A Very Trainor Christmas (Deluxe): * * * Deluxe edition bonus tracks #\"Christmas Coupon\" (writer: M. Trainor) – 3:12 #\"Rockin' Around the Christmas Tree\" (writer: Johnny Marks) – 2:28 #\"Christmas (Baby Please Come Home)\" (writer: Jeff Barry, Ellie Greenwich, Phil Spector) – 2:28 ==Charts== Weekly chart positions for A Very Trainor Christmas Chart (2020–2021) Peak position UK Download Albums (OCC) 47 ==References== Category:Epic Records albums Category:Meghan Trainor albums Category:Christmas albums Category:Soul albums Category:R&B; albums",
 "title": "A Very Trainor Christmas"
}