{
 "id": "1052382",
 "text": "Laurent Kupferman, born in Paris on , is a French writer, he is the son of the historian Fred Kupferman. He has written several works on Freemasonry and is himself a member of the Grand Orient de France. He is an officer of the Order of Arts and Letters. Since 2016, he has been the communications director of the Fédération Française Sésame Autisme. == Biography == Laurent Kupferman was born in Paris on January 19, 1966, he is the son of Fred Kupferman and the author Sigrid Kupferman, he studied general private law at the faculty of Université Paris-Panthéon-Assas. In 1988, he founded the European Symphony Orchestra and joined as an advisor the cabinet of the Minister of Culture Philippe Douste-Blazy. then became a consultant at UNESCO. Being himself a member of the Grand Orient de France, he wrote various works on Freemasonry, some of which in collaboration with the lawyer Emmanuel Pierrat. He co-wrote with Jean-Louis Debré the book “3 minutes to understand the French Republic”. In 2022, he received the \"special human rights prize\" of the Prix Laïcité France from the hands of Jean-François Nys director of the Institute of Business Administration (IAE) accompanied by the minister Olivier Klein and George Serignac grand master of the grand orient of France. In 2023, he wrote the documentary Joséphine Baker, un destin français directed by Dominique Eloudys-Lenys. ==Josephine Baker== Régis Debray is at the origin of the idea of the pantheonization of the singer Joséphine Baker, Laurent Kupferman takes up this idea after his agreement. In 2021 he initiated the petition Dare Joséphine Baker au Panthéon and collected 40,000 signatures. This petition will be signed by several personalities including the photographer Jean-Marie Perier, the composer Laurent Voulzy, the singer Line Renaud, the host Stéphane Bern and even the former minister Jack Lang, it will be accepted by the President of the French Republic Emmanuel Macron. == Works == === Tests === * 2009: Le Paris des Freemasons co-written with Emmanuel Pierrat * 2011: The great texts of Freemasonry decrypted co-written with Emmanuel Pierrat * 2012: What France owes to the Freemasons co-written with Emmanuel Pierrat * 2015: The adventurers of the republic: These freemasons who made our history co- written with Jacques Ravenne * 2016: 3 minutes to understand the 50 fundamental principles of Freemasonry * 2017: 3 minutes to understand the history, foundations and principles of the French Republic co-written with Jean-Louis Debré * 2017: The Secret Temple: Discover the world of Freemasonry in more than 200 questions co-written with Jacques Ravenne * 2021: Gather - Freemasonry: a path towards oneself and towards others * 2021: What the Republic owes to the Freemasons co-written with Emmanuel Pierrat ===Documentary=== * 2021: Joséphine Baker, a French destiny == Honors == === Decoration === * Ordre des Arts et des Lettres == Notes and references == *(fr) Laurent Kupferman, essayiste : \"Joséphine Baker incarne la République du possible\", on france24.com *(fr) 3 minutes pour tout comprendre sur la franc- maçonnerie , on lalogemaconnique.fr Category:1966 births Category:Living people Category:French writers",
 "title": "Laurent Kupferman"
}