{
 "id": "1052952",
 "text": "Toni Rossall (born 19 October 1995) is an New Zealand-Australian professional wrestler. She currently wrestles for All Elite Wrestling (AEW) and competes under the ring name \"Timeless\" Toni Storm and is the current AEW Women's World Champion in her fourth reign. She is also known for her time in WWE, where she was a one-time NXT UK Women's Champion and the winner of the second Mae Young Classic in 2018. Storm has also competed for Progress and ST★RDOM. During her time in AEW, Storm has been a record-holding four-time AEW Women's World Champion. ==Career== ===All Elite Wrestling=== On the 30 March 2022 episode of Dynamite, Storm made her debut with All Elite Wrestling (AEW). She wrestled in the Owen Hart Foundation Women's Tournament, defeating The Bunny in the first round. It was announced the day after that Toni Storm had signed a contract with the company. She made it to the semi-final before losing to Britt Baker. At All Out on September 4, Storm faced Britt Baker, Jamie Hayter, and Hikaru Shida in a four-way match. Storm won the match and the AEW Interim Women's World Championship. This was Storm's first championship in AEW. She lost the title to Jamie Hayter at Full Gear. On the 18 January 2023 episode of Dynamite, Storm turned heel and, along with Saraya, attacked Willow Nightingale after their match. At Revolution, they were joined by Ruby Soho after she attacked Britt Baker and Jamie Hayter after their match. Storm became a two-time AEW Women's World Champion after defeating Jamie Hayter at Double or Nothing. She lost the title to Hikaru Shida on the 2 August episode of Dynamite. On the 4 October episode of Dynamite, Storm renamed herself as \"Timeless Toni Storm\". She played a gimmick of a paranoid movie starlet from the Golden Age of Hollywood, along with the screen turning black-and-white whenever she did a promo. On the 8 November of Dynamite, Mariah May was introduced as a fan of Storm. At Full Gear, Storm defeated Hikaru Shida to become the new AEW Women's World Champion and tie the record for most reigns with three. On the July 10, 2024 episode of Dynamite, May turned on Storm after defeating Willow Nightingale in the finals of the Owen Hart Foundation Women's Tournament to earn a Women's World Championship match at All In. On August 25 at All In, Storm lost the AEW Women's World Championship to her former fan May. After returning with her old character on December 11 at Winter is Coming, Storm revealed it to be a trick and became Timeless again the following month. On February 15, 2025 at Grand Slam Australia, she defeated May to become a record-setting four time Women's World Champion. == Personal life == In June 2021, Storm came out as bisexual. She married professional wrestler Juice Robinson on 2022. == Championships and accomplishments == * All Action Wrestling ** AAW Women's Championship (1 time) * All Elite Wrestling ** AEW Women's World Championship (4 times, current) * British Empire Wrestling ** BEW Women's Championship (1 time) * ESPN ** Ranked No. 16 of the 30 best Pro Wrestlers Under 30 in 2023 * Pro Wrestling Alliance Queensland ** PWAQ Women's Championship (1 times) ** PWAQ Women's Underground Championship (1 time) * Pro Wrestling Illustrated ** Ranked No. 1 of the top 250 female wrestlers in the PWI Women's 250 in 2024 * Progress Wrestling ** Progress Women's Championship (1 time, first) ** Natural Progression Series IV * Sports Illustrated ** Ranked No. 7 in the top 10 women's wrestlers in 2018 * Westside Xtreme Wrestling ** wXw Women's Championship (2 times) ** Femmes Fatales (2017) * World Wonder Ring Stardom ** SWA World Championship (1 time) ** World of Stardom Championship (1 time) ** Cinderella Tournament (2017) ** 5★Star GP (2017) ** 5★Star GP Award (1 time) *** 5★Star GP Outstanding Performance Award (2016) ** Stardom Year-End Awards (1 time) *** MVP Award (2017) * Wrestling Observer Newsletter ** Best Gimmick (2023) * WWE ** NXT UK Women's Championship (1 time) ** Mae Young Classic (2018) == References == ==Other websites== * Category:1995 births Category:Living people Category:All Elite Wrestling people Category:Australian professional wrestlers Category:Bisexual people Category:Female professional wrestlers Category:Former WWE wrestlers Category:LGBT sportspeople Category:New Zealand professional wrestlers Category:Sportspeople from Auckland",
 "title": "Toni Storm"
}