{
 "id": "1052532",
 "text": "Narges Mohammadi (; born 21 April 1972) is an Iranian human rights activist and scientist. She is the Vice-President of the Defenders of Human Rights Center. In 2016, she was sentenced to prison in Tehran for her activism for human rights and against the death penalty in the country. She was released in 2020, however was sent back in 2021. In 2023, she was awarded the Nobel Peace Prize. ==Personal life== Mohammadi was born on 21 April 1972 in Zanjan, Iran, to an Iranian Azerbaijani family. She earned a degree in physics at the Imam Khomeini International University in Qazvin and is an engineer. In 1999, she married a journalist, Taghi Rahmani, and they have two children. At university, she was also active in a mountain climbing group. Because of her love of mountains she organized clubs and trips to the mountain and learned about mountain climbing and mountaineering. Later, she was stopped from being in climbs due to her political activities. ==Human rights== She is the vice president of the Defenders of Human Rights Centre (DHRC) started by Shirin Ebadi. She has worked for women's rights and the ending of the death penalty. She had been imprisoned because of political oppression (poor treatment). In 2023, she won the Nobel Peace Prize for \"her fight against the oppression of women in Iran and her fight to promote human rights and freedom for all\".Nobel Peace Prize in 2023nobelprize.org Mohammadi has been a strong supporter of women not obeying the government. She has also spoken against the Iranian government's forcing girls and women to wear a hijab in public. She has attacked the hijab and the chastity program of 2023. As a journalist she wrote for publications such as Payam-e Hajar. This journal was banned because it published articles about gender rights, religion and political opinions. She also wrote political essays such as The Reforms, The Strategy and The Tactics. ==Prison== Mohammadi was first arrested in 1998 because she said bad things about the Iranian government. She spent a year in prison. Then, In April 2010, she was taken to the Islamic Revolutionary Court for her membership in the DHRC. She was released for a short period on a US$50,000 bail but arrested again some days later and held at Evin Prison. Mohammadi's health got worse while she was in prison, and she got a disease similar to epilepsy: sometimes, she loses muscle control. After a month, she was released and allowed to get medical treatment. In July 2011 she was taken to court again and found guilty of \"acting against the national security, membership of the DHRC and propaganda against the [government].\" In September 2011 she was sentenced to 11 years' imprisonment. She said that she was told of the court's decision only by her lawyers. She had been \"given an unprecedented (never before used) 23-page judgement (sentencing decision) issued by the court in which they repeatedly likened my human rights activities to attempts to topple the regime.\" In March 2012, the sentence was reduced to six years by an appeals court. On 26 April, she was arrested to begin her sentence. The sentence was protested by the British Foreign Office, which called it \"another sad example of the Iranian authorities' attempts to silence brave human rights defenders.\" In July 2012, an international group of lawmakers called for her release, including US Senator Mark Kirk, former Canadian Attorney General Irwin Cotler, UK MP Denis MacShane, Australian MP Michael Danby, Italian MP Fiamma Nirenstein, and Lithuanian MP Emanuelis Zingeris. On 31 July 2012, Mohammadi was released from prison. In May 2016, she was sentenced in Tehran to 16 years' imprisonment for setting up and running \"a human rights movement that campaigns for the abolition of the death penalty.\" She was let out in 2020 but sent back to prison in 2021, where she has since given reports of the abuse and solitary confinement of women prisoners. Amnesty International said she was a prisoner of conscience and called for her immediate release. Reporters Without Borders issued an appeal on Mohammadi's behalf on the ninth anniversary of photographer Zahra Kazemi's death in Evin Prison, stating that Mohammadi was a prisoner whose life was \"in particular danger.\" In January 2024, the Iranian government extended her jail sentence of 12 years for 'spreading propaganda'. == Honors and awards == Awards received by Mohammadi: * 2009 Alexander Langer Award, named for peace activist Alexander Langer. The award carried a 10,000-euro honorarium (lump sum wages). * 2011 Per Anger Prize, the Swedish government's international award for human rights * 2016 Weimar Human Rights Award * 2018 Andrei Sakharov Prize from the American Physical Society * 2022 Recognition as one of BBC's 100 inspiring and influential women * 2023 Olof Palme Prize from the Swedish Olof Palme Foundation, jointly with Marta Chumalo and Eren Keskin * 2023 PEN/Barbey Freedom to Write Award from PEN America * 2023 UNESCO/Guillermo Cano World Press Freedom Prize, Shared with Elaheh Mohammadi and Niloofar Hamedi. * 2023 Nobel Peace Prize \"for her fight against the oppression of women in Iran and her fight to promote human rights and freedom for all\". Four other Iranian women were also candidates: Niloofar Hamedi, Elahe Mohamadi, Masih Alinejad, and Nargest Setude. The President of the United States congratulated her and mentioned Armita Geravand. The Iranian High Council for Human Rights condemned the prize for awarding \"a criminal\". In 2010, when Nobel Peace laureate Shirin Ebadi won the Felix Ermacora Human Rights Award she dedicated it to Mohammadi. \"This courageous woman deserves this award more than I do,\" Ebadi said. ==References== Category:1972 births Category:Living people Category:Iranian human rights activists Category:Nobel Peace Prize winners",
 "title": "Narges Mohammadi"
}