{
 "id": "1053895",
 "text": "Austin Matelson (born March 10, 1985) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and competes under the ring names Killswitch and formerly Luchasaurus. He is also known for his time wrestling in WWE where he competed in NXT and wrestled under the ring name Judas Devlin and in Lucha Underground where he wrestled under the ring name Vibora. During his time in AEW, Luchasaurus has been a one-time AEW TNT Champion and a one-time AEW World Tag Team Champion. Matelson was a contestant on season 17 of the American reality television show Big Brother. ==Career== ===All Elite Wrestling=== On May 25, 2019 at Double or Nothing, Luchasaurus made his debut with All Elite Wrestling (AEW). He competed in the Casino Battle Royal and made it to the final three but lost to Adam Page. On May 28, it was announced that Luchasaurus had signed a contract to be a member of All Elite Wrestling (AEW). Luchasaurus teamed with Jungle Boy as A Boy And His Dinosaur. They were later joined by Marko Stunt and created a stable called Jurassic Express. On the November 20 episode of Dynamite, Luchasaurus would get his first AEW win when he defeated Peter Avalon in 27 seconds. On the August 18, 2021 episode of Dynamite, Jurassic Express faced The Young Bucks for the AEW World Tag Team Championships but lost. On the January 5, 2022 episode of Dynamite, Jurassic Express won the AEW World Tag Team Championship after defeating the Lucha Brothers (Pentagón Jr. and Rey Fénix). This was Luchasaurus' first championship in AEW. On June 15 at Road Rager, Jurassic Express lost the championships to the Young Bucks. After the match, Luchasaurus and Christian Cage turned heel. Cage attacked Jungle Boy and Luchasaurus left with Cage. On the June 17 debut episode of Collision, Luchasaurus defeated Wardlow to win the AEW TNT Championship. On the September 23 episode of Collision, Luchasaurus lost the title to Christian Cage in a three-way match that also featured Darby Allin. Cage said that Luchasaurus' TNT Championship was his own in the months leading up to the match. On the November 22 episode of Dynamite, Christian Cage renamed Luchasaurus and began calling him Killswitch after Cage's old finisher name. == Championships and accomplishments == * All Elite Wrestling ** AEW TNT Championship (1 time) ** AEW World Tag Team Championship (1 time) – with Jungle Boy * All-Star Wrestling ** ASW Tag Team Championship (1 time) – with The Thunder From Jalandhar * DDT Pro-Wrestling ** Ironman Heavymetalweight Championship (1 time) * Lucha Underground ** Lucha Underground Trios Championship (1 time) – with Drago and Pindar * Pro Wrestling Illustrated ** Ranked No. 105 of the top 500 singles wrestlers in the PWI 500 in 2020 * Millennium Pro Wrestling ** MPW Heavyweight Championship (1 time) == References == Category:1985 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from Los Angeles County, California",
 "title": "Luchasaurus"
}