{
 "id": "1053632",
 "text": "is a Japanese professional wrestler, martial artist, actress, and model. She currently wrestles for All Elite Wrestling (AEW). She also wrestles for Oz Academy and Pro Wrestling Wave. She is known for her time in the Ice Ribbon promotion. During her time in AEW, Shida has been a three-time AEW Women's World Champion. She also held the record for the longest reign in the championship's history at 372 days and tied with most reigns as champion with 3. ==Career== ===All Elite Wrestling=== On April 9, 2019, Shida signed a contract with All Elite Wrestling (AEW). She made her AEW in-ring debut at Double or Nothing on May 25, 2019. She wrestled in a six-woman tag team match with Riho and Ryo Mizunami to defeat Aja Kong, Emi Sakura, and Yuka Sakazaki. At All Out, Shida faced Riho and defeated her. The winner would face Nyla Rose to see who would become the first AEW Women's World Champion. On the January 1, 2020 episode of Dynamite, Shida faced Riho, Britt Baker, and Nyla Rose in a four-way match for the AEW Women's World Championship but lost. At Double or Nothing, Shida faced Nyla Rosa for the AEW Women's World Championship. She was able to win the match and the championship. This was Shida's first championship in AEW. Shida would successfully defend the title again multiple opponents throughout the year. After a reign of 372 days, the longest reign in the championship's history, Shida was defeated by Britt Baker at Double or Nothing on May 30, 2021. Shida would then enter the Owen Hart Foundation Women's Tournament. On the May 6, 2022 episode of Rampage, Shida defeated Julia Hart in the to first round. However, she had to drop out of the tournament and was replaced by Kris Statlander because she was in Japan at the time and couldn't re-enter the country. On the August 2, 2023 episode of Dynamite, Shida would defeat Toni Storm and win her second AEW Women's World Championship. At All In, Shida lost the title to Saraya in a four-way may that also featured Britt Baker and Toni Storm. On the October 10 episode of Dynamite, Shida would win the AEW Women's World Championship back from Saraya. This was Shida's third championship win which broke a record for most reigns as champ. Shida would lose the title to \"Timeless\" Toni Storm at Full Gear. == References == ==Other websites== * *Hikaru Shida on YouTube Category:1988 births Category:Living people Category:All Elite Wrestling people Category:Female professional wrestlers Category:Japanese martial artists Category:Japanese professional wrestlers Category:Judoka Category:Professional wrestling announcers Category:Professional wrestling referees Category:Sportspeople from Kanagawa Prefecture",
 "title": "Hikaru Shida"
}