{
 "id": "1053427",
 "text": "Only Up! is a video game by SCKR Games. The game was first on Steam on May 24, 2023. It was taken from the Steam store for not respecting copyright laws. It was removed again because the creator felt stressed. Critics gave great opinions for the difficulty of Only Up!. They also said that the graphics in the game were not good. The game was similar to the video games Getting Over It with Bennett Foddy and Jump King. Only Up! was the most popular game on Twitch and Kick. == Gameplay == The game starts in a junkyard. The main character, Jackie, must climb up obstacles. Shortcuts include beds as trampolines. There are no checkpoints. The player must complete the game without falling. == Release == Only Up!'s gameplay is traced back to \"Jack and the Beanstalk\". On June 15, 2023, SCKR Games released an update. This added camera controls. The player can now switch between first- and third-person perspectives. === First removal from Steam === Only Up! was removed from Steam on June 30, 2023. It had copyright violations. One of them was a 3D model of a statue. It was made by an artist named Aboulicious. SCKR Games released an update and removed the statue. Only Up! was up to play again on July 1. SCKR Games asked Abolicious to create a new 3D model, and it was later replaced by a statue of Atlas. === Second removal from Steam === On September 7, 2023, Only Up! was permanently removed. The creator was stressed. They said that they needed \"peace of mind and healing\" The developer announced their next video game, Kith. === Promotions of non-fungible tokens === In October 2021, all blockchain games that buy and sell non-fungible tokens (NFTs) were not playable. Truth Labs created the Goblintown NFT series. They released it under a Creative Commons 0 license. Only Up! had NFTs around the game. The NFT series later sold clothing inspired by the game. Only Up! released on May 24, 2023. Players from China, Japan, and Spain played the game. In June 2023, Only Up! was the sixth most popular game. A big attraction is because of how much progress a player loses when they fall down. == Reception and legacy == Critics say that Only Up!'s felt tense. They compared Only Up! to Getting Over It with Bennett Foddy. Ayuo Kawase of Automaton Media commented about the tension. Writing for TechRadar, Elie Gould felt that Only Up! was stressful when a player is in the game. Ben Lyons of Gamereactor, giving a score of 7/10, wrote that the game was without checkpoints. Rating the game three out of five stars, Dexerto's Rishabh Sabarwal summarized the \"captivating\" gameplay. The player could fall at any point in the journey. However, journalist Jason Cartwright of TechAU said the gameplay was \"very rewarding\". Only Up!'s design was not liked by critics. Try Hard Guides' Christian Harrison, Gould, and Lyons agreed that the design was not good.Gould, Elie (July 14, 2023). Lyons, Ben (July 13, 2023). However, Cartwright praised the \"beautiful\"Cartwright, Jason (June 19, 2023). graphics when using a high-tech computer. Even though Kawase wrote that Only Up! was not easy to look at,Kawase, Ayuo (June 15, 2023). \"Frustrating climbing game Only Up! grows popular among Japanese streamers\". Automaton Media. Translated by Marco Farinaccia. Archived from the original on July 24, 2023. Retrieved July 23, 2023. Harrison said that the setting for graphics were at their highest. A widespread opinion was that Only Up! was unoriginal in gameplay. === OnlyUp Fortnite === OnlyUp Fortnite is a Fortnite map created in Unreal Engine. This version takes Only Up's gameplay and adds objects from Fortnite. OnlyUp Fortnite was more popular than the original game. 100,000 players played the game in July 2023. == Notes == == References == == Other websites == * Only Up! on MobyGames * SCKR Games's full message about removing the game Category:2023 video games Category:3D platformers Category:Climbing and mountaineering video games Category:Indie video games Category:Single-player video games Category:Video game memes Category:Video games developed in South Korea Category:Windows games",
 "title": "Only Up!"
}