{
 "id": "1053426",
 "text": "The British Shorthair is a breed of cat. It is a natural British cat breed. In many cases, it has gray coat. == History == After the Roman Empire invaded the Great Britain, now part of the United Kingdom, the breed developed its own distinctive characteristics on the island for nearly 2,000 years. Organized records of the British Shorthair can be found from the 19th century, including some of the world's first National Cat Club cat shows. The breed was popular in Britain and continental Europe until the early 20th century, when its population plummeted during World War I and II. However, thanks to the efforts of breeders, the current standard of the British Shorthair has been established. In the United Kingdom, entire Europe, and Oceania, it was one of the most popular breeds in the early days of cat shows and remains so today. In North America, on the other hand, the breed only began to gain traction with fanciers in the 1980s. == Appearance == They grow from 3 to 5 years of age, and when fully grown, males weigh between 4 and 8 kilograms. Males are generally larger than females. Their body type is more of a semi-cobby type, with a large, rounded head, and their ears should not be large compared to their head. Their eyes are large and round, with fleshy cheeks that give them a grumpy look, but they have a gentle smile. The body is solid and well-boned. It should have a short, thick neck. The legs are also thick and short, and the tail is rounded at the end and about two-thirds the length of the body. Their fur is short, dense, and stiff. They come in a variety of colors, with blue being the most common. Their eye color is related to their coat color. It's a short-haired breed, but that does not mean it does not shed. == Behavior == They are careful and gentle, quiet and patient. Like an English gentleman, they are considerate of other animals, such as dogs, and live peacefully with them. Their large, round eyes are constantly communicating. They are very affectionate and want to be near people. == References == Category:Cat breeds Category:Natural cat breeds",
 "title": "British Shorthair"
}