{
 "id": "1053655",
 "text": "Paige Wooding (born 23 April 1995), better known by the ring name Jamie Hayter, is a British professional wrestler. She currently wrestles for All Elite Wrestling (AEW). She is also known for her time wrestling in Revolution Pro Wrestling (RevPro) and Stardom. During her time in AEW, Hayter became a one-time AEW Women's World Champion. ==Career== ===All Elite Wrestling=== On 23 October 2019 episode of Dynamite, Hayter made her AEW in-ring debut losing to Britt Baker. She was supposed to wrestle for AEW some more in the weeks after but went back to Japan and couldn't return because of the COVID-19 pandemic. On the 13 August 2021 debut episode of Rampage, Hayter made her return to AEW as a heel. She helped Britt Baker in a post-match beatdown of Red Velvet and Kris Statlander. It was announced by AEW the next day that she had signed a contract with them. She then entered a tournament to crown the first AEW TBS Champion. On the 3 November episode of Dynamite, Hayter defeated Anna Jay in the first round. She lost to Thunder Rosa in the next round on the 24 November episode of Rampage. She entered the Owen Hart Foundation Women's Tournament and defeated Skye Blue on the 1 April episode of Rampage. She lost to Toni Storm in the quarterfinals. She suffered a broken nose after a loss to Thunder Rosa in a AEW Women's World Championship match at AEW Battle of the Belts III. At Full Gear, Hayter defeated Toni Storm to become the interim AEW Women's World Champion. AEW Women's World champion Thunder Rosa gave up the title on the following episode of Dynamite. Due to this, Hayter became the official champion. Hayter had her first title defense against Hikaru Shida at Holiday Bash. Hayter would win the match and the match was well liked by people backstage. At Double or Nothing, Hayter would lose the title to Toni Storm. == Championships and accomplishments == * All Elite Wrestling ** AEW Women's World Championship (1 time) * Big League Wrestling ** BLW Women's Championship (1 time) * ESPN ** Ranked No. 19 of the 30 best Pro Wrestlers Under 30 in 2023 * Pro-Wrestling: EVE ** Pro Wrestling: EVE International Championship (1 time) * Pro Wrestling Illustrated ** Ranked No. 4 of the top 250 female singles wrestlers in the PWI Women's 250 in 2023 ** Ranked No. 29 of the top 50 tag teams in the PWI Tag Team 50 in 2020 * Revolution Pro Wrestling ** RevPro British Women's Championship (2 time) * Sports Illustrated ** Ranked No. 6 in the top 10 wrestlers of 2022 * World War Wrestling ** WWW Women's Championship (1 time) * World Wonder Ring Stardom ** Goddesses of Stardom Championship (1 time) – with Bea Priestley ** SWA World Championship (1 time) ** 5★Star GP Award (1 time) *** 5★Star GP Fighting Spirit Award (2019) == References == ==Other websites== * Category:1995 births Category:Living people Category:All Elite Wrestling people Category:British professional wrestlers Category:Female professional wrestlers Category:Sportspeople from Hampshire",
 "title": "Jamie Hayter"
}