{
 "id": "1053506",
 "text": "Tiger 3 is an 2023 Indian Hindi language action-thriller movie. It is directed by Maneesh Sharma and produced by Aditya Chopra. It is a sequel of Ek Tha Tiger (2012) and Tiger Zinda Hai (2015) and is the fifth installment in the YRF Spy Universe. The movie stars Salman Khan, Katrina Kaif and Emraan Hashmi. Made with a production budget of around 300 crores and it earned almost 466 crores worldwide becoming a hit at the box office. == Plot == This movie following the events of Tiger Zinda Hai, War and Pathaan. == Cast == * Salman Khan as Avinash \"Tiger\" Singh Rathore, a RAW agent and Zoya's husband * Katrina Kaif as Zoya, an ISI agent and Tiger's wife * Emraan Hashmi as Aatish Rehman, an ex-ISI agent * Revathi as Maithili Menon, Chief of RAW * Simran as Nasreen Irani, Prime Minister of Pakistan * Riddhi Dogra as Shaheen Baig, Aatish's wife * Vishal Jethwa as Hassan Ali, Tiger and Zoya's adopted son * Kumud Mishra as Rakesh Prasad Chaurasia * Ranvir Shorey as Gopi Arya, Tiger's former handler * Aamir Bashir as Rehan Nazar, Zoya's father * Gavie Chahal as Captain Abrar Sheikh * Anant Vidhaat Sharma as Karan Rao * Danish Bhat as Captain Javed Baig, Shaheen's brother * Sartaaj Kakkar as Junior, Tiger and Zoya's son * Chandrachoor Rai as Nikhil * Shahid Lateef as General Imtiaz Haq * Edward Sonnenblick as Dr. Hauffman * Neeraj Purohit as Jibran Sheikh * Danish Husain as DG Riyaz * Gurket Kaur as Young Zoya * Michelle Lee as Fight Assassin * Denzil Smith as Indian Home Minister * Varinder Singh Ghuman as Prison Guard * Shah Rukh Khan as Pathaan (cameo appearance) * Ashutosh Rana as Colonel Sunil Luthra (cameo appearance) * Hrithik Roshan as Major Kabir Dhaliwal (cameo appearance) == Music == The music of the film is composed by Pritam while the lyrics are written by Irshad Kamil and Amitabh Bhattacharya. The background score is composed by Tanuj Tiku. The first single titled \"Leke Prabhu Ka Naam\" was released on 23 October 2023. == Release == The movie was originally scheduled to be release theatrically on 21 April 2023 in Eid, but was postponed, and released on 12 November 2023 on Diwali. Additionally, movie was dubbed and released in Tamil and Telugu languages. The official trailer was released on 16 October 2023. == References == == Other websites == Category:2023 action movies Category:2023 thriller movies Category:2020s action thriller movies Category:2020s Indian movies",
 "title": "Tiger 3"
}