{
 "id": "1053597",
 "text": "I Disagree is the third album by American singer Poppy. It was released on January 10, 2020. It is her first album with the label Sumerian Records. It is her last collaboration with Titanic Sinclair, who was accused of domestic abuse. A new version of the album, I Disagree (more), came out on August 14, 2020. It was the same as I Disagree, but with new bonus songs and a new cover art. == Background == Poppy started making I Disagree right after she released Am I a Girl?. Many people give the album different genres, including heavy metal and pop. Poppy came up with her own label called \"post-genre\". She also said it is \"heavy\", and called it a follow up to her songs \"Play Destroy\" and \"X\". Poppy released the first song, \"Concrete\" in August 2019. The album was announced in September. In October, she released the song \"I Disagree\". In November, she released \"Bloodmoney\" and announced a tour. In December, she released the last single, \"Fill the Crown\". The album I Disagree was released on January 10, 2020. In July 2020, Poppy announced I Disagree (more) and released its single \"Khaos x4\". It was released on August 14, 2020. It is a new version of the album that has extra songs and a new cover art. == Genres == I Disagree is an album that uses a lot of different genres. These are the genres that the album has been described as: * Avant-garde * Heavy metal * Pop * Pop metal * Electropop * Industrial rock * Rock * Nu metal * Kawaii metal * Hard rock * Industrial These are the genres that the album takes parts from. This means that it is not actually these genres, but it is inspired by them. * Art pop * Dubstep * Experimental pop * Industrial metal * Alternative metal * Progressive metal * Thrash metal * Electronic * Metalcore * Deathcore * Post- grunge * Progressive rock * Pop punk * Dream pop * Bubblegum pop * Alternative pop * Acoustic pop * R&B; * J-pop * K-pop == Reception == According to Metacritic, I Disagree was considered \"generally favorable\". It has a score of 72 out of 100. == Track listing == == References == Category:2020 albums Category:Nu metal albums Category:Heavy metal albums",
 "title": "I Disagree"
}