{
 "id": "1053668",
 "text": "Nathan Troy Blauvelt (born March 17, 1987) is an American professional wrestler, singer, and actor. He currently wrestles for All Elite Wrestling (AEW) and competes under the ring name Brody King. He has also wrestled in Major League Wrestling (MLW), Ring of Honor (ROH), and New Japan Pro-Wrestling (NJPW). During his time in AEW, King has been a one-time AEW World Trios Champion. Outside of professional wrestling, King is the lead singer for the hardcore band God's Hate. ==Career== ===All Elite Wrestling=== On January 12, 2022 episode of Dynamite, King debuted with All Elite Wrestling (AEW). He debuted as a heel, joined Malakai Black's stable the House of Black by attacking The Varsity Blondes (Brian Pillman Jr. and Griff Garrison) and Penta El Zero Miedo after their match. On the February 23, 2022 episode of Dynamite, Buddy Matthews also joined the House of Black. During the Revolution buy-in on March 6, the House of Black defeated the team of Pac, Penta Oscuro, and Erick Redbeard. On March 5, 2023 at Revolution, King and the House of Black defeated The Elite (Kenny Omega, Matt Jackson, and Nick Jackson) to become the new AEW World Trios Champions. This was King's first championship in AEW. At All In, King and the House of Black lost the titles to Billy Gunn and the The Acclaimed (Max Caster and Anthony Bowens). == Championships and accomplishments == * AAW Wrestling ** AAW Heavyweight Championship (1 time) * All Elite Wrestling ** AEW World Trios Championship (1 time) – with Malakai Black and Buddy Matthews ** Royal Rampage (2022) * All Pro Wrestling ** Young Lions Cup (2016) * National Wrestling Alliance ** NWA World Tag Team Championship (1 time) – with PCO ** Crockett Cup (2019) – with PCO * Oddity Wrestling Alliance ** OWA Tag Team Championships (1 time) – with Tyler Bateman * PCW Ultra ** PCW Tag Team Championship (1 time) – with Josef and Jacob Fatu * Pro Wrestling Guerrilla ** PWG World Tag Team Championship (1 time, current) – with Malakai Black * Pro Wrestling Illustrated ** Ranked No. 79 of the top 500 singles wrestlers in the PWI 500 in 2019 * Ring of Honor ** ROH World Six Man Tag Team Championship (1 time) – with Marty Scurll and PCO ** ROH World Tag Team Championship (1 time) – with PCO ** Tag Wars (2019) – with PCO ** ROH Year-End Award (1 times) *** Faction of the Year (2019) – * Santino Bros. Wrestling ** SBW Championship (1 time) ** SBW Championship #1 Contenders Tournament (2017) * SoCal Uncensored ** Southern California Rookie of the Year (2016) ** Southern California Wrestler of the Year (2018) * World Series Wrestling ** WSW Tag Team Championship (1 time) – with Marty Scurll == References == ==Other websites== * Category:1987 births Category:Living people Category:All Elite Wrestling people Category:American heavy metal singers Category:American professional wrestlers Category:Sportspeople from California Category:Sportspeople from Los Angeles County, California",
 "title": "Brody King"
}