{
 "id": "1053256",
 "text": "The Justice Documentary Festival Paris is one of the oldest French judicial festivals which brings together a selection of documentaries on the theme of Justice. It awards a Jury Grand Prize and a Public Grand Prize.Eric Hancock. The oldest film festival on French Justice was relaunched this year on NewsBreak.com ==First editions== The Documentary Festival on Justice or Judicial Film Festival of the Paris Bar is a national film festival created in 1997 by President Bernard Vatier. Its head office is in Paris at the Musée du Barreau de Paris. In 2013, the President Christiane Féral-Schuhl titled it “Film and justice”. Film festivals take place every year in the auditorium of the Maison du Barreau. ==Editions== Année Dates Lieu Président 1997 21-27 mars Paris Bertrand Tavernier 1998 20-24 mars Paris Claude Miller 1999 19-23 mars Paris Pierre Granier-Deferre 2000 6-10 octobre Paris Costa Gavras 2015 26-28 mars Paris Pierre Haski 2017 13-15 septembre Paris Isabelle Giordano 2024 04-06 février Paris Bernard de la Villardière ==New Edition== In 2023, the new edition of the Paris Bar Judicial Film Festival is called the Justice Documentary Festival. It is organized by the Maison du Barreau de Paris. It puts in competition 11 films on the judicial theme judged by a prestigious jury made up of personalities from the legal world, journalists and intellectuals in order to award 2 prizes including that of the Jury and that of the Public, it takes place from 18 to September 21, 2023 at the auditorium of the Paris Bar. It is considered by the press as \"one of the oldest and most prestigious festivals on the theme of justice\". Dylan Besseau and Guillaume Gevart were the two youngest directors in the selection, the festival was chaired by Serge Moati. ==Jury 2023== * Chaired by Serge Moati * Laure Beccuau, public prosecutor at the Paris Judicial Court * Julie Couturier, Bâtonniere of Paris * Vincent Nioré, Vice-Bâtonnier of Paris * Jacques Toubon, Former Minister of Justice and Culture * Dominique Simonnot, General controller of places of deprivation of liberty * Basile Ader, former Vice- President of Paris and lawyer for L'Equipe and Le Parisien ===Official SelectionsFestival Programmation on avocatparis.org=== * In the eyes of the judges by Mathieu Delahousse and Damien Vercaemer * La Dispute by Mohamed El Khatib produced by Serge Lalou and Camille Laemlé * Daech, les enfants fantômes by Hélène Lam Trong produced by Fabienne Servan-Schreiber and Estelle Mauriac * Anne Bouillon : Justice pour toutes ! by Dylan Besseau produced by Guillaume Gevart * Rwanda : Le silence des mots by Gaël Faye and Michael Sztanke produced by Stéphanie Lebrun * The Killers of the Republics - Hit for Hit by Damien Fleurette, Vincent Nouzille produced by Bernard de La Villardière * War crimes in Ukraine, justice on the march by Elizabeth Drévillon produced by Stéphanie Lebrun * Dangereux à perpétuité ? by Frédérique Lantieri produced by Stéphanie Lebrun * In our prisons, a story of struggle by Lise Baron produced by Maël Mainguy * Justice ! by Marion Guégan & Marie Chartron produced by Théo Laboulandine * Ambush : Invisible Crimes by Sarah Brethes, Mathieu Magnaudeix & David Perrotin produced by Mediapart == Winners == * The Grand Jury Prize : In our prisons, a story of struggle by Lise Baron * The Grand Public Prize : Rwanda : Le silence des mots by Gaël Faye * Special Mention from the Jury : Daech, les enfants fantômes by Hélène Lam Trong ==Second Edition== In 2024, the second edition is chaired by Bernard de La Villardière.Festival du documentaire sur la Justice 2ème nouvelle édition sur avocatparis.org The jury was composed of former Vice President of the Paris Bar Association Basile Ader, former minister Manuel Valls, criminal defense lawyer Rachel-Flore Pardo, President of the Court of Assizes Sophie- Hélène Château, Public Prosecutor of Tours Frédéric Chevalier, producer David Nitlich, and Vice President of the Paris Bar Association Vanessa Bousardo. == Notes and references == Film Festival Category:Festivals in France Category:Lists of movies Category:Movie festivals Category:1997 establishments in Europe Category:1990s establishments in France",
 "title": "Justice Documentary Festival Paris"
}