{
 "id": "1053243",
 "text": "All Star Comics was an anthology comic book series published from 1940 to 1951. It was published again during the 1970s. It was different from other publication because it was published by both All-American Publications and National Periodical Publications. The series had the most popular characters from the regular superhero anthology books of both publishers. The two companies later merged in 1946 to become the modern day DC Comics. ==History== “All Star Comics” is best known for comics with the Justice Society of America. They were the first superhero team. Their story was first published in the third issue. (December 1940) It was the lead feature for the rest of the series’ run. Although the JSA adventures took up most of each new issue, there would usually be at least one other story as well. In the eighth issue (January 1942), All Star introduced Wonder Woman. She was in a story by herself. It was not a part of the JSA story. Wonder Woman became one of the most popular superheroes of all time. The issue with her first story is a comic wanted by people who collect comics. The publication schedule for “All Star” changed over time. The first four issues were published quarterly (every three months). It had Summer, Fall, Winter and Spring issues. From issue #5 (July 1941) to #17 (June 1943), it was published every other month. It published quarterly again from September 1943 (#18) to December 1945 (#27). This was likely because of a paper shortage during World War II and not a decrease in sales. With the April 1946 issue (#28), the series went back to publishing every other month. It stayed that way for the rest of its time being published. As superheroe stories necame less populary in the end of the Golden Age, All Star Comics changed its name to All Star Western. The JSA feature was replaced with cowboy heroes like Johnny Thunder. In February 1976, the series was revived. It once again had stories about the JSA. This series ignored the “All Star Western” run entirely. It re-started the series with a new issue #58. The June 1977 issue (#66) added a hyphen to the series’ name. This officially made the title “All-Star Comics”. It lasted until issue #74 (October 1978). ==Other websites== * All Star Comics and All Star Comics (revival) at Mike's Amazing World of DC Comics. Category:American comic books Category:1940 establishments in the United States Category:1978 disestablishments in the United States Category:DC Comics",
 "title": "All Star Comics"
}