{
 "id": "1053464",
 "text": "Kristen Stadtlander (born August 7, 1995) is an American professional wrestler. She currently wrestles for All Elite Wrestling (AEW) and competes under the ring name Kris Statlander. During her time in AEW, Statlander has been a one-time TBS Champion. ==Career== ===All Elite Wrestling=== On the November 19, 2019 episode of Dark, Statlander made her AEW in-ring debut teaming with Big Swole and being defeated by Riho and Britt Baker. On the December 4 episode of Dynamite, Statlander got her first AEW win when she defeated Hikaru Shida. On December 9, 2019, it was confirmed by AEW that Statlander had signed a contract with them. On the December 18 episode of Dynamite, Statlander defeated Britt Baker to become the number one contender for the AEW Women's World Championship. Statlander lost to AEW Women's World Champion Riho after Brandi Rhodes and her group interfered. She would also face then-AEW Women's Champion Nyla Rose at Revolution but lost again. At Double or Nothing on May 28, 2023, Statlander returned from an ACL tear. She challenged Jade Cargill's open challenge after her match with Taya Valkyrie. Statlander defeated Cargill and become the AEW TBS Champion. It was Statlander's first championship in AEW. She also ended Cargill's winning streak at 60 matches in the progress. At Full Gear, Statlander lost the title to Julia Hart. == Other media == Television Year Title Role Notes 2016 Ladylike Uncredited; stuntwoman Series finale 2021 Rhodes to the Top Herself 2022 Floor Is Lava Herself Web series Year Title Role Notes 2020-2022 Being The Elite Herself Series regular Video games Year Title Notes 2019 WWE 2K20 Motion capture only 2023 AEW Fight Forever == Championships and accomplishments == * AAW Wrestling ** AAW Women's Championship (1 time) * All Elite Wrestling ** AEW TBS Championship (1 time) * Create A Pro Wrestling ** CAP Television Championship (1 time) ** CAP TV Championship Tournament (2019) * Beyond Wrestling ** Treasure Hunter Tournament (2019) * IndependentWrestling.TV ** Independent Wrestling Championship (1 time) * New York Wrestling Connection ** NYWC Starlet Championship (1 time) * Pro Wrestling Illustrated ** Ranked No. 26 of the top 150 female wrestlers in the PWI Women's 100 in 2021 * Sports Illustrated ** Ranked No. 6 of the top 10 women's wrestlers in 2019 * Victory Pro Wrestling ** VPW Women's Championship (2 times) * Women Superstars United ** WSU World Championship (1 time) ** Interim WSU World Championship (1 time) ** WSU Spirit Championship (1 time) == References == ==Other websites== * Category:1995 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Female professional wrestlers Category:Sportspeople from New York (state)",
 "title": "Kris Statlander"
}