{
 "id": "1053576",
 "text": "The LA to the Moon Tour was American singer Lana Del Rey's fourth concert tour. It was for her album Lust for Life, which came out in 2017. The tour started on January 5, 2018 in Minneapolis, United States. It ended early in Budapest, Hungary due to the cancellation of Israel due to the Hamas-Israel war. == Set list == These are the songs that Lana Del Rey sang at the first show of the tour. She did not always sing the same songs at every show. # \"13 Beaches\" # \"Pretty When You Cry\" # \"Cherry\" # \"Born to Die\" # \"Blue Jeans\" # \"White Mustang\" # \"National Anthem\" # \"When the World Was at War We Kept Dancing\" # \"Music to Watch Boys To\" # \"Lust for Life\" # \"Change\" / \"Black Beauty\" / \"Young and Beautiful\" # \"Ride\" # \"Video Games\" # \"Love\" # \"Ultraviolence\" # \"Summertime Sadness\" # \"Serial Killer\" # \"Off to the Races\" == Shows == List of showsNorth American box score: * * * * Oceania box score: * European dates: * * * * Date (2018) City Country Venue Opening act Attendance Revenue January 5 Minneapolis Target Center Jhené Aiko rowspan=\"4\" rowspan=\"4\" January 7 Denver Pepsi Center January 11 Chicago United Center January 13 Boston TD Garden January 15 Toronto Air Canada Centre Kali Uchis 12,771 / 12,771 $1,062,700 January 17 Detroit Little Caesars Arena rowspan=\"9\" rowspan=\"9\" January 19 Newark Prudential Center January 21 Philadelphia Wells Fargo Center January 23 Columbus Schottenstein Center January 25 Washington, D.C. Capital One Arena January 26 State College Bryce Jordan Center January 30 Charlotte Spectrum Center February 1 Sunrise BB&T; Center February 2 Orlando Amway Center February 5 Atlanta Philips Arena 7,370 / 12,275 $604,500 February 6 Nashville Bridgestone Arena February 8 Dallas American Airlines Center 9,929 / 13,365 $824,168 February 10 Houston Toyota Center February 11 Austin Frank Erwin Center 10,941 / 10,941 $807,280 February 13 Phoenix Talking Stick Resort Arena Kali Uchis rowspan=\"2\" rowspan=\"2\" February 15 San Diego Valley View Casino Center February 16 Paradise Mandalay Bay Events Center 8,880 / 9,210 $794,687 February 28 Honolulu Waikiki Shell rowspan=\"7\" rowspan=\"7\" March 17 San Isidro Hipódromo de San Isidro rowspan=\"4\" March 18 Santiago Parque O'Higgins March 23 Bogotá Parque Deportivo 222 March 25 São Paulo Autódromo de Interlagos March 29 Brisbane Riverstage Børns March 31 Melbourne Sidney Myer Music Bowl April 2 Sydney Qudos Bank Arena 12,614 / 13,657 $1,215,120 April 11 Milan Mediolanum Forum Cat Power rowspan=\"8\" rowspan=\"8\" April 13 Rome PalaLottomatica April 16 Berlin Mercedes-Benz Arena April 17 Antwerp Sportpaleis April 19 Barcelona Palau Sant Jordi April 20 Madrid Palacio Vistalegre June 29 Panenský Týnec Panenský Týnec Airfield rowspan=\"2\" August 10 Budapest Hajógyári Island Total $22,500,000 == Cancelled dates == Lana Del Rey planned two other concerts for the tour that did not happen. She cancelled the Kansas City concert because she was sick. She also cancelled the Israel concert because it would help Palestine with their war. Date (2018) City Country Venue June 9 Kansas City Sprint Center September 7 Lehavot HaBashan Pecan Park == Notes == == References == Category:Lana Del Rey concert tours",
 "title": "LA to the Moon Tour"
}