{
 "id": "1053254",
 "text": "Hungry Jack's, abbreviated to HJ's, is the exclusive Australian franchise of the international QSR chain Burger King. Its parent corporation is Hungry Jack's Pty. Ltd which is a wholly owned subsidiary of Competitive Foods Australia, a privately held company owned by millionaire Jack Cowin and his family. HJP owns and operates or sub-licenses over 300 restaurants on that continent. ==Corporate Profile== ===History of Burger King in Australia=== When Burger King decided to expand its operations into Australia, it found that its business name was already trademarked by a man running a small takeaway food shop in Queensland. As a result, Burger King provided the Australian franchisee, Jack Cowin, with a list of possible alternative names that the Australian Burger King restaurants could be branded as. The names were derived from pre-existing trademarks already registered by Burger King and its then corporate parent Pillsbury. Cowin selected the \"Hungry Jack\" brand name, one of Pillsbury's US pancake mixture products, and slightly changing the name to a possessive form by adding an apostrophe 's' thus forming the new name Hungry Jack's. Accordingly, the first Australian franchise of the Burger King Corporation, established in Perth in 1971, was branded as Hungry Jack's. ===Facts and figures=== Many Hungry Jack's restaurant locations are designed around a 1950s/1960s styled theme. Background music from this era may be played within the restaurant (occasionally through a '50s era styled Jukebox) with associated contemporary pictures and memorabilia utilized as part of the interior decor. In the larger sit-down style restaurants, the seats and tables are laid out in a 1950s diner style. ==Products== The only BK trademarked products that HJ sells are the Whopper and the Ocean Catch sandwich. All other products go by a generic naming such as hamburger or chicken nuggets. Otherwise, Hungry Jack's sells the usual range of burgers but also offers an Australian specialty: the Aussie Burger. This burger is based on the traditional Australian fish and chips shop favourite, including fried egg, bacon, onion, and beetroot, with the traditional meat, lettuce, and tomato. Hungry Jack's locations are required to follow any menu changes made by Burger King. Hungry Jack's breakfast menu, introduced in late 2005 in three states (Queensland, Western Australia, and Northern Territory) and the other states on October 31 2006, bears little resemblance to Burger King's US breakfast menu. The main breakfast sandwich is served on either an English muffin, baguette roll or as a wrap (breakfast burrito) instead of a croissant; the hash browns are served as patties as opposed to Tater Tots and they feature pancakes. ==Advertising== Hungry Jack's in Australia has trademarked the new slogan, 'Oh Yeah', which was featured in commercials that ran late 2005/early 2006. Other changes at Hungry Jack's include a new salad line and deli-style baguettes. While Burger King has updated its logo to the \"blue crescent\" design in all other markets, the Hungry Jack's logo is still based on the previous 1996 revised Burger King bun-halves logo, employing the simpler bun-and-filling motif. Hungry Jack's Kids Club mascots are unique to the Australian franchisee, as opposed to other international locations that use one the two existing BK kid's mascots, the Burger King Kids' Club or the Honbatz. HJ does have a Kid's Club program similar to the US offering, offering themed birthday parties at its restaurants along with its Kid's Club Meals. One other noticeable difference between the HJ and BK children's programs is the placement of the apostrophe in the name: HJ places it before the \"s\" while BK places it after. Hungry Jack's retains strong links with Perth, with the city's first team in the Australian Football League, the West Coast Eagles, having been sponsored by Hungry Jack's since their entry into the league in 1987. Other QSR vendors * KFC (Another Jack Cowin's one of franchises in Australia) * Pizza Hut (Another Jack Cowin's one of franchises in Australia) ==References== ==Other websites== *Official site Category:Companies of Australia",
 "title": "Hungry Jack's"
}