{
 "id": "1053250",
 "text": "The 1755 Cape Ann earthquake was an earthquake that took place on November 18, 1755 in the ocean near the British Province of Massachusetts Bay. The highest Mercalli intensity was VIII (Severe). It had a magnitude of about 6.0 to 6.3 on the Richter scale, making it the largest earthquake in Massachusetts. The earthquake did not kill anyone, but it damaged hundreds of buildings in Boston. People felt the shaking as far north as Nova Scotia and as far south as South Carolina.Ballard C. Campbell, ed. American Disasters: 201 Calamities That Shook the Nation (2008) pp 28–30 Even people on the ship over away thought it hit the bottom of the sea. Some people in Boston believed the earthquake was a warning from God, and it made people more religious for a short time. If a similar earthquake happened in Boston today, it could cause up to $5 billion in damage and kill hundreds of people. == Earthquake == The center of the earthquake was probably east of Cape Ann. The earthquake happened on November 18, 1755 at about 4:30 AM local time. John Adams was staying at his father's house in Braintree, Massachusetts. The shaking woke him up. He said the earthquake happened for about four minutes. He wrote that the house made cracking sounds as if it might fall down. People felt the shaking in many places. They felt it as far north as Halifax, Nova Scotia and as far south as Chesapeake Bay and South Carolina. It was even felt in the northwest near Lake George and Lake Champlain. A ship about out at sea felt it too. The people on the ship thought it hit the bottom of the sea. After the quake, there were many aftershocks. The first aftershock came about an hour later, but most of the smaller afterquakes were felt only near the coast and not in Boston. Scientists think the earthquake was about magnitude 6.0 to 6.3, making it the largest earthquake in Massachusetts' history. They do not know exactly why it happened. There are some old faults in the ground in the region, but these faults were not moving at that time. Some people have wondered if a large earthquake in Lisbon, Portugal, a few weeks earlier might have set off the Cape Ann earthquake. But, there is not enough proof to say the Lisbon earthquake caused this one. === Damage === The earthquake broke things in Boston and Cape Ann. In Boston, the earthquake shook land that had been filled in near the harbor. Around 1,300 to 1,600 chimneys in the city were cracked or broken, and some parts of houses fell. Falling chimneys also damaged the roofs of some houses. Several church steeples in Boston were leaning or damaged. The earthquake damaged stone chimneys and buildings in Falmouth (now Portland, Maine); Springfield, Massachusetts; and New Haven, Connecticut. Some stone walls in the countryside broke. People reported that some water wells and springs dried up, and new springs appeared. In Pembroke, Massachusetts, a crack in the ground opened and water and sand came out of it. Most of the damage was to buildings and other structures. People wrote that dishes and glass items were broken. A whiskey maker lost some of its whiskey when a water barrel cracked. === Possible big wave === The Cape Ann earthquake may have caused a big wave. People on islands in the Caribbean, about south of Cape Ann, said that the sea water first moved away from the shore and then came back as a large wave. This wave lifted some boats onto the shore and left fish stranded on the beach. == Legacy == At the time of the earthquake, many people from Massachusetts thought the earthquake was a punishment from God for the bad things people had done. After the earthquake, some towns held special days of prayer and fasting. Many preachers gave sermons or wrote poems about the earthquake as a message from God. But, not everyone agreed that it was a message from God. Some people were influenced by science and looked for natural causes. For example, a Harvard professor named John Winthrop wrote that heat and gas under the Earth's surface might cause earthquakes. John Adams wrote that he was not sure if all disasters were punishments from God. People know that parts of Boston, like Back Bay, are built on soft land that was filled in a long time ago. Soft ground can shake a lot in an earthquake. Many older buildings in Boston are made of brick and stone, which can fall in a large earthquake. A study in 1990 said that if a quake like the 1755 Cape Ann earthquake happened near Boston today, it could cause $4 to $5 billion in damage and kill hundreds of people. Because of this danger, Massachusetts made new building rules. New buildings and additions in danger areas must be built to stay up even in strong shaking. == Related pages == * List of earthquakes * 1755 Lisbon earthquake == References == == More reading == * * Category:Earthquakes in the United States Category:1755 Category:18th century in North America",
 "title": "1755 Cape Ann earthquake"
}