{
 "id": "1053881",
 "text": "Max Caster (born July 31, 1989) is an American professional wrestler and rapper. He currently wrestles for All Elite Wrestling (AEW). He has also appeared in Combat Zone Wrestling (CZW). During his time in AEW, Caster has been a one-time AEW World Tag Team Champion and one-time AEW World Trios Champion. Outside of wrestling, Caster is also a rapper and performs under the name Platinum Max. ==Career== ===All Elite Wrestling=== On the June 23, 2020 episode of Dark, Caster debuted with All Elite Wrestling (AEW). He teamed with Chaos Project (Luther and Serpentico and they lost to Jurassic Express (Jungle Boy, Luchasaurus and Marko Stunt). On the November 27 episode of Dark, Caster teamed with Anthony Bowens in a loss against Best Friends (Chuck Taylor and Trent). On November 3, AEW owner Tony Khan announced that both Caster and Bowens had signed a five-year contract with AEW to wrestle as a tag team and they would call themselves The Acclaimed. At Holiday Bash, The Acclaimed faced the Young Bucks for the AEW World Tag Team Championships but lost. Caster would be suspended for two months after he did a freestyle rap during his entrance with topics such as the mental health of Simone Biles, the scandal of the Duke lacrosse rape hoax, the effectiveness of PCR COVID-19 testing, and a sexual joke about fellow wrestler Julia Hart. Tony Khan called it terrible and said that it should have been edited out. Caster would return to AEW from suspension on September 1. In May 2022, Bowens would confined to a wheelchair because of knee surgery but he still continued to cut promos and be at ringside for Caster's matches. Caster would begin to team with The Gunns (Austin and Colten Gunn) during this time. At Grand Slam, The Acclaimed managed by Billy Gunn and DJ Whoo Kid faced Swerve In Our Glory (Keith Lee and Swerve Strickland) managed by Fabolous. The Acclaimed would defeat them and win the AEW World Tag Team Championship. This was Caster's first championship in AEW. They would lose the title to the Gunns on the February 8, 2023 episode of Dynamite. At All In, The Acclaimed and Billy Gunn would defeated the House of Black (Malakai Black, Brody King, and Buddy Matthews) to win the AEW World Trios Championship. == Personal life == Caster's father is Super Bowl champion and three-time Pro Bowler Rich Caster. == Discography == * Critically Acclaimed, Vol.1 (2021) == Championships and accomplishments == * All Elite Wrestling ** AEW World Tag Team Championship (1 time) – with Anthony Bowens ** AEW World Trios Championship (1 time) - with Anthony Bowens and Billy Gunn * Create A Pro Wrestling ** CAP Championship (2 times) ** CAP Tag Team Championship (1 time) – with Bobby Orlando and Bryce Donovan ** CAP Championship Tournament (2015)cite web|url= https://www.cagematch.net/?id=26&nr;=3802 * National Wrestling League ** NWL Heavyweight Championship (1 time) ** NWL Vista Championship (1 time)cite web|url= https://www.cagematch.net/?id=1&nr;=239333 * New York Post ** Male Breakout Wrestler of the Year (2022) * Pro Wrestling Illustrated ** Ranked No. 171 of the top 500 singles wrestlers in the PWI 500 in 2022 * Wrestling Observer Newsletter ** Most Improved (2022) with Anthony Bowens as The Acclaimed == References == ==Other websites== * Category:1989 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:American rappers Category:Sportspeople from New York (state) Category:People from Rockville Centre, New York",
 "title": "Max Caster"
}