{
 "id": "1054828",
 "text": "The 2021-22 Austrian football championship was the 110th season. It was played by 12 teams.They initially determine the participants in the master and qualification groups in two rounds. The Austrian football champion and the first three representatives of Austria in the international competitions of the 2022/23 season will then be determined in the championship group. ==TV Broadcasts== The TV provider Sky Deutschland GmbH has the rights to show all Bundesliga games in full length. The channel showed all games in conference calls and as individual games. In addition, four games and a highlight program were broadcasted on free TV. ==Mode== Twelve clubs competed against each other in an initial 22 rounds. Each team plays once at home and away against every other team. After that, the best six teams go into the championship group and the remaining six go into the qualification group. The points from the basic round were halved. Half points were rounded down. If two clubs were tied on points at the end of the final round and one of these clubs has had half a point rounded off, that club was ranked first. If neither or both clubs have rounded off, the direct duel was used as the next decision criterion. If there is no decision, the goal difference is the next one. ==Table initial rounds== Pl. Name M W D L P 1\\. FC Red Bull Salzburg 22 17 4 1 55 2\\. SK Sturm Graz 22 10 7 5 37 3\\. Wolfsberger AC 22 11 4 7 37 4\\. FK Austria Wien 22 8 9 5 33 5\\. SK Rapid Wien 22 8 7 7 31 6\\. SK Austria Klagenfurt 22 7 9 6 30 7\\. SV Ried 22 7 8 7 29 8\\. Linzer ASK 22 6 7 9 25 9\\. WSG Tirol 22 5 8 9 23 10\\. TSV Hartberg 22 5 7 10 22 11\\. FC Admira Wacker Mödling 22 4 8 10 20 12\\. SCR Altach 22 3 4 15 13 ÖFB ==Matches == ===Round 1=== Date Team 1 Team2 23 July 2021 SK Sturm Graz FC Red Bull Salzburg 1-3 24 July 2021 SK Rapid Wien TSV Hartberg 0-2 24 July 2021 SCR Altach LASK 0-1 24 July 2021 WSG Tirol FC Admira Wacker Mödling 1-1 25 July 2021 SK Austria Klagenfurt Wolfsberger AC 1-1 25 July 2021 SV Ried FK Austria Wien 2-1 ===Round 2=== Date Team 1 Team2 31 July 2021 FC Admira Wacker Mödling SK Austria Klagenfurt 4-0 31 July 2021 LASK SK Rapid Wien 1-1 31 July 2021 TSV Hartberg SCR Altach 1-2 1 August 2021 FK Austria Wien WSG Tirol 1-1 1 August 2021 FC Red Bull Salzburg SV Ried 7-1 1 August 2021 Wolfsberger AC SK Sturm Graz 1-4 ===Round 3=== Date Team 1 Team2 7 August 2021 SK Austria Klagenfurt TSV Hartberg 4-3 7 August 2021 SV Ried FC Admira Wacker Mödling 2-1 7 August 2021 SK Sturm Graz SCR Altach 3-1 8 August 2021 FC Red Bull Salzburg FK Austria Wien 1-0 8 August 2021 SK Rapid Wien Wolfsberger AC 3-0 8 August 2021 WSG Tirol LASK 1-1 ===Round 4=== Date Team 1 Team2 14 August 2021 FC Admira Wacker Mödling FC Red Bull Salzburg 0-1 14 August 2021 TSV Hartberg SV Ried 1-1 14 August 2021 Wolfsberger AC WSG Tirol 2-2 15 August 2021 FK Austria Wien SK Austria Klagenfurt 1-1 15 August 2021 LASK SK Sturm Graz 1-3 15 August 2021 SCR Altach SK Rapid Wien 2-1 ===Round 5=== Date Team 1 Team2 21 August 2021 FC Red Bull Salzburg SK Austria Klagenfurt 3-1 21 August 2021 WSG Tirol SCR Altach 0-0 21 August 2021 Wolfsberger AC FC Admira Wacker Mödling 3-0 22 August 2021 LASK TSV Hartberg 1-1 22 August 2021 SK Rapid Wien SV Ried 3-0 22 August 2021 SK Sturm Graz FK Austria Wien 2-2 ===Round 6=== Date Team 1 Team2 28 August 2021 SK Austria Klagenfurt WSG Tirol 2-1 28 August 2021 SCR Altach Wolfsberger AC 1-2 28 August 2021 TSV Hartberg FC Red Bull Salzburg 0-1 29 August 2021 FK Austria Wien SK Rapid Wien 1-1 29 August 2021 FC Admira Wacker Mödling SK Sturm Graz 1-1 29 August 2021 SV Ried LASK 1-0 ===Round 7=== Date Team 1 Team2 11 September 2021 SK Rapid Wien FC Admira Wacker Mödling 1-2 11 September 2021 WSG Tirol FC Red Bull Salzburg 1-3 11 September 2021 Wolfsberger AC TSV Hartberg 1-3 12 September 2021 LASK FK Austria Wien 0-2 12 September 2021 SCR Altach SV Ried 1-1 12 September 2021 SK Sturm Graz SK Austria Klagenfurt 2-1 ===Round 8=== Date Team 1 Team2 18 September 2021 FK Austria Wien SCR Altach 0-0 18 September 2021 FC Admira Wacker Mödling TSV Hartberg 1-1 18 September 2021 SV Ried Wolfsberger AC 3-3 19 September 2021 SK Austria Klagenfurt LASK 1-1 19 September 2021 FC Red Bull Salzburg SK Rapid Wien 2-0 19 September 2021 SK Sturm Graz WSG Tirol 5-0 ===Round 9=== Date Team 1 Team2 25 September 2021 SCR Altach SK Austria Klagenfurt 0-4 25 September 2021 WSG Tirol SV Ried 4-2 25 September 2021 Wolfsberger AC FC Red Bull Salzburg 0-2 26 September 2021 LASK FC Admira Wacker Mödling 3-1 26 September 2021 SK Rapid Wien SK Sturm Graz 0-3 26 September 2021 TSV Hartberg FK Austria Wien 3-4 ===Round 10=== Date Team 1 Team2 2 October 2021 FC Admira Wacker Mödling SCR Altach 2-0 2 October 2021 SV Ried SK Austria Klagenfurt 1-1 2 October 2021 Wolfsberger AC FK Austria Wien 1-0 3 October 2021 FC Red Bull Salzburg LASK 3-1 3 October 2021 SK Rapid Wien WSG Tirol 5-2 3 October 2021 TSV Hartberg SK Sturm Graz 3-2 ===Round 11=== Date Team 1 Team2 16 October 2021 SK Austria Klagenfurt SK Rapid Wien 1-1 16 October 2021 FK Austria Wien FC Admira Wacker Mödling 2-2 16 October 2021 SCR Altach FC Red Bull Salzburg 1-1 17 October 2021 LASK Wolfsberger AC 0-1 17 October 2021 SK Sturm Graz SV Ried 1-0 17 October 2021 WSG Tirol TSV Hartberg 2-2 ===Round 12=== Date Team 1 Team2 23 October 2021 FK Austria Wien SV Ried 4-1 23 October 2021 FC Admira Wacker Mödling WSG Tirol 0-1 23 October 2021 Wolfsberger AC SK Austria Klagenfurt 2-1 24 October 2021 FC Red Bull Salzburg SK Sturm Graz 4-1 24 October 2021 LASK SCR Altach 0-1 24 October 2021 TSV Hartberg SK Rapid Wien 1-1 ===Round 13=== Date Team 1 Team2 30 October 2021 SK Austria Klagenfurt FC Admira Wacker Mödling 3-3 30 October 2021 SCR Altach TSV Hartberg 0-2 30 October 2021 SV Ried FC Red Bull Salzburg 2-2 31 October 2021 SK Rapid Wien LASK 3-2 31 October 2021 SK Sturm Graz Wolfsberger AC 0-3 31 October 2021 WSG Tirol FK Austria Wien 1-1 ===Round 14=== Date Team 1 Team2 6 November 2021 FK Austria Wien FC Red Bull Salzburg 0-1 6 November 2021 FC Admira Wacker Mödling SV Ried 1-2 6 November 2021 TSV Hartberg SK Austria Klagenfurt 0-2 7 November 2021 LASK WSG Tirol 3-0 7 November 2021 Wolfsberger AC SK Rapid Wien 4-1 7 November 2021 SCR Altach SK Sturm Graz 0-1 ===Round 15=== Date Team 1 Team2 20 November 2021 FC Red Bull Salzburg FC Admira Wacker Mödling 0-0 20 November 2021 SK Rapid Wien SCR Altach 1-0 20 November 2021 SV Ried TSV Hartberg 1-2 21 November 2021 SK Austria Klagenfurt FK Austria Wien 0-0 21 November 2021 SK Sturm Graz LASK 3-3 21 November 2021 WSG Tirol Wolfsberger AC 5-1 ===Round 16=== Date Team 1 Team2 27 November 2021 SK Austria Klagenfurt FC Red Bull Salzburg 2-1 27 November 2021 FC Admira Wacker Mödling Wolfsberger AC 0-1 27 November 2021 SCR Altach WSG Tirol 0-3 28 November 2021 FK Austria Wien SK Sturm Graz 2-1 28 November 2021 SV Ried SK Rapid Wien 2-2 28 November 2021 TSV Hartberg LASK 2-1 ===Round 17=== Date Team 1 Team2 4 December 2021 FC Red Bull Salzburg TSV Hartberg 2-1 4 December 2021 SK Sturm Graz FC Admira Wacker Mödling 1-1 4 December 2021 WSG Tirol SK Austria Klagenfurt 0-1 5 December 2021 SK Rapid Wien FK Austria Wien 1-1 5 December 2021 LASK SV Ried 1-0 5 December 2021 Wolfsberger AC SCR Altach 3-0 ===Round 18=== Date Team 1 Team2 11 December 2021 FC Red Bull Salzburg WSG Tirol 5-0 11 December 2021 SV Ried SCR Altach 2-1 11 December 2021 TSV Hartberg Wolfsberger AC 2-2 12 December 2021 SK Austria Klagenfurt SK Sturm Graz 0-3 12 December 2021 FK Austria Wien LASK 2-3 12 December 2021 FC Admira Wacker Mödling SK Rapid Wien 1-2 ===Round 19=== Date Team 1 Team2 11 February 2022 SK Rapid Wien FC Red Bull Salzburg 1-2 12 February 2022 SCR Altach FK Austria Wien 0-2 12 February 2022 WSG Tirol SK Sturm Graz 2-2 12 February 2022 Wolfsberger AC SV Ried 2-1 13 February 2022 LASK SK Austria Klagenfurt 2-2 13 February 2022 TSV Hartberg FC Admira Wacker Mödling 1-1 ===Round 20=== Date Team 1 Team2 19 February 2022 FK Austria Wien TSV Hartberg 2-0 19 February 2022 FC Admira Wacker Mödling LASK 0-3 19 February 2022 SV Ried WSG Tirol 3-2 20 February 2022 SK Austria Klagenfurt SCR Altach 3-0 20 February 2022 FC Red Bull Salzburg Wolfsberger AC 2-0 20 February 2022 SK Sturm Graz SK Rapid Wien 2-2 ===Round 21=== Date Team 1 Team2 26 February 2022 SCR Altach FC Admira Wacker Mödling 0-2 27 February 2022 SK Austria Klagenfurt SV Ried 1-1 27 February 2022 FK Austria Wien Wolfsberger AC 1-0 27 February 2022 SK Sturm Graz TSV Hartberg 3-0 27 February 2022 WSG Tirol SK Rapid Wien 0-2 2 March 2022 LASK FC Red Bull Salzburg 0-0 ===Round 22=== Date Team 1 Team2 5 March 2022 FC Red Bull Salzburg SCR Altach 4-0 6 March 2022 FC Admira Wacker Mödling FK Austria Wien 1-2 6 March 2022 SK Rapid Wien SK Austria Klagenfurt 3-0 6 March 2022 SV Ried SK Sturm Graz 2-2 6 March 2022 TSV Hartberg WSG Tirol 0-1 6 March 2022 Wolfsberger AC LASK 1-0 Austria Soccer ==Champions group table== Pl. Name M W D L P 1\\. FC Red Bull Salzburg 32 25 5 2 52 2\\. SK Sturm Graz 32 16 8 8 37 3\\. FK Austria Wien 32 11 13 8 29 4\\. Wolfsberger AC 32 14 5 13 28 5\\. SK Rapid Wien 32 10 11 11 25 6\\. SK Austria Klagenfurt 32 8 12 12 21 ==Matches == ===Round 23=== Date Team 1 Team2 13 March 2022 SK Austria Klagenfurt SK Rapid Wien 1-3 13 March 2022 FK Austria Wien Wolfsberger AC 2-1 13 March 2022 FC Red Bull Salzburg SK Sturm Graz 1-0 ===Round 24=== Date Team 1 Team2 20 March 2022 FK Austria Wien SK Rapid Wien 1-1 20 March 2022 SK Sturm Graz SK Austria Klagenfurt 3-1 20 March 2022 Wolfsberger AC FC Red Bull Salzburg 1-4 ===Round 25=== Date Team 1 Team2 3 April 2022 FK Austria Wien SK Austria Klagenfurt 1-1 3 April 2022 FC Red Bull Salzburg SK Rapid Wien 2-1 3 April 2022 Wolfsberger AC SK Sturm Graz 0-2 ===Round 26=== Date Team 1 Team2 10 April 2022 SK Austria Klagenfurt FC Red Bull Salzburg 0-6 10 April 2022 SK Rapid Wien Wolfsberger AC 2-1 10 April 2022 SK Sturm Graz FK Austria Wien 1-0 ===Round 27=== Date Team 1 Team2 17 April 2022 FK Austria Wien FC Red Bull Salzburg 1-2 17 April 2022 SK Sturm Graz SK Rapid Wien 2-1 17 April 2022 Wolfsberger AC SK Austria Klagenfurt 1-2 ===Round 28=== Date Team 1 Team2 24 April 2022 SK Austria Klagenfurt Wolfsberger AC 2-3 24 April 2022 FC Red Bull Salzburg FK Austria Wien 5-0 24 April 2022 SK Rapid Wien SK Sturm Graz 1-1 ===Round 29=== Date Team 1 Team2 27 April 2022 SK Rapid Wien SK Austria Klagenfurt 2-2 27 April 2022 SK Sturm Graz FC Red Bull Salzburg 2-1 27 April 2022 Wolfsberger AC FK Austria Wien 1-1 ===Round 30=== Date Team 1 Team2 8 May 2022 SK Austria Klagenfurt SK Sturm Graz 1-2 8 May 2022 FK Austria Wien SK Rapid Wien 1-1 8 May 2022 FC Red Bull Salzburg Wolfsberger AC 5-0 ===Round 31=== Date Team 1 Team2 15 May 2022 SK Austria Klagenfurt FK Austria Wien 1-2 15 May 2022 SK Rapid Wien FC Red Bull Salzburg 0-1 15 May 2022 SK Sturm Graz Wolfsberger AC 0-4 ===Round 32=== Date Team 1 Team2 21 May 2022 FK Austria Wien SK Sturm Graz 4-2 21 May 2022 FC Red Bull Salzburg SK Austria Klagenfurt 1-1 21 May 2022 Wolfsberger AC SK Rapid Wien 2-1 ==Qualification group table== Pl. Name M W D L P 7\\. WSG Tirol 32 10 10 12 28 8\\. LASK 32 9 12 11 26 9\\. SCR Altach 32 7 8 17 22 10\\. SV Ried 32 8 13 11 22 11\\. TSV Hartberg 32 7 12 13 22 12\\. FC Admira Wacker Mödling 32 6 13 13 21 Bundesliga.at ==Matches == ===Round 23=== Date Team 1 Team2 12 March 2022 FC Admira Wacker Mödling SV Ried 2-0 12 March 2022 SCR Altach TSV Hartberg 0-0 13 March 2022 LASK WSG Tirol 6-0 ===Round 24=== Date Team 1 Team2 19 March 2022 SV Ried SCR Altach 1-2 19 March 2022 WSG Tirol FC Admira Wacker Mödling 0-0 20 March 2022 TSV Hartberg LASK 0-0 ===Round 25=== Date Team 1 Team2 2 April 2022 LASK SV Ried 0-2 2 April 2022 SCR Altach FC Admira Wacker Mödling 2-2 2 April 2022 TSV Hartberg WSG Tirol 0-1 ===Round 26=== Date Team 1 Team2 9 April 2022 FC Admira Wacker Mödling LASK 1-1 9 April 2022 SV Ried TSV Hartberg 0-0 9 April 2022 WSG Tirol SCR Altach 0-3 ===Round 27=== Date Team 1 Team2 16 April 2022 SCR Altach LASK 0-0 16 April 2022 SV Ried WSG Tirol 2-3 16 April 2022 TSV Hartberg FC Admira Wacker Mödling 1-2 ===Round 28=== Date Team 1 Team2 23 April 2022 FC Admira Wacker Mödling TSV Hartberg 1-3 23 April 2022 LASK SCR Altach 2-1 23 April 2022 WSG Tirol SV Ried 2-0 ===Round 29=== Date Team 1 Team2 26 April 2022 SV Ried FC Admira Wacker Mödling 1-1 26 April 2022 TSV Hartberg SCR Altach 4-0 26 April 2022 WSG Tirol LASK 4-0 ===Round 30=== Date Team 1 Team2 7 May 2022 FC Admira Wacker Mödling WSG Tirol 1-1 7 May 2022 LASK TSV Hartberg 3-3 7 May 2022 SCR Altach SV Ried 1-1 ===Round 31=== Date Team 1 Team2 14 May 2022 FC Admira Wacker Mödling SCR Altach 0-3 14 May 2022 SV Ried LASK 1-1 14 May 2022 WSG Tirol TSV Hartberg 4-2 ===Round 32=== Date Team 1 Team2 20 May 2022 LASK FC Admira Wacker Mödling 3-1 20 May 2022 SCR Altach WSG Tirol 2-1 20 May 2022 TSV Hartberg SV Ried 1-1 ==Champion squad == FC Red Bull Salzburg * Goalkeepers:33 Alexander Walke, 23Nico Mantl, 18 Philipp Köhn * Defenders: 2 Ignace Van der Brempt, 3 Bryan Okoh, 95 Bernardo, 17 Andreas Ulmer, 43 Rasmus Kristensen, 5 Albert Vallci, 39 Maximilian Wöber, 22 Oumar Solet,4 Kamil Piatkowski, 29 Kilian Ludewig, 37 Daouda Guindo * Midfielders: 6 Mamady Diambou, 14 Maurits Kjaergaard, 16 Zlatko Junuzovic, 21 Luka Sucic 10 Antoine Bernede, 19 Mohamed Camara, 77 Noah Okafor, 13 Nicolas Seiwald, 11 Brenden Aaronson * Forwards: 7 Sekou Koita, 27 Karim Adeyemi, 9 Junior Adamu, 30 Benjamin Sesko * Coaching staff: Matthias Jaissle (Headcoach), Florens Koch, Alexander Hauser, (Assistance coaches), Herbert Ilsanker (Goalkeeper coach) ==Top scorer== Name Club Goals Karim Adeyemi FC Red Bull Salzburg 19 Giacomo Vrioni WSG Tirol 17 Jakob Jantscher SK Sturm Graz 14 The scorers are shown after 32 rounds. The Bundesliga counts the goalscorers added to these goals in the Conference League Play-Off. According to the Bundesliga calculation, Vrioni (2 goals in the Conference League Play-Off) and Adeyemi each scored 19 goals - and were equally top scorers. Austria Soccer ==Promotion== SC Austria Lustenau ==References== Category:Football in Austria Category:Football seasons Category:2021–22 in European football Category:2020-21 association football seasons",
 "title": "2021-22 Austrian football championship"
}