{
 "id": "1054794",
 "text": "Frank Benedict Gerdelman (born August 4, 1977) is an American professional wrestler. He currently wrestles for Impact Wrestling and competes under the ring name Frankie Kazarian. He is also known for his time wrestling in Pro Wrestling Guerrilla (PWG), Ring of Honor (ROH), Total Nonstop Action Wrestling (TNA), and All Elite Wrestling (AEW). He was known for his team with Christopher Daniels and Scorpio Sky called Bad Influence (later SoCal Uncensored) . During his time in Total Nonstop Action Wrestling/Impact Wrestling, Kazarian has been a five-time TNA/Impact X Division Champion and three-time TNA World Tag Team Champion. ==Career== ===All Elite Wrestling=== On January 8, 2019, Kazarian signed a contract with All Elite Wrestling (AEW). Kazarian would enter a tournament along with Scorpio Sky to crown the first AEW World Tag Team Champions. Sky replaced Kazarian's original partner Christopher Daniels after Daniels was attacked by the Lucha Brothers before a match. They would defeat Best Friends (Trent? and Chuck Taylor) on the October 16 episode of Dynamite and The Dark Order (Evil Uno and Stu Grayson) on the October 23 episode of Dynamite. On the October 30 episode of Dynamite, Kazarian and Sky would defeat the Lucha Brothers (Pentagón Jr. and Fénix) in the finals to become the first AEW World Tag Team Champions. This was Kazarian's first championship in AEW. They would lose the tag titles to Kenny Omega and \"Hangman\" Adam Page at Chris Jericho's Rock 'N' Wrestling Rager at Sea Part Deux: Second Wave. Sky would leave the team to focus more on singles matches after the loss. Kazarian would go back to teaming with Daniels afterwards. He would team with Sky again for one night when they face FTR (Dax Harwood and Cash Wheeler) for the AEW World Tag Team Championships on the September 30 episode of Dynamite but lost. When teaming with Daniels, Kazarian would cut a promo and say that the tag team would break up the next time that they lost. They would earn a shot at AEW World Tag Team Championships but they ended up losing to The Young Bucks on the May 12 episode of Dynamite and had to split up as a tag team. At the Impact Wrestling pay-per-view Hard To Kill, Kazarian cut a promo and said that he asked to be released from his contract with AEW and wanted to return to Impact Wrestling. On December 26, 2022, Kazarian had his last match in AEW. He faced Konosuke Takeshita and lost. ===Impact Wrestling=== On July 29, 2021, Kazarian would make his return to Impact Wrestling, having originally worked there when it was called Total Nonstop Action Wrestling (TNA). == References == == Other websites == *Impact Wrestling profile * Category:1977 births Category:Living people Category:American professional wrestlers Category:People from Palm Springs, California Category:Sportspeople from California Category:All Elite Wrestling alumni",
 "title": "Frankie Kazarian"
}