{
 "id": "1054184",
 "text": "Daniel Marshall Wheeler (born May 17, 1987) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and competes under the ring name Cash Wheeler. He is one-half of the tag team FTR with Dax Harwood and is a former two-time AEW World Tag Team Champion with him. He is also known for his time wrestling in WWE where he wrestled under the ring name Dash Wilder. In WWE, he and Harwood (then known as Scott Dawson) have been two-time Raw Tag Team Champions, one-time SmackDown Tag Team Champions, two- time NXT Tag Team Champions, and one-time WWE 24/7 Champions. They have also wrestled for Lucha Libre AAA Worldwide (AAA), New Japan Pro-Wrestling (NJPW), Ring of Honor (ROH). In those promotions, they have been one-time AAA World Tag Team Champions, one-time IWGP Tag Team Champions, and one-time ROH World Tag Team Champions. == Career == === WWE (2014-2020) === In 2014, Wheeler signed a developmental contract with WWE and was given the ring name Dash Wilder. He formed a tag team with Scott Dawson known as The Mechanics and later \"Dash and Dawson\". On October 22, 2015, they won the NXT Tag Team Championship from The Vaudevillains (Aiden English and Simon Gotch). In 2016 they were renamed The Revival. At NXT TakeOver: Dallas on April 1 they lost the title to American Alpha (Chad Gable and Jason Jordan), but won it back from them on June 8 at NXT TakeOver: The End, becoming the first ever two-time NXT Tag Team Champions. On November 19, 2016 at NXT TakeOver: Toronto, they lost the titles to #DIY (Johnny Gargano and Tommaso Ciampa). On the April 3, 2017 episode of Raw, The Revival made their debut on WWE's main roster with a victory over The New Day (Big E and Xavier Woods). On the February 11, 2019 edition of Raw, Dawson and Wilder won the Raw Tag Team Championship for the first time from Bobby Roode and Chad Gable. They dropped the title to Curt Hawkins and Zack Ryder at WrestleMania 35 on April 7, this also broke Hawkins' long losing streak. On June 10, The Revival won the titles back but lost them to The O.C. (Karl Anderson and Luke Gallows) on the July 29 edition of Raw. On August 12, 2019 both members of The Revival pinned R-Truth at the same time to become the only co-champions of the 24/7 Championship. Moments later, R-Truth pinned Dawson, with the help of Carmella, and regained the title. At Clash of Champions on September 15, The Revival won the SmackDown Tag Team Championship from The New Day (Big E and Xavier Woods). On the November 8 edition of SmackDown, they lost the titles to The New Day (Big E and Kofi Kingston). On April 10, 2020, Dawson and Wilder were both released from WWE. During an interview in November 2020, both Harwood and Wheeler said that they were offered a lot of money to stay with WWE. However, they wanted to join AEW because they were tired of being taken off of the main roster cards. Wheeler would say in the interview: \"Once we got pulled from all of our dates on the main roster, it was down to NXT as the option and we talked to Hunter at length, there were offers on the table that were very tempting because we loved NXT and we loved our time there, but at the end of the day like Dax said, we knew that our time there was done.\" === All Elite Wrestling (2020-present) === On the May 27, 2020 at Dynamite, Wheelr and Harwood, under the team name FTR made their debut with All Elite Wrestling (AEW). They drove into the amphitheater in a pickup truck, entered the ring and attacked The Butcher and The Blade. On the June 10 episode of Dynamite, they had their first official in-ring match in AEW. They defeated The Butcher and The Blade. On the August 22 episode of Dynamite Tully Blanchard was introduced as FTR's Manager. At All Out on September 5 Harwood and Wheeler won the AEW World Tag Team Championship from Adam Page and Kenny Omega. This made them the first team to become tag team champions in WWE and AEW. On November 7 at Full Gear they lost the titles to The Young Bucks. On October 6, 2021, FTR defeated the Lucha Brothers (Pentagón Jr. and Fénix) to win the AAA World Tag Team Championship. At Ring of Honor's Supercard of Honor XV on April 1, 2022 they won the ROH World Tag Team Championship. On June 26 they became triple champions by winning New Japan Pro Wrestling's IWGP Tag Team Championship. In December 2022 they lost both the ROH and AAA titles, followed by the IWGP titles on January 4, 2023. On April 25 they won the AEW Tag Team Championship a second time, defeating The Gunns (Austin and Colten Gunn) in a Title vs. Career match. On the October 7 episode of Collision they dropped the titles to Ricky Starks and Big Bill. == Personal life == On August 18, 2023, a warrant was issued for the arrest of Wheeler. He would be charged with one count of aggravated assault with a firearm. He was released on $2,500 bond and was allowed to travel to London for the All In pay-per-view. == Championships and accomplishments == * All Elite Wrestling ** AEW World Tag Team Championship (2 times) – with Dax Harwood * Anarchy Wrestling ** NWA Anarchy Tag Team Championship (2 times) – with Derrick Driver ** NWA Anarchy Television Championship (1 time) * The Baltimore Sun ** WWE Tag Team of the Year (2016) – with Scott Dawson * ESPN ** Tag Team of the Year (2023 – with Dax Harwood) * Lucha Libre AAA Worldwide ** AAA World Tag Team Championship (1 time) – with Dax Harwood * New Japan Pro Wrestling ** IWGP Tag Team Championship (1 time) - with Dax Harwood * Pro Wrestling Illustrated ** Tag Team of the Year (2022) ** Ranked No. 98 of the top 500 singles wrestlers in the PWI 500 in 2019 ** Ranked No. 1 of the top 50 tag teams in the PWI Tag Team 50 in 2020 * Ring of Honor ** ROH World Tag Team Championship (1 time) - with Dax Harwood * Sports Illustrated ** Ranked No. 9 of the top 10 wrestlers in 2022 * WrestleForce ** WrestleForce Tag Team Championship (1 time) – with John Skyler * WWE ** WWE 24/7 Championship (1 time) – with Scott Dawson ** WWE Raw Tag Team Championship (2 times) – with Scott Dawson ** WWE SmackDown Tag Team Championship (1 time) – with Scott Dawson ** NXT Tag Team Championship (2 times) – with Scott Dawson ** First WWE Tag Team Triple Crown Champions – with Scott Dawson ** NXT Year-End Award (2 times) *** Match of the Year (2016) – with Scott Dawson vs. #DIY (Johnny Gargano and Tommaso Ciampa) in a two-out- of-three falls match for the NXT Tag Team Championship at NXT TakeOver: Toronto *** Tag Team of the Year (2016) – with Scott Dawson * Wrestling Observer Newsletter ** Feud of the Year (2022) ** Tag Team of the Year (2022, 2023) == Footnotes == == References == == Other websites == * * Category:1987 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from Raleigh, North Carolina",
 "title": "Cash Wheeler"
}