{
 "id": "1054757",
 "text": "Thelma Rogers (24 June 1924 – 13 January 2000) was an English actress. She was best known as the voice of Peggy Archer on the BBC Radio 4 radio soap opera The Archers between 1953 and 1962. == Early life == Thelma Rogers was born and raised in Coventry. Her father, Edwin Moody Rogers, was the Lord Mayor of Coventry from 1966 to 1967. Rogers studied for two years in Cambridge to become a teacher. She later dropped her teaching studies and joined the Leicester Repertory Company, studying acting, for four years. == Career == Rogers began her career in April 1953, when she joined the cast of the BBC Radio 4 radio soap opera The Archers, taking over the role of Margaret \"Peggy\" Archer from June Spencer. She was spotted in the early 1950s by Tony Shryane, the first producer. She left the serial in 1962 and Spencer returned to her former position as Peggy. Rogers made her debut as the voice of Elsie Catcher, a schoolteacher. Rogers worked the stage after her departure from The Archers. She later joined the Perth Repertory Company. She took a prominent role while in Scotland, Lily Taylor in the ITV soap opera Take the High Road. Rogers other television credits include Crossroads and Coronation Street. == Personal life == Rogers hated the name Thelma until someone pointed out that it was an anagram of Hamlet. === Death === Rogers died in London, England on 13 January 2000. She was 75. == Filmography == === Radio === Year Title Role Notes Ref. 1953–1962 The Archers Peggy Archer Series regular; 438+ episodes 1954–1962 Guilty Party Various 19 episodes 1956–1961 Children's Hour Various 28 episodes 1956 Tickets, Please Rosa 1 episode Fresh as Paint Valerie Gibbs 1 episode The Claverdon Road Job Woman 1 episode 1958 Tollworth in the Evening Betty Manton 1 episode A Blessing in Disguise Maisie Edge 1 episode Mind Your Own Business Jill 1 episode Appeal: Cleeve Prior Church Herself 1 episode 1959 The Voyage of the Wanti Se Hilda Chapman 1 episode A Member of the Family Kath 1 episode The Boys of Summer Pam Willis 2 episodes 1960 Prelude to Finale Caroline Unger 1 episode Brief is the Hour Mrs. Rostrevor 1 episode 1963 The Mystery of the Man Next Door Mary Schofield 4 episodes The Bed-Makers Con 1 episode 1969 The Mayor of Casterbridge 1 episode 1987 News and Vintage Archers Peggy Archer 1 episode == References == Category:1924 births Category:2000 deaths Category:English radio actors Category:English movie actors Category:English stage actors Category:English television actors",
 "title": "Thelma Rogers"
}