{
 "id": "1054203",
 "text": "Matthew Ronjon Massie (born March 13, 1985) and Nicholas Lee Massie (born July 28, 1989) are American professional wrestlers. They wrestle together in a tag team called The Young Bucks under the ring names Matthew and Nicholas Jackson (previously Matt and Nick Jackson). They compete for All Elite Wrestling (AEW). Besides wrestling, they are also executive vice presidents of AEW. The Bucks have wrestled in many different promotions and have won many different championships. They have wrestled in Pro Wrestling Guerrilla (PWG), Chikara, Ring of Honor (ROH), Total Nonstop Action Wrestling (TNA), and New Japan Pro- Wrestling (NJPW). During their time in AEW, The Bucks have been three-time AEW World Tag Team Champions, the most reigns for these titles. They and Kenny Omega are also two-time AEW World Trios Champions and the first men to win these titles. ==Career== ===All Elite Wrestling=== On January 1, 2019 episode of their YouTube show Being the Elite, The Bucks announced the creation of the professional wrestling promotion All Elite Wrestling (AEW). The Bucks, along with Cody, announced that they had signed a five-year contract with the company on January 2, 2019. At Double or Nothing, the Bucks made their AEW in- ring debut. They defeated the Lucha Brothers (Pentagón Jr. and Fénix) to successfully defend their AAA World Tag Team Championships and get their first victory in AEW. They lost the titles to the Lucha Brothers in a rematch at All Out. At Full Gear on November 7, 2020, the Bucks defeated FTR (Dax Harwood and Cash Wheeler) to win the AEW World Tag Team Championships. This was their first championships in AEW. On the April 7 episode of Dynamite, after months of being berated by Don Callis and questions about wether they would join Kenny Omega, the Bucks eventually joined Omega and turn heel. At All Out on September 5, 2021, the Bucks lost the titles to the Lucha Brothers in a steel cage match. Both Dave Meltzer and Bryan Alvarez said that their match was the best cage match that they had ever seen, and that it was one of the best AEW matches in the company's history. Meltzer rated the match 5.75 stars. At Road Rager on June 15, 2022, the Bucks won the AEW World Tag Team Championships again when they defeated Jurassic Express (Jungle Boy and Luchasaurus) in a ladder match. On July 13, during Night 1 of Fyter Fest, the Bucks lost the titles to Swerve in Our Glory (Swerve Strickland and Keith Lee) in a Triple or Nothing match that also featured Team Taz (Ricky Starks and Powerhouse Hobbs). On the August 17 episode of Dynamite, the Bucks revealed their mystery partner for the tournament to crown the first AEW World Trios Champions. Their partner was revealed to be Kenny Omega, who returned after a long time away while healing from injuries. They won the championships against Adam Page and The Dark Order (Alex Reynolds, and John Silver) at All Out. However, they were later suspended and stripped of them because of a real-life backstage fight that took place between Omega, the Young Bucks, CM Punk, and Ace Steel. The Young Bucks and Omega returned from their suspension on November 19, 2022 and faced Death Triangle at Full Gear but lost. When they were feuding with the Blackpool Combat Club, the Bucks and Omega said that they had a mystery partner to join them for their fight at Blood & Guts. On the July 13 episode of Dynamite, the partner was revealed to be Kota Ibushi. They defeated the Blackpool Combat Club, Konosuke Takeshita, and Pac. In January 2024, they confronted Sting and Darby Allin, setting up Sting's retirement match for Revolution. They then became heels again and changed their individual ring names to Matthew and Nicholas Jackson. On March 3 at Revolution, they were defeated by Sting and Allin, who then vacated the titles. On April 21 at Dynasty, the Bucks won the vacant title for a record third time by defeating FTR in a ladder match, which was a tournament final. ==Personal life== Both Matthew and Nicholas are Christians. == Championships and accomplishments == * All Elite Wrestling ** AEW World Tag Team Championship (3 times) ** AEW World Trios Championship (2 times, first) – with Kenny Omega ** AEW World Trios Championship Tournament (2022) – with Kenny Omega ** Casino Tag Team Royale (2022) ** Dynamite Award (3 times) *** LOL Award (2021) – *** Bleacher Report PPV Moment of the Year (2021) – *** Best Tag Team Brawl (2022) – * Alternative Wrestling Show ** AWS Tag Team Championship (1 time) * Chikara ** Campeonatos de Parejas (1 time) * DDT Pro-Wrestling ** Ironman Heavymetalweight Championship (1 time) * Demand Lucha ** Royal Canadian Tag Team Championship (1 time) * Dragon Gate USA ** Open the United Gate Championship (1 time) * Empire Wrestling Federation ** EWF Tag Team Championship (1 time) * Family Wrestling Entertainment ** FWE Tag Team Championship (1 time, last) * Future Stars of Wrestling ** FSW Tag Team Championship (1 time) * High Risk Wrestling ** HRW Heavyweight Championship (2 times) – Matt Jackson (1) and Nick Jackson (2) ** HRW Tag Team Championship (1 time) ** Sole Survivor Tournament (2006) – Nick Jackson * House of Glory ** HOG Tag Team Championship (1 time) ** HOG Tag Team Championship Tournament (2013) * Insane Wrestling League ** IWL Tag Team Championship (3 times) * Lucha Libre AAA Worldwide ** AAA World Tag Team Championship (1 time) * New Japan Pro-Wrestling ** IWGP Junior Heavyweight Tag Team Championship (7 times) ** IWGP Tag Team Championship (1 time) ** NEVER Openweight 6-Man Tag Team Championship (3 times) – with Kenny Omega (2) and Marty Scurll (1) ** Super Jr. Tag Tournament (2013) * Pro Wrestling Destination ** PWD Tag Team Championship (1 time) * Pro Wrestling Guerrilla ** PWG World Tag Team Championship (4 times) ** Dynamite Duumvirate Tag Team Title Tournament (2009, 2011, 2013) * Pro Wrestling Illustrated ** Match of the Year (2020) ** Tag Team of the Year (2017, 2018, 2021) ** Ranked Nick Jackson No. 38 of the top 500 singles wrestlers in the PWI 500 in 2018 ** Ranked Matt Jackson No. 40 of the top 500 singles wrestlers in the PWI 500 in 2018 ** Ranked The Young Bucks No. 1 of the top 50 Tag Teams in the PWI Tag Team 50 in 2021 * Pro Wrestling LIVE ** PWL Tag Team Championship (1 time) * Ring of Honor ** ROH World Six-Man Tag Team Championship (3 times) – with Adam Page (2) and Cody (1) ** ROH World Tag Team Championship (3 times) ** ROH Year-End Award (1 time) *** Tag Team of the Year (2017) * SoCal Uncensored ** Southern California Match of the Year (2011) ** Southern California Match of the Year (2012) ** Southern California Match of the Year (2013) ** Southern California Match of the Year (2016) ** Southern California Match of the Year (2018) ** Southern California Tag Team of the Year (2007–2009, 2014–2015) * Squared Circle Wrestling (Syracuse, New York) ** 2CW Tag Team Championship (1 time, last) * World Series Wrestling ** WSW Tag Team Championship (1 time) ** WSW Tag Team Title Tournament (2018) * Wrestling Observer Newsletter ** Best Wrestling Maneuver (2009) ** Best Wrestling Maneuver (2014) ** Tag Team of the Year (2014–2018, 2020, 2021) ** Pro Wrestling Match of the Year (2020) ** Pro Wrestling Match of the Year (2021) ** Best Pro Wrestling Book (2020) ** Tag Team of the Decade (2010s) == References == ==Other websites== *Official YouTube channel * Category:1985 births Category:1989 births Category:Living people Category:All Elite Wrestling executives Category:All Elite Wrestling people Category:All Elite Wrestling teams and stables Category:American professional wrestlers Category:American YouTubers Category:American Christians Category:New Japan Pro-Wrestling teams and stables Category:Ring of Honor teams and stables Category:Sibling duos Category:Sportspeople from California Category:Total Nonstop Action Wrestling alumni",
 "title": "The Young Bucks"
}