{
 "id": "1054777",
 "text": "Schuyler Andrews (born April 2, 1983) is an American professional wrestler and mixed martial artist. He currently wrestles for All Elite Wrestling (AEW) and competes under the ring name Scorpio Sky. He is also known for his time wrestling in Pro Wrestling Guerrilla (PWG), Ring of Honor (ROH), Total Nonstop Action Wrestling (TNA), and New Japan Pro-Wrestling (NJPW). He also appeared in the WWE as Harold during a couple of segments with Daniel Bryan and Kane. During his time in AEW, Sky has been a two-time AEW TNT Champion and a one- time and first AEW World Tag Team Champion. Outside of wrestling, Sky is also a mixed martial artist and has a record of 2-1. ==Career== ===All Elite Wrestling=== On January 8, 2019, Sky signed a contract with All Elite Wrestling (AEW). Sky would enter a tournament along with Frankie Kazarian to crown the first AEW World Tag Team Champions. Sky would replace Christopher Daniels as Kazarian's partner after Daniels was attacked by the Lucha Brothers before a match. They would defeat Best Friends (Trent? and Chuck Taylor) on the October 16 episode of Dynamite and The Dark Order (Evil Uno and Stu Grayson) on the October 23 episode of Dynamite. On the October 30 episode of Dynamite, Sky and Kazarian would defeat the Lucha Brothers (Pentagón Jr. and Fénix) in the finals to become the first AEW World Tag Team Champions. This was Sky's first championship in AEW and he became the first African-American champion in the history of AEW. During a successful defense against the Inner Circle, Scorpio would pin Jericho and earn a shot at his AEW World Championship. Scorpio faced Jericho for the championship on the November 27 episode of Dynamite but lost. They would lose the tag titles to Kenny Omega and \"Hangman\" Adam Page at Chris Jericho's Rock 'N' Wrestling Rager at Sea Part Deux: Second Wave. Sky would leave the team to focus more on singles matches after the loss. At Revolution, Sky wrestled in the Face of the Revolution ladder match. He would win and with it, wona shot at the AEW TNT Championship. On the March 10, 2021 episode of Dynamite, he faced Darby Allin for the TNT Championship but lost. After the loss, Sky attacked Allin and turned heel. He would then join a team with Ethan Page called Men of the Year. The two would later join Dan Lambert and American Top Team. On the March 9, 2022 episode of Dynamite, Sky would defeat Sammy Guevara and win the AEW TNT Championship. This was Sky's first singles title in AEW. He would lose the title back to Guevara at Battle of the Belts II but won it back two weeks later on the April 27 episode of Dynamite. Sky would lose the title to Wardlow on the July 6 episode of Dynamite. == References == Category:1983 births Category:Living people Category:All Elite Wrestling people Category:American mixed martial artists Category:American professional wrestlers Category:Sportspeople from Los Angeles",
 "title": "Scorpio Sky"
}