{
 "id": "1054551",
 "text": "On 7 October 2023, during the Re'im music festival massacre, Shani Nicole Louk (7 February 2001 – 7 October 2023) a tattoo artist and influencer from Germany and Israel, was kidnapped. ==Early life== Louk and her family moved to Portland, Oregon in the early 2000s. She attended kindergarten at Portland Jewish Academy. She eventually moved to Tel Aviv. ==Re'im music festival massacre== On 7 October 2023, during the early stages of the 2023 Israel–Hamas conflict, a group of Hamas terrorists entered Israel from the Gaza Strip and attacked the Supernova Sukkot Gathering music festival. This festival celebrated the Jewish holiday of Sukkot and featured psychedelic trance music. It was held in the western Negev desert, near the Re'im kibbutz, about 5 kilometers from the Gaza–Israel barrier. Shani Nicole Louk, a festival attendee, was there with her Mexican boyfriend. When the attack began and the Red Color rocket warning alarm sounded, she spoke with her mother on the phone. She mentioned the limited shelter options and her intention to find safety. After the attack, a video emerged showing Louk in the back of a pickup truck, appearing unconscious. Early reports suggested that Louk had been killed, with the video seemingly showing her lifeless. However, her mother, Ricarda Louk, maintained that she was alive. On 10 October, a Palestinian family friend informed Ricarda that Shani was receiving medical treatment in a hospital under Hamas' control. In an interview with the German newspaper Bild, Ricarda confirmed that Shani was alive but had suffered a severe head injury and was in critical condition. She sought assistance from the German government. Furthermore, Ricarda received a bank notice indicating that Shani's credit card had been used near the Indonesia Hospital in Gaza on 8 October. As of 10 October 2023, there has been no official confirmation from Israeli, German, or Palestinian authorities regarding Shani Louk's whereabouts or her current condition. On 13 October, during a visit to Israel, Germany's Foreign Affairs Minister Annalena Baerbock met with Ricarda Louk and other family members of individuals who went missing after the attack. After the meeting, Ricarda stated at a press conference that German-Israeli citizens would receive support from Germany, and the German government was actively working to find solutions. Baerbock mentioned that Germany was in communication with various parties having contact with Hamas to convey the message that the hostages must be released. ==Spread of the video== A video that appeared to show Shani Louk gained widespread attention. In a column for The New York Times, Nicholas Kristof discussed this video as an example of the trauma and anger experienced by Jewish communities in the aftermath of the attacks. Security experts interviewed by Agence France-Presse stated that the release of this video, along with others depicting deceased or captured civilians, was a deliberate and sophisticated form of propaganda. The intention was to evoke feelings of \"helplessness, paralysis, and humiliation\" among the population. The viral sharing of such content contributed to promoting Hamas' narratives. Despite Hamas being banned on Twitter as a terrorist organization, some of its propaganda videos managed to circulate on the platform through sharing. One of the discussed videos was the one that appeared to show Shani Louk. This, along with other Hamas-related content, led the European Commission to caution Twitter's owner, Elon Musk, about permitting the spread of illegal content. Consequently, on 12 October, they initiated an investigation into Twitter for the dissemination of \"violent and terrorist content\" and other forms of illegal content. The family of Shani Louk, and other four families of the Re'im victims, submitted a lawsuit against the Associated Press and Reuters in the Jerusalem District Court for publishing the victims' images in their news media. ==References== Category:2001 births Category:Crime in Israel Category:Israel–Hamas war Category:Incidents of violence against women Category:2023 deaths",
 "title": "Kidnapping of Shani Louk"
}