{
 "id": "1055395",
 "text": "Aaron Solow (born February 4, 1987) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and competes under the ring name Aaron Solo. ==Career== ===All Elite Wrestling=== On the July 15, 2020 episode of Dark, Solo made his in-ring debut for All Elite Wrestling (AEW). He faced Scorpio Sky but lost. On February 8, 2021, Solo became a member of Cody Rhodes' group, the Nightmare Family. On the March 2 episode of Dark, Solo got his first victory in AEW. He teamed with his Nightmare Family partner Lee Johnson and they defeated Chris Peaks & Louie Valle. On the March 31 episode of Dynamite, QT Marshall attacked Rhodes after their unsanctioned match. Solo, Nick Comoroto, and Anthony Ogogo all turned heel and help with the beatdown after the match. Then then left with Marshall. Solo teamed with The Factory (Nick Comoroto & QT Marshall) and they defeat the Nightmare Family (Billy Gunn, Dustin Rhodes, and Lee Johnson) on the April 28 episode of Dynamite. At Double or Nothing, Solo competed in the Casino Battle Royal, but it was eventually won by Jungle Boy. On the August 25, 2023 episode of Rampage, Solo faced Orange Cassidy for the AEW International Championship but lost. == Championships and Accomplishments == *American Combat Wrestling **ACW Tag Team Championship (3 times) – with Jason Cade *Big Time Wrestling **BTW Heavyweight Championship (1 time, current) **BTW Tag Team Championship (1 time) – with Shane Kody *Dojo Pro Wrestling **Dojo Pro Black Belt Championship (1 time) **Dojo Pro White Belt Championship (1 time) *Pro Wrestling Illustrated **Ranked No. 447 of the top 500 singles wrestlers in the PWI 500 in 2024 *WrestleCircus **WC Big Top Tag Team Championship (1 time) – with Ricky Starks == References == == Other websites == * Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Sportspeople from San Francisco Category:Year of birth missing (living people)",
 "title": "Aaron Solo"
}