{
 "id": "1055519",
 "text": "Anil Dhirubhai Ambani (born June 4, 1959) is an Indian businessman. He serves as the chairman and managing director of the Reliance Group, also known as the Reliance ADA Group. This group was established in July 2006 after separating from Reliance Industries Limited. Ambani is responsible for various publicly traded companies, including Reliance Capital, Reliance Infrastructure, Reliance Power, and Reliance Communications. He is the son of Indian industrialist Dhirubhai Ambani. At one point, Anil Ambani was among the world's wealthiest individuals, but in February 2020, he made a statement in a UK court claiming that he had no assets left and was bankrupt. However, the accuracy of this assertion has been questioned. He also served as a Member of Parliament, Rajya Sabha, which is the upper house of India's Parliament. He represented Uttar Pradesh as an Independent Member of Parliament between 2004 and 2006. == Personal life == Anil Ambani was born into a Gujarati family from Chorwad, Junagadh district, Gujarat. He is the son of textile entrepreneur Dhirubhai Ambani and Kokilaben Ambani. He has an older brother, Mukesh Ambani, and two sisters, Nina Kothari and Deepti Salgaoncar. Anil Ambani is married to actress Tina Munim and they have two sons, Jai Anmol Ambani and Jai Anshul Ambani. == Awards == In December 1998, Anil Ambani received the 'Businessman of the Year 1997' award from India's top business magazine, Business India. In December 2006, The Times of India conducted a poll, and people voted him as 'the Businessman of the Year'. In August 2006, India Today magazine did a poll and people chose him as the 'Best role model' among business leaders. In the year 2004, he received the 'CEO of the Year' award in the Platts Global Energy Awards. In October 2002, the Bombay Management Association gave him the Entrepreneur of the Decade Award. In December 2001, he got the First Wharton Indian Alumni Award from the Wharton India Economic Forum (WIEF) for his work in making Reliance a global leader in many business areas. In June 1999, Asiaweek magazine included him in its list of Leaders of the Millennium in Business and Finance. He was the only 'new hero' from India in the field of Business and Finance. ==Controversies== In India, internet.org is limited to subscribers of Reliance Communications (Jio), a telecommunications company owned by its conglomerate.Facebook redéfinit son « Internet pour les pauvres » en Indeon LeMonde In 2014, he publicly wished a happy birthday to Prime Minister Narendra Modi, with whom he is very close. In 2015, the French tax authority canceled a €143.7 million tax audit against Reliance Flag Atlantic France, a company owned by Ambani. In October 2018, the French NGO Sherpa filed a complaint with the National Financial Prosecutor's Office to open an investigation into corruption and influence peddling in the sale of 36 Rafale fighter jets from France to India. The sale was negotiated between the French company Dassault Aviation and the Indian company Reliance Defence Limited, controlled by Ambani and formed 10 days before the final contract was signed in April 2015. In April 2019, the Supreme Court of India initiated a corruption inquiry into the same contract. In October 2021, his name was mentioned in the Pandora Papers. ==References== Category:1959 births Category:Living people Category:Indian businesspeople Category:Members of the Rajya Sabha",
 "title": "Anil Ambani"
}