{
 "id": "105596",
 "text": "Judgment Day was a series of professional wrestling pay-per-view events made World Wrestling Entertainment (WWE) from 1998 to 2009. It was replaced by Over the Limit in 2010. In 2022, a stable of the same name formed in WWE. ==Dates and venues== SmackDown-branded event # Event Date City Venue Main Event 1 Judgment Day: In Your House October 18, 1998 Rosemont, Illinois Rosemont Horizon The Undertaker vs. Kane for the vacant WWF Championship with Stone Cold Steve Austin as the special guest referee 2 Judgment Day (2000) May 21, 2000 Louisville, Kentucky Freedom Hall The Rock (c) vs. Triple H in a 60-minute Iron Man match for the WWF Championship with Shawn Michaels as the special guest referee 3 Judgment Day (2001) May 20, 2001 Sacramento, California ARCO Arena Stone Cold Steve Austin (c) vs. The Undertaker in a No Holds Barred match for the WWF Championship 4 Judgment Day (2002) May 19, 2002 Nashville, Tennessee Gaylord Entertainment Center Hollywood Hulk Hogan (c) vs. The Undertaker for the Undisputed WWE Championship 5 Judgment Day (2003) May 18, 2003 Charlotte, North Carolina Charlotte Coliseum Brock Lesnar (c) vs. Big Show in a Stretcher match for the WWE Championship 6 Judgment Day (2004) May 16, 2004 Los Angeles, California Staples Center Eddie Guerrero (c) vs. John \"Bradshaw\" Layfield for the WWE Championship 7 Judgment Day (2005) May 22, 2005 Minneapolis, Minnesota Target Center John Cena (c) vs. John \"Bradshaw\" Layfield in an \"I quit\" match for the WWE Championship 8 Judgment Day (2006) May 21, 2006 Phoenix, Arizona US Airways Center Rey Mysterio (c) vs. John \"Bradshaw\" Layfield for the World Heavyweight Championship 9 Judgment Day (2007) May 20, 2007 St. Louis, Missouri Scottrade Center John Cena (c) vs. The Great Khali for the WWE Championship 10 Judgment Day (2008) May 18, 2008 Omaha, Nebraska Qwest Center Omaha Triple H (c) vs. Randy Orton in a Steel cage match for the WWE Championship 11 Judgment Day (2009) May 17, 2009 Rosemont, Illinois Allstate Arena Edge (c) vs. Jeff Hardy for the World Heavyweight Championship ==References== ==Other websites== *Official Website Category:WWE Judgment Day Category:1998 establishments in the United States Category:2009 disestablishments in the United States",
 "title": "WWE Judgment Day"
}