{
 "id": "1055034",
 "text": "Madeline Felicity Argy (born 7 July 2000)England & Wales, Civil Registration Birth Index, 1916-2007: AUG 2000 70A 027 HAYWARDS HEATH – Madeline Felicity Argy is an English media personality. She is best known as the host of the Pretty Lonesome podcast. == Early life == Madeline Felicity Argy was born in Haywards Heath, West Sussex, England on 7 July 2000, as the youngest of two children. She has an older sister.England & Wales, Civil Registration Birth Index, 1916-2007: MAR 1999 B67 008 HAYWARDS HEATH – Jessica Nicole Argy Her mother is the thalidomide survivor and activist, Michaelina \"Mikey\" Argy MBE. Argy's father left when she was 7, although he still maintains contact. Argy attended Sackville School in East Grinstead. However, she went through a period of time not in school due to severe mental illness (anxiety and depression), however she went back to school briefly to complete her GCSEs and then went on to complete her A-levels. She graduated from the University of Kent in 2022. Argy has spoken publicly about her experiences in therapy. == Career == Argy rose to fame when she started to post on the social media platform TikTok in March 2021. Her account, @madelineargy, has 6.7 million followers, as of July 2024. Argy launched @madelineargy7946, her YouTube channel, in August 2022. As of April 2024, her YouTube channel has 499,000 subscribers and 1.9 million followers on her Instagram account. Argy was signed to The Unwell Network on 8 August 2022. The company was founded by the American social media influencer Alexandra Cooper on the same day. She launched her podcast, Pretty Lonesome, on 2 October 2023. She tackles Gen Z problems from her \"banged-up\" Vauxhall Astra. == Personal life == Argy currently resides in Sussex, England. She worked at a camp in the United States during the summer of 2019. Argy got into a relationship with British rapper Central Cee in July 2022. In July 2024, Argy would post a series of videos on her TikTok account addressing her break up with the rapper due to a scandal involving American rapper, Ice Spice. She posted a more in-depth explanation on her podcast, Pretty Lonesome, 7 days later. She identifies as bi. She came out to her family in 2020, and to her father in 2021. Argy's sexuality was referenced with the lyrics \"How can I be homophobic? My bitch is gay\" from Cee's 2022 song Doja. Argy was diagnosed with attention deficit hyperactivity disorder (ADHD) in October 2023. == References == Category:2000 births Category:Living people Category:People from Sussex Category:Alumni of the University of Kent",
 "title": "Madeline Argy"
}