{
 "id": "1055988",
 "text": "A referendum on splitting from the Gilbert Islands was held in the Ellice Islands (which were together as the Gilbert and Ellice Islands at the time) between July and September 1974.Dieter Nohlen, Florian Grotz & Christof Hartmann (2001) Elections in Asia: A data handbook, Volume II, p829 It started in July in Tarawa in the Gilbert Islands before being taken to every person who lived in the Ellice Islands. The result was 93% of voters deciding to split the colony, with a voter turnout of 88%. In October 1975, the islands were officially split into two colonies. Four years after the referendum, the islands became the country of Tuvalu, while the Gilbert Islands became Kiribati. ==Background== The 8 representatives of the Ellice Islands were concerned about the Gilbert Islands being the more powerful part of the territory. They had an inquiry held by the British representative Leslie Monson. The British government let them have the referendum.Two big decisions for the Ellice Pacific Islands Monthly, March 1974, p6 Before the referendum, the British government said that if the colony split, the Ellice Islands would not get any of the Gilberts' phosphate revenues from Ocean Island and that the assets of the GEIC outside the Ellice Islands would be owned by the Gilbert Islands. However, all prominent Ellice Islands politicians except Isakala Paeniu still wanted to split.Ellice votes the 'E' out of the GEIC Pacific Islands Monthly, November 1974, p8 ==Results== The referendum had two options:Moment of decision for Ellice Pacific Islands Monthly, August 1974, p8 #The establishment of a separate Ellice Islands Colony #To remain with the Gilberts as part of the GEIC and what the colony becomes when its status is altered. Choice Votes % Establishment of a separate colony 3,799 92.8 Remain part of the GEIC 293 7.2 Invalid/blank votes 40 – Total 4,132 100 Registered voters/turnout 4,676 88.4 Source: Nohlen et al. Source: Nohlen et al. Source: Nohlen et al. ==References== Category:Tuvalu Category:1974 Category:Referendums",
 "title": "1974 Ellice Islands self-determination referendum"
}