{
 "id": "1055008",
 "text": "The Viceroyalty of the Río de la Plata (Spanish: Virreinato del Río de la Plata or Spanish: Virreinato de las Provincias del Río de la Plata) was the shortest-lived of the Viceroyalties of the Spanish Empire in the Americas. It was the last to be organized. Its name means \"River of the Silver\", It was also called \"Viceroyalty of the River Plate\" in some writings. The name \"Provincias del Río de la Plata\" was formally adopted in 1810 during the Cortes of Cádiz to name the Viceroyalty of the Río de la Plata. == Government == The Viceroyalty of the Río de la Plata was created in 1776 by Charles III of Spain. Although it functioned as a Spanish colony, Río de la Plata was technically a personal possession of the King of Spain. This allowed both European Spain and its overseas territories to have their own laws and regulations. 1 Pedro Antonio de Cevallos 15 October 1777 – 26 June 1778 1 August 1776 Appointed by Charles III of Spain 2 Juan José de Vértiz y Salcedo 26 June 1778 – 7 March 1784 27 October 1777 Appointed by Charles III of Spain; resigned 3 Nicolás del Campo 7 March 1784 – 4 December 1789 13 August 1783 Appointed by Charles III of Spain 4 Nicolás Antonio de Arredondo 4 December 1789 – 16 March 1795 21 March 1789 Appointed by Charles IV of Spain, resigned 5 Pedro Melo de Portugal 16 March 1795 – 15 April 1797 5 February 1794 Appointed by Charles IV of Spain, died in office \\- Real Audiencia of Buenos Aires 15 April 1797 – 2 May 1797 Interim government until the arrival of a new viceroy 6 Antonio Olaguer Feliú 2 May 1797 – 14 May 1799 During his mandate, he had to contend with the presence of British and Portugueseforces in the Río de la Plata region, as well as nascent revolutionary sentiment inspired by the recent French Revolution. He opened the port of Buenos Aires to foreign traffic in a bid to stimulate the commercial activities of the Viceroyalty. 7 Gabriel de Avilés, 2nd Marquis of Avilés 14 March 1799 – 20 May 1801 25 October 1797 8 Joaquín del Pino y Rozas 20 May 1801 – 11 April 1804 14 July 1800 Appointed by Charles IV of Spain, died in office 9 Rafael de Sobremonte 24 April 1804 – 10 February 1807 10 November 1804 During the British invasions of the Río de la PlataBuenos Aires and Montevideofell under British authority for brief periods of time. Sobremonte was forced on 14 August 1806 by an open cabildo to move to Montevideo, delegating in Santiago de Liniers the military authority and in the Audience the other areas of government. He was removed completely as viceroy by a martial court, with Liniers elected as interim viceroy. 10 Santiago de Liniers 10 February 1807 – 30 June 1809 Interim viceroy, confirmed in office by Charles IV of Spain, replaced by the Junta of Seville. 11 Baltasar Hidalgo de Cisneros 15 July 1809 – 25 May 1810 11 February 1809 Appointed by the Junta of Seville, ousted from office by the May Revolution, replaced by the Primera Junta. 12 Francisco Javier de Elío 19 January 1811 – January 1812 31 August 1810 Governor of Montevideo, self- proclaimed \"viceroy\", political chief confirmed as such by the Cortes of Cádiz, which also declared Montevideo the new capital of the viceroyalty and Buenos Aires a rebel city. 13 Pedro Antonio Olañeta 27 May 1825 1825 In May 1825, King Ferdinand VII of Spainappointed Pedro Antonio de Olañeta as viceroy of the Río de la Plata, unaware that he had died three months earlier at the Battle of Tumusla (Upper Peru). Category:1776 establishments Category:History of Argentina Category:History of Bolivia Category:History of Paraguay Category:History of Uruguay Viceroyalty Rio De La Plata Category:1814 disestablishments Category:Spanish Empire",
 "title": "Viceroyalty of the Río de la Plata"
}