{
 "id": "105561",
 "text": "The Tokugawa shogunate, also known as the , and the , was a feudal Japanese military government. The heads of government were the shoguns. Each was a member of the Tokugawa family. These years are known as the Edo period. The period takes its name from the city where the Tokugawa shoguns lived. This time is also called the Tokugawa period or pre-modern (Kinsei). ==History== Before the Tokugawa shogun was the sengoku era. During this time, many people controlled small areas of land. Oda Nobunaga began to join these small areas. After he died in 1582, Toyotomi Hideyoshi took over for him. Hideyoshi died in 1598. When he died, the people under him fought for control. The last battle in this was the Battle of Sekigahara where Tokugawa Ieyasu won. Tokugawa Ieyasu needed permission from the Emperor of Japan to take control. The emperor gave him this permission, making him the Shogun, in 1603. He established a military government in Edo, now Tokyo. He won against his last enemies in 1615 at the Battle of Osaka Castle. The Tokugawa ruled in peace until the middle of the 1800s. During this time period, much of common Japanese culture was created. This includes high literacy rates, kabuki theater, the Japanese tea ceremony, sumo wrestling, woodblock printing, and sushi. The Tokugawa shogunate ended with the Boshin civil war. Instead of choosing a new shogun, Emperor Meiji ruled directly. The changes he made are named the Meiji Restoration. ==Structure== The Tokugawa government is sometimes known as the bakuhan system because it had two parts. The first part was the bakufu, the shogun's government. The second part was the hans. Hans were small areas of land led by daimyo leaders. The shogun did not control minor events in hans. ==List of the Tokugawa shoguns== # Tokugawa Ieyasu, r. 1603–1605 # Tokugawa Hidetada, r. 1605–1623 # Tokugawa Iemitsu, r. 1623–1651 # Tokugawa Ietsuna, r. 1651–1680 # Tokugawa Tsunayoshi, r. 1680–1709 # Tokugawa Ienobu, r. 1709–1712 # Tokugawa Ietsugu, r. 1713–1716 # Tokugawa Yoshimune, r. 1716–1745 # Tokugawa Ieshige, r. 1745–1760 # Tokugawa Ieharu, r. 1760–1786 # Tokugawa Ienari, r. 1787–1837 # Tokugawa Ieyoshi, r. 1837–1853 # Tokugawa Iesada, r. 1853–1858 # Tokugawa Iemochi, r. 1858–1866 # Tokugawa Yoshinobu, r. 1866–1867 ==Related pages== * Kamakura shogunate * Ashikaga shogunate * Meiji Restoration ==References== == Other websites == * Political system of the Tokugawa Shogunate * SengokuDaimyo.com website of Anthony J. Bryant on Japan * Japan Category:Periods in Japanese history Category:Samurai Category:1603 establishments Category:17th-century establishments in Japan Category:1600s establishments in Asia",
 "title": "Tokugawa shogunate"
}