{
 "id": "1055303",
 "text": "Official nicknames are highlighted in bold. A state nickname should not be confused with an official state motto. State, federal district, or territory Nickname(s) *Alabama the Beautiful *Cotton Plantation State *Cotton State * Heart of Dixie (used on license plates) * Lizard StateIntroduction to Alabama, 50 States, retrieved April 24, 2009. *Sweet Home Alabama * Yellowhammer State * Land of the Midnight Sun * Land of the Noonday Moon * The Last Frontier (used on license plates)The Last Frontier State, 50 States, retrieved April 24, 2009. *Seward's Folly (named after U.S. Secretary of State William H. Seward) *Seward's Ice Box, Icebergia, Polaria, Walrussia, and Johnson's Polar Bear Garden were satirical names coined by members of the U.S. Congress during debate over the Alaska Purchase *Motu o Fiafiaga (a Samoan phrase; in English, it is \"Islands of Paradise\") (used on American Samoa license plates)http://www.worldlicenseplates.com/world/PA_AMSA.html Worldlicenseplates.com. American Samoa. Retrieved July 7, 2018. *Football Island[s]\"American Samoa Facts\". Factretriever.com. Retrieved November 24, 2017. * Apache State *Aztec State *Baby State (because Arizona is the newest contiguous state in the Union) * Copper State * Grand Canyon State (used on license plates)Introduction to Arizona, 50 States, retrieved April 24, 2009.Ariz. HB 2549 Officially adopted by Arizona on February 14, 2011 *Italy of America *Sand Hill State *Sunset State *Sweetheart State (see below) *Valentine State (Arizona gained statehood on February 14, 1912) *Bear State *Bowie State *Hot Springs State * Land of Opportunity (former official nickname; previously used on license plates) * The Natural State (used on license plates)Arkansas § 1-4-106 - State nickname Retrieved February 28, 2011 * Razorback Crystal State *Toothpick StateIntroduction to Arkansas, US States, retrieved April 24, 2009. * Wonder State * El Dorado State * The Golden StateCalifornia Government Code Section 420.75 Retrieved February 28, 2011 (previously used on license plates) *Buffalo Plains State (no longer used) *Centennial State (previously used on license plates. Colorado was admitted to the Union one hundred years after the signing of the Declaration of Independence.) *Colorful Colorado Used on welcome signs since 1950 (previously used on license plates) *Columbine State *Highest State *Lead State (no longer used) *Mother of Rivers *Rocky Mountain EmpireDenver, Colorado (no longer used) *Rocky Mountain State (no longer used) *Silver State (no longer used; see Nevada) *Ski Country USA *Switzerland of AmericaIntroduction to Colorado, 50 States, retrieved April 24, 2009. *Constitution State (official, used on license plates)Conn. Stat. Sec. 3-110a, retrieved November 4, 2013 *Nutmeg State *Provision State *Blue Law State *Freestone State *Land of Steady Habits *Chemical Capital of the World (due to one time being the corporate headquarters for several international chemical companies.) *Corporate Capital (due to the state's business-friendly incorporation laws) *Diamond State (Thomas Jefferson is supposed to have referred to Delaware as being like a diamond - small in size but great in value) *Blue Hen State or Blue Hen Chicken StateBarry Popik, Smoky City, barrypopik.com website, March 27, 2005 * The First StateDelaware Code Title 29 Section 318 retrieved on February 28, 2011 (Delaware was the first state to ratify the Constitution; used on license plates) *Peach StateIntroduction to Delaware, 50 States, retrieved April 24, 2009. (no longer used; see Georgia) * Small Wonder * Nation's CapitalFarhi, Paul. (July 30, 2010). After initial obscurity, 'The DMV' nickname for Washington area picks up speed. Washington Post. Retrieved December 20, 2013. * DMV (nickname for the broader metropolitan area of the District of Columbia, Maryland, and Virginia) * Inside the Beltway * Chocolate City *Alligator State * Everglade StateIntroduction to Florida, 50 States, retrieved April 24, 2009. * Flower State *Gulf State *Gunshine State * Orange State * Peninsula State or Peninsular State * Plywood State * Sunshine State (used on license plates) * Peach State (used on license plates) * Cracker State — Along with Florida, Georgia had been called \"The Cracker State\" in earlier times, perhaps a derogatory term that referred to immigrants, called \"crackers\", from the mountains of Virginia and North Carolina. See also Atlanta Crackers: Origin of the name * Empire State of the South — Georgia is the largest Southern state in land area east of the Mississippi and was the leading industrial state of the Old South. * Goober State — Refers to peanuts, the official state crop. * State of Adventure (on highway welcome signs) *Tano y Chamorro (Land of the Chamorro)https://www.visittheusa.com/state/guam Guam (Visittheusa.com). Retrieved November 24, 2017. (used on Guam license plates)http://www.worldlicenseplates.com/world/PA_GUAM.html Worldlicenseplates.com. Guam. Retrieved July 7, 2018.http://www.andersen.af.mil/News/Articles/Article/754311/driven-by-island- heritage-guam-native-serves-country-community-family/ Driven by island heritage, Guam native serves country, community, family. Arielle Vasquez. May 8, 2016. Retrieved July 7, 2018. *Hub of the Pacific *Gateway to Micronesia * Aloha State (officially the \"popular\" name, used on license plates)Introduction to Hawaii, 50 States. * Paradise of the Pacific * Pineapple State * Rainbow State * Youngest State * 808 State (colloquial, refers to the state's area code.)808 State Frequently Asked Questions: Where did 808 State get their name from? , 808 State Official Website.808 State Update, Talk Radio Hawaii *Gem State * Gem of the MountainsIntroduction to Idaho, 50 States. * Little Ida * Spud State * Land of Lincoln (used on license plates) * Prairie State * Corn StateIntroduction to Illinois, 50 States, retrieved April 24, 2009. * Garden of the West * Hoosier State (Used at various times on license plates)The unofficial sobriquet of the State of Indiana has given rise to the humorous constructions Hoosierana (the land of Hoosiers; see uses in Indiana Journalism Hall of Fame and by sports journalist Frank DeFord) and Hoosierstan (the place of Hoosiers). (Hoosier is also the official demonym of a resident of Indiana) * Crossroads of America (Also used at various times on license plates and used on highway welcome signs) * Hawkeye State * America's Heartland (previously used on Licence Plates) * Central State * Dorothy's Home * Free State * Midway USA (previously used on Kansas Licence Plates) * Sunflower State * Wheat State (previously used on license plates) * Bluegrass State (used on license plates)Introduction to Kentucky, 50 States. * Corn-cracker State (reported in 1881) (corn-cracker – the nickname of a Kentucky man; pejorative) * The Dark and Bloody Ground State (an allusion to battles between the Creek, Shawnee, Chickasaw, and Cherokee tribes) * Hemp State * Tobacco State * Bayou State (previously used on license plates) * Creole State * Pelican State * Sportsman's Paradise (used on license plates) * Pine Tree State (co-official with Vacationland) * Vacationland (used on license plates) * Lumber State * America in MiniatureJudy Colbert, Off the Beaten Path: Maryland and Delaware, 8th ed., 2007, . * Chesapeake State * Cockade State * Free State * Monumental State * Old Line State * Oyster State * Queen State * Terrapin State * Baked Bean State * Codfish State (formerly represented on license plates by a codfish) * The Bay StateIntroduction to Massachusetts, 50 States, retrieved April 24, 2009. * Old Colony StateMassachusetts (state, United States), Britannica Online, retrieved April 24, 2009. * Pilgrim State * The Spirit of America (used on license plates) * Taxachusetts (colloquial)Andrew Ryan, Report: 'Taxachusetts' label remains part of Massachusetts' past, Boston Globe, April 6, 2007.Daniel J. Flynn, 'Taxachusetts' no more?, Forbes, October 22, 2008.'Taxachusetts' Voters May Eliminate State Income Tax, Fox News, October 7, 2008.Michael D. Shear, Giuliani Backers Attack 'Taxachusetts Romney' , The Washington Post, December 12, 2007.Slate's Chatterbox: The Myth of 'Taxachusetts', National Public Radio, October 15, 2004. * The Great Lakes State (previously used on license plates) * Water Wonderland and Water-Winter Wonderland (previously used on license plates) * The Wolverine State * The Mitten State * Gopher State *Land of 10,000 Lakes (\"10,000 Lakes\" used on license plates) * New England of the West * North Star State * State of HockeyJess Myer s, Hockey roots run deep in Minnesota, ESPN.com, February 10, 2004 * \"Minne(snow)ta\" * Bread and Butter State * Hospitality State (previously used on license plates) * Magnolia State * The Birthplace of America's Music (being used on license plates) * The Bayou State * Bullion State * Show-Me State (used on license plates) *Gateway to the West *Lead State *Ozark State *Mother of the West *Iron Mountain State *Pennsylvania of the West *Cave State * Big Sky Country (previously used on license plates) * The Last Best PlaceIn Montana, a Popular Expression Is Taken Off the Endangered List New York Times, August 17, 2008; Retrieved February 28, 2011 * Treasure State (used on license plates) *Land of the Shining Mountains * Antelope StateNancy Capace, Encyclopedia of Nebraska. Somerset Publishers, Inc., January 1, 1999, p2-3 * Beef State (previously used on license plates) * Cornhusker State (previously used on license plates) * Bug-eating State * Blackwater State * The Good Life (as seen on state border signs) * Tree Planters State (formerly the official state nickname) * Battle Born State (refers to the fact that Nevada joined the Union during the Civil War) * Sagebrush State * Silver State (used on license plates) *Casino State * Granite State * The Live Free or Die State (official motto; \"Live Free or Die\" used on license plates) * Mother of Rivers * White Mountain State * Switzerland of America * Garbage State (pejorative) * Garden State (used on license plates) * The Crossroads of the Revolution (previously used on license plates) * The Cornerstone State (used colloquially, especially with reference to Pennsylvania when it is called the Keystone State). * The Suburban State * Land of EnchantmentNew Mexico Revised Statutes, Sec. 12-3-4-N, retrieved November 4, 2013 (used on license plates) * Land of Sunshine (predates \"Land of Enchantment\"; this earlier nickname highlighted the large percentage of sunshine received statewide)New Mexico Symbols, State Names, SHG Resources website, accessed July 7, 2008 * Empire State (used on license plates) * Excelsior State * First in Flight *First in Freedom *Old North StateIntroduction to North Carolina, 50 States, retrieved February 28, 2011. * Tar Heel State * Turpentine State * Variety VacationlandVariety Vacationland Postcard Exhibit Retrieved February 28, 2011. * Flickertail State * Peace Garden State (used on license plates) * Rough Rider State * Sioux State * Heaven on Earth *Håfa Adai (a Chamorro phrase; in English, it is \"Hello\")https://www.guamvisitorsbureau.com/ Guamvisitorsbureau.com. Retrieved July 7, 2018. (used on Northern Mariana Islands license plates)http://www.worldlicenseplates.com/world/PA_NMAR.html Worldlicenseplates.com. Northern Mariana Islands. Retrieved July 7, 2018. *America's Best Kept Secrethttps://www.iexplore.com/articles/travel- guides/australia-and-south-pacific/northern-mariana-islands/things-to-do Northern Mariana Islands - Things to do. explore.com. Retrieved November 24, 2017 * Buckeye State * Birthplace of Aviation (used on license plates) *The Heart of It All (formerly used on license plates) *Native America (used on license plates) *Land of the Red Man * Sooner State * Beaver StateWriter John Francon Williams included a mention of Oregon as being the ‘Beaver State’ in 1892 in his book:The Advanced Class-Book of Modern Geography: Physical, Political, Commercial, by William Hughes and John Francon Williams, publ., London, George Philip & Son (1892) page 629: ‘OREGON, the ‘Beaver State,’ extends north of California to the Columbia River, which divides it from Washington.’ * Pacific Wonderland (previously used on license plates and available on an extra cost plate) * Webfoot State * Keystone State (previously used on license plates) * Quaker State *Coal State *Railroad State * Isla del Encanto (\"Island of Enchantment\") (used on license plates) * Borinquen (name given by indigenous people, the Tainos) * Little Rhody * Ocean State (used on license plates) * Rogues Island * The Licentious Republic *Smallest State * Palmetto State * Iodine Products State (no longer used) (previously used on license plates) * Artesian State * Blizzard State * Coyote StateSouth Dakota Symbols, State Names , SHG Resources website, accessed July 7, 2008 * Land of Infinite Variety * The Mount Rushmore State (officially adopted in 1980 in place of the former nickname of Coyote State) * Sunshine State (no longer used; see Florida) * Big Bend State (refers to the Tennessee River)Tennessee Symbols and Honors, in Tennessee Blue Book * Butternut State (refers to the tan color of the uniforms worn by Tennessee soldiers in the American Civil War) * Hog and Hominy State * The Mother of Southwestern Statesmen * Volunteer State (used on license plates) * Lone Star State (used on license plates) * America's Caribbean (used on U.S. Virgin Islands license plates until 2015)http://www.worldlicenseplates.com/world/CA_USVI.html Worldlicenseplates.com. U.S. Virgin Islands. Retrieved July 7, 2018. * American Paradisehttp://www.ducksters.com/geography/state.php?State=Virgin%20Islands Virgin Islands (Ducksters.com). Retrieved November 24, 2017. * Beehive State * Crossroads of the West – Location the Golden Spike was driven into the railroad, the joining point of the First transcontinental railroad. * Mormon State * Friendly State (formerly used on license plates) * Green Mountain State (used on license plates) * Mother of Presidents * Mother of States * Horse Country * The Old Dominion * Evergreen State (used on license plates) * Mountain State (previously used on license plates) * Panhandle State *The Switzerland of America * Almost Heaven \"Wisconsin State Symbols \" in Wisconsin Blue Book 2005-2006, p. 966. Wisconsin has no Official nickname. * Badger State * America's Dairyland (also on license plates since a 1939 state law) * The Mitten State * The Copper State (historical) *The Dairy State * Cowboy State * Equality State * Forever West (on highway welcome signs) ==Notes== ==References== ==Other websites== *Information about U.S. State Nicknames Nicknames",
 "title": "List of U.S. state and territory nicknames"
}