{
 "id": "1055250",
 "text": "This is an ordered by letter list of Alabama house members of the United States House of Representatives. For a list of ordered by time members for both houses of the United States Congress from the state, look at the page United States congressional delegations from Alabama. This page should be done, but other items may be not done. == Current members == * 1st district: Jerry Carl (R) (2021-present) * 2nd district: Barry Moore (R) (2021-present) * 3rd district: Mike D. Rogers (R) (2003-present) * 4th district: Robert Aderholt (R) (1997-present) * 5th district: Dale Strong (R) (2023-present) * 6th district: Gary Palmer (R) (2015-present) * 7th district: Terri Sewell (D) (2011-present) == List of members == Representative Years Party District Notes James Abercrombie March 4, 1851 – March 4, 1855 Whig Elected in 1851. Retired. John Abercrombie March 4, 1913 – March 4, 1917 Democratic Elected in 1912. Retired. Robert Aderholt January 3, 1997 – present Republican Elected in 1996. Incumbent. Truman H. Aldrich June 9, 1896 – March 4, 1897 Republican Won contested election. Retired. William F. Aldrich March 13, 1896 – March 4, 1897 Republican Won contested election. Lost re-election to Plowman. William F. Aldrich February 9, 1898 – March 4, 1899 Republican Won contested election. Lost re-election to Robbins. William F. Aldrich March 8, 1900 – March 4, 1901 Republican Won contested election. Retired. Miles C. Allgood March 4, 1923 – March 4, 1933 Democratic Elected in 1922. Redistricted to the . Miles C. Allgood March 4, 1933 – January 3, 1935 Democratic Redistricted from the 7th distr. and re-elected in 1932 Lost renomination to Starnes. Edward B. Almon March 4, 1915 – June 2, 1933 Democratic Elected in 1914. Died. William J. Alston March 4, 1849 – March 4, 1851 Whig Elected in 1849. Retired. Elizabeth B. Andrews April 4, 1972 – January 3, 1973 Democratic Elected to finish her husband's term. Retired. George W. Andrews March 14, 1944 – January 3, 1963 Democratic Elected to finish Steagall's term. Redistricted to the . George W. Andrews January 3, 1963 – January 3, 1965 Democratic Redistricted from the 3rd distr. and re-elected in 1962. Redistricted to the . George W. Andrews January 3, 1965 – December 25, 1971 Democratic Redistricted from the and re-elected in 1964. Died. Glenn Andrews January 3, 1965 – January 3, 1967 Republican Elected in 1964. Lost re-election to Nichols. Spencer Bachus January 3, 1993 – January 3, 2015 Republican Elected in 1992. Retired. John H. Bankhead March 4, 1887 – March 4, 1907 Democratic Elected in 1886. Lost renomination to Hobson. Walter W. Bankhead January 3, 1941 – February 1, 1941 Democratic Elected in 1940. Resigned. William B. Bankhead March 4, 1917 – March 4, 1933 Democratic Elected in 1916. Redistricted to the . William B. Bankhead March 4, 1933 – September 15, 1940 Democratic Redistricted from the and re-elected in 1932. Died. Laurie C. Battle January 3, 1947 – January 3, 1955 Democratic Elected in 1946. Retired. Robert E.B. Baylor March 4, 1829 – March 4, 1831 Jacksonian Elected in 1829. Lost re-election to Mardis. James E. Belser March 4, 1843 – March 4, 1845 Democratic Elected in 1843. Retired. Tom Bevill January 3, 1967 – January 3, 1973 Democratic Elected in 1966. Redistricted to the . Tom Bevill January 3, 1973 – January 3, 1997 Democratic Redistricted from the 7th distr. and re-elected in 1972. Retired. Fred L. Blackmon March 4, 1911 – February 8, 1921 Democratic Elected in 1910. Re-elected but died before next term began. Jo Bonner January 3, 2003 – August 2, 2013 Republican Elected in 2002. Resigned to become vice-chancellor of the University of Alabama System Franklin Welsh Bowdon December 7, 1846 – March 4, 1851 Democratic Elected to finish McConnell's term. Retired. Sydney J. Bowie March 4, 1901 – March 4, 1907 Democratic Elected in 1900. Retired. William B. Bowling December 14, 1920 – August 16, 1928 Democratic Elected to finish Heflin's term. Resigned when appointed judge for 5th Alabama Circuit. Frank W. Boykin July 30, 1935 – January 3, 1963 Democratic Elected to finish McDuffie's term. Redistricted to the and lost renomination to Huddleston Jr. Taul Bradford March 4, 1875 – March 4, 1877 Democratic Elected in 1874. Retired. John Bragg March 4, 1851 – March 4, 1853 Democratic Elected in 1851. Retired. Willis Brewer March 4, 1897 – March 4, 1901 Democratic Elected in 1896. Lost renomination to Thompson. Bobby Bright January 3, 2009 – January 3, 2011 Democratic Elected in 2008. Lost re-election to Roby. Frederick G. Bromberg March 4, 1873 – March 4, 1875 Liberal Republican Elected in 1872. Lost re-election to Haralson. Mo Brooks January 3, 2011 – January 3, 2023 Republican Elected in 2010. Retired to run for U.S. senator. Glen Browder April 4, 1989 – January 3, 1997 Democratic Elected to finish Nichols's term. Retired to run for U.S. senator. John Hall Buchanan Jr. January 3, 1965 – January 3, 1981 Republican Elected in 1964. Lost renomination to A. Smith. Alfred E. Buck March 4, 1869 – March 4, 1871 Republican Elected in 1868. Retired. Charles W. Buckley July 21, 1868 – March 4, 1873 Republican Elected to finish the vacant term. Retired. John L. Burnett March 4, 1899 – May 13, 1919 Democratic Elected in 1898. Died. Bradley Byrne January 7, 2014 – January 3, 2021 Republican Elected to finish Bonner's term. Retired to run for U.S. Senator. John Henry Caldwell March 4, 1873 – March 4, 1877 Democratic Elected in 1872. Retired. Sonny Callahan January 3, 1985 – January 3, 2003 Republican Elected in 1984. Retired. John B. Callis July 21, 1868 – March 4, 1869 Republican Elected to finish the vacant term. Retired. Jerry Carl January 3, 2021 – present Republican Elected in 2020. Incumbent. Archibald Hill Carmichael November 14, 1933 – January 3, 1937 Democratic Elected to finish Almon's term. Retired. Reuben Chapman March 4, 1835 – March 4, 1837 Jacksonian Elected in 1835. Switched parties. Reuben Chapman March 4, 1837 – March 4, 1841 Democratic Re-elected in 1837 as a Democrat. Redistricted to the . Reuben Chapman March 4, 1841 – March 4, 1843 Democratic Redistricted from the 1st distr. and re-elected in 1841. Redistricted to the . Reuben Chapman March 4, 1843 – March 4, 1847 Democratic Redistricted from the and re-elected in 1843. Retired to run for governor. Richard Henry Clarke March 4, 1889 – March 4, 1897 Democratic Elected in 1888. Retired to run for governor. Clement Comer Clay March 4, 1829 – March 4, 1835 Jacksonian Elected in 1829. Retired to run for governor. Henry D. Clayton March 4, 1897 – May 25, 1914 Democratic Elected in 1896. Resigned to become a US judge for the Middle and Northern District of Alabama. Newton N. Clements December 8, 1880 – March 4, 1881 Democratic Elected to finish Lewis's term. Retired. David Clopton March 4, 1859 – January 21, 1861 Democratic Elected in 1859. Withdrew due to Civil War. James E. Cobb March 4, 1887 – April 21, 1896 Democratic Elected in 1886. Lost contested election to Goodwyn. Williamson R. W. Cobb March 4, 1847 – January 30, 1861 Democratic Elected in 1847. Withdrew due to Civil War. James L. Cottrell December 7, 1846 – March 4, 1847 Democratic Elected to finish Yancey's term. Retired. George W. Crabb September 4, 1838 – March 4, 1841 Whig Elected to finish Lawler's term. Redistricted to the and lost re-election to 5 others. George H. Craig January 9, 1885 – March 4, 1885 Republican Won contested election. Lost re-election to Davidson. William B. Craig March 4, 1907 – March 4, 1911 Democratic Elected in 1906. Retired. Bud Cramer January 3, 1991 – January 3, 2009 Democratic Elected in 1990. Retired. John Crowell January 29, 1818 – March 3, 1819 Independent Elected in 1818. Redistricted to the . John Crowell December 14, 1819 – March 3, 1821 Democratic-Republican Elected in 1819. Retired. Jabez L. M. Curry March 4, 1857 – January 21, 1861 Democratic Elected in 1857. Withdrew due to Civil War. Edmund S. Dargan March 4, 1845 – March 4, 1847 Democratic Elected in 1845. Retired. Alexander C. Davidson March 4, 1885 – March 4, 1889 Democratic Elected in 1884. Lost renomination to Turpin. Artur Davis January 3, 2003 – January 3, 2011 Democratic Elected in 2002. Retired to run for governor. Edward deGraffenried January 3, 1949 – January 3, 1953 Democratic Elected in 1948. Lost renomination to Selden. James Dellet March 4, 1839 – March 4, 1841 Whig Elected in 1838. Redistricted to the and lost re-election to 5 others. James Dellet March 4, 1843 – March 4, 1845 Whig Elected in 1843. Retired. William Henry Denson March 4, 1893 – March 4, 1895 Democratic Elected in 1892. Lost renomination. S. Hubert Dent Jr. March 4, 1909 – March 4, 1921 Democratic Elected in 1908. Lost renomination to Tyson. William Louis Dickinson January 3, 1965 – January 3, 1993 Republican Elected in 1964. Retired. James F. Dowdell March 4, 1853 – March 4, 1855 Democratic Elected in 1853. Redistricted to the . James F. Dowdell March 4, 1855 – March 4, 1859 Democratic Redistricted from the 7th distr. and re-elected in 1855. Retired. Peter M. Dox March 4, 1869 – March 4, 1873 Democratic Elected in 1868. Retired. Jack Edwards January 3, 1965 – January 3, 1985 Republican Elected in 1964. Retired. Carl Elliott January 3, 1949 – January 3, 1963 Democratic Elected in 1948. Redistricted to the . Carl Elliott January 3, 1963 – January 3, 1965 Democratic Redistricted from the 7th distr. and re-elected in 1962. Redistricted to the and lost renomination to George C. Hawkins. Ben Erdreich January 3, 1983 – January 3, 1993 Democratic Elected in 1982. Lost re-election to Bachus. Terry Everett January 3, 1993 – January 3, 2009 Republican Elected in 1992. Retired. Ronnie Flippo January 3, 1977 – January 3, 1991 Democratic Elected in 1976. Retired to run for governor. Walter Flowers January 3, 1969 – January 3, 1973 Democratic Elected in 1968. Redistricted to the . Walter Flowers January 3, 1973 – January 3, 1979 Democratic Redistricted from the 5th distr. and re-elected in 1972. Retired to run for U.S. senator. William H. Forney March 4, 1875 – March 4, 1877 Democratic Elected in 1874. Redistricted to the . William H. Forney March 4, 1877 – March 4, 1893 Democratic Redistricted from the and re-elected in 1876. Retired. William Willis Garth March 4, 1877 – March 4, 1879 Democratic Elected in 1878. Lost re-election to Wheeler. John Gayle March 4, 1847 – March 4, 1849 Whig Elected in 1847. Retired. Albert T. Goodwyn April 21, 1896 – March 4, 1897 Populist Won contested election. Lost re-election to Brewer. George M. Grant June 14, 1938 – January 3, 1963 Democratic Elected to finish Hill's term. Redistricted to the . George M. Grant January 3, 1963 – January 3, 1965 Democratic Redistricted from the and re-elected in 1962. Redistricted to the and lost re-election to Dickinson. Oscar L. Gray March 4, 1915 – March 4, 1919 Democratic Elected in 1914. Retired. Parker Griffith January 3, 2009 – December 22, 2009 Democratic Elected in 2008. Switched parties. Switched parties. Parker Griffith December 22, 2009 – January 3, 2011 Republican Switched parties. Lost Republican renomination to Brooks. William A. Handley March 4, 1871 – March 4, 1873 Democratic Elected in 1870. Retired. Jeremiah Haralson March 4, 1875 – March 4, 1877 Republican Elected in 1874. Redistricted to the and lost re-election to Shelley. Christopher C. Harris May 11, 1914 – March 4, 1915 Democratic Elected to finish Richardson's term. Retired. Claude Harris Jr. January 3, 1987 – January 3, 1993 Democratic Elected in 1986. Retired. Sampson W. Harris March 4, 1847 – March 4, 1855 Democratic Elected in 1847. Redistricted to the . Sampson W. Harris March 4, 1855 – March 4, 1857 Democratic Redistricted from the and re-elected in 1855. Retired. George Paul Harrison Jr. November 6, 1894 – March 4, 1897 Democratic Elected to finish Oates's term. Retired. Thomas Haughey July 21, 1868 – March 4, 1869 Republican Elected to finish the partial term. Lost re-election as an Independent Republican to Sherrod. Charles Hays March 4, 1869 – March 4, 1877 Republican Elected in 1868. Retired. J. Thomas Heflin May 19, 1904 – November 1, 1920 Democratic Elected to finish Thompson's term. Retired to run for U.S. senator and resigned when elected. Robert S. Heflin March 4, 1869 – March 4, 1871 Republican Elected in 1868. Retired. Hilary A. Herbert March 4, 1877 – March 4, 1893 Democratic Elected in 1876. Retired. Thomas H. Herndon March 4, 1879 – March 28, 1883 Democratic Elected in 1878. Died. Goldsmith W. Hewitt March 4, 1875 – March 4, 1879 Democratic Elected in 1874. Retired. Goldsmith W. Hewitt March 4, 1881 – March 4, 1885 Democratic Elected in 1880. Retired. J. Lister Hill August 14, 1923 – January 11, 1938 Democratic Elected to finish Tyson's term. Resigned when appointed U.S. Senator. Earl F. Hilliard January 3, 1993 – January 3, 2003 Democratic Elected in 1992. Lost renomination to Davis. Henry W. Hilliard March 4, 1845 – March 4, 1851 Whig Elected in 1845. Retired. Sam Hobbs January 3, 1935 – January 3, 1951 Democratic Elected in 1934. Retired. Richmond P. Hobson March 4, 1907 – March 4, 1915 Democratic Elected in 1906. Lost renomination to Oliver. George S. Houston March 4, 1841 – March 4, 1843 Democratic Elected in 1841. Redistricted to the . George S. Houston March 4, 1843 – March 4, 1849 Democratic Redistricted from the and re-elected in 1842. Retired. George S. Houston March 4, 1851 – January 21, 1861 Democratic Elected in 1850. Withdrew due to Civil War. Milford W. Howard March 4, 1895 – March 4, 1899 Populist Elected in 1894. Retired. David Hubbard March 4, 1839 – March 4, 1841 Democratic Elected in 1839. Redistricted to the and lost re-election to 5 others. David Hubbard March 4, 1849 – March 4, 1851 Democratic Elected in 1848. Lost re-election to Houston. George Huddleston March 4, 1915 – January 3, 1937 Democratic Elected in 1914. Lost renomination to Patrick. George Huddleston Jr. January 3, 1955 – January 3, 1963 Democratic Elected in 1954. Redistricted to the . George Huddleston Jr. January 3, 1963 – January 3, 1965 Democratic Redistricted from the and re-elected in 1962. Redistricted to the and lost re-election to Buchanan. Samuel Williams Inge March 4, 1847 – March 4, 1851 Democratic Elected in 1847. Retired. Pete Jarman January 3, 1937 – January 3, 1949 Democratic Elected in 1936. Lost renomination to deGraffenried. Lamar Jeffers June 7, 1921 – January 3, 1935 Democratic Elected to finish Blackmon's term. Lost renomination to Hobbs. James T. Jones March 4, 1877 – March 4, 1879 Democratic Elected in 1876. Lost renomination to Herndon. James T. Jones December 3, 1883 – March 4, 1889 Democratic Elected to finish Herndon's term. Retired. Robert E. Jones Jr. January 28, 1947 – January 3, 1963 Democratic Elected to finish Sparkman's term. Redistricted to the . Robert E. Jones Jr. January 3, 1963 – January 3, 1965 Democratic Redistricted from the and re-elected in 1962. Redistricted to the . Robert E. Jones Jr. January 3, 1965 – January 3, 1973 Democratic Redistricted from the and re-elected in 1964. Redistricted to the . Robert E. Jones Jr. January 3, 1973 – January 3, 1977 Democratic Redistricted from the and re-elected in 1972. Retired. Francis William Kellogg July 22, 1868 – March 4, 1869 Republican Elected to finish the vacant term. Retired. Joab Lawler March 4, 1835 – May 8, 1838 Whig Elected in 1835. Died. Burwell Boykin Lewis March 4, 1875 – March 4, 1877 Democratic Elected in 1874. Redistricted to the and lost re-election to Hewitt. Burwell Boykin Lewis March 4, 1879 – October 1, 1880 Democratic Elected in 1878. Resigned to become President of the University of Alabama. Dixon Hall Lewis March 4, 1829 – March 4, 1833 Jacksonian Elected in 1829. Redistricted to the . Dixon Hall Lewis March 4, 1833 – March 4, 1837 Nullifier Redistricted from the and re-elected in 1833. Switched parties. Dixon Hall Lewis March 4, 1837 – March 4, 1841 Democratic Re-elected in 1837 as a Democrat. Redistricted to the . Dixon Hall Lewis March 4, 1841 – March 4, 1843 Democratic Redistricted from the and re-elected in 1841. Redistricted to the . Dixon Hall Lewis March 4, 1843 – April 22, 1844 Democratic Redistricted from the and re-elected in 1843. Resigned when appointed U.S. senator. Robert F. Ligon March 4, 1877 – March 4, 1879 Democratic Elected in 1876. Lost renomination to T. Williams. William M. Lowe March 4, 1879 – March 4, 1881 Greenback Elected in 1878. Lost re-election to Wheeler. William M. Lowe June 3, 1882 – October 12, 1882 Greenback Won contested election. Died. Francis S. Lyon March 4, 1835 – March 4, 1837 Anti-Jacksonian Elected in 1834. Switched parties. Francis S. Lyon March 4, 1837 – March 4, 1839 Whig Re-elected in 1836 as a Whig. Retired. Carter Manasco June 24, 1941 – January 3, 1949 Democratic Elected to finish Walter Bankhead's term. Lost renomination to Elliott. Samuel W. Mardis March 4, 1831 – March 4, 1833 Jacksonian Elected in 1831. Redistricted to the . Samuel W. Mardis March 4, 1833 – March 4, 1835 Jacksonian Redistricted from the and re-elected in 1833. Retired. James D. Martin January 3, 1965 – January 3, 1967 Republican Elected in 1964. Retired to run for governor. John Mason Martin March 4, 1885 – March 4, 1887 Democratic Elected in 1884. Lost re-election to J. Bankhead. Joshua L. Martin March 4, 1835 – March 4, 1837 Jacksonian Elected in 1835. Switched parties. Joshua L. Martin March 4, 1837 – March 4, 1839 Democratic Re-elected in 1837 as a Democrat. Retired. Felix G. McConnell March 4, 1843 – September 10, 1846 Democratic Elected in 1843. Died. John McDuffie March 4, 1919 – March 2, 1935 Democratic Elected in 1918. Resigned to become U.S. District Judge. John Van McDuffie June 4, 1890 – March 4, 1891 Republican Won contested election. Lost re-election to Turpin. John McKee March 4, 1823 – March 4, 1825 Democratic-Republican Elected in 1823. Switched parties. John McKee March 4, 1825 – March 4, 1829 Jacksonian Re-elected in 1825 as a Jacksonian. Retired. John McKinley March 4, 1833 – March 4, 1835 Jacksonian Elected in 1833. Retired. Barry Moore January 3, 2021 – present Republican Elected in 2020. Incumbent. Gabriel Moore March 4, 1821 – March 4, 1823 Democratic-Republican Elected in 1821. Redistricted to the . Gabriel Moore March 4, 1823 – March 4, 1825 Democratic-Republican Redistricted from the and re-elected in 1823. Switched parties. Gabriel Moore March 4, 1825 – March 4, 1829 Jacksonian Re-elected in 1825 as a Jacksonian. Retired. Sydenham Moore March 4, 1857 – January 21, 1861 Democratic Elected in 1857. Withdrew due to Civil War. William O. Mulkey June 29, 1914 – March 4, 1915 Democratic Elected to finish Clayton's term. Retired. John Murphy March 4, 1833 – March 4, 1835 Jacksonian Elected in 1832. Retired. John P. Newsome January 3, 1943 – January 3, 1945 Democratic Elected in 1942. Lost renomination to Patrick. William Flynt Nichols January 3, 1967 – January 3, 1973 Democratic Elected in 1966. Redistricted to the . William Flynt Nichols January 3, 1973 – December 25, 1988 Democratic Redistricted from the and re-elected in 1972. Re-elected but died before next term began. Benjamin White Norris July 21, 1868 – March 4, 1869 Republican Elected to finish the vacant term. Lost re-election to R. Heflin. William C. Oates March 4, 1881 – November 5, 1894 Democratic Elected in 1880. Retired to run for governor and resigned when elected. William Bacon Oliver March 4, 1915 – January 3, 1937 Democratic Elected in 1914. Retired. George Washington Owen March 4, 1823 – March 4, 1825 Democratic-Republican Elected in 1823. Switched parties. George Washington Owen March 4, 1825 – March 4, 1829 Jacksonian Re-elected in 1825 as a Jacksonian. Retired. Gary Palmer January 3, 2015 – present Republican Elected in 2014. Incumbent. Luther Patrick January 3, 1937 – January 3, 1943 Democratic Elected in 1936. Lost renomination to Newsome. Luther Patrick January 3, 1945 – January 3, 1947 Democratic Elected in 1944. Lost renomination to Battle. LaFayette L. Patterson November 6, 1928 – March 4, 1933 Democratic Elected to finish Bowling's term. Lost renomination to Allgood. William W. Payne March 4, 1841 – March 4, 1843 Democratic Elected in 1841. Redistricted to the . William W. Payne March 4, 1843 – March 4, 1847 Democratic Redistricted from the and re-elected in 1843. Lost re-election to Inge. Charles Pelham March 4, 1873 – March 4, 1875 Republican Elected in 1872. Retired. Philip Phillips March 4, 1853 – March 4, 1855 Democratic Elected in 1853. Retired. Charles W. Pierce July 21, 1868 – March 4, 1869 Republican Elected to finish the vacant term. Retired. Thomas S. Plowman March 4, 1897 – February 9, 1898 Democratic Elected in 1896. Lost contested election to Aldrich. Luke Pryor March 4, 1883 – March 4, 1885 Democratic Elected in 1882. Retired. James L. Pugh March 4, 1859 – January 21, 1861 Democratic Elected in 1859. Withdrew due to Civil War. Lilius B. Rainey September 30, 1919 – March 4, 1923 Democratic Elected to finish Burnett's term. Retired. Albert Rains January 3, 1945 – January 3, 1963 Democratic Elected in 1944. Redistricted to the . Albert Rains January 3, 1963 – January 3, 1965 Democratic Redistricted from the and re-elected in 1962. Retired. James T. Rapier March 4, 1873 – March 4, 1875 Republican Elected in 1872. Lost re-election to J. Williams. William N. Richardson August 6, 1900 – March 31, 1914 Democratic Elected to finish Wheeler's term. Died. Bob R. Riley January 3, 1997 – January 3, 2003 Republican Elected in 1996. Retired to run for governor. Gaston A. Robbins March 4, 1893 – March 13, 1896 Democratic Elected in 1892. Lost contested election to W. Aldrich. Gaston A. Robbins March 4, 1899 – March 8, 1900 Democratic Elected in 1898. Lost contested election to W. Aldrich. Kenneth A. Roberts January 3, 1951 – January 3, 1963 Democratic Elected in 1950. Redistricted to the . Kenneth A. Roberts January 3, 1963 – January 3, 1965 Democratic Redistricted from the and re-elected in 1962. Redistricted to the and lost re-election to G. Andrews. Martha Roby January 3, 2011 – January 3, 2021 Republican Elected in 2010. Retired. Mike Rogers January 3, 2003 – present Republican Elected in 2002. Incumbent. Thomas W. Sadler March 4, 1885 – March 4, 1887 Democratic Elected in 1884. Lost renomination to J. Cobb. William J. Samford March 4, 1879 – March 4, 1881 Democratic Elected in 1878. Retired. Armistead I. Selden Jr. January 3, 1953 – January 3, 1963 Democratic Elected in 1952. Redistricted to the . Armistead I. Selden Jr. January 3, 1963 – January 3, 1965 Democratic Redistricted from the and re-elected in 1962. Redistricted to the . Armistead I. Selden Jr. January 3, 1965 – January 3, 1969 Democratic Redistricted from the and re-elected in 1964. Retired to run for U.S. senator. Terri Sewell January 3, 2011 – present Democratic Elected in 2010. Incumbent. Charles C. Sheats March 4, 1873 – March 4, 1875 Republican Elected in 1872. Lost re-election to Forney. Richard Shelby January 3, 1979 – January 3, 1987 Democratic Elected in 1978. Retired to run for U.S. senator. Charles M. Shelley March 4, 1877 – July 20, 1882 Democratic Elected in 1876. Seat declared vacant when contested by James Q. Smith. Charles M. Shelley November 27, 1882 – January 9, 1885 Democratic Elected to finish the vacant term. Lost contested election to G. Craig. William C. Sherrod March 4, 1869 – March 4, 1871 Democratic Elected in 1869. Retired. Benjamin Glover Shields March 4, 1841 – March 4, 1843 Democratic Elected in 1841. Retired. Eli S. Shorter March 4, 1855 – March 4, 1859 Democratic Elected in 1855. Retired. Joseph H. Sloss March 4, 1871 – March 4, 1875 Democratic Elected in 1870. Lost re-election to Hewitt. Albert L. Smith Jr. January 3, 1981 – January 3, 1983 Republican Elected in 1980. Lost re-election to Erdreich. William Russell Smith March 4, 1851 – March 4, 1853 Unionist Elected in 1851. Switched parties. William Russell Smith March 4, 1853 – March 4, 1855 Democratic Re-elected in 1853 as a Democrat. Switched parties. William Russell Smith March 4, 1855 – March 4, 1857 Know Nothing Re-elected in 1855 as a Know Nothing candidate. Lost re-election to S. Moore. John Sparkman January 3, 1937 – November 5, 1946 Democratic Elected in 1936. Re-elected but resigned when elected U.S. Senator. Jesse F. Stallings March 4, 1893 – March 4, 1901 Democratic Elected in 1892. Retired. James A. Stallworth March 4, 1857 – January 12, 1861 Democratic Elected in 1857. Withdrew due to Civil War. Joe Starnes January 3, 1935 – January 3, 1945 Democratic Elected in 1934. Lost renomination to Rains. Henry B. Steagall March 4, 1915 – November 22, 1943 Democratic Elected in 1914. Died. Dale Strong January 3, 2023 – present Republican Elected in 2022. Incumbent. George W. Taylor March 4, 1897 – March 4, 1915 Democratic Elected in 1896. Retired. Charles Winston Thompson March 4, 1901 – March 20, 1904 Democratic Elected in 1900. Died. Benjamin Sterling Turner March 4, 1871 – March 4, 1873 Republican Elected in 1870. Lost re-election to Bromberg. Louis Washington Turpin March 4, 1889 – June 4, 1890 Democratic Elected in 1888. Lost contested election to McDuffie. Louis Washington Turpin March 4, 1891 – March 4, 1893 Democratic Elected in 1890. Redistricted to the . Louis Washington Turpin March 4, 1893 – March 4, 1895 Democratic Elected in 1892. Lost renomination to Underwood. John R. Tyson March 4, 1921 – March 27, 1923 Democratic Elected in 1920. Died. Oscar Underwood March 4, 1895 – June 9, 1896 Democratic Elected in 1894. Lost election contest to T. Aldrich. Oscar Underwood March 4, 1897 – March 4, 1915 Democratic Elected in 1896. Retired to run for U.S. Senator. Percy Walker March 4, 1855 – March 4, 1857 Know Nothing Elected in 1855. Retired. Zadoc L. Weatherford November 5, 1940 – January 3, 1941 Democratic Elected to finish William Bankhead's term. Retired. Joseph Wheeler March 4, 1881 – June 3, 1882 Democratic Elected in 1880. Lost election contest to Lowe. Joseph Wheeler January 15, 1883 – March 4, 1883 Democratic Elected to finish Lowe's term. Retired. Joseph Wheeler March 4, 1885 – April 20, 1900 Democratic Elected in 1884. Resigned. Alexander White March 4, 1851 – March 4, 1853 Whig Elected in 1851. Retired. Alexander White March 4, 1873 – March 4, 1875 Republican Elected in 1872. Lost re-election to B. Lewis. Ariosto A. Wiley March 4, 1901 – June 17, 1908 Democratic Elected in 1900. Died. Oliver C. Wiley November 3, 1908 – March 4, 1909 Democratic Elected to finish his brother's term. Retired. Jeremiah N. Williams March 4, 1875 – March 4, 1877 Democratic Elected in 1874. Redistricted to the . Jeremiah N. Williams March 4, 1877 – March 4, 1879 Democratic Redistricted from the and re-elected in 1876. Retired. Thomas Williams March 4, 1879 – March 4, 1885 Democratic Elected in 1878. Retired. William Lowndes Yancey December 2, 1844 – September 1, 1846 Democratic Elected to finish Lewis's term. Resigned. ==References== Category:United States representatives from Alabama",
 "title": "List of United States representatives from Alabama"
}