{
 "id": "105581",
 "text": "Northampton () is a big market town and a local government district of the East Midlands part of the United Kingdom. The district has a population of 200,100 people. Northampton has a major entertainment centre called the Derngate. == Twin towns == * Marburg in Germany * Poitiers in France == Notable residents == ;Modern * Steve Flint, aged 19, represented Northamptonshire at the 1980 Inter-Counties Championships One Mile, winning in a time of 3 minutes 58 seconds, making him one of only four teenage sub-four minute milers in the UK. * Composer William Alwyn (1905-1985) was born in the town. * Composer Sir Malcolm Arnold (1921-2006) was born in Northampton. * Judy Carne, born Joyce Botterill on April 27, 1939 in the town, is an actress who may be best remembered for her introducing the phrase \"Sock it to me!\" while a regular on Laugh-In. * Comedian Alan Carr attended what is now Weston Favell School. His father Graham Carr managed the Town's football club at the time. * Scientist Francis Crick, born in the town in 1916, along with James D. Watson discovered the structure of DNA, and went on to win a Nobel Prize. In December 2005, a public sculpture called Discovery by Lucy Glendinning was erected in Abington Street as a memorial to Crick . * Journalist and broadcaster Andrew Collins is from Northampton and wrote about growing up in the town in his memoir Where Did It All Go Right?. * Actress Joan Hickson, famous for playing Miss Marple, comes from Kingsthorpe. * Birds of a Feather actress Lesley Joseph grew up in the town. * Actor Robert Llewellyn (Kryten from Red Dwarf) was also born in the town, and lived at 47 Booth Rise until the age of 13 (source: Anglian TV's Celebrity Going Home: Robert Llewellyn (2004)) * Writer Alan Moore, creator of V for Vendetta, Watchmen, and The League of Extraordinary Gentlemen, is a lifelong resident of Northampton. His novel Voice of the Fire is a fictionalized history of the town. * BBC radio presenter Anna Murby comes from the county. * Nanette Newman, actress and author, was born in Northampton. * Des O'Connor lived in Northampton, worked at Church's for some years and played for the Cobblers (Northampton Town Football Club). * Myrea Pettit, renowned fantasy artist of fairies, flowers and butterflies learned her craft in Northamptonshire. * Jo Whiley, the BBC Radio 1 DJ was born in the town in 1965. * The late Delia Derbyshire, who was behind the original version of the Doctor Who theme tune, spent her final years in the town. * Blue Peter's Peter Purves lived in the nearby village of Cogenhoe. * Composer Edmund Rubbra (1901-1986) was born in the town. * Professional wrestler Norman Smiley was born in the town. * Nearby is Althorp, the country estate of Earl Spencer where Diana, Princess of Wales is buried. Charles Spencer, the current and 9th Earl Spencer (b. 1964) is her brother. * Television presenter Michael Underwood lives in the town. * Marc Warren, who plays Danny Blue in the BBC's Hustle series, was born in Kingsthorpe. * Stuart Pearson Wright, award winning artist was born in Northampton in 1975. * Lorna Fitzgerald, who plays Abi Branning in Eastenders lives in Hunsbury * Issim Ullah, acclaimed late Bangladeshi businessman, landlord and soldier lived in Spencer. ;Historical * Elizabeth Bowen, 20th century Anglo-Irish writer, lived here after her marriage. * Charles Bradlaugh, the famous radical MP, was a member for the town. * Anne Bradstreet (1612-1672)- a puritan poet later based in Massachusetts. * Alban Butler (1710-1773) - the author of Lives of the Saints * John Clare, the poet, was sectioned in the local madhouse, where he remained until his death in 1864. * Errol Flynn acted in the Northampton Repertory Theatre between 1933 and 1935. * Jerome K. Jerome, author of Three Men in a Boat and other works, died in Northampton in 1927. * Spencer Perceval was a local MP and Prime Minister. He was shot in the House of Commons by assassin John Bellingham in 1812. * Victorian cricketer and pioneer missionary Charles (\"C.T.\") Studd who played in the first Ashes test, was born at Spratton. ;Musical * Bauhaus (band) * The Departure * Mark Griffiths, bass player with Shadows, Cliff Richard, David Essex, Matthews Southern Comfort * Faye Tozer, singer from pop group Steps ;Other * Northampton was used as the town location for Keeping Up Appearances between 1990-1995. == References == == Other websites == * Northampton Borough Council * Northamptonshire County Council * The University of Northampton website * Northampton with Vision Category:County towns in England",
 "title": "Northampton"
}