{
 "id": "1055523",
 "text": "Karl Franz Durspekt (23 November 1913 in Vienna, Austria – 14 February 1978 in Vienna, Austria) was an Austrian football player. He played mainly for SK Admira Wien and Floridsdorfer AC as striker. He also played for the Austrian national football team. ==Career== As the son of a train driver, Karl Durspekt first worked as a typesetter and then became a professional football player. He started his professional career with SK Admira Wien. From the 1935–36 season he was under contract with FC Rouen, where he was part of the legendary “bomb storm” in France around Jean Nicolas, Roger Rio and Marceau Lhermine, who scored 119 goals in 34 second division games, 12 of which, scored in 20 appearances, were due to Durspekt. They were promoted to Division 1. The “Red Devils” also held their own at the higher level and finished fourth in the table in each of the following two years. Durspekt left the club in 1938. After his return to Vienna he played again for Admira in the 1938–39 season. He won the Austrian championship, which had been downgraded to a district championship. In the final round of the German championship Admira reached the final. In the final the Viennese lost 9-0 to FC Schalke 04. He played for Floridsdorfer AC until 1942. 1942 till 1945 he played for the air force team LSV Markersdorf an der Pielach. During these years, LSV Markersdorf managed to become champions of the 1st class Lower Danube and to be promoted to the Gaulliga Donau-Alpenland. This was the highest league in the then Ostmark. After the war Durspekt played for Floridsdorfer AC for three more seasons from 1945 to 1948. ==International== He played two matches for the Austrian national football team in 1935. His first match was a draw versus Czechoslowakia on 14 April, his last match was a 6-3 loss versus Hungary on 12 May.ÖFB Players profile ==Manager== After Durspekt had taken on coaching duties at the FAC, he began his full-time work as a coach at Hellenic Alexandria at the end of 1948. He then brought SC Nord-Wien into the Vienna League in 1952. Then he worked for Lower Austrian SV Wimpassing in 1950. In Sweden he became the first full-time coach at Lunds BK 1950. He stayed there until 1952. In Switzerland he finished tenth in the second division with FC Locarno in 1953–54. In 1956–57 he was with the Swedish second division club Åtvidabergs FF. From 1960 to 1961, he managed the newly promoted Oberliga South team SSV Jahn Regensburg. From 1961 to 1963, Durspekt looked after the Greek first division club PAOK in Thessaloniki, with whom he finished sixth and then fourth the following season. In 1964–65 he trained in the Austrian state league for the first time. In between the two contracts with GAK he coached SV Rapid Lienz in the Carinthian regional league in 1966–67. In the first half of 1970 he coached IK Start in Kristiansand, Norway. In 1975 he managed Bodens BK. ==References== Category:1913 births Category:1978 deaths Category:Austrian footballers Category:Players of the Austrian national football team Category:Austrian football managers Category:Association football forwards Category:Austrian football forwards Category:Austrian football champions Category:Grazer AK managers",
 "title": "Karl Durspekt"
}