{
 "id": "1056818",
 "text": "Lise Baron is a French documentary filmmaker. She lives in Nantes. ==Biography== After studying ancient history, Lise Baron worked as a production manager and literary director for various documentary production companies. Later, she transitioned into directing. Her first film, \"Students, All to the Factory! - Journeys of Working-Class Maoists,\" was made in 2018. In this documentary, she interviewed former Parisian students who, after the events of May 1968, went to work in factories.Étudiants, tous à l'usine ! - Itinéraires de maoïstes ouvriers on filmdocumentaire.fr In 2020, she co- directed a documentary with Aurélien Bonnet on medically assisted reproduction. Given that both Lise Baron and Aurélien Bonnet had personal experiences with assisted reproduction, they explored their own journey and compared it to that of several other couples. In 2021, she completed her fifth documentary, focusing on Marguerite Duras as a writer while also delving into her role as a filmmaker and the political aspects of her character. ==Filmographyfilmography Lise Baron on filmdocumentaire.fr== *2018 : Étudiants, tous à l'usine ! - Itinéraires de maoïstes ouvriers *2018 : La traite atlantique, archipel de la mémoire *2019 : Erika, au nom de la mer *2020 : Éprouvantes éprouvettes, réalisation de Lise Baron et Aurélien Bonnet *2020 : Marguerite, l'écriture et la vie *2022 : Dans nos prisons, histoire d'une lutte *2023 : les Années sida, à la mort, à la vie ==Distinction== *2023 : Grand Prize of Jury at Justice Documentary Festival ParisFESTIVAL DU DOCUMENTAIRE SUR LA JUSTICE : UN GRAND SUCCÈS POUR LA PREMIÈRE ÉDITION À LA MAISON DU BARREAU on avocatparis.org == References == ==Others links== *Grégory Marin Lise Baron : « Réactiver l’histoire du sida, c’est rappeler qu’il existe toujours » on L'Humanité *Bérénice Rocfort-Giovanni « les Années sida, à la mort, à la vie », la peste et le choléra on L'Obs Category:Living people Category:Year of birth missing (living people) Category:French filmmakers Category:French movie directors",
 "title": "Lise Baron"
}