{
 "id": "1056243",
 "text": "This is a list of official and unofficial terms used to describe the citizens of specific states, federal district, and territories of the United States of America. ==List== State Recommended by US GPO Others Official Unofficial Old Non-English Alabamian Alabaman Safire reports that after he used the word \"Alabaman\" in a column, he received a letter from Vic Gold that said in part, \"The natives, I have learned to my sorrow, prefer Alabamian.\" Alaskan American Samoan Arizonan Arizonian Arkansan Arkansasan, Arkansawyer, Arkie Californian Prune Picker, Californios Coloradan Coloradoan Connecticuter Connecticotian, Connecticutensian, Nutmeg, Nutmegger Delawarean Blue Hen's Chicken, Muskrat Washingtonian Floridian Alligator, Fly-Up-the-Creek Georgia Georgian Buzzard, Cracker, Goober-grabber Guamanian Hawaii resident Islander, Kamaʻāina. The Associated Press Stylebook restricts use of \"Hawaiian\" to people of Native Hawaiian descent. Idahoan Illinoisan Illinoisian, Illinoian, Flatlander, Sucker, Sand-hiller, Egyptian Hoosier Indianan (former GPO demonym replaced by Hoosier in 2016), Indianian (archaic) Iowan Hawkeye Kansan Grasshopper, Jayhawker, Sunflower Kentuckian Corncracker, Kentuckyan Louisianian Louisianan Mainer Down Easter or Downeaster, Mainiac, (term used in reference to Maine author Kenneth Roberts) Yankee (rare) Marylander Massachusettsan Bay Stater (official term used by state government) and Citizen of the Commonwealth (identifier used in state law): \"Bay Staters shall be the official designation of citizens of the commonwealth.\" Massachusettsian, Massachusite, Masshole (derogatory as an exonym; however, it can be affectionate when applied as an endonym) Michiganian Michigander, Wolverine, Michiganite, Yooper/Troll (for residents of the Upper Peninsula and Lower Peninsula, respectively), Michigoose (used specifically for female residents, as a play on \"Michigander\") Minnesotan Minne Mississippian Missourian Missouran Montanan Nebraskan Bugeaters (fake) or Cornhuskers Nevadan New Hampshirite New Hampshireman or New Hampshirewoman, Granite Stater, Granite Boys New Jerseyan New Jerseyite New Mexican , Neomexicano definition by Royal Spanish Academy (Real Academia Española) New York New Yorker KnickerbockerNew York Knicks, What's a Knickerbocker? North Carolinian Tar Heel, Tar Boiler North Dakotan Mariana Islander Ohioan Buckeye Ohian Oklahoman Okie, Sooner Oregonian Pennsylvanian Penn, Quaker, Pennamite Pennsylvania Dutch: Pennsylvanier Puerto Rican Boricua Rhode Islander Swamp Yankee South Carolinian Sandlapper South Dakotan Tennessean Volunteer, Butternut Big Bender Texan Texian (Anglo-Texan - historical), Tejano (Hispano-Texan), Texican (archaic) Utahn Utahian, Utahan Vermonter Woodchuck Virgin Islands Virgin Islander Virginian Washington Washingtonian West Virginian Mountaineer Wisconsinite Badger, Cheesehead, Sconnie, Wisconsonian, Wisconsese Wyomingite Wyomese, Wyomingian ==Related pages== * Demonym ==References== Demonyms Category:American regional nicknames United States",
 "title": "List of demonyms for US states and territories"
}