{
 "id": "1056299",
 "text": "Aaron Charles Donald (born May 23, 1991) is an American football defensive tackle for the Los Angeles Rams of the National Football League (NFL). He played college football at Pittsburgh. ==Early life== Donald, originally from Pittsburgh, is one of three children of Archie Donald and Anita Goggins. He grew up in the Lincoln-Lemington-Belmar neighborhood. His father introduced him to training to instill discipline in his life. Donald later admitted he was timid as a child. At the age of 12, he and his father would wake up at 4:30 AM and train for about two hours in the basement gym his father set up in their family home. Donald attended Penn Hills High School, where he played American football under Coach Ron Graham. He was selected for the All-State AAA first team twice during his final two seasons. ==College career== He studied at the University of Pittsburgh and played for the Pittsburgh Panthers. ===Statistics=== Pittsburgh Panthers Season GP Cmb TfL Sck Int FF 2010 13 11 3 2.0 0 0 2011 13 45 16 11.0 0 1 2012 13 64 18.5 5.5 0 1 2013 13 59 28.5 11.0 0 4 Total 52 179 66 29.5 0 6 ==Professional career== He was chosen as the 13th pick in the 2014 NFL Draft by the St. Louis Rams. ===2014 season=== In his rookie year, he accumulated 47 tackles and nine sacks. His nine sacks ranked him first among first-year players in the 2014 season. He was selected to the All-Rookie Team and made it to the Pro Bowl. His performance earned him the NFL Rookie of the Year award. ===2015 season=== In 2015, he started in all of his team's games. In 16 games, he recorded 69 tackles and 11 sacks, leading in the number of sacks by a defensive tackle and ranking eighth in sacks for the 2015 season. He was selected to the Pro Bowl for the second consecutive year. ===2016 season=== In the first game of the season, he was ejected for touching a referee while his team was clearly dominated by the San Francisco 49ers.. The player continued to improve and learn the league, despite his modest and shy personality and the Rams' poor performance, which was one of the worst teams in the NFL. At the end of the season, he was ranked by other players as the 15th best player in the NFL. However, he was frustrated by the season's outcome, which concluded with the firing of head coach Jeff Fisher. ===2017 season=== During the preparation for the 2017 NFL season, Aaron Donald put pressure on his team by intentionally missing preseason games. In early September, he returned to the Rams' facilities but had not signed the expected contract. He missed the season's opening game against the Indianapolis Colts, costing him 1.5 million dollars. Playing in a defensive position where his dominance is hard to measure statistically, Donald had a significant defensive impact throughout the season.. With power and discipline, he consistently pressured opposing offenses, even when double-teamed. ===2018 season=== A few days before the start of the 2018 NFL season, Aaron Donald signed a new six-year contract with the Los Angeles Rams, worth 135 million dollars, with 87 million guaranteed and a 40 million dollar signing bonus.. This made him the highest-paid defensive player in NFL history, but less than 24 hours later, Khalil Mack reclaimed that record by signing a 141 million dollar contract with the Chicago Bears. == References == Category:1991 births Category:Living people Category:Los Angeles Rams players Category:American football defensive tackles Category:Sportspeople from Pittsburgh",
 "title": "Aaron Donald"
}