{
 "id": "1056537",
 "text": "The 2024 Green Party presidential primaries are an upcoming series of elections in order to determine who the presidential nominee of the Green Party will be for the 2024 United States presidential election. The primaries will be concluded at the 2024 Green National Convention. == Candidates == === Declared candidates === Name Born Experience Home state Campaign Ref. Jill Stein May 14, 1950 (age 73) Chicago, Illinois Candidate for President of the United States in 2012 and 2016 Massachusetts Campaign \\----November 9, 2023 Jasmine Sherman August 17, 1985 (age 38) Queens, New York Executive Director of Greater Charlotte Rise North Carolina Campaign Febuary 18, 2022 FEC filing Randy Toler 1956 (age 66–67) Illinois Co-Chairman of the Green Party of Florida Perennial candidate Florida Campaign \\----August 3, 2021 FEC filing === Withdrew before primaries === Name Born Experience Home state Campaign Ref. Emanuel Pastreich (age ) Nashville, Tennessee President of the Asia Institute Academic, author and expert in international relations September 11, 2023 (withdrew on September 28, 2023) Running for Green Party of Alaska Nomination. Cornel West June 2, 1953 (age 70) Tulsa, Oklahoma Academic scholar and activist California Campaign \\----June 14, 2023 (withdrew on October 5, 2023) Running as an Independent FEC filing == Debates and Forums == Forums among candidates for the 2024 Green Party U.S. presidential nomination Date Place Host Participants P Participant. I Invitee. A Absent. N Confirmed non-invitee. O Out of race (exploring, suspended, or not yet entered) Davis Sherman Stein Zavala Others January 12, 2024 Virtual Green Party of Kansas P P A P P January 20, 2024 Worcester, MA Green-Rainbow Party P P P P P January 23, 2024 Philadelphia, PA Green Party of Philadelphia P P P P A February 20, 2024 Virtual Green Party of New York N P A P N == References == Category:Green Party of the United States Category:2024 United States presidential election",
 "title": "2024 Green Party presidential primaries"
}