{
 "id": "1056325",
 "text": "Manuel Alfonso Andrade Oropeza (born November 3, 1989) is a Mexican professional wrestler. He currently wrestles for WWE on the Raw brand under the ring name Andrade (formerly Andrade \"Cien\" Almas). He is also known for his time in All Elite Wrestling (AEW) under the ring name Andrade El Idolo. He also wrestled many years for Consejo Mundial de Lucha Libre (CMLL) and New Japan Pro-Wrestling (NJPW) under the ring name La Sombra. During his first run in WWE from 2015 to 2021, Andrade was a one-time NXT Champion and one-time United States Champion. ==Career== ===All Elite Wrestling (2021-2023)=== On the June 4, 2021 episode of Dynamite, Andrade El Idolo made his debut for All Elite Wrestling (AEW). Vickie Guerrero interrupted a segment between Tony Schiavone and Mark Henry and introduced Andrade. Andrade made his AEW in-ring debut on July 7 at Road Rager where he defeated Matt Sydal. On the July 14 episode of Dynamite, Andrade would replace Vickie with his new Executive Consultant Chavo Guerrero. On the September 10 episode of Rampage, Andrade would attack Chavo after winning a ladder match against Pac. On the October 6 episode of Dynamite, Andrade would compete in a Casino Ladder match to determine to number one contender for the AEW World Championship. The match was eventually won by \"Hangman\" Adam Page. On the Feburary 23 episode of Rampage, Andrade would face Sammy Guevara for the AEW TNT Championship but lost. He would have a rematch on the March 4 episode of Rampage in a three-way match also involving Darby Allin but lost again. On the June 8 episode of Dynamite, Andrade would enter the Casino Battle Royal to determine the second contender for the interim AEW World Championship. He would make it to the final three but was accidently thrown out by the eventual winner Kyle O'Reilly. Andrade would enter the tournament to crown the first AEW World Trios Champions alongside his La Faccion Ingobernable teammates Dragon Lee and Rush. They would lose in the first round against the eventual tournament winners The Elite (Kenny Omega and The Young Bucks). In late 2023, Andrade began a feud with Miro, who was managed by his wife CJ Perry. Andrade would later lose his last AEW match to Miro at AEW Worlds End on December 30. Perry costed him the match. His contract expired at the end of 2023, which was confirmed by Tony Khan in a press conference after the show. ===Return to WWE (2024–present)=== Andrade made his WWE return on January 27, 2024 at the Royal Rumble as a surprise entrant in the men's Royal Rumble match. He was then put on the Raw brand.https://www.pwinsider.com/article.php?id=179812 ==Personal life== Andrade is a third-generation professional wrestler. His father wrestled under the name Brillante and his grandfather wrestled as El Moro. He is married to WWE superstar Charlotte Flair and his father-in-law is Ric Flair. == Championships and accomplishments == *CBS Sports **NXT Match of the Year (2018) * Consejo Mundial de Lucha Libre ** CMLL Universal Championship (2011) ** CMLL World Tag Team Championship (1 time) – with Volador Jr. ** CMLL World Trios Championship (1 time) – with Máscara Dorada and La Máscara ** Mexican National Trios Championship (1 time) – with El Sagrado and Volador Jr. ** NWA World Welterweight Championship (1 time) ** NWA World Historic Middleweight Championship (1 time) ** NWA World Historic Welterweight Championship (2 times) ** La Copa Junior (2012) ** Cuadrangular de Parejas (2014) – with Omar Brunetti ** Reyes del Aire (2013, 2015) ** Torneo Corona (2008) – with Metalik ** Torneo Gran Alternativa (2007) – with Místico ** Torneo Nacional de Parejas Increibles (2013) – with Volador Jr. ** CMLL Bodybuilding Contest (2012 – Advanced) ** CMLL Tag Team of the Year (2009) – with Volador Jr. ** CMLL Technico of the Year (2010) ** CMLL Trio of the Year (2010) – with Máscara Dorada and La Máscara * Lucha Libre Azteca ** Azteca Championship (1 time) * New Japan Pro-Wrestling ** IWGP Intercontinental Championship (1 time) *Pro Wrestling Illustrated ** Ranked No. 13 of the top 500 singles wrestlers in the PWI 500 in 2018 * WWE ** NXT Championship (1 time) **WWE United States Championship (1 time) **NXT Year-End Award for Match of the Year (2018) *International Open Challenge World Championship **IOCW Championship (1 time) == References == ==Other websites== * * Category:1989 births Category:Living people Category:All Elite Wrestling alumni Category:WWE wrestlers Category:Mexican professional wrestlers Category:People from Durango",
 "title": "Andrade El Idolo"
}