{
 "id": "1056248",
 "text": "Marek Witold Suski (born June 11, 1958 in Grójec) is a Polish politician. He has been a member of the Sejm in the fourth through ninth terms. From 2017 to 2019, he was the head of the Political Cabinet of the Prime Minister. He is a member of Law and Justice party. == Early life and career == Suski is a son of Janusz and Alina. His paternal ancestors had the Pomian coat of arms. He is a graduate of the Post-Secondary Vocational School of Theater Techniques in Warsaw. For a year he was employed at the Grand Theater in Warsaw . Then to the early 1990s. he worked in a craftsman's workshop. From 1993 to 1996 he headed the Regional Cultural Center in Tarczyn . In the years 1997–1999 he was the director of the branch of Jarosław Kaczyński's parliamentary office in Radom, then he worked in the joint-stock company \" Srebrna \". He co-founded the Center Agreement, then Law and Justice . He ran unsuccessfully as a PC MP in 1991 and 1993. He was elected as an MP from the PiS (LnJ) list in the 2001 and 2005 elections. In the Sejm of the 5th term, he sat on the Rules and Deputies' Affairs Committee (from November 3, 2005 as its chairman), the State Treasury Committee, and also in extraordinary committees. In 2006, he became an honorary member of the World Association of Home Army Soldiers. In the 2007 parliamentary elections, he won a parliamentary seat for the third time, receiving 29 497 votes in the Radom constituency. In 2008, the Presidium of the Sejm removed him from the position of vice-chairman of the Rules and Deputies' Affairs Committee due to disciplinary punishment by the Deputies' Ethics Committee for one of his statements from the Sejm tribune. In the 2011 Sejm elections, he successfully ran for re-election and got 17 251 votes. In 2015, he was re-elected to the Sejm, receiving 36 542 votes. On July 22, 2016, he became vice-chairman of the investigative commission for Amber Gold. On December 19, 2017, Prime Minister Mateusz Morawiecki appointed him as the head of the Political Cabinet of the Prime Minister with the rank of secretary of state in the Chancellery of the Prime Minister, replacing Elżbieta Witek in this function. In the 2019 elections, he was elected MP of the 9th term, receiving 69 141 votes. In November 2019, Marek Suski became vice-chairman of his Parliamentary Club, chairman of the Energy and State Treasury Committee and vice-chairman of the Culture and Media Committee. Therefore, he ended his government function. In 2021, he became the chairman of the Program Council of Polish Radio and a member of the Council of Political Advisors established by Prime Minister Mateusz Morawiecki. In the 2023 elections, he kept his parliamentary mandate(with 37 853 votes). . == Footnotes == * * Category:1958 births Category:Living people Category:Polish politicians",
 "title": "Marek Suski"
}