{
 "id": "1056506",
 "text": "Grigory Khristoforovich von Zass (1797–1883; ) was a Russian Imperial general. He commanded Russian cavalry troops in the Napoleonic Wars and Russo- Circassian War.Щербина Ф. А. История Армавира и черкесо-горцев. — Екатеринодар: Электро-тип. т-во «Печатник», 1916. He became well known for his genocidal actions against the Circassians. It was said that he thought they were a \"lowly race\". He was the founder of the city of Armavir, Russia. In 2003, the Russian Federation controversially built a statue of him on former Circassian territories where the Circassian genocide happened. This made Circassians and Circassian nationalist establishments very mad. ==Racist views== Zass thought Circassians were not as good as the \"European Race,\" He thought German and Russian people were much better groups of people . He thought that the only way to deal with the Circassians was to scare them away \"just like wild animals\". He kept a box under his bed with Circassian body parts. Zass supported using very bad military methods when dealing with Circassians. These included burning people alive, cutting off heads for enjoyment, burning entire villages to the ground, spreading epidemics on purpose, and rape of children.Ibid., p. 420. == War crimes and genocidal actions == === Methods of massacre of Circassians === Colonel Grigory Zass was a major figure in the Circassian genocide. He was involved with ethnic cleansing. The methods he had the soldiers use included methods burning Circassian villages and causing epidemics. It is estimated that 70% of the East Circassian population died in the process. Zass had Circassian heads cut off. He sent these heads to his friends in Berlin. These friends were professors who used the heads to study anatomy. He also had heads outside of his tent on lances on a hill. Russian soldiers and Cossacks were paid for sending Circassian heads to Zass. Zass also killed Circasians in large numbers by burning Circassian villages with the people in them. He told the soldiers to rape Circassian women and children. === Torture === Zass would pick random Circassian males from the towns he attacked. He would burn the men alive as a form of entertainment. He also had the bellies of pregnant women cut with bayonets. === Advocacy of genocidal rape === Zass supported genocidal rape. His soldiers raped Circassian girls during the 1877 Russo-Turkish war. Zass worked with a German officer in the Russian army named Georg Andreas von Rosen during the genocide against the Circassians. Zass wrote letters to Rosen. In them, he said that he ordered Cossacks to kill Circassian civilians. == References == Category:1797 births Category:1883 deaths Category:Russian military people Category:Russian nobility Category:German nobility Category:Mass murder in Europe",
 "title": "Grigory Zass"
}