{
 "id": "1056784",
 "text": "LSV (Luftwaffensportverein) Markersdorf was a football club in Austria (then Ostmark) during the time of Nazi occupation. ==History== The club was founded in 1939. In the 1941/42 season the club played in the Gauliga Niederdonau. The championship was decided at the time using the knockout system. After MSV Brünn was defeated 2-1 in the semi-finals and 1. Wiener Neustädter SC 5-3 in the final, the team qualified for the promotion games to the the highest league in Eastern Mark at the time . LSV lost both games against the champions of the two Vienna 1st classes SG Reichsbahn Wien and Wiener AC. At that time, the air force base also served as a “reception camp” for enlisted football players. They were transferred there by their parent clubs. Austrian team players like Karl Durspekt (SK Admira Wien), Karl Sesta (Austria Wien), Lukas Aurednik (Rapid Wien), Adolf Huber (Austria Wien), Max Merkel (Wiener Sport- Club) and German team players like Walter Dzur (Dresden SC), Paul Zielinski (Hamborn 07) and Hiltrop (Hannover 96). With the class that these players brought with them, the rise of LSV Markersdorf was inevitable. In the game for the title in the Gauliga Niederdonau 1942/43, LSV Wiener Neustadt was defeated in the semifinals and RSG Wiener Neustadt in the final. In the promotion games to the Gauliga Donau-Alpenland, the Luftwaffe athletes met the Styrian champions Kapfenberger SC and the Carinthian champions Villacher SV. With a goal difference of 18:6 with three wins and only one defeat, they were promoted to the highest East Mark league. There they achieved a sensational sixth place in 1943/44, ahead of clubs like SK Rapid Vienna and Wacker Vienna. Due to the war, more and more players had to do military service. So the club had to withdraw from the league at the end of the season and was dissolved. After the war a new club (SC Markersdorf) was founded on 5 November 1945 which still plays in the lower clases of Lower Austria. Category:Austrian football clubs Category:Football clubs of Lower Austria Category:Defunct football clubs Category:1939 establishments in Europe Category:1930s establishments in Austria Category:1944 disestablishments Category:1940s disestablishments in Europe",
 "title": "LSV Markersdorf"
}