{
 "id": "1056015",
 "text": "Abdul Latif Rashid (; born 10 August 1944), also known as Latif Rashid () is an Iraqi Kurdish politician. He became the 9th President of Iraq in 2022. He defeated incumbent President Barham Salih in the 2022 presidential election.\"Iraqi parliament elects Abdul Latif Rashid as new president\", Al Jazeera, 13 Oct 2022. ==Biography== Education and Professional Career Abdel Latif Rachid, born in 1944 in Souleimaniye, is of Kurdish origin. He's an active member of the Patriotic Union of Kurdistan (PUK), led by former President Jalal Talabani, who is also his brother-in-law. Rachid studied in a British A-Levels high school in North Wales. He holds a Bachelor of Science in civil engineering from the University of Liverpool (1968) and earned a Master of Science (1972) and a Ph.D. (1976) in engineering from the University of Manchester. Rachid is a certified engineer and a member of the Institution of Civil Engineering and the International Commission on Irrigation and Drainage (ICID). He worked as an independent consultant on irrigation and drainage projects and collaborated with the Water Engineering Administration. He has been involved in various engineering, agricultural development, and Kurdish and Iraqi leadership programs and organizations. Previously, he worked as a senior project manager for the United Nations Food and Agriculture Organization (UNFAO) in Yemen and Saudi Arabia. Since 1986, he has served as the representative of the Patriotic Union of Kurdistan in the United Kingdom and as the spokesperson for the Kurdistan Front. He is married to Chanaz Ibrahim Ahmed and has two sons and a daughter. ==Political Career== In 1992, Rachid was elected Vice President and an executive member of the Iraqi National Congress (INC), and in 1998, he was elected to the INC's board. As the Minister of Water Resources from September 2003 to December 2010, Rachid managed various portfolios, including irrigation, municipal and industrial water supply, hydroelectricity, flood control, environmental requirements, and marshland restoration. After the overthrow of Saddam Hussein's regime in April 2004, the Minister oversaw significant improvements in the country's water resource management. In addition to his technical qualifications and commitments, Rachid actively participated in Kurdish and Iraqi politics. He attended numerous conferences and official meetings on behalf of Kurdish political parties and Iraqi opposition groups under Saddam Hussein's regimes. Rachid also represented Kurdish politics and Iraqi opposition groups in official meetings with various international institutions and governments He served as a presidential adviser from 2010. ==2022 Presidential Election== After several months of deadlock during the 2022 Iraqi presidential election, leading to the threat of early elections and clashes between Sadrists and the armed forces resulting in over thirty deaths in August, the crisis finally came to an end in October. The PDK agreed to support the compromise candidacy of Abdel Latif Rachid, a PUK member running as an independent with the support of the Kurdistan Democratic Party (PDK). This allowed the newly elected president to appoint a prime minister and finally establish a government after a year of waiting. Abdel Latif Rachid was elected in the second round, defeating the incumbent President Barham Saleh during the session held on October 13, 2022. A member of the PUK and closely associated with its founder Jalal Talabani, Abdel Latif Rachid had been a presidential advisor since 2010, following seven years as the head of the Water Management Ministry. At the age of 78, his extensive experience in Iraqi politics and his ability to maintain good relations with politicians from both the Shiite and Sunni political communities garnered support from various factions. ==President of the Republic== He took the oath of office on October 17 and entrusted former Minister of Human Rights Mohammed Shia' Al Sudani with the task of forming a government. ==References== Category:1944 births Category:Living people Category:Presidents of Iraq Category:Current national leaders",
 "title": "Abdul Latif Rashid"
}