{
 "id": "1056772",
 "text": "Skaugum is an estate. Haakon VI of Norway and Mette-Marit lives there. It is in Asker, Norway which is away from Oslo. The estate is big, of it are farms. == History == The estate belonged to a church in the Middle Ages. Many people owned it over the years, but in 1909 Fritz Wedel Jarlsberg bought it. Then, when Crown Prince Olav and Crown Princess Märtha got married in 1929, Wedel- Jarlsberg sold it to them. In 1937, Prince Harald was born there. The house that Wedel-Jarlsberg had, which looked like a Swiss chalet, burned down in 1930. An architect named Arnstein Arneberg built a new one on the same spot, using the old foundations. They used stone to build it, so it wouldn't catch fire again. === Second World War === During World War II, Nazi soldiers stayed at Skaugum. Then, the estate became the official home of a man named Reichskommissar Josef Terboven in June 1940. After Hitler died, Terboven lost his job and killed himself there in 1945. === Residence of the heir apparent === In 1968, King Olav V gave the estate as a wedding gift to his son, King Harald V, and his wife, Crown Princess Sonja. The King moved to the Royal Palace in Oslo. King Harald did the same thing, giving the estate to his son, Crown Prince Haakon, and his wife, Crown Princess Mette-Marit, when they got married in 2001. Skaugum is different from the Royal Palace because it's privately owned by the royal family. It's not open to the public. Like other royal homes in Norway, there are Royal Guards there to protect it. == Gallery == File:Skaugum 1921.jpg|The original Skaugum building before the fire in 1930 File:1385. Kronprinsparets bolig. Skougum, Norge. Flyvefoto - no-nb digifoto 20150629 00002 bldsa PK21842.jpg|Skaugum from the air File:Kongefamilien på Skaugum 1974 (5476890347).jpg|The royal family at Skaugum in 1974 File:Skaugum.jpg|Skaugum from the estate garden File:Skaugum gard.jpg|Skaugum seen from the west == References == Category:Palaces",
 "title": "Skaugum"
}