{
 "id": "1057577",
 "text": "Heinrich Körner (born Heinrich Krczal, 2 July 1893 – 8 December 1961) was an Austrian football player and coach. ==Career== Born as Heinrich Krczal, the player joined SK Rapid Wien at the age of 14. He soon came into the reserves through the youth team and, after left winger Ferdinand Wolf's retirement, also into the first team. There he formed the left attack side with Leopold Grundwald. When the first championship title was played in 1911/12, the two played a key role in reaching the title. Krczal was a regular player until the outbreak of war and only played sporadically during the war years before he regularly took his place in the forward line again. During these years three more championship titles were won. In 1919, however, the player who was most recently used as a center forward lost his place in the first team. So he went to Wiener Amateur SV. He also took on the name Körner at this time. He only stayed for a few months and returned to Rapid during the season. He won two more championship titles and a cup victory. ==International== He made his debut for the Austrian national football team on 15 June 1913 in Vienna in a 2-0 win against Italy. He was part of the team until the start of the war. In 1918 he returned to the team and played his last match on 9 May 1918 in a 5-1 win against the Swiss team .ÖFB Players profile ==Manager== After his active career, he started a coaching career in 1921. He worked nainly in Germany. There he became known as Heinz Körner. His first clubs were Union Gelsenkirchen, Stuttgarter Kickers , Fola Esch and Wiener AF in 1923. There he was playing coach. The club with which his coaching career is most closely linked is Fortuna Düsseldorf. He started in 1924. After a short break with with 1. FSV Mainz 05 in the summer of 1925 , he led the team to win the district championship for the first time in 1927 and led to participation in the German championship for the first time. After leaving the club in 1928 he returned to Düsseldorf in 1931, where he led Fortuna to the greatest success in the club's history in 1933. They won the German championship when Schalke 04 was beaten 3-0 in the final . In the mid-1930s Körner worked in the Switzerland. In the 1937/38 season he was coach at FC Bayern Munich. After a short time at Union 02 Hamborn, he looked after Fortuna Düsseldorf for the fourth time. He looked after them one last time between 1951 and 1953 in the Oberliga West. During those years, Toni Turek, the 1954 world champion was part of his team.Werner Raupp: Toni Turek – „Fußballgott“. Eine Biographie, Hildesheim: Arete Verlag 2019 (ISBN 978-3-96423-008-9), S. 83–89. (German) Körner also worked as a coach at Kölner BC, Rot-Weiß Oberhausen, SV Borussia Wuppertal, Rot-Weiss Essen and TuRU Düsseldorf. After his return to Austria, he worked as a sports teacher and was chairman of the Austrian sports teachers' association and looked after the ESV Westbahn Linz, ASK Sparta Linz, E-Werk Wien and the second division team SV Wimpassing. == Honours== === Player=== * Austrian Champion : 1912 , 1913, 1916, 1917, 1919, 1920, 1921 * Austrian Cup: 1920 === Manager=== * German Champion: 1933 * Gauliga Niederrhein: 1939, 1940 ==References== Category:1893 births Category:1961 deaths Category:Association football forwards Category:Austrian footballers Category:SK Rapid Wien players Category:FK Austria Wien players Category:Players of the Austrian national football team Category:Austrian football forwards Category:Austrian football champions Category:Austrian football managers Category:FC Bayern München managers",
 "title": "Heinrich Körner"
}