{
 "id": "1057773",
 "text": "William Morrissey (born August 16, 1986) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and competes under the ring name Big Bill as a member of The Learning Tree. Morrissey is also known for his time with the WWE where he wrestled under the ring names Colin Cassady and Big Cass, as well as his time in Impact Wrestling where he wrestled under W. Morrissey. In WWE, he was known for being in a tag team with Enzo Amore. In AEW, Morrissey has been a one-time AEW World Tag Team Champion. ==Career== ===All Elite Wrestling=== On the May 4, 2022 episode of Dynamite, Morrissey made his debut in All Elite Wrestling (AEW) as MJF's mystery opponent for Wardlow. He faced Wardlow but lost. In August 2022, it was reported that Morrissey had signed a contract to be a member of the All Elite Wrestling roster. He then joined Stokely Hathaway's stable The Firm. On the December 9 episode of Rampage, Morrissey and Lee Johnson defeated the team of Clayton Bloodstone and Izzy James. This was his first victory in AEW. On the Feburary 13, 2023 episode of Dark: Elevation, Morrissey, now wrestling as Big Bill, defeated Gino and got his first singles victory in AEW. On the March 1 episode of Dynamite, Bill challenged Orange Cassidy for his AEW All-Atlantic Championship but lost. At Double or Nothing on May 18, Bill competed in a 21-man Blackjack Battle Royal for the same title, now renamed the AEW International Championship. The match was won by Orange Cassidy. On the July 21 episode of Rampage called Royal Rampage, Bill entered the Royal Rampage match to determine the number one contender for the AEW TNT Championship, but it was won by Darby Allin. Bill then teamed with Brian Cage and they won a AEW World Tag Team Championship number one contendership Battle Royal on the July 28 episode of Rampage. They went on to face FTR (Dax Harwood and Cash Wheeler) for the AEW World Tag Team Championships but lost. On the September 13 episode of Dynamite, Bill challenged Jon Moxley for the AEW International Championship but lost. On the October 7 episode of Collision, Bill and Ricky Starks defeated FTR for the AEW World Tag Team Championships. This was Bill's first championship in a major promotion. On the February 7, 2024 episode of Dynamite, Big Bill and Starks lost the championships to Sting and Darby Allin. ==Personal life== He is married to AEW backstage commentator and Diamond Dallas Page's step-daughter Lexy Nair. == Championships and accomplishments == * All Elite Wrestling ** AEW World Tag Team Championship (1 time) – with Ricky Starks * Pro Wrestling Illustrated ** Ranked No. 94 of the top 500 singles wrestlers in the PWI 500 in 2017 * Rolling Stone ** Ranked No. 10 of the 10 best WWE wrestlers of 2016 * World of Unpredictable Wrestling ** WUW North American Championship (1 time) * WWE ** NXT Year-End Award for Tag Team of the Year (2015) == References == ==Other websites== * Category:1986 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from New York City Category:Total Nonstop Action Wrestling alumni",
 "title": "W. Morrissey"
}