{
 "id": "1057091",
 "text": "Ariya Daivari (; born April 11, 1989) is an Iranian American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and competes under the ring name Ari Daivari. Fox has also wrestled for the WWE, Ring of Honor (ROH), New Japan Pro-Wrestling (NJPW), and the National Wrestling Alliance (NWA). ==Career== ===All Elite Wrestling=== On the November 12, 2021 episode of Rampage, Daivari made his debut in All Elite Wrestling (AEW). He faced Dante Martin but lost. He would then begin to team with Invictus Khash. They would lose The Dark Order and Top Flight. Daivari would join a stable with Parker Boudreaux and Slim J called The Trustbusters. On the August 19 episode of Rampage, The Trustbusters would enter into a tournament to crown the first AEW World Trios Champions. They would face Best Friends (Chuck Taylor & Trent Beretta) and Orange Cassidy in the first round but would be defeated. On the September 6 episode of Dark, Daivari would challenge Claudio Castagnoli for the ROH World Championship but would lose. At Grand Slam, Daivari competed in a 25-man Golden Ticket Battle Royale to determine who would become the number one contender for the AEW World Championship but the match was eventually won by \"Hangman\" Adam Page. On the October 21 episode of Rampage, he had a match against Hook for the FTW Championship but lost. The Trustbusters would face Dalton Castle & The Boys (Brandon & Brent) for the ROH World Six-Man Tag Team Championships on the November 7 episode of Dark: Elevation but lost. Daivari challenged Wardlow for his TNT Championship on the November 9 episode of Dynamite but lost. At Double or Nothing, Daivari competed in a 21-man Blackjack Battle Royal for the AEW International Championship but it was won by Orange Cassidy. ==Personal life== His brother is Dara and he is also a professional wrestler. He was known as Khosrow Daivari and Daivari in WWE. == References == ==Other websites== * Category:1989 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from Minneapolis",
 "title": "Ariya Daivari"
}