{
 "id": "10576",
 "text": "The House of Commons is the lower house of the Parliament of the United Kingdom. It is made up of Members of Parliament elected by the people. Sometimes it is called the 'lower house'. (The 'upper house' is called the House of Lords.) Other countries also have a bicameral parliament with a House of Commons working in the same way. In the British parliament, there are 650 Members of Parliament or MPs. Each MP represents a constituency, which covers an area of the country. The people of each constituency vote at a general election or a by-election to choose one person to represent them in the House of Commons. Usually, the people choose someone who belongs to a political party. When all the parties get together, the party or coalition with the most members is the government and runs the country. The leader of that party is called the Prime Minister. The House of Commons hold their meetings in the Palace of Westminster. Their chief officer is the Speaker of the House, who is elected by MPs. The current Speaker is Lindsay Hoyle, who was elected in 2019. The Clerk of the House of Commons is the Principal Adviser to the Speaker. The Serjeant-at-Arms is in charge of the security. == Election results since 1945 == Year Conservative Labour Liberal & SDP SNP Others 1945 197 393 12 0 38 1950 298 315 9 0 3 1951 321 295 6 0 3 1955 Winston Churchill resigns and Anthony Eden becomes Prime Minister 1955 345 277 6 0 8 1957 Anthony Eden resigns and Harold Macmillan becomes Prime Minister 1959 365 258 6 0 1 1963 Harold Macmillan resigns and Alec Douglas-Home becomes Prime Minister 1964 304 317 9 0 0 1966 253 364 12 0 1 1970 330 288 6 1 5 1974 297 301 14 7 16 1974 277 319 13 11 15 1976 Harold Wilson resigns and James Callaghan becomes Prime Minister 1979 339 269 11 2 14 1983 397 209 23 2 19 1987 376 229 22 3 21 1988 The Liberal and SDP parties merge and Form The Liberal Democrats Year Conservative Labour Lib Dems SNP Others 1990 Margaret Thatcher resigns and John Major becomes Prime Minister 1992 336 271 20 3 21 1997 165 418 46 6 24 2001 166 413 52 5 23 2005 198 355 62 4 23 2007 Tony Blair resigns and Gordon Brown Becomes Prime Minister 2010 306 258 57 6 23 2015 330 232 8 56 24 2016 David Cameron resigns and Theresa May becomes Prime Minister 2017 317 262 12 35 24 2019 Theresa May resigns and Boris Johnson becomes Prime Minister 2019 365 202 11 48 24 2022 Boris Johnson resigns and Liz Truss becomes Prime Minister 2022 Liz Truss resigns and Rishi Sunak becomes Prime Minister 2024 121 411 72 9 37 ==Notes== ==References == United Kingdom",
 "title": "House of Commons of the United Kingdom"
}