{
 "id": "1057684",
 "text": "Penny Hofstadter is a fictional character in The Big Bang Theory. Penny is played by Kaley Cuoco. == Penny in the First Episode == In the beginning of the show, a girl named Penny becomes a neighbour of Dr. Leonard Hofstadter and Dr. Sheldon Cooper. She says she moved from Nebraska to California to be an actress but could only be a waitress. Penny asks Sheldon to get her Television back from her old boyfriend Kurt and when they do he pantses them. == Leonard and Penny == In the first episode, Leonard falls in love with Penny and tries to get her to date him but she thinks he’s just a friend. When he asks her to date him, she thinks he’s inviting her to eat with him and his friends. When Leonard is goes to the North Pole, Penny worries about him and when he comes back they have sex. Penny asks Sheldon if she should date Leonard and Sheldon tells her about Schrödinger's cat. So she decides to date Leonard. == Bernadette == When Leonard and Penny start dating, Leonard asks her to find a girlfriend for Howard Wolowitz. So Penny introduces Howard to her friend Bernadette who is studying Microbiology. Then Howard and Bernadette date. == Breaking up with Leonard == When Leonard told Penny “I love you” but Penny didn’t say “I love you” to him, Wil Wheaton told her that it would be nicer just to break up with Leonard so she did. == Friendship with Amy == After Penny broke up with Leonard, Howard and Dr. Raj Koothrappali tried to convince Leonard to start to use the Internet to find a girlfriend. When he said no, they used to find a girl for Sheldon named Dr. Amy Farrah Fowler who has a Phd in Neurobiology. Amy and Penny become best friends. == One Night Stand With Raj == When Leonard starts dating Raj’s sister Priya, Raj and Penny get drunk and have sex with each other. == Getting back together with Leonard == After Leonard and Priya break up, Leonard and Penny start dating again. Howard asks Bernadette to marry him and she says yes. So Leonard asks Penny to marry him but she says no because he asked her while they were having sex. == Second Proposal == When Howard comes back from Outer space he and Bernadette go to a Restaurant with Leonard and Penny. Leonard asks Penny to marry him to make her old boyfriend jealous and she says no. They decide that Penny should be the one to ask Leonard to marry her when she’s ready. == Third Proposal == When Penny realizes that she hasn’t managed to become an actor she gets drunk and asks Leonard to marry her. He says no. == Professor Proton’s Funeral == After their friend Dr. Arthur Jefferies dies, Penny asks Leonard to marry her as a joke to “even up the score” and asks him twice. He says no. == Pharmaceutical sales == Bernadette gets Penny a job selling drugs for a Pharmacy. She makes twice as much money as Leonard does. She and Leonard decide to get married so they go to Las Vegas and get married. Category:Fictional characters introduced in 2007 Category:The Big Bang Theory characters",
 "title": "Penny (The Big Bang Theory)"
}