{
 "id": "1057679",
 "text": "Everything's Rosie is a British preschool children's television series created by Vickie Corner for CBeebies and Baraem. It is produced by V&S; Entertainment Ltd. The first episode was shown on CBeebies on 3rd May 2010. 104 episodes were made, as well as a controversial special episode titled \"When You Wish Upon An Oak\". The last episode was shown on CBeebies on 14th February 2017, and it left the channel on 29th March 2018. The YouTube Channel of Everything's Rosie puts up episodes every Wednesday, Friday and Sunday. == Episodes == == Characters == === Main Characters === * Rosie is a girl with colourful hair, a green button on top of her head, a white shirt and a stripy dress, sort of like a rag doll. Rosie goes around solving problems and sometimes loses her button. Rosie was voiced by Harriet Moran from Seasons 1 to 3 and Joanna Ruiz in Season 4. * Raggles is Rosie's friend. He is a blue plush toy with a big head and two big eyes, two big ears, and a yellow zip on his tummy. Raggles is supposed to look like a rabbit. He likes playing his whistle and being tickled by Rosie. Raggles is voiced by Emma Tate. * Will is a whiny and bossy boy. He has ginger hair, a red shirt, a blue collar, blue trousers and white shoes. Will is always talking rudely to everyone and nobody tells him off. Will likes driving his car called the \"Go-Speeder\" and playing football. Will's voice sounds like Horrid Henry, despite being voiced by Teresa Gallagher. * Bluebird is a selfish and obnoxious bird. Bluebird's body looks similar to Zazu from The Lion King. Bluebird has a blue body, a light blue tummy, a big red beak with a yellow stripe, big eyes, orange feet and 3 yellow ribbon-like tails. Bluebird constantly bosses people about and is always dramatic over simple tasks. She is voiced by Emma Tate. * Holly is a younger girl with blonde hair, a pink dress, a green button, pink shoes and a white spotty dress underneath. Holly wears a big purple bow with yellow polka dots on top of her head. Holly is shy but kind to everyone around her. Holly is voiced by Teresa Gallagher. * Big Bear is a big blue bear with an orange jumper. Big Bear is a bit clumsy from time to time, but loves to cook and build things for his friends. Big Bear is voiced by Wayne Forester. * Oakley is a wise old oak tree on top of the tallest hill in the series. Oakley is where the characters meet up most of the time. Oakley is voiced by Wayne Forester. === Other Characters === * Little Bear is Big Bear's nephew. He has orange fur and a red nose in Seasons 1 and 2 and a purple nose in Season 3. Little Bear has ginger hair, large eyes, a yellow shirt and big blue trousers. Little Bear is voiced by Teresa Gallagher. * Archie is a bubbly and loyal chameleon. Archie is red with a yellow face, big blue sparkly eyes, orange rings along his body, a blue stripe on his back and a pink tummy. Archie is kind and playful to everyone, and says \"Ay Caramba\" as his catchphrase. Archie is voiced by Wayne Forester. * Saffie is a cedar tree at the bottom of the place in the series. Saffie often makes up her own riddles and quotes to solve people's problems. Saffie is voiced by Teresa Gallagher. * The Little Acorns are three acorns with faces. The acorns say \"bouncy bouncy\" wherever they go, and they apparently like doughnuts, despite never being seen eating them. The acorns have a habit of jumping on Raggles's head. * Manny is a purple bird who has a similar appearance to Bluebird. Manny has a purple body, a plain red beak, yellow feet and 3 purple ribbon-like tails. Manny's tails are slightly shorter than Bluebird's, and Manny has a croaky voice. Manny likes to play pranks on everyone and has a good sense of humour. Manny is voiced by Wayne Forester. * Teal is a duck with a blue body, a yellow head, pink cheeks, an orange beak, a yellow tummy and three feathers on top of her head. Teal has thick eye-lashes and speaks in a Liverpool accent. Teal is voiced by Teresa Gallagher. * The Mordys are a family of dormice. They have yellow fur and light yellow tummies. The father has a yellow sailor's hat, and wears a red vest with yellow and blue stripes. The mother wears red shoes and has an oversized hat with a yellow/orange tassel. The daughter has a purple bow on her head and yellow ribbons under it, and the son has a cowlick. The Mordys are voiced by Wayne Forester and Teresa Gallagher. * The Dartys are two geckos. The male gecko is blue with a turquoise body and face and has orange spots; the female is purple with a pink body and face and has yellow spots. The Dartys like to shrug, and they like to sit in front of the flowerpots near Big Bear's garden. The Dartys are voiced by Wayne Forester and Teresa Gallagher. * Matt and Nat are two beavers. They live by a dam they built near the stream, and are good at building things. They are voiced by Wayne Forester and Emma Tate. Category:Television programs Category:2010s British television series Category:Children's television series",
 "title": "Everything's Rosie"
}