{
 "id": "1057945",
 "text": "Henryk Goldszmit, better known by his pseudonym Janusz Korczak ( 22 July 1878 or 1879unknown) was a Polish-born Jewish orphanage director and writer. He is also known by his nicknames Pan Doktor (\"Mr. Doctor\") and/or Stary Doktor (\"Old Doctor\"). == Biography == === Early life === Janusz Korczak was born as Henyrk Goldszmit on or 22 July 1878 or 1879. His birth certificate was never discovered (or it does not exist) so his precise birth date is undetermined. His father Jósef Goldszmit was a respected lawyer. Korczak's father Jósef died in a mental hospital on , after being admitted there six years earlier. == His well-pouplar act of courage and loyalty in the Warsaw Ghetto == The Second Polish Republic had been annexed by Nazi Germany beginning on 6 October 1939. In October 1940, a ghetto meant to imprison Jews was established in Warsaw, and all of the Jews from Warsaw, including Korczak and the children from his orphanage, lived there. A new orphanage was built for the children in the ghetto. The deportation of Jews from the ghetto began on 22 July 1942. On 5 or 6 August 1942 in the Warsaw Ghetto, Germans came to collect the orphans from Korczak's orphanage and staff members from the orphanage in order to transport them to Treblinka extermination camp, while Korczak had been offered a job in the ghetto. In a well-popular act of both courage and loyalty, Korczak courageously refused the offer and wanted to board the train with the children from his orphanage, and told the German officers: The children were dressed in their best clothing, and each carried a blue-colored backpack and a favorite book or toy. On the journey to the train station, one of the Schutzstaffel officers recognized Korczak as the writer of one of his favorite books. The officer offered Korczak to help him escape. But Korczak still refused. So, Korczak ended up boarding the train with the children and staff members to the Treblinka extermination camp. This act of courage and loyalty, is what made Korczak very famous and popular in the modern-day world. == Death == Though his death date is unknown, Janusz Korczak most likely died in the Treblinka extermination camp in August 1942, along with the children and staff members from his orphanage. Category:1870s births Category:1942 deaths Category:Polish Jews Category:Holocaust victims",
 "title": "Janusz Korczak"
}