{
 "id": "1057557",
 "text": "A spree shooting took place in Lewiston, Maine, United States on October 25, 2023. Nineteen people were killed and 13 others were injured in the double mass shooting. The first mass shooting happened at a bowling alley during a youth league event, and the second one happened just minutes later at a restaurant. The Androscoggin County Sheriff's Office shared a picture of the suspect, Robert Card. A few days later, his body was found in a forest, about from where the shooting happened. Card had killed himself. == Events == === Shootings === Around 7:15 p.m. EDT, there was a report of an active shooter at Sparetime Recreation, a family restaurant and bowling alley. Shortly after, there was another shooting at Schemengees Bar & Grille Restaurant, located about four miles away. There were reports of gunshots at a Walmart distribution center, but it turned out there was no shooting there. At about 8:00 p.m., the Androscoggin County Sheriff's Office and Maine State Police warned residents about an active shooter. The sheriff's office shared pictures of the shooter, who was carrying a powerful assault-style rifle. === Manhunt === On October 26, police in Lisbon found Card's abandoned vehicle near the Androscoggin River. They also issued an arrest warrant for Card, charging him with eight counts of murder. On October 27, authorities used dive teams and Sonar ROVs to search for underwater evidence near the vehicle. They were unsure how Card had escaped. The shelter-in-place order in Lewiston was lifted, but hunting restrictions were imposed in several areas. Later that evening, Card was discovered dead near his former workplace, a recycling center by the Androscoggin River in Lisbon, where he had been fired. His cause of death appeared to be a self-inflicted gunshot wound. The hunting restrictions were then lifted. == Perpetrator == The perpetrator was 40-year- old Robert Russell Card II (4 April 1983 – 27 October 2023), a resident of Bowdoin, Maine. He was identified by the police as the person they are looking for. The next day, they identified as the suspect. He was a sergeant first class in the United States Army Reserve and enlisted in December 2002. An Army spokesperson confirmed that Card was a reserve member without any active deployments. Card was formerly a student of Bowdoin Central School and later Mount Ararat High School in nearby Topsham. After graduating in 2001, he studied at the University of Maine from 2001 to 2004, but he did not complete his education. Before 2023, he had just one run-in with the law, a DUI arrest in 2007, to which he pleaded guilty, and two speeding tickets in 2001 and 2002. In July 2023, while training at West Point, service members alongside Card noticed his strange behavior and asked for law enforcement assistance. Card had mentioned hearing voices and making threats to \"shoot up\" a military base in Saco. The New York State Police responded, and he was taken to Keller Army Community Hospital at the academy, where he was committed for two weeks for a medical evaluation. Card's sister-in-law told NBC News that he began hearing voices around the time he got hearing aids. She explained that he was hearing unfamiliar voices and his thoughts were getting mixed up, which was very distressing for him. ==References== Category:2023 crimes in the United States Category:2023 mass shootings Category:2020s mass shootings in the United States Category:2020s murders in the United States Category:21st century in Maine Category:Attacks on buildings and structures in the 2020s Category:Attacks on buildings and structures in the United States Category:Attacks on restaurants 2023 shootings Category:Mass murder in 2023 Category:Mass murder in the United States Category:Massacres in the United States Category:Murder-suicides in the United States Category:October 2023 events Category:Suicide in the 2020s Category:Suicides in the United States",
 "title": "2023 Lewiston shootings"
}