{
 "id": "105758",
 "text": "Klaus Ebner (born August 8, 1964) is an Austrian writer of short stories, essays and poetry, and a translator. Born and raised in Vienna, he began writing at an early age. He started sending in stories to magazines in the 1980s, and also published articles and books about computer software after 1989. Ebner's poetry is written in German and Catalan. He is a member of several Austrian writers associations, including the Grazer Autorenversammlung. His works include cultural essays on Catalan topics, and stories about Jewish traditions. His first book of short stories was printed in 2007. In 2008, Ebner published the short novel Hominide. He has gotten several literary prizes, among them the Viennese Wiener Werkstattpreis in 2007. Austrian critics, such as Wolfgang Ratz, have praised Ebner's prose- style. The writer lives in Vienna with his family. == Biography == In the 1980s, he studied Romance languages, German and Translation at the University of Vienna. He also worked for a literary group and a magazine for literature in Vienna.Austrian National Library; see entries about the magazine Texte , Vienna 1983-1986. Afterwards he worked as a translator, language teacher and IT project manager. In the 1990s, he published articles and books about software and computer networks; these books were in German,The books were published by Data Becker, Markt & Technik, IWT, TEWI and Microsoft Press between 1989 and 2004. but he also wrote articles in English.NT Update, nr. 9, 10, 14, etc., xephon, London 1999-2002. In 2001 he wrote a university paper about islamism in Europe, which has been published later in Germany.Ebner, Klaus: Islamischer Fundamentalismus in der EU/Islamic Fundamentalism in the EU; essay (in German), GRIN Verlag, Munich 2001/2007, After school, Klaus Ebner has begun to write short stories, poetry and radio dramas. He usually published them in magazines of literature and culture. After the year 2004, he published literary texts much more often.See the anthology publication list on the official home page of the author www.klausebner.eu, which also tells the year of publishing. Today, Klaus Ebner is an author of fiction (novels, short stories), essays and poems. He writes poetry in German and Catalan. Supported by the Austrian government, he went to Andorra in 2007 and wrote an essay about the country in the Pyrenees.See Ebner, Auf der Kippe, p. 139 (biography). In 2007, Ebner's poem \"a paperman and sick\" became one of the Mentioned Poems at the International Poetry Prize Nosside. The jury spoke about the \"sadness in big cities\", which would be represented in the poem by a paperman whose \"meal consists of loneliness\".See Amoroso, Giuseppe: L'immaginario dei poeti del Nosside 2007 e il loro potere di esprimere il mondo, Città del Sole Edizioni , Reggio Calabria 2007; p. 41 (Italian version), p. 49f. (Spanish version), p. 58 (Portuguese version). The English translationEbner, Klaus: a paperman and sick, in: Amato, Pasquale and Mariela Johnson Salfrán: Nosside 2007, Città del Sole Edizioni, Reggio Calabria 2007, p. 113. of the poem goes as follows: English (by the author) Explanatory Simple English a paperman and sick forlorn in drunkenness the wheels are blocking clumsily his meal consists of loneliness its garnish is the yearning for the past beguiled by shouts of thunder hope that long ago has died a man of papers who is sick he is forgotten in drunkenness his wheels are blocking in an uncoordinated way his eating is loneliness together with the wish to see the times already passed he is confused by loud shouts hope that a long time ago has died In 2008 Klaus Ebner got the Wiener Werkstattpreis of 2007. The winning short story Der Flügel Last (The Burden of the Wings) shows a seven year old girl who has cancer. The story is told as if the girl would tell it herself. In the winning essay Was blieb vom Weißen Ritter? (What do we still have of the White Knight?), the reader learns about the novel from the Middle Ages Tirant lo Blanch by Joanot Martorell from Valencia. The author mixed his own reading experience with information from history and literature.Both texts have been published in the Prize anthology: Schaden, Peter (Ed.): wordshop x, FZA Verlag, Vienna 2008. Klaus Ebner is a member of the Austrian Writers' Associations Grazer Autorenversammlung (GAV)See the members' list of GAV, entry about Klaus Ebner. and Österreichischer Schriftstellerverband (ÖSV). == Style of writing == Ebner's short stories have many different topics, which, as critic Julia Rafael says, include actual and socially relevant problems. She describes the stories included in the anthology Lose as \"somewhat imploding\" and says that \"phantasms, irony and humor have their place, too\".Rafael, J.: Critic review of the book Lose, in: Literarisches Österreich nr. 1 (2008), page 27. Ebner's metaphors have been described as \"going beyond reality without losing ground\". The journalist Paul C. Jezek said, Ebner's writing style is characterized by very carefully chosen wording. Each sentence has a melody; his short prose especially sounds lyrical. Jezek compares Ebner's sentences to \"Japanese paintings – every word has been chosen with special care\".Seine Zeilen sind wie japanische Malerei: Jedes Wort ist sorgfältig gewählt. Club 1 Magazin nr. 54 (1988), page 11. Austrian writer and critic Wolfgang Ratz made a similar observation, underlining \"the accurateness of Ebner's speech\" and \"his love for formal details\", while pinpointing the sarcastic undertone of the critical stories.Ratz, W.: Critic review of the book Auf der Kippe, in: Literarisches Österreich nr. 2 (2008), pages 20-21. == Literary Prizes == * 2009 Travel Subsidy by the Austrian GovernmentAccording to the listing on the author's website , retrieved on 2009-02-12. * 2008 Two Subsidies for Literature by the Austrian GovernmentLiteraturhaus Wien, biography, retrieved on 2009-10-29. * 2008 Wiener Werkstattpreis 2007, ViennaSchaden, P. (Ed.) (2008): \"wordshop x\", FZA Verlag. * 2007 Travel Subsidy by the Austrian Government * 2007 Premio Internazionale di Poesia Nosside, Mention and publication in the anthology, Reggio CalabriaRefer to the listing of results of the Nosside Award Jury 2007 . * 2005 Feldkircher Lyrikpreis (4th)\"Lyrik der Gegenwart\", pages 81, 87 and 102-103. * 2004 La Catalana de Lletres 2004, Mention and publication in the anthology, BarcelonaCervera, J. (Ed.) (2005): \"la catalana de lletres 2004\", page 40, Cossetània Edicions, . * 1988 Erster Österreichischer Jugendpreis (Youth Prize for Literature) for the novel NilsClub 1 Magazin nr. 54 (1988), page 11. * 1984 Radio Play Award by the literary magazine Texte (3rd)Literary Magazine Texte 8, Vienna, March 1984, p. 33. The radio play is printed on the pages 27-33. All issues of the magazine Texte are archived by the Austrian National Library (Zeitschriftenarchiv) . * 1982 Erster Österreichischer Jugendpreis (Youth Prize for Literature) for the novella Das Brandmal/The StigmaClub 1 Magazin nr. 01 (1983). == Books == * Vermells/Shades of Red, poetry (in Catalan), SetzeVents Editorial, Urús 2009, * Hominide/Hominid; short novel (in German), FZA Verlag, Vienna 2008, * Auf der Kippe/On the brink; short stories (in German), Arovell Verlag, Gosau 2008, * Lose/Destinies; short stories (in German), Edition Nove, Neckenmarkt 2007, == Publications in anthologies (examples) == * /Dreams; short stories (in German), in: Junge Literatur aus Österreich 85/86, Österreichischer Bundesverlag, Vienna 1986, * /Coming Home; short story (in German), in: Ohnmacht Kind, Boesskraut & Bernardi, Vienna 1994, * /Iceland; poem (in German), in: Vom Wort zum Buch, Edition Doppelpunkt, Vienna 1997, * /Departure; short story (in German), in: Gedanken- Brücken, Edition Doppelpunkt, Vienna 2000, * /The Reason of All This; poem (in Catalan), in: La Catalana de Lletres 2004, Cossetània Edicions, Barcelona 2005, * /The Burial; short story (in German), in: Kaleidoskop, Edition Atelier, Vienna 2005, * /Wine Degustation; short story (in German), in: Das Mädchen aus dem Wald, Lerato-Verlag, Oschersleben (FRG) 2006, * /Routined; short story (in German), in: Sexlibris, Schreiblust Verlag, Dortmund (FRG) 2007, * /The City and the Sea; essay (in German), in: Reisenotizen, FAZ Verlag, Vienna 2007, == Notes == == Other websites == * Author's Information Website (mostly in German and Catalan, but with some literary text examples translated to English) * * Biography, Austrian Writer's Association Grazer Autorenversammlung * Author page from publisher Schreiblust, Germany * Wing father, English translation of a poem * Glimpses on a novel, English text * Reflektor, German story (in: Schreibkraft 13) * Selbsterklärend, German story (in: Schreibkraft 15) Category:1964 births Category:Living people Category:Austrian writers Category:Austrian poets",
 "title": "Klaus Ebner"
}