{
 "id": "1057763",
 "text": "{{Infobox video game | image = Sonic Superstars logo (Print).svg | designer = | artist = Daisuke Kojima | director = Shunsuke Kawaraduka | producer = | release = October 17, 2023 }} Sonic Superstars is a platform video game for the Nintendo Switch, PS4, PS5, Xbox One, and Xbox Series X and Series S that released on October 17, 2023. It uses 3D graphics but has the same gameplay as the 2D games from Sonic 1 to Sonic Mania. It is also the first mainline Sonic game to have co-op multiplayer. ==Plot== The game takes place somewhere in-between the events of Sonic & Knuckles and Sonic Adventure. Doctor Eggman travels to the Northstar Islands because he plans to turn the islands' giant animals into Badniks. Eggman has teamed up with Fang the Hunter and Trip the Sungazer, the second of which lives on the island and is disguised as a robot. Meanwhile, Sonic, Tails, Knuckles and Amy also go to the Northstar Islands to find out what Eggman is up to. Trip is treated poorly by Fang a lot, and is later abandoned by him. Amy finds Trip and befriends her. Later on, Trip stands up against Fang and reveals her Super form; a golden, fire-breathing dragon. Near the end of the game, Tails builds a space shuttle so that the team can go onto Eggman's space station and confront the doctor. They eventually defeat him and rescue the animals who live on the Northstar Islands. They forgive and make friends with Trip, who continues protecting the islands. ==Gameplay== Sonic Superstars is the first mainline Sonic game to have co-op multiplayer. Up to four players can play as Sonic, Tails, Knuckles or Amy, who each have different abilities. After beating the main story, an extra single-player story featuring Trip the Sungazer is unlocked. Category:2023 video games Category:Cooperative video games Category:Nintendo Switch games Category:Platform games Category:PlayStation 4 games Category:PlayStation 5 games Category:Sega video games Category:Side-scrolling platform games Category:Sonic the Hedgehog games Category:Video games developed in Japan Category:Windows games Category:Xbox One games Category:Xbox Series X and Series S games",
 "title": "Sonic Superstars"
}