{
 "id": "1058851",
 "text": "Double or Nothing (2022) was a professional wrestling pay-per-view show made by All Elite Wrestling (AEW). It took place on May 29, 2022 at T-Mobile Arena in Las Vegas suburb of Paradise, Nevada. It was the fourth Double or Nothing event held by AEW. The main event saw CM Punk defeat \"Hangman\" Adam Page to win the AEW World Championship. Stokely Hathaway, Athena, and Rush all made their AEW debuts during the show. ==Matches== No. Results Stipulations Times 1 Hookhausen (Hook and Danhausen) defeated Tony Nese and \"Smart\" Mark Sterling Tag team match 5:20 2 Wardlow defeated MJF Singles match 7:30 3 The Hardys (Jeff and Matt Hardy) defeated The Young Bucks (Matt and Nick Jackson) (with Brandon Cutler) Tag team match 19:15 4 Jade Cargill (c) defeated Anna Jay Singles match for the AEW TBS Championship 7:25 5 The House of Black (Malakai Black, Buddy Matthews, and Brody King) defeated Death Triangle (Pac, Penta Oscuro, and Rey Fénix) (with Alex Abrahantes) Six-man tag team match 15:35 6 Adam Cole defeated Samoa Joe Men's Owen Hart Foundation Tournament Final 12:30 7 Dr. Britt Baker, D.M.D. defeated Ruby Soho Women's Owen Hart Foundation Tournament Final 13:20 8 American Top Team (Ethan Page, Scorpio Sky, and Paige VanZant) (with Dan Lambert) defeated Frankie Kazarian, Sammy Guevara, and Tay Conti Six-person mixed tag team match 12:30 9 Kyle O'Reilly defeated Darby Allin Singles match 9:50 10 Thunder Rosa (c) defeated Serena Deeb Singles match for the AEW Women's World Championship 16:55 11 The Jericho Appreciation Society (Chris Jericho, Daniel Garcia, Jake Hager, Angelo Parker, and Matt Menard) defeated The Blackpool Combat Club (Bryan Danielson and Jon Moxley), Eddie Kingston, Santana and Ortiz Anarchy in the Arena match 22:45 12 Jurassic Express (Jungle Boy and Luchasaurus) (c) (with Christian Cage) defeated Swerve In Our Glory (Keith Lee and Swerve Strickland) and Team Taz (Powerhouse Hobbs and Ricky Starks) Three-way tag team match for the AEW World Tag Team Championship 17:15 13 CM Punk defeated \"Hangman\" Adam Page (c) Singles match for the AEW World Championship 25:40 ==References== Category:2022 in American sports Category:AEW Double or Nothing Category:21st century in Nevada Category:Nevada",
 "title": "Double or Nothing (2022)"
}