{
 "id": "105848",
 "text": "The Algonquian or ; (also Algonquin, Algonkian) languages are a subfamily of Native American languages that includes most of the languages in the Algic language family.The two Algic languages that are not Algonquian are Wiyot and Yurok of northwestern California) That language family was named for the Algonquin language, from which it should be carefully distinguished. The term \"Algonquin\" comes from the Maliseet word elakómkwik (), \"they are our relatives/allies\".Campbell (1997:401 n. 133, 136)Bright, William (2004). Native American Place Names of the United States. Norman: University of Oklahoma Press, pg. 32 Many Algonquian languages are extremely endangered today, while a number of others have already died out completely. There are about 30 languages. The three categories of the Algonquian languages are Plains Algonquian Languages, Central Algonquian Languages and Eastern Algonquian Languages. Speakers of Algonquian languages stretch from the east coast of North America all the way to the Rocky Mountains. The language from which all of the languages of the family come was spoken at least 3,000 years ago. The Algonquian languages are 'poly-synthetic', which means that you can make entire sentences in one word. == Languages and groups == Algonquian languages by group include: * Plains Languages: Blackfoot, Arapaho proper, Gros Ventre (†) and Cheyenne * Central Languages: Cree–Innu–Naskapi, Menominee, Ojibwe, Potawatomi, Sauk–Fox–Kickapoo, Shawnee and Miami–Illinois (†) * Eastern Languages: Miꞌkmaq, Western Abenaki, Eastern Abenaki (†), Malecite–Passamaquoddy, Massachusett, Narragansett (†) Mohegan–Pequot (†), Quiripi-Naugatuck-Unquachog (†), Mohican (†), Munsee (Lenape), Unami (Lenape, †), Nanticoke–Piscataway (†), Carolina Algonquian (†), Powhatan (†), Etchemin (†), Loup A (†), Loup B (†) and Shinnecock (†) Extinct languages are marked with (†) == Related pages == * Northeastern Woodlands * Plains Indians * First Nations * Native Americans in the United States == References == == Bibliography == * Campbell, Lyle (1997). American Indian languages: The historical linguistics of Native America. New York: Oxford University Press. . * Goddard, Ives (1994). \"The West-to-East Cline in Algonquian Dialectology.\" In William Cowan, ed., Papers of the 25th Algonquian Conference, pp. 187–211. Ottawa: Carleton University. * Mithun, Marianne (1999). The languages of Native North America. Cambridge: Cambridge University Press. (hbk); . == Other websites == * Algonquian Family * Category:Languages of North America Category:Native Americans",
 "title": "Algonquian languages"
}