{
 "id": "1058857",
 "text": "Petr Ginz (English: Peter Ginz; 1944) was a Czechoslovakian-born half-Jewish boy, who is known for his artworks, poems, and novels. His most popular known work was Vedem (English: [We Are] In the Lead), a literary magazine which was avaliable in print between 1942 and 1944, in the Theresienstadt Ghetto. The publishers and editor-in-cheifs of the literary magazine were him and Hanuš Hachenburg. Ginz also wrote a diary in 1941 and 1942. == Biography == === Early life and activities === Petr Ginz was born on in Prague, Czechoslovakia (in modern-day Czech Republic). He was the son of Otto Ginz and his spouse (wife) Mária Ginzová. His father was Jewish, whilst his mother was a Christian. This obviously made Ginz half-Jewish. Ginz already showed signs of high intelligence, before the age of 8. He wrote his first novel when he was 8 years old. He wrote four more novels, after that. The last novel was written and completed when he was 14, shortly before his transportation to the Theresienstadt Ghetto. The novels were mostly written in the style of Jules Verne, and were even illustrated with his own paintings. Ginz spoke two languages fluently from early childhood. His parents were very interested in studying and learning Esperanto, and thus this became Ginz' second native language, apart from Czech. === Diary === Ginz wrote a diary in 1941 and 1942, before he was transported to the Theresienstadt Ghetto. The diary was originally lost, but it was later found and published as a book by his younger sister Eva, who fortunately happened to survive the Holocaust, under the book title: My Brother's Diary. The diary was later republished as The Diary of Petr Ginz: 19411942. Copies of it are available in Czech, Catalan, Spanish, Esperanto, and English. === Transportation to the Theresienstadt Ghetto === In March 1939, the Germans invaded and occupied Czechoslovakia. Like with many other German-occupied countries, in German-occupied Czechoslovkia, anti-Semitic laws and strict curfews against Jews began, and persecution and transportation of Jews to ghettos and concentration camps began as well. Ginz left on a transport to the Theresienstadt Ghetto on 28 October 1942, at the age of 14. His younger sister Eva followed him and was transported to the Theresienstadt Ghetto, as well. === Work and activity in the Theresienstadt Ghetto === About two months after his transportation and arrival in the Theresienstadt Ghetto, Ginz founded a literary magazine named Vedem (English: [We Are] In the Lead). The first copies of the literary magazine were available in print in December 1942. The publishers and editor-in-chiefs of the popular literary magazine were Petr Ginz and Hanuš Hachenburg. Despite the horrible conditions of the ghetto, Ginz continued to study and write. Ginz even wrote a Czech–Esperanto dictionary and several short novels, which are currently lost. === Transportation to the Auschwitz concentration camp === On 28 or 29 September 1944, Ginz left on a transport from the Theresienstadt Ghetto to the Auschwitz concentration camp. There is debate on whether the transport took place on the 28th of September, or on the next day. At the time of the transport, Ginz had not yet recovered from a disease and was still ill. === Death === Ginz's precise date of death is rather disputed. It is however known that he died in the Auschwitz concentration camp. By the time Auschwitz was liberated by the Red Army on 27 January 1945, Ginz had already been deceased. He is said to have apparently died from suffocation whilst in the gas chambers. His death took place in or 1944. It is certain that Ginz did not survive the Holocaust. == Related pages == * Anne Frank * Zlata Filipović * Yoko Moriwaki * Hélène Berr * Renia Spiegel * The Holocaust Category:1928 births Category:1944 deaths Category:Writers from Prague Category:Czech Jews",
 "title": "Petr Ginz"
}