{
 "id": "1058846",
 "text": "Double or Nothing (2023) was a professional wrestling pay-per-view show made by All Elite Wrestling (AEW). It took place on May 28, 2023 at T-Mobile Arena in Las Vegas suburb of Paradise, Nevada. It was the fifth Double or Nothing event held by AEW. There were two main events promoted. The first main event saw the Blackpool Combat Club (Bryan Danielson, Jon Moxley, Claudio Castagnoli, and Wheeler Yuta) defeat The Elite (Kenny Omega, Matt Jackson, Nick Jackson, and \"Hangman\" Adam Page) in an Anarchy in the Arena match. Yuta rolled up and pinned Omega after Konosuke Takeshita and Don Callis interfered and Takeshita hit Omega with a knee strike. The second main event saw MJF defeat \"Jungle Boy\" Jack Perry, Sammy Guevara, and Darby Allin in a four-way match to keep his AEW World Championship. Dave Meltzer of the Wrestling Observer Newsletter gave the Anarchy in the Arena match 5 stars out of 5 stars. ==Matches== No. Results Stipulations Times 1 The Hardys (Jeff Hardy and Matt Hardy) and Hook (with Isiah Kassidy) defeated Ethan Page and The Gunns (Austin and Colten Gunn) by submission Trios match 15:45 2 Orange Cassidy (c) won by last eliminating Swerve Strickland 21-man Blackjack Battle Royal for the AEW International Championship 22:30 3 Adam Cole (with Roderick Strong) defeated Chris Jericho (with Angelo Parker, Matt Menard, Daniel Garcia, and Jake Hager) Unsanctioned match with Sabu as the special guest enforcer 19:00 4 FTR (Dax Harwood and Cash Wheeler) (c) defeated Jeff Jarrett and Jay Lethal (with Karen Jarrett, Sonjay Dutt, and Satnam Singh) Tag team match for the AEW World Tag Team Championship with Mark Briscoe as the special guest referee 19:55 5 Wardlow (c) defeated Christian Cage Ladder match for the AEW TNT Championship 17:10 6 Toni Storm (with Saraya and Ruby Soho) defeated Jamie Hayter (c) Singles match for the AEW Women's World Championship 3:05 7 The House of Black (Malakai Black, Brody King, and Buddy Matthews) (c) (with Julia Hart) defeated The Acclaimed (Anthony Bowens and Max Caster) and Billy Gunn \"House Rules\" trios match for the AEW World Trios Championship 15:20 8 Jade Cargill (c) (with \"Smart\" Mark Sterling and Leila Grey) defeated Taya Valkyrie Singles match for the AEW TBS Championship 8:45 9 Kris Statlander defeated Jade Cargill (c) (with \"Smart\" Mark Sterling and Leila Grey) Singles match for the AEW TBS Championship 0:50 10 MJF (c) defeated Sammy Guevara, Darby Allin, and \"Jungle Boy\" Jack Perry Four-way match for the AEW World Championship 27:50 11 Blackpool Combat Club (Bryan Danielson, Jon Moxley, Claudio Castagnoli, and Wheeler Yuta) defeated The Elite (Kenny Omega, Matt Jackson, Nick Jackson, and \"Hangman\" Adam Page) Anarchy in the Arena match 27:00 ==References== Category:2023 in sports Category:2023 in the United States Category:AEW Double or Nothing Category:Nevada",
 "title": "Double or Nothing (2023)"
}