{
 "id": "1058838",
 "text": ", known professionally as or Mackenyu, is a Japanese actor. He has starred in various TV series such as Sakurasaku (2016), Tomorrow, I'll Surely Love You Again (2016), Remote de Korosareru (2020), The End of the Tiny World: Half A Year Later and One Piece (2023). He has also starred in the films Take a Chance (2015), Over Drive (2018), 12 Suicidal Teens (2019), Our 30-Minute Sessions (2020), Brave: Gunjō Senki (2021), The Master Plan (2021) and Knights of the Zodiac (2023). == Biography == Mackenyu is an actor of Japanese descent who grew up in Los Angeles, California. He is the son of Sonny Chiba and Tamami Chiba. He has an older half-sister named Juri Manase and a younger brother named Gordon Maeda. ==Filmography== ===Film=== Year Title Role Notes 2015 Tadaima George Kamen Rider Drive: Surprise Future Eiji Tomari Take a Chance Masa Lead role 2016 Chihayafuru Part 1 Arata Wataya laughy.jp Retrieved 2016-6-16 (Google translation) Chihayafuru Part 2 Night's Tightrope Hikaru Makise Bittersweet Atsushi Babazono 2017 Let's Go, Jets! Kōsuke Yamashita JoJo's Bizarre Adventure: Diamond Is Unbreakable Chapter I Okuyasu Nijimura Peach Girl Kazuya \"Tōji\" Tōjigamori 2018 Pacific Rim: Uprising Cadet Ryoichi Chihayafuru Part 3 Arata Wataya Over Drive Naozumi Hiyama Lead role Impossibility Defense Asao Momose Code Blue: The Movie Akio Kishida 2019 12 Suicidal Teens Shinjirō Lead role Tokyo Ghoul S Sōta NiNoKuni Haru (voice) 2020 Kaiji: Final Game Minato Hirose Our 30-Minute Sessions Aki Miyata Lead role Tonkatsu DJ Agetarō Guest of VIP room Cameo 2021 Brave: Gunjō Senki Aoi Nishino Lead role The Master Plan Makoto Rurouni Kenshin: The Final Yukishiro Enishi 2022 Fullmetal Alchemist: The Revenge of Scar Scar Fullmetal Alchemist: The Final Alchemy 2023 Knights of the Zodiac Pegasus Seiya Lead role ===Television=== Year Title Role Network Notes 2015 Yume wo Ataeru Masaaki Wowow Miniseries 2016 Sakurasaku Ippei Lead Role, Miniseries Tomorrow, I'll Surely Love You Again Shouta Fuji TV Brass Dreams Ren Kitora TBS 2017 Fugitive Boys Ichihashi Tetsuto Fuji TV 2018 Kiss that Kills Takauji Namiki NTV 2019 Two Homelands Yu Amada TV Tokyo Miniseries Our Dearest Sakura Aoi Kijima NTV 2020 Remote de Korosareru Nomura Yusaku NTV Lead role, Special 2021 The End of the Tiny World: Half A Year Later Makoto dTV Lead role Ichikei's Crow: The Criminal Court Judges Bunta Ishikura Fuji TV 2023–present One Piece Roronoa Zoro Netflix Lead role ==References== ==Other websites== *mackenfamily.jp * Category:Living people Category:1996 births Category:Japanese movie actors Category:Japanese television actors",
 "title": "Mackenyu"
}