{
 "id": "1058033",
 "text": "The WAGR W class were a total of 60 large steam locomotives operated by the Western Australian Government Railways (WAGR) from 1951 to 1972. The W class were initially proposed by C.M.E. Frederick Mills in 1947, but his death in 1949 delayed the project. Beyer, Peacock & Coy of Manchester, England had already been advised of the design but identified multiple design flaws which they addressed in a meeting held in the UK in 1950. Alterations included the firebox which was shaped to suit Collie coal which was notorious for its bad quality. Once they entered service, the W class could be found across the network on primary goods trains, though they did haul passengers as well, such as the Australind from Perth to Bunbury. The reputation of the W class was good being depicted as strong and free-steamers with sound reliability. Minor teething problems and faults were attributed to poor welding resulting in no fewer than 34 W class laid up for repair at one point, though these issues had been eliminated by the late 1950s. Withdrawals began in 1968 and ended in 1972 with the end of steam on the WAGR. 15 of the W class have been preserved with several in South Australia and one in the Northern Territory. They also make up the majority of the steam heritage operations on the Hotham Valley Railway in Dwellingup, Western Australia. == Gallery == File:W901, East Perth, 1951.jpg|No. 901 at East Perth in 1951. File:Hotham Valley Railway-Wizards Express.jpg|No. 920 hauling the Wizards Express on the Hotham Valley Railway in 2005. File:WAGR 947 (5360453923).jpg|No. 947 under restoration at Bassendean in 2006. File:York Station.jpg|No. 908 at York station in 2008. File:Locomotive W920.jpg|No. 920 on the Hotham Valley Railway in 2011. File:WAGR locomotive W934 at Woolshed Flat.jpg|No. 934 at Woolshed Flat on the Pichi Richi Railway in 2012. File:Piston mechanisms steam locomotive.jpg|Piston workings of the W class. File:W920 + F40 + train Isandra, 2015 (01).JPG|W class No. 920 at Isandra siding on the Hotham Valley Railway in 2015. File:W924 + train Alice Springs, 2015 (01).JPG|No. 924 at Alice Springs on display in 2015. File:W907, Steamtown, 2017 (01).jpg|No. 907 at Steamtown, Peterborough in 2017. File:WAGR W class at Collie Railway Memorial, April 2022 03.jpg|No. 948 at Collie in 2022 on display. Category:Western Australian Government Railways locomotives",
 "title": "WAGR W class"
}