{
 "id": "1058925",
 "text": "Leopold Nitsch (14 August 1897 – 18 January 1977) was an Austrian international footballer. He played for SK Rapid Wien as midfielder. With Rapid he won the Austrian championship six times and the Austrian Cup three times. He also played for the Austrian national football team. ==Career== He joined the Rapid youth team in 1911. Four years later he moved up to the first team. He won his first Austrian championship title in the 1915–16 season. The team soon dominated the championship. Nitsch won five more titles in 1917, 1919, 1920, 1921 and 1923. He also won the first two official ÖFB cup competitions in 1919 and 1920. In 1924 he became coach. He coached Bulgaria at the 1924 Summer Olympics in Paris. He soon returned to the active ranks and played as a defender for Rapid towards the end of his career. From 1925 to 1928 he was captain of the team.SK Rapid Wien Archiv (German) ==International== Nitsch played 35 matches for the Austrian national football team. He debuted on 3 October 1915 in a 4-2 win versus Hungary. His last match was on 14 March 1926 in a 2-0 win versus Czechoslovakia. ÖFB Players profile ==Coaching career== In 1924 he was coach of the Bulgarian national football team. He then worked as coach of the youth team at Rapid from 1928 to 1936. 1936 he replaced Eduard Bauer as coach of the first team. Leopold Nitsch accompanied the team through the Second World War, when Austrian football was integrated into German football. He won the Tschammerpokal with Rapid in 1938 with a 3-1 win in the final against FSV Frankfurt and the German championship in 1941 with a 4-3 win against FC Schalke 04. Rapid was able to become Austrian champions three more times, then called “Ostmarkmeister”. ==Nitsch and the NSDAP== On 21 May 1938, he applied for membership in the NSDAP and was admitted to May 1 of the same year (membership number 6,303,894). Bundesarchiv R 9361-IX KARTEI/30691222 Whether this is due to political conviction or simply adaptation to the new circumstances can no longer be determined with certainty.SK Rapid Wien Archiv (German) ==Honours== * 6 × Austrian champion: 1915–16, 1916–17, 1918–19, 1919–20, 1920–21, 1922–23 * 3 × Austrian Cup: 1918/19, 1919–20, 1926–27 * 35 matches for Austria 1915 - 1926 ==References== Category:1897 births Category:1977 deaths Category:Association football midfielders Category:Austrian footballers Category:SK Rapid Wien players Category:Players of the Austrian national football team Category:Austrian football champions Category:Austrian football midfielders",
 "title": "Leopold Nitsch"
}