{
 "id": "1058680",
 "text": "The House of Commons of England was the lower house of the Parliament of England (which included Wales) from the 14th century to the union of England and Scotland in 1707. It was then replaced by the House of Commons of Great Britain. In 1801, with the union of Great Britain and Ireland, that house was in turn replaced by the House of Commons of the United Kingdom. The first parliament to invite representatives of the major towns was Montfort's Parliament in 1265. At the \"Model Parliament\" of 1295, representatives of the boroughs (including towns and cities) were admitted. It became the rule that each county send two knights of the shire, and that each borough send two burgesses. In 1341 the Commons met separately from the nobility and clergy for the first time, creating in effect an Upper Chamber and a Lower Chamber. The clergy and nobility became the House of Lords. While they were English possessions Calais, between 1372 and 1558, and Tournai, between 1513 and 1519, were represented in the Parliament. James I and Charles I came to depend on the parliament for taxation and the disputes resulted in the English Civil War. The armed forces of Parliament won the war. In December 1648 the House of Commons was purged by the New Model Army, which was supposed to be under the control Parliament. Pride's Purge was the only military coup in English history. Then Charles I was beheaded and the Upper House was abolished. The unicameral Parliament that was left was later called the Rump Parliament It only had a small selection of Members of Parliament approved by the army – some of whom were soldiers themselves. In 1653, when leading figures in this Parliament began to disagree with the army, it was dissolved by Oliver Cromwell. The monarchy and the House of Lords were both restored with the Commons in 1660. The influence of the Crown had been decreased, and was less after James II was deposed in the Glorious Revolution of 1688 and the Bill of Rights 1689 was enacted. ==References== Category:House of Commons of England",
 "title": "House of Commons of England"
}