{
 "id": "1058972",
 "text": "Chen Xiaocui (25 September 1902 – 1 July 1967) was a Chinese poet, writer, and painter. She was a founder of the Chinese Women's Calligraphy and Painting Association. After the People's Republic of China was founded, she became one of the first professors at the Shanghai Chinese Painting Academy in 1960. She died with suicide in 1967 during the Cultural Revolution, which had begun the year before. Throughout her life, Chen created classical Chinese poetry, short stories, novels, and plays, translated Western literature, and created paintings. Her notable collection of poetry is called \"Cuilou Yincao\". == Early life == Chen Xiaocui was born on 25 September 1902. Her family came from Hangchow (Hangzhou). Her grandmother named her Chen Cui (陳璻) and gave her the courtesy name Cuina (翠娜). Her father was Chen Xu, known as Diexian, a writer of the Mandarin Ducks and Butterflies School. Her mother, Zhu Shu, who also wrote and published poetry. Chen Xiaocui was the second of three children and the only daughter. Her elder brother was Chen Xiaodie, and her younger brother was Chen Cidie. In her early childhood, Chen Xiaocui received literature instruction from her mother, Zhu Shu. She began formal education at the age of four. In 1909, while the family lived in Pingchang (平昌), Jiangsu, banditry in the rural areas disrupted her schooling. She had to study by herself and was able to compose poetry by the age of eight. After the family relocated to Shanghai in 1913, she enrolled in the Chongwen Higher Women's Elementary School (崇文高等女子小學). The exact endpoint of Chen's formal education is unclear. Some say it concluded upon her elementary school graduation, while others believe she completed high school at the age of seventeen. In 1913, Chen Xu started Sanren Gongsi () in Shanghai with Li Changjue, Wu Juemi, and two of his children, Chen Xiaodie and Chen Xiaocui. Over five years, the company translated 73 English novels into Chinese, including the works of Sherlock Holmes. Chen published her first work, Sishi Guiyong (), in September 1914. She started writing professionally to support her family, using Xiaocui as her pen name. At the age of sixteen, Chen began to study Chinese poetry from her father. In August 1924, Shanghai Women's Literary Professional College (上海女子文學專修學校) appointed as an instructor in poetry, and her father as a special lecturer. Meanwhile, at the age of seventeen, Chen Xiaocui began to study Chinese painting on her own. In 1919, she studied painting with Yang Shiyou and Feng Chaoran. == Marriage == In January 1922, the magazine Banyue () published the poetry of Chen Xiaocui and Shi Zhecun together. This led to correspondence between Chen and Shi. Shen Xiaosun, a relative of Shi, worked at the Family Industrial Company. He discussed with Chen's father the possibility of an arranged marriage between Chen and Shi. However, Shi declined the opportunity because of his poverty and did not meet Chen in person at that time. In 1927, Chen's parents arranged her marriage to Tang Yanqi. Tang was the eldest son of Tang Shouqian, the former governor of Zhejiang and the first secretary of transportation of the Republic of China. Tang was also the nephew of Ma Yifu. In October, Chen Xu published Chen's collection of personal works, Cuilou Yincao, as part of her dowry. It's worth noting that Chen kept her engagement a secret from her best friend, likely due to traditional beliefs. In 1928, Chen and Tang had a daughter named Tang Cuichu. However, the couple separated after two to three years of marriage. Tang Shouqian left for Taiwan before the People's Republic of China was founded and died there in 1952. == Carrer == In 1934, Chen established the China Women's Calligraphy and Painting Association (CWCPA) with other female painters, including Gu Qingyao, Feng Wenfeng, Li Qiujun, Zhou Lianxia, Jiang Yanan, and Wu Qingxia. The association held its inaugural meeting on 29 April 1934, during which Chen was elected as a board member and an editor. On 18 May, Chen and Li Qiujun were chosen as co-chairs of the association. The association organized ten exhibitions by 1944. In the late 1930s, Chinese vernacular literature gained popularity due to the New Culture Movement. However, Chen continued to compose poetry in classical Chinese. In April 1935, she attended the founding conference of Cunwenhui (), which aimed to promote basic knowledge of classical Chinese among middle school students and beyond. When Japan took control of Shanghai in 1937, Chen's father and two brothers fled to Kunming, while Chen and her mother stayed in Shanghai. Chen Xu fell ill in 1939, returned to Shanghai, and died on 24 March 1940. Chen Xiaocui collected and published her father's remaining works as Xuyuan Yigao (). After the end of the Second Sino-Japanese War in 1945, Chen and other poets, including Cheng Zhongtao, Zhang Hongwei, and Cheng Man-ch'ing, founded the Shalong Poetry Society (). Later in the same year, CWCPA resumed its activities, and Chen took charge of its operations. In 1947, when Shanghai's Bureau of Education was preparing to establish the Shanghai Museum of Art, Chen Xiaocui was named one of its committee members. She also began teaching private painting that year. In 1948, the Shanghai campus of the Wuxi Specialized College of Chinese Studies hired Chen as a professor in Chinese poetry. In April 1949, Chen's paintings were included in the spring exhibition of the Shanghai Museum of Art. According to Chen Xiaodie, Chen Xiaocui considered leaving for Taiwan in 1950 but ultimately decided against it. In 1956, Wu Hufan introduced Chen to the Chinese Peasants' and Workers' Democratic Party. In 1957, Chen's daughter Tang Cuichu left for France. In 1960, when the Shanghai Chinese Painting Academy was founded, Chen became one of the first professors alongside Zhou Lianxia and Lu Xiaoman. In 1964, Shi Zhecun learned of Chen's address in Shanghai and visited her on February 20, marking their first meeting. They continued to exchange literary works during subsequent visits. == Persecution and suicide == In 1966, when the Cultural Revolution began, Chen Xiaocui was taken away from her home in June. In the winter of 1966, she sought shelter with Zhao Quancheng and Chen Maoheng. However, after two months, the Zhao family faced struggle sessions, and the Shanghai Chinese Painting Academy insisted that Chen return to campus. During this time, Chen Xiaocui changed her place of residence with Pang Zuoyu to avoid harassment from the Red Guards. She tried to escape from Shanghai twice, but both times she was caught. The second time, she was found with over 300 jin of grain ration coupons and hundreds of Yuan hidden in her trousers. Her personal belongings were taken, and she was tied up and beaten by two Red Guards. In 1967, the rebel faction of Shanghai's Administration of Culture (文化局) arranged to move Chen's residence to a house on Changle Road, Shanghai. They also took her lifelong collection of Chinese paintings and sold them as scrap paper. On the morning of 1 July 1967, when Chen arrived at the Shanghai Chinese Painting Academy, she found that the painters were about to undergo struggle sessions. She went back to her residence, but Red Guards followed her and tried to break down her door. On that day, she took sleeping pills and later that night, she killed herself by a gas stove. She composed a death poem upon her suicide, but it was destroyed by the Red Guards. == References == === Citations === === Newspaper articles === * === Journal articles === * * * * * === Books === * * Category:1902 births Category:1967 deaths Category:20th- century Chinese poets",
 "title": "Chen Xiaocui"
}