{
 "id": "1058475",
 "text": "The Kruševo Republic, sometimes spelled as Krushevo Republic (Bulgarian and , ), was a short-lived political entity created in 1903 by revolutionaries from the Internal Macedonian Revolutionary Organization (IMRO) during the Ilinden Uprising in the city of Kruševo, now North Macedonia. Macedonian history books mention it as one of the first republics in the Balkans.Fieldwork Dilemmas: Anthropologists in Postsocialist States, Editors Hermine G. De Soto, Nora Dudwick, University of Wisconsin Press, 2000, , pp. 36–37. The republic only lasted 10 days before being dissolved after the Battle of Mečkin Kamen. The city of Kruševo also uses the flag of the Republic today. The Republic also had a parliament consisting of 60 members. Keith Brown says, based on the \"language of home\", the members might be classified as Aromanians, Macedo- Bulgarians and Albanians. Along with that the Council also elected an executive body—the Provisional Government—with six members (2 from a group)We, the People: Politics of National Peculiarity in Southeastern Europe, Diana Mishkova, Central European University Press, 2009, , p. 124. The Republic is also mentioned in the Macedonian national anthem Denes nad Makedonija. == History == In the early 20th century, Kruševo was populated by Slavs, Aromanians and Orthodox Albanians and Greeks, with the town inhabitants being part of various various Ottoman groups called millets, based on ethnicity and religion. The Patriarchists were the largest community, followed by Exarchists and the Ullah millet for the Aromanians. According to the ethnographer Vasil Kanchov's statistics at that time the town's inhabitants counted: 4,950 Bulgarians, 4,000 Vlachs (Aromanians) and 400 Orthodox Albanians. On 3 August 1903, rebels captured the town of Kruševo and established a revolutionary government. The entity existed only for 10 days: from 3 to 13 August, and was headed by Nikola Karev. He was a strong leftist, rejecting the nationalism of the ethnic minorities and favouring alliances with ordinary Muslims against the Sultanate, as well as supporting the idea of a Balkan Federation. there was a provisional goverment with 6 members whose duty was to promote law and order and manage supplies, finances, and medical care. Around this time the Kruševo Manifesto was published in the first days after the proclamation. Written by Nikola Kirov, it outlined the goals of the uprising, calling upon the Muslim population to join forces with the provisional government in the struggle against Ottoman tyranny, to attain freedom and independence. Initially surprised by the uprising, the Ottoman government took extraordinary military measures to suppress it. Pitu Guli's band (cheta) tried to defend the town from Ottoman troops coming from Bitola. The whole band and their leader (voivode) perished. After fierce battles near Mečkin Kamen, the Ottomans managed to destroy the Kruševo Republic, committing atrocities against the rebel forces and the local population. As a result of the gunnery, the town was set partially ablaze.John Phillips, Macedonia: Warlords and Rebels in the Balkans, I.B.Tauris, 2004, , p. 27. After the plundering of the town by the troops and the bashi-bazouks, the Turkish authorities sent a declaration for the inhabitants of Kruševo to sign, stating that the Bulgarians had committed the crimes and looted the town. Under pressure by the authorities, a few citizens did sign it.Feliks Gross, Violence in politics: Terror and political assassination in Eastern Europe and Russia, Volume 13 of Studies in the Social Sciences, Walter de Gruyter, 2018, , p. 128. == Related pages == * Ilinden Uprising * Internal Macedonian Revolutionary Organization * Kruševo == References == Category:Former republics Category:Former countries in Europe Category:1900s in Europe Category:1900s in the Ottoman Empire",
 "title": "Kruševo Republic"
}