{
 "id": "1058541",
 "text": "The Altarpiece of the Centenar de la Ploma or Altarpiece of Saint George of the Centenar de la Ploma is a large-scale international Gothic style altarpiece made around 1400 by Andreu Marçal de Sax and Miquel Alcanyís on behalf of the company of the Centenar de la Ploma and which symbolizes the battle of the Puig that took place in 1237. Currently, and following the acquisition made in 1864, the work is in the Victoria and Albert Museum in London . == Context == In 1237, during the conquest of the kingdom of Valencia, James I had gained control of the fortification of Puig Castle . With his troops weakened due to the conquests, he received the warning of a counterattack by the Muslim forces, in this way he marched towards Catalonia to gather more troops, leaving Guillem Aguiló in charge. In his absence, the Muslim king Zayyan ibn Mardanix attacked the fortification. During the battle, while part of his troops were fighting the Muslims, Guillem Aguiló advanced from behind the hill sounding numerous trumpets and carrying flags taken from nearby ships, with the royal pennant at the head, making the Muslims believe that it was of James I arriving with an army. According to Bernat Desclot's Chronicle, at that moment Saint George appeared with his own army of knights, allowing the Christians to win the battle. == History == On June 3, 1365, Pere the Ceremonious created the militia of the Centenar de la Ploma, initially called the Centenar of the Glorious Sant Jordi. After the Church of Sant Jordi in Valencia was consecrated on May 27, 1401, the Centenary commissioned an altarpiece for this church, which was made sometime between 1400 and 1420. Due to its dimensions and complexity, the work probably had several authors, mainly Marçal de Sax and Miquel Alcanyís, but also very likely Johan Utuvert and Gonçal Peris . In 1740 the altarpiece was still in the church, but it was demolished in 1807 and the altarpiece was lost until it appeared in Paris in 1864, dismantled in several pieces. After a period of negotiation, the altarpiece was bought by the South Kensington museum in London for 800 pounds or 20,000 francs, a high price for a work of this nature at the time. Since then, the altarpiece has been exhibited in that museum, now called the Victoria and Albert Museum . In 2010, negotiations began with the London museum for a temporary return of the altarpiece to Valencia, but ultimately they did not succeed. In 2019 the predella of the altarpiece, the part most in need of restoration, arrived at the Museum of Fine Arts in Valencia to be restored and analyzed, it remained on display between 2020 and 2021. The restoration lasted for a year and a half and made it possible to recover the original colors and brightness. == Gallery == Andrés Marzal De Sax - Retable of St George (detail) - WGA14170.jpg|Central scene depicting the Battle of Puig Predel·la amb escenes de la Passió, retaule de sant Jordi del Centenar de la Ploma.jpg|Left side of the basement Andrés Marzal De Sax - Retable of St George (detail) - WGA14171.jpg|Lower central scene depicting Saint George defeating the dragon Predel·la amb escenes de la Passió, retaule del Centenar de la Ploma.jpg|Right side of the basement Andrés Marzal De Sax - Retable of St George (detail) - WGA14172.jpg|Detail of the crucifixion of Saint George == References == == Other websites == * Victorian and Albert Museum webpage on the Altarpiece of Saint George Category:Art museums",
 "title": "Altarpiece of Saint George"
}