{
 "id": "1058763",
 "text": "All Out (2020) was a professional wrestling pay-per-view show made by All Elite Wrestling (AEW). It took place on September 5, 2020, mainly at the Daily's Place in Jacksonville, Florida. It was the second All Out event held by AEW. The main event saw Jon Moxley defeat MJF to keep the AEW International Championship. Moxley's finisher, the Paradigm Shift was banned, but he ended up hitting MJF with the Paradigm Shift anyways when the referee's back was turned. Moxley then got the pinfall victory. There was criticism for the match between Matt Hardy and Sammy Guevara. During the match, Hardy got speared off of a scissor lift by Guevara and was put through a table but he hit his head off of the concrete floor and appeared to be knocked out. After the match, he cleared an MRI and CT scan with no signs of a concussion. ==Matches== No. Results Stipulations Times 1 Joey Janela (with Sonny Kiss) defeated Serpentico (with Luther) Singles match 7:35 2 Private Party (Isiah Kassidy and Marq Quen) defeated The Dark Order (Alex Reynolds and John Silver) Tag team match 10:25 3 Big Swole defeated Dr. Britt Baker, D.M.D. (with Rebel) Tooth and Nail match 10:00 4 The Young Bucks (Matt and Nick Jackson) defeated Jurassic Express (Jungle Boy and Luchasaurus) (with Marko Stunt) Tag team match 14:50 5 Lance Archer won by last eliminating Eddie Kingston Casino Battle Royale for a future AEW World Championship match 22:15 6 Matt Hardy defeated Sammy Guevara by knockout Broken Rules match 9:00 7 Hikaru Shida (c) defeated Thunder Rosa Singles match for the AEW Women's World Championship 17:00 8 Matt Cardona, Scorpio Sky, and The Natural Nightmares (Dustin Rhodes and Q. T. Marshall) (with Allie and Brandi Rhodes) defeated The Dark Order (Mr. Brodie Lee, Colt Cabana, Evil Uno, and Stu Grayson) (with Anna Jay) Eight-man tag team match 15:10 9 FTR (Cash Wheeler and Dax Harwood) (with Tully Blanchard) defeated Kenny Omega and \"Hangman\" Adam Page (c) Tag team match for the AEW World Tag Team Championship 29:40 10 Orange Cassidy defeated Chris Jericho by throwing him into a vat of mimosa Mimosa Mayhem match 15:55 11 Jon Moxley (c) defeated MJF (with Wardlow) Banned move Singles match for the AEW World Championship 23:40 === Casino Battle Royale entrances and eliminations === Draw Entrant Order Eliminated by Eliminations Clubs Trent Beretta 9 Lance Archer 1 Christopher Daniels 2 Jake Hager 0 Jake Hager 6 Sonny Kiss 1 The Blade 1 Will Hobbs 0 Rey Fenix 4 Darby Allin 0 Diamonds Frankie Kazarian 12 The Butcher 1 Will Hobbs 16 Lance Archer 1 Chuck Taylor 5 Santana and Ortiz 0 Santana 8 Trent Beretta 1 Ortiz 10 Lance Archer 1 Hearts Billy 3 Brian Cage 0 Penta El Zero M 11 Frankie Kazarian 0 Ricky Starks 13 Darby Allin 0 Brian Cage 17 Lance Archer 3 Darby Allin 14 Brian Cage 2 Spades Shawn Spears 15 Matt Sydal 0 Eddie Kingston 20 Lance Archer 1 The Butcher 18 Matt Sydal 1 Sonny Kiss 7 Brian Cage 1 Lance Archer - Winner 5 Joker Matt Sydal 19 Eddie Kingston 2 ==Footnotes== ==References== Category:AEW All Out Category:2020s in Jacksonville, Florida Category:2020 in sports in Florida",
 "title": "All Out (2020)"
}