{
 "id": "1059020",
 "text": "Schizophrenia is a thought disorder that affects a person's thinking, emotions, and behavior. Schizophrenia can cause such severe disability that many people with this disorder do not have jobs, they live in poverty, and/or they are homeless. There are medicines that can help treat schizophrenia. These medicines are important for the pharmaceutical industry.https://www.mayoclinic.org/diseases- conditions/schizophrenia/symptoms- causes/syc-20354443https://my.clevelandclinic.org/health/diseases/4568-schizophreniahttps://www.merckmanuals.com/home/mental- health-disorders/schizophrenia-and-related-disorders/schizophrenia Unfortunately, the cost of treating schizophrenia (including medical bills and other expenses) is very high. Studies show that people with schizophrenia often have higher suicide rates and more health problems compared to people without the disorder.https://annals-general- psychiatry.biomedcentral.com/articles/10.1186/1744-859X-6-10 They also face challenges in society that make it harder for them to get better.https://www.cambridge.org/core/journals/the-british-journal-of- psychiatry/article/schizophrenia-poor-physical-health-and-physical-activity- evidencebased-interventions-are-required-to-reduce-major-health- inequalities/67A0294716A06B7A5254F47F00063937 Famous people like John Forbes Nash and Vaslav Nijinsky had schizophrenia, and shared openly about the disorder.https://www.nobelprize.org/prizes/economic- sciences/1994/nash/facts/https://academic.oup.com/brain/article/142/1/220/5144594 ==Society== Schizophrenia can lead to unemployment, poverty and homelessness. It is unknown how many people have schizophrenia; the number changes depending on what measures a person uses to diagnose schizophrenia. More research on mental health is needed to work out how to help people with schizophrenia. ===Disability=== Schizophrenia is responsible for a large portion of global disability. 1% of worldwide disability-adjusted life years is due to schizophrenia. In a 1999 paper, people with schizophrenia ranked hallucinations (a big symptom of schizophrenia) as the third-most-disabling symptom of the disorder. The disorder can strongly affect people's ability to function and their quality of life. === Financial aspects === Schizophrenia has a major effect on the United States economy. A 2005 paper guessed that in 2002, the disorder cost $62.7 billion in the United States alone. These costs include medical expenses, long-term care, and indirect costs like less productivity at work, unemployment, and costs from law enforcement. Also, antipsychotic medications, commonly prescribed for schizophrenia, are used for many other conditions, leading to a large number of prescriptions. In the European Union, around 16.5 million people got daily antipsychotic prescriptions in 2018,Guidance Antipsychotic medicines Published 25 August 2005 Medicines & Healthcare products Regulatory Agency Guidance UK Government with large increases seen in England between 1998 and 2010.Stephen Ilyas and Joanna Moncrieff \"Results TABLE 1\" In: Trends in prescriptions and costs of drugs for mental disorders in England, 1998–2010 The British Journal of Psychiatry, 200(5), 393-398. doi:10.1192/bjp.bp.111.104257 ====Pharmaceutical market==== The market size for schizophrenia drugs was valued as $9,000,000,000 in 2021. Schizophrenia Market Size and Trend Report including Epidemiology and Pipeline Analysis, Competitor Assessment, Unmet Needs, Clinical Trial Strategies and Forecast, 2021-2031 Published: September 21, 2022 GlobalData Plc: John Carpenter House, John Carpenter Street, London Pharmaceutical firms offering drugs in this market include: * Acadia Pharmaceuticals * BioXcel Therapeutics * Boehringer Ingelheim * Eli Lilly * Gedeon Richter * Intra-Cellular Therapies * Johnson & Johnson * Karuna Therapeutics * Lundbeck * Luye Pharma * MedinCell * Minerva Neurosciences * Neurocrine Biosciences * Novartis * Otsuka * Reviva Pharmaceuticals * Sunovion Pharmaceuticals * Teva Key Players GlobalData Plc: John Carpenter House, John Carpenter Street, London ===Mortality=== ====External==== In 2020, researchers studied 160 people who had committed homicide in England or Wales, and were admitted to hospital for schizophrenia between January 1997 and 31 December 2012. Of the 160 study participants, about 150 (94%) had a history of alcohol and/or illegal drug consumption, and/or did not have their prescribed medication. In a study of the actus reus of homicide in England and Wales during the years 1997–2003, diagnosed schizophrenics were more likely to use an object with a sharpened edge, like a knife. In most cases, schizophrenics who committed homicide killed family members or a spouse in their homes. Alison Baird, Roger T. Webb, Isabelle M. Hunt, Louis Appleby and Jenny Shaw Homicide by men diagnosed with schizophrenia: national case–control study BJPsych Open, 6(6), E143. doi:10.1192/bjo.2020.129Cathryn Rodway, Cathryn Rodway, Nicola Swinson, Alison Roscoe, Alison Roscoe, Kirsten Windfuhr, Kirsten Windfuhr, Louis Appleby, Jenny Shaw Methods of homicide in England and Wales: a comparison by diagnostic group The Journal of Forensic Psychiatry & Psychology, 20:2, 286-305, DOI: 10.1080/14789940802360870GLOSSARY Actus reus definition LexisNexisMens rea and actus reus The Incorporated Council of Law Reporting for England & WalesOVERVIEW actus reus non facit reum nisi mens sit rea Oxford University PressValeria Abreu Minero, Edward Barker, and Rachael Bedford \"4.1. Schizophrenia/delusional disorder and sharp instruments\" in Method of homicide and severe mental illness: A systematic review Aggress Violent Behav. 2017 Nov;37:52-62. https://doi.org/10.1016/j.avb.2017.09.007. Epub 2017 Sep 28. PMID: 31354381; PMCID: PMC6660311. ====Internal==== Individuals with schizophrenia have a higher risk of suicide compared to most people, and also have a higher prevalence (chance) of physical health issues. In 2015, around 16,900 deaths were linked to schizophrenia-related causes. A study involving over 4 million individuals diagnosed with schizophrenia showed that suicide, injury-poisoning, and unknown non-natural cause were the most common reasons for death, followed by pneumonia.Christoph U Correll, Marco Solmi, Giovanni Croatto, Lynne Kolton Schneider, S Christy Rohani-Montez, Leanne Fairley, Nathalie Smith, István Bitter, Philip Gorwood, Heidi Taipale, Jari Tiihonen Mortality in people with schizophrenia: a systematic review and meta-analysis of relative risk and aggravating or attenuating factors World Psychiatry. 2022 Jun;21(2):248-271. doi: 10.1002/wps.20994. [Discussion: (\"RR=9.76-8.42\") & \"RR=7.00\" c.f. (i.e. 6, 5, 4) (4.0 ≠ 3.00 - 3.999 rec.) \"RR=3 to 4\", \"RR=2 to 3\", \"RR=1.33 to 1.96\"] Also, one study identified antipsychotic medication as the primary cause of pneumonia. ===Social challenges=== Many people with schizophrenia pull away from others and have difficulty with social interactions. A 1999 paper showed this as a major challenge in schizophrenia recovery. The word \"schizophrenia\" is used as a metaphor in newspapers worldwide.Christina Athanasopoulou, Maritta Välimäki 'Schizophrenia' as a metaphor in greek newspaper websites Stud Health Technol Inform. 2014:202:275-8.Arun K Chopra, Gillian A Doody Schizophrenia, an illness and a metaphor: analysis of the use of the term 'schizophrenia' in the UK national newspapers J R Soc Med. 2007 Sep;100(9):423-6. doi: 10.1177/014107680710000919. PMID: 17766915; PMCID: PMC1963407.Kenneth Duckworth, M.D., John H. Halpern, M.D., Russell K. Schutt, Ph.D., Christopher Gillespie, M.A. Use of Schizophrenia as a Metaphor in U.S. Newspapers Psychiatric Services Volume 54 Issue 10 October 2003 Pages 1402-1404 https://doi.org/10.1176/appi.ps.54.10.1402 ===Symptoms amongst non-patient groups=== Studies have found that even mental health nursesMillham RN BA MSc, Mental Health Nurse, Easton BSc MA CPsychol ASBPSS, Clinical Psychologist/Senior Lecturer Prevalence of auditory hallucinations in nurses in mental health Psychiatric and Mental Health Nursing Volume5, Issue 2 April 1998 and people without schizophreniaC. Choong BMBS, BMedSci, M. D. Hunter MBChB, MRCPsych & P. W. R. Woodruff MBBS, PhD, MRCP, FRCPsych Auditory hallucinations in those populations that do not suffer from schizophrenia Curr Psychiatry Rep 9, 206–212 (2007). https://doi.org/10.1007/s11920-007-0020-zHONIG, ADRIAAN M.D., Ph.D., MRCPsych.1; ROMME, MARIUS A. J. M.D., Ph.D.2; ENSINK, BERNARDINE J. M.Sc., Ph.D.2; ESCHER, SANDRA D. M. A. C.2; PENNINGS, MONIQUE H. A. M.A.2; DEVRIES, MARTEN W. M.D., Ph.D.Auditory Hallucinations: A Comparison between Patients and Nonpatients The Journal of Nervous & Mental Disease 186(10):p 646-651, October 1998. experience auditory hallucinations. However, in people with schizophrenia, auditory hallucinations tend to be more constant, intrusive (forcing in), and disturbing. ===Tobacco=== Studies around the world have shown a strong link between schizophrenia and smoking tobacco. Smokers with schizophrenia tend to smoke heavily and to smoke cigarettes with a high nicotine content.American Psychiatric Association. Task Force on DSM-IV. (2000). Diagnostic and statistical manual of mental disorders: DSM-IV-TR. American Psychiatric Pub. . p. 304 ==Culture== ===Art=== August Natterer Meine Augen zur Zeit der Erscheinungen.jpg|My Eyes at the moment of the apparitions by August Natterer Paranoid-schizophrenia.png Cloth embroidered by a schizophrenia sufferer.jpg Wall of St. Elizabeth's Hospital (Reeve 037257), National Museum of Health and Medicine (3298831786).jpg ===People with schizophrenia=== In 1908, the sister of Dr Eugen Bleuler was taken to a Zurich hospital with a catatonic illness. Dr Bleuler soon became the director of the same hospital, where he diagnosed his sister with schizophrenia. Mark L. Ruffalo M.S.W., D.Psa. A Lesson from Bleuler on Schizophrenia Psychology Today 28 October 2019Jessica Resnick 2017-04-06 Paul Eugen Bleuler (1857–1939) Arizona State UniversityTina Joos-Bleuler Being a Member of the Bleuler Family Schizophr Bull. 2011 Nov; 37(6): doi: 10.1093/schbul/sbr135 PMCID: PMC3196944 PMID: 22013083 Vaslav Nijinsky (born 1889 Nijinsky Living with Schizophrenia died 1950) Emilio Fernandez-Egea One hundred years ago: Nijinsky and the origins of schizophrenia, 25 October 2018: Brain, Volume 142, Issue 1, January 2019, Pages 220–226, https://doi.org/10.1093/brain/awy262 was a dancer; his parents were also dancers. Vaslav Nijinski Choreographer Opéra national de Paris Starting around 1913, he was known by the nicknames Carol Diethe Historical Dictionary of Nietzscheanism Historical Dictionaries of Religions, Philosophies, and Movements, No. 75 Second Edition p.208 The Scarecrow Press, Inc. 2007 \"the God of dance\" Emilio Fernandez-Egea One hundred years ago: Nijinsky and the origins of schizophrenia, 25 October 2018: Brain, Volume 142, Issue 1, January 2019, Pages 220–226, https://doi.org/10.1093/brain/awy262 \"The God of Dance in Paris\" - \"Psychosis in his own words\": \"a classic self- portrait of the symptoms of schizophrenia - Delusions of influence \"I realised that God did this on purpose so that I would correct my notebook. God writes all this for me and men’s’\" - grandiose delusions with omnipotence\"...PIPPA CRAWFORD Nijinsky on Nijinsky: the Decline and Fall of the Ballet Russes Pushkin House 3 March 2020 and \"God's clown\". During or sometime after March 1919, Dr Bleuler diagnosed Nijinsky as \"a confused schizophrenic with mild manic excitement,\" which meant she didn't need to go to a hospital. Camille Claudel was a sculptor. She was diagnosed retrospectively (looking at the past) in 1913. J Oules [Camille Claudel. Her psychiatric case history] https://pubmed.ncbi.nlm.nih.gov/8279734/ Ann Med Psychol (Paris). 1993 Aug- Sep;151(7):485-98. Eduard Einstein, one of Dr. Albert Einstein's children, was diagnosed with schizophrenia by Dr Blueler in the 1930s and lived his life in a hospital. Clare Fitzgerald Albert Einstein forgotten son eduard the Vintage NewsPaul Halpern April 21, 1936 MediumMileva Einstein-Maric Biography.com John Forbes Nash was diagnosed with schizophrenia in 1959. John was a mathematician from the United States. He was given the Nobel Prize in Economic Sciences in 1994 for \"equilibria (balance) in the theory of non-cooperative games\".John F. Nash Jr. Facts Nobel Prize ===Alternate realities: psychoanalytic and religious=== Some researchers believe that in some special situations, experiencing psychosis is proof of genius. John E. Gedo Nietzsche and the Psychology of Genius American Imago Vol. 35, No. 1/2, MYTH, CREATIVITY, PSYCHOANALYSIS: Essays in Honor of Harry Slochower (SPRING-SUMMER, 1978), pp. 77-91 (15 pages) Published By: The Johns Hopkins University Press A 2016 paper showed similarities between schizophrenia and mysticism. Josef Parnas, Mads Gram Henriksen Mysticism and schizophrenia: A phenomenological exploration of the structure of consciousness in the schizophrenia spectrum disorders Consciousness and Cognition Volume 43, July 2016, Pages 75-88 ===Presentation in biography and cinema=== A book and then a movie, both called \"A Beautiful Mind,\" were made about the life of John Forbes Nash. The movie “The Soloist” tells the story of Nathaniel Ayers, an experienced musician who left the Juilliard School in New York City after he started having symptoms of schizophrenia. He later became homeless in Los Angeles, California, in the notorious (negatively well known) Skid Row part. ==References== ==Bibliography== Category:Schizophrenia",
 "title": "Schizophrenia in society and culture"
}