{
 "id": "1059931",
 "text": "Otto Kaller (28 June 1907 – 31 March 1985) was an Austrian football player. He played mainly for First Vienna FC . He also played for the Austrian national football team. ==Career== Kaller played for the lower-class Erdbergers until 1925 . Then he was signed by Vienna. He was able to win a regular place. There he played alongside with Leopold Hofmann for more than ten years. In the first season with the blue-yellow team they were runner-up In the following years the team mostly finished in the top ranks of the table. In 1929 they won their first title with a victory over Rapid in the ÖFB Cup final. The victory was repeated in 1930 against Austria. In the 1930/31 season the club won the championship title, which also entitled them to take part in the Mitropacup. Kaller was out for several weeks and did not in the final matches The championship was won again in the 1932/33 season. In 1937 they won the cup again. When the Vienna defender Karl Rainer ended his career in 1938, Kaller took over his position. During the war years, Vienna was a dominant force in Austrian football. They won three championship titles in a row from 1942 to 1944. In 1942 they also became German runners-up after a 2-0 final defeat against FC Schalke 04. In 1943 they won the German Cup with a 3-2 win against LSV Hamburg. Kaller was also player for his team in the first post-war championship. He reached another cup final in 1946 He played his last first division game in 1948. Kaller ended his career at Landstraßer AC. ==International== Kaller debuted for the national team on 2 May 1926 against Hungary in a 3-0 win in Budapest. His only appearance during the time of the miracle team was the 1:2 against Czechoslovakia in April 1933. This was his last appearance for Austria for over twelve years. On 20 August 1945 he played his last match against Hungary.ÖFB Players profile ==References== Category:1907 births Category:1985 deaths Category:Association football defenders Category:Association football midfielders Category:Austrian footballers Category:Players of the Austrian national football team Category:Austrian football defenders Category:Austrian football midfielders",
 "title": "Otto Kaller"
}