{
 "id": "1059017",
 "text": "Risk factors and possible causes of schizophrenia is what to know to avoid the problem(s) of schizophrenia. Risk is how often anywhere and somewhere in the world a problem could happen for someone in their lives to make schizophrenia. Risk is about how much someone should think they would want not having problems which make schizophrenia. How much they would want their life not the problem. This thinking goes with a knowing of the parts of choices in the world which are known causes. Cause is the actual things which make schizophrenia. risk 1 of 2 noun Merriam-WebsterHarrison Wein, Ph.D. Understanding Health Risks Improve Your Chances for Good Health October 2016 U.S. Department of Health and Human Services Schizophrenia is not infectious. There is no microorganism that is spread from one person to another. Risk factors include trauma (damage caused by stressful events) and genetics (schizophrenia running in families). Having a schizophrenic parent may be very stressful, and there may also be genes that influence the development of schizophrenia. It is very easy to show that trauma, such as sexual abuse (forced unwanted sexual behaviour towards somebody) increases the risk, but 40 years of searching for the right genes has not found anything that has been confirmed by independent research groups.Joseph, J. (2003). The Gene Illusion: Genetic Research in Psychiatry and Psychology under the Microscope. PCCS Books. . ==Risk factors== More men are affected than women: the number of males with the disorder is 1.4 times greater than that of females. Schizophrenia usually appears earlier in men. For males the symptoms usually start from 20 to 28 years of age, and in females it is 26 to 32 years of age. Symptoms that start in childhood, middle or old age are much rarer. Despite the received wisdom that schizophrenia occurs at similar rates worldwide, its rate of likelihood varies across the world, within countries, and at the local level. ===Likelihood=== In 2011 and 2022, the number of people in all the people of he world with schizophrenia is thought to be 24 million people worldwide.van Os J, Kapur S (August 2009). \"Schizophrenia\" (PDF). Lancet. 374 (9690): 635–645. doi:10.1016/S0140-6736(09)60995-8. PMID 19700006. S2CID 208792724 Schizophrenia has been diagnosed from the ages of 5 and about a half a year of age, from the late teens or early 20s, to people after the age of 60 years.Robert Howard, M.D., , Peter V. Rabins, M.D., M.P.H., , Mary V. Seeman, M.D., , Dilip V. Jeste, M.D., , and the International Late-Onset, Schizophrenia Group \"Clinical Features\" Late-Onset Schizophrenia and Very- Late-Onset Schizophrenia-Like Psychosis: An International Consensus The American Journal of Psychiatry 1 February 2000Elizabeth Kay Spencer, M.D., Magda Campbell, M.D. Children With Schizophrenia: Diagnosis, Phenomenology, and Pharmacotherapy Schizophrenia Bulletin, Volume 20, Issue 4, 1994, Pages 713–725, https://doi.org/10.1093/schbul/20.4.713 In men, it seems to start about five years earlier than in women. ==Possible causes== ===Brain structure=== Some people who have schizophrenia have differences in their brain structure compared to those who do not have the disorder. These differences are often in the parts of the brain that manage memory, organization, emotions, the control of impulsive behavior, and language. For example, there is less brain volume in the frontal cortex and temporal lobes, and problems within the corpus callosum, the band of nerve fibers which connects the left side and the right side of the brain. People with schizophrenia also tend to have larger lateral and third ventricles. The ventricles are spaces within the brain filled with cerebrospinal fluid. ===Environmental factors=== There are may environmental risk factors factors for schizophrenia such as drug use, stress before birth and in some cases exposure to infectious diseases (a disease that spreads from person to person). In addition, living in a city during childhood or as an adult has been found to double the risk of schizophrenia .Evangelos Vassos, Carsten B Pedersen, Robin M Murray, David A Collier, and Cathryn M Lewis Meta-Analysis of the Association of Urbanicity With Schizophrenia Schizophr Bull. 2012 Nov; 38(6): 1118–1123. 2012 Oct 17. doi: 10.1093/schbul/sbs096 This is true even after taking into account drug use, race, and the size of one’s social group. Other factors that play an important role include whether the person feels socially isolated, as well as social adversity, racial discrimination (treating a person badly because of their race), the person's family not working properly, unemployment, and poor housing conditions. There is evidence that childhood experiences of abuse or trauma are risk factors for developing schizophrenia later in life. Psychotic symptoms often respond to drug treatmentAmerican Psychiatric Association. Task Force on DSM-IV. (2000). Diagnostic and statistical manual of mental disorders: DSM-IV-TR. American Psychiatric Pub. . p. 299 Stopping anti-psychotic or anti-vomiting drugs too quickly may cause these symptoms.Breggin, P. (2008) Brain-Disabling Treatments in Psychiatry: Drugs, Electroshock, and the Psychopharmaceutical Complex Springer Publishing Co, New York ===Inherited factors=== Doctors think genetics is part of schizophrenia. Paul J Harrison Recent genetic findings in schizophrenia and their therapeutic relevance . Journal of Psychopharmacology. 2015;29(2):85-96. doi:10.1177/0269881114553647 It is difficult to know if schizophrenia is inherited because it is hard to find out whether something comes from genes or the environment. Those who have a parent, Traci Pedersen, reviewed by Jeffrey Ditzell, DO https://psychcentral.com/schizophrenia/is- schizophrenia-genetic-causes-and-risk-factors#genetic-predisposition a brother or sister Jari K Haukka, Jaana Suvisaari, Jouko Lönnqvist Family structure and risk factors for schizophrenia: case-sibling study BMC Psychiatry 4, 41 (2004). https://doi.org/10.1186/1471-244X-4-41 with schizophrenia have a higher risk of developing schizophrenia. The risk is even higher if you have an identical twin with schizophrenia.Picchioni MM, Murray RM (July 2007). \"Schizophrenia\". BMJ. 335 (7610): 91–5. doi:10.1136/bmj.39227.616447.BE. PMC 1914490. PMID 17626963 This may seem to show that schizophrenia is inherited. However, it may be the stress of living with a schizophrenic family member that is traumatic. Identical twins are much closer and are treated much more in the same way, and this may be the reason why one of them is more likely to get schizophrenia if the other has it. Dr Jay Joseph has found many problems with the scientific studies of inheriting schizophrenia, including false reporting of results. Joseph also claims that 40 years of the search for the schizophrenia gene has not found a single gene that independent research groups have confirmed. A combination of what has happened to a person and the person’s genes may play a role in the development of schizophrenia. People who have family members with schizophrenia and who experienced a brief period of psychotic symptoms have a 20 to 40 percent chance of being diagnosed one year later. This may be both the result of stressful events because of the family member and possibly a genetic effect. ===Pre-birth factors=== Factors such as lack of oxygen, infection, or stress and lack of healthy foods in the mother during pregnancy, might result in a slight increase in the risk of schizophrenia later in life. People who have schizophrenia are more likely to have been born in winter or spring (at least in the northern half of the world). This might relate to increased rates of exposures to viruses before birth.Mamoru Tochigi, Yuji Okazaki, Nobumasa Kato, Tsukasa Sasaki What causes seasonality of birth in schizophrenia? Neuroscience Research, Volume 48, Issue 1, 2004, ISSN 0168-0102, https://doi.org/10.1016/j.neures.2003.09.002.Patrick F. Sullivan The Genetics of Schizophrenia PLOS Medicine July 26, 2005 https://doi.org/10.1371/journal.pmed.0020212 This difference is about 5 to 8 percent. ===Substance use and or abuse=== Several drugs have been linked with the development of schizophrenia and the abuse (harmful use) of certain drugs can cause symptoms like those of schizophrenia. About half of those people who have schizophrenia use too much drugs or alcohol, possibly to deal with depression, anxiety, boredom, or loneliness. Frequent marijuana use may double the risk of serious mental illness, including schizophrenia. More people with schizophrenia smoke tobacco than the general population; it is estimated that at least 60% to as many as 90% of people with schizophrenia smoke tobacco. Recent research suggests that cigarette smoking may be a risk factor for developing schizophrenia. Smoking also reduces the effects and side effects of anti-psychotic drugs, and this may be one of the reasons for the high smoking rate. Patients taking anti-psychotic drugs die up to 20 years earlier than others, possibly because the medication makes them overweight, gives diabetes and leads to them smoking. ===Past theory of cause=== *1939: Disturbance of the vegetative nervous system, with a parallel adrenaline imbalance (hypothesis) John C. Thomas, Bernard Gilsenan and E. J. C. Hewitt (1939) Insulin Shock Therapy I.—Carbohydrate Metabolism in Schizophrenia. Preliminary Observations Journal of Mental Science , Volume 85 , Issue 357 , July 1939 ==References== Category:Schizophrenia",
 "title": "Risk factors and possible causes of schizophrenia"
}