{
 "id": "1059008",
 "text": "Double or Nothing (2019) was a professional wrestling pay-per-view show made by All Elite Wrestling (AEW). It took place on May 25, 2019 at the MGM Grand Garden Arena in Las Vegas suburb of Paradise, Nevada. It was the first Double or Nothing event and was also the very first pay-per-view to be made by AEW. The main event saw Chris Jericho defeat Kenny Omega to earn a future match against Adam Page at All Out to see who would become the very first AEW World Champion. Also on this show. Awesome Kong and Jon Moxley made their AEW debuts and Bret Hart appeared to unveil the AEW World Championship. ==Matches== No. Results Stipulations Times 1 Adam Page won by last eliminating MJF 21-man Casino Battle Royale 16:00 2 Kip Sabian defeated Sammy Guevara Singles match 10:00 3 SoCal Uncensored (Christopher Daniels, Frankie Kazarian, and Scorpio Sky) defeated Strong Hearts (Cima, T-Hawk, and El Lindaman) Six-man tag team match 13:40 4 Dr. Britt Baker, D.M.D. defeated Nyla Rose, Kylie Rae, and Awesome Kong (with Brandi Rhodes) Four-way match 11:10 5 Best Friends (Chuck Taylor and Trent Beretta) defeated Angélico and Jack Evans Tag team match 12:35 6 Hikaru Shida, Riho, and Ryo Mizunami defeated Aja Kong, Emi Sakura, and Yuka Sakazaki Six-woman tag team match 13:10 7 Cody (with Brandi Rhodes) defeated Dustin Rhodes Singles match 22:30 8 The Young Bucks (Matt and Nick Jackson) (c) defeated The Lucha Brothers (Fénix and Pentagón Jr.) Tag team match for the AAA World Tag Team Championship 24:55 9 Chris Jericho defeated Kenny Omega Singles match 27:00 === Casino Battle Royale entrances and eliminations === Five wrestlers started the match. Every three minutes, five more wrestlers entered. The 21st and final entrant entered alone. Draw Entrant Order Eliminated by Eliminations Clubs Dustin Thomas 10 MJF 1 MJF 20 Adam Page 3 Sunny Daze 2 Glacier 1 Brandon Cutler 12 MJF Michael Nakazawa 1 Sunny Daze 0 Diamonds Isiah Kassidy 5 Luchasaurus 1 Jimmy Havoc 18 2 Joey Janela 13 0 Brian Pillman Jr. 4 Isiah Kassidy and Marq Quen 0 Shawn Spears 9 Dustin Thomas Hearts Billy Gunn 11 Brandon Cutler Glacier 3 MJF 1 Jungle Boy 17 Jimmy Havoc Marq Quen 6 Luchasaurus Ace Romero 8 Jungle Boy Spades Luchasaurus 19 Adam Page 4 Marko Stunt 7 Ace Romero 0 Sonny Kiss 14 Tommy Dreamer Tommy Dreamer 16 Jimmy Havoc 2 Orange Cassidy 15 Tommy Dreamer 0 Joker Adam Page - Winner 2 ==References== Category:2019 in sports Category:2019 in the United States Category:AEW Double or Nothing Category:Nevada",
 "title": "Double or Nothing (2019)"
}