{
 "id": "1059727",
 "text": "Susana Gutierrez Godoy (24 May 1910 in Tepechitlan, Zacatecas, Mexico - 4 January 2024 ) was a Mexican supercentenarian whose age is validated by the Latin American Supercentenarians (LAS). She is currently the oldest known (documented) living person in Mexico. == Biography == Susana Gutierrez Godoy was born in Tepechitlan, Zacatecas, Mexico, on 24 May 1910. She was the second of five children. Her mother, Francisca Godoy Ortiz (1885—1916), passed away when she was just six years old, and her father, Juan Gutierrez Correa (1887—1983), lived to the age of 95. In the absence of her parents, her aunt assumed the role of caretaker for Susana and her siblings, essentially becoming a mother figure to them. Susana started working at a very young age. Her father eventually remarried when she was older, but her dedication to supporting her family continued. Throughout her life, she focused on selling food, particularly menudo (a traditional Mexican soup), and preparing dinners in Tepechitlan City. Additionally, Susana had a fondness for mezcal. She married for the first time at the age of 21, only to become a widow shortly thereafter. She wed her first husband, Jose Estrada Meza, on 19 April 1932, but he passed away just over a year later on 5 December 1933. Following this, she entered into a second marriage with Pedro Vazquez Parra, on 8 June 1939, when she was 29 years old. She had a daughter who died at the age of three months. After her daughter died, she was not able to have any more children. One of her brothers passed away at the age of 32 due to a heart attack, while another brother, Agustin, lived to be 92. According to her relatives, she was remarkably independent. She continued to cook for herself until she was around 100 years old. At one point, she even had her own chickens. == Recognition == On 21 July 2021, following the death of Jorge Duran Coral, she became the third oldest known living person in Mexico whose age been authenticated by an organization specializing in age verification. On 19 October 2022, following the death of Angela Diaz Millan, she became the oldest known living person in Mexico whose age has been authenticated by an organization specializing in age verification. In 2020 she celebrated her 110th birthday. At the age of 110, she moved to a nursing home in 2020. Category:1910 births Category:2024 deaths Category:Supercentenarians Category:Mexican centenarians Category:People from Zacatecas",
 "title": "Susana Gutierrez Godoy"
}