{
 "id": "1059664",
 "text": "On 22 October 2015, a mass stabbing happened at Kronan School, a high school in Trollhättan, Sweden when a 21-year-old man named Anton Lundin Pettersson killed three people and injured one other person with a sword before dying himself after being shot by police who had arrived at the school. It is the second deadliest attack on a school in Swedish history and also the first attack on a school in Sweden where someone died since the Kungälv school shooting in 1961, where one person was killed and six other people were injured. The investigation by police says that Pettersson was motivated by racism and had chosen to attack the school because it was in a neighbourhood where many immigrants lived. == Background == There have been many hate crimes in city of Trollhättan, including an fire attack at a mosque in the 1990s.. == Stabbing == Pettersson went into the school at 10:06, wearing black clothes, a cape, a type of German helmet and a paintball mask. People who saw him thought he was at the school for a Halloween prank. The news and media compared the way Pettersson was dressed to the way a character from the film series Star Wars, named Darth Vader dresses. A 20-year-old teaching assistant named Lavin Eskandar walked up to Pettersson, who stabbed him. Eskandar died at the school. Pettersson then stabbed a 15-year old Somali student named Ahmed Hassan, who died from being stabbed in hospital. Pettersson then stabbed a 15-year-old Syrian student who was not named, who survived his injuries. When he was walling through the school, two students walked up to Pettersson and because they thought he was there for a Halloween prank, they posed with him and took a picture. The police chief of the city named Niclas Hallgren, said that Pettersson didn’t kill them because they were white. After that, a 42-year-old teacher named Nazir Amso, walked up to Pettersson and told him to remove his mask. Petterson ran at Amso and stabbed him. Amso died from being stabbed six weeks later in hospital on 3 December. Some time before, 10:16, police officers came to the school, ten minutes after Petterson came to the school. Pettersson ran at the police and he was shot in his abdomen, which he died from in hospital. == Perpetrator == Anton Niclas Lundin Pettersson (22 June 199422 October 2015) was the man who did the attack. Pettersson did not have a criminal record and he wasn’t a member of any political organisation, but he did support a petition by the Sweden Democrats to make a petition about immigration. Aftonbladet said that Pettersson went on far-right and extremist websites supporting Adolf Hitler and Nazi Germany and he also joined a Facebook group that wanted to stop immigration in Sweden. The Swedish Security Service was called in to investigate the information. Pettersson lived in a building far away from the school but he chose to attack the school because it was in Kronogården, a town where lots of immigrants lived, police used this as more evidence for his motive. People who used to be in the same class as Pettersson said he was a lonely person who \"lived in his own world\" and dressed in black clothes from the emo or rock scene. A survivor of the 2011 Norway attacks named Bjørn Ihler, said in The Guardian that in 2013, Pettersson had liked a YouTube video of former Ku Klux Klan leader Johnny Lee Clary talking about how a good experience with a black man made him stop being racist. == Aftermath and reactions == On the morning of 23 October, one day after the attack, Swedish police and news said that the attack had \"racist motives\" and that it was a \"hate crime\". The city’s police chief named Niclas Hallgre said that all of the victims of the attack were \"dark-skinned\". The Head of Investigation named Thord Haraldsson said that CCTV footage showed that Pettersson didn’t kill any people with white skin. After the news of the attack, Prime Minister Stefan Löfven went to Trollhättan and she said it was a “black day\" for the country. Minister for Integration Anders Ygeman said on Twitter: \"It is with sadness and dismay I received the news of the attack on the school in Trollhättan. My thoughts go to the victims and their families\". King Carl XVI Gustaf said that the royal family heard the news \"with great dismay and sadness\". On the days getting closer to Halloween, there were reports of people wearing suspicous costumes or brandishing weapons, which were actually just people celebrating Halloween. The police told the public not to carry fake weapons with their Halloween costumes, to stop anyone from being confused. Kronan School was closed until 2 November, when it was opened with better security. On 29 September 2017, the first book about the attack was published: What Was Never Allowed To Happen: The Trollhättan School Attack () The book had information about the attack that was not known to the public before, including a message Pettersson sent to an online friend before the attack. The author, , spoke to Petterson’s brother Erlandsson won the Stora Journalistpriset for the book. On 25 March 2019, two consecutive mass shootings happened in a terrorist attack on two mosques in Christchurch, New Zealand, where 51 people were killed and 40 pther people were injured. The perpetrator behind the shootings spoke about Pettersson in his manifesto and declared his support for him and also wrote Petterson's name on one of his guns. == Related pages == Inspired attacks * Christchurch mosque shootings * Eslöv school stabbing == References == Category:2015 crimes Category:2010s crimes in Europe Category:2015 murders in Europe Category:October 2015 events Category:Mass stabbings in Europe Category:Attacks on buildings and structures in 2015 Category:Attacks on schools in Europe Category:Racially-motivated violence Category:Trollhättan",
 "title": "Trollhättan school stabbing"
}