{
 "id": "1059125",
 "text": "Full Gear (2022) was a professional wrestling pay-per-view show made by All Elite Wrestling (AEW). It took place on November 19, 2022 at Prudential Center in Newark, New Jersey. It was the fourth Full Gear event made by AEW. The main event saw MJF defeat Jon Moxley to win the AEW World Championship. William Regal passed MJF a pair of brass knuckles when the referee was distracted. MJF then hit Moxley with them before getting the pinfall victory. On the show, Saraya made her return to in-ring action for the first time since since her career-ending injury in December 2017. ==Matches== No. Matches Stipulations Times 1 Best Friends (Chuck Taylor and Trent Beretta), Orange Cassidy, Rocky Romero, and Danhausen defeated The Factory (QT Marshall, Aaron Solo, Lee Johnson, Nick Comoroto, and Cole Karter) 10-man tag team match 11:55 2 Ricky Starks defeated Brian Cage (with Prince Nana) Semifinals in the AEW World Championship Eliminator Tournament 10:00 3 Eddie Kingston (with Ortiz) defeated Jun Akiyama Singles match 10:30 4 \"Jungle Boy\" Jack Perry defeated Luchasaurus (with Christian Cage) Steel Cage match 18:40 5 Death Triangle (Pac, Penta El Zero Miedo, and Rey Fénix) (c) defeated The Elite (Kenny Omega, Matt Jackson, and Nick Jackson) (with Brandon Cutler and Michael Nakazawa) Six-man tag team match for the AEW World Trios Championship 18:40 6 Jade Cargill (c) (with The Baddies (Kiera Hogan and Leila Grey)) defeated Nyla Rose (with Marina Shafir and Vickie Guerrero) Singles match for the AEW TBS Championship 8:00 7 Chris Jericho (c) defeated Bryan Danielson, Claudio Castagnoli, and Sammy Guevara Four-way match for the ROH World Championship 21:30 8 Saraya defeated Dr. Britt Baker, D.M.D. Singles match 12:30 9 Samoa Joe defeated Wardlow (c) and Powerhouse Hobbs Three-way match for the AEW TNT Championship 9:55 10 Sting and Darby Allin defeated Jeff Jarrett and Jay Lethal (with Sonjay Dutt and Satnam Singh) No Disqualification Tag team match 11:00 11 Jamie Hayter defeated Toni Storm (c) Singles match for the interim AEW Women's World Championship 15:00 12 The Acclaimed (Max Caster and Anthony Bowens) (c) defeated Swerve In Our Glory (Swerve Strickland and Keith Lee) Tag team match for the AEW World Tag Team Championship 19:40 13 MJF defeated Jon Moxley (c) (with William Regal) Singles match for the AEW World Championship 23:15 ==References== Category:2022 in American sports Category:AEW Full Gear Category:Newark, New Jersey Category:Sports in New Jersey Category:2020s in New Jersey",
 "title": "Full Gear (2022)"
}