{
 "id": "1059616",
 "text": "Obi Nduka Ezeagwuna II (29 January 1992), is Nigerian royalty. He was crowned the Obi of Issele-Uku on 29 December 2016. He is the 20th Obi after his father who died 2014. ==Career and education== He is currently the Obi of Issele-Uku from 2016 to Present. He also serves as Nigerian engineer. Nduka Ezeagwuna II, as he was known before becoming Obi of Issele-Uku, attended his primary and secondary school education at Greater Tomorrow in Benin City (Nigeria). He got his A-Level Certificate from University of Ibadan. He graduated as a chemical engineer from the University of Ibadan. ==Note on representation== Obi Nduka Ezeagwuna, the traditional ruler of Issele-Uku kingdom in Aniocha North Local Government Area of Delta, has advised lawmakers to positively impact on the lives of their constituents. The traditional ruler gave the advice in his palace at Issele-Uku on Thursday when the member representing Aniocha North constituency in the state House of Assembly, Mr Emeka Nwaobi, led some principal officers of the House on a thank-you visit to him. He also urged them to justify the mandate given to them by their people by ensuring that the dividends of democracy got to them. ”As lawmakers, do all that you can to ensure that the people in your constituencies benefit from your quality and effective representation,” he said. Ezeagwuna said they should also use their positions as lawmakers to enact laws that would better the lives of the people, especially their constituents. The royal father, who was glad to receive Nwaobi as the Majority Leader of the Eighth Assembly, said that the lawmaker’s emergence as majority leader was an act of God. ”Today is a historic day for us as a people and as a kingdom, and I must commend members of the state assembly for making out time for this visit. ”Whatever that transpired in the life of Emeka Nwaobi is the will of God and not my will. ”I must say that whoever brings out himself or herself for the service of the people will surely be elevated to greater heights,” he said. He advised the lawmakers to ensure that they use their positions to impact positively on humanity by promoting people-oriented legislation. “My appeal to all of you is simple: you should know that the office you currently occupy is for the benefit of your people. “You should do all you can to ensure that your constituents benefit immensely from the position you currently occupy” the traditional ruler said. Earlier, Nwaobi told the traditional ruler that he was at the palace to thank him for his support before and after the election. Nwaobi, who was accompanied on the visit by the Deputy Speaker, Mr Arthur Akpowowo and other lawmakers, seized the occasion to officially inform the royal father of his emergence as majority leader of the assembly. ”I am here to thank my traditional ruler and my people for showing me love, especially all through my turbulent period. ”I am also here to him because each time I prepare to run for election, the palace has always been my first point of call. ”I have also come to seek your prayers for God to give me the wisdom to function effectively as majority leader, ” he said. The lawmaker also commended his colleagues for their support in making the visit a success (NAN). ==Related pages== *Obi of Issele-Uku ==References== Category:1992 births Category:Living people Category:Nigerian politicians Category:Nigerian royalty",
 "title": "Obi Nduka Ezeagwuna II"
}