{
 "id": "105942",
 "text": "The Arena Football League (or AFL) is a defunct American football league in the United States that ran from 1987 to 2008, and 2010 to 2019. After it ended the first time, another league like it started in 2010, called Arena Football 1. Some, but not all, of the AFL teams joined Arena Football 1. The league later changed its name to the Arena Football League. There were 6 teams in 2019 when the league folded due to bankruptcy. Unlike what people in this league call the outdoor league (the NFL), Arena football is played in an smaller arena. Arena Football is played with only 8 players on a team, not 11 like the NFL. ==Teams== Team City Arena Founded Joined Albany Empire Albany, New York Times Union Center 2018 2018 Atlantic City Blackjacks Atlantic City, New Jersey Boardwalk Hall 2019 2019 Baltimore Brigade Baltimore Royal Farms Arena 2017 2017 Cleveland Gladiators Cleveland, Ohio Rocket Mortgage FieldHouse 1997 1997 Columbus Destroyers Columbus, Ohio Nationwide Arena 1999 1999 Philadelphia Soul Philadelphia, Pennsylvania Wells Fargo Center 2004 2004 Washington Valor Washington, D.C. Capital One Arena 2017 2017 ===Timeline=== The Arena Football League has had many teams join and leave the league. Every year, there has been at least one team which did not play with the same name as the year before. Year # of Teams New Teams Folded Teams Suspended Teams Returning Teams Relocated Teams Name Changes 1987 4 Chicago Bruisers Denver Dynamite Pittsburgh Gladiators 1988 6 Detroit Drive Los Angeles Cobras New York Knights Denver Dynamite 1989 5 Los Angeles Cobras New York Knights Denver Dynamite 1990 6 Albany Firebirds Dallas Texans Chicago Bruisers Washington Commandos (from Maryland) 1991 8 Columbus Thunderbolts New Orleans Night Orlando Predators Washington Commandos Pittsburgh → Tampa Bay Storm 1992 12 Arizona Rattlers Charlotte Rage Cincinnati Rockers Sacramento Attack San Antonio Force Denver Dynamite Columbus → Cleveland Thunderbolts 1993 10 New Orleans Night San Antonio Force Sacramento → Miami Hooters 1994 11 Fort Worth Cavalry Las Vegas Sting Milwaukee Mustangs Cincinnati Rockers Dallas Texans Detroit → Massachusetts Marauders 1995 13 Connecticut Coyotes Iowa Barnstormers Memphis Pharaohs St. Louis Stampede San Jose SaberCats Fort Worth Cavalry 1996 15 Texas Terror Las Vegas → Anaheim Piranhas Fort Worth → Minnesota Fighting Pike (dormant from 1995) Florida Bobcats (from Miami Hooters) 1997 14 Nashville Kats New Jersey Red Dogs New York CityHawks Charlotte Rage Connecticut Coyotes St. Louis Stampede Memphis → Portland Forest Dragons 1998 14 Anaheim Piranhas Massachusetts Marauders → Grand Rapids Rampage (dormant for three years) Houston Thunderbears (from Texas Terror) 1999 15 Buffalo Destroyers New York → New England Sea Wolves 2000 17 Carolina Cobras Portland → Oklahoma Wranglers 2001 19 Chicago Rush Detroit Fury Albany → Indiana Firebirds Iowa → New York Dragons New England → Toronto Phantoms New Jersey Gladiators (from New Jersey Red Dogs) 2002 16 Dallas Desperados Florida Bobcats Milwaukee Mustangs Oklahoma Wranglers Nashville → Georgia ForceThe history of the Kats stayed in Nashville, similar to the agreement made between the Cleveland Browns and Baltimore Ravens of the NFL. 2003 16 Colorado Crush Toronto Phantoms New Jersey → Las Vegas Gladiators 2004 19 Austin Wranglers New Orleans VooDoo Philadelphia Soul Buffalo → Columbus Destroyers 2005 17 Nashville Kats Carolina Cobras Detroit Fury Indiana Firebirds 2006 18 Kansas City Brigade Utah Blaze New Orleans VooDoo 2007 19 New Orleans VooDoo 2008 17 Austin WranglersThe Austin Wranglers changed leagues from the AFL to af2. Nashville Kats Las Vegas → Cleveland Gladiators 2009 0 New Orleans VooDoo Los Angeles Avengers Arizona Rattlers Chicago Rush Cleveland Gladiators Colorado Crush Columbus Destroyers Dallas Desperados Georgia Force Grand Rapids Rampage Kansas City Brigade New York Dragons Orlando Predators Philadelphia Soul San Jose SaberCats Tampa Bay Storm Utah Blaze 2010 15 Alabama Vipers* Bossier-Shreveport Battle Wings* Dallas Vigilantes Iowa Barnstormers* Jacksonville Sharks Milwaukee Iron* Oklahoma City Yard Dawgz* Spokane Shock* Tulsa Talons* Utah Blaze** (* Former af2 team) (** Former AIFA team) Arizona Rattlers Chicago Rush Cleveland Gladiators Orlando Predators Tampa Bay Storm 2011 18 Pittsburgh Power Oklahoma City Yard Dawgz Kansas City Command Philadelphia Soul San Jose SaberCats Alabama Vipers → Georgia Force Bossier-Shreveport Battle Wings → New Orleans VooDoo Kansas City Command (from Kansas City Brigade) Milwaukee Mustangs (from Milwaukee Iron) 2012 17 Dallas Vigilantes Tulsa Talons → San Antonio Talons ==References== == Other websites == *Official website of the Arena Football League *Official website of Arena Football 1",
 "title": "Arena Football League"
}