{
 "id": "1059524",
 "text": "The WAGR U class were a total of 14 steam locomotives originally owned by the British War Department and later operated by the Western Australian Government Railways (WAGR) from 1946 to 1970. The U class were constructed in 1942 by the North British Locomotive Coy under an order from the British War Department for use on railways throughout North Africa during the Second World War, they were almost identical to the Sudan Government Railways 220 class 4-6-2 engines and were found to be unsuitable on most railways who required larger engines. Most served in Sudan with several more stored in a dismantled state at a military railway in Derby, England. Upon the conclusion of World War II, the British War Department placed the stored locos up for sale, the WAGR jumped at the chance to resolve desperate locomotive shortages. When they arrived they remained as oil burners due to protests on the Collie coalfields, they were placed on express passenger service on the South Western mainline to Bunbury where they performed so well that they were assigned to a newly named train the Australind which at the time was the fastest narrow gauge express in Australia. However as diesels began to be introduced they were mostly stored at Midland Junction pending withdrawal, however, with more protests on the coalfields, some of the U class were reactivated hauling heavy goods until 1969 when most were withdrawn once more. No. 655 survived until 1970 hauling goods trains from Midland to Bassendean, and is now on display at the Bassendean Railway Museum. The Ut class rebuild No. 664 is also displayed at Bassendean. == Gallery == File:U class + Australind, Roelands, 1947.jpg|U class passing Roelands in 1947, healing the Australind. File:U657 + The Australind, 1950.jpg|No. 657 with the Australind in 1950. File:U651 + The Australind, Perth, 1951.jpg|No. 651 at Perth with the Australind in 1951. File:WAGR 655 (5359397017).jpg|No. 655 on display at Bassendean in 2006. File:Bassendean rail museum gnangarra 19.jpg|Another view of No. 655 at Bassendean in 2006. File:Bar frames U class locomotive WAGR.jpg|No. 655's bar frames in 2013. File:Bassendean rail museum gnangarra 21.jpg|Builder's plate of No. 655. Category:Western Australian Government Railways locomotives",
 "title": "WAGR U class"
}