{
 "id": "1059735",
 "text": "Heinrich Hiltl, from 1939 Henri Hiltl (8 October 1910 - 25 November 1982) was an Austrian and French football player and coach. He played for both national football teams. ==Career== Heinrich Hiltl came to Brigittenauer AC at the age of 15. In the first year in the 1st class of the Austrian championship in 1926/27, Brigittenauer AC sensationally took second place. Hiltl played one championship game this season. In the following years Hiltl played an important role for the Brigittenauer AC. In 1929 Heinrich Hiltl moved to Wiener AC as a 19-year-old and immediately became an integral part of the team. Hiltl celebrated his first major successes with the WAC. In 1931 he won the Austrian Cup with them .They reached the final of the Mitropa Cup (a forerunner of the Champions League. Hiltl was used in all seven Mitropacup games and was the top scorer in the competition with seven goals. Both final games were lost against First Vienna FC 1894. Hugo Meisl also became aware of the Viennese and called him up to the Austrian national team for the international match against the ČSR on 12 April 1931. Hiltl was in the starting line-up.He was unable to convince in this match. In 1934 Hiltl left the WAC and Austria and played for the French club Excelsior AC Roubaix. He immediately became an important part of the team and stayed in Roubaix until 1939. With his new club, Heinrich Hiltl finished 9th, 8th, 6th and 13th in the first French division from 1936 to 1939. In 1939, Heinrich Hiltl moved to the Racing Club de Paris and won the French Cup in the 1939/40 season. Hiltl had long since broken off all ties with Austria, which had now become part of the German Empire. After receiving the offer to play in the French national team, he accepted French citizenship in 1939. At RC Paris, Hiltl met two other Frenchmen with Austrian roots, his former club colleague Rudolf Hiden and Gusti Jordan. Henri, as he now called himself, played his first game in the French national team together with Hiden and Jordan on 28 January 1940 in the Prinzenparkstadion in Paris against Portugal. Hiltl was used in the home game against Belgium on 24 December 1944. Both games were won by France (Portugal 3:2, Belgium 3:1). After Hiltl won the cup with RC Paris in 1940, he left the club again. The years from 1941 to 1945 represent a gap in Hiltl's biography. It is not known where he spent these years or had to do military service. In 1945 Henri Hiltl signed a contract with CO Roubaix-Tourcoing and played again in the French first division. He helped the club from Roubaix win their first and only French championship title. In 1948, he ended his career as a player. ==Manager== He switched to coaching ( Tourcoing, Mouscron/Belgium and Merlebach/Lorraine), but he was only moderately successful. He has established a systematic talent development program at SO Merlebach. ==Honours== * 1 × French champion: 1947 (CO Roubaix-Tourcoing) * 1 × French Cup: 1940 (RC Paris) * 1 × Austrian Cup: 1931 (Wiener AC) * 1 × Austrian Cup final: 1932 (Wiener AC) * 1 × Mitropacup-final: 1931 (Wiener AC) * 1 × Champion Austria 2nd league: 1926 (Brigittenauer AC) * 1 match for the Austria national football team: 1931 * 2 matches for the France national football team: 1940, 1944 Category:1910 births Category:1982 deaths Category:Austrian footballers Category:Players of the Austrian national football team Category:Austrian football managers",
 "title": "Heinrich Hiltl"
}