{
 "id": "1059487",
 "text": "Heterojunction solar cells (HJT), also known as Silicon heterojunction (SHJ), are a type of solar cell. They are mass-produced, and the second-most common variety of solar cell currently in production as of 2023. They are currently the most efficient type of solar cell used in solar panels available to everyday consumers. Similarly to other consumer solar cells, they are made from crystalline silicon wafer. Silicon wafers used in solar cells have to be specially prepared to enable them to efficiently generate power from sunlight. Various techniques are used to improve solar cell efficiency. HJT solar cells are set apart from other solar cells in the way that they achieve their high efficiency. Silicon wafers have useful properties for electricity generation from light. Most photons that enter the silicon wafer are converted directly into electrons, which then flow towards the wafer surface. The bulk material, being high quality electronics-grade silicon, is easy for electrons to travel through. However, the surface of these wafers are problematic for the flow of electricity, because they are rough-hewn at the atomic scale. The interruptions to the silicon crystal causes electrons to become trapped at these surfaces, and thus they are unable to contribute to the generated electric current. To solve this issue, HJT solar cells use a very thin layer of amorphous (non-crystalline) silicon on top of the crystalline substrate. Amorphous silicon has very different chemical and electrical properties to crystalline silicon. The amorphous layer terminates the silicon crystal in a way that the electrons are not trapped. This technique is known as \"surface passivation\" because it makes the surface electrically passive. This is a highly effective way of neutralising surface defects. The reason it is called \"heterojunction\" is because \"hetero\" means \"different\", referring to the different properties of the amorphous and crystalline silicon. \"Junction\" means the electrical interface between the two materials. After the electrons exit the silicon wafer surface, they travel into a thin conductive coating on the front of the solar cell (the blue-coloured material), and are then collected by the metal electrode (visible as a grid of narrow lines on the surface). Despite having a high efficiency and being long-lasting, heterojunction solar cells are generally more expensive than competing cell technologies such as \"PERC\" solar cells (currently the most common variety of mass-produced solar cell). The cost difference arises as a result of various manufacturing challenges; most notably the higher consumption of silver in the electrodes, and the requirement for very high quality silicon wafers for the substrate. Although they were invented decades ago, HJT cells have entered mass-production relatively recently due to patent restrictions, and so the technology is less mature than competing solar cell technologies. == History == Scientists have studied the beneficial passivating effects of putting amorphous silicon onto crystalline silicon since the 1970s. HJT solar cells were invented by Japanese scientists in 1983, who realised that solar cells could be made better by using that kind of passivation. The Japanese company Sanyo then filed patents for the technology in the 1990s. == Comparison to other solar cells == === Advantages === * Heterojunction solar cells are very efficient compared to other solar cells that are mass-manufactured. * Solar panels made from heterojunction cells are expected to last around 30 years because they degrade at a slower rate than other solar panels. === Disadvantages === * They generally cost more than other kinds of solar cells, so they are seen as a premium. * The current manufacturing process needs to change because it is using too much silver. == Manufacturing process == === Making the silicon wafers === To make the silicon, quartz sand or pebbles are mined in a quarry. Quartz is a good source of very pure silicon dioxide, which can be smelted into elemental silicon in a furnace. The silicon is then purified through chemical processes in a reaction chamber. The product, \"polycrystalline silicon\" is formed, which are rods of silicon that contain billions of tiny silicon crystals. At this point, the silicon is often around 99.9999999% pure. Solar cells work better when they are made from just a single, big crystal. This is because moving electrons get trapped at the crystal surfaces (\"grain boundaries\"). To make single-crystal silicon (monocrystalline silicon), the polycrystalline silicon is first melted in a crucible. Some impurities are also added in, in small amounts, to make the silicon conduct electrons more easily. In the case of HJT solar cells, phosphorus is added in to make \"n-type silicon\". To grow the big crystal, a smaller \"seed crystal\" is dipped into the molten silicon and pulled back out. The silicon that freezes onto that seed crystal becomes part of that same crystal. Using this technique, a very large ingot of monocrystalline silicon can be grown. The ingot comes out in a cylindrical shape. The round parts are cut off to make a long rectangular prism, with the scraps recycled. Then the square ingot is sliced into very thin square pieces. These are the silicon wafers. Nowadays, the wafers are quite large; comparable to a tablet screen, but the thickness is similar to coarse human hair; between 100-200 micrometres. When the wafers are cut from the ingot, they are quite rough and damaged from the sawing process, so they are then chemically polished to remove the damage. They are also chemically textured to make them less reflective; this helps the finished solar cell capture more sunlight. The texturing makes the smooth, shiny surface into a rough one (however this roughness is much more controlled than the damage that the wafer saw creates). === Making the heterojunction solar cell === After the wafers are textured, pure amorphous silicon is coated onto the silicon wafer in a layer only a few nanometres thick. This is also a chemical process called chemical vapour deposition. The purpose of this layer is to refine the surface of the wafer so electrons don't get stuck there. A second amorphous silicon layer is now needed on top. This time, small amounts of impurities such as boron or phosphorus are added to it, depending on which side is being coated. This makes electrical charges in the layer, which encourages electrons to flow towards it (or away from the opposite side). The thickness is similar to the other amorphous silicon layer. Next, a highly conductive transparent coating is applied on top. The coating is usually made from indium tin oxide. This coating helps gather electrons from all across the solar cell and funnel them into metal conductors (the electrodes) on the front or rear of the solar cell. The coating also has special properties that stop light from bouncing off the solar cell. This coating causes the deep blue colour of the solar cell. Finally, the metal conductors can be added. The conductors are typically printed onto the solar cell. This process, called \"screen printing\", is very similar to how t-shirts are printed. However metal paste is used instead of ink. All the above steps are also done on the rear side of the wafer. The heterojunction solar cell is nearly symmetrical, so electricity is generated even if light is shone into the back of the cell. Solar cells that do this are called \"bifacial\". Now that the solar cells are finished, many of them can be connected together into a solar panel. The cells are put between two sheets of glass, and the gaps are filled with plastic. Then an aluminium frame is put on so that the panel can be mounted to a rooftop or a ground stand. ==References== Category:Solar energy Category:Electronic components",
 "title": "Heterojunction solar cell"
}