{
 "id": "1059724",
 "text": "Revolution (2021) was a professional wrestling pay-per-view show made by All Elite Wrestling (AEW). It took place on March 7, 2021, mainly at Daily's Place in Jacksonville, Florida. It was the second Revolution event held by AEW. The main event saw Kenny Omega defeat Jon Moxley in an Exploding Barbed Wire Deathmatch to retain his AEW World Championship. Omega hit the One-Winged Angel on Moxley onto a steel chair and got the pinfall victory. Afterwards, Omega and The Good Brothers (Doc Gallows and Karl Anderson) ended up beating down Moxley. Eddie Kingston jumped into the ring and covered Moxley before the ring exploded. The explosion or lack thereof was mocked and criticized online. Omega was said to be very angry backstage about how the ending happened. Ethan Page and Christian Cage both made their AEW debuts on the show. ==Matches== No. Results Stipulations Times 1 Dr. Britt Baker, D.M.D. and Maki Itoh (with Rebel) defeated Riho and Thunder Rosa Tag team match 14:50 2 The Young Bucks (Matt and Nick Jackson) (c) defeated The Inner Circle (Chris Jericho and MJF) (with Wardlow) Tag team match for the AEW World Tag Team Championship 17:50 3 Rey Fénix (representing Death Triangle) won by last eliminating Jungle Boy (representing Jurassic Express) Casino Tag Team Royale for a future AEW World Tag Team Championship match 26:45 4 Hikaru Shida (c) defeated Ryo Mizunami Singles match for the AEW Women's World Championship 15:10 5 Kip Sabian and Miro (with Penelope Ford) defeated Best Friends (Chuck Taylor and Orange Cassidy) Tag team match 7:50 6 \"Hangman\" Adam Page defeated Matt Hardy Big Money Match 14:40 7 Scorpio Sky defeated Cody Rhodes (with Arn Anderson), Ethan Page, Lance Archer (with Jake Roberts), Max Caster and Penta El Zero Miedo Face of the Revolution ladder match for a AEW TNT Championship match in the future 23:15 8 Darby Allin and Sting defeated Team Taz (Brian Cage and Ricky Starks) (with Hook and Powerhouse Hobbs) Cinematic Street Fight 13:40 9 Kenny Omega (c) (with Don Callis) defeated Jon Moxley Exploding Barbed Wire Deathmatch for the AEW World Championship 25:15 === Casino Tag Team Royale entrances and eliminations === Two tag teams started the match. Every 90 seconds, a new team entered. A team was eliminated when both members of the team were thrown over the top rope and both feet hit the floor. The match continued until there was only one man or team left. Draw Team Entrants Order Eliminated by Eliminations 1 The Natural Nightmares Dustin Rhodes 16 The Butcher, The Blade, The Bunny, and Luchasaurus 0 Q. T. Marshall 7 Himself 3 2 The Dark Order Alan \"5\" Angels 1 Q. T. Marshall 0 Preston \"10\" Vance 15 The Blade 3 The Inner Circle Santana 12 Jungle Boy 2 Ortiz 9 4 The Sydal Brothers Matt Sydal 3 Santana and Ortiz 0 Mike Sydal 2 5 The Dark Order Evil Uno 13 Marko Stunt Stu Grayson 8 Bear Country 6 Gunn Club Austin Gunn 5 Q. T. Marshall 1 Colten Gunn 6 7 The Pretty Picture \"Pretty\" Peter Avalon 4 Gunn Club 0 Cezar Bononi 10 Luchasaurus 8 Varsity Blonds Brian Pillman Jr. 14 The Butcher Griff Garrison 11 Luchasaurus 9 Bear Country Bear Boulder 18 The Butcher 2 Bear Bronson 19 10 Jurassic Express Jungle Boy 29 Rey Fénix 4 Luchasaurus 17 Bear Country 3 11 The Butcher and The Blade The Butcher 23 Daniels and Kazarian 4 The Blade 20 Pac and Fénix 1 12 Private Party Isiah Kassidy 22 Reynolds and Silver 0 Marq Quen 21 Pac and Fénix 13 SoCal Uncensored Christopher Daniels 24 Rey Fénix 1 Frankie Kazarian 26 Pac 14 Death Triangle (Team Winners) Pac 28 Jungle Boy 3 Rey Fénix - Winner (Last man in the ring) 5 15 The Dark Order Alex Reynolds 25 Jungle Boy 1 John Silver 27 Rey Fénix ==Footnotes== ==References== Category:AEW Revolution Category:2020s in Jacksonville, Florida Category:2021 in sports in Florida",
 "title": "Revolution (2021)"
}