{
 "id": "1059878",
 "text": "Fyter Fest (2020) was a two-part professional wrestling show made by All Elite Wrestling (AEW). It took place on July 1 and July 2, 2020 at Daily's Place in Jacksonville, Florida. It was aired on July 1 and July 8, since Night 2 was pre-recorded. Both nights aired as special episodes of Dynamite. It was the second Fyter Fest event held by AEW. The event was originally going to be the United Kingdom debut of AEW and was going to take place at Wembley Arena but it had the be cancelled because of the COVID-19 pandemic. Night 1's main event saw Kenny Omega and Adam Page defeat Best Friends (Chuck Taylor and Trent) to successfully retain their AEW World Tag Team Championships. Night 2's main event saw Chris Jericho defeat Orange Cassidy. The original main event of the show was going to see Brian Cage face Jon Moxley for Moxley's AEW World Championship. However, Moxley's wife Renee Young contracted COVID-19 and the match had to be rescheduled for Fight for the Fallen. ==Matches== ===Night 1 (aired live July 1)=== No. Results Stipulations Times 1 Jurassic Express (Jungle Boy and Luchasaurus) (with Marko Stunt) defeated MJF and Wardlow Tag team match 11:15 2 Hikaru Shida (c) defeated Penelope Ford (with Kip Sabian) Singles match for the AEW Women's World Championship 11:28 3 Cody (c) (with Arn Anderson) defeated Jake Hager (with Catalina Hager) Singles match for the AEW TNT Championship 14:59 4 Private Party (Isiah Kassidy and Marq Quen) (with Matt Hardy) defeated The Inner Circle (Santana and Ortiz) Tag team match 11:23 5 Kenny Omega and Adam Page (c) defeated Best Friends (Chuck Taylor and Trent) Tag team match for the AEW World Tag Team Championship 15:39 (c) – is the champion(s) going into the match ===Night 2 (aired July 8)=== No. Results Stipulations Times 1 Kenny Omega and Adam Page (c) defeated Private Party (Isiah Kassidy and Marq Quen) (with Matt Hardy) Tag team match for the AEW World Tag Team Championship 11:32 2 Lance Archer (with Jake Roberts) defeated Joey Janela (with Sonny Kiss) Singles match 11:17 3 The Butcher, The Blade and the Lucha Brothers (Pentagón Jr. and Rey Fénix) defeated FTR (Cash Wheeler and Dax Harwood) and The Young Bucks (Matt and Nick Jackson) Eight-man tag team match 16:27 4 Nyla Rose defeated Kenzie Paige and KiLynn King Handicap match 2:11 5 Colt Cabana and The Dark Order (Brodie Lee and Stu Grayson) defeated SoCal Uncensored (Christopher Daniels, Frankie Kazarian, and Scorpio Sky) Six- man tag team match 11:27 6 Chris Jericho (with Santana and Ortiz) defeated Orange Cassidy (with Best Friends) Singles match 18:00 (c) – is the champion(s) going into the match ==References== Category:AEW Fyter Fest Category:2020s in Jacksonville, Florida Category:2020 in sports in Florida",
 "title": "Fyter Fest (2020)"
}