{
 "id": "1060770",
 "text": "New Year's Smash (January 2021) was a two-part professional wrestling show made by All Elite Wrestling (AEW). It took place on January 6 and 7, 2021 at the Daily's Place in Jacksonville, Florida. The event aired as special episodes of Dynamite. It was the first New Year's Smash event held by AEW. The event was originally supposed to take place on December 30, 2020, and end on January 6, 2021 but the event was pushed back a week. The Brodie Lee Celebration of Life event took its place to honor the memory of AEW wrestler Brodie Lee who died on December 26. Night 1's main event saw Kenny Omega defeat Rey Fenix to keep his AEW World Championship. Omega hit Fénix with the One-Winged Angel and got the pinfall victory. Night 2's main event saw Darby Allin defeat Brian Cage to keep his AEW TNT Championship. Allin hit Cage with the Crucifix Bomb and got the pinfall victory. ==Matches== === Night 1 (aired live January 6) === No. Results Stipulations Times 1 The Young Bucks (Matt and Nick Jackson) and SoCal Uncensored (Christopher Daniels and Frankie Kazarian) defeated The Acclaimed (Anthony Bowens and Max Caster) and The Hybrid 2 (Angelico and Jack Evans) Eight-man tag team match 9:59 2 Wardlow defeated Jake Hager Singles match 10:17 3 Cody Rhodes (with Snoop Dogg) defeated Matt Sydal Singles match 10:03 4 Hikaru Shida (c) defeated Abadon Singles match for the AEW Women's World Championship 8:27 5 Kenny Omega (c) (with Don Callis) defeated Rey Fenix Singles match for the AEW World Championship 15:03 (c) – is the champion(s) going into the match === Night 2 (aired January 13) === No. Results Stipulations Times 1 Pac (with Lucha Brothers) defeated Eddie Kingston (with The Butcher, The Blade, and The Bunny) Singles match 9:31 2 Miro (with Kip Sabian and Penelope Ford) defeated Chuck Taylor (with Orange Cassidy) Singles match 3:32 3 The Elite (Kenny Omega, Doc Gallows and Karl Anderson) (with Don Callis) defeated Danny Limelight and Varsity Blonds (Brian Pillman Jr. and Griff Garrison) Six-man tag team match 9:21 4 FTR (Cash Wheeler and Dax Harwood) (with Tully Blanchard) defeated Jurassic Express (Jungle Boy and Marko Stunt) Tag team match 12:16 5 Serena Deeb (c) defeated Tay Conti (with Anna Jay) Singles match for the NWA World Women's Championship 9:28 6 Darby Allin (c) defeated Brian Cage (with Ricky Starks and Hook) Singles match for the AEW TNT Championship 13:47 (c) – is the champion(s) going into the match == Footnotes == ==References== Category:AEW New Year's Smash Category:2020s in Jacksonville, Florida Category:2021 in sports in Florida",
 "title": "New Year's Smash (January 2021)"
}