{
 "id": "106040",
 "text": "Wolong National Nature Reserve Simplified Chinese: 卧龙自然保护区|t=臥龍自然保護區 is a national park in Sichuan Province, People's Republic of China. It was established in 1963. The reserve has an area of about 200,000 hectares. There are over 4,000 different species recorded in the reserve.About Wolong , Wolong National Natural Reserve. Wolong National Nature Reserve houses more than 150 endangered giant pandas. In June 1980, the China Research and Conservation Center for the Giant Panda was established. The World Wildlife Fund (WWF) and the Chinese government cooperated to establish the center. Researchers have made trials on how to breed the giant pandas. They have successfully bred 66 panda cubs. A mountain stream runs through the Wolong Valley (where the Reserve is); the stream is heavily armoured with boulders and smaller rounded stones. Stream waters are rather alkaline with pH levels in the range of 8.91. (Hogan, 2007) Water quality turbidity is quite high due to extensive sand and gravel mining in stream.Hogan C.M. & Lumina Tech 2007. Environmental analysis of the Wolong National Nature Reserve. According to a 2001 research by Dr. Jianguo Liu of Michigan State University, the rate of destruction is higher after the reserve's creation than before its creation. Using NASA's satellite images and records of the number of people there, Liu's research team concluded that due to tourism and the increase in the number of people, the reserve is facing an unprecedented threat. \"Tourists do not think they have an impact on panda habitat, but indirectly each visitor has some impact,\" Liu said. \"We do not see ourselves as a destructive force, but we are.\"(April 6, 2001). Endangered Pandas Not Safe in Chinese Nature Reserve , Environment News Service. == References == == Other websites == * Giant panda cubs at Wolong National Nature Reserve * Wolong Panda Club * Dutch informational website about Wolong Category:Biosphere reserves Category:Geography of the People's Republic of China",
 "title": "Wolong National Nature Reserve"
}