{
 "id": "1060367",
 "text": "Fight for the Fallen (2022) was a professional wrestling show made by All Elite Wrestling (AEW). It took place on July 27, 2022 at DCU Center in Worcester, Massachusetts. The event aired for free as special episodes of Dynamite and Rampage respectively. It was the fourth Fight for the Fallen event held by AEW. Like all Fight for the Fallen events, the shows were for charity. The events took place during Shark Week and the money raised was used to help Oceana, a non-profit marine wildlife organization. The money was added to an already $100,000 donation by AEW. The main event of Dynamite saw Daniel Garcia defeated Bryan Danielson and the main event of Rampage saw Anna Jay defeated Ruby Soho. ==Matches== === Dynamite (aired live July 27) === No. Results Stipulations Times 1 Jon Moxley (c) defeated Rush (with José the Assistant) Singles match for the interim AEW World Championship 13:27 2 Ricky Starks (c) defeated Danhausen Singles match for the FTW Championship 0:42 3 Hook defeated Ricky Starks (c) Singles match for the FTW Championship 2:02 4 Sammy Guevara (with Tay Conti) defeated Dante Martin (with Skye Blue) Singles match 9:01 5 Swerve Strickland defeated Tony Nese and \"Smart\" Mark Sterling 2-on-1 Handicap match 6:27 4 Thunder Rosa (c) defeated Miyu Yamashita Singles match for the AEW Women's World Championship 10:11 5 Daniel Garcia defeated Bryan Danielson Singles match 17:15 (c) – is the champion(s) going into the match === Rampage (aired July 29) === No. Results Stipulations Times 1 Orange Cassidy and Best Friends (Chuck Taylor and Trent Beretta) defeated Jay Lethal, Sonjay Dutt, and Satnam Singh Six-man tag team match 7:28 2 Ethan Page defeated Leon Ruffin Singles match 1:30 3 Lee Moriarty defeated Matt Sydal Singles match 7:54 4 Anna Jay defeated Ruby Soho Singles match 9:46 ==References== Category:2022 in American sports Category:AEW Fight for the Fallen Category:Worcester, Massachusetts Category:21st century in Massachusetts",
 "title": "Fight for the Fallen (2022)"
}