{
 "id": "1060885",
 "text": "Vasantakumar Agricultural Institute was established in 1936 as an affiliated institution of Rajshahi College. Unfortunately, the institute faced challenges and was closed in 1952. ==History== On 11 August 1920, Kumar Basant Kumar Roy, the second son of Raja Pramthanath of Dighapatia, generously donated 2,50,000 rupees for the establishment of an agricultural institute in Rajshahi through a will. The Basant Kumar Roy Trust, the trustees of the donation, contributed an additional one lakh rupees. Although the government accepted Vasantakumar's donation, the institute could not be established until 1936 due to various reasons. Over the span of 16 years, the initial donation increased to about four lakh taka. Vasantakumar Agricultural Institute was officially established in Rajshahi under the administration of the Principal of Rajshahi College through a Government Notification dated 12th May 1963. ==Activities== The institute commenced operations by renovating the kitchen and dining hall building of the hostel on Natore Road, adjacent to Rani Hemanthakumari Hostel of Rajshahi College. Practical classes were conducted by coordinating with government agricultural farms. In 1936, 16 students were admitted, and 7 of them successfully passed and secured employment. ==The End== The institute flourished until 1948 but faced a decline after the creation of Pakistan. From 1948 to 1952, it remained inactive. Unfortunately, after the country's division, the original deed through which funds were allocated for Vasantakumar Agricultural Institute could not be recovered. Additionally, key contributors to the institution left the country, and some passed away, posing a threat to its existence. In June 1952, an application was submitted to the government for the institution's reopening, but approval was not granted. By the end of 1952, the government issued an order, leading to the complete closure of the institution. Category:Colleges and universities in Bangladesh Category:Rajshahi Division",
 "title": "Vasantakumar Agricultural Institute"
}