{
 "id": "1060166",
 "text": "Fight for the Fallen (2019) was a professional wrestling pay-per-view show made by All Elite Wrestling (AEW). It took place on July 13, 2019 at the Daily's Place in Jacksonville, Florida. It was the first Fight for the Fallen event made by AEW. Like all Fight for the Fallen events, the show was for charity. The money raised was used to help victims of gun violence through the Jacksonville Victim Assistance Advisory Council. The event was also sponsored by Farah & Farah, a Jacksonville personal injury law firm. The main event saw The Young Bucks (Matt and Nick Jackson) defeat The Brotherhood (Cody and Dustin Rhodes). Matt and Nick hit the Meltzer Driver on Cody before getting the pinfall victory. The event streamed live for free on B/R Live in North America and aired on pay-per-view internationally. It was the only Fight for the Fallen event to happen as a PPV event, as future events under that name aired as special episodes of AEW's television shows Dynamite, Rampage, and Collision. ==Matches== No. Results Stipulations Times 1 Sonny Kiss defeated Peter Avalon (with Leva Bates) Singles match 5:10 2 Bea Priestley and Shoko Nakajima defeated Dr. Britt Baker, D.M.D. and Riho Tag team match 15:15 3 MJF, Sammy Guevara, and Shawn Spears defeated Darby Allin, Jimmy Havoc, and Joey Janela Six-man tag team match 13:15 4 Brandi Rhodes (with Awesome Kong) defeated Allie Singles match 11:00 5 The Dark Order (Evil Uno and Stu Grayson) defeated Angélico and Jack Evans and Jurassic Express (Jungle Boy and Luchasaurus) (with Marko Stunt) Three-way tag team match 15:15 6 Adam Page defeated Kip Sabian Singles match 19:05 7 Lucha Brothers (Pentagón Jr. and Rey Fénix) defeated SoCal Uncensored (Frankie Kazarian and Scorpio Sky) (with Christopher Daniels) Tag team match 15:10 8 Kenny Omega defeated Cima Singles match 22:30 9 The Young Bucks (Matt and Nick Jackson) defeated The Brotherhood (Cody and Dustin Rhodes) Tag team match 31:25 ==References== Category:2019 in sports Category:2019 in the United States Category:AEW Fight for the Fallen Category:Sports in Jacksonville, Florida Category:History of Jacksonville, Florida",
 "title": "Fight for the Fallen (2019)"
}