{
 "id": "1060620",
 "text": "Holiday Bash (2021) was a professional wrestling show made by All Elite Wrestling (AEW). It took place on December 22, 2021 at the Greensboro Coliseum in Greensboro, North Carolina. It was the second Holiday Bash event held by AEW. The event aired as special episodes of Dynamite and Rampage respectively. Dynamite aired in it's normal timeslot while Rampage aired on delay on December 25 at 9pm ET. It was pushed back because of a tradition that TNT has where they show the 1983 movie A Christmas Story during their holiday marathon. Dynamite's main event of the event saw CM Punk, Sting, and Darby Allin defeat The Pinnacle (MJF and FTR (Dax Harwood and Cash Wheeler)). Rampage's main event saw Cody Rhodes defeat Sammy Guevara to win the AEW TNT Championship. During the event, Kyle O'Reilly made his AEW debut. He helped Adam Cole during his match. This was first time that all three original members of The Undisputed Era were reunited since their time in NXT. ==Matches== === Dynamite (aired live December 22) === No. Results Stipulations Times 1 Adam Cole defeated Orange Cassidy Singles match 17:21 2 Wardlow (with Shawn Spears) defeated Capt. Shawn Dean Singles match 1:12 3 Ruby Soho defeated Nyla Rose (with Vickie Guerrero) AEW TBS Championship tournament semifinals match 14:36 4 Malakai Black defeated Griff Garrison (with Brian Pillman Jr.) by submission Singles match 3:12 5 CM Punk, Sting, and Darby Allin defeated The Pinnacle (MJF and FTR (Dax Harwood and Cash Wheeler)) Six- man tag team match 26:01 === Rampage (aired December 25) === No. Results Stipulations Times 1 Jungle Boy (with Luchasaurus and Christian Cage) defeated Isiah Kassidy (with Marq Quen and Matt Hardy) Singles match 8:55 2 Hook defeated Bear Bronson (with Bear Boulder) by submission Singles match 3:06 3 Kris Statlander (with Orange Cassidy) defeated Leyla Hirsch by submission Singles match 6:22 4 Cody Rhodes (with Arn Anderson) defeated Sammy Guevara (c) Singles match for the AEW TNT Championship 15:09 (c) – is the champion(s) going into the match ==References== Category:2021 in American sports Category:2020s in North Carolina Category:AEW Holiday Bash Category:Greensboro, North Carolina Category:Sports in North Carolina",
 "title": "Holiday Bash (2021)"
}