{
 "id": "1060118",
 "text": "Fyter Fest (2021) was a two-part professional wrestling show made by All Elite Wrestling (AEW). It took place on July 14 and July 21, 2021. The first week was held at the H-E-B Center at Cedar Park in Cedar Park, Texas and the second week was held at the Curtis Culwell Center in Garland, Texas. Both nights were aired as special episodes of Dynamite. It was the third Fyter Fest event held by AEW. Week 1's main event saw Darby Allin defeat Ethan Page in a Coffin match. Week 2's main event saw Lance Archer defeat Jon Moxley by knockout to win the IWGP United States Heavyweight Championship. ==Matches== === Night 1 (aired live July 14) === No. Results Stipulations Times 1 Jon Moxley (c) defeated Karl Anderson Singles match for the IWGP United States Heavyweight Championship 11:12 2 Ricky Starks (with Hook and Powerhouse Hobbs) defeated Brian Cage (c) Singles match for the FTW Championship 9:52 3 Christian Cage defeated Matt Hardy Singles match 13:07 4 Sammy Guevara defeated Wheeler Yuta (with Chuck Taylor and Orange Cassidy) Singles match 4:33 5 Yuka Sakazaki defeated Penelope Ford Singles match 6:45 6 Darby Allin defeated Ethan Page Coffin match 15:22 (c) – is the champion(s) going into the match === Night 2 (aired live July 21) === No. Results Stipulations Times 1 Chris Jericho defeated Shawn Spears (with Tully Blanchard) Chairs match 10:47 2 Doc Gallows (with Karl Anderson) defeated Frankie Kazarian Singles match 6:53 3 Darby Allin (with Sting) defeated Wheeler Yuta (with Orange Cassidy) Singles match 4:00 4 Dr. Britt Baker, D.M.D. (c) (with Rebel) defeated Nyla Rose (with Vickie Guerrero) Singles match for the AEW Women's World Championship 12:11 5 Orange Cassidy (with Kris Statlander) defeated The Blade (with The Bunny) Singles match 8:37 6 Lance Archer (with Jake Roberts) defeated Jon Moxley (c) by knockout Texas Death match for the IWGP United States Heavyweight Championship 13:09 (c) – is the champion(s) going into the match ==References== Category:2021 in American sports Category:2021 in Texas Category:AEW Fyter Fest Category:2020s in sports in Texas",
 "title": "Fyter Fest (2021)"
}