{
 "id": "1060720",
 "text": "Toki Air, officially , is a Japanese low-cost, regional airline based at Niigata Airport. It was founded on July 29, 2020 and is expected to start operations in late 2023. == History == Toki Air was made in July 29, 2020 in order to connect regional and stray areas across the country. The company signed a agreement with the NAC for two ATR 72-600s. The company also signed a ten-year GMA with ATR for its two ordered 72-600s. Toki Air also plans to introduce the ATR 42-600S variant which is currently under development by ATR. Toki Air, is expected to have its first ATR 42-600S in early 2025. The cost of the airplane will make the company the first Japanese airline to operate this type of aircraft. Toki Air took delivery of its first ATR 72 on October 10, 2022. The airplane arrived at its hub at Niigata Airport on November 5, 2022. The government of Niigata Prefecture extended 1.16 billion yen in financing to Toki on October 31, 2022. Toki formally signed up for an air operator's award on November 30, 2022, which was approved by the East Japan Civil Aviation Bureau of the Ministry of Land, Infrastructure, Transport and Tourism on March 31, 2023.航空運送事業の許可について - 国土交通省 令和5年3月31日 Toki would be the first new locally- owned Japanese airline in 14 years (after Fuji Dream Airlines). On August 28, 2023, a 66-year-old former worker of Oriental Air Bridge, who was the boss of the safety zone, was continued after it was discovered that the employee had illegally downloaded and transferred secret documents from the airline on November 25, 2022. The worker retired from the airplane business in December 2022 and later joined Toki Air. The employee told the truth and stated that \"I took these (the papers), because I thought it would be useful my next company's work.\" Toki Air stated that they had lowered the rank of the employee and reported the incident to the Japan Civil Aviation Bureau. Oriental Air Bridge in an talk stated that there was no impact of flight safety and the airline would work to prevent such incident from happening again. == Fleet == === Current fleet === The Toki Air fleet consists of the following aircraft (as of October 2022): Toki Air Fleet Aircraft In Fleet Orders Passengers Notes ATR 72-600 2 0 70 First aircraft delivered in 2022. ATR 42-600S 0 4 48 Delivery planned in early 2025 Toki Air is one of several airlines advising Heart Aerospace on its proposed ES-30 electric airliner. == References == == Other websites == * * TOKI Aviation Capital Category:2020 establishments in Japan Category:Airlines of Japan Category:Niigata Prefecture",
 "title": "Toki Air"
}