{
 "id": "1060119",
 "text": "Karenjit Kaur Vohra also known by her stage name Sunny Leone, is an actress, model and former pornographic actress. She has also participated in the Indian version of Big Brother called Bigg Boss (Hindi season 5). Currently she works in Hindi movies. == Early life == Sunny was born on May 13, 1981 as Karenjit Kaur Vohra, in Sarnia, Ontario, to a Sikh Indian Punjabi family. She has a younger brother named Sundeep Vohra who is a celebrity chef by profession. Sunny described herself as an athletic tomboy ever since she was just a little girl. == Pornographic career == Before working in the porn industry, she worked at a German bakery called Jiffy Lube store, and then worked in a tax and retirement firm.She also studying to become a nurse. She chose her younger brother's name as her stage name. Her first movie was titled Sunny, which was released in December 2005. and next movie was also produced by Vivid Entertainment, whose name was the Virtual Vivid Girl Sunny Leone. This was the first tie in the history of Vivid that a movie was released under the name of an actress. This movie helped to win her first AVN Award. She then starred in two movies Sunny in Brazil and The Sunny Experiment, which were released in October and December 2007. In that same year Sunny signed Vivid's another contract for six movies. And it was under this contract that she worked with a male actor for the first time. Sunny's fiance Matt Erikson played her co-star in the movie and that movie was titled Sunny Loves Matt. also that year she did her breast implant. In January 2008, Sunny announced that she would no longer work with Erikson and had done scenes with other actors such as Tommy Gunn, Charles Dera, James Deen and VooDoo. In August 2009, She announced the launch of her own studio, Sunlust Picture. In her new venture, she began writing, directing and creating her own style of adult movies with the help of Vivid Entertainment in the distribution of the movies. In 2013, Sunny announced that she had retired from porn industry. She said \" I am lucky that the audience is accepting me. I have come my way from there (porn industry). I don't have plans as of now to go back there.\" == Filmography == == References == == Other websites == * Category:Living people Category:1981 births Category:Indian actors Category:Pornographic actors",
 "title": "Sunny Leone"
}