{
 "id": "1060444",
 "text": "Blood & Guts (2021) was a professional wrestling show made by All Elite Wrestling (AEW). It took place on May 5, 2021 at the Daily's Place in Jacksonville, Florida, and aired as a special episode of Dynamite. It was the first Blood & Guts event made by AEW. The event was originally going to be held at the Prudential Center in Newark, New Jersey on March 25, 2020, but was pushed back a year because of the COVID-19 pandemic. The second hour of the episode, including the main event aired live, but the first hour of was recorded before the show. The main event saw The Pinnacle (MJF, Wardlow, Shawn Spears, Cash Wheeler, and Dax Harwood) defeat The Inner Circle (Chris Jericho, Jake Hager, Sammy Guevara, Santana, and Ortiz) in a Blood and Guts match. The match was ended after Jericho got thrown off the top of the cell and Guevara decided to surrender the match. While the main event was praised, the ending with Jericho being thrown off onto an obvious crash pad disguised as a steel platform was criticized. ==Matches== No. Matches Stipulations Times 1 Eddie Kingston and Jon Moxley defeated Kenny Omega and MT Nakazawa (with Don Callis) Tag team match 8:02 2 Cody Rhodes (with Arn Anderson) defeated Q. T. Marshall (with The Factory (Aaron Solo, Anthony Ogogo, and Nick Comoroto)) Singles match 12:19 3 Dr. Britt Baker, D.M.D. (with Rebel) defeated Julia Hart Singles match 1:29 4 SoCal Uncensored (Christopher Daniels and Frankie Kazarian) defeated Jurassic Express (Jungle Boy and Luchasaurus) (with Marko Stunt), Varsity Blonds (Brian Pillman Jr. and Griff Garrison), and The Acclaimed (Anthony Bowens and Max Caster) Four-way tag team match 9:12 5 The Pinnacle (MJF, Wardlow, Shawn Spears, Cash Wheeler and Dax Harwood) (with Tully Blanchard) defeated The Inner Circle (Chris Jericho, Jake Hager, Sammy Guevara, Santana and Ortiz) by surrender Blood and Guts match 33:58 ==References== Category:2021 in sports in Florida Category:AEW Blood and Guts Category:2020s in Jacksonville, Florida",
 "title": "Blood & Guts (2021)"
}