{
 "id": "1060609",
 "text": "Grand Slam (2023) was a professional wrestling show made by All Elite Wrestling (AEW). It took place on September 20, 2023 at Arthur Ashe Stadium in Flushing, Queens, New York. The event aired as special episodes of Dynamite and Rampage respectively. It was the third Grand Slam event held by AEW. The main event of Dynamite saw MJF defeat Samoa Joe to keep his AEW World Championship. The main event of Rampage saw The Elite (Matt Jackson, Nick Jackson, and \"Hangman\" Adam Page) defeat Mogul Embassy (Brian Cage, Bishop Kaun, and Toa Liona) in a six-man tag team match to win the ROH World Six-Man Tag Team Championships. ==Matches== === Dynamite (aired live September 20) === No. Results Stipulations Times 1 Eddie Kingston (Strong) defeated Claudio Castagnoli (ROH) (with Wheeler Yuta) Winner Takes All match for the ROH World Championship and Strong Openweight Championship 15:15 2 Chris Jericho defeated Sammy Guevara Singles match 16:10 3 Rey Fénix (with Alex Abrahantes) defeated Jon Moxley (c) Singles match for the AEW All-Atlantic Championship 11:35 4 Saraya (c) (with Ruby Soho) defeated Toni Storm Singles match for the AEW Women's World Championship 8:30 5 MJF (c) defeated Samoa Joe Singles match for the AEW World Championship 18:40 (c) – is the champion(s) going into the match === Rampage (aired September 22) === No. Results Stipulations Times 1 Sting and Darby Allin (with Nick Wayne) defeated Christian Cage and Luchasaurus Tag team match 7:42 2 Hook, Kris Statlander, and Orange Cassidy defeated Angelo Parker, Anna Jay, and Matt Menard (with Jake Hager) Six-person mixed tag team match 9:24 3 The Righteous (Dutch and Vincent) defeated Best Friends (Chuck Taylor and Trent Beretta), The Kingdom (Matt Taven and Mike Bennett), and The Hardys (Matt Hardy and Jeff Hardy) Four-way tag team match for a ROH World Tag Team Championship match at WrestleDream 9:28 4 Billy Gunn and The Acclaimed (Max Caster and Anthony Bowens) (c) defeated The Dark Order (Alex Reynolds, Evil Uno, and John Silver) Six-man tag team match for the AEW World Trios Championship 10:38 5 Julia Hart (with Brody King) defeated Skye Blue Singles match 8:14 6 Mike Santana defeated Boulder Singles match 2:24 7 The Hung Bucks (Matt Jackson, Nick Jackson, and \"Hangman\" Adam Page) defeated Mogul Embassy (Brian Cage, Bishop Kaun, and Toa Liona) (c) (with Prince Nana) Six-man tag team match for the ROH World Six-Man Tag Team Championship 11:56 (c) – is the champion(s) going into the match ==References== Category:2023 in sports Category:2023 in the United States Category:AEW Grand Slam Category:Sports in New York City",
 "title": "AEW Grand Slam (2023)"
}