{
 "id": "1060191",
 "text": "The International Rules Series (IRS) is a men's international rules football series played between two teams: an Australian team (selected by the Australian Football League) and an Irish team (selected by the Gaelic Athletic Association). The first series was played in 1984 and the most recent was held in 2017. The series was meant to return in 2020, but it was cancelled because of the COVID-19 pandemic. Australia and Ireland have both won the series 10 times each, with Australia being the most recent champions. ==Results== Series results, up to and including the 2017 series. Country Series won Test wins Test draws* Test losses Ireland 10 21 2 19 Australia 10 19 2 21 *Two draws (second Test, 1999; second Test, 2002) *Two draws (second Test, 1999; second Test, 2002) *Two draws (second Test, 1999; second Test, 2002) *Two draws (second Test, 1999; second Test, 2002) *Two draws (second Test, 1999; second Test, 2002) ==Trophy== The trophy given to the series' winner is called the Cormac McAnnallen Cup, named after former Tyrone GAA captain Cormac McAnnallen, who died from a heart condition at 24 years old after he represented Ireland for three series in a row. The trophy was named in his honour in 2004, the year he died. ==Venues== ===Australia=== Venue City State Tests hosted Subiaco Oval (Domain Stadium/Patersons Stadium) Perth Western Australia 5 Melbourne Cricket Ground (MCG) Melbourne Victoria 4 Football Park (AAMI Stadium) Adelaide South Australia 3 (3rd Test 1986, 2nd Test 1999, 1st Test 2001) Western Australia Cricket Assoc. (WACA) Ground Perth Western Australia 2 (1st Test 1986 & 3rd Test 1990) Waverley Park Melbourne Victoria 2 (2nd Test 1986 & 1st Test 1990) Docklands Stadium (Telstra Dome/Etihad Stadium/Marvel Stadium) Melbourne Victoria 2 (2nd Test 2005 & 1st Test 2011) Canberra Stadium (GIO Stadium Canberra) Canberra Australian Capital Territory 1 (2nd Test 1990) Carrara Stadium (Metricon Stadium) Gold Coast Queensland 1 (2nd Test 2011) Adelaide Oval Adelaide South Australia 1 (1st Test 2017) ===Ireland=== Venue City County Tests hosted Croke Park Dublin Dublin 17 Páirc Uí Chaoimh Ballintemple Cork 1 (1st Test 1984) Pearse Stadium Salthill Galway 1 (1st Test 2006) Gaelic Grounds Limerick Limerick 1 (1st Test 2010) Breffni Park Cavan Cavan 1 (1st Test 2013) ===Location maps=== ==Notes== ==References== Category:International rules football",
 "title": "International Rules Series"
}