{
 "id": "1060458",
 "text": "The Brodie Lee Celebration of Life was a professional wrestling show made by All Elite Wrestling (AEW). It took place on December 30, 2020 at the Daily's Place in Jacksonville, Florida, and aired as a special episode of Dynamite. The event was a memorial event for American professional wrestler and former TNT Champion Brodie Lee, who had died from idiopathic pulmonary fibrosis four days before the show. ==The event== The event started with AEW commentator Jim Ross saying \"It's Wednesday and you know what that means\", which was one of Lee's catchphrases. The AEW roster and Lee's family then stood on the stage in silence as the ring bell was tolled 10 times as is tradition when a wrestler dies. Throughout the show, many different wrestlers and other people in AEW spoke to a camera and shared different stories and memories of their time with Lee. There were different tributes on the show such as wrestlers wearing RIP Brodie Lee armbands, using his moves and wearing similar outfits to what he wore throughout his career. During a six-man tag team match between the team of \"Hangman\" Adam Page and Lee's former stable The Dark Order (Alex Reynolds and John Silver), and The Inner Circle (MJF, Santana, and Ortiz), Silver was attacked by MJF's manager Wardlow, but was saved by a debuting Erick Redbeard (also known as Erick Rowan), who was Lee's (then known as Luke Harper) former tag team partner in WWE. At the end of the show, Lee's wrestling boots and a bandana was left in the middle of the ring by his widow Amanda Huber and son Brodie. AEW President and CEO Tony Khan retired the red AEW TNT Championship out of tribute. He awarded Lee's son Brodie the championship and name him \"TNT Champion for life\". ==Matches== No. Results Stipulations Times 1 Colt Cabana and The Young Bucks (Matt and Nick Jackson) defeated Matt Hardy and Private Party (Isiah Kassidy and Marq Quen) Six-man tag team match 15:31 2 Lance Archer and The Dark Order (Evil Uno and Stu Grayson) (with Jake Roberts) defeated Eddie Kingston, The Butcher and The Blade (with The Bunny) Six-man tag team match 9:40 3 \"Hangman\" Adam Page and The Dark Order (Alex \"3\" Reynolds and John \"4\" Silver) defeated The Inner Circle (MJF, Santana and Ortiz) (with Wardlow, Sammy Guevara, and Jake Hager) Six-man tag team match 12:42 4 Anna \"99\" Jay and Tay Conti defeated Dr. Britt Baker, D.M.D. and Penelope Ford (with Rebel, Kip Sabian, and Miro) Tag team match 10:02 5 Cody Rhodes, Orange Cassidy, and Preston \"10\" Vance (with Arn Anderson and Alan \"5\" Angels) defeated Team Taz (Brian Cage, Ricky Starks, and Powerhouse Hobbs) (with Taz and Hook) Six-man tag team match 11:35 ==References== Category:All Elite Wrestling shows Category:2020s in Jacksonville, Florida Category:2020 in sports in Florida",
 "title": "Brodie Lee Celebration of Life"
}