{
 "id": "1060691",
 "text": "SC Columbia Floridsdorf is a Austrian football club located in the 21st district of Vienna. They play since the 2019/20 season in the 2nd regional league, the fifth highest division . The club colors are blue, black and white. ==History== The club SC Columbia XXI was founded in 1908. In September 1908 the club was registered with the club authorities and football association. After the end of the First World War they got a own ground. 1964 the club had to move to Schwarzlackenau. Since 1927 Columbia XXI had been playing for the VAFÖ championship. After the dissolution of the VAFÖ in 1934, the Columbians joined the Vienna Football Association, where they played in the lower leagues. After the annexation of Austria by the German Reich in 1938 they were not allowed to play until a pleasant club management was found. After winning the third division in 1943 they were promoted to the second division for the first time in the club's history. After the end of the war, the club had its best days. In 1946 and 1947 fourth place in the second league was reached. The departure of Columbia XXI's best players to larger Viennese clubs weakened the team. With the introduction of the state league in 1950 they were relegated and did not come back to the 2nd league. The Columbians fell into the 1st Class B by 1957 and subsequently played in the lowest Viennese football leagues. It wasn't until 1999 that they returned to the fourth-tier Vienna City League. In 2008 the came back to the Stadtliga. In the same year they also celebrated their 100th anniversary. In the 2009/10 season they were promoted to the Regionalliga East. Columbia ended their first season in the third highest division in 14th place out of 16. The club was not relegated because eleventh-placed FC Waidhofen/Ybbs voluntarily relegated due to financial problems. In 2012 however, Columbia finished in last place and was relegated to the Vienna City League. After being relegated again, SC Columbia is currently in the fifth highest league, the 2nd Landesliga Vienna. Category:Austrian football clubs Category:Football clubs of Vienna Category:1908 establishments in Europe Category:1900s establishments in Austria",
 "title": "SC Columbia XXI Floridsdorf"
}