{
 "id": "1061154",
 "text": "A lot of earthquakes started happening in the Reykjanes Peninsula in southeast Iceland on 24 October 2023. This was because hot molten rock called magma was moving beneath the ground in that area. The earthquakes became more frequent and powerful on November 10, with 20,000 tremors counted by November 10. The biggest one was stronger than magnitude 5.1. People were told to leave the town of Grindavík, which was close to where the ground was shaking a lot. == Background == While earthquakes happen a lot in Iceland because the island is located where the Eurasian and North American tectonic plates meet, the recent group of earthquakes was noticed to be larger than usual. Since 2021, there have been three volcanic eruptions in the Reykjanes Peninsula. The 2023 earthquakes is connected to a molten rock intrusion, estimated to be about 15 kilometers long, extending in a southwest direction from Kálfellsheiði. It follows the Sundhnúkur crater chain at a depth of approximately 800 meters. The largest quake started beneath the Sundhnúkur craters but then moved southwest, passing under Grindavik and reaching the sea. The town is located on lava that erupted from Sundhnúkur around 2,350 years ago. It is one of six communities on the peninsula situated on or near a crack where eruptions happened. == Timeline == On October 13, the Icelandic Meteorological Office (IMO, Icelandic: Veðurstofa Íslands) initially said there might be a magma intrusion near the active volcano Fagradalsfjall on the Reykjanes Peninsula. Before that, around 700 earthquakes were noted earlier in the month, with the biggest one measuring magnitude 3.3. === 24–30 October === A bunch of earthquakes started on the evening of October 24 because of the hot molten rock moving underground. The earthquakes became less strong by October 30. Around 8,000 earthquakes were found, and most of them happened about 2 to 4 kilometers below the surface. === 10-11 November === The largest earthquake had a magnitude of 5.1. The shaking ground got a lot of attention from global media. The Icelandic Meteorological Office (IMO) said there's a high chance of an eruption, mentioning that it would take several days, not just hours, for the hot molten rock to reach the surface. == Volcanic eruption 18-21 December == At 22:17 local time GMT on 18 December 2023, a volcanic eruption occurred at the Sundhnúkur volcano, north of the town of Grindavík, with lava spewing from fissures in the ground. The intensity of the eruption and accompanying earthquake activity decreased early on 19 December 2023, with lava seen spreading from both sides of the newly opened fissures. The eruption was described as the largest in the Reykjanes Peninsula since the beginning of the first volcanic eruption in 2021, with lava fountains, up to high, and was visible as far away as the capital Reykjavík, away. The eruption ended on 21 December 2023, after the Icelandic Meteorological Office (IMO) said no lava was erupting after a flight over the volcano, but clarified that it was \"too early to declare the eruption over.\" Sundhnúkur is a crater row and currently active volcanic fissure that is part of the Reykjanes Peninsula rift zone. == Impact == The people in charge of the Blue Lagoon said they are closing the place to visitors from November 9 to 16 as a safety measure after the earthquakes. There was fear when rocks from the earthquakes fell onto roads nearby, and 30 guests left the resort after a 4.8 tremor on the early morning of November 9. After the 5.1 earthquake happened on November 10, a road north of Grindavík was harmed and then closed by the police. A big crack showed up on the land of the town's golf course. A state of emergency was announced, and evacuation plans for Grindavík were started that evening. The Icelandic civil protection authority sent the patrol boat Thor to the area for safety reasons. They also shut down all roads to Grindavik, except for emergencies and evacuations. == References == Category:Southern Peninsula (Iceland) Category:2023 disasters in Europe Category:2020s in Iceland Category:2023 earthquakes Category:Earthquakes in Europe Category:October 2023 events Category:November 2023 events",
 "title": "2023 Iceland earthquakes"
}