{
 "id": "1061186",
 "text": "Armand \"Mondo\" Duplantis\"Franska avslöjandet: Mondos okända mellannamn\" Retrieved 25 July 2021 (born 10 November 1999) is a Swedish-American pole vaulter, the current world outdoor and indoor record holder ( and ), the current Olympic and two time World outdoor (2022 and 2023) and one-time indoor champion, the current European champion, and the current Diamond League champion. He won the silver medal at the 2019 World Championships. Duplantis is a two-time European champion from 2018, when he set current world under-20 record, and from 2022. ==Achievements== Information from World Athletics profile. ===International competitions=== 2015 World U18 Championships Cali, Colombia 1st 5.30 m 2016 World U20 Championships Bydgoszcz, Poland 3rd 5.45 m 2017 European U20 Championships Grosseto, Italy 1st 5.65 m CR 2017 World Championships London, United Kingdom 9th 5.50 m 2018 World Indoor Championships Birmingham, United Kingdom 8th 5.70 m 2018 World U20 Championships Tampere, Finland 1st 5.82 m CR 2018 European Championships Berlin, Germany 1st 6.05 m 2019 World Championships Doha, Qatar 2nd 5.97 m 2021 European Indoor Championships Toruń, Poland 1st 6.05 m i CR 2021 Olympic Games Tokyo, Japan 1st 6.02 m After securing the gold medal he narrowly failed three attempts at the world record-breaking measure of 6.19, see 2022 World Indoor Championships Belgrade, Serbia 1st 6.20 m i WR 2022 World Championships Eugene, OR, USA 1st 6.21 m WR 2022 European Championships Munich, Germany 1st 6.06 m CR 2023 World Championships Budapest, Hungary 1st 6.10 m 2024 World Indoor Championships Glasgow, United Kingdom 1st 6.05 m i 2024 European Championships Rome, Italy 1st 6.10 m CR 2024 Olympic Games Paris, France 1st 6.25 m WR Source: == References == Category:1999 births Category:Living people Category:Swedish athletes Category:American track and field athletes Category:Pole vaulters Category:Sportspeople from Louisiana Category:People from Lafayette, Louisiana Category:Olympic gold medalists for Sweden Category:Olympic gold medalists for the United States Category:World record holders",
 "title": "Armand Duplantis"
}