{
 "id": "1061815",
 "text": "The G1 Climax is a tournament held by New Japan Pro-Wrestling (NJPW). It is considered to be the most important tournament in the company. The tournament was first created by Antonio Inoki and was first held in 1974. The name of the tournament was originally called the World League from 1974 until 1977, the MSG League from 1978 until 1982, and the IWGP League from 1983 until 1988. The tournaments under these names are not viewed as part of the official history of the G1 Climax by New Japan however. The first tournament under the G1 name was held from August 7 until August 11, 1991. Seiji Sakaguchi, president of New Japan, named the tournament after a horse race. The current rules of the G1 Climax tournament are held in a round-robin format. There are two blocks of wrestlers who fight for points. A wrestler who gets a win gets two points for a victory, a wrestler who gets a draw gets one point, and a wrestler who loses doesn't get a point. The wrestler from each block who has the most points will then fight each other in the finals to decide who the winner of the G1 will be. The tournament is held for four weeks. In 2022, the tournament would go back to having four blocks for the first time since 2000. The first non- Japanese wrestler to win the G1 was Kenny Omega in 2016. Tetsuya Naito is the current winner. ==Tournament winners== Tournament Year Winner 1974 Antonio Inoki 1975 Antonio Inoki 1976 Seiji Sakaguchi 1977 Seiji Sakaguchi 1978 Antonio Inoki 1979 Antonio Inoki 1980 Antonio Inoki 1981 Antonio Inoki 1982 André the Giant rowspan=\"6\" 1983 Hulk Hogan 1984 Antonio Inoki 1985 André the Giant 1986 Antonio Inoki 1987 Antonio Inoki 1988 Antonio Inoki 1989 Riki Choshu 1991 Masahiro Chono 1992 Masahiro Chono 1993 Tatsumi Fujinami 1994 Masahiro Chono 1995 Keiji Mutoh 1996 Riki Choshu 1997 Kensuke Sasaki 1998 Shinya Hashimoto 1999 Manabu Nakanishi 2000 Kensuke Sasaki 2001 Yuji Nagata 2002 Masahiro Chono 2003 Hiroyoshi Tenzan 2004 Hiroyoshi Tenzan 2005 Masahiro Chono 2006 Hiroyoshi Tenzan 2007 Hiroshi Tanahashi 2008 Hirooki Goto 2009 Togi Makabe 2010 Satoshi Kojima 2011 Shinsuke Nakamura 2012 Kazuchika Okada 2013 Tetsuya Naito 2014 Kazuchika Okada 2015 Hiroshi Tanahashi 2016 Kenny Omega 2017 Tetsuya Naito 2018 Hiroshi Tanahashi 2019 Kota Ibushi 2020 Kota Ibushi 2021 Kazuchika Okada 2022 Kazuchika Okada 2023 Tetsuya Naito ==References== ==Other website== * (in Japanese) Category:New Japan Pro-Wrestling",
 "title": "G1 Climax"
}