{
 "id": "1061997",
 "text": "Ernesto Lazzatti (25 September 1915 - 30 December 1988) was an Argentine football midfielder and sports journalist. He played as a centre-half. At the beginning of his career, in the Quinta División of Puerto Comercial, he played as a right inside; it was Santos Ursino, the first-team centre-half, who advised him to change his position, taking on more defensive duties. Lazzatti was inspired by Luis Monti and Adolfo Zumelzú, players he admired for their very different characteristics; another of his role models was Santos Ursino himself. Gifted with a clear vision of the game and a sense of timing in passing, he demonstrated his skills from a young age, so much so that he was nicknamed El Pibe de Oro (the golden boy). In addition to his technical qualities, he was also able to make passes, both short and long, and to play in the air; One of his weaknesses was his shooting accuracy, which he lacked. He was also a fair player: during his career he was never sent off. Osvaldo Soriano called him \"the best centre-half Boca Juniors have ever had\". Lazzatti is considered as one of best center-halves of all time. ==Club career== Ernesto Lazzatti was born on September 25, 1915 in Ingeniero White, a neighborhood of Bahía Blanca, in the province of Buenos Aires. He started playing football at Puerto Comercial, a club based in Bahía Blanca, where he was spotted by scouts from the capital's Boca Juniors. The Juniors signed Ernesto Lazzatti as a professional player in 1934. The midfielder spent the next thirteen years with Boca Juniors, making 379 league appearances, scoring sixteen goals, he made an outstanding midfield line with Carlos Sosa and Natalio Pescia. In his first season with the club from the working-class district of La Boca, Lazzatti won the Argentine championship. In the 1934 Primera División, Boca Juniors were in first place at the end of all matchdays, one point ahead of Independiente Avellaneda. The following year, they were able to defend this championship, this time three points separated Boca from their main rivals Independiente. It took five years until 1940 for Boca Juniors and Ernesto Lazzatti to win the Argentine championship again. Again ahead of Independiente, they finished first in the Primera División, which meant Ernesto Lazzatti's third championship with Boca Juniors. With El Pibe de Oro, Lazzatti's nickname, which Diego Maradona was also given decades later, Boca Juniors were successful again in the 1943 season. They finished first in the Primera División, one point ahead of defending champions CA River Plate. And a year later, Ernesto Lazzatti won his fifth and final league title in a Boca Juniors shirt. This time, they left River Plate behind by two points. Ernesto Lazzatti played for Boca Juniors until 1946, when he left the club for Uruguay. Lazzatti joined Danubio FC and spent two more years playing Uruguayan football before retiring in 1948 at the age of 33. ==International career== In 1936 and 1937, Ernesto Lazzatti made four appearances for the Argentine national football team. He did not manage to score. It was during this time that the team took part in the Campeonato Sudamericano 1937, which was won by the Argentine team. In the decisive final match in front of 80,000 spectators at the old Estadio Gasómetro in San Lorenzo, the Argentine team led by players such as Vicente de la Mata, Roberto Cherro and Antonio Sastre prevailed 2-0 after extra time and brought the South American Cup back to their own country. Lazzatti was part of the midfield line along with Antonio Sastre and Celestino Martínez during that tournament. ==Managerial career== In 1950, after the third matchday, Lazzatti replaced the Hungarian Ferenc Plattkó as coach of Boca Juniors, who had managed to prevent the club's relegation the previous year. Until then, the club had one win and two defeats. Under Lazzatti, Boca Juniors finished the season as runners-up. Lazzatti then left the club because he had fallen out with a member of the club's management. He then opened a car dealership in Temperley, Buenos Aires. In 1954, he succeeded György Orth as coach of Boca Juniors, this time winning the league with a four-point lead over Independiente. This was the club's first championship since he won the title with them as a player in 1944. Boca Juniors had an average attendance of 30,000 this year, the highest in the club's history. Lazzatti said goodbye to the club after this success and was replaced by Jaime Sarlanga. ==Later life and death== From then on, he worked as a sports journalist. He first worked for El Gráfico, then for La Prensa and Canal 7. He died on the penultimate day of 1988 at the age of 73. ==Honours== ===Player=== ;Boca Juniors * Primera División (5): 1934, 1935, 1940, 1943, 1944 * Copa Ibarguren (2): 1940, 1944 * Copa de Competencia Británica (1): 1946 * Copa Escobar-Gerona (2): 1945, 1946 ;Argentina * Copa América (1): 1937 ===Manager=== ;Boca Juniors * Primera División (1): 1954 ==References== Category:1915 births Category:1988 deaths Category:People from Buenos Aires Province Category:Argentine footballers Category:Association football defenders Category:Boca Juniors footballers Category:Argentine Primera División players Category:Argentine football managers Category:Boca Juniors managers",
 "title": "Ernesto Lazzatti"
}