{
 "id": "1061669",
 "text": "Gagan Malik is an Indian actor and Hindu activist, renowned for his portrayal of Lord Rama in the popular television series Ramayan. Born and raised in Delhi, India, Malik has made significant contributions to the entertainment industry and has also been recognized for his commitment to promoting Hinduism. He became a Buddhist in 2014 and spent some time in a monastery. == Early Life and Modelling Career == Malik was born into a Jat family in Delhi, India, where he received his education at Hansraj School Central. Growing up, his mother read the epic Ramayana to him He got interested in Hindu mythology. During his childhood, Malik actively participated in his colony's Ramleela, playing the character of Ram. Before acting, Malik had a career in cricket, in the Ranji Trophy team in Delhi. After twelve years in cricket, he changed to acting, gaining experience in TV commercials, music videos, modeling, and designer shows. In 2004, he won the title of Mr. Photogenic in the national male beauty pageant, Mr. India. == Career == Gagan Malik's acting career took off with the television series Kumkum on Star Plus. He then played a lead role in Zee TV's Saath Saath Banayenge Ek Aashiyaan and appeared in Star One's TV serial Shakuntala. In 2012, Malik played Lord Rama in the television series Ramayan. It was very popular in Indonesia. In 2013, Malik made his international film debut with the Sri Lankan Sinhala language film Sri Siddhartha Gautama, where he played the title character. The film, inspired by the spiritual odyssey of The Buddha, won awards at the Delhi International Film Festival in India and the United Nations Buddhist Film Festival in Vietnam. Gagan Malik is also part of the celebrity cricket team Jaipur Raj Joshiley for the Indian sport-reality entertainment show Box Cricket League season 2. He still plays Lord Rama in the television series Sankatmochan Mahabali Hanuman on Sony TV. In 2016, Malik confirmed his involvement in an international film based on the Buddha, which is reported to be the most expensive movie ever made on the subject. The pre-production phase is underway, with the team planning to shoot the teaser in July or August. == References == Category:Actors from Delhi Category:Indian television actors Category:Living people Category:Year of birth missing (living people)",
 "title": "Gagan Malik"
}