{
 "id": "1061696",
 "text": "AnneIreland, Civil Registration Births Index, 1864-1958: MAR 1945 5 69 CORK – Anne V Scher Valerie Verrall MBE (née Scher; 26 December 1944 – 12 November 2023) was a British-Irish drama teacher who was best known as the founder of The Anna Scher Theatre School. Scher was also known as an actress, a journalist and an author. == Early life == Anne Valerie Scher was born in Cork, Ireland on 26 December 1944, as the eldest of four children to Eric Asher Scher (1916–1982),Ireland, Civil Registration Births Index, 1864-1958: 17 MAY 1916 5 76 CORK – Eric Asher ScherEngland & Wales, Civil Registration Death Index, 1916-2007: JAN 1982 (aged 65) 18 0410 BRIGHTON – Eric Asher Scher a dentistUK, Medical and Dental Students Registers, 1882-1937: 29 NOV 1933 IRELAND – Eric Asher Scher of Lithuanian descent, andIreland, Civil Registration Marriages Index, 1845-1958: DEC 1943 5 46 – Eric Asher Scher = Constance Hurwitz Constance Scher (1924–1984; née Hurwitz),Ireland, Civil Registration Births Index, 1864-1958: 4 SEPT 1924 5 125 CORK – Constance HurwitzEngland & Wales, Civil Registration Death Index, 1916-2007: 12 JUN 1984 (aged 59) 12 311 ENFIELD – Constance Scher a housewife of Irish decent. Her younger siblings were; sisters Sandra Geraldine Peggy Scher (1948–2014)Ireland, Civil Registration Births Index, 1864-1958: SEP 1948 5 124 CORK – Sandra G P ScherEngland and Wales, Death Index, 1989-2022: 28 NOV 2014 (aged 66) LONDON – Sandra Geraldine Peggy Scher and Vida M Scher (b. 1953)Ireland, Civil Registration Births Index, 1864-1958: DEC 1953 5 76 CORK – Vida M Scher and brother Ronald D P Scher (b. 1961).England & Wales, Civil Registration Birth Index, 1916-2007: JAN 1961 5h 391 HOVE – Ronald D P Scher Her family moved to Hove, East Sussex when she was 14. Scher was educated at St Angela's convent, where she was the sole Jewish pupil. She later attended the Hove County Grammar School for Girls and the Brighton School of Music and Art. == Career == Scher founded The Anna Scher Theatre School (AST), an independent and co-educational performing arts school in Islington, London, in January 1968. Her husband served as the co-director for many years. Scher made her debut, and only appearance, as an actress in 1969, but her father told her to get a proper job, so she became a journalist specialising in theatre with the Islington Gazette for five years, and reviewed for The Times Literary Supplement. Scher also worked as a primary school teacher, working with children whose first language was not English. She was a chairperson of the International Song Contest for Peace in Ireland. She served on juries at BAFTA, Sony and the Royal Television Society. Scher was the castaway on a 2011 episode of the BBC Radio 4 programme Desert Island Discs. Scher co-authored three books with her husband. She also authored two books as a solo author. == Personal life == Scher married coach, writer and director Raymond Charles Verrall in Hampstead, London in April 1976.England & Wales, Civil Registration Marriage Index, 1916-2005: APR 1976 12 1412 HAMPSTEAD – Anna V Scher = Raymond C Verrall Their only son, John Benedict Verrall, was born four years later.England & Wales, Civil Registration Birth Index, 1916-2007: OCT 1980 15 2415 WESTMINSTER – John Benedict Verrall Her husband died in October 2023, at the age of 79. Scher had a breakdown in 2000 after suffering with depression and was admitted to hospital. She could not walk during her breakdown. She took a period of sick leave from The Anna Scher Theatre. Scher discovered that she had been blocked by the board of directors upon her return to her theatre. Scher promoted peace, love and understanding. She was a patron of Neve Shalom/Wahat al Salam – Oasis of Peace. === Death === Scher died in London during the early hours of 12 November 2023. She was 78. Her death was confirmed and announced to the public at 2:55pm on the same day in a social media post by talent agency Nic Knight Management: \"It is with deep sadness that I must report that Anna Scher, the best and kindest drama teacher in the UK for the last 50 years, has passed. Joining her husband, Charles, in a better place to rest. She will be missed but never forgotten. RIP @annascherthtr + Charles Verrall.\" Her obituary was published by The Guardian on 15 November. Scher and Verrall's joint private funeral took place at St Silas Church on Penton Street on 14 December 2023. == Honours and awards == Scher was awarded a Community Award from the Irish Post the Woman of Distinction Award from Jewish Care. She was an Associate of RADA. She was awarded a Honorary Fellow of the Leinster School of Music & Drama. She was awarded the Peace Person of the Year Award in Ireland in 1999. Scher was awarded Freedom of the London Borough of Islington in 2003. Scher was appointed Member of the Order of the British Empire (MBE) in the 2013 Birthday Honours by Queen Elizabeth II for her services to drama. === Commonwealth honours === Country Date Appointment Post-nominal letters 15 June 2013–12 November 2023 Member of the Order of the British Empire (Civil Division) MBE == Filmography == === As an actress === Year Title Role Notes Ref. 1969 The Battle of St. George Without Maudie 3 episodes === As herself === Year Title Notes Ref. 1974 Aquarius 1 episode 1988 The Lowdown 1 episode 1999, 2003 This Is Your Life 2 episodes 2011 Anna Documentary 2011 Desert Island Discs 1 episode 2013 In Confidence 1 episode 2014 Piers Morgan's Life Stories 1 episode == Bibliography == * Scher, Anna; Verrall, Charles (1975). 100+ Ideas for Drama. Heinemann Educational Books. . * Scher, Anna (1976). Final Act: Drama Kit. Ward Lock Educational Books. . * Scher, Anna; Verrall, Charles (1987). Another 100+ Ideas for Drama. Heinemann Educational Books. . * Scher, Anna; Verrall, Charles (1992). 200+ Ideas for Drama. Heinemann Drama. . * Scher, Anna. Desperate to Act. Heinemann. . == References == Category:1944 births Category:2023 deaths",
 "title": "Anna Scher"
}