{
 "id": "1061872",
 "text": "Seher Bedi, is a director, producer, and editor. She is popularly known as the 'Pioneer of Millennial Entertainment in India'. Seher first made a mark by creating seminal shows like MTV Bakra and MTV Most Wanted. In 2010, she assumed the role of Head of Creative & Content for MTV India. Then she went on to handle iconic shows like Coke Studio, Splitsvilla, MTV Loveline, Heavy Mental, Youth Icon of the Year, Club MTV, MTV Alert, MTV Stuntmania, and MTV Bollywood Grind. Seher also served as a jury member of the prestigious Asian Academy Creative Awards for Content from the Asia Pacific region. Seher is currently Head of Josh Studios, the award winning content production studio of Josh, the fastest-growing and most-engaged short video app in India (as of March 6, 2023). Seher creates several popular IPs at Josh Studios including: • Wakao, India's biggest influencer festival. • World Famous, a multi-city talent hunt across Indian heartlands. • Josh All Stars, a creator mentor community platform. • CreatorThon, a multi-city travel, mentorship, and content creation marathon. • JFLIX Film Festival, a first-of-its-kind one- minute-film-festival and awards show. • Nach Baby Dance, a friendly competition for India's best dance performers. Shows Year Directed Produced MTV: Made in India 1997 Yes Yes MTV Bakra 1999 Yes Yes MTV Video Music Awards 1999 Yes Yes MTV Most Wanted India 2000 Yes Yes MTV Video Music Awards 2000 Yes Yes Movies Created As Phir se (2011) Head of Creative and Content: MTV Award Category Winning Entry Won Promax India Best Promotional Campaign Radies 8.0 Gold Promax India Best Reality Promo MTV True Life Silver Promax India Best Sound Design Rock On Gold Promax India Best Brand Integration Promo Kamasutra Silver Promax India Best Programme Title Sequence Radies 8.0 Journey Packaging Gold Promax India Best Entertainment/Variety Promo MTV True Life Gold Promax India Best Reality Campaign MTV True Life Gold Promax India Best Editing MTV True Life Silver Promax India Best Reality Promo MTV True Life Gold Promax India Best Reality Campaign MTV Roadies Silver Promax India Best Promo MTV True Life Gold Promax India Studio Launch of the Year Josh Studio Gold Promax India Best Inhouse content Studio by a Brand Josh Studio Gold == References == Category:Movie directors Category:Producers Category:Editors Category:Living people Category:Entertainment",
 "title": "Seher Bedi"
}