{
 "id": "1061781",
 "text": "Óscar Omar Miguez Antón (5 December 1927 – 19 August 2006) was a Uruguayan footballer. He played as a forward. Míguez was part of the Uruguay team in the 1950 and 1954 World Cups. He played as a striker for the national team. Míguez is the all-time record World Cup goal scorer for Uruguay with eight goals. Míguez had 27 goals in 39 games in total for Uruguay, For a long time, he was the third-highest scorer for the national team, behind Héctor Scarone and Ángel Romano. He was overtaken by Diego Forlán, Edinson Cavani and Luis Suárez. Míguez was known for his mental quickness and an unusual command of the ball, with goals with headers, volleys or bicycle kicks sought for an entire match until they came out. He was often satisfied with just scoring goals, he was a juggling centre-forward. He, however, He denied that he had been a great player. He is regarded among the best football players of all time. Míguez is considered as one of the greatest Uruguayan strikers of his era. ==Club career== He was born on December 5, 1927 in Montevideo. He began his adult football career in 1947. His play attracted the attention of representatives of one of the strongest clubs in the country, Peñarol. He joined the team in 1948, He was a part of a famous forward line that included Alcides Ghiggia, Ernesto Vidal, Juan Schiaffino and the Argentinian Juan Hohberg. He played for this team for the next twelve seasons of his playing career. As part of Peñarol, he was one of the main scorers of the team. He had an average performance of 0.78 goals per championship game. He was the top scorer of the Uruguayan championship twice. His team won that competition six times. Míguez was the most outstanding footballer in the history of Peñarol de Montevideo, where he played for almost his entire life as a professional athlete, and did not accept offers received from European teams. He was a juggler with the ball, having made his bicycle kicks famous. He was Uruguayan champion with Peñarol in 1949, 1951, 1953, 1954, 1958 and 1959. Subsequently, in 1960 he played in Peru for Sporting Cristal, the following year he defended the colors of Rampla Juniors, and finished his playing career with Montevideya Colón in 1962. ==International career== In 1950, he made his debut in official matches as part of the Uruguayan national team. In the same year, he went as part of the team to the 1950 World Cup in Brazil. In the very first game of the tournament, he scored a hat-trick, contributing to the defeat of the Bolivian national team with a score of 8:0 in the first group stage. At the final stage, at which the world champion was determined, he scored two goals against the Swedish national team, which brought the Uruguayans a victory with a score of 3:2 and left them in the fight for the championship title. He fully played the decisive game against the home team, in which the Uruguayans won a sensational victory with a score of 2:1, becoming world champions in 1950. Four years later, at the 1954 World Cup in Switzerland, he also started the tournament as the main striker of the national team. In the group stage of the competition, he scored a goal against the Czech Republic (win 2:0) and two goals against Scotland (win 7:0). In the quarterfinal match against England, won 4-2, he was injured and missed the rest of his team's matches, in which they lost in the semifinals and the game for third place to the national teams of Hungary and Austria, respectively. Despite missing these games for two World Cups, he scored 8 goals, which remains a record for the players of the Uruguayan national team in the finals of the World Cup. Subsequently, he participated in the South American championships of 1955 and 1956, in the second of which the Uruguayans won their ninth title of the strongest national team on the continent. Miguez's personal contribution to the title, which included three goals scored, was recognized by awarding him the title of the best player of the tournament. In total, during his career in the national team, which lasted 8 years, he played 39 matches in its uniform, scoring 27 goals. ==Death== He died in 2006 at the age of 78. His remains are buried at the Cementerio del Buceo, Montevideo. ==Career statistics == ===International=== :Source: Appearances and goals by national team and year National team Year Apps Goals Uruguay 1950 8 7 Uruguay 1951 0 0 Uruguay 1952 5 6 Uruguay 1953 1 1 Uruguay 1954 6 4 Uruguay 1955 5 3 Uruguay 1956 8 4 Uruguay 1957 4 1 Uruguay 1958 2 1 Total Total 39 27 ==Honours== * Uruguayan League: 1949, 1951, 1953, 1954, 1958 * FIFA World Cup: 1950 * Copa América: 1956 * Copa Río Branco: runner-up: 1950 ==References== Category:1927 births Category:2006 deaths Category:Footballers from Montevideo Category:Association football forwards Category:1950 FIFA World Cup players Category:1954 FIFA World Cup players Category:Uruguayan footballers",
 "title": "Óscar Míguez"
}