{
 "id": "1061191",
 "text": "Jhonen C. Vasquez (; born September 1, 1974) is an American cartoonist, animator, writer, producer, and director. He is best known for creating the comic book Johnny the Homicidal Maniac—along with its spin-off comics Squee!, Fillerbunny, and I Feel Sick—and the Nickelodeon animated series Invader Zim. ==Bibliography== Year Title Notes 1995–1997 Johnny the Homicidal Maniac 7 issues 1996 The Bad Art Collection 1997–1998 Squee! 4 issues 1999–2000 I Feel Sick 2 issues 2000, 2005, 2014 Fillerbunny 3 issues 2002 Everything Can Be Beaten With Crab Scrambly 2003 Slave Labor Stories Two page story \"The Ghost with Black Fingers\" 2007 Jellyfist With Jennifer Goldberg 2009–2010 Strange Tales MAX MODOK story in Strange Tales #2 and Wolverine story in Strange Tales II #1 2012 Beyond the Fringe With Becky Cloonan and Andy Belanger, issues 5A and 6A 2015–2021 Invader Zim 50 issues, with multiple others ==Filmography== Year Title Role Notes 2001–2002 Invader Zim Creator, writer, character designer, executive producer and voice actor Television series 2005 2775-Man Director, executive producer and voice actor Television series 2006 \"Shut Me Up\" Director Music video 2011 \"White\" Director Music video 2012–2015 Randy Cunningham: 9th Grade Ninja Character designer (credited as Chancre Scolex) Television series 2014 Bravest Warriors Writer Episode: \"The Puppetyville Horror\" 2015 Very Important House Creator, director, writer Pilot 2015 TMNT: Don Vs Raph Creator, writer, voice director, character designer Television short 2019 Invader Zim: Enter the Florpus Creator, director, writer, executive producer and voice actor Streaming television film ==Awards and nominations== * Squee! was nominated for 1998 Eisner Awards for Best New Series and Best Humor Publication.1998 Will Eisner Comic Industry Award Nominees. users.rcn.com * I Feel Sick won an International Horror Guild Award in 2000 for Best Illustrated Narrative.\"The Mammoth Book of Best New Horror\" by Stephen Jones, Carroll and Graf, 2002 * Invader Zim won an Emmy, an Annie, and the award for Best Title Sequence at the 2001 World Animation Celebration awards. It also garnered seven other nominations.\"Invader ZIM\" (2001) Awards. imdb.com * Vasquez and his work were honored in the National Design Triennial: Inside Design Now, a 2003 exhibition at the Cooper-Hewitt National Design Museum, Smithsonian Institution. * Vasquez received the Inkpot Award in 2015.Inkpot Award ==References== ==Other websites== * * * An Interview on SuicideGirls.com * Revolution Science Fiction (October 26, 2001): \"Death and Morons: The Jhonen Vasquez Story\" (online-chat transcript) * Jhonen Vasquez Spotlight (2007 New York Comic Con speech Podcast. 54:12m) Downloadable mp3 * Interrogation Special with Zoetica Ebb (August 22, 2007) Category:1974 births Category:Living people Category:American animators Category:American cartoonists Category:American comics artists Category:American comics writers Category:American illustrators Category:American screenwriters Category:American television actors Category:American television directors Category:American television producers Category:American television writers Category:American voice actors Category:Screenwriters from California Category:Writers from San Jose, California",
 "title": "Jhonen Vasquez"
}