{
 "id": "1061007",
 "text": "Bill Omar Carrasquillo (born September 6, 1986), known professionally as Omi in a Hellcat (stylized in all caps), is an American YouTuber who was sentenced to five and a half years of prison and fined on charges of conspiracy, copyright infringement, fraud, money laundering, and tax evasion due to a cable television piracy scheme. == Background == Bill Omar Carrasquillo was born on September 6, 1986. His father was Julio Carrasquillo and his mother was Soledad Diaz. He was raised in North Philadelphia as one of 38 children. His mother died of a drug overdose while he was a child. His father was a drug dealer who taught him to cook crack cocaine when he was 12 years old. He grew up with his family, foster parents, and his father. He said he was sent to a mental health institution for his guardian to get to medicine to sell. He became a drug dealer as a teenager and sold drugs until he was in his 20s. After he stopped selling drugs, he started a business in 2016 with partners Jesse Gonzales from California and Michael Barone from New York which offered users content from Comcast, Verizon FiOS, DirectTV, and HBO for a month. According to federal authorities, they bought technology from China which removed restrictions from cable subscriptions, which they used to stream the content online. Before being shut down in 2019, the service had 100,000 subscribers and generated in revenue. He created a YouTube channel named Omi in a Hellcat (stylized in all caps). The channel features videos displaying his jewelry, his home in Swedesboro, New Jersey (which was owned by professional baseball player Jimmy Rollins), and his collection of 57 automobiles. His automobile collection included three Dodge Hellcats and four Lamborghinis, including a Power Rangers-themed one. , the channel had 820,000 subscribers and 65 million views. == Arrest == Carrasquillo's home was entered by the Federal Bureau of Investigation on the morning of November 27, 2019, taking his cars, jewelry, and the money in his bank account. He was then indicted by the FBI on September 21, 2021, on 62 criminal counts, including 19 counts of public performance of a protected work and six counts of wire fraud. Facing 514 years in federal prison, he said he was innocent. He, however, pled guilty in February 2022 and was sentenced to five and a half years of prison and fined on March 8, 2023 on charges of conspiracy, copyright infringement, fraud, money laundering, and tax evasion. His cars were sold by United States Marshals at the B&O; Railroad Museum in Baltimore on October 13 and his jewelry was sold online, with the auction ending October 24. == References == Category:Copyright infringement Category:2021 crimes in the United States Category:2020 crimes in the United States Category:2019 crimes in the United States Category:2018 crimes in the United States",
 "title": "Arrest of Omi in a Hellcat"
}