{
 "id": "1061945",
 "text": "Fairy Idol is the fourth Television movie of The Fairly OddParents after Abra- Catastrophe!, Channel Chasers and School’s Out: The Musical. == Premise == After Cosmo and Wanda quit, every magical being has a singing competition like American Idol to figure out who should take their job. == Plot == A Genie named Norm realizes that if he becomes a fairy, he won’t have to go back to his lamp so he tricks the Mayor into wishing that the lamp would go to Timmy Turner’s best friend Chester. When Chester wishes to spend more time with Timmy, Norm creates an evil Timmy clone to pretend to be Timmy for Cosmo and Wanda while the real Timmy is with Chester. The Timmy clone is mean to Cosmo and Wanda so they quit and the fairies have to figure out who should take over. Norm makes Chester’s dad great at Baseball so Norm can go to the singing contest and Norm cheats to win against Cosmo and Wanda. Norm becomes Chester’s fairy. Chester accidentally causes a lot of problems so Chester wishes Norm were Timmy’s fairy. Norm tells Timmy to wish for Norm’s freedom and that if he does then he might give Timmy his fairies back. Timmy says he won’t wish for anything so Norm explodes. When Timmy wants to wish everything back to how it was, Norm quits. So Chester wishes for “everything to go back to the way it was before I found this stupid lamp”. And it does. Timmy learns to be less selfish. == Songs == 1) The theme song of The Fairly OddParents 2) My Shiny Teeth and Me (sung by the Tooth fairy. 3) I’m Too Sexy for My Sexy (a parody of I’m Too Sexy for my Shirt) 4) I can’t live without Love (sung by Cupid, a parody of I can’t live without you.) 5) Not Pixies (sung by Lawn Gnomes) 6) I’m Sanderson (sung by Sanderson the Pixie) 7) Give Me The Wand (sung by Norm and Cosmo and Wanda, parody of A Friend like Me from Aladdin. == Legacy == The next Fairly OddParents tv movie was Fairly OddBaby where Timmy wishes for Cosmo and Wanda to have a baby. Fairy Idol was also the last time Norm was in the show. Category:2006 television episodes Category:2000s television movies Category:Television movies Category:The Fairly OddParents Category:Nickelodeon animated movies Category:Traditional animation",
 "title": "Fairy Idol"
}