{
 "id": "1062802",
 "text": "Mauricio Simon Umansky (born June 25, 1970) is a real estate broker and television personality. He is the co-founder and CEO of The Agency RE, a real estate brokerage based in Beverly Hills, California. Since 2022, he has appeared on the Netflix reality series Buying Beverly Hills. == Early life == Mauricio Umansky was born in Mexico City, Mexico, on June 25, 1970, to Eduardo Umansky, a clothing manufacturer, and Estella Sneider, a psychologist. He has a younger sister. He is of Jewish heritage, with Russian, Greek, and Turkish roots. Umansky had neutropenia as a child, which led to him spending significant time in the hospital and becoming legally blind in one eye. He attended the University of Southern California but left to start a business venture. == Career == Umansky founded a clothing company, 90265, in 1989 and claims to have started the trend of women wearing oversized T-shirts with leggings. He sold the company in 1996. === Real estate === Umansky started his real estate career at Hilton & Hyland, a firm co-owned by his brother-in-law, Richard Hilton. His first sale was a property in Brentwood, California, for $7.5 million. In 2011, he co-founded The Agency RE, a real estate brokerage in Beverly Hills. In 2018, he was ranked the third individual U.S. real estate agent for total sales transactions by RealTrends. Umansky, Billy Rose and Blair Chang co-founded The Agency RE, a global boutique real estate brokerage, based in Beverly Hills, in July 2011. Umansky was ranked as the third individual U.S. real estate agent for total number of real estate sales transactions in 2018 by RealTrends as published in The Wall Street Journal. === Television === Umansky made his TV debut in 2005 on the MTV series Newlyweds: Nick and Jessica. He has appeared as a guest on The Real Housewives of Beverly Hills since 2010. Since 2022, he has been a main cast member on Netflix's Buying Beverly Hills. He also competed in the 32nd season of Dancing with the Stars in 2023 with Emma Slater, and was the sixth couple eliminated. === Published work === In April 2023, Umansky published The Dealmaker: How to Succeed in Business & Life Through Dedication, Determination & Disruption (). == Personal life == Umansky lives in Encino, Los Angeles with his wife Kyle Richards, their three daughters, and their dogs. === Marriage, children and family === Umansky married actress Kyle Richards on January 20, 1996, and they have three daughters: Alexia, Sophia, and Portia Umansky. He is also stepfather to Richards' daughter from a previous marriage, Farrah Brittany. In July 2023, it was reported that Umansky and Richards had separated after 27 years of marriage. Umansky is a cousin of Doris Bessudo from Bravo's Mexican Dynasties. === Charity work === Umansky and his wife are part of the \"First Families\" of the Children's Hospital Los Angeles, having donated $100,000 or more. He is also on the board of Giveback Homes, which builds homes for families in need. == Filmography == Year Title Notes Ref. 2005 Newlyweds: Nick and Jessica 1 episode 2005 I Want to Be a Hilton 1 episode 2010–present The Real Housewives of Beverly Hills 166 episodes 2013–2023 Today 2 episodes 2015–2024 Entertainment Tonight 5 episodes 2015 Rich Kids of Beverly Hills 1 episode 2016 Rica, Famosa, Latina 1 episode 2016 Access Hollywood 2 episodes 2017 Million Dollar Listing Los Angeles 1 episode 2021 The Real Housewives Ultimate Girls Trip 4 episodes 2021–2023 GMA3: What You Need to Know 2 episodes 2022 The Morning Show 1 episode 2022–2023 Extra 2 episodes 2022–present Buying Beverly Hills 18 episodes 2022 Watch What Happens Live! with Andy Cohen 2 episodes 2023 Good Morning America 1 episode 2023 Dancing with the Stars Season 32; 8 episodes == References == Category:1970 births Category:Living people",
 "title": "Mauricio Umansky"
}