{
 "id": "1062318",
 "text": "Christopher Daniel Covell (born March 24, 1970) is an American professional wrestler. He currently wrestles and works as Head of Talent Relations for All Elite Wrestling (AEW) and competes under the ring name Christopher Daniels. He also wrestles in their sister promotion Ring of Honor (ROH). He has also spent time wrestling in World Wrestling Federation (WWF), World Championship Wrestling (WCW), Ring of Honor (ROH), Total Nonstop Action Wrestling (TNA), and New Japan Pro-Wrestling (NJPW). He is also known for his many years spent wrestling on the independent circuit. ==Career== ===All Elite Wrestling=== On January 8, 2019, Daniels signed a contract with All Elite Wrestling (AEW). At Double or Nothing, Daniels would make his in-ring AEW debut. He would team with his SoCal Uncensored teammates Frankie Kazarian and Scorpio Sky. They would defeat the team of Strong Hearts (Cima, T-Hawk, and El Lindaman). At Fyter Fest, Daniels would have his first AEW singles match in a losing effort to CIMA. At Full Gear on November 19, Daniels would return from an injury and help save his SCU teammates from a beatdown by the Lucha Brothers. On the March 17, 2020 episode of Dark, Daniels would get his first singles victory when he defeated Stu Grayson. On the May 27 episode of Dynamite, Daniels would enter a battle royal to determine who would become the number one contender for the AEW TNT Championship but the match would be won by Jungle Boy. When teaming with Kazarian, Kazarian would cut a promo and say that the tag team would break up the next time that they lost. They would earn a shot at AEW World Tag Team Championships but they ended up losing to The Young Bucks on the May 12 episode of Dynamite and had to split up as a tag team. Daniels would be suspended from the company after helping break up a real-life backstage fight that took place between Kenny Omega, The Young Bucks, CM Punk, and Ace Steel at All Out. After an independent investigation officially concluded that Daniels was breaking up the fight, his suspension was lifted. == References == == Other websites == *Ring of Honor profile * Category:1977 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:People from Kalamazoo, Michigan Category:Professional wrestling authority figures Category:Sportspeople from Michigan Category:Total Nonstop Action Wrestling alumni",
 "title": "Christopher Daniels"
}