{
 "id": "1062293",
 "text": "Brian Christopher Joseph Button (born February 2, 1984) is an American professional wrestler and bodybuilder. He currently wrestles for All Elite Wrestling (AEW) and competes under the ring name Brian Cage. He also appears in their sister promotion Ring of Honor (ROH). He is one-third of the current ROH World Six-Man Tag Team Champions with The Embassy. Button is also known for his time with the Pro Wrestling Guerrilla (PWG), Total Nonstop Action Wrestling (TNA), Lucha Underground, and Lucha Libre AAA Worldwide (AAA). In AEW, Cage has been a one-time FTW Champion. In TNA, he was a one-time Impact World Champion and one-time Impact X Division Champion. ==Career== ===All Elite Wrestling=== On January 12, 2020, Cage signed a contract with All Elite Wrestling (AEW). At Double or Nothing, Cage would make his AEW debut. He would be managed by Taz and would enter the Casino Ladder Match. Cage would win the match and earn himself a future match for the AEW World Championship. Cage was supposed to fight Jon Moxley for his AEW World Championship on the Night 2 of Fyter Fest. The match had to be rescheduled for Fight for the Fallen because Moxley's wife Renee Young had contracted COVID-19 and he was forced to quarantine. Due to the match being rescheduled, Taz decided to bring back the FTW Championship and award it to Cage. He would finally fight Moxley for the World Championship at Fight for the Fallen but would end up losing after Taz decided to throw in the towel and force a forfeit. Cage would go on to join a stable led by Taz called Team Taz. They would also be joined by Ricky Starks. At All Out, Cage would enter a 21-man Casino Battle Royale for a AEW World Championship match in the future but the match would be won by Lance Archer. On Night Two of New Year's Smash, Cage would face Darby Allin for the AEW TNT Championship but would lose. On Night One of Fyter Fest, Cage would lose the FTW Championship to Ricky Starks. He would be kicked out of Team Taz after being hit in the head with the title by Powerhouse Hobbs. At Supercard of Honor XV, Cage would join Tully Blanchard's group and they would later be joined by Gates of Agony (Toa Liona and Kaun). Prince Nana would take over leadership of the group and reform The Embassy. They would go on to defeat Dalton Castle and The Boys to win the ROH World Six-Man Tag Team Championships at Final Battle. At AEW Grand Slam, they would lose the titles to The Elite (\"Hangman\" Adam Page and The Young Bucks) but would win them back on the November 1 edition of Dynamite. == References == ==Other websites== *ROH profile Category:1984 births Category:Living people Category:All Elite Wrestling people Category:American bodybuilders Category:American professional wrestlers Category:Sportspeople from California Category:Total Nonstop Action Wrestling alumni",
 "title": "Brian Cage"
}