{
 "id": "1062867",
 "text": "Buying Beverly Hills is an American reality television series which was released on Netflix on November 4, 2022. The series focuses on Mauricio Umansky and his teams at The Agency RE, his global boutique real estate brokerage, based in Beverly Hills, California. == Overview == Buying Beverly Hills was first announced as \"the new real estate occu-soap\" in a press release by Netflix on June 23, 2022. The series focuses on Mauricio Umansky and his agents, along with the clients at The Agency RE, Umansky's global boutique real estate brokerage, based in Beverly Hills, California. === Season 1 === The official trailer for the debut season was released on October 7, 2022. ITV America, Just Entertainment, Wheelhouse Entertainment and Spoke Studios served as the production companies. The first season was released on Netflix on November 4, 2022. The original cast consisted of Umansky, Farrah Brittany, Alexia Umansky, Santiago Arana, Ben Belack, Joey Ben-Zvi, Jon Grauman, Brandon Graves, Allie Lutz Rosenberger, Melissa Platt, and Sonika Vaid. On April 10, 2023, it was announced that the series had been renewed for a second season. === Season 2 === The second season wrapped filming on July 15. == Cast == === Season 1 === * Mauricio Umansky; (2022–present): founder and owner * Farrah Brittany; (2022–present): senior agent. Mauricio's stepdaughter * Alexia Umansky; (2022–present): junior agent, Umansky team. Mauricio's daughter * Santiago Arana; (2022–present): senior agent * Ben Belack; (2022–present): senior agent * Joey Ben-Zvi; (2022–present): junior agent, Umansky team * Jon Grauman; (2022–present): senior agent * Brandon Graves; (2022–present): junior agent, Grauman team * Allie Lutz Rosenberger; (2022–present): senior agent * Melissa Platt; (2022–present): senior agent * Sonika Vaid; (2022–present): junior agent, Grauman team == Episodes == === Season 1 === == References == Category:American reality television series",
 "title": "Buying Beverly Hills"
}