{
 "id": "1062785",
 "text": "The Falcon and the Winter Soldier is an American web television miniseries, based on the Marvel Comics superheroes of the same names. The series is a sequel to Avengers: Endgame (2019). It is the fourteenth television series in the Marvel Cinematic Universe (MCU), and the second installment of Phase Four. The series was produced by Marvel Studios and was released on Disney+. The first and only season premiered on March 19, 2021, and concluded on April 23, 2021. A fourth Captain America movie, titled Captain America: Brave New World, will serve as a continuation of the series. The movie is set to be released on February 14, 2025. == Synopsis == Following the events of Avengers: Endgame (2019), Sam Wilson/Falcon and Bucky Barnes/Winter Soldier team up in a global adventure that tests their abilities — and their patience — in Marvel Studios' The Falcon and The Winter Soldier. == Cast == === Starring Cast === * Anthony Mackie as Sam Wilson/Falcon/Captain America * Sebastian Stan as Bucky Barnes/Winter Soldier * Emily VanCamp as Sharon Carter/Power Broker * Wyatt Russell as John Walker/Captain America/U.S. Agent * Erin Kellyman as Karli Morgenthau/Flag Smasher * Julia Louis-Dreyfus as Valentina Allegra de Fontaine * Florence Kasumba as Ayo * Danny Ramirez as Joaquín Torres * Georges St- Pierre as Georges Batroc * Adepero Oduye as Sarah Wilson * Daniel Brühl as Helmut Zemo/Baron Zemo * Don Cheadle as James Rhodes === Recurring Cast === * Desmond Chiam as Dovich * Dani Deetté as Gigi * Indya Bussey as DeeDee * Amy Aquino as Doctor Christina Raynor * Chase River McGhee as Cass Wilson * Aaron Haynes as AJ Wilson * Gordon Danniels as Tommy * Alphie Hyorth as Government Official * Charles Black as Carlos * Clé Bennett as Lemar Hoskins/Battlestar * Carl Lumbly as Isaiah Bradley * Renes Rivera as Lennox * Tyler Dean Flores as Diego * Elijah Richardson as Eli Bradley * Noah Mills as Nico * Gabrielle Byndloss as Olivia Walker == Production == On October 30, 2018, Variety reported that Marvel Studios was developing a limited TV series featuring Falcon and Winter Soldier on Disney+, with Kevin Feige set to serve as an executive producer, while Malcolm Spellman was confirmed to serve as the writer of the series. On April 11, 2019, during Disney's 2019 Investor Day, it was announced that the series would premiere during the first year of Disney+. On May 17, 2019, Sebastian Stan revealed that the series would start filming in October 2019. That report also mentioned that it would be filmed in Atlanta, Georgia. Later that month, it was reported that the series would premiere in August 2020 and that Kari Skogland was expected to direct the six episodes, with Daniel Brühl and Emily VanCamp set to reprise their roles as Helmut Zemo and Sharon Carter respectively in the series. On July 10, 2019, The Wrap reported that Derek Kolstad had joined the series' writing team. On July 20, 2019, at San Diego Comic-Con 2019, Feige announced that the series was scheduled to debut on Disney+ in the fall of 2020. In August 2019, it was reported that the series would start production on October 22, 2019, in Atlanta. On August 23, 2019, at D23 Expo 2019, Feige announced that Wyatt Russell had joined the show as John Walker/U.S. Agent. On October 21, 2019, filming began at Pinewood Studios in Atlanta under the working title Tag Team. On December 13, 2019, Deadline Hollywood reported that Desmond Chiam and Miki Ishikawa had joined the cast in undisclosed roles. On January 13, 2020, it was reported that the production of the series was temporarily postponed due to recent earthquakes in Puerto Rico. On February 4, 2020, Bob Iger confirmed that the series would debut in August 2020. On March 3, 2020, it was reported that filming would take place in Prague, Czech Republic for three weeks. On March 10, 2020, it was reported that the production of the series in Prague had been shut down due to the spread of COVID-19 and that they would return to Atlanta for filming. On March 14, 2020, Marvel Studios paused production on The Falcon and the Winter Soldier, along with Loki and WandaVision, as a result of the COVID-19 pandemic. On April 24, 2020, Sebastian Stan revealed in an interview that there were about two or three weeks of filming left before production was shut down. On July 1, 2020, it was reported that the series would shoot in the Czech Republic for nine days in the fall. On July 2, 2020, it was reported that the series would begin pre-production in Georgia that month, with the aim to start filming as early as August. On July 17, 2020, it was reported that the series' August premiere date had been delayed due to the COVID-19 pandemic and that a new premiere date would be announced soon. On September 21, 2020, it was reported that the series would premiere in 2021 instead of 2020. On September 29, 2020, VanCamp revealed that she had finished shooting her scenes for the series. On October 6, 2020, it was reported that the series had resumed filming in Prague and that filming was expected to continue until October 23. On October 23, 2020, it was reported that the series had wrapped principal photography. On December 3, 2020, VanCamp said that the series might premiere in early 2021. On December 10, 2020, during Disney's 2020 Investor Day, Feige announced that the series would premiere on March 19, 2021. On December 28, 2020, it was reported that Henry Jackman had composed the series' score. On February 3, 2021, Don Cheadle revealed that he would be reprising his role as James Rhodes/War Machine in the series. Category:Marvel Cinematic Universe television series Category:Disney+ original television series Category:2021 American television series debuts Category:2021 American television series endings",
 "title": "The Falcon and the Winter Soldier"
}