{
 "id": "10624",
 "text": "Marsupials are in the infraclass of mammals called the Metatheria. This is the marsupials and their extinct ancestors.Marsupialia is their Latin name. There are about 320 different species today. == Reproduction == Marsupials give birth to living young. The young are called joeys. The joeys feed on milk. They are born very small. Marsupials have a special pouch where they carry their joeys. After the birth the joey goes into its mother's pouch, where it can drink milk and is kept warm and safe. When the joeys are young they stay in the pouch all the time, but when they are older they can leave it for short times. When they are old enough and too big for the pouch they do not go into their mother's pouch anymore. Marsupial development is about half-way between reptilian development and mammalian development. == Biogeography == Marsupials evolved before the southern supercontinent Gondwana broke off from Pangaea 100 million years ago. Early marsupial fossils have been found in Asia, from 125 million years ago. They were outcompeted on Laurasia by placental mammals, but the placentals did not get into the Australasian part of Gondwana before it broke away into a separate supercontinent. That is why marsupials now found native only on the southern continents of Australasia. South and Central America, with the single exception of the Virginia opossum.Of course, any animal or plant can be moved by man, and many have been. In biology, the word 'native' means 'occurs naturally in that region'. Some of the 100 living species of South American marsupials have migrated north: 13 species to Central America and one to North America. There are 334 species of living Australasian marsupials. They are mostly in Australia and New Guinea, and some are on the smaller islands. In more recent times the land bridge between the Americas, and reintroductions to Australia, have brought in placental mammals. They have caused the recent extinction of many marsupial species. == Sounds == Marsupials are relatively quiet.Wills, Christopher, The Runaway Brain. Flamingo 1993. p289, So we can place the development of mammalian speech to about 200 million years ago with the early placental mammals. == Living marsupials == === Australasia === *Bandicoots *Kangaroos *Koalas *Tasmanian Devil *Thylacine (Tasmanian Tiger) *Wallabies *Wombats ==== \"Thingodonta\" ==== The extinct genus Yalkaparidon (Order Yalkaparidontia) is a bizarre fossil found in the Oligocene/Miocene deposits of Riversleigh, NE Australia. Its teeth are so strange that palaeontologists call it a 'Thingodont'.Archer M; Hand, Suzanne J. & Godthelp H. 1991. Australia's lost world: Riversleigh, World Heritage Site. Reed, Sydney. p94 \"Thingodonta: off the scale of the unexpected\". === South America === *Opossums *Shrew opossums *Monito del Monte === No longer marsupial === The borhyaenids and the sabertooth Thylacosmilus are no longer considered to be marsupials.Argot, Christine 2004. Evolution of South American mammalian predators (Borhyaenoidea): anatomical and palaeobiological implications. Zoological Journal of the Linnean Society 140, 487-521. They are sparassodont metatherians, the sister group of the marsupials. == Related pages == *Great American Interchange *Monotreme == References ==",
 "title": "Marsupial"
}