{
 "id": "1062855",
 "text": "Norberto Yácono (also Iacono / 8 January 1919 - November 1985) was an Argentine footballer defender who won six Argentine league championships with CA River Plate. He was born in Buenos Aires. Yácono was a versatile defender: he played as a centre-back or as a right-back. He was particularly adept at playing the latter role, being appreciated for his confidence in playing the ball and his ability to mark, especially against opposing wingers. Its performance was remarkable. Yácono is widely regarded to be one of the best defenders of all time. He was nicknamed \"Pacho\" and \"The Little Giant\" by his fans because of being praised for his man-marking skills as his hallmark. ==Club career== From an early age he was a fan of River Plate, of which he became a season ticket holder at the age of six; In 1933, through a friend of his father, he got an audition to enter the youth sector. He joined the first team in 1938, but he made his debut for the first team in 1939 on the day of Bernabé Ferreyra's retirement, against Newell's Old Boys. He soon established himself as a starting defender, partnering Aarón Wergifker, Ricardo Vaghi and Luis Antonio Ferreyra over the years. During the period of the so-called Máquina, he established himself as a mainstay of the defense, playing in the 2-3-5 formation. Later, with the adoption of the 3-2-5, he advanced in midfield line with José Ramos and Néstor Rossi, always carrying out defensive duties. La Máquina won four titles from 1941 to 1947, and once the winning streak ended he remained with the club until 1953, under the guidance of José Minella, obtaining two more championships in 1952 and '53. He then left the club from the red band (for which, with his 393 appearances, he is the fifth player in terms of number of games played) to move to Mexico, to América in Mexico City. In 1958 he left Central America for North America, playing first in Canada, with Montreal Cantalia and Canadian Alouettes, and later in the United States, where he was the first professional footballer. ==International career== He made his national debut on 25 May 1942, in Buenos Aires against Uruguay, in the Copa Lipton match. He took part in minor competitions, such as the Copa Nicanor R. Newton in 1942 and the Copa Juan R. Mignaburu. He was then called up to the 1947 Campeonato Sudamericano de Football, where he made his debut on 2 December in Guayaquil against Paraguay; In this match he was lined up as a starter, and played the full 90 minutes. In the competition, he was employed as a midfielder, remaining first choice in his position throughout the competition, in which he appeared in every game. In 1950 he competed in the Copa Rosa Chevalier Boutell, and in 1951 he played his last matches for Argentina, playing in two friendlies. ==Coaching career== In 1961, he was the head coach for Montreal Cantalia in the Eastern Canada Professional Soccer League. After retiring as a player in the early 1960s Yácono returned to Argentina where he worked as the manager of Sportivo Italiano, Lanús and Godoy Cruz. Later in his career he took up a position of youth team coach for River Plate. After he immigrated to the US and lived in New Jersey, he was still very active with soccer and became the coach for Iberia Airlines of Spain in the New York Airlines Soccer League, which does not exist any more . That was in the early 70s. His knowledge and passion for soccer helped the team to win the championship in 1973. Through the efforts of Norberto Yacono, Iberia Airlines was able to incorporate in the team recently retired players from Argentina, such as Norberto Troilo and Guillermo Heredia. His son, \"Pichi\", also played for the team that winning year. It is reported that for arranging the match between Kansas City Spurs and Brazil's Santos FC around their superstar Pelé during their tour of the US in 1968 he was bestowed the honorary citizenship of Kansas City. ==Death== Yácono died in November 1985 at the age of 66. == Honours == ; River Plate * Primera División Argentina: 1941, 1942, 1945, 1947, 1952, 1953. * Copa Ibarguren: 1941, 1942, 1952. * Copa Aldao: 1941, 1945, 1947. *South American Championship of Champions runner-up: 1948 ; Club América * Copa México: 1954, 1955. ; Montreal Cantalia SC * Canadian National Challenge Cup: 1959. ;Argentina * Copa América: 1947 ==References== ==Other websites== * Norberto Yacono, La enciclopedia de River Plate en rivermillonarios.com.ar. * Category:1919 births Category:1985 deaths Category:Footballers from Buenos Aires Category:Association football defenders Category:Argentine football managers",
 "title": "Norberto Yácono"
}