{
 "id": "1062011",
 "text": "The Many-worlds interpretation of quantum mechanics is a theory about the multiverse. == Origins == Max Planck discovered that some properties of electrons were better represented using waves than particles, later coined the quantum theory. Albert Einstein said that electrons were sometimes waves and sometimes particles, but never at the same time, this is called wave–particle duality. Previously, Niels Bohr had said that when electrons are seen, they are either waves or particles in nature, but never both. However, Bohr also said when electrons are not seen, they are both waves and particles at the same time. These ideas are part of the Copenhagen interpretation of Quantum Theory. In reflection on this, Einstein said Bohr was wrong because “God does not play dice with The Universe”. To further this rationale, Erwin Schrödinger came up with the thought experiment of Schrödinger's Cat to prove that Bohr was wrong. In the 1950s, Dr. Hugh Everett decided to answer the Schrödinger's Cat argument with the Many-worlds interpretation of the problem that when there are more than one possible things that can happen in a situation, every one of them will happen at the same time, but each one will be in its own universe and nothing from one universe can go into another universe. This is like the idea of the multiverse, but the difference is that the Many-worlds interpretation does not just say that there are parts of the universe that we cannot see, but that there are different universes. == In popular culture == The theory is talked about in television shows, movies, and other pop culture. In the last episode of Scooby-Doo! Mystery Incorporated, Velma Dinkley wonders why she and her friends are now in a world without real monsters and then shouts 'Schrödinger's cat', so her friend Marcy asks, “What does the Many- Worlds interpretation of Quantum Mechanics have to do with this?” and Velma says “everything”. In The Big Bang Theory, Penny asks Sheldon Cooper to dance and Sheldon says that he believes in the Many-worlds interpretation of Quantum mechanics, which means that there is an Infinity of Parallel universes but he isn’t dancing in any of them. Penny asks, “Are you fun in any of them?” and Sheldon says, “In some of them, I’m a Clown made of Candy”. In the television show The Flash, when people come from other Universes, Dr. Stein says these events are possible because of the many-worlds Interpretation. In the movie Spider-Man: Far From Home, when Mystery says he’s from another universe, Peter Parker wonders how that must be impossible, as the many-worlds interpretation says that something cannot leave its universe. In the next movie Spider-Man: No Way Home, different Spider-Men and different villains come from different dimensions into the main universe. == Other websites == Scooby Doo: Mystery Incorporated, WIKIQUOTE Big Bang Theory, The GOTHOWITZ Deviation IMDB “You’re Saying There’s a Multiverse?” Spider-Man: Far From Home (2019) Movie Clip HD Spider-Man: Far From Home, Spider-Man: No Way Home Category:Quantum mechanics",
 "title": "Many-worlds interpretation"
}