{
 "id": "1062236",
 "text": "Abigail Anne Spanberger (née Davis; born August 7, 1979) is an American former CIA officer and politician. She was the U.S. representative from from 2019 to 2025. She is a member of the Democratic Party. She was elected to the U.S. House in 2018 when she beat Republican incumbent U.S. Representative Dave Brat. In November 2023, Spanberger announced that she would be retiring from the House to run for Governor of Virginia in the 2025 election. ==Early life== Spanberger was born Abigail Anne Davis in Red Bank, New Jersey, on August 7, 1979, where her father was a police officer and her mother was a nurse.Vozzella, Laura (November 12, 2023). \"Virginia Rep. Abigail Spanberger to Run for Governor in 2025.\" MSN.com. Retrieved November 13, 2023. She was raised in Henrico County, Virginia, near Richmond. Spanberger graduated with a Bachelor of Arts degree from the University of Virginia and a Master of Business Administration from Purdue University. == Early career == In 2002 and 2003, Spanberger taught English literature as a substitute teacher at the Islamic Saudi Academy in Northern Virginia. In the early 2000s, she was a postal inspector, working on money laundering and drug cases. In 2006, Spanberger joined the Central Intelligence Agency as an operations officer. She helped fight against nuclear proliferation and terrorism. In 2014, Spanberger left the CIA.Who are they? Virginia's fresh faces in Congress, WTKR, Nick Boykin, January 4, 2019. Retrieved November 14, 2020. In 2017, Virginia governor Terry McAuliffe hired her to work for the Virginia Fair Housing Board. ==U.S. House of Representatives== In July 2017, Spanberger announced her candidacy for the United States House of Representatives in in the 2018 election against Republican U.S. Representative Dave Brat. She made the final decision to run after the House of Representatives voted to repeal the Affordable Care Act. In June 2018, Spanberger won the Democratic nomination with 73% of the vote. Her campaign raised more money Brat's. She won the November 6 general election by just over 6,800 votes. When Donald Trump was president, Spanberger voted with him 6.9% of the time. She supported the first impeachment efforts against Trump. She also did not like how Trump responded to the George Floyd protests. In 2020, she was re-elected with a 1.8% vote margin. However, she criticized the Democratic Party's strategy for the 2020 election. She also did not like how the party was becoming more progressive and supporting progressive ideas. In 2022, she was re-elected with 52% of the vote. In a November 2021, Spanberger criticized President Joe Biden after the 2021 gubernatorial election when Republican Glenn Youngkin was elected governor, saying, \"Nobody elected him to be F.D.R., they elected him to be normal and stop the chaos.\" She also said the Democrats were not focusing on inflation as a real problem. In November 2023, Spanberger announced that she would not run for re-election in 2024, instead focusing on running for governor in 2025. Former U.S. Army officer and Democrat Eugene Vindman was elected in 2024 to replace her. ==2025 gubernatorial election== On November 13, 2023, Spanberger announced that she would run for Governor of Virginia in 2025. No one is running against her for the Democratic nomination since Richmond mayor Levar Stoney dropped out to run for lieutenant governor instead. ==Personal life== Spanberger is married to Adam Spanberger. They have three daughters. In 2014, the family moved back to Henrico County. They live in Glen Allen, Virginia. She is a Protestant. ==References== ==Other websites== * Congresswoman Abigail Spanberger official U.S. House website * Official campaign website * Category:1979 births Category:Living people Category:United States representatives from Virginia Category:Democratic Party (United States) politicians Category:Politicians from New Jersey Category:Politicians from Richmond, Virginia Category:American political activists Category:Educators from New Jersey Category:Educators from Virginia",
 "title": "Abigail Spanberger"
}