{
 "id": "1062542",
 "text": "Black Lightning (Jefferson Pierce) is a fictional character appearing in American comic books published by DC Comics. The character was created by Tony Isabella and Trevor von Eeden, first appearing in Black Lightning #1 (1977). == Publication history == The character was created by Tony Isabella and Trevor von Eeden, first appearing in Black Lightning #1 (1977). == Fictional character biography == Originally, he was a high school principal and Olympic- level athlete who became a vigilante to take down organized crime in Metropolis' Suicide Slum. Eventually he would become a member of Batman's team of Outsiders for many years, although he retired briefly to become secretary of education under president Lex Luthor. He returned to crime-fighting, though, as a member of the Justice League. His two daughters operate as the super-heroes Thunder and Lightning. Black Lightning has proven a popular character for DC and was ranked 85th overall on IGN's \"Top 100 Comic Books Heroes\" list in 2011. == Powers and abilities == Originally, he was described as having no innate powers, using a belt that allowed him to generate a force field and project electrical bolts. This power was later revealed to exist as a result of the metagene, according to Invasion! #3. Black Lightning can produce a vast amount of bioelectricity he can channel against his opponents to a variety of effects, from stunning to killing. With more effort, he can control the electromagnetic force-field generated by his power to use it as shield against incoming attacks and to ionise objects to throw them to enemies. == In other media == The character has been adapted to various media, including animated television series, video games, and comic strips. The character and his stories were adapted for live-action Black Lightning TV series, which ran from 2018 to 2022. The title character was portrayed by Cress Williams, who also went on to make appearances in the related TV shows The Flash and Legends of Tomorrow. Category:DC Comics characters Category:Fictional characters introduced in 1977",
 "title": "Black Lightning"
}