{
 "id": "1062886",
 "text": "Dustin Lee Howard (born April 22, 1986) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and competes under the ring name Chuck Taylor. He was given the name by his trainers because of him always wearing Chuck Taylor All-Stars shoes during training. He has also spent time wrestling in Chikara, Pro Wrestling Guerrilla (PWG), Evolve, Dragon Gate USA, Total Nonstop Action Wrestling (TNA), Ring of Honor (ROH), and New Japan Pro-Wrestling (NJPW). ==Career== ===All Elite Wrestling=== On February 7, 2019, Taylor and Trent Beretta both announced that they had signed contracts with All Elite Wrestling (AEW). At Double or Nothing, Taylor would make his in-ring AEW debut. He would team with his Best Friends teammate Trent Beretta and they would defeat the team of The Hybrid2 (Angélico and Jack Evans). Best Friends would compete in a tournament to determine who would become the very first AEW World Tag Team Champions. They would compete for a bye in the first round at All Out but lost to The Dark Order (Evil Uno and Stu Grayson). They would still compete in the tournament but would lose in the first round to eventual champions SoCal Uncensored (Frankie Kazarian and Scorpio Sky) on the October 16 episode of Dynamite. On the November 20 episode of Dynamite, Taylor would compete in the 2019 Dynamite Diamond Ring Battle Royal but the match would be won by \"Hangman\" Adam Page and MJF. At Bash at the Beach, Best Friends would compete in a four-way number one contender match against The Elite (Adam Page and Kenny Omega), The Young Bucks (Matt Jackson and Nick Jackson), and The Inner Circle (Santana and Ortiz). The match would be won by The Elite. They would win a title shot and challenge Page and Omega for the titles on Night 1 of Fyter Fest but lost. At All Out, Taylor would enter a 21-man Casino Battle Royale for a AEW World Championship match in the future but the match would be won by Lance Archer. On the November 6 episode of Dark, Taylor would get his first singles victory in AEW when he defeated Lee Johnson. At Double or Nothing, Taylor competed in a 21-man Blackjack Battle Royal for the AEW International Championship but it was won by Orange Cassidy. == References == == Other websites == * Category:1986 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Professional wrestling announcers Category:Sportspeople from Kentucky Category:Total Nonstop Action Wrestling alumni",
 "title": "Chuck Taylor (wrestler)"
}