{
 "id": "1063422",
 "text": "Dolby Laboratories, Inc. is a company specializing in audio noise reduction, audio encoding/compression, spatial audio, and High-dynamic-range television imaging. Dolby licenses its technologies to consumer electronics manufacturers. It was founded by Ray Dolby (1933–2013) in London, England, in 1965. He moved the company headquarters to San Francisco in 1976. The first movie with Dolby sound was A Clockwork Orange in 1971. == Technologies == === Analog audio noise reduction === * Dolby A: professional noise reduction systems for analog reel-to-reel tape and cassettes. * Dolby NR/B/C/S: consumer noise reduction systems for tapes and analog cassettes. * Dolby SR (Spectral Recording): professional four-channel noise reduction system in use since 1986, which improves the dynamic range of analog recordings and transmissions by as much as 25 dB. Dolby SR is utilized by recording and post-production engineers, broadcasters, and other audio professionals. It is also the benchmark in analog film sound, being included today on nearly all 35 mm film prints. On films with digital soundtracks, the SR track is used in cinemas not equipped for digital playback, and it serves as a backup in case of problems with the digital track. * Dolby FM: noise reduction system for FM broadcast radio. Dolby FM was tried by a few radio stations starting with WFMT in 1971. It used Dolby B, combined with 25 microsecond pre-emphasis. A small number of models of tuners and receivers were offered with the necessary decoder built in. In addition, a few cassette deck models appeared that allowed the deck's internal Dolby B decoder to be put in the line level pass-through path, permitting its use with Dolby FM broadcasts. The system was not successful and was on the decline by 1974. * Dolby HX Pro: single-ended system used on high- end tape recorders to increase headroom. The recording bias is lowered as the high-frequency component of the signal being recorded increases, and vice versa. It does nothing to the actual audio that is being recorded, and it does not require a special decoder. Any HX Pro recorded tape will have, in theory, better sound on any deck. * Dolby Advanced Audio: Dolby surround sound, locking preferred volume level, optimizes audio performance for specific PC models and lets turning up the volume to the built-in speakers without distorting the sound. === Audio encoding/compression === * Dolby Surround * Dolby Digital (also known as AC-3) is a lossy audio compression format. It supports channel configurations from mono up to six discrete channels (referred to as \"5.1\"). This format first allowed and popularized surround sound. It was first developed for movie theater sound and spread to Laserdisc and DVD. It has been adopted in many broadcast formats including all North American digital television (ATSC), DVB-T, direct broadcast satellite, cable television, DTMB, IPTV, and surround sound radio services. It is also part of both the Blu-ray and the now-defunct HD DVD standards. Dolby Digital is used to enable surround sound output by most video game consoles. Several personal computers support converting all audio to Dolby Digital for output. ** Dolby Digital EX: introduces a matrix-encoded center rear surround channel to Dolby Digital for 6.1 channel output. This center-rear channel is often split to two rear back speakers for 7.1 channel output. ** Dolby Digital Plus (also known as E-AC-3) is a lossy audio codec based on Dolby Digital that is backward compatible, but more advanced. The DVD Forum has selected Dolby Digital Plus as a standard audio format for HD DVD video. It supports data rates up to 6 Mbit/s, an increase from Dolby Digital's 640 kbit/s maximum. On Blu-ray, Dolby Digital Plus is implemented differently, as a legacy 640 kbit/s Dolby Digital stream plus an additional stream to expand the surround sound, with a total bandwidth of approximately 1.7 Mbit/s. Dolby Digital Plus is also optimized for limited data-rate environments such as Digital broadcasting. ** Dolby Digital Live is a real-time hardware encoding technology for interactive media such as video games. It converts any audio signals on a PC or game console into the 5.1-channel Dolby Digital format and transports it via a single S/PDIF cable. A similar technology known as DTS Connect is available from competitor DTS. * Dolby E: professional coding system optimized for the distribution of surround and multichannel audio through digital two-channel post-production and broadcasting infrastructures, or for recording surround audio on two audio tracks of conventional digital video tapes, video servers, communication links, switchers, and routers. The Dolby E signal does not reach viewers at home. It is transcoded to Dolby Digital at a lower data rate for final DTV transmission. * Dolby Stereo (also known as Stereo A): original analog optical technology developed for 35 mm prints and is encoded with four sound channels: Left/Center/Right (which are located behind the screen) and Surround (which is heard over speakers on the sides and rear of the theatre) for ambient sound and special effects. This technology also employs A-type or SR-type noise reduction, listed above with regards to analog cassette tapes. See also Dolby Surround * Dolby TrueHD: Offers bit-for-bit sound reproduction identical to the studio master. Over seven full-range 24-bit/96 kHz discrete channels are supported (plus an LFE channel, making it 7.1 surround) along with the HDMI interface. Theoretically, Dolby TrueHD can support more channels, but this number has been limited to 8 for HD DVD and Blu-ray Disc. * Dolby Pulse: released in 2009, it is identical to the HE-AAC v2 codec except for the addition of Dolby metadata, which is common for Dolby's other digital audio codecs. This metadata \"ensures consistency of broadcast quality.\" * Dolby AC-4 is a lossy audio compression format that can contain audio channels and/or audio objects. * Dolby Atmos is a suite of technologies for immersive audio having both horizontal and vertical sound placement, using a combination of channel and object-based mixing and delivery. It was first introduced in cinemas with Brave (2012 film). The first game released with Dolby Atmos audio was Star Wars Battlefront (2015 video game). The means of delivering the channels and objects differ given the technical limitations across different media, and the target platform. Dolby Atmos is not a codec; on the consumer market, pre-recorded Dolby Atmos is delivered as an extension to a Dolby TrueHD, Dolby Digital Plus, or Dolby AC-4 stream. === Audio processing === * Dolby Headphone: an implementation of virtual surround, simulating 5.1 surround sound in a standard pair of stereo headphones. * Dolby Virtual Speaker: simulates 5.1 surround sound in a setup of two standard stereo speakers. * Dolby Surround, Dolby Pro Logic, Dolby Pro Logic II, Dolby Pro Logic IIx, and Dolby Pro Logic IIz: these decoders expand sound to a greater number of channels. All can decode surround sound that has been matrixed into two channels; some can expand surround sound to a greater number of speakers than the original source material. See the referenced articles for more details on each decoder. * Audistry: sound enhancement technologies. * Dolby Volume: reduces volume level changes. * Dolby Mobile: A version of Dolby's surround sound technology specifically designed for mobile phones, notably the HTC Desire HD, LG Arena and LG Renoir. * Dolby Audio Plug-in for Android: An API packaged as a Java Library that allows Android Developers to take advantage of Dolby Digital Plus Technology embedded into mobile and tablet devices, notably the Fire HD, Fire HDX, and Samsung Galaxy Tab 3 series. * Dolby Voice: Hardware and software products for enterprise-level web conferencing. === Video processing === * Dolby Contrast provides enhanced image contrast to LCD screens with LED backlight units by means of local dimming. * Perceptual Quantizer (PQ), published by SMPTE as SMPTE ST 2084, is a transfer function that allows for the display of high dynamic range (HDR) video with a luminance level of up to 10,000cd/m2 and can be used with the Rec. 2020 color space. On August 27, 2015, the Consumer Electronics Association announced the HDR10 Media Profile which uses the Rec. 2020 color space, SMPTE ST 2084, and a bit depth of 10-bits. On August 2, 2016, Microsoft released the Windows 10 Anniversary Update, which supports the HDR10 format with PQ (ST 2084) transfer function and Rec.2020 color space. * Dolby Vision is a content mastering and delivery format similar to the HDR10 media profile. It supports both high dynamic range (HDR) and wide color gamut (ITU-R Rec. 2020 and 2100) at all stages from content creation and production to transmission and playback. Dolby Vision includes the Perceptual Quantizier (SMPTE ST-2084) electro-optical transfer function and supports displays with up to 10,000-nit maximum brightness (4,000-nit in practice). It also provides up to 8K resolution and color depth of up to 12-bits (backwards compatible with current 8-bit and 10-bit displays). Dolby Vision can encode mastering display colorimetry information using static metadata (SMPTE ST 2086) and dynamic metadata (SMPTE ST 2094-10, Dolby format) for each scene or frame of a video. Examples of Ultra HD (UHD) Dolby Vision are available in TV, monitor, mobile devices and theater. Dolby Vision content can be delivered on Ultra HD Blu-ray discs, over conventional broadcasting, OTT, and online streaming media services. Dolby Vision metadata can be carried via HDMI interface versions 1.4b and above. It also supports IPTPQc2 color space, that is similar to ICtCp. Dolby Vision IQ is an update designed to optimize Dolby Vision content according to the brightness of the room. * ICtCp provides an improved color representation that is designed for high dynamic range (HDR) and wide color gamut (WCG). An improved constant luminance is an advantage for color processing operations such as chroma subsampling and gamut mapping where only color information is changed. ICtCp is based on a modification of IPT called ICaCb. === Digital cinema === * Dolby Digital Cinema * Dolby Surround 7.1, first introduced theatrically with Toy Story 3, in 2010. * Dolby 3DDolby 3D Movie Technology . professional.Dolby.com. Retrieved on 2013-12-09. * Dolby AtmosContent Creators, Distributors, Exhibitors: Introducing Dolby Atmos™ . Dolby.com. Retrieved on 2013-12-09. * Dolby Cinema, a premium cinema concept developed by Dolby Laboratories as a direct competitor to IMAX.Dolby Cinema the Total Cinema Experience. Dolby.com Retrieved on 2014-12-17. === Live sound === * Dolby Lake Processor \\- as of 2009, all Lake products are owned by Lab Gruppen. Over the years Dolby has introduced several surround sound systems. Their differences are explained below. ==References== Category:1965 establishments in California Category:American technology companies Category:Companies based in San Francisco",
 "title": "Dolby"
}