{
 "id": "1063641",
 "text": "Heng Swee Keat (; born 15 April 1961) is a Singaporean politician, former police officer and former civil servant. He is serving as Deputy Prime Minister, Coordinating Minister for Economic Policies. Also, he is the Member of Parliament (MP) representing the Bedok part of the East Coast GRC. == Early life and education == Heng studied at Raffles Institution. He received a scholarship from the Singapore Police Force in 1980. That allowed him to study economics at Christ College, University of Cambridge in 1983. He also completed a Master's in Public Administration at John F. Kennedy School of Government, Harvard University in 1993. == Career == === Early career === After Heng completed his economics studies, he worked in the Singapore Police Force. He left in 1997 as an Assistant Commissioner of Police. After working in the police, he worked in the Ministry of Education, the Ministry of Trade and Industry and the Monetary Authority of Singapore. === Political career === Heng joined politics in the 2011 general election as part of the People's Action Party (PAP) team contesting in Tampines GRC. PAP's team won with 57.22% of the vote against the National Solidarity Party. Heng became a Member of Parliament for the Tampines Central part of Tampines GRC. On 18 May 2011, Heng was made part of the Cabinet as Minister for Education. During the 2015 general election, Heng led the PAP team contesting in Tampines GRC and won 72.06% of the vote against the National Solidarity Party. After the general election, on 1 October 2015, Heng stopped being Minister for Education and became Minister for Finance. On 1 May 2019, Heng was made Deputy Prime Minister. Before the 2020 general election, Heng announced that he would be contesting in East Coast GRC. On 10 July 2020, the PAP team led by Heng contesting in East Coast GRC won 53.41% of the vote against the Workers' Party,. Heng was made Member of Parliament for the Bedok part of East Coast GRC. On 27 July 2020, Heng took up another Cabinet job as Coordinating Minister for Economic Policies. After the 2020 general election, Heng was most likely the next prime minister. However, he decided not to become the next Prime Minister on 8 April 2021. He said it was because he was old and not that healthy anymore. Following a Cabinet reshuffle on 15 May 2021, Heng stopped being Minister of Finance. == Personal life == Heng was born in Singapore as a Chinese. He is of Teochew descent. Heng is married to Chang Hwee Nee, the Chief Executive Officer of the National Heritage Board. They have two children. == Honours == * Public Administration Medal (PPA) (2001) * Long Service Medal (PBS) (2008) * Meritorious Service Medal (PJG) (2010) == References == == Other websites == * Heng Swee Keat on Parliament of Singapore * Heng Swee Keat on Singapore Prime Minister's Office |- |- |- |- Category:1961 births Category:Living people Category:Deputy Prime Ministers of Singapore Category:Government ministers Category:Finance ministers Category:Members of the Cabinet of Singapore Category:Members of the Parliament of Singapore Category:People's Action Party (Singapore) politicians Category:Police officers",
 "title": "Heng Swee Keat"
}