{
 "id": "1063140",
 "text": "Northwest Stadium is an American football stadium located in Landover, Maryland that serves as the home for the Washington Commanders of the National Football League (NFL). The Commanders, then known as the Washington Redskins, first started to build the stadium on March 13, 1996. The team first played in the stadium on September 14, 1997. In their first game, they defeated the Arizona Cardinals 19–13 in overtime. The stadium at first didn't have a sponsor and was named Jack Kent Cooke Stadium after Jack Kent Cooke, the team's owner who had recently died before the stadium opened. The stadium would keep this name until 1999. On November 21, 1999, sponsorship naming rights were sold to FedEx in a $205 million, 27-year agreement and the stadium was renamed FedExField. On July 2, 2020, FedEx sent a letter to team owner Dan Snyder and the Redskins. In the letter, they demanded that the team change its name from the offensive Redskins name or they would be pulling their sponsorship of the team and from the stadium after the 2020 NFL season. The team would drop the Redskins name on July 13, 2020, using \"Washington Football Team\" until becoming the Commanders in 2022. The stadium has received a large amount of criticism. The expensive price of concessions and the neglected conditions of the stadium are common complaints. In a 2020 USA Today poll of best stadiums in the NFL, FedExField was ranked in last place. After a game between the Washington Football Team and Philadelphia Eagles, fans fell over a barrier that collapsed while trying to greet Eagles quarterback Jalen Hurts. Fans that were there said that only Hurts asked if they were okay and that the stadium staff didn't care, telling them to ”get the fuck off the field”. Jalen Hurts would write a open letter to the team and the NFL, asking that something be done to protect the safety of fans and players and to stop an event like that happening again in the future. In February 2024, FedEx ended its naming rights contract early. The stadium briefly became Commanders Field until the Northern Virginia-based Northwest Federal Credit Union signed a new sponsorship contract that August. ==References== ==Other websites== * Category:National Football League venues Category:Buildings and structures in Maryland",
 "title": "Northwest Stadium"
}