{
 "id": "1063944",
 "text": "Balaam Barugahara Ateenyi commonly known as Balaam (born in July 28th, 1979) is a Ugandan Politician, business man, music and events promoter He is the state minister for gender, labour, and social development in charge of children and youth affairs. Balaam is also the CEO of Balaam group of companies, a conglomerate operating in Uganda and South Sudan and his investments are mainly in the areas of entertainments, broadcasting, real estate, manufacturing, hotels, and resorts. == Early life and education == Dr.Balaam Barugahara Ateenyi was born July, 28,1979 (44 yrs ago) to late Engineer Davidson Balaam Byenkya Akiiki of Kijura, Masindi District and Gladesi Byenkya Abwooli of Kalisizo District in Central Buganda. His father Mr. Davidson Balaam Byenkya Akiiki passed away in 1991 when he was still a young boy. === Education === He attended Namasagali School, St. John Bosco Senior Secondary School & Original Progressive Senior Secondary School for A’level. He then enrolled at Makerere University for Bachelor of Commerce where he majored in Marketing, after, he did a Master of Business Administration (Marketing Option) at Cavendish University. == Business career == Balaam is the proprietor and owner of: Original Best Water company based in South Sudan, Radio One in South Sudan, the first privately owned media house he started in 2009. He is also the proprietor and Managing Director of Radio4 (Uganda), Radio 7 (Masindi), Radio8 (Masaka) and Radio8 (Elgon region) and the MTN Uganda distributor for Kigezi sub region. Balaam is a Real Estate Developer with hotels in Kampala and South Sudan, including a 5 star Hotel in Masindi, which was commissioned by President Yoweri Museveni in September 2022. == Political career == He was appointed by yoweri museveni as a state minister for gender, labour and social development in charge of children and youth affairs on 21 March 2024. == Family == He has 13 siblings and he is the fifth child. His late father had 14 children. Balaam is father to Benta Karuhanga Abwooli, Biden Kamusiime Amooti and Brennan Kamukama Akiiki. He lost his first son to cancer in 2013. == Awards and Honors == * On February 21, 2023, Balaam was awarded a Honorary Doctorate in humanity from Zoe Life Theological College, USA for changing and impacting the lives of Ugandans. == Related pages == * Yoweri Museveni == References == == Other websites == * Balaam to Museveni: Rule, in case you get tired, Muhoozi is on standby to succeed you * MK Movement Leaders Launch Diaspora Chapter in London * Balaam Barugahara plans to marry four women to “balance Uganda” * Balaam blasts 'clueless' Jenkins, confesses 'greedy' Abitex called him over Alien Category:1979 births Category:Living people Category:Ugandan politicians",
 "title": "Balaam Barugahara"
}