{
 "id": "1063964",
 "text": "Microsoft Copilot is a chatbot made by Microsoft. It was introduced as Bing Chat on February 7, 2023. Microsoft Copilot is a replacement of the Cortana virtual assistant. Microsoft used to sometimes call its chatbots Bing Chat, and sometimes call them Microsoft Copilot, but all of the chatbots were renamed to Microsoft Copilot in November 2023. Microsoft has introduced Phi-3-mini, the latest iteration of its featherweight AI model. The user interface of Microsoft Copilot looks like the user interface of ChatGPT, and both of them use the GPT-4 artificial intelligence model. It can cite its sources, create poems, and make songs. It can also use its Image Creator to generate images based on text prompts. Microsoft Copilot can understand many different languages. == History == On February 7, 2023, Microsoft released a new Bing version. This version included a new chatbot feature called Bing Chat. Bing Chat was also added to Microsoft Edge. Microsoft created a similar chatbot for Microsoft 365 called Microsoft 365 Copilot. Microsoft created another chatbot called Windows Copilot. Between September 2023 and October 2023, Microsoft 365 Copilot and Windows Copilot were renamed to Microsoft Copilot. On November 15, 2023, Bing Chat was renamed to Microsoft Copilot. In December 2023, Copilot was added to many copies of Windows 11 for free, with more copies, and limited support for Windows 10, to be added later. Later that month, a Microsoft Copilot app was released for Android. == Features == In Microsoft Edge, Copilot can give information on the website currently being browsed by a user. Microsoft Copilot in Windows can be accessed with the taskbar, and it supports the use of voice commands. In Microsoft 365, Microsoft Copilot can help by generating and editing parts of documents. This has reminded some people of the Office Assistant, or Clippy, which was an old feature which also tried to help with documents in Microsoft Office (the old name for Microsoft 365). == Related pages == * Cortana * ChatGPT * Siri == References == Category:Microsoft software Category:Generative artificial intelligence Category:OpenAI",
 "title": "Microsoft Copilot"
}