{
 "id": "1063023",
 "text": "Eric M. Smith (born January 22, 1980) is an American murderer who, at the age of thirteen, kidnapped, tortured, sexually abused and murdered a four-year-old boy named Derrick Joseph Robie (October 2, 1988 - August 2, 1993) in Savona, New York, on August 2, 1993. == Early life == Eric was born on January 22, 1980. His father, Randy Hevner, abandoned his family shortly after his birth. However, he temporarily came back and had another child, Holly, with Smith's mother, Tammy, 1 year after his birth. He abandoned his family shortly after again. Tammy then met a man named Ted and married him. Eric had once set his kitchen on fire when he was 3. At age 4, he started thinking about girls in a sexual way. From age 5 to 11, Smith used to wet his bed. At school, he was bullied almost every day, including a incident where a boy threw Smith's stuff at the ground and told him to pick it up. At home, his stepfather yelled and spanked him and his sisters, even in public. This caused Eric to develop mental health issues and problems to control his anger. Smith had a history of killing animals, such as shooting at birds with a BB gun, gutting animals, throwing rocks at frogs, and a incident where he strangled a neighbour's cat to death in 1989. He had also began smoking cigarettes around that same year almost every day. In 1993, the year the murder took place, Smith's behaviour got worse. After being bullied for years by older kids, he began bullying younger children as well. He had also asked his stepfather, Ted that he wanted to hurt someone, and he told him to go punch a tree, which wasn't enough for Smith. His mother and stepfather never got him any help. == Murder == On the morning of August 2, 1993, Eric was riding his bike to a nearby summer camp to annoy and bully other campers, the camp leader eventually kicked Smith out of the camp. While riding his bike home, he began asking himself why he was always everyone's victim, and that he no longer wanted to be the victim and that, instead, he wanted for someone else to be his victim. He then saw Derrick, who was walking to the same camp that Eric was previously leaving as Robie's mother, Doreen, was busy taking care of Derrick's younger brother, Dalton, who was 4 years younger than him. Smith greeted Robie and asked him if he was going to summer camp, he confirmed and Smith convinced him that he could take him there by using a shortcut. After he took him to a wooded area nearby them, he strangled Robie until he passed out. He then began punching him and threw a rock at his body several times. He then picked a stick and inserted it inside his anus. Smith then left and 5 minutes later checked him again to assure that Robie was dead. He then left again. Smith confessed to his mother that he murdered Robie 6 days after the murder. They contacted police later that night. == Conviction and aftermath == After his arrest, it was revealed that Smith had intermittent explosive disorder, depression and attention deficit hyperactivity disorder. Smith was tried as an adult, making him the youngest murder defendant tried as an adult in New York state history. Smith was charged and convicted on August 1994 and sentenced to 9 years to life in prison on November 1994. Smith was denied parole 10 times between June 2002 and January 2020. He had also apologized to Derrick's family in multiple interviews, he had also explained that he had been abused by his stepfather, Ted and bullied by his classmates and that he took his anger out on Derrick because of it. His stepdad had also raped his older sister, Stacy Hevner, when she was 11 and 14 respectively, though Smith and his stepdad denied that he was ever sexually abused. Smith was granted parole on October 2021, after 27 years of incarceration. At that hearing, he revealed that he was engaged to a lawyer since 2019 and that he planned on moving to Queens if released. He was released on February 1, 2022. On April 16, 2025, Smith was discharged from parole supervision. == Popular culture == Smith's case was featured in a Killer Kids episode. == Related pages == * Anger * Bullying * Child abuse * Child murder * Crime of passion * Psychological abuse == References == Category:American murderers Category:American rapists Category:American kidnappers Category:American criminals Category:American people convicted of murder Category:1980 births Category:Living people Category:Children victims of violence Category:American prisoners sentenced to life imprisonment",
 "title": "Eric Smith (murderer)"
}