{
 "id": "1063616",
 "text": "Sheynnis Alondra Palacios Cornejo (born 30 May 2000) is a Nicaraguan model and beauty queen who won the title of Miss Universe 2023. She became the first Miss Universe winner from Nicaragua. She was previously crowned Miss World Nicaragua 2020, Miss World 2021 Top 40 semifinalist and Miss Nicaragua 2023. ==Early life and education== Palacios was born on 30 May 2000 in Managua. She graduated from the Central American University in Managua with a bachelor’s degree in mass communication. ==Pageantry== Palacios began her beauty contest career as a teenager at the age of 16, when she won the title of Miss Teen Nicaragua 2016 and finished in the Top 10 at Miss Teen Universe 2017 in Managua. === Miss World Nicaragua 2020 === On February 15, 2020, Palacios represented Managua at Miss World Nicaragua 2020 at the Holiday Inn and Convention Center in Managua, where she won the title and was succeeded by María Teresa Cortez. === Miss World 2021 === As Miss World Nicaragua, Palacios represented Nicaragua at Miss World 2021, which was held in San Juan, Puerto Rico on 16 December 2021. Two days prior to the pageant's broadcast, several cases of COVID-19 began to be reported amongst contestants and staff, which led to the cancelation and postponement of the pageant's final show. The pageant was later rescheduled for 16 March 2022, with only the 40 selected semi-finalists being invited to return to compete; Palacios was ultimately selected as one of the 40, but did not advance further in the competition. === Miss Nicaragua 2023 === On August 5, 2023, Palacios joined at Miss Nicaragua 2023 and competed against 10 other finalists at Crowne Plaza Managua in Managua, where she won the title and was succeeded by Norma Huembes. === Miss Universe 2023 === As Miss Nicaragua, Palacios represented Nicaragua at Miss Universe 2023 on November 18, 2023 and competed against 84 other candidates at the José Adolfo Pineda Arena in San Salvador, El Salvador. Palacios advanced to Top 5. During the first question and answer round, she was asked: \"What qualities and values guide you as a leader and role model for others?\" > The quality that has inspired me and has inspired millions of women and > girls is humility and to be able to appreciate all of the little things, > because that’s where the most valuable thing is: the essence of being human. Palacios advanced to Top 3. In the final question and answer portion, the top three contestants were asked the same question: \"If you could live one year in another woman's shoes, who would you choose and why?\" > I will choose Mary Wollstonecraft because she opened the gap and they gave > an opportunity to many women. What I would do — I would want that gap, that > income gap, would open up so that women could work in any area that they > chose to work in because there's no limitation for women. That was 1750. Now > in 2023, we're making history. At the end of the event, Palacios won the competition and was crowned by her predecessor, Miss Universe 2022 R'Bonney Gabriel of United States. ==References== ==Other websites== * Category:2000 births Category:Living people Category:Nicaraguan people Category:Miss Universe winners",
 "title": "Sheynnis Palacios"
}