{
 "id": "1063197",
 "text": "Seven Deadly Enemies of Man, also known as the Seven Deadly Sins, are fictional characters appearing in American comic books published by Fawcett Comics and currently by DC Comics. The Sons of Trigon also represent the seven sins. They were created by Judd Winick and Julian Lopez, first appearing in Titans (Volume 2) #3 (2008). They are seven powerful demons that represent the seven deadly sins of Judeo-Christian religions, and are enemies of the superhero Captain Marvel (a.k.a. Shazam). Each of these demons represents a different sin, and is named accordingly: Lust, Sloth, Pride, Wrath, Gluttony, Greed, and Envy. They were adapted by C. C. Beck and Bill Parker, first appearing in Whiz Comics #2 (1940). == History == The demons can take control of people's bodies and force them to follow their base desires. The Sins were captured by the wizard Shazam many years ago and encased in seven mocking stone statues which were placed in the Rock of Eternity. Currently the Enemies remain imprisoned, but they escaped on at least one occasion the destruction of the Rock of Eternity at the hands of the Spectre; however, Captain Marvel managed to trap them once again. The demons have escaped their prisons several times to cause havoc, usually freed by another villain. King Kull released them, planning to make Sin bombs and destroy the world along with turning Billy Batson to stone, but he is defeated and the Sins again imprisoned. The Seven Deadly Sins identify themselves by their traditional theological versions (Pride, Envy, Greed, Wrath, Sloth, Gluttony, and Lust). When the Spectre destroyed the Rock of Eternity and killed Shazam, the Sins were released. When the Rock was rebuilt, the Sins were again captured, although they try and torment Marvel as he can hear their thoughts, and they are implied to have caused trouble at a full moon. It is claimed that Pride is the rudest and dangerous. == Members == * Pride: The most powerful and dangerous of all the Enemies, according to Captain Marvel. It represents the desire of one to be more important or attractive than others. * Envy: It represents one's jealousy over others and a desire to deprive a man of something he loves. * Greed: It represents insatiable ambition and the desire to possess more than one needs. * Wrath: It represents uncontrollable feelings of hatred and violence. * Sloth: It represents laziness and apathy. * Gluttony: It represents overindulgence and overconsumption of anything to the point of waste. * Lust: It represents excessive desires or thoughts of sexual nature, or desire in general. == In other media == The characters made their live- action cinematic debut in the DC Extended Universe movie Shazam! (2019). == Notes == * In the original Fawcett stories and most other versions, the Seven Sins were \"censored\" to an extent in keeping with 1940s standards, identified as the \"Seven Deadly Enemies of Man\" and including Pride, Envy, Greed, Hatred, Laziness, Selfishness, and Injustice among their ranks. * Injustice was changed to Gluttony without explanation in JLA/JSA: Virtue and Vice. * This character or object is an adaptation of Seven deadly sins, a character or object in traditional stories. These include, but may not be limited to religious texts, myth, and/or folklore. Category:Fawcett Comics Category:DC Comics supervillains",
 "title": "Seven Deadly Enemies of Man"
}