{
 "id": "1063337",
 "text": "Everything's Rosie aired 104 episodes, 4 seasons and 1 special episode. Each season aired 26 episodes. == Season 1 (2010) == Episode number Total episodes Title Original UK broadcast by Original UK airdate == Season 2 (2011) == Episode number Total episodes Title Original UK broadcast by Original UK airdate == Season 3 (2012-2013) == Episode number Total episodes Title Original UK broadcast by Original UK airdate == Special episode (2014) == Episode number Total episodes Title Original UK broadcast by Original UK airdate 1 79 \"When You Wish Upon an Oak\" CBeebies 1 January 2014 Rosie and her friends go on a quest to find out how old Oakley is.The characters' heads kept squishing in the episode, which made the viewers feel sick and scared. Archie the chameleon was thrown down a tree as well, which made the viewers very upset. == Season 4 (2015-2017) == Episode number Total episodes Title Original UK broadcast by Original UK airdate 1 80 \"The Wind That Shakes The Plum Tree\" CBeebies 2 March 2015 Big Bear's plum tree has been blown down. 2 81 \"Life Beneath The Waves\" CBeebies 3 March 2015 Raggles wants to visit the sea so he can find a shark. 3 82 \"Holly's Home From Home\" CBeebies 4 March 2015 Mrs Mordy's hat runs away and everyone chases after it. 4 83 \"The Great Jumping Joke\" CBeebies 5 March 2015 Will plays tricks on everyone. 5 84 \"The Raggles Express\" CBeebies 6 March 2015 Raggles makes his own cardboard train but nobody wants to ride it. 6 85 \"Codebreakers\" CBeebies 9 March 2015 Will refuses to play fair in a game of \"Hiders and Seekers\" 7 86 \"The Licky Sticky Friend\" CBeebies 10 March 2015 Holly is scared of a frog Will finds at the stream. 8 87 \"Big Bear's Brumba\" CBeebies 11 March 2015 Rosie & Raggles try to help Big Bear get fit. 9 88 \"The Book of Lost and Found\" CBeebies 12 March 2015 Raggles makes up a book by using things that he found along his way. 10 89 \"Twigs, Camera, Action!\" CBeebies 13 March 2015 Will makes movies around the garden, and says \"Hello\" in a rude way to Big Bear without getting told off. 11 90 \"Will's Magic Moment\" CBeebies 16 March 2015 Will whines when his magic tricks don't work. 12 91 \"Try Something New Day\" CBeebies 17 March 2015 Rosie and her friends decide to try something new. 13 92 \"From Pole to Goal\" CBeebies 18 March 2015 Rosie and her friends go and find the East Pole. 14 93 \"Across The Universe\" CBeebies 19 March 2015 Bluebird and Manny spin in circles and break Big Bear's telescope on accident. 15 94 \"Will at the Wheel\" CBeebies 20 March 2015 Will has fun upgrading his potter's wheel, and Rosie, Holly and Big Bear make up a new game - Holly-ball! 16 95 \"Full of Beans\" CBeebies 23 March 2015 Archie's package full of what is meant to be chocolate turns out to be cocoa beans. 17 96 \"Wakey, Wakey\" CBeebies 24 March 2015 Raggles is wearing an owl mask today, and everyone has overslept. 18 97 \"When The Boat Comes In\" CBeebies 25 March 2015 Mr and Mrs Mordy are seperated by a flood. 19 98 \"Zip Zap Zip\" CBeebies 26 March 2015 Rosie tries to convince Will to stop playing his video game. 20 99 \"The Silliest Scarecrow\" CBeebies 3 January 2017 Raggles is being very helpful today, and Big Bear can't get the birds to leave his raspberry crop alone. 21 100 \"Here we go Gathering Nuts all Day\" CBeebies 10 January 2017 Rosie discovers a squirrel in the garden. 22 101 \"Four Seasons In One Day\" CBeebies 17 January 2017 The weather keeps changing whenever the characters play outside. 23 102 \"The Very Precious Surprise\" CBeebies 24 January 2017 The characters decide to bully Archie all day. 24 103 \"Journey To The Centre of The Earth\" CBeebies 31 January 2017 Raggles wants to look for a volcano. 25 104 \"The Art of Being Big Bear\" CBeebies 7 February 2017 Big Bear hurts his arm, so Rosie and her friends take over his jobs for him. 26 105 \"Blooming Lovely\" CBeebies 14 February 2017 Will's new gardening machine breaks and ruins everyone's gardens. == References == Everything's Rosie",
 "title": "List of Everything's Rosie episodes"
}