{
 "id": "1063452",
 "text": "Levi Coffin (October 28, 1798 – September 16, 1877) was an American Quaker, Republican, abolitionist, farmer, businessman and humanitarian. He was very active in the Underground Railroad. The Underground Railroad was a network that helped slaves escape. As he was an active leader of that organization is Indiana and Ohio., some people called him \"President of the Underground Railroad\". They estimated that three thosand fugitive slaves passed through his care. The Coffin home in Fountain City, Wayne County, Indiana is a museum today. At times, it was called d the Underground Railroad's \"Grand Central Station\". Coffin was born near what became Greensboro, North Carolina. Even when he was a child, Coffin came to see what slavery looked like, and he soon came to oppose it. His family emigrated to Indiana in 1826. Slaveholders were persecuting Quakers more and more. Because of their beliefs, Quakers did not own slaves. Instead, many helped slaves escape. In Indiana, Coffin settled near the National Road with other Quakers in Wayne County, Indiana, near the Ohio border. He farmed, and became a local merchant and business leader. Coffin grew wealthy from his various businesses assisting neighbors and travelers in the important transit corridor. Coffin became a major investor in and director of the local Richmond branch of the Second State Bank of Indiana in the 1830s. At that time, Richmond was the Wayne County seat. His financial position and standing in the community also helped supply food, clothing and transportation for Underground Railroad operations in the region. His friends in the anti-slavery movement urged Coffin to move south. In 18476, he moved to the city of Cincinnati, which was an important port on the Ohio River. There he ran a warehouse, that sold only free-labour goods. Coffin abandoned the idea after a decade, because the business was not profitable. Despite this, he was able to help hundreds of slaves, between 1847 and 1857. He lodged them in his Ohio home, which was across the river from Kentucky, and not far from Virginia. Both Kentucky and Virginia were slave states, until slavery was abolished after the American Civil War. In the last years of his life, Coffin traveled around the Midwest, as well as overseas to France and Great Britain, where he helped form aid societies to provide food, clothing, funds and education to former slaves. Coffin retired from public life in the 1870s, and wrote an autobiography, Reminiscences of Levi Coffin, published in 1876, a year before his death. Category:Writers from Ohio Category:Writers from North Carolina Category:19th-century American politicians Category:1877 deaths Category:1798 births Category:Quakers Category:American abolitionists",
 "title": "Levi Coffin"
}