{
 "id": "1064976",
 "text": "Vedanta is a school of Hindu philosophy, one of the six recognized in Hinduism. The name means \"end of the Vedas\". It is based on ideas found in the Upanishads, focusing on knowledge and liberation. Vedanta has various schools that follow texts like the Upanishads, Brahma Sutras, and Bhagavad Gita. The main Vedanta schools include Bhedabheda, Advaita, Vishishtadvaita, Tattvavada (Dvaita), Suddhadvaita, and Achintya-Bheda-Abheda. Modern developments include Neo-Vedanta and the philosophy of the Swaminarayan Sampradaya.King, Richard (2002). Orientalism and Religion: Post-Colonial Theory, India and \"The Mystic East\". Taylor & Francis e-Library. Most Vedanta schools, except Advaita Vedanta and Neo-Vedanta, are linked to Vaishnavism, emphasizing devotion (Bhakti) to God, often Vishnu. Advaita Vedanta, in contrast, emphasizes Jnana (knowledge) and Jnana Yoga. While Advaita has gained attention in the West, other Vedanta traditions mainly focus on Vaishnava theology. == Main Schools == There are different counts of Vedanta schools, ranging from three to six. Some prominent ones include: * Bhedabheda (7th or 4th century CE) * Dvaitādvaita (Vaishnava, founded by Nimbarka in the 7th century CE) * Advaita (Monistic, prominent scholars include Gaudapada and Adi Shankaracharya) * Vishishtadvaita (Vaishnava, with scholars like Nathamuni, Yāmuna, and Ramanuja) * Akshar-Purushottam Darshan (rooted in Ramanuja's Vishishtadvaita, based on Swaminarayan's teachings) * Tattvavada (Vaishnava, founded by Madhvacharya with scholars like Jayatirtha and Vyasatirtha) * Suddhadvaita (Vaishnava, founded by Vallabha) * Achintya Bheda Abheda (Vaishnava, founded by Chaitanya Mahaprabhu, propagated by Gaudiya Vaishnava) == Philosophy == === Common Features === Despite their differences, all Vedanta schools share some common ideas: * Vedanta aims to understand Brahman and the Atman. * The Upaniṣads, Bhagavadgita, and Brahma Sutras form the foundation of Vedanta. * Scripture is the main source of knowledge. * Brahman or Ishvara is the unchanging cause of the world. * The self (Ātman or Jiva) is responsible for its actions and their consequences. * Belief in rebirth and the quest for release from it (moksha). * Rejection of Buddhism, Jainism, and other Vedic schools. The main texts of Vedanta are the Upanishads, Brahma Sūtras, and Bhagavadgītā, collectively known as Prasthānatrayī. === Different Views === Vedanta philosophers discuss three fundamental categories—Brahman, Ātman, and Prakriti—and their relationships.Williams, Raymond Brady (2018), Introduction to Swaminarayan Hinduism, Cambridge University Press * Shankaracharya distinguishes a higher, undifferentiated Brahman, and a lower, qualified Brahman. * Ramanuja accepts Brahman as Ishvara, a personal God with auspicious attributes. * Madhvacharya identifies Vishnu as the supreme God, equating Brahman with a personal god. * Vallabhacharya recognizes the triple essence of Brahman, manifesting as personal God, matter, and individual souls. Most Vedanta schools, along with Samkhya, support Parinamavada, the idea that the world is a real transformation of Brahman. However, Advaita Vedanta, led by Adi Shankara, follows Vivartavada, stating that the world is an unreal transformation of Brahman. ==== Relation between Atman and Brahman ==== Following is the relation between Atman and Brahman in different schools of Vedanta: * Advaita Vedanta sees Atman as identical with Brahman. * Vishishtadvaita Vedanta holds that Atman is different but eternally connected with Brahman. * Dvaita Vedanta asserts that Atman is always distinct from Brahman. * Shuddhadvaita Vedanta believes Atman and Brahman are identical. == References == Category:Hinduism Category:Consciousness Category:Vedas",
 "title": "Vedanta"
}