{
 "id": "1064521",
 "text": "is a Shinto shrine in Nara, Japan. It was built in 768 CE for the Fujiwara family. It has been rebuilt many times. Inside, it is famous for its bronze and stone lanterns. The shrine's design is called Kasuga-zukuri. It influenced many other religious gates in Japan, called Torii. Kasuga Shrine and the forest nearby are very important historical places and are protected by UNESCO. It is listed as a UNESCO World Heritage Site as part of the \"Historic Monuments of Ancient Nara\". To get to the shrine, you walk through a deer park. The deer are free and are thought to be holy messengers. The shrine and the deer are shown in many old Japanese paintings. There are over three thousand stone lanterns along the path. There is also a garden next to the shrine. == Worshipped gods == The shrine worships Kasuga no Kami, a god with five parts: # Takemikazuchi-o # Futsunushi # Ame no Koyane # Himegami # Ame- no-Oshikumone == History == According to legend, the kami of Kasuga-taisha, Takemikazuchi, rode on the back of a white deer to the top of Mount Wakakusa in 768 CE. This kami is said to have traveled from the Kashima Jingu Shrine in order to protect Nara. The shrine location first received favor from the Imperial government in the Heian period as a result of the power from the Fujiwara family as well as Empress Shōtoku. Futsunushi no mikoto is the second deity of the shrine. Two gods were moved from Hiraoka Shrine to this shrine. That shrine was the shrine of the Nakatomi clan. When the Fujiwara clan moved to this shrine, they brought Ame no Koyane and Himegami to Kasuga taisha, and called Hiraoka Shrine Moto-Kasuga (\"former Kasuga\"). These four gods are worshipped as one god called Kasuga no Kami. Each god has a buddhist part too. A fifth god named Ame-no-Oshikumone, was added later. He is the son of Ame no koyane and Himegami. He is also the ancestor of the Nakatomi clan and Fujiwara clan.Shibata, Joue. Saitama Sōsho. (1929) Volume 1: Chichibu Shi, p 111, Chichibu hikomikoto o keizu 『埼玉叢書. 第1巻』内『秩父志』内111頁「秩父彦命御系図」. Sanmeisha Later people started worshipping other groups of gods as one like this. From 1871 to 1946, Kasuga Shrine was officially ranked as a Kanpei-taisha or the highest rank in the Kanpei-taisha (官幣大社). == Religious significance == The four main kami enshrined here are Ame no koyane, Himegami, Futsunushi no mikoto, and Takemikazuchi no mikoto. Though these are the primary divine beings of Kasuga taisha, they are often grouped together as a syncretic, combined deity known as Kasuga Daimyōjin. Kasuga Daimyōjin is composed of five divine beings and each consists of a Buddhist deity and Shinto kami counterpart. The fifth deity, Ame-no-Oshikumone, was added much later and is said to be the divine child of Ame no koyane and Himegami. The importance of the multifaceted kami was that it became a template for future worshipers who wanted to combine several deities to pray to at once. == References == Category:Taisha Category:Chokusaisha Category:Twenty-Two Shrines Category:Myōjin Taisha Category:Beppyo shrines Category:8th-century establishments in Japan Category:World Heritage Sites in Japan Category:Kanpei-taisha Category:Shinto shrines",
 "title": "Kasuga-taisha"
}