{
 "id": "1064589",
 "text": "Milene Domingues Aganzo, born on June 18, 1979, is a former Brazilian soccer player who played in the midfield position. ==Career== She was born in São Paulo and played in a futsal team for models organized by the Flash Book modeling agency.. In 1994, this team formed the basis for a new women's team at SC Corinthians. She ended her playing career with CF Pozuelo de Alarcón. The ex-model holds the women's record for ball juggling. Brazilian magazine Corpo A Corpo article about Milene Domingues Until Keira Walsh moved to Barcelona for £400,000 in 2022, Domingues was the most expensive female football player in Spain, costing over £200,000. She ranked second globally, behind Pernille Harder, who was bought for £250,000.0Mrs Ronaldo in record transfer BBC Sports 12 September 2002. Retrieved 18 February 2007. On the international stage, she played for the Brazil women's national football team in the 2003 FIFA Women's World Cup. Her inclusion was somewhat surprising, and coach Paulo Gonçalves noted that she wasn't a top pick, stating, \"Milene is coming with us, but she's like the 19th or 20th player.\" Even though Milene wasn't in great shape, Brazil's team selectors thought she would be noticed by the media and the public. However, she didn't get to play in any of the four matches, and Brazil was eventually eliminated in the quarter-finals.. She did get a chance to play in Brazil's next match in April 2004, which was an unofficial friendly against the Texas A&M; Aggies women's soccer team at the Aggie Soccer Stadium, under their new coach René Simões.. ==Personal life== She was married to football star Ronaldo from April 1999 to September 2003 and they have a son named Ronald.El equipo de «Ronaldinha»» who was born in Milan, on 6 April 2000. Because she was married to Ronaldo, some fans called her \"Ronaldinha,\" but she didn't like it and wanted to be called Milene or Mika instead. Later, Domingues married Spanish footballer David Aganzo. She is a Buddhist. ==References== ==Other websites== * Official site Category:1979 births Category:Living people Category:Footballers from São Paulo",
 "title": "Milene Domingues"
}