{
 "id": "1064406",
 "text": "Black Widow is the name of several fictional characters appearing in American comic books published by Marvel Comics. Most of these versions exist in Marvel's main shared universe, known as the Marvel Universe. The most notable characters who have assumed the mantle of Black Widow over the years are Claire Voyant, Natasha Romanova, and Yelena Belova; as well as some alternative versions. The character has been associated with several superhero teams such as the Avengers, the Defenders, the Champions, S.H.I.E.L.D., and the Thunderbolts. == Fictional character biographies == === Claire Voyant === She was one of the superheroes who fought in World War II. Claire was a spirit medium who communicated with the dead. She was possessed by Satan while having a seance with the Wagler family. During the seance a curse was place on the family then died in a car crash. One of the survivors James Wagler went to Claire's apartment and shot her in her apartment. Her soul went to hell Satan gives Claire mystical powers and sends back to earth to avenge her death. After killing James Wagler Claire became tasked to kill evil men and send their souls to hell. === Natasha Romanova === She is a highly trained and former Russian spy, who was originally an antagonist of Iron Man and other heroes. Eventually becoming a superheroine, she defected to the United States and became the partner of Captain America, Daredevil, Winter Soldier and Hawkeye. In addition, Black Widow became an agent of S.H.I.E.L.D. and later the superhero group, the Avengers, where she also acted as a co-leader during the Onslaught saga. Since her tenure as a superhero and adventurer, she has been a member of numerous groups, such as the Lady Liberators, Marvel Knights, Mighty Avengers, Champions of Los Angeles, and the Posse. === Yelena Belova === She is depicted as a spy and was the second modern-era character to use the Black Widow name. She first appeared in Inhumans #5 and was created by Devin Grayson and J.G. == Alternative universe versions == === Monica Chang === She is the second character to use the Black Widow codename in the Ultimate Marvel continuity, debuting in Ultimate Comics: Avengers #3. === Jessica Drew === The Ultimate version of Jessica Drew is a female Spider-Clone who uses by the Black Widow alias. === Black Widow 2099 === The futuristic 2099 version of Black Widow is an African-American woman named Tania. She operates as part of the Avengers 2099 at the Alchemax corporation's behest. Like black widow spiders, she literally eats her mates after having sex with them. == In other media == The character has been adapted to different forms of media, such as television series, movies, video games, and action figures. In live-action, she has been portrayed by actresses Scarlet Johansson, Florence Pugh, and Shira Haas, set in the Marvel Cinematic Universe (MCU). Category:Marvel Comics characters",
 "title": "Black Widow (Marvel Comics)"
}