{
 "id": "1064747",
 "text": "AEW x NJPW: Forbidden Door (2022) was a professional wrestling pay-per-view co-promoted by All Elite Wrestling (AEW) and New Japan Pro-Wrestling (NJPW). It took place on June 26, 2022 at the United Center in Chicago, Illinois. It was the first Forbidden Door event to take place and the first event that AEW and NJPW have held together. This was also the first professional wrestling event held at the United Center since 2000 when World Championship Wrestling (WCW) held Spring Stampede in the arena. The main event of the show saw Jon Moxley defeat Hiroshi Tanahashi to become the new interim AEW World Champion. Moxley put Tanahashi in a rear naked choke before hitting his Paradigm Shift and getting the pinfall victory to win the title. During the event, Bryan Danielson announced Zack Sabre Jr.'s hand-picked opponent. The opponent was revealed to be Claudio Castagnoli who made his unannounced AEW debut. He then defeat Sabre after hitting him with his Ricola Bomb. ==Matches== No. Results Stipulations Times 1 Bishamon (Hirooki Goto and Yoshi-Hashi) defeated The Factory (Aaron Solo and Q. T. Marshall) Tag team match 8:53 2 Lance Archer defeated Nick Comoroto Singles match 6:08 3 Swerve In Our Glory (Keith Lee and Swerve Strickland) defeated Suzuki-gun (El Desperado and Yoshinobu Kanemaru) Tag team match 12:08 4 Max Caster and Gunn Club (Billy, Austin, and Colten Gunn) (with Anthony Bowens) defeated Yuya Uemura and New Japan LA Dojo (Alex Coughlin, The DKC and Kevin Knight) Eight-man tag team match 5:35 5 Minoru Suzuki and Le Sex Gods (Chris Jericho and Sammy Guevara) (with Tay Conti) defeated Eddie Kingston, Shota Umino, and Wheeler Yuta Six-man tag team match 18:58 6 FTR (Cash Wheeler and Dax Harwood) (ROH) defeated United Empire (Great-O-Khan and Jeff Cobb) (IWGP) and Roppongi Vice (Rocky Romero and Trent Beretta) Winners Take All Three-way tag team match for the ROH World Tag Team Championship and IWGP Tag Team Championship 16:19 7 Pac defeated Clark Connors, Miro, and Malakai Black Four-way match to crown the first AEW All- Atlantic Champion 15:10 8 Dudes with Attitudes (Darby Allin, Sting, and Shingo Takagi) defeated Bullet Club (El Phantasmo, Matt Jackson, and Nick Jackson) (with Hikuleo) Six-man tag team match 13:01 9 Thunder Rosa (c) defeated Toni Storm Singles match for the AEW Women's World Championship 10:42 10 Will Ospreay (c) (with Aussie Open (Kyle Fletcher and Mark Davis)) defeated Orange Cassidy Singles match for the IWGP United States Heavyweight Championship 16:43 11 Claudio Castagnoli defeated Zack Sabre Jr. Singles match 18:26 12 Jay White (c) (with Gedo) defeated \"Hangman\" Adam Page, Kazuchika Okada, and Adam Cole Four-way match for the IWGP World Heavyweight Championship 21:05 13 Jon Moxley (with William Regal) defeated Hiroshi Tanahashi Singles match for the interim AEW World Championship 18:14 ==References== Category:2022 in American sports Category:All Elite Wrestling shows Category:New Japan Pro-Wrestling Category:Sports in Chicago Category:2020s in Chicago Category:2020s in sports in Illinois Category:2022 in Illinois",
 "title": "Forbidden Door (2022)"
}