{
 "id": "1064769",
 "text": "Mister Terrific is the name of two fictional superheroes appearing in American comic books published by DC Comics. The character was created by Charles Reizenstein and Hal Sharp, first appearing in Sensation Comics #1 (1942). He is a super-hero legacy character, a man who's supposed to be great at everything. == Fictional character biographies == === Terry Sloane === Terry Sloane was the original version, a self-made millionaire, olympic-level athlete and martial artist who became a vigilante during the Golden Age to fight crime and act as a good role model. === Michael Holt === Michael Holt is his successor, also the third smartest man on the planet. The character is associated with being a member of the Justice Society of America. == In other media == Edi Gathegi will play Michael Holt / Mister Terrific in the DC Universe (DCU) movie Superman. ===Film=== * An alternate reality incarnation of Michael Holt / Mister Terrific named Mister Horrific makes a non-speaking cameo appearance in Justice League: Crisis on Two Earths as a minor member of the Crime Syndicate under Superwoman's command. * An alternate reality incarnation of Michael Holt appears in Justice League: Gods and Monsters, voiced by Arif S. Kinchen. * The Michael Holt incarnation of Mister Terrific appears in Justice League vs. the Fatal Five, voiced by Kevin Michael Richardson. * The Michael Holt incarnation of Mister Terrific appears in Injustice, voiced by Edwin Hodge. * The Michael Holt incarnation of Mister Terrific appears in Justice League: Crisis on Infinite Earths – Part One, voiced by Ato Essandoh. * The Michael Holt incarnation of Mister Terrific will appear in Superman, portrayed by Edi Gathegi. ===Video games=== * The Michael Holt incarnation of Mister Terrific makes a cameo appearance in Injustice: Gods Among Us via the Watchtower stage. * The Curtis Holt incarnation of Mister Terrific appears as a playable character in Lego DC Super-Villains via the \"DC TV Super-Heroes\" DLC pack. ==References== Category:DC Comics superheroes",
 "title": "Mister Terrific (character)"
}