{
 "id": "1064847",
 "text": "South Kalimantan is a province in Indonesia, located in the Kalimantan region of Borneo. It's the smallest province in this area. The capital was Banjarmasin until February 15, 2022, when it legally moved to Banjarbaru. About 4.18 million people lived there in mid-2022. The province is surrounded by the Makassar Strait to the east, Central Kalimantan to the west and north, the Java Sea to the south, and East Kalimantan to the north. It includes Pulau Laut, an island off the eastern coast of Kalimantan. South Kalimantan is the cultural center of the Banjarese people, the traditional inhabitants, and also home to other groups like the Dayaks and Javanese who migrated due to historical programs. In the past, South Kalimantan was part of local kingdoms and later became tributes to the Sultanate of Mataram in the 17th century. It was then colonized by the Dutch East Indies and the Japanese Empire until Indonesia gained independence in 1945. South Kalimantan is often called the Land of Lambung Mangkurat, named after the second king of the Kingdom of Dipa, an early precursor to the Banjar Sultanate. == History == The Banjar Sultanate flourished in the early 17th century, mainly trading pepper, and regions of Borneo paid tribute to the Sultanate. Previously, Banjar paid tribute to the Demak Sultanate, but this changed after the fall of Demak and the rise of Pajang. Attempts by Java, led by Tuban in 1615, to conquer Banjarmasin failed due to strong resistance. Sultan Agung of Mataram expanded his power by defeating the northern coast cities of Java. In 1622, the Mataram Sultanate aimed to occupy kingdoms in south, southwest, and southeast Borneo.Goh Yoon Pong, Trade and Politics in Bandjermasin 1700–1747, Dissertation University of London, 1969 The Dutch later took over the Banjar Sultanate's territory, placing it under the Residency of South and Eastern Borneo. During World War II, the Japanese invaded Borneo, capturing Bandjermasin, the capital. After the war, the Dutch recognized Indonesia's sovereignty in 1949, withdrawing from the region. South Kalimantan became part of the Indonesian province of Kalimantan, but in 1956, it was divided into West Kalimantan and South Kalimantan for greater autonomy for the Dayak population. The Indonesian Government approved this change in 1957, creating Central Kalimantan as the seventeenth province of Indonesia.Hermanus Johannes de Graaf, Puncak kekuasaan Mataram: politik ekspansi Sultan Agung, Grafitipers, 1986 == Demographics == The largest group in South Kalimantan is the Banjar (74.34%), divided into three groups: Banjar Kuala, Banjar Pahuluan, and Banjar Batang Banyu. In 2010, there were 4.1 million Banjar people, with about 3 million living in South Kalimantan, 1 million in other Kalimantan provinces, and 500,000 outside Kalimantan. The Banjar originated from various rivers like Bahan, Barito, Martapura, and Tabanio, and they have migrated extensively across the archipelago and even to Madagascar. The second-largest ethnic group is the Javanese (14.51%) living in transmigration areas. Another group, the Tionghoa Parit, is a sub-group of Chinese Indonesians residing in the Parit river area. The Chinese in Banjarmasin are known as Cina Parit by the Banjar people, and they live in Chinatown, including Pacinan Laut Village and Pacinan Darat Village. The Dayak, the original inhabitants, are in the Meratus Mountains region and along the Barito River to Central Kalimantan. Islam is the main religion, followed by about 96% of the population. There are also Christian, Hindu, and Buddhist communities, along with the Kaharingan belief practiced by the Dayak people around the Meratus Mountains. == References == Category:Provinces of Indonesia Category:Kalimantan",
 "title": "South Kalimantan"
}