{
 "id": "106430",
 "text": "Cyclone Nargis was a tropical cyclone. It was the first in the Indian Ocean in 2008. It was a Category 4 storm. It made landfall (went on land) in Myanmar (Burma) in April and May 2008. It was possibly one of the worst storms to have hit the country. The United Nations estimated in its report that 1.5 million people were severely affected by this cyclone. Officially at least 78,000 were killed with 58,000 missing. After the disaster, the Burmese government called for help in dealing with the situation. Some people said the government had problems coping with the situation. More recent reports from the government say that about 80,000 have died. Some non-governmental organizations estimate that the final number will be well over 100,000. Aid workers that came into the country estimate that 2 to 3 million are homeless, in the worst disaster in Burma’s history. They say it is comparable with the 2004 Indian Ocean tsunami. Andrew Kirkwood, country director of a British charity organisation said: \"We're looking at 50,000 dead and millions of homeless. I'd characterise it as unprecedented in the history of Burma. [It has had about the same effect as] the tsunami on individual countries. There might well be more dead than the tsunami caused in Sri Lanka.\" The United Nations said that up to 2.5 million people needed help urgently. The Red Cross said there could be up to 128,000 dead. The storm caused the government to declare five regions as disaster areas. - Yangon, Ayeyarwady, Bago Divisions, Mon and Kayin States. Thousands of buildings were destroyed; in the town of Labutta, located in the Ayeyarwady Division, state television reported that 75% of buildings had collapsed, and 20% had their roofs ripped off.\"Hundreds killed by Burma cyclone\", BBC News, 4 May 2008. It is believed that the cyclone is the deadliest tropical cyclone in the world since Hurricane Mitch in 1998, which killed about 18,000 people. At least 10,000 people have been reported to have died in the delta town of Bogale.\"Cyclone kills 10,000 in one Myanmar Town - Reuters, 6 May 2008\" A diplomat in the city of Yangon spoke to the Reuters news agency. He said that the area around him looked like a 'war zone' as a result of the cyclone. Burst sewage mains caused the landscape to flood with waste, ruining the rice crop. An official from the United Nations also talked about the situation, at the time of the event. \"It's a bad situation. Almost all the houses are smashed. People are in a terrible situation,\" he said. Another UN representative reported that \"The Irrawaddy delta was hit extremely hard not only because of the wind and rain but because of the storm surge.\" The Daily Telegraph, a UK newspaper, reported that food prices in Myanmar could be affected by this disaster. ==International Help== On 6 May 2008, the Burma government representation in New York formally asked the United Nations for help. But in other ways, it remains resistant to the most basic assistance. As of 7 May 2008, the government of Burma has not officially endorsed international assistance, but stated that they are, \"willing to accept international assistance, preferably bilateral, government to government.\" The biggest challenge at present was obtaining visas for entry into the country. According to Thai Rath Newspaper of Thailand on 8 May 2008, (Thai) in the afternoon (Bangkok time) of 7 May 2008, the Burmese junta permitted Italian flights containing relief supplies from the United Nations, and twenty-five tonnes of consumable goods, to land in Myanmar. However, many nations and organizations hoped to deliver assistance and relief to Burma without delay. Most of their officials, supplies and stores were waiting in Thailand and at the Yangon airport, as the Burmese junta did not want to issue visas for many of those people. These political tensions raise the concern that some food and medical supplies might become unusable, even before the Burmese junta officially accepts the international relief effort. It happened on 2 May 2008. The storm was estimated to be category 4 (105 mph) Cyclone Nargis Caused destruction and at least 138,000 fatalities. There were around 55,000 people missing and lots of other deaths were found in other places. In Sri Lanka the cyclone produced masses of rainfall which led to flooding and landslides across ten districts across the country. The districts Ratnapura and Kegalle were the most affected, where more than 3,000 families were dead. Thousands of houses were flooded, with 21 reported destroyed. The rainfall left 4,500 people homeless, and more than 35,000 people were affected on the island. Three people were reported injured on the island, with two others dead. The power of the cyclone lowered temperatures along the Indian coastline. Estimates of the people still missing were 53,836, with 84,537 confirmed dead. Thousands more people were still missing or washed out at sea and drowned, it was feared up to 1 million people might have died in this disaster. Thailand sent US $100,000 in supplies, thirty tones of medical supplies and twelve tones of food supplies. As well as this, Italy provided 30 tons of emergency relief equipment, like stretchers, generators, and water purifiers. The United Kingdom committed ₤17 million. Australia gave $25 million and 31 tonnes of supplies, whilst Belgium sent €250,000. China sent $10 million in relief resources. France gave 1,500 tons of medicine, food, and water, and Germany sent $3.0 million. All to help the people who had been affected. ==Continuing efforts through 2010== * Humanitarian Efforts unsuccessful ** The mission of the Emergency teams has been to help the people of Burma. Since the cyclone hit in May 2008 the current military regime has rejected international aid and humanitarian efforts while also harassing and imposing restrictions on its citizens who are still in need of help. The arrests of relief workers and the situation of the government not allowing workers to access lands that are in need of being rebuilt are examples that these people are not being provided with the resources they need to recover from Cyclone Nargis ** Source Information: Science Daily ==References== ==Other websites== * * Damage information from BBC * Map: Deadly path of Cyclone Nargis Category:Tropical cyclones in Asia Category:North Indian Ocean cyclones Category:Deadly storms Category:2008 in weather",
 "title": "Cyclone Nargis"
}