{
 "id": "1064761",
 "text": "Kid Flash is the name of several fictional superheroes appearing in American comic books published by DC Comics. The character was created by John Broome and Carmine Infantino, first appearing in The Flash #110 (1959). They are speedsters and sidekicks to The Flash, and members of the Flash Family. Their costume have the reverse color scheme of their mentor. == Fictional character biographies == === Wally West === Originally the character behind the mask was Wally West, the nephew of Barry Allen, who received his super-speed powers in an identical accident to his adult counterpart. West was Kid Flash for many years until Barry was killed during the Crisis on Infinite Earths and Wally graduated to assume his position. === Bart Allen === The second version is Bart Allen, a descendant of the Allen Family from the 30th Century who traveled back to our time as Impulse before graduating to his current title. === Wallace West === The third and current version is Wallace \"Ace\" West, the cousin of the original Kid Flash, who has the same name as him. They have all been regular members of the Teen Titans while using this alias and the third has been a member of Defiance. == Powers and abilities == Kid Flash can move at velocities far exceeding those of normal humans, allowing him to run, react, and think at incredible speeds. This enables rapid travel across large distances and quick combat responses. His super-speed grants him lightning- fast reflexes, making him highly agile and capable of dodging attacks or reacting instantly to threats. Kid Flash can vibrate his molecules at high frequencies, allowing him to phase through solid objects, become intangible, and avoid attacks. His super-speed enhances his visual and auditory senses, allowing him to perceive events happening at high speeds and process information rapidly. Due to his rapid metabolism and cellular activity, Kid Flash can recover from injuries faster than normal humans. His agility and quick reflexes make him a formidable hand-to-hand combatant, often striking enemies before they can react. Kid Flash can generate and manipulate electricity, often manifesting as a crackling aura or lightning effects when moving at super-speed. His accelerated cellular activity may grant him a longer lifespan compared to ordinary humans. Overall, his primary and most recognizable ability is his super-speed, which influences his other powers and combat style. == In other media == The Wally West version of Kid Flash was first adapted for live action in the Arrowverse family of TV shows, played by Keiynan Lonsdale. Category:DC Comics superheroes",
 "title": "Kid Flash"
}