{
 "id": "1064174",
 "text": "Watazumi Shrine (和多都美神社) is a shinto shrine on Tsushima Island in Japan. Lots of tourists came there from South Korea. But in January 2020 they banned tourists because South Korean tourists did bad things. It has a famous row of five torii gates in a row with two in the ocean similar to Itsukushima Shrine. In 2020 it was damaged by a typhoon and Ghost of Tsushima fans helped raise money to repair it. It is sometimes called also known as Watatsumi Shrine. It should not be confused with the nearby Kaijin Shrine, also sometimes called Watatsumi Shrine, which is much older or the more distant Watatsumi Shrine in Kobe both of which have similar names, or the completely unrelated Watatsu Shrine == Visitor problems == In January 2020 they changed the rules so foreigners could not visit. They did this because South Korean people did bad things at the shrine like vandalism, thefts, and a threat against the head priest. People did lots of bad things in the Some people held picnics at the shrine, a YouTube creator filmed there without permission, tour guides disrespecting sacred areas, and Korean graffiti. People stole some amulets. A Korean tour guide threatened the priest's life. Because of this rule change a lot less Korean people went to Tsushima that year. == Typhoon destruction == A typhoon damaged a torii gate at Watatsumi Shrine. This happened in September 2020. On November 27, 2020 people started crowd funding to fix the gate on the Japanese website Camp-Fire. The campaign reached its goal quickly. This goal was 5 million yen. It was reached by December 1, 2020. The campaign ended on January 10, 2021. It raised 27,103,882 yen. This is about $260,435 United States dollars. Many donors were fans of the \"Ghost of Tsushima\" game. People planned to start fixing the shrine in April 2021, and to finish by August 2021. People planned a stone monument. It would list the names of those who donated at least 10,000 yen. Some people were afraid workers would get sick from COVID-19. == In popular culture == In the game \"Ghost of Tsushima,\" there is a similar shrine. It is called the Scarlet Rock Shrine. The real shrine is dedicated to two gods, Hikohohodemi no Mikoto and Toyotamabime. The game's shrine is dedicated to Tsukuyomi. ==Related pages== *Kaijin Shrine *Watatsumi Shrine *Mihashira Torii ==References== Category:Shinto shrines in Nagasaki Prefecture Category:Myōjin Taisha Category:Son-sha Category:Shinto shrines",
 "title": "Watazumi Shrine"
}