{
 "id": "1064055",
 "text": "Theodore Stephen Ted Kord is a fictional character from Charlton Comics and later acquired by DC Comics. The character was created by Steve Ditko and Gary Friedrich, first appearing in Captain Atom #83 (1966). He was the second hero to call himself Blue Beetle, successor to Dan Garrett and predecessor to Jaime Reyes. Garrett was his mentor and he vowed to take up the crime-fighting legacy, although when he found himself unable to activate the Blue Beetle Scarab he turned to science and martial arts instead. He has been a member of Justice League International, the Living Assault Weapons and the Birds of Prey. His most enduring partnership is with his best friend Booster Gold. == Publication history == Ted Kord was created by Steve Ditko and Gary Friedrich, first appearing in Captain Atom #83 (1966). == Fictional character biography == Ted was a former student of Dan Garrett, and they were investigating his uncle Jarvis Kord, learning Jarvis was working to create an army of androids to take over Earth; Garrett fought Jarvis, but both were killed in the battle. He is one of the smartest men in the DC Universe, and puts his inventions to public use through Kord Industries. == Powers and abilities == Ted Kord had no superpowers; he possesses a genius-level intellect, with an IQ of 192. He is proficient in numerous sciences such as physics, chemistry, computer science, genetics, mechanical engineering, and aerospace engineering. He additionally has a comprehensive understanding of extraterrestrial technology. Despero once claimed that Ted's mind was second only to that of J'onn J'onzz. Former Justice League teammate Guy Gardner claims that Ted was smarter than Batman, \"although nobody ever noticed\". Kord was an Olympic-level acrobat and skilled hand-to-hand combatant, having studied in the martial arts of karate and aikido. Dick Grayson stated that Ted was very adept physically, to the point where he was almost ambidextrous. He is also highly skilled in espionage. == In other media == Since his debut in the comics, Kord has made appearances in numerous media, outside the comics; most notably the animated trilogy adaptation of the Crisis on Infinite Earths storyline, set in the Tomorrowverse, where he was voiced by Matt Lanter, reprising his role from DC Showcase: Blue Beetle. Category:DC Comics characters",
 "title": "Ted Kord"
}