{
 "id": "1064778",
 "text": "North Maluku is a province in Indonesia that includes the northern part of the Maluku Islands. It is surrounded by the Pacific Ocean to the north, the Halmahera Sea to the east, the Molucca Sea to the west, and the Seram Sea to the south. It shares borders with other Indonesian provinces and countries like North Sulawesi, Southeast Sulawesi, Central Sulawesi, Maluku, Southwest Papua, Palau, and the Philippines. The capital is Sofifi on Halmahera Island, and the largest city is Ternate. In 2010, about 1 million people lived there, but by 2020, the population increased to around 1.3 million.C.F. van Fraassen 1987 Ternate, de Molukken en de Indonesische Archipel. Leiden: Rijksmuseum te Leiden, Vol. I, p. 18. == History == In the past, North Maluku was a significant area with Islamic sultanates. When Europeans arrived in the 16th century, there was competition between the Portuguese, Spanish, and Dutch for control. Eventually, the Dutch took over and ruled for three centuries. During World War II, the Japanese occupied the region. After Indonesia became independent, North Maluku became part of the Maluku province. The official establishment of the North Maluku province was in 1999, separating from Maluku. Ternate was its capital until 2010, when it moved to Sofifi. The economy mainly depends on agriculture, fisheries, and marine products like copra, nutmeg, cloves, and gold. Agricultural products include rice, corn, sweet potatoes, beans, coconut, and more. == Demographics == In 2020, North Maluku had about 1.3 million people, and it's estimated to have grown a bit more in 2022. The largest population is in South Halmahera Regency, with over 248,000 people, followed by Ternate city with around 205,000. The smallest population is in Central Halmahera Regency with about 56,800. The region's average annual population growth is 2.07%, with Morotai Island Regency growing the fastest at 3.40% per year and Ternate growing the slowest at 0.96% per year. North Maluku is not very crowded, with 40 people per square kilometer in 2020. Ternate is the most crowded place with 1,840 people per square kilometer, while East Halmahera Regency is less crowded with only 14 people per square kilometer.Badan Pusat Statistik, Jakarta, 2023, Provinsi Maluku Utara Dalam Angka 2023 (Katalog-BPS 1102001.82) North Maluku has many different ethnic groups and languages—about 28 in total. They can be grouped into Austronesian and Papuan language families. Austronesian groups live in the central and eastern parts of Halmahera, while Papuan-speaking ethnic groups dominate North and West Halmahera. In the Sula Islands, there are more ethnic groups. Most people here can speak Ternate Malay. The majority of people in North Maluku are Muslim, and there's a significant Christian (mostly Protestant) minority. A small part of the population follows Hinduism, Buddhism, or other religions. According to 2017 data, about 75% practice Islam, almost 24% are Protestant, and the rest follow Catholicism, Hinduism, Buddhism, or other beliefs. == References == Category:Provinces of Indonesia Category:Maluku Islands",
 "title": "North Maluku"
}