{
 "id": "1064771",
 "text": "The Tibetan script is a way of writing that is used for different Tibetic languages like Tibetan, Dzongkha, Sikkimese, Balti, Ladakhi, and Purgi. It's also been used for some languages not from Tibet but close to its culture, like Thakali, Sanskrit and Old Turkic. The printed form is called uchen script, and the cursive form used for everyday writing is called umê script. People use this writing system in the Himalayas and Tibet. The script is closely connected to the Tibetan identity, which includes people from areas in India, Pakistan, Nepal, Bhutan, and Tibet. The Tibetan script comes from the Gupta script. == Alphabets == In Tibetan writing, the syllables go from left to right, and a mark called a tsek (་) separates syllables. Because many Tibetan words have only one syllable, this mark is almost like a space. They don't use spaces to separate words. === Basic Alphabets === The Tibetan alphabet has thirty main letters, also called \"radicals,\" for consonants. Like in other Indic scripts, each consonant letter has a built-in vowel, which is /a/. The letter ཨ is also the starting point for adding extra vowel marks. Even though some Tibetan dialects have tones, the language didn't have tones when they made the script. There are no special symbols for tones. But because tones came from certain features in the language, you can usually tell the tone by looking at how Tibetan words were spelled in the past.Daniels, Peter T. and William Bright. The World's Writing Systems. New York: Oxford University Press, 1996. Unaspirated high Unaspirated high Aspirated medium Aspirated medium Voiced low Voiced low Nasal low Nasal low Letter IPA Letter IPA Letter IPA Letter IPA Guttural Palatal Dental Labial Dental style=\"background:beige; font-size:24px;\" style=\"background:#d6f5d6; font-size:24px;\" low ; medium high === Vowels === Vowel mark IPA Vowel mark IPA Vowel mark IPA Vowel mark IPA ===Extended alphabet=== When the Tibetan alphabet is used to write languages like Balti, Chinese, and Sanskrit, they sometimes add or change letters from the regular Tibetan alphabet to show different sounds. Letter Used in Romanization & IPA Balti qa (/q/) Balti ɽa (/ɽ/) Balti xa (/χ/) Balti ɣa (/ʁ/) Chinese fa (/f/) Chinese va (/v/) Sanskrit gha Sanskrit jha Sanskrit ṭa Sanskrit ṭha Sanskrit ḍa Sanskrit ḍha Sanskrit ṇa Sanskrit dha Sanskrit bha Sanskrit ṣa Sanskrit kṣa == References == Category:Tibet Category:Writing systems",
 "title": "Tibetan script"
}