{
 "id": "1064087",
 "text": "Gary Leschinsky is an American student and inventor who has gained recognition in the medical device industry for his notable contributions to the fields of allergy awareness, education, and invention. == Early Life and Education == From the age of 7 years old, Leschinsky demonstrated an interest in STEM (Science, Technology, Engineering, and Math), particularly in inventions that could solve real-world problems. He currently pursues his interests in STEM at the Davidson Academy Online, an online secondary school based in Reno, Nevada. == Advancement of Early Allergy Detection == Leschinsky is most known for his development of the \"A-Watch for Allergies\" at the age of 8 years old. This is a device designed for the early detection and notification of allergic reactions. For his notable contribution to the advancement of research in early food allergy detection, Leschinsky was inducted in 2016 into the National Gallery for America's Young Inventors at the National Museum of Education.https://mydigitalpublication.com/publication/?i=794630&p;=54&view;=issueViewer Leschinsky's invention, developed to assist individuals unable to communicate their symptoms effectively, received a United States Patent in 2019 (patent number US10213150B2).https://patentimages.storage.googleapis.com/64/ca/ec/6bcb6041c69ae4/US10213150.pdf Leschinsky's medical invention led him to present to the investors of Shark Tank in a kid inventors segment. In addition, another one of his inventions, the \"Nose and Earmuffs\" was presented on The Tonight Show Starring Jimmy Fallon. In November of 2023, Leschinsky presented a TEDx Talk at Nashua High School South. == Notability in Chess == Leschinsky is also known for his notable achievements in chess. He started chess lessons at the International Chess Academy of New Jersey and rapidly improved his skills. In December of 2022, he was ranked #10 for all US 14-year-olds by the United States Chess Federation. == References == Category:Living people Category:Year of birth missing (living people) Category:American inventors",
 "title": "Gary Leschinsky"
}