{
 "id": "1064750",
 "text": "AEW x NJPW: Forbidden Door (2023) was a professional wrestling pay-per-view show co-promoted by All Elite Wrestling (AEW) and New Japan Pro-Wrestling (NJPW). It took place on June 25, 2023 at the Scotiabank Arena in Toronto, Ontario, Canada. It was the second Forbidden Door event held by AEW and NJPW. The event was the first AEW PPV held outside of the United States and NJPW's first PPV in Canada. This was also the first non-WWE professional wrestling event held at the arena since November 21, 1999, when World Championship Wrestling (WCW) held Mayhem at the then-Air Canada Centre. The main event of the show saw Bryan Danielson defeat Kazuchika Okada. Danielson trapped Okada in an omoplata and then transfer into his LeBell lock to make Okada to tap out, getting the submission victory. During the match, Danielson suffered a legitimate fracture in his elbow after a top rope diving elbow drop from Okada landed on his arm. The event got very positive receptions from fans and critics. The IWGP United States Heavyweight Championship match between Kenny Omega and Will Ospreay, the AEW International Championship match, the 10-man tag team match, and the main event match all recieved praise. Dave Meltzer of the Wrestling Observer Newsletter rated the IWGP U.S. Championship match 6 stars out of 5, making it the highest rated match in AEW history at that time. Meltzer said that the match was one of the greatest matches in the history of AEW. ==Matches== No. Results Stipulations Times 1 Tom Lawlor (with Royce Isaacs) defeated Serpentico (with Luther) Singles match 4:10 2 Mogul Embassy (Swerve Strickland, Toa Liona, Brian Cage, and Bishop Kaun) (with Prince Nana) defeated Chaos (Rocky Romero, Chuck Taylor, and Trent Beretta) and El Desperado Eight-man tag team match 12:30 3 Athena defeated Billie Starkz Women's Owen Hart Cup Tournament first round match 7:50 4 El Phantasmo defeated Stu Grayson Singles match 7:15 5 Los Ingobernables de Japon (Shingo Takagi, Bushi, and Hiromu Takahashi) defeated United Empire (Jeff Cobb, Kyle Fletcher, and TJP) Six-man tag team match 7:30 6 MJF (c) defeated Hiroshi Tanahashi Singles match for the AEW World Championship 15:30 7 CM Punk defeated Satoshi Kojima Men's Owen Hart Cup Tournament first round match 13:40 8 Orange Cassidy (c) defeated Zack Sabre Jr., Katsuyori Shibata, and Daniel Garcia Four-way match for the AEW International Championship 11:15 9 Sanada (c) (with Douki) defeated \"Jungle Boy\" Jack Perry (with Hook) Singles match for the IWGP World Heavyweight Championship 10:45 10 The Elite (\"Hangman\" Adam Page, Matt Jackson, and Nick Jackson), Eddie Kingston, and Tomohiro Ishii defeated Blackpool Combat Club (Jon Moxley, Wheeler Yuta, and Claudio Castagnoli), Konosuke Takeshita, and Shota Umino 10-man tag team match 21:25 11 Toni Storm (c) (with Ruby Soho and Saraya) defeated Willow Nightingale Singles match for the AEW Women's World Championship 10:30 12 Will Ospreay (with Don Callis) defeated Kenny Omega (c) Singles match for the IWGP United States Heavyweight Championship 39:45 13 Sting, Darby Allin, and Tetsuya Naito defeated Le Suzuki Gods (Chris Jericho, Sammy Guevara, and Minoru Suzuki) Six- man tag team match 15:10 14 Bryan Danielson defeated Kazuchika Okada by submission Singles match 27:40 ==References== Category:2023 in sports Category:2023 in Canada Category:All Elite Wrestling shows Category:New Japan Pro-Wrestling Category:Sport in Toronto",
 "title": "Forbidden Door (2023)"
}