{
 "id": "1064210",
 "text": "Robert Jermain Thomas ( 17 September 1840disappeared 31 August 1866) was a Welsh Protestant Christian man who served as a missionary with the London Missionary Service spreading the gospel in China and Korea. While serving as a missionary in China, Thomas developed a strong desire to work as a missionary in Korea, among it's peoples. At the time, Korea was closed to foreigners because of the government's fear of foreign influence on Korea. Many Koreans had been converted by Catholic priests in the end of the 18th century, but the government had around 8,000 of those converts killed. == Biography == Robert Jermain Thomas was born 17 September 1840, in Rhayader, Powys, Radnorshire, Wales, United Kingdom. In 1863, Thomas married a woman named Caroline Godfrey. Thomas and his newly married wife Godfrey went as missionaries to China with the London Missionary Service to spread the gospel to the Chinese people. Four months after their arrival in Shangai, China, his wife Godfrey suffered a miscarriage and died afterwards from the consequences in 1865. == Death == 31 August 1866 was the day that the Americans had begin launching attacks on Korea. An American ship not far from the shores of Korea began attacking the shores and some towns of Korea. Some civilians were wounded and killed due to the attacks. In response to the attacks, Korea began attacking the American ships that attacked them. This started a conflict between Korea and the United States. Meanwhile, Robert Jermain Thomas was in Korea. The entire conflict lasted two days. Two days after the attack began, the Americans having a damaged ship due to the Korean attacks had surrendered on 2 September. After those attacks, Roman Jermain Thomas was not seen again. It is possible that he died due to the attacks. He was last seen on 31 August 1866 (the day that the conflict had began). He was later declared a proclaimed martyr of Korea. Category:1840 births Category:1866 deaths Category:Welsh Christians Category:Christian missionaries",
 "title": "Robert Jermain Thomas"
}