{
 "id": "1064498",
 "text": "Pran Sukh Yadav (1802-1888) was a military commander from Behror in Alwar district of Rajasthan which was part of Ahirwal region and under the control of Ahir ruler of Rewari (before 1803 after that given by EIC to Alwar princely state). He was a revolutionary of the Indian Rebellion of 1857 and as a close friend of Hari Singh Nalwa and the --Punjab ruler Maharaja Ranjit Singh. Later during the First Rebellion of India in 1857 he fought along with Rao Tula Ram of Rewari against the British in the Battle of Nasibpur. In his early career he trained Sikh Khalsa Army. After the death of Maharaja Ranjit Singh, he fought in both the First and Second Anglo-Sikh wars, due to his hatred towards the British. He also started giving military training to the farmers of Ahirwal Region. == Early Life of Pran Sukh Yadav == Pran Sukh's father was the friend of Hari Singh Nalwa. His father was fighting in Bengal war at the time of his birth. At the age of 5, under the supervision of his father, he learned the art of war as well as making efficient war strategies. It was the gift of his father's education and knowledge that he became the Army Chief of Hari Singh Nalwa's army at the young age of seventeen. == Family == Pran Sukh Yadav descendants include the Royal family of Rao Jai Dayal Yadav, Village Nihalpura, Neemrana. One of his great grandsons, Dev Vrat Yadav is an Eminent Lawyer of Rajasthan High Court. After merging the princely state in Independent India, Rao Jai Dayal Yadav developed the Ahirwal region and played a role in bringing western education facilities to grassroots level. == Conflict with Kashmiri Muslim == Pran Sukh went out alone to roam around in Nainikhad (then Punjab), Himachal Pradesh in his father's absence. Nainikhad is a village very close to Kashmir. Pransukh saw the forest, far from the village. On the way to the forest, he saw a military cantonment who asked him the reason for coming to the forest. Before Pransukh could understand, the Muslim commander with his thirty soldiers attacked Pran Sukh. With the knowledge of his weapon given by his father, he immediately took charge and killed all thirty soldiers. After seeing the fight of Pran Sahib with the soldiers, the commander starts running. Pransukh followed him and at the end he threw his spear, which passed through his chest, and got stuck in the trunk of a tree. Pransukh Sahib was merely twelve years old when he committed the massacre. == Battle of Pakhli == When Pransukh was 17, the Kashmiri muslims begun hostilities again. As Sahib's father was a friend of Nalwa, he told Nalwa to send the chieftains of all warlike Yadav bases of Ahirwal along with Pran Sukh to help in the war from another end for the welfare of the country. When the time came to go into battle, Hari Singh Nalwa appointed Pransukh Sahib as his commander. Pransukh, who was leading the army of Yadavs and Sikhs on the front, waved his sword in an uncanny manner. Unsettled, the opposing camp went back. After the war, many small Kashmiri princely states joined Nalwa. After this war the door of Sikh empire opened to rule over Afghanistan and Iran. == First Anglo Sikh war == Pransukh ji, along with a group of the warriors of Ahirwal, opposed the British army in both the Anglo-Sikh wars of India. The first war was in his name only, in which, seeing his bravery, the Empress of London offered him to become her commander in Asia which he refused. Even after the death of Sher-e-Punjab, Pransukh Sahib continued fighting against the British in the battlefield. Ranjit Singh had said in his praise that:- When we thinking about implementing a strategy till then Pransukh had killed more than a hundred soldiers alone.\" In his commanding rule under Nalwa, when soldiers and commander of other armies hears that Yadav is in the battlefield, many soldiers fled. Nalwa in his praise said:- \"If soldiers start running away from the battlefield during the war then their might be the Pran Sukh in the field too\". == Revolt of 1857 == In the battle of Nasibpur in 1857, Rao Tula ram and Rao Jaitsi Singh (descendent of Rao Ajaypal Singh of Narnaul) along with Yadav fought with the British Army at Nasibpur. He then went to Russia to seek military help, but died on the way. After learning about the mutiny in Erinpura Regiment, Pran Sukh Yadav made contact with the commanders of the Jodhpur legion, and considered it to be an appropriate time to fight with the British Army at Narnaul. The Indians ended up losing the battle, and he, along with his other companion, went into hiding for nearly next few years, but eventually resurfaced and settled in his native village, Nihalpura, now in Alwar of Rajasthan, and became a follower of Arya Samaj in his last years. == Famous Battles == # Battle of Pakhli # First Anglo-Sikh War # Second Anglo-Sikh War # Battle of Mirpur # Battle of Rajouri # Battle of Baramula # Battle of Dhamtaur # Battle of Gandgarh # Battle of Jamrud # Battle of Nasibpur # Siege of Mankera == References == Category:Yadav category:Ahirwal category:Rewari category: Alwar",
 "title": "Pran Sukh Yadav"
}