{
 "id": "1064433",
 "text": "Anton Cargnelli (1 February 1889 - 27 June 1974 ) was an Austrian football player and football coach. He won the Austrian championship once with Wiener AF in the 1913-14 season. He also played one match for the Austrian national football team As coach he won the Scudetto, the Italian championship, with FC Torino in 1928 and 1940 with Ambrosiana-Inter. ==Career== He was the son of an Italian father and grew up in Vienna. Cargnelli started playing football in the Rennweger SV youth team in 1901. He came to SC Germania Schwechat via AC Viktoria Wien. He played there as forward. In 1910 he joined the newly founded Wiener AF. There he now played as defender. In the 1913/14 Cargnelli's team won the championship. In the following season, the WAF reached second place in the championship, which was overclouded by the beginning of the war. In 1919 he returned to the Germania Schwechat. He again played as a striker . At the same time Cargnelli took over the training of all the teams. In 1921 he ended his active career. ==International== In May 1909, Cargnelli played his only game in the Austrian national team in a 1-1 draw against Hungary in Budapest. He was in the forward line with Karl Beck. ==Manager== After he had already worked as a player-coach at the end of his playing career, he took a coaching career. He first took sports science courses in Germany . Then he took coaching positions in Cologne, Idar-Oberstein and Dortmund.Sport Tagblatt, 22. July 1922 (German) For half a season he trained SK Admira WienThen he coached FC Mühlburg in 1924/25. This was followed by a year in Romania. He then moved to Italy, where he spent the rest of his coaching career. His first stop was FC Torino, with whom he was able to win the championship title in 1928. In 1929 the Turin team lost in the final to AGC Bologna. After the introduction of Serie A, Cargnelli moved to the second division club US Palermo for three seasons. This was followed by working for US Foggia and AS Bari. In 1934 he returned to Torino. Two more years in Bari followed before Cargnelli accepted an offer from Milan and moved to Ambrosiana. There he won the Italian Cup with his team in 1939 and became Italian champions the following year with players .Homepage Inter Milano (Italian) During the war years he again looked after Torino. Hee was runner-up once and was involved in building the team that would later become famous as Grande Torino. After the end of the war, Cargnelli spent two more seasons at Lazio and Bologna before Cargnelli ended his career at third division club US Alessandria Calcio. ==References== Category:1889 births Category:1974 deaths Category:Association football forwards Category:Association football defenders Category:Austrian footballers Category:Players of the Austrian national football team Category:Austrian football forwards Category:Austrian football defenders Category:Austrian football champions",
 "title": "Anton Cargnelli"
}