{
 "id": "1065672",
 "text": "Peter II Alexeyevich (23 October 1715 – 30 January 1730) was Emperor of Russia from 1727 until his death in 1730. He was the son of Tsarevich Alexei Petrovich and Charlotte Christine of Brunswick-Lüneburg. After Catherine I's death. Alexander Menshikov and Prince Aleksey Dolgorukov influenced Peter, and this led to problems in running the country and making serfdom stronger. Peter's time as ruler was marked by confusion and not paying enough attention to important matters. Even though he was supposed to marry Ekaterina Dolgorukova, but he got sick with smallpox and died before the wedding. This made him the last male member of the House of Romanov. == Early life == Peter was born in Saint Petersburg on 23 October 1715. His father was Tsarevich Alexei Petrovich and mother was Charlotte Christine of Brunswick-Lüneburg, who had connections to European royalty. He was a cousin of Empress Maria Theresa of Austria. When Peter was ten days old, his mother died. His father, Alexei, was accused of treason by Peter the Great and died in prison in 1718. So, Peter and his sister Natalya, who were only three and four years old, became orphans. Their grandfather didn't care about raising them because he disliked their father. Peter was kept in strict isolation since childhood. Peter's early teachers were the wives of a tailor and a vintner, and a sailor named Norman taught him navigation. As he got older, a Hungarian noble named Janos (Ivan) Zeikin (Zékány),Zékány János - Offices. Sándor Takáts: Z. J. Bpesti Hírlap, 1902. 332. took care of his education. Peter the Great died in 1725, and Catherine I succeeded him. Minister Menshikov, who helped Catherine become empress, replaced Peter's teachers with Count Ostermann. Ostermann's education plan included history, geography, math, and foreign languages, but Peter wasn't interested. He preferred hunting and feasting (eating). When Catherine I died in 1727, it became clear that Peter, as Peter the Great's grandson, couldn't be kept from his inheritance much longer. Most Russians and three- quarters of the nobility supported him. The Holy Roman Emperor Charles VI, who was married to Peter's mother's sister, urged Peter's claims. With Menshikov's efforts, Peter was named Catherine's heir, even though she had two daughters. The documentation also specified Peter's engagement to Menshikov's daughter Maria. == Reign == After Catherine died in May 1727, Peter II became emperor. Menshikov, a powerful figure, took control of Peter and his actions. For a few months, Menshikov was so feared and obeyed that even Peter the Great wasn't like that, says the Saxon ambassador. Menshikov became arrogant, issuing orders to the Emperor and taking gifts back. When Peter protested, Menshikov got sick, and his enemies used this chance. Under Ostermann and the Dolgorukovs' influence, Peter stripped Menshikov of his rank from September 1727, and sent him to Siberia. The engagement with Menshikov's daughter was also canceled. The Senate, the Privy Council, and the guards pledged allegiance. Mathematician Christian Goldbach became Peter II's tutor, replacing Menshikov's choice, Andrey Osterman. Peter II was smart but stubborn, like his grandfather. Unlike Peter the Great, he didn't want to learn to rule. Being young, he struggled to manage public affairs and rarely attended the Supreme Privy Council. This frustrated his subjects, and officials hesitated to make important decisions. The Russian fleet suffered, but Peter II didn't care. He made serfdom stricter by not allowing serfs to volunteer for military service and escape their status. After Menshikov fell, Prince Aleksey Dolgorukov and his son Ivan became the Emperor's favorites. Ivan led Peter II into a reckless lifestyle—feasting, playing cards, and spending time with women. Peter II soon became addicted to alcohol. The coronation of Peter II took place in Moscow on 9 January 1728, but he didn't pay much attention to running the country. Foreign witnesses said Russia was in a terrible mess with no one getting paid, and people were stealing. Moving the court back to Moscow in 1728 upset Saint Petersburg, a city Peter the Great worked hard to develop. Peter II visited Saint Petersburg sometimes but mostly lived a carefree life, influenced by the Dolgorukovs. He became interested in Ekaterina Dolgorukova and got engaged to her, even though he wasn't really interested. The wedding was planned for 30 January 1730. In December 1729, Peter II got seriously ill, and his condition worsened after a feast on 17 January 1730. He was diagnosed with smallpox, and in his delirium, he wanted to visit his sister who had already died. He died on January 30, the day he was supposed to marry Ekaterina Dolgorukova. He was buried in Moscow's Cathedral of the Archangel, an honor given to only a few Russian monarchs. With Peter's death, the Romanov dynasty's direct male ended. Anna Ivanovna, daughter of Peter the Great's half-brother, became emperor. == Notes == == References == Category:1715 births Category:1730 deaths Category:Deaths from smallpox Category:Emperors and Empresses of Russia Category:House of Romanov Category:18th century in Russia",
 "title": "Peter II of Russia"
}