{
 "id": "1065741",
 "text": "Series 23 of I'm a Celebrity...Get Me Out of Here! began on 19 November 2023 on ITV. The series is being filmed in Murwillumbah, New South Wales, with Ant & Dec returning to present the series. == Production == Following the conclusion of the twenty-second series, ITV confirmed an \"All-Stars\" series I'm a Celebrity...South Africa featuring previous contestants, which aired earlier in 2023 and was won by Myleene Klass. The first trailer for the twenty-third series aired in October 2023, which featured a ten-second clip of presenters Ant & Dec working at a luxury \"Jungle Retreat\" and with an added voiceover speaking the words \"Come away with us [to the Jungle Retreat]\". A further extended trailer was released a week later, teasing the series as a peaceful and relaxing setting fit for a celebrity with Ant & Dec undertaking jobs such as pouring mealworms into a bath. It also included a voiceover describing the eating trials as \"exotic cuisine\" and enticing celebrities to join the \"ultimate jungle experience\". The trailer also features a five-star \"Jungle Retreat\" sign as well as an aerial view of the beach overseeing Ant & Dec writing the words \"Get Me Out of He[re]\" in the sand. == Campmates == The original line-up was announced by ITV on 13 November 2023. On 22 November 2023, Frankie Dettori and Tony Bellew were confirmed as this year's late arrivals. Grace Dent and Jamie Lynn Spears both withdrew from the series due to \"medical grounds\" on 27 and 29 November respectively. On 6th December, it was announced that Jamie Lynn Spears left the jungle without “medical reason” and she was reportedly in talks to quit I'm A Celebrity... Get Me Out Of Here! for days, it has been claimed. Celebrity Known for Status Sam Thompson Television personality & radio presenter Winner on 10 December 2023 Tony Bellew Former professional boxer Runner-up on 10 December 2023 Nigel Farage Former UKIP politician & broadcaster Third place on 10 December 2023 Josie Gibson This Morning presenter Eliminated 7th on 9 December 2023 Marvin Humes JLS singer & presenter Eliminated 6th on 8 December 2023 Danielle Harold Former EastEnders actress Eliminated 5th on 7 December 2023 Nick Pickard Hollyoaks actor Eliminated 4th on 6 December 2023 Fred Sirieix First Dates maître d'hôtel Eliminated 3rd on 5 December 2023 Nella Rose YouTube personality & influencer Eliminated 2nd on 4 December 2023 Frankie Dettori Horse racing jockey Eliminated 1st on 3 December 2023 Jamie Lynn Spears Zoey 101 actress & Britney Spears sister Withdrew on 29 November 2023 Grace Dent Columnist & restaurant critic Withdrew on 27 November 2023 == Controversies == On 29 November Spears withdrew from I'm a Celebrity for \"medical reasons\" but on 5 December Spears took part in a group dance performance on season 32 of Dancing with the Stars. Category:I'm a Celebrity...Get Me Out of Here! Category:2020s television seasons Category:2023 in entertainment",
 "title": "I'm a Celebrity…Get Me Out of Here! (British TV series 23)"
}