{
 "id": "1065949",
 "text": "Thomism is a philosophy and theology school based on the ideas of Thomas Aquinas, a Dominican philosopher and theologian from the 1200s. His famous works include disputed questions and commentaries on Aristotle in philosophy, and the Summa Theologica in theology, which is very important in medieval theology and still guides the Catholic Church's philosophy and theology. Pope Pius X in 1914 emphasized that understanding the Church's teachings requires knowing Thomas's fundamental ideas. According to him, these ideas are like the solid base for understanding both natural and divine things. If these principles are ignored, it becomes hard for students to grasp the meanings of the Church's teachings. Thomas Aquinas believed in accepting truth from any source. He combined ideas from Greek, Roman, Islamic, and Jewish philosophers. He was a realist, meaning he thought the world could be known as it is. Thomas often supported Aristotle's views and used Aristotle's terms and ideas. He also followed some neoplatonic principles, such as the belief in God as the essential being and everything being good by participating in this essential goodness. == History and Impact == Aquinas changed the direction of Scholasticism, moving it from neoplatonism to Aristotle's ideas. This shift had a big impact on Catholicism and the ethics of the Catholic school, making it one of the most influential philosophies ever. Many people follow its teachings. However, during Aquinas' time, some of his ideas were banned in Paris by Bishop Stephen Tempier, and some were condemned by ecclesiastical authorities in 1277. The Franciscan Order opposed Aquinas, while the Dominicans defended his work. Early critics included William de la Mare, Henry of Ghent, Giles of Rome, and Jon Duns Scotus. On the other hand, defenders included Albertus Magnus, Richard Knapwell, William Macclesfeld, Giles of Lessines, John of Quidort, Bernard of Auvergne, and Thomas of Sutton. Aquinas was canonized in 1323, and the condemnation of 1277 was revoked. Later, Thomism faced challenges from the via moderna, especially from William of Ockham and followers. Dominican theologians mainly held on to Thomism, and it gained strength in the 16th century in the Iberian Peninsula, with figures like Francisco de Vitoria, Domingo de Soto, John of St. Thomas, Domingo Báñez, and others. In the modern period, Pope Leo XIII tried to revive Thomism with the encyclical Aeterni Patris in 1879. This led to Neothomism, which emphasized the ethical aspects of Thomism. It dominated the Roman Catholic Church until the Second Vatican Council. Thomism is still an influential philosophy in Catholicism today, although the Church does not favor one philosophy over others. In recent times, the cognitive neuroscientist Walter Freeman suggests that Thomism is a philosophical system that aligns well with the understanding of cognition in neuroscience.In his 2008 article in the journal Mind and Matter entitled \"Nonlinear Brain Dynamics and Intention According to Aquinas.\" == References == Category:Philosophy Category:Catholicism Category:Christian terminology",
 "title": "Thomism"
}