{
 "id": "1065722",
 "text": "Ayat Hassan Mohammed Al-Qurmezi (Arabic: آيات حسن محمد القرمزي; also Al- Qormezi, al-Ghermezi; born 1 January 1991) is a Bahraini Poet, Student and Activist. Al-Qurmezi became famous in Bahrain and around the world when she recited a poem during the 2011 Bahrain Uprising, criticizing the government's policies to a gathering of pro-democracy protesters at the Pearl Roundabout. Her poem spread widely on social media. But after this, both Ayat and her family faced harassment (both online and offline) and threats of violence. In 2015, she won the Student Peace Prize for \"her unwavering struggle for democracy and human rights in Bahrain\". ==Biography== Ayat Al-Qurmezi was born on 1 January, 1991, in the town of Sanad, Bahrain. She is a notable poet and activist known for her outspokenness and involvement in the pro-democracy movement in Bahrain during the 2011 Bahrain Uprising. She has 4 brothers. In the 1990s her father and 2 of her brothers had also been imprisoned for speaking about political reforms. She gained widespread attention for her poetry recitations criticizing the government particularly King Hamad and advocating for political reform during the Arab Spring protests in Bahrain in 2011. Her powerful verses resonated with many seeking social and political change in the country. Her house address was leaked openly through local news channels (so that pro-government supporters attacked her) making her go into a hideout for some days. On 6 March 2011, she read a poem to the crowd at Pearl Roundabout which criticized King Hamad bin Isa Al Khalifa. One of the lines from her poem, translates to: \"We are the people who will kill humiliation and assassinate misery. Don't you hear their cries? Don't you hear their screams?\" Al-Qurmezi's activism and expressive poetry led to her arrest in March 2011, sparking international concern over her detention and the crackdown on dissent in Bahrain. The arrest was done by Bahrain police hiding their face with masks and storming the house of Ayat's family at night. When they didn't find Ayat their, they held her father at gunpoint and told the family to tell where Ayat was hiding. Her mother eventually disclosed the location, that she was at her cousin's house. The police went there and after beating her several times, arrested her. She was sentenced to one year in prison for charges related to her participation in protests and reciting poems critical of King Hamad. Her imprisonment and later torture in prison drew widespread condemnation from human rights organizations such as Amnesty International and activists globally, with many advocating for her release and highlighting her case as representative of the broader struggle for freedom of expression in Bahrain. Because of the international pressure, she was released after 3 months and 16 days. Despite facing hardships, Ayat Al-Qurmezi's resilience and courage in using her poetry as a means of activism have left a lasting impact, symbolizing the ongoing fight for human rights and freedom of speech in Bahrain. Her work continues to inspire others in advocating for social and political change. ==References== Category:1991 births Category:Living people Category:Bahraini people Category:Bahraini activists Category:Incidents of violence against women",
 "title": "Ayat Al-Qurmezi"
}