{
 "id": "1065133",
 "text": "AKTINA Productions, Inc., based in New York City, USA, is a Greek American non-profit and tax-exempt 501(c)3 Media and Arts Cultural Organization promoting the cultures of Greece and Cyprus through radio, television and live performances. AKTINA Productions, Inc., was founded by Elena Maroulleti in early 1993 and officially incorporated on July 15, 1993. ==History== AKTINA owns and operates the public service media outlets AKTINA FM and . Additionally, it owns and manages twenty-one established domains that host its websites. These websites that carry the recognized Trademark name AKTINA FM, also stream online the Greek-American Radio Station AKTINA FM, broadcasting continuously 24 hours a day, 7 days week throughout the USA and globally. In May of 1993, CYPRECO of America, Inc., also a non-profit and tax-exempt 501(c)(3) cultural organization based in New York, USA, teamed up with AKTINA Productions, Inc., to co-sponsor and present cultural programs for Cyprus and Greece within the broadcasts of the Greek American Bilingual Radio, AKTINA FM which was founded on New York’s public station WNYE 91.5FM and soon after on online. In early 2020, CYPRECO extended this collaboration to also include the delivery of similar cultural programs on AKTINA TV. In early 1994, AKTINA Productions, Inc., introduced and established the concert series, GREEK MUSIC JOURNEY (GMJ). Over 30 concerts have been produced at theaters in New York City. AKTINA’s GMJ was also selected by New York’s Lincoln Center to represent Greece in 1998, 1999 and 2000 during the annual “Lincoln Center Out Of Doors Festival.” On October 26, 2018, a ceremony was held at the New York City Council Chambers where former Council Speaker Corey Johnson and the entire NYC Council body joined by other NYC officials, honored AKTINA Productions, Inc., with a special Proclamation on the occasion of its 25th anniversary. The organization has also received multiple distinctions from other elected officials of the City of New York, the New York State and the U.S. Congress and Senate such as, Citations, Proclamations and Congressional Records. == References == Category:Cultural organizations Category:Organizations based in New York City",
 "title": "AKTINA Productions"
}