{
 "id": "1065664",
 "text": "Celeron is a discontinued series of 32-bit computer microprocessor models manufactured by Intel. The first Celeron was released on April 15, 1998. The Celeron was based off the Pentium II, and was targeted at cheaper PCs. Celerons usually, but not always, offer less power compared to Pentium, Core, and Xeon processors. Intel has sometimes disabled advanced features on their Celeron line due to its subpar performance. Because of its lack of features and powers, Intel uses this as its justification for the higher cost for its higher-end processors. == History == The Intel Celeron first came into existence when Intel was planning to win over the cheaper processor markets, which it had multiple competitors in, namely AMD. They were considering a faster Pentium MMX, the industry-standard Socket 7 platform hosted a market of competitor CPUs. This presented a problem, as Intel didn't want their processors to be easily replaced. Instead, they made the Intel Celeron using a different socket based off the Pentium II product, using the Pentium II's proprietary Slot 1 interface. On September 2022, Intel announced that the Celeron and Pentium would be discontinued and essentially merged into each- other into a CPU known as the \"Intel Processor\". It was also branded for low- end processors in desktops and laptops. It was scheduled to happen in 2023. In 2023, Intel discontinued the Intel Celeron and Pentium brands. However, it's worth nothing that both processors were slowly phased out. As of 2024, they have been fully phased out by Intel. == Etymology == The name Celeron came from the Latin word Celer which means swift, as in the word 'accelerate', and 'on' as in 'turned on'. Celeron is seven letters and three syllables, like Pentium. The name was decided by the same firm who invented the \"Pentium\" name, Lexicon Branding, to devise a name for the new product. Another likely reason they chose the name was because the 'Cel' of Celeron rhymes with 'tel' of Intel. == Dual-processor support == As a cheaper, more lower-end processor, the Celeron does not support a dual-processor configuration using multiple CPU sockets. However it has been discovered that multiprocessing could be enabled on certain processors by doing some modifications to the pins on the CPU on Slot 1 Celerons. The unofficial support, made possible by the modifications users did, were eventually removed in later generations of Celeron. After this removal, dual-socket support is now limited to Intel Xeon's brand of processors. Eventually, Celeron released multi-core chips, though they are still limited to one socket. ==References== Category:Intel processors",
 "title": "Celeron"
}