{
 "id": "1065473",
 "text": "Scott Colton (born May 6, 1980) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and competes under the ring name Colt Cabana. He also wrestles for their sister promotion Ring of Honor (ROH). He has also spent time wrestling in Wrestling Society X, World Wrestling Entertainment (WWE), Pro Wrestling Guerrilla (PWG), Chikara, and New Japan Pro-Wrestling (NJPW). ==Career== ===All Elite Wrestling=== During the Buy-In for Revolution, Cabana would make his debut in All Elite Wrestling (AEW). He would save SoCal Uncensored from a beatdown by The Dark Order. On March 1, 2020, it was announced that Cabana had signed a contract with the company. Cabana would make his AEW in-ring debut on the March 3 episode of Dynamite. He would team with SCU and they would defeat Dark Order. Cabana would enter the tournament to crown the first AEW TNT Champion. Cabana would lose in the first round to Lance Archer on the March 15 episode of Dynamite. At Double or Nothing, Cabana would compete in the Casino Ladder Match to try and earn a future match for the AEW World Championship but the match would be won by Brian Cage. The following Dynamite, Cabana would compete in a battle royal to determine who would become the number one contender for the AEW TNT Championship. The match would be won by Jungle Boy. On the June 3 and 10 episodes of Dynamite, Cabana would suffer losses to Chris Jericho and Sammy Guevara. After seeing his losing streak, Cabana would be approached by Mr. Brodie Lee and he would try and get Cabana to join his Dark Order stable. Cabana would then start teaming with Dark Order before officially joining them. On the November 2, 2022 episode of Dynamite, Cabana would challenge Chris Jericho for the ROH World Championship but would be defeated. == References == == Other websites == * Category:1980 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Former WWE wrestlers Category:Jewish sportspeople Category:Podcasters Category:Sportspeople from Illinois Category:Twitch (service) streamers",
 "title": "Colt Cabana"
}