{
 "id": "1065123",
 "text": "The Siddi, also called Sheedi, are a group of people living mainly in southern Pakistan, in the provinces of Sindh and Balochistan. They are one of two major Black ethnic groups in Pakistan, the other being Makranis. They originally come from the Bantu communities in Southeast Africa and Ethiopia. Many of them arrived in the subcontinent through the Indian Ocean Slave Trade, while others came as traders, sailors, servants, and soldiers. There are now more than a million Siddis in Pakistan and a smaller group of about 50,000 in India. Pakistan has the largest diaspora of Africans in South Asia. The Siddi population mostly has roots in the Bantu peoples of Southeast Africa who were brought to the Indo-Pak subcontinent as slaves. Most of them became Muslims, and a few became Christians. First Siddis are believed to have arrived in Sindh with the Arab army of Muhammad Bin Qasim during the Islamic conquest of the Sindh in 712 CE. They were known as Zanjis. == Culture & Religion == The Siddi people's culture reflects both their long presence in South Asia and their East African origins. Siddi women wear traditional African clothing, and Siddi men wear Shalwar kameez along with their unique clothing. While they have adapted to the local culture, they still practice some traditions, especially in music and dance. Siddis generally marry within their own communities, and it's uncommon for them to marry outside. Sports play a significant role in the Siddi community, providing youth with opportunities and an escape from poverty and discrimination. Many Siddis follow the Islamic faith, with a particular reverence for the Sindhi saint Pir Mangho. An annual festival, known as Pir Mangho Urs, is held at the saint's shrine, where 100 crocodiles are fed as part of the celebration. == References == == Other websites == * Tanzeela Qambrani \"The two largest communities of people of African descent in Pakistan\", Ohchr.org. * The Sidi Project The African Diaspora in Pakistan American Pakistan Foundation, 21 Sept 2020. * Alice Albinia, Empires of the Indus, W. W. Norton & Company, 2010, 52–78. * Shanti Sadiq Ali, The African Dispersal in the Deccan: From Medieval to Modern Times, Orient Blackswan, 1996. * Shihan de Silva Jayasuriya, \"South Asia's Africans: A Forgotten People\", History Workshop, 5 February 2011. * Lord of All He Surveys, The Express Travel Category:Ethnic groups in Pakistan",
 "title": "Siddi people"
}