{
 "id": "1065990",
 "text": "AEW Fight for the Fallen is series of professional wrestling shows made by All Elite Wrestling (AEW). The event started in 2019 and is usually held in the Summer. The name \"Fight for the Fallen\" is a reference to the first charity that the event helped which supported victims of gun violence. The first event streamed live for free on B/R Live in North America and aired on pay-per-view (PPV) internationally. Starting in 2020, the events aired as special episodes of AEW's television shows Dynamite, Rampage, and Collision. Every event that is held raises money for either the charity or cause that is chosen. ==Dates and venues== Event Date City Venue Main event Charity or cause Fight for the Fallen (2019) July 13, 2019 Jacksonville, Florida Daily's Place The Brotherhood (Cody and Dustin Rhodes) vs. The Young Bucks (Matt and Nick Jackson). Victims of gun violence Fight for the Fallen (2020) Dynamite: July 15, 2020 Jon Moxley (c) vs. Brian Cage for the AEW World Championship. COVID-19 relief Fight for the Fallen (2021) Dynamite: July 28, 2021 Charlotte, North Carolina Bojangles Coliseum \"The Painmaker\" Chris Jericho vs. Nick Gage in a No Rules match. Victims of domestic violence and sexual assault survivors Fight for the Fallen (2022) Night 1: Dynamite – July 27, 2022 Worcester, Massachusetts DCU Center Bryan Danielson vs. Daniel Garcia Marine life and oceans around the world Night 2: Rampage – July 27, 2022 Anna Jay vs. Ruby Soho Fight for the Fallen (2023) Night 1: Dynamite – August 16, 2023 Nashville, Tennessee Bridgestone Arena The Young Bucks (Matt and Nick Jackson) vs. The Gunns (Austin and Colten Gunn) Maui Food Bank due to the 2023 Hawaii wildfires Night 2: Rampage – August 16, 2023 Hikaru Shida and Skye Blue vs. The Outcasts (Ruby Soho and Toni Storm) Night 3: Collison – August 19, 2023 Lexington, Kentucky Rupp Arena Darby Allin vs. Christian Cage Fight for the Fallen (2025) Dynamite: January 1, 2025 Asheville, North Carolina Harrah's Cherokee Center TBA Victims of Hurricane Helene == References == Category:AEW Fight for the Fallen Category:2019 establishments in the United States",
 "title": "AEW Fight for the Fallen"
}