{
 "id": "1065417",
 "text": "An antique (; 'old', 'ancient') is an item thought of as having value because of its looks or historical importance, and often defined as at least 100 years old (or an older limit), but the term may be used to describe anything that is old. An antique is usually an item that is collected or wanted because of its age, beauty, rarity, condition, job, personal emotional connection, and/or other unique features. It is an object that represents a previous era or time period in human history. Vintage and collectible are used to describe items that are old but do not meet the 100-year mark. Antiques are normally objects of the decorative arts that show some skill of craftsmanship, collectability, or an attention to design, such as a desk or an early car. They are bought at antiques shops, estate sales, auction houses, online auctions, and other venues, or is passed down. Antiques sellers often are a member of national trade associations, many of which belong to CINOA, a confederation of art and antique associations across 21 countries that represents 5,000 sellers. == Definition == The usual definition of antique is a collectible object such as a piece of furniture or work of art that has more value because of its age, but it may be different depending on the item, its source, the year of its creation, and other reasons. The customary definition of antique requires that an item should be at least 100 years old and in original condition.Atlantic. (1984). United Kingdom: American Chamber of Commerce (United Kingdom)|date=August 2020 (Motor vehicles are an exception to this rule, with some definitions needing an automobile to be as little as 25 years old to be called an antique.) In the United States, the 1930 Smoot-Hawley Tariff Act defined antiques as, \"...works (things that are created) of art (except rugs and carpets made after 1700), collections in illustration of the progress of the arts, works in bronze, marble, terra cotta, parian, pottery, or porcelain, artistic antiquities and objects of ornamental character or educational value which shall have been produced prior to the year 1830.\" 1830 was thought to be the beginning of mass production in the United States. These definitions were made to allow people of that time to tell between real antique pieces, vintage items, and collectible objects. In 1979, the British art reviewer Edward Lucie-Smith wrote that \"Antique-dealers ... sometimes insist that nothing is antique which was made after 1830, although the barrier has been broken down in recent years by the enthusiasm of collectors for Art Nouveau and Art Deco.Lucie-Smith, Edward, A Concise History of Furniture, p. 13, 1979, Thames & Hudson, World of Art series The other term, antiquities, is used to refer to the remains of ancient art and everyday items from antiquity, which themselves are often archaeological artifacts. An antiquarian is a person who collects and studies antiquities or things of the past. === China === Traditionally, Chinese antiques are marked by a red seal, known as a 'chop', put on by an owner. Experts can tell previous owners of an antique by reading the chops. The pre-revolution Chinese government tried to help collectors of Chinese antiques by requiring their Department of Antiquities to give a governmental chop on the bottom of a Chinese antique. This chop is visible as a piece of red sealing wax that bears the government chop to verify the date of the antique. The government of the People's Republic of China has its own definitions of what it thinks is antique\". As of the Cultural Revolution and China's opening trade to other countries, the government has tried to protect the definition of a Chinese antique. == Antiquing == Antiquing is the act of buying, telling if an antique is real, lowering prices, or buying antiques for cheap. People buy items for personal use, gifts, or to sell again. Sources for antiquing include garage sales and yard sales, estate sales, resort towns, antique districts, collectives, and international auction houses. Note that antiquing also means the craft of making an object look antique through distressing or using antique-looking paints. Often, individuals get confused between these handmade vintage items and true antiques. People who are going to sell antiques and who don't know of the differences may find themselves paying a big amount of money for something that would have little value if re- sold. == Furniture == Antique furniture is a popular area of antiques because furniture has can be used and has value. Many collectors use antique furniture pieces in their homes, and care for them with the hope that the value of these items will remain same or grow. This is different to buying new furniture, which typically decreases the value right after it is purchased. Antique furniture includes dining tables, chairs, bureaus, chests etc. The most common woods are mahogany, oak, pine, walnut, and rosewood. Chinese antique furniture is often made with elm, a wood common to many regions in Asia. Each wood has a different grain and color. Many modern pieces of furniture use laminate or wood veneer to get the same effect. There are many different styles of antique furniture depending on when and where it was made. Some examples of stylistic periods are: Arts & Crafts, Georgian, Regency, and Victorian. An important part of some antique furniture is its hardware, the style of which is different from one period to another. For example, Victorian era hardware is different from other period hardware and is thought of to be aesthetically defined; this is the reason for its popularity. == Related pages == * Authentication * Relic == References == Category:Collecting",
 "title": "Antique"
}