{
 "id": "1065765",
 "text": "The United Democratic Party (UDP) is one of the two major political parties in Belize. It is currently the main opposition party. It lost the 2020 Belizean general election, after previously holding the government for three terms. Founded as a centre-right conservative party, the UDP is led by Shyne Barrow. The party had been in power since 7 February 2008. It attempted to win a fourth consecutive general election. UDP Leader and Prime Minister, Dean Barrow stated he would step down from both positions on 2 November 2020, after the new Prime Minister of Belize has been officially sworn-in by Govonor- General, Colville Young. The UDP scheduled a May 2019 convention and election, but after Barrow’s cabinet urged him to stay on as Prime Minister and Leader of the UDP, he pushed back that date in January 2019 to February 2020. On 10 August 2019, The UDP’s National Party Council met and set the date of the UDP’s leadership convention and election on 9 February 2019. The venue will be at the Belize Civic Centre, according to the party organ, The Guardian. Deputy Prime Minister of Belize, Patrick Faber and Minister of National Security and Defence, John Saldivar contested the position of UDP Leader. Minister of Health, Pablo Marin contested the position of Deputy Leader. Minister of Natural Resources, Hugo Patt also contested for Deputy Leader. Patt and Minister of Foreign Affairs, Wilfred Elrington were mentioned as possible candidates to contest the position of UDP Leader. However, both declined in June 2018. On 5 June 2019, Belize Breaking News (BBN) published an article stating that the UDP has a high chance of capitalising and making history by wining a fourth consecutive term come 2020, given the results of the 2019 Belizean territorial dispute referendum went in the favour of the UDP. The UDP was long campaigning for an “Yes” vote to bring Guatemala’s claim to the International Court of Justice (ICJ), while the PUP eyed the “No” vote while some of its Politicians still supported “Yes” as they thought that was the right thing to do. A victory in the next election would be monumental as the party navigates new Leadership with the departure of several senior members. The UDP Cabinet, though marred by waves of scandal and revelations of systemic corruption across Government departments throughout its 11-year reign, has withered the political storms. ==References== Category:1973 establishments in North America Category:Establishments in Belize Category:Political parties in North America Category:Politics of Belize",
 "title": "United Democratic Party (Belize)"
}