{
 "id": "1066161",
 "text": "George Formby OBE (born in Wigan, real name George Hoy Booth; 26 May 1904 – 6 March 1961) was an English actor, singer-songwriter and comedian. His films of the 1930s and 1940s were very popular. On stage, screen and record he sang light, comic songs. He played the ukulele or banjolele. He was the highest- paid entertainer in the United Kingdom. His father was George Formby Sr, who was also a comedian and singer. He was called \"The Wigan Nightingale\". He died when his son was 17. Formby went on the music hall stage when his father died. He carried on his father's act. In 1924 he married Beryl Ingham. She was also in music hall and she became his manager. He started recording songs in 1926 and, from 1934, he made movies. In the movies he played gormless Lancastrian innocents who would beat a villain, and win the love of an attractive middle-class girl. His songs often had ambiguous sexual content which he sung with a toothy grin and air of innocence His song When I'm Cleaning Windows was banned by the BBC in 1936. The director general John Reith said \"if the public wants to listen to Formby singing his disgusting little ditty, they'll have to be content to hear it in the cinemas, not over the nation's airwaves\". He later sang it before the King and Queen at the Royal Variety Performance. It was unbanned. During the Second World War he worked all over the world for the Entertainments National Service Association. In his first film of 1940, Let George Do It!, In a dream he goes to a Nuremberg Rally and punches Hitler. It was very popular and was shown in Russia and the USA. He recorded more than 200 songs. 1946 song \"With My Little Stick of Blackpool Rock\" was one of the most successful. It was also considered rude and a BBC manager in 1946 said \"We have no record that 'With My Little Stick of Blackpool Rock' is banned. We do however know, and so does Formby, that certain lines in the lyric must not be broadcast\". ==References== Category:1904 births Category:1961 deaths Category:Actors from Greater Manchester Category:Actors from Lancashire Category:English singer- songwriters Category:Comedians from Lancashire Category:People from Wigan",
 "title": "George Formby"
}