{
 "id": "1066062",
 "text": "Kioisaka Incident (紀尾井坂の変, Kioizakanohen), took place on May 14, 1878 when Ōkubo Toshimichi, Lord of Home Affairs of Japan and one of the Three Great Nobles of the Restoration (alongside Saigō Takamori and Kido Takayoshi), was assassinated by six ex-samurai assassins who are armed with katanas. To be exact, the assassination site was not located at Kioisaka, but near Sakashita (in front of present-day Shimizudani Park). This events are known as the Kioicho Incident (紀尾井町事件, Kioichō jiken), Kioizaka Incident (紀尾井坂事件, Kioi-zaka jiken), and Assassination of Okubo Toshimichi (大久保利通暗殺事件, Okubo toshimichi ansatsu jiken). == Background == The perpetrators involved in the incidents were Shimada Ichirō (aged 30), Chō Tsurahide (aged 22), Sugimoto Otogiku (aged 29), Wakita Kōichi (aged 28), and Sugimura Bun'ichi (aged 17), and Asai Toshiatsu (aged 24), a samurai from Shimane Prefecture while five others from the former Kaga Domain. (Asai quit the samurai clan and became a commoner after the trial.). Among them, Shimada is the leader of the assassination group. Shimada participated in the First Choshu Expedition and the Boshin War as an ashigaru of the Kaga Domain, and continued his military career even after the formation of the Meiji Restoration, but he sympathized with the idea of conquering Korea (also known as Seikanron debate), and during the Incident of 1873. Enraged by Takamori Saigo's resignation, Shimada devoted himself to national affairs. Sugimura Hiromasa (Sugimura Bun'ichi's older brother) and other samurais also expressed their desire to serve in the newly formed Imperial Japanese Army in response to the idea of conquering Korea. Furthermore, regarding the dispatch of troops to Taiwan as part of the expedition in 1874, Sugimura, Cho, and many radicals once again requested to serve in the military, and Sugimura (Hiroshi), Shimada, and later Asai wrote a petition opposing the rumor that Japanese troop dispatch to Taiwan had been canceled and a petition criticizing the handling of the Saga Rebellion. Sugimura and Shimada, who drafts the warrant, is listed as one of the names. However, these white papers did not have the expected effect, and Shimada and others decided to use force. In 1874, Shimada and Cho met in Tokyo and hit it off. In June 1874, Cho traveled to Kagoshima with Sugimura to hear the news of Takamori Saigo and Kirino Toshiaki regarding the dispatch of marines to Taiwan. They have been staying in Kagoshima for about half a year, studying at a private school. They also moved back to Kagoshima in 1876, where they maintained old friendships with Kirino and other samurais. In October, when Nagoya became a prefecture, numerous rebellions and uprisings (known as the Shizoku Rebellion) occurred one after another all across Japan, including the Shinpūren Rebellion, Akizuki Rebellion, and Hagi Rebellion, and Shimada also worked hard to create an army in Kanazawa, but failed due to lack of equipment and morale. Furthermore, during the Satsuma Rebellion in 1877, Shimada and Cho worked together to make plans to raise an army, but while they were struggling to convince those around them, government troops entered Kumamoto Castle in April. After receiving information that the outcome was decided, the plan was canceled. After this, Shimada and his group changed their policy to assassinate high-ranking officials. Sugimoto, Wakita, Sugimura, and others also joined Shimada's plan during this period. Wakita moved to Tokyo in October, Cho in November, Sugimura in December, and Shimada and Sugimoto in April of the following year. Asai, the only samurai from the Shimane Prefecture, was a police officer in the Tokyo Metropolitan Police Department during the Satsuma Rebellion and served in the police squad. He returned to Tokyo in triumph in August 1877, but he violated the ban and died in 1878. His position was dismissed from his post in February, and in March, Asai learned of the assassination plan by Shimada and others and joined the conspiracy. Their assassination plan went through multiple plots, and even reached the ears of the police chief at the time, Superintendent Kawaji Toshiyoshi, but Kawaji did not respond, asking, ``What can I do to the people of Ishikawa Prefecture? (石川県人に何ができるか, Ishikawa kenjin ni nanigadekiruka). Furthermore, General Tomonosuke Takashima has said the same thing, but as evidence: ``Immediately after the incident, Kawaji flew to the scene, took out his notebook and pointed out the names of the people, and said that it must have been the work of these six people. ,\" he said, slapping his notebook with tears streaming down his face.\" The day after Okubo's funeral, Kawaji filed a request for ``Okubo Councilor Change and Resignation Request (大久保参議事変ニ付進退伺, Ōkubo sangi jihen ni-tsuki shintaiukagai), which was rejected. == Criminal List == The weapons that Shimada and others brought with them at the time of Okubo's assassination was given by Cho in late April 1878 at the request of Shimada. The article lists the following five crimes as crimes of dictatorship. * It has not established a parliament or a constitution, and is suppressing civil rights. * Laws and regulations are frequently revised, and favoritism and connections are used in the appointment of government officials. * Category:Assassinated Japanese politicians Category:1878",
 "title": "Kioisaka Incident"
}