{
 "id": "1066327",
 "text": "This is a list of people who served as the second spouse of the United States. ==List of second ladies and gentlemen of the United States== Image Second Lady or Gentleman Vice President Tenure Date of birth Date of death (age) Adams, Abigail Abigail Adams (née Abigail Smith) Adams, John John Adams April 21, 1789 – March 4, 1797 (1818-10-28) () 01.1 Vacant; Jefferson, Thomas Thomas Jefferson was a widower. 01.1 Vacant; Jefferson, Thomas Thomas Jefferson was a widower. 01.1 Vacant; Jefferson, Thomas Thomas Jefferson was a widower. March 4, 1797 – March 4, 1801 01.2 Vacant; Aaron Burr was a widower. 01.2 Vacant; Aaron Burr was a widower. 01.2 Vacant; Aaron Burr was a widower. March 4, 1801 – March 4, 1805 01.3 Vacant; George Clinton was a widower. 01.3 Vacant; George Clinton was a widower. 01.3 Vacant; George Clinton was a widower. March 4, 1805 – April 20, 1812 01.4 Vacant; no vice president after Clinton's death. 01.4 Vacant; no vice president after Clinton's death. 01.4 Vacant; no vice president after Clinton's death. April 20, 1812 – March 4, 1813 Gerry, Ann Ann Gerry (née Ann Thompson) Gerry, Elbridge Elbridge Gerry March 4, 1813 – November 23, 1814 (1849-03-17) 02.1 Vacant; no vice president after Gerry's death. 02.1 Vacant; no vice president after Gerry's death. 02.1 Vacant; no vice president after Gerry's death. November 23, 1814 – March 4, 1817 Tompkins, Hannah Hannah Tompkins (née Hannah Minthorne) Tompkins, Daniel D Daniel D Tompkins March 4, 1817 – March 4, 1825 (1829-02-18) Calhoun, Floride Floride Bonneau Calhoun (née Floride Bonneau Colhoun) Calhoun, John C. John C. Calhoun March 4, 1825 – December 28, 1832 (1866-07-25) 04.1 Vacant; no vice president after Calhoun's resignation. 04.1 Vacant; no vice president after Calhoun's resignation. 04.1 Vacant; no vice president after Calhoun's resignation. December 28, 1832 – March 4, 1833 04.2 Vacant; Buren, Martin Van Martin Van Buren was a widower. 04.2 Vacant; Buren, Martin Van Martin Van Buren was a widower. 04.2 Vacant; Buren, Martin Van Martin Van Buren was a widower. March 4, 1833 – March 4, 1837 04.3 Vacant; Johnson, Richard Mentor Richard M. Johnson was a widower 04.3 Vacant; Johnson, Richard Mentor Richard M. Johnson was a widower 04.3 Vacant; Johnson, Richard Mentor Richard M. Johnson was a widower March 4, 1837 – March 4, 1841 Tyler, Letitia Christian Letitia Tyler (née Letitia Christian) Tyler, John John Tyler March 4, 1841 – April 4, 1841 (1842-09-12) 05.1 Vacant; no vice president after Tyler assumed presidency. 05.1 Vacant; no vice president after Tyler assumed presidency. 05.1 Vacant; no vice president after Tyler assumed presidency. April 4, 1841 – March 4, 1845 Dallas, Sophia Sophia Dallas (née Sophia Chew Nicklin) Dallas, George M. George M. Dallas March 4, 1845 – March 4, 1849 (1869-01-11) Fillmore, Abigail Abigail Fillmore (née Abigail Powers) Fillmore, Millard Millard Fillmore March 4, 1849 – July 9, 1850 (1853-03-30) 07.1 Vacant; no vice president after Fillmore assumed presidency. 07.1 Vacant; no vice president after Fillmore assumed presidency. 07.1 Vacant; no vice president after Fillmore assumed presidency. July 9, 1850 – March 4, 1853 Vacant; William R. King was unmarried. Vacant; William R. King was unmarried. Vacant; William R. King was unmarried. March 4, 1853 – April 18, 1853 02.1 Vacant; no vice president after King’s death. 02.1 Vacant; no vice president after King’s death. 02.1 Vacant; no vice president after King’s death. April 18, 1853 – March 4, 1857 Breckinridge, Mary Cyrene Burch Mary Cyrene Burch Breckinridge (née Mary Cyrene Burch) Breckinridge, John C. John C. Breckinridge March 4, 1857 – March 4, 1861 (1907-10-08) Hamlin, Ellen Ellen Hamlin (née Ellen Vesta Emery) Hamlin, Hannibal Hannibal Hamlin March 4, 1861 – March 4, 1865 (1925-02-01) Johnson, Eliza Eliza McCardle Johnson (née Eliza McCardle) Johnson, Andrew Andrew Johnson March 4, 1865 – April 15, 1865 (1876-01-15) 10.1 Vacant; no vice president after Johnson assumed presidency. 10.1 Vacant; no vice president after Johnson assumed presidency. 10.1 Vacant; no vice president after Johnson assumed presidency. April 15, 1865 – March 4, 1869 Colfax, Ellen Maria Ellen Maria Colfax (née Ellen Maria Wade) Colfax, Schuyler Schuyler Colfax March 4, 1869 – March 4, 1873 (1911-03-04) Vacant; Henry Wilson was a widower. Vacant; Henry Wilson was a widower. Vacant; Henry Wilson was a widower. March 4, 1873 – November 22, 1875 11.3 Vacant; Wheeler, William A. William A. Wheeler was a widower. 11.3 Vacant; Wheeler, William A. William A. Wheeler was a widower. 11.3 Vacant; Wheeler, William A. William A. Wheeler was a widower. March 4, 1877 – March 4, 1881 11.4 Vacant; Arthur, Chester A. Chester A. Arthur was a widower. 11.4 Vacant; Arthur, Chester A. Chester A. Arthur was a widower. 11.4 Vacant; Arthur, Chester A. Chester A. Arthur was a widower. March 4, 1881 – September 19, 1881 11.5 Vacant; no vice president after Arthur assumed presidency. 11.5 Vacant; no vice president after Arthur assumed presidency. 11.5 Vacant; no vice president after Arthur assumed presidency. September 19, 1881 – March 4, 1885 Hendricks, Eliza Eliza Hendricks (née Eliza Carol Morgan) Hendricks, Thomas A. Thomas A. Hendricks March 4, 1885 – November 25, 1885 (1903-01-03) 12.1 Vacant; no vice president after Hendricks's death. 12.1 Vacant; no vice president after Hendricks's death. 12.1 Vacant; no vice president after Hendricks's death. November 25, 1885 – March 4, 1889 Morton, Anna Anna Morton (née Anna Livingston Reade Street) Morton, Levi P. Levi P. Morton March 4, 1889 – March 4, 1893 (1918-08-14) Stevenson, Letitia Letitia Stevenson (née Letitia Green) Stevenson, Adlai I Adlai Stevenson I March 4, 1893 – March 4, 1897 (1913-12-25) Hobart, Jennie Esther Jane \"Jennie\" Tuttle Hobart (née Esther Jane Tuttle) Hobart, Garret Garret Hobart March 4, 1897 – November 21, 1899 (1941-01-08) 15.1 Vacant; no vice president after Hobart's death. 15.1 Vacant; no vice president after Hobart's death. 15.1 Vacant; no vice president after Hobart's death. November 21, 1899 – March 4, 1901 Roosevelt, Edith Edith Roosevelt (née Edith Kermit Carow) Roosevelt, Theodore Theodore Roosevelt March 4, 1901 – September 14, 1901 (1948-09-30) 16.1 Vacant; no vice president after Roosevelt assumed presidency. 16.1 Vacant; no vice president after Roosevelt assumed presidency. 16.1 Vacant; no vice president after Roosevelt assumed presidency. September 14, 1901 – March 4, 1905 Fairbanks, Cornelia Cornelia \"Nellie\" Cole Fairbanks (née Cornelia Cole) Fairbanks, Charles W. Charles W. Fairbanks March 4, 1905 – March 4, 1909 (1913-10-24) Sherman, Carrie Carrie Babcock Sherman (née Carrie Babcock) Sherman, James S. James S. Sherman March 4, 1909 – October 30, 1912 (1931-10-06) 18.1 Vacant; no vice president after Sherman's death. 18.1 Vacant; no vice president after Sherman's death. 18.1 Vacant; no vice president after Sherman's death. October 30, 1912 – March 4, 1913 Marshall, Lois Irene Lois Irene Marshall (née Lois Irene Kimsey) Marshall, Thomas R. Thomas R. Marshall March 4, 1913 – March 4, 1921 (1958-01-06) Coolidge, Grace Grace Coolidge (née Grace Anna Goodhue) Coolidge, Calvin Calvin Coolidge March 4, 1921 – August 2, 1923 (1957-07-08) 20.1 Vacant; no vice president after Coolidge assumed presidency. 20.1 Vacant; no vice president after Coolidge assumed presidency. 20.1 Vacant; no vice president after Coolidge assumed presidency. August 2, 1923 – March 4, 1925 Dawes, Caro Caro Dawes (née Caro Dana Blymyer) Dawes, Charles G. Charles G. Dawes March 4, 1925 – March 4, 1929 (1957-10-03) 21.1 Vacant; Curtis, Charles Charles Curtis was a widower. 21.1 Vacant; Curtis, Charles Charles Curtis was a widower. 21.1 Vacant; Curtis, Charles Charles Curtis was a widower. March 4, 1929 – March 4, 1933 Garner, Mariette Mariette Elizabeth \"Ettie\" Garner (née Mariette Elizabeth Rheiner) Garner, John Nance John Nance Garner March 4, 1933 – January 20, 1941 (1948-08-17) Wallace, Ilo Ilo Wallace (née Ilo Browne) Wallace, Henry A. Henry A. Wallace January 20, 1941 – January 20, 1945 (1981-02-22) Truman, Bess Bess Truman (née Elizabeth Virginia Wallace) Truman, Harry S. Harry S. Truman January 20, 1945 – April 12, 1945 (1982-10-18) 24.1 Vacant; no vice president after Truman assumed presidency. 24.1 Vacant; no vice president after Truman assumed presidency. 24.1 Vacant; no vice president after Truman assumed presidency. April 12, 1945 – January 20, 1949 24.2 Vacant; Barkley, Alben W. Alben W. Barkley was a widower. 24.2 Vacant; Barkley, Alben W. Alben W. Barkley was a widower. 24.2 Vacant; Barkley, Alben W. Alben W. Barkley was a widower. January 20, 1949 – November 18, 1949 Barkley, Jane Hadley Jane Hadley Barkley (née Elizabeth Jane Rucker) Barkley, Alben W. Alben W. Barkley November 18, 1949 – January 20, 1953 (1964-09-06) Nixon, Pat Pat Nixon (née Thelma Catherine Ryan) Nixon, Richard Richard Nixon January 20, 1953 – January 20, 1961 (1993-06-22) Johnson, Lady Bird Claudia \"Lady Bird\" Johnson (née Claudia Alta Taylor) Johnson, Lyndon B. Lyndon B. Johnson January 20, 1961 – November 22, 1963 (2007-07-11) 27.1 Vacant; no vice president after Johnson assumed presidency. 27.1 Vacant; no vice president after Johnson assumed presidency. 27.1 Vacant; no vice president after Johnson assumed presidency. November 22, 1963 – January 20, 1965 Humphrey, Muriel Muriel Humphrey Brown (née Muriel Fay Buck) Humphrey, Hubert Hubert Humphrey January 20, 1965 – January 20, 1969 (1998-09-20) Agnew, Judy Elinor \"Judy\" Agnew (née Elinor Isabel Judefind) Agnew, Spiro Spiro Agnew January 20, 1969 – October 10, 1973 (2012-06-20) 30.1 Vacant; no vice president until Ford's confirmation under the 25th Amendment. 30.1 Vacant; no vice president until Ford's confirmation under the 25th Amendment. 30.1 Vacant; no vice president until Ford's confirmation under the 25th Amendment. October 10, 1973 – December 6, 1973 Ford, Betty Elizabeth \"Betty\" Ford (née Elizabeth Anne Bloomer) Ford, Gerald Gerald Ford December 6, 1973 – August 9, 1974 (2011-07-08) 30.1 Vacant; no vice president until Rockefeller's confirmation under the 25th Amendment. 30.1 Vacant; no vice president until Rockefeller's confirmation under the 25th Amendment. 30.1 Vacant; no vice president until Rockefeller's confirmation under the 25th Amendment. August 9, 1974 – December 19, 1974 Rockefeller, Happy Margaretta \"Happy\" Rockefeller (née Margaretta Large Fitler) Rockefeller, Nelson Nelson Rockefeller December 19, 1974 – January 20, 1977 (2015-05-19) Mondale, Joan Joan Mondale (née Joan Adams) Mondale, Walter Walter Mondale January 20, 1977 – January 20, 1981 (2014-02-03) Bush, Barbara Barbara Bush (née Barbara Pierce) Bush, George H. W. George H. W. Bush January 20, 1981 – January 20, 1989 (2018-04-17) Quayle, Marilyn Marilyn Quayle (née Marilyn Tucker) Quayle, Dan Dan Quayle January 20, 1989 – January 20, 1993 \\-- Living Gore, Tipper Mary Elizabeth \"Tipper\" Gore (née Mary Elizabeth Aitcheson) Gore, Al Al Gore January 20, 1993 – January 20, 2001 \\-- Living Cheney, Lynne Lynne Cheney (née Lynne Ann Vincent) Cheney, Dick Dick Cheney January 20, 2001 – January 20, 2009 \\-- Living Biden, Jill Jill Biden (née Jill Tracy Jacobs) Biden, Joe Joe Biden January 20, 2009 – January 20, 2017 \\-- Living Pence, KarenKaren Pence (née Karen Sue Batten) Pence, MikeMike Pence January 20, 2017 – January 20, 2021 \\--Living Emhoff, DouglasDouglas Craig Emhoff Harris, KamalaKamala Harris January 20, 2021 – January 20, 2025 \\--Living Vance, UshaUsha Vance (née Usha Bala Chilukuri) Vance, JDJD Vance January 20, 2025 – Present \\--Living == List of living former second spouses == == Related pages == * List of first ladies of the United States * List of vice presidents of the United States * List of presidents of the United States == References == == Notes == Category:Second Spouses of the United States Category:Second Ladies of the United States",
 "title": "List of second ladies and gentlemen of the United States"
}