{
 "id": "106611",
 "text": "The blockade of Germany was part of the First Battle of the Atlantic between the United Kingdom and Germany during World War I. The British established a naval blockade of Germany early in the war. As was shown later in the Battle of Jutland, the German fleet could not defeat the British fleet to break the blockade. The blockade was unusually restrictive in that even food was stopped, as it was said to help the war. The Germans regarded that as an attempt to starve the German people into submission. They wanted to fight back and so blockaded Britain and France. As Germany could not fight with the huge British Royal Navy on an even basis, the only possible way for Germany to impose a blockade on Britain was through the submarines. The Chancellor of Germany was against that sort of blockade because it meant attacking neutral ships, such as those of the United States, as well. However, the military pushed unlimited submarine warfare forward. On 4 February 1915, Kaiser Wilhelm II of Germany declared the seas around the British Isles a war zone. Effective 18 February, Allied ships in the area would be sunk without warning. British ships hiding behind neutral flags would not be spared, but some effort would be made to avoid sinking clearly-neutral vessels. Up to 750,000\"Die miserable Versorgung mit Lebensmitteln erreichte 1916/17 im \"Kohlrübenwinter” einen dramatischen Höhepunkt. Während des Ersten Weltkriegs starben in Deutschland rund 750.000 Menschen an Unterernäherung und an deren Folgen.\" Lebensmittelversorgung in:Lebendiges Museum online An academic study done in 1928 put the death toll at 424,000. (Grebler, Leo (1940). The Cost of the World War to Germany and Austria–Hungary. Yale University Press. 1940 Page78) civilians may have died because of starvation caused by the blockade during the war. Many more would die from starvation after the armistice in November 1918, as the blockade was continued into 1919 to force Germany to sign the Treaty of Versailles in June 1919. == Fighting == The German U-boat force was primarily based at Ostend, Belgium so that German submarines had better access to the sea lanes around England. The Germans made use of the advantage and sent out about 20 U-boats to begin the naval blockade. In January, before the declaration of \"unrestricted submarine warfare\", as the submarine blockade was called, 43,550 tonnes of shipping had been sunk by U-boats. The number of sinkings then steadily increased, with 168,200 tonnes going down in August. Losses of British warships were small. Although the battleship Formidable had been sunk by U-24 on New Year's Day, the fast destroyer screens soon made successful attacks on battleships and cruisers a thing of the past. On the other hand, there was little a Royal Navy warship could do to sink a U-boat if the submarine's captain was reasonably alert. The U-boat was generally safe from shelling once it had submerged. It could be rammed if it were at periscope depth, but ramming was hardly a reasonable tactic as a standard practice. Destroyers could not hunt the U-boats as they were protecting the fleet and so the British pressed every vessel they could into service, including yachts and trawlers, as auxiliary patrol vessels. However, the U-boats easily evaded the patrols and sank merchant vessels traveling unescorted. Militarily, unrestricted submarine warfare proved to be a great success, and the U-boats stood a good chance of starving Britain into surrender. However, in terms of the propaganda war, it was a great disaster for Germany. The Americans wanted to stay out of the European war, but public opinion turned against Germany, as unrestricted submarine warfare seemed to confirm the German reputation for brutality. The deaths of American citizens travelling on British vessels that were torpedoed by U-boats began to make headlines in the US. On 7 May 1915, the British liner RMS Lusitania was sunk by a German submarine, American outrage brought the the country closer to declaring war on Germany. Under threat of US retaliation, on 27 August, the Kaiser imposed severe restrictions on U-boats attacks against large passenger vessels. On 18 September, he called off unrestricted submarine warfare completely. Under military pressure on Germany early in 1917, the Kaiser declared full unrestricted submarine warfare once more. Some German diplomats believed that the Americans would avoid war at all costs, and if not, germany could hopefully Germany bring Britain to its knees before American power made much difference in Europe. In February, 86 vessels were sunk, followed by 103 in March and then 155 in April. The US finally declared war on Germany in April 1917 after the Zimmermann Telegram. The Americans and the British together later defeated the U-boats. == References == Category:World War I Germany",
 "title": "Blockade of Germany"
}