{
 "id": "1066937",
 "text": "Brooke Ashley Wiederhorn (née Brinson; born February 21, 1986) is an American television personality. She is best known as the only daughter of Monty Brinson and Kim Richards, and for appearing on the Bravo reality television series The Real Housewives of Beverly Hills. == Early life == Brooke Ashley Brinson was born in El Centro, California on February 21, 1986. She is the only child of Monty Brinson, a supermarket-franchise heir, and Kim Richards, an actress. She has three maternal half-siblings; Whitney Davis, Chad Davis, and Kimberly Jackson. Brinson also has two paternal half-siblings. === Family === Brinson's cousins through her aunt Kyle Richards are; Farrah Brittany, Alexia Umansky, Sophia Umansky, and Portia Umansky. She is also related to the Hilton family, through her aunt Kathy Hilton's marriage to uncle Richard Hilton; her cousins are Paris Hilton, Nicky Hilton, Barron Hilton II, and Conrad Hilton III. Her maternal grandparents were Ken Richards, a former lieutenant colonel, and Kathleen Richards, a casting director. == Career == Brinson made her television debut in October 2010, on the Bravo reality television series The Real Housewives of Beverly Hills. She made her final appearance in 2014. == Personal life == Brinson got engaged to her longtime boyfriend Thayer Wiederhorn, the son of businessman Andrew Wiederhorn, on December 25, 2013. The couple married on August 2, 2014. The couple had a second wedding to celebrate their nuptials in Cabo San Lucas, Mexico on May 23, 2015. They have three children together; sons Hucksley Andrew (born September 2016) and Hunter Montgomery (born April 2019), and daughter Sawyer Brinson (born December 2022). On February 19, 2022, the Los Angeles Times reported that Brinson's home had been raided by federal agents in the months prior as part of a criminal probe of her father-in-law. == Filmography == Year Title Notes Ref. 2010–2014 The Real Housewives of Beverly Hills 19 episodes 2011 The World According to Paris 3 episodes 2015 Dr. Phil 1 episode == References == Category:1986 births Category:Living people",
 "title": "Brooke Brinson"
}