{
 "id": "1066061",
 "text": "Central City is a fictional city appearing in American comic books published by DC Comics. It is the former home of Barry Allen, the second Flash. Its location has been variously stated to be in Ohio, Illinois, and Florida. During the Wally West era, it was shown to be in Missouri, across a river from Keystone City. == History == Central City, located across the Missouri River from Keystone City, Kansas, was founded in the 19th century and became an important stop for cattle drives. It began to see tremendous growth after the completion of the Transcontinental Railroad, becoming the first major hub west of Chicago. A second period of growth occurred after World War I, and it has burgeoned to the present day. In the 25th Century, the city became known as the Central Cityplex. == Points of interest == * Brookfield Heights - trendy residential area * Chubbuck - residential area and home to Central City Hospital * City Center - downtown area and home to the Flash Museum * Danville - middle class residential area and home to Barry and Iris Allen * Englewood - residential area with scenic views of nearby Granite Peak National Park * Lawrence Hills - industrial area * Leawood - blue-collar residential area and home to Central City Stadium * Mounds View - home to Hardwell Fields, the city's airport, and named after many Native American burial mounds in the area * New Brighton - residential and commercial area, home to the Central City Rail Station * Petersburg - home to many of Central City's excellent restaurants * University Town - home to Central City University * Utopia Towers - apartment complex in Central City * Westminster - formerly home to stockyards, now the location of S.T.A.R. Labs * Windsor Heights - very exclusive residential area * Ivo Laboratories - research organization founded by a scientist named Anthony Ivo == Residents == Heroes * Flash (Barry Allen) Villains * Captain Cold * Heat Wave * Mirror Master (Sam Scudder) * Trickster (James Jesse) Others * Iris Allen Sports Teams * Central City Stars (baseball) * Central City Diamonds (baseball) * Central City Cougars (football) * Central City Miners (basketball) == Notes == Before the Crisis on Infinite Earths, Central and Keystone, collectively known as the \"Gem Cities\" were not twin cities. Rather, Central City only existed on Earth-One and Keystone City only existed on Earth-Two. Some sources have shown Central City to be in Ohio instead of Missouri. The Flash #228 places it at roughly the same spot as Athens, Ohio. The map in the Atlas of the DC Universe claims that Keystone and Central are across the Mississippi River from each other. The Mississippi does not border Kansas; the Missouri does. The DCU version of Central City is not to be confused with the city by the same name seen in Will Eisner's The Spirit. == In other media == The city has also appeared in movies, television series, and video games as well. Category:DC Comics",
 "title": "Central City (DC Comics)"
}