{
 "id": "1066229",
 "text": "Pannonian Romance was an Indo-European language, pertaining to the Centum group in the neo-latin languages, with some Celtic roots and related to the old Illyrian. According to the linguist Roxana Curc, the main source of intelligence on this extinct language is the many toponyms in the area of Lake Balaton (located in actual central Hungary) and some anthroponyms, hydronims and etonyms that come from the \"Keszthely culture\". In addition to this, the same Keszthely name (pronounced in Hungarian “Kestei”) is similar to the Istrian-Venetic “castei”, which means “castle”, and is probably an original word of the Pannonian Romance language, according to the Hungarian linguist Julius Pokornyin. This Hungarian linguist also wrote that the word “Pannonia” was originated from the illyrian word “pen” (marsh) and this demonstrates that the romanized language of the Pannonians was related to the Illyrian, another extinct Balkan language. Pannonian Romance probably contributed to the creation of the 300 basic words of the “Latin substratum” of the Balkan Romance languages, according to Romanian linguist Alexandru Rossetti. == Characteristics == Analysis of the Vulgar Latin spoken in Pannonia showed several phonetical developments: *the shortening of /ll/ and /nn/ geminates. *palatalization of /d/. *the merger of unstressed /e/~/i/ (Decibali for Decebali), but /o/~/u/ fusion is less noticeable. *disappearance of /h/ from the 4th century onwards. */ns/ simplified to /n/, /nt/ to /t/ - less often to /n/. /nkt/ group was simplified to /nt/ or /kt/, but it is not know why the development was not uniform. *palatalization of plosives /t/, /d/, /k/ is poorly attested. *reduction of the diphthong ao to a (Laodicena to Ladicena), and ae to e (bonae to bone). *lenition is attested (extricado < extricatus) from the 3rd century. As in other provinces, accusatives after the 1st century AD were regularly switched to nominatives as the subjects of verbs, ergo -as was often written instead of -ae, which is the correct plural inflection of first-declension feminine nouns. Many instances of this error are found on a perhaps 3rd century epitaph from Pannonia. It says \"hic quescunt duas matres duas filias... et aduenas II paruolas\" (Corpus Inscriptionum Latinarum III 3551), which means \"here lie two mothers, two daughters... and two young foreign girls\". The dative and genitive cases are evidently quite common in the inscriptions, and this ratio unmistakably indicates that Pannonia was where the dative-genitive fusion was most significant relative to the rest of the empire. Since the rate is 45% in Pannonia and 24% for the entire empire. An examination of the Pannonian Latin texts as a whole reveals that the process of amalgamation has only begun in linguistic singular. Accusative- ablative mergers account for 15% of case errors in Pannonian Latin. ==Notes== Category:Romance languages Category:Extinct languages",
 "title": "Pannonian Romance"
}