{
 "id": "1066199",
 "text": "Permaculture is a way of managing land and designing communities by learning from nature. It copies natural patterns to get the most benefits with the least waste and energy. It promotes natural way of farming instead of modern industrial methods. The term 'Permaculture' was created by Bill Mollison and David Holmgren in 1978. Critics say that permaculture doesn't have a clear definition and lacks a scientific basis and does not address real-world issues. == Foundational ethics == Permaculture is guided by three foundational ethics: * Care of the Earth: Ensuring the continuation and multiplication of all life systems. * Care of People: Providing access to resources necessary for people's existence. * Setting Limits: Governing population and consumption to allocate resources for the above principles. Permaculture design copies natural patterns in ecosystems to get the most benefits with the least waste and energy. The way permaculture is used can change depending on the Earth's region, and there's not much scientific literature about it. == Permaculture zones == Permaculture uses zones to organize elements in a human environment based on how often they're used and the needs of plants or animals. The zones are numbered from 0 to 5. * Zone 0: The home center, focuses on using natural resources like sunlight to reduce energy and water needs for a sustainable living environment. * Zone 1: Closest to the house, includes often-used things like salad crops, herbs, and small fruits, as well as structures like greenhouses. * Zone 2: A bit farther, has plants needing less regular care, beehives, and larger composting bins. * Zone 3: The main crop area for home use and trade with less maintenance needed after setup. * Zone 4: A partly wild space for foraging, collecting wild plants, and timber production. * Zone 5: A wilderness area where humans don't interfere, acting as a natural reserve supporting the zones below it. == References == Category:Agriculture",
 "title": "Permaculture"
}