{
 "id": "1066024",
 "text": "AEW Grand Slam is a yearly professional wrestling event made by All Elite Wrestling (AEW) since 2021. The name \"Grand Slam\" is a reference to a Grand Slam which is when a player wins four major championships in one discipline in a year. The events originally aired yearly in September as a special episodes of AEW's television shows Dynamite, Rampage, and Collision. All of the events from 2021 to 2024 have taken place at Arthur Ashe Stadium in Queens, New York. During All In on August 25, 2024, AEW announced that the 2025 edition would be held as a pay-per-view (PPV) event on February 15, at the Suncorp Stadium in Brisbane, Queensland, Australia. Due to low ticket sales, however, the event was relocated to the Brisbane Entertainment Centre in November. This will be the first AEW event to be held in Australia. ==Dates and venues== Event Date City Venue Main Event AEW Grand Slam (2021) Night 1: Dynamite September 22, 2021 Flushing, Queens, New York Arthur Ashe Stadium Dr. Britt Baker, D.M.D. (c) vs. Ruby Soho for the AEW Women's World Championship Night 2: Rampage September 22, 2021 Jon Moxley and Eddie Kingston vs. Suzuki-gun (Minoru Suzuki and Lance Archer) in a Lights Out match AEW Grand Slam (2022) Night 1: Dynamite September 21, 2022 Bryan Danielson vs. Jon Moxley for the vacant AEW World Championship Night 2: Rampage September 21, 2022 Powerhouse Hobbs vs. Ricky Starks in a Lights Out match AEW Grand Slam (2023) Night 1: Dynamite September 20, 2023 MJF (c) vs. Samoa Joe for the AEW World Championship Night 2: Rampage September 20, 2023 Mogul Embassy (Brian Cage, Bishop Kaun, and Toa Liona) (c) vs. The Elite (Matt Jackson, Nick Jackson, and \"Hangman\" Adam Page) for the ROH World Six-Man Tag Team Championship AEW Grand Slam (2024) Night 1: Dynamite September 25, 2024 Jon Moxley vs. Darby Allin for Allin's AEW World Championship opportunity Night 2: Collision September 25, 2024 Kazuchika Okada (c) vs. Sammy Guevara in a Last Chance AEW Continental Championship Eliminator match Grand Slam Australia February 15, 2025 Brisbane, Queensland, Australia Brisbane Entertainment Centre TBA == References == Category:AEW Grand Slam Category:2021 establishments in the United States",
 "title": "AEW Grand Slam"
}