{
 "id": "1066333",
 "text": "AEW Holiday Bash is a yearly professional wrestling event made by All Elite Wrestling (AEW). The event started in 2020 and is usually held in December as their Christmas special. The event airs as special episodes of AEW's television shows Dynamite, Rampage, and Collision. The 2021 event's Rampage episode aired on delay on December 25 at 9pm ET. It was pushed back because of a tradition that TNT has where they show the 1983 movie A Christmas Story during their holiday marathon. ==Dates and venues== Event Date City Venue Main event Holiday Bash (2020) Dynamite: December 17, 2020 Jacksonville, Florida Daily's Place The Young Bucks (Matt and Nick Jackson) (c) vs. The Acclaimed (Anthony Bowens and Max Caster) for the AEW World Tag Team Championship. Holiday Bash (2021) Night 1: Dynamite – December 22, 2021 Greensboro, North Carolina Greensboro Coliseum Sting, CM Punk, and Darby Allin vs. The Pinnacle (MJF and FTR (Cash Wheeler and Dax Harwood)). Night 2: Rampage – December 22, 2021 Sammy Guevara (c) vs. Cody Rhodes for the AEW TNT Championship. Greensboro, North Carolina Greensboro Coliseum Holiday Bash (2022) Night 1: Dynamite – December 21, 2022 San Antonio, Texas Freeman Coliseum Jamie Hayter (c) vs. Hikaru Shida for the AEW Women's World Championship. Night 2: Rampage – December 21, 2022 Jay Lethal and Jeff Jarrett vs. Anthony Bowens and Billy Gunn. Holiday Bash (2023) Night 1: Dynamite – December 20, 2023 Oklahoma City, Oklahoma Paycom Center Jon Moxley vs. Jay White in a Gold League match of the AEW Continental Classic tournament. Night 2: Rampage – December 20, 2023 El Hijo del Vikingo (c) vs. Black Taurus for the AAA Mega Championship. Night 3: Collision – December 23, 2023 San Antonio, Texas Frost Bank Center Andrade El Idolo vs. Eddie Kingston in a Blue League match of the AEW Continental Classic tournament. Holiday Bash (2024) Night 1: Dynamite – December 18, 2024 Washington, D.C. Entertainment & Sports Arena Death Riders (Jon Moxley, Pac, and Wheeler Yuta) vs. \"Hangman\" Adam Page, Jay White, and Orange Cassidy Night 2: Rampage – December 18, 2024 Brody King vs. Komander in a Gold League match of the Continental Classic tournament == References == Category:AEW Holiday Bash Category:2020 establishments in the United States",
 "title": "AEW Holiday Bash"
}