{
 "id": "1066036",
 "text": "Thresher sharks, also known as simply threshers, are large mackerel sharks of the family Alopiidae and the genus Alopias. They are distinguished by their long tails and unique hunting behaviors. Thresher sharks are known for their exceptional agility and speed. They grow up to 20 feet long. Males sexually mature when they are 8 to 11 feet long and 3 to 6 years old. Females are able to reproduce when they are 8 to 9 feet long and 4 to 5 years of age. Thresher sharks are ovoviviparous. Embryos develop inside eggs within the mother's body, ultimately giving birth to live young. Despite being active predatory fish, these fishes do not attack humans. == Species == There are currently 16 species. A fourth species of thresher was revealed during the course of a 1995 allozyme analysis by Blaise Eitner. It is apparently found in the eastern Pacific off Baja California, making it 17 species. However, it's known from muscle samples from one specimen. == Description == Thresher sharks have a short head and a cone-shaped nose. Their mouths are generally small. They have a long, scythe-like heterocercal tail. They are slender, with small dorsal fins and large, recurved pectoral fins. == Diet and behavior == === Diet === They mainly eat bluefish, juvenile tuna and mackerel. Crustaceans and seabirds are also eaten by them. They stun their prey by using their unique, elongated tail as a weapon. === Behavior === The thresher shark is an animal that keeps to itself. It is known that thresher populations of the Indian Ocean are separated by depth and space according to sex. == Related pages == * List of fish common names == References == # Common Thresher Shark - Sharkwater Extinction. # Froese, Rainer and Pauly, Daniel, eds. (2011). Species of Alopias in FishBase. February 2011 version. == Further reading == * \"Alopias\". Integrated Taxonomic Information System. Retrieved 4 May 2006. == Other websites == * Thresher shark video by Oceana on YouTube Category:Sharks",
 "title": "Thresher shark"
}