{
 "id": "1066519",
 "text": "AEW New Year's Smash is a yearly professional wrestling event made by All Elite Wrestling (AEW). The event started in 2021 and is usually held around the end of the year as their New Year special. The events air as special episodes of AEW's television shows Dynamite and Rampage. The first event was originally supposed to take place on December 30, 2020, and end on January 6, 2021 but the event was pushed back a week. Instead, the Brodie Lee Celebration of Life event took it's place to honour the memory of AEW wrestler Brodie Lee who died on December 26. ==Dates and venues== Event Date City Venue Main event New Year's Smash (January 2021) Night 1: Dynamite – January 6, 2021 Jacksonville, Florida Daily's Place Kenny Omega (c) vs. Rey Fénix for the AEW World Championship. Night 2: Dynamite – January 7, 2021 Darby Allin (c) vs. Brian Cage for the AEW TNT Championship. New Year's Smash (December 2021) Night 1: Dynamite – December 29, 2021 Adam Cole, Bobby Fish, and Kyle O'Reilly vs. Best Friends (Orange Cassidy, Chuck Taylor, and Trent Beretta). Night 2: Rampage – December 29, 2021 Cody Rhodes (c) vs. Ethan Page for the AEW TNT Championship. New Year's Smash (2022) Night 1: Dynamite – December 28, 2022 Broomfield, Colorado 1stBank Center Samoa Joe (c) vs. Wardlow for the AEW TNT Championship. Night 2: Rampage – December 28, 2022 Swerve Strickland vs. Wheeler Yuta. New Year's Smash (2023) Night 1: Dynamite – December 27, 2023 Orlando, Florida Addition Financial Arena MJF (c) vs The Devil's Masked Men for the ROH World Tag Team Championship Night 2: Rampage – December 27, 2023 Rocky Romero, Trent Beretta and Orange Cassidy vs. Action Andretti and Top Flight (Darius and Dante Martin) New Year's Smash (2024) Rampage: December 22, 2024 New York City, New York Hammerstein Ballroom TBA (c) – is the champion(s) going into the match == Footnotes == == References == Category:AEW New Year's Smash Category:2021 establishments in the United States",
 "title": "AEW New Year's Smash"
}