{
 "id": "1066345",
 "text": "Schizophrenic insight (lacking insight, poor insight) is that some or many people with schizophrenia don't think or know that they have it. Paul H. Lysaker, Michelle L. Pattison, Bethany L. Leonhardt, Scott Phelps, Jenifer L. Vohs Insight in schizophrenia spectrum disorders: relationship with behavior, mood and perceived quality of life, underlying causes and emerging treatments World Psychiatry 9 January 2018 https://doi.org/10.1002/wps.20508Marjorie Baier Insight in schizophrenia: a review Curr Psychiatry Rep. 2010 Aug;12(4):356-61. https://doi.org/10.1007/s11920-010-0125-7.Boban Joseph, Janardhanan C Narayanaswamy, Ganesan Venkatasubramanian Insight in schizophrenia: relationship to positive, negative and neurocognitive dimensions Indian J Psychol Med . 2015 Jan-Mar;37(1):5-11. https://doi.org/10.4103/0253-7176.150797.Aleman, A., Agrawal, N., Morgan, K., & David, A. (2006). Insight in psychosis and neuropsychological function: Meta-analysis. The British Journal of Psychiatry, 189(3), 204-212. https://doi.org/10.1192/bjp.189.3.204 The idea uses the word insight. For doctors, schizophrenia is about their jobs where they earn money from people who are patients and things like science and research. People who doctors say have schizophrenia sometimes think they don't. Doctors describe these people as lacking insight. Bérangère Thirioux, Ghina Harika-Germaneau, Nicolas Langbour, Nematollah Jaafari The Relation Between Empathy and Insight in Psychiatric Disorders: Phenomenological, Etiological, and Neuro-Functional Mechanisms Front. Psychiatry, 06 February 2020 Sec. Social Neuroscience Volume 10 - 2019 https://doi.org/10.3389/fpsyt.2019.00966Boban Joseph, Janardhanan C. Narayanaswamy, and Ganesan Venkatasubramanian Insight in Schizophrenia: Relationship to Positive, Negative and Neurocognitive Dimensions Indian J Psychol Med. 2015 Jan-Mar; 37(1): 5–11. doi: 10.4103/0253-7176.150797 To lack something is to not have something. The words doctor use has meanings like: \"The fact of penetrating with the eyes of the understanding\", \"deep\", \"the power or act of seeing into a situation\". The whole idea is quite complicated. \"insight NOUN\" Oxford University Dictionary\"Meaning of insight in English\" Cambridge University Dictionary\"Definition of 'insight'\" Collins Dictionary\"insight noun\" Merriam-Webster Dictionary\"Synonyms of 'insight' in British English\" Collins Thesaurus In 1927 Dr. E. Minkowski described the idea of psychiatrists penetrating into the mind of patients for diagnosis. Dr. C. Jung had similar ideas sometime after 1909, which Dr. E. Bleuler described as \"depth psychology\".Eugene Minkowski (The Schizophrénie, 1927): J.R. Véliz, C.R. Zárate, G. Montenegro Intuition in Minkowski: Method and Lived Experience European Psychiatry, Volume 30, Supplement 1, 2015, Page 1532, ISSN 0924-9338, https://doi.org/10.1016/S0924-9338(15)32062-9.Ai SATO: p.99 of The Two Spaces of Eugène Minkowski, Inter Faculty, vol.4, FRAGMENTATIONS Graf-Nold, A: p.1 of Jung's lectures at the Swiss Federal Institute of Technology (ETH):Collating the text of the course \"Modern Psychology\" University of ZurichBonnie Bright On Depth Psychology: It’s Meaning and Magic Depth Insights \"Mental health literacy\"Fahad Riaz Choudhry, Vasudevan Mani, Long Chiau Ming, and Tahir Mehmood Khan https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5096745/ Beliefs and perception about mental health issues: a meta-synthesis Neuropsychiatr Dis Treat. 2016; 12: 2807–2818. Published online 2016 Oct 31. doi: 10.2147/NDT.S111543 (literacy being literature) could be very similar or the same as insight. The word insight means literally to see inside, which is in & sight, which is seeing. This is obviously not possible because the human eye is the organ of seeing. Situations where actually insight is really possible (which means the eye of the mind), by the definition of seeing inside, is mental visualization and dreams. Both Dr Freud and Dr Jung wrote about and researched dreams. They both thought thinking about dreams and the meaning of dreams was important. Alfio Maggiolini, Luca Codeca The typical contents of Freud’s and Jung’s dreams January 2016 International Journal of Dream Research ==References== Category:Schizophrenia",
 "title": "Schizophrenic insight"
}