{
 "id": "1066258",
 "text": "The Bedford level experiment is the name for a series of observations, done on the Old Bedford River, in Cambridgeshiire. These observations were done to measure the curvature of the Earth. Samuel Rowbotham made the first observations, in 1839. He claimed that with these observations he could prove that the earth was flat. In 1870, Alfred Russel Wallace used the same observations but made small changes, to correct for some errors. Using these observations, he could prove that the Earth was a sphere. == The Bedford level == This river was chosen, because from a certain point it runs in a straight line, for . This point is near the village of Welney. This makes it an ideal location to directly measure the curvature of the Earth, as Rowbotham wrote in Zetetic Astronomy:. == Experiments == Rowbotham did the first experiments at the site in the summer of 1838. He went into the river and used a telescope held above the water to watch a boat. The boat had a flag on its mast above the water. It slowly rowed away from him. He reported that he could see it all the time, for the full to Welney Bridge. He also said, that if the earth was curved, the top of the mast should have been about below his line of sight. He published this observation using the pseudonym Parallax in 1849. He wrote a book about these ideas, and called it Earth Not a Globe; the book was published in 1865. Rowbotham repeated his experiments several times over the years, but his claims got little attention. In 1870, a supporter named John Hampden offered some money, to anyone that could show that the earth was flat, using Rowbotham's experiment. Alfred Russel Wallace, a naturalist, and qualified surveyor accepted the wager. Wallace was a surveyor. So with what he knew from his training, and his knowledge of physics, he avoided the errors that had been made before, and won the bet. The crucial steps were: # To set a sight line above the water. This also reduced the effects of atmospheric refraction. # To add a pole in the middle of the length of canal that could be used to see the \"bump\" caused by the curvature of the Earth between the two end points. At first, Hampden did not accept this demonstration.The referee, John Henry Walsh, editor of The Field sports magazine, did, and Wallace got the money. Hampden then published a pamhlet and said that Wallace had cheated. He also sued Wallace, to get his money back. There were several court cases. In the end, Hampden was imprisoned for threatening to kill Wallace and for libel. The same court ruled that the wager had been invalid because Hampden retracted the bet and required that Wallace return the money to Hampden. Wallace, who had been unaware of Rowbotham's earlier experiments, was criticized by his peers for \"his 'injudicious' involvement in a bet to 'decide' the most fundamental and established of scientific facts\". In 1901, Henry Yule Oldham, a reader in geography at King's College, Cambridge, reproduced Wallace's results. He used three poles fixed at equal height above water level. When viewed through a theodolite, the middle pole was found to be about higher than the poles at each end. This version of the experiment was taught in schools in England until photographs of the Earth from space became available; it still remains in the syllabus for the Indian Certificate of Secondary Education for 2023. Advocates of a flat Earth, however, were not deterred. On 11 May 1904 Lady Elizabeth Anne Blount hired a commercial photographer to use a telephoto-lens camera to take a picture from Welney of a large white sheet she had placed at Rowbotham's original position away. The bottom of the sheet was near the surface of the river. Blount had a lot of influence. She later was involved in the foundation of the Flat Earth Society. The photographer, Edgar Clifton from Dallmeyer's studio, put his camera above the water at Welney and was surprised to be able to obtain a picture of the target,. He thought, it should have been invisible because of the low mounting point of the camera. Lady Blount published the pictures far and wide.Michell, p.27 These controversies became a regular feature in the English Mechanic magazine in 1904–05. It published Blount's photo and reported two experiments in 1905 that showed the opposite results. One of these, by Clement Stratton on the Ashby Canal, showed a dip on a sight-line only above the surface. == References == Category:Experiments",
 "title": "Bedford level experiment"
}