{
 "id": "1066232",
 "text": "Tammy (pronounced TAM-ee) is a female given name. This name is often the short form of the names Thomasina, Tabitha or Tamara. The latter is a form of the Russian given name Tamar. The related Thomasina or Thomasine are female forms of the name Thomas (a Greek name). The name became very popular because of a movie series in the 1950s and 1960s called Tammy Tyree. Tammy was very popular during the 1950s, 1960s, 1970s and first half of the 1980s. ==The people== *Tammy Abraham (born 1997), English footballer *Tammy Ader, American television writer, director and producer *Tammy Alexander (1963–1979), American homicide victim found in the town of Caledonia, New York *Tammy Armstrong (born 1974), Canadian poet and novelist *Tammy Baldwin (born 1962), American politician serving as the junior United States senator from Wisconsin *Tammy Barr, American actress, model and voice over artist *Tammy Barton (born 1978), Australian entrepreneur and the founder of MyBudget *Tammy Beauchamp (1878–1947), born Thomas Beacham, Australian rules footballer *Tammy Beaumont (born 1991), English cricketer *Tammy Beauvais, Indigenous fashion designer from Kahnawake Mohawk Territory, Quebec, Canada *Tammy Blanchard (born 1976), American actress *Tammy Clarkson, Australian television actress *Tammy Cleland (born 1975), American athlete in synchronized swimming *Tammy Cole (born 1973), Australian female field hockey defender *Tammy Duckworth (born 1968), American politician and former U.S. Army lieutenant colonel who has served as the junior United States senator for Illinois *Tammy Franks (born 1968), Australian politician, member of the South Australian Legislative Council *Tammy Graham (born 1968), American country music artist *Tammy Grimes (1934–2016), American actress and singer *Tammy Homolka (1975–1990), the younger sister and victim of Canadian murderer Karla Homolka and her partner, Paul Bernardo *Tammy Jackson (born 1962), American former college and professional basketball player *Tammy Jones, stage name of Debbie D'Amato, professional wrestler from the Gorgeous Ladies of Wrestling *Tammy Lau Nga-wun (born 1992), Hong Kong rugby union player *Tammy Leitner (born 1972), American investigative TV reporter and reality television contestant *Tammy Lynn Sytch, (born 1972), American professional wrestling valet, known for her time in the WWF during the mid 1990s as \"Sunny\" *Tammy MacIntosh (born 1970), Australian actress *Tammy Faye Messner (1942–2007), American Christian singer, evangelist, author, talk show hostess, and television personality *Tammy Ogston (born 1970), Australian football referee *Tammy Pescatelli (born 1969), American stand-up comedian *Tammy Sutton-Brown (born 1978), Canadian basketball player *Tammy Wynette (1942–1998), American country music singer- songwriter ==Fictional characters== *Tammy, a character in the 1978 pornographic movie Debbie Does Dallas *Tammy Banks, in the movie Tammy *Tammy Swanson (differentiated as Tammy I, Tammy II, and Tammy Zero), three characters in the American television series Parks and Recreation *Tammy Tarleton, in the television series Tammy *Tambrey \"Tammy\" Tyree, in the Tammy movie series *Tammy, in the animated series Rick and Morty *Tammy Larsen, in the animated series Bob's Burgers *Tammy, in the animated series The Ridonculous Race *Reverend Tammy in the comedy show The Middle Category:Given names",
 "title": "Tammy (name)"
}