{
 "id": "1066716",
 "text": "A magnitude 7.6 earthquake happened in Hinatuan, Caraga, Philippines, at the depth of , on 2 December 2023, at 22:37 PST (14:37 UTC). Two peoples died, and four others was injured. Nine peoples are also missing. == Tectonic setting == The Philippines islands were made in a long process where parts of the Earth went under each other and crashed together. This causes a lot of earthquakes there. These earthquakes happen because the Philippine Sea Plate and the Sunda Plate are colliding. They don't just crash straight into each other; instead, they slide against each other at an angle. This sliding is taken care of by the Philippine fault system, which is a big crack in the Earth where things are moving horizontally. In one part of the fault, in the northern and central Leyte sections, it's moving about 33 ± 11 millimeters per year. In the southern part of the Philippine fault, which is mainly in eastern Mindanao, things are more complicated. It's not just one big crack; it's like a puzzle with different pieces. Mindanao island is right on the border where the Sunda Plate and the Philippine Sea Plate are colliding. Some of the movement between these plates is managed by the Philippine fault and also by one part where the plates are going under each other, called the Cotabato trench. == Earthquake == The United States Geological Survey said the earthquake had a magnitude of 7.6 and a maximum Modified Mercalli intensity of VIII (Very Strong). The Philippine Institute of Volcanology and Seismology said the earthquake had a magnitude of 6.9 and that it measured V (Strong) on the PHIVOLCS Earthquake Intensity Scale in Tandag. The earthquake happened as a result of shallow oblique-thrust faulting along the Philippine Trench. The Philippine Sea Plate moved towards the west-northwest compared to the Sunda Plate. The earthquake's impact was strongest near the center and slightly higher, covering an area of about . The movement reached a maximum of about . PHIVOLCS recorded over 819 aftershocks in total. Within nearly a day of the earthquake, the United States Geological Survey recorded 113 aftershocks with a magnitude above 4.5. These aftershocks happened southeast of the main earthquake. The biggest aftershock, with a magnitude of 6.6, happened on December 3. == Tsunami == Tsunami warnings were issued by PHIVOLCS in Surigao del Sur and Davao Oriental, and NHK said that tsunami waves up to might hit Japan's southern coast. The Pacific Tsunami Warning Center also said that they tsunami waves to be as high as in the Philippines, in Palau, and less than in American Samoa, China, South Korea, Polynesia, Melanesia, Micronesia, Hawaii, Indonesia, Japan, Taiwan and Malaysia. A tsunami with a height of was seen on Mawes Island. On Hachijō- jima, a Japanese island located south of Tokyo, waves measuring were documented. In Davao, the tsunami reached a height of . == Impact == Two deaths were recorded, one in Tagum and another in Bislig. Both deaths were because of collapsing walls. Four people were injured and nine others were missing. According to defense secetary, Gilbert Teodoro, 529 families were affected. In Hinatuan, three houses collapsed, one was damaged, and power outages happened. Minor damage happened in Butuan, Surigao, Sayak, Tandag and Bislig airports. Some houses were damaged in Agusan del Sur, where power was knocked out in the entire province. In Bayugan, a store's wall collapsed. Several houses, bridges, and mosque were damaged, power outages and people passing out from the earthquake in Davao City. Patients were evacuated from a hospital in Butuan. Hinatuan's government estimated infrastructure damage at ₱9.8 million (US$197,000). 268 houses were damaged, and 90 were destroyed, totaling ₱44 million (US$900,000). The overall estimated damage was ₱54.8 million (US$1.1 million). == References == Category:December 2023 events Category:2023 earthquakes Category:Caraga",
 "title": "December 2023 Mindanao earthquake"
}