{
 "id": "1067828",
 "text": "Smoothie King Center is a multi-use arena located in New Orleans, Louisiana that serves as the home for the New Orleans Pelicans of the National Basketball Association (NBA). The arena was also the home of the New Orleans Brass of the ECHL from 1999 until 2002. The New Orleans VooDoo of the Arena Football League (AHL) played in the arena from 2004 until 2005, 2007 until 2008, and 2011 until 2015. They first started to build the stadium on November 30, 1995. The arena opened on October 29, 1999 and the first event was a game between the New Orleans Brass and Baton Rouge Kingfish on October 29, 1999. On May 10, 2002, the league approved a deal that saw the original Charlotte Hornets move to New Orleans. The Hornets would move into arena but before they did, they told the state government to force the Brass to pay for upgrades to arena so it could change between hockey and basketball. The Brass could not do this and were forced to fold because of it. The Hornets had their first game in the arena on October 30, 2002. In their first game, they defeated the Utah Jazz 100–75. When Hurricane Katrina hit New Orleans in 2005, the Hornets temporarily moved to Oklahoma City, Oklahoma. In March 2006, repairs would be finished on the arena with a new scoreboard and video displays also being added. The Hornets would return to the arena on November 1, 2006. They defeated the Boston Celtics 91–87. When the arena opened, it didn't have an official corporate sponsor and was named the New Orleans Arena. On February 5, 2014, Smoothie King purchased the naming rights for the arena in a 20-year; $40 million deal and would rename the arena Smoothie King Center. WWE has hosted many shows and pay-per-views at the arena including the Royal Rumble in 2001, Extreme Rules in 2009, Hell in a Cell in 2011, Elimination Chamber in 2013, and NXT TakeOver: New Orleans. ==References== ==Other websites== * Category:Buildings and structures in New Orleans",
 "title": "Smoothie King Center"
}