{
 "id": "1067860",
 "text": "Ptolemy XIII Theos Philopator, also known as Ptolemy XIII, was the Pharaoh of Egypt from 51 to 47 BC, and a member of the Ptolemaic dynasty. He was the son of Ptolemy XII and ruled Egypt after his father with his sister Cleopatra VII. However, a civil war happened between Ptolemy XIII and Cleopatra. During this conflict, Ptolemy XIII ruled with his other sister, Arsinoe IV. == Biography == === Pharaoh of Egypt === Ptolemy XIII became the pharaoh of Egypt after his father Ptolemy XII died. Ptolemy XIII was only 11 years old when he became pharaoh, so his sister Cleopatra ruled with him as a co-ruler. Pothinus, a powerful advisor, helped Ptolemy XIII rule because Ptolemy XII was too young. Roller, Duane W. (2010), Cleopatra: a biography, Oxford: Oxford University Press p.56-67 Ptolemy XIII and Pothinus later tried to remove Cleopatra from ruling because she was becoming too powerful. === Civil war === Ptolemy XIII and his advisor Pothinus made Cleopatra leave the country and started a war against her. Pompey who was a roman general came to Egypt looking for safety because his enemy Julius Caesar was chasing him. At first, Ptolemy XIII seemed like he would help Pompey, but then he killed Pomepy. When Caesar arrived, he was angry that Pompey had been killed and ordered his body to be found given a good burial. Cleopatra was able to become allies with Juilius Caeser against Ptolemy XIII and Arsinoe IV. Caesar killed Pothinus and made Cleopatra the pharaoh of Egypt. Ptolemy XIII still wanted to rule Egypt, so he teamed up with his sister Arsinoe IV. They both gathered their supporters and fought against Cleopatra's army inside Alexandria. This caused a lot of damage in the city.Plutarch, Life of Julius Caesar, 49:3. When Roman soldiers arrived, there was a big battle called the Battle of the Nile. Cleopatra and Caesar won. After that Ptolemy XIII drowned in the Nile river. Some people think he tried to swim across the Nile River to escape , but we don't know for sure. After that, Cleopatra stayed as the only ruler of Egypt, but she made her younger brother Ptolemy XIV her co-ruler. == Notes == == References == Category:40s BC deaths Category:60s BC births Category:1st millennium BC pharaohs",
 "title": "Ptolemy XIII (Pharaoh)"
}