{
 "id": "1067575",
 "text": "Debbie Does Dallas is a 1978 American pornographic movie. It was both directed and produced by Jim Clark. Debbie Does Dallas was released on November 19, 1978. There was a copyright battle when the movie was released. M & A Associates held rights and wanted to distribute it through VCX. They didn't want people to illegally copy the movie. They were unable to get the copyright protection or register with the United States Copyright Office (USCO). There would be a cease and desist filed by M & A against VCX and the USCO but the judge ruled in favor of VCX and the USCO. This meant that the movie would enter the public domain in the United States. ==Legacy== The movie was very popular and sold around 50,000 VHS tapes. Debbie Does Dallas is one of the most well known pornographic movies of all time. It was released in the time period known as the \"Golden Age of Porn\" which was from 1969 until 1984. The movie has had many different sequels made of it. == Plot== The movie is about cheerleaders that want to help send Debbie (Bambi Woods) to Texas so she can try and make the \"Texas Cowgirls\" cheerleading squad. Debbie and her friends all take part-time jobs to try and raise money for the trip. After a while, they all end up having sex for money. In the end, Debbie wears a Texas Cowgirls cheerleading outfit and has sex with a store owner that is dressed like Joe Namath. == Cast == * Bambi Woods as Debbie Benton * Richard Balla as Mr. Greenfeld * Christie Ford (as Misty Winter) as Roberta * Robyn Byrd as Mrs. Hardwick * Eric Edwards as Mr. Hardwick * Rikki O'Neal (as Sherri Tart) as Rikki * Jenny Cole as Annie * David Pierce (as David Suton) as Mr. Bradly * Merle Michaels (as Merril Townsend) as Donna * Jake Teague as Mr. Biddle * Herschel Savage as Tim * Georgette Sanders as Lisa * Peter Lerman as Hamilton * Ben Pierce as Ashly * Arcadia Lake as Tammy * Tony Mansfield as Nick * David Morris as Rick * Kasey Rodgers as Pat * Debbie Lewis as Girl in Shower * Steve Marshall as Boy in Shower * Graham Silcock as \"The other boy in the shower\" ==References== == Other websites == * Category:1978 movies Category:1970s English-language movies Category:American comedy movies Category:American sex comedy movies Category:American sports movies Category:Pornographic movies",
 "title": "Debbie Does Dallas"
}