{
 "id": "1067824",
 "text": "The International Library of Psychology, Philosophy and Scientific Method was a famous and important series of monographs published from 1922 to 1965. They were edited by Charles Kay Ogden, and published by Kegan Paul, Trench Trubner & Co. in London. This series published some important book on psychology and philosophy, especially the thought of the Vienna Circle in English. It published some of the best psychologists and philosophers of the time, such as Alfred Adler, C. D. Broad, Rudolf Carnap, F. M. Cornford, Edmund Husserl, Carl Jung, Kurt Koffka, Ernst Kretschmer, Bronisław Malinowski, Karl Mannheim, George Edward Moore, Jean Nicod, Jean Piaget, Frank P. Ramsey, Otto Rank, W. H. R. Rivers, Louis Leon Thurstone, Jakob von Uexküll, Hans Vaihinger, Edvard Westermarck, William Morton Wheeler, Ludwig Wittgenstein, J. N. Findlay and others. Most of the 204 books in the series have been reprinted, some in revised editions. == List of books in the series == Listed alphabetically by author, with date of original publication (many have been reprinted). # Adler, Alfred. Individual psychology, 2ed (1924). # Adler, Mortimer J. Dialectic (1927). # Anton, John P. Aristotle's theory of contrariety (1957). # Bentham, Jeremy. The theory of legislation (1931). # Black, Max. The nature of mathematics (1933). # Bogoslovsky, Boris. The technique of controversy: principles of dynamic logic (1928). # Broad, C. D. The mind and its place in nature (1925). # Buchanan, Scott. The doctrine of signatures (1938). # Buchanan, Scott. Possibility (1927). # Buchler, Justus. Charles Peirce's empiricism (1939). Foreword by Ernest Nagel. # Bühler, Karl. The mental development of the child (1930). # Burrow, Trigant. The social basis of consciousness: a study in organ psychology based upon a synthetic and societal concept of neuroses (1927). # Burtt, Edwin Arthur. The metaphysical foundations of modern physical science (1924). # Cairns, Huntington. Law and the social sciences (1935). Foreword by Roscoe Pound. # Carnap, Rudolf. The logical syntax of language (1937). # Cornford, F. M. Plato's theory of knowledge (1935). # De Sanctis, Sante. Religious conversion (1927). # Downey, June. Creative imagination: studies in the psychology of literature (1929). # Florence, Philip Sargant. The statistical method in economics and political science (1929). # Hartmann, Karl Robert Eduard von. Philosophy of the unconscious (1931). # Horney, Karen. Neurosis and Human Growth (1951) # Hulme, T. E. Speculations: essays on humanism and the philosophy of art (1924). Edited by Herbert Read. # Humphrey, George. The nature of learning in its relation to the living system (1933). # Jaensch, Erich Rudolf. Eidetic imagery and typological methods of investigation: their importance for the psychology of childhood (1930). # Jung, Carl. Contributions to analytical psychology (1928). # Jung, Carl. Psychological types (1923). # Koffka, Kurt. Growth of the mind (1924). # Köhler, Wolfgang. The mentality of apes (1925). # Kretschmer, Ernst. Physique and character (1931). # Ladd-Franklin, Christine. Colour and colour theories (1929). # Laignel-Lavastine, Maxime. The concentric method in the diagnosis of psychoneurotics (1931). # Lange, Friedrich Albert. History of materialism (1925). Introduction by Bertrand Russell. # Lazerowitz, Morris. The structure of metaphysics (1955). # Leuba, James H. The psychology of religious mysticism (1925). # Liang Qichao. History of Chinese political thought during the early Tsin period (1930). # Liao, Wen Kwei. The Individual and the Community: A Historical Analysis of the Motivating Factors of Social Conduct (1933). # Lodge, Rupert. Plato's theory of education (1947). # Malinowski, Bronisław. Crime and custom in savage society (1926). # Mannheim, Karl. Ideology and utopia (1936). # Marston, William Moulton. Emotions of normal people (1928). # Masson-Oursel, Paul. Comparative philosophy (1926). Introduction by Francis Graham Crookshank. # Moore, G. E. Philosophical studies (1922). # Nicod, Jean. Foundations of geometry and induction (1930). # Ogden, Charles Kay. Bentham's theory of fictions (1932). # Ogden, Charles Kay and Richards, I. A. The meaning of meaning (1923). # Paulhan, Frédéric. The laws of feeling (1930). # Piaget, Jean. The language and thought of the child (1926). # Piéron, Henri. Thought and the brain (1927). # Ramsey, Frank P. Foundations: essays in philosophy, logic, mathematics and economics (1931). # Rank, Otto. The trauma of birth (1929). # Richards, I. A. Mencius on the mind: experiments in multiple definition (1964). # Rignano, Eugenio. Biological memory (1926). # Rignano, Eugenio. The nature of life (1930). # Rignano, Eugenio. The psychology of reasoning (1923). # Ritchie, Arthur David. Scientific method: an inquiry into the character and validity of natural laws (1923). # Rivers, W. H. R. Medicine, magic, and religion (1921). # Rohde, Erwin. Psyche: The cult of souls and the belief in immortality among the Greeks (1925). # Russell, Bertrand. The analysis of matter (1927). # Smart, Ninian. Reasons and faiths: an investigation of religious discourse, Christian and non-Christian (1958). # Stephen, Karin. The misuse of mind: a study of Bergson's attack on intellectualism (1922). Preface by Henri Bergson. # Smith, W. Whately. The measurement of emotion (1922). # Taba, Hilda. Dynamics of education: a methodology of progressive educational thought (1932). # Thalbitzer, Sophus. Emotion and insanity (1926). Translated by M. G. Beard. Preface by Harald Høffding. # Thurstone, Louis Leon. The nature of intelligence (1924). # Tischner, Rudolf. Telepathy and clairvoyance (1925). # Uexküll, Jakob von. Theoretical biology (1926). # Vaihinger, Hans. The philosophy of 'As If' (1924). # Vossler, Karl. The spirit of language in civilization (1932). # Werblowsky, R.J. Zwi. Lucifer and Prometheus: A Study of Milton's Satan (1952). # Westermarck, Edvard. Ethical relativity (1932). # Wheeler, William Morton. The social insects: their origin and evolution (1928). # Wittgenstein, Ludwig. Tractatus Logico-Philosophicus (1922). # Woodger, Joseph Henry. Biological principles (1929). # Zeller, Eduard. Outlines of the history of Greek philosophy, 13th edition (1931). # Zuckerman, Solly. The social life of monkeys and apes (1931). Category:Books",
 "title": "The International Library of Psychology, Philosophy and Scientific Method"
}