{
 "id": "1067470",
 "text": "The English Poor Law system was set up in the Tudor period. Monasteries had given a lot of support to the poor but they were closed. Beggars were sent back to their homes. Workhouses were set up by the parishes for people who could not earn money and they were given work to do. They were paid for by a local tax on the property of the richest people in the parish. Pensions were introduced for poor people over 70 in 1908. The National Insurance Act was passed in 1911. This introduced National Insurance Contributions, which gave free medical treatment to working men, sick pay of 10 shillings a week for 26 weeks and 30 shillings Maternity Grant. Unemployed workers could get 7 shillings per week for up to 15 weeks in a year. The Beveridge Report of 1942 proposed a big expansion of this system and Clement Attlee's government passed laws to make it happen. The National Insurance Act 1946 included sickness and unemployment benefits. This was popular and the Conservative Party (UK) continued it. Married women were expected to rely on their husbands for support. They were not entitled to the same benefits as men. There were widows benefits for women whose husbands died but no benefits for men whose wives died. National Assistance was the main means tested benefit from 1948 to 1966. Then Supplementary Benefit was introduced, and the legal rules were published. People could go to court about it. It was replaced by Income Support in 1988. Help with the cost of rent came from Housing Benefit. From 2013 Universal Credit began to replace all the means tested benefits. In 1970 new benefits for disabled people were introduced: Attendance Allowance and Mobility Allowance. In 1976 Invalid Care Allowance was introduced, but married women could not claim it. Spending on disability benefits rose from 0.1% of GDP in 1980-81 to 0.7% of GDP in 2020-21. The number of people getting disability benefits went up from 1.2 million in 1997 to 2.5 million in 2021-22. Around 2000 there were changes designed to end the discrimination against women. Women's benefits no longer depended on their husbands National Insurance contributions. The state pension age was set at 60 for women, and 65 for men in 1948. At that time most men did not live to claim their pension for long. Women lived on average about 5 years longer than men. In 1995 the law was changed so that the women's pension age would be made equal with men. After 2007 the age people could claim a pension was gradually raised because life expectancy had improved. On average men lived to be more than 80 and women about 84. In the winter cost-of-living payments are made. A £10 Christmas bonus for pensioners and many other claimants was started in 1972 and has never been increased. Most people on means-tested benefits get £900 paid in three instalments. Pensioners get £300. People on disability benefits get an extra £150. In 2024 the House of Commons Work and Pensions Select Committee reported that benefit levels were too low. Many people could not afford daily living costs and extra costs of ill-health and disability. The Child Poverty Action Group produces books about the British social security system every year. They explain people's rights. ==References==",
 "title": "Social security in the United Kingdom"
}