{
 "id": "1067457",
 "text": "YouTube Vanced (or just Vanced, but it used to be iYTBP) was a change of the YouTube application for Android that had an ad blocker made by people who are not with google. Other qualities of the app included , being able to play audio in the background, free picture-in-picture (PiP), an AMOLED black theme, the ability to swipe to change the brightness and loudness, and inclusion of the Return YouTube Dislike browser plug-in. YouTube Music and MicroG were also changed to have these qualities. The name Vanced comes from the word advanced with the word ad taken out, talking about the app getting rid of ads. On March 13, 2022, the makers of YouTube Vanced stated that they would stop making the app after they got a cease and desist letter from Google, which made them stop making Vanced. The app still worked for people who still had it until late April 2023, when the video player of YouTube Vanced was broken. After the app stopped being made, people began moving to apps that are like Vanced (like ReVanced). == Qualities == === Getting === YouTube Vanced and other changed apps by Vanced Team were gotten through the Vanced Manager using already made files. People who had rooted their phone could get the app and have it seen by the phone as the phone's old YouTube app. === YouTube Premium Features === Vanced let people use multiple of the qualities of YouTube Premium for free, like the picture-in-picture mode (which let videos be watched in a floating window), ad block (which got rid of ads in the app), and background play (which let videos be played as sound in the background). === Other Qualities === Vanced let people use other qualities, like SponsorBlock (which skips sponsor parts inside videos), forced HDR mode along with the VP9 codec, biggest screen size replacement, the ability to swipe the screen to change brightness and loudness, pinch-to-zoom being turned on on all phones, the choice to repeat videos after getting done with them, keeping video quality and speed preferences between videos, the dislike counter being turned back on on videos, and being able to log in using a changed microG. == The Making == The changes in June 2021 gave a new logo as well as fixing glitches with the SponsorBlock and the log in. == References == == Other websites == * Category:2022 disestablishments Category:YouTube",
 "title": "YouTube Vanced"
}