{
 "id": "1067348",
 "text": "Khenthap, also known as Khenet-Hapi, is believed to have been a queen consort during the 1st dynasty. She is thought to have lived during the 1st Dynasty. Not much is known about her because there are no historical records of her from her time. Her name only appears once in a writing that is much later after the 1st dynasty. == Proof of her existence == There is a lot of debate about who Khenthap was. When Egyptologists look at the old things that were written down and saved, like on special stones, there is no mention of her name. But there is one stone called the Palermo stone that has her name on it.Toby Wilkinson: Royal annals of ancient Egypt: the Palermo stone and its associated fragments. Kegan Paul International, London 2000, , p. 105. This stone lists all the kings starting with Narmer (1st dynasty) until Neferirkare (6th dynasty).Toby Wilkinson: Royal annals of ancient Egypt: the Palermo stone and its associated fragments. Kegan Paul International, London 2000, , p. 105. It also tells who the mother of each king was. On this stone, Khenthap’s name is written, but it doesn’t say anything else about her, it just says that she was the mother of Djer.Wolfram Grajetski: Ancient Egyptian Queens: a hieroglyphic dictionary. Golden House Publications, London 2005, , p. 2. == Biography == Khenthap who was described as the mother of King Djer.Aidan Dodson & Dyan Hilton: The Complete Royal Families of Ancient Egypt. Thames & Hudson, London 2004, , p. 48.There are different theories about her relationship to other kings. Joyce Tyldesley believes she was the wife of King Hor-Aha and that her grandson was King Djet.Joyce A. Tyldesley: Chronicle of the Queens of Egypt. Thames & Hudson, London 2006, , p. 29. Silke Roth, on the other hand, thinks that Khenthap was the wife of King Teti I. This king is mentioned in historical records as ruling for only 1 year and 45 days. Khenthap’s name means “musician of (god) Hapi,” which suggests she may have had a religious role in her lifetime. Her name is connected to a god and may link to the king’s title “bull of his mother.”Silke Roth: Die Königsmütter des Alten Ägypten: von der Frühzeit bis zum Ende der 12. Dynastie. Harrassowitz, Wiesbaden 2001, , p. 16–18. == References == Category:Ancient Egyptian queens Category:Queens consort of the First Dynasty of Egypt Category:Ancient Egyptians",
 "title": "Khenthap"
}