{
 "id": "1067325",
 "text": "Pacific Coliseum is an multi-use arena located in Vancouver, British Columbia. The arena does not have a permanent tenant. The arena used to serves as the home for the Vancouver Canucks of the Western Hockey League (WHL), the Vancouver Canucks of the National Hockey League (NHL), the Vancouver Nats of the Western Hockey League (WHL), Vancouver Blazers of the World Hockey Association (WHA), and the Vancouver Giants of the Western Hockey League (WHL). They first started to build the stadium in 1966. The arena opened on January 8, 1968 and the first event were the Ice Capades. The Canucks had their first game in the arena on October 9, 1970. In their first game, they were defeated by the Los Angeles Kings 3–1. The Canucks would play their final game in the arena on May 27, 1995. They would be defeated by the Chicago Blackhawks 4–3 in overtime in the Western Conference Semifinals and be swept out of the 1995 Stanley Cup playoffs. The Canucks would move to the newly- built General Motors Place the next season. Ever since the arena opened, it has never had an official corporate sponsor. On May 1, 1972, a boxing match between Muhammad Ali and George Chuvalo for the NABF heavyweight title would take place. Ali would win by unanimous decision. On September 8, 1972, the fourth game of the Summit Series was held in the arena. Fans would boo after Canada lost to the Soviet Union 5–3. Phil Esposito was disappointed in hearing the boos and said they didn't deserve to be booed. On August 13, 2000, World Championship Wrestling (WCW) held their New Blood Rising pay-per-view at the arena. WWF hosted many shows at the arena including an episode of their weekly television show Monday Night Raw on August 4, 2003. During the 2010 Winter Olympics, Pacific Coliseum was used figure skating and short-track speed skating events. ==References== ==Other websites== * Category:Buildings and structures in Vancouver Category:Olympic venues Category:Sports buildings in Vancouver",
 "title": "Pacific Coliseum"
}