{
 "id": "1067309",
 "text": "Bartholomew Henry Bart Allen II, also known as Impulse, Kid Flash, and the Flash, is a fictional superhero appearing in American comic books published by DC Comics. == Publication history == The character was created by Mark Waid and Mike Wieringo, first appearing in The Flash (Volume 2) #91 (1994). == Fictional character biography == He is a speedster, the original character known as Impulse, the second Kid Flash, and the fourth hero known as the Flash. Originally born in the 30th Century as a descendant of the Allen Family, he traveled back to our time and became a member of the Flash Family. His grandfather is Barry Allen, and his mentors have included Wally West and Jay Garrick, along with Max Mercury. Originally given the codename Impulse for his impulsiveness, he became Kid Flash after learning greater self-control, and eventually the Flash when he grew up further. Bart was killed by the Rogues during Full Throttle, but resurrected as Kid Flash again during Final Crisis, he has been working alongside the other three Flashes since the events of The Flash: Rebirth. He is a founding member of Young Justice and a member of the Teen Titans and Legion of Super-Heroes. In The New 52 reboot, a new character appeared using the same name as the original Bart Allen. Bar Torr was a revolutionary from the 30th Century who was sent back to the 21st Century with no memories from his past. He took the alias Kid Flash and joined Red Robin's Teen Titans. Bart learned the truth of his origins when Johnny Quick exploited his status and sent the Titans to the future. Bar was briefly brought back by the Elite, but returned home to rescue his love interest, fellow Titan Solstice. The original Bart Allen made his return in Flash War as Impulse. == Powers and abilities == Bart's primary power is speed, along with abilities that are common to comics speedsters, such as creating whirlwinds, running on water, and vibrating through matter. The latter ability results in \"molecular taffy\" if Bart does not concentrate; he also possesses an aura, that prevents air friction while running. == In other media == Outside of comics, Bart has been portrayed by Kyle Gallner in the live-action television series Smallville. Jason Marsden voiced the character in the animated series Young Justice. Jordan Fisher portrays a variation of the character as the future son of Barry Allen and Iris West-Allen starting in the seventh season of The CW Arrowverse television series The Flash as a recurring character. Category:DC Comics superheroes",
 "title": "Bart Allen"
}