{
 "id": "1067242",
 "text": "Hor Aha, also known as Horus-Aha, is thought to be the second pharaoh of the First Dynasty of Egypt by some Egyptologists. However, there are others who believe that he was actually the first pharaoh and is the same person as Menes. He lived around the 31st century BC and is believed to have ruled for a long time. == Family == Hor-Aha is generally thought to be son of Neith-hotep and Narmer. His main wife was Benerib.Walter Bryan Emery: Ägypten – Geschichte und Kultur der Frühzeit. S. 47f.Toby A.H. Wilkinson: Early Dynastic Egypt. S. 70 He also had another wife called khenthap who was the mother of his son Djer. ==Identity== ===Name=== The name Hor aha comes from Horus-name, which is linked to the god Horus. It means Horus the Fighter.Edwards 1971 p.13 In Manetho’s Aegyptiaca (History of Egypt), his Greek name is Athothis or “Athotís”. During the Early Dynastic Period, pharaohs were referred to by their Horus-names in the archaeological record. However, historical records like the Turin and Abydos king lists used a different royal title called the nebty-name. The different parts of a pharaoh’s name were sometimes used separately for brevity, depending on the situation and time period.Lloyd 1994: 7Egyptologists agree with Flinders Petrie’s findings that connect Hor-Aha with the nebty-name Ity. ===Theories=== There has been debate about Hor-Aha. Some people think he’s the same person as Menes, who united all of Egypt. Others say he’s the son of Narmer, who united Egypt.Stephan Seidlmayer, The Rise of the State to the Second Dynasty, quoted in Egypt: The World of the Pharaohs, 2004 (translated from German, 2010), Some historians believe Narmer and Menes might have been the same pharaoh, but with different names. Regardless, most historical evidence suggests Narmer was the first pharaoh to unify Egypt, and that Hor-Aha was his son. ==Reign== === Second Pharaoh after Narmer === Hor- Aha is considered the second pharaoh of the first dynasty. Toby A.H. Wilkinson: Early Dynastic Egypt. S. 69–70 Before him, Narmer had brought together Upper Egypt and Lower Egypt into one kingdom. Hor-Aha likely became king around 3100 BC. === His rule inside Egypt === Hor-Aha is known to have done many religious activities. He visited a temple of the goddess Neith.W. M. Flinders Petrie: The Royal Tombs of the Earliest Dynasties 1901, Part II, London 1901, Taf. X,2; XI,2 This temple was in the northwest of the Nile Delta, in a place called Sais.Toby A.H. Wilkinson: Early Dynastic Egypt. S. 291 He also found a special boat called the Henu-barque, which was important to the god Seker.Toby A.H. Wilkinson: Early Dynastic Egypt. S. 301 The ancient Egyptians wrote things on boats, boxes, and clay to keep track of what they had. They also put labels and pictures on things to show who owned them. Some of these labels and pictures were found in the tomb of a queen named Neithhotep and king Hor-Aha. These labels and pictures show that Neithhotep may have died during Hor-Aha's time as king. Hor-Aha buried her in a big tomb that was discovered by a man named Jacques de Morgan.De Morgan Recherches sur les origines de l'Egypte II. Ethnographie préhistorique et tombeau royal de Negadah Some people think that Neithhotep was Hor-Aha's mother.Silke Roth: Die Königsmütter des Alten Ägypten von der Frühzeit bis zum Ende der 12. Dynastie. Wiesbaden 2001, S. 31–35 This would mean that she came from a place called Naqada, which was important in the past. This would also mean that Hor-Aha married a woman from Naqada to help him control that area. But in 2016, some new evidence was found that shows Neithhotep was actually a queen during the time of another king named Djer, who came after Hor-Aha. So the evidence from the tombs only proves that Neithhotep lived during Hor-Aha's time and maybe for a little while after that.Owen Jarus, Live Science, Early Egyptian Queen Revealed in 5,000-Year-Old Hieroglyphs, The most important thing about all of this is that there is now an old tomb at Saqqara, which is near Memphis. This tomb belonged to someone who worked for Hor-Aha, and it shows how important Memphis was becoming during his time as king. === Development of Economy === Hor-Aha was a long time ago, and not many things from his time are left today. But some things that were made during his rule show how skilled the people were. These things include copper axe heads that are very nicely made, pieces of a special kind of glass called faience, small boxes made of ivory, and white stones with writings on them.F. Petrie Abydos, II, London: Egypt Exploration Fund. Memoir 23, A. J. Spencer Early Egypt: The rise of civilisation in the Nile Valley, London: British Museum Press 1993 All of these things show that craftsmen were doing excellent work during Hor-Aha's time as a ruler. === Manetho === The Egyptian priest Manetho, who lived over 2,600 years after Hor-Aha, wrote that Hor-Aha built a palace in the city of Memphis and was also a very skilled doctor who wrote many books about how the human body works. == Tomb == The tomb of Hor-Aha is situated in a place called Umm el-Qa'ab, which is where the ancient Egyptian kings from the first dynasty were buried. It has three big rooms called B10, B15, and B19, which are right next to the tomb of Narmer's. These rooms are dug directly into the ground and have walls made of mud bricks. W. M. Flinders Petrie: The Royal Tombs of the Earliest Dynasties 1901, Part II, London 1901, S. 7–8, Taf. LIX; and more recently: Werner Kaiser: Einige Bemerkungen zur ägyptischen Frühzeit, In: Zeitschrift für Ägyptische Sprache und Altertumskunde 91 (1964), 86–124, and 96–102 One unique feature of Hor-Aha's tomb is that some people from the royal household were buried with him. It's not clear whether they were killed or committed suicide. Some of these people were servants, dwarfs, women, and even dogs. As a symbol of royalty, Hor-Aha was also given a group of young lions.W. M. Flinders Petrie: The Royal Tombs of the Earliest Dynasties 1901, Part II, London 1901, S. 7–8, Taf. LIX; and more recently: Werner Kaiser: Einige Bemerkungen zur ägyptischen Frühzeit, In: Zeitschrift für Ägyptische Sprache und Altertumskunde 91 (1964), 86–124, and 96–102 ==Gallery== File:Kestner Museum 04.jpg|A vessel of Hor-Aha from Saqqara, First Dynasty; Museum August Kestner. File:Ägyptisches Museum Berlin 067.jpg|Copper tool that has the serekh of Hor-Aha, now at the Egyptian Museum of Berlin. File:Benerib.JPG|Ivory label that has the serekh of Hor-Aha and the name of his wife Benerib. File:Ahaplakette.png|Ivory label that has the serekh of Hor- Aha. File:Hor Aha.jpg|label of Hor-Aha relating a visit of the king to the shrine of the goddess Neith of Sais in the Delta, British Museum. File:Label of King Aha.jpg|Label of King Aha, Abydos == References == == General bibliography == * . * . * * * * Toby A. H. Wilkinson, Early Dynastic Egypt, Routledge, London/New York 1999, , 70-71 == Other websites == * Corpus of Wooden and Ivory Labels - Aha by Francesco Raffaele Category:31st-century BC Pharaohs Category:Pharaohs of the First Dynasty of Egypt Category:Ancient Egyptians",
 "title": "Hor-Aha"
}