{
 "id": "1068456",
 "text": "Dinagat Islands or the Province of Dinagat Islands, is a province of Philippines in the Caraga region, situated south of Leyte Gulf. To the west is the island of Leyte, separated by Surigao Strait, and to the south is Mindanao. The main island, Dinagat, spans about 60 kilometers from north to south. The name of the islands mean \"of the sea\" or \"like the sea\", which comes from the root word dagat (\"sea\") in the Visayan languages.Chamberlain, Alexander F. (January–November 1900). \"Philippine Studies. 1. Place-Names\". The American Antiquarian and Oriental Journal. 22: 394–399. == History == The Dinagat Islands used to be part of the First District of Surigao del Norte Province. It became a province on December 2, 2006, with the approval of Republic Act No. 9355. President Gloria Macapagal Arroyo appointed the province's first officials on January 26, 2007. The first elected officials took office on July 1, 2007, after the May 14, 2007 elections. However, on February 11, 2010, the Supreme Court declared the creation of Dinagat Islands Province null and void. This decision was not yet final before the May 10, 2010 elections. The elected officials continued to serve despite legal battles. On April 12, 2011, the Supreme Court reversed its earlier ruling, upholding the constitutionality of Republic Act No. 9355. The legal battles concluded on October 24, 2012, finalizing the separation of Dinagat Islands from Surigao del Norte. == Demographics == In 2020, Dinagat Islands had a population of 128,117 people, with a density of 120 people per square kilometer or 310 people per square mile. The original people of the province are called \"Lumad,\" and residents of Dinagat Islands are known as \"Dinagatnon\". Most people in Dinagat Islands speak Cebuano, but those near Surigao del Norte's maritime border speak Surigaonon. Some areas speak Waray- Waray, Boholano, and Tausug languages. Many residents can also speak varying levels of Tagalog and English. In terms of religion, the majority (53%) follow Catholicism, while the significant minority (23%) Follow the Philippine Independent Church. Other minority religions include Church Body of Christ- Filipinistas (12%), United Church of Christ in the Philippines (4%), Iglesia ni Cristo (4%), Islam and other smaller Christian groups. == References == Category:Dinagat Islands Category:Island provinces of the Philippines Category:Caraga",
 "title": "Dinagat Islands"
}