{
 "id": "1068679",
 "text": "Cleopatra III was a queen of Egypt. She ruled at first with her mother Cleopatra II and husband Ptolemy VIII from 142 to 131 BC and again from 127 to 116 BC. She then ruled with her sons Ptolemy IX and Ptolemy X from 116 to 101 BC. == Life == Cleopatra III's uncle Ptolemy VIII ruled with her parents from around 170 BC to 164 BC. Then, he kicked out Cleopatra II and Ptolemy VI. But Ptolemy VIII later had to leave the throne in 163 BC. Ptolemy VIII by Chris Bennett Clelopatra II and Ptolemy VI took back the throne and ruled for almost 20 years until 145 BC. Cleopatra III was born during this time, between 160 and 155 BC. She had four siblings: Ptolemy Eupator, Cleopatra Thea, Ptolemy VII Neos Philopator, and maybe Berenice. Ptolemy VI died in 145 BC because he got hurt when he fell off his horse during a battle against Alexander Balas. After that, Cleopatra III's uncle Ptolemy VIII became the king of Egypt again.Aidan Dodson, Dyan Hilton, The Complete Royal Families of Ancient Egypt, 2004 === Joint rule with her mother and husband === In the year 145 BC, Ptolemy VIII married Cleopatra II's mom. Later, around 139 BC, he married Cleopatra III. Cleopatra II didn't like Ptolemy VIII, so she rebelled against him around 132 BC. Cleopatra III had to leave Alexandria and go to Cyprus with her husband in 130 BC. But in 127 BC, she was able to go back to Alexandria. Around 124 BC, Cleopatra III and her husband were living with Cleopatra II again as joint rulers. === Joint rule with her sons === In the year 116 BC, Ptolemy VIII died. After that, Cleopatra III ruled with her mother Cleopatra II and her son Ptolemy IX. Cleopatra II died that year or early the next year (115 BC).Ptolemy VIII by Chris Bennett Cleopatra III made Ptolemy IX leave Alexandria in the year 107 BC and replaced him with her second son, Ptolemy X. They ruled together for six years. After that, Ptolemy X killed his mother Cleopatra III in the year 101 BC. Cleopatra III was then succeeded by Ptolemy X, possibly ruling together with his wife Berenice III, who was the granddaughter of Cleopatra III.Aidan Dodson, Dyan Hilton, The Complete Royal Families of Ancient Egypt, 2004 == References == Category:100s BC Category:160s BC births Category:Ancient Egyptian queens",
 "title": "Cleopatra III"
}