{
 "id": "1068134",
 "text": "Donovan Danhausen (born August 17, 1990) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and competes under the ring name Danhausen. He has also spent time wrestling in Ring of Honor (ROH) and Full Impact Pro (FIP). ==Career== ===All Elite Wrestling=== On January 26, 2022, Danhausen made his surprise debut with All Elite Wrestling (AEW) at Beach Break. He debuted during the Lights Out match between Adam Cole and Orange Cassidy. Cole pulled out a table out from under the ring that had Danhausen on it. AEW owner Tony Khan announced later in the night that Danhausen had signed an official contract to become a member of the AEW roster. Danhausen then tried and failed to curse Hook. On the May 6 episode of Rampage, he would try and get Hook to team with him against Tony Nese. Hook refused and Danhausen tried to become friends with Hook by giving him a bag of chips. Hook took the chips and leave. On the May 11 episode of Dynamite, Danhausen made his AEW in-ring debut, losing in 32 seconds after an outside distraction from \"Smart\" Mark Sterling. After the match, Nese beat down Danhausen, but Hook ran in to make the save before shaking hands with Danhausen. At the Buy In for Double or Nothing, Hookhausen (Danhausen and Hook) teamed up and defeated the team of Tony Nese and \"Smart\" Mark Sterling. This game Danhausen his first victory in AEW. At Fight for the Fallen, Danhausen challenged Ricky Starks for the FTW Championship but lost. He then competed in a Grand Slam Golden Ticket Battle Royal to determine who would become the number one contender for the AEW World Championship. The match was by \"Hangman\" Adam Page. Danhausen then decided to join the Best Friends stable. On March 5, 2023 at Revolution, Danhausen teamed with Orange Cassidy, competing in a four-way tag team match for the AEW World Tag Team Championships. The match was won by The Gunns (Austin and Colten Gunn). ==Championships and accomplishments== *All Elite Wrestling **Casino Tag Team Battle Royale (2023) – with Orange Cassidy *Black Label Pro **BLP Tag Team Championship (1 time) – with Ethan Page and Swoggle *Full Impact Pro **FIP Florida Heritage Championship (1 time) *Metro Wrestling Alliance **MWA Michigan Championship (1 time) * Pro Wrestling Illustrated ** Ranked No. 158 of the top 500 singles wrestlers in the PWI 500 in 2020 ** Ranked No. 171 of the top 500 singles wrestlers in the PWI 500 in 2021 *Ring of Honor **ROH Year-End Award (1 time) ***Best New Star (2020) == References == == Other websites == * Category:1990 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Sportspeople from Detroit",
 "title": "Danhausen"
}