{
 "id": "1068122",
 "text": "Alexander Helios was a Ptolemaic prince and the son of Cleopatra VII and Mark Antony. Alexander had a twin sister named Cleopatra Selene II. Both of their names had special meanings; Alexander's last name (Helios) means \"Sun,\" and his sister's last name (Selene) means \"Moon.\" Cleopatra named her son after the famous leader Alexander the Great. It's not known exactly when Alexander died, but it might have been between the years 29 and 25 BC. == Life == Alexander Helios was born in Alexandria around 40 BC. He was the second son of Cleopatra. Around 34 BC Cleopatra and her husband, Mark Antony, gave Alexander the titles of ruler of Armenia, Media, Parthia, and any lands between the Euphrates and Indus River that were still not discovered. However, these lands were already ruled by other people at that time.Plutarch, Antony 54.6-9; Cassius Dio xlix. 41.1-3; Livy, periochae 131 In 33 BC, Alexander got engaged to Iotapa, a princess from Media. Her father was Artavasdes I. When Mark Antony and Cleopatra lost battle of Actium in 31 BC, They killed themselves and Lotapa left Egypt to go back to her father.Cassius Dio xlix. 40.2; xlix. 44.1-4; li. 16.2; Plutarch, Antony 53.12 When Augustus won against Cleopatra and Mark Antony, he didn't hurt Alexander or his siblings. Instead, he took them from Egypt to Rome. He gave the children to his sister Octavia Minor to take care of. Octavia took good care of them and taught them well.Cassius Dio li. 21.8Plutarch, Antony 87.1; Suetonius, Augustus 17.5 === Later life === The only other information we have about Alexander Helios and his brother Ptolemy Philadelphus when they arrived at Rome is from Cassius Dio books. Cassius Dio explained that when Cleopatra Selene II married King Juba II, Augustus allowed Alexander and Ptolemy to live because of the marriage.Cassius Dio li. 15.6; compare Plutarch, Antony 87.1-2 Alexander is not mentioned in any more historical records after that. == References == ==Sources== * * Cleopatra Selene II & Juba II * Plutarch - Antony Category:20s BC deaths Category:Year of death unknown",
 "title": "Alexander Helios"
}