{
 "id": "1068314",
 "text": "Luzmila Mercedes Abad Morocho (Azogues, September 4, 1978) is an Ecuadorian activist and politician. She is recognized for her prominent role in the Amazonian women's network and her foundational contribution to the Plurinational Movement Pachakutik party. She currently serves as a legislator for the province of Morona Santiago. Abad has stood out as one of the most active legislators in the Plenary, according to the Legislative Observatory, ranking first in legislative requests among 137 legislators, with a total of 437 requests. == Biography == Luzmila Mercedes was born on September 4, 1978, in the rural parish of Luis Cordero, in the Ecuadorian canton of Azogues. She is the first-born daughter of Segundo José Abad and Delia Morocho. Although her parents resided in Chupianza, where she was conceived, public health reasons led to her birth taking place in \"Cañar – El Cordero.\" Her birth certificate reflects El Cordero as her place of birth, but her identity has always been tied to Chupianza, being an integral part of the canton of Santiago de Méndez. From a young age, she showed a commitment to social activism, encouraging women to fight for their rights from her motherhood at the age of 15. Her upbringing was deeply influenced by the rich Shuar-Achuar culture, and from an early age, she demonstrated a strong bond with her community. She completed her education at the Julio Matovelle school in Chupiantza Chico and the Logroño agricultural technical school, earning her high school diploma in agriculture. Although she faced interruptions, her educational journey included studies at ESPE University of the Armed Forces, Instituto Intel Com, and later a degree in business administration, currently in the final phase. Contributions Her involvement was prominent in national events, such as the release of Pepe Acacho during Rafael Correa government. She facilitated the process for the first-time registration of a Shuar, Marcelino Chumpi, as the prefect of Morona Santiago. She also played a significant role in the election of Tiyua Uyunkar as the first Achuar prefect. She was involved in defending civil rights after the death of Bosco Wisum, leader of the Shuar nation. As an activist, she advocated for the promotion and protection of children's rights, contributing to improving the living conditions of children in the region. She currently leads the Amazonian women's network. == Political Career == She began her career in 2005 as a political lieutenant in Patuca, and in 2007, she worked as a secretary in the Morona Santiago Prefecture during Jaime Mejía's term. With 28 years of experience in Pachakutik and 16 years in the provincial government of Morona Santiago, Abad held key roles, including assistant, communicator, and secretary. Her experience covered essential areas of government administration and oversight, establishing her as an expert in citizen participation. === Assembly Member === She resigned from her position on June 7, 2023, motivated by the cross-death decree issued by President Guillermo Lasso, to participate in the general elections for the Assembly. == Legislative Activity == Abad was appointed as Vice President of the Occasional Commission tasked with investigating the femicide of Pamela Ati. She was also part of the commission investigating the murder of Fernando Villavicencio. The assembly member promoted the approval of laws focused on territorial and educational development in the Amazon.https://kchcomunicacion.com/2024/09/12/comision-por- la-verdad-la-justicia-y-reparacion-del-caso-aidita-ati-eligio-a-su-presidenta- y-vicepresidenta/ Law Description Status Cantonization No. 13 Sevilla Don Bosco Creation of canton number 222 in Ecuador.https://ecuador221.com.ec/asamblea-nacional-crea-el-canton-sevilla- don-bosco-el-numero-222/ Approved Amazonian Law Requires the creation of universities in the Amazon region, with a deadline of July 5, 2025. Includes the implementation of one in Morona Santiago. Approved === Bills Presented === During her tenure, the assembly member presented five bills, covering issues such as investment, agricultural production, labor rights, and taxation in the Amazon. Bill Description Status Free and Informed Consultation Law in Strategic Sectors Regulates investments in strategic sectors to protect natural resources. In Progress Reform to the Law of Planning and Development of the Amazonian Special Territorial Circumscription (CTEA) Seeks to correct legal gaps in the taxation of oil destined for internal consumption in Amazonian provinces. In Progress Reform to the Organic Law of Personnel and Discipline of the Armed Forces Introduces modifications to the military disciplinary regime. In Progress Special Retirement Law for the Fire Department Proposes early retirement for firefighters with catastrophic diseases or amputations. In Progress Bill for the Promotion of Pitahaya Production Promotes incentives for small producers in the canton of Palora, protecting local labor. In Progress === Legislative Management and Participation === The main focus of her legislative work has been security, education, health, and employment, with special emphasis on the development of the province of Morona Santiago. Indicator Amount National Position Legislative requests made 437 1st place among 137 assembly members.https://observatoriolegislativo.ec/perfil/luzmila-abad/ Amazonian Law 433 High legislative management. Laws approved with her intervention 38 Focus on regional development and social rights. Interventions in the Plenary 31 Active participation in debates. == References == Category:1978 births Category:Living people",
 "title": "Luzmila Abad"
}