{
 "id": "1068154",
 "text": "Daniel Garcia (born September 17, 1998) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW). He also wrestles for their sister promotion Ring of Honor (ROH) and for Pro Wrestling Guerrilla (PWG). Garcia is a the current AEW TNT Champion and PWG World Champion (both in his first reign), the winner of the 2022 Battle of Los Angeles, and a former one-time ROH Pure Champion. ==Career== ===All Elite Wrestling=== On the September 22, 2020 episode of Dark, Garcia made his debut with All Elite Wrestling (AEW). He teamed with Kevin Blackwood and they were defeated by the team of Joey Janela and Sonny Kiss. On October 19, 2021, it was announced by AEW owner Tony Khan that Garcia had signed a full-time contract to become a member of the AEW roster. On the August 10 episode of Dark, Garcia beat Fuego Del Sol to earn his first victory in AEW. On the January 12, 2022 episode of Dynamite, Garcia faced Sammy Guevara for the interim AEW TNT Championship but was defeated. On the March 9 episode of Dynamite, Garcia formed a stable with Chris Jericho called the Jericho Appreciation Society. On the June 8 episode of Dynamite, Garcia competed in a Casino Battle Royale to determine who would become the number two contender for the interim AEW World Championship. The winner would face Jon Moxley in the main event of Dynamite to see who would represent AEW at Forbidden Door. The match was eventually won by Kyle O'Reilly. On the September 7 epside of Dynamite, Garcia defeated Wheeler Yuta to become the new ROH Pure Champion. On September 23 Garcia competed in a Grand Slam Golden Ticket Battle Royal to determine the number one contender for the AEW World Championship. The match was won by \"Hangman\" Adam Page. At ROH Final Battle on December 10, Garcia lost the ROH Pure Championship back to Wheeler Yuta. On the November 8, 2023 episode of Dynamite, Garcia challenged Maxwell Jacob Friedman for the AEW World Championship but was defeated. On the February 21, 2024 episode of Dynamite, it was announced that Garcia would get a TNT championship match on March 3 at Revolutionhttps://www.fightful.com/wrestling/daniel-garcia-challenge- christian-cage-aew-tnt-title-aew-revolution On November 23 at Full Gear, Garcia defeated Jack Perry to win the AEW TNT Championship, his first championship in AEW. ==Championships and accomplishments== * All Elite Wrestling ** AEW TNT Championship (1 time, current) * Capital City Championship Combat ** C4 Championship (1 time) * Empire State Wrestling ** ESW Heavyweight Championship (1 time) * ESPN ** Ranked No. 29 of the 30 best Pro Wrestlers Under 30 in 2023 * Limitless Wrestling ** Limitless World Championship (1 time) * Pro Wrestling Guerrilla ** PWG World Championship (1 time, current) ** Battle of Los Angeles (2022) * Pro Wrestling Illustrated **Ranked No. 69 of the top 500 singles wrestlers in the PWI 500 in 2023 * Ring of Honor ** ROH Pure Championship (1 time) == References == == Other websites == * Category:1998 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Sportspeople from Buffalo, New York",
 "title": "Daniel Garcia (wrestler)"
}