{
 "id": "1068464",
 "text": "Human development begins with the fertilization of a female's egg. The resulting zygote develops through mitosis and cell differentiation. The resulting embryo then sticks (implants) in the uterus. The embryo continues development after birth. This includes both physical and psychological development. It is influenced by genetic, hormonal, environmental, and other factors. Above all, humans have a brain which continues to grow after birth. That is how the species differs from the apes. It is the \"solution\" to the fact that a fully grown babies' heads would be too large to pass through the mother's birth canal.The editors of Encyclopaedia Britannica. \"Human body/Basic form and development\". Encyclopedia Britannica. Archived from the original on 2019-10-31. Retrieved 2020-04-08.Kail R.V. & Cavanaugh J.C. 2010. Human development: a lifespan view (5th ed). Cengage Learning, p296. ISBN 978-0495600374 It may be that the drying of the African climate played a part because it presented grassland instead of forests in many areas. Starting towards the end of the Miocene, African climate (which had been wet) became much drier. That offered a chance to proto-humans to move out of the forests onto the grassland. We know the climatic change took place because all the animals changed with it. Older types of (for example) elephants were replaced by elephants which had teeth suitable for eating grass.Wolfram M. Kürschner, Zlatko Kvacek & David L. Dilcher 2008. The impact of Miocene atmospheric carbon dioxide fluctuations on climate and the evolution of terrestrial ecosystems. Proceedings of the National Academy of Sciences 105 (2): 449–53. Bibcode:2008PNAS..105..449K. doi:10.1073/pnas.0708588105. PMC 2206556. PMID 18174330. The change to a dryer climate happened more widely than just Africa. The Americas and Asia were also drier, and had faunal replacement also. == References == Category:Human life stages Category:Miocene",
 "title": "Human development (biology)"
}