{
 "id": "1068769",
 "text": "Luis von Ahn (born August 19, 1978) is a Guatemalan entrepreneur and a professor at Carnegie Mellon University. He is known for his work in crowdsourcing, and he founded reCAPTCHA, later sold to Google, and Duolingo. == Early Life and Education == Von Ahn was born in Guatemala City to a well- off family. His mother, a pioneering woman in Guatemala's medical field, had him at age 42. He attended the American School of Guatemala and developed an early interest in technology. Von Ahn studied at Duke University, earning a Bachelor's degree in Mathematics in 2000, and later received a PhD in Computer Science from Carnegie Mellon University in 2005. == Career and Research == Initially working in cryptography, von Ahn gained fame for his work on CAPTCHAs, tests used to prevent automated abuse on websites. His PhD introduced the concept of \"human computation,\" combining human and computer power to solve problems. He developed games like the ESP Game, later licensed by Google. In 2007, he created reCAPTCHA, a CAPTCHA that digitizes books. == Duolingo == In 2009, von Ahn co-founded Duolingo, a language education platform. Duolingo saw increased users during the COVID-19 pandemic and, as of May 2020, was valued at $1.5 billion. == Awards and Honors == Von Ahn's work on CAPTCHAs and human computation earned him several awards, including a MacArthur Fellowship in 2006. He received recognition from various sources, such as being named one of the 50 Best Brains in Science and being awarded the Lemelson-MIT prize in 2018. == Teaching == Von Ahn has won teaching awards at Carnegie Mellon University. He taught a course titled \"Science of the Web\" that combined graph theory and social science. == Philanthropy == In 2021, von Ahn established the Luis von Ahn Foundation to support Guatemalans, especially women and girls, through financial aid to local leaders and nonprofit organizations. In 2022, the foundation planned to donate $3 million to organizations focusing on women's and girls' equality, environmental conservation, democracy, and youth participation. == References == Category:1978 births Category:Living people Category:North American businesspeople Category:Philanthropists Category:People from Guatemala City",
 "title": "Luis von Ahn"
}