{
 "id": "1068927",
 "text": "Interstella 5555 (full name: Interstella 5555: The 5tory of the 5ecret 5tar 5ystem) is a movie about Daft Punk trying to place their album Discovery in the track list of a movie. In their childhood, Daft Punk members Guy-Manuel de Homem-Christo and Thomas Bangalter were big fans of Space Pirate Captain Harlock. The band worked with the creator of the series, Leiji Matsumoto, and the Japanese animation company, Toei Animation, to make the movie. Interstella 5555 is set to the band's album Discovery album with no additional words and only a few added sound effects. == Plot == In the movie, we follow the story of a music group from a distant planet. The group attracts the attention of aliens, who can be seen dancing to their song \"One More Time\". The group of aliens catches the eye of Earthlings. However, they are malicious, and they come to the planet to kidnap the musicians, before transforming them into humans. Their appearances change, and their memories are altered. The artists will do everything to find their native land, helped by an extraterrestrial who has come to Earth. == Creation == The idea for the film emerged one day in the minds of the two artists, influenced by famous Japanese anime from the 1970s and 1980s. Their love for these works pushed them to fly to Japan. “We then begin, in parallel with the music, the writing of the story with our friend and collaborator Cédric Hervet, all three lulled as children by Albator and his poetic and enigmatic universe, we dream of an uncertain collaboration with Leiji Matsumoto, and we flew to meet him in the summer of 2000 with our album and the completed synopsis under our arms\", explained the members of Daft Punk. This trip paid off since the film was supervised by the creator of Albator and Galaxy Express 999 himself, Leiji Matsumoto. This explains the resemblance between the character designs of his characters and the protagonists of Interstella 5555. The members of the duo have always had a strong admiration for the work of Mr. Matsumoto, Albator having marked their youth. The manga was won over by the project of the famous electro group on the rise. “The day Thomas and Guy-Manuel asked me to imagine a visual universe based on their music, I was delighted. […] I saw in their proposal a wink of destiny. It is for me a childhood dream to offer my visions to a wide audience. I didn't really believe in it anymore, and then, at the dawn of the 21st century, Daft Punk came to find me! They told me they discovered Albator when he was 5 years old. This is the age where we imprint what will influence us for the rest of our lives. == References == == Other website == * * Category:2003 movies Category:Anime movies",
 "title": "Interstella 5555"
}