{
 "id": "1068636",
 "text": "Carlos Muñoz González (born 1991) is a Mexican masked luchador. He is better known by his ring name Dralístico. He currently wrestles for All Elite Wrestling (AEW). He also wrestles for their sister promotion Ring of Honor (ROH) and Lucha Libre AAA Worldwide (AAA). Dralístico has previously wrestled for Consejo Mundial de Lucha Libre (CMLL). In CMLL, he wrestled under the ring names Dragon Lee and Místico. He wrestled under the mask and name of Místico after the original Místico went to WWE as Sin Cara. During his time in AAA, Dralístico was a one-time AAA World Tag Team Champion. In CMLL, he was a one- time CMLL World Tag Team Champion, two-time CMLL World Trios Champion, and a one-time CMLL World Welterweight Champion. ==Career== ===Lucha Libre AAA Worldwide=== On September 4, 2021, Dralístico was announced as a new member of the stable La Facción Ingobernable. At Héroes Inmortales XIV on October 9, he made his Lucha Libre AAA Worldwide (AAA) debut. At Noche de Campeones, Hermanos Lee (Dragon Lee & Dralistico) would defeat FTR (Dax Harwood and Cash Wheeler) to become the new AAA World Tag Team Champions. When Dragon Lee announced he was signing with WWE, Hermanos Lee vacated the championships. ===All Elite Wrestling=== On December 23, 2022 at Holiday Bash, Dralístico made his All Elite Wrestling (AEW) debut. He teamed with La Facción Ingobernable and they competed in the $300,000 Three Kings Christmas Casino Trios Battle Royal. The match was won by Top Flight (Dante and Darius Martin) and AR Fox. On the December 26 episode of Dark: Elevation, Dralístico won his first match in AEW when he defeated Blake Christian. At Battle Of The Belts VI, he challenged Orange Cassidy for his AEW International Championship but would lose. At Full Gear, Dralístico and Rush competed in a four-way tag team ladder match for the AEW World Tag Team Championships but lost. ==Personal life== González's father Arturo Muñoz Sánchez was also a professional wrestler and performed under the names Toro Blanco, Poder Boriqua, Poder Mexico, Comandante Pierroth, and La Bestia del Ring. Both his older and younger brothers are also professional wrestlers. They compete under the ring names Rush and Dragon Lee respectively. ==Championships and accomplishments== *Consejo Mundial de Lucha Libre ** CMLL World Tag Team Championship (1 time) – with Carístico **CMLL World Trios Championship (2 times) – with Máscara Dorada and Valiente (1), and Valiente and Volador Jr. (1) **CMLL World Welterweight Championship (1 time) **CMLL Bodybuilding Contest – Beginners (2010) **Copa 60 Aniversario de la Arena Puebla (2013) **Torneo Increíble de Parejas (2016) - with Mephisto **Torneo Sangre Nueva (2012) *Kaoz Lucha Libre **Kaoz Tag Team Championship (1 time) - with Dragon Lee *Lucha Libre Azteca **Azteca Championship (1 time) *Lucha Libre AAA Worldwide **AAA World Tag Team Championship (1 time) - with Dragon Lee *New Japan Pro-Wrestling **Torneo de Parejas Familiares (2019) – with Dragon Lee *Pro Wrestling Illustrated ** Ranked No. 119 of the top 500 singles wrestlers in the PWI 500 in 2021 *Pro Wrestling Revolution **PWR Tag Team Championship (1 time) - with Dragon Lee * The Crash Lucha Libre ** The Crash Tag Team Championship (1 time) - with Dragon Lee == References == ==Other websites== * Category:1991 births Category:Living people Category:All Elite Wrestling people Category:Mexican professional wrestlers Category:People from Jalisco",
 "title": "Dragon Lee (wrestler)"
}