{
 "id": "1068047",
 "text": "Nurgali A. Arystanov is the Extraordinary and Plenipotentiary Ambassador of the Republic of Kazakhstan to the Republic of Korea. Born on May 31, 1978, in the Kyzylorda region. Graduated from the Kazakh State National University named after al-Farabi and Johns Hopkins University (USA). He began his diplomatic career in 1999 as a Referent to the Department of Bilateral Cooperation of the Ministry of Foreign Affairs of the Republic of Kazakhstan. In 2000, he went to work at the Embassy of Kazakhstan in Pakistan, where until 2004 he held the positions of Referent, Attaché, and Third Secretary. From 2004 to 2005 he worked as the Second secretary of the Department of Asia and Africa of the Ministry of Foreign Affairs of the Republic of Kazakhstan. In 2005-2009 - the Second and First Secretary of the Embassy of the Republic of Kazakhstan in India. From 2009 to 2010 - First Secretary, Counsellor to the Americas Department of the Ministry of Foreign Affairs of the Republic of Kazakhstan. In 2010-2017 he was the First Secretary and Counsellor of the Embassy of the Republic of Kazakhstan in the United States. From 2017, he worked in the Central Office of the Ministry of Foreign Affairs of the Republic of Kazakhstan and until 2019 was the Head of the department and deputy director of the Americas Department of the Ministry of Foreign Affairs of the Republic of Kazakhstan. From October to December 2019, he served as Director of the Department for Asian Cooperation of the Ministry of Foreign Affairs of the Republic of Kazakhstan. From 2019 to 2021, he was the Director of the Asia-Pacific Region Department of the Ministry of Foreign Affairs of the Republic of Kazakhstan. Before he was appointed the Ambassador of the Republic of Kazakhstan to the Republic of Korea, in 2021 he was the Director of the Americas Department of the Ministry of Foreign Affairs of the Republic of Kazakhstan. He has the diplomatic rank of Extraordinary and Plenipotentiary Envoy of the II class. Speaks English. Category:Kazakhstani people Category:Ambassadors Category:1978 births Category:Living people",
 "title": "Nurgali Arystanov"
}