{
 "id": "1068585",
 "text": "Vulture crown is a crown that the great royal wives and important priestesses in ancient Egypt wore. It was connected with the vulture goddess Nekhbet. It looked like a vulture with wings hanging down on the sides. Graves-Brown, Carolyn, Dancing for Hathor: Women in Ancient Egypt, Contiuum 2010, p. 131 The crown was a symbol of protection. Sometimes the hat had another snake called the Uraeus on it too. This snake represented a goddess called Wadjet. Capel, Anne K.; Markoe, Glenn, Mistress of the House, Mistress of Heaven: Women in Ancient Egypt, Hudson Hills Press with Cincinnati Art Museum 1996, p. 139 == History == In the beginning, the vulture crown was only shown in pictures of goddesses.Vassilika, Eleni, Ptolemaic Philae, Uitgeverij Peeters 1989, p. 93 But in the Fifth Dynasty, queens began to wear this crown all the time in their pictures.Redford, Donald B., The Oxford Encyclopedia of Ancient Egypt: P-Z, Oxford Univ Pr (Sd) 2001, p. 106 The reason why queens wore the vulture crown was because the vulture is a symbol of motherhood. In ancient Egyptian, the word for \"mother\" is written with a picture of a vulture called mwt.Lesko, Barbara S., The Great Goddesses of Egypt, OUP 1999, p. 66 As Nekhbet was a goddess who protected people, the vulture crown was connected with her. This made sense because the king was seen as a Horus, and the queen's role was seen as a protector.Benard, Elisabeth; Moon, Beverly, Goddesses Who Rule, Oxford University Press 2000, p. 216 One of the first queens to wear the vulture crown was Khentkaus Ii.Budin, Stephanie Lynn, Images of Woman and Child from the Bronze Age: Reconsidering Fertility, Maternity, And Gender In The Ancient World, Cambridge University Press 2014, p. 47 In the New Kingdom, the vulture on the top of the crown was sometimes changed by a snake called uraeus.Fischer, Henry George, Egyptian Studies III Varia Nova, Metropolitan Museum of Art 1996, p. 116 == References == Category:Ancient Egypt",
 "title": "Vulture crown"
}