{
 "id": "1068145",
 "text": "Gordian III was the youngest emperor of the Roman Empire who ruled alone. He was only 13 years old when he became emperor and ruled from 238 to 244 AD. His father was Junius Balbus and his mother was Antonia Gordiana. == Becoming Emperor == In 235 AD, a man named Maximinus became emperor after Alexander Severus died. The Roman Senate didn't like Maximinus, so when a rebellion started in Africa Province in 238, Gordian III's grandfather and uncle became emperors together because of the rebellion. The governor of Numidia, who supported Maximinus, ended the rebellion quickly. Later, the Roman Senate chose two new emperors named Pupienus and Balbinus. They also made Gordian III a Caesar. Mximinus attacked Pupienus and Balbinus, but his army were not able to move through the mountains during winter. Maximinus army didn't have supplies after being there for four weeks, which made his soldiers unhappy and afraid. As a result, the second Parthian legion, which was a part of Maximinus' army, turned against him and killed him. Things were still bad for Pupienus and Balbinus because of many problems such as violence from military and a big fire in Rome in June 238. The next month, Pupienus and Balbinus were killed by the Praetorian Guard, and Gordian III became the emperor of Rome alone. == Reign == When Gordian became emperor, he was young, so the rich families in Rome took control of the government through the Senate. In 240, a man named Sabinianus rebelled in Africa Province, but he quickly lost. Gordian married a woman named Furia Sabinia Tranquillina. Her father, Timesitheus, became the leader of the soldiers who protected the emperor. He became very powerful and acted like the real ruler of Rome. During Gordian's time as emperor, there were many strong earthquakes. The earthquakes were so bad that cities fell and were destroyed. Gordian read some old books for advice about what to do. In the third century, the borders of Rome were not strong against attacks from Germanic tribes and the Sassanid Empire. Shapur, the ruler of the Sassanid Empire, invaded Mesopotamia. Gordian sent a large army to fight them. The Sassanids lost and were forced to go back across the Euphrates River. Gordian wanted to invade their land, but his wife's father died in an unknown way. This made it dangerous for Gordian and his army. The soldiers were happy that Gordian won and he had a big celebration. Two men named Gaius Julius Priscus and Philip the Arab became the new leaders of the soldiers who protected the emperor after Gordian wife's father died. Philip and Priscus helped Gordian start a second war against Shapur. The Sassanids fought back very strongly near a place called Ctesiphon. It is not clear what happened to Gordian after this battle. Some Roman sources say that Philip made peace with Shapur in a way that was bad for Rome, and that Gordian died while they were leaving for home. Zonaras says that Gordian died when he fell off his horse during a battle. Shapur wrote that there was a big battle near Fallujah (Iraq), which resulted in a big Roman defeat and the death of Gordian III. Some people think that Gordian died at Zaitha because he was murdered by his angry soldiers. It is said that Philip brought Gordian's body back to Rome and made him a god. == References == ==Sources== * * * * * * * * * * * * * * * * Category:3rd-century Roman emperors Category:200s births",
 "title": "Gordian III"
}