{
 "id": "1068588",
 "text": "An antitoxin is an antibody that can neutralize a specific toxin (or poison). Certain plants, animals, and bacteria produce them, when they are exposed to a toxin. Antitoxins can also be injected into another organism, as a treatment against an infectious disease. To produce an antitoxin, a safe dose of a toxin is injected into an animal. The animal will then produce an antitoxin. Later, blood is taken from the animal, and the antitoxin is extracted from it. It will be purified, and can be used. == History of antitoxin == Antitoxins to diphtheria and tetanus toxins were produced by Emil Adolf von Behring and his colleagues from 1890 onwards. The use of diphtheria antitoxin for the treatment of diphtheria was regarded by The Lancet as the \"most important advance of the [19th] Century in the medical treatment of acute infectious disease\". In 1888, Behring was sent to Berlin for a brief service at the Academy for Military Medicine. In 1889, he joined the Institute for Hygiene of the University of Berlin, then headed by Robert Koch. Between 1889 and 1895, Behring developed his pioneering ideas on serum therapy and his theory of antitoxins. Early 1887, in Bonn, Behring had found that the serum of tetanus- immune white rats contained a substance that neutralized anthrax bacilli. He recognized this as the source of their \"resistance\". On 4 December 1890, Behring and Kitasato Shibasaburō published their first paper on blood-serum therapy. On 11 December, another report, signed by Behring, discussed blood- serum therapy not only in the treatment of tetanus, but also in diphtheria. When Paul Ehrlich demonstrated in 1891 that even vegetable poisons led to the formation of antitoxins in an organism, Behring's theory was confirmed. Antitoxins are antibody proteins found within the serum of animals that have been injected with the toxin. Separating unnecessary proteins from the antibodies used to counter infections in medical practice is important to increase both potency of antitoxin doses and to reduced the incidence of serum sickness. Annie Homer, working in Canada during the First World War, undertook research into antitoxic sera, which resulted in innovative methods to manufacture high quality antitoxin protein fractions from serum. == Scarlet Fever == An antitoxin for scarlet fever was developed in 1924 and discontinued due to poor effectiveness and the new invention of antibiotics. The discovery of penicillin and its subsequent widespread use significantly reduced the mortality of this once-feared disease. The first toxin which causes this disease was cloned and sequenced in 1986 by Weeks and Ferretti. There used to be a diphtheria scarlet fever vaccine. It was, however, found not to be effective. This product was discontinued by the end of World War II. === The Dick test === The Dick test, developed in 1924 by George F. Dick and Gladys Dick, was used to identify those susceptible to scarlet fever. The Dick test involved injecting a diluted strain of the streptococci known to cause scarlet fever; a reaction in the skin at the injection site identified people susceptible to developing scarlet fever. The reaction could be seen four hours after the injection, but was more noticeable after 24 hours. If no reaction was seen in the skin, then the person was assumed not to be at risk from the disease, having developed immunity to it. File:Gladys Rowena Henry Dick (1881-1963).jpg|Gladys Henry Dick (pictured) and George Frederick Dick developed an antitoxin and vaccine for scarlet fever in 1924 which were later eclipsed by penicillin in the 1940s. == References == Category:Medicine stubs Category:Medicine",
 "title": "Antitoxin"
}