{
 "id": "1068236",
 "text": "Gamora Zen Whoberi Ben Titan is a fictional character portrayed primarily by Zoe Saldaña in the Marvel Cinematic Universe (MCU) media franchise, based on the Marvel Comics character of the same name. She was a former Zehoberei assassin and a former member of the Guardians of the Galaxy. She became the adopted daughter of Thanos and adopted sister of Nebula after Thanos killed half of her race. Gamora served him for years before betraying him in an attempt to free herself from his ways. She was hired to steal the Orb, and after becoming involved in the Quest for the Orb, she befriended the other members of the Guardians of the Galaxy. After the Battle of Xandar, she left to work with them all. Having made a deal with the Sovereign to kill the Abilisk, Gamora was able to regain custody of Nebula with the intention of finally bringing her to justice in Xandar. However, her mission to punish Nebula was delayed when Gamora and the Guardians came into contact with Ego, the long-lost father of Star-Lord. While Ego claimed he simply wanted to bond with his son, Gamora was suspicious and, alongside Nebula who had freed herself, discovered Ego's evil intentions to destroy and rebuild the universe. Upon this discovery, the Guardians teamed up to destroy the living planet, succeeding with the help of Mantis, who joined the group, but at the cost of Yondu Udonta sacrificing his life. After Udonta's death, Gamora finally confessed that she had romantic feelings for Star-Lord and started a relationship with him. Four years later, Gamora and the Guardians intercepted a distress call sent by Asgardians; Thor warned them that Thanos had begun searching for the Infinity Stones himself. Realizing what Thanos intended to do with them, Gamora led her friends to Knowhere to procure the Aether, only for both it and Gamora to be captured by Thanos himself. Thanos took Gamora to Vormir, where he sacrificed her against her will in order to obtain the Soul Stone, a process that trapped Gamora's soul inside the Soulworld. As of 2023, Gamora has appeared in five films in the MCU. The character and Saldaña's portrayal have been met with positive reception. Alternate versions of Gamora from within the MCU multiverse appear in Avengers: Endgame (2019), Guardians of the Galaxy Vol. 3 (2023), and in the animated series What If...? (2021). A younger version of the character is portrayed by actress Ariana Greenblatt. One version, voiced by Cynthia McWilliams, usurped Thanos's warlord position and is recruited into the Guardians of the Multiverse by the Watcher to help defeat an alternate version of Ultron. == Appearances == === Movie appearances === Year Movie Portrayed by 2014 Guardians of the Galaxy Zoe Saldaña 2017 Guardians of the Galaxy Vol. 2 2018 Avengers: Infinity War 2019 Avengers: Endgame 2023 Guardians of the Galaxy Vol. 3 === Television appearances === Year Television series Seasons Episodes Portrayed by 2021-2024 What If...? 3 26 Cynthia McWilliams (voice) Category:Marvel Cinematic Universe characters Category:Marvel Comics movie characters",
 "title": "Gamora (Marvel Cinematic Universe)"
}