{
 "id": "1068725",
 "text": "The Allianz Stadion ( Weststadion in UEFA competitions and in everyday usage) is a football stadium in the 14th district of Penzing in Vienna. It was built on the site of the Gerhard Hanappi Stadium as the new home of SK Rapid Vienna. The stadium was built from 2014 to 2016 and is in use since the 2016/17 season. ==Stadium== The total costs for the new building were 53 million Eeuros. Almost 20 million euros came from the city of Vienna.diepresse.com The remaining costs were partly raised by the Allianz Group and by SK Rapid through long-term loan financing. The new stadium was rotated 90 degrees compared to the old Hanappi-Stadium. It is now in the north-south direction . At the beginning of July 2016, the construction company STRABAG handed over the stadium to SK Rapid after 17 months of construction. The club offered its members the opportunity to view the stadium for the first time before the official opening on 9 July 2016. As part of the event, former SK Rapid players played in a “legends duel” against a team consisting of former players from First Vienna FC 1894 and Wiener Sportklub. The game ended 8:2. Andreas Herzog scored the first goal in the Allianz Stadium. The opening game was played on 16 July 16 between SK Rapid Wien and the English club FC Chelsea. The host beat Chelsea 2-0 in front of 28,000 fans. The first league match was versus SV Ried on 23 July in the 2016/17 Austrian Football Championship. The game ended with a 5-0 home win for the Austrian record champions. Christoph Schößwendter scored the first competitive goal in the Allianz Stadium. In the summer of 2018, more than 7,200 square meters of lawn had to be replaced due to fungal infestation and some soil had to be removed, the cost was around 100,000 euros.ORF.at (German) ==References== Category:Football stadiums in Austria Category:2016 establishments in Europe Category:2010s establishments in Austria Category:Football stadiums in Vienna",
 "title": "Allianz Stadion"
}