{
 "id": "1068406",
 "text": "Kara Zor-El (Supergirl) also known by her adoptive names of Linda Lee, Kara Kent, Linda Lang, and Kara Danvers, is a fictional character appearing in American comic books published by DC Comics. She was created by Otto Binder and designed by Al Plastino. Danvers first appeared in the story \"The Supergirl from Krypton\" in Action Comics #252 (May 1959). She is the heroine known as Supergirl and is Superman's cousin. == Fictional character biography == Born on Krypton to Superman's uncle and aunt, Kara was rocketed to Earth by her father to save her life. She was adopted by the Danvers family and became the protector of National City. In her secret identity she is Kara Danvers, a run-of-the-mill high-schooler. Possessing vast powers given by her Kryptonian physiology, Supergirl is one of the most powerful heroes in the world, and has been a member of the Justice League and the Red Lantern Corps. == Powers and abilities == Kara's powers and abilities include super strength, superspeed, heat vision, freeze breath, flight and many other powers also achievable by the superhero Superman, who is Kara's cousin; however, like her cousin, she is weakened when she comes into contact with Kryptonite, fragments of her home planet Krypton that came to Earth after its destruction. == In other media == In live-action, Supergirl first appeared in the movie Supergirl (1984), played by Helen Slater. She later appeared in the television series Smallville, played by Laura Vandervoort, and the Arrowverse series Supergirl (2015-2021), played by Melissa Benoist on the show and also appearing on other Arrowverse series. Sasha Calle appeared as Supergirl in the DC Extended Universe (DCEU) movie The Flash (2023), in which Slater also reprises her 1984 role in a cameo appearance. An upcoming standalone movie featuring the character titled Supergirl: Woman of Tomorrow, is in development as an installment of the rebooted DC Universe (DCU) media franchise, and will be portrayed by Milly Alcock. Category:DC Comics superheroes",
 "title": "Supergirl (Kara Zor-El)"
}