{
 "id": "106924",
 "text": "Bret Hart (born July 2, 1957) is a semi-retired Canadian professional wrestler, writer, and actor. He is a member of the well-known Hart wrestling family of Calgary, Alberta. His father was wrestling legend Stu Hart. He is considered to be one of the most technically sound wrestlers ever. His athletic ability and in-ring knowledge have also been highly praised. == Career == Bret Hart had an amazing career in the WWF, having some of the greatest matches of all time. Some of his best matches were against Mr. Perfect, his one-time brother-in-law British Bulldog, his brother Owen Hart, Stone Cold Steve Austin and Shawn Michaels. Hart said that he was going to leave the WWF for the companies then biggest competitor, World Championship Wrestling (WCW) and he refused to lose the title in front of his Canadian fans to Michaels. During Survivor Series 1997 in Montreal, Quebec, a real-life screwjob took place when Shawn Michaels put Hart in Hart's own finishing move, the Sharp Shooter. Vince McMahon ordered referee Earl Hebner to call for the bell even though Hart didn't submit. This made Michaels become the WWF Champion. This incident would later become known as the Montreal Screwjob. == Injury == Hart retired after being kicked in the head by his opponent, Goldberg, in a match. Soon after he suffered a stroke. He has since partially recovered and has done some stage acting. He wrote a column for The Calgary Sun until 2004. == WWE Return == On January 4 2010, Hart returned to the WWE to be a special guest host for Raw. This was the first time that Hart made a live appearance on Raw in over 12 years. During the night he and Shawn Michaels agreed to a truce, shook hands and hugged. Many fans didn't know if it was real or not but Hart and Michaels later said that their truce was real and not part of a storyline. He also shook hands with Vince but Vince later kicked Hart in the gut which was part of a storyline. Hart along with his family beat Vince McMahon at WrestleMania XXVI in a No Holds Barred Match. == In wrestling == * Finishing moves ** Sharpshooter ** Spike piledriver * Signature moves ** Bridging / Release German suplex ** Bulldog, sometimes from the second rope ** Dropkick ** Figure four leglock, sometimes while using the ringpost for extra pressure ** Headbutt ** Headbutt drop to the opponent's lower abdomen ** Inverted atomic drop ** Multiple pinning variations *** Backwards flip out of chokehold into cover using turnbuckle *** Crucifix *** Inside cradle *** Roll-up *** Sunset flip *** Victory roll ** Pendulum backbreaker ** Russian legsweep ** Seated senton to an opponent's leg draped over the first rope ** Second or a top rope dive into either an axe handle elbow drop or a side elbow drop ** Sleeper hold ** Snap suplex ** Stomp to the opponent's abdomen ** Suicide dive ** Superplex ** Swinging neckbreaker * With Jim Neidhart ** Hart Attack * Managers ** Jimmy Hart ** William Shatner ** Debra Wilson * Nicknames ** \"The Cowboy\" Bret Hart ** Buddy \"The Hearthrob\" Hart ** Bret \"The Hitman\" Hart ** \"The Excellence of Execution\" ** \"The Best There Is, The Best There Was and The Best There Ever Will Be\" ** \"The Pink and Black Attack\" (while teaming with Jim Neidhart) == Championships and accomplishments == * Cauliflower Alley Club ** Iron Mike Award (2008) * Professional Wrestling Hall of Fame and Museum ** Class of 2008 * Pro Wrestling Illustrated ** PWI Comeback of the Year (1997) ** PWI Feud of the Year (1993) vs. Jerry Lawler ** PWI Feud of the Year (1994) vs. Owen Hart ** PWI Match of the Year (1992) vs. British Bulldog at SummerSlam ** PWI Match of the Year (1996) vs. Shawn Michaels in an Iron Man match at WrestleMania XII ** PWI Match of the Year (1997) vs. Steve Austin in a Submission match at WrestleMania 13 ** PWI Most Hated Wrestler of the Year (1997) ** PWI Most Inspirational Wrestler of the Year (1994) ** PWI Stanley Weston Award (2003) ** PWI ranked him #1 of the 500 best singles wrestlers of the year in the PWI 500 in 1993 and 1994. ** PWI ranked him #4 of the top 500 singles wrestlers of the \"PWI Years\" in 2003 ** PWI ranked him #37 of the top 500 tag teams of the \"PWI Years\" with Jim Neidhart in 2003 * Stampede Wrestling ** NWA International Tag Team Championship (Calgary version) (5 times) – with Keith Hart (4) and Leo Burke (1) ** Stampede British Commonwealth Mid-Heavyweight Championship (3 times) ** Stampede North American Heavyweight Championship ** Stampede Wrestling Hall of Fame * World Championship Wrestling ** WCW United States Heavyweight Championship (4 times) ** WCW World Heavyweight Championship (2 times) ** WCW World Tag Team Championship (1 time) – with Goldberg * World Wrestling Council ** WWC Caribbean Tag Team Championship (1 time) – with Smith Hart * World Wrestling Federation / World Wrestling Entertainment ** WWE United States Championship (1 time) ** WWF Championship (5 times) ** WWF Intercontinental Championship (2 times) ** WWF Tag Team Championship (2 times) – with Jim Neidhart ** King of the Ring (1991, 1993) ** Royal Rumble (1994)1 ** Second Triple Crown Champion ** WWE Hall of Fame (Class of 2006) ** Slammy Award for Put a Fork in Him, He's Done (1996) ** Slammy Award for Best Music Video (1996) ** Slammy Award for Which WWF champion, past or present, in attendance, is Hall of Fame bound? (1996) * Wrestling Observer Newsletter awards ** 5 Star Match (1994) ** 5 Star Match (1997) ** Best Pro Wrestling Book (2007) ** Best Pro Wrestling DVD (2006) ** Feud of the Year (1993) ** Feud of the Year (1997) ** Match of the Year (1997) ** Wrestling Observer Newsletter Hall of Fame (Class of 1996) 1Hart co-won the Royal Rumble with Lex Luger after both simultaneously eliminated each other. ==References== ==Other websites== *Official website *WWE profile Category:1957 births Category:Living people Category:Canadian professional wrestlers Category:Canadian stage actors Category:Canadian television actors Category:Former WWE wrestlers Category:Hart family members Category:Professional wrestling authority figures Category:Professional wrestling managers and valets Category:Professional wrestling referees Category:Sportspeople from Calgary Category:WWE Hall of Fame",
 "title": "Bret Hart"
}