{
 "id": "1069694",
 "text": "Surigao del Norte or the Province of Surigao del Norte, is a province of the Philippines in the Caraga region of Mindanao. Its capital is Surigao City. The province includes two main islands, Siargao and Bucas Grande, in the Philippine Sea, along with a small area at the northeastern tip of mainland Mindanao and other nearby minor islands. It shares borders with Agusan del Norte and Surigao del Sur. As the second northernmost province in Mindanao, Surigao del Norte has a important role in commerce and transportation, serving as a hub between Visayas and Mindanao. Ferries regularly cross the Surigao Strait, connecting Surigao to Leyte and facilitating the transport of vehicles, goods, and passengers. == Name == There are two possible meanings for the name \"Surigao\" based on different root words. One interpretation suggests it might come from \"suligao\" or \"suyogao,\" which means \"water current\" in Visayan languages. The term is related to words like Sinulog, Sulu, and Tausug. Another perspective is that it could be from the root word \"sulig,\" meaning \"sprout\" or \"spring up.\" In this case, Surigao may have originated from \"suligao\" (\"spring water\"), possibly referring to the Surigao River, known as \"Suligaw\" in Mandaya, which flows into the northern tip of Mindanao. Historical records mention the river's name as Suligao, Surigao, or Zurigan. == Demographics == In 2020, Surigao del Norte had a population of 534,636 people, and the density was 270 inhabitants per square kilometer or 700 per square mile. The residents are mainly of Austronesian descent, with some having Chinese, Arab, Spanish, and American ancestry, though the latter is a small percentage. Around 95.80% of the population speaks Surigaonon as their primary language. Cebuano and Boholano are also spoken, along with a minority using Waray. Many people can communicate in Tagalog and English as secondary languages. Some individuals speak Kamayo, Manobo, Ilocano, Hiligaynon, Kapampangan, Maranao, Maguindanaon, and Tausug languages. Religion-wise, Roman Catholicism is predominant, with around 60% adherence. Other religions include Iglesia Filipina Independiente (30%), Protestantism (10%) and Islam. == References == Category:Island provinces of the Philippines Category:Caraga",
 "title": "Surigao del Norte"
}