{
 "id": "1069150",
 "text": "Ivo Viktor (born 21 May 1942) is a Czech former footballer who played as a goalkeeper. He played for Czechoslovakia, representing his country on 63 occasions between 1966 and 1977,International Appearances taking part in the 1970 FIFA World Cup and winning the 1976 European Championship. Regarded as one of the best goalkeepers of his generation in Europe in his prime, he was characterized as a renowned shot-stopper, who came off his line very quick to avoid conceding goals against him, he was often considered as a sweeper-keeper and he was a penalty-stopper in his prime, he placed third in the 1976 Ballon d'Or, and was a five-time winner of the Czechoslovak Footballer of the Year award, and a two-time winner of the European Goalkeeper of the Year award. ==Club career== Viktor played as a junior in the Spartak Šternberk team and later represented in the 1960–1961 season Železárny Prostějovia, in the 1961–1962 season RH Brnota, in the season 1962–1963 Spartak Brnota and in the seasons 1963–1977 Dukla Prague. He won the Czechoslovakia championship in 1964, 1966 and 1977. In the 1966–1967 season, Dukla Praha won the European Cup with the combined goals of two matches 1–3, in the first round when the team knocked out Danish Esbjerg. In the second round against Belgian Anderlecht. Viktor played all eight cup matches. In the quarter-finals, Dukla won to Dutch Ajax and, in the semi-finals Dukla lost to Celtic. ==International career== Viktor made his debut in the national team of his country in 1966 at \"Maracanã\" in a match against the national team Brazil. He played 63 matches for the Czechoslovak national team in the period 1966–1977, including captaining the team in 17 matches. He was a participant in the final tournament of the 1970 World Championship. At the European Championship in 1976, he became one of the brightest players of the tournament and helped the Czechoslovak national team win gold medals. According to the results of the tournament, he received the prize of the best goalkeeper, and at the end of the year he took third place in the competition of the best football players of the year in Europe Golden Ball. His last international appearance was against Hungary in 1977. ==Coaching career== Viktor took charge of Dukla Prague for one season as manager, in the 1990–91 Czechoslovak First League. The club finished the season in 11th place. ==Honours== ===Club=== ;Dukla Prague * Czechoslovak First League: 1964, 1966, 1977 * Czechoslovak Cup: 1965, 1966, 1969 ===International=== ;Czechoslovakia * UEFA European Football Championship: 1976 ===Individual=== * Czechoslovak Footballer of the Year: 1968, 1972, 1973, 1975, 1976Czechoslovakia – Player of the Year * Ballon d'Or: Third place 1976 * European Goalkeeper of the Year award: 1969, 1976European Goalkeeper of the Year * UEFA Euro Team of the Tournament: 1976 * Voted 24th in Keeper of the Century – IFFHS' Century Elections. ==References== ==Other websites== * * 1976 Euro Cup win * European Keeper of the Century Category:1942 births Category:Living people Category:Czech footballers Category:Czechoslovak footballers Category:Czech football managers Category:Czechoslovak football managers Category:Association football goalkeepers Category:1970 FIFA World Cup players Category:UEFA Euro 1976 players",
 "title": "Ivo Viktor"
}