{
 "id": "1069043",
 "text": "Graham Ivan Clark (born January 9, 2003) is an American hacker and cybercriminal, who was behind the 2020 Twitter account hijacking. == Early life == Graham Ivan Clark grew up in Hillsborough County, Florida, with his mother, father, and sister. When he was a teenager, Clark used nicknames while being a part of online communities, including Minecraft. In 2018, Graham joined OGUsers, a forum that is dedicated to selling, buying, and trading online accounts with 'cool' usernames. He was banned on the forums due to scamming Minecraft Capes. In 2019, at the age of 16, Clark was involved in stealing 164 bitcoins from Gregg Bennett, an investor in Seattle using a SIM swap attack. The United States Secret Service was only able to recover 100 bitcoins. == 2020 Twitter account hijacking == Clark is widely known as the \"mastermind\" of the 2020 Twitter account hijacking, an event where Clark and two partners hacked 130 high-profile Twitter accounts to do a cryptocurrency scam involving bitcoin, and stealing \"OG\" usernames to sell on the OGUsers forum. == Arrest == On July 31, 2020, Clark was arrested at his home in Northdale, Florida. He faced 30 criminal charges, including 17 counts of communication fraud, 11 counts of fraudulent use of personal information, one count of organized fraud for more than $5,000, and one count of accessing a computer or electronic device without authority. His bail was set at $725,000 and he pleaded not guilty. His hearing was held on March 16, 2021 via Zoom at Hillsborough County Jail. He was sentenced to three years in prison followed by three years of probation as part of a plea deal under Florida's Youthful Offender Act, which limits the penalties of convicted felons under the age of 21. Clark was released from Saint Petersburg Community Release Center on February 16, 2023.https://vinelink.vineapps.com/person- detail/offender/15174930 == References == Category:2003 births Category:Living people Category:Hackers",
 "title": "Graham Ivan Clark"
}