{
 "id": "1070486",
 "text": "Nestor Ivanovych Makhno (7 November 1888 – 25 July 1934) was a Ukrainian anarchist revolutionary. He was the leader of the Makhnovshchina (\"Makhno movement\") and the Commander-in-Chief of the Revolutionary Insurgent Army of Ukraine. Makhno was born in a poor family in Huliaipole, in the south of Ukraine. He was put in prison because of his anarchist activism. During the Russian Revolution, he was set free and returned to his home town. He took property from the rich and gave it to poor farmers. When civil war started, he joined the side of the Bolsheviks. Together with the Red Army, Makhno's anarchist forces fought against the White Army and the Central Powers. After he beat them in battle, he attempted to build anarchist communism in Ukraine. But the Bolsheviks turned against Makhno and attacked the Insurgent Army. Makhno withdrew from Ukraine and went into exile. He moved to Paris, where he wrote his memoirs and articles about anarchism. He argued a lot with other anarchists and was accused of antisemitism. He died from tuberculosis at the age of 45. ==Early life== Nestor Makhno was born on 7 November 1888. His family were poor peasants and they lived in Huliaipole, in the south of Ukraine. Makhno had four brothers and his parents were former serfs. His father died while he was still very young. Growing up, Makhno was often absent from school and went to work on a farm at an early age. Makhno hated working for property owners and rebelled against them. He worked a number of different jobs to support his family. In 1905, Makhno joined the local anarchist group in Huliaipole. The group robbed local businesspeople and attacked the police. By 1909, Makhno was arrested. He was sentenced to life imprisonment. In prison, Makhno was often in solitary confinement and became ill with tuberculosis. Peter Arshinov gave him an education. He also started to dislike intellectuals. From his prison cell, Makhno opposed the Russian Empire joining World War I. He was freed from prison during the Russian Revolution of 1917 and returned home to Huliaipole. ==Revolutionary leadership== ===Activism in Huliaipole=== Local peasants and members of his old anarchist group welcomed Makhno back to Huliaipole. Makhno wanted the anarchist group to take leadership over the peasants, but it would not help him. By himself, Makhno formed a trade union for local peasants. He was elected as the union's chairperson. Led by Makhno, peasants and anarchists took control of the local government. Makhno led strike actions against employers. Workers then took control of the town's industry. Makhno also took property from landlords and gave it to poor peasants. By October 1917, Makhno had broken up Huliaipole's law enforcement and formed a peasant militia. When civil war started, Makhno's anarchist forces took the side of the Bolsheviks against the White Army. ===Travels in Russia=== In February 1918, the Central Powers invaded Ukraine. Makhno tried to resist but Huliaipole was occupied by the Austro-Hungarian Empire. Makhno retreated to Taganrog and made plans to take back Huliaipole. He then travelled along the Volga to Moscow, the capital of Soviet Russia. There he met with Peter Arshinov and the famous anarchist Peter Kropotkin. He also met the Bolshevik leader Vladimir Lenin. The Bolsheviks forged him a passport so he could return to Ukraine. ==Military command== ===Return to Ukraine=== Makhno crossed the Russia-Ukraine border in disguise. He discovered that his house was destroyed and his oldest brother was executed by the Austro-Hungarian Army. He returned to Huliaipole in secret and planned an insurgency against the military occupation. Makhno's forces took over Huliaipole for a short time in September 1918. They then withdrew north to Dibrivka forest. They were surrounded by the Austro-Hungarian Army, but beat them in a surprise attack. For their victory, Makhno's supporters gave him the title of Bat'ko (Ukrainian for \"father\"). The Austro-Hungarians set fire to the nearby village. Makhno's forces took revenge against supporters of the occupation, such as local Mennonites. Makhno's forces took Huliaipole again in November 1918. They were then reorganized into the Revolutionary Insurgent Army of Ukraine, with Makhno as its Commander-in-Chief. At this time, the Central Powers withdrew from Ukraine. The Red Army invaded Ukraine from the north and the White Army attacked from the south. ===In the Red Army=== In January 1919, Makhno's Insurgent Army decided to join the Red Army. Makhno became the commander of a Red brigade. He disliked his own commanders in the Red Army. His commanding officer banned him from holding regional congresses in Huliaipole. In May 1919, Nykyfor Hryhoriv rebelled against the Red Army. The Bolshevik politician Lev Kamenev demanded that Makhno attack Hryhoriv. Makhno complained about Hryhoriv's antisemitism, but also blamed the Bolsheviks for causing the rebellion. Makhno's relationship with his Red Army commanders got worse. By June, the Bolsheviks were calling Makhno an outlaw and wanted him to be arrested. Leon Trotsky also disliked Makhno for being an anarchist. At this time, White Cossacks captured Huliaipole and Makhno retreated. He then resigned from the Red Army. The Cheka tried to arrest him, but were not successful. Makhno's small group retreated west and linked up with Hryhoriv's forces in July 1919. But their agreement broke down because of Hryhoriv's antisemitism. Makhno's adjutant then killed Hryhoriv. ===Independent command=== In September 1919, the Red Army withdrew from Ukraine. Makhno's forces then fought against the White Army by themselves. The Whites forced the Insurgent Army to retreat further west. Makhno agreed a truce with the nationalist leader Symon Petliura. Makhno's forces then regrouped and beat the White Army in battle. The Insurgent Army then took over most of the south of Ukraine. This broke the supply line of the White Army, which stopped attacking Moscow. The Whites then attacked Katerynoslav and the Insurgents retreated from the city. In Oleksandrivsk, Makhno and his forces caught epidemic typhus. In January 1920, the Red Army arrived at Oleksandrivsk. They requested Makhno to go west to fight against Poland. He refused and the Bolsheviks made him an outlaw again. The Red Army and the Insurgent army started to fight against each other. Makhno's typhus got worse and he fell into a coma. While he was unconscious, local peasants hid him from the Cheka. When he recovered, he started to fight guerrilla warfare against the Cheka and the Red Army. But by August 1920, they agreed to stop fighting and formed an alliance against the White Army. Makhno did not trust the Bolsheviks but hoped they would keep to the agreement. In October 1920, the Insurgent Army took Huliaipole back from the Whites. Some of Makhno's forces went to Crimea to keep attacking the White Army. Makhno stayed behind. After the White Army was beaten in Crimea, the Bolsheviks turned against Makhno. They claimed that Makhno had disobeyed orders. On 26 November 1920, the Red Army attacked Huliaipole. Makhno's forces fled the town and met up with the insurgent forces from Crimea. They retook Huliaipole one week later. In December 1920, the Insurgent Army took more towns from the Red Army. But Makhno's forces were surrounded. They separated into small groups and started to fight guerrilla warfare against the Red Army. Makhno went north. He was wounded in battle. ==Exile== ===In Eastern Europe=== By August 1921, many of Makhno's friends were dead and he was badly wounded. He decided to leave Ukraine and get medical treatment. Makhno's unit fled to Romania. After a short time in a concentration camp, he recovered from his wounds in Bucharest. The Bolsheviks called for the extradition of Makhno, but the Romanian government refused. Makhno tried to form an alliance with Ukrainian nationalists in Romania, but was not successful. He moved to Poland in April 1922. There he was held in another concentration camp. He and his wife Halyna Kuzmenko were suspected of planning an anti-Polish insurgency. They went to prison. Kuzmenko gave birth to their daughter, Elena, in prison. Their trial resulted in their acquittal. In July 1924, they moved to Danzig. Makhno was again put in prison, but he escaped to Berlin, in Germany. ===In Paris=== In April 1925, Makhno moved to Paris in France. He met up with his family and they moved into a new home. Makhno's illness kept him out of work. It forced his family to move to a different house. During this time, Makhno co-wrote the Platform. This manifesto called for the anarchist movement to be more organized. Other anarchists disliked the Platform. They called it \"authoritarian\". Makhno was also accused of antisemitism, which he denied. Makhno's illness got worse. He became isolated from other Ukrainian emigrants. He argued with the editors of his memoirs. He and Kuzmenko also separated. By the 1930s, Peter Arshinov had defected to the Soviet Union. Makhno's tuberculosis was made worse by malnutrition. He spent the last months of his life in hospital. He died on 25 July 1934. His body was cremated and the ashes kept in Père Lachaise Cemetery. Makhno's widow and daughter were deported to Nazi Germany during World War II. They were then arrested by the Soviet Union and exiled to Kazakhstan. They lived there for the rest of their lives. After the independence of Ukraine, Makhno became a local hero in Huliaipole. ==References== ==Bibliography== * * * ==Other websites== * Category:1888 births Category:1934 deaths Category:Anarchists Category:Deaths from tuberculosis Category:Ukrainian activists Category:Ukrainian military people Category:Ukrainian politicians Category:Ukrainian writers",
 "title": "Nestor Makhno"
}