{
 "id": "1070419",
 "text": "Wenchang Wang (文昌王), also known as Wenchang Dijun, is a Taoist deity in Chinese mythology, celebrated as the God of Culture and Literature. People often refer to him as Wen Qu or Wen. His name translates to the King of Flourishing Culture and Language. Wenchang Wang is represented by a constellation of six stars near the Big Dipper, these stars have individual names like Shangjiang, Cijiang, Guixiang, Siming, Sizhong, and Silu.Werner, ETC \"Myths and Legends of CHINA\" Gearge G. Harrap & Co. LTD. 1922 p.104 Depicted as an elderly scholar with two attendants, Tianlong and Diya, Wenchang Wang is known to hold a pen and a book with the inscription \"Heaven determines literary achievement.\" Taoist Scholars and writers historically invoke his assistance for inspiration or guidance, especially before exams. == History and Worship == Wenchang Wang was given titles like the Supporter of the Mongol Dynasty. He has been officially revered since 1314 A.D started by Yen Yu of Yuan dynasty. He is known for promoting positive influences and is a deity invoked by scholars and students for academic aid. Many temples honor him, with the Wenchang temple at Zitong being notable. Qiqu Mountain, its location, is famous for the largest cypress forest in China, and it's regarded as the origin of Wenchang culture. In Sichuan, it's said, \"In the North, there is Confucius, and in the South, there is Wenchang\". Taichung has two significant temples dedicated to Wenchang Di Jun. One in Beitun, constructed in 1863, aimed to support learning. The other in Nantun, built in 1825, follows feng shui principles by facing south. The tradition of worshiping Wenchang Wang dates back, being popular due to its accessibility to people from all walks of life. Even today, people worship him for similar reasons. His birthday, celebrated on the third day of the second month of the Chinese lunar calendar, involves visits to his temples, where officials and scholars offer sacrifices and recite poems. == References == Category:Taoism",
 "title": "Wenchang Wang"
}