{
 "id": "1070650",
 "text": "==Plot== Two cousins, Matt and Lisa, are staying at summer camp in the woods where a creature named FloopaLoo lives. There, they discover a strange world where fish can play music and memory trees grow. == Characters == * Matt - A very intelligent and cultured 12-year old boy, with the dream of becoming a journalist; he tries at all costs to get news to put on his blog. He dreams of photographing the Floopaloo (diminutive of Flapascià), the king of the forest. He wants to be a reporter. He is considered the most flustered of the characters, given his tendency to blush. Sometimes he behaves strangely. He is madly in love with Annetta, but in \"Big Brother\", crushes on someone else under the effect of a spell. * Lisa - Matt's cousin, 11 and a half years old. She is smart and is Greta's best friend. She inherited the sioux from her grandmother, which allows her to discover and access many things about the enchanted forest. She is allergic to strawberries. She is the keeper of the forest's secrets, written in her secret notebook. * Malik - A very unfortunate boy, he always gets into a lot of trouble from which the Floopaloo saves him regularly. He has always been Bryan's best friend, with whom he stays for most of the day. * Bryan - Passionate about extreme sports, he loves dirt because he hates washing. He loves everything to do with skateboarding, and is always looking for something new and exciting. In one episode he discovers his ability at painting nails, which he is very good at and is ashamed to tell his friends. His best friend is Malik and they do a lot of things together, even though Malik is always afraid of doing them. He is afraid of heights. * Jeanne-Marie and Marie-Jeanne - Twins who are experts in fashion and beauty, they always read fashion magazines and love to nail each other and their friends. They define themselves as experts in love and form the \"Love Brigade\". They hate being the same in everything and hate it when their friends confuse them, but they will work hard to find the differences between the two. They always try to make fun of others, always in the field of love; as in the case of Bryan and Greta. * Greta - A very intelligent and sensitive girl; she's the only one who loves math and holiday homework. Ignatius often uses it to attend to the accounting. She has a passion for poetry, for which she is very gifted. She is Lisa's best friend. She is stubborn and stubborn, hates making mistakes and once ends up going back in time, trying to avoid making a mistake in counting the score of a game. * Olga (Beryl in the dub) - The director of the summer camp, she is very sweet and prefers to solve everything calmly and not by the hard way. She is in love with Hippolyte and is always embarrassed when she talks to him. * Hippolyte (Ignatius in the dub) - Hippolyte may seem stern and at times almost evil, but in reality he is very sensitive and romantic, he is madly in love with Olga and always tries to get her attention and always blushes when he talks to her. He has a mania for giving tags of different colors according to the things done; he usually puts a red card in the children's hair calling it the \"most severe punishment of the century\". The red and yellow cards consist of weeks of washing dishes; naturally the red card corresponds to the longer punishment. Instead, the \"bright card\" and the \"gold card\" are additional cards given to Matt and Bryan respectively: Matt was awarded for a fake magic show, while Bryan had cleaned the campsite under the influence of a magic item from the forest. He is afraid of mice. He considers himself a champion of the card game. He is the only one in the camp who has ever seen the Floopaloo. In addition, he sometimes does the things he forbids the children to do. As a gag, he screams into his \"secret jar\". * Annette - Helps supervise the summer camp; she is full of energy and often uses nicknames for the kids like \"bunnies\" or \"cubs\". However, she becomes very nervous if someone makes her take a test. In one episode she becomes director in place of Olga. She is very young, there are not many years of difference between her and the boys. Matt really likes her. * Squeak - A very intelligent squirrel who has a passion for candy and soft toys; often accompanies Matt and Lisa in their investigations of the Floopaloo. Lisa sometimes calls him \"Squirrel\". He is the same age as all the children in the camp. * Waldo - A very clumsy and careless beaver and, like Squeak, cannot resist the sight of candy or treats, which he is crazy about. He always drops his lollipop in the lake. * Flapascià (season 2) or Floopaloo (season 1) - the king of the enchanted forest, directs all the forest and through the Oracle of the Forest, to always know when someone is in trouble or needs help. No one has ever seen his true appearance but he is represented with two yellow eyes – some episodes reveal more details; such as blue fur and his scarf, that smells of musk and caramel. He always helps all those in need and never hesitates to donate special things that are needed by the children of the camp. He has many helpers like his trusty ants who talk through Matt's cell phone and of course many other forest animals. He lives in a hut that moves, equipped with many comforts and pieces of technology. He usually goes to the Mini-club, a place where one has to eat magic cookies to get in. ==Episodes== ===Series overview=== Season Episodes Originally aired Season premiere Season finale 1 52 2 52 ===Season 1 (2011–2012)=== No. in series No. in season Title Directed by Written by Storyboard by Air date ===Season 2 (2013 - 2014)=== No. in series No. in season Title Written by Storyboard by Air date ==References== Category:French animated television series",
 "title": "FloopaLoo, Where Are You?"
}