{
 "id": "1070318",
 "text": "Jamaica Bay Wildlife Refuge is a nature area in New York City looked after by the National Park Service. It includes the open water and marshes of Jamaica Bay in Brooklyn and Queens. The refuge has islands in Jamaica Bay, near John F. Kennedy International Airport. The airport was built over part of the wetlands in the bay, causing environmental changes with airplane noise. However, the refuge has many different habitats like salt marshes, dunes, ponds, woodlands, and fields. Jamaica Bay Wildlife refuge is special as the only \"wildlife refuge\" in the National Park System. It was first started by New York City and later handed over to Gateway National Recreation Area. The refuge has paths around the East and West Pond, although the latter was affected by Hurricane Sandy in 2012. == History == In 1938, Robert Moses, the commissioner of the New York City Department of Parks and Recreation (NYC Parks), started plans for a wildlife refuge around Jamaica Bay. His goal was to prevent industrial development in the area. By 1941, Moses thought about converting Jamaica Bay into an 18,000-acre recreation center, seeking control from NYC Parks in 1945 to create a haven for wildlife and water activities. After about twelve years of planning, Moses started construction in 1950. About 84,000 workers helped develop the park. Moses is credited with introducing the idea of freshwater ponds alongside the saltwater marshes, attracting diverse wildlife. The first phase of the project was completed in 1953, and Herbert Johnson became the refuge's first superintendent. The site quickly became a sanctuary for birds, with 208 species identified in the first five years. Notable species, like black skimmers and snowy egrets, returned to the area after several decades. During the early years, diverse wildlife, including black bears, coyotes, elk, and wolves, could be found in the park. Birdwatchers began visiting in the late 1950s. In 1972, control of the site transferred to the National Park Service, which now manages the refuge as part of the Gateway National Recreation Area. == Wildlife == The refuge is a home to many plants and animals, both in the water and on land. It's a great place for bird watching in New York City, with various resident and migratory birds. Ospreys, once endangered by the pesticide DDT, have been nesting regularly in the refuge since 1991. Scientists capture, tag, and study them to learn more about their behaviors. Small mammals like eastern gray squirrels and raccoons also inhabit the area. However, the growing raccoon population has been causing issues by eating diamondback terrapin eggs shortly after they are laid. == References == Category:Geography of New York City Category:Protected areas",
 "title": "Jamaica Bay Wildlife Refuge"
}