{
 "id": "1070279",
 "text": "Ivy Dominique (born May 30, 1979) is a Ukrainian-Russian actress,model, producer, and former pageant queen. She is also a nurse and advocate. She has been featured on the covers of Harper’s Bazaar Vietnam and Glamour Magazine. == Education == Dominique has Ph.D. in Psychology and is a licensed nurse with certifications in cognitive behavior therapy, grief, and trauma. Dominique is pursuing a medical degree and is involved in several philanthropic and advocacy pursuits. == Career == Modeling Dominique started her modeling career in New York as a side passion, later expanding her profile into Los Angeles and other international markets. She walked the runways at several high- profile fashion events, including Milan, Paris, and New York Fashion Weeks. Advocate Dominique is also an advocate and addresses various social issues such as PTSD, domestic violence, consent, sexual assault, human trafficking, invisible illnesses, mental health, and veterans. She is a courageous survivor of domestic violence and sexual abuse. Dominique has also spoken at multiple international conferences and the United Nations, raising awareness and advocating for change on many important issues. She shares her experiences so that people do not feel alone and realize that it can happen to anyone and that a great life is possible after survival. In 2022, Dominique collaborated with The Consent Awareness Network to advocate for legislative change and a definitive legal definition of consent. She has a firm commitment to justice, which ensures that offenders can no longer exploit legal loopholes and enable survivors to receive the justice they deserve. == Recognition == • Glamour Magazine Woman of the Year Award, 2022 • Ms. Tourism USA 2018 • President's Lifetime Achievement Award == Filmography == Title Role Year TV Shows Succession (TV Series) Nu Waystar Employee 2018 The Good Fight (TV Series) Republican Wife at Party 2017 Films The Judas Kiss Keswick’s Aide 2023 The Wendigo Jeannie Pickford 2022 Let’s Play (Short Film) Jessica 2021 The Things We Take (Short Film) 2021 The Black Tent Cassandra Producer Jack Be Nimble 2022 == References == Category:1979 births Category:Living people Category:Ukrainian models Category:Russian models",
 "title": "Ivy Dominique"
}