{
 "id": "1070542",
 "text": "Spider-Man Loves Mary Jane is an American comic book series which retells the story of Spider-Man with Mary-Jane Watson as the protagonist. It started in 2004 and ended in 2009. It was written by Sean McKeever and drawn by Takeshi Miyazawa and David Hahn. == Circle of Friends == In the first comic book Mary Jane:Circle of Friends, Mary-Jane Watson is worried about not having a boy to date at the School Dance. So her friend Liz convinces her to date Harry Osborn. Then Mary-Jane goes home on a train which is attacked by a supervillain named Electro but Spider-Man comes and saves her. Then Mary-Jane falls in love with Spider-Man. Mary-Jane gets a job as a dress salesman. Mary- Jane finds out from Liz that Flash Thompson likes her and wishes he were dating her. Liz later thinks Mary-Jane is cheating on Harry with Flash. == Mary Jane:Homecoming == Dr. Norman Osborn tells Harry to stop dating Mary-Jane because he thinks she’s why Harry’s doing badly in school so Harry decides to cheat at math. When Mary-Jane stops him, he breaks up with her. Flash Thompson kisses Mary-Jane at a school dance and Liz is angry about this. == Spider-Man Loves Mary Jane == A nerdy boy named Peter Parker starts to tutor Mary-Jane in Algebra. Mary-Jane loves Spider-Man but both Peter and Liz tell her not to try to date Spider-Man. Mary-Jane finds Spider-Man after he fights a supervillain called The Vulture and asks him to start dating her but he says no. Flash Thompson gets jealous of Peter Parker because of how much time Peter spends with Mary-Jane so he gives Peter a wedgie. Mary-Jane tells Flash that he can’t be her friend anymore after that. Mary-Jane gets a part in the school play of Twelfth Night that her friend Lindsay wanted. So Lindsay starts dating Harry Osborn to make her jealous. But then Spider-Man comes to Mary-Jane and asks her for a date and she says yes. But because of his Secret identity, Mary-Jane realizes that Spider-Man can’t be her boyfriend. She also realizes that she’s actually in love with Peter Parker. But when she next sees Peter, he’s dating another girl named Gwen Stacy. Mary-Jane and Flash Thompson become friends again. Gwen breaks up with Peter because she thinks he’s in love with Mary- Jane. But Mary-Jane wants to date Harry Osborn even though he’s dating a girl named Felicia Hardy. Spider-Man meets and starts dating a female superhero named Firestar but later breaks up with her. Harry breaks up with Felicia since he wants to date Mary-Jane but Mary-Jane still doesn’t date Harry. Harry is angry about this. Peter and Mary-Jane start dating each other. == Spider- Man Loves Mary Jane Season 2 == Mary-Jane gets to play a character in a play that her friend Zoe wanted to play. Then someone uses the school’s computers to start a mean rumour about her. Mary-Jane assumes that Harry Osborn did it but he says he had nothing to do with it. Then Mary-Jane finds out that it was actually Zoe. Mary-Jane forgives Zoe. Category:Comics",
 "title": "Spider-Man Loves Mary Jane"
}