{
 "id": "1070754",
 "text": "Tropical cyclones and subtropical cyclones are named by various warning centers to help communication between forecasters and the public about forecasts, watches, and warnings. The names are intended to reduce confusion if there are storms in the same basin at the same time. Generally once storms produce sustained wind speeds of more than , names are given in order from the lists depending on which basin they start. Standards vary from basin to basin. Some tropical depressions are named in the Western Pacific, while tropical cyclones must have a significant amount of gale-force winds around the centre before they are named in the Southern Hemisphere. Before this naming started tropical cyclones were named after places, objects, or saints' feast days on which they happened. The first use of personal names for weather systems was by the Queensland Government Meteorologist Clement Wragge, who named systems between 1887 and 1907. This system of naming weather systems stopped for several years after Wragge retired. It was revived in the latter part of World War II for the Western Pacific. Formal naming schemes and naming lists have been introduced and developed for the Eastern, Central, Western and Southern Pacific basins, as well as the Australian region, Atlantic Ocean and Indian Ocean. ==North Atlantic== Within the North Atlantic Ocean, tropical or subtropical cyclones are named by the National Hurricane Center when they are judged to have become a tropical storm with winds of at least 65 km/h, (40 mph). Six lists of names are used in alphabetical order, and maintained by the World Meteorological Organization with them rotating on a yearly basis. Significant tropical cyclones have their names removed from the lists with a replacement name selected at the next World Meteorological Organization Regional Association IV Hurricane Committee meeting. If all of the names on a list are used, storms are named after the letters of the Greek alphabet (Alpha, Beta, Gamma, etc.). Greek names, unlike the names in the regular lists, cannot be removed. If a storm ever reached the magnitude that might otherwise have led to retirement, the storm would be listed with the retired names with a footnote indicating the Greek letter would still be available for future storms. List of Atlantic tropical cyclone names 2024 2024 2024 2024 2024 2024 2024 2024 2024 2024 2024 2024 Names Alberto Beryl Chris Debby Ernesto Francine Gordon Helene Isaac Joyce Kirk Names Leslie Milton Nadine Oscar Patty Rafael Sara Tony Valerie William 2025 2025 2025 2025 2025 2025 2025 2025 2025 2025 2025 2025 Names Andrea Barry Chantal Dexter Erin Fernand Gabrielle Humberto Imelda Jerry Karen Names Lorenzo Melissa Nestor Olga Pablo Rebekah Sebastien Tanya Van Wendy 2026 2026 2026 2026 2026 2026 2026 2026 2026 2026 2026 2026 Names Arthur Bertha Cristobal Dolly Edouard Fay Gonzalo Hanna Isaias Josephine Kyle Names Leah Marco Nana Omar Paulette Rene Sally Teddy Vicky Wilfred 2027 2027 2027 2027 2027 2027 2027 2027 2027 2027 2027 2027 Names Ana Bill Claudette Danny Elsa Fred Grace Henri Imani Julian Kate Names Larry Mindy Nicholas Odette Peter Rose Sam Teresa Victor Wanda 2028 2028 2028 2028 2028 2028 2028 2028 2028 2028 2028 2028 Names Alex Bonnie Colin Danielle Earl Farrah Gaston Hermine Idris Julia Karl Names Lisa Martin Nicole Owen Paula Richard Shary Tobias Virginie Walter 2029 2029 2029 2029 2029 2029 2029 2029 2029 2029 2029 2029 Names Arlene Bret Cindy Don Emily Franklin Gert Harold Idalia Jose Katia Names Lee Margot Nigel Ophelia Philippe Rina Sean Tammy Vince Whitney Supplemental list Supplemental list Supplemental list Supplemental list Supplemental list Supplemental list Supplemental list Supplemental list Supplemental list Supplemental list Supplemental list Supplemental list Names Adria Braylen Caridad Deshawn Emery Foster Gemma Heath Isla Jacobus Kenzie Names Lucio Makayla Nolan Orlanda Pax Ronin Sophie Tayshaun Viviana Will The names used recently in (2020) will be reused again in 2026. (if none of them are retired) ==Eastern Pacific Ocean== Within the Eastern Pacific Ocean two offices of the United States National Weather Service assign names to tropical cyclones when they are judged to have intensified into a tropical storm with winds of at least 65 km/h, (40 mph). Tropical cyclones that become tropical storms between the coast of Americas and 140°W are named by the National Hurricane Center, whilst tropical cyclones intensifying into tropical storms between 140°W and 180° are named by the Central Pacific Hurricane Center. Significant tropical cyclones have their names retired from the lists and a replacement name selected at the next World Meteorological Organization Regional Association IV Hurricane Committee meeting. ===North Pacific east of 140°W=== When a tropical depression intensifies into a tropical storm to the north of the Equator between the coastline of the Americas and 140°E then it will be named by the National Hurricane Center. Six lists of names are maintained by the World Meteorological Organization with them rotating on a yearly basis. Significant tropical cyclones have their names retired from the lists with a replacement name selected at the next World Meteorological Organization Regional Association IV Hurricane Committee meeting. List of Eastern Pacific tropical cyclone names 2024 Names Aletta Bud Carlotta Daniel Emilia Fabio Gilma Hector Ileana John Kristy Lane Miriam Norman Olivia Paul Rosa Sergio Tara Vicente Willa Xavier Yolanda Zeke 2025 Names Alvin Barbara Cosme Dalila Erick Flossie Gil Henriette Ivo Juliette Kiko Lorena Mario Narda Octave Priscilla Raymond Sonia Tico Velma Wallis Xina York Zelda 2026 Names Amanda Boris Cristina Douglas Elida Fausto Genevieve Hernan Iselle Julio Karina Lowell Marie Norbert Odalys Polo Rachel Simon Trudy Vance Winnie Xavier Yolanda Zeke 2027 Names Andres Blanca Carlos Dolores Enrique Felicia Guillermo Hilda Ignacio Jimena Kevin Linda Marty Nora Olaf Pamela Rick Sandra Terry Vivian Waldo Xina York Zelda 2028 Names Agatha Blas Celia Darby Estelle Frank Georgette Howard Ivette Javier Kay Lester Madeline Newton Orlene Paine Roslyn Seymour Tina Virgil Winifred Xavier Yolanda Zeke 2029 Names Adrian Beatriz Calvin Debora Eugene Fernanda Greg Hilary Irwin Jova Kenneth Lidia Max Norma Otilio Pilar Ramon Selma Todd Veronica Wiley Xina York Zelda Supplemental list Names Aidan Bruna Carmelo Daniella Esteban Flor Gerardo Hedda Izzy Jacinta Kenito Luna Marina Nancy Ovidio Pia Rey Skylar Teo Violeta Wilfredo Xinia Yariel Zoe ===Central North Pacific (140°W to 180°)=== When a tropical depression intensifies into a tropical storm to the north of the Equator between 140°W and 180° it is named by the Central Pacific Hurricane Center. Four lists of names are maintained by the World Meteorological Organization, rotating without regard to year, with the first name for a new year being the next name in sequence that was not used the previous year. Significant tropical cyclones have their names retired from the lists, with a replacement name selected at the next World Meteorological Organization Regional Association IV Hurricane Committee meeting. List 1 Akoni Ema Hone Iona Keli Lala Moke Nolo Olana Pena Ulana Wale List 2 Aka Ekeka Hene Iolana Keoni Lino Mele Nona Oliwa Pama Upana Wene List 3 Alika Ele Huko Iopa Kika Lana Maka Neki Omeka Pewa Unala Wali List 4 Ana Ela Halola Iune Kilo Loke Malia Niala Oho Pali Ulika Walaka ==Western Pacific Ocean (180° to 100°E)== Within the Northwestern Pacific Ocean there are two separate agencies who assign names to tropical cyclones which often results in a cyclone having two names. The Japan national weather service names tropical cyclones should they be judged to have 10-minute sustained wind speeds of 65 km/h, (40 mph), to the north of the equator between the 180° and 100°E. The Philippine national weather service also assigns names to tropical cyclones which move into or form as a tropical depression in their area of responsibility located between 135°E and 115°E and between 5°E-25°E even if the cyclone has had a name assigned to it by the Japanese national weather service. ===International names=== Tropical cyclones are named from the following lists by the Japanese national weather service, once they become a tropical storm. Names are contributed by members of the ESCAP/WMO Typhoon Committee. Each of the 14 nations or territories submitted 10 names, which are used in alphabetical order, by the English name of the country. Contributing nation Cambodia China North Korea (DPRK) Hong Kong Japan Laos Macau Malaysia Micronesia Philippines South Korea (ROK) Thailand USA Vietnam List 1 Damrey Haikui Kirogi Kai-Tak Tembin Bolaven Sanba Jelawat Ewiniar Maliksi Gaemi Prapiroon Maria Son-Tinh List 1 Ampil Wukong Jongdari Shanshan Yagi Leepi Bebinca Rumbia Soulik Cimaron Jebi Mangkhut Barijat Trami List 2 Kong-rey Yutu Toraji Man-yi Usagi Pabuk Wutip Sepat Mun Danas Nari Wipha Francisco Lekima List 2 Krosa Bailu Podul Lingling Kajiki Faxai Peipah Tapah Mitag Hagibis Neoguri Bualoi Matmo Halong List 3 Nakri Fengshen Kalmaegi Fung-wong Kammuri Phanfone Vongfong Nuri Sinlaku Hagupit Jangmi Mekkhala Higos Bavi List 3 Maysak Haishen Noul Dolphin Kujira Chan-hom Linfa Nangka Soudelor Molave Goni Atsani Etau Vamco List 4 Krovanh Dujuan Mujigae Choi-wan Koppu Champi In-Fa Melor Nepartak Lupit Mirinae Nida Omais Conson List 4 Chanthu Dianmu Mindulle Lionrock Kompasu Namtheun Malou Meranti Rai Malakas Megi Chaba Aere Songda List 5 Sarika Haima Meari Ma-on Tokage Nock-ten Muifa Merbok Nanmadol Talas Noru Kulap Roke Sonca List 5 Nesat Haitang Nalgae Banyan Hato Pakhar Sanvu Mawar Guchol Talim Doksuri Khanun Lan Saola ===Philippines=== The Philippine national weather service uses its own naming scheme for tropical cyclones in their area of responsibility. PAGASA assigns names to tropical depressions that form within their area of responsibility, and any tropical cyclone that moves into their area of responsibility. Should the list of names for a given year prove to be insufficient, names are taken from a reserve list of names, with the first ten published every year. 2015 Amang Betty Chedeng Dodong Egay Falcon Goring Hanna Ineng Jenny Kabayan Lando Marilyn Nona Onyok Perla Quiel Ramon Sarah Tisoy Ursula Viring Weng Yoyoy Zigzag Abe Berto Charo Dado Estoy Felion Gening Herman Irma Jaime 2016 Ambo Butchoy Carina Dindo Enteng Ferdie Gener Helen Igme Julian Karen Lawin Marce Nina Ofel Pepito Quinta Rolly Siony Tonyo Ulysses Vicky Warren Yoyong Zosimo Alakdan Baldo Clara Dencio Estong Felipe Gardo Heling Ismael Julio 2017 Auring Bising Crising Dante Emong Fabian Gorio Huaning Isang Jolina Kiko Lannie Maring Nando Odette Paolo Quedan Ramil 2017 Salome Tino Urduja Vinta Wilma Yasmin Zoraida Alamid Bruno Conching Dolor Ernie Florante Gerardo Hernan Isko Jerome 2018 Agaton Basyang Caloy Domeng Ester Florita Glenda Henry Inday Josie Karding Luis Maymay Neneng Ompong Paeng Queenie Rosita Samuel Tomas Usman Venus Waldo Yayang Zeny Agila Bagwis Chito Diego Elena Felino Gunding Harriet Indang Jessa ==North Indian Ocean (45°E - 100°E)== Within this basin when a deep depression is judged to have become a Cyclonic Storm it will be named by the Indian national weather service. The list of names were selected between 2000 and 2004 by the countries of the WMO/ESCAP Panel on tropical cyclones, before the actual naming of tropical cyclones began in September 2004. Contributing Nations List 1 List 2 List 3 List 4 List 5 List 6 List 7 List 8 Bangladesh Onil Ogni Nisha Giri Helen Chapala Ockhi Fani India Agni Akash Bijli Jal Leher Megh Sagar Vayu Maldives Hibaru Gonu Aila Keila Madi Roanu Makunu Hikaa Myanmar Pyarr Yemyin Phyan Thane Na−nauk Kyant Daye Kyarr Oman Baaz Sidr Ward Murjan Hudhud Nada Luban Maha Pakistan Fanoos Nargis Laila Nilam Nilofar Vardah Titli Bulbul Sri Lanka Mala Rashmi Bandu Mahasen Priya Asiri Gigum Soba Thailand Mukda Khai−Muk Phet Phailin Komen Mora Phethai Amphan ==South-West Indian Ocean (90°E - 30°E)== Within the South-west Indian Ocean, tropical and subtropical depressions that are judged to have 10-minute sustained windspeeds of 65 km/h, (40 mph) or more for at least 6 hours by the national weather service of Reunion Island are usually assigned a name. However it is the Mauritius and Madagascan national weather services who name the systems. The National weather service of Mauritius name the storm should it intensify into a moderate tropical storm between 55°E and 90°E; if the storm should intensify into a moderate tropical storm between 30°E and 55°E then the national weather service of Madagascar assigns the appropriate name to the storm. Tropical cyclones moving into this region from the Australian Region are renamed by the Sub-Regional Tropical Cyclone Advisory Center in Mauritius; however tropical cyclones moving into the Australian region do not get renamed. New name lists are used every year, whilst a name is normally only used once so thus no names are retired. 2010-11 Abele Bingiza Cherono Dalilou Elvire Francis Giladi Haingo Igor Jani Khabonina Lumbo Maina 2010-11 Naledi Onani Paulette Qiloane Rafael Stella Tari Unjaty Vita Willy Ximene Yasmine Zama ==Australian Region (90°E - 160°E)== Within the Australian Region there are five different offices that assign names to tropical cyclones. However, as three of the offices are run by the Australian national weather service, only 3 lists of names are operated. A tropical depression is judged to have intensified into a tropical cyclone if winds reach 65 km/h, (40 mph) and it is clear that gales are occurring more than halfway around the center. Significant tropical cyclones have their names retired from the lists and a replacement name selected at the next World Meteorological Organization Regional Association V Tropical Cyclone Committee meeting. When a tropical depression intensifies into a tropical cyclone between the Equator and 10°S and between 90°E and 125°E then it will be named by the Indonesian national weather service. Should a tropical low intensify into a tropical cyclone between the Equator and 10°S and between 141°E and 160°E are assigned names by the Tropical Cyclone Warning Center in Port Moresby, Papua New Guinea. Tropical Depressions intensifying into tropical cyclones in all other areas between 90°E and 160°E as well as the Equator and 40°S are named by the Australian national weather service. Should a tropical cyclone pass from one warning center to another it will retain its original name, except when moving into the South-West Indian Ocean where the Mauritius Meteorological Service will rename the system. ===Indonesia=== When a tropical depression intensifies into a tropical cyclone between the Equator and 10°S and between 90°E - 125°E, it will be named by the Indonesian Weather Service. Names are currently assigned in sequence from list A, while list B is a list of names that will replace names on list A that are retired. List A Anggrek Bakung Cempaka Dahlia Flamboyan Kenanga Lili Mawar Seroja Teratai List B Anggur Belimbing Duku Jambu Lengkeng Mangga Nangka Pisang Rambutan Sawo ===Australia=== When a tropical low intensifies into a tropical cyclone between 10°S and 40°S and between 90°E - 160°E, then it will be named by one of three Australian national weather service offices in Perth, Darwin, or Brisbane. Starting with Anika, the names are assigned in alphabetical order with the lists used in rotating order without regard to year. Anika Billy Charlotte Dominic Ellie Freddy Gabrielle Herman Ilsa Jasper Kirrily Lincoln Megan Neville Olga Paul Robyn Sean Tasha Vince Zelia ------ Anthony Bianca Carlos Dianne Errol Fina Grant Heidi Iggy Jasmine Koji Lua Mitchell Narelle Oswald Peta Rusty Sandra Tim Victoria Zane ------ Alessia Bruce Christine Dylan Edna Fletcher Gillian Hadi Ita Jack Kate Lam Marcia Nathan Olwyn Quang Raquel Stan Tatjana Uriah Yvette ------ Alfred Blanche Caleb Debbie Ernie Frances Greg Hilda Ira Joyce Kelvin Linda Marcus Nora Owen Penny Riley Savannah Trevor Veronica Wallace ------ Ann Blake Claudia Damien Esther Ferdinand Gretel Harold Imogen Joshua Kimi Lucas Marian Noah Odette Paddy Ruby Seth Tiffany Verdun ------ ------ ===Papua New Guinea=== When a tropical low intensifies into a tropical cyclone between the equator and 10°S and between 141°E \\- 160°E then it will be named by the Papua New Guinea's national weather service. Names from List A are assigned in a random order while list B details replacement names for list A which will be added in the bottom of list A to maintain the alphabetical order. List A Alu Buri Dodo Emau Fere Hibu Ila Kama Lobu Maila List B Nou Obaha Paia Ranu Sabi Tau Ume Vali Wau Auram ==Southern Pacific Ocean (160°E - 120°W)== Within the Southern Pacific a tropical depression is judged to have reach tropical cyclone intensity should it reach winds of 65 km/h (40 mph), and it is evident that gales are occurring at least halfway around the center. Tropical depressions that should intensify into a tropical cyclone between the Equator and 25°S and between 160°E - 120°W are named by the Fiji national weather service. Should a Tropical Depression intensify to the south of 25°S between 160°E and 120°W, it will be named in by the Fijian national weather service and the New Zealand's national weather service. Significant tropical cyclones have their names retired from the lists and a replacement name selected at the next World Meteorological Organization Regional Association V Tropical Cyclone Committee meeting, whilst tropical cyclones that move into the Australian region will retain its original name. List A Ana Bina Cody Dovi Eva Fili Gina Hagar Irene Judy Kerry Lola Mal List A Nat Olof Pita Rae Shelia Tam Urmil Vaianu Wati Xavier Yani Zita List B Arthur Becky Chip Denia Elisa Fotu Glen Hettie Innis Joni Ken Lin Mick List B Nisha Oli Pat Rene Sarah Tomas Ului Vania Wilma ------ Yasi Zaka List C Atu Bune Cyril Daphne Evan Freda Garry Heley Ian June Kofi Lusi Mike List C Nute Odile Pam Reuben Solo Tuni Ula Victor Winston ------ Yalo Zena List D Amos Bart Colin Donna Ella Frank Gita Hali Iris Jo Kala Leo Mona List D Neil Oma Pami Rita Sarai Tino ------ Vicky Wiki ------ Yolande Zazu ==Other areas== Tropical cyclone formation is rare within the Mediterranean sea, South Atlantic and to the east of 120W in the Southern Pacific, as a result there are no official naming lists for these areas although in 2004 & 2010 when tropical cyclones formed within the South Atlantic they were named as Catarina and Anita. ==Related pages== * List of previous tropical cyclone names * European windstorm names * List of Atlantic hurricane seasons * List of Pacific hurricane seasons * List of Pacific typhoon seasons * List of North Indian Ocean cyclone seasons * List of Southern Hemisphere tropical cyclone seasons * List of Australian region cyclone seasons * List of South-West Indian Ocean cyclone seasons * List of South Pacific cyclone seasons ==References== ==Other websites== * United States National Hurricane Center – RSMC Miami * United States Central Pacific Hurricane Center – RSMC Honolulu * Japan Meteorological Agency – RSMC Tokyo * India Meteorological Department – RSMC New Delhi * Météo-France – RSMC La Reunion * Indonesia Badan Meteorologi & Geofisika – TCWC Jakarta * Australia Bureau of Meteorology – TCWC Perth, Darwin, Brisbane * Fiji Meteorological Service – RSMC Nadi * Meteorological Service of New Zealand – TCWC Wellington Category:Tropical cyclones",
 "title": "Lists of tropical cyclone names"
}