{
 "id": "1070725",
 "text": "High Tor Vineyards was a prominent winery located in Clarkstown, New York. The vineyard, which opened in 1950, played a significant role in the history of winemaking in the Hudson Valley region. It was revived in 2022. == Winery Revival == In 2022, a nearby private winery that operated between 1960 and 1990 became available. The former Salowey Winery has now become the site of the reborn High Tor Vineyards, which seeks to combine the innovation of both the original High Tor Vineyards and the Salowey Winery through organic farming methods and unique grape variety selections. == History == === Early Years === High Tor Vineyards was established by Everett Crosby in 1950. Crosby was influenced by the work of winemaker Philip Wagner. High Tor Vineyards was the first winery to grow French-hybrid grapes in the Northeast. === Legacy Winery === For over 40 years and across 4 different owners, High Tor Vineyards established itself as one of the prominent East Coast wineries. Suburban economic pressures of increasing taxes and increasing land values made High Tor vulnerable to development. A controversial development proposal was combined with the controlled burning of a historic home on the property without any permits. The technical problems, combined with the burning of the historic home, resulted in strong local opposition. The local opposition led to the ultimate acquisition of the entire 54-acre property by the Palisades Interstate Park Commission for incorporation into the neighboring 500-acre High Tor State Park. After Crosby sold the vineyard, he documented his trials and tribulations of being a vineyard owner in his book, The Vintage Years: The Saga of High Tor Vineyards. Members of the public can still visit the site of the one-time winery and vineyard using a side trail in High Tor State Park off the Long Path, which is maintained by the NY-NJ Trail Conference. == References == Category:Companies based in New York (state) Category:Wine",
 "title": "High Tor Vineyards"
}