{
 "id": "1070170",
 "text": "Gordo is the nickname given to a dinosaur skeleton exhibited at Toronto's Royal Ontario Museum. It is the largest dinosaur skeleton on display in Canada. There is another of its species, of the same size, in the American Museum of Natural History in New York City. The official name of the skeleton is ROM 3670. It is one of the most complete specimens of the genus Barosaurus in North America.Museum Secrets. . The History Channel. (retrieved October 2013) It is more than long. It is exhibited in the James and Louise Temerty Galleries of the Age of Dinosaurs, and can also be seen from the outside in the museum's second-floor windows.Evans, David. \"Iconic Must See Treasures of the ROM\" . Royal Ontario Museum, (retrieved October 2013)Paleontologyworld, March 16, 2021 == Recent history of the skeleton == In 1912, a Carnegie excavation team unearthed three nearly complete Barosaurus skeletons in a quarry in Utah.Tucciarone, Joe. Barosaurus (retrieved October 2013) The quarry has become part of the Dinosaur National Monument Fossil Quarry, where a number of complete dinosaur specimens have been unearthed since its discovery in 1909. More than 70 tons of material were collected from the site for the Carnegie Museum in Pennsylvania. Around 1962, one of the skeletons from the Pennsylvania collection was transferred to the Royal Ontario Museum (ROM) in Toronto, Canada for their new dinosaur gallery.CTV.ca News Staff (2007). ROM to unveil rare dino bones found in basement. But once it arrived, it was put into storage, as the museum had run out of floor space in the gallery. The fossil material was left untouched for several years. In 2007, curator David Evans was looking for a sauropod specimen to add to the ROM's collection. (Barosaurus is a sauropod ) After reading an article detailing a specimen housed within the museum's collections, Evans found the specimen of Barosaurus that is now a centerpiece of ROM's dinosaur exhibit.Switek, Brian (2011). The Rediscovery of Gordo the Barosaurus Smithsonian Institution. (retrieved October 2013) Gordo is named for Gordon Edmunds, the curator who arranged for the skeleton to be brought to the ROM, and who had hoped to display it fully but was unable to.Anthony Reinhardt. A monster task - putting Gordo together, The Globe and Mail, Nov. 29, 2007.Zain Ahmed. Gordo the Barosaurus. Atlas Obscura. March 15, 2021. ==References== Category:Dinosaurs of North America Category:Fossils Category:Diplodocids",
 "title": "Gordo (dinosaur)"
}