{
 "id": "1070439",
 "text": "Tanner Emmanuel Buchanan (born December 8, 1998) is an American actor. He is best known for his roles as Leo Kirkman in the ABC political drama Designated Survivor and Robby Keene in the Netflix series Cobra Kai. He is also known for his role Cameron Kweller in the romantic comedy film He's All That. == Biography == Buchanan was born on December 8, 1998 in Lima, Ohio. His parents are Steve and Marlona Buchanan. He was raised in a Christian household and he attended Glandorf Elementary School in Ohio. He moved to Los Angeles with his family in 2007 to pursue his acting career. == Career == In 2010, Buchanan made his first appearance on television, playing a child role in the Modern Family series. Three years later he appeared in Grey's Anatomy, Major Crimes, and The Goldbergs. Buchanan had recurring roles on Girl Meets World, Game Shakers, and The Fosters. In 2016, Buchanan played his first main role on television, playing Leo Kirkman in the political drama series Designated Survivor. In 2018, Buchanan began playing Johnny Lawrence's estranged son Robby Keene in the YouTube Premium (and later Netflix) series Cobra Kai. Buchanan also starred in the remake of She's All That called He's All That. ==Filmography== ===Film=== Year Title Role Notes 2013 Jake Squared Sammy 2014 Guests Bobby Bell Short film 2014 Ellie Bowie Short film 2015 The Heyday of the Insensitive Bastards Bobby Bell 2015 Alone in the Dust Izzi Short film 2017 Anything Jack Sachman 2019 Max Winslow and the House of Secrets Connor Lawson 2019 Sinister Seduction Dylan Warren 2019 Painted Beauty Young Peter 2020 Chance Colton 2021 He's All That Cameron Kweller 2022 The Hyperions Apollo ===Television=== Year Title Role Notes 2010 Modern Family Kid #2 Episode: \"Halloween\" 2011 Untitled Jeff and Jackie Filgo Project Jimmy Unsold pilot 2012 The Real St. Nick Cynical Kid Television film 2013 Grey's Anatomy Lucas Episode: \"Idle Hands\" 2013 Major Crimes Michelle Brand Episode: \"Boys Will Be Boys\" 2013 Ghost Ghirls Hero Episode: \"Field of Screams\" 2013–2014 The Goldbergs Evan Turner 2 episodes 2014 Growing Up Fisher Slade Episode: \"Work with Me\" 2014 Mixology Young Dom Episode: \"Fab & Jessica & Dominic\" 2015 Girl Meets World Charlie Gardner Recurring role; 3 episodes 2015–2019 Game Shakers Mason Kendall Recurring role; 6 episodes 2016 The Fosters Jack Downey Recurring role; 6 episodes 2016–2018 Designated Survivor Leo Kirkman Main role; 28 episodes 2017 Fuller House Chad Brad Bradley 2 episodes 2018 The Goldbergs: 1990-Something Mike Stamm Schooled backdoor pilot 2018–2025 Cobra Kai Robby Keene Main role; 50 episodes 2020 Deputy Brendan Episode: \"10-8 Entitlements\" ==References== ==Other websites== * tanner-buchanan.com * Category:1998 births Category:Living people Category:American movie actors Category:American television actors Category:American stage actors Category:Actors from Ohio Category:People from Lima, Ohio",
 "title": "Tanner Buchanan"
}