{
 "id": "1070676",
 "text": "Madurese (; ), also known as Madurans, are an ethnic group native to the Indonesian island of Madura in the Java Sea. They speak the Madurese language and share a common history, traditions, and cultural identity. The Madurese are the fourth-largest ethnic group in Indonesia, and known for their contribution to the national dish Saté. Approximately six million native Madurese reside on Madura Island, with half a million living in eastern Java. Some Madurese form a subgroup called Pandalungan Madurese, speaking a mix of Javanese and Madurese languages. == Population and Distribution == Official data on the Madurese population in Indonesia vary. The 2010 census states they make up 3.03% of the country's population, around 7.2 million people. Some sources suggest larger figures of 10.5 to 10.8 million. Regardless, Madurese people are among Indonesia's largest ethnic groups, ranking fourth after the Javanese, Sundanese, and Batak. Historically, Madurese inhabit Madura Island, smaller islands in the Java Sea, and parts of Java and Kalimantan islands. Significant Madurese communities exist in Jakarta, Bali, Bangka Belitung Islands, and even in neighboring countries like Singapore. == Language and Religion == The Madurese people speak the Madurese language, a Madura- Kangeanic language in the Austronesian family. The language varies across Madura Island, with Sumenep Madurese considered the standard. Madurese is recognized by the East Java provincial government and is used as a co-official language in certain regions, mainly in Madura.Darrell T. Tryon, ed. (2011). Comparative Austronesian Dictionary: An Introduction to Austronesian Studies. Walter de Gruyter. . The majority of Madurese people practice Islam, mainly following the Sunni sect system of Nahdlatul Ulama. Muslim theologians play a important role in their spiritual and social life. Many Madurese individuals receive education in traditional local Muslim schools called Pondhuk Pâsantrèn, which also contribute significantly to their spiritual and social development.Лев Миронович Минц, ed. (2007). \"Ûрий Дмитриевич Анчабадзе\". Народы мира. ОЛМА Медиа Групп. p. 305. . == References == Category:Ethnic groups in Indonesia Category:East Java",
 "title": "Madurese people"
}