{
 "id": "1070122",
 "text": "Prophet Adam (آدم) holds a significant place in Islamic tradition as the first human being and the first prophet. His story, as narrated in the Quran and Hadith, emphasizes themes of creation, human nature, sin, repentance, and the beginning of human civilization. Here is a detailed account of his life and significance in Islam: Creation of Adam According to Islamic belief, Allah created Adam from clay and breathed life into him, making him the first human being. The Quran describes this event in several verses: “And [mention] when your Lord said to the angels, ‘Indeed, I will create a human being from clay. So when I have proportioned him and breathed into him of My [created] soul, then fall down to him in prostration.’” (Quran 38:71-72) The Role of Angels and Iblis Allah commanded the angels to bow down to Adam in recognition of his unique creation. All the angels obeyed except Iblis (Satan), who refused out of arrogance and pride. Iblis’s disobedience led to his expulsion from paradise and his role as an adversary to humanity: “And [mention] when We said to the angels, ‘Prostrate before Adam’; so they prostrated, except for Iblis. He refused and was arrogant and became of the disbelievers.” (Quran 2:34) Life in Paradise and the Forbidden Tree Adam and his wife, Hawwa (Eve), were placed in paradise and enjoyed its bounties with the condition that they should not approach a particular tree. However, Iblis tempted them, leading them to eat from the forbidden tree. As a result, they became aware of their nakedness and felt shame: “But Satan caused them to slip out of it and removed them from that [condition] in which they had been. And We said, ‘Go down, [all of you], as enemies to one another, and you will have upon the earth a place of settlement and provision for a time.’” (Quran 2:36) Repentance and Forgiveness After their disobedience, Adam and Hawwa realized their mistake and sought Allah’s forgiveness. Allah, in His mercy, accepted their repentance and forgave them: “They said, ‘Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.’” (Quran 7:23) Life on Earth Adam and Hawwa were sent down to earth to live, multiply, and begin human civilization. Adam was given the role of the first prophet to guide his descendants to worship Allah and live righteously. He is considered the father of all humanity and a model of repentance and humility. The Lessons from Adam’s Story The story of Adam in Islam teaches several important lessons: • The Nature of Human Beings: Humans are created with free will, capable of making choices, and responsible for their actions. • Temptation and Sin: Temptation is a part of human existence, and giving in to it leads to sin. However, repentance and seeking forgiveness are crucial aspects of faith. • God’s Mercy and Forgiveness: Allah’s mercy is vast, and He is always ready to forgive those who sincerely repent. • Humanity’s Purpose: Humans are created to worship Allah, seek knowledge, and act as stewards of the earth. Quranic References • Surah Al-Baqarah (2:30-39) • Surah Al-A’raf (7:11-25) • Surah Ta-Ha (20:115-123) • Surah Sad (38:71-85) Conclusion Prophet Adam’s story in Islam is foundational, highlighting the creation of humanity, the consequences of disobedience, and the importance of repentance. It sets the stage for the narratives of subsequent prophets and underscores the themes of faith, redemption, and the continuous struggle between good and evil. Adam is believed to have been the first human being on earth and the first prophet of Islam. He is said to have been 960 years of age when he died. Category:Islam",
 "title": "Adam in Islam"
}