{
 "id": "1071400",
 "text": "The 16th President and Vice President election of the Republic of China () took place on Taiwan on 13 January 2024. Voters elected the President and Vice President. There are three groups of nominees in this election. According to their registration numbers, they are Party Chairman Ko Wen-je(Chinese: 柯文哲) and non-district legislator(Chinese: 不分區立委) Cynthia Wu/Wu Hsin-ying(Chinese: 吳欣盈 ) (commonly known as \"Ko-Wu Mates（柯吳配）\" or \"Ko-Ying Mates（柯盈配）\") recommended by the Taiwan People's Party(TPP), and Vice President and Party Chairman William Lai/Lai Ching-te(Chinese: 賴清德 ) and former Representative to the United States Hsiao Bi-khim(Chinese: 蕭美琴) (commonly known as \"Lai-Hsiao Mates（賴蕭配）\" or \"Bi-Te Mates('Viture Mates')（美德配）\") recommended by the Democratic Progressive Party(DPP), as well as Mayor of New Taipei City Hou Yu- ih(Chinese: 侯友宜) and Broadcasting Corporation of China Chairman Jaw Shaw- kong(Chinese: 趙少康) (commonly known as \"Hou-Jaw Mates（侯趙配）\"or \"Hou-Kong Mates（侯康配）\" ) recommended by the Chinese Kuomintang(KMT). William Lai finally won the presidential election as Vice President. This election set a lot of historical records. It was the first presidential election since 2000 in which no nominee received more than half of the votes. It was also the first time since direct elections that a nominne from the same political party was elected for the third time continuously, breaking the previous precedent of political parties rotating every eight years. ==Candidates== ===Democratic Progressive Party=== ====Nominees==== 2024 Democratic Progressive ticket for President for Vice President Vice President of the Republic of China (2020–present) Representative of the Republic of China in the United States (2020–2023) ===Kuomintang=== ====Nominees==== 2024 Kuomintang ticket for President for Vice President x200px|border x200px|border Mayor of New Taipei (2018–present) Member of the Taipei City Council (1982 – 1986) ===Taiwan People's Party=== ====Nominees==== 65px|center|link=Taiwan People's Party2024 Taiwan People's ticket for President for Vice President x200px|border Mayor of Taipei (2014–2022) Member of the Legislative Yuan (2022–present) ===Other parties and independents=== ====Withdrawn candidates==== 2024 independent politician ticket for President for Vice President Founder and CEO of Foxconn (1974–2019) Actor, singer, writer * Wang Chien-shien (independent), President of Control Yuan (2008–2014) * Su Huan-chih (Taiwan Renewal Party), Tainan County Magistrate (2001–2010) Terry Gou, founder and CEO of Foxconn, and artist Lai Pei-hsia officially launched a citizen petition on September 17, 2023, as independent nominees for president and vice president, and passed the signature threshold on November 14 to obtain the qualifications to register for the election. However, On the 24th of the same month, they jointly announced their withdrawal from the candidacy. They were the first group of co-signatories to pass the co-signatory threshold but not register to run since the Republic of China switched to direct citizen election for the president. ==Polling== ==References== Category:2024 elections in Asia Category:January 2024 events 2024 Category:Presidential elections",
 "title": "2024 Taiwan presidential election"
}