{
 "id": "1071796",
 "text": "Taiwanese Hokkien or Taiwanese Minnan (臺灣閩南語), also known as Taigi or Taiwanese, is a type of Hokkien language spoken in Taiwan. Many Taiwanese people who came from southern Fujian speak it. It's one of the major languages used in Taiwan as about 70% of Taiwanese people speak it. Taiwanese is similar to Amoy Hokkien, Quanzhou Hokkien, and Zhangzhou Hokkien, as well as their versions in Southeast Asia like Singaporean Hokkien and Philippine Hokkien. It's easy to understand for about 3 million people, including those who speak Amoy Hokkien and Zhangzhou Hokkien in mainland China and Philippine Hokkien in the south. The popularity of Hokkien media from Taiwan has made the Taiwanese version more well-known, especially since the 1980s. == Classification == Taiwanese Hokkien is a type of Hokkien, which is a Southern Min language. Like many Min varieties, it has different types of words for formal and informal use. The formal words are from the late Tang dynasty and can be related to Middle Chinese. The informal words are believed to have come from the mainstream of Chinese around the time of the Han dynasty. The variations within the Taiwanese variant come from Hokkien spoken in Southern Fujian, particularly from Quanzhou and Zhangzhou, and later Amoy. Taiwanese also has words from Japanese and the native Formosan languages. Some scholars claim that part of the basic vocabulary of colloquial Taiwanese is related to the Austronesian and Tai language families, but this is debated. The formal Hokkien language once thrived in Fujian and was brought to Taiwan by early immigrants. Tale of the Lychee Mirror, a series of plays published in 1566, is one of the earliest known works in this language. However, this form of language is mostly extinct now.Ting, Pang-Hsin (1983). \"Derivation time of colloquial Min from Archaic Chinese\". Bulletin of the Institute of History and Philology. 54 (4): 1–14. == References == Category:Taiwan Category:Sino- Tibetan languages",
 "title": "Taiwanese Hokkien"
}