{
 "id": "107111",
 "text": "The Way of the Master (WOTM) is a Christianity based evangelism ministry. It was started in 2002. The show is hosted by American actor Kirk Cameron, and New Zealand-born evangelist Ray Comfort. The organization has a TV show, many books, and an online school. == Programs == === Television === The television show, first aired in December 2003. It is a half-hour show hosted by Cameron and Comfort, teaching principles of biblical evangelism. It also shows interviews they have with people on the streets. Two 13-episode seasons have been put on television.TV.com episode list They are broadcast by satellitesThe Way of the Master TV schedule to more than 100 countries.The Way of the Master It is also available on DVD. ==== Season 1 episodes ==== # The Firefighter # The Mirror of the Ten Commandments # The Motive of the Sinner # The Summary of Salvation # Practice What You Preach # Idolatry -- The Darling Sin of Humanity # The Beauty of a Broken Spirit -- Atheism # WDJD? # Blasphemy, Sabbath, Parents # Murder # Adultery # Theft # Lie and Covet ==== Season 2 episodes ==== #God's Wonderful Plan #Conscience #Alcatraz, Al Capone, Alcohol #True and False Conversion #When Things Go Wrong #The Satanic Influence #How to Witness to Someone Who's Gay #Evolution #How to Witness to a Loved One #The Fear of God #Ice Breakers -- Gospel Tracts #The Greatest Gamble #How to Get on Fire for God === Radio === The Way of the Master Radio program was hosted by Christian and former comedian Todd Friel. It also had regular appearances by both Comfort and Cameron. It has faith-related commentary, and humor from Friel, as well as many people evangelizing. The radio program ran from January 2006 until November 2008. == Living Waters Publications == Living Waters Publications (LWP) is like an online store for WOTM. It sells around 80 different gospel tracts. Some of which are the \"Million Dollar Bill,\" \"Giant $100 Bill,\" and \"Ten Commandments Coins.\" == References == == Other websites == * The Way of the Master * Way of the Master Radio * Living Waters Category:Christian organizations based in the United States Category:21st century in religion",
 "title": "The Way of the Master"
}