{
 "id": "1072032",
 "text": "Plant blindness or plant-neglect is a type of cognitive bias where people tend to overlook or ignore plant species. This bias includes not noticing plants in the environment, not recognizing the importance of plants in the biosphere and human affairs, viewing plants less important to animals, and not appreciating the unique features or beauty of plants. The term was coined by botanists J. H. Wandersee and E. E. Schussler in 1999.Wandersee, J. H., & Schussler, E. E. (1999). Preventing plant blindness. The American Biology Teacher, 61, 82–86. Some say that people may not notice plants because they are stationary and have similar colors. Cultural practices may also play a role. Studies indicate that individuals are better at detecting animals than plants in images, revealing a bias known as zoo-centrism. Plant blindness is thought to be connected to nature deficit disorder, potentially leading to reduced funding and fewer botany classes. == Effects == Plant blindness can have several potential effects, raising concerns about plant conservation and research. One major concern is the insufficient funding for plant conservation efforts. Even though plants make up 57% of endangered species, they receive only 3.86% of the funding allocated for endangered species. Additionally, plant blindness is believed to contribute to a shortage of research and education in plant science. Recent years have seen a decline in funding for plant science research, a decrease in interest in botany majors, and the termination of plant biology courses. This decline is worrisome as plant research plays a crucial role in advancing medicine and agriculture. == Disagreements == People have different opinions about the term \"plant blindness.\" Some argue that bias against non-vertebrate species, like insects, is widespread, not just limited to plants. Insects, such as beetles, are crucial for biodiversity, yet they are often overlooked in education and media. There is also disagreement about the name itself. Some find using the term \"blindness\" inappropriate and have proposed calling it \"Plant Awareness Disparity\" (PAD) instead. ==Related pages== * Speciesism ==References== Category:Plants Category:Environment",
 "title": "Plant blindness"
}