{
 "id": "1072542",
 "text": "Sayyid Badiuddin Shah Rashdi (Arabic : السيد بديع الدين شاه الراشدي (Urdu : سید بدیع الدین شاہ راشدی (Sindhi : سيد بديع الدين شاهه راشدي) (Born: May 16, 1926 1344 AH - January 8, 1996 - 1416 AH) also known as Sheikh Al-Arab wa-al- Ajam, was the founder and first Ameer of Jamiat Ahle Hadith Sindh, and also served as the Ameer of Markazi Jamiat Ahle Hadith Pakistan in 1987, He taught in the Grand Mosque of Makkah and Madinah, Islamic scholar from Sindh, associated with the Ahl al-Hadith School of thought, authored 108 books in Arabic, Sindhi Urdu, known for his expertise in hadith, jurisprudence, and Quranic interpretation. https://archive.org/details/fawaidmbrm_gmail_20170325/page/n5/mode/1up == Early life and education == Badi' ud-Din Shah al-Rashidi, born on May 16, 1926 (1344 AH - 1416 AH) in Gowth Fazalullah Shah Pir Jhando, Sindh, Pakistan, was the younger son of Sayyid Ihsanullah Shah Rashdi. He began his religious education at \"Darul Rashad\" Madirsah, where he memorized the Quran in three months. Guided by his father, he further studied Hadith, Tafsir, and Fiqh His notable teachers were Sanaullah Amritsari, his elder brother Sheikh Muhibullah Shah Al-Rashidi, Abu Muhammad Abdul Haq bin Abdul Wahed bin Muhammad bin Hashim Al-Hashimi, Sheikh Muhammad Khalil bin Muhammad Salim Al-Khairbouri, Sheikh Amin Muhammad Al-Kashi, Sheikh Bahaa al-Din Khan Jalalabadi, Sheikh Muhammad Ismail Al-Bint Gharbi, Sheikh Muhammad Shafee Al-Mankio Al-Sakarandi, Sheikh Abdul Karim Al-Nawab Shahi, and Sheikh Abdullah Al-Kahdari. == Students == Shaykh Badiuddin was a respected Islamic scholar who taught students from different countries. Some of his notable students were Sheikh Ali Amer Al- Yamani, Sheikh Omar bin Muhammad Al-Sabil, Sheikh Abdul Qadir bin Habibullah Al-Sindi, Sheikh Abdul Rab Faizullah from Pakistan, Sheikh Hamdi Abdul Majidi Al-Salafi, investigator Bashar Awad, Sheikh Wasi Allah Abbas, Sheikh Rabee al- Madkhali, Sheikh Muqbil bin Hadi al-Wadi'i, Shaykh Zubair Ali Zai and Shaykh Abdullah Nasir Rehmani == Death == Badi ud-Din Shah Rashdi died on January 8, 1996, in Karachi, and was buried in his ancestral village, Dargah Sharif Pir Jhando (Saeedabad). == References == Category:1926 births Category:1996 deaths Category:Hadith scholars",
 "title": "Allamah Sayyid Badiuddin Shah Rashdi"
}