{
 "id": "1072748",
 "text": "Winter Is Coming (2023) was a multi-night professional wrestling show made by All Elite Wrestling (AEW). It took place on December 13 and 16, 2023 at the College Park Center in Arlington, Texas and the Curtis Culwell Center in Garland, Texas. The event aired as special episodes of Dynamite, Rampage, and Collision respectively. It was the fourth Winter Is Coming event held by AEW. Night 1's main event saw Jon Moxley defeat Swerve Strickland in a Gold League match of the AEW Continental Classic tournament. Night 2's main event saw Top Flight (Dante Martin and Darius Martin) and Action Andretti defeat Komander, El Hijo del Vikingo, and Penta El Zero Miedo in a six-man tag team match. Night 3's main event saw Bryan Danielson defeat Brody King in a Blue League match of the AEW Continental Classic tournament. ==Matches== === Dynamite (aired live December 13) === No. Matches Stipulations Times 1 \"Hangman\" Adam Page defeated Roderick Strong (with Mike Bennett and Matt Taven) Singles match 14:35 2 Andrade El Idolo defeated Brody King AEW Continental Classic Blue League match 14:45 3 Riho defeated Ruby Soho Singles match 9:30 4 Rush defeated Jay Lethal by submission AEW Continental Classic Gold League match 4:30 5 Jay White defeated Mark Briscoe AEW Continental Classic Gold League match 11:00 6 Jon Moxley defeated Swerve Strickland AEW Continental Classic Gold League match 16:25 (c) – is the champion(s) going into the match ===Rampage (aired December 15)=== No. Matches Stipulations Times 1 Orange Cassidy and The Von Erichs (Marshall and Ross Von Erich) (with Danhausen) defeated Angelo Parker, Matt Menard, and Jake Hager Six-man tag team match 7:30 2 The Don Callis Family (Kyle Fletcher and Powerhouse Hobbs) (with Don Callis) defeated Hunter Grey and Paul Titan Tag team match 1:00 3 Anna Jay defeated Red Velvet by submission Singles match 8:30 4 Top Flight (Dante and Darius Martin) and Action Andretti defeated Komander, El Hijo del Vikingo, and Penta El Zero Miedo (with Alex Abrahantes) Six-man tag team match 13:00 (c) – is the champion(s) going into the match === Collision (aired live December 16) === No. Matches Stipulations Times 1 Claudio Castagnoli defeated Andrade El Idolo AEW Continental Classic Blue League match 15:34 2 Abadon defeated Jazmin Allure Singles match 8:20 3 Orange Cassidy (c) defeated Bryan Keith Singles match for the AEW International Championship 9:30 4 Kris Statlander and Willow Nightingale defeated Mercedes Martinez and Diamante Texas Street Fight 10:30 5 Brian Cage (with Prince Nana) defeated Kari Wright Singles match 1:20 6 Eddie Kingston defeated Daniel Garcia AEW Continental Classic Blue League match 12:12 7 Bryan Danielson defeated Brody King AEW Continental Classic Blue League match 15:12 (c) – is the champion(s) going into the match ==References== Category:2023 in sports Category:2023 in the United States Category:AEW Winter Is Coming Category:2020s in sports in Texas",
 "title": "Winter Is Coming (2023)"
}