{
 "id": "1072889",
 "text": "Muhammad Omer Nadeem, widely known as Omer Nadeem, is a Pakistani British singer, songwriter, composer, music producer, and entrepreneur. He is known for singing in Urdu, Punjabi, Hindi, and English. Nadeem opened Pakistan's first Console Gaming Lounge, 'Eclectic Vibrations,' in DHA, Lahore, in 2010. == Early Life == Omer Nadeem was born and raised in Lahore, Pakistan, in a Muslim family. His father served in the Pakistan Armed Forces, retiring as Lieutenant Colonel, and his mother was a retired Physics Professor. His musical inclination began in childhood, influenced by artists like Michael Jackson, Nusrat Fateh Ali Khan, Mohammed Rafi, and bands like Junoon and Vital Signs. Nadeem attended Garrison Academy for Boys and later studied at Government College University, Lahore, earning his BSc (Hons) in Applied Accounting from Oxford Brookes University. He moved to the United Kingdom, where he completed an MBA in International Business from Coventry University and became a qualified Chartered Certified Accountant. == Career == 2001–2004: Nadeem started his musical journey with Jal (Band) in 2001, later forming his band, Sifaar, in 2004. Despite Sifaar's brief tenure, Nadeem continued to contribute to the music scene. 2008: After a hiatus, Nadeem returned as a solo artist with the release of 'Dil Ka Diya' and collaborated with Khiza on the album 'Turning Point.' 2011–2018: Nadeem continued to release songs, including 'Teri Yaad' and 'Girti Deewar.' He also performed at prestigious venues like Wembley Arena. 2021–2022: Notable releases include the album 'Tera Ho Jaun,' featuring the songs 'Tum Na Aoge' and 'Tera Ho Jaun.' He collaborated with Zack Knight on 'Kamlee' and released 'Monotonic' with Mo-Hajir. December 2023: Nadeem became involved in a controversy surrounding Sonu Nigam's song 'Sun Zara,' accusing plagiarism. Nigam publicly apologized, acknowledging the unintentional dispute, sparking discussions on intellectual property in cross- border collaborations. == Bollywood == Nadeem contributed to Bollywood with songs like 'Sau Baar' from 'Yamla Pagla Deewana' and 'Baat Jo Thi (Yeh Dooriyan)' from 'Yeh Dooriyan.' He also sang for the Lollywood film 'Hijrat.' == Drama OSTs == Nadeem lent his voice to several drama OSTs, including 'Kis Tarah' (Samjhauta Express), 'Teri Meri Dosti,' 'Tu Mila Hai' (Mera Naam Yousuf Hai), and 'Rung.' Year Song Drama Notes 2012 Kis Tarah Samjhauta Express 2012 Teri Meri Dosti Teri Meri Dosti Composed and written by Tausif Ali 2014 Rung Rung Collaboration with Kiran Chaudhry 2015 Tu Mila Hai Mera Naam Yousuf Hai == Personal Life == Muhammad Omer Nadeem married Farah Omer in Lahore on August 28, 2015, and they have a daughter named Mishal Jehan Omer. == Discography == Year Song Film / Serial / Album / EP Notes 2004 Hadd Se The Classics Single - Sifaar Band / Omer Nadeem 2005 Bisaat Single - Sifaar Band / Omer Nadeem 2008 Dil Ka Diya - Forgetting The Classics Single 2009 Aey Khuda Turning Point Collaboration with Khiza 2009 Dil Ka Diya Turning Point Collaboration with Khiza 2009 Laut Aana - Bonus Track Turning Point Collaboration with Khiza 2010 Dil Ka Diya - Dance Mix Turning Point Collaboration with Khiza 2010 Tham Zara Spanish Beauty / My Brother's Wife Single 2011 Sau Baar Yamla Pagla Deewana Co-singer Shreya Ghoshal 2011 Baat Jo Thi (Yeh Dooriyan) Yeh Dooriyan Single 2011 Yeh Dooriyan Remix Yeh Dooriyan Single 2011 Baat Jo Thi Yeh Dooriyan (Unplugged Studio Rehearsal) Yeh Dooriyan Single 2011 Teri Yaad Collaboration with Khiza 2012 Teri Meri Dosti Teri Meri Dosti OST 2012 Teri Yaad - No One's Like You The Classics Co-singer Myra Nadeem 2012 Kin Raaston Pay The Classics Single 2012 Kis Tarah Samjhauta Express OST 2014 Rung Rung OST co-singer Kiran Chaudhry 2014 Girti Deewar - You are the Change The Classics Single 2015 Tu Aas Hai Meri Single 2015 Pyaray Baba / Pyari Beti Gao Suno Badlo OST co-singer Zenab Fatimah 2015 Tu Mila Hai Mera Naam Yousuf Hai OST co-singer Zenab Fatimah 2015 Abhi Mujh Mein Kahin - A Tear Drop New Renditions Single 2015 Naide Naide - Come Closer New Renditions Single 2015 Raabta - Heart Connects New Renditions Single 2015 Mere Bina - A Heart Prayer New Renditions Single 2015 Ek Baari Collaboration with Khiza 2016 Dildariyan Collaboration with Khiza 2016 Hai Sun Raha Khuda Hijrat Co-singer Sara Raza Khan 2016 Jab Koi Baat / Love Me Like You Do Single 2017 Jadon Yaad Collaboration with Khiza 2017 Jadon Yaad - Unplugged Live Collaboration with Khiza 2017 Mere Rashke Qamar Collaboration with Khiza 2018 Hadh Unplugged Single 2020 Sun Zara Single - Kamaal R. Khan (KRK) and Sapna Gill 2021 Tum Na Aoge Tera Ho Jaun Single 2021 Tera Ho Jaun Tera Ho Jaun Single 2021 Kabhi Raastay Ka Pata Diya Naat 2021 Labon Ko Single 2022 Kin Raaston Pay (Electric Version) Tera Ho Jaun Single 2022 Jaaneman Sun Zara Deshdrohi 2 Single - Kamaal R. Khan (KRK) and Sapna Gill 2022 Tujhe Dekha Tera Ho Jaun Single 2022 Laut Ana Tera Ho Jaun Single 2022 Marhaba Naat 2022 Dil Single 2022 Kamlee I Am Zack Knight Collaboration with Zack Knight 2022 Tu Apna Nahi Tera Ho Jaun Single 2022 Monotonic Collaboration with Mo-Hajir 2023 Sanu Ek Pal Mashup Single == References == Category:Pakistani singers Category:British singers Category:Living people",
 "title": "Omer Nadeem"
}