{
 "id": "1072974",
 "text": "Women who are raped sometimes get pregnant. Rape is often used in wars. It is also used as a form of genocide. Women also get raped in other circumstances, such as rape by a stranger, statutory rape, incest, and underage pregnancy. In these circumstances they may also get pregnant. Currently, people think, women who are raped are at least as likely to get pregnant than those who consented to having sex. Some studies suggest that women who are raped have a higher chance of becoming pregnant. Rape can cause difficulties during the pregnancy, and afterwards. These negative consequences can affect both the mother and the child. Medical treatment after a rape includes steps to see if a woman is pregnant, to prevent her from getting pregnant, and to manage the pregnancy, if she is pregnant. A woman who becomes pregnant after being raped must take a diffiicult decision: should she have an abortion, should she raise her child herself, or should she give the child up for adoption. In some countries where abortion is illegal after rape and incest, over 90% of pregnancies of girls age 15 and under are due to rape by family members. == History == For centuries, the belief that a rape almost never causes a pregnancy was widespread. This belief is false. In Europe, a man could use the fact that a woman was pregnant as a proof that he could not have raped her. This was possible from the Middle Ages until the 18th century. People believed that because she was pregnant, the woman had enjoyed the sex, and therefore consented to it. In recent decates, there are more organizations and polititcians that say abortion should not be legal, even after a rape. One of these peole was Todd Akin. These people and organizations have said that a pregnancy very rarely comes from rape, and that the practical relevance of such exceptions to abortion law is therefore limited or non-existent.Brian Clowes, The Facts of Life: An Authoritative Guide to Life & Family Issues, Chapter 3: Exceptions for Abortion: The Frequency of Rape-Caused Pregnancies (Human Life International, 1997). . == Rape in war and conflict == Rape has been used as a weapon of psychological warfare for centuries. It is used to terrorize, humiliate, and undermine the morale of the enemy. Rape was also used as an act of ethnic cleansing to produce babies that share the perpetrators' ethnicity. Forced pregnancy has been noted in places including Bangladesh, Darfur, and Bosnia. More broadly, pregnancy commonly results from wartime rape that was perpetrated without the intention of impregnating the enemy, as has been found in conflicts in East Timor, Liberia, Kosovo, and Rwanda. Gita Sahgal of Amnesty International commented that, rather than being primarily about \"spoils of war\" or sexual gratification, rape is often used in ethnic conflicts as a way for attackers to perpetuate social control and redraw ethnic boundaries. Children may be born to women and girls forced to \"marry\" abductors and occupiers; this happened in the Indonesian occupation of East Timor and in the Lord's Resistance Army's conflict in Uganda. Rape during war is recognized under United Nations Security Council Resolution 1820 as a war crime and a crime against humanity. \"Forced pregnancy\" is specifically listed as a war crime and crime against humanity in the Rome Statute. The Rome Statute was the \"first international criminal tribunal ever officially to criminalize forced pregnancy\". Children born as the result of wartime rape may be identified with the enemy. They grow up stigmatized and excluded by their communities. They may be denied basic rights or even killed before reaching adulthood. Children are particularly at risk for such abuse when they are visibly identifiable as sharing half their ethnicity with the occupying forces, as in the case of half-Arab children of Darfuri women raped by janjaweed soldiers as part of the war in Darfur. Children of war rape are also at risk due to neglect by traumatized mothers unable to provide sufficient care. == References == Category:Violence against women Category:Rape Category:Pregnancy and childbirth",
 "title": "Pregnancy from rape"
}