{
 "id": "1072221",
 "text": "Deaths in 2024 (list of). For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Every entry is backed by a source. If no reference is included, the death notice will be removed. Proper citations are used and no bare URLs so as to prevent link rot. The following are the requirements for adding a name to the list in its order: Name, age, origin, what the person is known for and his or her cause of death – if known – and a source for verification. ==December== ===31=== : *Arnold Rüütel, 96, Estonian politician, president (2001–2006), chairman of the Supreme Soviet (1990–1992) and the Presidium of the Supreme Soviet (1983–1990).96-aastaselt suri president Arnold Rüütel *Johnnie Walker, 79, English disc jockey (Radio Caroline, BBC Radio 1, BBC Radio 2), idiopathic pulmonary fibrosis.Tribute to Johnnie Walker MBE ===30=== *Jamshid bin Abdullah of Zanzibar, 95, Tanzanian Zanzibari royal, sultan (1963–1964).وفاة آخر سلاطين زنجبار عن عمر ناهز الـ 95 عامًا * Jan van Heukelum, 81, Dutch politician, senator (1995-2007).Oud-senator Van Heukelum (VVD) overleden * Liny van Oyen, 91, Dutch television presenter (Hoe schoon is jouw Huis?).Verdrietig nieuws voor Schoonmaken met Marja & Liny-fans *Arshad Pervez, 71, Pakistani cricketer (national team).Pakistan former int’l cricketer Arshad Pervez passes away * Karel Vuursteen, 83, Dutch top official (Philips, Heineken, AkzoNobel, TomTom).Met bulderlach en humor wist Karel Vuursteen ook Freddy Heineken voor zich te winnen ===29=== *Nigel Buesst, 86, Australian filmmaker (Dead Easy, Come Out Fighting, Compo).‘A legendary figure’: Nigel Buesst, filmmaker and educator, dead at 86 (death announced on this date) *Aleksei Bugayev, 43, Russian footballer (Torpedo Moscow, Tom Tomsk, national team), killed in action.Former Russian national team member killed in Ukraine war *Jimmy Carter, 100, American politician, president (1977–1981), governor of Georgia (1971–1975), Nobel Peace Prize laureate (2002).Jimmy Carter, 39th president and Nobel Peace Prize winner, dies at 100, his son says *Linda Lavin, 87, American actress (Alice, B Positive, Broadway Bound), Tony winner (1987), lung cancer.Linda Lavin Dies: ‘Alice’ Star & Tony-Winning Broadway Actor Was 87 * Hugo de Schepper, 90, Belgian-Dutch historian and university professor. ===28 === * Henk Bruysten, 78, Dutch musician (Long Tall Ernie and the Shakers, Hank the Knife and the Jets) and comic artist.Rock-'n-rollicoon Henk Bruysten (78), oprichter en frontman Hank The Knife & The Jets, overleden * Bendiks Cazemier, 93, Dutch politician, mayor of IJlst (1964-1970) and Wymbritseradeel (1970-1993).Oud-burgemeester Bendiks Cazemier overleden. 'Een burgemeester moet zijn als een goede kop koffie: warm en sterk' * Maria Jonas, German opera singer.Obituary: Mezzo-soprano Maria Jonas Dies (death announced on this date) *Jana Synková, 80, Czech actress (Calamity, Prachy dělaj člověka).Zemřela herečka Jana Synková. Tetě Kateřině ze Saturnina bylo 80 let ===27 === *Dayle Haddon, 76, Canadian model and actress (North Dallas Forty, Cyborg), carbon monoxide poisoning.Dayle Haddon, Model and Actress, Dies at 76 in Suspected Carbon Monoxide Leak *Olivia Hussey, 73, British-Argentine actress (Romeo and Juliet, Black Christmas, Jesus of Nazareth), cancer.‘Romeo and Juliet’ star Olivia Hussey dies at age 73 *Charles Shyer, 83, American screenwriter and film director (Private Benjamin, Father of the Bride, The Parent Trap).Oscar Nominated Writer/Director Charles Shyer Dies; ‘Private Benjamin’, ‘Father Of The Bride’ Filmmaker Was 83 ===26 === *Dick Capri, 93, American actor (They Still Call Me Bruce) and comedian, aortic dissection.Dick Capri Dies: Comedian & Broadway Actor Was 93 * Jan Plesman, 79, Dutch pilot.Uiver-held en KLM-piloot Jan Plesman (79) overleden: ’Humorvol en gepassioneerd vlieger’ *Manmohan Singh, 92, Indian politician, prime minister (2004–2014), MP (1991–2024), and minister of finance (1991–1996), heart disease.Former Prime Minister and senior Congress leader Manmohan Singh passes away at 92: Sources ===25 === *Mary Murphy, 85, American politician, member of the Minnesota House of Representatives (1977–2023), complications from a stroke.Longtime legislator, teacher Mary Murphy dies following stroke ===24 === * Jan Keja, 87, Dutch television director.Emmy Award-winnende regisseur Jan Keja (87) overleden *Richard Perry, 82, American record producer (\"You're So Vain\", \"Photograph\", \"Slow Hand\").Richard Perry, record producer behind ‘You’re So Vain’ and other hits, dies at 82 *Fons Roggeman, 85, Belgian painter.Latemse kunstschilder Fons Roggeman (85) overleden: \"Wanneer hij iets vertelde, hing iedereen aan zijn lippen *Gijs Versluys, 88, Dutch movie producer (Flesh and Blood, Havinck, Leedvermaak).Filmproducent Gijs Versluys (88) overleden (death announced on this date) ===23 === *Shyam Benegal, 90, Indian film director (Ankur, Nishant, Mammo) and politician, MP (2006–2012), kidney disease.Filmmaker Shyam Benegal passes away * Pierre Beaufays, 81, Belgian politician.Pierre Beaufays, tenor du PSC, s'en est allé *Zhaleh Olov, 97, Iranian actress (Wood Pigeon, Dash Akol, The Fateful Day).Legendary Iranian actress, voice performer Zhaleh Olov passes away * Tieleman van Rijnberk, 92, Dutch press photographer.Oud-fotograaf van Het Vrije Volk Tieleman van Rijnberk (92) overleden ===22 === *Geoffrey Deuel, 81, American actor (The Young and the Restless, The F.B.I., Chisum).Geoffrey Jacob Deuel * Jeroen Krom, 52, Dutch DJ and record producer.Jeroen Krom (1971-2024) was als een vis in het water in zijn platenzaak Outland en dat hij dichtging deed hem pijn ===21 === *Michelle Botes, 62, South African actress (American Ninja 2: The Confrontation, Arende, Isidingo), cancer.Michelle Botes dies at the age of 62 after a battle with cancer *Art Evans, 82, American actor (Die Hard 2, A Soldier's Story, Fright Night).Art Evans, ‘Die Hard 2’ and ‘A Soldier’s Story’ Actor, Dies at 82 *Elsbeth Gerritsen, 53, Dutch opera singer, breast cancer.Mezzo-Soprano Elsbeth Gerritsen has Died, Aged 53 *Don Martina, 89, Curaçaoan politician, prime minister of the Netherlands Antilles (1979–1984, 1986–1988).Ex prome minister di Antia Don Martina a bay sosega * Willy Meysmans, 94, Belgian sculptor.Kunstenaar Willy Meysmans overleden op 94-jarige leeftijd ===20 === *Ann Hartley, 81-82, New Zealand politician, MP (1999–2008), mayor of North Shore City (1989–1992).Former Labour MP, North Shore mayor Ann Hartley dies *Rickey Henderson, 65, American Hall of Fame baseball player (Oakland Athletics, New York Yankees, San Diego Padres), World Series champion (1989, 1993), pneumonia.Rickey Henderson, Baseball's Career Steals Leader, Dies at 65 ===19 === *Xie Fang, 89, Chinese actress (Two Stage Sisters, The Chinese Widow).著名电影表演艺术家谢芳今天凌晨去世 享年89岁 ===18 === *Alfa Anderson, 78, American singer (Chic).Alfa Anderson, Chic Vocalist and Disco Icon, dies at age 77 (death announced on this date) * Erik Brus, 60, Dutch editor, journalist and writer.Schrijver, redacteur, Sleutelaar-biograaf Erik Brus overleden (1964-2024) *John Marsden, 74, Australian writer (Tomorrow, When the War Began, So Much to Tell You).John Marsden, author of Tomorrow, When the War Began, dies aged 74 (death announced on this date) * Emiel Vermeir, 85, Belgian press phogotrapher, euthanasia. Gewezen persfotograaf Emiel Vermeir (85) overleden: “Hij had een neus voor nieuws” ===17 === *Thomas Berly, 92, Indian film director (Ithu Manushyano, Vellarikka Pattanam) and actor (Thiramala).Actor Thomas Berly passes away *Hans Biezen, 77, Dutch photographer.Kunstenaar en 'hoffotograaf' Van Abbemuseum Hans Biezen (77) overleden *Marisa Paredes, 78, Spanish actress (In a Glass Cage, Life Is Beautiful, Deep Crimson).Muere a los 78 años la actriz Marisa Paredes *Jānis Timma, 32, Latvian basketball player (ASK Riga, Zenit Saint Petersburg, Olympiacos), suicide.Oficiāli avoti: Maskavā bojā gājis Latvijas basketbolists Jānis Timma ===16 === *Guido Henderickx, 82, Belgian movie director. |title=Vlaams filmregisseur Guido Henderickx (82) overleden, bekend van ‘Verbrande Brug’ en ‘Moeder, waarom leven wij?’ *Prem Lal Singh, 87, Nepalese politician, MP (1999–2008) and mayor of Kathmandu (1992–1997), stomach disease.Former Mayor of Kathmandu Metropolis Singh passes away *Dick Van Arsdale, 81, American basketball player (New York Knicks, Phoenix Suns).'Original Sun' Dick Van Arsdale led rich basketball life, keyed by Phoenix's '76 playoff run ===15 === *Jaime Córdoba, 74, Curaçaoan politician, member (since 2010) and vice president (2012–2015) of the Parliament.Voormalig minister Jaime Cordoba overleden * Emmy Eerdmans, 93, Dutch painter, draughtsman and sculptor.death announcement, De Gelderlander *Fada Santoro, 100, Brazilian actress (La Delatora, Needle in the Haystack, Berlin to the Samba Beat).Fada Santoro, atriz da era de ouro do cinema nacional, morre aos 100 anos ===14 === *Mircea Diaconu, 74, Romanian actor (The Prophet, the Gold and the Transylvanians) and politician, minister of culture (2012) and MEP (2014–2019), colon cancer.A murit Mircea Diaconu. Actorul avea 74 de ani și suferea de o boală grea * Let de Stigter-Huising, 94, Dutch politician[=https://images.nrc.nl/uvqg57Duhaj6vNIC-JZdP8akk5A=/filters:no_upscale():format(jpeg):fill(f8f8f8,true)/s3/nrchub/clippings/NH/20241221/428-advertisement-280525_1333239_destigter-huising01ra-482360-893917.png death announcement at NRC Handelsblad] *Jan Zoet, 66, Dutch theater director, brain tumor.‘Ridder voor de kunsten’ Jan Zoet (1958-2024) was theaterman in hart en nieren ===13 === *Jaime Córdoba, 74, Curaçaoan politician, Minister for Social Development, Work and Welfare (2016-2017).Voormalig minister en parlementariër Jaime Cordobá overleden *Diane Delano, 67, American actress (Northern Exposure, Popular, The Ellen Show), cancer.'Northern Exposure' Actress Diane Delano Dies at 67 *Henk Herrenberg, 86, Surinamese ambassador and politician, Minister of Foreign Affairs (1986-1987).Henk Herrenberg overleden *Toʻlqin Tojiyev, 88, Uzbek actor (Mahallada duv-duv gap).Народный артист Узбекистана Тулкин Тожиев скончался в возрасте 88 лет ===12 === *Wolfgang Becker, 70, German film director (Good Bye, Lenin!, Life Is All You Get, Child's Play) and screenwriter.„Goodbye, Lenin“: Wolfgang Becker ist tot *Francesco Cinquemani, 57, Italian film director (Andron, Beyond the Edge, The Poison Rose), screenwriter, and journalist.Francesco Cinquemani: in ricordo del mio maestro *Fethi Haddaoui, 63, Tunisian actor (Kingdoms of Fire, Omar, Halfaouine: Boy of The Terraces).Décès de Fethi Haddaoui : la Tunisie perd un pilier de son art dramatique * Jaap Ramaker, 85, Dutch ambassador. * Pim Wiersinga, 70, Dutch writer.Pim Wiersinga overleden *David Weatherley, 85, British-born New Zealand actor (The Lord of the Rings: The Fellowship of the Ring, Power Rangers Operation Overdrive, Home and Away).David John Weatherley ===11 === ===10 === *Michael Cole, 84, American actor (The Mod Squad, General Hospital, It).Michael Cole, Actor on ‘The Mod Squad,’ Dies at 84 *María Socas, 65, Argentine actress (The Warrior and the Sorceress, Wizards of the Lost Kingdom, Deathstalker II).Murió la actriz María Socas a los 65 años *Albien Van Holsbeeck, 78, Belgian athlete and politician.Albien Van Holsbeeck op 78-jarige leeftijd overleden: “Hij sprong voor iedereen in de bres” In Memoriam Albien Van Holsbeeck *Lode Wils, 95, Belgian university professor and historian.Historicus Lode Wils overleden: \"Zonder twijfel de belangrijkste geschiedschrijver van de Vlaamse beweging\" ===9 === * Valère Depoorter, 94, Belgian politician, mayor of Avelgem (1980-1994).Voormalig burgemeester Valère Depoorter uit Avelgem overleden *Theo Meeuwsen, 86, Dutch association footballer (Vitesse).In Memoriam: Theo Meeuwsen (death announced on this date) *Arnold Yarrow, 104, British actor (Doctor Who, EastEnders), screenwriter and novelist.Arnold Yarrow 1920–2024 ===8 === * Henk Blok, 102, Dutch volleyball coachIn memoriam: Henk Blok *Dirk Demets, 74, Belgian association football player (K.V. Kortrijk).Dirk Demets, gewezen middenvelder van KV Kortrijk, is overleden *Şerif Gören, 80, Turkish film director (Umut, Yol), complications from a fall.Usta yönetmen Şerif Gören hayatını kaybetti *Mark Langaman, 42, Surinamese musician.‘Sambura master’ Mark Lassoe overleden *Erwin Nypels, 91, Dutch politician, MP (1967–1973, 1974–1982, 1982–1989).In Memoriam: Erwin Nypels ===7 === *Johan Abdullah, 75, Malaysian actor (29 Februari).Jangkitan kuman dalam darah, aktor Johan Abdullah meninggal dunia pada usia 75 tahun *Joshua Pandelaki, 65, Indonesian actor (Perempuan Berkalung Sorban, This Is Cinta, Like & Share).Aktor Senior Joshua Pandelaki Meninggal Dunia ===6 === *Leunus van Lieren, 71, Dutch horse breeder and dressage horse trainer.Toonaangevende Zeeuwse sportpaardenfokker Leunus van Lieren (71) overleden *Miho Nakayama, 54, Japanese singer (\"C\", \"You're My Only Shinin' Star\") and actress (Love Letter).Japanese actress Miho Nakayama passes away at 54, leaving a legacy of stardom (body discovered on this date) *Stanisław Tym, 87, Polish actor (The Cruise), comedian and journalist (Wprost, Polityka).Zmarł Stanisław Tym. Wielka postać polskiej kultury, aktor, satyryk, felietonista „Polityki” *Edwin Ysebaert, 64, Belgian radio and television presenter.Radio- en tv-presentator Edwin Ysebaert op 64-jarige leeftijd overleden ===5 === *Christel Bodenstein, 86, German actress (The Captain from Cologne, The Singing Ringing Tree, Viel Lärm um nichts).Gestorben: Christel Bodenstein (1938-2024) * Frederik Finisie, 66, Surinames politician, MP (1996-2018).Gewezen dc Frederick Finisie overleden * Bart Lensink, 99, Dutch zoologist, director of Artis. Oud Artis-directeur Bart Lensink stond aan de wieg van de moderne dierentuin (death announced on this date) * Jan Schmeitz, 71, Dutch journalist.Oud-correspondent Zuid-Amerika Jan Schmeitz (71) overleden *José de la Torre, 37, Spanish actor (Toy Boy).Muere el actor José de la Torre a los 37 años *John Williams, 78, South African rugby player (Northern Transvaal, national team) and coach.John Williams, the first Springbok coach post-isolation, has died ===4 === * Jack Hoogland, 78, Dutch football player (FC Volendam).Jack Hoogland viel pas op als hij niet meer meedeed; de 'stille motor' van Volendam op 78-jarige leeftijd overleden * Hugo Verbrugh, 87, Dutch physician, philosopher and columnist. In memoriam Hugo Verbrugh ===3 === *Jan Bloukaas, 25, South African singer, brain cancer.Beloved singer Jan Bloukaas dies at 25 *Inge Boulonois, 79, Dutch painter and poet.Voormalig stadsdichter van Heerhugowaard Inge Boulonois (79) overleden *Minny Luimstra-Albeda, 89, Dutch politician, senator (1992-1999).Oud-senator Minny Luimstra-Albeda (CDA) overleden * Tinus Naber, 88, Dutch horse breeder.Jantinus Naber, KWPN Breeder of the Year 2021, Passed AwayJantinus Naber *Ecaterina Oancia, 70, Romanian rower, Olympic champion (1984) and silver medallist (1988).S-a stins din viață Ecaterina Oancia, campioana olimpică din anii '80 *Mustapha Zaari, 79, Moroccan stage, movie and television actor (The Hyena's Sun, Chroniques blanches), prostate cancer.Moroccan Actor Mustapha Zaari Dies at 79 ===2 === * Lucjan Brychczy, 90, Polish footballer and manager * Paul van Gelder, 77, Dutch DJ.Nederland: Paul ‘Harkie’ van Gelder overleden ===1 === *Niels Arestrup, 75, French actor (The Beat That My Heart Skipped, A Prophet, War Horse).L’acteur Niels Arestrup est mort ==November== ===30 === *Lou Carnesecca, 99, American Hall of Fame basketball coach (New York Nets, St. John's Red Storm).Lou Carnesecca, St. John’s legend and Hall of Fame coach, dies at 99 *Hans Hammerschmid, 94, Austrian composer and pianist.Film composer dies at 94 *Eva Hermans-Kroot, 26, Dutch blogger and writer, lung cancer.Eva Hermans-Kroot uit Over mijn lijk op 26-jarige leeftijd overleden: ‘Zal er altijd een beetje bij blijven’. *Gunārs Placēns, 97, Latvian actor (The Silence of Dr. Evans).Mūžībā devies leģendārais aktieris Gunārs Placēns *Ian Redpath, 83, Australian cricketer.Australian cricket great Ian Redpath dies at 83 ===29 === *Bert De Coninck, 75, Belgian singer.Bert De Coninck (75) overleden: pionier van Nederlandstalige rock en Belpop *Marijke Ferguson, 97, Dutch musician and radio presenter.Presentator en programmamaker Marijke Ferguson (1927-2024) overleden *Jan Hendrikx, 83, Dutch politician, senator (2007-2011).Oud-Commissaris van de Koningin van Overijssel Jan Hendrikx overleden *Park Min-jae, 32, South Korean actor, cardiac arrest.Park Min-jae death: South Korean actor known for Little Women and True to Love dies at 32 ===28 === *Bill Battle, 82, American football player of the Alabama Crimson Tide and coach for the Tennessee Volunteers.Former Tennessee head coach Bill Battle dies *James Beauregard-Smith, 81, Australian convicted murderer and rapist.Murderer and rapist James Beauregard-Smith dies in Yatala Health Centre, parole board confirms *René De Rey, 93, Belgian cyclo-cross cyclist.Oud-veldritkampioen René De Rey overleden *Tom Hughes, 101, Australian barrister, politician, MP (1963–1972) and attorney-general (1969–1971).Former Attorney-General Tom Hughes, KC, dies aged 101 *Prince Johnson, 72, Liberian warlord, politician and senator (2006–2024).Liberian Ex-warlord Prince Johnson Dead: Party, Senate *Ananda Krishnan, 86, Malaysian conglomerate industry executive, founder of Usaha Tegas and Astro Malaysia Holdings.Ananda Krishnan Passes Away at 86 *Raymond Maffiolo, 86, Swiss footballer of the Servette and national team.Ex-Nati-Spieler Maffiolo (†86) gestorben *John McNamee, 83, Scottish footballer of the Newcastle United, Hibernian and Blackburn Rovers.Newcastle United hero John McNamee dies aged 83 as tributes paid to 'a giant of a man' (death announced on this date) *Silvia Pinal, 93, Mexican actress (Shark!, Viridiana, The Exterminating Angel).Muere Silvia Pinal, la histórica actriz del Cine de Oro Mexicano, tras ser hospitalizada de emergencia *Roeland Raes, 90, Belgian politician and senator (1991–2001).Oud-ondervoorzitter Vlaams Blok Roeland Raes (90) overleden ===27 === *Maria Alexandru, 84, Romanian table tennis player and world champion (1961, 1973, 1975).Doliu în tenisul de masă românesc: A murit multipla campioană Maria Alexandru *Georges Gilson, 95, French Roman Catholic prelate, archbishop of Sens (1996–2004) and bishop of Le Mans (1981–1996).Mgr Georges Gilson, ancien évêque de Sens et Auxerre est mort *Leonor González Mina, 90, Colombian singer and actress.Adiós a la ‘Negra Grande de Colombia’: Leonor González Mina murió a los 90 años *Thomas Hylland Eriksen, 62, Norwegian anthropologist.Thomas Hylland Eriksen er død *Claudio Isaac, 67, Mexican writer, actor and film director.Fallece Claudio Isaac, cineasta y escritor *Brian Jackson, 91, English cricketer from Derbyshire.Brian Jackson – Obituary *Vera Karpova, 91, Russian actress who starred in Son, Street Full of Surprises and Poor Poor Paul.Умерла актриса из фильмов «Улицы разбитых фонарей» и «Сын» Вера Карпова *Fedde Jonkman, 83, Dutch politician, mayor of Rijnsburg and mayor of Waddinxveen.Oud-burgemeester van Waddinxveen Fedde Jonkman (83) overleden *Mary McGee, 87, American Hall of Fame motorcycle racer.Mary McGee Dies. Motorsports Legend And Star Of Oscar-Contending Documentary ‘Motorcycle Mary’ Was 87 *Mighty Inoue, 75, Japanese professional wrestler of the AJPW, IWE and referee, heart issue.Japan’s Mighty Inoue Dead At 75 *Thanos Papadopoulos, 86, Greek actor (Law 4000, O striglos pou egine arnaki).Πέθανε ο Θάνος Παπαδόπουλος ===26 === *Jim Abrahams, 80, American film director and screenwriter (Airplane!, The Naked Gun, Hot Shots!).Jim Abrahams, ‘Airplane!,’ ‘Naked Gun’ and ‘Hot Shots!’ Master of Mirth, Dies at 80 *Karin Baal, 84, German actress (Tired Theodore, Rosemary, Between Shanghai and St. Pauli).Schauspielerin Karin Baal mit 84 Jahren gestorben *Bob Bryar, 44, American drummer (My Chemical Romance).Bob Bryar, Former My Chemical Romance Drummer, Dead at 44 (body discovered on this date) *Shalom Nagar, 88, Israeli prison guard, executioner of Adolf Eichmann.Shalom Nagar, reluctant hangman of Nazi war criminal Adolf Eichmann, dies aged 88 *Ted Troost, 88, Dutch physician and physiotherapist.Ted Troost (88), veelbesproken haptonoom van Gullit en Van Basten, overleden (death announced on this date) ===25 === *André Haakmat, 85, Surinamese politician and lawyer, deputy prime minister, minister of Foreign Affairs, minister of Justice and Police, minister of Justice and Police. André Haakmat overleden op 85-jarige leeftijd *Earl Holliman, 96, American actor (Police Woman, The Rainmaker, The Twilight Zone).Earl Holliman, Star of ‘The Rainmaker,’ ‘Forbidden Planet,’ Dies at 96 *Nikki Kaye, 44, New Zealand politician, MP (2008–2020), cancer.Former National minister Nikki Kaye dies (death announced on this date) *Raimo Piltz, 86, Finnish television director.Yleisradion ohjaajalegenda Raimo Piltz on kuollut *Paul Stroobants, 77, Belgian three-cushion billiards player.Leuvenaar Paul Stroobants (77), tweevoudig wereldkampioen en jarenlang voorzitter van KBC Zanzibar, overleden ===24 === *Barbara Taylor Bradford, 91, British-American novelist (A Woman of Substance, Hold the Dream).Barbara Taylor Bradford death: Best-selling A Woman of Substance novelist dies, aged 91 *Rico Carty, 85, Dominican baseball player (Atlanta Braves, Cleveland Indians, Chicago Cubs).Fallece el pelotero dominicano Rico Carty *Louis Debackere, 87, Belgian football player (Club Brugge K.V.).Former player Louis Debackere passed away (death announced on this date) *Helen Gallagher, 98, American actress (Hazel Flagg, Ryan's Hope, Pal Joey).2-Time Tony Winner Helen Gallagher Has Died at 98 *Jany Gastaldi, 76, French actress (Solemn Communion, Édith et Marcel, Mina Tannenbaum).La mort de Jany Gastaldi, comédienne emblématique du théâtre d’Antoine Vitez *Maurits Geuns, 87, Belgian football player (Royal Antwerp F.C.).Maurice Geuns (ex-Antwerp) op 87-jarige leeftijd overleden ===23 === *John Bernard, 87, Dutch weather presenter.Oud-weerman John Bernard (1937-2024) paste bij onheilspellend weer zijn toon aan\" (death announced on this date) *René Bom, 66, Dutch local personality, night mayor of The Hague, chronic obstructive pulmonary disease. Nachtburgemeester René Bom overleden: 'Ik eindig met een paar flauwe grappen' *Karel Holý, 68, Czech ice hockey player (Sparta Praha, Czechoslovakia national team, 1980 Olympics).Zemřel Karel Holý, ikona Sparty *Julio Medina, 91, Colombian actor (Zoot Suit, Ilona Arrives with the Rain).Murió Julio Medina, famoso actor que marcó la historia de la televisión en Colombia *Cynthia Zukas, 93, South African-born Zambian painter.Art Icon Cynthia Zukas has died ===22 === *Toni Price, 63, American country blues singer, brain aneurysm.Singer Toni Price, a Mainstay on Austin Stages, Has Died *Serge Vohor, 69, Vanuatuan politician, five-time prime minister.Vanuatu nightly News with Kizzy Kalsakau 22 November 2024 (Buzz) ===21 === *Jan Buisman, 99, Dutch historical geographer.obituary in NRC Handelsblad *Oswald Maes, 90, Belgian actor (Thuis).Oswald Maes, bekend als Rogerke uit ‘Thuis’, overleden: “Dankbaar dat we ons leven met hem konden delen” *Meghanathan, 60, Indian actor (Asthram, Malappuram Haji Mahanaya Joji, The Godman), lung disease.Meghnathan Passes Away: Noted Malayalam Actor Dies Due Lung Related Illness *Mohammad Nazir, 78, Pakistani cricketer (national team) and umpire.Pakistan’s former Test spinner Nazir Junior passes away after prolonged illness *Dirk Nuyts, 72, Belgian politician, mayor of Schilde.Oud-burgemeester van Schilde Dirk Nuyts (72) overleden: \"Sereen en integer politicus\" (death announced on this date) *Laura Samuel, 48, British violinist (Belcea Quartet, BBC Scottish Symphony Orchestra).Laura Samuel obituary: warm-hearted and generous orchestral leader *Zanna Albinović, 17, Bosnian national kickboxing team's member. ===20 === *Jean-Noël Carpentier, 54, French politician, deputy (2012–2017).«Je suis parti plus vite que ce que l’on espérait»: Jean-Noël Carpentier, maire de Montigny-lès-Cormeilles, est mort *Manousos Manousakis, 74, Greek film director (Cloudy Sunday), producer, and writer.Acclaimed Greek Director Manousos Manousakis Dies at 74 *Manohar Tahasildar, 78, Indian politician, four-time Karnataka MLA.Karnataka BJP leader Manohar Tahsildar passes away *Marie-Paule von Roesgen, 93, Luxembourgish actress (Wedding Night – End of the Song, Humains, Amour Fou).Marie-Paule von Roesgen am Alter vun 93 Joer gestuerwen ===19 === *Tony Campolo, 89, American sociologist and Baptist minister.Tony Campolo, sociologist and famed Red Letter Christian, has died *Roy Christian, 81, New Zealand rugby player (national team) and church minister.Kiwis mourn Roy Christian, legendary captain from historic tour *Glenn De Gendt, 50, Belgian singer.Get Ready!'s Glenn De Gendt dies *Henk van Rooy, 76, Dutch footballer (FC Den Bosch, Roda JC Kerkrade, NAC Breda, Willem II Tilburg, K.V. Mechelen), Alzheimer's disease.Oud-spits van Willem II, NAC en FC Den Bosch overleden *Saafir, 54, American rapper and producer.Rapper Saafir Dead at 54 ===18 === *Uma Dasgupta, 84, Indian actress (Pather Panchali).Uma Dasgupta passes away: Pather Panchali’s Apu, Subir Banerjee, remembers his ‘didi’ *Emile Jansen, 64, Dutch stage, television and movie actor (Goede tijden, slechte tijden, Zeg 'ns Aaa, Winter in Wartime).Voor GTST-acteur Emile Jansen (64) was acteren zijn leven, maar het was geen makkelijk bestaan: 'Je bent snel vergeten' *Colin Petersen, 78, Australian drummer (Bee Gees, Humpy Bong) and actor (Smiley).Colin ‘Smiley’ Petersen: Bee Gees Drummer Dies at 78 ===17 === *Bernard Chiarelli, 90, French footballer (Valenciennes, Lille, national team).Mort de Bernard Chiarelli, membre de l'épopée de l'équipe de France à la Coupe du monde 1958 ===16 === * Karel Lassche, 87, Dutch businessman.Selfmade zakenman Karel Lassche (87) overleden: een groot imperium, maar hij maakte niet enkel vrienden *Svetlana Svetlichnaya, 84, Russian actress (The Diamond Arm, Anna Pavlova, Goddess: How I fell in Love) Умерла Светлана Светличная ===15 === *Salwa Abu Khadra, 95, Palestinian politician.الرئيس ينعى المناضلة سلوى أبو خضرا *Elena Caragiu, 87, Romanian actress (The Lace Wars, Premiera).Actrita Elena Caragiu, fosta sotie a lui Toma Caragiu, a decedat in SUA, la varsta de 87 de ani *Lola Cordón, 88, Spanish actress (Seventeen).Fallece a los 88 años la actriz Lola Cordón *Al Ferrara, 84, American baseball player (Los Angeles Dodgers, San Diego Padres, Cincinnati Reds).Replay: Al Ferrara *Ulla Jessen, 77, Danish actress (Girls at Arms, Girls at Sea, Mind Your Back, Professor).Ulla Jessen er død *Jon Kenny, 66, Irish comedian and actor (The Banshees of Inisherin, Les Misérables, Father Ted), heart attack.Legendary Limerick actor and comedian Jon Kenny passes away *Friedrich Knapp, 73, German businessman (New Yorker).New Yorker-oprichter Friedrich Knapp overleden *Aleksandr Pankratov, 78, Russian film director (A Painter's Wife Portrait), cinematographer and screenwriter.Ушел из жизни заслуженный деятель искусств РФ, кинорежиссер Александр Андреевич Панкратов (1946-2024) *Yuriko, Princess Mikasa, 101, Japanese royal, member of the Imperial House, pneumonia.Princess Yuriko, sister-in-law of Emperor Showa, dies at 101 ===14 === *Vadim Brovtsev, 55, Russian businessman and politician, prime minister (2009–2012) and acting president of South Ossetia (2011–2012), heart attack.В Челябинской области скончался экс-председатель правительства Южной Осетии *Peter Sinfield, 80, English lyricist (\"21st Century Schizoid Man\", \"I Believe in Father Christmas\"), musician (King Crimson), and record producer.Peter Sinfield, songwriter and King Crimson lyricist, dead at 80 *Piet Zwaanswijk, 77, Dutch artist.Kleurrijke kunstenaar Piet Zwaanswijk (77) overleden. ‘Zo zacht en tegelijk zo stevig in zijn principes’ ===13 === *Barry Jordan, 66, South African church organist and composer.Voormalig Magdeburger Domorganist Barry Jordan (66) overleden *Paul Peters, 82, Dutch politician (senator) and physician.Oud-senator Peters (SP) overleden *Luis Soares, 60, Portuguese-French Olympic long-distance runner (1992).Ancien recordman de France du marathon, Luis Soares est mort *Shel Talmy, 87, American record producer (\"You Really Got Me\", \"My Generation\", \"Friday on My Mind\"), complications from a stroke.Shel Talmy, Early Producer for the Who and Kinks, Dies at 87 *Luis Ernesto Tapia, 80, Panamanian footballer (Alianza, national team), heart attack.Luto en Panamá: Cascarita Tapia fallece a los 80 años ===12 === *Wim Denie, 78, Dutch politician.Oud-burgemeester Wim Denie overleden, brand Moerdijk bleef aan hem plakken *Bent Mejding, 87, Danish actor (Matador, We Shall Overcome, 1864), pneumonia.Skuespiller Bent Mejding er død (death announced on this date) *Manoj Mitra, 85, Indian actor (Banchharamer Bagaan, Ghare Baire, Ganashatru), director and playwright. *Antoine Muylaert, 93, Belgian politician, mayor of Herdersem.Antoine Muylaert (93), de laatste burgemeester van Herdersem, is niet meer *Timothy West, 90, English actor (Coronation Street, EastEnders) and presenter (Great Canal Journeys).Timothy West, star of stage, screen and television, dies aged 90 ===11 === *Christian Godard, 92, French cartoonist (The Vagabond of Limbo), cancer.Christian Godard 1932-2024 ===10 === *Galliano Juso, 87, Italian film producer (Shoot First, Die Later, The Big Racket, The Heroin Busters) and screenwriter.Galliano Jusi, morto il produttore dei film del maresciallo Nico Giraldi con Tomas Milian *Stanley Rensch, 84, Surinamese human rights activist.Mensenrechtenactivist Stanley Rensch op 84-jarige leeftijd overleden *Bert Veldkamp, 72, Dutch bassist.Oud Kayak-bassist Bert Veldkamp (72) uit Groningen overleden ===9 === *Hassan Akesbi, 89, Moroccan footballer (Nîmes, Reims, national team).عن سن ال89.. الأسطورة حسن أقصبي يغادرنا إلى دار البقاء *Bobby Allison, 86, American Hall of Fame race car driver, founder of the Alabama Gang and three-time Daytona 500 winner.Bobby Allison, ‘Alabama Gang’ legend and Hall of Famer, dies at 86 *Judith Jamison, 81, American dancer and choreographer.Judith Jamison, influential dancer and choreographer, dies at 81, * Jack Staller, 82, Dutch illustrator and comics artist.Jack Staller (82) overleden *Alaaddin Yilmaz, 54, Turkish heart surgeon.Wereldbefaamde hartchirurg Yilmaz uit Hasselt verliest strijd tegen pancreaskanker ===8 === *Betty Bausch-Polak, 105 Dutch Holocaust survivor and resistance member.Holocaust-overlevende Betty Bausch-Polak (105) overleden *Fernando Fragata, 58, Portuguese film director (Backlight, Sorte Nula).Morreu Fernando Fragata, realizador de \"Pesadelo Cor-de-Rosa\" e \"Sorte Nula\" *Geneviève Grad, 80, French actress (The Troops of St. Tropez), cancer.Mort de Geneviève Grad, interprète du fameux « Douliou douliou Saint-Tropez » *June Spencer, 105, English actress (The Archers).The Archers radio star June Spencer dies aged 105 ===7 === *Sir Bom Gillies, 99, New Zealand soldier, last surviving member of the Māori Battalion.Last surviving Māori Battalion member dies *Shreegopal Vyas, 92, Indian politician, MP (2006–2012).Former Rajya Sabha Member from Chhattisgarh Shreegopal Vyas passes away ===6 === *Don Bosseler, 88, American football player (Washington Redskins).Don Bosseler, an All-American at Miami, NFL back, dies at 88 *Fabio Sartor, 70, Italian actor (Phantom of Death, The Passion of the Christ, La ladra).Fabio Sartor, morto a 70 anni l'attore veneto. I colleghi: «Uomo completo e ricco di talenti, mancherà a tutti» *Tony Todd, 69, American actor (Candyman, Platoon, Night of the Living Dead).Tony Todd Dies: ‘Candyman’ Star Whose Hundreds Of Credits Include ‘Platoon’ & ‘Final Destination’ Films Was 69 ===5 === *Marise Chamberlain, 88, New Zealand middle-distance runner, Olympic bronze medalist (1964).Marise Chamberlain mourned: NZ's only female track Olympic Games medallist dies, aged 88 *Sytze van der Zee, 85, Dutch writer and journalist, lung cancer.Oud-Paroolhoofdredacteur Sytze van der Zee (85) overleden ===4 === *Jonathan Brostoff, 41, American politician, member of the Wisconsin State Assembly (2015–2022) and the Milwaukee Common Council (since 2022).Milwaukee Alderman Jonathan Brostoff dies; represented city's east side *Jimmy Holley, 80, American politician, member of the Alabama House of Representatives (1974–1994) and Senate (1998–2022).Jimmy Holley ===3 === *Abderrazak Cheraït, 86–87, Tunisian writer and politician, mayor of Tozeur (1995–2008), deputy (2014–2019).Un pionnier du tourisme culturel : Abderrazak Cherait n'est plus *Quincy Jones, American arranger, composer. *Con Power, 71, Irish show jumper (European Show Jumping Championships bronze medalist, Aga Khan Cup winner (1977, 1978, 1979)).Captain Con Power passes away aged 71 *Guruprasad, 52, Indian film director (Eddelu Manjunatha, Mata, Director's Special).Kannada filmmaker Guruprasad passes away; suicide suspected (body discovered on this date) *Maita Sanchez, 55, Filipino actress (Sa Dulo ng Baril, Batas ng Lansangan) and politician, mayor of Pagsanjan (2010–2019), endometrial cancer.Actress-politician Maita Sanchez, wife of ER Ejercito, dies at 55 ===2 === *Janey Godley, 63, Scottish stand-up comedian and writer, ovarian cancer.Scottish comedian Janey Godley dies aged 63 *Jonathan Haze, 95, American actor (The Little Shop of Horrors, The Terror, It Conquered the World).Jonathan Haze Dies: Seymour In Original ‘Little Shop Of Horrors’ & Longtime Roger Corman Collaborator Was 95 *Clement Quartey, 86, Ghanaian boxer, Olympic silver medallist (1960).Clement Quartey,Ghana’s first Olympic medallist passes on *Alan Rachins, 82, American actor (L.A. Law, Dharma & Greg, The Spectacular Spider-Man), heart failure.Alan Rachins, Actor on ‘L.A. Law’ and ‘Dharma & Greg,’ Dies at 82 ===1 === *Loek Dijkman, 82, Dutch business person and philanthropist. |title=Filantroop en oprichter Orgelpark Loek Dijkman (82) overleden *Chuck Haytaian, 86, American politician, member (1982–1996) and speaker (1992–1996) of the New Jersey General Assembly.Rest in Peace, Chuck Haytaian (death announced on this date) ==October== ===31 === *Masud Ali Khan, 95, Bangladeshi actor (Dipu Number Two, Dui Duari, Molla Barir Bou).Masud Ali Khan no more ===30 === *Giovanni Cianfriglia, 89, Italian actor (Superargo Versus Diabolicus, Kill Them All and Come Back Alone, Everything Happens to Me) and stuntman.Addio a Giovanni Cianfriglia, attore anziate che aveva recitato con Terence Hill e Bud Spencer *Erik Clausen, 82, Danish actor (In the Middle of the Night), film director (The Dark Side of the Moon) and screenwriter (Temporary Release).Filmmanden Erik Clausen er død ===29 === *Nadia Cattouse, 99, Belizean-born British actress (Angels, Johnny Jarvis, Within These Walls), singer and songwriter.Nadia Cattouse dies at 99 *Teri Garr, 79, American actress (Tootsie, Young Frankenstein, Close Encounters of the Third Kind), multiple sclerosis.Teri Garr, Star of ‘Young Frankenstein’ and ‘Tootsie,’ Dies at 79 *Denys Graham, 98, Welsh actor (The Dam Busters, Dunkirk, Zulu).Denys Graham (death announced on this date) *Suzanne Osten, 80, Swedish film director (The Mozart Brothers, Mamma, The Guardian Angel) and screenwriter, complications from heart surgery.Dramatikern Suzanne Osten död *Hassan Youssef, 90, Egyptian actor (There is a Man in our House, Three Thieves).Egyptian Actor Hassan Youssef Passes Away at 90 (death announced on this date) ===28 === *Paul Morrissey, 86, American film director (Flesh, Trash, Flesh for Frankenstein), pneumonia.Paul Morrissey, Andy Warhol’s Cinematic Collaborator, Dies at 86 *Ulf Pilgaard, 83, Danish actor (Nightwatch, Cirkusrevyen, Nikolaj og Julie).Hans minde vil leve videre i vores hjerter«: Ulf Pilgaard er død *Elżbieta Zającówna, 66, Polish actress (Vabank), singer and television presenter.Nie żyje Elżbieta Zającówna. Słynna aktorka z \"Vabank\" miała 66 lat. \"Taką cię zapamiętamy\" ===27 === *Lily Li, 74, Hong Kong actress (The Wandering Swordsman, Executioners from Shaolin, The Young Master), lung cancer.李麗麗驚傳因癌症離世 70年代邵氏影星半生貢獻演藝事業 2020年宣布退休 ===26 === *William Beavers, 89, American politician, member of the Chicago City Council (1983–2006) and Cook County commissioner (2006–2013).Former Ald. William Beavers dies at 89 *Jim Donovan, 68, American sportscaster (Cleveland Browns Radio Network) and news anchor (WKYC), chronic lymphocytic leukemia.Former Cleveland Browns announcer, WKYC anchor Jim Donovan dies at 68 ===25 === *David Harris, 75, American actor (The Warriors, NYPD Blue, Brubaker), cancer.David Harris dead at 75: What was the actor’s cause of death who appeared in the 1979 movie The Warriors? *Kim Soo-mi, 75, South Korean actress (Barefoot Ki-bong, Late Blossom, Mapado).Kim Soo-mi, iconic actor and culinary star, dies at 75 *Phil Lesh, 84, American Hall of Fame musician (Grateful Dead) and songwriter (\"Box of Rain\", \"Truckin'\").Phil Lesh, Grateful Dead co-founder and bassist, dead at 84 ===24 === *Jadwiga Barańska, 89, Polish actress (Countess Cosel) and screenwriter.Nie żyje gwiazda \"Nocy i dni\" Jadwiga Barańska. Miała poważne problemy zdrowotne *Sabahattin Çakmakoğlu, 93, Turkish politician, minister of defense (1999–2002)Ex-minister Çakmakoğlu dies at 93 *Tom Jarriel, 89, American journalist and television correspondent (20/20, ABC World News Tonight).Tom Jarriel, former ABC News correspondent and anchor, dies at 89 (death announced on this date) ===23 === *Jack Jones, 86, American singer (\"Wives and Lovers\", \"Love Boat\") and actor (Over the Garden Wall).Jack Jones, famed singer and desert resident, dies at 86 *Rudy May, 80, American baseball player (Montreal Expos, New York Yankees, California Angels), complications from diabetes.MLB News: Former Yankees Pitcher, ERA Champion Dies ===22 === *Elizabeth Francis, 115, American supercentenarian, oldest person in the United States (since 2024).Elizabeth Francis, Oldest American, Dies at Age 115 (death announced on this date) *Dick Pope, 77, British cinematographer (Mr. Turner, The Illusionist, Motherless Brooklyn).Dick Pope BSC (1947-2024) (death announced on this date) *Fernando Valenzuela, 63, Mexican-American baseball player (Los Angeles Dodgers), franchise owner (Tigres de Quintana Roo) and broadcaster.Dodgers star Fernando Valenzuela, who changed MLB by sparking Fernandomania, dies at 63 ===21 === *Christine Boisson, 68, French actress (Emmanuelle, Identification of a Woman, Born for Hell), stomach cancer.Mort de l’actrice Christine Boisson qui a fait ses débuts dans Emmanuelle *Paul Di'Anno, 66, English heavy metal singer (Iron Maiden) and songwriter (\"Running Free\").Former Iron Maiden singer Paul Di'Anno dead at 66 ===20 === *Fethullah Gülen, 83, Turkish Muslim scholar and preacher, leader of FETO.Gülen’s death: the end of an era *Janusz Olejniczak, 72, Polish pianist and actor (The Pianist), heart attack.Janusz Olejniczak, who played the piano parts in Oscar-winning movie 'The Pianist,' dies at 72 ===19 === *Adamo Dionisi, 59, Italian actor (Dogman, Suburra, Enea).Adamo Dionisi, morto l'attore cult di «Suburra». Sperimentò anche il carcere, una delle ultime apparizioni in «Enea» di Pietro Castellitto *Vadiveloo Govindasamy, 92, Malaysian politician, president of the Dewan Negara (1992–1995).Former Dewan Negara president Vadiveloo dies at 92 ===18 === *Shujeo Shyam, 78, Bangladeshi music director (Hason Raja, Joyjatra).Shujeo Shyam passes away ===17 === *Vural Çelik, 53, Turkish actor (G.O.R.A, Everything's Gonna Be Great, Magic Carpet Ride).Avrupa Yakası'nın 'Kubilay'ı Vural Çelik, evinde ölü bulundu *Mitzi Gaynor, 93, American actress (There's No Business Like Show Business, The Birds and the Bees, South Pacific), singer and dancer.Mitzi Gaynor, Showbiz Dynamo and Star of ‘South Pacific,’ Dies at 93 *Toshiyuki Nishida, 76, Japanese actor (The Silk Road, Tsuribaka Nisshi 6, Emperor).Actor Toshiyuki Nishida Dies Aged 76 *Vasso Papandreou, 79, Greek politician and economist, European commissioner for jobs and social rights (1989–1992) and MP (1993–2012).Vasso Papandreou, a founding member of PASOK, dies *Debraj Roy, 74, Indian actor (Pratidwandi, Calcutta 71, Marjina Abdulla).‘Pratidwandi’ actor Debraj Roy passes away, CM condoles ===16 === *Paul McDonald Calvo, 90, Guamanian politician, governor (1979–1983) and senator (1971–1975).Today, we have truly lost a giant': Guam's former governor, Paul M. Calvo, dies at 90 *Liam Payne, 31, English singer (One Direction), fall.Liam Payne, former One Direction member, dies at 31 in Argentina hotel fall ===15 === *Ollie Olsen, 66, Australian musician (Max Q) and composer (Dogs in Space).Ollie Olsen (Max Q, Dogs In Space) Dies Aged 66 ===14 === *Thomas J. Donohue, 86, American business executive, president (1997–2019) and CEO of the U.S. Chamber of Commerce (1997–2021).Tom Donohue, former longtime Chamber CEO, dies *Jiří Hromada, 66, Czech actor (Who's That Soldier?), gay activist and actors' unionist.Zemřel herec a gay aktivista Jiří Hromada, roky vedl Hereckou asociaci *Atul Parchure, 57, Indian actor (The Kapil Sharma Show, Jaago Mohan Pyare, Bhago Mohan Pyare), cancer.Seasoned actor Atul Parchure passes away at 57 ===13 === *Peter Fregene, 77, Nigerian Olympic footballer (1968).Ex-Green Eagles goalkeeper, Peter Fregene, dies at 77 *Gyan Prakash Pilania, 92, Indian politician, MP (2003–2014).राजस्थान के पूर्व DGP और राज्यसभा सांसद रहे डॉ. ज्ञान प्रकाश पिलानिया का निधन, 20 दिनों से चल रहा था इलाज ===12 === *Oldřich Vlasák, 68, Czech politician, member (2004–2014) and vice-president (2012–2014) of the European Parliament.Zemřel bývalý europoslanec a hradecký primátor Vlasák, bylo mu 68 let ===11 === *Ronnie Dawson, 92, Irish rugby union player (Barbarian, national team, British & Irish Lions).Ronnie Dawson – An Icon Of Rugby *Vicente Juan Segura, 69, Spanish Roman Catholic prelate, bishop of Ibiza (2005–2020) and auxiliary bishop of Valencia (2020–2023).Fallece Vicente Juan Segura, obispo de Ibiza entre 2005 y 2020 *Abid Kashmiri, 74, Pakistani actor (Bazar-e-Husn, Samundar, Teesra Kinara) and comedian.Incredible actor Abid Kashmiri passes away in Lahore *Mario Morra, 89, Italian film editor (Red Roses for the Fuhrer, Cinema Paradiso).Morto Mario Morra, il montatore di ‘Nuovo cinema Paradiso’ di Giuseppe Tornatore (death announced on this date) ===10 === *Fleur Adcock, 90, New Zealand poet.Poet Fleur Adcock dies at 90 *Ethel Kennedy, 96, American human rights advocate, founder of Robert F. Kennedy Human Rights, complications from a stroke.Ethel Kennedy, matriarch of the famous family, dies at 96 ===9 === *Hugo Koolschijn, 77, Dutch actor (Soldier of Orange, Suzy Q).Acteur Hugo Koolschijn op 77-jarige leeftijd overleden *T. P. Madhavan, 88, Indian actor (Chirikkudukka, Arangum Aniyarayum, Aavanikunnile Kinnaripookkal), stomach disease.Mollywood actor T P Madhavan passes away at 88 *Elisa Montés, 89, Spanish actress (Django the Condemned, Samson and His Mighty Challenge, 99 Women).Muere Elisa Montés, actriz de 'Verano Azul' y madre de Emma Ozores, a los 89 años *Fritz von Friedl, 83, German-born Austrian actor (Ideal Woman Sought, Karl May).Schauspieler Fritz von Friedl im Alter von 83 Jahren verstorben *Ratan Tata, Chairman Emeritus of Tata Group, passed away on October 9 at the age of 87 ===8 === *Jorge Arriagada, 81, Chilean-French film composer (The Women on the 6th Floor, Bicycling with Molière, The Insomniac on the Bridge).Fallece Jorge Arriagada, destacado compositor chileno de música para cine *Luis Tiant, 83, Cuban baseball player (Boston Red Sox, Cleveland Indians, New York Yankees).Luis Tiant, Boston Red Sox pitching legend, dies at 83 ===7 === *Brian Hastings, 84, New Zealand cricketer (Canterbury, national team).Former world record holder Kiwi cricket batter Brian Hastings dies *Cissy Houston, 91, American singer (The Sweet Inspirations) and actress (The Preacher's Wife), Grammy winner (1997, 1999), complications from Alzheimer's disease.Cissy Houston, Whitney Houston’s mother and a Grammy-winning singer, dies at 91 *Jack Ponti, 66, American songwriter (\"Hey Stoopid\", \"Love's a Loaded Gun\") and record producer.Jack Ponti (Giacomo Pontoriero) *Nicholas Pryor, 89, American actor (Beverly Hills, 90210, Port Charles, Risky Business), cancer.Nicholas Pryor Dies at 89 ===6 === ===5 === *A. Q. M. Badruddoza Chowdhury, 93, Bangladeshi politician, president (2001–2002), lung infection.Ex-president Badruddoza Chowdhury dies at 93 *Naima Lamcharki, 81, Moroccan actress (Casablanca, Nest of Spies, Blood Wedding).Décès de Naïma Lamcharki: une étoile du cinéma et de la télévision s’éteint ===4 === *Willi Giesemann, 87, German footballer (Hamburger SV, HSV Barmbek-Uhlenhorst, West Germany national team).Der HSV trauert um Willi Giesemann *Emiliano Queiroz, 88, Brazilian actor (Madame Satã, Xuxa e os Duendes, A Wolf at the Door).Morre Emiliano Queiroz aos 88 anos no Rio de Janeiro ===3 === *Michel Blanc, 72, French film director (Grosse fatigue, Summer Things) and actor (Marche à l'ombre), heart attack.Michel Blanc est mort *Keerikkadan Jose, 72, Indian actor (Kireedam, Mimics Parade, Customs Diary).Malayalam Actor Mohanraj, Known as 'Keerikkadan Jose,' Passes Away ===2 === *Ken Tobias, 79, Canadian singer-songwriter (\"Stay Awhile\"), brain cancer.Singer-songwriter Ken Tobias dies at 79 *Daniel Williams, 88, Grenadian politician and lawyer, governor-general (1996–2008).Grenada’s former GG Sir Daniel Williams has died ===1 === *Jean-Claude Bourbault, 79, French actor (Les Uns et les Autres, Paris Lockdown).Val-de-Reuil : directeur emblématique du cinéma et fondateur du Cin'été, Jean-Claude Bourbault est décédé *Denílson, 81, Brazilian footballer (Fluminense, national team).Morre Denílson, o \"rei Zulu\", campeão brasileiro pelo Fluminense em 1970 ==September== ===30=== *Park Ji-a, 52, South Korean actress (Breath, Epitaph, Masquerade), ischemic stroke.Park Ji Ah, known for her role in 'The Glory,' dies at 52 *Pete Rose, 83, American baseball player (Cincinnati Reds, Philadelphia Phillies, Montreal Expos).Embattled MLB legend Pete Rose, all-time hits leader, dies at 83 ===29=== *Martin Lee, 77, English singer (Brotherhood of Man) and songwriter (\"Save Your Kisses for Me\", \"Angelo\"), heart failure.Eurovision winner Martin Lee, from band Brotherhood of Man, dies aged 77 ===28=== *Winfield Dunn, 97, American politician, governor of Tennessee (1971–1975).Winfield Dunn, 43rd Governor of Tennessee, Passes Away *Drake Hogestyn, 70, American actor (Days of Our Lives, Seven Brides for Seven Brothers), pancreatic cancer.Days of Our Lives Superstar Drake Hogestyn (John) Dies at 70 *Kris Kristofferson, 88, American musician (The Highwaymen), songwriter (\"Me and Bobby McGee\") and actor (A Star Is Born), Grammy winner (1972, 1974, 1975).Kris Kristofferson, Country Music Legend and ‘A Star Is Born’ Leading Man, Dies at 88 *Glauco Mauri, 93, Italian actor (China Is Near, Deep Red, Ecce Bombo) and theatre director.È morto Glauco Mauri, decano del teatro ===27=== *Dame Maggie Smith, 89, British actress (The Prime of Miss Jean Brodie, Harry Potter, Downton Abbey), Oscar winner (1969, 1978).Actress Dame Maggie Smith dies at 89 ===26=== *John Ashton, 76, American actor (Beverly Hills Cop, Some Kind of Wonderful, Midnight Run), cancer.'Beverly Hills Cop' actor John Ashton dead at 76 *Neelam Karwariya, 55, Indian politician, Uttar Pradesh MLA (2017–2022).UP: Former BJP MLA Neelam Karwaria passes away ===25=== *Roman Madyanov, 62, Russian actor (Hopelessly Lost, Private Detective, or Operation Cooperation, Leviathan), lung cancer.Умер актер Роман Мадянов ===24=== *Pierre-William Glenn, 80, French cinematographer (Day for Night) and film director.Disparition de Pierre-William Glenn ===23=== *Tomris Giritlioğlu, 67, Turkish film director (Mr. Salkım’s Diamonds, Pains of Autumn) and producer, cancer.Yönetmen ve Yapımcı Tomris Giritlioğlu Hayatını Kaybetti *Freddie Salem, 70, American guitarist (Outlaws), cancer.Freddie Salem Dies: Guitarist For Southern Rockers The Outlaws Was 70 (death announced on this date) ===22=== *W. Jayasiri, 77, Sri Lankan actor (Seilama, Visidela, Sudu Kaluwara).Veteran Sri Lankan Actor W. Jayasiri Dies At The Age Of 77, Leaving Behind A Rich Legacy *Koos van der Merwe, 87, South African politician, MP (1977–2014).Voormalige parlementslid, Koos van der Merwe oorlede *Akkaphan Namart, 39, Thai actor (Sapai Glai Peun Tiang, Satja Nai Chum Joan), heart cancer.Thousands of fans mourn the death of Channel 7 star Akkaphan ===21=== *Al McCoy, 91, American sportscaster (Phoenix Suns).Phoenix Suns Ring of Honor member Al McCoy passes away at 91 (death announced on this date) ===20=== *Kathryn Crosby, 90, American singer and actress (The 7th Voyage of Sinbad, Anatomy of a Murder, Operation Mad Ball).Kathryn Crosby, ‘7th Voyage of Sinbad’ Actress and Wife of Bing Crosby, Dies at 90 *Barbara Horawianka, 94, Polish actress (Passenger, Maria and Napoleon, Colonel Kwiatkowski).Barbara Horawianka nie żyje. Wystąpiła w dziesiątkach filmów i sztuk teatralnych *Milena Jindrová, 80, Czech basketball player (Slavia VŠ Praha, national team).Czech basketball Player of the Century Milena Jindrová dies at 80 *Petar Krelja, 84, Croatian film director (Southbound Train, Below the Line, The Four Seasons).Croatian director and film critic Petar Krelja has died *Eddie Low, 81, New Zealand musician, cancer.Entertainer Eddie Low dies aged 81 *Eddin Syazlee Shith, 50, Malaysian politician, MP (2018–2022).Former deputy minister Eddin Syazlee Shith dies *Cleo Sylvestre, 79, British actress (Crossroads, Paddington, All Creatures Great and Small).Trailblazing actress Cleo Sylvestre dies aged 79 *Radmila Živković, 71, Serbian actress (Variola Vera, The Meeting Point, Kuduz).Preminula glumica Radmila Živković ===19=== *Daniel Fanego, 69, Argentine actor (El Angel, Moon of Avellaneda, Coven), cancer.A los 69 años, murió el actor Daniel Fanego ===18=== *Salvatore Schillaci, 59, Italian footballer (Messina, Juventus, national team), colon cancer.Addio a Totò Schillaci, se ne va il bomber delle Notti Magiche. Aveva 59 anni ===17=== *Nelson DeMille, 81, American novelist (The General's Daughter, Plum Island, The Charm School), esophageal cancer.Nelson DeMille, 81, bestselling author, Long Islander, has died *JD Souther, 78, American singer-songwriter (\"You're Only Lonely\", \"Her Town Too\", \"New Kid in Town\").JD Souther, Singer Who Co-Wrote Eagles Classics Like ‘New Kid in Town,’ Dies at 78 ===16=== *Billy Edd Wheeler, 91, American singer and songwriter (\"Jackson\" , \"It's Midnight\", \"Coward of the County\"). ===15=== *Leonid Burlaka, 85, Ukrainian cinematographer (Faithfulness, The Meeting Place Cannot Be Changed).Пам’ятатимемо… *Geoffrey Hinsliff, 87, English actor (Coronation Street, Brass, Doctor Who).Geoff Hinsliff obituary *Tito Jackson, 70, American musician (The Jackson 5).Tito Jackson, Jackson 5 Member and Brother of Michael Jackson, Dead at 70 *Dinos Karydis, 85, Greek actor (Dancing the Sirtaki, My Daughter, the Socialist).Πέθανε σε ηλικία 85 ετών ο ηθοποιός Ντίνος Καρύδης ===14=== *Jean-Michel Dupuis, 69, French actor (Little Marcel, Dossier 51, La Boum).Mort du comédien Jean-Michel Dupuis, second rôle chez Claude Lelouch et Edouard Molinaro *Sadreddin Hejazi, صدرالدین حجازی) ) 76, Iranian actor (The Gun Loaded, Santouri, Doubt).Long-serving Iranian actor Sadreddin Hejazi dies at 76 *Jaber Al-Mubarak Al-Hamad Al-Sabah, 82, Kuwaiti royal, prime minister (2011–2019) and minister of defense (2001–2011).Former Kuwaiti Prime Minister Sheikh Jaber Mubarak Al Sabah dies at 82 ===13=== *Franca Bettoia, 88, Italian actress (L'uomo di paglia, The Last Man on Earth, Sandokan Against the Leopard of Sarawak).E' morta Franca Bettoja, la moglie di Ugo Tognazzi *Tommy Cash, 84, American country musician (\"Six White Horses\").Tommy Cash, Country Singer and Brother of Johnny Cash, Dead at 84 *Frank Misson, 85, Australian cricketer (New South Wales, national team).Former Australia fast bowler Frank Misson dies aged 85 (death announced on this date) ===12=== *Aussie Malcolm, 83, Australian-born New Zealand politician, MP (1975–1984), minister of immigration (1981–1984) and health (1981–1984).Former minister and America's Cup director, Aussie Malcolm dies (death announced on this date) ===11=== *Kenneth Cope, 93, English actor (Randall and Hopkirk (Deceased), Coronation Street, The Damned).Randall and Hopkirk star Kenneth Cope dies aged 93 *Alberto Fujimori, 86, Peruvian politician, president (1990–2000), cancer.Alberto Fujimori, a former president of Peru who was convicted for human rights abuses, dies at 86 ===10=== *Maria Politseymako, 86, Russian actress (Success, 100 Days Before the Command, The Parrot Speaking Yiddish).Умерла старейшая актриса Театра на Таганке Марина Полицеймако ===9=== *James Earl Jones, 93, American actor (Star Wars, Fences, The Lion King), Tony winner (1969, 1987).James Earl Jones Dies: Revered ‘Field Of Dreams’ Star, Darth Vader & ‘Lion King’ Voice Was 93 *Lee Hoi-sang, 83, Hong Kong actor (The 36th Chamber of Shaolin, The Incredible Kung Fu Master, Shaolin and Wu Tang) and martial artist.83岁TVB老戏骨李海生去世，曾多次与成龙合作，是狄龙师兄 *Jeffrey Titford, 90, British politician, MEP (1999–2009).Jeffrey Titford obituary: funeral director who kept Ukip afloat ===8=== *Toni d'Antonio, 51, Belgian actor (The Barons, Houba! On the Trail of the Marsupilami, Night Call).Le comédien Toni d'Antonio est décédé à l'âge de 51 ans *Henny Moan, 88, Norwegian actress (Nine Lives, Lake of the Dead, O' Horten).Den folkekjære skuespilleren Henny Moan ble 88 år *İlkan Karaman, 34, Turkish basketball player (Fenerbahçe, Tofaş Bursa, Brooklyn Nets), traffic collision.Milli basketbolcu İlkan Karaman hayatını kaybetti *Vikas Sethi, 48, Indian actor (Kyunki Saas Bhi Kabhi Bahu Thi, Kahiin to Hoga, Kasautii Zindagii Kay), heart attack.Kyunki Saas Bhi Kabhi Bahu Thi Actor Vikas Sethi Dies At 48 Due To Cardiac Arrest *Snezana Stameska, 78, North Macedonian actress (The Meeting Place Cannot Be Changed, To the Hilt, The Liberation of Skopje).Die Schauspielerin Snezhana Stameska ist gestorben *Wu Chien-pao, 73, Taiwanese politician and convicted game fixer, member (1998–2011) and speaker (2002–2010) of the Tainan City Council, esophageal cancer.捲中職假球案剛獲假釋…台南前議長吳健保病逝 家屬悲慟證實 ===7=== *Dan Morgenstern, 94, German-born American music journalist (Jazz Journal, DownBeat) and archivist, eight-time Grammy winner, heart failure.Jazz historian and critic Dan Morgenstern dies at 94 ===6=== *Armand de Fluvià, 92, Spanish genealogist and heraldist, respiratory failure.Muere Armand de Fluvià, heraldista y referente de la lucha por la liberación gay *Will Jennings, 80, American lyricist (\"My Heart Will Go On\", \"Higher Love\", \"Looks Like We Made It\").Will Jennings, Lyricist For ‘Tears in Heaven,’ ‘My Heart Will Go On,’ Dies *Marie Michele St. Louis, 55, Mauritian Olympic judoka (1996).Au revoir Marie-Michèle *Ron Yeats, 86, Scottish football player (Liverpool, national team) and manager (Tranmere Rovers), complications from Alzheimer's disease.Liverpool FC is mourning the passing of legendary former captain Ron Yeats ===5=== *Manuel Antín, 98, Argentine film director (Don Segundo Sombra, Circe, The Venerable Ones).Murió Manuel Antín, cineasta y director de la Universidad del Cine que abolió la censura *Rebecca Cheptegei, 33, Ugandan Olympic long-distance runner (2024), burns.Ugandiska OS-löparen Rebecca Cheptegei är död *Jorge Rivera López, 90, Argentine actor (Pobres habrá siempre, La Mary, Proceso a la infamia).Falleció el actor Jorge Rivera López, histórico dirigente de nuestro sindicato *Sérgio Mendes, 83, Brazilian bossa nova musician (\"The Look of Love\", \"The Fool on the Hill\", \"Never Gonna Let You Go\"), complications from long COVID.Sérgio Mendes Dies: Brazilian Pop Pioneer, Hit Maker & Herb Alpert Collaborator Was 83 *Laurent Tirard, 57, French film director (Little Nicholas, Asterix and Obelix: God Save Britannia, Return of the Hero).Le réalisateur Laurent Tirard est mort, à l’âge de 57 ans ===4=== *Bora Đorđević, 71, Serbian singer-songwriter (Riblja Čorba), pneumonia.Umrl je Bora Đorđević, frontman Riblje čorbe *Bernie Mireault, 63, Canadian comic book artist (The Jam), suicide.È morto Bernie Mireault, fumettista underground e collaboratore di Neil Gaiman e Matt Wagner (death announced on this date) ===3=== *Selva Alemán, 80, Argentine actress (Asesinato en el Senado de la Nación, Count to Ten, Malparida), heart attack.Actress Selva Alemán died at the age of 80 | Emblem of cinema, theater and television *Miguel Bermúdez, 80, Argentine actor (Buenos Aires, Summer 1912, The Desire to Live).Murió Miguel Bermúdez, expareja de Carlos Perciavalle ===2=== *James Darren, 88, American actor (Gidget, T. J. Hooker, Star Trek: Deep Space Nine).James Darren, Teen Idol Actor in ‘Gidget,’ Singer and Director, Dies at 88 *Kong Sam Ol, 94, Cambodian politician, MP (since 1993), minister of agriculture (1986–1989) and the Royal Palace (since 1998).Samdech Kong Sam Ol Passes Away at Age 94 ===1=== *Ahu Tuğba, 69, Turkish actress (Şeytan, Banker Bilo, Beyaz Ölüm).Ahu Tuğba 69 yaşında hayatını kaybetti ==August== ===31=== ===30=== *Tūheitia Paki, 69, New Zealand Māori monarch, king (since 2006), complications from heart surgery.Māori King Tūheitia dies aged 69, just days after Koroneihana *Fatman Scoop, 53, American rapper (\"Be Faithful\", \"Lose Control\", \"It's Like That\"). *Jean-Charles Tacchella, 98, French film director (Cousin Cousine, Seven Sundays) and screenwriter (Typhoon Over Nagasaki).Jean-Charles Tacchella, réalisateur et ancien président de la Cinémathèque française, est mort à l’âge de 98 ans ===29=== *Johnny Gaudreau, 31, American ice hockey player (Calgary Flames, Columbus Blue Jackets), traffic collision.NHL player Johnny Gaudreau, brother dead after being struck by suspected drunk driver *Renzo de' Vidovich, 90, Italian journalist and politician, deputy (1972–1976).È morto Renzo de’ Vidovich, ex deputato ed esponente degli esuli giuliano-dalmati (death announced on this date) ===28=== *Iryna Glibko, 34, Ukrainian handball player (CSM București, SCM Râmnicu Vâlcea, national team).Tragedie în handbal: a murit Iryna Glibko, ucraineanca sosită în România în 2012 *Denzil Keelor, 90, Indian Air Force officer, Vir Chakra recipient (1965).IAF's 1965 war hero Air Marshal Denzil Keelor dies at 91 *K. C. Potter, 85, American academic administrator (Vanderbilt University).K.C. Potter dies at age 85 *Behzod Yoʻldoshev, 79, Uzbek physicist, president of the Academy of Sciences of Uzbekistan (2000–2005, since 2017).Скончался глава Академии наук Бехзод Юлдашев ===27=== *Bob Carr, 81, American politician, member of the U.S. House of Representatives (1975–1981, 1983–1995).Former US Rep. Bob Carr, who served 18 years in the House, dies at 81 *Mohan, 76, Indian film director (Pakshe, Isabella, Oru Katha Oru Nunakkatha).'Pakshe' fame director Mohan passes away ===26=== *Nabil Elaraby, 89, Egyptian politician, minister of foreign affairs (2011).رحيل الدبلوماسي المصري الكبير نبيل العربي وزير الخارجية والأمين العام لجامعة الدول العربية سابقا *Sven-Göran Eriksson, 76, Swedish football player and manager (IFK Göteborg, Benfica, England national team), pancreatic cancer.Ex-England manager Sven-Göran Eriksson dies aged 76 ===25=== *Amadeo Francis, 92, Puerto Rican Olympic hurdler (1952, 1956).Former World Athletics Vice President Francis dies *Salim Al-Huss, 94, Lebanese politician, acting president (1988–1989) and three-time prime minister.Former five-time Lebanese prime minister Salim Hoss dies at 94 *Oh Seung-myung, 78, South Korean actor (Pillar of Mist, Passion Portrait, Seoul Evita).'여명의 눈동자' 원로배우 오승명 별세…향년 78 *Asha Sharma, 86, Indian actress (Hum Tumhare Hain Sanam, Humko Tumse Pyaar Hai, Adipurush).'Adipurush' actress Asha Sharma passes away at 86 *Wang Ying, 66, Chinese actor (Battle of Xiangjiang River).扮演“毛主席”特型演员王霙因病去世 享年66岁 *Sugathapala Senarath Yapa, 88, Sri Lankan film director (Hanthane Kathawa).Veteran film director Sugathapala Senarath Yapa passes away at 89 ===24=== *Karel Heřmánek, 76, Czech actor (Fešák Hubert, Give the Devil His Due, Forbidden Dreams).Actor Karel Heřmánek dies at 76 ===23=== *Wojciech Paszkowski, 64, Polish actor (Jezioro Bodeńskie, Three Colours: White) and dubbing director.Zmarł aktor, reżyser teatralny i dubbingowy Wojciech Paszkowski *István Pathó, 88, Hungarian actor (Drama of the Lark, Stars of Eger, Angi Vera).Meghalt Pathó István, Vizipók szinkronhangja *Catherine Ribeiro, 82, French singer (Catherine Ribeiro + Alpes) and actress (The Carabineers, Buffalo Bill, Hero of the Far West).La chanteuse Catherine Ribeiro est morte ===22=== *Justin Chearno, 54, American musician (Pitchblende, Turing Machine) and restaurateur (The Four Horsemen).Justin Chearno (Pitchblende, Turing Machine, and Four Horsemen co-owner) has died *, 76, Welsh actor (Grand Slam), singer and television presenter.Star of Wales rugby film Grand Slam dies (death announced on this date) ===21=== *Henryk Blaszka, 66, Polish Olympic sailor (1988).Zmarł Henryk Blaszka. Polski żeglarz, który wystąpił na igrzyskach olimpijskich w Seulu ===20=== *Yvonne Delcour, 92, Belgian actress (Moscow, Belgium).Gentse actrice Yvonne Delcour, alias Adrie uit BRT-reeks 'De kolderbrigade', overleden *Hushang Harirchiyan, 92, Iranian actor (The Wind Carpet, A Little Kiss) and comedian.هوشنگ‌ حریرچیان بازیگر پیشکسوت سینما درگذشت ===19=== *Maria Branyas, 117, American-born Spanish supercentenarian, world's oldest person (since 2023).Muere Maria Branyas, la persona más longeva del mundo, a los 117 años ===18=== *Boris Bystrov, 79, Russian actor (Aladdin and His Magic Lamp, Adventures of the Yellow Suitcase, TASS Is Authorized to Declare...).Умер легендарный актер дубляжа Борис Быстров *Alain Delon, 88, Freanch actor (Luchino Visconti, Jean-Luc Godard, Jean-Pierre Melville, Michelangelo Antonioni and Louis Malle) *Vladislav Gostishchev, 83, Russian actor (At the Beginning of Glorious Days, A Cruel Romance).Кострома прощается с народным артистом России Владиславом Гостищевым ===17=== *Veliko Stoianov, 81, Bulgarian actor (Gentlemen for a Day, Mila from Mars).The actor Veliko Stoyanov has passed away ===16=== *Aydemir Akbaş, 88, Turkish actor (Kolpaçino, Avrupalı).Aydemir Akbaş yaşamını yitirdi *Afa Anoaʻi, 81, Samoan-American Hall of Fame professional wrestler (WWF, Stampede, GCW).WWE Hall of Famer Afa Anoa’i of the Wild Samoans passes away ===15=== *Olga Horak, 98, Czechoslovak-born Australian Holocaust survivor.Holocaust survivor Olga Horak OAM passes away at 98, leaving a legacy of hope and education (death announced on this date) *Sergey Kalyakin, 72, Belarusian politician.политик Сергей Калякин *Paul Koeck, 83, Belgian author and screenwriter (Ons geluk).|title=Auteur en scenarioschrijver Paul Koeck (83) overleden *Ľubomír Paulovič, 71, Slovak actor (She Grazed Horses on Concrete, It's Better to Be Wealthy and Healthy Than Poor and Ill, The Peacemaker), heart failure.Zomrel herec, režisér, starosta a dobrý človek Ľubomír Paulovič. Mal 71 rokov ===14=== *Marcolino Franco, 65, Curaçao politician, MP, government commissioner of Sint Eustatius, cancer. Former Parliament Chair Marcolino ‘Mike’ Franco passes away *Denise Gagnon, 87, Canadian actress (In the Shadow of the Wind, The Novena).La comédienne Denise Gagnon s’est éteinte *Eugènie Herlaar, 84, Dutch news reporter.Pionier Eugènie Herlaar, eerste vrouwelijke presentator NOS Journaal, overleden *Gena Rowlands, 94, American actress (A Woman Under the Influence, Gloria, The Notebook), four-time Emmy winner.Gena Rowlands, actress who played strong, troubled women, dead at 94 ===13=== *Sergio Donati, 91, Italian screenwriter (Once Upon a Time in the West, Island of the Fishmen, North Star).Addio allo sceneggiatore Sergio Donati, amato da Leone e Bellocchio. Suoi ‘C'era una volta Il west’ e ‘Sbatti il mostro in prima pagina’ *Greg Kihn, 75, American musician (The Greg Kihn Band) and songwriter (\"Jeopardy\", \"The Breakup Song (They Don't Write 'Em)\") complications from Alzheimer's disease.Greg Kihn, ‘Jeopardy’ and ‘Breakup Song’ Hitmaker, Dies at 75 ===12=== *Douglas Goodwin, 86, Irish cricketer (national team).Sad news of the death of Dougie Goodwin (death announced on this date) *Zaid Rifai, 87, Jordanian politician, prime minister (1973–1976, 1984–1989) and president of the senate (1997–2009).Former PM Zaid Al-Rifai passes away ===11=== *Samir Chamas, 81, Lebanese actor (Africano), writer and journalist.وفاة الممثل اللبناني القدير سمير شمص *Mike Cubbage, 74, American baseball player (Texas Rangers, Minnesota Twins, New York Mets), cancer.Former Cavalier Mike 'Cubby' Cubbage dies at 74 *Ángel Salazar, 68, American comedian and actor (Scarface, Carlito's Way, Punchline).'Scarface' Actor Ángel Salazar Dead at 68 ===10=== *Rudolf Jelínek, 89, Czech actor (Thirty Cases of Major Zeman, The Fabulous Baron Munchausen).Zemřel Rudolf Jelínek (†89): Před smrtí nemohl polykat *Dame June Mariu, 92, New Zealand Māori community leader and sportswoman.Former Silver Ferns captain ‘Aunty’ Dame June Mariu dies ===9=== ===8=== *Hans Jonk, 76, Dutch footballer (FC Volendam).Oud-speler FC Volendam Hans Jonk overleden *Otig Pakis, 64, Indonesian actor (A Perfect Fit, Foxtrot Six, Miracle in Cell No. 7), rectal cancer.Berita Duka, Aktor Otig Pakis Meninggal Dunia *Jorge Rodríguez, 56, Mexican footballer (Toluca, Santos Laguna, national team), Evans syndrome.Murió Jorge Rodríguez, exfutbolista de Toluca, tras grave enfermedad *Jaap Staal, 91, Dutch chess player.Jaap Staal Death announcement ===7=== *Lino Jannuzzi, 96, Italian journalist and politician, senator (1968–1972, 2001–2008).Addio a Lino Jannuzzi, una vita tra giornalismo e politica: aveva 86 anni *Jack Karlson, 82, Australian criminal and meme inspiration (\"democracy manifest\"), prostate cancer.Jack Karlson, who shot to fame after ‘succulent Chinese meal’ arrest, dies aged 82 ===6=== *Billy Bean, 60, American baseball player (Detroit Tigers, San Diego Padres, Los Angeles Dodgers), acute myeloid leukemia.Baseball trailblazer Billy Bean, who dedicated life to inclusion, dies at 60 *Octave Landuyt, 101, Belgian painter and sculptor.Oudste Belgische kunstenaar Octave Landuyt (101) overleden, \"een universele kunstenaar\" *Hans Plomp, 80, Dutch poet, playwright and writer, prostrate cancer.Hans Plomp (80) overleden, grondlegger van kunstenaarsdorp Ruigoord ===5=== *Mahmoud Bandok, 47, Egyptian actor (X-Large).وفاة الفنان محمود بندق عن عُمر ناهز 47 عاماً *Jeremy Strong, 74, British writer.Tributes paid to 'brilliantly talented' Jeremy Strong (death announced on this date) *Graham Thorpe, 55, English cricketer (Surrey, national team).Former England batter Thorpe dies aged 55 (death announced on this date) *Maurice Williams, 86, American singer (Maurice Williams and the Zodiacs) and songwriter (\"Stay\").Legendary “Stay” singer Maurice Williams dies at 86 ===4=== *Juan Ramón Martínez, 76, Salvadoran footballer (Municipal, Águila, national team).Fallece Juan Ramón Martínez, el autor del gol que clasificó a El Salvador a su primer mundial *Terry Snow, 80, Australian businessman and philanthropist.Philanthropist and business leader Terry Snow dead at 80 ===3=== *Shaun Martin, 45, American musician (Snarky Puppy) and record producer, seven-time Grammy winner.Grammy Award-winning musician Shaun Martin dies aged 45 ===2=== *Tommy Cassidy, 73, Northern Irish football player (Newcastle, national team) and manager (APOEL), complications from Alzheimer's disease. Newcastle United legend Tommy Cassidy dies aged 73 after Alzheimer's battle (death announced on this date) *John Clegg, 90, British actor (It Ain't Half Hot Mum, Tom & Viv, Shooting Fish).John Clegg, actor best-known as the pianist Gunner Graham in It Ain’t Half Hot Mum – obituary ===1=== *Krzysztof Banaszyk, 54, Polish actor (Colonel Kwiatkowski, Poznań '56).Nie żyje Krzysztof Banaszyk. Znany aktor miał 54 lata *Pina Bottin, 94, Italian actress (Marriage, A Hero of Our Times, The Intruder).E' morta l'attrice Padovana Pina Bottin: recitò con Sordi e De Sica (death announced on this date) ==July== ===31=== *Genco Erkal, 86, Turkish actor (A Season in Hakkari, The Market: A Tale of Trade, Sleeping Princess), leukemia.Turkish theater legend Genco Erkal bids farewell at 86 years old *Anshuman Gaekwad, 71, Indian cricket player (national team) and coach, blood cancer.Anshuman Gaekwad, former India cricketer and coach, passes away at 71 after prolonged battle with cancer *Ismail Haniyeh, 62, Palestinian politician, prime minister (2006–2014), Hamas chief in the Gaza Strip (2014–2017), and chairman of the Hamas political bureau (since 2017), airstrike.Hamas Chief Ismail Haniyeh Killed In Iran's Capital *Roberto Herlitzka, 86, Italian actor (Morel's Invention, Seven Beauties, Summer Night).Addio a Roberto Herlitzka, il grande attore è morto a 86 anni ===30=== *Vladimir Eshinov, 75, Russian rower, Olympic champion (1976).Ушёл из жизни олимпийский чемпион 1976 года по академической гребле Ешинов *Kevin Laidlaw, 89, New Zealand rugby union player (Southland, national team) and coach (Southland).Kevin Laidlaw: from Nightcaps to the All Blacks *Onyeka Onwenu, 72, Nigerian singer, actress (Women's Cot, Rising Moon, Half of a Yellow Sun), and human rights activist.Onyeka Onwenu dies at 72 ===29=== *Kenan Işık, 76, Turkish actor (Dadı, Green Light), television presenter (Kim Milyoner Olmak İster?) and journalist.Kenan Işık 76 yaşında hayatını kaybetti ===28=== *Prince Michael of Greece and Denmark, 85, Greek royal, historian and author.Πέθανε ο πρίγκιπας Μιχαήλ της Ελλάδος και της Δανίας, ο λογοτέχνης Μισέλ Ντε Γκρες *Uğur Taşdemir, 58, Turkish actor (Valley of the Wolves: Gladio).Uğur Taşdemir hayatını kaybetti ===27=== *Mariano Haro, 84, Spanish Olympic athlete (1968, 1972, 1976).Muere a los 84 años la leyenda del atletismo Mariano Haro ===26=== *Janet Andrewartha, 72, Australian actress (Neighbours, Prisoner, Fake).Vale: Janet Andrewartha *Prabhat Jha, 67, Indian politician, MP (2008–2020).Former Rajya Sabha MP Prabhat Jha Passes Away In Delhi ===25=== ===24=== *Hamzah Haz, 84, Indonesian politician, vice president (2001–2004), minister of investment (1998–1999), and deputy (1971–1999).Hamzah Haz Meninggal Dunia karena Faktor Usia, Tiada Penyakit Serius ===23=== *Teresa Gimpera, 87, Spanish actress (Eagles Over London, The Legend of Frenchie King, Course Completed) and model.Muere la actriz y modelo Teresa Gimpera a los 87 años *Ken Palmer, 87, English cricketer (Somerset, national team) and umpire.Tributes paid after Somerset cricket legend dies ===22=== *Duke Fakir, 88, American Hall of Fame singer (Four Tops), heart failure.Abdul 'Duke' Fakir, last of the original Four Tops, is dead at 88 *John Mayall, 90, English Hall of Fame musician (John Mayall & the Bluesbreakers) and songwriter (\"I'm Your Witchdoctor\", \"Crawling Up a Hill\").John Mayall, British blues-rock legend and 2024 Rock and Roll Hall of Fame inductee, dies at 90 *Saeed Rad, 79, Iranian actor (Adieu Friend, Daadshah, Eagles), complications from a fall.Iranian actor Saeed Rad passes away at 79 ===21=== *Paul Lederman, 84, French film producer (The Three Brothers) and agent.Mort de Paul Lederman, l'impresario de Claude François et Coluche *Salvatore Piscicelli, 76, Italian film director, screenwriter (The Opportunities of Rosa, Blues metropolitano, Regina) and film critic.Morto il regista Salvatore Piscicelli, addio al maestro del cinema che ha ispirato Martone e Sorrentino *Evelyn Thomas, 70, American singer.Evelyn Thomas, influential disco singer, has died aged 70 ===20=== *János Csányi, 92, Hungarian opera singer, actor (The Testament of Aga Koppanyi, Hungarians, Do not Panic, Major Kardos).Meghalt a Szomszédok sztárja, az egyik legismertebb magyar operaénekes *Şener Kökkaya, 82, Turkish actor (The Herd, Vizontele).Oyuncu Şener Kökkaya vefat etti *Sandy Posey, 80, American singer (\"Single Girl\", “Born a Woman”, \"I Take It Back\"), complications from dementia.Sandy Posey, known for iconic 60s hit Born A Woman, dies aged 80 ===19=== *Nguyễn Phú Trọng, 80, Vietnamese politician, general secretary of the Communist Party (since 2011), president (2018–2021) and chairman of the National Assembly (2006–2011).Tổng Bí thư Nguyễn Phú Trọng từ trần *Sheila Jackson Lee, United States representative from Texas.Sheila Jackson Lee, long-serving Democratic congresswoman and advocate for Black Americans, dies at 74 ===18=== *Xabier Deive, 54, Spanish actor (Piratas, The Lesser Evil, Néboa).Falece o actor Xabier Deive, \"compañeiro querido e respectado\" *Ildikó Dobos, 82, Hungarian actress (Woyzeck).Gyászba borul a nemzet: elhunyt a magyar színésznő *Jerry Fuller, 85, American songwriter (\"Young Girl\", \"Travelin' Man\", \"Show and Tell\"), lung cancer.Jerry Fuller, Songwriter-Producer Whose Dozens of Hits Include ‘Young Girl,’ ‘Travelin’ Man’ and ‘Show and Tell,’ Dies at 85 *Bob Newhart, 94, American comedian and actor (The Bob Newhart Show, Newhart, Elf), Emmy (2013) and Grammy (1961) winner.Bob Newhart, Dean of the Deadpan Delivery, Dies at 94 ===17=== *Cheng Pei-pei, 78, Chinese actress (Come Drink with Me, Crouching Tiger, Hidden Dragon, Mulan), complications from corticobasal degeneration.郑佩佩美国病逝 经纪公司证实“安详平静地离开” *Stu Starner, 81, American basketball coach (Montana State Bobcats).Legendary Former Bobcat Basketball Coach Stu Starner Passes Away *Pat Williams, 84, American basketball executive (Orlando Magic, Philadelphia 76ers), complications from viral pneumonia.Orlando Magic Co-Founder and Sports Legend Pat Williams Passes Away at 84 ===16=== *Joe Bryant, 69, American basketball player (Philadelphia 76ers, San Diego Clippers, Houston Rockets) and coach, stroke.Philly hoops great Joe Bryant, father of NBA legend Kobe, has died *Ewa Ciepiela, 82, Polish actress (Znaki na drodze, The Third Part of the Night, To Save the City).Odeszła Ewa Ciepiela ===15=== *Jacques Boudet, 89, French actor (The Names of Love, Swann in Love, Father and Sons).Mort de l'acteur Jacques Boudet (Plus belle la vie, Nos jours heureux) à 89 ans *Juan Ricardo Faccio, 87, Uruguayan football player (Nacional) and manager (Peñarol, El Salvador national team).Murió Juan Faccio, quien llevó a Fernando Morena a Peñarol, dirigió a Uruguay y fue campeón con Nacional *Norm Hewitt, 55, New Zealand rugby union player (Hawke's Bay, Wellington, national team), complications from motor neurone disease.Former All Blacks hooker Norm Hewitt has died ===14=== *Jacoby Jones, 40, American football player (Baltimore Ravens, Houston Texans, San Diego Chargers), Super Bowl champion (2012).Jacoby Jones, who scored 2 TDs in Ravens' SB XLVII win, dies at 40 *, 78, Brazilian politician.Morre Romildo Magalhães, ex-governador do Acre *M. Mani, 77, Indian film producer and director (Kuyiline Thedi, Engane Nee Marakkum, Aanakkorumma).Renowned Mollywood film producer and director Aroma Mani passes away ===13=== *Shannen Doherty, 53, American actress (Beverly Hills, 90210, Heathers, Charmed), breast cancer.Shannen Doherty, Actress on ‘Beverly Hills, 90210’ and ‘Charmed,’ Dies at 53 *Claudio Reyes, 64, Chilean singer, actor (Cesante) and politician, heart attack.Murió Claudio Reyes, el humorista de 64 años detrás del personaje Charly Badulaque *James B. Sikking, 90, American actor (Hill Street Blues, Doogie Howser, M.D., Star Trek III: The Search for Spock), complications from dementia.James B. Sikking Dies: ‘Hill Street Blues’, ‘Doogie Howser, M.D.’ Actor Was 90 *Richard Simmons, 76, American fitness personality.Fitness guru Richard Simmons dead at 76 *Iliya Valov, 62, Bulgarian football player (Botev Vratsa, CSKA Sofia, national team) and manager, lung infection.Разкриха причината за внезапната смърт на Илия Вълов *Enrique Wong Pujada, 83, Peruvian politician, deputy (1985–1990, 2011–2016, since 2021), cancer.Enrique Wong, congresista de Podemos Perú, falleció a los 83 años ===12=== *Billy Ibadulla, 88, Pakistani-New Zealand cricketer (Warwickshire, Otago, Pakistan national team).Billy Ibadulla 1935 – 2024 (death announced on this date) *Ruth Westheimer, 96, German-American sex therapist and Holocaust survivor.Dr. Ruth Westheimer, who encouraged America to talk about sex, dies at 96 ===11=== *Shelley Duvall, 75, American actress (The Shining, Nashville, 3 Women), complications from diabetes.Shelley Duvall, Robert Altman Protege and Tormented Wife in 'The Shining,' Dies at 75 ===10=== *Bob Banks, 94, Australian rugby league player (Eastern Suburbs, Queensland, national team).End of an era as Newcastle rugby league legend Bobby Banks dies *Dave Loggins, 76, American singer and songwriter (\"Please Come to Boston\", \"Pieces of April\", \"If I Had My Wish Tonight\").David Allen Loggins ===9=== *Diana Hill, 81, New Zealand biochemist, Fellow of the Royal Society of New Zealand (since 1997).Diana Hill obituary *Jim Inhofe, 89, American politician, member of the U.S. Senate (1994–2023) and House of Representatives (1987–1994), complications from a stroke.Former US Sen. Jim Inhofe, defense hawk who called human-caused climate change a ‘hoax,’ dies at 89 *Jerzy Stuhr, 77, Polish actor (Camera Buff, Kingsajz, Kiler), film director and screenwriter.Jerzy Stuhr nie żyje. Aktor miał 77 lat ===8=== *Pierre Nguyễn Soạn, 87, Vietnamese Roman Catholic prelate, bishop of Qui Nhơn (1999–2012).Lutto nell’episcopato *Jógvan Sundstein, 91, Faroese politician, prime minister (1989–1991).Jógvan Sundstein er deyður *Thodoros Teknetzidis, Greek actor (It's a Long Road, Eternity and a Day).Πέθανε ο ηθοποιός Θεόδωρος Τεκνετσίδης ===7=== *Josefina Herrán, 94, Uruguayan first lady (1972–1976).Falleció María Josefina Herrán Puig *Bruno Zanin, 73, Italian actor (Amarcord, Killer Cop, The First Time on the Grass).Addio a Bruno Zanin, il \"Titta\" di Amarcord di Fellini ===6=== *Pino D'Angiò, 71, Italian singer (\"Ma quale idea\") and songwriter (\"The Age of Love\").Morto Pino D'Angiò, cantautore simbolo degli anni '80 *Mustapha Dassoukine, 81, Morrocan comedian. |title=Marokko rouwt om overlijden komiek Mustapha Dassoukine *Angela Pagano, 87, Italian actress (The Hideout, Naples in Veils, Like a Cat on a Highway 2).Lutto nello spettacolo, è morta Angela Pagano *Rob Schröder, 73, Dutch graphic designer and cineast, cancer.Filmmaker Rob Schröder (73) overleden *Roberta Taylor, 76, English actress (EastEnders, The Bill, Shakespeare & Hathaway: Private Investigators) and author.Roberta Taylor obituary *Javier Valle Riestra, 92, Peruvian jurist and politician, MP (1978–1992, 2006–2011) and prime minister (1998).Jurista y excongresista Javier Valle-Riestra falleció a los 92 años ===5=== *Serge Ducosté, 80, Haitian footballer (Aigle Noir AC, national team).Foot: Décès de l’ancien Grenadier, Serge Ducoste ! *Yvonne Furneaux, 98, French actress (Le Amiche, La Dolce Vita, Repulsion), stroke.Yvonne Furneaux, Actress in Fellini’s ‘La Dolce Vita’ and Polanski’s ‘Repulsion,’ Dies at 98 *Jon Landau, 63, American film producer (Titanic, Avatar, Solaris), Oscar winner (1998), cancer.Producer Jon Landau, James Cameron’s Right-Hand Man on ‘Titanic’ and the ‘Avatar’ Films, Dies at 63 *Vic Seixas, 100, American Hall of Fame tennis player.Vic Seixas, a Wimbledon champion and tennis Hall of Famer, dies at 100 ===4=== *Smriti Biswas, 100, Indian actress (Baap Re Baap, Maryada, Chandni Chowk).Veteran actress Smriti Biswas passes away at 100 *Henk van Mierlo, 66, Dutch motorcross racer.Henk van Mierlo overleden (death announced on this date) ===3=== *Geoff Robinson, 66, Australian rugby league player (Canterbury-Bankstown, Halifax), heart attack.Canterbury Bulldogs icon Geoff Robinson has died ===2=== *Nilüfer Gürsoy, 103, Turkish politician, MP (1965–1969, 1973–1980).Celal Bayar’ın kızı, eski Adalet Partisi Milletvekili Nilüfer Gürsoy hayatını kaybetti *Wim Hazeu, 84, Dutch biographer.Schrijversbiograaf Wim Hazeu (84) overleden *Comunardo Niccolai, 77, Italian footballer (Torres, Cagliari, national team).È morto Comunardo Niccolai, campione del Cagliari dello scudetto (death announced on this date) *Ion Rițiu, 73, Romanian actor (Ciuleandra, The Last Assault, Oglinda).Doliu în lumea filmului românesc. Actorul Ion Riţiu, cunoscut din filmele regizate de Sergiu Nicolaescu, a murit ===1=== *Maria Rosaria Omaggio, 67, Italian actress (The Tough Ones, The Cop in Blue Jeans, Walesa: Man of Hope) and writer.Maria Rosario Omaggio è morta, addio all'attrice e scrittrice: aveva 67 anni (death announced on this date) *Robert Towne, 89, American screenwriter (Chinatown, Shampoo, The Last Detail), Oscar winner (1975).Robert Towne, Oscar-Winning ‘Chinatown’ Screenwriter, Dies at 89 ==June== ===30=== *R. Sampanthan, 91, Sri Lankan politician, MP (1977–1983, 1997–2000, since 2001).Former TNA Leader R. Sampanthan no more *Ileana Stana-Ionescu, 87, Romanian actress and politician, deputy (2000–2004).Doliu în cinematografia românească. A murit actrița Ileana Stana Ionescu ===29=== *Syed Husin Ali, 87, Malaysian politician.PKR founder Syed Husin Ali dies at 87 *Shi Ping, 112, Chinese academic administrator and politician, vice president of China Agricultural University (1953–1960), secretary of East China Normal University (1978–1983) and secretary general of Shanghai Municipal People's Congress (1983–1985).113岁新四军老战士施平逝世，系施一公院士祖父 ===28=== *Txema Blasco, 82, Spanish actor (Vacas, By My Side Again, What You Never Knew).Muere el actor vitoriano Txema Blasco a los 82 años *Orlando Cepeda, 86, Puerto Rican Hall of Fame baseball player (San Francisco Giants, Atlanta Braves, St. Louis Cardinals).Hall of Famer Cepeda passes away at 86 *Dudu, 84, Brazilian football player (Palmeiras, national team) and manager (Palmeiras), abdominal infection.Dudu, ídolo do Palmeiras e tio de Dorival Júnior, morre aos 84 anos *Kostis Gontikas, 90, Greek politician, MP (1974–1981) and MEP (1981–1984).Πέθανε ο πρώην βουλευτής της Νέας Δημοκρατίας Κωνσταντίνος Γόντικας - Η ανακοίνωση της Πειραιώς *Yves Herbet, 78, French footballer (Sedan, Nancy, national team) and manager (FC Martigues, Dijon).Carnet noir : Yves Herbet, ancien joueur de l'équipe de France, est mort (death announced on this date) *Mohamed Osman Jawari, 78, Somali politician, speaker of the Parliament (2012–2018) and acting president (2012).Somalia mourns the passing of former Parliament speaker Jawari *Donna Reed Miller, 77, American politician, member of the Philadelphia City Council (1996–2012).Former Philly Councilmember Donna Reed Miller dies at 77 ===27=== *Alexander Knaifel, 80, Russian composer (The Canterville Ghost).Умер советский композитор Александр Кнайфель *Maria Nápoles, 87, Portuguese Olympic fencer (1960).Morreu Maria José Nápoles, primeira esgrimista portuguesa em Jogos Olímpicos (death announced on this date) *Landry Nguémo, 38, Cameroonian football player (Nancy, Bordeaux, national team) and manager, traffic collision.Landry Nguemo: Former Cameroon and Celtic midfielder passes away in car accident *Donald Scott, 96, Scottish rugby union player (Langholm, South of Scotland District, national team).Obituary: Donald Scott ===26=== *Jewel Brown, 86, American jazz and blues singer.Jewel Brown, Houston-native legendary jazz singer, dies at 86 (death announced on this date) *Jim Connors, 77, American politician, mayor of Scranton, Pennsylvania (1990–2002).Former Scranton Mayor Jim Connors dies suddenly at age 77 *Yaşar Yakış, 85, Turkish diplomat and politician, minister of foreign affairs (2002–2003) and MP (2002–2011).AKP'nin ilk dışişleri bakanı Yaşar Yakış hayatını kaybetti ===25=== *Sika Anoaʻi, 79, American Samoan Hall of Fame professional wrestler (The Wild Samoans).WWE Hall of Famer Sika Anoa’i passes away *Bill Cobbs, 90, American actor (The Bodyguard, Night at the Museum, Oz the Great and Powerful).Bill Cobbs Dead at 90 *Mícheál Ó Muircheartaigh, 93, Irish Gaelic games commentator (RTÉ).GAA commentator Mícheál Ó Muircheartaigh dies aged 93 *Shayne Philpott, 58, New Zealand rugby union player (Canterbury, national team).Former All Black and Canterbury rugby stalwart Shayne Philpott dies (death announced on this date) ===24=== *Dragan Kapičić, 75, Serbian Olympic basketball player (1972) and executive.Umro Dragan Kapičić *Tamayo Perry, 49, American surfer and actor (Pirates of the Caribbean: On Stranger Tides, Blue Crush), shark attack.Lifeguard and ‘Pirates of the Caribbean’ actor dies after apparent shark attack in Hawaii *Shifty Shellshock, 49, American vocalist (Crazy Town) and songwriter (\"Butterfly\", \"Starry Eyed Surprise\").Shifty Shellshock, Crazy Town frontman and ‘Butterfly’ singer, dies at 49 ===23=== *Hugo Villanueva, 85, Chilean footballer (Universidad de Chile, national team).Adiós a don Hugo Villanueva, el \"Flaco\" que brilló en el Ballet Azul ===22=== *Lala Mnatsakanyan, 66, Armenian actress.Մահացել է դերասանուհի Լալա Մնացականյանը ===21=== *Keith Locke, 80, New Zealand politician, MP (1999–2011).Former Green MP Keith Locke dies, aged 80 *Andrzej Mularczyk, 94, Polish writer, screenwriter (All Friends Here) and reporter.Ta śmierć to cios dla Polaków! Jego słowami z Samych swoich wszyscy mówimy ===20=== *David Johnson, 52, Indian cricketer (Karnataka), fall.Former Indian Test cricketer David Johnson passes away *Donald Sutherland, 88, Canadian actor (M*A*S*H, Ordinary People, The Hunger Games), Emmy winner (1995).Donald Sutherland Dies: Revered Actor In ‘Klute’, ‘Ordinary People’, ‘Hunger Games’ & Scores Of Others Was 88 ===19=== *Arturo González Cruz, 69, Mexican politician, deputy (since 2021).Fallece Arturo González Cruz, diputado federal y ex alcalde de Tijuana ===18=== *Anouk Aimée, 92, French actress (La Dolce Vita, A Man and a Woman, A Leap in the Dark).La comédienne Anouk Aimée est morte à l'âge de 92 ans *Willie Mays, 93, American Hall of Fame baseball player (San Francisco Giants, New York Mets), World Series champion (1954), heart failure.Baseball legend Willie Mays, all-around great of America's pastime, dead at 93 *Regina Veloso, 85, Portuguese Olympic swimmer (1960).Morreu Regina Veloso. Primeira nadadora olímpica portuguesa tinha 85 anos (death announced on this date) ===17=== *Connor Garden-Bachop, 25, New Zealand rugby union player (Māori All Blacks, Highlanders, Wellington).Highlanders and Māori All Blacks player Connor Garden-Bachop dies *Paul Spencer, 53, English musician (Dario G), rectal cancer.Famous Crewe musician, Paul Spencer, dies of cancer aged 53 ===16=== *Buzz Cason, 84, American singer and songwriter (\"Everlasting Love\").'Everlasting Love' Songwriter Buzz Cason Dies *Evans Evans, 87, American actress (Bonnie and Clyde, The Iceman Cometh, Dead Bang).Evans Evans Frankenheimer ===15=== *Mike Brumley, 61, American baseball player (Detroit Tigers, Boston Red Sox) and coach (Seattle Mariners), traffic collision.Braves send Hurston Waldrep back to minors after loss to Rays *Freddy Willockx, 76, Belgian politician, MEP (1994–1999), mayor of Sint-Niklaas (1989–1994, 2001–2010).Socialistisch boegbeeld en minister van Staat Freddy Willockx (76) overleden ===14=== *Pierre-Jean Samot, 89, French politician, mayor of Le Lamentin (1989–2018), deputy (2002–2003).Pierre Samot, l'un des grands noms de la politique martiniquaise, est décédé *Guy Warren, 103, Australian painter.Australia's oldest working artist Guy Warren dies, aged 103 ===13=== *Tommy Banks, 94, English footballer (Bolton Wanderers, Altrincham, national team).Bolton Wanderers legend Tommy Banks passes away at 94 (death announced on this date) *Angela Bofill, 70, American singer (\"I'll Try\", \"This Time I'll Be Sweeter\"). R&B; and Jazz star Angela Bofill dies at age 70 *Sirinal de Mel, 82, Sri Lankan politician, MP (2015–2019).Former JSS General Secretary Sirinal de Mel passes away *Courtney Meredith, 97, Welsh rugby player (British Lions, national team).‘Iron Man’ Courtenay’s death is end of an era *Benji Gregory 46, actor (ALF) heat stroke https://www.nbcnews.com/news/us-news/benji-gregory-alf-child-star-dies-suspected-heatstroke-car-arizona-sis-rcna161353 ===12=== *Fernando José de França Dias Van-Dúnem, 89, Angolan politician, president of the National Assembly (1992–1996), prime minister (1991–1992, 1996–1999).Morreu o antigo Primeiro-Ministro e deputado França Van-Dúnem *Fermí Reixach, 77, Spanish actor (The Mosquito Net, The Dead Man and Being Happy, 1000 Miles from Christmas).Muere el actor Fermí Reixach a los 77 años *Jerry West, 86, American Hall of Fame basketball player, coach, and executive (Los Angeles Lakers), NBA (1972) and Olympic (1960) champion.Jerry West, a 3-time Hall of Fame selection and the NBA logo, dies at 86 ===11=== *Françoise Hardy, 80, French singer-songwriter (\"Tous les garçons et les filles\", \"All Over the World\") and actress (Grand Prix), laryngeal cancer.Françoise Hardy, Influential French Singer and Actress, Dies at 80 *Robert Hughes, 96, American Hall of Fame basketball coach.Legendary Texas high school basketball coach Robert Hughes dies at 96 *Tony Lo Bianco, 87, American actor (The Honeymoon Killers, The French Connection, The Seven-Ups), prostate cancer.Tony Lo Bianco, 'The French Connection' actor, dead at 87 *Violet Neilson, 92, Jamaican politician, MP (1989–1997).Jamaica’s first female House Speaker, Violet Neilson has died ===10=== *Ralph Caulton, 87, New Zealand rugby union player (Wellington, national team).Former All Black Ralph Caulton dies aged 87 *Gérard Dériot, 79, French politician, senator (1998–2020), mayor of Cérilly (1995–2001).L'ancien président du Département de l'Allier et ancien sénateur Gérard Dériot est décédé *Steele Hall, 95, Australian politician.Former SA premier Steele Hall dies aged 95 *Malawians killed in the 2024 Chikangawa Dornier 228 crash:Malawi's vice president, 9 others killed in plane crash **Saulos Chilima, 51, economist and politician, vice-president (2014–2019, since 2020) **Patricia Shanil Muluzi, 59, first lady (1999–2004) ===9=== *Marzena Kipiel-Sztuka, 58, Polish actress (The Lousy World, Jak oni śpiewają, The Behaviorist).Marzena Kipiel-Sztuka nie żyje. \"Odeszła po ciężkiej chorobie\" *Isabel Moreno, 82, Cuban actress (Lucía, A Successful Man, The Beauty of the Alhambra).Falleció la primera actriz Isabel Moreno a sus 82 años *Michael Mosley, 67, British television journalist and writer.Body of man believed to be TV doctor Michael Mosley found on Greek island, authorities say (body discovered on this date) ===8=== *Mark James, 83, American songwriter (\"Hooked on a Feeling\", \"Suspicious Minds\", \"Always on My Mind\").Mark James, Houston songwriter known for Elvis Presley hit 'Suspicious Minds,' has died *Ramoji Rao, 87, Indian conglomerate industry executive and film producer (Mayuri, Pakarathinu Pakaram, Mouna Poratam), founder of Ramoji Group, heart disease.Ramoji Film City founder Ramoji Rao passes away: Tributes pour in *Chet Walker, 84, American basketball player (Philadelphia 76ers, Chicago Bulls).Basketball Hall Of Famer, Bulls Legend Chet Walker Passes Away At 84 ===7=== *William Anders, 90, American astronaut (Apollo 8, author of the photograph Earthrise) and diplomat, ambassador to Norway (1976–1977), plane crash.Former astronaut William Anders who took iconic Earthrise photo has died in Washington plane crash *Despina Stylianopoulou, 91, Greek actress (Alice in the Navy, Oh! That Wife of Mine).Πέθανε η αγαπημένη ηθοποιός, Δέσποινα Στυλιανοπούλου ===6=== *Nicholas Ball, 78, English actor (EastEnders, Footballers' Wives, Hazell).EastEnders and Hazell actor Nicholas Ball dies aged 78 (death announced on this date) ===5=== *Rosalinda López Hernández, 56, Mexican politician, senator (2006–2012) and member of the Congress of Tabasco (2006–2015).Muere la senadora Rosalinda López Hernández, hermana de Adán Augusto López y esposa de Rutilio Escandón *Rosalina Neri, 96, Italian actress and singer (Three Men and a Leg, All the Moron's Men).Addio a Rosalina Neri, da Arcisate ai palcoscenici di tutto il mondo ===4=== *Tom Bower, 86, American actor (Die Hard 2, Bad Lieutenant: Port of Call New Orleans, Undoing).Tom Bower: he's been in hiding for a long time! *Rex Kirton, 81–82, New Zealand politician, mayor of Upper Hutt (1977–2001).Rex Stratton Kirton ===3=== *Brigitte Bierlein,74,first woman as Austrian Chancellor. *Izabella Olszewska, 94, Polish actress (The Wedding, Karol: A Man Who Became Pope, Little Rose).Zmarła aktorka teatralna i filmowa Izabela Olszewska *William Russell, 99, English actor (Doctor Who, Coronation Street, The Adventures of Sir Lancelot).William Russell obituary *Armando Silvestre, 98, Mexican actor (Rossana, The Miracle Roses, Night of the Bloody Apes), complications from ulcer.Falleció Armando Silvestre; actor mexicano que trabajo en Hollywood con figuras relevantes como Clint Eastwood *Barbara Stewart, 72, New Zealand politician, MP (2002–2008, 2011–2017).'Missed by all': former NZ First member Barbara Stewart dies (death announced on this date) *Murisi Zwizwai, 54, Zimbabwean politician, MP (2003–2023).A Tribute To Huchi (death announced on this date) *Morrie Markoff, 110, American blogger, writer, and supercentenarian. ===2=== *Donovan Ebanks, 72, Cayman diplomat, acting governor (2009–2010).First deputy governor Donovan Ebanks passes away *Janis Paige, 101, American actress (Please Don't Eat the Daisies, The Pajama Game, It's Always Jan).Janis Paige, Star of ‘Silk Stockings’ and Broadway’s ‘Pajama Game,’ Dies at 101 *Natasha Ryan, 40, Australian disappearance case.Natasha Ryan, former teen runaway whose 1998 disappearance sparked years-long search, found dead in Rockhampton (death announced on this date) ===1=== *Andrzej Kostenko, 87, Polish screenwriter (Ręce do góry, Le Départ) and actor (When Angels Fall).Nie żyje Andrzej Kostenko *Ruth Maria Kubitschek, 92, Czech-born German actress (He Can't Stop Doing It, Madame and Her Niece, Tears of Blood).Schauspielerin Ruth Maria Kubitschek ist tot *Philippe Leroy, 93, French actor (The Hole, The Life of Leonardo da Vinci, Sandokan).E' morto l'attore francese Philippe Leroy *Tin Oo, 97, Burmese general and politician, minister of defence (1974–1977) and commander-in-chief of defence services (1974–1976), pneumonia.Tin Oo, NLD founder with Aung San Suu Kyi, dies aged 97 in Myanmar ==May== ===31=== *Alexander Lang, 82, German actor (Denk bloß nicht, ich heule, Solo Sunny) and stage director.Schauspieler Alexander Lang ist tot *Robert Pickton, 74, Canadian convicted serial killer, complications from injuries sustained in stabbing.Serial killer Robert Pickton dead *Kátya Tompos, 41, Hungarian actress (Coming Out, Question in Details) and singer, cancer.Meghalt Tompos Kátya színésznő ===30=== *Dorothy Bromiley, 93, British actress (The Girls of Pleasure Island, It's Great to Be Young, A Touch of the Sun).Brian Phelan obituary (death announced on this date) *Trevor Edwards, 87, Welsh footballer (Charlton Athletic, Cardiff City, national team).Former Wales international Edwards dies aged 87 (death announced on this date) *B. Sampath Kumar, Indian politician. NSUI national secretary found murdered in Andhra Pradesh (death announced on this date) *Brian Phelan, 89, Irish actor (The Criminal, Accident), dramatist and screenwriter (Little Mother).Brian Phelan obituary (death announced on this date) *Tina Serrano, 82, Argentine actress (Night of the Pencils, I Don't Want to Talk About It).A los 82 años murió la actriz Tina Serrano ===29=== *Annarosa Garatti, 90, Italian actress (Ore 10: lezione di canto, Be Sick... It's Free, Il triangolo rosso).La pagina di Anna Rosa Garatti *Henri Nallet, 85, French politician, minister justice (1990–1992) and agriculture (1985–1986, 1988–1990).Henri Nallet, ancien ministre de François Mitterrand, est mort *Anastasia Zavorotnyuk, 53, Russian actress (My Fair Nanny) and television presenter, glioblastoma.Mash: Анастасия Заворотнюк умерла в больнице ===28=== *Dadash Rzayev, 88, Azerbaijani major general, minister of defence (1993).General Dadaş Rzayev vəfat etdi ===27=== *Rodger Fox, 71, New Zealand jazz trombonist and bandleader.New Zealand jazz legend Rodger Fox dies aged 71 *Elizabeth MacRae, 88, American actress (General Hospital, Gomer Pyle, U.S.M.C., The Conversation).Elizabeth MacRae Dies: ‘General Hospital’ & ‘Gomer Pyle: USMC’ Actor Was 88 *Surya Prakash, Indian film director (Manikkam, Maayi, Diwan).Maayi Director Surya Prakash Passes Away; Sarathkumar Mourns Loss *Bill Walton, 71, American Hall of Fame basketball player (Portland Trail Blazers, Boston Celtics), and sportscaster (ESPN), cancer.Bill Walton dies at 71: 'Truly one of a kind' Basketball Hall of Famer succumbs to cancer ===26=== *Talat Hussain, 83, Pakistani actor (Karawaan, Jinnah, Actor in Law).Veteran actor Talat Hussain passes away in Karachi ===25=== *Carlo J. Caparas, 80, Filipino comics artist (Bakekang, Kamandag) and film director (Kambal Na Kamao: Madugong Engkwentro).Veteran director, comic strip creator Carlo J. Caparas passes away * Bertus Mulder, 95, Dutch architect (Rietveld Schröder House).Utrechtse architect en Rietveldkenner Bertus Mulder overleden (death announced on this date) *Johnny Ngan, 75, Hong Kong actor (The Seasons, A Kindred Spirit, File of Justice), squamous cell carcinoma.Veteran TVB actor Johnny Ngan passes away at 75 *Johnny Wactor, 37, American actor (General Hospital, Siberia, USS Indianapolis: Men of Courage), shot.Johnny Wactor, 'General Hospital' actor, fatally shot in L.A. ===24=== *Jan Kačer, 87, Czech actor (Death Is Called Engelchen), theatre director (The Drama Club) and politician, MP (1990–1992).Zemřel herec a režisér Jan Kačer ===23=== *Ángeles Flórez Peón, 105, Spanish socialist militant, writer and Civil War veteran.Muere a los 105 años Maricuela, símbolo socialista asturiano de la resistencia *Janusz Mazurek, 80, Polish politician, senator (1991–1993).Zmarł były wiceprezydent Lublina Janusz Mazurek *P. N. Patil, 71, Indian politician, Maharashtra MLA (since 2019), fall.MLA P. N. Patil : आमदार पी. एन. पाटील यांचे निधन; मृत्यूशी झुंज अयशस्वी, काँग्रेसचा निष्ठावंत शिलेदार हरपला *Morgan Spurlock, 53, American filmmaker (Super Size Me, Where in the World Is Osama bin Laden?, Comic-Con Episode IV: A Fan's Hope), cancer.Morgan Spurlock, ‘Super Size Me’ Director, Dies at 53 *Eric Upton, 71, Canadian football player (Edmonton Eskimos).Five-in-a-row Grey Cup champion Eric Upton passes away at 71 (death announced on this date) ===22=== *Charlie Colin, 58, American bassist and guitarist (Train, The Side Deal), fall.Charlie Colin, Founding Bassist of ‘Drops of Jupiter’ Band Train, Dead at 58 (death announced on this date) *Darryl Hickman, 92, American actor (The Grapes of Wrath, Network, Challenge of the GoBots).Darryl Hickman, Young Actor in 'The Grapes of Wrath' and 'Leave Her to Heaven,' Dies at 92 *Iqbal Ahmed Saradgi, 79, Indian politician, MP (1999–2009).Senior Congress leader Iqbal Ahmed Sardagi passes away at 80 *Othon Valentim Filho, 79, Brazilian football player (1964 Olympics) and manager (Botafogo, América Mineiro).Luto! Morre no interior mineiro técnico que fez sucesso no Brasil e no Oriente Médio ===21=== *Sajjad Akbar, 63, Pakistani cricketer (national team), heart attack.Former Pakistani cricketer Sajjad Akbar passes away *Vladimir Agapov, 90, Russian football player (Spartak Moscow, Soviet Union national team) and manager (CSKA Moscow).Скончался легендарный футболист и тренер ЦСКА *Jan A. P. Kaczmarek, 71, Polish film composer (Finding Neverland, Hachi: A Dog's Tale, The Visitor), Oscar winner (2005), multiple system atrophy.Jan A.P. Kaczmarek Dies: Oscar-Winning ‘Finding Neverland’ Composer Was 71 ===20=== *Ivan Boesky, 87, American stock trader and convicted felon.https://www.reuters.com/world/us/ivan-boesky-convict-1980s-insider-trading-scandal-dies-87-nyt-reports-2024-05-20/ *Kevin Burns, 63, New Zealand cricketer.‘Integral’ Otago batter dies *Gerry Collins, 69, Scottish football player (Ayr United, Hamilton Academical, Partick Thistle) and manager.Tributes paid as Hamilton Accies and Patrick Thistle legend passes away *Jean-Claude Gaudin, 84, French politician, senator (1998–2017), minister of the city (1995–1997), and mayor of Marseille (1995–2020).Addio all'ex sindaco di Marsiglia Jean-Claude Gaudin *Fernando Martínez Castellano, 82, Spanish politician, mayor of Valencia (1979).Fallece Fernando Martínez Castellano, el primer alcalde de València en democracia *Karl-Heinz Schnellinger, 85, German footballer (FC Köln, AC Milan, West Germany national team).Lutto nel mondo del calcio: è scomparso Karl-Heinz Schnellinger. Aveva 85 anni (death announced on this date) *Perrette Souplex, 94, French actress (Paris Still Sings, Suspicion, La smala).Souplex, Perrette ===19=== *Richard Foronjy, 86, American actor (Serpico, Midnight Run, Carlito's Way).Richard Foronjy, Character Actor in ‘Midnight Run’ and ‘Serpico,’ Dies at 86 *Kwassi Klutse, 78, Togolese politician, prime minister (1996–1999).Togo : l’ancien premier ministre Kwassi Klutsè n’est plus *Ebrahim Raisi, 63, Iranian politician, president (since 2021), helicopter crash.با پیداشدن لاشه هلی‌کوپتر حامل رئیس‌جمهور ایران؛ کشته شدن ابراهیم رئیسی و هیئت همراه تائید شد *Hossein Amir-Abdollahian, 60, politician, foreign minister of Iran, helicopter crash ===18=== *Frank Ifield, 86, Australian singer (\"I Remember You\", \"Lovesick Blues\", \"The Wayward Wind\").Aussie Country Icon Frank Ifield Has Died, Aged 86 *Sir Tony O'Reilly, 88, Irish businessman and rugby player (Barbarian, British & Irish Lions, national team).Businessman Tony O’Reilly (88) dies after short illness *Md. Wali Ullah, 87, Bangladeshi politician, MP (1991–1996).AL ex-lawmaker Wali Ullah passes away *Jon Wysocki, 53, American rock drummer (Staind).Staind's Founding Drummer Jon Wysocki Has Died at Age 53 ===17=== *Thaneswar Boro, 85, Indian politician, Assam MLA (1985–2001), heart disease.Former Assam Education Minister Thaneswar Boro Passes Away at 85 *Pat Buckley, 72, Irish independent Catholic bishop.Pat Buckley: Controversial independent Catholic bishop dies *Sid Going, 80, New Zealand rugby union player (North Auckland, national team). (death announced on this date) ===16=== *Dabney Coleman, 92, American actor (9 to 5, WarGames, Recess), Emmy winner (1987).Dabney Coleman, Who Built a Career Out of Playing Jerks, Dies at 92 *Zari Khoshkam, 76, Iranian actress (What's the Time in Your World?).زری خوشکام در ۷۶ سالگی درگذشت *Verónica Toussaint, 48, Mexican actress (Impossible Things) and television presenter (¡Qué chulada!), breast cancer.Muere la actriz y presentadora mexicana Verónica Toussaint a los 48 años ===15=== *Abdellatif Abdelhamid, 70, Syrian film director (Layali Ibn Awa, Nassim al-Roh, Qamaran wa Zaytouna).وفاة المخرج السينمائي السوري عبد اللطيف عبد الحميد عن 70 عاماً *Barbra Fuller, 102, American actress (Adventures of Superman, Four Star Playhouse, My Three Sons).Barbra Fuller, Star of Republic Pictures and ‘One Man’s Family’ on the Radio, Dies at 102 *Vlastimil Harapes, 77, Czech actor (Marketa Lazarová, Jak dostat tatínka do polepšovny, Beauty and the Beast), ballet dancer and choreographer.Zemřel Vlastimil Harapes *Oleg Levakov, 76, Russian actor (Sardar Udham) and stage director.Умер актер из \"Улиц разбитых фонарей\" и \"Тайн следствия\" Олег Леваков *Elda Peralta, 91, Mexican actress (Hypocrite, Streetwalker, A Woman Without Love).Muere la actriz y escritora Elda Peralta a los 91 años ===14=== *Ayten Gökçer, 84, Turkish actress (Red Istanbul).Veteran actress Ayten Gökçer dies at 84 *Baiba Indriksone, 92, Latvian actress (A Limousine the Colour of Midsummer's Eve, The Devil's Servants).Latvian actress Baiba Indriksone passes away *Jimmy James, 84, British-Jamaican singer (\"Now Is the Time\", \"I'll Go Where Your Music Takes Me\").Jimmy James, 84, passes away *Narong Kittikachorn, 90, Thai politician, MP (1983–1992).Last of the 'Three Tyrants' dies at 90 *Gudrun Ure, 98, Scottish actress (Super Gran, The Million Pound Note, The Crow Road).Super Gran star Gudrun Ure dies aged 98 (death announced on this date) ===13=== *Yevgeniy Brago, 95, Russian rower, Olympic silver medalist (1952).Светлая память, Евгений Николаевич Браго! *Rinus de Jong, 90, Dutch basketball player (Heroes Den Bosch, national team) and coach.Bosch’ basketbalicoon Rinus de Jong overleden *Alice Munro, 92, Canadian short story writer (Dance of the Happy Shades, Lives of Girls and Women, Runaway), Nobel Prize laureate (2013), complications from dementia.Alice Munro, Canadian author who won Nobel Prize for Literature, dies at 92 *Birubala Rabha, 70, Indian human rights activist, esophageal cancer.Padma Shri Awardee & Anti-Witch Hunting Activist Birubala Rabha Passes Away in Guwahati *M. Selvarasu, 67, Indian politician, MP (1989–1991, 1996–1998, since 2019).Tamil Nadu: MP M Selvarasu from Nagapattinam passes away at Chennai *Luis María Serra, 82, Argentine musician and composer (La Mary, Camila, I, the Worst of All).Murió Luis María Serra, compositor de la cortina de Almorzando con Mirtha Legrand y de la banda sonora de emblemáticas películas argentinas ===12=== *Abdul Sattar Al-Basry, Iraqi actor (Al-ayyam al-tawila, Al Qadisiyya).وفاة الفنان \"عبد الستار البصري\" بعد صراع مع المرض *Mark Damon, 91, American actor (House of Usher, Ringo and His Golden Pistol) and film producer (9½ Weeks).Mark Damon, film sales pioneer and former leading man, dies on eve of Cannes aged 91 *Giannis Malouhos, 91, Greek actor (Alice in the Navy). Πέθανε ο ηθοποιός Γιάννης Μαλούχος *Paulo César Pereio, 83, Brazilian actor (The Brave Warrior, Iracema: Uma Transa Amazônica). Ator Paulo César Pereio, nome histórico do cinema brasileiro, morre no Rio aos 83 anos *David Sanborn, 78, American alto saxophonist (\"Young Americans\") and television host (Night Music), six-time Grammy winner, prostate cancer.David Sanborn, jazz saxophonist who played on David Bowie's 'Young Americans,' dead at 78 *Shi Wei-Jian, 89, Chinese actor (Legend of Tianyun Mountain, Qiu Jin).著名表演艺术家石维坚去世，曾主演《天云山传奇》 ===11=== *Susan Backlinie, 77, American actress (Jaws, Day of the Animals, 1941).Susan Backlinie of JAWS fame passes away aged 77 *Ron Ellis, 79, Canadian ice hockey player (Toronto Maple Leafs), Stanley Cup champion (1967).Former Maple Leafs forward Ron Ellis, dead at age 79 (death announced on this date) *Baby Girija, 83, Indian actress (Jeevitha Nouka, Visappinte Vili, Achan).Baby Girija Dies at 83; Yesteryear Actress Was Known for Films Like Jeevitha Nouka, Achan Among Others ===10=== *Hans Wahlgren, 86, Swedish actor (Wahlgrens värld, Good Friends and Faithful Neighbours, Rederiet).Hans Wahlgren är död – blev 86 år ===9=== *Dame Shirley Conran, 91, British writer.Shirley Conran, campaigner and ‘queen of the bonkbuster’, dies aged 91 *Roger Corman, 98, American filmmaker (The Little Shop of Horrors, Death Race 2000, The St. Valentine's Day Massacre).Roger Corman, Pioneering Independent Producer and King of B Movies, Dies at 98 ===8=== *Gérard César, 89, French politician, three-time deputy, senator (1990–2017).L'ancien maire de Rauzan et sénateur, Gérard César s'est éteint à 89 ans *Dennis Thompson, 75, American Hall of Fame drummer (MC5), complications from a heart attack.Dennis Thompson, MC5 drummer and ‘last man standing,’ dies at 75 ===7=== *Evald Aavik, 83, Estonian actor (Nest of Winds, Arvo Iho, Somnambuul).Suri näitleja Evald Aavik *Dorman Borisman, 73, Indonesian actor (Sundelbolong, Bayi Gaib: Bayi Tumbal Bayi Mati, Surat Kecil untuk Tuhan). Aktor Dorman Borisman Meninggal Dunia, Kakinya Sempat Diamputasi *Kim Ki-nam, 94, North Korean politician, director of the Propaganda and Agitation Department of the Workers' Party of Korea (1989–2017), multiple organ failure.'3대 세습 우상화' 김기남 前비서 사망…김정은이 국가장의위원장(종합) *Joan Rigol, 81, Spanish politician, president of the parliament of Catalonia (1999–2003), Catalan minister of employment (1980–1984) and culture (1984–1985).Mor l'expresident del Parlament Joan Rigol als 81 anys ===6=== *Ian Gelder, 74, British actor (Game of Thrones, Torchwood, Little Dorrit), bile duct cancer.Ian Gelder Dies: ‘Game of Thrones’ Actor & Husband of ‘IWTV’ Star Ben Daniels Was 74 *Wayland Holyfield, 82, American songwriter (\"Arkansas (You Run Deep in Me)\", \"Rednecks, White Socks and Blue Ribbon Beer\", \"You're My Best Friend\").Writer of ‘Arkansas, You Run Deep in Me’ dies at 82 *Brian Wenzel, 94, Australian actor (A Country Practice, Rove).A Country Practice star Brian Wenzel dead at 94 ===5=== *Bernard Hill, 79, English actor (The Lord of the Rings, Titanic, Boys from the Blackstuff).Bernard Hill: Titanic and Lord of the Rings actor dies *Willie Hona, New Zealand musician (Herbs), pancreatic cancer.New Zealand music legend Willie Hona dead *César Luis Menotti, 85, Argentine football player (Rosario Central, national team) and manager (national team), world champion (1978), anemia.Murió César Luis Menotti, DT campeón con la selección en 1978 *Simona Postlerová, 59, Czech actress (The Territory of White Deer).Zemřela Simona Postlerová ===4=== *Badr bin Abdul Mohsen Al Saud, 75, Saudi prince and poet.Kingdom mourns death of pioneering Saudi poet Prince Badr bin Abdul Mohsen *Guilherme Fiúza Zenha, 55, Brazilian film director (O Menino no Espelho), heart attack.Guilherme Fiúza, cineasta mineiro, morre aos 55 anos em Belo Horizonte *Anna Panayiotopoulou, 76, Greek actress (Safe Sex, Crying... Silicon Tears, Oi Treis Harites), complications from Alzheimer's disease.Πέθανε η ηθοποιός Άννα Παναγιωτοπούλου ===3=== *Kazuo Aichi, 86, Japanese politician, director-general of the Defence Agency (1993–1994) and MP (1976–2000, 2005–2009), COVID-19.元衆院議員 愛知和男さん死去 ８６歳 後日仙台でお別れ会 ===2=== *Derek Angus, 86, New Zealand politician, MP (1981–1990).Derek Alan Angus *Mashrab Kimsanov, 68, Uzbek actor (Sohni Mahiwal).Скончался известный актёр Машраб Кимсанов *Manca Košir, 76, Slovenian journalist (Nova revija) and actress (Real Pests).Umrla je novinarka in publicistka Manca Košir *Edgar Lansbury, 94, British-American theatre producer (The Subject Was Roses), Tony winner (1960).Edgar Lansbury, Tony-Winning Producer and Brother of Angela Lansbury, Dies at 94 ===1=== *Richard Tandy, 76, English Hall of Fame musician (Electric Light Orchestra, The Move).Richard Tandy, Keyboardist of ELO Dies at 76 ==April== ===30=== *Duane Eddy, 86, American guitarist (\"Rebel-'Rouser\", \"Because They're Young\", \"Peter Gunn\").Remembering 'Rebel Rouser' rock icon Duane Eddy, dead at 86 *, 64, Canadian actor (Intimate Power, Louis 19, King of the Airwaves, Grey Owl).Le comédien Jacques Lussier est décédé (death announced on this date) *Ella Maklakova, 84, Russian costume designer (Treasure Island).Умерла народный художник России Элеонора Маклакова ===29=== *Mykhaylo Fomenko, 75, Ukrainian football player (Dynamo Kyiv, Soviet Union national team) and manager (national team), Olympic bronze medallist (1976).Помер почесний громадянин Сум Михайло Фоменко *Zoya Zelinskaya, 94, Russian actress (Tests for Real Men).Зою Зелинскую похоронят на Троекуровском кладбище ===28=== *Brian McCardie, 59, Scottish actor (Rob Roy, The Ghost and the Darkness, Speed 2: Cruise Control) and writer.Time and Line of Duty actor Brian McCardie dies aged 59 *Zack Norman, 83, American comedian, film producer (Tracks), and actor (Romancing the Stone, Cadillac Man).Zack Norman, Actor in ‘Romancing the Stone’ and Henry Jaglom Films, Dies at 83 *Sir Vincent O’Sullivan, 86, New Zealand writer, Poet Laureate (2013–2015).Poet Sir Vincent O'Sullivan dead at 86 ===27=== ===26=== *Dave O'Sullivan, 90, New Zealand Thoroughbred racehorse trainer.Dave O’Sullivan, a legend of NZ horse racing, dies aged 90 *Sunwoo Wan, 76, South Korean film director.문제작 ‘서울예수’ ‘마리아와 여인숙’ 선우완 감독 별세 *Kostis Zois, 93, Greek film director, producer and screenwriter.Πέθανε ο σκηνοθέτης Κωστής Ζώης ===25=== *Marla Adams, 85, American actress (The Young and the Restless, The Secret Storm, Splendor in the Grass), Emmy winner (2021).Marla Adams, Dina on 'The Young and the Restless,' Dies at 85 *Ferenc András, 81, Hungarian film director (The Vulture, Rain and Shine) and screenwriter.Elhunyt András Ferenc Kossuth-díjas és Balázs Béla-díjas magyar filmrendező *Laurent Cantet, 63, French film director, screenwriter (The Class, Human Resources, Time Out) and cinematographer.Mort de Laurent Cantet à 63 ans, cinéaste entre douceur et révolte ===24=== *Frank Field, Baron Field of Birkenhead, 81, British politician, MP (1964–1968, 1979–2019).Former Labour minister Frank Field dies aged 81 (death announced on this date) *Terry Hill, 52, Australian rugby league player (Manly Warringah, New South Wales, national team), heart attack.Former rugby league star Terry Hill dead aged 52 *Margaret Lee, 80, English actress (I due pericoli pubblici, Letti sbagliati, The Killers Are Our Guests).Il Necrologio Dei Giusti - Se Ne Va Margaret Lee, 80 Anni *Mike Pinder, 82, English musician (The Moody Blues).Mike Pinder, Moody Blues’ Founding Member and Innovative Mellotron Player, Dies *Rene Saguisag, 84, Filipino politician, senator (1987–1992).Ex-senator Rene Saguisag passes away (death announced on this date) *Mooryati Soedibyo, 96, Indonesian politician, deputy speaker of the People's Consultative Assembly (2004–2009) and founder of Puteri Indonesia.Mooryati Soedibyo, Founder Of Puteri Indonesia Passes Away At The Age Of 96 ===23=== *Zulu Adigwe, Nigerian actor (Basi and Company, Issakaba, Living in Bondage: Breaking Free).Nollywood actor, Zulu Adigwe is dead *George Baker, 88, Welsh footballer (Plymouth Argyle, national team).George Baker, one of the last remaining members of Wales 1958 World Cup squad, dies *Mariana Evstatieva-Biolcheva, 84, Bulgarian film director (On the Top of the Cherry Tree).Почина режисьорът Мариана Евстатиева-Биолчева *Ro Jai-bong, 88, South Korean politician, prime minister (1990–1991).노재봉 전 국무총리 별세…향년 88세 *Kostas Stefanakis, 76, Greek actor (From the Snow).Πέθανε ο γνωστός ηθοποιός Κώστας Στεφανάκης ===22=== *Hana Brejchová, 77, Czech actress (Loves of a Blonde, Amadeus, Cirkus Humberto).Loves of a Blonde actress Hana Brejchová dies at 77 (death announced on this date) *Julio Calcagno, 87, Uruguayan actor (Seawards Journey).A los 87 años falleció el actor Julio Calcagno, referente de las tablas uruguayas *Nader Kashani, 79, Iranian basketball player.پیشکسوت بسکتبال ایران در گذشت *Philippe Laudenbach, 88, French actor (Muriel, My American Uncle, Confidentially Yours).« Un de ces seconds rôles dont on se souvient » : l’acteur Philippe Laudenbach est mort à 88 ans *Chan Romero, 82, American singer-songwriter (\"Hippy Hippy Shake\") and guitarist.Chan Romero 1941–2024 (death announced on this date) ===21=== *Roedad Khan, 100, Pakistani civil servant and politician, secretary of industries and production (1958–1969), interior secretary (1978–1988), and minister of accountability (1990–1993).Ex-bureaucrat Roedad Khan passes away at 101 ===20=== *Antonio Cantafora, 80, Italian actor (Supersonic Man, Carambola!, Intervista).Si è spento a Roma Antonio Cantafora, attore e pittore crotonese (death announced on this date) *Roman Gabriel, 83, American Hall of Fame football player (NC State Wolfpack, Los Angeles Rams) and actor (The Undefeated).Rams legend, former NFL MVP quarterback Roman Gabriel dies at age 83 *Josef Laufer, 84, Czech singer and actor (Starci na chmelu, Cirkus Humberto, The Last Butterfly), cardiac arrest.Zemřel zpěvák a herec Josef Laufer, bylo mu 84 let *Lourdes Portillo, 80, Mexican filmmaker (The Mothers of Plaza de Mayo, The Devil Never Sleeps, After the Earthquake).Lourdes Portillo Dies: Oscar-Nominated Filmmaker And Activist Was 80 ===19=== *Salah El-Saadany, Egyptian actor (The Land, Yacoubian Building).Renowned actor Salah El-Saadany dies at 80 ===18=== *Dickey Betts, 80, American Hall of Fame musician (The Allman Brothers Band) and songwriter (\"Jessica\", \"Ramblin' Man\"), cancer and chronic obstructive pulmonary disease. *Bob Ellison, 91, American consultant (Becker, Wings, The Mary Tyler Moore Show), screenwriter and television producer.EP371: Remembering Comedy Writing Legend, Bob Ellison (death announced on this date) *Raman Subba Row, 92, English cricketer (Surrey, Northamptonshire, national team). (death announced on this date) ===17=== *Sir Colin Giltrap, 84, New Zealand Hall of Fame businessman and philanthropist. ===16=== *Dwarakish, 81, Indian film director (Nee Bareda Kadambari) and actor (Bedi Bandavalu, Haddina Kannu), heart attack. *Vincent Friell, 64, Scottish actor (Trainspotting, Restless Natives, The Angels' Share). (death announced on this date) *Barbara O. Jones, 82, American actress (Daughters of the Dust, Freedom Road, Demon Seed). *Ángela Ragno, 92, Argentine actress (Night of the Pencils, Kisses on the Forehead, Empty Nest). *Wichart von Roëll, 86, German actor (Meschugge). ===15=== *Martin Aliker, 95, Ugandan political advisor and academic administrator, chancellor of Gulu University (2004–2014). *Mouncif El Haddaoui, 59, Moroccan footballer (AS Salé, national team). *Whitey Herzog, 92, American Hall of Fame baseball player (Washington Senators), executive (New York Mets), and manager (St. Louis Cardinals). *Bernd Hölzenbein, 78, German footballer (Eintracht Frankfurt, Memphis Americans, West Germany national team). *Josip Manolić, 104, Croatian politician, prime minister (1990–1991) and speaker of the Chamber of Counties (1993–1994). *Naomi Polani, 96, Israeli actress (Someone to Run With). *Derek Underwood, 78, English cricketer (Kent, national team), complications from dementia. ===14=== *Giannis Fertis, 85, Greek actor (Electra, Slaves in Their Bonds). *Jeon Se-kwon, 85, South Korean actor, screenwriter and playwright. ===13=== *Richard Horowitz, 75, American film composer (L'Atlantide, Three Seasons, Tobruk). ===12=== *Eleanor Coppola, 87, American filmmaker (Hearts of Darkness: A Filmmaker's Apocalypse, Paris Can Wait, Love Is Love Is Love). *Rico Wade, 52, American music producer (Organized Noize) and songwriter (\"Player's Ball\", \"Don't Let Go (Love)\"). ===11=== *O. J. Simpson, 76, American Hall of Fame football player (Buffalo Bills) and actor (The Naked Gun, The Towering Inferno), Heisman Trophy winner (1968), prostate cancer. *Lorena Velázquez, 86, Mexican actress (Santo vs. las Mujeres Vampiro, Fray Don Juan, Mujer, Casos de la Vida Real). ===10=== *Paola Gassman, 78, Italian actress (Let's Have a Riot). ===9=== *Jack Alabaster, 93, New Zealand cricketer (Otago, national team). *Jaime de Armiñán, 97, Spanish screenwriter and film director (My Dearest Senorita, The Nest, The Love of Captain Brando). *Maria Aro, 82, Finnish actress (How to Kill a Bull). *Patti Astor, 74, American actress (Underground U.S.A., Wild Style) and gallerist (Fun Gallery). *Moisés Barack, 80, Peruvian football manager (Unión Huaral, Deportivo Garcilaso, national team). *Eckart Dux, 97, German actor (The Merry Wives of Windsor, Mailman Mueller, Don't Forget Love). *Sara Tafuri, 67, Italian actress (City of Women, Three Brothers). *R. M. Veerappan, 97, Indian film producer (Kannan En Kadhalan, Oru Velladu Vengaiyagiradhu) and politician, Tamil Nadu MLA (1986–1996). ===8=== *Aderounmu Adejumoke, 37, Nigerian actress (Dazzling Mirage, Industreet, Jenifa's Diary). *Keith Barnes, 89, Welsh-born Australian rugby player (Balmain Tigers, New South Wales, national team). (death announced on this date) *Ricardo Bertone, 72, Argentine actor (Babilonia, The Absentee) and theater director. *André Boniface, 89, French Hall of Fame rugby union player (Dax, Mont-de-Marsan, national team). *Peter Higgs, 94, Nobel prize-winning physicist ===7=== *Clarence \"Frogman\" Henry, 87, American singer (\"Ain't Got No Home\", \"(I Don't Know Why) But I Do\", \"You Always Hurt the One You Love\"). *Antonette Mendes, 79, Indian singer, actress (Amchem Noxib, Nirmon, Mohabbat Zindagi Hai), and playwright. *Gangu Ramsay, 83, Indian cinematographer (Saboot, Aatma, Ghutan). ===6=== *Cole Brings Plenty, 27, American actor (1923). (death announced on this date) *Ernesto Gómez Cruz, 90, Mexican actor (La venida del Rey Olmos, La Víspera, The Crime of Padre Amaro). *Zofia Kucówna, 90, Polish actress (Spiral, Syzyfowe prace). ===5=== *R. F. Lucchetti, 94, Brazilian screenwriter (The Strange World of Coffin Joe, The Strange Hostel of Naked Pleasures, Hallucinations of a Deranged Mind), respiratory failure. *C. J. Snare, 64, American musician (FireHouse) and songwriter (\"Love of a Lifetime\", \"When I Look into Your Eyes\"), colon cancer. *Jaan Tooming, 78, Estonian actor and film director (November). ===4=== *Kaia Arua, 33, Papua New Guinean cricketer (national team). *Bruce Kessler, 88, American director (The Gay Deceivers, The Monkees, McCloud) and racing driver. *Keith LeBlanc, American drummer (Little Axe, Tackhead) and music producer (\"No Sell Out\"). (death announced on this date) ===3=== *Veljko Bulajić, 96, Montenegrin film director (Train Without a Timetable, Kozara, Great Transport). *Sándor Müller, 75, Hungarian footballer (Vasas, Hércules, national team). *Adrian Schiller, 60, English actor (Victoria, The Last Kingdom, The Danish Girl). *Song Min-hyung, 70, South Korean actor (Hwarang: The Poet Warrior Youth). *Vera Tschechowa, 83, German actress (Widower with Five Daughters, Euridice BA 2037, And That on Monday Morning), director, and screenwriter. ===2=== *Maryse Condé, 90, Guadeloupean novelist (Segu, Windward Heights, The Gospel According to the New World), critic and playwright. *Türker İnanoğlu, 87, Turkish film director and television producer (Yabancı Damat). *Tatyana Konyukhova, 92, Russian actress (Over Tissa, Balzaminov's Marriage, Moscow Does Not Believe in Tears). *Larry Lucchino, 78, American attorney and baseball executive (Boston Red Sox, Baltimore Orioles, San Diego Padres), World Series winner (1983, 2004, 2007, 2013). *Juan Vicente Pérez, 114, Venezuelan supercentenarian, world's oldest living man (since 2022). ===1=== *Paliath Ravi Achan, 96, Indian cricketer (Travancore-Cochin, Kerala). *Reza Davoud Nejad, 43, Iranian actor (The Accused Escaped, Reza, Without Her) and television presenter, complications from sepsis and liver surgery. *Mieczysław Grąbka, 73, Polish actor (Woman in a Hat, Vinci, The Collector). ==March== ===31=== *Barbara Baldavin, 85, American actress (Medical Center, Star Trek) and casting director (Trapper John, M.D.), heart failure. *Nam Il-woo, 85, South Korean actor (Small Town Rivals, Man in Love, Circle of Atonement). *Barbara Rush, 97, American actress (It Came from Outer Space, Peyton Place, Robin and the 7 Hoods). ===30=== *Tim McGovern, 68, American visual effects artist (Total Recall, Tron, Dunkirk), Oscar winner (1990). *Chance Perdomo, 27, American actor (Chilling Adventures of Sabrina, Gen V, After We Fell), traffic collision. *Mark Spiro, 66–67, American songwriter (\"Are You Still in Love with Me\") and record producer, cancer. (death announced on this date) *Géza Tordy, 85, Hungarian actor (Suburban Legend, For Whom the Larks Sing, Sleepless Years) and director. (death announced on this date) ===29=== *Daniel Balaji, 48, Indian actor (Kaadhal Kondein, Chirutha, Gnana Kirukkan), heart attack. *Gerry Conway, 76, English drummer and percussionist (Jethro Tull, Fairport Convention, Cat Stevens), complications from motor neurone disease. *Habib Benmimoun, 66, Algerian footballer (MC Oran, USM Bel Abbès, national team). *Louis Gossett Jr., 87, American actor (An Officer and a Gentleman, Roots, Iron Eagle), Oscar winner (1982). ===28=== *Rahib Aliyev, 78, Azerbaijani actor (The Scoundrel). *Lai Ming-sze, 58, Hong Kong singer and actress (The Inspector Wears Skirts). *Larry Lloyd, 75, English football player (Liverpool, national team) and manager (Wigan Athletic). (death announced on this date) *Ma Shitu, 109, Chinese writer and politician, deputy (1983–1993). *Walt Wesley, 79, American basketball player (Cincinnati Royals, Chicago Bulls, Cleveland Cavaliers), leukemia. ===27=== *Russell Hamer, 76–77, Sri Lankan cricketer (national team). (death announced on this date) *Joe Lieberman, 82, American politician, member of the U.S. Senate (1989–2013), Connecticut attorney general (1983–1989) and member of the Connecticut State Senate (1971–1981), complications from a fall. *Yriy Vaksman, 62, Russian actor (Garbage Man, Tycoon, Ragin) and film producer. ===26=== *Lamine Bangura, 59, Sierra Leonean footballer (national team), traffic collision. *Brigid Kelly, 40, American politician, member of the Ohio House of Representatives (2017–2022), esophageal cancer. ===25=== *Paula Weinstein, 78, American film producer (The Perfect Storm, The Fabulous Baker Boys, Blood Diamond). *Fritz Wepper, 82, German actor (Derrick, Cabaret, Die Brücke). ===24=== *Amaechi Muonagor, 61, Nigerian actor (Karishika, Aki na Ukwa, Aki and Pawpaw). *George Abbey, 91, American Engineer ===23=== *Daniel Beretta, 77, French actor (Revolver, Faceless). *Leszek Długosz, 82, Polish actor (The Third Part of the Night, Smolensk), poet and composer. *Maurizio Pollini, 82, Italian pianist. *Abdulah Sidran, 79, Bosnian poet and screenwriter (When Father Was Away on Business). *Silvia Tortosa, 77, Spanish actress (Horror Express, The Loreley's Grasp, The Girl from the Red Cabaret), cancer. ===22=== *Thodoros Katsadramis, 94, Greek actor (I Soferina, The Fear, Gia mia choufta Touristries). ===21=== *António Évora, 82, Portuguese actor (Slip-Up). *Bahar Öztan, 61, Turkish actress (Ortadirek Şaban). ===20=== *Saeed Ahmed, 86, Pakistani cricketer (national team). *Yves Michaud, 94, Canadian politician. *Muhammad Alwi Dahlan, 90, Indonesian politician. *Sten Elfström, 81, Swedish actor (Real Humans, Kronprinsessan, Beck – Annonsmannen). *Alfred M. Gray Jr., 95, American military officer, commandant of the Marine Corps (1987–1991). *Winai Kraibutr, 54, Thai actor (Nang Nak, The Snake King's Child, Queens of Langkasuka), blood infection. *Dumitru Macri, 92, Romanian football player (Rapid București, national team) and manager (Algeria national team). ===19=== *Donny Kesuma, 55, Indonesian actor (Bidadari Yang Terluka, Rajawali). *Ersen Martin, 44, Turkish footballer (Denizlispor, Ankaraspor, national team), complications from an aortic rupture. *Neil Thimbleby, 84, New Zealand rugby union player (Hawke's Bay, national team). *M. Emmet Walsh, 88, American actor (Blade Runner, Blood Simple, Fletch), cardiac arrest. ===18=== ===17=== *Steve Harley, 73, English musician (Steve Harley & Cockney Rebel), songwriter (\"Make Me Smile (Come Up and See Me)\", \"Mr. Soft\") and producer, cancer. *Robin Hobbs, 81, English cricketer (Essex, Glamorgan, national team). ===16=== *David Seidler, 86, British-American screenwriter (The King's Speech, Quest for Camelot, Tucker: The Man and His Dream). ===15=== *Joe Camp, 84, American film director (Benji, Hawmps!, The Double McGuffin) and writer. *Maria Chwalibóg, 91, Polish actress (Mother Joan of the Angels, Man – Woman Wanted, Korczak). *Peter Kelly, 82, Scottish actor (The Tall Guy, Welcome to Sarajevo). *Aleksandr Shirvindt, 89, Russian stage and film actor (The Irony of Fate, Three Men in a Boat, Winter Evening in Gagra) and screenwriter. ===14=== *Juanita Bynum, 65, American gospel singer and author. *Léon Semmeling, 84, Belgian footballer (Standard Liège, national team). ===13=== *Stefan Abadzhiev, 89, Bulgarian footballer (Levski Sofia, Wiesbaden, national team). *John Blunt, 76, British drummer (The Searchers). (death announced on this date) *György Gát, 77, Hungarian television director and producer (Linda, A Fox's Tale). *Sadi Mohammad, 70, Bangladeshi singer and composer. *Dan Wakefield, 91, American author and screenwriter (Going All the Way). ===12=== *Philippe de Gaulle, 102, French admiral and politician, senator (1986–2004). *Maria Richwine, 71, Colombian-born American model and actress (The Buddy Holly Story, a.k.a. Pablo, Freddy's Nightmares). ===11=== *Eric Carmen, 74, American musician (Raspberries) and songwriter (\"Go All the Way\", \"All by Myself\"). (death announced on this date) *Surya Kiran, 51, Indian film actor and director (Satyam, Dhana 51, Brahmastram), jaundice. *Malachy McCourt, 92, American actor (Ryan's Hope, Search for Tomorrow, Gods and Generals) and politician. *Pete Rodriguez, 91, American pianist (\"I Like It Like That\") and bandleader. *Dhirajlal Shah, Indian film producer (The Hero: Love Story of a Spy). ===10=== *Percy Adlon, 88, German film director, screenwriter, and producer (Fünf letzte Tage, Bagdad Cafe, Rosalie Goes Shopping). *Gigio Morra, 78, Italian actor (Un posto al sole, Gomorrah, Pinocchio). *T. M. Stevens, 72, American bass guitarist (The Pretenders), complications from dementia. *Karl Wallinger, 66, Welsh musician (The Waterboys, World Party) and songwriter (\"Ship of Fools\"). ===9=== *Mayte Carol, 82, Mexican actress (Ruletero a toda marcha, El patrullero 777, La boda de mi mejor amigo). *Georgi Popov, 79, Bulgarian footballer (Botev Plovdiv, national team). *Kayhan Yıldızoğlu, 90, Turkish actor (The Bandit). ===8=== *Jonathan Hunt, 85, New Zealand politician and diplomat, Postmaster-General (1984–1987), member (1966–2005) and speaker (1999–2005) of the House of Representatives. (death announced on this date) *Estrela Novais, 70, Portuguese actress (Doce Fugitiva, Amar Demais). *Dolly Sohi, 48, Indian actress (Kalash, Devon Ke Dev...Mahadev, Ek Tha Raja Ek Thi Rani), cervical cancer. *Ramya Wanigasekara, 73, Sri Lankan actress (Tikiri Suwanda, Ko Mark No Mark, Sarigama), singer, and radio broadcaster. ===7=== *Steve Lawrence, 88, American singer (\"Go Away Little Girl\", \"Footsteps\") and actor (The Blues Brothers), complications from Alzheimer's disease. *Daniel Martin, 72, French actor (The Dinner Game, East/West, Most Promising Young Actress). *Son Myung-soon, 95, South Korean first lady (1993–1998). ===6=== *Vikki Richards, 79, British actress (Curse of the Crimson Altar, Zeta One, Black Snake). *Misha Suslov, 84, Russian cinematographer (The Sixth of July, The Seagull, Black Moon Rising). ===5=== *John Behrent, 85, New Zealand cricketer (Auckland, Wellington). *Luc Boyer, 88, Dutch mime artist and actor (Het Phoenix Mysterie, Total Loss). *Debra Byrd, 72, American singer and vocal coach. *António-Pedro Vasconcelos, 84, Portuguese film director (Dead Man's Seat, Jaime, Beauty and the Paparazzo). ===4=== *Maurice Bembridge, 79, English golfer. (death announced on this date) *Jean-Pierre Bourtayre, 82, French composer (The Game Is Over, Arsène Lupin, Les Maîtres du temps). *Juan Verduzco, 78, Mexican actor (La familia P. Luche, Destilando Amor, The Stray Cat). ===3=== *Betty Brodel, 104, American actress (Swing Hostess, Too Young to Know, Cinderella Jones). *Eleanor Collins, 104, Canadian jazz singer, television host and civic leader. *Agbéyomé Kodjo, 69, Togolese politician, prime minister (2000–2002) and president of the National Assembly (1999–2000), heart attack. ===2=== *Paul Houde, 69, Canadian actor (Les Boys) and television and radio host. *Valery Ivchenko, 84, Russian actor (The Tale about the Painter in Love, Rock'n'roll for Princesses, Me Ivan, You Abraham). *Jaclyn Jose, 59, Filipino actress (The Flor Contemplacion Story, Familia Zaragoza, Ma' Rosa). *John Okafor, 62, Nigerian actor (Issakaba) and comedian. ===1=== *Iris Apfel, 102, American businesswoman and designer. *Oh Hyun-kyung, 87, South Korean actor (Now and Forever, The King's Letters).[단독 '무대 인생 60년' 연극배우 오현경 별세...향년 88세] *Akira Toriyama, 68, Japanese manga artist (Dragon Ball, Dr. Slump) and video game artist (Dragon Quest), subdural hematoma. ==February== ===29=== *Brian Mulroney, 84, Canadian politician, prime minister (1984–1993). *Ali Hassan Mwinyi, 98, Tanzanian politician, president (1985–1995), lung cancer. *Paolo Taviani, 92, Italian film director (Allonsanfàn, Padre Padrone, Kaos) and screenwriter. ===28=== *Jean Allison, 94, American actress (Bad Company, Gunsmoke, Devil's Partner). *Ilias Logothetis, 84, Greek actor (Landscape in the Mist, The Suspended Step of the Stork, The Bubble). *Luis Molteni, 73, Italian actor (Nero, The Phantom of the Opera, The Legend of 1900). *Dave Myers, 66, English television presenter (The Hairy Bikers' Cookbook), cancer. *Nikolai Ryzhkov, 94, Soviet and Russian politician. *Virgil, 61, American professional wrestler (WWE, WCW) and actor (Bridge and Tunnel). ===27=== *Michael Culver, 85, British actor (The Empire Strikes Back, A Passage to India, The Adventures of Black Beauty). *Richard Lewis, 76, American comedian and actor (Curb Your Enthusiasm, Anything but Love, Robin Hood: Men in Tights), heart attack. *Camila Perissé, 70, Argentine actress (Atrapadas, Siempre es difícil volver a casa), dancer and vedette. ===26=== *Salah Larbès, 71, Algerian footballer (JS Kabylie, national team). *Tolga Savacı, 60, Turkish actor (Dersimiz: Atatürk, Kızım Nerede?, Kurt Seyit ve Şura), heart attack. ===25=== *Charles Dierkop, 87, American actor (Police Woman, Butch Cassidy and the Sundance Kid, The Sting), heart attack. *Ernst Romanov, 87, Russian actor (Monologue, Failure of Engineer Garin, Moonzund). *Violet Lee Ying, 70, Hong Kong actress (He Has Nothing But Kung Fu). ===24=== *Stan Bowles, 75, English footballer (Queens Park Rangers, Brentford, national team), complications from Alzheimer's disease. *Chris Nicholl, 77, English-born Northern Irish football player (Aston Villa, Southampton, Northern Ireland national team) and manager. *Kumar Shahani, 83, Indian film director (Maya Darpan, Khayal Gatha, Kasba). ===23=== *Flaco, 13, American owl, window collision. *Manohar Joshi, 86, Indian politician, speaker of the Lok Sabha (2002–2004), chief minister of Maharashtra (1995–1999), and minister of heavy industries (1999–2002), cardiac arrest. *Stuart Organ, 72, British actor (Grange Hill). *Rajendra Sukhanand Patni, 59, Indian politician, Maharashtra MLA (2004–2009, since 2014). *Tina Rainford, 77, German singer (\"Silver Bird\"). (death announced on this date) *Shinsadong Tiger, 40, South Korean record producer (\"U&I;\", \"No No No\"). ===22=== *Liudmyla Alfimova, 88, Ukrainian actress (Wedding in Malinovka). *Edith Ceccarelli, 116, American supercentenarian. *Lanny Flaherty, 81, American actor (Miller's Crossing, Signs, Men in Black 3). (death announced on this date) ===21=== *Efeso Collins, 49, New Zealand politiican, MP (since 2023). *Ewen MacIntosh, 50, British actor (The Office, Finding Fatimah) and comedian. *Micheline Presle, 101, French actress (Adventures of Captain Fabian, Blind Date, The Bride Is Much Too Beautiful). *Pamela Salem, 80, British actress (Never Say Never Again, EastEnders, Into the Labyrinth). *John Savident, 86, British actor (Waterloo, A Clockwork Orange, The Remains of the Day). ===20=== *Andreas Brehme, 63, German footballer (Bayern Munich, Inter Milan, national team) and manager, cardiac arrest. *Thanaa Debsi, 83, Syrian actress (The Dupes). *Vladimir Makeranets, 76, Russian film director (The Golden Snake, You Exist...) and cinematographer (Semyon Dezhnev). *Rituraj Singh, 59, Indian actor, cardiac arrest. *Charles Swini, 38, Malawian footballer (ESCOM United, Civo United, national team), kidney problems. *Raina Tomova, 83, Bulgarian screenwriter (Adaptatziya) and playwright. *Yoko Yamamoto, 81, Japanese actress (Red Handkerchief, Gappa: The Triphibian Monster, Hissatsu!5 Ōgon no Chi). ===19=== *Tikoy Aguiluz, 72, Filipino film director (Dead Sure, Rizal sa Dapitan, Manila Kingpin: The Asiong Salonga Story). (death announced on this date) *Roland Bertin, 93, French actor (Charlotte for Ever, West Indies, Diva). *Paul D'Amato, 75, American actor (Slap Shot, The Deer Hunter, Firepower), progressive supranuclear palsy. *Ira von Fürstenberg, 83, Italian actress (Five Dolls for an August Moon, The Vatican Affair, The Battle of El Alamein). ===18=== *Bernard Aubouy, 84–85, French sound engineer and film director (Le Père Noël a les yeux bleus, The Tall Blond Man with One Black Shoe, I Don't Know Much, But I'll Say Everything). *Jacques Bernard, 94, French actor (Les Enfants terribles, Quintuplets in the Boarding School, Love and the Frenchwoman). *Tony Ganios, 64, American actor (Porky's, The Wanderers, Die Hard 2), heart failure following surgery. ===17=== *Suhani Bhatnagar, Indian actress (Dangal), Dermatomyositis. *Sevda Ferdağ, 81, Turkish actress (Cennetin Kapısı, King of the Doormen, The Secret Face) and singer. *Mike Procter, 77, South African cricketer (Gloucestershire, Natal, Rhodesia). ===16=== *Idris Ali, 73, Indian politician, MP (2014–2019) and West Bengal MLA (since 2019). *Etterlene DeBarge, 88, American singer (DeBarge). *Maciej Grzybowski, 81, Polish actor (Przygoda z piosenką, Stones for the Rampart). *Ian McMillan, 92, Scottish footballer (Airdrieonians, Rangers, national team). *Alexei Navalny, 47, Russian lawyer, politician and leader of the Russian opposition to Putin's presidency. *Jorge Toro, 85, Chilean footballer (Modena, Colo-Colo, national team). ===15=== *Gérard Barray, 92, French actor (Shéhérazade, Open Your Eyes, Captain Fracasse). *José Pinto, 95, Portuguese actor (Abraham's Valley, O Delfim, Duas Mulheres). ===14=== *Tamara Kolesnikova, 85, Russian actress (Day of Sun and Rain, Sofia Kovalevskaya, Raspoutine). ===13=== *Aletta Bezuidenhout, 74, Kenyan-born South African actress (In My Country, Paljas). *Datta Gaekwad, 95, Indian cricketer (Baroda, national team). *Johanna von Koczian, 90, German actress (Victor and Victoria, The Marriage of Mr. Mississippi, Our House in Cameroon). ===12=== *Mounir Hamoud, 39, Moroccan-born Norwegian footballer (Lyn, Bodø/Glimt, Strømsgodset), cardiac arrest. *Chakradhar Jena, Indian actor (City of Joy, Electric Moon, Sanju Aau Sanjana). *Zdenko Morovic, 57, Yugoslav-born Venezuelan footballer (Deportivo Italia, national team). ===11=== *Kelvin Kiptum, 24, Kenyan long-distance runner, traffic collision. ===10=== *Edward Lowassa, 70, Tanzanian politician, prime minister (2005–2008) and MP (1995–2015). ===9=== *Aleksander Fabisiak, 78, Polish actor (Dagny, Pigs, Afterimage). *Renata Flores, 74, Mexican actress (Rosa salvaje, La usurpadora, Amores verdaderos). *Damo Suzuki, 74, Japanese singer (Can) and songwriter (\"Vitamin C\", \"Spoon\"), colon cancer. ===8=== *Soso Jachvliani, 65, Georgian actor (The Wishing Tree, The Sun of the Sleepless, A Chef in Love), film director and sportsman. ===7=== *Abu Baqer al-Saeedi, Commander of Kata'ib Hezbollah, american airstrike. *Henry Fambrough, 85, American Hall of Fame singer (The Spinners). *Mojo Nixon, 66, American musician (\"Debbie Gibson Is Pregnant with My Two-Headed Love Child\") and actor (Super Mario Bros., Great Balls of Fire!). *Abror Tursunov, Uzbek actor (Suyunchi, Abdullajon). ===6=== *Miguel Ángel, 76, Spanish footballer (Real Madrid, Castellón, national team), complications from amyotrophic lateral sclerosis. *Michael A. Epstein, 102, British virologist, 102. *Tommy Karlsen Sandum, 48, Norwegian actor (Lilyhammer, Døden på Oslo S). *Don McKay, 86, New Zealand rugby union player (Auckland, national team). *Sebastián Piñera, 74, Chilean politician, president (2010–2014, 2018–2022) and senator (1990–1998), helicopter crash. *Robert M. Young, 99, American film director, screenwriter (Alambrista!, The Ballad of Gregorio Cortez) and producer (American Me). ===5=== *Michael Jayston, 88, English actor (Only Fools and Horses, Doctor Who, Nicholas and Alexandra). *Toby Keith, 62, American country singer (\"Should've Been a Cowboy\", \"How Do You Like Me Now?!\", \"Who's That Man\"), songwriter and record producer, stomach cancer. *Namkoong Won, 89, South Korean actor (Eunuch, Woman of Fire, Assassin). *Jimi Solanke, 81, Nigerian actor (Sango, Shadow Parties), poet, and playwright. ===4=== *N. K. Desam, 87, Indian poet and literary critic. *Hage Geingob, 82, Namibian politician, president (since 2015) and prime minister (1990–2002, 2012–2015), cancer. *Barry John, 79, Welsh rugby player (Cardiff, Barbarian, national team). ===3=== *Charles Ouda, 38, Kenyan actor (Makutano Junction, The First Grader). *Helena Rojo, 79, Mexican actress (The House in the South, The Great Adventure of Zorro, Misterio) and model, liver cancer. ===2=== *Francisco Jara, 82, Mexican footballer (Guadalajara, national team). *Wayne Kramer, 75, American guitarist (MC5). *Ian Lavender, 77, English actor (Dad's Army, EastEnders, Parsley Sidings). *Don Murray, 94, American actor (Bus Stop, A Hatful of Rain, The Plainsman). (death announced on this date) *Claudio Rissi, 67, Argentine actor (El marginal, The Desert Bride, Tiger, Blood in the Mouth), cancer. *Gregory Charles Rivers, 58, Australian actor (Man from Guangdong, Triumph in the Skies, Under the Canopy of Love), suicide by charcoal-burning. ===1=== *Pasha Kapinos, 48, Russian cinematographer (Hardcore Henry, Yolki 5, Kitchen. The Last Battle). *Nikos Vandoros, 99, Greek actor (Jenny Jenny, I charavgi tis nikis, The Man with the Carnation). *Carl Weathers, 76, American actor (Rocky, Predator, The Mandalorian), television director, and football player (Oakland Raiders). ==January== ===31=== *Rick Boland, 70, Canadian actor (Finding Mary March, Extraordinary Visitor, The Divine Ryans). *Anatoliy Dryzhenko, 82, Ukrainian actor (Two in One). *Farida Muminova, 66, Russian actress (Toʻylar muborak, Such Late, Such Warm Autumn, The Battle of the Three Kings). ===30=== *György Barkó, 92, Hungarian actor (The Witman Boys, Mom and Other Loonies in the Family). *Chita Rivera, 91, American actress (West Side Story, Kiss of the Spider Woman, Chicago), Tony winner (1984, 1993). ===29=== *Richard Howard, 79, British actor (Emmerdale Farm). (death announced on this date) *Sandra Milo, 90, Italian actress (8½, Juliet of the Spirits, Vanina Vanini). ===28=== *Troy Beckwith, 48, Australian actor (The Miraculous Mellops, Neighbours, Pugwall). (death announced on this date) *Víctor Luna, 64, Colombian football player (Atlético Nacional, national team) and manager (Barcelona), heart attack. *Luis Tejada, 41, Panamanian footballer (Juan Aurich, Universitario, national team), heart attack. ===27=== *Harmohan Dhawan, 83, Indian politician, MP (1989–1991) and minister of civil aviation (1990–1991). *Enrique Liporace, 82, Argentine actor (Time for Revenge, Last Days of the Victim, Eva Perón: The True Story). *Susumu Taira, 89, Japanese actor (Nabbie's Love). ===26=== *El Amry Farouk, 53, Egyptian businessman and politician. ===25=== *Bhavatharini, 47, Indian composer (Bharathi, Azhagai Irukkirai Bayamai Irukkirathu) and music director (Mitr, My Friend), cancer. *Bat-Sheva Dagan, 98, Polish-Israeli Holocaust survivor, educator and author. *Roger Donlon, 89, American army officer, Medal of Honor recipient (1964). *Kenneth Eugene Smith, 58, American convicted murderer, execution by nitrogen hypoxia. ===24=== *Harry Connick Sr., 97, American attorney, district attorney of New Orleans (1973–2003). *Herbert Coward, 85, American actor (Deliverance), traffic collision. *Howard Golden, 98, American lawyer and politician, borough president of Brooklyn (1977–2001). *, 68, Azerbaijani actor (The Magic Gown). (death announced on this date) *N. Scott Momaday, 89, American author (House Made of Dawn, The Way to Rainy Mountain, The Man Made of Words: Essays, Stories, Passages). *Selwyn Muru, 86, New Zealand artist. (death announced on this date) *Väino Uibo, 81, Estonian actor (A Time to Live and a Time to Love) and politician, mayor of Elva (1993–1998). ===23=== *, 68, Tunisian footballer (Espérance de Tunis, USM Malakoff, national team). *Frank Farian, 82, German singer, songwriter (\"Rasputin\") and record producer (Boney M, Milli Vanilli). *Charles Fried, 88, American jurist and lawyer, solicitor general (1985–1989) and associate justice of the Massachusetts Supreme Judicial Court (1995–1999). *David Kahn, 93, American historian, journalist, and writer. *Melanie, 76, American singer-songwriter (\"Brand New Key\", \"Lay Down (Candles in the Rain)\") and guitarist. *Giuliano Musiello, 70, Italian footballer (Atalanta, Roma, Verona). *Charles Osgood, 91, American news anchor (CBS News Sunday Morning), complications from dementia. *Jean Petit, 74, French footballer (AS Monaco, France national football team). *Anders Sandberg, 55, Swedish singer (Rednex). *Ice Train, 56, American professional wrestler (CWA, WCW). ===22=== *, 89, Uzbek actor (Maftuningman, Fiery Roads). *Elke Erb, 85, German author. *Gary Graham, 73, American actor (Alien Nation, Star Trek: Enterprise, All the Right Moves). *Dexter King, 62, American civil rights activist, prostate cancer. *Arno Allan Penzias, 90, American physicist and radio astronomer, Nobel Prize laureate (1978), complications from Alzheimer's disease. *Anatoli Polivoda, 76, Ukrainian basketball player, Olympic champion (1972) and bronze medalist (1968). *Gigi Riva, 79, Italian footballer (Cagliari, Legnano, national team), heart attack. ===21=== *, 75, Romanian sculptor. (death announced on this date) *David Gail, 58, American actor (Robin's Hoods, Savannah, Port Charles). (death announced on this date) *Mokhtar Hasni, 71, Tunisian footballer (EM Mahdia, R.A.A. Louviéroise, national team). ===20=== *Choe Thae-bok, 93, North Korean politician, chairman of the Supreme People's Assembly (1998–2019), heart attack. *Piedad Córdoba, 68, Colombian politician, MP (1992–2010), heart attack. *David Emge, 77, American actor (Dawn of the Dead, Basket Case 2, Hellmaster). *Norman Jewison, 97, Canadian film director (Moonstruck, In the Heat of the Night, Fiddler on the Roof). *Sadegh Omidzadeh, Iranian intelligence officer (Quds Force), israeli airstrike. *Doug Padgett, 89, English cricketer (Yorkshire, national team). *Anadi Charan Sahu, 83, Indian politician, MP (1977–1980). Age related health issues ===19=== *Héctor Bidonde, 86, Argentine actor (La Rabona, Alma mía, Chile 672) and stage director. *Lance Larson, 83, American swimmer, Olympic champion (1960). *Lee Doo-yong, 81, South Korean film director (The General in Red Robes, The Korean Connection, Mulleya Mulleya) and screenwriter, lung cancer. *Toru Kawashima, 53, Japanese footballer (Gamba Osaka, Tokushima Vortis). *Ewa Podleś, 71, Polish coloratura contralto singer. *Marlena Shaw, 81, American singer (\"It's Better than Walking Out\", \"California Soul\"). *Mary Weiss, 75, American singer (The Shangri-Las). ===18=== *Donald Adamson, 84, British literary scholar, philosopher and historian. *Mohamed Ghozzi, 74, Tunisian poet and literary critic. *Giovanni Giudici, 83, Italian Roman Catholic prelate, auxiliary bishop of Milan (1990–2003) and bishop of Pavia (2003–2015). *Josef Haas, 86, Swiss cross-country skier, Olympic bronze medallist (1968). *Norbert Lichý, 59, Czech actor (Lidice, Hastrman) and musician. (death announced on this date) *Cecilia Ogwal, 77, Ugandan politician, MP (since 1996), cancer. *Amnon Rubinstein, 92, Israeli politician, MK (1977–2002), minister of communications (1984–1987) and education (1993–1996). *Romy Vitug, 86, Filipino cinematographer (Harvest Home, Sa Aking mga Kamay, Sa Pusod ng Dagat). ===17=== *Shawnacy Barber, 29, Canadian-American Olympic pole vaulter (2016), world champion (2015). *Baldev Raj Chawla, 86, Indian politician, Punjab MLA. *Roger T. Forster, 90, British Christian theologian, founder of the Ichthus Christian Fellowship. *Sir Tony Lloyd, 73, British politician, MP (1983–2012, since 2017) and mayor of Greater Manchester (2015–2017), leukemia. *Knut Hjeltnes, 72, Norwegian Olympic discus thrower (1976, 1984, 1988). *Hussein Madi, 85, Lebanese painter and sculptor. *Dejan Milojević, 46, Serbian basketball player (Budućnost, Partizan) and coach (Golden State Warriors), heart attack. *Bennie Muller, 85, Dutch footballer (Ajax, national team). *Jurij Souček, 94, Slovenian actor (Don't Whisper). *, 85, German actor and writer. *Aleksandr Vontov, 73, Russian actor (It, Pushkin: The Last Duel, Salyut 7). ===16=== *John Bingley, 82, Australian footballer (St Kilda). *José Lifante, 80, Spanish actor (Spanish Fly, Butterfly on the Shoulder, National Heritage), blood clot. *Milan Nenadić, 80, Serbian middleweight Greco-Roman wrestler, Olympic bronze medallist (1972). *Sergio Sebastiani, 92, Italian Roman Catholic cardinal, apostolic pro-nuncio to Madagascar (1976–1985) and Turkey (1985–1994), head of the Prefecture for the Economic Affairs of the Holy See (1997–2008). *Peter Schickele, 88, American composer and musical satirist (P. D. Q. Bach). *Lise Thiry, 102, Belgian scientist and politician. *Vaino Väljas, 92, Estonian diplomat and politician, first secretary of the communist party (1988–1990). *Klaus Wunder, 73, German footballer (MSV Duisburg, Bayern Munich, 1972 Olympics). *Lahcen Zinoun, 79, Moroccan choreographer (The Last Temptation of Christ, The Sheltering Sky, Joseph), cerebral hemorrhage. ===15=== *Dana Ghia, 91, Italian actress (Seven Deaths in the Cat's Eye, Free Hand for a Tough Cop, California) and singer. (death announced on this date) *Jorge Griffa, 88, Argentine footballer (Newell's Old Boys, Atlético Madrid, national team). *Dror Kashtan, 79, Israeli football player (Hapoel Petah Tikva, national team) and manager (national team). *Shih Ming-teh, 83, Taiwanese politician, MP (1993–2002). ===14=== *Dominick Cirillo, 94, American mobster (Genovese crime family). *Munawwar Rana, 71, Indian poet, throat cancer. *Raema Lisa Rumbewas, 43, Indonesian weightlifter, Olympic silver medallist (2000, 2004). *Elisabeth Trissenaar, 79, Austrian actress (Angry Harvest, The Stationmaster's Wife, Mario and the Magician). *Howard Waldrop, 77, American science fiction author (Them Bones, A Dozen Tough Jobs, The Texas-Israeli War: 1999), stroke. ===13=== *Abdullah CD, 100, Malaysian politician and paramilitary leader, commander of the 10th Malay Regiment (1949–1989). *András Csiky, 93, Romanian-Hungarian actor (Forest of the Hanged, Vlad Țepes, The Stud Farm). *Jana Hlaváčová, 85, Czech actress (Operace Silver A). *Stephen Laybutt, 46, Australian footballer (Gent, Newcastle Jets, national team), suicide. *Juli Mira, 74, Spanish actor (The Sea, The 7th Day, Shiver). *Enzo Moscato, 75, Italian playwright, actor (Libera, The Vesuvians, The Remains of Nothing) and stage director. *Joyce Randolph, 99, American actress (The Honeymooners). ===12=== *Bill Hayes, 98, American singer (\"The Ballad of Davy Crockett\") and actor (Days of Our Lives). * Marek Litewka, 75, Polish actor. * Pierre Mailloux, 74, Canadian psychiatrist. *Gennadi Yakovlev, 85, Russian botanist, pharmacognosist, and phytochemist. ===11=== *Laurence Badie, 95, French actress (The Virtuous Scoundrel, Woman Times Seven, Bankers Also Have Souls) and comedian. *Khalid Butt, Pakistani actor (Shah, Rahm, Motorcycle Girl) and film producer, kidney and liver disease. *Yury Solomin, 88, Russian actor (An Ordinary Miracle, Dersu Uzala, Die Fledermaus), complications from a stroke. ===10=== *Tisa Farrow, 72, American actress (Homer, Zombi 2, Antropophagus). *Janusz Majewski, 92, Polish film director (Lokis, Epitafium dla Barbary Radziwiłłówny, Hotel Pacific) and screenwriter. *Conrad Palmisano, 75, American stuntman (Batman Forever, Weekend at Bernie's, Rush Hour 2). ===9=== *Miklós Benedek, 77, Hungarian actor (Soldiers of Freedom, Free Fall), and theater director. *James Kottak, 61, American drummer (Scorpions, Kingdom Come, Kottak). *Ustad Rashid Khan, 55, Indian classical musician. Prostate cancer *Kai Wiedenhöfer, 57, German photojournalist ===8=== *Adan Canto, 42, Mexican actor (X-Men: Days of Future Past, Designated Survivor, The Cleaning Lady), appendiceal cancer. *Duncan Hales, 76, New Zealand rugby union player (Canterbury, Manawatu, national team). *Ventura Pons, 78, Spanish film director (Ocaña, an Intermittent Portrait, Anita Takes a Chance, Food of Love). *Gian Franco Reverberi, 89, Italian composer (Django, Prepare a Coffin, A Black Veil for Lisa, Cry Chicago) and musician. (death announced on this date) *Ron Taylor, 91, Australian rugby league player (Eastern Suburbs, South Sydney, New South Wales). (death announced on this date) *J. P. R. Williams, 74, Welsh rugby union player (Barbarians, British & Irish Lions, national team). ===7=== *Joan Acocella, 78, American journalist and dance critic (The New Yorker), cancer. *Franz Beckenbauer, 78, German football player (Bayern Munich, national team) and manager, world champion (1974) and Ballon D'or winner (1972, 1976). *Mateusz Rutkowski, 37, Polish ski jumper. * ===6=== *, 79, Italian lawyer and politician. *Cindy Morgan, 69, American actress (Tron, Caddyshack, Falcon Crest). (death announced on this date) ===5 === *Larry Collins, 79, American guitarist (The Collins Kids) and songwriter (\"Delta Dawn\"). *Derek Draper, 56, English lobbyist and political adviser, complications from a heart attack. (death announced on this date) *Joseph Lelyveld, 86, American journalist (The New York Times), complications from Parkinson's disease. *Mário Zagallo, 92, Brazilian football player, world champion (1958, 1962), and manager (Flamengo, Botafogo, national team). ===4=== *Ayla Algan, 86, Turkish singer and actress (The House of Leyla, O Hayat Benim, Binbir Gece). *Fabio Fabbri, 90, Italian politician, senator (1976–1994), and lawyer. *Georgina Hale, 80, British actress (Mahler, The Devils, Castaway). *Glynis Johns, 100, British actress (Mary Poppins, A Little Night Music, The Sundowners), Tony winner (1973). *Christian Oliver, 51, German actor (Speed Racer, The Good German, Saved by the Bell: The New Class), plane crash. *Mike Sadler, 103, British Army officer, last original member of the Special Air Service. *Antonino Solmer, 73, Portuguese actor (The King's Trial, The Jew) and stage director. *David Soul, 80, American-British actor (Starsky & Hutch, Here Come the Brides) and singer (\"Don't Give Up on Us\"). *Konstantin Zheldin 90, Russian actor (Major Whirlwind, Seventeen Moments of Spring, Brother 2). ===3=== *Lillian Crombie, 66, Australian actress (Jindalee Lady) and dancer. *Germana Dominici, 77, Italian actress (Black Sunday, Mi vedrai tornare, Il ragazzo del Pony Express). *Bernard Ducuing, 73, French footballer (Red Star, Reims, Montpellier). ===2=== *Saleh al-Arouri, 57, Palestinian militant and commander of the Izz ad-Din al-Qassam Brigades (since 1993), israeli airstrike. *Sartaj Aziz, 94, Pakistani politician and economist, minister of foreign affairs (1998–1999, 2013–2017), national security advisor (2013–2015) and three-time minister of finance. *Peter Berkos, 101, American sound editor (The Hindenburg, Slap Shot, The Great Waldo Pepper), Oscar winner (1975). *Alberto Festa, 84, Portuguese footballer (Porto, Tirsense, national team). *Connie Madigan, 89, Canadian ice hockey player (St. Louis Blues) and actor (Slap Shot). *Gordon R. Sullivan, 86, American general, chief of staff of the Army (1991–1995). ===1=== *Mario Boljat, 72, Croatian footballer (Hajduk Split, Schalke 04, Yugoslavia national team). *James Herbert Brennan, 83, Northern Irish author (The Faerie Wars Chronicles, The Occult Reich). *Mickey Cottrell, 79, American film publicist and actor (My Own Private Idaho, Volcano, Ed Wood). * Peter Magubane, 91, South African photographer. * Basdeo Panday, 90, Trinidadian politician, prime minister (1995–2001). *Frank Ryan, 87, American football player (Los Angeles Rams, Cleveland Browns, Washington Redskins) and mathematician, complications from Alzheimer's disease. * Iwona Śledzińska-Katarasińska, 82, Polish politician, MP (1991–2023). *Niklaus Wirth, 89, Swiss computer scientist (Pascal). *Sidney M. Wolfe, 86, American physician and health activist, brain tumor. *Lynn Yamada Davis, 67, TikTok and Youtube star (Cooking with Lynja). ==References== ==Other websites== *The Guardian (UK) obituaries *The New York Times obituaries * Category:2020s events",
 "title": "Deaths in 2024"
}