{
 "id": "1073856",
 "text": "Hastings Ndlovu (2 February 1961 - 16 June 1976) was a South African activist who was shot and killed during the 1976 Soweto uprising. ==Life and death== Ndlovu was 15 years old on the day of the uprising. He and other Black students protested against an official order making Afrikaans required in their schools and banning their local languages in these schools. On that morning, he led these students towards the bridge in Khumalo Street, where they met police from the Orlando Police Station led by Colonel Kleingeld. Kleingeld later claimed that he was \"inciting the mob\". There he was shot at, and he was actually the first to be shot according to police records. However, his death did not become as iconic as Hector Pieterson's because no photographer was present to record Ndlovu's death and it was not immediately known. Ndlovu was taken, in the middle of the morning, to Chris Hani Baragnawath Hospital with gunshot wounds. More specifically, he had a bullet wound to one side of his head. Brains and blood spilled out of a large exit wound on the other. He also had a coma from the moment he was shot, and he was dead at some time around midday. This was all recorded by his doctor, Malcolm Klein, in his report from 2003, now in the Hector Pieterson Museum. Ndlovu's legacy was passed on by his family. His father died in 2003 and his two sisters went into exile shortly after 16 June but have returned to Johannesburg. It is believed that his mother died shortly after her two daughters left South Africa. ==Legacy== Ndlovu was laid to rest in the same cemetery as Pieterson, Avalon Cemetery, and is honoured alongside Pieterson at the Hector Pieterson Museum His home was given a blue plaque on June 16, 2012 as a spot on the June 16 Soweto Heritage Trail to remember his sacrifice. Ndlovu's bridge, on the corner of Klipspruit Valley and Khumalo roads, marks the location where he was shot by the police. On the bridge there is a statue of young Ndlovu dressed in uniform and standing on a plinth (heavy supporting base). He is smiling and holding his arm up. Storyboards line each side of the bridge, on the sides of a new steel and concrete structure with seating. ==References== Category:1961 births Category:1976 deaths Category:Soweto Category:South African activists",
 "title": "Hastings Ndlovu"
}