{
 "id": "1073643",
 "text": "Rumble is a 2021 animated sports comedy movie led by Hamish Grieve and scripted by Matt Lieberman. The movie is loosely based off of the graphic novel Monster on the Hill, written by Rob Harrell. The movie is voice acted by Will Arnett, Geraldine Viswanathan, Terry Crews, Stephen A. Smith, Jimmy Tatro, Tony Danza, Susan Kelechi Watson, Tony Shalhoub, Bridget Everett, Greta Lee, Ben Schwartz, Roman Reigns and Becky Lynch. The movie is produced by Paramount Pictures, WWE Studios, Walden Media, and Reel FX Animation Studios. The movie was released on the 15th of December 2021 on the movie streaming platform Paramount+. == Plot == In a world where big monsters and humans coexist with each other, they have a sport called monster wrestling. Each city has its own monster wrestler. The champion from a small town named Stoker, Tentacular, decides he doesn't want to represent Stoker anymore after becoming the world champion. The town is in trouble because if they don't find a new wrestler, they'll lose their stadium and money. Winnie, who loves wrestling, goes to an underground fight and finds Rayburn Jr., the son of the late Stoker champion. He's fighting under the name \"Steve The Stupendous.\" Winnie helps Steve win a match instead of losing on purpose. Steve owes money to Lady Mayhen, the boss of the underground arena, but Winnie promises to help him get the money by training him to fight Tentacular. Steve agrees. At first, Steve doesn't care about learning to fight properly and wins by avoiding his opponent. He left Stoker because people only saw him as his father's son, and he couldn't live up to his dad's name. Winnie discovers Steve loves dancing, so she trains him using dance moves. As they move up in the wrestling rankings, Tentacular buys Stoker's stadium and wants to demolish it because he's tired of being compared to Rayburn, Steve's dad. Even though Steve repays Lady Mayhen, he decides to help Winnie. He reveals he's Rayburn's son and challenges Tentacular to a match for the stadium. During the fight, Steve dodges Tentacular's hits in the first round but struggles in the second. With Winnie's encouragement, Steve lands several hits with his dance moves in the third round. Winnie tells Steve to use Tentacular's suckers to stick him to a corner post. When Steve goes in for the final move, they both get knocked out. Tentacular gets up first but is too shaken to end the match. The crowd helps Steve by clapping a salsa beat, and he defeats Tentacular, becoming the new monster wrestling champion. Stoker's stadium is saved, and monsters and humans continue to coexist. ==Cast== * Will Arnett as Steve/Rayburd Junior * Geraldine Viswanathan as Winnie * Stephen A. Smith as Marc Remy * Terry Crews as Tentacular * Jimmy Tatro as Lights Out McGinty * Joe Anoa'i as Ramarilla * Rebecca Quin as Axehammer * Tony Danza as Siggy * Ben Schwartz as Jimothy Brett-Chadley III * Michael Buffer as Stoker Announcer * Susan Kelechi Watson as Maggie * Fred Melamed as Mayor * Brian Baumgartner as Klonk * Christopher Knights as King Gorge's Coach == References == Category:2020s sports comedy movies Category:2021 comedy movies Category:American sports comedy movies",
 "title": "Rumble (2021 movie)"
}