{
 "id": "1073991",
 "text": "All Faiths Chapel, previously known as Chapel for the Children, is a house of worship available to anyone who practices any faith. All Faiths Chapel is also a historical landmark. It is inside the Austin State Supported Living Center (AusSSLC), an assisted living facility for people with developmental or intellectual disabilities, in Austin, Texas. AusSSLC was known at the time of the chapel's construction as the Austin State School. As of May 9, 2022, it is on the National Register of Historic Places for its importance in architectural, disability, and social history. == History == The chapel was built to honor a request by Reverend Luther Holloway, who was Austin State School’s chaplain, for a dedicated space for worship. Organizations such as the Protestant Austin Council of Church Women, the Austin Jewish Community Council, and the Catholic Ladies of Charity, organized a fundraising campaign for the construction of the chapel across the state. More funding came from soldiers who were stationed in Germany. The funds raised eventually totaled over $100,000. Construction by architect David Calvert Graeber finished around 1961, and Chapel for the Children was dedicated on January 21, 1962. From 1961 to 1972, Chapel for the Children served as a chapel for students of all faiths who lived in the AusSSLC. It is now an area for spiritual and religious services for residents, family members, employees, and the public. After David Graeber’s death in 2010, the chapel hosted his memorial service. Family members asked for, in place of flowers, donations to be made in Graeber's name to the maintenance fund for the chapel. == Structure and design == All Faiths Chapel consists of 3 distinct sections: the main chapel, a meditation garden, and a chaplaincy office. ; Main Chapel The main chapel consists of a 52-foot tall A-frame with a ceiling lighted by the sky. Both gable ends feature the stained glass design \"Miracle in the Sky\" by artist Blossom Burns. The interior design includes copper light fixtures made by hand and door handles that depict simple abstract style flying birds. The Texas Historical Commission states that these birds \"reflect the importance of music and graphic arts in teaching religious concepts to persons with physical and cognitive impairments.\" ; Meditation Garden To the north of the main chapel is a fully landscaped exterior courtyard called the Meditation Garden. There are sidewalks that lead both back to the chapel and to the chaplaincy office. The primary entrance to the garden has the verse Isaiah 56:7 from the Bible written on it: \"MINE HOUSE SHALL BE CALLED AN [sic] HOUSE OF PRAYER FOR ALL PEOPLE\". In the northwest corner, there is a tall mature oak tree. In the southeast corner is a large limestone statue, titled Lazarus, which was donated by David Graeber’s son Larry Graeber in 2015. Lazarus is of a man reclining and looking upwards towards the west. ; Chaplaincy Office There is a chaplaincy office attached, with five office rooms and one restroom. The office rooms include a sacrament room, office space, a meeting room, and a communal room with a small attached kitchen. == References == Category:Churches",
 "title": "All Faiths Chapel"
}