{
 "id": "1073749",
 "text": "Postpartum depression (PPD), also called postnatal depression, is a type of mood disorder that happens after childbirth, which can affect both sexes. Symptoms may include extreme sadness, low energy, anxiety, crying episodes, and changes in sleeping or eating patterns. PPD can also negatively affect the newborn child. While the exact cause of PPD is unknown, the cause is believed to be a combination of physical, emotional, genetic, and social factors. These may include factors such as hormonal changes and sleep problems. Risk factors include bipolar disorder, a family history of depression, psychological stress, problems during childbirth, lack of support, or a drug use disorder. Diagnosis is based on a person's symptoms. While most women experience a short time of worry or unhappiness after delivery, postpartum depression should be seen when symptoms are severe and last over two weeks. Among those at risk, giving psychosocial support could prevent PPD. This may include community support such as food, household chores, mother care, and friendship. Treatment for PPD may include counseling or medications. Types of counseling have been found to be useful in treating PPD. Postpartum depression affects roughly 8.9-10.1% of women in high income countries and 17.8-19.7% of women in low and middle income countries. Postpartum depression commonly affects mothers who have had experienced stillbirth, live in urban areas, and are single mothers. This mood disorder is seen to affect 1% to 26% of new fathers. == Postpartum psychosis == Postpartum psychosis is a more severe form of postpartum mood disorder and when it has not happened before, about 1 to 2 per 1,000 women develop it following childbirth.https://www.nhs.uk/mental- health/conditions/post-partum-psychosis/ Postpartum psychosis is one of the leading causes of murder of children less than one year of age. It happens in about 8 per 100,000 births in the United States. The risk of developing postpartum psychosis increases in future pregnancies if it has happened before. Mental disorders during pregnancy can impact future pregnancies and the decision-making choices the mother makes. This includes anesthetic use, trying for a vaginal birth, or electing to have a C-section. == Related pages == * Fluoxetine * Postpartum period * Aesop ==References== Category:Depression (mood) Category:mood disorders Category:psychiatry Category:Pregnancy and childbirth",
 "title": "Postpartum depression"
}