{
 "id": "1073106",
 "text": "Hector Pieterson (19 August 1963 - 16 June 1976) was a Black South African activist. He was shot and killed by police firing directly at him. He protested against laws requiring the Afrikaans and English language to be taught in majority-Black primary and secondary schools together with other Black students. He, and other Black students, were reminded of their Dutch colonial oppressors by Afrikaans. Besides, they wanted to learn Xhosa and Zulu like other Black children. His death was recorded by photographer Sam Nzima on 16 June 1976. This image was flashed worldwide and represented the resistance against apartheid. 16 June is now commemorated as Youth Day in South Africa. ==Early life== Hector Pieterson was born on 19 August 1963 in Soweto, South Africa to Vivian Pieterson and Dorothy Molefi. He was the only boy in the family. He had one sister, Lulu Pieterson, and four stepsisters, including Antoinette Sithole and Sina Molefi. ==Soweto Uprising== In 1974, the South African government passed the Afrikaans Medium Decree. This policy forced all Black higher primary and secondary schools in Soweto to use Afrikaans and English for all subjects except music, physical education and religious instruction. They viewed Afrikaans as the language of their racist oppressors. Besides, the students were not fluent in (could not speak or understand) Afrikaans, so their grades dropped significantly. As a result, Sithole, Pieterson and about 20000 other secondary school students decided secretly to revolt against the policy. They wrote slogans, made signboards and sang protest songs. They marched through the streets to Orlando Stadium for a rally. Teachers and parents later joined the revolt. The students sang, waving signboards saying \"Down with Afrikaans\", \"To Hell with Afrikaans\" and \"Viva Azania\". They recited a forbidden poem, Nkosi Sikele iAfrica, which is now South Africa's national anthem. This established the protest as a rebellion and made the police retaliate by taking drastic action. The team was blocked. Stones filled the air. Tear gas burst out. Bullets began to fly. And Pieterson's body lay lifeless on the ground. Mbuyisa Makhubo, a high school graduate, picked up the boy and ran to the nearest clinic. It was too late - Pieterson was already dead before he got there. He, together with Hastings Ndlovu, was the first Black protester shot and killed by the police in the Soweto Uprising. ==Museum and legacy== An image, taken by Sam Nzima, showed Pieterson's dead body carried by Makhubo with sister Sithole nearby. It became the iconic image of the 1976 Soweto Uprising, spreading around the world. His tragic death symbolised the brutality of apartheid, catalysing (speeding up) resistance movements and forging solidarity (stronger bonds) between its members. In 1992, the Hector Pieterson Museum was created to commemorate the fight of Pieterson and other students against the apartheid in South Africa. The museum opened in 2002 and can be found on Khumalo Street in Orlando West. It has a Pieterson memorial and has a garden of remembrance of with the names of all who were killed in the uprising, including Pieterson, written on bricks. ==References== Category:1963 births Category:1976 deaths Category:South African activists Category:Soweto",
 "title": "Hector Pieterson"
}