{
 "id": "107352",
 "text": "The Taung Child is a fossil of a skull that includes an imprint of the brain. It belongs to an Australopithecus africanus and is about 2.5 million years old. == Discovery == The skull was discovered in 1924 by a quarryman working for the Northern Lime Company in Taung, South Africa. Raymond Dart, an anatomist at the University of Witwatersrand, looked at the fossil and saw its importance. Dart published his account in the journal Nature in 1925, describing it as a new species.Dart, Raymond 1925. www.nature.com British anthropologists at the time believed the Piltdown Man was real. This hoax specimen had a large brain and ape-like teeth – the exact opposite of the Taung Child – so Dart's finding was not appreciated for decades.Brain C.K. Raymond Dart and our African origins, in A century of Nature: twenty-one discoveries that changed science and the world. Laura Garwin and Tim Lincoln, eds. ==Description== The fossil consists of most of the skull, face and mandible with teeth. It also has a natural endocast (imprint) of the braincase. The left-hand side of the endocast is covered in beautiful calcium carbonate crystals. Experts think the Taung Child was around three years old at the time of its death. It was 3' 6\" (105 cm) tall and weighted around 20-24 pounds. It had a cranial capacity of 340 cc and lived mainly in a savanna habitat. Experts compared Taung Child to a 9-year-old human child to determine how quickly A. africanus grew to adolescence. Their growth rate is similar to that of modern apes (like chimpanzees) rather than modern Homo sapiens. Later species like Homo ergaster and Homo erectus grew at rates between those of modern humans and apes. The Turkana boy, discovered in 1984, is a main source of evidence. In early 2006, experts announced that the Taung Child was likely killed by an eagle (or similar large predatory bird). They noticed that damage to the Taung Child's skull and eye sockets looked like damage on the skulls of primates known to have been killed by modern eagles. Downloadable 30 minute analysis by the BBC ==Importance== The Taung Child was a very important find in archaeological history. It was the first of a series of fossils found in the 1920s-1930s which showed that humans indeed have a 'natural history' all of their own – just as Darwin had predicted. The skull is now in repository at the University of Witwatersrand. ==References== Category:Biology Category:Fossils Category:Hominins Category:Archaeology Category:Prehistoric Africa",
 "title": "Taung Child"
}