{
 "id": "1073464",
 "text": "Lyle, Lyle, Crocodile is a 2022 American musical comedy movie directed by Will Speck and Josh Gordon. The script was written by William Davies. The movie was licenced and produced by Colombia Pictures. The plot is about a family who moves to New York City, where the son meets a singing crocodile who tries to save the son. It was released on October 7, 2022 in the United States and on April 15, 2023 in China. == Plot == In New York City, a magician named Hector wants to be on a talent show but keeps getting rejected. He finds a singing crocodile named Lyle in a pet store and bets his house on their performance. Sadly, Lyle gets anxiety during the performance, and they lose the house. Hector moves out, leaving Lyle behind. Later, a family named the Primms moves into the house. Their son, Josh, makes friends with Lyle, who saves him from a mugger. The Primms bond with Lyle over shared interests. Hector returns to visit Lyle and tries to make him perform again, but it fails due to anxiety again. The neighbor, Alistair Grumps, is annoyed by the noise from Lyle, Hector, and the Primms. He bribes Hector to betray Lyle, leading to Lyle being locked up in a zoo. Feeling guilty, Hector, with the help from Josh, rescue Lyle. They reconcile with each other, and Lyle performs on a talent show with Josh's help. A trial is later held to decide if Lyle can be free. The judge rules in favor of Lyle, thanks to a deed from Hector's grandmother. The Primms celebrate Lyle's freedom, and Grumps is hinted to be evicted. Hector befriends a beatboxing rattlesnake named Malfoy, owned by Josh's friend Trudy. == Cast == * Winslow Fegley as Josh Primm * Javier Bardem as Hector P. Valenti * Constance Wu as Katie Primm * Scoot McNairy as Joesph Primm * Shawn Mendes as the voice of Lyle * Brett Gelman as Alistair Grumps * Ego Nwodim as Carol * Lyric Hurd as Trudy == References == Category:2022 movies Category:2022 comedy movies Category:2022 fantasy movies",
 "title": "Lyle, Lyle, Crocodile (movie)"
}