{
 "id": "1073638",
 "text": "West Papua is a province of Indonesia. It is on the New Guinea island and has many peninsulas and islands. Manokwari is the main city. Around 561,403 people lived there in mid-2022, making it the second least populous province in Indonesia after Southwest Papua.Badan Pusat Statistik, Jakarta, 2023, Provinsi Papua Barat Dalam Angka 2023 (Katalog-BPS 1102001.92) The Dutch were in New Guinea until 1962. Then, control went to Indonesia. West Papua officially became a province in 1999 and was inaugurated in 2003. Until 2022, it had special status with twelve regencies and one city.Leonard Andaya (1993), p. 155-6. West Papua has a medium Human Development Index, second-lowest in Indonesia. The government is building things like roads and airports. Some worry this might harm rainforests and native cultures. According to Bank Indonesia, West Papua's economy grew by 7.7% in 2018, which is more than the national average. == History == People have lived in West Papua for a very long time, like 42,000 to 48,000 years. The highlands were a center for farming, and they've grown bananas here for 7,000 years. Austronesian people moved here 3,000 years ago. There are over 300 languages in West Papua. A Chinese merchant came around 500 AD and called it Tungki. In 600 AD, the Srivijaya Empire from Sumatra called it Janggi. Traders from Persia and South Asia came in 700 AD and called it Dwi Panta or Samudrananta, meaning 'at the edge of the ocean'. In 1511, a Portuguese sailor called it \"Os Papuas\" or llha de Papo. In 1600, it was called Nueva Guinea by a Spanish explorer.Singh, Bilveer (2008). Papua: Geopolitics and the Quest for Nationhood. Transaction Publishers. p. 15. Kratoska, Paul H. (2001). South East Asia, Colonial History: Imperialism before 1800, Volume 1 de South East Asia, Colonial History. Taylor & Francis. p. 56. In 1606, a Dutch expedition led by Wiliam Jansen landed in Papua. By 1660, the Dutch recognized the Sultan of Tidore's power over New Guinea. During the Indonesian National Awakening, some nationalists were in a camp in Papua. After Indonesia declared independence in 1945, they claimed West Papua.Leonard Andaya (1993), p. 155-6. In 1962, there was an agreement that temporarily gave control to Indonesia. In 1969, there was a vote called the Act of Free Choice. The result made West Papua part of Indonesia, but many disagreed. They formed the Free Papua Movement, and the independence movement continues today.Li-ann Thio (2006), \"International law and secession in the Asia and Pacific regions\", in Marcelo G. Kohen (ed.), Secession: International Law Perspectives, Cambridge University Press In 2022, parts of West Papua became a new province called Southwest Papua. == Demographics == West Papua has different tribes, with 51.48% being native Papuan people. They include Abun, Biak, Borai, and many more. There are two main groups: mountainous or inland Papuans and lowland and coastal Papuans. Many follow traditional Papuan religions, uniting material and spiritual aspects of life. The rest of the population comes from other parts of Indonesia. The people of West Papua follow various religions, with the majority being Protestant Christians (54.17%). There are also Muslims (36.74%), and Catholic Christians (8.71%). Manokwari is known as the \"Gospel City\" due to European missionaries settling there in 1855, celebrated as \"Gospel Day\". In West Papua, many languages are spoken, but Indonesian is the official language, and Papuan Malay is used for trade and inter-ethnic communication. However, local languages are at risk of extinction due to economic, educational, and political challenges. Most transactions in markets use Indonesian, contributing to the decline of regional languages. == References == Category:Provinces of Indonesia Category:Western New Guinea",
 "title": "West Papua (province)"
}