{
 "id": "1073042",
 "text": "South Wales Central Senedd electoral region South Wales Central shown within Wales Created 1999 Current representation Labour 8 MSs Conservative 2 MSs Plaid Cymru 2 MSs Constituencies 1\\. Cardiff Central 2\\. Cardiff North 3\\. Cardiff South and Penarth 4\\. Cardiff West 5\\. Cynon Valley 6\\. Pontypridd 7\\. Rhondda 8\\. Vale of Glamorgan Preserved counties Mid Glamorgan (part) South Glamorgan (part) South Wales Central () is an electoral region of the Senedd. It is the only electoral region in Wales where every Senedd constituency inside it is held by one party. The Labour Party holds every seat in this region. It is the most left-leaning region of Wales, with Labour holding eight list seats (while the Conservatives and Plaid Cymru only hold two each). The region includes most of Cardiff, a traditionally working class area. ==Constituencies== Constituency 2021 result Preserved counties Cardiff Central Jenny Rathbone Labour Entirely within South Glamorgan Cardiff North Julie Morgan Labour Entirely within South Glamorgan Cardiff South and Penarth Vaughan Gething Labour Entirely within South Glamorgan Cardiff West Mark Drakeford Labour Entirely within South Glamorgan Cynon Valley Vikki Howells Labour & Co-operative Entirely within Mid Glamorgan Pontypridd Mick Antoniw Labour Partly Mid Glamorgan, partly South Glamorgan Rhondda Elizabeth Williams Labour Entirely within Mid Glamorgan Vale of Glamorgan Jane Hutt Labour Partly Mid Glamorgan, partly South Glamorgan ==Election results== Party Constituency seats List votes (vote %) D'Hondt entitlement Additional members elected Total members elected Deviation from D'Hondt entitlement 8 102,611 (40%) 6 0 8 +2 0 56,662 (22%) 3 2 2 -1 0 46,478 (18%) 3 2 2 -1 0 14,478 (6%) 0 0 0 0 0 11,821 (5%) 0 0 0 0 0 8,396 (3%) 0 0 0 0 Propel 0 5,552 (2%) 0 0 0 0 0 3,127 (1%) 0 0 0 0 0 2,244 (1%) 0 0 0 0 No More Lockdowns 0 1.298 (1%) 0 0 0 0 Gwlad 0 1,098 (0%) 0 0 0 0 0 602 (0%) 0 0 0 0 Independent (Alan Coulthard) 0 580 (0%) 0 0 0 0 0 519 (0%) 0 0 0 0 Workers Party 0 411 (0%) 0 0 0 0 The following regional MSs were elected in 2021: Party Name Andrew RT Davies Rhys ab Owen Joel James Heledd Fychan ==References== Category:Senedd electoral regions",
 "title": "South Wales Central (Senedd electoral region)"
}