{
 "id": "107376",
 "text": "Dennis Keith Rodman (born May 13, 1961) is an American former professional basketball player. He played basketball in the National Basketball Association (NBA) from 1986 to 2000. He played for the Detroit Pistons, San Antonio Spurs, Chicago Bulls, Los Angeles Lakers, and Dallas Mavericks. He won two championships with the Pistons and three more with the Bulls. Even though he was only 6'7\" tall, many people think he was the best rebounder in NBA history. He led the NBA in rebounding for a record seven straight seasons. Only Wilt Chamberlain led the NBA in rebounding for more total seasons in a career. Rodman has the highest rebound rate since the statistic began in 1970-71. Although Rodman began his career as a bench player, he holds the highest rebounds per game average since offensive and defensive rebounds began in 1973-74. When he became a full-time starter, Rodman often got more rebounds than the other team's starting players got combined. He could predict where missed shots would go and knew how to tip the ball to himself for a rebound. Rodman watched film of player's shots to become a better rebounder. Rodman is also known as one of the greatest defensive players of all time, and not just for his defensive rebounds, but his hustle defense. During his time with the Detroit Pistons, Rodman was considered by many to be the best defensive basketball player in the world (Hakeem Olajuwon was the other main contender for the title), as highlighted by his back-to-back NBA Defensive Player of the Year Awards in 1990 and 1991. Rodman was famous for dyeing his hair different colors and having many tattoos and body piercings, which he began to have after being traded by the Detroit Pistons. He has been in a few movies and television programs. His nicknames are Worm (later called The Worm), Dennis the Menace, D-Rod, Rodzilla (which he named himself towards the end of the Bulls championship dynasty), Demolition Man, and El Loco (given to him by Spanish-language announcers, which translates as \"The Madman\"). Rodman also appeared in World Championship Wrestling (WCW) and was a member of the New World Order (nWo). At Bash at the Beach on July 13, 1997, Rodman made his professional wrestling debut teaming with Hollywood Hogan in a loss to Lex Luger and The Giant. At Bash at the Beach on July 12, 1998, Rodman again teamed with Hollywood Hogan to defeat the team of Diamond Dallas Page and Utah Jazz star Karl Malone. On February 26, 2013, Rodman traveled to North Korea to hold some basketball events. He became the first American to meet North Korean leader Kim Jong Un, later calling Kim \"a friend for life\". After Rodman called for the release of American prisoner Kenneth Bae, Kim released him the next year. ==References== ==Other websites== *Dennis Rodman's official website *NBA.com page Category:1961 births Category:Living people Category:Actors from Dallas Category:Actors from Trenton, New Jersey Category:African-American basketball players Category:African-American television personalities Category:African-American wrestlers Category:American basketball players Category:American movie actors Category:American people convicted of assault Category:Chicago Bulls players Category:Dallas Mavericks players Category:Detroit Pistons players Category:Los Angeles Lakers players Category:Naismith Memorial Basketball Hall of Fame inductees Category:National Basketball Association players with retired numbers Category:Participants in American reality television series Category:People from Trenton, New Jersey Category:Power forwards Category:San Antonio Spurs players Category:Small forwards Category:Sportspeople from Dallas Category:Sportspeople from New Jersey Category:Television personalities from New Jersey",
 "title": "Dennis Rodman"
}