{
 "id": "1073354",
 "text": "The Guardians of the Galaxy Holiday Special is an American web television special written and directed by James Gunn, based on the Marvel Comics superhero team of the same name. The special is a sequel to Guardians of the Galaxy, Guardians of the Galaxy Vol. 2 and Thor: Love and Thunder. It is the second Marvel Studios Special Presentation in the Marvel Cinematic Universe, and the eighteenth and final installment of Phase Four. The special was produced by Marvel Studios and was released on Disney+ on November 25, 2022. == Plot == On Knowhere, Kraglin Obfonteri tells the Guardians of the Galaxy the story of how he and Peter Quill tried to celebrate Earth's Christmas when Quill was still a kid. However, Yondu Udonta got mad and told them to cut it out. Obfonteri says that according to the Multi-Calendar, Christmas is coming but Nebula says that they have too much on their plate after buying Knowhere from the Collector and needing to rebuild it following Thanos' attack. Meanwhile, Quill gets approached by Bzermikitokolok who is researching Christmas and wrote a song about it but he ends up completely mischaracterizing it, to Quill's annoyance. Mantis tells Drax the Destroyer that she wants to do something for Quill for Christmas, due to her secret that she is Ego's child and, therefore, Quill's sister. Thinking about giving him an unforgettable Christmas present, Drax suggests that Quill's hero, Kevin Bacon, would be a perfect option, so they take the Bowie and fly to Earth. Walking throughout Los Angeles, Mantis and Drax get mistaken for cosplayers and earn a lot of money from tourists who wanted to take pictures with them. Looking for Bacon, Mantis and Drax go to a club where they get wasted, before a bystander gives them a star tours booklet with Bacon's home address. They go to Bacon's house and try to take him as a present but Bacon says that he cannot help them. However, Mantis and Drax then break into his house, so a horrified Bacon calls the police and tries to run away. The police arrives but Mantis and Drax incapacitate the officers, before catching up to Bacon. Mantis uses her powers to put Bacon in a trance and convince him to go with them. Back on the Bowie, Mantis and Drax ask Bacon about his adventures that Quill was talking about. However, they realize that Bacon is not a hero, but just an actor. They both get disgusted, believing that actors are horrible people and thinking that Quill's perception of Bacon was warped. Mantis uses her powers to get Bacon to act as an actual hero, so Quill would not be disappointed. With the help of other inhabitants, the Guardians decorate Knowhere for a Christmas party, which amazes Quill but he soon gets horrified when he finds out that his present is Bacon, kidnapped by Mantis and Drax. Quill immediately tells Mantis to get Bacon out of the trance and promises to get him back home, although he still freaks out. Obfonteri then brings Bacon to the Bowie to transport him to Earth and explains that Mantis and the others simply wanted to do something nice for their friend on Christmas, who was always fascinated by Bacon. Bacon then decides to stay on Knowhere for a while and performs a song with Bzermikitokolok and the Knowheremen at the Christmas party, during which the Guardians exchange presents. Quill asks Mantis why would she go to such lengths to make him happy and she tells him about Obfonteri's story how Udonta ruined Christmas for him. Quill then tells Mantis the rest of the story: after calling off the party, Udonta found a toy troll Quill wanted to give him as a present, so Udonta gave him a present as well - his Quad Blasters. Mantis tells Quill that she wanted to do something special for Quill and admits that she is actually his sister. Surprised, Quill tells Mantis that it is the best present he could think of and the two embrace, wishing each other Merry Christmas. Afterwards, Rocket Raccoon and Cosmo decorate Groot like a Christmas tree. However, Groot gets tired and lowers his arms, dropping all decorations. Cosmo says that Groot ruined Christmas again and Rocket remarks that now they \"need another special\". == Cast == * Chris Pratt as Peter Quill/Star-Lord ** Luke Klein as Young Peter Quill (voice) * Dave Bautista as Drax the Destroyer * Karen Gillan as Nebula * Pom Klementieff as Mantis * Vin Diesel as Groot (voice) * Bradley Cooper as Rocket Raccoon (voice) * Sean Gunn as Kraglin Obfonteri / Rocket Raccoon (motion capture) * Rhett Miller as Bzermikitokolok * Murry Hammond as Kortolbookalia * Ken Bethea as Sliyavastojoo * Philip Peeples as Phloko * Michael Rooker as Yondu Udonta (voice) * Kevin Bacon as Himself * Maria Bakalova as Cosmo (voice) * Kyra Sedgwick as Herself (voice) * Si Chen as Sobbing Woman * Don McLeod as Statue Guy * Thomas McNamara as \"Captain America\" * Daniel Bernhardt as Gobot * Michelle Gunn as Tourist Mom * Flula Borg as Bartender * Matthew Withers as Handsome Man * Rusty Schwimmer as Sara * Helene D'Auria as Dispatcher * Tinashe Kajese as Officer Fitzgibbon * Barry Curtis as Officer R. Bobbitt * Rachel Luttrell as Upside-Down Cop * Giovannie Cruz as Orloni Peddler * Stephen Blackehart as Steemie Blueliver * Sarah Alami as Ssssaralami * Terence Rosemore as Xlomo Smeth * Jasmine Sunshine Munoz as Hoobtoe (uncredited) * James Clarke as Kunza (uncredited) * Troy Beecham as Drunk Knowherian (uncredited) Category:American television movies Category:Marvel Studios Special Presentations",
 "title": "The Guardians of the Galaxy Holiday Special"
}