{
 "id": "1073037",
 "text": "South Wales West Senedd electoral region Created 1999 Current representation Labour 7 MSs Plaid Cymru 2 MSs Conservative 2 MSs Constituencies 1\\. Aberavon 2\\. Bridgend 3\\. Gower 4\\. Neath 5\\. Ogmore 6\\. Swansea East 7\\. Swansea West Preserved counties Mid Glamorgan (part) South Glamorgan (part) West Glamorgan South West Wales () is an electoral region of the Senedd. ==Constituencies== ConstituencyBC denotes borough constituency, CC denotes county constituency. Electorate MajorityThe majority is the number of votes the winning candidate receives more than their nearest rival. Member of the Senedd Member of the Senedd Nearest opposition Nearest opposition Preserved counties Aberavon 49,891 6,402 (30.7%) David Rees Victoria Griffiths Entirely within West Glamorgan Bridgend 62,185 5,623 (20.9%) Sarah Murphy Rachel Nugent-Finn Partly Mid Glamorgan, partly South Glamorgan Gower 62,163 1,829 (6.1%) Rebecca Evans Myles Langstone Entirely within West Glamorgan Neath 55,859 2,923 (11.5%) Jeremy Miles Sioned Williams Entirely within West Glamorgan Ogmore 56,661 9,468 (40.5%) Huw Irranca-Davies Luke Fletcher Partly Mid Glamorgan, partly South Glamorgan Swansea East 58,521 7,452 (36.2%) Mike Hedges Rhiannon Barrar Entirely within West Glamorgan Swansea West 56,892 5,080 (22.9%) Julie James Samantha Chohan Entirely within West Glamorgan ==Election results== Party Constituency seats List votes (vote %) D'Hondt entitlement Additional members elected Total members elected Deviation from D'Hondt entitlement 7 78,318 (43%) 6 0 7 +1 0 38,244 (21%) 3 2 2 -1 0 33,753 (19%) 2 2 2 0 0 7,155 (4%) 0 0 0 0 0 6,976 (4%) 0 0 0 0 0 6,010 (3%) 0 0 0 0 0 2,809 (2%) 0 0 0 0 Independent - Jones 0 2,747 (2%) 0 0 0 0 0 1,774 (1%) 0 0 0 0 Propel 0 1,506 (1%) 0 0 0 0 Gwlad 0 1,306 (1%) 0 0 0 0 Freedom Alliance 0 1,271 (1%) 0 0 0 0 0 483 (0%) 0 0 0 0 0 345 (0%) 0 0 0 0 The following regional MSs were elected 2021: Party Name Tom Giffard Sioned Williams Altaf Hussain Luke Fletcher ==References== Category:Senedd electoral regions",
 "title": "South Wales West (Senedd electoral region)"
}