{
 "id": "1073390",
 "text": "Mbuyisa Makhubo is a South African activist. He famously carried the dying body of Hector Pieterson to a hospital after Pieterson was shot in the 1976 Soweto uprising. This was captured for all future generations by journalist Sam Nzima. Makhubo later fled into exile and disappeared. No one knows the truth of what happened to him to this day. Makhubo was 18 years old during the uprising and in a youth wing of the Black Consciousness Movement. This was an organising committee for the protest. He was not protesting at first but he ran to save Pieterson when he heard the gunshots. The photo changed his (Makhubo's) life for the worse. He became a symbol, inspiring others to revolt against the crimes in South Africa. Shortly after, he was abused by apartheid police and accused of shaming the government by carrying Pieterson's body for a picture. Makhubo was eventually forced to go into exile to Botswana first and then to Nigeria. He wrote a few letters to his mother in Nigeria. However, he disappeared in 1979 and his whereabouts remain unknown. In 1978, Makhubo's mother told the Truth and Reconcilation Committee that she had received a letter from him. But she has not heard anything since then. In 2013, it had been claimed that a prisoner in Canada for eight years due to illegal immigration charges, Victor Vinnetou, was actually Makhubo. South African officials have collected his DNA samples to confirm the claim. However, DNA from his father proved it wrong, disappointing the family. However, it was possibly done on a family member who shared no family line with either of his parents, making it a mystery. The network, Eyewitness News, asked a Johannesburg scientist to compare the faces of Vinnetou and Makhubo. He found many similarities between the faces and moderately supported the claim. Meanwhile, the network shared a series of podcasts entitled Through the Cracks which revealed untold details about Makhubo. Mbusiya Makhubo's brother, Raul Makhubo, said that Vinnetou divulged (gave away) information about the landscape in their home. He also knew how everything stood in their yard and their parents' names. Besides, Vinnetou had a moon-like birth mark on the left chest like Mbusiya Makhubo. On 14 June 2014, the Arts and Culture Department verified information on Makhubo's DNA test, with its former minister Paul Mashatile saying that a team had been dispatched (sent) to Canada. However, the same department said five days later that the Canadian Authorities sent DNA samples proven to be inconclusive, and it decided to close the case. In 2020, the city of Johannesburg awarded a blue plaque for Mbuyisa fixed to the Makhubo house at 7485 Litaba Street, Orlando West, South Africa near the Hector Pieterson Museum. This one is part of a series of plaques awarded and unveiled (publicly shown) starting from 2012, to commemorate and honour key sites along the route of the June 1976 Soweto uprising. == References == Category:Possibly living people Category:Anti- apartheid activists Category:1950s births",
 "title": "Mbuyisa Makhubo"
}