{
 "id": "1073945",
 "text": "The Maria Callas Museum is a museum created for the famous Greek soprano Maria Callas. It opened on 26 October 2023, and is located in Athens, Greece. == History == In 2000, the City of Athens bought some of Callas' personal objects, and started a collection about the soprano, with the goal of creating an exhibition for the 2004 Summer Olympics. In 2010, the City bought a three storey building of the interwar period located on 44 Mitropoleos Street, for 7 million euros. Three years later, it was decided that the Callas collection would be moved to that building. The study for the museum made by Erato Koutsoudaki, Andromache Gazi and Alexandros Charkiolakis was first presented in 2014. The Maria Callas Museum opened a decade later, on Thursday, 26 October 2023. The museum's management was given to the managers of the Technopolis of Athens cultural centre, for the years 2023 to 2028. == Collections == The museum has many of Callas' personal objects, costumes for opera and personal haute couture clothes. According to the museum's co- designer, architect and museum specialist Erato Koutsoudaki, the museum's collection is not its greatest element; its exhibitions were based on Callas' personality and they include her singing voice and interviews of hers. === Gallery === File:Maria Callas' opera costumes.jpg|link=https://en.wikipedia.org/wiki/File:Maria_Callas'_opera_costumes.jpg|Maria Callas' costumes for opera File:Maria Callas' sheet music books.jpg|link=https://en.wikipedia.org/wiki/File:Maria_Callas'_sheet_music_books.jpg|Maria Callas' sheet music books File:Maria Callas' 1937 US school memory book.jpg|link=https://en.wikipedia.org/wiki/File:Maria_Callas'_1937_US_school_memory_book.jpg|Maria Callas' school memory book from the year 1937, when her school was the Public School (P.S.) 189 in Manhattan, New York File:Dallas Civic Opera honorary life membership to Maria Callas.jpg|link=https://en.wikipedia.org/wiki/File:Dallas_Civic_Opera_honorary_life_membership_to_Maria_Callas.jpg|Sign with an award from the Dallas Civic Opera (today known as Dallas Opera) to Maria Callas == References == == Other websites == * Official website of the museum Category:Museums in Europe",
 "title": "Maria Callas Museum"
}