{
 "id": "1073440",
 "text": "Vellalar is a group of high-ranking castes in Tamil Nadu, Kerala states in India and in neighboring Sri Lanka; they were the nobility, aristocracy of the ancient Tamil order (Sangam era)Political Change and Agrarian Tradition in South India by T. K. Venkatasubramanian pages 63 to 67: \"They (the Vellalas) formed the nobility or landed aristocracy of the country.\"Ancient Indian History and Civilization By Sailendrda Nath Sen page 205 & 207: \"... the Vellalars were the aristocratic classes and were held in high esteem...\"Meluhha and Agastya: Alpha and Omega of the Indus Script by Iravatham Mahadevan, Indus Research Centre, Roja Muthiah Research Library, Chennai, India, page 16: \"The Ventar - Velir - Vellalar groups constituted the ruling and land-owning classes in the Tamil country since the beginning of recorded history...\" and had close relations with the major royal dynasties.The Tamils Eighteen Hundred Years Ago by V.Kanakasahai page 113: \"The Chera, Chola and Pandyan kings and most of the petty chiefs of Tamilakam belonged to the tribe of Vellâlas.\"Tamil studies: essays on the history of the Tamil people, language, religion and literature By Muttusvami Srinivasa Aiyangar pages 63: \"No traces of the Tamil kings are to be found at present in this country, and it is highly probable that they should have merged in the pure Vellala caste.\"Racial Synthesis in Hindu Culture by S.V. Viswanatha page 156: \"The Tamil kings (...) in spite of their connexion with the ancient velir or vellala tribes...\" Historically, they held various occupational positions from petty kings and aristocrats, governors of provinces, and commanders of armies, to ordinary agricultural landlords and traders Literary, archeological sources trace the origin of the Vellalars to a group of royal house chieftains called Vel or Velir.Encyclopedia of world cultures, Volume 3 by David Levinson page 304:\"There is fairly strong literary and archeological evidence linking core Vellala subcastes with a group of chieftains called Velir,...\"Annual bibliography of Indian archaeology, Volumes 17-20 By Instituut Kern (Rijksuniversiteit te Leiden) page 111: \"... the Irukkuvels are the immediate forefathers of the modern Vellalas.\" People of India: Tamil Nadu By K. S. Singh,R. Thirumalai,S. Monoharan: \"...the Velir, who are identified with Vellalar...\" According to old Hindu, Tamil texts, the Velirs were warriors from the Yadu Kshatriya clan (Chandravanshi lineage);Journal of Kerala studies, Volume 14 By University of Kerala page 6: \"There are several epigraphs of the Ay Vels which attribute a Yadava origin to them.\"The early history of the Vellar Basin, with special reference to the ... By M. Arokiaswami pages 23: \"... reveals another pertinent fact that emphasises the Krishna-Vel relationship.\"Boundary walls: caste and women in a Tamil community By Kamala Ganesh page 50: \"...Irungovel, the Velir chieftain who, according to literature, was a Yadava...\" they came to south from the city of Dvārakā in north India under the leadership of the Vedic sage Agastya.Encyclopedia of Indian Tribes by S.S. Shashi page 216: \"...Sage Agastya repaired to Dwarka and, taking with him eighteen families of Vels or Velirs, moved on to the south...\" Meluhha and Agastya: Alpha and Omega of the Indus Script by Iravatham Mahadevan, Indus Research Centre, Roja Muthiah Research Library, Chennai, India, page 16: \"Agastya agreed and, on his way, visited ‘Tuvarapati’ (Dvaraka) and led eighteen families of the Velir, the descendants of netu- muti-annual (Krishna), to the south,...\"Pivot politics: changing cultural identities in early state formation processes By M. van Bakel page 165: \"Chieftain Irunkovel (a Velir) proudly mentions the forty nine preceding generations of his lineage and their ancestral home at Dvaraka (Puram, 201.10; PPTI 445).\" ==Social status== The Vellalar were considered to be of high status and enjoyed a high rank during the Chola period. They promoted Shaivism during the Chola era and the cult's leaders were drawn from the ranks of the Vellalar. Some sects have built up a position in the religious sphere by being employers of Brahmins and builders of temples for \"high\" gods like Siva and Vishnu. In the Tamil region, Vellalar like Mudaliyar and Pillai along with certain other non-brahmin groups enjoyed a status equal to that of the Brahmins. The Vellalar also had more authority, power, and status than the Brahmins in some social and ritual contexts. They were more orthodox than the Brahmins in their religious practices. The Vellalar nobles had marriage alliances with Chola royal families. In Sri Lankan Hindu society, the Vellalars were landlords and patrons of Hindu temples. They built and managed these temples, and often employed Brahmins for religious duties. The Vellalars typically assert a higher social rank than Brahmins, who accept gifts from them. ==References== Category:Castes in Tamil Nadu Category:Yadav",
 "title": "Vellalar caste"
}