{
 "id": "1073549",
 "text": "Masana Samuel Nzima (8 August 1934 - 12 May 2018) was a South African photographer. He is best known for taking the iconic photograph of Hector Pieterson, Antoinette Sithole and Mbuyisa Makhubo during the 1976 Soweto uprising. However, he only got the rights to the image in 1998 after a long copyright battle. ==Early life== Nzima was born in Lillydale, Bushbuckridge on August 8, 1934 to a farming family. His interest in photography was sparked when he learned to use a camera in school. and his first photos were taken at Kruger National Park for money from visitors. As a teen, his father's boss pressured him to become a farm worker. After nine months, he ran away and became a gardener in Heiningham Johannesburg, where he completed high school. In 1956, Nzima left Heiningham to work at the Savoy Hotel as a waiter. At the Savoy, he met and befriended a man named Patrick Rikotso, another worker there. Rikotso taught him more about photography and Nzima would take domestic workers' portraits, selling them on the workers' day off. After leaving the Savoy, he went to Chelsea Hotel, reading the Rand Daily newspaper. He was transfixed by the stories criticising the apartheid government from late (dead) award-winning journalist Allister Sparks and started sending his own pictures and photo essays to the Black newspaper The World. ==Famous photograph== The World was so impressed by Nzima's work that he was offered a freelance position. In 1968, he was offered a full-time position and accepted it to work for The World in 1976. He turned to the skirmishes (short fights between small groups of people far from the main battlefield) flaring (very violent) and took photos of students holding bin lids as shields and throwing stones at police officers. He also took another photo of a black policeman holding the students at gunpoint during the uprising. His most iconic image was of Makhubo carrying Pieterson with Sithole at the victim's side. Recognising that the photograph would expose apartheid, Nzima hid the film roll in his sock. When other officers found him still taking pictures, they forced him to open up all his cameras. All the films were exposed except for the one containing the famous image and the photos were destroyed. Only the famous image made it back to The World, where it was splashed across the front pages of international newspapers. ==Post journalism== Nzima was later wanted by the apartheid police and accused for portraying South Africa in a bad light. He was forced to flee from Soweto, where his family lived, to his hometown of Lillydale. He opened the Nzima Bottle Store there and was offered several journalist jobs. However, he turned them all down out of fear of being killed by the apartheid police. Soon, a member from the Nelspruit security branch came to Nzima and told him they knew what he had done. He was warned that he was not allowed to leave his home for any reason and that he would be arrested if he did. He was checked every Friday for three months to see if he followed the rules. After his photography career, Nzima continued to serve the people of his hometown. He was a long-serving member of Bushbuckridge municipal council and the Bohabela District council. After years of fighting for the rights to his photograph of Pieterson and Makhubo, he was finally rewarded in 1998 when The Star newspaper gave him copyright. He later taught photography to young students in Bushbuckridge. ==Death and legacy== Nzima died on 12 May 2018 at the age of 83 at Rob Ferreira Hospital in Nelspruit after a short illness. His photo was listed by Time magazine as one of the 100 most influential images of all time. He is the recipient of the highest arts award in Africa, the Order of Ikhamanga. He was awarded the bronze prize for his photojournalism, helping expose apartheid to the rest of the world. The Tshwane University of Technology gave him an honorary doctoral degree in November 2020 and his family is building the Sam Nzima Legacy Centre in his honour. His son, Thulani Nzima, is the president of the Sam Nzima Foundation established in 2015. ==References== Category:Photographers Category:Photojournalists Category:South African anti-apartheid activists Category:1934 births Category:2018 deaths",
 "title": "Sam Nzima"
}