{
 "id": "1073766",
 "text": "The Florida land boom of the 1920s was the first real estate bubble in Florida. It happened between 1924 to 1926. It attracted investors from all over the United States and around the world. It left behind new properties in Florida. Some of these properties were racially segregated for many years. The main cities affected by this economic bubble were Miami Beach, Coral Gables, Hialeah, Miami Springs, Opa-locka, Miami Shores, and Hollywood, Florida. It also left behind failed projects such as Aladdin City, the original plan of Boca Raton, Chevelier, Fulford-by-the-Sea, Interocean City, Isola di Lolando, Okeelanta, Palm Beach Ocean, Poinciana, and Sun City. The economic bubble made new cities. It ended in a financial collapse that ruined many investors and property owners. It made the local economy worse for many years after. ==Background and history== The economic growth in the 1920s, along with a lack of knowledge of weather conditions and bad building standards started it. People outside of the United States pictured Miami as a tropical paradise. More tourists began to visit Miami or immigrate to Miami. By 1925, investors were beginning to read negative articles about Florida investments. Forbes magazine wrote that Florida land prices were based on no real land value.Florida in the 1920s The Internal Revenue Service began to say that the economic bubble was as a big sham operation. In October 1925, the main railroad companies in Florida stopped sending many products to the state.Turner, Gregg (2005). Florida Railroads in the 1920s. Charleston: Arcadia Publishing. Also in 1925, Florida began to pass laws to control real estate. One law was that salespeople had to have licenses and offices. This caused more demand for office spaces. The city's image as a tropical paradise began to crumble. In May 1926, the boom was about to end. The 1926 Miami hurricane ended the boom, and the 1928 Okeechobee hurricane completely stopped it. == References == ==Other websites== * University of South Florida Libraries: Suniland Suniland (published between 1924 and 1926) was distributed across Florida and beyond. The magazine both promoted and documented the land boom in Florida. Category:1920s in Florida Category:Miami",
 "title": "Florida land boom of the 1920s"
}