{
 "id": "1073852",
 "text": "The European Severe Storms Laboratory (ESSL) is a scientific organization that conducts research on severe convective storms, tornadoes, intense precipitation events, and avalanches across Europe and the Mediterranean. It operates the widely cited European Severe Weather Database (ESWD). ESSL is also responsible for leading the creation of the International Fujita scale in 2018 to replace the Fujita scale. == History and purpose of the ESSL == The European Severe Storms Laboratory started as an informal network of European scientists with the goal to advance research on severe convective storms and extreme weather events on a European level. It was initiated in 2002 by Nikolai Dotzek and became a non-profit organization with charitable status in 2006. The ESSL focuses on research questions concerning convective storms and other extreme weather phenomena which can be treated more efficiently on a pan-European scale. It can be seen as roughly the European counterpart to the US's National Severe Storms Laboratory (NSSL). Some members of ESSL participate in the European Storm Forecast Experiment (ESTOFEX) which issues daily forecasts of severe convective storms. It can be seen as the operational counterpart to the US Storm Prediction Center (SPC) akin to ESSL being the research counterpart to NSSL, although both European organizations currently lack the institutional support enjoyed by the US organizations which are government entities.https://www.estofex.org/files/brooksetal_estofex_severe.pdf The purposes of the ESSL are: * to advance research on severe convective storms and extreme weather events on a European level * to operate and extend the European Severe Weather Database (ESWD) * to support or organize the European Conferences on Severe Storms == References == == Other websites == * European Severe Storms Laboratory's website * European Severe Weather Database * European Conference on Severe Storms * TorDACH Category:Scientific organizations",
 "title": "European Severe Storms Laboratory"
}