{
 "id": "1073175",
 "text": "The Hector Pieterson Museum is a museum on 8288 Khumalo Street, Orlando West, South Africa. The museum is named after one of the first deaths, Hector Pieterson. It commemorates all who marched against forced use of Afrikaans, and were shot at, in the 1976 Soweto uprising on 16 June, now known as Youth Day. The memorial and museum officially opened in 2002 to commemorate the 26th anniversary of the uprising. ==Description== ===Outside=== The red brick building is two storeys high and has the Hector Pieterson Memorial on its grounds. ` The memorial showcases Sam Nzima's famous photograph with Mbuyisa Makhubo carrying Pieterson's dead body with sister Antoinette Sithole crying beside him. It is also housed in a circular building that looks like a traditional African hut with a thatched roof. The entrance of the museum is, appropriately enough, marked by a large statue of Pieterson. ===Inside=== Inside the museum are videos and recordings contrasting life in Black-majority Soweto and in White-majority areas. There are also many iconic photographs by Nzima and Dr. Peter Magubane and strategically placed windows showing iconic scenes like the rally at Orlando Stadium. Also featured is the memorial wall, where visitors can leave messages for the heroes of the anti-apartheid resistance who sacrificed their lives for freedom. Another attraction is the garden of remembrance ` \\- a courtyard full of loose bricks with inscribed names. Each is the name of somebody who has died on, or because of, the 1976 Soweto Uprising. Pieterson's sister, Sithole, now works at the museum as a knowledgeable tour guide. ==Public Recognition== On August 8 2022, US Secretary of State Antony Blinken visited the museum. He was accompanied by his tour guide Sithole and said that Pieterson's story was heartbreakingly familiar as the United States faced similar struggles with racial equity to the news media. The museum and memorial have also been included in many Soweto tours and are among South Africa's top tourist attractions. ==References== Category:Museums Category:Soweto",
 "title": "Hector Pieterson Museum"
}