{
 "id": "1073906",
 "text": "Eyestalk ablation is a common practice in shrimp farming. Ablation is a more technical word for removal. With eyestalk ablation, one or both eyestalks are removed from female shrimps. Sometimes the eyestalks are not removed, but they are made unusable. This is done to encourage the crustaceans to develop mature ovaries and lay eggs. In captivity, female shrimps often face challenges in maturing their ovaries. Even when a species can reproduce in captivity, eyestalk ablation boosts egg production and the number of females involved in reproduction. After eyestalk ablation, complete ovarian development can happen in as little as three to ten days, making shrimp farming more reliable. The main idea behind eyestalk ablation is to reduce the inhibitory effect of a hormone called gonad inhibitory hormone (GIH).This hormone is produced in the eyestalk. It is usually present in higher levels during non-breeding seasons, inhibiting ovary development. By removing the eyestalk, the level of GIH decreases, allowing mature ovaries to develop. Another theory suggests that eyestalk ablation affects light perception, influencing ovarian maturation. The exact way eyestack ablation works is not fully understood. Critics argue that eyestalk ablation is harmful to shrimps as it is often done without anesthesia, causing stress due to impaired vision. In some shrimp species, like the tiger prawn, the eyestalks can fully regenerate in less than six months.Desai, U.M.; Achuthankutty, C.T. (2000). \"Complete regeneration of ablated eyestalk in penaeid prawn, Penaeus monodon\" (PDF). Current Science. 79 (11): 1602–1603. There is also a debate about the ways in which crustaceans feel pain. Eyestalk ablation is currently prohibited in Europe for organic production. In 2016, Seajoy, one of the major producers of premium farmed shrimp in Central America, started to farm only ablation-free shrimp. == Effects == Eye ablation in female shrimps has various effects, including: * It makes shrimps lay more eggs but not necessarily larger ones. * The time between moulting cycles becomes shorter. * The mortality rate of shrimps increases up to three times. * The overall health of female shrimps declines. * In some cases, it results in a lower hatching rate of eggs. * The color of ovaries can change. * Shrimps experience higher energy demands. * Over time, the quality of eggs decreases. * Offsprings born this way may be more prone to diseases like WSSV. == Methods == There are different ways to do eyestalk ablation, including: * Pinching the eyestalk halfway to two-thirds down, which might create an open wound. * Slitting one eye with a razor blade, then crushing the eyestalk from halfway to two-thirds down until the eye contents are removed. This method is also known as enucleation and leaves the transparent exoskeleton for quicker healing. * Cauterizing through the eyestalk using an electrocautery device or a red-hot wire, which, if done correctly, closes the wound and helps scar tissue form faster. Another way is to use scissors or a sharp blade to cut the eyestalk and then cauterize the wound. * Tying off the eyestalk tightly with surgical thread, ensuring immediate wound closure. == Alternatives == There are viable alternatives. They include: * Giving high-quality, nutritious food in the pre-maturation stage. * Changing the sex ratio in breeding tanks from 1:1 to 1:2 (male-to- female). Non-ablated females have lower mortality rates and produce more robust offspring; this reduces the need for chemicals and antibiotics. ==References== Category:Aquaculture",
 "title": "Eyestalk ablation"
}