{
 "id": "1073221",
 "text": "The Jill Stein 2024 presidential campaign is the ongoing campaign of Jill Stein for President of the United States in the upcoming 2024 United States presidential election. She is currently seeking the nomination of the Green Party in the 2024 Green Party presidential primaries. Stein was previously the nominee of the Green Party in the 2012 United States presidential election and the 2016 United States presidential election, in the latter of which she gained the most popular votes of any Green Party presidential nominee ever. Stein announced her campaign via X (formerly Twitter) on November 9, 2023. She has painted herself as an alternative to the \"failed two-party system\" and has has called for an end to the 2023 Israel–Hamas war, criticizing Joe Biden for supporting Israel. Some political analysts believed that Stein could have served as a spoiler for the Biden reelection campaign, pulling Gen Z votes away from Biden. This belief was furthered by the Green Party gaining ballot access in the swing state of Arizona. Since Joe Biden's withdrawal from the race, this view has shifted to Stein being a spoiler for the Kamala Harris campaign. On August 16, 2024, Jill Stein announced Butch Ware as her running mate. == Developments == === Arrest in St. Louis === On the aftternoon of April 27, 2024, Stein attended a pro-Palestine university campus protest at Washington University in St. Louis in Missouri. She reportedly attempted to de-escalate the situation between protesters and the police, which led to the police physically attacking her with a bicycle. Stein and 80-100 others were arrested by the police. Stein was booked at the St. Louis County Jail at 7:26 p.m. and charged with assault. She was released at 1:30 a.m. on the morning of April 28. == Polling == On January 10, 2024, a poll from Quinnipiac University showed Jill Stein winning 4% in the swing state of Pennsylvania. As of July 2024, RealClearPolitics has Jill Stein's polling average in a five-way race with Donald Trump, Kamala Harris, Robert F. Kennedy Jr., herself, and Cornel West at 1.1%. All of the aggregated polls have Stein at 1%, with the exception of Quinnipiac, which places her at 2%. In a five-way race with Joe Biden as the Democratic nominee instead of Harris, RealClearPolitics aggregates Stein at 1.9%. Kamala Harris vs. Donald Trump vs. Robert F. Kennedy Jr. vs. Cornel West vs. Jill Stein Poll source Date Sample size Margin of error Kamala Harris Donald Trump Robert F. Kennedy Jr. Cornel West Jill Stein Wall Street Journal July 23–25, 2024 1,000 (RV) ± 3.1% 45% 44% 4% 1% 1% NY Times/Siena July 22–24, 2024 1,142 (LV) ± 3.3% 44% 43% 5% 0% 1% Rasmussen Reports July 22–24, 2024 1,074 (LV) ± 3.0% 42% 49% 4% 0% 1% Forbes/HarrisX July 22–25, 2024 3,013 (RV) ± 1.8% 44% 44% 10% 1% 1% Economist/YouGov July 21–23, 2024 1,435 (RV) ± 3.1% 41% 44% 5% 1% 1% == References == Stein, Jill",
 "title": "Jill Stein 2024 presidential campaign"
}