{
 "id": "1074535",
 "text": "Hykeem Jamaal Carter Jr. (born October 22, 2000), his stage name being Baby Keem, is an American rapper and record producer. He was raised in Las Vegas, and was noticed in the late 2010s with his help to Black Panther: The Album, Redemption, Crash Talk, and The Lion King: The Gift. He was first noticed in 2019 through his sleeper hit single \"Orange Soda\". After he signed a deal with PGLang and Columbia Records in 2020, he released his first studio album The Melodic Blue (2021), which was very successful. It was certified platinum by the Recording Industry Association of America (RIAA), and its final single, \"Family Ties\", won the Grammy Award for Best Rap Performance. His help with Kanye West on Donda (2021) and his cousin Kendrick Lamar on Mr. Morale & the Big Steppers (2022) earned him two chances for the Grammy Award for Album of the Year. == Early life == Hykeem Jamaal Carter Jr. was born on October 22, 2000, in Carson, California. His mother had problems with drug abuse and alcoholism, while his father, Hykeem Carter Sr., was not in his life. Carter was raised in Las Vegas, Nevada by his grandmother until he was eight years old, and he thinks of her to be his second mother. A lot of his childhood was spent in music studios as he watched his aunts and uncles put music onto CDs using LimeWire. He also had problems with eviction and needed food stamps. Carter was raised around a musically skilled family, where all of his uncles and cousins were rappers. His older cousins include rapper Kendrick Lamar and basketball player Nick Young. He may also share some relatives with rapper Tanna Leone. He was always interested in rapping, but was not confident with his high-pitched voice and chose to wait until it was developed. When he was thirteen, Carter began producing music using Apple software on his computer. At fifteen, he borrowed $300 from his grandmother and bought a small recording setup for his bedroom on Craigslist. He soon moved to Los Angeles to go into a musical job. Carter disliked his \"boring\", \"dry\", and \"small\" hometown where \"everybody knows everybody\", and gave credit to its old music scene as a big factor in his decision to move. He used to post and livestream Minecraft and FIFA gameplay on YouTube and Twitch. == Career == === 2014–2018: Career beginnings === Carter made his first song, \"Come Thru\", during his freshman year of high school. It was removed from the Internet and he hopes \"nobody will ever find it.\" His first extended play (EP), Oct, was independently released under his real name on November 7, 2017, but was removed from major streaming services a bit after its release. RapTV said that the 9-track EP showed traces of Carter's future musical style by \"featuring a mix of bouncy, hard beats and slower, emotional cuts.\" He released his second EP, Midnight, on January 16, 2018. It showed the same production as Oct, but RapTV said that Carter's lines were \"more confident and loud.\" In an interview with Complex, he said that Midnight did not have any big artistic way, and described the project as \"just nine songs in my stash that I liked and put out.\" After he emailed a sample of his production to an independent record label, called Top Dawg Entertainment, Carter helped the soundtrack album for the superhero film Black Panther (2018) as a producer. During the summer, he released two EPs, No Name and Hearts and Darts, and produced two songs on Jay Rock's third album Redemption. He considers Hearts and Darts, which was his first project under his stage name Baby Keem, to have the style that Midnight did not have. In October 2018, he released his first mixtape, The Sound of Bad Habit, through the Orchard and Sony Music. The mixtape was produced by Cardo. === 2019–2020: Die for My Bitch and breakthrough === Keem produced two songs on Schoolboy Q's fifth album, Crash Talk (2019). On July 19, 2019, he produced a song for singer Beyoncé's soundtrack album The Lion King: The Gift and released his second mixtape, Die for My Bitch. The alternative hip hop mixtape had strong pop-punk and alternative rock pieces, and was given big news attention. Its lead single, \"Orange Soda\", became a sleeper hit and helped Keem make his first songs on the Billboard 200, Billboard Hot 100 and Emerging Artists charts. He helped the mixtape with his first concert tour, the Die for My Bitch Tour, which visited some places across the U.S. from November 12 to November 20, 2019. Keem's partnership with creative services company pgLang, founded by Kendrick Lamar and filmmaker Dave Free, was announced through his appearance in the company's visual mission statement on March 5, 2020. He was included on XXLs yearly Freshman Class list in August. After signing a recording contract with Columbia Records, Keem released the single album \"Hooligan / Sons & Critics\" on September 18, 2020; with Sons & Critics confirming his relation to Lamar after rumors began to emerge. === 2021–present: The Melodic Blue === Keem was put on Kanye West's song \"Praise God\" with Travis Scott for Kanye's tenth album, Donda (2021). The Melodic Blue, his first studio album, was released on September 10, 2021. He co- produced 14 of the album's 16 standard songs. It was given positive reviews from music critics, with praise towards its bold nature and Keem's growing potential, but criticism towards its \"half-baked\" production. The album started at number five on the Billboard 200, becoming Keem's first top-10 album in the U.S. Two of the album's four singles, \"Durag Activity\" with Travis Scott and \"Family Ties\" with Kendrick Lamar, had good success. Keem went on the Melodic Blue Tour, which visited cities in North America and Europe from November 2021 to July 2022, and appeared on The Tonight Show Starring Jimmy Fallon to help sell The Melodic Blue. A B-side to the album was released on September 22, 2021, while the deluxe edition was released on October 28, 2022. == Inspirations == One of Keem's favorite artists and big musical inspirations is Kid Cudi. He was very inspired by his changes of his voice and emotional connection, mostly on the single \"Immortal\" (2013). As a child, Keem remembered listening to Kanye West's 808s & Heartbreak (2008) during a snow day in Las Vegas and being inspired by the album's cinematic quality. He has said that he will \"never say anything ill (bad)\" about West, and gives him credit for consistently changing music genre boundaries. Keem self-identifies as part of the Mike Will Made It and Metro Boomin generation of record producers, and has inspiration from both artists. ==Discography== * The Melodic Blue (2021) == Filmography == Film Year Title Role Notes 2022 Kendrick Lamar Live: The Big Steppers Tour Himself 2023 The Melodic Blue Short film; also executive producer IMBD https://www.imdb.com/title/tt30225786 ==Tours== Headlining * Die For My Bitch Tour (2019) * The Melodic Blue Tour (2021–2022) Supporting * Kendrick Lamar – The Big Steppers Tour (2022) ==Awards and nominations== Award Year Category Nominee(s) Result BET Awards 2022 Best New Artist Himself Video of the Year \"Family Ties\" Best Collaboration Billboard Music Awards 2022 Top Gospel Song \"Praise God\" Top Christian Song Grammy Awards 2022 Best New Artist Himself Album of the Year Donda Best Rap Performance \"Family Ties\" Best Rap Song 2023 Album of the Year Mr. Morale & the Big Steppers 2024 Best Rap Performance \"The Hillbillies\" NME Awards 2022 Best Collaboration \"Family Ties\" XXL Awards 2022 Song of the Year Video of the Year == References == Category:American hip hop musicians Category:Living people Category:2000 births",
 "title": "Baby Keem"
}