{
 "id": "1074589",
 "text": "Cabinets of curiosities, also known as wonder-rooms, were collections of different objects in Renaissance Europe. These collections, starting in the 16th century, had no specific categories. They covered natural history, geology, art, and more. They were well-known before modern museums, showing the interests of their owners. The word \"cabinet\" first meant furniture, not room. Objects in these cabinets could be natural specimens and artworks. Besides rulers' and aristocrats' collections, even the merchant (trader) class and early scientists made similar collections. They were like the origins of museums. These cabinets showed the curator's interests and their social status. There were two main types: princely cabinets for representation and aesthetic (beauty) appeal, and more modest (medium-sized) collections for practical (useful) and scientific purposes. They also were entertainment, which is shown by the Royal Society's early meetings. Although educational, these exhibitions' purpose was to combine learning with entertainment. == History == === To c. 1600 === The earliest known natural history cabinet is shown in Ferrante Imperato's Dell'Historia Naturale (Naples 1599). It showed preserved fishes, stuffed mammals, shells, and more. === 17th century === Special cabinets belonged to Ole Worm and Athanasius Kircher. These cabinets had preserved animals, minerals, and mythical (fictional) creatures. Worm's catalog, Museum Wormianum (1655), gave information to science. === 18th century and after === In the 18th century, Belsazar Hacquet's natural history cabinet became famous. \"Green Vaults\" in Dresden showed Augustus the Strong's wonders. The \"Enlightenment Gallery\" at the British Museum had a goal to recreate the diversity of mid-18th-century museums. === United States === In the U.S., Thomas Dent Mutter's collection focused on medical curiousities. P. T. Barnum's American Museum and the Hobby Club in New York continued the tradition of showing curiosities. === Declining influence === By the early 18th century, curiosities started to lose importance as Enlightenment thinkers focused on nature's patterns. Curiosities were seen as exceptions, not divine messages, and were less studied. Category:Museums",
 "title": "Cabinet of curiosities"
}