{
 "id": "1074528",
 "text": "Nanba Shrine (難波神社) is a Shinto Shrine in Osaka. It worships Emperor Nintoku. It was made by Nintoku's son Emperor Hanzei. In Ancient Japan the capital city was wherever the emperor liked most. Nintoku had his capital in Osaka. The first theater for Bunraku puppet shows was built at the shrine. It has a summer festival that starts on July 20th and lasts two days. It is called Himuro Matsuri and during the festival crushed ice is given to worshippers. It is believed that those who eat it will be protected from summer heat. Some people think it was the Soja shrine of Settsu Province. Soja shrines are shrines where all the kami of a province can be worshipped at once. == History == The shrine was built in 415, during the reign of the 18th emperor, Hanzei, in the ancient capital of Matsubara in Osaka Prefecture. On New Year's Day 1071, Emperor Go-Sanjo visited the shrine on his way to the Sumiyoshi-taisha, and he determined that, in addition to Nintoku, Susa-no-O (素盞嗚) and the female deity Uka-no-mi-tama (倉稲魂), for the treatment of illnesses. Later, at the same time as Toyotomi Hideyoshi was building Osaka Castle, Namba-jinja was moved to its current location. In the Edo Period a small Inari shrine on the grounds called Bakurocho-no-Oinari-san was more famous than this one. The Torii and surrounding walls of the place of worship were destroyed during the Pacific War on 14 March 1945 . They were rebuilt in reinforced concrete in 1974. ==Gallery== File:Namba Shinto Shrine in 201411.JPG|alt=|View of the shrine from the street File:Nanba Shrine1.jpg|alt=|Entrance Torii File:Namba Shinto Shrine at Night in 201412.JPG|alt=|Entrance Torii at night File:Futon daiko.jpg|alt=|Traditional Futon Daiko procession File:Nanba Shrine Bakurou Shrine.jpg|alt=|A small Inari shrine at Nanba Shrine. It used to be more famous than this one. File:Nanba Shrine honsha.jpg|alt=|Main building of Nanba Shrine File:Nanba Shrine Juyonbashiraaidono Shrine.jpg|alt=|A small subshrine File:Nanba Shrine kotohira Shrine.jpg|alt=|A small Kotohira Shrine at Nanba Shrine File:Nanba-jinjya Kusunoki.jpg|alt=|Kusunoki tree File:Naniwa-Schrein 1.jpg|alt=|Honden of the Shrine File:Nanba Shrine Roof from below.jpg|alt=|Roof of the Shrine File:Emblem on the door of Nanba shrine.jpg|alt=|Emblem on the door of the shrine File:Matsumoto Kiyoshi Senba Shinsaibashi.jpg|alt=|Shop across the street from Nanba Shrine == Related pages == * == References == Category:Gion shrines Category:Soja shrines Category:Ken-sha Category:Osaka Category:Shinto shrines in Osaka Prefecture Category:Shinto shrines",
 "title": "Nanba Shrine"
}