{
 "id": "1074008",
 "text": "Madison Elle Beer (born March 5, 1999)My precious baby turns 21 today – Twitter is an American singer and songwriter. In 2018, Beer released \"Dead\" and \"Home with You\". Both certified Gold by the RIAA. The next year, Beer signed with Epic Records and released her debut album, Life Support in 2021. The album got popular on TikTok and was certified Gold by the RIAA. Beer's second album, Silence Between Songs, was released in September 2023. The album has been nominated for ‘Best Immersive Album’ at the Grammy Awards. == Early life == Madison Elle Beer was born in Jericho, New York, to a Jewish family on March 5, 1999. == Discography == Studio albums *Life Support (2021) *Silence Between Songs (2023) == Tours == Headlining * As She Pleases Tour (2018) * The Life Support Tour (2021–2022) * The Spinnin Tour (2024) == Filmography == === As actress/personality === Year Title Role Notes 2013 Louder Than Words Amy Film 2015 Todrick Wendy Episode: \"Peter Perry\" 2016 Hollywood Medium With Tyler Henry Herself Guest appearance 2019 Ridiculousness 2020 RuPaul's Secret Celebrity Drag Race Herself Episode 4; contestant Coral Fixation RuPaul's Drag Race All Stars Guest judge Episode: \"I'm In Love!\" 2023 Good Mythical Morning Guest Episode: \"Will it Cannoli\" === As a performer === Year Title Song(s) Album/Format 2015 AAKD Live Melodies Single 2017 PNC Live Studio Dead, Toxic (Britney Spears Cover) As She Pleases In the Zone (Britney Spears) 2018 Maybelline Urban Catwalk Show Home With You As She Pleases 2018 World Championship Pop/Stars Single Super girl Surf Pro Concert Series Songs from As She Pleases As She Pleases Serramonte Centre Mall Performance IHeart Radio (Just Show Up Show) Miami Y100 Jingle Ball Dead, Creep (Radiohead cover), Hurts Like Hell As She Pleases Pablo Honey (Radiohead) Single IHeart Radio Tyler Durden As She Pleases Lollapalooza Fools KDWB 101.3 Hurts Like Hell Single 2019 Vevo Hurts Like Hell, Tyler Durden Single As She Pleases BottleRock Napa Dead, Fools, Creep, Hurts Like Hell As She Pleases Pablo Honey (Radiohead) Single Beale Street Music Festival in Memphis Hurts Like Hell, All Day & Night Single Snacks (Jax Jones) ACL Festival Teenager in Love As She Pleases Wango Tango Home With You, Fools, Creep, Heartless, Blue As She Pleases Pablo Honey (Radiohead) Life Support 92 Pro-FM Dead, Hurts Like Hell As She Pleases Single 2020 Live with Kelly and Ryan Selfish Life Support MTV Europe Music Awards Baby Genius (Home Performance) Vevo Lift Boyshit, Selfish NHL (National Anthem) National Anthem 2021 Jimmy Kimmel Live! Boyshit Life Support Genius Open Mic Reckless Silence Between Songs Life Support Live in Concert Songs from Life Support Life Support The Ellen DeGeneres Show All I Have to Do Is Dream (The Everly Brothers Cover) Single Blue Life Support Vevo Reckless, Sour Times Silence Between Songs Life Support MTV France (MTV Push) Selfish, Sour Times Life Support 2022 WeHo OutLoud Pride Festival Good in Goodbye, Selfish, Baby, Creep, Boyshit, Dear Society Life Support Pablo Honey Reading & Leeds Festival Baby, Good in Goodbye, Emotional Bruises, Selfish, Dangerous, All Day & Night, Boyshit Life Support Snacks Genius (Open Mic) Showed Me (How I Fell in Love With You) Silence Between Songs AMFAR Gala Event 2023 Jimmy Kimmel Live! Sweet Relief Good Morning America Home To Another One, Reckless, Selfish Silence Between Songs Life Support Forbes Reckless, Showed Me (How I Fell in Love With You), Selfish BBC Radio 1 Live Lounge Spinnin’, Glimpse of Us (Joji cover) Silence Between Songs SMITHEREENS (Joji) Genius (Open Mic) King Of Everything Silence Between Songs Vevo Envy The Leaves Ryder Sweet Relief == Bibliography == * The Half of It (2023) == Awards and nominations == Year Award Nominee Category Result Ref. 2019 Game Audio Network Guild Awards \"Pop/Stars\" Best Original Song 11th Shorty Awards Best in Games Teen Choice Awards Herself Choice Female Web Star 2021 MTV Europe Music Awards Herself Best Push Act MTV Video Music Awards \"Selfish” Push Performance of the Year Game Audio Network Guild Awards \"More” Best Original Song 13th Shorty Awards Best in Games Best in Videos 25th Webby Awards Video – Music (Branded) 2024 Grammy Awards Silence Between Songs Best Immersive Audio Album == References == == Other websites== * * Category:Singer-songwriters from New York (state) Category:1999 births Category:Living people Category:People from Jericho, New York",
 "title": "Madison Beer"
}