{
 "id": "1074527",
 "text": "Nanba Shrine (難波八阪神社) is a Shinto Shrine in Osaka. It is a shrine for Gion worship dedicated to Susanoo-no-Mikoto. It has a large lion-shaped building which is famous in Japan. ==History== There is no longer any exact data as to the date of the first construction of this place of worship, but it is mentioned for the first time in the Annals of the Year 1069. Because of Bombing of Osaka, it burned to the ground in 1945. Its reconstruction and its current form date from may 1974.. The deity Gozu Tenno (god of protection against epidemics) is honored in this temple.K. Imai, « Fierce lion head stage emerges as main attraction in Osaka shrine » , The Asahi Shimbun, 15 novembre 2018. == Special features == In the central square of the temple there is a stage building 12 meters high, 11 meters wide and 10 meters deep, made of stone, in the shape of a lion's head. It is likely that the lion motif was influenced by the style of temples in Taiwan . K. Imai, « Fierce lion head stage emerges as main attraction in Osaka shrine » , The Asahi Shimbun, 15 novembre 2018. Every third Sunday in January, a rite inspired by Japanese mythology is performed there. It tells the story of Susanoo, the god of Wind and Sea, and the dragon Yamata-no-Orochi . In 2001, this ritual was officially recognized as an element of the intangible heritage of the city of Osaka.. ==Gallery== File:Nanba yasaka shrine exterior.jpg|View of the complex from outside File:Namba-yasaka-jinja Torii entrance.jpg|Entrance to the shrine File:Nanba yasaka shrine 02.JPG|Look at the mouth from afar File:Tabemas.jpg|Side view of the head File:Interior of the Lion's Head Theater at Namba Yasaka Jinja, Osaka.jpg|Inside the Lion's Head Theater at Namba Yasaka Jinja File:Roof of the Haiden at Namba Yasaka Jinja in Osaka.jpg|View of the roof File:Komainu at the Namba Yasaka Jinja.jpg|A Komainu guarding Namba Yasaka Jinja File:Chōzuya at Namba-Yasaka-Jinja, Osaka.jpg|Chōzuya File:Lanterns on the Haiden at Namba Yasaka Jinja, Osaka.jpg|Lanterns at the Haiden File:Namba-yasaka-jinja sasayama jinja.jpg|A subshrine File:Namba-yasaka-jinja two subshrines.jpg|Two subshrines File:Namba-yasaka-jinja Torii to subshrine.jpg|Torii of a subshrine File:Namba-yasaka-jinja stele.jpg|Stone carving File:Omikuji at Namba Yasaka Jinja, Osaka closeup.jpg|Omikuji == Related pages == * Nanba Shrine == References == Category:Gion shrines Category:Osaka Category:Shinto shrines in Osaka Prefecture Category:Gō-sha Category:Shinto shrines",
 "title": "Nanba Yasaka Shrine"
}