{
 "id": "1074813",
 "text": "Hay´at Tahrir al-Sham (HTS; Arabic: هيئة تحرير الشام) translating to “The Organization for the Liberation of the Levant”, is a Sunni Islamist armed group and political organization in Syria. It was formed on January 28th 2017 in Idlib as Jabhat Fateh al-Sham and merged with several other groups such as Harakat Nour al-Din al-Zinki, Liwa al-Haq, Jaysh al-Sunna, and Jabhat Ansar al-Din, establishing Hay’at Tahrir al-Sham under one body. HTS commands around 16,000 fighters. In December 2024, HTS led a coalition including Ahrar al- Sham, the National Front for Liberation, the Free Syrian Army, the Syrian National Army (SNA) and Nour al-Din al-Zenki putting an end to the Assad Regime. They set up a transitional government, led by Ahmed al-Shaara. It has since expanded its control to most of Greater Idlib, Aleppo, Hama, Homs and Damascus. == Historical Context == Ahmed al-Sharaa was originally part of Al- Qaeda in Iraq. In 2012, he was the former leader of Jabhat al-Nusra, and became the leader of HTS in 2017. HTS emerged as one of the most powerful armed factions during the Syrian civil war. Their affiliation with other terrorist groups made them known for their effectiveness in battle and for brutal acts. Jabhat al-Nusra (which HTS was part of) played a key role in major offensives against the Assad regime, especially in northwestern Syria, and was involved in the seizure of territory, including parts of Aleppo and later Idlib. The group became known for its bombings, its use of suicide attacks, and its efforts to dominate rival opposition factions through force. In 2016, the group rebranded as Jabhat Fatah al-Sham in an attempt to cut formal ties with al-Qaeda and present itself as a more locally focused Syrian movement, distancing itself from the global jihadist image that had made it a target of Western powers. This shift was strategic, aimed at consolidating local support, reducing international pressure, and gaining legitimacy among other rebel groups and the civilian population. The rebranding lead up to the formation of HTS in 2017, a merger of Jabhat Fatah al-Sham with several smaller Islamist groups. == Leadership and Structure == HTS is led by Ahmed Hussein al-Sharaa, also known as Abu Mohammad al-Julani, which is his fighter name. He is HTS´s founder and Syria's current political leader. Before joining HTS he was part of Jabhat al-Nusra and also had ties with al-Qaeda, but he denies any ideological affiliation. Abdul-Rahim Attoun (Abu Abdullah al-Shami) is HTS´s chief religious figure and plays a critical role in the group’s ideological direction and political strategy. His influence was a key factor in HTS shift from an al-Qaeda affiliate into a local-focused actor embedded in a nationalist movement. Overtime, HTS underwent several internal transformations distancing itself from its transnational jihadist roots to focus on local governance. This shift was exemplified by the establishment of the Syrian Salvation Government (SSG) in Idlib in 2017. With its own ministries and departments, the civilian technocratic administrative body oversees governance in HTS controlled areas. Structurally, HTS is divided into military and administrative arms, while the military and intelligence branches are firmly under HTS´s control. Their governance model, although conservative, is not extremist. HTS Islamist governance emphasizes the application of Sharia law but claims to not enforce radical interpretations. In efforts to portray a more inclusive image HTS states to protect rights of non-Muslim citizens and religious minorities. == Relations with Internal and External Actors == As Syria’s current government, al-Sharaa’s administration has maintained complex relationships with both domestic and international actors, with its policies viewed as either progressive or regressive depending on the context. One major turning point in these relations occurred in 2017, when HTS bombed Damascus which killed mainly Iraqi Shia Muslims. Since then, many nations have categorized HTS as a terrorist group. Most countries do not recognize or support HTS, such as the United States, European Union, United Kingdom. The United Nations (UN) also categorized HTS as a terrorist group in 2018 in a key Security Council resolution. Meanwhile, regional actors have continued to affirm their influence over Syria’s complex political and military landscape. Turkey, seeing an opportunity to expand its influence, backed the Syrian National Army (SNA) and continued its military operations against the Kurdish- led Syrian Democratic Forces (SDF), while offering to train Syria’s future armed forces. Israel intensified its presence by occupying areas in southern Syria, including the United Nations (UN) buffer zone and Mount Hermon. They justify their actions as a security measure and as targeted strikes on sites previously used for chemical weapons by the Assad regime. For Iran and Hezbollah, Assad’s fall marked a significant setback. It broke a key link in Iran’s regional “axis of resistance” and reduced its power in the Levant. Russia, having provided Assad asylum, appeared to reduce its military role, although HTS indicated some openness to allowing Russia to retain bases, if it served Syria’s interests. Against the landscape of changing alliances and ongoing instability, humanitarian concerns remain urgent. In a statement published in November 29, 2024, Al-Sharaa urged that soldiers refrain from violence, and to respect the diversity of sects and cultures in Syria. However, as recently as March 2025, the UN has reported targeted attacks and killings of Alawites (the minority that was protected under Assad regime). This includes children and women in the coast of Syria, where most of them reside. The humanitarian crisis remains an issue in Syria; people need food, clean water, healthcare, and safe places to live. Hospitals and clinics are damaged or closed, and there are not enough doctors or medical care. HTS is seeking increased support, but many areas still suffer because of the war and past government actions. Marking a notable political shift, HTS cooperates with the SDF under a March 2025 agreement, integrating SDF into national institutions. This marks a major shift from past conflict and suggests HTS is working with some parts of the broader opposition, especially against common threats like ISIS. However, HTS continues to clash with Turkey-backed SNA forces, particularly because of ongoing Turkish-SDF tensions. Turkey worked with HTS to keep stability in Idlib and provided help through aid and security arrangements . In return, HTS allowed Turkish troops to watch over ceasefire zones and stop the spread of violence. HTS received mixed international responses. Saudi Arabia welcomed Al-Sharaa on February 2025 to discuss bilateral relations. Other countries like the U.S. and some in Europe have started talking with HTS, showing they may be open to working with the group if it becomes more moderate. == Current Status and Developments == On the 8th of December 2024 the Assad government was removed by a group of rebel forces led by Hay ’at Tahrir al-Sham. Factors that influenced the collapse of the dictatorship were the Turkish support for the rebels, Russia’s attention shift to the war in Ukraine and Israeli attacks weakening Iran and Hezbollah. After these events HTS set up a transitional government and dissolved the Syrian parliament, which was dominated by the Baathist party. In January 2025 it named Ahmed al-Shaara as its interim President. Key demands are a new Syrian constitution, the integration of non-state armed groups into Syria's official forces, including the SDF and reunifying of Syrian territories and administrative bodies under centralized state control. However HTS faces major challenges. First, there is a lack of international and national credibility and a global reluctance to engage with an HTS-led government. Secondly, Syria is still divided. Other powerful groups, like the Kurdish-led SDF and Turkish- backed rebel forces, reject HTS control over Syria. Thirdly, after years of civil war and sanctions, it has led to the economy being damaged. The future of HTS´s government therefore remains uncertain as it struggles to gain legitimacy, rebuild a fractured nation, and navigate regional and international dynamics. ==References== Category:2017 establishments in Asia Category:Islamic terrorism Category:Sunni organizations Category:Islamist militant groups",
 "title": "Hay´at Tahrir al-Sham"
}