{
 "id": "1074130",
 "text": "Incarceration in the United States is one of the basic ways of punishment for crimes committed in the United States of America. In 2023, more than five million people were being supervised by the criminal justice system. Almost two million people were in state or federal prisons and in local jails. The United States has the largest known population of prisoners in the world.Highest to Lowest. World Prison Brief (WPB). Use the dropdown menu to choose lists of countries by region or the whole world. Use the menu to select highest-to-lowest lists of prison population totals, prison population rates, percentage of pre-trial detainees/remand imprisoned people, percentage of imprisoned females, percentage of imprisoned foreign people, and occupancy rate. Column headings in WPB tables can be clicked to reorder columns lowest to highest, or alphabetically. For detailed information for each country click on any country name in lists. See also the WPB main data page and click on the map links and/or the sidebar links to get to the region and country desired. The number of prisoners grew rapidly after the 1970s, but began decreased from 2009 on, having been reduced by 25% by the end of 2021. == Imprisonment rates == Since reaching its peak number of imprisonments in 2009, the U.S. had an average imprisonment rate of 2.3% per year. This rate includes the sudden 14.1% drop in 2020, due to the COVID-19 pandemic. The states of Connecticut, New Jersey, and New York have reduced the numbers of prisoners by over 50% since reaching their peak levels. Twenty-five states have also reduced imprisonments by 25% since reaching their peaks. The federal prison population was reduced 27% in relation to its 2011 peak. == Cause of imprisonment == 1 in 5 people in U.S. prisons had committed crimes related to illegal drugs. More than 3 in 5 people (62%) had committed violent crimes and were being kept in state prisons. 1 in 7 people (14%) kept in state prisons had committed crimes related to property (trespassing, stealing, robbing, etc). === Debtor's prisons === Although debtor's prisons no longer exist in the United States, residents of some U.S. states can still be imprisoned for debt .Knafo, Saki (February 12, 2014). The U.S. Is Locking People Up For Being Poor. The Huffington Post. Retrieved February 12, 2014. The Vera Institute of Justice reported in 2015 that the majority of those imprisoned in local and county jails are there for unimportant violations and have been jailed for more time over the past 30 years, because they are unable to pay costs related to the court procedures.Timothy Williams (February 11, 2015). Jails Have Become Warehouses for the Poor, Ill and Addicted, a Report Says. The New York Times. Retrieved February 11, 2015. == Costs == The United States has more prisoners than most developed countries. According to the World Prison Brief, on May 7, 2023, the United States had the sixth highest imprisonment rate in the world, at 531 people per 100,000. Costs related to prison, parole, and probation procedures have a yearly cost of around $81 billion. Court costs, bail bond fees, and prison phone fees added another $38 billion in yearly costs. == References == == More reading == === Books === * Alexander, Michelle (2012). The New Jim Crow: Mass Incarceration in the Age of Colorblindness. The New Press. * * Davis, Angela (2003). Are Prisons Obsolete?. Seven Stories Press. * Enns, Peter K. (2016). Incarceration Nation: How the United States Became the Most Punitive Democracy in the World. Cambridge University Press. * Gottschalk, Marie (2014). Caught: The Prison State and the Lockdown of American Politics. Princeton University Press. Book Hardcover , eBook . * Harcourt, Bernard (2012). The Illusion of Free Markets: Punishment and the Myth of Natural Order. Harvard University Press. * Hinton, Elizabeth (2016). From the War on Poverty to the War on Crime: The Making of Mass Incarceration in America . Harvard University Press. * Murakawa, Naomi (2014). The First Civil Right: How Liberals Built Prison America. Oxford University Press. * * Selman, Donna and Paul Leighton (2010). Punishment for Sale: Private Prisons, Big Business, and the Incarceration Binge. Rowman & Littlefield Publishers. * Taibbi, Matt (2014). The Divide: American Injustice in the Age of the Wealth Gap. Spiegel & Grau. * Wacquant, Loïc (2009). Prisons of Poverty . University of Minnesota Press. * Wacquant, Loïc (2009). Punishing the Poor: The Neoliberal Government of Social Insecurity. Duke University Press. * Wang, Jackie. (2018). Carceral Capitalism. Semiotext(e). * Western, Bruce (2007). Punishment and Inequality in America. Russell Sage Foundation. === Articles and interviews === * The Prison State of America (2014-12-28), Chris Hedges, Truthdig * How Prisons Rip Off and Exploit the Incarcerated, Part I (2015-01-04) and Part II (2015-01-07), Marshall \"Eddie\" Conway and Chris Hedges, The Real News * Do Prisons and Mass Incarceration Keep Us Safe? Part I (2015-01-11) and Part II (2015-01-13), Marshall \"Eddie\" Conway and Maya Schenwar, author of Locked Down and Locked Out. The Real News. See also Tomgram: Maya Schenwar, Prison by Any Other Name (2015-01-18), TomDispatch * \"Carceral Conglomerate\" Makes Millions From Incarcerated, Their Friends and Families (February 2015), James Kilgore and Brian Dolinar, Truthout * Prison Industries: \"Don't Let Society Improve or We Lose Business\" (April 2012), Dina Rasor, Truthout * Immigrants mistreated in 'inhumane' private prisons, finds report. Al Jazeera America. June 10, 2014. * Locked Up for Being Poor: How private debt collectors contribute to a cycle of jail, unemployment, and poverty. The Atlantic. February 25, 2015. * Why does the US imprison so many people? Al Jazeera America. May 14, 2015. * Cruel and All-Too-Usual. The Huffington Post. July 1, 2015. * Big business built the prison state. Why should we trust them to tear it down? The Guardian. July 17, 2015. * SpearIt, Economic Interest Convergence in Downsizing Imprisonment (2014). University of Pittsburgh Law Review, Vol. 25, 2014. Available at SSRN: Economic Interest Convergence in Downsizing Imprisonment * \"My Four Months as a Private Prison Guard\": Shane Bauer Goes Undercover to Expose Conditions. Democracy Now! June 27, 2016. * Inside America's biggest prison strike: 'The 13th amendment didn't end slavery'. The Guardian. October 22, 2016. * 5 facts behind America's high incarceration rate \"CNN\"'Drew Kann' July 10, 2018 * Category:Law enforcement agencies of the United States Category:Imprisonment and detention",
 "title": "Incarceration in the United States"
}