{
 "id": "1074167",
 "text": "The Bharwad are a Hindu caste found in the state of Gujarat in India, primarily engaged in herding livestock. == History == According to Sudipta Mitra, historians believe the Bharwards arrived in northern Gujarat in the 10th century, fleeing the Muslim invasions of Sindh. They then spread out throughout Saurashtra. === Origin myths === According to their origin myth, the goddess Parvati fashioned animals and four men from the sweat and bodily dirt from Shiva's meditation, which Shiva then gave life to. Shamal was the rudest of the four, and he became a camel herder and progenitor of the Rabari camel herders. The better mannered Bharvad received sheep and goats. The handsome and best-mannered Charan became guardian of Nandi and ancestor of cattle herders. Finally, Ahir received land. The four men then married four apsara sisters. In another origin myth, Krishna burned three rolls of dirt on a fire, which he then shaped into Gowals (to watch over his cattle). Krishna had many wives, but due his generosity he gave away all but three of them. He wanted to give his last three wives to the Gowals, but they regarded Krishna as their father and would not accept wives from him. Later Krishna ordered the Gowals to watch over the cattle, but they complained that they would not work until they had wives. Thus Krishna took them to a temple, where he set two of them back-to-back and ordered them to circumambulate the temple in opposite directions. When they met on the other side, one of them had turned into a woman. Krishna order the two to be married, but the third Gowal complained that he was yet to have a wife. Krishna told him the creation of the world was already complete, and that he should share his older brothers wife. Westphal- Hellbusch and Westphal state that historically the Bharvads practiced polyandry, and in modern times the younger brother marries his older brother's widow. The Bharwads consider themselves as the descendants of Nanda, the foster father of Krishna. The Bharvads claim they used to live in Gokul with Krishna. Once, Kans ordered the weather deities to destroy Gokul. To protect the inhabitants and animals, Krishna created another Gokul on his pinky finger to shelter them. However, Kans captured all the Bharvad shepherds. Krishna then created another set of Bharvads and animals, which became known as Motabhai (big brother), while the Bharvads who had been released by Kans became known as Nanabhai. The mother of the Motabhais did not want to recognize the Nanbhais as Bharvads, and it was only at Krishna's request that they were reaccepted into the community. In another version, the Bharvads enter a cave with their cows, which was actually a giant serpent owned by Brahma. Inside the cave was a duplicate universe, so the Bharvads never realized anything was amiss and did not leave. Krishna then created a new set of Bharvads to replace the ones who were lost. When Brahma released the trapped original Bharvads from his serpent, they became known as Nanabhai, while the ones created by Krishna became the Motabhai. In east and southeast Gujarat, where all pastoralists are Bharvads regardless of animals, a different story is held. Those Bharvads claim they, Gopalaks, were created by Shiva from the sacred fire, and that they lived with Krishna. When Krishna fled Mathura, the Gopalaks set out to find him. Where a river split into four tributaries, the Gopalaks split into four. One stream went to Marwar, one to Saurashtra, another to Gujarat, and another to South India. According to Barot Shamalji of Porbandar, Radha had 9 brothers known as the nine Nandas. The Bharvads originated from the fourth brother, Bhuravananda. Out of his two sons, one married a Raja woman, whose descendants are the Motabhais, while the other married an Adivasi woman, who descendants are the Nanabhais. == Divisions == Various reasons are given for the division between Motabhai and Nanabhai, the most popular is that two shepherd brothers were ordered by Krishna to take their flocks to different places. The older of the brothers went on to marry a Bharwad woman while the other married a Koli woman. Since the latter was a marriage outside the community, the offspring were deemed to be ritually polluted. Thus the Motabhai (literally, \"big brother\") descend from the first and the Nanabhai (\"little brother\") from the latter. == Varna and socio-economic status == The Bharwads are said to have a mixed-varna origins, from a Vaishya father and Shudra mother. Mitra notes that they are generally considered to be among the lowest of the pastoral castes, being engaged primarily in the herding of goats and sheep. However, although one of the Maldhari nomadic communities, they are also among the most urbanised of the region and, combined with their niche position in the supply of milk, which forms their main source of income, this has enabled them to improve their traditional social position. === Family arrangements === There is anecdotal evidence that pet chandla (marriage of children while they are still in the womb) is practised by some members of the community. In other cases, a sagai (engagement) ceremony takes place when children are aged 2–3, with the marriage age usually being between 18 and 20 for women and 20-22 for men. == Occupations == Bharwads are rarely educated beyond primary level and literacy rates are poor. Many of them live in and around the Gir Forest National Park, where they tend to keep away from the forest itself when grazing their livestock due to the danger of attacks by Asiatic lions. Aside from their involvement with livestock, the main source of income is agricultural labouring; few of them own land. ==Classification== Bharwads are classified in Gujarat as Other Backward Class, except in the Nesses of the forests of Alech, Barada and Gir where they are Scheduled Tribes. ==Notes== == References == ==Bibliography== * * * Category:Social groups of Gujarat Category:Castes",
 "title": "Bharwad"
}