{
 "id": "1074654",
 "text": "King County Stadium (known better as the Kingdome) was a multi-use stadium located in Seattle, Washington. The arena used to serve as the home for the Seattle Seahawks of the National Football League (NFL), the Seattle Sounders of the North American Soccer League (NASL), the Seattle Mariners of Major League Baseball (MLB), and the Seattle SuperSonics of the National Basketball Association (NBA). The Seattle Pilots of Major League Baseball (MLB) began playing in 1969 at Sick's Stadium. MLB did not think that Sick's Stadium was a proper stadium for a major-league team and when they gave them the team, they said that the team must build a new stadium by 1970. The arena was approved by King County voters with $40 million in bonds and 62% voting in favor on February 13, 1968. The Pilots would not be able to survive until the stadium was built. They were forced to declare bankruptcy and were moved to Milwaukee to become the Milwaukee Brewers. They first started to build the stadium in November 2, 1972. The groundbreaking ceremony was met with protestors who threw mud at people. They were angry that the stadium was being built near the International District. The city of Seattle was awarded a professional football team by the National Football League (NFL) on December 5, 1974. The team would go to be named the Seattle Seahawks. The arena was opened on March 27, 1976 and the opening ceremony had an attendance of 54,000 people. The first sporting event to take place in the Kingdome was a exhibition North American Soccer League game between the Seattle Sounders and the New York Cosmos. 58,120 people attended the game, which set a North American record for a soccer game. The first concert in the stadium was by Paul McCartney and Wings on June 10. On August 1, 1976, the Seahawks would play their first preseason game against the San Francisco 49ers in a 27–20 loss. The NFL would hold the Pro Bowl at the Kingdome the next season. After the lawsuit by Seattle against the MLB for the departure of the Pilots was dropped, the city was awarded an MLB team. The team would be known as the Seattle Mariners. On April 6, 1977, the Mariners would play their first game in a 7–0 loss to the California Angels. On July 17, 1979, the Kingdome hosted the All-Star Game. When their contract for the Seattle Center Coliseum expired, the Seattle SuperSonics of the National Basketball Association (NBA) moved into the stadium. The SuperSonics would have a successful year in their first year at the stadium. They were able to finish with a record of 52-30, had the #1 seed in the NBA playoffs and were able to win the 1979 NBA Championship after defeating the Washington Bullets 4 games to 1. This was the first championship won in the stadium and also the only championship in SuperSonics history. On April 7, 1985, the SuperSonics would play their final game in the stadium in a 125–110 loss to the Phoenix Suns. However, it was not the end of basketball in the stadium as the NBA would host the 1987 All-Star Game there. The National Collegiate Athletic Association (NCAA) would also host the 1984, 1989, and 1995 Final Four tournaments at the Kingdome. On June 27, 1999, the Mariners would play their last game at the Kingdome. They defeated the Texas Rangers 5–2 in front of a sellout crowd of 56,000 fans. Ken Griffey Jr. hit the last ever homerun in the stadium. They would move to Safeco Field. Seahawks owner Ken Behring wanted to move the team to Southern California but the NFL would block the move and would fine Behring $900,000 for every day that the Seahawks were in Anaheim. The team would be bought by Microsoft co-founder Paul Allen in 1997. He would keep the team in Seattle. On June 17, 1997, a measurement was passed which would fund the building of a new stadium. On January 9, 2000, the final event took place at the stadium. The Seahawks would lose to the Miami Dolphins in the AFC Wild Card game. On March 26, 2000, the Kingdome was demolished with an implosion. It wasn't until March 2015, 15 years after the implosion, that the debt for the stadium was finally retired. ==References== ==Other websites== * Category:1976 establishments in the United States Category:2000 disestablishments in the United States Category:2000s disestablishments in Washington (state) Category:Buildings and structures in Seattle Category:Seattle Mariners Category:Seattle Seahawks",
 "title": "Kingdome"
}