{
 "id": "1075251",
 "text": "Buffalo Memorial Auditorium (also known as The Aud) was a multi-use stadium located in Buffalo, New York. The arena used to serve as the home for the Buffalo Sabres of the National Hockey League (NHL) and the Buffalo Braves of the National Basketball Association (NBA). It was also home to the Canisius Golden Griffins men's basketball team, the Buffalo Bisons of the American Hockey League (AHL), the Buffalo Bisons of the National Basketball League (NBL), the Buffalo Bandits of the Major Indoor Lacrosse League (MILL), and the Buffalo Blizzard of the National Professional Soccer League (NPSL). The arena first started to be built on November 30, 1939 near the Erie and Main-Hamburg Canals. Construction for the building cost $2.7 million and the opening ceremony was held on October 14, 1940. It was opened by Buffalo mayor Thomas L. Holling and over 3,000 attended. On October 14, 1940, the first event took place at the arena with Republican presidential candidate Wendell Willkie holding a rally. Throughout its history, the arena hosted other Rally's as well. With a rally by Ike Eisenhower on October 23, 1952 and John F. Kennedy on September 28, 1960 both tying the record attendance for 21,000 people. On December 11, 1940, the first sporting event to take place at the arena was a basketball game between the Canisius Golden Griffins and the Oregon Ducks. The Ducks would defeat the Golden Griffins 50-42. In 1970, Buffalo would be awarded an expansion franchise in both the National Basketball Association (NBA) and National Hockey League (NHL). The teams would be called the Buffalo Braves and Buffalo Sabres respectively. On October 14, the Braves would play their first game at the Aud. They played against the Cleveland Cavaliers and lost 107–92. The next day on October 15, the Sabres would play their first game at the Aud. They played against the Montreal Canadiens and lost 3–0. On April 8, 1978, the Braves played their final game at the Aud. They would lose to the New York Knicks 118–107. On April 14, 1996, the Sabres played their final game at the Aud. They would defeat the Hartford Whalers 4–1 but missed the playoffs. On September 21, 1996, the Marine Midland Arena was opened and replaced the Buffalo Memorial Auditorium as the home arena for the Sabres, Bandits and Blizzard. On June 30, 2009, an event called the \"Farewell Buffalo Memorial Auditorium Ceremony\" took place. The arena was demolished in 2009. ==References== Category:1940 establishments in the United States Category:1996 disestablishments in the United States Category:1940s establishments in New York (state) Category:1990s disestablishments in New York (state) Category:Buildings and structures in New York (state) Category:Buffalo Sabres Category:Sports buildings in New York (state)",
 "title": "Buffalo Memorial Auditorium"
}