{
 "id": "1075177",
 "text": "Sheyene Gerardi Foundation is an American non-profit organization founded by Sheyene Gerardi, in 2007, originally in Venezuela but re-organized in New York.https://www.charitiesnys.com/RegistrySearch/show_details.jsp?id={0039AB7A-0000-CE1A-97BA- ADE43FE4D0EC} Based at 276 Fifth Avenue, New York City, the SGF is dedicated to harnessing the potential of emerging technologies like AI and space exploration to address global challenges. Through research, education, and outreach initiatives, SGF fosters ethical and equitable solutions in areas such as economic development, environmental sustainability, and social justice. ==Agenda== The organization is nonpartisan, but works cooperatively with other organizations from the highest level of government to local communities. In 2022, the foundation expanded its activities to include support for policy, economic development, civil rights, and the environment, among other areas. In an oral presentation on 12 Dec 2023 the Sheyene Gerardi said: *My motivations to be here today are driven by two compelling forces: the immense potential of AI and the urgent need for ethical and fair distribution. In the same way, space exploration offers great potential for economic growth; we can create industries in space, harnessing resources and developing technologies that benefit humanity. I believe these intersecting fields hold the key to solving most of the global challenges we face, from economic inequality to resource scarcity.https://www.miamidade.gov/global/webcasting/home.page As of Jan 2024, the foundation is organized into four program areas under president Sheyene Gerardi, who sets strategic priorities, monitors results, and facilitates relationships with key partners. * Research and Development Divisionhttps://arpa-e- foa.energy.gov/TeamingPartners.aspx?foaid=6bc02dc0-751d-45b4-a58b-218fc9aadec8https://arpa- e- foa.energy.gov/TeamingPartners.aspx?foaid=6bc02dc0-751d-45b4-a58b-218fc9aadec8 * Social Impact and Governance Division * Outreach & Education Division * Mission Operations Manager Division In addition to her management positions at the firm, Ms. Gerardi herself led lobbying and public relation efforts for the organization. === Program areas and initiatives === Education The Sheyene School founded originally in Venezuela, is dedicated to enhance technological literacy in STEM related fields, by using robotics, to low-income children in underdeveloped regions, since 2007.https://www.youtube.com/watch?v=WEMq2spgNSg&list;=PLR4XZBSYHTzTb4xte227Oi_jvsH237ILm&index;=42 The institution teaches students software programming and other technology courses into low-resource communities or conflict areas, such as rural schools, refugee camps, non-formal school systems, prison systems providing assistance with education to facilitate the process to reentering society, to people who have been wrongfully convicted. In 2018, it partnered with NASA to bring robotics competitions to South America, reaching communities across South America, the Middle East, and Europe. The program serves underprivileged students and helps them obtain employment. There are no fees to participate. Food program Launched in 2021, SGF's food program delivers emergency food assistance to vulnerable communities facing pandemic, environmental, or humanitarian crises. CEO Program The SGF Commonwealth Enrichment and Outreach (CEO) Program, established in 2022, fosters financial security through entrepreneurial support initiatives. Telemedicine Since 2016, SGF's telemedicine program has provided crucial support to individuals suffering from rare diseases; the program offers the option to participate in clinical trials, by connecting research, doctors and patients. It was created after she became a survivor of an unclassifiable splenic small B-Cell non-Hodgkin lymphoma, a rare cancer. http://aplus.com/t/sheyene+gerardi ==Partner institutions== SGF actively collaborates with governments, think-tanks, educational institutions, corporations, and tech companies in over a dozen countries. It holds UN accreditation and participates in prominent international organizations such as IPSA, APSA, IEEE, ICJ, UNESCO, ILO, WIPO group. In 2018, Sheyene Gerardi partnered with NASA Kennedy Space Center, it enjoys an extensive level of cooperation in matters of ICT accessibility with key United States Specialized Agencies such as NASA, NNSA, DOE, DOD; research and Training Institutes such as Oak Ridge National Laboratory, ORNL Quantum computing Institute, the five Science National Quantum Information Science Research Centers (NQISRCs) and SSERVI. Partner institutions: * ORNL * NQISRCs * SSERVI * ARPA-E * NASA Kennedy Space Center ==Funding== All operations are financially supported by Sheyene´s Family office. According to its annual report in 2023, the foundation explains that it works in conjunction with other entities. One, the Sheyene Institute (“research center”), it conducts scientific research in-house, supporting the foundation in the creation of it assets. The other, the Sheyene Gerardi Family Office (“trust”), serves as the private investment vehicle for the Foundation. ==References== ==Other websites== * * * * * * * * * * * * Category:Non-profit organizations of the United States Category:Non-profit organizations of New York (state) Category:Organizations based in New York City Category:International organizations Category:Human rights organizations in the United States Category:International scientific organizations",
 "title": "Sheyene Gerardi Foundation"
}