{
 "id": "1075257",
 "text": "Otto II, Duke of Brunswick-Lüneburg ( – 10 April 1330), also known as Otto the Strict (Otto der Strenge),Some sources: Otto the Severe or Otto the Strong. came from the House of Guelph and was Prince of Lüneburg from 1277 to 1330. ==Biography== Otto was born at about 1266, he was the son of John, Duke of Brunswick-Lüneburg (died 1277) and Duchess Liutgard of Holstein. As he was only () 11, Otto was very young when his father. But he was the heir of the duchy, so, the administration of the duchy firstly went to his uncle Duke Albert (died 1279). After Albert died, it went to his other uncle, Conrad I, Prince-bishop of Verden. From 1282, Conrad ended being \"regent\" and Otto ruled in his own right. His rule was marked by several arguments, financed by pledges (Verpfändungen), involving border and property disputes with his neighbours. Otto restricted the rights of the knights and protected public order. The settlements of Harburg, Dahlenburg (1289) and Celle (1292) were given town rights. In 1302 he bought the County of Wölpe for 6,500 silver marks. Following the publicly disagreeing election of the king in 1313, Otto connected up with his brother-in-law, Louis of Bavaria, from whom he was enfeoffed with an imperial fiefdom (an estate of land, especially one held on condition of feudal service) in 1315. On 28 November 1315 Otto passed a law of succession that granted the duchy after him to his two sons, Otto and William, jointly. Otto died on 10 April 1330. He was buried at St Michael's in Celle, the monastery that he had built. ===Issue=== Otto married Matilda of Bavaria, daughter Louis the Strict. They had the following children: # Name Name Birth / Death Birth / Death Notes Notes Notes Notes Website Full name Title Birth Death 1 John None Unknown 1324 Apostolic administrator of the Archdiocese of Bremen Wikipedia:Otto the Strict 2 Otto III Duke of Brunswick-Lüneburg Prince of Lüneburg 19 August 1352 Duke of Brunswick-Lüneburg and Prince of Lüneburg from 1330 until his death in 1352 with his brother William 3 Louis See Notes Unknown 1346 Bishop of Minden from 1324 to 1346 4 William II Duke of Brunswick-Lüneburg Prince of Lüneburg c. about 1300 1369 Duke of Brunswick-Lüneburg and Prince of Lüneburg from 1330 until his death in 1369 with his brother Otto (until 1352) 5 Matilda \"None\" Unknown 1316 Married after 1308 Nicholas II, Lord of Werle . ==References== Category:1260s births Category:1330 deaths Category:German dukes and duchesses Category:Princes of Lüneburg",
 "title": "Otto the Strict"
}