{
 "id": "1075025",
 "text": "Barton Street Arena (also called the Hamilton Forum) was a sports arena located in Hamilton, Ontario. The arena used to serve as the home for the Hamilton Tigers of the National Hockey League (NHL). The arena also hosted the Hamilton Tigers of the Canadian Professional Hockey League (CPHL), the Hamilton Tiger Cubs of the Ontario Hockey Association (OHA), the Hamilton Red Wings of the Ontario Hockey Association (OHA), and the Hamilton Fincups of the Ontario Major Junior Hockey League (OMJHL). At the end of the 1919-1920 NHL season, the Quebec Bulldogs would be bought by the Abso Pure Ice Company and they would move the team to Hamilton. Percy Thompson would become the owner of the team. Thompson was also the owner of Barton Street Arena. The first NHL game at the arena took place on December 22, 1920. The Hamilton Tigers would defeat the Montreal Canadiens 5—0. During their first four seasons, the Tigers would miss the playoffs. They would finally make the playoffs during the 1924-25 NHL season. They earned a first round bye. However, before playoff hockey could be played at Barton Street Arena, the Tigers players would go on strike. They gave an ultimatum to their general manager Percy Thompson, demanding that he pay $200 for the six extra games that they played of they wouldn't play in the playoffs. He refused and they played didn't play. This was the first players strike in the National Hockey League. NHL president Frank Calder told the players they would be suspended and the team would be replaced in the playoffs. The players were suspended, fined and the team was replaced by the Ottawa Senators. This would end up being the Tigers final season in the NHL. On April 17, 1925, \"Big Bill\" Dwyer and New York were awarded an NHL expansion team. The team would be known as the New York Americans. Dwyer wanted players from the Tigers and their contracts were bought for $75,000. This marked the end of the Hamilton Tigers. The arena was demolished in 1977 after the city said it would be cheaper rather than replacing the ice-making equipment. Residential building sit on the arena's old site. The arena would be replaced by Copps Coliseum. ==References== Category:1910s establishments in Canada Category:1977 disestablishments Category:Buildings and structures in Ontario",
 "title": "Barton Street Arena"
}