{
 "id": "107522",
 "text": "Steven Vincent Buscemi (born December 13, 1957) is an American actor, director, producer, writer and former firefighter. He is best known for his roles as Mr. Pink in Reservoir Dogs, Carl Showalter in Fargo, and Seymour in Ghost World. With a long career, he has worked in several movies and television shows like The Sopranos and The Simpsons. He was married to Jo Andres from 1987 until her death in 2019. They have a son, Lucian Buscemi. ==Filmography== Year Title Role Notes 1986 Parting Glances Nick 1987 Kiss Daddy Goodnight Johnny 1988 Call Me Switchblade 1989 Slaves of New York Wilfredo Mystery Train Charlie the Barber Lonesome Dove Luke Television Series New York Stories 1990 Tales from the Darkside: The Movie Bellingham (Segment \"Lot 249\") King of New York Test Tube Miller's Crossing Mink 1991 Barton Fink Chet 1992 In the Soup Aldolpho Rollo Reservoir Dogs Mr. Pink CrissCross Drug Dealer 1993 Twenty Bucks Frank Rising Sun Willy 'the Weasel' Wilhelm The Adventures of Pete & Pete Television Series Ed And His Dead Mother Ed Chilton 1994 The Search for One-eye Jimmy Ed Hoyt The Hudsucker Proxy Beatnik Barman at Ann's 440 Airheads Rex Pulp Fiction Buddy Holly impersonator 1995 Billy Madison Danny McGrath Uncredited Living in Oblivion Nick Reve Things to Do in Denver When You're Dead Mister Shhh Desperado Buscemi 1996 Fargo Carl Showalter Escape from L.A. Map to the Stars Eddie Trees Lounge Tommy Writer, Director 1997 Con Air Garland 'The Marietta Mangler' Greene 1998 The Big Lebowski Theodore Donald 'Donny' Kerabatsos Divine Trash Himself The Impostors Happy Franks The Wedding Singer David 'Dave' Veltri Uncredited Armageddon Rockhound 1999 Big Daddy Homeless Guy 2000 28 Days Cornell Shaw Animal Factory A.R. Hosspack Director 2001 Ghost World Seymour Final Fantasy: The Spirits Within Officer Neil Voice The Grey Zone 'Hesch' Abramowics Love in the Time of Money Martin Kunkle Domestic Disturbance Ray Coleman Monsters, Inc. Randall Boggs Voice 2002 Mr. Deeds Crazy Eyes 13 Moons Bananas The Clown The Laramie Project Doc O'Conner Spy Kids 2: Island of Lost Dreams Romero 2003 Spy Kids 3-D: Game Over Romero Coffee and Cigarettes Waiter (Segment \"Twins\") Big Fish Norther Winslow 2002-2006 The Sopranos Tony Blundetto \\ Man Television Series 2004 Home on the Range Wesley Voice 2005 Lonesome Jim Director The Island McCord 2006 Art School Confidential Broadway Bob D'Annunzio Uncredited Monster House Nebbercracker Voice Charlotte's Web Templeton the Rat Voice Dust to Dust: The Health Effects of 9/11 Narrator Television 2007 I Think I Love My Wife George Paris, je t'aime The tourist (segment 'Tuileries') Interview Pierre Peters Director I Now Pronounce You Chuck and Larry Clinton Fitzer The Simpsons Dwight Television Series, Voice Delirious Les Galantine Romance & Cigarettes Angelo 30 Rock Private Eye Television Series 2008 Igor Scamper Voice John Rabe Dr. Robert Wilson Keep Coming Back 2009 G-Force Bucky the Hamster Voice 2012 Hotel Transylvania Wayne the Werewolf Voice 2013 Monsters University Randall Boggs Voice 2015 Hotel Transylvania 2 Wayne the Werewolf Voice 2018 Hotel Transylvania 3: Summer Vacation Wayne the Werewolf Voice ==References== ==Other websites== * The Illustrious Steve Buscemi * Steve Buscemi: IndieKing * Category:1957 births Category:Living people Category:Actors from Brooklyn Category:American movie actors Category:American television actors Category:American television directors Category:American voice actors Category:Emmy Award winning actors Category:Golden Globe Award winning actors Category:Movie directors from New York City Category:Movie producers from New York City Category:Screenwriters from New York City",
 "title": "Steve Buscemi"
}