{
 "id": "1075769",
 "text": "South Africa v. Israel is a lawsuit filed by Republic of South Africa against Israel at the International Court of Justice (ICJ) in The Hague, Netherlands on 29 December 2023. The lawsuit asks the court in principle to provide a provisional measure of protection for the Palestinians who are, according to South Africa, going through a Genocide. The lawsuit filed by South Africa asserts that Israel has committed, and is committing, genocidal acts and genocide against Palestinians in the Gaza Strip in violation of the Genocide Convention. The Foreign Ministry of Israel said through diplomatic channels that a ruling against Israel \"could have significant potential implications not only in the legal realm but also in practical, bilateral, economic, and security-related aspects.\" == Historical relations between South Africa and the PLO == As a result of British occupation and domination in both South Africa (in the form of colonization) and Palestine (as a mandate), now both countries and their liberation movements have formed strong ties. Although, historically it has not always been like this. With the establishment of apartheid in South Africa and the creation of Israel in 1948, the countries' relationship strenghten and they supported each other due to having similar political and cutural systems (zionist settlers occupying Palestinian land and the British marginalizing African indigenous people). Also, in Palestine the British refrained from intervene, although having the control of the mandate. At the same time, they were governing South Africa and marginalizing indigenous people. Nonetheless, since the fall of the apartheid, South Africa has changed its position and now condemns Israel and the ongoing genocide. ==Proceedings== On December 29, 2023, legal actions began at the International Court of Justice on the basis of Genocide Convention. Both Israel and South Africa had agreed to this convention. The proceedings were started under Article IX of the convention. The two day hearing of South Africa's case against Israel happened on 11 and 12 January 2024 in which South Africa spoke and gave evidence of its claims on 11 January while Israel justified or tried to prove South Africa's claims as 'baseless' on 12 January. The outcomes of the hearing were that, although the court ordered Israel to take all the possible measures to avoid the violation of the 1948 Genocide Convention, it did not order the suspension of all the military activities of the Israeli army. The legal submission by South Africa accuses Israel of genocidal actions with clear intent, including mass killings, destruction of homes, expulsion, and displacement of Palestinians in Gaza Strip. The blockade on essential resources like food, water, and medical aid is also highlighted as contributing to the alleged genocidal intent. South Africa also stated that statements made by Israeli officials, such as Prime Minister Benjamin Netanyahu, are evidence of Israel's genocidal intent. In those genocidal intents, South Africa included things said by Israeli officiers and civilians, and United Nations' experts. Following ICJ regulations, the evidence submitted by Israel and South Africa is not available to the general public. On 31 of January 2025, nine states from the global south founded the Hague Group, an organization created to protect and support the rulings of the International Court of Justice (ICJ) and the International Criminal Court (ICC) in relation to the Israeli–Palestinian conflict. Later, more states joined the coalition. ===First ruling=== On 26 January 2024, the International Court of Justice said that South Africa's claims seem possible, and the court will look into the issue. The court decided for now that the proof South Africa gave was enough to show there might be a risk to some of the rights that South Africa is trying to protect. But, the court also said it didn't decide yet whether Israel had broken the Geneva convention. The court stated, in paragraphs 30 and 54 of the ruling, as follows: > 30\\. ... In the Court’s view, at least some of the acts and omissions > alleged by South Africa to have been committed by Israel in Gaza appear to > be capable of falling within the provisions of the Convention. > 54\\. In the Court’s view, the facts and circumstances mentioned above are > sufficient to conclude that at least some of the rights claimed by South > Africa and for which it is seeking protection are plausible. This is the > case with respect to the right of the Palestinians in Gaza to be protected > from acts of genocide and related prohibited acts identified in Article III, > and the right of South Africa to seek Israel’s compliance with the latter’s > obligations under the Convention. == Countries involved in the case == Article 63 of the Genocide Convention allows every member state to intervene in a case. Using, this article and since the filing of the case, over a dozen countries have involved themselves, either planning to join the case, declaring intention to join the case, or withdrawing from it. ===Belize (January 30, 2025)=== On January 30, 2025, Belize files a document containing an application for permission to intervene and a declaration of intervention in the proceedings. ===Chile (June 1, 2024)=== On June 1, 2024, President Gabriel Boric announced during the annual address to Congress that Chile will intervine and support the South African case against Israel. The statement of intervention that the country submitted focused on the country's interpretation regarding the prevention and punishment regarding genocide (Articles 1 to 6 and 9). ===Cuba (June 22, 2024)=== On June 22, 2024, Cuba decided to participate in South Africa's complaint against Israel before the International Court of Justice. Cuba will use its right to present its interpretation of the convention. On January 10, 2025, Cuba submitted its declaration of intervention to the ICJ. The statement states that a genocide has been happening for decades, and highlights infrastructure destruction, forced displacement, and restrictive measures, as well as the \"imposition of apartheid-like conditions in the occupied territory.\" The statement also criticizes the lack of appropriate actions by the United Nations regarding human rights violations committed against the Palestinian people. ===Ireland (March 27, 2024)=== On March 27, 2024, the government of Ireland announced that it will join the lawsuit of South Africa v. Israel and stated that \"restricting food and other essentials in Gaza may constitute genocidal intent\". On March 28, the ICJ stated \"that Palestinians in Gaza are no longer facing only a risk of famine ... but that famine is setting in,\" and ordered Israel to unblock food aid. The decision was backed by all judges. On January 3rd 2025, Ireland officially joined the other countries in asking to take part in the case. Its intervention would not add any more allegations against Israel, but \"focuses on the legal framework for its involvement in South Africa's case,\" especially on the notion of intent present in the definition of a genocide. === The Maldives (October 1, 2024) === On October 1, 2024, the Maldives submitted a declaration of intervention to the ICJ to participate in the case. ===Mexico (May 28, 2024)=== On May 28, 2024, Mexico has filed a declaration of intervention for South Africa v. Israel case. It has highlighted the fact that humanitarian assistance could not enter Gaza, and that cultural heritage was being destroyed. It has also explained that, even during an armed conflict, a genocide could be carried out, since the core of genocide is the intent to destroy the group being targeted. ===Nicaragua (January 23, 2024 - April 1, 2025)=== On 23 January 2024, Nicaragua, referring to Article 62 of the Statute of the Court, filed in the Registry of the Court an Application for permission to intervene “as a party” in the case concerning Application of the Convention on the Prevention and Punishment of the Crime of Genocide in the Gaza Strip. Nicaragua has withdrawn its application to join the case on April 1st 2025. The country has also sued Germany at the International Court of Justice, which was announced by the court on March 1st, 2024. The reason was Berlin's sending of military equipment to Israel and its cutting of aid to the United Nation's Palestinian refugee agency (UNRWA). Nicaragua declared that Germany's actions were breaking international law. === South Africa (December 29, 2023) === Filed the case on December 29, 2023. ===Spain (June 28, 2024)=== On 6 June 2024, Spain announced it was joining the case against Israel. On June 28, 2024, it submitted its declaration of intervention to the ICJ. On June 11, 2025, Pedro Sanchez (Spanish Prime Minister) has called Israel a 'genocidal state' for the first time during a Parliament question-and-answer session. He has also stated that Spain was not doing business with Israel. ===Türkiye (August 7, 2024)=== On August 7, 2024, Türkiye submitted its declaration of intervention on the case at the ICJ. Istanbul has accused Israel of violating Palestinians' human rights. At the end of July 2024, Recep Tayyip Erdoğan (president) had threatened to intervene and send NATO troops in Israel. He has also blamed Israel of the killing of Hamas leader in Tehran, Iran. Türkiye's foreign minister has stated that peace in the Middle East would be done by establishing a Palestinian state. ==Reactions== * : Benjamin Netanyahu, Prime Minister of Israel said in response to the first ruling, \"The charge of genocide leveled against Israel is not only false, it’s outrageous, and decent people everywhere should reject it\". * : Riyad al-Maliki, Foreign Affairs Minister of the State of Palestine, said that the Court \"ruled in favour of humanity and international law\". * : In a statement, the militant group said that, \"The (International) Court of Justice's decision is an important development which contributes to isolating Israel and exposing its crimes in Gaza\". * : Pedro Sanchez, Prime Minister of Spain said, \"We will continue to advocate for peace and an end to war, the release of hostages, access to humanitarian aid and the establishment of a Palestinian state alongside Israel, so that both nations coexist in peace and security\". * : In a statement EU says that, \"Orders of the International Court of Justice are binding on the parties and they must comply with them. The European Union expects their full, immediate and effective implementation\". * Francesca Albanese: The lawyer affirmed in an interview that if the court rules that Israel is committing a genocide, then it would be an obligation and a duty for other countries to intervene to stop it. She also affirmed, regarding the hearings of the 11 and 12 of January 2024, that the Israeli defence seemed unable to deny the accusations and prove them wrong, ==References== Category:2024 in Europe Category:Israel–Hamas war Category:January 2024 events Category:International Court of Justice",
 "title": "South Africa v. Israel (Genocide Convention)"
}