{
 "id": "1075229",
 "text": "On December 9, 2023, an intense tornado struck the northern parts of the Clarksville metropolitan area in Tennessee before moving through Todd County, Logan County and into Simpson County in Kentucky. The tornado killed four people, including a child, and injured an additional 61 others. ==Summary== The intense tornado touched down south of Fort Campbell North, Kentucky in Montgomery County, Tennessee and moved northeast.The National Oceanic and Atmospheric Administration’s preliminary damage survey by county: * * * The tornado caused EF0 damage to some trees before strengthening to high-end EF1 strength as the tornado completely destroyed the Clarksville School of Fine Arts as well as causing severe roof damage to nearby homes and a church. Several large trees in the area around the school were snapped as well. For nine days, the National Weather Service did not release a specific rating (on the Enhanced Fujita scale) for the school’s damage, but noted that the tornado “destroyed a building next to a church”. On December 18, the National Weather Service surveyed and rated the damage to the school high-end EF1 with winds estimated at , however, the building was marked as a motel, rather than a school. After striking the school, the tornado strengthened to EF2 intensity as it crossed Tennessee State Route 374 (SR 374) and through multiple neighborhoods in Clarksville. Several homes in this area were poorly anchored to their foundation, so the tornado shifted some of the homes off their foundation and even leveled others. Hundreds of trees were snapped in Clarksville as well. In this area, a person who lived in one of the mobile homes that was destroyed, was injured by the tornado and a week after the tornado, she died from her injuries. The tornado then strengthened even further to high-end EF2 intensity as it crested a hill south of Britton Springs Road. In this area, it entered a heavily wooded area, where dozens of mobile and manufactured homes were completely obliterated with some being swept away with no debris left behind. The tornado killed three people here, including a ten-year-old boy. Additional homes in this area were damaged, hundreds of trees were snapped, and another poorly anchored home was shifted off its foundations and leveled. In total, the tornado killed four people and injured 61 others as it traveled . 114 homes were destroyed while another 857 were damaged, and at least 20,000 people were without power after the tornado in Clarksville alone. The tornado also caused $45,000 in uninsured damage to the Clarksville School of Fine Arts. Originally, the school was set to have a Christmas play on December 9 at 1 p.m. However, a student was leaving the country, so the play was moved up to December 2, which had 300 in attendance. The director of the school later stated, “If we would have had 300 people in the building on the ninth instead of the second, we would be talking about the destruction of possibly hundreds of lives because there’s nothing left of the theater.” ==References== Category:2023 disasters Category:2023 in the United States Category:Tornadoes in the United States Category:December 2023 events Category:2023 in weather",
 "title": "2023 Clarksville tornado"
}