{
 "id": "1075222",
 "text": "Boston Garden was a multi-use stadium located in Boston, Massachusetts. The arena used to serve as the home for the Boston Bruins of the National Hockey League (NHL) and the Boston Celtics of the National Basketball Association (NBA). It was also home to the Boston Braves of the American Hockey League (AHL), the New England Whalers of the World Hockey Association (WHA), and the Boston Blazers of the Major Indoor Lacrosse League (MILL). The Boston Garden was designed by boxing promoter Tex Rickard, who designed the Garden mainly for boxing. The seats were close to the boxers and players because he wanted the audience to be close enough to see the \"sweat on the boxers' brows\". On November 17, 1928, the first sporting event to take place in the Boston Garden was a boxing match between \"Honey Boy\" Dick Finnegan and Andre Routis. Finnegan defeated Routis by unanimous decision in the tenth round. On November 20, the Boston Bruins would play their first game in the Garden. They played against their rivals Montreal Canadiens and lost 1–0. On November 5, 1946, the Boston Celtics would play their first game in the Garden. They played against the Chicago Stags and lost 57–55. On May 5, 1995, the Celtics played their final game at the Garden. They would lose Game 4 to the Orlando Magic 95–92 and be eliminated in the First Round of the 1995 NBA playoffs. On May 14, 1995, the Bruins played their final official game at the Garden. They would lose Game 5 of the NHL Eastern Conference quarterfinals to the New Jersey Devils and be eliminated from the playoffs, losing four games to one. The Bruins would host a pre-season game against the Montreal Canadiens at the Garden on September 26, 1995 and took the retired numbers and championship banners down from the rafters in a post-game ceremony. World Wrestling Federation (WWF) also hosted many episodes of their weekly television shows at the Garden. The arena would host the WWF pay-per-view Survivor Series in 1993. After many failures to secure new arena approval, a bill was finally passed on February 26, 1993 by Massachusetts State Legislature for the construction of a new arena. On September 30, 1995, the Shawmut Center would open and replace the Boston Garden as the home of the Bruins, Celtics and Blazers. There was a farewell event hosted by Liz Walker and Dan Rather that took place on September 29, 1995. Boston sports legends Bobby Orr, Phil Esposito, Larry Bird, and Red Auerbach were also there. From March until September 1998, the arena would be demolished. ==References== ==Other websites== Category:1927 establishments in the United States Category:1995 disestablishments in the United States Category:Buildings and structures in Boston Category:Boston Bruins Category:Boston Celtics",
 "title": "Boston Garden"
}