{
 "id": "1075975",
 "text": "The 2020- 21 Red Bull Salzburg season was the 88th season in club history. It was the 32nd season in the highest Austrian football league. They could defend their title in the Austrian League and Austrian Cup. In the UEFA Champions League, they qualified for the group stage after defeating Maccabi Tel Aviv in the playoffs. In the Europa League knockout phase, they were defeated by Villarreal in the round of 32. ==Squad== * Goalkeepers:33 Alexander Walke,1 Cican Stankovic, 23Nico Mantl * Defenders: 95 Bernardo, 17 Andreas Ulmer, 25 Patrick Farkas, 43 Rasmus Kristensen, 5 Albert Vallci, 39 Maximilian Wöber, 22 Oumar Solet, 70 Amar Dedic, * Midfielders: 45 Enock Mwepu, 16 Zlatko Junuzovic, 21 Luka Sucic 28 Antoine Bernède, 19 Mohamed Camara, 77 Noah Okafor, 13 Nicolas Seiwald, 11 Brenden Aaronson * Forwards: 20 Patson Daka, 7 Sekou Koita, 8 Mergim Berisha, 27 Karim Adeyemi * Coaching staff: Jesse Marsch (Head coach), Franz Schiemer, Rene Aufhauser (Assistance coaches), Herbert Ilsanker (Goalkeeper coach) ==Matches== Note: There were different restrictions for visitors due to the coronavirus pandemic. ==Champion stage== ==Table== Team M W D L Goals Points 1\\. FC Red Bull Salzburg 32 25 2 5 94ː33 51 (26)'' 2\\. SK Rapid Wien 32 17 8 7 64ː40 36 (22) 3\\. SK Sturm Graz 32 16 8 8 52ː34 36 (19) 4\\. LASK 32 15 6 11 55ː41 30 (21) 5\\. Wolfsberger AC 32 13 5 14 52ː62 27 (14)'' 6\\. WSG Tirol 32 10 8 14 53ː60 23 (15) The halved points from the basic round are in brackets. ==Austrian Cup== The number of visitors was limited to 1200 due to the Coronavirus pandemic. From the Round of 16 onwards no visitors were allowed. ==Champions League qualification== ==Champions League, Group A== Rank Team W D L Goals Points 1 FC Bayern Munich 5 1 0 18ː5 16 2 Atlético Madrid 2 3 1 7ː8 9 3 FC Salzburg 1 1 4 10ː17 4 4 FC Lokomotiv Moscow 0 3 3 5:10 3 ==Europa League, Round of 32== ==UEFA Youth League== A week before the start of the competition, the organizing UEFA announced that it would not be holding the competition. This was due to the critical COVID-19 situation, due to which Europe-wide travel restrictions were imposed. ==Friendly matches== ==Top scorers== Goals Name 1 27 Patson Daka 2 14 Sekou Koita Mërgim Berisha 3 7 Karim Adeyemi ==References == Category:FC Red Bull Salzburg seasons Category:2020–21 in European football",
 "title": "2020–21 Red Bull Salzburg season"
}