{
 "id": "1075699",
 "text": "The Chicago Coliseum was the name of three different multi-use stadiums located in Chicago, Illinois. The three stadiums each stood at different times in Chicago's history from the 1860s to 1982. The first Coliseum was opened sometime in the late 1860s. It was located in Downtown Chicago. The second Coliseum was started in 1895. During construction, workers had to restart their building after a structure collapsed and ruined the site. There were no fatalities. It was located in the Woodlawn neighborhood. The Democratic Party would host their National Convention here in 1896. They would nominate William Jennings Bryan to be their presidential nominee. Bryan would deliver his famous Cross of Gold speech to the crowd. On December 24, 1897, the building was completely destroyed by a fire. A YMCA stands on the property now. The third Chicago Coliseum was built in 1899 on the site of the old Libby Prison. The arena was a popular place for music and vaudeville acts. During the Coliseum's lifetime, it was the host for many conventions for both the Republican and Progressive Partys. The Republicans would host an event in 1904, 1908, 1912, 1916, and 1920. The Progressives would host in 1912. In 1926, the Chicago Black Hawks would be created as an Original Six team in the National Hockey League (NHL). On November 17, 1926, the Black Hawks would defeat the Toronto St. Pats 4–1 in their first game. On July 2, 1928, local sports promoter Paddy Harmon broke ground on a new stadium to replace the Chicago Coliseum. Chicago Stadium would open on March 28, 1929 and would replace the Coliseum as the home arena for the Black Hawks. In 1961, Chicago was awarded an expansion team in the National Basketball Association (NBA). They would be called the Chicago Packers before changing their name to the Chicago Zephyrs the next year. The Zephyrs would play their home games at the Chicago Coliseum since the Chicago Majors of the rival league American Basketball League (ABL) played at Chicago Stadium. The team would only last one season before moving to Baltimore, Maryland to become the Baltimore Bullets. On March 16, 1963, The Zephyrs played their last game at the Coliseum, losing to the Cincinnati Royals 126–117. With no major sports tenants, the arena would host musical artists for the rest of its lifetime until it was shut down for fire code violations on March 13, 1971. The building would eventually be demolished in 1982. ==References== Category:1973 establishments in the United States Category:2002 disestablishments in the United States Category:Buildings and structures in Maryland Category:Chicago Blackhawks",
 "title": "Chicago Coliseum"
}