{
 "id": "1075573",
 "text": "Ultrakill (styled as ULTRAKILL) is a first-person shooter early access video game, developed by Arsi \"Hakita\" Patala and published by New Blood Interactive. The game was released on Steam on September 3, 2020 as early access. The game uses movement and style of old first-person shooters, such as Quake or Doom, and other doom clones. The game is much more fast paced than those games, has more platforming elements, and is made to have a very high skill ceiling. The gameplay is based on Dante's Inferno with the nine circles of hell (Limbo, Lust, Gluttony, Greed, Wrath, Heresy, Violence, Fraud, and Treachery). In which the game is divided into a prelude and 3 acts. Each layer in an act has a boss at the end of that layer. The main antagonist of the game is the Archangel Gabriel, which is the final boss of both Act 1 and 2. Though it is difficult to place an exact \"bad guy\" due to almost every character being bad in some way, including the main character. The player controls a small war machine called V1, as they move down into hell, they collect more weapons and tools. The main gameplay mechanic is the collection of blood. Damaging enemies causes blood to be released, allowing the blood to be collected for health. Much of the game was made with a philosophy that puts the player experience first, with story and graphical improvements being implemented later on. There are 5 weapons, 3 arms, and 3 alternate variants currently at V1's disposal. Blue Variant Green Variant Red Variant Alternate Version Revolver: The starting weapon, acquired in the first level of the prelude. providing a reliable source of damage. Piercer: Secondary fire charges a piercing shot that, when released can pierce through three enemies. Marksman: Secondary fire tosses a coin, shooting this coin with any hitscan weapon (Revolver shots, or Railcannon shots) that causes a \"Ricoshot\" bouncing the shot off the coin, and into a enemy. Sharpshooter: Secondary fire starts spinning the gun, allowing the bullets to bounce off walls. Slab Revolver: Higher damage, with a slower fire rate and cannot deal extra damage with headshots. Acquired in 1-4, after pressing 4 buttons throughout the limbo layer. Shotgun: The second weapon, acquired in either 0-2 or 0-3, depending if you find a secret encounter or not. A much better close range source of damage. Core eject: Secondary fire launches the core of the shotgun, exploding on contact or when shot. Pump charge: Secondary fire pumps the shotgun, a maximum of 3 times. The more you pump, the more powerful it will become, although losing accuracy. Pumping it 3 times causes an explosion. Sawed on: Secondary fire revs up a small chainsaw, making a extremely strong close range option. Letting go of Alt fire launches it forward, which can be parried to increase air time or detached, flying off and bouncing through the room, using the Knuckleblaster. Jackhammer: Loses the ability to shoot bullets, trading it for an extremely strong piston, with a unique velocity based damage system. Acquired in 7-2, after finding a deactivated robot. Nailgun: High fire rate gun in a similar style to a machine gun. Acquired in 1-1. Attractor: Secondary fire shoots out a magnet which attracts all nails, creating a swarm of nails. It is also the only nailgun to have a maximum amount of nails, having 100 in the nailgun, and 10 in its alternate weapon. Overheat: Firing for a set amount of time charges a \"Heat Sink\", allowing for a quick burst of burning nails. Jumpstart: Shoots out a electrical cable, which shocks and damages the hit enemy after a short time of doing nothing, increasing in power if nails are fired into the enemy during this. Sawblade launcher: Shoots out Sawblades instead of nails, that can bounce off walls. Instead of a swarm, Saw blades on attracted into an circular orbit around magnets. Railcannon: A single shot, extremely high damage weapon acquired in 2-2. There is a charge of about 16 seconds, shared across all variants. It's secondary fire is a zoom in. Electric: Shoots out a infinite piercing shot, doing high damage, and if hitting water electrocuting and damaging all enemies touching that water. Also being able to jump between conductive elements such as magnets, nails or coins. Screwdriver: Shoots out a drill that drills into enemies, releasing a large amount of blood over time, and increasing the range with the player can heal from said blood. Malicious: Shoots out an explosive beam. It's name, ability, and weapon icon are based on the enemy \"Malicious Face\". No alternate weapon has been implemented yet. Rocket launcher: Shoots an explosive missile. It will not do any damage unless it makes direct contact with an enemy. will launch nearby entities into the air if they are in the explosive range. will deal extra damage to airborn targets. Acquired in 5-3. Freezeframe: Secondary fire freezes all rockets, no matter the source. landing on top of a frozen rocket allows V1 to ride on it, also allowing it to be steered with the movement keys. S.R.S. Cannon: Secondary fire shoots out an explosive cannonball, bouncing off enemies. Firestarter: Secondary fire shoots out oil, igniting when shot. It can also coat enemies with oil, burning them. The oil can also be slid on to increase movement speed No alternate weapon has been implemented yet. Arms: arms are activated using \"F\" and can be switched using \"G\".An exception is the whiplash which is activated using \"R\".Since V1 only uses 1 hand to hold weapons arms can always be used. Feedbacker: Starting arm that does decent damage. Punching at the right time parries an attack healing the player. It is also used to combo with other weapons for stylish kills. Knuckleblaster: Can't parry but can do a strong punch. Holding the \"F\" key activates the built in shotgun which can clear through hordes of enemies with an explosion. It can knock enemies off the map killing them. Whiplash: Pressing \"R\" will shoot out a grappling hook that can catch enemies or \"hook points\". If the enemy is heavy V1 is pulled towards it. If the enemy is light it is pulled towards V1. It makes healing more difficult for V1 when using it, discouraging overuse. No alternate weapon has been implemented yet. == References == Category:Upcoming video games Category:Early access video games Category:First-person shooters Category:Indie video games Category:Science fiction video games Category:Single-player video games Category:Video games set in hell Category:Windows games",
 "title": "Ultrakill"
}