{
 "id": "1075884",
 "text": "The Cybertruck is an electric pickup truck made by Tesla Inc. It was released in late 2023. Tesla initially planned to produce the vehicle in late 2021, but after many delays, it entered production in November 2023 and was first delivered to customers later that month. Two models are currently offered: a trimotor all-wheel drive (AWD) model called Cyberbeast, and a dual-motor AWD model. A single-motor rear-wheel drive (RWD) model is slated to be available in 2025. EPA range estimates cover 250–340 miles (400–550 km), varying by model. As of November 2024, the Cybertruck was only shipping in the United States and Canada. == History == Tesla CEO Elon Musk's ideas for a pickup truck were first stated publicly in 2012 and 2013, envisioning to build a \"Tesla supertruck with crazy torque, dynamic air suspension, and corners like it's on rails\". In early 2014 Musk predicted 4–5 years before work could start on the product, then in a 2015 interview with CNN, Musk stated that the Tesla pickup would be the equivalent of a Ford F-150. In mid-2016, the outline for a consumer pickup truck was included in part 2 of the Tesla Master Plan. Musk suggested that the same chassis could be used for a van and a pickup truck. In 2017, Musk teased the picture of a \"pickup truck that can carry a pickup truck\" was displayed at the official reveal for the Tesla Semi and Roadster. In March 2019, following the Tesla Model Y launch, Musk distributed a teaser image of a vehicle described as having a cyberpunk or Blade Runner style, with the form resembling a futuristic armored personnel carrier. It was rumored to be named the Model B. On November 6, 2019, Tesla filed for a trademark on \"Cybrtrk\", which was granted by the United States Patent and Trademark Office but was later abandoned on August 10, 2020. == Incidents == On January 1, 2025, at approximately 8:39 a.m. (PST), the contents of a Tesla Cybertruck exploded outside the main entrance of the Trump International Hotel Las Vegas in Paradise, Nevada, United States. The vehicle's sole occupant died from a self-inflicted gunshot wound to the head immediately prior to the explosion and seven bystanders were injured by the blast. Authorities found that the vehicle contained firework mortars and gas canisters, which fueled the explosion and fire. == Notes == == References == Category:Pickup trucks Category:2020s automobiles Category:Electric vehicles Category:Tesla automobiles",
 "title": "Tesla Cybertruck"
}