{
 "id": "1076764",
 "text": "Conversion to Islam means accepting Islam as your religion and not following any other religion or belief. To convert, a person needs to declare the Shahādah, the Muslim profession of faith, stating, \"There is no god but Allah and Muhammad is the messenger of Allah\" (Arabic: أَشْهَدُ أَن لا إِلٰهَ إلَّا الله و أَشْهَدُ أَنَ مُحَمَّدًا رَسُول الله). In Islam, it is believed that everyone is born Muslim. Circumcision (khitan) is a cultural practice in Islam, not mentioned in the Quran but in hadith. Most clerical opinions state that circumcision is not necessary when someone enters the Muslim faith. == Missionary Activities == Dawah means inviting or calling people to embrace Islam. In Islam, it's about inviting both Muslims and non-Muslims to understand and follow the worship of God as described in the Qur'an and the teachings of Muhammad. Da'wah, the \"Call towards God,\" started with Muhammad, who spread the message of the Quran to humanity. After him, his followers and the Muslim community took on the responsibility of continuing this message. They share information about why and how the Qur'an emphasizes monotheism. Muhammad believed that Islam was the true religion, and his mission as the final prophet was to invite the entire world to embrace Islam. He even wrote to non-Muslim rulers, inviting them to convert.[Sookhdeo Patrick, and Murray, Douglas. 2014. Dawa: The Islamic Strategy for Reshaping the Modern World. Isaac Publishing.] == Conversion number == Counting how many people convert to a religion is hard. Some censuses ask about religion, but not if someone converted. In some places, converting is tough because of laws or social issues, like the death penalty for leaving Islam in some countries. There isn't much data on how many people convert to or leave Islam. A 2011 study by Pew Research suggests that religious conversion doesn't change the global Muslim population much. Another study in 2015 predicts a small gain of 3.22 million Muslims through conversion by 2050. Islam would be the second-largest religion gaining followers through conversion, after the religiously unaffiliated group. In the U.S., about 25% of Muslims are converts, and it's estimated that around 20,000 Americans convert to Islam every year. The number of U.S. converts to Islam is similar to those leaving, which is different from other religions. Globally, Islam has more converts than people leaving, with about 420,000 more converting between 2015 and 2020. However, more people switch from \"religious\" to \"unaffiliated.\" People changing religions might not affect the growth of the Muslim population much. In the UK, around 5,000 people convert to Islam annually, and many of them are women. Conversions have doubled in the past 25 years in France. In the U.S., African Americans make up a significant portion of Muslim converts. Looking ahead, modest gains through religious conversion are expected for Muslims, with most of these gains happening in Sub-Saharan Africa. == Related pages == * Islam * Apostasy in Islam * Muslim world == References == Category:Islam",
 "title": "Conversion to Islam"
}