{
 "id": "1076798",
 "text": "SERES is a leading brand in the development of intelligent electric vehicles, with a wide range of products aimed at providing sustainable transportation solutions for everyone. == History == ===SF Motors=== In January 2016, the startup 'SF Motors' was founded in the Californian city of Santa Clara, which was created on the initiative of the Chinese concern Sokon Group. The goal was to develop electric cars with both home markets in mind: United States and China. At the end of 2016, former co-founder of Tesla Motors, Martin Eberhard, joined the company's team. In September 2017, the Chinese government approved the production of electric cars in the country. In the same year, SF Motors also expanded its presence in the United States, establishing cooperation with University of Michigan in the field of autonomous car technology, and acquiring the former AM General plant in Mishawaka as one of the company's two future vehicle manufacturing facilities. === Seres === In March 2018, SF Motors unveiled its first two prototypes previewing the formulation of its future range of production electric cars, SF6 and SF7. A year later, in April 2019, the startup announced that it was changing its name to Seres, while presenting the first production car - the Seres SF5 crossover. In July of the same year, Seres announced the suspension of plans to debut on the American market, as well as the dismissal of 90 employees in United States due to the unsatisfactory financial results of the startup's Chinese branch. In April 2021, Seres presented the result of cooperation with the Chinese giant of the electronics industry Huawei - a modernized variant of the SF5 model. The partner was responsible for the infotainment and sound system, as well as the new generation hybrid drive. Distribution of the vehicle started in the same month in selected Huawei showrooms in China. Already in 2022, the car completely disappeared from the Chinese market, after changes in styling, it was further sold under the new Aito brand as Aito M5. At the same time, under the new name Seres 5, the vehicle remained in production under the parent brand, from then on being an export product on selected global markets. === Export === The first region outside China where Seres cars went on sale was Europe, however, initially it was done only on the initiative of private, independent companies. In December 2020, the Dutch company Green Mobility Group Europe started official distribution and sales of the Seres brand on the first export market, in Netherlands. The vehicle that created this offer was the brand's second production model - the city electric crossover Seres 3 which is a similar design to the Dongfeng Fengon E3 model offered in China. Shortly after its debut on the Dutch market, the market range of the Seres 3 model was also expanded to include the neighboring German market. In this market, its distribution was handled by the local company INDIMO Automotive GmbH. In September 2021, thanks to the international company Busnex, Seres 3 went on sale also in Poland. Less than 3 years after the launch of the first Seres for export, in the second half of 2023, the company officially started operating as an authorized distributor of its vehicles, initially in three large regions, when, apart from the previously known \"3\", the larger \"5\" and \"7\" were also presented in a modernized form. In October, Seres began operations in Brazil, in turn, in the meantime, the company also launched distribution in Indonesia, presenting another model there - an electric microcar E1, borrowed from the Chinese range of sister brand Fengon. ==Products== === Seres === Seres is a brand of electric vehicle owned by Seres Group. Since 2023, Seres brand has shifted to export-focus brand while AITO became a domestic only brand. * Seres 7 (to commence), mid-size SUV, rebadged AITO M7 * Seres 5/SF5 (2019–present), compact SUV * Seres 3/E3 (2020–present), compact SUV, rebadged Fengon E3 * Seres E1 (2022–present), city car, rebadged Fengon Mini EV File:Seres 3 IAA 2023 1X7A0354.jpg|Seres 3 File:Seres 5 IAA 2023 1X7A0327.jpg|Seres 5 File:Seres 7 IAA 2023 1X7A0329.jpg|Seres 7 File:2023 Seres E1 L (Indonesia) front view 02.jpg|Seres E1 === AITO === AITO is a brand Seres Automobile collaborates with Huawei for smart electric vehicle. Huawei is leads in the design of AITO models while Seres conducts in production. It is only operated in Chinese market. The AITO brand was owned by Seres but was owned by Huawei in June 2023. File:Aito_M5_IMG005.jpg|AITO M5 File:Aito_M5_EV_001.jpg|AITO M5 EV File:AiTO_M7_001.jpg|AITO M7 File:AITO M9 20231120.jpg|AITO M9 === Landian === Landian is Seres brand for budget electric vehicles which unveiled in March 2023. The word Landian literally means blue electricity (蓝电) in Chinese. * Landian E5 (2022-present), compact SUV, rebadged PHEV variant of Fengon 580 * Landian E3 (2023-present), subcompact SUV, rebadged Fengon E3 File:Landian_E5_at_Auto_Guangzhou_2023_20231126.jpg|Landian E5 == References == Category:Automobile brands Category:American automobile companies Category:Companies based in the San Francisco Bay Area",
 "title": "Seres (automobiles)"
}