{
 "id": "1076088",
 "text": "Leva Bonaparte (Nowroozyani; born 3 May 1979) is an American restaurateur and television personality. She is known as a main cast member on the Bravo reality television series Southern Charm and its spin-off series Southern Hospitality. == Early life == Leva Nowroozyani was born in India on 3 May 1979, as the eldest of three daughters to Persian parents. Bonaparte moved to Canada with her family at the age of three and later split her time between Bolivia and the United States. === Education === Bonaparte graduated from South Carolina State University in 1999. == Career == === Businesses === Bonaparte sold software for her parents' company between 1999 and 2009. Bonaparte is involved in the Republic Development and Management Group and 26 Industries, a marketing and event management firm. === Restaurants, bars and clubs === Bonaparte and her husband own four restaurants, bars and clubs in the Charleston area. Bonaparte made her debut as a restaurateur when she opened Republic Garden & Lounge with her husband in the spring of 2013. She opened her second establishment, Bourbon N' Bubbles, on 29 November 2018. She opened her third establishment, 1st Place, on 20 October 2020 (now closed). She opened her fourth establishment, Mesu, on 25 September 2019; .Bonaparte opened her fifth establishment, Lamar's Sporting Club, on 25 August 2023. === Television === Bonaparte has appeared as a main cast member on the Bravo reality television series Southern Charm since the shows seventh season in 2020. She appeared in a guest capacity for the first six seasons. She was the first cast member of color. Bonaparte has appeared as a main cast member on a spin-off from Southern Charm, Southern Hospitality, since 28 November 2022. She is also an executive producer. The series follows Bonaparte and the staff of her Charleston nightclub, Republic Garden & Lounge. == Personal life == Bonaparte has resided in Charleston since 2003. === Marriage and children === Bonaparte married Lamar Bonaparte on 25 April 25 2013\\. The couple met on her 29th birthday. Their only child, Lamar \"Little\" Bonaparte Jr., was born on 29 January 2018. == Filmography == Year Title Notes Ref. 2014–present Southern Charm 41 episodes 2021–2022 Watch What Happens Live! with Andy Cohen 5 episodes 2022–present Southern Hospitality 9 episodes; also executive producer 2022 Entertainment Tonight 1 episode == References == Category:1979 births Category:Living people Category:American television personalities",
 "title": "Leva Bonaparte"
}