{
 "id": "1076368",
 "text": "Inside Out 2 is an American animated coming-of-age film. It was released on June 14, 2024. It is the sequel to the 2015 movie Inside Out. Inside Out 2 takes place after the events of the original film in which Joy, Sadness, Anger, Disgust, and Fear meet new emotions: Anxiety, Embarrassment, Ennui, Envy and Nostalgia. Inside Out 2 was the first Pixar movie to be released on home video by Sony Pictures Home Entertainment, following the closure of Disney's home video business. == Voice cast == *Lewis Black as Anger, a red angry emotion. *Phyllis Smith as Sadness, a blue sad emotion. *Amy Poehler as Joy, a yellow happy emotion. *Tony Hale as Fear, a purple fearful emotion. Hale replaces Bill Hader from the first film. *Liza Lapira as Disgust, a green disgusted emotion. Lapira replaces Mindy Kaling from the first film. *Maya Hawke as Anxiety, a new orange anxious emotion. *Ayo Edebiri as Envy, a new cyan envious emotion. * Adèle Exarchopoulos as Ennui, a new indigo bored emotion. * Paul Walter Hauser as Embarrassment, a new pink embarrassed emotion. * Kensington Tallman as Riley Andersen, a 13-year-old girl in whose mind the emotions live. Tallman replaces Kaitlyn Dias from the first film. * Diane Lane as Jill Andersen, Riley's mother. * Kyle MacLachlan as Bill Andersen, Riley's father. * Lilimar as Valentina \"Val\" Ortiz, a popular hockey player at Riley's high school. * Paula Pell as Mom's Anger. * Sumayyah Nuriddin-Green as Bree, Riley's friend. * Grace Lu as Grace, Riley's friend. * Yvette Nicole Brown as Coach Roberts, a hockey coach who is the head of the summer hockey camp. * John Ratzenberger as Fritz. * June Squibb as Nostalgia, a new gray nostalgic emotion. * Ron Funches as Bloofy, a character from Riley's favorite childhood TV show. * Yong Yea as Lance Slashblade, a heroic video game character whom Riley had a crush on when she was younger. ==References== Category:2024 animated movies Category:Pixar movies Category:2020s sequel movies Category:American sequel movies Category:2020s computer-animated movies Category:2020s English-language movies Category:American fantasy-comedy movies Category:2020s fantasy movies Category:American coming-of-age movies Category:2024 comedy movies Category:2024 drama movies Category:2024 movies Category:2020s comedy-drama movies Category:American comedy-drama movies Category:Ice hockey movies Category:Movies about puberty Category:Movies set in San Francisco Category:2020s 3D movies Category:IMAX movies",
 "title": "Inside Out 2"
}