{
 "id": "1076577",
 "text": "AITO () is a Chinese electric vehicle marque of Chinese vehicle manufacturer Seres Group and multinational technology corporation Huawei in 2021. The marque offers electric cars with autonomous driving systems and the HarmonyOS operating system. AITO is the first brand under Harmony Intelligent Mobility Alliance (HIMA, 鸿蒙智行) collaboration model, in which Huawei provides full-stack intelligent vehicle solutions for traditional auto manufacturers. Huawei also announced that other manufacturer partners such as Chery, BAIC Motor, and JAC Motors will apply the similar business model. The name AITO stands for \"Adding Intelligence to Auto\". == History == ===Joint-venture=== At the end of December 2021, the Chinese technology company Huawei announced the creation of a new car manufacturer Aito, being the result of the ongoing cooperation through the Seres brand with the automotive concern Sokon Group. The Aito Mi model, which debuted during the company's inauguration, was created as a development of the already existing SUV Seres SF5, being a more luxurious, twin version with a more efficient hybrid system with a long range of approx. 1,195 kilometers. The market debut of the Aito brand, which took place limited to the internal Chinese market at the end of December 2021, turned out to be a success. The interest in the hybrid SUV translated into a relatively large number of orders, which amounted to 6,000 within 5 days of the premiere. Mass production of the car started in early 2022. In March of the same year, Aito announced plans to expand both its model offering and dealer network - the cars will ultimately be sold in a network of 400 showrooms, both independent and part of Huawei sales outlets. In mid-April 2022, the first information about the company's second model appeared, this time taking the form of a large, slightly over 5-meter-long hybrid SUV Aito M7. === HIMA === At the end of May 2023, Aito's production volume exceeded 100,000 cars, a year and a half after the company's inauguration. In June of the same year, the company underwent its first major ownership changes, from the joint-venture company, becoming full ownership of the Huawei concern. The new owner took over the rights to the brand, which was another step increasing the technological conglomerate's involvement in the automotive industry. In the second half of the same year, Aito carried out a minor modernization of the M7 and reduced its price, which resulted in very high interest and 50,000 orders collected within 50 days. The premiere of the third one took place in November 2023 during the Guangzhou Auto Show and also the largest and most expensive model in the Chinese company's range in the form of the full-size Aito M9. In the same month, Huawei announced the creation of a dedicated automotive division Harmony Intelligent Mobility Alliance (HIMA), which Aito joined with the second, newly established car brand Huawei, Luxeed. == Products == === Current models === * AITO M5 (2022–present), mid-size SUV (EV/EREV) * AITO M7 (2022–present), mid-size SUV (EREV) * AITO M9 (2023–present), full-size SUV (EV/EREV) * AITO M8 (upcoming), mid-size SUV File:2022 Seres AITO M5 (front).jpg|AITO M5 File:Aito M5 EV 003.jpg|AITO M5 EV File:2022 Seres AITO M7 (front).jpg|AITO M7 File:AITO M9 20240313 02.jpg|AITO M9 == Sales == Sales of AITO brand Year AITO 2022 76,180 2023 94,380 == References == Category:Automobile brands Category:Electric automobile companies of China",
 "title": "AITO (marque)"
}