{
 "id": "1076722",
 "text": "Dylan Christopher Minnette (born December 29, 1996) is an American actor and musician. He is known for his role as Clay Jensen in the Netflix drama series 13 Reasons Why. He is also a member of the American alternative rock band Wallows. ==Early life== Minnette was born in Evansville, Indiana, the only child of Robyn and Craig Minnette. The family moved to Champaign, Illinois, where they lived for five years, and later moved to Los Angeles, California, so that he could pursue a career in acting. ==Filmography== ===Film=== Film appearances by Dylan Minnette Year Title Role Notes 2007 Game of Life Billy Direct-to-video film 2007 Fred Claus Orphanage kid 2008 Snow Buddies Noah Framm Direct-to-video film 2008 The Clique Todd Lyons Direct-to-video film 2010 Let Me In Kenny 2013 Labor Day 16-year-old Henry Wheeler 2013 Prisoners Ralph Dover 2014 Alexander and the Terrible, Horrible, No Good, Very Bad Day Anthony Cooper 2015 Goosebumps Zach Cooper 2016 Don't Breathe Alex 2017 The Disaster Artist Guy on cell phone Deleted scene 2018 The Open House Logan Wallace 2022 Scream Wes Hicks ===Television=== Television appearances by Dylan Minnette Year Title Role Notes 2005 Drake & Josh Jeffrey Episode: \"The Demonator\" 2005 Two and a Half Men Young Charlie Harper Episode: \"I Always Wanted a Shaved Monkey\" 2005–2006 Prison Break Young Michael Scofield Recurring role (seasons 1–2) 2006 Mad TV Billy Season 11, episode 18 2006 The Year Without a Santa Claus Iggy Thistlewhite Television film 2007–2010 Saving Grace Clay Norman Main role 2007 Grey's Anatomy Ryan (boy with no ears) Episode: \"Haunt You Every Day\" 2008 Ghost Whisperer Pierce Wilkins Episode: \"Stranglehold\" 2008 Rules of Engagement Nicky Episode: \"Buyer's Remorse\" 2008 The Mentalist Frankie O'Keefe Episode: \"Red Hair and Silver Tape\" 2009 Supernatural Danny Carter Episode: \"Family Remains\" 2010 Lost David Shephard 4 episodes 2010 Medium Cameron Episode: \"The Match Game\" 2010–2011 Men of a Certain Age Reed 4 episodes 2011 Lie to Me Noah Episode: \"Rebound\" 2011 Against the Wall Ryan Spencer Episode: \"Obsessed and Unwanted\" 2011 The Haunting Hour: The Series Corey Episode: \"Brush with Madness\" 2012 Awake Rex Britten Main role 2012 Law & Order: Special Victims Unit Luca Gabardelli Episode: \"Learning Curve\" 2012 Major Crimes Avi Strauss Episode: \"The Ecstasy and the Agony\" 2013 Nikita Stefan Tasarov Episode: \"Reunion\" 2013 Save Me Ben Tompkins Episode: \"The Book of Beth\" 2013 The Haunting Hour: The Series Chad Episode: \"Funhouse\" 2014 Agents of S.H.I.E.L.D. Donnie Gill Episodes: \"Seeds\", \"Making Friends and Influencing People\" 2014 Scandal Fitzgerald \"Jerry\" Jr. Recurring role (season 3–4) 2017–2020 13 Reasons Why Clay Jensen Main role 2018; 2019 The Late Late Show with James Corden Himself Performing alongside his band Wallows 2019 The Tonight Show Starring Jimmy Fallon Himself Performing alongside his band Wallows 2020 Jimmy Kimmel Live! Himself Performing alongside his band Wallows 2022 The Dropout Tyler Shultz Miniseries ==References== ==Other websites== * } Category:1996 births Category:Living people Category:Actors from Texas",
 "title": "Dylan Minnette"
}