{
 "id": "1076225",
 "text": "Craig Conover (born February 9, 1988) is an American television personality, attorney and businessman. He is best known as a main cast member on the Bravo reality television series Southern Charm. Conover is also known as a guest cast member on the Bravo reality television series Summer House and as a former main cast member on the spin-off Winter House. == Early life == Craig Conover was born in Fenwick Island, Delaware on February 9, 1988, as the elder of two sons to Craig Conover Sr., an entrepreneur, and Martha Conover (née Foster), a teacher. === Education === Conover attended Selbyville Middle School and Indian River High School. He won a national championship in a business competition while he was in high school. Conover graduated from the College of Charleston with his Bachelor of Science degree in 2010. He graduated from the Charleston School of Law in 2014; he did not receive his Juris Doctor degree upon graduation due to his failure to turn in a final thesis paper. Conover was a member of Kappa Sigma fraternity. == Career == === Television === Conover made his television debut on the Bravo reality television series Southern Charm as a main cast member from the first season. The first season was launched on March 3, 2014. Conover has appeared on Summer House in a guest capacity since the fourth season. The fourth season was launched on February 5, 2020. Conover appeared as a main cast member on a spin-off from Summer House, Winter House, for the first two seasons. The first season was launched on October 20, 2021. The second was season launched on October 13, 2022. === Law === Conover passed the South Carolina Bar exam on April 17, 2017. He was sworn in by the South Carolina Bar in February 20, 2018. Conover founded The Craig Conover Law Firm, based in Charleston, on March 18, 2021. === Acting === Conover made his debut as an actor, as Officer Smith in the action thriller film Reprisal. The film was released on August 31, 2018. Conover will portray Todd in the horror film Tuesday's Flu. === Businesses === Conover and his Southern Charm co-star Patricia Altschul released a pillowcase collaboration on March 28, 2019. Conover founded Sewing Down South, a sewing lifestyle brand, on April 1, 2019. He began sewing in eighth grade home ec class. The company landed a partnership with HSN on June 25, 2020. The first store opened in Charleston on May 15, 2021. The company partnered with HomeGoods on July 19, 2022. === Restaurants === Conover partnered with his Southern Charm co-star Leva Bonaparte and her husband Lamar Bonaparte as co-owners of Mesu, in Charleston. The restaurant opened on September 25, 2019. Conover partnered with his Southern Charm co-star Austen Kroll, Chris Maier, Philip Testa, and Jordan Andino as co-owners of Carriage House, in New York City. The restaurant opened on March 29, 2023. Conover and Kroll partnered with Uptown Hospitality Group as co-owners of By the Way. === Other ventures === Conover and Kroll launched their Pillows and Beer podcast on January 28, 2021. They toured from November 7, 2023, to February 1, 2024. Conover authored his memoir, Pillow Talk: What's Wrong with My Sewing? (). The book was published by Simon & Schuster on March 29, 2022. == Personal life == Conover resides in Charleston, South Carolina. === Relationships === Conover was in a relationship with Naomie Olindo between 2014 and September 2017. He was in a relationship with Natalie Hegnauer from early 2020 to early 2021. He was in a relationship with Paige DeSorbo from October 2021 to December 2024. == Filmography == === As himself === Year Title Notes Ref. 2014–present Southern Charm 126 episodes 2014 Shepic Fail 2016 The Domenick Nati Show 1 episode 2016–2023 Watch What Happens Live! with Andy Cohen 13 episodes 2018 Poker Night Live 1 episode 2018–2020 Celebrity Page 2 episodes 2020–present Summer House 24 episodes 2021–2022 Winter House 15 episodes 2022 Daily Blast Live 1 episode === As an actor === Year Title Role Notes Ref. 2018 Reprisal Officer Smith TBA Tuesday's Flu Todd Post-production == References == Category:1989 births Category:Living people Category:American television personalities",
 "title": "Craig Conover"
}