{
 "id": "1076432",
 "text": "The Kolyma River is a river in northeastern Siberia, Russia. It flows through parts of the Sakha Republic, Chukotka Autonomous Okrug, and Magadan Oblast. The Kolyma river starts where the Kulu and Ayan-Yuryakh rivers meet in the Okhotsk-Kolyma Upland. It then flows south in the Upper Kolyma Highlands and north in the Kolyma Lowland, a flat area with many lakes. Finally, it empties into the Kolyma Gulf of the East Siberian Sea. The river is frozen for about 250 days each year, from October to early June. The Kolyma river is 2,129 kilometers (1,323 miles) long, and its basin covers 647,000 square kilometers (250,000 square miles). The river's average discharge at Kolymskoye is 3,254 cubic meters per second, with a high of 26,201 cubic meters per second in June 1985 and a low of 30.6 cubic meters per second in April 1979. == History == In 1640, Dimitry Zyryan traveled overland to the Indigirka river in Sakha republic. In 1641, he sailed down the Indigirka, explored the Alazeya river, and encountered the Chukchis for the first time. He returned to the Indigirka in 1643, sent tribute to Yakutsk, and revisited the Alazeya region. In 1645, he was appointed land administrator of the Kolyma region of Siberia. He returned and died in 1646. In 1641–42, Mikhail Stadukhin, with Semyon Dezhnyov, journeyed overland to the upper Indigirka, built boats, sailed down the Indigirka, met Zyryan, and separated. Stadukhin reached the Kolyma region in 1644 and returned to Yakutsk in 1645. Baron Eduard Von Toll conducted geological surveys in the Kolyma basin in 1892–94 for the Russian Academy of Sciences, covering 25,000 kilometers in a year. The Kolyma is famous for Gulag labor camps and gold mining, depicted in Varlam Shalamov's \"The Kolyma Tales.\" After the camps closed, subsidies and industries declined, leading to migration. Remaining locals now rely on fishing and hunting. In August 1929, the Nanuk crew visited Kolyma, and in August 1991, the first Americans since then, Wallace Kaufman and Rebecca Clay, traveled from Ziryanka to Green Cape. In February 2012, scientists reported growing plants from 30,000-year-old Silene stenophylla fruit found near the Kolyma River in permafrost. == References == Category:Rivers of Russia Category:Siberia Category:Sakha Republic Category:Chukotka Autonomous Okrug Category:Magadan Oblast",
 "title": "Kolyma River"
}