{
 "id": "1076133",
 "text": "Connor Bedard (born July 17, 2005) is a Canadian professional ice hockey centre. He currently plays for the Chicago Blackhawks of the National Hockey League (NHL). Bedard has been called a generational talent and was called the \"The Future of Hockey\" by The Hockey News. During his time playing in the Western Hockey League (WHL), Bedard was awarded the Jim Piggott Memorial, the Bob Clarke and the Four Broncos Memorial Trophys. He would also win the Canadian Hockey League (CHL)'s Top Scorer and Player of the Year awards. Bedard plays international hockey with Canada. He played with the under-18 team for the 2021 tournament, and with the National junior team in the 2022 and 2023 tournaments. He would help Canada win a gold medal in all three tournaments. He won the very first IIHF Male Player of the Year Award in 2023. ==Career== ===Regina Pats=== Before playing in the NHL, Bedard played parts of 3 seasons with the Regina Pats of the Western Hockey League (WHL). He would be drafted first overall by the Pats in the 2020 WHL Bantam Draft. Before the draft, Hockey Canada gave Bedard exceptional player status which let him play in the WHL a year early. Before playing for the Pats, Bedard would be loaned to the juniour team for HV71 of the Swedish Hockey League (SHL) in 2020. He would play with them while the WHL had play suspended because of the COVID-19 pandemic. The WHL would continue play in March 2021 and Bedard would return to play for the Pats. In his first season with the team, he won the Jim Piggott Memorial Trophy for rookie of the year. The next year, Bedard would finish the season with 51 goals, 49 assists, and 100 points. He also became the youngest player in the WHL to score 50 or more goals in a season and the third 16-year- old to record a 100-point season in the league. It was the first one in the 21st century. In the 2022–23 season, Bedard would record a points streak for 35 games and became the league's leading scorer over that time. The streak would be snapped after being unable to record a point in a 3-2 win against the Lethbridge Hurricanes on February 3, 2023. Bedard's exceptional performance in the league led to lots of attention on his games. While traveling to other team's arenas, they would often sellout. When the Pats played the Calgary Hitmen at the Scotiabank Saddledome (also home of the Calgary Flames), there was an attendance of 17,223. Normally, a Hitmen game would sell an average of around 3,500. At the end of the season, he would be awarded the Bob Clarke and the Four Broncos Memorial Trophys. He would also win the Canadian Hockey League (CHL)'s Top Scorer and Player of the Year awards. ===Chicago Blackhawks=== When the Chicago Blackhawks won the number one pick in the 2023 lottery, it was reported that the Blackhawks had already sold $2.5 million in season ticket packages in anticipation of the selection of Bedard. On June 28, 2023 at the 2023 NHL Entry Draft, the Chicago Blackhawks would select Bedard first overall. On July 17, Bedard would sign a three-year entry level contract with a $950,000 cap hit. On October 10, Bedard would make his NHL debut in a 4–2 win against the Pittsburgh Penguins. In the game, Bedard would record his first point in the NHL when he got an assist on a Ryan Donato goal. The next night, the Blackhawks would play the Boston Bruins and Bedard would score his first NHL goal in a 3–1 loss. On January 4, 2024, Bedard was named to the 2024 National Hockey League All-Star Game, becoming the youngest selection in NHL history. However, Bedard would be injured with a broken jaw after being hit by Brendan Smith during a game against the New Jersey Devils the next day. ==References== == Other websites == * Category:2005 births Category:Living people Category:Canadian ice hockey centres Category:Chicago Blackhawks players Category:Ice hockey people from Vancouver Category:Regina Pats players",
 "title": "Connor Bedard"
}