{
 "id": "1076192",
 "text": "Alexander Douglas Kerfoot (born August 11, 1994) is a Canadian professional ice hockey centre. He currently plays for the Utah Hockey Club of the National Hockey League (NHL). He has also played for the Colorado Avalanche, Toronto Maple Leafs, and Arizona Coyotes. ==Career== Before playing in the NHL, Kerfoot played parts of 3 seasons with the Coquitlam Express of the British Columbia Hockey League (BCHL) and four years at Harvard with the Crimson. During his time with the Express, Kerfoot would win the Bob Fenton Trophy as the most sportsmanlike player in the league. He would also be named to the All-Rookie and All-Star teams. While playing with Harvard, Kerfoot would be named to the Second All-Ivy Team and earned a spot in the ECAC Third All-Star Team after recording 30 assists in his 2015–16 junior year. He was drafted 150th overall by the New Jersey Devils in the 2012 NHL Entry Draft. Kerfoot decided not to play for them and instead play at Harvard. After his time at Harvard was done, he became a free agent. On August 23, 2017, Kerfoot signed a two-year; entry level contract with the Colorado Avalanche. On October 5, Kerfoot made his NHL debut. He would also record his first NHL point in the same game when assisted on a Tyson Barrie goal in a 4-2 win against the New York Rangers. On October 11, he would score his first NHL goal in a 6-3 season opening win against the Boston Bruins. On July 1, 2019, the Avalanche would trade Kerfoot, Tyson Barrie and a sixth-round pick to the Toronto Maple Leafs for Nazem Kadri, Calle Rosén and a third-round pick. He would sign a four- year, $14 million contract with the Maple Leafs three days later. He would play four seasons with them. On July 1, 2023, Kerfoot signed a two-year, $7 million contract with the Arizona Coyotes as a free agent. After the 2023–24 regular season ended, the Arizona Coyotes would be suspended and the team moved to Utah to become the Utah Hockey Club. Kerfoot would move along with the team. ==References== == Other websites == * Category:1994 births Category:Living people Category:Arizona Coyotes players Category:Canadian ice hockey centres Category:Colorado Avalanche players Category:Harvard University alumni Category:Ice hockey people from Vancouver Category:Toronto Maple Leafs players Category:Utah Hockey Club players",
 "title": "Alexander Kerfoot"
}