{
 "id": "1076616",
 "text": "Adam Lowry (born March 29, 1993) is an American-born Canadian professional ice hockey centre. He currently plays for the Winnipeg Jets of the National Hockey League (NHL). He is also the current captain of the Jets. ==Career== Before playing in the NHL, Lowry played parts of 4 seasons with the Swift Current Broncos of the Western Hockey League (WHL). In his rookie year, Lowry would win the Daryl K. (Doc) Seaman Trophy in his rookie season for the most player of the year. He would miss a portion of the second season when he was out sick with mononucleosis. On May 1, 2013, Lowry was name as the WHL Player of the Year. He was drafted 67th overall by the Winnipeg Jets in the 2011 NHL Entry Draft. On April 4, 2013, Lowry would sign a professional tryout contract with the Jets' AHL farm team St. John's IceCaps. He would play 6 games with the IceCaps. On April 16, 2013, Lowry would sign a contract to join the Winnipeg Jets. The Jets would send him back to St. John's. Lowry would help the IceCaps make it to the 2014 Calder Cup Finals. In the finals, the Texas Stars would sweep them to win the championship. On October 15, 2013, Lowry would make his NHL debut in a 4–2 loss to the Phoenix Coyotes. On October 21, he would score his first goal in the NHL in a 3–1 win against the Carolina Hurricanes. On July 14, 2016, Lowry would sign a two-year, one-way contract to remain with the Jets. The next season, Lowry would lead the league in defensive zone face- offs with 159. He would end the season by scoring a career-high 15 goals and 14 assists. Lowry's 2017–18 season would be full of injuries. He would be in and out of the lineup throughout the season with 4 injuries. Lowry would be a major player in the Jets playoff run in 2018. He would help them make it to their first ever Western Conference Final where they would eventually lose to the Vegas Golden Knights four games to one. On July 12, 2018, Lowry would sign a three-year, $8.75 million contract extension with the Jets. On September 12, 2023, the Winnipeg Jets announced that Lowry would become the team's captain. ==Personal life== Lowry's father Dave was also a professional ice hockey player. Adam was born in St. Louis when his father played for the St. Louis Blues. He would grow up in Calgary, Alberta when his father was the captain of the Calgary Flames. ==References== == Other websites == * Category:1993 births Category:Living people Category:Canadian ice hockey left wingers Category:Manitoba Moose players Category:Sportspeople from St. Louis, Missouri Category:St. John's IceCaps players Category:Swift Current Broncos players Category:Winnipeg Jets players",
 "title": "Adam Lowry"
}