{
 "id": "1076161",
 "text": "Lamar Bonaparte Sr. (born July 31, 1976) is an American restaurateur. He is best known for his partnership with his wife Leva Bonaparte. == Early life == Lamar Bonaparte Jr. was born in Charleston, South Carolina on July 31, 1976\\. He is the son of Lamar Bonaparte Sr. and Cynthia Bonaparte. Bonaparte graduated from South Carolina State University with his degree in accounting. == Career == === Businesses === Bonaparte has been working in the hospitality industry since, at least, 2000. Bonaparte founded Republic Development and Management Group (DMG), a marketing and event management firm, in 2011. === Restaurants, bars and clubs === Bonaparte and his wife own five restaurants, bars and clubs in the Charleston area. Bonaparte made his debut as a restaurateur when he opened Republic Garden & Lounge in the spring of 2013. He opened his second establishment, Bourbon N' Bubbles, on November 29, 2018. He opened his third establishment, 1st Place, on October 20, 2020. He opened his fourth establishment, Mesu, on September 25, 2019; he co-owns the restaurant with Craig Conover. Bonaparte opened his fifth establishment, Lamar's Sporting Club, on August 25, 2023. === Television === Bonaparte made his television debut during a 2020 episode of the Bravo reality television series Southern Charm. He has made four appearances. Bonaparte has served as an executive producer on a spin-off from Southern Charm, Southern Hospitality, since November 28, 2022. The series follows his wife and the staff of their Charleston nightclub, Republic Garden & Lounge. == Personal life == Bonaparte married Leva Nowroozyani on April 25, 2013\\. The couple met on her 29th birthday. Their only child, Lamar \"Little\" Bonaparte Jr., was born on January 29, 2018. == Filmography == Year Title Notes Ref. 2020–2022 Southern Charm 4 episodes 2022–present Southern Hospitality 2 episodes; also executive producer- 9 episodes == References == Category:1976 births Category:Living people Category:Businesspeople from Charleston, South Carolina",
 "title": "Lamar Bonaparte"
}