{
 "id": "1076681",
 "text": "The Gold Coast theme parks is a term that refers to the five big amusement parks on Queensland's Gold Coast. The five parks are all popular tourist attractions, attracting many visitors from all around the world each year. They are all among the most visited theme parks in Australia. The parks have been compared to the Disney theme parks in the Northern Hemisphere (called Disneylands). There are currently no Disneylands in the Southern Hemisphere. ==Theme parks== Name Suburb Type Owner Notes Dreamworld Coomera Theme park, zoo Dreamworld Dreamworld is the largest theme park in Australia. Sea World Main Beach Marine mammal park, oceanarium, theme park Village Roadshow Theme Parks Despite the name, the Sea World on the Gold Coast is not related to the American theme park chain known as SeaWorld, which operates four parks: three in the United States (in Orlando, San Antonio and San Diego) and one in the United Arab Emirates (in Abu Dhabi). Warner Bros. Movie World Oxenford Theme park Village Roadshow Theme Parks Warner Bros. operates three theme parks around the world, with the Gold Coast park (Movie World) being the oldest. The other parks are Parque Warner in Madrid and Warner Bros. Movie World in Abu Dhabi. Wet'n'Wild Gold Coast Oxenford Waterpark Village Roadshow Theme Parks The Wet'n'Wild brand is currently used by four waterparks worldwide (one each in Australia, Canada, China and the United States), with the one on the Gold Coast being the original one. The other parks are located in Haikou, Hawaii and Toronto. Four theme parks in the United States used to use the brand, but all of them have since been rebranded. Similarly, the Wet'n'Wild waterpark in Sydney, which opened in 2013, was rebranded to become Raging Waters Sydney in 2018. WhiteWater World Coomera Waterpark Dreamworld WhiteWater World is owned by Dreamworld, but is a seperate park. ==Proposed theme parks== ===Disneyland Gold Coast=== In the 1990s, it was proposed that a Disneyland theme park would be opened on the Gold Coast, the first in the Southern Hemisphere.https://www.couriermail.com.au/news/queensland/could-any-of- these-10-queensland-grand-plans-be-revived-including-gold-coast-disneyland-or- the-brisbane-skypoint/news- story/d0dc58ea3047dc8c44f8445aef735c56?amp&nk;=d14d5e12797d28971e36ad78e5988e5f-1705289556 However, Disney eventually cancelled the plan decided to focus on building a Disneyland in Hong Kong instead. The Hong Kong Disneyland opened in 2005.https://www.bosshunting.com.au/travel/things-to-do/disneyland-australia/ ==Gallery== File:Dreamworld Globe October 2020.jpg|Dreamworld File:Warner Bros Movie World - panoramio (5).jpg|Movie World File:Sea world australia.jpg|Sea World File:Wetnwild-entrance.JPG|Wet'n'Wild File:Super Tubes Hydrocoaster and The Green Room at WhiteWater World.jpg|WhiteWater World ==References==",
 "title": "Gold Coast theme parks"
}