{
 "id": "1077416",
 "text": "Caillou ( ; , stylized in lowercase) is an animated educational children's television series. Based on the books by Hélène Desputeaux, it focuses on a four-year-old boy named Caillou who is fascinated by the world around him. The series was produced in Canada by CINAR (later Cookie Jar Entertainment) while the fifth, and final season was produced in association with the South African studio Clockwork Zoo. The series is being followed by a computer-animated reboot series since 2024, set to premiere on Peacock with 50 11-minute episodes. ==Plot== Caillou lives in Montreal, Quebec, with his mother Doris, father Boris, and sister Rosie. He has many adventures with his family and friends, and uses his imagination in every episode. On PBS Kids, each episode in first through third series has a theme and is divided into several short sections that mix animation, puppet skits, and video of live-action children in real-life situations. Between seasons 4 and 6, the episodes are divided into three short sections, the puppet segment was dropped, alongside the \"Real Kids\" version of the segment. During the first season, many of the stories in the animated version began with a grandmother (who is also the series narrator) introducing the story to her grandchildren, then reading the story from a book. Starting in the second season, the narrator and grandmother is an unseen character. ==Characters== ===Major characters=== ====Caillou==== Caillou (voiced by Bryn McAuley in 1997, then Jaclyn Linetsky in 2000 until 2002, and then, due to Linetsky's death, Annie Bovaird from 2003 to 2011) meaning pebble or stone in French, (nicknamed by himself The Prince of Imagination), is the title character of the show. Caillou was first shown in the episode \"Caillou Makes Cookies\", which aired on September 15, 1997. Caillou is an imaginative four-year-old boy with a love for forms of transportive machinery such as rocket ships and airplanes. A dreamer, Caillou is inclined to frequent dream sequences in some episodes, visualizing his daydreams and wishes, and many episodes describe his normal daily experiences with his parents, friends, and neighbours. Caillou particularly loves his stuffed dinosaur, Rexy, and teddy bear, Teddy, along with his pet cat Gilbert, all of whom are depicted as puppets in segments featured in the earlier episodes. He is Boris and Doris's son as well as Rosie's older brother. ====Caillou's family==== * Rosie (French name: Mousseline) – Caillou's lively younger sister and Boris and Doris's daughter who is a typical toddler. She is two years old. She always wants to take part in the same activities as Caillou. In later seasons of the series, she becomes more talkative and independent. She wears a blue dress, red socks and blue Mary Jane shoes. Rosie fights with Caillou for some reasons, but they still love each other. She appears to be the only family member with orange hair. Rosie was first voiced by Brigid Tierney from 1997 to 2001, then Jesse Vinet from 2002 to 2011. * Doris/Mommy – Caillou and Rosie's mother as well as Boris's wife and Grandma and Grandpa's daughter-in-law. She is a busy homemaker most of the time but is seen to work in an office, as well. Caillou occasionally helps his mother with different chores, and she often takes time to involve Caillou and his friends in activities such as crafts and baking. She is predominantly dressed in a red blouse with white trim, blue headband, ankle-length blue jeans and blue shoes with green soles. Voiced by Jennifer Seguin. * Boris/Daddy – Caillou and Rosie's father as well as Doris's husband. He wears a green sweater with a red trim with blue jeans. In the episode \"Caillou The Chef\" he says he once worked at a restaurant and made pizza.Caillou Episode – \"Caillou the Chef\" (Season 4) He and Caillou occasionally work on projects around the house together. He is voiced by Pat Fry. * Gilbert – Caillou's pet cat. In the puppet segments, he is shown to be knowledgeable about things which are foreign to Rexy and Teddy. * Grandma – Caillou and Rosie's paternal grandmother as well as Doris's mother-in-law. Grandma is a very active lady who loves the arts and the outdoors. She passes that love onto Caillou. Grandma often comes up with creative ideas to solve Caillou's problems. She and Caillou paint and go bird-watching together. Voiced by Pauline Little. * Grandpa – Caillou and Rosie's paternal grandfather as well as Doris's father-in-law. He takes Caillou on adventures, often going on walks and riding the bus throughout the town where they reside. In the 1997 episode \"Caillou's Hiding Place\", he showed Caillou a hidden area inside a tree in the backyard.Caillou Episode – \"Caillou's Hiding Place\" In the 1997 episode \"Caillou Goes Camping\", he and Caillou camp in the backyard. He is Daddy's father and loves to tell stories about when Caillou's father was a little boy. He wears a blue shirt. Voiced by George Morris. ====Caillou's friends and neighbours==== * Mr. Hinkle (French name: Monsieur Lajoie) – Caillou's neighbour, introduced in the 1997 episode \"Caillou's Not Afraid Anymore\". He has a gold tooth. In the episode \"Farmer for the Day\", it is stated that his first name is Paul. * Leo – A boy who started out as a bully in the 1997 episode \"Caillou at Daycare\", but quickly befriended Caillou in the same episode. They have been inseparable since. He is of Jewish faith and celebrates Hanukkah (stated in Caillou's Holiday Movie). Voiced by Jonathan Koensgen from 1997 to 2003, Vince Davies in Caillou's Holiday Movie, Ryan Tilson from 2006 until 2007, and Graeme Jokic from 2010 until 2011. * Clementine – Clementine was the first to befriend Caillou in the 1997 episode \"Caillou at Daycare\". She can get rather bossy for some reasons, but all in all she is pretty understanding. She is of African-Canadian descent. Caillou has a crush on her, as indicated in \"Caillou's Valentines\" (season 4, episode 19). She is voiced by Brigid Tierney from 1997 to 2007, and Sophie Uretsky from 2010 until 2011. * Sarah – Caillou's friend, whom he first met in the 1997 episode \"Caillou Goes Around the Block\". She is of Chinese descent and celebrates Chinese New Year. She has a cousin in an episode where she invites Caillou to celebrate Chinese New Year. In another she invites him to school for \"Bring Your Younger Siblings to School Day\" because she has no siblings. Sarah has a pet cat named Olly and a dog named Murphy. Sarah is voiced by Melissa Pirrera, and then Amanda Tilson. * André – A orange-headed boy, André is introduced in the 1997 episode \"Caillou's Big Friend\" and usually wears red sandals. According to the song \"Days of the Week\", released on the Caillou music CD Caillou and Friends, Caillou plays with him every Saturday. André enjoys biking and soccer. * Julie – Caillou's and Rosie's teenage babysitter. She has blonde hair in a ponytail, and enjoys playing with Caillou and Rosie. Voiced by Holly Gauthier-Frankel. * Jason and Jeffrey – Identical twin brothers who are of Hispanic descent. They both enjoy eating pizza. Initially, they wore identical clothes. By Season 4, though, Jason began wearing a shirt with inverted colours so it's easier to tell them apart. They are both in Caillou's playschool class. The first episode they appeared in \"New Kids on the Block\". * Billy – Clementine's older brother. He is usually seen playing in a band with his friends or playing sports. Voiced by Michael Caloz in Season 1. * Miss Martin – Caillou's preschool teacher. She has orange hair and wears red overalls with a long-sleeved white shirt. According to the 2006 episode \"A Surprise for Ms. Martin\" her birthday is in June. Her first name is Ann; this was stated in \"Caillou Goes to Daycare\". Voiced by Ellen David. * Jonas – Boris friend from before he met Doris. He lives on a ranch and has a horse named Lucky. Jonas appears in four episodes and in Caillou's Holiday Movie. Voiced by Brian Wrench. * Emma – A girl in Caillou's playschool class who dislikes loud noises, wearing red.Caillou Episode – \"Caillou's Marching Band\" It is stated in an episode that she has Type 1 Diabetes. * Xavier – A boy in Caillou's playschool class who has brown hair and wears blue overalls. ====The puppets==== The puppet segments were used only on the PBS Kids broadcasts of Caillou from 2000 to 2003 between the first and third seasons, as continuity to fill time usually taken up by commercial breaks during the original broadcasts; later episodes on PBS did not include the puppet segment continuity. * Gilbert – Caillou's pet cat. He has greyish-bluish fur with black stripes and loathes dogs with a passion. He especially dislikes the bulldog in the neighbourhood. In the puppet segments of the series, Gilbert often consists odes. Puppeteered by Bob Stutt. * Rexy – Caillou's blue toy dinosaur and speaks in a somewhat foreign accent, he is very playful. Rexy has the incapability to give a \"good\" hug. Rexy is noted for being rather pedantic. He is often teased about his speech impediment, and tends to react violently to any mention of it. Puppeteered by Pier Parquette and voiced by Rick Jones. * Teddy – An old teddy bear that once belonged to Caillou's father, and now belongs to Caillou, Teddy is reasonable and nice. He is somewhat pessimistic, but all in all, he just needs a hug. Puppeteered by Frank Meschkuleit. * Deedee – A brown squirrel, she has a bushy tail, and is often seen playing with Rexy. Deedee first appeared as a baby squirrel when Rexy found on the ground lost from her family. Deedee lives in Caillou's backyard where most of the puppet segments take place. She never appeared in Season 3. Puppeteered by Wendy Welch and voiced by Holly Gauthier-Frankel. ==Episodes== ===Original series=== ===PBS series=== ==Production== Caillou books have been published by Chouette Publishing Inc. since 1987. The series was originally broadcast in French in Canada, and the episodes were later translated into English. The original books were also in French, and English. Caillou was designed primarily for toddlers. It was created by child developmental psychologists. On September 15, 1997, 13 30-minute episodes (65 5-minute segments) of Caillou were aired in Canada and in selected markets worldwide, including the United States. On August 23, 2000, there were 20 30-minute episodes of the series, containing a mixture of new stories. On September 4, 2000, there were 29 30-minute episodes of the series, containing a mixture of the five-minute episodes plus new stories, songs, real kids segments and puppets. These were followed by another 11 30-minute episodes containing a mixture of the five-minute episodes plus new stories, songs, real kids segments, and puppets on October 3, 2000, another 13 30-minute episodes containing all-new stories on January 12, 2002, and another 16 30-minute episodes containing all-new stories on January 2, 2003. The film Caillou's Holiday Movie was released on October 7, 2003. On January 13, 2006, and April 1, 2006, a new set of 20 30-minute episodes finally premiered after a three-year hiatus. Caillou started attending preschool and there were new themes and a new opening. The series was renewed for a first, and second season in 2000, and a third season in 2003, and later a fourth season in 2006, and a fifth season in 2013. The fifth season was animated by South Africa-based studio Clockwork Zoo. \"Clockwork Zoo begins key animation on Caillou | Animation SA\" On November 14, 2012, the fourth season of the series was pre-sold to PBS Kids in the United States. ==Reception and controversy== ===Critical response=== Caillou initially received generally positive reviews from television critics and parents of young children. The staff of Entertainment Weekly wrote that its protagonist \"embellish[es] everything he sees with his rich imagination.\" The New York Times wrote \"Caillou looks at the world through the eyes of its 4-year-old namesake [and] takes life's not-always-so-simple lessons and presents them in a way preschoolers can understand.\" while Lynne Heffley of the Los Angeles Times wrote that \"each animated episode is an unusually realistic reflection of a preschooler's daily fun, family interaction, challenges, disappointments and misunderstandings as Caillou grows and learns to make sense of his world\", also describing it as \"a virtual guidebook for parents and caregivers\". ====Controversy==== As the years progressed, however, the show drew criticism for the perceived incorrectness of the lessons gleaned through numerous events, mostly from the first season, as well as some episodes from the second season and third season. In a National Post column, writer Tristin Hopper identified Caillou to be \"quite possibly the world's most universally reviled children's program\". A common criticism towards the series is that the titular character behaves like a spoiled child and suffers no consequences from his parents for his behaviour. One example of Caillou's bad behaviour is in the episode Caillou Joins the Circus, in which he throws a tantrum after discovering the postponement of a planned circus event. Another episode, Big Brother Caillou, features Caillou being jealous of the level of attention received by his baby sister Rosie to the point where he pinches her; most considered this to be a minor improvement over the original book the episode was based on, in which Caillou bit Rosie. When the series started airing on Cartoonito in 2021, the pinching scene was cut out. Hopper once said: \"Unlike most children's programming, Caillou makes almost no attempt to educate its young audience. There are no veiled math problems, spelling lessons or morality tales; it's just calm, non-threatening, bright-coloured people navigating everyday tasks\". These criticisms of the series's titular character have been echoed on online platforms. Last Week Tonight host John Oliver referenced Caillou in a comparison of boring things against net neutrality, going on to insult Caillou for its themes. As Caillou appeared as a much younger child in the original line of children's books, he originally had no hair. When illustrators found that adding hair made him look unrecognizable, it was decided that Caillou would never have hair. This decision led to an internet meme asserting that the protagonist has cancer or pediatric alopecia. ==Broadcast== Caillou first aired on Canada's French-language Télétoon channel on September 15, 1997, and was the first series aired on the English-language Teletoon when it launched on October 17 of that year. The series was moved to Treehouse TV in 2010. Caillou made its U.S. debut on PBS Kids on September 4, 2000, and ran on that network until December 27, 2020. Reruns started airing on PBS Kids Sprout (later known as simply Sprout) on its launch on September 26, 2005. While Sprout rebranded into Universal Kids on September 9, 2017, the show remained on the channel until it was taken off the line-up at the beginning of April 2019. On January 5, 2021, PBS Kids announced on Twitter that they would no longer broadcast reruns of Caillou. Deadline Hollywood reported that many parents and viewers celebrated the news of the cancellation, as they have complained that Caillou had taught their kids bad lessons and encouraged them to be bratty and whiny. On August 16, 2021, it was announced that Cartoon Network had acquired the U.S.-broadcast rights to the series after PBS' rights expired, with reruns of the series airing on Cartoonito from September 13, 2021 to May 4, 2022 in its HD remastered form. PBS ultimately sold the rights for US$6.4 million. In Canada, Family Jr. continues to broadcast reruns since February 5, 2018. PBS Kids currently retains the physical media and streaming rights for the original series. Comcast/NBCUniversal acquired global streaming rights for the reboot series (via Peacock) as of 2022. == Home video releases == In the United States, Caillou videocassettes and DVDs have been released by PBS Distribution (originally distributed through Warner Home Video until 2004, and then Paramount Home Entertainment from 2006 to 2010, and now self-distributed). From 2003 to 2006, the DVDs with puppets and Jaclyn Linetsky were compilations from 2003 through 2006, and one of them is in memory of Linetsky herself. For the franchise's 25th anniversary, a DVD/book combo pack reissue of Caillou's Family Favourites was released on October 14, 2014, by PBS Distribution, while a DVD reissue of Caillou's Holiday Movie was released on November 11, 2014 by NCircle Entertainment. In Canada, Sony Wonder originally released Caillou on VHS and DVD, and after the closure of the division by Sony, were moved to Vivendi Entertainment Canada. Since 2012, Caillou DVDs are distributed by Entertainment One and after their purchase of Phase 4 Films in 2015, are released through the KaBoom Entertainment label. ==Music from the series== In 2003, an album titled Caillou's Favourite Songs was released by Kid Rhino under the Cinar Music imprint. ==Revival== ===YouTube series=== Beginning in late 2016, a new Caillou web series for YouTube premiered on the official Caillou channel and was later released onto Amazon Prime. These shorts are mainly remakes of older episodes and are produced by WildBrain Spark Studios, a subsidiary of WildBrain that produces original content for their WildBrain Spark network. However, the videos were not made available to YouTube users in the United States until 2021. In August 2021, it was announced that Cartoon Network licensed the series for broadcast on U.S. television. ===Reboot and specials=== In September 2021, WildBrain announced the production of five new 45-minute specials based on the franchise for Family Jr. These specials are the first Caillou related media to be produced in computer animation, and will focus on Christmas, Halloween, Family Day, Summer Vacation and National Anti-Bullying Day. The specials will be produced by WildBrain Studios, Splash Entertainment, and Mainframe Studios, with animation provided by IoM Media Ventures. In June 2022, WildBrain announced they teamed with Comcast's streaming platform, Peacock, to produce a new series of the show, consisting of 52 11-minute episodes to go along with those specials. It was set to premiere in 2023, with IoM also providing animation production as the specials are. Despite the specials being released on Peacock, it is now confirmed to stream on February 15, 2024. The first special: Rosie the Giant, which focuses on the effects of bullying, simultaneously premiered in Canada and the United States on Family Jr. and Peacock respectively on July 10, 2022. The second special: Adventures with Grandma and Grandpa, which focuses on Caillou visiting his grandparents for a sleepover at their beach house, premiered on Family Jr., and Peacock on August 25, 2022. The third special: The Bravest Wolf Boy, which focuses on Halloween, premiered on Family Jr., and Peacock on October 15, 2022. The four special: The Silver Knight, which focuses on imaginative play, premiered on Family Jr., and Peacock on November 13, 2022. The fifth special, Caillou's Perfect Christmas, which focuses on Christmas, premiered on Family Jr., and Peacock on December 2, 2022. ==Notes== ==References== ==External links== Category:1990s animated television series Category:1990s Canadian animated television series Category:1990s Canadian children's television series Category:1990s Canadian television series Category:1990s Canadian television series debuts Category:1990s children's television series Category:1997 Canadian television series debuts Category:1997 television series debuts Category:2000s American animated television series Category:2000s American children's television series Category:2000s American television series Category:2000s animated television series Category:2000s Canadian animated television series Category:2000s Canadian children's television series Category:2000s Canadian television series Category:2000s children's television series Category:2000 American television series debuts Category:2010s American animated television series Category:2010s American children's television series Category:2010s American television series Category:2010s animated television series Category:2010s Canadian animated television series Category:2010s Canadian children's television series Category:2010s Canadian television series Category:2010s children's television series Category:2011 Canadian television series endings Category:2013 American television series endings Category:2013 television series endings Category:American animated television series Category:American children's television series Category:American television series Category:Animated television series Category:Canadian animated television series Category:Canadian children's television series Category:Canadian television series Category:Children's television series Category:PBS Kids shows Category:Television series about families Category:Television series about friendship Category:Television series by Cookie Jar Entertainment",
 "title": "Caillou"
}