{
 "id": "1077058",
 "text": "Austen Kroll (born June 16, 1987) is an American television personality and businessman. He is best known as a main cast member on the Bravo reality television series Southern Charm. Kroll is also known as a guest cast member on the Bravo reality television series Summer House and as a former main cast member on the spin-off Winter House. == Early life == Austen Kroll was born in Washington, D.C. on June 16, 1987, as the middle child and only son to Tom Kroll and Wendy Kroll. He has a younger sister. Kroll's elder sister, Kyle A. Kroll, died on August 18, 1994, at the age of nine, after she fell approximately 200 feet from a cliff while on a family hike at Chimney Rock Park in North Carolina. He spoke about his sisters death on an episode of Southern Charm. === Education === Kroll graduated from the University of Alabama with his Bachelor of Science degree in business administration and management in 2010. He was a member of the Kappa Sigma fraternity. He spent a semester studying in Prague. == Career == Kroll previously worked as a territory sales manager at Red Hare Brewing Company and as a cellar man at Palmetto Brewing Company. === Television === Kroll made his television debut on the Bravo reality television series Southern Charm as a main cast member from the fourth season. The fourth season was launched on April 3, 2017. Kroll has appeared on Summer House in a guest capacity since the fourth season. The fourth season was launched on February 5, 2020. Kroll appeared as a main cast member on a spin-off from Summer House, Winter House, for the first two seasons. The first season was launched on October 20, 2021. The second season was launched on October 13, 2022. === Beverages === Kroll launched his beer Trop Hop with King's Calling Brewing Co. on July 26, 2019. He launched two new flavors at the end of 2021. === Podcast === Kroll and Conover launched their Pillows and Beer podcast on January 28, 2021. They toured from November 7, 2023, to February 1, 2024. === Restaurants === Kroll partnered with his Southern Charm co-star Craig Conover, Chris Maier, Philip Testa, and Jordan Andino as co-owners of Carriage House, in New York City. The restaurant opened on March 29, 2023. Kroll and Conover partnered with Uptown Hospitality Group as co-owners of By the Way. == Personal life == Kroll resides in downtown Charleston. == Filmography == Year Title Notes Ref. 2017–present Southern Charm 81 episodes 2018–2023 Watch What Happens Live! with Andy Cohen 9 episodes 2020–2022 Summer House 6 episodes 2021–2022 Winter House 14 episodes == References == Category:1987 births Category:Living people Category:American television personalities",
 "title": "Austen Kroll"
}