{
 "id": "1077992",
 "text": "Wyatt's Rebellion in early 1554 was an unsuccessful uprising in England. The key insurgents were Sir Thomas Wyatt, Sir James Croft, Sir Peter Carew, and Henry Grey, Duke of Suffolk. The rebellion failed, resulting in various consequences for the rebels, ranging from death to forgiveness. == Causes == Wyatt's Rebellion had various political and religious causes. At the time, Queen Mary I had plans to marry Philip II of Spain. Mary's marriage to Philip was a focal point of the rebellion. The rebels worried that after the foreign marriage, Spain would interfere in England's affairs, and England would become a mere province of the Habsburg Empire. For these reasons - and because they remembered the cruelty of the Spanish Inquisition - the landowning gentry and parliamentary classes opposed the marriage. Additionally, the rebels opposed Mary's Roman Catholicism. She worked hard to return England to Roman Catholicism and place the country under the Pope's authority. This fueled discontent among English Protestants. France also opposed the alliance between England and Spain. This increased anti-Spanish feelings in London, and led to threats of war. The rebellion served as an outlet for the frustrations of the working class. It allowed farmers and urban workers to express social and economic grievances. The conspirators had various motivations. Wyatt initially supported Mary; however, he opposed her marriage to Philip. He worried about foreign influence on England, and whether Mary would successfully establish Roman Catholicism in the country. Other conspirators had diverse motivations, including political considerations, religious beliefs, and fears for their careers. == Plan == The rebels planned to raise forces in different counties to come together in London. They intended to replace Mary with her half-sister Elizabeth, who would then marry Edward Courtenay. The plan also included a questionable element involving a girl named Elizabeth Croft pretending to be a spirit denouncing Mary and Philip. == Outcome == The rebellion started prematurely, rumors about it spread, and its leaders faced challenges and betrayals. Sir Thomas Wyatt persevered initially. However, Mary gained support. Wyatt and other key conspirators, such as Sir Peter Carew and Edward Courtenay, were arrested. Some participants, including Carew, fled to France. After the leaders of the rebellion were arrested or surrendered, the uprising failed. In the rebellion's aftermath, participants were variously imprisoned, executed, or pardoned. == Significance == During the 16th century in England, there was a complex relationship between religion and politics. Wyatt's Rebellion was a significant event in this relationship. Category:1554 Category:16th century in England",
 "title": "Wyatt's rebellion"
}