{
 "id": "1077114",
 "text": "William Shepard \"Shep\" Rose III (born September 27, 1979) is an American television personality and businessman. He is best known as a main cast member on the Bravo reality television series Southern Charm and the spin-off RelationShep. == Early life == William Shepard Rose III was born in Cincinnati, Ohio, but most sources incorrectly report Hilton Head Island, South Carolina as his birthplace. He was born September 27, 1979, although most sources incorrectly report 1980. He was the second to be born out of three children, to his parents to William Shepard \"Rip\" Rose Jr., a lawyer of the United States Department of Justice, and Frances John Rose. He has an elder sister, Katherine Cummings Trotter, a younger brother, Whitaker Boykin Rose. His family moved to Sea Pines, Hilton Head Island, South Carolina in 1981, when he was two years old. == Education == Rose went to Hilton Head Preparatory School, a private school, and Episcopal High School, a private college-preparatory boarding school in Alexandria, Virginia. Rose graduated from the University of Georgia with his undergraduate degree in business in the year 2002. He was a member of the Chi Phi (ΧΦ) fraternity. He graduated from Vanderbilt University Owen Graduate School of Management with his Master of Business Administration degree in the major of finance in 2009. ==Career== Rose started his career in his early twenties, working as a real estate agent when he was living in Dubai. He was forced to quit in 2008, during the Great Recession. ===Television=== Rose started his television work on the Bravo reality television series Southern Charm as a main cast member from the first season. The first season started on March 3, 2014. His first appearance was with his Southern Charm co-stars Cameran Eubanks and Thomas Ravenel, and went on tv on April 7, 2014. Rose appeared on the web series Shepic Fail. The series is about Rose, his Southern Charm co-star Craig Conover and Hunter Gardner. The series started on November 23, 2014. The third spin-off from Southern Charm, RelationShep, is also about Rose. ===Businesses=== Rose is the owner of The Commodore, a bar and grill in Charleston, South Carolina. The restaurant opened on April 27, 2016. He is also a co-owner of two establishments: The Palace Hotel and The Alley, both in Charleston. Rose and his friends Jason Benjamin and Claude Pope started the coastal wear line, Shep Gear, on June 30, 2016. He started a line of t-shirts inspired by some of his Southern Charm co-stars. ===Acting=== Rose started acting with the role of Paramedic #2 in the action-thriller film Reprisal, starring Bruce Willis and Olivia Culpo. The film was released on August 30, 2018. ===Other ventures=== Rose started a podcast, Enough About Me with Shep Rose, on June 1, 2019. The podcast stopped on October 9, 2019. Rose started a blog, Charleston GRIT. Rose became a stand-up comedian on April 23, 2018. Rose wrote a book about himself: Average Expectations: Lessons in Lowering the Bar. Simon & Schuster published the book on March 16, 2021. == Personal life == Rose lives in Isle of Palms, South Carolina. Rose was the announcer for the Charleston RiverDogs at a baseball game on May 1, 2018. Rose is a member of the Union Club of the City of New York's Jupiter Island Club, a private social club in Jupiter Island, Florida. === Relationships === Rose was in a short relationship with Danni Baird, before their castings on Southern Charm. He was linked to Chelsea Meissner in 2016. Rose was in a relationship with orthodontics assistant Taylor Ann Green between March 2020 and July 2022. === Politics === Rose endorsed Republican candidate John McCain in the 2008 United States presidential election. He endorsed Libertarian candidate Governor Gary Johnson in the 2016 United States presidential election. He endorsed Democratic candidate Joe Biden and South Carolina Democratic candidate Jaime Harrison in the 2020 United States presidential election. Rose shut down the 19th Treasurer of South Carolina and his former Southern Charm co-star Thomas Ravenel via Twitter in October 2020, after Ravenel's public support of the 45th President of the United States Donald Trump. He has called Trump supporters \"rats [who] stayed on the ship\". == Philanthropy == Rose is the founder of a charitable trust. He donates to numerous charities every December. Rose supported the David M. Carmines Memorial Foundation in 2017. The organization was started in memory of his childhood best friend Andrew Carmines' brother who died by cancer in 2001. Rose raised for the people of the Bahamas after Hurricane Dorian in 2019. == Controversies == Rose was arrested over 10 times. Rose faced criticism in August 2019, after he posted a video to his Instagram Stories in which he could be heard mocking a homeless woman who was collecting cans on the street in East Village, Manhattan. At first, he did not want to say sorry, but he did four days later. He also deactivated his Twitter account and took a break from the social media platform. == Filmography == === As himself === Year Title Notes Ref. 2014–present Southern Charm 130 episodes 2014–2018; 2021–2023 Watch What Happens Live! with Andy Cohen 15 episodes 2014 Shepic Fail 4 episodes 2017 Then and Now with Andy Cohen 1 episode 2017–2018 RelationShep 6 episodes 2018 Pickler & Ben 1 episode 2019 Enough About Me with Shep Rose Host; 10 episodes 2020 Vanderpump Rules 1 episode 2020 Summer House 2 episodes 2021 Good Morning America 1 episode 2021 Home & Family 1 episode 2023 Southern Hospitality 1 episode 2023 New York Live 1 episode 2023 BravoCon Live with Andy Cohen 2 episodes === As an actor === Year Title Role Notes Ref. 2018 Reprisal Mike Williams (Paramedic #2) == References == Category:1979 births Category:Businesspeople from Cincinnati Category:American television personalities Category:Living people Category:Entertainers from Ohio",
 "title": "Shep Rose"
}