{
 "id": "107799",
 "text": "The Moon is Earth's only natural satellite (the only object which orbits the Earth and is not man-made). It is usually visible in the night sky, but is sometimes seen during the day. The Moon is about one-fourth of the width of Earth. Because it is so far away it looks small in the sky, about half a degree wide. The gravity on the Moon is one-sixth of the Earth's gravity.The acceleration due to gravity on the Moon is 1.62 m/s2. This is approximately 1/6 of the acceleration due to gravity on Earth, which is 9.81 m/s2. It means that an object will be one-sixth as heavy on the Moon compared to Earth. The Moon is a rocky and dusty place. It moves slowly away from the Earth at a rate of 3.8 centimeters per year due to the effect of tidal dissipation. Some other planets also have moons or natural satellites. The giant impact hypothesis is a common explanation for how the Moon formed. == Origin == The giant impact hypothesis is the most common theory among scientists to explain how the Moon formed. According to this hypothesis, Earth collided with a Mars-sized proto- planet around 4.5 billion years ago, and the debris from the collision created the Moon. Recent research has challenged this hypothesis. According to one article: https://scitechdaily.com/earth-forged-the-moon-surprising-new- evidence-challenges-old-theories/ > [N]ew findings suggest that the Moon was primarily created from material > ejected from Earth’s mantle, with minimal contribution from [the proto- > planet]. == Characteristics == === Gravity === Because it is smaller, the Moon has only 1/6 of the gravity on Earth. So if a person weighs 60 kilograms on Earth, the person would only weigh 10 kilograms on the Moon.Kilograms are technically a unit of mass, but they are often used as a unit of weight. If a person goes to the Moon, their mass will not change, but their weight will change. Even though the Moon's gravity is weaker than the Earth's gravity, it is still there. If a person dropped a ball while standing on the Moon, it would still fall down. However, it would fall much more slowly. A person who jumped as high as possible on the Moon would jump higher than on Earth, but still fall back to the ground. Because the Moon has no atmosphere, there is no air resistance, so a feather will fall as fast as a hammer. === Atmosphere === ==== Heat & cold ==== Without an atmosphere, the Moon's environment is not protected from heat or cold. Astronauts wore spacesuits to survive and carried oxygen to breathe. These suits weighed about as much as the astronauts (though they were not as heavy as on Earth because of the Moon's weak gravity). The astronauts never took their gloves or spacesuits off on the Moon. ==== Light ==== On the Earth, the sky is blue because the Sun's blue rays bounce off the gases in the atmosphere. This makes it look like blue light is coming from the sky. On the Moon, there is no atmosphere for light to bounce off. This means the sky looks black, even in the daytime. ==== Craters ==== Earth's atmosphere causes most meteorites (space rocks) to burn up. The Moon does not have this protection. Meteorites crash into it and create wide, shallow holes called craters. The Moon has thousands of them. Newer craters overlie older ones. === Water === In 2009 Chandrayaan-1, India's first lunar exploration mission, found a lot of water on the Moon. However, the water is not liquid; it is in the form of hydrates and hydroxides. Liquid water cannot exist on the Moon because photodissociation quickly breaks down the molecules. However, based on the data received from Chandrayaan-1, liquid surface water may have once existed on the Moon. == Phases == Because the Moon is round, half of it is lit up by the Sun. As it goes around (or orbits) the Earth, sometimes the side that people on Earth can see is all lit brightly. Other times only a small part of the side we see is lit. This is because the Moon does not send out its own light. People only see the parts that are being lit the eclipse by the sunlight. These different stages are called Phases of the Moon. It takes the Moon about a month (29 days, 12 hours, and 44 minutes) to complete the cycle, from big and bright to small and dim and back to big and bright. People throughout history have used the Moon's cycles to measure time. The phases of the Moon are, in order: # The \"new Moon\" (when the Moon passes between the Earth and Sun) # The \"waxing crescent\" # The \"first quarter\" # The \"waxing gibbous\" # A \"full Moon\" (when the Moon and Sun are on opposite sides of the Earth) # The \"waning gibbous\" # The \"third quarter\" # The \"waning crescent\", # A new Moon again === Tidal locking === The Moon always shows the same side to Earth. Astronomers call this phenomenon tidal locking. This means that half of it can never be seen from Earth. The side facing away from Earth is called the far side or dark side of the Moon even though the Sun does shine on it—we just never see it lit. == Exploration == === Robots === Before people stood on the Moon, the United States and the USSR sent robots to the Moon. Some of these robots orbited the Moon; others landed on its surface. The robots were the first man-made objects to touch the Moon. === The first humans === Humans finally landed on the Moon on July 21, 1969. Astronauts Neil Armstrong and Buzz Aldrin landed their lunar ship (the Eagle) on the surface of the Moon. Then, as half the world watched him on television, Armstrong climbed down the ladder of the Eagle and was the first human to touch the Moon as he said, \"That's one small step for a man, one giant leap for mankind.\" Even though their footprints were left on the Moon a long time ago, they could remain there for millions of years. There is no wind or rain on the Moon, so erosion happens extremely slowly. This means the footprints do not get filled in or smoothed out like they would on Earth. === Future landings === Ten more astronauts landed on the moon between 1969 and 1972. All were part of the United States' Apollo program. The last spaceship to land on the Moon was Apollo 17. Eugene Cernan was the last person to touch its surface. == Legal status == During the Cold War, the United States Army thought about making a military base on the Moon so they could attack targets on Earth. They also considered testing a nuclear weapon on the Moon. The United States Air Force had similar plans. However, both plans were brushed off as NASA moved from a military agency to a civilian-based one. Even though the Soviet Union left remains on the Moon, and the United States left a few flags, no country has control over the Moon. The U.S., the Soviet Union, and many other countries signed the Outer Space Treaty, which calls the Moon and all of outer space the \"province of all mankind\". This treaty also bans all use of the military on the Moon, including nuclear weapons tests and military bases. ==Timekeeping== As of 2025's first quarter, there is no time standard on the Moon. The U.S. government has suggested Coordinated Lunar Time.https://www.nettavisen.no/nyheter/nasa-vil-lage-ny-tidsstandard-pa- manen/s/5-95-2352038. Retrieved 2025-03-30 == Related pages == * Late Heavy Bombardment == References == ==More reading== * == Other websites == * The Dark Side of the Moon Category:Basic English 850 words",
 "title": "Moon"
}