{
 "id": "1077433",
 "text": "Wanda Maximoff, also known as Scarlet Witch (born 1989), is a major character in the Marvel Cinematic Universe. Based on the Marvel Comics character of the same name, she is portrayed by Elizabeth Olsen. She is a Sokovian native who was born with the power of chaos magic, but was experimented on by HYDRA alongside her twin brother Pietro, which gave her the ability of psionic manipulation. Wanting to get revenge on Tony Stark due to his weapons being used in a bombing that killed her parents, she worked with Ultron to destroy the Avengers. Once she learned of Ultron's true motives, Wanda and Pietro joined the Avengers to stop him from destroying Sokovia at the cost of her brother's life. Wanda would remain with the Avengers until the Sokovia Accords was created, and clashed with Iron Man's faction before being briefly imprisoned in the Raft. Living with her boyfriend Vision, Wanda returned to the Avengers to stop Thanos from obtaining the Infinity Stones to wipe out half of the universe. She was among the casualties of the snap, but was resurrected in 2023 by the Hulk, and assisted the Avengers in fighting Thanos. After the defeat of the mad titan, Wanda attended Stark's funeral to honor his sacrifice, but was left with grief from her personal loss of Vision. Using her chaos magic, Wanda created an idyllic life in Westview, enthralling its citizens to live peacefully with her and Vision, who she recreated from a piece of the Mind Stone. When her neighbor, Agatha Harkness, wanted to take her chaos magic, Wanda decided to stop her before ending her idyllic life to understand her powers from reading the Darkhold. Wanda has become a central character within the MCU, having appeared in six movies as of 2023. She also has a lead role in the miniseries WandaVision (2021). Alternate versions of Wanda from alternate universes appear in the animated series What If...? (2021–2024) and in the movie Doctor Strange in the Multiverse of Madness (2022): Zombie Wanda, Wanda-Merlin, and Wanda-838. Olsen's portrayal of the character has been well-received and she has earned a number of accolades for her performance, notably being nominated for a Primetime Emmy Award in 2021, and a Golden Globe Award in 2022. == Appearances == === Movie appearances === Year Movie Portrayed by 2014 Captain America: The Winter Soldier (post-credits cameo) Elizabeth Olsen 2015 Avengers: Age of Ultron 2016 Captain America: Civil War 2018 Avengers: Infinity War 2019 Avengers: Endgame 2022 Doctor Strange in the Multiverse of Madness === Television appearances === Year Television series Seasons Episodes Portrayed by 2021 WandaVision 1 9 Elizabeth Olsen 2021-2024 What If...? 3 26 * Category:Marvel Cinematic Universe characters Category:Marvel Comics movie characters",
 "title": "Wanda Maximoff (Marvel Cinematic Universe)"
}