{
 "id": "1077949",
 "text": "The Tschammer-Pokal was the predecessor of today's DFB Cup as a national cup competition in German football. It was held for the first time in 1935 and was named Tschammer Cup after the then Reichssportführer, initiator of the competition and donor of the trophy, Hans von Tschammer und Osten. The model was English football with its annual cup final. The cup was a challenge cup and was intended to become the final possession of the club that won it three times in a row or four times in total for the first time. ==History == More than 4,000 teams took part in the first Tschammer Cup. It was played from 6 January 1935 onwards. Participation was compulsory for the clubs playing in the Gauliga and District Class (the highest divisions of those years). The other clubs in the \"Reichsfachamt für Fußball\" were free to participate. The teams played preliminary rounds to take part in the final round, in which the best 64 clubs took part. The first final was FC Schalke 04 versus 1. FC Nuremberg. Nuremberg won 2-0. Schalke also made it to the final in the following two years. They reached their first victory at the third attempt versus Fortuna Düsseldorf. The club was also the first to achieve the championship and cup double. After the annexation of Austria in March 1938 , the Austrian clubs were transferred into Germans leagues. SK Rapid Wien won on 8 January 1939 versus FSV Frankfurt 3-1 in a sold-out Berlin Olympic Stadium. This was the last cup final before the Second World War. After 1. FC Nuremberg won the cup again the following year, Dresdner SC became the first team to defend their title in 1941. The last winner was in 1943 First Vienna FC. 1953 the competition started again under the name DFB-Pokal. ==Finals == 1935 1. FC Nuremberg FC Schalke 04 2-0 1936 VfB Leipzig FC Schalke 04 2-1 1937 FC Schalke 04 Fortuna Düsseldorf 2-1 1938 FSV Frankfurt SK Rapid Wien 1-3 1939 1. FC Nuremberg SV Waldhof Mannheim 2-0 1940 1. FC Nuremberg Dresdner SC 1-2 (a.e.t.) 1941 Dresdner SC FC Schalke 04 2-1 1942 TSV 1860 München FC Schalke 04 2-0 1943 Luftwaffen-Sportverein Hamburg First Vienna FC 2-3 (a.e.t.) Category:Football competitions in Germany",
 "title": "Tschammer-Pokal"
}