{
 "id": "1078162",
 "text": "Bowls is a sport. It is also known as lawn bowls or lawn bowling. Players try to roll their ball (called a bowl) closest to a smaller ball (known as a jack). The bowls are heavier on one side so that they turn when being rolled. The game is played either in teams or one against one. The game was first played in the 13th century. The game is played on grass, although other surfaces are sometimes used. Matches are held either until one player gets to a score, or when an amount of ends are played. ==History== The game of bowls started in 3200 BC in Ancient Egypt. It was a type of boules. Writings of that time include an image showing a historic game of bowls. It was played in England from the 13th century onwards. Both Edward III and Richard II banned the game. They wanted England to practice archery instead. The ban was lifted in 1845. The game was played unofficially before this. The invention of the lawn mower in 1830 helped the game spread. The game became popular in Scotland in the 19th century. The Scots set standard rules and played on flat surfaces. In the 1960s, the sport came to New Zealand. The world's oldest surviving bowling green is the Southampton Old Bowling Green, which was first used in 1299. Lawn bowls is a core sport in the Commonwealth Games. It has been played in every edition of the Games. In the past the game had a strict dress code, especially for women. Their clothes had to be of a set length and colour. Now, dress code is more relaxed. There are bowls events held every year. The biggest is the World Bowls Championships. The World Bowls Championship was first held in 1966. A World Indoor Bowls Championships has been held yearly from 1979. ==Playing the game== ===Equipment=== The game has very little equipment apart from the playing surface. It has a small ball called a \"jack\". The jack is the target to throw at. The jack can be white or yellow. The players roll larger balls (known as \"bowls\" or \"woods\") at the jack. The bowls were historically black or brown. Recently, these can be in any colour. At the end of the area where the game is being played is a small channel called the \"ditch\". There is also a rectangular carpet called a \"mat\". The person playing has to stand on the mat. The game can be played on different surfaces, but mostly on grass (or in New Zealand). Other ways to play include on an indoor artificial grass or a moveable carpet. The length of the area a game is played on is 44 yards, and no wider than 5.2 meters. ===Rules=== The player has to stand on the mat. Teams of up to four players compete. The players are named by what position they are in order. The first player is the \"lead\". The next two are \"second\" and \"third\". The last player is called a \"skip\". The skip usually starts at the other end of the area until their turn to play. The bowls are heavier on one side. The heavier side is known as the bias. When rolled forward, the bowl will turn left or right towards the bias. Players of opposing teams take turns to throw their bowls. Each team gets an amount of bowls, from four for singles matches to eight for teams of four. The game can be played as a race to a score (usually 21 or 11), or over a certain amount of ends. An end is over when both teams have played all of their shots. When an end is finished, the bowl that is closest to the jack scores a point. If their team has the next closest, they score another point. A team scores as many points as bowls they have closer than their opponents closest bowl. At the start of an end, the team's first player (known as a lead) throws the jack. Then, plays their first bowl towards the jack. The two teams take turns to throw. Bowls that go into the ditch are removed. However, bowls that hit the jack are marked with chalk. They are allowed to stay in the ditch. ==Other games== Lawn bowls is played on rectangle area of grass. When played in a square area, it is called crown green bowls. In crown green, the playing surface is not always flat. It also does not have a set size for the playing area. Indoor spaces have artificial playing areas (sometimes known as \"carpet bowls\"). A version played on a rollable carpet is known as short mat bowls. Short mat is played on a much smaller carpet. The jack is placed rather than rolled. It also has a piece of wood in the middle to prevent powerful shots. A version played on a slope is called tra bowls. The surface is higher on the edges than the middle. There is no jack, but a drawn target on the floor. This game is played in Belgium. ==In popular culture== *Blackball – a 2003 comedy movie about a young bowls player. ==References== Category:sports Category:Outdoor sports Category:Bowls",
 "title": "Bowls"
}