{
 "id": "1078837",
 "text": "The superactinides are a group of hypothetical elements predicted to be elements 121–156, one of which is expected to have a magic number of protons and neutrons – unbihexium. An isotope of unbihexium is expected to have 126 protons and 184 neutrons. Before the Superactinides, there are Ununennium and Unbinilium. As of 2025, none has been found. The elements in this block are considered g-block elements. ==Superactindes== ===Unbiunium=== Unbiunium, also known as eka-actinium, was attempted to be synthesized in 1977 by shooting Copper-65 at Uranium-238. It was unsuccessful and no atoms were identified. ===Unbibium=== Unbibium, also known as eka-thorium, was attempted to be synthesized in 1972 by shooting Zirconium-66 and 68 at Uranium-238. It was unsuccessful and no atoms were detected. Unbibium is predicted to be in the island of stability. ===Unbitrium=== Unbitrium also known as eka-protactinium, or element-123. No attempt has ever been made to make Unbitrium. ===Unbiquadium=== Unbiquadium, also known as eka-uranium, is the predicted element-124. It is predicted that Unbiquadium-308 has a magic number of neutrons, 184. It is in the island of stability. ===Unbipentium=== Unbipentium also known as eka-neptunium, is the predicted element-125. In 1977, Unbipentium was tried to be synthesized by shooting zinc-68 and 68 at americium-238. It was unsuccessful and no atoms were detected. ===Unbihexium=== Unbihexium also known as eka-plutonium is expected to have a magic number of protons and neutrons 126 protons and 184 neutrons. There was a synthesization attempt in 1971, however it was unsuccessful. It is in the island of stability. ===Unbiseptium=== Unbiseptium, also known as eka- americium, was attempted to be synthesized in 1978 by shooting xenon ions at tantalum. No atoms were detected. ===Unbioctium=== Unbioctium also known as eka-curium, is the predicted element-128, it has not been tried to be synthesized. ===Unbiennium=== Unbiennium also known as element-129, has not yet been tried to be synthesized. ===Untrinilium=== Untrinilium, also known as element-130, isotopes that are above Untrinilium are predicted to have isotopes that are extremely radioactive. It has never been tried to be synthesized. ===Untriunium=== Untriunium, also known as eka-Einsteinium is element-131 of the periodic table. It has not yet been tried to be synthesized. ===Untribium=== Untribium also known as eka-Rutherfordium is element-132 It is predicted to be in the island of stability. ===Untritrium=== Untritrium, also known as element-133 has the atomic symbol Utt it is expected to have extremely unstable isotopes. It has not yet been tried to be synthesized. ===Untriquadium=== Untriquadium, also known as element-134 is in the island of stability. It has not yet been tried to be synthesized. ===Untripentium=== Untripentium, also known as element-135 has atomic symbol Utp. It has not yet been tried to be synthesized. ===Untrihexium=== Untrihexium, also known as element-136 has not been tried to be synthesized. It has atomic symbol Uth. ===Untriseptium=== Untriseptium also called eka- dubnium is predicted to be element-137. Richard Feynman said that Untriseptium located at the end of the periodic table. He was wrong. It turned out to be Unsepttrium. and there have not been any attempts to make Untriseptium. ===Untrioctium=== Untrioctium, also known as element-138, has not yet been tried to be synthesized. It has atomic symbol Uto. ===Untriennium=== Untriennium is element-139. It has not yet been tried to be synthesized. It has atomic symbol Ute. ===Unquadnilium=== Unquadnilium is element-140. It has not yet been tried to be synthesized. It has atomic symbol Uqn. ===Unquadunium=== Unquadunium is element-141 of the periodic table. It has not yet been tried to be synthesized, with the atomic symbol Uqu. ===Unquadbium=== Unquadbium, is the predicted element-142. It is predicted to have extremely radioactive Isotopes. It has not yet been tried to be synthesized. It has atomic symbol Uqb. ===Unquadtrium=== Unquadtrium, is the predicted element-143. It is predicted to have extremely radioactive Isotopes. It has never been tried to be synthesized. It has atomic symbol Uqt. ===Unquadquadium=== Unquadquadium, is the predicted element-144. It has never been tried to be synthesized. It has atomic symbol Uqq. ===Unquadpentium=== Unquadpentium, is the predicted element-145. It has never been tried to be synthesized. ===Unquadhexium=== Unquadhxium, is the predicted element-146. It has never been tried to be synthesized. It has atomic symbol Uqh. ===Unquadseptium=== Unquadseptium, is the predicted element-147. It has never been tried to be synthesized. It has atomic symbol Uqs. ===Unquadoctium=== Unquadoctium, is the predicted element-148. It has never been tried to be synthesized. It has atomic symbol Uqo. ===Unquadennium=== Unquadennium, is the predicted element-149. It has never been tried to be synthesized. It has atomic symbol Uqe. ===Unpentnilium=== Unpentnilium, is the 150th element of the periodic table. It has not yet been tried to be synthesized. ===Unpentunium=== Unpentunium, is the 151st element of the periodic table. It has not yet been tried to be synthesized. ===Unpentbium=== Unpentbium, is the 152nd element of the periodic table. It has not yet been tried to be synthesized. ===Unpentrium=== Unpentrium, is the 153th element of the periodic table. It has not yet been tried to be synthesized. ===Unpentquadium=== Unpentquadium, is the 154th element of the periodic table. It has not yet been tried to be synthesized. ===Unpentpentium=== Unpentpentium, is the 155th element of the periodic table. It has not yet been tried to be synthesized. ===Unpenthexium=== Unpenthexium is the predicted element-156. It has not yet been tried to be synthesized. ===Unpentseptium=== Unpentseptium is the last element in the superactinides. It is the predicted element-157. It has not yet been tried to be synthesized. ==Nuclides after element-120== ===Alpha decay chain=== There is a alpha decay chain starting from 296-Uue,296 and 299-Ubn, 300-Ubu, 300 and 303-Ubb, 304-Ubt, and 304-Ubq continuing up a possible narrow 1 microsecond alpha decay chain. with targets 248-Cm 249-Bk and 249-Cf and projectiles 50-Ti 54-Cr and 58-Fe. ===Isotopes of Unbiunium=== A calculation in 2016 predicted that the most stable predicted isotopes of Unbiunium are 309-314 Ubu. They are predicted to have half-lives long enough to be detected in labs. 304-314 Ubu though are expected to alpha decay. ===Isotopes of Unbibium=== There were two attempts of making Ubb-306 they were tried to be made by shooting 58-Fe at 248-Cm. No atoms were found. The 2nd one was shooting 64-Ni at 242-Pu. Again, no atoms were found. ===Isotopes of Unbiquadium=== The predicted most stable isotope of Unbiquadium is predicted to be Ubq-330. with 124 protons and 206 neutrons. Ubq-308 has a magic number of neutrons which is 184. ===Isotopes of Unbihexium=== The predicted Ubh-310 expected to be the longest living isotope of Unbihexium. It has a magic number of protons and neutrons. 126 protons, and 184 neutrons. ==References== Category:Chemistry Category:Hypothetical chemical elements",
 "title": "Superactinide"
}