{
 "id": "1078384",
 "text": "Tobi Olarenwaju Ayobami \"Larry\" Kayode (born 8 May 1993 in Ibadan, Nigeria) is a Nigerian football player. He plays for Genclerbirligi Ankara as forward. ==Career == Kayode started his career in Nigeria with Marvelous FC. In 2008 he moved to Ghana to Red Bull Ghana. He moved to ASEC Mimosas in Ivory Coast in January 2010. After six months he was loaned to AFAD Djékanou for one and a half years. He was loaned to FC Luzern in Switzerland from January to December 2012. After his return he was loaned to Heartland FC. After nine months he was loaned to Maccabi Netanya in Israel. After the loan deal ended, the Israelis signed him permanently. For the 2015/16 season he moved to Austria to the Bundesliga club FK Austria Wien. In 2017 he became top scorer of the Austrian Football Bundesliga with 17 goals. In August 2017 he went to Manchester City. There he was loaned to Spain to FC Girona. After little success in Spain he was loaned to Shakhtar Donetsk. shakhtar.com/en With Shakhtar Donetsk he became champion and cup winner. For the 2019/20 season he was loaned to Gaziantep FK. Between 2020 and 2022 he played on loan for Sivasspor. 2022 till 2023 he was loaned to Ümraniyespor. In 2023 he went to Genclerbirligi in the second league of Turkey. == International == After Kayode had previously played for various Nigerian youth national teams, he was called up to the senior national team squad for the first time in March 2017. Der Standard (German)He made his debut the same month as a 76th-minute substitute for Ahmed Musa in a friendly against Senegal. ==Honours== ASEC Mimosas *Ligue 1 (Ivory Coast): 2010 Maccabi Netanya *Liga Leumit: 2013–14 Shakhtar Donetsk *Ukrainian Premier League: 2018, 2019 *Ukrainian Cup: 2018, 2019 Sivasspor * Turkish Cup: 2022 FK Austria Wien * Top scorer Bundesligaː 2017 ==References == Category:1993 births Category:Living people Category:Nigerian footballers Category:FK Austria Wien players Category:Austrian Football Bundesliga top scorers",
 "title": "Olarenwaju Kayode"
}