{
 "id": "107841",
 "text": "Native Americans in the United States (also known as American Indians) are the indigenous people from the areas of North America now part of the continental United States, including parts of Alaska. The US government recognizes 574 tribes. There are about 310 Indian reservations in the US. Most Native Americans do not live on a reservation anymore. There were and still are many diverse groups of Natives in what is now the US. The diversity includes various and rich languages and cultures. The arrival of Europeans in the Americas drastically changed Native Americans in the US. The history of these Native Americans is a story of suppression and the forced removal from their lands. During American history, there were various Native responses to European colonization and American expansion. In the 20th century, Natives got more rights and were recognized as citizens. There are still problems today that impact Native Americans in the United States. Natives Americans face discrimination from other groups. There is also racism and cultural appropriation. There are also public health issues connected to historical trauma and generations of misstreatment. ==Cultural Areas == Historians often break up the cultures of Indigenous peoples of North America in the United States into two ten regions: * Arctic, including Aleut, Inuit, and Yupik peoples * Subarctic * Northeastern Woodlands * Southeastern Woodlands * Great Plains * Great Basin * Northwest Plateau * Northwest Coast * California * Southwest == History == === Settlement and Pre-Columbia Era === Native Americans most likely originally came from Asia to the Americas. They most likely crossed over Beringia. This was a geographical bridge that connected what is now Russia and Alaska. This migration may be over 30,000 years old. The Clovis culture was one of the earliest cultures.Robinson, Erick; Sellet, Frédéric (2017). Lithic Technological Organization and Paleoenvironmental Change: Global and Diachronic Perspectives. Springer International Publishing. p. 266. ISBN 978-3-319-64407-3. The Pre-Columbian Era was before Columbus and Europeans conquered the Natives. Scholars break this era into different stages.Willey, Gordon R.; Phillips, Philip (1957). Method and Theory in American Archaeology. University of Chicago Press. ISBN 978-0-226-89888-9. The lithic stage was important for the usage of new rock technologies. In the archaic period, there was mainly subsistence farming. After the archaic period, societies were more developed.Price, Douglas T.; Feinman, Gary M. (2008). Images of the Past, 5th edition. New York: McGraw-Hill. pp. 274–277. ISBN 978-0-07-340520-9. There were more crafts, urban centers, military structures, and usages of metals.Gordon R. Willey and Philip Phillips (1957). Method and Theory in American Archaeology. University of Chicago Press. ISBN 978-0-226-89888-9. Examples of tribes include Eastern Woodlands culture, the Pacific Northwest Coast Indigenous peoples, the Mississippian culture, including the Cahokia), Pueblo peoples and Iroquois League of Nations. === European Exploration and Colonization === Europeans started to arrive in the 16th century. This caused diseases to spread, and many Natives died. The population of Natives became much smaller.Osborn, William M. (2000). The Wild Frontier: Atrocities During the American-Indian War from Jamestown Colony to Wounded Knee. Random House. ISBN 978-0375503740. There were many conflicts between American Indians and colonists even into the 19th century. Natives fought to protect their lands. Europeans also brought animals. Natives began to hunt more and move around more with these new animals. European trade led to the Columbian Exchange.Calloway, Colin G. \"Native Americans First View Whites from the Shore\". American Heritage, Spring 2009. There were several wars. Native Americans often fought against each other and Europeans. They also made many alliances. The Beaver Wars were in the 17th century. Iroquis became powerful and destroyed other tribes like Huron, Neutral, Erie, Susquehannock, and Shawnee.Blick, Jeremy P. (3 August 2010). \"The Iroquois practice of genocidal warfare (1534‐1787)\". Journal of Genocide Research. 3 (3): 405–429. doi:10.1080/14623520120097215. Natives fought with the French and British during the Seven Year's War. King Philip's War was between Metacom and Colonists in New England. It was the last major war between Natives and Colonists. During the American Revolution, many Natives fought with the British. At the Treaty of Paris (1783), Britain gave most Native lands to America. George Washington and Americans wanted to civilize and educate Natives.Remini, Robert (1998) [1977]. \"The Reform Begins\". Andrew Jackson. History Book Club. p. 201. ISBN 978-0-06-080132-8. The Civilization Fund Act of 1819 supported this process. Americans thought that some Natives were civilized. These were the Five Civilized Tribes. They included the Cherokee, Chickasaw, Choctaw, Creek and Seminole tribes.Clinton, Fred S. \"Oklahoma Indian History, from The Tulsa World\". The Indian School Journal, Volume 16, Number 4, 1915, page 175-187. === 19th Century === In the 19th century, most of the lands in the Eastern United States were conquered. The lands in the west were still Native American Territory. Soon diseases also came to the Western territories. The European Americans wanted to move west. There was Native American resistance. Conflicts included Tecumseh's War, the Creek War and Seminole Wars. However, Native Americans were in the Union and Confederate Armies during the Civil War.\"Native Americans in the Civil War\". Ethic Composition of Civil War Forces (C.S & U.S.A.). January 5, 2009. Retrieved July 28, 2022. President Andrew Jackson forced Natives to leave their lands. He passed the Indian Removal Act of 1830. This led to the Trail of Tears.Carter (III), Samuel (1976). Cherokee Sunset: A Nation Betrayed : A Narrative of Travail and Triumph, Persecution and Exile. New York: Doubleday, p. 232. Americans justified this removal. This was called Manifest Destiny. In 1851, the Indian Appropriations Act set up preservations for Natives. Natives resisted in the Indian Wars.hornton, Russell (1990). American Indian Holocaust and Survival: A Population History since 1492. University of Oklahoma Press. p. 48. ISBN 978-0-8061-2220-5 There was also the Dakota War, Great Sioux War, Snake War, Colorado War, and Texas-Indian Wars. In the Wounded Knee Massacre, the US army killed many Natives. The Cherokee were the first Natives to become US citizens.Kappler, Charles (1904). \"Indian Affairs: Laws and Treaties Vol. II, Treaties\". Government Printing Office. Archived from the original on May 17, 2008.McLoughlin, William G. (1981). \"Experiment in Cherokee Citizenship, 1817–1829\". American Quarterly. 33 (1): 3–25. doi:10.2307/2712531. JSTOR 2712531. In 1871, Ulysses S. Grant recognized more Native tribes in the Indian Appropriations Act. The US government also created many boarding schools for Native Americans. The schools only taught Christianity and not Native American religions. Navajo were against teaching. Eventually, the schools included Indian history and self-esteem. === 20th Century === In the 20th century, there were more rights for Natives. Politicians were more open to Natives. Woodrow Wilson allowed Natives who fought in World War I to become citizens. Calvin Coolidge signed the Indian Citizenship Act. This made all Natives American citizens.Madsen, Deborah L., ed. (2015). The Routledge Companion to Native American Literature. Routledge. p. 168. ISBN 978-1317693192. Republican Charles Curtis was a Native and Congressman. He became the Senate Minority Whip and Senate Majority Leader for several years.Unrau, William E.. Mixed- bloods and Tribal Dissolution: Charles Curtis and the Quest for Indian Identity. United Kingdom: University Press of Kansas, 1989., p. 112. Today Americans have all the rights of the US constitution.Deloria, Vincent (1992). American Indian policy in the 20th century. University of Oklahoma Press. p. 91. ISBN 978-0-8061-2424-7. The Indian Relocation Act of 1956 supported vocational training. Many Natives fought and died in World War II. Soldiers respected the Natives. The legacy of the Native American warrior was still there.Bernstein, Alison R.. American Indians and World War II: Toward a New Era in Indian Affairs. United States: University of Oklahoma Press, 1991, p. 131. There was also more self-determination for Natives. There was more activism with Natives. Notable events in the 1960s are the occupation of Alcatraz Island (1969–1971) and the formation of the American Indian Movement (AIM). In 1968, the Indian Civil Rights Act gave Natives protection to tribe members.Robert J. McCarthy, Civil Rights in Tribal Courts; The Indian Bill of Rights at 30 Years, 34 IDAHO LAW REVIEW 465 (1998). The Indian Self- Determination and Education Assistance Act was passed in 1975.Robert J. McCarthy, The Bureau of Indian Affairs and the Federal Trust Obligation to American Indians, 19 BYU J. PUB. L. 1 (December 2004) Tribal colleges were created. Many universities have added study programs about Natives Americans. This is partly due to Native activism. == Contemporary Problems == Native Americans are affected by some problems more than European Americans. For example Native Americans are six times more likely to suffer from alcoholism than average. About 24% live in extreme poverty. Native American and Native Alaskan women are more likely to be targets of sexual violence than other women. Natives says that they often face prejudice and mistreatment. Many Native Americans live in cities. They face poverty and bad working conditions.Davis, James J.; Roscigno, Vincent J.; Wilson, George (March 2016). \"American Indian Poverty in the Contemporary United States\". Sociological Forum. 31: 6, 8. doi:10.1111/socf.12226. Another problem is cultural appropriation. This is when a culture wrongly adopts and takes elements from another culture. This is a problem in sports with mascots. There are often Native American stereotypes. The Golden State Warriors stopped using Native American logos in the 1970s. In 2020, the Washington Redskins changed their name to Washington Commanders.\"ENDING THE LEGACY OF RACISM IN SPORTS & THE ERA OF HARMFUL \"INDIAN\" SPORTS MASCOTS\" (PDF). National Congress of American Indians. October 2013. p. 10. There has been controversy with names of Native Americans in the US. Native Americans were historically called Indians. This word has racist stereotypes. The term Native Americans is viewed to be more historically accurate. There is no agreement among Native Americans on what is the best term.Slate, Nico (2019). Lord Cornwallis Is Dead: The Struggle for Democracy in the United States and India. Cambridge, Massachusetts: Harvard University Press. p. 26. ISBN 9780674983441. Some criticize the term Native Americans, because the government chose it. Several Native tribes prefer the term American Indian. Native Americans prefer to be called by their tribal names. == Related pages == * Alaska Natives * First Nations, a term used in Canada * Indigenous Australians == References == Category:Native Americans Category:Ethnic groups in the United States",
 "title": "Native Americans in the United States"
}