{
 "id": "107855",
 "text": "Brian Cowen (born 10 January 1960) was the Taoiseach of the Republic of Ireland. He became the Taoiseach on 7 May 2008, after Bertie Ahern, resigned after losing a general election on 9 March 2011. He was the leader of a political party called Fianna Fáil. They were in a coalition government with the Green Party and the Progressive Democrats. Independent TDs (Irish members of parliament) also support his government. During his time as Taoiseach and after leaving office, Cowen was called by multiple media outlets as the worst Taoiseach in the country's history. ==Taoiseach== Cowen was elected leader of Fianna Fáil in May 2008, after the resignation of Bertie Ahern. Weeks after taking office as Taoiseach, his administration faced the Irish financial and banking crises. He was criticized for his failure to fix the crisis, which led the Irish Government to ask for financial aid from the European Union and the International Monetary Fund. This was seen in Ireland as a national humiliation. His leadership subsequently saw public support for Fianna Fáil plunge to record lows, and Cowen set a record for the lowest approval rating in the history of Irish opinion polling, at one point reaching an approval rating of 8 percent. In January 2011, following a failed attempt at a cabinet reshuffle, and facing growing political pressure, Cowen resigned as Leader of Fianna Fáil, but remained as Taoiseach until after the general election. On 14 September 2010, after having an interview on RTÉ's Morning Ireland, Cowen was accused of doing the interview while drunk. The Sunday Times called Cowen's time as Taoiseach as \"a failure\". In 2011, the Irish Independent called Cowen the \"worst Taoiseach in the history of the State\". ==Personal life== Brian Cowen was born to a Catholic family,Cowen shows he is 'second an Irishman, first a Catholic' , The Irish Times, 3 December 2009 in Tullamore, County Offaly,Archived from Jan. 2010 on 10 January 1960. He was raised in Clara by his parents, May and Bernard Cowen, a Fianna Fáil TD and Senator. He studied law at University College Dublin. Cowen is married to Mary Molloy and they have two daughters. ===Health=== On 5 July 2019, Cowen was hospitalized after suffering a major brain haemorrhage. He spent five months in a hospital before transferring to a physical rehabilitation facility. Cowen returned home in 2021, however was left paralyzed and needed the help of a wheelchair.Des O’Malley has left a great legacy, says Brian CowenIN PICTURES: Former Taoiseach Brian Cowen makes public appearance with Sam Maguire for local charity ==References== ==Other websites== * Brian Cowen feature from the Offaly Express * What Brian and Mary did next * Category:1960 births Category:Living people Category:Government ministers of Ireland Category:Members of Dáil Éireann Category:Taoisigh of Ireland Category:Tánaistí of Ireland",
 "title": "Brian Cowen"
}