{
 "id": "1078307",
 "text": "\"The Typewriter\" is a short piece of light music by American composer Leroy Anderson. It uses a typewriter as a percussion instrument. == Composition == Anderson completed \"The Typewriter\" on October 9, 1950 in Woodbury, Connecticut.\"Leroy Anderson: A Bio-Bibliography\", Praeger 2004, Chapter 2 – \"Works\", Pages 25–81. \"The Typewriter\" was first performed on September 8, 1953 during a recording Anderson and the Boston Pops Orchestra made in New York City for Decca Records.\"Leroy Anderson: A Bio-Bibliography\", Praeger 2004, Appendix H – \"Recording Sessions and Musicians\", page 411 Anderson composed the melody for symphony and pops orchestras; William Zinn and Floyd Werle arranged it for string orchestras and wind bands.Published Music // Leroy Anderson's official website It is named \"The typewriter\" because a real typewriter is needed to perform the piece. It uses three basic sounds of a typewriter: that of typing, the \"bell\" that indicates the end of a line, and the sound the typewriter makes when jumping to the next line. A bell is sometimes used for the end-of-line sound, the sound of the typewriter’s carriage returning is made by a musical gourd,Published Music // Leroy Anderson's official website flute, string or other instrument.Published Music // Leroy Anderson's official website The typewriter for the performance was modified so that only two keys work to prevent the keys from jamming. According to the composer himself, as well as other musicians, the typewriter part is difficult because of how fast the typing speed is: even professional stenographers cannot do it, and only professional drummers have the necessary wrist flexibility.Leroy Anderson: Master of the Miniature, at National Public Radio, by Pat Dowell, published June 27, 2008, retrieved June 23, 2012 The composition has been called one of \"the wittiest and most clever pieces in the orchestral repertoire\".\"Compact Discoveries: #13, Leroy Anderson\" , by Fred Flaxman, broadcast 2005, transcript posted 2009, retrieved June 23, 2012 Author Steve Metcalf has written that \"Despite the almost total disappearance of typewriters in everyday life, the statistics show that \"The Typewriter\" is still a favorite Anderson item.\"\"Leroy Anderson: A Bio-Bibliography\", Praeger 2004, Chapter 1 – \"Biography\", Page 15 The typewriter is considered a percussion instrument.Thomas D Rossing, Science of Percussion Instruments // World Scientific Pub Co Inc, 2000 The typewriter part is usually performed by a percussionist or drummer, or rarely by the conductor.New Year with Vladimir Spivakov // Russia-K, December 31, 2012 == References == == Other websites == * The Typewriter played by Spanish percussionist Alfredo Anaya and Hamburg Symphony Orchestra directed by Miguel Roa. Category:Classical music",
 "title": "The Typewriter"
}