{
 "id": "1078853",
 "text": "Baojun () is a Chinese automobile marque owned by a joint venture of General Motors and SAIC Motor, SAIC-GM-Wuling Automobile. == History == Following the success of Wuling Motors, the Sino-American joint-venture SAIC-GM-Wuling decided to create a second car brand aimed at Chinese buyers, announcing the creation of Baojun in November 2010. The goal was to offer affordable cars that would compete with Chinese low-cost vehicle manufacturers such as Chery and Geely. The first Baojun car to go on sale was the compact sedan 630. During the premiere, the manufacturer emphasized the relatively low price, which in 2010 amounted to the equivalent of 7,000 US dollars. During the construction work on the Baojun 630, mainly designers from the American General Motors participated. The expansion of the Baojun brand's offer began in mid-2012, when Chevrolet Spark was added to its range, taking the name Baojun Lechi. Further investment plans to expand Baojun's portfolio were presented in April 2014, over the next 12 months, introducing two new models, whose concept dominated the range of the Chinese brand in the following years - minivana 730 and SUV-a 560. In April 2016, Baojun began exporting its model for the first time - the compact sedan 630 went on sale in Egypt i Algeria under the Chevrolet brand as the second generation of the Optra. In 2018, Baojun expanded its offer with two more groundbreaking models - the first electric car in the form of microcar E100, and also the large SUV 530, which was the first vehicle in the history of the Chinese brand to be sold on global export markets under the Chevrolet brand. A year later, its production was also launched in the first factories outside China - in India under the MG brand as MG Hector and Indonesia as Wuling Almaz. The Baojun brand has achieved great success in the domestic market Chinese, becoming one of the most popular car manufacturers in this country and recording dynamic annual growth. While annual sales amounted to 30,000 units in 2012, 5 years later it exceeded the threshold of 1 million copies. However, this result was not maintained in the following years, with declines of -200,000 copies per year on average. === New Baojun === In January 2019, Baojun announced a new model tactic New Baojun, assuming giving your vehicles a more avant-garde styling and supplementing the offer with higher-positioned vehicles with richer equipment. By the way, the manufacturer also changed its logo, replacing the existing shield with the image of a horse with a more minimalist diamond- shaped profile of a horse. Since the implementation of the new tactic, Baojun models have been using a new naming order - passenger cars have been assigned the 'RC' prefix, \"RS\" SUV and crossover, and \"RM\" minivan. In the spring of 2021, Baojun introduced nomenclature based on proper names for the first time. In April 2021, the RC-5W was renamed Baojun Valli, in turn, the electric hatchbacka E300/E300 Plus was renamed Baojun KiWi EV. In 2023, in the face of drastically decreasing demand and market failure of most combustion models produced so far, Baojun moved on to phasing out production of unsuccessful models and went on the offensive in the electric car class, presenting at the beginning the Yep crossover and the Cloud hatchback. == Products == === Current products === *Baojun KiWi EV (2021–present), city car, BEV *Baojun Yunduo (2023–present), subcompact car, BEV *Baojun Yep (2023–present), mini SUV, BEV **Baojun Yep Plus (2024–present), enlarged variant of Yep *Baojun Yunhai (2024-present), compact SUV, BEV File:2023 Baojun Yep.jpg|Baojun Yep File:Baojun Yueye (Yep) Plus 01 China 2024-03-22.jpg|Baojun Yep Plus File:Baojun E300 20210208.jpg|Baojun Kiwi EV File:Baojun Yunduo 004.jpg|Baojun Yunduo === Former products === * Baojun E100 (2017–2021), city car *Baojun E200 (2018–2021), city car *Baojun Lechi (2008–2021), city car * Baojun 310 (2016–2020), subcompact car ** Baojun 310W (2017–2020), enlarged wagon variant of Baojun 310 ** Baojun 330 (2016–2017), sedan variant of Baojun 310 * Baojun 360 (2018–2021), compact MPV * Baojun 560 (2015–2017), compact SUV * Baojun 630 (2011–2019), compact sedan ** Baojun 610 (2014–2019), hatchback variant of Baojun 630 * Baojun 510 (2017–2021), subcompact SUV, also rebadged as Chevrolet Groove *Baojun 530 (2018–2021), compact SUV, also rebadged as Chevrolet Captiva, MG Hector, and Wuling Almaz *Baojun 730 (2014–2021), compact MPV, also rebadged as Wuling Cortez *Baojun RC-5 (2020–2021), compact sedan **Baojun RC-5W (2020–2021), wagon variant of Baojun RC-5 *Baojun RC-6 (2019–2021), mid-size coupe sedan *Baojun RM-5 (2019–2021), compact MPV *Baojun RS-3 (2020–2022), subcompact SUV *Baojun RS-5 (2019–2021), compact SUV *Baojun RS-7 (2020–2022), mid-size SUV File:Baojun 510 front.jpg|Baojun 510 File:Baojun 730 II 001 China 2017-04-05.jpg|Baojun 730 File:Baojun RC-5W 006.jpg|Baojun RC-5 File:Baojun RC-6 IMG001.jpg|Baojun RC-6 File:2018 Baojun RS-5 (front).jpg|Baojun RS-5 File:Baojun RS-7 001.jpg|Baojun RS-7 File:Baojun Lechi Sanming 01 2022-11-23.jpg|Baojun Lechi File:Baojun Lechi Cross China 2015-04-21.jpg|Baojun Lechi Cross File:2017 Baojun 310 hatchback, front 8.11.18.jpg|Baojun 310 File:Baojun 310w.jpg|Baojun 310W File:Baojun 360 IMG001.jpg|Baojun 360 File:Baojun 560 01 China 2016-04-01.jpg|Baojun 560 File:Baojun 630.jpg|Baojun 630 File:Baojun 610 China 2015-04-10.jpg|Baojun 610 File:2018 Baojun E100.jpg|Baojun E100 ==References== Category:Automobile companies of China Category:Guangxi",
 "title": "Baojun"
}