{
 "id": "1078536",
 "text": "Vianney Bureau (born 13 February 1991) is a French singer-songwriter. At 24 years old he won the award for performing artist of the year at the \"Victoires de la musique 2016\". == Beginnings == Vianney has three brothers. He grew up in a music-loving family. He listens his father sing and play songs on the guitar by artists French like Georges Brassens. Vianney has had a passion for music since the age of 12 and began to write songs. In 2005, his father introduced him to some musician friends with whom he recorded his first track. In 2007, he make his first concert in an auditorium, the New Morning in Paris. He grew up in Paris and studied at Notre-Dame-des-Oiseaux College, where he would write a song of the same name, present on his first album Idées blanches. ==Awards and nomination== Year Award Category Nominated work Result 2014 Virgin Radio Male Revelation of the Year Vianney 2015 W9 Talents Award Vianney 2015 SACEM's Francis Lemarque Award Best New Singer-Songwriter of the Year Vianney 2015 RFM Award Songwriter of the Year \"Pas là\" 2015 Victoires de la musique Revelation Album of the Year Idées blanches 2015 NRJ Music Award Revelation Artist of the Year Vianney 2016 Victoires de la musique Male Artist of the Year Vianney 2017 NRJ Music Award Male Artist of the Year Vianney 2017 Victoires de la musique Original Song of the Year 2018 NRJ Music Awards Francophone Group/Duo of the Year (with Gims) 2018 NRJ Music Awards Francophone Song of the Year 2020 NRJ Music Awards Francophone Male Artist of the Year 2020 NRJ Music Awards Francophone Performance of the Year ==Discography== ===Studio albums=== Title Details Peak chart positions Certifications FRA BEL (Fl) BEL (Wa) SWI Idées blanches (including Idées blanches – Les acoustiques) * Released: 20 October 2014 * Label: Tôt ou tard * Format: Digital download, CD 31 — 29 91 * SNEP: 2× Platinum Vianney * Released: 25 November 2016 * Label: Tôt ou tard * Format: Digital download, CD 1 118 2 12 * SNEP: Diamond N'attendons pas * Released: 30 October 2020 * Label: Tôt ou tard * Format: Digital download, CD 1 147 2 10 * SNEP: Platinum À 2 à 3 * Released: 10 November 2023 * Label: Tôt ou tard * Format: Digital download, CD 1 42 155 1 \"—\" denotes an album that did not chart or was not released. ===Live albums=== Title Details Peak chart positions Certifications FRA BEL (Wa) SWI Le Concert * Released: 9 November 2018 * Label: Tôt ou tard * Format: Digital download, CD 11 27 33 * SNEP: Gold ===Singles=== ====As lead artist==== Title Year Peak chart positions Certifications Album FRA BEL (Fl) BEL (Wa) SWI \"Je te déteste\" 2014 113 — — — Idées blanches \"Pas là\" 18 — 13 — \"Veronica\" 2015 185 — — — \"Les gens sont méchants\" — — — — \"On est bien comme ça\" 110 — 30 — \"Je m'en vais\" 2016 2 33 3 48 * SNEP: Diamond Vianney \"Moi aimer toi\" 2017 71 — 8 — * SNEP: Platinum \"Dumbo\" 151 — 44 — * SNEP: Platinum \"Si on chantait\" — — — — Le Petit Spirou la bande originale \"Le Fils à papa\" 2018 — — — — Vianney \"J'm'en fous\" 153 — — — \"N'attendons pas\" 2020 146 — 21 — N'attendons pas \"Beau-papa\" 13 — 2 — \"Dabali\" 2021 141 — — — rowspan=\"2\" \"Les imbéciles\" — — 22 — \"Call on Me\" 2022 30 — 9 33 À 2 à 3 \"Keep It Simple\" 2023 — — 19 — \"Le feu\" 29 — 9 — \"Comment on fait\" 37 — 13 — \"—\" denotes a recording that did not chart or was not released. ====As featured artist==== Title Year Peak chart positions Certifications Album FRA BEL (Fl) BEL (Wa) SWI \"Les Filles d'aujourd'hui\" (Joyce Jonathan with Vianney) 2016 46 — — — * SNEP: Platinum Une place pour moi \"La même\" (with Maître Gims) 2018 1 21 1 24 * SNEP: Diamond * BEA: 2× Platinum Le Concert & Ceinture noire \"Chanson sur ma drôle de vie\" (with Véronique Sanson) — — — — Le Concert & Duos volatils'' \"Allez reste\" (Boulevard des airs featuring Vianney) 2019 69 — 38 — * SNEP: Platinum Je me dis que toi aussi \"—\" denotes a recording that did not chart or was not released. ===Other charted songs=== Title Year Peak chart positions Album FRA \"Quand j'étais chanteur\" 2016 142 J'étais un ange – Michel Delpech \"Sans le dire\" 185 Vianney \"J'm'en fous\" 2017 153 \"Merci pour ça\" 2020 190 N'attendons pas \"Je Suis Fou\" 2023 67 À 2 à 3 ===As songwriter=== Title Year Artist \"Donnez-moi\" 2019 Les Frangines \"Je chanterai\" Erza Muqoli == References == ===Notes=== ===Sources=== == Other websites == *Official website Category:1991 births Category:Living people Category:French singer-songwriters",
 "title": "Vianney"
}