{
 "id": "1078306",
 "text": "The Tucson Roadrunners are an American professional ice hockey team. They began playing in 2016. The team plays in the American Hockey League (AHL). They play their home games in Tucson, Arizona at the Tucson Convention Center Arena. They are the AHL affiliate for the Arizona Coyotes of the National Hockey League (NHL). The team originally played in Springfield, Massachusetts as the Springfield Falcons from 1994 to 2016. On April 19, 2016, the Arizona Coyotes announced that they had purchased the Falcons. On May 17, the team would officially move to Tucson, Arizona to become the Tucson Roadrunners. The name pays tribute to the many different ice hockey teams in the Arizona area that were called the Roadrunners. It is also a reference to the Wile E. Coyote and the Road Runner since their NHL affiliate is the Arizona Coyotes. On October 14, 2016, the team would play their first game as the Tucson Roadrunners. They would be defeated by the San Diego Gulls 5–3. In the 2019–20 season, the Barracuda would finish the season with 42 wins, 20 loses, and 90 points, leading the Pacific Division. They would make it the Pacific Division finals but would lose to the Texas Stars four games to one. In the 2019–20 season, the Roadrunners would lead the Pacific Division and would finish the season with 36 wins, 19 loses, and 75 points. However, the 2020 Calder Cup playoffs would be cancelled by the league because of the COVID-19 pandemic. On October 27, 2017, the Roadrunners retired Craig Cunningham's jersey number #14. On November 19, 2016, during a game between the Roadrunners and the Manitoba Moose, Cunningham collapsed on the ice. He was rushed to a hospital where doctors diagnosed him with acute cardiac arrest from ventricular fibrillation. The heart attack would force Cunningham to retire and they would also amputate his lower left leg. ==References== ==Other websites== * Category:2016 establishments Category:2010s establishments in the United States Category:21st-century establishments in the United States Category:American Hockey League teams Category:Sports in Arizona Category:Tucson, Arizona Category:Arizona Coyotes",
 "title": "Tucson Roadrunners"
}