{
 "id": "1078131",
 "text": "Imam-ūl-Arfīn Sayyid Muhammad Rashid Shah Roze Dhani (Sindhi: پير سيد حضرت محمد راشد روضي ڌڻي,(19 May 1757 – 5 June 1818) was an 18th-century spiritual leader, eminent Islamic scholar, and Sufi saint from Sindh, Pakistan, He founded the Rashidi Sufi order, addressing challenges while emphasizing the importance of following Shari'ah principles. Known as Roze Dhani, and is considered a 37st-generation direct descendant of the Islamic prophet Muhammad, actively promoting the Tarīqat and Shari'ah system. His disciplined teachings and efforts had a profound impact on Sindh, Punjab, Balochistan, Rajasthan, Gujarat,and many other areas in the subcontinent. == Early life and education == Pir Mohammad Rashid Roza Dhani, born on May 19, 1757, in Rahim Dina Kalhoro village, Khairpur Mirs district, was the younger son of Sayyid Muhammad Baqa Shah Lakiyārī Al-Husayni After his father passed away, he started his mission at the age of twenty-seven, working on spreading his teachings for thirty-six years. He had around eleven hundred caliphs, with five hundred holding important roles who were in charge of different areas in the region, == Reformistic Works == Imam-ūl-Arfīn Pir Muhammad Rashid Rozay Dhani played a significant role in giving new ability to the Sufi tradition, particularly within the Qadiriya chain, which had experienced a period of stagnation. He focused on restoring the teachings of the early saints that had been forgotten over time. Through dedicated efforts, he implemented a system of reform and training inspired by Sheikh Abdul Qadir Gilani, the founder of the Qadiriya Sufi order, emphasizing the importance of adhering to the Shari'ah for spiritual development. Imam-ūl-Arfīn Pir Muhammad Rashid emphasized the integration of Shari'ah and Tarīqat, considering them inseparable rather than distinct entities. His teachings aimed to purify Sufism from innovations and align it with the principles outlined in the Qur'an and Sunnah. He rejected the notion that Shari'ah and Tarīqat were contradictory and asserted that adherence to the pure Shari'ah was essential for those on the path of Tarīqat. In his perspective, Shari'ah, representing outward actions, took precedence over Haqīqah and Marifat, which focused on inner states. He highlighted the interdependence of Shari'ah and Tarīqat, likening their relationship to that of the body and soul. Imam-ūl-Arfīn, critiqued individuals who neglected Shari'ah, considering them misguided, and emphasized that true adherence to the path of Tarīqat involved obedience to the pure Shari'ah. His efforts aimed at aligning Sufism with Shari'ah and testing Tarīqat based on its compatibility with Shari'ah principles. Throughout his sermons and writings, he countered misconceptions within Sufism, striving to bring about a reorganization of the entire Sufi system, == References == Category:Pages created with the Article Wizard from 2024 Category:1757 births Category:1818 deaths Category:Sufis",
 "title": "Pir Sayyid Muhammad Rashid Shah Rozay Dhani"
}