{
 "id": "1078555",
 "text": "David Sikes (born 1955 in England) also known as David Arthur Sikes is a musician, business owner and former bassist for band Boston (1987-1998).Doug Huffman, Gary Phil, Brad Delp, David Sikes, Tom Scholz.Bostonmusicawards (in English). Retrieved 2024-01-22. == Early Life & Education == He moved to Suisun City, California at a young age with his family. He attended Crescent School, Sullivan Middle School, Sem Yeto Continuation High School and Solano College with a major in Music.David Sikes: From Fairfield to Boston (the band), to Vallejo. Dailyrepublic (in English). Retrieved 2024-01-22. == Music Career == After his studies, He Moved to Berkeley and joined many local bands.SONGS WRITTEN BY DAVID SIKES. Secondhandsongs (in English). Retrieved 2024-01-22. In 1982, He Joined the Hard Rock Band named \"Aldo Nova\" as a Bassist and background singer. Later in 1987, Sikes joined the rock band BOSTON [2] as a bassist after leaving Los Angeles band Giuffria having played bass on their “Silk and Steel” album release. The same year he did his first show with BOSTON in front of an audience of 86,000 at the Cotton Bowl in Dallas. During his time with the band he played bass, sang and co-wrote five songs on Boston’s 1994 release “Walk On”, including \"Surrender to Me\", \"Walk On\", Magdalene and \"We Can Make It\". Sikes also assisted on production on the vocal arrangements for several songs on Walk On. He also appears on Boston’s “Corporate America” album and Boston’s Greatest Hits release from the 90”s. Sikes was a bandmember with BOSTON from 1987 thru February of 1998, performing on the Third Stage, Canada 1988, Walk On and Living For You tours. [citation required] Other recordings include Jeff Watson of Night Rangers “Lone Wolf” album and Innocent featuring former Aldo Nova band member Jesse Bradman, Jeff Watson and Brad Gillis of Night Ranger. He has also performed with MC Hammer and San Francisco Giants pitcher Barry Zito, Robby Krieger of the Doors, Alex Lifeson of Rush, Alice Cooper, guitarist Rick Derringer, Alan White drummer of Yes. Sikes was a Band-Member with Boston from 1987 to Feb 1997, performing on the Third stage tour, Walk On and Living for You tours. Sikes also sang and performed on numerous Boston recording and as a song co-writer. His charity work includes Medlock Krieger All Star St. Jude Hospital Concerts, various fundraiser for animal rescue and Ukraine. Songs & Albums [Citation Required] Tracks Album Role Tell Me Greatest Hits Vocals Higher Power Greatest Hits Co- Writer Livin’ For You Walk On Vocals Surrender to Me Walk On… Boston Co- Writer, Vocals, bass Walk On Walk On….Boston Co-Writer, bass Walk On (Some More) Walk On…Boston Co-Writer, bass We Can Make It Walk On…. Boston Co- Writer, bass Magdalene Walk On….Boston Co-Writer, bass, vocals Hey Operator Subject....Aldo Nova Bass No Escape Silk and Steel… Giuffria Bass Love You Forever Silk and Steel… Giuffria Bass I Must Be Dreaming Silk and Steel…Guiffria Bass Girl Silk and Steel….Giuffria Bass Change of Heart Silk and Steel….Giuffria Bass Radio Silk and Steel….Giuffria Bass Heartache Silk and Steel….Giuffria Bass Lethal Lover Silk and Steel….Giuffria Bass Tell It Like It Is Silk and Steel….Giuffria Bass Dirty Secrets Silk and Steel….Giuffria Bass Say It Aint True Silk and Steel….Giuffria Bass Livin For You Corporate America….Boston Bass, Vocals == References== == Other websites == David Sikes on Facebook __FORCETOC__ Category:Living people Category:1955 births Category:British musicians Category:American musicians",
 "title": "David Arthur Sikes"
}