{
 "id": "1078847",
 "text": "Dhruv Sharma, professionally known as dhruv, is a British-born singer- songwriter, guitar player and music producer. ==Early life== Sharma was born in London to an Indian family and they all moved to Singapore when he was two years old. He attended United World College. At the age of 18 he left Singapore to go to Yale University, where he started getting into music. Dhruv wrote piano songs in his bedroom when he started uploading demos to the internet in 2017. Raised in Singapore, with roots in India and the UK, Dhruv grew up on an electric mix of songs from Bollywood, 2000s pop radio, and Frank Ocean inspiration. He plays several instruments such as acoustic guitar, accordion, and keyboard. ==Career == After releasing for independent mixtapes between 2017 and 2018, Sharma was signed to RCA. In August 2019 he released \"Double Take\", his debut single. Over the next two years, the song went viral because more people used it as the soundtrack for their TikTok videos. Year later in 2020, he released his first studio album, rapunzel becoming his first number one album in several Southeast Asian countries. The R&B; song about falling in love with a best friend hit number one in the Philippines and Thailand, and was in the top five on streaming charts in Malaysia, Indonesia and Singapore last year. TikTok videos featuring the song have recorded 285.6 million views and on Spotify the song has more than 727 million streams. Even before the song started appearing on the charts last year, dhruv was confident enough to take a break from his studies in 2020 to focus on his music full time. He released his debut single \"Double Take\" on May 24, 2019, while he was third-year student at Yale University. He became famous in 2021, because that song became popular though TikTok and was placed on Spotify's Today's Top Hits playlist in 2021. In 2021 \"Double Take\" debuted on Billboard Global Excl. US Chart. He followed this with \"moonlight\" and \"vulnerable\" in 2020. The themes of his music revolve around his experiences as a young, queer Indian man. On January 19, 2024, dhruv released his seventh studio song, Tragedy, after taking a two-year break from music. ==Discography== ===Studio albums=== * rapunzel (2022) * Private Blizzard (2024) ===Singles=== * double take (2019) * moonlight (2019) * vulnerable (2020) * airplane thoughts (2021) * stable life (2021) * Blur (2022) * Tragedy (2024) * How? (2024) * Speed of Light (2024) == Related pages == * Steve Lacy * Jack Harlow * Lil Nas X * JVKE ==References== == Other websites == * on YouTube Category:1999 births Category:American singer-songwriters Category:Indian singer-songwriters Category:LGBT singers Category:LGBT songwriters Category:Living people Category:Singaporean singers Category:Singer-songwriters from London Category:English pop singers Category:English R&B; singers Category:American guitarists Category:English guitarists Category:American pop singers Category:American R&B; singers",
 "title": "Dhruv Sharma"
}