{
 "id": "1078869",
 "text": "Riich () is an elite division of the Chinese company Chery, which existed from March 2009 to April 2013. ==History== ===Background=== Since Chery was founded, most of Chery's higher-selling models (such as QQ, Qiyun, etc.) are cheap cars in the low-end market, The sales of models over RMB 100,000 such as Dongfangzhi and other models have been sluggish, causing consumers to have an impression of Chery as \"low-end\" and \"cheap\". In order to get rid of the market's \"low-end\" image of Chery and enter the mid-to-high-end automobile market, Chery Automobile Chairman Yin Tongyue proposed a multi-brand strategy and decided to create multiple sub-brands with different market positionings., in order to enhance the brand image and market share, and implement the strategy of \"having more children, more fights\". Therefore, on March 19, 2009, Chery released its three new brands \"Karry\", \"Rely\" and \"Riich\" at the third assembly plant in Wuhu, Anhui Province. Among them, \"Riich\" is positioned as the most advanced among the three, taking the luxury car route., is Chery’s first attempt at luxury cars. The brand’s first model, the G6, also rolled off the assembly line on the same day. ===Sales are sluggish=== Although Riich is a high-end brand, its products ranging from the G6 priced at more than 200,000 yuan to the M1 with a price of only 40,000 yuan also carry the same \"Riich\" logo, which drags down the positioning of more expensive models such as the G5 and G6. Nobody cares, sales were affected. In addition, Riich has low visibility in the automobile market and is considered to be on the verge of \"disappearing\". The only Riich dealer in Guangzhou City also suffered from sluggish sales. Even if the price reduction of the model was as high as 20,000 yuan, it still did not help the sales. The dealer was losing at least 300,000 yuan every month, which caused the dealers all over the country to lose money. Riich dealers continue to withdraw from the network. In Guangdong Province alone, only Zhuhai still has Riich dealers. ===Brand deactivation=== Due to poor sales, in order to reduce operating costs, Chery intends to return its models to the same Chery brand and discontinue the Rely and Riich brands. == Model range == The company's first car was the Riich G6, developed by Chery. Затем в ноябре 2009 года компания представила микролитражный кроссовер Riich X1, and in December 2009 - the Riich G5 sedan. At the time of closure, the company produced the following models: * Riich G3 * Riich G5 * Riich G6 * Riich M1 * Riich M5 * Riich X1 ==Gallery== ==References== Category:Automobile companies of China Category:Anhui",
 "title": "Riich"
}