{
 "id": "1078506",
 "text": "Madison Iseman (born February 14, 1997) is an American actress. She is known for her roles as Charlotte in CMT series Still the King and Lennon Grant/Alison Grant in Amazon Prime Video series I Know What You Did Last Summer. == Early life == Iseman is from Myrtle Beach, South Carolina, and is the daughter of Susan and John Iseman, a dentist. She attended a virtual school. == Personal life == In 2012, Iseman went on a music/missions trip to Kenya for two weeks. As of August 2013, she was active with the First United Methodist Church while in Myrtle Beach. She owns a cat. == Filmography == === Film === Year Title Role Notes 2013 Second Chances Charity 2015 Despair Sessions Veronica Heather Tales of Halloween Lizzy Segment: \"Sweet Tooth\" Ghost Squad Brandy 2016 Marriage of Lies Kinna Liza, Liza, Skies Are Grey Nancy Laid in America Kaylee 48 Hours to Live Young Sherilyn 2017 Beauty Mark Pam Jumanji: Welcome to the Jungle Bethany Walker 2018 Goosebumps 2: Haunted Halloween Sarah Quinn 2019 Annabelle Comes Home Mary Ellen Riot Girls Nat Feast of the Seven Fishes Beth Jumanji: The Next Level Bethany Walker 2020 The Fox Hunter Lily O'Connor The F**k It List Kayla Pierce Acts of Revenge Veronica Clouds Amy Adamle Nocturne Vivian Lowe 2021 Fear of Rain Rain Burroughs 2023 Knights of the Zodiac Sienna 2024 Witchboard Emily TBA Supergirl: Woman of Tomorrow Kara Zor-El / Supergirl === Television === Year Title Role Notes 2014 Modern Family Sam Episode: \"Marco Polo\" 2015 Kaysee Web series; main role Henry Danger Veronika Episodes: \"Henry & the Bad Girl: Parts 1 & 2\", \"One Henry, Three Girls: Part 1\" Kirby Buckets Rebecca Vanderbuff Episode: \"War and Pizza\" Leah Unsold television pilot 2016 Madison Episode: \"The Real F Word\" Those Who Can't Becky Cosgrove Episodes: \"Oof, Nut City\", \"Of Lice and Men\", \"K-Pop Goes the Weasel\" I Know Where Lizzie Is Lizzie Holden Television film Killer Coach Emily Television film 2016–2017 Still the King Charlotte Main role 2017 The Rachels Rachel Nelson Television film 2021 I Know What You Did Last Summer Lennon Grant/Alison Grant Main role 2022 American Horror Stories Sam Episode: \"Necro\" ==References== == Other websites == * Category:Living people Category:1997 births Category:American television actors Category:American movie actors Category:African-American television actors Category:African-American movie actors Category:People from New York City Category:Actors from New York City Category:Actors from the Bronx",
 "title": "Madison Iseman"
}