{
 "id": "1079358",
 "text": "\"Family Ties\" (wrote in all lowercase) is a song by American rappers Baby Keem and Kendrick Lamar. The song was released on August 27, 2021, by Columbia Records and PGLang. The song was the fourth single from Keem's first album, The Melodic Blue. The song was also Lamar’s first song under PGLang, a production company he co-founded in March 2020. \"Family Ties\" was Lamar's first single and new music since \"Pray for Me\" with Canadian singer The Weeknd, released in 2018. The song also was the first official collaboration between Keem and Lamar, who are real-life cousins, as well as the single’s cover art putting them in a family portrait, which pays homage to the album cover of Lamar's 2012 album good kid, m.A.A.d city. The music video has a cameo from singer Normani and won the 2022 BET Award for Video of the Year. == Accolades == The song was given two nominations at the 2022 Grammy Awards for Best Rap Song and Best Rap Performance, winning Best Rap Performance. It also was given two nominations for Song of the Year and Video of the Year at the 2022 XXL Awards. == Music video == The song's music video was directed by Dave Free, and has a cameo from singer Normani, alongside Baby Keem, and Lamar who is billed mid-video as Oklama. In the first scene, the music video begins with a moshpit of black men, who are wearing black bombers and sunglasses around Keem and Lamar, with the two artists wearing orange clothes. Black ballerinas are also in the scene. In the second scene, Lamar raps about still being big in hip-hop despite taking a break. Near the end of the music video, Normani appears in a stretch limo SUV with the two rappers, before the rappers make their last lines. Throughout the video, clips of different sizes and themes are placed on top of the video, being above the ones below them. The video is put into two \"scenes\", with scene 1 having Keem's section, and scene 2 having Lamar's section. == Critical reception == In a review for the song, Pitchfork wrote that \"Kendrick's oddball (weird) raps and nonsensical flow switches express a newfound (new) creative freedom. His future is his own.\" == Charts == === Weekly charts === Weekly chart number for \"Family Ties\" Chart (2021) Peak position Lithuania (AGATA) 43 South Africa (RISA) 18 Sweden Heatseeker (Sverigetopplistan) 12 === Year-end charts === 2021 year-end chart number for \"Family Ties\" Chart (2021) Position US Hot R&B;/Hip-Hop Songs (Billboard) 66 2022 year-end chart number for \"Family Ties\" Chart (2022) Position US Hot R&B;/Hip-Hop Songs (Billboard) 79 == Certifications == == References == Category:Baby Keem songs Category:2021 songs Category:Kendrick Lamar songs",
 "title": "Family Ties (song)"
}