{
 "id": "1079692",
 "text": "Aulorhynchus flavidus, the tubesnout or pipe fish, is a species of marine ray- finned fish that is found off the western coast of North America. It is a member of its family, Aulorhynchidae. It is also part of its suborder, the Gasterosteoidei. == Etymology == Aulorhynchus, the genus name, is a combination of aulos, meaning \"flute\", and rhynchus, which means \"snout\", a reference to the flexible tubular snout of this species The specific name, flavidus means \"yellowish\". == Description == Aulorhynchus flavidus is an elongated fish that is small in size. It looks like a stickleback, but has a thinner, longer body, with 24 to 27 small spines in front of the dorsal fin. === Length === The tubesnout grows to 18 cm (7.1 in) in total length. === Snout === Aulorhynchus flavidus possesses a long snout, hence its common name. == Its diet == Aulorhynchus likes to feed on small planktonic crustaceans, including amphipods, mysids, and crab larvae. == Biology == Like sticklebacks, these little fish produce a sticky secretion from their kidneys when breeding. Aulorhynchus attaches its eggs to kelp. Spawning occurs throughout the year, and males protect nest sites by defending them from predators. This species is also found in public aquariums. == Habitat == The tubesnout lives in shallow marine waters off the Pacific coast of North America to a depth of 30 m (98 ft). It inhabits rocky crevices, kelp beds, eelgrass, and areas with a sandy bottom substrate. == Status == Accodring to the IUCN Red List, this fish is a least-concern species. == Gallery == == References == # Froese, Rainer, and Daniel Pauly, eds. (2012). \"Aulorhynchidae\" in FishBase. October 2012 version. # Froese, Rainer; Pauly, Daniel (eds.) (2012). \"Aulorhynchus flavidus\" in FishBase. October 2012 version. # Pollom, R. (2017). \"Aulorhynchus flavidus\". IUCN Red List of Threatened Species. Retrieved 26 November 2022. Category:IUCN Red List least concern species Category:Animals of North America Category:Scorpaeniformes",
 "title": "Aulorhynchus"
}