{
 "id": "1079232",
 "text": "The 96th Academy Awards was an award ceremony presented by the Academy of Motion Picture Arts and Sciences (AMPAS), honoring the best movies of 2023. The event took place at the Dolby Theatre in Hollywood, Los Angeles, California, on March 10, 2024. The ceremony was hosted by comedian Jimmy Kimmel for the fourth time. The producers of the ceremony were Raj Kapoor, Molly McNearney, and Katy Mullan. The director was Hamish Hamilton. It was televised in the United States by ABC. Oppenheimer won seven awards in total, including Best Picture, followed by Poor Things and The Zone of Interest with four and two respectively. == Nominations == The nominations were announced on January 23, 2024. Oppenheimer led with thirteen nominations, followed by Poor Things and Killers of the Flower Moon with eleven and ten nominations respectively. \"Barbenheimer\" received a total of twenty-one nominations, eight for Barbie and thirteen for Oppenheimer. The acting nominees featured a record number of LGBTQ+ characters. == Awards == Winners are listed first, highlighted in boldface, and indicated with a double dagger (‡). Best Picture Best Director * Oppenheimer – Emma Thomas, Charles Roven and Christopher Nolan, producers ** American Fiction – Ben LeClair, Nikos Karamigios, Cord Jefferson and Jermaine Johnson, producers ** Anatomy of a Fall – Marie-Ange Luciani and David Thion, producers ** Barbie – David Heyman, Margot Robbie, Tom Ackerley and Robbie Brenner, producers ** The Holdovers – Mark Johnson, producer ** Killers of the Flower Moon – Dan Friedkin, Bradley Thomas, Martin Scorsese and Daniel Lupi, producers ** Maestro – Bradley Cooper, Steven Spielberg, Fred Berner, Amy Durning and Kristie Macosko Krieger, producers ** Past Lives – David Hinojosa, Christine Vachon and Pamela Koffler, producers ** Poor Things – Ed Guiney, Andrew Lowe, Yorgos Lanthimos and Emma Stone, producers ** The Zone of Interest – James Wilson, producer * Christopher Nolan – Oppenheimer ** Justine Triet – Anatomy of a Fall ** Martin Scorsese – Killers of the Flower Moon ** Yorgos Lanthimos – Poor Things ** Jonathan Glazer – The Zone of Interest Best Actor Best Actress * Cillian Murphy – Oppenheimer as J. Robert Oppenheimer ** Bradley Cooper – Maestro as Leonard Bernstein ** Colman Domingo – Rustin as Bayard Rustin ** Paul Giamatti – The Holdovers as Paul Hunham ** Jeffrey Wright – American Fiction as Thelonious \"Monk\" Ellison * Emma Stone – Poor Things as Bella Baxter ** Annette Bening – Nyad as Diana Nyad ** Lily Gladstone – Killers of the Flower Moon as Mollie Burkhart ** Sandra Hüller – Anatomy of a Fall as Sandra Voyter ** Carey Mulligan – Maestro as Felicia Montealegre Best Supporting Actor Best Supporting Actress * Robert Downey Jr. – Oppenheimer as Lewis Strauss ** Sterling K. Brown – American Fiction as Clifford \"Cliff\" Ellison ** Robert De Niro – Killers of the Flower Moon as William King Hale ** Ryan Gosling – Barbie as Ken ** Mark Ruffalo – Poor Things as Duncan Wedderburn * Da'Vine Joy Randolph – The Holdovers as Mary Lamb ** Emily Blunt – Oppenheimer as Kitty Oppenheimer ** Danielle Brooks – The Color Purple as Sofia ** America Ferrera – Barbie as Gloria ** Jodie Foster – Nyad as Bonnie Stoll Best Original Screenplay Best Adapted Screenplay * Anatomy of a Fall – Justine Triet and Arthur Harari ** The Holdovers – David Hemingson ** Maestro – Bradley Cooper and Josh Singer ** May December – Screenplay by Samy Burch; Story by Samy Burch and Alex Mechanik ** Past Lives – Celine Song * American Fiction – Cord Jefferson; based on the novel Erasure by Percival Everett ** Barbie – Greta Gerwig and Noah Baumbach; based on characters created by Ruth Handler ** Oppenheimer – Christopher Nolan; based on the biography American Prometheus by Kai Bird and Martin J. Sherwin ** Poor Things – Tony McNamara; based on the novel by Alasdair Gray ** The Zone of Interest – Jonathan Glazer; based on the novel by Martin Amis Best Animated Feature Best International Feature Film * The Boy and the Heron – Hayao Miyazaki and Toshio Suzuki ** Elemental – Peter Sohn and Denise Ream ** Nimona – Nick Bruno, Troy Quane, Karen Ryan and Julie Zackary ** Robot Dreams – Pablo Berger, Ibon Cormenzana, Ignasi Estapé and Sandra Tapia Díaz ** Spider-Man: Across the Spider-Verse – Kemp Powers, Justin K. Thompson, Phil Lord, Christopher Miller and Amy Pascal * The Zone of Interest (United Kingdom) – directed by Jonathan Glazer ** Io capitano (Italy) – directed by Matteo Garrone ** Perfect Days (Japan) – directed by Wim Wenders ** Society of the Snow (Spain) – directed by J. A. Bayona ** The Teachers' Lounge (Germany) – directed by İlker Çatak Best Documentary Feature Film Best Documentary Short Film * 20 Days in Mariupol – Mstyslav Chernov, Michelle Mizner and Raney Aronson-Rath ** Bobi Wine: The People's President – Moses Bwayo, Christopher Sharp and John Battsek ** The Eternal Memory – Maite Alberdi, Juan de Dios Larraín, Pablo Larraín and Rocio Jadue ** Four Daughters – Kaouther Ben Hania and Nadim Cheikhrouha ** To Kill a Tiger – Nisha Pahuja, Cornelia Principe and David Oppenheim * The Last Repair Shop – Ben Proudfoot and Kris Bowers ** The ABCs of Book Banning – Sheila Nevins and Trish Adlesic ** The Barber of Little Rock – John Hoffman and Christine Turner ** Island in Between – S. Leo Chiang and Jean Tsien ** Nǎi Nai & Wài Pó – Sean Wang and Sam Davis Best Live Action Short Film Best Animated Short Film * The Wonderful Story of Henry Sugar – Wes Anderson and Steven Rales ** The After – Misan Harriman and Nicky Bentham ** Invincible – Vincent René-Lortie and Samuel Caron ** Knight of Fortune – Lasse Lyskjær Noer and Christian Norlyk ** Red, White and Blue – Nazrin Choudhury and Sara McFarlane * War Is Over! Inspired by the Music of John and Yoko – Dave Mullins and Brad Booker ** Letter to a Pig – Tal Kantor and Amit R. Gicelter ** Ninety-Five Senses – Jared Hess and Jerusha Hess ** Our Uniform – Yegane Moghaddam ** Pachyderme – Stéphanie Clément and Marc Rius Best Original Score Best Original Song * Oppenheimer – Ludwig Göransson ** American Fiction – Laura Karpman ** Indiana Jones and the Dial of Destiny – John Williams ** Killers of the Flower Moon – Robbie Robertson ** Poor Things – Jerskin Fendrix * \"What Was I Made For?\" from Barbie – Music and lyrics by Billie Eilish and Finneas O'Connell ** \"The Fire Inside\" from Flamin' Hot – Music and lyrics by Diane Warren ** \"I'm Just Ken\" from Barbie – Music and lyrics by Mark Ronson and Andrew Wyatt ** \"It Never Went Away\" from American Symphony – Music and lyrics by Jon Batiste and Dan Wilson ** \"Wahzhazhe (A Song for My People)\" from Killers of the Flower Moon – Music and lyrics by Scott George Best Sound Best Production Design * The Zone of Interest – Tarn Willers and Johnnie Burn ** The Creator – Ian Voigt, Erik Aadahl, Ethan Van der Ryn, Tom Ozanich and Dean Zupancic ** Maestro – Steven A. Morrow, Richard King, Jason Ruder, Tom Ozanich and Dean Zupancic ** Mission: Impossible – Dead Reckoning Part One – Chris Munro, James H. Mather, Chris Burdon and Mark Taylor ** Oppenheimer – Willie Burton, Richard King, Gary A. Rizzo and Kevin O'Connell * Poor Things – Production Design: James Price and Shona Heath; Set Decoration: Zsuzsa Mihalek ** Barbie – Production Design: Sarah Greenwood; Set Decoration: Katie Spencer ** Killers of the Flower Moon – Production Design: Jack Fisk; Set Decoration: Adam Willis ** Napoleon – Production Design: Arthur Max; Set Decoration: Elli Griff ** Oppenheimer – Production Design: Ruth De Jong; Set Decoration: Claire Kaufman Best Cinematography Best Makeup and Hairstyling * Oppenheimer – Hoyte van Hoytema ** El Conde – Edward Lachman ** Killers of the Flower Moon – Rodrigo Prieto ** Maestro – Matthew Libatique ** Poor Things – Robbie Ryan * Poor Things – Nadia Stacey, Mark Coulier and Josh Weston ** Golda – Karen Hartley Thomas, Suzi Battersby and Ashra Kelly-Blue ** Maestro – Kazu Hiro, Kay Georgiou and Lori McCoy-Bell ** Oppenheimer – Luisa Abel ** Society of the Snow – Ana López-Puigcerver, David Martí and Montse Ribé Best Costume Design Best Film Editing * Poor Things – Holly Waddington ** Barbie – Jacqueline Durran ** Killers of the Flower Moon – Jacqueline West ** Napoleon – Janty Yates and Dave Crossman ** Oppenheimer – Ellen Mirojnick * Oppenheimer – Jennifer Lame ** Anatomy of a Fall – Laurent Sénéchal ** The Holdovers – Kevin Tent ** Killers of the Flower Moon – Thelma Schoonmaker ** Poor Things – Yorgos Mavropsaridis Best Visual Effects * Godzilla Minus One – Takashi Yamazaki, Kiyoko Shibuya, Masaki Takahashi and Tatsuji Nojima ** The Creator – Jay Cooper, Ian Comley, Andrew Roberts and Neil Corbould ** Guardians of the Galaxy Vol. 3 – Stephane Ceretti, Alexis Wajsbrot, Guy Williams and Theo Bialek ** Mission: Impossible – Dead Reckoning Part One – Alex Wuttke, Simone Coco, Jeff Sutherland and Neil Corbould ** Napoleon – Charley Henley, Luc-Ewen Martin-Fenouillet, Simone Coco and Neil Corbould === Governors Awards === The 14th annual Governors Awards ceremony took place on January 9, 2024, hosted by John Mulaney. Honorary Awards were presented to Angela Bassett, Mel Brooks, Carol Littleton, and the Jean Hersholt Humanitarian Award to Michelle Satter. === Movies with multiple nominations and awards === Movies with multiple nominations Nominations Film 13 Oppenheimer 11 Poor Things 10 Killers of the Flower Moon 8 Barbie 7 Maestro 5 American Fiction Anatomy of a Fall The Holdovers The Zone of Interest 3 Napoleon 2 The Creator Nyad Past Lives Society of the Snow Movies with multiple awards Awards Film 7 Oppenheimer 4 Poor Things 2 The Zone of Interest == Ceremony information == Producers Raj Kapoor and Katy Mullan were announced on October 17, 2023, with Hamish Hamilton as the director. On November 15, Jimmy Kimmel was announced as host, marking his fourth overall hosting role for the ceremony. On November 30, 2023, ABC and the Academy announced a change in the ceremony's start time to 4:00 p.m. PT (7:00 p.m. ET). === Diversity rules === This will be the first year that diversity rules for the Best Picture category become mandatory. Established under the Academy Aperture 2025 initiative, these rules aim to promote inclusive representation and employment in the film industry. === Barbie Director and Actress snubs === The snubbing of Greta Gerwig and Margot Robbie from getting respective Academy Award nominations for Best Director and Best Actress for Barbie received criticism. Cast members expressed their reactions, and actor Ryan Gosling released a statement in response, emphasizing the significant contributions of Gerwig and Robbie to the movie's success. == References == Category:Academy Awards Category:2020s in Los Angeles, California",
 "title": "96th Academy Awards"
}