{
 "id": "1079367",
 "text": "The Uthmaniyya () were adherents of an early Islamic doctrinal stance which originated in the aftermath of caliph Uthman's assassination in 656 CE. The Uthmaniyya continued to support the deceased caliph and sought revenge for his murder.https://books.google.co.uk/books?id=mXc8DwAAQBAJ&pg;=PA40&dq;=uthmaniyya&hl;=en&newbks;=1&newbks;_redir=0&source;=gb_mobile_search&sa;=X&ved;=2ahUKEwj69t2SmvmDAxVzVfEDHVOTCtI4PBDoAXoECAkQAw#v=onepage&q;&f;=false The Battle of the Camel (656 CE) and the Battle of Siffin (657 CE) both occurred within the framework of ʿUthmāniyyas versus ʿAlīds.https://books.google.co.uk/books?id=cyqdEAAAQBAJ&pg;=PA35&dq;=ʿUthmāniyya+sect&hl;=en&newbks;=1&newbks;_redir=0&source;=gb_mobile_search&sa;=X&ved;=2ahUKEwjJ- vXmxsyEAxUlhf0HHZJIDTQQ6AF6BAgOEAM#v=onepage&q;&f;=false According to Isma'ili Shi'as, the Uthmaniyya had accepted the verdict of the arbitrators appointed at Siffin and held that Uthman had been murdered unjustly. Consequently, they repudiated the rebellion against Uthman and the resulting caliphate of Ali. In addition to the partisans of Mu'awiya, the Uthmaniyya included the upholders of the principles of the early caliphate, namely the rights of the non- Hashemid early companions of the prophet Muhammad to the caliphate. The Uthmaniyya adopted their own anti-Shi'a policies, such as the cursing of Ali from the pulpits after Friday prayers, a policy instituted by Mu'awiya. Amr ibn al-As, Mu'awiya bin Hudayj, the Egyptian Uthmaniyya, and a bulk of the Syrians were responsible for the killing of Kinana ibn Bishr, the assassin of Uthman, as well as his men, which comprised the vanguard of Muhammad bin Abi Bakr, at al- Musannat.https://books.google.co.uk/books?id=2QKBUwBUWWkC&pg;=PA268&dq;=Kinana+ibn+Bishr+killed+uthmaniyya&hl;=en&newbks;=1&newbks;_redir=0&source;=gb_mobile_search&sa;=X&ved;=2ahUKEwiNvNCh0qGEAxXGTEEAHdCEDYgQ6AF6BAgNEAM#v=onepage&q;&f;=false In Yemen, the Uthmaniyya withheld their alms-tax to Ali and joined the rebels of Sana'a.https://books.google.co.uk/books?id=2QKBUwBUWWkC&pg;=PA298&dq;=uthmaniyya&hl;=en&newbks;=1&newbks;_redir=0&source;=gb_mobile_search&sa;=X&ved;=2ahUKEwiVyK- ploOEAxXqaEEAHcIHBjkQ6AF6BAgKEAM#v=onepage&q;&f;=false They also protested Ali’s appointing of Ubayd Allah bin al-‘Abbas and Sa’id bin Nimran. ==Related pages== * Arabs * History of Islam * Muslims * Ummah * Non-denominational Muslims * Umayyad Caliphate * Islamic state * Caliphate * Islamic golden age ==References== Category:History of Islam",
 "title": "Uthmaniyya"
}