{
 "id": "1079599",
 "text": "Medieval philosophy was the thinking or philosophy that happened during the Middle Ages, a time from around the fall of the Western Roman Empire in the 5th century until after the Renaissance in the 13th and 14th centuries. It started in Baghdad, now the capital of Iraq, in the 8th century and later in France in the court of Charlemagne. During this time, people rediscovered the ancient Greek and Roman cultures and tried to connect religious teachings with worldly knowledge, especially focusing on understanding God. The history of medieval philosophy is usually divided into two parts: the time in the Latin West until the 12th century, marked by the rediscovery of Aristotle and Plato, and the \"golden age\" of the 12th to 14th centuries in the Latin West. This period saw a revival of ancient philosophy, including the works of Arabic commentators. It also brought significant developments in the philosophy of religion, logic, and metaphysics. The Renaissance humanists, who came later, didn't think highly of the high medieval Scholastic period, considering it a \"middle period\" between the glory days of Greek and Roman cultures and the rebirth of those cultures. However, modern historians see the medieval era as a time of philosophical growth, strongly influenced by Christian and Muslim theology. Davies, Brian (2004). Aquinas. Continuum International Publishing Group. p. 14. == Features == Medieval philosophy focused a lot on theology. Most medieval thinkers, except for a few like Avicenna and Averroes, didn't see themselves as philosophers but admired writers like Plato and Aristotle.Medieval Philosophy: Essential Readings with Commentary, edited by Gyula Klima, Fritz Allhoff, Anand Jayprakash Vaidya, Wiley-Blackwell, 2007, p. 3. However, they used philosophical methods to explore challenging theological questions. Medieval thinkers like Augustine and Thomas Aquinas made significant contributions to the philosophy of time and metaphysics. The key principles guiding medieval philosophers were using logic and analysis to find the truth (ratio), respecting the ideas of ancient philosophers and aligning philosophical insights with theological teachings (concordia). A major debate during this time was about faith versus reason. Avicenna and Averroes leaned towards reason, while Augustine emphasized the authority of God over philosophical investigations. Anselm tried to reconcile faith and reason, proposing an approach that allows for both. The Augustinian solution to the faith/reason problem was to believe first and then seek understanding (fides quaerens intellectum), a perspective followed by Christian thinkers, especially the scholastic philosophers like Albert the Great, Bonaventure, and Thomas Aquinas. == References == == Other websites == *Zalta, Edward N. (ed.). \"Medieval philosophy\". Stanford Encyclopedia of Philosophy. *Zalta, Edward N. (ed.). \"Literary forms of Medieval Philosophy\". Stanford Encyclopedia of Philosophy. Category:Philosophy",
 "title": "Medieval philosophy"
}