{
 "id": "1079490",
 "text": "Roland Kollmann (8 October 1976 in Villach) is a former Austrian football player. He played as striker mainly for GAK. He also played for the Austrian national football team. In 2004 he was top scorer of the league with 27 goals. ==Career == Kollmann started his football career at his hometown club SC Landskron. He moved to FC Tirol Innsbruck. After a serious injury he moved to FC Kärnten in the Second league.He was an important player there for the promotion. 2001 he went to Twente Enschede but due to injuries he was not successful. In the 2001/02 winter break he came back to Austria and played for Grazer AK. There he celebrated his greatest successes. He became top scorer in the 2003/04 season and champion and cup winner in the same year. 2007 he went to SK Austria Kärnten. 2008 he came back to GAK. 2011 he left GAK and went to SVG Bleiburg in the Kärntner Landesliga (4th tier) Kärntner Liga.at (German) In January 2013, Roland Kollmann moved to Klagenfurter AC in the fifth-class Unterliga Ost. He was not used in any championship games there. So he ended his career as a football player. ==Interntional == Kollmann made eleven appearances for the Austrian national football team, in which he scored four goals. He debuted on 26 March 2003 in a 2-2 draw versus Greece. His last match was on 9 February 2005 versus Latvia. ÖFB Profile ==Manager career == 2010 he was asistance coach with GAK. On April 3, 2012, Kollmann took over the position of head coach at Bleiburg . He then moved to Florida, where he accepted the position of Director of Coaching at the Schulz Academy. He also was a junior coach there. From 2017 onwards he was coach of two clubs from lower classes. ==References == Category:1976 births Category:Living people Category:Austrian footballers Category:Austrian football managers Category:Players of the Austrian national football team Category:Association football forwards Category:Austrian football forwards Category:Austrian Football Bundesliga top scorers Category:Austrian football champions",
 "title": "Roland Kollmann"
}