{
 "id": "1079812",
 "text": "Qoros Automobile was a Chinese automobile manufacturing company headquartered in Shanghai Its products include SUVs, sedans and other models. The company declared bankruptcy in 2022. ==Models== ===Qoros 3=== In December 2011, the company released an image of its first prototype, which made its first public appearance at the Geneva Motor Show in March 2013 with the Qoros 3 sedan pre- production model, together with the Qoros 3 Estate Concept and Qoros 3 Cross Hybrid Concept. In September 2013, the Qoros 3 achieved a five-star rating in the Euro NCAP crash tests, making it the first ever Chinese car to achieve such a rating. It also received the highest score for safety of any car reviewed by Euro NCAP during 2013. In November 2015, the Qoros 5 was launched at the Guangzhou motor show in China, with sales commencing in March 2016. ===Qoros 5=== The Qoros 5 is the second model of automobile from the Chinese manufacturer Qoros Auto, jointly (50%–50%) owned by Kenon Holdings and China's Chery Automobile Company at the time. The five-door CUV was launched at the Guangzhou Motor Show in November 2015. Sales commenced in China early March 2016. ===Qoros Young=== The Qoros Young is a compact crossover from the Chinese manufacturer Qoros Auto, after the holdings of Qoros was jointly (50%–50%) owned by Kenon Holdings and China's Chery Automobile Company, the Qoros Young was revealed as a rebadged version of the Chery Tiggo 7. ===Qoros 7=== The Qoros 7 is the third original model of automobile from the Chinese manufacturer Qoros Auto, under the control of Baoneng Investment Group at the time. ===Product Gallery=== File:Qoros 3 City SUV 01 -- Geneva Motor Show -- 2015-03-08.jpg|Qoros 3 City SUV File:2013-03-05 Geneva Motor Show 8115.JPG|Qoros 3 Estate File:Qoros 3 hatch 001 -- Geneva Motor Show -- 2014-03-09.jpg|Qoros 3 Hatchback File:Qoros 3 Sedan in Stuttgart.jpg|Qoros 3 Sedan File:Qoros 5 SUV 02 China 2016-04-19.jpg|Qoros 5 File:Qoros 7 001.jpg|Qoros 7 ==Concept models== ===eBIQE=== At the 2014 Geneva Motor Show, Qoros displayed a concept electric bicycle called the eBIQE. ===Qoros 2 Concept=== The Qoros 2 was first displayed at the 2015 Geneva Motor Show as a concept plug-in hybrid SUV. ===Qoros Mile 1 Concept=== At the 2018 Beijing Auto Show, Qoros displayed a concept GT called the Qoros Mile 1 Concept. ===Qoros Mile II Concept=== At the 2019 Shanghai Auto Show, Qoros displayed a concept shootingbrake called the Qoros Mile II Concept. ===Qoros Milestone Concept=== At the 2020 Beijing Auto Show, Qoros displayed a concept sedan called the Qoros Milestone Concept. File:Qoros Mile 1 Concept 001.jpg|Qoros Mile 1 File:Qoros Mile II Concept 001.jpg|Qoros Mile II File:2013-03-05 Geneva Motor Show 8115.JPG|Qoros 3 Estate Concept ==References== Category:Automobile companies of China Category:Shanghai",
 "title": "Qoros"
}