{
 "id": "1079802",
 "text": "SAIC-General Motors-Wuling Automobile Co., Ltd. (SGMW) is a joint venture between SAIC Motor Corporation Limited, General Motors Company, and Liuzhou Wuling Motors Co., Ltd. It was established on November 18, 2002, and is headquartered in Liuzhou, Guangxi, China. SGMW primarily focuses on the production and sales of passenger cars, commercial vehicles, and powertrains. The company's main products include mini commercial vehicles, multi-purpose vehicles (MPVs), SUVs, and engines. == History == In 2002, the American giant General Motors decided to establish a third joint venture company, next to Shanghai GM and the liquidated Jinbei GM, to produce cars for the Chinese market. The SAIC Motor concern was again invited to join the partnership, with a majority share of 50.1%, with GM's share being 34%, while the third party in the alliance was the commercial vehicle manufacturer Wuling Motors, with a 15.9% share in the company. Initially, the concern's goal was to develop the offer and profits from the sale of Wuling vans and vans, which are popular in China, in turn, in 2010, a second brand focused on cheap passenger cars and SUVs was created - Baojun. After the previous activities of SAIC-GM-Wulinga were limited to China and its subordinated Hong Kong and Macau, in 2015 the first foreign branch was opened in the form of SGMW Motor Indonesia. It built its own factory in Indonesian Bekasi and established a locally focused offering of the Wuling brand. SGMW remains in close partnership with the brands subordinated to General Motors and SAIC Motor, applying a badge engineering policy towards models, exporting them to global markets developing countries, mainly under the Chevrolet and MG brands. ==Current products== === Wuling === Since 2020, SAIC-GM-Wuling has categorized its vehicle models into \"Red Badge\" and \"Silver Badge.\" The \"Red Badge\" models are primarily designed for light commercial or entry-level passenger vehicles, while the \"Silver Badge\" models are used for more premium passenger cars in global markets. ==== Silver Badge ==== * Hongguang Mini EV (2020–present), electric city car * Air EV (2022–present), electric city car * Binguo (2023–present), electric subcompact car ** Binguo Plus (to commence), enlarged variant of Binguo * Starlight (2023–present), mid-size sedan * Xingchi (2021–present), subcompact SUV * Asta (2021–present), compact SUV * Nebula (2023–present), compact SUV * Jiachen (2022–present), compact MPV * Victory (2020–present), mid-size MPV ==== Red Badge ==== * Hongguang Plus (2019–present), compact MPV * Hongguang S1 (2015–present), compact MPV * Hongguang S3 (2017–present), compact SUV * Hongguang V (2015–present), compact MPV * Zhengcheng (2014–present), van * Sunshine (2002–present), microvan * Rongguang (2008–present), microvan * Zhengtu (2021–present), mid-size pickup File:五菱宏光mini EV 9733 1.jpg|Hongguang Mini EV File:2019 Wuling Hongguang Plus.jpg|Hongguang Plus File:Wuling Hongguang S3 001.jpg|Hongguang S3 File:Wuling Hongguang V 01 China 2016-04-01.jpg|Hongguang V File:Wuling Rongguang 01 China 2012-04-15.jpg|Rongguang File:Wuling Hongguang V China 2015-04-15.jpg|Rongguang V File:Wuling Sunshine II China 2012-04-22.jpg|Sunshine II File:Wuling Sunshine S IMG001.jpg|Sunshine S File:Wuling Xingchen 001.jpg|Xingchen (Asta) File:Wuling Xingchi 005.jpg|Wuling Xingchi File:Wuling Victory 003.jpg|Victory File:Wuling Zhengtu IMG003.jpg|Zhengtu === Baojun === File:Baojun E300 002.jpg|E300 File:Baojun RC-5W 006.jpg|RC-5 File:2018 Baojun RS-5 (front).jpg|RS-5 ==References== ==Other websites== * * Introduction from GM China homepage Category:Guangxi",
 "title": "SAIC-GM-Wuling"
}