{
 "id": "107983",
 "text": "Johnny Reid \"John\" Edwards (born June 10, 1953) is an American politician. He served one term as U.S. Senator from North Carolina. == Early life == Johnny Edwards was born at Prisma Health Oconee Memorial Hospital in Seneca, South Carolina, He was the son of Wallace Edwards and Catharine Edwards, He studied Clemson University and North Carolina State University, He graduated with a Bachelor's degree of textile technology in 1974, After that he graduated as a Doctor of Law at University of North Carolina School of Law . == Lawyer == Before his time in the Senate, he was a lawyer. He argued and won several big cases about doctors who gave bad care and caused harm to patients. He also won lawsuits for people who had been injured by negligence of businesses or by using their products. His best known case was for a Cary, North Carolina three year old girl. She was badly injured by being sucked into an open drain in a swimming pool playpool for toddlers. Her family won enough money from the drain company to pay for her medical care for the rest of her life. == Political career == Edwards served for one term in the United States Senate from 1999 to 2005, serving his state of North Carolina. He decided not to run for re-election as he was running for president, and later vice-president, in the 2004 election cycle. He ran for President of the United States twice, in 2004 and 2008, but was defeated by John Kerry and Barack Obama in the Primaries. He was later chosen to be the Democratic candidate for Vice- President in 2004 on the Kerry ticket, but he was defeated by incumbent Vice- President Dick Cheney. == Personal life == In 2008, he admitted to having an affair while his wife, Elizabeth was dying. He has written several books. == References == == Other websites == * John Edwards for President official campaign website Category:1953 births Category:Living people Category:Lawyers from North Carolina Category:2004 United States presidential candidates Category:American Methodists Category:Politicians from Raleigh, North Carolina Category:Politicians from South Carolina Category:United States senators from North Carolina Category:Democratic Party (United States) politicians Category:Businesspeople from South Carolina Category:Businesspeople from North Carolina Category:Writers from Raleigh, North Carolina Category:Writers from South Carolina Category:Lawyers from South Carolina",
 "title": "John Edwards"
}