{
 "id": "1080288",
 "text": "Ronin is an alias used by multiple characters in the Marvel Comics universe. The Ronin identity was created by Brian Michael Bendis and Joe Quesada, though the characters who have adopted the identity were pre-existing characters created by other writers. Following this, the Ronin mantle has been taken up by characters such as Maya Lopez, Clint Barton, Alexei Shostakov, Eric Brooks, and Bullseye. == Incarnations == === Maya Lopez === Maya Lopez, a.k.a. Echo was the first person to don the Ronin identity. A deaf woman with photographic reflexes, Maya became Ronin to investigate the Silver Samurai in Wakanda. She first appeared as Ronin in New Avengers #11 (November 2005), though the character appeared on the covers of several earlier issues. === Clint Barton === Clint Barton is the second person to have the Ronin identity, becoming Ronin when he rejoined the New Avengers in the aftermath of Civil War. He attempted to hand the costume back to Lopez after the latter was rescued from the Hand, but Lopez declined and allowed him to keep it. Barton later resumed his Hawkeye identity during the Heroic Age. === Alexei Shostakov === The third individual who dons the Ronin identity is Alexei Shostakov, also known as the Red Guardian, he was introduced as Ronin in the Widow Maker crossover between the Hawkeye & Mockingbird and Black Widow titles. This iteration initially starts assassinating spies and eventually targets Mockingbird and Black Widow. === Eric Brooks === Eric Brooks, also known as Blade, is the fourth and most recent character to take up the mantle of Ronin. His identity is kept from the reader when introduced in the Mighty Avengers and dons a Halloween-type costume, \"Spider Hero\", during the Infinity storyline. During the Inhumanity storyline, this character is supplied with the Ronin costume from a \"big box of Clint Barton's old stuff\". == In other media == The Clint Barton incarnation of Ronin appears in the Marvel Cinematic Universe movie Avengers: Endgame (2019) and the Disney+ series Hawkeye (2021), portrayed by Jeremy Renner. Category:Marvel Comics characters",
 "title": "Ronin (Marvel Comics)"
}