{
 "id": "1080030",
 "text": "Sanel Kuljić (10 October 1977 in Salzburg) is a former Austrian football striker. ==Career == Sanel Kuljić began his career at SV Grödig (1985 to 1993). Then he moved to the youth team of SV Austria Salzburg in 1991. He was part of the professional team which won Austrian championship title in the 1996/97 season. Kuljić was unable to became regular player under coach Heribert Weber. He moved to the regional league team PSV Schwarz-Weiß Salzburg. Kuljić managed to become a first division and even Austrian national player via the detour of the regional league and the second division. He played there for clubs such as SV Pasching, BSV Bad Bleiberg and LASK. 2003 Sanel Kuljić moved to SV Ried. In the 2004/05 season the club became Champion and was promoted to the Bundesliga. He became top scorer with 34 goalsin this season. With Ried he reached fourth place in the championship in the 2005/06 season Together with Roland Linz (FK Austria Wien) he was Austrian top scorer with 15 goals each in 36 championship matches. In the 2006/07 season, Sanel Kujic played for the Swiss Super League club FC Sion. By March 2007 he had scored twelve goals in the Super League. Due to outstanding salaries he left the club. In June 2007 he signed with FK Austria Wien. After the end of the season Kuljić moved to SC Magna Wiener Neustadt. As team captain Sanel Kuljić led SC Magna Wiener Neustadt to the championship title and the promotion to the Bundesliga. Kuljić announced a move to Neuchâtel Xamax in the Swiss Axpo Super League. 2011 he moved to AE Larisa. In 2012 he moved to the second division club Kapfenberger SV. On July 7, 2017, he joined the Lower Austrian eight division club ASV Baden. After five appearances and one goal, he moved to the Vienna seventh division team Sportunion Schönbrunn. ==International == He played 20 matches for the Austrian national team. He scored 3 goals. He made his international debut on 17 August 2005 in a 2-2 draw against Scotland. == Criminal offenses and prison sentences == In November 2013, Sanel Kuljić was arrested as part of a major football betting scandal. Together with Dominique Taboga, Thomas Zündel and seven other suspects, he manipulated 18 games. H4e was sentenced to five years in prison in October 2014. In March 2017, he was released early for good behavior. In September 2019, Kuljić was arrested again dealing with cocaine. Category:1977 births Category:Living people Category:Austrian footballers Category:Players of the Austrian national football team Category:Association football forwards Category:Austrian football forwards Category:Austrian Football Bundesliga top scorers",
 "title": "Sanel Kuljić"
}