{
 "id": "1080075",
 "text": "Kinder der Landstrasse was a project of Pro Juventute, a Swiss non profit organization. It was started in 1926. At the time, there were many people in Switzerland, that moved from place to place, and that weren't sessile. This especially included Yenish people. The idea was to tear apart these families, and to make their children go to regular schools, and have a regular life. The life of the Yenish was seen as antisocial. The project happened against the will of those concerned, and ran until 1972. It was based on laws of 1912, which allowed to take away the right to care for their children from parents. In total, about 590 children were affected. The children were placed in orphanages or foster homes. The authorities were forced to pay between 2.000 and 7.000 Swiss Francs per victim. Those responsible, mainly Alfred Siegfried (1890-1972), Clara Reust (1916–2000) and those responsible in the Swiss authorities were never prosecuted. In 1972 the Swiss magazine Beobachter ran a story about the children, and how they suffered from the actions of Pro Juventute. Attorney of the Yenish people accused the Swiss Confederation of genocide. A UN convention of 1948 classified the taking of children of an ethic group, to forcefully integrate them into another group, in order to partly or fully destroy the first group as genocide. Kinder der Landstrasse was dissolved in 1973. In February 2025, the Swiss government formally acknowledged that the forced removals and assimilation efforts targeting the Yenish, Manouche, and Sinti people under the “Children of the Open Road” program constitute a crime against humanity under international law.https://www.admin.ch/gov/fr/accueil/documentation/communiques.msg- id-104226.html Books and movies were made about the subject. == Related pages == * Verdingkinder - similar situation. * Little Danes experiment - Greenlandic children were taken to Denmark. ==References== Category:Racism Category:Cultural assimilation Category:History of Switzerland",
 "title": "Kinder der Landstrasse"
}