{
 "id": "1080328",
 "text": "Operation Lyari was a government-led crackdown against local gangs and crime syndicates in the Lyari area of Karachi, Pakistan. Part of the broader Karachi Operation, it aimed to restore law and order in the region plagued by violence and criminal activities. == Background == Karachi, as Pakistan's largest city with a population exceeding 20 million, has a diverse demographic makeup, contributing to complex ethnic and political dynamics. Ethnic tensions and rivalries have historically led to sporadic violence, exacerbated by factors such as migration from various regions of Pakistan and neighboring countries. == Ethnic and political dynamics == The city is home to a mix of ethnic groups, including Mahajirs, Sindhis, Pashtuns, Balochis, and others, each with its own political affiliations. Political parties such as the Muttahida Qaumi Movement (MQM) and Pakistan Peoples Party (PPP) have strongholds in specific communities, shaping the city's political landscape. == Operations == Operation Lyari commenced in response to escalating violence attributed to local gangs, particularly in the Lyari area. Led by Sindh Rangers and supported by various law enforcement agencies, the operation targeted gang leaders and criminal networks responsible for extortion, drug trafficking, and other illicit activities. === 2012 operation === The initial phase of the operation in 2012 faced challenges, including stiff resistance from entrenched gang members. Despite initial progress, the operation was temporarily halted amid political interventions and negotiations. === 2013 operation === Following a change in government, a renewed effort was made in 2013 to curb violence in Karachi, including Lyari. Pakistan Rangers, with support from the federal and provincial authorities, intensified operations, resulting in significant arrests and disruptions to criminal networks. == Outcome == Operation Lyari led to a substantial decrease in crime rates in the Lyari area, with the arrest or elimination of key gang leaders. The operation marked a significant milestone in efforts to restore peace and stability in Karachi, although challenges persist in addressing underlying socio-economic issues contributing to crime. ==References== Category:Karachi Category:Crime in Pakistan Category:Sindh",
 "title": "Operation Lyari"
}