{
 "id": "10808",
 "text": "The PlayStation 3 (PS3) is the third video game console made by Sony. It was released in Japan on November 11, 2006. It came out on November 17, 2006 in North America, and was released in Australia and Europe on 23 March 2007. It competed against the Microsoft Xbox 360 and Nintendo Wii consoles. The PlayStation 3 was the first console to be able to play Blu-ray discs. The PS3 was, according to Sony, the most powerful console at the time. However, many people that create computer games have recently stated that both the PS3 and Xbox 360 are about equal. An upside is that to access the online mode to play and interact with other people is free unlike the Xbox in which must be paid for. When the PlayStation 3 was released, there were two different models. One had a 20 gigabyte (GB) hard drive and cost $399. The other had a 60 gigabyte hard drive and cost $599. Sony stopped making the 20 gigabyte console in North America after the 60 gigabyte version \"sold ten times as many\" as the 20 gigabyte version. In July 2007, Sony announced that they would cut the price of the PS3 to $500 in the United States, though still more expensive than its competitors. Sony also released a version of the console with an 80 gigabyte hard drive around this time. In October, a version of the PlayStation 3 with a 40 gigabyte hard drive was introduced. This model could not play PlayStation 2 games, but games made for the original PlayStation could still be played. The price of the 60 gigabyte model was also further reduced. A white version of the 40 gigabyte model was released in Japan in November. Since 2009, the PS3 was sold in a new, slimmer, and more efficient model with a 160 GB or 320 GB of hard drive memory. In 2012, a slimmer model released to replace the last model. This was the final model released and the Playstation 3 was discontinued October 31, 2016. ==Discontinuation== The PS3 was discontinued in New Zealand on September 29, 2015, in Europe and Australia on March 31, 2016, in North America on October 31, 2016, and in Japan on May 29, 2017, though third-party games are still being made for the system. ==References== Category:Sony Category:PlayStation (brand) Category:Sony consoles Category:Seventh generation consoles",
 "title": "PlayStation 3"
}