{
 "id": "1080372",
 "text": "\"Ahwak\" (), (), is a song by Egyptian singer-songwriter Abu. The song, at first released as a promotional single from, was released on August 25, 2019 from the soundtrack album, Al Anesa Farah – Music from the Original TV Series. The song was released by Dream Studio, Universal Music Latino, Universal Arabic Music, Universal Music MENA and Republic Records as Abu wrote the song with written by Abu and his guitarist and producer Abu and Benny Blanco. \"Ahwak\" is being released as a single in promotion of the official soundtrack for Nickelodeon and MBC4 original series the television serial drama Miss Farah. \"Ahwak\" was inspired by Abu's dissatisfaction and loneliness from work- focused life in Los Angeles while she was finishing recording Al Anesa Farah – Music from the Original TV Series. Music critics praised its acoustic sound and Abu's vocals. It was released on August 25, 2019, by Universal Arabic Music and Republic Records. A fragment of the song can be heard in trailers for the background in episode 16 of the first season of the MBC4, Nickelodeon and Dubai One series: \"Al Anisa Farah\", in the song scene. \"Ahwak\" reached the top five on the Billboard Hot 100 chart. It won both the the Grammy Award for Best Song Written for Visual Media in 2021. == Background and release == \"Ahwak\" was written by Abu and Mokhtar El Sayeh, while production was handled by Abu and Mokhtar El Sayeh. Abu was motivated to write the song when she was in Los Angeles finishing her debut album, Al Anesa Farah – Music from the Original TV Series (2020). Dissatisfied with the city and its industrial environment, she found herself lonely and disappointed – prioritising work, without a social life. The song was released on August 25, 2019. It serves as a single from the soundtrack of the MBC4 and Nickelodeon original series Miss Farah, which also stars Abulyazeid as renowned poet Farah. Abu announced the song via her social media accounts on August 25, 2019. == Credits and personnel == Adapted from TIDAL. Recorded at Dream Studio. Production * Massari – additional production, songwriting; production, executive production * Mokhtar El Sayeh – arrangement; production, bass * Abu – songwriting; lyrics; vocals; background vocals, backing vocals, vocal production, vocal arrangement, audio engineering, guitar, ukulele * Martin Adium Sinotte - songwriting; production; mixing * Ahmed El Sennnary – piano * Benny Blanco – composition, production, programmer, keyboards Technical * Shady Fekry – mixing, mastering, recording engineer * Moheb Safa – recording engineer * Solly – trumpet * Mohamed Labib – saxophone * Mohamed Safwat – saxophone * Ramy Samir – drums * Mafdy Thabet – recording engineer * Colin Leonard – mastering engineer * Martin \"Kemyst\" Sinotte – mixing Recording and management * Mastered, mixed, recorded and produced at Dream Studio (Cairo, Egypt), Abbey Road Studios (London, England), Metropolis Studios (London, England) * Orchestra recorded at Abbey Road Studios Orchestra (London, England), Metropolis Studios (London, England) * Mixed at Dream Studio (Cairo, Egypt), Abbey Road Studios (London, England), Metropolis Studios (London, England) * Mastered at Dream Studio (Cairo, Egypt), Abbey Road Studios (London, England), Metropolis Studios (London, England) == Composition == \"Ahwak\" is an with a quiet arrangement accompanied by The song is written in the key of G major with a tempo of 110 beats per minute. == Music video == The song's accompanying music video premiered on July 24, 2020, on Nickelodeon and S Productions's Vevo account on YouTube. The music video was directed by Wael Farag & Ahmed El Gendy and produced by Sally Wally. The accompanying music video for \"Ahwak\" was released alongside the song. == Commercial performance == \"Ahwak\" debuted on The single also topped various major charts, debuted at the top of nine local charts within 4 hours of its release, including MBC4, Free TV, MTV, NickMusic, NickMusic EMEA, MTV Global, MBC+ Variety and Dubai One. == Usage in media == * The song is also has been featured in the television series used as the background for one of the scenes in chapter 1 and chapter 2 and chapter 16 of the first season of the American comedy television series Al Anisa Farah. It is featured in the scenes in chapter 66 of the third season of the comedy Al Anisa Farah and is part of the soundtrack of Chapter 109 of the fifth season of the comedy. Likewise, it also appears in episode 110 of season 5 of the series \"Al Anisa Farah\". * It was also used in the initial trailer of Al Anisa Farah during an directors Wael Farag and Ahmed El Gendy. == Track listing == ;Digital download and streaming * 1. \"Ahwak\" – 4:28 ;CD single * 1. \"Ahwak\" – 4:28 * 2. \"Ahwak\" (Instrumental) – 4:28 == Release history == Region Date Format(s) Label(s) Various Dream Studio, Republic Records, Universal Arabic Music, Universal Music MENA Radio == References == Category:2019 songs Category:Funk songs Category:Funk pop songs Category:R&B; songs Category:Pop songs Category:Latin pop songs Category:Jazz songs Category:Jazz pop songs Category:Debut singles Category:Doo-wop songs Category:Blue-eyed soul songs Category:Grammy Award-winning songs Category:Nickelodeon",
 "title": "Ahwak (Abu song)"
}