{
 "id": "1080826",
 "text": "The Gray catbird (Dumetella carolinensis), (also spelled grey catbird), is a medium sized North American and Central American bird. It is the only member of the \"catbird\" genus Dumetella. It is the basal lineages of the Mockingbird family, closely related to the thrasher and tremblers then the mockingbirds. In some areas it is known as the slate-colored mockingbird. == Behavior == === Breeding === Their breeding habitat is somewhat open areas with thick, low plants; they are also found in cites, and neighborhoods. These birds mainly look for food on the ground in leaf piles, but also in shrubs and trees. They mainly eat arthropods and berries. In the winter they eat more fruit. They build a bulky cup nest in a shrub or tree, close to the ground. Eggs are light blue in color. They lay about 1 to 5 eggs, with 2 to 3 eggs being the most common. Both parents take turns feeding the young birds. === Feeding === Gray catbirds are omnivores (eat animals and plants), and about 50% of their diet is fruit and berries. They also eat worms, beetles, and other bugs. In summer, gray catbirds will eat mostly ants, beetles, grasshoppers, caterpillars, and moths. They also eat berries from holly, cherries, elderberries, poison ivy, and blackberries. They also peck at the eggs of other birds, but it is unknown if they do this to eat the eggs or just to get rid of them. == Pictures == File:Gray_catbird_(85315).jpg|link=https://en.wikipedia.org/wiki/File:Gray_catbird_(85315).jpg|Gray catbird in Prospect Park File:Dumetella_carolinensis- calling.jpg|link=https://en.wikipedia.org/wiki/File:Dumetella_carolinensis- calling.jpg|alt=Calling at Naperville Riverwalk, IL|Calling at Naperville Riverwalk, Illinois File:Dumetella_carolinensis_- Wildwood_Preserve_Metropark,_Toledo,_Ohio,_USA_-calls-8.ogv|Adult voicing cat- like sounds at Wildwood Preserve Metropark, Ohio File:Catbird_in_Central_Park_(14585).jpg|link=https://en.wikipedia.org/wiki/File:Catbird_in_Central_Park_(14585).jpg|In a crab apple tree in New York File:Gray_Catbird_nest_and_egg.jpg|link=https://en.wikipedia.org/wiki/File:Gray_Catbird_nest_and_egg.jpg|Nest and egg in a cedar shrub 4 ft above the ground File:Grey_catbird_(Dumetella_carolinensis)_Orange_Walk.jpg|link=https://en.wikipedia.org/wiki/File:Grey_catbird_(Dumetella_carolinensis)_Orange_Walk.jpg|In Belize File:Grey_catbird_(Dumetella_carolinensis)_feeding_on_custard_apple_(Annona_reticulata)_Orange_Walk.jpg|link=https://en.wikipedia.org/wiki/File:Grey_catbird_(Dumetella_carolinensis)_feeding_on_custard_apple_(Annona_reticulata)_Orange_Walk.jpg|Feeding on custard apple (Annona reticulata) == References == Category:Passeri Category:Birds of North America",
 "title": "Grey catbird"
}