{
 "id": "1080413",
 "text": "Janusz Bugajski (born 23 September 1954) is a senior fellow and analyst at the Jamestown Foundation in Washington, D.C. He also hosts a television show called \"Bugajski Hour\" which is broadcast in the Balkans. Bugajski is the chair of the Southern and Central European Studies Program at the Diplomatic Service Institute of the United States Department of State. He has worked as a consultant on Eastern European affairs at various organizations and for United States government agencies. He regularly testifies before the United States Congress. == Life and career == In 1954 he was born to Piotr Bugajski (a teacher) and Jadwiga (Kavska) Bugajski in Nantwich, Cheshire, England. He is of Polish descent and is bilingual in English and Polish. === Education and early career === In 1977 he received a Bachelor’s degree with honors from the University of Kent in Canterbury, Great Britain. Four years later he received a Master's degree in philosophy and a Doctorate in social anthropology from the London School of Economics and Political Science. From 1981 to 1983, Bugajski worked as a consultant (a professional who provides advice in their field of expertise) on Polish affairs at BBC television in London. From 1984–1985, he worked as a senior researcher analyst at Radio Free Europe/Radio Liberty (RFE/RL) in Munich, Germany. === Center for Strategic and International Studies === In 1986, Bugajski joined the Center for Strategic and International Studies (CSIS) in Washington, D.C., where he would hold several jobs. He served as Associate Director from 1986 to 1993, and in 1993 he became their Director of East European Studies. Later he served as the Director of CSIS's New European Democracy Program. === Consultant on Eastern European affairs === Throughout his career, Bugajski has worked as a consultant on Eastern European affairs for organizations and US government agencies, including the US Agency for International Development (USAID), the US Department of Defense, the International Republican Institute (IRI), the Institute of Free Trade Unions (AFL–CIO), the Council on International Studies and Exchanges (IREX) and BBC Television in London. During his career, Bugajski has also been an associate professor at American University; a teacher at the Smithsonian Institution; an analyst at the Woodrow Wilson Center, a non- partisan think tank; and a consultant to the International Republican Institute. He is a member of the American Association for the Advancement of Slavic Studies. == Awards == Bugajski was awarded grants in 1988 from the Earhart Foundation and in 1989 from the Linda and Harry Bradley Foundation. In 1991, the Center for Strategic and International Studies gave him a leadership award. In 1998, in recognition of his contributions to international affairs, he received the Distinguished Public Service Award from the United States Department of State, the United States Agency for International Development (USAID), the United States Information Agency (USIA), and the Arms Control and Disarmament Agency. In 2010, he was awarded the Thanks of the Polish Free Trade Union Solidarity. == Editorial work == Bugajski is a regular contributor to various American and European newspapers and magazines.Articles and Papers as well as presentations and interviews of Bugajski on the CSIS website. His 1992 volume Nations in Turmoil: Conflict and Cooperation in Eastern Europe (Westview, 1992) was selected by Choice as an outstanding academic book.In WorldCat are listed until now 204 publications of Janusz Bugajski. Two years later, he published Ethnic Politics in Eastern Europe: A Guide to Nationalities, Politics, Organizations, and Parties (M.E. Sharpe, 1994). Both books focus on the tension between Russia and the West; Russian \"neo- imperialism\" in various conflict regions; and the lessons of the Russian- Georgian war in August 2008. === Selected publications === Bugajski has published extensively in his fields of expertise. According to the CSIS's web page, he published the following writings: * Failed State: A Guide to Russia's Rupture (Jamestown Foundation, 2022) ; * The Eurasian Divide: Russia's Vulnerable Flanks (Jamestown Foundation, 2016); * Conflict Zones: Comparing the North Caucasus and the Western Balkans (Jamestown Foundation, 2014); * Reclaiming the Balkans: Challenges to European Integration and US Disengagement (Strategic Studies Institute, US Army War College, 2013); * Lessons from Georgia: The Conflict of Russian and Western Interests in Wider Europe (CSIS Press, 2010); * Dismantling the West: Russia's Atlantic Agenda (Potomac Books, 2009); * America's New European Allies (Nova, 2009); * Expanding Eurasia: Russia's European Ambitions (CSIS, 2008); * Atlantic Bridges: America's New European Allies, with Ilona Teleki ( Rowman and Littlefield, 2007); * Cold Peace: Russia's New Imperialism (Praeger, 2004); * Political Parties of Eastern Europe: A Guide to Politics in the Post-Communist Era (ME Sharp, 2002); * Ethnic Politics in Eastern Europe: A guide to national politics, organizations, and parties (M. IS. Sharp, 1994); * Nations in Disarray: Conflict and Cooperation in Eastern Europe (Westview, 1993, 1995); * Fourth World Conflicts: Communism and Rural Societies (Westview, 1991); * Sandinista Communism and Rural Nicaragua (Praeger/CSIS, 1990); * East European Fault Lines: Dissent, Opposition, and Social Activism (Westview Press, 1989); * Czechoslovakia: A Decade of Charter 77 Dissent (Praeger/CSIS, 1987); Bugajski also wrote the following publications for the Center for European Policy Analysis: * Is Bosnia a Ticking Time Bomb? (January 6, 2020) * Vulnerable Europe (March 4, 2020) * Mind the Gap (April 10, 2020) == References == == Other websites == * Jamestown senior staff * Who's Who in Polish America, Janusz Bugajski Category:Political scientists Category:American political scientists Category:Alumni of the London School of Economics Category:1954 births Category:Living people Category:British writers",
 "title": "Janusz Bugajski"
}