{
 "id": "1080401",
 "text": "Skibidi Toilet is a Georgian 3D animated series. The show was created by Alexey Gerasimov. Skibidi Toilet is about a race of creatures called Skibidi Toilets, which are toilets with human heads in the bowls, and their war with another race of creatures called Cameramen. The videos use as their animation engine tool. ==Plot== The series is about a war between the Skibidi Toilets and the Cameramen. Cameramen look like humans, but their heads can be a CCTV camera, loudspeaker, or television. In a city, the Skibidi Toilets, and their leader G-Man, turn humans into toilets. The cameramen ally against the toilets. Each has one of its kind that is a lot bigger than the rest called \"titans\". The number two toilet, named Scientist Toilet, makes a toilet parasite that infects the Speaker Titan, leading to death. Later in the series, TV men and their own titan enter the story. With their help, the speaker titan is freed from the toilet parasite. The battle spreads to other cities. After a mission, Scientist Toilet is defeated, but the whole team is killed except for one survivor. The one survivor is killed by the Secret Agent, a human who may have created the toilets. The Titans fight G-Toilet and the fight badly hurts Camera Titan and Speaker Titan. Then the Skibidi Toilets and Cameramen team up to fight the more dangerous Astro Toilets. ==Development== ===Origin=== The origin of Skibidi Toilet can be seen back from February 2023, when the creator, Alexey Gerasimov, made his first video for Skibidi Toilet. The music that he used is a remix of Give It To Me by Timbaland and Dom Dom Yes Yes by Biser King. ===Spread=== Skibidi Toilet videos spread across social media. A large amount of that popularity came from platforms such as TikTok, YouTube, X, Instagram, and Facebook. The videos get over 30 million views per video on the YouTube video streaming platform and have 18,309,401,823 views on his YouTube Channel. DaFuq!?Boom! has accounts on YouTube and TikTok where episodes of the series are posted. Near the end of June 2023, the YouTube channel had 15.8 million subscribers, and the TikTok channel had 2.8 million followers. It is considered \"brainrot\", and a brainrot word, along with terms like sigma, and mewing. There has also been unofficial merchandise on dropshipping platforms such as Alibaba and Amazon, but there is official merch on the Skibidi Toilet website. ===Revenue=== The videos on YouTube earn the creator Alexey Gerasimov an estimated 100k – 23 million USD every year. Every year he will make about 1.2 million – 19.5 million USD. This is only from YouTube, and Gerasimov makes more money from Skibidi Toilet merch. ==Impact== The Skibidi Toilet meme has influenced internet memes and online trends. The meme has been referenced in many forms of media, including TV shows and adverts. ==References== Category:Web series Category:Internet memes",
 "title": "Skibidi Toilet"
}