{
 "id": "1080780",
 "text": "The 2025 FIM MotoGP World Championship will be the premier class of the 77th F.I.M. Road Racing World Championship season. == Teams and riders == Entrant Constructor Chassis Race rider No. Rider Name Aprilia Racing Aprilia RS-GP25 1 Jorge Martin 32 Lorenzo Savadori 72 Marco Bezzechi Trackhouse Racing MotoGP 25 Raùl Fernandez 79 Ai Ogura Ducati Lenovo Team Ducati Desmosedici GP25 63 Francesco Bagnaia 93 Marc Marquez Pertamina Enduro VR46 Racing Team 49 Fabio Di Giannantonio Desmosedici GP24 21 Franco Morbidelli BK8 Gresini Racing MotoGP 54 Fermín Aldeguer 73 Alex Marquez LCR Honda Castrol Honda RC213V 5 Johann Zarco LCR Honda Idemitsu 35 Somkiat Chantra Honda HRC Castrol 10 Luca Marini 36 Joan Mir Red Bull KTM Factory Racing KTM RC16 33 Brad Binder 37 Pedro Acosta Red Bull KTM Tech3 12 Maverick Viñales 23 Enea Bastianini Monster Energy Yamaha MotoGP Yamaha YZR-M1 20 Fabio Quartararo 42 Álex Rins Prima Pramac Racing 43 Jack Miller 88 Miguel Oliveira 7 Augusto Fernández All teams use series-specified Michelin tyres. === Team changes === * Red Bull GasGas Tech3 will revert to the Tech3 KTM name and will use factory spec bikes. * Prima Pramac Racing will switch from Ducati to Yamaha on a seven-year deal. * Repsol will end their collaboration with Honda Racing Corporation after 30 years. === Rider changes === * Fermín Aldeguer signed a Ducati factory contract in March 2024, and was confirmed to be racing for Gresini Racing on 28 August 2024 replacing the factory Ducati bound Marc Márquez. * Aleix Espargaró announced his retirement from racing at the 2024 Catalan Grand Prix. * Pedro Acosta will move to the Red Bull KTM Factory Racing team, replacing Jack Miller. * Marc Márquez and Jorge Martín were linked with the Lenovo Ducati factory squad all throughout the first half of the season as the top performing Ducatis. In Barcelona and Mugello, it was set to be confirmed that Jorge Martin would replace Bastianini, but after the Italian Grand Prix weekend, it was reported that Marquez was chosen to replace Bastianini. During the Mugello Test, Jorge Martín announced that he would be joining Aprilia Racing, replacing the retiring Aleix Espargaró. 2 days later, Ducati announced that Marc Márquez would join their factory team alongside Francesco Bagnaia. * KTM announced Enea Bastianini and Maverick Viñales would join their Tech3 team, replacing Pedro Acosta and Augusto Fernández. * Aprilia Racing announced that Marco Bezzecchi would join alongside Jorge Martín, replacing Maverick Viñales. * Miguel Oliveira signed an Yamaha factory contract and will be riding for Prima Pramac Racing. == Calendar == The following Grands Prix are confirmed to have a date in the 2025 season: Date Grand Prix Circuit 1 2 March Thailand Grand Prix Chang International Circuit, Buriram TBD 11 May French motorcycle Grand Prix Circuit Bugatti, Le Mans TBD 25 May British Grand Prix Silverstone Circuit, Silverstone TBD 13 July German Motorcycle Grand Prix Sachsenring, Hohenstein-Ernstthal TBD 17 Aug Austrian motorcycle Grand Prix Red Bull Ring, Spielberg ==References== Category:2025 in sports Category:2020s in motorsport Category:Grand Prix motorcycle racing",
 "title": "2025 MotoGP World Championship"
}