{
 "id": "1080789",
 "text": "\"Durag Activity\" (wrote in all lowercase) is a song by American rappers Baby Keem and Travis Scott, released on April 30, 2021, by Columbia Records and PGLang as one of the singles from Keem's first studio album The Melodic Blue (2021). The song was written by Keem and Scott with producer Brick!. == Background == The song was announced by Baby Keem on April 21, 2021, before it was released in April 30. In May 2021, Madonna posted a photo of herself wearing a bandana with \"durag activity\" in the captions on Twitter. Keem responded to the post with, \"...Can I send you a Durag?\" and then he said, \"did I humble Madonna?\" == Composition == Wongo Okon of Uproxx describes the song as Baby Keem \"leading the way with near-mumble raps\" before Travis Scott \"arrives with his trademark autotune croons (style)\". In the song, Baby Keem and Travis Scott talk about \"money, influence, and women in their lives\", which they describe as \"durag activity\", over a \"clicking, slinking\" beat. \"Distorted piano chords\" can also be heard in the instrumental. == Critical reception == Sophie Caraan of Hypebeast said, \"The effortless (easy) delivery from both Keem and Scott provide a new layer of texture for the bars they drop (lyrics) — which are mostly about getting rich — and almost gives it a new meaning, putting emphasis on the importance fusion of flow, cadence and lyricism.\" Erika Marie of HotNewHipHop called the song \"laid back\" and \"slow- burning\". == Music video == The music video for the song was released on April 30, 2021. Directed by Eliel Ford, it shows Baby Keem as a mob boss and opens with him in a suit, rapping his verse while someone in the background is beat up. After \"laying hands on an enemy\", Keem gets tied to a chair with Travis Scott, but they \"get out the situation\". == Charts == Chart (2021) Peak position 53 77 Lithuania (AGATA) 67 New Zealand Hot Singles (RMNZ) 6 96 85 38 == Certifications == == References == Category:Baby Keem songs Category:2021 songs",
 "title": "Durag Activity"
}