{
 "id": "1080552",
 "text": "Willard Frank Libby (1908-1980) is known for developing radiocarbon dating, a process that revolutionized archaeology and palaeontology. In 1960, he won the Nobel Prize in Chemistry for his contributions to the team that developed the process. Prior to this, he worked on radioactive elements and designed sensitive Geiger counters to measure weak natural and artificial radioactivity. During World War II, Libby worked for the Manhattan Project and developed the gaseous diffusion process for uranium enrichment. After the war, he became a professor at the University of Chicago's Institute for Nuclear Studies, where he developed the technique for dating organic compounds using carbon-14. He also discovered that tritium and carbon-14 could be used for dating water, wine, and other materials. From 1954 to 1959, Libby served as a commissioner of the Atomic Energy Commission, where he sided with Edward Teller on pursuing a crash program to develop the hydrogen bomb. He also participated in the Atoms for Peace program and defended atmospheric nuclear testing. In 1959, Libby left the AEC to become a professor at UCLA, where he established the first Environmental Engineering program and served as a member of the California Air Resources Board. He also served as the director of the University of California's Institute of Geophysics and Planetary Physics, retiring in 1976 == Early life and career == Willard Frank Libby was born in Colorado and grew up in California, attending the University of California Berkeley where he earned his Ph.D. in chemistry. He was fascinated by radioactive elements and worked on building sensitive Geiger counters to measure weak natural and artificial radioactivity. In the 1930s, he received a fellowship to work at Princeton University. After graduating, Libby became an assistant professor in the department of chemistry at the University of California, Berkeley, in 1938. Two years later, he was appointed Instructor in the department. Libby's work was interrupted by his participation in World War II, where he worked in the Manhattan Project's Substitute Alloy Materials (SAM) Laboratories at Columbia University, developing the gaseous diffusion process for uranium enrichment. He returned to Berkeley after the war and was appointed professor of chemistry in 1954. In 1959, Libby left the AEC to become a professor at UCLA, where he established the first Environmental Engineering program and served as a member of the California Air Resources Board. He also served as the director of the Institute of Geophysics and Planetary Physics and retired in 1976. == Manhattan Project == In 1941, Libby began working on the Manhattan Project, the US project to develop atomic bombs, as part of the Substitute Alloy Materials (SAM) Laboratories in New York City. He worked on the gaseous diffusion process to separate uranium-235 from the more abundant uranium-238. The SAM Labs were tasked with finding a way to separate out this rare isotope, which made up only 0.7 percent of natural uranium. Libby and his team studied different barriers to use in the uranium hexafluoride and successfully developed the Norris-Adler barrier, which underwent several tests. Eventually, the team was able to successfully enrich uranium to 23 percent, which was used in the Little Boy bomb dropped on Hiroshima. Libby's work on the gaseous diffusion process was essential in the development of the atomic bomb. == Radiocarbon dating == After World War II, Libby accepted a professorship at the University of Chicago, where he studied radioactivity and later developed a method to use carbon-14 to determine the age of objects in archaeology, geology, geophysics, and other branches of science. He also discovered that tritium, like carbon-14, could be used to date water and wine. In 1960, he was awarded the Nobel Prize in Chemistry for his method, which revolutionized archaeology and other fields that study ancient artifacts. == UCLA == After leaving the US Atomic Energy Commission (AEC), Libby became a professor of chemistry at the University of California, Los Angeles and the director of the statewide Institute of Geophysics and Planetary Physics. He also founded the first Environmental Engineering program at UCLA and served on the California Air Resources Board, working to develop and improve air quality standards. Despite his retirement, Libby remained active in his field until his death in 1980. == Awards and honors == Libby was a respected scientist who received many awards and honors during his career, including a Nobel Prize for his work on carbon dating and his contributions to archaeology, geology, geophysics, and other fields. He was elected to the National Academy of Sciences and the American Academy of Arts and Sciences, and received awards such as the Chandler Medal, Remsen Memorial Lecture Award, Bicentennial Lecture Award, Nuclear Applications in Chemistry Award, Willard Gibbs Award, Albert Einstein Medal, Franklin Institute's Elliott Cresson Medal, Arthur L. Day Medal, American Chemical Society's Joseph Priestley Award, Geological Society of America's Arthur L. Day Medal, Gold Medal of the American Institute of Chemists, Lehman Award, and more. The University of Chicago received a citation for his work on radiocarbon dating. == Personal life == He was married to Leonor Hickey for a short period in the early 1940s and they had two daughters. He then married Leona Woods Marshall, a nuclear physicist, in 1966 and they stayed together until his death in 1980. The couple had two stepchildren from Marshall's first marriage. He died from complications related to pneumonia. His papers were donated to the Charles E. Young Research Library at UCLA. Category:1908 births Category:1980 deaths Category:Nobel Prize in Chemistry winners Category:Scientists from California Category:Columbia University faculty Category:University of Chicago faculty Category:University of California, Los Angeles faculty",
 "title": "Willard Libby"
}