{
 "id": "1080926",
 "text": "Ali Baba and the Forty Thieves (Arabic: علي بابا والأربعون لصا) is a middle eastern folktale in Arabic. It was added to One Thousand and One Nights in the 18th century. One Thousand and One Nights is a collection of Middle Eastern folktales. Many different versions of the story have been told till now in various languages, with some differences in title and details. ==Origin== The tale was first stored in the collection during 18th-century by a French translator named Antoine Galland, who used to study the language, culture, history, or customs of countries in Asia. He wrote the tale from the oral traditions of a Syrian Maronite storyteller Hanna Diyab. It was not a part of the original collection which was in Arabic version, but was instead added to the collection later on by Antoine Galland after he heard it from Hanna Diyab during Diyab's visit to Paris in 1709.John Payne, Alaeddin and the Enchanted Lamp and Other Stories, (London 1901) gives details of Galland's encounter with 'Hanna' in 1709 and of the discovery in the Bibliothèque Nationale, Paris of two Arabic manuscripts containing Aladdin and two more of the added tales. Text of \"Alaeddin and the enchanted lamp\" ==Story== Years ago, two brothers named Ali baba and Cassim (also spelled Qasim) lived in Persia. After the death of their father, who was a merchant; both the brothers together managed their father's business. Elder brother Cassim was very greedy. He took over the entire business in a wrong way and threw Ali baba out of the house. After this, Ali baba went to some colony and started living a life of poverty in a hut with his wife. He used to go to the forest every day, cut wood and sell it in the market to earn his living. One day, while Ali baba was cutting wood in the forest, he overhear a group of 40 thieves who were coming to their secret location with bundles of gold coins. Seeing this he understood that all of them were thieves. Ali baba hid behind a tree and started watching them. The leader of the thieves stood in front of a cave and said, \"open sesame\"; After this, the door of that cave opened up and all the 40 thieves went inside that cave. While going inside, the last thief said, \"close seasame\", and the door of the cave closed. When the thieves and their leader left the cave, Ali baba went to the cave himself and chanted the same words, \"open seasame\" on which the door opened up. Ali baba then takes a single bag of gold coins to his home. After going home, Ali baba told his wife about this whole story. His wife was surprised to see so many Ashrafis-(name of local money in Arabic) together and sat down to count them. Then Alibaba said that there are so many gold coins that it would take whole night to count them. He dig a hole and hid the gold, so that no one suspects them. Ali baba's wife said - We cannot count them, but I can weigh them for an estimate. Ali Baba's wife ran to Cassim's house and asked his wife for scales to weigh the wheat. Seeing this, Cassim's wife became suspicious of him. She thought how these poor people suddenly had so much wheat. She went inside and after putting some glue under the scale, she gave it to her. At night, Ali baba's wife weighed all the Ashrafis and returned their scales early in the morning. When Cassim's wife turned the scale upside down, there was a gold coin stuck on it. She told this to her husband. Cassim and his wife became very angry. Both of them did not sleep the whole night. As soon as the morning came, Cassim went to Alibaba's house and started asking him about the source of his money. Hearing this, Alibaba said that you have some misunderstanding. I am just a simple woodcutter. Cassim said that your wife had taken the scales from our house yesterday to weigh the \"ashrafis\". Look, this gold coin has been found stuck on the scale. Tell me the whole truth or I will tell everyone that you are a theif. Hearing this, Ali baba told the whole story truthfully. Cassim got greedy in his mind. He made a plan to grab that treasure and reached the cave the next day. He also took a donkey with him, so that he could load the treasure on it. After reaching the cave, he did as Ali baba had told him. As soon as he said 'Open seasame', the door of the cave opened. After reaching inside, he was very shocked to see the treasure all around. He filled the sacks with gold coins but forgot what to say while going out. Cassim made many attempts to get out of the cave, but could not find any way. He gets imprisoned inside the cave. After some time, when the gang of thieves reached there, they saw that a donkey was tied outside. They understand that someone has come here. The thieves went inside and the moment they find Cassim, they kill him. When his brother does not come back, Ali baba goes to the cave to look for him, and finds the body quartered and with each piece displayed just inside the cave's entrance, as a warning to anyone else who might try to enter. Ali baba brings the corpse home and buried it, declaring it a natural death without telling anyone. At the request of Cassim's wife, Ali baba and his wife start taking over Cassim's business and start living with her. The thieves, finding the body gone, realize that another person must have known their secret, and so, they set sent one of the thief to track him down. He goes to the village and finds out in a few days whose house has died. The thieves find Ali baba's house. The thief put a cross mark outside his house, so that it would be easier for them to recognize his house at night. At the same time, when Ali baba saw the cross mark outside his house, he understood that the thieves had found the house. He put a similar sign outside everyone's house. When the thieves came at night, they became confused after seeing such marks on everyone's house and went back. The leader of thieves was not one to sit quietly. He sent his men to that locality to find out who had recently become rich there. From this he came to know about Ali baba. He recognized her house well and reached her house at night disguised as an oil merchant. He took with him 40 oil casks, of which 39 contained thieves and one cask contained oil. He thought that when everyone would sleep at night, they would all together kill Ali baba. He befriended Ali baba and asked permission to stay at his house for the night. Ali baba fed him and allowed him to stay for the night. Morgiana (Arabic: مرجانة Murjāna), a clever slave-girl from Cassim's household discovers the plan, killing the 38 thieves in their oil jars by pouring boiling oil on them. When their leader comes to call his men, he discovers they are all dead so he escapes. The next morning, Morgiana tells Ali baba about the thieves in the jars. They bury them, and Ali Baba shows his thankfulness by giving Morgiana her freedom. Now, Ali baba was the only owner of all the treasures of those forty thieves as well as of his father's business. He had become the richest man in the country and started living happily with his wife and children. ==Gallery== File:עלי באבא מתחבא על העץ.jpg|Ali Baba overhearing one of the thieves saying \"Open Sesame\". File:Robida - Ali-baba page12.jpg|A member of the Forty Thieves tries to discover the location of the house of Ali Baba. File:Robida - Ali-baba page13.jpg|Morgiana pours boiling hot oil into the jars in which the thirty nine Thieves were hiding. ==Related pages== * Aladdin * Sinbad the Sailor * Scheherazade * Ali Baba (TV series) ==References== ==Other websites== * Arabian Nights at the Internet Movie Database * Ali Baba and the Forty Thieves (e-text, in English, at Bartleby.com) *Ali Baba and the Forty Thieves (Kids version at Vedantu.com) Category:Folklore Category:One Thousand and One Nights Category:Arabic literature",
 "title": "Ali Baba and the Forty Thieves"
}