{
 "id": "1080324",
 "text": "Philipp Hosiner (15 May 1989 in Eisenstadt) is an Austrian football player. The striker plays for Young Violets Austria Wien in the Regionalliga Ost (3rd tier). He is a former Austrian national player. ==Career == Philipp Hosiner started his career at SC Eisenstadt. Then he played for SV St. Margarethen. He later played for Academy Burgenland. 2006 joined the youth department of TSV 1860 Munich. In 2008 he became part of the second team. There he was top scorer. 2009 he went to SV Sandhausen. There he made his professional debut. He then went back to Austria. In the 2010/11 season he played for First Vienna FC. First Vienna Homepage After a season he moved to Bundesliga promoted team FC Trenkwalder Admira in June 2011. On 31 August2012, FK Austria Wien signed him. At the end of the 2012/13 season, Hosiner became Austrian champion with Austria and was the league's top scorer with 32 goals. He also was elected best player of season. He was signed by the French first division club Stade Rennes in the summer of 2014. In January 2015, during a medical check at 1. FC Köln, a two-kilogram tumor was discovered on Hosiner's left kidney. He had a successful operation. Eleven weeks after the operation he played for the first time in the Stades Rennes reserves. Hosiner finally moved to 1. FC Köln on loan for the 2015/16 season. FC Köln Homepage Hosiner did not return to Rennes for the 2016/17 season. He 1. FC Union Berlin in the 2nd Bundesliga. For the 2018/19 season, Hosiner returned to Austria. He played for SK Sturm Graz. The following season he played again in Germany for Chemnitzer FC in the 3rd league. For the 2020/21 season he moved to third division club Dynamo Dresden. With the team he was promoted to the 2nd league. In the following season he lost his place an moved to Kickers Offenbach. In 2023 he went back to Austria Wien and played for the 2nd team in the Regionalliga Ost. FK Austria Wien Homepage (German) ==International == Hosiner played regularly for the Austrian youth national teams. In autumn 2011, the striker was called up to the senior national team for the first time . He made his debut on 7 October 2011 in the game in Baku against Azerbaijan. He scored his only two goals on 22 March 2013 in a 6-0 win against the Faroe Islands. ==References == Category:1989 births Category:Living people Category:Austrian footballers Category:Players of the Austrian national football team Category:Association football forwards Category:Austrian football forwards Category:Austrian Football Bundesliga top scorers Category:FK Austria Wien players Category:Austrian football champions",
 "title": "Philipp Hosiner"
}