{
 "id": "1080513",
 "text": "Anna Elzhbeta Fotyga ( ; pronounced [ˈanna fɔˈtɨɡa] nee Kavetska; born 12 January 1957, Lembork, Poland is a Polish politician, member of the European Parliament and general secretary of the Party of European Conservatives and Reformists (ECR) . She held the position of Minister of Foreign Affairs of Poland. In the offices of Kazimierz Marcinkiewicz and Jarosław Kaczyński (2006–2007) she was head of the Office of the President of the Republic of Poland (2007–2008). She was permanent speaker of the Forum of the Free States of Post-Russia (2022-2023). == Biography == She graduated from the Faculty of Foreign Trade of the University of Gdańsk . She started her career in the external relations department of the Solidarity trade union in 1981. After 1989, she was head of the external relations department of \"Solidarity\". She was the deputy mayor of Gdańsk (2002–2004), a member of the European Parliament (2004–2005), the Minister of Foreign Affairs of Poland (2006–2007), the head of the Administration of President Lech Kaczyński (2007–2008), an expert on foreign relations of the Law party and justice\", a member of the Seimas — the lower house of the Polish parliament . === A career in national politics === Anna Fotyga won 25,994 votes (second place in the region) in the 2004 European Parliament elections as a candidate for the Law and Justice (PiS) party in the Pomeranian Voivodeship . On May 9, 2006, President Lech Kaczyński appointed Fotyga as the Minister of Foreign Affairs of the Republic of Poland instead of Stefan Möller. The opposition criticized her department for pursuing a policy of isolation towards Russia and Germany. On September 7, 2007, Fotyga was dismissed. She was reappointed on the same day. The Prime Minister and the President avoided her dismissal through a vote of no confidence prepared by the Civic Platform. After the fall of the Kaczyński administration in 2007 , Radosław Sikorski was appointed as Minister of Foreign Affairs of the Republic of Poland. Until August 20, 2008, Fotyga was the head of the Office of the President of the Republic of Poland . === Member of the European Parliament 2014 === From 2014 to 2019, Fotyga served as the head of the European Parliament Subcommittee on Security and Defense . Since then, she has been a full member of the Committee on Foreign Affairs of the European Parliament and its subcommittee on security and defense. In 2015, the media reported that Fotyga was in the Russian list of people from the European Union who are prohibited from entering the country. In 2020 , NATO Secretary General Jens Stoltenberg appointed Fotyga to join a group of experts to support the work of further strengthening NATO's political dimension === Political positions === Fotyga's position on foreign affairs coincides with the political position of Law and Justice, which is based on the concept of Poland as a strong, independent country, ready to stand up to Russia or Germany when necessary. It pursued a policy of close cooperation with the United States. On November 23, 2016, Fotyga was the author of the European Parliament resolution \"Strategic communications of the EU as a countermeasure against third-party propaganda\" (on information countermeasures by the Russian media) regarding countering propaganda against the EU. This includes censorship of Russian media such as RT and Sputnik The resolution compares the influence of the Russian media to ISIS propaganda. The proposal was criticized by the Russian government and the European Federation of Journalists. Fotyga: > \"Most of my life, under the communists and after them, was devoted to > fighting the rhetoric planted by the Soviet Union and then the Russian > Federation\" In January 2023, the Euractiv media published an article by Anna Fotyga, in which she claims that > \"there is no and cannot be Russian gas, oil, aluminum, coal, uranium, > diamonds, grain, forest, gold, etc. All these resources are Tatar, Bashkir, > Siberian, Karelian, Oirat, Circassian, Buryat, Yakut, Ural, Kuban, Nogai and > so on...Mikhail Lermontov stole the legends of the conquered Circassians, > and the ethnic Ukrainian Mykola Gogol was always denied national self- > awareness by the Russians...The prospects should be discussed creation of > free and independent states in the post-Russian space, as well as guarantees > of their future stability and prosperity. We must be aware that the collapse > of the Russian Federation may cause certain difficulties and risks, like any > transition period. However, these risks will turn out to be much greater if > we leave this aggressive empire as it is.\" == Private life == Fotyga is married and has two children. == Awards == * Commander of the Order \"For Merit to Lithuania\" (April 5, 2009, Lithuania ) * Order of Merit (Ukraine) - III degree (November 4, 2022, Ukraine ) — \"for a significant personal contribution to strengthening interstate cooperation, support of state sovereignty and territorial integrity of Ukraine, popularization of the Ukrainian state in the world\" * Open Ukraine == References == Category:1957 births Category:Living people Category:Polish politicians",
 "title": "Anna Fotyga"
}