{
 "id": "1081525",
 "text": "The Reeves tale In Chuacers The Canterbury Tales the 3rd Tale is The Reeve's Tale. Although Oswald The Reeve is on the social scale a serf he is a professional carpender who has risen to become a very efficient estate manager for his Lord. One of the pilgrims the reeve dislikes is the drunken bully Robyn a miller who made the other pilgrims laugh with a amoral tale about a foolish carpender who was clukoled by is unfaithul wife and a boarding college student. In retalation the Reeve tells a tale of how a cheating miller recieved his comupence. At Cambridge University Symkyn the miller grinds the corn and wheat in his mill. He is a bully who cheats his customers with the help of his \"golden thumb\" (i.e. using his thumb to tip the scale in his favour and overcharge) and claims to be a Yeoman and a Master with a sword and dagger and knives (cf. the coulter in \"The Miller's Tale\"). to impress his arrogant and snobbish wife [the illigemiate daugther of the town priest]. They have 2 children a 6 month old son and a 20 year old daughter Malyne. (At the time the story was written it was customary for young females to marry as soon as they reached puberty; Malyne is kept as a virgin by her selfish and social climbing parents (and her grandfather) so that she can be married off with a dowry of copper dishes to a wealthy husband of higher social status.) Two Clerical students at University of Cambridge, John and Aleyn, try to beat the miller at his own game when they take wheat to be made into flour; Symkyn unites their horse and while they try to catch it, grinds the wheat into flour and makes it into bread. As the students stay in his house for the night they decide to take revenge on Symkyn by raping his wife and daugther. Aleyn forces himself on malyne and John tricks her mother into making love to him. At dawn Malyne tells Aleyn where to find the bread behind the cottage door [In a pardoy of Medevial love poems fairwells Aleyn tells Malyne I am thyn own clerk\"; she bids him farewell and adds the comment of \"bread in the mill\"]; getting up Aleyn mistakes the miller for John and boasts of how he \"served the Millers daugther\" in the night. Symkyn and Aleyn fight; the student hits Symkyn in the nose causing a nosebleed; in a comedy of errors the wife awakens. Mistaking her husband for one of the students, she takes a club and hits her raging husband. John and Aleyn beat up the miller and flee, taking with them their horse and the bread made from their stolen grain. Both students ride off and get a good laugh of their revenge with the beating of the cheating Miller and the double humiliation on his wife and daughter; despite their tearful farewells Aleyn has no thought of either Malyne or the fact she is now pregnant with a child which will ruin her parents' plans to make an advantageous marriage for her. Despite their farewells and Malyne's remark of \"bread in the mill\"—(a slang term for pregnancy, similar to the modern \"bun in the oven\") and her weeping when he leaves her, the poor tragic abused girl knows he will not see her again after stealing her virginty. The Reeve ends his tale with by saying that the story demonstrates the proverb \"Hym thar nat wene wil that yvele dooth\" (One who does evil fares badly) and concludes \"A gylour shal hymself bigyled be\" (a deceiver will himself be deceived) (lines 4320–22). Category:The Canterbury Tales",
 "title": "The Reeve's Prologue and Tale"
}