{
 "id": "1081860",
 "text": "Shams-i Tabrīzī () (1185–1248) was a Persian* * * * poet,Ibrahim Gamard, Rumi and Islam: Selections from his stories and poems, Pg Introduction xix who is the spiritual instructor of Rumi. He is mentioned and respected highly in Rumi's poetry collection, especially in Diwan-i Shams-i Tabrizi. == Life == According to some accounts, Shams Tabrizi was the son of Imam Ala al-Din and received his education in Tabriz under Baba Kamal al-Din Jumdi. Before meeting Rumi, Shams traveled from place to place selling girdles and weaving baskets, earning him an epithet called \"the embroiderer.\" However, some scholars have questioned the reliability of these biographical accounts. Shams first encountered Rumi in Konya in 1244. Rumi was reading when Shams asked him what he was doing. Rumi replied that it was something that Shams couldn't understand, and Shams threw Rumi's books into a nearby pool of water. To Rumi's surprise, the books were dry when he rescued them. Shams then challenged Rumi with two questions about the saints Bayazid and Muhammad, and Rumi's answers led Shams to realize that Rumi was the object of his longing. Shams left Konya and settled in Khoy, but Rumi continued to attribute his own poetry to Shams as a sign of love and respect for his departed friend and master. In Rumi's poetry, Shams became a guide of Allah's love for mankind, dispelling darkness and shining the Light of Sun as a guide for the right path on earth. The source of Shams' teachings was the knowledge of Ali ibn Abu Talib, who is also called the father of sufism. == Death == In the Sufi tradition, Shams Tabrizi's disappearance is a mystery. Some believe he was killed by Rumi's jealous disciples, while others say he left Konya and died in Khoy where he was buried. Rumi's son, Sultan Walad, mentions in his writing that Shams disappeared without giving more details. Shams' tomb in Khoy has been nominated as a World Cultural Heritage Center by UNESCO. == References == Category:Sufism",
 "title": "Shams Tabrizi"
}