{
 "id": "1081392",
 "text": "Iso-Polyphony is a traditional part of Albanian folk music. It has been recognized by UNESCO as an Intangible Cultural Heritage since 2008. Southern Albania, including the regions of Lalëria (Myzeqe), Toskeria, Chameria, and Labëria, practice this type of singing. Some places in North Macedonia and southern Montenegro also have similar singing where many parts are sung together. Labëria in Albania is famous for singing with many parts, with songs having two, three, or four parts. Songs with three parts are seen as the most complicated. The Gjirokastër National Folklore Festival in Albania, which happens every five years in October since 1968, often has many songs like this. == History == Albanian iso-polyphony and Balkan multi-part vocal music are thought to be very old traditions from the time of the Thraco-Illyrian era, even though there aren't many old records about them. Experts believe these musical traditions were passed down orally through many generations. Specific things like the five-note scale and singing without instruments show that they come from ancient times. This kind of music developed differently from medieval Byzantine music, which was made up by individuals. Balkan multi- part vocal music was made by groups of people, passed down orally, and performed by people who weren't trained in music. Even though they existed alongside Byzantine music, they didn't have much influence on each other. == Development == Albanian traditional music started with two main melodies: the \"taker\" (1st voice) and the \"turner\" (2nd voice). Two-voice iso-polyphony, is seen in places like Gjirokastër and Dukat. This style is also seen in different parts of Albania and among Arbëreshë people in Calabria. The idea of two-voice polyphony is thought of as a \"hidden\" three-voice iso-polyphony. The next step was adding a drone (iso), creating three-voiced polyphony (singing where many parts are sung together). The drone added depth to the harmony between the melodies and is now common in Albanian traditional music, mainly sung by men. Three-voice polyphony is common in areas like Skrapar, Gramsh, Gjirokastër, and Vlorë. The \"launcher\" (3rd voice) developed later, leading to four-voiced polyphony. While not found in Toskëria, Myzeqeja, and Chamëria, four-voiced polyphony is found only in Labëria alongside the more common three-voiced style. Neço Muko's recordings in the 1920s-1930s helped establish the four-voice iso-polyphony. == Pleqërishte (genre) == Pleqërishte is a type of Albanian folk singing done by older men in Labëria, especially in Gjirokastër. It is known for its slow speed, deep pitch, and small range. The name \"Pleqërishte\" means both \"of old men\" and \"of the old time,\" talking about the singing style and the themes of the songs. These songs are also called \"lashtërishte\" in Gjirokastër, showing their old themes. Even though these themes are not as popular now, they are still important. Pleqërishte songs are slow, deep, and don't have much change in voice, making them different from songs sung by younger men. In this type of singing, there are four parts, and the third singer (hedhës) plays a big role. Unlike other types, in pleqërishte, the hedhës gives the main singer (marrës) a break. First, the marrës starts singing, then the second singer (kthyes) joins, followed by the hedhës. After the hedhës, the marrës's words are repeated by a group in different ways. == References == Category:Folk music Category:Masterpieces of the Oral and Intangible Heritage of Humanity",
 "title": "Iso-Polyphony"
}