{
 "id": "1081823",
 "text": "Midazolam is a type of drug belonging to the benzodiazepine class. It is used as a sedative, because it calms people down. It is also used as an anesthetic. It will make people sleepy. It also causes anterograde amnesia In some parts of the world it is known as Versed. Midazolam is a benzodiazepine, so people may get addicted to it if they take it for a longer period of time. The drug does not make people to become unconscious, it only sedates them. Midazolam is also used to treat long-lasting seizures. Most often, a seizure is short. Midazolam is available in different forms; there are tablets to be taken by mouth, there is a solution that can be injected, and there are ways to allow to give it anally. There is also a spray. When it is injected, it usually starts working within as little as five minutes. Effects last between one and six hours. Side effects include a decrease in efforts to breathe, low blood pressure (hypotension), and sleepiness. Tolerance to its effects and withdrawal syndrome may occur after long-term use. Paradoxical effects, such as increased activity, can occur especially in children and older people. There is evidence of risk when used during pregnancy but no evidence of harm with a single dose during breastfeeding. Like other benzodiazepines, it works by increasing the activity of the GABA neurotransmitter in the brain. Midazolam was patented in 1974 and came into medical use in 1982. It is on the World Health Organization's List of Essential Medicines. Midazolam is available as a generic medication.In many countries, it is a controlled substance. This means that a medical prescription is required to get it. In the past, midazolam has been used for the following: * Acute management of longer epileptic seizures, including status epilepticus. * As a sedative for someone before a medical intervention (usually combined with an opioid such as fentanyl) * To manage agitation in diseases such as schizophrenia, usually combined with an antipsychotic. * End-of-life (palliative) care == References == Category:ECHA InfoCard ID from Wikidata Category:Drugs with non-standard legal status Category:Drugs",
 "title": "Midazolam"
}