{
 "id": "1081264",
 "text": "Khosiat Rustam (), is a poet, translator, and author of several scenarios. Currently, she is the editor-in-chief of the newspaper \"The Book World\". And an independent researcher at Alisher Navoi University of Language and Literature. Since 2022, she has been the coordinator of the World Poet Movement of Colombia in Uzbekistan. ==Biography== Khosiat Rustam was born in 1971 in Olmos village, Chust district, Namangan region. In 1993, she graduated from the Faculty of Journalism of Tashkent State University (now the National University of Uzbekistan). In 2003, she studied at the two-year Higher Literature course at the Faculty of Uzbek Philology of the National University of Uzbekistan. In 2021, she graduated from the International Writers Programme at the University of Iowa in the United States. ==Awards== Khosiat Rustam was awarded the \"Shuhrat\" (Fame) medal by the President of the Republic of Uzbekistan in 2004 and the commemorative medal \"25 Years of Independence of Uzbekistan\" in 2016. Participated in several international poetry festivals and In 2012, she was the winner of the international competition held in Bursa, Turkey. 2015: National and International Mikail Mushfiq Award of Azerbaijan, 2020: Nurangiz GUN International Poet Prize and In 2021, she was awarded the international prize named after Rasul Reza. In 2017, the AMEA Nizamiy Ganjavi Institute of Literature was awarded the Honorary Decree \"For the activity of scientific and literary relations between Azerbaijan and Uzbekistan. In 2018, she won the highest prize in poetry at the international literature festival held in Thailand. 2003: Writers' Union of Uzbekistan and Since 2019, she has been a member of the Writers' Union of Azerbaijan. In 2021, she became a laureate of the Naji Naaman International Prize. In 2021, she was awarded the prestigious \"Golden Knight\" award of the Russian Union of Writers. 2022: The Naji Naaman Foundation for Culture (FGC), an international organisation based in Lebanon, announced Khosiat Rustam as an \"Extraordinary Ambassador of Culture\". == Activities == Besides poetry, Khosiat Rustam also wrote several stories, plays, and screenplays as a writer and dramatist. In 2015, the play \"A bird that does not fit in the sky\" was staged in the academic musical drama theatre named after Mukimi, one of the most magnificent theatres in Uzbekistan, under the direction of People's Artist of Uzbekistan Mirza Azizov. In 2016, based on the story \"Gilam\" (\"Carpet\"), she wrote a screenplay called \"Ajal Jodusi\" ( A Trick of Death) which was screened by director Hilal Nasimov. This feature film brought great fame to the poetess. As a translator, she translated the poems of Marina Tsvetaeva, Yevgeny Evtushenko, Anna Akhmatova, Boris Pasternak, Ramiz Ravshan, Nigor Refibeyli, Riza Halil, Fozil Kisakurak, Khusnu Doglarja, and many other world poets' works into Uzbek. Since 2015, she has been the Editor-in-Chief of the most influential newspaper, \"The Book World.\" There are more than fifty studies on Khosyat Rustam's works. ==Diplomatic activities== Inn 2020, on the initiative of Khosiat Rustam, many famous poets and writers around the world wrote a letter of sympathy to the President of Azerbaijan, Ilhom Aliyev And this letter was read out on many sites and on Azerbaijan TV. In addition, her books \"Ismi Lola edi u qizning\"(\"Thatt girl's name was Lola\" andd \"44 Days\", dedicated to the conflicts between Azerbaijan and Armenia, a were published in Azerbaijan in the Azerbaijani, Turkish, and Uzbek languages. In addition, her other books were translated into Azar by Ramiz Askar, a literary scholar, professor, and laureate of the international Babur Prize, published in Azar and Uzbek for university students, and included in the curriculum. Khosiat RUSTAM's poetry has been translated into more than 30 languages, and her books have been published in several foreign countries. About Khosiat RUSTAM The book \"KHOSIYAT\" in Uzbek, prepared on the basis of articles and essays written by world-famous poets, writers, and literary experts, and the English version of \"KHOSIAT\" are being prepared for publication in London by the \"EGG London\" publishing house. About Khosiyat RUSTAM, the filming of the two-part film, which is being made in cooperation with Azerbaijan TV and Uzbekistan TV, is still going on. == Notes == Category:1971 births Category:Living people Category:Uzbekistani people Category:Poets",
 "title": "Khosiat Rustam"
}