{
 "id": "1081564",
 "text": "Tomás José Ramón del Carmen de Herrera y Pérez Dávila (21 December 1804 - 5 December 1854) was a Neogranadine statesman and general who in 1840 became Head of State of the Free State of the Isthmus, a short lived independent state which is located in what is now Panama. Tomás de Herrera also became acting President of the Republic of the New Granada for 3 months during the Colombian Civil War of 1854 against General José María Melo, who had committed a coup on 17 April. In 1845, Herrera returned to national political life as governor of Panama and later minister of War and Navy of the government of José Hilario López. In 1850, he was appointed governor of the province of Cartagena and that same year he received the grade of general. In 1851 a revolution erupted in the provinces against the Liberal government of President José Hilario López, whereupon the government appointed military commanders to quell the insurgency. In the Colombian Civil War of 1851, Herrera had to confront the governor of Antioquia, Col. Eusebio Borrero, who was defeated and considered General Herrera as a military genius. On August 5 José de Obaldía assumed executive authority as President, appointing Herrera second in command of the army in the North. On September 28, he was at Piedecuesta in command of his troops, when he received the visit of General Mosquera, commander in chief of the army. On September 25 they succeeded in crossing the river Chicamocha. On December 2 they reached the outskirts of Bogotá in company of the column commanded by General Camilo Mendoza. On December 4, 1854, after the attack deployed by the army on the southern side of the city of Bogotá, Herrera went into action in command of two battalions but he was seriously injured on the corner of the Pamplona and Bárbula avenues, and died shortly after. Despite having spent most of his career in present-day Colombia, several statues have been built in honor of Tomás Herrera in Panama in recognition of what he did. Also in the Casco Viejo of Panama there is a plaza called \"Plaza Herrera\". This plaza did not exist in Spanish colonial times. In 1781 there was a fire that destroyed the buildings in the neighborhood, opening up the area to give the appearance of a plaza. Originally it was called Plaza del Triunfo and was used for bullfights. In 1887 it became Plaza Herrera and in 1928 the equestrian statue dedicated to the great hero of Ayacucho, Tomás Herrera, was inaugurated. This statue was created by the French sculptor Auguste Denis and was brought from France. At its base there is a glass (the original was stolen in 2008) with soil from the field in Ayacucho where the Panamanian hero received the rank of captain. == References == Category:1804 births Category:1854 deaths Category:Panamanian politicians",
 "title": "Tomás de Herrera"
}