{
 "id": "1081534",
 "text": "The Lucknow Pact was an agreement reached between the Indian National Congress and the Muslim League (AIML) at a joint session of both the parties held in Lucknow in December 1916. Through the pact, the two parties agreed to allow representation to religious minorities in the provincial legislatures. Through the pact the two parties allowed people from every religion choose laws . == Demands presented to the British == Both parties presented some common demands to the British. They demanded: * The number of elected seats on the councils should be increased. * Laws/Motions which were passed by large majorities in the councils should be accepted as bindings by the British Government. * Minorities in the provinces should be protected. * All provinces should be granted autonomy. * Separating the executive from the judiciary * At least half of the members of the Executive Council being elected, the Legislative council having a majority of elected members == Importance == The Lucknow Pact was seen as a beacon of hope to Hindu–Muslim unity. It was the first time that the Hindus and Muslims had made a joint demand for political reform to the British. It led to a growing belief in British India that Home Rule (self- government) was a real possibility. The pact also marked the high-water mark of Hindu-Muslim unity. It established cordial relations between the Muslim League and the Indian National Congress. Before the pact, both parties were viewed as rivals who opposed each other and worked in their own interests. However, the pact brought a change in that view. The Lucknow Pact also helped in establishing cordial relations between the two prominent groups within the Indian National Congress – the 'extremist' faction led by the Lal Bal Pal trio (Lala Lajpat Rai, Bal Gangadhar Tilak and Bipin Chandra Pal), and the 'moderate' faction led by Gopal Krishna Gokhale until his death in 1915 and later represented by Gandhi. Though Jinnah advocated a separate nation for the Muslims 20 years later, in 1916 he was a member of both Congress and Muslim League, was an associate of Tilak, and hailed as 'ambassador of Hindu-Muslim Unity’ Written BY Saisha Chhabra Category:1910s in India",
 "title": "Lucknow pact"
}