{
 "id": "1081852",
 "text": "{{Infobox writer | name = Amrita Pritam | honorific_prefix = | image = Amrita Pritam (1919 – 2005) , in 1948.jpg | caption = Pritam | birth_name = Amrita Kaur | birth_date = | birth_place = Gujranwala, Punjab Province, British India (now Punjab, Pakistan) | death_date = | death_place = Delhi, India | occupation = Novelist, poet | nationality = Indian | period = 1936–2005 | genre = poetry, prose, autobiography | subject = Partition of India, Women, Dream | movement = Romantic-Progressivism | spouse = Pritam Singh | partner = Imroz | children = 2 | module = }} Amrita Pritam (31 August 1919 – 31 October 2005) was an Indian novelist and poet, who wrote in Punjabi and Hindi.Amrita Pritam, The Black Rose by Vijay Kumar Sunwani, Language in India, Volume 5: 12 December 2005. She is the recipient of the 1956 Sahitya Akademi Award. She wrote more than 100 books of poetry, fiction, biographies, essays, a collection of Punjabi folk songs and an autobiography that were all translated into several Indian and foreign languages.Amrita Pritam – Obituary The Guardian, 4 November 2005.Amrita Pritam: A great wordsmith in Punjab’s literary history Daily Times (Pakistan), 14 November 2005. == Biography == Pritam was born on August 31, 1919, in Gujranwala, Punjab, British India.Amrita Pritam – Obituary The Guardian, 4 November 2005. She was the only child of Raj Bibi, who was a school teacher, and Kartar Singh Hitkari, who was a poet, a scholar of the Braj Bhasha language, and the editor of a literary journal.Amrita Pritam Women Writing in India: 600 B.C. to the Present, by Susie J. Tharu, Ke Lalita, published by Feminist Press, 1991. . Page 160-163.New Panjabi Poetry ( 1935–47) Handbook of Twentieth-century Literatures of India, by Nalini Natarajan, Emmanuel Sampath Nelson, Greenwood Publishing Group, 1996. .Page 253-254. She was known for her powerful and emotional poetry that often portrayed the struggles of women and the partition of India. Her writing continues to inspire generations of readers with its themes of love, loss, and social injustice. She started her journey as a romantic poetAmrita Pritam Modern Indian Literature: an Anthology, by K. M. George, Sahitya Akademi. 1992, .945–947. and soon became part of the Progressive Writers' Movement. The effect was seen in her collection, Lok Peed (\"People's Anguish\", 1944), which openly criticised the war-torn economy after the Bengal famine of 1943. She was also involved in social work. She also worked at a radio station in Lahore for a while, before the partition of India.Editorial Daily Times (Pakistan), 2 November 2005. == Death == She passed away on October 31, 2005 after a long sickness but her legacy lives on through her timeless words. == References == Category:1919 births Category:2005 deaths Category:Punjabi people Category:Indian writers",
 "title": "Amrita Pritam"
}