{
 "id": "1081613",
 "text": "Mzee Yoweri Hunter Wacha-Olwol (1923-2017), was a prominent figure in Uganda’s history, from the years of the country's pursuance for independence from Britain to the subsequent post-colonial times. From a devoted Educator in various schools and Civil Servant in several government institutions and Boards, and later, as one of the country’s representatives who went to the United Kingdom in 1961 to negotiate for Uganda’s Independence from Great Britain. Wacha-Olwol was later nominated as a member of the three-man Presidential Commission that governed the affairs of the State of Uganda from May 22nd to December 15th 1980\\. This was after the Military Commission headed by Paulo Muwanga and deputized by Yoweri Kaguta Museveni overthrew the government of President Godfey Lukongwa Binaisa in May 1980. Wacha-Olwol also served as the Clan Leader of Okii Me Okabo Fraternity continuously from 1990 until his demise in 2017. Wacha-Olwol was duly accorded a State Funeral by H.E Yoweri Kaguta Museveni the President of Uganda in honour of his prominence and contributions as a Member of the Presidential Commission that governed Uganda from May to December 1980. The era during which Mzee Wacha-Olwol and his two colleagues; Justice Polycarp Nyamuchoncho and Justice Saul (Saulo) Musoke served as Interim Government, saw three governments in less than two years after the fall of Idi Amin on April 11, 1979: from Idi Amin, the Prof. Yusuf Kironde Lule government was in office for 70 days (April to June, 1979), followed by Godfrey Lukongwa Binaisa who ruled for close to a year and the Military/Presidential Commission which led to the general elections of 1980 that brought in the Obote II regime! Wacha-Olwol and his two colleagues are credited with providing titular leadership of State that handed power over to Dr. Apollo Milton Obote after the December 12th, 1980 general elections. Most people didn’t know who Wacha-Olwol was on his passing. The Rt. Hon. Dr. Ruhakana Rugunda in paying tribute to Wacha-Olwol stated “It is clear that we need to teach our history and current affairs better, especially to the young generation, to ensure that the people and significant milestones in our country’s journey, are well documented, understood and appreciated by the current and future generations.” President Yoweri Kaguta Museveni twitted, “I first met him in 1970 after I joined the President's Office as a Research Officer, where he was PS. Shortly after, there was the Amin coup.\" == Early life == Wacha-Olwol was born on Monday 19 November 1923 at Loro Gombolola, then the Atura County (the present Oyam County). The present site of Loro Secondary School is exactly where he was born. At the time of his birth, his father Erieza Olwol was working as a clerk to the Gombolola Chief of Loro, Yosia Omara who was a prominent figure of the Inomo clan. His mother was called Cakayo Akulo but was later baptised Loi then she became known as Atat Loi Akullo. His mother was a sister to Yosia Omara the Gombolola Chief. It was on a mutual understanding and appreciation of his father’s service to the Chief Yosia Omara and the people of Loro at large that he chose his sister as a wife to Wacha-Olwol’s father. In reality, his mother was given to his father as a sign of love and loyalty for the services that his father rendered to the Chief. His father belonged to the Okii Me Okabo Clan. He originated from Akokoro Gombolola, Maruzi County from an area called Apoi Village, which was predominantly occupied by Okii Me Okabo Clan. His mother hailed from Loro which was also predominantly occupied by the Inomo Clan. == Education == He attended Loro Preparatory School in 1931 then joined Loro Elementary Vernacular School between 1932-1935. He went to Boroboro Central School in 1936-1938. Boroboro Central School at the time was the only highest academic school of learning in then Lango District (now Lira and Apac District s) with only two classes; Central I and Central II. He joined Kabalega Secondary School , Masindi, in Bunyoro District where he attended Junior Secondary School I to III from 1939-1941. In 1941, the Ugandan Government introduced Junior Secondary III Leaving Examination for the first time. Wacha-Olwol was among the first three students at Kabelega Secondary School to sit the examination. He was then admitted to King’s College Budo in 1942 where he studied for three years and sat for the Uganda Senior School Leaving Examination at the end of 1944. His long-standing admiration for teachers compelled him to enroll at Teacher Training College in Mukono between 1945-1946 where he qualified as a Primary School Teacher. == Career == In 1947 the Government set up a Rehabilitation Centre at Lira (now Lira Technical Institute) where he taught for one year. Between 1948-1949, he was posted by the Church of Uganda to teach in Aboke at Aculbanya Primary School. In 1950, he was posted to teach at Boroboro Teachers Training College. He gave up teaching at the beginning of 1953 and joined then Lango African Local Government as a clerk to the Lango District Council. He worked mainly as a Personal Assistant to Yakobo Adoko who was the Chief Executive Officer known as Rwot Adwong (Paramount Chief). Wacha-Olwol was sponsored by the District Administration for further studies in the United Kingdom at Torquay for one academic year where he attained a Diploma in Social and Public Administration in 1958. On return from the UK, he was appointed as Secretary to the District Council. In 1960, he was selected by the District Council to represent Lango District Administration at the Constitutional Conference in London to prepare Uganda for Independence. He equally attended the second conference in London to finalise discussion on Uganda Independence. Uganda became independent on 9th October 1962 under the leadership of Dr. Apollo Milton Obote. Following attainment of Independence, District Administration in Uganda underwent changes by enactment of laws by Uganda Legislative Council. Local Government were given more powers to run most of the local services such as Education, Health Services, Water Supply and Infrastructure. This led to the appointment of a Chief Executive Officer for each district known as the Secretary General. The post of Rwot Adwong (Paramount Chief) was to be abolished which led to Wacha-Olwol’s nomination as the Secretary General of Lango District Administration. At that time, Lango was one District with seven counties and 42 sub counties. This was also the time when the Constitutional Heads (Won Nyaci) of District were appointed for the district of Lango. Yekosofati Engur was appointed as the Won Nyaci of Lango until 1966 when the post of Constitutional Heads of Uganda districts was abolished. This included the abolition of the monarchies; Kabaka of Buganda, Omukama of Tooro, Bunyoro and Ankole. In July 1963, he was appointed Assistant District Commissioner of Acholi to replace Charles Kole Oboth-Ofumbi who was murdered by Idi Amin together with Reverend Janani Luwum the Archbishop of Church of Uganda and Erinayo Oryema the Inspector General of police. In 1964, Wacha-Olwol relocated to Gulu which was the district head quarter of Acholiland. By then Acholi District was one district comprising of East and West Acholi. It was the largest district in Uganda; on the East being Karamoja District and on the West the River Nile which was the boundary of West Nile including Moyo District, on the South Lango and Bunyoro District and on the North, Sudan. In August 1966, he was appointed to the post of Principal Assistant Secretary and posted to the Ministry of Local Government headquarters as an Inspector of Local Administrations. In 1967 he was promoted to the post of Under Secretary and moved to the Office of The Minister of Public Service and Cabinet Affairs in the President’s Office at Entebbe dealing with procedural Administration. In 1968, he was promoted to Permanent Secretary. He occupied the post until he was retired by the Amin military regime in 1972 that deposed the Obote I government forcing then President Milton Obote into exile in Tanzania. He went into business by setting up a commercial shop in Lira town following his exodus as Permanent Secretary. After the murder of Rev. Janani Luwum, the Inspector of Police Erinayo Oryema and the Secretary to the cabinet, Charles Kole Oboth-Ofumbi; Wacha-Olwol states in his interview with the Daily Monitor on December 13, 2014 that him and his business associates, Otim Obina and Omara Obua of Omara Obua Bus Company were forced into hiding because the Amin regime begun looking for all prominent Lango and all other tribes who were suspected to be supporters of UPC or relatives and close associates of deposed President Milton Obote. The news reached him in Kampala and he was forced to go in hiding at a neighbour’s house. In the meantime, his sons James Apali and Fred Olwol, came to his rescue. He didn’t wish to go into exile so he decided to continue hiding at his friend’s residence called Yovan Ochan in Anaka He stayed there for one month but had to get up very early in the morning equipped with a shout gun, and go to the park to hide himself under the shades of trees, occasionally facing wild animals like elephants and buffalos. His host soon became scared when word of Wacha-Olwol’s presence in the area begun to get around within the community. Mr. Ochan had a tractor which he used to transport Wacha-Olwol during the night from Anaka to Loro Gombolola, his birth place, where he again continued to go into hiding at a relative’s home by the name of Mr. Fenekasi Angole. After hiding for a month, he sent a message secretly to his wife ALICE. Elated to hear that her husband was alive, she immediately made arrangements for her husband to flee to Kenya. Alice bundled all their children and joined Wacha-Olwol in exile until after the liberation war of Uganda in 1979 when Amin was overthrown. Whilst in exile, they initially stayed in Nairobi and later settled in Bungoma-Western Kenya. Life in exile was not as bad as anticipated; the family had all the basic necessities they needed though the money allocated to them as refugees was not quite adequate. Wacha-Olwol had a pickup truck which they then leased out to raise some income. Wacha-Olwol kept in touch with Dr. Obote who was also exiled in Dar-es-Salaam. He helped recruit some young Ugandans exiled in Kenya at the same time e.g. Lt Col John Charles Ogole and sent them to Tanzania to join the liberation war of Uganda. Wacha-Olwol and his family eventually returned to Uganda in May 1979 during the liberation war when the southern part of Uganda was already liberated. He stayed in Kampala given that Northern Uganda including Lira his home district was not yet liberated. In 1979 after the liberation war, the Liberators identified Prof. Yusuf Lule as the next President of Uganda. His time in power was short-lived; he was ousted and replaced by Mr. Godfrey Binaisa. In May 1980, Binaisa was similarly expelled from presidency and Wacha-Olwol was appointed the Presidential Commissioner together with two High Court Judges; Justice Polycarp Nyamuchoncho and Justice Saul (Saulo) Musoke. The trio governed until the general election for Members of Parliament in December 1980 when they handed over power to the elected government of UPC under the leadership of Dr. Apollo Milton Obote as the President of UPC and Republic of Uganda. Wacha-Olwol subsequently continued to serve Uganda in various capacities viz.: * 1981-1986: Chairman of Uganda Advisory Board. The Board was dissolved in 1986. * Member of Central Tender Board. * 1986-1990: Deputy Chairman, Uganda Public Service Commission under the Chairmanship of Canon John Bakinga for one term. During that time, he had the memorable occasion to visit Malawi, Ghana and Egypt. In Egypt, (Cairo) he had the opportunity of visiting one of the seven wonders of the world-the pyramids. * 1990-1994: he was appointed to serve on the Board for the Re- organisation of Civil Service within the Ministry of Public Service. * In 1990 the clan of Okii Me Okabo elected Wacha-Olwol as their Clan Leader. He held the position until his untimely demise in 2017. When the National Resistance Movement(NRM) took over government in 1986, Wacha-Olwol and his affliates; Henry Makmot who was Deputy Minister in the defunct UPC government, Mr. Omara Ojungu and Omara Atubo, founded Lango Community Association to assist victims of torture as well as the displaced persons who were victimized for being affiliated to the UPC government. Wacha-Olwol and his associates helped many displaced people of Lango get settled between 1986 to the millennium era 2000. == Personal life == Alice Labol Ochola-Wacha, Mzee-Wacha’s wife whose father died young, proved to be the pillar of her father and husband’s home. Hailing from the (Paramount Chief) Rwot Ogwok lineage of Padibe,[1] Lamwo District in Acholi, she became a maternal soldier to all her siblings. Her brother, Obol- Ochola who became an outstanding legal scholar, celebrated advocate and politician, was brought up in her home. So were her other brothers David Otti- Ochola of BAT (British American Tobacco) and William Lunyuta-Ochola, a professional hotelier as well as her younger sister Margaret Laloyo-Ochola, a social worker. Her nephews, nieces and many other relatives and friends also spent happy years in the Wacha-Olwol household. Alice brought up all the children in their lives with genuine love and affection. Alice was working as a social worker in Lira at the time after which, she took up hosting at Radio Uganda. She used to tell stories on the radio and give good advice to women about home, cooking, children and other subjects. She was well known for her ‘ododo’ (folk tales) and many tuned into the programme just to listen to her. While the children were growing up, Alice embarked on a new career. She begun working at Bank of Uganda and was there for many years. At the time Alice and Wacha-Olwol were living at Entebbe. Both Alice & Wacha-Olwol made many friends and were popular with their colleagues. They both enjoyed working and always worked hard. Another career then begun for Alice; she opened up a boutique on Kampala Road to preserve and promote the affluence of African print clothing. Her tailoring company, Peacock Fashioners Ltd. became one of the most popular boutiques in Uganda. The boutique appealed to multitudes all over the world. The wife of Zambian President Mrs Chiluba, the late musician Bob Marley’s mother, the South African singer Yvonne Chaka Chaka to name but a few, all frequented the boutique. Hilary Clinton visited the shop as well when she was in Uganda. Alice also made uniforms for Sheraton Hotel, Reverend Skinner’s singing group Watoto, who toured the world. Peacock had fashion shows on television and equally exported its merchandise overseas. Everyone knew Mrs Wacha from Peacock Fashions and the shop became a meeting place for many people, a place where they knew they would be welcomed. Mzee-Wacha and Alice were gentle souls who tried to help those in need in all possible ways within their reach. Alice’s spiritual conviction was partly formed and vindicated by their personal experiences. At the funeral of their son, James Apali, Alice prayed fervently to God to give her a sign that their son was in heaven. Many were present with her when someone pointed out to a rainbow that appeared in the sky. It was so bright. Hanging in a firmament, so low and falling down the horizon, so near to them that the awe stricken mourners could not help but gasp in awe. Alice built a monument where the rainbow fell in the form of a bible that stands today and can be seen by visitors to Amach where Apali was buried. Alice was a born again Christian. She not only prayed regularly, but also lived a true Christian life. Her heart was pure so was Mzee-Wacha’s nature. Many hearts were filled with sadness at their passing. The vacuum they left remains empty. Although some will say that time will ease pain and others say God only takes the best and the pictures fade over the years, the memory of beautiful Alice and altruistic Wacha-Olwol will never die. To all who loved Alice and Wacha-Olwol; there was a light in the dark in their presence, their smile, the gift of laughter they brought to all; the joy the kindness will remain in many hearts forever. To all people who knocked, they opened the door, to those who asked they gave, to those who were naked they clothed. The world is grateful to have had a chance to have known them and thank God for the gift that was their life. May The Almighty God Rest Their Souls In Eternal Peace: Alice Labol Ochola Wacha: 1933 – 1999. Mzee Yoweri Hunter Wacha-Olwol: 1923-2017. Mzee Yoweri Hunter Wacha-Olwol was an effective Administrator, Arbitrator, Nationalist and a Gentleman who rose from humble beginnings to national prominence and leadership. Him and Alice had eight CHILDREN; Grace Wacha-Okia, Jackie Otunnu-Wacha, Lucy Wacha, James Apali Kamale-Wacha (RIP), Judy Wacha, Sunday Wacha Olwol (RIP), Lillian Wacha and Juliana Wacha. He had one child from his first wife; Peter Wacha AND his second wife bore; Fred Olwol, Celia Wacha (RIP), Guy Okori Wacha (RIP), Martin Wacha (RIP), Richard Okao Wacha, Sarah Wacha. In his lifetime Mzee Wacha-Olwol was blessed with several GRANDCHILDREN including but not limited to; Cleopatra Kamale-Wacha, Fiona Kamale-Wacha, Klaus Wacha-Olwol, Yvonne Kamale-Wacha, Priscilla Kamale- Wacha, Kimberly Kamale-Wacha, Loi Elizabeth Wacha, Francis Mutyaba-Wacha, Julian Mutyaba-Wacha, Juliana Atim-Wacha, Victoria Wacha, Arianna Wacha- Salmon, Bruce Wacha, Michael Wacha, Malik Wacha, Linda Wacha, Derrick Wacha, Ben Wacha, Philip Wacha, Joel Wacha, Apali James Wacha, Atino Angel Mbabazi GREAT GRANDCHILDREN include; Thyra Oji-Ms Banks, Nia Kamale-Wacha, Thalia Wacha-Engola, Tiana Wacha-Engola, Ava Wacha-Mutembe, Elijah Mutahi Gateran, Arielle James Gateran, Jodie Kamale-Wacha Inneh, Simi Kamale-Wacha Adeleye, Jada Kamale-Wacha Adeleye, Jasher Kamale-Wacha Adeleye, Imani Ferris-Wacha, Alayah Ferris-Wacha, Carmen Wacha Fooks, Julian Wacha Fooks, Neveah Wacha Penfold, Zian Wacha Clark… == References == # Asians From Uganda. “The Second Obote Regime: 1981-85.” AsiansfromUganda.org.uk. 2012. # Crace, John. The Guardian. “Godfrey Binaisa Orbituary.” October 3, 2010. # Goitom, Hanibal. Library of Congress Blogs. “Today In History: Idi Amin Overthrows President Milton Obote In Uganda.” January 25, 2018. # History.com Editors. “Ugandan Dictator Idi Amin Overthrown.” A&E; Television Networks. February 9, 2010. # Kapo, Nelson Bwire. NilePost. “When Binaisa Sacked Museveni as Defence Minister and Crisis Hit The Nation.” February 3, 2019. # Mukasa, Henry. New Vision. “I Removed Binaisa, Reveals Museveni.” August 11, 2010. # Mulera, K. Muniini. Mulera’s Fireplace.com. “I wanted to Appoint Museveni VP; Godfrey Binaisa.” Edited by Admin, December 14, 2023. # New Vision. In Pictures: Ex- leader Joel Wacha Wacha Send-off.\" May 7, 2017. # Okwera, Oyet. New Vision. “Wacha Olwol The Forgotten President.” June 24, 2012. # Ross, Jay & Martha Honey. The Washing Post: Democracy Dies In Darkness. “Military Commission Forms New Government in Uganda.” May 14, 1980. # Scholtz, Kim. “Political History of Uganda: Kingdoms & Wars That Helped Shape Ugandan History, Keen History.” February 22, 2017. # The Daily Monitor. “How Prof. Yusuf Lule’s 68-Day Reign Came Crashing Down.” June 15, 2019. # The Daily Monitor. “Key Numbers That Changed Uganda.” January 13, 2018. # The Daily Monitor. “1980 General Election: The Controversies, Highs & Lows.” June 5, 2020. # The Daily Monitor. \"Former 'President Wacha Speaks Out.\", December 13, 2014. # The Daily Monitor. “Mzee Wacha-Olwol Was One of the Distinguished Sons of This Country.” May 4th 2017. # The Daily Monitor. “Why Museveni’s UPM Lost The 1980 Election.” January 23, 2016. # The Daily Monitor. “Lt Col Ogole: The Man Who Gave Museveni’s NRA A Bloody Nose.” May 10, 2014. # The Daily Monitor. “Tracing The Final Journey Of Archbishop Janani Luwum.” December 15, 2019. # The Observer. “Janani Luwum: Amin was a coward to kill unarmed critics – Museveni.” URN, February 16, 2021. # Uganda Radio Network. \"Three Gun Salute As Mzee Wacha Olwol Is Buried.\" Politics, Lira, Uganda. May 7, 2017. # World Culture Encyclopedia. \"Countries & Their Cultures: Lango-History & Cultural Relations.” (https://www.everyculture.com/Africa-Middle-East/Lango.html). Advameg Inc. 2024. == Citations == [1] “The standing army of Padibe Kingdom was the most powerful all over Acholi-land, thanks to the diplomacy and political manoeuvres of Rwot Ogwok…” Charles Amone, Reasons for the British Choice of the Acholi as the Martial Race of Uganda 1862-1962, Gulu University, May 2014. \\---- Category:Ugandan people Category:Ugandan politicians Category:Civil servants Category:Teachers Category:1923 births Category:2017 deaths",
 "title": "Yoweri Hunter Wacha-Olwol"
}