{
 "id": "1081864",
 "text": "Rumi's ghazal 163, which begins \"Go, my friends\", is a well known Persian ghazal (love poem) of seven verses by Rumi. The poem is written in the year 1247. In this poem, Rumi is requesting his friend Shams-e Tabriz to come back to Konya from Damascus.Nicholson, R. A. Selected Poems from the Divani Shamsi Tabriz. pp. xvi–xxiii.Mojaddedi, Jawid (2004). Jalal al-Din Rumi: The Masnavi Book 1. (Oxford). pp. xv–xvii. It is a beautiful expression of love and devotion towards the beloved one. == Summary == In the poem Rumi asks his friends to bring his beloved friend back home, and to not accept any excuses. In the second half of the poem, the writer praises and describes his beloved's wonderful qualities. It ends with greetings and an offer of service. The poem is well-liked in Persian-speaking countries and has been turned into music by various famous artists.Nicholson, R. A. Selected Poems from the Divani Shamsi Tabriz. pp. xvii. == The Persian miniature == There is a famous miniature painting from 1503 that shows three of the verses, with an illustration of Shams-e Tabriz playing chess. In this painting, there are three sections showing different people in each.For another example, see Naqdhā rā bovad āyā. In the top section, Sultan Walad and a friend are shown arriving, along with two young men dressed in red and blue who are followers of Shams. In the middle section, Shams is playing chess with a Christian boy, while the young man in red and Sultan Walad are watching them. In the bottom section, it is night time, and the men in red and blue are sitting with Shams, while Sultan Walad and his friend are on the right. The men are dressed for travel, and there is a bodyguard with Sultan Walad. The chess game depicted is called Shatranj, which was similar to modern chess but with different rules. == References == == Other websites == * Ghazal 163. Text and notes (Ganjoor). * Recitation (Iranian pronunciation) * Recitation (Iranian pronunciation, female speaker) * Recitation by Abdolkarim Soroush (Iranian pronunciation); also sung (Afghan pronunciation) by Ahmad Zahir. * Ghazal 163 sung by Afghan singer Ahmad Zahir. (Afghan pronunciation) * Ghazal 163 sung by female singer Category:Persian literature",
 "title": "Rumi ghazal 163"
}