{
 "id": "1081374",
 "text": "The Big Bash League (known as the KFC Big Bash League for sponsorship reasons, often abbreviated to BBL or Big Bash) is an Australian professional men's Twenty20 cricket club league. It was created in 2011 by Cricket Australia. ==Teams== ===Current teams=== The competition features eight city-based franchises, instead of the six state-based teams which had previously competed in the KFC Twenty20 Big Bash. Each state's capital city features one team, with Sydney and Melbourne featuring two. The team names and colours for all teams were officially announced on 6 April 2011.New look and feel for freshly formed Big Bash teams, ESPNcricinfo. Retrieved 22 April 2011. The Melbourne Derby and Sydney Derby matches are some of the most heavily attended matches during the league and are widely anticipated by the fans.Big Bash League: double-headers, derbies, big egos all on show in 2015–16 version of BBL news.com.au. Retrieved on 4 December 2015 The Scorchers and Sixers have also developed a rivalry between them over the years and their matches attract good crowds and TV ratings.Sydney Sixers v Perth Scorchers sportsbanter.com.au. Retrieved on 4 December 2015 A single city-based franchise can have a maximum of 19 contracted players for a season, with the squad including a minimum of two rookie contracts and a maximum of six overseas players, although only three international players can play in each match from 2020 to 2021 edition. Each team can also have a maximum of two overseas replacement players, in case the original overseas players get injured or withdraw.BBL|05: Contracting for the next Big Bash League begins cricketbadger.com. Retrieved on 2 December 2015 Team Location Home ground Coach Captain Adelaide Strikers Adelaide, South Australia Adelaide Oval Jason Gillespie Matt Short Brisbane Heat Brisbane, Queensland Brisbane Cricket Ground Wade Seccombe Usman Khawaja Hobart Hurricanes Hobart, Tasmania Blundstone Arena Adam Griffith Nathan Ellis Melbourne Renegades Melbourne, Victoria Marvel Stadium David Saker Will Sutherland Melbourne Stars Melbourne, Victoria Melbourne Cricket Ground David Hussey Glenn Maxwell Perth Scorchers Perth, Western Australia Perth Stadium Adam Voges Ashton Turner Sydney Sixers Sydney, New South Wales Sydney Cricket Ground Greg Shipperd Moises Henriques Sydney Thunder Sydney, New South Wales Sydney Showground Stadium Trevor Bayliss Chris Green ==References==",
 "title": "Big Bash League"
}