{
 "id": "1081411",
 "text": "The Marche mondiale des Femmes or World March of Women is an group of people who work to stop poverty and people hurting women. The Marche is a feminist movement. That means it is about making men and women more equal in society. In 2006, the group had at least 6,000 smaller groups in it from 161 different countries all over the world. The World March of Women (MMF) started with the Quebec Women's Federation. The Quebec Women's federation also does the World March of Women against Poverty and Violence Against Women. ==Current status== The smaller groups in the World March of Women write ideas. ==History== The Marche mondiale des Femmes started in 2000. Fédération des femmes du Québec, a feminist group based in Quebec, Canada, started it. The Bread and Roses March, which happened in 1995 in Quebec, did well and gave them the idea. In 1995, around 850 women marched for ten days, to get their nine economic demands. By the end of the march, there were about 15,000 people in it. Quebec activists started to talk about starting a World March of Women to mark the beginning of the 21st century. The Quebec activists and others from other countries started planning the Marche mondiale des Femmes in 1997. In October 1998, they met in Montreal, Canada. 140 from 65 countries came to the meeting. They agreed to two main ideas for the march: ending all world poverty and stopping of violence towards women. The march took place in year 2000. ==March== The march started on 8 March 2000, which was International Women's Day. It ended on 17 October 2000 on the International Day for the Eradication of Poverty. In October, several other groups also marched or did sit-in protest in Brussels, Bombay, Quebec, Rabat and other places. On October 17, after the final march in New York, marchers gave United Nations representatives an international formal written request and list of ideas for things the world could do to end poverty and violence. One of these ideas was that the United States recognize the jurisdiction of the International Criminal Court and agree that rape and sexual assault are war crimes and crimes against Humanity. The group in its last statement said: > Through this global charter of women for humanity and through the actions to > come, we reaffirm that another world is possible, a world full of hope, of > life, where life is good and we declare our love to this world, its > diversity and its beauty. ==Aftermath== The group continued their work after the first March. *Different anniversaries or reminders of the first march started happening on March 8 of every year as well as on during international women's rights days. *The 2005 world march: leaving São Paulo, Brazil on March 8, the march group arrived on October 17, 2005 in Ouagadougou in Burkina Faso. Hundreds of women from 31 countries around the world participated in it. *Participation in global social forums: 2005, 2006,..., 2015 and so on. ==Related pages== *Women's March on Versailles *2017 Women's March ==References== ==Other websites== * Goals of the World March of Women, Official website. Category:Feminism",
 "title": "Marche mondiale des Femmes"
}