{
 "id": "1081293",
 "text": "Kim Jong-chul (; born 25 September 1981), sometimes spelled Kim Jong Chol, is a son of former North Korean Supreme Leader Kim Jong Il. His younger brother is current Supreme Leader Kim Jong Un. His older half-brother Kim Jong-nam was assassinated in February 2017. In 2007, Jong-chul was appointed deputy chief of a leadership division of the Workers' Party of Korea. However, on 15 January 2009, the South Korean Yonhap News Agency reported that Kim Jong Il appointed his youngest son, Jong-un, to be his successor, passing over Jong- nam and Jong-chul. These reports were supported in April 2009 when Kim Jong Un assumed a low-level position within the ruling Workers' Party since Kim Jong Il was groomed by his own father, Kim Il Sung, in a similar way before becoming North Korean leader in 1994. ==Early life== Kim Jong-chul was born in 1981. He is the son of Kim Jong Il and his wife Ko Yong-hui, who died in 2004. Jong-chul was educated at the International School of Berne with younger brother Kim Jong Un. ==Heir apparent== In February 2003, moves began to raise the public image of Kim Jong-chul. The Korean People's Army began a propaganda campaign using the slogan \"The Respected Mother is the Most Faithful and Loyal Subject to the Dear Leader Comrade Supreme Commander\". Since the \"Respected Mother\" was described as \"[devoting] herself to the personal safety of the comrade supreme commander\", and \"[assisting] the comrade supreme commander nearest to his body\", Western analysts have guessed that the \"Respected Mother\" was Ko Yong-hui.\"Kim Jong Chol – Leadership Succession – Democratic People's Republic of Korea.\" Global Security. Retrieved 20 January 2009. A similar campaign was launched in praise of Kim Jong Il's mother (Kim Jong-suk) during the later years of Kim Il Sung's life. This suggested that Kim Jong- chul, despite his youth, had emerged with Army backing to be a serious contender to succeed his father. However, Kenji Fujimoto, Kim Jong Il's personal sushi chef, wrote in his memoir, I Was Kim Jong-il's Cook, that Kim Jong Il thought Jong-chul was \"no good because he is like a little girl\". Fujimoto believed Kim Jong Il favoured his youngest son, Kim Jong Un.\"Kim Jong-chul\", BBC, 30 September 2010 On 1 June 2009, it was reported that Kim Jong-chul had been passed over as his younger brother, Kim Jong Un, was to succeed his father as the head of the Workers' Party of Korea and de facto head of state of North Korea. ==2011–present== Kim Jong-chul was reportedly spotted in Singapore on 14 February 2011, where he was attending an Eric Clapton concert. In late 2011, his father died, and his younger brother Kim Jong Un followed his father as the head of state. He was again apparently spotted attending two additional Clapton concerts on successive days at the Royal Albert Hall in London, in May 2015. According to Lee Yun-keol (as reported by Wen Wei Po), chairman of the North Korea Strategy Information Service Center, Kim Jong-chul personally ordered the arrest of his uncle Jang Song-thaek in 2013.Want China News, \"Kim Jong-un's brother led arrest of Jang Sung-taek: source\" , 12 December 2013. Some analysts believe that Kim Jong- chul has a more important position in North Korea than most people think.Zachary Keck and Ankit Panda, \"North Korea Executes Leader's Uncle\", The Diplomat, 13 December 2013. Kim Jong-chul does not involve himself in politics, leading a quiet life in Pyongyang where he plays guitar in a band, according to Thae Yong-ho, North Korea's former deputy ambassador in London who defected to the South.Wonderful Tonight: Taking Kim Jong Un's brother to a Clapton concert == References == == Further reading == * Bradley Martin, Under The Loving Care of the Fatherly Leader: North Korea and the Kim Dynasty, St. Martins (2004), hardcover, 868 pages, * Kenji Fujimoto. I Was Kim Jong Il's Cook. Category:1981 births Category:Living people",
 "title": "Kim Jong-chul"
}