{
 "id": "1081325",
 "text": "Prakash Kaur or Parkash Kaur ( Punjabi: ਪ੍ਰਕਾਸ਼ ਕੌਰ ; Hindi: प्रकाश कौर ; 19 September 1919 – 2 November 1982) was a Punjabi singer. She mostly sang Punjabi folk songs. She is most famous for making Punjabi folk music popular and for trying new things with it. She and her sister Surinder Kaur both did this. People called Surinder the \"Nightingale of Punjab.\" Prakash Kaur also sang Pashto folk songs. ==Early life== Kaur was born in a Punjabi-Sikh family in Lahore, Pakistan. Then, Lahore was part of British India. Surinder Kaur was her younger sister. She also became a famous Punjabi singer and songwriter. Kaur's family used to live in a neighborhood called Mohalla Bhaati Gate. This neighborhood is in the enclosed part of Lahore. Kaur listened to the Rababi women (singers who used a musical instrument named Rabab) singing at weddings and joyful events. She and her sister went to weddings even when they were not invited so they could hear the music. Starting when she was very young, she would copy the singers, trying to sing the same music. She did not go to any lessons in music, even though Lahore had good teachers of classical music. ==Career== Around 1940, Kaur's family gave her permission to sing on the Indian radio. She performed live on Peshawar Radio in 1941. In 1943, her sister Surinder was also selected as a music artist. On August 31, 1943, the two sisters sang their first duet, \"mawan te dhiyan ral baithian,\" for the HMV label. ==Personal life== Parkash Kaur married Sardar Harbans Singh Suri, an electrical engineer who was working for the Indian Department of Railways. Before India's independence, he worked in Lahore, but after India's independence his job sent him to New Delhi. Harbans Singh Suri was a good husband to Parkash. As All India Radio Delhi asked Parkash to sing on the radio more and more, she always had her husband's support. When India and Pakistan became independent of Britain in August 1947, the Hindus and Sikhs of Lahore were told to move to East Punjab and other parts of India because Lahore was going to become part of Pakistan. Prakash Kaur and her family left Lahore and came to India. Prakash and her husband went to live in New Delhi and Surinder went to Bombay (now Mumbai). ==Death== Kaur died on November 2, 1982 at the age of 63. She died after a disability caused by a serious accident but more details of her death remains unknown. ==References== ==Other websites== * Gora Diya Jhanjra, one of her most famous song. Category:1919 births Category:1982 deaths Category:Punjabi people Category:Folklore",
 "title": "Prakash Kaur"
}