{
 "id": "1081838",
 "text": "Sassi Punnu or Sassui Punnhun ( , ) is a well known Sindhi, Balochi and Punjabi folktale. It is one of the seven popular tragic romances of Sindh.Sahibaan remains unheard The Hindu (newspaper), Published 11 October 2016, Retrieved 8 November 2020 It is one of the most popular folktales in Balochistan. The story is about a faithful lover who will suffer any difficulty to find her beloved husband who was separated from her by enemies. == Origin == The tale was first introduced in the texts of Qazi Qadan. Later, it was retold by Hashim Shah in Punjabi. == Story == According to the legend, Sassui was a beautiful girl who belonged to a wealthy family. Punnu, on the other hand, was a poor musician who played the flute and sang for a living. Despite their social differences, the two fell deeply in love and decided to get married. However, Sassui’s family did not approve of their relationship and forbade her from seeing Punnu. They even went to the extent of forcing Sassui to marry someone else. Devastated, Punnu went in search of his beloved, and after wandering in the desert for days, he finally arrived at the place where Sassui was being held captive. The couple met again, and this time, they decided to elope and start a new life together. They left their families behind and embarked on a long journey through the desert, hoping to find a place where they could live happily ever after. However, their journey was not without its challenges. They faced numerous obstacles along the way, including harsh weather conditions, hunger, and thirst. But despite everything, they persevered and finally arrived at a beautiful oasis, where they decided to make their home. Unfortunately, their happiness was short-lived. Sassui’s family eventually found out where they were living and sent a group of men to retrieve her. Punnu fought valiantly to protect his wife, but he was outnumbered and eventually killed in the struggle. Heartbroken, Sassui threw herself into Punnu’s funeral pyre, choosing to die rather than live without her beloved. The tragic story of Sassui and Punnu has become a symbol of true love and sacrifice in the Sindh region and is still remembered and celebrated to this day. == References == Category:Pakistani literature Category:Pakistani folklore Category:Indian literature",
 "title": "Sassui Punnhun"
}