{
 "id": "1081262",
 "text": "Amy Christine Dumas (born April 14, 1975), better known by her ring name Lita, is an American retired professional wrestler and singer. She is best known for working with the World Wrestling Federation/Entertainment (WWE) from 1999 to 2006. She became one of the most popular female wrestlers in the company's history. ==Career== After working for a short time on the independent circuit and in Extreme Championship Wrestling, Dumas began working with the World Wrestling Federation in 1999. She was first paired with Essa Rios. She became more well known when she teamed up with Matt and Jeff Hardy as Team Xtreme. During her career, she won the WWE Women's Championship four times. Dumas had an off-screen relationship with Matt Hardy. It ended in 2005 after her affair with Adam Copeland (then better known as Edge). WWE used the problems between them as part of a story during 2005 and 2006. The affair was part of the reason Hardy was fired in 2005, but he was rehired later in the year. As a result of her personal life, Dumas' character Lita became a heel for the first time. After she stopped wrestling in 2006, she became the lead singer of punk rock band The Luchagors. The band released their self-titled CD, The Luchagors on September 11, 2007. She was inducted into the WWE Hall of Fame in 2014. Since her retirement, Dumas has still worked for the WWE in many ways. She has been a trainer for many years. She still takes part in many events which use \"Legends\" talent. In 2023, she won the WWE Women's Tag Team Championship with Becky Lynch. == Championships and accomplishments == * American Chronicles ** Female of the Year (2006) * Pro Wrestling Illustrated ** Feud of the Year (2005) ** Woman of the Year (2001) * Pro Wrestling Report ** Diva of the Year (2006)Archived at Ghostarchive and the Wayback Machine: * The New York Times ** The New York Times Best Seller list (2003) - * World Wrestling Federation / Entertainment / WWE ** WWF/E Women's Championship (4 times) ** WWE Women's Tag Team Championship (1 time) — with Becky Lynch ** Women's Championship Tournament (2006) ** WWE Hall of Fame (Class of 2014) * Wrestling Observer Newsletter ** Worst Feud of the Year (2004) * Other ** In May 2013, Diva Dirt held a WWE Diva of the Decade tournament for voters to determine the best WWE Diva from 2003 to 2013. Lita was the winner of the competition of 16 WWE Divas. ** In August 2020, Digital Spy held a World Cup tournament to discover the greatest female WWE wrestler of all time. Lita was declared the winner from a list of 32 female wrestlers. == References == ==Other websites== * Official website * Category:1975 births Category:Living people Category:Female professional wrestlers Category:American punk musicians Category:American professional wrestlers Category:Former WWE wrestlers Category:Musicians from Fort Lauderdale, Florida Category:Professional wrestling announcers Category:Professional wrestling managers and valets Category:Singers from Florida Category:Sportspeople from Atlanta Category:Sportspeople from Fort Lauderdale, Florida Category:WWE Hall of Fame",
 "title": "Lita (wrestler)"
}