{
 "id": "1081094",
 "text": "Vershawn Ashanti Young (also known as Dr. Vay) is a researcher of language and performance. Young is known for encouraging \"code-meshing\" instead of code- switching. His research shows that it is not good for people to have to speak and write in a different way at work or at school than they write and speak at home. Young argues that when schools require \"Standard English\" it can be harmful to students of those schools. Instead, professional and school writing should include culture-specific communication styles. Young is a professor of Black Studies at the University of Waterloo. Young works in two departments at the university: the Department of Communication Arts and the Department of English Language and Literature. He specializes in African American English. He also studies how ideas about gender appear in language. == Early life == He was born on a unknown date to his mother Dorothy Jean Young as his father Richard Curtis Moore had left him due to unknown circumstances. His mother completed college and graduate school when he was a child. She taught him to love reading. Reading books made it hard to make friends. His school did not expect him to succeed because he was a black person. He later discovered that he could get better grades by \"acting white,\" but then his black classmates would not like him. He had to find his own way of behaving because he did not fit in anywhere. Young grew up in the Horner Projects in Chicago. He went to college. Then he completed law school at Mitchell Hamline College of Law and got a Ph.D. in English from the University of Illinois Chicago. == Career == Young taught English and Drama in a Chicago high school.Vershawn Ashanti Young, Rhetoric Professor. (2017, November 3). Oberlin Review, The: Oberlin College (OH). Available from NewsBank: Access World News – Historical and Current. He thought the school wanted him to teach Black students to act white. But he wanted students to do good academic work in their own style of language. Young became a school principal. He began doing some work at the University of Illinois Chicago. He was teaching other school principals. Classes at the university were free for university employees. He decided to get his Ph.D. in English because it did not cost money. He liked university work a lot. Young has been a professor at the University of Iowa and the University of Kentucky.Whaley, D. (2015, March 8). Create a space to discuss, address inequalities - GUEST COLUMN. Gazette, The (Cedar Rapids-Iowa City, IA), p. 26. Available from NewsBank: Access World News – Historical and Current He is now a professor in the Department of Communication Arts and the Department of English Language and Literature at the University of Waterloo. He chaired the Convention of the Conference on College Composition and Communication in 2019. He also writes and performs one-man shows.Rob Cline, B. (2009, March 22). 'Fences' builds on power of writing, performances. Gazette, The (Cedar Rapids-Iowa City, IA), p. 4A. Available from NewsBank: Access World News – Historical and Current. == References == Category:Pages created with the Article Wizard from 2024 Category:American academics Category:African-American people Category:Living people Category:Year of birth missing (living people)",
 "title": "Vershawn Ashanti Young"
}