{
 "id": "1081971",
 "text": "Johann Pirkner (25 March 1946 - 26 February 2025) was an Austrian football player in the position of striker. In Austria he played mainly for FK Austria Wien. He also played for the Austrian national football team. For Austria he played in the 1978. 1976 he was top scorer of the Bundesliga. He was born in Vienna. ==Career == He played in Austria for Floridsdorfer AC, Admira and Austria Klagenfurt. From 1969 to 1971 Pirkner played for FC Schalke 04 in the German Bundesliga. He scored eight goals in 47 games. Because Pirkner was involved in the Bundesliga scandal he was banned by the German Football Association. The Austrian Football Association, which had banned Pirkner for two years, pardoned him 1973. «Gnade für Pirkner» In: Arbeiter-Zeitung. Wien 17. Juni 1973, S. 13. When he came back to Austria he played for Alpine Donawitz. From 1974 till 1978n he was a member of the legendary Austria team around Herbert Prohaska, Robert and Josef Sara, Felix Gasselich, Karl Daxbacher and Hubert Baumgartner. The team won the Austrian championship in 1978 and made it to the final of the European Cup winner Cup. Together with Thomas Parits and Julio Cesar Morales, he formed the so-called 100-year storm. Although he played a major role for Austria Wien, he left in the summer of 1978. His last team as a professional footballer was First Vienna FC. 1980 he ended his career as professional footballer. ==International == Pirkner played 20 matches and scored four goals for the Austrian national team. He made his debut on 21 September 1969 in a friendly match in a 1-1 draw against the Germany . He was in the Austrian squad at the 1978 World Cup in Argentina. Wearing the number 19 jersey, he made two appearances against Spain (2:1) and Italy (0:1), when he came on as a substitute for Walter Schachner. The match versus Italy was his last in the team ÖFB Players profile ==Death== Pirkner died on 26 February 2025 at the age of 78.Die Wiener Austria trauert um eine Klub-Legende ==Honours == * 2 × Austrian champion with Austria Wien (1975/76, 1977/78) * 1 ×Austrian Cup with Austria Wien (1976–77 Austrian Cup) * 1 × Austrian Top scorer (1976, 21 goals) ==References == Category:1946 births Category:2025 deaths Category:Austrian footballers Category:Players of the Austrian national football team Category:Austrian Football Bundesliga top scorers Category:FK Austria Wien players Category:Association football forwards Category:Austrian football forwards Category:Austrian football champions",
 "title": "Johann Pirkner"
}