{
 "id": "1081996",
 "text": "The Fort Wayne Komets are an American professional ice hockey team. They began playing in 1993. The team plays in the ECHL. They play their home games in Fort Wayne, Indiana at the Allen County War Memorial Coliseum. They are the ECHL affiliate for the Edmonton Oilers of the National Hockey League (NHL). They are also the affiliates for the Bakersfield Condors of the American Hockey League (AHL). The Komets have also formerly played in the Central Hockey League (CHL), International Hockey League (IHL) (1945—2001), and the International Hockey League (IHL) (2007—2010). In the ECHL, the team originally played in Flint, Michigan as the Flint Spirits from 1985 to 1990. Steve Franke would purchase the team in July 1990 and the ECHL Board of Directors would approve a move from Flint to Fort Wayne, Indiana to become the Fort Wayne Komets. The team would be successful during the 2020–21 season. They finished fourth in the Western Conference with 29 wins, 21 losses, and 63 points. The Komets would be able to make it all the way to the Kelly Cup finals. They would win their first Kelly Cup after defeating the South Carolina Stingrays three games to one. On July 27, 2022, the Komets and the Edmonton Oilers announced their affiliation. In the ECHL, the Komets were previously affiliates with the Colorado Avalanche, Phoenix Coyotes, and the Vegas Golden Knights. ==References== ==Other websites== * Category:1952 establishments in the United States Category:ECHL teams Category:Ice hockey teams in the United States Category:Anaheim Ducks Category:Arizona Coyotes Category:Colorado Avalanche Category:Columbus Blue Jackets Category:Detroit Red Wings Category:Edmonton Oilers Category:Los Angeles Kings Category:Montreal Canadiens Category:New Jersey Devils Category:New York Islanders Category:New York Rangers Category:Pittsburgh Penguins Category:Vancouver Canucks Category:Vegas Golden Knights Category:Washington Capitals Category:Winnipeg Jets",
 "title": "Fort Wayne Komets"
}