{
 "id": "1082823",
 "text": "Andiswa Gebashe is a sign language interpreter for the president of South Africa. She became a household name in South Africa during the COVID-19 pandemic. She was an activist involved in getting South African Sign Language (SASL) adopted as the twelfth official language of the country of South Africa as of July 19, 2023.Tiwane, B. (2023, September 29). Sign Language activist Andiswa Gebashe will crack your ribs with laughter: Here is why. Citizen, The (South Africa). Available from NewsBank: Access World News – Historical and Current == Early Life == Gebashe grew up in Soweto in the 1990s. Her father is deaf. Her first language was SASL. Gebashe’s father is one of the few deaf stand-up comedians in South Africa, and he also translates music and theater into sign language. == Career == Gebashe has run the consulting and interpreting company Andy Signs Productions for over ten years. === Interpretation === Gebashe is a sign language interpreter for the president of South Africa. Gebashe specifically interpreted press conferences and announcements about the coronavirus pandemic. She works with Nicoline Du Toit to translate for the President. She has also interpreted for different ministers of government and the Speaker of Parliament. Gebashe works hard to translate in a way that the original speaker would speak. She tries to act similar to the person who is speaking. Gebashe uses clear facial expressions in her work. Gebashe and Du Toit's interpretation got much attention from the public because their sign language is very expressive. People could see Gebashe making facial expressions that showed how they felt during the pandemic lockdown. People made many memes and music videos using pictures of Gebashe and Du Toit. The memes made them even more popular with people in South Africa and taught people about SASL. === Comedy === She helps translate stand-up comedy into SASL. Gebashe also hosts The Deaf Comedy Show every month in Johannesburg. Her father also does stand-up comedy. == References == Category:South African people Category:Living people",
 "title": "Andiswa Gebashe"
}