{
 "id": "1082314",
 "text": "Catharina Ahlgren (1734–c. 1800) was a Swedish proto-feminist poet and publisher. She was one of the first known female news writers in Sweden. Although she was not a member of the later feminist movement, she had similar ideas. She published and edited various women's magazines in Stockholm and Finland between 1772 and 1783. In 1782, she published the first periodical in Finland, \"Om konsten att rätt behaga\" (The Art of Pleasing Rightly), which was also the first one by a woman. Ahlgren was influential in the Swedish female literary world during the 1750s and 1770s. In her literary career, Ahlgren was known as a translator and poet. She translated poetry and novels from English, French, and German languages. Her first poem was published in 1764 in French, It was dedicated to Queen Louisa Ulrika on her birthday. At one point, she served as a chamber lady in the court of Queen Louisa Ulrika but lost her position due to intrigue. Afterward, she managed a bookstore, translated works, and wrote literary pieces. ==Personal life== Catharina Ahlgren was the daughter of Anders Ahlgren, governor of Östergötland, and Laurentia Juliana Liungenfeldt. She was also related to Johan Gustaf Halldin, chancellor of the Kungliga Biblioteket. Ahlgren first married Bengt Edvard Eckerman, a cavalry master. The marriage faced economic difficulties, and her youngest son was not recognized by her spouse. They divorced in 1770. She then married journeyman Anders Bark or Barck. She moved to Finland with him around 1775 and later settled in Åbo. Her second marriage also ended in divorce. After her daughter Charlotte's death in 1790, she inherited part of her will and settled in Linköping with her daughter Julie in 1796.Tilda Maria Forselius, \"Min nådiga pappas Uprigtiga Vän och fiolliga flicka: Julie Ekerman/Björckegrens brev till Carl Sparre lästa utifrån frågor om makt och identitet\". Magisteruppsats framlagd vid Institutionen för litteraturvetenskap och idéhistoria, Stockholms universitet, 2002 Jonas Apelblad, an orientalist and writer, described her as a strong and talented woman who didn't have a peaceful life with her second spouse, similar to her first marriage.Ann Öhrberg (2001). Vittra fruntimmer. Författarroll och retorik hos frihetstidens kvinnliga författare. Stockholm: Gidlunds Förlag. ISBN 91-7844-330-X ==Career== Catharina Ahlgren became known as a poet and translator in the literary world of the 1750s, even before she published anything formally. She was a close friend of the famous poet Hedvig Charlotta Nordenflycht, and their letters to each other are still kept. Nordenflycht used the pen name \"Herdinnan i Norden\" (Shepherdess of the North). Catharina Ahlgren wrote under the name \"Herdinnan i Ahl-Lunden\" (Shepherdess of the Alder-Grove). She translated poetry and novels from English, French, and German languages. Some of her translations included the German poem \"Die Prüfung Abrahams\" by Christoph Martin Wieland, and the English novel \"The Distressed Wife, or the history of Eliza Wyndham.\" Ahlgren's first poem was \"Au jour de l'illustre naissance de sa majestee notre adourable Reine Le 24 Jullet\" (On the day of the illustrious birth of our adorable Queen on July 24), dedicated to Queen Louisa Ulrika, on the queen's birthday in 1764. ==Legacy== During the time of freedom in Sweden, known as the \"age of liberty,\" and the Gustavian era, many periodicals were published discussing important societal issues, with one notable example being the Then Swänska Argus. These periodicals often took the form of debates or correspondences between two unnamed individuals. Some of them also addressed the role of women in society and gender equality. One of the earliest examples was Samtal emellan Argi Skugga och en obekant Fruentimbers Skugga by Margareta Momma in 1738-39. This anticipated the ideas of first-wave feminism in the English-speaking world. While many of these writings are thought to have been penned by women, they were mostly published under anonymous pseudonyms, making identification challenging. Margareta Momma, Anna Maria Rückerschöld, and Catharina Ahlgren are among the few whose authorship has been confirmed. == References == Category:1734 births Category:1800 deaths Category:Feminist writers Category:Swedish writers",
 "title": "Catharina Ahlgren"
}