{
 "id": "1082763",
 "text": "Carin Sophie Adlersparre, also known as Esselde (born Leijonhufvud; July 6, 1823 – June 27, 1895), was an important figure in the 19th-century women's rights movement in Sweden. She started and edited the first women's magazine in Scandinavia, Home Review (Tidskrift för hemmet), from 1859 to 1885. Additionally, she started Friends of Handicraft (Handarbetets vänner) in 1874, established the Fredrika Bremer Association (Fredrika-Bremer-förbundet) in 1884. She became one of the first two women to serve on a state committee in Sweden in 1885. == Life == Sophie Adlersparre, born in the Leijonhufvud family, was the daughter of army officer Baron Erik Gabriel Knutsson Leijonhufvud and Sofie Emerentia Hoppenstedt. She took her education at home and later joined the popular Bjurström Pension (Bjurströmska pensionen) finishing school in Stockholm. In 1869, she married the noble commander Axel Adlersparre (1812–1879) and became the stepmother of his five children. Her husband supported her in her social reform efforts. Fredrika Bremer influenced Adlersparre's views and she became involved in feminist activites through her friendship with Rosalie Roos. Roos returned to Sweden in 1857 after several years in the United States with a strong interest in women's rights. Their activism was further improved by public discussions about women's rights in Sweden following the publication of Fredrika Bremer's novel Hertha in 1856. As a result of this debate, unmarried women were granted legal majority and guardianship was abolished (1858–1863). Additionally, the first state school for women, the Royal Advanced Female Teachers' Seminary (Högre lärarinneseminariet), was established in 1861. == Home Review == In 1859, Adlersparre and Rosalie Roos started Home Review (Tidskrift för hemmet), the first women's magazine in Scandinavia, with financial support from salon hostess Fredrika Limnell. The magazine provided a platform for discussions on women's rights, gender roles, and feminism in Sweden and quickly gained popularity. Adlersparre, writing under the pen name \"Esselde,\" served as co- editor with Roos until 1868, after which she continued as the sole editor-in- chief. When Home Review stopped publication in 1886, Adlersparre became editor-in-chief of the new women's magazine Dagny until 1888 and remained on its management until 1894. == Feminist Work == Adlersparre's activism focused on women's access to education and employment rather than the right to vote (suffrage), which was given to Swedish women in local elections in 1862. She believed that women's economic independence was very important and supported for their participation in jobs traditionally dominated by men. She famously stated, \"Women need work, and work needs women.\" For this purpose, Adlersparre started evening lessons for women in 1862 and later founded a successful employment agency in 1863. She also asked the Swedish parliament in 1864 to allow women to study at the Royal Swedish Academy of Arts on equal terms with men. This resulted with a reform granting women access to the higher education on the same terms as men. Adlersparre co-founded the Stockholm Reading Parlor in 1866, which gave free access to literature for women and promoted their education and professional opportunities. Adlersparre's support for women's education contributed to significant reforms, including the establishment of the first state-supported secondary schools for girls in 1874. She also served on the Girl School Committee of 1885 (Flickskolekommittén 1885), which proposed reforms to the female education system. As a member of the women's association Nya Idun, founded in 1885, Adlersparre continued to champion women's rights and education throughout her life. == References == Category:Feminist writers",
 "title": "Sophie Adlersparre"
}