{
 "id": "1082576",
 "text": "{{Infobox writer | name = Mariama Bâ | honorific_prefix = | honorific_suffix = | image_size = | alt = | caption = | native_name = | native_name_lang = | pseudonym = | birth_name = | birth_date = | birth_place = Dakar, Senegal | death_date = | death_place = Dakar, Senegal | resting_place = Unknown | occupation = Author | language = French | nationality = Senegalese | citizenship = Senegal | education = | alma_mater = | period = | genre = novel | subject = | movement = | notableworks = So Long a Letter | spouse = | partner = | children = 9 Children | relatives = | awards = | signature = | signature_alt = | years_active = | module = | website = | portaldisp = }} Mariama Bâ (April 17, 1929 – August 17, 1981) was a writer from Senegal. She wrote for women's rights. She was born in Dakar and grew up as a Muslim. Her first novel, Une si longue lettre (1979; translated as So Long a Letter) is about the lives of African women. It tells the story of a woman whose must cope with the loss of her husband while also dealing with his younger second wife. The book won the first Noma Award for Publishing in Africa in 1980. ==Biography== Bâ was born in Dakar, Senegal, in 1929. Her parents were rich and educated. Her family was in the Lebu group of people. Her father worked for the government, and her grandfather worked as an interpreter when the French ruled Senegal. Bâ's grandparents raised her after her mother died. Bâ grew up in the traditional way, but she also learned French and went to a Koranic school. Bâ was successful in her studies, however she had challenges as a girl looking for a higher education during colonial times. At first, her grandparents did not want her to continue her education after primary school, but her father insisted for her to join a teacher training college in Rufisque, Dakar. She was ver successful and eventually became a school teacher. Later, she worked as an educational inspector. Bâ was married three times and had nine children. Her third and longest marriage was to a Senegalese member of Parliament named Obèye Diop, but they eventually divorced. Bâ died in 1981 after a long illness, before her second novel, Un Chant écarlate (Scarlet Song), was published. This novel tells a love story between two individuals from different backgrounds who challenge traditional norms. She wrote two books in French, and people rewrote them in many other languages. == References == Category:Feminist writers",
 "title": "Mariama Bâ"
}