{
 "id": "1082005",
 "text": "Jalila Haider (Urdu: جلیلہ حیدر) is a Pakistani human rights lawyer and activist from Quetta in Balochistan. She is the first woman lawyer from Quetta's Hazara people. The Hazara are a minority group in Balochistan. She speaks for Hazara people and for their legal rights. Haider was born on 10 December 1988 in Quetta, Balochistan, Pakistan. She has a masters degree in international relations from the University of Balochistan. Jalila works with the Awami Workers Party (AWP) and leads the Women Democratic Front in Balochistan. Jalila started a non-profit organization called \"We the Humans – Pakistan.\" This group makes local communities stronger in Balochistan, especially poor women and children. ==Activism== Haider speaks for Baloch political activists who have been killed or who are missing. She helps other people talk to the public about their problems. For example, she helped do hunger strikes so people would notice how hard things are for the Baloch community. In a hunger strike, a person does not eat until other people do the right thing. In April 2018, after nine Hazara people were killed, Haider went on a four-day hunger strike until the Chief of the Pakistani Army agreed to try to stop the murders. Jalila Haider used to lead campaigns against the killing of the Hazara. She spoke in public about cruel to the Hazara and Pashtun people. She believes that the Pashtun and Hazara are both trying to get their rights under the Constitution of Pakistan. ==Achievements== In 2014, she was selected as an Atlantic Council Emerging Leaders of Pakistan Fellow. . In 2015, Haider was selected as one of 'News Women Power 50' list of Pakistan's most influential and powerful women. She was also a 2016 Swedish Institute Young Connectors of the Future Fellow. In 2019, Haider was named in BBC's 100 Women, which is a list of influential women from around the world compiled by BBC. In 2020, she received Hum TV Women Leaders Award. The same year in March 2020, She was honoured with International Women of Courage award by the United States Department of State. In 2023, Haider won the Justitia Award. By winning it, she became the second Pakistan woman to win the award after Nida Usman won it in 2021. ==References== Category:1988 births Category:Living people Category:Women who received the International Women of Courage Award Category:Hazara people Category:People from Balochistan (Pakistan) Category:Feminists",
 "title": "Jalila Haider"
}