{
 "id": "1082300",
 "text": "Marcelina Almeida (around 1830–1880) was a writer from Uruguay. She lived in Montevideo since she was young. Almeida used the names 'Abel' and 'Reine mi bella acclamada' (an anagram of her full name) for her writings. Her book, Por una fortuna una cruz, is known as the first Uruguayan feminist novel. ==Biography== Marcelina Almeida, also known as Marcelina Almeida Abel, was born around 1830 in Argentina.Oreggioni, Alberto (2001). Nuevo diccionario de literatura uruguaya, v. 1. Banda Oriental. p. 31. ISBN 978-9974-1-0217-0. Her exact birth and death dates are unknown. In a poem, Francisco Acuña de Figueroa described her as a Uruguayan by adoption, born in Argentina. Almeida's romantic novel Por una fortuna una cruz was published in Montevideo in 1860. It talks about \"the forced marriage of a fifteen-year-old girl with a twenty-five-year-old man\". The book started a big debate in Montevideo's newspapers. People discussed the book's quality and the fact that a woman questioned marriage. Almeida faced personal attacks, many under fake names. Virginia Cánova, a researcher, explained that Almeida supported liberal feminism, talking about women's lack of rights and how they were always seen as minors under men's protection. She criticized forced marriages, where the father decides for the daughter. In 1991, Cánova found a copy of the novel in the National Library of Uruguay, reviving works missing from Uruguayan literary history. This allowed a limited reissue of the book, along with a study about \"The origins of feminism in Uruguay.\" The study shows that feminism began in the early 19th century and not in the early 20th century, as previously thought. Female writers like Almeida, not María Eugenia Vaz Ferreira and Delmira Agustini, were the pioneers. 8 Almeida also wrote poems, a short story, and articles between 1860-61 for the Semanario Uruguayo and poems for the literary magazine La Aurora de Montevideo between 1862 and 1863. Almeida died around 1880. ==References== Category:1830s births Category:1880 deaths Category:Feminist writers Category:Uruguayan writers",
 "title": "Marcelina Almeida"
}