{
 "id": "1082438",
 "text": "René Wagner (31 October 1972 in Brno) is a former Czech football player and now coach. The striker played in Brno and in Austria for Rapid Wien and SV Mattersburg. There he became top scorer of the league in 1997 with 21 goals. He also played for the Czech Republic national football team. ==Career == René Wagner began his professional career with Boby Brünn. He played for the club until 1996. Then he went to Austria and played for Rapid Vienna. Wagner soon became an important players. In his first season for Rapid, he became top scorer in the Bundesliga in 1996/97 with 21 goals. In eight years in Hütteldorf he played in the Champions League and was Austrian runner-up four times. Wagner never won the title. In the summer of 2004 Wagner moved to league rivals SV Mattersburg. In 2006 Wagner returned to 1. FC Brno and ended his professional career in June 2008. From 2008 to 2010, René Wagner played for SV Leobendorf in Lower Austria. He ended his career as an active footballer with the Czech fourth division club Sparta Brno in 2010. Fotbal.cz ==International == René Wagner played a total of eleven international matches for the Czech Republic between 1995 and 2001. He scored three goals. ==Manager == After the end of his professional career, Wagner he worked as an assistantcoach for the B team of 1. FC Brno. Later he managed the B juniors of the club and then the A youth team. Fotbal.cz In January 2016, the Austrian second division club SC Wiener Neustadt announced that Wagner had been hired as assistant coach Der Standard.at (German) After Kreissl signed a contract as sporting director with first division club SK Sturm Graz, Wagner became head coach of Wiener Neustadt. Kurier.at (German) In May 2017 the club separated from Wagner. ==References == Category:1972 births Category:Living people Category:Czech footballers Category:SK Rapid Wien players Category:Association football forwards Category:Austrian Football Bundesliga top scorers",
 "title": "René Wagner"
}