{
 "id": "1082464",
 "text": "Bernard Mannes Baruch was a Jewish-American financier. He was very successful in the stock exchange. He also helped several presidents in 3 major global conflicts. First in World War 1 with Woodrow Wilson, then in World War 2 with Franklin Roosevelt and Harry Truman, and lastly in the Cold War, with Harry Truman again. He lived until the presidency of Lyndon Johnson. == Family == Baruch's father was Simon Baruch, a Confederate soldier in the American Civil war, a physician, and then a Ku Klux Klan member. He had three brothers, and he was the second brother. They were Herman B. Baruch, Sailing Wolfe Baruch, and Hartwig Nathaniel Baruch. On 1897, when Baruch 27 years old, he married Annie Griffin needs link,an Episcopalian. Their children included Belle Baruch W., Bernard Baruch Jr., and Renée Baruch. (In order of birth). When the couple's first daughter, Belle, or Isabel Baruch was born, Baruch was so happy he wrote a poem about her. It went like this: Oh Isabel, Oh Isabel, The day you were first visible, Paternal pride and future hope We centered all in thee. Oh Isabel, Oh Isabel We’re one and indivisible. We constitute a family now, Where there was two, there’s three (Baroness of Hobcaw, 4-5). The two parents, Baruch and Griffin, had two different religious beliefs; Judaism and Episcopalianism. After an argument, both agreed that their two daughters would be raised Episcopalian and the boy whatever he chooses to believe. == Early Life and Education == Bernard Baruch was the one of 4 sons of Simon Baruch (father) and Isabelle (mother). Baruch's father was a confederate physician and surgeon in the American Civil War. After the war, Simon Baruch and his family traveled to New York City, where Bernard Baruch, his son, would be raised and live for most of his life. Baruch then studied at the College of the City of New York. One day, in a sports accident while he was playing baseball, he damaged his ear, and soon graduated. He worked in numerous jobs until he finally had enought money to become a member of the New York Stock Exchange. By 1900, Baruch was a millonaire, at age 30. == Career == On 1914, Baruch supported Woodrow Wilson financially during his presidential campaign financially. The two men became close as World War 1 raged on. In 1919, Baruch helped Wilson out in the Paris Peace Conference. For a long time afterwards, Bernard Baruch grew his wealth and supported many Democrats, such as Senator Joseph Robinson. But when Franklin D. Roosevelt became the president of the United States, Baruch greatly opposed him, although Roosevelt was a Democrat. But he couldn't ignore the Great Depression. Baruch did all he can to support, recover, and later rebuild the nation. Then another world war, World War 2 was fought. Baruch supported his home nation, and then supported many presidents in the Cold War. He even coined the word, 'Cold War'. After all his long years of being wealthy, supporting presidents and building a family, Bernard Baruch died on 1965, aged 94. In fact, he never associated or worked with any financial house, so was nicknamed, 'The Lone Wolf of Wall Street'. == References == Category:1870 births Category:1965 deaths Category:American bankers",
 "title": "Bernard Baruch"
}