{
 "id": "1082019",
 "text": "The three-spined stickleback (Gasterosteus aculeatus) is a species of stickleback in the genus Gasterosteus. It is found in most inland and coastal waters north of 30°N. It has been a subject of scientific study for many reasons. In its different forms or stages of life, the three-spined stickleback can be a bottom-feeder or a planktonic feeder in lakes or in the ocean. It is also able to eat terrestrial prey fallen to the surface. == Description == The body is laterally compressed. The tail's base is slender. It has three spines that give the fish its name (though some individuals may have only two or four). Dorsal coloration tends towards a drab olive or a silvery green, sometimes with brown mottling. The pectoral fins are large, with 10 rays. The dorsal fin has 10–14 rays. All spines can be locked in an erect position. The body doesn't have scales, but is protected by bony plates on the back, flanks, and belly. They have silvery bellies and flanks. == Distribution == === Northern Hemisphere === The three-spined stickleback is found in the Northern Hemisphere, where it usually inhabits coastal waters or freshwater bodies. === North America === It can also be found in North America, in which it ranges along the East Coast from Chesapeake Bay to the southern half of Baffin Island and the western shore of Hudson Bay, and along the West Coast from southern California to the western shore of Alaska and the Aleutian Islands. == Subspecies == * G. a. aculeatus, the tiddler or tittlebat, is found in most of the species range, and is the subspecies most strictly termed the three-spined stickleback. * G. a. williamsoni, the unarmored threespine stickleback, is found only in North America; its recognized range is southern California. * G. a. santaeannae, the Santa Ana stickleback, is also restricted to North America. These subspecies actually represent three examples from the enormous range of morphological variation present within three-spined sticklebacks. == Reproduction == Sexual maturation depends on environmental temperature and photo-period. Longer days and warmer days stimulate brighter colouration in males and the development of eggs in females. From late April, the males and females move from deeper waters to shallow areas. There, each male defends a territory where he builds a nest on the bottom. He starts by digging a small pit. He then fills it with filamentous algae, sand, and various debris which he glues together with spiggin, a proteinaceous substance secreted from the kidneys. He then creates a tunnel through the more or less spherical nest by swimming through it. == Eco-evolutionary dynamics == Three-spined stickleback research has been central to the field of eco-evolutionary dynamics. === Common methods === Many researchers have used mesocosm experiments to test how the adaptive radiation of stickleback ecotypes and stickleback-parasite interactions can impact ecological processes. == References == # NatureServe. (2019). \"Gasterosteus aculeatus\". IUCN Red List of Threatened Species. 2019: e.T8951A58295405. doi:10.2305/IUCN.UK.2019-2.RLTS.T8951A58295405.en. Retrieved 28 November 2022. # Fang, Bohao; Merilä, Juha; Ribeiro, Filipe; Alexandre, Carlos M.; Momigliano, Paolo (2018). \"Worldwide phylogeny of three-spined sticklebacks\". Molecular Phylogenetics and Evolution. 127: 613–625. doi:10.1016/j.ympev.2018.06.008. PMID 29906607. S2CID 49231567. # Froese, Rainer; Pauly, Daniel (eds.) (2022). \"Gasterosteus aculeatus\" in FishBase. June 2022 version. # Barber, Iain (2013). \"Sticklebacks as model hosts in ecological and evolutionary parasitology\". Trends in Parasitology. 29 (11): 556–566. doi:10.1016/j.pt.2013.09.004. PMID 24145060. # Reimchen, T.E. (1989). \"Loss of nuptial colour in three-spined sticklebacks (Gasterosteus aculeatus)\". Evolution. 43 (2): 450–460. doi:10.2307/2409219. JSTOR 2409219. PMID 28568546. # Haglund, T. R.; Buth, D. G.; Blouw, D. M. (1990). \"Allozyme variation and the recognition of the \"white stickleback\"\". Biochemical Systematics and Ecology. 18 (7–8): 559–563. doi:10.1016/0305-1978(90)90129-4. # Noor, Mohamed A. F. (1999). \"Reinforcement and other consequences of sympatry\". Heredity. The Genetics Society (Nature). 83 (5): 503–508. doi:10.1038/sj.hdy.6886320. ISSN 0018-067X. PMID 10620021. (ORCID: 0000-0002-5400-4408. GS: 5nkhrpUAAAAJ). # \"Darwin's fishes: the threespine stickleback of the Pacific Northwest\". The Seattle Times. 2009-02-15. Retrieved 2022-06-11. # \"Backward-evolving Lake Washington fish lends clues about genetics\". The Seattle Times. 2008-05-15. Retrieved 2022-06-11. # Kitano, J (May 15, 2008). \"Reverse Evolution of Armor Plates in the Threespine Stickleback\" (PDF). Current Biology. 18 (10): 769–774. doi:10.1016/j.cub.2008.04.027. PMID 18485710. S2CID 7864384. Archived (PDF) from the original on August 12, 2017. Retrieved June 11, 2022. # \"The Burke Museum and others celebrate Charles Darwin on the occasion of his 200th\". UW News. Retrieved 2022-06-11. # Behm, J. E.; Ives, A. R.; Boughman, J. W. (2010). \"Breakdown in Postmating Isolation and the Collapse of a Species Pair through Hybridization\". The American Naturalist. 175 (1): 11–26. doi:10.1086/648559. PMID 19916869. S2CID 15817509. # Canada – Species At Risk Act. dfo-mpo.gc.ca # Carroll, Sean B. (2006). The Making of the Fittest: DNA and the Ultimate Forensic Record of Evolution. W.W. Norton & Co. pp. 56–57. . # \"Gasterosteus aculeatus\". Animal Diversity Web. # Whoriskey, F. G.; FitzGerald, G. J. (1985). \"Sex, cannibalism and sticklebacks\". Behavioral Ecology and Sociobiology. 18 (1): 15–18. doi:10.1007/BF00299233. S2CID 21522305. # O’Brien, Conor S.; Bourdo, Ryan; Bradshaw, William E.; Holzapfel, Christina M.; Cresko, William A. (2012). \"Conservation of the photoperiodic neuroendocrine axis among vertebrates: Evidence from the teleost fish, Gasterosteus aculeatus\". General and Comparative Endocrinology. 178 (1): 19–27. doi:10.1016/j.ygcen.2012.03.010. PMC 3389224. PMID 22504272. # van Iersel, J.J.A. (1953). \"An analysis of the parental behaviour of the malethree-spined stickleback (Gasterosteus aculeatus L.)\". Behaviour Supplement. 3 (3): 1–159. JSTOR 30039128. # Candolin, U.; Voigt, H.-R. (2001). \"No effect of a parasite on reproduction in stickleback males: a laboratory artefact?\". Parasitology. 122 (4): 457–464. doi:10.1017/S0031182001007600. PMID 11315179. S2CID 15544990. # Tinbergen, Niko (1989). The study of instinct. Oxford [England]. . # Milinski, M.; Bakker, T. C. M. (1990). \"Female sticklebacks use male coloration in mate choice and hence avoid parasitized males\" (PDF). Nature. # McLennan, D. A.; McPhail, J. D. (1990). \"Experimental investigations of the evolutionary significance of sexually dimorphic nuptial colouration in Gasterosteus aculeatus (L.): The relationship between male colour and female behaviour\". Canadian Journal of Zoology. 68 (3): 482–492. doi:10.1139/z90-071. # Bakker, T. C. M.; Mundwiler, B. (1994). \"Female mate choice and male red coloration in a natural three-spined stickleback (Gasterosteus aculeatus) population\" (PDF). Behavioral Ecology. 5: 74–80. doi:10.1093/beheco/5.1.74. # Baube, C.L.; Rowland, W.J.; Fowler, J.B. (1995). \"The mechanismsof colour-based mate choice in female threespine sticklebacks: hue, contrast and configurational cues\". Behaviour. 132 (13/14): 979–996. doi:10.1163/156853995x00405. JSTOR 4535315. # McKinnon, J. S. (1995). \"Video mate preferences of female three-spined sticklebacks from populations with divergent male coloration\". Animal Behaviour. 50 (6): 1645–1655. doi:10.1016/0003-3472(95)80018-2. S2CID 53193561. # Braithwaite, Victoria A.; Barber, Iain (2000). \"Limitations to colour-based sexual preferences in three- spined sticklebacks (Gasterosteus aculeatus)\". Behavioral Ecology and Sociobiology. 47 (6): 413–416. doi:10.1007/s002650050684. S2CID 28383103. # \"Gasterosteus aculeatus\". Integrated Taxonomic Information System. Retrieved 19 March 2006. Category:IUCN Red List least concern species Category:Scorpaeniformes Category:Animals of Europe Category:Baltic Sea Category:Ray-finned fish",
 "title": "Three-spined stickleback"
}