{
 "id": "1082303",
 "text": "Selva Almada, born on April 5, 1973, is an Argentine writer. She is known for poetry, short stories, and novels. In 2014, she started to write nonfiction with the book Chicas muertas. Almada studied Social Communication in Paraná, but later changed it to Literature at Paraná's Institute of Higher Education. Her early works started during a workshop by Maria Elena Lotringer at the School of Communication. Her first stories were shared in the Paraná weekly Análisis. In 1997-1998, she had a short-lived self-managed cultural literary project named CAelum Blue. Almada learned her storytelling skills in Buenos Aires with the help of Alberto Laiseca's literary workshop. Famous literary figures like Chilean writer Diego Zúñiga and journalist Beatriz Sarlo have talked about her talent. Her stories have been included in collections by publishers like Norma, Mondadori, and Ediciones del Dock. She also has various literary workshops. From March to July 2017, she led the Taller de relato autobiográfico Mirarse el ombligo (Navel Gazing Autobiographical Story Workshop) at Escuela Entrepalabras. ==Works== *2003: Mal de muñecas. Editorial Carne Argentina. Poetry. . *2005: Niños. Editorial de la Universidad de La Plata. Novella. . *2007: Una chica de provincia. Editorial Gárgola. Short stories. . *2012: El viento que arrasa. Mardulce Editora. Novel. . *2012: Intemec. Editorial Los Proyectos. Short stories. . (e-book) *2013: Ladrilleros. Mardulce Editora. Novel. . *2014: Chicas muertas. Random House. Chronicle. . *2015: El desapego es una manera de querernos. Random House. Short stories (compilation). . *2017: El mono en el remolino: Notas del Rodaje de Zama de Lucrecia Martel. Random House. . *2021: No es un río. Random House. . ==Works in translation== * 2019: The Wind That Lays Waste. Graywolf Press. Novel. English trans. of El viento que arrasa by Chris Andrews. . * 2020: Dead Girls. Non-fiction. * 2021: Brickmakers. Novel. ==Awards== * 2010: Fondo Nacional de las Artes Fellowship * 2014: Finalist for the Tigre Juan Award for Ladrilleros * 2015: Finalist for the for Chicas Muertas ==References== Category:1973 births Category:Feminist writers Category:Living people Category:Argentine writers",
 "title": "Selva Almada"
}