{
 "id": "1082115",
 "text": "A Crash Course in Roses is Catie Curtis' fifth album. It came out on August 3, 1999. The album has many songs about love. \"Magnolia Street\" is about understanding that one is in love. This song played on the radio. Although the album was not on the Billboard Music Charts, it was Catie Curtis' most successful album up until that time. A Crash Course in Roses also has two songs that are not about love: \"What's the Matter\" is about her hometown, Saco, Maine for rejecting her when she came out as a lesbian, and \"Roses\" is the story of a soldier who fought in World War I. Several other singer- songwriters like Mary Chapin Carpenter and Melissa Ferrick also helped on the album. == Track listing == Source: Official site, Last.fm == Personnel == * Catie Curtis – Vocals, producer, Wurlitzer, acoustic guitar, piano * Michael Maxwell – gut string guitar * Hugh McCracken – harmonica * Sammy Merendino – tambourine, drum programming * Catherine Russell – gut string guitar * Ben Wisch – producer, engineer, mixing, Wurlitzer * Tom \"T-Bone\" Wolk – accordion, sound effects, bass * Jim Ryan – gut string guitar, mandolin * Mark Spencer – electric guitar, slide guitar, National steel guitar, acoustic guitar * Kenny White – gut string guitar, organ, piano * Akira Satake – banjo * Todd Reynolds – violin * Dawn Buckholz – cello, string arrangements * Liz Marshall – gut string guitar * Duke Levine – electric guitar, mandola, omnichord, e-bow, acoustic guitar * Manolo Badrena – conga, percussion * Paul Bryan – djembe, shaker, bass pedals, organ, bass, percussion * Mary Chapin Carpenter – gut string guitar * Billy Conway – drums, snare drums, percussion * Melissa Ferrick – gut string guitar * Jennifer Kimball – gut string guitar * Jim Robeson – engineer * Jana Leon – photography * Steven Jurgensmeyer – design * Bruce MacFarlane – assistant engineer * Crit Harmon – engineer * Kevin Pickering – assistant engineer * Ted Jensen – mastering == References == Category:1999 albums",
 "title": "A Crash Course in Roses"
}