{
 "id": "1082868",
 "text": "Amlaíb mac Illuilb (, 7 September 938 – 26 October 977) nicknamed the Claimant (), the Destroyer (), and the Criminal () was the Disputed King of Scotland from 971 to 977 though he was never crowned. The son of King Indulf of Scotland (Illuilb mac Causantín), Amlaíb was the next in line of succession to his older brother, King Culen (Culen mac Illuilb). However, in 971, Culen was killed in a rebellion led by his distant cousin, Cináed mac Maíl Coluim, who immediately took the throne as King Kenneth II. Despite this however, Amlaíb declared himself the rightful king and attempted to overthrow Kenneth and kill him in revenge of what Kenneth did to his brother. Amlaíb and his army successfully captured parts of Scotland. ==Exile and Imprisonment== In July 976, Kenneth II ordered an arrest warrant for Amlaíb charging him with Treason and Crimes against humanity. In an attmept to avoid being arrested, Amlaíb decided to go into exile in England in an attmept to not be imprisoned. However, because at that time England had a bad relationship with Scotland, England would brutally torture any Scottish person who would step foot in the kingdom and would immediately imprison or execute them. Thus, Amlaíb decided to go to France. However, just like England, France would capture any Scottish people and would immediately be imprisoned due to the fact that France at that time had a really good relationship with Scotland. The then-King of France Lothair heard about Amlaíb being wanted and also heard that Amlaíb would come to France. Thus, Lothair ordered an immediate arrest for Amlaíb as soon as he arrives in France. Upon reaching France, Amlaíb was arrested and was taken to Paris where he was imprisoned. In September 977, Kenneth II ordered Lothair to send Amlaíb back to Scotland. Lothair agreed and send Amlaíb back to Scotland by boat to be imprisoned. ==Downfall, Illness and Treatment== On 22 October 977, while sailing past Hastings in England on his way to Scotland to be imprisoned, Amlaíb suffered from Tuberculosis. He immediately annouced that he would give up his claim to the throne so that he would get treatment and that his crimes would be dropped and that his Imprisonment would be cancelled. The people who was in the boat with Amlaíb notified the then-King of England Edward II about Amlaíb's illness in an attempt to get treatment in Hastings, Sussex. Edward agreed and Amlaíb arrived in Hastings where he got treatment for his illness and successfully recovered his health. Although Amlaíb relinquished his claim to the throne, Kenneth II refused to dropped his crimes due to the damage Amlaíb did to the kingdom. Instead, Kenneth ordered Amlaíb to be executed. ==Return to Scotland and Execution== Upon arriving to Scone which was the capital of Scotland at that time on 26 October 977, Amlaíb was captured and was imprisoned for a few hours before his execution started later that day. His will was to be buried in Iona Abbey in Iona alongside his older brother (King Culen) and most of the other early Scottish monarchs. Amlaíb was eventually hanged and died at the age of 39. This officially ended the long six year rebellion in the kingdom and peace was restored in the country. He was buried in his will at Iona Abbey. Category:938 births Category:977 deaths Category:House of Alpin Category:Kings and Queens of Scotland Category:Disputed monarchs",
 "title": "Amlaíb, King of Scotland"
}