{
 "id": "1082804",
 "text": "Linda Martín Alcoff is a Latin American philosophy professor at Hunter College in New York City. She studies how knowledge, identity, and power are connected. Her areas of interest include feminism, race, and the ideas of philosopher Michel Foucault. Alcoff wrote or edited multiple books, including Visible Identities: Race, Gender, and the Self (2006), The Future of Whiteness (2015), and Rape and Resistance (2018). Her works on public philosophy have appeared in The Guardian and The New York Times. Alcoff wants more people from different backgrounds to be involved in philosophy. She thinks their ideas can create new ways of studying things, like how feminism changed philosophy. She is a leader in philosophy. She held a top position in a big philosophy group and now helps run a magazine all about feminist philosophy. ==Early life and education== Alcoff was born in Panama, the younger of two daughters to an Irish mother, Laura, and Panamanian father, Miguel Angel Martín, who met while studying at Florida State University. Her father became a professor of history at the Universidad de Panama.Alcoff, Linda Martín (2006). Visible Identities: Race, Gender and the Self. Oxford University Press. pp. vii, 8. When her parents separated, Alcoff moved with her mother and sister to Florida when she was three. In 1980 she got a degree in philosophy from Georgia State University and in 1983 an MA, also in philosophy. She did her doctoral work at Brown University, completed her dissertation under the direction of Ernest Sosa, Martha Nussbaum, and Richard Schmitt and got her PhD in 1987. ==Career== ===Positions held=== Alcoff was an assistant professor of philosophy at Kalamazoo College for a year, then moved to Syracuse University. There, she taught for the next ten years. She became associate professor in 1995 and full professor in 1999. She worked in several jobs at Cornell University (1994–1995), Aarhus University (November 1999), Florida Atlantic University (Fall 2000), and Brown University (Spring 2001). She took a position as professor of philosophy and women's studies at Stony Brook University in 2002. In 2009 she became professor of philosophy at Hunter College and the City University of New York Graduate Center. Alcoff wanted to make philosophy diverse. To help this, she started the \"Pluralist's Guide to Philosophy\" with Paul Taylor and William Wilkerson. From 2010 to 2013, she was co-editor-in- chief of the feminist philosophy journal Hypatia with Ann Cudd. She also managed its board of associate editors during the Hypatia transracialism controversy in 2017.Brubaker, Roger (May 18, 2017). \"The Uproar Over 'Transracialism'\". The New York Times. Following the debates, a group was formed to address governance issues within the journal. In February 2018, Alcoff became president of the board of directors of Hypatia, Inc. ===Research=== Alcoff has explored various topics, including Foucault's ideas, sexual violence, epistemology politics, gender, race identity, and Latino issues. She has authored four books: Real Knowing: New Versions of Coherence Theory (1996), Visible Identities: Race, Gender and the Self (2006), The Future of Whiteness (2015), and Rape and Resistance (2018). Additionally, she has edited ten volumes, written numerous peer-reviewed articles, and contributed to many book chapters and encyclopedia entries. Her article \"The Problem of Speaking for Others\" (1991) in Cultural Critique has been widely cited, with nearly 3000 citations according to Google Scholar. In her book Visible Identities: Race, Gender and the Self, Alcoff tried to give a detailed understanding of social identity by integrating her previous work in epistemology, metaphysics, and ethnic, racial, and gender politics. She told that geographic location significantly influences social identity beyond other factors, although she doesn't see it as deterministic. In her article \"The Problem of Speaking for Others,\" Alcoff studied the difficulties of representation when someone speaks on behalf of others, using concepts from social epistemology like social location and identity. She proposes \"four sets of interrogatory practices\" to guide speaking for others across different social positions: firstly, individuals should question their own motives to ensure they aren't driven by a desire for control. Secondly, they should be aware of the importance of context and location, and they should know how shifting words to another context alters their meaning. Thirdly, accountability and openness to criticism are important. Lastly, individuals must consider the real effects of their words on the discourse and material conditions of those represented. ==Awards and recognitions== Alcoff got various awards, including an honorary doctorate from the University of Oslo in September 2011. She got the Frantz Fanon Prize for her book Visible Identities: Race, Gender and the Self from the Caribbean Philosophical Association in 2009. In 2005, she was recognized as a Distinguished Woman in Philosophy by the Society for Women in Philosophy. Additionally, she held the Meredith Professorship for Excellence in Teaching at Syracuse University from 1995 to 1998. Her work in philosophy was further acknowledged when she was elected to the American Academy of Arts and Sciences in 2023. ==Selected works== * * *Alcoff, Linda Martín (2006). Visible Identities: Race, Gender and the Self. Oxford University Press. * * * == References == Category:Living people Category:Year of birth missing (living people) Category:American feminists Category:American philosophers",
 "title": "Linda Martín Alcoff"
}