{
 "id": "108236",
 "text": "A nuclear accident is an accident that releases radioactivity to the environment, harmfully affects people, and causes a nuclear meltdown. The most serious nuclear accident has been the Chernobyl disaster in 1986. Other serious nuclear accidents include Fukushima Daiichi Nuclear Power Plant accident, Three Mile Island accident, the Windscale fire, Mayak accident, and the SL-1 accident. In the period to 2007, 63 major nuclear accidents have occurred at nuclear power plants. Twenty-nine of these have occurred since the Chernobyl disaster, and 71 percent of all nuclear accidents (45 out of 63) occurred in the United States.Benjamin K. Sovacool. The Costs of Failing Infrastructure Energybiz, September/October 2008, pp. 32-33.Benjamin K. Sovacool. The costs of failure: A preliminary assessment of major energy accidents, 1907–2007, Energy Policy 36 (2008), pp. 1802-1820. ==Fukushima, Onagawa and Tōkai== On 11 March 2011, the Magnitude 9.0 devastating Sendai earthquake and tsunami took place in Japan. As a result, Fukushima Daiichi Nuclear Power Plant, Fukushima Daini Nuclear Power Plant, Onagawa Nuclear Power Plant and Tōkai Nuclear Power Plant stations consisting of eleven (11) reactors were automatically shut down following the earthquake. At Fukushima Daiichi and Daini tsunami waves went over seawalls and destroyed diesel backup power systems. This loss of power caused severe problems including two large explosions at Fukushima Daiichi and leakage of radiation. Over 200,000 people have been evacuated. Seismic recordings at six assessed nuclear power plant facilities indicated the plants had been exposed to peak ground accelerations of 0.037–0.383 g and peak ground velocities of 6.18–52.62 cm/sec. One year after the accident, the official death toll related to the Fukushima accident has been five: one caused by the earthquake, another one had a heart attack, two people drowned, and a last person died in October for unreported causes. None of the deaths have been caused by radiation. == Chernobyl disaster == The Chernobyl disaster was a major accident at the Chernobyl Nuclear Power Plant on April 26, 1986, with an explosion at the plant and later radioactive contamination of the surrounding area. It is so far the worst nuclear accident in the history of nuclear power. A plume of radioactive fallout drifted over parts of the western Soviet Union, Eastern and Western Europe, Scandinavia, the UK, Ireland and eastern North America. Large areas of Ukraine, Belarus, and Russia were badly damaged, forcing the people in charge to have to evacuate and resettle more than 336,000 people. About 60% of the radioactive fallout landed in Belarus, according to official post-Soviet data. (quoting the \"Committee on the Problems of the Consequences of the Catastrophe at the Chernobyl NPP: 15 Years after Chernobyl Disaster\", Minsk, 2001, p. 5/6 ff., and the \"Chernobyl Interinform Agency, Kiev und\", and \"Chernobyl Committee: MailTable of official data on the reactor accident\") The accident made many people worried about the safety of the Soviet nuclear power industry. As a result, plans for more nuclear plants were put on hold and the Soviet government, who were not very open with its data, had to make public more of its data. The now-independent countries of Russia, Ukraine, and Belarus have had to spend a lot of money and time on decontamination and health care costs of the Chernobyl accident. Nobody knows how many people died because of this accident. This is because the Soviets covered up information, did not fully complete lists, and did not let doctors list \"radiation\" as the reason why some people died. Most of the expected long-term deaths, such as that from cancer, have not yet happened and it is hard to say that Chernobyl was the full reason for their deaths. At Fukushima I and II tsunami waves overtopped seawalls and destroyed diesel backup power systems, leading to severe problems including two large explosions at Fukushima I and leakage of radiation.IAEA Update on Japan Earthquake ==Three Mile Island accident== On March 28, 1979, the Unit 2 nuclear power plant on the Three Mile Island Nuclear Generating Station (TMI-2) in Dauphin County, Pennsylvania near Harrisburg suffered a partial core meltdown. The Three Mile Island accident was the worst accident in American commercial nuclear power generating history, even though it led to no deaths or injuries to plant workers or members of the nearby community.U.S. Nuclear Regulatory Commission Fact Sheet on the Accident at Three Mile Island. Available at http://www.nrc.gov/reading-rm/doc-collections/fact-sheets/3mile- isle.html/ The accident unfolded over the course of five tense days, as a number of agencies at local, state and federal level tried to diagnose the problem and decide whether or not the on-going accident required a full emergency evacuation of the population. The full details of the accident were not discovered until much later. In the end, the reactor was brought under control. Although approximately 25,000 people lived within five miles of the island at the time of the accident,President's Commission on the Accident at Three Mile Island, The need for change, the legacy of TMI : report of the President's Commission on the Accident at Three Mile Island (Washington, D.C.: The Commission, 1979). [Aka “Kemeny Commission report.”] Available at http://www.threemileisland.org/ no identifiable injuries due to radiation occurred, and a government report concluded that \"the projected number of excess fatal cancers due to the accident... is approximately one\". But the accident had serious economic and public relations consequences, and the cleanup process was slow and costly. It also furthered a major decline in the public popularity of nuclear power, exemplifying for many the worst fears about nuclear technology and, until the Chernobyl disaster seven years later, it was considered the world's worst civilian nuclear accident. ==Davis-Besse== Davis-Besse Nuclear Power Station is a nuclear power plant with a single reactor located on the southwest shore of Lake Erie near Oak Harbor, Ohio. According to the Nuclear Regulatory Commission, Davis-Besse has been the source of two of the top five most dangerous nuclear incidents in the United States since 1979. and ==SL-1 accident== The SL-1, or Stationary Low-Power Reactor Number One, was a United States Army experimental nuclear power reactor which underwent a steam explosion and meltdown in January 1961, killing its three operators. The direct cause was the improper withdrawal by a maintenance team of a single reactor control rod. The event is the only reported fatal reactor accident in the United States. ==Windscale fire== On October 10, 1957, the graphite core of a British nuclear reactor at Windscale, Cumbria, caught fire, releasing substantial amounts of radioactive contamination into the surrounding area. The event, known as the Windscale fire, was considered the world's worst nuclear accident until the Three Mile Island accident in 1979. The fire itself released an estimated 20,000 curies (700 |terabecquerels) of radioactive material into the nearby countryside. Of particular concern was the radioactive isotope iodine-131, which has a half- life of only 8 days but is taken up by the human body and stored in the thyroid. As a result, consumption of iodine-131 often leads to cancer of the thyroid. No one was evacuated from the surrounding area, but there was concern that milk might be dangerously contaminated. Milk from about 500 km² of nearby countryside was destroyed (diluted a thousandfold and dumped in the Irish Sea) for about a month. ==Mayak accident== Mayak is the name of a nuclear fuel reprocessing plants 150 km northwest of Chelyabinsk in Russia. Working conditions at Mayak resulted in severe health hazards and many accidents, with a serious accident occurring in 1957. The 1957 Kyshtym disaster occurred when the failure of the cooling system for a tank storing tens of thousands of tons of dissolved nuclear waste resulted in a non-nuclear explosion having a force estimated at about 75 tons of TNT (310 gigajoules), which released some 20 MCi (740 petabecquerels) of radiation. Subsequently, at least 200 people died of radiation sickness, 10,000 people were evacuated from their homes, and 470,000 people were exposed to radiation. ==Attacks on nuclear plants== Nuclear reactors become easy targets during military conflict and, over the past three decades, have been repeatedly attacked:Benjamin K. Sovacool (2011). Contesting the Future of Nuclear Power: A Critical Global Assessment of Atomic Energy, World Scientific, p. 192. * Between 18 December 1977 and 13 June 1979: attacks on Lemoniz Nuclear Power Plant in Spain while it was still under construction. * In September 1980: Iran bombed the Al Tuwaitha nuclear complex in Iraq, in Operation Scorch Sword. * In June 1981: an Israeli air strike completely destroyed Iraq’s Osirak nuclear research facility. * On 8 January 1982: Umkhonto we Sizwe attacked Koeberg Nuclear Power Station in South Africa while it was still under construction. * Between 1984 and 1987: Iraq bombed Iran’s Bushehr nuclear plant six times. * In Iraq in 1991: The U.S. bombed three nuclear reactors and an enrichment pilot facility. * In 1991: Iraq launched Scud missiles at Israel’s Dimona nuclear power plant. * In September 2003: Israel bombed a Syrian reactor under construction. ==Radiation accidents== Radiation is harmful to health and there have been many accidents caused by radiation: * 17 fatalities – Instituto Oncologico Nacional of Panama, August 2000 -March 2001. patients receiving treatment for prostate cancer and cancer of the cervix receive lethal doses of radiation.Investigation of an accidental Exposure of radiotherapy patients in Panama - International Atomic Energy Agency * 13 fatalities – Radiotherapy accident in Costa Rica, 1996. 114 patients received an overdose of radiation from a Cobalt-60 source that was being used for radiotherapy. * 11 fatalities – Radiotherapy accident in Zaragoza, Spain, December 1990. Cancer patients receiving radiotherapy; 27 patients were injured.Strengthening the Safety of Radiation Sources p. 15. * 10 fatalities – Columbus radiotherapy accident, 1974–1976, 88 injuries from Cobalt-60 source. * 8 fatalities – Radiation accident in Morocco, March 1984.Lost Iridium-192 Source * 7 fatalities – Houston radiotherapy accident, 1980. * 5 fatalities – Lost radiation source, Baku, Azerbaijan, USSR, October 5, 1982. 13 injuries. * 4 fatalities – Goiânia accident, September 13, 1987. 249 people received serious radiation contamination from lost radiography source.The Radiological Accident in Goiania p. 2. * 4 fatalities – Radiation accident in Mexico City, 1962. * 3 fatalities – Three deaths and ten injuries resulted in Samut Prakarn, Thailand when a radiation-therapy unit was dismantled, February 2000.Pallava Bagla. \"Radiation Accident a 'Wake-Up Call' For India's Scientific Community\" Science, Vol. 328, 7 May 2010, p. 679. * 2 fatalities- Two deaths and one recovery resulted in the Tokaimura nuclear accident. One technician received a fatal dose of radiation and died 83 days later, while the other technician died a few months later. Their supervisor survived but faced negligence charges soon after. * 1 fatality – Mayapuri radiological accident, India, April 2010. * 1 fatality – Malfunction INES level 4 at RA2 in Buenos Aires, Argentina, operator Osvaldo Rogulich dies days later. ==Related pages== * Nuclear accidents in Japan * Nevada Test Site ==References==",
 "title": "Nuclear accident"
}