{
 "id": "1082560",
 "text": "Halmasti or the Celestial Hound is a large horse-sized evil hound in Chitrali mythology of northern Pakistan. It is connected to the heavens, showing by its name, halmasti, which means 'thunder' in Khowar. The Halmasti is said to be a large wolf with dark red fur, long limbs and a large mouth. Some stories say it can even breathe out fire. According to Chitrali stories, Halmasti only appears in places where either a baby is born or someone has died. People believe that these places shouldn't be left empty for seven days and nights; during this time, Quranic recitations should encircle the dead, while newborns should be sung lullabies. People were very careful around babies because they thought Halmasti might hurt them. That's why they wouldn't leave babies alone, and if they really had to, they would put something made of iron, often a knife or a blade, under the baby's pillow. It was believed that the Halmasti hated and avoided the metal and that iron was its weakness. == Name and Origin == Chitral is a place where many different cultures meet. It is in the middle of West, Central and East Asia. Chitrali mythology is a mix of stories from Iranic, Turkic, and Chinese cultures, along with its own local stories. The origin of Halmasti is believed to be in ancient Sumer where it was known as a female demon Littu. Later, Semitic people called it Lillith, spreading throughout European stories as a child snatcher. Iranic people called it Al or Hal, a witch who snatched children. In the Turkic world, Al-Basti hunted guilty souls. The name Halmasti comes from the Turkic word \"Al-Basti,\" but its description differs. Chitrali stories say Halmasti is like the Tiangou (Heavenly Dog) from ancient Chinese tales. It was a celestial hound that came from the sky with thunder and lightning to eat the sun and moon, causing eclipses and mischief among children. == Mythology == The Halmasti is a large creature, like a dog or a wolf, with dark red fur and a huge size. It's often linked to birth and death, making it a symbol of darkness. Because of this, people in Chitral were afraid of it and took precautions. Seeing a Halmasti was thought to bring bad luck. Because people feared the Halmasti, they took different actions when someone died or a baby was born. When a baby was born, it was never left alone. But if there was an emergency and the baby had to be left alone, people would put an iron weapon under the baby's bed to keep the Halmasti away. They believed that iron scared the Halmasti and kept it away. When someone died, the Halmasti often came to where the body was washed or buried. Because of this, people didn't leave those places for seven days. They stayed there and recited the Quran in circles to keep the Halmasti from descending. == References == Category:Pakistani mythology Category:Pakistani folklore",
 "title": "Halmasti"
}