{
 "id": "1082313",
 "text": "Hadith rejectors (Arabic: منكرو الحديث), also known as Hadith deniers,https://kharchoufa.com/en/the-quest-for-authenticity-modern-critiques- of-classical-hadith-collections/ are Muslims who reject the authority of the hadiths. Reasons for rejecting the Hadith include opposition to an extra- Quranic source of scriptural authority, problematic contents of the Hadith, and authenticity of the Hadith. Opponents of the Hadith often say that the Hadith have nothing to do with the Islamic prophet Muhammad. https://books.google.co.uk/books?id=Bw7UEAAAQBAJ&pg;=PA12&dq;=hadith+rejecters&hl;=en&newbks;=1&newbks;_redir=0&source;=gb_mobile_search&sa;=X&ved;=2ahUKEwjA6_3nr7eFAxVg1QIHHRU9DRI4HhDoAXoECAUQAw#v=onepage&q;&f;=false Critiques of the rejectors of Hadith have existed both in the contemporary Islamic world and the greater modern-secular world. Groups that have rejected the Hadiths include Ahl al-Kalām, Mu'tazilites, Kharijites, modernist Muslims, and Quranists. On the other hand, the term Hadithist is a term of reference or depiction, used by Hadith-rejecting Muslims to describe those who adhere to the Hadith.https://books.google.co.uk/books?id=xhtpuBYpDlEC&pg;=PA10&dq;=hadithist&hl;=en&newbks;=1&newbks;_redir=0&source;=gb_mobile_search&sa;=X&ved;=2ahUKEwiOwcztovmLAxVVQUEAHWpbIDQQ6AF6BAgNEAM#v=onepage&q;&f;=false ==Ahl al-Kalām, Mu'tazilites, and Kharijites== Historically, Ahl al-Kalām, who have been described as the forerunners of the Mu'tazilites (Arabic: المعتزلة), rejected the authority of the hadith on the grounds that its corpus was \"filled with contradictory, blasphemous, and absurd\" reports, and that in jurisprudence, even the smallest doubt about a source was too much. Thus, they believed, the true legacy of the Islamic prophet Muhammad was to be found elsewhere, i.e. in the Sunnah, which is separate from the hadith.Brown, Rethinking tradition in modern Islamic thought, 1996: p.15 Similarly, some sects of the Kharijites (Arabic: الخوارج) also rejected the hadith; there were some who opposed even the writing down of the Hadith itself for fear that it would compete, or even replace the Qur'an. The Khawarij believed in the Quran as the only source of Islamic law. https://books.google.co.uk/books?id=coMlEAAAQBAJ&pg;=PT3055&dq;=Khawarij+-+they+believe+in+the+Qur%27an+as+the+only+source+of+Islamic+law&hl;=en&newbks;=1&newbks;_redir=0&source;=gb_mobile_search&sa;=X&ved;=2ahUKEwi_2fGE7LeFAxXi8wIHHSb- Ab4Q6AF6BAgNEAM#v=onepage&q;&f;=false Like Ahl al-Kalām, Mu'tazilites also rejected the hadiths as the basis for Islamic law, while at the same time accepting the Sunnah and Ijma. For Mu'tazilites, the basic argument for rejecting the hadiths was that \"since its essence is transmission by individuals, [it] cannot be a sure avenue of our knowledge about the Prophetic teaching unlike the Qur'an about whose transmission there is a universal unanimity among Muslims\". Under the Abbasid caliph Al-Ma'mun (r. 813-833), the adherents of Kalam were favoured and the supporters of Hadith were dealt harshly. Al-Ma'mun was inclined towards rational inquiry in religious matters, supported the proponents of Kalam and persecuted the adherents of Hadith. His two immediate successors, Al-Mu'tasim (r. 833-842) and Al-Wathiq (r. 842-847), followed his policies. Unlike his three predecessors, Al-Mutawakkil (r. 847-861) was not inclined to rational inquiry in religious matters, and strove to bolster the Hadith as a necessary source of the Sunnah.https://books.google.co.uk/books?id=vdbGAAAAQBAJ&pg;=PA63&dq;=Al- Ma%27mun+was+inclined+towards+rational+inquiry+in+religious+matters,+supported+the+proponents+of+Kalam+and+persecuted+the+adherents+of+Hadith.&hl;=en&newbks;=1&newbks;_redir=0&source;=gb_mobile_search&sa;=X&ved;=2ahUKEwiU1KbvnPmJAxWpQEEAHYwXEHQQ6AF6BAgDEAM#v=onepage&q;&f;=false ==Quranists and modernist Muslims== Hadith rejectors/deniers include Quranists, https://books.google.co.uk/books?id=Bw7UEAAAQBAJ&pg;=PA12&dq;=hadith+rejecters&hl;=en&newbks;=1&newbks;_redir=0&source;=gb_mobile_search&sa;=X&ved;=2ahUKEwjA6_3nr7eFAxVg1QIHHRU9DRI4HhDoAXoECAUQAw#v=onepage&q;&f;=false https://kharchoufa.com/en/the-quest-for-authenticity-modern-critiques-of- classical-hadith-collections/ who view the hadiths as un-Quranic; they believe that obedience to the Islamic prophet Muhammad means obedience to the Qur'an; some further claim that most hadiths are fabrications (pseudepigrapha) created in the 8th and 9th century AD, and which are falsely attributed to Muhammad.Aisha Y. Musa, The Qur’anists, Florida International University, accessed May 22, 2013.Neal Robinson (2013), Islam: A Concise Introduction, Routledge, , Chapter 7, pp. 85-89 Similar to Quranists, modernist Muslims also believe that the problems in the Islamic world come partly from the traditional elements of the hadith and seek to reject those teachings. == References == Category:Islam",
 "title": "Hadith rejectors"
}