{
 "id": "1082002",
 "text": "Women Democratic Front (WDF) is a Pakistani independent, socialist and feminist organization. The organisation was officially founded on 8 March 2018 at Islamabad, Pakistan. Its foundation was set by hundreds of individuals, who speaks or acts on behalf of an organization from Sindh, Balochistan, Punjab and Khyber Pakhtunkhwa on March 8, 2018. The aim of WDF is to unite the women of the Pakistan. They want such unity to create a collective feminist movement that will bring real features of the International Women's Day celebrations to the country's society. For that, They think a change should happen in the society. ==Foundation== Women Democratic Front (WDF) was officially started on 8 March 2018 on the International Women's Day. It's foundation was done by different people that came from all around Pakistan. The group then did a march through various cities of Pakistan and named it 'Aurat Azadi March' (Urdu: عورت آزادی مارچ) which means 'Women's Freedom March'. In 2019, The group did another March on International Women's Day in alliance with various other groups in Pakistan such as Women Action Forum, The Transgender community in Pakistan, Sindhi Aurat Tanzeem, etc. Some celebrities, political workers and medical workers also joined the March. The March got a positive (good) response from Feminists around the world while the right wing in Pakistan judged it as 'Un-Islamic'. ==Ideology== Their ideology is described as socialist-feminism and is seen as an ongoing women's political struggle against violence (particularly domestic violence), discrimination and patriarchal oppression, pillars of capitalism, imperialism, feudalism and religious extremism (such as Honor killing). ==Organizational structure== The Women Democratic Front is a federal organization with a presence of four national units across Pakistan. The 4 units are located in Khyber Pakhtunkhwa, Sindh, Punjab/Islamabad, and Baluchistan. WDF also has a federal unit. The group aims to grow its reach to include the disputed territories of Gilgit- Baltistan and Kashmir, organizing women in those areas. WDF runs through two main structures: the Congress for political and ideological decision-making, and the Council, which oversees day-to-day affairs. These structures operate at district, federal, and provincial/national levels, making sure that there is effective governance and representation within the organization. ==Leadership== *President: Ismat Shahjahan *General Secretary and one of the Founder: Alya Bakhshal *Secretary Information and Publishing: Tooba Syed *Secretary Education and Art: Shahzadi Hussain *Nargeen Afsheen Khatak: Leader of WDF in Khyber Pakhtunkhwa province. *Jalila Haider, one of the provincial president of WDF, from Quetta, Balochistan was named in the 100 Women (BBC) in 2019 which is a list about inspiring and influential women compiled by BBC *Zoya Rehman: Federal Education Secretary. ==Other websites== *Official website of Women Democratic Front. ==References== Category:Political movements Category:Women's rights",
 "title": "Women Democratic Front"
}