{
 "id": "1082957",
 "text": "Darangen is a long epic poem of the Maranao Muslim people from the Mindanao region of the Philippines. It tells stories in 17 parts, with 72,000 lines. One important story is about a famous hero, Bantugan. The word Darangen means \"that which is narrated by song or chant\" in the Maranao language. In 2002, Darangen was named a National Cultural Treasure by the National Museum of the Philippines. The Lanao del Sur provincial government also called it a Provincial Treasure. UNESCO declared Darangen a Masterpiece of the Oral and Intangible Heritage of Humanity in 2008. It's the longest epic poem in the Philippines. Darangen is usually sung or chanted. Sometimes, singers perform parts of it during weddings and celebrations. They use instruments like kulintang gongs, Tambor drums, and kudyapi stringed instruments. Dancers also act out different parts of the story. It can last a few hours or even a week. The poem also teaches about Maranao customs, values, and practices of both the Islamic period and before the Maranao converted to Islam in the 14th century. == History == The Darangen is a story passed down through generations, not written by a single person. It has 72,000 lines divided into 17 cycles, each telling a different story but connected together. The epic is written in an old version of the Maranao language. Skilled singers called onor memorized the Darangen. It was often sung at night, during weddings, or to lullabies for children. A full performance of the epic takes about a week, but shorter performances are more common, lasting a few hours. Singing is accompanied by traditional Maranao instruments like kulintang gong ensembles and Tambor drums. The Darangen mostly reflects the beliefs of the Maranao people before they became Muslim. Heroes in the story worship and interact with ancestor spirits and nature spirits. For example, Batara-sa-Marudo, a nature spirit who can control floods and storms. The main setting of the epic is the city of Bembaran, once a grand city near a river. It's said to have vanished into the sea. The story also talks about relationships between the Maranao people and other groups like the Manobo and the Sama-Bajau. === In written form === The Darangen was only in form of chants and songs. An American missionary and teacher, Frank Charles Laubach, found its value in 1930. He was amazed when Maranao leaders sang it during a boat journey. Laubach decided to write down the epic. He met a nobleman named Panggaga Mohammad who helped him. Laubach published part of the Darangen in 1930, making it the first time Maranao songs were written in Latin letters. Laubach's version was not complete. Later, scholars from Mindanao State University worked on it. They gathered different parts and versions from Maranao elders and handwritten books. It took them ten years. From 1986 to 1988, they published the whole epic in eight books, in both Maranao and English. == Folk dances == Dances related to the Darangen include: * Kaganat sa Darangen: This dance tells the story of Prince Lomna's journey to propose marriage. Dancers move gracefully, using fans, and sway their fingers and hips. * Sagayan: This is a war dance that shows Prince Bantugan preparing for battle. It's sometimes called Kasagyan. * Singkil: In this dance, dancers use bamboo sticks, clashing them together. It portrays the abduction of Princess Gandingan and her rescue by Prince Bantugan. It's also known as Kasingkil or Kasayaw sa Singkil. == References == Epic Category:History of the Philippines",
 "title": "Darangen"
}