{
 "id": "1082655",
 "text": "Market segmentation is the process of dividing consumers, into sub-groups of customers (known as segments) based on shared qualities to get better sales in marketing. In these markets, people who study this idea usually look for common things between customers such as shared needs, common interests, and similar ways of living. The overall goal is to provide a more useful service for every type of customer. Many different ways to segment a market have been found. They usually do it by finding differences in customers to provide the most useful products for potential customers and regular customers alike. Market segmentation assumes that different people have different needs – that is, different offers, features, prices, and more. They usually advertise different products differently to get the product sold to the best customer for the best service. Market segmentation is also for the company to study to better understand an individual's needs and purchase reasons, as it helps brands understand ways to better marketing, strategy, planning, and more. == Definition and overview == Market segmentation, from an business view, assumes different people will want different products.Dickson, Peter R.; Ginter, James L., \"Market Segmentation, Product Differentiation, and Marketing Strategy, \" Journal of Marketing, Vol. 51, No. 2, 1987, p. 1 It splits customers into groups with different needs and wants.Pride, W., Ferrell, O.C., Lukas, B.A., Schembri, S., Niininen, O. and Cassidy, R., Marketing Principles, 3rd Asia- Pacific ed, Cengage, 2018, p. 200 The idea is to reach competitive advantage and that they should make more products to satisfy more people, thus getting more sales and customers.Madhavaram, S., & Hunt, S. D., \"The Service-dominant Logic and a Hierarchy of Operant Resources: Developing Masterful Operant Resources and Implications for Marketing Strategy, \" Journal Of The Academy Of Marketing Science, Vol. 36, No. 1, 2008, pp 67-82. They must also consider how to make a product and many other things when doing this segmentation. Brands and people studying segmentation have to consider many things, such as: === Examples of what is thought about when doing segmentation === * Purchase/Usage Reason: regular event, special event, gift-giving * Benefit-Sought: economy, quality, service level, convenience, access, etc * Types of Statuses: Type of user status, brand loyalty status, product adopter status * Usage Rate/Purchase Frequency: Light user, heavy user, moderate user * Buyer Readiness: Unaware, aware, intention to buy * Attitude to Product or Service: Loves, likes, doesn't care/doesn't know it exists, dislikes, hates These brands and people studying also have to consider the target markets to reach to, such as: ===Examples of what is thought about when figuring out target markets=== * What should be used to figure out markets? * How many markets to enter? * Which market segments are the most valuable? == Different types of segmentation == There are many different types of market segmentation, such as: Demographic segmentation: To get better sales brands may make different products attracting people of certain types. Baker, M., The Marketing Book, 5th ed, Oxford, Butterworth-Heinemann, 2003, p.709 Geographic segmentation: The belief that different peoples with different ways of living have different needs, so they segment with that idea in mind.Wedel, M. and Kamakura, W.A., Market Segmentation: Conceptual and Methodological Foundations, Springer Science & Business Media, 2010, pp 8-9 Psychographic segmentation: A segmentation applying psychology to sell a product, considering how a person may spend their time. Behavioural segmentation: Divides potential customers into groups according to their seen behaviours. Many marketers believe this is the best type of segmentation.Philip Kotler and Gary Armstrong, Principles of Marketing, Pearson, 2014; 2012 Burrows, D., \"Is behavioural data killing off demographics?\" Marketing Week,4 September 2015 Generational segmentation: Segmentation by age-divide, or generations.McCrindle, M., Generations Defined [Booklet] n.d. circa 2010 Online: http://mccrindle.com.au/BlogRetrieve.aspx?PostID=146968&A;=SearchResult&SearchID;=9599835&ObjectID;=146968&ObjectType;=55 Cultural segmentation: Division by how a person was raised and how they live in a way.Ellson, T., Culture and Positioning as Determinants of Strategy: Personality and the Business Organization, Springer, 2004 == Criticisms == Market segmentation has many critics. Despite its limits, market segmentation remains one of the most long lasting marketing practices.Yankelovich, D., Meer, D. \"Rediscovering Market Segmentation\", Harvard Business Review vol. 84. no 2, 2006, pp. 122–13 Criticisms and limitations of segmentation have been well documented.Hoek, J., Gendall, P. and Esslemont, D., Market segmentation: A search for the Holy Grail?, Journal of Marketing Practice Applied Marketing Science, Vol. 2, no. 1, pp. 25–34, 1996 Such criticisms include: * That it is no better than mass marketingAddison, T. and O'Donohue, M., \"Understanding the Customer’s Relationship With a Brand: The Role of Market Segmentation in Building Stronger Brands,\" Market Research Society Conference, London, 2001, Online: http://www.warc.com/fulltext/MRS/49705.htm * Segments rarely show differences in the way customers use brandsKennedy, R. and Ehrenberg, A., \"What’s in a brand?\" Research, April, 2000, pp 30–32 * That it fails to find smaller groups of customersBardakci, A. and Whitelock, L., \"Mass-customisation in Marketing: The Consumer Perspective,\" Journal of Consumer Marketing vol. 20, no.5, 2003, pp. 463–479. * Segments are splits that brands create for people that may not represent all or certain people. == Related pages == == References == == Other websites == *Customer Segmentation A Step-by-Step Guide Category:Demography Category:Marketing",
 "title": "Market segmentation"
}