{
 "id": "1082008",
 "text": "The Simurgh (/sɪˈmɜːrɡ/; Persian: سیمرغ) is a Kind bird in old Persian stories. People sometimes compare it to other mythic birds like the Phoenix and the Huma, but it is different and special in its own way. This mythical bird is found in old stories and pictures from Iran, Georgia, Pakistan, and other places that were influenced by Persian culture. == Name == The word \"sīmurğ\" (سیمرغ) in Persian comes from an older Persian word \"sēnmurw\". This old word comes from another ancient language called Avestan, where it was \"mərəγō Saēnō\". Later, this word was taken into Armenian as \"siramarg,\" which means 'peacock'. On another topic, the phrase \"sī murğ\" (سی مرغ) in Persian means \"thirty birds.\" A famous Sufi poet named Attar of Nishapur used this phrase in his story \"The Conference of the Birds,\" where it is used in a fun way within the story. == Mythology == The Simurgh is a mythical animal shown in old Iranian painting. It looks like a big bird with giant wings that can carry an elephant or whale. In the paintings, it might have a peacock's body, a dog's head, and lion claws, or sometimes even a person's face. The Simurgh is known for being gentle and is thought to be a female. It is like a mix of different animals because it feeds its babies milk and has teeth. It does not like snakes and lives where there is lots of water. People say its feathers are copper-colored, and even though it was first described as part dog, later pictures show it with either a human or dog head. The first part of its name, \"Si-,\" might come from the Persian word for \"thirty.\" But the real reason for its name is not about the number thirty. However, in stories, they say the Simurgh is as big as thirty birds or has thirty colors. Some say its name comes from old words like \"sin murgh\" meaning \"eagle bird\" in Pahlavi or \"saeno merego\", which means \"eagle\" in Avestan. In old stories from Iran, the Simurgh is very ancient and has seen the world get destroyed three times. People believe it knows everything from all times. One story says the Simurgh lived for 1,700 years before burning itself, kind of like the phoenix does. The Simurgh is all about making the land and water clean, showing how Earth and sky are connected, and carrying messages between them. It makes its home in Gaokerena, a special tree that spreads seeds to grow healing plants for people. The Simurgh and Hōm are close, both shown as birds that make things pure and can heal. Hōm is like a symbol of a king's power, while the Simurgh is a sign of approval from the gods, sitting on the heads of kings and holy people. The Simurgh is shown a lot in Ferdowsi's Shahnameh, where it looks after a prince named Zal, who was born with albinism and gives him smart advice. Zal later asks the Simurgh for help when his wife Rudaba is having a tough time giving birth. This shows how nice and important the Simurgh is in Persian stories. Also, the Simurgh is in a story about Esfandiyar's Seven Challenges, where it fights Esfandiyar but ends up losing, even though it is really powerful. == In Sufism == In Persian stories, the simurgh is like a symbol for God in a special kind of thinking called Sufi mysticism. In a story from the 12th century called \"The Conference of the Birds\" by poet Farid ud- Din Attar, there are birds looking for the simurgh. Each bird stands for a different human problem, and they are trying to find the simurgh because they think it is their leader. They are led by a smart hoopoe bird and they eventually find where the simurgh is supposed to live, but all they see is a lake reflecting themselves. This story uses a funny Persian wordplay about \"thirty birds\" (si morgh). Another Persian poet named Rumi talks about the simurgh in his writing, connecting it to a place called Mount Qaf. The idea of the simurgh also went into Arabic stories and mixed with other mythic birds like the ghoghnus, becoming something called the rukh, which later influenced the English word \"roc.\" Early artworks and coins from a long time ago, from a group called the Umayyads, showed pictures of the simurgh because they were mixing different cultures together. == References == Category:Mythology Category:National symbols of Iran",
 "title": "Simurgh"
}