{
 "id": "1083348",
 "text": "Jawbreaker is an American punk rock band formed in New York City in 1986. It was founded by singer and guitarist Blake Schwarzenbach, drummer Adam Pahler, and bassist Chris Bauermeister. The band ended in 1996, but started again in 2017. Jawbreaker is said to be inspirational for many punk rock and emo bands of the 1990s and 2000s. == History == === 1986-1990: Band creation and first recordings === Jawbreaker was created in 1986 under the name \"Rise\" while Schwarzenbach, Pfahler, and Bauermeister were attending New York University (NYU). In 1987, the band moved as a group to Los Angeles, and added Schwarzenbach's childhood friend Jon Liu as the singer. The first demo that the group recorded was \"Shield Your Eyes\", which Schwarzenbach singing. After the demo was recorded, the group decided to continue on as a trio without Jon Liu. The trio changed their name to \"Jawbreaker\", and signed to independent label Shredder Records. Their first release on the label was \"Shield Your Eyes\" on the 7\" vinyl compilation album called The World's in Shreds Volume Two. The band went on to record the single release \"Busy\" and the Whack and Blite 7\" E.P. in 1989. In May of 1990, Jawbreaker released their first album Unfun through Shredder Records. === 1991-1992: Bivouac === Following the \"Fuck 90\" tour of the summer of 1990, Jawbreaker ended for a short period of time. Schwarzenbach and Bauermeister went back to New York City to finish their college degrees, and Pfahler stayed in Los Angeles. The members quickly regretted their decisions, and decided to start the band again in San Francisco, California. The band recorded Bivouac through Tupelo Recording Company in 1991, and released it in 1992. While recording Bivouac, Schwarzenbach started to grow a painful bump on his throat. The band continued to go on a tour of Europe, even though it was risky. When the band was playing in Ireland, Schwarzenbach had to receive emergency surgery on his throat. The song \"Out Patient\" on the band's 1994 album 24 Hour Revenge Therapy may be talking about his surgery. === 1993-1994: 24 Hour Revenge Therapy and record label change === After the band's tour of Europe, Schwarzenbach and Pfahler were homeless. Schwarzenbach moved to Bay Area city Oakland, which inspired the band's next album. The album was released in 1994, and is often said to be the band's best album. Since the record was doing well, the band received an offer from DGC Records, a popular record label, for one million dollars. The punk rock scene did not like that Jawbreaker was signing to a popular label. The band was thought to be a truly independent punk rock group, and by signing to a large company's record label, they were going against that. Many people, including Ben Weasel from Chicago punk band Screeching Weasel, criticized the band's choice. === 1995-1996: Dear You and end of band === After Jawbreaker signed to DGC Records, they recorded their final studio album. Dear You was released in 1995, and received mixed reviews. The band did not work together closely on the album, and often recorded at separate times. The end result was a clean, highly produced album that did not sound like Jawbreaker's other albums. Jawbreaker also recorded their first and only music video for the album single \"Fireman\", which was in rotation on MTV. The band toured after the record was released. Many fans did not like the new material, and would openly turn away from the band while they were playing shows. Off-stage, the band continued to fight. On July 4 of 1996, the band officially announced that they would stop playing music together. === 2017-present: Band starts again === == Members == * Blake Schwarzenbach (guitar, singing) * Adam Pfahler (drums) * Chris Bauermeister (bass) == Discography == === Studio albums === * Unfun (1990) * Bivouac (1992) * 24 Hour Revenge Therapy (1994) * Dear You (1995) === Extended plays === * Whack & Blite (1989) * Chesterfield King (1992) === Singles === * \"Busy\" (1989) * \"Fireman\" (1995) === Compilation albums === * Etc. (2002) === Live albums === * Live 4/30/96 (1999) === Promotional singles === * \"Lurker II: Dark Son of Night\" / \"Million\" (1995) * \"Accident Prone\" (1995) Category:1980s American music groups Category:1990s American music groups Category:American punk bands Category:Musical groups established in 1986",
 "title": "Jawbreaker (band)"
}