{
 "id": "1083850",
 "text": "Owner-occupancy or home-ownership is a form of housing in which a person, called the owner-occupier, owner-occupant, or home owner, owns the home in which they live. The home can be a house, such as a single-family house, an apartment, condominium, or a housing cooperative. Owner-occupancy is also a real estate investment. The value of housing generally increases over time. Some homes are built by or for the people who want to live in them. Many are inherited. A large number are bought, as new homes from a real estate developer or as an existing home from a landlord or an owner-occupier. A home is the most expensive single purchase most people make. It usually costs several year's household income. Most people do not have enough money to pay the entire amount outright. They borrow money using the home as security. This is called a mortgage. They have to pay interest on the loan. If they dont pay the lender can take their home. In many countries the government helps people to buy homes. There may be grants or subsidies. They may have to meet certain qualifications to get this help such as being a first-time homebuyer or having an income below a certain level. They may have to pay property taxes, related to the value of the property, either every year, or when the property is sold. ==International statistics== Country % Owner-Occupied Units in Urban Areas Urban Population, % of Total Argentina 67% 92% Armenia 96% 64% Australia 68% 89% Azerbaijan 71% 52% Brazil 74% 87% Bulgaria 87% 73% Canada 68% 81% Chile 69% 89% China 89% 45% Colombia 50% 75% Costa Rica 75% 94% Czech Republic 47% 74% Denmark 54% 87% Egypt 37% 43% France 47% 78% Germany 43% 74% Haiti 60% 48% Hong Kong 53% 100% Hungary 93% 68% India 87% 30% Indonesia 67% 54% Italy 80% 68% Kazakhstan 96% - Kenya - 22% Republic of Korea 56% 82% Malawi - 19% Malaysia - 72% Mexico 71% 78% Mongolia - 58% Morocco 62% 57% Namibia 69% 35% Netherlands 59% 83% New Zealand 67% 87% Nigeria 10% 50% Norway 77% 78% Pakistan - 38% Panama 66% 75% Peru - 72% Philippines 80% 66% Poland 78% 61% Romania 97% 54% Russia 81% 73% Rwanda - 19% Senegal - 43% Singapore 87% 100% South Africa 62% 62% Spain 85% 77% Sri Lanka 82% 15% Sweden 41% 85% Switzerland 40% 74% Tanzania - 26% Thailand 75% 34% Tunisia 78% 67% Turkey 81% 70% Uganda - 13% Ukraine - 68% United Kingdom 50% 90% United States 65% 82% Uruguay 59% 93% Venezuela 83% 94% Vietnam - 28% Zimbabwe - 38% Source: Housing Finance Information Network (HOFINET)Housing Finance Information Network (HOFINET) ==References== Category:Housing",
 "title": "Owner-occupancy"
}