{
 "id": "1083315",
 "text": "The Yowlah, (Arabic: اليولة or العيالة, al-ʿayyalah or al-ʿiyyalah) also known as Al-Yola, is a traditional folk dance of the United Arab Emirates. The person who performs the dance is called a Yawil. The dance is also performed in Oman and Qatar. It is commonly performed at weddings and celebrations. It involves men and women dancing separately to traditional music, along with sounds of drums and other instruments. Started as a Bedouin war dance, it was originally performed by men turning their rifles or swords in round shape after a victory in battle. The dance includes people of all age from children to old. ==Transformation== In the past, men used real weapons which had bullets but today they use the light weight weapons similar to Kalashnikov rifles, and also without bullets. Children mostly use sticks instead of weapons as they are easier to use. Mohammed Al-Yateen, who led the Dubai Military Association band explains that, > \"performing the Yowlah was tougher in the past, because in those times, the > rifles were heavier compared to today. It's an art that showcases a man's > strength, as not everyone can master the skill required to perform the > Yowlah.\" Balancing the weapon with skillful hand movements is also very important for this folk dance. ==The Dance== The Yawil, who leads the dance, uses a weapon or sometimes a wooden piece shaped like a weapon, in the dance. The dance is started by walking slowly with the weapon, then quickly rotating the weapon in a circle, then throwing the weapon into the air at a medium distance, and the yawil then receives the weapon while sitting on one knee. In the old days, men used to sing \"challah\" without any drums or rhythms. But now, rhythms have become an important part of this art. In the old days, men would stand in rows and sing verses repeatedly, making the place echo with their voices. The first row would sing a verse to the tune of \"challah war,\" and then the second row would reply with another verse. This would continue, making the sound of the singing louder and louder. ==World records== In November 2014, yowlah (with the name of Al-Ayyala) was recorded on UNESCO's Representative List of Intangible Cultural Heritage Items of Humanity. On 26 November 2010, Guiness Book of World Records recorded the largest Yowlah dance in Fujairah where 285 participants from three different tribes performed at a final event of the traditional sword competition for the Crown Prince of Fujairah. ==Related pages== * Al-ras (drum) ==References== Category:Folk dance Category:Culture of the United Arab Emirates Category:Omani culture Category:Qatari culture",
 "title": "Yowlah"
}