{
 "id": "1083939",
 "text": "Organ trade means treating human organs as a product, and trading with them, usually to make a profit. In many cases, the traded organs are used for transplantation.(Carney, Scott. 2011. \"The Red Market.\" Wired 19, no. 2: 112–1. Internet and Personal Computing Abstracts.) According to the World Health Organization (WHO), organ trade is a commercial transplantation where there is a profit, or transplantations that occur outside of national medical systems. There is a global need or demand for healthy body parts for transplantation, which exceeds the numbers available. , there are more than 100,000 people waiting for an organ transplant in the United States. The median wait time for heart and liver transplants in the U.S. between 2003 and 2014, was approximately 148 days. Average time waiting for donor organs varies significantly depending on the patient's UNOS status. Patients listed as Heart Status A1 wait an average of 73 days. Like with other medical subjects, many countries have regulations, how organs can be donated, and how these donated organs have to be transferred from one person to the other. Also, if it is used for transplantation, the organ transferred needs to be kept alive. Often, this requires a lot of technology. Also, the time an organ can survive outside the body is limited, which means that the distances that can be covered are limited. There is a worldwide shortage of organs available for transplantation. Despite this, the commercial trade of human organs is illegal in all countries except Iran. Despite these prohibitions, organ trafficking and transplant tourism are widespread. The question of whether to legalize and regulate the organ trade to fight against illegal trafficking and organ shortage is greatly debated. This discussion typically centers on the sale of kidneys by living donors, since human beings are born with two kidneys but need only one to survive. == Issues == Trading with organs also raises a number of issues that need to be addressed: * At what price should an organ be sold? - Prices on the black market are usually much higher than those on the regulated market. * What is a good price for the person receiving the organ to pay? - Needing to pay for an organ will introduce inequalities between those who can afford the price, and those who can't. * What does a donor get for agreeing to donate an organ? - Is it advisable to pay in real money, and doesn't that put pressure on poor people to sell their organs? * Can it be justified to travel to a different county to get an organ? - What if that other country has regulations that are less strict? * Do people have the right to sell their organs? - If people didn't say what happens to their organs, can they be taken, yes or no? (Different countries have different rules here) * If people get something for selling their organs, this will put pressure on poor (and very poor) people to sell their organs * Do the laws treat people like objects (where organs can simply be taken)? - Immanuel Kant said, that people should be treated with dignity. == Legal organ trade == People can give (or donate) their organs, willingly, and they will be given to another person. In many cases, this happens after their death. The organs are transferred according ot strict rule. Usually the transfer is supervised by state institutions, or medical staff. The patient recieving the organ will only have to pay a small part of the cost, the state will take most of it. == Illegal organ trade == There are many people waitng for an organ. Depending on the organ, and the conditions, high profits can be made with selling organs. There are organized groups that trade with organs. One method is to make a poor person in an underdeveloped country agree to sell an organ. That organ can be sold in a rich country, for considerable profit. In some cases, the perople aren't asked and their organs are simply taken without their permission. == References == Category:Health Category:Social issues",
 "title": "Organ trade"
}