{
 "id": "1083359",
 "text": "Ulric Franklyn Browne (born April 1957) is an English actor. He is best known for portraying Winston in the BBC soap opera EastEnders. == Early life == Ulric Franklyn Browne was born in England in April 1957. Browne studied at Mountview Academy of Theatre Arts in Peckham, South London. == Career == Browne made his debut as an actor on 26 November 1985, with the role of market trader Winston in the BBC One soap opera EastEnders. His character rarely speaks. His first line was \"bloody pedestrians\" said to Den Watts. He is the longest-serving male extra and second longest-serving extra, behind Jane Slaughter's Tracey. Browne has worked as a secretary at Aircraft Management Support Limited in Exeter, Devon since 2 October 1992. Browne has appeared in four Children in Need television spin-offs from EastEnders; Pudding Lane on 26 November 1999, What Not To Wear with Trinny Woodall and Susannah Constantine on 19 November 2004, Motown Tribute on 20 November 2009, and EastEnd Meets WestEnd on 17 November 2017. Browne appeared in two 1988 episodes of the BBC children's television drama series Grange Hill; he was credited as House DJ on 15 January and as Hip Hop DJ on 12 February. He appeared in three episodes of the ITV police procedural series The Bill; he was credited as Benny Hughes on 5 October 1987, Seed on 31 January 1989 and Chas Hendrie on 31 July 2003. Browne made his film debut on 7 March 2004, as Tiko in the action thriller film The Quiet Storm. Browne has performed in panto. == Personal life == Browne is married to Debs. == Filmography == === As an actor === Year Title Role Notes Ref. 1985–present EastEnders Winston 1190 episodes 1985 Black Silk Julio 1 episode 1988 Gems Driver 1 episode 1988 Grange Hill House DJ, Hip Hop DJ 2 episodes 1989 Screen One Marcus 1 episode 1987; 1989; 2003 The Bill Benny Hughes, Seed, Chas Hendrie 3 episodes 1999 Pudding Lane Winston Children in Need spin-off 2004 The Quiet Storm Tiko 2004 What Not To Wear Winston Children in Need spin-off 2009 Motown Tribute Winston Children in Need spin-off 2017 EastEnd Meets WestEnd Winston Children in Need spin-off === As himself === Year Show Notes Ref. 2021 The Big Breakfast 1 episode == References == Category:1957 births Category:Living people",
 "title": "Ulric Browne"
}