{
 "id": "1083241",
 "text": "Bestune is a Chinese manufacturer of passenger cars and SUVs based in Changchun, operating since 2018. It belongs to the Chinese concern FAW Group. == History == === FAW Besturn model line === In 2006, the Chinese automotive concern FAW Group created a new model line FAW Besturn, targeting upper- middle-class customers. The first model to join the sub-brand was the mid-size limousine Besturn B70, which gained great popularity among customers in the Chinese market. The market success of the first model from the Besturn model line encouraged FAW to expand its offer with further models, including both sedans positioned below B70, as well as above his, as well as the first SUV in the form of the X80 model presented in 2013. The next and last premiere in the FAW Besturn model line was the small crossover X40, which hit the market in 2017. Despite the expansion of the range, the popularity of the Besturn series models did not meet the expected goals of the FAW Group concern and began to decline. === Brand Bestune === At the end of 2018, a decision was made to liquidate the Besturn model line under the FAW brand, creating a completely new brand Bestune. The manufacturer gave it its own logo, as well as a new stylistic language and a different naming order. The first model of the Bestune brand was presented in the fall of 2018 SUV T77 developed in partnership with the electronics giant Xiaomi, and in the following years, the offer was expanded to include further SUVs under the name T33, T55 and T99. In 2020, the range was completed by the B70 limousine being a continuation of the model from the former FAW Besturn B70 line, as well as the first electric car in the form of crossover E01. In 2021, the manufacturer expanded its presence in the range of electric cars with another vehicle - minivana E05, later renamed Bestune NAT. 2022 brought the presentation of a fastback based on the B70 as a response to models such as Citroën C5X or Ford Evos in the form of Bestune B70S. At the end of 2022, Bestune rebranded, presenting a new company logo and a refreshed stylistic language of its models. The first vehicles covered by the new tactics were the modernized T77 and T99 SUVs. The third model from the revised range is a new design and the first premiere of 2023, a large minivan M9 developed together with the sister brand Hongqi. After the pre-production presentation of a family of personalized prototypes in April 2023, the market debut of the production Bestune Pony took place in August of the same year. The electric microcar was created as a response to, among others, Wuling Hongguang Mini EV. ==Products== === Current models === * Bestune M9 (2023-present), MPV * Bestune B70 (2006-present), midsize sedan * Bestune B70S (2022-present), compact SUV * Bestune T99 (2019-present), midsize SUV * Bestune T90 (2023-present), midsize SUV * Bestune T77 (2018-present), compact SUV * Bestune T55 (2021-present), compact SUV * Bestune E01 (2021-present), electric compact SUV * Bestune NAT (E05) (2021-present), electric MPV * Bestune Pony (2023-present), city car File:Bestune M9 001.jpg|Bestune M9 File:Bestune B70 III 005.jpg|Bestune B70 File:Bestune B70S img01.jpg|Bestune B70S File:Bestune T99 facelift IMG003.jpg|Bestune T99 File:Bestune T90 001.jpg|Bestune T90 File:Bestune T77 012.jpg|Bestune T77 File:Bestune T55 img04.jpg|Bestune T55 File:Bestune E01 img02.jpg|Bestune E01 File:Bestune E05 by FAW (front).jpg|Bestune NAT File:Bestune Pony 001.jpg|Bestune Pony === Discontinued models === * Bestune B50 (2009-2019), compact sedan * Bestune B90 (2012-2017), mid-size sedan * Bestune B30 (2015-2020), subcompact sedan * Bestune X80 (2013-2020), compact SUV * Bestune X40 (2016-2019), subcompact SUV * Bestune T33 (2019-2022), subcompact SUV File:Besturn B30 3 China 2016-04-07.jpg|Bestune B30 File:Besturn B50 II 03.jpg|Bestune B50 File:Besturn B90 China 2016-04-08.jpg|Bestune B90 File:Besturn X40 Shishi 01 2022-04-26.jpg|Bestune X40 File:Besturn X80 facelift 01 China 2017-03-25.jpg|Bestune X80 File:Bestune T33 img06.jpg|Bestune T33 ==Sales== Below are tables showing sales of Bestune models from the last couple of years. NAT Year Sales 2021 9,118 2022 19,111 T99 Year Sales 2019 3,956 2020 13,054 2021 6,268 2022 2,184 T77 Year Sales 2018 10,757 2019 45,908 2020 28,344 2021 14,300 2022 10,247 T33 Year Sales 2019 4,999 2020 3,812 2021 7,860 ==References== ==Other websites== * Official site * Official site Category:Automobile companies of China",
 "title": "Bestune"
}