{
 "id": "1083472",
 "text": "Mount ad-Dahi () is a historic mountain in Palestine, located south of Nazareth, three kilometers east of Afula . It was named after the village of Ad-Dah, which contains the tomb of the companion Dahiya Al-Kulayni. mountains of historic Palestine and is located south of Nazareth, three kilometers east of Afula . It was named after the village of Ad-Dah, which contains the tomb of the companion Dahiya Al-Kulayni . The hill of Dahi is 550 metres high.https://scholar.najah.edu/sites/default/files/all-thesis/endowments_district_of_nazareth_during_the_british_mandate_1922-1948_documentary_study.pdf T The mountain mass forms a watershed between the Galood River / Jalud River in the south and The Tabor Valley in the north. جالود (نهر) | الموسوعة الفلسطينية جالود (نهر) | الموسوعة الفلسطينية ملف pdf \" المناطق الجبلية في فلسطين \" موقع الجامعة الإسلامية بغزة الالكتروني The mountain mass forms a watershed between the Galood River in the south and the Taboor valley in the north.جالود (نهر) | الموسوعة الفلسطينية ملف pdf \" المناطق الجبلية في فلسطين \" موقع الجامعة الإسلامية بغزة الالكتروني The Jabal Ad-Dhi massif forms a water dividing line between the Jalud River in the south and The Tabor Valley in the north. جالود (نهر) | الموسوعة الفلسطينية ملف pdf \" المناطق الجبلية في فلسطين \" موقع الجامعة الإسلامية بغزة الالكتروني جالود (نهر) | الموسوعة الفلسطينية Mount Ad-Dhi is one of the mountains of historic Palestine and is located south of Nazareth, three kilometers east of Afula . It was named after the village of Ad-Dah, which contains the tomb of the companion Dahiya Al-Kulayni . The height of Mount Ad-Dah is 550 meters and is also known as “Little Hermon.” The total land of the mountain ranges between (6000-8000) dunams,https://scholar.najah.edu/sites/default/files/all-thesis/endowments_district_of_nazareth_during_the_british_mandate_1922-1948_documentary_study.pdf and the Canaanites mentioned it as “Mount Mi’sar.” == References == Category:Mountains of Palestine Category:Levant",
 "title": "Mount ad-Dahi"
}