{
 "id": "1083188",
 "text": "Gabriela Roberta Rodríguez de Bukele ( Rodríguez Perezalonso; 31 March 1985) is a Salvadoran educator and prenatal psychologist serving as the First Lady of El Salvador since 2019 as the wife of the 43rd President of El Salvador Nayib Bukele. She is also a professional ballet dancer and is part of the dance company Fundación Ballet de El Salvador. Rodríguez was born in San Salvador. She holds a doctorate in prenatal psychology and founded PrePare, the first center for prenatal teaching in El Salvador, in October 2010. She married Bukele in 2014 and served as Secretary for Women during his tenure as Mayor of San Salvador (2015–2018), when she helped to create projects supporting women's rights and culture. Rodríguez founded the San Salvador Ballet group during her time as a Secretary for Women in San Salvador. == Early life == Gabriela Roberta Rodríguez Perezalonso was born on 31 March 1985 in San Salvador, the capital of El Salvador. She is the youngest of four daughters and her husband has claimed she has Sephardic Jewish ancestry. Her father is José Roberto Rodríguez Trabanino, a Salvadoran investor, while her mother, Arena Perezalonso de Rodríguez, is a Nicaraguan who served as a member of the Chamber of Commerce and Industry in El Salvador. She showed an interest in ballet at an early age and joined the dance company Fundación Ballet de El Salvador. == Career == Rodríguez holds a doctorate in prenatal psychology, and is the first person in El Salvador with that title. She founded PrePare in October 2010, the country's first center of prenatal teaching, of which she is the director. Rodríguez is also the regional representative to the Association For Prenatal And Perinatal Psychology And Health (APPPAH). == Personal life == Rodríguez is a professional ballet dancer and part of the dance company Fundación Ballet of El Salvador. She began dating Bukele in 2004 and they married on 6 December 2014 in a private ceremony in El Boquerón, San Salvador. She announced her pregnancy days before Bukele won the presidential elections. Their child was born in August 2019. The couple's second child was born in November 2023. == References == Category:1985 births Category:Living people Category:Psychologists Category:First Ladies Category:Salvadoran people Category:Teachers",
 "title": "Gabriela Rodríguez de Bukele"
}