{
 "id": "1083386",
 "text": "The Payung dance (Jawi: تاري ڤايوڠ) is a traditional dance of the Minangkabau and Malay people from Sumatra, Indonesia. It is similar to other dances from Sumatra but with a Minangkabau touch. In this dance, dancers use umbrellas called \"payung.\" It is usually done by three or four dancers and shows the love and connections between young people. The dance comes from the Western Sumatra region of Indonesia. People perform the Payung dance during different events like shows, exhibitions, parties, and weddings. It is a important part of Minangkabau culture. Men use umbrellas while women use shawls in the dance. The umbrella represents protection, showing how men protect their families. Women's shawls symbolize love and loyalty in marriage. This is shown when the woman's shawl is placed on the man's shoulder. == Name == In the Indonesian and Minangkabau languages, \"payung\" or \"payuang\" means \"umbrella\" or \"parasol.\" This word comes from old Sundanese. The dance is called Payung dance because it uses umbrellas as the main props. The umbrellas represent safety and protection in marriage. == History == The umbrella dance is a big part of the Minangkabau tribe's culture. It is mostly done by young Minangkabau people. But it's more than just entertainment. It also shows how couples should act in a loving relationship, following Islamic religious and traditional Minangkabau rules. Long ago, during the time when the Dutch were ruling Sumatra, there were plays that people watched for fun. These plays sometimes included the umbrella dance. At first, the umbrella dance was just something extra in the plays, mainly for fun. But in the 1920s, it became really popular, and people liked it a lot. In the 1960s, the umbrella dance was one of the most liked dances among the Minangkabau people. Some of them had never seen a Minangkabau dance before watching the umbrella dance. It often showed up in dance shows, either by itself or with other dances. In the 2000s, a dancer and teacher named Syofiyani Yusaf from Bukittinggi worked on it and improved it, keeping its Minangkabau style but making it easier for anyone to learn. Today, umbrella dance is performed at a lot of events, both in and outside of West Sumatra. Many students, from elementary to high school, learn the umbrella dance. They join art clubs in different places in West Sumatra. Some schools, like Vocational High School 7 Padang and the Padangpanjang Indonesian Arts Institute, even teach the umbrella dance as part of their classes. == Dress == In Payung dance, female dancers wear traditional Malay clothes like kebaya tops, songket bottoms, hair in a bun, and a low, golden crown-like headdress called \"suntiang.\" Male dancers wear long-sleeved shirts called \"bay belanga\" with a \"cekak musang\" collar, matching trousers, a side cloth made from songket, and a typical Minang head covering or black kopiah (peci). == References == Category:Dances of Indonesia",
 "title": "Payung dance"
}