{
 "id": "1083691",
 "text": "Nihang are mythical water dragons from the Chitrali Mythology in northwestern Pakistan. The name \"Nihang\" comes from the Persian word \"nahang\" for crocodiles but is also used for other sea creatures. Nihangs looked like winged snakes, also found in myths in many parts of mainland Pakistan and East Asia. They were huge, scaly creatures and were famous for their golden manes. The most famous one lived in a lake in Mastuj area of Chitral and frightened the local people. However, its reign of terror ended when an ancient warrior fought against it using a double-hilted sword and killed it. The Chitrali dragon has similarities to both Eastern and Western dragons. It looks like East Asian dragons with its thick furlike mane, lives in water, and has a long, slender, serpent-like body. But unlike Eastern dragons, the Chitrali dragon is seen as a mean creature that spreads fear in its area. People living near lakes have long believed in creatures like this in the Hindu Kush mountains. Even a Chinese traveler from the 7th century, Xuanzang, mentioned a dragon living in a lake in the region. While the exact lake he talked about isn't known, some believe it could be Lake Dufferin on the border of Chitral. == Mythology == Stories about dragons were common in Chitrali stories. Dragons could be seen as powerful and noble, but also scary. Some lived in water like the Nihang, while others lived on land. These dragons were called \"Azhdaar\". The Chitrali dragon was a mix of the Iranian and Chinese dragons. It was big, had wings, looked like a serpent (similar to chinese dragons), and had a golden mane like a lion. It could swallow people and breathe fire. Old warriors said you could fight back by holding your sword above your head and cutting the dragon's mouth. Dragons were often linked with treasure. Even in the 1980s, people talked about a dragon guarding treasure in a valley near Chitral Town. == Nihang of Matuj == The small town of Mastuj in Chitral was once an important place, serving as the capital of a small hilly kingdom. There used to be a big lake below the town where a huge dragon (Nihang) lived. This dragon would eat anything that moved, including fish and animals. Over time, it even started attacking people passing by. The locals, worried about their safety, asked their king for help. The king, after talking with his advisers, announced a reward for anyone brave enough to kill the dragon. A courageous man stepped forward and said he would do it. He got a special sword made, poisoned its edge, and set out on his dangerous journey. When he reached the lake, he got off his horse, took out his sword, and approached the edge of the lake. As the dragon saw him, it tried to swallow him. But the sharp sword quickly sliced the dragon's jaws, and the poison killed him. The brave man took one of the dragon's golden manes (long hair on the neck like a lion) and went back to the king's palace. He was happily welcomed, given a big feast, and praised by everyone. The king rewarded him with money and land. The people of Mastuj loved and admired him. His story spread far and wide, and even today, people remember him. Though the lake is gone, the place is still called Nahangu Chhat, which means \"The Dragon’s Lake\" in the Khowar language. == References == Category:Pakistani mythology Category:Pakistani folklore",
 "title": "Nihang"
}