{
 "id": "1083256",
 "text": "Gandrung (Javanese: ꦒꦤ꧀ꦝꦿꦸꦁ) is a traditional dance from Indonesia. It is popular in Bali, Lombok, and Eastern Java among the Sasak, and Javanese people. The most famous is from Banyuwangi in Eastern Java, where the city is sometimes called \"the city of gandrung\". Originally, it was a dance for the rice goddess, but now it is more of a cultural dance than religious since the Javanese and Sasak people became Muslims in the 16th century. Nowadays, Gandrung is danced at social events or for tourists. During the dance, traditional music is played, similar to the gamelan (Orchestra), with instruments like violins, gendangs, bonang, gongs, and xylophones. A singer usually sings with the music. == Name == Gandrung comes from the Javanese word for \"love\". It is believed the dance began as a way to show love for the rice goddess Dewi Sri and as a fertility dance. But now, especially among Muslim Javanese and Sasak, it is more of a social and cultural dance. The dance is now about a girl searching for love, and is no longer for the rice goddess. == Dance == Gandrung is often danced all night from around 9 p.m. until just before sunrise. Sometimes, it's performed for tourists in Bali or Grajagan Bay in Banyuwangi. People also dance it at special events like weddings or circumcisions. The main dancer, called the gandrung, is usually a young unmarried girl or sometimes a boy dressed as a girl. They wear traditional clothes with a fan, shawl, and fancy headgear. Sometimes, there's more than one gandrung dancer. At the start, the dancers are on the side of the stage with the music group. When the music begins, they dance to the center. If a dancer sees someone in the audience they want to dance with, they throw their shawl to them, inviting them onstage. Then, they dance together. After dancing, the audience member often gives a small amount of money. Gandrung is also a way for boys and girls in central and eastern Lombok to show affection. They dance it outside in a circle. Similar dances are seen in other parts of Indonesia like ronggeng, tayuban, jaipongan, and joged. == Music == Gandrung is danced to music played by a traditional group. This group usually has violins, drums, gongs, and xylophones. A singer sings during the dance. Also, every performance needs a panjak, also known as a pengudang or encourager. Their job is to cheer on the dancers and add some fun to the show. Sometimes, the kluncing player takes on this role. Different places have their own bands for the dance, like in Banyuwangi, Bali, and Lombok. The music might vary a bit depending on where it's played. People say the music is lively and natural. Many anthropologists have recorded the Gandrung music. == References == Category:Dances of Indonesia",
 "title": "Gandrung"
}