{
 "id": "1083943",
 "text": "Emmanuel Amunike (born 25 December 1970) is a Nigerian professional football manager and former professional football player who played as a winger. Blessed with electric pace and a wand of a left foot, Amuneke was also a quite prolific scorer, A strong, powerful frame and high centre of gravity lent itself to explosiveness and tenacity, while his diagonal runs off the flank made him a proper goal threat. He is widely regarded to be one of Nigeria's best wingers of all time. ==Club career== Amuneke started his career in 1987 with the Concord FC under former Super Eagles international Oscar Ezinwa, under whom he later also played at his youth academy Divine Royal International Football Academy. In his early career, Amuneke won league titles in Nigeria and Egypt. After the 1994 World Cup, he, who was still under contract with Zamalek Cairo at the time, signed a contract with MSV Duisburg and was introduced to the public. However, Amuneke did not appear in Duisburg at the start of training. Those responsible found out too late that he had already signed a contract with Sporting Lisbon. FIFA initially declared the first contract with MSV legal. But since Amuneke emphasized that he never wanted to play in Duisburg, FIFA also made a U-turn. MSV Duisburg had to sell Amuneke to Sporting Lisbon for one million dollars. There he became famous after scoring a winning goal against arch-rivals Benfica Lisbon. In 1996 he received the title of BBC African Footballer of the Year. He was poached by Spanish giants FC Barcelona for the equivalent of 3.6 million during the 1996/97 season and played the rest of the season before becoming a substitute due to injuries. Knee problems also kept him out of the 1998 World Cup. Amuneke never fully recovered and ended his career after playing one final season in Jordan in 2004. ==International career== Amunike made his international debut in 1993, He played many international games for the Nigerian National Football Team, and was part of the team that played in the 1994 World Cup in the United States and won the African Cup of Nations in 1994. Due to these two competitions he also won the Best African Player award in 1994. He also helped win the football gold medal at the 1996 Summer Olympics in Atlanta, eventually scoring in the final against Argentina. Amunike was probably the most outstanding player in the US Cup and the African Cup of Nations, when he scored twice in the final that won him the African title, and in the goal that almost eliminated Italy in the second phase of the competition. A knee injury ruled him out of the World Cup in France. Without being fully recovered, even with Nigeria qualified for the 2002 FIFA World Cup, Ammunike ended his career with the Super-Eagles in 2001. ==Coaching career== Amunike coached Nigeria's under-17 football team that won the World Cup in 2015. On 6 August 2018, he was appointed coach of the Tanzania national football team. He managed to qualify for the 2019 Africa Cup of Nations, but resigned from coaching the team after losing all three matches. In November 2019, he said he was looking for a new job. ==Honours== ===Player=== Julius Berger FC Nigeria Professional Football League: 1991 Zamalek *Egyptian Premier League: 1991–92, 1992–93 *African Cup of Champions Clubs: 1993 *CAF Super Cup: 1994 Sporting CP *Taça de Portugal: 1994–95 *Supertaça Cândido de Oliveira: 1995 Barcelona *Copa del Rey: 1996–971997–98 *UEFA Cup Winners' Cup: 1996–97 * La Liga: 1997–98, 1998–99 * UEFA Super Cup: 1997 * Supercopa de España: 1997; runner-up Nigeria *Africa Cup of Nations: 1994; runner-up: 2000 *Olympic Games: 1996 Individual *African Footballer of the Year: 1994 *BBC African Footballer of the Year: 1996 ===Manager=== Nigeria U17 *FIFA U-17 World Cup: 2015 == References == Category:1970 births Category:Living people Category:Nigerian footballers Category:Nigerian football managers Category:FC Barcelona players Category:Olympic gold medalists for Nigeria Category:Footballers at the 1996 Summer Olympics Category:1994 FIFA World Cup players Category:1995 King Fahd Cup players Category:Medalists at the 1996 Summer Olympics Category:Olympic medalists in football",
 "title": "Emmanuel Amunike"
}