{
 "id": "1083866",
 "text": "The Songkok, also called Peci or Kopiah, is a hat worn by men in many Southeast Asian countries like Brunei, Indonesia, Malaysia, Singapore, southern Philippines, and southern Thailand. It looks like a cone and is often made of black or fancy felt, cotton, or velvet. People wear it on special times like weddings, funerals, and holidays such as Christmas and Easter. In Indonesia, it is also linked to the nationalist movement. In Sumatra and the Malay Peninsula, it is called \"songkok\", while in Java, it is called \"kopiah\" or \"kopeah\". In Indonesia, it is usually called \"peci\", though the peci might be a bit different, being more oval-shaped and sometimes decorated. == History == The kopiah has been around for a long time. It was worn by special Majapahit soldiers in the past. The mention of kopiah goes back to the 16th century and was mentioned in Pigafetta's Italian-Malay vocabulary. In the epic Hikayat Iskandar Zulkarnain, written before 1600 AD, there's a part where someone wears a golden rosary kopiah.Hussain, Khalid Muhammad, ed. (1986). Hikayat Iskandar Zulkarnain (2nd ed.). Kuala Lumpur: Dewan Bahasa. Historians think the songkok became popular in the 13th century when Islam spread in the area. But the first written record of the word \"songkok\" is in Syair Siti Zubaidah from 1840. Traditionally, the special triangular Malay headgear, Tengkolok or destar, was worn by important people like nobles and kings. But the songkok later became connected with Islam, especially for Malay men. The Royal Malay Regiment of the Malaysian Army has been wearing the songkok as part of their uniform since the time of British rule. === Current use === The songkok is worn by Muslim men for important events. In Indonesia, it became important because of a leader named Sukarno. He and other leaders like Mohammad Hatta and Agus Salim made the peci, another name for the songkok, popular. Sukarno even made the plain black velvet peci the official hat of Indonesia. In Indonesia, presidents and palace guards wear the peci as part of their uniform. During the Indonesian Independence Day ceremony, a special group called Paskibraka wear it too. Some women wear a different kind of peci with a curved back.In Malaysia, men wear the songkok along with a shirt, pants, and waist wrap called baju melayu as their traditional dress. During meetings of the legislative assembly, all members wear the songkok with a gold stripe to show respect to the Head of State. In Singapore, the songkok is not allowed in government schools because of the country's secular rules, but it's part of the uniform in Singaporean Islamic schools. In the Philippines, the songkok, known as kopiah or kupya, is worn by Bangsamoro men and Muslim Filipinos. Some non-Muslim Lumad datu also wear the kopiah for prayers and social events. == References == Category:Brunei Category:Indonesian culture Category:Malaysian culture Category:Singaporean culture Category:Thai culture Category:Filipino culture",
 "title": "Songkok"
}