{
 "id": "1083228",
 "text": "Everus is a Chinese manufacturer of passenger cars, and then electric crossovers based in Guangzhou, operating since 2008. The brand belongs to a Sino-Japanese joint venture between GAC Group and Honda. == History == In 2008, joint venture Guangqi Honda between the Chinese car company GAC Group and the Japanese Honda decided to create a new brand, Everus, with the Chinese. The study announcement of the branch's first vehicle was the Li Nian Concept prototype in the form of a crossover presented in 2008 at the Guangzhou Auto Show, and two years later a second concept car was presented in the form of a 4-door sedan. In April 2011, Everus presented the first production car in the form of urban sedan S1 developed as a twin to the Honda City. The model was sold exclusively on the Chinese market until 2014, after which the company temporarily disappeared from the market due to the lack of new products. The announcement of Everus' return to the market, this time under a completely new form of the electric cars brand, was the Everus EV Concept study presented in April 2018 at the Beijing Auto Show. In November of the same year, a serial version of the model was presented, which was a twin design of Honda HR-V called Everus VE-1. ==Products== ===Everus S1=== The S1 was the first concept car available for sale. It is a replica of the 4th generation Honda City sedan, which was launched in April 2011. ===Everus VE-1=== This is an ultra-compact electric CUV based on Honda Vezel, which was previously previewed as the Everus EV concept car.The car was jointly developed by Honda and GAC Honda. It is equipped with a 53.6 kilowatt-hour lithium-ion battery (NCM622) in the European new driving cycle, with a cruising range of . It is driven by an electric motor with a power of , the torque is . ==New Concept Car== The EV SUV concept car made its debut at the 2018 Beijing Auto Show.Everus EV Concept: A Look Into Honda’s EV Future ==References== Category:Automobile companies of China",
 "title": "Everus"
}