{
 "id": "1083142",
 "text": "The Sky Fox (Chinese: 天狐) or the Celestial Fox, is a divine creature found in East Asian stories. When a fox spirit reaches 1,000 years old and grows its ninth tail, it becomes a golden-colored sky fox, the most powerful form of the fox spirit, and goes up to the heavens. In its celestial form, it can see thousands of kilometers ahead. Legend says there are three ways for a fox to gain wisdom. First, it might accidentally swallow valuable treasures. Second, it could find a peaceful place to grow spiritually. Third, it could learn from a Taoist monk or master to develop special abilities. == Mythology == The stories of foxes with many tails come from ancient China. A book called Xuanzhongji from the Jin dynasty tells that when a fox turns fifty, it can change into a woman. At one hundred years old, it can become very wise and know things happening far away. People might get confused by its kindness and charm. When it reaches one thousand years old, it becomes a Sky Fox. There are three ways for a fox to become wise. First, it might accidentally swallow valuable treasures. Second, it could find a peaceful place to grow spiritually. Third, it could learn from a Taoist monk or master. Every one hundred years, a big event happens. If a fox can handle it well, it grows a new tail. Only a few foxes reach the stage of having nine tails. When a fox is one thousand years old, it becomes a Thousand-Year Heavenly Fox and gets recognized by the Heavenly Court. The Youyang Zazu talked about the Sky foxes being connected to the divine; he says that these foxes have nine tails and are golden in color. They work in the Palace of the Sun and Moon. They have their own special talisman and a ritual. They can go beyond yin and yang. In Japan during the Edo period, Tenko foxes were thought to be the highest rank. They were ranked as tenko, kūko, kiko, and yako. There was also a belief that tenko and tengu, a kind of mythical creature, were the same. In some places like Fushimi Inari-taisha and Ojika, Nagasaki, foxes are worshipped as divine messengers. They are believed to have special powers, like divination. == Related pages == * Wuzhiqi * Simurgh * Phoenix == References == Category:Chinese mythology Category:Japanese mythology",
 "title": "Sky Fox"
}