{
 "id": "1083176",
 "text": "Dabke (Arabic: دبكة) is a traditional folk dance in the Middle East. It started in the Levantine region that includes Palestine, Lebanon, Jordan, Saudi Arabia and Syria. The word \"Dabke\" comes from the Levantine Arabic word \"dabka\", which means \"punching of the feet\" or \"to make a noise\". It involves repeated pattern of movement or sound. It is performed in a group by men or women, mostly at weddings, celebrations, and cultural events. Dabke is a important part of the cultural heritage of these countries. Cultural heritage festival is a celebration where people come together to show and celebrate their History and action or way of behaving that is common among them. It brings people together and make them enjoy their shared identity and joy. ==History== Dabke dance has a old history that dates back centuries in the Levantine region of the Middle East, especially in countries such as Palestine, Lebanon, Jordan, and Syria. It started as a traditional folk dance among group of people living in these mountainous areas. Palestinians who study and document traditional ways of celebrations like Abdul-Latif Barghouthi and Awwad Sa'ud al-'Awwad believe that the jumps in dabke dance might have started long ago in ancient Canaanite rituals. These rituals were about helping the crops to grow, scaring away the bad spirits, and keeping the plants safe. ==Variations== The dance involves rhythmic stomping of the feet (to walk with heavy steps), organised movements, and energetic footwork. It has both the circle dance and line dancing. Dabke is mostly performed along with traditional music, including drums, flutes, and other instruments. The movements of the line are led by a laweeh. Laweeh is a dancer who stand in the front and starts the changes in line formation. He is then followed by a group of singers. Dabke is performed indoors as well as outdoors, on a stage or sometimes just on the ground. The dance has different steps called belbel, inzel, shemmel, etc. People do a mix of these steps, along with some jumps and turns, to complete the dance. Different types of dabke can be found across different regions and communities. In Lebanon, Dalouna is the most common type of dabke. It has six beats and is usually joined by a minjeira (flute) or mizmar (copper flute) and darbuka (goblet drum). Jordanian dabke often features slower, more calculated movements, reflecting the country's Bedouin history. Despite these differences, dabke is a cultural symbol and popular practice that unites people who have grown up in the Levant. ==World records== On 7 August 2011, a group in the Lebanese village of Dhour El Choueir set a new world record. Organized by the Dhour El Choueir Summer Festival, a human chain of 5,050 was made and currently holds the world record in the Guinness Book of World Records. ==References== ==Other websites== * Palestinian Dabkeh performed in London Category:Folk dance",
 "title": "Dabke"
}