{
 "id": "1083304",
 "text": "Duck and Cover is a United States civil defense movie for children from 1951. Like civil defense training movies for adults, this movie was prepared for children and was widely shown to United States school children in the 1950s. It teaches students what to do in the event of a nuclear explosion. The movie shows an animated tortoise named Bert the Turtle and schoolchildren who show how to protect oneself from a nuclear explosion by using the duck and cover position.Librarian of Congress Adds 25 Films to National Film Registry – United States Library of Congress, 28 December 2004. At the time, there was a Cold War between the Soviet Union and the United States, and their relations were bad. This fear, mistrust and perceived threat between the two countries, led to an arms race with more modern weapons, and especially to a nuclear arms race with nuclear weapons, which they often tested. This led to a fear of World War III, which could be a nuclear war. The United States was also fighting the Soviet Union's allies North Korea and China in the Korean War. The Cold War also led to the Second Red Scare in the United States. The movie was funded by the United States Federal Civil Defense Administration, was filmed in 1951 and was released in January 1952. The movie was written by Raymond J. Mauer, directed by Anthony Rizzo of Archer Productions, narrated by actor Robert Middleton and made with the help of schoolchildren from New York City and Astoria, New York. The movie is in the public domain and is widely available on the Internet, on websites such as YouTube. The movie is also available on DVD. In 2004, the movie was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\" ==References== ==Other websites== * *Duck and Cover at the TCM Movie Database Category:American documentary movies Category:1951 movies Category:Nuclear weapons Category:Cold War",
 "title": "Duck and Cover (movie)"
}