{
 "id": "1084442",
 "text": "The jihadist flag is a flag used commonly by Islamist movements as a symbol of jihad. The jihadist flag usually is the Black Standard with writing of the Shahada in a calligraphy style. The flag was adopted by Islamist and Jihadist movements in the 1990s to early 2000s. Groups that have used a flag similar to the jihadist flag are: * al-Qaeda * Daesh * Al-Shabaab * Ahrar al-Sham * Chechen Mujhaideen * Hizbul Islam * Taliban which uses a inverted version * Palestinian Islamic Jihad == Daesh variant == The version used by Daesh depicts the second part of the shahada using the historical seal of Muhammad.The SITE (Search for International Terrorist Entities) website on 23 January 2007 stated: \"The Islamic State of Iraq issued a document titled: 'The Legality of the Flag in Islam,' which contains the image of its flag and information to its symbolism, today, Tuesday, January 23, 2007. Text on the flag reading, 'No God, but Allah, and Muhammad is Allah's Messenger,' are the words contained on the flag of the Prophet Muhammad that he carried into battle and handed to generations of bearers. The Islamic State provides evidence and legitimacy for this banner from Islamic scholars, and goes into detail regarding opinions of the flag's material, title, and significance. According to the group the circular shape matches the ring stamp of the Prophet found on many scripts, and the order of the words are to indicate the supremacy of Allah over the Messenger.\" Cited by Ivan Sache at Flags of the World on 18 February 2007. In 2014, the former British Prime Minister David Cameron said that anybody showing the flag of Daesh in the UK should be arrested per the Terrorism Act 2000.The SITE (Search for International Terrorist Entities) website on 23 January 2007 stated: \"The Islamic State of Iraq issued a document titled: 'The Legality of the Flag in Islam,' which contains the image of its flag and information to its symbolism, today, Tuesday, January 23, 2007. Text on the flag reading, 'No God, but Allah, and Muhammad is Allah's Messenger,' are the words contained on the flag of the Prophet Muhammad that he carried into battle and handed to generations of bearers. The Islamic State provides evidence and legitimacy for this banner from Islamic scholars, and goes into detail regarding opinions of the flag's material, title, and significance. According to the group the circular shape matches the ring stamp of the Prophet found on many scripts, and the order of the words are to indicate the supremacy of Allah over the Messenger.\" Cited by Ivan Sache at Flags of the World on 18 February 2007. The flag has also been banned from being used in the Netherlands since August of 2014. The use of the Daesh flag is banned in Germany for non-educational purposes has been illegal in Germany since September of 2014. Austria proposed a similar ban in the same month after Germany banned the flag of Daesh. == References == Category:Islamic terminology Category:Islamism Category:Historical flags Category:Censorship Category:Germany",
 "title": "Jihadist flag"
}