{
 "id": "1084064",
 "text": "Singkil (Jawi: سيڠكيل) is a folk dance from the Philippines. It comes from the Maranao Muslim people who live near Lake Lanao in Mindanao. It's called the royal dance because it's like a dance for a prince and princess. They move gracefully between bamboo poles that people clap together to make music. The man usually holds a sword and shield, while the woman twirls fans in a beautiful way.Namiki, K. (2016). Dancing in the margins: The politics of national and local identity among the Maranao and Kalinga in the Philippines (Thesis). Singapore: National University of Singapore. This dance gets its name from the bells on the ankles of the Maranao princess called \"Singkil\". It's always performed with a special kind of music played on kulintang and agung instruments. Singkil has changed over time, especially when the Bayanihan folk dance group added parts of the Darangen epic story, like the tale of Prince Bantugan and Princess Gandingan.Namiki, Kanami (2011). \"Hybridity and national identity: Different perspectives of two national folk dance companies in the Philippines\". SPECIAL ISSUE: Cultural Hybridities of the Philippines. == History == Singkil's beginnings are uncertain, but it's a newer tradition among the Maranao people. Some say it started in Basak and spread to other villages in the 1930s, while others believe it came to Lanao from Cotabato. It's thought to have begun when folk dancing was introduced in Lanao's schools in the early 1900s. Henrietta Hofer-Ele was one of the first to study the dance, which she saw in Marawi. With the help of Princess Tarhata Alonto-Lucman, she learned the dance's movements involving fans. Later, the Bayanihan Philippine National Folk Dance Company performed it as a special dance. == Story == The singkil is one of the most popular dances in the Philippines. It involves bamboo poles and fast footwork. It tells a story about a princess lost in a stormy forest and the prince who rescues her. A woman wears a colorful gown and acts as the princess. She holds two fans and wears ankle bells called singkil, which gives the dance its name. Servants dance around her and hold a umbrella to protect her. The storm begins with four men acting as angry monkeys, banging bamboo poles on the floor. The princess and her servants dance between the poles without touching them. The storm gets worse, and the bamboo poles move faster, making it hard to hear the singkil bells. The dance ends when the prince scares away the storm. == Bayanihan Dance Company == The Bayanihan Philippine National Folk Dance Company of the Philippine Women's University expanded Singkil with more characters, like warriors and a prince. They included parts of the Darangen epic, where Prince Bantugan saves Princess Gandingan during an earthquake. In the dance, the lead female dancer represents Princess Gandingan, showing a story from the Darangen epic. She dances alone between bamboo poles while others use fans and play the role of Prince Bantugan. Some writers criticized Bayanihan's performance, saying it didn't match Maranao traditions, especially by calling it a royal dance. Bayanihan has since made changes, describing their dance as inspired by the Maranao epic Darangen. They have since followed Maranao Islamic custom more closely, such as male dancers wear long-sleeved garments. == References == Category:Filipino culture Category:Maranao",
 "title": "Singkil"
}