{
 "id": "1084627",
 "text": "Resonance is a positive way that people connect with the world, according to Hartmut Rosa, a sociology professor at the University of Jena. He came up with resonance theory in his book Resonanz (2016) to explain how we interact with society and the world around us. To Rosa, it is the opposite of alienation. == Background == Rosa talked about why modern society has so many problems in his book about Social Acceleration. In Social Acceleration, he said that modern life, with its rush and pressure to keep up, is causing problems like work burnout, damage to the planet, and people feeling disconnected and tired. He describes how this problem especially became an issue when people started to get more work due to the industrial revolution. Resonance theory suggests solutions to these problems by saying how it would feel to be more connected to the world, rather than alienated all the time. According to Rosa, resonance is when we feel deeply connected to the world around us, which can change us emotionally and mentally for the better. == Definition == Rosa describes resonance as a special way we relate to the world, based on our feelings, interests, and belief in our own ability to make a difference within it. It's when we and the world around us affect each other and change together. This can only happen when we care deeply about something. Resonant relationships need both sides of the thing in the world (a person, an object, an idea) to be ready, allowing them to communicate with each other effectively. It does not always mean a feeling of happiness. Resonance can happen when watching a sad film which you are affected by, but which makes you think deeply about your place in the world. == Resonance Term == Rosa compares resonance to the way two tuning forks vibrate together, each making its own sound when they are hit. When we have resonant experiences, they shape how we see ourselves and our place in the world. Experiences that lack resonance can make us feel disconnected and lonely. Resonance isn't just about feelings. It is also about building meaningful connections with people, things, and ideas, like nature, art, or history. == Examples == Resonance theory looks at how our society changes our ability to connect with the world. Rosa talks about 'social acceleration', where everything moves faster and faster. This constant rush makes it hard for us to make time for meaningful connections. Rosa thinks this is a big problem in modern society. He says it's causing problems with the health of the planet, political issues, and making people feel overwhelmed. Resonance theory is inspired by earlier critical theory scholars, which also looked at how people can feel disconnected from society. But Rosa offers a more positive idea than thinkers like Theodor Adorno. Instead of just focusing on what's wrong with the world, he says how humans sometimes feel connected with the world. Rosa gives four examples of resonance: * Horizontal: happens between two or more people, like in love, family, friendships, or politics. A parent and child might experience resonance if they feel like they are responding to and seeing each other. *Diagonal: how we relate to things and activities in the world, like objects we see, or going to school or playing sports. Feeling connected to everyday things in your house. * Vertical: our connections to big ideas, like nature, art, history, or religion. People who got to see a big historical moment might have felt like they were part of something special and feel connected to that time for the rest of their lives. * Ourselves: how connected we feel to our own body and mind, without feeling alienated. Feeling happy with who you are or feeling in touch with your own body is an example of this. Hartmut Rosa says that lots of adverts by companies promises resonance, but this is a mistake since humans cannot decide when resonance will happen. There are ways to experience less alienation, by slowing down for example, but there are not controlled ways we can get in resonance with something. == References == Category:Sociology",
 "title": "Resonance (sociology)"
}