{
 "id": "1084942",
 "text": "Ethel May Caterham (née Collins; born 21 August 1909) is a British supercentenarian who is the oldest known living person since 30 April 2025. She is also the oldest living person in the United Kingdom and the last surviving subject of Edward VII. She is also the oldest living European following the death of Maria Branyas Morera. == Personal life == Ethel May Caterham was born in Shipton Bellinger, Hampshire on 21 August 1909 as the second-youngest of eight children, and was raised in Tidworth. Her sister, Gladys Babilas (1897–2002), lived to 104. In 1927, when she was 18, she went to British India and worked as an au pair to a military family until she was 21. In 1931, she went back to England and met her future husband Norman Caterham at a party. They later married in Salisbury Cathedral, where Norman had been a choirboy. They lived in Harnham before being stationed in Hong Kong and Gibraltar. While in Hong Kong, Ethel set up a nursery to teach English, crafts and games, and in Gibraltar, the couple had two daughters who they raised back in England. Norman died in 1976. Caterham drove until she was 97 and played contract bridge in her centenarian years. Both of her daughters are now deceased; she had lived in an extension in the home of her second daughter, Anne, until she died of cancer in February 2020, aged 82. Caterham then moved into a care home in Ash Vale, Surrey, and later to care home in Lightwater, Surrey where she presently resides. == Health and longevity == Caterham survived COVID-19 in 2020, aged 110. On her 111th birthday in August 2020, she was visited by the mayor of Surrey Heath, as she had been the oldest living resident of Surrey since January 2019. Shortly before her 111th birthday, she and her granddaughter were interviewed by BBC Radio Surrey, where she said that the secret to her longevity was \"taking everything in my stride, the highs and the lows.\" On 22 January 2022, upon the death of 112-year-old Mary \"Mollie\" Walker MBE, Caterham became the oldest living person in the United Kingdom. On 7 October of the same year, upon the death of 113-year-old Rose Eaton, Caterham became the last Briton born in the 1900s decade and the last surviving subject of Edward VII from any country. She turned 114 in August 2023, the first British resident to do so since Ethel Lang in 2014. As of , Caterham is the oldest living person in the world after the death of the Brazilian Inah Canabarro Lucas and the oldest living European person since the death of Maria Branyas Morera. She is the oldest ever UK- citizen. == Related pages == * Oldest people * List of British supercentenarians == References == Category:1909 births Category:Living people Category:British supercentenarians Category:People from Hampshire Category:People from Surrey",
 "title": "Ethel Caterham"
}