{
 "id": "1084316",
 "text": "Randai (Jawi: رنداي) is a traditional theater show of the Minangkabau people in West Sumatra, Indonesia. It includes music, singing, dance, drama, and the martial art of silat. Usually, Randai is performed during special events and festivals, like Eid al-fitr, with long stories that go on for many nights. The performances are done in a circle to make everyone feel equal and connected. Randai combines martial arts moves, songs, and dramatic scenes, often using Minangkabau stories and legends for its stories. Leading the performance is a person called the panggoreh, who guides the moves and sets the pace with vocal cues called dendang or Gurindam. This makes sure that the Randai goes smoothly and in rhythm. Since a Randai story can last from 1 to 5 hours or more, if the panggoreh gets tired, someone else might take over. == Names == In West Sumatra, there are different names for randai depending on the story, main character, and where it comes from. One known name is Randai Maalah Kapa Tujuah, which comes from Harau district in Limapuluh Kota Regency. The story is about Anggun Nan Tungga Magek Si Jabang and focuses on a hero. This randai lasts for 4-5 hours and involves fewer than 15 male and female performers. It's usually performed at night in a large open area for the public. Traditional musical instruments like talempong, rice stem pupuik, rebab, bansi, and saluang accompany the performance. == History == Randai has been a part of Minangkabau culture for a long time. It's believed to have started in Pariangan, Tanah Datar when locals caught a deer from the sea. In Minangkabau society, groups perform Randai and tell stories like Cindua Mato, Malin Deman, and others. At first, Randai was a game played by young people in the surau yard at night. Now, it's performed at weddings, parties, Islamic festivals and other events to entertain people. Only men played both male and female characters before, but since the 1960s, women have also joined in. Some say Randai was first done by a silat school in Parimanan. The word \"Randai\" might come from \"handai,\" meaning relaxed conversation, or from the Arabic word \"Rayan-Li-dai\".Dahrizal, Musra (2015). Selected Randai Stories. Padang: LPTIK Andalas University. Initially, Randai told stories through poetry and dance based on silat movements. Later, it included characters and dialogue like plays. Randai faced challenges during the Japanese occupation but came back after independence. However, it went down during the New Order era. Today, according to M. Dahrizal Katik Tuo, an expert and conservationist of Randai, there are about 300 Randai performances in West Sumatra. == References == Category:Dances of Indonesia Category:Articles containing video clips",
 "title": "Randai"
}