{
 "id": "1084927",
 "text": "The Women's March on Versailles was one of the earliest events of the French Revolution. It is also called the October March, October Days, or March on Versailles. It was an important part of the Revolution. The March began on the morning of 5 October 1789. Women shopping at marketplaces in Paris nearly started a riot when they saw that the price of bread had increased once again. There were also revolutionaries in Paris that day. They wanted the state to become more liberal, and they wanted to change the absolute monarchy into a constitutional one. Market women, revolutionaries, and allies grew into a mob of thousands. They broke into the city armory and stole weapons. Then they marched to the Palace of Versailles. The crowd besieged the palace, and successfully gave their demands to King Louis XVI. The next day, the crowd forced the king, his family, and most of the French Assembly to return with them to Paris. This ended the king's independence. The March on Versailles was the start of a new balance of power. Eventually the established, privileged orders of the French nobility lost their influence in favor of the Third Estate: the common people. == Background == In the years before the French Revolution, there were poor harvests. Turgot, Louis XVI's Controller-General of Finances, deregulated the grain market in 1774. This was the main cause of the famine that followed. This famineled to the Flour War in 1775. The fear of a famine was always present at the end of the Ancien Régime. Many poor people believed in a conspiracy theoryAndress, David. French Society in Revolution, 1789–1799. France: Manchester University Press, 1999. pp.16-18. ISBN 0-7190-5191-6 called the Pacte de Famine. It said the French monarchy or the nobility were deliberately starving the poor. In April 1789, rumors about food shortages caused the Réveillon riots. That summer, people heard more rumors about a plot to destroy wheat crops in order to starve the population. The Great Fear followed. On 14 July 1789, revolutionaries stormed the Bastille. Still, the Revolution was not as violent as it would become later. Around this time, the common citizens of France, especially in Paris, began to participate in politics and government. The poorest among them focused almost completely on the issue of food: most workers spent nearly half their income on bread. In the post-Bastille period, price inflation and severe food shortages in Paris were common. So were local incidents of violence in marketplaces. Meanwhile, the king's court and the deputies of the National Constituent Assembly lived comfortably in the royal city of Versailles. There, they were discussing big changes to to the French political system. Reformist deputies had passed important laws in the weeks after revolutionaries stormed the Bastille. One was the Declaration of the Rights of Man and of the Citizen. Another was the August Decrees, which formally abolished most privileges of noblemen and clergy members. Next they discussed creating a permanent constitution. Different factions wanted different things in the constitution. Some people (called Monarchists) believed a monarchy was not that bad. After the revolution, they had a difficult position against the Reformers, who wanted to abolish the monarchy. By September of that year, the position of the Monarchists started to improve. During constitutional negotiations they were able to secure a legislative veto power for the king. Many of the reformers did not expect this; further negotiations were hobbled by discord. Reforners found it difficult to negotiate in Versailles, the seat of power. They felt more at ease in Paris. Paris lay within walking distance, less than to the northeast. The reformist deputies were well aware that the four hundred or more monarchist deputies were working to transfer the Assembly to the distant royalist city of Tours, a place even less hospitable to their efforts than Versailles. Worse, many feared that the King, emboldened by the growing presence of royal troops, might simply dissolve the Assembly, or at least undo the August decrees. The King was indeed considering this, and when, on 18 September, he issued a formal statement giving his approval to only a portion of the decrees, the deputies were incensed. Stoking their anger even further, the King stated on 4 October that he had reservations about the Declaration of the Rights of Man.Doyle, p. 121. === Early plans === Contrary to post- revolutionary mythology, the march was not a spontaneous event. Numerous calls for a mass demonstration at Versailles had already been made; notably, the Marquis of Saint-Huruge, one of the popular speakers of the Palais-Royal, had militated for just such a march in August. He wanted to evict the obstructionist deputies. He claimed that these people were protecting the King's veto power. His efforts were not successful. The revolutionaries still thought a march on Versailles to force the King to accept the Assembly's laws was a good idea.Doyle, p. 120. Speakers at the Palais-Royal mentioned it regularly, fanning suspicions that its proprietor, Louis Philippe II, Duke of Orléans, was secretly fomenting a mass action against Versailles. The idea of a march on Versailles was widespread and was even discussed in the pages of the Mercure de France (5 September 1789).Kropotkin, p. 152. Popular unrest was in the air and many nobles and foreigners fled. === Royal banquet === There was a rebellion of the French Guards a few hours before the storming of the Bastille. The only troops immediately available for the security of the palace at Versailles were the aristocratic Garde du Corps (Body Guard) and the Cent- Suisses (Hundred Swiss). Both were primarily ceremonial units and lacked the numbers and training to provide effective protection for the royal family and the government. The king's minister of war, the Comte de Saint-Priest ordered the Flanders Regiment (a regular infantry regiment of the Royal Army) to Versailles in late September 1789. He did this out of precaution. On 1 October, the officers at Versailles held a welcoming banquet for the officers of the newly-arrived troops. This was common practice when a unit changed its garrison. The royal family briefly attended, walking amongst the tables set up in the opera house of the palace. Outside, in the cour de marbre (central courtyard), the soldiers' toasts and oaths of fealty to the king grew more demonstrative as the night wore on. The banquet was held at a time where many people did not have enough food, or could not afford it. So this banquet was an affront. Many newspaprs, among them L'Ami du peuple, reported on the banquet. They called it a gluttonous orgy. Worst of all, the papers also wrote about that the tricolor cockade; had been desecrated: drunken officers were said to have stamped upon this symbol of the nation and professed their allegiance solely to the white cockade of the House of Bourbon. This tale of the royal banquet was a source of intense public outrage. == Beginning of the march == The march started on 5 October. The market-women were angry again, because there was very little bread available, and it was sold at a very high price, in their view. At the edge of a group of market women, a young woman struck a marching drum. This started the march. The women started their march in the markets of a place called Faubourg Saint-Antoine, in the east of Paris. The angry women forced a nearby church to ring its bells. Their numbers continued to grow and the group began to march. More women from other marketplaces joined them. Many had kitchen blades and other makeshift weapons. Soon, alarm bells rang from church towers throughout several districts. Driven by manny different agitators, the mob converged on the Hôtel de Ville (the City Hall of Paris). There they demanded not only bread, but arms. As more and more women – and men – arrived, the crowd outside the city hall reached between six and seven thousand, and perhaps as many as ten thousand. One of the men was Stanislas-Marie Maillard, a prominent vainqueur of the Bastille. Maillard took his own drum and led with the cry of \"à Versailles!\" He was a popular figure among the market-women.Schama, p. 461. Although hardly a man of gentle disposition, Maillard helped, by force of character, to suppress the mob's worst instincts; he rescued the Hôtel de Ville's quartermaster, Pierre- Louis Lefebvre-Laroche, a priest commonly known as Abbé Lefebvre, who had been strung up on a lamppost for trying to safeguard its gunpowder storage. The City Hall itself was pillaged as the crowd surged through, confiscating its provisions and weapons. Maillard helped to prevent the crowd from burning down the entire building. In due course, the rioters' attention turned again to Versailles. Maillard deputized a number of women as group leaders and gave a loose sense of order to the proceedings as he led the crowd out of the city in the driving rain. As they left, thousands of National Guardsmen who had heard the news were assembling at the Place de Grève. The Marquis de Lafayette, in Paris as their commander-in-chief, discovered to his dismay that his soldiers were largely in favor of the march. Agitators encouraged them to join the march. Even though he was one of France's greatest war heroes, Lafayette could not dissuade his troops and they began threatening to desert. Rather than see them leave as another anarchic mob, the Parisian municipal government told Lafayette to guide their movements; they also instructed him to request that the king return voluntarily to Paris to satisfy the people. Sending a swift horseman forward to warn Versailles, Lafayette contemplated the near mutiny of his men: he was aware that many of them had openly promised to kill him if he did not lead or get out of the way. At four o'clock in the afternoon, fifteen thousand National Guardsmen with several thousand more civilian latecomers set off for Versailles. Lafayette reluctantly took his place at the head of their column, hoping to protect the king and public order. == Goals == The rioters had already availed themselves of the stores of the Hôtel de Ville, but they remained unsatisfied: they wanted not just one meal but the assurance that bread would once again be plentiful and cheap. Famine was a real and ever- present dread for the lower strata of the Third Estate, and rumors of an \"aristocrats' plot\" to starve the poor were rampant and readily believed. The hunger and despair of the market women was the original reason for the march. What started as a search for bread soon took on other goals. Notably, there was common resentment against the reactionary attitudes prevailing in Court circles even before the uproar sparked by the notorious banquet precipitated the political aspects of the march.Soboul, p. 155. Activists in the crowd spread the word that the king needed to dismiss his royal bodyguards entirely and replace them all with patriotic National Guardsmen, a line of argument that resonated with Lafayette's soldiers. These two popular goals led to a third, which was that the King and his court, and the Assembly as well, must all be moved to Paris to reside among the people. Only then would the foreign soldiers be expelled, food supply would be reliable and France served by a leader who was \"in communion with his own people\". The plan appealed to all segments of the crowd. Even those who were supportive of the monarchy (and there were many among the women) felt the idea of bringing home le bon papa was a good and comforting plan. For revolutionaries, the preservation of their recent legislative victories and the creation of a constitution were very important and a lockdown of the king within reformist Paris would provide a good environment for the Revolution to succeed. == Siege of the palace == The crowd traveled the distance from Paris to Versailles in about six hours. Among their makeshift weaponry they dragged along several cannons taken from the Hôtel de Ville.On their way the convinced or recruited more and more followers as they left Paris in the autumn rain. In their poissard slang, they chattered about bringing the king back home. They spoke less affectionately of the queen, Marie Antoinette, and many called for her death. === Occupation of the Assembly === When the crowd reached Versailles, it was met by another group that had assembled from the surrounding area. Members of the Assembly greeted the marchers and invited Maillard into their hall, where he talked about the Flanders Regiment and the people's need for bread. As he spoke, the restless Parisians came pouring into the Assembly and sank exhausted on the deputies' benches. Hungry, fatigued, and bedraggled from the rain, they seemed to confirm that the siege was a simple demand for food. The unprotected deputies had no choice but to receive the marchers, who shouted down most of the speakers and demanded to hear from the popular reformist deputy Mirabeau. The great speaker declined this chance to speak. He joined with the market women, even sitting for some time with one of them upon his knee. A few other deputies welcomed the marchers warmly, including Maximilien Robespierre who was at that time a relatively obscure political figure. Robespierre spoke strong words of support for the women and their plight; his intervention helped to soften the crowd's hostility towards the Assembly. === Deputation to the king === The president of the Assembly, was Jean Joseph Mounier. When they arrived, Mounier had few options. For this reason, he accompanied a deputation of market-women into the palace to see the king. The crowd elected six women. Mounier accompanied these six women to the king's appartment, where they told the king of the problems of the crowd. The king responded sympathetically, and using all his charm impressed the women to the point that one of them fainted at his feet. After this brief but pleasant meeting, arrangements were made to disttribute some food from the royal stores, with more promised. Some people in the crowd felt that their goals had been met.Schama, p. 465. As rain once again began to pelt Versailles, Maillard and a small cluster of market women trooped triumphantly back to Paris. Most in the crowd, however, were not satisfied. They milled around the palace grounds with rumors abounding that the women's deputation had been duped – the queen would inevitably force the king to break any promises that had been made. Well aware of the mounting danger, Louis discussed the situation with his advisors. At about six o'clock in the evening, the king made a belated effort to quell the rising tide of insurrection: he announced that he would accept the August decrees and the Declaration of the Rights of Man without qualification. Adequate preparations to defend the palace were not made, however: the bulk of the royal guards, who had been deployed under arms in the main square for several hours facing a hostile crowd, was withdrawn to the far end of the park of Versailles. In the words of one of the officers: \"Everyone was overwhelmed with sleep and lethargy, we thought it was all over.\" This left only the usual night guard of sixty-one Gardes du Corps posted throughout the palace. Late in the evening, Lafayette's national guardsmen approached up the Avenue de Paris. Lafayette immediately left his troops and went to see the king, grandly announcing himself with the declaration, \"I have come to die at the feet of Your Majesty\". Outside, an uneasy night was spent in which his Parisian guardsmen mingled with the marchers, and the two groups sounded each other out. Many in the crowd denounced Lafayette as a traitor, complaining of his resistance to leaving Paris and the slowness of his march. By the first light of morning, it was clear that the national guards and the women had formed an alliance and the crowd's vigor was restored. === Attack on the palace === At about six o'clock in the morning, some of the protesters discovered a small gate to the palace was unguarded. Making their way inside, they searched for the queen's bedchamber. The royal guards retreated through the palace, locking doors and barricading hallways and those in the compromised sector, the cour de marbre, fired their guns at the intruders, killing a young member of the crowd. Infuriated, the rest surged towards the breach and streamed inside. One of the gardes du corps on duty was killed immediately and his body decapitated. A second Tardivet du Repaire, posted outside the entrance to the Queen's apartments, attempted to face down the crowd and was struck down severely wounded. As battering and screaming filled the halls around her, the queen ran barefoot with her ladies to the king's bedchamber and spent several minutes banging on its locked door, unheard above the din.Schama, p. 467. They escaped through the doorway safely and in time to avoid the crowd.Carlyle, p. 272. The chaos continued as other royal guards were found and beaten; at least one more was killed and his head too appeared atop a pike. Finally, the fury of the attack subsided enough to permit some communication between the former French Guards, who formed the professional core of Lafayette's National Guard militia, and the royal gardes du corps. The units had a history of cooperation and a military sense of mutual respect, and Lafayette, who had been sleeping, awoke and intervened. The two groups of soldiers were reconciled by Lafayette and a tenuous peace was established within the palace.Carlyle, p. 273. === Lafayette's intervention === The fighting stopped, and the two commands of troops had cleared the inside of the palace. The mob was still present outside the palace. The rank and file of both the Flanders Regiment and another regular unit present, the Montmorency Dragoons, now appeared unwilling to act against the people. While the guet (watch) of Gardes du Corps on palace duty overnight had shown courage in protecting the royal family, the main body of the regiment had abandoned their position near the Triannon and retreated to Rambouillet at dawn. Lafayette convinced the king to address the crowd. When the two men stepped out on a balcony an unexpected cry went up: \"Vive le Roi!\" (Long live the king!) The relieved king briefly conveyed his willingness to return to Paris, acceding \"to the love of my good and faithful subjects\". As the crowd cheered, Lafayette stoked their joy by dramatically pinning a tricolor cockade to the hat of the king's nearest bodyguard. After the king withdrew, the presence of the Queen was demanded loudly. Lafayette brought her to the same balcony, accompanied by her young son and daughter. The crowd ominously shouted for the children to be taken away, and it seemed the stage might be set for a regicide. Yet, as the queen stood with her hands crossed over her chest, the crowd – some of whom had muskets leveled in her direction – warmed to her courage. Amid this unlikely development, Lafayette cannily let the mob's fury drain away until, with dramatic timing and flair, he knelt reverently and kissed her hand. The demonstrators responded with a muted respect, and many even raised a cheer which the queen had not heard for some time: \"Vive la Reine!\" The goodwill generated by these displays defused the situation, but to many observers the scene on the balcony lacked long-term resonance. However pleased it may have been by the royal displays, the crowd insisted that the king return with them to Paris.Soboul, p. 156. === Return to Paris === At about one o'clock in the afternoon of 6 October 1789 the crowd escorted the royal family and a complement of one hundred deputies back to the capital, with the armed National Guards leading the way. By now the mass of people had grown to over sixty thousand, and the return trip took about nine hours. The procession could seem merry at times, as guardsmen hoisted up loaves of bread stuck on the tips of their bayonets, and some of the market women rode gleefully astride the captured cannon. Some people in the crowd sang pleasantries about their \"Good Papa\". Despite this, a violent undercurrent was clearly in evidence; celebratory gunshots flew over the royal carriage and some marchers carried pikes bearing the heads of the slaughtered Versailles guards. A sense of victory over the ancien régime animated the parade and the relationship between the King and his people would never be the same. No one understood this so well as the king himself. After arriving at the dilapidated Tuileries Palace, abandoned since the reign of Louis XIV, he was asked for his orders and he replied with uncharacteristic diffidence, \"Let everyone put himself where he pleases!\". He then poignantly asked that a history of the deposed Charles I of England be brought from the library. == Aftermath == The rest of the National Constituent Assembly followed the king within two weeks to new quarters in Paris. In short order, the entire body settled in only a few steps from the Tuileries at a former riding school, the Salle du Manège. However, some fifty-six monarchien deputies did not come with them, believing the mob in the capital to be dangerous. The October journées thus effectively deprived the monarchist faction of significant representation in the Assembly as most of these deputies retreated from the political scene; many, like Mounier, fled the country altogether.Soboul, p. 157. == References == == Bibliography == * * * * * * * * * * * * * * * * * * * * * == Further reading == * * * == Other websites == * A modern transcription of Thomas Carlyle's The French Revolution: A History, Vol. I with line-by-line annotation. For the Women's March on Versailles, see chapter 1.7.IV: The Menads. Category:Pages with unreviewed translations Category:French Revolution",
 "title": "Women's March on Versailles"
}