{
 "id": "1084099",
 "text": "The 77th British Academy Film Awards, commonly known as the BAFTAs, was an award ceremony honouring the best national and foreign movies of 2023. It was held at the Royal Festival Hall within London's Southbank Centre on 18 February 2024. The ceremony's host was David Tennant, who hosted it for the first time. == Nominees == The BAFTA longlists were revealed on 5 January 2024. The nominations were announced on 18 January. Oppenheimer received thirteen nominations, followed by Poor Things and Killers of the Flower Moon with eleven and nine respectively. Oppenheimer had the most awards with seven wins, followed by Poor Things with five. === Awards === Winners are listed first and highlighted in boldface. Best Film Best Director * Oppenheimer – Christopher Nolan, Charles Roven and Emma Thomas ** Anatomy of a Fall – Marie- Ange Luciani and David Thion ** The Holdovers – Mark Johnson ** Killers of the Flower Moon – Dan Friedkin, Daniel Lupi, Martin Scorsese and Bradley Thomas ** Poor Things – Ed Guiney, Yorgos Lanthimos, Andrew Lowe and Emma Stone * Christopher Nolan – Oppenheimer ** Bradley Cooper – Maestro ** Jonathan Glazer – The Zone of Interest ** Andrew Haigh – All of Us Strangers ** Alexander Payne – The Holdovers ** Justine Triet – Anatomy of a Fall Best Actor in a Leading Role Best Actress in a Leading Role * Cillian Murphy – Oppenheimer as J. Robert Oppenheimer ** Bradley Cooper – Maestro as Leonard Bernstein ** Colman Domingo – Rustin as Bayard Rustin ** Paul Giamatti – The Holdovers as Paul Hunham ** Barry Keoghan – Saltburn as Oliver Quick ** Teo Yoo – Past Lives as Hae Sung * Emma Stone – Poor Things as Bella Baxter ** Fantasia Barrino – The Color Purple as Celie Harris-Johnson ** Sandra Hüller – Anatomy of a Fall as Sandra Voyter ** Carey Mulligan – Maestro as Felicia Montealegre ** Vivian Oparah – Rye Lane as Yas ** Margot Robbie – Barbie as Barbie Best Actor in a Supporting Role Best Actress in a Supporting Role * Robert Downey Jr. – Oppenheimer as Lewis Strauss ** Robert De Niro – Killers of the Flower Moon as William King Hale ** Jacob Elordi – Saltburn as Felix Catton ** Ryan Gosling – Barbie as Ken ** Paul Mescal – All of Us Strangers as Harry ** Dominic Sessa – The Holdovers as Angus Tully * Da'Vine Joy Randolph – The Holdovers as Mary Lamb ** Emily Blunt – Oppenheimer as Kitty Oppenheimer ** Danielle Brooks – The Color Purple as Sofia ** Claire Foy – All of Us Strangers as Mum ** Sandra Hüller – The Zone of Interest as Hedwig Höss ** Rosamund Pike – Saltburn as Lady Elspeth Catton Best Original Screenplay Best Adapted Screenplay * Anatomy of a Fall – Justine Triet and Arthur Harari ** Barbie – Greta Gerwig and Noah Baumbach ** The Holdovers – David Hemingson ** Maestro – Bradley Cooper and Josh Singer ** Past Lives – Celine Song * American Fiction – Cord Jefferson ** All of Us Strangers – Andrew Haigh ** Oppenheimer – Christopher Nolan ** Poor Things – Tony McNamara ** The Zone of Interest – Jonathan Glazer Best Animated Film Best Documentary * The Boy and the Heron – Hayao Miyazaki and Toshio Suzuki ** Chicken Run: Dawn of the Nugget – Sam Fell, Leyla Hobart and Steve Pegram ** Elemental – Peter Sohn and Denise Ream ** Spider-Man: Across the Spider-Verse – Joaquim Dos Santos, Kemp Powers, Justin K. Thompson, Avi Arad, Phil Lord, Christopher Miller, Amy Pascal and Christina Steinberg * 20 Days in Mariupol – Mstyslav Chernov and Raney Aronson-Rath ** American Symphony – Matthew Heineman, Lauren Domino and Joedan Okun ** Beyond Utopia – Madeleine Gavin, Rachel Cohen and Jana Edelbaum ** Still: A Michael J. Fox Movie – Davis Guggenheim, Jonathan King and Annetta Marion ** Wham! – Chris Smith Best Film Not in the English Language Best Casting * The Zone of Interest – Jonathan Glazer ** 20 Days in Mariupol – Mstyslav Chernov and Raney Aronson-Rath ** Anatomy of a Fall – Justine Triet, Marie-Ange Luciani and David Thion ** Past Lives – Celine Song, David Hinojosa, Pamela Koffler and Christine Vachon ** Society of the Snow – J. A. Bayona and Belén Atienza * The Holdovers – Susan Shopmaker ** All of Us Strangers – Kahleen Crawford ** Anatomy of a Fall – Cynthia Arra ** How to Have Sex – Isabella Odoffin ** Killers of the Flower Moon – Ellen Lewis and Rene Haynes Best Cinematography Best Costume Design * Oppenheimer – Hoyte van Hoytema ** Killers of the Flower Moon – Rodrigo Prieto ** Maestro – Matthew Libatique ** Poor Things – Robbie Ryan ** The Zone of Interest – Łukasz Żal * Poor Things – Holly Waddington ** Barbie – Jacqueline Durran ** Killers of the Flower Moon – Jacqueline West ** Napoleon – David Crossman and Janty Yates ** Oppenheimer – Ellen Mirojnick Best Editing Best Make Up & Hair * Oppenheimer – Jennifer Lame ** Anatomy of a Fall – Laurent Sénéchal ** Killers of the Flower Moon – Thelma Schoonmaker ** Poor Things – Yorgos Mavropsaridis ** The Zone of Interest – Paul Watts * Poor Things – Nadia Stacey, Mark Coulier and Josh Weston ** Killers of the Flower Moon – Kay Georgiou and Thomas Nellen ** Maestro – Siân Grigg, Kay Georgiou, Kazu Hiro and Lori McCoy-Bell ** Napoleon – Jana Carboni, Francesco Pegoretti, Satinder Chumber and Julia Vernon ** Oppenheimer – Luisa Abel, Jaime Leigh McIntosh, Jason Hamer and Ahou Mofid Best Original Score Best Production Design * Oppenheimer – Ludwig Göransson ** Killers of the Flower Moon – Robbie Robertson ** Poor Things – Jerskin Fendrix ** Saltburn – Anthony Willis ** Spider-Man: Across the Spider-Verse – Daniel Pemberton * Poor Things – Shona Heath, James Price and Zsuzsa Mihalek ** Barbie – Sarah Greenwood and Katie Spencer ** Killers of the Flower Moon – Jack Fisk and Adam Willis ** Oppenheimer – Ruth De Jong and Claire Kaufman ** The Zone of Interest – Chris Oddy, Joanna Maria Kuś and Katarzyna Sikora Best Sound Best Special Visual Effects * The Zone of Interest – Johnnie Burn and Tarn Willers ** Ferrari – Angelo Bonanni, Tony Lamberti, Andy Nelson, Lee Orloff and Bernard Weiser ** Maestro – Richard King, Steve Morrow, Tom Ozanich, Jason Ruder and Dean Zupancic ** Mission: Impossible – Dead Reckoning Part One – Chris Burdon, James H. Mather, Chris Munro and Mark Taylor ** Oppenheimer – Willie Burton, Richard King, Kevin O'Connell and Gary A. Rizzo * Poor Things – Simon Hughes ** The Creator – Jonathan Bullock, Charmaine Chan, Ian Comley and Jay Cooper ** Guardians of the Galaxy Vol. 3 – Theo Bialek, Stephane Ceretti, Alexis Wajsbrot and Guy Williams ** Mission: Impossible – Dead Reckoning Part One – Neil Corbould, Simone Coco, Jeff Sutherland and Alex Wuttke ** Napoleon – Henry Badgett, Neil Corbould, Charley Henley and Luc-Ewen Martin-Fenouillet Outstanding British Film Outstanding Debut by a British Writer, Director or Producer * The Zone of Interest – Jonathan Glazer, James Wilson and Ewa Puszczyńska ** All of Us Strangers – Andrew Haigh, Graham Broadbent, Pete Czernin and Sarah Harvey ** How to Have Sex – Molly Manning Walker, Emily Leo, Ivana MacKinnon and Konstantinos Kontovrakis ** Napoleon – Ridley Scott, Mark Huffam, Kevin J. Walsh and David Scarpa ** The Old Oak – Ken Loach, Rebecca O'Brien and Paul Laverty ** Poor Things – Yorgos Lanthimos, Ed Guiney, Andrew Lowe, Emma Stone and Tony McNamara ** Rye Lane – Raine Allen-Miller, Yvonne Isimeme Ibazebo, Damian Jones, Nathan Bryon and Tom Melia ** Saltburn – Emerald Fennell, Josey McNamara and Margot Robbie ** Scrapper – Charlotte Regan and Theo Barrowclough ** Wonka – Paul King, Alexandra Derbyshire, David Heyman and Simon Farnaby * Earth Mama – Savanah Leaf (Writer, Director, Producer), Shirley O'Connor (Producer) and Medb Riordan (Producer) ** Blue Bag Life – Lisa Selby (Director), Rebecca Lloyd-Evans (Director, Producer) and Alex Fry (Producer) ** Bobi Wine: The People's President – Christopher Sharp (Director) [also directed Moses Bwayo] ** How to Have Sex – Molly Manning Walker (Writer, Director) ** Is There Anybody Out There? – Ella Glendining (Director) Best British Short Animation Best British Short Film * Crab Day – Ross Stringer, Bartosz Stanislawek and Aleksandra Sykulak ** Visible Mending – Samantha Moore and Tilley Bancroft ** Wild Summon – Karni Arieli, Saul Freed and Jay Woolley * Jellyfish and Lobster – Yasmin Afifi and Elizabeth Rufai ** Festival of Slaps – Abdou Cissé, Cheri Darbon and George Telfer ** Gorka – Joe Weiland and Alex Jefferson ** Such a Lovely Day – Simon Woods, Polly Stokes, Emma Norton and Kate Phibbs ** Yellow – Elham Ehsas, Dina Mousawi, Azeem Bhati and Yiannis Manolopoulos EE Rising Star Award * Mia McKenna-Bruce ** Phoebe Dynevor ** Ayo Edebiri ** Jacob Elordi ** Sophie Wilde == Ceremony information == Barbie, Killers of the Flower Moon and Oppenheimer led the longlists with fifteen nods each, which was the same amount of nods that All Quiet on the Western Front (2022) received at the previous ceremony. Poor Things and Maestro followed up with fourteen and twelve nods respectively. Oppenheimer eventually received thirteen nominations while Poor Things and Killers of the Flower Moon obtained eleven and nine respectively. Barbie had only received five nominations, which did not include Best Film and Best Director (Greta Gerwig). The ceremony was streamed live on BBC One and iPlayer in the United Kingdom, and on BritBox International in Canada, Denmark, Finland, Norway, South Africa, Sweden, and the United States. == References == Category:BAFTA Awards",
 "title": "77th British Academy Film Awards"
}