{
 "id": "1084393",
 "text": "Plintron Mobility Solutions is a Indianhttps://www.msn.com/en- us/money/companies/telecommunications-company-sues-four-former-executives- over-fraud/ar-BB1hbTx7 multi-national cloud communications and mobile payments technology company specializing in cloud based Mobile Virtual Network Aggregator (MVNA) services and Internet of Things (IoT) connectivity. Plintron has extensive global experience in launching 120+ successful MVNOs all over the world in 6 continents and in 28+ countries. The company is headquartered in Dubai,https://plintron.com/about-us-2/ with major R&D; office in Chennai and maintains offices in Singapore, São Paulo, Bellevue, London and Seattle. == History == Plintron was founded in 2008 by Mr. Mohan Sundaram and Ms. Subhashree Radhakrishnan in Chennai. Plintron has majority of it's operations in Chennai along with its global R&D; center in India and offices in the United States, United Kingdom and Brazil. Initially, the company focused on cloud communications solutions through a cloud-based Mobile Virtual Network Enabler (MVNE) platform, with its operations beginning in the United Kingdom and Switzerland. Over time, Plintron evolved from being a MVNE platform provider to adopting the Mobile Virtual Network Aggregator (MVNA) model. This transition allowed Plintron to aggregate mobile virtual networks for Mobile Network Operators (MNOs) and assist brands in launching their MVNOs. Plintron also ventured into the Internet of Things (IoT) sector, providing IoT connectivity services and a Content Management Platform. The company continues to explore innovations in the field of cloud communication services. == Awards == Plintron has received recognition for its contributions to the telecommunications industry, including awards such as: * IoT Initiative of the year at Asian Telecom Awards 2023 & Cloud Initiative of the Year Award at the Asian Telecom Awards 2022 & 2023. * MVNE of the Year 2022 & 2023 at MVNO Awards and IoT Connectivity Solution Provider of the Year MVNOs World Congress. * Most Innovative Digital Communications Cloud Technology – Europe – 2023 in Global Brand Awards and Most Innovative Marketing by a Digital Brand – LATAM, 2023 at Global Brand Awards 2023. * Winner “IoT Platform of the Year” in the 7th annual Mobile Breakthrough Awards,2023. * Best MVNA/E & Digital Communications Technology SaaS Company for LATAM 2023 and Best MVNA/E & Digital Communications Technology SaaS Company for Europe 2023 at the World Business Outlook Awards. * Best IT / ITES company at the \"Dun & Bradstreet – Axis Bank Business Gaurav SME awards 2012.\" * Listing in NASSCOM’s Top 50 Emerging Growth Companies in India in 2013. * Being rated by Silicon India as the Best Company to work for in India in 2015. * Recognition by Business Connect as the Fastest Growing IoT Company to Watch Globally in 2021. * Awarded by Brandvision Nexbrands as \"The Extraordinaire Brand 2020-21 and Gamechanger in CPaaS category.\" * Winning the Cloud Initiative of the Year Award at the Asian Telecom Awards 2022. * Achieving MVNE of the Year 2022 at MVNO Awards, MVNOs World Congress. * Receiving the Polish Innovation Award 2022 at the Polish Congress of Entrepreneurship in Krakow. * Berkshire Media ranking Plintron as India’s Best Company of the Year 2022 in the CPaaS category. == References == Category:Telecommunications Category:Companies of Singapore",
 "title": "Plintron Mobility Solutions"
}