{
 "id": "1084538",
 "text": "On 14 November 2021, a taxi with a passenger came to the main entrance of Liverpool Women's Hospital in Liverpool, England. An improvised explosive device that the passenger was carrying exploded, killing him and injuring the driver. The police later said it was a terrorist attack. The attacker was refused asylum in 2014 and lost appeal in 2015. He lived in England until his attack. == Incident == On 14 November 2021, an explosion happened inside a taxi as it went in front of the main entrance of the Liverpool Women's Hospital in Liverpool, England. The driver left the taxi seconds later and ran away. A fire badly burned the car after that. The explosion was caused by an improvised explosive device which was carried by the taxi's passenger. The passenger died in the attack. The taxi driver was admitted to the hospital, with injuries including an ear needing to be put back on, but was released the next day. Merseyside Police were at the scene, along with fire and ambulance crews. The Royal Logistic Corps' Bomb Squad was also there. The hospital was put under a lockdown, roads were closed and a cordon was in place around the hospital by the evening. Armed police stayed at the hospital during this. The passenger's motivation for carrying the device was not known at first. One theory was that he wanted to walk to Liverpool Cathedral and detonate his device as the congregation left. The hospital is not very far away from the cathedral, where the remembrance service was happening. The service was attended by thousands of veterans and military personnel with a parade happening after. == Investigation == The taxi driver picked up the passenger in Rutland Avenue, which is about 10 minutes away from the hospital. Early reports suggested that when they arrived he locked the doors of his taxi while his passenger was inside before it went up in flames, although a Counterterrorism spokesman said that officers had not yet talked to the driver as of Sunday evening. Police later confirmed that the fire had been caused by the ignition of a home-made explosive device. Merseyside Police armed units raided a property in the Sefton Park area, although the BBC reported that police had not confirmed whether the two incidents were related. Three men aged 29, 26, and 21 were arrested in Liverpool in the early morning of the next day. They were arrested under the Terrorism Act. Police later said the arrests were a direct response to the attack. A fourth man, aged 20, was arrested the next day. The arrest of the fourth man turned into a siege at the property he was in, and police deployed negotiators. This arrest was supported by United Kingdom Special Forces. Several houses in the Sefton Park area were evacuated. A controlled explosion was carried out in the middle of Sefton Park, \"a few hundred metres\" from the house in Rutland Avenue where equipment for making bombs was found. The four arrested men were released on 15 November. ===Perpetrator=== The person who people thought was the perpetrator died during the attack. He was identified the next day as Emad al-Swealmeen. He apparently changed his name to Enzo Almeni. He was not known to MI5. A post-mortem found he died from injuries caused by the explosion and fire. He came to the UK around 2014 and claimed for asylum as a Syrian refugee. He was denied asylum because officials thought he was Jordanian and not Syrian. Seven years before the incident he was sectioned after trying to kill himself and waving a knife in Liverpool city centre. After that, he converted from Islam to Christianity in 2015. He had served time in a Middle East prison for serious assault. Police said that they believed he had lived at the Sutcliffe Street address for some time but had recently started renting a property in Rutland Avenue, where the bomb was made. Reports suggested that al-Swealmeen had converted to Christianity just to get asylum, but the Church of England said that there was no evidence that converts' asylum claims are faster. He had been baptised in 2015 and confirmed in 2017, before losing contact with Liverpool Cathedral the following year. It was later revealed by investigators that al-Swealmeen had reverted to Islam months before the attack. A coroner determined that the bomb was made to kill someone but it was unclear if the device was supposed to detonate when it did. ==Response== The taxi driver was praised by a lot of people after the incident, with some people calling him a \"hero\" because he stopped al-Swealmeen from getting inside the hospital by locking the doors of his taxi. Prime Minister Boris Johnson also praised the driver. On 15 November 2021, the police said that the explosion was a terrorist incident, and the UK terror threat level was raised from substantial to severe. MI5 joined the investigation to support the local police, and COBRA met on the morning of 15 November. ==Notes== ==References== Category:Islamic terrorist incidents in the United Kingdom Category:Building bombings in England Category:Liverpool Category:November 2021 events",
 "title": "Liverpool Women's Hospital bombing"
}