{
 "id": "1084934",
 "text": "Hassanally Aabdul Rahman or Hassan Ali Abdul Rahman ( ) was a lawyer and politician born in Karachi, Sindh. He lived from 1909 to 1986. == Early life == He was born to a family of legal professionals, government officers, and people active in the education sector. His father was the late and influential Karachi citizen, Barrister Abdurrahman. He received his barrister-at-law from Middle Temple, England in 1934. He was one of the founding architects along with his younger brother Tufail Ali Abdul Rehman of the Sindh Muslim Government Law College in Karachi. He also served as the first principal of the college. Known as a social and community leader, Rahman was the vice chancellor of Sindh University, Jamshoro, where he served twice in the same capacity. == Career == He was the treasurer of the Pakistan Institute of International Affairs, Secretary General of All Pakistan Educational Society, and President/Board Member Sindh Muslim Law College (S.M. Law College). In 1952, he led the Pakistani delegation to UNESCO. In 1953, he represented the country at the Commonwealth University Conference. Rahman was the older brother of Justice Tufail Ali Abdul Rehman, who also served as Attorney General of Pakistan and the Chief Justice of Sindh and Balochistan High Courts. Tufail Ali Abdul Rehman was also the presiding judge who sat on the Hamoodur Rahman commission post 1971 civil war between then West Pakistan (present-day Pakistan) and East Pakistan (present-day Bangladesh). The two brothers were the only founding members of the Sindh Muslim Law College. Rahman’s father Barrister Abdul Rahman was a barrister-at-law of the Subcontinent and was affiliated with the Queens Council. In addition, Rahman served as one of the founding members of Karachi University. In 1967 he was removed from that position because of political discontent.https://tribune.com.pk/story/1346829/remembering-struggle-sindhs- students Rahman became a barrister and was also politically active in the British Raj. He along with other fellow barristers worked with Muhammed Ali Jinnah, the founder of Pakistan. ==References== ==Other websites== *My father sherryrehman.com *Hassanally Rahman (1904-1986) Prabook *Quaid-i-Azam Mohammad Ali Jinnah Papers Volume 1, Issue 1 Category:1909 births Category:1986 deaths Category:20th-century Pakistani lawyers Category:Politicians from Karachi Category:Pakistani Muslims Category:Sindhi people Category:Sindh Muslim Law College alumni",
 "title": "Hassanally Abdul Rahman"
}