{
 "id": "1084837",
 "text": "Acoustic Kitty was a Central Intelligence Agency (CIA) project to use cats to spy on the Kremlin and Soviet embassies. It was the Directorate of Science and Technology of the CIA started the project in the 1960s. The idea was to fit cats with microphones and an antenna to transmit the data. At first the idea was to use a special collar. It was found that this was too easy to detect, so the cat had to undergo surgery, to get the microphone and transmitter implanted. The microphone was put in the ear canal. There was a small radio transmitter at the base of the skull, and a thin wire was put into its fur. This would allow the cat to innocuously record and transmit sound from its surroundings. Due to problems with distraction, the cat's sense of hunger had to be addressed in another operation. Victor Marchetti, a former CIA officer, said Project Acoustic Kitty cost about $20 million. The first Acoustic Kitty mission was to eavesdrop on two men in a park outside the Soviet embassy in Washington, D.C. The cat was released nearby, but was hit and allegedly killed by a taxi almost immediately. However, this was disputed in 2013 by Robert Wallace, a former director of the Office of Technical Service, who said that the project was abandoned due to the difficulty of training the cat to behave as required, and \"the equipment was taken out of the cat; the cat was re-sewn for a second time, and lived a long and happy life afterwards\". Subsequent tests also failed. Shortly thereafter the project was considered a failure and declared to be a total loss.Jeffrey T. Richelson, The Wizards of Langley: Inside the CIA's Directorate of Science and Technology (Boulder, CO: Westview Press, 2002), 147-48. . However, other accounts report more success for the project. The project was cancelled in 1967. A closing memorandum said that the CIA researchers believed that they could train cats to move short distances, but that \"the environmental and security factors in using this technique in a real foreign situation force us to conclude that for our (intelligence) purposes, it would not be practical.\", redacted (pdf) The project was disclosed in 2001, when some CIA documents were declassified. == References == == Further reading == * The Agency: The Rise and Decline of the CIA, John Ranelagh, rev. ed., New York: Simon & Schuster, 1987, at p. 208\\. == Other websites == * The Memory Palace podcast episode about Acoustic Kitty episode-16-secret-kitty * Declassified CIA document about project Category:Military animals Category:1960s in the United States",
 "title": "Acoustic Kitty"
}