{
 "id": "1084270",
 "text": "Anthony Yeboah (born 6 June 1966) is a Ghanaian former professional footballer who played as a striker. Considered one of the best Ghanaian players of all time. He was a striker gifted with speed, power and a good eye for goal. Yeboah was an all-action centre-forward, with the physicality to ruffle defenders at will and the technique to score wonder goals almost every other week. At 5ft 11ins tall, Yeboah had everything a top striker required - pace, power, tenacity and clinical finishing. ==Club career== In adult football, he made his debut in 1982 with performances for \"Asante Kotoko\", after which he played in his homeland for the \"Cornerstones\" and \"Okwavu United\" clubs, becoming the two-time top scorer of the Ghana championship with the last club. In 1988, Tony went to Germany, where he signed a contract with Saarbrücken, which played in the Second Bundesliga, where he spent the next two seasons. With his game for Saarbruecken, he attracted the attention of representatives of the coaching staff of the Eintracht club from the First Bundesliga, which he joined in the summer of 1990. He played the next five seasons of his playing career for the Frankfurt club. Most of his time with Eintracht (Frankfurt am Main), he was the main player in the attacking link of the team and one of the main scorers of the team, averaging 0.55 goals per game in the championship, as well as becoming the best two years in a row scorer of the Bundesliga. During 1995-1997, he defended the colors of the English club \"Leeds United\" and in 1996 was named the best player of the club. In the summer of 1997, Yeboah returned to Germany and signed a contract with Hamburg , where he spent the next four years of his playing career. While playing for Hamburg, he also mostly appeared on the field as part of the main team, but he no longer showed his former performance. He finished his professional playing career in the club \"Al-Ittihad\" (Doha), for which team he played during 2001-2002 and helped his club win the Qatar championship and the Cup of the Emir of Qatar that season. ==International career== He was a member of Ghana's national team for over ten years, and represented his country at three Africa Cup of Nations during the 1990s. Yeboah scored 29 goals in 59 appearances for Ghana, the fourth highest goalscoring total in the nation's history behind Asamoah Gyan, Edward Acquah and Kwasi Owusu. ==Post-playing career== On 3 November 2008, he was appointed as the new chairman of the newly promoted Ghana Premier League club Berekum Chelsea. ==Personal life== Yeboah along with his cousin former Mainz player Michael Osei runs an international sports agency called Anthony Yeboah Sportpromotion and owns a chain of hotels in Ghana (Accra, Kumasi) called Yegoala. He is married and has two children. His nephew, Kelvin Yeboah, is also a professional footballer. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National Cup League Cup Continental Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals 1\\. FC Saarbrücken 1988–89 2. Bundesliga 28 9 2 0 – – 2 2 32 11 1989–90 37 17 1 2 – – 2 1 40 20 Total 65 26 3 2 0 0 0 0 4 3 72 31 Eintracht Frankfurt 1990–91 Bundesliga 26 8 6 2 – 1 1 – 33 11 1991–92 34 15 1 0 – 3 2 – 38 17 1992–93 27 20 6 5 – 4 5 – 37 30 1993–94 22 18 2 1 – 3 1 – 27 20 1994–95 14 7 2 1 – 5 3 – 21 11 Total 123 68 17 9 0 0 16 12 0 0 156 89 Leeds United 1994–95 Premier League 18 12 2 1 0 0 – – 20 13 1995–96 22 12 6 1 7 3 4 3 – 39 19 1996–97 7 0 0 0 0 0 – – 7 0 Total 47 24 8 2 7 3 4 3 0 0 66 32 Hamburger SV 1997–98 Bundesliga 23 3 0 0 – 0 0 – 23 3 1998–99 34 14 3 2 – – – 37 16 1999–2000 24 9 1 0 – 6 3 – 31 12 2000–01 14 2 1 0 1 0 9 2 – 25 4 2001–02 5 0 0 0 – – – 5 0 Total 100 28 5 2 1 0 15 5 0 0 121 35 Career total 335 146 33 15 8 3 35 20 4 3 415 187 ===International goals=== African Cup of Nations only. :Scores and results list Ghana's goal tally first, score column indicates score after each Yeboah goal. List of international goals scored by Tony Yeboah No. Date Venue Opponent Score Result Competition 1 17 January 1992 Stade Aline Sitoe Diatta, Ziguinchor, Senegal 1–0 1–0 1992 African Cup of Nations 2 20 January 1992 Stade Leopold Senghor, Dakar, Senegal 1–0 2–1 1992 African Cup of Nations 3 30 August 1992 Accra Sports Stadium, Accra, Ghana 1–0 3–0 1994 African Cup of Nations Qualifier 4 2–0 5 25 July 1993 Samuel Kanyon Doe Sports Complex, Monrovia, Liberia 2–0 2–0 1994 African Cup of Nations Qualifier 6 23 April 1995 Accra Sports Stadium, Accra, Ghana 1–0 1–0 1996 African Cup of Nations Qualifier 7 14 January 1996 EPRU Stadium, Port Elizabeth, South Africa 1–0 2–0 1996 African Cup of Nations 8 28 January 1996 EPRU Stadium, Port Elizabeth, South Africa 1–0 1–0 1996 African Cup of Nations ==Honours== Asante Kotoko *Ghana Premier League: 1981, 1982, 1983 *African Cup of Champions Clubs: 1983 Leeds United *Football League Cup runner-up: 1995–96 Al Ittihad *Qatar Stars League: 2001–02 *Emir of Qatar Cup: 2001–02 *Qatar Cup runner-up: 2001–02 Ghana *African Cup of Nations runner-up: 1992 *West African Nations Cup – SCSA Zone III: 1982, 1983, 1984 Individual *Ghana Premier League top scorer: 1986, 1987 *Bundesliga top scorer: 1992–93, 1993–94 *kicker Bundesliga Team of the Season: 1992–93, 1993–94 *African Footballer of the Year third: 1992; second: 1993 *FIFA World Player of the Year ninth: 1993 *Leeds United Player of the Year: 1996 *Ghana Footballer of the Year: 1997 *Premier League Player of the Month: March 1995, September 1995 == References == Category:1966 births Category:Living people Category:Association football forwards Category:Ghanaian footballers",
 "title": "Tony Yeboah"
}