{
 "id": "1084523",
 "text": "Balistes is a genus of triggerfish. == Species == Four species are recognized in this genus: * Balistes capriscus J. F. Gmelin, 1789 (Gray triggerfish) * Balistes polylepis Steindachner, 1876 (Finescale triggerfish) * Balistes punctatus J. F. Gmelin, 1789 (Bluespotted triggerfish) * Balistes vetula Linnaeus, 1758 (queen triggerfish) === Fossil species === * †Balistes dubius Blainville, 1818 (Middle Miocene) * †Balistes vegai Lopez, Carr & Lorenzo, 2019 (Miocene) == Species information == === Grey triggerfish === The grey triggerfish is a species of triggerfish. It is a small fish, usually less than 2.3 kg (5.1 lb). The premaxilla and maxilla form a robust unit and this in turn is attached by a ligament to the vomer and ethmoid. The upper jaw, however, is not protrusible. === Finescale triggerfish === The finescale triggerfish is a kind of triggerfish that is found in the Pacific coast of the Americas from northern California southwards to central Chile, including the Galápagos Islands. === Bluespotted triggerfish === The bluespotted triggerfish is a species of triggerfish from the Eastern Atlantic. === Queen triggerfish === The queen triggerfish is a triggerfish found in the Atlantic Ocean. It is blue, purple, turquoise and green with a yellowish throat, and light blue lines on the fins and head. == Related pages == * Titan triggerfish * Balistomorphus * Heterolepidotus * Onchopristis * Amphiperca == References == # L. F. de Beaufort (1926). \"On a collection of marine fishes from the Miocene of South Celebes\". In H. A. Brouwer (ed.), Geologische Onderzoekingen in den Oostelijken Oost-Indischen Archiepel 117-148. # \"Balistes\". WetWebMedia. # Matsuura, Keiichi (2014). \"Taxonomy and systematics of tetraodontiform fishes: a review focusing primarily on progress in the period from 1980 to 2014\". Ichthyological Research. # \"Gray Triggerfish\". NOAA Fisheries. # Viñola Lopez, Lazaro W.; Carr, Richard; Lorenzo, Logel (2020-10-20). \"First occurrence of fossil Balistes (Tetradontiformes: Balistidae) from the Miocene of Cuba with the description of a new species and a revision of fossil Balistes\". Historical Biology. == Other websites == * Media related to Balistes at Wikimedia Commons Category:Tetraodontiformes",
 "title": "Balistes"
}