{
 "id": "1084955",
 "text": "The Rubab (Pashto: رُباب), also known as Robab or Rabab, is a musical instrument a bit like a guitar. It is mostly played by the Pashtun, Baluch and Kho people of Pakistan and Afghanistan. There are different kinds of Rubabs, like the Kabuli rebab, the Rawap, the Pamiri rubab, and the seni rebab. People in many parts of Asia, including Central, South, and Southeast Asia, play the Rubab. The word \"Rubab\" comes from the Arabic word \"rebab\". In Central and South Asia, people play it by plucking its strings, but in other places, they use a bow. == History == The rubab has been around since the 7th century CE. It's mentioned in old Persian books, and many Sufi poets talk about it in their poems. It's a traditional instrument and its types are used a lot in countries like Afghanistan, Pakistan, Azerbaijan, Iran, Turkey, Iraq, Tajikistan, Uzbekistan, and even in the Xinjiang province of northwest China. The rubab was also the first instrument used in Sikhism. Bhai Mardana, a Muslim friend of the first guru, Guru Nanak, used to play it. Whenever a shabad (holy song) was revealed to Guru Nanak, he would sing it, and Bhai Mardana would play the rubab. He was known as a rababi. The tradition of playing the rubab is still carried on by Punjabi Sikhs and Muslims. == Variants == The seni rebab was first made during the Mughal Empire. It has a special hook at the back of its head, which makes it easy for musicians to carry it on their shoulders and play while walking. Another kind of Rubab, called the Punjabi rabab or 'Firandia' rabab, is popular in Punjab. In Tajikistan and northern Pakistan, there's a similar instrument called the rubab-i-pamir (Pamiri rubab). It looks a bit different, with a shallower body and neck and six gut strings. There's also one string attached partway down the neck, which is similar to the fifth string of the American banjo. == Shape and features == The rubab's body is made from one piece of wood, with a head that covers a hollow bowl where the sound comes from. The bridge sits on the skin and stays in place because of the tightness of the strings. It usually has three melody strings tuned in fourths, two or three drone strings, and sometimes up to 15 sympathetic strings. The instrument is usually made from the trunk of a mulberry tree, the head from animal skin like goat, and the strings from either the intestines of young goats (gut) or nylon. === Strings === English Explanation Pashto Persian Strings Main strings: 3 and made out of nylon Long Drone: 2-3 and made out of steel Short Drone: 2 and made out of steel تارونه Tāruna تار Tār First/Low/Bass String Low/Bass String is the thickest string کټی Katay ? Second String Thiner than bass string and thicker than high string بم Bam بم Bam Third/High String The thinest string out of all the three main strings زېر Zer زیر Zir == Size variants == English Strings Pashto Persian In Inches Small 5 sympathetic strings وړوکی رباب Warukay Rabab زيلچه Zaliche 27 Medium 19 strings, 13 sympathetic strings منځنۍ) رباب) (Mianzanai) rabab رباب Rubab 28 Large 21 strings, 15 sympathetic strings لوی رباب Large rabab شاه رباب (king size) Shah rabab 30 == References == Category:Musical instruments Category:Pakistani musical instruments",
 "title": "Rubab"
}