{
 "id": "1084757",
 "text": "In the middle of the 4th century BC, Maharaja Mahapadma Nanda of Magadha attacked vardhana and the Maharaja of Pundravardhana was defeated in that battle. As we know that Mahapadma Nanda was a Kshatriya Nidhana Vrathi. Hence Mahapadma Nanda came to be known as So at that time members of the Kshatriya class went to different places to escape from the hands of Mahapadma Nanda, the king of Magadha. Cultural: The study of the Rajbanshi community, states that they perform traditions of agriculture, dance, music, medical practice, song, architectural building, culture agreements and language translations. Rajbanshis are mainly Shivite and Vaishnava devotees, Durga Puja, Kali Puja, Saraswati Puja, Lakshmi Puja, Mansa Puja, Ganga Puja, Vishwa Puja, Tistaburi Puja, Yatra Puja, etc. Patriarchal family. Frog weddings held on the occasion of drought, lack of rain, etc. are one of the main religious ceremonies of Rajbansi. By profession, they are mainly farmers and believe in independent work. Independent-minded people. Surname: The surnames of Rajbanshis are - Ray, Singha Roy, Burma, Burman, Singh, Rajvanshi, Ghosh, Adhikari, Sarkar ,Sinha, Mitra etc. Foods: The Rajbanshi community was traditionally a largely agricultural community, mainly cultivating rice, pulses and maize. Rice is the staple food of most of the population. Even in the 21st century, a large part of this community still adheres to a rural lifestyle, although urbanization continues to increase. Assam, West Bengal, Nepal, and Bangladesh food and food styles are similar. Rice and pulses are eaten regularly along with vegetables and bhaji (fries – mainly potatoes). Usually vegetable preparations, mostly cooked with very little oil. Cooking is done mainly using mustard oil, although sometimes sunflower oil is used. In terms of non-vegetarian diet, the Rajbanshi population consumes a lot of meat and eggs compared to other neighboring communities of Bengal, who consume a lot of fish. Duck and chicken eggs are consumed. Home: A typical Rajbanshi house design is rectangular in pattern, with an open space (Agina) in the middle. This is mostly done to protect against wild animals and strong winds. Every Rajbanshi house has Mansa or Kali Tagore at the entrance. The north side has betel and fruit plantations, the west has bamboo plantations while the east and south are generally left open to allow sunlight and breeze to enter the house. However, such a pattern is more common among landed gentry. Clothing: Among the traditional clothes of Rajbanshis mainly women use sarees, chadars, etc. and men's traditional clothes are dhoti, punjabi, kurta, fatua, chadar. Although modern clothes are widely available. Music: Music is an integral part of royal culture. The main styles of music of Rajbanshi culture are Bhavaiya, Chatka, Chorchunni, Palatia, Lahankari, Tukkhaya, Bishahari Pala etc. Various instruments are used for such performances, stringed instruments like dotara, sarindra and bena, two-membrane instruments like tasi, dhak, khol, desi dhol and mridanga, kansi, khartal like ganga and bells and sanai, mouth flute and kupa- Wind instruments. Rajbansi people have their own language and culture. Their language is Kamtapuri-Rajbanshi language. Although the West Bengal government recognizes this language, it is still not listed in the Eighth Schedule of India. Their Bhavaiya music is one of the most famous music of India. From Cooch Behar, India, a periodical named Dotrar Dang in Rajbanshi language was published from 1417 Bengal. Rajbanshi Language Academy has been formed in West Bengal. Poetry, stories, songs written in Kamtapuri-Rajbanshi language are increasing. Rajbanshi songs have gradually become the heartbeat of the people of this area. These beautiful songs are played in all kinds of events of Rajbanshi. But now a day several modern songs have been created which are at the peak of popularity. Language: Now everything is proven through modern research that Kamrupi / Kamtapuri / Rajbanshi / Goalpariya / Rangpuri / Tajpuri / Suryapuri / Barendri / Bangakamrupi / Banga-Assamese language, the same language and different names are known in different places. That means Rajbanshi / Kamtapuri language is recognized as official language in West Bengal and Nepal. That is, Rajbanshi language now means international language. == References== *who are these people Category:Ethnic groups in India Category:Ethnic groups in Bangladesh Category:Nepali culture",
 "title": "Rajbanshi people"
}