{
 "id": "108477",
 "text": "Menopause is the time in a woman's reproductive life beginning one year after her last menstrual period. Once a woman has reached menopause she can no longer get pregnant. In the time leading up to menopause, she can have hot flashes and other physical symptoms. The time in the woman's life leading up to menopause is called perimenopause. Menopause happens between the ages of 45 and 55. Menopause can happen earlier if a woman has had treatment for cancer or an operation to remove both ovaries. Menopause can happen after surgery to remove the uterus. Menopause is the expected and natural and permanent stopping of menstruation. Female hormone levels change, since they were produced by the ovaries which have stopped ovulating. The female can no longer have children after this happens. The duration can depend on lifestyle factors such as smoking, age it begins, and race and ethnicity. During perimenopause, the body's production of estrogen and progesterone, two hormones made by the ovaries, varies greatly. == Before menopause == Signs of menopause may start suddenly or gradually. Signs can happen once in a while or most of the time. Some women have only a few signs of menopause. Having changes in periods and bad moods can happen before menopause. Periods may change in length or be longer or shorter. Periods may have a heavier or lighter flow. Before menopause a woman may have hot flashes or problems sleeping. A woman may be irritable or sex may be uncomfortable. Some women may have less interest in sex before menopause. Other changes might be less noticeable. This could be changes in bone thickness. === Hot flashes === Hot flashes are a quick feeling of heat and sweat in the chest area. Hot flashes are the most common sign of menopause. Three out of four women going through menopause have hot flashes. Some women have hot flashes while still having a period. During a hot flash the skin of the face and neck becomes red. Large red spots can apper on the arms, chest and back. A woman can sweat heavily during the hot flash. A woman can have cold chills after the hot flash. In most cases, the hot flashes are frequent in the year before periods stop and can still happen after periods stop. Hot flashes can still happen up to 14 years after menopause. === Vaginal problems === Vaginal dryness, may start before and after menopause. This happens because of lower levels of hormones. These lower hormone levels cause vaginal tissue to get thinner and drier. As the tissue changes it can cause burning, itching, discomfort and pain. Sex can be painful and cause small cuts. === Sleep problems === Some women start having sleep problems before and after menopause. This could be a problem getting to sleep. Sometimes this may mean waking up too early in the morning. Hot flashes and sweating might wake a woman up at night. After waking up at night there may be a problem falling back to sleep. Mood problems and depression can make it hard to sleep. === Mood changes === Some women feel irritable and short-tempered around the time of menopause. Other things can add to a bad mood. Stress, family changes, family problems can add to moodiness. It could be aging parents, a history of depression, or feeling tired. Talking with a doctor about this can help. There are treatments for irritability and moodiness. == After menopause == After menopause, a woman will have low hormone levels. The ovaries will make low amounts hormones estrogen and progesterone. Because of the low hormone levels, the risk for osteoporosis, heart disease and stroke increases. Menopause symptoms instead of period problems. A woman may still have hot flashes because of changing hormones. After menopause a woman may have vaginal dryness. == Treatment == There are medicines that can stop some hot flashes, and there are ways that hot flashes can be helped when they happen. Sometimes a doctor can order medication that has hormones in it. Sometimes a doctor will have a woman take birth control medicine. Other hormone medications are available for women who have gone through menopause and still have hot flashes. Other medicine that does not have hormones in it can help with the hot flashes. Some things make hot flashes worse. A woman may be told by the doctor to stop drinking alcohol and caffeine. In some women, spicy foods, stress or being in a hot place can make hot flashes worse. Drinking cold water can help with hot flashes. Women with hot flashes may be encouraged to layer clothing and remove a layer when having a hot flash. Using a fan can be helpful. Losing weight may help stop hot flashes. Vaginal dryness and thinning can be treated. A vaginal moisturizer can be used to help keep the vaginal tissue moisturized. It can make sex more comfortable. A vaginal lubricant can be used. This is a gel that also helps make sex more comfortable. A doctor may order medicine that can help with vaginal dryness. This may be hormonal birth control, menopausal hormone therapy, or a prescription estrogen cream, gel, or ring that is inserted into the vagina. Sleeping can be improved before and after menopause. To get better sleep a woman can: * Go to sleep at the same time each night. * Keep the bedroom at a comfortable temperature. * Not take naps during the day. * Not watch television, computer or cell phone in the bedroom. Light from these can make it hard to sleep. * Not exercise close to bedtime. * Not drink things that have caffeine in them. * Stop eating large meals close to bedtime. Drinking alcohol doesn't help a woman fall asleep or stay asleep. Counselling can help with sleep problems. ==Other websites== *Menopause; Food and Drug Administration * About Menopause, US Department of Health and Human Services National Institutes of Health *The Menopause Society ==References== Category:Female reproductive system Category:Endocrinology",
 "title": "Menopause"
}