{
 "id": "1085284",
 "text": "The Australian Science and Mathematics School (ASMS) is a mixed-gender public high school for grades 10-12, located at Flinders University in Adelaide, South Australia. It's open to students from anywhere, including overseas. The school focuses on getting students ready for university, especially in science and math, and uses a unique teaching approach that encourages students to love learning and manage their own education. == Overview == The Australian Science and Mathematics School (ASMS) is a public, coeducational high school for students in grades 10-12, located at Flinders University in Adelaide, South Australia. Open to students from all over, including internationally, it aims to prepare them for university, focusing on science and math. The school promotes self-directed learning and a passion for education among both students and teachers. === School Features === Opened in 2003, ASMS has around 380 students and doesn't enforce a uniform policy to encourage cultural and social diversity. It benefits from a strong partnership with Flinders University, sharing many facilities and resources like the library and cafeteria. The school also collaborates on research projects through the Science and Technology Enterprise Partnership (STEP). === Curriculum === ASMS specializes in science and mathematics but provides a broad curriculum that meets the South Australian Certificate of Education (SACE) requirements. It features interdisciplinary studies for younger students and standard subjects for Year 12. Notably, the school organizes a \"Field Trip Week\" for practical learning experiences. === Adventure Space/Passion Project === For Year 10 and 11 students, ASMS offers the Passion Project (previously called Adventure Space), allowing them to explore areas such as dance, robotics, and paleontology. These projects, while not graded, offer students a chance to delve into personal interests and engage with the university environment. Category:Schools in Australia",
 "title": "Australian Science and Mathematics School"
}