{
 "id": "1085651",
 "text": "Matthew Adam Garber (25 March 1956 – 13 June 1977) was a British child actor, best known for his role as Michael Banks in the classic Disney film Mary Poppins (1964). == Life and career == Matthew Garber was born on March 25, 1956, in Stepney, London, England. He attended the independent Highgate School in North London. Garber was discovered by theatrical agent Iris Burton while he was performing in the play The Snow Queen at the age of seven. Following this encounter, he began his acting career with several television appearances. Garber's breakthrough came when he was cast as Michael Banks in Disney's Mary Poppins alongside Julie Andrews and Dick Van Dyke. The film, directed by Robert Stevenson and based on the book series by P.L. Travers, became an instant classic and won five Academy Awards. Garber's portrayal of the mischievous yet endearing Michael Banks endeared him to audiences worldwide. == Later life and career == After the success of Mary Poppins, Garber reprised his role in the Disney film The Three Lives of Thomasina (1963), where he played the character Geordie McNab. However, he eventually decided to step away from acting to focus on his education. == Personal life and death == In his later years, Garber maintained a low profile and largely stayed out of the public eye. Tragically, at the age of 21, Garber contracted hepatitis while traveling in India. He was unaware of his condition until it had progressed to a critical stage. Despite receiving medical treatment, Garber's condition worsened, and he passed away on June 13, 1977. Matthew Garber's untimely death was met with shock and sadness by his family, friends, and fans. His contribution to the world of cinema, particularly his memorable performance in Mary Poppins, continues to be celebrated by audiences around the world. == Legacy == Matthew Garber's portrayal of Michael Banks in Mary Poppins remains iconic and has left an indelible mark on popular culture. The film's enduring popularity ensures that Garber's legacy lives on, as new generations continue to discover and enjoy his work. In recognition of his contribution to cinema, Matthew Garber was posthumously honored with retrospectives and tributes. His portrayal of Michael Banks remains beloved by audiences, making him an integral part of the magic of Mary Poppins and a cherished figure in the history of film. Category:1956 births Category:2009 deaths Category:British child actors",
 "title": "Matthew Garber"
}