{
 "id": "1085148",
 "text": "Eusthenopteron is an extinct genus of lobe-finned fish from the Late Devonian. Early depictions of Eusthenopteron show it emerging onto land; however, everyone now agrees that it is a strictly aquatic animal. Notably, it is one of the earliest sarcopterygians in which the humerus is preserved. Among the various species of this genus, the most popular is undoubtedly E. foordi. The species: * Eusthenopteron foordi (type species) * Eusthenopteron farloviensis * Eusthenopteron jenkinsi * Eusthenopteron obruchevi * Eusthenopteron savesoderberghi * Eusthenopteron traquairi * Eusthenopteron wenjukowi == Description == Eusthenopteron is a medium-to large-sized tristichopterid. E. foordi is estimated to exceed 1.5 m (4 ft 11 in), while E. jenkinsi probably reached 2.1 m (6 ft 11 in). The earliest-known fossilized evidence of bone marrow has been found in Eusthenopteron, which may be the origin of bone marrow in tetrapods. The most notable features of Eusthenopteron are the pectoral and pelvic fins. It had a large head with powerful jaws that could've been capable of biting prey. However, unlike the early tetrapods though, Eusthenopteron did not have larval gills. == Distribution == Finds have been made in Europe and North America. == Some species == Eusthenopteron foordi is a well-known species. The other species, however, are not well-known. === Eusthenopteron foordi === Eusthenopteron foordi is the type species of Eusthenopteron. It is the most famous and well-known species of Eusthenopterus. It is also one of the most scientifically important fossil vertebrates. === Eusthenopteron farloviensis === Eusthenopteron farloviensis is another species of Eusthenopteron. Like the other species except E. foordi, it is not well-known. === Eusthenopteron jenkinsi === Eusthenopteron jenkinsi is yet another species of Eusthenopteron. Little is known about this species. However, it may have been up to six feet long with a torpedo-shaped body and fangs. It was probably a large species for the Eusthenopteron. == Paleoecology == Eusthenopteron probably hunted other fish by setting ambushes on the seabed, where it rested with its robust fins. Although fleshy and particularly strong, it is in fact unlikely that they could take the animal out of the water. == What it ate == Eusthenopteron preyed on smaller fish. Its teeth were small yet sharp, and were used to nab prey as the lobe-finned fish swallowed them whole. == Out of water == Eusthenopteron was depicted hauling itself out of a pond, much like a mudskipper. However, no scientific evidence supports this. == Related pages == * Hyneria * Rhizodus * Pleuropholis * Eusthenodon * Cabonnichthys * Archaeolepidotus * List of prehistoric bony fish genera == References == # Downs, Jason P.; Daeschler, Edward B.; Long, Alison M.; Shubin, Neil H. (2018). \"Eusthenopteron jenkinsi sp. nov. (Sarcopterygii, Tristichopteridae) from the Upper Devonian of Nunavut, Canada, and a Review of Eusthenopteron Taxonomy\". Breviora. # Zylberberg, L., Meunier, F. J. and Laurin, M. 2010. A microanatomical and histological study of the postcranial dermal skeleton in the Devonian sarcopterygian Eusthenopteron foordi. Acta Palaeontologica Polonica 55: 459–470. # Schultze, H.-P. 1984. Juvenile specimens of Eusthenopteron foordi Whiteaves, 1881 (Osteolepiform rhipidistian, Pisces) from the Late Devonian of Miguasha, Quebec, Canada. Journal of Vertebrate Paleontology. 4: 1-16. # == Other websites == * Palaeos.com – Vertebrates – Sarcopterygii (archive) Category:Extinct fish Category:Lobe-finned fish Category:Devonian",
 "title": "Eusthenopteron"
}