{
 "id": "1085337",
 "text": "Jenadriyah, also known as the National Heritage and Culture Festival or Al- Janadriyah Festival (Arabic: مهرجان الجنادرية, romanized: Maharajān al- Janādrīyah) is a cultural heritage festival in the Kingdom of Saudi Arabia. A cultural heritage festival is a celebration where people come together to show and celebrate their history and action or way of behaving that is common among them. It has been celebrated in Saudi Arabia since the year 1985. Most of the times, it takes place in February or March during the Spring season. The festival is then celebrated for around 14 days (two weeks). People from both inside and outside Saudi Arabia come to see the festival. For 34 years, the Ministry of the National Guard organized the festival, but in July 2019, the duty was given to the Ministry of Culture. The festival shows a lot of things related to Saudi Arabia. A village is shown with old items, ornaments that people wear, for example rings, bracelets, and necklaces and tools used by Saudi people over fifty years ago as well as works of art. Each year, a different country is invited as a special guest. They are called the 'Guest of Honor'. Saudi Ministry of Culture invites them to see the festival's celebration. This also helps to make good relations with that country. The festival shows Saudi Arabia's culture and history. A large number of people from other countries or places come to see this. It is a place to make people learn about the country's old days and its people's way of life and to also increase Tourism. With its different types of activities and places of interest where tourists visit, the festival has become an important event for exchanging of cultures and understanding among nations. ==History== The first National Heritage and Culture Festival began on March 24, 1985, and was open until April 3, 1985. The main goal of the festival was to promote interest in Saudi heritage (something that is handed down from generation to generation), save it, and educate people about it. The festival showed different activities that showed the local environment, including old houses, markets, and old sets of tools from different regions of Saudi Arabia. Over half a million visitors came to saw the festival at the village which later became known as Al- Jenadriyah Village and the festival later became known as Al-Jenadriyah Festival. During the Sixth Jenadriyah Festival, there were poetry readings and meetings for discussion and training where people who write poetry took part. Around 290,000 people visited the book fair, and there were also theater performances that showed Saudi society's heritage. People enjoyed watching these traditional performances by folk groups from different places of Saudi Arabia. Additionally, sports events like horse racing, wheelchair race for disabled people and a camel racing competition were also started. Visitors also saw traditional Saudi activities like using a treadmill and pressing sesame plant which was done by rotating the camel around the juicer. The Jenadriyah Festival is celebrated once in a year but in 2018 on the order of King Salman bin AbdulAziz the festival was conducted two times, first time in February and second time in December. India was the Guest of Honor in February while Indonesia was the Guest of Honor in December. == Events and activities == The festival opens with an opening ceremony (held in celebration of the start of something); it then proceeds with various events, including: * Al Jenadriyah Operetta * Tourism area *Saudi Ardah * Government Pavilions * Provincial Pavilions * Companies and Corporate wings * Poetry Evenings * Heritage Village Activity *Camel racing * Horse racing * Dancing * Folk costumes *Book fair * Centre for documentation and pictures * 'Guest of Honor' country to participate in the festival. In 2018, the Republic of India participated in the 32nd Jenadriyah Festival. * Pavelion for 'Guest of Honor' country * Showing old crafts such as pottery, process of combining and organizing two different sets of yarns together to make fabric, process of making objects from wood and process of making objects from metals. ==References== ==Other websites== * Official website of the Festival Category:Festivals in Asia Category:Events Category:Saudi Arabian culture",
 "title": "Jenadriyah"
}