{
 "id": "1085762",
 "text": "James Thomas Kruger (20 December 1917 – 9 May 1987Donald Woods, Biko, p. 404) was a South African lawyer and politician of Welsh descent who was part of the conservative National Party government which championed apartheid. He rose to the position of Minister of Justice and the Police in the cabinet of Prime Minister John Vorster from 1974 to 1979. He was also President of the Senate of South Africa from 1979 until 1980, when it was abolished. ==Background== Kruger was born in Bethlehem, Orange Free State, South Africa of Welsh parents and was adopted by Afrikaner parents. After he graduated from high school in Ventersdorp, he first became a miner. He trained as a surveyor at a gold mine in Brakpan before taking an exam as a mining surveyor. Later he would work as surveyor engineer in Barberton. ==Education== Kruger studied part-time for an Afrikaans teaching degree from the University of South Africa (UNISA) and later attended the University of the Witwatersrand where he got a law degree in 1954. He began practising as a lawyer in 1955. ==Political career== In 1962 he became a member of the Transvaal Provincial Council. As National Party candidate, he became a member of the House of Assembly in the Parliament of South Africa from 1966. In 1972, Kruger was made a deputy cabinet minister for the police, health and welfare. In 1974 he was made a full Minister of Police, Prisons and Justice. In June 1979, the ceremonial position of President of the Senate of South Africa but retired in 1980 when the Senate was abolished. === Steve Biko === As Minister of Police, Prisons and Justice, Kruger was responsible for the banning of the anti-apartheid activist and Black Consciousness Movement leader Steve Biko. Banning was a form of punishment used by the South African apartheid government, in which the person was forbidden to leave the area where he or she lived, forbidden to talk to the media, or was under house arrest. When Biko died after he was arrested by the police, the police said that he had died during a hunger strike, but Biko actually died after he was tortured by the police.Biko, p. 213 When this was challenged by the liberal white South African journalist Donald Woods, a personal friend of Biko, Kruger also had him banned.Donald Woods, South African Dispatches, pp. 167-168 Woods and his family fled the country for exile in England. When the actual cause of death of Biko became known, it caused an international scandal, and the South African government was embarrassed and put all the blame on Kruger. In 1980, the government ordered him to resign, and he lost not only his cabinet position, but his membership of the National Party, as well. In 1982, Kruger joined the newly founded hardline pro-apartheid Conservative Party of Andries Treurnicht in protest against the racial reforms of the National Party under the P. W. Botha Government. ==Marriage== Kruger was married to Susan Kruger after whom the Robben Island ferry the Susan Kruger was named in 1977.Truth And Lies: Stories From The Truth And Reconciliation Commission In South Africa ==Death== Kruger died at his home in Irene after recently having heart surgery. He was survived by his wife, Susanna and two sons, Eugene and Eitel. ==Cultural references== In the movie Cry Freedom (1987), which was based on Woods's role in the anti- apartheid struggle, Kruger was played by English actor John Thaw. In the movie Goodbye Bafana (2007), Kruger was played by South African actor Norman Anstey. ==References== Category:1917 births Category:1987 deaths Category:Welsh people Category:Afrikaner people Category:Calvinists Category:South African lawyers Category:South African politicians Category:People associated with Apartheid",
 "title": "Jimmy Kruger"
}