{
 "id": "1085646",
 "text": "Povel Ramel (June 1, 1922 - June 4, 2007), was a Swedish entertainer, composer, singer, actor and author. == Biography == === Early life === Ramel was born in Stockholm to Märta Tesch and Karl Ramel. His parents died due to a car crash in 1937, and then Ramel lived with his aunt while he studied. When he was 17 years old, he directed and wrote his first revue.https://www.allas.se/noje/16-ar-sedan-povel-ramel-dog-sa-har-minns-vi- honom/121099 The same year he was on a trip to London where the British music inspired him, with artists like Harry Roy and Billy Cotton.https://povelramelsallskapet.se/index.php?action=m2&id;=1&tema1;=Apropovel&tema2;=Biografi === Early career === Povel Ramel did get a little bit famous when the singer Alice Babs did a cover on Vårt eget Blue Hawaii, which Ramel had written. The real breakthrough was in 1944, when his work Johanssons Boogie Woogie vals got very popular.https://www.aftonbladet.se/nyheter/a/BJx2JE/povel-ramel-dod A year later Per-Martin Hamerg hired him to the biggest radio station in Sweden. There Ramel did humorous programs. He also met his future wife, Susanna Ramel, when he worked for the radio station. The reviewers in the local newspaper didn't like Ramel's jokes and songs, but the listeners liked him. === Knäppupp === With Felix Alvo, Ramel did found Knäppupp AB in 1952, a company who wrote and composed revues. The first year the company features their first revue, called Akta huvet. It premiered at Cirkus in Gothenburg, and in the following 16 years Knäppupp produced, wrote, and composed many revues. The company also directed and wrote movies, such as I rök och dans (1954), Hoppsan (1955) and Ratataa (1956). In 1969, the whole area Knäppupp used to work at was demolished, and soon after Knäppupp's activity stopped. Their last revue was De sista entusiasterna from 1968. === Late career === The Norwegian singer Wenche Myhre launched a cooperation in the late 1960s. Together they acted in the revue Pow Show in 1969. The sequel POW Show II - Andra varvet runt later premiered in 1974. Ramel later acted in the TV-series Semlons gröna dalar (1977) and Affären Ramel (1986). New revues was written and composed by Ramel in the 1980's and 1990's, such as Minspiration (1981), Tingel Tangel på Tyrol 1989 (with the swedish actor Hans Alfredson), Knäpp igen (1992) and Kolla klotet! (1996) (written together with the swedish actor Thomas von Brömssen). In the 2000's Ramel was getting more and more inactive, and his last revue Povel á la carte premiered in 2005. === Death and health problems === When Ramel only was two years old, in 1924, he stepped on a nail at a beach in Belgium. He had to get surgery in Bruges. Ramel was in the hospital in three weeks. The surgery failed and he almost died. The damage on the foot did stop, but he had surgery as an adult too.https://www.femina.se/kultur/povel-ramel- om-sin-dolda-sorg-kan-inte-bli-javligare/8529595 In spring 2007 Ramel had emergency heart problems and had to get a pacemaker. A month later he got more sick again, and he died 4 June, 2007.https://www.expressen.se/nyheter/povel- ramel-ar-dod/ == After death == Shortly after Povel's death, his fan-club Povel Ramel-sällskapet was founded. This was on 13 October 2008.https://povelramelsallskapet.se/index.php?action=m2&id;=1&tema1;=OmSallskapet&tema2;=OmSallskapet In 2022, a statue of Ramel in bronze, designed by Lasse Åberg, was built. Now it stands outside Cirkus in Stockholm. == Other works == Ramel has a career as an author and in 1945, he published his first book Från Asar till Wasar. His career as an actor has lasted for long, for more than 50 years. === Select bibliography === * Från Asar till Wasar (1945) * Min galna hage (1957) * Lingonben (1978) * Min ordkynniga penna (1987) * Följ mig bakåt vägen (1992) * Som om inget hade hänt (1999) === Select filmography === * Tre söner gick till flyget (1945) * Ung och kär (1950) * Puck heter jag (1951) * Oss fakirer emellan (1951) * I dur och skur (1953) * I rök och dans (1954) * Hoppsan! (1955) * Ratataa (1956) * Kortknäpp (1957) * Den store amatören (1958) * Falsk som vatten (1985) * Tarzan (1999) === Karamelodikt-scholarship === In 1983, Ramel invented the Karamelodikt-scholarship, in Sweden known as Karamelodikt- stipendiet. It is handed out every year to Ramel's honor.https://www.dn.se/pa- stan/karamelodiktstipendiet-delas-ut/ == References == Category:2007 deaths Category:1922 births Category:Entertainers Category:People from Stockholm",
 "title": "Povel Ramel"
}