{
 "id": "1085274",
 "text": "Moroccans () are the citizens and nationals of the Kingdom of Morocco. The country's population is predominantly composed of Amazigh (the indigenous people of North Africa),https://www.iwgia.org/en/morocco.html and Arabs, who arrived in Morocco in the 7th century during the Islamic conquests.https://joshuaproject.net/people_groups/13819/MO Notable Berber tribes in Morocco include the Baranis and the Masmuda,https://books.google.co.uk/books?id=pQcVAAAAIAAJ&pg;=PA741&dq;=baranis+morocco&hl;=en&newbks;=1&newbks;_redir=0&source;=gb_mobile_search&sa;=X&ved;=2ahUKEwjkxsbro7iEAxWXW0EAHaTMCvE4ChDoAXoECAYQAw#v=onepage&q;&f;=false while Arab tribes include the Banu Ma'qil and the Rahamna.https://www.rhamna.net/archives/205https://fanack.com/morocco/population- of-morocco/rehamna-in-morocco-the-vessel-of-bedouin-life/ Moroccans speak Berber varieties which make 26% of the population of Morocco, either as a first language or bilingually with Arabic. Three different Berber dialects are spoken: Tarifit, spoken by 1.27 million mostly in the Rif mountains, Shilha, spoken by 3 to 4.5 million mostly in the Anti-Atlas mountains, and Central Atlas Tamazight, spoken by 2.3 million mostly in the Middle Atlas. Hassaniya Arabic is spoken in the southern part of the country, spoken by over 200,000 people. Almost all Moroccans follow the religion of Islam. According to WorldAtlas, 30% of Moroccans are non-denominational Muslims, while two-thirds belong to the Sunni denomination. https://www.worldatlas.com/articles/religious-beliefs-in- morocco.htmlhttps://www.originaltravel.co.uk/travel-guide/morocco/culture Other minority religions include Christianity, Judaism and Bahá'ísm.https://www.originaltravel.co.uk/travel-guide/morocco/culture Culturally, Moroccans practice the folklore equestrian tradition of tbourida.https://www.researchgate.net/publication/349573357_Human- Horse_Relationships_in_Morocco_What_Equids_Can_Tell_Us_About_Society ==References==",
 "title": "Moroccans"
}