{
 "id": "1085055",
 "text": "Polish cuisine is a style of food preparation originating in and widely popular in Poland. Due to Poland's history, Polish cuisine has evolved over the centuries. It has borrowed many other national cuisines. Polish cuisine is rich in meat, especially pork, chicken and game, and a wide range of vegetables, spices, fungi and mushrooms, and herbs. Polish Meals – Polish Food – Polish Cuisine . Retrieved 6 June 2011. There are a lot of different kinds of pasta, cereals, grains and pulses.Kasha, extended definition by Webster's Online Dictionary. Retrieved 6 June 2011. Polish cuisine makes extensive use of butter, cream, eggs, and seasoning. Traditional dishes often need a lot of preparation. Many Poles take time to serve and enjoy their festive meals, especially Christmas Eve dinner () on December 24, or Easter breakfast, both of which could take several days to prepare. Among popular Polish national dishes are , , , (pork loin breaded cutlet), (stuffed cabbage leaves), (roulade), (sour cucumber soup), (mushroom soup), (tomato soup),\"Always home- made, tomato soup is one of the first things a Polish cook learns to prepare.\" [in:] Marc E. Heine. Poland. 1987 (meat broth), (sour rye soup), (tripe soup), and red beetroot soup .\"Tu się w lasy schroniły wygnane ze zbytkowych stołów, narodowe potrawy, Barszcz, Bigos, Zrazy, Pirogi i Pieczeń\" [in:] Jan N. de Bobrowicz. Maxymilian arcyksiąże Austryacki obrany Król polski. 1848. s. 74; \"barszcz, rosół, sztuka mięsa, pieczenie huzarskie, bigos, pierogi, kiełbasa z kapustą, przede wszystkim zaś rozmaite kasze\" Zbigniew Kuchowicz Obyczaje staropolskie XVII-XVIII wieku. 1975; \"pieczeń cielęca pieczona (panierowana), pieczeń cielęca zapiekana w sosie beszamelowym, pieczeń huzarska (=pieczeń wołowa przekładana farszem), pieczeń rzymska (klops), pieczeń rzymska (klops z cielęciny) w sosie śmietanowym, pieczeń rzymska z królika \" [in:] Stanisław Berger. Kuchnia polska. 1974.; Polish Holiday Cookery by Robert Strybel. 2003 A traditional Polish dinner has three courses, beginning with a soup. In restaurants, soups are followed by an appetizer such as herring (prepared with either cream, oil, or in aspic), or other cured meats and chopped raw vegetable salads. The main course usually includes meat, such as a roast, breaded pork cutlet, or chicken, with a coleslaw-like (), shredded root vegetables with lemon and sugar (carrot, celeriac, cooked beetroot), sauerkraut, or salad. The side dishes are usually boiled potatoes, grain, or less commonly, rice. Meals often end with a dessert of either a fruit compote, a pastry, cream pie, mille-feuille, or cheesecake. If a Polish culinary tradition is used in other cuisines, it is referred to as à la polonaise, from the French, meaning 'Polish-style.' In French cuisine, this term is used for techniques like using butter instead of cooking oil; frying vegetables with buttered breadcrumbs; using minced parsley and boiled eggs (Polonaise garnish); and adding horseradish, lemon juice, or sour cream to sauces like velouté. ==References==",
 "title": "Polish cuisine"
}