{
 "id": "1085626",
 "text": "The 2025 FIA Formula 2 Championship is a planned motor racing championship for Formula 2 cars sanctioned by the Fédération Internationale de l'Automobile (FIA). The championship will be the fifty-eighth season of Formula 2 racing and the eighth season run under the FIA Formula 2 Championship moniker. It is an open-wheel racing category serving as the second tier of formula racing in the FIA Global Pathway. The category will be run in support of selected rounds of the 2025 Formula One World Championship. As the championship is a spec series, all teams and drivers competing in the championship will run the same car, the new Dallara F2 2024. == Entries == The following teams are scheduled to compete in the 2025 Formula 2 Championship. As the championship is a spec series, all teams will compete with an identical Dallara F2 2024 chassis with a V6 turbo engine developed by Mecachrome. All teams will compete with tyres supplied by Pirelli. Entrant Driver name Invicta Racing 1 Leonardo Fornaroli 2 Roman Staněk Campos Racing 3 Pepe Martí 4 Arvid Lindblad MP Motorsport 5 Oliver Goethe 6 Richard Verschoor Hitech TGR 7 Luke Browning 8 Dino Beganovic Prema Racing 9 Sebastián Montoya 10 Gabriele Minì DAMS Lucas Oil 11 Jak Crawford 12 Kush Maini ART Grand Prix 14 Victor Martins 15 Ritomo Miyata Rodin Motorsport 16 Amaury Cordeel 17 Alex Dunne AIX Racing 20 Joshua Dürksen 21 Cian Shields Trident 22 Sami Meguetounif 23 Max Esterson Van Amersfoort Racing 24 John Bennett 25 Rafael Villagómez === Team changes === Hitech Grand Prix and Toyota Gazoo Racing's TGR-DC junior programme will form a new collaboration in 2025, entering under the Hitech TGR guise. == Race calendar == The championship is scheduled to visit the same 14 destinations as the year before. Round Circuit Sprint race Feature race 1 Albert Park Circuit, Melbourne 15 March 16 March 2 Bahrain International Circuit, Sakhir 12 April 13 April 3 Jeddah Corniche Circuit, Jeddah 19 April 20 April 4 Imola Circuit, Imola 17 May 18 May 5 Circuit de Monaco, Monaco 24 May 25 May 6 Circuit de Barcelona-Catalunya, Montmeló 31 May 1 June 7 Red Bull Ring, Spielberg 28 June 29 June 8 Silverstone Circuit, Silverstone 5 July 6 July 9 Circuit de Spa- Francorchamps, Stavelot 26 July 27 July 10 Hungaroring, Mogyoród 2 August 3 August 11 Monza Circuit, Monza 6 September 7 September 12 Baku City Circuit, Baku 20 September 21 September 13 Lusail International Circuit, Lusail 29 November 30 November 14 Yas Marina Circuit, Abu Dhabi 6 December 7 December == References == Category:FIA Formula 2 Championship seasons 2025 Formula 2 Championship FIA Formula 2 FIA Formula 2 Championship",
 "title": "2025 Formula 2 Championship"
}