{
 "id": "1085764",
 "text": "The Austrian U-19 national football team is the national under-19 football team of Austria. The team is controlled by the Austrian Football Association. Players who have not yet reached the age of 19 and have Austrian citizenship are allowed to play. == Participation in European Championships == Year Host Result 1981 Germany Preliminary round 1982 Finland Preliminary round 2003 Liechtenstein Semifinals 2006 Poland Preliminary round 2007 Austria Preliminary round 2010 France Preliminary round 2014 Hungary Semifinals 2015 Greece Preliminary round 2016 Germany Preliminary round 2016 Slovakia 6th place ==Squad 2023-24== Name Position Club Kenan Jusic Goalkeeper FK Austria Wien Benjamin Göschl Goalkeeper SK Rapid Wien Elias Lorenz Goalkeeper SK Sturm Graz Valentin Oelz Goalkeeper FC Liefering Luca Pazourek Goalkeeper FK Austria Wien Jakob Schöller Defender FC Admira Wacker Mödling Matteo Schablas Defender FC Liefering David Puczka Defender FC Admira Wacker Mödling Marcel Moswitzer Defender FC Liefering Dejan Radonjic Defender FK Austria Wien Alparslan Baran Defender FC Liefering Yanis Eisschill Defender LASK Wenzel Lindmoser Defender SK Rapid Wien Adrian Koreimann Defender FC Admira Wacker Mödling Tobias Gruber Defender Wolfsberger AC Zeteny Jano Midfielder FC Liefering Diego Madritsch Midfielder SV Ried Tim Trummer Midfielder FC Liefering Sanel Saljic Midfielder FK Austria Wien Tristan Osmani Midfielder FC Schalke 04 Dominik Lechner Midfielder FC Liefering Benedict Scharner Midfielder SKN St. Pölten Mücahit Ibrahimoglu Midfielder SK Rapid Wien Filip Milojevic Midfielder Bayer 04 Leverkusen Oluwaseun Adewumi Midfielder Floridsdorfer AC Jonas Löcker Midfielder SK Sturm Graz Valentin Sulzbacher Midfielder FC Liefering Yannick Maierhofer Midfielder FC Admira Wacker Mödling Efekan Karayazi Midfielder Fenerbahce Istanbul Furkan Dursun Forward SK Rapid Wien Moritz Neumann Forward FC Liefering Stefan Kordic Forward SV Ried Kevin Lebersorger Forward VfL Wolfsburg Leon Grgic Forward SK Sturm Graz Jovan Zivkovic Forward SK Rapid Wien ÖFB Homepage ==References == ̪ Category:European national football teams Category:National under-19 football teams Category:Football in Austria Category:20th-century establishments in Austria Category:National sports teams of Austria",
 "title": "Austria national under-19 football team"
}