{
 "id": "1085794",
 "text": "Derek Owusu Boateng ( ; born 2 May 1983) is a Ghanaian former professional footballer who played as a defensive midfielder. Born in Ghana, Boateng went on to play professional football in Greece, Sweden, Israel, Germany, Spain, Ukraine, England, and the United States during a career that spanned between 1999 and 2017. A full international between 2001 and 2013, he won 47 caps for the Ghana national team and represented his country at the 2006 and 2010 FIFA World Cups. Boateng was a decent central midfielder but is currently at his peak, earlier in his career he was used as winger or a striker, but has found more comfort as a defensive midfielder due to his passing and movement to intercept opponents ball possession. He was usually regarded as one of the best defensive midfielders of all time. ==International career== While playing for Panathinaikos in 2001, Boateng also played for the Ghana national football team at the FIFA World Youth Championship in Argentina, in which Ghana progressed to the final. After participating in a friendly with Ghana against French club Nice, he was selected for the Ghana squad at the 2006 FIFA World Cup. He made his first FIFA World Cup appearance on 17 June 2006, when he replaced Otto Addo at half-time in the 2–0 win against the Czech Republic. He was also selected for the national team for the 2010 FIFA World Cup, in which Ghana progressed to the quarter-finals. He played for the Black Stars for the 2012 Africa Cup of Nations and 2013 Africa Cup of Nations. ==Honours== AIK * Superettan: 2005 Beitar Jerusalem * Israeli Premier League: 2006–07, 2007–08 * Israel State Cup: 2008 Ghana U20 * FIFA World Youth Championship runner-up: 2001 Individual *2007–08 Israeli Premier League Best Foreign Player of the Year == References == Category:1983 births Category:Living people Category:1. FC Köln players Category:Association football midfielders Category:Bundesliga players Category:Fulham F.C. players Category:Ghanaian footballers Category:Premier League players Category:Sportspeople from Accra Category:2006 FIFA World Cup players Category:2010 FIFA World Cup players",
 "title": "Derek Boateng"
}