{
 "id": "1085261",
 "text": "Butch Cassidy (born Robert LeRoy Parker; 1866-1908) was a famous outlaw in the American Wild West. He led the Wild Bunch gang, the largest and best-known group of outlaws in the western United States. They became infamous for committing daring stagecoach, train, and bank robberies throughout various Western states. Pursued by the Pinkerton Detective Agency for more than a decade, Cassidy and his longtime partner, Harry Longabaugh (also known as the Sundance Kid), fled to South America in 1901. Seven years later, they were killed in a shootout with lawmen. Butch Cassidy and the Wild Bunch gang quickly became a legend in the United States. Their story has been heavily featured in American literature and film. == Early life == Butch Cassidy was born Robert LeRoy Parker on April 13, 1866 in Beaver, Utah Territory. His parents, Maximillian Parker and Ann Campbell Gillies, were English immigrants. Maximillian was one of the first Mormon emigrants to the Utah Territory, and Cassidy was raised Mormon, but was not particularly religious. He was the oldest of 13 children, and his family struggled financially. Cassidy attended school sporadically, and often got into trouble for fighting and stealing. He left home for the first time at age 13 and worked on a nearby ranch to earn money for his family. He ran away from home several times and worked as a farmhand, a cowboy, a butcher, and a miner. He also traveled to different states, such as Colorado, Wyoming, and Montana, where he encountered the lawless frontier life. Cassidy was influenced by his grandfather, who was a pioneer and a scout, and his father, who was a rancher and a hunter. They taught him to ride, shoot, and track animals. He also developed a love for reading and adventure stories. == First crimes == Cassidy's criminal career began in his late teens when he started stealing (\"rustling\") cattle and horses. In 1884 he was arrested for the first time and charged with stealing a saddle in Lander, Wyoming. He was acquitted by a sympathetic jury, but he decided to change his name to Butch Cassidy to avoid further trouble. He took the name Butch from his previous occupation as a butcher, and Cassidy from his friend and mentor Mike Cassidy, a notorious cattle rustler and outlaw. Cassidy soon formed friendships with other young outlaws and became involved in more serious crimes, such as train and bank robberies. He committed his first major robbery in 1889, when he and three other men robbed the San Miguel Valley Bank in Telluride, Colorado. They escaped with $21,000, which was a huge sum at the time (equaling around $718,557 in 2023 dollars). Cassidy used his share of the money to buy a ranch near Dubois, Wyoming, where he tried to live a respectable life. However, he soon returned to crime, as he found ranching boring and unprofitable. Between 1894 and 1896, Cassidy was imprisoned in Wyoming for horse theft. After being released, he quickly returned to his life of crime. == The Wild Bunch gang == In 1896 Cassidy met his most loyal and famous partner, Harry Longabaugh (also known as the Sundance Kid). They became friends and joined forces to rob banks and trains. They also recruited around 20 other outlaws, such as Elzy Lay, Ben Kilpatrick, Harvey Logan, Will Carver, and George Curry, to form the Wild Bunch gang (also called the Hole in the Wall gang). The gang, named for their unpredictable and often violent behavior, became notorious for their daring robberies across the western United States. They operated in several states, including Utah, Wyoming, Idaho, Montana, South Dakota, and Nevada. They carried out numerous heists, targeting banks, trains, and even mining payroll shipments. Also called the Hole in the Wall Gang, they used remote hideouts like Hole in the Wall Pass in Wyoming and the Robbers Roost in Utah to plan their heists and evade the law. === Major heists === On July 14, 1898, the Wild Bunch robbed Southern Pacific passenger train No 1. and escaped with $26,000 (worth about $890,622 in 2023 dollars). The following year, on June 2, 1899 near Wilcox, Wyoming, the Wild Bunch robbed a Union Pacific Railroad Overland Flyer train carrying $50,000 in cash and valuables. The Wilcox train robbery was one of the most spectacular and daring robberies in the history of the West. The gang used dynamite to blow up a railcar, and also exchanged gunfire with the train crew and some passengers who tried to stop them. They escaped with $30,000 (worth about $1,026,510 in 2023 dollars), leaving behind $20,000 that was too heavy to carry. The Wilcox train robbery triggered one of the largest manhunts in the history of the West. The Union Pacific Railroad hired the Pinkerton Detective Agency to track down and capture the robbers. On August 29, 1900, Wild Boys robbed Union Pacific train No. 3 out of Tipton, Wyoming, taking the enormous sum of $55,000 ($1,884,935 in 2023 dollars). The following month, they robbed the First National Bank in Winnemucca, Nevada, stealing $32,640 ($1,117,622.88 in 2023 dollars). === The Pinkertons === Like the Union Pacific, other railroads and banks that the gang had robbed repeatedly hired the Pinkerton Detective Agency to track down the Wild Bunch gang. The Pinkertons pursued Cassidy and the rest of the gang for more than a decade, from 1896 to 1908, but were never successful in apprehending them. ==== History and methods ==== Founded by Allan Pinkerton in 1850, the Pinkerton Detective Agency became one of the most powerful and influential private detective agencies in the world. The Pinkertons specialized in solving crimes, protecting clients, and hunting down outlaws. Their motto was \"We Never Sleep\", and their logo was an eye, symbolizing their vigilance and surveillance. Subsequently, private detectives were nicknamed \"private eyes\" as a reference to this logo. The Pinkertons were notorious for their ruthless and violent methods, such as infiltrating gangs, setting traps, staging ambushes, and shooting to kill. They were also accused of violating civil rights, such as breaking into homes, torturing suspects, and bribing witnesses. They were feared and hated by many people, especially the outlaws and the labor unions, who saw them as agents of oppression and corruption. ==== Pursuit of the Wild Bunch gang ==== Led by Joe Lefors, the Pinkertons tracked the Wild Bunch across several states, using bloodhounds, telegraphs, informants, and even handwriting analysis. They also offered large rewards for the capture or death of gang members. Offering $10,000 at one point, the Pinkertons distributed wanted posters and brochures featuring gang members' descriptions and photographs. After the 1900 Wilcox train robbery, the gang managed to elude the Pinkertons for several months, using disguises, aliases, and decoys. They also split up and regrouped at different locations, such as Fort Worth, Texas and Winnemucca, Nevada. There they committed more robberies. They also sent taunting letters and photographs to the authorities, mocking their efforts to catch them. However, on November 21, 1900, five members of the Wild Bunch gang (thought to be Will \"News\" Carver, Harvey Logan (Kid Curry), Ben Kilpatrick (the Tall Texan), the Sundance Kid, and Butch Cassidy) posed for a rare photograph. The Pinkertons later named this photograph \"the bad luck photo... because it led to the gang's downfall.\" The photo was widely distributed across the United States, and Carver, Logan, Kilpatrick, and various other gang members were eventually captured. The Pinkertons came close to catching Butch Cassidy and the Sundance Kid several times, but the two outlaws always managed to escape or fight back. However, their pursuit forced Cassidy and his gang to constantly evade capture and move from place to place. == Escape to South America == Faced with increasing pressure from law enforcement, Cassidy, along with the Sundance Kid (Harry Longabaugh) and Ethel \"Etta\" Place, fled to South America. Traveling under the aliases of James Ryan, Harry A. Place, and Mrs. Place, they left from New York City on February 20, 1901 aboard the British steamer Herminius. They arrived in Buenos Aires on March 9, 1901, and took a train to San Antonio de los Cobres, where they bought four mules and a wagon. Next they traveled south to Cholila in Patagonia, a remote and scenic valley in the Andes Mountains. There they bought a 15,000-acre, 4-room ranch, where they raised cattle and horses. In Cholila, Cassidy, the Sundance Kid, and Etta Place befriended the local settlers and the native Tehuelche people, who called them \"the three gringos\". They lived peacefully and comfortably for four years, enjoying the natural beauty and the simple life of the Patagonia. They also made occasional trips to other towns and cities, such as Bariloche, Esquel, and Buenos Aires, where they spent some of their stolen money. == Discovery and death == This idyllic life in Argentina came to an end in 1905, when the Pinkertons and the Argentine police discovered their whereabouts and raided the trio's ranch. Cassidy, the Sundance Kid, and Etta Place all managed to escape, but they had to abandon their ranch and most of their belongings. After their escape, the trio resumed their outlaw activities, robbing banks and trains in Argentina, Chile, and Bolivia. Later, in 1907, Cassidy and the Sundance Kid parted ways with Etta, who returned to the United States and never saw them again. The circumstances surrounding Butch Cassidy's death remain shrouded in mystery and speculation. According to Pinkerton agents, a group of Bolivian soldiers on horseback trapped Cassidy and the Sundance Kid near San Vicente, Bolivia, where Sundance was fatally shot and Cassidy shot himself. Another story claims that the two outlaws were killed by soldiers in December 1911 during a bank robbery in Mercedes, Uruguay. Not everybody believes that Cassidy died in South America. Some stories claim that Cassidy (either alone or with the Sundance Kid) returned to the United States and then drifted around, traveling as far south as Mexico and as far north as Alaska. According to these stories, he died unnoticed in 1937, either in the northwestern United States, Nevada (possibly Johnny, Nevada), or Spokane, Washington. == Legacy == Cassidy was known for his charisma, intelligence, leadership skills, humor, generosity, and compassion. He avoided killing people during his robberies, and often shared his loot with the poor and the needy. He also had a code of honor, and never betrayed his friends or partners. He was respected and admired by many people, including some lawmen and journalists. After a story circulated that he had returned stolen money to a widow, Cassidy acquired the nickname \"Robin Hood of the West\". Cassidy's story was featured in countless dime novels (inexpensive books that were widely sold throughout the United States), which helped spread his story across the country. He has also been the subject of many stories about the Wild West, movies, and TV shows. In 1903, the wildly popular movie The Great Train Robbery became one of the first motion pictures to tell a complete story. Later, the 1969 movie Butch Cassidy and the Sundance Kid won four Academy Awards and became a classic in American film. == References == Category:1866 births Category:1908 deaths Category:American criminals",
 "title": "Butch Cassidy"
}