{
 "id": "1086911",
 "text": "Anthony Gildas Kofi Annan (born 21 July 1986) is a Ghanaian professional footballer who plays as a midfielder. The midfielder was versatile and had his strengths primarily in defense. He was characterized by pundits as a hard- working midfielder who could mark opponents very well and block any shots, he was commonly considered as one of the greatest Ghanaian defensive midfielders of all time. ==Club career== Annan played for Sekondi Hasaacas until 2005 and then moved to league rivals Hearts of Oak SC, Annan was regarded as the best young midfielder in Ghana. He combined midfield artistry with some goal scoring skills, and endeared himself to many football fans in Ghana. In January 2007 he was signed by the Norwegian first division club Start Kristiansand and made eleven appearances for the club in his first season. At the end of the season, the club finished second to last in the table and was relegated to the Adeccoligaen. Annan joined the Stabæk Fotball club for the 2008 season, with whom he immediately became Norwegian champions. He then moved to Norwegian record champions Rosenborg Trondheim for three seasons; the transfer fee for him was around 1.2 million euros. At Rosenborg BK, Annan developed into a top performer for the team that won the title twice. In January 2011, Annan moved to the Bundesliga for FC Schalke 04, with whom he signed a contract until the summer of 2014. In Gelsenkirchen, Annan was supposed to replace midfielder Ivan Rakitić, who had moved to Spain. He played nine Bundesliga games in the second half of the season for Schalke. At the end of the season he won the DFB Cup with the team. Along with Ali Karimi and Angelos Charisteas, Annan was one of the much criticized and unnecessary transfers made by then head coach Felix Magath. After Magath's dismissal, the squad began to be reduced in order to save personnel costs. Annan was one of the players eliminated. In August 2011 he was loaned to the Dutch first division club Vitesse Arnheim for one year. Although he played regularly in Arnhem, both clubs could not agree on a transfer. After the loan ended, Annan returned to Gelsenkirchen. In August 2012 he was loaned out again for the 2012–13 season, this time to Spanish first division club CA Osasuna. Here, however, he was mostly just a substitute player and returned to Schalke at the end of the season. Since his contract expired at the end of the 2013/14 season and there were no concrete offers for Annan, he was relegated to the second team, which competed in the fourth-tier Regional Football League West. Due to a severe shortage of personnel in the Schalke squad (13 players were missing due to injuries), Annan returned to the professional team in the second half of the season. He made his first appearances for Schalke in almost three years, including the second leg of the round of 16 in the Champions League against Real Madrid. After Annan's contract, which expired in June 2014, was not extended beyond the previous contract period, he joined the Finnish first division club HJK Helsinki with a contract until the end of 2014. He made his league debut on September 12, 2014 (27th matchday) in a 2-2 home game against Kuopion PS, coming on as a substitute for Teemu Tainio in the 58th minute. During the 2014/15 winter break, Annan moved to German second division club TSV 1860 Munich on a free transfer. His contract ended at the end of the season. After a short period of being without a club, Annan first moved back to Norway to Stabaek IF and then back to HJK Helsinki in February 2016. In 2019 he was under contract with Beitar Jerusalem for six months and with Inter Turku from August 2019 to the end of 2021. ==International career== Annan represented his country several times at junior level and was also used in Ghana's Olympic team. On March 20, 2007, he was invited to Ghana's senior national team for the first time as a replacement for the injured Michael Essien and made his debut in the friendly against Brazil (final score 0-1) on March 27 at Råsundastadion. He was named to the 23-man squad for the 2008 Africa Cup of Nations in his own country. He made his first tournament appearance in the last group game against Morocco and then played on the left side of defense in all three final round games. Ghana finished the tournament in third place. In the following African Championships in Angola in 2010, he won the runner-up title with Ghana. At the 2010 World Cup in South Africa, Annan played all five tournament games in his team's defensive midfield, mostly alongside Kevin-Prince Boateng. In the official tournament report, Annan was named one of Ghana's four outstanding players by the Technical Study Group (TSG) and was praised for his good overview of the game and his confident passing game. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League Cup League Cup Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Start 2007 Tippeligaen 11 0 0 0 — 11 0 Stabæk 2008 Tippeligaen 12 0 0 0 — 2Appearance(s) in the UEFA Europa League 0 14 0 Rosenborg 2009 Tippeligaen 25 0 0 0 — 4 0 29 0 2010 26 0 1 1 — 12Six appearances in the UEFA Europa League, five appearances in the UEFA Champions League, appearance in the Mesterfinalen 0 39 1 Total 51 0 1 1 0 0 15 0 67 1 Schalke 04 2010–11 Bundesliga 9 0 1 0 — 10 0 2013–14 3 0 0 0 — 1Appearance(s) in the UEFA Champions League 0 4 0 Total 12 0 1 0 0 0 1 0 14 0 Vitesse (loan) 2011–12 Eredivisie 24 0 3 0 — 27 0 Osasuna (loan) 2012–13 La Liga 6 0 2 0 — 8 0 HJK 2014 Veikkausliiga 7 0 1 0 — 5 0 13 0 1860 Munich 2014–15 2. Bundesliga 3 0 0 0 — 3 0 Stabæk 2015 Tippeligaen 7 0 1 0 — 8 0 HJK 2016 Veikkausliiga 15 0 1 0 — 4 0 20 0 2017 30 3 3 0 — 4 0 37 3 2018 3 0 7 0 — 10 0 Total 48 3 11 0 0 0 8 0 67 3 Career totals 181 3 19 1 0 0 32 0 232 4 === International === As of 20 January 2013 Appearances and goals by national team and year National team Year Apps Goals Ghana 2007 6 0 2008 12 0 2009 9 1 2010 14 0 2011 8 0 2012 14 1 2013 2 0 Total 65 2 International goals Goal Date Venue Opponent Score Result Competition 1\\. 15 November 2009 Baba Yara Stadium, Kumasi, Ghana Mali 2 – 2 2–2 2010 World Cup qualification 2\\. 8 September 2012 Ohene Djan Stadium, Accra, Ghana Malawi 2 – 0 2–0 2013 African Cup of Nations qualifier ==Honours== Hearts of Oak * Ghana Premier League: 2006–07 Stabæk *Eliteserien: 2008 Rosenborg *Eliteserien: 2009, 2010 * Superfinalen: 2010 Schalke 04 *DFB-Pokal: 2010–11 *DFL-Supercup: 2011 HJK Helsinki *Veikkausliiga: 2014, 2017, 2018 *Finnish Cup: 2014, 2016–17 Ghana *Africa Cup of Nations: runner-up 2010; third place: 2008 Individual * Kniksen of the Year: 2010 * VG's Player of the Year: 2010 * Kniksen Award Midfielder of the Year: 2010 * Veikkausliiga Midfielder of the Year: 2017 * Veikkausliiga Team of the Year: 2017 * Eliteserien Team of the Season: 2009 * Rosenborg Player of the Season: 2009 * HJK Helsinki Club President Award: 2017 ==References== Category:1986 births Category:Living people Category:Ghanaian footballers Category:Association football midfielders Category:Sportspeople from Accra Category:Ghana at the 2008 Africa Cup of Nations Category:Ghana at the 2010 Africa Cup of Nations Category:Ghana at the 2010 FIFA World Cup Category:Ghana at the 2012 Africa Cup of Nations Category:Ghana at the 2013 Africa Cup of Nations",
 "title": "Anthony Annan"
}