{
 "id": "108672",
 "text": "Popol Vuh was a German Krautrock band that was founded by pianist and keyboardist Florian Fricke in 1970 together with Holger Trulzsch (percussion) and Frank Fiedler (electronics). Other important members during the next two decades included Daniel Fichelscher and Robert Eliscu.Michael Fuchs-Gambock, Gerhard Augustin: Booklet to CD re-issue of \"Hosianna Mantra\", SPV recordings, 2004 The band took its name from the Popol Vuh, a manuscript containing the mythology of the Post-Classic Quiché Maya kingdom of highland Guatemala. ==Biography== The first album, Affenstunde, released in 1970, can be regarded as one of the earliest Ambient music, space music or New Age music works, featuring the then new sounds of the Moog synthesizer together with ethnic percussion. ===Compilations=== *Perlenklänge: The Best Of Popol Vuh (1976) - Ohr / Pilz / Kosmische Musik compilation *Tantric Songs (1981) - featuring tracks from Die Nacht der Seele and Brüder des Schattens - Söhne des Lichts *Fitzcarraldo (1982) - soundtrack featuring four previously released Popol Vuh compositions besides opera and traditional music *In The Gardens of Pharao / Aguirre (1983) *Gesang der Gesänge (1988) *Florian Fricke (1991) - featuring tracks from Coeur de Verre (retitled) and Brüder des Schattens - Söhne des Lichts *The Best Soundtracks From Werner Herzog Films (1991) *Sing, For Song Drives Away The Wolves (1993) - remix album *Movie Music (1994) *Nicht Hoch Im Himmel (1998) *Future Sound Experience (2002) - remix album recorded in 1993 (according to its booklet) and released after Florian Fricke's death *70's Progressive (2006) - SPV compilation ===Unauthorized album=== *Yoga (1976) - recorded by Florian Fricke with Indian musicians ==Other websites== *http://www.venco.com.pl/~acrux/discogr.htm (Definitive discography - includes sound samples) *http://www.popolvuh.it/ (Italian fansite, in Italian and English) *http://www.enricobassi.it/hosiannamantra.htm/ (Italian fan club, in Italian) *http://www.popolvuh.nl/ (Dutch fansite. In English, German. Many full text articles) *http://myweb.tiscali.co.uk/ultimathule/krautrockers.html#p \"The Crack In The Cosmic Egg\" krautrock encyclopedia P ==References== Category:German rock bands",
 "title": "Popol Vuh (band)"
}