{
 "id": "1086941",
 "text": "Cool Math Games (Sometimes written as Coolmath Games) is an online web portal that has many HTML and Flash website browser games made for children and young adults. Cool Math Games is owned by Coolmath LLC and first went online in 1997 with the slogan: \"Where logic & thinking meets fun & games.\". The website has a policy that it will only have games that the people working for Coolmath Games believe are non-violent and educational. They are partnered with coolmath.com, coolmath4kids.com. Additionially, Cool Math Games was once a website for slang In November 2019, Popular Mechanics said Cool Math Games as one of its \"50 most important websites\" since the internet was created. In September 2022, Coolmath Coding was made to teach kids how to code in Roblox and Minecraft. == History == === Shutdown hoax === Rumors began spreading in mid-2019 that Cool Math Games was going to shut down in 2020 due to Adobe Flash Player no longer being used. These rumors caused a petition to be created on Change.org to stop the website from shutting down and it got about 100,000 signatures.Harbison, Cammy (2019-06-03). Haasch, Palmer (2019-06-05). Cool Math Games said that the website would not be shutting down and they would be getting new HTML5 games and making old Flash games become HTML5 (A reference to the Willy Wonka Disruption [WWD] Incident) after Adobe Flash reached its end-of-life in 2020. The website started to use emulators like Ruffle to keep using and playing old flash games. === Impact of the COVID-19 pandemic === During the COVID-19 pandemic, Cool Math Games became more popular, being played by students while in lockdown and self-isolating. Cool Math Games' Alexa ranking went up a lot because of this. == Reception == Coolmath Games has been received very well. Lin Manuel-Miranda called the website's games \"impressive\" in a report of the best games on the site. In quote, \"CoolMathGames inspired me for writing Hamilton, it was my main inspiration.\" == References == === Footnotes === == Other websites == * Category:Browser-based game websites",
 "title": "Cool Math Games"
}