{
 "id": "1086026",
 "text": "The 2014 Isla Vista killings were two attacks against women in Isla Vista, California. On May 23, 2014, 22-year-old Elliot Rodger killed six people and hurt fourteen others using guns, knives, and a car near the University of California, Santa Barbara. Afterward, he killed himself. Rodger first stabbed three men in his apartment, then shot three women outside a sorority house, killing two. He also shot and killed a male student in a deli. Later, he drove around Isla Vista, shooting at people and hitting them with his car. He shot at police and was shot in the hip. He crashed his car before shooting himself in the head. Before the attacks, Rodger posted a video on YouTube called \"Elliot Rodger's Retribution,\" where he explained his plan to attack the University. He also wrote a document called My Twisted World: The Story of Elliot Rodger, where he talked about his life, family problems, and why he wanted to kill people. ==Attacks== On May 23, 2014, Elliot Rodger, armed with knives and guns, attacked people in Isla Vista, California. He first killed two roommates and their friend at their apartment. He stabbed Weihan \"David\" Wang, Cheng Yuan \"James\" Hong, and George Chen to death. After killing them, he attempted to clean the apartment to hide the evidence of the murders. Rodger later went to a Starbucks, bought a coffee, and then released a YouTube video where he expressed his anger about staying a virgin. He also emailed a 137-page document called My Twisted World to 34 people, including his parents and therapists. His mother, after being alerted by a therapist, saw the video and writings and quickly called the police while rushing to Isla Vista with Rodger's father. Rodger then drove to a sorority house, attempted to enter, and when unsuccessful, he shot three women outside, killing two. He continued his rampage by driving around Isla Vista, shooting at people and hitting others with his car. He shot into a deli, killing a man. After a shootout with police, where he was wounded in the hip, Rodger crashed his car. Police found him dead from a self-inflicted gunshot wound. In his car, they discovered firearms, ammunition, and knives. The entire attack lasted about eight minutes and resulted in six deaths and 14 injuries before he killed himself. ==Aftermath== About three hours after the shooting, police searched Rodger's apartment and discovered it was a mess. They found the bodies of Rodger's roommates and their friend along with evidence that he practiced stabbing on his bed sheets and pillows before killing them. Various weapons and empty ammunition boxes were also found. Rodger's laptop was found open to YouTube, displaying the video he had uploaded, and a handwritten journal was open to a page that read: \"I had to tear some pages out because I feared my intentions would be discovered. I taped them back together as fast as I could. This is it. In one hour I will have my revenge on this cruel world. I HATE YOU ALLLL! DIE.\" Wang's parents reported that their son wanted to move out because Rodger wasn't very social and often played loud music at night. The community held a candlelight vigil to remember the victims, and a memorial was held at the university's Harder Stadium which was attended by over 20,000 people, including the father of one of the victims, who spoke about the life of his son and called for an end to gun violence. ==Rodger's mental health== Rodger had mental health problems from when he was very young, but he was never admitted to a hospital for these issues. He often felt uncomfortable around other people, cried a lot in public, and showed repetitive behaviors. In 2007, doctors diagnosed him with an autism spectrum disorder called pervasive developmental disorder not otherwise specified. Rodger often felt angry at people he thought were happier than him. When he was 15, he started taking medicines like Xanax and Prozac, and later Paxil. Rodger also had problems with jealousy and struggled with social skills. He saw three counselors in Santa Barbara for about 29 times from May 2013 to May 2014 and also worked with a life coach in Los Angeles. Because Rodger was often upset with couples and felt out of place, it was recommended that he join a residential treatment program. This program would offer him daily therapy, both alone and in groups, and teach him social skills. In 2013, Rodger said he kept his anger inside instead of showing it. Before the shooting, he began taking Xanax again to manage his anxiety. Dale Launer, a family friend, tried to give him advice on how to talk to women, but Rodger did not follow it. Launer noticed something was off with Rodger when he first met him as a child. ==Rodger's parents== Rodger's father Peter Rodger and his wife, along with Li Chin, drove separately to Isla Vista after hearing about the incident. They spoke with the police over their phones and waited in a nearby parking lot for updates. The police told them that their son was found dead. At first, they thought he was a victim, but later learned from online reports that he was the shooter. The police searched the homes of Rodger's parents in Woodland Hills and West Hills. After these searches, the Rodger family received death threats and had to move frequently. In an interview with Barbara Walters, Peter Rodger explained he did not know his son was capable of violence. He also shared that he tried to help his son with his social struggles by suggesting a trip to Las Vegas, which his son had rejected. ==Preparations== In February 2012, Rodger started thinking about his \"Day of Retribution\" because he couldn't find a girlfriend. He believed that winning the lottery was the only way he could lose his virginity. He became obsessed with the idea of winning The Mega Millions lottery as a solution to avoid his planned attack. When he didn't win the jackpot in September 2012, he visited a gun range and started buying lottery tickets in other states. After several unsuccessful attempts to win the Powerball jackpot, he began actively planning his attack in November 2012. His first weapon was a Glock 34 semiautomatic pistol, which he bought for $700 in December 2012. Later, he bought two Sig Sauer P226 pistols, one in spring 2013 for $1,100 and another in 2014. He funded these purchases with money from gifts from his grandparents and a $500 monthly allowance from his father. === Further planning === In August 2013, Rodger decided to delay his planned attack until Spring 2014 and settled on April 26, 2014, as the new date. He initially thought about carrying out his attack on Halloween 2013 but changed his mind because he thought there would be too many police around. Rodger also considered Valentine's Day and Deltopia, a spring break event, but decided against these dates due to high police presence and realizing he needed more time to prepare. In his writings, Rodger mentioned wanting to kill his six- year-old stepbrother, fearing he would become more popular with girls, and his stepmother, whom he disliked. He planned to carry out these murders while his father was away on a business trip, fearing he might have to kill his father too. However, he postponed the attack to May 24, 2014, after getting a cold on April 24. ==Manifesto== Rodger emailed a 137-page manifesto called My Twisted World: The Story of Elliot Rodger to 34 people, including his parents, teachers, friends, and therapists. In this manifesto, Rodger describes his life and his feelings of being treated by by women and life. He talks about his \"Day of Retribution\" plan which had three parts. The first part was to kill his roommates and anyone else he could lure to his apartment. The second part was his \"War on Women,\" targeting a sorority house to kill many women. The final part involved driving around Isla Vista, shooting and running over people with his car. === Online history === Rodger uploaded 22 videos on YouTube where he talked about his frustrations with not having a girlfriend and shared his negative views on life. His video titles included \"Why do girls hate me so much?\" and \"Life is so unfair because girls don't want me.\" Right before the attack, Rodger posted a video called \"Elliot Rodger's Retribution,\" explaining his actions were because he was still a virgin at 22 and felt rejected by women. ====Controversy over publication of Rodger's videos and manifesto==== Several news networks chose to limit the airing of Rodger's \"Retribution\" video due to concerns that it might inspire similar crimes. After the murders, the PUAHate forum was taken off the internet completely. Then, on May 27, 2014, YouTube decided to take down Rodger's \"Retribution\" video because it broke their rules by showing a threat of violence. Some experts said that taking down the video would cause it to be shared even more across the internet. Mahbod Moghadam, one of the founders of Genius.com, stepped down from his position after he faced backlash for making comments on Genius.com about Rodger's manifesto. He had called the manifesto \"beautifully written,\" which led to negative media attention. ==Reactions== After Rodger's attacks, some men on social media empathized with his views. A Facebook page called \"Elliot Rodger Is an American Hero\" was created, where people praised Rodger. The page was later removed by Facebook after complaints. Rodger became a figure in the \"incel\" (involuntarily celibate) online communities, where some users call him a \"saint\" and celebrate the anniversary of his attacks. In these forums, users discuss their frustrations with not having romantic relationships and often express hostile views towards women. Rodger is also linked to other violent acts, as his writings and actions are often cited by individuals involved in similar attacks. === Twitter hashtags === After Rodger's attacks, which were motivated by his hatred for women, some people on Twitter used the hashtag #NotAllMen to say that not all men are like Rodger. However, others argued that Rodger was not misogynistic because he killed more men than women. This discussion led to criticism that #NotAllMen might take attention away from the issue of violence against women. In response, the hashtag #YesAllWomen was created to focus on misogyny and sexism that all women face. It was used 1.2 million times in just four days. ==Incidents with law enforcement== In July 2013, Rodger tried to push women at a party because he was upset he couldn't talk to them. He was stopped and pushed off a ledge, hurting his ankle. The next day, police asked him about the incident, and he claimed he was attacked for no reason. In January 2014, he accused his roommate, Cheng Hong, of stealing and had him arrested. This charge was dropped after Hong was killed. On April 30, 2014, after not hearing from him for days and seeing his concerning videos, Rodger's mother reached out to his therapist. The therapist requested a welfare check, which led to six officers visiting Rodger's apartment. They concluded he was not a danger. Rodger then removed most of his videos from YouTube, but he re-posted them just before the attacks. ==Gun control and mental health debates== The attacks led to debates about gun control and healthcare in the United States. Sheriff Bill Brown blamed the attacks on problems in the mental health system and a lack of communication between doctors. Some lawmakers wanted an investigation into how the police dealt with Rodger before the attacks. They found that the police followed the rules. Even though California has strict gun laws, Rodger passed all the background checks and bought three guns. Some people blamed politicians and the NRA for not making better gun laws. Others wanted better mental health services and laws. Some new laws were passed to try and stop similar events happening again. === Lawsuits === In March 2015, the parents of Hong, Wang, and Chen sued Santa Barbara County, the Sheriff's department, Capri Apartments, and the property management company. They claimed negligence and breaches of their constitutional rights. They said Rodger showed strange behavior, but the apartment owners didn't check his background before assigning him new roommates. They also said authorities didn't take Rodger's threats seriously, violating their rights. In June 2015, the cyclist Rodger hit and was handcuffed by police filed a lawsuit against Santa Barbara County, Rodger's parents, and the University of California, Santa Barbara. He claimed negligence and false imprisonment. == References == Category:Violence against women Category:May 2014 events",
 "title": "2014 Isla Vista killings"
}