{
 "id": "1086665",
 "text": "Elliot Oliver Robertson Rodger (July 24, 1991 – May 23, 2014) was an English- American former college student and mass murderer responsible for the 2014 Isla Vista killings. On May 23, 2014, Rodger killed six people and injured 14 others using knives, semi-automatic pistols, and his car in Isla Vista, California, near the University of California, Santa Barbara. ==Early life== Elliot Rodger was born on July 24, 1991, in London, England to parents Peter Rodger and Li Chin. His mother is Malaysian and worked as a nurse. His father is British and has worked in the film industry, including as a second unit director on the movie The Hunger Games. Rodger's grandfather, George Rodger, was a famous photographer known for his work during World War II. He had a good childhood, going to many countries at a young age. He attended Dorset House, a private all-boys school, which he found too strict and it often made him upset. When Rodger turned five, his family moved to Woodland Hills, California, a rich area near Los Angeles. His parents divorced when he was seven, which was very hard for him. After the divorce, his father married Soumaya Akaaboune, a Moroccan actress. Rodger was shy and found it difficult to make friends. He often felt to nervous when at parties large or gatherings. In 1999, his mother filed for more child support, describing him as a \"high- functioning autistic child.\" ==Middle years== Rodger's mother once dated George Lucas, which led him and his mother receiving invitations to Star Wars red carpet premieres. Rodger began to play video games, spending many hours playing popular games like Halo on his Xbox. Around this period, Akaaboune had a son. Elliot's interest in movies diminished as he felt uncomfortable seeing couples at movie theaters. In middle school, Rodger would play the online game World of Warcraft for 14 hours a day. This became his main form of social activity. At age 11, he was exposed to explicit images online, which overwhelmed him with shock and emotions. As he entered puberty, Rodger developed a strong sexual attraction toward women and began to fear he would never have a relationship with them. After his mother moved to an apartment in Calabasas, California, Rodger felt embarrassed by it and avoided bringing friends over. Rodger had trouble making friends in middle school and tried to get attention by annoying classmates. He was bullied by a blond girl, which led him to start hating women. After middle school, Rodger attended Crespi Carmelite High School, an all-boys Roman Catholic school. He hoped it would be a fresh start, but he was soon bullied by older students, which included being hit with food and having his head taped to his desk. Overwhelmed by this, he would often cry and felt too nervous to do anything. He struggled to interact with others and withdrew from his homework, preferring to play World of Warcraft instead. Due to the bullying, his parents transferred him to Taft Charter High School. However, Taft's large student population made Rodger nervous. At Taft, he would be shoved against lockers and called homophobic slurs. Rodger often waited for hallways to be empty before moving to his next class to avoid interactions. His parents decided to withdraw him from the school after just a few weeks. Seeking a more supportive educational setting, Rodger's parents enrolled him in Independence High School, a smaller school with about 100 students that offered a more contained environment aimed at supporting students facing challenges. This school provided a few hours of daily teaching and was perceived as a place where bullying Rodger would be less likely. In 2007, Rodger was diagnosed with pervasive developmental disorder not otherwise specified (PDD-NOS), a condition on the autism spectrum that leads to challenges in social development. He was initially prescribed Xanax and Prozac, but he stopped taking them within a year. At the age of 17, a family trip to Morocco led to significant distress for Rodger, but he eventually accompanied his stepmother and half-brother, remaining unhappy during the trip. He eventually graduated from Independence High School, but his social struggles continued, leading him to remain alone despite efforts from others to connect with him. ==Later life== By the age of 18, Rodger had stopped attending the mental health sessions and stopped taking his medications. After high school, Rodger enrolled in Los Angeles Pierce College but soon left because seeing happy couples that made him jealous. Despite encouragement from his mother to find a job, Rodger preferred spending his time reading at Barnes & Nobles as a hobby. His parents tried to help him find jobs, but Rodger resisted, claiming that the job offers he received were \"beneath him.\" He often sat alone in cafes, waiting for women to approach him. After leaving Los Angeles Pierce College, Rodger and his mother visited Moorpark College. Attracted by its smaller size and its campus. He developed feelings of jealousy towards a couple in one of his classes. By the age of 19, he chose to take only one political science class, relieved that the couple was not present in this class, though he still saw them around campus. After completing a year at Moorpark College, Rodger dropped out in 2010. === Santa Barbara === In an attempt to help their son socialize more, Rodger's parents sent him to college in Santa Barbara, believing that being part of a college community might encourage him to make friends. Influenced by the film Alpha Dog, Rodger was hopeful that moving to Santa Barbara would allow him improve his social life and lose his virginity. In June 2011, he moved to the Capri Apartments in Isla Vista, California near the University of California, Santa Barbara, and enrolled in Santa Barbara City College. Shortly after moving in, Rodger felt intense jealousy toward a roommate's friend who mentioned losing his virginity at a young age. Rodger ran to his room and called his mother, expressing his frustration and jealousy over the attention that black men received from blonde women. Struggling to get along with several roommates, Rodger spent much of his time alone at golf courses and beaches. After changing roommates several times, one roommate described Rodger as a \"ticking time bomb waiting to explode,\" and expressed fear for their life. Rodger began to hate the people of Isla Vista, feeling jealous of people in relationships with attractive blonde women and blaming men more successful than him. He fantasized about violent acts against couples and, on several occasions, acted out aggressively in public. After seeing a couple kiss, he threw his coffee at them in a fit of rage. Feeling lonely, Rodger withdrew from all his college classes and began planning what he referred to as the \"Day of Retribution.\" He had an obsession with designer clothing, believing it would help him look more attractive. Despite efforts to socialize, Rodger remained distant and his interactions often ended in frustration. His growing frustration led him to purchase lottery tickets in hopes of winning and finally getting a girlfriend. After repeated failures and loss of hope in changing his circumstances, Rodger began buying firearms and preparing for his \"Day of Retribution.\" ==Incident at house party== On July 20, 2013, Rodger, wanting to lose his virginity before turning 22, drank vodka and attended a party hoping to interact with women. Frustrated by his inability to talk with women, Rodger climbed a 10-foot ledge and pretended to shoot people with his finger. He then attempted to shove several women off the ledge, but was stopped by a group of men who pushed him off instead, causing him to break his ankle. Rodger tried to leave but realized he had lost his sunglasses. Still drunk, he mistakenly entered another house, leading to another fight where he was called names and beaten up. Injured and bloodied, Rodger managed to return to his apartment. The next day, two sheriff's deputies visited him in the hospital. Rodger claimed that he was insulted and attacked for no reason, but was unclear if he should have called the police. A deputy noted Rodger's apparent lying, describing him as too \"timid\" and \"shy.\" A witness at the party stated that Rodger had started the fight by trying to push women off the ledge. This witness described Rodger as acting alone and behaving weirdly, noting that he wasn't talking to anyone at the party. Upon returning home, another witness saw Rodger crying and overheard him talking about killing his attackers. The sheriff's office concluded that Rodger had started the fight, and the case was closed without further action. After his hospital visit, Rodger began to plan for his subsequent attacks. ==Mental health and further planning== In August 2013, Elliot Rodger, feeling resentful about his broken ankle and constant rejections from women, decided that the only solution was to carry out his planned attack. However, his broken ankle forced him to delay his plans until spring 2014. Rodger soon became upset when he learned that his sister had gotten a boyfriend. He felt depressed and jealous after overhearing them having sex together. Rodger's parents tried to get him more help by working with three different counselors, but Rodger continued to struggle with his feelings and social interactions. In late 2012, Rodger began having therapy sessions with celebrity psychiatrist Charles Sophy. Sophy prescribed Rodger risperidone, but he decided against taking it after reading about it online. He eventually stopped going to his therapy sessions by fall 2013. Rodger also got advice from family friend Dale Launer on how to talk with women, but he found Launer's advice ineffective. Rodger believed that it didn't help him attract women or lose his virginity. === Behavior with others === Rodger struggled with jealousy and social difficulties during interactions with his last few friends. After one friend started dating, Rodger became jealous and began insulting them. In a moment of tension, one friend told Rodger that no girl would ever want to be with him. On a separate occasion at the Getty Museum, Rodger asked if women were looking at him, but his friend said no, which led him to leave the group and break down crying. In September 2013, Rodger moved into a new apartment with two roommates, Weihan \"David\" Wang and Cheng Yuan \"James\" Hong. The interactions were tense, leading Rodger to spend a lot of time alone. His behavior bothered Wang, who complained about Rodger's loud music at night. A fight escalated between Rodger and Hong involving stolen candles, which resulted in Hong's arrest for petty theft. Rodger's social struggles continued to worsen. He planned to carry out his attacks but postponed his plans due to the heightened police presence during certain events. Despite receiving advice and attempting to socialize, Rodger remained isolated and increasingly disturbed. He decided to carry out his planned attack on April 26, 2014 but later postponed it. Throughout early 2014, he prepared by buying firearms and practicing at gun ranges by using money given to him by his family. ==Online activity== Rodger often shared his frustrations about his romantic failures and his views on life through platforms like YouTube. In April 2014, he uploaded videos expressing his loneliness and anger about not having a girlfriend, questioning why women preferred \"inferior\" men over someone like him, despite his good looks and wealth. He posted videos with titles such as \"Why do girls hate me so much?\" and \"My reaction to seeing a young couple at the beach, Envy.\" Rodger also spent time recording himself driving and dancing to music from artists like Whitney Houston and Phil Collins. He subscribed to multiple YouTube channels associated with the Men's rights movement. He left negative comments across various videos, including misogynistic and racist remarks, and often bragged about his wealthy background, claiming a sense of superiority because he was half-white. On his blog titled \"Elliot Rodger's Official Blog,\" he portrayed himself as a \"sophisticated, polite gentleman\" having difficulty talking with others in Isla Vista. He frequently shared selfies on his Facebook profile, showcasing his luxurious lifestyle, including plane rides and movie premieres. He also visited forums like ForeverAlone and PUAHate, where he and other men identified as incels. They would share their frustrations about being unable to find romantic or sexual partners, discussing their hatred towards women and pick-up artists. ==Further planning== In the days leading up to his planned April attack, Rodger created a 137-page manifesto titled My Twisted World: The Story of Elliot Rodger Rodger described women as a \"plague\" and thought that their ability to choose their partners could \"hinder the advancement of humanity,\" suggesting that \"civilized men of intelligence\" should make mating decisions. He stated that women should not have any rights and that their \"wickedness\" needed to be \"contained\" to prevent societal degeneration. Rodger detailed his \"Day of Retribution\" in his manifesto, planning it in three parts. The first phase involved killing his two roommates to secure their apartment for further acts. In the second phase, named the \"War on Women,\" he aimed to enter the Alpha Phi sorority house at UCSB to kill as many female residents as possible, particularly targeting blond women who rejected him. His final plan involved murdering his stepmother and younger brother to prevent them from enjoying a life he felt he could never have, then proceeding to drive through Isla Vista, shooting people from his vehicle. On April 30, 2014, after discovering his disturbing videos online, Rodger's mother contacted his therapist, who then requested a welfare check from the police. Responding officers visited Rodger's apartment but didn't check his videos or see if he owned guns. The police concluded he posed no immediate threat. ==Attacks== Rodger experienced increasing anxiety as he planned his attack and used medication like Xanax to help manage it. In May 2014, he drove around Santa Barbara, trying to enjoy what he believed were his last weeks alive. Although he initially planned to begin his attack on May 24, he started one day earlier, on May 23. Rodger told his mother that he would be finishing school on May 23 and would call her after taking a test at Santa Barbara City College. However, he never called her. On the day he started his attacks, he took anxiety medications and searched online for ways to kill silently with a knife, then practiced by stabbing his bed sheets and pillows. On the evening of the attack, Rodger first killed his two roommates and their friend in their apartment. He used knives to fatally wound them and attempted to clean up the blood before leaving the apartment. After changing out of his blood-soaked clothes, Rodger went to a Starbucks for a coffee. Shortly after, he posted a video on YouTube outlining his frustrations of staying a virgin and the reasons for his actions. He also emailed a manifesto detailing his thoughts and plans to several people, including his parents and therapists. Following this, Rodger attempted to enter the Alpha Phi sorority house but failed to gain access. Frustrated, he returned to his car and soon after shot three women who were nearby, killing 19-year-old Veronika Weiss and 22-year-old Katherine \"Katie\" Cooper. He then drove to a local deli and shot several people there, including 20-year-old Christopher Michaels-Martinez, who died from his injuries. After the shootings at the deli, Rodger continued to drive around Isla Vista, shooting at people and hitting others with his car. Rodger engaged in a shootout with police. He was injured in the hip during the exchange of gunfire but managed to drive away. Eventually, he crashed his car into a parked vehicle. Law enforcement quickly surrounded the car and found Rodger dead inside from a self-inflicted gunshot wound to the head. ==Legacy== Rodger and his murder spree brought the incel community to mainstream attention, with it having been praised by young men around the world who identify as incels. Some incels refer to him as a \"saint\" and \"hero\", with some even going so far as to celebrate \"Saint Elliot Day\" on the anniversary of his attacks. ===Inspired incidents=== Rodger's mass killings would go on to inspire copycats, with Rodger being mentioned as an influence for men responsible for or suspected in other mass killings. For example, on April 23, 2018, 25-year-old Alek Minassian killed 10 people and injured 15 others in Toronto, Canada, by driving a van through the city. Before his attack, Minassian posted on his Facebook profile: Nikolas Cruz, the perpetrator of the Parkland high school shooting idolized many different infamous mass murderers, in particular Elliot Rodger. ===Fandom=== Rodger has also spawned a fandom, mostly apparent on incel forums. While some just have a scholarly interest in him or the event, the vast majority of these individuals, express a sympathetic interest, in Rodger. There has been fanart drawn of him, fan fiction and memes. many moderate incels sarcastically refer to themselves as \"Supreme Gentlemen\". == References == Category:1991 births Category:2014 deaths Category:Murderers",
 "title": "Elliot Rodger"
}