{
 "id": "1086611",
 "text": "The High School Republican National Federation, commonly referred to as the High School Republicans or HSReps, is a 501(c)(4) organization and student-led organization that seeks to mobilize young people and elect Republicans. HSReps members across the country engage in political activity and work on political campaigns. == History == The High School Republican National Federation started in April 2022. It's run by students and helps local high school Republican groups work together better. It was made by bringing together different state groups that were already part of their state parties. Their goal is to fight for their beliefs in schools, talk to voters to get Republicans elected, and plan for a strong future. Some of these groups are called 'Teen Republicans,' but they all follow the same ideas set by the National Federation.. == Organization == The High School Republican National Federation has groups in different states and cities all across the country. Some of the biggest groups are in New Jersey, Nebraska, and North Carolina. Altogether, they have around 10,000 members who are active. The main group oversees all the High School Republicans. It's run by a National Board made up of different leaders like a chairman, co-chairman, and others. They're in charge of making sure the group grows and supports Republican ideas. There's also a National Committee with representatives from each state to help with leadership. Local chapters at high schools and counties work at a grassroots level to rally young people behind causes. Local High School Republican chapters have organized candidate forums, registered voters, and helped to elect Republicans in their own communities. == Involvement == During elections, High School Republicans go door-to-door to talk to people, make phone calls, and tell others about Republican candidates.. These students help out in different campaigns, like those for Congressman Don Bacon,Sanderford, Aaron (2022-11-10). \"High School Republicans, union support helped power Bacon's win\". Nebraska Examiner. Retrieved 2023-08-01. Heidi Ganahl,Ernest Luning (2022-08-29). \"Q&A; with James Ruehmann | Founder of state, national GOP groups works to involve kids in politics\". Colorado Politics. Retrieved 2023-08-01. and others. High School Republicans in different states are also getting involved in making laws. For example, in December 2023, the New Jersey High School Republicans went to Trenton, New Jersey, to talk about a new law called the Involve our Youth Act. This law would let high school students take time off school for activities that help their community. They worked together with the New Jersey High School Democrats to try to make this law happen.. == Related pages == * Young Republicans * Republican Party (United States) == References == Category:Republican Party (United States) Category:Student organizations",
 "title": "High School Republican National Federation"
}