{
 "id": "1086917",
 "text": "Emmanuel Agyemang-Badu (born 2 December 1990), known mononymously as Badu ( ), is a Ghanaian professional footballer who plays as a midfielder. He has earned 78 caps for the Ghana national team. Midfielder capable of playing multiple roles, but performs best playing centrally in front of the defence. Competitiveness, physicality and resistance are his predominant characteristics, with which he masks less than excellent technical skills. He is gifted with great explosive strength and speed with the ball at his feet, although his ball control is not excellent. He is the typical midfielder capable of providing a lot of substance but little quality to the maneuver. He is considered to be one of the best Ghanaian midfielders of his generation. ==Club career== Badu played domestically for Berlin, Berekum Arsenal and Asante Kotoko. On April 16, 2009, Spanish side Recreativo Huelva took him over on loan from Berekum Arsenal. He returned to Ghana in September 2009. In November 2009, BBC and Sky Sports announced that Udinese would sign the Ghanaian in the upcoming January transfer window. On January 28, 2010, Udinese confirmed the news. On February 12, 2010, he was on the bench against AC Milan. On March 28, 2010, Badu made his debut for Udinese in a league match against ACF Fiorentina. During the 2011-2012 season he forced a place in the starting team as a replacement for Gökhan Inler who left for Napoli. Together with compatriot Kwadwo Asamoah, he formed a central midfield duo for the defense. During the 2013/14 season, Badu – as a defensive midfielder – scored five goals in Serie A. In August 2017 he joined Turkish Süper Lig club Bursaspor on loan for the 2017–18 season. He was injured whilst on loan, and returned to first-team action with Udinese in March 2019, after 11 months out.On 13 July 2019, Badu signed to Hellas Verona on loan with an obligation to buy. He was hospitalised in August with blood clots on his lungs, but was cleared to play in December 2019. He featured in 10 matches on loan at the club. After the 2019–20 season Hellas Verona activated their obligation to sign him on a two-year deal from Udinese after playing for the Udine-based club for 10 years and playing in 193 matches in all competitions, scoring 10 times and making 11 assists. He was not included in Verona's 2020–21 Serie A squad. On 2 January 2021, he announced that he terminated his Verona contract and retired from playing. In July 2022, 13 years after playing in the Ghana Premier League, Badu made a return to the league and signed for Nungua-based club Accra Great Olympics as a free agent. He signed a one-year deal with the club ahead of the 2022–23 season. He made his debut on 17 August 2022 against Bechem United, in a 5–4 penalties loss after a goalless draw in regulation time in the 2022 GHALCA G6. He played in all matches as the Olympics went on to win the GHALCA G6 at the end of the tournament after defeating Bechem United by 2–0 in the final. On 9 September 2022, a day to the commencement of the league, he was officially unveiled by the club. After a remarkable five-month tenure, during which he participated in 11 league games and earned the prestigious Man of the Match award twice, he bid farewell to the Olympics. ==International career== On May 22, 2008, Agyemang Badu was selected for the training list of the Ghana national football team for the first time. He played in the match between Ghana and Lesotho on June 8, 2008, making his adult national team debut. Agyemang Badu subsequently participated in the 2010, 2012 and 2013 African Cup of Nations. His goal against Guinea in the 2012 Africa Cup of Nations group stage was selected as a candidate for the 2012 FIFA Puskas Award. He scored a goal against DR Congo during the AFCON 2013. ==Career statistics== ===International=== Ghana Year Apps Goals 2008 3 0 2009 3 0 2010 11 0 2011 10 3 2012 6 1 2013 14 3 2014 8 3 2015 11 1 2016 7 0 2017 5 0 Total 78 11 ===International goals=== :Score and Result list Ghana's goal tally first |- | 1. || 3 June 2011 || Baba Yara Stadium, Kumasi, Ghana || || || || 2012 Africa Cup of Nations qualification || |- | 2. || 2 September 2011 || Accra Sports Stadium, Accra, Ghana || || || || 2012 Africa Cup of Nations qualification || |- | 3. || 15 November 2011 || Stade Municipal, Saint-Leu-la-Forêt, France || || || || Friendly || |- | 4. || 1 February 2012 || Stade de Franceville, Franceville, Gabon || || || || 2012 Africa Cup of Nations || |- | 5. || 10 January 2013 || Mohammed Bin Zayed Stadium, Abu Dhabi, United Arab Emirates || || || || Friendly || |- | 6. || 20 January 2013 || Nelson Mandela Bay Stadium, Port Elizabeth, South Africa || || || || 2013 Africa Cup of Nations || |- | 7. || 24 March 2013 || Baba Yara Stadium, Kumasi, Ghana || || || || 2014 FIFA World Cup qualification || |- | 8. || 10 September 2014 || Stade de Kégué, Lomé, Togo || || || || 2015 Africa Cup of Nations qualification || |- | 9. || 15 October 2014 || Accra Sports Stadium, Accra, Ghana || || || || 2015 Africa Cup of Nations qualification || |- | 10. || 31 March 2015 || Stade Sébastien Charléty, Paris, France || || || || Friendly || |} ==Honours== Asante Kotoko * Ghana Premier League: 2007–2008 Great Olympics * GHALCA G6: 2022 Ghana U-20 * African Youth Championship:Swiss club moves for Kotoko's Samuel Inkoom on www.modernghana.com 2009Ghana beat Cameroon to win U-20 title www.http://sports.thinkghana.com * FIFA U-20 World Cup: 2009 Ghana * Africa Cup of Nations Silver Medal: 2010, 2015 ==References== Category:1990 births Category:Living people Category:Ghanaian footballers",
 "title": "Emmanuel Agyemang-Badu"
}