{
 "id": "1086810",
 "text": "The Tudeh Party of Iran (Persian: حزب توده ایران) meaning \"People's Party\" in Persian, is a political party with a significant historical presence in Iran. Founded in 1941, the party played a notable role in Iranian politics until the Islamic Revolution of 1979. == History == The Tudeh Party was closely associated with communist ideologies and gained prominence during Iran's struggle against foreign occupation in World War II. It advocated for workers' rights, social justice, and national independence. === Pre-Revolution Era === Before the Islamic Revolution, the Tudeh Party was a prominent force in Iranian politics. It participated in elections, and its members were involved in various social and political activities. However, as tensions escalated in the late 1970s, particularly during the revolution against the monarchy, the party faced challenges.History of the Tudeh Party of Iran,https://www.iranchamber.com/history/tudeh/tudeh_party01.php === Post-Revolution === Following the establishment of the Islamic Republic in 1979, the Tudeh Party experienced a significant setback. The new regime, led by Ayatollah Khomeini, opposed the party's communist ideals, leading to its banning. Many Tudeh Party members faced persecution, imprisonment, or exile.Tudeh Party | Encyclopedia.com,https://www.encyclopedia.com/humanities/encyclopedias-almanacs-transcripts-and-maps/tudeh-party === Exile and Transformation === Despite being banned in Iran, the Tudeh Party continued to operate in exile, primarily from European countries. Over time, the party underwent internal changes and ideological shifts. Some members moved away from strict communism, embracing more social-democratic principles.Brief History of The Tudeh Party of Iran - Tudeh Party of Iran,https://www.tudehpartyiran.org/en/1993/03/31/brief-history-of-the-tudeh-party-of-iran/ == Current Status == The Tudeh Party remains active in exile, engaging with the Iranian diaspora and advocating for democratic reforms. It continues to navigate challenges and changes in Iran's political landscape.Brief History of The Tudeh Party of Iran - Tudeh Party of Iran,https://www.tudehpartyiran.org/en/1993/03/31/brief-history-of-the-tudeh-party-of-iran/ == Conclusion == The Tudeh Party of Iran has a complex history intertwined with the nation's political evolution. From its roots in anti-occupation struggles to its role in the pre-revolution era and subsequent challenges during the Islamic Republic, the party reflects the dynamic nature of Iranian politics. The Tudeh Party's resilience and adaptability in the face of adversity highlight its ongoing commitment to political engagement and social change. == References == Category:Political parties in Asia Category:1941 establishments Category:20th-century establishments in Iran Category:Communist parties",
 "title": "Tudeh Party of Iran"
}