{
 "id": "108644",
 "text": "A lost city is a city that was normal once but, for some reason, became not lived in any more and forgotten about. Many of these cities are called ghost towns. ==Lost cities by continent== ===Africa=== *Akhetaten, Egypt – Capital during the reign of 18th Dynasty pharaoh Akhenaten. Later abandoned and almost totally destroyed. Modern day el Amarna. *Canopus, Egypt – on the now-dry Canopic branch of the Nile, east of Alexandria. *Itjtawy, Egypt – Capital during the 12th Dynasty. Exact location still unknown, but it is believed to lie near the modern town of el-Lisht. *Tanis, Egypt – Capital during the 21st and 22nd Dynasties, in the Delta region. *Memphis, Egypt – Administrative capital of ancient Egypt. Little remains. *Avaris, capital city of the Hyksos in the Nile Delta. *Leptis Magna – Roman city in present day Libya. It was the birthplace of Emperor Septimius Severus, who lavished an extensive public works programme on the city, including diverting the course of a nearby river. The river later returned to its original course, burying much of the city in silt and sand. *Dougga, Tunisia – Roman city in present day Tunisia. *Carthage, Tunisia; first a Phoenician city, destroyed and then rebuilt by Rome. Later served as the capital of the Vandal Kingdom of North Africa, before being destroyed by the Arabs after its capture in AD 697. *Great Zimbabwe *Aoudaghost – Wealthy Berber city in medieval Ghana, sacked by mujahideen, location unknown. *Timgad - Roman city founded by the emperor Trajan around 100 AD, covered by the sand at 7th Century. ===Asia=== ====Far East Asia==== *Yamatai – Japan. ====Southeast Asia==== *Sukhothai *Ayutthaya *Angkor and surroundings. ====South Asia==== *Vijayanagar *Poompuhar – in South India *Mohenjodaro – in Pakistan Sindh *Harappa – in Pakistan's Punjab *Taxila – in Pakistan's Khyber Pakhtunkhwa *Muziris ====Central Asia==== *Abaskun – Medieval Caspian Sea trading port *Ani – Medieval Armenian capital *Harappa – early city part of the Indus Valley Civilisation *Mohenjo Daro – early city part of the Indus Valley Civilisation *Dwarka – ancient seat of Krishna, hero of the Mahabharata. Now largely excavated. Off the coast of the Indian state of Gujarat. *Niya – in the Taklamakan Desert, on the ancient Silk Road route. *Loulan – in the Taklamakan Desert, on the ancient Silk Road route. *Subashi – in the Taklamakan Desert, on the ancient Silk Road route. *Otrar – City along the Silk Road, important in the history of Central Asia. *Karakorum – Capital of Genghis Khan. *Old Urgench – Capital of Khwarezm. *Mangazeya, Siberia *Turquoise Mountain - Capital of Afghanistan, destroyed 1220 ====Western Asia/Middle East==== *Akkad *Babylon *Çatalhöyük – A Neolithic and Chalcolithic settlement, near the modern city of Konya, Turkey. *Choqa Zanbil *Ctesiphon *Iram of the Pillars – Lost Arabian city in the Empty Quarter. *Kourion, Cyprus *Hattusa – Capital of the Hittite Empire. near the modern village of Boğazköy in north-central Turkey. *Kish *Lagash *Nineveh *Persepolis *Petra *Troy *Ur ===South America=== ====Inca cities==== *Machu Picchu – Possibly Pachacuti's Family Palace. *Vilcabamba – Currently known as Espiritu Pampa. *Paititi – A legendary city and refuge in the rainforests where Peru, Bolivia and Brazil meet. *Choquequirao - Considered to be the last bastion of Incan resistance against the Spainiards and refuge of Manco Inca Yupanqui. ====Other==== *Chan Chan – Chimu; near Trujillo, in present day Peru. *Tiahuanaco, or Tiwanaku, pre-Inca, in present day Bolivia. It is a UNESCO World Heritage Site. *Cahuachi – Nazca, in present day Peru. *Caral – An important center of the Norte Chico civilization, in present day Peru. *Ciudad de los Cesares - City of the Caesars, A legendary city in Patagonia, never found. Also variously known as City of the Patagonia, Wandering City, Trapalanda or Trapananda, Lin Lin or Elelín, *Santa Maria de la Antigua del Darien – First city in the mainland of the American continent, in the Darien region between Colombia and Panama. Founded by Vasco Nuñez de Balboa in 1510. *Lost City of Z - A city allegedly in the jungles of the Matto Grosso region of Brazil, was said to have been seen by the British explorer Col. Percy Harrison Fawcett sometime prior to World War I. *Kuelap - A massive ruined city still covered in jungle that was the capital of the Chachapoyas culture in Northern Peru. * Teyuna, or Tayuna (Ciudad Perdida) in present day ColombiaLost City Teyuna, Lostcitytour.com. * Upano Valley Sites, an (urban settlement or) urban complex in Ecuadorian Amazon, discovered in 2024. ===North America=== ====Mexico and Central America==== =====Maya cities===== incomplete list – for further information, see Maya civilization *Chichen Itza – This ancient place of pilgrimage is still the most visitied Maya ruin. *Copán – In modern Honduras. *Calakmul – One of two \"superpowers\" in the classic Maya period. *Coba *Naachtun – Rediscovered in 1922, it remains one of the most remote and least visited Maya sites. It is 44 km (27 miles) south- southeast of Calakmul, and 65 km (40 miles) north of Tikal, it is believed to have had strategic importance to, and been vulnerable to military attacks by, both neighbours. Its ancient name was identified in the mid-1990s as Masuul. *Palenque — in the Mexican state of Chiapas, known for its beautiful art and architecture *Tikal — One of two \"superpowers\" in the classic Maya period. =====Olmec cities===== *La Venta – In the present day Mexican state of Tabasco. *San Lorenzo Tenochtitlán – In the present day Mexican state of Veracruz. ====United States==== *The cities of the Ancestral Pueblo (or Anasazi) culture, in the Four Corners region of the Southwest United States – The best known are at Chaco Canyon and Mesa Verde. *Cahokia – near present-day St. Louis, MO. At its height Cahokia is believed to have had between 40,000 and 80,000 people, making it amongst the largest pre-Columbian cities of the Americas. It is known chiefly for its huge pyramidal mounds of compacted earth. *Kennett, California was lost under 400 feet of water when Shasta Dam was built. *Kane, Wyoming was a city that was lost when the Yellowtail Dam was built. *Lost counties, cities, and towns of Virginia *Pattenville, New Hampshire was flooded when the Moore Dam was built. *Pueblo Grande de Nevada a complex of villages, near Overton, Nevada ====Canada==== *L'Anse aux Meadows – Viking settlement founded around 1000. ====Other==== *Aztlán- the ancient home of the aztecs *Izapa – Chief city of the Izapa civilization, whose territory extended from the Gulf Coast across to the Pacific Coast of Chiapas, in present day Mexico, and Guatemala. *Teotihuacan – Pre-Aztec Mexico. ===Europe=== *Akrotiri – On the island of Thera, Greece. *Atil, Tmutarakan, Sarai Berke – Capitals of the steppe peoples. *Attila's Fortified Camp, Romania – Probably the great ruins at Saden (Zsadany, Jadani, now Cornesti -jud. Timis) from or to which the Hun tribe Sadagariem took or gave their name. *Avars'Khan Fortified Camp, Romania - Probably the re-occupied city of Attila at Saden (Zsadany, Jadani, now Cornesti -jud. Timis). *Birka, Sweden *Biskupin, Poland *Calleva Atrebatum,Silchester,England,UK - Large Romano- British walled city 10 miles south of present day Reading. Just the walls remain and a street pattern can be discerned from the air. *Chryse Island in the Aegean, reputed site of an ancient temple still visible on the sea floor. *Damasia – Sank into the Ammersee, Germany. *Dunwich, England, United Kingdom – Lost to coastal erosion. *Hedeby, Germany *Helike, Greece on the Peloponnese – Sunk by an earthquake in the 4th century BC and rediscovered in the 1990s. *Kaupang - In Viksfjord near Larvik, Norway. Largest trading city around the Oslo Fjord during the viking age. As sea levels retreated (the shoreline is 7m lower today than in 1000) the city was no longer accessible from the ocean and was abandoned. *Kitezh, Russia - Legendary underwater city which supposedly may be seen in good weather. *Niedam near Rungholt *Ny Varberg, Sweden *Old Sarum, England, United Kingdom – the people moved to nearby Salisbury although the owners of the archaeological site retained the right to elect a Member of Parliament to represent it until the Reform Act 1832 *Paestum - Greek and Roman city south of Naples, abandoned after attacks by Muslim pirates. Three famous Greek temples. *Pompeii and Herculaneum in Italy - buried by the eruption of Vesuvius in 79 AD and rediscovered in the 18th century *Roxburgh, Scotland - abandoned in the 15th century *Rungholt – Sunken in the Wadden Sea, Germany. *Saeftinghe, Netherlands - prosperous city lost to the sea in 1584. *Selsey, England, United Kingdom - mostly abandoned to coastal erosion after 1043. *Skara Brae, Scotland, United Kingdom - Neolithic settlement buried under sediment. Uncovered by a Winter storm in 1850. *Sybaris, Italy - Ancient Greek colonial city of unsurpassed wealth utterly destroyed by its archrival Crotona in 510 BCE. *Tartessos, Spain *Teljä, Finland *Trellech, Wales, United Kingdom. *Uppåkra, Sweden *Vineta – Legendary city somewhere at the Baltic coast of Germany or Poland. *Winchelsea, East Sussex,UK Old Winchelsea,Important Channel port,pop 4000+,abandoned after 1287 inundation and coastal erosion. Modern Winchelsea, 2 miles inland, was built to replace it as a planned town by Edward I *Ys - Legendary city on the western coast of France. ==Related pages== *Ghost town *Atlantis ==References== Category:Lists of cities",
 "title": "Lost cities"
}