{
 "id": "1086244",
 "text": "Clyde Adolf Bruckman (June 30, 1894January 4, 1955) was an American writer and director of comedy films during the silent era as well as the early sound era of cinema. Bruckman worked with comedians like Buster Keaton, Monty Banks, W. C. Fields, Laurel and Hardy, The Three Stooges, Abbott and Costello, and Harold Lloyd. Hollywood writer Kenneth Anger thinks Bruckman was one of the most important figures in the history of American screen comedy.Anger, Kenneth. Hollywood Babylon ll, Plume reprint, 1984, NY, p. 218. ==Early life== Clyde Adolf Bruckman was born on June 30, 1894, in San Bernardino, California. In 1911, Bruckman's father Rudolph was in a car accident that left him with headaches and brain damage. Rudolph killed himself in 1912. Bruckman was a writer for the sports pages of the San Bernardino Sun in the spring of 1912. In 1914, he moved to Los Angeles and got a job as a writer for the Los Angeles Times. He later worked for the Los Angeles Examiner and the Saturday Evening Post. On July 29, 1916, Bruckman married Lola Margaret Hamblin. ==Career== Bruckman first worked in film in 1919, where he wrote title cards for Universal Pictures. In 1921, he moved to Warner Brothers and began writing jokes for Buster Keaton. Bruckman (pronounced \"Brook-man\") was best known for his work with Keaton, as Bruckman co-wrote some of Keaton's most popular films, such as Our Hospitality, Sherlock Jr., The Navigator, Seven Chances, The Cameraman, and The General, which Bruckman also co-directed. Bruckman was the director for four Laurel and Hardy comedies in the early stages of their work together at the Hal Roach Studios in 1927–1928. The most popular one was The Battle of the Century with its custard pie fight. During this period he also wrote for Harold Lloyd and Monty Banks. Bruckman kept directing comedies during the sound era, his most famous comedy being The Fatal Glass of Beer, W. C. Fields' satire of Yukon melodramas. He was addicted to alcohol, which was a problem for directing his movies. After 1934, Bruckman would be only allowed to write scripts.Anger loc cit. == Recycling gags == Bruckman's experience of silent-comedy got him hired at Columbia Pictures' short-subject workforce (Bruckman was very important Columbia hiring Keaton). Bruckman continued to write new jokes for The Three Stooges and other comics. After some time, he re-used gags from Keaton and other creators. After he had taken some gags, Lloyd sued Columbia and won. \"Never mind that Bruckman had co-written and co- directed Movie Crazy, giving him a good claim to his work, or that Bruckman and Lloyd may have got their ideas from a vaudeville act in the first place\", wrote Ethan Gates in The New Republic, reviewing Matthew Dessem's 2015 biography of Bruckman, The Gag Man. Bruckman was hired by Universal Pictures to write comedy scenes for the studio's \"B\" musical shows. This was a big job that paid better than short works. He continued re-using gags but on a larger scale. He inserted the tuxedo routine into Universal's \"B\" musical-comedy feature Her Lucky Night. Bruckman adapted material from Lloyd's Welcome Danger into Universal's Joan Davis–Leon Errol comedy She Gets Her Man, and again took jokes Movie Crazy for Universal's \"B\" comedy So's Your Uncle. Lloyd was very angry by several things being taken from his movies, and sued for US$1,700,000;\"Lloyd Film Firm Sues For $1,815,000: Charges Universal Co. With Infringement of Copyrights on Three Pictures\". The New York Times April 5, 1945: 26. the court ruled for Lloyd but granted damages of $40,000. After this Bruckman was fired and never made a film again. The Gag Man / The Dissolve Archived Retrieved 23 March 2024 Archived 8 July 2014 ==References== == Other websites == * * * * Clyde Bruckman at Allmovie Category:1894 births Category:1955 deaths Category:Writers from San Jose, California Category:Screenwriters from California",
 "title": "Clyde Bruckman"
}