{
 "id": "1086691",
 "text": "Kwadwo Asamoah (, ; born 9 December 1988) is a Ghanaian former professional footballer. Mainly a left midfielder or left-back, he was also occasionally deployed as a central midfielder. Left-footed midfielder, very tactically flexible, his best qualities are dynamism and physical power; these, combined with good basic technique and excellent insertion times, make him a valid player in both phases of the game. Able to combine quality and quantity, he was born as a midfielder and then established himself as a left winger of a 5-piece midfield, during his time with Juventus, under the guidance of Antonio Conte; his successor on the Juventus bench, Massimiliano Allegri, described him as \"one of those horses who stay still for a long time, and as soon as they have the opportunity, they start again at full speed\". Nonetheless, an early physical decline combined with a poor adaptability to the role of full- back in a 4-piece defence, heavily undermined his performance in the second part of his career. Widely considered as one of the best Ghanaian midfielders of all time. ==Club career== Asamoah was scouted by the Ghanaian Liberty Professionals. He signed a contract with Swiss side AC Bellinzona in 2007 and was loaned out to Italian side Torino FC for six months during the winter transfer window. In June 2008, Asamoah signed a contract with Udinese. There, he gradually grew into a regular player. In four seasons at Udinese, Asamoah made 134 league appearances, scoring eight goals. During the 2010 FIFA World Cup and the 2010 Africa Cup of Nations, Asamoah made a good impression. That earned him interest from several big clubs. On 2 July 2012, Asamoah and his teammate Mauricio Isla signed a contract with Juventus. He made his debut in the Supercoppa on 11 August 2012 against SSC Napoli. The Ghanaian celebrated his debut for Juventus with a goal. Juventus won 4–2 after scoring two goals in stoppage time. He also started the first league game of the season against Parma FC and was immediately important in the second goal: he provided an assist on Stephan Lichtsteiner. In his first season, Asamoah scored two goals in 27 league appearances for Juventus. In the 2013/14 season, Asamoah was a starting player, left midfielder, and only missed four league games, including one due to suspension after four yellow cards. After the previous season, they also won the national title. Asamoah scored two goals and provided five assists, including two in the home game against Genoa CFC on 15 October 2013 (2–0 win). Asamoah struggled with hyaline cartilage in the 2014/15 season, which caused him to miss most of the season. He was not part of Juventus' squad in the 2014–15 Coppa Italia, except for the final won (1–2 after extra time); However, he did not come off the substitutes' bench. In the 2014–15 UEFA Champions League, Juventus reached the final, which they lost to FC Barcelona (1–3) on 6 June 2015. Asamoah was not part of the Juventus squad in the knockout stages. ==International career== Asamoah made his debut for the Ghana national football team on 11 February 2006, in a friendly match against Egypt (2–2 draw). After 81 minutes of play, he replaced Stephen Appiah. In a World Cup qualifier against the Malian national football team (0–2 win), Asamoah scored his first international goal. In the 66th minute, he opened the scoring; Twelve minutes later, Matthew Amoah decided the game. In 2010, Asamoah was the only Ghanaian to play in all international matches, including all matches at the 2010 Africa Cup of Nations (Ghana lost the final 0–1 to Egypt) and all Ghana's matches at the 2010 FIFA World Cup, including the quarter-final lost to Uruguay on penalties. In January 2012, Asamoah played his third African Championship, losing 1–0 to Zambia in the semi-finals. A year later, Asamoah was again present with Ghana at the continental tournament and again the country was eliminated in the semi-finals, this time by Burkina Faso (1–1, 3–2 on penalties). At the tournament, Asamoah scored twice. With Ghana, he secured participation in the 2014 FIFA World Cup at the end of 2013 by beating Egypt in the play-offs of the qualifying tournament. In June 2014, coach Kwesi Appiah included Kwadwo Asamoah in the squad for the tournament in Brazil. At the tournament, he played in all three group matches, including the draw against eventual champions Germany (2–2). ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League Cup1 Europe2 Other3 Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Udinese 2008–09 Serie A 20 2 2 0 6 0 — 28 2 2009–10 25 1 2 0 — — 27 1 2010–11 38 2 1 0 — — 39 2 2011–12 31 3 0 0 9 0 — 40 3 Total 114 8 5 0 15 0 — 134 8 Juventus 2012–13 Serie A 27 2 1 0 7 0 1 1 36 3 2013–14 34 2 1 0 11 0 1 0 47 2 2014–15 7 0 0 0 3 0 0 0 10 0 2015–16 11 0 2 0 0 0 0 0 13 0 2016–17 18 0 3 0 3 0 0 0 24 0 2017–18 19 0 4 0 3 0 0 0 26 0 Total 116 4 11 0 27 0 2 1 156 5 Inter Milan 2018–19 Serie A 32 0 1 0 9 0 — 42 0 2019–20 8 0 0 0 3 0 — 11 0 Total 40 0 1 0 12 0 — 53 0 Cagliari 2020–21 Serie A 9 0 — — — 9 0 Career total 279 12 17 0 54 0 2 1 352 13 1Includes Coppa Italia 2Includes UEFA Cup/Europa League and UEFA Champions League 3Includes Supercoppa Italiana ===International=== Appearances and goals by national team and year Ghana Year Apps Goals 2009 6 1 2010 18 0 2011 10 0 2012 11 0 2013 14 3 2014 10 0 2018 1 0 2019 4 0 Total 74 4 ====International goals==== :Scores and results list Ghana's goal tally first. No. Date Venue Opponent Score Result Competition 1\\. 7 June 2009 Stade du 26 Mars, Bamako, Mali 1–0 2–0 2010 FIFA World Cup qualification 2\\. 20 January 2013 Nelson Mandela Bay Stadium, Port Elizabeth, South Africa 2–0 2–2 2013 Africa Cup of Nations 3\\. 9 February 2013 Nelson Mandela Bay Stadium, Port Elizabeth, South Africa 1–2 1–3 2013 Africa Cup of Nations 4\\. 6 September 2013 Baba Yara Stadium, Kumasi, Ghana 2–0 2–1 2014 FIFA World Cup qualification ==Honours== Juventus *Serie A: 2012–13, 2013–14, 2014–15, 2015–16, 2016–17, 2017–18 *Coppa Italia: 2014–15, 2015–16, 2016–17, 2017–18 *Supercoppa Italiana: 2012, 2013, 2015 *UEFA Champions League runner-up: 2014–15, 2016–17 Inter Milan *UEFA Europa League runner-up: 2019–20 Ghana * Africa Cup of Nations runner-up: 2010; third place: 2008 Individual *CAF Most Promising African Player: 2010 *SWAG Sports Personality of the Year: 2012 *Ghana Player of the Year: 2012 *CAF Team of the Year: 2014 *Serie A Team of the Year: 2013–14 *Africa Cup of Nations Team of the Tournament: 2010, 2012 ==References== == Other websites == * * Profile on Juventus website * Profile on Lega Serie A Calcio website * Category:1988 births Category:Living people Category:Ghanaian footballers Category:Ghana at the 2008 Africa Cup of Nations Category:Ghana at the 2010 Africa Cup of Nations Category:Ghana at the 2010 FIFA World Cup Category:Ghana at the 2012 Africa Cup of Nations Category:Ghana at the 2013 Africa Cup of Nations Category:Ghana at the 2014 FIFA World Cup Category:Ghana at the 2019 Africa Cup of Nations Category:2019 Africa Cup of Nations players",
 "title": "Kwadwo Asamoah"
}