{
 "id": "1087502",
 "text": "Nasutixalus is a group of frogs in the family Rhacophoridae. These frogs live in northeastern India, southeastern Tibet, and western Yunnan (China); they might also live in Nepal and Myanmar. People call them ridged-nose treefrogs in English. ==Etymology== The name Nasutixalus is from the Latin words nasutus, for \"large-nosed,\" and ixalus, which is a word for tree frogs. ==Taxonomy== Scientists made the genus group Nasutixalus in 2016 because of the species Nasutixalus medogensis. The species was described based on just one individual frog. Scientists did DNA studies and found that this one frog was in the family Rhacophoridae but not in any of the genuses that were already known. Sathyabhama Das Biju and team made a new genus for just one species, Frankixalus, for Polypedates jerdonii; named for from the Free University of Brussels. But because the other scientists published their paper two days before Das Biju's team, all the other scientists decided to use Nasutixalus. So Frankixalus is a synonym. A one frog that scientists called Theloderma moloch at first was genetically distinct from other Theloderma and made the genus paraphyletic. Scientists studied Theloderma moloch more and caught more frogs. They found those frogs were more closely related to Nasutixalus jerdonii than to any other frogs in Theloderma so they renamed it Nasutixalus medogensis. ==Species== There are three species: * Nasutixalus jerdonii (Günther, 1876) * Nasutixalus medogensis Jiang, Wang, Yan, and Che, 2016 * Nasutixalus yingjiangensis Yang and Chan, 2018 ==Description== Nasutixalus are good at hiding and hard to see, medium-sized frogs: adult males are long from nose to rear end and adult females are long. There is some webbed skin on the front feet and more on the back feet. ==Habitat and reproduction== Nasutixalus live in trees in evergreen forests on mountains. Male Nasutixalus jerdonii and N. yingjiangensis call from tree holes. People have seen eggs from N. jerdonii have been found in water-filled tree holes. The eggs stick to the inner walls of the holes just above the surface of the water. People also saw tadpoles in the water. The tadpoles had eggs in their stomachs, so scientists think they eat eggs. Phytotelm-breeding frogs often have tadpoles that eat eggs because there is not much food in holes in trees. Scientists don't know whether the tadpoles ate eggs from their same species or not, but they think so. ==References== Category:Frogs of Asia",
 "title": "Nasutixalus"
}