{
 "id": "1087914",
 "text": "is a Japanese two-member rock band formed in 2017. The members include n-buna, a vocaloid producer, and suis, a female vocalist. == History == N-buna met and formed the band with suis in 2017, who participated in one-man live. The band released their first EP in 2017, and released their first album in 2019 through Universal Music Japan. In 2020, they released the theme song , and ending song for the anime film A Whisker Away. In 2021, Suis provided the vocals for the ending theme to the Japanese version of the Disney film Luca. In 2022, they released the theme song and for the Japanese TV drama In 2023, they released , the opening theme song for the first season of the anime series . In 2024, they released , the second opening theme song for the anime series, . == Members == * (composer) * (vocalist) === Supporting Members === * Mitsuyasu Shimotsuru (Guitar) * Tatsuya Kitani (Bass) * Masack (Drums) * Tetsuya Hirahata (Piano) == Discography == === Albums === Year Album 2019 2019 2020 2023 === Extended plays === Year EP 2017 2018 2021 === Singles === Year Single 2019 2020 2020 2020 2021 2021 2021 2021 2022 2022 2022 2023 2023 2023 451 2023 2023 2024 2024 === Art books === Year Art book 2023 === Films === Year Title 2021 2022 === Other Works === In 2021, n-buna worked as the composer for The Coca-Cola Company's \"I LOHAS Natural Mineral Water\" advertisement. In 2021, suis worked as the narrator for \"Sumitomo Mitsui Bank\" advertisement. In 2021, n-buna provided the narration for NHK's \"From Here in Tohoku\" documentary. In 2022, suis provided the narration for Fuji TV's \"The Nonfiction\" documentary. In 2023, n-buna worked as the composer, and suis worked as the narrator for \"99th Hakone Ekiden: Inheritance of Thoughts\" advertisement. In 2023, n-buna first time worked as one of the primary composers for an anime. He worked as the composer for Wit Studio's original short anime . He also provided the music and lyrics for its theme song. Artist Year Song Title Album Title note Sangatsu no Phantasia 2016 n-buna - Composer, lyricist, and arranger n-buna, Kana yaginuma 2016 n-buna - Composer, lyricist. It is included in CHUNITHM AIR, which is a rhythm game. Aimi Tanaka 2016 Project LUX n-buna - Composer, lyricist, and arranger. It is the theme song for virtual reality anime game Project LUX. n-buna × Orangestar featuring Hatsune Miku 2017 n-buna - Lyricist, and arranger. Music was composed by Orangestar. It was the theme song for SNOW MIKU 2017, which is a festival held in Sapporo, Hokkaidō, Japan every year. Sangatsu no Phantasia 2017 n-buna - Composer, lyricist, and arranger. Yūka Ueno 2017 n-buna - Composer, and arranger. Sayuri 2017 n-buna - Arranger. Mewhan 2018 n-buna - Arranger. Sonoko Inoue 2018 n-buna - Composer, lyricist, and arranger. Tsubaki Factory 2018 first bloom n-buna - Composer. Sangatsu no Phantasia 2018 n-buna - Composer, lyricist, and arranger. Sangatsu no Phantasia 2019 n-buna - Composer, lyricist, and arranger. n-buna featuring Sarah Furukawa 2019 Silence（feat. Sarah Fukukawa） Silence（feat. Sarah Fukukawa） n-buna - Composer, lyricist, and arranger. It is the theme song for virtual reality anime game Spice and Wolf. Mone Kamishiraishi 2019 i n-buna - Composer, and arranger. note Yōsui Inoue featuring suis from Yorushika 2019 PlayStation 4 Lineup Music Video suis - Vocalist. It was used in PlayStation 4 Lineup anime music video. TK from Ling Tosite Sigure × suis from Yorushika 2019 suis - Vocalist. Yōsui Inoue 2019 Make-up Shadow Yorushika It is a cover of a song by Yōsui Inoue. Yoko Shimomura, suis from Yorushika 2020 suis - Vocalist. It was used in the Japan Post Pay advertisement. Sangatsu no Phantasia 2020 n-buna - Composer, lyricist, and arranger. Nulbarich featuring Vaundy 2020 ASH feat. Vaundy n-buna - Remixer. Akihito Okano 2021 n-buna - Lyricist. It is the opening theme of the anime . 2021 suis - Vocalist. It is the theme song for Lotte Ghana Chocolate advertisement. TK from Ling Tosite Sigure 2021 n-buna - Remixer. Yōsui Inoue 2021 suis - Vocalist. It is the ending theme to the Japanese version of the Disney film Luca. Mone Kamishiraishi 2021 Diamonds n-buna - Arranger. Natsuko Nisshoku 2021 n-buna - Arranger. Single 2021-06-23 Album 2021-08-11 TV Senshi 2021 n-buna - Composer, lyricist, arranger, producer, and background vocalist. suis - Background vocalist. n-buna - Composer, lyricist, arranger, and producer. CreepHyp 2021 n-buna - Remixer. KAMI WA SAIKORO WO FURANAI × AYUNi D × n-buna 2021 n-buna - Composer, and arranger. Lanndo featuring Eve & suis from Yorushika 2021 suis - Guest vocalist with Eve. n-buna - Guitar. MONDO GROSSO featuring suis from Yorushika 2022 BIG WORLD suis - Vocalist. Tatsuya Kitani featuring n-buna from Yorushika 2022 BIPOLAR n-buna - Guitar. chilldspot 2022 your trip your trip n-buna - Arranger. around dusk CreepHyp 2022 n-buna - Performer, and arranger. Eir Aoi 2022 n-buna - Composer, lyricist, and arranger. Single CD 2022-10-19 Album CD KALEIDOSCOPE 2023-01-11 suis from Yorushika 2022 suis - Vocalist. SawanoHiroyuki[nZk]:suis from Yorushika 2023 B∀LK V suis - Vocalist. n-buna - Guitar. JUNNA 2023 n-buna - Composer, lyricist, and arranger. It is the theme song for original short anime . Tetsuya Hirahata 2023 AMNJK suis - Lyricist, and vocalist. n-buna - Guitar. suis from Yorushika 2023 Travelers Travelers suis - Vocalist. It is the ending theme for the video game . Tatsuya Kitani featuring suis from Yorushika 2023 LOVE: AMPLIFIED suis - Vocalist. Tatsuya Kitani 2024 ROUNDABOUT suis - Guest vocalist. Akihito Okano 2023 Walkin' with a song n-buna - Composer, lyricist, and arranger. suis from Yorushika 2024 suis - Vocalist. It is the theme song for original short anime . == Awards == Year Ceremony Award Nominated Work Result Reference 2020 The 34th Japan Gold Disc Award Best 5 New Artists [Japanese Music] 2020 MTV Europe Music Awards Best Japanese Act 2021 13th CD Shop Awards Finalist Award Space Shower Music Awards Best Pop Artist == References == == Other websites == * Category:J-pop Category:J-pop music groups Category:Japanese musical groups Category:Japanese rock bands",
 "title": "Yorushika"
}