{
 "id": "1087735",
 "text": "Fath-Ali Shah Qajar (; May 1769 – 24 October 1834) was the second Shah (king) of Qajar Azerb. His rule extended from June 17, 1797, until his passing on October 24, 1834. His reign witnessed a significant event—the permanent loss of Iran's northern territories in the Caucasus, which now include Georgia, Dagestan, Azerbaijan, and Armenia. This outcome resulted from the Russo- Persian Wars of 1804–1813 and 1826–1828, along with the treaties of Gulistan and Turkmenchay, leading to the expansion of the Russian Empire., page 728 Fath-Ali Shah is remembered by Iranians for several distinctive characteristics. Firstly, he was known for his remarkably long beard. Secondly, his slender waist, likened to that of a wasp, became a notable feature. Lastly, his legacy includes his numerous descendants. Joseph M. Upton, The History of Modern Iran: An Interpretation. Contributors: – Author. Publisher: Harvard University Press. Place of publication: Cambridge, 1960, p.4 Towards the end of his rule, Iran faced severe economic challenges, coupled with military and technological shortcomings. These difficulties brought the nation to the brink of government breakdown. After Fath-Ali Shah's death, a power struggle ensued, further hastening Iran's descent into potential disarray.https://iranicaonline.org/articles/fath-ali-shah-qajar-2 During his reign, efforts were made to glorify the monarchy through artistic representations. Many visual depictions of Fath-Ali Shah and his court were crafted to celebrate the royal authority. Notable among these are rock reliefs, reminiscent of those established during the pre-Islamic Sasanian Empire. These reliefs can be found in Ray, Fars, and Kermanshah. The purpose behind these artistic endeavors was to portray Fath-Ali Shah as the rightful heir to the ancient Persian empire. By doing so, he aimed to connect with his fellow countrymen and leave a lasting impression on future generations. Despite the challenges and complexities of his rule, Fath-Ali Shah Qajar's legacy endures through the visual representations that sought to immortalize his reign.https://iranicaonline.org/articles/fath-ali-shah-qajar-2 ==Background== Baba Khan, better known after his coronation in 1797 as Fath Ali Shah Qajar, was born in the city of Damghan, located in the Semnan province of Iran. As his father was suspected of engaging in political activities against the Zand dynasty, he was sent as a five-year-old hostage to Shiraz to live with his uncle, Agha Mohammad Khan Qajar, who was in exile at the time under the surveillance of Karim Khan Zand. In 1779, after Karim Khan's death, Muhammad Khan Qajar rebelled against the Zand dynasty. During the ensuing wars, Baba Khan served under his uncle. When Agha Muhammed Khan Qajar emerged victorious and established the Qajar dynasty, he had no heir. Baba Khan was adopted by the king as his son and crown prince. Baba Khan served as the governor of Fars when his uncle was assassinated in 1797. Subsequently, Baba Khan ascended to the throne and assumed the name Fath Ali Shah. The significant events during his reign were the two wars between Persia and Russia, where the Iranian army suffered defeats. The Gulistan Treaty and later the Turkmanchay Treaty were signed, resulting in Persia losing many of its northern territories to Russia. Sultanate of Fath Ali Shah (Third stage: stabilization and stability of the Qajar government Initially, Fath Ali Shah Qajar appointed Abbas Mirza, his youngest son from a noble lineage, as the crown prince. However, the crown prince died before the king, and Mohammad, the son of the crown prince, took his father's place as the crown prince. Mohammad later succeeded Fath Ali Shah Qajar, becoming the next and third king in the Qajar dynasty. Death of Fath Ali Shah, Fath Ali Shah Qajar; Turbulent history toy, == References == Category:Shahs of Iran Category:1769 births Category:1834 deaths",
 "title": "Fath-Ali Shah Qajar"
}