{
 "id": "1087783",
 "text": "Umamah bint Zainab married Ali ibn Abi Talib after the death of Fatima bint Muhammad. She was the granddaughter of the Prophet Muhammad from his daughter Zainab and Al as ibn Rabi'a. She belongs to Ahlul Bayt. == Family == Umamah's mother was Zainab bint Muhammad, who was the elder daughter of Muhammad. Zainab was married to Abu al As, and the couple had two children: Ali bin Abu al As and Umamah bint Zainab. Zainab passed away at the young age of 31. At that time Umamah was very small, so Muhammad decided to take care of Umamah. He loved her very much. She learned truthfulness, modesty (being humble), obedience, seriousness, and understanding from her grandfather the Prophet. She died in 66 AH. === Mother’s side of family tree === Umamah’s mother’s side descendants are the following: Umamah bint, Zainab bint, Mohammad Bin, Abdullah bin, Abd al, Muttalib bin, Hashim bin, Abd al, and Manaf bin Qusai. === Father’s side of family tree === Umamah’s father’s side descendants are the following: Umamah bint, Abu al as bin, Rabi bin, Abd al, Aza bin, Abd Shams bin, Abd al, and Manaf bin Qusai. == Marriage with Ali ibn Abi Talib == At the time of the Holy Prophet's death in 632 C.E, Umamah had come of age. Under the guidance of Prophet, she held virtues of patience, gratitude, and unchanging trust in Allah. Recognizing her character, Fatimah bint Mohammad entrusted a significant request to Ali ibn Abi Talib before her own death: \"Please marry my niece Umamah bint Zainab after my departure. I believe there is no one better suited to nurture and care for our children.\" In keeping with Fatimah's wishes, Ali ibn Abi Talib wed Umamah bint Abu al As. Devotedly (lovingly), Umamah served Ali ibn Abi Talib with great loyalty and dedication for twenty-eight years, showing the essence of a faithful spouse. == The last wish of Ali ibn Abi Talib == On 19th Ramadan 40 AH, Abdul Rahman ibn Muljan attacked Ali ibn Abi Talib. He summoned Mugheera bin Naufal, the grandson of Abd al Muttalib, and requested him to marry Umamah after his passing. He passed away after two days on the 21st of Ramadan 40 AH. == Marriage with Mugheera bin Naufal == Hassan bin Ali married Mugheera bin Naufal with Umamah's consent. She agreed to be married with Mugheera bin Naufal because it was the last will of Ali ibn Abi Talib. His father, Naufal bin Haris, was a cousin of Prophet Mohammad. Umamah remained wedded to Mugheera bin Naufal for 26 years. == Children == She gave birth to two children: Mohammad al Wast bin Ali and Yahya bin Mugheera. == References == Category:620s deaths Category:Wives of Muhammad",
 "title": "Umamah bint Zainab"
}