{
 "id": "1087356",
 "text": "The Namibian dollar (currency code: NAD; symbol: $ or N$) is the official currency of Namibia. The currency is abbreviated as N$, to distinguish it from other dollar-denominated currencies such as the United States Dollar (USD) and the Australian dollar (AUD). The Namibian dollar is issued and regulated by the Bank of Namibia, which is the country's central bank. == History == The Namibian dollar was introduced on August 15, 1993. It replaced the South African rand (ZAR) at par. Namibia, a former German colony, was administered by South Africa under a League of Nations mandate after World War I until it gained independence in 1990. Following independence, Namibia established its own central bank, the Bank of Namibia, and began issuing its own currency. The decision to adopt a separate currency was driven by Namibia's desire to have greater control over its monetary policy and currency. The Namibian dollar is pegged to the South African rand at a 1:1 exchange rate. This arrangement provides stability to Namibia's economy, as South Africa is its largest trading partner, and the rand is widely accepted and used in Namibia alongside the Namibian dollar. == Coins and banknotes == The Namibian dollar is issued in both coin and banknote form. Coins are issued in denominations of 5, 10, 50 cents, and 1, 5 dollars, while banknotes are issued in denominations of 10, 20, 50, 100, and 200 dollars. The design of Namibian banknotes and coins often features images of Namibia's natural landscapes, wildlife, and cultural heritage. The 10-dollar banknote has images of wildlife such as the oryx, while the 200-dollar banknote has scenes of Namibia's desert landscapes. == Economy and usage == The Namibian dollar is primarily used as a medium of exchange within Namibia for everyday transactions, including purchases of goods and services. It is also used for international trade and investment within the Southern African Development Community region, where the South African rand is widely accepted. The stability of the Namibian dollar is tied to the performance of the South African economy, as Namibia's economy is highly dependent on trade with South Africa. Fluctuations in commodity prices, exchange rates, and global economic conditions can impact the value of the Namibian dollar relative to other currencies. == Exchange Rate Regime == The Namibian dollar is pegged to the South African rand at a 1:1 exchange rate. This means that one Namibian dollar is equal in value to one South African rand. The pegging of the Namibian dollar to the rand provides stability and predictability to Namibia's economy, as it reduces exchange rate risk for businesses and investors operating in the country. The pegging arrangement is supported by the Currency and Exchanges Act of 1933, which allows for the use of the South African rand as legal tender in Namibia. This legal framework facilitates cross-border trade and investment between Namibia and South Africa, contributing to economic integration and development in the region. == References == #Bank of Namibia - Official Website. - https://www.bon.com.na/ #Namibia Statistics Agency - Economic Indicators. (https://nsa.org.na/) #Central Intelligence Agency. \"The World Factbook: Namibia.\" (https://www.cia.gov/the-world-factbook/countries/namibia/) == Related pages == *Namibia *Southern African Development Community (SADC) *Currency Peg *Banknotes of the Namibian dollar *Coins of the Namibian dollar Category:Namibia Category:Currency of Africa",
 "title": "Namibian dollar"
}