{
 "id": "108795",
 "text": "The Pacific Ring of Fire is an arc around the Pacific Ocean where many volcanoes and earthquakes are formed. The area is also called the Pacific Rim, a term which refers to the coastal areas of the countries round the Pacific. About three quarters of the world's dormant volcanos and active volcanos are here. The ring is 40,000km long, and there are 452 volcanoes. About 90% of the world's earthquakes and 81% of the world's largest earthquakes occur along the Ring of Fire. The next most seismic region (5–6% of earthquakes and 17% of the world's largest earthquakes) is the Alpide belt, which extends from Java to Sumatra through the Himalayas, the Mediterranean, and out into the Atlantic. The Mid-Atlantic Ridge is the third most prominent earthquake belt.U.S. Geological Survey Earthquakes FAQ .U.S. Geological Survey Earthquakes Visual Glossary . The Ring of Fire is a direct result of plate tectonics and the movement and collisions of crustal plates. == Volcanoes == * Avachinsky- Koryaksky in RussiaUnited States Geologic Survey (USGS), \"Decade Volcanoes\" . Retrieved 2012-6-15. * Barren Island in the Andaman and Nicobar Islands of India * Bogoslof island in Alaska * Chimborazo in Ecuador * Cotopaxi in Ecuador * Galeras in Colombia * Glacier Peak in the US (Washington) * Irazu in Costa RicaCosta Rica National Parks, \"Irazu Volcano National Park\" . Retrieved 2012-6-15. * Kelut in IndonesiaUSGS, \"Deadliest Volcanic Eruptions Since 1500 A.D.\". Retrieved 2012-6-15. * Kilauea in the US (Hawaii) * Krakatoa in Indonesia * Lō'ihi Seamount in the US (Hawai'i)Malahoff, Alexander. \"Loihi Submarine Volcano: A unique, natural extremophile laboratory,\"National Oceanic and Atmospheric Administration (NOAA), December 18, 2000. Retrieved 2012-6-15. * Mount Adams in US (Washington) * Mount Baker in the US (Washington)USGS, \"Mount Baker—Living with an Active Volcano,\"May 25, 2005. Retrieved 2012-6-15. * Mount Fuji in JapanGeological Survey of Japan, \"Active Volcanoes in Japan\". Retrieved 2012-6-14. * Mount Hood in the US (Oregon)USGS, \"Mount Hood—History and Hazards of Oregon's Most Recently Active Volcano,\" May 27, 2010. Retrieved 2012-6-15. * Mount Lassen in the US (California) * Mount Mayon in Albay in the Philippines * Mount Merapi in Indonesia\"Villagers flee biggest Mt Merapi eruption yet,\" The Guardian (UK). June 8, 2006. Retrieved 2012-6-15. * Mount Olympus in US (Washington) * Mount Pinatubo in the Philippines * Mount Rainier (Tahoma) in the US (Washington)US National Park Service (NPS), \"Mount Rainier\". Retrieved 2012-6-15. * Mount Slamet in Central Java, Indonesia * Mount St Helens in US Washington * Mauna Kea in US (Hawaii) * Mauna Hualalai in US (Hawaii) * Mauna Loa in the US (Hawaii)UNESCO, \"Hawaii Volcanoes National Park\". Retrieved 2012-6-14. * Nevado del Ruiz in Colombia * Pacaya in Guatemala * Parícutin in Mexico * Popocatepetl in Mexico * Redoubt in US (Alaska) * Sakurajima in JapanGlobal Volcanism Program (GVP), \"Sakura-jima\" . Retrieved 2012-6-15. * Sinabung in Indonesia * Taal in the PhilippinesMcGuire, Bill. \"In the shadow of the volcano,\" The Guardian,15 October 2003. Retrieved 2012-6-15. * Tambora in Indonesia * Ulawun in Papua New Guinea * Mount Unzen in Japan == References == Category:Pacific Ocean * * * * *",
 "title": "Pacific Ring of Fire"
}