{
 "id": "1087197",
 "text": "The Valley is an American reality television series which premiered on Bravo on March 19, 2024. It was developed as a spin-off from Vanderpump Rules. The series follows five couples who are \"taking a shot at adulting.\" == Overview == The Valley was first announced by Bravo on January 17, 2024. Lisa Vanderpump serves as an executive producer, with 32 Flavors Entertainment, Haymaker East and Evolution Media attached as the production companies. The series is a spin off of Vanderpump Rules. === Season 1 === The full cast for the first season was announced and a teaser for the season was released on January 17, 2024. An extended first look was released on February 27 and the premiere date was announced as March 19, 2024. The first season premiered on Bravo on March 19 and the finale aired on June 4. The original cast consisted of Brittany Cartwright, Jax Taylor, Kristen Doute, Luke Broderick, Daniel Booko, Nia Booko, Janet Caperna, Jason Caperna, Jesse Lally, and Michelle Lally as main cast members, with \"friends of\" Jasmine Goode and Zach Wickham also joining the cast. In May 2024, it was announced that the series had been renewed for a second season. == Cast == === Main cast === * Brittany Cartwright: (2024–present), married to Jax, mother of Cruz * Jax Taylor: (2024–present), married to Brittany, father of Cruz * Kristen Doute: (2024–present), a businesswoman, in a relationship with Luke * Luke Broderick: (2024–present), a podcast host, in a relationship with Kristen * Daniel Booko: (2024–present), an actor and model, married to Nia, father of Asher, Isabelle and Zariah * Nia Booko: (2024–present), a beauty pageant titleholder (Miss Nevada USA 2014, Miss USA 2014), married to Daniel, mother of Asher, Isabelle and Zariah * Janet Caperna: (2024–present), a former executive assistant and co-host of the Scheananigans podcast * Jason Caperna: (2024–present), an attorney with Acumen Law, LLP, father of an unnamed newborn baby boy * Jesse Lally: (2024–present), a luxury real estate broker, father of Isabella * Michelle Saniei Lally: (2024–present), a luxury real estate broker, mother of Isabella === Recurring cast === * Jasmine Goode; (2024–present): a former server at SUR Restaurant & Lounge, now an NFL cheerleader and a member of the Bachelor Nation * Zack Wickham; (2024–present): Brittany's best friend from college == Episodes == === Season 1 === == References == == Other websites == * Official website * The Valley at IMDb Category:American television series Category:2024 American television series debuts Category:American television spin-offs",
 "title": "The Valley (TV series)"
}