{
 "id": "1087159",
 "text": "A split-flap display, or a flap display, is a digital electromechanical display device that shows changeable alphanumeric text, and sometimes graphics. They are commonly used as public transport timetables in airports or railway stations. Commonly they are called Solari boards after Italian display manufacturer Solari di Udine, or in Central European countries they are called Pragotron after the Czech manufacturer instead. Split-flap displays were once commonly used in consumer digital clocks known as flip clocks. == Description == Each character position or graphic position has a collection of flaps on which the characters or graphics are painted or silkscreened. These flaps are rotated to show the desired character or graphic. Sometimes the flaps are large and display whole words, and in other installations there are several smaller flaps, each displaying a single character. Flip-dot displays and LED display boards may be used instead of split-flap displays in most applications. Their output can be changed by reprogramming instead of replacement of physical parts but they suffer from lower readability. They also can refresh more quickly, as a split-flap display often must cycle through many states. Advantages to these displays include: * high visibility and wide viewing angle in most lighting conditions * little or no power consumption while the display remains static * Distinct metallic flapping sound draws attention when the information is updated. The Massachusetts Bay Transportation Authority has designed the new LED replacements for its aging Solari boards at North Station and South Station to emit an electronically generated flapping noise to alert passengers to train boarding updates. Many game shows of the 1970s used this type of display for the contestant podium scoreboards. Usually, the flip was left-to-right on a vertical axis, although up/down on a horizontal axis was not completely unknown. Early seasons of the game show Family Feud used a split flap display as part of the game board (subsequent seasons used more modern digital displays, and eventually simply used a large digital flat screen monitor). The game board on the Nickelodeon game show Make the Grade was a 7x7 split-flap display, used to display subjects and wild cards, as well as tracking contestants' progress. The television game show Chain Reaction on Game Show Network features computer- simulated split-flap displays to display the various words in a chain. In Italy, split-flap displays have also been occasionally used as destination signs for transit vehicles; there was also a brief vogue for them in the United Kingdom in the mid 1980s. == Non-informational uses == The artistic appeal of the displays have been seen use in works like Pedestrian Drama, contemporary artwork using this display technology, and art by Juan Fontanive, who has used the mechanism since 2005. The album cover for The Enemy's album We'll Live and Die in These Towns is based on the Solari design seen at British railway stations. ==References== Category:Display technology",
 "title": "Split-flap display"
}