{
 "id": "1087569",
 "text": "The following is a list of notable deaths in May 2000. Entries for each day are listed _alphabetically_ by surname. A typical entry lists information in the following sequence: * Name, age, country of citizenship at birth, subsequent country of citizenship (if applicable), reason for notability, cause of death (if known), and reference. ==May 2000== ===1=== *Cláudio Christovam de Pinho, 77, Nicknamed “Manager”. *John Emery, 84, British paediatric pathologist. *Gil Fates, 85, American television producer. *David J. Mahoney, 76, American businessman and philanthropist, heart disease. *Gibby Mbasela, 37, Zambian footballer. *Steve Reeves, 74, American actor, lymphoma. *Nora Swinburne, 97, British actress. *Jukka Tapanimäki, 38, Finnish game programmer, heart failure. *Gérard Théberge, 69, Canadian Olympic ice hockey player, bronze medalist (1956) ===2=== *Laurie Calvin Battle, 87, American politician. *Belva Cottier, 79, American Sioux activist and social worker. *Bob Homme, 81, American-Canadian television actor, known for his role as The Friendly Giant, prostate cancer. *Bobbi Martin, 56, American country and pop music singer, songwriter, and guitarist, cancer. *Billy Munn, 88, British jazz pianist. *Harry Newman, 90, American football player. *Sundar Popo, 56, Trinidadian and Tobagonian musician. *Christina Marie Riggs, 28, American convicted murderer, execution by lethal injection. *Teri Thornton, 65, American jazz singer, bladder cancer. *Norman Wainwright, 85, English competition swimmer and Olympian. ===3=== *Lewis Allen, 94, British film and television director. *Richard Friederich Arens, 81, American mathematician. *Obie Baizley, 82, Politician in Manitoba, Canada. *Ed Chapman, 94, American baseball player. *William Keys, 77, Australian Army officer. *Mamuka Kikaleishvili, 39, Georgian actor and film director. *Bryan Lobb, 69, English cricket player. *Yoshinao Nakada, 76, Japanese composer, colorectal cancer. *John Joseph O'Connor, 80, American Roman Catholic prelate, brain cancer. *Shakuntala Paranjpye, 94, Indian writer, actress and a social worker. *Jon Vincent, 38, American pornographic actor, suicide. *Edward J. Sponga, 82, American Jesuit priest in the Society of Jesus. ===4=== *Sir Derick Ashe, 81, British diplomat. *Hendrik Casimir, 90, Dutch physicist known for the Casimir effect. *Humberto Donoso, 61, Chilean football player. *Jacques Gerschwiler, 101, Swiss figure skater and coach. *Alwyn Kurts, 84, Australian drama and comedy actor, liver failure. *Kieran Nugent, Provisional Irish Republican Army volunteer, cardiovascular disease. *Diana Ross, 89, English children's author. *Sugi Sito, 73, Mexican wrestler known as El Orgullo de Oriente. ===5=== *Edward Ashley-Cooper, 93, Australian actor, congestive heart failure. *Gino Bartali, 85, Italian racing cyclist. *Jan Firbas, 79, Czech linguist. *Don Kindt, 74, American football player. *Rolf Magener, 89, German escapee from India during World War II. *Bill Musselman, 59, American basketball coach, stroke. ===6=== *Benoy Choudhury, Indian freedom fighter and politician. *Eleazar Jiménez, 71, Cuban chess master. *Gordon McClymont, 79, Australian agricultural scientist and ecologist. *Lee Moore, 61, Saint Kitts and Nevis politician. *Roger von Norman, 91, Hungarian-born German film editor and director. *John Clive Ward, 75, British-Australian physicist, respiratory illness. *Sir Peter William Youens, 84, British diplomat and colonial administrator, pneumonia. ===7=== *Dov Bar-Nir, 88, Belgium-Israeli politician. *Douglas Fairbanks Jr., 90, American actor and the son of Douglas Fairbanks, heart attack. *Hideo Hamamura, 71, Japanese marathon runner and Olympian. *Ferrel Harris, 59, American NASCAR racecar driver. *Henry Laskau, 83, American Olympic racewalker. *José Luis López de Lacalle, Spanish journalist and trade unionist, killed by the ETA. *Homer Thompson, 93, Canadian classical archaeologist. *Timmy Payungka Tjapangati, 58, Aboriginal Australian artist. *Masaru Shintani, 72, Japanese-Canadian master of karate, heart attack. ===8=== *Pita Amor, 81, Mexican poet. *Stanley Boxer, 73, American abstract artist. *X Brands, 72, German-American actor. *Glen Bredon, 67, American mathematician. *William C. Brennan, 81, American lawyer and politician. *Dédé Fortin, 37, Canadian musician, suicide. *Hubert Maga, 83, Dahomey politician. *Henry Nicols, 26, American HIV/AIDS activist. ===9=== *György Csordás, 71, Freestyle swimmer from Hungary. *Arthur Davis, 94, American animator and a director. *Chris Evans, 53, Canadian ice hockey player. *William Fairchild, 82, English author, playwright, director and screenwriter. *Todor Nikolov, 54, Bulgarian football player. *John Nucatola, 92, American basketball player, coach and referee. *Carmen Romano, 74, First Lady of Mexico (1976-1982). *Zheng Weishan, 84, Chinese general and politician. ===10=== *Raymond Eddé, 87, Lebanese statesman. *Martin Farndale, 71, British army general. *Carden Gillenwater, 82, American baseball player. *Margaret Harris, 95, British costume designer. *Kiyoshi Kuromiya, 57, Japanese-American author and civil rights activist, cancer. *Virgil W. Raines, 89, American thoroughbred racehorse trainer. *Kaneto Shiozawa, 46, Japanese voice actor, cerebral contusion. *Dick Sprang, 84, American comic book artist and penciller. *Craig Stevens, 81, American actor, cancer. ===11=== *Verna Aardema, 88, American writer. *David Bretherton, 76, American film editor, pneumonia. *Dale Jennings, 82, American LGBT rights activist, playwright and author. *René Muñoz, 62, Cuban actor and screenwriter, cancer. *Albert Roberts, 91, British politician. *Hanny Thalmann, 83, Swiss women's rights activist and politician. *Paula Wessely, 93, Austrian actress, bronchitis. ===12=== *Pete Abele, 83, American politician (U.S. Representative for Ohio's 10th congressional district, Alzheimer's disease. *Dave Crowe, 66, New Zealand cricket player. *Dong Kingman, 89, Chinese American artist and watercolor master. *Adam Petty, 19, American race car driver, car crash. ===13=== *Paul Bartel, 61, American actor, writer and director, liver cancer, heart attack. *Olivier Greif, 50, French composer. *Stanley Korchinski, 71, Canadian politician. *Boško Perošević, 43, Serbian politician. *Jumbo Tsuruta, 49, Japanese professional wrestler known as Jumbo Tsuruta, complications from liver transplant. *Cesare Valletti, 77, Italian operatic tenor. ===14=== *Urda Arneberg, 71, Norwegian actress. *Johnny Cook, 51, American gospel singer formerly of the Happy Goodman Family. *Garrett Eckbo, 89, American landscape architect. *C. Eric Lincoln, 75, American scholar, diabetes. *Bob Maza, 60, Australian actor and playwright. *Keizō Obuchi, 62, Japanese politician and Prime Minister, stroke. *Rodman Rockefeller, 68, American businessman and philanthropist. *Karl Shapiro, 86, American poet. ===15=== *Roberto Benedicto, 83, Filipino lawyer, diplomat and banker. *Geoff Goddard, 62, English songwriter, singer and instrumentalist, heart attack. *Robert Lee Knous, 82, American politician. *Alfred Kuchevsky, 68, Soviet ice hockey defenceman. *George Marshall, 96, American conservationist and political activist. *Gösta Prüzelius, 77, Swedish actor, leukemia. *Anthony Squire, 86, British screenwriter and director. ===16=== *Bodacious, \"World's Most Dangerous Bull\" World Champion title holder. *Frido Frey, 78, German basketball player. *Evald Hermaküla, 58, Estonian actor and director, suicide. *Ghulam Ali Okarvi, 80, Pakistani Islamic scholar and jurist. *Andrzej Szczypiorski, 72, Polish novelist and politician. *Ronald Jay Williams, 72, Trinidadian businessman and politician. ===17=== *Donald Coggan, 90, English Anglican and 101st Archbishop of Canterbury. *Hümeyra Hanımsultan, 82, Ottoman princess. *Elsie Lessa, 86, Brazilian journalist and writer of American descent. *William H. Poteat, 81, American philosopher, scholar and professor. *Sajjan, 79, Indian actor. *Angelina Stepanova, 94, Soviet and Russian stage and film actress, teacher. ===18=== *Domingos da Guia, 87, Brazilian football player and manager, stroke. *Bruno Fait, 75, Italian racewalker and Olympian. *Denis Gifford, 72, British writer, broadcaster and journalist. *Doyle Lade, 79, American baseball player. *Yusuf Ludhianvi, 67/68, Pakistani Muslim scholar, author and muhaddith, murdered. ===19=== *Lee Brewster, 57, American drag queen and transvestite activist, cancer. *John Grigas, 79, American gridiron football player. *Evgeniy Vasilievich Khrunov, 66, Soviet cosmonaut, heart attack. *Larry Lamb, 70, British newspaper editor. ===20=== *Adelaide Aglietta, 59, Italian politician. *Charles Antenen, 70, Swiss football player. *Edward Bernds, 94, American director. *Dick Brown, 74, Canadian football player. *Loyd Jowers, 73, American restaurateur, heart attack. *David Pearce, 41, Welsh heavyweight boxing champion. *Jean-Pierre Rampal, 78, French flautist, heart failure. *Malik Sealy, 30, American basketball player, traffic collision. ===21=== *Jules Alfonse, 88, American gridiron football player. *Barbara Cartland, 98, English novelist. *Buzzy Drootin, 80, American jazz drummer. *John Gielgud, 96, English actor. *Dulcie Holland, 87, Australian composer and music educator. *Mark R. Hughes, 44, American entrepreneur and founder of Herbalife, accidental overdose. *Erich Mielke, 92, German communist official. *Zhao Puchu, 92, Chinese religious leader and calligrapher. *Mahmoud Zuabi, Syrian politician and Prime Minister, suicide (disputed). ===22=== *Bahadoor, Indian actor. *Krzysztof Boruń, 76, Polish physicist, journalist and science fiction writer. *David Brookman, 83, Australian politician, traffic collision. *Eldridge Dickey, 54, American gridiron football player, stroke. *Davie Fulton, 84, Canadian politician and judge. *Gary Kerkorian, 70, American football player. *Bennie Lee Sinclair, 61, American poet, novelist, and short story writer, heart attack. *David Chadwick Smith, 68, Canadian economist. *José Rafael Molina Ureña, 79, President of the Dominican Republic. ===23=== *Eddy Blondeel, 94, Belgian commander of the SAS during WWII. *Roger Garrett, 59, American actor. *Jack Halliday, 71, American gridiron football player. *Mishari bin Abdulaziz Al Saud, Saudi prince as member of the House of Saud. ===24=== *Kevin Lyons, 77, Australian politician. *Kurt Schork, 53, American reporter and war correspondent, homicide. *Majrooh Sultanpuri, 80, Indian Urdu poet and lyricist. *Cliff Sutter, 89, American tennis player. *Oleg Yefremov, 72, Soviet/Russian actor and theatre producer, lung disease. ===25=== *Ken Bousfield, 80, British golfer. *Nicholas Clay, 53, British actor, liver cancer. *Elizabeth Durack, 84, Australian artist and writer. *Seymour S. Kety, 84, American neuroscientist. *Francis Lederer, 100, Austrian-American actor. *Jaya Pathirana, 79, Sri Lankan Supreme Court justice. ===26=== *Sandra Gwyn, 65, Canadian journalist and writer. *William McCaughey, 70, American sound engineer. *Hamp Pool, 85, American football player, coach and scout, heart failure. *Max Schellenberg, 72, Swiss racing cyclist. *Samuel A. Taylor, 87, American playwright and screenwriter, heart failure. *Vernon Crompton Woodward, 83, Canadian fighter pilot and flying ace during World War II. *Sō Yamamura, 90, Japanese actor and film director, heart attack. ===27=== *Inga Abel, 53, German actress, cancer. *Prince Gonzalo de Bourbon, 62, Spanish aristocrat, leukemia. *Kazimierz Leski, 87, Polish engineer, fighter pilot, and (counter-)intelligence officer. *Murray MacLehose, 82, British diplomat, Governor of Hong Kong. *Maurice Richard, 78, Canadian hockey player, cardiovascular disease. ===28=== *George Irving Bell, 73, American scientist and mountaineer. *Donald Davies, 75, Welsh computer scientist. *Maraden Panggabean, 77, Indonesian Army general and Defense Minister, cerebrovascular disease. *Vincentas Sladkevičius, 79, Lithuanian Cardinal of the Roman Catholic Church. *Eric Turner, 31, American gridiron football player, stomach cancer. *Francisco Vestil, 86, Filipino basketball player and Olympian. *Heleen Sancisi Weerdenburg, 56, Dutch historian. ===29=== *Clement Isong, 80, Nigerian banker and politician. *Robert T. Oliver, 90, American author and lecturer. *Aubrey Richards, 79, British actor. *Anthony Spinelli, 73, American actor and producer. *Doreen Young Wickremasinghe, 93, British communist politician. ===30=== *Tex Beneke, 86, American bandleader and musician (Glenn Miller Orchestra). *Iko Carreira, 66, Angolan army general and politician. *Robert P. Casey, 68, American lawyer and politician, amyloidosis. *Doris Hare, 95, Welsh actress. *Daisuke Inoue, 58, Japanese singer and composer, suicide. *Ram Vilas Sharma, 87, Indian academic, poet and writer. *Bill Thomas, 78, American costume designer. ===31=== *John Coolidge, 93, American businessman and son of President Calvin Coolidge. *Andrew Faulds, 77, British actor and Lpolitician. *Erich Kähler, 94, German mathematician. *Petar Mladenov, 63, Bulgarian communist diplomat and politician. *Nikolaos Oikonomides, 66, Greek byzantinist. *Rodolfo Pini, 73, Uruguayan football player. *Tito Puente, 77, American musician, songwriter (\"Oye Como Va\") and record producer, cardiac surgery. *Joe Puma, 72, American jazz guitarist. *Hank Ruszkowski, 74, American baseball player. *Walter Sparrow, 73, English film and television actor. *Johnnie Taylor, 66, American singer, heart attack. *A. Jeyaratnam Wilson, 72, Sri Lankan Tamil academic, historian and author. ==References== *5 Category:May 2000 events",
 "title": "Deaths in May 2000"
}