{
 "id": "1087018",
 "text": "Lily Gladstone (born August 2, 1986) is an American actress. She is known for playing Mollie Kyle in Martin Scorsese's crime drama movie Killers of the Flower Moon (2023). She won a Golden Globe Award and a Screen Actors Guild Award for this role, while being nominated for the Academy Award for Best Actress. In 2024, she appeared in the television series Under the Bridge and was nominated for a Primetime Emmy Award. ==Early life== Gladstone was born in Kalispell, Montana. She was raised on the Blackfeet Reservation in Browning, Montana and Seattle, Washington. Gladstone is of Piegan Blackfeet, Nez Perce, and European heritage. Gladstone always wanted to play an Ewok after watching Return of the Jedi at the age of five and this inspired her to become an actress. In 2008 she graduated from the University of Montana with a Bachelor of Fine Arts (BFA) in Acting/Directing and a Native American Studies minor. ==Career== Gladstone appeared in several independent movies such as Certain Women (2016) and First Cow (2019). She also appeared in episodes of HBO's Room 104 (2017–2020), Showtime's Billions (2016–2023), and FX's Reservation Dogs (2021–2023). In 2023, Gladstone appeared as Mollie Kyle in the Martin Scorsese movie Killers of the Flower Moon. In 2024, she became the first Native American to win the Golden Globe Award for Best Actress in a Motion Picture – Drama and the Screen Actors Guild Award and is the first to be nominated for the Academy Award for Best Actress. In 2024, she starred in the crime drama miniseries Under the Bridge. This role earned her a nomination for a Primetime Emmy Award. ==Personal life== Gladstone goes by both she and they pronouns. She said that \"In most Native languages, most Indigenous languages, Blackfeet included, there are no gendered pronouns. There is no he/she, there's only they... my pronoun use is partly a way of decolonizing gender for myself.\" ==Notes== ==References== ==Other websites== * Category:1986 births Category:Living people Category:American movie actors Category:American television actors Category:American stage actors Category:Screen Actors Guild Award winners Category:Golden Globe Award winning actors Category:Actors from Seattle Category:Actors from Montana Category:People from Kalispell, Montana Category:Native American actors Category:LGBT actors Category:Queer people",
 "title": "Lily Gladstone"
}