{
 "id": "1087996",
 "text": "Duke of Sussex is a noble title given to a male member of the British Royal Family. It is considered a hereditary title, meaning it can be passed down from father to son. The title was first created in 1801 and given to Prince Augustus Frederick, Duke of Sussex, the sixth son of King George III. It is one of several royal dukedoms in the British peerage system. This title became extinct in 1843 when Prince Augustus Frederick died without any sons. The title was revived in 2018 and bestowed upon Prince Harry, the younger son of King Charles III, on the occasion of his wedding to Meghan Markle. The wife of the Duke of Sussex is called the Duchess of Sussex. == History == The word \"Duke\" is linked to Sussex way back in history. This area used to be a separate kingdom called Sussex, ruled by kings. Around the year 827, another kingdom called Wessex took over Sussex. Later, both became part of what we now know as England. Interesting fact: sometimes these early Sussex kings were called \"ealdormen\" or even \"duces\" in Latin, which can be kind of like saying \"duke\". In 1801, the special title \"Duke of Sussex\" was given for the first time to Prince Augustus Frederick. He was the sixth son of King George III. Interestingly, he also received two other titles that same day: Baron Arklow and Earl of Inverness. But these titles all disappeared when Prince Augustus Frederick died in 1843. Although the Prince was survived by a son and daughter by Lady Augusta Murray, their marriage (purportedly solemnized at St George's Hanover Square Church, Westminster, in 1793) had been annulled for lack of royal permission under the Royal Marriages Act 1772, rendering the children illegitimate under English law and unable to inherit titles from their father. Both children by the annulled marriage died childless, rendering the issue of their inheritance moot. Prince Augustus married again in 1831, but this time he broke the rules (called the Royal Marriages Act) again! He married Lady Cecilia Gore in London. Because of this she didn't become a legitimate wife of Prince Augustus, Lady Cecilia couldn't join the royal family at official events. But later, in 1840, Queen Victoria gave Lady Cecilia her own special title, Duchess of Inverness. In 2018, when Prince Harry, grandson of Queen Elizabeth, married Meghan Markle, he received a special title - Duke of Sussex! This title was brought back just for him, as the previous Duke lived a long time ago. Meghan, his wife, became the first ever Duchess of Sussex. He also got other lesser titles for different parts of the UK. A year later, they welcomed a son, Prince Archie, who inherits these titles when he grows up. ==Related pages== * Titles of European royal heirs == References == Category:Monarchy of the United Kingdom",
 "title": "Duke of Sussex"
}