{
 "id": "1088696",
 "text": "Despicable Me 4 is a 2024 animated movie produced by Chris Meledandri and Brett Hoffman. It was released on July 3, 2024. == Sypnosis == Gru (Carell), the world's favorite supervillain-turned-Anti-Villain League-agent, returns for an exciting, bold new era of Minions mayhem, alongside his wife and fellow Anti-Villain League-agent Lucy (Wiig), their three adopted girls —Margo (Cosgrove), Edith (Gaier) and Agnes (Polan)— and the newest member to the Gru family, Gru Jr., who is intent on tormenting his dad. The family is forced to go on the run when they become targeted by escaped criminal Ilon larson (Ferrell) and his femme fatale girlfriend Valentina (Vergara). \\- Universal Pictures and Illumination == Cast == * Steve Carell as: ** Gru, a former supervillain turned Anti-Villain League agent; Margo, Edith, and Agnes' adoptive father, Gru Jr.'s biological father, Lucy's husband, Dru's twin brother and Marlena's son. ** Dru, Gru's twin brother, Margo, Edith, and Agnes' adoptive uncle, Gru Jr.'s biological uncle, Lucy's brother-in-law and Marlena's other son. * Kristen Wiig as: * Lucy Wilde, an Anti-Villain League agent, Gru's wife, the girls' adopted mother and Gru Jr.'s biological mother, Dru's sister-in-law and Marlena's daughter-in-law.. * Will Ferrell as Maxime Le Mal, a supervillain who seeks revenge on Gru and his family * Joey King as Poppy, an aspiring supervillain * Sofía Vergara as Valentina, Le Mal's femme fatale girlfriend * Miranda Cosgrove as Margo, Gru and Lucy's oldest adopted daughter * Steve Coogan as Silas Ramsbottom, the former director of the Anti- Villain League, having retired in the previous film * Pierre Coffin as the Minions, the yellow henchmen of Gru * Dana Gaier as Edith, Gru and Lucy's middle adopted daughter * Madison Polan as Agnes, Gru and Lucy's youngest adopted daughter. Polan replaces Nev Scharrel from the third film. * Romesh Ranganathan as Dr. Nefario, Gru's gadgeteer who provides inventions for him and his Minions. Ranganathan replaces Nefario's long-time actor, Russell Brand. * Julie Andrews as Marlena, Gru and Dru's mother, Lucy's mother-in-law, Margo, Edith, and Agnes' adoptive grandmother and Gru Jr.'s biological grandmother. * John DiMaggio as Karl, a bus driver who works for the AVL transporting the remaining Minions to their new destination. Jason Segel as Vector, the main antagonist of the first film and Mr. Perkins' son. * Jack McBrayer as Justin's father, one of the AVL Maximum Security prisoners. * Will Arnett as Mr. Perkins, the founder of the Bank of Evil and Vector's father. * Benjamin Bratt as El Macho, the main antagonist of the second film. * Sandra Bullock as Scarlet Overkill, the main antagonist of Minions and Herb's wife. * Jon Hamm as Herb Overkill, Scarlet's husband. * Andy Nyman as Frankie Fishlips, a green fish-like monster and a student of Lycee Pas Bon. * Trey Parker as Balthazar Bratt, the main antagonist of the third film. * Taraji P. Henson as Belle Bottom, the leader of The Vicious 6. * Jean-Claude Van Damme as Jean Clawed, the giant lobster clawed member of The Vicious 6. * Lucy Lawless as Nun-Chuck, the nun member of The Vicious 6. * Dolph Lundgren as Svengeance, a member of The Vicious 6. * Danny Trejo as Stronghold, a member of The Vicious 6. * Additionally, American basketballer et LeBron James and English pop group Tears for Fears have cameos. * Additionally, Stephen Colbert, Chloe Fineman, and Chris Renaud have been cast in undisclosed roles. ==References== Category:2024 movies Category:2024 adventure movies Category:2024 animated movies Category:2024 comedy movies Category:2020s computer-animated movies Category:2020s English-language movies Category:2020s sequel movies Category:3D movies Category:American adventure movies Category:Adventure comedy movies Category:American family comedy movies Category:Computer-animated movies Category:American sequel movies Category:Universal Pictures movies Category:Illumination movies Category:Despicable Me",
 "title": "Despicable Me 4"
}