{
 "id": "1088617",
 "text": "The General Electric Company (GEC) was a major British conglomerate company involved in consumer and defence electronics, communications, and engineering. It started in 1886 as G. Binswanger and Company, an electrical goods wholesaler in London. It sold electrical components over the counter which was not common then. In 1889, the business was incorporated as the General Electric Company Ltd. It became a public limited company in 1900. During the 1890s and 1900s, the company heavily invested into electric lighting, which was very profitable. In the First World War it supplied the military, and becoming a major player in the electrical industry. In 1921, a new purpose- built company headquarters (Magnet House) was opened in Kingsway, London; two years later, GEC's industrial research laboratories at Wembley (later named the Hirst Research Centre) opened. In the 1920s, the company was heavily involved in building Britain's National Grid. During the Second World War, GEC made several significant contributions to the Allied war effort, such as the development of the cavity magnetron for radar, various advances in communications technology, and the mass production of valves, lamps, and lighting equipment. In 1961, GEC merged with Radio & Allied Industries. In the 1960s, GEC's new managing director, Arnold Weinstock did cut-backs and mergers that returned the company to profit. GEC bought Associated Electrical Industries in 1967, and merged with English Electric one year later. The company bought W & T Avery, Cincinnati Electronics, and Picker Corporation. During the 1980s, the company was Britain's largest private employer with over 250,000 employees; becoming one of the first companies in the new FTSE 100 Index in 1984. It made more than £1 billion per year at its peak in the 1990s. In June 1998, GEC sold its share of the joint venture GEC-Alsthom on the Paris stock exchange. During December 1999, GEC's defence arm, Marconi Electronic Systems, was sold to British Aerospace, forming BAE Systems. The rest of GEC, mainly telecommunications equipment manufacturing, continued as Marconi Communications. After buying several US telecoms manufacturers at the top of the market, losses following the bursting of the dot-com bubble in 2001 led to the restructuring in 2003 of Marconi plc into Marconi Corporation plc. During 2005, the company failed to secure any part of BT's 21st Century Network programme; that same year, Ericsson acquired the bulk of the company; what was left of the business was renamed Telent. It closed in 2006. ==References== Category:Companies listed on the London Stock Exchange Category:Manufacturing companies of the United Kingdom Category:1886 establishments in the United Kingdom",
 "title": "General Electric Company plc"
}