{
 "id": "1088023",
 "text": "The Riot Act (1 Geo. 1. St. 2. c. 5), sometimes called the Riot Act 1714 or the Riot Act 1715, was an act of the Parliament of Great Britain. It gave local authorities power to declare any group of 12 or more people to be unlawfully assembled and order them to disperse or be punished. The act's full title was \"An Act for preventing tumults and riotous assemblies, and for the more speedy and effectual punishing the rioters\". It came into force on 1 August 1715. It was repealed in England and Wales by section 10(2) and Part III of Schedule 3 of the Criminal Law Act 1967. Acts like it were part of the laws of British colonies in Australia and North America, some of which remain in force today. The phrase \"read the riot act\" means a warning of consequences. It was introduced during a time of riots in England. The preamble makes reference to \"many rebellious riots and tumults [that] have been [taking place of late] in diverse parts of this kingdom\", adding that those involved \"presum[e] so to do, for that the punishments provided by the laws now in being are not adequate to such heinous offences\". ==Proclamation of riotous assembly== Local officials could make an announcement ordering the dispersal of any group of twelve or more people who were \"unlawfully, riotously, and tumultuously assembled together\". If the group failed to disperse within one hour, then anyone remaining gathered was guilty of a felony without benefit of clergy, punishable by death. This could be made in an incorporated town or city by the mayor, bailiff or \"other head officer\", or a justice of the peace. Elsewhere it could be made by a justice of the peace or the sheriff, undersheriff or parish constable. It had to be read out to the gathering concerned and had to follow precise wording detailed in the act; several convictions were overturned because some words had been left out, in particular \"God save the King\". The wording that had to be read out to the assembled gathering was as follows: In a number of jurisdictions, such as Britain, Canada and New Zealand, these words were put in the law itself. In New Zealand's Crimes Act 1961, section 88, repealed since 1987, was specifically given the heading of \"Reading the Riot Act\". ==References== Category:1715 Category:Acts of the Parliament of Great Britain",
 "title": "Riot Act"
}