{
 "id": "1088860",
 "text": "Below is a list of the governors of early California from 1769 to 1850. ==Spanish rule (1769–1822)== The Spanish Empire established its rule in the Californias in 1769. During this time, the Californias encompassed a massive territorial expanse, including both Alta California (present day U.S. state of California) and Baja California (present day Mexican states of Baja California and Baja California Sur), which were governed under a military administration led by the Governor of the Californias. In 1804, the Californias were officially divided into two administrations: Alta California, based in Monterey, and Baja California. * Gaspar de Portolá November 30, 1767 – July 9, 1770 * Felipe de Barri 1770-1774 * Pedro Fages 1770-1774 * Fernando Rivera y Moncada 9 July 1770-1777 * Felipe de Neve 1777–1782 * Pedro Fages 1782-1792 * José Antonio Roméu 1791-1892 * José Joaquín de Arrillaga 1792-1794 * Diego de Borica 1794-1800 * Pedro de Alberní y Teixidor 1800-1800 * José Joaquín de Arrillaga 1800-1814 * José Darío Argüello 1814-1815 * Pablo Vicente de Solá 1815-1822 ==Mexican rule (1822–1846)== Following the Mexican War of Independence from the Spanish, both of the Californias became part of the newly independent Mexico in 1822. Mexican rule was interrupted from 1836 to 1838 by the Californio independence movement led by Juan Bautista Alvarado, who was acclaimed President of Alta California. However, Alvarado entered into negotiations with the Mexican government in 1838, which resulted in the disbandment of the Californio independence movement in favor of greater independence and the appointment of Alvarado as governor, thus reestablishing Mexican rule in Alta California, which lasted until 1846. * Luis Antonio Argüello 1822–1825 * José María de Echeandía 1825-1831 * Manuel Victoria 1831-1832 * José María de Echeandía 1932-1833 * José Figueroa 1833-1834 * José Castro 29 September 1835 – 1 January 1836 * Nicolás Gutiérrez 2 January 1836 – 3 May 1836 (interim) * Mariano Chico 1836-1836 * Nicolás Gutiérrez 1836-1836 (interim) * Juan Bautista Alvarado 1836–1837 * Carlos Antonio Carrillo 6 December 1837 – 20 May 1838 (Nominated) * Juan Bautista Alvarado 1837–1842 * Manuel Micheltorena 31 December 1842 – 22 February 1845 * Pío Pico 22 February 1845 – 10 August 1846 * José María Flores 1846-1847 ==American rule== Following the American conquest of California, forces part of the Pacific Squadron and California Battalion established U.S. military rule in California, beginning in 1846. Military governors ruled California until 1849, when efforts led by Bennet C. Riley led to the creation of the Constitution of California at the Constitutional Convention of Monterey and the establishment of civilian rule with the election of Peter Hardeman Burnett as the first Governor of California. Soon after, California was admitted as a state. * John D. Sloat July 7 – 29, 1846 * Robert F. Stockton July 29, 1846 – January 16, 1847 * John C. Frémont January 19, 1847 – February 13, 1847 * Stephen W. Kearny February 23, 1847 – May 31, 1847 * Richard Barnes Mason May 31, 1847 – April 13, 1849 * Persifor Frazer Smith February 28, 1849 – April 12, 1849 * Bennet C. Riley April 12, 1849 – December 20, 1849 == See also == *Governor of California *List of governors of California since 1850 *",
 "title": "List of governors of California before 1850"
}