{
 "id": "1088687",
 "text": "Amir Kabir (Persian: امیرکبیر) (9 January 1807 – 10 January 1852), born Mirza Taghi Khan, was a prominent statesman and chief minister to Naser al-Din Shah during the Qajar dynasty in 19th-century Iran. His influential role, marked by extensive reforms and diplomatic initiatives, has left a lasting impact on Iranian history.^ History of Iran: Mirza Taqi Khan, Amir Kabir,https://iranchamber.com/history/amir_kabir/amir_kabir.php ==Early Life and Rise to Power== Amir Kabir rose to prominence during a tumultuous period in Iran. Born in 1807, he initially served as a courtier before catching the eye of Naser al-Din Shah. With the Shah's support, he climbed the ranks swiftly, eventually becoming the chief minister in 1848.امیر کبیر و ایران - فریدون آدمیت شابک ۹۷۸-۹۶۴-۴۸۷-۰۳۰-۹ صفحه ۱۹۴ تا ۱۹۷ (Amir Kabir and Iran - Fereydon Admit Shabak 978-964-487-030-9 pages 194 to 197) ==Internal Reforms== One of Amir Kabir's most notable legacies lies in his internal reforms. Drawing inspiration from European models, he aimed to modernize Iran's administrative, economic, and educational systems. Amir Kabir implemented administrative restructuring, creating new ministries and rationalizing governmental functions. He took significant steps to bolster education, establishing the Dar ul-Funun, Iran's first modern university, in 1851.https://www.jadidonline.com/stry/22092008/frnk/darolfonoon This institution aimed to provide both scientific and technical education, marking a departure from traditional religious-centered learning.Other of Amīr Kabīr’s early reforms related to military affairs, an area, like finance, in which he had acquired considerable experience while in Azerbaijan.,https://iranicaonline.org/articles/amir-e-kabir-mirza-taqi-khan ==Friendly Approach to Minorities == Amir Kabir demonstrated a benevolent (good-natured) attitude towards Iran's non-Muslim minorities, driven by a strategic vision to strengthen the state. Learning from European interventions in Ottoman affairs, he aimed to eliminate possible grievances that might invite foreign interference. He exempted priests from taxation, supported Christian schools, and fostered a positive relationship with the Zoroastrian community.https://iranicaonline.org/articles/amir-e-kabir-mirza-taqi-khan ==Foreign Policy: Negative Equilibrium== Amir Kabir's foreign policy was innovative, emphasizing a \"negative equilibrium\" by avoiding excessive concessions to either Britain or Russia. He sought to end Russian influence in the Caspian Sea and limit British control in the Persian Gulf. To counteract external pressures, he engaged with powers like Austria and the United States and established a counter-espionage organization.The foreign policy of Amīr Kabīr was as strikingly innovative as his internal policies. He has been credited with originating the policy of “negative equilibrium,” i.e., …, https://iranicaonline.org/articles/amir-e-kabir-mirza-taqi-khan ==Suppression of Bábís== Amidst his modernization efforts, Amir Kabir faced internal challenges from the Bábí movement, considered a threat by the clerical establishment. He repressed the Bábís, leading to confrontations and mass killings. The execution of The Báb in 1850 marked a significant event, reflecting a clash between Amir Kabir's authoritarian reforms and the Bábís' call for religious renewal.https://iranicaonline.org/articles/martyrs-babi- babi ==Downfall of Mirza Taqi Khan Amir Kabir== On 11 November 1851, Nasir al- Din Shah, the 20-year-old ruler of the Qajar dynasty of Iran, deposed his guardian and brother-in-law Mirza Taqi Khan Farahani, better known as Amir Kabir, from the position of prime minister. However, he allowed Amir Kabir to continue as commander-in-chief of the army. \"Since the office of Grand Chancellor involves too much work,\" the shah wrote to Amir Kabir, \"and the burden of such a task was heavy for you, we have relieved you of this duty. You must continue as Commander-in-Chief with full confidence .\" Just two months later, on 10 January 1852, Amir Kabir was secretly executed in the bathhouse of the royal garden of Fin near Kashan, where he had spent the last days of his exile.https://www.cambridge.org/core/journals/international- journal-of-middle-east-studies/article/abs/downfall-of-mirza-taqi-khan-amir- kabir-and-the-problem-of-ministerial-authority-in-qajar- iran/E6C4E18B7D0089B1BB80807B750DDD10 ==Legacy and Impact== Amir Kabir's legacy is complex. While his modernization efforts laid foundations for change, his authoritarian methods and suppression of dissent, especially the Bábís, had profound consequences. The unintended consolidation of clerical power following the Bábí conflict shaped Iran's trajectory for decades. Amir Kabir's life remains a pivotal chapter in Iranian history, embodying the challenges and complexities of navigating tradition and modernity during a transformative era.https://iranicaonline.org/articles/amir-e-kabir-mirza-taqi- khan == References == Category:1807 births Category:1852 deaths Category:Prime Ministers of Iran",
 "title": "Amir Kabir"
}