{
 "id": "1088430",
 "text": "David Michael Culhane (September 22, 1930 – February 24, 2024) was an American journalist and television news correspondent. He worked in radio, print, and television, with time at the Baltimore Sun, CBS News, and NPR. Culhane was the London Bureau Chief of the Baltimore Sun and host of the BBC's International Magazine before joining CBS News in 1967. In May 1968, Culhane reported with Charles Kuralt on malnutrition in the Peabody Award-winning documentary CBS New Reports: Hunger in America. Senator George McGovern noted that seeing the program prompted him to introduce the resolution that would create the Senate Select Committee on Nutrition and Human Needs. Culhane contributed to other CBS documentaries, including CBS Inquiry: The American Assassins with Dan Rather and a special report, The Trouble with Rock, about the CBS Records scandal that resulted in Clive Davis's firing from CBS Records. Throughout his time at the network, Culhane reported for the CBS Evening News with Walter Cronkite and later Dan Rather. Culhane and Cronkite had a shared passion for sailing. The Culhane sailboat meeting up with Cronkite and his boat in Martha’s Vineyard in the summers is a cherished memory of David’s children. Philip Culhane His work spanned the globe, with reports on the U.S. military's Operation Phoenix in Vietnam, the U.S. forces pull out from Che San, and the Tet Offensive, and student protests in Beijing's Tienanmen Square in 1989. In 1979, Culhane joined Kuralt and others, launching the program CBS News Sunday Morning. His cover stories included an Emmy-winning piece about Vietnam veterans, \"After the Parades,\" profiles on artists, poverty in the South Bronx, whale conservationists, and presidential candidates. Culhane retired from CBS News in 1995 and moved to Paris where he reported for NPR. Culhane was born in Chicago, Illinois, and grew up in Detroit, Michigan. He died on February 24, 2024, surrounded by family at home in Larchmont, New York, at 93 years old. Culhane got his bachelor's degree at the University of Detroit and later graduated from the University of Michigan with a master's degree and an encyclopedic knowledge of poetry and literature. It was in literature that David found wisdom and solace. Perhaps his two most cherished books were War and Peace and Absalom, Absalom! His children were all deeply influenced by his learning and teaching.Philip Culhane David is survived by his wife Anne Culhane, his children Stephen, Philip, Max, and Coco, and his grandchildren Veronica, Charles, Maeve, Henry, Lilou, and Dechen.philip culhane He is also survived by former wives, Jennifer (King) Janzen and Mory (Gilbert) Wrase.Added by Philip Culhane, August 18, 2025 ==References== Category:1930 births Category:2024 deaths Category:American journalists",
 "title": "David Culhane"
}