{
 "id": "1088508",
 "text": "BAE Systems plc (BAE) is a British multinational arms, security and aerospace company, based in London, England. It is the biggest manufacturer in Britain as of 2017. It is the largest defence contractor in Europe and the seventh- largest in the world based on 2021 revenues. == Locations == BAE's largest operations are in the United Kingdom and in the United States. In the U.S., BAE Systems Inc. subsidiary is one of the six largest suppliers to the US Department of Defense. Its next biggest markets are Saudi Arabia, then Australia; other major markets include Canada, Japan, India, Turkey, Qatar, Oman and Sweden. == Establishment == The company was formed on 30 November 1999 by merger of Marconi Electronic Systems, the defence electronics and naval shipbuilding subsidiary of the General Electric Company plc, with British Aerospace, an aircraft, munitions and naval systems manufacturer. == Successions == BAE is the successor to many aircraft, shipbuilding, armoured vehicle, armaments and defence electronics companies. These include the Marconi Company, the first commercial company for the development and use of radio; A.V. Roe and Company, one of the world's first aircraft companies; de Havilland, manufacturer of the Comet, the world's first commercial jet airliner; Hawker Siddeley, manufacturer of the Harrier, the world's first VTOL attack aircraft; British Aircraft Corporation, co-manufacturer of the Concorde supersonic transport; Supermarine, manufacturer of the Spitfire; Yarrow Shipbuilders, builder of the Royal Navy's first destroyers; Fairfield Shipbuilding and Engineering Company, builder of the world's first battlecruiser; and Vickers Shipbuilding and Engineering, builder of the Royal Navy's first submarines. == Buying other businesses == Since 1999, BAE has bought other businesses. They bought United Defense and Armor Holdings of the United States, and has sold its shares in Airbus, Astrium, AMS and Atlas Elektronik. It is involved in several major defence projects. These include the Lockheed Martin F-35 Lightning II, the Eurofighter Typhoon, the , and the s. BAE Systems is listed on the London Stock Exchange's FTSE 100 Index. ==References== Category:Military organizations Category:Manufacturing companies of the United Kingdom Category:1999 establishments in England",
 "title": "BAE Systems"
}