{
 "id": "1088012",
 "text": "Mercurana is a group of frogs that live in trees in the family Rhacophoridae. Scientists named it for its only species Mercurana myristicapalustris, which lives in the Western Ghat Mountains in Kerala, India. The English name is for the singer Freddie Mercury, from the band Queen and the Latin name for \"frog\" (Rana). The frog is different from other frogs in that it has a lot of webbed skin on its toes, lives only in swamps, and lays its eggs on mud mixed with leaf litter. ==Discovery and name== Scientists caught the type species (holotype) of Mercurana was collected on May 18, 2012 in bushes near the edge of a temple compound, Arippa, near Kulathupuzha Reserve Forest. This temple is in Kollam district, Kerala, India. It was a single adult male frog. They found two more adult males on July 12, 2012. The first paper about this frog was published on April 17, 2013 in the journal Zootaxa. The scientists chose to name the frog Mercury because Freddie Mercury's \"vibrant music was inspiring.\" Further, Freddie Mercury was of Indian-Parsi origin and spent much of his childhood in Panchgani, which is in the northern part of the mountain range where the frog was found. The specific name comes from the words Myristica (a genus of the nutmeg family of trees), and palustris, which is Latin for \"swampy,\" because the frog lives in swamps with Myristica trees. The frog is a delicate habitat, which means that small chances can have big results. ==Description== Mercurana are medium-sized frogs; male adults are about 35 mm in from nose to rear end, and the female frog can be as long as 65 mm. They have a slender body which is rusty-brown in color with small black spots on the back. Females frogs are greenish-yellow in color on the back. The dorsal surface of the skin is a rough and bumpy. The belly side is gradually lightened and becomes mostly white. Some areas of the underside of the fore- and hind-limbs have patches of yellow color. The snout is rounded and sticks out. Unlike other related species, Mercurana has large toes on its back feet with lots of webbed skin, but there is no webbed skin on the front feet, which have large disks on them for climbing. This frog has vomerine teeth in its jaw and bumps on its tongue. These frogs have dark eyes, with oval-shaped pupils that go side to side. ==Biology== Mercurana live in trees in swamp forests. They lay eggs before the yearly rainstorms. During the breeding season, males call females at sunset while sitting on trunks of tree saplings or on the branches of understorey plants, generally 0.25–1.5 m above the forest floor. Different advertisement call types were observed. Sometimes males fight each other for good places to sit and call. The female climbs down to the male they mate by holding on to each other with their front legs. Then they climb down to the forest floor and dig up the leaf litter to reach the soil below. The female (still in amplexus) used her pointed snout to make a shallow hole in the soil. She then turns around to position the posterior ends of the pair over the hole, and she lays her eggs. She lays about 130 eggs at a time. This takes about one hour. The eggs are clear and not colored. The female then uses her back legs to mix the eggs into the soil. Then the two adult frogs leave. About seven days later, the tadpoles come out of the eggs. The tadpole is oval and depressed with a brown body and a pale-brown to off-white tail. The body, tail, and fins have scattered dark brown spots. ==Distribution== Mercurana lives in India. The monotypic species Mercurana myristicapalustris has been found only in the western foothills of the Agasthyamalai Hill Range in Kerala. People have seen these frogs in swampy forest 100 to 300 m above sea level, where Myristica trees grow. ==References== ==Other websites== *Comparative Toxicogenomics Database *UniProt Taxonomy *Advertisement call of Mercurana myristicapalustris *Focussing on Wildlife *Photograph of Mercurana myristicapalustris *Discovery news at ENVIS Centre, Kerala Category:Frogs of Asia Category:Animals of India",
 "title": "Mercurana"
}