{
 "id": "1089971",
 "text": "Sami Yousafzai (Pashto: سمی یوسفزی) is an Afghan Journalist and War Reporter in Afghanistan and Pakistan. ==Background== Abdul Sami Yousafzai was born in Afghanistan in 1972 to a Yusufzai Pashtun family, as a boy he along with his family became refugees of the Soviet-Afghan War after 1979 and they had to leave their hometown. He grew up alongside millions more Afghan Refugee Children in the city of Peshawar, Pakistan.CBS News (Aug 2022) Why it's hard to have hope for Afghanistan by Sami Yousafzai ==Career== In 1993 he studied Journalism at Dawa'a al-Jihad University set up at an Afghan Refugee camp by Afghan Mujahideen Fighter Abdul Rasul Sayyaf. He initially started as a sports journalist but switched to begin a career in war reporting in 1997. He covered militancy politics for Newsweek Magazine and the Daily Beast News Publication as well as a producer for CBS News since 2005. Throughout his career he has met with Taliban Officials in Afghanistan as well as the President of Afghanistan, Hamid Karzai in 2013. He also met with the Taliban delegation in 2019 at Moscow, Russia including Salam Hanafi, who would become Deputy Prime Minister of Afghanistan.Business Insider - Sami YousafzaiDaily Beast Correspondents Author - Sami Yousafzai ==Journalist Attack== In 2008, a Taliban Commander invited him and a Japanese Journalist friend of his, Motoki Yodsukura for an interview in the outskirts of Peshawar, where instead a gunman opened fired on him with two shots. He sustained one shot in the hand and the other by his chest, skimming past his heart and was lodged in his left arm.Frontline Club - Two journalists shot in PakistanThe New York Times (Nov. 14 2008) 2 Journalists in Pakistan Are Wounded by Gunmen By Jane Perlez and Pir Zubair ShahGlobal Terrorism Database (GTD) 200811140008 - Incident North- West Frontier Province == References == Category:1972 births Category:Living people Category:Journalists Category:War correspondents Category:Afghan refugees Category:21st-century Afghan people Category:20th-century Afghan people",
 "title": "Sami Yousafzai"
}