{
 "id": "1089336",
 "text": "The Boeing F/A-18E/F Super Hornet models are a multi-role fighter aircrafts, derived from the McDonnell Douglas F/A-18A/B Hornets, The Key differences between the two is the increased wingspan (which was increased from 27.5 to 40.4ft) to make room for more weapons, the Intakes are different, the Classic Hornet, has rounded intakes, the Super Hornet has rectangular intakes. The F/A-18E is the Single Seat Variant, the F is the Duel Seat Variant, and the E/A-18G (which comes from the F/A-18F variant) is the Electronic Variant. == Origins == Origins of the Super Hornets were to replace the United States Navy’s aging F-14 Fleet, The F-14’s were getting old and the Classic Hornets were made to replace earlier models of the F-14. === Testing and Production === The testing and production went well for Boeing, the F/A-18’s were slowly phasing out the older F-14B’s, and from 2006 until the 2020’s the US Navy’s fleet was all Hornet variants until the F-35C Lightning II was introduced into the Navy. == Other Users == All users of the Super Hornets are; United States - Operating 512 airframes of the Super Hornet and 155 Growlers, all for the United States Navy Australia - Operating 24 F/A-18F Super Hornets based at No.1 Squadron - Royal Australian Air Force, and 12 E/A-18G Growlers based at No.6 Squadron - Royal Australian Airforce, all are being operated by the Royal Australian Air force, Based at RAAF Base Amberley Kuwait - 28 F/A-18E/F Super Hornets on order, for the Kuwait Air Force == Armament == The Armament of the Super Hornets Includes; * Guns: 1× 20 mm (0.787 in) M61A2 Vulcan, 412 rounds * Hardpoints: 11 (2× wingtips, 6× under-wing, and 3× under-fuselage) with a capacity of Max payload: 17,750 lb (8,050 kg). Carrier bringback payload: F/A-18E: 9,900 lb (4,491 kg), F/A-18F: 9,000 lb (4,082 kg), with provisions to carry combinations of: ** Missiles: *** Air-to-air missiles **** 4× AIM-7 Sparrow **** 4× AIM-9 Sidewinder **** 12× AIM-120 AMRAAM **** 12× AIM-260 JATM (to be integrated) *** Air-to-surface missiles **** 6× AGM-65E/F Maverick **** 4× AGM-84H/K SLAM-ER **** 6× AGM-88 HARM **** 4x AGM-158 JASSM **** 4× AGM-154 Joint Standoff Weapon (JSOW) - glide bomb *** Anti-ship missiles **** 4× AGM-84 Harpoon **** 4× AGM-158C LRASM **** Joint Strike Missile (JSM) (to be integrated) ** Bombs: *** JDAM bombs (up to 10× GBU-32/35/38/54 or 4× GBU-31) *** Paveway series of laser-guided bombs *** Mk 80 series unguided bombs *** CBU-78 Gator mine system[citation needed] *** Mk 20 Rockeye II cluster bomb[citation needed] *** Mk-62/63/65 Quick Strike Naval mine ** Other: *** SUU-42A/A Flares/infrared decoy dispenser pod and chaff pod *** AN/ALE-50 towed decoy system pod *** AN/ASQ-228 ATFLIR or AN/AAQ-28(V) Litening targeting pods *** up to 4× 480 US gal (1,800 L; 400 imp gal) drop tanks and 1× A/A42R-1 Aerial Refueling Store pod for aerial refueling. *** 12× ADM-141C TALD decoys *** AWW-13 Advanced data link pod == Full Page == Boeing F/A-18E/F Super Hornet Category:Aviation",
 "title": "Boeing F/A-18E/F Super Hornet"
}