{
 "id": "1089494",
 "text": "The Polish United Workers' Party, (PZPR), was the communist party which ruled the Polish People's Republic as a one-party state from 1948 to 1989. It was based on the theories of Marxism-Leninism, with a strong emphasis on left-wing nationalism. It had total control over public institutions in the country as well as the Polish People's Army, the Ministry of Public Security, the Citizens' Militia police force and the media. The falsified 1947 Polish legislative election granted the Communist Polish Workers' Party complete political authority in post-war Poland. The PZPR was founded in December 1948 by joining it to the Polish Socialist Party. From 1952 onward, the position of \"First Secretary\" of the Polish United Workers' Party was really Poland's head of state. Throughout its existence it was very close to ideologically-similar parties of the Eastern Bloc, like the Socialist Unity Party of Germany, Communist Party of Czechoslovakia and the Communist Party of the Soviet Union. Between 1948 and 1954, nearly 1.5 million people were Polish United Workers' Party members, and membership rose to 3 million by 1980. The party's main aim was to impose socialist agenda into Polish society. The communist government sought to improve the living standards of the proletariat, make education and healthcare available to all, establish a centralized planned economy, nationalize all institutions and provide internal or external security with a strong armed force. Some ideas imported from abroad, such as large-scale collective farming and secularization, failed in their early stages. The PZPR was more liberal and pro-Western than its counterparts in East Germany or the Soviet Union, and was more averse to radical politics. Although propaganda was used in major media outlets like Trybuna Ludu () and televised Dziennik ('Journal'), censorship stopped working by the mid-1980s and was gradually abolished. The Polish United Worker's Party was responsible for the brutal pacification of civil resistance and protesters in the Poznań protests of 1956, the 1970 Polish protests and throughout martial law between 1981 and 1983. It started a bitter anti-Semitic campaign during the 1968 Polish political crisis, which forced most of the last of Poland's Jews to emigrate. In 1980 the Solidarity movement emerged as a major anti-bureaucratic social movement that pursued social change. With communist rule being relaxed in neighbouring countries, the PZPR lost support and was forced to negotiate with the opposition and adhere to the Polish Round Table Agreement, which permitted free democratic elections. The elections on 4 June 1989 proved victorious for Solidarity, bringing 40-year communist rule in Poland to an end. The Polish United Workers' Party was dissolved in January 1990. ==References== Category:Political parties in Poland",
 "title": "Polish United Workers' Party"
}