{
 "id": "1089233",
 "text": "Megrelian (Megrelian: მარგალური ნინა) is a language of the Zan family within the Kartvelian languages. Along with Georgian, Megrelian is closer to Laz than to any of them individually — to Svan. According to 1989 data, there are approximately 500,000 Georgians who consider Megrelian their native language, most of whom live in the Samegrelo region of Georgia. The region extends from the Black Sea coast near the Zegani and Kolkheti lowlands to the mountains of Svaneti in the northeast and from the northwest to the east to the river Chkheri and beyond to the east. A significant portion of the Megrelian- speaking population (over 40,000 individuals) also resides in Abkhazia. A relatively large number of Megrelian speakers (over 100,000 people) live in the capital of Georgia. After the Abkhazian conflict, a part of the displaced Megrelian-speaking population (approximately 50,000 individuals) left for Russia and continues to live there. UNESCO included Megrelian in the list of endangered languages due to various threats. Megrelian is written in the Georgian script and includes 33 letters of the alphabet, along with the rare letter \"ჸ\" (e.g., \"ჸუდე\" - house, \"ჸორადილი\" - window, \"ჸუჯი\" - ear, etc.) and the interdental sonorant \"ჷ\". Older written texts are primarily ethnographic literature. Several newspapers were printed in Megrelian between 1930-38, including \"Kazaki,\" \"Komuna,\" \"Samargalosh Chai,\" \"Samargalosh Tutumi,\" and \"Makhorkhali.\" A certain amount of editorial work was done to revive the language, including the publication of Megrelian-Georgian and Megrelian-German dictionaries. Givi Eliava published a Megrelian-Georgian dictionary. In the 1960s, Kaka Zvaniani translated and published \"Vepkhistkaosani\" into Megrelian. Books in Megrelian poetry were published by Lasha Gakaria, Guri Otoia, and Giorgi Sichinava. Giorgi Sichinava edited the Megrelian literary journal \"Jurnalioni\" in 2000, and in 2006, the newspaper \"Mapshalia\" was published, which covered various topics. Category:Languages of Georgia (country) Category:Abkhazia",
 "title": "Mingrelian language"
}