{
 "id": "1089630",
 "text": "Big Break was a British game show that aired on BBC1. It was shown from 30 April 1991 and 10 August 2002. It ran for 212 episodes over 10 series. It was hosted by comedian Jim Davidson and snooker player John Virgo. The show was based on the game of snooker. It had people paired with professional snooker players. The person would answer general knowledge questions which gave more time for the players to score snooker points. ==Production== Big Break was first filmed in BBC Elstree Centre but moved to the BBC Television Centre after the fourth series. The show ran for ten series, from 1991 to 2002. It had 212 episodes. The show was hosted by comedian Jim Davidson and snooker player John Virgo. A theme song was created for the show, called \"the snooker song\", was sung by Captain Sensible. ==Format== In Big Break there were three teams of two. Each contestant is joined by a professional snooker player. There were three rounds: red hot, pocket money, and make or break. These names were puns from the snooker terms \"red\", \"pocket\", and \"break\". In red hot contestants were asked three questions. They were then given 10 seconds of time to begin. Each right answer is worth another 10 seconds. On the snooker table, there were ten red snooker balls. The players have as much time as they are given to pot as many balls as possible. The two teams that pot the most red balls move onto the next round. The losing contestant in the first round is given a secondary task, a trick shot. Called Virgo's Trick Shot, the contestant would need to recreate the shot being played. When successful, the contestant won a prize. The second round was called pocket money. On a timer, contestants must answer questions based on the coloured snooker balls. On a correct answer, the snooker player scored points for each ball potted. There were double points for potting balls in certain pockets. When missing a ball, the contestant would answer another question. The pair with the most points reach the final round. The final round, called make or break had the contestant answer five questions. Each correct answer removed a red ball from the table. There was two minutes to pot all of the balls on the table. This included the time given to answer the questions. More prizes would be given to players who were closest to potting all of the balls. The grand prize was usually a holiday. ==Episodes== There were 212 episodes of Big Break across 10 series. Additional episode series containing junior players were also held for three series. Between 1995 and 2001, Big Break also showed nine \"Trick shot\" episodes. They had six professional players and had a different format. Big Break also had eight Christmas special episodes, which had the same format, but the cast had fancy dress. ===Regular=== Series Start date End date Episodes 1 30 April 1991 16 July 1991 12 2 11 January 1992 4 April 1992 13 3 12 September 1992 19 December 1992 15 4 4 September 1993 26 March 1994 27 5 9 September 1994 20 May 1995 27 6 2 September 1995 19 July 1996 27 7 3 January 1997 27 February 1998 28 8 6 March 1998 26 June 1999 26 9 18 December 1999 19 May 2001 24 10 16 June 2001 10 August 2002 13 ===Stars of the Future=== Series Start date End date Episodes 1 27 May 1995 17 June 1995 6 11 May 1996 15 July 1996 2 23 July 1997 3 September 1997 6 3 3 July 1999 11 December 1999 6 ===Trick Shot Specials=== Date 22 August 1995 29 August 1995 19 October 1995 3 August 1996 29 August 1996 27 June 1997 4 July 1997 23 December 1999 3 January 2000 ==References== category:snooker Category:Television series Category:BBC Television programmes Category:1990s British television series Category:1991 television series debuts Category:English-language television programs Category:British television game shows Category:2000s British television series Category:2002 British television series endings",
 "title": "Big Break"
}