{
 "id": "1089866",
 "text": "Warszawa Zachodnia station, in English Warsaw West, is a railway and long- distance bus station in Warsaw, Poland on the border of Ochota and Wola districts. The railway station is the westernmost terminus of the Warsaw Cross-City Line. It serves trains from PKP Intercity, Polregio, Koleje Mazowieckie, Szybka Kolej Miejska and Warszawska Kolej Dojazdowa as well as international trains passing through Warsaw. It is one of the busiest railway stations in Poland, with over 800 daily trains. Despite being one of the chief railway stations on the line towards Warszawa Centralna, there has been limited development of the station since its construction in 1936. However, the station is undergoing an extensive modernization between 2020 and 2023. ==History== The station was built as part of the development of the Warsaw Railway Junction that was begun in 1919. Warszawa Zachodnia was opened in 1936 as the most westerly station on the Warsaw Cross-City Line. It was not until the 1970s that an underpass was built to connect the platforms and a station building was built on the northern side. In 1975, a platform for Warszawska Kolej Dojazdowa trains was added. In 1980, the south side of the station was developed, with a road underpass being built to connect Wola and Ochota and the long-distance bus station added. The Warszawa Wola railway station, built in the 1980s just away from Warszawa Zachodnia, on 20 May 2012 was joined to Warszawa Zachodnia station as Platform 8,for trains to Nasielsk, Ciechanów and Działdowo. In 2015 a new station building was opened at the southern side of the station along with several commercial office buildings, which among others host companies of the Polish State Railways, built along Warsaw's Jerozolimskie Avenue on grounds belonging to the station complex. ==References== Category:1936 establishments in Europe Category:1930s establishments in Poland Category:Railway stations in Poland Category:Buildings and structures in Warsaw",
 "title": "Warszawa Zachodnia station"
}