{
 "id": "108953",
 "text": "Ender's Game (1985) is one of the most famous books written by Orson Scott Card. It takes place in Earth's future where mankind has barely survived two attacks by the \"buggers\", a species of alien, and the International Fleet is getting ready for war. In order to find and train a leader for the next invasion, the world's smartest children, including Ender Wiggin, are taken into a place called Battle School at a very young age. The book takes place around the year 2135, and its sequels Speaker for the Dead, Xenocide, Children of the Mind, A War of Gifts, and Ender in Exile: Ganges follow Ender to different planets as he travels far into the future. The book was first a novelette that came out in the August 1977 issue of Analog Science Fiction and Fact.Short Stories by Orson Scott Card - Ender's Game. Hatrack.com. Card later made the novel longer and wrote sequels to create the Ender's Game series. A new version was released in 1991 to keep facts accurate (such as the end of the Soviet Union). ==Awards== Ender's Game won the Hugo Award for best novel in 1986 and the Nebula Award for best novel in 1985. The next year, the sequel Speaker for the Dead also won both awards; Card is the only writer to have won both awards two years in a row. In 2008, it got the Margaret Edwards award for its long term effect on science fiction. ==Translations== * (\"Ender's Game\"), 2003. * (\"Ender's Game\"), 2007. * (\"Ender's Game\"). * (\"Ender's Strategy\"), 1990. * (\"Ender's Tactic\"). * (\"Ender's Game\"), 2000. * (\"Ender\"), 1990. * (\"The Ender Strategy\"), 1996, 1999, 2000, 2001. * (\"The Big Game\"), 1986, 2005. * (\"Ender's Game\"). * (\"Endgame\"), 1991. * (\"Ender's Game\"). * (\"Ender's Game\"), 1992, 2000 (two editions). * (\"Ender's Game\"), 1987. * (\"Ender's Game\"), 1999. * (\"Ender's Game\"), 1994. * (\"The exterminator's game\") (Brasil). * (\"The final game\") (Portugal). * (\"Ender's Game\"). * (\"Ender's Game\"), 1995, 1996, 2002, 2003 (two editions). * (\"Ender's Game\"). * (\"Ender's Game\"), 1991, 1998. * (\"Ender's Game\"), 1988. * (\"The game that change the world\"), 2007. * (\"Ender's Game\"). ==References== ==Other websites== * About the novel Ender's Game from Card's website * The original short story from Card's website * Intergalactic Medicine Show: Online science fiction magazine published by Orson Scott Card. Features a new Ender's world story in every issue. * Marvel Entertainment's press release regarding the Ender's Game Comic Book Series Category:1985 books Category:Ender's Game (novel series) Category:Hugo Award winning books Category:Nebula Awards",
 "title": "Ender's Game"
}