{
 "id": "1089922",
 "text": "The railway from Paris to Marseille is an 862-kilometre long railway line, that connects Paris to the southern port city of Marseille, France, via Dijon and Lyon. The railway was opened in several stages between 1847 and 1856, when the final section through Lyon was opened. The opening of the LGV Sud-Est high speed line from Paris to Lyon in 1981, the LGV Rhône-Alpes in 1992 and the LGV Méditerranée in 2001 has reduced its importance for passenger traffic. ==Route== The Paris–Marseille railway leaves the Gare de Lyon in Paris in southeastern direction. It crosses the river Marne at Charenton-le-Pont, and follows the right Seine bank upstream until Crosne, where it follows a course east of the Forest of Sénart. It crosses the Seine near Melun and follows the left Seine bank upstream, along the Forest of Fontainebleau. Beyond Montereau- Fault-Yonne, the railway follows the left Yonne bank upstream. At Migennes the Yonne is crossed, and the small rivers Armançon, Brenne and Oze are followed upstream. Beyond Blaisy-Bas the railway enters the watershed of the Mediterranean Sea, descending the Ouche river valley to central Dijon. At Dijon the railway turns south, running along the east side of the Côte d'Or escarpment with its famous vineyards. At Chalon-sur-Saône the railway reaches the river Saône, and follows its right bank downstream until the city centre of Lyon. Before and after the Lyon-Perrache station it crosses the Saône and the Rhône respectively, and continues downstream along the left Rhône bank. Between Collonges-au-Mont-d'Or (north of Lyon) and La Guillotière (a southern quarter of Lyon) there is a parallel line to its east, on which the other main station of Lyon, Part-Dieu, is situated. There is also a long parallel line on the right bank of the Rhône between Lyon and Nîmes, which is mainly used for freight transport. The railway passes through Valence, Avignon and Arles, where it leaves the Rhône and turns east. It passes along the northern shore of the Étang de Berre. The terminus is Marseille-Saint-Charles station. ===Main stations=== The main stations on the Paris–Marseille railway are: * Gare de Lyon (Paris) * Dijon-Ville station * Lyon-Perrache station * Avignon- Centre station * Marseille-Saint-Charles station ==References== Category:Rail transport in France",
 "title": "Paris–Marseille railway"
}