{
 "id": "1089750",
 "text": "In general, the term nude refers to people who are not wearing clothing, or who are wearing less clothing than other people would expect. When talking about nude in the context of art, the idea is to show the unclothed human figure. This is known as the nude. In the visual arts, this can be a statue, such as the famous statue by Michelangelo shown. It can also be a painting. Nudity in painting is common. Often, painters made paintings that showed a scene of figures of mythology. The figures shown would often be nude, or wear very little clothing. The Ancient Greek were fascinated by people doing sports naked. In the Middle Ages, there was less activity, but afterwards, in the Renaissance it was more common again. History painting is about showing scenes of history, or of mythology. Very often, the figures shown are naked. Unclothed figures often also play a part in other types of art, such as history painting, including allegorical and religious art, portraiture, or the decorative arts. From prehistory to the earliest civilizations, nude female figures were generally understood to be symbols of fertility or well-being. The Khajuraho Group of Monuments were built between 950 and 1050 CE. They are known for their nude sculptures, which comprise about 10% of the temple decorations. Only very few of them are erotic. Japanese prints are one of the few non-western traditions that can be called nudes. There, the activity of communal bathing in Japan is portrayed as just another social activity, without the significance placed upon the lack of clothing that exists in the West. Through each era, the nude has reflected changes in cultural attitudes regarding sexuality, gender roles, and social structure. A book on the nude in art history is The Nude: a Study in Ideal Form by Lord Kenneth Clark, first published in 1956. The introductory chapter makes the often-quoted distinction between the naked body and the nude. Clark states that to be naked is to be deprived of clothes, and implies embarrassment and shame, while a nude, as a work of art, has no such connotations. In modern times there was a change. This change was that the line between nude, and naked became less clear. One of the first artists to show this was likely Francisco de Goya. Between 1795 and 1800 he made two paintings, which are known as the Clothed Maja and the Nude Maja today. The paintings show the same model, in the same pose. In one paiting the model is wearing clothes, in the other, she is naked. In 1815, this painting drew the attention of the Spanish Inquisition. The shocking elements were that it showed a particular model in a contemporary setting, with pubic hair rather than the smooth perfection of goddesses and nymphs, who returned the gaze of the viewer rather than looking away. The painting is famous for the straightforward and unashamed gaze of the model towards the viewer. It has also been one of he earliest Western works of art to show a nude woman's pubic hair without obvious negative connotations (such as in images of prostitutes). Some of the same characteristics were shocking almost 70 years later when Manet exhibited his Olympia, not because of religious issues, but because of its modernity. Rather than being a timeless Odalisque that could be safely viewed with detachment, Manet's image was assumed to be of a prostitute of that time, perhaps referencing the male viewers' own sexual practices. == Types of depiction == The meaning of any image of the unclothed human body changes with the context it is put in. What may be alright in one setting may not be in another. In Western culture, the contexts generally recognized are art, pornography, and information. Viewers easily identify some images as belonging to one category, while other images are ambiguous. The 21st century may have created a fourth category, the commodified nude, which intentionally uses ambiguity to attract attention for commercial purposes. When it comes to making a difference between art and pornography, Kenneth Clark noted that sexuality was part of the attraction to the nude as a subject of art, stating \"no nude, however abstract, should fail to arouse in the spectator some vestige of erotic feeling, even though it be only the faintest shadow—and if it does not do so it is bad art and false morals\". According to Clark, the explicit temple sculptures of tenth-century India \"are great works of art because their eroticism is part of their whole philosophy\". Great art can contain significant sexual content without being obscene. In the United States nudity in art has sometimes been a controversial subject when public funding and display in certain places brings the work to the attention of the general public. Puritan history continues to impact the selection of artwork shown in museums and galleries. At the same time that any nude may be suspect in the view of many patrons and the public, art critics may reject work that is not cutting edge. Relatively tame nudes tend to be shown in museums, while works with shock value are shown in commercial galleries. The art world has devalued simple beauty and pleasure, although these values are present in art from the past and in some contemporary works. When school groups visit museums, there are inevitable questions that teachers or tour leaders must be prepared to answer. The basic advice is to give matter-of-fact answers emphasizing the differences between art and other images, the universality of the human body, and the values and emotions expressed in the works. Art historian and author Frances Borzello writes that contemporary artists are no longer interested in the ideals and traditions of the past, but confront the viewer with all the sexuality, discomfort and anxiety that the unclothed body may express, perhaps eliminating the distinction between the naked and the nude. Performance art takes the final step by presenting actual naked bodies as a work of art. == History == The nude dates to the beginning of art with the female figures called Venus figurines from the Late Stone Age. In early historical times similar images represented fertility deities. When surveying the literature on the nude in art, there are differences between defining nakedness as the complete absence of clothing versus other states of undress. In early Christian art, particularly in references to images of Jesus, partial dress (a loincloth) was described as nakedness. == References == === Books === * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ===Journals=== * * * * * * * * * === News === * * * * * * * * === Web === * * * * * * * * * * * * * * Category:Art",
 "title": "Nude (art)"
}