{
 "id": "108966",
 "text": "Orson Scott Card (born August 24, 1951) is a popular American writer, critic, political writer, and speaker. He is best known for his science fiction books. Both his novel Ender's Game and its sequel, Speaker for the Dead, won the Hugo Award and the Nebula Award. That makes Card the only writer (as of 2007) to win both of science fiction's top prizes two years in a row. Card is an English professor at Southern Virginia University. He has written two books on creative writing. Card teaches other people about writing. He is also a judge in the Writers of the Future competition. His great-great-grandfather is Brigham Young, who was a leader for The Church of Jesus Christ of Latter-day Saints, and Card is also a member of it. Card still writes many fiction works. He has also produced writing about church, politics, and society in his columns and books. ==Early Life== Card is the son of Willard Richards Card and Peggy Jane (maiden name Park). He is the third of six children. Song-writer Arlen Card is his younger brother. Card was born in Richland, Washington. He grew up in Santa Clara, California, Mesa, Arizona, and Orem, Utah. He went on a mission for the Church of Jesus Christ of Latter Day Saints in Brazil. Card graduated from Brigham Young University (BYU) and the University of Utah. He also spent a year in a Ph.D program at the University of Notre Dame. For part of the 1970s Card worked as an associate editor of the Ensign, which is an official magazine of the LDS Church.Ensign reference to Card as Associate Editor Card lives in Greensboro, North Carolina. Greensboro has greatly affected Ender's Game and many of his other works. ==Fiction== Card started his writing career as a poet. He studied with Clinton F. Larson at Brigham Young University, in Utah. Card studied about the theater and started turning books into plays and then started writing his own full-length plays. Many of his plays were produced by theater directors at BYU. He also started writing fiction. The fiction stories that he wrote in college later became The Worthing Saga. At BYU, Card started a theater company, which produced plays at \"the Castle,\" an outdoor stage in Provo. His company's plays were the first plays ever produced at the Castle. Card also got a part-time job as a proofreader at BYU Press. Later, he got a full-time job copy editing. In 1976, Card got a full-time job as an assistant editor at the Ensign, a church magazine. He moved to Salt Lake City. There, Card published his first piece of fiction, a short story called \"Gert Fram.\" It was printed in the July 1977 fine arts magazine under the pen name Byron Walley. ===Science fiction=== Card wrote a short story called \"Ender's Game\" while he worked at the BYU Press. He sent it to several publications. The story is about a school in which boys can fight in space. He later turned the short story into a novel, also called Ender's Game. Both Ender's Game and the second book in the same series, Speaker for the Dead, were given the Hugo Award and the Nebula Award. That made Card the only author () to win both of science fiction's top awards two years in a row. The series also includes the books Xenocide, Children of the Mind, Ender's Shadow, Shadow of the Hegemon, Shadow Puppets, \"First Meetings in the Enderverse\", Shadow of the Giant, Shadows in Flight, A War of Gifts, and Ender in Exile. Ender in Exile takes place in between Ender's Game and Speaker for the Dead. Card has said he plans to write a book, Shadows Alive, to link the Shadow series and the Speaker series together. He has also written three books that take place before Ender's Game: Earth Unaware, Earth Afire, and Earth Awakens. The trilogy tells the history of the character Mazer Rackham and other things. In 2013 the novel Ender's Game was made into a movie. Asa Butterfield played the character Ender ,and Gavin Hood directed the movie. Some of Card's other science fiction books include The Tales of Alvin Maker, Pastwatch: The Redemption of Christopher Columbus, The Homecoming Saga, and Hidden Empire. ===Other genres=== Card has branched out into other areas of fiction with books such as Lost Boys, Treasure Box and Enchantment. He wrote a novel about the James Cameron film The Abyss and the comic book Ultimate Iron Man for a Marvel Universe series. In the early 1990s, Card wrote the narration in three video games: Loom, The Secret of Monkey Island, and The Dig. In 1983, Card published the novel Saints. It is a fiction book about one of Card’s ancestors, who joined the LDS Church in its early days. Card writes about his ancestor's life until Utah became a state. In 2000, Card published the first book in The Women of Genesis series. The books tell the story of the women in the Bible. They are 'Sarah (2000), Rebekah (2002), and Rachel and Leah (2004). In 2005, Card started a magazine, Orson Scott Card's InterGalactic Medicine Show. He edited the first two issues, but he was too busy to keep up with it. Edmund R. Schubert was one of Card's former students. Schubert took over the magazine and became the editor in 2006. Card also wrote the dialog and the screenplay for the Xbox video game Advent Rising'’.Card's comments on working on Advent Rising from his official website In 2008, Card's short book Hamlet's Father was published in The Ghost Quartet collection (Tor Books). It is a retelling of Shakespeare's Hamlet. ==Awards== * 1978; John W. Campbell Award for Best New Writer; from the World Science Fiction Convention * 1981; Songmaster; Hamilton-Brackett Memorial Award 81 * 1984; Saints; named Book of the Year by Association for Mormon Letters * 1985; Ender's Game; Nebula Award 85, Hugo Award 86, Hamilton-Brackett Award 86, SF Chronicle Readers Poll Award 86 * 1987; Speaker for the Dead; Nebula Award 86, Hugo Award 87, Locus Award 87, SF Chronicle Readers Poll Award 87 * 1987; \"Eye for Eye\"; Hugo award 88; \"Japanese Hugo\" 89 * 1987; \"Hatrack River\"; Nebula finalist 86, Hugo finalist 87, World Fantasy Award winner 87 * 1988; Seventh Son, Hugo finalist 88, World Fantasy finalist 88, Mythopoeic Society Award 88, Locus Award (best fantasy novel) 88 * 1989; Hugo & Nebula Finalist; Red Prophet * 1991; Hugo Award; How to Write Science Fiction and Fantasy (Writer's Digest Books, 90) * 1995; Locus Award for Best Fantasy Novel; for Alvin Journeyman * 2008; YALSA Margaret A. Edwards Award for Lifetime Contribution to Young Adult Literature; for Ender's Game and Ender's Shadow ==References== Category:1951 births Category:Living people Category:Nebula Award winning writers Category:Hugo Award winning writers Category:People from Mesa, Arizona Category:Writers from Arizona Category:Writers from Washington (state) Category:Writers from North Carolina",
 "title": "Orson Scott Card"
}