{
 "id": "1089732",
 "text": "Walker Scobell is an American actor best known for his work in film and television. Born on January 5, 2009,Civita, Alicia (January 3, 2024). \"Celebrity Birthdays: Maluma, Myke Towers, Ana Bárbara, Nodal, Ice Spice and More Famous People Born on January\". Latin Times. Retrieved January 5, 2024.DeFrancesco, Dan. \"LinkedIn becoming an unexpected dating site shows social media's shifting landscape\". Business Insider. Retrieved January 5, 2024. in Virginia Beach, Virginia, he has quickly risen to prominence with his remarkable talent and versatile performances. Walker is known mainly for his role in the show: Percy Jackson and the Olympians, where he played the main role of Percy Jackson. == Early life and schooling == Walker Scobell was raised in Austin, Texas, where he discovered his passion for acting at a young age. He began his journey by participating in local theater productions and school plays, showcasing his natural aptitude for performing arts. His dedication and talent soon caught the attention of industry professionals, leading him to pursue a career in acting. == Career == Scobell made his professional acting debut with a notable role in the 2020 film \"The War with Grandpa,\" starring alongside veteran actors such as Robert De Niro and Uma Thurman. In the film, he portrayed the character of Steve Decker, the grandson of De Niro's character, whose mischievous antics spark a hilarious intergenerational rivalry. Following his breakout performance in \"The War with Grandpa,\" Scobell continued to garner attention for his acting prowess. He landed roles in various television series and films, showcasing his versatility as an actor. His notable television credits include appearances in popular shows such as \"Young Sheldon\" and \"Walker.\" In 2022, Scobell gained widespread recognition for his starring role in the highly anticipated film \"Secret Headquarters.\" Directed by Henry Joost and Ariel Schulman, the film follows a young boy who discovers a secret headquarters filled with futuristic gadgets and embarks on a thrilling adventure. Scobell played the lead role of Jake, captivating audiences with his charm and charisma. Aside from his acting career, Scobell is also passionate about philanthropy and using his platform for good causes. He has been involved in various charitable initiatives, supporting organizations dedicated to causes such as children's education and environmental conservation. == Personal life == Despite his rising fame, Walker Scobell maintains a relatively low-profile personal life. He values his privacy and prefers to keep details about his personal affairs out of the public eye, focusing instead on his career and charitable endeavors. == Awards == Throughout his career, Walker Scobell has received praise for his exceptional talent and performances. While he has yet to receive major industry awards, he has been nominated for several accolades and is widely regarded as one of the most promising young talents in Hollywood. Year Award Category Work Result 2022 MTV Movie & TV Awards Best Team The Adam Project == Appearances== === Movies === Year Title Role Notes 2022 The Adam Project Adam Reed (young) Secret Headquarters Charlie Kincaid Blood Knot In production === TV shows === Year Title Role Notes 2023–present Percy Jackson and the Olympians Percy Jackson Main role ==Notes== == References == ==Other websites== * Category:2009 births Category:Living people Category:Actors from Texas",
 "title": "Walker Scobell"
}