{
 "id": "1089415",
 "text": "American modern architecture was a movement or style that occurred in the United States approximately between the 1890s and the 1980s. == Terminology == === Disambiguation and diversity of terms === The term refers to the buildings and architects of modernism or modern architecture in English, which had nothing to do with the meaning of the term (linked to Art Nouveau) in the Iberian Peninsula, before the World War II, what is called in English modernisme. In some romance languages, such as Brazilian Portuguese, the term modernismo or arquitetura moderna is similar to its meaning in English. The modern movement or international style does not have a homogeneous name in all countries and languages. In many, the term \"International Style\" is used. A synonymous term is “Modern Movement”, from the book Pioneers of Modern Movement from William Morris to Walter Gropius (1936), by Nikolaus Pevsner. === Origin === The word \"modernism\" comes from a book by Hitchcock and Johnson. They were the first to group and define the style of \"modernism\" globally, focusing on its design aspects. The International Style's main ideas are part of the larger modern movement. == Features and steps == Modern architecture uses new building technologies like glass, steel and reinforced concrete. It believes that a building's shape should be based on its purpose (functionalism), prefers simplicity, and often avoids decoration and ornament (minimalism). === First decades (1890–1914). Wright's example === File:William_H._Winslow_House_Front_Facade.jpg|link=Ficheiro:William_H._Winslow_House_Front_Facade.jpg|alt=William H. Winslow House, de Frank Lloyd Wright, River Forest, Illinois (1893–94)| William H. Winslow House, by Frank Lloyd Wright, River Forest, Illinois (1893–94) File:Oak_park_house2.jpg|link=Ficheiro:Oak_park_house2.jpg|alt=The Arthur Heurtley House en Oak Park, Illinois (1902)|The Arthur Heurtley Housein Oak Park, Illinois (1902) File:LarkinAdministrationBuilding1906.jpg|link=Ficheiro:LarkinAdministrationBuilding1906.jpg|alt=Larkin Administration Building por Frank Lloyd Wright, Buffalo, Nova York (1904–1906)| Frank Lloyd Wright's Larkin Administration Building, Buffalo, New York (1904–1906) File:Unity_Temple_- _Oak_Park_IL_9_(3224132995).jpg|link=Ficheiro:Unity_Temple_- _Oak_Park_IL_9_(3224132995).jpg|alt=Interior do Unity Temple de Wright, Oak Park, Illinois (1905–1908)|Interior of Wright's Temple of Unity, Oak Park, Illinois (1905–1908) File:Frederick_C._Robie_House.JPG|link=Ficheiro:Frederick_C._Robie_House.JPG|alt=The Robie House de Wright, Chicago (1909)| Wright's Robie House,Chicago (1909) Frank Lloyd Wright was a unique and independent US architect who did not follow any specific architectural group. He learned from Louis Sullivan in Chicago, who developed early skyscrapers and believed in designing buildings based on their purpose. Wright broke traditional design rules, creating famous Prairie Houses with simple, earthy designs and horizontal lines, reflecting the vast American prairie. His buildings, like the Larkin Building and Unity Temple, were innovative and did not mimic past styles. === First skyscrapers === In the late 1800s, the US saw its first skyscrapers, built due to limited land and new technology like steel frames and safer elevators. The Home Insurance Building in Chicago, completed in 1883, was the world's first and briefly tallest skyscraper. Early skyscrapers mixed modern structures with traditional decorations. The Woolworth Building, finished in 1912, was notable for its modern design and neo-Gothic exterior. Architecture at this time was eclectic, often not reflecting the new technologies available. === 1920 to 1940 === ==== Wright, Schlinder and Neutra ==== File:Fallingwater_- _DSC05643.JPG|link=Ficheiro:Fallingwater_-_DSC05643.JPG|alt=Fallingwater por Frank Lloyd Wright (1928–34)| Cascade House by Frank Lloyd Wright (1928–34) File:Lovell_Beach_House_02.jpg|link=Ficheiro:Lovell_Beach_House_02.jpg|alt=Lovell Beach House en Newport Beach por Rudolph Schindler (1926)| Lovell's Beach House in Newport Beach by Rudolph Schindler (1926) File:Lovell_House_2.jpg|link=Ficheiro:Lovell_House_2.jpg|alt=Lovell Health House en Los Feliz, Os Ánxeles, California, por Richard Neutra (1927–29)| Lovell Nursing Homein Los Feliz, Los Angeles, California, by Neutra (1927–29) In the 1920s and 1930s, Wright created an architectural style, separate from any movement. He experimented with houses inspired by Mayan civilization and modular homes. Wright called his design \"Usonian,\" aiming for an ideal, organic community. The Great Depression impacted his work, limiting him to few projects like Fallingwater, blending architecture with nature. Meanwhile, architects like Rudolph Schindler and Richard Neutra brought modernist designs to America, contributing significant works like the Lovell Beach House and Kaufmann Desert House. Ho, Vivien (21 October 2020) Marabilla arquitectónica modernista feita famosa por Slim Aarons á venda por 25 millóns de dólares. Retrieved 23 October 2020 In the 1930s, fleeing the Nazis after the closure of the Bauhaus, architects and artists such as Mies van der Rohe, Moholy-Nagy, and others went to US, founded the New Bauhaus in Chicago and taught at several university centers, such as Black Mountain College. === From the post- war period in the 1940s to the 1980s === The International Style started in Europe with the Bauhaus in the late 1920s. By 1932, it was officially recognized and named by Philip Johnson and Henry-Russell Hitchcock. Originally, it aimed to combine craftsmanship and architecture, but later focused more on using materials like glass and concrete, leading to the construction of many skyscrapers. ==== Walter Gropius, Marcel Breuer, Mies van der Rohe ==== File:Story_Hall,_Harvard_University,_Cambridge_MA.jpg|link=Ficheiro:Story_Hall,_Harvard_University,_Cambridge_MA.jpg|alt=Story Hall da Escola de Dereito de Harvard por Walter Gropius| Story Hall at Harvard Law School, by Walter Gropius File:Back_4_Stillman_House_2013-09-14_19-12.jpg|link=Ficheiro:Back_4_Stillman_House_2013-09-14_19-12.jpg|alt=The Stillman House Litchfield, Connecticut, por Marcel Breuer (1950) O mural da piscina é de Alexander Calder| The Stillman House Litchfield, Connecticut, by Marcel Breuer(1950) The pool mural is by Alexandre Calder File:Walter_Gropius_photo_MetLife_Building_fassade_New_York_USA_2005-10-03.jpg|link=Ficheiro:Walter_Gropius_photo_MetLife_Building_fassade_New_York_USA_2005-10-03.jpg|alt=The PanAm building (agora MetLife Building) en Nova York, por Walter Gropius (1958–63)| The PanAm (now MetLife) building in New York by Gropius (1958–63) Walter Gropius founded the Bauhaus and later moved to the US, influencing architecture at Harvard with Marcel Breuer. Their work and teaching, especially with students like I.M. Pei and Philip Johnson, shaped modern architecture. Gropius's notable projects include the Harvard Graduate School of Design and the Pan American Airways headquarters. Mies van der Rohe, another key figure, advanced modern architecture in Chicago, creating iconic buildings like the Farnsworth House and the Seagram Building. As director of the school of architecture at what is now the Illinois Institute of Technology influenced architects like Philip Johnson and Eero Saarinen. ==== Richard Neutra and Charles and Ray Eames ==== Richard Neutra and Eames couple were key in bringing the new architectural style to US homes. The Eames House, their most famous work, showcases Japanese influences with its simple, natural materials and steel structure. Neutra's work in Los Angeles emphasized the transition between indoors and outdoors through glass walls. His Constance Perkins House used affordable materials and was designed with the owner's stature in mind, featuring a unique reflecting pool. ==== Skidmore, Owings and Merrill and Wallace K. Harrison ==== Many of the notable modern buildings of the post-war years were produced by two mega-architectural agencies. The company Skidmore, Owings & Merrill was founded in Chicago in 1936 by Louis Skidmore and Nathaniel Owings, and joined in 1939 by engineer John Merrill, soon becoming SOM. His first major project was the Oak Ridge National Laboratory in Oak Ridge, Tennessee, the gigantic government facility that produced plutonium for the first nuclear weapons. The company's later buildings include Yale University 's Beinecke Library (1963), the Willis Tower, formerly the Sears Tower in Chicago (1973), and One World Trade Center in New York (2013), which replaced the building destroyed in September 11, 2001. Wallace Harrison played an important role in the history of modern New York architecture; he helped design Rockefeller Center, the premier Art Deco architectural project of the 1930s. He was supervising architect of the 1939-40 New York World's Fair and, with his partner Max Abramowitz, was the builder of the UN headquarters; Harrison led a committee of international architects, which included Oscar Niemeyer and Le Corbusier. File:Eames_House0.jpg|link=Ficheiro:Eames_House0.jpg|alt=Eames House de Charles e Ray Eames, Pacific Palisades, Os Ánxeles (1949)| Eames House by Charles and Ray Eames, Pacific Palisades, Los Angeles (1949) File:NeutraOfficeBldg.1.jpg|link=Ficheiro:NeutraOfficeBldg.1.jpg|alt=Neutra Office Building de Richard Neutra nos Ánxeles (1950)| Neutral Office Building by Neutra in Los Angeles (1950) File:Constance_Perkins_House.jpg|link=Ficheiro:Constance_Perkins_House.jpg|alt=A Constance Perkins House de Richard Neutra, California (1962)| Richard Neutra's Constance Perkins House, California (1962) File:Manhattan_House_65_jeh.JPG|link=Ficheiro:Manhattan_House_65_jeh.JPG|alt=Manhattan House de Skidmore, Owings & Merrill (1950–51)| Manhattan House bySkidmore, Owings & Merrill (1950–51) File:Manufacturers_Trust_Company_Building_510_Fifth_Avenue.jpg|link=Ficheiro:Manufacturers_Trust_Company_Building_510_Fifth_Avenue.jpg|alt=Manufacturers Trust Company Building, de Skidmore, Owings & Merrill, Nova York (1954)| Manufacturers Trust Company Building, by S, O & M York (1954) File:Yale- beinecke-library.jpg|link=Ficheiro:Yale-beinecke-library.jpg|alt=Biblioteca Beinecke na Universidade de Yale por Skidmore, Owings & Merrill (1963)| The Beinecke Library at Yale University by SOM. (1963) File:United_Nations_Headquarters.JPG|link=Ficheiro:United_Nations_Headquarters.JPG|alt=Sede das Nacións Unidas en Nova York, de Wallace Harrison con Oscar Niemeyer e Le Corbusier (1952)| United Nations Headquartersin New York, by Wallace Harrison with Oscar Niemeyer and SOM (1952) File:CFiorentini007.jpg|link=Ficheiro:CFiorentini007.jpg|alt=A Metropolitan Opera House no Lincoln Center na cidade de Nova York por Wallace Harrison (1966)|The Metropolitan Opera House atThe Lincoln Center in New York City by Wallace Harrison (1966) ==== Wright's last works ==== Wright was 80 in 1947; he was present at the beginnings of modern American architecture and influenced it, but never aligning with any movement. His notable last work includes the Florida Southern College campus, completed between 1941 and 1943, featuring nine buildings known as \"The Child of the Sun.\" Wright aimed for the campus to symbolize growth and harmony with nature. File:Lakeland_FSC_Pfeiffer_Chapel01.jpg|link=Ficheiro:Lakeland_FSC_Pfeiffer_Chapel01.jpg|alt=The Pfeiffer Chapel no Florida Southern College, Frank Lloyd Wright (1941–1958)| The Pfeiffer Chapel at Florida Southern College, Frank Lloyd Wright (1941–1958) File:Building, globe, and grounds of the S.C. Johnson and son headquarters building, designed by Frank Lloyd Wright, Racine, Wisconsin LCCN2011634906.jpg|link=Ficheiro:Building, globe, and grounds of the S.C. Johnson and son headquarters building, designed by Frank Lloyd Wright, Racine, Wisconsin LCCN2011634906.jpg|alt=Torre da sede de Johnson Wax (1944–50)| Johnson Wax headquarters tower (1944–50) File:Price_Tower_- _Bartlesville.jpg|link=Ficheiro:Price_Tower_-_Bartlesville.jpg|alt=Price Tower en Bartlesville, Oklahoma (1956)| Price Tower in Bartlesville, Oklahoma (1956) File:NYC_-_Guggenheim_Museum.jpg|link=Ficheiro:NYC_- _Guggenheim_Museum.jpg|alt=Solomon Guggenheim Museum, de Wright (1946–1959)| Solomon Guggenheim Museum, by Wright (1946–1959) Frank Lloyd Wright designed other notable projects in the 1940s, including the Johnson Wax headquarters and Bartlesville Tower, featuring a unique structure with a central core. He adapted a New York City apartment building design for Oklahoma, emphasizing its stand-alone feature in a less crowded setting. Wright's innovative approach also led to the design of the Guggenheim Museum, a revolutionary spiral ramp museum, started in 1946 and completed in 1959, the year he passed away.See also the article Guggenheim Museum in New York. His work influenced architecture locally and internationally, with others (like Fred Bassetti) following the international style. ==== Other prominent architects ==== * Philip Johnson * Eero Saarinen (Finnish with much of his work developed in the United States) * Louis Khan == References == == See too == === Other articles === * International Style * Bauhaus Category:Pages with unreviewed translations Category:Architecture Category:Modernism",
 "title": "American modern architecture"
}