{
 "id": "1089840",
 "text": "Antwerpen-Centraal railway station (, ) is the main railway station in Antwerp, Belgium. It is one of the most important hubs in the country and is one of the four Belgian stations on the high-speed rail network. From 1873 to early 2007, it was a terminal station. The current building, designed by the architect Louis Delacenserie, was built between 1895 and 1905. On 23 March 2007, a tunnel with two continuous tracks was opened under part of the city and under the station. The train services are operated by the National Railway Company of Belgium. ==Architecture== The station is widely regarded as the finest example of railway architecture in Belgium, although it is not a particular architectural style. The vast dome above the waiting room hall made it be known as the spoorwegkathedraal (\"railroad cathedral\"). The originally iron and glass train hall (185 metres long and 44 metres or 43 metres high) was designed by Clément Van Bogaert, an engineer. It covers an area of 12,000 square metres. The height of the station was because of the smoke of steam locomotives. The roof of the train hall was originally made of steel. In 2009, the American magazine Newsweek judged Antwerpen-Centraal the world's fourth greatest train station.Stations: A Destination That Matches the Journey Newsweek New York 10 January 2009 In 2014, the British-American magazine Mashable awarded Antwerpen-Centraal the first place for the most beautiful railway station in the world.All Aboard! 12 Beautiful Railway Stations From Around the World Mashable New York 25 August 2014 File:Antwerpen-Centraal aerial 4.jpg|Frontal view File:Central Hall of Antwerp Central Station, Belgium, July 2022.jpg|Entrance hall File:Belgien 7525.jpg|Ceiling File:Antwerp July 2015-2.jpg|The clock at the upper level ==References== Category:1905 establishments in Europe Category:20th-century establishments in Belgium Category:Railway stations in Belgium Category:Antwerp",
 "title": "Antwerpen-Centraal railway station"
}