{
 "id": "1089646",
 "text": "Transport in Poland involves air, water, road and rail transportation. The country has a large network of public transport, such as buses, trams and the metro. == Water == The country's most important waterway is the Vistula river. The largest seaports are Gdańsk, Gdynia and Szczecin. There are 3,997 km (2,480 mi) of navigable rivers and canals (as of 2009). == Air transport == The most important airport in Poland is Warsaw 'Frederic Chopin' International Airport. Warsaw's airport is the main international hub for LOT Polish Airlines. In addition to Warsaw Chopin, Wrocław, Gdańsk, Katowice, Kraków and Poznań all have international airports. == Rail transport == Poland has a network of railways.. It is run by Polish State Railways. The rail network is very dense in western and northern Poland. The eastern part of the country has fewer railways. The capital city, Warsaw, has the country's only rapid transit system: the Warsaw Metro. The only high-speed rail line in central-eastern Europe is the Central Rail Line,. It is long, and was built in 1971–1977. It links Warsaw with Kraków and Katowice. Other high-speed lines: *The Warsaw- Gdańsk-Gdynia railway route is undergoing a major upgrading costing $3 billion, partly funded by the European Investment Bank, including track replacement, realignment of curves and relocation of sections of track to allow speeds up to , modernization of stations, and installation of the most modern ETCS signalling system, which is to be completed in June 2015. * Warsaw–Kutno–Poznań–(Berlin) (160 km/h) * Warsaw–Siedlce–Terespol–(Minsk) (160, 120 km/h) – being upgraded to 160 km/h * Warsaw–Puławy–Lublin (120, 140 km/h) * Opole–Wrocław (160 km/h) and further upgraded via Legnica to Berlin and Hamburg == Road transport == Poland has of public roads, of which are unsurfaced (2021): * National roads (Technical classes A, S, GP and exceptionally G): , unsurfaced * Voivodeship roads (Classes G, Z and exceptionally GP): , unsurfaced * Powiat roads (Classes G, Z and exceptionally L): , unsurfaced * Gmina roads (Classes L, D and exceptionally Z): , unsurfaced In recent years, the network has been improving and government spending on road construction recently saw a huge increase, due to rapid development of the country and the inflow of European Union funds for infrastructure projects. === Motorways and expressways === Polish motorways and expressways are part of the national roads network. As of December 2021, there are of motorways and of expressways . ==References==",
 "title": "Transport in Poland"
}