{
 "id": "1090026",
 "text": "Abdulrab Rasul Sayyaf ( ; ; born 1946) is an Afghan politician in exile and former Mujahideen fighter. He became known during the Soviet–Afghan War as a commander with international Jihad ties to the Arab world. After the fall of Kabul in 1992, he was with the transitional government of Burhanuddin Rabbani and then the Northern Alliance against the Taliban. ==Biography== Sayyaf was born in 1946 in Paghman, Kabul Province. He was born to a Ghilzai Pashtun family. He holds a degree in religion from Kabul University and a masters from Al-Azhar University in Cairo. Sayyaf was a member of the Afghan-based Ikhwan al-Muslimin, founded in 1969 by Gulbuddin Hekmatyar and Dr. Burhanuddin Rabbani and having strong links to the original and much larger Muslim Brotherhood in Egypt. ==Soviet War and Bin Laden== After the April Revolution of '78 he was imprisoned by the new authority, he was freed in controversial circumstances by General Secretary Hafizullah Amin, who, coincidentally, was Sayyaf's distant relative. He became leader of the Islamic Union for the Liberation of Afghanistan (Ittihad-i-Islami Baraye Azadi Afghanistan), a coalition of several parties fighting the Soviet and Afghan government forces. The Islamic Union soon imploded, and Sayyaf retained the name as the title of his own organization. Sayyaf fought against government forces in the 1980s and primarily financed by Saudi Arabia. In 1985, he founded a university in an Afghan refugee camp near Peshawar called Dawa'a al-Jihad (Call of Jihad), which has been described the \"preeminent school for terrorism.\" Ramzi Ahmed Yousef, who masterminded the 1993 World Trade Center bombing, attended it. Despite his growing wealth, he continued to live a spartan life, avoiding modern conveniences like mattresses and air conditioning; although he enjoyed a nightly game of tennis. == References== Category:Al-Azhar University alumni Category:1946 births Category:Living people Category:Afghan politicians Category:People from Kabul Province Category:21st-century Afghan people Category:20th-century Afghan people",
 "title": "Abdul Rasul Sayyaf"
}