{
 "id": "1090110",
 "text": "Philip Eze, professionally known as Dj Phil, is a Nigerian disc jockey, music producer, and entrepreneur. He is the first official DJ in Nigeria to have a Dj mix project sit in the top 10 albums on Apple music’s chart. His Dj mix peaked at number 2 on the chart and he has since released various mixes with official support from Apple Music that have done immensely well. Dj Phil is popular in the ever buzzing nightlife industry in Lagos, having several residencies at nightclubs in Lagos and around Nigeria.. == Early Life == Born & raised in Lagos, Nigeria, Philip Eze “'DJ Phil” began his music career at a young age. Philip, like he is fondly called by family and close friends, is a prolific and super talented Disk jockey and entertainer. DJ Phil picked up an interest in the beautiful rhythms and melodies he was exposed to from his schooling at a young age. His big break came shortly after he zeroed in on his decision to pursue music professionally in 2016 supported by an emerging youth alternative culture that was gradually making its way from the obscure underground circles to the mainstream market. == Career == DJ Phil gained popularity by performing at various clubs and parties in the city. His breakthrough came in 2022 when he released a mixtape called Amapiano Essentials exclusively on Apple Music. It became a hit, reaching number 7 on the Apple Music Nigeria Top Albums chart and staying in the top 10 for weeks. This success followed his earlier mixtape release in 2016 called Strange Tales. In 2021 and 2022, there was a rise in the popularity of DJ mixes on Apple Music in Africa, and DJ Phil was among those who benefited from this trend. His mixtape, Amapiano Essentials, became one of the notable releases in the country, further boosting his career. == Works == * Amapiano Essentials (DJ Mix) * Party In The Jungle: DJ Phil, Jan 2023 (DJ Mix) * Amapiano Cruise (DJ Mix) * Summer 22 (DJ Mix) == References == Category:DJs Category:1998 births",
 "title": "DJ Phil"
}