{
 "id": "1090182",
 "text": "Rail Baltica is a rail infrastructure project that is intended to link the Baltic states to the European rail network. The plan is to improve rail connections between Central and Northern Europe southeast of the Baltic Sea. The plan is for a continuous rail link from Tallinn (Estonia) to Warsaw (Poland), going through Riga (Latvia), Kaunas, and Vilnius (Lithuania). Its total length in the Baltic States is , with in Estonia, in Latvia, and in Lithuania.Route alternative approved for the future construction of the Rail Baltica railway from Kaunas to the border with Poland, railbaltica.org, 12 May 2022. Rail Baltica is one of the priority projects of the European Union. Rail Baltica will be the first large-scale mainline standard gauge railway in the area. The rail networks in Finland, Estonia, Latvia and Lithuania are mainly in Russian gauge (1,520 mm). These countries' first railways were built in the second half of the 19th century while they were part of the Russian Empire. The benefits to Baltic society and business may be €16.2 billion, according to a study produced by Ernst & Young. At the end of April 2021, governments of Estonia and Finland promised to cooperate in the area of transport. == Overview == === Proposed environmental impact === Rail Baltica will be an electric railway, which will reduce carbon emissions. The railway has been planned to avoid Natura 2000 protected areas, and minimising impacts on other environmentally sensitive protected areas. Noise protection barriers will be installed. Special animal passages will be built through the embankment. === Stations === The railway project will enable transportation of freight through two or more methods of transportation. Rail Baltica includes plans for three multimodal freight terminals in Muuga Harbour (Estonia), Salaspils (Latvia), and Kaunas (Lithuania). There will be seven international passenger stations—in Tallinn, Pärnu, Riga, Riga Airport, Panevežys, Kaunas, and Vilnius. There could be regional stations and connections to airports and seaports. Riga Central Railway Hub will become the largest passenger terminal in the Baltics. The section from Helsinki to Tallinn will be operated by existing commercial ferries. In the future, a proposed Helsinki to Tallinn Tunnel could provide a rail link between the two cities. ==References== Category:Rail transport in Latvia Category:Rail transport in Lithuania Category:Rail transport in Poland Category:Rail transport in Estonia",
 "title": "Rail Baltica"
}