{
 "id": "109065",
 "text": "Theory of Colours (original German title, Zur Farbenlehre) is a book by Johann Wolfgang von Goethe published in 1810. It contains some of the earliest and most accurate descriptions of phenomena such as coloured shadows, refraction, and chromatic aberration. ==Overview== Its influence extends primarily to the art world, especially among the Pre-Raphaelites. Turner studied it comprehensively, and referred to it in the titles of several paintings. Wassily Kandinsky considered Goethe's theory \"one of the most important works\". ==Content== In his book, Goethe shows how colour is perceived in a variety of circumstances, and considers Isaac Newton's observations to be special cases. Goethe's concern was not so much with the measurement of colour phenomenon, but with how qualities of colour are perceived. Science has come to understand the distinction between the optical spectrum, as observed by Newton, and the phenomenon of human colour perception as presented by Goethe. ==Reception== Though Goethe's work was never well received by physicists, a number of philosophers and physicists have been known to have concerned themselves with it, including Arthur Schopenhauer, Kurt Gödel, Werner Heisenberg, Ludwig Wittgenstein, and Hermann von Helmholtz. Mitchell Feigenbaum even convinced himself that \"Goethe had been right about colour!\" == Goethe's theory == For Goethe, \"the highest is to understand that all fact is really theory. \"The blue of the sky reveals to us the basic law of color. Search nothing beyond the phenomena, they themselves are the theory.\"Quoted in translation in: :Goethe delivered in full measure what was promised by the title of his excellent work: Data for a Theory of Color. They are important, complete, and significant data, rich material for a future theory of color. He has not, however, undertaken to furnish the theory itself; hence, as he himself remarks and admits on page xxxix of the introduction, he has not furnished us with a real explanation of the essential nature of color, but really postulates it as a phenomenon, and merely tells us how it originates, not what it is. The physiological colors … he represents as a phenomenon, complete and existing by itself, without even attempting to show their relation to the physical colors, his principal theme. … it is really a systematic presentation of facts, but it stops short at this. (Schopenhauer, On Vision and Colors, Introduction) === Experiments with turbid media === Goethe's studies of colour began with subjective experiments which examined the effects of turbid media on the perception of light and dark. He observed that lights seen through a turbid medium would appear yellowish, and darkness seen through a turbid medium that had been lightened would appear blue. :\"The highest degree of light, such as that of the sun... is for the most part colourless. This light, however, seen through a medium but very slightly thickened, appears to us yellow. If the density of such a medium be increased, or if its volume become greater, we shall see the light gradually assume a yellow-red hue, which at last deepens to a ruby colour.\" (ToC, 150) :\"If on the other hand darkness is seen through a semi-transparent medium, which is itself illumined by a light striking on it, a blue colour appears: this becomes lighter and paler as the density of the medium is increased, but on the contrary appears darker and deeper the more transparent the medium becomes: in the least degree of dimness short of absolute transparence, always supposing a perfectly colourless medium, this deep blue approaches the most beautiful violet.\" (ToC, 151) Starting from these observations, he began numerous experiments, observing the effects of darkening and lightening on the perception of colour in many different circumstances. === Darkness and light === For Goethe, light is \"the simplest most undivided most homogenous being that we know. Confronting it is the darkness\" (Letter to Jacobi). Unlike his contemporaries, Goethe did not see darkness as an absence of light, but rather as polar to and interacting with light. Based on his experiments with turbid media, Goethe characterized colour as arising from the dynamic interplay of darkness and light. The editor of the Kurschner edition of Goethe's works gives the following analogy: :\"Modern natural science sees darkness as a complete nothingness. According to this view, the light which streams into a dark space has no resistance from the darkness to overcome. Goethe pictures to himself that light and darkness relate to each other like the north and south pole of a magnet. The darkness can weaken the light in its working power. Conversely, the light can limit the energy of the darkness. In both cases color arises. \" (Steiner, 1897 ) Goethe writes: :Yellow is a light which has been dampened by darkness; :Blue is a darkness weakened by the light. (Goethe, Theory of Colours ) === Boundary conditions === When viewed through a prism, the orientation of a light-dark boundary with respect to the prism is significant. With white above a dark boundary, we observe the light extending a blue-violet edge into the dark area; whereas dark above a light boundary results in a red-yellow edge extending into the light area. Goethe was intrigued by this difference. He felt that this arising of colour at light- dark boundaries was fundamental to the creation of the spectrum (which he considered to be a compound phenomenon). === Light and dark spectra === Since the colour phenomenon relies on the adjacency of light and dark, there are two ways to produce a spectrum: with a light beam in a dark room, and with a dark beam (i.e. a shadow) in a light room. Goethe recorded the sequence of colours projected at various distances from a prism for both cases (see Plate IV, Theory of Colours). In both cases, he found that the yellow and blue edges remain closest to the side which is light, and red and violet edges remain closest to the side which is dark. At a certain distance, these edges overlap. When these edges overlap in a light spectrum, green results; when they overlap in a dark spectrum, magenta results. With a light spectrum, coming out of the prism, one sees a shaft of light surrounded by dark. We find yellow-red colours along the top edge, and blue-violet colours along the bottom edge. The spectrum with green in the middle arises only where the blue-violet edges overlap the yellow-red edges. With a dark spectrum (i.e. a shadow surrounded by light), we find violet-blue along the top edge, and red-yellow along the bottom edge – where these edges overlap, we find magenta. == Newton and Goethe == Due to their different approaches to a common subject, many misunderstandings have arisen between Newton's mathematical understanding of optics, and Goethe's experiential approach.R. H. Stephenson, Goethe's Conception of Knowledge and Science (Edinburgh: Edinburgh University Press, 1995) Because Newton understands white light to be composed of individual colours, and Goethe sees colour arising from the interaction of light and dark, they come to different conclusions on the question: is the optical spectrum a primary or a compound phenomenon? For Newton, all the colours already exist in white light, and the prism merely fans them out according to their refrangability. Goethe sought to show that, as a turbid medium, the prism was an integral factor in the arising of colour. Whereas Newton narrowed the beam of light in order to isolate the phenomenon, Goethe observed that with a wider aperture, there was no spectrum. He saw only reddish-yellow edges and blue-cyan edges with white between them, and the spectrum arose only where these edges came close enough to overlap. For him, the spectrum could be explained by the simpler phenomena of colour arising from the interaction of light and dark edges. Goethe's reification of darkness has caused almost all of modern physics to reject Goethe's theory. Newton explains the appearance of white with colored edges by saying that due to the differing overall amount of refraction, the rays mix together to create a full white towards the centre, whereas the edges do not benefit from this full mixture and appear with greater red or blue components. === Table of differences === Qualities of Light Newton (1704) Goethe (1810) Homogeneity White light is composed of coloured elements (heterogeneous). Light is the simplest most undivided most homogenous thing (homogenous). Darkness Darkness is the absence of light. Darkness is polar to, and interacts with light. Spectrum Colours are fanned out of light according to their refrangibility (primary phenomenon). Coloured edges which arise at light-dark borders overlap to form a spectrum (compound phenomenon). Prism The prism is immaterial to the existence of colour. As a turbid medium, the prism plays a role in the arising of colour. Role of Refraction Light becomes decomposed through refraction, inflection, and reflection. Refraction, inflection, and reflection can exist without the appearance of colour. Analysis White light decomposes into seven pure colours. There are ony two pure colours – blue and yellow; the rest are degrees of these. Synthesis Just as white light can be decomposed, it can be put back together. Colours recombine to shades of grey. Particle or Wave? Particle Neither, since they are inferences and not observed with the senses. Colour Wheel Asymmetric, 7 colours Symmetric, 6 colours == Notes and references == Category:Color Category:Works of philosophy Category:1810s books Category:Science books Category:German literature",
 "title": "Theory of Colours"
}