{
 "id": "1090156",
 "text": "Rail transport in Russia is one of the biggest railway networks in the world. Russian railways are the third longest by length and third by volume of freight hauled, after the railways of the United States and China. In overall density of operations (freight ton-kilometers + passenger-kilometers)/length of track, Russia is second only to China. Rail transport in Russia has been described as one of the economic wonders of the 19th, 20th, and 21st centuries.Intro adapted from Russell Pittman, \"Blame the Switchman? Russian Railways Restructuring After Ten Years,\" working paper, Antitrust Division, U.S. Department of Justice, 2011. Blame the Switchman? Russian Railways Restructuring After Ten Years JSC Russian Railways has a near-monopoly on long-distance train travel in Russia, with a 98.6% market share in 2017. Independent long-distance carriers include Grand Service Express TC, Tverskoy Express, TransClassService, Sakhalin Passenger Company, Kuzbass Suburb, and Yakutian Railway. ==Characteristics== Russia is larger than both the United States and China in terms of total land area. Its rail density (rail tracking/country area) is lower than those two countries. Russia's population density is also much lower so the Russian railways carry freight and passengers over very long distances, often through vast, nearly empty spaces. Coal and coke make up almost one-third of the freight traffic and have average hauls of around 1,500 kilometers. Ferrous metals make up another 10% of freight traffic and travel an average of over 1,900 kilometers. Railroads are often key to getting supplies to remote parts of the country. Like most railways, rail transport in Russia carries both freight and passengers. It is one of the most freight-dominant railways in the world, behind only Canada, the United States, and Estonia in the ratio of freight ton-kilometers to passenger-kilometers. Per head of population intercity passenger travel is far greater than the United States (which has the lowest long-distance passenger train usages in the developed world). There are seventeen regional railways. Most rail of the network uses the 1,520 mm Russian gauge. The Poland–Russia border line to Kaliningrad uses the 1,435 mm Standard gauge. ==Narrow-gauge railways== In 1981, there were 33,400 kilometers of narrow gauge. * Sakhalin Railway – located on Sakhalin, gauge of * Apsheronsk narrow-gauge railway – located in the Krasnodar Krai, gauge of * Kudemskaya narrow-gauge railway – located in the Arkhangelsk Oblast, Severodvinsk, gauge of * Alapayevsk narrow- gauge railway – located in the Sverdlovsk Oblast, Alapayevsk, gauge of * Altsevo peat railway – located in Nizhny Novgorod Oblast, gauge of * Kerzhenets peat railway – located in Nizhny Novgorod Oblast, gauge of * Pishchalskoye peat railway – located in Kirov Oblast, gauge of * Gorokhovskoye peat railway – located in Kirov Oblast, gauge of * Narrow-gauge railway of Decor-1 factory – located in the Arzamassky District, gauge of * Narrow-gauge railway of KSM-2 factory – located in the Tver, gauge of ==References==",
 "title": "Rail transport in Russia"
}