{
 "id": "109000",
 "text": "The Big Ten Conference is the United States' oldest Division I college athletic conference. Most of its 18 member institutions are in the Midwestern United States. The conference footprint expanded to the country's Pacific coast in 2024. ==Members== Institution Location Founded Joined Conference Affiliation Enrollment Nickname Varsity Teams NCAA Championships (as of January 1, 2014) (excludes football) University of Illinois at Urbana-Champaign Urbana and Champaign, Illinois 1867 1896 Public 42,728 Fighting Illini 21 18 Indiana University Bloomington Bloomington, Indiana 1820 1899 (Athletics 1900) Public 39,990 Hoosiers 24 24 University of Iowa Iowa City, Iowa 1848 1899 (Athletics 1900) Public 30,409 Hawkeyes 24 25 MarylandUniversity of Maryland, College Park College Park, Maryland 1856 2014 Public 37,631 Terrapins 20 25 University of Michigan Ann Arbor, Michigan 1817 1896 Inactive 1907-1916 Public 40,025 Wolverines 27 35 Michigan State University East Lansing, Michigan 1855 1950 (Athletics 1953) Public 45,520 Spartans 25 19 University of Minnesota Minneapolis and Saint Paul, Minnesota 1851 1896 Public 51,194 Golden Gophers 23 17 University of Nebraska–Lincoln Lincoln, Nebraska 1869 2011 Public 24,593 Cornhuskers 21 17 Northwestern University Evanston, Illinois 1851 1896 Private/Non-sectarian 13,407 Wildcats 19 8 Ohio State University Columbus, Ohio 1870 1912 Public 52,568 Buckeyes 35 25 Pennsylvania State University University Park, Pennsylvania 1855 1990 (Athletics 1993) Public 42,914*Includes only University Park campus. Nittany Lions (Lady Lions for women's basketball only) 31 43 Purdue University West Lafayette, Indiana 1869 1896 Public 39,333 Boilermakers 18 3 Rutgers University New Brunswick and Piscataway, New Jersey 1766 2014 Public 41,565 Scarlet Knights 27 1 University of Wisconsin Madison, Wisconsin 1848 1896 Public 41,466 Badgers 23 28 == Newest members == The Big Ten added four members after the 2023–24 school year, all from the Pac-12 Conference. Institution Location Founded Joining Conference Affiliation Enrollment Nickname Varsity Teams NCAA Championships (as of 2022–23) (excludes football) University of Oregon Eugene, Oregon 1876 2024 Public 23,202 Ducks 20 34 University of California, Los Angeles (UCLA) Los Angeles, California 1919 2024 Public 45,900 Bruins 25 121 University of Southern California (USC) Los Angeles, California 1880 2024 Private 49,500 Trojans 23 112 University of Washington Seattle, Washington 1861 2024 Public 49,522 Huskies 22 9 ===Associate members=== The Big Ten gained its first \"associate member\"—i.e., a school playing only a small number of sports (in this case, one) in the conference—in 2014. The same school brought a second sport into the Big Ten in 2016. A second school became an associate member in 2017. School Location Founded Joined Type (affiliation) Enrollment Nickname Big Ten sports Main Conference Johns Hopkins University Baltimore, Maryland 1876 2014 Private (nonsectarian) 5,066 Blue Jays Centennial Conference (Div. III) Johns Hopkins University Baltimore, Maryland 1876 2016 Private (nonsectarian) 5,066 Blue Jays Centennial Conference (Div. III) Notre Dame, Indiana 1842 2017 Private (Catholic) 11,773 Fighting Irish ACC == References ==",
 "title": "Big Ten Conference"
}