{
 "id": "1090766",
 "text": "Apex Legends is an battle royale first-person hero shooter video game. It is free-to-play. It was published by Electronic Arts and was developed by Respawn Entertainment. It is set in the universe of the Titanfall series. The game was first released on February 4, 2019 for the PlayStation 4, Windows, and Xbox One, with the Nintendo Switch version being released on March 10, 2021. The games would also be released for the next generation consoles. It would be released on March 29, 2022 for the PlayStation 5 and Xbox Series X/S. In the game, Legends come together to compete in a bloodsport called the Apex Games which are organized by a group called the Mercenary Syndicate. They battle for money and fame. Like in most battle royal games, the goal is to be the last team standing at the end of the game. There is an eSports tournament called the Apex Legends Global Series where players compete for $5 million. ==Reception== The game was very well liked by both game critics and players. Critics said that they liked the combat system and ping system. The game has also been praised for its LGBT representation, with the character Bloodhound being non binary. However, there were many individuals, including one of the voice actors, that did not approve of the game's representation of LGBT. The game has also won many awards. Among the awards won, it has been named Best Multiplayer Game at the 2019 Game Awards and Best Multiplayer game at the 2019 Golden Joystick Awards. ==References== ==Other websites== * Category:2019 video games Category:Respawn Entertainment games Category:Battle royale games Category:Esports games Category:First-person shooters Category:Free-to-play video games Category:Hero shooters Category:Nintendo Switch games Category:PlayStation 4 games Category:PlayStation 5 games Category:Video game sequels Category:Video games developed in the United States Category:Windows games Category:Xbox One games Category:Xbox Series X and Series S games",
 "title": "Apex Legends"
}