{
 "id": "1090341",
 "text": "The Italian railway system has a total lengthTotal length of tracks: double tracks are counted twice. of of which active lines are 16,723 km. The network has recently grown with the construction of the new high-speed rail network. Italy is a member of the International Union of Railways (UIC). The UIC Country Code for Italy is 83. ==The network== Rete Ferroviaria Italiana, Italian Rail Network, is the state owned infrastructure manager. The Italian railway system has a length of , of which are standard gauge. The active lines are , of which are double tracks. Italy has 2,507 people and 12.46 km2 per kilometer of rail track, giving Italy the world's 13th largest rail network.Compare List of countries by rail transport network size. Lines are divided into 3 categories: *fundamental lines , which have high traffic and good infrastructure quality. These are the main lines between major cities throughout the country. Fundamental lines are long; *complementary lines , which have less traffic and are responsible for connecting medium or small regional centers. Most of these lines are single track and some are not electrified; *node lines , which link complementary and fundamental lines near metropolitan areas for a total . Most of the Italian network is electrified (). Electric system is 3 kV DC on conventional lines and 25 kV AC on high- speed lines. A major part of the Italian rail network is managed and operated by Rete Ferroviaria Italiana. Other regional agencies, mostly owned by public entities such as regional governments, operate on the Italian network. Travellers who often make use of the railway during their stay in Italy might use Rail Passes, such as the European Interrail or Italy's national and regional passes. These rail passes allow travellers to use regional trains without paying during the validity period, but all high-speed and intercity trains require a 10-euro reservation fee. Regional passes, such as \"Io viaggio ovunque Lombardia\", offer one-day, multiple-day and monthly period of validity. There are also saver passes for adults, who travel as a group, with savings up to 20%. Foreign travellers should purchase these passes in advance, so that the passes can be delivered by post prior to the trip. When using the rail passes, the date of travel needs to be filled in before boarding the trains. ==References==",
 "title": "Rail transport in Italy"
}