{
 "id": "1090396",
 "text": "The Danube Bridge (also known as the Friendship Bridge; is a steel truss bridge over the Danube River connecting the Bulgarian bank to the south with the Romanian bank to the north. It goes between the cities of Ruse and Giurgiu.It is one of only two bridges connecting Romania and Bulgaria. The other one is the New Europe Bridge between the cities of Vidin and Calafat. ==History== It was opened on 20 June 1954.The history of \"The Danube\" bridge The bridge is 2.8 km long. It passes at a height of 30 meters over the river. It was the first bridge over the Danube shared by Bulgaria and Romania. Decorations were designed by Bulgarian architect Georgi Ovcharov. The bridge has two decks; a two lane motorway and a railway. There are also sidewalks for pedestrians. The central part of the bridge (85 m) can be lifted for large boats. The maintenance of the mobile part is Romania's responsibility and is periodically checked. The bridge was built in two and a half years with the aid of the Soviet Union. The Soviets named it the \"Friendship Bridge\". Since the fall of the communist regimes in both countries, it is now called \"Danube Bridge\". The bridge is a border crossing between the two countries. Since January 2007 there is no more customs control. The passport/identity card control is done \"on one desk\" either by the Bulgarian or the Romanian border police. It is an \"internal border\" within the European Union. Border control will be completely removed when Bulgaria and Romania join the Schengen Agreement. There are a pair of rectangular towers supported by pillars on both ends. ==Tolls== The following tolls apply for crossing the Danube Bridge: Vehicle Euro Up to 8+1 seats; Up to 3.5 t 6 euro Trucks up to 7.5 t; Vehicles between 9 and 23 seats 12 euro Trucks up to 12 t 18 euro Trucks over 12 t with up to 3 axles; Vehicles with over 23 seats 25 euro Trucks over 12 t with 4 or more axles 37 euro ==Gallery== File:Pont_de_l%27amiti%C3%A9_Rouss%C3%A9-Giurgiu.jpg|Romanian side of the bridge File:Danube_Bridge_from_the_train.jpg|Middle of the bridge seen from the Bosphorus Express train (Bucharest–Istanbul) == References == == Other websites == * * Halfway down the Danube, a short story about crossing the bridge Category:Bridges in Bulgaria Category:Bridges in Romania Category:Rail transport in Bulgaria Category:Rail transport in Romania",
 "title": "Danube Bridge"
}