{
 "id": "1090874",
 "text": "Disability-adjusted life years (DALYs) are a way of measuring the effects of diseases. They are calculated as the number of years lost due to ill-health, disability, or early death. The measure was developed in the 1990s as a way of comparing the overall health and life expectancy of different countries. DALYs are used in the field of public health and health impact assessment . They include the potential years of life lost due to premature death and years of 'healthy' life lost by virtue of being in states of poor health or disability. In so doing, mortality and morbidity are combined into a single figure. == Calculation == Disability-adjusted life years are related to the quality- adjusted life year (QALY) measure; however, QALYs only measure the benefit with and without medical intervention and therefore do not measure the total burden. Also, QALYs tend to be an individual measure and not a measure of the whole population. The most appropriate measure of the effects of chronic illness is time, both time lost due to premature death and time spent disabled by disease. One DALY, therefore, is equal to one year of healthy life lost. How much a medical condition affects a person is called the disability weight (DW). This is determined by disease or disability and does not vary with age. Tables have been created of thousands of diseases and disabilities, ranging from Alzheimer's disease to loss of finger, with the disability weight meant to indicate the level of disability that results from the specific condition. Examples of disability weight Condition DW 2004 DW 2010 Alzheimer's and other dementias 0.666 0.666 Blindness 0.594 0.195 Schizophrenia 0.528 0.576 AIDS 0.505 0.547 Burns 20%–60% of body 0.441 0.438 Fractured femur 0.372 0.308 Moderate depression episode 0.350 0.406 Amputation of foot 0.300 0.021–0.1674 Deafness 0.229 0.167–0.281 Infertility 0.180 0.026–0.056 Amputation of finger 0.102 0.030 Lower back pain 0.061 0.0322–0.0374 Examples of the disability weight are shown. Some of these are \"short term\", and the long-term weights may be different. ==References== Category:Health Category:Demography",
 "title": "Disability-adjusted life year"
}