{
 "id": "1090083",
 "text": "The Japan Railways Group, more commonly known as the JR Group. Except JRF, all JR companies give customers passenger trains. JRF operates only freight service. JR groups is largest railway company in Japan and is still spreading all over Japan. == Companies == The six passenger railways of the JR groups are separated by region. Each of them provide services in their business area. However, some trains operates through more 2 companies. == Stations == There are many JR stations in all over Japan. Every day about over 21,000,000 people use JR train. Most of stations are usually open from 4 or 5 a.m. until 1 a.m. the next day. Some stations are open later or close ealrier. Urban stations have convenience store. They sell many things, including newspaper, drinks, foods and so on. There are also many shops inside the ticket gates, which are called \"駅ナカ\"(ekitana) in Japanese. Each of stations are given original numbering. For example, Tokyo station is given JT-01, JK-26, JY-01, JC-01, JO-19 and JE-01. The numbering is made for passengers' convenience. == Networks == JR networks are composed of Shinkansen lines and conventional lines. Shinkansen trains run over 320km/h(about 200 mph). On conbentional lines not only local train, but also Limited express train. Limited express trains are faster than local train; Usually, Limited express trains run 100-130km/h(about 60-80mph). === Shinkansen Lines === There are 7 line service. Some shinkansens are connected. For example, Tokaido Shinkansen is connected to Sanyo Shinkansen at Shin-Osaka station. Shinkansen is famous for the safe and non-delay service. Shinkansen is major transportation in Japan. Typical Shinkansen is NOZOMI. You take NOZOMI train, it requires only about 140 minutes to travel to Osaka from Tokyo. NOZOMI is operated every 4 minutes. === Conbentional lines === There are many line service and the network is complex. JR companies are try to be simple. Typical Conbentional line is Yamanote Line. Yamanote line is connecting most of major station in Tokyo. It is loop service and only local trains are running. Further example is JR-Kyoto Line. On JR-Kyoto Line, not only local train, but also Rapid, Special Rapid, Limited Express\"Thunder bird\", \"Haruka\", \"Super Hakuto\" so on. == Fares and tickets == To take JR trains, you should pay fare. As you travel far and far, fare is more expensiver. Tickets for a short distance is sold at automatic vending machine. If you want to ticket which are not selling on vending machine, go to Ticket Office. To take Limited Express train, you should pay additional charge, which are called \"特急料金\" in Japan. So you should buy a normal ticket(called \"乗車券\") and a Limited Express ticket(called \"特急券\"). JAPAN RAIL PASS is a ticket offered jointly by the six JR Group companies, and it is convenient and reasonably priced for traveling throughout Japan by train. JAPAN RAIL PASS is vailed for the person who are foreign tourist. Except NOZOMI and MIZUHO, you can take any JR trains. Category:Transport in Japan",
 "title": "Japan Railways Group"
}