{
 "id": "1090789",
 "text": "Savitri and Satyavan are starcrossed lovers who were able to defy death through their love and ascetism. Savithri was a beautiful princess who cannot choose a suitor. Her parents were worried for her, but eventually she met Satyavan. Upon meeting Satyavan, she swore she would never marry another man, and would only be with Satyavan for the rest of her life. Satyavan, although appearing as a simple man, actually used to be a prince who was cursed with a shockingly early expiry date. In specific, the curse entailed that Satyavan would die in a few years and that his parents would be cursed with blindness and lose thier wealth. Savithri's parents were ecstatic, but their excitement quickly died down when the Sage Narad told them of the curse and said their doom was imminent. Although they didn't want her to continue seeing Satyavan, they knew that Savithri was as stubborn as she was beautiful, and would not give up on a man she so purely and truly loved. So Savithri and Satyavan lived a very simple and happy life until one day, doom fell upon them and Satyavan fell from a heat stroke. It had seemed the curse had finally taken place. However, Savithri was not ready to say bye yet, and when Yamaraj, the god of the Underworld, came to collect Satyavan's body, Savithri followed him as he trudged to the underworld. Yamaraj, initially unpetrubed, decided to test her patience and see how far she was willing to walk. After a while, Yamraj, clearly impressed by her devotion, turned around and granted her a boon, on the condition that she could not wish for the revival of her husband. And so, Savithri asked for his parents to have their sight restored. Yamaraj obliged and Satyavan's parents had their sight back. After more walking, she recieved three more boons. For the first boon, she wished that Satyavan's father had his wealth restored. For the second, she wished her own father, who had only a single daughter, would be blessed with 100 sons. Both were granted. Finally, however, she asked Yamraj for the boon of 100 sons for herself. Initially Yamraj obliged, but Savithri just repeated her boon and reminded him of her oath that she would only ever be with Satyavan. Thus, in order to fulfil her boon in the order of karma, Yamraj was forced to return Satyavan to Savitri. Category:Mahabharata",
 "title": "Savitri and Satyavan"
}