{
 "id": "1090011",
 "text": "Ulvi Hasanli (Ulvi Fakhreddin oglu Hasanov was born August 10, 1987, in Kirovabad) is an Azerbaijani journalist and political prisoner. He previously worked in organizations such as Dalga Youth Movement, Free Youth Organization, National Council of Democratic Forces and NIDA Civic Movement. Hasanli is currently the head of AbzasMedia. Hasanli, who faced a lot of pressure during his activities, was detained in November 2023 and charged with Article 206.3.2 (Smuggling by a group of people) of the Criminal Code. == Life == He was born on August 18, 1987 in the city of Kirovabad (now Ganja). In 2005, he graduated from Ganja city secondary school No. 29 and entered the Azerbaijan State Oil Academy, but was removed from the academy in 2006 due to his political activities. Later, Hasanli studied at Azerbaijan University of Tourism and Management in 2008-2013. == Activity == In the 2000s, he worked in the Dalga Youth Movement and became the chairman of the organization. He later became the founder and chairman of the Free Youth Organization established in 2011. He resigned from this position in November 2013. At the same time, Hasanli, a member of the National Council of Democratic Forces, became a member of the NIDA Civil Movement. During his tenure at NIDA VH, he later became a member of the Board of Directors of NIDA Civil Movement. Ulvi Hasanli is the director of \"AbzasMedia\" online publication, founded in 2016. According to the Committee to Protect Journalists, Abzas Media is one of the few independent institutions left in Azerbaijan after a series of raids, arrests and criminal investigations against independent media and press freedom groups since 2014. AbzasMedia is known for its investigations of government officials into business deals, including alleged corruption in the reconstruction works in Karabakh since 2020. In addition, Ulvi Hasanli participated in the parliamentary elections in Azerbaijan in 2020 as a neutral candidate. == Government pressures == During his political activity, Ulvi Hasanli faced continuous persecution by the Azerbaijani government. He was detained in March 2011 during the \"Great People's Day\" action. In September 2017, Hasanli underwent a medical examination related to compulsory military service and was given a postponement until 2019 due to rheumatism and kidney problems. Despite this, another examination was scheduled for Hasanli in October, and he was detained by the military police in the hospital where he went for examination. After the young activist was taken to the military commissariat, he was sent to a military unit in Barda district. At that time, he was not warned about his military service, he was not given the opportunity to say goodbye to his family and get his affairs in order. In November of the same year, under the chairmanship of judge Elshad Shamayev of the Baku Court of Appeals, the complaint of NIDA Movement activist Ulvi Hasanli about illegal arrest and inhuman, degrading treatment and torture was considered, but his complaint was not upheld. He was one of the three journalists who protested against the 2022 legislation that would force media outlets to register with the state media register. In June 2023, Hasanli was detained by the Azerbaijani police at the Binagadi District Police Station for reporting on the events of Soyudlu. He was detained that year during a flash mob held by a group of political activists at the US Embassy. == Arrest == In November 2023, pro-government Azerbaijani media outlets \"AbzasMedia\", \"Radio Free Europe/Radio Liberty\", \"Voice of America\", \"BBC Azerbaijan\", \"ToplumTV\" and \"MeydanTV\" were accused of \"overshadowing what the government has won in Karabakh\". . On November 20, 2023, the editor-in-chief of \"AbzasMedia\" Sevinj Vagifqizi reported that Ulvi Hasanli was detained at Heydar Aliyev International Airport. He added that this incident is politically motivated and related to Hasanli's journalistic activities. Later, it became known that Hasanli was taken to the Baku City Police Department. After Hasanli was detained, the authorities searched the Baku office of \"AbzasMedia\" and did not allow journalists to enter the editorial office. The police also claimed to have found 40,000 euros in cash during a search of AbzasMedia's offices, but AbzasMedia stated that this money was placed to falsify the charges against Hasanli. In addition, according to Hasanli's statements, he was tortured and physically abused by the police during his detention. According to the statement made by AbzasMedia, the questions asked by the investigators were about the corruption investigations of those state bodies. Later, Sevinj Vagifqizi was also detained by the police at the airport. Ulvi Hasanli was charged with Article 206.3.2 of the Criminal Code (Smuggling by a group of persons). Organizations such as Amnesty International , the Committee for the Protection of Journalists, and the International Press Institute called Ulvi Hasanli's arrest illegal and demanded his release. == References == Category:Azerbaijani journalists Category:Prisoners Category:1987 births Category:Living people Category:21st- century Azerbaijani people",
 "title": "Ulvi Hasanli"
}