{
 "id": "1090552",
 "text": "This is a list of characters in the Garfield comic strip, created by Jim Davis == Main characters == === Garfield === The main character of the franchise. He is a lazy orange cat who loves lasagna and hates Mondays. He is voiced by Scott Beach, Lorenzo Music, Bill Murray, Frank Welker, Tom Smothers, Jeff Bergman, Jon Banard and Chris Pratt, Jimmy Tatro (Nickelodeon series). === Jon Arbuckle === voiced by Thom Huge, Sandy Kenyon, Jon Banard, Wally Wingert and Nicolas Hoult, Josh Keaton (Nickelodeon series). === Lyman === voiced by Frank Ferrante. === Odie === voiced by Gregg Berger, Harvey Guillen and Benjamin Diskin (Nickelodeon series). === Pooky === Pooky is Garfield's stuffed plush. === Dr. Liz Wilson === voiced by Julie Payne, Vanessa Marshall and Erica Lindbeck (Nickelodeon series). === Nermal === voiced by Desiree Goyette, David Eigenberg, Jason Marsden and Tom Kenny, Atticus Shaeffer (Nickelodeon series). === Arlene === voiced by Debra Messing, Audrey Wasilewski and Jenny Yokobori. === Squeak === voiced by Gregg Berger. == Arbuckle family == === Mom === voiced by Julie Payne, Cheri Oteri and Gillian Jacobs (Nickelodeon series) === Dad === voiced by Frank Welker. === Aunt Gussie === voiced by Kari Wahlgren. === Grandma === voiced by Pat Carroll. === Doc Boy === voiced by David Lander, Dana Snyder (Nickelodeon series). == Garfield's family == === Garfield's mother === voiced by Sandi Huge. === Garfield's grandfather === Garfield's grandpa his first appeared in the strip on November 10, 1980. == Minor recurring characters == === Herman Post === voiced by Gregg Berger. === Irma === First Appearance: June 9, 1979 === Binky the Clown[edit] === First Appearance: September 17, 1986 voiced by Thom Huge. === The Big Vicious Dog === First Appearance: September 12, 1995 === Hubert and Reba === Hubert and Reba are an elderly couple who live near Jon. === The Buddy Bears === Voiced by Lorenzo Music, Howard Morris, Thom Huge, Julie Payne, Gregg Berger. *",
 "title": "List of Garfield characters"
}