{
 "id": "1091972",
 "text": "Callaloo ();\"callaloo\" Merriam-Webster's Dictionary on merriam-webster.com is a plant used in popular dishes in many Caribbean countries. In some Caribbean countries, a stew made with the plant is called callaloo. In Trinidad and Tobago and Grenada, the dish itself is called callaloo, and uses taro leaves (known by many local names such as 'dasheen bush', 'callaloo bush', or 'bush') or Xanthosoma leaves (known by many names, including cocoyam and tannia). ==Callaloo recipes== Callaloo in eastern Caribbean countries is generally made with okra and dasheen or water spinach Ipomoea aquatica. There are many sorts of callaloo which may include coconut milk, crab, conch, Caribbean lobster, meats, pumpkin, chili peppers, and other seasonings such as chopped onions and garlic. The ingredients are added and cooked gently to a somewhat stew-like consistency. When done, callaloo is dark green in colour and is served as a side dish which may be used as a gravy for other food. In Guyana it is made in various ways without okra. In Jamaica, callaloo is often combined with saltfish or other meats, and is usually seasoned with garlic, carrots, local powdered seasoning, tomatoes, salt, scotch bonnet peppers, onions, scallions, thyme, sweet pepper and pimento. It is often eaten as a side dish with a full course meal, or as either breakfast or dinner with roasted breadfruit, boiled green bananas and dumplings, or bread. It is even added to Jamaican patties, called vegetable/vegie/vagan patties, seasoned rice, as well as Fritters In Grenada, callaloo is steamed with garlic, onion and coconut milk and often eaten as a side dish. Grenadians also stir or blend the mixture until it has a smooth consistent texture. Callaloo soup of callaloo, okra (optional), dumplings, ground provision like yam, potato (sweet and \"Irish\") chicken and beef is traditionally eaten on Saturdays. It is also one of the most important ingredients in oil down, the island's national dish of steamed breadfruit, callaloo, dumplings, ground provision, carrot and several varieties of meat—salt fish, chicken, and pork. All of this is steamed in coconut milk and saffron powder. In the Virgin Islands, callaloo is served with a dish of fungee on the side. In Guadeloupe, calalou au crabe (crab callaloo) is a traditional Easter dish. In St. Lucia, crab callaloo is also popular especially as part of the country's Creole day celebrations. Martinique and Guadeloupe also have a variety served with Creole rice and salt cod salad. A similar variation is the recipe called laing is popular in the Philippines, mainly the Bicol region. ==References== Category:Anguillian food Category:Belizean food Category:Grenada Category:Guyanese food Category:Jamaican food Category:Saint Lucia Category:Trinidad and Tobago food Category:Filipino food",
 "title": "Callaloo"
}