{
 "id": "1091928",
 "text": "Thali (meaning \"plate\" or \"tray\") or Bhojanam (meaning \"full meal\") is a round platter used to serve food in South Asia, Southeast Asia and the Caribbean. Thali also means an Indian-style meal made of a selection of dishes which are served on a platter. == Thali/Bhojanam meal == Thali refers to the metal plate that a thali meal may be served on, while Bhojanam refers to full meals. Thali is a popular method of serving meals in South Asia. The idea behind a thali is to offer different flavours on one single plate. According to Indian food custom, a proper meal should be a perfect balance of six flavours. Restaurants typically offer a choice of vegetarian or meat-based thalis. Vegetarian bhojanams are very typical and commonplace in Tamil Nadu canteens Dishes served in a thali vary from region to region in the Indian subcontinent. They are usually served in small bowls, called katori in India. These katoris are placed along the edge of the round tray, the actual thali. Sometimes a steel tray with multiple compartments is used. Typical dishes include rice, dal, vegetables, roti, papad, yogurt, small amounts of chutney or pickle, and a sweet dish.\"Decording Indian Cuisine\", in Spicy Thali blog, 26 June 2011. (Entry. Retrieved 3 June 2012) Rice or roti is the usual main dish that occupies the central portion of the thali. Side dishes like vegetable curries are lined in a circle around the thali. The thali has food from the region. In general, a thali begins with different types of breads such as puris or chapatis (rotis) and different vegetarian specialities (curries). In South India and Southeast Asia, rice is the only staple served with bhojanams. Thalis or Bhojanams are sometimes referred to by the regional characteristic of the dishes they contain. For example, one may encounter Andhra bhojanam, Nepalese thali, Rajasthani thali, Gujarati thali, Maharashtrian thali, Manipuri chakluk, Tamil unavu and Thai unavu. In many parts of South Asia, Southeast Asia and the Caribbean, the bread and the rice portions are not served together in the thali. Typically, the bread is offered first with rice being served afterwards, often in a separate bowl or dish. ==References== Category:Indian food Category:Pakistani food Category:Nepalese food Category:Malaysian food Category:Sri Lankan food Category:Maldivian food Category:Afghan food Category:Singaporean food Category:Thai food Category:Burmese food Category:Bhutanese food Category:Bangladeshi food Category:Cambodian food Category:Laotian food Category:Indonesian food Category:Bruneian food Category:Fijian food Category:Mauritian food",
 "title": "Thali"
}