{
 "id": "1091784",
 "text": "Inah Canabarro Lucas (also known as Sister Inah; 8 June 1908 - 30 April 2025) was a Roman Catholic nun and supercentenarian from Brazil who has been the world's oldest living person since the death of Tomiko Itooka on 29 December 2024. She was also the world's oldest living nun follwing the death of Lucile Randon on 17 January 2023. Canabarro Lucas died on 30 April 2025 at the age of 116. == Ranking == * January 2, 2022 - at the age of 113 years, 208 days, Inah Canabarro Lucas surpassed the age of Luzia Mohrs to become the oldest Brazilian ecclesiastical person ever. * January 23, 2022 - Antonia da Santa Cruz died. Inah Canabarro Lucas, aged 113 years, 229 days, became the oldest living person in South American. * June 8, 2022 - Celebrated 114th birthday. * July 30, 2022 - Sofia Rojas died. Inah Canabarro Lucas, aged 114 years, 51 days, became the oldest living person in South American. * January 17, 2023 - Lucile Randon died. Inah Canabarro Lucas, aged 114 years, 223 days, became the oldest living person in nun. * June 8, 2022 - Celebrated 115th birthday. * June 10, 2023 - Inah Canabarro Lucas surpassed the record by beating Anonymous of Hyōgo (115 years, 1 days). * June 17, 2023 - Inah Canabarro Lucas surpassed the record by beating Annie Jennings (115 years, 8 days). * June 23, 2023 - Inah Canabarro Lucas surpassed the record by beating Antonia Gerena Rivera (115 years, 14 days). * June 28, 2023 Inah Canabarro Lucas surpassed the record by beating Koto Okubo (115 years, 19 days). * August 5, 2023 - Inah Canabarro Lucas surpassed the record by beating Bessie Hendricks (115 years, 57 days). * August 10, 2023 - Inah Canabarro Lucas surpassed the record by beating Hendrikje van Andel-Schipper (115 years, 62 days). * August 22,2023 - Inah Canabarro Lucas surpassed the record by Valentine Ligny (116 years, 74 days). * August 27, 2023 - Inah Canabarro Lucas surpassed the record by beating Augusta Holtz (115 years, 79 days). * August 29, 2023 - Inah Canabarro Lucas surpassed the record by beating Casilda Benegas Gallego (115 years, 81 days). * February 22, 2024 - Edith Ceccarelli died. aged she moved up to three place. * June 8, 2024 - Celebrated 116th birthday. * June 26, 2024 - Inah Canabarro Lucas surpassed the record by beating Edith Ceccarelli (116 years, 17 days). * July 4, 2024 - Inah Canabarro Lucas surpassed the record by beating Jeralean Talley (116 years, 25 days). * July 26, 2024 - Inah Canabarro Lucas surpassed the record by beating Ana María Vela Rubio (116 years, 47 days). * August 18, 2024 - Inah Canabarro Lucas surpassed the record by beating Tekla Juniewicz (116 years, 70 days). * August 19, 2024 - Maria Branyas Morera died. aged she moved up to second place. * September 7, 2024 - Inah Canabarro Lucas surpassed the record by beating Maria Giuseppa Robucci (116 years, 90 days). * September 17, 2024 - Inah Canabarro Lucas surpassed the record by beating Besse Cooper (116 years, 100 days). * October 5, 2024 - Inah Canabarro Lucas surpassed the record by beating Elizabeth Bolden (116 years, 118 days). * October 15, 2024 - Inah Canabarro Lucas surpassed the record by beating Jeanne Bot (116 years, 128 days). * December 1, 2024 - Inah Canabarro Lucas surpassed the record by beating Tane Ikai (116 years, 175 days). * December 29, 2024 - Tomiko Itooka died. Inah Canabarro Lucas, aged 116 years, 204 days, became the world's oldest living person. * January 15, 2025 - Inah Canabarro Lucas surpassed the record by beating Tomiko Itooka (116 years, 220 days). * January 19, 2025 - Inah Canabarro Lucas surpassed the record by beating Antonia da Santa Cruz (116 years, 224 days). * January 26, 2025 - Inah Canabarro Lucas surpassed the record by beating Fusa Tatsumi (116 years, 231 days). * March 8, 2025 - Inah Canabarro Lucas surpassed the record by beating Julia Maria Francisca Simao (116 years, 272 days). * March 12, 2025 - Inah Canabarro Lucas surpassed the record by beating Gertrude Weaver (116 years, 276 days). * April 16, 2025 - Inah Canabarro Lucas surpassed the record by beating Susannah Mushatt Jones (116 years, 311 days). * April 30, 2025 - Inah Canabarro Lucas died and was succeeded als oldest living person by Ethel Caterham. ==References== Category:1908 births Category:2025 deaths Category:Brazilian educators Category:Nuns Category:Supercentenarians Category:People from Rio Grande do Sul",
 "title": "Inah Canabarro Lucas"
}