{
 "id": "1091617",
 "text": "Nikolaos Koklonis (born August 4, 1983) is a Greek entrepreneur, producer and TV presenter. == Early life and Professional career == Nikos Koklonis studied business administration at the Athens University of Economics and Business and got a master’s degree in marketing at the Cornell University in New York. In 2012, he founded Air Fast Tickets. In 2015, Koklonis appeared on Fortune 's list of the 40 most successful entrepreneurs under 40. He was a representative of the electronic platform Dealber , which was based and housed on Syngrou Avenue. The company cooperated with the TV station SKAI, giving prizes to the winners of the game show Kane Pazari. === Television career === Kokloni's television career began in 2016 with the travel show Celebrity Travel, which was initially broadcast on the SKAI television network. He is the founder of the television production company Barking Well Media and the publisher of the magazine OK! as well as the websites Znews and OK mag.During the 2020–2021 season Barking Well also produced the Mega Channel 's Roomies and Celebrity Game Night. In 2020, Koklonis acquired the rights of the OK! brand for Greece. In 2021 he launched the OK! website in Greece for the first time at okmag.gr.. During the 2021-2022 season, Barking Well expanded its partnership with Mega, assuming production responsibilities for the live entertainment shows Hamogela Xana (which still airs on Mega Tv every weekend) and Ti Les Tora. In 2023, Barking Well Media assumed the production of the “IQ 160” TV series for Star Channel. In September of the same year Barking Well Media produced for Star Channel the Greek version of “Star Academy” talent show, that was launched under the name “Fame Story”.Fashion TV: Οι λαμπεροί καλεσμένοι στο World’s Excellence Gala 2023Αρχική συμφωνία Open-Barking Well Media, Ο Ν. Κοκλώνης αναλαμβάνει την ψυχαγωγία και του Open == References == Category:1983 births Category:Living people Category:Greek businesspeople",
 "title": "Nikolaos Koklonis"
}