{
 "id": "1091798",
 "text": "A static web page is a type of web page that is pre-made and does not change, unless someone updates the code or content of the page manually. This means that when you visit a static web page, you will always see the same thing, assuming nothing has been changed on the server where the page is hosted. Static web pages are made up of fixed content that is written in basic computer languages such as HTML (HyperText Markup Language) and CSS (Cascading Style Sheets). These languages allow designers to create the layout, structure, and appearance of the page. JavaScript can also be used to add interactive features, but overall, static web pages have limited functionality compared to dynamic web pages. ==Advantages of static web pages== # They are generally faster to load than dynamic web pages because they do not require any processing by the server before being sent to the user's browser. # They are easier to create and maintain since they don't rely on complex programming scripts or databases. # Static websites are more secure since there is no risk of vulnerabilities from third-party software or plugins. # Hosting costs tend to be lower due to reduced resource requirements. ==Disadvantages of static web pages== # Limited interactivity; users cannot submit forms or personalize their experience without additional technologies like cookies or session storage. # Difficulty updating multiple pages simultaneously - each page must be updated individually. # Lack of scalability; adding new features may require significant rework of existing files. # Content management systems (CMS) cannot be easily integrated into a purely static site, making it harder to manage large amounts of content. In summary, while static web pages offer some benefits, particularly around speed, simplicity, and security, they lack the flexibility and advanced capabilities found in modern dynamic websites. However, they remain an appropriate choice for simple sites with minimal needs. Category:Websites",
 "title": "Static web page"
}