{
 "id": "1091191",
 "text": "The history of the universe started with an event called \"The Big Bang\". It took place billions of years ago, when the universe went from highly-packed energy, to rapidly-expanding energy, like an explosion. This was first postulated by Georges Lemaître in 1930 after Edwin Hubble observed that stars are expanding away from Earth in every direction.https://www.ncbi.nlm.nih.gov/books/NBK230211/ The universe still expands today. The earliest stages of the universe had equal amounts of matter and anti-matter. They collided with each other, and canceled each other out. After thousands of years, matter began to outnumber anti-matter. Today, the universe is made of mostly matter, and not much anti-matter exists. The different types of subatomic particles appeared quickly. One second after the Big Bang, particles called neutrinos separated from the rest of the universe. Neutrinos still exist, but are so small we can't see them without large nuclear machines. When the subatomic particles collided, they created atoms. Everything you can touch and feel is made of atoms. Atoms are categorized into elements based on their subatomic particles. Elements with simple atomic structures, such as hydrogen and helium, were seen soon after the Big Bang. Atoms can have different states, depending on how much energy they have. When these earliest atoms first released energy in the form of light, they left a measurable effect in the form of a faint glow called electromagnetic radiation that large telescopes at observatories can see in the night sky. Once hydrogen and helium started forming, they created clouds of gas. Gravity caused these clouds to rotate, creating galaxies and stars. Some atoms, such as lithium, appeared as dust particles. As dust particles formed and gravitated toward each other, they created planets. The Big Bang took place sometime 10-22 billion years ago, and Earth first formed around 4 billion years ago. The history of life on Earth began soon after it was formed, around 3.7 billion years ago. However, humans did not appear until much later, ~6 million-500,000 years ago, a tiny fraction of the history of life (~0.16%, this is because a billion is much, much larger than a million!). Some day, the universe will end. This is estimated to occur extremely far in the future, in an event called the \"Heat Death\". When this happens, the universe will have expanded so much, that all matter will be equalized. It is estimated to occur in (17 followed by 106 zeroes) years in the future (also written as 1.7*10^106 years.). Physicists believe that an even longer time after the end of the universe (~10^10^10^56 years), another universe could randomly appear.https://ui.adsabs.harvard.edu/abs/2004hep.th...10270C/abstract ==References== Category:Universe",
 "title": "History of the universe"
}