{
 "id": "1091589",
 "text": "A cabbage roll is a dish made of cooked cabbage leaves wrapped around some sort of stuffing. It is eaten in Central, Northern, Eastern and Southeastern Europe and much of Western Asia, Northern China, as well as parts of North Africa. Meat fillings are traditional in Europe. That may be beef, lamb, or pork seasoned with garlic, onion, and spices. Grains such as rice and barley, mushrooms, and vegetables are often included as well. Fermented cabbage leaves may be used for wrapping, particularly in southeastern Europe. In Asia, seafoods, tofu, and shiitake mushrooms or Vegeta may also be used. Chinese cabbage is often used as a wrapping. Cabbage leaves stuffed with the filling are then baked, simmered, or steamed in a covered pot. They are generally eaten warm with a sauce. Many different sauces are used.. In Sweden and Finland, stuffed cabbage is served with lingonberry jam, which is both sweet and tart. In Central and Eastern Europe, tomato-based sauces and sour cream are typical. In Lebanon, the cabbage is stuffed with rice and minced meat and only rolled to the size of a cigar. It is usually served with a side dish of yogurt and a type of lemon and olive oil vinaigrette seasoned with garlic and dried mint. Cabbage roll is eaten a lot in Romania. The recipe and sizing depends on the region. It often takes up to 6 hours to cook. Traditionally it is made with pork, beef, bacon, rice, spices and aromatics, in tomato sauce and served with polenta, sour cream and spicy pickled peppers. Cooking textbook author Nancy Krcek stated that the origins are unclear. It is possible multiple groups of people invented it at the same time. Another cooking book author Malgorzata Caprari stated it is believed that credit is owed to the poorer inhabitants of Central and Eastern European countries. Due to the widespread cultivation of cabbage in these regions, it is likely that the cultures who inhabited them were the original inventors of this dish. Cabbage rolls have found their way into popular culture, becoming one of the most recognizable dishes in Central and Eastern European cuisine. They often appear in literature and films as a symbol of homey comfort and tradition. A version called holishkes is traditionally eaten by Jews on Simchat Torah. Recipes vary. northern Poles prefer a savory sauce. In Galicia, Hungary and Ukraine people like sweet-and-sour. ==References== Category:Argentine food Category:Armenian food Category:Austrian food Category:Azerbaijani food Category:Belarusian food Category:Bulgarian food Category:Chilean food Category:Chinese food Category:Czech food Category:Finnish food Category:German food Category:Hungarian food Category:Israeli food Category:Jordanian food Category:Japanese food Category:Korean food Category:Lithuanian food Category:Moldovan food Category:Palestinian food Category:Polish food Category:Lebanese food Category:Romanian food Category:Russian food Category:Slovak food Category:Swedish food Category:Syrian food Category:Turkish food Category:Ukrainian food Category:Vietnamese food Category:Jewish food Category:Croatian food Category:Cabbage dishes",
 "title": "Cabbage roll"
}