{
 "id": "109136",
 "text": "College football is American football played by teams of students from different American universities, colleges, and military academies. Play between colleges first made American football popular in the United States. College football is still popular today among students, alumni, and other fans of the sport. American Football is variation of Rugby introduced by Walter Camp. The very first match between two college teams using new \"American\" variation of Rugby was played between Princeton and Rutgers University in 1869. First season of college football had only two matches played. The game became popular quickly in coming years. == National championships == *College football national championships in NCAA Division I FBS – The NCAA has never had an official championship for schools in the top-level Football Bowl Subdivision, or \"FBS\". Instead, several groups declare their own champions. *NCAA Division I Football Championship – The official championship for schools in the second-level Football Championship Subdivision, or \"FCS\". *NCAA Division I FCS Consensus Mid-Major football national championship *NCAA FCS Year-by-year playoff results *NCAA Division II national football championship *NCAA Division III national football championship *NAIA national football championship *NJCAA National football championship == Other websites == *NCAA football official site *Bowl Championship Series *College Football Hall of Fame *FCS College Football Weekly Preview *Most Valuable College Football Programs, Forbes *An account of the first intercollegiate game Statistics *NCAA football stats *Stassen College Football, comprehensive college football database *College Football Data Warehouse *Collegio Football , Electronic Almanac & Media Guide to NCAA College Football (1869 - Present) Rules *List of college football rule changes for 2006 *NCAA Football Rule Changes for 2007 (that are meant to shorten the game) *NCAA Football: Major Rule Changes (with rationales) *NCAA Football: 2007 Rules and Interpretations *",
 "title": "College football"
}