{
 "id": "1091943",
 "text": "In Indian cuisine, dal (also spelled daal or dhal in English; pronunciation: , are dried, split lentils, peas, and beans that do not require soaking before cooking. India is the largest producer of them in the world. The term is also used for soups prepared from these pulses. They are among the most important staple foods in South Asian countries == Use == The most common way of preparing dal is in the form of a soup to which onions, tomatoes and various spices may be added. The outer husk may or may not be stripped off. Almost all types of dal come in three forms: (1) unhulled or sabut (meaning whole in Hindi), e.g., sabut urad dal or mung sabut; (2) split with hull left on the split halves is described as chilka (which means shell in Hindi), e.g. chilka urad dal, mung dal chilka; (3) split and hulled or dhuli (meaning washed), e.g., urad dhuli or mung dhuli in Hindi. Dal is frequently eaten with flatbreads such as rotis or chapatis, or with rice. Some types of dal are fried and salted and eaten as a dry snack. Savory snacks are made by frying a paste made from soaked and ground dals in different combinations, to which other ingredients such as spices and nuts (commonly cashews) may be added. ==Common ingredients== * Pigeon pea, i.e., yellow pigeon pea, is available either plain or oily. What is the difference between Split Yellow Pea, Split Chickpea and Split Pigeon Pea? It is the main ingredient for the dish sambar. In Karnataka, it is called togari bele and is an important ingredient in bisi bele bath. It is called kandi pappu in Telugu and is used in the preparation of a staple dish pappu charu. It is also known as arhar dal in northern India. * Chana dal is produced by removing the outer layer of black chickpeas and then splitting the kernel. Machines can do this or it can be done at home by soaking the whole chickpeas and removing the loose skins by rubbing. In Karnataka it is called . Other varieties of chickpea may be used, e.g., kabuli dal. * Yellow split peas are very common in the Indian communities of Guyana, Fiji, Suriname, Jamaica, South Africa, Mauritius, Trinidad and Tobago, and are popular amongst Indians in the United States as well as India. There, it is referred to generically as dal and is the most popular dal. The whole dried yellow pea is the main ingredient in the common Bengali street food ghugni. * Split mung beans is by far the most popular in Bangladesh and West Bengal. It is used in parts of South India, such as in the Tamil dish ven pongal. Roasted and lightly salted or spiced mung bean is a popular snack in most parts of India. * Urad dal, sometimes referred to as \"black gram\", is a primary ingredient of the south Indian dishes idli and dosa. It is one of the main ingredients of East Indian (Odia and Bengali or Assamese) bori, sun-dried dumplings. The Punjabi version is . It is rich in protein. * Masoor dal: split red lentils. * Rajma dal: split kidney beans. * Mussyang is made from dals of various colours found in various hilly regions of Nepal. * Panchratna dal (Hindi) (\"five jewels\") is a mixture of five varieties of dal, which produces a dish with a unique flavour. * Navrangi Dal is a lesser known Dal variety from Himachal Pradesh. It is mostly cultivated in Himachal and is multicoloured. * Moth Bean: is an Indian dal main ingredient for popular Indian snack bikaneri bhujia and Maharashtrian snacks misal and usal. * Pulses may be split but not hulled; they are distinguished from hulled dals by adding the word chilka (skin). ==References== Category:Bangladeshi food Category:Indian food Category:Nepalese food Category:Pakistani food Category:Sri Lankan food Category:Fijian food",
 "title": "Dal"
}