{
 "id": "1091909",
 "text": "Paneer (), also known as panir (), is a fresh acid-set cheese common in the Indian subcontinent. It is made from full-fat buffalo milk or cow milk. It is a non-aged, non-melting soft cheese made by curdling milk with a fruit- or vegetable-derived acid, such as lemon juice. ==Nutrition and preparation== Paneer is prepared by adding food acid, such as lemon juice, vinegar, citric acid or dahi (yogurt),Adiraja Dasa. The Hare Krishna book of Vegetarian Cooking. Bhaktivedanta Book Trust, 1989, to hot milk to separate the curds from the whey. The curds are drained in muslin or cheesecloth and the excess water is pressed out. The paneer is then dipped in chilled water for 2–3 hours to improve its texture and appearance. What happens next varies. In North Indian cuisines, the curds are wrapped in cloth, placed under a heavy weight such as a stone slab for two to three hours, and then cut into cubes for use in curries. Pressing for a shorter time (approximately 20 minutes) results in a softer, fluffier cheese. In Bengali, Odia and other East Indian cuisines, it is beaten or kneaded by hand into a dough-like consistency, heavily salted and hardened to produce paneer (called ponir), which is typically eaten in slices at teatime with biscuits or various types of bread, deep-fried in a light batter or used in cooking. In the area surrounding the city of Surat in Gujarat, surti paneer is made by draining the curds and ripening them in whey for 12 to 36 hours. ==Use in dishes== Paneer is the most common type of cheese used in the Indian subcontinent. It is sometimes wrapped in dough and deep- fried or served with either spinach (palak paneer) or peas (mattar paneer). Paneer dishes can be sweet, like shahi paneer, or spicy/hot, like chilli paneer. File:Chamcham - Bainan - Howrah 2015-04-14 7905.JPG|Chamcham is a popular paneer sweet File:ChennaPoda.jpg|Chennapoda is a popular baked paneer cheese-cake from India File:Gur er Sandesh.jpg|Sandesh is a popular paneer sweet dish. File:Matar-Paneer.JPG|Mattar paneer, a vegetarian dish from India File:Yummy Palak Paneer.jpg|Palak paneer, a spinach-based curry dish File:Ishwar Paneer.JPG|Paneer tikka masala from India File:Malai Paneer Pizza from India.jpg|A pizza with paneer and vegetable toppings from India ==References== Category:Cheeses Category:Indian food Category:Persian food Category:Nepalese food Category:Bangladeshi food",
 "title": "Paneer"
}