{
 "id": "1091559",
 "text": "Beer () has a long history in what is now the Czech Republic. Brewing was recorded in Břevnov Monastery in 993. The city of Brno had the right to brew beer from the 12th century. Plzeň and České Budějovice (Pilsen and Budweis in German), had breweries in the 13th century. The most common Czech beers are pale lagers of the pilsner type, with a characteristic transparent golden colour, high foaminess, and lighter flavour. Czech people drink more beer per person than any other country. The largest Czech beer breweries are Pilsner Urquell, (Gambrinus, Radegast, Master); Staropramen (Staropramen, Ostravar, Braník, Velvet); and Budweiser Budvar. Other top-selling brands include Krušovice, Starobrno, Březňák, Zlatopramen, Lobkowicz, Bernard, and Svijany. The strength of beer is measured by degree scale (in Czech: stupňovitost). This is the a weight percentage of sucrose. So, 12° beer has 12% sucrose dissolved in water. A 10° beer is about 4% alcohol by volume, a 12° is about 5%, and a 16° is about 6.5%. According to Czech law, categories of beer, regardless of colour or style, are: * lehké – a \"light\" beer brewed below 8° with less than 130kJ per 100ml * výčepní – a \"draught\" beer, though it can be bottled, brewed between 8° and 10° * ležák – a \"lager\" beer, brewed between 11° and 12.99° * speciál – a \"special\" beer, brewed above 13°Evan Rail, 2007. Good Beer Guide Prague and the Czech Republic: CAMRA Books ==History== The history of beer in the modern Czech Republic, historically Bohemia, Moravia, and Silesia, goes back even before the Slavic migration in the 6th century. The ingredients used then were not the same as today. Hops have been grown, used in beer making, and exported since the twelfth century. Most towns had at least one brewery. The most famous brewing cities in Bohemia were České Budějovice, Plzeň, and Prague. Other towns with breweries include Rakovník, Žatec, and Třeboň. ==References==",
 "title": "Beer in the Czech Republic"
}