{
 "id": "1092063",
 "text": "Pea soup or split pea soup is soup made from dried peas, such as the split pea. It is the food of many cultures. It is most often greyish-green or yellow in color depending on the regional variety of peas used. They are all cultivars of Pisum sativum. ==History== Pea soup has been eaten since antiquity; it is mentioned in Aristophanes' The Birds, and according to one source \"the Greeks and Romans were cultivating this legume about 500 BC to 400 BC. During that era, vendors in the streets of Athens were selling hot pea soup.\": \"vendors in the streets of [classical] Athens were selling hot pea soup.\" Eating fresh \"garden\" peas before they were matured started in the Early Modern period:\"Cultivated peas were mainly eaten dried in Roman and Medieval times\", Maguelonne Toussaint-Samat notes (A History of Food, 2nd ed. 2009:39), giving details of the public introduction of fresh peas in their pods, coming from Genoa, at the court of Louis XIV, in January 1660. by contrast with the coarse, traditional peasant fare of pease pottage. Potage Saint-Germain, made of fresh peas\"potage Saint-Germain is a thick purée of fresh peas\" (Elizabeth Riely, The Chef's Companion: A Culinary Dictionary 2003); both directions like \"Heat 3 cans of pea soup to the boiling point with a cup of heavy cream\" (Louis Pullig De Gouy, The Soup Book, 1949) and references to \"Saint-Germain, a western suburb of Paris\" or \"the Count of Saint-Germain\" are in error. and other fresh greens braised in light stock and pureed, was served to Louis XIV of France, for whose court at the Château de Saint-Germain-en-Laye it was named, c. 1660–1680.Louis moved his seat permanently to Versailles in 1682. ===Britain and Ireland=== A well-known nursery rhyme, the first known written reference of which dates to 1765, speaks of > Pease pudding hot, Pease pudding cold, Pease pudding in the pot Nine days > old; Some like it hot, Some like it cold, Some like it in the pot, Nine days > old. Pease pudding was a high-protein, low-cost staple of the diet. As it is made from easily stored dried peas it was an ideal form of food for sailors, particularly boiled in accompaniment with salt porkFelicity Goodall, Lost Plymouth, Hidden Heritage of the Three Towns, 2009 which is the origin of pea and ham soup. It is still popular in the form of \"mushy peas\" sold with fish and chips, as well as with meat pies. Pea Soup is an English classic with many forms ranging from a thick purée, like mushy peas, to a more liquid dish. It can be made from fresh new peas or dried old peas. In 19th-century English literature, pea soup is referred to as a simple food and eating it as a sign of poverty. In the Thackeray short story \"A Little Dinner at Timmins's\", when a character asks his wife \"Why don't you ask some of our old friends? Old Mrs. Portman has asked us twenty times, I am sure, within the last two years\", she replies, with \"a look of ineffable scorn\", that when \"the last time we went there, there was pea-soup for dinner!\" In Thomas Hardy's Tess of the D'Urbervilles, Tess remarks that \"we have several proofs that we are d'Urbervilles ... we have a very old silver spoon, round in the bowl like a little ladle, and marked with the same castle. But it is so worn that mother uses it to stir the pea-soup.\" ===Germany=== Pea soup is a common dish throughout Germany. It often contains bacon, sausage or (cured and smoked pork). Very often, several sausages will accompany a serving of pea soup as well as some dark bread. Ready-made soup in cans is sometimes used. One of the first instant products was a pea soup product, which mainly consisted of pea meal and beef fat, Erbswurst (pea sausage). It was invented in 1867 by Johann Heinrich Grüneberg, who sold the recipe to the Prussian state. When the Franco-Prussian War broke out, the war ministry, which had tested the possibility of feeding soldiers solely on instant pea soup and bread, built a large manufacturing plant and produced between 4,000 and 5,000 tons of for the army during the war. In 1889, the Knorr instant-food company bought the license. Knorr, which is today a Unilever brand, stopped the production of on December 31, 2018. ===Netherlands=== , also called , is the Dutch version of pea soup. It is a thick stew of green split peas, different cuts of pork, celeriac or stalk celery, onions, leeks, carrots, and often potato. Slices of (smoked sausage) are added before serving. It is often served with Frisian rye bread () and bacon, cheese or butter. The bacon is usually , a variety of bacon which has been cooked and then smoked. Pancakes are sometimes served with pea soup; this dish is called , referring to the pancakes. In the Royal Dutch Navy the pea soup is completed with small cubes of lard which float as white squares on top. It is called (pea soup with floating ice). Koek-en-zopie outlets, small food and drinks stalls which spring up only during winters along frozen canals, ponds and lakes in the Netherlands for ice skaters, usually serve as a savoury snack. ===Nordic countries=== Nordic pea soup is normally cooked with pork – although the meat may sometimes be served on the side – and a typical recipe would also include onions and herbs like thyme and marjoram. In Finland the soup is made of green peas; in Sweden, Norway and Denmark yellow peas are used. ====Sweden and Finland==== In Sweden and Finland the soup is usually served with mustard, and sometimes also with extra (dried) herbs (thyme or marjoram) to be mixed into the soup at the table. The soup is then normally followed by pancakes with jam (strawberry, raspberry, bilberry, cloudberry or similar) for dessert. In Sweden, the soup is sometimes accompanied by warm punsch as a special treat. Pea soup in Sweden and Finland dates back to at least the 13th century. It is traditionally served on Thursdays. This is said to have been preparation for fasting on Fridays. The tradition of Thursday pea soup is common in restaurants, schools, military messes and field kitchens. In Finland, Laskiainen, a winter festival associated with Shrove Tuesday, is generally celebrated by eating green pea soup and either pancakes or a seasonal pastry called laskiaispulla. The celebration often includes downhill sledding. The Swedish king Eric XIV (1533–1577) is said to have died after eating arsenic-poisoned pea soup.Lars Ericson in Johan III, , p. 109 However, it is not proven that the arsenic was added to a pea soup. Pea soup is also known as one of the favorite dishes of Swedish author August Strindberg. He referred to pea soup as gudamat (food for the Gods). ====Denmark==== In Denmark, pea soup is served with boiled pork like pork belly and medisterpølse, as well as mustard, pickled beets and rugbrød on the side. It is sometimes turned into a feast, with lots of beer and snaps on festive occasions. In Denmark the dish can be dated to 1766 in written sources. IT might have started in the Bronze Age, when dried peas and cabbage became popular vegetables for the long winters there.. Beware: This is not always a solid source.Boyhus, Else-Marie (1996): Grøntsager – en køkkenhistorie, ===Poland=== In Poland, pea soup is associated with the military, where it still remains a popular dish. This is because pea soup is nutritious and cheap, and can be easily prepared in large quantities. Military pea soup () is said to have to be thick enough to put a spoon straight up in it. Though the pea soup is normally prepared in messes, the dish is typically associated with field kitchens. Decommissioned field kitchens are often used during mass events.http://wiadomosci.gazeta.pl/wiadomosci/51,114912,8920098.html?i=32 Volunteers distributing pea soup during XIX. GOOC Finale ==References== Category:Soups Category:Dutch food Category:Estonian food Category:Czech food Category:Polish food Category:Swedish food Category:Finnish food Category:Russian food Category:Bahamian food Category:Ukrainian food Category:American food Category:Australian food Category:German food Category:New Zealand food",
 "title": "Pea soup"
}