{
 "id": "1092671",
 "text": "DSU is the fifth studio album by American musician Alex G, released on June 17, 2014, through Orchid Tapes. ==Title== The title of the album is an acronym of Dream State University. He got the idea from something Giannascoli's older sister, Rachel, had said. He explained ==Critical reception== At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream publications, DSU received an average score of 79, based on 13 reviews, which means it got \"generally favorable reviews\". Samme Maine of Drowned in Sound wrote, \"Alex G speaks a refreshing honesty, with an artistic flair that many before him have failed to master. It's careful yet effortless, passionate yet distant but above-all, wholly unique.\" NMEs Ben Homewood said the album \"skillfully combines Neil Young's dusty American songcraft with scratchy lo-fi and wandering electronic influences.\" Dean Essner of Consequence of Sound said, \"At its best, DSU cycles through that duality with aplomb, which will serve as an excellent introduction to his gigantic discography for all new fans.\" Clashs Mat Smith said that the album \"is enduring evidence that the purest, most interesting music inevitably comes without hefty production or marketing budgets.\" Rolling Stone critic Simon Vozick-Levinson said, \"The more you listen, the more obvious it is that Alex G is a bright new talent in his own right.\" ===Accolades=== Publication Accolade Rank Consequence of Sound Top 50 Albums of 2014 CMJ The 30 Best Albums of 2014 Crack Magazine Albums of the Year 2014 MusicOMH Top 100 Albums Of 2014 The Line of Best Fit The Best Fit Fifty Essential Albums of 2014 Pitchfork The 200 Best Albums of the 2010s Rough Trade Top 100 Albums of The 2014 Time Out London The 30 Best Albums of 2014 Vogue The 10 Best Albums of 2014 The Washington Post Top 50 Albums of 2014 ==Album songs== ==Creators== Credits adapted from the liner notes of DSU. * Alex Giannascoli – production, recording * Emily Yacina – vocals * Samuel Acchione – tambourine * Warren Hildebrand – mastering * Jason Mitchell – additional mastering * Rachel Giannascoli – artwork ==Release history== Region Date Label Format Edition Various June 17, 2014 Orchid Tapes Standard edition France Kütu Folk CD Europe November 10, 2014 Lucky Number Bonus tracks edition Various September 16, 2016 Run for Cover ==References== Category:2014 albums",
 "title": "DSU (album)"
}