{
 "id": "1092962",
 "text": "The T-90 is a main battle tank in service with the Russian army. Some other countries have T-90S tanks. It is a third generation tank. The tank started as a type of the T-72B with some features of the T-80U and was accordingly called the T-72BU before being named the T-90.The main weapon of the tank is the 2A46M smoothbore main gun. Other weapons are the Kord heavy machine gun on the top of the tank and the PK machine gun next to the barrel. == Features == === Firepower === The main firepower of the t-90 is the 125mm 2A46M smoothbore main gun mounted in the turret. It can launch HE,APDS,APFSDS and HEAT. It can not launch HESH. It can launch slower than sound 9M119 Svir/Relfeks anti tank missiles.Its gun is aimed by a computer called the 1A45T fire control system and is stabilized by the 2E42-4 Zhasmin System.The tank has 44 rounds of ammunition with an autoloader that takes about 8 seconds to reload.The ammunition is stored close to the crew in a downward spiral below the turret and has an effective firing range of 4000 meters. === Protection === The T-90 is well armoured with the armour consisting of a mix of many different materials that are covered by \"bricks\" of explosive reactive armour creating a clam shell appearance.It is shorter and smaller compared to other modern tanks at only 2.2 meters tall.Without ERA the tank has the equivalent of 550 mm of armour against APFSDS and 650-850 mm vs HEAT. With Kontakt-5 the tank's turret has the equivalent of 800-830 mm of armour against APFSDS and 1,150-1,550 mm against HEAT.However there are some weak spots in the armour like the rear hull (40 mm armour without ERA) and the rear turret armour(20 mm armour without ERA), the lower front plate, and the driver's sight. The gunners hatch,commanders tower and sighting devices have relatively thin armour as well.The middle of the tracks are also a weak spot in an area called the redan where the armour is only 30 mm thick.Along with passive protection(armour) the T-90 also has an active protective system called Shtora-1. Shtora-1 counters SALCOS missiles by a using electro-optical jammer which stops the missiles from guiding and can also counter infra red missiles by using a infra-red jammer and launching smoke grenades from the smoke grenade launchers. === Mobility and awareness === On roads the T-90 has a maximum speed of 60 km/h(37 mph) and runs on a diesel engine using either gasoline or kerosene. The tanks crew have infra red vision equipment and sensors to help them remain aware of their surroundings.The gunner and tank commander have different sights with both having a narrow field of view. This narrow field of view helps with long range combat at the cost of situational awareness.The tanks sensors can detect missiles, radiation, and other tanks. The tank can also detect any fires in the tank and put the fire out. == Variants. == T-90A - Russian army version of the T-90 with a welded turret. Sometimes called T-90 “Vladimir”, because of its chief designer, Vladimir Potkin.. T-90K - Commanders version of the T-90. Equipped with additional communication and navigation equipment. T-90AK - Command version of T-90A T-90AM - A new version of the T-90A and features a modernized turret and gun along with an anti aircraft gun connected to a remotely controlled commander’s sight. Never in service and not developed further after 2013. T-90M - It has a type of reactive armour called Relikt;https://www.kyivpost.com/post/41962. Retrieved 2024-11-10 a heavily modernized T-90. New turret, autoloader protection and fabric liners which catch pieces of metal. Has the new remotely controlled commander’s sight and anti aircraft gun. Can be made from existing T-90A’s or made entirely new. T-90S - Export version of T-90. Lacks infra-red \"dazzlers\" in its Shtora-1 system T-90SK - Commander’s version of T-90S. Contains additional communication and navigational equipment. T-90MS - Updated version of the T-90S. Includes a stronger engine and a steering wheel along with 4 cameras around the tank giving it a 360 degree view. Has the new Relikt ERA that covers more of the tank. === Special Variants === BREM-1M - Armoured recovery vehicle. IMR-3M - Combat engineer vehicle. MTU-90 - Bridge layer tank with MLC50 bridge. BMR-3M - Mine clearing vehicle. MTU-2020 - Bridge laying tank. Has an extended chassis and an additional road wheel. == References == Category:Military of Russia Category:Tanks",
 "title": "T-90"
}