{
 "id": "109219",
 "text": "Telephone numbers in the United Kingdom are as follows: ==Prefixes== ===01 and 02 - Geographic Numbers=== Numbers beginning 01 or 02 are normal phone numbers for home and business telephone lines. These numbers are always split into two parts: * The area code comes first, and is linked to a specific part of the country. For example, the 020 area code is for London and the 0121 code is for Birmingham. When calling between two phones that have the same area code, this part is optional. It is sometimes shown inside brackets to make this clear. The area code can be two to five digits long. * The second part, usually separated from the code by a space, is known as the 'local number' or 'subscriber number'. It is normally 6, 7 or 8 digits long but can sometimes be only 4 or 5 digits long. This is always unique within an area code. For example, only one person in Manchester could have the number 9460018. Examples: (020) 7946 0018, (0117) 504 1102, (01632) 402881, (01647) 61321, (015394) 52749, (016977) 3789. ===03 - UK-Wide Numbers=== Numbers beginning with 03 are for businesses, government and other organisations that need a number not linked to any single part of the country. The law says they must always cost the same to call as normal 01 and 02 phone numbers from fixed telephones and from mobiles and be included in all call package bundles. ===05 - Businesses and Internet Phones=== * 055 numbers are used by big businesses that need a lot of numbers for their own private phone networks * 056 numbers are used for internet phone services and let people call an internet phone from a normal telephone. Internet phones can also use other types of numbers * 0500 numbers are free to call from fixed telephones. ===07 - Mobile and Personal Numbers=== These numbers are for mobile phones and similar mobile services: * 070 numbers are 'personal numbers' that people and business use to forward calls as they move around between different phones and can be very expensive to call * 076 numbers are for pagers (except for 07624 which is mobile phones) * All other numbers beginning 07 are for mobile phones. ===08 - Special Rate=== These are numbers that are charged at a different price to normal phone calls. * 0800 and 0808 numbers are free to call from fixed and mobile phones * Numbers starting with 084 are revenue-share numbers and impose a Service Charge of 1 to 5 pence per minute on the caller * Numbers starting with 087 (except for 0870) are revenue-share numbers and impose a Service Charge of 5 to 10 pence per minute on the caller * The Service Charge is related to the first six digits of the telephone number called * Landline providers add an Access Charge of 0 to 10 pence per minute when calling 084 and 087 numbers * Mobile providers add an Access Charge of 20 to 40 pence per minute when calling 08 numbers. The total price paid can be up to 45 pence per minute and 08 numbers are never included within call packages. ===09 - Premium Rate=== These are more expensive revenue-share numbers with a Service Charge of up to £1.50 per minute. These numbers are used to pay for services, for recorded information, for dating and for voting in competitions. The caller also pays an Access Charge to their own phone network and this varies from network to network. ==Specific Numbers== Operator: 100 Police (non-emergency): 101 National Health Service (non-emergency): 111 Current time: 123 (not available from some mobiles) Emergency services: 999 or 112 ==Telephone numbers in Overseas Territories== Telephone numbers in British Overseas Territories do not come under the UK telephone numbering plan. These calls are treated as international calls. Below are the access codes for the overseas territories: ===North American Numbering Plan=== * Anguilla +1-264 * Bermuda +1-441 * British Virgin Islands +1-284 * Cayman Islands +1-345 * Montserrat +1-664 * Turks and Caicos Islands +1-649 ===Others=== * British Indian Ocean Territory +246 * Falkland Islands +500 * Gibraltar +350 * Saint Helena and Tristan da Cunha +290 * Ascension Island +247 * Akrotiri and Dhekelia +357 (Shared with Cyprus) * Pitcairn Islands +64 (Shared with New Zealand) == Other websites == *List of telephone area codes * UK Numbering Policy section of Ofcom's website Category:Telephone numbers",
 "title": "Telephone numbers in the United Kingdom"
}