{
 "id": "1092900",
 "text": "Political colours are the colours to represent political ideologies, movements and/or parties. They are a form of colour and political symbolism. Politicians often wear shirts, ribbons, hats and/or ties in their political party's colour so people know that they represent that party by simply looking at the colour of what they are wearing. ==What each colour means== Although different countries have different colour meanings, there are some general trends. Colour Ideologies Notes Black Anarchism, Black nationalism, Christian democracy, fascism, jihadism The colour black is often used by anarchists. This is because anarchists want little to no government, and black has no colour. The colour is also used by fascists (see blackshirts and Schutzstaffel) and jihadists. Pirate parties round the world also use black. In Germany and Austria, black has often been associated with the main Christian democracy. The Christian Democratic Union of Germany (CDU) is often represented by the colour black (even though their official colour has been turquoise since September 2023). The Austrian People's Party (ÖVP) used to mainly use black, but in 2017 it switched to using turquoise as its main colour. Blue Conservatism, liberalism Centre-right and liberal conservative parties are almost always represented by the colour blue. This is because the Tories in the United Kingdom were blue, and the modern Conservative Party is also blue. Blue is used by conservative parties in most of Europe, Oceania, Southeast Asia and South America, as well as in Canada, Israel, South Africa and many other countries. In Japan and South Korea, blue is often used by more centrist, centre-left or liberal conservative parties. In India, blue is used by the Indian National Congress (INC), the main centre-left party. In the United States, unlike most other countries, blue is used by the centre-left, liberal Democratic Party. Brown Nazism Brown was often used by the Nazi Party in Nazi Germany. This is because the Sturmabteilung (also called the \"brownshirts\") wore brown uniforms. Buff Liberalism Buff was the colour used by the Whigs in the United Kingdom. Grey Independents Grey is often used to represent politicians or political candidates who are not members of any political party (these people are called independents). Green Agrarianism, environmentalism, green politics, Irish nationalism, Irish republicanism, Islamic democracy Dark green is used to represent agrarianism in many European countries, as well as to represent the National Party of Australia. Light green is used by green parties around the world. This is because green is the colour associated with the environment, nature, plants, recycling and sustainability. Green is also used by parties that support Islamic democracy. This is because green is the colour of Islam. Green is also used by Irish nationalist and Irish republican parties. This is because the colour green is the colour of the Republic of Ireland. Green is also used by parties that support allowing people to use marijuana as a recreational drug; many of these parties are also green parties. The African National Congress (ANC) in South Africa uses the colour green, along with black and yellow. The right-wing, conservative Liberal Democratic Party of Japan (LDP) uses the colour green. Orange Centrism, Christian democracy, populism Most Christian democratic parties in Europe use the colour orange. Orange is also used to represent populist parties. For example, the right-wing populist Fidesz party in Hungary uses the colour orange. In Australia, both Pauline Hanson's One Nation (a national conservative, right-wing populist and nationalist party founded led by Pauline Hanson; the party's ideology is called Hansonism) and the Centre Alliance (a centrist and populist party from South Australia) use the colour orange. In Canada, the social democratic New Democratic Party (NDP) uses the colour orange. In India, the conservative Bharatiya Janata Party (BJP) uses the colour orange. In South Africa, orange was the colour used by the National Party during the Apartheid years, so it is often associated with Afrikaner nationalism and the movements of Afrikaners (White South Africans that speak Afrikaans< as their first language). In New Zealand, the Electoral Commission uses the colour orange on official signage and on its website. Because of this, political parties in New Zealand cannot use the colour orange because voters might get mixed up and think that something that is actually material from a political party is official election material from the Electoral Commission. Pink Feminism, social democracy Pink is usually associated with feminism, because pink is the colour that represents women and girls (while blue represents men and boys). In Portugal, the main social democratic party, the Socialist Party, is often represented by the colour purple, however their official colour is red. Pink is also sometimes used to represent LGBT rights. This is because the pink triangle badge had to be worn by homosexual prisoners in Nazi concentration camps. Purple Monarchism Historically, the colour purple was connected to monarchism. These days, however, it is the most well known colour that is not connected to a political ideology. In Australia, the Australian Electoral Commission (AEC) uses the colour purple on its official signs and on its website. Although political parties are not banned from using purple, it is strongly discouraged because voters might get campaign material from a political party mixed up with official election material from the AEC. Red Communism, labourism, social democracy, socialism Red is associated with the left, especially communism and socialism. The red flag is the oldest symbolism of communism and socialism, dating back to the French Revolution in the 18th century. Most centre-left parties (especially labour parties) use the colour red, as it is associated with socialism and trade unions. Unlike most other countries, the main right-wing, conservative party, the Republican Party, uses the colour red. In South Korea, the right-wing, conservative People Power Party also uses the colour red. Teal Conservatism, environmentalism, liberalism In Austria, the Austrian People's Party (ÖVP) uses the colour teal. It used to use black. In Australia, the colour teal has recently become associated with teal independents. These are independent politicians who have economically liberal but environmentally progressive views. The term comes from the fact that teal is a blend of blue (the colour used by the Liberal Party of Australia, the main centre-right, conservative party) and green (the colour of environmentalism and the Australian Greens, a left-wing, progressive green party). Yellow and gold Classical liberalism, libertarianism Yellow usually represents classical liberal or libertarian parties. However, an exception to this rule is Canada, where yellow is a politically neutral colour and is used by Elections Canada. In the United Kingdom, different shades of yellow are used by the Liberal Democrats (a centrist, liberal party), the Scottish National Party (SNP; a Scottish nationalist and progressive party in Scotland) and the Alliance Party of Northern Ireland (a centrist, liberal party in Northern Ireland. In Australia, different shades of yellow are used by the United Australia Party (UAP; a right-wing populist, conservative party), the Libertarian Party (a right- libertarian party, formerly called the Liberal Democrats) and the Jacqui Lambie Network (JLN; a centrist and populist party from Tasmania). ==References== Category:Color Category:Political parties",
 "title": "Political colour"
}