{
 "id": "1092313",
 "text": "The 1999 Tour was a concert tour by English recording artist, Robbie Williams. The tour supported his second studio album, I've Been Expecting You and the compilation album, The Ego Has Landed. In May 1999, the tour played over 40 shows in North America and Europe. == Songs == The songs below was from the concert held on 1 May 1999, at The Opera House in Toronto, Canada. These songs weren't played at all concerts. #\"Let Me Entertain You\" #\"My Name Is\" #\"Man Machine\" #\"Lazy Days\" #\"Hey Jude\" #\"Win Some Lose Some\" #\"Killing Me\" #\"No Regrets\" #\"Strong\" #\"Angels\" #\"Forever Texas\" #\"Karma Killer\" #\"Old Before I Die\" ;Encore # * \"Millennium\" #\"Song 2\" #\"Should I Stay or Should I Go\" ==Tour dates== ;Man, The Myth, The Tax Bill (a.k.a. Born To Be Mild) Date City Country Venue North America 1 May 1999 Toronto Canada The Opera House 4 May 1999 New York City United States Bowery Ballroom 6 May 1999 Philadelphia Theatre of Living Arts 7 May 1999 Boston Paradise Rock Club 8 May 1999 Montreal Canada Le Petit Medley 10 May 1999 Washington, D.C. United States 9:30 Club 12 May 1999 Atlanta Cotton Club 14 May 1999 Chicago Metro Chicago 15 May 1999 Detroit Saint Andrew's Hall 1 June 1999 Vancouver Canada The Rage 2 June 1999 Seattle United States Showbox Comedy and Supper Club 7 June 1999 San Francisco Bimbo's 365 Club 9 June 1999 Los Angeles Mayan Theater ;Festivals Date City Country Venue Europe 21 May 1999 Nürburg Germany Nürburgring 23 May 1999 Nuremberg Frankenstadion 24 May 1999 Landgraaf Netherlands Megaland Landgaaf 18 June 1999 Imola Italy Autodromo Enzo e Dino Ferrari 2 July 1999 Roskilde Denmark Roskilde Festival Grounds 4 July 1999 Werchter Belgium Werchter Festival Grounds 10 July 1999 Paris France Hippodrome de Longchamp 25 August 1999 Watford England Watford Colosseum 28 August 1999 Slane Ireland Slane Castle ;A Few Dollars More... Date City Country Venue Europe 3 September 1999 Stockholm Sweden Cirkus 5 September 1999 Copenhagen Denmark K.B. Hallen 6 September 1999 Hanover Germany Capitol 7 September 1999 Cologne Palladium 9 September 1999 Offenbach Stadthalle Offenbach 10 September 1999 Hamburg CCH Hall 2 12 September 1999 Tilburg Netherlands 013 13 September 1999 Paris France Zénith de Paris 15 September 1999 Berlin Germany Columbiahalle 17 September 1999 Reykjavík Iceland Laugardalshöll ;Get Your Coat Baby, You've Pulled! Date City Country Venue North America 12 October 1999 Boston United States Avalon Ballroom 13 October 1999 Upper Darby Township Tower Theater 15 October 1999 New York City Hammerstein Ballroom 18 October 1999 Toronto Canada The Warehouse 19 October 1999 Kitchener Lyric Theatre 21 October 1999 Pittsburgh United States Palumbo Center 22 October 1999 Washington, D.C. 9:30 Club 24 October 1999 Atlanta The Tabernacle 25 October 1999 Orlando Hard Rock Live 29 October 1999 Houston Aerial Theater 30 October 1999 Dallas Bronco Bowl 1 November 1999 Austin Austin Music Hall ;Festivals and other miscellaneous performances :This concert was a part of the \"Rock am Ring\" :This concert was a part of \"Rock im Park\" :This concert was a part of the \"Pinkpop Festival\" :This concert was a part of the \"Heineken Jammin' Festival\" :This concert was a part of the \"Roskilde Festival\" :This concert was a part of \"Rock Werchter\" :This concert was a part of \"Solidays\" :This concert was a part of the \"Slane Concert\" == Personnel == === Band === * Gary Nuttall * Chris Sharrock * Claire Worrall * Alex Dickson * Fil Eisler ==References== Category:Robbie Williams concert tours",
 "title": "1999 Tour (Robbie Williams)"
}