{
 "id": "1092650",
 "text": "Third Mumbai is a city planned around the Navi Mumbai International Airport. MMRDA has named the Third Mumbai as Karnala-Sai-Chirner New Town, focusing on eco-friendly development and improved connectivity in the region. The acronym unfolds to “Navi Mumbai Airport Influence Notified Area”. NAINA occupies land within a 25-kilometre radius of the airport. Roughly 600 square kilometres. It has been described as a financial centre and, in November 2014, it was described as, potentially, “the biggest smart city in India” == Where is Third Mumbai located == It is a proposed planning area in Raigad district of Maharashtra, an Indian state. City and Industrial Development Corporation of Maharashtra Limited (CIDCO) has been appointed planning authority for the same. It comprises approximate 170 villages in Pen, Panvel, and Uran talukas of Raigad district .The city will consist of small cities that will be hubs for agro-farming, education, trade, information technology, services, medical treatment, etc. == How is Third Mumbai developing == This city is being developed in fulfilment of the conditions under which environmental clearances were given by the Ministry of Environmental & Forest (MoEF), Government of India that development plan for Navi Mumbai be modified to prevent unplanned development in the vicinity of the proposed airport. Government is spending huge amount to create a new city of hope technology & prosperity this will surely change the face of new city where connectivity will be the major factor. == Mega Projects of Indian government. == Navi-Mumbai International Airport Sewri to Nhava-Sheva Sea-link. (MTHL Sea Link) Coastal Road Virar to Alibaug Multi-Modal Corridor. (MMC Corridor) Dedicated Freight Corridor(DFC) Local Train Metro Water taxies == Why has Third Mumbai attracted the attention of investors == Third MUMBAI is a well-planned smart city which will be developed by special planning authority that is MMRDA This will become globally rank city and it helps to speed up the economic growth of the country. As big townships are coming up in Tisari Mumbai, investors are investing heavily. As the area is undeveloped, plots are available near Mumbai and Navi Mumbai at very affordable rates. So top class developers are going to be in Tisari Mumbai. As Navi Mumbai International Airport will bring business from around the world, Industrial, logistics park, IT sectors and mega city is being developed in this Tisari Mumbai. There will be “high-growth” zones, “mixed-use” zones, parks, schools, and all kinds of other things that form the backbone of city life. TO GET ASSURED RETURNS INVEST WHERE THE GOVERMENT IS INVESTING Third Mumbai renamed as KSC New Town, in honour of 3 villages of Raigad == Reference == Category:Cities in Maharashtra",
 "title": "Third Mumbai"
}