{
 "id": "1092701",
 "text": "Sash! are a German DJ/production team that started in 1995. The members are Sascha Lappessen, Ralf Kappmeier and Thomas Ludke ==Musical career== ===1995–1997: Creation and It's My Life – The Album=== In January 1997, SASH! released the song \"Encore une fois\". It reached number 2 in the UK Singles Chart, as well as reaching the top 10 of five countries' singles charts and the top 20 of seven countries' singles charts. In April 1997, they released \"Ecuador\", and \"Stay\", which both also reached No. 2 in the UK Singles Chart. In June 1997, they released their first album, It's My Life – The Album. It was successful around the world. It reached No.6 in the UK Albums Chart. ===1998–1999: Life Goes On=== In 1998, they released the first song from his second album, \"La Primavera\", which reached No. 3 in the UK, \"Mysterious Times which was their fourth UK No.2\", (No. 2), and \"Move Mania\", (No. 8). In August 1998, they released their second album Life Goes On. In 1999, they released \"Colour the World\" which reached No. 15 in the UK. ===2000-2003: Trilenium and S4! SASH!=== In 1999, they! released \"Adelante\". It reached No. 2 in the UK Singles Chart in January 2000. In April 2000 they released their third album Trilenium. In October 2000, they released their first compilation album Encore Une Fois – The Greatest Hits. In 2002, they released the songs \"Ganbareh\" and \"Run\" with Boy George. In November 2002 they released their fourth album, S4!Sash!. In 2003, they realised the song \"I Believe\", ===2007: 10th Anniversary=== In October 2007, they released their second compilation album,10th Anniversary. It has 16 songs, a reloaded version of Ecuador, unreleased songs, and a bonus DVD with videoclips to all the songs from the album. In October 2008, they released their third compilation album, The Best Of. In October 2008, they released the song \"Raindrops\". It reached No. 9 in the UK chart. ===2010-present=== On April 2023, they released the single \"Rock My Body\", with Dutch-Moroccan DJ and producer R3hab and Romanian singer Inna. The single interpolates \"Ecuador\". In August 2012 they released their fifth album, Life Is a Beach. In November 2013 they released their sixth album, Life Changes (Sash! album). ==Discography== Studio albums * It's My Life (1997) * Life Goes On (1998) * Trilenium (2000) * S4!Sash! (2002) * Life Is A Beach (2012) * Life Changes (2013) ==References== ==Other websites== * * Official website Category:1970 births Category:Living people Category:German DJs Category:Dance music groups",
 "title": "Sash!"
}