{
 "id": "1092378",
 "text": "Palm nut soup or banga is a soup made from palm fruit common in Cameroon, Ghana, Nigeria, Democratic Republic of Congo and Ivory Coast. It is made from a palm cream or palm nut base with stewed marinated meats and smoked dried fish. It is often eaten with starch, fufu, omotuo, banku, fonio, or rice. == Cameroon == soup is a palm fruit soup in Cameroon and West Africa. It is often served with kwacoco. The soup is Cameroon's version of the West African banga. In Cameroon is made using fresh palm nuts. Outside the area canned nuts can be used. == Nigeria == is a type of palm fruit soup from the Niger Delta particularly among the itsekiri ethnic group.https://allnigerianfoods.com/banga-soup/ In Nigeria it is used to accompany other dishes such as Starch (Usi) for the itsekiri people of Delta State. The Igbo people have the stew and soup varieties made from palm fruits. Ofe akwu is the stew variety usually taken with rice while the palm fruit extract is used especially in Anambra region for Oha and Onugbu soup accompanied with pounded cassava. The palm fruit is important to the Igbo people. The palm fruit is often harvested from locally grown palm fruit trees, after which it is thoroughly washed, boiled and mashed for the extraction of its oil, the main ingredient in the preparation of the Banga soup. Banga soup is flavored with , aidan fruit, rohojie, Banga spice leaves called Obenetietien (scent or bitter leaves can be substituted), a stick of oburunbebe, finely chopped onion, ground crayfish, chili pepper or scotch bonnet, and salt.How to make Banga Soup : Efik Banga Soup by Nky Lily Lete April 2013 Nigerian Food TV The soup is eaten with starch made with Cassava Starch and palm-oil or rice in the south or south eastern parts of Nigeria . Banga Soup is mostly prepared using fresh catfish dried/smoked fish or meat. It can also have the addition of Okra. Obe Ẹyẹn, also known as banga soup, is a soup eaten by the itsekiri people of Southern Nigeria. It is made by extracting the liquid of palm kernels. Other ingredients like crayfish, meat, fish, pepper and cow tripe are added. It is eaten with eba or usi (starch). (Elaeis guineensis) extract. http://www.sisiyemmie.com/2014/08/banga-soup- recipe-and-starch-niger.html?m=1 == Gallery == Palm nut soup with fish.jpg|Palm nut soup with fish Palm nut soup.jpg|Palm nut soup Akan Ghanaian Palm Nut Soup.jpg|Akan Ghanaian palm nut soup Palm nut soup close up.jpg|Palm nut soup close up Palm nut soup on fire.jpg|Palm nut soup Fufu with palm nut soup, snail and tilapia.JPG|Fufu with palm nut soup, snail and tilapia == References == == Other websites == *Palm nut soup recipe *Palm Nut Soup *Video: How to make Palmnut Soup (GH) Category:Soups Category:Cameroonian food Category:Ghanaian food Category:Nigerian food",
 "title": "Palm nut soup"
}