{
 "id": "1092390",
 "text": "Alexander Giannascoli (born February 3, 1993), better known by his stage names Alex G or, formerly, (Sandy) Alex G, is an American musician and singer- songwriter. He started his career releasing albums himself on Bandcamp and started getting fans with his label debut, DSU (2014), released on Orchid Tapes and a lot of people liked it. He later signed with Lucky Number, who rereleased his earlier releases, Rules and Trick (2012). In 2015, he joined Domino Recording Company and released his sixth studio album, Beach Music. He followed it in 2017 with Rocket, which even more people liked. Giannascoli's eighth studio album, House of Sugar, was released in 2019, and his ninth, God Save the Animals, in 2022. ==Early life and career== Giannascoli was born in 1993 in Havertown, Pennsylvania. His father's family is from Abruzzo, a region in Southern Italy. At age 11, he learned how to play the guitar that his brother gave him and started recording music. While attending Haverford High School, Giannascoli made two albums that he shared with friends. He tested different styles while making collaborative music, which included his brother, singer/songwriter/producer David Allen Scoli, and himself called The Scoli Xtreme, the \"goth techno\" he made with his sister in their band MOTHER, as well as the projects involving his high school band The Skin Cells, described as \"pop rock that accidentally ended up being punk\". The Skin Cells band where most unreleased music from Alex was released (such as \"Tie me down\", \"Nintendo 64\", and more). In 2011, Giannascoli enrolled at Temple University, where he studied English in hopes of becoming a teacher, but eventually left to pursue a musical career. After self-releasing a bunch of albums, EPs, and singles on Bandcamp from 2010 to 2012, Giannascoli's popularity spread through word of mouth, blogs, and testimonials by other musicians. The Fader called Giannascoli \"the internet's secret best songwriter.\" This led to Orchid Tapes signing Giannascoli, as well as the release of his label debut DSU (2014), which critics raved about. Following the release of the album, Giannascoli went on tour in North America and Europe. In November, DSU was released by Lucky Number in Europe on all formats with two new bonus tracks. The label later also reissued his two preceding releases, 2012's Rules and Trick. In 2015, Giannascoli signed with Domino Recording Company and released that label's debut Beach Music on October 9. The following year, Giannascoli worked with Frank Ocean on his albums Endless and Blonde, providing guitar and writing music for several songs. On March 2, 2017, Giannascoli announced that his second album with Domino, titled Rocket, would be released on May 19 and shared the first two singles, \"Bobby\" and \"Witch\". On April 4, Giannascoli announced the change of his stage name from Alex G to (Sandy) Alex G, with no further explanation, and shared another single from the album, \"Proud\". The music publication Spin attributed the name change to a legal conflict with singer and YouTuber Alex Blue, who was operating at the time under the trademarked name \"Alex G\". On choosing the name 'Sandy', Giannascoli said it \"was the first thing [he] put on Bandcamp\" and that he had \"just used that ‘Sandy’ as a sort of [social media] tag\" since then. On May 4, he released two more singles, \"Brick\" and \"Sportstar\", before the release of the album. Rocket received good reviews and appeared on multiple publications' year-end lists of the best albums of 2017. Giannascoli's eighth studio album, House of Sugar, was released on September 13, 2019. The album received positive reviews and placed 17th on Pitchfork's year-end best albums list. In June 2020, he dropped \"(Sandy)\" from his stage name, returning to going by Alex G. Giannascoli scored the film We're All Going to the World's Fair, released on April 8, 2022. Giannascoli also scored Jane Schoenbrun's next film I Saw the TV Glow, which is being released by A24 in 2024. Giannascoli's ninth studio album, God Save the Animals was released on September 23, 2022. In January 2024, Giannascoli announced his signing with RCA Records and an upcoming tour supporting the band Foo Fighters. ==Musical style== Giannascoli's music is often said to be indie rock with a lo-fi aesthetic because he records all of his music by himself in his home. He is compared a lot to singer-songwriter Elliott Smith, who's an idol of his. Other comparisons include Built to Spill and The Martinis. The Philadelphia Inquirer praised him as \"a particularly gifted melody writer\" whose \"fuzzy, sometimes distorted songs, which hark back to slightly askew 1990s bands such as Pavement, can't hide his skill as a pop craftsman and a constructor of elliptical narratives that call for repeated listening.\" He stated that his creative process is usually working alone in his room with his guitar and adding other instruments later. When asked about working in a professional recording studio, he replied \"I feel like I'm eventually going to have to do that, but I just don't want to. Because I don't know how to work all that stuff, and I don't want anyone else to have control. I just want to follow my own ideas, and I'm uncomfortable doing it any other way.\" Despite being formerly hesitant to record his music in professional studios, Giannascoli's God Save the Animals was studio-recorded with help from Jacob Portrait during the COVID-19 pandemic. ==Discography== ===Studio albums=== * Race (2010) * Winner (2011) * Easy (2011) * Rules (2012) * Trick (2012) * DSU (2014) * Beach Music (2015) * Rocket (2017) * House of Sugar (2019) * God Save the Animals (2022) ===Soundtrack albums=== * We're All Going to the World's Fair (Original Motion Picture Soundtrack) (2022) * I Saw the TV Glow (Original Motion Picture Soundtrack) (2024) == References == == Other websites == * * Alex G on YouTube * Alex Giannascoli on YouTube Category:1993 births Category:Living people Category:American singer-songwriters Category:American guitarists",
 "title": "Alex G"
}