{
 "id": "1092757",
 "text": "Lavash is a thin flatbread usually leavened, traditionally baked in a tandoor (tonir or tanoor) or on a sajj, from the South Caucasus, West Asia, and the areas surrounding the Caspian Sea. Lavash is one of the most widespread types of bread in Armenia, Azerbaijan, Iran and Turkey. The traditional recipe can be adapted by using a griddle or wok instead of the tonir. ==History== Gil Marks traces the history of lavash to the early innovation of cooking thin flatbreads on terracotta griddles. The earliest forms of bread were cooked as cakes either on heated rocks or in embers, but when griddles started to be used breads had to be made thinner to fully cook through without burning like the bread rakik described in the Bible. With the innovation of early ovens, thicker loaves became possible. The origin of lavash is often attributed to Armenia, or Iran. Food historian Gil Marks identifies the origin more generally as the Middle East. ==Preparation== Lavash is made with flour, water, yeast, sugar and salt. It can also be made in an unleavened version by omitting sugar and yeast. Toasted sesame seeds and/or poppy seeds are sometimes sprinkled on before baking. Traditionally the dough was rolled out flat and slapped against the hot walls of a clay oven. ==Usage== While quite flexible when fresh, lavash dries out quickly and becomes brittle and hard. The soft form is easier to use when making wrap sandwiches. In Armenian villages, dried lavash is stacked high in layers to be used later, and when the time comes it is sprinkled with water to make it softer again. The dried bread is broken up into (), while fresh lavash is used to wrap the Armenian specialty dish and to make other wraps with herbs and cheese. In Iran, Turkey and some Middle Eastern countries lavash is used with kebabs to make wraps like . In its dry form, leftover lavash is used in Iran to make quick meals after being rehydrated with water, butter, or cheese. In Turkey are used for sweet dishes and served alongside some traditional Turkish dessert dishes like , , ('braised fruit leather'), and . In Kashmiri cuisine, lavas is traditionally used with the morning tea, also known as Noon Chai or Sheer Chai. In modern recipes lavash can be used like pizza dough. ==Traditions and customs== In Armenian weddings, it is traditional for the mother of the groom to feed the newly wed couple lavash and honey as a wish of good fortune, fertility and sweetness for the couple. Dried lavash can be stored for nearly a year and is used instead of leavened bread in Eucharist traditions by the Armenian Apostolic Church. In Sabirabad District of Azerbaijan after a wedding when the bride comes into her new house, her mother-in-law puts lavash on her shoulder and says: \"Let you come to the house of wealth, let your foot be lucky\".Кулиева Н. М. Современная сельская семья и семейный быт в Азербайджане / Под ред. доктора исторических наук Т. Г. Мусаевой. — Б.: «Элм», 2011. — С. 97. In the Novkhani settlement, after a funeral, it is customary for people to prepare kyulchya, which sometimes consists of halva wrapped up in lavash.Кулиева Н. М. Современная сельская семья и семейный быт в Азербайджане / Под ред. доктора исторических наук Т. Г. Мусаевой. — Б.: «Элм», 2011. — С. 122. ==In art== Women baking lavash is a common theme that has inspired Armenian painters. One such portrait by the famous Soviet-era painter Minas Minassian is displayed at the National Museum of Art in Yerevan. A print of the painting Armenian Ladies Baking Lavash by Armenian American artist Manuel Tolegian was selected by U.S. President Gerald Ford to hang in the White House Bicentennial Collection. The weekend open-air arts-and-crafts market in downtown Yerevan offers many lavash-related paintings and handiworks. Pictures of happy women making lavash are a common sight. ==Related pages== * Naan, a leavened flatbread made in a tandoor or on a tava * Tortilla ==References== ==Other websites== * Lavash: Understanding Armenia's bread obsession * On the Lavash Trail in Armenia Category:Flatbreads Category:Armenian food Category:Azerbaijani food Category:Persian food Category:Iraqi food Category:Turkish food Category:Kyrgyz food Category:Kazakh food Category:Jewish food",
 "title": "Lavash"
}