{
 "id": "1092077",
 "text": "A banana fritter is a fritter made by deep frying battered banana or plantain in hot oil. It is common in Southeast Asia and South India. ==Varieties== === Brunei === Banana fritters are a traditional snack in Brunei, where they are called . They are like pisang goreng in Indonesia and Malaysia. , a variant of made with honey, are popular as a light afternoon meal (). ===Cambodia=== In Khmer, banana fritters are made by dipping flattened bananas in a thick mixture of rice flour, sesame seeds, egg whites and coconut milk seasoned with salt and sugar and deep frying them in hot oil until crispy and golden. Cambodian banana fritters are more savoury than sweet. They are often eaten as a snack with coconut ice cream. A famous banana fritter shop in Cambodia is Chek Chean Pises. It opened in 2000 in Phnom Penh – with shops at Mao Tse Tong Boulevard and Kampuchea Krom Boulevard. ===India=== Vazhakkappam or pazham pori is a fritter food with ripened banana or plantain and maida flour. A popular food in Kerala, it is generally eaten as a breakfast or a snack. Pazham pori is made from bananas or plantain. Plantains are peeled and slit lengthwise. They are dipped into a batter made from flour, salt, turmeric powder and sugar. This is deep-fried in oil until golden brown. In the other South Indian states of Karnataka and Tamil Nadu, it is made with besan flour. Pazham pori is served usually along with tea or chai as a snack in the evening. In some restaurants in Kerala pazham pori is served awith beef. === Indonesia === In Indonesia, banana fritters are known as pisang goreng. They are often sold by street vendors, They are deep fried in cooking oil. Sometime they are coated with batter. Plantain is often used instead of banana. Cultivars of banana such as pisang raja, pisang tanduk and pisang kepok are the most popular kinds of banana used for pisang goreng. They have a mild sweet and sour flavor and firm texture that will not crumble when fried. Pisang raja has a softer texture and a fragrant smell. The banana is often battered and then deep fried in palm oil. Pisang goreng might be battered or plain deep fried. The batter is made with flour, either wheat, rice flour, tapioca or bread crumb. Coconut milk or milk and vanilla extract may be in the batter to improve the taste. Most traditional street vendors will then sell them without any additional ingredients or toppings. Some cafes and restaurants serve more sophisticated pisang goreng sprinkled with powdered sugar, cinnamon sugar, cheese, jam, condensed milk, chocolate or vanilla ice cream. Banana fritters and other kinds of fritters are sold on travelling carts or by street vendors throughout Indonesia. Other than pisang goreng, various ingredients are battered and deep fried such as tempeh, mendoan, tofu , oncom, sweet potato, cassava chunk, cassava tapai, tapioca , vegetables and breadfruit. === Malaysia and Singapore === In Malaysia and Singapore, banana fritters are commonly known in the Malay language as pisang goreng. The banana fritters commonly found in these countries are made by deep frying battered plantain in hot oil. They are usually eaten as a snack in the morning and afternoon. They are often sold by street vendors. They are also sold in shops and restaurants as well as Singapore's hawker centres. ===Philippines=== There are many different fried banana dishes in Philippines. They are almost always made from saba bananas, a native plantain that is often used in Filipino food. Pritong saging are fried saba bananas (without batter) usually served with sugar or syrup. Bananas cooked with batter are a different dish known as maruya. They are more commonly made mashed or sliced very thinly and spread into a fan shape. The most common Filipino street food dishes made from banana are banana cue and turon. Banana cue are fried bananas coated with caramelized sugar and served on skewers. Turon is a type of fried dessert lumpia only found in the Philippines and is cooked in a crepe wrapper. ===Thailand=== Kluai khaek, sometimes called kluai thot, is a popular Thai street snack. Kluai khaek is made from fried, floured banana often topped with white sesame. ===Suriname=== In Suriname, this snack is also known as bakabana (meaning fried banana in Surinamese). ===Vietnam=== In Vietnamese, banana fritters are called chuối chiên. They are based on the French dessert banana flambée. After deep frying, Vietnamese banana fritters are drizzled with rum or rice wine and ignited to further crisp them. === Myanmar === A dish of banana fritter cooked in thick, spicy fish sauce and served with rice was said to have been a favourite dish of the former royal family of Myanmar. ==References== Category:Indian food Category:Cambodian food Category:Indonesian food Category:Malaysian food Category:Bruneian food Category:Filipino food Category:Singaporean food Category:Vietnamese food Category:Desserts Category:Burmese food Category:Surinamese food Category:Banana dishes",
 "title": "Banana fritter"
}