{
 "id": "1092927",
 "text": "A Danish pastry (sometimes shortened to Danish, especially in American English) is a laminated sweet pastry. it is made in the Viennese style. It is called Kopenhagener in Austria and Wienerbrød in Denmark. Like croissants, they are made with puff pastry. The laminated yeast-leavened dough gives a layered texture. ==Composition== Danish pastry is made of yeast-leavened dough of wheat flour, milk, eggs, sugar, and a lot of butter or margarine. The dough is rolled out thinly. Then it is covered with thin slices of butter. The dough is folded and rolled several times. It may be chilled to make it ease to handle. The process of rolling, buttering, folding, and chilling is repeated. This makes a multilayered dough that is airy and crisp on the outside. It is also rich and buttery. Butter is the traditional fat used in Danish pastry. In factories less expensive fats are often used, such as hydrogenated sunflower oil. ==History== There was a strike among bakery workers in Denmark in 1850. The bakery owners hired workers from abroad. Some of them were Austrian. They brought new baking traditions and pastry recipes. Danish bakers used the Austrian recipes. They increased the amount of egg and fat. This resulted in what is now known as the Danish pastry. Interview with Bi Skaarup, a Danish food-historian and former president of \"Det Danske Gastronomiske Akademi\" (The Danish Gastronomical Academy). The Danes called the pastry \"wienerbrød\" (Vienna bread) . That name is still in use in Northern Europe today.Sverdrup, Elise (1980). Norway's delight: dishes and specialities. Oslo: Tanum-Norli. . ===Denmark=== Danish pastries in Denmark have different shapes and names. Some are topped with chocolate, pearl sugar, glacé icing, or nuts. They may be stuffed with jam or preserves (usually apple or prune), remonce, marzipan, or custard. Shapes are numerous, including circles with filling in the middle (known in Denmark as Spandauers), figure-eights, spirals (known as snails), and the pretzel-like kringles.Citation from the Saveur article: [There are hundreds of types of Danish pastry, but all—from the chokoladebolle, topped with chocolate, to the spandauer, filled with vanilla custard or marmalade, or the wienerbrødhorn, infused with marzipan and sprinkled with hazelnuts—are made of crisp layers of paper-thin dough, prepared and baked according to strict rules.] ==Varieties== In Sweden, Danish pastry is typically made with vanilla custard. In the UK, various ingredients such as jam, custard, apricots, cherries, raisins, flaked almonds, pecans, or caramelized toffee are placed on the dough, which is then baked. Cardamom is often added to increase the aromatic sense of sweetness. In the US, Danishes are often topped with fruit or sweetened cream cheese before to baking. Danishes with nuts on them are also popular there and in Sweden. Icing, and, sometimes, powdered sugar and chocolate are also added. In Argentina, they are usually filled with dulce de leche or dulce de membrillo. File:Kringle (6868378753).jpg|A slice of a kringle with remonce, a type of Danish pastry common in Denmark File:Danish pastry.JPG|Several types of Danish pastry in a bakery in Denmark File:Pecan and Maple Danish.JPG|A pecan and maple syrup Danish pastry sold in the UK File:Factura membrillo.jpg|Argentine facturas with dulce de membrillo File:Danishjf1942.JPG|Danish pastries in the Philippines ===United States=== Danish pastry was brought to the United States by Danish immigrants. Lauritz C. Klitteng of Læsø made it popular in the US around 1915–1920. He said he made Danish pastry for the wedding of President Woodrow Wilson in December 1915. He was featured in 1920s periodicals like the National Baker, the Bakers' Helper, and the Bakers' Weekly. Klitteng briefly had his own Danish Culinary Studio at 146 Fifth Avenue in New York City. Herman Gertner owned a chain of New York City restaurants. He brought Klitteng to New York to sell Danish pastry. Gertner's obituary appeared in the January 23, 1962 The New York Times: > \"At one point during his career Mr. Gertner befriended a Danish baker who > convinced him that Danish pastry might be well received in New York. Mr. > Gertner began serving the pastry in his restaurant and it immediately was a > success.\" ==Notes== ==References== *Cauvain, Stanley & Young, Linda S. (2007) Technology of Breadmaking. Springer Science & Business Media. *Gisslen, Wayne (2013) Professional Baking. (6th edition) John Wiley & Sons, Hoboken, NJ. ==Other websites== *Danish pastry - base recipe - Danish pastry bar Kvalifood, a non- commercial educational cooking website from Denmark. *BBC Danish pastries *Danish Category:Sweet breads Category:Danish food Category:Austrian food Category:Finnish food Category:Norwegian food Category:Swedish food",
 "title": "Danish pastry"
}