{
 "id": "1093388",
 "text": "Argyrosomus regius, also known as the meagre or croaker, is a species of drum that belongs in the genus Argyrosomus. It is found in the Atlantic Ocean and also the Mediterranean and Black Sea. == Etymology == The specific name regius means \"royal\". == Classification == Argyrosomus regius was described in 1801 as Perca regia by Ignacio Jordán Claudio de Asso y del Río. Later though, the species name was changed and is now a synonym. === Synonyms === * Sciaena aquila Cuvier, 1817 * Perca regia Asso, 1801 * Argyrosomus regium Asso, 1801 * Sciaena regius Asso, 1801 * Cheilodipterus aquila Lacepède, 1803 * Sciaena aquila Lacepède, 1803 * Perca vanloo Risso, 1810 * Argyrosomus procerus De la Pylaie, 1835 * Johnius hololepidotus Lacepède, 1801 == Description == The meagre is a relatively large fish with tiny eyes. It has a body that looks like that of a cod, but with a smaller dorsal fin and a slightly longer body. It can reach up to 2.3 m (7.5 ft) in length and 103 kg (227 lb) in weight. You can easily see the lateral line. == Ecology == === Life history === Breeding takes place from May to July. The juveniles leave the estuary and move to coastal waters where they spend the winter months. They go back to the estuary when it is spring from the middle of May. The females produce about 800,000 eggs. When the water temperature is 17–22 °C (63–72 °F), spawning will happen. === What they eat === The juveniles eat small demersal fish and crustaceans. When they've grown to 30–40 cm, they will start feeding on pelagic fish and cephalopods. == Human uses == === Fisheries === Argyrosomus regius is fished using trawls. The main fisheries are in Mauritania, Morocco, and Egypt. === Aquaculture === The aquaculture of this fish is experimental. There are a few facilities in southern France. == Image gallery == == Related pages == * Sciaenidae * Rhamphoichthys * Pachycormiformes * Rougheye rockfish == References == # \"Argyrosomus regius\". British Marine Life Study Society. Retrieved 26 December 2016. # Pollard, D.A.; Bizsel, K. (2020). \"Argyrosomus regius\". IUCN Red List of Threatened Species. Category:Ray-finned fish Category:Atlantic Ocean Category:Animals of Europe",
 "title": "Argyrosomus regius"
}