{
 "id": "1093251",
 "text": "Marine Bachelot Nguyen (born 1978) is a French-Vietnamese writer and director . She won the 2019 Sony Labou Tansi Prize, and the 2019 Primeurs Prize. In 2004, she co-founded the authors' collective and theatre company Lumière d'août in Rennes. Her work explores the alliance of fiction and document, interrogating politics and feminist and postcolonial issues. == Life[edit] == Marine Bachelot Nguyen studied literature and performing arts in Rennes and Genoa. In 2001, she began teaching in Bressuire and at the Rennes 2 University. She wrote a thesis on the changes in militant theatre in Europe. From 2002 to 2007, she worked for the Théâtre de Folle pensée as a playwright. She participated in several residencies as part of the Authors' Laboratory convened by Roland Fichet, Pièces d'identités in 2003-2004, Mousson d'été in 2005, Mousson d'hiver in 2006 and the biennial Nouvelles pièces d'Europe in Wiesbaden in June 2004. In 2004, she founded the company Lumière d'août in Rennes with Alexis Fichet, Alexandre Koutchevsky, Juliette Pourquery de Boisserin, Laurent Quinton and Nicolas Richard. She created her first play Artemisia Vulgaris in Saint-Brieuc, directed by Alexis Fichet. She directed it in 2007 at the Théâtre de la Paillette in Rennes. She started the project Short Political Pieces, composed of seven texts commissioned from the authors of Lumière d'août and Gianina Carbunariu and staged with Alexis Fichet. In 2009, she embarked on the project Feminists?, a cycle of research, writing and creation dedicated to feminism. Several works were created from this: Histoires de femmes et de lessives in 2009, La Femme, ce continent noir. in 2010, À la racine in 2011 at the Mise en scène festival and Rebel girlz masquerade in 2012,. In 2017, she wrote The Son, which questions the radicalization on the evolution of morals. It was directed by David Gauchard at the Théâtre de l'Union, in Limoges in February, it was presented at the Avignon Festival and received the Sony-Labou-Tansi prize as part of the Festival des Francophonies en Limousin. In 2018, she was a resident at Villa Saigon in Ho Chi Minh City. Her Circulations Capitals project was created in September 2019 at the Canal à Redon and at the MC2 in Grenoble, She read at the Princeton French Theater Festival 2023. == Works == * * * * * == References == Category:1978 births Category:Living people Category:Vietnamese writers Category:French writers Category:French playwrights",
 "title": "Marine Bachelot Nguyen"
}