{
 "id": "1093604",
 "text": "The University of Santiago de Compostela - USC is a public university in the city of Santiago de Compostela, Galicia, Spain. A second campus is located in Lugo, Galicia. It is one of the world's oldest universities in continuous operation. In 1495 a school was opened in Santiago. In 1504, Pope Julius II approved the foundation of a university in Santiago but \"the bull for its creation was not granted by Clement VII until 1526\".Quoted from: Encyclopædia Britannica: A New Survey of Universal Knowledge, 1956. Article \"Universities\". In 1555 it moved away from strictly religious instruction with the help of Cardinal Juan Álvarez de ToledoIt began to develop other academic fields, including science. Today the university covers more than . It has more than 2,000 teachers involved in study and research, over 42,000 students, and more than 1,000 people working in administration and services. The Ministry of Education, recognises it as one of the most prestigious universities in Spain. The university ranks 5th in Spain's best universities ranking by Complutense University of Madrid and 4th amongst public universities. == History == Early in the 16th century the old Pilgrim's Hospital was purchased with the aim of transforming it into a university college. The Santiago Alfeo College, today known as the Fonseca College, was also built. It became the centre of the university life until the second half of the 18th century. At the end of the 16th and beginning of the 17th centuries the San Patricio College, or College of the Irish, was created and the San Xerome College was moved to its current location. The students lived as boarders. They studied Theology, Grammar and Arts Later Law especially ecclesiastical law) and Medicine were added. In 18th century university escaped from the control of the religious orders of the Catholic Church. It came under the control of the Spanish monarchy. Charles III granted the title of \"Regia\" (in English, Royal) to the university. The university seal has the Royal Crown over the coat of arms of Castilla, León and Galicia, as well as the most important founders' emblems. When the Jesuits were expelled from Spain in 1767 Charles III gave their land and buildings in Santiago to the university. The university started schools for Experimental Physics and Chemistry. In the 1980s, two new university campuses in A Coruña and Vigo were established. They later became independent universities. ==References== Category:Santiago de Compostela Category:Colleges and universities in Spain",
 "title": "University of Santiago de Compostela"
}