{
 "id": "1093226",
 "text": "Major League Baseball's drug policy—the Joint Drug Prevention and Treatment Program—was created by agreement between the MLB Players Association and the Office of the Commissioner of Baseball. The goal was to deter and end the use of banned substances, like anabolic steroids and other illegal drugs, and to \"provide for, in keeping with the overall purposes of the Program, an orderly, systematic, and cooperative resolution of any disputes that may arise concerning the existence, interpretation, or application\" of the policy itself. The Joint Drug Prevention and Treatment Program began use in the Spring of 2006. While the Health Policy Advisory Committee (HPAC) can make recommendations to the Office of the Commissioner regarding punishment, it can't discipline players for violations of the drug policy, except to place them in the appropriate treatment programs. Such authority belongs to the Office of the Commissioner. ==Prohibited substances== Under the policy, all players can't use, possess, sell, mediate a sale of, distribute, or allow distribution of any Drug of Abuse, human growth hormone (HGH) and Steroid. Drugs or substances listed under Schedule II of the Controlled Substances Act are considered drugs of abuse by the Program. Players who require prescription medication can still use it with a \"Therapeutic Use Exemption\" granted by MLB. Prohibited Substances can get on the list only by the unanimous vote of HPAC, provided that the addition by the federal government of a substance to Schedule I, II, or III will automatically result in that substance being added to the list. ==Testing for banned substances== ===Steroids=== Testing is administered via scientifically-validated urine test. Each Player shall be tested when they get to Spring Training. All Players will be selected for an additional unannounced urine specimen collection during the season on a randomly selected date. ===Drugs of abuse=== Testing for drugs of abuse isn't random, but on a basis of reasonable cause. If one of the HPAC panel members can prove that a player used, possessed, or sold banned substances in the last 12 months, they call a conference and discuss the evidence with the other members. If a majority vote to test the suspected player is reached then testing will take place no later than two days. Drugs of abuse include natural cannabinoids (e.g., THC, hashish and marijuana), synthetic THC and cannabimimetics (e.g., K2 and Spice), cocaine, LSD, opiates (e.g., oxycodone, heroin, codeine, and morphine), MDMA (ecstasy), GHB and phencyclidine (PCP). ===Testing procedure=== Players and the collector must instruct the player to return in an hour, during which he can only drink 15 oz. of fluid in a sealed container(s) certified by the collector. ====Testing protocols==== Any test done by the Program will be considered \"positive\" if one of three things happens: #If they find a certain amount of substances in the test, shown in the table below. #If the player refuses or fails to take the test without a good reason. #If the player tries to tamper with the test in some way. =====Drugs of abuse===== Drug Initial Test Level (ng/mL) Confirmation Test Level (ng/mL) Cocaine Metabolites 300 150 Opiates/Metabolites 2000 2000 Phencyclicdine (PCP) 25 25 Cannabinoids 50 15 =====Steroids===== A test is considered positive if a sufficient amount of steroids are present, except nandrolone, which is considered positive only if the level exceeds 2 ng/ml. =====Stimulants===== The presence of a Stimulant shall be considered a positive only if the level exceeds 250 ng/ml, unless specified otherwise below: Drug Confirmation Test Level (ng/mL) Amfepramone (Diethylproprion) 500 Amphetaminil 2000 Chlorphentermine 500 Clortermine 500 Ephedrine 10 Methylphenidate 1000 Phenpentermine 1000 Phentermine 500 =====Notification===== HPAC immediately notifies the Player and the Club of the positive drug test result. ===In-Season testing=== On January 10, 2013, MLB and the players union reached an agreement to add random, in-season human growth hormone and to a new test to reveal the use of testosterone. Testing began the 2013 season. ==Clinical and administrative tracks== All players who enter the program are placed on the Clinical track, except when a player tests positive for steroids, does not comply with the initial evaluation, cooperate in his treatment, is convicted or pleads guilty or nolo contendere to the sale or use and prohibited substance, or participates in the sale or distribution of any banned substance. In that event, the player is placed in the Administrative Track. HPAC has the discretion to place a player in the Administrative Track in any other event, but not solely on the basis that the player is in an inpatient treatment program. Transfer to the Administrative track is contingent on a majority vote, and in the case of a tie, a fifth member must cast a vote based on reasonable cause and cannot consider past practice. These votes are tallied and set forth in progressing games ==Salary retention== Players are entitled to salary retention for the first 30 days they are required to be in inpatient treatment or outpatient treatment that forces his absence from the Club, and half salary retention for the next thirty days, over the course of his career. However, players are not entitled to salary retention for any such period after 60 days during the course of his career. ==Player evaluations== Players are required to be seen at least once by HPAC, to determine the proper treatment program. HPAC may decide that additional meetings and medical and/or toxicology examinations are required. ==Confidentiality== The Office of the Commissioner, the Association, HPAC, Club personnel, and all of their members, affiliates, agents, consultants and employees, aren't allowed to publicly disclose information about the Player's test results, Initial Evaluation, diagnosis, Treatment Program (including whether a Player is on either the Clinical or Administrative Track), prognosis or compliance with the Program. ==Discipline== ===Failure to comply with treatment program=== *First failure to comply: 15- to 25-day suspension and/or a fine of up to $10,000 *Second failure to comply: 25- to 50-day suspension and/or a fine of up to $25,000 *Third failure to comply: 50- to 75-day suspension and/or a fine of up to $50,000 *Fourth failure to comply: minimum one-year suspension and/or a fine of up to $100,000 *Any subsequent failure(s) to comply: The level of the discipline will be determined by the Office of the Commissioner, consistent with the concept of progressive discipline. All suspensions are without pay. ===Positive steroid test results=== *First positive test result: 80 game suspension *Second positive test result: 162 game suspension (the entire season, including the postseason) *Third positive test result: lifetime ban from MLB *All suspensions are without pay. In addition, a suspended player can be replaced on the active roster by another player. If a player is on the injured list, the suspension is served while on the injured list. Unless a suspension is reduced on appeal, a suspended player is not eligible to participate in that year's postseason even if his suspension ends before then. *Players who test positive for either their first or second tests are given the option to appeal, in which scientific tests will be conducted to prove validity of test. Within that period of time, they are restricted from participation in all baseball activity. If an appeal is successful, the suspension may be reduced by 40 games for the first offense or 80 games for the second offense. The postseason ban is also lifted. There is no appeal for a third offense. *Players who receive a lifetime ban after a third positive test may apply for reinstatement after one year and be eligible to be reinstated after two years. Jenrry Mejía became the only player to be permanently banned under the drug policy on February 12, 2016. ===Conviction for use of prohibited substances=== *First offense: 15- to 30-day suspension and/or a fine of up to $10,000 *Second offense: 30- to 90-day suspension and/or a fine of up to $50,000 *Third offense: minimum one-year suspension and/or a fine of up to $100,000 *Fourth offense: minimum two-year suspension *Any subsequent offense(s): The level of the discipline will be determined by the Office of the Commissioner, consistent with the concept of progressive discipline. All suspensions are without pay. ==Related pages== * List of Major League Baseball players suspended for performance-enhancing drugs ==References== ==Other websites== *Major League Baseball's Joint Drug Prevention and Treatment Program Category:Major League Baseball",
 "title": "Major League Baseball drug policy"
}