{
 "id": "1093029",
 "text": "Star Wars Battlefront II is both a third-person and first-person shooter video game. It was published by Electronic Arts and was developed by DICE. The game was released on November 17, 2017 for the PlayStation 4, Windows, Xbox One. It is a sequel to the 2015 reboot game Star Wars Battlefront which was released on November 17, 2015. In the game's campaign, players play as Iden Versio, a commander of the Inferno Squad. The events of the campaign take place mainly during the Galactic Civil War and is between the timeline of Return of the Jedi and The Force Awakens. In the game, players can battle enemies or other players on different planets. ==Reception== The game was given mixed reviews from game critics. Critics said that they liked the multiplayer, graphics, different choices and balancing. They said that they felt like the single player campaign was good at first but got worse as it went on. One thing that was heavily disliked was the inclusion of microtransactions and loot boxes. The Community Team for EA would try to defend the decision on Reddit, saying that players would feel \"a sense of pride and accomplishment\" when they finally grind enough to be able to unlock characters. Their comment got 667,821 downvotes, which made it the most downvoted comment in Reddit's history and received a Guinness World Record in the process. EA would lower the cost to unlock heroes afterwards. Even though the controversy surrounded it, Battlefront II still sold well. It sold over 14 million copies since December 2017 but still missed EA's sales target of 10 million. The game was won Best Online Multiplayer at the 2017 Game Critics Awards. It was also nominated for Best Action Game and Best Multiplayer Game at Gamescom, as well as, Most Wanted Game at the 2017 Golden Joystick Awards. ==References== ==Other websites== * Category:2015 video games Category:Star Wars: Battlefront Category:Electronic Arts video games Category:First-person shooters Category:PlayStation 4 games Category:Science fiction video games Category:Third-person shooters Category:Video games developed in Sweden Category:Windows games Category:Xbox One games",
 "title": "Star Wars Battlefront II (2017 video game)"
}