{
 "id": "1093241",
 "text": "Ardah (Arabic: العرضة) is a traditional dance in Saudi Arabia. It is also known as the national dance of Saudi Arabia. In this dance, men form two lines facing each other. They may carry swords or canes and dance to drums and poetry while holding the Saudi flag. The dance is also performed in other countries in the Gulf Cooperation Council. Originally, the \"ardah\" was performed only by males of tribes of the Arabian Peninsula before going to war, but now it is done at celebrations, weddings, and national and cultural events, such as the Jenadriyah festival. Now, there are different types of ardah across the Arabian Peninsula. ==Name of the dance== The word \"Ardah\" comes from an Arabic word which means \"to show\" or \"to parade.\" It was used to boost the morale or self-esteem of fighters before battles. UNESCO says this dance is part of UNESCO's Intangible Cultural Heritage of Humanity. They said this in 2015 and called the dance Alardah Alnajdiyah at the time. ==History== Ardah became important when Saudi Arabia was formed under King Abdulaziz Al Saud. It was a dance used before the start of battles, especially in Najd. After winning battles, it was called \"the Najdi Ardah.\" Ardah was important during the formation of Saudi Arabia, showing unity and strength (power). It's now an official parade, even involving the King of Saudi Arabia. Performed before fights, Ardah got fighters ready for battle. Now, Saudis think of it as a reminder of war times. In December 2015, UNESCO said Saudi Ardah was a valuable part of the country's culture. ==Variations== Najdi Ardah is the most common type of Ardah in Saudi Arabia. It's also the most popular male folk dance in the country, often seen on Television. In the 21st century, the government renamed it to 'Saudi Ardah.' But, there are different kinds of Ardah in other regions of Saudi Arabia, like Najran, Asir, and Jizan, etc. ==How to perform== Before the dance starts, a poet calls out to start the dance. His poetic call is known as Muharrabah and it is called out along with rhythmic beats. Ardah starts with a leader's loud call, surrounded by drummers. This call is like saying they are ready for war. As a reaction to this, everyone quickly gathers with swords and chanting. Then they line up, holding hands and ready to dance. ==Related pages== *Yowlah ==References== ==Other websites== *Qatari traditional Ardah Category:Folk dance Category:Saudi Arabian culture",
 "title": "Ardah"
}