{
 "id": "1093958",
 "text": "Pilar Vélez Vicente (Barcelona, February 2, 1957), is an art historian and cultural manager. From 2012 until his retirement in 2022, he was the director of the Design Museum of Barcelona, the product of the integration of the collections of the Decorative Arts Museum, the Ceramics Museum, the Museum Textile and Clothing and the city's Graphic Arts Office. Pilar Vélez replaced Marta Montmany in the position, who retired during the spring of 2012. == Biography == In 1986 she obtained a doctorate in history of art from the University of Barcelona. From 1986 to 1994, she was director of the Museum of Graphic Arts . Pilar Vélez Vicente al web de la RACBA From 1995 until 2012, Pilar Vélez was director of the Frederic Marès Museum, a period during which the Museum reaffirmed itself as a reference center for sculpture and collecting . In 2011, the renovation and modernization project started in 1996 ended, which has given the museum an image and exhibition conditions in accordance with both current museographic requirements and the needs of heritage. Likewise, Pilar Vélez has been the driving force behind a line of research and publications from her holdings, as well as new readings of her collections through a contemporary perspective. The ACCA has awarded one of its 2012 Awards to the Frederic Marès Museum renovation project. Since 1996 she has been a member of the Royal Catalan Academy of Fine Arts of Sant Jordi and since 2007 of the Barcelona Academy of Fine Arts . Academic librarian from 1998 to 2014. Director of the Bulletin from 2004 to 2012. == Works == * Eudald Pradell i la tipografia espanyola del segle XVIII (1989) * El llibre com a obra d'art a la Catalunya vuitcentista. 1850-1910 (1989) * Xilografies de Josep Obiols (1990) * Aproximació a l'obra gràfica de Subirachs (1993) * Centenari Josep Obiols (1984-1994) (1994) * J. Fín (1916-1969) (1999) * Joies Masriera. 200 anys d'història (1999) * Catàleg del Museu de Llotja. Reial Acadèmia Catalana de Belles Arts de Sant Jordi. II- Escultura i medalles (2001) * Lluís Masriera (2002) * L'exaltació del llibre al Vuitcents. Art, indústria i consum a Barcelona (ed) (2008). == References == == Other websites == * Category:1957 births Category:Living people Category:People from Catalonia Category:Art historians",
 "title": "Pilar Vélez Vicente"
}