{
 "id": "109373",
 "text": "Derren Victor Brown (born 27 February 1971) is an English magician, psychological illusionist, \"mentalist\", and painter.\"Mentalist\": mentalism is a performing art in which the performer appears to have highly developed mental or intuitive abilities. He was born in Croydon, south London. Brown studied law and German at the University of Bristol. In 1996, he started doing stage shows. He is especially known for \"close-up magic\", where the subject is, for example, sitting at a table opposite the performer. Trick of the Mind, Trick or Treat and The System are some of his television programmes shown on Channel 4. Brown is openly gay. He was an Evangelical Christian in his teens, and became an atheist in his twenties. This is discussed by Brown in the \"Messiah\" special, and in his book Tricks of the Mind.Derren Brown 2006. Tricks of the Mind. Transworld Publishers. An interview as part of Richard Dawkins' two-part documentary series The Enemies of Reason, where Brown explained various psychological techniques used by purported psychics and spiritual mediums to manipulate their audiences, Brown also said he sought to strengthen his belief and provide answers to common criticisms of religion by reading the Bible and other Christian religious texts. He found none of the answers he sought and came to the conclusion that his belief (in Christianity) had no basis.'The Enemies of Reason', Channel 4 * == Sample episodes from TV series == *The subject is taught ancient techniques on how to get free from complicated, risky situations. Subsequently, the subject – with hands and feet tied – is put in a sack and thrown into a lake. The subject gets free. During the course of the show, Brown claims that the subject will be completely alone under the water, bar a stationary camera. *The subject is put into a trance in a photo booth in London, and – over the next 13 hours – is transported to Marrakesh, Morocco. He wakes up in a photo booth in the back of a cafe near the main square. *The subject is put through a round of speed dating, where his shyness and lack of confidence clearly hold him back. Brown then puts the subject through a series of exercises and visualizations to build his confidence. The subject is then put through another round of speed dating, where many more women placed him on their \"would like to meet again\" list, and he even begins dating one of the interested women. Over a month after the subject thinks all the filming has been done, Brown tests the subject in a robbery. The psychological element in Brown's scenarios seems clear. ==References== ==Other websites== * * How he does it: Derren Brown's secrets revealed. Category:1971 births Category:Living people Category:Artists from London Category:English atheists Category:English entertainers Category:English LGBT writers Category:English painters Category:Gay men Category:LGBT artists Category:LGBT broadcasters Category:British magicians Category:British psychologists Category:Television personalities from London Category:Writers from London Category:Alumni of the University of Bristol Category:People from Croydon",
 "title": "Derren Brown"
}