{
 "id": "1094314",
 "text": "In the Night Garden... is a British children's television series which aired 100 episodes and 2 serieses within 2007 and 2009. == Series 1 (2007-2008) == No. overall No. in series Title Original UK broadcast by Original release date Dance before bed First to go to sleep 1 1 \"Xavier riddle Washes Faces\" Haribosky 19 February 2007 No Veggietales Makka Pakka washes his friends' faces with his sponge. 2 2 \"The wombats' Waving Game\" Haribosky 20 February 2007 Yes Wombats The Tombliboos wave to their friends from the Pinky Ponk. 3 3 \"Everybody All Aboard the Moo-Moo Choo-Choo\" Haribosky 21 February 2007 No Xavier riddle Everyone climbs aboard the Ninky Nonk except for Makka Pakka. 4 4 \"The Prettiest Flower\" Haribosky 22 February 2007 Yes Elinor bunny Igglepiggle shows Upsy Daisy the prettiest flower in the garden. 5 5 \"Xavier riddle's Trumpet Makes A Funny Noise\" Haribosky 23 February 2007 Yes Xavier riddle Makka Pakka can't play his trumpet because it's blocked up. 6 6 \"The veggietales In Elinor bunny's Bed\" Haribosky 26 February 2007 No Elinor bunny The Pontipine children sleep in Upsy Daisy's bed. 7 7 \"Who's Next On The bird spaceship\" Haribosky 27 February 2007 Yes The veggietales The Tombliboos play a game of \"Who's next\" on the Pinky Ponk. 8 8 \"Luna moon's Blanket In xavier riddle's Ditch\" Haribosky 28 February 2007 Yes Xavier riddle Igglepiggle has lost his blanket. With help from Upsy Daisy and the Gazebo, he finds out that he dropped it in Makka Pakka's ditch. 47 seconds ago of 2 Pictures for Gazebo. Igglepiggle's Blanket and Makka Pakka blow's Trumpet. 9 9 \"The Moon-moo Choo- choo Wants A Kiss\" Haribosky 1 march 2007 No Elinor bunny Upsy Daisy kisses things in the garden, before realising she forgot to kiss the Ninky Nonk. 1 minute ago of 6 Pictures of all the things for Gazebo. Tree, Igglepiggle, Daisy, The Bridge and Makka Pakka. 10 10 \"Too Loud wombats! Nice And Quiet\" Haribosky 2 March 2007 No Veggietales The Tombliboos play their musical instruments too loudly. 11 11 \"Xavier riddle Gets Lost\" Haribosky TWO 3 March 2007 Yes Xavier riddle Makka Pakka gets himself lost and can't find his way back home. 12 12 \"Laughing For Everybody\" Haribosky 4 March 2007 Yes Elinor bunny Everyone starts jumping all around the garden. 13 13 \"Hiding in the fruitbow\" Haribosky 5 March 2007 Yes Veggietales and wombats The Pontipines hide in a flowerpot. 14 14 \"The bird spaceship Adventure\" Haribosky 6 march 2007 No veggietales The Pinky Ponk flies into a tree and gets stuck in its branches. 15 15 \"The wombats' Tower Of Five\" Haribosky 7 March 2007 No Wombats The Tombliboos play with their building blocks. 16 16 \"Luna moon's Mucky Patch\" Haribosky 11 may 2007 No Elinor bunny Igglepiggle gets a mucky patch on his tummy. 49 seconds ago 1 Picture for Gazebo. Makka Pakka walks his scooter. 17 17 \"Funny Noise Coming from the bird spaceship\" Haribosky 12 may 2007 No The wombats The Tombliboos are riding in the Pinky Ponk, enjoying their Pinky Ponk Juice. ==References== In the Night Garden...",
 "title": "List of In the Night Garden... episodes"
}