{
 "id": "1094702",
 "text": "The pharmaceutical industry produces medicines. Companies discover, develop, produce, and market drugs for use as medications. They aim to cure and prevent diseases, or to control symptoms. Some are given to patients by healthcare workers. Some may be managed by patients themselves. Some drugs need a prescription to be bought. Drugs that do not require a prescription are called \"over the counter\" medications. Pharmaceutical companies may deal in generic or brand medications and medical devices. They are subject to many laws and regulations that govern the patenting, testing, safety, efficacy using drug testing and marketing of drugs. Across the world treatments worth $1,228.45 billion were produced in 2020. There was a compound annual growth rate of 1.8% in the industry.. Producing medicines starts with making active pharmaceutical ingredients. They are then turned into doses ready for patients. Inactive ingredients such as preservatives are added, usually in a different factory. Then they are sent to distribution centres. Most of the manufacturing is done in Indian and Chinese factories. Factories may be inspected by the FDA, or similar organisations to check for quality. In the 2020s there were repeated shortages of many generic medicines . These are off-patent. They are much cheaper than the new medicines which are covered by a patent, which lasts for up to 20 years. 91% of drugs prescribed in the US and 70% in Europe in 2023 were generics. Profit on these drugs is very low. There are not many different suppliers for many drugs. The supply chains are not very strong. When there are shortages less developed countries may get none. There are sometimes other medicines which can be substituted if there are supply problems. It may take a long time for a new supplier to start up. Sometimes patients come to harm because the medicine they need is not available. ==References== Category:Healthcare companies Category:Pharmacology",
 "title": "Pharmaceutical industry"
}