{
 "id": "1094607",
 "text": "Paranoid personality disorder (PPD) is a personality disorder. People with PPD are paranoid and suspicious of others and do not trust other people because they believe others want to hurt them. They may also be more sensitive and can be insulted easily. They often believe that people who they are close with are not loyal and may hurt them, even if there is no proof. About 3.2% of people have PPD. Because people with the disorder have issues trusting people, they may not seek help because they do not trust doctors. This makes treatment difficult. Cognitive behavioral therapy can sometimes help people with PPD. == Causes == The cause of PPD is not fully known. If someone went through physical or emotional abuse as a kid, they may have a higher chance of having PPD as an adult. This can make people have the belief that others are unfriendly and cannot be trusted. They are usually not self-aware. If someone's family member has a disorder like schizophrenia or delusional disorder, they may have a higher chance of having PPD. A twin study in Norway in 2006 found that PPD can be inherited. == Symptoms == People with PPD usually believe that others want to hurt or deceive them. They do not believe others are loyal and believe they cannot trust people. They believe this even if there is no proof. They may not forgive other people and can hold grudges for a long time. As a result, they usually have issues with relationships. They may be hostile, not able to work with others, and usually have a small social life because they cannot trust others. They may believe their spouse is cheating on them even if there is no proof, be very sensitive if they think people are criticizing them, and have issues telling personal secrets to people because they think people may use their secrets against them. They think that if someone does something good or nice for them, then it is because they are being manipulative. == Diagnosis == === ICD-10 and 11 === The ICD-10 (International Classification of Diseases Version 10) is published by the World Health Organization. It is used to diagnosed conditions worldwide, usually outside of the United States. The ICD-11 was published in 2022, and it merged every personality disorder into one condition (simply called personality disorder). However, the ICD-10 is still used in many countries. These countries still diagnose the different personality disorders. To be diagnosed with PPD with the ICD-10, someone must have three of these symptoms: # Very sensitive to rejection or setbacks # Tendency to hold grudges constantly and cannot forgive insults # Tendency to be very suspiciousness believes people who are friendly to them secretly have bad or hurtful reasons # Tendency to believe they are better and always rights and is not connected with what is true # Believes their spouse is cheating on them even if there is no proof # Tendency to increase their own personal image and impact # Is focused with explanations of why they believe others cannot be trusted === DSM-5 === The DSM-5 (Diagnostic and Statistical Manual of Mental Disorders, Fifth Edition) is published by the American Psychiatric Association. It is used to diagnose mental disorders in the United States. The DSM-5 has seven criteria in a PPD diagnosis. For someone to be diagnosed with it, they must have at least four of these symptoms. These symptoms also have to have started by the time the person is an early adult and needs to have lasted for over a year. People are usually diagnosed with personality disorders after they are 18. To be diagnosed with PPD, someone must have four of these symptoms: # Believes people are hurting them even if there is no proof # Is focused with about if their friends or people they are known can be trusted # Is reluctant to tell people their problems to get help because they believe people will use this against them # Believes people who are friendly to them secretly have bad or hurtful reasons # Holds many grudges and does not forgive people # Believes people are hurting their image and looks at other's actions and words for proof, even if there is none # Believes their spouse is cheating on them even if there is no proof == Treatment == There is no known treatment that is proven to help people with PPD. People with PPD usually have problems trusting doctors, so they may not get help such as therapy or medications. Some doctors may pretend that a patient's paranoid beliefs are true so they can have a good relationship. Sometimes, cognitive behavioral therapy (CBT), a type of therapy that helps people with bad behaviors, can help people with PPD. However, there is no large amounts of data to support this. Sometimes, medications like antipsychotics can help. == Prevalence == Around 3.2% of people have PPD, but this number can be as high as 4.4%. Some studies say men are more likely to have PPD, while others say women are more likely to have PPD. == References == Category:Personality disorders",
 "title": "Paranoid personality disorder"
}