{
 "id": "1094451",
 "text": "The Tridemism, or Three Principles of the People, also known as the San-min Doctrine, is a Left-wing political philosophy made by Sun Yat-sen to make a free, strong and rich country. Sun Yat-sen's idea was that the people should start a nationalist revolution and replace a bad or weak government with a people's republic led by the people's party. In this new government, capitalism would change into a mixed socialism. The goal was to make society and the economy more equal but without using violence to end class struggle, which is different from Marxism. == Origins == In 1894, when Sun Yat-sen started the Revive China Society, he only had two principles: nationalism and democracy. (For the tridemism form of Democracy, see the section \"The Principles\") He got the third principle, socialism, during his trip to Europe from 1896 to 1898. In spring 1905, during another trip to Europe, he announced all three principles. Sun gave his first speech about the Three Principles of the People in Brussels. Sun also expanded the Revive China Society in European cities. At that time, there were about 30 members in Brussels, 20 in Berlin, and 10 in Paris. After the Tongmenghui was created, Sun wrote an editorial in the newspaper Min Bao (民報). This was the first time his ideas were written down. Later, in a special Min Bao issue, his long speech on the Three Principles was printed, and the newspaper discussed people's welfare. Sun's ideas were influenced by his experiences in the United States. They include ideas from the american progressive movement and from Abraham Lincoln. Sun said he was inspired by Lincoln’s Gettysburg Address, which said: \"government of the people, by the people, for the people.\" The Three Principles of the People are connected and were used as a guide for China's modernization, as explained by Hu Hanmin. === In China (1911) === China was the first country to start the nationalist revolution and the process to become a People's Republic led by the Kuomintang or Guomindang, the Nationalist Party of China. The Kuomintang was Sun Yat-sen's People's Party, made up of the Chinese people in general. At that time, China was governed as an Empire under the Qing dynasty, which was made up of Manchu people. Ordinary Chinese, the Han, were not part of the government. Sun's main goal was to end the Qing government and replace it with a Chinese-ruled republic with freedom and justice for all. He also wanted to limit the power of foreign powers in China, which had become great under the Qing, including foreign quarters in Chinese cities, and foreign (European) armies being stationed there. The three principles were Sun's idea of how to end Manchu rule and create a modern, independent and free China. In 1911, a revolutionary uprising led by Sun Yat-sen's followers in Wuhan overthrew the Chinese monarchy and created a republic. On January 1, 1912, Sun declared the \"Republic of China\", created a \"National Assembly\", made a new flag for China, and wrote a temporary constitution for the new Chinese republic. Because of Yuan Shikai's coup in Beijing in 1913, and the Second and Third revolutions started by the Nationalists in 1914 and 1917, Sun did not apply the Tridemist ideas and systems in the new China: However, Sun died in 1925, years before the Nationalists restored the Republic of China in Nanjing. Chiang Kai-shek, Wang Jingwei, and Mao Zedong tried to continue and apply Sun's ideas in China, but with differences, which led to the \"Revisionism\" in Tridemism. == The Principles == The three principles are often summarized as nationalism, democracy and the subsistence. It is important to note that \"Nationalism\", \"Democracy\", and \"Subsistence\" have different meanings in the East than in the West. The main goal of the tridemism is to achieve the status of \"People's Welfare\". This means that all people would have their basic needs provided. === Nationalism === Nationalism is the idea of anti-imperialism and the political and economic independence of a country. === Democracy === Guided Democracy, or just Democracy, is a form of government, similar to modern China, where there is a \"Five Power Constitution\" and the \"People's Party\". The People's Party is formed by the people and controls the government with the help of smaller parties. The People's Party is led and shaped by the interests of all the people. === Subsistence === Subsistence is the economy of the country after the nationalist revolution. It includes \"Land Reform\" and the \"Equalization of Land Rights\". The main goal of subsistence is to achieve social and economic equality, without needing violence in the class struggle or one class dominating another. This is because that would not be equality. == Legacy == The influence of the three principles of the people stay in the government of the Republic of China, which currently administers Taiwan. This philosophy influenced also the modern Communist Party of China and the Chinese Socialism. Sun is praised in both states as a great statesman and philosopher. The influence of the tridemism also are in Vietnam, Singapore's Government, Tibet, Korea, Socialist moviment of Malaysia, and another parties around the world, including some in the West. == References == == Reading == * Bergère, Marie-Claire. Sun Yat-sen. Stanford University Press, 1998. ISBN 978-0804727446. * Lin, T. C. Sun Yat-sen's Doctrine and the Political Development of China. Far Eastern Quarterly, 1946. * Schiffrin, Harold Z. China in Revolution: The First Phase, 1900-1913. University of California Press, 1969. ISBN 978-0520014195. * Schwartz, Benjamin I. Sun Yat-sen and the Origins of the Chinese Revolution. Harvard University Press, 1968. ISBN 978-0674854334. * Sun, Yat-sen. The Three Principles of the People. Translated by Frank W. Price. 1927. (Online version). Category:Political philosophy Category:History of China",
 "title": "Three Principles of the People"
}