{
 "id": "1094490",
 "text": "Blood on the Clocktower is a social deduction game. It was made by Steven Medway and the Pandemonium Institute. The game was released in 2022. It had been in development for some time and there was a Kickstarter campaign before this. Blood on the Clocktower is like Mafia or Werewolf. The game has two teams of players: an evil team and a good team. The evil team knows each other. They have a \"demon\" and \"minions\". The good team don't know each other. Each player is secretly given either a good or evil role. They must help their team achieve its win condition. They are also given a unique character, which has a different role for every player. The game has days and nights. Each day, players can vote to remove one player (known as an \"execution\") and each night, the demon may choose to remove another player. For the good team to win, they must execute the demon. For the evil team, they must either remove all good players, or keep the demon alive until there is only two players remaining. Unlike other similar games, people who are removed from the game still take part. , there are three \"scripts\" with different characters. However, new scripts can be made using a combination of these characters. ==Content== === Setup === One person is made the \"storyteller\", who runs the game. Before the game begins, the Storyteller selects characters who may appear in the game. This is usually between 20 and 25 characters. All players know who these characters are. Then, they and select which character roles will be used for the game. There are four types of characters. Demons, who are evil. Minions, who are also evil. Townsfolk, who are good and outsiders who are good. Depending on the number of players, there is different amounts of each type of character. All characters have abilities. Minions must use these abilities to protect the demon. Good players must seek out the demon. Outsiders have powers that may hinder the good team. If a player is uncertain whether they can stay the entire game, or they enter late, they can play as \"travellers\". Travellers are known to have a certain role. Players do not know if they are good or evil. === Game phases === The game has two parts: the night and the day. During the night, players close their eyes and either gather information or perform actions based on their role. In the day phase, players talk openly or in private. At the end of the day phase, a series of votes take place. In the vote, every player can nominate another player. Any player who is nominated and has the most votes (over the majority) will be \"executed\". During the night phase, the \"demon\" character may choose to \"kill\" one of the players. Players can become \"drunk\" or \"poisoned\" as they play. If you are, they you may recieve wrong information or actions may not work. During the day phase, players wake and can choose to either speak privately with each other or publicly in the \"town square\". Good players use social deduction and the group's collective information to find out who the evil players are. Evil players can exchange information to bluff as a good player. They can also as spread bad information to the good players. Dead players are never eliminated and can participate freely in discussions. After an amount of time decided by the Storyteller, all players meet in the Town Square and have the opportunity to nominate players for execution. Execution occurs on a majority vote. \"Dead\" players each have one vote they can use for the rest of the game. In most cases, the game ends when the demon is executed or there are only two living players remaining. There are three official scripts. They have their own roles and mechanics. They are \"Trouble Brewing\", \"Sects & Violets\", and \"Bad Moon Rising\". == Reception == Funding for Blood on the Clocktower began in 2018 with a Kickstarter campaign. It made more than $570,000, though it had already been in playtesting for years. During its creation, the game was exhibited at various conventions and expos, including PAX and the UK Games Expo. More funds were raised for Blood on the Clocktower conventions after its release. It was adapted into a comedy show at the Old Red Lion Theatre in London, England in 2022. During the Kickstarter campaign, Shut Up & Sit Down released a video review, where Quintin Smith called it his “favorite game”. A review for Wargamer said Blood on the Clocktower was the \"all-round best social deduction game,\" stating that it \"nails everything a great social deduction game needs, and it fixes many of the major problems the genre has.\" Vanessa McGinnis and Charlie Hall of Polygon listed it as one of \"The best board games we played in 2023,\" with NPR McGinnis writing that \"if the Storyteller plays their cards right, their players will be left with a new, exciting story to share each game. Those stories are what makes Clocktower so special\". In a brief review for The Guardian, Alex Hern described Blood on the Clocktower as \"the Ulysses of the board games world\", concluding that \"neither small nor cheap, it’s not an ideal introduction to board games, but it’s the one that will stick with you for the longest.\" The game won \"Best Party Game\" in Tabletop Gaming's 2022 awards. Christopher Eggett, editor of Tabletop Gaming, praised it for its enjoyable gameplay and \"longevity\" due to the many roles and setups. == References == == Other websites == * * Blood on the Clocktower app Category:Board games",
 "title": "Blood on the Clocktower"
}