{
 "id": "1094251",
 "text": "Kyle Lamar Myers (born May 9, 1986), better known by his online alias FPSRussia, is an American internet personality, podcaster, and former YouTuber. He is a co-host of the Painkiller Already (PKA) podcast. Myers first started his career posting video of himself playing Call of Duty games. Myers created a character he would play called Dimitri Potapov and described him as a \"professional Russian\" from Moscow. He also spoke with a heavy Russian accent. Myers said he created the character after a co-worker at the car dealership he was working at spoke in a Russian accent. He began to upload videos of himself firing weapons to show how they differ from weapons in video games like Call of Duty. After seeing his firearm videos start to get more views, he decided to switch his content from game plays to gun demonstrations. In 2010, he created the Painkiller Already (PKA) podcast alongside WoodysGamertag and WingsOfRedemption. Wings has since been fired and replaced with MurkaDurkah. During his time running the YouTube channel, Myers met a man named Keith Ratliff. Ratliff befriended Myers and became the main weapon supplier for him. On January 3, 2013, Ratliff was murdered at his house in Carnesville, Georgia. His murder is still unsolved. After his death, Myers took some time away from the channel. On March 29, 2013, the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) and Georgia Bureau of Investigation (GBI) raided Myer's farm where he shoots his videos but found nothing. In August 2017, his house was raided again by ATF and GBI agents. They said he had hash oil shipped through the mail. He was arrested for felony possession of a controlled substance with intent to distribute and they took 50 of the guns in his house. On June 19, 2019, a judge sentenced Myers to 56 days in prison and two years probation. Myers has ended the YouTube channel in 2016. ==References== ==Other websites== *FPSRussia on YouTube Category:1986 births Category:Living people Category:American people convicted of drug offenses Category:American YouTubers Category:People from Georgia (U.S. state) Category:Podcasters",
 "title": "FPSRussia"
}