{
 "id": "1094853",
 "text": "The Vairankode Vela or Vairankode theeyattulsavam,(Malayalam: വൈരങ്കോട് വേല) is one of the most popular annual festival of Kerala celebrated at the Vairankode Bhagavathy Temple Near Thirunavaya in the Malappuram district.Vairankode Bhagavathy Temple is one of oldest Bhadrakaali temples in North Kerala. Vairankode, in Malappuram district, was a brahmadeya village under the rule of the Azhvanchery Thamprakkal. The Vairankode Bhagavathy Temple was constructed by the Azhvanchery Thamprakkal about 1500 years ago, and the deity worshipped here is believed to be the sister of the Kodungallur Bhagavathy. It is believed that when the devotees of the temple, Azhvanchery Thamprakkal, come to the temple, the Goddess gets up and bows down, so Azhvanchery Thamprakkal do not enter the Vairankode temple. The responsibility for temple affairs lies with the Koima (കോയ്മ principalities) appointed by the Tambras. 'Marammuri', the beginning of the temple festival, takes place only with the permission of the Koima of the Thamprakkal. Koima then supervises all the ceremonies related to the temple festival and conducts the Ariyalav as part of the closing ceremony of the festival. Athavanad, the main flag- beavered (kodivarau കൊടിവരവ്) of the Vairankode festival, depart for Vairankode after receiving the blessings of Azhvanchery Mana floats (Varavu വരവ്) and Thamprakkal. The annual Theeyattulsavam or Vairankode Vela is celebrated in the Malayalam month of Kumbham (February). The festival begins, on first Sunday of Kumbham month, begins with the ritual of Maram Muri, cutting a jackfruit tree for woods to prepare the fire of Kanalattam ritual. Cheriya Theeyattu, will be held on the third day and the 6th day celebration is called Valiya Theeyattu. On both these days, procession of various folk art forms like Poothan,Thira, Kattalan, Pulikali from nearby villages and places are the major attraction. Eratta Kaala, the decorated effigies of bullocks is another highlight of the festival. The ritual of Kanalattam, devotees walking on fire, will be held in the midnight on the concluding day. The festival at Vairankode attracts thousands of devotees from various castes and religions. Festival Place is a dynamic marketplace that presents a wide range of products including local produce, pottery, bamboo and palm trinkets, decorative goods, fresh vegetables, savory snacks, children's toys, candies, and assorted sweets. A key attraction within the festival area is the lively fresh water fish market, which attracts fishermen from both nearby and far-off regions to showcase their latest catches. This cultural exchange fosters connections among people who gather at Festival Place. Unlike other Kerala temple festivals, there are no elephants for Vairankode festival. The temple is traditionally decorated with plantain, coconut leaves, flowers, leaves, traditional lamps and lights.The theatre will provide the audience with a memorable experience, exhibiting the beauty of Kerala's rural village temple festivals together with a peek of the rural people's passions. == Transportation == * Nearest Airports: Calicut (CCJ) and Cochin International Airport * Nearest Municipality: Tirur * Nearest Major Railway Station:Tirunnavaya railway station 4 km, Tirur Railway Station10 km, Kuttippuram Railway Station11 km * Nearest Bus Station: Tirur10 km, Kuttipuram 11 km, Puthanathani 10 km == References == * * * Category:Festivals in India Category:Kerala",
 "title": "Vairankode Vela"
}