{
 "id": "1094654",
 "text": "A jakt is a small, single-masted, fast sailing boat, with a wide and flat- hull, probably of Dutch origin. Jakts had split booms, with a crab mainsail and two or three jibs. It also used to have the called breifokk, a kind of jib. == Etymology == The term jakt has its origin in the Dutch expression jacht or jachtschip, which refers to a fast sailing ship. The word is also the origin of the English term yacht, although this term describes a completely different type of boat - a large pleasure craft . J. Winge, Trebåter - Norsk kulturhistorie på sjøen, Schibsted forlag, 2002. == Description == Jakts were primarily built as cargo ships for fjords and nearby coastal areas, but larger, newly built jakts could also be used to sail across the Atlantic Ocean . This type of ship was built based on the experiences and ideas of the various shipbuilders about the construction details that offered the best properties of use. J.B. Godal, Tre til båtar, Landbruksforlaget, 2001. == Galley-type Jakt == Larger and longer jakts have recently been made, often paired with two masts in the manner of galleys, that is, with the sternmast, the messana, lower than the larger mast further forward. One of the reasons was the fact that you could get by with less staff to handle these ships, which were called jakts or \"Jaktegaleas\". G. Gøthesen, Norskekystens freaktemenn - Om seilfartøyer i kystfart, Norske båter bind II, Grøndahl & søn forlag A.S., 1980. == Jakt-Hardanger == A Hardangerjakt is a single-masted sailboat, with a flat hull and a round transom, rigged with a crab mainsail and jib that was a popular type of boat at the end of the 19th century . The jakt was used mainly as a cargo ship in coastal shipping, especially for transporting salted fish from northern Norway to western Norway . Brødrene af Sand - Ryfylkemuseet \"Anna af Sand\" is the oldest ship \"still afloat\" in Europe, launched in 1848, preserved as a typical example of jakt-Hardanger. The ship is owned by the Stavanger Maritime Museum. == Jakt vs. jekt == The jakt and the jekt are two types of boat similar in size, but quite different by both the shape of the vessel and the construction and rigging. The terms are so similar that they are often mistakenly used interchangeably. In some places the meaning of jekt has become entrenched, so that it is used (still incorrectly) for both types of craft, for example that's the case with Ryfylke fishing boats. Jekts were usually smaller, open or half-decked boats, while the larger jakts had a full deck . Jakts were built with a smooth hull (kravell ), on the other hand jekts were built with a tinged hull in the Nordic way. The most noticeable difference is the jekt's headsail versus the jakt's bowsprit jib rig. When the larger Hardanger jakts traveled with loads of firewood and fruit from Hardanger to the coastal towns, they often carried a smaller jekt in their cargo. In the province of Rogaland, these ships were nicknamed Hardangergeit. == References == == Bibliography == * Delius, Klasing + Co (1985): Maritime Encyclopedia: A Maritime Handbook ISBN 82-512-0150-0 == Other websites == * Category:Boats Category:Sailing",
 "title": "Jakt (sailboat)"
}