{
 "id": "1094464",
 "text": "Peter Anthony Rodger (born 6 April 1965) is a British filmmaker and photographer. He makes movies and takes professional photos. He is also known for directing commercials. Rodger is famous for his documentary film Oh My God released in 2009 and for helping to direct parts of The Hunger Games movie in 2012. He has won several awards for his work, including prizes from the Houston International Film Festival, the Chicago International Film Festival, the Telly Awards, the Mobius Awards, and the US International Film and Video Festival. ==Background== In 1999, Rodger's ex-wife asked for more money for child support. She said their oldest son Elliot Rodger was a \"high-functioning autistic child\" and needed extra money because of his special needs. Rodger's father disagreed. He brought in a doctor who said the autism diagnosis might not be accurate. He suggested that the first diagnosis might have overlooked other issues like depression or anxiety. The doctor recommended that their son should see a child psychiatrist for a more accurate diagnosis and the right treatment. The September 11 attacks made the commercial directing business very difficult, which badly affected Rodger's career. To try something new, he decided to make a documentary called Oh My God. For the project, Rodger traveled to more than 23 countries over two and a half years to ask famous people like Hugh Jackman and Ringo Starr about their thoughts on God. When the documentary was released in November 2009, it did not do well. It made very little money, costing Rodger about $200,000. He had used the value of his house to fund this project, which led to him going into debt and stopping payments for child support. Rodger told a judge that his business had not made money for over a year, and he had no income while looking for new work. He wanted to lower his child support payments for his two children from $2,000 a month. Rodger's ex-wife agreed to stop child support payments for a year. On May 23, 2014, Rodger's son, Elliot, killed six people and injured 14 others in Isla Vista, California. He then killed himself with a gunshot to the head. After the killings, Rodger spoke in several interviews. He talked about the incident and shared information about his son's life and how he was raised. == References == Category:Living people Category:1964 births Category:British filmmakers",
 "title": "Peter Rodger"
}