{
 "id": "1094712",
 "text": "BoardGameGeek (BGG) is a website. It has a database of board games. The website allows for users to review and rate board games. == Golden Geek Award == Since 2006, the site annually awards the best new board games of the year with the Golden Geek Award. Winners are selected based on a vote by registered users. === 2006–2009 === Category 2006 2007 2008 2009 Game of the Year Caylus Shogun Agricola Dominion Best Strategy Game Caylus Shogun Agricola Le Havre Best Wargame Twilight Struggle Combat Commander: Europe Hannibal: Rome vs. Carthage Combat Commander: Pacific Best Children's Board Game Nacht Der Magier Zooloretto Chateau Roquefort Sorry! Sliders Best 2-Player Board Game Twilight Struggle BattleLore oraz Commands & Colors: Ancients Hannibal: Rome vs. Carthage Space Hulk (third edition) Best Family Board Game Ingenious Zooloretto Thebes Pandemic Best Party Board Game Diamant Wits and Wagers Say Anything Time's Up! Deluxe Best Card Game \\- Caylus Magna Carta Race for the Galaxy Dominion Best Board Game Artwork/Presentation \\- BattleLore Jamaica Space Hulk (third edition) Best Board Game Expansion \\- - - Pandemic: On The Brink Best Print & Play Board Game \\- - - Dune Express Best Innovative Board Game \\- - - Space Alert === 2010–2019 === Category 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 Game of the Year Hansa Teutonica Dominant Species Eclipse Terra Mystica Splendor Pandemic Legacy: Season 1 Scythe Gloomhaven Root Wingspan Best Strategy Game Hansa Teutonica Dominant Species Eclipse Terra Mystica Five Tribes Pandemic Legacy: Season 1 Scythe Gloomhaven Brass: Birmingham Wingspan Best Wargame Washington's War A Few Acres of Snow Sekigahara: The Unification of Japan 1775: Rebellion Fire in the Lake Churchill Falling Sky: The Gallic Revolt Against Caesar 878 Vikings: Invasions of England Hannibal & Hamilcar Undaunted: Normandy Best Children's Board Game Forbidden Island Animal Upon Animal: Balancing Bridge King of Tokyo Forbidden Desert Tales & Games: The Hare & the Tortoise - - - - - Best 2-Player Board Game Washington's War A Few Acres of Snow Android: Netrunner Star Wars: X-Wing Miniatures Game Star Realms 7 Wonders Duel Star Wars: Rebellion Codenames: Duet KeyForge: Call of the Archons Watergate Best Family Board Game Tobago 7 Wonders King of Tokyo Love Letter Splendor Codenames Codenames: Pictures Azul The Quacks of Quedlinburg Wingspan Best Party Board Game Telestrations Dixit Odyssey King of Tokyo Love Letter Cash n' Guns 2nd Ed. Codenames Codenames: Pictures Warewords The Mind Wavelength Best Card Game Innovation 7 Cudów Świata Android: Netrunner Love Letter Star Realms 7 Wonders Duel Arkham Horror: The Card Game Century: Spice Road The Mind Wingspan Best Board Game Artwork/Presentation \\- Merchants & Marauders Takenoko Mice and Mystics Abyss Mysterium Scythe Photosynthesis Root Wingspan Best Board Game Expansion Dominion: Prosperity Twilight Imperium: Shards of the Throne Alien Frontiers: Factions Lords of Waterdeep: Scoundrels of Skullport 7 Wonders: Babel Ticket to Ride Map Collection: Volume 5 United Kingdom & Pennsylvania 7 Wonders Duel: Pantheon Scythe: The Wind Gambit Scythe: The Rise of Fenris Wingspan: European Expansion Best Print & Play Board Game Zombie in My Pocket The Thing D-Day Dice: Free Trial Version Tiny Epic Kingdoms & Coin Age ...and then we held hands... Dune: The dice game Star Trek: The Dice Game My Little Scythe Orchard: A 9 card solitaire game TINYforming Mars Best Innovative Board Game Catacombs A Few Acres of Snow Risk: Legacy Love Letter Dead of Winter: A Crossroads Game Pandemic Legacy: Season 1 Captain Sonar Gloomhaven Root Wingspan Best Thematic Board Game War of the Ring Collector's Edition Mansions of Madness Mage Knight Board Game Robinson Crusoe: Adventure on the Cursed Island Dead of Winter: A Crossroads Game Pandemic Legacy: Season 1 Scythe Gloomhaven Root Dune Best Abstract Board Game FITS Paris Connection Kingdom Builder Tash-Kalar: Arena of Legends Patchwork - - - - - Best Cooperative Game \\- - - - - - Mechs vs. Minions Gloomhaven The Mind The Crew: The Quest For Planet Nine Best Solo Game \\- - - - Imperial Settlers Tiny Epic Galaxies Scythe Gloomhaven That's Pretty Clever Wingspan ;RPG and Video Game awards RPG and Video game awards were introduced in 2014 and awarded through 2017. Only 1 category was awarded in 2018, and none in following years. Category 2014 2015 2016 2017 2018 Best RPG Artwork/Presentation Player's Handbook (D&D; 5e) Mouse Guard (2nd Edition) Volo's Guide to Monsters Xanathar's Guide to Everything - Best RPG Supplement Winner Dungeons & Dragons Starter Set The Dracula Dossier: Director's Handbook Volo's Guide to Monsters Xanathar's Guide to Everything - RPG of the Year Dungeon Master's Guide (D&D; 5e) Player's Handbook (D&D; 5e) Dungeons & Dragons (5th Edition) Blades in the Dark 7th Sea Tales from the Loop - Best Indie Video Game Winner Star Realms Rocket League Stardew Valley Cuphead - Best Mobile/Handheld Video Game Star Realms Fallout Shelter Twilight Struggle Through the Ages - Best Video Game Visuals/Artwork The Banner Saga The Witcher 3: Wild Hunt Overwatch The Legend of Zelda: Breath of the Wild - Most Innovative Video Game Galaxy Trucker - Pokémon GO The Legend of Zelda: Breath of the Wild - Video Game of the Year Winner Hearthstone: Heroes of Warcraft Multiple Winners Multiple Winners Multiple Winners - Best Board Game App Winner - - Twilight Struggle Through the Ages Ganz Schön Clever === 2020–present === 2020 saw many awards replaced with new categories, such as \"Board Game of the Year\" replaced with \"Game of the Year, Light\", \"Medium\" and \"Heavy\". Category 2020 2021 2022 Game of the Year, Light MicroMacro: Crime City Cascadia Cat in the Box: Deluxe Edition Game of the Year, Medium Lost Ruins of Arnak The Crew: Mission Deep Sea Heat: Pedal to the Metal Game of the Year, Heavy Gloomhaven: Jaws of the Lion Ark Nova Carnegie Best Wargame Imperial Struggle Undaunted: Reinforcements Undaunted: Stalingrad Best 2-Player Board Game Undaunted: North Africa Radlands Splendor Duel Best Card Game Dune: Imperium - - Best Board Game Artwork & Presentation On Mars Sleeping Gods Flamecraft Best Board Game Expansion Wingspan: Oceania Expansion Lost Ruins of Arnak: Expedition Leaders Dune: Imperium – Rise of Ix Best Print & Play Board Game 7 Wonders Duel: Solo Gloomholdin' Aquamarine Most Innovative Board Game MicroMacro: Crime City Oath: Chronicles of Empire and Exile Cat in the Box: Deluxe Edition Best Thematic Board Game Gloomhaven: Jaws of the Lion Sleeping Gods Heat: Pedal to the Metal Best Cooperative Game Gloomhaven: Jaws of the Lion The Crew: Mission Deep Sea Return to Dark Tower Best Solo Board Game Under Falling Skies Final Girl Turing Machine Best Zoomable Game Forgotten Waters - - Best Party Game \\- So Clover! Ready Set Bet Best Podcast So Very Wrong About Games Board Game Barrage This Game Is Broken Best Board Game App Root (2020) Gloomhaven Everdell == References == Category:Gaming websites Category:Board games",
 "title": "BoardGameGeek"
}