{
 "id": "1094892",
 "text": "Human population planning means managing the growth rate of a human population. This used to be called population control. In the past it was mostly about increasing populations. From the 1950s to the 1980s, concerns about overpopulation and its effects on poverty, the environment and political stability led to efforts to reduce population growth rates in many countries. More recently many countries such as China, Japan, South Korea, Russia, Iran, Italy, Spain, Finland, Hungary and Estonia have begun efforts to boost birth rates once again. Population planning can involve measures that improve people's lives by giving them greater control of their reproduction. In some place, like the Chinese government's \"one-child policy and two-child policy\", there have been punishments for families which had more children. ==Types== There are three types of population planning policies: # Increasing or decreasing the overall population growth rate. # Increasing or decreasing the relative population growth of a subgroup of people, such as those of high or low intelligence or those with special abilities or disabilities. Policies that aim to boost relative growth rates are known as positive eugenics; those that aim to reduce relative growth rates are known as negative eugenics. # Attempts to ensure that all population groups of a certain type (e.g. all social classes within a society) have the same average rate of population growth. == Effects == Since 1980 many countries have tried family-friendly policies to increase the birth rate. They have spent more on child benefits, subsidised childcare, increased parental leave and tried other family-friendly policies. Birth rates in most countries have continued to fall. ==References== ==Further reading== * * *Hopfenberg, Russell. \"Genetic feedback and human population regulation\". (PDF) Human Ecology 37.5 (2009): 643-651. ==Other websites== * * Wikiversity:Should we aim to reduce the Earth population? * \"Thirty years is too long to turn a blind eye to world population growth\" by Jane O’Sullivan. The Overpopulation Project * Could We Control Human OVER Population? BBC Earth Lab -YouTube video",
 "title": "Human population planning"
}