{
 "id": "1095185",
 "text": "Cupid and Psyche is a story from Metamorphoses. The story is called The Golden Ass. A writer called Lucius Apuleius wrote it in the 2nd century. The story is about two lovers, who have to overcome different obstacles before they can come together and get married. The woman is called Psyche. Her lover is a god, and called Cupid or Eros. Today, the only story that we still have is that of Apuleius, written in the 2nd century AD. The motif appears in Greek art much earlier, though. The oldest traces are from the 4th century BC. The story has Neoplatonic elements. It also mentions different mystery religions. This allows different interpretations of the story. The story has been called an allegory and in light of folktale, Märchen or fairy tale, and myth. Boccaccio knew about the story, about the year 1370. The first printed version of the story, called editio princps, dates to 1469. Since then, the story is well- known, and people have re-told it in different ways, or they made paintings or sculptures based on it. Dramas and operas, and even a wallpaper has been made based on the story. Psyche is the Ancient Greek name of the character. In Roman mythology, she would be called Anima, but almost no one uses that name. == In Apuleius == The tale of Cupid and Psyche (or \"Eros and Psyche\") is in the middle part of Apuleius' novel. It takes about a fifth of the total length of the work. The novel itself is a first-person narrative by the protagonist Lucius. Because of magic gone wrong, Lucius is transformed into a donkey. As a donkey, Lucius lives through different adventures, and has to do several tests. In the end, he is transformed back to human form, by eating roses sacred to Isis. The story of Psyche is similar in many aspects. It also is about dangeorous curiosity, punishments and tests. In the end, Pyche is also redeemed by the favor of a deity. The tale is an example of a mise en abyme. Originally, this term was used for a picture that mirrors itself. Lucius tells a story, that was told to Charite. Charite was a bride kidnapped by pirates on her wedding day. She was held prisoner in a cave. The happy ending for Psyche is supposed to calm Charite, who is afraid of being raped. This is one of several examples of Apuleius's irony. The story itself is not a strict allegory of a particular Platonic argument. Apuleius nevertheless uses images such as the laborious ascent of the winged soul (Phaedrus 248) and the union with the divine achieved by Soul through the agency of the daimon Love (Symposium 212b). === Story === There were once a king and queen,who ruled an unnamed city. They had three very pretty daughters. The youngest and most beautiful was Psyche. Her admirers neglected the proper worship of Aphrodite (love goddess Venus); they prayed and made offerings to her instead. It was rumored that she was the second coming of Venus, or the daughter of Venus from an union between the goddess and a mortal. Venus is offended, and tells Cupid to work her revenge. Cupid is sent to shoot Psyche with an arrow so that she may fall in love with something hideous. He instead scratches himself with his own dart, which makes any living thing fall in love with the first thing it sees. As a consequence, he falls deeply in love with Psyche and disobeys his mother's order. The two other very beautiful sisters are married. Psyche has not found love yet, and is not married. Her father thinks that they have angered the gods. He consults the oracle of Apollo. The response is unsettling: the king is to expect not a human son-in-law, but rather a dragon- like creature who harasses the world with fire and iron and is feared by even Jupiter and the inhabitants of the underworld. Psyche is then dressed up like for a funeral. A procession leads her to the the peak of a rocky mountain. There she is abandoned. Marriage and death are merged into a single rite of passage, a \"transition to the unknown\". Zephyrus, the West Wind, bears her up to meet her fated match, and leaves her in a lovely meadow (locus amoenus), where she promptly falls asleep. When she wakes up, Psyche is at the edge of a cultivated grove (lucus). Exploring, she finds a marvelous house with golden columns, a carved ceiling of citrus wood and ivory, silver walls embossed with wild and domesticated animals, and jeweled mosaic floors. A voice tells her to make herself comfortable, and she is entertained at a feast that serves itself and by singing to an invisible lyre. Psyche is afraid, because she has never experienced anything similar. Nevertheless, she allows herself to be guided to a bedroom. In the darkness, a being she cannot see has sex with her. She gradually learns to look forward to his visits, though he always departs before sunrise and forbids her to look at him. Soon, she becomes pregnant. ==== Violation of Trust ==== Psyche's family hasn't heard anything about what has become of her. After much begging, Cupid, which she still has not seen, allows Zephyr to carry her sisters up for a visit. When they see the splendor in which Psyche lives, they become envious: They try to ruin her happiness by asking her to uncover her husband's true identity. After all, the oracle said she was lying with a winged serpent, who would devour her and her child. One night after Cupid falls asleep, Psyche carries out the plan her sisters made: she brings out a dagger and a lamp she had hidden in the room, in order to see and kill the monster. But when the light instead reveals the most beautiful creature she has ever seen, she is so startled that she wounds herself on one of the arrows in Cupid's cast-aside quiver. Struck with a feverish passion, she spills hot oil from the lamp and wakes him. He flees, and though she tries to pursue, he flies away and leaves her on the bank of a river. The wilderness god Pan discovers her. He also recognizes the signs of passion on her. She acknowledges his divinity (numen), then begins to wander the earth looking for her lost love. Psyche visits first one sister, then the other. Both envy her because they learn who Psyche's secret husband really is. Each sister attempts to offer herself as a replacement. She climbs up the rocky mountain, and jumps off, after asking Zephyr to carry her away. But instead, each falls off the cliff and dies. ==== Wanderings and Trials ==== During her wanderings, Psyche comes upon a temple of Ceres. Inside the temple, she finds a number of offerings of grain, garlands and other agricultural tools. The offerings are in disarray. She recognizes that the proper worship of the gods should not be neglected, and she orders the offerings neatly. This makes Ceres appear. Psyche asks Ceres to help her. Ceres also says that she deserves to be helped. But Ceres is forbidden to help her against another deity. There is a similar incident at a temple of Juno. Psyche realizes that she must serve Venus herself. Venus is glad she has the girl under her power, and turns Psyche over to her two handmaids, Worry and Sadness. They should whip and torture her. Venus tears her clothes and bashes her head into the ground. She also mocks her for conceiving a child in a sham marriage. The goddess then throws before her a great mass of mixed wheat, barley, poppyseed, chickpeas, lentils, and beans. Venus demands that she sort them into separate heaps by dawn. But when Venus leaves to attend a wedding feast, a kind ant takes pity on Psyche, and assembles a fleet of insects to do the task. Venus is furious when she returns drunk from the feast, and only tosses Psyche a crust of bread. At this point in the story, it is revealed that Cupid is also in the house of Venus, suffering from his injury. At dawn, Venus has a second task for Psyche. She is to cross a river and fetch golden wool from violent sheep who graze on the other side. Elsewhere, it is said that the sheep belong to Helios. Psyche only wants to drown herself on the way, but instead she is saved by instructions from a divinely inspired reed, of the type used to make musical instruments, and gathers the wool caught on briers. Psyche also has a third task: she is given a crystal vessel in which to collect the black water of the source of the rivers Styx and Cocytus. She climbs the cliff from which it issues. The whole setting of the place makes her fearful. She sees dragons slithering through the rocks, and falls into despair. Jupiter himself takes pity on her, and sends his eagle to battle the dragons and get the water for her. ==== Psyche and the Underworld ==== The last trial Venus imposes on Psyche is a quest to the underworld itself. She is to take a box (pyxis) and obtain in it a dose of the beauty of Proserpina, queen of the underworld. Venus claims her own beauty has faded because she was looking after her son, and she needs this remedy in order to attend the theatre of the gods (theatrum deorum). Psyche is again despairing of her task. She climbs a tower, planning to throw herself off. The tower, however, suddenly starts talking. The tower advises her to travel to Lacedaemon, Greece. She should seek out the place called Taenarus, where she will find the entrance to the underworld. The tower also has instructions for navigating the underworld: > The airway of Dis is there, and through the yawning gates the pathless route > is revealed. Once you cross the threshold, you are committed to the > unswerving course that takes you to the very Regia of Orcus. But you > shouldn't go empty-handed through the shadows past this point, but rather > carry cakes of honeyed barley in both hands, and transport two coins in your > mouth. The speaking tower warns her to keep silent as she passes by several ominous figures: a lame man driving a mule loaded with sticks, a dead man swimming in the river that separates the world of the living from the world of the dead, and old women weaving. These, the tower warns, will seek to keep her from fulfilling her task by pleading for her help: she must ignore them. The cakes are treats for distracting Cerberus, the three-headed watchdog of Orcus. The two coins are for Charon the ferryman, so she can make a return trip. Everything works as planned. Proserpina grants Psyche's humble request. As soon as she reenters the light of day, however, Psyche becomes curious. She can't resist opening the box hoping to enhance her own beauty. She finds nothing inside but an \"infernal and Stygian sleep\", which sends her into a deep and unmoving torpor. ==== Reunion and Immortal love ==== Meanwhile, Cupid's wound has healed into a scar, and he escapes his mother's house by flying out of a window. When he finds Psyche, he draws the sleep from her face and replaces it in the box. He then pricks her with an arrow that does no harm. He lifts her into the air, and takes her to present the box to Venus. He then takes his case to Zeus, who agrees in return for Cupid's future help whenever a choice maiden catches his eye. Zeus has Hermes call an assembly of the gods in the theater of heaven. There, he makes a public statement of approval, warns Venus to back off, and gives Psyche ambrosia, the drink of immortality. That way, the couple can be united in marriage as peers. Their union, he says, will redeem Cupid from his history of provoking adultery and sordid liaisons. After Zeus's speech, there is a wedding banquet. With its happy marriage and resolution of conflicts, the tale ends in the manner of classic comedy or Greek romances such as Daphnis and Chloe. The child born to the couple will be Voluptas (Greek Hedone ‘Ηδονή), \"Pleasure\". ==== The Wedding of Cupid and Psyche ==== The assembly of the gods has been a popular subject for both visual and performing arts. Very often, the wedding banquet is shown. With the wedding of Peleus and Thetis, this is the most common setting for a \"Feast of the Gods\" scene in art. Apuleius describes the scene in terms of a festive Roman dinner party (cena). Cupid, now a husband, reclines in the place of honor (the \"top\" couch) and embraces Psyche in his lap. Zeus and Hera are placed in the same way. All the other gods are arranged in order. The cupbearer of Jove (Zeus's other Roman name) serves him with nectar, the \"wine of the gods\". Apuleius refers to the cupbearer only as ille rusticus puer, \"that country boy\", and not as Ganymede. Liber, the Roman god of wine, serves the rest of the company. Vulcan, the god of fire, cooks the food. The Horae (\"Seasons\" or \"Hours\") adorn, or more literally \"empurple\", everything with roses and other flowers. The Graces add a scent of balsam. The Muses sing. Apollo sings to his lyre, and Venus takes the starring role in dancing at the wedding, with the Muses as her chorus girls, a satyr blowing the aulos (tibia in Latin), and a young Pan expressing himself through the pan pipes (fistula). The wedding ends the love story. At the beginning, Psyche enjoyed the mysterious peleasures, Cupid provided. She then entered into a false marriage. These rites are re-done in the hall of the gods. This time, the correct ritual procedure for a real marriage is used. The gods are arranged in their proper order (in ordinem) . This shows the Roman audience the religious ceremony of the lectisternium. Lectisternia were public banquets held for the major deities. Statues were arranged on luxurious couches. That way it seemed that they were present and taking part in the meal. In the Renaissance art, people liked to show this wedding banquet. In 1497, Giovanni Sabadino degli Arienti made a cycle of the theme Cupid and Psyche cycle where this banquet took a central place. The painting were at Villa Belriguardo, near Ferrara, and are now lost. Raphael and his workshop did a series of two paintings at the Villa Farnesina in Rome. There, the scene is one of two paintings. Perino del Vaga did the Stanza di Psiche, in 1545, and 1546. The stanza is located at Castel Sant' Angelo in Rome. It was done by Perino del Vaga. Hendrick Goltzius introduced the subject to northern Europe with his \"enormous\" engraving called The Wedding of Cupid and Psyche (1587, 43 by 85.4 cm). This engraving influenced how other northern artists showed assemblies of the gods in general. The engraving in turn had been taken from Bartholomaeus Spranger's 1585 drawing of the same title. This is considered a \"locus classicus of Dutch Mannerism\". Karel Van Mander discusses it as an example of composition involving many figures. In 1774, François Boucher painted Marriage of Cupid and Psyche. This painting showed Enlightenment ideals. There is a marriage of lovely equals. The authority figure, Jupiter, is at the head of it. During the Rococo period, people liked pastels. The painting also shows this taste. == As Allegory == The story of Cupid and Psyche was often told as an allegory. In the 5th century, Martianus Capella tells the story in a different way. For Capella, it is an allegory about the fall of the human soul. For Apuleius, immortality is granted to the soul of Psyche as a reward for commitment to sexual love. In the version of Martianus, sexual love draws Psyche into the material world that is subject to death: \"Cupid takes Psyche from Virtue and shackles her in adamantine chains\". The tale was also adapted to a Christian or mystical context, often as symbolic of the soul.Mattei, Marina. \"Literary and Figurative Themes. Cupid and Psyche in Apuleius' fabula, crucible of all the fairy-tales in the world\". In: The Tale of Cupid and Psyche: Myth in Art from Antiquity to Canova. Edited by Maria Grazia Bernardini. L'Erma de Bretschneider, 2012. p. 42. . In the Gnostic text On the Origin of the World, the first rose is created from the blood of Psyche when she loses her virginity to Cupid. To the Christian mythographer Fulgentius, Psyche was an Adam figure, driven by sinful curiosity and lust from the paradise of Love's domain. Fulgentius lived in the 6th century. Psyche's sisters are Flesh and Free Will, and her parents are God and Matter. For Boccaccio, the marriage of Cupid and Psyche was a symbol of the union of soul and God. Bocaccio lived in the 14th century. Even in modern times, the story is interpreted as a religious or philosophical allegory. Psyche represents the aspirations of the human soul. These aspirations are towards a divine love personified in Cupid. But this misses the characterisation of Cupid as a corrupter. According to this view, Cuptid takes pleasurein disrupting marriages (The Golden Ass IV. 30) and is himself \"notorious for his adulteries\" (VI. 23). The things that point to this interpretation are the marked sensuality of his union with Psyche (V. 13), the help Jupiter offers him if he provides a new girl for Jupiter to seduce (VI. 22) and the name given to Cupid and Psyche's child – Voluptas (Pleasure). == Classical Tradition == Apuleius story was one that made the transition from roll to codex form. It was edited at the end of the forth century. Latin writers such as Augustine of Hippo, Macrobius, Sidonius Apollinaris, Martianus Capella, and Fulgentius knew the story. At the end of the sixth century, it was gradually forgotten. There was only one manuscript which made it survive the Dark Ages. In the 13th century, the rest of the metamorphoses were unknown . In the mid 14th-century humanists around Florence began to circulate copies of the work. From there, it spread throughout Europe. Boccacio's text was written in the 1370s and published 1472. One of the most popular images from the tale was Psyche's discovery of a naked Cupid sleeping. It can be found in ceramics, stained glass, and frescos. Mannerist painters were intensely drawn to this scene. In England, the Cupid and Psyche theme had its \"most lustrous period\" from 1566 to 1635. This started with the first English translation by William Adlington. A fresco cycle for Hill Hall, Essex, was modeled indirectly after that of the Villa Farnesina around 1570. Thomas Heywood's masque Love's Mistress dramatized the tale to celebrate the wedding of Charles I and Henrietta Maria. Henrietta Maria later had one of her rooms decorated with a 22-painting Cupid and Psyche cycle by Jacob Jordaens. The cycle took the divinization of Psyche as the centerpiece of the ceiling. It was a vehicle for the Neoplatonism the queen brought with her from France. The Cupid and Psyche produced by Orazio Gentileschi for the royal couple shows a fully robed Psyche whose compelling interest is psychological. In this artwork, Cupid is mostly nude. Another peak of interest in Cupid and Psyche was in the Paris of the late 1790s and early 1800s. People made operas, ballets, art salons, deluxe book editions and interior decoration about the subject. Interior decoration included clocks and wall paneling. Sometimes, people even styled their hair that way. After the French Revolution people used the myth to style themselves in that way. In the late 1790s, and early 1800s, people became gain interested in mystery religions. This was especially true for artists and intellectuals. Cupid and Psyche also influenced the fashion of the time. These people styled themselves that way. The British Museum obtained the Portland Vase around 1810. When Erasmus Darwin wrote about the vase, he speculated that the myth of Cupid and Psyche was part of the Eleusinian cycle. Darwin was interested in natural philosophy. He saw a butterfly as a good image for the soul. The butterfly started as a caterpillar. The caterpillar was unable to fly. It then \"died\" into the pupal stage. Afterwards, it was resurrected as a winged creature. == References == Category:Roman mythology Category:Greek mythology",
 "title": "Cupid and Psyche"
}