{
 "id": "1095822",
 "text": "The Amal Movement is a Lebanese political party that used to be a militant group related to followers of Shi'ism in Lebanon. It is noted for its dedication towards the social and economic emancipation of Shi'ites in the south of Lebanon. The party was created shortly after the outbreak of the Lebanese Civil War, in which it later participated, by Musa al-Sadr, Mostafa Chamran and Hussein el-Husseini as the military wing of \"The Movement of the Deprived.\" The party has been led by Nabih Berri since 1980. == History == === Shi'ism in Lebanon after the Second World War === In Lebanon, the years after the Second World War were marked by severe social and economic inequalities. Especially Maronite Christians and Sunni Muslims dominated the political realm and had control over most of the recourses. Shi'ites however were the largest and poorest group in Lebanon, which caused tensions in Lebanese society. During the 1950s and 1960s, some Shi'ites left their jobs in agricultural sector and immigrated to the cities or to Africa and America. The migration to cities like Beirut was stimulated by the neglection of rural areas in especially southern Lebanon by the government. Figures like Lebanese President Fu'ad Shihab made sure Shi'ites had access to state education, which lead to the social and economic emancipation of the Shia community. By the mid-1960s, the Shi'ites had organized themselves in political parties that tried to obtain political influence and power for the Shia community. === Musa al-Sadr and Shi'ite political power === The founder of the Amal Movement, Sayyid Musa al-Sadr, was born in Iran into a family of religious scholars. During the 1960s he gained prominence as a spokesman for the politically neglected Shi'ites in Lebanon. One of his mayor accomplishments was the establishment of an independent Shi'i Council, the Supreme Islamic Shi'i Council (SISC), in 1967. This was a government sanctioned representative body that gave Shi'ites some degree of political power. Musa al Sadr served as its first president till his presumed death in 1978. It was met by some resistance because it shifted away power from the original leaders of the Shi'ite community, the zu'ama. Musa al-Sadr also established \"The Movement of the Deprived\" in 1974. This was a political party for Shi'ites. === Formation of the Amal Movement === As a result of the governmental neglect and the imbalance of access to government resources, Musa al-Sadr expressed from early on the wish to organize a militant group \"to defend the Shi'i community from both government neglect and deprivation, and from the Israeli aggressions against the South.\" In 1975 the Amal Movement thus emerged as the military wing of the \"The Movement of the Deprived\", but Amal would later absorb this movement. It was presented to the public on July 6, not long after the outbreak of the Lebanese Civil War in April earlier that year. It would become a major player in the Lebanese Civil War, that took place from 1975-1990. The militia however began small and was in the beginning made up of just around 800 volunteers. === Rise to prominence and the Lebanese Civil War === The Amal Movement became even more relevant for the Shia-community in the south when Israel invaded Lebanon and the PLO, made up of mostly Palestinian refugees, also became active in the region. The sudden disappearance of Musa al-Sadr in 1978 radicalized the movement and worsened the relationship with the Palestinian refugees. The Iranian Revolution which helped Shi'ite clerics into power made the party even more popular.Norton, Augustus R. Hezbollah: A Short Story. One of the co- founders, Hussein al-Hussein took over the leadership, but was in 1980 replaced by Nabih Berri. The Amal Movement allied with the intervening Syrian army. The soured relationship with the Palestinians lead to series of fights in the mid 1980s between mostly the (allies of the) Palestinians and the Amal movement, that came to be known as (part of the) the War of the Camps. === War of the Brothers === When the War of the Camps came to an end, tensions between Amal and Hezbollah rose, which would lead to the War of the Brothers. This armed conflict lasted from 1988 to 1990. During the 1980s Hezbollah had become a competitor of the Amal Movement, which had become more secular and targeted the depraved and poor in the south of Lebanon more in general for support. Hezbollah however had become a party for Muslims and the Umma more in general, which attracted former supporters of the changing Amal Movement. == Present == After the Lebanese Civil War ended, the Amal Movement became mostly occupied with politics and lost most of its military elements, although it never completely lost its military wing. It has batteled with Hezbollah over electoral support ever since the end of the Civil War. The party is still being lead by Nabih Berri, who was elected speaker of parliament in 1992, 1996, 2000, 2005, 2009 and 2016. Currently, he party is the largest Shia party in Lebanon's democracy with 14 people to represent them in the democracy, compared to Hezbollah's 13 people. The Amal movement is also allied with Hezbollah politically. ==References== Category:Political parties in Asia Category:Pages with unreviewed translations",
 "title": "Amal Movement"
}