{
 "id": "1095719",
 "text": "Tomas Kalnoky (born December 24, 1980) is an American musician who was born in Czechoslovakia. He sings, plays guitar, and writes songs in Streetlight Manifesto and Bandits of the Acoustic Revolution. When he performs solo, he's called Toh Kay. Previously, he sang and played guitar in Catch 22, but he left after making only one album (their debut, Keasbey Nights). He went to Savannah College of Visual Art and Design, but the booklet of his album (Somewhere in the Between) says that he went to Rutgers University. He also founded and owns Pentimento Music Company. == Biography == === 1995-1998: Early career === He made his first band called Gimp in 1995. The members in the band were Jason Scharenguivel (the bass player) and Chris Greer (the drummer, who would later be with Tomas in Catch 22). Tomas released one cassette called \"Smiles for Macavity\" before Jason left the band because Tomas was bored of playing \"just punk.\" Chris would stay with Tomas to form Catch 22. Tomas formed Catch 22 in 1996 with Chris who recruited Kevin Gunther (the trumpet player of Catch 22) who was working in a record store. Bass player Josh Ansley, saxophone player Ryan Eldred and trombone player Jamie Egan were added to finish the first lineup of Catch 22. In 1998, Catch 22 released \"Keasbey Nights,\" the band's debut album. Tomas left the band to continue his studies (partly because of parental pressure). === 2001-2003: Streetlight Manifesto's beginnings === Tomas brought 3 ex-Catch 22 members (Jamie and Josh), 3 ex-One Cool Guy members (Stuart Karmatz, Dan Ross, and Pete Sibilia), Achilles (Tomas' brother) and many of Achilles' orchestra friends to form Bandits of the Acoustic Revolution (or BOTAR) in 2001. The band released 1 EP, called \"A Call to Arms.\" In 2002, Tomas formed Streetlight Manifesto (sometimes called Streetlight by fans). Tomas isn't really a huge fan of the \"ska\" branding that Streetlight had, despite the horns. Tomas recorded Streetlight's demo that same year. In 2003, Tomas released Streetlight's first album, Everything Goes Numb. The main topics for critics are the quality and energy of the band's lyrics. Streetlight then got a cult following. === 2004-2007: Keasbey Nights re-recording and Somewhere in the Between === In 2004, Tomas decided to re- record Keasbey Nights, an album originally by Catch 22. It kept getting delayed until it was finally released in 2006. 2007 brought Somewhere in the Between, Streetlight's second album. === 2010-2012: Solo performance albums === 2010 brought a split album by Tomas (under his solo performer stage name Toh Kay) and Dan Potthast from MU330, which is called You by Me: Vol. 1. The first Toh Kay music video was his cover of \"I've Set Sail\" which was originally written by Dan. The video was animated by Eric Power from Inked Reality. Tomas announced a new Streetlight album called \"The Hands That Thieve\" in 2012, which is a cover of Tomas' solo album under the same name. He apologized to the fans that the album would be released in January 2013. The album was then leaked, and it got good reviews. === 2013: Having an argument with Victory Records === Victory Records took all copies of The Hands That Thieve from Streetlight and those who pre-ordered through the Streetlight website. The album then became available on Victory Records' website instead. Streetlight called for a boycott of all merch and music bought from Victory Records. The fans were told to buy the merch from Streetlight's website. Though Streetlight had no physical copies, they kept getting pre-orders. This resulted in the band asking customers not to ask for a refund and rather accept a mystery gift instead of the album itself. === 2015 - 2017: Getting sued === On October 20, 2015, many media networks mentioned a $1,000,000 lawsuit against Tomas. The lawsuit was filed because Streetlight didn't reach their goal of releasing four studio albums under Victory Records, though the band released five. Victory says that \"... the band agreed not to count this album [Streetlight's Keasbey Nights rerecording] as one of the four albums under its contract to receive a $10,000 emergency advance.\" Victory also said that 99 Songs of Revolution: Vol. 1 doesn't count toward the contract because it was a covers album. The lawsuit is also about the copyright infringement with Streetlight's album The Hands That Thieve. Tomas released an acoustic version under his solo stage name Toh Kay, which is called \"The Hand That Thieves.\" Tomas posted this on Twitter: \"Ironically, @victoryrecords hasn't paid us a cent in royalties in over 2 yrs. More info soon. #irony #douchenuggets\" Just 3 days later, Streetlight uploaded this to their Facebook page: \"THE REPORTS ARE SIMPLY NOT TRUE. Tony Brummel / Victory Records are NOT suing Tomas for $1 Million… ...He's actually suing Tomas for FIVE MILLION DOLLARS.\" On April 19, 2017, Streetlight agreed that they would leave Victory Records, and Streetlight would get its master recordings. == Musical influences == Tomas has a lot of influences in his music. His influences include The Drifters, Bad Religion, Nirvana, The Suicide Machines, Squirrel Nut Zippers and The Dead Milkmen. He also mentioned Czech folk singer Jaromir Nahovica as one of his musical heroes in an interview. In one of his interviews, Tomas mentioned pop-folk singer Mason Jennings as one of his CDs playing in his car. He recorded Jennings' song Birds Flying Away on Streetlight's 99 Songs of Revolution: Vol. 1 as one of the songs. == Albums released == === Gimp === * Smiles for Macavity (1996) === Catch 22 === * Rules of the Game (EP) (1997) * Keasbey Nights (1998) === Bandits of the Acoustic Revolution (BOTAR) === * A Call to Arms (EP) (2001) === Streetlight Manifesto === * Streetlight Manifesto Demo (EP) (2002) * Everything Goes Numb (2003) * Keasbey Nights (2006) * Somewhere in the Between (2007) * 99 Songs of Revolution: Vol. 1 (2010) * The Hands that Thieve (2013) === Toh Kay === * You by Me: Vol. 1 (With Dan Potthast of MU330 and The Stitch-Up) (2010) * Streetlight Lullabies (2011) * The Hand that Thieves (2013) * You by Me: Vol. 2 (With Sycamore Smith, formerly of The Muldoons) (2014) == References == Category:1980 births Category:Musicians from New Jersey Category:Living people Category:People from East Brunswick, New Jersey",
 "title": "Tomas Kalnoky"
}