{
 "id": "1095325",
 "text": "Homo ludens (Latin homo ludens, for playing man) is a way to explain how people develop their cultural abilities. This model says that people do this mostly through playing games.Johan Huizinga (Autor), Andreas Flitner (Hrsg.): Homo ludens. Vom Ursprung der Kultur im Spiel. Reinbek 2009 The game makes it possible to understand the outside world. Imaginative play serves to express inner experiences even in early childhood. Fairy tales are also a form of mental play. In narrative “play,” people supplement their practical experiences with imaginative meaning.Siegbert A. Warwitz, Anita Rudolf: Der Mensch braucht das Spielen. In: Dies.: Vom Sinn des Spielens. Reflexionen und Spielideen. 5. Auflage, Schneider, Baltmannsweiler 2021, S. 36 In this respect , Homo ludens is an anthropological counter-term to Homo faber. == Origin of the term == The term Homo ludens was first used in the first half of the 20th century. Johan Huizinga published a book with the same title, in 1938/39. In this book, he showed that playing was a culture-forming factor. Cultural systems such as politics, science, religion, law all developed from playful behavior ( self-organisation ). Later, they became more formal, using rituals. When the \"rules\" have been properly \"established,\" they can no longer be changed easily; they have to be followed.Ulrich Prill: Mir ward alles Spiel. Königshausen & Neumann, Würzburg 2002, ISBN 3-8260-2355-2, S. 14. Max Scheler used the term Homo faber (\"working man\") since 1928. Max Frisch wrote a novel with the name Homo faber, in 1957. This is one of his well-known works. Hutzinga chose his name \"playing person\"/\"homo ludens\" to contrast this term. Vilfredo Pareto, an economist, used the term Homo oeconomicus in 1905, to describe a person taking economic decisions. Play is a fundamental human activity. When they are playing, people get creative. When they compete with each other, people can show and use their energy and their strength. Playing can lead to innovation. For this reason, many creativity techniques and management training courses includes playful elements. With this they can produce new, creative and innovative results. Play seems to be a human activity capable of changing the elements of a situation in such a way that the new and unknown arise and solutions can be found to seemingly insoluble problems. According to Huizinga, play also serves to release emotions . This puts him in the tradition of the Aristotelian doctrine of catharsis . The origin of sport in the game as something originally humanArnd Krüger: The ritual in modern sport: a sociobiological approach, In: John M. Carter & Arnd Krüger (Hrsg.): Ritual and Record – Sport in Pre-Industrial Societies. Westport, Conn.: Greenwood 1990, S. 135–152. and sport as a more recent invention that did not develop from old games is controversial. Guttmann, Allen: From ritual to record. The nature of modern sports. New York: Columbia UP 1978. Play is common to all young mammals, but it is either absent or less obvious in other types of animals.Groos. Karl 1911. The play of animals. Appleton, New York. == References == == Other websites == * Friedrich Schiller: On the aesthetic education of people as an e-text in the Gutenberg project Category:Game theory Category:Latin words and phrases Category:Psychology",
 "title": "Homo ludens"
}