{
 "id": "1095703",
 "text": "Antonín Barák (born 3 December 1994) is a Czech professional footballer who plays as an attacking midfielder for club Fiorentina and the Czech Republic national team. After starting his professional career at Příbram in the Czech First League, he moved on to play for Slavia Prague, before moving to Italy to play in Serie A for Udinese, as well as on loan at other clubs in the same league. == Club career == === Slavia Prague === Barák made his career league debut for 1. FK Příbram on 1 June 2013 in a Czech First League 1–1 away draw at Slovan Liberec. He signed for Czech First League club SK Slavia Prague on 30 December 2015 on a contract until June 2019. === Udinese === On 31 January 2017, Slavia announced that he had signed with Udinese Calcio for a fee of €3 million, but that the transfer would go through after the end of the season. === Lecce === On 29 January 2020, he joined Serie A club Lecce on loan. On 2 February he scored a goal in a 4–0 home win against Torino, his first match with the salentini side. === Verona === On 17 September 2020, he was loaned to Hellas Verona. Verona held an obligation to purchase his rights if certain performance conditions were met. === Fiorentina === On 26 August 2022, Barák joined Fiorentina on loan with an option to buy. On 31 January 2023, Fiorentina exercised their option to make the transfer permanent. In the 2022-23 season, Barak helped Fiorentina in the Europa Conference League and formed a main attacking force with Luka Jović and Nicolás González, scoring 5 goals in 11 matches. In the second leg of the semi-final against Basel, Barak started from the bench and was substituted on 105th minute of extra time, after which he scored an injury time winner for Fiorentina in 129th minute, causing his club to reach the final in Prague, Czech Republic. Again in the 2023-24 season, Barak helped Fiorentina reach the quarter finals, yet to be played. Barak scored 2 goals in 2 games across 2 legs against Maccabi Haifa == International career == In November 2016, Barák received his first call-up to the Czech senior squad for friendly matches against Norway and Denmark. He debuted in the latter match on 15 November and scored a goal. On 26 March 2017, Barák scored two goals in his competitive debut, a 6–0 victory over San Marino in the 2018 FIFA World Cup qualifying stage on 26 March 2017. He was later selected for the rescheduled UEFA Euro 2020. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League Cup Europe Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Příbram 2012–13 Fortuna Liga 1 0 0 0 – – 1 0 2013–14 0 0 0 0 – – 0 0 2015–16 12 3 2 1 – – 14 4 Total 13 3 2 1 – – 15 4 Vlašim (loan) 2014–15 Czech National League 27 5 0 0 – – 27 5 Slavia Prague 2015–16 Fortuna Liga 9 4 0 0 – – 9 4 2016–17 25 4 3 1 5 0 – 33 5 Total 34 8 3 1 5 0 – 42 9 Udinese 2017–18 Serie A 34 7 0 0 – – 34 7 2018–19 8 0 1 0 – – 9 0 2019–20 8 0 3 1 – – 11 1 Total 50 7 4 1 – – 54 8 Lecce (loan) 2019–20 Serie A 16 2 0 0 – – 16 2 Hellas Verona (loan) 2020–21 Serie A 34 7 2 0 – – 36 7 Hellas Verona 2021–22 Serie A 29 11 1 0 – – 30 11 2022–23 1 0 1 0 – – 2 0 Total 64 18 4 0 – – 68 18 Fiorentina (loan) 2022–23 Serie A 30 2 5 1 12 5 – 47 8 Fiorentina 2023–24 Serie A 21 2 2 0 10 3 1 0 34 5 2024–25 1 0 0 0 0 0 — 1 0 Total 52 4 7 1 22 8 1 0 82 13 Career total 256 47 20 4 26 6 1 0 304 59 ===International=== Appearances and goals by national team and year National team Year Apps Goals Czech Republic 2016 1 1 2017 6 4 2018 5 0 2019 0 0 2020 3 0 2021 14 3 2022 6 0 2023 2 0 2024 7 3 Total 44 11 :Scores and results list Czech Republic's goal tally first, score column indicates score after each Barák goal. List of international goals scored by Antonín Barák No. Date Venue Cap Opponent Score Result Competition 1 15 November 2016 Městský stadion, Mladá Boleslav, Czech Republic 1 1–0 1–1 Friendly 2 26 March 2017 San Marino Stadium, Serravalle, San Marino 3 rowspan=\"2\" 3 3–0 4 5 October 2017 Baku Olympic Stadium, Baku, Azerbaijan 4 2–1 2–1 2018 FIFA World Cup qualification 5 11 November 2017 Abdullah bin Khalifa Stadium, Doha, Qatar 5 1–0 1–0 Friendly 6 24 March 2021 Arena Lublin, Lublin, Poland 16 2–1 6–2 2022 FIFA World Cup qualification 7 2 September 2021 Městský stadion, Ostrava, Czech Republic 24 1–0 1–0 2022 FIFA World Cup qualification 8 11 November 2021 Andrův stadion, Olomouc, Czech Republic 28 1–0 7–0 Friendly 9 22 March 2024 Ullevaal Stadion, Oslo, Norway 38 2–1 2–1 Friendly 10 7 June 2024 Untersberg-Arena, Grödig, Austria 40 1–0 7–1 Friendly 11 10 June 2024 Malšovická aréna, Hradec Králové, Czech Republic 41 2–1 2–1 Friendly ==Honours== Slavia Prague *Czech First League: 2016–17 Fiorentina *Coppa Italia runner-up: 2022–23 *UEFA Europa Conference League runner-up: 2022–23 Czech Republic *China Cup bronze: 2018 == References == == Other websites == * Profile at the ACF Fiorentina website * * * Category:1994 births Category:Czech footballers Category:Living people",
 "title": "Antonín Barák"
}