{
 "id": "1095709",
 "text": "A synod () is a council of a Christian denomination. They are usually convened to decide an issue which has caused problems. The word synod comes from the Ancient Greek () . This is like the Latin word . Originally, synods were meetings of bishops. The word is still used in that sense in Catholicism, Oriental Orthodoxy and Eastern Orthodoxy. In modern usage, the word often refers to the governing body of a particular church, whether its members are meeting or not. It is also sometimes used to refer to a church that is governed by a synod. Sometimes the phrase \"general synod\" or \"general council\" refers to an ecumenical council. The word synod also refers to the standing council of high-ranking bishops governing some of the autocephalous Eastern Orthodox churches. The day-to-day governance of patriarchal and major archiepiscopal Eastern Catholic Churches is done by a permanent synod. ==Eastern Orthodox and Oriental Orthodox== In Eastern Orthodox and Oriental Orthodox churches, synods of bishops are meetings of bishops within each autonomous Church. They are where the election of bishops and the establishment of inter-diocesan ecclesiastical laws are done. A sobor is a formal gathering or council of bishops together with other clerical and lay delegates representing the church to deal with matters of faith, morality, rite, and canonical and cultural life. The synod in the Western churches is similar. They are usually limited to an assembly of bishops. The term is found among those Eastern Orthodox Churches that use Slavic language (the Russian, Ukrainian, Bulgarian, Serbian and Macedonian Orthodox Churches), along with the Romanian Orthodox Church. ==Bibliography== ===Collections of synodal decrees=== * * * * * (See ) * * (See ) * * * * === Other === * The synod of Constantinople in Byzantine times (in German) * Calculating the Synod? A network analysis of the synod of Constantinople in Late Byzantine times == References == Category:Church councils Category:Christian terminology",
 "title": "Synod"
}