{
 "id": "1095707",
 "text": "Equestria is a fictional country from the My Little Pony franchise and the primary setting of My Little Pony: Friendship Is Magic, a 2010–2019 animated children's television series. It is depicted as being ruled by Princess Celestia, although Twilight Sparkle is depicted as its ruler in the distant future. The country is made up of earth ponies, unicorns, and pegasi, three different types of ponies that put their differences aside during the first Hearth's Warming. North of Equestria are the Crystal Empire, a fictional country ruled by Celestia's adopted niece Princess Cadance, and Yakyakistan, a fictional country of yaks. Other nearby civilizations include the Dragon Lands (dragons), Griffon Kingdom (griffins), Hippogriffia (hippogriffs), and Seaquestria (seaponies). The capital of Equestria is the city of Canterlot, which is populated primarily by unicorns and alicorns. The city is where Princess Celestia and her sister Princess Luna live, as well as the original home of Twilight Sparkle. The nearby town of Ponyville is where Twilight and her friends reside, as well as the main location featured in My Little Pony: Friendship Is Magic. Manehatten, Las Pegasus, and Saddle Arabia are some other notable cities in Equestria. In My Little Pony: A New Generation, a reboot film taking place several generations after Friendship Is Magic, Equestria is depicted as having fallen apart as the three types of ponies live in segregation and there is no unified government. The fate of the princesses is unknown, though it is implied that Twilight Sparkle and the Mane 6 are no longer around. == Major cities == === Canterlot === Canterlot (a portmantea of \"canter\" and \"Camelot\") is the capital city of Equestria. Populated primarily by unicorns, the city has many wealthy and famous ponies. Princess Celestia and Princess Luna, the sisterly rulers of Equestria, reside in Canterlot. Twilight Sparkle was born and raised in the city, though she later moved to Ponyville. == Elements of Harmony == The Elements of Harmony are six magical items that represent several core values of Equestrian culture: magic, honesty, loyalty, laughter, kindness, and generosity. The items were grown from the Tree of Harmony, which was planted by the Pillars of Old Equestria prior to the events of Friendship Is Magic. In the show, the elements are depicted as necklaces (with the exception of magic, which is a crown) that are represented by Twilight Sparkle, Applejack, Rainbow Dash, Pinkie Pie, Fluttershy, and Rarity (collectively known as the Mane 6), respectively. The Elements of Harmony first appear in \"Friendship Is Magic\", the two-part series premiere of My Little Pony: Friendship Is Magic, where they are used by the Mane 6 to defeat Nightmare Moon. They are later used again to defeat Discord (\"The Return of Harmony\"), the Everfree Forest (\"Princess Twilight Sparkle\"), and King Sombra (\"The Beginning of the End\"), the last of whom manages to return and destroy the elements altogether. == Related civilizations == === Crystal Empire === The Crystal Empire is a wealthy magical civilization located to the northern border of Equestria. The empire is home to the crystal ponies, who magically turn transparent during times of happiness. The Crystal Empire is led by the Crystal Princess, a title held by Princess Cadance. The heir to the throne is Princess Flurry Heart, the daughter of Cadance and her husband Shining Armor. ==== Equestria Girls variant ==== In My Little Pony: Equestria Girls – Friendship Games, Crystal Prep Academy is introduced as the human equivalent of the Crystal Empire. Principal Abacus Cinch and Dean Cadance run the school. == Cultural impact == Various notable projects, both inside and outside of the My Little Pony: Friendship Is Magic fandom, have been named after Equestria. Among these are the news website Equestria Daily, the Hearts of Iron IV mod Equestria at War, and the 2011 novel Fallout: Equestria. == References == Category:My Little Pony Category:Fictional countries",
 "title": "Equestria"
}