{
 "id": "1095304",
 "text": "The Parable of the Sower (or Parable of the Soils) is one of the parables of Jesus. It is found in the Gospels of Matthew, Mark, and Luke, and the apocryphal book known as the Gospel of Thomas. Jesus starts this parable with a farmer who sows seed on a path, rocks, thorns, and good soil. In the path, the seeds are taken by the birds as food, and stepped over by people. In the rocks, the seed does not grow into a plant. In the thorns, the plant is destroyed by the thorns surrounding it. But on the good soil, the seed grows into a plant and provides. According to Jesus, the farmer represents him, the seeds are the Gospels, and the way the seed grows represent how the people react to the Gospels. == Text == “'Listen! A farmer went out to sow seed. While he was scattering the seed, some of it fell by the road. The birds came and ate all that seed. Other seed fell on rocky ground, where there was not enough dirt. It grew quickly there because the soil was not deep. But then the sun rose and the plants were burned. They died because they did not have deep roots. Some other seed fell among thorny weeds. The weeds grew and stopped the good plants from growing. So they did not make grain. But some of the seed fell on good ground. There it began to grow, and it made grain. Some plants made 30 times more grain, some 60 times more, and some 100 times more.'” —Mark 4:3-8 (ERV) This is the meaning of the parable from Jesus: \"Later, Jesus was away from the people. The twelve apostles and his other followers asked him about the stories. Jesus said, “Only you can know the secret truth about God’s kingdom. But to those other people I tell everything by using stories. I do this so that ‘They will look and look but never really see; they will listen and listen but never understand. If they saw and understood, they might change and be forgiven.’” Then Jesus said to the followers, “Do you understand this story? If you don’t, how will you understand any story? The farmer is like someone who plants God’s teaching in people. Sometimes the teaching falls on the path. That is like some people who hear the teaching of God. As soon as they hear it, Satan comes and takes away the teaching that was planted in them. “Other people are like the seed planted on rocky ground. They hear the teaching, and they quickly and gladly accept it. But they don’t allow it to go deep into their lives. They keep it only a short time. As soon as trouble or persecution comes because of the teaching they accepted, they give up. “Others are like the seed planted among the thorny weeds. They hear the teaching, but their lives become full of other things: the worries of this life, the love of money, and everything else they want. This keeps the teaching from growing, and it does not produce a crop in their lives. “And others are like the seed planted on the good ground. They hear the teaching and accept it. Then they grow and produce a good crop—sometimes 30 times more, sometimes 60 times more, and sometimes 100 times more.” —Mark 4:10-20 (ERV) == References == Sower",
 "title": "Parable of the Sower"
}