{
 "id": "1095911",
 "text": "Susan Abulhawa (born June 3, 1970) is a Palestinian-American writer and human rights activist. She is the author of the 2010 best-selling novel While the World Sleeps, and founder of the NGO Playgrounds for Palestine. She lives in Yardley, Pennsylvania. Her second novel, \"The Blue Between Sky and Water\" (en), which has been translated into more than 19 languages. It was published in the United Kingdom on June 4, 2015, and in the United States on September 1, 2015. == Family Background == Her parents were born in the city of Al-Tur in Jerusalem, and were displaced in the 1967 war. Her father said that they were expelled at gunpoint. Her mother was studying in Germany at the time, so she could not return. After that, they were reunited in Jordan before going to Kuwait, where Suzan was born in 1970. After the disintegration of the family due to the war, she was sent to her uncle in the United States At the age of thirteen, she was sent to North Carolina as an adopted child. She has lived in the United States since that time. == Writing == She majored in biology in college and completed a master's degree in neuroscience. She later moved to journalism and fiction, where she contributed to some anthologies that were published in major and minor American and international newspapers. She wrote her first novel, While the World Sleeps, which achieved many international sales and was published in at least 26 languages. In 2013, she published some poetic writings entitled “The Voice of the Wind Sought for Me,” and she announced that she had completed them and sold her second novel. == Playgrounds for Palestine == She founded Playgrounds for Palestine,Playgrounds for Palestine a non-governmental organization that defends Palestinian children by building camps for them in Palestine and in United Nations camps in Lebanon. Their first land was established at the beginning of 2002.Adams, John (March 2003), \"Playgrounds for Palestine Brings Playground for Peace\" (PDF) Today's Playground, retrieved 13 October 2009 == Her activities == In 2000, she traveled to Palestine and heard the sound of her childhood at the foot of the Mount of Olives, and there she finally achieved her purpose. She lived her life along an indefinable path. She said that it was one of the political activities in confronting the Israeli settlements on the Palestinian lands. She said that her visit to Palestine was considered an awakening. When she heard the call to prayer there for the first time, she realized how much she had missed it and began to cry. In 2024, Abulhawa travelled to Gaza for two weeks to help give out food and support a local animal shelter. After two weeks she returned and described the terrible conditions there comparing the situation in Gaza to the Holocaust. == References == Category:Palestine Category:1970 births Category:Living people Category:Palestinian Americans",
 "title": "Susan Abulhawa"
}