{
 "id": "1095726",
 "text": "Das Kalte Herz is a fairy tale by Wilhelm Hauff (1802-1827). The title is usually translated as The Heart of Stone. Literally, it translates to The Cold Heart. The fairy tale was first published in Hauff's Fairytale Almanac, in 1828. The story is embedded into another story, called Das Wirtshaus im Spessart (The Spessart Inn); Spessart is a mountain range, about south of Frankfurt am Main. Das Wirtshaus im Spessart spans all of the stories in the Almanac. == Content == Peter Munk, known as Kohlenmunk-Peter, runs a charcoal burning business in the Black Forest. He inherited this from his father. He is dissatisfied with his work though, because it is dirty, does not pay well, and does not have a good reputation. He dreams about having a lot of money, and being well-respected in society. Then he learns that there is a spirit of the forest, called Glassmännlein (little Glass Man) or Schatzhauser. This spirit will grant three wishes if he is invoked by people like Peter, who were born on a Sunday, between eleven and two o'clock. Invoking the spitit needs a specific verse. So Peter goes looking for the spirit. He then meets another forest spirit, Holländermichel (Dutchman Michael), who is large, and dangerous. Dutchman Michael causes mischief on stormy nights, as a sorcerer. Peter manages to escape him, though. Peter calls the little glass man, with a specific invocation. The glass man grants him three wishes. His first wish is to have money and dancing skills, so that he is able to dance in the inn. His second wish is a glassworks, with some horses, to operate it. The glass man becomes angry about the short-sightedness of Peter's wishes, and he refuses him the third wish. At the start, Peter is very happy with his glassworks and his new status in society. Quickly his reputation rises, and he becomes a well-respected man in the Black Forest. He is lacking the understanding on how to run the business. This soon becomes apparent. More and more, he is drawn to playing games for money, and into being idle most of the day. He neglects his glassworks, and has to pawn it. Because of his problems, he turns towards Dutchman Michael. Unlike the Glass Man, Dutchman Michael is in league with evil. Michael is more generous than the Glass Man, but in exchange for his help, he wants Peter's heart. Michael says that this would only be a hindrance, with all his feelings. For his heart, Peter will receive a cold stone in his breast, and 100.000 Thaler. Also Peter can come back if he needs more money. The next day, Peter begins a two-year trip around the world. Peter soon realizes that he can no longer enjoy anything. He no longer laughs or weeps, doesn't feel love, and that nothing is beautiful any more. His heart of stone cannot take part in anything. He returns to Dutchman Michael, to reclaim his heart. Michael refuses the wish. He points out that he will only get back his heart after death. He also shows Peter his collection of hearts. Peter learns that other \"great personalities\" of the Black Forest have also exchanged their hearts for money. This includes Peter's role model, Ezechiel. Michel gives Peter even more money and advises him to find a job and get married to dispel his boredom. Peter builds a huge house in the Black Forest and from then on works as a merchant and moneylender. As a moneylender, the interest rates he charges are very high. He is notorious for his relentless greed; he chases away all the poor who beg in front of his house. He only supports his old mother and otherwise keeps her away from him. Now he goes looking for a bride and asks for the hand of the beautiful woodcutter’s daughter Lisbeth. They get married, but Lisbeth soon feels unhappy. Peter is just in a bad mood, stingy, and he forbids Lisbeth from helping the poor despite her immense wealth, which is why she is soon considered even more greedy. One day, when Lisbeth is alone and Peter isn't there, a little old man come by and asked Lisbeth for a drink of water. She offers him wine and bread. When the man is about to leave, he thanks her, and says that such a good heart will not go unrewarded. At that moment, Peter returns. He is furious, and uses the wooden handle of a whip to beat Lisbeth. Lisbeth instantly dies from the attack. Peter regrets what he has done, and the little old man identifies himself as the Glass Man. The Glass Man says that Peter has trampled on the most beautiful flower in the Black Forest. Peter blames the Glass Man. The Glass Man gets angry and turns into a monster. Only for the sake of Peter's dead wife, who helped him, does the Glass Man give Peter eight days to think about his life. Peter has sleeping problems. He also hears voices telling him to get a warmer heart. He lies to the people who miss Lisbeth. He tells them that his wife took a surprise trip somewhere. Also, the things that happened make him think about his own death. Finally he goes into the forest, and he summons the Glass Man. He tells him that he still has a last wish, and that he wants his heart back. The Schatzhauser cannot help him, because the deal \"heart against money\" wasn't made with him. He tells him a trick how he can outwit Michel. For a third time, he goes to Dutch Michael. Peter claims that Dutch Michael cheated, and that he did not receive a heart of stone. Michael wants to prove him wrong. As a test, he puts back Peter's real heart. Peter then takes a glass cross that he had received from the Glass Man. He points the cross in the direction of Michael. That way, he is able to keep furious Michael at a distance. He escapes to the Glass Man. Now, Peter regrets what he has done in his life. The Glass Man unites him with his mother, and with Lisbeth, who has returned from the dead. On the advice of the little glass man, he works hard as a charcoal burner and becomes a respected man even without much money. For the birth of his son, he receives four rolls full of thalers from the glass man as a godfather's gift. == Analysis == The tale is different from the other tales. It does not start with the formula \"Once upon a time...\". The first sentence is more like that of travel literature: Anyone travelling through Swabia should never forget to take a look into the Black Forest; not because of the trees, ... but because of the people. Ottmar Hinz says the story is at the threshold of literary realism. There is a psychogram of wounded, wounding and healing masculinity. The story also preserves the Romanticism's longing for love and its belief in the good in people. This becomes clear when Lisbeth and Peter find each other again and have a child, as well as in the mother's return. Mathias Jung: Das kalte Herz: wie ein Mann die Liebe findet; eine tiefenpsychologische Interpretation nach dem Märchen von Wilhelm Hauff. 2006, S. 145, 151, 152, 159–161, 168. The people who exchanged their feeling heart against a stone, and who have become successful or appear sympathetic through their ruthlessness, probably made the author think of psychopaths. Peter Munk is half orphan. He is a coal-burner. At the time the story was written, only few coal-burners were left. Coal mines and steam engines were able to carry out the work faster.Mathias Jung: Das kalte Herz: wie ein Mann die Liebe findet; eine tiefenpsychologische Interpretation nach dem Märchen von Wilhelm Hauff. 2006, S. 49. Hauff's father died in 1809. Hauff was only seven years old at the time. The problems young Hauff had could be mirrored in the character Peter Munk. At the start, Munk is morally and psychologically unstable. He also is plagued by feelings of inferiority, he does not have a high self-esteem. Peter goes to the “wrong father” Holländermichel because he has no basic trust in his work sense . Everyone can identify with the common name Peter. Mathias Jung: Das kalte Herz: wie ein Mann die Liebe findet; eine tiefenpsychologische Interpretation nach dem Märchen von Wilhelm Hauff. 2006, S. 55, 58. Apparently, the Little Glass Man is the conscience. In Freud's words, the superego. To use Jung's terminology, it is the positive archetype of the father. It is the moral compass, what Socrates would have called the daimonion. It also stands for “bourgeois commercial industriousness and social morality,” while the Holländermichel represents the unbridled “profit-seeking of commercial capital in the first third of the 19th century.” The name Ezekiel comes from the biblical prophet Ezekiel, who said: “I will take out your heart of stone and give you a heart of flesh.” Mathias Jung: Das kalte Herz: wie ein Mann die Liebe findet; eine tiefenpsychologische Interpretation nach dem Märchen von Wilhelm Hauff. 2006, S. 62, 63, 77, 122 At first, Peter is in a state of self-alienation. He gambles, dances, and drinks. He wants to get wealth and prestige. Peter is in middle adulthood, at at time where he needs to decide whether to found a family, build a house and engage in social activities. At first, Peter fails at these tasks. Sandra Kegel's “The Insecure Man” describes the option he made as a “convertible instead of a stroller”. But at the end of the story he holds a “beautiful boy” in his hands as a proud father. The change to the positive comes about through a change in his inner attitude and his evaluation standards with the help of the little glass man, who had given him a deadline of eight days. Peter manages to turn around in a symbolic seven days. Money dominates social practice almost as a leitmotif : in The Cold Heart, opinions, social interaction, expressions of respect, influence and reputation depend almost exclusively on material wealth. As a symbol, the heart of stone represents the increasingly strong connection between wealth, greed and hard- heartedness. Hauff completed the work in July 1827. This was shortly after an economic depression. The depression was triggered by Great Britain. Entire industries disappeared in southern and western Germany. This was because of the mass-production of British industry, == Romantic period == There are connection to the Romantic era. During that period, it was quite common to write fairy tales in prose, and not in verse. Hauff used a legend; Using the legend of the “Glass Man” he depicted the romantic search for happiness . Another sign of the era visible here is the turn towards the mystical, uncanny, ghostly and local legends . The main keyword of romanticism is \"Longing\". Kohlenmunk-Peter is granted three wishes in the course of the story. What can also be seen is that characters first tend towards self- destruction. Peter becomes wealthy, but this wealth does not bring happiness. It makes him miserable. His longing turns into greed and malice. But Kohlenmunk-Peter does not give up his search for happiness. At the end of the story, he finds it at the side of his wife. == Movies == The story has been turned into many movies. == References == Category:German literature",
 "title": "Heart of Stone (German fairy tale)"
}