{
 "id": "1095924",
 "text": "The China Open was a snooker tournament. It was a ranking tournament tournaments. It began in 1997. The final champion is Neil Robertson, who won the event in 2019. == History == The first big snooker tournament in China was the China International in September 1997. The China International was a non- ranking tournament for the top 16 players and local players. The following season the tournament was given a ranking and was held in March. Then the name of the event was changed to China Open and was held in December, so there were two events in 1999. After the 2002 tournament the event was abandoned. The event was revived in 2004. Local players were invited to play against the qualifiers. Ding Junhui, Chinese, won the tournament, but as he entered as a wild-card, he received no prize money nor ranking points. The last edition of the tournament in 2019 took place at the Olympic Sports Center Gymnasium, Chaoyang District, Beijing in early April, and it was usually the last ranking event before the World Championship. The 2020 edition was scheduled to take place, but the COVID-19 pandemic caused it to be cancelled: the subsequent restrictions meant it was not staged through 2021, 2022 and 2023. Despite the COVID restrictions ending in China, the tournament has not been restored to the calendar, with new events in Wuhan and Xi'an being staged in its place. ==Winners== Below are the winners of the events. Year Winner Runner-up Final score Host city Season China International (non-ranking) China International (non-ranking) China International (non-ranking) China International (non- ranking) China International (non-ranking) China International (non-ranking) 1997 Steve Davis Jimmy White 7–4 Beijing 1997/98 China International (ranking) China International (ranking) China International (ranking) China International (ranking) China International (ranking) China International (ranking) 1999 John Higgins Billy Snaddon 9–3 Shanghai 1998/99 China Open (ranking) China Open (ranking) China Open (ranking) China Open (ranking) China Open (ranking) China Open (ranking) 1999 Ronnie O'Sullivan Stephen Lee 9–2 Shanghai 1999/00 2000 Ronnie O'Sullivan Mark Williams 9–3 Shenzhen 2000/01 2002 Mark Williams Anthony Hamilton 9–8 Shanghai 2001/02 2005 Ding Junhui Stephen Hendry 9–5 Beijing 2004/05 2006 Mark Williams John Higgins 9–8 Beijing 2005/06 2007 Graeme Dott Jamie Cope 9–5 Beijing 2006/07 2008 Stephen Maguire Shaun Murphy 10–9 Beijing 2007/08 2009 Peter Ebdon John Higgins 10–8 Beijing 2008/09 2010 Mark Williams Ding Junhui 10–6 Beijing 2009/10 2011 Judd Trump Mark Selby 10–8 Beijing 2010/11 2012 Peter Ebdon Stephen Maguire 10–9 Beijing 2011/12 2013 Neil Robertson Mark Selby 10–6 Beijing 2012/13 2014 Ding Junhui Neil Robertson 10–5 Beijing 2013/14 2015 Mark Selby Gary Wilson 10–2 Beijing 2014/15 2016 Judd Trump Ricky Walden 10–4 Beijing 2015/16 2017 Mark Selby Mark Williams 10–8 Beijing 2016/17 2018 Mark Selby Barry Hawkins 11–3 Beijing 2017/18 2019 Neil Robertson Jack Lisowski 11–4 Beijing 2018/19 2020 Cancelled due to the COVID-19 pandemic Cancelled due to the COVID-19 pandemic Cancelled due to the COVID-19 pandemic Cancelled due to the COVID-19 pandemic 2019/20 ==References== Category:Snooker tournaments",
 "title": "China Open (snooker)"
}