{
 "id": "109585",
 "text": "Sales are the activities involved in selling products or services in return for money or other compensation. It is an act of completion of a commercial activity. A salesman is someone who sells products or services, thus generating sales. Salespeople reach out to contacts that might be interested in purchasing the product or service that their company is selling — prospects that demonstrate interest through actions like visiting the company website or interacting with the company on social media. The goal is to reach out to leads who have shown interest in or fit the description of the company’s target customer, in hopes of providing them with a solution that results in a purchase of your product or service. == Marketing == Sales are closely connected with marketing because they have the same goal. Sales serve as a result and confirmation of the correctness of the company's marketing work. Sales are more practical than theoretical. Sales theory certainly exists as the recommended stages of the sales process, and continues to develop. The concept of sales is included as a basic in many other modern terms and business systems. Many big companies have some problems with their sales and marketing departments. == Handling objection == A sales objection is an explicit expression by a buyer that a barrier exists between the current situation and what needs to be satisfied before buying from that particular seller. While selling there will be objections from the buyer which the seller needs to handle wisely without losing the leads. When a buyer indicates objections, the salesperson does not get discouraged but takes it as a chance to explain the value of the product or service. And if the seller can't persuade them, that's a good sign they're a poor fit. == Methods == There are many classifications of sales: * Wholesale and retail sales * Sales in the B2B and B2C segment * Active sales * Direct sale * Multilevel marketing * \"Short\" and \"long\" sales * Mobile sale * Sale of goods and services * Industry sales: food, building materials, etc. *Live Auctions *Spot bid sales *Retail sales *Agency Sales *Consultative Sales ==References== Category:Money",
 "title": "Sales"
}