{
 "id": "1095328",
 "text": "The Parable of the Workers in the Vineyard (or the Parable of the Laborers in the Vineyard and the Parable of the Generous Employer) is a parable of Jesus that is only found in chapter 20 of the Gospel of Matthew. It is a parable that is considered hard to interpret. == Text == “God’s kingdom is like a man who owned some land. One morning, the man went out very early to hire some people to work in his vineyard. He agreed to pay the workers one silver coin for working that day. Then he sent them into the vineyard to work. “About nine o’clock the man went to the marketplace and saw some other people standing there. They were doing nothing. So he said to them, ‘If you go and work in my field, I will pay you what your work is worth.’ So they went to work in the vineyard. “The man went out again about twelve o’clock and again at three o’clock. Both times he hired some others to work in his vineyard. About five o’clock the man went to the marketplace again. He saw some other people standing there. He asked them, ‘Why did you stand here all day doing nothing?’ “They said, ‘No one gave us a job.’ “The man said to them, ‘Then you can go and work in my vineyard.’ “At the end of the day, the owner of the field said to the boss of all the workers, ‘Call the workers and pay them all. Start by paying the last people I hired. Then pay all of them, ending with the ones I hired first.’ “The workers who were hired at five o’clock came to get their pay. Each worker got one silver coin. Then the workers who were hired first came to get their pay. They thought they would be paid more than the others. But each one of them also received one silver coin. When they got their silver coin, they complained to the man who owned the land. They said, ‘Those people were hired last and worked only one hour. But you paid them the same as us. And we worked hard all day in the hot sun.’ “But the man who owned the field said to one of them, ‘Friend, I am being fair with you. You agreed to work for one silver coin. Right? So take your pay and go. I want to give the man who was hired last the same pay I gave you. I can do what I want with my own money. Why would you be jealous because I am generous?’ “So those who are last now will be first in the future. And those who are first now will be last in the future.” —Matthew 20:1-16, Easy-to-Read Version == Interpretations == Most people think that the parable means that people who turn to God early and people who turn to God late will each receive an equal reward from him. Others also think that the people who turned to God early are Jews, and the rest are Gentiles and Christians (non-Jews). == References == Workers",
 "title": "Parable of the Workers in the Vineyard"
}