{
 "id": "1095753",
 "text": "Jane Anger was an English writer who lived during the sixteenth century. She was the first to publish a long writing defending women in English. She wrote the short book Jane Anger, Her Protection For Women, which was printed in 1589. In the late sixteenth century, most women did not write things for the public to read. The few women who did write about religion. Jane Anger was unusual: She wrote that men should not rule women. == Life and identity== Scholars know little about Jane Anger and have different ideas about her. The only thing historians know for sure about Jane Anger is that she wrote her short book, Jane Anger Protection for Women (1589). Many women were named Jane Anger in England at the time, and scholars do not know which one wrote the book. Scholar Moira Ferguson says the last name \"Anger\" might come from the French word \"Anjou\". Anne Prescott wrote, \"presumably, the Jo. Anger, whose poem on the author appears at the end of the volume, was a relative or spouse.\" Other scholars have said that \"Jane Anger\" was the pretend name of a man. Other scholars think Jane Anger was a woman. In The Crooked Rib, Francis Lee Utley writes that Jane Anger wrote her book after reading the poem, \"ye are too yong to bring me in: An old lover to a young gentlewoman.\" == Work == In the Middle Ages, many people wrote about feminism, the idea that men and women should be more equal. Jane Anger's pamphlet, \"Her Protection of Women\" (1589), answers and adds to what male writers said about women. The book talks about women and women writers. It talks about women's anger. Jane Anger \"changes male writing styles to create a female style.\" Some say \"Anger reworks anti-women ideas to show a female perspective.\" That means that Anger takes ideas that say women are bad and turns them around to show how women think and see things. Pamela Joseph Benson says, \"The Protection focuses on traditional issues of sexual behavior.\" == References == == Sources == * * * * == Bibliography == *Jane Anger, Her Protection for Women. Anger, Jane (1589). digital.library.upenn.edu London: R. Jones and T. Orwin. Retrieved 3 April 2024. Category:British writers Category:1560 births Category:1600 deaths",
 "title": "Jane Anger"
}