{
 "id": "10967",
 "text": "Catherine of Aragon (Spanish: Catalina) (16 December 1485 – 7 January 1536) was the youngest daughter of Isabella I of Castile and Ferdinand II of Aragon. Catherine was the wife of Arthur, Prince of Wales and later married his brother, Henry VIII. == Early life == When Catherine was three years old, it was decided that she would marry Arthur, Prince of Wales. Catherine and Arthur were married on 14 November 1501. They were sent to Ludlow Castle in Shropshire, to take control of the Council of Wales. Months later, Catherine and Arthur became ill, possibly from a sickness which was sweeping the area at the time. Prince Arthur died on 2 April 1502, leaving after Catherine a widow at the age of 16. Henry VIII married Catherine in 1509, shortly after he became king. She was extremely popular with the people of England. In 1513, when Henry VIII invaded France, she ruled as his regent. Name Birth Death Daughter 31 January 1510 Henry 1 January 1511 22 February 1511 Son 17 September 1513 Son c. November 1514 Mary 18 February 1516 17 November 1558 Daughter 9 November 1518 == Annulment: end of marriage == Despite Catherine's popularity, she did not produce a surviving son. Her only surviving child was a daughter, Mary I of England. Henry's need for a son caused him to try and divorce his wife. At first, Henry tried to convince Anne Boleyn to be his mistress in 1527. Anne refused, so Henry decided to marry her. Divorce was not allowed in the Catholic faith. Henry claimed that, as Catherine had been married to his elder brother Arthur, his was an invalid marriage. He quoted a verse in Leviticus which states that \"a man may not marry his brother's wife and such a union would be without the blessing of God and fruitless\", and used this as his case. It became referred to as the kings \"Great Matter\" and a special court was held with Cardinal Wolsey leading it. An official from Rome was brought over and a trial was held. The official stated that he could not come to a conclusion and the case would have to be referred to Rome for the Pope to make a decision. The matter dragged on for quite some time, as the Pope would not agree to an annulment. == Later years == In 1532, Anne Boleyn became pregnant with the king's child. She was married to Henry on 25 January 1533 so that the baby could be a legitimate heir. Henry's marriage to Catherine of Aragon was finally annulled in the following May by Archbishop Cranmer, thus ending the first of Henry's 6 marriages. The divorce went against the Roman Catholic belief system, so Henry created his own church, the Church of England. This was the beginnings of protestantism in England, with the King as the head of the church instead of the Pope. Until the end of Catherine's life, Catherine believed that she was the true wife of Henry VIII. Her servants called her their queen, but Henry called her the \"Dowager Princess of Wales\". In 1535, Catherine was transferred to Kimbolton Castle and was not allowed to see her daughter Mary. Henry VIII told her that until they declared Anne their queen, they would be able to see each other. They never did. Catherine died, most likely of heart cancer, in January of 1536, just five months before the execution of Anne Boleyn. == Ancestry == ==References== Category:1485 births Category:1536 deaths Category:House of Tudor Category:Wives of Henry VIII Category:Princes and Princesses of Wales Category:Spanish royalty Category:Deaths from heart cancer Category:Cancer deaths in England",
 "title": "Catherine of Aragon"
}