{
 "id": "1096418",
 "text": "On 1 April 2024, an Israeli attack drone struck the Iranian embassy in Damascus, Syria. The attack resulted in the deaths of sixteen people. == The attack == === Victims === Of the sixteen people killed, there were eight Iranians (including an Iranian advisor), six Syrian/Lebenese militiamen, and two civilians. The civilians killed was a Syrian woman and her child. == Aftermath == Many delegations stated that any attack on diplomatic and consular premises breaks the rules in the charter of the United Nations as well as Vienna Convention on Diplomatic Relations and other international laws. The Israeli attack happened during a time of increased tension between Iran and Israel, as well as ongoing war between Israel and Gaza in which Israel has killed over 48,000 people in Palestine. Iran announced it would retaliate for the attack, which it would acheive on 13 April 2024. Syria's Foreign Minister, Faisal Mekdad, condemned the attack, calling it a \"terrorist attack\" that killed innocent people. Officials from many other countries condemned the attack as well, including the Prime Minister of Iraq, the Prime Minister of Spain, the President of Nicaragua, and the foreign ministries of Afghanistan,https://www.iranintl.com/en/202404028719 \"UN Chief, Taliban Condemn Attack On Iran's 'Diplomatic Premise\"]. Iran International. Algeria, Armenia, Brazil, Belarus, China, Cuba, Egypt, Indonesia, Jordan, Italy, Kazakhstan, Kuwait, Lebanon, Libya, Malaysia, Maldives, Mauritania, Norway, Oman, Pakistan, Qatar, Russia (who called it a \"political killing\"), Saudi Arabia, South Africa, Sierra Leone, Tajikistan, Tunisia, Turkey, United Arab Emirates, Uzbekistan, Venezuela, and Vietnam. The Foreign Ministry of Kyrgyzstan expressed concern. On 13 April 2024, the Iranian military fired Operation True Promise on Israel, in which dozens of Israeli military bases and weapons facilities were destroyed/heavily damaged as reprisal for the Israeli attack. ==References== Category:History of Damascus Category:April 2024 events Category:2024 in Syria Category:2024 Iran–Israel conflict",
 "title": "Iranian consulate airstrike in Damascus"
}