{
 "id": "1096345",
 "text": "Katarzyna Zowada ( December 1998) was a Polish student who was kidnapped and killed in 1998 by a 52-year-old man named Robert Janczewski. Zowada was a university student who studied religion at the Jagiellonian University in the Polish city of Kraków. She was reported missing on November 12th 1998. However, her body was not found until the 6th of January, 1999. The skin of a torso was discovered in the Vistula River by a ship, and on the 14th of January, a cut off right leg was discovered in the same river. Both were matched to Katarzyna Zowada through DNA testing. == Biography == Katarzyna Zowada was born on to Polish parents in Poland. She grew up in Poland, near the Polish city of Kraków. Zowada's father had died in 1996 when she was in her early twenties. Two years later in 1998, Zowada went to Jagiellonian University and became a student there. She took a semester of history and passed it, but after taking that, Zowada took another semester in religion in the university. Her family and friends described her as a \"kind, gentle, and smart young woman, but withdrawn, grieved, and depressed after the death of her father.\" For a long time after her father died in 1996, Zowada was struggling with the loss of her father, and became alone and sad. Finally, her mother took her to an appointment with a psychotherapist to help her with her grief, and depression. Her mother made an appointment for her and Zowada, but her daughter went missing. When her mother didn't see or hear from her, she tried to report her as a missing person. However, the police told her to be patient and wait until they could do something. == Abduction and Death == In 1998, Zowada was approached and kidnapped by 52-year-old Robert Janczewski around December 1998. He used a sharp tool to stab Zowada twice in the torso. After her kidnapping, she was locked in Janczewski's house in the city of Kraków, where she was physically hurt and tortured for maybe a few weeks before her murder. He cut and removed all the skin from her torso while she was still alive. He then let Zowada be exposed without the skin on her torso, get infected from the flaying, and die from the torture. When she died, he cut up all of her body parts. He dumped the skin of her torso and her right leg in the Vistula River. It is unknown what happened to the rest of the body parts, because they were never found. == Related pages == * Kelly Ann Bates ==References== Category:Violence against women Category:Polish murder victims Category:People murdered in Europe Category:Torture victims",
 "title": "Murder of Katarzyna Zowada"
}