{
 "id": "1096473",
 "text": "The Mirror Universe is an Alternate Universe in Star Trek. It was first introduced in an episode of The Original Series where an Ion Storm makes the Transporter Beam have a problem so Captain Kirk, Scotty, Bones and Lieutenant Uhura switch places with different versions of themselves from a world where they’re all evil. == Role in the Original Series == After finding out how evil, the other him is, Captain Kirk talks to the other Universe’s Lieutenant Commander Spock and convinces him that the Terran Empire is a bad idea. So when Kirk and the others go back to their world, they say that the other Spock will change a lot. == Role in Deep Space Nine == In Star Trek: Deep Space Nine, Major Kira and Dr. Julian Bashir accidentally go to the Mirror Universe. They find out that after Spock helped the Terran Empire get better, it was conquered by the Klingon Empire, the Cardassian Union and the planet Bajor and they now call themselves “The Alliance.” One of The Alliance’s leaders is an evil version of Kira who enslaves humans and kills a Ferengi named Quark for trying to stop her. Dr. Bashir and Kira convince the other versions of Miles O’Brien and Benjamin Sisko to turn against the Evil Kira and lead the human slaves in a revolution. After, the Mirror Universe’s Benjamin Sisko is killed, O’Brien gets the real Sisko to pretend to be him. The Evil Kira kills the Mirror Universe version of Quark’s brother Rom. After they take back the Space station, O’Brien admits that the Benjamin Sisko they know is dead. His widow, Jennifer Sisko goes to the main universe and brings the real Ben Sisko’s son Jake Sisko back to her world. Ben Sisko follows his son there and stops the Rebels from torturing the Evil Kira. Then the Mirror Universe version of Rom’s son Nog helps the Evil Kira escape because “you killed my father and my uncle. Thanks to you, I own the bar.” Then Evil Kira kills Nog. After escaping Evil Kira sends her boyfriend Bereil to the main Universe to steal a magic Orb from the real Kira but he falls in love with the real Kira and betrays the evil one. Quark and Rom later go to the Mirror Universe to rescue the Ferengi leader Zek. There’s a good version of their enemy Brunt. The Evil Kira kills him so her sidekick Ezri betrays her and rescues Quark and Rom. The Evil Kira still escapes. == Role in Enterprise == Star Trek: Enterprise has two episodes set entirely in the Mirror Universe. In it, an evil version of Captain Archer finds a spaceship from The Original Series that was accidentally sent 100 years back in time. He takes over the ship and tries to prove he’s stronger than the Good Archer. He plans to take over the Terran Empire but then his girlfriend Hoshi Sato kills him and takes over herself. == Parodies and Homages == In Buzz Lightyear of Star Command, there’s an episode called The Lightyear Factor where Zurg finds a Universe where Buzz Lightyear is evil and rules a Galactic Empire. They team to take over the main universe. The Evil Buzz Lightyear has a goatee like the Mirror Universe version of Spock did. In the movie Phineas and Ferb The Movie: Across The Second Dimension, Dr. Doofenshmirtz meets another dimension’s him who is smarter and more evil and the other Doofenshmirtz has a goatee. Category:Star Trek",
 "title": "Mirror Universe"
}