{
 "id": "1097395",
 "text": "Spanish was the only official language of the Philippines for over 300 years when it was ruled by Spain, from the late 1500s to 1898. After that, it became a co-official language with English when the USA ruled the country. Even after the Philippines became independent in 1946, Spanish stayed as an official language, along with Filipino (Tagalog) and English. In 1973, it was taken out as an official language by a change in the constitution. But, after a short time, it became an official language again because of a decision by the president. In 1987, with the new Philippine constitution, Spanish was named an \"optional and voluntary language\".Article XIV, Section 3 of the 1935 Philippine Constitution provided, \"[...] Until otherwise provided by law, English and Spanish shall continue as official languages.\" The 1943 Philippine Constitution (in use when controlled by Japanese soldiers, and later denied) did not specify official languages. Article XV, Section 3(3) of the 1973 Philippine constitution approved on January 17, 1973 specified, \"Until otherwise provided by law, English and Pilipino shall be the official languages. Presidential Decree No. 155 dated March 15, 1973 ordered, \"[...] that the Spanish language shall continue to be recognized as an official language in the Philippines while important documents in government files are in the Spanish language and not translated into either English or Pilipino language.\" Article XIV Section 7 of the 1987 Philippine Constitution specified, \"For purposes of communication and instruction, the official languages of the Philippines are Filipino and, until otherwise provided by law, English.\"Article XIV, Sec 7: For purposes of communication and instruction, the official languages of the Philippines are Filipino and, until otherwise provided by law, English. The regional languages are the auxiliary official languages in the regions and shall serve as auxiliary media of instruction therein. Spanish and Arabic shall be promoted on a voluntary and optional basis. During the time when the Philippines was ruled by Spain (1565–1898), Spanish was used in government, newspapers, business, schools, and the arts. In the middle of the 19th century, the Spanish government started a free school system. This led to a group of educated Filipinos who spoke Spanish, called the Ilustrados. Famous men in this group were José Rizal, Antonio Luna, and Marcelo del Pilar. When Spanish rule ended, many people in the cities and from rich families could speak Spanish. But, most of the country's people did not know the language. The country's first official language was in the Malolos Constitution of the First Philippine Republic in 1899. It was used a lot during the first years of the U.S. rule from 1898 to 1946. But over time, the American government started to prefer English over Spanish. They saw Spanish as a bad part of the past. By the 1920s, English became the main language for the government and schools. Even after the Philippines became independent in 1946, Spanish became less important. In 1973, it was no longer an official language. Now, Spanish is not used much in daily life. Some Filipinos are interested in learning it again or bringing it back, but the number of people who speak it is getting smaller. In 2020, about 400,000 Filipinos (less than 0.5% of the people) could speak Spanish well. The Academia Filipina de la Lengua Española controls the Spanish language in the Philippines. It is part of the Asociación de Academias de la Lengua Española, which controls the Spanish language around the Spanish-speaking world. == List of Spanish words of Philippine origin == Even though Spanish has influenced the languages of the Philippines the most with many loanwords, the Philippinic languages have also given some words to Spanish. Here are some Philippine- origin words found in the Diccionario de la lengua española de la Real Academia Española, the dictionary made by the Real Academia Española: Spanish loan word Origin Tagalog English equivalent abacá Old Tagalog: abacá abaká abacá baguio Old Tagalog: baguio bagyo typhoon or hurricane barangay Old Tagalog: balan͠gay baranggay/barangay barangay bolo Old Tagalog: bolo bolo bolo carabao Waray-Waray: carabáo kalabáw carabao caracoa Visayan: karakoa karakaw karakoa, a war canoe cogón Old Tagalog: cogón kogón cogon dalaga Old Tagalog: dalagà dalaga single, young woman gumamela Old Tagalog: gumamela gumamela Chinese hibiscus nipa Visayan: nipà nipa nipa palm paipay Old Tagalog: paypay or pay-pay pamaypay a type of fan palay Old Tagalog: palay palay raw rice pantalán Cebuano: pantalán pantalán wooden pier salisipan Old Tagalog: salicipan salisipan salisipan, a pirate ship sampaguita Old Tagalog: sampaga sampagita jasmine sawali Old Tagalog: sauali sawali sawali, a woven bamboo mat tuba Cebuano: tuba tuba palm wine yoyó Ilocano: yoyó yo-yó yo-yo == Related pages == * Chavacano — a creole language based on Spanish spoken in Cavite City, Ternate, and Zamboanga City * Philippine Spanish — an extinct Philippine variant of the Spanish language == References == == Other websites == * The Teaching of Spanish in the Philippines, UNESCO, February 1968 * Asociacion Cultural Galeon de Manila, Spanish-Philippine cultural research group based in Madrid (in Spanish and English). * Instituto Cervantes de Manila * Spanish Chamber of Commerce in the Philippines * Philippines",
 "title": "Spanish language in the Philippines"
}