{
 "id": "109776",
 "text": "The 2008 World Wrestling Entertainment (WWE) Draft was the fifth yearly (and sixth overall) Draft held by WWE. The Draft was held on June 23, 2008 in San Antonio, Texas from the AT&T; Center. The Draft took place live for three hours on WWE's flagship program, Raw, which aired on the USA Network. ==Report== ===Background=== The Draft was announced by WWE Chairman, Vince McMahon on the May 26 2008 episode of Raw. During the announcement, he stated that every WWE Superstar, Diva, and Commentators were eligible to be drafted. ===Superstar selections=== ====Televised draft==== Pick # Brand (To) Superstar/Diva Brand (From) Notes 1 Raw Rey Mysterio SmackDown! 2 SmackDown! Jeff Hardy Raw 3 Raw CM Punk ECW 4 ECW Matt Hardy SmackDown! Matt Hardy was the WWE United States Champion at the time he was drafted, making the United States Championship ECW exclusive. 5 SmackDown! Jim Ross Raw 6 Raw Michael Cole SmackDown! 7 Raw Batista SmackDown! 8 SmackDown! Umaga Raw 9 Raw Kane ECW Kane was ECW Champion when drafted thus making the title Raw exclusive. 10 SmackDown! Mr. Kennedy Raw 11 SmackDown! Triple H Raw Triple H was WWE Champion when drafted thus making the title SmackDown exclusive. ====Supplemental draft==== Pick # Brand (To) Superstar/Diva Brand (From) Notes 1 ECW Mark Henry SmackDown! 2 Raw Jamie Noble SmackDown! 3 SmackDown! Trevor Murdoch Raw 4 SmackDown! Big Daddy V ECW 5 Raw Deuce SmackDown! 6 SmackDown! DH Smith Raw 7 ECW Hornswoggle SmackDown! 8 ECW Super Crazy Raw 9 Raw Chuck Palumbo SmackDown! 10 SmackDown! Brian Kendrick Raw 11 Raw Matt Striker ECW 12 SmackDown! Maria Raw 13 SmackDown! Shelton Benjamin ECW 14 ECW Finlay SmackDown! 15 SmackDown! Carlito Raw 16 Raw Layla ECW 17 Raw Kofi Kingston ECW ==Related pages== *WWE Brand Extension *WWE Draft Lottery *WWE Raw ==References== Category:WWE Raw Category:WWE SmackDown! Category:Extreme Championship Wrestling Category:WWE Drafts Category:Sports in San Antonio, Texas Category:2008 in professional wrestling Category:2008 in Texas Category:21st century in San Antonio, Texas Category:June 2008 events pl:WWE Draft#WWE Draft 2008",
 "title": "2008 WWE draft"
}