{
 "id": "1097402",
 "text": "thumb | 320px | Olive fields in the town of Al-Samou () In the Palestinian territories, olive trees are the main agricultural crop. They are mostly grown to produce olive oil. Olive trees are very important to the economy in the Palestinian territories. In 2014, around 108,000 tons of olives were pressed there. This produced 24,700 tons of olive oil, which sold for a total of $10,900,000. Around families depend on olives for their basic income. Estimates say that olive trees cover 57% of the cultivated land in the Palestinian territories. In 2011, the territories held 7.8 million fruit-bearing olive trees. thumb | 200px | Women pressing olives before 1920. == History == People in the region began cultivating olive trees thousands of years ago. Archaeologists have found prehistoric evidence of olive groves and techniques used to press olives into oil. These finds date back to the Copper Age, specifically between 3600 BC and 3300 BC. In 1982, the () was found off the Turkish coast. Jars of olives were found among the wreckage. Some scholars think the ship carried olives brought from Palestine. This means that olives became a trade commodity in the Bronze Age. == National pride == Many Palestinians view the olive tree as a symbol of nationalism and the tree's connection to the Palestinian land, especially because of its slow growth and longevity. == Settler violence == The destruction of Palestinian olive trees has become a feature of the Israel–Palestine conflict, with regular reports of damage by . thumb | 200px | Picking the fruits of olive trees west of the city of Dura in Hebron Governorate. == Culture == Olive trees are a major part of traditional Palestinian agricultural life. Starting in mid-September, several generations of families pick olives together for two months. All family members participate in the olive-picking season. Many of these families celebrate the harvest season with traditional Palestinian folk music and dancing. Many Palestinian families use different customs during the olive picking season, especially when preparing food. Because women are busy picking olives, these families rely on canned food.قطف ثمار الزيتون، وكالة وفا In recent years, the Ministry of Education and some universities have given students special vacations so they can participate in the olive-picking season with their families. thumb | center | 300px | Olive picking season in Palestine, 2014. == Production == Palestinian olive presses statistics, 2014 Location Total olives/ton Total pressing of olive oil/ton Total value added /million dollars Palestine 10.9 West Bank 9.1 Gaza strip 1.8 == Image Gallery == File:حراثة_الأرض.jpg | Plowing olive trees in the southern West Bank File:تطعيم_أشجار_الزيتون_بالقلم.jpg | Grafting olive trees with pen to obtain a good variety. File:تطعيم_أشجار_الزيتون_بالقلم_بأصناف_جيدة.jpg | Grafting olive trees with good varieties to obtain better production. File:تقليم_أشجار_الزيتون_الكبيرة.jpg | Pruning rejuvenation of large olive trees. == Related pages == * * * == References == Category:Agriculture by country Category:Palestinian culture",
 "title": "Olive cultivation in Palestine"
}