{
 "id": "1097604",
 "text": "Kanyakubja Brahmins are an endogamous Brahmin community mainly found in northern India. They are classified as one of the Pancha Gauda Brahmin communities native to the north of the Vindhyas. ==Origins== The majority of the interviewees assert that the designation of the caste originates from the city of Kannauj, emphasizing that this name signifies a geographical association. The etymology of this caste is solely preserved through genealogies, oral traditions, mythical narratives, and proverbial accounts. ==Social status== In Uttar Pradesh, they are considered the highest class of Brahmins. ==Occupation== Some of the Kanyakubja Brahmins were Priests, Astronomers, Astrologers, teachers while others chose the career of soldier. They formed the best fighting element in Awadh next only to Rajputs. == Military == Kanyakubja Brahmins supplied excellent recruits in the old Bengal Army. There were only two regiments of Brahmins in Bengal Army which recruited exclusively from Kanyakubja Brahmins. It is from this tribe that most of the soldiers in two Brahmin regiments 1st Brahmans & 3rd Brahmans were drawn. Mr. George Campbell gives the following information:-- \"Whether from the example of the Rajputs, or for other reasons, Kanyakubja Brahmins of the Antarvéda and Awadh have taken largely to the profession of arms, not usually much followed by Brahmins in other parts of the country; and beyond their own boundaries in their military character they are reputed the most overbearing and disagreeable of their race. Yet I fancy that it is rather their profession than their natural character, which has attached to them this bad name\". It is still generally believed that the Kanyakubja Brahmins formed the first power in the Bengal Army which mutinied. Considering their numbers and influence, they are to be held chiefly responsible for the atrocities which were committed in Eastern India on East India Company. ==Notable people== === Religious figures === * Bhava Brihaspati, a Shaiva Pashupata ascetic. * Abhinavagupta, Kashmir Shaivism Philosopher * Ramananda, 14th century Vaishnav poet and founder of Ramanandi sect. * Bhagat Parmanand, Vaishnav mystic and saint-poet. * Swaroopanand Saraswati, Indian Religious leader and Former Shankaracharya of Dwarka. === Politicians === * Ravishankar Shukla, first chief minister of Madhya Pradesh * Shyama Charan Shukla, former chief minister of Madhya Pradesh * Atal Bihari Vajpayee, former Prime Minister of India * Bindeshwari Dubey, Former Chief Minister of Bihar. * Dwarka Prasad Mishra, Writer, Journalist and Former Chief Minister of Madhya Pradesh. === Poets/Writers === * Bāṇabhaṭṭa, 7th century Sanskrit writer and poet from Kannauj. * Jayadeva, Sanskrit Poet * Suryakant Tripathi, Indian poet and novelist. * Mahavir Prasad Dwivedi, Indian Hindi writer and editor. * Kavi Bhushan, Court poet of Bundeli king Chhatrasal & Marathi king Shivaji. * Kalash Deva, Poet and personal advisor of Sambhaji === Freedom Fighters === * Chandra Shekhar Azad, An Indian Revolutionary. ==References== Category:Castes Category:Social groups of India",
 "title": "Kanyakubja Brahmin"
}