{
 "id": "1097070",
 "text": "thumb|upright=1.6|Lucia Mondella in “Promessi Sposi” by Alessandro Manzoni with Sperada (1825) The Sperada (or Guazze, guazz in Lombard from coazza, braided hair) is the name used on Lake Como to indicate the female hairstyle popularly used between the 17th and 19th century. Sometimes it is also called raggiera due to its shape. It consists of a series of hairpins arranged radially to hold the braids, turning a way of styling the hair into a showy clothing accessory. The “Sperada” was the hairstyle worn by women between Mandello and Lierna who, upon engagement, declared the end of their adolescence by declaring themselves Promised Brides. The combination of hair and hairpins also locally took the names of giron, speronada or sperada if characterized by thin elements, or coo d'argent with wide elements. == Presence in Literature == The Guazze hairstyle is mentioned in The Betrothed (I Promessi Sposi) by Alessandro Manzoni, where it is described as a common hairstyle among women in Lombardy during the 17th and 18th centuries. == Origin == The Guazze hairstyle originated in Mandello del Lario and Lierna, two towns in the province of Lecco. == Identification in Art == Studies by Riccardo Magnani have identified that the painting of Mona Lisa originally featured a Guazze hairstyle, which has since disappeared over time due to paint corrosion. However, traces of the hairstyle are still evident in the painting. == References == == Bibliography == * Canali, Luciano. (2002). Le donne del Chiostrino: vita quotidiana a Milano nel Quattrocento. Il Mulino. ISBN 978-8815099357. * Fiorani, Francesca. (2003). Il sentimento della bellezza: Da Leonardo a Bellini, la pittura italiana del Rinascimento nelle sue opere capitali. Einaudi. ISBN 978-8806182931. * Rosci, Marco. (2007). Segantini: catalogo generale. Electa. ISBN 978-8837055882. * Spinelli, Andrea. (2015). Tesori d'arte nelle chiese di Brianza. Script. ISBN 978-8899946033. Category:Hairstyles Category:History of fashion Category:Italian culture Category:Lombardy",
 "title": "Sperada"
}