{
 "id": "10974",
 "text": "Brittany Murphy-Monjack (born Brittany Anne Bertolotti; November 10, 1977 – December 20, 2009) was an American actress and singer. She appeared in many movies and was the voice of Luanne on the American television show King of the Hill. Murphy was married to British moviemaker Simon Monjack (1970-2010) from 2007 until her death on December 20, 2009. She died of pneumonia. An overdose of legal drugs also played a part in her death.. == Filmography == Film Film Film Film Year Film Role Notes 1993 Family Prayers Elsie Alternative title: A Family Divided 1995 Clueless Tai 1996 Freeway Rhonda 1997 Bongwater Mary 1997 Drive Deliverance Bodine 1998 Falling Sky Emily Nicholson 1998 The Prophecy II Izzy Direct-to-video release 1998 Zack and Reba Reba Simpson 1999 Drop Dead Gorgeous Lisa Swenson 1999 Girl, Interrupted Daisy Randone 2000 Trixie Ruby Pearli 2000 Angels! Nurse Bellows 2000 Cherry Falls Jody Marken 2000 The Audition Daniella Short subject 2000 Sidewalks of New York Ashley 2001 Summer Catch Dede Mulligan 2001 Don't Say a Word Elisabeth Burrows 2001 Riding in Cars with Boys Fay Forrester 2002 Spun Nikki 2002 Something in Between Sky 2002 8 Mile Alex Latourno 2003 Just Married Sarah 2003 Uptown Girls Molly Gunn 2003 Good Boy! Nelly Voice 2004 Little Black Book Stacy Holt 2005 Sin City Shellie 2005 Neverwas Maggie Blake 2006 The Groomsmen Sue 2006 Love and Other Disasters Emily \"Jacks\" Jackson 2006 Happy Feet Gloria Voice 2006 The Dead Girl Krista Kutcher 2008 The Ramen Girl Abby 2008 Futurama: The Beast with a Billion Backs Colleen (Voice) Direct-to-DVD release 2009 Deadline Alice 2009 Across the Hall June 2009 Abandoned Mary Television Television Television Television Year Title Role Notes 1991 Murphy Brown Frank's Sister 1 episode 1991-1992 Drexell's Class Brenda Drexell 18 episodes 1992 Kids Incorporated Celeste 1 episode 1992 Parker Lewis Can't Lose Angie 1 episode 1993 Almost Home Molly Morgan 13 episodes 1993 Blossom Wendy 1 episode 1994 Frasier Olsen 1 episode 1994 Party of Five Abby 2 episodes 1994-1995 Sister, Sister Sarah 6 episodes 1995 Boy Meets World Trini 2 episodes 1995 The Marshal Lizzie Roth 1 episode 1995 seaQuest DSV Christine VanCamp 1 episode 1995 Murder One Diane \"Dee-Dee\" Carson 1 episode 1996 Double Jeopardy Julia Television movie 1996 Nash Bridges Carrie 1 episode 1996 Clueless Jasmine 1 episode 1997-2009 King of the Hill Luanne Platter (Voice) Various characters (Voice) 226 episodes 1998 David and Lisa Lisa Television movie 1999 The Devil's Arithmetic Rivkah Television movie 1999-2000 Pepper Ann Tank the 8th grader (Voice) 3 episodes 2000 Common Ground Dorothy Nelson Television movie 2009 Tribute Cilla McGowan Television movie 2009 Megafault Dr. Amy Lane Television movie == References == == Other websites == * * Brittany Murphy Tribute Category:Actors from New Jersey Category:American movie actors Category:American television actors Category:Deaths from pneumonia Category:Singers from New Jersey Category:1977 births Category:2009 deaths",
 "title": "Brittany Murphy"
}