{
 "id": "1097205",
 "text": "Zachary Cheyne Edey (born May 14, 2002) is a Canadian professional basketball player. He is a center for the Memphis Grizzlies of the National Basketball Association (NBA). Edey was the consensus National Player of the Year in 2023 and was also a two-time men's Big Ten Player of the Year in 2023 and 2024. Edey is 7 foot 4 inches, making him the tallest player in the history of the Big Ten and one of the tallest people in history. ==Career== ===College=== Edey played high school basketball first at Leaside High School in Toronto before moving to Bradenton, Florida to play at IMG Academy. He would be recruited to Purdue as a three-star recruit. During his first year at Purdue, Edey would be named to the Big Ten All-Freshman Team and would average around 8.7 points, 4.4 rebounds and 1.1 blocks per game. The next year, Edey became the starting center for the Boilermakers. He would be named to the Second Team All-Big Ten Team and would average 14.4 points, 7.7 rebounds, 1.1 assists, and 1.2 blocks per game. Edey would find even more success during his third year. He would tie Purdue's record for most awards when he was named the Big Ten Player of the Week six times over the season. He would also be named Big Ten Player of the Year and Sporting News National Player of the Year at the end of the season. During his last year at Purdue, Edey would record 1000 rebounds in his career, only the second Purdue player to do so. He would also record 2,000 career points, becoming the sixth player in the history of the Big Ten to accomplish it. He would break Purdue's records for double digit scoring in 74 straight games and 55 double-doubles. He would once again be named the Big Ten Player of the Year and would win his second Associated Press College Basketball Player of the Year award in a row. Edey would also be named as a finalist for the John R. Wooden Award. ===Professional=== On June 26, 2024, Edey was selected 9th overall in the first round of the 2024 NBA draft by the Memphis Grizzlies. ==National team== Edey plays for the Canada men's national basketball team. He played for them during the 2021 FIBA Under-19 Basketball World Cup where Canada would win a bronze medal. He would also play for them during the FIBA Basketball World Cup in 2023. During the tournament, he helped Canada defeat France, Germany, and World champions Spain to help Canada clinch a spot in the Olympics for the first time since 2000. Canada would defeat the United States to win the bronze medal. It was Canada's first international medal since 1936. ==References== ==Other websites== *ESPN profile Category:2002 births Category:Living people Category:Canadian basketball players Category:Centers (basketball) Category:Memphis Grizzlies players Category:Sportspeople from Toronto",
 "title": "Zach Edey"
}