{
 "id": "1097398",
 "text": "Brandon Michael Harry Yip (; born April 25, 1985) is a Canadian-Chinese professional ice hockey right winger. He currently plays for the Kunlun Red Star of the Kontinental Hockey League (KHL). He also played parts of six years in the National Hockey League (NHL) for the Colorado Avalanche, Nashville Predators, and Phoenix Coyotes. ==Career== Before playing in the NHL, Yip played parts of 2 seasons with the Coquitlam Express of the British Columbia Hockey League (BCHL) and four years at Boston University with the Terriers. While playing with the Terriers, Yip would be named the Hockey East Rookie of the Year and would win the NCAA Men's Ice Hockey Championship. He was drafted 239th overall by the Colorado Avalanche in the 2004 NHL Entry Draft. On July 22, 2009, Yip signed a one-year; entry level contract with the Colorado Avalanche. On December 19, Yip made his NHL debut in a 5-2 win against the Columbus Blue Jackets. On December 22, he would score his first NHL goal on Jonas Hiller in a 4-2 loss against the Anaheim Ducks. On July 7, 2010, he would sign a two-year; $1.5 million contract extension with the Avalanche. On January 19, 2012, Yip would be claimed off waivers by the Nashville Predators. He would sign with the Predators on June 21, 2012. On July 19, 2013, Yip decided to sign a one-year; two way contract with the Phoenix Coyotes. He would spend time between the Coyotes and their AHL-affiliate team, the Portland Pirates. In 2015 and 2016, Yip move to Germany and would play for Adler Mannheim and Düsseldorfer EG of the Deutsche Eishockey Liga (DEL). On July 26, 2021, Yip signed with Kunlun Red Star of the Kontinental Hockey League (KHL). He made the move because he wanted to reconnect with his Chinese heritage and wanted to play for the China men's national ice hockey team at the 2022 Winter Olympics. ==References== == Other websites == * Category:1985 births Category:Living people Category:Arizona Coyotes players Category:Canadian ice hockey right wingers Category:Chinese ice hockey players Category:Colorado Avalanche players Category:Ice hockey people from Vancouver Category:Lake Erie Monsters players Category:Nashville Predators players Category:Norfolk Admirals players Category:People from Maple Ridge, British Columbia Category:Phoenix Coyotes players Category:Portland Pirates players",
 "title": "Brandon Yip"
}