{
 "id": "1097078",
 "text": "NOW, formerly TGRT and Fox, is a Turkish free-to-air television channel owned by The Walt Disney Company EMEA. Since July 2012, the channel broadcasts in 16:9 (1080i HDTV). == History == The channel was originally TGRT (acronym in Turkish as: 'Türkiye Gazetesi Radyo Televizyonu'; Turkey Newspaper Radio Television) and began broadcasting on 23 April 1993, under İhlas Holding. Between 2001 and 2004, TGRT was owned by Tasarruf Mevduatı Sigorta Fonu before being sold again to İhlas Holding. On 23 July 2006, News Corporation acquired TGRT from İhlas Holding, and was formed by Ahmet Ertegün. The channel was later relaunched as Fox on 24 February 2007. David Parker Reid was the General Manager of Fox Turkey between 2006 and 2009. David Parker Reid, Hakan Etus, Koray Altinsoy, Doğan Şentürk played crucial role as the most senior executives about the establishment of the Fox channel in Turkey. After David Parker Reid's leave, Pietro Vicari served as General Manager from 2009 to 2014. On 26 November 2014, Adam Theiler was appointed as the General Manager of Fox TV. On 12 February 2024, the channel rebranded to Now as a part of Disney's planned phaseout of Fox brand following the acquisition of 21st Century Fox. Unlike other Fox-branded channels, the Turkish counterpart did not rebrand to Star Channel due to there being already a channel called Star TV in Turkey and the Turkish version of FX already existing in the region. == Programs broadcast by Now == === Weekly series === It is a list of television programs that have been broadcast on Now before or are currently being broadcast. * 2023: Ruhun Duymaz (Love Undercover) (Ended) * 2023: Yaz Şarkısı (Melody Love) (Ended) * 2023: Kısmet (The Fate) (Ended) * 2023: Yabani (Wild Heart) (Tuesday at 20:00) * 2023–: Bambaşka Biri (Someone Else) (Mondays at 20:00) == References == == Other websites == * Category:2000s establishments in Turkey Category:2007 establishments in Asia Category:2007 establishments in Europe Category:2007 in television Category:Turkish culture",
 "title": "NOW (Turkish TV channel)"
}