{
 "id": "1098932",
 "text": "Robert Rogers was a soldier in British North America. He fought for the British Empire in the Seven Years' War and the American Revolutionary War. == Early life == Rogers was born in Massachusetts in 1731. His family moved to New Hampshire eight years later. In 1746, when he was 15, Rogers fought for the British in King George’s War. After the war, when Rogers was 23, he was arrested for counterfeiting. == Military service == One year later, the French and Indian War started, and Rogers joined the British. In 1756, he started to convince other people to join too. Rogers started a militia called Rogers’s Rangers with people who were born in North America and knew how to fight in it. Rogers paid the Rangers himself. In 1758, Rogers was promoted to Major. One year later, General Jeffrey Amherst told Major Rogers to attack a town called Saint-Francis where a lot of Abenaki lived. So Rogers attacked Saint Francis and burned down everyone’s houses there with the Abenaki inside them. Rogers fought against French Canadians and Indians until 1760, when he stopped. In 1761, he left to get married. == Pontiac’s Rebellion == Rogers rejoined General Amherst two years later to fight against Pontiac. Rogers later wrote a play about it and made Pontiac the hero. == After the War == Rogers borrowed a lot of money to pay his rangers and tried to pay his debt by gambling but lost and went to jail in New York, but Rogers escaped. He then went to England. == Great Britain == In England, Rogers wrote a book about North America and a play about Pontiac’s Rebellion with Pontiac as the hero. He also met with King George III and said he could find the Northwest Passage. King George made him a Governor in Michigan. == Governorship in Michigan == Rogers hired men to sail to sea and find The Northwest Passage. They didn’t find it. General Thomas Gage hated Rogers because Rogers was a friend of Amherst. Gage and a man named Nathaniel Potter said that Rogers was a spy for France and had him arrested for treason. Amherst later got Rogers freed from prison, but Rogers couldn’t be Governor any more, so Rogers started borrowing money again and ended up in jail for debt again. After he was freed, Rogers sued Gage. == American Revolution == After the Revolution started, Rogers came to General Washington and asked to be an Officer. Washington thought Rogers was a spy and had him arrested. Rogers escaped. Rogers joined the British to get revenge against Washington. Rogers became a Colonel. Colonel Rogers started a new militia called The Queen’s Rangers. Rogers tricked Nathan Hale into admitting that he was a Rebel spy by pretending to be another Rebel spy. In 1777, the British fired Colonel Rogers for being too sick to command the Rangers and replaced him with John Graves Simcoe. == King’s Rangers == Rogers returned to Great Britain and was sent back to America, where Sir Henry Clinton put him in charge of a militia called The King’s Rangers. Because Colonel Rogers got drunk, Clinton fired him and replaced him with his brother, James Rogers. Rogers was captured by American pirates and escaped. Rogers left America with the British in 1783. == After the war == After the war, Rogers started to get drunk and died from drinking too much alcohol in 1795. ==References== Category:1731 births Category:1795 deaths Category:British in the American Revolutionary War Category:Military people from Massachusetts Category:Seven Years' War",
 "title": "Robert Rogers (British Army Officer)"
}