{
 "id": "1098748",
 "text": "Tony Hawk's Pro Skater 2 is a skateboarding video game. It was published by Activision and was developed by Neversoft. It is the second game in the Tony Hawk's series. It was released on September 19, 2000 for the PlayStation. It was also released on October 24, 2000 for Windows, with a Game Boy Color version being released on November 7, 2000 and a Dreamcast version on November 7, 2000. The game would later be released on the Game Boy Advance on June 11, 2001, Mac OS on May 31, 2001, Nintendo 64 on August 21, 2001, and much later on iOS on April 1, 2010. The player can play as Tony Hawk and twelve other professional skateboarders. The player can also play as the superhero Spider- Man as an unlockable character. In South Korea and other versions in Asia, members of the girl group Fin.K.L are unlockable. Like most games in the series, the player can do skateboarding tricks and grinds to boost their score while skating around the level. There are also objectives in the game such as getting a certain amount of score from tricks, collecting letters that spell out SKATE, and collecting secret tapes. Players can also create their own levels to skate on with the Level Editor mode. It is the sequel to the 1999 game Tony Hawk's Pro Skater. A sequel titled Tony Hawk's Pro Skater 3 was released on October 30, 2001. A remake of both Pro Skater and Pro Skater 2 was released on September 4, 2020. ==Reception== The game was well liked by game critics. Critics said that they liked the visuals, controls, graphics, levels, soundtrack, and framerate. Tony Hawk's Pro Skater 2 sold very well too. When it was released, the game was the best-selling game on the PlayStation for two weeks straight. It was also given Platinum status by the Entertainment and Leisure Software Publishers Association (ELSPA) for selling over 300,000 copies in the United Kingdom. The game was placed on multiple Best Games lists. It was also named Video Game of the Year 2000 by Electronic Gaming Monthly, as well as Best Nintendo 64 Game and Best Sports Game (Alternative) by GameSpot. The game would win a Guinness World Records for selling over 2 million units and becoming the best-selling action sports video game. ==References== Category:2000 video games Category:Tony Hawk video games Category:Neversoft games Category:Treyarch games Category:Vicarious Visions games Category:Classic Mac OS games Category:Dreamcast games Category:Game Boy Advance games Category:Game Boy Color games Category:IOS games Category:Multiplayer and single-player video games Category:Nintendo 64 games Category:PlayStation games Category:Single-player video games Category:Skateboarding video games Category:Video game sequels Category:Video games developed in Japan Category:Video games developed in the United States Category:Video games set in France Category:Windows games",
 "title": "Tony Hawk's Pro Skater 2"
}