{
 "id": "10985",
 "text": "Cairo (, usually transliterated as Al-Qāhirah) is the capital and largest city in Egypt. The city name can be translated as the one who won. Cairo has 7,947,121 people. About 17,290,000 people live in its urban area. This makes it the biggest city of the Arab World. It also is the city with the biggest urban area in Africa The city is on the Nile River. == Geography == === Climate === The city of Cairo has a hot desert climate (BWh), meaning it has a hot, sunny and dry climate a year long. The city, however, has more humidity than other cities with the hot desert climate (BWh). ==History== The area around the city was an important focal point of Ancient Egypt. In 968, the Fatimids entered Egypt and they made Cairo the capital of their caliphate.Beeson, Irene. \"Cairo, a Millennial,\" Saudi Aramco World. September/October 1969, pp. 24, 26-30. The Al Azhar mosque and university was made in 972. This became the world's oldest university. It is the most widely known seminary in the Islamic world.Hedges, Chris. \"What's Doing in Cairo,\" New York Times. January 8, 1995. In 1992, Cairo was devastated by a 5.8 magnitude earthquake that caused 545 deaths, injuring 6,512, and made 50,000 people homeless, the most destructive since 1847. ==Tourism== The great pyramids of Giza and the step pyramid of Sakkara are just outside of the city. The Egyptian Museum holds the world’s largest collection of antiquities from the time of the ancient Pharaohs. Many treasures from the tomb of King Tutankhamun are in this museum. == Famous Cairenes == People from Cairo are called 'Cairenes'. * Abu Sa'id al-Afif - Fifteenth Century Samaritian * Boutros Boutros-Ghali, former Secretary-General of the United Nations * Naguib Mahfouz, novelist, Nobel Prize in Literature in 1988. * Mido, Professional soccer player with Middlesbrough F.C * Mohamed ElBaradei, Director General of the International Atomic Energy Agency 2005 Nobel Peace Prize laureate * Naguib Sawiris, 62nd richest person on earth in a 2007 list of billionaires, reaching US$10.0 billion with his company Orascom Telecom Holding * Farouk El Baz, a great contributor to NASA * Sir Magdi Yacoub, leading cardiologist, knight * Constantin Xenakis (1931) Greek artist * Voula Zouboulaki (1931) Greek actress ==References== ==Sources== * Hedges, Chris. \"What's Doing in Cairo,\" New York Times. January 8, 1995. == Other websites == * * * Cairo information at yatb.info * Blog about Cairo * Places in Cairo Category:Capital of Egypt",
 "title": "Cairo"
}