{
 "id": "1098777",
 "text": "Tony Hawk's Underground 2 is a skateboarding video game. It was published by Activision and was developed by Neversoft. It is the sixth game in the Tony Hawk's series. It was released on September 19, 2000 for the GameCube, PlayStation 2, Xbox, Windows, and Game Boy Advance. It was also released on November 10, 2004 for Mobile. In the game, Tony Hawk and Bam Margera split into teams and compete around the world to see who will pay for the costs of a skateboarding tour that they're going to put on called the World Destruction Tour. Like most games in the series, the player can do skateboarding tricks and grinds to boost their score while skating around the level. There are also objectives in the game such as getting a certain amount of score from tricks, collecting letters that spell out SKATE, and collecting secret tapes in the Classic Mode. It is the sequel to the 2003 game Tony Hawk's Underground. A PlayStation Portable version titled Tony Hawk's Underground 2: Remix was released on March 24, 2005. ==Reception== The game was liked by game critics. Critics said that they liked the levels, aesthetics, and soundtrack. However, they had mixed feelings on the story as some liked it and some didn't. They also criticized the tricks the skaters can perform because they didn't change much from the last game. The game won Console Action Sports Game of the Year at the 8th Annual Interactive Achievement Awards in 2005. ==References== Category:2004 video games Category:Tony Hawk video games Category:Activision video games Category:Neversoft games Category:Vicarious Visions games Category:Game Boy Advance games Category:Multiplayer and single-player video games Category:Nintendo GameCube games Category:PlayStation 2 games Category:PlayStation Portable games Category:Single-player video games Category:Skateboarding video games Category:Video game sequels Category:Video games developed in the United States Category:Windows games Category:Xbox games",
 "title": "Tony Hawk's Underground 2"
}