{
 "id": "1098231",
 "text": "After the Fox () is a 1966 English-Italian heist comedy movie directed by Vittorio De Sica and starring Peter Sellers, Victor Mature and Britt Ekland. ==Plot== Outside of Cairo, Okra uses their sidekick in a bikini as a distraction to steal $3 million in gold bullion. The thieves need to get the two tons of gold bars into Europe. Aldo Vanucci is very good at hiding himself. He is known as The Fox. He is one of the only people who can do the job, but he is in prison. Vanucci doesn't want to accept the job because he is afraid of being a disappointment to his mother and young sister Gina. His three sidekicks tell him that Gina got older and sometimes doesn't come home after school. Vanucci is very mad and decides to escape. He pretends to be the prison doctor to run away with his gang helping him. His mother tells him that Gina was working on the street. He thought it meant that she was a prostitute. He finds out that she was just in a cheap movie on the Via Veneto. Vanucci realizes that helping to move the gold would make his family better. He talks to Okra and his woman sidekick, and he agrees to move the gold to Italy. He wants half of the money. Two policemen follow Vanucci, but he is able to escape them. Vanucci sees a crowd mob the old American celebrity Tony Powell. He realizes that people really like movie stars and they can do whatever they want. That forms his plan. He acts like an Italian neo-realist director named Federico Fabrizi. His plan is to bring the gold to Italy as a part of an avant-garde movie. He got Powell to be an actor in the movie so that it would look more real. He called it The Gold of Cairo (a play on De Sicas 1954 film The Gold of Naples). Powell's agent, Harry, doesn't trust Fabrizi. Powell wants to do the movie, though. Fabrizi has the people of Sevalio, a small fishing village, unload the cargo. The boat carrying the gold is delayed, so Fabrizi has to make parts of his fake movie so that people will believe him. The ship finally came, and the citizens unloaded the gold. However, Okra betrays Vanucci and leaves with the gold. A slapstick car chase happens. Okra, Vanucci, and the police all crash into each other. People think that Vanucci, Tony Powell, Gina, Okra, and the villagers are all a part of the stealing. Vanucci's \"movie\" is used as evidence in court. A film critic says the random parts of the movie are very good. Vanucci says he did the crime, so the villagers are free. He still wants to escape from prison again. He does it by acting like the prison doctor again. This time he ties up the doctor in his cell. But when he attempts to remove his fake beard, Vanucci discovers that the beard is real and says, \"The wrong man has escaped!\" ==Cast== *Peter Sellers as Aldo Vanucci / Federico Fabrizi *Victor Mature as Tony Powell *Britt Ekland as Gina Vanucci / Gina Romantica *Martin Balsam as Harry Granoff *Akim Tamiroff as Okra *Vittorio De Sica as himself *The band The Hollies sang the title song together with Peter Sellers. *Maurice Binder made the animated title. He is famous for making the titles of the James Bond movies. *Some of the movie was made in Sant'Angelo while a lot of tourists were there. The villagers in Sant'Angelo were very busy. The people making the movie had to use people from other places. ==References== Category:1960s English-language movies Category:1966 comedy movies Category:Criminal comedy movies Category:Italian-language movies Category:Movies directed by Vittorio De Sica Category:Movies set in Rome",
 "title": "After The Fox"
}