{
 "id": "1098116",
 "text": "Alhaji Auwalu Abdullahi Rano (born 7 February 1974), also known as AA Rano, is a businessman from Nigeria. He founded AA Rano Industries Rano Nigeria Limited, a company involved in different industries, including oil and gas, airlines, and agriculture. Rano is from the Rano Local Government Area of Kano South, in northern Nigeria. His net worth is estimated to be 3 Billion US Dollars. == Early life == Rano was born in Lausu town in the Rano Local Government Area of Kano State, Nigeria. He is a member of the Hausa-Fulani ethnic group. His business career started with the sale of ice blocks, groundnut oil, and other local items. == Business career == AA RANO OIL has 56 M/l tank farm in Lagos, with 120 Retail outlet/ Filling stations across Nigerian and over 600 trucks. The company also provides jetty services to other depot owners around its depot located at Ijegun-Egba as well as other services to oil marketers. A Rano Nigeria Limited’s core business is the wholesale and retail of PMS, DPK, AGO, LPG. RANO AIR is one of the subsidiaries of the Rank industries, the Airline, founded in 2019,The airline have Secured approval to operate return flights domestically to from Lagos, Kano, Abuja, Kaduna, Sokoto, Gombe, Yola, Maiduguri, and Asaba. RANO GAZ is one of the subsidiaries of AA Rano industries. The Company has strengthened its LPG business with the installation of fully automated modern and movable LPG filling plants and skids across the states and the federal capital territory. RANO LUBRICANTS Another subsidiary of the AA Rano industries is the Rano lubricant which produces quality base oil, industrial Oil and Engine oil which are used in Motor vehicles, trucks, Motorcycle and tricycle, Gasoline Generators and aero plane Oil. These products are quality produce for engine performance and environmental friendliness. RANO RICE MILLS Expanding its frontiers to augment government effort in area of food security, the AA Rano industries had established in 2021 a rice milling Company in Dawakin Kudi Local Government Area of Kano state with an annual production capacity of 6000000M7T. AA RANO DEPOT TERMINAL was licensed in April 2014. The bounded White Petroleum products terminal is designed to receive vessels, store products and dis- tribute via trucking across the Nigeria states The company also provides jetty services to other depot owners around its depot located at Ijegun-Egba. == Philanthropy == AA Rano established the AA Rano Foundation, a non-governmental and non-profit organisation. The foundation carries out community development projects in areas such as health, education, water provision, and empowerment initiatives for youth and women. == References == == Other websites == * Category:1974 births Category:Living people Category:Nigerian billionaires Category:20th-century Nigerian businesspeople Category:21st-century Nigerian businesspeople Category:People from Kano State Category:Businesspeople from Kano Category:Recipients of the Order of the Niger Category:Nigerian company founders",
 "title": "Auwalu Abdullahi Rano"
}