{
 "id": "1098360",
 "text": "Emma Swan is a character from the TV show (series) Once Upon a Time. She is based on The Ugly Duckling from the Hans Christian Andersen story. She is played by Jen Morrison. Emma is the daughter of Prince Charming and Snow White. In the show, when she was a baby, her parents sent her away to the real world. They thought she was the chosen One who could break the spell (grimoire) of the Evil Queen so they wanted to keep her safe. She ran away from different orphanages, then started to call herself Emma Swan, instead of Emma. She did this because it is like the story The Ugly Duckling. She later started stealing with her boyfriend. She had sex with him and then he ran away and left her in prison. At 18 years old She gave birth and gave out her son to be adopted. She then became a Bounty hunter. == Role in Season One == On her 28th birthday, Emma is visited by a 10-year-old boy who says he’s her son, Henry Mills. Henry tells her that she’s the Chosen One who will break the spell, but Emma doesn’t believe in magic. She takes Henry back to his adoptive mother, Regina, in Maine. Regina is mean to Emma, so Emma decides to stay in town to annoy her. Regina gets Emma kicked out of her hotel, which causes her to move in with Henry’s teacher, Mary-Margaret Blanchard. Emma gets a job working as a Deputy for the Sheriff. After Regina murders the sheriff, Emma makes a deal with Mister Gold to win the election. Gold sets Regina’s house on fire, but Emma saves Regina, exposes Gold, and then gets elected. Gold planned for this. Regina and Gold kidnap a woman named Katherine Nolan and framed Mary-Margaret for murder, so Emma tries to prove Mary-Margaret is innocent. When Katherine shows up alive, Emma decides to prove Regina is a criminal. Emma kidnaps Henry to take him out of town and leave forever, but he goes back to the town. Emma leaves town without Henry and Regina gives her an Apple turnover to eat. Henry stops her from eating it by eating it himself; it turns out it’s poisoned. After that, Emma realizes that Regina is the Evil Queen. They work together to save Henry, but Rumpelstiltskin betrays them. Emma kisses Henry since he’s her son, and she loves him. Because of that, Henry wakes up and everyone in town gets their memories back. == Role in Season Two == After everyone gets their memories back, Emma stops the people from killing Regina because she’s Henry’s adoptive mother. Rumpelstiltskin sends a Wraith to kill Regina but Emma and Mary-Margaret stop it. It kidnaps them and takes them to a forest where they meet Mulan, Princess Aurora and Regina’s mother The Queen of Hearts and Captain Hook. Captain Hook helps Emma and Mary- Margaret steal a magic bean from The Beanstalk because he wants to use it to go to the real world so he can kill Rumpelstiltskin. Emma betrays Captain Hook, so Hook goes back to The Queen of Hearts and helps her go to the real world. Emma convinces Regina to pretend to be the person who killed Jiminy Cricket so she can find out who did it. It turns out to be The Queen of Hearts, so Mary-Margaret kills her, and Regina is angry about that. Captain Hook shoots Belle and Rumpelstiltskin tries to kill him, but then they’re both hit by a car. Emma gets Doctor Whale to fix Hook but finds out Doctor Whale is Victor Frankenstein. Rumpelstiltskin asks Emma and Henry to help him find his son. == Role in Season Three == Rumpelstiltskin’s son Baelfire turns out to be a man named Neal Cassidy. Neal is Emma’s boyfriend, who got her pregnant when she was eighteen. When Emma and Henry return to the town with Neal, Henry is kidnapped by two people who want to destroy magic. Emma, Captain Hook, Rumpelstiltskin and Regina go to Neverland to rescue Henry from Peter Pan. Regina teaches Emma to do magic. Rumpelstiltskin kills Pan, but Peter Pan casts a grimoire to send everyone back to the Fairy Tale world. So Regina also casts a grimoire so that Emma and Henry stay in the real world. Emma remembers having kept Henry, and Henry remembers having grown up as her son. Emma starts dating a man named Walsh. Then Captain Hook comes and gives Emma her memories back while Walsh turns into a monkey. Emma helps Regina stop the Wicked Witch of the West, who casts a Time travel spell that sends Emma and Captain Hook to the fairy tale world in the past. Emma pretends to be a princess named Princess Leia. She and Captain Hook make a deal with Rumpelstiltskin to go back to the future, and they accidentally bring Maid Marian with them. They also accidentally bring The Snow Queen but stop her from destroying the town by introducing her to Queen Elsa. == Role in Season Four == Emma dates Captain Hook and finds out he was mind controlled into helping Rumpelstiltskin, so she (and everyone else) has Rumpelstiltskin kicked out of town. Rumpelstiltskin comes back with Ursula, Cruella de Vil and Maleficent, so Emma asks Regina to spy on them for her and finds out that they want to find the person who wrote their stories so they can make him give them happy endings. When Emma and Regina find the Author, whose name is Isaac Heller, he makes a deal with Rumpelstiltskin and traps everyone inside a magic book and puts Emma in a Dungeon. Henry Mills and Captain Hook rescue Emma, and Henry rescues everyone by becoming the new Author. The Darkness leaves Rumpelstiltskin, and Emma stops it from killing Regina by putting it in herself and becoming the new Dark One. == Role in Season Five == Emma goes to Camelot to stop being the Dark One, and everyone else follows her. Captain Hook almost gets killed, so Emma saves him by turning him into another Dark One and erases everyone else’s memories so they don’t know. When Hook finds out, he wants to kill Rumpelstiltskin, but Emma convinces him not to do that. Captain Hook convinces her to put all of her Darkness inside him and then kills himself to destroy the Dark One, but Emma finds out that Rumpelstiltskin stole his powers from him and is the Dark One again. Emma decides to go to Hades to rescue Captain Hook. Emma rescues Captain Hook, but Hades follows them to the real world, where the Wicked Witch of the West kills him. Henry Mills runs away to destroy magic. Emma and the others run after him and get trapped in the Land of Untold Stories, where they meet Dr Jekyll and Mister Hyde. Henry rescues them. Regina uses Dr. Jekyll’s Drug to turn herself into two people, one good and one evil. == Role in Season Six == The Evil Queen hears Emma tell Aladdin that she wishes she were never the The Chosen One, so the Evil Queen steals Aladdin’s lamp and wishes Emma’s wish would come up true so Emma disappears. Regina tells the Evil Queen she also gets wishes because they’re the same person. So Regina wishes to be sent wherever Emma goes and goes to a world where Emma is a singing princess. Regina kidnaps that world’s version of Emma’s parents to get her to fight, and when that doesn’t work, she kills them both. The other world’s Henry Mills tries to kill Regina for revenge, but Regina doesn’t fight back, so Emma gets her memories back. Emma rescues Regina, and they make a deal with Rumpelstiltskin to get out and go back to the real world. Emma marries Captain Hook. Emma discovers that Rumpelstiltskin’s mother, The Black Fairy, is trying to destroy the world. Emma stops the Black Fairy by learning to believe in things again. == Role in Season Seven == Emma helps Henry Mills in the series finale. == References == * * Category:Television characters",
 "title": "Emma Swan"
}