{
 "id": "1098053",
 "text": "The thorny tree frog or thorny bush frog (Gracixalus lumarius) is a frog. It lives in Vietnam. People have seen it between 1700 and 2160 meters above sea level. ==Appearance== The adult male frog is 38.9 - 41.6 mm long from nose to rear end and the adult female frog is about 36.3 mm long. Its head is wider than it is long and it has a round nose. The nose holes stick out a little. It has thick, strong front legs and there are large disks on its toes for climbing. The eardrum is hard to see. The male frog has cone-shaped white bumps on its body. They are easier to see when it is time for the male to find a female to mate. Unlike most frogs in Gracixalus, this frog changes color. During the day, the skin of the frog's back is brown in color. At night, it is yellow in color. Its belly and the front of its neck are pink. The tips of the toes and the webbed skin on the feet are pink-gray in color. The sides of the body are bright yellow in color. The iris of the eye is gold in color with black lines in it. The black lines are the same distance apart. ==Home and threats== The frog lives in trees. It lives in bamboo forests and evergreen forests. The female frog lays eggs on the inside walls of plants with water in them called phytotelma. The eggs have two layers of jelly on them to protect them. Scientists believe these frogs hatch into tadpoles that swim and not small frogs, but they have not seen the tadpoles as of 2015. Scientists think the frogs need the phytotelma and cannot lay eggs anywhere else. Scientists believe this frog is in danger of dying out because it lives in such a small place. One of the places this frog lives is a protected park: Ngoc Linh Nature Reserve in Kon Tum Province. Human beings change the places where the frog lives. They cut down the forests where the frog lives to build big farms for coffee, tea, rubber and other things to grow and sell. They also build mines to get good rocks and metals, for example gold, out of the ground. Scientists think that people might also catch the frog to sell as pets because it is so beautiful and colorful, but they are not sure whether this has really happened yet. ==Name== Scientists named this frog lumarius because that it is the Latin word for \"of thorns.\" They gave it this name because the white bumps on its body look like thorns. ==First paper== * ==References== Category:Frogs of Asia",
 "title": "Gracixalus lumarius"
}