{
 "id": "1098369",
 "text": "Luis Martínez (born September 26, 1982), better known by his ring name Damian Priest, is a Puerto Rican-American professional wrestler signed to WWE, where he performs on the Raw brand. He is a former member of the stable The Judgment Day and a former one-time World Heavyweight Champion. Martínez is also known for his work in Ring of Honor (ROH) under the ring name Punishment Martinez, where he is a former ROH World Television Champion. He also worked in Japan through ROH's working relationship with New Japan Pro-Wrestling (NJPW). In WWE, Priest also won the NXT North American Championship and the WWE United States Championship once each, the Raw and SmackDown Tag Team Championships twice each (as the Undisputed WWE Tag Team Championship) with Finn Bálor, and the 2023 Men's Money in the Bank ladder match. He then became the second man after Seth Rollins to cash in his Money in the Bank contract at WrestleMania. He defeated Drew McIntyre on the second night of WrestleMania XL on April 7, 2024 to win his first World Heavyweight Championship. ==Championships and accomplishments== *Keystone Pro Wrestling **KPW Tag Team Championship (1 time) – with Matthew Riddle *Monster Factory Pro Wrestling **MFPW Heavyweight Championship (3 times) **MFPW Tag Team Championship (2 times) – with Brolly (1) and Q. T. Marshall (1) **MFPW Invitational Cup (2016) *New York Post **Faction of the Year (2023) *Pro Wrestling Illustrated ** Faction of the Year (2023) **Ranked No. 71 of the top 500 singles wrestlers in the PWI 500 in 2023 *Ring of Honor **ROH World Television Championship (1 time) **Survival of the Fittest (2017) *WWE ** World Heavyweight Championship (1 time) ** WWE United States Championship (1 time) ** WWE Raw Tag Team Championship (2 times) – with Finn Bálor ** WWE SmackDown Tag Team Championship (2 times) – with Finn Bálor ** NXT North American Championship (1 time) ** Men's Money in the Bank (2023) ** Slammy Award (1 time) *** Faction of the Year (2024) – as a member of The Judgment Day * Wrestling Observer Newsletter ** Worst Match of the Year (2021) ==References== ==Other websites== * * * Category:1982 births Category:American professional wrestlers Category:Living people Category:Puerto Rican professional wrestlers Category:Sportspeople from New York City Category:WWE wrestlers",
 "title": "Damian Priest"
}