{
 "id": "1098348",
 "text": "This is a list of countries with areas which straddles more than one continent, known as transcontinental countries or intercontinental countries; currently, only two types of transcontinental countries exist: bicontinental countries, spanning into two continents, and tricontinental countries, spanning into three continents. Contiguous transcontinental countries are states that have any continuous or seriously area which spans any continental boundary, most commonly the line that separates Europe and Asia. By contrast, non-contiguous transcontinental countries are those states that have any territory separated by any body of water or other country (such as in the case of France). Most non-contiguous transcontinental countries are countries with dependencies like United Kingdom with its overseas territories, but can be countries which have former dependencies as a fully part of their state like France with its overseas regions. The seven-continent model has been recognized by most English-speaking countries. For instance, the Americas and Afro-Eurasia are considered separate continents. Zealandia is always not included as a continent, even though Zealandia is a continent discovered in 2017. == Definition == * Transcontinental countries are countries with territory in two or more continents. * There are contiguous transcontinental countries, non-contiguous transcontinental countries, and countries that may or may not be transcontinental based on one's interpretation of what the continents are. * Russia, Kazakhstan, Turkey, and Egypt are contiguous transcontinental countries. * Most non-contiguous transcontinental countries are countries with overseas territories. ==Countries in Europe and Asia== * : The rayon of Qusar is located in Europe while the rest of the country is located in Asia. * : The 3 municipalities of Kazmegi, Dusheti and Akhmeta are located in Europe while the rest of the country is located in Asia. * : Kazakhstan is divided by the Ural River, most of the province of Western Kazakhstan is located in Europe, while the rest is located in Asia. * : Russia is divided by the Ural Mountains and the Ural River. It's capital, and most of its population is located in Europe, while 30 million people live in the Asian part of Russia. * :Turkey is divided by Istanbul, which spams into two continents: Europe and Asia. Its capital and most of its population live in the Asian part, while a decent population live in the European part. ==Countries in Asia and Africa== * : Egypt is divided by the Sinai peninsula. Most of its people live in the African part, while few people live in the Asian part. * : Yemen includes, besides the Continental Yemen, the island of Socotra. most of its people live in the mainland, while few people live in the island of Socotra. ==Countries in Europe and North America== * : The Kingdom of Denmark includes, besides the Denmark proper and the Faroe Islands in Europe, the North American island of Greenland. Said territory is not part of Metropolitan Denmark, although it is administered by the metropolis itself. This brings a similar case to the United Kingdom with its overseas territories. Greenland was part of Danish metropolis and within the European Union's territory, but voted for autonomy and is now excluded from EU. However, those overseas territories are officially considered an integral part of the Kingdom of Denmark. * : Iceland is an island country divided between the North American plate and the Eurasian plate by the Mid-Atlantic ridge. It is located beetwen the North Atlantic and Arctic Oceans, and mostly south of the Arctic circle, with only the northernmost points and the island of Grímsey in the Arctic Circle. ==Countries in Europe and Africa== * : Spain includes the cities of Ceuta and Melilla and the Canary Islands. Most of its territory and population is located in Europe, while a few people live in the African parts. * : Italy includes Pantelleira and the Pelagie islands. Most of its territory and population is located in Europe, while very few people live in the African parts. ==Countries in Asia and Oceania== * : The provinces of West Papua, and Papua Province are located in Oceania. Most of its population and territory is in Asia, well about 50 million people live in the Oceanic part. ==Countries in North America and Oceania== * : The United States includes, besides the contiguous United States and Alaska in North America the oceanic state of Hawaii. Most of its population and territory is located in North America, while 1 million people live in the oceanic part. ==Countries in South America and Oceania== * : Ecuador includes the Galapagos Islands. Most of its territory and population is located in South America, while a few people live in the oceanic part. ==Countries in three or more continents== * : The United Kingdom itself is located entirely within Europe. However the United Kingdom is the name for one undivided Kingdom, all the territories of the United Kingdom are divided by all continents. These include Anguilla, the British Virgin Islands, Bermuda, the Cayman Islands, Montserrat and the Turks and Caicos Islands in North America, the Falkland Islands and the South Georgia and the South Sandwich Islands in South America, Saint Helena, Ascension and Tristan da Cunha in Africa, the British Antarctic Territory in Antarctica, Akrotiri and Dhekelia in Asia and the Pitcairn Islands in Oceania. * :The territories of the French Republic are separated by all the continents, these include Clipperton Island, Guadeloupe, Martinique, Saint Barthélemy, Saint Martin and Saint Pierre and Miquelon in North America, French Guiana in South America, the Crozet Islands, Mayotte, Réunion and the Scattered Islands in Africa, Adelié Land in Antarctica, the Kerguelen Islands and the Saint Paul and Amsterdam Islands in Asia, and French Polynesia, New Caledonia and Wallis and Futuna in Oceania. Most of its people are located in Europe while few people live in said parts. * : The Portuguese Republic consists of 3 territories: the Continental Portugal the Azores archipelago and the Madeira archipelago. most of its territory and population is located in Europe, while very few people live in the North American and African parts. ==Claims== * : Chile includes Easter Island in Oceania and the Chilean Antarctic territory in Antarctica. Most of its territory and population is located in South America, while a few people live in the oceanic and Antarctic parts. * : Argentina includes Argentine Antarctica in Antarctica. Most of its population is located in South America, while a few people live in the Antarctic part. ==Other examples== Transcontinental countries",
 "title": "List of transcontinental countries"
}