{
 "id": "1098762",
 "text": "\"I Don't Wanna Cry\" is a song recorded by American singer-songwriter Mariah Carey for her eponymous debut album. Written by Carey and producer Narada Michael Walden, Columbia Records released it as the album's fourth single in April 25, 1991. It became her fourth number one hit single. ==Credits and personnel== Credits adapted from the liner notes of Mariah Carey. ===A-side: \"I Don't Wanna Cry\"=== Locations Personnel Publishing ===B-side: \"You Need Me\"=== Locations Personnel Publishing ==Charts and certifications== 1991 weekly chart performance Region – Chart (Publisher) Peak position Australia – Singles (ARIA) 49 Canada – Retail Singles (The Record) 7 Canada – Contemporary Hit Radio (The Record) 2 Canada – Hit Tracks (RPM) 2 Canada – Adult Contemporary (RPM) 2 New Zealand – Singles (RIANZ) 13 US – Hot 100 Singles (Billboard) 1 US – Hot Adult Contemporary (Billboard) 1 US – Hot R&B; Singles (Billboard) 2 US – Top 40 Radio Monitor (Billboard) 4 US – Top 100 Singles (Cash Box) 1 US – Top R&B; Singles (Cash Box) 4 US – Adult Contemporary (Gavin Report) 2 US – Top 40 (Gavin Report) 1 US – Top 40/Urban Crossover (Gavin Report) 1 US – Urban Contemporary (Gavin Report) 3 US – Adult Contemporary (Radio & Records) 1 US – Contemporary Hit Radio (Radio & Records) 1 US – Urban Contemporary (Radio & Records) 1 1991 year-end chart performance Region – Chart (Publisher) Position Canada – Retail Singles (The Record) 58 Canada – Hit Tracks (RPM) 21 Canada – Adult Contemporary (RPM) 15 US – Hot 100 Singles (Billboard) 26 US – Hot Adult Contemporary (Billboard) 10 US – Hot R&B; Singles (Billboard) 72 US – Top 100 Singles (Cash Box) 14 US – Top R&B; Singles (Cash Box) 37 US – Adult Contemporary (Gavin Report) 15 US – Top 40 (Gavin Report) 7 US – Urban Contemporary (Gavin Report) 33 US – Adult Contemporary (Radio & Records) 8 US – Contemporary Hit Radio (Radio & Records) 7 US – Urban (Radio & Records) 31 List of certifications Region (Organization) Units (Certification) United States (RIAA) 500,000 (Gold) ==Notes== ==References== ===Books=== * * * * * * * * * * * Category:1991 songs Category:1990s ballads Category:Mariah Carey songs Category:Billboard Hot 100 number one songs Category:Pop songs Category:Pop ballads Category:Soul songs Category:Soul ballads Category:R&B; songs Category:R&B; ballads",
 "title": "I Don't Wanna Cry"
}