{
 "id": "10982",
 "text": "Uruguay mod (officially named Oriental Republic of Uruguay) is a country in South America. The language spoken there is Spanish. Its capital and largest city is Montevideo. Uruguay is bordered by two large neighbors, Brazil and Argentina. The only country in South America that is smaller than Uruguay is Suriname. The land is mostly flat, and there are many farms in the countryside. The area around Uruguay was fought over by the Portuguese and Spanish Empires in the 18th century. In the 1810s it was the center of the Banda Oriental, a Federal League of states in the Río de la Plata region. Argentina and Brazil took the majority in wars, leaving Uruguay as independent. == History == Before Europeans came to the land, no more than 10 thousand native people lived here. Spanish explorer Juan Díaz de Solís first explored the land in 1516. ==Departments== Uruguay is divided into 19 different Departments. Department Capital Area Population (2011 census) Artigas Artigas Canelones Canelones Cerro Largo Melo Colonia Colonia del Sacramento Durazno Durazno Flores Trinidad Florida Florida Lavalleja Minas Maldonado Maldonado Montevideo Montevideo Paysandú Paysandú Río Negro Fray Bentos Rivera Rivera Rocha Rocha Salto Salto San José San José de Mayo Soriano Mercedes Tacuarembó Tacuarembó Treinta y Tres Treinta y Tres Total¹ — *¹Doesn't include the artificial lakes on the Rio Negro (1,199 km²). ==Geography== The highest point in the country is the Cerro Catedral whose peak reaches to . Uruguay has 660 km of coastline. There are nine National Parks in Uruguay. Five in the wetland areas of the east, three in the central hill country and one in the west along the Rio Uruguay. * 2nd smallest country on continent * South America * Sandy beaches near Montevideo * In the north, a series of low mountains run north into the highlands of Brazil * 176,220 square kilometers * Mostly hills * A lot of water rich lands * Near Brazil and Argentina ==Economy== ===Agriculture=== According to FAOSTAT, Uruguay is one of world's largest producers of: soybeans (9th); greasy wool (12th); horse meat (14th); beeswax (14th); quinces (17th); natural honey (19th); cattle meat (20th). On December 20, 2013, Uruguay was the first country in the world to legalize the cultivation, sale, and use of cannabis. ==Demographics== Colour/Race (self-reported, 2008) White 95.4% Black/African 3.4% Indigenous 1.1% Asian/Amarillo 0.1% Uruguayans are mostly of European origin. 88%, or 88 of 100 people, are from European descent. ==Sports== Football is the most popular sport in Uruguay. The Uruguay national football team has won the FIFA World Cup on two occasions. ==References== == Official Websites == * Uruguay Official Portal * Uruguay Official Presidency Website Category:Spanish-speaking countries Category:1825 establishments in South America",
 "title": "Uruguay"
}