{
 "id": "1098538",
 "text": "The Gaza-Jericho Agreement is an agreement in 1994 between Palestine and Israel trying to help resolve the Israel-Palestine Conflict. It was signed on May 4, 1994 in Cairo, Egypt. It is officially is called the Agreement on the Gaza Strip and the Jericho Area. It is also called the 1994 Cairo Agreement.Agreement on the Gaza Strip and the Jericho Area, May 4, 1994, https://peacemaker.un.org/sites/peacemaker.un.org/files/IL%20PS_940504_Agreement%20on%20the%20Gaza%20Strip%20and%20the%20Jericho%20Area%20%28Cairo%20Agreement%29.pdf == Contents of the Agreement == === Land === The Gaza-Jericho Agreement made Israel remove its military, the Israeli Defense Forces (IDF), from some Palestinian lands. Specifically, the IDF left parts of the Gaza Strip, called Area A of Gaza. The IDF also left parts of Jericho in the West Bank, called Area A of Jericho. Israel kept some land in Gaza, called Area C of Gaza.https://www.jewishvirtuallibrary.org/images/gjmap1a.gif In Jericho, Israel gave the Palestinian Authority control of 24 square miles (62 km²). Palestine wanted 42 square miles (109 km²) of Jericho. Palestine got less than they initially asked for, this is an example of compromise. === Security === The Gaza-Jericho agreement stated Israel will perform security in Israel and Israeli settlements and roads in occupied Palestinian territory, as well as control over all of the sea, airspace, and entry points to Palestinian held territory on the ground. The agreement also stated Israel will keep Palestinians traveling between their designated areas safe. The agreement stated Palestine will perform security for both Palestinians and Israelis in Palestinian-controlled areas. === Governance === The Gaza-Jericho agreement created the Palestinian Authority to govern Palestinian areas. The Palestinian Authority took over responsibility for legal affairs as well in Palestinian areas, with some exceptions. The exceptions were that Israel maintained legal authority over Israeli citizens living in Palestinian areas including settlers and of the foreign relations of Palestine. After the agreement went into effect, the Palestinian Authority replaced many of the old laws especially those concerning security, but kept some rules about less controversial things such as traffic laws. == Criticism == There is criticism that the agreement did not equally address the concerns of each side. For example, the preamble of the text does not talk about a withdrawal of Israeli military presence from Palestinian-administered lands. Another example is Section 3 of Article 5, which leaves East Jerusalem up for negotiation, which goes against the Israeli position that all of Jerusalem is its country's capital. == Implementation of the agreement == Israeli troops left both regions on May 25, 1994. On July 1, 1994, Palestinian leader Yasser Arafat arrived in Gaza to take over as the first president of the Palestinian Council. In September 1995, the agreement became part of the Interim Agreement on the West Bank and the Gaza Strip, also known as Oslo II, which replaced it. == Related pages == * Sykes–Picot Agreement * Balfour Declaration of 1917 * Settler colonialism * Arab–Israeli conflict * Camp David Accords * Abraham Accords ==References== Category:Gaza–Israel conflict Category:1994 Category:Palestine",
 "title": "Gaza–Jericho Agreement"
}