{
 "id": "1098084",
 "text": "On 6 April 2024, Al Qassam Brigades did a surprise attack on Israeli forces. The attack took place in the Al-Zana area which is located on the east side of Khan Yunis in the Gaza Strip. ==Ambush== One of the leaders of the Al-Qassam Brigades, in an interview with Al Jazeera, said that the fighters of Qassam brigades were planning and preparing from last 50 days for the Zana ambush operation. The ambush took place during the daytime on 6 April 2024 when Qassam fighters came out from a tunnel of a destroyed building and opened fire on israeli soldiers that were patrolling a road in Khan Yunis. After killing at least 4 soldiers and injuring a number of others the fighters withdrew back into the tunnel. The Israeli soldiers who tried to run behind the attackers noticed that the escape route was booby-trapped and therefore they stopped going after them. On April 9, 2024, Al Qassam Brigades released a video showing an ambush they did against Israeli soldiers near Khan Yunis in Gaza on the 27th day of Ramadan. The video shows Al-Qassam fighters setting up ambush devices and hiding them in the area. Then, about 30 Israeli soldiers were seen coming at the ambush spot. The video also shows the Al-Qassam fighters using an RPG called Al-Yassin 105 to attack the soldiers' vehicles and the Israeli soldiers taking away dead bodies of killed soldiers after the attack. ==Aftermath== Three Helicopters were seen at the spot taking the dead and injured israelis. The day after the Zana ambush, the Israeli army said they were pulling out the 98th Division and its three brigades from the Khan Yunis area in Gaza. They left only the Nahal Brigade in the Netzarim Corridor, which stretches from southern Israel's Kibbutz Be’eri area to the Gaza Strip's coast. The Israeli army said they would now focus on targeted operations using its intelligence in the ongoing war against Gaza. ==Related pages== * Shuja'iyya ambush * List of military operations during 2024 * List of ongoing armed conflicts ==References== Category:21st-century battles Category:Israel–Hamas war Category:April 2024 events Category:Gaza Strip",
 "title": "Zana ambush"
}