{
 "id": "1098126",
 "text": "Tingley is a village within Leeds in West Yorkshire, Northern England. It is a part of the Parish of West Ardsley. It is situated between Leeds and Wakefield. Most of Tingley is within the Ardsley and Robin Hood ward of Leeds City Council. Part of west Tingley is in the Morley South ward. == Geography == It is apart of the West Riding of Yorkshire. Tingley is considered to be apart of Morley. It has the WF3 (Wakefield) postcode area, whilst the telephone numbers are \"0113\", the Leeds prefix. It runs only 5 miles south of Leeds City Centre. It is situated nearby to the A650, with West Ardsley and East Ardsley also being in close proximity. Woodkirk is also located just to the south. == Etymology == The name Tingley can be traced back to the thirteenth century, deriving from Old English \"þing\" meaning \"meeting\" or \"assembly\", and \"hlaw\" meaning \"mound\" or \"hill\", which suggests it was likely used as a meeting place for Morley Wapenake in the Middle Ages. == Goverance == Tingley was a part of the Ardsley Urban district (1894-1937), then it became part of the Morley Municipal borough (1937-1974). The village is still classed as a part of Morley in the census. However, it is technically separate, and is not governed by Morley Town Council. == Culture and community == Until recently, Tingley has seen much residential development over the last 25 years, while managing to keep most of its rural views. The coal and woolen industries provided much employment in the area until well after World War II, have now completely disappeared and reducing Tingley to a suburb. Within a 5 mile radius of Tingley lies the city centres of Leeds and Wakefield and the town centres of Morley, Batley, Dewsbury, and Osset. Tingley is home to Tingley Athletic JFC. The club traditionally play in white and green stripes with black shorts and green socks, and have had many players go on to play at a semi-professional level. The club play at home, The Crescent, at the end of Casson Avenue. Shopping needs are covered by the nearby White Rose Shopping Centre. The Leeds branch of Available Car is also located in Tingley, as well as the South Leeds location of Village Hotels. Tingley has several public houses including New Scarborough on Dewsbury Road, British Oak on Westerton Road, and the Hare and Hounds Pub on Batley Road. Tingley has several houses of worship, including Hope Church near just off Lowry Road, Tingley Methodist Church on Westerton Road, and Safe Haven in Paradise on Thirlmere Drive. == Education == Education locations served in the Tingley area is Westerton Primary Academy, Blackgates Primary Academy, Woodkirk Academy, Bright Horizons Day Nursery, and Smiley Dayz Nursery. Within the wider area is Hill Top Academy in West Ardsley and Morley Academy in Morley. == Transport == Tingley is widely known for its roundabout, at the junction of the M62, the A653 (Dewsbury Road), and the A650 (Bradford Road). Until roadworks were done in the early 200, this was known for being one of the worst areas in Leeds for accidents. Tingley was intended to be the home of the southern terminus of the main line of the cancelled, Leeds Supertram Project. == Railway past == Tingley once served its own railway station, which was located on the now closed ex-Great Northern railway line (Leeds, Bradford, and Halifax Junction Railway) that ran from Ardsley Junction to Laisterdyke, on the outskirts of Bradford. The station was also a junction station on the also now closed Batley to Beeston loop line. Tingley railway station closed to passengers in 1954, and then to freight in 1964, with the line itself closing in 1969. The station has long been demolished. The formerly adjacent Station Lane once led up to the station. Along the former ex-Great Northern loop line towards Beeston Junction lies the now long disused Tingley Viaduct. == Notable people == In 1980, Zigmund Adamski, a coal miner at Lofthouse Coillery close to retirement, set of from Tingley to go shopping in Wakefield. He was never seen alive again. His body was found on top of the coal mound near Todmorden. He had died of a heart attack. His death has been claimed to have the hallmarks of a UFO incident. David Batty, who played for Leeds United and Newcastle United as well as England, is one of the most famous players to start of at Tingley Athletic. Category:Villages in West Yorkshire Category:Leeds",
 "title": "Tingley"
}