{
 "id": "1099633",
 "text": "Janet Lee, Baroness Lee of Asheridge, PC LLD HonFRA (3 November 1904 – 16 November 1988), known as Jennie Lee, was a Scottish politician. She was a Labour Member of Parliament from a by-election in 1929 until 1931 and from 1945 to 1970. She was Minister for the Arts in Harold Wilson's government of 1964–1970. She played a leading role in the foundation of the Open University working directly with Harold Wilson to establish the principle of open access: Enrolment as a student of the University should be open to everyone … irrespective of educational qualifications, and no formal entrance requirement should be imposed. She was married to the Welsh Labour politician Aneurin Bevan from 1934 until his death in 1960. ==Early life== She was born in Lochgelly, in Fife, to Euphemia Greig and James Lee. He was a miner who held the post of fire and safety officer.Hollis, Patricia (2014). Jennie Lee: a life. 2nd edition. Oxford: Oxford University Press. . Later he was a hotelier. She had a younger brother, Tommy. She inherited her father's socialist inclinations. Like him she joined the Scottish Independent Labour Party. Her grandfather Michael Lee, born in 1850 to Irish Catholic parents, was a friend of Keir HardieMatthew Brown, \"ILP@120: Jennie Lee – A Child of the ILP\", Independent Labour Publications, 24 April 2013. ==Education== Lee was educated at Beath High School. The Carnegie Trust, Fife County Council and the Fife Education Authority agreed to pay her university fees. She went to the University of Edinburgh as a student teacher. She later won a bursary to study law.\"Jennie Lee\", Undiscovered Scotland. At university she joined the Labour Club, the Edinburgh University Women's Union and the editorial board of the student newspaper. One of her first campaigns was to elect Bertrand Russell as Rector of the University. After graduating initially in 1927 with an MA, an LLB and a teaching certificate, she worked as a teacher in Cowdenbeath. == First term as MP == Lee was the Independent Labour Party candidate for North Lanarkshire. She won the 1929 by-election. She was the youngest woman member of the House of Commons. In 1929 women under the age of 30 could not vote. She was the first Labour woman to represent a Scottish seat in the House of Commons. She was re-elected at the 1929 general election. Her first speech was an attack on the budget proposals of Winston Churchill. She accused him of cant, corruption, and incompetence'. He offered his congratulations after their exchange in the Commons. Lee had a reputation as a left-winger. She was an ally of Maxton and the other ILP members. She was totally opposed to Ramsay MacDonald's decision to form a coalition National Government. In the 1931 general election she lost her seat in parliament to Unionist candidate William Anstruther-Gray. ==Out of the Commons== In her private life she had a close relationship with Labour MP Edward Frank Wise. He was a married man who considered divorcing his wife for Lee, but did not do so. Wise died in 1933. In 1934 she married the left-wing Welsh Labour MP Aneurin Bevan. She was with him until his death in 1960. She had no history in the women's movement. She said that she voted on policy not candidate gender. She believed equality for women would follow from the introduction of true socialism. It was not a separate cause. She practised feminism 'of a sort'. She was known to walk out of dinner parties if it was expected that women were to withdraw to another room when the port was circulated. She tried to get British support for the Spanish Popular Front government against Francisco Franco's Nationalist faction in the Spanish Civil War. She was still active in the Independent Labour Party. She took their side in their split from the Labour Party. This did not meet with her husband's approval. She tried to get elected in North Lanarkshire at the 1935 general election. She came second behind Anstruther- Gray but ahead of the Labour Party's candidate. At the Labour Party Conference in Edinburgh in 1936 Lee met the Spanish Republican delegates. They had a petition for support against the fascists. Lee went to Spain herself in 1937 to report as a war journalist. She travelled in Aragon and Barcelona with George Orwell and the teenage grandson of her Commons sponsor, Robert Smillie, MP. She was a reporter for New Leader. They were all caught up in some violent incidents. Lee attended a torchlit parade of the British Battalion of the International Brigades volunteers at Modejar with Clement Attlee and others in the Labour Party, during the war. She was again unsuccessful as an \"Independent Labour\" candidate in a 1943 by-election at Bristol Central. She was defeated by the Conservative Lady Apsley and opposed by the ILP. She worked as a journalist for the Daily Mirror. ==Re-election== She returned to the Labour Party from the ILP. At the 1945 general election she was elected to the Commons to represent the Cannock constituency in Staffordshire. She remained a convinced left-winger. This brought her sometimes into opposition with her husband. Lee was critical of Bevan for his support of the UK nuclear deterrent This was something she did not support. She was appointed as the first Minister for the Arts in Harold Wilson's government of 1964. She played a key role in the formation of the Open University.Kenneth O'Morgan, \"Politics: Jennie and the awkward squad\", The Independent, 8 November 1997. ==Role in the foundation of the Open University== The Open University was based on the idea of a 'University of the Air'. It was intended as a correspondence university reaching out to those who had been denied the opportunity to study. Lee produced a White Paper in 1966. This showed plans to deliver courses by correspondence and broadcasting. Prime Minister Harold Wilson was an enthusiastic supporter. He saw The Open University as a major marker in the Labour Party's commitment to modernising British society. He believed that it would help build a more competitive economy while also promoting greater equality of opportunity and social mobility. Using television and radio to broadcast its courses was also supposed to link The Open University to the technological revolution. Lee found widespread scepticism and even opposition from within and without the Labour Party. This included senior officials, her departmental boss, Anthony Crosland; the Treasury, Ministerial colleagues, such as Richard Crossman and commercial broadcasters. The Open University happened because of Lee's unflagging determination and tenacity in 1965–67. She had steadfast support from Wilson. The anticipated costs, as reported to Lee and Wilson by Arnold Goodman, seemed very modest. By the time the actual, much higher, costs became apparent, it was too late to scrap it.Pete Dorey, \"‘Well, Harold Insists on Having It!’—The Political Struggle to Establish The Open University, 1965–67.\" Contemporary British History 29#2 (2015): 241–272. In 1973, as she laid the foundation stone for the first Open University library, she described the University as 'a great independent university which does not insult any man or any women whatever their background by offering them the second best. Nothing but the best is good enough.' ==Role in the expansion of the Arts Council== Lee renewed the charter of the Arts Council of Great Britain in 1967. This expanded its work in the regions and created new arts institutions at London's South Bank Centre. She introduced the only UK White Paper for the Arts to be published for the next half-century. ==Retirement and later life== Lee was defeated at the 1970 election in Cannock by the Conservative candidate Patrick Cormack. Political scientist Richard Rose called Lee's loss of her seat, which had been held by Labour since 1935, on a swing of 10.7%, the largest in any constituency for that election, \"the biggest upset\" of the 1970 general election. She was made Baroness Lee of Asheridge, of the City of Westminster on 5 November 1970, Asheridge was the farm near Chesham, Buckinghamshire where she had lived from 1954 to 1968. She wrote four books: To-morrow Is a New Day, 1939; Our Ally, Russia, 1941; This Great Journey, 1963; My Life with Nye, 1980. In 1974 she received an Honorary LLD from the University of Cambridge. In 1981 she was made an Honorary Fellow of the Royal Academy. She died in 1988 from natural causes at the age of 84. She gave her personal papers to the Open University which now holds them as the Jennie Lee Collection.\"Jennie Lee collection\", Open University Archive ==Cultural depictions== Lee is the subject of a play by Matthew Knights, titled Jennie Lee: Tomorrow is a New Day, developed since 2019. She is also the subject of Mikron Theatre Company's 2024 show Jennie Lee, written by Lindsay Rodden. In Tim Price's 2024 play Nye, which premiered at the National Theatre, Lee was played by Sharon Small. == References == == Other websites == *Parliament & the Sixties – Jennie Lee - University of the Air – UK Parliament Living Heritage * *Parliamentary Archives, Papers of Jennie Lee, MP (1904-1988) Category:1904 births Category:1988 deaths Category:People from Fife Category:Alumni of the University of Edinburgh Category:Labour Party (UK) MPs Category:Humanists Category:Open University Category:Members of the Privy Council of the United Kingdom Category:UK MPs 1924–1929 Category:UK MPs 1929–1931 Category:UK MPs 1945–1950 Category:UK MPs 1950–1951 Category:UK MPs 1951–1955 Category:UK MPs 1955–1959 Category:UK MPs 1959–1964 Category:UK MPs 1964–1966 Category:UK MPs 1966–1970 Category:Labour Life Peers",
 "title": "Jennie Lee, Baroness Lee of Asheridge"
}