{
 "id": "1099976",
 "text": "Chalamba (Ancient Meitei: Chalampa) was a son of Khuman King Kwakpa and a Meitei Lady Piyainu. His story was often related to goddess Imoinu (Emoinu) and the festival of Imoinu Iratpa (Emoinu Eratpa) of ancient Kangleipak. He was mentioned in Meitei mythology, Meitei folklore and in the history of Kangleipak (present day Manipur). He was credited for bringing goddess Imoinu from the Khuman kingdom to the Meitei kingdom. == Story == There was a disagreement between the Meiteis and the Khumans. As a result, Chalamba's parents lived separately. Chalamba was inside his pregnant mother's womb when his parents got separated. Chalamba grew up in his mother's house in the land of Meiteis. To please goddess Yumjao Leima (Yumjao Lairembi), youthful men of the land of Meiteis were asked by the oracle tellers to bring deers for the ritualistic sacrifices to Her. Chalamba was one of the hunters coming to the forests to catch deers. He followed a deer, which ran faster than him. It hid among the yairi grasses (Rubus idens) making a loud sound. The place was named “Yairipok” in Meitei language. Later, the deer ran into the royal palace of Khuman King Kwakpa. Chalamba and King Kwakpa didn't recognize each other. They had a disagreement about the ownership of the deer. They finally decided to fight and the winner would be the owner. The two fought but none won. King Kwakpa was surprised at the bravery of the young man. He stopped the fight. He asked the identity of the young man. Chalamba told him about his mother. Later, upon investigation, King Kwakpa realised that the young man was none other than his own son. King Kwakpa expected that his wife would want his kingdom. To further verify Chalamba's legitimacy of being Piyainu's son, King Kwakpa sent Chalamba back to his mother Piyainu to ask whatever she wanted from him. Chalamba went back to his mother and came again. He extracted a promise from his father to grant him anything upon request. King Kwakpa promised. To his surprise, Chalamba begged him to give him goddess Imoinu (Emoinu). Goddess Imoinu (Emoinu) was living in the kingdom of the Khumans. Due to her blessings, the kingdom prospered. King Kwakpa was shocked but he had already promised. King Kwakpa reminded his son that he (Chalamba) was the legal heir to the throne of the Khuman kingdom. But, Chalamba was not convinced. Reluctantly, King Kwakpa handed over the goddess to Chalamba. Without any bloodshed, Imoinu, the goddess of wealth and prosperity, was brought from the Khuman kingdom to the Meitei kingdom. Upon arrival in the Meiteiland, Lady Piyainu welcomed the goddess by lighting up the streets. This was later celebrated as Imoinu Iratpa (Emoinu Eratpa). == In popular culture == In 2014, a play titled \"Imoinu Chalamba Campaign\" was performed, as a part of the National sanitation campaign under Swachh Bharat Mission, in Manipur. == References == == Other websites == * Category:Meitei mythology",
 "title": "Chalamba (Khuman prince)"
}