{
 "id": "1099192",
 "text": "National populism is a term used to refer to a nationalist political ideology that aims to mobilize popular support by emphasizing the strengthening of national identity and the promotion of national interests, often highlighting sovereignty, culture and traditions. It shares similarities with right-wing populism on social issues but its adherents tend to incorporate some economic aspects of left-wing populism, such as economic interventionism and welfarism, with the latter being aimed exclusively at promoting the quality of life of the country's own citizens, taking a welfare chauvinist route. The term was introduced into political science in the 1970s by the Argentine sociologist Gino Germani to designate the nationalist and populist regimes in Latin America in the 1930s to 1950s, such as Peronism. The term was later reused and popularized by the French political scientist and historian of ideas Pierre- André Taguieff to describe the form of populism represented by the French political party National Rally. According to Taguieff, national populist groups would be characterized, for example, by a personal appeal to the people launched by a leader, an appeal to the people as a whole against \"illegitimate elites\", an appeal for change (which implies a purifying break with a supposedly corrupt system, sometimes linked to the requirement of referendums), or a call to \"cleanse\" the country of supposedly \"unassimilated elements\" (opposition to immigration). British political scientists Roger Eatwell and Matthew Goodwin used the term \"national populism\" to refer to far- right parties and groups that have emerged over the last three decades in Western countries. According to Eatwell and Goodwin, national populism is not a \"refuge for racists and people who indulge in an irrational fear of ‘different’\" but rather reflects, in part, people's \"deep fears about the way a new era of immigration and ethnic change could lead to the destruction of their group and way of life\". In addition to the question of identity, among national populists it is also common to associate the \"foreign\" with a negative external force within the country, such as the power of international organizations (like the European Union), multinationals, foreign States, globalization, etc. == References == Category:Political ideologies Category:Political movements Category:Nationalism",
 "title": "National populism"
}