{
 "id": "1099955",
 "text": "is a Japanese contemporary artist, painter, and sculptor. He was born in 1969 in Shimane, Japan. == Career == Katō was born in Shimane Prefecture. He went to Musashino Art University and graduated from the Department of Oil Painting in 1992. He was inspired by Francis Bacon, Vincent van Gogh, and Itō Jakuchū, and most of Katō's art is about the meaning of life. Some of his art is made to look like embryos or fetuses. He first became known in 1995 because some of his works were shown at Tokyo group exhibitions. Then, he tried getting more popular internationally by starting sculpting around 2004.\"PROFILE\". IZUMI KATO. Retrieved 2023-03-22. Katō's sculptures would be shown at Art Tower Mito's contemporary art gallery, then the Japan Society Gallery's exhibit in New York City in 2005, and he'd become the first young Japanese artist to be invited to the 52nd Venice Biennale in 2007. is a painted wood sculpture. Now, it is owned by the Takahashi Ryutaro Collection. The sculpture looks like a baby-like creature standing at a wall with its large head turned to the side. On the internet, Keisuke Yamamoto's photograph of the sculpture was used with the \"SCP-173\" story of the SCP Foundation. Kato responded to the SCP Foundation in 2014. He let the SCP Foundation use the image as long as he is credited and the work is not used for commercial purposes or business. In 2022, the SCP Foundation removed the photograph to avoid legal issues because the image broke their Creative Commons license. The creator of the SCP-173 story asked that the image not be replaced to let people see \"SCP-173\" for themselves. == Personal life == Kato met a woman named Naoko Kameyama, who was also a young artist. They ended up getting married\"加藤泉 日本の新鋭アーティストの形を持たない怪しい胎児達\". Albatro Design (in Japanese). 2010-06-20. Archived from the original on 2010-06-20. Retrieved 2023-03-30. and had children.\"異文化交流が生み出す現代美術の可能性を探る - 原美術館\". Mynavi News (in Japanese). 2008-07-18. Retrieved 2023-03-22. == References == == Other websites == * Izumi Kato Category:Living people Category:1969 births Category:Japanese artists",
 "title": "Izumi Kato (artist)"
}