{
 "id": "1099768",
 "text": "Wat Benchamabophit Dusitvanaram () is a Buddhist temple (Wat) in the Dusit district of Bangkok, Thailand. It is commonly known as the Marble Temple for its elegant architecture crafted from Carrara marble. It is one of the most renowned temples in Bangkok and a significant center for Theravada Buddhism in Thailand.Norwich 2001, p. 266 ==History== Wat Benchamabophit was built in 1899 under the reign of King Chulalongkorn (Rama V) and finished in 1911. It was designed by Prince Naris, the king's half-brother, who combined European neoclassical architecture with indigenous Thai design.https://www.tourismthailand.org/Attraction/wat-benchamabophit ==Architecture== The temple's design combines elements of both Thai and European styles. The main portion of the temple, known as the ubosot, is constructed in the traditional style of Thai Buddhist temples. It has many layers of curved roofs, each with elaborate carvings on the edges. The walls outside the ubosot are coated in white marble from Carrara, Italy, hence the name Marble Temple. Inside the ubosot, there is a bronze Buddha figure. This statue, known as Phra Buddhajinaraja, portrays Buddha strolling. This statue is highly revered by Thai Buddhists, who commonly meditate and pray in front of it when visiting the temple. ==Worship and Festivals== Every morning, people who desire to do good deeds, known as merit creators, visit the temple to feed the monks. This occurs between 6:00 and 7:30 in the morning. On Nakhon Pathom, monks stand in a queue with their bowls waiting to receive donations. People donate gifts like curries, rice, lotus buds, incense, toiletries, and other necessities to help the monks. During two key Buddhist holidays, Magha Puja in February and Visakha Puja in May, the temple hosts a spectacular celebration. In the evening, there is a candle-lit procession around the temple called the bot. Many people participate in the procession to commemorate these holidays. ==Protection== The temple was proposed to UNESCO in 2005 in the expectation of being recognized as a future World Heritage Site. == Gallery == File:Watbuddha.jpg|Buddha File:Phrapuddhajinnarat.jpg|Phra Buddhajinaraja File:Watbenchamasalanam.jpg|\"Sala Nam\" at khlong in temple compound File:Marble-temple-ordainment.jpg|A new monk is ordained in the temple File:Wat Benchamabophit ubosot.jpg|In front of The Marble Temple File:The Marble Temple-Door (Bangkok).jpg|The temple door with elaborate design ==References== Category:Buddhist temples in Thailand Category:Temples in Bangkok",
 "title": "Wat Benchamabophit"
}