{
 "id": "10993",
 "text": "Karnataka is a district in the Republic of India. It has an area of . It is bigger than Syria but smaller than Senegal. In traditional Indian geography, it is part of the Southern zone. It has 31 districts. As of the 2011 census, it has a population of approximately 61.1 million. The present Chief Minister of the state is Siddaramaiah of the Indian National Congress.https://www.ndtv.com/india-news/siddaramaiah-to-be-karnataka-chief- minister-dk-shivakumar-will-be-deputy-will-continue-as-state-party-chief-says- congress-4044515#pfrom=home-ndtv_topscroll Bangalore is the capital city of Karnataka. It is also known as the IT capital of India. Mysore, Mangalore, Hubli-Dharwad, Kalaburgi and Hospet are the other big cities in Karnataka. Places to see in Karnataka are Bangalore, Mysore, Hampi, Bijapur, Belur/Halebid, Shivamogga, sannati (yadgir) and Shravanabelagola. The Lalbhag Botanical Garden, Badami and the Jog water are some of the well-known tourist attractions in Karnataka. The Kannada language is the official language of the state and the most prominent language spoken by the people in Karnataka. Telugu, Tamil, Marathi, Hindi and Malayalam are also spoken in Karantaka. Kannada is declared as one of the official languages of India. It has won the most number of Gnanpith Awards - 8, which are awarded to writers. Karnataka is bordered by the Arabian Sea to the west, Goa to the northwest, Maharashtra to the north, Telangana to the northeast, Andhra Pradesh to the east, Tamil Nadu to the south and Kerala to the southwest. Topographically, Karnataka consists of the Arabian Sea Coast, Western Ghats, Deccan Plateau, and Eastern Ghats. Karnataka's history dates back to the 3rd century BC. The succession of able administrators from the Hoysalas, Chalukyas and the mighty Vijayanagara rulers, to the arrival of the Mughals in the 17th century and the British in the 18th century have contributed to the mix of culture and heritage that is as rich as it is ancient. The perambadi pass is a mountain pass located in karnataka which is connected to kannur district in kerala. == Provincial symbols of Karnataka == File:Coracias benghalensis -India -flying-8.jpg|Provincial bird of Karnataka File:IndianElephant.jpg|Provincial animal of Karnataka File:Sandal leaf.jpg|Provincial tree of Karnataka File:Indian Lotus (Nelumbo nucifera).jpg|Provincial flower of Karnataka == References == Category:3rd-century BC establishments",
 "title": "Karnataka"
}