{
 "id": "1099659",
 "text": "Guy Yanai (born August 21, 1977) is an Israeli painter known for his paintings of everyday objects, plants, landscapes, and intimate scenes. He lives and works in both Tel Aviv, Israel, and Marseille, France. Yanai's paintings often convey \"romantic symbolism,\" with titles that can be interpreted visually through shapes, forms, and color. He draws inspiration from novelists, philosophers, and filmmakers such as Marcel Proust, Claude Sautet, and Nietzsche. == Life and Career == Yanai was born in Haifa, Israel, on August 21, 1977, to Moshe and Rachel Yanai. His family relocated to Framingham, Massachusetts, in 1984, where he experienced a significant cultural shift, reflected in his art. He moved to New York in 1995 and attended Parsons School of Design and later the New York Studio School of Drawing, receiving his MA from Hampshire College in 2000. Yanai returned to Israel in 2001 and established a studio in Tel Aviv. In 2015, Yanai co-founded Yundler Brondino Verlag, an independent publishing company focusing on artists' books and exhibitions, with his second wife, Aurore Chauve. In September 2020, he opened a second studio in Marseille. == Artistic Practice == Yanai's paintings are characterized by bold colors, simplified shapes, and flattened depth. He often portrays ordinary objects and spaces, drawing inspiration from his travels worldwide. Influences include photographic and film sources, art history, and personal memories. Masters like Matisse, Picasso, Cy Twombly, and David Hockney have greatly influenced his work. Digital imagery also plays a significant role, reflecting an age of consumerism and commodified goods. Yanai's paintings reflect a sense of rootlessness, influenced by his experiences in various countries. His paintings are executed with narrow, horizontal brushstrokes, creating a deliberate, handmade feel. Some paintings intentionally leave areas of raw canvas, adding tension. Yanai's recent works have gradually unfurled, allowing for a freer tone. == Exhibitions == Yanai's recent solo exhibitions have been held at various galleries, including König Galerie (2022), Miles McEnery Gallery, New York (2021), and Galerie Conrads, Düsseldorf (2020). His work has been included in exhibitions at institutions like the Haifa Museum of Art (2015), Nassima/Landau Foundation, Tel Aviv (2020), and The Velan Center for Contemporary Art, Turin (2013). He has also participated in group exhibitions at galleries worldwide. == References == Category:Israeli painters Category:1977 births Category:People from Tel Aviv Category:Jewish artists",
 "title": "Guy Yanai"
}