{
 "id": "109973",
 "text": "The continental United States is the area of the United States that is located in the continent of North America. It includes 49 of the 50 U.S. states (48 of which are located south of Canada and north of Mexico, known as the \"lower 48 states,\" the other being Alaska) and the District of Columbia, which contains the federal capital, Washington, D.C. The only state that is excluded is Hawaii, which is a state consisting of islands in the Pacific Ocean that are not part of North America but rather, Oceania. \"On May 14, 1959, the U.S. Board on Geographic Names issued the following definitions based partially on the reference in the Alaska Omnibus Bill, which defined the Continental United States as \"the 49 States on the North American Continent and the District of Columbia...\" The Board reaffirmed those definitions on May 13, 1999.\" Some sources incorrectly mix up the \"continental United States\" with the \"contiguous United States,\" which consists simply of the lower 48 states and the District of Columbia). The contiguous United States, also known as the \"United States Mainland\" does not include Alaska, Hawaii, or any other territory under the control of the United States.continental, adj., \"being the part of the United States on the North American continent; also : being the part of the United States comprising the lower 48 states\" \"The area … is continental United States, by which is meant that part of the United States lying on the continent of North America south of the Canadian boundary. It thus excludes Alaska and the recent insular accessions of Hawaii, …\" Abstract of the 1900 Census (1902), p.xi Alaska is unique among the U.S. states since it is part of the North America since it it is attached via Canada. That makes it part of the \"continental United States\". However, Alaska is not part of the \"contiguous United States\" because it is not attached directly to the lower 48 states. == Citations == Category:Regions of the United States",
 "title": "Continental United States"
}