{
 "id": "1099061",
 "text": ", formerly ,, in Tokyo, Japan, is a member of the Imperial House of Japan. She is the second daughter and third child of Princess Hisako and Noriyuki Moriya. Ayako is the granddaughter of Takahito, Prince Mikasa, the fourth son of Emperor Taishō and Empress Teimei, and a great-granddaughter of Emperor Shōwa and Empress Kōjun, making her a part of the extended Japanese imperial family. Growing up in an imperial household, Ayako received a well-rounded education emphasizing the importance of cultural heritage and public service. She attended Gakushuin University in Tokyo, where she studied literature, further deepening her understanding of Japanese culture and history. Ayako has been actively involved in various charitable and cultural activities, representing the imperial family at events in Japan and abroad. Her dedication to these causes has made her a respected and beloved figure, known for her grace, humility, and commitment to serving others. In October 2018, Ayako Moriya married Kei Moriya, a commoner, in a traditional Shinto ceremony. She officially left the Imperial Family after her marriage, as is customary for female members who marry commoners. Despite this change in status, Ayako remains committed to her charitable and cultural endeavors, using her platform to promote the values and traditions of the imperial family. Ayako Moriya's life and work exemplify the Japanese imperial family's rich cultural heritage and traditions. Her contributions to charitable causes and cultural events have made her a beloved figure in Japan and worldwide. She embodies the spirit of service and dedication that defines the imperial family. ==Titles== *15 September 1990 – 29 October 2018: Her Imperial Highness Princess Ayako of Takamado *29 October 2018 – present: Mrs. Ayako Moriya ==Honours== * Member 2nd Class (Peony) of the Order of the Precious Crown - ==Family history== ==Other websites== *Her Imperial Highness Princess Takamado and her family at the Imperial Household Agency website Category:Japanese princes and princesses Category:1990 births Category:Living people",
 "title": "Ayako Moriya"
}