{
 "id": "1099967",
 "text": "Chalamba (Ancient Meitei: Chalampa; 1545-1562 CE) was a Meitei king of the Ningthouja dynasty in Kangleipak (present day Manipur). He became the king in 1545 CE.Rev Dr Koningthung Ngoru Moyon, The Lost Kingdom of Moyon (Bujuur): Iruwng (King) Kuurkam Ngoruw Moyon & The People of Manipur. N.p.: Shashwat Publication, 2023. p. 336 He ruled Kangleipak for 17 years. He succeeded the throne from King Tangjamba (1542-1545 CE).Ibohal Singh, Wahengbam. The History of Manipur: An early period. India: Manipur Commercial Company, 1986. He was succeeded by King Mungyamba (1562-1597 CE).Kirti Singh, Moirangthem. Religious Developments in Manipur in the 18th and 19th Centuries. India: Manipur State Kala Akademi, 1980. p. 38Anthropological Linguistics. United States: Department of Anthropology, Indiana University, 2005. p. 206Rev Dr Koningthung Ngoru Moyon, The Lost Kingdom of Moyon (Bujuur): Iruwng (King) Kuurkam Ngoruw Moyon & The People of Manipur. N.p.: Shashwat Publication, 2023. p. 170 He issued coins with signs in ancient Meitei script (Manipuri script).Sraddhānjali, Studies in Ancient Indian History: D.C. Sircar Commemoration Volume. India: Sundeep Prakashan, 1988. p. 258 During his reign, Kshetri people (or the Kshatriyas) immigrated to Kangleipak, and got naturalised as Kshetrimayums. == Family == Chalamba married to a Kamrupi princess as a part of the matrimonial alliance.Nath, Rajmohan. The Back-ground of Assamese Culture. India: Dutta Baruah, 1978. p. 90Historical and Cultural Relations Between Manipur, Assam, and Bengal. India: Manipuri Sahitya Parishad, 1986. p. 5 According to scholar Wahengbam Ibohal, Chalamba was neither a son nor a brother of his predecessor King Tangjamba. Tangjamba died at a young age of 29 years.Ibohal Singh, Wahengbam. The History of Manipur: An early period. India: Manipur Commercial Company, 1986. == Conquests == Chalamba ruled over the Tangkhuls and the Chiroo (Chiru) people.L. Joychandra Singh, The Lost Kingdom: Royal Chronicle of Manipur. India: Prajatantra Publishing House, 1995. p. 4Rev Dr Koningthung Ngoru Moyon, The Lost Kingdom of Moyon (Bujuur): Iruwng (King) Kuurkam Ngoruw Moyon & The People of Manipur. N.p.: Shashwat Publication, 2023. p. 336In 1558 CE, he ruled over the Lanhang (Lamkang/Lamgang) people, by defeating its chief Kapu and taking him as captive.Rev Dr Koningthung Ngoru Moyon, The Lost Kingdom of Moyon (Bujuur): Iruwng (King) Kuurkam Ngoruw Moyon & The People of Manipur. N.p.: Shashwat Publication, 2023. p. 167 In 1559 CE, he also ruled over the Anal people, by defeating its chief Nongningkhoi.Singh, Lairenmayum Iboongohal. Introduction to Manipur. India: S. Babudhan Singh; to be had of: Students' Store, 1963. p. 171Rev Dr Koningthung Ngoru Moyon, The Lost Kingdom of Moyon (Bujuur): Iruwng (King) Kuurkam Ngoruw Moyon & The People of Manipur. N.p.: Shashwat Publication, 2023. p. 167He ruled over the Naga villages of Anan, Thingnang, and Engthi, by defeating their chiefs.Rev Dr Koningthung Ngoru Moyon, The Lost Kingdom of Moyon (Bujuur): Iruwng (King) Kuurkam Ngoruw Moyon & The People of Manipur. N.p.: Shashwat Publication, 2023. p. 442 In 1557-58 CE (equivalent to traditional year Sak 1479), Chalamba brought down two biggest stones from the Oinam hill (in present day Senapati district of Manipur state) and placed one of them in front of his royal palace, and another at the sana keithel (royal market), as a mark of conquests.L. Joychandra Singh, The Lost Kingdom: Royal Chronicle of Manipur. India: Prajatantra Publishing House, 1995. p. 5Parratt, Saroj Nalini. The Religion of Manipur: Beliefs, Rituals, and Historical Development. India: Firma KLM, 1980. p. 115 Chalamba defeated the chiefs of the Liangmai village of Nurathen on the western side of the Koubru mountain. He also defeated the Kharam chief of the Kharam village in the Leimaton (Loibi) range, near the Ijei river.Kabui, Gangmumei. The History of the Zeliangrong Nagas: From Makhel to Rani Gaidinliu. India: Spectrum Publications, 2004. p. 57 == References == Category:Meitei people",
 "title": "Chalamba (Meitei king)"
}