{
 "id": "1099434",
 "text": "Urban fantasy is a subgenre of fantasy that uses supernatural elements in an a urban setting. The combination lets the writer create classic fantasy tropes, plot-elements, and unusual characters without having to create of an entire imaginary world. Urban fantasy became more popular in fiction during the 19th century. Much of its audience was created in the 1930s-50s. The genre's current publishing popularity began in the 1980s in North America, as writers and publishers began to write more Urban Fantasy because of the success of Stephen King and Anne Rice. == Characteristics == Urban fantasy combines imaginary/unrealistic elements of plot, character, theme, or setting with a mostly normal world.Urban fantasy combines normal things and the strange. These strange elements may exist secretly in the world or may happen openly. Fantastic parts of the story may be magic, paranormal beings, mythic or folk- tale plots, or thematic tropes (such as a quest, or a battle of good and evil). Authors may use current urban myths, use fictional technologies, or established supernatural characters and events from folklore, literature, film, or comics. The urban part of the story is usually found in the setting—usually a large or small city—or even a suburban community in a metropolitan area. Use of technology (such as vehicles or communications) and everyday community and social buildings (such as libraries, schools/universities, or markets) create the context of the story. The time where the action happens may be in the recent past or the near future. The city-setting can be used to create a tone, move the plot, or may even be a character itself. Urban fantasy is most often a sub-genre of low fantasy (where magical events mix with a normal world) and/or hard fantasy (which is when magic is something understandable and explainable), and stories may be found in the sub-genres of horror, occult detective fiction, or the different \"punk\" genres. Common themes include friendships or conflict between humans and other beings, and the changes such characters and events bring to local life. == References == Category:Fantasy",
 "title": "Urban fantasy"
}