{
 "id": "1099242",
 "text": "Nicolas Jacques Pelletier (c. 175625 April 1792) was a French highwayman. Today he is known because he was the first person to be executed by guillotine. == Robbery and trial == Pelletier usually worked together with a group of known criminals. On the night of 14 October 1791 he attacked a passerby in the rue Bourbon-Villeneuve in Paris and stole his wallet and several securities. He did this with a group of several people, who are unknown today. During the assault, he also killed the man. This is disputed today, it mightjust have beenan assault and robbery or also an assault, robbery, and rape. He was caught, and accused the same night. The cries for help had alerted other people, and a nearby guard arrested Pelletier. Judge Jacob Augustin Moreau, the District Judge of Sens,☃☃ was to hear the case. Pelletier routinely associated with a group of known criminals. On the night of 14 October 1791, with several unknown accomplices, he attacked a passerby in the rue Bourbon-Villeneuve in Paris and stole his wallet and several securities. During the robbery he also killed the man, though this is disputed in later literature as possibly just having been an assault and robbery or also an assault, robbery, and rape. He was apprehended and accused that same night, for the cries for help alerted some in the city, and a nearby guard arrested Pelletier. Judge Jacob Augustin Moreau, the District Judge of Sens, was to hear the case. A legal advisor was given to Pelletier. Despite his efforts and calls for a fairer court hearing, the judge ordered a death sentence for 31 December 1791. On 24 December 1791, the Second Criminal Court confirmed Judge Moreau's sentence. The execution was stayed, however, after the National Assembly made decapitation the only legal method of capital punishment. Pelletier waited in jail for more than three months as the guillotine was built in Strasbourg under the direction of the surgeon Antoine Louis, at a cost of thirty-eight livres. Meanwhile, the public executioner Charles Henri Sanson tested the machine on corpses in the Bicêtre Hospital. Sanson preferred the guillotine over the former decapitation by sword, as the latter reminded him of the nobility's former privileges that the revolutionaries had worked to eliminate. On 24 January 1792, a third criminal court confirmed the sentence. The execution was delayed again because of the ongoing debate on the legal method of execution. Finally, the National Assembly decreed on 23 March 1792 in favour of the guillotine. == Execution day == The guillotine was placed on top of a scaffold outside the Hôtel de Ville in the Place de Grève. Public executions had been held there during the reign of King Louis XV. Pierre Louis Roederer thought that many people would come to see the first-ever public execution-by-guillotine. Roederer thought that there might be difficulty in preserving order. He wrote to General Lafayette to ask for National Guardsmen to make sure the event went smoothly. The execution took place at 3:30 pm. Pelletier was led to the scaffold wearing a red shirt. The large crowd predicted by Roederer was already there. They were waiting, eager to see the new invention at work. The guillotine, which was also red in color, had been previously fully prepared, and Sanson moved quickly. Within seconds, the guillotine and Pelletier were positioned correctly, and Pelletier was decapitated. The crowd did not like the guillotine. They felt it was too swift and \"clinically effective\" to provide proper entertainment, as compared to previous execution methods, such as hanging, death-by-sword, or breaking at the wheel. The public even called out \"Bring back our wooden gallows!\" == Afterwards == Pelletier was the first person to be executed by guillotine. After the establishment of the Revolutionary Tribunal on 10 August, the guillotine moved to the Tuileries Palace. Executions were held either at the Place du Carrousel before the palace or the Place de la Révolution beyond its garden. The Revolutionary Tribunal executed just 28 people; the vast majority were for violent crimes like Pelletier's, unlike the subsequent Reign of Terror. == Notes == === References === * * * * * * * * * * * Category:1792 deaths Category:1756 births Category:Robbers Category:French criminals",
 "title": "Nicolas Jacques Pelletier"
}