{
 "id": "1099730",
 "text": "Laryea Kingston (born 7 November 1980) is a Ghanaian former professional footballer. He played either as an attacking midfielder or as a right winger. He was appointed as the Assistant Coach of the Ghana Under 17 National Team on 12 December 2022. Well known as an uncompromising and hard-working player by fellow professionals, he is also known as a no-look passer, he is regarded to be one of the best Ghanaian footballers of all time. ==Club career== Larry began his football career in 1996 at the age of 16 in Ghana at the Great Olympics club, then went on loan to the Libyan club Al-Ittihad in 2000. But just 4 months later he returned from Libya and in 2001 joins one of the leaders of Ghanaian football, the Hearts of Oak club. Two years later he moved to Israel, where he played for Maccabi Nazareth and Hapoel Tel Aviv until 2004. Kingston then moved to Russia to the Krylya Sovetov club from Samara and helped the team win bronze medals in the Russian Premier League. With his participation, the Samara club also reached the final of the Russian Cup, where, however, it unexpectedly lost to Terek Grozny, where Larry moved in the summer of 2005. However, Terek finished last in the Russian Championship in 2005 and left the Premier League, after which Kingston went on loan to Lokomotiv Moscow for the 2006 season. In the summer of 2006, Larry was disqualified for 6 championship matches for deliberately injuring Dynamo defender Leandro Fernandez. Since the rights to the player belonged to Terek, which was unable to return to the Premier League in 2007, Kingston left the club. Despite an offer from Bolton and interest from Newcastle and Fulham, Kingston moved to Scottish Hearts in January 2007, first on loan, and then signed a permanent contract for 3 years. On August 31, 2010, he moved to the Dutch club Vitesse as a free agent. The contract was signed for 1 year. On July 13, 2011, he signed a two-year contract with Hapoel Be'er Sheva. ==International career== He made his internatioanl debut for Ghana in 2002. Although being well-known to his fellow professionals as an uncompromising and hard-working player, Kingston's assertive style caused him problems at times, most notably when Lari represented Ghana at the 2006 Africa Cup of Nations, when he was sent off in Ghana's 1-0 win over Senegal after quarrels with Habib Beye. Both players were subsequently handed an unprecedented four-match ban, resulting in Kingston's exclusion from the 2006 World Cup for Ghana. However, in February 2007, he returned to the Black Stars and scored a goal in a winning (4:1) match against Nigeria in London. He was also excluded from the 2010 World Cup squad. ==References== ==Other websites== * * Appearances at londonhearts.com * * Kingston begs Gordon to stay at Hearts stv interview, 26 June 2007. Category:1980 births Category:Living people Category:Sportspeople from Accra Category:Ghanaian footballers",
 "title": "Laryea Kingston"
}