{
 "id": "1100211",
 "text": "Palestinian Authority Governments () refers to the governmental body of the Palestinian National Authority located in Ramallah from 1994 until its division in 2007 and finally its renaming to the Government of the State of Palestine in 2013 ().Russel, M. The Middle East and South Asia 2015-2016 == 2006 to 2011 == The Palestinian legislative election on 25 January 2006, was won by the Hamas movement (, an Arabic acronym for \"the Islamic Resistance Movement\"), and Ismail Haniyeh became Prime Minister of the State of Palestine. But, the national unity government collapsed when a violent conflict broke out between Hamas and the Fatah movement (), especially in especially in the Gaza Strip. After Hamas seized control of the Gaza Strip on 14 June 2007, Palestinian Authority President Mahmoud Abbas rejected the Hamas-led unity government and appointed Salam Fayyad as prime minister. Although the Fatah-led government claims authority over all of the West Bank and Gaza Strip, Hamas' control of the Gaza Strip meant that realistically Fatah controlled only the West Bank. The West Bank government's budget was mainly derived from various aid programs and the Arab League while the Hamas government in Gaza was mostly dependent on Iran until the beginning of the Arab Spring in 2011. == 2007 to 2014 == Since 2007, Fatah has continued to govern the remaining Palestinian-controlled cities and towns in the West Bank, while the Hamas government has continued to control the Gaza Strip. The reconciliation agreement to unify their governments that was signed in Cairo in 2011 was ratified by the Fatah-Hamas agreement in Doha in 2012 (ar, en). However, renewed tensions between them, and the impact of the Arab Spring (especially the crisis in Syria), delayed them acting on this agreement. In 2011, representatives of the authority failed to raise their status in the United Nations, although the status within UNESCO was raised to the level of state representation. In July 2012 it was reported that the Hamas government in Gaza was considering declaring the independence of the Gaza Strip with the support of neighboring Egypt. The unity government was sworn in on 2 June 2014. == References == Category:Fatah Category:Hamas Category:Hamas allies Category:History of Palestine",
 "title": "Palestinian government"
}