{
 "id": "1100166",
 "text": "Dumitru Găleșanu (born 5 December 1955) is a Romanian author and jurist. He is a postmodern poet-philosopher, writer, essayist and book illustrator. He has won prizes in several international literary competitions in Italy. His last literary creation was the book entitled Mirabile iubiri. Antologie de gânduri și amintiri/Mirabili amori. Antologia di pensieri e ricordi (\"Wonderful loves. Anthology of thoughts and memories\"), prose, Romanian-Italian edition, published in Bucharest on October 16, 2023. == Early life and professional career == Undergraduate education. After graduating from National College \"Mircea cel Bătrân\" (formerly \"Vasile Roaită\" High School of Mathematics and Physics) in Râmnicu Vâlcea, between 1981 and 1986 - Găleșanu attended undergraduate studies at the Babeș-Bolyai University in Cluj-Napoca, Faculty of Law: Legal Sciences profile, Law specialization. In the period between 1989 and 2014, he followed his professional career in the judicial field, fulfilling the function of magistrate-judge, first at the Mixed Section (Criminal law, Civil law) of the Râmnicu Vâlcea local first-instance Court, until 1997 and then continuing at the Civil Section I within the Vâlcea County Tribunal. He ceased professional activity on September 3, 2014. == Awards and distinctions == * Career Award, International Competition Prize \"Poetry, Prose and Figurative Arts\" and Theater Prize \"Angelo Musco\" (2016) * National Poetry Prize Competition (2018) * National Literary Competition (2019) == Published books == * Emoții în multivers/Emotions into multiverse (2010) * Pe corzile luminii/Sulle stringhe di luce (2011) * Fugă spre roșu/Fuggire verso il rosso (2012) * Însemnele materiei/Insegne della materia (2013) * Addéndum (2014) * Ante*metafizica: antologie lirică. Ediția I, bibliofilă (2015) * Tratat pentru nemurire/Trattato per l’immortalità (2016) * Axiomele infinității/Assiomi dell’infinità (2017) * Ante*metafizica: antologie lirică (2018) * Poetică metafizică/Poetica metafisica (2019) * Luminile omului: lirica filosofică(2020) * The Lights of Man: the philosophical lyric poetry (2021) * Le luci dellʼuomo: lirica filosofica (2021) * In aeternum poetic@ (2022) * Mirabile iubiri. Antologie de gânduri și amintiri/Mirabili amori. Antologia di pensieri e ricordi (2023) == References == ==Other websites== Category:1955 births Category:Jurists Category:Living people Category:Romanian writers Category:Romanian poets Category:Essayists Category:Philosophers Category:Illustrators Category:Judges Category:Romanian people",
 "title": "Dumitru Găleșanu"
}