{
 "id": "110052",
 "text": "Dromaeosaurs are a family of bird-like theropod dinosaurs. They include the famous Velociraptor and Deinonychus. They were small to medium-sized feathered carnivores which flourished in the Cretaceous period. They are often called raptors, a term popularized by the movie Jurassic Park. They were fast-running predators. Dromaeosaurs eventually had a world-wide distribution.Case J.A; Martin J.E. and Reguero M. 2007. A dromaeosaur from the Maastrichtian of James Ross Island and the Late Cretaceous Antarctic dinosaur fauna. Pp. 1–4 in Cooper A. Raymond C. and Team I.E. (eds) Antarctica: a keystone in a changing world. Online Proceedings for the Tenth International Symposium on Antarctic Earth Sciences, U.S. Geological Survey Open-File Report 2007-1047, SRP 083. U.S. Geological Survey, Washington D.C. Isolated teeth suggest they first appeared in the Middle Jurassic, 167 million years ago (mya). But more complete records are not found before about 124 mya in the Lower Cretaceous. They spread to all continents. The group survived until the end of the Cretaceous, 65.5 mya at the K/T extinction event. Although dromaeosaur teeth have been found in the Middle Jurassic, no dromaeosaurid body fossils have been found this early. ==Description== The Dromaeosaur skeleton suggests they were active, fast-running, and closely related to birds. Dromaeosaurs have a relatively large skull, serrated teeth, narrow snout, and forward-facing eyes with some degree of binocular vision. Dromaeosaurs, like most other theropods, had an S-curved neck, and their trunk was relatively short and deep. Like other maniraptorans, they had long arms, and relatively large hands with three long fingers ending in large claws. The dromaeosaur hip structure featured a large 'pubic boot' (part of the hip) projecting beneath the base of the tail. These hip bones were places muscle and tendons attached. Dromaeosaur feet bore a large, recurved claw on the second toe. Their tails were slender, and mainly used as a counterbalance. Some, and probably all, dromaeosaurs were covered in feathers, including large, vaned, wing and tail feathers. === Feet === Like other theropods, dromaeosaurs were bipedal; that is, they walked on their hind legs. Other theropods walked with three toes on the ground, but fossilized footprint tracks show that most dromaeosaurs held the second toe off the ground, with only the third and fourth toes bearing the weight of the animal. The enlarged second toe had an unusually large, curved sickle-shaped claw. It is thought to have been used in capturing prey and, in the smaller species, climbing trees. One dromaeosaur species, Balaur bondoc, had a first toe which was modified to be in parallel with the second. Both the first and second toes on each foot of B. bondoc were also held retracted and bore enlarged, sickle- shaped claws. Supporting Information ===Tail=== Dromaeosaurs had long tails. Most of the tail vertebrae bear bony, rod-like extensions, as well as bony tendons in some species. In his study of Deinonychus, Ostrom proposed that these features stiffened the tail so that it could only flex at the base, and the whole tail would then move as a single, rigid, lever. However, one well- preserved specimen of Velociraptor mongoliensis (IGM 100/986) has an articulated tail skeleton which is curved horizontally in an S-shape. This suggests that, in life, the tail could bend from side to side with some degree of flexibility. It has been proposed that this tail was used as a stabilizer and/or counterweight while running. In Microraptor, an elongate diamond-shaped fan of feathers is preserved on the end of the tail. This might have been used as a stabilizer and rudder during gliding.Chatterjee S. and Templin R.J. 2007. Biplane wing planform and flight performance of the feathered dinosaur Microraptor gui. Proceedings of the National Academy of Sciences, 104(5): 1576–1580. === Size === Dromaeosaurs were small to medium-sized dinosaurs, ranging from about 0.7 meters in length (2.3 ft, in the case of Mahakala) to over 6m (20 ft, in Utahraptor and Achillobator).Hwang S.H. Norell M.A. Ji Q. and Gao K. 2002. New specimens of Microraptorzhaoianus (Theropoda: Dromaeosauridae) from Northeastern China. American Museum Novitates, 3381: 44pp. https://digitallibrary.amnh.org/handle/2246/2870Perle A. Norell M.A. and Clark J. 1999. A new maniraptoran theropod - Achillobator giganticus (Dromaeosauridae) - from the Upper Cretaceous of Burkhant, Mongolia. Contributions of the Mongolian-American Paleontological Project, 101: 1–105. Some were larger: undescribed specimens of Utahraptor in the BYU collections may have been up to long.Britt |display-authors = etal 2001. New osteological data and the affinities of Utahraptor from the Cedar Mountain Fm. (Lower Cretaceous) of Utah. Journal of Vertebrate Paleontology, 21(3): 36A. Large size appears to have evolved at least twice among dromaeosaurs. A possible third lineage of giant dromaeosaurs is shown by isolated teeth on the Isle of Wight, England. The teeth belong to a Utahraptor-sized animal but are more similar in shape to the teeth of velociraptorines.Naish D; Hutt, and Martill D.M. 2001. Saurischian dinosaurs: theropods. in Martill D.M. and Naish D. (eds). Dinosaurs of the Isle of Wight. The Palaeontological Association, Field Guides to Fossils. 10, 242-309. Mahakala is both the most primitive dromaeosaur ever described and the smallest. This evidence, fits with Microraptor and the troodontid Anchiornis. It suggests the common ancestor of dromaeosaurs, troodontids, and birds – the 'ancestral paravian' – may have been small, around 65 cm in length and 600 to 700 grams mass. ===Feathers=== Fossils show that dromaeosaurs were covered in feathers. Some fossils preserve long feathers on the hands, arms and tail, as well as shorter, down-like feathers on the body. Other fossils, which do not preserve actual impressions of feathers, still preserve the associated bumps on the forearm bones where long wing feathers would have attached in life. Overall, this feather pattern looks very much like Archaeopteryx. The first known dromaeosaur with definite evidence of feathers was Sinornithosaurus. This was reported in China by Xu et al. in 1999. Many other dromaeosaur fossils have been found with feathers covering their bodies, some with fully-developed feathered wings. Microraptor even shows evidence of a second pair of wings on the hind legs. While direct feather impressions are only possible in fine-grained sediments, some fossils found in coarser rocks show evidence of feathers by the presence of quill knobs, the attachment points for wing feathers possessed by some birds. The dromaeosaurids Rahonavis and Velociraptor have both been found with quill knobs, showing that these forms had feathers despite no impressions having been found. So, it is most likely that even the larger ground-dwelling dromaeosaurs had feathers, since even flightless birds today have plumage. Relatively large dromaeosaurs, like Velociraptor, had feathers.Prum R. and Brush A.H. 2002. The evolutionary origin and diversification of feathers. The Quarterly Review of Biology, 77: 261–295. ==Paleobiology== ===Claw function=== There is some discussion about the function of the enlarged \"sickle claw\" on the second toe. When John Ostrom described it for Deinonychus in 1969, he interpreted the claw as a blade-like slashing weapon, much like the canines of some saber-toothed cats, used with powerful kicks to cut into prey. Adams (1987) suggested that the talon was used to disembowel large ceratopsian dinosaurs.Adams, Dawn (1987) \"The bigger they are, the harder they fall: Implications of ischial curvature in ceratopsian dinosaurs\" pg 1–6 in Currie, Philip J. and Koster, E. (eds) Fourth symposium on mesozoic terrestrial ecosystems. Tyrrell Museum, Drumheller, Canada The interpretation of the sickle claw as a killing weapon applied to all dromaeosaurs. In Manning's interpretation, the second toe claw would be used as a climbing aid when subduing bigger prey and also as stabbing weapon. Ostrom compared Deinonychus to the ostrich and cassowary. He noted that the bird species can inflict serious injury with the large claw on the second toe. The cassowary has claws up to long.Davies S.J.J.F. 2002. Ratites and Tinamous Oxford University Press. New York, USA The seriema also has an enlarged second toe claw, and uses it to tear apart small prey items for swallowing.Redford, Kent H. Peters, Gustav. 1986. Notes on the biology and song of the red-legged seriema (cariama cristata) Journal of Field Ornithology, 57, 261–269. The Manning team also compared the curvature of the dromaeosarid \"sickle claw\" on the foot with curvature in modern birds and mammals. Previous studies had shown that the amount of curvature in a claw corresponded to what lifestyle the animal has: animals with strongly curved claws of a certain shape tend to be climbers, while straighter claws indicate ground-dwelling lifestyles. The sickle-claws of the dromaeosaurid Deinonychus have a curvature of 160 degrees, well within the range of climbing animals. The forelimb claws they studied also fell within the climbing range of curvature.Manning P.L. |display-authors = etal 2009. Biomechanics of dromaeosaurid dinosaur claws: Application of X-ray microtomography, nanoindentation, and finite element analysis. The Anatomical Record: Advances in Integrative Anatomy and Evolutionary Biology, 292(9): 1397-1405. Paleontologist Peter Mackovicky said that small, primitive dromaeosaurids (such as Microraptor) were likely to have been tree-climbers, but that climbing did not explain why later, gigantic dromaeosaurids such as Achillobator retained highly curved claws when they were too large to have climbed trees. ===Group behavior=== Deinonychus fossils have been uncovered in small groups near the remains of the herbivore Tenontosaurus, a larger ornithischian dinosaur. This had been interpreted as evidence that these dromaeosaurs hunted in coordinated packs like some modern mammals. However, not all paleontologists found the evidence conclusive, and a study in 2007 by Roach and Brinkman suggests that the Deinonychus may have actually displayed a disorganized mobbing behavior. The first known extensive dromaeosaur trackway was found in Shandong, China. The trackway, (made by a large, Achillobator- sized species), showed the sickle-claw was held off the ground. Six individuals of about equal size moved together along a shoreline. The individuals were spaced about one meter apart, and retained the same direction of travel, walking at a fairly slow pace. The trackways are evidence that some species of dromaeosaurs lived in groups. While the trackways clearly do not represent hunting behavior, the idea that groups of dromaeosaurs may have hunted together can not be ruled out. ===Flying and gliding=== The ability to fly or glide has been suggested for at least two dromaeosaur genera. The first, Rahonavis was originally classified as avian bird, but found to be a dromaeosaur in later studies. It may have been capable of powered flight.. (HTML abstract). The forelimbs of Rahonavis were more powerfully built than Archaeopteryx, and show evidence that they bore strong ligament attachments necessary for flapping flight. Luis Chiappe concluded that, given these adaptations, Rahonavis could probably fly but would have been more clumsy in the air than modern birds. Another species of dromaeosaur, Microraptor, may have been capable of gliding using its well-developed wings on both the fore and hind limbs. A 2005 study by Sankar Chatterjee suggested that the wings of Microraptor functioned like a split-level \"biplane\", and that it likely employed a style of gliding, in which it would launch from a perch and swoop downward in a 'U' shaped curve, then lift again to land on another tree, with the tail and hind wings helping to control its position and speed. Chatterjee also found that Microraptor had the basic requirements to sustain level powered flight in addition to gliding. ==Classification== ===Relationship with birds=== Dromaeosaurs share many features with early birds (clade Avialae or Aves). The nature of their relationship to birds is under discussion. Mark Norell and colleagues analyzed a survey of coelurosaur fossils and suggested that dromaeosaurs were most closely related to birds, with troodontids as a more distant outgroup.Norell M. Clark J.M., Makovicky P.J. 2001. \"Phylogenetic relationships among coelurosaurian theropods.\" New Perspectives on the Origin and Evolution of Birds: Proceedings of the International Symposium in Honor of John H. Ostrom, Yale Peabody Museum: 49–67. In 2002, Hwang and colleagues suggested that birds (avialans) were better thought of as cousins to the dromaeosaurids and troodontids. The current consensus among paleontologists agrees with Hwang that dromaeosaurids are most closely related to the troodontids, and together with the troodontids form the clade Deinonychosauria. Deinonychosaurians in turn are the sister taxon to avialans, and therefore the closest relatives of avialan birds.Senter, Phil |display- authors = etal 2004. Systematics and evolution of Dromaeosauridae (Dinosauria, Theropoda). Bulletin of the Gunma Museum of Natural History 8: 1–20. A consensus of paleontologists has concluded that there is not yet enough evidence to say whether any dromaeosaurs could fly or glide, or whether they evolved from ancestors that could. ====Other ideas==== At least two schools of researchers have proposed that dromaeosaurs may actually be descended from flying ancestors.Paul, Gregory S. 2002. Dinosaurs of the Air: the evolution and loss of flight in dinosaurs and birds. Baltimore: Johns Hopkins University Press. 472 pp.Olshevsky, George. 1994. The birds first? A theory to fit the facts — evolution of reptiles into birds. Omni, June 1994. Volume 16 No. 9 In 2002, Hwang et al. found that Microraptor was the most primitive dromaeosaur. Xu and colleagues in 2003 cited the basal position of Microraptor, along with feather and wing features, as evidence that the ancestral dromaeosaur could glide. In that case the larger dromaeosaurs would be secondarily terrestrial—having lost the ability to glide later in their evolutionary history. A few researchers, like Larry Martin, believe that dromaeosaurs, along with all maniraptorans are not dinosaurs at all. Martin asserted for decades that birds were unrelated to maniraptorans, but in 2004 he changed his position, and now he agrees that the two are the closest of relatives. Martin believes that maniraptorans are secondarily flightless birds, and that birds evolved from non–dinosaurian archosaurs, so that most of the species formerly called theropods would now not even be classified as dinosaurs.Martin L.S. 2004. A basal archosaurian origin for birds. Acta Geologica Sinica, 50(6): 978–990. A challenge to all of these alternative scenarios came when Turner and colleagues in 2007 described a new dromaeosaur, Mahakala, which they found to be the most basal and most primitive member of the Dromaeosauridae, more primitive than Microraptor. Mahakala had short arms and no ability to glide. Turner et al. also inferred that flight evolved only in the Avialae, and these two points suggested that the ancestral dromaeosaurid could not glide or fly. Based on this cladistic analysis, Mahakala suggests that the ancestral condition for dromaeosaurids is non-flying. ===Phylogeny and taxonomy === The family Dromaeosauridae was named in 1922, with only one new genus Dromaeosaurus.Matthew W.D. and Brown B. 1922. The family Deinodontidae, with notice of a new genus from the Cretaceous of Alberta. Bulletin of the American Museum of Natural History, 46: 367–385. Dromaeosauridae, along with Troodontidae, make up the infraorder Deinonychosauria. Dromaeosauridae was first defined as a clade by Paul Sereno in 1998, as the most inclusive natural group containing Dromaeosaurus but not Troodon, Ornithomimus or Passer. The various \"subfamilies\" have also been re-defined as clades. The subfamilies of Dromaeosauridae is not yet settled. Mahakala, for example, the most primitive dromaeosaur in terms of structure, falls outside any named sub-group. The most basal subfamily of dromaeosaurs is often found to be the Unenlagiinae. All known dromaeosaur skin impressions come from this group, and all show an extensive covering of feathers and well-developed wings. Some species may have been capable of active flight. The following classification of the various genera of dromaeosaurids is based on studies by Sereno (2005), Senter (2004), Makovicky et al. (2005), Norell et al. (2006), and Turner et al. (2007).Makovicky, Peter J. |display-authors = etal 2005. The earliest dromaeosaurid theropod from South America. Nature, 437: 1007–1011. Norell M.A. |display-authors = etal 2006. A new dromaeosaurid theropod from Ukhaa Tolgod (Omnogov, Mongolia). American Museum Novitates, 3545: 1–51.Sereno P.C. 2005. Stem Archosauria—TaxonSearch [version 1.0, November 7, 2005 * Family Dromaeosauridae ** Subfamily Dromaeosaurinae *** Achillobator *** Dromaeosaurus *** Utahraptor ** Subfamily Microraptorinae *** Cryptovolans *** Graciliraptor *** Hesperonychus *** Microraptor ** Subfamily SaurornitholestinaeLongrich, N.R. and Currie, P.J. 2009. A microraptorine (Dinosauria–Dromaeosauridae) from the Late Cretaceous of North America. Proceedings of the National Academy of Sciences, online preprint 16 March 2009. *** Atrociraptor *** Bambiraptor *** Saurornitholestes ** Subfamily UnenlagiinaeBonaparte, (1999). *** Austroraptor *** Buitreraptor *** Neuquenraptor *** Rahonavis *** Unenlagia ** Subfamily VelociraptorinaeBarsbold, R. (1983). \"O ptich'ikh chertakh v stroyenii khishchnykh dinozavrov. [\"Avian\" features in the morphology of predatory dinosaurs].\" Transactions of the Joint Soviet Mongolian Paleontological Expedition 24: 96–103. [Original article in Russian.] Translated by W. Robert Welsh, copy provided by Kenneth Carpenter and converted by Matthew Carrano. PDF fulltext Velociraptorinae is a subfamily of the Dromaeosauridae. It existed from the Late Jurassic period to the end of the Cretaceous period. The Velociraptorinae consists of Velociraptor, Deinonychus, Tsaagan, Saurornitholestes, and Balaur. Teeth belonging to a giant velociraptorine the size of Utahraptor have also been reported from the Isle of Wight, England. In general, velociraptorines tend to have longer, narrower jaws and more slender bodily proportions than the dromaeosaurines. *** Adasaurus *** Balaur *** Deinonychus *** Linheraptor *** Nuthetes *** Tsaagan *** Velociraptor ==In popular culture== A Deinonychus appears in John Brosnan's 1984 novel Carnosaur and its movie adaptation though the book itself received little press attention. Velociraptor, a dromaeosaur, got attention after it was featured in the 1993 Steven Spielberg movie Jurassic Park. However, the size of the Velociraptor in the movie is much larger than the largest members of that genus. Robert Bakker recalled that Spielberg had been disappointed with the dimensions of Velociraptor and so upsized it. Michael Crichton used the name Velociraptor for the much larger raptor in his novels, on which the first two movies were based. The depiction of the dromaeosaur in the original Jurassic Park movie, while accurate for its time, is now known to have been inaccurate in some respects, such as the lack of feathers. While Jurassic Park III attempted to address this last oversight by adding quill-like structures around the head of some of its dromaeosaurs, they did not resemble the structure or distribution of actual dromaeosaurid feathers known from fossil remains. Dromaeosaurids also appear in many of The Land Before Time movies, beginning with the third. ==References== ==Other websites== * Dromaeosauridae at DinoData. * The Dromaeosauridae: The Raptors!, from the University of California Berkeley Museum of Paleontology. * Dromaeosauridae , by Justin Tweet from Thescelosaurus. * Dinosaurs – Complete and free online edition of the book \"Dinosaurs\" as written by W. D. Matthew (cited in this article with authorship of the family Dromaeosauridae), and former Curator of Vertebrate Paleontology at the American Museum of Natural History in New York; Originally published in 1915 * Dromaeosauridae , Dinosaur-world reference with in-depth description and pictures of many dromaeosauridae dinosaurs Category:Theropods",
 "title": "Dromaeosaur"
}