{
 "id": "1100530",
 "text": "The Rookie is an American police procedural crime drama television series made by Alexi Hawley for ABC and available on Hulu. The show is about John Nolan, the oldest rookie, a man who, from what seems to be a walking mid-life crisis, and two other rookies as they rank up in their careers. The show returned for Season 5 on September 25, 2022. The series returned in 2024 following the SAG and AFTRA Strikes. == Plot == John Nolan, a man in his forties, joins the Los Angeles Police Department (LAPD) after suffering after a traumatic bank robbery. He and two other rookies, Lucy Chen and Jackson West, participate in procedure crime with the help of their TOs (training officers), Angela Lopez, Talia Bishop, and Tim Bradford. As the show furthers, some of the TOs improve in the ranks, and some quit. John Nolan's TO, Talia Bishop, did not return for Season 2 and was replaced with Nyla Harper for the remainder of John's rookie period. Jackson West also gets a new TO for the remainder of his rookie period after Angela Lopez gets promoted to detective, Doug Stanton, a racist bad cop who wants everyone to respect the police force and sometimes abuses his power to spread his message. In the Season 3 finale, Angela Lopez and Jackson West are kidnapped during Angela's wedding. In the Season 4 premiere, Jackson West was shot and killed after attempting to save Angela. The show afterward continues with Nyla Harper getting a new rookie, Aaron Thorsen, who was involved in a murder case but was found not guilty. == Cast == * Nathan Fillion as John Nolan, the oldest rookie and the series's protagonist. * Alyssa Diaz as a previous TO, Angela Lopez is now a detective. * Richard Jones as Wade Grey, the current watch commander and Sergeant in the LAPD. In the series, he is unsure if he should retire. * Titus Makin Jr. as Jackson West, a rookie whose dad is commander of IA (internal affairs) and also very eager to join the police force as a young officer. He is gay and dates three guys during his time in the series. * Mercedes Mason as Zoe Andersen, in Season 1, she is the watch commander but is killed late in the season after attempting to save Nolan from being killed. * Melissa O'Neil as Lucy Chen, a rookie who becomes a policeman early in the series. In season 2, she and Jackson West become roommates. * Afton Williamson as Talia Bishop, a TO who does not return for the second season and moves to Bureau of Alcohol, Tobacco, Firearms and Explosives instead. * Eric Winter as Tim Bradford, a TO and veteran who becomes a Junior Sergeant after taking the exam to become one. * Mekia Cox as Nyla Harper, a TO who was an undercover detective, goes back to patrol after instances of her being involved dangerously in her daughter's life to make amends and improve her life. * Shawn Ashmore as Wesley Evers, a criminal defense lawyer who marries and impregnates Angela Lopez. * Jenna Dewan as Bailey Nune, a firefighter who is John Nolan's current girlfriend. == Notes == == References == == Other websites == * * * The Rookie at AppleTV+ Category:2018 television series debuts",
 "title": "The Rookie (TV series)"
}