{
 "id": "1100399",
 "text": "Pebet is a bird species mentioned in Meitei mythology and folklore of Kangleipak (present day Manipur). It was believed to be a small sized bird, smaller than a sparrow. It was believed to be almost extinct. == Meeting with a cat == Once a mother pebet had many children newly hatched from her eggs. At the same time, a cat () came to her. The cat secretly wished to eat her children. He claimed himself as being a monk cat (). He asked her if he was good looking. Mother pebet knew his secret intentions. She also knew that he was not actually handsome. She also knew that she and her chicks might be in trouble if she told him the truth. So, she told him that he was as beautiful as a red flower of the bamboo plants. The cat got satisfied and happy. He went away. He frequently visited her to ask the same question. Every time, mother pebet compared him to beautiful objects of nature. And the cat gave the same good reaction.Bharucha, Rustom. The Theatre of Kanhailal: Pebet & Memoirs of Africa. India: Seagull Books, 1992. Many times passed, the pebet children grew up. So, mother pebet taught her children how to fly. Once her children learned how to fly, she had less worry about the safety of her children from the bad cat. So, when the cat came and asked her the same question as usual, she told him the truth. She told him that he was ugly. She compared the cat's ugly face with the bottom of a black pot. She even scolded him for asking such a question. The cat was surprised to see mother pebet's sudden change in her behavior. At the same time, he was very angry. So, he decided to eat mother pebet and her children. At that moment, mother pebet told her children to fly. So, all her children flew. Unluckily, the youngest pebet child was caught by the cat. Mother pebet decided to save her child using her wisdom. So, she told the cat that there was a good way to eat pebet birds. She told him that the pebet should be washed nicely and then be put on a leaf (usually banana leaf) for sun bathing. The foolish cat believed mother pebet's words. So, he did the same. Once the young pebet was properly sun bathed and her feathers got dried, mother pebet told her to fly. Having more strength after sun bathing, the young pebet flew away quickly. The cat tried to catch her but he failed. Coincidentally, the flying young pebet pooped in the hands of the cat. The cat ate the poop without thinking twice. He thought that if the poop was so delicious, then the real pebet itself would be more delicious. Mother pebet and her children successfully escaped from the bad cat and lived happily ever after. == Meeting with an elephant == Once there was a mother pebet and her children. A group of elephants used to pass by near their nest. Pebet children were very scarred of the big elephants. They asked their mother to tell them not to come near their nest. Mother pebet requested each elephant in the herd to be careful while coming near their nest. Each elephant agreed to her request except one. The exceptional elephant was so proud of his big and strong body. He laughed at the mother pebet's words. He even destroyed her nest and her children. Mother pebet decided to take revenge. She worshipped goddess Leimarel for a long time. After some time, the mother goddess appeared and told her some advices. According to it, mother pebet pricked the back of the proud elephant using her beak. She did it again and again until the elephant bled. Once it started bleeding, mother pebet invited a group of flies to drink the blood and even lay their eggs there. The flies did so. Due to this, the elephant's body was badly injured. Its health got worsened day by day. Finally, the proud elephant apologized to the mother pebet for its past misbehavior. Mother pebet forgave him and helped him to recover giving healing herbs. In another version of the story, the elephant died due to the infection. == Meeting with a tiger == Once there was a pebet family. There was a pebet couple and their children. A tiger used to pass near their house very frequently. Lady pebet was frightened by the presence of the tiger. She felt unsafe for her children. Her husband told her a plan to scare the tiger away. So, the next time when the tiger passed by, mother pebet pinched her children to cry loudly. Husband pebet loudly told his wife to keep the crying children quite. She answered to him that the children were asking her to give tiger meats at that odd time. She said that she had given them some dried tiger meats but her children were demanding fresh tiger meats. The pebet couple were talking loudly to make the tiger hear them. Hearing those words, the tiger thought that those pebets were not normal pebets. Thus, he ran away and never came back. == Meeting with a vulture == Once a pebet and a vulture had a disagreement about who would be the next king of the birds. Vulture claimed he was the strongest and thus, he deserved to be the king. Pebet claimed that he was wiser than him, and thus, he deserved to be the king. Pebet called the vulture as a fool. The vulture got angry. He tried to kill the pebet. He chased the pebet. The pebet flew among the \"shaneibi\" bamboo plants to save himself. As he had a small body, he fitted to be among the bamboo plants. The vulture forgot his own size. So, in anger, he flew among the bamboo plants towards the pebet. He hit himself to the bamboo plants and died. Following the vulture's death, pebet became the king. == In popular culture == A classic Meitei play named \"Pebet\" was directed by Heisnam Kanhailal. The story of the play was based on that of the pebet birds facing threat from a monk cat. In the particular play, the folktale was compared to the Hinduisation and Sanskritisation (domination of traditional Meitei culture by Hindu culture) in Manipur. It was performed in different international theatrical shows. It was first shown in the year 1976. It was shown in the Prithvi Theatre Festival in 2006. It was also shown in the International Theatre Conference 2015 of the International Federation for Theatre and Department of Theatre Arts, University of Hyderabad. In 2017, the same play was performed in the Theatre Workshop of the Banga Bhavan Silchar, organised by the Bhabhikal, Silchar and the Sangeet Natak Akademi, Delhi. In 2017, the same play was performed on the second day of the 19th Bharat Rang Mahotsav in India. Heisnam Kanhailal portrayed his wife Sabitri Heisnam as the mother pebet in the play. == Related articles == * Keibu Keioiba == References == == Other websites == * Pebet at Internet Archive * Pebet at Category:Meitei mythical creatures Category:Extinct birds",
 "title": "Pebet"
}