{
 "id": "1100022",
 "text": "Islam is the state religion of Saudi Arabia, officially known as the Kingdom of Saudi Arabia, which is located in the Arabian Peninsula. It is the place where the Qur'an (Muslim holy book) was revealed to Prophet Muhammad, and it is where he lived and died. Saudi Arabia is the place of pilgrimage (a journey made by followers of a religion) for Muslims across the world. It is where two Islamic holy cities exist, called Mecca and Medina. After the death of the Prophet Muhammad many Islamic empires ruled over Arabia, from Umayyad Caliphate until the Ottoman Empire. The unification of Saudi Arabia was declared by King Abdulaziz Al-Saud in September 1932. The unification of the two main sections of Arabia, the Nejd and the Hejaz, was helped by a political alliance between an Islamic scholar called Muhammad ibn Abd al-Wahhab and the House of Saud. The doctrine of Abd al-Wahhab is still the official doctrine of Saudi Arabia today. However, the current Crown Prince, Muhammad bin Salman Al- Saud, has recently attempted to remove ties between the Saudi state and the religious movement. Current challenges within the country include the aim to transform and modernise the Hajj, which is the pilgrimage that all Muslims are required to go on at least once in their lives, if they are physically and financially able to. These include the building of a metro system to facilitate the mass transport of pilgrims to Medina. The vast majority of Saudi Arabia's population are Muslim, at 94%. 85-90% of these Muslims are Sunni Muslims. 10-12% of these are Shi'a Muslims. Other religions are also represented in the Saudi demographic, including Christians and Hindus. The constitution of Saudi Arabia is based on Sharia law (which are the rules and laws given to Muslims by God) and the Sunna (the traditions based on the lifestyle of the Prophet Muhammad). == Birth of Islam == === The First Quranic Revelation === The Prophet Muhammad was born in Mecca in 570 A.D. He lived in what is now called Saudi Arabia. The first year of the Arabic calendar begins in 622 A.D, when Muhammad moves (in Arabic, hijra) from Mecca to Medina. These are the two holy cities in Islam, which are in Saudi Arabia. The pre-Islamic name for Medina is Yathrib. This is the word used by the Prophet Muhammad. According to Islamic tradition, the Qur'an was revealed to Muhammad over 23 years. They began when he 40 years old until his death at 63. The first revelation happened during the month called Ramadan. The revelation was brought by the angel Gabriel, who told him to repeat the word of God (in Arabic, Allah). : \"Read in the name of your Lord who created : Created man from a clinging substance. : Read, and your Lord is most Generous– : He who taught by the pen– : Taught man that which he knew not.\" === After the death of Prophet Muhammad === After the Prophet Muhammad's death, the Arabian Peninsula had united into one Muslim community because of his military conquest. This was done by the conquering of many Arabian tribes, including the Quraysh tribe (the tribe that the Prophet belonged to ), the Aws tribe, and lots of smaller Jewish communities. The first four men to lead the Muslim community after the death of the Prophet Muhammad are known as the Rashidun, which means rightly guided in Arabic. These four Caliphs (which means means 'successor of Muhammad' in Arabic) were Abu Bakr, Umar, Uthman, and Ali. Many Muslims believe that this was the last generation of true Muslim leaders, which is why there are known as the Rashidun. == Islam in Medieval Arabia == === Sunni movements === In the medieval period, the Arabian peninsula was united under multiple Islamic empires, called Caliphates. These empires were mostly Sunni empires. Sunni is one of two branches of Islam. Sunni Muslims believe the legitimacy of Muslim rulers came from their level of adherence to Muslim values, such as performing the pilgrimage Hajj, doing jihad, and ruling by Islamic law. Sunni Islam is the branch of Islam that is still the most widely practiced in Saudi Arabia today. Sunni Empires Empire (Caliphate) Kings (Caliphs) Period Map Umayyad Caliphate 14 Caliphs, including Muawiya I ibn Abu Sufyan (first Caliph) and Umar ibn Abd al-Aziz, who is credited with making the empire more efficient. 661-750 A.D Abbasid Caliphate 37 Caliphs, including al-Saffāḥ (the first Caliph, and relative of Prophet Muhammad's uncle) and al- Manṣūr (who founded the city of Baghdad). 750 -1258 A.D Ayyubid Empire (or Sultanate) 9 Sultans (rulers), including the founder Saladin, who fought against French, English and Holy Roman forces in the Third Crusade. 1171–1260 A.D Mamluk Empire (or Sultanate) 53 Sultans, including Tumanbay II (the last Sultan). 1250 - 1517 A.D Ottoman Empire 36 Sultans, including Osman I (founder), and Mehmed II (conquered Constantinople). 1299 - 1922 A.D === Shi'ite movements === The second main branch of Islam is called Shi'ism. There are less Shia Muslims in the world than Sunni Muslims. There were less Shia empires than Sunni empires in Arabia. They are more powerful in Persia (Iran), where they have ruled since 791 A.D. Shi'as, unlike Sunni Muslims, believe that leaders should be related to the Prophet Muhammad and the fourth Rashidun Caliph, Ali. Shi'ite Empires Caliphate Caliphs Period Map Fatimid Empire 14 Caliphs, including al-Hakim bi-Amr Allah (who saw the mass conversion of many Christians and Jews in Egypt). 909 - 1171 A.D Islamic empires have ruled the region of Arabia called the Hejaz (the strip of land where Mecca and Medina are) since the first Caliphate, the Rashidun. Most later empires, like the Fatimids and the Mamluks only ruled this area of Arabia because of its religious significance. == Islam and the House of Saud == === Muhammad ibn Abd-al Wahhab === Muhammad ibn Abd-al Wahhab (Arabic: مُحَمَّد بْن عَبْد ٱلْوَهَّاب بْن سُلَيْمَان ٱلتَّمِيمِيّ) was an Islamic scholar and thinker who lived in the 18th century in Arabia. He believed that the modern, Western world had made Muslims unfaithful to their religion because of practices like the worshiping of idols (in Arabic, shirk, which is strictly prohibited in Islam). Ibn-Wahhab argued that Muslims must stop using medieval traditions and thought. Instead, they should directly use the Qur'an and the hadith (the writings about the life of the Prophet Muhammad) to adhere to Islamic law. Abd-al Wahhab created an alliance with Muhammad ibn-Saud, who was a tribal leader in the Nejd region of Arabia. This alliance meant that Wahhabism (the name given to the collection of beliefs of Muhammad ibn Abd-al Wahhab) and the future state of Saudi Arabia became inseparable. === Wahhabism === Wahhabism is the main form of Islam practiced in Saudi Arabia today. It is also the official state form of Islam. The continued alliance between the religious doctrine and the Kingdom of Saudi Arabia is seen when the ulema (religious scholars) have issued fatwas (religious rulings) to support the political aims of the government. For example, in 1990 when the ulema approved the presence of American army troops in Saudi Arabia during the First Gulf War, and in 1993 when it approved peace with Israel. There were two highly controversial fatwas which discredited the Wahhabi movement for many Saudis. === Wahhabism under Mohammad bin Salman al Saud === In recent years, Crown Prince Mohammad bin Salman Al Saud has aimed to break ties between Saudi Arabia and Wahhabism by making cultural and political reforms. Most famously, these include allowing women to drive cars, which was made law in 2018, and welcoming music festivals, such as MDLBEAST Soundstorm. He has also directly criticised the Wahhabi ulema and their practices. For example, he has criticised the use of hadith to justify the use of capital punishment against religious crimes, as outlined in the 1932 Basic Law of Governance. Under Mohammad bin Salman's rule, the official date of the independence of the Kingdom of Saudi Arabia changed from 1745 A.D (the year when the alliance between the House of Saud allied with Sunni scholar Mohammad ibn Adb-al Wahhab) to 1727 A.D (the year when the first al Saud ruler established himself as a tribal leader in the Nejd). This change highlights Mohammad bin Salman's aim to remove ties between Wahhabism and the Kingdom of Saudi Arabia. == Hajj == The Hajj is a pilgrimage to the Kaaba, a stone monument that is covered in black silk. It is in Mecca. The Hajj began as a formal pilgrimage in the seventh century, when the Prophet Muhammad was alive. Hajj is one of five ‘pillars’ of Islam. This means it is one of the obligatory acts of worship for Muslims. The Hajj also includes many other rituals during the forty day event. These include walking around the Kaaba in a circle (in Arabic, tawaf) and travelling in between the hills of Safa and Mawra 7 times. Millions of Muslims travel for the Hajj every year. For the 2023 season, the number of visitors for the Hajj was about 1.8 million, the majority of them male. The number of women partaking in the Hajj has increased from one-third to nearly one-half over the last 40 years. === Hajj Infrastructure === This modernisation includes the building of new train lines, with a 450km metro line that connects Mecca to Medina. The modernisation of the Hajj pilgrimage route caused the destruction of more than 300 historical buildings in the past sixty years. The Saudi Federation for Cybersecurity, Programming and Drones (SAFCSP) organised a \"Hajj hackathon\" in Jeddah. Engineers had to introduce new technologies to facilitate the pilgrims experience in Saudi Arabia. This contest was created to find ways to prevent deadly accidents and natural disasters that have impacted the Hajj in the past. European countries have tried to get involved in the Hajj for economic reasons. A Dutch shipping union called Kongsi Tiga transported pilgrims to Saudi Arabia from the Dutch West Indies. In 1986, King Fahd expanded his official title \"His Majesty\" to include \"Custodian of the Two Holy Mosques\" (romanised: Khadim Al-Haramain Al-Sharifain. In Arabic: خَادِمُ ٱلْحَرَمَيْنِ ٱلشَّرِيفَيْنِ). This was to send the message that Mecca belongs to the Saudi King. It has been used by every King since. == Population and demographic == The population of Saudi Arabia is estimated to be 35.4 million in 2022. About 21 million (85 to 90%) of the Saudis are Sunni Muslims. Shia Muslims are 10 to 12% of the Saudi citizen population. They are mainly located in the eastern part of the country, near Qatar and Bahrain. Saudi Arabia also has a non- Muslim population. There are about 2 million Christians and 700,000 Hindus living in Saudi Arabia. Saudi Arabian cities (the two main ones being Riyadh and Jeddah) are home to 82.1% of the total population. Only about 17.9% of the population lives in rural areas. Saudi Arabia Demographic (By religion in 2023) Islam 34.85 Million 93% Christianity 1.65 Million 4.4% Hinduism 0.41 Million 1.1% Religiously unaffiliated 0.26 Million 0.7% Folk or traditional religions 0.11 Million 0.3% Buddhism 0.11 Million 0.3% Others 0.07 Million 0,2% == Legal system == The country's official religion is Islam. The constitution is based on the Qu'ran and Sunna (rules based on prophet Muhammad's life). The legal system is based on Sharia law, which is given by God and interpreted by religious scholars. The features of the Saudi government and legal system are stated in the 1992 Basic Law of Governance. It states the importance of national unity and education, family, virtue and Islam for the society of Saudi Arabia. The Basic Law of Governance states many religious crimes which are punishable by death. For example, the charge of apostasy (in Arabic, ridda, which means a Muslim changing his religion) is punishable by death. This has not happened in recent years. Also, anti- terrorism laws state that it is a criminal act to question the basics Islam, or promoting atheist (non-religious) thought. Some non-Muslim foreigners who wish to gain citizenship must show they have become Muslim. == Related pages == *Islam by country ==References== Saudi Arabia Category:Religion in Saudi Arabia",
 "title": "Islam in Saudi Arabia"
}