{
 "id": "1100001",
 "text": "Tony Hawk's Downhill Jam is a skateboarding racing video game. It was published by Activision and was developed by Vicarious Visions. It is a spin- off of the Tony Hawk's series by Neversoft. It was released on October 24, 2006 for the Nintendo DS, November 1, 2006 for the Game Boy Advance, November 14, 2006 on the Wii, May 8, 2007 on the PlayStation 2, and in 2007 for Mobile. In the game's story mode, the player is a member of Tony Hawk's skating team. They must try and recruit other skaters to join the team. The team will then face a team of Hawk's rival Antonio Segul. The story mode is only in the DS version. Like in most games in the series, the player can do skateboarding tricks and grinds to boost their score while skating around the levels. There are also objectives in the game that the player can do to unlock new areas. In the Downhill Challenge mode, players control either Tony Hawk or Kevin Staab. They compete around the world in a series of events such as racing and seeing who can achieve more points from tricks. ==Reception== The game was given mixed reviews by game critics. Critics said that they liked the visuals and that there was the ability to play online. However, they also said that they found it difficult to play against three other players and that the game was buggy. The controls were also criticized for not being adapted well in the downhill mode. ==References== Category:2006 video games Category:Tony Hawk video games Category:Activision video games Category:Toys for Bob games Category:Vicarious Visions games Category:Game Boy Advance games Category:Multiplayer and single-player video games Category:Multiplayer online games Category:Nintendo DS games Category:Nintendo Wi-Fi Connection games Category:PlayStation 2 games Category:Racing video games Category:Single- player video games Category:Skateboarding video games Category:Video game spin-offs Category:Video games developed in the United States Category:Video games set in Paris Category:Wii games",
 "title": "Tony Hawk's Downhill Jam"
}