{
 "id": "1100923",
 "text": "The Ghat tree frog or starry-eyed Ghat tree frog (Ghatixalus asterops) is a frog. It lives in India in the Western Ghat mountains, in the Palani Hills and south of the Palghat Gaps. ==Appearance== The adult male frog is about 38.8 mm – 44.8 mm long from nose to rear end and one adult female frog was 58.1 mm. Adult frogs can be different colors. The skin of the frog's back is dark gray or light gray in color with brown marks. Or it can be yellow-brown in color with red marks. The skin near the eardrum is light gray with brown spots. The sides of the body are yellow with some brown color. The four feet are light blue-white with blue-brown marks on the webbed skin. The upper hind legs are blue-brown in color. The iris of the eye is brown in color with thick gold lines. This makes the frog's eyes look like gold stars. There is also a gold circle around the outside of the pupil. The young frogs can be light green or light brown in color. ==Home== People see this frog in shola forests high in the hills. People have seen it in the dead leaves on the ground. These frogs spend more time near streams that are only sometimes there than in streams that are always there. People have also seen it on tea farms. People have seen this frog between 1300 and 2000 meters above sea level. This frog spends time on the ground. It does not live in trees the way many other frogs in Rhacophoridae do. If something frightens this frog, it will hide in the water. ==Tadpoles== The female frog makes a nest out of foam on rocks in the stream, on the sides of the stream, or sometimes on tree trunks near the stream. The eggs hatch into tadpoles that live in rocky streams where the water flows fast. The tadpoles have large suckers on their mouths that they use to hold onto the rocks and keep still in the fast water. ==Danger== Scientists believe this frog is in danger of dying out because it lives in such a small place. Human beings have cut down the trees in the forests where it lived. People build farms. Chemicals can also hurt this frog. Scientists say climate change is a threat to this frog. ==Other frogs== Scientists say this frog is a sister species to Ghatixalus variabilis. That means the two species were the same species millions of years ago and came apart later. ==References== Category:Frogs of Asia",
 "title": "Ghatixalus asterops"
}