{
 "id": "1100085",
 "text": "Drug-induced amnesia is amnesia caused by drugs. Amnesia may be good for medical treatment or it may be a side-effect of a drug, such as alcohol, or certain medicine for mental disorders, such as benzodiazepines. == Medical usage == Amnesia is sometimes good during surgery, so general anaesthesia is made to create amnesia for the time of the surgery. Drugs such as benzodiazepines, which are commonly used for anxiety disorders, can reduce the creation of new memories, even more in high doses (for example, before a surgery so that person will not remember the surgery). Amnestic drugs can be used to create a coma for a child breathing using medical devices, or to help reduce cranial pressure after head trauma. [failed verification] Researchers are experimenting with drugs which create amnesia so that they can improve understanding of human memory, and create better drugs to treat mental disorders and memory-related disorders. People with Alzheimer's disease and other forms of dementia are likely to improve from this. By knowing the ways that amnesia-inducing drugs interact with the brain, researchers are trying to know the ways that neurotransmitters help in the creation of memory. By stimulating rather than depressing these neurotransmitters, memory may improve. == Non-medical drug-induced amnesia == Amnesia can be a side-effect of prescription or non-prescription drugs. Both substance use and alcohol can cause both long-term and short-term memory loss, resulting in blackouts. The most commonly used group of prescription drugs that can create amnesia are benzodiazepines, it can create even more memory loss if combined with alcohol. == In popular culture == * The SCP Foundation has mentioned amnesia-inducing drugs in many of its articles and stories since its creation. They are under the name \"amnestics\". Amnestics are used to keep the SCP Foundation a secret from the public. * In Eternal Sunshine of the Spotless Mind (2004), Joel Barish (Jim Carrey) decides to forget his former lover Clementine Kruczynski (Kate Winslet) after she erases her memories of him. * The characters in The Hangover (2009) deal with the aftermath of amnesia after taking roofies. * An episode of Arrested Development called Forget-Me-Now talks about the use of drug-induced amnesia for people who have seen how magicians' tricks are performed. * In the book Allegiant (2013) a \"memory serum\" is used to erase people's memories. * In Andy Weir's novel Project Hail Mary, Ryland Grace wakes up from a coma that was caused by drug-induced amnesia. == In mythology == Nepenthe, which is named named anti-sorrow, is a substance talked about in the Odyssey given to Helen of Troy, said to come from Egypt. Eating it causes sad memories to be forgotten.. == References == Category:Amnesia",
 "title": "Drug-induced amnesia"
}