{
 "id": "1100035",
 "text": "The European Network for Conservation-Restoration Education (ENCoRE) is a network organisation of higher educational institutions in the field of conservation-restoration, based in Vienna, Austria. The objective of ENCoRE is to promote teaching and research in the field of conservation-restoration of cultural heritage, based on the guidelines and recommendations of the E.C.C.O. Professional Guidelines , the E.C.C.O. Competences for Access to the Conservation- Restoration Profession and the Document of Pavia. == Organisation and objectives == ENCoRE was established in 1997 with the primary goal of advancing research and education within the realm of cultural heritage. Additionally, it aims to sustain the momentum of past initiatives, such as PhD Colloquiums and Topical Conferences, and to remain at the forefront of conversations surrounding the evolving landscape of conservation and restoration education. Currently ENCoRE has 41 full members and 1 associate members from among the leading conservation-restoration study programmes in Europe. In addition, 26 leading institutions and organisations working in the field of cultural heritage protection and research are partners of the network. Since March 2002, the E.C.C.O. working group on Education, Qualification, and Practice has maintained close contact with ENCoRE. Both E.C.C.O. and ENCoRE advocate the view that the recognition of the conservation-restoration profession is intrinsically tied to the recognition of its educational foundation. Additionally, similar to other professions, the professional standards of conservator-restorers hinge upon the quality of their educational background. Members of both E.C.C.O. and ENCoRE are involved in the CHARTER project: Cultural Heritage Action to Refine Training, Education, and Roles. This blueprint project aims to develop a matrix that maps heritage practice based on discrete competences and skills, organized according to levels of expertise. This matrix informs the role of heritage professionals in relation to cultural heritage. == Ulrich Schiessl PhD Colloquium == The Ulrich Schießl colloquium has been held biennially since 2008. It provides doctoral students with the opportunity to present, discuss, and benefit from their current research with peers and faculty members. The aim is to establish a European forum for the exchange of ideas and debates in research relevant to the conservation-restoration of cultural and natural heritage, as well as archaeology. Participation is open exclusively to current doctoral students in all disciplines within conservation and restoration, along with their supervisors and academic staff, at institutions that are full members of ENCoRE. == Presidents of ENCoRE == * René Larsen (1997-2010) * Wolfgang Baatz (2010-2023) * Laura Fuster Lopez (2023-present) == Publications == * ENCoRE Website * Document of Pavia * Collaboration of ECCO and ENCoRE * E.C.C.O - ENCoRE Joint Paper Category:European organizations Category:Vienna",
 "title": "ENCoRE - European Network for Conservation-Restoration Education"
}