{
 "id": "1101465",
 "text": "https://8171bispgovnews.pk/ The Punjab government has started registration of poor people across the country. So that they can benefit from the welfare programs of the government. The registration process for the Ehsaas program 8171 has been named PSER Punjab Socio-Economic Registry after 2022. The Benazir Income Support Programme (BISP) is a programme of the Pakistani government to fight against poverty. It has been implemented in the provinces of Punjab, Sindh, Baluchistan, and Khyber-Pakhtunkhwa. The program also operates in the federally administered regions of Azad Jammu and Kashmir, and the Islamabad Capital Territory. == Eligibility == To be eligible for cash payments under BISP, families must earn less than RS 6,000 per month; equivalent to $67. Further eligibility requirements stipulate that: *Families must have a female applicant holding a valid ID card *An individual applicant must be a widowed or divorced woman without male family members *Eligible families include those with physically or mentally disabled individuals Families deemed ineligible for cash payments through BISP include those with: *Members employed by the Pakistani government, army, or any other government- affiliated agency *Members drawing a pension or receiving post-retirement benefits from the government *Family members owning more than 3 acres of farmland or more than 80 square yards of residential land *Members receiving income from other sources *Members holding a machine readable passport *Members with a National Identity Card for Overseas citizens *Members with a bank account excluding microfinance banks and those catering to low-income families ==List of Chairpersons of Benazir Income Support Program== Name of Chairperson Entered Office Left Office Farzana Raja July 2008 March 2013 Vacant March 2013 November 2013 Enver Baig November 2013 November 2014 Vacant November 2014 February 2015 Marvi Memon February 2015 June 2018 Vacant June 2018 October 2018 Sania Nishtar October 2018 April 2022 Shazia Marri April 2022 Present ==References== Category:Government of Pakistan",
 "title": "Benazir Income Support Programme"
}