{
 "id": "1101217",
 "text": "The 2024–25 ABB FIA Formula E World Championship is the eleventh season of the FIA Formula E championship, a motor racing championship for electrically powered vehicles recognised by motorsport's governing body, the Fédération Internationale de l'Automobile (FIA), as the highest class of competition for electric open-wheel racing cars. == Teams and drivers == All teams are scheduled to use the Formula E Gen3 Evo car on Hankook tyres. Team Powertrain No. Drivers Andretti Formula E Porsche 27 Jake Dennis 51 Nico Müller DS Penske DS 7 Maximilian Günther 25 Jean-Eric Vergne Envision Racing Jaguar 4 Robin Frijns 16 Sebastien Buemi Jaguar TCS Racing Jaguar 9 Mitch Evans 37 Nick Cassidy Cupra Kiro Porsche 3 David Beckmann 33 Dan Ticktum Lola Yamaha ABT Formula E Team Lola-Yamaha 11 Lucas di Grassi 22 Zane Maloney Mahindra Racing Mahindra 21 Nyck de Vries 48 Edoardo Mortara Maserati MSG Racing Maserati 2 Stoffel Vandoorne 55 Jake Hughes NEOM McLaren Formula E Team Nissan 5 Taylor Barnard 8 Sam Bird Nissan Formula E Team Nissan 17 Norman Nato 22 Oliver Rowland TAG Heuer Porsche Formula E Team Porsche 1 Pascal Wehrlein 13 António Félix da Costa ===Team changes=== British motorsport brand Lola announced its return to top-level motorsport for the first time since the 2006 Champ Car World Series. Lola entered Formula E developing its own powertrain in cooperation with Yamaha. This partnership supplies powertrains to ABT, who had previously used Mahindra powertrains but ended that affiliation, and the team entered the season as Lola Yamaha ABT Formula E Team. == List of planned races == Pre-season testing will take place at the Circuit Ricardo Tormo between 4 and 7 November 2024. The following ePrix are contracted to form the 2024–25 Formula E World Championship. Round E-Prix Country Circuit Date 1 São Paulo ePrix São Paulo Street Circuit 7 December 2024 2 Mexico City ePrix Autódromo Hermanos Rodríguez 11 January 2025 3 Jeddah ePrix Jeddah Corniche Circuit 14 February 2025 4 15 February 2025 5 TBA TBA TBA 8 March 2025 6 Miami ePrix Homestead–Miami Speedway 12 April 2025 7 Monaco ePrix Circuit de Monaco 3 May 2025 8 4 May 2025 9 Tokyo ePrix Tokyo Street Circuit 17 May 2025 10 18 May 2025 11 Shanghai ePrix Shanghai International Circuit 31 May 2025 12 1 June 2025 13 Jakarta ePrix Jakarta International e-Prix Circuit 21 June 2025 14 Berlin ePrix Tempelhof Airport Street Circuit 12 July 2025 15 13 July 2025 16 London ePrix ExCeL London 26 July 2025 17 27 July 2025 ===Location changes=== *The Misano ePrix was removed from the calendar, leaving Italy without a race in Season 11. *The Saudi Arabian rounds were relocated from the Riyadh Street Circuit to the Jeddah Corniche Circuit, hosting the first ever Jeddah ePrix. *The Miami ePrix was reintroduced to the calendar, the first race in Florida since 2015, replacing the Portland ePrix. The event will move from the Biscayne Bay Street Circuit to the Homestead–Miami Speedway, which previously hosted IMSA GT Championship, the one-off Ferrari Winter Series for developmental single-seater drivers, and currently hosts numerous club races. It is unknown which version of the circuit will be used (with or without the banking). Regardless, at (without banking) or (with banking), it will be the longest Formula E circuit in history. *The Monaco ePrix will become a double header for the first time in the race's history. The Tokyo ePrix will also be a double-header race. *The Jakarta ePrix will return to the calendar, after a cancellation in season 10 due to elections in the country. ==References== Formula E Formula E Category:2020s in motorsport Category:Formula E",
 "title": "2024–25 Formula E World Championship"
}