{
 "id": "1101666",
 "text": "Jordi Peñarroja ( Barcelona, January 17, 1944, Barcelona, April 21, 2024), pseudonym of Jordi-Vicenç Peñarroja Villanueva, is a writer from Barcelona with professional experience in various areas of the world of communication, from 1964 He is a member of the Catalan History Circle and the Association of Writers in the Catalan Language . Collaborates with Memorial 1714. == Work == === Historical essays === * 1700, Viure en temps de guerra. 1. Blat i pa. Calonge: QU editor, 2021. * Indis i negres catalans. De Santes Creus a Santo Domingo. Barcelona: Llibres de l'Índex, 2014. . * Barcelona 1713, capital d'un Estat. Barcelona: Llibres de l'índex, 2013. . * Pessebre vivent independentista d'Arenys de Munt. Barcelona: Llibres de l'Índex, 2012. . * Ictineus. Barcelona: Llibres de l'Índex, 2010. . * Barcelona: sentir l'Onze de Setembre. Vol. 1. Barcelona: Llibres de l'Índex, 2007. . * Edificis viatgers de Barcelona. Barcelona: Llibres de l'Índex, 2007. . * Aventures, invents i navegacions d'en Narcís Monturiol. Barcelona: Blume, 1980. . === Narrative === * “Villarroel 231: cas obert”, narració de gènere negre inclosa al recull Clio assassina. Barcelona: Llibres de l'Index, 2013. . * “Aquella pell tan bruna”, narració de gènere negre inclosa al recull Un riu de crims. Barcelona: March editor, 2010. . * El jardí de les tortugues. Barcelona: Llibres de l'Índex, 2008. . * El President a París. Barcelona: Llibres de l'Índex, 2007. . * La Pàtria Sepulcral, novel·la de seny i disseny. Barcelona: El clavell, 1997. . === Other === * Disseny i edició de cinc exposicions per al Memorial 1714, entre 1997 i el 2008. * Guardonat amb el “Premi de la Crítica Serra d'Or 1981” com a il·lustrador de Canela, Mercè. La fantasia inacabable d'Antoni Gaudí. Barcelona: Blume, 1980. . . * L'Onze de Setembre de 1976 és un dels càmeres que filmen el documental Una altra albada, sobre la concentració a Sant Boi de Llobregat. * Autor de l'article “Fotografia” a la Gran Enciclopèdia Catalana (1974) i de tres capítols de Museus singulars de Catalunya (Diàfora, 1979). * S'inicia publicant nombroses col·laboracions gràfiques i/o literàries en diversos mitjans i per algunes editorials. == References == * * == Other websites == * Jordi Peñarroja's blog Category:Catalan Countries Category:Writers from Barcelona Category:1944 births",
 "title": "Jordi Peñarroja"
}