{
 "id": "1101662",
 "text": "The Wet T-Shirt contest is a beauty contest between women in T-shirts. It is similar to a Wet boxer contest that shows men in their boxer shorts. The women wear t-shirts in light colours. They usually wear no bra. When the t-shirts get wet they stick to the breasts. They also become translucent. There are two ways to decide who the winner of such a contest is: Either by looking at the reaction of the crowd, or by people who act as juges and decide. Depending on what is allowed, the women may later take off or tear the t-shirt, and go topless, or they may do a full striptease, and go fully naked. If they are done outside, such contests are usually done in summer, when it is hot, and a soaked t-shirt helps to cool down. == The first contests == In the United States, skiing filmmaker Dick Barrymore claims to have held the first wet T-shirt contest at a bar in Sun Valley, Idaho in January 1971, as part of a promotion for K2 skis. The contest was promoted as a simple \"T-shirt contest\". Airline stewardesses would dance to music wearing K2 promotional T-shirts. However, the first contestant to appear was a professional stripper who danced topless. The amateur contestants responded by drenching their T-shirts before competing. Barrymore held a second \"K2 Wet T-Shirt Contest\" in another bar Stowe Mountain Resort, Vermont in order to film it. Stowe City Council had passed a resolution banning nudity at the event. He held another contest for K2 on 10 March 1971 in Aspen, Colorado. The contests were featured in the March 1972 issue of Playboy. The first known mention of the term wet T-shirt contest in the press was in 1975 in The Palm Beach Post. The article described the contest's appearance at New Orleans discotheques. The contest then appeared at spring break events in Fort Lauderdale, Florida. Some bar owners were fined under public indecency laws for holding one. Despite a lack of clarity as to their legal status, contests began to take place elsewhere in the United States. A contest in a Milwaukee tavern in 1976 was subject to a police raid, despite contestants wearing Scotch Tape under their T-shirts as required by the police. Jacqueline Bisset's appearance in the 1977 movie The Deep, where she swam underwater wearing only a T-shirt for a top, helped to bring the wet T-shirt contest to broader public awareness. On Frank Zappa's 1979 album Joe's Garage the track \"Fembot in a Wet T-Shirt\" tells of Mary from Canoga Park who takes part in a wet T-shirt contest in order to raise money to return home after being abandoned by a rock group in Miami. The 2003 American reality film The Real Cancun included a wet T-shirt contest. The Spanish festival of La Tomatina, a large public tomato fight where participants become soaked with juice from tomatoes, has been suggested as another possible origin of the wet T-shirt contest, although La Tomatina began in 1945. == Problems == There have been lawsuits about underage contestants at such contests. Sometimes people lie about their age, to be able to take part. One case was Monica Pippin. Pippin had taken part at a wet t-shirt contest in Daytona Beach, in 2001. In 2002, her parents sued a number of companies who had filmed the event. Pippin, who was 16 at the time, had danced topless, and she had allowed men to pour water over her bare breasts. Although Pippin admitted in court that she had lied to contest organizers about her age, her attorney claimed that, as a minor, she was unable to give informed consent to perform or be filmed topless. Pippin settled with Anheuser-Busch and Playboy in April 2006. In a similar suit in 2007, two women sued Deslin Hotels, Girls Gone Wild, and various websites that published footage of their appearance in another 2001 Daytona Beach contest. The two girls, who were both sixteen at the time, had been filmed exposing their breasts, buttocks, and pubic areas. Like Pippin, they had lied about their age to be able to take part in the the contest. == References == ==Other websites== * Category:Competitions Category:Nudity",
 "title": "Wet T-shirt contest"
}