{
 "id": "1101150",
 "text": "The 2023–24 ABB FIA Formula E World Championship is the tenth season of the FIA Formula E championship, a motor racing championship for electrically powered vehicles recognised by motorsport's governing body, the Fédération Internationale de l'Automobile (FIA), as the highest class of competition for electric open-wheel racing cars. Although the championship season is designated 2023–2024, all races are held in 2024. == Teams and drivers == All teams use the Formula E Gen3 car on Hankook tyres. Team Powertrain No. Drivers ABT CUPRA Formula E Team Mahindra 11 Lucas di Grassi 51 Nico Müller Kelvin van der Linde Andretti Formula E Porsche 1 Jake Dennis 17 Norman Nato DS Penske DS 2 Stoffel Vandroone 25 Jean-Éric Vergne ERT Formula E Team ERT 3 Sérgio Sette Câmara 33 Dan Ticktum Envision Racing Jaguar 4 Robin Frijns Paul Aron 16 Sébastien Buemi Joel Eriksson Jaguar TCS Racing Jaguar 9 Mitch Evans 37 Nick Cassidy Mahindra Racing Mahindra 21 Nyck de Vries Jordan King 48 Edoardo Mortara Maserati MSG Racing Maserati 7 Maximilian Günther 18 Jehan Daruvala NEOM McLaren Formula E Team Nissan 5 Jake Hughes 8 Sam Bird Taylor Barnard Nissan Formula E Team Nissan 22 Oliver Rowland Caio Collet 23 Sacha Fenestraz TAG Heuer Porsche Formula E Team Porsche 13 António Félix da Costa 94 Pascal Wehrlein === Team changes === * Nio left Formula E after the prior season's end and fully rebranded to ERT Formula E Team for 2024 after new investment. === Driver changes === * Robin Frijns' contract with ABT CUPRA for 2024 would be terminated, the team opting to reunite with Lucas di Grassi, who won the 2016–17 championship with the team. * Sam Bird left Jaguar Racing after three seasons with the team. Nick Cassidy switched to the team from Envision Racing to partner Mitch Evans. * After Frijns' contract with ABT Cupra was terminated, he returned to Envision Racing in the place of Jaguar-bound Cassidy. * McLaren announced that René Rast had departed the team after spending a season with them. Bird was announced as his replacement after he departed Jaguar. * Oliver Rowland rejoined Nissan after having spent two seasons at Mahindra Racing from his original four seasons with Nissan. This saw Norman Nato leave the team after one year with the manufacturer. * André Lotterer left Andretti Autosport and Formula E after six seasons. Former Nissan driver Nato stepped in as his replacement. * After six years together, Edoardo Mortara left Maserati MSG Racing and was replaced by previous Mahindra reserve driver Jehan Daruvala. Mortara joined Mahindra in place of the Cupra- bound di Grassi. * After a year away, 2020-21 series champion Nyck de Vries returned to the sport with Mahindra to replace Roberto Merhi. ==== Mid-season ==== McLaren driver Sam Bird sustained a hand injury in a crash during the opening practice session of the Monaco ePrix. He withdrew from the event and was replaced by McLaren reserve and development driver Taylor Barnard, who already drove for the team in the rookie practice session ahead of the Misano ePrix and became the youngest driver to start a race in Formula E. Bird's injury means he will also be forced to miss the Berlin E-Prix double-header, with Barnard continuing to deputize. Multiple drivers will miss the Berlin E-Prix double-header because of a calendar clash with the FIA World Endurance Championship's 6 Hours of Spa-Francorchamps. Both Envision Racing drivers will prioritize their WEC commitments and will be replaced by GT driver Joel Eriksson, whose last Formula E race was for Dragon / Penske in the 2020–21 season, and Hitech Pulse-Eight Formula 2 driver Paul Aron. Mahindra Racing's Nyck de Vries will also miss Berlin to race in WEC, with the team instead fielding their reserve and development driver Jordan King. ABT CUPRA will also once again use the services of their reserve driver Kelvin van der Linde to replace Nico Müller. Nissan driver Oliver Rowland fell ill ahead of the Portland ePrix. He was replaced by the team's reserve driver, Indy NXT competitor Caio Collet, who made his series debut. == List of planned races == Pre-season testing occurred at Valencia from 23 to 27 October 2023. The following ePrix are contracted to form a part of the 2023–24 Formula E World Championship Round ePrix Country Circuit Date 1 Hankook Mexico City E-Prix Autódromo Hermanos Rodríguez 13 January 2024 2 Diriyah E-Prix Riyadh Street Circuit 26 January 2024 3 27 January 2024 4 São Paulo E-Prix São Paulo Street Circuit 16 March 2024 5 Tokyo E-Prix Tokyo Street Circuit 30 March 2024 6 Misano E-Prix Misano World Circuit Marco Simoncelli 13 April 2024 7 14 April 2024 8 Monaco E-Prix Circuit de Monaco 27 April 2024 9 Berlin E-Prix Tempelhof Airport Street Circuit 11 May 2024 10 12 May 2024 11 Shanghai E-Prix China Shanghai International Circuit 25 May 2024 12 26 May 2024 13 Hankook Portland E-Prix Portland International Raceway 29 June 2024 14 30 June 2024 15 Hankook London E-Prix ExCeL London 20 July 2024 16 21 July 2024 ===Location changes=== * The Cape Town E-Prix, the Jakarta E-Prix and the Rome E-Prix are not held in 2024. There was a plan to reschedule the Jakarta round in the wake of a general election period, but it was ultimately rejected. * The Tokyo E-Prix joined the calendar, which is the first time an FIA World Championship will visit the city. * The Shanghai E-Prix joined the calendar, which will be the first time the championship will race in China since the Sanya E-Prix in the 2018–19 season. * The Misano E-Prix joined the calendar, replacing the Rome E-Prix. * The Portland E-Prix will host a doubleheader after hosting only one race in 2023. * The Hyderabad E-Prix was originally set to be held on 10 February 2024 but was canceled due to a regional governance change. ==References== Formula E Formula E Category:2020s in motorsport Category:Formula E",
 "title": "2023–24 Formula E World Championship"
}