{
 "id": "1101878",
 "text": "Agriculture is the activity of growing crops and raising animals for food, clothing and other products. People have grown different plants and raised different animals depending on their environment. Agriculture contributed to the growth of civilizations. ==Prehistoric Agriculture== Agriculture began around 12,000 years ago. People collected wild plant seeds and planted them. They also domesticated wild animals. Domestication means that wild plants and animals were changed to meet human needs. People around the world started to grow plants and raise animals without learning from each other. Some early agriculture took place in the Levant area of the Middle East. Another early agricultural area was the Niger River Basin in West Africa. Important plants grown here are African yams, pearl millet, and African rice. Modern cattle come from cattle domesticated in the areas of Turkey and Pakistan, which then spread around the world. Scientists and historians still do not understand why agriculture developed in specific places. Some think it happened because of change in the environment. Others think it happened because of social structure changes. ==Ancient Agriculture== Ancient civilizations such as Mesopotamia, Egypt, China and India improved agriculture. They developed irrigation systems to provide water to the crops. They cultivated fields with animals. Wheat, barley, rice and grain were among the major crops. ==Medieval== During the Middle ages in Europe, farming technology improved. Farmers can plant crops on deep clay soil with heavy blades. Harvest rates increased with a three-field rotation of crops method. Horses took the role of cattle in farming. Farmers planted wheat, barley, peas, and beans. ==Modern== The Agricultural Revolution began during the 1700s and 1800s. New farming technology, such as the seed drill, improved crop planting. Selective breeding increased productivity in both animals and crops. In the 1900s, agriculture became more productive. Tractors and additional machinery replaced animal power. Better fertilizers and pesticides were developed. ==References== Category:History of agriculture Category:History Category:Agriculture",
 "title": "History of agriculture"
}