{
 "id": "1101208",
 "text": "This is a list of children's animated television series (including internet television series); that is, animated programs originally targeted towards audiences under the age of 18. This list does not include Japanese, Chinese, or Korean series. ==2020s== ===United States=== Title Genre Seasons/episodes Show creator(s) Original release Network Studio Age rating Technique Sources Go! Go! Cory Carson Educational 4 seasons, 28 episodes Stanley Moore January 4, 2020 – October 21, 2021 Netflix Kuku Studios TV-Y CGI Alex Woo Superprod Studio VTech The Owl House Fantasy 3 seasons, 43 episodes Dana Terrace January 10, 2020 – April 8, 2023 Disney Channel Disney Television Animation TV-Y7 Traditional Comedy horror Comedy drama Glitch Techs Action 2 seasons, 19 episodes Eric Robles February 21, 2020 – August 17, 2020 Netflix Nickelodeon Animation Studios TV-Y7 Flash Dan Milano ThunderCats Roar Comedy 1 season, 52 episodes Victor Courtright February 22, 2020 – December 5, 2020 Cartoon Network Warner Bros. Animation TV-Y7 Traditional Action/Adventure Sword and planet Marly Halpern-Graser Science fantasy Cleopatra in Space Action 3 seasons, 26 episodes N/A April 15, 2020 – present Peacock DreamWorks Animation Television TV-Y7 Flash Adventure Comic science fiction Looney Tunes Cartoons Comedy 6 seasons, 81 episodes Peter Browngardt May 27, 2020 – July 27, 2023 HBO Max Warner Bros. Animation TV-Y7 Traditional/Flash (Some Segments) Slapstick Rhyme Time Town Educational 2 seasons, 21 episodes Dan Berlinka June 19, 2020 – June 15, 2021 Netflix DreamWorks Animation Television TV-Y Flash Adventure Time: Distant Lands Miniseries 1 season, 4 episodes Pendleton Ward June 25, 2020 – September 2, 2021 HBO Max Cartoon Network Studios TV-PG Traditional Science fantasy Frederator Studios Deer Squad Comedy 4 seasons, 80 episodes TBA July 15, 2020 – present Nick Jr. iQIYI TV-PG CGI Adventure Tig n' Seek Comedy 4 seasons, 80 episodes Myke Chilian July 23, 2020 – May 26, 2022 HBO Max Cartoon Network Studios TV-PG Traditional Adventure Wizards: Tales of Arcadia Science fantasy 1 part, 10 episodes Guillermo del Toro August 7, 2020 Netflix DreamWorks Animation Television TV-Y7 CGI The Fungies! Comedy 3 seasons, 80 episodes Stephen P. Neary August 20, 2020 – December 16, 2021 HBO Max Cartoon Network Studios TV-Y7 Traditional Adventure Fantasy Madagascar: A Little Wild Comedy 8 seasons, 50 episodes Dana Starfield September 7, 2020 – June 30, 2022 Hulu Mainframe Studios TV-Y CGI Adventure Peacock DreamWorks Animation Television Educational Jurassic World Camp Cretaceous Action 5 seasons, 49 episodes Zack Stentz September 18, 2020 – July 21, 2022 Netflix Universal Pictures TV-PG CGI Adventure DreamWorks Animation Television Science fiction Amblin Entertainment Santiago of the Seas Action 2 seasons, 46 episodes Niki Lopez October 9, 2020 – July 27, 2023 Nick Jr. Channel Nickelodeon Animation Studio TV-Y CGI Adventure Leslie Valdes Walsh Valdés Productions Educational Valerie Walsh Valdes The Mighty Ones Comedy 4 seasons, 40 episodes Sunil Hall November 9, 2020 – December 9, 2022 Hulu DreamWorks Animation Television TV-Y7 Flash Lynne Naylor Peacock Trash Truck Educational 2 seasons, 28 episodes Max Keane November 10, 2020 – May 4, 2021 Netflix Glen Keane Productions TV-Y CGI Comedy Netflix Animation Doug Unplugs Adventure 2 seasons, 20 episodes Jim Nolan November 13, 2020 – present Apple TV+ DreamWorks Animation Television TV-Y CGI The Wonderful World of Mickey Mouse Comedy 1 seasons, 20 episodes Paul Rudish November 18, 2020 – July 28, 2023 Disney+ Disney Television Animation TV-G Traditional Trolls: TrollsTopia Comedy 7 seasons, 52 episodes Matthew Beans November 19, 2020 – August 11, 2022 Hulu DreamWorks Animation Television TV-Y7 Flash Fantasy Hannah Friedman Peacock Musical Sam Friedman Atomic Cartoons Animaniacs (2020) Comedy 3 seasons, 36 episodes Wellesley Wild November 20, 2020 – February 17, 2023 Hulu Warner Bros. Animation TV-PG Traditional Musical Satire Steven Spielberg Amblin Television Slapstick Kinderwood Mystery 1 season, 30 episodes Otto Tang December 3, 2020 – present Noggin Titmouse, Inc. TV-Y Flash Adventure Carin Greenberg Stillwater Comedy 3 seasons, 30 episodes Jun Falkenstein December 4, 2020 – May 19, 2023 Apple TV+ Gaumont Animation TV-Y7 CGI Scholastic Entertainment Toon In with Me Comedy 1 season, 327 episodes Neal Sabin January 4, 2021 – present MeTV TV-PG Flash/Traditional/Live-action Anthology Puppetry Gabby's Dollhouse Variety 10 seasons, 70 episodes Traci Paige Johnson January 5, 2021 – present Netflix DreamWorks Animation Television TV-Y CGI/Live- action/Flash Educational Jennifer Twomey Kid Cosmic Comic science fiction 3 seasons, 24 episodes Craig McCracken February 2, 2021 – February 3, 2022 Netflix A CMCC Production TV-Y7 Traditional Superhero Netflix Animation Tom and Jerry Special Shorts Comedy 1 season, 2 episodes Peter Browngardt February 20, 2021 HBO Max Turner Entertainment Traditional Warner Bros. Animation Kamp Koral: SpongeBob's Under Years Comedy 1 season, 19 episodes Stephen Hillenburg March 4, 2021 – present Paramount+ United Plankton Pictures, Inc. TV-Y7 CGI Nickelodeon Animation Studios Stan Lee's Superhero Kindergarten Superhero 1 season, 26 episodes Fabian Nicieza April 23, 2021 – present Kartoon Channel Genius Brands TV-Y7 Traditional POW! Entertainment Oak Productions Telegael The Chicken Squad Comedy 1 season, 29 episodes Tom Rogers May 14, 2021 – April 22, 2022 Disney Junior Wild Canary Animation TV-Y CGI Adventure Rugrats (2021) Comedy 1 season, 24 episodes Arlene Klasky May 27, 2021 – present Paramount+ Klasky-Csupo, Inc. TV-Y7 CGI Adventure Gábor Csupó Nickelodeon Animation Studio Slice of life Paul Germain Tuttle Twins Adventure 3 seasons, 34 episodes Daniel Harmon June 30, 2021 – present Angel Studios TV-G Toon Boom Tom and Jerry in New York Comedy 2 seasons, 13 episodes Darrell Van Citters July 1, 2021 – present HBO Max Turner Entertainment TV-PG Flash Warner Bros. Animation Monsters at Work Comedy 2 seasons, 20 episodes Bobs Gannaway July 7, 2021 – present Disney+ Disney Television Animation TV-G CGI Fantasy Middlemost Post Comedy 2 seasons, 37 episodes John Trabbic III July 9, 2021 – October 21, 2022 Nickelodeon Nickelodeon Animation Studio TV-Y7 Flash The Patrick Star Show Comedy 2 seasons, 56 episodes Luke Brookshier July 9, 2021 – present Nickelodeon United Plankton Pictures, Inc. TV-Y7 Traditional Marc Ceccarelli Andrew Goodman Slapstick Kaz Nickelodeon Animation Studios Mr. Lawrence Vincent Waller Ridley Jones Educational 4 seasons, 20 episodes Chris Nee July 13, 2021 – March 6, 2023 Netflix Netflix Animation TV-Y CGI Musical Adventure Brown Bag Films Johnny Test (2021) Science fantasy 2 seasons, 40 episodes Scott Fellows July 16, 2021 – January 7, 2022 Netflix WildBrain Studios TV-Y7 Flash/Toon Boom Action Adventure Copa Studio Comedy Chip 'N' Dale: Park Life Comedy 1 season, 12 episodes Olivier Jean-Marie July 28, 2021 – present Disney+ The Walt Disney Company France TV-Y7 Flash Slapstick Xilam Animation Jellystone! Comedy 2 seasons, 40 episodes C. H. Greenblatt July 29, 2021 – present HBO Max Warner Bros. Animation TV-G Flash Slapstick Centaurworld Musical 2 seasons, 18 episodes Megan Nicole Dong July 30, 2021 – December 7, 2021 Netflix Netflix Animation TV-Y7 Flash/Traditional Comedy drama Sketchshark Productions Spidey and His Amazing Friends Superhero 3 seasons, 79 episodes Darren Bachynski August 6, 2021 – present Disney Jr. Marvel Animation TV-Y CGI Atomic Cartoons Mickey Mouse Funhouse Educational 2 seasons, 38 episodes Phil Weinstein August 20, 2021 – present Disney Jr. Disney Television Animation TV-Y CGI Thomas Hart I Heart Arlo Musical 1 season, 19 episodes Ryan Crego August 27, 2021 Netflix Titmouse, Inc. TV-Y7 Flash Netflix Animation Dug Days Comedy 1 season, 5 episodes Bob Peterson September 1, 2021 Disney+ Pixar Animation Studios TV-PG CGI Sharkdog Comedy 3 seasons, 22 episodes Jacinth Tan Yi Ting September 3, 2021 – April 27, 2023 Netflix One Animation TV-Y CGI ViacomCBS Digital Studios International ViacomCBS International Studios The Smurfs Adventure 1 season, 52 episodes Pierre \"Peyo\" Culliford September 10, 2021 – present Nickelodeon Peyo Productions TV-Y7 CGI Fantasy IMPS Brussels Slapstick Dargaud Media Dupuis Audiovisuel Little Ellen Comedy 2 seasons, 20 episodes Kevin A. Leman II September 13, 2021 – March 3, 2022 HBO Max Warner Bros. Animation TV-Y Flash Jennifer Skelly Ellen Digital Ventures Thomas & Friends: All Engines Go Comedy 2 seasons, 60 episodes Rick Suvalle September 13, 2021 – present Cartoonito Mattel Television TV-Y Flash Netflix Nelvana Mush-Mush & the Mushables Comedy 1 season, 50 episodes Elfriede de Rooster September 13, 2021 – present Cartoonito Cake Entertainment TV-Y CGI La Cabane Productions Thuristar He-Man and the Masters of the Universe Action-adventure 3 seasons, 26 episodes Rob David September 16, 2021 – August 18, 2022 Netflix House of Cool TV-Y7 CGI CGCG Inc. Science fantasy Mattel Television Do, Re & Mi Musical 1 season, 8 episodes Fabien Ouvrard September 17, 2021 – present Amazon Prime Video Gaumont Animation TV-Y CGI Amazon Studios Lucas the Spider Comedy 1 season, 17 episodes Joshua Slice September 18, 2021 – present Cartoonito Cake Entertainment TV-Y CGI Wexworks Media Fresh TV Inc. The Family Channel Strawberry Shortcake: Berry in the Big City Comedy 1 season, 12 episodes TBA September 18, 2021 – present YouTube WildBrain TV-Y7 Flash The Croods: Family Tree Comedy 8 seasons, 52 episodes N/A September 23, 2021 – November 9, 2023 Hulu DreamWorks Animation Television TV-G CGI Adventure Peacock Ada Twist, Scientist Educational 4 seasons, 41 episodes Kerri Grant September 28, 2021 – April 22, 2023 Netflix Laughing Wild TV-Y CGI Brown Bag Films Higher Ground Productions Netflix Animation Yabba- Dabba Dinosaurs! Comedy 2 seasons, 26 episodes Mark Marek Marly Halpern-Graser September 30, 2021 – February 17, 2022 HBO Max Warner Bros. Animation TV-Y7 Flash The Ghost and Molly McGee Supernatural fantasy 2 seasons, 41 episodes Bill Motz October 1, 2021 – January 13, 2024 Disney Channel Disney Television Animation TV-Y7 Flash/Toon Boom Musical Bob Roth Buddy comedy Alma's Way Educational 2 seasons, 48 episodes Sonia Manzano October 4, 2021 – present PBS Kids Fred Rogers Productions TV-Y Flash Pipeline Studios Ghostforce Superhero 1 season, 52 episodes Jeremy Zag October 4, 2021 – present Disney XD Zagtoon TV-Y CGI Action-Comedy Method Animation Adventure SAMG Animation A Tale Dark & Grimm Fantasy 1 season, 10 episodes Doug Langdale October 8, 2021 Netflix Boat Rocker Studios TV-Y7 CGI Novo Media Group Action Astro-Nomical Entertainment Adventure Simon Otto Netflix Animation Get Rolling with Otis Comedy 1 season, 9 episodes Declan Doyle October 8, 2021 – present Apple TV+ 9 Story Media Group TV-Y CGI Brown Bag Films Aquaman: King of Atlantis Miniseries 1 season, 3 episodes Victor Courtright October 14, 2021 – October 28, 2021 HBO Max Warner Bros. Animation TV-PG Traditional Action-adventure Comedy DC Entertainment Science fiction Marly Halpern-Graser Superhero Atomic Monster Karma's World Comedy 4 seasons, 40 episodes Chris Bridges October 15, 2021 – September 22, 2022 Netflix Karma's World Entertainment TV-Y CGI Brown Bag Films Musical Creative Affairs Group Karma's World Entertainment Maya and the Three Miniseries 1 season, 9 episodes Jorge Gutierrez October 22, 2021 Netflix Netflix Animation TV-Y7 CGI Fantasy Tangent Animation Adventure Mexopolis Action Maya Entertainment Star Trek: Prodigy Science fiction 2 seasons, 40 episodes Kevin Hageman October 28, 2021 – present Paramount+ Nickelodeon Animation Studio TV-Y7 CGI CBS Eye Animation Productions Secret Hideout Dan Hageman Roddenberry Entertainment Brothers Hageman Productions Dogs in Space Adventure 2 seasons, 20 episodes Jeremiah Cortez November 18, 2021 – September 15, 2022 Netflix Atomic Cartoons TV-Y7 Flash Action Netflix Animation GrizzlyJerr Productions Harriet the Spy Comedy 1 season, 10 episodes Will McRobb November 19, 2021 – May 5, 2023 Apple TV+ Apple Studios TV-G Flash/Traditional Postworks New York The Jim Henson Company Rehab Entertainment 2 Friends Entertainment Titmouse, Inc. Dragons: The Nine Realms Action 8 seasons, 52 episodes John Tellegen December 23, 2021 – December 14, 2023 Hulu DreamWorks Animation Television TV-G CGI Comedy Peacock We Baby Bears Comedy 1 season, 34 episodes Manny Hernandez January 1, 2022 – present Cartoon Network Cartoon Network Studios TV-Y7 Traditional Fantasy Adventure Action Pack Action 2 seasons, 16 episodes Bill Harper January 4 – June 6, 2022 Netflix OddBot Inc Animation TV-Y CGI ICON Creative Studio El Deafo Adventure 1 season, 3 episodes Will McRobb January 7, 2022 Apple TV+ Lighthouse Studios TV-G Flash/Traditional/Toon Boom Waxahatchee Angry Birds: Summer Madness Comedy 3 seasons, 36 episodes Rob Doherty January 28 – August 25, 2022 Netflix Rovio Animation TV-Y7 Flash Adventure Cake Entertainment Scott Sonneborn Kickstart Entertainment Slapstick Yowza! Animation Alice's Wonderland Bakery Comedy 1 season, 20 episodes Chelsea Beyl February 9, 2022 – April 15, 2024 Disney Junior Disney Television Animation TV-Y CGI Pretzel and the Puppies Comedy 1 season, 8 episodes TBA February 11, 2022 – present Apple TV+ HarperCollins Productions TV-Y CGI House of Cool Big Nate Comedy 2 seasons, 52 episodes Mitch Watson February 17, 2022 – August 26, 2024 Paramount+ Nickelodeon Animation Studio TV-Y7 CGI John Cohen Productions The Cuphead Show! Comedy 3 seasons, 36 episodes Chad Moldenhauer February 18 – November 18, 2022 Netflix King Features Syndicate TV-Y7 Flash Adventure Jared Moldenhauer Studio MDHR CJ Kettler Slapstick Dave Wasson Netflix Animation Cosmo Segurson Team Zenko Go Action 2 seasons, 22 episodes Jack Thomas March 15 – August 8, 2022 Netflix DreamWorks Animation Television TV-Y CGI Mainframe Studios Transformers: BotBots Action 1 season, 10 episodes Comedy March 25, 2022 Netflix Hasbro TV-Y Flash Adventure Science fiction Comedy Entertainment One My Little Pony: Tell Your Tale Comedy 2 seasons, 93 episodes TBA April 7, 2022 – October 17, 2024 YouTube Entertainment One Flash Lil Critter Workshop Pinecone & Pony Adventure 2 seasons, 16 episodes Stephanie Kaliner April 8, 2022 – February 3, 2023 Apple TV+ DreamWorks Animation Television TV-Y Flash First Generation Films The Creature Cases Action 3 chapters, 20 episodes Gabe Pulliam April 12, 2022 – present Netflix Silvergate Media TV-Y CGI Comedy TeamTO Battle Kitty Action 1 season, 9 episodes Matt Layzell April 19, 2022 Netflix Netflix Animation TV-Y7 CGI Choice Provisions Comedy Paul Layzell Higher Ground Productions Laughing Wild Samurai Rabbit: The Usagi Chronicles Action 2 seasons, 20 episodes Doug Langdale April 28, 2022 – September 1, 2022 Netflix Netflix Animation TV-Y7 CGI Gaumont Animation Adventure Candie Langdale Atomic Monster Dark Horse Entertainment Mecha Builders Science fiction 1 season, 21 episodes Yurie Rocha April 30, 2022 – November 24, 2023 Cartoonito Sesame Workshop TV-Y CGI Educational HBO Max The Boss Baby: Back in the Crib Comedy 2 seasons, 28 episodes Brandon Sawyer May 19, 2022 – April 13, 2023 Netflix DreamWorks Animation Television TV-Y7 CGI My Little Pony: Make Your Mark Musical 6 chapters, 27 episodes Gillian Berrow May 26, 2022 – November 23, 2023 Netflix Entertainment One TV-Y CGI Boulder Media Face's Music Party Live-action animated 1 season, 16 episodes N/A June 3, 2022 – December 11, 2023 Nickelodeon Jonas & Co. TV-Y Flash/Live-action Musical Nickelodeon Animation Studio Flash Dead End: Paranormal Park Dark fantasy 2 seasons, 20 episodes Hamish Steele June 16 – October 13, 2022 Netflix Blink Industries TV-Y7 Flash/Traditional Horror comedy Supernatural Netflix Animation Eureka! Educational 1 season, 30 episodes Norton Virgien June 22, 2022 – March 24, 2023 Disney Junior Brown Bag Films TV-Y CGI Niamh Sharkey Best & Bester Comedy 1 season, 5 episodes June 27, 2022 – present Nickelodeon Nelvana Traditional Eye Present Gigglebug Entertainment Me & Mickey Educational 2 seasons, 45 episodes June 27, 2022 – present Disney Junior Walt Disney Animation Studios TV-Y CGI Baymax! Comedy 1 season, 6 episodes Don Hall June 29, 2022 Disney+ Walt Disney Animation Studios TV-PG CGI Superhero Science fiction Duck & Goose Educational 1 season, 8 episodes Brian Muelhaupt July 8, 2022 – present Apple TV+ Titmouse Inc. TV-Y Flash Jane Startz Kung Fu Panda: The Dragon Knight Action 3 seasons, 42 episodes Mitch Watson July 14, 2022 – September 7, 2023 Netflix DreamWorks Animation Television TV-Y7 CGI Comedy Peter Hastings Bugs Bunny Builders Comedy 1 season, 20 episodes Joey Adams July 25, 2022 – present Cartoonito Warner Bros. Animation TV-Y Flash Andy Thom Educational Abe Audish HBO Max Lindsey Pollard Chibiverse Comedy 1 season, 3 episodes Gino Guzzardo July 30, 2022 – present Disney Channel Disney Television Animation TV-Y7 Traditional Crossover Super Giant Robot Brothers Action 1 season, 10 episodes Victor Maldonado August 4, 2022 Netflix Netflix Animation TV-Y7 CGI Adventure Reel FX Creative Studios Comedy Alfredo Torres Assemblage Entertainment Hamster & Gretel Action 2 seasons, 41 episodes Dan Povenmire August 12, 2022 – present Disney Channel Disney Television Animation TV-Y7 Traditional Comedy Superhero Deepa & Anoop Adventure 2 seasons, 18 episodes Munjal Shroff August 15 - November 7, 2022 Netflix Mattel Television TV-Y CGI Comedy Lisa Goldman Family Heather Kenyon 50/50 Heroes Comedy 1 season, 52 episodes Romain Gadiou & Chloe Sastre September 5, 2022 CITV Cyber Group Studios TV-G Flash Jade Armor Action TBA Corinne Kouper September 7, 2022 Cartoon Network TeamTO CGI Mary Bredin Max M.J. Offen Cars on the Road Comedy 1 season, 8 episodes Steve Purcell September 8, 2022 Disney+ Pixar Animation Studios TV-G CGI The Tiny Chef Show Comedy 3 seasons, 32 episodes Rachel Larsen September 9, 2022 – present Nickelodeon Imagine Kids+Family TV-Y Stop-Motion/Live Action Nickelodeon Animation Studio Live-Action Sago Mini Friends Educational 1 season, 10 episodes Chad Hicks September 16, 2022 – present Apple TV+ Spin Master Entertainment TV-Y Flash Brown Bag Films Batwheels Superhero 2 seasons, 60 episodes Steven Fink September 17, 2022 – present Cartoonito Warner Bros. Animation TV-Y CGI HBO Max DC Entertainment Firebuds Educational 2 seasons, 47 episodes Craig Gerber September 21, 2022 – present Disney Jr. Disney Television Animation CGI Electric Emu Productions Rosie's Rules Educational 1 season, 40 episodes Jennifer Hamburg October 3, 2022 – June 27, 2024 PBS Kids 9 Story Media Group Flash Brown Bag Films Abominable and the Invisible City 2 season, 20 episodes Jim Schumann October 5, 2022 – March 29, 2023 Peacock DreamWorks Animation Television TV-Y7 CGI Hulu Monster High Horror-comedy 2 seasons, 50 episodes TBA October 6, 2022 – October 24, 2024 Nickelodeon Mattel Television TV-Y7 CGI Xentrix Studios Nickelodeon Animation Studio Oddballs Comedy 2 seasons, 20 episodes James Rallison October 7, 2022 – February 24, 2023 Netflix Netflix Animation TV-Y7 Flash Ethan Banville Netflix Animation Spirit Rangers Educational 3 seasons, 39 episodes Karissa Valencia October 10, 2022 – April 8, 2024 Netflix Netflix Animation TV-Y CGI Laughing Wild Superprod Animation Interstellar Ella Space opera 1 season, 31 episodes Adam Long October 17, 2022 – present Ketnet Aardman TV-Y CGI Fabrique Fantastique Apartment 11 Productions Oni: Thunder God's Tale Adventure 1 season, 4 episodes Daisuke Tsutsumi October 21, 2022 Netflix Tonko House TV-Y7 CGI Drama Netflix Animation Fantasy Stop-Motion Daniel Spellbound Adventure 2 season, 20 episodes Matt Fernandes October 27, 2022 – January 26, 2023 Netflix Netflix Animation TV-Y7 CGI Fantasy Boat Rocker Studios Industrial Brothers Zootopia+ Comedy 1 season, 6 episodes Trent Correy November 9, 2022 Disney+ Walt Disney Animation Studios TV-PG CGI Anthology Josie Trinidad Transformers: EarthSpark Action 3 seasons, 44 episodes Dale Malinowski November 11, 2022 – present Paramount+ Entertainment One TV-Y7 CGI Science fiction Ant Ward Comedy Nicole Dubuc Nickelodeon Animation Studio Interrupting Chicken Educational 2 seasons, 17 episodes TBA November 18, 2022 – September 29, 2023 Apple TV+ Mercury Filmworks TV-Y Flash StoryBots: Answer Time Educational 2 seasons, 22 episodes Evan Spiridellis November 21, 2022 – July 10, 2023 Netflix Brown Bag Films TV-Y Flash/Live Action Gregg Spiridelli Sonic Prime Action 2 seasons, 23 episodes Joe Kacey December 15, 2022 – January 11, 2024 Netflix Sega of America TV-Y7 CGI Comedy Joe Kelly WildBrain Studios Dystopia Duncan Rouleau Man of Action Entertainment Science fiction Stephen C. Seagal Netflix Animation SuperKitties 2 seasons, 39 episodes Paula Rosenthal January 11, 2023 – present Disney Jr. Sony Pictures Television — Kids CGI Shape Island 1 season, 10 episodes TBA January 20, 2023 – present Apple TV+ Bix Pix Entertainment Stop-Motion Princess Power 3 seasons, 45 episodes TBA January 30, – December 1, 2023 Netflix Atomic Cartoons CGI Flower Films Rubble and Crew 2 seasons, 68 episodes Bradley Zweig February 3, 2023 – present Treehouse TV Spin Master Entertainment CGI Work It Out Wombats! 1 season, 40 episodes TBA February 6, 2023 – present PBS Kids GBH Kids Flash Pipeline Studios My Dad the Bounty Hunter Action 2 season, 19 episodes Evrett Downing Jr. February 9 – August 17, 2023 Netflix Dwarf Animation Studio CGI Patrick Harpin Netflix Animation Moon Girl and Devil Dinosaur Superhero 2 seasons, 31 episodes Laurence Fishburne February 10, 2023 – present Disney Channel Disney Television Animation Flash/Traditional Helen Sugland Marvel Animation Adventure Titmouse, Inc. Cinema Gypsy Productions Bossy Bear Educational 1 season, 30 episodes David Horvath March 6, 2023 – present Nickelodeon Imagine Kids+Family Flash Sun-Min Kim Nickelodeon Animation Studio Renegade Animation Kiff Comedy 1 season, 30 episodes Lucy Heavens March 10, 2023 – present Disney Channel Disney Television Animation Traditional Nic Smal Titmouse, Inc. Kent Osborne Lu and the Bally Bunch TBA Nicky Phelan March 17, 2023 – present Cartoonito 9 Story Media Group Flash Max Brown Bag Films Kiya & the Kimoja Heroes Comedy 1 season, 26 episodes Peter Ramsey March 22, 2023 – present Disney+ Disney EMEA Animation Studio CGI Disney Junior Triggerfish Animation Studios Eva the Owlet 1 season, 10 episodes TBA March 31, 2023 – present Apple TV+ Scholastic Entertainment CGI Brown Bag Films Frog and Toad 1 season, 10 episodes Rob Hoegee April 28, 2023 – present Apple TV+ Titmouse, Inc. Flash Star Wars: Young Jedi Adventures Space opera 2 seasons, 36 episodes TBA May 4, 2023 – present Disney+ Lucasfilm Animation CGI Disney Jr. Kitti Katz 1 season, 10 episodes TBA May 18, 2023 Netflix Kidscave Studios CGI Gremlins Fantasy 2 seasons, 15 episodes TBA May 23, 2023 – present Max Warner Bros. Animation CGI Max Amblin Television Dino Pops Science-fiction 1 season, 6 episodes Ailing Zubizarreta May 25, 2023 – present Peacock Mobius Lab Kids CGI Hailey's On It! Comedy 1 season, 30 episodes Devin Bunje June 8, 2023 – May 18, 2024 Disney Channel Disney Television Animation Traditional Nick Stanton Pupstruction TBA 2 seasons, 34 episodes Travis Braun June 14, 2023 – present Disney Jr. Titmouse, Inc. CGI Not Quite Narwhal TBA 2 seasons, 39 episodes Jessie Sima June 19, 2023 – present Netflix DreamWorks Animation Television CGI Silly Sundays TBA Nuria González Blanco July 2, 2023 – present Cartoonito Cartoon Saloon Flash Kizazi Moto: Generation Fire Anthology 1 season, 10 episodes Peter Ramsey July 5, 2023 Disney+ Triggerfish Animation Studios CGI/Traditional Supa Team 4 Action 2 seasons, 16 episodes Malenga Mulendema July 20, 2023– present Netflix Triggerfish Animation Studios CGI CAKE Dew Drop Diaries Fantasy 2 seasons, 40 episodes Rick Suvalle July 24, 2023 – December 4, 2023 Netflix DreamWorks Animation Television CGI Mech Cadets 1 season, 10 episodes TBA August 10, 2023 Netflix Netflix Animation CGI Boom! Studios Polygon Pictures Tiny Toons Looniversity Slapstick 2 seasons, 26 episodes TBA September 8, 2023 Cartoon Network Amblin Television Traditional Comedy Max Warner Bros. Animation Little Baby Bum: Music Time Preschool Musical 1 season, 9 episodes TBA September 25, 2023 Netflix Moonbug Entertainment TV-Y CGI Fright Krewe Horror 2 seasons, 20 episodes Eli Roth October 2, 2023 – present Hulu DreamWorks Animation Television Traditional James Frey Peacock Jessica's Big Little World Comedy 1 season, 20 episodes Matt Burnett October 2, 2023 – May 31, 2024 Cartoon Network Cartoon Network Studios TV-Y Traditional Ben Levin Tiffany Ford Max Superbuns Superhero 1 season, 39 episodes TBA October 12, 2023 – present Peacock Yowza! Animation TV-Y Flash Riley Rocket TBA TBA October 21, 2023 – present TVOKids BGM Flash Sphere Animation Lil' Stompers 1 season, 65 episodes Phillip Stamp October 26, 2023 – present Peacock IoM CGI Curses! Adventure 2 seasons, 20 episodes Jeff Dixon October 27, 2023 – present Apple TV+ DreamWorks Animation Television CGI Jim Cooper Unicorn Academy Fantasy 2 seasons, 19 episodes Michelle Lamoreaux November 2, 2023 – present Netflix Spin Master Entertainment CGI The Heroic Quest of the Valiant Prince Ivandoe Adventure 1 season, 40 episodes Eva Lee Wallberg November 11, 2023 – present Cartoon Network Hanna-Barbera Studios Europe TV-Y7 Flash Christian Bøving-Andersen Isadora Moon Educational 1 season, 9 episodes TBA November 17, 2023 – present Sky Kids Kelebek Media, Jam Studios TV-Y Flash Cocomelon Lane Educational 3 seasons, 15 episodes Guy Toubes, Brandon Violette November 19, 2023 – present Netflix Moonbug Entertainment TV-Y CGI Galapagos X TBA TBA November 21, 2023 – present TVOKids Big Bad Boo Studios Flash Zokie of Planet Ruby Comedy 1 season, 26 episodes Brian Morante December 31, 2023 – present Amazon Prime Video Nelvana TV-Y7 Flash Mike Geiger Brian Morante Dee & Friends in Oz Adventure 2 seasons, 17 episodes Angela C. Santomero February 5, 2024 – present Netflix 9 Story Media Group CGI Brown Bag Films Lyla in the Loop Educational 1 season, 21 episodes Dave Peth February 5, 2024 – present PBS Kids Mighty Picnic TV-Y Flash Pipeline Studios Jam Filled Entertainment Rock, Paper, Scissors Comedy 1 season, 32 episodes Kyle Stegina February 11, 2024 – present Nickelodeon Nickelodeon Animation Studio TV-Y7 Flash/Toon Boom Josh Lehrman Caillou 1 season, 52 episodes TBA February 15, 2024 Peacock WildBrain Studios TV-Y CGI Bea's Block Comedy 1 season, 5 episodes TBA February 15, 2024 Cartoonito Sesame Workshop TV-Y CGI Max Iwájú Science fiction 1 season, 6 episodes TBA February 28, 2024 Disney+ Walt Disney Animation Studios CGI Drama Megamind Rules! Superhero 1 season, 16 episodes TBA March 1, 2024 – present Peacock DreamWorks Animation Television TV-Y7 CGI Comedy Hot Wheels: Let's Race Adventure 2 seasons, 15 episodes Rob David March 4, 2024 – present Netflix Mattel Television TV-Y7 CGI Mia & Codie TBA TBA March 12, 2024 – present TVOKids Epic Story Media CGI Morphle and the Magic Pets TBA Arthur van Merwijk March 20, 2024 – present Disney+ Moonbug Entertainment TV-Y CGI Disney Junior Guru Studio Dylan's Playtime Adventures TBA TBA April 1, 2024 Cartoonito 9 Story Media Group TV-Y CGI Brown Bag Films Hop TBA Marc Brown April 4, 2024 Max Epic Story Media TV-Y Flash Loomi Animation Dora Adventure 2 seasons, 52 episodes Chris Gifford April 12, 2024 Paramount+ Nickelodeon Animation Studio TV-Y CGI Let's Go, Bananas! TBA TBA April 19, 2024 CBC Kids 9 Story Media Group TV-Y Flash The Fairly OddParents: A New Wish Adventure 1 season, 20 episodes Butch Hartman May 20, 2024 – present Nickelodeon Billionfold Inc. TV-Y7 CGI Nickelodeon Animation Studio Angry Birds Mystery Island Mystery 1 season, 16 episodes Eric Rogers May 21, 2024 Amazon Prime Video Titmouse, Inc. Comedy Amazon Kids+ Rovio Animation Jurassic World: Chaos Theory Comedy 2 seasons, 20 episodes TBA May 24, 2024 – present Netflix DreamWorks Animation Television TV-Y7 CGI Adventure Camp Snoopy TBA TBA June 14, 2024 Apple TV+ WildBrain Studios Flash Peanuts Worldwide Schulz Studio Audrey's Shelter TBA TBA June 17, 2024 – present TVOKids Image In Atlantique Flash https://www.tvokids.com/school-age/audreys-shelter Watch Next Media Ariel Adventure 1 season, 18 episodes TBA June 27, 2024 – present Disney Jr. Wild Canary Animation TV-Y CGI Disney Television Animation WondLa Fantasy 1 season, 7 episodes TBA June 28, 2024 – present Apple TV+ Skydance Animation CGI Zombies: The Re-Animated Series Musical 1 season, 19 episodes Aliki Theofilopoulos June 28, 2024 – present Disney Channel Disney Television Animation TV-G CGI Jack Ferraiolo Wonderoos Comedy TBA Artur Spigel July 15, 2024 Netflix Atomic Cartoons CGI Hannah Kole Primos Comedy 1 season, 19 episodes Natasha Kline July 25, 2024 – present Disney Channel Disney Television Animation TV-Y7 Traditional Tales of the Teenage Mutant Ninja Turtles Superhero 1 season, 12 episodes Christopher Yost August 9, 2024 – present Paramount+ Point Grey Pictures TV-Y7 Traditional Alan Wan Nickelodeon Animation Studio Mermaid Magic 1 season, 10 episodes Ignio Straffi August 22, 2024– present Netflix Rainbow S.p.A. CGI Kindergarten: The Musical Musical 1 season, 15 episodes Michelle Lewis September 3, 2024 – present Disney Junior Oddbot Entertainment TV-Y CGI Charlton Pettus Flash Tea Town Teddy Bears 1 season, 26 episodes TBA September 26, 2024 - present Peacock M2 Animation TV-Y CGI Barney's World TBA TBA October 14, 2024 Cartoonito Mattel Television TV-Y CGI Max Nelvana Mighty MonsterWheelies Preschool 1 season, 26 episodes TBA October 14, 2024 – present Netflix DreamWorks Animation Television TV-Y CGI Hamsters of Hamsterdale TBA TBA October 16, 2024 Nickelodeon Nelvana TV-Y Flash Max & the Midknights TBA TBA October 30, 2024 Nickelodeon Nickelodeon Animation Studio TV-Y7 CGI Carl the Collector TBA Zachariah O'Hora November 14, 2024 PBS Kids Fuzzytown Productions TV-Y Flash/Toon Boom Spiffy Pictures Press Start! Comedy TBA TBA November 21, 2024 Peacock Cyber Group Studios TV-Y7 CGI Adventure Jentry Chau vs. The Underworld Supernatural TBA TBA December 5, 2024 Netflix Netflix Animation TV-Y7 Traditional Adventure Titmouse, Inc. Dream Productions TBA TBA December 11, 2024 Disney+ Pixar Animation Studios TV-G CGI Wonder Pets: In The City Adventure TBA Jennifer Oxley December 14, 2024 Apple TV+ Nickelodeon Animation Studio TV-Y Flash StuGo TBA Ryan Gillis January 11, 2025 Disney Channel Titmouse, Inc. TV-Y7 Flash Disney Television Animation RoboGobo TBA Chris Gilligan January 17, 2025 Disney Junior Brown Bag Films CGI Disney Television Animation Mermicorno: Starfall 1 season, 13 episodes TBA January 30, 2025 Max Atomic Cartoons Flash Thunderbird Entertainment ===United Kingdom=== Title Genre Seasons/episodes Show creator(s) Original release Network Studio Age rating Technique Sources It's Pony Comedy 2 seasons, 46 episodes Ant Blades January 18, 2020 – May 26, 2022 Nickelodeon Blue-Zoo Animation TV-Y7 Traditional Chico Bon Bon: Monkey with a Tool Belt Comedy 4 seasons, 38 episodes N/A May 8, 2020 – present Netflix Silvergate Media TV-Y CGI Brown Bag Films Elliott from Earth Science fiction 1 season, 16 episodes Guillaume Cassuto March 29, 2021 – April 9, 2021 Cartoon Network Cartoon Network Studios Europe TV-Y7 Flash Comedy Mic Graves Tony Hull Odo Educational 1 season, 13 episodes Colin Williams December 2, 2021 – present HBO Max Sixteen South TV-Y Flash Letko Dodo Comedy 1 season, 20 episodes Jack Bennett April 28, 2022 – present Cartoon Network CAKE Entertainment Flash HBO Max Wildseed Studios ===Canada=== Title Genre Seasons/episodes Show creator(s) Original release Network Studio Age rating Technique Sources Starbeam Superhero 3 seasons, 25 episodes Loris Lunsford April 3, 2020 – June 29, 2021 Netflix Kickstart Productions TV-Y CGI Jason Netter Ollie's Pack Comedy 1 season, 21 episodes Pedro Eboli April 6, 2020 – May 6, 2021 Nickelodeon (United States) Nelvana TV-Y7 Flash Graham Peterson YTV (Canada) === British === Title Genre Seasons/episodes Show creator(s) Original release Network Studio Age rating Technique Sources Wolfboy and the Everything Factory Comedy 2 seasons, 20 episodes Toff Mazery September 24, 2021 – present Apple TV+ Toff's Tiny Universe TV-Y7 Flash Edward Jesse HitRecord Bento Box Entertainment Big Tree City Action 1 season, 15 episodes TBA August 1, 2022 – present Netflix Blue Zoo Animation TV-Y CGI Comedy Bad Dinosaurs Comedy 1 season, 8 episodes TBA March 28, 2024 – present Netflix Snafu Pictures TV-Y7 CGI ===Co- productions=== ====European==== Title Genre Seasons/episodes Show creator(s) Original release Network Studio Age rating Technique Sources Powerbirds Action 1 season, 19 episodes Stephen P. Breen January 19, 2020 – July 17, 2020 Universal Kids Brown Bag Films Flash Jennifer Monier-Williams My Little Pony: Pony Life Comedy 2 seasons, 52 episodes November 7, 2020 – May 22, 2021 Discovery Family Entertainment One Flash Fantasy Boulder Media ====Canadian==== Title Genre Seasons/episodes Show creator(s) Original release Network Studio Age rating Technique Sources Kipo and the Age of Wonderbeasts Action 3 seasons, 30 episodes Radford Sechrist January 14, 2020 – October 12, 2020 Netflix DreamWorks Animation Television Traditional Adventure Science fantasy Post-apocalyptic Comedy drama Book Hungry Bears Educational 1 season, 40 episodes March 27, 2020 – present TVOKids Breakthrough Entertainment Flash Puketo Pictures Remy & Boo Adventure 1 season, 17 episodes Matthew Fernandes May 1, 2020 – present Universal Kids Industrial Brothers CGI Boat Rocker Studios Hero Elementary Educational 1 season, 23 episodes Carol-Lynn Parente June 1, 2020 – January 4, 2022 PBS Kids Portfolio Entertainment Flash Superhero Christine Ferraro Twin Cities PBS Elinor Wonders Why Science fiction 1 season, 40 episodes Jorge Cham September 7, 2020 – present PBS Kids Pipeline Studios Flash Daniel Whiteson Shoe Ink Mighty Express Educational 3 seasons, 26 episodes Keith Chapman September 22, 2020 – present Netflix Spin Master Entertainment CGI Action Atomic Cartoons Pikwik Pack Educational 1 season, 17 episodes Frank Falcone November 7, 2020 – present Disney Junior Guru Studio Flash Mary Bredin Corus Entertainment Rachel Reade Marcus Dino Ranch Adventure 1 season, 26 episodes Matthew Fernandes January 16, 2021 – present Disney Junior Industrial Brothers CGI Comedy Educational Boat Rocker Studios Go, Dog. Go! Educational 3 seasons, 26 episodes Adam Peltzman January 26, 2021 – present Netflix WildBrain Studios CGI DreamWorks Animation Television The Snoopy Show Comedy 2 seasons, 26 episodes Rob Boutilier February 5, 2021 – present Apple TV+ WildBrain Studios Flash Steve Evangelatos Peanuts Worldwide Behzad Mansoori-Dara Ridd Sorensen Schulz Studio Big Blue Educational 1 season, 10 episodes Gyimah Gariba December 4, 2021 – present CBC Kids Rocket Fund Flash Guru Studio Super Wish TBA Adrian Thatcher June 4, 2022 – present YTV Redknot Flash Vanessa Esteves Summer Memories Comedy 1 season, 20 episodes Adam Yaniv August 12, 2022 Family Channel Yeti Farm Creative Flash Builder Brothers Dream Factory Comedy 1 season, 7 episodes TBA March 26, 2023 – present Disney+ Sinking Snip Entertainment CGI Treehouse TV Nelvana ==== French ==== Title Genre Seasons/episodes Show creator(s) Original release Network Studio Age rating Technique Sources City of Ghosts Mockumentary 1 Season, 6 episodes Elizabeth Ito March 5, 2021 Netflix TeamTO TV-Y CGI Fantasy Netflix Animation The BeatBuds, Let's Jam! Musical 1 Season, 10 episodes Evan Sinclair June 7, 2021 – present Nickelodeon SB Projects TV-Y Flash Comedy Cyber Group Studios Oggy Oggy Comedy 1 season. 16 episodes Jean Cayrol August 24, 2021 – present Netflix Xilam Animation TV-Y CGI Cédric Guarneri Karate Sheep Comedy 1 season, 10 episodes TBA March 2, 2023 – present Netflix Xilam Animation Flash Cube Creative ====Italian==== Title Genre Seasons/episodes Show creator(s) Original release Network Studio Age rating Technique Sources Girls Of Olympus Fantasy 1 season, 26 episodes TBA July 16, 2021 – present Rai Gulp The Animation Band TBA Flash ====Asia Pacific==== Title Genre Seasons/episodes Show creator(s) Original release Network Studio Age rating Technique Sources Mira, Royal Detective Mystery 2 seasons, 54 episodes Becca Topol March 20, 2020 – June 20, 2022 Disney Junior Technicolor Animation Productions TV-Y CGI Comedy Wild Canary Animation Musical Kung Fu Wa! Action 1 season, 52 episodes Bo Fan July 25, 2022 (Pop) Tencent Video UYoung Flash Comedy ==Upcoming== Title Genre Seasons/episodes Show creator(s) Original release Original channel Studio Age rating Technique Source Goldie 1 season, 13 episodes Emily Brundige February 14, 2025 Apple TV+ Mercury Filmworks Flash Win or Lose Comedy TBA Carrie Hobson February 19, 2025 Disney+ Pixar Animation Studios CGI Michael Yates Iyanu: Child of Wonder Action TBA Roye Okupe April 5 , 2025 Cartoon Network Lion Forge Animation Traditional Superhero Max Super Duper Bunny League Superhero 1 season, 26 episodes TBA April 9, 2025 Nickelodeon Nickelodeon Animation Studio Flash Weather Hunters Educational TBA Al Roker July 7, 2025 PBS Kids Al Roker Entertainment CGI Mickey Mouse Clubhouse+ Educational TBA TBA August 2025 Disney Junior Disney Television Animation CGI Iron Man And His Awesome Friends Educational TBA TBA Summer 2025 Disney Junior Marvel Animation CGI Miffy 78 episodes TBA Summer 2025 Canal+ Superprod Animation CGI StudioCanal Mercis Asterix and Obelix: The Big Fight Miniseries TBA Alain Chabat 2025 Netflix Netflix Animation CGI TAT Productions Les Éditions Dargaud Hey A.J. Educational TBA Leo Wilson 2025 Disney Junior Surfing Giant Studios Flash Millie Magnificent 52 episodes TBA 2025 Canal+ Nelvana CGI Treehouse TV Motel Transylvania TBA TBA 2025 Netflix Sony Pictures Animation CGI Sofia the First: Royal Magic TBA Craig Gerber 2026 Disney Junior Disney Television Animation Electric Emu Productions Acoustic Rooster and his FUNK BarnBand TBA Kwame Alexander TBA PBS Kids WGBH Kids Traditional Big Sea Entertainment Adventure Time: Heyo BMO Educational TBA Adam Muto TBA Cartoon Network Frederator Studios Traditional Ashlyn Anstee Cartoon Network Studios Adventure Time: Side Quests TBA Nate Cash TBA Cartoon Network Frederator Studios Traditional Cartoon Network Studios The Amazing World of Gumball: The Series Comedy TBA Ben Bocquelet TBA Cartoon Network Hanna-Barbera Studios Europe Flash Traditional CGI Live Action Puppetry Barbara Throws a Wobbler TBA Joris van Hulzen TBA Cartoon Network Hanna-Barbera Studios Europe Bat- Family Superhero TBA TBA TBA Amazon Prime Video Warner Bros. Animation DC Entertainment Bearbrick TBA TBA TBA Apple TV+ DreamWorks Animation Television Flash Dentsu Entertainment Bewitched TBA TBA TBA TBA Sony Pictures Television — Kids Born Driven TBA TBA TBA Nickelodeon Nickelodeon Animation Studio Lion Forge Animation Charlie and the Chocolate Factory Miniseries TBA Taika Waititi TBA Netflix Sardine Productions Chippy Hood TBA TBA TBA TBA Mostapes Flash Lion Forge Animation Imagine Kids+Family Cookies & Milk TBA TBA TBA Disney Channel Disney Television Animation Traditional Cinema Gypsy Productions Jesse James Films The Doomies Adventure TBA Andrès Fernandez TBA Disney+ Xilam Animation Flash Rémi Zaarour Disney Channel Disney EMEA Animation Studio Dragon Striker Fantasy TBA Sylvain Dos Santos TBA Disney+ Cyber Group Studios Traditional La Chouette Compagnie Disney Channel Disney EMEA Animation Studio Dusty Dupree TBA Kris Wimberly TBA Disney Junior Disney Television Animation Electric Emu Productions Foster's Imaginary Nursery Educational TBA Craig McCracken TBA TBA Hanna-Barbera Studios Europe Flash Go-Go Mystery Machine TBA Francisco Paredes TBA Cartoon Network Warner Bros. Animation Gumby Kids TBA Deeki Deke TBA TBA Bento Box Entertainment Heiress TBA TBA TBA TBA Lion Forge Animation Bron Digital HexVets and Magic Pets Adventure TBA Nicole Dubuc TBA Nickelodeon Boom! Studios CGI Comedy Nickelodeon Animation Studio Flash Hotel Whiskers TBA TBA TBA TBA Sony Pictures Television — Kids Horton Hears a Who! TBA TBA TBA Netflix Netflix Animation CGI Dr. Seuss Enterprises Iron Dragon TBA TBA TBA Nickelodeon Nickelodeon Animation Studio Lion Forge Animation Juno The Jellyfish TBA Jess Hitchman TBA TBA 9 Story Media Group CGI Scholastic Entertainment Crayola Studios Magicampers TBA Obie Scott Wade TBA Disney+ Mikros Animation CGI Disney EMEA Animation Studio The Magic School Bus: Mighty Explorers TBA TBA TBA TBA 9 Story Media Group Flash Brown Bag Films Scholastic Entertainment Mama & Dada TBA Jimmy Fallon TBA TBA DreamWorks Animation Television Johanna Stein Electric Hot Dog Noelle Lara Marley and the Family Band TBA TBA TBA Nickelodeon Nickelodeon Animation Studio Lion Forge Animation Polygram Entertainment Mashopolis TBA Carol-Lynn Parente TBA PBS Kids Oasis Animation Flash Messi and the Giants TBA TBA TBA TBA Sony Music Entertainment Sony Pictures Television — Kids Atlantis Animation Momoguro TBA TBA TBA TBA Baobab Studios Flash One Fish, Two Fish, Red Fish, Blue Fish TBA TBA TBA Netflix Netflix Animation Traditional Dr. Seuss Enterprises The Partridge Family TBA TBA TBA TBA Sony Pictures Television — Kids The Powerpuff Girls Superhero TBA Craig McCracken TBA TBA Hanna-Barbera Studios Europe The Powers TBA TBA TBA TBA Sony Pictures Television — Kids Sow You Entertainment Rainbow Brite TBA TBA TBA TBA Crayola Studios Cake Entertainment Hallmark Cards Regular Show: Lost Tapes TBA J. G. Quintel TBA Cartoon Network Cartoon Network Studios Scoops! Educational TBA Frank Falcone TBA TBA Time Studios Guru Studio Sharks on Wheels TBA TBA TBA TBA Sony Pictures Television — Kids Slayer Family Band TBA TBA TBA TBA Sony Pictures Television — Kids Stuart Little TBA TBA TBA Flash Sony Pictures Television — Kids The Sunnyridge 3 TBA Stevie Gee TBA Disney+ Blink Industries Traditional Boat Rocker Essy May Disney EMEA Animation Studio Team Mekbots Animal Rescue TBA TBA TBA Peacock More Minds Studio CGI Tiana Musical TBA TBA TBA Disney+ Walt Disney Animation Studios Flash Tiny Trailblazers TBA TBA TBA Disney Junior Hello Sunshine Disney Television Animation ¡Vamos! TBA TBA TBA TBA Sony Pictures Television — Kids Wacky Wednesday TBA TBA TBA Netflix Netflix Animation Dr. Seuss Enterprises ==References== Childrens animated",
 "title": "List of children's animated television series of the 2020s"
}