{
 "id": "1101839",
 "text": "Akram Zaatari (born in 1966 in Sidon, Lebanon) is a photographer, filmmaker, curator, and archivist. Central to his work is Lebanon, and other regions in the Middle East, during the years of the civil war and its aftermath. In 2013 Zaatari represented Lebanon at the 55th Venice Biennale. He has held many exhibitions over the past two decades and has public collections across the globe. He co-founded the Arab Image Foundation in 1997. == Biography == Zaatari grew up in Saida, during the Israeli occupation. He began taking photographs at a young age, which are continuously featured in his works. The photos he took at the age of 16 from his balcony on the first day of the Israeli invasion are featured in his short film Saida June 6th 1982. He attended the American University of Beirut, where he studied architecture. He obtained his MA in media studies at The New School in New York. Zaatari worked in television at the start of his professional career. He was hired in 1995 at Future TV as executive producer for a television program. In 1997 Zaatari co- founded the Arab Image Foundation with photographers Fouad Elkoury and Samer Mohdad. == Selected Works == === Hashem el Madani === This is a project which Zaatari began in 1999 after coming across Madani's photographs. Madani was a studio owner in Saida from 1948 until his death in 2017. He reportedly photographed 90% of the towns inhabitants over five decades. Zaatari was interested in the photos that captured his home city and began working with Madani in archiving his photography. Since then, Zaatari has displayed Madani's photographs at several galleries, including The Photographers' Gallery and Tate Modern. He has also published books as part of the Hashem el Madani project. === This Day === This is a video essay shot in Syria, Jordan and Lebanon, in 2003. It is an open-ended documentary that examines different modes of access to information: travel, television, the Internet. The film is about the ordinary images of the Middle East within the context of war. In an interview, Zaatari describes this work as being about what pushes one to record ordinary daily things, which may not be usually historically documented. It links to the artist's wider interest in time capsules. === Letter to a Refusing Pilot === The installation was featured at the 55th Venice Biennial in 2013, where Zaatari represented Lebanon. The installation is about a pilot, Hagai Tamir, who refuses to bomb a school in Sidon. Whilst growing up in Sidon, Zaatari heard rumours about the refusing pilot and after some years the identity of the pilot was revealed to him. Letter to a Refusing Pilot uses a combination of visual techniques, enhancing their message through the placement of the individual elements It uses archival material like photos, videos, diary entries, newspaper cutouts. This work is about revisiting and reconstructing the past in a way that deviates from the dominant historical narratives. == Selected Publications == * The Vehicle: picturing moments of transition in a modernising society (the Arab Image Foundation and Mind the Gap, 1999) * Map Sitting: On Portraiture and Photography. A Project by Walid Raad and Akram Zaatari (the Arab Image foundation, and Mind the gap, 2002) * Hashem el Madani: Studio Practices. An Ongoing Project by Akram Zaatari ( the Arab Image Foundation, Mind the gap, and The Photographers' Gallery, 2004) * Hashem el Madani: Promenades and Studio Practices (La Caixa Forum, 2007) * Akraam Zaatari: Earth of Endless Secrets (Portikus, Sfeir-Semler Gallery, and the Beirut Art Centre, 2009) * Conversation with an Imagined Israeli Filmmaker Named Avi Mograbi (Published in English by Sternberg Press, Laboratoire d'Aubervilliers, 2012) * Time Capsule Kassel (Mouse Publishing, 2014) * All Is Well (Agnes Etherington Art Center, and The Carleton University Art Gallery, 2014) * Akram Zaatari. Against Photography (MACBA, 2017) * Rifat Chadirji: Building Index (Arab Image Foundation, and Kaph Books, 2018) == Awards == * Jury Award awarded by Video Lisboa, Lisbon (2001) * Gran Award awarded by Ismailia International Film Festival for Documentaries and Shorts, Ismailia, Egypt (2002) * Prix Son awarded by Festival International de Cinema de Marseille, France (2004) * 1st Prize awarded by FAIR PLAY Video Art Festival, Berlin (2005) * Grand Prize from the Associação Culture Videobrasil (2011) * 4th Yanghyun Prize (2011) == Filmography == *The Fountain (1994) *Hadiyeh (1995) *Countdown (1995) *Reflection (1995) *Teach Me (1996) *All is Well on the Border(1997) *Majnounak (Crazy of You) (1997) *Red Chewing Gum (2000) *How I Love You (2001) *Transit Visa (2001) *Baalbeck (2001) *This Day (2003) *In This House (2004) *Nature Morte (2008) *Tomorrow Everything Will Be Alright (2010) *Dance to the End of Love (2011) *Letter to a Refusing Pilot (20113) *Twenty-Eight Nights and a Poem (2015) *On Photography, Dispossession and Times of Struggle (2017) *The Script (2018) *The Landing (2019) == Exhibitions == === Selected Solo Exhibitions === * Darat al Funun, The Kahlid Shoman Foundation, Amman, Jordan, 1999 * The Townhouse Gallery, Cairo, Egypt, 2000 * Mapping Sitting. On Portraiture and Photography, in collaboration with Walid Raad, SK Die Photographische Sammlung, Cologne, Germany, 2002 * Unfolding, Portikus, Frankfurt, Germany, 2004 * Mapping Sitting. On Portraiture and Photography, in collaboration with Walid Raad, Centre Pour l'Image Contemporaine, Geneva, Switzerland, 2004 * Mapping Sitting. On Portraiture and Photography, in collaboration with Walid Raad, Grey Art Gallery, New York, USA, 2005 * Hashem el Madani: Pomenade and Studio Practices, La CaixaForum, Barcelona, Spain, 2006 * ART Statements, Art Basel, Basel, Switzerland, 2007 * Earth of Endless Secrets, Sfeir-Semler Gallery, Beirut, Lebanon, 2009 * Akram Zaatari, Laboratories of Aubervilliers, Aubervilliers, France, 2010 * Composition for Two Wings, Kunsternes Hus, Oslo, Norway, 2011 * This Day, Moderna Galerija Ljubljana, Slovenia, 2011 * This Day at Ten, Magasin - Centre National d'Art Contemporain, Grenoble, France, 2012 * Tomorrow Everything Will Be Alright, MIT List Visual Arts Center, Cambridge, Massachusetts, USA, 2012 * The End, Sfeir-Semler Gallery, Hamburg, Germany, 2012 * The Uneasy Subject, MUAC, Mexico City, Mexico, 2012 * Letter to A Refusing Pilot, Lebanon Pavilion, 55th International Venice Biennale, Venice, Italy, 2013 * Project 100: Akram Zaatari, MoMA, New York, USA, 2013 * This Day at Ten, Sfeir-Semler Gallery, Beirut, Lebanon, 2013 * All is Well, Agnes Etherington Art Centre, Kingston University, Ontario, Canada, 2013 * Akram Zaatari, SALT, Istanbul, Turkey, 2014 * This Day at Ten, WIELS: Contemporary Art Centre, Brussels, Belgium, 2014 * Akram Zaatari: The End of Time, The Power Plant, Toronto, Canada, 2014 * Unfolding, Moderna Museet, Stockholm, Sweden, 2015 === Selected Group Exhibitions === * Haunted by Detail, Die Appel, Amsterdam, Netherlands, 2002 * SENI, Singapore Art Museum, Singapore, 2004 * Art Now in Lebanon, Darat al Funun, The Khalid Shoman Foundation, Amman, Jordan, 2008 * Closer, Beirut Art Center, Beirut, Lebanon, 2009 * Mapping Subjectivity, Museum of Modern Art, New York, USA, 2011 * Unboxing Photographs. Working in the Photo Archive, Kunstbibliothek, Berlin, Germany, 2018 * Masculinities: Liberation Through Photography, Gropius Bau, Berlin, Germany, 2020 * History Tales. Fact and Fiction in History Painting, Paintings Gallery of the Academy of Fine Arts Vienna, Austria, 2023 ==References== Category:1966 births Category:Living people",
 "title": "Akram Zaatari"
}