{
 "id": "1101528",
 "text": "The Battle of Kosmach (also known as Rushir Battle) is a six-day battle between UPA rebels and NKVD punitive forces. It lasted from January 30 to February 5 and ended with a tactical and strategic victory for the rebels. On January 30, the Soviet command pulled border troops 31, 33 and 87 and some other Soviet formations to the rebel-controlled village of Kosmach in order to capture the \" Banderiv capital\" nicknamed by the Enkavedists. On the same day, the offensive began. The UPA fighters, seeing the attacking enemies, were in no hurry to go into battle, but retreated to the surrounding forests. The occupiers decided to engage in terror against civilians. However, after a few hours, the Ufa soldiers returned to the village and opened fire on the enemies. The battle lasted continuously for three days. Three days later, the punitive detachments were encircled, moreover, they almost completely ran out of ammunition and ammunition. So the soldiers radioed the soldiers from Stanislav and asked for reinforcements - the 256th Soviet regiment led by Lieutenant Colonel Aleksey Dergachev. However, the rebels managed to intercept the radiogram, and they knew in advance that reinforcements were coming to the enemy, and decided to prevent the arrival of reinforcements. The command issued an order to entrench itself on the Kolomyia-Kosmatsky Road and stand to the death. At that time, the commander of the department was seriously wounded, and the command passed to the hands of Myroslav Simchich, who found a terrain suitable for an ambush - the road was surrounded by mountains on both sides and rested on the river. Later, the people of Bandera destroyed the bridge and established themselves. New reinforcements were never sent. The \"Skazheni\" smokehouse and two hundreds of \"Haidamaks\" from Upp decided to take advantage of this, launching a counterattack with the aim of eliminating the boiler. Another 80 punishers were killed. The boiler was liquidated by February 5. The losses of the UPA are not known for sure, but it is known for sure that directly during the ambush on the column of Soviet punitive fighters, the UPA lost 3 soldiers killed, and their commander Myroslav Simchych was seriously wounded in the left hand. On the morning of the next day, 12 trucks appeared on the road, completely filled with NKVD soldiers and ammunition, as well as one car with a commander. They all stopped by the river, seeing that the bridge was gone. Later, Simchich gave the command to shoot. A two-hour shootout ensued, during which the UPA fighters lost only 3 soldiers (killed), and the communists lost up to 250. During the battle, the Soviet reinforcements were completely destroyed. According to Simchich, no one counted the destroyed Muscovites because of the too large number of those killed, and the headquarters was informed that two hundred soldiers had been eliminated. In the course of the battle, the commander of the NKVD armada, lieutenant colonel Alexei Dergachev, who also distinguished himself in the Winter War, was also destroyed by mass deportations of Crimeans to Central Asia and Chechens and Ingush to Kazakhstan. New reinforcements were never sent. The \"Skazheni\" smokehouse and two hundreds of \"Haidamaks\" from Upp decided to take advantage of this, launching a counterattack with the aim of eliminating the boiler. Another 80 punishers were killed. The boiler was liquidated by February 5. The losses of the UPA are not known for sure, but it is known for sure that directly during the ambush on the column of Soviet punitive fighters, the UPA lost 3 soldiers killed, and their commander Myroslav Simchych was seriously wounded in the left hand. Category:Soviet Union",
 "title": "Battle for Kosmach"
}