{
 "id": "1101232",
 "text": "Nasal clicks are sounds like clicks, but instead of just air, they come out of your nose. There are different types of clicks, like ones made with the tongue touching the roof of the mouth, the teeth, the sides of the mouth, the top of the mouth, the back of the mouth, and the lips. Each of these can also have a nasal version, where the sound comes out of your nose. These nasal clicks can be said in different ways, like with your voice on or off, with a puff of air, with a soft breathy sound, and according to Miller (2011), with a special throat action.Amanda Miller, 2011. \"The Representation of Clicks\". In Oostendorp et al. eds., The Blackwell Companion to Phonology. == Types of nasal clicks == Modally voiced nasal clicks are very common. They are found in almost every language that uses clicking sounds. For example, in Damin, only nasal clicks are used, and in Dahalo, there are nasal clicks along with regular ones and special ones made with the throat. When you make these nasal clicks, you keep your nose closed like when saying \"m\" or \"n\", and then you make a clicking sound with your tongue. They are usually written like \"ᵑǃ\" or in other languages, using different combinations of letters like \"ǃn\", \"ǁn\", \"ǀn\", and \"ǂn\". Aspirated nasal clicks, often described as voiceless nasal with delayed puff of air, are very common in southern Africa. They are used in all languages of certain language groups in that region, but not really anywhere else. They are usually written like \"ᵑ̊ǃʰ\" or in other languages, using different combinations of letters like \"ǃh\", \"ǁh\", \"ǀh\", and \"ǂh\". When you say words with these sounds by themselves, they start with just air coming out of your nose and then a click, and sometimes a soft breathy sound at the end. But when these sounds are part of a longer word or phrase, they might have a bit of voice mixed in, and the vowel before them might sound more like a hum. This kind of click also changes the pitch of the vowel after it. Breathy-voiced nasal clicks are not as common. They are found in some languages spoken by !Kung people like Juǀʼhoansi, in Taa, and in the Bantu languages Xhosa and Zulu. They sound like regular nasal clicks, but with a bit of extra breathiness afterward. This breathiness might also change the tone of the word in languages like Zulu and Xhosa. They are usually written like \"ᵑǃʰ\" or \"ᵑǃʱ\" or in other languages, using different combinations of letters like \"nǃh\", \"nǁh\", \"nǀh\", and \"nǂh\". In IPA, they might be shown as \"ᵑǁʱ\" or \"ᵑ̈ǁ\". Voiceless nasal clicks, which are different from voiceless aspirated clicks, are only found in one language, Taa. In Taa, these clicks are used to show if a word is singular or plural. In this language, both voiced and voiceless nasal clicks make the following vowel sound like it's coming from the nose. The main difference between them is that voiceless nasal clicks sound like air being let out before the click, even after vowels.Naumann, Christfied (2008). \"The Consonantal System of West ǃXoon\". 3rd International Symposium on Khoisan Languages and Linguistics. Riezlern. Glottalized nasal clicks are special clicking sounds where you close off your throat. All types of clicks, like the ones made with the tongue touching different parts of the mouth, have this special version. They're quite common in languages spoken in Africa, like Khoisan languages and some others. To make these clicks, you first stop the air in your throat, like when you say \"uh-oh!\", and then you make the clicking sound with your tongue. Preglottalized nasal clicks are another kind of click sound. They sound like regular clicks, but just before the click, there's a quick moment where air goes out of the nose and your throat closes briefly. These sounds are seen as one single sound, not a throat closure followed by a click. They are only found in a few languages: Taa, Ekoka !Kung, and ǂHoan. (In Taa, there are also preglottalized sounds that are not clicks, but Ekoka !Kung doesn't seem to have them.) == References == Category:Consonants",
 "title": "Nasal click"
}