{
 "id": "1101044",
 "text": "Mark Rober (born March 11, 1980) is an American engineer, inventor, and popular science YouTuber known for his creative and educational content. He gained prominence for his work as a mechanical engineer at NASA's Jet Propulsion Laboratory (JPL), where he contributed to missions such as Curiosity rover and Mars Science Laboratory. == Early life and education == Mark Rober was born on March 11, 1980, in Orange County, California. He developed an early interest in science and engineering, often spending his time building contraptions and conducting experiments. Rober attended Brigham Young University, where he earned his Bachelor of Science degree in Mechanical Engineering. He later pursued a Master's degree in Mechanical Engineering from the University of Southern California. == Careers == === Career at NASA === After completing his education, Rober began his professional career at NASA's Jet Propulsion Laboratory (JPL) in Pasadena, California. During his nine-year tenure at NASA, he worked on a variety of projects, including the Mars Curiosity Rover. Rober's work involved designing and implementing various components of the rover's mobility systems, contributing to its successful exploration of the Martian surface. === YouTube career === In 2011, Mark Rober began pursuing a career in content creation on YouTube. He started his channel to share his passion for science and engineering with a broader audience. Rober's videos often feature innovative DIY projects, science experiments, and educational content aimed at inspiring curiosity and creativity in viewers of all ages. One of Rober's most popular videos, \"Glitter Bomb vs. Package Thief\", gained widespread attention for its creative approach to combating package theft. The video showcased a device Rober engineered to glitter-bomb thieves who steal packages from doorsteps, garnering millions of views and media coverage. Investments/companies In 2022, Rober founded the company 'Crunchlabs', an organisation dedicated to educate kids, teens, and adults in STEM(Science, Technology, Engineering, Mathematics)..tyd == Notable projects and achievements == * Glitter Bomb vs. Package Thief: Rober's invention to deter package theft gained international praise and inspired discussions about the issue of porch piracy. * World's Largest Super Soaker: In 2017, Rober built the world's largest Super Soaker, which broke the Guinness World Record for the largest functional water gun. * Mars Rover Curiosity: Rober's contributions to the Mars Curiosity Rover mission earned him recognition for his engineering expertise and dedication to space exploration. === Philanthropy === Mark Rober is actively involved in charitable initiatives and frequently uses his platform to raise awareness and funds for various causes. He has partnered with organizations such as #TeamTrees, which aims to combat climate change by planting trees around the world. == Personal life == Outside of his work and YouTube career, Mark Rober enjoys spending time with his family and exploring new scientific and engineering challenges. He continues to inspire and educate millions of viewers through his engaging content and innovative projects. ==References== Category:1980 births Category:Living people Category:American inventors Category:American YouTubers Category:Engineers from California Category:Entertainers from California",
 "title": "Mark Rober"
}