{
 "id": "1102884",
 "text": "Heinz Arzberger (born 27 August 1972) is a retired Austrian professional footballer. He played as goalkeeper. After his career he became goalkeeper coach for FC Red Bull Salzburg and FC Liefering. ==Career == Heinz Arzberger began his career at SC St. Michael im Lavanttal and later moved to Wolfsberger AC. With the team he played one year in the Second league. After the relegation he played very good in the Regionalliga Mitte he was transfered to SK Sturm Graz. He made his debut in the Austrian Bundesliga on 4 November 1995 under coach Ivica Osim . 1997 he was transferred to SV gerasdorf in the Second league. 1997 he moved to VSE St. Pölten together with Gerasdorf coach Kurt Garger. In the Lower Austrian capital, he developed into a top goalkeeper and also drew the attention of Bundesliga clubs with his performance. On 1 July 1999 he moved to SV Austria Salzburg. There he was second goalie behind Szabolcs Sáfár. After Sáfár's move to Spartak Moscow he became standard goalkeeper at Austria Salzburg. With the takeover of Salzburg Sport AG by Red Bull GmbH and the signing of his dream player Alexander Manninger, Arzberger moved back into second place at the beginning of the 2005/06 season. When Manninger was injured in the fall, Arzberger was again standard goalie for the rest of the fall season. After Manninger's recovery he became again first goalkeeper. In the autumn season of 2006 Arzberger was only used in the club's amateur team. In the 2008/09 season he played 13 championship games in the spring after Timo Ochs and then Eddie Gustafsson were injured. At the start of the 2009/10 season he was the backup goalkeeper for Eddie Gustafsson. After this season, Heinz ended his professional goalkeeper career. From the 2010/11 season he sat on the bench as a substitute goalkeeper for Salzburg's second team in the Regionalliga West. After the end of his active career, he became a goalkeeper coach of FC Liefering. ==International == On 25 May 2004 he played his only game for the Austrian national football team versus Russia. Weltfußball.de ==Honours == Austrian championː 2007, 2009, 2010 ==References == Category:1972 births Category:Living people Category:Players of the Austrian national football team Category:FC Red Bull Salzburg players Category:FC Liefering players Category:Austrian football goalkeepers Category:Association football goalkeepers Category:FC Liefering managers",
 "title": "Heinz Arzberger"
}