{
 "id": "1102917",
 "text": "Sony's Spider-Man Universe (SSU) is an American media franchise. It is set in a fictional universe with the setting of several superhero movies and television shows made by Sony, based on characters by Marvel Comics. The franchise's movies that have released are Venom (2018) and Venom: Let There Be Carnage (2021), starring Tom Hardy as Eddie Brock / Venom, Morbius (2022), starring Jared Leto as Dr. Michael Morbius, and Madame Web (2024), starring Dakota Johnson as Cassandra Webb. Hardy will return as Brock and Venom in Venom: The Last Dance (2024), the last movie of the Venom trilogy. Another SSU movie was released in 2024, Kraven the Hunter, starring Aaron Taylor-Johnson as Sergei Kravinoff / Kraven. The franchise will also have TV series, starting with Spider-Noir, starring Nicolas Cage as Spider-Man Noir, returning from the Spider-Verse movies. More movies and series are in development. The franchise is connected to Marvel Cinematic Universe (MCU), because Tom Holland's Peter Parker / Spider-Man appears in Let There Be Carnage, while Hardy returns as his role in Spider-Man: No Way Home (2021). The franchise is also connected to the Spider-Verse movies, because Peggy Lu returns as Mrs. Chen in Spider-Man: Across the Spider-Verse (2023). Venom, Morbius, and Madame Web have negative reviews, while Let There Be Carnage has mixed reviews. All four movies have made $1.630 billion, but Morbius and Madame Web were box-office bombs. == Movies == Movie U.S. release date Director Screenwriter(s) Producers Status Venom Ruben Fleischer Jeff Pinkner & Scott Rosenberg and Kelly Marcel Avi Arad, Matt Tolmach, and Amy Pascal Released Venom: Let There Be Carnage Andy Serkis Kelly Marcel Avi Arad, Matt Tolmach, Amy Pascal, Kelly Marcel, Tom Hardy, and Hutch Parker Morbius Daniel Espinosa Matt Sazama & Burk Sharpless Avi Arad, Matt Tolmach, and Lucas Foster Madame Web S. J. Clarkson Matt Sazama & Burk Sharpless and Claire Parker & S. J. Clarkson Lorenzo di Bonaventura Venom: The Last Dance October 25, 2024 Kelly Marcel Avi Arad, Matt Tolmach, Amy Pascal, Kelly Marcel, Tom Hardy, and Hutch Parker Kraven the Hunter December 13, 2024 J. C. Chandor Art Marcum & Matt Holloway and Richard Wenk Avi Arad, Matt Tolmach, and David Householter == Reception == === Box-office performance === Movie U.S. release date Box office gross All-time ranking Budget U.S. and Canada Other territories Worldwide U.S. and Canada Worldwide Venom $213,515,506 $642,569,645 $856,085,151 192 76 $100–116 million Venom: Let There Be Carnage $213,550,366 $293,313,226 $506,863,592 191 222 $110 million Morbius $73,865,530 $93,595,431 $167,460,961 1,898 1,652 $75–83 million Madame Web $43,817,106 $56,481,711 $100,298,817 2,120 1,856 $80 million Total $ $ $ – – $– million === Critical and public response === Movie Critical Public Rotten Tomatoes Metacritic CinemaScore PostTrak Venom 30% (365 reviews) 35 (46 reviews) B+ 80% Venom: Let There Be Carnage 57% (281 reviews) 49 (48 reviews) B+ 76% Morbius 15% (283 reviews) 35 (55 reviews) C+ 62% Madame Web 12% (238 reviews) 26 (51 reviews) C+ 54% == References == Category:Sony's Spider-Man Universe Category:Spider-Man movie series",
 "title": "Sony's Spider-Man Universe"
}