{
 "id": "1102905",
 "text": "Albert Kesselring (30 November 1885 - 16 July 1960), was a German Wehrmacht Air Force general/Field Marshal Military Officer in Germany during World War II and a convicted Nazi Military war criminal. He is also Hermann Göring’s second in Command of the German Wehrmacht Military’s Luftwaffe the regular Air Force branch of the Wehrmacht which give air superiority to bombardment enemy army forces as air support while the regular German Armies (Heer) fight on land in Europe during the War. Kesselring joined Germany’s Imperial German Army in 1904 and served as a infantry soldier in the army until 1912 when he served as a Balloon Observer in the Imperial German Army Air Force until 1913. During World War 1 in Europe from 1914-1919 he served as a Junior Army Officer with the rank of Hauptmann (Captain). He later then became a Oberst (Colonel) in 1930 in the Reichswehr’s German Army after the war. He then got promoted to Generalfeldmarschall (Field Marshal) in the German Army of the Reichswehr/Wehrmacht in 1934. In 1935 Generalfeldmarschall Kesselring got transferred to the Luftwaffe which is the regular Air Force branch of the Wehrmacht which served along side with the regular German army branch on land while in air while the German Navy branch served at sea. During the War in Europe from 1939-1945 he committed various crimes but was not a Holocaust perpetrator like Hermann Göring or Heinrich Himmler but he was responsible ordering German Luftwaffe plane forces to bomb all of Europe and as well as ordering Luftwaffe (Air Force) Paratrooper soldiers and regular Heer (Army) soldiers to work with the Waffen-SS to kill anyone who is also a suspected partisan under the orders of the Wehrmacht military under Wilhelm Keitel,Alfred Jodl,Hermann Göring including Heinrich Himmler . Category:1885 births Category:1960 deaths Category:German military personnel of World War I Category:German military personnel of World War II Category:German prisoners Category:German war criminals Category:People from Bavaria",
 "title": "Albert Kesselring"
}