{
 "id": "1102526",
 "text": "Yerima Usman Shettima (born on 28th May 1974) is a kaduna born , human right activist, citizens reporter, writer, and pro - democracy advocate , Managing Director and Chief executive Officer Shehalfat properties and logistics, founder and president general of Arewa Youths Cunsultative Forum (AYCF). == Early life == Yerima Usman Shettima was born on 28th May, 1974 in the city of Zaria in kaduna state , Nigeria . He was born into a Fulani family and was raised in the Islamic faith. Shettima began his education career in Islamiya primary school in otukpo, Benue State , where he received his early education, he attended the Nico commercial secondary school in Cross River State . And later proceed to Lagos State University (LASU), where he get Bachelor's degree in public administration. He completed his master's degree in conflict peace and strategic studies in Kaduna state University. == Early career == Yerima Usman Shettima begin his career as a self employed Chairman Shehalfat properties and logistics limited in kaduna State . He continously demonstrated his an active member of NADECO and the pioneer of Arewa Youths Cunsultative Forum (AYCF). Between 2004 and 2006, Yerima Usman Shettima is a youth director of PRONACO with people's like Wale Soyinka, Anthony Enahoro and Beko Ransom Kuti. He is one of the pioneer of Save Nigeria lead by Tunde Bakare. == Political career == Yerima Usman Shettima begin his politics as a first National Vice Chairman for the North East of the Democratic Party for a people's federation (DPPF) with lead by professor Wale Soyinka. In 2011 Shettima became vice president candidate of the Liberal Democratic Party Of Nigeria (LDPN). He also contested for the House of Representatives kaduna North in 2019. He became the presidential Candidate under (YDP) in 2014. == Activism == Yerima Usman Shettima an activist has literally seen.it all, in the fierce battle to consign millitary to the barracks,and pave the way for the current democratic dispensation. He has on many occasions been a guest to the Directorate of Security Service (DSS) and police cells for standing up for democracy, equal rights freedom and justice in Nigeria. Along the line many other prisoners of conscience like Yerima, who were detained by the junta died incarceration. Few, including Yerima, survived this onslaught by the military, in the form of caging the voice of reasoning. == Personal life == Yerima Usman Shettima is married with two Wife's Hajiya Halima Shettima and Hajiya Fatima Shettima and bless with Children's. == Awards and recognition == * Honorary Award - Ijaw youth Development Association. * Centre for Resolution and NGo promoting peace and unity. * Icon of peace and conflict. * Global Forum for peace justice and Human rights Ambassador for peace. * Per ASPERAAD Astra certificate of honour, legion of eminent personalities in Africa. * International youth peace Tourism Ambassador Ijaw monitoring Group (IMG). == Title == * Jarman Lagos * Omeudo Ndigbo by Obi Eziokwundigbo of Mushin Land. ==References== Category:1974 births Category:Living people Category:People from Kaduna State Category:Nigerian activists",
 "title": "Yerima Usman Shettima"
}