{
 "id": "1102369",
 "text": "Ronke Giwa-Onafuwa, also known as Ronnie G, is a Nigerian radio presenter and broadcaster She received the Nigerian Broadcasting Award for Most Popular Radio Personality (Southwest Zone). == Early life and education == Ronke Giwa was born in Lagos State, Nigeria. She attended Lagos State University where she studied English language and literature. She then moved to London to study music performance and production at the London Centre for Contemporary Music. When she returned to Nigeria, she attended the University of Ibadan where she obtained a master's degree in Communication and Language Arts. ==Career== Ronke Giwa joined the broadcasting industry during her year with the National Youth Service Corps (NYSC) in Ibadan. She has worked with Splash FM in Ibadan as a radio presenter since 2009, and heads the digital media unit. She is also the host of the popular early morning show Morning Splash'\". She also sometimes writes books, and is the author of two books: Lara's Lessons and Lulu Learns. Ronke Giwa worked with Splash FM for eleven years. In December 2020 left the radio station, to move higher in her career. After leaving the integrity station, she joined Vintage FM in Ibadan, and was chosen as the general manager of the station. On 2 March 2024 Ronke Giwa announced that she has left Vintage FM, she made it known through her social media platforms and news, stating that she can't work in a place where decisions are taken in a way that does not align with her standard. ==Personal life== Ronke Giwa got married to Adebajo Onafuwa on 4 June, 2016. They have three children. == Books Written == *Lara's Lessons: a book on life through the lens of an adolescent. *Lulu Learns: a children's book. ==Awards and nominations== *Pacesetters Entertainment and Recognition Award: Best Newscaster 2017 and 2019. *Nigerian Broadcasting Award for Most Popular Radio Personality (Southwest Zone). ==References== Category:Living people Category:Year of birth missing (living people) Category:Radio personalities Category:Nigerian people",
 "title": "Ronke Giwa-Onafuwa"
}