{
 "id": "1102350",
 "text": "The Green Party of Alaska (GPAK) is a political group in Alaska. It was part of the Green Party of the United States until 2021. It was the first state to let the Green Party be on its ballots. In 2020, the Green Party of Alaska leaders didn't include Howie Hawkins and Angela Nicole Walker as their nominees. Instead, they chose Jesse Ventura for president and Cynthia McKinney for vice-president. McKinney agreed to be the vice-presidential candidate. Because of this, in January 2021, the national committee of the Green Party of the United States decided to cancel the recognition of GPAK. == Issues == The Green Party of Alaska doesn't want oil development in the Arctic National Wildlife Refuge. They prefer using wind and solar power instead. They also support a healthcare system where the government pays for everyone's medical care. == Split from National Green Party == In late 2020, the Alaska Green Party split from the Green Party of the United States and chose Jesse Ventura for president and Cynthia McKinney for vice president, instead of Howie Hawkins and Angela Nicole Walker. The Ventura–McKinney team got 2,673 votes, which is 0.74% of the total votes. In January 2021, because they separated from the GPUS, GPAK lost its official status as the Alaska state chapter of the GPUS. Now, the GPUS is working on setting up a new GPAK to replace it. == Presidential Candidates == Presidential election results Election Presidential candidate Vice-presidential candidate Votes Percentage 1996 Ralph Nader Winona LaDuke 7,597 3.14% 2000 28,747 10.07% 2004 David Cobb Pat LaMarche 1,058 0.34% 2008 Cynthia McKinney Rosa Clemente Unknown 2012 Jill Stein Cheri Honkala 2,917 0.97% 2016 Ajamu Baraka 5,735 1.80% 2020 Jesse Ventura Cynthia McKinney 2,673 0.74% 2024 Jasmine Sherman Tanda BluBear 0 null% == Notes == == References == == Other websites == *Official Green Party of Alaska website Category:1990 establishments in the United States",
 "title": "Green Party of Alaska"
}