{
 "id": "1102385",
 "text": "Fascist Italy, refers to the time when the Kingdom of Italy was led by Italian fascist Benito Mussolini from 1922 - 1943. == History == === Before World War II === in 1922. The Italian fascist led the March on rome. The march was successful and Benito Mussolini was appointed by king Victor Emmanuel III to be prime minister. at this time, Fascism was becoming very popular around the world. Including Germany that became fascist in 1933 when Adolf Hitler (the leader of the NSDAP) became chancellor. At first, Italy opposed German expansionism and prevented Germany from invading Austria in the early 1930’s. But Italy started to invade other countries (like Ethiopia in 1936 and Albania in 1939). === during World War II === italy joined the Second world war on June 10 1940. Invading British Somaliland in August . And starting the North African Campaign in September the next month by invading Egypt. Italy then tried to invade Greece in October but got pushed back. Italy took part in the axis Invasion of Yugoslavia in April 1941 and got help from Germany to finish there invasion of Greece. at this point Italy now controlled parts of Yugoslavia (Croatia and Montenegro) and Greece. And giving some parts to Italian controlled Albania. But not everything was going good for Italy. The allies liberated Ethiopia in 1941 and the North African campaign saw counter- attacks by both the Allies and the Italians. And Germany send some troops to help in North Africa. Italy was involved in the Eastern Front sending troops to fight in Operation Barbarossa and the Battle of Stalingrad. But some of them would be captured by the Soviets and became Prisoners of war. the axis forces in North Africa in 1943 by the allies and a few months later in July, the allies invaded sicily (with all the last axis forces leaving in august). With this, the Italian government ousted Mussolini from power and replaced him with Pietro Badoglio. Italy surrendered in September when the allies invaded the mainland. Germany invaded north Italy occupied all its captured territories and established the Italian Social Republic With Mussolini as leader. the RSI would collapse in May 1945 when the Italian campaign ended with an allied victory. Category:Fascism Category:20th century in Italy",
 "title": "Fascist Italy"
}