{
 "id": "1102886",
 "text": "Fahad Saad Abu-Mouti ( Arabic فهد بن سعد أبو معطي ) is a Saudi Employee currently holds Deputy Minister of Regulatory Affairs and General Supervisor of the Executive Body of the Water Regulator == Biography == He spearheaded the initiative to separate the responsibilities of the water industry from electricity establishing and overseeing a governing body, for the water sector in the Kingdom He worked on creating a plan for cost recovery and setting up pricing mechanisms to operate on a basis for the time. Additionally he implemented a system for oversight to monitor sector performance established a platform to safeguard consumer rights and issued licenses for all operational entities to ensure compliance with regulations. In his capacity he played a role in leading national sector projects, including drafting five laws and over ten regulations for independent national centers and programs as well as contributing to the Environment Fund. These efforts led to approvals and decisions, by the Saudi Council of Ministers. Abu Mouti has received executive management certifications, including a certificate, in strategic management and leadership from MIT in Boston, USA. He also achieved his Ph.D. With honors in computer engineering from Dalhousie University, in Canada. == Career == Dr. Fahd currently holds deputy minister of regulatory affairs at Saudi Arabia’s Ministry of Environment, Water, and Agriculture He contributed to collaborating with the Ministry of Energy to set the country's energy targets create structures for overseeing the execution of energy initiatives, in the nation form a central hub for renewable energy information and coordinate Saudi Arabia partnership with the International Renewable Energy Agency. This led to his appointment as a representative from Saudi Arabia, on the Agency's Board of Governors..In his career he gained experience from working at the Saudi Electricity Company and the Public Electricity and Water Corporation, in Qatar, where he was involved in tasks, maintenance duties and strategic planning. Dr. Fahd has served on boards and committees over the years. Currently holds a position on the Board of Directors of the Water and Electricity Regulatory Authority. Additionally he serves as a member and secretary, on the Steering Committee of the Water Organizer. == References == Category:Saudi Arabian people Category:Saudi Arabian politicians Category:Living people Category:Year of birth missing (living people)",
 "title": "Fahad Abu Mouti"
}