{
 "id": "1103599",
 "text": "The flag of Barcelona () It is divided in four cantons, two are the senyera and other two the cross of Saint George; the patron saint of Catalonia, with the traditional red and yellow bars of the Senyera, the ancient symbol of the Crown of Aragon (here, the bars are vertical, though the modern flag of Catalonia has horizontal stripes). The emblem has a diameter of three-quarters the with of the center. The ratio of the flag is 2:3. ==Design and symbolism== The meaning of the colors of the flag are as follows: This flag use two cantons with Saint George's flag, a red cross on the white camp. * Red. * White. The flag there are two cantons with senyeras, their colors are red and gold horizontal strips. * Red. * Yellow. ===Other flags=== File:St George's Cross.svg|Flag of Saint George's Cross. File:Flag of Catalonia.svg|Flag of the Senyera or Catalonia flag. ==History== Since the Middle Ages, the city's flag was the traditional quartered flag of crosses and sticks, and was raised as the banner of the host of Barcelona to lead the offensive or defensive armed mobilizations of the city. The genesis of this configuration was found in the transposition of the heraldic sign on a textile surface. The first graphic reference is found in the paintings of the Castle of Alcañíz (Aragon), in which knights appear and among which there is one with an equine facing adorned in that arrangement, although inverted, which could mean that said knight is the count from Besalú, the county that held these weapons. But at that time, the Count of Besalú was the monarch himself. ===20st century=== In 1996, after a number of different proposals, the City Council of Barcelona adopted a new flag, featuring the official logo of the city (which incorporates Saint George's cross) over the vertical Catalan stripes. The flag enjoyed some political support, but was opposed by some historical and vexillological groups, who campaigned against it. ===21st century=== The flag in its current form has been official since 2004, though it (or variations on it) may have been in use since the nineteenth century. It was first officially adopted in May 1906, but its use was not permitted during the rule of Francisco Franco; a slightly different version of the flag, with brighter colours and a different configuration of red bars, was readopted in 1984. In 2004, however, the city council \"recuperated\" the 1906 flag legislation, restoring the original design. Both the traditional (1906) and the modern (1996) designs can be seen today in the city, though the Catalan Vexillology Association () continues to campaign against the use of the latter. ===Historical flags=== Image:Bandera medieval de Barcelona.svg|Flag of Barcelona (Century XV). Image:Bandera de Barcelona de 2 barres.svg|Flag of Barcelona (1940 - 1996). Image:Bandera oficial de Barcelona 1996.svg|Flag of Barcelona (september de 1996) Image:Bandera_de_Barcelona_de_1996.svg|Flag of Barcelona (december 1996) ==Related pages== *Coat of arms of Barcelona *Flag of Spain * Senyera * Estelada ==References== == Other websites == Category:Barcelona Barcelona",
 "title": "Flag of Barcelona"
}