{
 "id": "1103036",
 "text": "The Justice for All Party (JFA) is a political third party in the United States founded in January 2024 by Cornel West to get ballot access for his 2024 presidential campaign. State affiliates were initially formed in North Carolina, Florida, and Washington, with additional affiliates later being created in California and other states. == Purpose == West is also running as an independent politician. He created the party to make it easier to get listed on ballots. The West 2024 campaign claimed that party would \"primarily be utilized as a grassroots, people-powered vehicle to secure ballot access in specific states.\" Cornel West himself added that \"the fewest number of signatures to attain ballot access in states like North Carolina, Florida, and Washington.\" == Status == === Ballot access === Cornel West has obtained ballot access in several states for the 2024 United States presidential election. The Justice for All Party of North Carolina obtained enough signatures to gain ballot access, but was denied access by the North Carolina State Board of Elections. In July 2024, the denial was challenged in federal court. In August 2024, the United States District Court for the Eastern District of North Carolina ordered the North Carolina State Board of Elections to recognize the Justice for All Party of North Carolina and place their candidates on the ballot. === Filing === On March 21, 2024, it was confirmed by the office of Shirley Weber, the Secretary of State of California, that filings to form a state affiliate of the Justice for All Party in California had been received. == National Convention == Upon the formation of the party, Edwin DeJesus, a spokesperson for the West 2024 campaign, claimed that JFA intended to hold a national convention at some point in 2024, but that no specific date had been set yet. == Related pages == * Cornel West 2024 presidential campaign * We the People Party == References == Category:2024 establishments in the United States Category:Political parties in the United States",
 "title": "Justice for All Party"
}