{
 "id": "1103223",
 "text": "Marc Dionne (born January 25, 1989) is a Canadian professional wrestler. He most recently competed for All Elite Wrestling (AEW) under the ring name Stu Grayson. He was a member of the stable The Dark Order. Dionne is also known for his time on the independent circuit where he wrestled under the ring names Stupefied and Player Dos. He is known for his tag team with Player/Evil Uno called the Super Smash Brothers, a reference to the video game series of the same name. He has competed in promotions such as Chikara, Ring of Honor (ROH), Dragon Gate USA, and Pro Wrestling Guerrilla (PWG). During his time in Pro Wrestling Guerrilla, Dionne was a one-time PWG World Tag Team Champion. ==Career== ===All Elite Wrestling=== On May 25, 2019, Grayson and Uno made their surprise debuts for All Elite Wrestling (AEW) as new members of The Dark Order. They appeared with many masked men at the end of a match between Best Friends (Trent Beretta and Chuck Taylor) and Angélico and Jack Evans. They then attacked everyone afterwards. At Fight for the Fallen, they made their in-ring debut, defeating A Boy And His Dinosaur (Jungle Boy and Luchasaurus) and Angelico and Evans. On the July 29, 2020 episode of Dynamite, Grayson and Uno challenged \"Hangman\" Adam Page and Kenny Omega for their AEW World Tag Team Championships but lost. On May 2, 2022, Grayson's contract expired. He returned on the March 15, 2023, episode of Dynamite. On April 1, 2024, it was reported that Grayson had been released from AEW. == Championships and accomplishments == *Alpha-1 Wrestling **A1 Tag Team Championship (2 times) – with Player Uno *Capital City Championship Combat **C4 Championship (1 time) **C4 Tag Team Championship (1 time) - with Thomas Dubois *Chikara **Campeonatos de Parejas (1 time) – with Player Uno **Chikara Young Lions Cup (1 time)cite web|url= https://www.cagematch.net/?id=5&nr;=431 **Young Lions Cup VII *Combat Revolution Wrestling **CRW Interim Tag Team Championship (1 time) – with Player Uno *Federation de Lutte Québécois ** FLQ Heavyweight Championship (2 times, current) **FLQ Heavyweight Championship Tournament (2016)cite web|url= https://www.cagematch.net/?id=26&nr;=5770 *International Wrestling Syndicate **IWS World Tag Team Championship (1 time) – with Player Uno *Lucha Toronto **Royal Canadian Tag Team Championship (2 times) - with Evil Uno *North Shore Pro Wrestling **NSPW Tag Team Championships (2 times) - with Evil Uno *Pro Wrestling Guerrilla **PWG World Tag Team Championship (1 time) – with Player Uno **Dynamite Duumvirate Tag Team Title Tournament (2012) – with Player Uno * Pro Wrestling Illustrated **Ranked No. 191 of the top 500 singles wrestlers in the PWI 500 in 2021 *Queen Street Entertainment **QSE Canadian Openweight Championship (1 time) *Smash Wrestling **F8tful Eight Tournament (2018) - with Player Uno *SoCal Uncensored **Match of the Year (2012) with Player Uno vs. Future Shock (Adam Cole and Kyle O'Reilly) and The Young Bucks (Matt Jackson and Nick Jackson) on July 21 **Tag Team of the Year (2012) – with Player Uno *Squared Circle Wrestling **2CW Tag Team Championship (1 time) – with Player Uno == References == == Other websites == * Category:1989 births Category:Living people Category:All Elite Wrestling alumni Category:Canadian professional wrestlers Category:Canadian YouTubers Category:Sportspeople from Quebec",
 "title": "Stu Grayson"
}