{
 "id": "1103760",
 "text": "Canada Post (known as Royal Mail Canada prior to 1967) is Canada's primary postal service. == History == in 1753 Benjamin Franklin, the postmaster of Philadelphia, established the first Canadian post office in Halifax. This was well before Canada became a confederation, when the area was still called British North America. Originally, its mail system was administered by the British postal service. After the area's first railway line was built 1836, the mail service quickly adopted rail transport to move mail faster and farther. This revolutionized the way Canadians communicated. In 1851, the British government gave the Province of Canada official responsibility for the post office. The new postal service quickly became one of the first departments formed in the new federal government. The Canada Post Corporation Act of 1981 transformed the former Post Office Department into the current government-owned Canada Post. == Growth and services == Over the years, Canada Post has expanded its services beyond mail delivery to include e-commerce solutions and digital mail services. In recent years, the organization has been phasing out door-to-door delivery for urban residents, moving towards community mailboxes. This change is part of a broader effort to modernize the postal service and manage costs more effectively. Today, Canada Post serves 15.1 million addresses, but only one-third of Canadians (about five million homes) receive their mail delivered to their door. The rest collect their mail from community, apartment, or rural-lot-line mailboxes. It costs Canada Post an average of about $168 per address annually to operate the mail system, with varying costs depending on whether mail is delivered door-to-door, to rural addresses, or to community mailboxes. Despite the growth in the number of addresses served, the volume of mail delivered by Canada Post has been decreasing each year. This reflects the changing communication habits of Canadians and the rise of digital alternatives. === Canada Post Community Foundation === In 2012, the organization established the Canada Post Community Foundation, a registered charity. Since 2012, the Foundation has granted over $12.3 million to 1,100 projects across Canada, focusing on supporting children and youth. In 2022, the Foundation launched the Indigenous Truth and Reconciliation Signature Grant. The grant was designed to support educational initiatives that align with the goals and recommendations outlined in the Final Report of the Truth and Reconciliation Commission of Canada. == Postage stamps == Canada Post has issued several stamps that are quite valuable today because they are so rare. They are also treasured as historical artifacts that offer a glimpse into Canada's past and the development of its postal service. Collectors and historians alike value these stamps for their connection to the broader narrative of Canadian history and philately. === 12d Black Canada stamp (1851) === The 12d Black Canada stamp, minted in 1851, is the most valuable postage stamp ever issued by Canada Post. It features a portrait of a young Queen Victoria. Initially 51,000 of these stamps were printed, but due to their high price at the time, only 1,450 were sold over three and a half years. As a result, it is one of the rarest Canadian stamps in existence. Today, 12d Black Canada stamps in mint (original) condition with intact gum are especially valuable because they were purchased by collectors who could afford them but chose not to use them for postage. One of the finest known examples sold for $225,000 at a Canadian auction on February 23, 2013. === 2¢ Large Queen stamp (1868) === Another notable stamp is the 2¢ Large Queen. Though printed in 1868, it was not discovered until 1925. Today only three used examples are known to exist. One of them fetched $215,000 at an auction held by Eastern Auctions on October 18, 2014. The stamp is so rare because other examples were destroyed or remain undiscovered (possibly lying unrecognized in private stamp collections). Category:History of Canada Category:Postal services",
 "title": "Canada Post"
}