{
 "id": "1103753",
 "text": "Benedict \"Ben\" Iroha (born 29 November 1969) is a Nigerian former professional association football player who played as a left-back or left midfielder. Considered to be one of the best left defenders in African football. He was renowned for his strong left foot, he was a great man-marker that made him capable of stealing every ball from opponents. ==Club career== Iroha started his career in Nigeria, he joined Bendel Insurance in 1987. He scored the first ever goal in the newly professional Nigerian league in 1990 for Iwuanyanwu Nationale, who went on to win the league that year. Iroha was originally a midfielder before national coach Clemens Westerhof converted him to play left back. His club career in Europe was largely unsuccessful, and Iroha was allocated to San Jose Clash in 1996. Iroha ended up playing in the inaugural MLS match against D.C. United, and is credited with the league's first-ever assist. The next season, he was traded to D.C. United, where he won the league title but was dropped to comply with salary restrictions. He entered negotiations with the team to re-sign his contract, but they were halted after Iroha was called up to the World Cup squad for Nigeria. After a move to Spanish side Elche CF in 1997, he moved to Watford in December 1998, playing ten games for the Hertfordshire side. A problem with bunions forced him to the sidelines, and he retired in March 2000. ==International career== In 1990, Iroha joined the first Nigeria national team, being called up for the 1990 African Cup of Nations. He was then reclassified by coach Clemens Westerhof from left midfielder to left defender. However, in the first match against the hosts, Algeria, he did not perform well in this position and Nigeria suffered a 5:1 defeat. Over time, the game of the \"Super Eagles\" got better and better and they reached the final, where they lost to Algeria again, this time 0:1. However, Iroha did not play in the final match because he suffered an injury halfway through the tournament. In 1994, Iroha again played in the African Cup of Nations tournament. He has already played in all matches of his national team in Tunisia. In the semi-final match against the Ivory Coast team, he scored the equalizing goal in the 26th minute. Ultimately, after 120 minutes, the match ended in a 2-2 draw, and the Nigerians won in a penalty shootout. Iroha also played in the final match against Zambia, which Nigeria won 2-1 and became African champions. After this tournament, Iroha was voted the best left defender in Africa. In the same year, he was called up by Westerhof to the team for the 1994 World Championships in the USA. There he played in the match against Bulgaria (3-0), but during the match he suffered a groin injury. He played in the match until the final whistle, but the injury turned out to be so serious that it eliminated him from the game until the end of the tournament. His place was taken by Michael Emenalo, who, however, did not play as impressively as Benedict. Nigeria was ultimately eliminated in the round of 16 after a 1-2 defeat against Italy. In 1998, Iroha won his second World Championship tournament in 1998. However, at the Championships in France, he was only a substitute for Celestine Babayaro and played only in the group match against Paraguay (1:3), in which he received a yellow card. Also in this tournament, Nigeria finished its participation in the 1/8 finals. Iroha made 50 appearances and scored 1 goal for the Nigeria national team. ==Coaching career== After retiring, he returned to the US to coach in the youth department of FC Dallas. Most recently, he was an assistant with the Nigerian U-17 team that won the 2007 FIFA U-17 World Cup and head coach of Nigeria's Dolphins FC. Iroha is on the staff of Heartland of Owerri. ==Honours== ===Club=== *Nigerian Championship: 1990 with Iwuanyanwu Nationale *Ivory Coast Championship: 1991, 1992 with ASEC *Ivory Coast Cup: 1992 with ASEC *MLS Championship: 1997 with Washington DC ===International=== *Winner: 1994 *Runner-up: 1990 *Third place: 1992 *CEDEAO Cup 1990 ==Other websites== * * ==References== Category:1969 births Category:Living people Category:Nigerian footballers Category:Association football defenders Category:Watford F.C. players",
 "title": "Benedict Iroha"
}