{
 "id": "1103162",
 "text": "Abiria also known as Abhiria, Aberia, or Abhiradesha referred to the country of the Abhiras who were mentioned in some texts of ancient India. It is mentioned in the Periplus of the Erythraean Sea and by Ptolemy in his Geographia.Alain Danielou, A Brief History of India (Inner Traditions, 2003), mentioned here Rambles: Alain Danielou, A Brief History of India, L'Histoire de l'Inde The Periplus mentions it as Aberia with the coastal district Syrastrene (modern-day Saurashtra, Gujarat), and Ptolemy locates it above the Indus delta. The 1st century CE Periplus of the Erythraean Sea, describes Abiria as the territory east of the Indus delta and north of Surastrene (modern Saurashtra), the spot most readily attained by the Phoenicians, where the products of the north, gold and bdellium, and those of the south, such as sandalwood, would naturally be collected for common exploration. Ptolemy (vii. 1, fol. 172) embraces the district on the north-west coast of India, between the present day, Bombay, Surat, Gujarat, Kutch and the Indus River Delta, under the name of Indo-Scythians; the south-easterly portion (Gujarat, with Surat and the Gulf of Cambay) he calls Syrastrene, i.e. Saurastra of the Indians; north-west of that is the Indus delta Patalene, and beyond that is Abiria (not Sibiria according to Ptolemy)Chr. Lassen, zur Gesch. der griechish. und indokythisch. Konige, Bonn 1838, p.269., the Abhira of Indian geography.Lassen, De Pentapotamia Indica, Bonn 1827, pp.26,27. And in the Periplus mar. Erythr. ed. Huds. p. 24, neither Iberia nor Siberia should be the reading, but ' Abnpla, whose level district Saurastra and whose metropolis Minnagara are mentioned by the author of the Periplus as the locality, where a great abundance of precious commodities were gathered, prior to their being sent to Barygaza, the great Indian emporium. Even up to the present day a great Ahir tribe is found in that region. The word had originally the meaning cow-herd, and agreed well with the statement made by Arrian and Ptolemy, that the ancient Indo-Scythians were herdsmen. This Abhira people, together with many other tribes of the same stock, originally settled in the northern Punjab.Chr. Lassen, Beitrage zur kunde des indischen Alierthums. aus dem Mahabharata, in Zeitschrift für die kunde des Morgenlandes, Gottimg. 1840, vol. iii.p. 197.: but wandered southward as they gradually adopted peaceful habits.The comparative geography of Palestine and the Sinaitic Peninsula, Volume 1 By Carl Ritter-page-112 :\"Beyond the gulf of Baraca is that of Barygaza and the coast of the country of Ariaca, which is the beginning of the Kingdom of Nambanus and of all India. That part of it lying inland and adjoining Scythia is calledḭ Abiria, but the coast is called Syrastrene.\" Periplus, Chap. 41 ==Related pages== * Abhira * Ptolemy * Ahir ==References== Category:History of Sindh",
 "title": "Abiria"
}