{
 "id": "110310",
 "text": "Sauroposeidon is a genus of sauropod dinosaur found in Oklahoma. It is one of the biggest dinosaur yet found. == Habit and diet == Sauroposeidon lived in what was then a river delta flowing into a bay rather the Bay of Mexico is today. It was a plant-eater that probably ate from the tops of trees, probably mainly conifers, and palms. == Estimations == Estimates of Sauroposeidon's size are based on a comparison between the four Sauroposeidon vertebrae and the vertebrae of the HM SII specimen of Giraffatitan in the Humboldt Museum in Berlin. The HM SII is the most complete brachiosaur known. Comparisons to the other relatives of Sauroposeidon are difficult due to limited remains. Wedel, Mathew J; Cifelli R.L. and Sanders R..K. 2000. Osteology, paleobiology, and relationships of the sauropod dinosaur Sauroposeidon. Acta Palaeontologica Polonica 45: 343–3888. The neck length of Sauroposeidon is estimated at , compared to a neck length of for the HM SII Giraffatitan. This is based on the assumption that the rest of the neck has the same proportions as Giraffatitan, which is a reasonably good conjecture. Sauroposeidon was probably able to raise its head above the ground, which is as high as a six-story building. In comparison, Giraffatitan could probably raise its head into the air. Sauroposeidon's shoulder height has been estimated at based on an interpretation of the animal as a brachiosaurid. Estimates of its total possible length have ranged from to .Wedel, Mathew J & Cifelli, Richard L. 2005. Sauroposeidon: Oklahoma's Native Giant. Oklahoma Geology Notes 65 (2): 40–57. Wedel, Mathew J; Cifelli R.L. and Sanders R.K. 2000. Sauroposeidon proteles, a new sauropod from the early Cretaceous of Oklahoma. Journal of Vertebrate Paleontology 20 (1): 109–114. == Timing == The fossils were found in rocks dating from near the end of the Lower Cretaceous (Aptian–early Albian), from about 113 to 110 million years ago. Sauroposeidon was the last known North American sauropod before an absence on the continent of about 40 million years. The absence of sauropods ended with the appearance of Alamosaurus during the last (Maastrichtian) stage at the end of the Cretaceous. == References == Category:Brachiosaurs",
 "title": "Sauroposeidon"
}