{
 "id": "1103232",
 "text": "Superboy is the name of several fictional characters appearing in American comic books published by DC Comics. The character was created by Jerry Siegel and Joe Shuster, first appearing in More Fun Comics #101 (1945). The character is a younger version of Superman and a member of the Superman Family. This was originally the identity that Clark Kent adopted using his powers to help others as a teenager in Smallville. He has also been a member of the Legion of Super-Heroes. == Publication history == He was created by Jerry Siegel and Joe Shuster, first appearing in More Fun Comics #101 (1945). == Fictional character biographies == === Kon-El === The second version is Kon-El, also known as Conner Kent. He is a clone of the original created by Project Cadmus using DNA contributions from Lex Luthor (New Earth) or a clone of Superman and Lois Lane's future son (Prime Earth). During Infinite Crisis he died fighting Superboy-Prime, but he was resurrected during Final Crisis. Superboy has been a member of Ravers, Young Justice, the Teen Titans and the Legion of Super- Heroes. Kon-El was created by Karl Kessel and Tom Grummett, and first appeared in Adventures of Superman #500 (1993). === Jonathan Samuel Kent === The third version is Jonathan Samuel Kent, the son of Superman and Lois Lane. He was initially a refugee from the defunct New Earth born during Convergence, but was integrated into Prime Earth's history during an altercation with Mister Mxyzptlk. Superboy has been a member of the Legion of Super-Heroes and the Super Sons. Jonathan Kent became Superboy in Superman (Volume 4) #2 (2016). == Powers and abilities == Superboy developed Kryptonian powers including heat vision, x-ray vision, and super-hearing. He also developed Kryptonian invulnerability. == In other media == Versions of the characters have appeared in television shows, animated series and films since 1960, including a syndicated TV series from 1988 to 1992. Smallville, a popular WB/CW show aired from 2001 to 2011, was based on the classic Superboy characters, superheroic adventures of a pre-Superman Clark Kent, and guest appearances by an alternative version of Kon-El. Category:DC Comics characters Category:Kryptonians Category:DC Comics superheroes Category:Fictional characters introduced in 1993",
 "title": "Superboy"
}