{
 "id": "1103164",
 "text": "Anna Jane Casey (born 15 February 1972) is an English actress and singer. She is best known for her work in musical theatre. == Early life == Anna Jane Casey was born in Salford, Greater Manchester, England on 15 February 1972, as the oldest of two daughters to Barry J Casey and Janice A Casey. Her younger sister, Natalie Casey, is also an actress. Casey learned to dance at Lupino Dance School in Bury. == Personal life == Casey married Graham Douglas S MacDuff, an actor, at St Mary's CE Church in Rawtenstall on 5 August 1998.England & Wales, Civil Registration Marriage Index, 1916-2005: AUG 1998 586 010 HYNDBURN & ROSSENDALE – Anna-Jane Casey They have two daughters. == Filmography == === Television === Year Title Role Notes Ref. 1988 How We Used to Live Beverley Brady 8 episodes 1988 The Beiderbecke Connection Emma Episode: \"Oh Look, It's Average-Sized Trevor Chaplin\" 1999 The Bill Linda Kemp Episode: \"Cover Stories\" 2002, 2008 Holby City Diane Thompson, Amy Lockey 2 episodes 2003 EastEnders Sophie 3 episodes 2003, 2018 Doctors Shirl, Trish Gallivan 2 episodes 2005 The Royal Amy Episode: \"Sins of the Father\" 2009 Heartbeat Vivienne Mackay Episode: \"A Whiter Shade of Pale\" 2010, 2012 BBC Proms Performer 2 episodes 2010 BBC Swingin' Christmas Performer Television special 2014 Family Guy British Mother Episode: \"Chap Stewie\" 2018 Coronation Street Geri Hanswick 2 episodes 2021 Silent Witness Vanessa Lloyd 2 episodes 2023 The Full Monty Cal's Mum Episode: \"It's Not the Waking, It's the Rising\" 2024 Casualty Nicky Baron Episode: \"Barriers\" === Film === Year Title Role Notes Ref. 1991 Joseph and the Amazing Technicolour Dreamcoat Swing Television film 2004 Beyond the Sea Dancer === As herself === Year Title Notes Ref. 1998 Jim Davidson's Generation Game Episode: \"Episode #4.3\" 2003 The 100 Greatest Musicals 2004, 2020 This Morning 2 episodes 2020 Sky News 1 episode 2022 Stephen Sondheim's Old Friends 1 episode == References == Category:1972 births Category:Living people Category:English actors",
 "title": "Anna-Jane Casey"
}