{
 "id": "1103765",
 "text": "Uchechukwu Alozie “Uche” Okechukwu ( ; born 27 September 1967), also known as Deniz Uygar, is a Nigerian former professional footballer who played as a central defender.Uche - en mand med mange titler bold.dk A centre-back of remarkable physical strength, he renowned as a strong player in the air with his headers and was capable of his consistent clearance of the ball, he is widely considered as one of the best Nigerian defenders of his generation. \"Uchechukwu\" is an Igbo name meaning \"God´s will\".Name meaning at Nigerian.name He was also honoured as the foreign player who played in Turkey for the longest period of time (13 years), going on to obtain Turkish citizenship under the name Deniz Uygar.Uche Okechukwu (Deniz Uygar) ve jübilesi (Uche Okechukwu (Deniz Uygar) retires) ; Unifeb Forums Uche Okechukwu (Deniz Uygur) ; Fenerbahçe Gazetesi, 8 January 2011 ==Club career== In 1987, Okechuwu began his career with the Flash Flamingoes. From 1987 to 1990 he played for Iwuanyanwu Nationale. His talent did not remain undiscovered for long: In that year, he was transferred to the Danish top team Brøndby IF together with his teammate Friday Eliaho. Right in his first season and in 1991 he helped his club to the league title. In the year 1992, he was voted the best player of the club by the fans. In 1992, his compatriot Friday left for Africa Sports from Ivory Coast. Unlike Okechukwu, he performed very poorly. In 1993, he transferred to Fenerbahçe SK. Together with the Dane Jes Høgh, a former teammate at Brøndby, he formed a very strong central duo. Okechukwu was very popular in Turkey. His sympathetic display and the extent to which he spoke the Turkish language made him the most beloved foreign player ever in the Turkish league. Together with his compatriot Jay-Jay Okocha, they acquired Turkish nationality in a short time. Okechukwu was given the name Deniz Uygar and Okocha became Muhammed Yavuz. After more than nine years, Okechukwu said goodbye to Fenerbahçe in 2002 to the applause of more than 30,000 spectators. The player won two national titles (in '96 and 2001) For the 2002–2003 season, Okechuwu moved to İstanbulspor, as he was only a supplementary player at Fenerbahce. He was active at Istanbulspor for four seasons. He was relegated to the second division with the club and narrowly missed promotion in the play-offs against Sakaryaspor in the 2005/2006 season. ==International career== In 1990, Okechukwu was called up to the squad for the 1990 African Cup of Nations in Algeria. The football federation sent a reserve squad consisting mainly of young players there. Already in the first match, the Nigerians lost to the hosts, Algeria, 1:5. However, in the following games, the team from Okechukwu did not concede a single goal in defense until the final. There, in Algiers, the Nigerians lost to the hosts for the second time, this time 0:1, but won the silver medal, and the talent of Okechukwu, among others, was discovered. In the same year, Uche scored 3 goals – in a friendly against Ivory Coast, against Zambia in the Africa Cup of Nations (semi-final won 2:0) and in a match against Togo. In 1992, Okechukwu was a member of the Nigerian squad for the 1992 Africa Cup of Nations. This time, with the \"Super Eagles\" team, he reached the semi-finals, and in the match for 3rd place, Nigeria defeated Cameroon 2:1. In 1994, he took part in another Africa Cup of Nations, this time the PNA in Tunisia. The Nigerians were second to none in this tournament and easily won the African championship, defeating Zambia 2:1 in the final. Uche was a mainstay of Nigeria's defence and played in all of their matches at the World Cup full-time. The \"Super Eagles\" had probably the best team in history, but they only reached the 1/8 finals, in which they were eliminated by Italy, losing 1:2 after extra time. In 1996, Okechukwu competed in the 1996 Summer Olympics in Atlanta. He was called up to the national team as one of the senior players and was a pillar of his team's defense. Nigeria reached the final, where they defeated Argentina 3-2, becoming the first African country to win a gold medal in football. In 1998, Okechukwu captained the Nigerian national team that took part in the World Cup in France. There he played in 3 matches of his team – against Spain (3:2), Bulgaria (1:0) and in the match of the 1/8 finals against Denmark (1:4). In the first two, he received yellow cards, which eliminated him from the match against Paraguay. After this World Cup, he said goodbye to the Nigerian national team. In total, Okechukwu played in 47 matches for Nigeria and scored 3 goals. ==Honours== Iwuanyanwu Nationale *Nigeria Premier League: 1987–88, 1988–89 Brøndby *Danish Superliga: 1990, 1991 Fenerbahçe *1.Lig: 1995–96, 2000–01 Nigeria *Africa Cup of Nations: 1994 *Summer Olympic Games: 1996 Individual *Brøndby Player of the Year: 1992 ==References== Category:1967 births Category:Living people Category:Nigerian footballers Category:Turkish footballers Category:Olympic gold medalists for Nigeria Category:Footballers at the 1996 Summer Olympics Category:1994 FIFA World Cup players Category:1995 King Fahd Cup players Category:1998 FIFA World Cup players Category:Medalists at the 1996 Summer Olympics Category:Olympic medalists in football Category:Sportspeople from Lagos",
 "title": "Uche Okechukwu"
}