{
 "id": "1104361",
 "text": "Sarah Hegazi (1 October 1989—14 June 2020) was a software developer and an Egyptian communist, feminist, queer and human rights activist. She was arrested and tortured by the Egyptian government after waving a pride flag at the concert of the Lebanese band Mashrou' Leila. She was imprisoned on charges of \"inciting debauchery\", which the Cambridge dictionary defines as inappropriate sexual behavior. == Persecution == While attending a concert in Cairo on the 22nd of October 2017 of the Lebanese band Mashrou' Leila, whose lead singer is openly gay; Hegazi, amongst others in the crowd, waved a rainbow LGBTQ+ flag. She was arrested days after the concert, and was the only woman arrested after the concert among at least 56 others. Hegazi was charged with \"promoting sexual deviancy\" and \"joining a group in violation of the law and incitement to immorality and debauchery\". She spent three months in a women's prison, including nine days in solitary confinement. Hegazi was spitefully targeted by prison officers who encouraged other prisoners to abuse her, and was violently tortured with electricity, which the officers threatened harm on her mother if she told anyone about it.https://www.madamasr.com/ar/2018/09/24/opinion/u/%D8%B9%D8%A7%D9%85-%D8%B9%D9%84%D9%89-%D9%85%D9%88%D9%82%D8%B9%D8%A9-%D8%A7%D9%84%D8%B1%D9%8A%D9%86%D8%A8%D9%88-%D9%86%D8%B8%D8%A7%D9%85-%D9%8A%D8%B9%D8%AA%D9%82%D9%84%D8%8C-%D9%88%D8%A5/ They did not even let her out after her mother's death. Hegazi was released on bail after three months spent in prison. She left with serious mental health problems. In a blog post, she wrote that she was afraid of people, even her family and friends. She wanted to leave Egypt because she was afraid of being arrested again. == Context: LGBTQ+ rights in Egypt == LGBTQ+ rights in the Middle East and North Africa (MENA) are increasingly under threat due to renewed enforcement of colonial-era laws targeting \"sexual deviance\" and \"debauchery.\" The view exists that LGBTQ+ identity and arab cultural identity are permanently and inherently opposed. Egypt keeps emphasizing that only two genders exist. Homosexuality is not explicitly against the law in Egypt. The 1961 Law on Combating Prostitution was made in a newly independent Egypt as a reaction to the British colonial rule which had brought about brothels and prostitution. This law is used to persecute members of the LGBTQIA+ community, as it punishes \"the practice of debauchery\" without clearly defining the concept. By doing this, the term can be interpreted to justify arrest and persecutions, even though it does not explicitly mention homosexuality, like it happened at the concert of the Lebanese band Mashrou' Leila. Most of the contemporary Egyptian society believes homosexuality to go against famiy, procreation and Islam, which are the foundations of Arab society. The Grand Imam of Al-Azhar (the most important Sunni institution) Sheikh Ahmed Al-Tayeb states that homosexuality is a product of Western ideas and it cannot be introduced in the Middle East, as it goes against the basic teachings of religion. Suppression of LGBTQ+ rights and communities as well as targeted actions against these individuals are partly linked to regional, financial and political crisis, which have turned sexual politics into a tool for political control. ==== The Queen Boat Trial ==== In May 2001, Egyptian authorities broke into the gay nightclub \"Queen Boat \" in Cairo and arrested 52 people. According to the lawyers, some men that were not even present that night go arrested as well. 23 men had been judged guilty of debauchery and religious desecration. The media exaggerated the case, falsely claiming that the men were part of a \"devil-worshipping\" cult involved in perverse acts, including same-sex marriage ceremonies. This case served the regime's needs of shifting public's attention from the economic crisis that was going on in the country. After this event, police forces, National Security Agency officers and the Cairo Vice Squad arrested many people that were part of the LGBTQIA+ community, picking them off the streets or through dating applications, by tricking them into sending photos and messages in order to obtain proof. They detained people in brutal conditions and tortured them. Under police custody, they were beaten up, sexually assaulted and forced to undertake anal exams and virginity tests in order to extract forced confessions. A man said that they would not even let him go to the bathroom. The trial marked a turning point in Egypt, pushing homosexuality into the spotlight as a high-profile, stigmatized issue linked to religious and national security. It established a precedent for future targeted actions against these communities and motivated police to pursue similar cases. ==== LGBTQ+ people's status under al-Sisi ==== After al- Sisi came to power, the situation got even worse. Arrested people were denied access to attorneys and were forced to sign confession statements. In 2016, the UNHRC had proposed a pro-homosexuality resolution that was rejected by the Egyptian delegate to the United Nations Amr Ramadan, who labeled it as worthless and called LGBT relationships Western \"perverted practices\". In 2022, the Supreme Council for Media Regulation issued a series of regulations with the aim of not showing LGBTQ+ relationships on Disney+ and Netflix. The Egyptian Ministry of Education decided to include in the education curriculum sexual education, to prevent homosexuality. Moreover, finding housing in Cairo for people of the community is also extremely hard as they are refused houses and apartments. After the Mashrou' Leila's concert, people who participated, like Sarah Hegazi, got identified and arrested.As a reaction to the arrests at the concert, Egyptian MPs suggested a law that punished expressions of homosexuality with up to three years in prison, and a second offence would receive five years. Over 300 people were arrested in the days after the Mashrou' Leila concert. == Asylum in Canada == Hegazi was given asylum in Canada in 2018. Whilst living there, she was still seriously suffering with her mental health, struggling with her post-traumatic stress disorder after the treatment in prison in Egypt. She became socially isolated because of her fear of speaking to people that she developed. After the death of her mother just before she left Egypt, she became the carer for her younger siblings. In Canada, Hegazi joined the socialist group Spring. She spoke at many public meetings and contributed a lot to the group through her experiences and opinions. She found it very important to speak up about politics, so keeping up with a political group was very important to her. On March 6,2020, she wrote that in Egypt whoever \"is not male, Muslim, Sunni, straight, and supporter of the system\", is going to be persecuted, arrested, and maybe even killed. She said that \"[she] never felt so alive as during the revolution\". While in Canada, she enjoyed going to art galleries, symphony concerts, walks in the park, and watching the zoo animals. == Death == On the 14th of June 2020, at the age of 30, Sarah Hegazi took her own life whilst living in exile in Canada. Her death was reported internationally, with a big emphasis on her activism. A note that she wrote in Arabic before she died circulated on social media. It read: The socialist group she joined in Canada posted an obituary for her, who praised her highly for her political activism. The lead singer of Mashrou' Leila, Hamed Sinno, posted a tribute on Instagram, singing the words from the letter she left. He also posted a statement on Facebook about mental illness as a response, saying that it is the \"result of structural violence\". == Legacy == Hegazi made many important comments on the state of LGBTQ+ rights in Egypt and her death serves as a reminder of the injustices facing LGBTQ+ Egyptians. Her death provoked discussion of LGBTQ+ rights across the Islamic world. Many murals of Hegazi were painted in various LGBTQ+ spaces. These included a mural in the Toronto gay village, where she lived in Canada; and in Brighton, England. Murals painted in various places around Amman, Jordan were covered up or removed by the municipality, following comments on social media. The Arabic Wikipedia page for Sarah Hegazi was deleted, and combined into the page on 'homosexuality'. A community member justified this by saying that there was a lack of notability for her page. Activists spoke up against this and it provoked questions about the bias of Wikipedia. As of May 2024, there are pages on Wikipedia about Hegazi in 31 languages. == References == Category:LGBT rights activists Category:Egyptian people",
 "title": "Sarah Hegazi"
}