{
 "id": "1104643",
 "text": "Serbia was one of the parts that made SFR Yugoslavia. On 12 November 1989, there were elections, to choose the president of the presidency of the Socialist Republic of Serbia and delegates of the Assembly of SR Serbia. These events are known as the 1989 Serbian general election today. Voting for delegates also took place on 10 and 30 November 1989. Together with the general elections, local elections were also done. The Yugoslav constitution was adopted in 1974. These elections were the first elections since 1974. They were also the last ones done using the delegate system, and the last one under a one-party system. Before the elections, Slobodan Milošević rose to power. He had been elected president of the presidency of the Central Committee of the League of Communists of Serbia (SKS) in 1986. Milošević started the anti- bureaucratic revolution and began amending the constitution of Serbia in 1988. After Milošević was appointed to the position of the president of the presidency of SR Serbia in May 1989, presidential and parliamentary elections were announced for November 1989. Milošević, Mihalj Kertes, Zoran Pjanić, and Miroslav Đorđević were the candidates in the election. Milošević ended up winning the election in a landslide. SKS won 303 seats, a net loss of 20 seats in comparison with the 1986 election. 37 people who were not members of SKS won the rest of the seats in the Assembly. The League of Communists of Yugoslavia ceased to exist in January 1990. After a referendum in July 1990, Serbia adopted a new constitution that implemented a multi-party system and reduced powers of its autonomous provinces, Kosovo and Vojvodina. The first multi-party elections were then held in December 1990. Slobodan Milošević won the election, with over 80 percent of the votes. Category:20th century in Serbia Category:1989 in Europe Category:Elections in Europe Category:General elections Category:Politics of Serbia Category:November events Category:1989 events",
 "title": "1989 Serbian general election"
}