{
 "id": "1104229",
 "text": "The Treaty of Sèvres () was a 1920 treaty signed by the Allies of World War I and by the Ottoman Empire. The treaty gave parts of Ottoman territory to France, the United Kingdom, Greece and Italy. It was just one of the treaties that the Central Powers signed with the Allied Powers after their defeat in World War I. The Ottomans had already stopped fighting the Allies after the Armistice of Mudros. ==Parties== The Treaty of Sèvres was signed by the Ottoman Empire and by the victorious Allies of World War I. The victorious powers were divided into the Allied Powers and the Principal Allied Powers. The difference was important, as the Allied Powers were the more powerful parties; they were the United Kingdom, France, Italy and Japan. The Principal Allied Powers were Armenia, Belgium, Greece, Hejaz, Poland, Portugal, Romania, the Serb-Croat-Slovene State and Czecho-Slovakia. Thhoe countries were less powerful and had less to say in the making of the treaty. ==Contents== The Treaty of Sèvres had a series of different sanctions imposed on the Ottoman Empire after its loss in World War I anging from territorial losses in Arabia, Armenia, Kurdistan and Thrace to diplomatic and economic articles. Also included were provisions that would limit the new state to rearm itself, including limits on the army, air force and navy. Other military provisions forbade the Ottomans to place troops, navy ships or air forces in certain areas, which were were often decided to be international zones since they were important to international trade. The Ottoman Air Force was under supervision of the Allied Powers, which had to approve any import for parts for aircraft. Besides territorial changes, the Ottoman Empire also faced financial restrictions because it was held accountable for World War I. The restrictions were made by a newly-appointed Financial Commission, which included British, French and Italian representatives, who would help by conserving and increasing the resources of the new state, Turkey. That included dealing with the debts of the Ottoman Empire and its Council of the Ottoman Public Debt. The Imperial Ottoman Bank got also under control of the Financial Commission, and the Turkish Parliament and Minister of Finance also had to let their budget approved by the Commission. That shows that the British, French and Italian had a lot of influence in the Turkish economy and its financial activities. However, shortly after the signing of the treaty, tensions and differences of opinions arose between Britain and France. The French started doubting if the treaty was in their own interest, and the British wanted to ratify the treaty quickly. The tensions meant that the treaty would not be ratified, which led to three years of war in Anatolia. ==Prelude== After World War I, a series of treaties between the Central Powers and Allies were signed. The Ottoman Empire belonged to the losing Central Powers, which it had joined in 1915. The Central Powers signed their own peace treaty, the Ottomans' being the Treaty Of Sèvres. The treaty was the culmination of months of peace talks after the war. The main Entente powers to sign the treaty were the United Kingdom, France, Italy and Greece. The United Kingdom and France had carved up parts of the Middle East between the two of them by signing the Sykes-Picot Agreement. The peace talks themselves lasted from the signing of the Armistice of 11 November 1918 to the signing of the Treaty of Sèvres in 1920. ==Consequences== The former Ottoman territories were divided after the World War I into mandated areas, governed by the French, British, Italian and Greeks. The French got mandates over Syria, Lebanon and parts of southern Anatolia, the British got mandates over Palestine and Iraq, the Italian got the Dodecanese Islands and portions of southern and west-central Anatolia, and Greece got the city of Smyrna and its surrounding areas. The Kurds also got autonomous areas within Anatolia, and the Armenians got independence. Therefore the Turks now had only parts of Anatolia, which led to anger among the Turkish population. The anger resulted in a nationalist movement, which had not been foreseen by the Allies. It was the formation of the resistance, and attacks on the Allies were carried out. The British then attacked the Ottoman Parliament, which led to Mustafa Kemal convening the Grand National Assembly in Ankara. That became an alternative parliament to the parliament in Istanbul and opposed the Treaty of Sèvres by refusing to acknowledge the sultan's authority and by declaring all provinces in Anatolia and around Istanbul to be Turkish. That led to the rise of Kemalism in the former Ottoman Empire and the start of the Turkish War of Independence. The Allies acknowledged that there was a need for new peace terms, which would lead to the signing of the Treaty of Lausanne in 1923. ==References== Category:1920s treaties Category:History of colonialism Category:History of the Middle East Category:Ottoman Empire",
 "title": "Treaty of Sèvres"
}