{
 "id": "1104189",
 "text": "The mountain zebra (Equus zebra) is a type of zebra that lives in southwestern Africa. It belongs to the Equidae family. There are two kinds: the Cape mountain zebra (E. z. zebra), which lives in South Africa, and Hartmann's mountain zebra (E. z. hartmannae), found in southwestern Angola and Namibia. == Classification == Images Types Habitat Cape mountain zebra (E. z. zebra) Western and Eastern Cape provinces of South Africa. Hartmann's mountain zebra (E. z. hartmannae) south-western Angola and western Namibia. In 2004, scientists C. P. Groves and C. H. Bell studied the types of zebras (in the group Equus, sub-group Hippotigris). They found that the Cape mountain zebra (Equus zebra zebra) and Hartmann's mountain zebra (Equus zebra hartmannae) are different. They suggested that it might be better to consider them as separate species named Equus zebra and Equus hartmannae. But in a study about genes and mating that looked at 295 mountain zebra animals, Moodley and Harley in 2005 didn't find any proof to say that the Cape mountain zebra and Hartmann's mountain zebra should be different species. They said that these two kinds of zebras should still be considered as subspecies.Moodley, Y. & Harley, E. H. 2005 Population structuring in mountain zebras (Equus zebra): the molecular consequences of divergent demographic histories. Conservation Genetics 6: 953–968. The third edition of Mammal Species of the World (2005) also says that the mountain zebra is just one species (Equus zebra) with two kinds under it.Wilson, Don E. & Reeder, DeeAnn M. (2005) Mammal Species of the World. Johns Hopkins University Press; 3rd ed. == Appearance == Mountain zebras have a dewlap, which is more noticeable in E. z. zebra than in E. z. hartmannae. They have bold black or dark brown stripes all over their body, and each zebra looks different from the others. The stripes cover the whole body except for the belly. The Cape mountain zebra looks mostly white, while Hartmann's zebra is a bit buff in color. Adult mountain zebras are about 2.1 to 2.6 meters (6 feet 11 inches to 8 feet 6 inches) long from head to body, with a tail that's 40 to 55 centimeters (16 to 22 inches) long. They stand between 1.16 to 1.5 meters (3 feet 10 inches to 4 feet 11 inches) tall at the shoulders. Their weight ranges from 204 to 372 kilograms (450 to 820 pounds).Shefferly, Nancy. Equus zebra mountain zebra. Animal Diversity Web == Habitat == Mountain zebras live on mountainsides, open grasslands, woodlands, and places with enough plants. They like mountain areas the most, especially places with many different kinds of grass. == References == Category:IUCN Red List vulnerable species Category:Zebras",
 "title": "Mountain zebra"
}