{
 "id": "1104253",
 "text": "The Israel–Hamas war protest voting movements is a protest voting movement in the 2024 Democratic Party presidential primaries. It's main target is to target President Joe Biden on his policies. His opposition to Palestine, pro- Israel allegadly, and mostly about the 2023-2024 Israel-Hamas war, a voting option, Uncommitted, is considered a protest vote in the primaries. The way to protest vote is in primaries or caucuses in different states in the United States. Other names for the protest vote includes Abandon Biden and uncommitted movements. The protest vote began in Michigan and is still continuing in the primaries. == Background == US President Joe Biden has provided aid to Israel since the war broke out. Many people have expressed dissatisfaction about this, saying that US President Joe Biden is \"supporting genocide\", and denouncing pro-democracy crimes, his pro-Israel and his opposite side of Palestine. These people took advantage of the Democratic Party's primaries to oppose the Biden administration. == Primaries == === New Hampshire === A small number of voters in New Hampshire support a ceasefire in the Gaza Strip launched a write-in campaign for \"ceasefire\" in the New Hampshire primary. Even though Biden refused to appear on the ballot. === Michigan === This is the first time the protest vote has been most clear, when Muslim voters here protested the Biden administration over what they are doing in the Gaza Strip and towards Palestinian civilians. The majority of people here support former president Donald Trump. === Super Tuesday === In Minnesota there was a protest vote for Uncommitted, winning 18% of the vote and 11 delegates, in North Carolina 12% voted for \"no preference\" as an alternative to Uncommitted. === Post-Super Tuesday === In Hawaii, Uncommitted received 455 votes, or nearly 29% of the vote total, which net the movement 6 delegates. In Washington, Uncommitted received almost 10% of the popular votes, compared to almost 84% of Biden. == Impact == === Withdrawal of Joe Biden === On July 21, 2024, President Joe Biden tweeted on X that he would withdraw from the presidential election, and hand over the reins to Vice President Kamala Harris, marking the first sitting president to withdraw since Lyndon B. Johnson did so in 1968. Some uncommitted voters, who were disappointed with Biden, were noted to be \"watching Harris closely to see how she differs from Biden on this issue.\" == References == Category:Controversies in the United States Category:Events in the United States",
 "title": "Israel–Hamas war protest vote movements"
}