{
 "id": "1104452",
 "text": "Kristopher Marshall (born 1 April 1973) is an English actor. He has played Nick Harper in My Family. He played DI Humphrey Goodman in Death in Paradise from 2014 to 2017 and reprised the role in Beyond Paradise in 2023. ==Filmography== ===Film, television, and radio=== Year Title Role Notes 1993 Closing Numbers Fredericks 1998 Trial & Retribution II PC Henshaw 1999 The Most Fertile Man in Ireland Éamonn 1999 Five Seconds to Spare Martin 1999 The Bill Hugh Kane 1 episode 2000 Dead Babies Skip 2000–2005 My Family Nick Harper 45 episodes 2001 Je t'aime John Wayne Belmondo 2002 Iris Doctor Gudgeon 2002 Mexicano Jake Morton 2002 Doctor Zhivago Pasha Antipov 2002 The Four Feathers Castleton 2002 Deathwatch Private Barry Starinski 2003 Love Actually Colin Frissell 2004 The Merchant of Venice Gratiano 2004 My Life in Film Art 6 episodes 2004–2006 Murder City DS Luke Stone 10 episodes 2005 Funland Dudley Sutton 11 episodes 2007 Death at a Funeral Troy 2007 Catwalk Dogs Michael Purvis 2007 Sold Matt 2008 Heist Dick Puddlecote 2008 Easy Virtue Furber 2008 Spending My Inheritance Harry Radio drama 2010 Human Target Doug 1 episode 2010 D.O.A. Tom Lassiter 2011 Traffic Light Ethan 2011 Oka! Amerikee Larry 2011 A Few Best Men Tom 2011–2013 The Diary of Samuel Pepys Samuel Pepys Radio drama 2012 15 Kids and Counting n/a Narrator 2012 Citizen Khan Dave 6 episodes 2013 16 Kids and Counting n/a Narrator 2013 Derek Himself Cameo 2013 Lightfields Paul 2014–2017 Death in Paradise DI Humphrey Goodman 30 episodes 2015 Sparks & Embers Tom Sanger 2016 Ambulance Narrator 1 Series, 3 episodes 2017 A Few Less Men Tom 2017 Borderline Baron of Sandwich 2018 Royal Affairs Ambassador Short film 2019 Better Things Tibor 2 episodes 2019–2023 Sanditon Tom Parker 20 episodes 2019 Trick or Treat n/a 2020 We Hunt Together Cian Fitzgerald 1 episode 2021 Father Christmas Is Back Peter Hope 2021 Promises Louis 2023–present Beyond Paradise DI Humphrey Goodman 6 episodes ===Theatre=== Year Title Role 2006 The Hypochondriac Cleante 2006 The Revenger's Tragedy Vindici 2007 Treats Dave 2008 Fat Pig Carter 2017 Ugly Lies the Bone Kelvin 2017 Glengarry Glen Ross John Williamson 2023 Charlotte and Theodore Theodore ===Music video=== * Chicane - \"No More I Sleep\" ==References== ==Other websites== * * BBC Comedy profile Category:1973 births Category:Living people Category:British actors",
 "title": "Kris Marshall"
}