{
 "id": "1104207",
 "text": "Driver 3 (also stylized as DRIV3R) is an action-adventure video game. It was published by GT Interactive and was developed by Reflections Interactive. It is the third game in the Driver video game series. It was released on June 21, 2004 in North America for the PlayStation 2, Xbox, and Mobile. It would later be released on March 15, 2005 for Windows and on October 14, 2005 for the Game Boy Advance. In the game, the player controls undercover NYPD detective John Tanner and works to arrest a criminal boss who is running a underground car smuggling operation. The player investigates in three cities: Miami, Nice, and Istanbul. It is the sequel to the 2000 video game Driver 2. The next game titled Driver: Parallel Lines was released on March 14, 2006. ==Reception== The game recieved mixed reviews by game critics. Critics said that they liked the music, that the cutscenes looked good, and the celebrity starpower of Ving Rhames, Mickey Rourke, Michelle Rodriguez, Iggy Pop and Michael Madsen. However, critics didn't like the sound, uninterested voice acting, on-foot combat, or the many glitches and graphics issues in the game. There was controversy that happened called DRIV3Rgate. It was alleged that an early access version of the game was given to both PSM2 and Xbox World by Atari and both gaming magazine rated the game a 9/10. After the reviews were made public, the GamesRadar forums were filled with people posting about the reviews. The posts would then be deleted by moderators. It was revealed that positive comments towards the game were traced to a known astroturfing website called Babel Media. ==References== Category:2004 video games Category:Driver (video game) Category:Atari video games Category:Action-adventure games Category:Detective video games Category:Game Boy Advance games Category:Open- world video games Category:Organized crime video games Category:PlayStation 2 games Category:Single-player video games Category:Video game sequels Category:Video games about police officers Category:Video games set in France Category:Windows games Category:Xbox games",
 "title": "Driver 3"
}