{
 "id": "1104158",
 "text": "The flag of Baja California is the flag used by the Mexican state of Baja California. The State flag consists of a white rectangle with a ratio of four to seven between the width and length; in the center it bears the State Coat of arms, placed in such a way that it occupies three-quarters of the width. Down there is the pharse Baja California. ==Design and symbolism== The meaning of the colors of the state flag are as follows: * White : peace. * Orange : sunset. * Red : hot land. ==History== ===19st century=== The first appearance of a flag was when William Walker carried out his first action in the city of La Paz in Baja California Peninsula, where he raised a flag that represented the Territory of Lawer California. There he proclaimed, on November 3, 1853, that the Lawer California Republic was free, sovereign and independent. The first flag was represented by a blue star in a white central canton that symbolizes the state of the new republic with two red strips divided by an orange parallel. William Walker proclaimed himself president of the Republic of Sonora on January 18, 1854, and the new republic was divided into two states, Baja California and Sonora, the latter governed by the Civil Code in force in Louisiana. The second flag consists of 3 horizontal stripes, red, white and red respectively, in the central part of the white stripe is two stars represented by Baja California and Sonora states. ===20st century=== The state flag of Baja California is a white camp with the coat of arms in the center and was adopted in 1998. This is the flag that has always been used by the state government. ===21st century=== It was a failed attempt on October 14, 2013, within a rock concert in the city of Tijuana where it was intended to dismember the state from Mexico, once again creating a republic during the government of Enrique Peña Nieto. The movement was called the Republic of Baja California, where they presented a third flag similar to that of Mexico flag and the colors from Lawer California flag, but with four stripes, two red and two orange, in the center a larger white stripe with a coat of arms. ===Historical flags=== File:Mexico stateflags Baja California.png| Flag of Baja California (1998) File:Bandera Movimiento RBC.jpg| Flag of the Republic of Baja California (2013) ==Related pages== * List of Mexican flags * Baja California == References == Baja California Category:Baja California (state) Baja California",
 "title": "Flag of Baja California"
}