{
 "id": "110413",
 "text": "Indiana Jones and the Last Crusade is a 1989 adventure movie directed by Steven Spielberg from a story co-written by executive producer George Lucas and starring Harrison Ford in the title role. It co-stars Sean Connery, Denholm Elliott, Julian Glover, Alison Doody, River Phoenix and John Rhys- Davies. ==Cast== * Harrison Ford as Indiana Jones ** River Phoenix as a younger Indiana Jones * Sean Connery as Henry Jones, Sr. ** Alex Hyde-White as a younger Henry Jones, Sr. * Denholm Elliott as Marcus Brody * Alison Doody as Elsa Schneider * John Rhys-Davies as Sallah * Julian Glover as Walter Donovan * Michael Byrne as Ernst Vogel == Plot == The movie begins with a young Indiana Jones in 1912. He finds a rare artifact that he thinks belongs to a museum, but some men take it from him. In 1938, Jones is on a boat and yells, \"This piece belongs into a museum!\" the same thing he said before. This time he manages to get the piece and run away before the other men can take it back. At Marshall College, where he works, someone tells him that the Nazis are after the Holy Grail. He and Elsa go into the library, where they find a secret passage underground. They find a tablet, which is an important part of the puzzle. While they are there, some men who want to protect the Grail set the water on fire to try to kill them. == Related pages == *Indiana Jones and the Temple of Doom *Indiana Jones and the Kingdom of the Crystal Skull ==Other websites== * * Category:1989 action movies Category:1989 adventure movies Category:Indiana Jones movies Category:Movies set in the 1910s Category:Movies set in the 1930s Category:Movies set in Austria Category:Movies set in Berlin Category:Movies set in Venice Category:Movies set in Turkey Category:1980s American action movies Category:Movies set in deserts Category:Movies about treasure hunting Category:Movies composed by John Williams Category:Disney movies Category:Paramount Pictures movies Category:Universal Pictures movies Category:Movies directed by Steven Spielberg Category:1980s English-language movies Category:American sequel movies Category:1980s sequel movies",
 "title": "Indiana Jones and the Last Crusade"
}