{
 "id": "1104673",
 "text": "The 2024 Campo Grande municipal elections will take place in Campo Grande, the capital city of the state of Mato Grosso do Sul in Brazil. Scheduled for October 6, 2024, with a second round set for October 27, 2024, if necessary, these elections will select the Mayor and the City Council members. The current mayor is Adriane Lopes, who took office after Marquinhos Trad resigned on April 2, 2022. ==Background == Campo Grande, known for its diverse culture and significant economic role in the region, has a history of competitive elections. The municipal elections are part of a broader electoral process that occurs every four years, where voters across Brazil elect local officials in over 5,500 municipalities. == Electoral system == The elections will be conducted using a two-round system, which is applied in cities with more than 200,000 voters. If no mayoral candidate achieves more than 50% of the votes in the first round, a runoff is held between the two candidates with the highest number of votes. == Candidates == The mayoral race in Campo Grande has attracted several candidates from various political backgrounds. Notable candidates include: *Rose Modesto (União Brasil): A former federal deputy leading in the polls with significant support. *Adriane Lopes (PP): The incumbent mayor seeking re-election, with a strong base in the city's administration. *André Puccinelli (MDB): A former governor expressing interest in returning to local politics. *Beto Pereira (PSDB-MS): A federal deputy backed by the state governor for the mayoral race. *Camila Jara (PT-MS): A federal deputy representing the Workers' Party in the election. == Campaign == The campaign period officially begins on August 16, with candidates allowed to advertise their platforms, including on the internet. Free airtime on radio and television will start on August 30, providing candidates with a platform to reach a wider audience. == References == Category:21st century Category:Brazil",
 "title": "Campo Grande municipal elections in 2024"
}