{
 "id": "1104474",
 "text": "Dr. Robert Bruce Banner, more commonly known as Bruce Banner, or his alter ego, the Hulk, is a fictional character in the Marvel Cinematic Universe (MCU). Based on the Marvel Comics character of the same name, he made his first appearance in The Incredible Hulk (2008), where he was played by Edward Norton. After that, he was played by Mark Ruffalo, appearing in the movies The Avengers (2012), Iron Man 3 (2013), Avengers: Age of Ultron (2015), Thor: Ragnarok (2017), Avengers: Infinity War (2018), Avengers: Endgame (2019) and Shang-Chi and the Legend of the Ten Rings (2021), and the TV series What If...? (2021–2024) and She-Hulk: Attorney at Law (2022). Banner is a smart physicist that becomes a green monster with superhuman abilities after a failed experiment. He joins the Avengers in the Battle of New York, and three years later goes on the planet Sakaar, where he stays for two years. After reuniting with Thor, he goes back to Earth to rejoin the Avengers and try to stop Thanos. Even though the team loses to Thanos, five years later they go back in time, bringing back the ones that Thanos killed and beating him. Banner later trains his cousin, Jennifer Walters, who has similar abilities to him. He goes back to Sakaar and brings his son, Skaar, with him on Earth. == Appearances == === Movie appearances === Year Movie Portrayed by 2008 The Incredible Hulk Edward Norton 2012 The Avengers Mark Ruffalo 2013 Iron Man 3 2015 Avengers: Age of Ultron 2017 Thor: Ragnarok 2018 Avengers: Infinity War 2019 Avengers: Endgame 2021 Shang-Chi and the Legend of the Ten Rings === Television appearances === Year Television series Season(s) Episode(s) Portrayed by 2021-2024 What If...? 3 26 Mark Ruffalo 2022 She-Hulk: Attorney at Law 1 1-2-9 == References == == Other websites == * Bruce Banner on Marvel.com Category:Marvel Cinematic Universe characters Category:Hulk (Marvel Comics) Category:Fictional characters introduced in 2008 Category:Marvel Comics movie characters",
 "title": "Bruce Banner (Marvel Cinematic Universe)"
}