{
 "id": "1105308",
 "text": "Alvin Karpis (born Albin Francis Karpavičius; August 10, 1907 – August 26, 1979) was a Canadian-American criminal. He was nicknamed \"Creepy\" because of his smile. In the 1930s he led the Barker-Karpis criminal gang (also called the Barker Boys). The gang committed crimes all over the Midwestern United States. They were \"among the FBI’s most hunted gangsters\" during the Depression era. Barker was one of only four people that the FBI ever identified as \"Public Enemy Number One\". == Early life == Karpis's parents were John (Jonas) and Anna (Ona) Karpavičius. They had immigrated to Canada from Lithuania, and Karpis was born in Montreal, Quebec. However, he was raised in Topeka, Kansas. Karpis committed his first crimes around age 10. At that point, he started spending time with gamblers, bootleggers, and pimps. He became a petty thief at 16 and was a career criminal for the rest of his life. == Criminal career == During his criminal career, Karpis committed at least fifteen bank robberies, fourteen murders, three escapes from jail, and two kidnappings. Around 1931 he partnered with Ma Barker and her sons to form the Barker-Karpis Gang. He has been called \"the brains of the gang.\" Between 1931-1935 the gang robbed banks and trains, murdered people, and kidnapped two rich business leaders. They committed crimes throughout the Midwest, in states including Illinois, Kansas, Minnesota, Nebraska, Ohio, and Wisconsin. Lasting for four years, the Barker-Karpis Gang was one of the Depression era's longest-running gangs. The FBI pursued them aggressively across multiple states, and 25 of the gang's members were eventually imprisoned or killed. === Meeting Fred Barker === Karpis met Fred Barker in Kansas State Prison. Shortly after they were both released in 1931, they were arrested together by police who suspected burglary. Karpis was sentenced to four years in prison, but was set free after he made restitution. At the end of 1931, Karpis and Barker robbed a Missouri store and killed a local sheriff. === Bank and train robberies === Karpis and other Barker-Karpis gang members robbed banks in many places. They got away with enormous amounts of cash, but killed a number of people in the process. In July 1932 they robbed a bank in Concordia, Kansas and stole around $250,000 in cash and bonds (equal to $5.7 million in 2024 dollars). Less than a month later they robbed another bank in Beloit, Wisconsin and left with $50,000 (worth around $1.1 million in 2024 dollars). In December 1932 Karpis and his gang killed two police officers and one civilian while robbing a bank in Minneapolis, Minnesota. Five months later, the gang robbed another bank in Fairbury, Nebraska, where a gang member named Earl Christman was wounded and later died. Three other people were also hurt in the Fairbury robbery. In August 1933 Karper and his gang killed one policeman and disabled another during a bank robbery in South St. Paul, Minnesota. The next month, gang members killed another policeman while robbing two bank messengers in Chicago, Illinois. On November 7, 1935 Karpis and five others also robbed an Erie Railroad mail train in Garrettsville, Ohio. === Murders === In April 1932, Karpis and Fred Barker killed Ma Barker's lover, A.W. Dunlap. Dunlap's body was found at Lake Franstead, Minnesota. In September 1935, Karpis may have killed underworld doctor Joseph Moran. He had previously had Moran remove his fingerprints, so he would leave no fingerprint evidence when he committed crimes. Moran's body was found in Lake Erie. Karpis has been accused of at least 12 other murders. === Kidnappings === Karpis and his gang kidnapped two wealthy businessmen and held them for ransom. They received $300,000 in total from the two kidnappings - an enormous sum equal to over $7 million in 2024 dollars. In 1933 the gang kidnapped William A. Hamm, Jr., President of the Theodore Hamm Brewing Company in St. Paul, Minnesota. They released Hamm after receiving a ransom of over $100,000 (nearly $2.5 million in 2024 dollars). On January 17, 1934 the gang kidnapped a wealthy banker named Edward George Bremer, Jr., also in St. Paul. They released Bremer three weeks later after his family paid a ransom of $200,000 (around $4.7 million in 2024 dollars). Using new technology, the FBI lifted Karpis's fingerprints (and those of other gang members) off of ransom notes from the Hamm kidnapping. After Bremer's kidnapping, they found another fingerprint; soon they linked Karpis and other members to the kidnapping. Most of the gang's members were captured or killed after the Bremer kidnapping. In total, 18 Barker-Karpis were arrested; 3 were killed by police; 3 were killed by other gangsters; and 1 (Earl Christman) died of wounds he received during a bank robbery. == Capture and prison == In 1933 he had Dr. Joseph Moran remove his fingerprints so he could not leave them at crime scenes. Moran's work was so effective that Karpis later had difficulty getting a passport. The FBI pursued Karpis and the gang's other members aggressively, through multiple states. On Barker was captured on May 1, 1936 in New Orleans by FBI agents (with J. Edgar Hoover personally in attendance). That same year, Karpis was sent to Alcatraz Federal Penitentiary. He stayed there for 26 years - longer than anyone else in the prison's history. == Release and death == Karpis was paroled and released from prison in 1969. He was required to move back to Canada, where he had been born. On August 26, 1979 he died in Spain at age 72 from an accidental overdose of alcohol and sleeping pills. File:Herman Barker.jpg|Herman Barker File:Arthur Barker.jpg|Arthur Barker File:Fred- barker1.jpg|Fred Barker File:Alvin Karpis.jpg|Alvin Karpis mugshot 1 May 1936 File:Alvin_Karpis_Alcatraz_1958.jpg|Alvin Karpis mugshot 1958 == References == Category:American gangsters",
 "title": "Alvin Karpis"
}