{
 "id": "1105402",
 "text": "The Kingdom of Mewar was a Hindu Rajput Kingdom based in regions of Rajasthan, Gujarat, Madhya Pradesh and Sindh that ruled over 1383 years (566 CE-1949) untill accession to India. Mewar had been ruled by two Dynasties: Guhilas(566-1302) and Sisodiyas(1320-1949). == Battles involving Guhila Dynasty == Name of Conflict (time) Rawal of Mewar/Commander/Allies Opposition Outcome Umayyad campaigns in India Bappa Rawal • Other Indian kingdoms Umayyad Caliphate Victory for Indian Kingdoms Conflict with Rulers of Malwa Khuman I Parmaras of Malwa Indecesive Invasion of Rastrakuta king Govind III Khuman I Rashtrakutas Rashtrakuta Victory Arab Invasion (828-853) Khuman II Abbasid Caliphate Mewar Victory Allata’s struggle with Pratihar king Devapal Allata Pratiharas Mewar Victory Samantsingh’s battle with the Chalukyas Samantsimha Chaulukyas Mewar Victory Battle of Bhutala Jaitrasimha Delhi Sultanate Mewar Victory Battle of Arthuna Jaitrasimha Parmara dynasty Mewar Victory Battle of Naddula Jaitrasimha Ghurid dynasty Mewar Victory Invasion of Mewar (1253–54) Tejasimha Delhi Sultanate (Malmuk dynasty) Mewar Victory Second Invasion of Mewar (1255) Tejasimha Delhi Sultanate (Malmuk dynasty) Mewar Victory Invasion of Gujarat (sometime before 1285) Samarasimha * Sarangdeva Delhi Sultanate (Malmuk dynasty) Mewar Victory Raid on Mewar (1299) Samarasimha * Bhuvanasimha Delhi Sultanate (Khajli dynasty) Inconclusive Siege of Chittorgarh (1303) Ratnasimha * Rana Lakhan † * Ari Singh † Delhi Sultanate (Khalji dynasty) Khalji Victory == Battles during Sisodia dynasty == Name of Conflict (time) Maharana of Mewar/Commander/Allies Opposition Outcome Conquest of Chittorgarh (1321) Maharana Hammir * Baruji Sauda Delhi sultanate (Tughluq dynasty) Mewar Victory Battle of Singoli (1336) Maharana Hammir * Junsi Kachhwaha Delhi Sultanate (Tughluq dynasty) Mewar Victory Battle of Bakrol Maharana Kshetra Delhi Sultanate (Tughlaq dynasty) * Malwa sultanate Mewar Victory Battle of Badnor Maharana Lakha Delhi sultanate (Tughlaq dynasty) Mewar Victory Annexation of Godwar Maharana Lakha Hadas Mewar Victory Mokal's conflict with Nagaur sultanate Maharana Mokal Nagaur Sultanate Mewar Victory * Sambhar,Didawana, Narena annexed by Mewar Battle of Raipur Maharana Mokal Delhi Sultanate(Sayyid dynasty) Mewar Victory 1st Invasion by sultan of Gujarat (1427) Maharana Mokal Gujarat Sultanate Mewar Victory 2nd Invasion by the Sultan of Gujarat (1432) Maharana Mokal Gujarat Sultanate Gujarat Sultanate Victory Battle of Jahazpur (1436) Maharana Kumbha Hadas of Bundi Mewar Victory Conquest of Eastern Sirohi (1437) Maharana Kumbha Sirohi State Mewar Victory Battle of Sarangpur(1437) Maharana Kumbha Malwa sultanate Mewar Victory * Sarangpur, Hadoti and Gagron Captured.Sultan Mahmud taken Prisnoer for six months. Battle of Ajmer (1437) Maharana Kumbha Nagaur Sultanate Mewar Victory Battle of Mandalgarh(1443) Maharana Kumbha Malwa Sultanate Inconclusive Seige of Gagron(1444) Palan Singh and Dahir Singh Malwa Sultanate Malwa Victory * Gagron reaptured Battle of Banas(1446) Maharana Kumbha Malwa Sultanate Inconclusive Seige of Mandasaur(1447) Maharana Kumbha Malwa Sultanate Mewar Victory * Mandasur successfully defended. Battle of Abu (1446) Maharana Kumbha * Dodiya Nara singh Gujarat sultanate Mewar Victory Battle of Nagaur Maharana Kumbha Nagaur sultanate Mewar Victory Battle of Mandalgarh (1473) Maharana Raimal Malwa Sultanate Mewar Victory Siege of Chittorgarh (1475) Maharana Raimal Malwa Sultanate Mewar Victory Capture of Ajmer (1495) Prithviraj Sisodia Afghans Mewar Victory First Battle of Idar Maharana Sanga * Raimal Rathore Gujarat Sultanate * Bharmal Rathore Mewar Victory Second Battle of Idar Maharana Sanga * Raimal Rathore Gujarat Sultanate * Bharmal Rathore Mewar Victory Battle of Khatoli (1517) Maharana Sanga (WIA) * Medini Rai Delhi Sultanate(Lodi dynasty) Mewar Victory Battle of Dholpur (1519) Maharana Sanga * Medini Rai Delhi Sultanate(Lodi dynasty) Mewar Victory Battle of Gagron (1519) Maharana Sanga Malwa SultanateGujarat Sultanate Mewar Victory Battle of Ranthambhore Maharana Sanga Delhi Sultanate(Lodi dynasty) Mewar Victory Rana Sanga's invasion of Gujarat Maharana Sanga * Marwar * Idar Gujarat Sultanate Mewar Victory Siege of Mandsaur (1520) Maharana Sanga Gujarat Sultanate * Malwa Sultanate Mewar Victory Battle of Bayana (1527) Maharana Sanga * Marwar * Amber * Mughal Empire * Afghans of Dholpur, Bayana and Gwalior Mewar Victory Battle of Khanwa (1527) Rajput confederation under Maharana Sanga * Marwar * Amber * Mughal Empire Mughal Victory Siege of Chittorgarh (1535) Mewari Chieftains Gujarat Sultanate Gujarat Sultanate Victory Battle of Mavli (1540) Banvir Udai Singh and allies Victory for Udai singh * Siege of Chittorgarh (1567-8) Mewari Chieftains Mughal Empire Mughal Victoy Battle of Haldighati (1576) Maharana Pratap Mughal Empire Mughal Victory * Although some historians believe it to be indecisive. Battle of Mohi (1577) Maharana Pratap Mughal Empire Mewar VictoryAbul Fazl: Akbarnama, (Persian Text), Vol. III. p. 166Nizamuddin: Tabaqat-i-Akbari, (Persian Text), p. 336 Battle of Kumbhalgarh (1577-8) Maharana Pratap Mughal Empire Mughal Victory Shahbaz Khan's Invasion of Mewar Maharana Pratap Mughal Empire * Amber Mughal Victory Battle of Dewair (1582) Maharana Pratap Mughal Empire Mewar Victory Siege of Kumbhalgarh (1583) Maharana Pratap Mughal Empire Mewar Victory Siege of Onthala (1599) Maharana Amar Singh Mughal Empire Mewar Victory Battle of Dewair (1606) Maharana Amar Singh Mughal Empire Mewar Victory Battle of Ranakpur (1611) Maharana Amar Singh Mughal Empire Mewar Victory Mughal Conquest of Mewar Maharana Amar Singh Mughal Empire Peace Treaty Rathore Rebellion (1678-81) Kingdom of Marwar * Maharana Raj Singh Mughal Empire Rajput Victory Battle of Udaipur (1680) Maharana Raj Singh Mughal Empire Mewar Victory Battle Of Aravalli Hills (1680) Maharana Raj Singh Mughal Empire Mewar Victory Rajput Rebellion (1707-1710) * Kingdom of Marwar * Kingdom of Amber * Mewar (Amar Singh II) Mughal Empire Rajput Victory Battle of Bandanwara (1711) Maharana Sangram Singh II Mughal Empire Mewar Victory ==References== Category:Battles involving India",
 "title": "List of battles involving the Kingdom of Mewar"
}