{
 "id": "1105961",
 "text": "Thompson Oliha (4 October 1968 – 30 June 2013) was a Nigerian professional footballer who played as a midfielder for clubs in Africa and Europe during an injury-shortened career. As a player, he was known for his powerful shots and abilities in the air. Although being regarded as one of the finest Nigerian midfielders ever, Oliha retired at the age of 27, as a result of a serious knee injury. ==Club career== Oliha's first football club was first-league Bendel Insurance F.C. from Benin City. He made his debut for this team in 1985 in the first league when he was less than 18 years old. However, he did not achieve any significant successes with the Insurance team and at the beginning of 1988 he left for another team. Oliha moved to Iwuanyanwu Nationale. In 1988, he reached the final of the African Champions League with Nationale, but there the Nigerian club lost after two legs to the Algerian ES Sétif, and in the second match of that final, Oliha received a red card. In the same season, Thompson won his first Nigeria Cup and his first national championship. Oliha also repeated his successes in the form of the national championship in the next two years - 1989 and 1990. In 1991, the club from Owerri failed to become champion for the fifth time in a row and this title went to Julius Berger FC. At the beginning of 1992, Oliha left his homeland and went to Côte d'Ivoire, becoming a player of the local club Africa Sports National Abidjan. He played there with, among others, compatriot Gabriel Olokosi. Already in his first season with this club, Oliha won the African Cup Winners' Cup. Africa Sports defeated the Burundi club, Vital' O, in the final and it was the first African cup won by this team. In the same year, Africa Sports also won the African Super Cup. In 1993, Oliha won another trophy with the Abidjan club - thanks to winning the final 2-1 against the ASC Bouake Africa Sports team, he won the Ivory Coast Cup. Oliha played so well that he was voted the second best Nigerian player after Rashidi Yekini. In 1994, he was still in the Africa Sports squad, but did not play a single match for half of the season. In the fall of 1994, he joined the Israeli Maccabi Ironi Ashdod, becoming a teammate of compatriot Uche Okafor. In Ligat ha'Al he played 21 matches and scored 1 goal, but he failed to help the club stay in the league and the team from Ashdod was relegated to a lower class. Olihah left Ashdod. In the summer of 1995, he joined Antalyaspor for free. He made his debut in the Turkish league in the first league round, on August 12, 1995, in a 4-2 win against Bursaspor. In the first part of the 1995/1996 season, he played a total of 20 matches and scored 4 goals, but then he suffered a serious injury and had to interrupt his football career at the age of 27. ==International career== In 1987, Oliha was a member of the Nigeria U-20 national team that participated in the Youth World Cup in Chile. There, the young Nigerians won one point in 3 matches and finished last in the group behind Italy, Brazil and Canada. Thompson Oliha made his debut in the first Nigerian national team on January 28, 1988, in a 1-1 draw with Senegal during the ECOWAS Cup. In the same year, he also took part in the African Cup of Nations. He played, among other things, in the 0-1 final defeat against Cameroon and won the silver medal. In 1992, he played in the African Cup of Nations for the second time in his career. He reached the semi-finals with Nigeria, but his compatriots lost 1-2 to Ghana. Ultimately, they took 3rd place after winning the match (Oliha played in it) 2-1 against Cameroon. In 1993, he scored 2 goals for the Nigeria national team. He won the first on April 24 in a 4-0 win over Sudan, and the second on September 25 in a 4-1 win against Côte d'Ivoire as part of the World Cup qualifiers in the USA. Oliha started with three appearances in the 1994 African Cup of Nations. Nigeria reached the final, where they defeated Zambia 2-1 and became African champions. In the same year, coach Clemens Westerhof called Oliha to the World Cup finals in the USA in 1994. There, Thompson played in only one match - the round of 16 against Italy, losing 1-2, after which Nigeria was eliminated from the tournament. It was also Oliha's last match in the national team. In total, he played for the national team in 31 matches and scored 2 goals. ==Death== Oliha died due to complications from malaria on 30 June 2013. At the time of his death he was an assistant coach for the Kwara Football Academy.Thompson Oliha is dead - Supersport.com ==Honours== Iwuanyanwu Nationale *Nigerian Premier League: 1988, 1989 and 1990 *Nigerian Cup: 1988 Africa Sports *Coupe de Côte d'Ivoire: 1993 *Houphouët-Boigny Cup: 1993 *African Cup Winners' Cup: 1992 *CAF Super Cup: 1992 ==References== Category:1968 births Category:2013 deaths Category:Association football midfielders Category:Nigerian footballers",
 "title": "Thompson Oliha"
}