{
 "id": "1105242",
 "text": "Lucien Bonaparte, 1st Prince of Canino and Musignano (born Luciano Buonaparte; 21 May 1775 – 29 June 1840),was Napoleon I’s second surviving brother who, as president of the Council of Five Hundred at Saint-Cloud, was responsible for Napoleon’s election as consul on 19 Brumaire (Nov. 10, 1799).he was the third son of Charles Buonaparte. He was destined for the infantry, and followed in the footsteps of his elder brothers by attending the military schools at Autun and Brienne, but the death of his father led him to pursue a holy career.and he was one of the participants of the Coup of 18 Brumaire that brought Napoleon to power in France.In 1823, Bonaparte was elected as a member of the American Philosophical Society.He was made Prince of Musignano on 21 March 1824 by Pope Leo XII. In 1836 he wrote his Mémoires. He died in Viterbo, Italy, on 29 June 1840, of stomach cancer, the same disease that claimed his father and, reportedly, his brother Napoleon. ==Marriages and children== His first wife was his landlord's daughter, Christine Boyer (3 July 1771 - 14 May 1800),de Bourrienne, Louis Antoine Fauvelet and Ramsay Weston Phipps, Memoirs of Napoleon Bonaparte, Vol.1, (Charles Scribner's Sons:New York, 1895), 100. the illiterate sister of an innkeeper of Saint-Maximin-la-Sainte-Baume, and by her he had four children: * Filistine Charlotte (28 November 1795 - 6 May 1865), married Prince Mario Gabrielli. * Stillborn son (13 March 1796). * Victoire Gertrude (born and died 9 July 1797). * Christine Charlotte Alexandrine Egypte (18 October 1798 - 1847), married firstly Count Arvid Posse (divorced) and secondly Lord Dudley Stuart. His second wife was Alexandrine de Bleschamp (23 February 1778 - 12 July 1855), widow of Hippolyte Jouberthon, known as \"Madame Jouberthon\",Atteridge, Andrew Hilliard and Jérôme Bonaparte, Napoleon's brothers, (Methuen and Co.:London, 1909), 98. and by her he had ten children: * Charles Lucien Bonaparte (24 May 1803 - 29 July 1857), the naturalist and ornithologist. * Letizia (1 December 1804 - 15 March 1871), married Sir Thomas Wyse. * Joseph (14 June 1806 - 15 August 1807). * Jeanne (22 July 1807 - 22 September 1829), married Marquis Honoré Honorati. * Paul Marie (3 November 1809 - 7 September 1827). * Louis Lucien (4 January 1813 - 3 November 1891). A philologist and politician, expert on the Basque language. * Pierre Napoleon (11 October 1815 - 7 April 1881). * Antoine (31 October 1816 - 28 March 1877), married Carolina Maria Anna Cardinali, without issue. * Marie Alexandrine (10 October 1818 - 20 August 1874), married Vincenzo Valentini, Count di Laviano. * Constance (30 January 1823 - 5 September 1876), a nun. ==References== Category:1775 births Category:1840 deaths Category:House of Bonaparte",
 "title": "Lucien Bonaparte"
}