{
 "id": "1105322",
 "text": "Erik ten Hag (born 2 February 1970) is a Dutch professional football manager. He used to be a football player. He isn't coaching a team right now. He has won a total of 17 Titles as a manager spanning from Go ahead eagles till Manchester United ....coaching about 4 senior team and 3 Lower division team Ten Hag played as a centre-back. He started his career with Eredivisie club Twente. He joined De Graafschap in 1990. He won the Eerste Divisie in his first season there. He went back to Twente in 1992. He moved to RKC Waalwijk two years later and stayed for one season. He started playing at Utrecht in 1995. Ten Hag went back to Twente for a third time in 1996. He won the KNVB Cup in 2001. He retired in 2002, at age 32. Ten Hag started his career as a manager in 2012 at Go Ahead Eagles. He helped the club to promotion to the Eredivisie in his first season. He then joined Bayern Munich II in 2013. He won promotion to the Regionalliga Bayern in 2014. He went back to the Netherlands in 2015to be sporting director and head coach at Utrecht. He joined Ajax in 2017. He won three Eredivisie titles and two KNVB Cups. He also led the team to the semi-finals of the 2018–19 UEFA Champions League. In 2022, he became the manager of Manchester United. In his first season with the club, United won the EFL Cup. He also reached the final of the FA Cup and won against Manchester City. It was Eric’s second cup at Manchester United. Alas, he lost the locker room and his difficult issues with Sancho and Ronaldo were overbearing on a coach. Many players coming in and out that didn’t gel and finish scoring opportunities led to his downfall. Eric provided amazing tactics to create goals but the forwards were to blame for incompetency. Garnacho taking over Rashie’s LW position and Antony losing his RW position to Diallo was causing rifts internally. Maguire’s dissatisfied mug in the locker room after losing his captaincy was not helpful. On the 28th of October he got sacked by Manchester United. ==Playing statistics== Appearances and goals by club, season and competition Club Season League KNVB Cup Europe Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Twente 1989–90For 1989–90 UEFA Cup: Eredivisie 14 0 0 0 — 14 0 De Graafschap 1990–91 Eerste Divisie 37 5 — — 37 5 1991–92 Eredivisie 17 1 — — 17 1 Total 54 6 — — 54 6 Twente 1992–93 Eredivisie 24 1 — — 24 1 1993–94For 1993–94 UEFA Cup: Eredivisie 21 1 1 0 — 22 1 Total 45 2 1 0 — 46 2 RKC Waalwijk 1994–95 Eredivisie 31 2 — — 31 2 Utrecht 1995–96 Eredivisie 30 2 — — 30 2 Twente 1996–97 Eredivisie 26 1 — — 26 1 1997–98For 1997–98 UEFA Cup: Eredivisie 33 0 5 0 — 38 0 1998–99For 1998 UEFA Intertoto Cup: Eredivisie 29 0 4 0 — 33 0 1999–2000 Eredivisie 30 2 — — 30 2 2000–01 Eredivisie 28 0 — — 28 0 2001–02For 2001–02 UEFA Cup: For 2001 Johan Cruyff Shield: Eredivisie 16 0 2 0 1 0 19 0 Total 162 3 11 0 1 0 174 3 Career total 336 15 12 0 1 0 349 15 ==Managerial statistics== Managerial record by team and tenure Team From To Record Go Ahead Eagles 1 July 2012 6 June 2013 Bayern Munich II 6 June 2013 22 May 2015 Utrecht 23 May 2015 27 December 2017 Ajax 28 December 2017 15 May 2022 Manchester United 23 May 2022 Present Total ==Honours== ===Player=== De Graafschap *Eerste Divisie: 1990–91 Twente *KNVB Cup: 2000–01 ===Manager=== Bayern Munich II *Regionalliga Bayern: 2013–14 Utrecht *KNVB Cup runner-up: 2015–16 Ajax *Eredivisie: 2018–19, 2020–21, 2021–22 *KNVB Cup: 2018–19, 2020–21; runner-up: 2021–22 *Johan Cruyff Shield: 2019 Manchester United *FA Cup: 2023–24; runner-up: 2022–23 *EFL Cup: 2022–23 Individual *Rinus Michels Award: 2015–16, 2018–19, 2020–21 *Premier League Manager of the Month: September 2022, February 2023, November 2023 ==References== Category:1971 births Category:Living people Category:Dutch footballers Category:Dutch football managers Category:Sportspeople from Overijssel",
 "title": "Erik ten Hag"
}