{
 "id": "1105816",
 "text": "Beddomixalus is a group of frog in the family Rhacophoridae. It is a monophyletic genus. That means it is a genus with exactly one species in it. The only species, Beddomixalus bijui, lives in the Western Ghats, which are mountains in India. People named these frogs after Richard Henry Beddome, who learned and wrote about amphibians in the Western Ghats. Its name also has Ixalus, which is a word for rhacophorid frogs. ==Description== Beddomixalus is longer and thinner than other frogs in its family. The female frog can be long from nose to rear end. The skin of its back is yellow-tan or red-brown in color with two yellow-white stripes on the sides. It has vomerine teeth in its jaw. Its eggs are clear. The female frog lays them in swamps. They hatch into tadpoles that swim. This frog lives in forests that are not too close to sea level. ===Color=== ====Male==== The skin of the male frog's back is brown in color with a dark stripe between the eyes; a dark stripe from between the eyes to its rear end. It has two light yellowish-white stripes extending on its sides. There are black dots under the stripes. There is a wide, dark stripe from below the nose over the ear and down the side of the body. ====Female==== The skin of the female frog's back is red-brown or orange-brown in color with dark and light stripes and other marks, like the male frog. But the skin of the female frog's belly is white. ===Tadpoles=== Tadpoles are small, exotrophic and nektonic. They are oval in shape and dark in color with dark fins. The skin of their bellies is light pink in color, and people can see through the skin of the belly to the intestine. The eyes are reddish in color. The musculus. Its tail fin is round at the end. The lower jaw sheath is V-shaped. Tadpoles of this species have back legss at stage 40, with a pale dorsolateral band appearing at stage 42. By stage 44, its skin is yellow-green in color. Young fogs begin to climb onto land. During stage 46, froglets are found on swamp plants. ==Behavior== This frog lives in trees near swamps and marshes. During early breeding season, male frogs look for swamp beds. They leave the forest and go to the swamps during the pre-monsoon rains. Most male frogs sit on shrubs and bushes up to a height of about . They sing at the same time. People say the air around them smells like burned rubber, like with Hylarana malabarica. The frogs make the smell. Later in the night, the male frogs climb down from the shrubs and go to the grass and swamps. The male frog holds on to the female at her chest. The eggs are clear and about 3.2 mm in size. The female frog leaves them on wet soil or on grassy plants, about 175 eggs at a time. ==Home== B. bijui live between above sea level in evergreen forests in Eravikulam National Park. ==References== ==Other websites== * Category:Frogs of Asia",
 "title": "Beddomixalus"
}