{
 "id": "1106600",
 "text": "John Lee (31 March 1928 – 21 December 2000) was an Australian actor. He worked in movies and television in Australia, the United Kingdom and the United States. He played Andrew Reynolds in Prisoner, Inspector Ian Timms in Cop Shop, Len Mangel in Neighbours and Philip Stewart in Return to Eden. He worked in the United Kingdom in the 1960s and 1970s. He was in series such as The Avengers, The Troubleshooters, Doomwatch, Marked Personal, Warship, Survivors and Wilde Alliance. He played Alydon in the 1963–64 Doctor Who serial The Daleks. == Roles == === Movie === Year Title Role Notes 1956 Beyond the River Jenkins 1957 Cat Girl Allan Short Cut to Hell Porter Uncredited The Flying Scot Young man 1958 The Silent Enemy Flag Lieutenant 1960 Under Ten Flags Unknown 1961 Seven Keys Pat Jefferson The Secret Partner Clive Lang 1963 Dr. Crippen Harry Fawcett A Stitch in Time Police Constable Uncredited 1965 Spaceflight IC-1 Dr. Garth 1969 Crossplot Blake 1970 Say Hello to Yesterday Woman's husband Uncredited 1975 Yuppi du Unknown Pure S Man in beanie 1977 Double Exposure Financier Rothman 1980 Deadline Katzer's Assistant North Sea Hijack Phillips 1984 Street Hero Vice Principal 1986 Comrades Juggler 1988 Rikky and Pete High Ranking Officer 1993 Hammers Over the Anvil Charles McAlister 1997 The Castle Chairman === Television === Year Title Role Notes 1958 Adventures of the Sea Hawk Peter Seaforth Season 1: (26 episodes) 1958 1959 1960 ITV Play of the Week Octavius Robinson Season 4, episode 3: \"Man and Superman\" Season 5: (2 episodes) 1959 The Flying Doctor David Reid Season 1, episode 9: \"The Changing Plain\" Rendezvous Flight Lieutenant Roberts Season 1, episode 31: \"Blind Landing\" Glencannon First Officer Season 1, episode 25: \"Mutiny on the Inchcliffe Castle\" 1960 International Detective Jeff Morgan Season 1, episode 11: \"The Brenner Case\" The Probation Officer Unknown Season 1, episode 34 BBC Sunday-Night Play John Willocks Season 1, episode 20: \"Twentieth Century Theatre: Aren't We All\" Golden Girl John Redfield Season 1, episode 3: \"Snatch\" Danger Man Tony Mayne Season 1, episode 1: \"View from the Villa\" 1961 Top Secret Hendrickson Season 1, episode 11: \"The Little One Is Dangerous\" Emergency-Ward 10 Mark Dene Season 1, episode 488 1962 The Net Jim Howarth Season 1: (6 episodes) 1963 It Happened Like This Jack Tennant Season 1, episode 13: \"The Black Monk\" Sergeant Cork Cartwright Season 1, episode 13: \"The Case of the Gold Salseman\" 1964 Doctor Who Alydon Season 1: (5 episodes) Theatre 625 S.S. Block Leader Season 1, episode 3: \"The Materialists\" Armchair Theatre Dr. Fancy Season 5, episode 1: \"The Trial of Dr. Fancy\" The Wednesday Play Werner von Haeften Season 1, episode 8: \"The July Plot 1966 Court Martial Herr Heinecke Season 1, episode 7: \"The Logistics of Survival\" 1967 1968 Man in a Suitcase The Killer Inspector Glen Season 1: (2 episodes) The Avengers Mark Pearson Dr. Soames Season 5, episode 5: \"The Bird Who Knew Too Much\" Season 7, episode 1: \"The Forget-Me-Knot\" 1967 1969 ITV Playhouse Parker Franz Hasendorfen Season 1, episode 1: \"Lord Windermere's Fan\" Season 2, episode 39: \"Remember the Germans\" Softly Softly Sanders Controller Season 3, episode 9: \"The Hunt\" Season 5, episode 4: \"Error of Judgement\" 1968 The Champions Ambulance Doctor Season 1, episode 8: \"To Trap a Rat\" 1969 Paul Temple Inspector Dyer Season 1, episode 6: \"Which One if Us Is Me?\" 1969 1970 The Troubleshooters Ronnie Darling Simon Broadsword Season 5, episode 13: \"You Want a Clockwork Nightingale\" Season 6, episode 15: \"Hey, We've Got a Problem Here|\" 1970 Softly, Softly: Task Force Colonel Banks Season 2, episode 10: \"Who Wants Pride...?\" 1970 1971 1972 Doomwatch Captain Jenson Dr. Cordell Season 1, episode 1: \"The Plastic Eaters\" Season 2, episode 8: \"The Web of Fear\" Season 3, episode 10: \"Cause of Death\" 1972 ITV Sunday Night Theatre Dr. Parker Season 4, episode 26: \"The Rose Garden\" Dead of Night Priest Season 1, episode 7: \"A Woman Sobbing\" 1973 Matlock Police Paul Bell Season 1, episode 115: \"Jeff's Missing\" 1973- 1977 Warship Lieutenant Commander Bill Kiley Season 1: (3 episodes) Season 2: (4 episodes) Season 3: (8 episodes) Season 4: (5 episodes) 1974 Marked Personal Richard Mason Season 1: (10 episodes) 1975 Quiller Sir Michael Foster Season 1, episode 7: \"Target North\" 1976 When the Boat Comes In Major Rupert Routledge Season 1, episode 10: \"Knight for a Day\" ITV Sunday Night Drama Lennox Season 1, episode 61: \"The Nicest Man in the World\" 1977 Survivors Philip Hurst Season 3, episode 6: \"Reunion\" Jubilee Conrad Jacobs Season 1, episode 7: \"Our Kid\" Cop Shop Inspector Ian Timms 112 episodes 1978 Wilde Alliance Christopher Bridgewater Season 1: (8 episodes) The Birds Fall Down Edward Season 1: (2 episodes) A Horseman Riding By Major Barcley-Jones Season 1, episode 9: \"1915:\"Death of a Hero\" 1980 Prisoner: Cell Block H Andrew Reynolds Season 1: (10 episodes) Breakaway Norman Harris Season 1: (6 episodes) A Question of Guilt Mr. Beal Season 1: (2 episodes) Escape UnknownPeter Season 1: (2 episodes) The Last Outlaw Father Gibney Unknown 1981 BBC2 Playhouse Jim Season 7, episode 10: \"One Hundred and Eighty!!!\" Goodbye Darling Edward Partington Season 1, episode 4: \"Brenda\" A Town Like Alice Lester Robinson Season 1: (3 episodes) 1982 A Shifting Dreaming Unknown TV movie 1983 Return to Eden Phillip Stewart TV mini-series (2 episodes) 1985 One Summer Again Unknown TV movie 1986 Return to Eden Philip Stewart Season 1: (7 episodes) 1987 The Flying Doctors Roger Manning Season 3, episode 32: \"Sapphire\" 1988 All the Way Sir Peter Edwin Unknown 1988 1994 Neighbours Graeme Clifford Len Mangel Season 1: \"(10 episodes) 1989 Darlings of the Gods Doctor TV movie Mission: Impossible Harris Season 2, episode 2: \"The Golden Serpent: Part 2\" 1990 Flair Judge TV mini-series 1992 Acropolis Now William Season 5: \"2 episodes\" The Leaving of Liverpool Patron TV movie 1993 The Feds: Terror Brigadier Lance Talbot TV movie 1994 1997 Blue Heelers Clive McLean Arthur Starling Season 1, episode 40: \"Without Intent\" Season 4, episode 14: \"Grave Matters\" 1995 Snowy River: The McGregor Saga Mr. Halloran Season 3, episode 2: \"Rough Passage\" 1997 Everybody Loves Raymond Wo-Hop Season 2, episode 9: \"The Gift\" 1998 Moby Dick Captain Bildad TV mini-series == References == == Other websites == * Category:1928 births Category:2000 deaths Category:Actors from Launceston, Tasmania Category:Soap opera actors Category:Australian movie actors",
 "title": "John Lee (Australian actor)"
}