{
 "id": "1106446",
 "text": "Rosemary's Baby is a book, by Ira Levin. It was published in 1967. It was his second book. It was the best-selling horror novel of the 1960s, selling over 4 million copies.Harry Edwin Eiss (editor), Images of the Child, p. 38 (Bowling Green State University Press, 1994). The book was very popular, and started a \"horror boom\": Horror fiction would achieve enormous commercial success.\"Levin's frightening little book...triggered the whole modern boom in American horror fiction, making possible the success of William Peter Blatty's (much inferior) The Exorcist (1971), the Omen/Damien series of films, and the careers of novelists Stephen King and Peter Straub, among many others\". David Pringle, Modern Fantasy: The 100 Best Novels. London, Grafton, 1988. (p.103-5) The book was made into a movie, called Rosemary's Baby, by Roman Polanski, with Mia Farrow as Rosemary, and Ruth Gordon as Minnie == Plot == The book is about a group of Satanists, who want to sacrifice a human baby. The book is about the actor Guy Woodhouse, and his wife, Rosemary. When they move, they get a new apartment, in Bramford House, in Central New York. They are told that there have been mysterious deaths in that house, and one of their friends, Dr. Sapirstein, tells them not to take the new apprtment. Nevertheless, the couple takes the new apartment, and they move in. Rosemary gets to know Terry, who has about the same age, and who used to be a drug addict who was homeless. Now she lives on the same floor than Rosemary, together with an older couple. She also shows Rosemary an amulet that the older couple, the Castlevets have given to her. The amulet is full of stinking herbs; it has the from of a metal bowl. Shortly afterwards, Terry falls our of a window and dies. When the police is taking evidence and asking witnesses, Guy and Rosemary meet the older couple, Minnie and Roman Castevet, who gave the room to Terry. Guy and Rosemary get invited to dinner. Rosemary is suspicious, but Guy makes new friends with Roman, and spends a lot of time with him. Guy applied for an important role, but at first, he is not taken, and they decide to take Donald Baumgart instead. Baumgart suddenly goes blind, so they decide to take Guy, after all. Soon Guy proposes Rosemary to have a baby. The Castlevets give the amulet, that had been Terry's to Rosemary, stuffed with monk's pepper. The night when Guy and ROsemary plan to have their baby, Minnie Castlevet drops by, and brings some Mousse au Choloat. Rosemary thinks it doesn't taste well, and only eats little of it. Then she falls ill. Against the original plan of the couple, to have a baby, she falls asleep. She dreams that a hideous creature rapes her, before the eyes of Guy, Minnie, Roman and other people. When she wakes up in the morning, she findes scratches on her body. Guy tells her that he slept with her, because he didn't want to \"miss the opportunity\". Her gynecologist, Dr. Hill tells her that she's pregnant. Minnie, Roman and Guy tell her to change her gynecologist, and to take well-known Dr.Sapirstein, instead. Dr. Sapirstein tells her to take some herbal potions, which Minnie prepares for her, each day. During the first months of pregnancy, Rosemary has abdominal pain. Rosemary wants to change gynecologist, but then the pain suddenly stops. Hutch wants to meet Rosemary, to tell her something important. They arrange a meeting, but Hutch dos not show up. Later, Rosemary learns that he suddenly fell into a coma. He leaves her a book on witchcraft. In that book, Rosemary learns that satanists can use personal objects of their victims to cause them harm. She remembers that Guy and Roman exchanged tiers, and that Guy is still missing a glove. She also learns from the book, that Roman is the son of well-known satanist Adrian Marcato, who also lived in Bramford House. She suspects that the Castlevewts promised her unborn child to the devil, and she no longer wants to meet them. Rosemary tells Dr. Sapirstein abour Roman's true identity. Dr. Sapirstein then tells her that Roman is very ill, and that the Castlevets would take a longer trip to Europe. At first, this calms her down. But then Dr. Sapirstein looks suspicious. She talks to her other gynecoplogist, Dr. Hill and tells her about the suspected complot against her. Dr. Hill listens patiently, but then informs Dr. Sapirstein, without her knowing. Dr. Sapirstain and Guy appear and take her home. In the staircase she flees, and locks herself in her appartment. The satanists can enter her her appartment, and Dr. Sapirsein gives her a strong sedative. While she is sedated, her child is born. When Rosemary wants to see her child, a few days later, she is told that it died during birth. She is suspicisous, because one of the neighbouts who is looking after her, also regularly takes her milk. Later she hears a baby cry in the Castlevets' appartment. She arms herself with a kichen knife, and uses a secret passage to enter the Castlevets' appartment. There she sees the satanists, including Minnie, Guy , Roman and Dr. Sapitstein. They have a black cradle in their midst, with a cross hanging upside down. Apparently, Rosemary's baby is inside the cradle. It is a boy, called Adrian, in honor of Steven Marcato's father. Rosemary is taken aback when she sees the child's eyes. Roman tells that the child has the eyes \"of his father\" and that it was begotten by Satan. Guy tells Rosemary that he joined the satanists, because they could offer him a better career, which would imporve the life for both of them. He was also promised that she would not be harmed. As an answer, she spits in his face. Her horror soon disappears, and she wants to take the role of a mother for her chld. Roman invites her to do that, and soon she takes Adrian into her arms. == Critical reception == Cherry Wilder wrote that \"Rosemary's Baby is one of the most perfectly crafted thrillers ever written\".Cherry Wilder, \"Levin, Ira\" in Twentieth-Century Science-Fiction Writers by Curtis C. Smith. St. James Press, 1986; (pp. 443-444). Horror scholar Gary Crawford described Rosemary's Baby as \"a genuine masterpiece\".Gary Crawford, \"Ira Levin\" in Jack Sullivan (ed.) (1986) The Penguin Encyclopedia of Horror and the Supernatural Viking Press, 1986; (pg. 264). David Pringle described Rosemary's Baby as \"this sly, seductive impeccably-written horror novel ... is an expertly constructed story, a playwright's book, in which every physical detail and line of dialogue counts.\"Pringle, 1988. (pp. 103-105) ==References== Category:20th-century American novels Category:1967 books",
 "title": "Rosemary's Baby (novel)"
}