{
 "id": "1106644",
 "text": "Tupperware is an American food storage company. It sells and fixes plastic containers for home, kitchen, and personal use. == History == The company was created in 1942 by Earl Tupper. It became a public subsidiary in 1946 as Tupperware Brands. === First products === Tupperware released its first product, a plastic bowl, in 1946. According to a 2018 Smithsonian article: > [The bowl] was widely praised by the [growing] plastic industry ... which > wanted quality plastic products in consumer hands. “It was also featured as > an icon of modern design,” [Smithsonian curator Shelley Nickles] says. An > article in House Beautiful described its sleek, translucent, green-and-white > lines as “fine art for 39 cents.” That was the original cost of the bowl, > which translates to about $5.50 in today’s money. Now, a three-piece set of > the Wonderlier bowl, its successor, goes for $35.00. === 21st century === In 2023, Tupperware was sold in nearly 70 countries. Tupperware filed for bankruptcy in September 2024, reporting $812,000,000 in debt. == Marketing model == Also see: Multi-level marketing Tupperware is a multi-level marketing company. In the 1950s it became common for women to hold \"Tupperware parties\" at their homes. Selling Tupperware empowered many women to earn some income and independence - even if they could not work outside the home. It was one of just a few socially acceptable ways for women to earn money. According to marketing professor Venkatesh Shankar: > [Tupperware] had tremendous cultural impact. The famous neighborhood house > parties where Tupperware products were sold by the host to her family and > friends was a new way of marketing, combining socializing with direct sales. == Examples == File:Lots of tupperware.jpg|Tupperware soup and sandwich containers File:Tupperware plastic containers.jpeg|A Tupperware pitcher and bowls File:Tupperware (2).jpg|alt= 2 Colourful Tupperware containers|Tupperware container lids File:Tupperware cups.jpg|Tupperware cups File:Tupperdose.jpg|Tupperware container == Related pages == * Plastic * Container ==References== Category:1948 establishments in the United States Category:Companies based in Florida Category:Orlando, Florida",
 "title": "Tupperware"
}