{
 "id": "1106400",
 "text": "Manchester United Football Club is an English football club. It is located in Old Trafford, Greater Manchester. The club started as Newton Heath LYR Football Club. It was the works team of the Lancashire and Yorkshire Railway depot in Newton Heath, in 1878. The club was not part of the railway company from 1892. It had private owners for almost 100 years. It changed its name to Manchester United in 1902. Media tycoon Robert Maxwell tried to buy the club in 1984. Property trader Michael Knighton tried to buy it in 1989. The club went public in 1991. Rupert Murdoch's BSkyB tried to buy the club in 1998 before Malcolm Glazer spoke about his stake in September 2003. By the end of 2003, Glazer owned about 15% of the club. By October 2004, he owned almost twice that amount. He bought John Magnier and J. P. McManus's 28.7% stake in May 2005. He then owned about 57% of the club. This was much more than the 30% that would force him to start a takeover bid. A few days later, he took control of 75% of the club's shares. This let him take the company off the London Stock Exchange. In less than a month, the Glazer family had bought 98% of the club through their Red Football parent company. This forced a squeeze- out of the last 2%. The final price of the club was almost £800 million. Most of the money that Glazer used to buy Manchester United came through loans. Most of these loans were secured against the club's assets. This means that Glazer got the loans by offering what the club owns if he could not pay the loan back. The loans had interest payments of over £60 million per year. The rest of the money came from PIK loans (payment in kind loans). Glazer later sold these to hedge funds. Manchester United was not liable (responsible) for the PIKs. Red Football Joint Venture held these. The interest on the PIKs was 14.25% per year. However, the Glazers did not pay any of the PIK loans in the first five years they owned the club. In January 2010, the club made a successful £500 million bond issue. By March 2010, the PIKs were about £207 million. The club paid off the PIKs in November 2010, but it did not say how. In August 2012, as part of more refinancing, the Glazers sold some shares in Manchester United in an initial public offering (IPO) on the New York Stock Exchange (NYSE). Some Manchester United fans did not want the Glazers to own the club. This was even more the case when they saw the debt that the club would have after having no debt for so many years. Due to this, fans took to the streets to protest against the Glazers. Some angry fans started the football club F.C. United of Manchester in 2005. It entered the North West Counties Football League and played in the sixth tier (level) National League North from 2015 to 2019. Since 2005, the Manchester United Supporters' Trust has been working on a way of getting the fans to own the club. In 2010, they met with a group of rich Manchester United fans. The media called them the \"Red Knights\". The Trust spoke to them about a billion-pound takeover bid. However, the bid did not happen because the Red Knights did not want to pay what the Glazers' wanted for the club. Some former players, such as Gary Neville, have criticised the Glazers for the ownership. Fans at Manchester Unites games are also often critical. For many years, some fans have worn green and gold instead of red, as a protest against the Glazers. Fans singing \"We want Glazers out\" is also common at games. ==References== Category:Manchester United F.C. Category:Glazer family",
 "title": "Glazer ownership of Manchester United"
}