{
 "id": "1106911",
 "text": "Some people do recreational activities while they are nude. Such activities are known as nude recreation. Historically, the ancient Olympic Games were nude events. In Africa, Oceania, and South America there still are societies where people are mostly nude. These people will do everyday public activities without clothes too. In most other parts of the world, nude activities are either done in private or in clothing-optional areas of public spaces. In some cases, people also organize nude events, which will then take place in public, where nudity is usually not allowed. Examples for such events are nude bike rides, or nude running events. Sometimes, the nude recreational activities include sports, such as tennis, or volleyball. Nude sporting activities are usually done for fun, and not in a competitive mindset. ==Clothing-optional recreation== === Bicycling === A clothing-optional bike ride is a cycling event in which nudity is permitted or expected. There are many clothing- optional cycling events around the world. Some rides are political, recreational, artistic or a combination. Some are used to promote topfreedom. Topfreedom is the idea that women and girls should be permitted to be topless in public where men and boys have that right. In many cases, these rides are done in summer. They often attract large crowds. === Body painting === Body painting is a common form of creative expression. Often, the people taking part in clothing-optional events have some kind of body painting. Because the body is technically covered, if completed in private full body painting does not violate laws against public nudity. This means that often, the police has to make case by case decisions based upon other laws. An arts collective in Bushwick, Brooklyn has celebrated a Bodypainting Day annually since 2014, with 45 models and 25 artists participating in 2019. === Bowling === Nude bowling is one of the things naturists can do as indoor recreation. They can do this when the weather is clold or where there are few outdoor opporunities. These events are done in commercial bowling alleys. Usually, during the event, the center is closed for people who are not part of the group. === Bungee jumping === When A. J. Hackett opened the world's first commercial bungee jumping site at Kawarau Bridge near Queenstown, New Zealand, customers who performed the jump in the nude were granted free entry. This offer was later stopped because too many jumpers were taking advantage of it. The site is still clothing- optional. Billy Connolly famously bungee-jumped nude from the bridge during his 2004 World Tour of New Zealand. Since 2006 there has been an annual naked bungee jump at WildPlay park on Vancouver Island as a fund raiser for the Victoria Branch of BC Schizophrenia Society. The 2019 event drew more than 100 participants. === Hiking === Nude hiking, also known as naked walking or freehiking, is a sub-category of the modern form of social nudity. Neither nude hiking nor skinny-dipping are expressly prohibited by the US Forest Service, which instead applies laws against disorderly conduct as necessary. Nudity was advocated by Colin Fletcher in his popular 1968 book, The Complete Walker. In the United Kingdom, Stephen Gough, known as The Naked Rambler, received much media coverage for walking naked from Land's End to John o' Groats in 2003–2004 and again in 2005–2006. Conversely to Gough's experiences, in 2005 and 2006 the European Alps were crossed naked during a one-week hiking tour, and there was little media coverage. No one was arrested or troubled, and there was no police involvement. Most naked hikers report friendly reactions from people they meet. Some places have regulations that prohibit nude hiking. A local bylaw to this effect was adopted, for example, by the 2009 General Meeting (Landsgemeinde) of the residents of the Swiss canton Appenzell Innerrhoden.Swiss canton bans nude hiking (Reuters, Mon Apr 27, 2009) In nearby Appenzell Ausserrhoden, a court reinforced an unpaid fine of 100 Swiss francs for naked hiking and added the court's cost of another 3330 Swiss Francs.\"Nude hiker convicted\" (Tages-Anzeiger, Jan 20, 2011) === Museum tours === In February 2013, the Leopold Museum of Vienna opened its doors to nude museum goers for an exhibit entitled \"Nude Men from 1800 to Today\". More than sixty visitors attended in the nude. In June 2013, the Portland Art Museum in Oregon admitted nude participants prior to the nighttime World Naked Bike Ride for a special exhibit called \"Cyclepedia\" on the art of bicycle design. Hundreds of patrons saw the exhibit in the nude. === Parks === Two sections of the \"English Gardens\" in Munich, Schönfeldwiese and Schwabingerbach are officially designated as clothing optional, although nude sunbathing may be found in other locations. There are three clothing optional areas on the Isar River, and at the Feldmochinger See. Berlin also has a number of nude sunbathing areas. A section of Bois de Vincennes in Paris has, since 2017, been designated for naturists and is open from April to October. To recognize its third anniversary, a naturist picnic was held in June, 2019. === Parties === A number of colleges and universities have a tradition of nude parties,. Often, these parties are done as experiments in social interaction. They are also organized so that people who don't have the perfect bodies seen in the media can attend them. The Pundits at Yale has been throwing naked parties since 1995. At Brown the party is hosted by an off-campus housing cooperative, and at Wellesley it is a charity event for which the administration provides security. At other institutions such as Wesleyan, Columbia, MIT, Bowdoin and Amherst the parties may be more impromptu events in dorms or off-campus. === Social dancing === An invitation-only event with naked Tango Milonga dancing was held in a small town in Germany. Starkers!, a monthly naked club night, was held in London from 2003 onwards. === Yoga === Traditionally practiced with a minimum of clothing, coed nude yoga has been introduced in London, Boston, New York City and Seattle. ==References== Category:Clothing controversies Category:Pages with unreviewed translations Category:Nudity",
 "title": "Nude recreation"
}