{
 "id": "1106914",
 "text": "The Olympics of Grace () was an international multi-sport event for women that was held from 29 to 31 May 1931 in Florence, Italy. Events were held in athletics (track and field), dancing, tennis and fencing.Wellesley College. \"The Wellesley News\" (1932-12-08). The Wellesley News. Book 935 . Retrieved on 2014-01-11. Twelve European countries participated.Olympiad of Grace. GBR Athletics. Retrieved on 2014-01-11. The tournament was supported by Italian women's sports organisations and also the FSFI. The fencing competitions were held at the Teatro della Pergola on 20 and 21 May 1931. The competitions were held ten days earlier than the athletics competitions to avoid concurrently with the international championships in Vienna. The athletics competitions took place from on 30 and 31 May May at the Giglio Rosso club field that had a 336 meter track. There was a dance competitions held between European schools and are regarded as a side event. The dance competitions were scheduled to take place at the Boboli Gardens, but were moved to the Politeama Theater due to uncertain weather. The international tennis tournament took place on 29 and 31 May. Also on 31 May, the final of the Italian women's basketball league was played between the Napoli Basketball Association and the Triestina Gymnastics Society. ==Sports== Archery, Athletics, fencing and tennis were the main sports of the Games. Besides of that the final of the , the national women's basketball league. A dancesport competition was held as a side event. Main events * * * * * Other events * Basketball () * Dancesport (side event) ==Participating nations== A total of 12 nations participated in the Olympics of Grace. * * * * * * * * * * * * There were negotiations with several other inveted countries to attend the Olympics of Grace, including the United States, Bulgaria and Greece. The Netherlands did not send a delegation due to the high costs. ==References== ==Links to other websites== *Video of the Games Category:Olympics of Grace Category:1930s in women's sport Category:1931 in sports Category:Florence Category:1931 in Europe Category:Multi-sport events Category:International sports competitions",
 "title": "Olympics of Grace"
}