{
 "id": "1107418",
 "text": "Didier Guillon (born 28 March 1953) is a French-Swiss art collector and artist. He is known for his numerous exhibitions both in Switzerland and around the world. His art collection is diverse and includes works by various artists such as Leonardo Cimolin, Quentin Garel, Yves Levêque, Aristide Najean, Silvano Rubino, Tom Powell, Pavel Ruchka, Isao, Sophie Westerlind, Frederic Amat, Joan Gardy Artigas, and others. ==Biography== Didier Guillon was born on 28 March 1953 in Neuilly-sur-Seine, France. He comes from a family with a background in the arts, being a descendant of Charles Sedelmeyer, an art collector, and the great-grandson of French sculptor and art historian Stanislas Lami. Since 2013, his works have been featured in exhibitions in Switzerland and other countries. In 2015, he established the Valmont Foundation, which is dedicated to \"promoting art, beauty and uniqueness\" by collecting and exhibiting contemporary art in Switzerland and abroad. He is married to Sophie, who is the CEO of the Valmont Group, and with whom he has three children: Capucine Guillon, Maxence Guillon and Valentine Guillon. Guillon creates art using different materials like newspapers and cardboard. His artwork often features three main symbols: a mask, a gorilla, and a cage. In 2015, the \"Collection d'Artistes\" exhibition took place, featuring nine works, each consisting of ten copies. In 2018, an art exhibition titled \"The Elegant Symmetry of the Gorilla\" was held in New York, showcasing 30 works designed and created by Guillon. The collection included sketches and collages, vinyl silhouettes, Murano glass reliefs, metal sculptures, and more. In 2019, a group exhibition on musical themes titled \"Hansel and Gretel\" was organized at Palazzo Bonvicini in Venice. In 2020, Guillon had an exhibition titled \"Venetian Love\" at Palazzo Bonvicini in Venice. In 2021, he organized the \"Janus\" exhibition at Fondaco dei Tedeschi, dedicated to the concept of renewal, end, and beginning. The \"Room of Tears\", exhibited in the same year, depicts human issues in contemporary society. In 2021, Guillon held an exhibition called \"Tintswalo African Colours\" at Casa degli Artisti in Milan. He designs his works and exhibitions mainly from recycled materials. ==Reception== Sabah Kaddouri, writing for the French edition of American business magazine Forbes, stated that Didier Guillon's work \"compels people to open themselves up\" and \"reconnect with their humanity.\" French fashion magazine L'Officiel has described Didier Guillon as a contemporary art representative, who collects and exhibits works of art. ==Exhibitions== Year Title 2024 ULYSSES. We are All Heroes, Palazzo Bonvicini, Venice IVO in Japan, La Maison Valmont Madrid, New York, Paris 2023 EGO, Palazzo Bonvicini, Venice HOPE, La Maison Valmont, Berlin, Munich, New York, Madrid, Paris IVO In Tanzania, Ginza-Six, Tokyo 2022 Peter Pan. La nécessité du rêve, Palazzo Bonvicini, Venice Blessing in Disguise, Historical Archives Museum, Hydra Hadrien Dussoix et Didier Guillon s’amusent, La Maison Valmont, Munich IVO in Tanzania, Mokdong department store – Seoul, South Korea 2021 Tintswalo African Colors, Casa degli Artisti, Milan Alice in Doomedland, Palazzo Bonvicini, Venice The Room of Tears, La Maison Valmont, Munich Janus, La Maison Valmont, Berlin, Munich, Historical Archives Museum, Hydra, Fondaco dei Tedeschi, Venice Au coeur du bois, Didier Guillon & Christian Renonciat, La Maison Valmont for Le Meurice, Paris 2020 Venetian Love, Palazzo Bonvicini, Venice 2019 Tell Me The Truth, La Maison Valmont, Munich Hansel & Gretel, Palazzo Bonvicini, Venice White Mirror, La Maison Valmont, Munich, Tokyo, Broadway Gallery, New York, Cardi Gallery, Milan, Chengdu 2018 The Elegant Symmetry of the Gorilla, Broadway Gallery, New York Les Affinités Electives, Castle de Nyon, Nyon 2017 Beauty and the Beast, Palazzo Tiepolo Passi, Venice 2016 El Cuor no se Vende, Historical Archives Museum, Hydra 2015 Collection d’Artistes, La Maison Valmont, Tokyo, New York, Barcelone, Verbier The dialogue of Fire, Palazzo Tiepolo Passi, Venice ==References== ==Other websites== * Official website Category:Living people Category:French artists Category:Swiss artists",
 "title": "Didier Guillon"
}