{
 "id": "1107433",
 "text": "Imam Mohammad Ahmed Eissa (), or Sheikh Imam (July 2, 1918 - June 6, 1995), was an Egyptian singer and composer. During his career, he collaborated and formed a duo with the poet Ahmed Fouad Negm. Together, they wrote progressive songs about Egyptian politics and situation of the poor. Their songs were written in Egyptian dialect. == Early life and education == Sheikh Imam was born to a peasant family in a village called Abu al-Numrus in Giza. He lost his eyesight due to trachoma when he was three years old. He went to a charity school, the Sharia Society, where he was taught how to recite the Qur'an. At the age of 12, he had memorized the whole Qur'an and he obtained the title of 'Sheikh'. When he was fifteen years old, Imam had to leave the school because his manner of recital was viewed as ‘too liberal’. He became a scripture reader at funerals, weddings and other occasions. == Career == He earned his money by reciting the Quran, but this changed when he met a met a famous musician in 1945, Sheikh Darwish El Hariri. He started learing the basics of music. While he was practicing music as a hobby, he started to enjoy playing the ud (lute). He started performing at parties and other gatherings, such as weddings. Imam changed his appearance by dressing in a more Western way. He began to diversify his music and started singing songs by Muhammad Uthman and Sayid Darwish, because he was interested in Egyptian folk music. In the beginning of his career, songwriting was not his strongest side, but in 1962 he formed a duo with the poet Ahmad Fouad Negm and their lyrics became very popular in Egypt and other Arab countries. The duo developed social and political songs. These songs were often about the poor people in Egypt and the working class. After the war with Israel in 1967, Imam and Negm became even more involved with social and political issues.Their songs were popular during protests and strikes by Arab students and workers. Because of their political involvement, the 'Imam-Negm' duo was sentenced to life in prison by the regime of Gamal abd al-Nasser. They were released from prison after three years at the order of Anwar Sadat. He released all prisoners after the death of Gamal abdel Nasser. During both the Nasser and Sadat-regimes, Imam and Negm were arrested and jailed multiple times. They also spent a few years in exile in Algeria. Sheikh Imam was arrested for the last time in 1981 under the regime of president Mohammad Hosni Mubarak. Three years later he was released, which made him able to travel outside the country. His music is known worldwide and the crowd was always very enthusiastic when the singer came on stage. His music was part of folk culture, which means it was popular among a broad audience.With their music they fought against inequality and media censorship. === Late career and death === After working together for a long time and accomplishing a great political impact with their songs, the ‘Imam-Negm’-duo separated in the mid-80s. The duo had worked together for more than 30 years, but after a few disagreements they decided to go their own way. Imam and Negm continued their careers individually. In 1995, Sheikh Imam died at age 76 after a long illness and he was found dead in his apartment. His songs left a lasting impression on many people today and his revolutionary messages will be remembered. == Language and genre == === Language === Imam's music was meant for the working class in Egypt, because they were a neglected and unprivileged group in Egyptian society. Sheikh Imam and Ahmed Fouad Negm wrote songs that were politically motivated and radical at the time. The lyrics were meant to bring justice to the oppressed, such as peasants, the working classes and women. For this reason, it is not strange that Sheikh Imam was named \"A voice of The People\" or \"The Peoples Singer\". The duo sung in colloquial Arabic, in this case the Egyptian dialect. This was the language of the people, which meant that the lyrics were easily understandable for listeners. Many songs were based on the poems of Ahmad Fouad Negm, who was also known for writing in the Egyptian dialect. Many songs, like sharraft ya Nixon baba (Arabic: شرفت يا نكسون بابا), have a sarcastic and cynical tone in language. The sarcastic titles and lyrics played a great role in spreading a political message. === Genre === The style of Imam and Negm's music is a genre called Muwashshah. This way of song performance was first developed as poetry. The genre goes back to the Middle Ages in Andalusia, where the first Muwashshah poems were written. The musical form of Muwashshah was developed in Syria, Lebanon and Egypt and is more modern than the poetry genre. It generally consists of instruments such as the ud (lute), the daf (tambourine) and kamanja (spike fiddle). == Politically motivated music == Because of their fiery lyrics, the songs of the Imam-Negm duo were banned from Egyptian radio. This banning was due to their criticism of the defeat during the Six-Day War in 1967. In the eyes of Imam and Negm, the Egyptian authorities were responsible for the defeat. The song Shuqu' buq'u ya dil al-far (Arabic: شقع بقع يا ديل الفار) was a very critical song about overthrowing the government. This song was banned from the Egyptian radio and television. In 1969, the Imam-Negm duo was arrested and accused of having used hashish. Despite the banning of Sheikh Imam's music, the songs went beyond Egyptian borders. He was invited by the French Ministry of Culture in the 1980s to perform concerts. His music became very popular in Arab countries and in Europe. His music gave hope to the unprivileged groups in society and he left a lasting impact on many generations. He toured in countries such as France, England, Tunisia, Lebanon and Algeria. The songs of Sheikh Imam and Ahmed Fouad Negm still hold relevance inside and outside of Egypt. == Popular songs == * \"إذا الشمس غرقت\" (iza al-shams ghir'it, 'If the sun drowned') * \"غابة كلابها ديابة\" (ghaba kilabha diaba, 'A forest where its dogs are wolves') * \"يا مصر قومي\" (ya masr 'umi, 'Oh Egypt, rise!') * \"الفلاحين\" (al-fellaheen, 'The peasants') * \"يعيش أهل بلدى\" (ya'eesh ahl baladi, 'Long live the people of my country') * \"مصر يامة يا بهية\" (masr yama ya bahiya, 'Egypt, how beautiful you are') * \"شرفت يا نكسون بابا\" (sharraft ya Nixon baba, 'It's been an honor, father Nixon') * \"عن موضوع الفول واللحمة\" (an mawdu' al-ful wa al-lahma, 'On the topic of ful and meat') *\"جيفارا مات\" (givara mat, 'Guevara died') *\"طهران\" (tahran, Tehran) *\"سجن القلعة\" (sign al-'al'a, 'The citadel prison) *\"طلع الصباح\" (tili' al- sabah, 'The morning has risen') *\"جائزة نوبل\" (ga'izat nubel, 'Nobel prize') == References == Category:1918 births Category:1995 deaths Category:20th- century composers Category:Blind people Category:Egyptian singers",
 "title": "Sheikh Imam"
}