{
 "id": "1107213",
 "text": "Annemarie Jacir (born 17 January, 1974) is a Palestinian filmmaker who has worked within the film industry since 1998. She is best known for her work as director for Salt of This Sea (2008) and When I Saw You (2012). == Early life and education == Annemarie Jacir was born in Bethlehem, Palestine to a Christian family. She spent much of her early life in Saudi Arabia and received much of her formal education in the USA, including her bachelors in California and masters in New York. She is married to producer Ossama Bawardi, who she met on the set of Salt of This Sea. == Career == === Film === Annemarie Jacir has been active within cinema since 1998. Her first acclaimed debut was her short film Like Twenty Impossibles (2003) which broke history as the first Arab-directed short film nominated at the Cannes Film Festival. The film then went on to make it as a finalist at the Oscars. Jacir’s major breakthrough was her 2008 feature film Salt of This Sea which follows the story of an American woman, the child of Palestinian refugees, returning to her motherland. Salt of This Sea went on to win over fourteen awards. In 2012, Jacir directed her second feature film When I Saw You. This feature, set in 1967, centres around an 11 year old Palestinian refugee in Jordan. Jacir’s third feature film Wajib was released in 2017 and follows the story of a father and his son coming together to deliver his daughters invitations, in keeping with local Palestinian tradition. Wajib has received over 36 awards. Her three feature films were each nominated as Palestine’s entry for the Oscars. Jacir has said \"I don’t care much for the Oscars but the fact that Palestine is being represented and Palestinian voice are getting out there is very important.\" === TV === Annemarie Jacir made her first TV debut in 2022 as director for a season 3 episode of Ramy Youssef's show Ramy. The show focuses on Ramy, an Arab-American, making a business trip to Jerusalem, and his confrontation with the brutality of life in modern day Israel-Palestine. Youssef selected Jacir to co-direct to express a Palestinian perspective. === Other === Annemarie Jacir has created the film production company Philistine Films, an independent production collective centred around Arab-led film. In 2018, she served as a jury member at the Cannes Film Festival. In 2020 she became a jury member at the Berlin International Film Festival. She has taught at a number of universities including Columbia University, Bethlehem University and Birzeit University. She is founder of the Dreams of a Nation project, which promotes Palestinian cinema and is based at Columbia University. Jacir is an active member of the Palestinian Filmmakers Collective and a board member for Alwan for the Arts. == Controversy == A showing of Wajib was pulled from German broadcaster ARD in 2023, following the events of October 7th within Israel-Palestine. Jacir responded claiming the decision was censorship and “ridiculous”. == Filmography == Year Title 2001 The Satellite Shooters 2001 A Post Oslo History 2003 Like Twenty Impossibles 2005 Quelques miettes pour les oiseaux 2006 An Explanation: And Then Burn the Ashes 2006 Palestine, Summer 2006 2008 Salt of This Sea 2012 When I Saw You 2016 The Rendezvous 2017 Wajib 2022 From Palestine with Love (Postcard from the Future) 2022 Ramy ==References== Category:Palestinian people Category:Filmmakers",
 "title": "Annemarie Jacir"
}