{
 "id": "1107230",
 "text": "He is an intellectual friend. He always has his favorite blanket. Linus van Pelt is a major character in Charles M. Schulz's comic strip Peanuts. He is Lucy and Rerun's brother, and the middle child of the van Pelt family. Linus always means well and tries to smooth over any storms that arise amongst the gang. One of his sources of frustration is his sister Lucy, who always belittles him, particularly over his security blanket. In spite of his insightful nature, he has a naive belief in the Great Pumpkin. He is Charlie Brown's best friend. His favorite teacher is Miss Othmar, who he is also in love with. Linus makes the second most appearances in the TV specials and movies. Charlie Brown and Snoopy, who appear in every TV special and movie, make the most appearances. Linus is absent from What a Nightmare, Charlie Brown and It's the Girl in the Red Truck, Charlie Brown. Are Linus and Lucy the same age? Probably being that they are the oldest, they were born 1944-45. Linus was born about 1950-51, as he makes his debut later after Lucy in 52. Schroeder is the same age as he. The Goose Eggs were all born in the 70s, and Woodstock would be 1963-64. Are Lucy and Linus twins? Lucille \"Lucy\" Van Pelt is a fictional character in the syndicated comic strip Peanuts, written and drawn by Charles Schulz. She is the older sister of Linus and Rerun. Linus van Pelt appears in the episode as a trailer “Bring Me the Head of Charlie Brown” In 1986 for a faux Peanuts television special. Linus also appears in the tv special “Why Charlie Brown why?” In 1990 == History == Lucy's baby brother was first mentioned on July 14, 1952. Linus first appeared on September 19, 1952, as a baby too young to sit up by himself and was not given a name until three days later. However, he soon aged to just slightly younger than the rest of the cast. He first stood up on June 30, 1953, and is first seen walking on August 20, 1953, and continues doing so for a few more strips before he strangely reverts to crawling. He is first seen with his blanket on June 1, 1954. He finally goes back to walking on a regular basis on June 29, 1955. On September 15, 1955, he first talks in full sentences. In the strip from January 18, 1956, he becomes friends with Charlie Brown. In the strip from February 5, 1962, Linus begins to wear glasses. However, by July 17, 1962 of that year, his ophthalmologist had told him that he does not have to wear them all the time, and they are phased out completely after the Sunday strip of September 9, 1962. In the strip from June 9, 1986, Linus claims that his birthday is in October. == Personality == Linus was eccentric from the start. As a baby and a toddler, he had a fascination with building impressive structures, mostly with blocks and playing cards. He would instantly learn skills; when his friend Charlie Brown handed him a basketball, Linus bounced it at lightning speeds before shooting and scoring in the trash can. The only thing he couldn't do was blow balloons correctly, they would always end up being cuboid instead of rounded for no conceivable reason. He was more intolerant of his sister's torments than he later would be, and would throw something at her or pretend to shoot her while screaming \"BANG!\". His appearances and his sentences were small, but both would increase as he started leaving the house more, often being told incorrect facts about the world by Lucy, which he would believe and get scared of. Linus' age would quickly accelerate, stopping upon being just slightly younger than the rest of the characters. Despite his youth, Linus is incredibly smart, acting as a philosopher and theologian, often quoting the Bible. He is kindhearted and caring, and he listens to the problems of others by the wall or elsewhere and, if not a joke, he would have something helpful to say or do. In contrast to his advanced intellect, Linus has two of the strangest traits out of the entire cast, ones that make the fact that he sucks his thumbs and thinks that one is sweeter than the other look like nothing unusual. The first is his belief in The Great Pumpkin, which started on October 26, 1959. Apparently started by the confusion of Santa Claus and the commercialization of Christmas poisoning children's minds, he solely believed that the Great Pumpkin would rise from the pumpkin patch he finds is most \"sincere\", before flying around the world to bring toys to all the good children. This delusion causes Linus to sit in a local pumpkin patch and wait for him to rise out of it. He was able to gain, in Marcie's words, a \"disciple\" occasionally, such as Peppermint Patty and Sally, but something would always ruin it for Linus, and he obviously never got to see the non-existent entity. The second and most famous and downright signature trait is his security blanket. Ever since its introduction on June 1, 1954, he has carried it with him over his shoulder in most of his appearances even when others make fun of him for it. Without it, Linus is inexplicable paranoid, and ends up fainting, shaking, sweating, and showing other traits of intense sickness and worry. Lucy makes numerous attempts to break Linus of his blanket habit, and Snoopy tries to steal the blanket for himself, but Linus would never let up. The blanket makes for a peculiar multi-tool for Linus, as he can use it as a whip, a parachute and as a means to grab long range objects. Linus is extremely accurate when using his blanket as a whip, being able to hit a falling nickel in the air without warning. In later strips, Linus was seen less and less with his blanket. Charles Schulz said in 1989 that Linus had outgrown his blanket and it only appeared in strips that were dependent on it. Linus became a valued member of Charlie Brown's baseball team. He is usually seen playing second base, however, he has on occasion played as Pitcher in place of Charlie Brown when he has been unwell. Usually, when Linus is pitcher, the team wins the game. == Physical appearance == Linus has stringy hair which stands on end whenever he's surprised, scared or angry. It's unknown to what his real hair color is; in the early comic strips, his hair is black, but in The Peanuts Movie, it's brown. His usually depicted wearing short black pants and a shirt with black stripes. In the Peanuts animated TV specials, Linus' shirt is colored red. The security blanket that he carries around, is a kind of comfort object. Category:American comic strips",
 "title": "Linus Van Pelt"
}