{
 "id": "1107678",
 "text": "An unexploded bomb (UXB) is a bomb or orther explosive that did not explode as planned. Most of these are ammunition, grenades, and bombs. There can be different reasons why they did not explode. Other names include unexploded ordnance (UXO, or UO) and explosive remnants of war (ERW, ERoW). Some of the reasons are: * They were not handled correctly * Before they were used, they weren't armed properly * Because of sabotage, they did not explode * The environment where they were used didn't trigger the bomb Many of these still pose a risk, often long after the conflict they were used in is over. When people find them, they do not recognise these devices. When they explode, the people who find themget killed, or they get injured badly. Aerial bombs which were dropped in large numbers often have a trigger that delays detonation. The idea was that the bomb detonates much later, when people think they are safe again. That way, the bomb wlil cause more damage. These triggers can also fail. A bomb that has been in the environment for a longer time is more likely to explode. Many armies have troops who are specialized in finding and neutralizing such bombs. When they are found, there are two options: * In many cases, handling them is diffucult. A team of specialists will disarm them at the place where they are found. Disarming means that the device is put into a state where it can no longer explode. Usually this means that the trigger is removed. * They are detonated in a controlled manner In both cases,there will be a security perimeter. This means, that there will be no uninvolved people within a given disrance of the unexploded bomb. In very few cases, the bomb will be transported to another location, before it is detonated, or disarmed. Landmines are sometimes also counted as unexploded bomb, even though the idea there is that the mine olny explodes when a human or animal comes near it, or steps on it. Category:Explosives",
 "title": "Unexploded bomb"
}