{
 "id": "1107608",
 "text": "Newcastle Libraries are the public library system in Newcastle, Australia. They are the biggest borrowing library system in New South Wales. Newcastle Libraries work with the Newcastle Museum. == History == Starting in the 1920s, lots of people wanted a free public library in Newcastle. In the 1930s, lots of people supported the Free Library Movement, and a newspaper called it \"most active and well organised\". In the late 1930s, the Newcastle Council thought they might want to make a free library. The Newcastle School of Arts (which had a library people needed to pay to use) said that the council could use their building for a free library. When they council were still planning the library, World War II happened, and the council did want to spend money or time on the library for a while because the war was more important. In 1945, when Roland Pope died he left paintings and rare books to the City of Newcastle. He said that he wanted them to use the items to start a free public library and an art gallery. On the 21st October 1957, The Newcastle City Library officially opened in the Cultural Centre. At first the library was a reference library, and people were not allowed to borrow the books. Most of the thigns in the library were thigns people had donated. Some people who donated thigns were C. Barrington Darley, the Women's Club's children's library, and the School of Arts building after the school ended in 1964. == Collections == Dungog Libraries and the Port Stephens Libraries that are at Raymond Terrace, Tomaree (Salamander Bay), and the Port Stephens mobile library all share their collection together. Sometimes they do other things together, and when they do they are called Newcastle Region Libraries. Newcastle also helps the libraries with technology. They do this because some Port Stephens libraries are very small with only one staff member.Macroplan Australia (2010). A benefit cost analysis – Outsourcing of Acquisition. State Library of New South Wales. === Rare books collection === The rare books collection is on the first floor on the City Library. It is in a locked room, but people are allowed to go inside if they ask a librarian. The room has the donations by Roland Pope, rare books by John Gould like The Birds of Australia with hand-coloured drawings by Elizabeth Gould, and over 2000 books from Lucy Gullett when she died. The room is kept at a temperature that helps keep the books safe. === The Stack === The stack is the name of the City Library basement, which has things people are not allowed to borrow. It contains over 100,000 volumes, some are from the 1800s. The Stack has old Newcastle Morning Heralds, NBN film reels, land title documents, maps, and limited edition books. == Buildings == Newcastle Libraries has eleven branches. The Newcastle City branch (sometimes just City Library) is the main library, and is inside the building called the \"Newcastle War Memorial and Cultural Centre\". The City branch has a small art gallery called the Lovett Gallery, which had echibitions on Paul Jennings, Afgan Australian Stories in Threads, Kakuda Nation Park, and a photographic exhibition on steam trains in the Hunter region. The Local History Library also in the Cultural Centre building, but is on the first floor, above the City Library. It opened in 1957 when Wilfred J. Goold (founded the Newcastle and Hunter District Historical Society) gave the library money for a history collection..Newcastle Local History Library. (n.d.). [plaque]. War Memorial Cultural Centre at 15 Laman Street, Newcastle, New South Wales, Australia. Because of his donation, the history library was called the W. J. Goold room Goold's collection of photos, maps, models, and old firearms took over 30 years to collect. Lambton library opened in 1950, building that was council chamber from 1887. It has hours without librarians where only members can go inside. Other branches are Adamstown, Beresfield, The Digital Library (Newcastle West), Hamilton, Mayfield, Stockton, Wallsend, and New Lambton. New Lambton is where the Newcastle Toy Library is. == Services == The Newcastle Seed Library started in October 2020, where people can get seeds from Newcastle City, the Digital Library, and Wallsend. Newcastle Libraries have a home library service, podcast and media room, and 3D printing and scanning. In 2007 the State Library of New South Wales gave Newcastle Libraries $19,000 for a community languages collection. === The Memory Room === The memory room started in 2020 and uses things from the Local History Library to help people with dementia thign about their memories about Newcastle. The program has an educational podcast series about dementia, art workshops run by an art therapist, a tovertafel, and \"memory kits\" that people can borrow with picture books, CDs, DVDs, puzzles, games and activities. The project has worked with local schools where young children and people with dementia can share stories === DigiLab === The DigiLab (Digital Laboratory) was created with funding from the State Library of New South Wales, so that the local heritage collection could be digitised and put onto computers. The library has a Cobra Semi-Robotic Scanner and a fully automatic digitisation robot.New South Wales government. (2020). 95th Meeting - Public Libraries Consultative Committee Joint meeting with the Library Council. State Library of New South Wales. == References == Category:Newcastle, New South Wales Category:Libraries in Australia",
 "title": "Newcastle Libraries"
}