{
 "id": "1107665",
 "text": "The Bangladesh Manipuri Sahitya Sangsad () is a literary society that works for the development of Meitei language (officially called Manipuri language) and culture in the People's Republic of Bangladesh. Its name is usually shortened as BAMSAS. However, instead of BAMSAS, it is also shortened as BMSS in many cases. == History == The Bangladesh Manipuri Sahitya Sangsad () was established in the year 1975 in Bangladesh. It used to publish a magazine named Meira (). In 1982, it published the first ever Bangladeshi Meitei language poetry book, Basanta Kunnipalaji Leibang (). It is the first of its kind in Bangladesh. In 1990, it published another book \"Bangladesher Manipuri Kabita\" (), consisting of 20 Meitei language poems authored by 10 Meitei poets of Bangladesh. Later, 2 other books of Meitei language poems, \"Myang Mapei Marakta\" () and \"Wakhalji Nachom\" () were also published. Some books on Meitei cultural topics were published in Bengali language. == Giving awards == Bangladesh Manipuri Sahitya Sangsad () annually gives awards to notable writers of Meitei literature (Manipuri literature) and culture. === Nilima Sinha Memorial Award === The Nilima Sinha Memorial Award consists of a certificate, an Innaphi, a crest, a cash of 10,000 Bangladeshi Taka, as well as a free round trip travel fares for two people. In 2022, the Nilima Sinha Memorial Award for Manipuri Literature and Culture was given to Sahitya Akademi Awardee Kshetri Bir of Kakching, Manipur, for his contributions to the Meitei literature. === Sinam Tanubabu Memorial International Award === In 2022, the Sinam Tanubabu Memorial International Award was given to Mutum Ramani Devi from Kwakeithel Thokchom Leikai of Manipur, India, for her work named \"Fongngamdraba Cheinakhol\" (). === Rajkumar Sitaljit Memorial Award === The Rajkumar Sitaljit Memorial Award is given usually as a part of the International Manipuri Short Story Festival, organised by the BAMSAS. However, it is the lifetime achievement award given by Manipuri Short Story Society, India. In 2022, the Rajkumar Sitaljit Memorial Award was given to AK Seram from Sylhet, Bangladesh. == Celebrating festivals == === International Manipuri Short Story Festival === The Bangladesh Manipuri Sahitya Sangsad annually organises the International Manipuri Short Story Festival (IMSSF) for 3 consecutive days. In 2022, it was organised at the Court Point in Sylhet, Bangladesh. It was organised in collaboration with the Manipuri Short Story Society, India. 26 writers from India (Manipur and Assam) took part in the event. === Manipuri Bhasha Utshab === The BMSS also annually organises the Manipuri Bhasha Utshab (), also known as Manipuri Language Festival (), or Meitei Language Festival (), in Bangladesh. During the event, Meitei language article writing contests, songs performances, traditional Meitei dance performances, aes usually done. === Ningol Chakkouba celebration === In October 2022, Bangladesh Manipuri Sahitya Sangsad (BAMSAS) received the representative people of the Patriotic Writers Forum Manipur (PAWF) from Manipur, in the Holly Inn, Sylhet, for the celebration of Ningol Chakkouba (), in Bangladesh. == Related articles == * Manipuri Literary and Cultural Forum, Tripura == Notes == == References == == Other websites == * Bangladesh Manipuri Sahitya Sangsad at Category:Meitei culture Category:Bangladesh Category:Meitei literature",
 "title": "Bangladesh Manipuri Sahitya Sangsad"
}