{
 "id": "1107616",
 "text": "Samuel Thomas \"Sam\" Wilson is a fictional character in the Marvel Cinematic Universe (MCU) franchise portrayed by Anthony Mackie, based on the Marvel Comics character of the same name and known commonly by his original alias, the Falcon. He appears in the movies Captain America: The Winter Soldier (2014), Avengers: Age of Ultron (2015), Ant-Man (2015), Captain America: Civil War (2016), Avengers: Infinity War (2018), Avengers: Endgame (2019), the television miniseries The Falcon and the Winter Soldier (2021), and as Captain America in the movie Captain America: Brave New World (2025). Wilson is initially depicted as a veteran United States Air Force Pararescueman who specializes in the use of an advanced jet pack with articulated wings. A skilled combatant and tactician, Wilson becomes a close friend of Steve Rogers after assisting him during the Hydra uprising, later being recruited by him to join the Avengers. During the fallout related to the Sokovia Accords, Wilson sides with Rogers and becomes a fugitive as a result. He returns to the fold during the conflict against Thanos, falling victim to the Blip. After being restored to life, he is personally appointed by the now-retired Rogers to become the new Captain America, also receiving from him a specially made version of the iconic shield. However, believing he cannot live up to the mantle, Wilson decides to surrender the shield to the U.S. government, who in turn appoints John Walker as Captain America instead. During the ensuing conflict with Walker and the Flag Smashers, Wilson, with assistance from James Barnes, finally accepts the title. == Appearances == === Film appearances === Year Film Portrayed by 2014 Captain America: The Winter Soldier Anthony Mackie 2015 Avengers: Age of Ultron Ant-Man 2016 Captain America: Civil War 2018 Avengers: Infinity War 2019 Avengers: Endgame 2025 Captain America: Brave New World === Television appearances === Year Television series Seasons Episodes Portrayed by 2021 The Falcon and the Winter Soldier 1 6 Anthony Mackie Category:Marvel Cinematic Universe characters Category:Marvel Comics movie characters",
 "title": "Sam Wilson (Marvel Cinematic Universe)"
}