{
 "id": "1107464",
 "text": "The South Lebanon Army or South Lebanese Army (SLA; , ), also known as the Lahad Army () or as the De Facto Forces (DFF), was a Christian-dominated militia in Lebanon. It was founded by Lebanese military officer Saad Haddad in 1977, amidst the Lebanese Civil War, and evolved to operate as a quasi- military during the South Lebanon conflict, basing itself in Haddad's unrecognized State of Free Lebanon. Initially, it was known as the \"Free Lebanon Army\" after it broke away from the Army of Free Lebanon, another Christian-dominated militia. After 1979, the SLA's activity was almost exclusively confined to southernmost Lebanon.Government of Free Lebanon in exile Under the aegis of Israel, the militia was bolstered by the 1982 Lebanon War. It came under increasing Israeli supervision following the collapse of the State of Free Lebanon in 1984 and subsequent establishment of the South Lebanon security belt administration. As the most prominent pro-Israel militia in Israeli-occupied Lebanon, the SLA frequently engaged in armed clashes with Hezbollah, the Palestine Liberation Organization, and other militant groups. After Israeli forces withdrawal from Lebanon in 22 May 2000, the SLA positions collapsed in the face of Lebanese civilians and Hezbollah's advance towards South Lebanon and Saad Haddad's statue was dragged through the streets of Marjayoun. SLA members either fled to Israel, constituting Lebanese people in Israel, or were captured and tried for treason. SLA is considered by the Lebanese people, including both Christian and Shia Lebanese, to be traitors and collaborators and pejoratively described by most Lebanese as \"sand bags of Israel\". == The South Lebanon Army (SLA) == (previously known as 'Free Lebanon (Lebanese) Army') was a political pro-Israeli militia that operated in southern Lebanon between 1977 and 2000, led and founded by Saad Haddad. Due to the location, it led to many clashes with militias such as the PLO (Palestinian Liberation Organisation) or Hezbollah (or Hizbullah; Shia Muslim party and organisation in southern Lebanon), fighting against the Israel's territorial claims. The principal aim of the SLA was to defend Christian towns in southern Lebanon that were endangered by the actions of the Palestine Liberation Organisation (PLO). However, behind this idea was actually Lieutenant Ya'ir Ravid, who was a part of Israeli military intelligence. Thus the actual aim of the creation of the military was to create a buffer zone here, proceeded by 'Free Lebanese Militia' that would prevent further territorial claims and aspirations of the PLO that would endanger Israel's interests. == Background story == === Why would Israel be involved in creating militia Lebanon? === The territorial ambition of Israel explains its presence in Southern Lebanon. However, until the start of the civil war in Lebanon in 1975, the Israeli encounters in Southern Lebanon could be described as cyclical (meaning their presence wasn't permanent in character). More explicit Israeli involvement within South Lebanon was mostly a consequence of the Israelo-Egyptian relationship improving in the 1970s. Therefore, there was no danger of Israel having to face both Egypt and Lebanon in case of a military intervention. Additionally, the Christian minorities located in the south of Lebanon seeked Israeli support in view of leftist Palestinian coalition These conditions created a perfect opportunity for Israel to take control of what they called the 'security zone' which the Lebanese would call 'Israeli occupied territories'Therefore, in 1978, the region of South Lebanon was invaded by Israel as a response to Palestinian pressures in the region. In the same year, the domination of Israel over the region was clearly visible in measures such as curfew, checkpoints and military control of the region. The experience of the people in the south, and the feeling of being under Israeli occupation is visible across sources. People's freedoms there were restricted. === The realities of South Lebanon === The conditions of life in Southern Lebanon are directly linked to the outbreak of the Lebanese Civil War in 1975. Once the war started, the government lost control over the Lebanese territory. This area had a cultural mix of people with Christian and Muslim ethnicities and thus had problems with establishing one common representation. The left and Palestinian coalition were rather strong in this area and as mentioned the Christian minority when seeking for support reached for the Israeli one. However, in general the region was under the PLO's control. There was neither running water nor electricity and most telephone lines were destroyed. == Creation and Establishment == === The plan behind the SLA === Some arguments behind the creation of Israeli influences in Southern Lebanon can be found in Moshe Sharett's diaries, where he reflects on David Ben Gurion's idea of the creation of Christian State of Lebanon in 1954. These notes are studies by Augustus R.Norton who studied Sharett's diaries and personal documents. In his notes Sharett implies that: \"the only thing that's necessary is to find an officer, even just a Major. We should either win his heart or buy him with money, to make him agree to declare himself the saviour of the Maronite population. Then the Israeli army will occupy the necessary territory, and will create a Christian regime, which will ally itself with Israel. The territory from the Litani southward will be totally annexed to Israel and everything will be all right. [...]. (16/5/1954). \"The chief of staff (i.e., Dayan) supports a plan to hire a Lebanese officer who will agree to serve as a puppet so that the Israeli army may appear as responding to his appeal 'to liberate Lebanon from its Muslim oppressors\"(28/5/1954). These quotes can serve as a direct connection to the appointment of Saad Hadaad as the head of SLA. === Saad Haddad === Saad Haddad was a Lebanese Major, originally from Marjayoun of Greek-Catholic religion. Often described as a key actor in Israeli policymaking in Southern Lebanon. He was often described as an impulsive and emotional man, sometimes letting his emotions get out of control. He came to the South in 1976-1977 and became the leader of the SLA. In 1976 he took part in an intervention of the Syrian army and was an ardent opponent of the PLO and wanted to end the war in Lebanon. In January 1976, when the Lebanese were under the pressure of the ongoing civil war, the army started to break into factions: Muslim-led Lebanese Arab Army (LAA) with their allies such as PLO guerrilla factions and the Christian led army of Lebanon, with which Saad Haddad sided. He was reached by the Israeli officials and called to army headquarters in November 1976 transported to the South by a ship via Israel. In the end he reached Haifa where he discussed his role with Colonel Benjamin Ben Eliezer. Their conversation was mostly focused on the assurances that the salaries of the soldiers will be given on time and that they will be provided with good weapons. However, sources show that the soldiers had really low salaries in comparison to Jewish citizens in Israel, however in Lebanese standards were rather attractive. It is important to note that Haddad felt somehow rejected by the people from the east, who actually encouraged him to form some relationship with Israel. Haddad was to control both strategic points: Marijayound and Khiyam, that were both under the control of LAA. In October 1976 he seized Marijayound and declared the formation of 'Defense Army of South Lebanon'. Khiyam came under the influence of Haddad's militia where they robbed the village. His expansion continued towards the cities of Deri Mimes, Tel Lubia, Kafar Kila, Dibbin, and Adeisi. In December 1976 he was given an order to form an aggressive patrol against the civilians living in the city of Khiyam. When refusing an attack against civilians, he and his militia earned trust among the inhabitants of the region. Additionally, when in 1977 the pressures from the PLO and LAA increased, Haddad was forced to evacuate his people the village of Qlaiaa, just at the border with Israel, where they were under the protection of Israel. It was at this time in October 1976 that the Israeli defence forces formed from local Christian FLM, Shia Muslims and Druze militia and informal organisation of 'Army of Defense of South Lebanon' (ADSL), included under 'Free Lebanese Army' (later known as SLA) formed by Major Yoram Hamizrachi The governance over 'Free Lebanese Army' was given to Saad Haddad by Hamizrachi in June 1978. He governed the organisation until his death in January 1984. After his death, he was replaced by Antoine Lahad. === Antoine Lahad === Antoine Lahad was the successor of Saad Haddad. He was the leader of SLA between 1984-2000. Under his supervision of SLA its ties with Israel became even stronger and in majority was then a Shia army. Its existence and dominance was however threatened by the rising Hezbollah. So, gen.Lahad was forced to be dependent on the Israeli Defense Forces's support to ensure the existence of his militia. Hezbollah planned his assassination in 1988 and almost succeeded. 21-year old Suha Bashara shot him twice however he survived. She was later imprisoned in Khiam for 10 years due to the assassination attempt. In the year 2000, when Israeli forces withdrew from Southern Lebanon Antoine Lahad wasn't even consulted about it by the Israeli prime minister. After the withdrawal, he settled for a bit in Israel and later when allowed, he fled to France with his family. He died in 2015 in Paris. == The structure of SLA == The SLA compromised 2500 soldiers mostly of Shiite but also Christian, Druze and Sunni origin. The senior officers were in majority Christians. == Functioning of the SLA == === Khiam prison === The prison was located in the South of Lebanon, or in the so-called 'security zone'. It operated in the years of 1985-2000. The building in which it was placed was built during the French mandate. and was transformed into an interrogation centre after the withdrawal of IDF(Israeli Defense Forces) from Lebanon in 1985. It was the biggest place of torture and imprisonment in the area that was managed by the SLA however was fully under control of Israeli government and intelligence. The creation of such prison was the result of Israeli 'de-facto' control of the region. The people who were kept there were mostly those that were members of the organisations against the presence of Israel in Lebanon such as Hezbollah (militia that developed in Lebanon in the 1980s during the civil war). It was rather easy however to end up as a prisoner in Khiam. Of course some detainees were members of Hezbollah. It would suffice in some cases to refuse your son to join the SLA to become a prisoner. Those that were imprisoned there speak of it as being 'hell on earth' and in comparison to Khiam, other prisons were like luxurious hotels. The SLA soldiers who were present there could enter and leave the prison at any point. These SLA members stationed there were described as death-carrying group to the prisoners. The cells in the Khiam prison were located in cellars, so the prisoners were kept in complete darkness and cold, often left with chronic headaches, impotency, bad eyesight and other physical impairments . After 15 long years of occupation, Israel withdrew from Southern Lebanon between 23-25.05.2000. On the same day the Khiam prison's door were opened. The celebration of this 'liberation day' meant the mass return of people, heading back to their former villages. Khiam prison was a place massively visited by people, and became the symbol of the liberation. Its image was often used by Hezbollah's media campaign In the year 2000, the Khiam prison was turned into museum. This project was already thought through by former prisoner of Khiam and was made in cooperation with Lebanese ministries. Hezbollah however was a dominant force there, as the liberator of the south. Some claim that nowadays Khiam plays a role of an object displaying Hezbollah's domination During the 2006 Lebanese war Israel bombed the Khiam site, therefore destroying the museum. === Israeli position towards the Khiam prison === Israel abstains from acknowledging its influences in Khiam prison. For years, they have been stating that the SLA holds the main responsibility for the operation of Khiam prison. However, Israel remains the main contributor to the establishment and the functioning of SLA. Many testimonies of former prisoners also mention the notable presence of Israel in Khiam prison in which the Israeli soldiers were 'supervisors'. Nevertheless, Israeli spokesman still declares that \"Khiam prison belongs to the SLA and is under exclusive responsibility of General Lahad. The Israeli army is not involved in what happens within the prison walls and is only responsible for the actions of its forces in the security zone\" == 'The Security Zone' and the SLA (Military operations in the region and SLA) == === Operation Litani (1978) === a military operation launched by the Israeli Defence Forces (IDF) between 14.03-21.03.1978 in Southern Lebanon that aimed at invading this area. Its name comes from the name of the river Litani located in the South of Lebanon. It was a direct reaction of Israeli forces on the attack of the PLO members on a bus with Israeli citizens. 38 of them were killed. This operation aimed at limiting terrorist activities in Lebanon, . It is also pointed out that this operation was more of an act of revenge than a clearly thought through strategy. Its main principles can be summed up as the destruction of PLO and establishment of an extended security zone that would protect Israel from PLO attacks. In the end the operation was a failure. Israeli forces did not manage to capture the cities of Sidon and Tyre, mostly controlled by the PLO. The aim of the creation of a 'security zone' was somewhat achieved, however it couldn't be fully protected from the PLO attacks. The operation had very tragic results for the civilian population. Some estimate that IDF killed around 2000 Lebanese civilians, others that around 1.100 Lebanese and Palestinian civilians were killed. Once the operation ended, the UN Security Council passed the resolution that urged Israel to withdraw from Lebanon. The IDF withdrew, but only until the border of the 'security zone', that was to be controlled by the IDF and Haddad's militia that at the time took its most recent name - The South Lebanon Army. === Operation Peace for the Galilee (1982) === After the Litani Operation, which led to Israel having more influence over the 'security zone' and support in the established South Lebanon Army, its fights with the PLO became more frequent and SLA's efforts to secure 'the security zone' were unsuccessful. In 1981 the situation became so serious, that Israel launched a military invasion of Lebanon in 1982, which they called 'Operation Peace for the Galilee'. The Israeli forces managed to reach Beirut and occupy part of the city. The mass killing of Lebanese and Palestinian civilians grew significantly. An important moment in these events was 'The Sabra and Shatila massacre' in Palestinian refugee camps where around 3000 Palestinians and Lebanese civilians from the refugee camps were murdered by the Israeli forces. As Israel was losing more and more soldiers in this operation, the Israeli parliament (the Knesset) pressured the withdrawal. After all, in 1985 the IDF withdrew from Lebanon. However, the area still remained under the influence of Israel. This was the result of its apparent connection to the SLA and the continuous existence of 'the security zone'. This zone consisted of 10% of Lebanese territory and was supposed to play the role of neutral territory which would lower the amount of tensions in the region. The IDF withdrawal was actually not as strict and its members still were present in the south. The operation had serious consequences for the balance of power in Southern Lebanon. After Israeli intervention, the PLO was forced to move its headquarters to Tunis. However, during this time the Shiite organisation of Hezbollah was formed, that later became the biggest danger to IDF domination in southern Lebanon. === IDF (Israeli Defence Forces) fighting for domination (1985) === In 1985 a pro- Syrian government won the election in Lebanon. This meant that its main aim was to minimise the influences of Israel in the region. This new situation motivated many humanitarian missions sent by Israel to Southern Lebanon which aimed among others at the restoration the infrastructure, telephone lines and medical centres. These were a kind of response to the growing interest of Lebanese government in regaining influences in the South of the country . == Israeli withdrawal, SLA collapse and surrender == === The background and official withdrawal === The story of withdrawal of Israel from the Southern Lebanon starts in 1999, when the Israeli prime minister Ehud Barak promised to withdraw IDF from Lebanon. The official operation for Israeli soldiers to withdraw from the 'security zone' was planned to happen in the year 2000. However, the SLA at the time became less and less influential and was pushed back by the rising power in the region, the organisation of Hezbollah. SLA therefore had an adversary that rose in power and its biggest ally was about to leave the territory of southern Lebanon. Apparently, UN pressured Israel to soften its ties with SLA when backing up from the security zone. So, SLA was left facing Hezbollah === SLA after Israeli withdrawal === After the withdrawal of Israel, Hezbollah became the major power in the region. It is important to mention that Hezbollah, but also the Lebanese citizens in general, viewed the SLA as equal to Israeli forces. Although there were some reports of executions of SLA members by Hezbollah, unlike many terrorist predicted there was no slaughter or widespread mass killings against the SLA. In large the Southern Lebanon Army surrendered. Those that surrendered to Hezbollah were turned to trial under Lebanese government. The violent talks about former SLA members were mostly discursive in nature, to highlight the collapse of the pro-israeli organisation. The former weapons of SLA were captured by Hezbollah and later it claimed to transfer these weapons to the Lebanese government === Former SLA members === The fate of former SLA members was not easy. After the collapse of the organisations they could have surrendered to Hezbollah, Lebanon Armed Forces or Lebanese police. Those that stayed in Lebanon were either Shia or Sunni muslims, so Hezbollah, being a Shia organisations, had some doubts of religious background to massacre these members. Most of them were imprisoned in Beirut and accused of collaboration with Israel. The trials were quick and were not to be appealed. The sentences of imprisonment varied from 1 month to 5 years. So in general the sentences were light. The Lebanese government wanted to seem merciful in the eye of the public. Although, two members of SLA accused of torturing people in Khiam prison received a life sentence and 21 members received a death penalty. However, many former members fled to Israel, especially the high-ranking officials. A huge number of SLA memberd fled to Israel on the day of the withdrawal.Those highly-raking officials were mostly Christian officers. Israeli state redistributed them to the cities around the Galilee river, provided them with work permit and a possibility to apply for Israeli citizenship after 1 year of residence. However, state surveys showed that the majority of those SLA members wanted to move elsewhere abroad and little of them wanted to settle down in Israel == Bibliography == Category:Armies Category:Lebanese Civil War",
 "title": "South Lebanon Army"
}