{
 "id": "1107513",
 "text": "A Cartoon villain is a villain in animation. == History == Even though the Little Nemo comics had an antagonist named Flip, Winsor McCay left him out of the animation based on it in 1911. But in 1912, McKay made a cartoon called How a Mosquito Operates where the mosquito is dressed like a person and blows up after drinking too much of a human’s blood. In 1925, Walt Disney created Pete as a villain for his cartoons. In the early 1930s, Max Fleischer and his brother Dave Fleischer made a cartoon based on the Popeye comics and they had a villain named Bluto. In 1933, Walt Disney made a cartoon of The Three Little Pigs with the Big Bad Wolf as its villain. The Looney Tunes also had villains like Elmer Fudd, Yosemite Sam, and Marvin the Martian. In 1937, Disney made a movie called Snow White and the Seven Dwarfs with the Evil Queen as a villain. Since then Disney made a lot of movies with villains. == Saturday morning cartoons == There were also a lot of villains in Saturday Morning Cartoons like Dick Dastardly from Wacky Races and Snidely Whiplash from Dudley Do- Right. Scooby-Doo also had a lot of villains. == Primetime animation == The Jetsons had a character named Mr Cogswell as a villain. == 1980s cartoon villains == In the 1980s, there were a lot of cartoons that were made to sell toys. One was called He-Man and the Masters of the Universe, which had a villain called Skeletor. Another was called Transformers, which had a villain called Megatron. == Adult animation == Adult animation also has villains like Mr. Burns from The Simpsons and Eric Cartman from South Park. == Sympathetic cartoon villains == Some cartoons have villains that the audience is supposed to feel sorry for like Sheldon J. Plankton from SpongeBob SquarePants and Dr. Doofenshmirtz from Phineas and Ferb. Denzel Crocker from The Fairly OddParents isn’t usually a sympathetic villain but the episode The Secret Origin of Denzel Crocker had him be one. Category:Villains Category:Animation",
 "title": "Cartoon villain"
}