{
 "id": "1107515",
 "text": "The Meitei people (), also called Manipuri people (), is one of the minority ethnic groups in Assam. They are referred to as Mekhlee, Mekhelee, Meckley, Monipuri, Monipuriya, Magalu, Mogolu, Moglie, Moglai, among many other names dedicated to them by the other people of Assam.Historical and Cultural Relations Between Manipur, Assam, and Bengal. India: Manipuri Sahitya Parishad, 1986. Meiteis call Assam as \"Tekhao\" or \"Tekhau\" or \"Tekhaw\" ().Manipur, Past and Present: The Heritage and Ordeals of a Civilization. India: Mittal Publications, 1988. p. 20-22, 115 == History == In the 16th century, the kings of Tekhao (Meitei language term for Assam) and Manipur had friendly relations. This friendship grew stronger after a route to Assam opened in 1536-37, leading to more social and cultural exchanges, as well as people moving between the regions. Meitei people started settling in Assam after a royal marriage in 1537.Manipur, Past and Present: The Heritage and Ordeals of a Civilization. India: Mittal Publications, 1988. p. 20-22, 115 When Burmese King Bayinnaung of the Toungo dynasty captured Manipur kingdom during the reign of Meitei King Mungyamba (, 1562-1597), many people left Manipur. This movement continued until September 18, 1891. The emigrants from Manipur had to choose one of the routes through the hills, either Tongjei Maril () or Akhui routes. The lower plains of the Surma valley (also known as Barak valley) were good places for the Meitei people to settle because of their favorable geography, politics, and economy.Manipur, Past and Present: The Heritage and Ordeals of a Civilization. India: Mittal Publications, 1988. p. 20-22, 115 In Assam’s history, a Meitei princess named Kuranganayani (), the queen of Assamese King Swargadeo Rajeshwor Singh, became a heroine when she killed a rebel named Raghav Moran with a sword in 1769. Historian S.K. Bhuyan says she is honored among Assam’s heroic women. Another royal marriage happened after the death of Swargadeo Rajeshwor Singh, when his brother Swargadeo Lakshmi Singh married a Meitei princess. These events led to more Meitei people settling in Tekhao (Assam).Manipur, Past and Present: The Heritage and Ordeals of a Civilization. India: Mittal Publications, 1988. p. 20-22, 115 One reason for the Meitei settlement in the Barak Valley is a conflict in 1604 between King Khagemba () and his youngest brother Sanongba () over a minor issue involving a broken boat. Khagemba fled to Cachar with two generals, Yakharek () and Bhimbol (). This event led to the Meiteis settling in Cachar, also known as the Barak Valley.Manipur, Past and Present: The Heritage and Ordeals of a Civilization. India: Mittal Publications, 1988. p. 20-22, 115 Another reason is a matrimonial alliance recorded in 1720. Raja Ram Chandra Narayan, the ruler of Cachar, married Rani Projabati Devi (), a Meitei princess. During Ram Chandra’s reign, the capital of Cachar was Khaspur. The Meitei attendants of Princess Meitei Chanu Projabati Devi began to settle permanently in Cachar.Manipur, Past and Present: The Heritage and Ordeals of a Civilization. India: Mittal Publications, 1988. p. 20-22, 115 During the rule of Meitei King Chitsai (), some Meitei people had to move to Cachar because of political exile. King Chitsai and his followers were forced to live in Cachar from 1752, after the assassination of Meitei King Pamheiba (), also known as Garibnawaz.Manipur, Past and Present: The Heritage and Ordeals of a Civilization. India: Mittal Publications, 1988. p. 20-22, 115 Meitei King Bheigyachandra (, 1759-1758) lost and regained his power four times. After each Burmese invasion, he had to flee with his followers. Because of his frequent need for political asylum, the emigrants formed a network.Manipur, Past and Present: The Heritage and Ordeals of a Civilization. India: Mittal Publications, 1988. p. 20-22, 115 Meitei King Modhuchandra () ruled from 1800 to 1803. In 1803, his brother Chaurajit () overthrew him. Modhuchandra then sought refuge in Cachar with his family and followers. In 1806, he arranged for his daughter to marry King Krishnachandra () of Cachar.Manipur, Past and Present: The Heritage and Ordeals of a Civilization. India: Mittal Publications, 1988. p. 20-22, 115 == Language and scripts == Meitei language (), also known as Manipuri language (), is one of the official languages of the state government of Assam. It serves as the additional official language in all the three districts of the Barak Valley (Cachar district, Hailakandi district and Karimganj district) as well as in the Hojai district of the Brahmaputra Valley of Assam. In 2024, the State Cabinet of the Government of Assam approved the Meitei script to be used in the education of Meitei language across all the academic institutions of Assam, to help the students interested in the Meitei literature (also known as Manipuri literature) to know better about the subject. A unique form of writing system called \"Meetei Yelhou Mayek\" (), totally different from the general Meitei script, was developed by Naoriya Phulo () in Cachar, Assam, to write Meitei language in particular cases. == Culture == === Agriculture === There is a Meitei agricultural institution named Loungak Marup (), having the primary aim to save agricultural lands and depreciate selling of land to other people. === Cinema === === Literature === === Religion === Lai Haraoba () dedicated to the Umang Lai () deities is common among the Assam Meiteis. Goddess Panthoibi () is also commonly worshipped by them. == Groups == === Development council === Inspired by the development of the autonomous councils for Karbi and Bodo ethnicities, the Meiteis living in Hojai developed the \"Manipuri Development Council\" with the approval of the Government of Assam, after two rounds of protests against the government in front of Assam State Assembly. During the 2012 financial year, the Government of Assam gave Rs 1.50 lakh to the Manipuri Development Council. For the 2013 financial year, they gave Rs 2.30 crores for the same. The development council is run as an ad-hoc committee. Many Meitei candidates were elected in Panchayat elections. == Related articles == * Meitei people in Bangladesh * Meitei people in Myanmar == Notes == == Bibliography == * Historical and Cultural Relations Between Manipur, Assam, and Bengal. India: Manipuri Sahitya Parishad, 1986. * Vaghaiwalla, R. B.. Assam, Manipur and Tripura. India: India Office House, 1953. * Encyclopaedia of Indian Tribes: Assam & Manipur. India: Anmol Publications, 1994. * Tribes of Assam and Manipur. India: Anmol Publ., 1997. * Kshetri, Rajendra. The Emergence of Meetei Nationalism: A Study of Two Movements Among the Meeteis. India: Mittal Publications, 2006. == References == == Other websites == Category:Meitei people Category:Assam",
 "title": "Meitei people in Assam"
}