{
 "id": "1107516",
 "text": "The Meitei language (), officially and formally known as the Manipuri language (), is one of the official languages of the state government of Assam. It serves as the additional official language in all the three districts of the Barak Valley (Cachar district, Hailakandi district and Karimganj district) as well as in the Hojai district of Assam. == History == Meitei speaking people started living in Assam as a result of migration from Manipur due to the Chahi Taret Khuntakpa (literally, Seven Years' Devastation). == Geographical distribution == Meitei language speakers live in all the three districts of the Barak Valley, Cachar, Hailakandi and Karimganj districts, as significant minority population. According to the Ethnologue, it also has a notable presence in Dima Hasao district, besides those of the Barak Valley. It also has a notable presence in the Hojai district of Assam. == Writing systems == === Meitei Mayek script === In 2024, the State Cabinet of the Government of Assam approved the Meitei script to be used in the education of Meitei language across all the academic institutions of Assam. It was done to help the students interested in the Meitei literature (also known as Manipuri literature) to know better about the subject. === Meetei Yelhou Mayek script === A unique form of writing system called \"Meetei Yelhou Mayek\", distinct from the general Meitei script, was developed by Naoriya Phulo in Cachar, Assam. This script was used to write Meitei language in certain cultural contexts. == Language movements == In Assam, many people had organised a language movement, demanding that Meitei language be made one of the official languages of Assam, besides Assamese language. As a part of the movement, in 2023, they walked more than 300 km long march, as a sign of protests demanding their democratic rights. In the same year, Leishemba Sanajaoba, the titular king and an Indian member of Parliament of Manipur, wrote a letter to the government of Assam, to look into the matter. In 2024, the government of Assam approved the request, by declaring Meitei as the additional official language of four districts of Assam, namely Cachar district, Hailakandi district, Karimganj district and Hojai district. Meitei speaking people from Assam also work on the language movement demanding that Meitei be given the officially recognised classical language status by the Union Government of India. == Education == The Board of Secondary Education, Assam (SEBA) and the Assam Higher Secondary Education Council (AHSEC) provides Meitei language education in the schools of Assam. Assam University of Silchar has a \"Department of Manipuri\", providing education upto PhD degrees. Gauhati University also provides Meitei language education as an independent subject. == Literature == Starting from 2020, the Government of Assam provides a financial support of every year to the Manipuri Sahitya Parishad, a group that works for the development of Meitei literature (also called Manipuri literature) in Assam as well as other Meitei populated states. Moreover, the government also gave for the development of Meitei language corpus. == Language day == In Assam, Manipuri Language Day, also known as Meitei language day, is celebrated, like it is done in other states every year. The event is celebrated to honour the day on which Meitei was made an official language recognised by the eighth schedule to the Constitution of India. The notable groups that celebrate the event are Manipuri Sahitya Parishad, Asam Sahitya Sabha, Department of Manipuri of Assam University. == Movies == Meitei language movies are often shown in different film festivals in Assam, including the Brahmaputra Valley Film Festival (BVFF), in Guwahati. In 2023, a Meitei language movie named \"Nine Hills One Valley\", directed by Haobam Pabankumar, was shown in the event. \"Phisakhol\" () is the first Meitei language movie having its initial release in the Silchar city of the Barak Valley in Assam. == Related articles == * Meitei classical language movement * Meitei linguistic purism movement * Meitei poetry day (Manipuri poetry day) * Meitei associate official language movement * Meitei scheduled language movement == Notes == == References == == Other websites == Category:Meitei culture Category:Assam",
 "title": "Meitei language in Assam"
}