{
 "id": "1107511",
 "text": "Meitei people (), also known as Manipuri people (), is one of the minority ethnic groups of Bangladesh. They live mostly in the Sylhet region of the country. == History == Meiteis moved to Bangladesh at different times because of wars, conflicts, and other reasons. They started moving during the rule of Meitei King Ching-Thang Khomba, also known as Rajarshi Bhagyachandra (1764-1789). The Manipur-Burma War (1819-1825) made more people leave. After the war, the Burmese ruled Manipur for about seven years (Chahi Taret Khuntakpa). During this time, King Chourajit Singh and his two younger brothers, Marjit Singh and Gambhir Singh, went to Sylhet. Many Manipuri people followed them. A palace was built for them in Mirzajangal, Sylhet town. During this time, Meitei people settled in Kasba of Brahmanbaria, Durgapur of Mymensingh, and Tejgaon of Dhaka. But now, these places are not special Meitei settlements. Most Meitei people now live in Sylhet town and its nearby areas, and in Kamalganj, Sreemangal, Kulaura, and Barlekha areas of Maulvi Bazar district; Chunarughat area of Habiganj district; and Chhatak area of Sunamganj district. Banglapedia mentions \"According to the 1991 Population Census, there are about 25,000 Manipuris in Bangladesh. Of them about 13,000 are in Maulvi Bazar, 7,000 in Sylhet and 4,000 in Habiganj.\" == Language == There are possible signs of extinction of Meitei language (Manipuri language) from use in the next generation as the Meiteis started becoming more fluent in speaking Bengali than their own language. == Culture == Meiteis enjoy polo (), boat race (), drama and dancing (). === Agriculture === Most Meiteis are farmers and grow rice, sugarcane, tobacco, oranges and pineapples. They usually built their houses near the riverbanks. === Cuisine === Meiteis do not consume meat, except fish. === Festivals === Meitei festivals like Lai Haraoba and Ningol Chakouba are celebrated by the Meiteis of Bangladesh. === Matrimony === Meiteis do not marry a person of their own clan. So, they marry people of other clan. === Monuments === ==== Manipuri Rajbari ==== Meitei kings built many temples for Meitei gods and goddesses, including those of God Nongshaba, God Pakhangba and Goddess Yumjao Lairembi notably in the Manipuri Rajbari in Lama Bazar of Bangladesh. Moreover, there are palaces and tombs of the Meitei royalties in the Manipuri Rajbari of Lama Bazar.Sana, Raj Kumar Somorjit (2010). The Chronology of Meetei Monarchs: From 1666 CE to 1850 CE. Waikhom Ananda Meetei. pp. 300, 301. ISBN 978-81-8465-210-9.Sanajaoba, Naorem (1988). Manipur, Past and Present: The Heritage and Ordeals of a Civilization. Mittal Publications. p. 172-175. ISBN 978-81-7099-853-2. ==== Proposed monuments ==== The construction of a statue of Meitei King Gambhir Singh at Rajbhari, Sylhet, Bangladesh, Guest House at Raj Bad, Sylhet, Bangladesh, and a museum for Meitei King Marjit at Kamalganj, Moulvi Bazar, Bangladesh, are proposed by the United Committee Manipur to the Chief Minister of Manipur. === Performing arts === Dance is an important part of the Meitei cultural heritage. Traditional dances include Lai Haraoba, Khamba-Thoibi, Maibi Jagoi and Leishem Jagoi. Classical dances include Rasa, Gostha leela, Udukhol and Mridanga. Thabal Chongba is also common among the Bangladeshi Meiteis. === Religion === Bangladeshi Meiteis are mostly Hindus but also practise traditional Meitei religion. The Lainingthou Sanamahi Temple Board (LSTB) is about to build a temple dedicated to traditional Meitei deity, Sanamahi, in Kunagaon of Bangladesh. === Sports === Bangladeshi Meiteis enjoy polo (), boat race (), among many. == Groups == * Bangladesh Manipuri Sahitya Sangsad == Related articles == * Meitei people in Myanmar == References == Category:Meitei people Category:Bangladesh",
 "title": "Meitei people in Bangladesh"
}