{
 "id": "1107075",
 "text": "Ryōko Ishida (born 1974 or 1975), was a Japanese high school student who attended Takatsuka High School in Kobe, Hyōgo. She was killed when attempting to dash through a closing entrance gate to avoid tardiness penalties; sparking national discussion about the pressures faced by students in Japan. == Incident == On the morning of July 6th, 1990, Ryōko and a friend, later called 'Girl A' in subsequent media reports, were running late during their morning commute to school. At approximately 8:30 a.m., one of the teachers who had been assigned to watch for arriving students, Toshihiko Hosoi, 39, began to close the school gate after the morning bell had rang. A separate group of students stopped short of the gate, realizing they could not pass, when Ryōko and Girl A ran up behind them. As the gate was still sliding shut, both girls went around the group of students in an attempt to dash through the entrance before it closed. Realizing there was not enough time, Girl A also stopped short of the gate, but Ryōko did not. She ran forward and attempted to squeeze through the opening, only to have the closing gate slam her head between the rails and a concrete wall, causing massive skull and brain injuries. The gate was about 6m long, 1.5m high, and weighed roughly 230kgs (1/4 of a ton). After being struck, Ryōko fell and began convulsing as nearby panicked students attempted to free her. Hosoi mistook the students commotion for delinquent efforts to avoid lateness penalties and began reprimanding them as he approached, not yet realizing that Ryōko was injured. When he realized that a student had been hurt, the gate was moved and emergency services were called to the scene. Ryōko was brought by ambulance to Kobe University Hospital where she passed away at around 10:30 a.m., about two hours after she was struck. == Aftermath == Throughout the remainder of the day, school continued as normal and students were expected to complete their final exams. When teachers were asked about Ryōko's condition, they assured students that her injuries were not life threatening. When the police arrived to investigate, they found that staff from the school had already used a hose to wash away most of Ryōko's blood, hindering their investigation. In response to the subsequent news of her death, an assembly was held the following day in which the school's principal blamed the incident on tardiness and urged students to rethink their behaviour when commuting to school. In his speech, the principal used the nature of Ryōko's death as a catalyst to reprimand and frighten other late students, as well as to impose blame on the victim's actions rather than that of the offender, saying \"if you would just leave ten minutes early, the tardiness problem would go away\". In later reports, the school board maintained that the incident was between the student and the teacher and that the school was not to blame for Ryōko's death. Toshihiko Hosoi was subsequently charged with manslaughter in the death of Ryōko Ishida. In his defence, he blamed the school board and department of education for lack of proper safety procedures and instilling excessively strict regulations for disciplining late students. He also stated that he could not have predicted that a student would try to make it through the gap before the gate had been closed. However, later testimonies revealed that students skirts and bags would frequently become caught in the closing gate as they tried to dash through, proving that Hosoi was aware of the behaviour and its related dangers. The Kobe District Court found Hosoi guilty of manslaughter in the death of Ryōko Ishida and sentenced him to three years of probation. He was also stripped of his teaching license and terminated from his position at Takatsuka High School. The nature of Ryōko's death ignited a national conversation about the pressures faced by students in Japan and highlighted the lengths that young people felt they had to go to in order to be considered upstanding. ==References== Category:1970s births Category:1990 deaths Category:Accidental deaths Category:Japanese people",
 "title": "Ryoko Ishida"
}