{
 "id": "1107687",
 "text": "Topeka High School (THS) is a public high school in Topeka, Kansas, United States. It has students in grades 9 to 12, and is one of five high schools in the Topeka USD 501 school district. In the 2010–2011 school year, there were 1,840 students in the school. Topeka High School was made in 1871, and moved to its current location in 1931. At the time, it was included in the first million dollar high schools that was west of the Mississippi River. Topeka High has a lot of sports and extracurricular activities, and notable alumni include Charles Curtis, 31st Vice President of the United States. ==History== ===Early history=== The Topeka Board of Education made Topeka High School in 1871, and the first classes were on the 3rd floor of Lincoln College (now Washburn University) at the time located where the GAR Memorial Hall is currently. Over the next 10 years, the school was moved to many locations, including the Washburn Building at 10th and Jackson, and a room above the Topeka YMCA and the Daily Capital newspaper. In 1882, the first black student graduated from Topeka High. Attendance continued to move beyond the capacity of the school facilities, and in 1894, a new school was completed on the northwest corner of 8th and Harrison, and it cost $85,000. Topeka High School's student population had reached 1,000 by 1903, and a decision was made to build a Manual Training High School across the street on the southwest corner of 8th and Harrison, and it cost $100,000. One third of the new building would be for manual training, and the rest will be used for academic classes. In 1915, a theater and cafeteria were added to the north school, and the old theater was converted to classes. Soon after, a portable building was constructed to serve as a study hall and library, and in 1923, an administration building known as 'The Annex' was added to the west side of the south building. In 1921, Topeka High's cafeteria cook Ida M. Moyer was declared \"Champion Pie Baker of the World\". Over the previous 6 years, Moyer had baked 37,248 pies. ===Current location era=== Overcrowding was a big problem at the new facility, and was worse in 1924 when Topeka's Fire Marshall closed the school's 4th floor, calling it \"the biggest fire trap in the city\". A committee planning the construction of a new high school recommended that one large school be built, and that it's the size of an entire city block. They wanted it to be \"an addition to the City's public buildings, and not just another building\". Bishop James Wise offered to sell the grounds of Bethany College and other church property for a price of $142,000, and in 1928, Topeka voters approved issuing bonds of $1.1 million ($14 million in 2014 adjusted for inflation) to fund construction of the new Topeka High School. Thomas Williamson (an alumnus from 1907) and Ted Griest were selected as architects, and Linus Burr Smith as designer. Construction of the new school took 18 months, and the total cost was $1.8 million. The school opened in September 1931, and there were 2000 students enrolled by the following year. A spar from the USS Constitution (\"Old Ironsides\") was gained with the assistance of Vice President Curtis, and mounted on a nautical base in the plaza to serve as a flagpole. It was dedicated in October 1931. After years of wear, a replacement spar, also from the USS Constitution, was installed in 2004. Topeka High's 'Hoehner Auditorium' was selected as the site for the inauguration of Kansas Governor Payne Ratner, on January 9, 1939. In 1957, Time and Newsweek listed Topeka High among the 38 best schools in the nation. Two new high schools helped calm the crowded conditions at Topeka High: Highland Park High School was combined into Topeka in 1958, and Topeka West High School was completed in 1961. Restructuring of the district curriculum meant that in 1980, students in the 9th grade would begin attending high school. In 1984, Topeka High installed a computer-assisted automated calling device which called home each time a student was very absent. Principal Ned Nusbaum commented, \"It's been a very effective tool for getting kids into class\". The US Department of Education recognized Topeka High as a \"School of Excellence\" in 1989. In 2001, Topeka High awarded an honorary diploma to the Honorable Eric S. Rosen, Justice, Kansas Supreme Court—a longtime supporter of the school. The school celebrated its 75th anniversary at its current site on September 17, 2006. In 2007, Topeka High School was ordered to stop providing free condoms to students, as it was contrary to school district policy. The annual Martin Luther King event, sponsored by the state of Kansas, took place in Hoehner Auditorium in 2012. Topeka High is located near the Statehouse, and the governor's celebration at the new venue was well received. ==Campus== The 1931 campus is a three-story Gothic building of almost 278,000 square feet designed by Thomas W. Williamson, a 1907 graduate of Topeka High School. Architecture includes a bell tower, which is 165 feet over the main building entrance and contains an 18-note tower chime. In 1974, the tower was rededicated in honor of Thomas Williamson. The library was modeled after the Great Hall at Hampton Court Palace. The school building contains 4 fireplaces, and a greenhouse built in the late 1970s. In 2000, the school installed air conditioning. Topeka High School was listed on the National Register of Historic Places in September 2005. with ==Academics== In 1988, Topeka High School was selected as a Blue Ribbon School. The Blue Ribbon Award recognizes public and private schools which perform at high levels or have made huge academic improvements. Six percent of Topeka High's enrollment comes as transfer students. Students outside the attendance zone come to the school for its strong fine arts program, including a music program (jazz band, drum line, wind ensembles, orchestra, and concert choirs,) its forensic and debate teams, as well as its foreign language program, which offers Spanish, German, Mandarin, and French. THS also supports a Marine Corps JROTC drill team (1999–present). ===Journalism=== The school newspaper, The World, is a member of the High School National Ad Network. The school yearbook is \"The Sunflower\". Both publications are members of JEA and NSPA. Topeka High, under the former direction of Richard Green, has also built up its broadcast journalism program. The Newsdesk a bi-monthly news broadcast showcasing student news and feature packages. Under the direction of Green, The Newsdesk has won multiple statewide broadcasting awards. \"The Newsdesk\" is filmed on campus in \"The Tom Browne Memorial News Room\". ==Debate and Forensics== Topeka High has a strong tradition of debate and forensics throughout its history. The school has qualified nearly 180 competitors to the National Tournament of the National Speech and Debate Association and before 2013, had qualified students every year for 33 straight years. The school has 6 national champions, more than any other school in the Flint Hills. The debate squad has won 4 state championships, finished second 6 times, and third place twice. The forensics squad has 12 state championships, with 7 straight championships from 1995 to 2002. Topeka High forensics has 40+ individual 6A State Speech champions. The Debate and Forensics squad is coached by Dustin Rimmey. ==Students== Students come from USD 501 middle schools, including: Robinson, Jardine, Landon, Eisenhower and Chase. Six percent transfer into THS from outside the Topeka Public Schools district, such as other school districts or parochial schools. The senior class of 2011 had 370 students, and more than 80% enrolled in some kind of post secondary education. More than $1.2 million in scholarships were awarded to Topeka High seniors in 2005. ===National merit scholars (1999–2005)=== The National Merit Scholarship Program is a college scholarship competition that includes taking the PSAT/NMSQT. The school has had 19 Semi- finalists, 35 Commended Scholars, 7 National Achievement Scholars, 3 Corporate Sponsor Merit Scholars, and 3 Hispanic Scholars. ===Foreign exchange programs=== Ten to fifteen students per year go to Topeka High from countries such as Belgium, Turkmenistan, Japan, South Korea, Turkey, Germany, Thailand, Brazil, Switzerland. Students are sponsored by the following exchange programs: AFS, AIFS, ASSE, CHI, AYUSA, ERDT, WISE, ISE, and Share. ==Traditions== Running of the halls: During first period of days that THS has a home football game, the students gather in the halls of Troy, cheerleaders and the drill team, flag team, and marching band march through the halls to boost school spirit. ==Extracurricular activities== The school has many extracurricular activities, including performing arts, school publications, and clubs. ===Athletics=== The school teams are known as the \"Trojans\", and are ranked as a 6A school, the largest rank in Kansas according to the Kansas State High School Activities Association. Throughout its history, Topeka High has won 30 state championships in many sports. Many graduates have gone on to participate in college sports. ====Boys' Basketball==== An important part of the school's men's basketball history was the 1949 separation of the basketball teams between black and white players. Steve Fry, '49 basketball teams segregated, cjonline.com, Posted: October 10, 2009 White basketball players were on the Trojan team, and black athletes were on the Rambler basketball team. There were two different cheer-leading teams. While classes were integrated, blacks didn't have equal representation on the student council and separate school parties were held for black couples and white couples. The first black Topeka High basketball team, the Cardinals, started in 1929, and the Ramblers started in 1935. In 2009, the school looked back at the historic separation of the teams. Former UNC coach Dean Smith came back with a number of others that were associated with the Ramblers to discuss the team's history. There is no separation of the teams now, and is currently one of the most diverse basketball teams in Topeka. In the 2009–10 basketball season, they were shown to be a lot stronger than past seasons after beating town rival, Highland Park High School, the defending state champions for the past three years. ===State championships=== State Championships Season Sport Number of Championships Year Fall Cross Country, Boys 3 1950, 1952, 1953 Soccer, Boys 1 1997 Winter Basketball, Boys 3 1932, 1973, 1986 Basketball, Girls 2 1981, 1982 Swimming, Boys 1 1934 Spring Golf, Boys 7 1929, 1931, 1934, 1935, 1937, 1949, 1961 Baseball 1 1947 Softball 2 2021, 2022 Track and Field, Boys 6 1916, 1948, 1956, 1963, 1973, 2013 Track and Field, Girls 2 1974, 1975 Tennis, Boys 10 1931, 1932, 1933, 1935, 1936, 1943, 1948, 1976, 1977, 1989 Total 38 ==Notable alumni== * Nancy Kassebaum Baker, former U.S. Senator from Kansas, 1978–1996 * Chris Barnes, professional bowler * Bill Bunten, mayor of Topeka from 2005 to 2013 * NiJaree Canady, class of 2022, softball player * Charles Curtis, 31st Vice President of the United States (attended, but did not graduate) * Rich Davis, class of 1944, founder of KC Masterpiece barbecue sauce * Aaron Douglas, artist during the Harlem Renaissance * Jean Dubofsky, class of 1960, first woman to become a Colorado Supreme Court Justice, lead attorney in Romer v. Evans which overturned Colorado Amendment 2 in the US Supreme Court, resulting in a landmark ruling for LGBT rights in the United States * Clarence T. \"Curly\" Edwinson, decorated World War II fighter pilot, collegiate football star and world champion skeet shooter * Bree Elrod, actress, Red Rocket * Elizabeth Farnsworth, television news anchor * Ruth Garver Gagliardo, advocate for library services for children * Aulsondro Hamilton (aka Emcee N.I.C.E.), class of 1990, musician, actor * Coleman Hawkins, prominent jazz tenor saxophonist * Jane Heap, significant figure in development and promotion of literary modernism; edited The Little Review with her partner Margaret Caroline Anderson * Teven Jenkins, offensive tackle for the Chicago Bears * Gordon Jump, actor, WKRP in Cincinnati * Ben Lerner, poet and author * Lutie Lytle, pioneering African-American lawyer and first woman in North America to teach at a chartered law school (Central Tennessee University School of Law, 1898–99) * Eric McHenry, poet * Kirke Mechem, class of 1943, composer of Tartuffe and other works * Karl and William C. Menninger, co-founders of Menninger Foundation * Travis Schuldt, actor on Scrubs and Passions * Brig Gen Howard S. Searle, responsible for rebuilding Kansas Army National Guard after World War II * Warren W. Shaw, judge; Eisenhower staff member during World War II; representative in Kansas House of Representatives; and 1956 Republican nominee for Kansas governor * John Brooks Slaughter, first African-American director of the National Science Foundation * Dean Smith, head basketball coach at University of North Carolina, 1961–1997; member of College Basketball Hall of Fame * Rex Stout, mystery novelist *Bradbury Thompson, graphic designer * Mike Torrez, retired Major League Baseball pitcher * Thomas Williamson, class of 1907, architect * Max Yoho, class of 1953, Kansas author * Jayne Houdyshell, class of 1974, stage, film and television actress ==Notable faculty== * Marie L. French, received the National Teacher of the Year Award from President Kennedy in 1962 * Margaret Hill McCarter, teacher and novelist; first woman to speak at a Republican National Convention * Marilyn L. Miller, president of the American Library Association * Duane Pomeroy, Kansas politician * Howie Shannon, professional basketball player and coach ==References== ==Other websites== * Category:1871 establishments in Kansas",
 "title": "Topeka High School"
}