{
 "id": "1108748",
 "text": "The Greenland Ice Sheet (Greenlandic: Sermersuaq) is a large ice sheet that covers about 80% of the surface of Greenland, part of Denmark. It is the second largest in the world, after the Antarctic ice sheet. It covers 1.71 million km² and measures almost 2,400 kilometers from north to south and a maximum of 1,100 kilometers from east to west at latitude 77° N, near its northern edge. The average altitude of the ice is 2,135 meters. The average thickness is more than 2 km and in its thickest part more than 3 km. It is not the only ice mass in Greenland as it exists on the periphery of the island remote glaciers and small icefields of beetwen 76,000 and 100,000 km². Some scientists believe that due to global warming, the ice cap is sliding toward the coast and that the entire ice sheet will melt in less than a few hundred years: Its 2.85 million km³ of ice would raise sea level by 7.2 m which would flood most of the coastal cities in the world and bury several archipelagos and countries such as the Maldives or Tuvalu which have a inner maximum highness at said level. The conflict for these beliefs is that the Greenland weather stations, like the one shown here, are not affected by the thermal stain of cities, recording the truth of the hinterland no cooling or warming trends, despite extraordinarily poor data record (Greenland's climate is at least 9 to 11 millennia long, and the recorded data is less than 1% of the period). The ice in the current ice sheet is about 110,000 years old, however, the Greenland Ice Sheet is thought to have formed in the late Pliocene or early Pleistocene by the process of coalescence (union) of polar caps and glaciers. It did not fully develop during the late Pliocene. During the first continental glaciation it consolidated and grew very quickly. The great weight of the ice has depressed the central area of Greenland so that the rock surface approaches sea level in most of the interior of Greenland and the mountain ranges they rise only on the periphery, confining the ice layer. If the ice disappeared, Greenland would probably become an archipelago. ==Related pages== * Ice sheet * Iceberg * Glacier Category:Greenland Category:Ice",
 "title": "Greenland ice sheet"
}