{
 "id": "1108459",
 "text": "Real Madrid hold the record for the most titles (24). Milan has the most UEFA Super Cup wins (5). They share this record with Barcelona and Real Madrid. Real Madrid have a record 14 titles in the UEFA Champions League and its predecessor. Barcelona have a record four titles in the Cup Winners' Cup. Sevilla have a record of seven UEFA Cup and Europa League titles. Roma and West Ham United have each won one UEFA Europa Conference League title. Finally, German clubs Hamburger SV, Schalke 04, and VfB Stuttgart, as well as Spanish club Villarreal, have the record by titles won in the UEFA Intertoto Cup (two each). == Ranking main European club competitions' winning club sides by winning percentage== This is a ranking of all club which have won one of the three main European competitions, past or present.Champions League (named European Cup before 1992), Cup Winners' Cup (1960–1999), and Europa League (named UEFA Cup before 2009); since 2021 also includes Europa Conference League. Bayern Munich are the only team to finish a continental competition with a 100% winning record. They di this in 2020. === Top 15 club sides === Qualifying and preliminary round matches do not count in this table. This is the same for play-off matches; results of penalty shoot-outs are considered the score which preceded them (including extra time). ;Table key Rank Club Tournament Season Win % 1\\. Bayern Munich Champions League 2019–20 11 11 43 8 +35 100% 2\\. West Ham United Europa Conference League 2022–23 13 12 29 8 +21 92.31% 3\\. Dynamo Kyiv Cup Winners' Cup 1974–75 9 8 17 5 +12 88.88% 4\\. Paris Saint-Germain Cup Winners' Cup 1995–96 9 8 16 4 +12 88.88% 5\\. Atlético Madrid Europa League 2011–12 15 13 33 10 +23 86.67% 6\\. Real Madrid European Cup 1959–60 7 6 31 10 +21 85.71% 7\\. Tottenham Hotspur Cup Winners' Cup 1962–63 7 6 24 9 +15 85.71% 8\\. Ajax European Cup 1972–73 7 6 15 4 +11 85.71% 9\\. Inter Milan European Cup 1963–64 7 6 15 5 +10 85.71% 10\\. Real Madrid Champions League 2013–14 13 11 41 10 +31 84.61% 11\\. Barcelona Champions League 2014–15 13 11 31 11 +20 84.61% 12\\. Juventus UEFA Cup 1992–93 12 10 31 6 +25 83.33% 13\\. Borussia Mönchengladbach UEFA Cup 1974–75 12 10 32 9 +23 83.33% 14\\. Bayern Munich UEFA Cup 1995–96 12 10 32 10 +22 83.33% 15\\. Fiorentina Cup Winners' Cup 1960–61 6 5 17 5 +12 83.33% ==List of teams to have won the three main European club competitions== Five clubs have won all three main pre-1999 UEFA club competitions, the \"European Treble\" of European Cup/UEFA Champions League, European/UEFA Cup Winners' Cup, and UEFA Cup/UEFA Europa League. Although the Cup Winners' Cup does not exist anymore, 27 clubs who won it could still add wins in the other two competitions to achieve this UEFA treble. Ten of those teams only need one trophy to manage this. This includes Barcelona and Milan who have both won the Champions League and the Cup Winners' Cup titles. They only need one Europa League trophy to do the the UEFA treble. Other clubs who need the Europa League title to do the treble are Hamburg, Borussia Dortmund and Manchester City. They all won the European Cup and the Cup Winners' Cup once each. The five other clubs need to win the Champions League: Atlético Madrid, Tottenham Hotspur, Anderlecht, Valencia and Parma. The UEFA Europa Conference League started in the 2021–22 season. This means the 32 former winners of the Cup Winners' Cup can also win that competition. Any other existing clubs can also win a modern UEFA treble (if they win only the Champions League, Europa League and Europa Conference League titles) in the future. Club First title Second title Treble title Juventus 1976–77 UEFA Cup 1983–84 European Cup Winners' Cup 1984–85 European Cup Ajax 1970–71 European Cup 1986–87 European Cup Winners' Cup 1991–92 UEFA Cup Bayern Munich 1966–67 European Cup Winners' Cup 1973–74 European Cup 1995–96 UEFA Cup Chelsea 1970–71 European Cup Winners' Cup 2011–12 UEFA Champions League 2012–13 UEFA Europa League Manchester United 1967–68 European Cup 1990–91 European Cup Winners' Cup 2016–17 UEFA Europa League Only the first win is shown for any club with more than one win of the same competition. ==References== Category:UEFA",
 "title": "UEFA club competition records and statistics"
}