{
 "id": "1108962",
 "text": "Yelena Belova is a fictional character in the Marvel Cinematic Universe (MCU) franchise, portrayed by Florence Pugh, based on the Marvel Comics character of the same name. She is a highly trained spy and assassin who trained in the Red Room as a Black Widow and is an adopted sister to Natasha Romanoff. In 2016, she works with Romanoff, Alexei Shostakov, and Melina Vostokoff to stop General Dreykov after he reactivates the Red Room program. In 2018, she falls victim to the Blip and is restored to life five years later. In 2024, Belova is approached by Contessa Valentina Allegra de Fontaine with an order to kill Clint Barton under the pretenses he was responsible for Romanoff's death. She locates Barton along with Kate Bishop and Maya Lopez and fights against them as a masked vigilante, until Barton unmasks her and she is forced to retreat. On Christmas Eve, Belova infiltrates the Bishop Christmas family party to kill Barton, but Bishop intercepts and fights her. Belova escapes and confronts Barton on the Rockefeller Center ice rink, and at first she does not believe his story about Romanoff's sacrifice. It is not until Barton reveals the details about the relationship between her and Romanoff, details that he could only have been told by Romanoff, that she accepts her adopted-sister's death was an act of self-sacrifice, rather than a murder, as she was previously led to believe. As of 2024, the character has appeared in the movie Black Widow; as well as in the Disney+ series Hawkeye. She returned in the 2025 movie Thunderbolts*. An alternate version of Belova will appear in the upcoming animated series Marvel Zombies. == Appearances == === Movie appearances === Year Movie Portrayed by 2021 Black Widow Florence Pugh 2025 Thunderbolts* === Television appearances === Year Television series Seasons Episodes Portrayed by 2021 Hawkeye 1 6 Florence Pugh 2025 Marvel Zombies TBA TBA == References == == Other websites == * Yelena Belova on Marvel.com Category:Marvel Cinematic Universe characters Category:Marvel Comics movie characters",
 "title": "Yelena Belova (Marvel Cinematic Universe)"
}