{
 "id": "1108921",
 "text": "The Matheran Indian frog, Leith's leaping frog, Boulenger's brown frog, or Leith's frog (Indirana leithii) is a frog. It lives in India in the Western Ghat mountains. Human beings cannot hear this frog's voice. This frog lives on the ground near streams and near cliffs made out of basalt rock. This frog lives in forests that have evergreen trees in them. People also see the frog in the dead leaves on the ground or in cracks in rock. Sometimes people find them in water tanks. People have seen this frog between 25 and 1329 meters above sea level. When it is time to lay eggs, the frogs come to caves in big groups. The frog lays eggs on wet rocks or in cracks in rocks. The tadpoles stick to the rocks, where they eat water plants that are very small. Their back legs grow on them sooner than other tadpoles' back legs. This frog eats ants, young insects that look like worms, and other animals with no bones. Scientists believe this frog is not in danger of dying out, but it is in some danger. People cut down the forests where it lives to build farms and other things that people need. Sometimes people hurt the frog by stopping landslides: the concrete people use to make roads stronger can fill in the cracks in the rocks where frogs would lay their eggs. Sometimes people go into the forest and cut some wood to use themselves, but this is only a little dangerous to the frog. Scientists also think climate change could hurt this frog. Because climate change has changed the weather, some of these frogs have dried out and died. Some of the places the frog lives are protected parks: Bhimashankar Wildlife Sanctuary, Kalsubai Harishchandragad Wildlife Sanctuary, Tamhini-Sudhagad Wildlife Sanctuary, Phansad Wildlife Sanctuary, Sahyadri Tiger Reserve, and Vansda National Park. Scientists have seen the fungus Batrachochytrium dendrobatidis on this frog, but they do not know how much danger the frog is in from the fungus. Batrachochytrium dendrobatidis causes the fungal disease chytridiomycosis. ==References== Category:Frogs of Asia",
 "title": "Indirana leithii"
}