{
 "id": "1108563",
 "text": "Victor Ikpeba Nosa (born 12 June 1973) is a Nigerian former professional footballer who played as a forward for both club and country. Ikpeba played 31 international matches and scored seven goals for Nigeria. He was a member of Super Eagles team to the FIFA World Cups in 1994 but played and scored the lone goal against Bulgaria in the second game of the team at the 1998 FIFA World Cup. Ikpeba helped win the 1994 African Nations Cup and the Olympic football gold medal in 1996. In spite of his small physique, Ikpeba was a fast, versatile, and opportunistic forward, who was capable of playing as a striker, as a second striker, or on either wing, and was known for his ability to score from any position on the pitch. Regarded as one of the best Nigerian forwards of all time. ==Club career== He began his professional career at the Nigerian club ABC Lagos. In 1989, he performed well at the World Youth Championship and was bought by the Belgian Liege together with Sunday Oliseh. Having quickly become one of the leaders in the Belgian club, Ikpeba soon moved to the French Monaco, where he spent the best years of his career. In 1997, for his successes with Monaco, he was recognized as the best football player in Africa. In 1999, Ikpeba moved to Borussia Dortmund, but his career there did not work out and soon after a conflict with head coach Matthias Sammer, he moved on loan to the Spanish Real Betis. Having failed to gain a foothold in the Spanish club, Ikpeba changed several more not very strong clubs, but was never able to return to the previous level. Victor Ikpeba ended his career in 2005. ==International career== Ikpeba made his international debut in 1992. He played a total of 30 international matches for the Nigerian national football team and, among other things, took part in the 1994 World Cup in the USA. At the 1996 Summer Olympics in Atlanta he won the gold medal with the Nigerian selection. He also took part in the African Championships four times, where he won gold in 1994. In 2000 he was on the verge of repeating this triumph. But in the penalty shootout in the final, his penalty was disallowed even though it was clearly behind the line. Nwankwo Kanu also missed his penalty against Cameroon. == Honours == RFC Liège *Belgian Cup: 1989–90 Monaco *Ligue 1: 1996–97 *Trophée des Champions: 1997 Al-Ittihad *Libyan Premier League: 2002–03 Nigeria *African Cup of Nations: 1994 *Olympic Gold Medal: 1996 Individual *Ebony Shoe Award: 1993 *African Footballer of the Year: 1997 == References == == Other websites == * * * * Category:1973 births Category:Living people Category:Nigerian footballers Category:Olympic gold medalists for Nigeria Category:Footballers at the 1996 Summer Olympics Category:1994 FIFA World Cup players Category:1995 King Fahd Cup players Category:1998 FIFA World Cup players Category:Medalists at the 1996 Summer Olympics Category:Olympic medalists in football",
 "title": "Victor Ikpeba"
}