{
 "id": "1108253",
 "text": "The 2016–17 season was Manchester United's 25th season in the Premier League. It was their 42nd season in a row at the top level of English football. After Louis van Gaal left the club at the end of season before, the club signed former Porto, Chelsea, Inter Milan and Real Madrid manager José Mourinho. He got a three-year contract, with the option of another year. Manchester united won the FA Cup in the season before. This means it played against the Premier League winners, Leicester City, in the 2016 FA Community Shield. United won the match 2–1 and won the first trophy of the year. On 26 February 2017, the club won its second trophy that year. It beat Southampton 3–2 in the EFL Cup Final. The club did not qualify for the 2017–18 UEFA Champions League through its league position, because it finished in sixth place. Only the top four clubs qualify. However, it won the Europa League, beating Ajax 2–0 in the Europa League Final on 24 May 2017. This means it still qualified for the Champions League. That win also made United the fifth team to win all three main European club trophies. ==Pre-season and friendlies== Before the start of their 2016–17 season, United played several games. It played a friendly against Wigan, had a tour of China, played a friendly in Sweden against Turkish club Galatasaray in the 2016 SuperGame, and Wayne Rooney's testimonial match between Manchester United and Everton at Old Trafford. The season ended with Michael Carrick's testimonial on 4 June. It was between United players of the 2008 European Double-winning side (and Dimitar Berbatov, who joined the club during the following transfer window, and Michael's brother, Graeme Carrick) and an all-star team that Carrick chose. Sir Alex Ferguson and Harry Redknapp managed the teams. Redknapp was Carrick's first manager as a professional footballer. Date Opponents H / A Result F–A Scorers Attendance 16 July 2016 Wigan Athletic A 2–0 Keane 49', Pereira 58' 13,314 22 July 2016 Borussia Dortmund N 1–4 Mkhitaryan 59' 38,285 25 July 2016 Manchester City N — Match cancelled due to inadequate playing conditions 30 July 2016 Galatasaray N 5–2 Ibrahimović 4', Rooney (2) 55', 58' (pen.), Fellaini 62', Mata 74' 30,200 3 August 2016 Everton H 0–0 58,597 4 June 2017 Michael Carrick XI H 2–2 Vidić 28', Carrick 82' 70,027 ==FA Community Shield== Manchester United won the FA Cup the season before, so the club played against Leicester City, who won the 2015–16 Premier League, in the FA Community Shield. It was United's 30th time playing for that trophy. Manchester United won the match to claim its 21st Community Shield (including four shared titles). Date Opponents H / A Result F–A Scorers Attendance 7 August 2016 Leicester City N 2–1 Lingard 32', Ibrahimović 83' 85,437 ==Premier League== The Premier League season started on 13 August. It ended on 21 May. United did no lose for a season-record 25 matches between October and May. 12 of those matches were draws. Date Opponents H / A Result F–A Scorers Attendance League position 14 August 2016 Bournemouth A 3–1 Mata 40', Rooney 59', Ibrahimović 64' 11,355 1st 19 August 2016 Southampton H 2–0 Ibrahimović (2) 36', 52' (pen.) 75,326 1st 27 August 2016 Hull City A 1–0 Rashford 90+2' 24,560 2nd 10 September 2016 Manchester City H 1–2 Ibrahimović 42' 75,272 3rd 18 September 2016 Watford A 1–3 Rashford 62' 21,118 7th 24 September 2016 Leicester City H 4–1 Smalling 22', Mata 37', Rashford 40', Pogba 42' 75,256 6th 2 October 2016 Stoke City H 1–1 Martial 69' 75,251 6th 17 October 2016 Liverpool A 0–0 52,769 7th 23 October 2016 Chelsea A 0–4 41,424 7th 29 October 2016 Burnley H 0–0 75,325 8th 6 November 2016 Swansea City A 3–1 Pogba 15', Ibrahimović (2) 21', 33' 20,938 6th 19 November 2016 Arsenal H 1–1 Mata 68' 75,264 6th 27 November 2016 West Ham United H 1–1 Ibrahimović 21' 75,314 6th 4 December 2016 Everton A 1–1 Ibrahimović 42' 39,550 6th 11 December 2016 Tottenham Hotspur H 1–0 Mkhitaryan 29' 75,271 6th 14 December 2016 Crystal Palace A 2–1 Pogba 45+2', Ibrahimović 88' 25,547 6th 17 December 2016 West Bromwich Albion A 2–0 Ibrahimović (2) 5', 56' 26,308 6th 26 December 2016 Sunderland H 3–1 Blind 39', Ibrahimović 82', Mkhitaryan 86' 75,325 6th 31 December 2016 Middlesbrough H 2–1 Martial 85', Pogba 86' 75,314 6th 2 January 2017 West Ham United A 2–0 Mata 63', Ibrahimović 78' 56,996 6th 15 January 2017 Liverpool H 1–1 Ibrahimović 84' 75,276 6th 21 January 2017 Stoke City A 1–1 Rooney 90+4' 27,423 6th 1 February 2017 Hull City H 0–0 75,297 6th 5 February 2017 Leicester City A 3–0 Mkhitaryan 42', Ibrahimović 44', Mata 49' 32,072 6th 11 February 2017 Watford H 2–0 Mata 32', Martial 60' 75,301 6th 4 March 2017 Bournemouth H 1–1 Rojo 23' 75,245 6th 19 March 2017 Middlesbrough A 3–1 Fellaini 30', Lingard 62', Valencia 90+3' 32,689 5th 1 April 2017 West Bromwich Albion H 0–0 75,397 5th 4 April 2017 Everton H 1–1 Ibrahimović 90+4' (pen.) 75,272 6th 9 April 2017 Sunderland A 3–0 Ibrahimović 30', Mkhitaryan 46', Rashford 89' 43,779 5th 16 April 2017 Chelsea H 2–0 Rashford 7', Herrera 49' 75,272 5th 23 April 2017 Burnley A 2–0 Martial 21', Rooney 39' 21,870 5th 27 April 2017 Manchester City A 0–0 54,176 5th 30 April 2017 Swansea City H 1–1 Rooney 45+3' (pen.) 75,271 5th 7 May 2017 Arsenal A 0–2 60,055 5th 14 May 2017 Tottenham Hotspur A 1–2 Rooney 71' 31,848 6th 17 May 2017 Southampton A 0–0 31,425 6th 21 May 2017 Crystal Palace H 2–0 Harrop 15', Pogba 19' 75,254 6th ==FA Cup== Manchester United started the FA Cup in the third round. This is the same as the other Premier League Championship clubs. The third round draw (when the matches are decided) happened on 5 December. United played at home against Championship side Reading. The opponent's manager was Jaap Stam. He played for United for three years between 1998 and 2001 and this was his first time back. United won 4–0 on 7 January. Wayne Rooney scored in the first half and matched Bobby Charlton's 249-goal record for the club in that game. Anthony Martial also scored in the first half. Marcus Rashford scored two goals in the second half. The next match was at home again, against League One champions Wigan Athletic. Their manager was Warren Joyce who used to be a coach for Manchester United Under-23. United beat the Latics 4–0. They then played away against Championship side Blackburn Rovers in the fifth round. United came from behind to win 2–1. Marcus Rashford and substitute Zlatan Ibrahimović scored. In the quarter-finals, United played away at Premier League rivals Chelsea. It was a close game. Ander Herrera got a red card and N'Golo Kanté scored the winning goal. This was the end of Manchester United's defence (because United won the year before) of the FA Cup. Date Round Opponents H / A Result F–A Scorers Attendance 7 January 2017 Round 3 Reading H 4–0 Rooney 7', Martial 15', Rashford (2) 75', 79' 74,396 29 January 2017 Round 4 Wigan Athletic H 4–0 Fellaini 44', Smalling 57', Mkhitaryan 74', Schweinsteiger 81' 75,229 19 February 2017 Round 5 Blackburn Rovers A 2–1 Rashford 27', Ibrahimović 75' 23,130 13 March 2017 Quarter-finals Chelsea A 0–1 40,801 ==EFL Cup== As United qualified for the Europa League in the 2015–16 season, United received a bye to the third round of the EFL Cup. The draw was on 24 August 2016. United played away against Northampton Town on 21 September 2016. Manchester United won 3–1. Michael Carrick scored first in the 17th minute. Northampton's Alex Revell equalised from with a penalty shortly before half-time. Ander Herrera and Marcus Rashford scored in the second half to win the match for United. The draw for the fourth round happened shortly after the match. United played at home against their rivals Manchester City on 26 October 2016. United won 1–0. Juan Mata scored the only goal in the 54th minute. Manchester United also played at home in the fifth round. This time, the club played against West Ham. United won 4–1. Zlatan Ibrahimović and Anthony Martial both scored two goals. Former Manchester United youth player Ashley Fletcher scored the only goal for West Ham in the 35th minute. United played against Hull City in the semi-final. The first leg (game) was at Old Trafford on 10 January 2017. Mata and substitute Marouane Fellaini scored. United won 2–0. Two weeks later, United lost the second leg at the KCOM Stadium 2–1. They still reached the final 3–2 on aggregate (over the two matches). In the final on 26 February, Manchester United played against Southampton. They beat Liverpool in the semi- finals. Ibrahimović and Lingard scored and United were winning 2–0. Manolo Gabbiadini scored twice to make the score 2–2. Ibrahimović scored in the 87th minute and United won 3–2. Date Round Opponents H / A Result F–A Scorers Attendance 21 September 2016 Round 3 Northampton Town A 3–1 Carrick 17', Herrera 68', Rashford 75' 7,798 26 October 2016 Round 4 Manchester City H 1–0 Mata 54' 74,196 30 November 2016 Round 5 West Ham United H 4–1 Ibrahimović (2) 2', 90+3', Martial (2) 48', 62' 65,269 10 January 2017 Semi-finals First leg Hull City H 2–0 Mata 56', Fellaini 87' 65,798 26 January 2017 Semi- finals Second leg Hull City A 1–2 Pogba 66' 16,831 26 February 2017 Final Southampton N 3–2 Ibrahimović (2) 19', 87', Lingard 38' 85,264 ==UEFA Europa League== ===Group stage=== As United won the FA Cup, they started the Europa League at the group stage. The draw was on 26 August 2016. United were in a group with Turkish league runners-up (second place) Fenerbahçe, Dutch cup winners Feyenoord and the fourth-placed team from the Ukrainian league, Zorya Luhansk. United had played against Fenerbahçe in Europe twice before (1996–97 and 2004–05) and Feyenoord once before (1997–98). United first played in the Netherlands against Feyenoord on 15 September. They lost the match 1–0. They then had a home game against Zorya Luhansk two weeks later. They played twice against Fenerbahçe, first at home then away. They ended the group stage with return games against Feyenoord and Zorya Luhansk. Due to the war in Donbass, the away game against Zorya Luhansk was at Chornomorets Stadium in Odesa. Date Opponents H / A Result F–A Scorers Attendance Group position 15 September 2016 Feyenoord A 0–1 31,000 4th 29 September 2016 Zorya Luhansk H 1–0 Ibrahimović 69' 58,179 3rd 20 October 2016 Fenerbahçe H 4–1 Pogba (2) 31' (pen.), 45+2', Martial 34' (pen.), Lingard 48' 73,063 2nd 3 November 2016 Fenerbahçe A 1–2 Rooney 89' 35,378 3rd 24 November 2016 Feyenoord H 4–0 Rooney 35', Mata 69', Jones 75' (o.g.), Lingard 90+2' 64,628 2nd 8 December 2016 Zorya Luhansk A 2–0 Mkhitaryan 48', Ibrahimović 88' 25,900 2nd ===Knockout phase=== The draw for the round of 32 was on 12 December. Manchester United played against French side Saint-Étienne, who finished top of group C. Manchester United midfielder Paul Pogba played against his elder brother, Florentin, who plays as a defender for the French side. Zlatan Ibrahimović scored his first hat-trick for the club in the first match. Henrikh Mkhitaryan scored in the second leg and United went through to the next round. In the round of 16, United played Russian side Rostov. United won 2–1 on aggregate. United then played against Belgian side Anderlecht in the quarter-finals. Mkhitaryan scored in his fourth European away game in a row. In the return leg, Marcus Rashford scored in extra time. United got to the semi-finals, 3–2 on aggregate. Rashford also scored in the semi-final against Celta Vigo. This gave United a first win in Spain since 2010. The second leg was a 1–1 draw and United's went through to the final 2–1 on aggregate. United played against Dutch side Ajax in the final. Pogba and Mkhitaryan scored and United won the Europa League for the first time. With this victory, they became only the fifth club to have won all three major European trophies (European Champion Clubs' Cup/UEFA Champions League, UEFA Cup/Europa League, and the now defunct UEFA Cup Winners' Cup). This win also qualified them as the fifth English team in the next season's Champions League. Date Round Opponents H / A Result F–A Scorers Attendance 16 February 2017 Round of 32 First leg Saint-Étienne H 3–0 Ibrahimović (3) 15', 75', 88' (pen.) 67,192 22 February 2017 Round of 32 Second leg Saint-Étienne A 1–0 Mkhitaryan 16' 41,492 9 March 2017 Round of 16 First leg Rostov A 1–1 Mkhitaryan 35' 14,223 16 March 2017 Round of 16 Second leg Rostov H 1–0 Mata 70' 64,361 13 April 2017 Quarter-finals First leg Anderlecht A 1–1 Mkhitaryan 36' 20,000 20 April 2017 Quarter-finals Second leg Anderlecht H 2–1 Mkhitaryan 10', Rashford 107' 71,496 4 May 2017 Semi-finals First leg Celta Vigo A 1–0 Rashford 67' 26,202 11 May 2017 Semi-finals Second leg Celta Vigo H 1–1 Fellaini 17' 75,138 24 May 2017 Final Ajax N 2–0 Pogba 18', Mkhitaryan 48' 46,961 ==Squad statistics== No. Pos. Name League FA Cup League Cup Europe Other Total Discipline Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals 1 GK David de Gea 35 0 1 0 5 0 3 0 1 0 45 0 2 0 3 DF Eric Bailly 24(1) 0 0 0 1 0 11 0 1 0 37(1) 0 7 2 4 DF Phil Jones 18 0 1(1) 0 3 0 3 0 0 0 25(1) 0 3 0 5 DF Marcos Rojo 18(3) 1 4 0 5 0 8(2) 0 0(1) 0 35(6) 1 5 0 6 MF Paul Pogba 29(1) 5 1(1) 0 4 1 15 3 0 0 49(2) 9 10 0 7 FW Memphis Depay 0(4) 0 0 0 1 0 0(3) 0 0 0 1(7) 0 1 0 8 MF Juan Mata 19(6) 6 2(1) 0 3 2 9(1) 2 0(1) 0 32(9) 10 5 0 9 FW Zlatan Ibrahimović 27(1) 17 0(1) 1 4(1) 4 9(2) 5 1 1 41(4) 28 8 0 10 FW Wayne Rooney (c) 15(10) 5 2 1 3(1) 0 4(3) 2 1 0 25(14) 8 9 0 11 FW Anthony Martial 18(7) 4 3 1 2(1) 2 4(6) 1 1 0 28(14) 8 3 0 12 DF Chris Smalling 13(5) 1 4 1 4 0 8(2) 0 0 0 29(7) 2 0 0 14 MF Jesse Lingard 18(7) 1 1(1) 0 2(2) 1 6(4) 2 1 1 28(14) 5 6 0 15 MF Adnan Januzaj 0 0 0 0 0 0 0 0 0 0 0 0 0 0 16 MF Michael Carrick (vc) 18(5) 0 2 0 4(1) 1 5(2) 0 1 0 30(8) 1 1 0 17 DF Daley Blind 21(3) 1 1 0 2(1) 0 10(1) 0 1 0 35(5) 1 4 0 18 MF Ashley Young 8(4) 0 3 0 1 0 3(4) 0 0 0 15(8) 0 5 0 19 FW Marcus Rashford 16(16) 5 3 3 3(3) 1 8(3) 2 0(1) 0 30(23) 11 3 0 20 GK Sergio Romero 2 0 3 0 1 0 12 0 0 0 18 0 0 0 21 MF Ander Herrera 27(4) 1 2(1) 0 6 1 9 0 0(1) 0 44(6) 2 13 2 22 MF Henrikh Mkhitaryan 14(9) 4 3 1 2 0 10(1) 6 0(1) 0 29(11) 11 4 0 23 DF Luke Shaw 9(2) 0 1 0 2 0 4 0 1 0 17(2) 0 1 0 24 DF Timothy Fosu-Mensah 1(3) 0 1(1) 0 1 0 1(3) 0 0 0 4(7) 0 1 0 25 MF Antonio Valencia 28(1) 1 1 0 3 0 8(1) 0 1 0 41(2) 1 7 0 27 MF Marouane Fellaini 18(10) 1 2(1) 1 0(5) 1 7(3) 1 1 0 28(19) 4 9 1 28 MF Morgan Schneiderlin 0(3) 0 0 0 1(1) 0 2 0 0(1) 0 3(5) 0 1 0 31 MF Bastian Schweinsteiger 0 0 1(1) 1 0(1) 0 0(1) 0 0 0 1(3) 1 0 0 32 GK Sam Johnstone 0 0 0 0 0 0 0 0 0 0 0 0 0 0 34 GK Dean Henderson 0 0 0 0 0 0 0 0 0 0 0 0 0 0 35 DF Demetri Mitchell 1 0 0 0 0 0 0 0 0 0 1 0 0 0 36 DF Matteo Darmian 15(3) 0 2 0 2 0 7 0 0 0 26(3) 0 3 0 38 DF Axel Tuanzebe 4 0 0(1) 0 0 0 0 0 0 0 4(1) 0 0 0 39 MF Scott McTominay 1(1) 0 0 0 0 0 0 0 0 0 1(1) 0 1 0 40 GK Joel Castro Pereira 1 0 0(1) 0 0 0 0 0 0 0 1(1) 0 0 0 42 MF Matty Willock 0 0 0 0 0 0 0 0 0 0 0 0 0 0 43 DF Cameron Borthwick-Jackson 0 0 0 0 0 0 0 0 0 0 0 0 0 0 44 MF Andreas Pereira 0 0 0 0 0 0 0 0 0 0 0 0 0 0 45 GK Kieran O'Hara 0 0 0 0 0 0 0 0 0 0 0 0 0 0 46 FW Josh Harrop 1 1 0 0 0 0 0 0 0 0 1 1 0 0 47 MF Angel Gomes 0(1) 0 0 0 0 0 0 0 0 0 0(1) 0 0 0 48 FW Zak Dearnley 0 0 0 0 0 0 0 0 0 0 0 0 0 0 Own goals – 0 – 0 – 0 – 1 – 0 – 1 – – Statistics accurate as of 24 May 2017. ==Transfers== ===In=== Date Pos. Name From Fee 6 June 2016 DF Eric Bailly Villarreal Undisclosed 1 July 2016 FW Zlatan Ibrahimović Paris Saint-Germain Free 6 July 2016 MF Henrikh Mkhitaryan Borussia Dortmund Undisclosed 9 August 2016 MF Paul Pogba Juventus £89m ===Out=== Date Pos. Name To Fee 10 June 2016 GK George Dorrington Released 10 June 2016 GK Víctor Valdés Released 10 June 2016 MF Nick Powell Released 10 June 2016 MF Oliver Rathbone Released 12 July 2016 DF Tyler Reid Swansea City Undisclosed 12 July 2016 MF Joe Rothwell Oxford United Free 12 July 2016 FW Ashley Fletcher West Ham United Free 13 July 2016 DF Jimmy Dunne Burnley Free 13 July 2016 GK Oliver Byrne Cardiff City Free 11 August 2016 DF Paddy McNair Sunderland £5.5m 11 August 2016 DF Donald Love Sunderland 22 August 2016 DF Tyler Blackett Reading Undisclosed 30 August 2016 FW Will Keane Hull City Undisclosed 31 August 2016 MF James Weir Hull City Undisclosed 12 January 2017 MF Morgan Schneiderlin Everton £24m 20 January 2017 FW Memphis Depay Lyon £13.8m 28 January 2017 MF Sean Goss Queens Park Rangers Undisclosed 2 February 2017 DF Sadiq El Fitouri Chesterfield Free 29 March 2017 MF Bastian Schweinsteiger Chicago Fire Free ===Loan out=== Date from Date to Pos. Name To 23 July 2016 30 June 2017 DF Guillermo Varela Eintracht Frankfurt 12 August 2016 30 June 2017 MF Adnan Januzaj Sunderland 20 August 2016 2 February 2017 FW James Wilson Derby County 22 August 2016 30 June 2017 DF Cameron Borthwick-Jackson Wolverhampton Wanderers 26 August 2016 30 June 2017 MF Andreas Pereira Granada 31 August 2016 3 February 2017 GK Dean Henderson Grimsby Town 31 August 2016 5 January 2017 GK Joel Castro Pereira Belenenses 5 January 2017 30 June 2017 GK Sam Johnstone Aston Villa 17 January 2017 30 June 2017 DF Joe Riley Sheffield United == References == Category:Manchester United F.C.",
 "title": "2016–17 Manchester United F.C. season"
}