{
 "id": "110832",
 "text": "Ursula Kroeber Le Guin () (October 21, 1929 - January 22, 2018) was an American writer. She wrote books, poetry, children's books, essays, short stories, fantasy and science fiction. She was born and educated in California. She grew up in an academic home. Her parents were an anthropologist and a psychologist. Ideas from these two subjects are important in her writing. Le Guin spent most of her life in Portland, Oregon. She was a very successful author. She won many awards. Other writers thought she was very creative. Le Guin was also very political. She mixed politics in her writing. She supported feminism and freedom. She was very interested in gender and sexuality. She also supported other writers. ==Life== ===Early life: California=== Ursula K. Le Guin was born Ursula Kroeber in Berkeley, California, on October 21, 1929. Her father, Alfred Louis Kroeber (1876–1960), was an anthropologist at the University of California, Berkeley. Le Guin's mother, Theodora Kroeber (1897–1979; born Theodora Covel Kracaw), had a graduate degree in psychology. She started writing in her sixties and became a successful author. Her best known work was Ishi in Two Worlds (1961). This was a biography of Ishi, an indigenous American who was the last known member of the Yahi tribe. Ursula had three older brothers: Karl, Theodore, and Clifton. The family had a large collection of books. Ursula and her brothers all liked to read when they were young. Le Guin read science fiction and fantasy. She and her brothers often read issues of Thrilling Wonder Stories and Astounding Science Fiction. She liked myths and legends. She especially liked Norse mythology and Native American legends that her father would tell her. Many people visited the Kroeber family. Some of the visitors were well-known academics such as Robert Oppenheimer. Le Guin used Oppenheimer as the model for her lead character in The Dispossessed, a physicist named Shevek. The family lived in a summer home in the Napa valley and a house in Berkeley during the school year. ===Education=== Le Guin studied at Berkeley High School. She graduated with another student who became a famous science fiction author, Philip K. Dick. She received her Bachelor of Arts in Renaissance French and Italian literature from Radcliffe College in 1951. She was a member of the Phi Beta Kappa honor society. Le Guin then studied at Columbia University, and earned a Master of Arts in French in 1952. Soon after, she began a Ph.D. program. She won a Fulbright grant to continue her studies in France from 1953 to 1954. Later, Le Guin also received Fulbright grants to travel to London in 1968 and 1975. ===France=== Le Guin stayed at Hôtel de Seine while in Paris. Ursula met historian Charles Le Guin in 1953 while traveling to France on the Queen Mary, . Charles was also a Fulbright Scholar. They got married in Paris in December 1953. They returned to the United States in 1954. ===Marriage and children=== Le Guin said that getting married meant she had to stop studying for her doctorate degree. Le Guin worked while her husband finished his doctorate at Emory University in Georgia, and later at the University of Idaho. She taught French and worked as a secretary until her daughter Elisabeth was born in 1957. The couple had another daughter, Caroline, and a son, Theodore (born 1964). ===Return to the West Coast: Portland=== In 1959 Charles became a history instructor at Portland State University, so they moved to Portland, Oregon. He taught there for more than 35 years. They lived in Portland for the rest of their lives. ===Writing life=== She first wrote in the 1960s. She won many Hugo and Nebula awards. She won the Gandalf Award in 1979 and the Science Fiction and Fantasy Writers of America Grand Master Award in 2003. She got eighteen Locus Awards, more than any other writer. Her book The Farthest Shore won the National Book Award for Children's Books in 1973. Le Guin was the Professional Guest of Honor at the 1975 World Science Fiction Convention in Melbourne, Australia. She got the Library of Congress Living Legends award in the \"Writers and Artists\" area in April 2000 for her additions to America's cultural history.\"Living Legends: Ursula LeGuin\", Awards and Honors (Library of Congress). In 2004, Le Guin was the was given the Association for Library Service to Children's May Hill Arbuthnot Honor Lecture Award. Her agent was Virgina Kidd. ===Death=== Le Guin died on January 22, 2018, at her home in Portland. She was 88 years old. Her son said that she had been sick for several months. He said that she probably had a heart attack. There was a private memorial service for her in Portland. There was also a public memorial service in June 2018. At this service, many writers gave speeches, including: Margaret Atwood, Molly Gloss, and Walidah Imarisha ==Beliefs and values== ===Political Freedom=== In 1975, Le Guin won a Nebula Award for her story \"The Diary of the Rose.\" She did not accept the award. This was a protest against the Science Fiction and Fantasy Writers of America. The SFWA had recently canceled Stanisław Lem's membership in the group. Le Guin believed they kicked Lem out because he criticized American science fiction and chose to live in the Soviet Union, She said she could not take an award for a story about an unfree society from a writers' group that did not protect freedom. ===Religion=== Le Guin said she was did not learn any religion and was not taught to be religious as a child. But, she became very interested in Taoism and Buddhism. She said that Taoism was a tool to help her understand her life as a teenager and young adult. In 1997 she published a translation of the Tao Te Ching. ===Author's rights=== In December 2009, Le Guin quit the Authors Guild. She did this to protest the Guild's agreement with the Google's book digitization project. \"You decided to deal with the devil\", she wrote in her letter when she quit. She wrote that they had given control over authors' rights and copyright to a company for nothing. Le Guin made a speech at the 2014 National Book Awards. She explained that Amazon's control over the publishing industry was bad and dangerous. She was especially concerned about how Amazon blocked the Hachette Book Group from selling all books because the companies disagreed about how to sell ebooks. National Public Radio broadcast the speech twice. Many other news organizations reported on it around the world. ==Writing career== ===Early writing-1951-1968=== Le Guin's first published work was in her fictional country called Orsinia. These were a poem and a short story. The poem, \"Folksong from the Montayna Province,\" was published in 1959. The short story was \"An die Musik\", in 1961. Between 1951 and 1961 she also wrote five novels that all happened in Orsinia. But, publishers did not want them because they thought they were hard to read or understand. Some of her poetry from the 1950s was published in 1975 in a book called Wild Angels. Le Guin was rejected by many publishers. Then she turned to science fiction because she knew that clearly labeled SF would sell well. Her first professional SF publication was the short story \"April in Paris\" in 1962 in Fantastic Science Fiction. Seven more stories followed in the next few years, in Fantastic or Amazing Stories. One of them was \"The Dowry of the Angyar\", which introduced the fictional Hainish universe, Two more were \"The Rule of Names\" and \"The Word of Unbinding\". These introduced the world of Earthsea. Most critics ignored these stories. Le Guin published her first novel in 1966. It was called Rocannon's World. Ace Books published it. Two more Hainish novels, Planet of Exile and City of Illusions were published in 1966 and 1967. These three books became the Hainish trilogy. The first two were each published as half of an \"Ace Double\": two novels bound into a paperback and sold as a single low-cost volume. City of Illusions was published as a standalone volume. Le Guin was getting greater name- recognition. Critics paid more attention to these books than to Le Guin's short stories. Several science fiction magazines reviewed them, but the critical response was still muted. The books had many themes and ideas also present in Le Guin's better known later works, including the \"archetypal journey\" of a protagonist who undertakes both a physical journey and one of self-discovery, cultural contact and communication, the search for identity, and the reconciliation of opposing forces. ===Getting more attention=== Le Guin's next two books in 1968 and 1969 brought her much more attention and praise. The Wizard of Earthsea in 1968 was a young adult fantasy novel. The Left Hand of Darkness in 1969 started her Hainish universe, explored sexuality, and won awards. These two books changed Le Guin's career and made her a major writer. The important critic Harold Bloom called A Wizard of Earthsea and The Left Hand of Darkness Le Guin's masterpieces. Le Guin had not planned to write for young adults. But, the editor of Parnassus Press asked her to write a novel for young people. He thought they could sell many books to that group. He published A Wizard of Earthsea in 1968. It was a fantasy coming of age story for teenagers. In the book, Le Guin created a fictional archipelago called Earthsea. She also created the first wizarding school. Readers and reviewers in the US and the UK liked the book very much. Her next novel was The Left Hand of Darkness in 1969 and showed the strength of her writing and won awards. It was in her Hainish universe on a fictional planet where humans sex changes. Le Guin explored experiences of gender and sexuality. The book was Le Guin's first about feminist issues. The book shocked and surprised science fiction critics. It won both the Hugo and the Nebula Awards for best novel. Le Guin was the first woman to win these awards. For the next couple of years in the 1970s, Le Guin continued and extended the work she had started. Le Guin continued to develop themes of equilibrium and coming-of-age in the next two installments of the Earthsea series, The Tombs of Atuan and The Farthest Shore, published in 1971 and 1972. Both books were praised for their writing, while the exploration of death as a theme in The Farthest Shore also got praise. She won the Hugo Award again in 1973 for The Word for World is Forest. Le Guin's anger over the Vietnam War was important to this novel. She wrote about colonialism and militarism: Le Guin later said it was the most political statement in her fiction. Her 1974 novel The Dispossessed again won both the Hugo and the Nebula awards for best novel. She became the first person to win both awards for each of two books. Also set in the Hainish universe, the story explored anarchism and utopianism. Scholar Charlotte Spivack said Le Guin was making her science fiction writing more about discussing political ideas. Several of her speculative fiction short stories from the period, including her first published story, were later anthologized in the 1975 collection The Wind's Twelve Quarters. The fiction of the period 1966 to 1974, which also included The Lathe of Heaven, the Hugo Award-winning \"The Ones Who Walk Away From Omelas\" and the Nebula Award- winning \"The Day Before the Revolution\", was the time of Le Guin's best-known work. ===Exploring=== ===Later writing=== The Annals of the Western Shore was a series of three books: Gifts (2004), Voices (2006), and Powers (2007). Each book has a different main character and happens in a different place. But, the books all share some characters and places.Gifts won the PEN Center USA 2005 Children's literature award. Powers won the Nebula Award for Best Novel in 2009. Le Guin published the novel Lavinia in 2008. Lavinia is a character from Virgil's Aeneid, Near the end of her life, Le Guin wrote less fiction. She wrote essays, poems, and some translations. Her last publications included the non-fiction collections Dreams Must Explain Themselves and Ursula K Le Guin: Conversations on Writing. She also wrote a book of poetry called So Far So Good: Final Poems 2014–2018. These were released after she died. ==About the writing== ===Influences=== Many other writers influenced Le Guin. Cultural anthropology was important to her writing. Carl Jung's archetypes are in her work. Taoism was part of Le Guin's life and work. ===Genre and style=== ==Themes== ===Gender and sexuality=== Gender and sexuality are important themes in Le Guin's writing. The Left Hand of Darkness was one of the first books in feminist science fiction. It was published in 1969 before the idea of feminist science fiction was its own genre. It is the most famous science fiction book about androgyny. The story happens on the fictional planet, Gethen. People on the planet are ambisexual humans. THey can change their gender identity and adopt female or male sexual characteristics as part of their sexual cycle. They choose their gender or sex depending on where they are and who they are with. Le Guin made Gethen a peaceful society without war because people's gender was not permanent. Le Guin showed Gethenian culture through the eyes of a Terran. His masculinity was a problem in cross-cultural communication. Although The Left Hand of Darkness was an early and important exploration of gender, it was also criticized for not going far enough. Le Guin used masculine gender pronouns (he/him) to describe androgynous characters,. Reviewers also said Le Guin did not show androgynous characters in feminine roles. Also, heterosexuality was expected on Gethen. Le Guin's portrayal of gender in Earthsea was also described as perpetuating the notion of a male-dominated world; according to the Encyclopedia of Science Fiction, \"Le Guin saw men as the actors and doers in the [world], while women remain the still centre, the well from which they drink\". Le Guin initially defended her writing; in a 1976 essay \"Is Gender Necessary?\" she wrote that gender was secondary to the primary theme of loyalty in The Left Hand of Darkness. Le Guin revisited this essay in 1988, and acknowledged that gender was central to the novel; she also apologized for depicting Gethenians solely in heterosexual relationships. Le Guin responded to these critiques in her later writing. She used feminine pronouns for all sexually latent Gethenians in her 1995 short story \"Coming of Age in Karhide.\" In a later reprinting of \"Winter's King\", which was first published in 1969. \"Coming of Age in Karhide\" was later anthologized in the 2002 collection The Birthday of the World, which contained six other stories featuring unorthodox sexual relationships and marital arrangements. She also revisited gender relations in Earthsea in Tehanu, published in 1990. This book was a retelling of a different The Tombs of Atuan. The power and status of the female protagonist Tenar are the opposite of what they were in the earlier book, which was also focused on her and Ged. During this later period she commented that she considered The Eye of the Heron, published in 1978, to be her first work genuinely centered on a woman. ===Moral development=== ===Political systems=== The story of The Dispossessed happens on twin planets called Urras and Anarres. Urras was richer than Anarres. But Anarres is more advanced ethically and morally. Sttlers from Urras planned the Anarres society. It is an anarcho-socialist society that is an \"ambiguous utopia\". Anarres society is neither perfect nor static, unlike classical utopias. The main character, Shevek, travels to Urras to do research. Urras society is authoritarian, hierarchical, and misogynistic. But these the anarchists on Anarres do not have those problems. In their society cooperation and individual liberty are most important. ==Responses to her work== ===Reception=== Le Guin became popular and got good reviews quickly after publishing The Left Hand of Darkness in 1969. She was very well known among SF writers by the 1970s. Readers bought millions of her books. And, her writing was translated into more than 40 languages. Some of her books stayed in print many decades after their first publication. Academics studied her work carefully and discussed it often. Later in her career, mainstream literary critics wrote positively about her work. In an obituary, Jo Walton said that Le Guin \"was so good that the mainstream couldn't dismiss SF any more\". Le Guin earliest work stayed the most popular and got the most recognition. A reviewer in 2018 said that she often lectured the reader in her later works. John Clute, wrote in The Guardian, that she felt responsible for explaining important things clearly, and that this was difficult for her. Some critics disliked some of her work. The Compass Rose had a mixed reaction. Even the critically well-received The Left Hand of Darkness was criticized by some feminists,. Other authors liked her work. According to Zadie Smith, her prose was \"as elegant and beautiful as any written in the twentieth century\". After Le Guin's death in 2018, writer Michael Chabon called her the \"greatest American writer of her generation\", and said that she had \"awed [him] with the power of an unfettered imagination\". Author Margaret Atwood praised Le Guin's \"sane, smart, crafty and lyrical voice\", and wrote that social injustice was a powerful motivation through Le Guin's life. Literary critic Harold Bloom described Le Guin as an \"exquisite stylist\", saying that in her writing, \"Every word was exactly in place and every sentence or line had resonance\". According to Bloom, Le Guin was a \"visionary who set herself against all brutality, discrimination, and exploitation\". Academic and author Joyce Carol Oates highlighted Le Guin's \"outspoken sense of justice, decency, and common sense\", and called her \"one of the great American writers and a visionary artist whose work will long endure\". China Miéville described Le Guin as a \"literary colossus\", and wrote that she was a \"writer of intense ethical seriousness and intelligence, of wit and fury, of radical politics, of subtlety, of freedom and yearning\". Praise for Le Guin frequently focused on the social and political themes her work explored. The New York Times described her as using \"a lean but lyrical style\" to explore issues of moral relevance. In the introduction to an interview in 2008, Vice magazine described Le Guin as having written \"some of the more mind-warping sf and fantasy tales of the past 40 years\". ===Awards and recognition=== Le Guin won many annual awards for individual works. She was nominated for Hugo Awards twenty-four times and won seven times. She won six Nebula Awards from eighteen nominations. Four of her Nebula Awards were for Best Novel, more than any other writer. Le Guin won twenty-two Locus Awards. Her third Earthsea novel, The Farthest Shore, won the 1973 National Book Award for Young People's Literature, She was a finalist for ten Mythopoeic Awards, nine in Fantasy and one for Scholarship. Her 1996 collection Unlocking the Air and Other Stories was one of three finalists for the 1997 Pulitzer Prize for Fiction. Other awards won by Le Guin include three James Tiptree Jr. Awards, two World Fantasy Awards, and three Jupiter Awards. She won her final Hugo and Locus awards in the year of her death. The Hugo was for the essay collection No Time to Spare: Thinking About What Matters, and the Locus for an anthology of the Hainish cycle. Other awards were for Le Guin's contributions to speculative fiction. She was voted a Gandalf Grand Master Award by the World Science Fiction Society in 1979. The Science Fiction Research Association gave her its Pilgrim Award in 1989 for her \"lifetime contributions to SF and fantasy scholarship\". At the 1995 World Fantasy Convention she won the World Fantasy Award for Life Achievement. She became a member of the Science Fiction and Fantasy Hall of Fame in 2001. This was the official website of the hall of fame to 2004. The Science Fiction and Fantasy Writers of America made her its 20th Grand Master in 2003. She was the second, and as of 2019, one of only six women to receive that honor. In 2010, Le Guin was awarded the Lyman Tower Sargent Distinguished Scholar Award by the North American Society for Utopian Studies. In 2013, she was given the Eaton Award by the University of California, Riverside, for lifetime achievement in science fiction. Later in her career Le Guin was also recognized for her contributions to literature more generally not just in science fiction or fantasy. In April 2000 the U.S. Library of Congress made Le Guin a Living Legend in the \"Writers and Artists\" category for her significant contributions to America's cultural heritage. The American Library Association gave her the annual Margaret Edwards Award in 2004, and also chose her to give the annual May Hill Arbuthnot Lecture. The Edwards Award is for one writer and a particular body of work: the 2004 panel cited the first four Earthsea volumes, The Left Hand of Darkness and The Beginning Place. The panel said that Le Guin \"has inspired four generations of young adults to read beautifully constructed language, visit fantasy worlds that inform them about their own lives, and think about their ideas that are neither easy nor inconsequential\". At its 2009 convention, the Freedom From Religion Foundation awarded the Emperor Has No Clothes Award to Le Guin. A collection of Le Guin's works was published by the Library of America in 2016. This honor is rarely given to living writers. The National Book Foundation awarded Le Guin its Medal for Distinguished Contribution to American Letters, saying that she had \"defied conventions of narrative, language, character, and genre, and transcended boundaries between fantasy and realism to forge new paths for literary fiction\". The American Academy of Arts and Letters made her a member in 2017. ===Legacy and influence=== Le Guin had a strong influence on speculative fiction. Jo Walton argued that Le Guin was important in two ways. One, she made the genre more open to new ideas. Two, she helped genre writers get mainstream success. A Wizard of Earthsea was the first book about a \"wizard school.\" This later became more famous in the Harry Potter series of books. The idea of a boy wizard as the main character in Harry Potter came from Le Guin's writing. In 2022, Le Guin's son, Theo Downes-Le Guin, announced a new prize named for his mother. The Ursula K. Le Guin Prize for Fiction gives money to a writer. They must write a full-length book of \"imaginative fiction.\" Le Guin created the word \"ansible\" for an instantaneous interstellar communication device in 1966. Several other writers, including Orson Scott Card and Neil Gaiman, used the word later. The idea that names can exert power is also present in Hayao Miyazaki's 2001 film Spirited Away. Critics have suggested that that idea started with Le Guin's Earthsea series. ===Adaptations of her work=== Le Guin's works have been adapted for radio, film, television, and theater. ====Movies==== Her 1971 novel The Lathe of Heaven has been adapted twice, in 1979 by WNET with Le Guin's participation, and the in 2002 by the A&E; Network. In a 2008 interview, she said 1979 adaptation is \"the only good adaptation to\" a movie of her work to date. In the early 1980s Hayao Miyazaki asked to create an animated adaptation of Earthsea. Le Guin, who was unfamiliar with his work and anime in general, initially turned down the offer, but later accepted after seeing My Neighbor Totoro. The third and fourth Earthsea books were the basis of Tales from Earthsea, released in 2006. Miyazaki's son, Gorō Miyazaki directed the movie, not Hayao Miyazaki himself. Le Guin was disappointed by the change. Le Guin was positive about how the movie looked. She wrote that \"much of it was beautiful\", but she did not like the moral sense of the movie. She disliked the physical violence, especially the death of a villain as the movie's ending. In 2004 the Sci Fi Channel adapted the first two books of the Earthsea trilogy as the miniseries Legend of Earthsea. Le Guin was highly critical of the adaptation, calling it a \"far cry from the Earthsea I envisioned\", objecting to the use of white actors for her red-, brown-, or black-skinned characters. ====Theater==== Le Guin's novel The Left Hand of Darkness and novella Paradises Lost have both been adapted for theater. In 1995, Chicago's Lifeline Theatre presented its adaptation of The Left Hand of Darkness. Reviewer Jack Helbig at the Chicago Reader wrote that the \"adaptation is intelligent and well crafted but ultimately unsatisfying\", mainly because it is extremely difficult to compress a complex 300-page novel into a two-hour stage presentation. She also said she was better pleased with stage adaptations, including Paradises Lost, than screen adaptations of her work till date. In 2013, the Portland Playhouse and Hand2Mouth Theatre produced a stage adaptation of The Left Hand of Darkness, directed and adapted by Jonathan Walters, with text adapted by John Schmor. The play opened May 2, 2013, and ran until June 16, 2013, in Portland, Oregon. ====Opera==== Paradises Lost was adapted into an opera at the University of Illinois. The opera was composed by Stephen A. Taylor; the libretto has been attributed both to Kate Gale and to Marcia Johnson. Adapted in 2005, the opera premiered in April 2012. Le Guin described the effort as a \"beautiful opera\" in an interview, and expressed hopes that it would be picked up by other producers. == Books == === Earthsea (fantasy) === * A Wizard of Earthsea, 1968 * The Tombs of Atuan, 1971 * The Farthest Shore, 1972 (Winner of the National Book Award) * Tehanu: The Last Book of Earthsea, 1990 (Winner of the Nebula Award) * The Other Wind, 2001 * Tales from Earthsea, short story collection, 2001 (winner of Endeavour Award) === Hainish Cycle (science fiction) === x * Rocannon's World, 1966 * Planet of Exile, 1966 * City of Illusions, 1967 * The Left Hand of Darkness, 1969 (winner of the Hugo Award and Nebula Award) * The Dispossessed: An Ambiguous Utopia, 1974 (winner of the Hugo Award and Nebula Award) * The Word for World is Forest, 1976 (winner of the Hugo Award) * Four Ways to Forgiveness, 1995 (Four Stories of the Ekumen) * The Telling, 2000 (winner of Endeavour Award) === Miscellaneous novels and story cycles === * The Lathe of Heaven, 1971 (made into TV movies, 1980 and 2002) * The Eye of the Heron, 1978 (first published in the anthology Millennial Women) * Malafrena, 1979 * The Beginning Place, 1980 (also published as Threshold, 1986) * Always Coming Home, 1985 * Lavinia, 2008 ==== The Catwings Collection ==== * Catwings, 1988 * Catwings Return, 1989 * Wonderful Alexander and the Catwings, 1994 * Jane on her Own, 1999 === Nonfiction === * The Language of the Night, 1979, revised edition 1992 * Dancing at the Edge of the World, 1989 * Revisioning Earthsea, 1992 (a published lecture - essay) * Steering the Craft, 1998 (about writing) * The Wave in the Mind, 2004 == Related pages == *List of poets from North America == References == ==Other websites== * Ursula K. Le Guin Blog Category:1929 births Category:2018 deaths Category:Deaths from myocardial infarction Category:American children's writers Category:American essayists Category:American novelists Category:American poets Category:American science fiction writers Category:Hugo Award winning writers Category:Nebula Award winning writers Category:American short story writers Category:Writers from Berkeley, California Category:Writers from Portland, Oregon",
 "title": "Ursula K. Le Guin"
}