{
 "id": "1108887",
 "text": "Marianne Wiggins (born November 8, 1947) is an American author. She has won a Whiting Award, an National Endowment for the Arts award, and the Janet Heidinger Kafka Prize. She was a finalist for the Pulitzer Prize in fiction in 2004. She was a finalist for the prize because of her novel Evidence of Things Unseen. ==Biography== Wiggins was born on November 8, 1947, in Lancaster, Pennsylvania. She married Brian Porzak in 1965. She had one daughter with him. Her and Porzak divorced in 1970. Wiggins lived in London for 16 years. She also lived in Paris, Brussels, and Rome for a little while. In January 1988, she married author Salman Rushdie in London. On February 14, 1989, the Ayatollah Ruhollah Khomeini issued a fatwa telling other Muslims to assassinate Rushdie. They did this because they said that he committed blasphemy in his book The Satanic Verses. Although Wiggins had told Rushdie five days before this that she wanted to stop being married to him, she started hiding with him.Caryn James, \"Marianne Wiggins And Life on the Run,\" New York Times, April 9, 1991 The two divorced in 1993. In 2016, Wiggins had a stroke. The stroke made her not able to read or write anymore. She got those abilities back and finished writing her novel Properties of Thirst over several years. She was helped by her daughter Lara Porzak. Wiggins currently lives in Los Angeles, California. She has been in the English department of the University of Southern California since 2005. ==Awards== *1989: Whiting Award *1989: Janet Heidinger Kafka Prize for John Dollar *2003: Finalist for the National Book Award for Evidence of Things Unseen *2004: Finalist for the Pulitzer Prize for Evidence of Things Unseen ==Books written== ===Novels=== * Babe, 1975; the story of a single mother. * Went South, 1980. * Separate Checks, 1984; a short-story writer recovers from a nervous breakdown. :After this book was published, Wiggins was able to support herself and her daughter from her novels. * John Dollar, 1989; eight girls, marooned on an island. :Won the Janet Heidinger Kafka Prize for best novel written by an American woman. * Eveless Eden, 1995; the romance between a war correspondent and a photographer. :Story suggested by then-husband Salman Rushdie. :Shortlisted for 1996 Orange Prize. * Almost Heaven, 1998. * Evidence of Things Unseen, 2003; the dawn of the atomic age is seen through the eyes of Fos, an amateur chemist in Kitty Hawk, North Carolina, and Opal, a glassblower's daughter. : Nominated for 2003 National Book Award. : Gold medal for 2004 Commonwealth Club Prize (fiction). : Finalist for 2004 Pulitzer Prize. * The Shadow Catcher, 2007; a dual narrative threading early life of photographer Edward Curtis and current life of \"Marianne Wiggins.\" * Properties of Thirst, 2022 ===Collections=== * Herself in Love and Other Stories, 1987. ** \"Herself in Love,\" Originally published in Granta 17: While Waiting for a War, August 1985 * Bet They'll Miss Us When We're Gone, 1991. ==References== Category:1947 births Category:Living people Category:American novelists",
 "title": "Marianne Wiggins"
}