{
 "id": "1108670",
 "text": "On 7 October 2023, Hamas/Palestinian Islamic Jihad and several other Palestinian militant groups launched armed attacks from the Gaza Strip into the Gaza Envelope. Hamas and other Palestinian armed groups named the attacks Operation Al-Aqsa Flood (or Deluge; , usually romanised as \"Tufan Al-Aqsa\" or \"Toofan Al-Aqsa\"),From the United Nations: * * * while in Israel they are known as Black Sabbath (Saturday) () or the The October 7th Massacre (), and internationally as the October 7th attack and The October 7th Massacre. The attacks started the ongoing Israel–Hamas war. The attacks began early on October 7th with a launch of at least 3,000 rockets launched toward Israeli cities and villages. Hamas fighters entered the Gaza–Israel barrier, attacking both military bases and villages, and killing civilians in 21 communities. 364 civilians were killed and many more wounded while attending a music festival. As of November 2023, the IDF said that about 3,000 terrorists invaded southern Israel. In total the attackers killed 1,189 people: 815 Israeli civilians (including 38 children), 71 foreign nationals, and 373 members of the security forces. About 250 Israeli civilians and soldiers were taken as hostages to the Gaza Strip, including 30 children. == Extreme allegations and incitement == In 2023 and early 2024 Israeli sources accused Hamas and other Palestinians of \"systematic use of rape as a weapon of war\". In early 2024 these accusations were repeated in some U.K. and U.S. media including The Guardian and The New York Times. == Attack locations == Attack Location Israelis and foreign nationals Physical destruction Palestinian militants References Name Pop. Total killed Civilians killed Combatants killed Hostages & POWs Killed POWs Claimed the attack 7 October attacks on Israel Gaza Envelope and Southern Israel total pop. = total = 1,187 total = total = total = Gaza–Israel barrier + military bases + kibbutzim + 48 Israel Attack on Erez crossing Military: Erez crossing crossing allegedly made unusable > Police station in Sderot computer server and connections The town of Sderot 15+ Re'im music festival massacre Music festival near Re'im ~3500 357+ 40 cars Kibbutz Re'im Battle of Re'im Military: Re'im headquarters Kibbutz Be'eri 117+ Surveillance tower Military: Nahal Oz lookout base 100+ 66 . Retrieved 25 February 2024. none 15+ Base set on fire. Kibbutz Nahal Oz 12+ (100+ killed in total in the base and Kibbutz) Kibbutz Kfar Aza 52+ Weeapons tower destroyed Zikim Beach 35+ 19 Qassam naval commandos Military: 134 7 Military: Yiftach outpost 5+ Kibbutz Zikim Nir Oz massacre Kibbutz Nir Oz 27+ Psyduck massacre Music festival between Nir Oz and Nirim ~100 17 Nirim attack Kibbutz Nirim 5+ Moshav Netiv HaAsara 21+ Alumim massacre Kibbutz Alumim 19+ Kissufim massacre Kibbutz Kissufim 16+ Holit massacre Kibbutz Holit 13+ Ein HaShlosha attack Kibbutz Ein HaShlosha 5+ Nir Yitzhak attack Kibbutz Nir Yitzhak 5+ Kibbutz Nir Am none none none 1 Battle of Yated Moshav Yated none none none none Communications and electricity infrastructure 15 https://web.archive.org/web/20231126031634/https://jewishjournal.com/community/365485/in- the-aftermath-of-oct-7-traumatized-israelis-are-coming-to-america/ https://web.archive.org/web/20231125103014/https://www.israelnationalnews.com/news/378084 https://web.archive.org/web/20231119010952/https://besacenter.org/the-gaza- terror-offensive-october-7-8-2023/ The town of Ofakim 47 Table footnotes: ==References==",
 "title": "7 October 2023 attack on Israel"
}