{
 "id": "1108583",
 "text": "Taribo West (born 26 March 1974) is a Nigerian pastor and former professional footballer who played as a defender. He is best remembered for his various unusual and colourful hairstyles. Primarily a centre-back, West was a physically commanding and powerful defender. Although he lacked significant pace, West was known for his ball-winning abilities, commitment, and hard- tackling style of play, as well as his forward surging runs. Considered as one of the greatest Nigerian centre-backs ever. ==Club career== The central defender Taribo West began his professional career in 1989 with the club Obanta United. He made a move to Europe in 1993 and joined AJ Auxerre under the coach Guy Roux. During this time he quickly developed into one of the team's key players and Nigeria's international player. His most successful time was between 1997 and 1999, when he moved from Auxerre to Inter Milan in the Italian Serie A. In his first year he won the UEFA Cup in the final against Lazio. As Italian runner-up, he took part in the UEFA Champions League the following year and failed in the quarter-finals against eventual winners Manchester United. After the conclusion of the season he moved to local rivals AC Milan. However, he was never really happy at Milan. He moved to Derby County in the English Premier League in November 2000. Now Taribo West's wandering years began. He played for almost six months, from November 2001 until the end of the season, for 1. FC Kaiserslautern in the Bundesliga. He was then without a club for six months before he was under contract with Partizan Belgrade from January 2003 to April 2004. After joining Al-Arabi in Qatar in 2004/05, he moved to England to Plymouth Argyle in the First Division at the beginning of the 2005/06 season, where he only stayed until the beginning of October 2005. In 2007 he signed a contract with Paykan Teheran, which he canceled after just one game due to unpunctual salary payments. ==International career== In 1994, West was part of the Nigeria national team for the first time. Two years later he took part with her in the Summer Olympics, where she managed to win the gold medal. In the preliminary round they only had to admit defeat to Brazil, but they still made it to the next round as three teams in Group D had six points. In the final they met another South American team. But they kept the upper hand against Argentina and won 3-2. He then took part in the 1998 World Cup in France with the national team. He then played at the 2002 World Cup in Japan and South Korea. ===International career statistics=== National team Year Apps Goals Nigeria 1994 1 0 1995 1 0 1996 1 0 1997 4 0 1998 7 0 1999 3 0 2000 7 0 2001 7 0 2002 10 0 2003 0 0 2004 0 0 2005 1 0 Total 42 0 ==Honours== ===Club=== Auxerre * Division 1: 1995–96 * Coupe de France: 1993–94, 1995–96 Inter Milan * UEFA Cup: 1997–98 Partizan * First League of Serbia and Montenegro: 2002–03 ===International=== Nigeria * Olympic Games: 1996 * Afro-Asian Cup of Nations: 1995 * Africa Cup of Nations: Runner-up 2000 ==References== ==Other websites== * * * * Category:1974 births Category:Living people Category:Derby County F.C. players Category:Medalists at the 1996 Summer Olympics Category:Nigerian footballers Category:Olympic gold medalists for Nigeria Category:Olympic medalists in football Category:Plymouth Argyle F.C. players Category:1998 FIFA World Cup players Category:2002 FIFA World Cup players",
 "title": "Taribo West"
}