{
 "id": "1108195",
 "text": "Joseph Allen Tate (born December 13, 1980) is a politician and used to play professional football. He is from Michigan. Tate has been a Democratic member of the Michigan House of Representatives for District 2 since 2019. He has also been the Speaker of the Michigan House of Representatives since 2023. == Early life == Tate was born in Detroit, Michigan, and is the youngest of four children. His father, Coleman Sr., was a Detroit firefighter who died when Tate was a baby. His mother, Debra, was a Detroit public school teacher. Tate grew up in the Jefferson Chalmers and Sherwood Forest areas of Detroit. Later, his mother moved the family to Southfield, Michigan, where Tate went to Southfield-Lathrup High School and graduated in 1999. == Education and football career == Tate went to Michigan State University on a football scholarship. He played football from 2000 to 2003 and started 29 games as left guard. He earned Academic All-Big Ten honors in 2000 and 2001 and was named second-team All-Big Ten in 2003. The team played in the Alamo Bowl that year but lost to Nebraska. Tate also won MSU's Community Service and Leadership Award. After playing in the NFL for two seasons, Tate returned to Michigan State to get a master's degree in kinesiology and worked as a strength and conditioning assistant in 2007 and 2008. In 2017, he earned a dual MBA/MS from the University of Michigan's Ross School of Business and School of Natural Resources. == National Football League == Tate graduated from Michigan State University in 2003 with a degree in public policy. He then signed with the Jacksonville Jaguars as an offensive lineman. He also played for the Atlanta Falcons and St. Louis Rams. == Marine Corps == In 2009, Tate became a U.S. Marine Corps officer and served two deployments in Afghanistan as a platoon commander and company executive officer during Operation Enduring Freedom. After being honorably discharged, Tate returned to Michigan to pursue his MBA. == Political career == ===Detroit Economic Growth Corporation=== After graduating in 2017, Tate became a program manager at the Detroit Economic Growth Corporation. ===Michigan politics=== On November 6, 2018, Tate won the election and became a member of the Michigan House of Representatives for District 2, which includes parts of Detroit's Lower East Side and the Grosse Pointe area. He was re-elected in 2020. After the Democratic Party gained control of the Michigan House in 2022, Tate became the first African American elected Speaker of the Michigan House of Representatives. == References == Category:1980 births Category:Living people Category:Democratic Party (United States) politicians Category:Politicians from Michigan",
 "title": "Joe Tate"
}