{
 "id": "1108053",
 "text": "Metrolink is a commuter rail system in Southern California. It has stations in Los Angeles, Orange, Riverside, San Bernardino, Ventura, and San Diego Counties. The system started operations with three lines in 1991. There are now eight lines and 69 stations in the system. Metrolink also connects with other public transportation services, such as Los Angeles Metro Rail, Sprinter, and Amtrak. Around 4,861,000 people rode Metrolink in 2023. == Lines == There are eight lines and 69 stations in the Metrolink system. The lines go to different cities and neighborhoods in the Greater Los Angeles area. All lines, except the Inland Empire–Orange County Line, stop at Union Station. It is the major transit station in Los Angeles. Some Metrolink train lines have stations at popular event locations, such as the Pomona Fairplex. Those stations are open only when events are taking place there. Most lines (except the Riverside Line) run on both weekdays and weekends. The table below shows the different lines and where they go to: Line Termini Operation Western/Northern Eastern/Southern Antelope Valley 200 Lancaster Lancaster Los Angeles Union Station Daily Inland Empire–Orange County 800 San Bernardino San Bernardino-Downtown Oceanside Oceanside Daily Orange County 600 Los Angeles Union Station Oceanside Oceanside Daily Riverside 400 Los Angeles Union Station Riverside Riverside-Downtown Weekdays only San Bernardino 300 Los Angeles Union Station San Bernardino San Bernardino–Downtown Daily Redlands Redlands-University (express only) Ventura County 100 Ventura Verntura-East Los Angeles Union Station Daily 91/Perris Valley 700 Los Angeles Union Station Perris Perris-South Daily Arrow 3800 San Bernardino San Bernardino–Downtown Redlands Redlands-University Daily == Fares == To ride Metrolink trains, passengers need to pay the system's fare (ticket). Metrolink's fare includes a fee for riding the train and an additional cost based on the distance traveled. The extra charge goes up by 25 cents for every station the train passes. Tickets can be bought at a Metrolink ticket vending machine. Machines are at every station. Passengers can also buy them on Metrolink's website and mobile app. Metrolink tickets can also be used for most connecting buses and trains. The Los Angeles Metro Rail system and certain Amtrak routes are examples. == Related pages == * Sprinter (light rail) * Los Angeles Metro Rail == References == Category:1992 establishments in California Category:Transport in California Category:Commuter rail",
 "title": "Metrolink (California)"
}