{
 "id": "1108054",
 "text": "The Circassian genocide was a systematic mass murder, ethnic cleansing and expulsion of Circassians in the Caucasus. It was done by the Russian Empire during the Russo-Circassian War, which lasted from 1863 until 1878. * * * The Circassian genocide is deemed the deadliest ethnic cleansing of the 19th century. Between 94–97%; : \"If we assume that Berzhe's middle figure of 50,000 was close to the number who survived to settle in the lowlands, then between 95 percent and 97 percent of all Circassians were killed outright, died during Evdokimov's campaign, or were deported.\": \"with one estimate showing that the indigenous population of the entire north-western Caucasus was reduced by a massive 94 percent.\" of the Circassian population was killed, deported, or forced to flee the Russian Empire during the genocide. == Victims == The Circassians were either mass-murdered or forcibly kicked out of their homeland during the genocide. === Killings === Also see: Genocide Estimates say that between 1 million and 1.5 million people Circassian people were killed in the genocide. Killing methods included impaling people and ripping open the bellies of pregnant women. This was mainly done to intimidate the surrounding population. === Forced migration === Also see: Forced migration As many as 1 to 1.5 million Circassians were forced to run away from their homes; only around half of them survived, according to most sources. Most Circassians who were not killed in the genocide went to the Ottoman Empire. According to Ottoman archives, by 1879, over a million people had migrated to the Ottoman Empire. (However, nearly half died on Ottoman shores from diseases.) If these numbers are correct, the Circassian genocide would be the largest genocide of the 19th century. A small number of Circassians remained in the Russian Empire. Records disagree on how many people still lived in Russia after the genocide: * According to official Russian records, it was 106,798 people * According to the 1897 Russian census, it was 150,000 people\"The Circassian Genocide\" . Unrepresented Nations and People Organisation (UNPO) (14 December 2004). Retrieved April 4, 2007 * According to some Russian historians, it was 40,400 to 65,900 people == Recognition == , Georgia is the only country to recognize that the Circassian genocide occurred. Russia actively denies the Circassian genocide, and classifies the events as a migration (). Circassians commemorate 21 May (the day the genocide began) every year as the Circassian Day of Mourning. On the other hand, some Russian nationalists in the Caucasus region celebrate the day yearly as a \"holy conquest day\". On 21 May, Circassians all over the world protested against the Russian government, especially in cities with large Circassian populations (such as Kayseri and Amman) and in other large cities like Istanbul. == Related pages == * Genocide * Holodomor * The Holocaust * Russian Empire * Assyrian Genocide * Armenian Genocide * Pontic Greek Genocide == References == Category:History of Russia Category:Genocide Category:Caucasus",
 "title": "Circassian genocide"
}