{
 "id": "1109843",
 "text": "Blood lead level (BLL) is a measure of the amount of lead in the blood. Lead is a toxic heavy metal and can cause neurological damage, leading to neurological disorders, especially among children, at any detectable level. High lead levels cause decreased vitamin D and haemoglobin synthesis as well as anemia, acute central nervous system disorders, and possibly death. No level of lead in the blood of children is currently thought to be safe, but in 2021, the US Centers for Disease Control and Prevention (CDC) identified 3.5 μg/dL as the blood lead level of concern in children which should cause further medical investigation. In America, around 2.5% of children have at least this much lead in their blood. ==Measurement== Measuring a person's blood lead level requires a blood sample, which may be performed with a fingerstick or a blood draw. The amount of lead found in the blood sample may be measured in micrograms of lead per deciliter of blood (μg/dL) especially in the United States; 5 μg/dL is equivalent to 0.24 μmol/L (micromolar). BLL cannot measure long-term lead exposure. An x-ray fluorescence test provides measurements from the bone because lead is predominantly stored in the human body in calcified tissues such as bones. ==Demographic and geographic patterns== Blood lead levels are highest in countries where lead is added to petrol or gasoline, where lead is used in paint or soldered products, in urban areas, in areas next to to high road traffic, and in developing countries. In Jamaica, 44% of children living near lead production facilities had BLLs above 25μg/dL. In Albania, 98% of preschool children and 82% of schoolchildren had BLLs above 10μg/dL; preschoolers living near a battery factory had average BLLs of 43μg/dL. In China, 50% of children living in rural areas had BLLs above 10μg/dL, and children living near sites of industry and high traffic had average BLLs ranging from 22 to 68μg/dL. BLL measurements from developed countries decreased a lot in the beginning in the late 1970s, when restrictions were placed on lead use in gasoline, petrol, paint, soldering material and other products. In the United States, average BLLs measured among tens of thousands of subjects went down from 12.8 to 2.8μg/dL between 1976 and 1991. In the 1990s, BLLs of children in Australia were measured to be 5μg/dL, and 9μg/dL in Barcelona, Spain. 7In the United States, blood lead levels remain highest for children, for people in urban centers, for people of lower socioeconomic status, and for minorities. After the phasing out of leaded gasoline in China, blood lead levels of children in that country now appear to be associated with coal consumption. \"Coal consumption fly ash is a dominant source of lead exposure to children in Shanghai.\" As of 2009, coal combustion was considered to be an important source of Pb air pollution in China, the eastern U.S., and to some extent, in Europe. == Related pages == * Lead poisoning * Lead (metal) * Teratology == References == Category:Blood",
 "title": "Blood lead level"
}