{
 "id": "1109544",
 "text": "Micah Kamohoalii (Kumu Micah Kamohoalii) is a Native Hawaiian fashion designer, Hawaiian culture leader, educator, genealogist, filmmaker, and Kumu Hula from Hawaii. He is the founder and CEO of Dezigns by Kamohoalii. Micah serves as the Cultural Director for the Waimea Hawaiian Homesteaders Association and is a Kumu Hula of the traditional Hawaiian dance school Hālau Hula named Hālau Nā Kīpuʻupuʻu of Waimea, Hawaii. == Early life and education == His paternal family comes from the Kapa (bark cloth) traditions, labored work of ancient fabric into a family of Kapa markets. Micah is a descendant of Hawaiian royalty, as his maternal grandfather is a direct descendant of the great King Kamehameha, the House of Kamehameha, and the strong Mahi Clan of Kohala. == Hālau == Micah is well respected Kumu hula leading his dynamic Hālau named Hālau Nā Kīpuʻupuʻu, a traditional Hawaiian school of dance. He received the family hālau and started teaching in 2004, focusing on native Hawaiian practices, protocols, arts, customs, culture, and dance. == Career == In 2005, Micah founded the clothing company Dezigns by Kamohoalii. The company offers traditional Hawaiian designs of clothing with modern styles. Inspired by his family's rich tradition in the art of kapa, his clothing line has received attention and appreciation from Hawaiian and international customers. Kamohoalii became the first Hawaiian fashion designer and brand invited to the official New York Fashion Week to present his clothing collection. The brand's emotional performance celebrating Hawaiian culture and history received a standing ovation. He received the coveted invites from London Fashion Week, Milan Fashion Week, and Paris Fashion Week in Europe. Micah is the first Hawaiian fashion designer and Hawaii-based brand to be invited and to present in the \"Big Four\" of fashion weeks, including New York, London, Milan, and Paris. == References == Category:Fashion designers Category:Genealogists Category:Educators Category:Filmmakers",
 "title": "Micah Kamohoalii"
}