{
 "id": "1109660",
 "text": "Vision is a character in the Marvel Cinematic Universe (MCU), portrayed by actor Paul Bettany. Based on the Marvel Comics character of the same name, he first appeared in Avengers: Age of Ultron (2015), where he was created by Tony Stark and Bruce Banner using the Mind Stone and the body of the android called Ultron. Vision is a synthezoid, a being made of synthetic materials, which grants him superhuman abilities, including strength, flight, and the ability to manipulate his density, allowing him to become intangible. == Overview == Vision possesses the Mind Stone, one of the six Infinity Stones, which imbues him with advanced intelligence and consciousness. The Stone is embedded in his forehead and is a source of much of his power. Vision often serves as a moral compass among the Avengers. His philosophical outlook on humanity contrasts with more aggressive characters, and he grapples with what it means to be \"alive.\" Vision has a deep romantic connection with Wanda Maximoff (Scarlet Witch), portrayed by Elizabeth Olsen. Their relationship is a significant aspect of his character development, exploring themes of love, loss, and identity. Vision plays a central role in the Disney+ series WandaVision (2021), where the narrative revolves around Wanda's grief after Vision's death in Avengers: Infinity War (2018). The series explores their relationship and Vision's existence in a constructed reality created by Wanda. This series allowed for a deeper exploration of Vision's character and his complexities. Throughout his appearances, Vision embodies themes related to identity, existence, and the nature of humanity. His struggles with self-understanding and his role in a world filled with heroes and gods add depth to his character. Vision remains an integral part of the MCU, and his character is explored through various narratives that intertwine with the larger story arcs of the Avengers and other heroes. == Appearances == === Movie appearances === Year Movie Portrayed by 2015 Avengers: Age of Ultron Paul Bettany 2016 Captain America: Civil War 2018 Avengers: Infinity War === Television appearances === Year Television series Seasons Episodes Portrayed by 2021 WandaVision 1 9 Paul Bettany 2021-2024 What If...? 3 26 Category:WandaVision Category:Marvel Cinematic Universe characters Category:Marvel Comics movie characters",
 "title": "Vision (Marvel Cinematic Universe)"
}