{
 "id": "1109591",
 "text": "Advanced Media Broadcasting System (AMBS) is a broadcast media company in the Philippines. Its main offices and facilities are located at Unit 906A of the Paragon Plaza Building and at the 3rd Floor of Starmalls EDSA Shaw complex. They are both in Mandaluyong, Metro Manila. Founded in 1994 by the Vera family, it is owned by the Villar Group-backed All Value Holdings Inc. ==History== ===Early years=== The head of Quest Broadcasting, Jose Luis Vera, made Advanced Media Broadcasting System in 1994. It got its Congressional franchise granted the following year. Jinji Buhain helped them buy 103.5 DWCS. They got it from the Roman Catholic Archdiocese of Manila. They changed the call sign to DWKX. That started K-Lite, a modern adult station. The station, along with four other Vera-controlled Metro Manila stations - (Jam 88.3, Wave 89.1, Magic 89.9 and 99.5 RT) and the Killerbee provincial network - formed The Radio Partners in the early 2000s before being reorganized in 2011 under the new Tiger 22 Media group. ===Under Villar ownership=== In 2019, AMBS was granted a 25-year legislative franchise extension under Republic Act No. 11253, albeit without President Rodrigo Duterte's signature as the bill lapsed into law after 30 days of inaction. The Vera family and AMBS president Andrew Santiago, however, decided to sell the company to Planet Cable of real estate magnate and businessman-politician Manny Villar after its FM station (K-Lite) was in the red due the effects of the COVID-19 pandemic. On January 5, 2022, the National Telecommunications Commission (NTC) awarded AMBS a provisional authority to operate for the digital Channel 16 frequency (previously assigned to ABS-CBN Corporation) for an 18-month test broadcast period; and for the analog Channel 2 frequency under a temporary assignment for simulcast purposes until analog shut-off in 2023. The construction of AMBS's own digital terrestrial television network in Metro Manila was expected to be completed in July 2022. In June 2022, AMBS Manila began its test broadcast. On September 1, 2022, TV Host Willie Revillame announced that the TV station of AMBS will be named as ALLTV. Initially targeted on October 1, 2022, ALLTV made its soft launch on September 13, 2022, at 12 pm PHT, with plans of expanding it nationwide by the end of the year or even sooner; the grand launch will take place in early 2023. On July 15, 2022, during his contract signing with AMBS, Revillame announced that his variety show Wowowin would return on ALLTV since its final broadcast on GMA Network on February 11, 2022. ====Partnership with ABS-CBN==== On April 15, 2024, ABS-CBN's flagship news programs TV Patrol and TV Patrol Weekend, along with programs from Jeepney TV, morning talkshow Magandang Buhay and later the noontime show It's Showtime, commenced airing on ALLTV. This marked the return of some ABS-CBN programs on channels 2 and 16 in Manila, frequencies previously held by the said content provider. The partnership between ABS-CBN and AMBS was formalized after the two companies signed content agreements on April 23, 2024, which took effect on May 13, 2024. ==Stations== ===Radio=== Branding Callsign Frequency Power kW Location All Radio DWOW 103.5 MHz 25 kW Metro Manila ===Television=== ===Analog=== Branding Callsign Ch. # Power kW (ERP) Station Type Location (Transmitter Site) All TV Manila DZMV-TV 2 30 kW (100 kW ERP) Originating Sgt. Esguerra Avenue cor. Mother Ignacia Street, Quezon City, Metro Manila All TV Baguio DWAY-TV 3 10 kW Relay Mt. Sto. Tomas, Tuba, Benguet All TV Mountain Province 11 5 kW Relay Mt. Amuyao, Barlig, Mountain Province All TV Abra 11 5 kW Relay Peñarrubia, Abra All TV Ilocos Norte 7 5 kW Relay San Nicolas, Ilocos Norte All TV Ilocos Sur 11 5 kW Relay Mt. Caniao, Bantay, Ilocos Sur All TV Tuguegarao DWOW-TV 3 5 kW Relay Taft Street cor. Colleges Avenue, Tuguegarao All TV Isabela 2 5 kW Relay Santiago, Isabela All TV Pampanga DWAP-TV 46 5 kW Relay Brgy. Lara, San Fernando, Pampanga. All TV Tarlac DWAL-TV 34 5 kW Relay MacArthur Highway, St. Cristo, Tarlac City All TV Olongapo 12 5 kW Relay 5/F KT Tower, Afable cor. 18th Sts., East Bajac-Bajac, Olongapo All TV Botolan 13 5 kW Relay Brgy. Binuclutan, Botolan, Zambales, All TV Batangas DWAV-TV 10 10 kW Relay Mt. Banoy, Brgy. Talumpok East, Batangas City. All TV Lucena 24 5 kW Relay Maharlika Highway, Brgy. Kanlurang Mayo, Lucena. All TV Occidental Mindoro 11 5 kW Relay Brgy. 1 Poblacion, San Jose, Occidental Mindoro All TV Palawan 7 5 kW Relay Mabini cor. Valencia Streets, Brgy. Masipag, Puerto Princesa City All TV Naga 11 10 kW Relay Panganiban Drive, Naga City. All TV Legazpi 4 5 kW Relay Mount Bariw, Estanza, Legazpi City, Albay. All TV Tabaco 10 5 kW Relay Brgy. Fatima, Tabaco, Albay. All TV Daet 10 5 kW Relay Rooftop, TJ Building, Vinzons Ave., Daet, Camarines Norte All TV Catanduanes DWAU-TV 7 5 kW Relay Brgy. San Jose Poblacion, Virac, Catanduanes. All TV Masbate 10 5 kW Relay Moises R. Espinosa Sr. Compound, Zurbito Street, Tugbo, Masbate All TV Sorsogon 9 5 kW Relay BacMan Geothermal Production Field, Brgy. Buenavista, Sorsogon City. All TV Kalibo 9 5 kW Relay 3/F Garcia Building, C. Laserna St., Poblacion, Kalibo, Aklan. All TV Roxas 21 10 kW Relay Brgy. Milibili, Roxas City, Capiz. All TV Bacolod DYAG-TV 4 10 kW Relay Mt. Kanlandog, Murcia, Negros Occidental under Bacolod All TV Iloilo 10 10 kW Relay Brgy. Alaguisoc, Jordan, Guimaras, All TV Bohol 9 5 kW Relay Jagna, Bohol All TV Cebu DYMV-TV 3 10 kW Relay Mt. Busay, Brgy. Babag 1, Cebu City All TV Dumaguete 12 5 kW Relay Mt. Palinpinon, Valencia, Negros Oriental All TV Tacloban 2 5 kW Relay Mt. Naga-Naga, Tacloban; Under 5th Floor, Uytingkoc Bldg., Avenida Veteranos St. All TV Iligan 4 5 kW Relay 6/F Elena Tower Bldg., Andres Bonifacio Ave. (Tibanga Highway), Iligan All TV Cagayan de Oro DXAL-TV 10 kW Macapagal Dr. (formerly Greenhills Rd.), Brgy. Bulua, Cagayan de Oro All TV Davao DXAK-TV Broadcast Ave., Shrine Hills, Matina, Davao City All TV General Santos rowspan=\"2\" 3 Brgy. City Heights, General Santos All TV Zamboanga San Jose Road, Zamboanga City ====Digital==== AMBS' upcoming expansion of its digital terrestrial television will be announced soon as possible in other key cities nationwide. Branding Callsign Ch. # Frequency Type Power kW (ERP) Location (Transmitter site) ALLTV Manila DZMV-TV 16 485.143 MHz Originating 10 kW (Max: 30 kW) Sgt. Esguerra Avenue cor. Mother Ignacia Street, Quezon City, Metro Manila ALLTV Baguio DWAY-DTV 30 569.143 MHz Relay 10 kW (Max: 60 kW) Mt. Sto. Tomas, Tuba, Benguet under Baguio ALLTV Tuguegarao DWOW-DTV 35 599.143 MHz 5 kW Taft Street cor., College Avenue, Tuguegarao ALLTV Pampanga DWAP-DTV 34 593.143 MHz Brgy. Lara, San Fernando, Pampanga ALLTV Tarlac DWAL-DTV MacArthur Highway, Brgy. Sto. Cristo, Tarlac City ALLTV Batangas DWAV-DTV 46 665.143 MHz 10 kW (Max: 30 kW) Mt. Banoy, Brgy. Talumpok East, Batangas City ALLTV Catanduanes DWAU-DTV 28 557.143 MHz 5 MHz Brgy. San Jose Poblacion, Virac, Catanduanes ALLTV Iloilo 16 485.143 MHz 10 kW Brgy. Alaguisoc, Jordan, Guimaras under Iloilo City ALLTV Bacolod DYAG-DTV Mt. Kanlandog, Murcia, Negros Occidental under Bacolod ALLTV Cebu DYAE-DTV 10 kW (Max: 30 kW) Mt. Busay, Brgy. Babag 1, Cebu City ALLTV Cagayan de Oro DXAL-DTV Macapagal Dr. (formerly Greenhills Rd.), Brgy. Bulua, Cagayan de Oro ALLTV Davao DXAK-DTV Broadcast Ave., Shrine Hills, Matina, Davao City ==References== Category:Entertainment companies Category:Companies of the Philippines Category:Philippine television networks",
 "title": "Advanced Media Broadcasting System"
}