{
 "id": "1109449",
 "text": "The Ranchi Lok Sabha constituency is one of the 14 parliamentary constituencies in the state of Jharkhand, India. It covers the capital city of Ranchi and surrounding areas. The constituency holds significant political importance in the state and has been represented by various notable leaders over the years. == Geography and demographics == Ranchi constituency encompasses urban and semi-urban areas, including the state capital, Ranchi. The city is known for its diverse population, comprising various ethnic groups and communities, with a significant number of tribal populations. The constituency has a mix of urban development and rural areas, contributing to a varied socio-economic demographic. == Assembly segments == As of the latest delimitation, the Ranchi Lok Sabha constituency has six assembly segments: * Ranchi * Hatia * Kanke (SC) * Khijri (ST) * Silli * Tamar Each of these segments has distinct characteristics, influencing the overall electoral dynamics of the constituency. == Political history == Ranchi Lok Sabha constituency has witnessed political contests predominantly between the Bharatiya Janata Party (BJP) and the Indian National Congress (INC), although other regional parties also play crucial roles. Historically, the constituency has seen varied political representation, reflecting the changing political landscape of Jharkhand. == Key members of Parliament == * Ramtahal Choudhary (BJP): He served multiple terms, representing the constituency in the 12th, 13th, 14th, and 15th Lok Sabha. * Subodh Kant Sahay (INC): A prominent Congress leader, he has served several terms and held ministerial positions in the central government. * Sanjay Seth (BJP): The current Member of Parliament, elected in the 2019 general elections. Election Results In the 2019 general elections, Sanjay Seth of the BJP won the seat by a significant margin, reflecting the constituency's leaning towards the party at the time. The constituency has a history of competitive elections, with voter turnout typically reflecting the national average. == Cultural and economic significance == Ranchi, as a city and constituency, holds cultural and economic significance. It is a hub for sports, especially cricket and hockey, producing notable sports personalities like Mahendra Singh Dhoni. The economy is driven by a mix of industries, including manufacturing, trade, and services, with a growing emphasis on information technology and education sectors. == Future prospects == The political dynamics of Ranchi Lok Sabha constituency are expected to evolve with the changing socio-economic landscape. Continuous efforts towards development, addressing key issues, and effective representation in the Parliament will shape the future prospects of the constituency. == Related pages == * Election Commission of India * Government of Jharkhand Category:Constituencies of the Lok Sabha Category:Jharkhand",
 "title": "Ranchi Lok Sabha constituency"
}