{
 "id": "1109260",
 "text": "This is a list of awards received by American actress and model Chloë Grace Moretz. == Alliance of Women Film Journalists == Year Award Nominated work Result Ref. 2023 Best Animated Female Nimona == Annie Awards == Year Award Nominated work Result Ref. 2024 Outstanding Achievement for Voice Acting in an Animated Feature Production Nimona == Austin Film Critics Association Awards == Year Award Nominated work Result Ref. 2024 Best Voice Acting/Animated/Digital Performance Nimona == Broadcast Film Critics Association Awards == Year Award Nominated work Result Ref. 2011 Best Young Actress Let Me In == Critics' Choice Super Awards == Year Award Nominated work Result Ref. 2024 Best Actress in a Superhero Movie Nimona == Elle Style Awards == Year Award Nominated work Result Ref. 2013 Elle Style Award for Next Future Icon == Empire Awards == Year Award Nominated work Result Ref. 2011 Best Newcomer Kick-Ass == MTV Movie & TV Awards == Year Award Nominated work Result Ref. 2011 Best Breakthrough Performance Kick-Ass Best Hero Biggest Badass Star Best Fight (shared with Mark Strong) 2013 Biggest Teen Bad Kicking Ass Kick-Ass 2 == People's Choice Awards == Year Award Nominated work Result Ref. 2012 Favorite Movie Star Under 25 Hugo 2015 Favorite Dramatic Movie Actress == People Magazine Awards == Year Award Nominated work Result Ref. 2014 Next Generation Star == Saturn Awards == Year Award Nominated work Result Ref. 2011 Best Performance by a Younger Actor Let Me In 2012 Hugo Nominations for the 38th Annual Saturn Awards 2013 Dark Shadows 2014 Carrie 2015 The Equalizer == Scream Awards == Year Award Nominated work Result Ref. 2010 Best Fantasy Actress Kick-Ass Best Superhero Best Breakout Performance - Female 2011 Best Horror Actress Let Me In == Teen Choice Awards == Year Award Nominated work Result Ref. 2010 Choice Movie: Female Breakout Kick-Ass 2015 Choice Movie Actress: Drama If I Stay 2016 Choice Movie Actress: Comedy Neighbors 2: Sorority Rising Choice Movie Actress: Sci-Fi/Fantasy The 5th Wave == Women Film Critics Circle Awards == Year Award Nominated work Result Ref. 2023 Best Animated Female Nimona == Women in Film Crystal + Lucy Awards == Year Award Nominated work Result Ref. 2012 Face of the Future == Young Artist Award == Year Award Nominated work Result Ref. 2006 Best Performance in a Feature Film - Young Actress Age Ten or Younger The Amityville Horror 2007 Best Performance in a Feature Film - Young Actress Age Ten or Younger Big Momma's House 2 Best Performance in a TV Series - Guest Starring Young Actress Desperate Housewives 2008 Best Performance in a Voice-Over Role My Friends Tigger & Pooh Best Performance in a TV series – Recurring Young Actress Dirty Sexy Money 2010 Best Performance in a Feature Film - Supporting Young Actress 500 Days of Summer 2011 Best Leading Young Actress in a Feature Film Kick-Ass Best Performance in a Feature Film Let Me In Best Performance in a Feature Film Diary of a Wimpy Kid 2012 Best Leading Young Actress in a Feature Film Hugo == Young Hollywood Awards == Year Award Nominated work Result Ref. 2014 Fan Favorite Actor Female == Notes == ==References== Category:Lists of awards and nominations",
 "title": "List of awards and nominations received by Chloë Grace Moretz"
}