{
 "id": "1109947",
 "text": "Poland was occupied by the Soviets from 1939 - 1941 after an invasion in September and October. Then the Soviet Union was invaded by Germany and the axis in 1941 with the soviet occupied areas being occupied by Germany. Then Poland would be ‘liberated’ by the soviets in World War II. Poland was under a Soviet-styled government for over forty years. == World War II == On September 17 1939, the Soviet Union invaded Poland as part of an invasion that started 2 weeks earlier when Germany invaded on the 1st. On October 6, Poland surrendered. The eastern parts of the country went to the Soviets. (with the north east going to Belarus and the south east going to Ukraine) Nazi Germany invaded the Soviet Union on June 22 1941. And capturing the soviet occupied areas. (with some parts going to the General Government) the Soviets entered the German occupied areas in 1944 and set up the Polish Committee of National Liberation and reaching the gates of Warsaw when an Uprising was going. But the Soviets didn't help. The Provisional Government of the Republic of Poland Was formed on December 31 1944. Fighting would continue until 14 May 1945 when the last German forces in Poland surrendered. the Provisional Government of National Unity was formed June 1944 and would later become an original member of the United Nations. (an organisation for World peace) == Post World War II == the Polish People's Republic was set up after the war ended, it was a puppet regime set up by the occupying Soviets, rebellions happened all were crushed, in 1955, after West Germany joined NATO, the Warsaw Pact was formed and Poland joined it. Poland participated in the successful Warsaw Pact invasion of Czechoslovakia in 1968. In 1981, Martial law began in Poland. This would end in a government victory against anti-government protesters in 1983. In 1990, the USSR was losing the Cold War and the Warsaw pact countries gained independence from the pact, including Poland which brought back the Polish government-in-exile, which had been in exile since 1939. == Maps == File:Poland 1930.svg|Map of Poland pre World War II File:Poland 1956-1990.svg|Map of Poland post World War II Category:20th century in Poland",
 "title": "Soviet occupied Poland"
}