{
 "id": "1109377",
 "text": "DAM (Arabic: دام) meaning \"ever-lasting\" or short for \"Da Arab MC's\" is a Palestinian hip hop band based in the city of Lod in Israel. The band is known for highlighting issues faced by Palestinians. They critique the Israeli government, Arab authorities, and also address topics such as women's rights in the Arab world. They are nowadays one of the most popular Arab hiphop bands and give concerts worldwide. Their music is famous for the way it sheds light on Palestinians' perspectives on the Israeli-Palestinian conflict. == History == The band started by Tamer Nafar's early passion for rap and music. He involves his younger brother, Suhell Nafar, and together they start releasing songs. Eventually, their friend Mahmoud Jrere comes into the picture when he reaches out to the brothers because of their shared interest in rap and music. Together they form the band group DAM. In the beginning the band does not involve politics into their songs, and mainly talk about current-day topics outside the scope of the Israeli-Palestinian conflict. They even performed together with music artist Subliminal, a rapper who is known for being a fanatic Jewish-Israeli nationalist and also performs this in his songs. This changes when they bring out their song called Meen Erhabi, which translates to Who is the Terrorist? The song is a protest song showcasing the discrimination they experience as Arabs in Israel. A story is being sketched within the song that shows the public what daily life feels like for a Palestinian living under occupation. On the international stage this brought the group a lot of attention and also prescribed them as one of the first Arab hiphop bands. The song was downloaded over a million times. === Nowadays === The band is now less active than it was in their earlier years. It consists of four set members now, with Maysa Daw. In addition to his involvement with DAM, Tamer Nafar also has a career as a single artist. Suhell Nafar is a Music Supervisor in a Netflix show called MO and is also the head of an independent label called WANA. == Message == DAM tries to get their messages across clearly on the world stage through protest music. One of the main issues they address is regarding the inequality between men and women within their own community. The biggest and most famous theme coming back in almost all of their songs is the Arab / Palestinian identity. The humiliation, oppression and overall experiences of being a Palestinian are put forward in their songs.The group believes in a transnational struggle for oppressed peoples and aim for spreading their message and narrative worldwide. After all, they sing and rap in the three languages Arabic, Hebrew and English to get their message across to the largest possible audience. == Uproar == In the fall of 2018, DAM performed at a university in the Israeli city of Beer Sheva. This performance was with a lot of resistance and threats from students, wanting to cancel the show. Despite this obstacle, DAM continued the concert. Their song If I Could Go Back In Time, which was released in 2012, also attracted a lot of criticism, including within the Palestinian community. The song had honor killing as its theme and was interpreted by many as a degradation of the status of Palestinian women. == Discography == === Albums === * Ihda’ (2006) * Dabke on the Moon (2012) * Ben Haana Wa Maana (2019) === References === Category:Hip hop bands Category:Hip hop musicians Category:Musical groups Category:Palestinian musicians",
 "title": "DAM (band)"
}