{
 "id": "1110335",
 "text": "Ali Baba Bujang Lapok is a 1961 black-and-white comedy film from Singapore. It was directed, written by, and starred P. Ramlee. The movie, produced by Malay Film Productions Ltd, is based on the Ali Baba story from 1001 Arabian Nights. It has humor, burlesque, satire, and farce. The title includes \"Bujang Lapok\" because it's the third movie in the Bujang Lapok series, featuring P. Ramlee, S. Shamsuddin, and Aziz Sattar. It is the first film with Sarimah and one of the few where P. Ramlee plays a villain. ==Plot== Ali Baba (Aziz Sattar) is poor and often sends his wife to borrow flour from his brother Kassim Baba (S. Shamsuddin). Kassim gets angry and tells his wife Norsiah that Ali Baba is useless. When Norsiah asks for flour again, Kassim sends her home in tears. She blames Ali Baba for their problems. Ali Baba finally goes to the woods to gather firewood and sees 40 thieves hiding their loot. He hears their leader (P. Ramlee) sing a verse to open a cave. After they leave, Ali Baba uses the verse to open the cave and takes a box of gold coins. With the gold coins, Ali Baba repays Kassim and lives better. Kassim becomes curious and Ali Baba tells him about the cave but not the closing verse or the thieves. Kassim rushes to the cave to steal everything. The thieves return, find the cave open, and close it, trapping Kassim. They kill him. When Kassim doesn’t come home, Ali Baba finds his brother's body and bribes the cobbler Apek to sew it together. The thieves hear about Apek’s strange job and identify Kassim Baba as the man they killed. They plan to rob Ali Baba's house but fail twice because of Marjina, Ali Baba’s servant. The leader of the thieves pretends to be an oil merchant and visits Ali Baba, hiding his men in oil jars in the courtyard. Marjina finds the hidden thieves and, with Ali Baba's wife and sister-in-law, pours boiling oil into the jars. Marjina kills the leader and Ali Baba, grateful, sets her free. ==Anachronisms== Although Ali Baba Bujang Lapok is set in a Middle-Eastern-like period, it includes many deliberate anachronisms for humor. These include bicycles, motorcycles, trucks, a Vespa scooter, telephones, and guns (like a punt gun). The 40 thieves dress in various out- of-time costumes, such as a cowboy, a wig-wearing judge, and a World War II Japanese soldier. The thieves also run their operation like a business, offering health benefits, bonuses, and overtime pay. This is played for laughs, such as when the leader refuses a job on a public holiday, and warns of union action if the requester hires other thieves. The movie mocks the legal status of cannabis and opium in British Malaya. In one scene, a vendor claims cannabis and opium are legal but belacan is illegal since it's smuggled from Malaya, which is the opposite of the actual laws. The words for cannabis and opium were muted out. Signs in the movie are written in the Jawi script. ==Cast== * P. Ramlee as Ketua Penyamun (Leader of the Thieves) * Aziz Sattar as Ali Baba * S. Shamsuddin as Kassim Baba * Normadiah as Aloyah * Sarimah as Marjina * K. Fatimah as Norsiah * Ibrahim Pendek as Sarjan (Sergeant; Thief Second-in-Command) * Leng Husin as Apek Tukang Kasut (Chinese Shoe Repairman) * A. Rahim as Penyamun Bin Momotarosan (Thief, son of Momotarosan) * H. M. Busra as Penyamun Gemuk (Fat Thief) * Shariff Dol as Orang Kaya Muflis (The Bankrupt Rich Man) * M. Rafee as Penyamun Bin Rafee (Thief, son of Rafee) * Ali Fiji as Penyamun Bin Fiji (Thief, son of Fiji) * Sarban Singh as Penyamun Bin Singh (Thief, son of Singh) * Kemat Hassan as Orang Kaya (Rich Man) * M. Zain as Tukang Lelong Hamba Abdi (Slave Auctioner) * Nyong Ismail as Tuan Tabib (Medicine Man) * Zaiton as Penghibur Gundik (Harem Dancer) * S. Kadarisman as Tukang cuci mayat (Mortician) * Mustarjo as Hamba kedi (Transvestite Slave) * Ahmad C as Bad Shoe Bandit * S. Sudarmaji as Thief * A. Galak as Thief * Harun Omar as Thief * Ramu Kechik as Thief * Dek Wan Chik as Thief * Hashim Salleh as Thief * Ibrahim Hassan as Thief * Darus Shah as Thief * Ahmad Ghani as Thief * Abdul Kadir Mamat @ Pak Kadir as Thief ==Related pages== * P. Ramlee filmography Category:1961 movies Category:Singaporean movies",
 "title": "Ali Baba Bujang Lapok"
}