{
 "id": "1110550",
 "text": "Kenneth Marlowe, also known as Katherine \"Kate\" Marlowe Bies, was born on November 26, 1926, in Des Moines, Iowa. He later moved to Tipton, Nebraska. From a young age, Kenneth showed a keen interest in the entertainment industry. == Career == === Exotic Dancer === In 1948, Kenneth worked as an exotic dancer at Club My-O-My in New Orleans, a prominent venue known for its lively performances. === Hairdresser === During the late 1950s and early 1960s, Kenneth became a renowned hairdresser, catering to celebrities like Gypsy Rose Lee, Phyllis Diller, and Imogene Coca. === Entertainer === In 1971, Kenneth hosted \"The Tricia Nixon Wedding/Vaudeville Returns\" show at the Nob Hill Theatre in San Francisco. This event showcased his versatility and charisma as an entertainer. == Transition and Advocacy == In 1975, Kenneth transitioned and became Katherine \"Kate\" Marlowe Bies. To support the transition, Kate held a fundraiser called \"The Ball to End All Balls\" at the California Hall in San Francisco, attended by notable figures including journalist Armistead Maupin and performer Sally Rand. The event was widely covered and highlighted the support Kate received from her community. == Personal Life == === Marriage === On June 29, 1977, Kate married Robert \"Lonnie\" Barnes, an inmate at San Quentin Prison, making her the first transgender person to marry in a California State Prison. This marriage marked a significant milestone in the recognition of transgender rights. == Literary and Theatrical Contributions == === Mr. Madam === In 1964, Kenneth authored the best-seller \"Mr. Madam: Confessions of a Male Madam,\" which provided an insightful look into his life and experiences. The book received considerable acclaim and established Kenneth as a notable author. === Plays === In June 2022, a play titled \"Mr. Madam\" premiered in Portland, Oregon, featuring Wade McCollum as Kenneth/Kate. The play was later rewritten and renamed \"Make Me Gorgeous!\" It premiered off-Broadway at Playhouse 46 in New York City on November 10, 2023, and received strong critical praise, being hailed as one of the best plays of 2023. == Legacy == Kate Marlowe's life and career left a lasting impact on the LGBTQ+ community. Her courage and resilience continue to inspire many, and her contributions to literature and entertainment are celebrated. == References == Category:Transgender Category:1926 births Category:1990 deaths Category:People from Des Moines, Iowa Category:People from New Orleans Category:People from San Francisco",
 "title": "Kenneth Marlowe"
}