{
 "id": "1110521",
 "text": "\"Days Gone Bye\", also known as \"Pilot\", is the first episode of the first season and series premiere of The Walking Dead, a 2010–2022 post-apocalyptic horror television series based on the comic series of the same name. Written and directed by Frank Darabont, the episode aired on AMC on October 31, 2010 and ran for 67 minutes. The episode follows police officer Rick Grimes (Andrew Lincoln) as he wakes from his coma to find the world ruled by zombies and makes his way to Atlanta to find his family. == Plot == In the prologue, police officer Rick Grimes (Andrew Lincoln) is searching for gasoline to power his police car. He passes various broken cars and a sign that reads \"NO GAS\". He then notices a young girl (Addy Miller) grabbing a teddy bear off the ground and calls out to her several times. She turns around, revealing herself to be a zombie. The zombie girl then approaches Rick, who shoots her in the head with a Colt Python, killing her. After the title sequence, Rick and his friend Shane Walsh (Jon Bernthal) appear in a police car together. They get a call on the radio and join a car chase that turns into a shooting between the police and a group of three criminals. One of the three criminals shoots Rick in the shoulder, putting him into a coma. He phases in an out of consciousness in the hospital, seeing Shane give him flowers and nurses coming in and out of the room. When Rick wakes up, he finds the hospital abandoned. He gets out of bed and stumbles his way around, eventually finding a pair of boarded doors that have the words \"DON'T OPEN DEAD INSIDE\" written over them in blood. When Rick approaches the door, he sees a deformed hand push through. Rick exits the hospital and sees rotten corpses everywhere. He makes his way back to his house, calling out for his wife Lori Grimes (Sarah Wayne Callies) and his son Carl Grimes (Chandler Riggs). He leaves the house after failing to find them and sees a figure in the distance. He waves at the figure and then is knocked unconscious by Duane Jones (Adrian Kali Turner). == Reception == === Ratings === The episode became the most-viewed series premiere in the history of AMC, airing to 5.3 million viewers. === Accolades === The episode was nominated for and won several accolades at the 63rd Primetime Creative Arts Emmy Awards. === Legacy === In \"What Comes After\", the fifth episode of the ninth season of The Walking Dead, various callbacks are made to \"Days Gone Bye\". Rick Grimes hallucinates about himself and Shane Walsh being in the police car and himself riding into Atlanta on a horse. == Notes == == References == Category:2010 television episodes",
 "title": "Days Gone Bye"
}