{
 "id": "1110075",
 "text": "Armatoles or Armatoloi (Greek plural Αρματολοί; singular Armatolos, Αρματολός; ; ; ) were Christian Greek militiamen. They were paid by the Ottomans to enforce the authority of the Sultan in an district called an Armatoliki (Greek singular Αρματολίκι; plural Armatolikia, Αρματολίκια). There were also Albanian, Aromanian, Bosnian and Megleno-Romanian armatoles. ==Name== The word armatolos in Greek means \"someone who deals with arms\" or \"an armed person\".. ==Greek armatoles== ===History=== The armatoles as an institution, known as armatolismos, began in the Byzantine era of Greek history. Armatolismos was a kind of feudalism where guard duties were offered in exchange for land titles. The armatoles first appeared in Agrafa, Thessaly during the reign of Sultan Murad II (r. 1421–1451). From there, they spread to other parts of Greece except the Peloponnese. While conquering Greece in the 15th century, the Ottomans made treaties with the armatoles to have them maintain their guard duties. During the Greek Revolution of 1821, the armatoles and the klephts formed the core of the Greek military (Yannis Makriyannis, a Greek revolutionary, called them the \"yeast of liberty\"). ===Organization=== In the hierarchy of an armatoliki, every captain (καπετάνιο) had under his command rank-and-file soldiers called palikaria (παλικάρια, from ancient Greek pallix). And among the palikaria were section leaders called protopalikara (πρωτοπαλίκαρα). The main weapon used by the palikaria was a gun called a kariofili (καριοφίλι).A front-loading gun from Cario & Figlio, an 18th-century maker of such guns. ==Other armatoles== Albanian armatoles were used specially in the second half of the 18th century by the Ottomans. During the administration of the Pashalik of Yanina by Ali Pasha, many Greek armatoles were removed, becoming klephts, and replaced by Albanians.. In Bosnia, armatoles were largely recruited from the local Muslim population. Aromanian armatoles often fought with pro-Bulgarian bands such as the Secret Macedo- Adrianopolitan Revolutionary Organization (TMORO). Examples of Aromanian armatoles include Ioryi Mucitano and Cola Nicea. There were also Megleno- Romanian armatoles like Traian Cucuda.. ==Gallery== File:BoningtonArmatolos.jpg|Greek armatolos by Richard Parkes Bonington, 1825–1826. File:BASA-1932K-1-426-5-Georgi Kasapcheto.jpg|Aromanian armatole, Ioryi Mucitano. File:Cola Nicea IMARO Band.jpg|Cola Nicea (person on the far left) and his band of armatoles, 1907. ==Related pages== *Klepht ==References== ===Citations=== ===Sources=== * * * * * * ==Further reading== * * ==Other websites== *Armatolii: Vulturii Pindului Category:Greek people Category:Albanian people Category:History of Bosnia and Herzegovina",
 "title": "Armatoles"
}