{
 "id": "1110207",
 "text": "This article lists the presidents of Poland. The president of Poland is the head of state of the country. ==Presidents of the Polish National Government (1830–1831)== Portrait Portrait Name (Birth–Death) Entered office Left office 1 Prince Adam Jerzy Czartoryski (1770–1861) 3 December 1830 15 August 1831 – Józef Chłopicki (1771–1854) (dictator) 5 December 1830 17 January 1831 2 General Jan Stefan Krukowiecki (1772–1850) 17 August 1831 7 September 1831 3 Bonawentura Niemojowski (1787–1835) 8 September 1831 23 September 1831 4 Jan Nepomucen Umiński (1778–1851) 23 September 1831 23 September 1831 5 Maciej Rybiński (1784–1874) 25 September 1831 9 October 1831 ==Presidents of the National Government of the Republic of Poland (1846)== Portrait Portrait Name (Birth–Death) Entered office Left office – Tyssowski National Government of the Republic of Poland (triumvirate): Jan Tyssowski (President) (1811–1857) Ludwik Gorzkowski (1811–1857) Aleksander Grzegorzewski (1806–1855) 22 February 1846 24 February 1846 – Jan Tyssowski (1811–1857) (dictator) 24 February 1846 3 March 1846 ==President of the National Committee in Poznań (1848)== Portrait Portrait Name (Birth–Death) Entered office Left office 1 Gustaw Potworowski (1800–1860) 20 March 1848 9 May 1848 ==Presidents of the Polish National Government (1863–1864)== Portrait Portrait Name (Birth–Death) Entered office Left office 1 Stefan Bobrowski (1840–1863) 21 January 1863 17 February 1863 – Ludwik Mierosławski (1814–1878) (dictator) 17 February 1863 11 March 1863 – Marian Langiewicz (1827–1887) (dictator) 11 March 1863 18 March 1863 2 Stefan Bobrowski (1840–1863) 21 March 1863 12 April 1863 3 Agaton Giller (1831–1887) 12 April 1863 23 May 1863 4 Franciszek Dobrowolski (1830–1896) 23 May 1863 9 June 1863 5 Piotr Kobylański (1823–1868) 9 June 1863 10 June 1863 6 Karol Majewski (1833–1897) 14 June 1863 17 September 1863 7 Franciszek Dobrowolski (1830–1896) 17 September 1863 17 October 1863 8 Romuald Traugutt (1826–1864) (dictator.) 17 October 1863 10 April 1864 – Aleksander Waszkowski (1841–1865) 12 April 1864 19 December 1864 9 Bronisław Brzeziński (1837–1865) 20 April 1864 October 1864 ==Republic of Poland (1918–1939)== ===Chief of State=== Portrait Portrait Name (Birth–Death) Entered office Left office Political party Notes – Józef Piłsudski (1867–1935) 14 November 1918 11 December 1922 Independent Provisional Chief of State until 1918 ===President of the Republic=== Portrait Name (Birth–Death) Entered office Left office Political party Election Notes 1 Gabriel Narutowicz (1865–1922) 11 December 1922 16 December 1922 Independent supported by Polish People's Party \"Wyzwolenie\" Dec 1922 (I) First President of Poland. Assassinated after only 5 days in office – Maciej Rataj (1884–1940) Acting President 16 December 1922 22 December 1922 Polish People's Party \"Piast\" — Marshal of the Sejm 2 Stanisław Wojciechowski (1869–1953) 22 December 1922 14 May 1926 Polish People's Party \"Piast\" Dec 1922 (II) Deposed in the May Coup by Marshal Józef Piłsudski – Maciej Rataj (1884–1940) Acting President 14 May 1926 4 June 1926 Polish People's Party \"Piast\" — Marshal of the Sejm – Józef Piłsudski (1867–1935) Did not take office Did not take office Independent May 1926 Piłsudski was elected President by the National Assembly but declined to take office. 3 Ignacy Mościcki (1867–1946) 4 June 1926 30 September 1939 Independent supported by Nonpartisan Bloc for Cooperation with the Government Jun 19261933 Mościcki's government was exiled to Romania after Poland's defeat in World War II on 17 September. ==Government of the Republic of Poland in Exile (1939–1990)== Portrait Portrait Name (Birth–Death) Entered office Left office Political party Notes 1 Władysław Raczkiewicz (1885–1947) 30 September 1939 6 June 1947 Independent Raczkiewicz's government lost recognition by the Western Allies on 6 July 1945. 2 August Zaleski (1883–1972) 9 June 1947 7 April 1972 Independent From 1954 onwards, opposed by the Rada Trzech (Council of Three) 3 Stanisław Ostrowski (1892–1982) 9 April 1972 24 March 1979 Independent 4 Edward Raczyński (1891–1993) 8 April 1979 8 April 1986 Independent 5 Kazimierz Sabbat (1913–1989) 8 April 1986 19 July 1989 Independent 6 Ryszard Kaczorowski (1919–2010) 19 July 1989 22 December 1990 Independent Kaczorowski resigned on 22 December 1990, upon the election of Lech Wałęsa as President of the Republic of Poland. ==Polish People's Republic (1944–1989)== ===President of the State National Council=== The Provisional Government of the Republic of Poland was founded under Soviet protection on 31 December 1944 and recognised by the United States and the United Kingdom since 6 July 1945. It evolved into the Government of National Unity on 28 June 1945, and eventually into the Polish People's Republic on 19 February 1947. Portrait Portrait Name (Birth–Death) Entered office Left office Political party Notes 1 Bolesław Bierut (1892–1956) 31 December 1944 4 February 1947 Polish Workers' Party ===President of the Republic=== Portrait Portrait Name (Birth–Death) Entered office Left office Political party Election Notes – Franciszek Trąbalski (1870–1964) Acting 4 February 1947 4 February 1947 Polish Workers' Party — – Władysław Kowalski (1894–1958) Acting 4 February 1947 5 February 1947 Polish Workers' Party — Marshal of the Sejm 1 Bolesław Bierut (1892–1956) 5 February 1947 20 November 1952 Polish Workers' Party/ Polish United Workers' Party 1947 From December 1948, also Secretary General of the Polish United Workers' Party ===Chairman of the Council of State=== In 1952, the July Constitution abolished the office of president and made the Council of State the collective head of state, chairmen of which are listed below. Real power rested with the Polish United Workers' Party (PZPR), its Central Committee, and the secretary general/first secretary. Portrait Portrait Name (Birth–Death) Entered office Left office Political party Notes 1 Aleksander Zawadzki (1899–1964) 20 November 1952 7 August 1964 Polish United Workers' Party Died in office (cancer) In accordance with the constitution, the vice presidents of the Council of State, Edward Ochab, Stanisław Kulczyński, Oskar R. Lange, and Bolesław Podedworny, became collegially acting heads of state. 2 Edward Ochab (1906–1989) 12 August 1964 10 April 1968 Polish United Workers' Party 3 Marian Spychalski (1906–1980) 10 April 1968 23 December 1970 Polish United Workers' Party 4 Józef Cyrankiewicz (1911–1989) 23 December 1970 28 March 1972 Polish United Workers' Party 5 Henryk Jabłoński (1909–2003) 28 March 1972 6 November 1985 Polish United Workers' Party 6 Wojciech Jaruzelski (1923–2014) 6 November 1985 19 July 1989 Polish United Workers' Party Also the First Secretary of the Polish United Workers' Party ===First Secretaries of the Polish Workers' Party (PPR)/Polish United Workers' Party (PZPR)=== Since 1954, the head of the party was also the Chairman of the Central Committee. Name (Birth–Death) Name (Birth–Death) Portrait Entered office Left office Position Władysław Gomułka (1905–1982) 23 November 1943 10 August 1948 First Secretary of PPR Bolesław Bierut (1892–1956) 10 August 1948 12 March 1956 First Secretary of PPR to 16 December 1948; First Secretary of PZPR from 22 December 1948 Edward Ochab (1906–1989) 20 March 1956 21 October 1956 First Secretary of PZPR Władysław Gomułka (1905–1982) 21 October 1956 20 December 1970 Edward Gierek (1913–2001) 20 December 1970 6 September 1980 Stanisław Kania (1927–2020) 6 September 1980 18 October 1981 Wojciech Jaruzelski (1923–2014) 18 October 1981 29 July 1989 Mieczysław Rakowski* (1926–2008) 29 July 1989 29 January 1990 * By the second half of 1989, the office of First Secretary, occupied at the time by Mieczysław Rakowski, ceased to hold any real power. ==Republic of Poland (1989–present)== ===President of the Republic=== Portrait Name (Birth–Death) Entered office Left office Political party Election Notes Previous office Wojciech Jaruzelski (1923–2014) 19 July 1989 22 December 1990 Polish United Workers' Party 1989 Following the Polish Round Table Agreement between the Polish United Workers' Party and Solidarity, the Council of State was abolished. Its chairman was elected President of the People's Republic by the Parliament. Lech Wałęsa (born 1943) 22 December 1990 22 December 1995 Solidarity Citizens' Committee 1990 First president elected by popular vote Aleksander Kwaśniewski (born 1954) 23 December 1995 23 December 2005 Democratic Left Alliance 19952000 Member of the Sejm (1991–95). First President of the Third Republic elected twice Lech Kaczyński (1949–2010) 23 December 2005 10 April 2010 Law and Justice 2005 Senator (1989–91), Member of the Sejm (1991–93 and 2001–02), Mayor of Warsaw (2002-2005). Died in a plane crash – Bronisław Komorowski (born 1952) Acting President 10 April 2010 8 July 2010 Civic Platform — Marshal of the Sejm. Resigned as Marshal of the Sejm, and thus as Acting President, after being confirmed as the winner of the 2010 presidential election – Bogdan Borusewicz (born 1949) Acting President 8 July 2010 8 July 2010 Civic Platform Marshal of the Senate. Acting president for less than a day, between Komorowski's resignation as the Marshal of the Sejm and Grzegorz Schetyna being sworn in. – Grzegorz Schetyna (born 1963) Acting President 8 July 2010 6 August 2010 Civic Platform Marshal of the Sejm. Served as Acting President until Komorowski was sworn in as president as the result of the 2010 presidential election Bronisław Komorowski (born 1952) 6 August 2010 6 August 2015 Civic Platform 2010 Member of the Sejm (1991–2010), Marshal of the Sejm (2007–10); Acting President (2010). Andrzej Duda (born 1972) 6 August 2015 Incumbent Law and Justice 20152020 Member of the Sejm (2011–14), Member of the European Parliament (2014–15); Duda was the Law and Justice candidate in the 2015 election, but resigned his membership on 26 May 2015. Second President of the Third Republic elected twice Poland * presidents",
 "title": "List of presidents of Poland"
}