{
 "id": "1110305",
 "text": "The Al Noor Mosque (, ) is a Sunni mosque in the Christchurch suburb of Riccarton in New Zealand.Drury, A. M. (2016). Once Were Mahometans: Muslims in the South Island of New Zealand, mid-19th to late 20th century, with special reference to Canterbury (Thesis, Master of Philosophy (MPhil)). University of Waikato, Hamilton, New Zealand. Retrieved from https://hdl.handle.net/10289/10630Drury, A. M. 'Mahometans on the Edge of Colonial Empire: Antipodean Experiences', Islam and Christian–Muslim. Relations, Volume 29, Issue 1, (2018), pp. 71–87. https://doi.org/10.1080/09596410.2017.1384230 It was built between 1983 and 1985 by the Muslim Association of Canterbury, an organisation founded in 1977 that also manages the mosque building. It was the first target of the Christchurch mosque shootings in 15 March 2019. == History == The mosque began to be built in June 1983. The government of Saudi Arabia donated $460,000 towards the building of the mosque. The first Friday prayer was held on 21 June 1985 during Eid al-Fitr. It was the second mosque built in New Zealand. In 2003, the Christchurch Muslim community organised a \"National Māori Muslim Day\" at the mosque. In 2015, the mosque had 550 members. === Mass shooting === On 15 March 2019, the mosque was one of two mosques targeted in a terrorist attack in Christchurch. Most of the victims were at Al Noor Mosque: out the 51 people shot and killed overall in the attacks, 44 were killed at Al Noor and out of the 40 people injured, 35 were at Al Noor. The mosque was closed for eight days and reopened on 23 March. The terrorist, Brenton Tarrant, was convicted of multiple murder, attempted murder, and terrorism charges on 2 June 2020, and sentenced to 52 life sentences with out the chance of parole plus 480 years on 27 August the same year. == Controversies == In 2003, new members from Arab countries and Somalia had some disagreements with the earlier members who were from South Asia. This was because they have a different culture and a different interpretation of Islam. In 2014, the mother and stepfather of an Australian converted Muslim said that he was introduced to Islamic extremism at Al Noor before going to Yemen to join al-Qaeda, an allegation denied by Hisham el-Zeiny, the mosque's imam. == References == == Other websites == * Muslim Association of Canterbury Category:20th-century establishments in Oceania Category:20th-century establishments in New Zealand Category:1985 establishments in Oceania Category:Religious buildings Category:Mosques",
 "title": "Al Noor Mosque, Christchurch"
}