{
 "id": "1110342",
 "text": "Anak-ku Sazali () is a 1956 Singaporean Malay-language black-and-white melodrama film directed and written by Phani Majumdar. The movie is about love between a man and a woman, dreams that come true, and a father's extreme love for his son. The talented P. Ramlee plays the father, Hassan, and the spoiled son, Sazali Hassan. ==Plot== Hassan, an orphan, works for a rich family. The family has two children, Mansor and Mahani. Hassan loves music and buys a violin, taking lessons to learn how to play. He becomes close friends with Mansor and Mahani. As adults, Mansor goes to Singapore to study, and Mahani is arranged to be married. Hassan, in love with Mahani, flees to Singapore, and Mahani follows him. They meet Mansor at the train station, and he supports their love. Hassan and Mahani marry with Mansor's consent, and Mansor marries a girl named Rubiah. Hassan becomes a famous musician. One day, Mahani collapses and a doctor reveals she is pregnant. Hassan is delighted but Mahani fears she will die during childbirth. She makes Hassan promise to take care of their child. Hassan composes a song, \"Anakku Sazali,\" for the baby. Mahani goes into labor and dies after giving birth to a son, Sazali. Hassan is devastated but dedicates himself to raising Sazali. Hassan spoils Sazali, who grows up to be selfish and mischievous. Sazali lies and steals, causing trouble at school and in the neighborhood. Despite warnings from Mansor, Hassan refuses to discipline him harshly. Sazali becomes a leader of a gang in Singapore. On his birthday, Sazali assaults and impregnates Mansor's daughter, Rokiah, but refuses to marry her. This angers Hassan, who confronts and slaps Sazali. Sazali blames his father's excessive love for his misdeeds and leaves home. Sazali plans a robbery but is caught by the police during a gunfight. He escapes and hides at Hassan's house. Hassan, heartbroken and realizing his mistakes, calls the police. Sazali is arrested, and Hassan prays for forgiveness for both himself and his son. ==Cast== * P. Ramlee as Hassan/Sazali (dual role) * Zaiton as Mahani * Rosnani Jamil as Rubiah * Nordin Ahmad as Mansor * Hashimah Yon as Rokiah * Daeng Idris as Mr. Sulong, school principal * Habsah Buang as Mansur & Mahani's mother * Malek Sutan Muda as Mansur & Mahani's father * Ibrahim Pendek as Sazali's accomplice * S. Kadarisman as a stage actor * Siti Tanjung Perak as one of the nobles * Udo Omar as nobles owner * Mustarjo as Aziz * Mak Dara as Mak Timah * Kemat Hassan as teacher Rahman * Omar Suwita as members of the Sazali gang * Shariff Dol as gangster big boss * Tony Castello as young Sazali * Habibah Haron as young Rokiah * H. M. Busra * H. M. Rohaizad * Kassim Masdor * Jins Shamsuddin as while at the train station ==Related pages== * P. Ramlee filmography Category:1956 movies Category:Malay-language movies",
 "title": "Anak-ku Sazali"
}