{
 "id": "1110585",
 "text": "The 100 metres at the Olympics of Grace was held in Florence at the ASSI Giglio Rosso on from 30 to 31 May 1931. At least eighteen competitors from nine nations competed in the event. ==Schedule== All times are local time. Date Time Round 30 May 1931 9:45 Preliminaries 31 May 1931 10:30 Semi-finals 31 May 1931 16:30 Final ==Results== ===Preliminaries=== The heats took place on 30 May from 9:45am (local time). The first three athletes in each heats continued to the semi-finals. ====Preliminary Heat 1==== Rank Name Nationality Time Notes 1 Marie Dollinger 12.6 Q 2 12.4 Q ====Preliminary Heat 2==== Rank Name Nationality Time Notes 1 13.8 Q 2 - Q 3 Elise Van Truyen - Q ====Preliminary Heat 3==== Rank Name Nationality Time Notes 1 Lisa Gelius 13.4 Q 2 Angela Petrović - Q 3 Evelyne Cloupet - Q 4 Jeanne Van Kesteren - ====Preliminary Heat 4==== Rank Name Nationality Time Notes 1 Daisy Ridgley 13.0 Q 2 Felicja Schabińska - Q ====Preliminary Heat 5==== Rank Name Nationality Time Notes 1 12.6 Q 2 Veronika Kohlbach - Q 3 Rosa Pelariaux - Q 4 Jacqueline Laudré - ====Preliminary Heat 6==== Rank Name Nationality Time Notes 1 13.0 Q 2 13.2 Q 3 Lucienne Velu - Q ===Semi-finals=== The semi-finals took place also in the morning session at 10:15am (local time). German who qualified during the heats, didn't start in the semi-finals. The top two athletes of the semi-finals qualified for the final. ====Semi-final 1==== Rank Name Nationality Time Notes 1 Marie Dollinger 13.0 Q 2 Lucienne Velu 13.6 Q 3 - 4 Elise Van Truyen - 5 - ====Semi-final 2==== Rank Name Nationality Time Notes 1 Lisa Gelius 13.2 Q 2 - Q 3 Veronika Kohlbach - 4 Felicja Schabińska - 5 Evelyne Cloupet - ====Semi-final 3==== Rank Name Nationality Time Notes 1 Daisy Ridgley 13.4 Q 2 - Q 3 - 4 Rosa Pelariaux - 5 Angela Petrović - ===Final=== The final of the 100 metres event took place during the afternoon session at 15:45 (local time). Rank Name Nationality Time Notes Marie Dollinger 12.6 Daisy Ridgeley 12.8 Lisa Gelius 12.8 4 - 5 - 6 Lucienne Velu - ==Related pages== *Athletics at the 1930 Women's World Games – 100 metres *Athletics at the 1934 Women's World Games – 100 metres ==References== Category:Athletics at the Olympics of Grace",
 "title": "Athletics at the Olympics of Grace – 100 metres"
}