{
 "id": "1110561",
 "text": "The Meitei language (), also known as the Manipuri language (), is one of the seven officially declared minority languages, besides Kokborok and Bengali, recognised by the Government of Tripura. Its promotion and development are done by the Directorate of Kokborok & Other Minority Languages, established in August 2012. In Meitei language, Tripura is known as \"Takhel\" (). In Agartala, the capital city of Tripura, Meitei language is the fourth most widely spoken language, after Bengali, Tripuri (Kokborok) and Hindi, according to 2011 census. == Endangerment == There is a rapid decline in the number of native speakers of Meitei language in Tripura. It is mainly because they turn to Bengali language as a means of communication, in an increasing number. In April 2023, on its 59th annual conference, the \"Manipuri Literature Council, Tripura\" (MLCT) declared that the future of Meitei language and culture in Tripura is uncertain. == Development groups == The 30 members of the \"Advisory Committee for Development of Manipuri Language\" works for the development of Meitei language in the state. The Manipuri Literary and Cultural Forum, Tripura works for the development of Meitei language and culture in Tripura. It regularly works together with Sahitya Akademi, India's National Academy of Letters, organising symposiums. == Writing systems == Students of Tripura origin, who pursue Meitei language as a subject in Master's degree in the Manipur University (MU) are allowed to study in Bengali script, even though the general writing system for the language subject was shifted to Meitei script since 2020. Manipur Government was also requested to urge the Government of Tripura to allow using Meitei script for writing Meitei language instead of Bengali script in the educational institutions, starting from lower classes. == Education == === Schools === In Tripura, Meitei language was taught as a subject in three schools since 1998. By 2012, the number of schools was increased to 23. === Universities === In December 2021, Tripura University sent a proposal to the Ministry of Human Resource Development (MHRD) and the University Grants Commission (UGC) of the Union Government of India, to grant permission for providing diploma courses in Meitei language, and some foreign languages, like Japanese, Korean and Nepali. After getting approval, the University of Tripura offers diploma courses in Meitei and the other languages. == Literary awards == Every year, the Tripura branch of Manipuri Sahitya Parishad, a group that works for the development of Meitei literature, gives awards to different people recognising their contributions to the Meitei language. Some of the titles of the awards are, N. Chandrahas Memorial, Rajkumar Surendrajit-Sija Bidhumukhi Memorial, Leihao-Tembi Memorial, Dr. Bhupendranath, K. Chandrakumar & L. Gokul Singha Memorial awards. Moreover, the Manipuri Sahitya Parishad also gives awards to top 30 Meitei meritorious students of classes, 10th and 12th standards in Tripura. The names of the awards were Dr. T Biren Memorial, M. Radhamohan Memorial, C. Khalendra Memorial, L. Ratan Singha Memorial, Mutum Chitra Singha Memorial, T. Uma Memorial awards, among others. == Mass media == === Newspapers === \"Marup\" () is a Meitei language newspaper published in Tripura. It was first published on 8th May, 1969, by R.K. Kamaljit () in order to preserve the Meitei language, culture, tradition, and news about Meitei people. Till then, it serves to be the only newspaper that publishes news about the Manipuris living in Tripura. Its readership spreads across the neighboring regions of Bangladesh and the Indian state of Assam. == Demands == Ranjan, an Indian member of Parliament of Lok Sabha, asked the Chief Minister of Tripura, to introduce Meitei language as an optional subject from lower classes upto 12th standard, in schools, highlighting the importance of promoting Meitei language among the Tripuris. The Meitei language speaking people of Tripura and other places together demand the official classical language status to be granted to Meitei language. == Language Day == Meitei language speakers and lovers annually celebrate the \"Manipuri Language Day\" on 20th August in Tripura, to remember the day on which their language was made one of the scheduled languages of the 8th schedule for the Constitution of India. == Representing Tripura in national events == === 2023 === Sorokhaibam Gambhini (), a Meitei poetess from Tripura, won the Sahitya Akademi Award 2023, for Meitei language category, for her work \"Yachangba Nang Hallo\" (, Go back Yachanba). She is the first writer from Tripura to get the prestigious award in the field of Meitei literature (or Manipuri literature). === 2019 === In March 2019, on the International Women's Day, Konjengbam Sarita Devi (), a female writer of Tripura of Meitei origin, was selected in the \"All India Women Writers' meet\" organized by the Sahitya Akademi, India's National Academy of Letters, located in New Delhi, for reading Meitei language poems. == Representing Tripura in international events == === Notable exhibitions === In Moscow International Book Fair, in September 2009, a book titled \"Itihaser Aloke Tripura-Manipur\" was shown. It was written in both Meitei language and Bengali language. The book was about the historical relation between Tripura and Manipur. The Meitei and Bengali versions were written by L Birmangal & Pannalal Roy respectively. It was published by the Akshar Publications, a renowned publisher of Tripura state. It was shown by the National Book Trust Of India. == Related articles == * Meitei language in Assam * Bangladesh Manipuri Sahitya Sangsad == References == == Other websites == Category:Meitei culture Category:Tripura",
 "title": "Meitei language in Tripura"
}