{
 "id": "1110876",
 "text": "Boarding stairs, sometimes called boarding ramp or gangway in the case of ships, are devices designed to safety standards, which facilitate the access of passengers and crew to ships or on aircraft when no built-in stairs are available. Larger aircraft may use one or more fingers attached to the terminal building for passenger boarding, but boarding stairs are used when these are not available or it is impractical or too expensive to use them, == Description == Because larger aircraft have door sills 5 to 20 feet (1.5 to 6.1 m) high, stairs facilitate safe boarding and deplaning boarding stairs, provide a mobile means to traverse between the aircraft doors and the ground, following the \"Dynamic Regulatory System\" * Airplane-style stairs typically have an upper platform that allows passengers to walk from the terminal to the aircraft door. Some models feature handrails for added safety. they are designed to be robust and stable, even in harsh weather conditions. * These ladders are designed to fit the curved shape of an aircraft's fuselage and provide a safe platform for embarkation and disembarkation. * They are usually equipped with wheels for easy movement, although * They can be raised and lowered to fit the specific height of the aircraft to which they are attached. Smaller units are generally moved by being towed or pushed, while larger units are self-powered. Most models have adjustable height to accommodate various aircraft. Optional features may include canopies, heating, supplementary lighting, and a red carpet for VIP passengers. Generaly, a specialized vehicle (such as a van or truck) transports these ladders to the aircraft and positions them next to the gate. == Jetway == Today, almost all large airports with modern check-in and boarding rooms predominantly use closed walkways, the so-called fingers, which, although firmly connected to the door, can move in two or three dimensions, being able to adapt in this way, to the doors of the airplane cabin. This allows passengers to board the aircraft directly without disembarking at the airfield during boarding. The first enclosed walkway was introduced by American Airlines in San Francisco in 1959. 1st Class passengers used the so-called \"Jet Airwalk\", while the 2nd Class walkway was the \"Jetway\". Flug-Revue, Dezember 1959, S. 2 This method of boarding the plane, although it is the most comfortable for the passenger, consumes more resources of the airport, which, consequently, charges the airlines. In order to save costs, some low-cost airlines often forgo this upgrade and use the classic boarding stairs. == Ship boarding stairs == There is also a type of boarding ladder for ships or yachts, known as a gangway, which are structures designed to facilitate safe access between the dock or auxiliary boats and the ship. On a yacht, the choice of the most suitable type of boarding ladder will depend on the size of the yacht, the space available on the dock, etc... ==Gallery== File:Boeing_737-500.jpg|Mobile boarding stairs, open without a roof File:Stairs_on_aircraft.JPG|Mobile boarding stairs, covered with a roof File:Wrangell_Alaska_Airlines_Combi.JPG|Side airstair File:Integratet_behind_Gangways_(aircraft)_01.jpg|Rear airstair of aYugoslav Boeing 727 File:Singapore_Changi_Airport,_Terminal_1,_A340,_Dec_05.JPG|Passenger boarding bridge with \"two fingers\" == References == == Other websites == *Mercury GSE Mercury GSE - Official website Category:Electric vehicles",
 "title": "Boarding stairs"
}