{
 "id": "1110559",
 "text": "The Georgian era is a historical period in British history spanning from 1714 to 1830, named after the reigns of the first four British monarchs of the House of Hanover, all named George: George I, George II, George III, and George IV. This period marked significant political, social, and cultural developments in Britain, including the rise of the British Empire, the Industrial Revolution, and the Enlightenment. == Background == The Georgian era began with the accession of George I to the British throne in 1714, following the death of Queen Anne, the last monarch of the Stuart dynasty. George I was a German prince who ascended to the throne under the provisions of the Act of Settlement 1701, which excluded Roman Catholics from the line of succession. The Georgian monarchs belonged to the House of Hanover, a German royal dynasty with ancestral ties to the British royal family. === Political landscape === Significant political changes happened in Britain during the Georgian era. During this period, Parliament consolidated their power, and authority gradually began to shift away from the monarchy and towards Parliament. Politics at the time was dominated by the Whig and Tory parties, which emerged during the late Stuart period. Over time, their influence and composition evolved. === Expansion of empire === The British Empire expanded around the world during the Georgian era. During this era, Britain established colonies and trading posts across the globe, including in North America, the Caribbean, Africa, and Asia. The Seven Years' War (1756–1763) further expanded Britain's colonial holdings, particularly in North America and India, cementing its status as a global superpower. === The Industrial Revolution === The Industrial Revolution began in the Georgian era. This was a period of rapid technological advancements, urbanization, and industrialization. Innovations in machinery, manufacturing processes, and transportation transformed Britain's economy and society, leading to the growth of cities, the emergence of factories, and the rise of the middle class. === Cultural flourishing === Significant achievements in literature, art, architecture, and philosophy occurred during the Georgian era. Writers such as Jane Austen, Samuel Johnson, and Alexander Pope made significant contributions to English literature, while artists like Thomas Gainsborough and Joshua Reynolds excelled in painting. Georgian architecture, characterized by its symmetry and grandeur, left a lasting legacy in Britain and its colonies. === Social change === Profound social changes happened during the Georgian era. These included the rise of consumer culture, the abolition of the transatlantic slave trade, and the beginnings of the women's suffrage movement. Social inequalities persisted, however, with wealth and power concentrated in the hands of the aristocracy and the emerging industrial elite. == End of the Era == The Georgian era came to an end with the death of George IV in 1830. Queen Victoria succeeded him, marking the beginning of the Victorian era. The period left a lasting imprint on British society and culture. Category:18th century in the Kingdom of Great Britain",
 "title": "Georgian era"
}