{
 "id": "1110381",
 "text": "The dumbbell, a type of free weight, is a piece of equipment used in weight training. Somebody using dumbbells will usually be using one or two at a time. One dumbbell is held in each hand if they are being used in pairs. == History == Before dumbbells, halteres were used in ancient Greece as lifting weights and also as weights in the ancient Greek version of the long jump. Another kind of dumbbell was also used in India for more than a millennium. It was shaped like a club so it was named the Indian club. Another design, \"Nal\", was shaped like a barbell and a dumbbell. It was usually used in pairs and workouts by wrestlers, bodybuilders, athletes, and others trying to increase strength and muscle size. == Types == By the early 17th century, the regular shape of the dumbbell, with two equal weights attached to a handle, had appeared. There are currently three main types of dumbbell: * Fixed-weight dumbbells are weights created in a dumbbell shape. They're usually made with cast iron and sometimes coated with rubber or neoprene for comfort. Some cheaper versions are made with a plastic shell that is filled with concrete. * Adjustable dumbbells are made of a metal bar with a center part often engraved with a crossing pattern (knurling) to improve grip. Weight plates are slid onto the dumbbell and secured with clips or collars. A dumbbell may have smooth ends with plates being secured by a sprung collar. ** Plate-loaded (adjustable) dumbbells (loadable dumbbells) *** Spin-lock *** Spring collar clips *** Compression ring collar *** Ironmaster quick-lock ** \"Selectorized\" (adjustable) dumbbells are adjustable dumbbells that allow you to change the weight or number of plates when the dumbbells are resting on the dumbbell stand. This makes it very easy to change the weight of the dumbbell between exercises, and the stand can be used to store extra weights that aren't needed for a certain exercise. There are different types of mechanisms: *** Block type *** Dial type *** Glide type *** Twist type ** 2-in-1 dumbbell/barbell === Named dumbbells === * Thomas Inch dumbbell, also known as \"172\" ( handle, weighs ) * Millennium dumbbell ( handle, weighs ) * Circus dumbbells: historically used in traveling circus acts, these dumbbells have exaggerated ends and wider handles, and just like normal dumbbells, come in various weights and sizes. == Related pages == * Strength training == References == == Other websites == * Category:Weightlifting Category:Sports equipment",
 "title": "Dumbbell"
}