{
 "id": "1110386",
 "text": "The Yadera leaping frog (Indirana yadera) is a frog. It lives in India in the Western Ghat mountains. ==Body== This frog looks different from other frogs in Indirana: Its head is longer than it is wide and it has a long face. ==Name== The scientists who wrote the first paper about this frog named it after some of their friends: yadera for Yamini, Deepa, and Ravisankaran. ==Home== This frog lives in wet forests that are not too high up in the mountains. It can live in forests that have been cut down and are growing back. It lives near streams and still water. It needs wet ground and dead leaves on the ground. It also needs places where the tree branches come together like a roof. So it cannot live in places where all the trees have been cut down, but people have seen it on arecanut farms. People have seen this frog between 55 and 1075 meters above sea level. ==Young== The frog lays eggs on wet rocks. This frog's tadpoles do not live in the water and instead move across wet rocks and moss using their tails and their back legs. Their back legs grow on them sooner than other tadpoles' back legs. ==Danger== Scientists believe this frog is in some danger of dying out because it lives in a small place. Sometimes people hit this frog with cars or trucks. Sometimes people hurt the frog by stopping landslides: the concrete people use to make roads stronger can fill in the cracks in the rocks where frogs would lay their eggs. Scientists also think climate change could hurt this frog. They think it could change the weather that the frog needs to lay eggs. Some of the places the frog lives are protected parks: Peechi-Vazhani Wildlife Sanctuary, Periyar Tiger Reserve, Idukki Wildlife Sanctuary, Chimmony Wildlife Sanctuary, and Neyyar Wildlife Sanctuary. Scientists have seen the fungus Batrachochytrium dendrobatidis on this frog, but they do not know how much danger the frog is in from the fungus. Batrachochytrium dendrobatidis causes the fungal disease chytridiomycosis. ==First paper== * ==References== Category:Frogs of Asia",
 "title": "Indirana yadera"
}