{
 "id": "1110028",
 "text": "The 2004 World Series was the 100th World Series. The teams were the American League champion Boston Red Sox and the National League champion St. Louis Cardinals. The series was televised in the United States on Fox. This was the third World Series between the two teams. When they played each other in 1946 and 1967, the Cardinals won in seven games. The Red Sox won the 2004 series beatng the Cardinals in four games. This was their first World Series title in 86 years, and their sixth in franchise history. Manny Ramirez won the World Series Most Valuable Player Award. == Game 1 == Early in the game, the Red Sox scored 7 runs while the Cardinals had only 2. Then the Cardinals tied the game in the sixth inning. In the seventh inning, the Red Sox led again at 9-7. Again, the Cardinals tied the game at 9 runs each. Manny Ramirez committed two errors that inning. In the second half of the eighth inning, Mark Bellhorn hit a two-run home run, and the Red Sox won the game by a score of 11-9. == Game 2 == In the first inning, the Red Sox scored twice on an RBI triple from Jason Varitek. The Cardinals then got a run in the fourth inning thanks to a Bill Mueller error. Then the Red Sox got two more runs in the same inning to make the score 4-1. RBI singles from Orlando Cabrera and Johnny Damon made the score 6-1 in the sixth. Red Sox starter Curt Schilling allowed one run in six innings on the way to a 6-2 victory in Game 2. == Game 3 == The Red Sox scored first on a Manny Ramirez home run in the first inning. They scored three more runs in the fourth and fifth innings. Pedro Martinez pitched seven innings without letting any runners score. The Red Sox won the game by a score of 4-1, going ahead 3 games to none in the series. == Game 4 == The Red Sox scored in the first inning. Johnny Damon led off the game with a home run. Then in the third inning, Trot Nixon hit a two-run double to make the score 3-0. The score stayed 3-0 for the rest of the game. Edgar Rentería grounded out to Red Sox closer Keith Foulke for the series' final out. The Red Sox won the series for the first time in 86 years. Category:World Series World series Category:2004 in the United States Category:Boston Red Sox Category:St. Louis Cardinals",
 "title": "2004 World Series"
}