{
 "id": "1110233",
 "text": "The Quran, the holy book of Islam, talks about many things hypocrites do. A hypocrite (Munafiq) is someone who pretends to believe but doesn't really believe. In Islam, the munafiqun ('hypocrites', , singular munāfiq) or false Muslims or false believers are a group decried in the Quran as outward Muslims who were inwardly concealing disbelief (\"kufr\") and actively sought to undermine the Muslim community. Munafiq is a person who in public and in community shows that he is a Muslim but rejects Islam or speaks against it either in his heart or among the enemies of Islam. The hypocrisy itself is called nifāq (). Examples of things hypocrites do include lying, betraying others, and not keeping promises. == Characteristics of Hypocrisy (Munafiq) According to the Quran == Here are the simplification of what about the Quran says about hypocrites: === Fear and Anxiety === Hypocrites often feel scared and nervous. They think every loud noise is about them. The Quran says this in Surah Al-Munafiqun, verse 4. === Making Excuses Instead of Taking Responsibility === Hypocrites often make up excuses to avoid taking responsibility for their actions. The Quran talks about this in Surah An-Nisa, verse 81. === Doing Bad Things and Stopping Good Things === Hypocrites often tell others to do bad things and stop them from doing good things. The Quran talks about this in Surah At-Tawbah, verse 67. === Being Stingy === Hypocrites don't like to share good things with others. They encourage others to be stingy too. The Quran talks about this in Surah An-Nisa, verse 37. === Forgetting About God === Hypocrites only think about worldly things and forget about God. The Quran talks about this in Surah At-Tawbah, verse 67. === Pretending Not to Do Bad Things === Hypocrites hide the bad things they do and pretend to be good in front of others. The Quran talks about this in Surah An- Nisa, verse 108. === Being Happy When Others Suffer === Hypocrites feel happy when others have problems. They don't like it when good things happen to others. The Quran talks about this in Surah At-Tawbah, verse 50. === Conclusion === In Islam, hypocrisy is a bad thing. The Quran tells us about the things hypocrites do so that Muslims can recognize them and avoid acting like them. It's important to be honest and sincere in our faith and actions. ==References== Category:Islam Category:Religion Category:Quran",
 "title": "Signs of a Munafiq"
}