{
 "id": "1110459",
 "text": "Tiga Abdul (English: The Three Abduls; title numerized on screen as 3 Abdul) is a 1964 Malaysian Malay-language black-and-white comedy film. Directed by and starring P. Ramlee, it tells the story of three brothers tricked by the cunning Sadiq Segaraga. Sadiq uses his three daughters to try to steal the brothers' wealth. The movie is a tribute to traditional folktales with a moral message. It is set in a fictional Middle Eastern country called Isketambola, loosely based on Istanbul, Turkey. This was P. Ramlee's last film directed in Singapore before he moved to Merdeka Studios in Kuala Lumpur in 1965. ==Plot== Ismet Ulam Raja is a wealthy businessman with three sons: Abdul Wahab, Abdul Wahib, and Abdul Wahub. Abdul Wahab and Abdul Wahib are selfish and money- minded, while Abdul Wahub enjoys a simple life with his small music shop. When Ismet has a heart attack on his birthday, Abdul Wahab and Abdul Wahib plot to inherit their father's wealth. Abdul Wahub tries to get their father to the hospital, but Ismet refuses and dies at home. The two elder brothers take most of the wealth, leaving Abdul Wahub with only their father's house. He accepts this and continues his simple life. Sadiq Segaraga, a friend of Ismet, wants the wealth too. He orders his three daughters, Hamidah, Rafidah, and Ghasidah, to woo the three Abduls. Hamidah and Rafidah successfully woo Abdul Wahab and Abdul Wahib, but Ghasidah and Abdul Wahub argue constantly. The two elder Abduls ask Sadiq for his daughters' hands in marriage. Sadiq agrees, but they must sign a contract stating if they lose their temper, Sadiq will take their wealth and sell them as slaves. Despite suspicions, they sign the contract. After the marriage, they are treated poorly, lose their temper, and Sadiq claims their wealth and sells them as slaves. Abdul Wahub sees his brothers being sold but can do nothing. His father's spirit visits him in a dream, advising him to meet Sulaiman Akhlaken, his father's lawyer. Sulaiman reveals that Abdul Wahub has inherited his father's overseas properties, making him very wealthy. Abdul Wahub then plans to marry Ghasidah and tricks Sadiq into signing a similar contract. Abdul Wahub marries Ghasidah and avoids losing his temper at Sadiq's tricks. He pretends to date another woman and gives away Sadiq's goods to the poor, frustrating Sadiq. Ghasidah, initially upset, realizes Abdul Wahub loves her. Sadiq finally loses his temper when Abdul Wahub invites townspeople to take Sadiq's belongings. Abdul Wahub reveals the contract, takes Sadiq's wealth, and sells Sadiq, his lawyer Kassim, and his daughters as slaves. Abdul Wahub eventually buys back his brothers, Sadiq, and the daughters (except Kassim). He takes them to his house, apologizes, and cancels the contracts. They all learn their lessons, ending the film on a positive note. ==Cast and characters== ===Main=== *P. Ramlee as Abdul Wahub Ulam Raja, the youngest of Ismet's three sons, owner of a shop selling musical instruments and records. *Haji Mahadi as Abdul Wahab Ulam Raja, the oldest of Ismet's three sons, owner of a shop selling birds. *S. Kadarisman as Abdul Wahib Ulam Raja, the second son of Ismet Ulam Raja, owner of a carving workshop. *Sarimah as Ghasidah Segaraga, the youngest of Sadiq's three daughters. *Mariani as Hamidah Segaraga, the oldest of Sadiq's three daughters. *Dayang Sofia as Rafidah Segaraga, the second daughter of Sadiq Segaraga. ===Supporting casts=== *Ahmad Nisfu as Sadiq Segaraga, owner of an antique shop, father of Hamidah, Rafidah, and Ghasidah. *Salleh Kamil as Kassim Patalon, Sadiq's lawyer and adviser. *S. Shamsuddin as the storyteller. *H. M. Busra as the slave trader. *M. Babjan as Ismet Ulam Raja, the richest man in Isketambola, owner of many businesses, father of the three Abduls. *Nyong Ismail as Hussain Lempoyang, a camel dealer from Cairo. *Ahmad Sabri as Suleiman Akhlaken, Ismet Ulam Raja's lawyer. *S. Sudarmaji as a person looking for bird's dung to use as fertilizer. *Udo Omar as the orphanage's teacher. ===Cameos=== *Saloma as herself. She appears at the beginning of the film, singing the title song. *Murni Sarawak (uncredited) as Fatima Hatem Thai, deceased mother of the three Abduls, wife of Ismet Ulam Raja. Only her portrait appears in the film. *S. Sudarmaji *Kassim Masdor *Rahayu Sudarmaji *Vicky Ghazi ==Songs== * Bunyi Guitar (The Sound of the Guitar) - Performed by P. Ramlee * Tolong Kami, Bantu Kami (Oh Please Help Us) - Performed by P. Ramlee * Sedangkan Lidah Lagi Tergigit (Even the Tongue Gets Bitten) - Performed by P. Ramlee and Saloma * Allah Selamatkan Kamu (May Allah Save You) - Performed by Ahmad Nisfu ==Related pages== * P. Ramlee filmography ==References== ==Other websites== * Tiga Abdul at FilemKita.com * Category:1964 movies Category:1964 comedy movies Category:Malay-language movies Category:Black-and-white movies",
 "title": "Tiga Abdul"
}