{
 "id": "1110743",
 "text": "Hendrikus Wilhelmus Maria \"Dick\" Schoof (born 8 March 1957) is a Dutch politician who is the Prime Minister of the Netherlands since 2024. He was the secretary-general at the Ministry of Justice and Security from 2020 to 2024. Schoof was a member of the Labour Party (PvdA) for over 30 years, until he left in early 2021. ==Political career== Schoof started his career at the Association of Netherlands Municipalities (VNG). He then became a civil servant at the Ministry of Education, Culture and Science in 1988. He was deputy secretary-general at the Ministry of Justice and Security in 1996. Schoof later led the Immigration and Naturalisation Service. When he was in charge of the National Coordinator for Security and Counterterrorism, he was criticized over the Malaysia Airlines Flight 17 investigation. In 2019, Schoof was announced as secretary-general at the Ministry of Justice and Security to fix the scandals in the Ministry. ==Prime Minister== Schoof was nominated as Prime Minister of the Netherlands on 28 May 2024 by the Party for Freedom (PVV), People's Party for Freedom and Democracy (VVD), New Social Contract (NSC), and the Farmer–Citizen Movement (BBB). As part of negotiations, the four party leaders agreed none of them would serve as prime minister. He was nominated as prime minister after Ronald Plasterk withdrew from consideration. He was sworn in on 2 July by King Willem-Alexander. In August 2024, Schoof announced he would ban members of his cabinet from using cellphones during meetings to reduce the threat of espionage. ==Personal life== Schoof was born in Santpoort, Netherlands in 1957. He studied at Radboud University. Schoof has a girlfriend and two daughters adopted from China with his ex-wife, Yolanda Senf. ==References== ==Other websites== * Drs. H.W.M. (Dick) Schoof, Parlement.com Category:1957 births Category:Living people Category:Politicians from North Holland Category:Prime ministers of the Netherlands Category:Current national leaders",
 "title": "Dick Schoof"
}