{
 "id": "1110803",
 "text": "Thomas Winklhofer (born December 30, 1970 in Seekirchen am Wallersee) is a former Austrian football player. He played as defender mainly for SV Austria Salzburg. He also played in the Austrian national football team. ==Career == Thomas Winklhofer began his career in the youth teams of SV Seekirchen . At the age of 17 he came to SV Austria Salzburg. After a year in Salzburg, he moved to the Tyrol Federal Youth Center The young talent was not able to play at the Innsbruck team. He was transferred to the satellite club WSG Wattens. There, Winklhofer was mostly given a defensive role. He changed from a striker to a defender. In the fall of 1992 he moved back to Austria Salzburg . There he became part of the first team. He made a total of 22 appearances in the championship in the 1992/93 season. The Seekirchner also celebrated his greatest successes at club level with Austria Salzburg. Winklhofer made almost 30 appearances in all of the former Lehener's championship years 1993/94, 1994/95 and 1996/97. With Casino Salzburg he reached the final of the UEFA Cup in 1993/94 and also became a national team player. He played 21 international matches for the Austrian national team between 1993 and 2001. In 2001 Winklhofer moved to the German second division club 1. FC Saarbrücken. In 2002 he returned to Salzburg and remained loyal to Austria there even in unsuccessful years. When Red Bull took over the club in July 2005 he was also part of Salzburg's regular team under coach Kurt Jara. 2007 he ended his professional career. 2009/10 he played for TSV Neumarkt. ==International == Winklhofer played 21 matches for the Austrian national football team. His first match was on 27 October 1993 versus Israel (1-1). His last match was on 14 November 2001 versus Turkey (0-5). ÖFB Players profile ==Honours == * 4 × Austrian champion: 1994, 1995, 1997 (Austria Salzburg), 2007 (Red Bull Salzburg) * 3 × Austrian Supercup 1994, 1995, 1997 (Austria Salzburg)̈ * 1 × UEFA-Cup-final: 1994 (Austria Salzburg) * 21 matches for the Austrian national football team * 335 matches for SV Austria Salzburg (9 goals) ==References== Category:1970 births Category:Living people Category:Austrian footballers Category:Players of the Austrian national football team Category:FC Red Bull Salzburg players Category:Austrian football champions Category:Austrian football defenders",
 "title": "Thomas Winklhofer"
}