{
 "id": "1111862",
 "text": "The 2020 Green Party of Alaska Presidential Nomination was decided on August 31, 2020 by a poll that the Green Party of Alaska had polled. The poll made Jesse Ventura the presidential nominee. == Background == The National Green Party chose Howie Hawkins as their President candidate and Angela Nicole Walker as Vice President. The Green Party of Alaska, who supported Sedinam Moyowasifza-Curry in the beginning, held a poll on August 30-31, 2020, among their members to pick their candidate. Jesse Ventura won with 50% of the vote among 8 candidates. == Considered candidates == The following candidates were considered for the nomination and put into the poll made by the Green Party of Alaska: ===Nominee=== 2020 Green Party of Alaska Nominee Name Born Experience Home state Running mate Party Ref. Jesse Ventura July 15, 1951 Minneapolis, Minnesota, U.S. Governor of Minnesota (1999-2003) Mayor of Brooklyn Park WWE Wrestler Minnesota Cynthia McKinney Independent ===Other candidates considered=== 2020 Green Party of Alaska Candidates Name Born Experience Home state Running mate Party Ref. Howie Hawkins December 8, 1952 San Francisco, California, U.S. Environmental activist, found of Green/Greens Party USA, 2020 Green/Socialist Candidate for President New York Angela Nicole Walker Green Joe Biden November 20, 1942 Scranton, Pennsylvania U.S. Vice President of the United States(2009–2017) Delaware Kamala Harris Democratic Dario Hunter April 21, 1983 Livingston, New Jersey, U.S. Youngstown Board of Education member (2016–2020) California Dawn Neptune Adams Progressive Mark Charles Gallup, New Mexico, U.S. Native American activist, public speaker, consultant, and author New Mexico Adrian Wallace (was Sedinam Moyowasifza-Curry) Independent Jo Jorgenson May 1, 1957 Libertyville, Illinois, U.S Psychology senior lecturer at Clemson University Nominee for Vice President in 1996 Nominee for U.S. representative from SC-04 in 1992 South Carolina Spike Cohen Libertarian Steve Saylor March 23, 1956 Port Lavaca, Texas, U.S. American author of historical novels Texas None None Like Ventura, Saylor did not run a campaign Donald Trump June 14, 1946 Queens, New York, U.S. 45th President of the United States (2017–2021) Florida Mike Pence Republican == Results == The Green Party of Alaska sent a poll to all its members. The winner would become the nominee. Only a percent was given during the polls results. Candidate Percentage Jesse Ventura 50.00% Howie Hawkins 25.00% Joe Biden 14.30% Dario Hunter 7.13% Mark Charles 3.57% Jo Jorgenson 0.00% Steve Saylor 0.00% Donald Trump 0.00% == Aftermath == Jesse Ventura got 2,673 votes in Alaska, which was 0.74% of the vote. He came 4th place in the state. Howie Hawkins got 0.2% of the national vote, which was 4th place nationally. In January 2021, the National Green Party decided to force a split with the Green Party of Alaska. == Related pages == * Green Party of Alaska * Jessie Ventura == References == Category:Politics of Alaska Category:2020 United States presidential election",
 "title": "2020 Green Party of Alaska Presidential Nomination"
}