{
 "id": "1111359",
 "text": "The diablito, kiki, little devil poison frog, or diablito poison frog (Oophaga sylvatica) is a frog. It lives in Colombia and Ecuador. ==Appearance== This is the largest frog in the family Dendrobatidae that lives in Ecuador. Male and female adult frogs are 26.0 – 38.0 mm long from nose to rear end. The skin of the frog's back can be gray, brown, orange, red, or black with spots or other marks that are blue, red, orange, or yellow in color. The skin of the belly can be red or can be the same color as the back. This frog has either large marks on its legs or no marks at all on its legs. Red frogs are harder to see because the fungus that grows on the ground in their forests is red in color too. ==Name== Scientists gave this frog the Latin name Oophaga sylvatica for the Greek words oon for \"egg,\" phagein for \"eat,\" and silvae for \"forest.\" ==Home== This frog looks for food during the day. When it is not looking for food, it hides under tree trunks and leaves. It lives in rainforests in flat places and on hills. People have seen this frog on banana farms. People have seen this frog between 0 and 1000 meters above sea level. People have seen the frog in some protected parks: Reserva Ecológica Cotacachi-Cayapas, Refugio de Vida Silvestre la Chiquita, and Parque Nacional Mache-Chindu. ==Young== The female frog lays eggs on the ground. The male frog watches the eggs until they hatch. Then the female frog carries the tadpoles to bromeliad plants. She puts them in the water, where they grow. The female frog lays eggs that will not hatch for the tadpoles to eat. This is the tadpole's food. The egg also has poison chemicals in it that make it harder for other animals to eat the tadpole. ==Danger== Scientists believe this frog is in a little danger of dying out because people change the place where it lives to build farms. Sometimes people build farms in places where it is against the law to build farms. Chemicals meant to kill pests on those illegal farms may have killed many frogs. Scientists have seen the fungus Batrachochytrium dendrobatidis on this frog, but they do not know how much danger the frog is in from the fungus. Batrachochytrium dendrobatidis causes the fungal disease chytridiomycosis. Sometimes people catch this frog to sell as a pet, but only sometimes. ==References== Category:Frogs of South America",
 "title": "Oophaga sylvatica"
}