{
 "id": "1111135",
 "text": "Oophaga is a group of frogs that make poison in their skins. This group has twelve species in it. Scientists used to think these frogs were in Dendrobates, but they changed their minds. The frogs live in Central and South America, from Nicaragua south through the El Chocó to northern Ecuador. Peopl ehave seem them as high as above sea level. They can live in different places. Some live in trees and others live on the ground. All of the tadpoles in Oophaga eat eggs and nothing else. Most species in this genus are may die out soon. O. speciosa is already dead. ==Name== Oophaga, is Greek for \"egg eater\" (oon, ). Scientists named the frogs Oophaga because the tadpoles eat eggs.Heselhaus, R. 1992. Poison-arrow frogs: their natural history and care in captivity. Blandford, London.Zimmermann, E. and Zimmermann, H. 1994. Reproductive strategies, breeding, and conservation of tropical frogs: dart- poison frogs and Malagasy poison frogs. In: J.B. Murphy, K. Adler and J.T. Collins (eds), Captive management and conservation of amphibians and reptiles, pp. 255-266. Society for the Study of Amphibians and Reptiles, Ithaca (New York). Contributions to Herpetology, Volume 11. ==Young== Scientists think all frogs in this group watch and care for the eggs, but frogs in Oophaga do more than other frogs do: the tadpoles can only eat eggs that the mother frog makes for them to eat. When they eat the eggs, they also take in poison chemicals that make it harder for other animals to eat them. Scientists fed plain eggs to Oophaga pumilio tadpoles to see what would happen. ==Species== There are twelve species in this genus: Image Scientific name Common name Distribution Oophaga anchicayensis (Posso-Terranova and Andrés, 2018) Chocó region of northwestern Colombia Oophaga andresi (Posso-Terranova and Andrés, 2018) Cocorro Columbia Oophaga arborea (Myers, Daly, and Martínez, 1984) Polkadot poison frog Panama Oophaga granulifera (Taylor, 1958) Granular poison frog Costa Rica and Panama Oophaga histrionica (Berthold, 1845) Harlequin poison frog El Chocó region of western Colombia Oophaga lehmanni (Myers and Daly, 1976) Lehmann's poison frog western Colombia Oophaga occultator (Myers and Daly, 1976) La Brea poison frog Cordillera Occidental in the Cauca Department of Colombia Oophaga pumilio (Schmidt, 1857) Strawberry poison-dart frog eastern central Nicaragua through Costa Rica and northwestern Panama Oophaga solanensis (Posso-Terranova and Andrés, 2018) Koe-koe Northwestern region of Colombia, on the western banks of the Atrato and san Juan rivers Oophaga speciosa (Schmidt, 1857) Splendid poison frog Cordillera de Talamanca, western Panama (extinct) Oophaga sylvatica (Funkhouser, 1956) Diablito poison frog southwestern Colombia and northwestern Ecuador. Oophaga vicentei (Jungfer, Weygoldt, and Juraske, 1996) Vicente's poison frog Veraguas, Bocas del Toro, Colón and Coclé Provinces of central Panama ==With humans== Some people keep Oophaga as pets. Only skilled amphibian keepers can do this. It is hard to raise new froglets because only the mother frog can feed the tadpoles. ==References== Category:Poison dart frogs Category:Frogs of Central America Category:Frogs of South America",
 "title": "Oophaga"
}