{
 "id": "1111030",
 "text": "Maurice Béjart (; 1 January 1927 – 22 November 2007) was a French dancer, choreographer and opera director. Béjart ran the Béjart Ballet Lausanne in Switzerland. He helped make new types of ballet. After his death, he was given Swiss citizenship. ==Biography== Maurice-Jean Berger was born in Marseille, France, in 1927. He was the son of the philosopher Gaston Berger. Berger watched a recital of Serge Lifar. This recital inspired him to make his life about dancing. Maurice studied under (was a student of) Mathilde Kschessinska when he lived in South France. In 1945, Béjart started working at the Opéra de Marseille. After 1946, he studied under Madam Rousanne Sarkissian, Léo Staats, Madam Lyubov Yegorova and Olga Preobrajenska in Paris. In 1948, he trained with Janine Charrat, Yvette Chauviré, and Roland Petit. He also studied under Vera Volkova at London.Maurice BéjartBéjart, Maurice (1927-2007) \"Maurice Béjart 1922~2007\" Shinsokan Dance Magazine, Special Issue Volume XVII No.4 2008, Japan In 1954, he created the Ballet de l'Étoile company. This company stopped running in 1957. In 1960, he founded the Ballet du XXe Siècle in Brussels. This company would stop running in 1987. In 1973, with the Ballet du XXe siecle, Béjart first premiered \"Golestan\". This ballet was based on Iranian traditional music. In 1987 he moved to Lausanne in Switzerland. Here, he founded the Béjart Ballet Lausanne. Béjart made many works. One of these was a remade version of The Nutcracker. This was first performed in 2000. It used Tchaikovsky's original score, but changed the plot and characters. One of Béjart's best pieces was choreography set to the song Boléro. The New York Times called Béjart's \"Bolero\" one of his most popular dances. ==Dance schools== Béjart founded many dance schools: *the Mudra School in Brussels, 1970–1988; *the Mudra Afrique School in Dakar, 1977–1985; *the Rudra School in Lausanne, 1992–2007. ==Awards== Béjart was given many awards for his work. * He received the Japanese Order of the Rising Sun. * He received the Belgian Ordre de la Couronne. * In 1974, he won the Erasmus Prize. * In 1994, he was appointed to the Académie des Beaux Arts. * Also in 1994, he received the Deutscher Tanzpreis. * In 2003, he was appointed Commandeur des Arts et des Lettres. * Also in 2003, he won the Prix Benois de la Danse for lifetime achievement. ==Movies== *1975: Je suis né à Venise with Jorge Donn, Shonah Mirk, Philippe Lison and Barbara ==References== ==Other websites== *Béjart Ballet Lausanne *Rudra Béjart School *Obituary in The Guardian UK Category:1927 births Category:2007 deaths Category:French choreographers Category:People from Lausanne Category:Converts to Islam Category:French LGBT people Category:LGBT dancers Category:French ballet dancers Category:People from Marseille",
 "title": "Maurice Béjart"
}