{
 "id": "1111141",
 "text": "The Anamallais Indian frog, leaf hopper-frog, short-legged leaping frog, short-legged frog, or Günther's leaping frog (Indirana brachytarsus) is a frog. It lives in India in the Western Ghat mountains. ==Home== This frog lives on the ground near streams on hills. This frog lives in forests that have evergreen trees in them. People see the frog in the dead leaves on the ground. Sometimes people see them near the edge of the forest but not outside it. People sometimes see it on farms growing cardamom, rubber, or tea. People have seen this frog between 600 and 1508 meters above sea level. ==Young== The frog lays eggs on wet rocks. This frog's tadpoles do not live in the water and instead move across wet rocks and moss using their tails and their back legs. Their back legs grow on them sooner than other tadpoles' back legs. ==Danger== Scientists believe this frog is not in danger of dying out, but it is in some danger. People cut down the forests where it lives to build farms, dams, and other things that people need. Sometimes people hurt the frog by stopping landslides: the concrete people use to make roads stronger can fill in the cracks in the rocks where frogs would lay their eggs. Sometimes people go into the forest and cut some wood to use themselves, but this is only a little dangerous to the frog. Scientists also think climate change could hurt this frog. Because it lives high in mountains, the frog cannot move north when the weather gets hotter the way other animals could. At least four of the places the frog lives are protected parks: Periyar Tiger Reserve, Kalakad Mundanthurai Tiger Reserve, Meghamalai Wildlife Sanctuary, Agasthyamala Biosphere Reserve, Anamalai Tiger Reserve, and Wayanad Wildlife Sanctuary. Scientists have seen the fungus Batrachochytrium dendrobatidis on this frog, but they do not know how much danger the frog is in from the fungus. Batrachochytrium dendrobatidis causes the fungal disease chytridiomycosis. ==References== Category:Frogs of Asia",
 "title": "Indirana brachytarsus"
}