{
 "id": "1111447",
 "text": "The 80 metres hurdles at the Olympics of Grace was held in Florence at the ASSI Giglio Rosso on from 30-31 May 1931. On 30 May 1931 semi-finals were held during the afternoon session and the final was held the day afterwards during the afternoon session. At least nine competitors from eight nations competed in the event. ==Schedule== All times are local time. Date Time Round 30 May 1931 15:00 Semi-finals 31 May 1931 16:45 Final ==Results== ===Semi-finals=== The semi-finals took place in the afternoon session starting at 15:00am (local time). The semi-finals consisted of three races where the top two athletes of each race qualified for the final. The competitors were very nervous during the semi finals and there were many false starts. The first semi-final was put back four times by starter Bertaccini due to false starts and the Belgian Lucie Petit was disqualified during the semi-finals due to false starts. The German Gerda Pirch, who won the silver medal in the 80 metres hurdles event at the 1930 Women's World Games, was also disqualified during the semi-finals for invading an opponent's lane. There were vigorous protests by the German team managers, but jury member Marina Zanetti was adamant and confirmed the disqualification. There was paid attention in the media for the very young Ondina Valla from Bologna, who a few days earlier on 20 May, he had turned fifteen. The first semi-final was won by the British Muriel Cornell in a time of 13.2. The Italian Ondina Valla from Bologna won the second semi-final in the same time, close to her own Italian record (13.0) established in Bologna on 14 May 1931, beating multiple French champion Jacqueline Combernoux. There was paid a lot of attention in the media for the very young Ondina Valla, who a 10 days earlier on 20 May, he had turned fifteen. The third semi-final was won by Romenian Ilse Hausletner in a time of 13.8. ====Semi-final 1==== Rank Name Nationality Time Notes 1 Muriel Cornell 13.2 Q 2 Felicja Schabińska - Q Lucie Petit false starts Gerda Pirch invading opponent's lane ====Semi-final 2==== Rank Name Nationality Time Notes 1 Ondina Valla 13.2 Q 2 Jacqueline Combernoux - Q ====Semi-final 3==== Rank Name Nationality Time Notes 1 Ilse Hausletner 13.8 Q 2 Zulejka Stefanini - Q 3 Jacqueline Laudré - ===Final=== The final of the 80 metres hurdles event took place on 31 May 1931 during the afternoon session at 16:45 (local time). Rank Name Nationality Time Notes Muriel Cornell 13.0 Ondina Valla 13.2 Jacqueline Combernoux - 4 Ilse Hausleitner - 5 Felicja Schabińska - 6 Zulejka Stefanini - ==Related pages== *Athletics at the 1930 Women's World Games – 80 metres hurdles *Athletics at the 1934 Women's World Games – 80 metres hurdles ==References== Category:Athletics at the Olympics of Grace",
 "title": "Athletics at the Olympics of Grace – 80 metres hurdles"
}