{
 "id": "1111363",
 "text": "William Gilbert also known as Gilberd (24 May 1544? – 30 November 1603) was an English physicist, physician and natural philosopher. He was considered as the father of electrical engineering, electricity and magnetism.Merriam-Webster Collegiate Dictionary, 2000, CD-ROM, version 2.5. He was one of the great scientists of England as well as of Europe during the Renaissance. He was an important innovator in the history of electromagnetism with De Magnete, Magneticisque Corporibus, et de Magno Magnete Tellure, which was published in 1600. In this book, Gilbert synthesized human understanding of electricity and magnetism from primitive times to the Renaissance. At the same time, he also presented experiments to prove his ideas such as that the Earth is a giant magnet. His greatest work opened a new period in the history of electromagnetism. Since then, electricity had been studied as one of the most excellent and important sources of energy. However, Gilbert became the forgotten scientist. == References == == Further reading == * Gilbert, William. (1600), De Magnete (About the Magnet). Translated 1893 from Latin to English by Paul Fleury Mottelay, Dover Books, paperback. * Ugaglia, Monica. The Science of Magnetism before Gilbert. Leonardo Garzoni's Treatise on the Loadstone , Annals of Science 63 (2006), 59-84. == Other websites == * The Galileo Project -- biography of William Gilbert. * On the Magnet -- Translation of De Magnete by Silvanus Thompson for the Gilbert Club, London 1900. Full text, free to read and search. Go to page 9 and read Gilbert saying the earth revolves leading to the motion of the skies. * The Great Magnet, the Earth -- website hosted by NASA -- Commemorating the 400th anniversary of \"De Magnete\" by William Gilbert of Colchester. * The Natural Philosophy of William Gilbert and His Predecessors * Online Galleries, History of Science Collections, University of Oklahoma Libraries High resolution images of works by and/or portraits of William Gilbert in.jpg and.tiff format. Category:English astronomers Category:English physicists Category:People from Colchester Category:1603 deaths Category:1544 births",
 "title": "William Gilbert"
}