{
 "id": "1111043",
 "text": "Anna Elisabeth Michel (21 September 1952 - 1 July 1976) was a German woman who died of malnutrition and Dehydration. She became known because Catholic priests did 67 exorcism rites on her, in the year before she died. Her parents and the priests were convicted of negligent homicide for this. She suffered from epilepsy, and had done a number of psychiatric treatments, which were largely ineffective. When she was 16, Michel had a seizure and was diagnosed with psychosis caused by temporal lobe epilepsy. Shortly afterwards, she was diagnosed with depression and was treated in a psychiatric hospital. By the time that she was 20, she had become intolerant of various religious objects and began to hear voices. Her condition worsened despite medication, and she became suicidal. She also had other conditons for which she took medication. After taking psychiatric medications for five years failed to improve her symptoms, Michel and her family became convinced she was possessed by a demon. As a result, her family appealed to the Catholic Church for an exorcism. While rejected at first, two priests got permission from the local bishop in 1975. The priests began performing exorcisms and the family stopped consulting doctors. Michel stopped eating food and died of malnourishment and dehydration after 67 exorcism sessions. Michel's parents and the two Roman Catholic priests were found guilty of negligent homicide and were sentenced to six months in jail (reduced to three years of probation), as well as a fine. In a conference several years later, German bishops retracted the claim that she was possessed. Several movies are based on her story. Among them are The Exorcism of Emily Rose of 2005 , the award-winning 2006 film Requiem and the 2011 film Anneliese: The Exorcist Tapes. Because of the trial, her case became known even outside Germany. The psychiatrist who testified against the defence, suggested that one of the priests Arnold Ernst Alt, had an \" abnormal personality in the widest sense of the term\", and even suggested he had undiagnosed condition possibly from a psychosis, or Schizophrenia. The parents said they entrusted the fate of their child to the Church. The court ruled that the people should have looked got medical help, when it was necessary. The verdict was mostly accepted. After this case, the church changed the way in which exorcisms are handled. In 2005, the Church said that Anneliese essentially died of extreme malnutrition. To decide about possession, a panel of experts is needed. This panel also incudes doctors and psychologists. A new rite, introduced in 1999 says that the exorcism has to stop, if people refuse medical attention, or do not let a doctor be present at the rite. In 2013 there was a house fire where Anneliese Michel lived. German news \" Regional\" covered the story. Believers claimed they could see the ghost of Anneliese on the balcony. The police attributed the cause of this fire due to a cause of arson. == References == Category:1952 births Category:1976 deaths Category:20th-century German people Category:Deaths from starvation Category:German crime victims Category:German Roman Catholics Category:Manslaughter victims Category:Stigmata",
 "title": "Anneliese Michel"
}