{
 "id": "1111539",
 "text": "The 2024 Libertarian National Convention was a political event to choose the Libertarian Party's candidates for president and vice president in the 2024 election. It took place from May 24 to the morning of May 27, 2024, at the Washington Hilton in Washington, D.C. == Background == Elections were held for the chairperson and vice chair of the Libertarian National Committee. Angela McArdle is the current chairperson, and Andrew Watkins is the vice chair. McArdle was elected in 2022 in Reno, Nevada, with 69% of the votes. She was supported by the Mises Caucus, which opposes Nicholas Sarwark's time as chairperson. Robert F. Kennedy Jr. first said he wouldn't run but then accepted a nomination on the day of the convention. He was eliminated in the first round with 19 votes. Donald J. Trump wanted to run but was disqualified for not submitting the right paperwork. == Presidential nomination == Candidates had to get signatures from at least 30 delegates to be nominated. The following candidates met this requirement: * Lars Mapstead * Art Olivier * Mike ter Maat * Joshua \"Toad\" Anderson * Robert F. Kennedy Jr. * Joshua Smith * Charles Ballay * Chase Oliver * Michael Rectenwald * Jacob Hornberger A delegate tried to nominate Donald Trump, but it was invalid because Trump didn't submit the needed papers. ==Balloting== Ten candidates were nominated for the first round. Delegates could also write in a candidate or vote for \"None of the Above\" (NOTA). If no one gets 50%, the candidate with the fewest votes are eliminated, and they vote again. * First round: Ballay, Kennedy Jr., Anderson, and Olivier were eliminated. * Second round: Hornberger was eliminated. * Third round: Smith was eliminated. * Fourth round: Mapstead was eliminated. * Fifth round: ter Maat was eliminated. After this, he announced he would run as Oliver's running mate. The Mises Caucus also offered ter Maat the vice presidential spot. * Sixth round: Oliver and Rectenwald faced off. No one got 50% due to votes for NOTA and write-ins. Rectenwald, as the lowest placed, was eliminated. * Seventh round: Oliver competed against NOTA. Angela McArdle said if NOTA won, the party wouldn't nominate a candidate for president. Oliver won the nomination with 60.6% of the vote. Candidate 1st ballot 2nd ballot 3rd ballot 4th ballot 5th ballot 6th ballot 7th ballot Votes % Votes % ± Votes % ± Votes % ± Votes % ± Votes % ± Votes % ± Chase Oliver 181 19.7% 219 24.0% +4.3% 230 25.4% +1.4% 231 25.9% +0.5% 286 32.9% +7.0% 423 49.5% +16.6% 497 60.6% +11.1% None of the above 11 1.2% 7 0.8% −0.4% 9 1.0% +0.2% 10 1.1% +0.1% 22 2.5% +1.4% 44 5.2% +2.7% 300 36.6% +21.4% Write-ins 13 1.4% 8 0.9% −0.5% 2 0.2% −0.7% 1 0.1% −0.1% 3 0.3% +0.2% 5 0.6% +0.3% 23 2.8% +1.2% Michael Rectenwald 259 28.2% 293 32.2% +4.0% 319 35.2% +3.0% 335 37.6% +2.4% 334 38.4% +0.8% 382 44.7% +6.3% Eliminated Mike ter Maat 141 15.3% 162 17.8% +2.5% 165 18.2% +0.4% 175 19.6% +1.4% 225 25.9% +6.3% Eliminated Lars Mapstead 122 13.3% 123 13.5% +0.2% 137 15.1% +1.6% 139 15.6% +0.5% Eliminated Joshua Smith 73 7.9% 62 6.8% −1.1% 45 5.0% −1.8% Eliminated Jacob Hornberger 59 6.4% 37 4.1% −2.3% Eliminated Charles Ballay 21 2.3% Eliminated Robert F. Kennedy Jr. 19 2.1% Eliminated Joshua \"Toad\" Anderson 16 1.7% Eliminated Art Olivier 4 0.4% Eliminated Votes cast 919 87.4% 911 86.7% −0.7% 907 86.3% −0.4% 891 84.8% −1.5% 870 82.8% −2.0% 854 81.3% −1.5% 820 78.0% −3.3% == Vice Presidential nomination == Candidates had to get signatures from at least 30 delegates to be nominated. The following candidates met this requirement: * Clint Russell * Kendal Ludden * Mark Stewart Greenstein * Mike ter Maat * Freddie Clegg Balloting Five candidates were nominated for the first round. Delegates could also write in a candidate or vote for \"None of the Above\" (NOTA). If no one gets 50%, the candidate with the fewest votes are eliminated, and they vote again. Delegates decided to suspend the rules and eliminate all candidates below 15% in the first round. * First round: Clegg, Greenstein, and Ludden were eliminated. * Second round: Mike ter Maat, endorsed by presidential nominee Chase Oliver, won with 51.3% of the vote. Candidate 1st ballot 2nd ballot Votes % Votes % ± Mike ter Maat 367 49.7% 371 51.3% Clint Russell 339 45.9% 340 47.0% +1.1% None of the above 8 1.1% 8 1.1% +0.0% Write-ins 10 1.4% 4 0.6% −0.8% Freddie Clegg 9 1.2% Eliminated Kendal Ludden 3 0.4% Eliminated Mark Stewart Greenstein 3 0.4% Eliminated Votes cast 739 70.3% 723 68.8% −1.5% == Convention speakers == According to the convention website, these people were scheduled to appear as convention speakers: * Robert F. Kennedy Jr., environmental lawyer and independent presidential candidate * Peter A. McCullough, cardiologist and epidemiologist * Vivek Ramaswamy, entrepreneur and former Republican presidential candidate * Gabriel Shipton, brother of Julian Assange * Ron Paul, former U.S. Representative (1976–1977, 1979–1985, 1997–2013), 1988 Libertarian presidential nominee, 2008 and 2012 candidate for the Republican presidential nomination * Mark Skousen, economist and writer * Dave Smith, comedian and commentator * Donald Trump, former president and presumptive Republican presidential nominee After Trump announced he would speak at the convention on May 1, Kennedy suggested a debate, but Trump declined. Trump's invitation was controversial, and the Libertarian National Committee considered canceling it. During his speech, Trump tried to get the Libertarian nomination and promised to appoint a Libertarian to his cabinet. Vivek Ramaswamy spoke and debated with the vice-presidential debate winner, chosen by a straw poll at the convention. Nicole Shanahan, Robert F. Kennedy Jr.'s running mate, was supposed to speak on May 26 but withdrew after Kennedy was eliminated in the first round. == Delegate allocation == Delegates at the convention are assigned to state party affiliates based on the number of members in the national Libertarian Party in each state and the percentage of votes Jo Jorgensen received in the 2020 presidential election. There were 1,051 delegates voting at the convention. == Related pages == * 2024 Libertarian Party presidential primaries * 2024 Republican National Convention * 2024 Democratic National Convention == References == Libertarian National Convention Category:May 2024 events",
 "title": "2024 Libertarian National Convention"
}