{
 "id": "1111107",
 "text": "Andrei Rublev (,The Getty Union Artist Name List prefers \"Rublyov\", but \"Rublev\" is more commonly found. ; – ) was a Russian artist. He is thought to be one of the best medieval Russian painters of Orthodox Christian icons and frescoes. He is a saint in the Eastern Orthodox Church. His feast day is 29 January. ==Early life== There is little information about his life. It is not known where he was born. He probably lived in the Trinity-St. Sergius Lavra, near Moscow. The first mention of Rublev is in 1405. At this time, he had decorated icons and frescos for the Cathedral of the Annunciation of the Moscow Kremlin. ==Career== In 1408, he probably painted the Dormition Cathedral, Vladimir. He also painted the Trinity Cathedral in the Trinity Lavra of St. Sergius between 1425 and 1427. Andrei's last work was in Moscow's Andronikov Monastery. Here, he painted the frescoes of the Saviour Cathedral. He is also thought to have painted one of the miniatures in the Khitrovo Gospels. The only work that we known Andre painted is the icon of the Trinity (c. 1410). It is based on the \"Hospitality of Abraham\" (which showed ). Rublev removed the figures of Abraham and Sarah from the scene. He also changed the subject of the painting to be the Mystery of the Trinity. ==Death and legacy== Rublev died at Andronikov Monastery between 1427 and 1430. Rublev's work influenced many artists including Dionisy. The Stoglavi Sobor (1551) made Rublev's style popular for church painting. Since 1959, the Andrei Rublev Museum at the Andronikov Monastery has shown his and related art. The Russian Orthodox Church canonized Rublev as a saint in 1988. His feast day is on 29 January and/or on 4 July. In 1966, Andrei Tarkovsky made the film Andrei Rublev. This movie is based on his life. == Veneration == * 29 January – commemoration of his death anniversary (Greek Orthodox Church) * 12/13 June – feast day, Synaxis of All of Andronikov Monastery (with Andronicus, Sabbas, Alexander, Abbots of Moscow and Daniel the Black, the icon painter) * 4 July – main feast day from the list of \"Russian saints of Moscow and Vladimir\" by Nikodim (Kononov), * 6 July – Synaxis of All Saints of Radonezh * Synaxis of all saints of Moscow – movable holiday on the Sunday before 26 August (ROC) ==Selected works== Image:Nativity (15th c., Annunciation Cathedral in Moscow).jpg|Nativity of Jesus, 1405 (Cathedral of the Annunciation, Moscow Kremlin) Image:Baptism (15th c., Annunciation Cathedral in Moscow).jpg|Baptism of Jesus, 1405 (Cathedral of the Annunciation, Moscow) Image:Annunciation from Vasilyevskiy chin (1408, Tretyakov gallery).jpg|Annunciation, 1405 (Cathedral of the Annunciation, Moscow) Image:Vladimirskaya by A.Rublev (1395-1410s, Vladimir museum).jpg|Version of the Theotokos of Vladimir, Image:Michael from Vasilyevskiy chin (15th c., GTG).jpg|St. Michael, 1408 (Iconostasis at Dormition Cathedral, Vladimir) Image:Gabriel from Vladimirskiy chin (15th c., GTG).jpg|St. Gabriel, 1408 (Dormition Cathedral, Vladimir) Image:Andrew from Vasilyevskiy chin (15th c., GTG).jpg|St. Andrew the First-called, 1408 (Dormition Cathedral, Vladimir) Image:Gregory of Nazianzus from Vasilyevskiy chin (15th c., GTG).jpg|St. Gregory the Theologian, 1408 (Dormition Cathedral, Vladimir) Image:Virgin Mary from Vasilyevskiy chin (15th c., GTG).jpg|Theotokos from Deësis, 1408 (Dormition Cathedral, Vladimir) Some think this may be the work of Theophanes the Greek Image:John the Evangelist from Vasilyevskiy chin (15th c., GTG).jpg|St. John the Theologian, 1408 (Dormition Cathedral, Vladimir) Image:John the Baptist from Vasilyevskiy chin (15th c., GTG).jpg|St. John the Baptist, 1408 (Dormition Cathedral, Vladimir) Image:Spas v silach from Vasilyevskiy chin (15th c., GTG).jpg|The Saviour Enthroned in Glory, Christ in Majesty, 1408 (Dormition Cathedral, Vladimir) Image:Harrowing of hell from Vasilyevskiy chin (1408, Tretyakov gallery).jpg|Harrowing of Hell, 1408-1410 (Vladimir) Image:Rublev's saviour.jpg|Christ the Redeemer ca. 1410 (Tretyakov Gallery, Moscow) Image:Ascension from Vasilyevskiy chin (15th c., GTG).jpg|Ascension, 1408 (Tretyakov Gallery, Moscow) Image:Rublev Paul.jpg|Apostle Paul, 1410s (Tretyakov Gallery, Moscow) ==References== === Sources === *Andrei Rublev, a 1966 film by Andrei Tarkovsky loosely based on the painter's life. * Mikhail V. Alpatov, Andrey Rublev, Moscow: Iskusstvo, 1972. *Gabriel Bunge, The Rublev Trinity, transl. Andrew Louth, St. Vladimir's Seminary Press, Crestwood, New York, 2007. *Sergius Golubtsov, Voplosh’enie bogoslovskih idey v tvorchestve prepodobnogo Andreya Rubleva [The realization of theological ideas in creative works of Andrey Rublev]. Bogoslovskie trudy 22, 20–40, 1981. *Troitca Andreya Rubleva [The Trinity of Andrey Rublev], Gerold I. Vzdornov (ed.), Moscow: Iskusstvo 1989. *Viktor N. Lazarev, The Russian Icon: From Its Origins to the Sixteenth Century, Gerold I. Vzdornov (ed.). Collegeville, MN: Liturgical Press, 1997. *Priscilla Hunt, Andrei Rublev's Old Testament Trinity Icon in Cultural Context, The Trinity-Sergius Lavr in Russian History and Culture: Readings in Russian Religious Culture, vol. 3, ed. Deacon Vladimir Tsurikov, (Jordanville, NY: Holy Trinity Seminary Press, 2006), 99-122.(See on-line at phslavic.com) *Priscilla Hunt, Andrei Rublev's Old Testament Trinity Icon: Problems of Meaning, Intertextuality, and Transmission, Symposion: A Journal of Russian (Religious) Thought, ed. Roy Robson, 7-12 (2002–2007), 15-46 (See on-line at www.phslavic.com) *Konrad Onasch, Das Problem des Lichtes in der Ikonomalerei Andrej Rublevs. Zur 600–Jahrfeier des grossen russischen Malers, vol. 28. Berlin: Berliner byzantinische Arbeiten, 1962. *Konrad Onasch, Das Gedankenmodell des byzantisch–slawischen Kirchenbaus. In Tausend Jahre Christentum in Russland, Karl Christian Felmy et al. (eds.), 539–543. Go¨ ttingen: Vandenhoeck und Ruprecht, 1988. *Eugeny N. Trubetskoi, Russkaya ikonopis'. Umozrenie w kraskah. Wopros o smysle vizni w drewnerusskoj religioznoj viwopisi [Russian icon painting. Colourful contemplation. Question of the meaning of life in early Russian religious painting], Moscow: Beliy Gorod, 2003 [1916]. *Georgij Yu. Somov, Semiotic systemity of visual artworks: Case study of The Holy Trinity by Rublev, Semiotica 166 (1/4), 1-79, 2007. ==Other websites== * Andrey Rublev Official Web Site * Rublev at the Russian Art Gallery * Selected works by Andrei Rublev: icons, frescoes and miniatures * \"The Deesis painted by Andrey Rublev\" from the Annunciation Church of the Moscow Kremlin - article by Dr. Oleg G. Uliyanov * Historical documentation on Andrei Rublev, compiled by Robert Bird * Venerable Andrew Rublev the Iconographer Orthodox icon and synaxarion Category:14th-century births Category:Christian saints Category:Russian painters Category:15th-century deaths Category:Eastern Orthodox Christians",
 "title": "Andrei Rublev"
}