{
 "id": "1111273",
 "text": "Kellie Gerardi (born February 16, 1989) is an American aerospace professional, author, and bioastronautics researcher. She is widely known for her work in the commercial space industry and her role as a science communicator. Gerardi is a citizen astronaut candidate with Virgin Galactic and a prominent advocate for space exploration and STEM education. == Education == Gerardi attended the University of Florida, where she pursued her interest in aerospace and space science. She graduated with a Bachelor of Arts degree, with a focus on the intersection of technology, communication, and media. Gerardi's academic background laid the foundation for her multifaceted career in the space industry. == Career == Gerardi began her career in the aerospace industry working with the Commercial Spaceflight Federation, where she contributed to policy and advocacy efforts aimed at advancing commercial spaceflight. Her role involved collaboration with industry leaders, policymakers, and other stakeholders to promote the growth of the commercial space sector. == Bioastronautics research == Gerardi has conducted extensive research in bioastronautics, focusing on human health and performance in space environments. She has participated in microgravity research flights with the International Institute for Astronautical Sciences (IIAS) and other organizations. Her research includes studying the effects of microgravity on the human body and developing technologies to support human life in space. == Virgin Galactic == As a citizen astronaut candidate with Virgin Galactic, Gerardi is part of a select group of individuals training for suborbital spaceflights. Her involvement with Virgin Galactic underscores her commitment to advancing human spaceflight and contributing to the broader goals of space exploration. == Authorship and science communication == Gerardi is the author of \"Not Necessarily Rocket Science: A Beginner’s Guide to Life in the Space Age,\" a book aimed at making space science accessible to a general audience. Through her writing and public speaking engagements, she has become a prominent science communicator, inspiring a new generation of space enthusiasts and STEM students. == Public engagement and advocacy == In addition to her professional work, Gerardi is actively involved in public engagement and advocacy for space exploration. She serves on the board of directors for The Explorers Club and is a member of several other space- related organizations. Her outreach efforts include speaking at conferences, participating in educational initiatives, and leveraging social media to promote interest in space science. == References == Category:1989 births Category:American scientists",
 "title": "Kellie Gerardi"
}