{
 "id": "1111460",
 "text": "The athletics competitions at the Olympics of Grace in Florence, Italy were held from 30 to 31 May 1931 at the track of athletics club ASSI Giglio Rosso. This was a 336 metres track. The athletes competed in 12 events: running (60 metres, 100 metres, 200 metres, 800 metres, 4 x 75 metres relay, 4 x 100 metres relay, Swedish relay and hurdling 80 metres), high jump, long jump, discus throw, javelin throw, shot put. ==Schedule== Local time Event Round 30 May 1931 Track events 9:00 60 m Heats 9:45 100 m Heats 10:15 60 m Semi-finals 11:00 4x75 m relay Semi-finals 11:15 200 m Semi-finals 15:00 80 m hurdles Semi-finals 15:45 60 m Final 17:00 200 m Final 18:00 4x100 m relay Semi-finals Field events 10:00 Shot put Prelim 10:00 Long jump Prelim 10:30 Discus throw Prelim 15:15 Javelin throw Prelim 16:00 Shot put Final 16:15 Long jump Final 31 May 1931 Track events 10:30 100 m Semi-finals 16:30 100 m Final 16:45 80 m hurdles Final 17:15 4x75 m relay Final 17:45 Swedish race Final 18:15 4x100 m relay Final Field events 17:00 High jump Final 17:30 Javelin throw Final 18:00 Discus throw Final ==Participating nations== A total of 11 nations participated in the athletics competition. * * * * * * * * * * * There were negotiations with several other inveted countries to attend the competitions, including the United States, the Netherlands, Bulgaria and Greece. The Netherlands did not send a delegation due to the high costs. ==Medal summary== 60 metres 8.0 - - 100 metres 12.6 12.8 12.8 200 metres 25.8 26.0 - 80 metres hurdles 13.0 13.2 - 4 × 75 metres relay Nellie Halstead Muriel Cornell Mary Seary Daisy Ridgley 38.6 Lidia Bongiovanni Maria Bravin Tina Steiner Giovanna Viarengo 39.2 Anna Hřebřinová Rudolfa Krausová Zdeňka Smolová Anna Kuzniková - 4 × 100 metres relay Nellie Halstead Muriel Cornell Mary Seary Daisy Ridgley 51.4 Tilly Fleischer Marie Dollinger Detta Lorenz Lisa Gelius 51.8 Anna Hřebřinová Rudolfa Krausová Zdeňka Smolová Anna Kuzniková - Swedish relay Nellie Halstead Muriel Cornell Mary Seary Daisy Ridgley 55.6 Marie Dollinger Lisa Gelius Detta Lorenz 55.8 Herma Schurinek Veronika Kohlbach Liesl Perkaus Maria Weese 57.0 High jump 1.45 m 1.45 m 1.40 m Long jump 5.46 m 5.20 m 5.03 m Shot put 12.23 m 11.64 m 11.33 m Discus throw 36.51 m 34.47 m 34.38 m Javelin throw 37.27 m 35.75 m 31.18 m ==Points table== Team Nation Points 1 77 2 71 3 54 4 35 5 22 5 22 6 17.5 7 16 8 10.5 9 6 9 6 ==References== Category:Athletics at the Olympics of Grace Category:Olympics of Grace Category:1930s in women's athletics",
 "title": "Athletics at the Olympics of Grace"
}