{
 "id": "1111506",
 "text": "Yam Rafaeli (born November 3, 1998) is an Israeli singer. == Biography == Rafaeli was born in Beer Sheva. His mother died when he was 12 and as a result, he moved in with his father. At the age of 16 he left his father's house and moved in with his friends. In 2018, he enlisted in the IDF as a lone soldier in the Air Force Band. Rafaeli currently lives in Eliat. == Career == At the end of 2017, at the age of 18, he participated in the third season of the reality show \"X Factor Israel\", qualified for the final and took third place. On July 1, 2018, he released his debut single, \"May pain find friends.\" The song was released after Rafaeli signed with Aroma Music under the direction of his mentor on the X Factor Israel show, Hebrew singer Ivri Lider.The song was very successful and placed in the top ten of the weekly Media Forest and Galglatz charts. And it even reached 17th place in the annual parade of the Kaan Gimel radio station. In December 2018, she released her second single, \"Words that I would only say to you.\" At its peak, the song ranked 8th on the official Galgalat chart. In January 2019, he participated in a tribute event to the band \"Queen\" held at the fairgrounds, along with several artists and made special arrangements of the band's songs with them. In May 2019 he performed at the Israel Awards with the singer Kitaria. The two performed the song \"Zemer Ahava Lim\" together. In July he released the single \"No me get out of my head\". In October 2019, he was a guest on rapper Talisman's song, \"Black Rose.\" In March 2020 he released the single \"Mil Violines.\" The song entered Kaan Gimel playlist. In April he participated in a revised version of the song \"Good Days\", produced in honor of Independence Day, alongside Subliminal, Gal Malka, Kitaria, Gad Elbaz and Ran Shapir. Later this month, he released the song \"Old School\". In 2022 he participated in the musical \"The Band\", based on the film by Avi Nesher. In May he released the single \"Madness\", which featured singer Or Amrami Brockman. On March 31, 2024, he released the single \"Un lugar en tu vida\", the first single from his debut album. The song's lyrics and melody were written and composed by Rafaeli along with Guy Kopelman, who also produced the song. ==Discography== === Musical singles=== * 2018: שהכאב ימצא לו חברים * 2021: אין אף אחד * 2020: הכל מהתחלה * 2024: מקום בחייך ==References== == Other websites == * on YouTube Category:1998 births Category:Israeli singers Category:Israeli composers Category:Israeli musicians",
 "title": "Yam Refaeli"
}