{
 "id": "1111083",
 "text": "The Yugoslav People's Army (JNA/), also called the Yugoslav National Army, was the military of the Socialist Federal Republic of Yugoslavia from 1945 to 1992. ==Origins== It stared with the Yugoslav Partisans of World War II. The People's Liberation Army of Yugoslavia was formed as a part of the anti- fascist People's Liberation War of Yugoslavia in the Bosnian town of Rudo on 22 December 1941. After the Yugoslav Partisans liberated the country from the Axis Powers, that date was officially celebrated as the \"Day of the Army\" in the Socialist Federal Republic of Yugoslavia. In March 1945, it was renamed the \"Yugoslav Army\" and, on its 10th anniversary, on 22 December 1951, \"People's\" was added. There was a Soviet blockade from 1948 to 1955. It is called the Informbiro period. The Yugoslav Army's development stagnated then. Many people attending military academies in the USSR at the time of the Tito–Stalin split never returned to Yugoslavia. Almost all the Air Force officers had Soviet training, and some of them fled Yugoslavia in Air Force planes. The defectors included Major General Pero Popivoda, who was the head of the Air Force operational service. The Batajnica, Zemun, and Pančevo airbases near Belgrade saw several attacks by groups of saboteurs. The Zemun airbase commander and his deputy fled to Romania. Between 1948 and 1955, the United States gave Yugoslavia US$600 million in direct military grants and an equal amount in economic aid. Yugoslavia could spend more on defence. U.S. weaponry began arriving by late 1951. By 1952 the Armed Forces had grown to 500,000 troops, and defence expenditures was 22% of the gross national product. A Military Assistance Advisory Group of 30 officers commanded by Brigadier General John W. HarmonyLieutenant Colonel M.N. Kadick, \"How Strong is Tito's Army?,\" Combat Forces Journal, May 1952. was set up by the United States in Belgrade in 1951. It operated for ten years. It made military grants and arranged another US$1 billion in arms sales on favorable terms. ==References== Category:Armies Category:Cold War Category:1945 establishments in Europe",
 "title": "Yugoslav People's Army"
}