{
 "id": "1112230",
 "text": "The polkadot poison frog, common poison arrow frog, or red and black poison frog (Oophaga arborea) is a frog. It lives in Panama. Adult male and female frogs are about 20-22 mm long from nose to rear end. The frog's skin is either brown or black with bright yellow spots on both the top and bottom of its body. The spots stick up from the rest of the skin. Young frogs look almost exactly like smaller adult frogs, but their skin may look a little green. The poisons in a frog's body can kill a human. This frog lives high in the trees where the branches come together like a roof. Scientists gave it the Latin name \"arborea\" because that word means \"of trees.\" It lives in forests where there is water in the air. People have seen this frog between 20 and 1300 meters above sea level. The male frog sits on the leaf of a bromeliad plant and calls to the female. The female comes to the plant and lays her eggs on the plant. The female frog guards the eggs and then the male frog does. The tadpoles grow in the water in bromeliad plants. The female frog lays an egg that won't hatch in the water for the tadpole to eat. Scientists have seen female frogs eating eggs from the same species. Scientists believe this frog is in big danger of dying out because people change the places where the frog lives. People cut down trees to get wood to build with, to build places to raise cows and other animals, and to build towns and other places to live. In some places, for example Bosque Protector Palo Seco, people raise animals even though it is against Panama's laws. Scientists think people might catch this frog to sell. Scientists think the fungus Batrachochytrium dendrobatidis might make this frog sick, but they do not know how much danger the frog is in from the fungus. Batrachochytrium dendrobatidis causes the fungal disease chytridiomycosis. The frog lives in at least two protected parks, Reserva Forestal Fortuna and Bosque Protector Palo Seco, but in Bosque Protector Palo Seco, people break the law and do things that harm the frog anyway. ==References== Category:Frogs of South America",
 "title": "Oophaga arborea"
}