{
 "id": "1112417",
 "text": "Vicente's poison frog (Oophaga vicentei) is a frog. It lives in Panama. ==Body== The adult male and female frogs are 12 to 24 mm long from nose to rear end. The skin of the frog's back can be different colors, for example yellow, red, blue, gray, or green. Most frogs have black marks on their backs and the tops of all four legs. Young frogs are much more black in color. The frog's nose can be round or pointed. ==Home== This frog lives in rainforests. It mostly lives in trees, but people have seen it look for food on the ground. This frog is awake during the day. People have seen this frog between 4 and 912 meters above sea level. ==Young== The male frog finds a good place for the female frog to lay eggs, usually near the leaf of a bromeliad plant high in a tree. He calls to the female and she comes to him. The two frogs make motions with their legs. The female frog turns in circles before and after she lays eggs. She lays 1 - 12 eggs at a time. Both the male and female frog leave the eggs, but the male frog will come back. He will stop the eggs from being too dry. After the eggs hatch, the female frog carries each tadpole on her back to a different pool of water in plants. She comes back every few days to lay an egg that will not hatch for the tadpole to eat. This is the only food the tadpole can eat. She does not lay a new group of eggs during this time. When human beings raise frogs in glass boxes, sometimes they see female frogs eating other females' eggs. Scientists do not know if female O. vicente frogs in the wild eat other females' eggs or if this is something they only do in glass boxes. ==Poison== These frogs mostly eat animals without bones, especially ants. Scientists think that the poison from the ants might help the frogs make their own poison, but they are not sure. ==Danger== Scientists believe this frog is in danger of dying out because it lives in a small place, because people cut down forests to dig good rocks out of the ground and make farms and places for cows to eat grass, and because people catch the frog to sell as a pet because it is so beautiful. Scientists think the fungus Batrachochytrium dendrobatidis could kill this frog because it has killed other frogs that live in the same places. Batrachochytrium dendrobatidis causes the fungal sickness chytridiomycosis. Two of the places the frog lives are protected parks: Santa Fé National Park and General de División Omar Torrijos Herrera National Park. The Panama Amphibian Rescue and Conservation Project also took some frogs to raise. ==First paper== * ==References== Category:Frogs of South America",
 "title": "Oophaga vicentei"
}