{
 "id": "111251",
 "text": "The Night of the Long Knives (German: ) or \"Operation Hummingbird\" () was a purge that took place in Nazi Germany. It happened between 30 June and 2 July 1934 when the Nazi regime executed at least 90 people and an estimated 200 for political reasons. Most of those killed were members of the \"Storm Troopers\" (SA) (German: ). Adolf Hitler moved against the SA and its leader, Ernst Röhm, because he saw the independence of the SA and the penchant of its members for street violence as a direct threat to his power. Hitler also wanted to forestall any move by leaders of the Reichswehr, the German military, who both feared and despised the SA, to curtail his rule, especially since Röhm made no secret of his ambition to absorb the Reichswehr with himself at its head. Adolf Hitler also killed them because they were becoming difficult to control and he was worried that they would branch off and want independence to carry out more radical ideas. Finally, Hitler used the purge to go against conservative critics of his regime, especially those loyal to Vice-Chancellor Franz von Papen, and to settle scores with old enemies, such as Kurt von Schleicher. Ernst Röhm was arrested on June 30 by the SS (lead by Reichsführer-SS Heinrich Himmler and deputy SS-Obergruppenführer Reinhard Heydrich) and was killed by General Josef Sepp Dietrich,Theodor Eicke and Michael Lippert . == Official list of those killed == However, the list of 77 was far from being complete: Hitler admitted that some excesses had taken place and stated that he had handed over the cases of several people who had been killed as part of unauthorized actions by subordinate organs to the authorities, who were supposed to implement a regular prosecution of the perpetrators. Among those cases who were at first subject to regular investigation and prosecution by the locally responsible Attorney Offices were those of the city clerk Kuno Kamphausen who was murdered at the order of an SS officer who bore a grudge against him for refusing to give a construction permission to his brother and the cases of four Jews and two Communists who were killed without permission from Berlin in the course of arbitrary actions by lower SS echelons in the province of Silesia. In September 1934, Heinrich Himmler – eager to shield his SS men from legal prosecution – managed to convince Hitler to change his mind on the latter six people, whose names as a consequence, were subsequently added to the official list whose killing was to be considered rightful and which now encompassed 83 names. The list of 77 or 83 names respectively was kept in several copies – which were stored under lock and key – in the Ministry of Justice and the Gestapo Headquarters. After a law entitled \"Gesetz über Maßnahmen der Staatsnotwehr\" (\"Law pertaining to the Measures of Self-Defense of the State\") had been passed by the Reich Cabinet on July 3, which declared: \"Die zur Niederschlagung hoch- und landesverräterischer Angriffe am 30. Juni, 1. und 2. Juli 1934 vollzogenen Maßnahmen sind als Staatsnotwehr rechtens\" (\"The measures taken to clamp down on the treasonous attacks of June 30th, July 1st and 2nd are rightful, due to having been acts of self-defense of the State.\")wikisource it was decided that the killing of everybody on that list was to be considered lawful and that therefore the police and Attorney Offices were prohibited from investigating and prosecuting anyone for those killings. The lists thus were used by the Ministry and the Gestapo as a referential tool which could be consulted to decide, whether requests of relatives and friends of those killed to be given information on the circumstances of death of their beloved ones, or requests to prosecute those responsible for their killing would be answered in the affirmative (people killed and not mentioned on the Gestapo list) or in the negative (people whose names were to be found on the list). The same applied to requests of other state authorities (especially police departments and Attorney Offices) who inquired at the Ministry of Justice or the Gestapo headquarters whether they should open and or continue investigation of a specific killing that had taken place on the three days from June 30 to July 2. The official list of those killed was first published in 1964 by Heinrich Bennecke (1902–1972) in the appendix of his book Die Reichswehr und der \"Röhm- Putsch\". == Estimates of people killed in addition to those on the official list == Later research by historians has shown that in addition to those listed by the Gestapo a number of others also had been killed. Heinrich Bennecke complemented the names of the city clerk Kuno Kamphausen from Waldenburg and the music critic Willi Schmid to his reprint of the official Gestapo list, whereupon he concluded that at least 85 people were killed during the purge. Later, Hans Günther Richardi, in his study on the Dachau concentration camp, added the names of four inmates of Dachau (lawyer Julius Adler (1882–1934), worker Erich Gans (1908–1934), Walter Häbich and worker Adam Hereth (1897-1934)), claiming they were murdered by the SS during the purge. In 1993 Otto Gritschneder published a book on the post–World War II prosecution of those involved in the killings which lists 90 names of people killed (adding the doctor and Röhm associate Karl Günther Heimsoth to the list).:de:Otto Gritschneder: Der Führer hat sie zum Tode verurteilt, Munich 1993, . Richard J. Evans states that at least 85 people were killed and more than 1000 were arrested. Ian Kershaw also cites the number of deaths at 85. Kershaw notes that \"some estimates...put the total number killed at between 150 and 200.\" William L. Shirer writes in his Rise and Fall of the Third Reich, that \"The White Book of the Purge, published by émigrés in Paris claims 401 deaths, but lists only 116 of them. At the 1957 trial in Munich the figure 'more than 1,000' was used.\" Both of those figures are much higher than the ones most historians of the period rely on, and that Shirer himself was not necessarily citing the figures as accurate, but was simply relaying them in his book. The most recent study on the matter lists by name 89 people who were definitely killed, as well as two other cases of whom it is unclear whether they were murdered during the events or slightly earlier or later.Rainer Orth: Der SD-Mann Johannes Schmidt. Der Mörder des Reichskanzlers Kurt von Schleicher?, Marburg 2011, pp. 102–112. ==List of The Victims== Name Place of death Personal details Circumstances Image Otto Ballerstedt Dachau Concentration Camp Former Chief of the \"Bayernbund\", a secessionist political group in Bavaria. Hitler was imprisoned for a month in 1922 after he had physically attacked Ballerstedt at a rally. Ballerstedt was arrested on the evening of 30 June 1934 by armed SS men in his Munich apartment, a day before going on a planned trip to Austria. He was killed in or near Dachau concentration camp. His body found on the morning of 1 July in the forest near Gündinger Neuhimmelreich. The autopsy revealed he had died by a shot to the back of the head.(Kimmel: KZ Dachau, S. 366;) Garg: Justice in the Third Reich, p. 439 in combination with international Dachau Committee: Dachau notebooks, vol. 8-9, p. 222 Fritz Beck Gündinger Forest near Dachau Director of the Munich Students' Welfare Fund Killed either for his contacts to Röhm who was honorary president of his student association or for Beck’s opposition to Nazi policy. Herbert von Bose Borsig Palace, Berlin Press chief in the Prussian State Ministry, senior government councillor and associate of Franz von Papen Part of the catholic conservative opposition centered around Edgar Jung. Initially reported as \"suicide\" then revised to \"shot while resisting search of the Chancellery\". Ferdinand von Bredow Berlin Chief of the Abwehr, Generalmajor of the Reichswehr, close associate of Kurt von Schleicher, famed militarist and Junker. Shot when answering his door at Spichernstrasse 15 in Berlin's Wilmersdorf, or perhaps executed the following Monday by firing squad. Georg von Detten Lichterfelde SS barracks Member of the Reichstag, SA- Gruppenführer and head of the Political Office in the Supreme SA-Leadership Arrested at Munich train station and transferred to Stadelheim Prison. Together with his staff leader Hans-Joachim von Falkenhausen, Karl Schreyer and Fritz Ritter von Kraußer, he was flown to Berlin. The four men were held at Columbia concentration camp prior to execution at Lichterfelde SS barracks. Karl Ernst Lichterfelde, SS barracks Member of the Reichstag, SA-Gruppenführer and Führer of SA-Gruppe Berlin-Brandenburg Ernst was arrested in Bremerhaven together with his wife about to board a ship to travel to their honeymoon. He was handed over in Bonn to an SS unit led by Kurt Gildisch for interrogation. He was flown to Berlin, taken to the Leibstandarte Adolf Hitler barracks. He was shot by firing squad on June 30, one of 14 people shot there.Federal Archive NS 23/45. Hans Joachim von Falkenhausen Lichterfelde SS barracks SA- Oberführer, chief of staff of Georg von Detten, brother of General Alexander von Falkenhausen - the head of the military government in Belgium in 1940–44 during its German occupation. He was arrested in Munich on June 30, 1934. The next day he was flown to Berlin with Georg von Detten, Fritz von Krausser and Karl Schreyer. They were temporarily held in the Columbia concentration camp at Tempelhof. Falkenhausen was taken to Lichterfelde SS barracks and shot at 2 a.m. on July 2. Fritz Gerlich Dachau Concentration Camp Newspaper journalist, editor of Munich's Catholic weekly (Der Gerade Weg) and publisher, Catholic Action Had been arrested already on 9 March 1933 and was in detention in Dachau KZ prior to his execution. Alexander Glaser Maxvorstadt, Munich Lawyer, associate of Gregor Strasser Shot from behind outside his apartment on Amalienstrasse in Munich. He succumbed to his injuries a few days later, on July 5 at Schwabing Hospital. Hans Hayn Stadelheim Prison, Munich Member of the Reichstag, SA-Gruppenführer and Führer of SA-Gruppe Sachsen On June 30, 1934, Hayn was arrested and taken to Stadelheim Prison in Munich. There he was shot by the SS Leibstandarte under Sepp Dietrich in the afternoon, along with Edmund Heines, Peter von Heydebreck, Wilhelm Schmid, August Schneidhuber and Hans Erwin von Spreti-Weilbach. Edmund Heines Stadelheim Prison, Munich Member of the Reichstag, SA-Obergruppenführer, deputy to Röhm, Führer of SA- Obergruppe VIII (Silesia) and Chief of Police of Breslau Arrested at Bad Wiessee having been found in bed with Erich Schiewek, transferred to Stadelheim Prison where he was shot by an SS firing squad convened by Sepp Dietrich. In 1957, Dietrich was convicted of being an accessory to manslaughter by a West German court and sentenced to 18 months in prison. Oskar Heines In a field near Groß Heidau SA-Sturmbannführer and younger brother of Edmund Heines. Hans Peter von Heydebreck Stadelheim Prison, Munich Member of the Reichstag, SA-Brigadeführer and Führer of SA-Gruppe Pomerania Arrested on his way to Bad Weissee and transferred to Stadelheim Prison. He was shot by an SS-Leibstandarte firing squad convened along with Hans Hayn, Edmund Heines, Wilhelm Schmid, August Schneidhuber and Hans Erwin von Spreti- Weilbach in the early evening of the same day. In 1957, Sepp Dietrich, who convened the firing squad which executed the men, was convicted of being an accessory to manslaughter by a West German court and sentenced to 18 months in prison. Anton von Hohberg und Buchwald Dulzen, East Prussia SS- Obersturmführer, one of only five SS victims.Hamburger Abendblatt 4 August 1962 Shot by two SS men at his home on the orders of Obergruppenführer Erich von dem Bach-Zelewski. On January 16, 1961, von dem Bach Zelewski was convicted of manslaughter by a West German court and sentenced to years imprisonment Edgar Julius Jung Uncertain, possibly Berlin Lawyer, Catholic Action worker. Authored Vice-Chancellor Franz von Papen's \"Marburg speech\", critical of the Nazi Party. In 'protective custody' since late June. Found dead in a ditch near Oranienburg on 1 July, or executed the following Monday by firing squad. Gustav Ritter von Kahr Dachau concentration camp Former prime minister of Bavaria, member of Triumvirate that ruled Bavaria during the Beer Hall Putsch. Shot at the Dachau concentration camp. Story that his body was later found hacked with pickaxes largely discredited by later historians. Dr. Kuno Kamphausen Waldenburg Architect, member of the Zentrum political party Three SS officers were convicted of his manslaughter in 1934 and sentenced to 1, 2, and 5 years in prison. However, they were all released from prison within a year, under pressure by Himmler. Eugen von Kessel Tiergartenstrasse, Berlin Former officer and police captain Shot dead in his Berlin office on June 30, 1934. Erich Klausener Wilhelmstrasse 80, Berlin Catholic Professor, former leader of the police department in the Prussian ministry of internal affairs and president of Berlin's Catholic Action group. Close associate of Vice-Chancellor Franz von Papen and contributed to the Marburg speech. Shot in his office at the Ministry of Transport in Berlin. The assassination was ordered by Reinhard Heydrich, and carried out by Kurt Gildisch. After the war, Gildisch convicted of his murder, having been promoted by the SS in rank after the killing, and sentenced to 15 years in prison. He was released from prison on health grounds shortly before his death in 1956. Hans-Karl Koch Lichterfelde SS barracks Member of the Reichstag, SA-Brigadeführer in SA- Gruppe Westmark Fritz Ritter von Kraußer Lichterfelde SS barracks Member of the Reichstag, SA-Obergruppenfuhrer and Chief of Department I (Organization) in the Supreme SA Leadership. Arrested on 30 June 1934, and sent to Stadelheim prison. Transferred from Munich to Berlin where he was executed at Lichterfelde SS barracks on 2 July. Adalbert Probst Unknown National director of the Catholic Youth Sports Association (German:Deutsche Jugendkraft- Sportverbands) Probst was abducted and later found dead, allegedly \"shot while trying to escape\".John S. Conway; The Nazi Persecution of the Churches, 1933-1945; p. 92 Hans Ramshorn Woods near Obernigk and Breslau-Deutsch-Lissa Member of the Reichstag, SA-Brigadeführer in Oberschlesien and chief of police of Gleiwitz Udo von Woyrsch was convicted of manslaughter for this killing amongst others in 1957 and sentenced to 10 years imprisonment. Ernst Röhm Stadelheim prison, Munich SA-Stabschef (chief of staff), Minister without portfolio in the Reich cabinet and Member of the Reichstag Arrested at Bad Wiessee, transferred to Stadelheim Prison. Executed in his cell after being given a gun with one bullet and asked to commit suicide. Paul Röhrbein Dachau concentration camp SA-captain, leader of the first SA of Berlin In protective custody in various prisons in Munich and in the Dachau concentration camp since July 5, 1933. Shot along with Fritz Gerlich. Martin Schätzl Dachau Concentration Camp SA-Obertruppführer and adjutant to Röhm Arrested at Bad Wiessee, transferred to Stadelheim Prison, taken to Dachau KZ where he was shot by the SS. Erich Schiewek Dachau concentration camp SA-Obertruppführer from Breslau, accompanied Edmund Heines to Bad Wiessee as substitute adjutant Arrested in bed with Heines. After incarceration in Stadelheim Prison, he was transferred to Dachau KZ where he was shot by the SS alongside Max Vogel. General Kurt von Schleicher Babelsberg, Potsdam Former Chancellor of Germany. Shot at home with his wife, reported as \"resisting arrest\". Elisabeth von Schleicher Babelsberg Wife of Kurt von Schleicher. Shot alongside her husband, died on the way to hospital Wilhelm Eduard Schmid Dachau Concentration Camp Music critic for the Münchener Neueste Nachrichten, a Munich newspaper. Killed by SS in a case of mistaken identity, believing him to be either SA- Gruppenführer Wilhelm Schmid or Dr. Ludwig Schmitt, sympathizer of Otto Strasser. Wilhelm Schmid Stadelheim Prison, Munich SA-Gruppenfuhrer, Fuhrer of SA-Gruppe Hochland in Munich and member of the Reichstag Arrested in Munich and sent to Stadelheim prison. He was executed by the Leibstandarte along with SA leaders Hans Hayn, Edmund Heines, Peter von Heydebreck, August Schneidhuber and Hans Erwin von Spreti-Weilbach. In 1957, Sepp Dietrich, who convened the firing squad which executed the men, was convicted of being an accessory to manslaughter by a West German court and sentenced to 18 months in prison. August Schneidhuber Stadelheim Prison, Munich SA-Obergruppenfuhrer, Fuhrer of SA-Obergruppe VII (Munich), chief of police in Munich and member of the Reichstag Arrested by Hitler in Munich and sent to Stadelheim prison. He was executed by the Leibstandarte along with SA leaders Hans Hayn, Peter von Heydebreck, Wilhelm Schmid, Hans Erwin von Spreti-Weilbach and Edmund Heines. In 1957, Sepp Dietrich, who convened the firing squad which executed the men, was convicted of being an accessory to manslaughter by a West German court and sentenced to 18 months in prison. Johann Konrad Schragmüller Lichterfelde SS barracks SA-Gruppenführer, Member of the Reichstag, chief of police of Magdeburg Arrested in Bad Wiessee. Transferred to Lichterfelde SS barracks where he was shot. Hans Schweighart Dachau Concentration Camp SA- Standartenfuhrer - Adjutant to Ernst Röhm Arrested on June 30, 1934, in Bad Wiessee and taken to Stadelheim Prison. Shot in Dachau KZ on July 1, 1934. Emil Sembach Riesengebirge Member of the Reichstag, ex-SS-Oberführer Udo von Woyrsch was convicted of manslaughter for this killing amongst others in 1957 and sentenced to 10 years imprisonment. Hans Erwin Graf von Spreti-Weilbach Stadelheim Prison, Munich Close associate of Röhm, SA-Standartenfuhrer Arrested at Bad Wiessee, transferred to Stadelheim Prison where he was executed by the Leibstandarte on 30 June along with Hans Hayn, Edmund Heines, Peter von Heydebreck, Wilhelm Schmid and August Schneidhuber. In 1957, Sepp Dietrich, who convened the firing squad which executed the men, was convicted of being an accessory to manslaughter by a West German court and sentenced to 18 months in prison. Father Bernhard Stempfle Munich Defrocked priest, former co-prisoner of Hitler in Landsberg, Bavaria, and one of the editors of Mein Kampf No known motive. Gregor Strasser Prinz-Albrecht-Strasse, Berlin Former high-ranking Nazi Party member as Reichsorganisationsleiter and former member of the Reichstag. Hitler was godfather to his children. Shot in a cell in the Gestapo HQ. Reported as a suicide. Julius Uhl Dachau concentration camp SA- Standartenfuhrer, Hitler named him in the Reichstag as the man who would've killed him Arrested at Bad Weissee on June 30 then transferred to Stadelheim Prison. Along with Martin Schätzl and Johann König he was transferred to Dachau Concentration Camp and shot on July 2. Maximilian \"Max\" Vogel Dachau concentration camp SA-Obersturmfuhrer, Ernst Röhm's chauffeur Arrested in Bad Wiessee. After incarceration in Stadelheim Prison, he was transferred to Dachau KZ where he was shot by the SS together with Erich Schiewek.Lothar Gruchmann : Justice in the Third Reich 1933-1940: Adaptation and submission in the Gürtner era , p. 437. Gerd Voß Lichterfelde SS barracks SA-Sturmfuhrer, lawyer and SA legal adviser to Karl Ernst Karl Zehnter Road from Dachau to Augsburg near Längenmoos Zum Bratwurstglöckl proprietor The Zum Bratwurstglöckl in Munich was Röhm's favorite tavern, where Goebbels met secretly with Röhm prior to the purge. Although not involved politically, it was deemed that he 'knew too much'. Alexander Zweig Near Hirschberg Jewish doctor from Hirschberg Jeanette Zweig Near Hirschberg Wife of Alexander Zweig (contrary to some accounts, she herself was not Jewish by birth) Ernestine Zoref Dachau concentration camp Partner of arrested journalist Paul Edmund von Hahn, a suspected Soviet spy. After imprisonment at Dachau KZ, Zoref was released only to be rearrested on June 30, 1934. She was brought back to Dachau and immediately shot. ==References== ===Inline citations=== ===General references=== * Evans, Richard (2005)The Third Reich in Power. New York: Penguin Group * Kershaw, Ian (1999) Hitler: 1889–1936: Hubris. New York: W. W. Norton & Company * Shirer, William L. (1960) The Rise and Fall of the Third Reich. New York: Simon and Schuster == External links == * Victims of the Night of the Long Knives Category:Adolf Hitler Category:Deaths by firearm in Germany Category:LGBTQ history in Germany *SA Category:Nazi SS",
 "title": "Night of the Long Knives"
}