{
 "id": "1112453",
 "text": "The Australia national futsal team nicknamed the Futsalroos represents Australia in international futsal. They have appeared at the FIFA Futsal World Cup, OFC Futsal Nations Cup and AFC Futsal Championship. ==Competitive record== ===FIFA Futsal World Cup=== FIFA Futsal World Cup record Year Result Position 1989 1st round 11th 3 1 1 1 6 8 1992 1st round 12th 3 1 0 2 9 11 1996 1st round 15th 3 0 0 3 4 26 2000 1st round 15th 3 0 0 3 3 22 2004 1st round 15th 3 0 0 3 2 18 2008 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2012 Group stage 20th 3 1 0 2 5 17 2016 Group stage 18th 3 1 0 2 5 16 2020 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2024 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify Total 7/10 0 Titles 21 4 1 16 34 118 ===OFC Futsal Championship=== OFC Futsal Championship record Year Result Position 1992 Champion 1st 4 4 0 0 28 6 1996 Champion 1st 6 6 0 0 69 8 1999 Champion 1st 6 6 0 0 41 4 2004 Champion 1st 5 5 0 0 20 0 2013^ Champion 1st 5 5 0 0 24 2 Total 5/5 5 Titles 26 26 0 0 182 20 ^Australia was no longer part of the OFC. They appeared as a guest nation. ===AFC Futsal Asian Cup=== AFC Futsal Asian Cup record Year Result Position 2006 Group stage 7th 3 2 0 1 14 13 2007 Quarter finals 8th 4 1 1 2 6 13 2008 Quarter finals 7th 4 2 0 2 13 10 2010 Quarter finals 7th 4 2 0 2 15 20 2012 Fourth place 4th 6 3 0 3 12 19 2014 Quarter finals 6th 4 2 0 2 10 14 2016 Quarter finals 5th 6 4 0 2 17 16 2018 Withdrew Withdrew Withdrew Withdrew Withdrew Withdrew Withdrew Withdrew 2020 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2022 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2024 Group stage 16th 3 0 0 3 6 13 Total 8/11 0 Titles 34 16 1 17 93 118 ===AFF Futsal Championship=== AFF Futsal Championship record Year Result Position 2001 did not participate 2003 2005 2006 2007 Runners-up 2nd 5 4 0 1 15 14 2008 did not participate did not participate did not participate did not participate did not participate did not participate did not participate did not participate 2009 did not participate did not participate did not participate did not participate did not participate did not participate did not participate did not participate 2010 did not participate did not participate did not participate did not participate did not participate did not participate did not participate did not participate 2012 did not participate did not participate did not participate did not participate did not participate did not participate did not participate did not participate 2013 Runners-up 2nd 6 5 0 1 42 7 2014 Runners-up 2nd 6 4 0 2 30 13 2015 Runners-up 2nd 6 5 0 1 46 15 2016 did not participate did not participate did not participate did not participate did not participate did not participate did not participate did not participate 2017 Withdrew Withdrew Withdrew Withdrew Withdrew Withdrew Withdrew Withdrew 2018 did not participate did not participate did not participate did not participate did not participate did not participate did not participate did not participate 2019 Group stage 5th 3 1 0 2 9 14 2022 Group stage 6th 3 1 0 2 9 15 Total 6/17 0 Titles 29 20 0 9 151 78 ==References== Category:Asian national futsal teams Category:National sports teams of Australia",
 "title": "Australia national futsal team"
}