{
 "id": "11129",
 "text": "{{Infobox U.S. state symbols |Flag = Flag of Connecticut.svg |Seal = Seal of Connecticut.svg |Name = Connecticut |Bird = American robin |Fish = American shad |Flower = Mountain laurel |Insect = European mantis |Mammal = Sperm whale |Tree = Charter Oak, a white oak |Dance = Square dance |Fossil = Dinosaur tracks |Mineral = Garnet |Motto = |Tartan = Connecticut State Tartan |Route Marker = Connecticut Highway 15.svg |Quarter = 1999 CT Proof.png |QuarterReleaseDate = 1999 }} Connecticut is a state in the United States. Its capital is Hartford, and its largest city is Bridgeport. It is one of the six states of New England. It borders New York to the west, Massachusetts to the north, Rhode Island to the east, and the Long Island Sound to the south. Connecticut is called the \"Constitution State.\" In 1639 settlers adopted the \"Fundamental Orders,\" which has been called the first written constitution in history. Its current constitution (Connecticut's third) was adopted in 1965. ==Geography== Connecticut has forests, rivers, lakes, waterfalls, and a sandy shore. The Connecticut River cuts through the center of the state. It flows into Long Island Sound, Connecticut's outlet (connection) to the Atlantic Ocean. === Regional variations === Even though Connecticut is small, different parts of the state have different landscapes and culture. Some areas are very rural. For example, the Litchfield Hills in northwestern Connecticut have rolling mountains and horse farms. There are many small towns and rural areas in the northeast and northwest corners of the state. Connecticut also has industrial cities, located along the coastal highways from the New York border to New Haven, then northwards to Hartford, and farther up the coast near New London. The state has some very wealthy areas. The southwestern corner of Connecticut, where it touches New York State, includes Greenwich, Stamford, Fairfield, Westport, Wilton, and Darien. Some of the wealthiest residents in the world live in these areas. Many towns center around a small park, known as a \"green\" (such as the New Haven Green). Near the green there is often a small white church, a town meeting hall, a tavern, and several colonial houses. === Highest locations === The highest peak in Connecticut is Bear Mountain in Salisbury, in the northwest corner of the state. The highest point is just east of where Connecticut, Massachusetts, and New York State meet (42° 3' N; 73° 29' W), on the southern slope of Mount Frissell, whose peak lies nearby in Massachusetts. === National Parks === The United States National Park Service maintains several areas in Connecticut. These include the: * Appalachian National Scenic Trail * Quinebaug & Shetucket Rivers Valley National Heritage Corridor * Weir Farm National Historic Site ==== The Appalachian Trail ==== The Appalachian Trail runs for about 52 miles through Connecticut, passing through hardwood forests. At its lowest, the Trail in Connecticut is 260 feet above sea level (just under 80 meters). At its highest, its is nearly half a mile high (2316 feet, or 796 meters). ==History== The name \"Connecticut\" comes from the Mohegan Indian word Quinnehtukqut. This word means Long River Place or Beside the Long Tidal River. === Colonial history === In 1614, a Dutch man named Adriaen Block became the first European explorer to arrive in modern-day Connecticut. After that, Dutch fur traders sailed up the Connecticut River (which they called Versche Rivier). They built a fort near present-day Hartford, which they called House of Hope (Huys de Hoop in Dutch). The first English settlers arrived in 1633. They were Puritans from Massachusetts, led by the Reverend Thomas Hooker. They founded the Connecticut Colony. Colonies were also established at Old Saybrook and New Haven, which later became part of Connecticut. Historically important colonial settlements included: * Windsor (1633) * Wethersfield (1634) * Saybrook (1635) * Hartford (1636) * New Haven (1638) * New London (1646) Because the Dutch were outnumbered by the English settlers, they left their fort in 1654. Connecticut is the fifth of the original thirteen states. === Changing borders === Connecticut's western borders have changed over time. According to a 1650 agreement with the Dutch, the western boundary of Connecticut ran north from the west side of Greenwich Bay (\"provided the said line come not within 10 miles [16 km] of Hudson River\"). On the other hand, Connecticut's original Charter in 1662 granted it all the land to the \"South Sea\" (the Pacific Ocean, which is on the West Coast of the United States). Connecticut got its current boundaries because: * Government officials made agreements with New York * Connecticut fought for control of Westmoreland County during the Pennamite Wars against Pennsylvania * Congress got involved in setting borders after the Pennamite Wars * Connecticut had to give up and sell the Western Reserve lands ==Related pages== * List of counties in Connecticut * List of hurricanes in Connecticut * List of rivers of Connecticut * Connecticut Colony ==References== ==Other websites== * www.ct.gov * www.tourism.state.ct.us Category:1788 establishments in the United States",
 "title": "Connecticut"
}