{
 "id": "1112410",
 "text": "\"Who put Bella in the Wych Elm?\" is a graffito that appeared in 1944 after four teenagers discovered the skeletonized body of a woman inside a whych elm, in Worcestershire, England, in 1943. Skeletonization is the last stage of decomposition after death. It means that the last bits of soft tissue have dried or disappeared; the bones of the body are visible. Today, the woman is still unknown, the case has not been solved. People believe she died in 1941. The phrase is sometimes spelled in a slightly different ways, for example using \"witch\" instead of \"whych\", or using the preposition \"down\" (so that it reads: ..put Bella down in the which/whych elm). An autopsy was done, but the location of the autopsy report is currently unknown. Many media articles, movies, dramas, an opera and a musical have been made from the case. == Discovery == On 18 April 1943, four local boys (Robert Hart, Thomas Willetts, Bob Farmer and Fred Payne) were poaching or bird–nesting in Hagley Wood, part of the Hagley estate belonging to Lord Cobham near Wychbury Hill. They came across a large whych elm. They thought that the place was a very good place to search for a bird's nest. Farmer tried to climb the tree, to investigate. When he climed, he looked down into the hollow trunk, and saw a skull. At first he believed it was that of an animal, but when he saw human hair and teeth, he realised that he had found a human skull. As they were on the land illegally, Farmer put the skull back and all four boys returned home without mentioning their discovery to anybody. However, when he returned home, the eldest of the boys, Willetts, felt uneasy about what he had witnessed and decided to tell his parents. == Investigation == Later, police checked the trunk of the tree. They found an almost complete skeleton, with a shoe, a gold wedding ring, and some fragments of clothing. The skull was valuable evidence, because it still had some tufts of hair and had a clear dental pattern, even though some teeth were missing. After further investigation, the remains of a hand were found some distance from the tree. They sent the body to Home Office pathologist James Webster in Birmingham, to do a forensic examination. He quickly established that it was that of a female who had been dead for at least 18 months, placing time of death in or before October 1941; Webster also discovered a section of taffeta in her mouth. This suggested she had died from suffocation. From the measurement of the trunk in which the body had been discovered, he also deduced that it must have been placed there \"still warm\" after the killing, as it could not have fit once rigor mortis had taken hold. Police could tell from items found with the body what the woman had looked like when she was alive. It was the time of the Second World War, and many people had been reported missing. For this reason, no proper identification was done. They cross-referenced the details they had with reports of missing people throughout the region, but none of them seemed to match the evidence. In addition, they contacted dentists in the area since the dentistry was quite distinctive. === 21st century === A case review by West Mercia Police was closed in 2014. A 2018 episode of the television programme Nazi Murder Mysteries described a forensic facial reconstruction done by the Liverpool John Moores University's \"Face Lab\", from photographs of the skull. It was commissioned by Andrew Sparke for his books on the incident. In May 2023, the BBC launched an appeal to museums, to find the victim's remains so that DNA analysis could be done. The remains had been in the Birmingham City Police's \"black museum\" at their Tally Ho! training centre until the late 1960s or early 1970s. The appeal was made together with a BBC podcast on the case, The Body in the Tree. == Theories == In a BBC Radio 4 programme first broadcast in August 2014, Steve Punt suggested two possible victims. One was reported to the police in 1944 by a Birmingham sex worker. In the report, she stated that another sex worker called Bella, who worked on the Hagley Road, had disappeared about three years before. The name “Bella” (or “Luebella”) suggested the graffiti writer was probably aware of the identity of the victim. A second possibility came from a statement made to police in 1953. In it, Una Mossop said that her ex-husband Jack Mossop had confessed to family members that he and a Dutchman called van Ralt had put the woman in the tree. Mossop and van Ralt met for a drink at the Lyttelton Arms (a pub in Hagley). Later that night, Mossop said the woman became drunk, and passed out while they were driving. The men put her in a hollow tree in the woods in the hope that in the morning she would wake up and be frightened into seeing the error of her ways. Jack Mossop was sent to a Stafford mental hospital because he had recurring dreams of a woman staring out at him from a tree. He died in the hospital before the body in the wych elm was found. The likelihood of this being the correct explanation is questioned because Una Mossop did not come forward with this information until more than 10 years after Jack Mossop's death. Another theory comes from an MI5 declassified file about Josef Jakobs. Jacobs was the last man to be executed in the Tower of London, on 15 August 1941. He was an Abwehr agent who parachuted into Cambridgeshire in 1941. When he landed, he broke his ankle and was soon arrested by the Home Guard. They found a photo on him of a woman, who they thought was his lover. It was that of a German cabaret singer and actress named Clara Bauerle. Jakobs said that she was being trained as a spy and that, had he made contact, she might have been sent over to England after him. However, there is no evidence that Clara Bauerle was parachuted into England, and several witnesses describe that Clara Bauerle was around tall, while Bella was . In September 2016, it was determined that Clara Bauerle had died in Berlin on 16 December 1942. In 1945, Margaret Murray, an anthropologist and archaeologist at University College, London, proposed a more radical theory—witchcraft—because she believed that the severing of one hand was consistent with a ritual called the Hand of Glory, after the victim had been killed by Romani people during an occult ritual. Her ideas excited the local press and led investigators to consider another seemingly ritualistic killing of a man, Charles Walton, in nearby Lower Quinton. In 1953, another theory surfaced: This theory said that the victim was a Dutchwoman named Clarabella Dronkers, and she had been killed by a German spy-ring consisting of a British officer, a Dutchman and a music hall artist, for \"knowing too much\". Available records and evidence were unable to support the story. == Graffiti == In 1944, graffiti related to the mystery appeared on a wall in Upper Dean Street, Birmingham, reading Who put Bella down the wych elm – Hagley Wood. This provided investigators with several new leads for tracing who the victim could have been. Other messages in the same hand appeared too. Since at least the 1970s, similar graffiti has sporadically appeared on the Hagley Obelisk near to where the woman's body was discovered, which asks the slightly modified Who put Bella in the Witch Elm? == Cultural references == In 2003, Simon Holt composed a chamber opera with the title \"Who put Bella in the Wych Elm?\" and libretto by Caryl Churchill. A play with the same title was later commissioned from the Los Angeles writer and director Katherine Vondy in 2019 and produced in 2022. There have also been smaller scale dramatic presentations in Britain, for the most part serving as staged docudramas or as educational exercises. They include Tom Lee Rutter's film Bella in the Wych Elm (2017); Who Put Bella in the Wych Elm? at London's The Space in March 2018, written and adapted from archive sources by Leah Francis and director Tom Drayton; a musical of the same title by Ellis Kerkhoven, and score by Adam Gerber, at the Royal Central School of Speech and Drama in 2019; Francesca Haydon-White's 2021 theatrical documentary in Durham; and the ME Dance Company's project in Walsall (2023) and Wolverhampton (2024). ==Notes== == References == == Other websites == * \"Who Put Bella in the Wych Elm\" article on Atlas Obscura * Who Put Bella in the Wych Elm, article from Brian Haughton's website * Casefile True Crime Podcast - Case 04 - Who Put Bella In The ‘Witch’ Elm - 30 January 2016 * Bella in the Wych Elm- Christmas and Crime, Confessed Obsessed podcast * The Body In The Tree podcast * Hoe Bella Stierf A Dutch podcast series about the case Category:1944 works Category:Pages with unreviewed translations Category:Murders in the United Kingdom by decade Category:1940s in the United Kingdom",
 "title": "Who put Bella in the Wych Elm?"
}