{
 "id": "1112587",
 "text": "The Metro Tunnel is an under-construction railway tunnel in Melbourne, Australia which is scheduled to open in 2025.https://bigbuild.vic.gov.au/projects/metro-tunnel When it opens, the Metro Tunnel will create a single railway line from Sunbury in Melbourne's North-West to Cranbourne and East Pakenham in Melbourne's South-East. This means that trains on the Sunbury line, Cranbourne line, and Pakenham line will no longer use the City Loop. As part of the Melbourne Airport rail link it is planned to run trains to Melbourne Airport through the Metro Tunnel,https://bigbuild.vic.gov.au/projects/melbourne-airport-rail however this project has been delayed until at least 2033.https://www.abc.net.au/news/2024-05-10/melbourne-airport-rail-link- delayed-again/103823938 ==Stations== The Metro Tunnel has five underground stations. All five stations have platform screen doors which open only when a train arrives, preventing passengers from falling onto the tracks. ===Anzac Station=== Anzac Station is located nearly 2km south of the Melbourne CBD. Its name is a reference to the nearby Shrine of Remembrance war memorial. As well as trains in the Metro Tunnel, 8 tram routes stop at the station. ===Town Hall Station=== Town Hall station is located almost directly under Flinders Street station and passengers can walk between the two stations without touching on and off their Myki. It is named after the nearby Melbourne Town Hall. ===State Library Station== State Library station is located almost directly under Melbourne Central station and passengers can walk between the two stations without touching on and off their Myki. It is named after the nearby State Library of Victoria. ===Parkville Station=== Parkville station is located in the suburb of Parkville. The station is in the middle of a major health and education precinct, nearby to destinations such as the University of Melbourne and Royal Melbourne Hospital. ===Arden Station=== Arden station is located in the suburb of North Melbourne. The station is named after the nearby Arden street. Arden station is located in a previously industrial area, which is undergoing urban renewal as part of the Metro Tunnel project. ==References== Category:Tunnels Category:Transport in Australia",
 "title": "Metro Tunnel"
}