{
 "id": "1112927",
 "text": "Earl of Northumbria is a title in the ancient feudal nobility of England. It comes from the historic kingdom of Northumbria in northern England. This title is older than the Norman Conquest of England. ==History== The feudal earldom first appeared in 1006, when Uhtred the Bold led armies from Bernicia and Yorkshire to repel a Scottish invasion led by King Malcolm II of Scotland. They were victorious. King Ethelred the Unready named Uhtred the Earl of Bamburgh, despite his father still holding that title. Seeking to consolidate power in the north, Ethelred had Elfelm, Earl of York murdered. He granted the earldom of York to Uhtred. This united the regions and making him the first Earl of Northumbria. In 1013, King Sweyn Forkbeard of Denmark successfully invaded England. Like other northern Vikings, Uhtred pledged allegiance to Sweyn. Sweyn's reign lasted just five weeks before he died. Uhtred then renewed his oath to Ethelred. In 1016, Uhtred married Ethelred's daughter Elfgifu. He campaigned with Ethelred's son Edmund Ironside to defend Wessex against the invading Sweyn's son, Canute. After Canute became King of England, Uhtred submitted to his rule. At a meeting Uhtred went to without weapons per custom, he was murdered by Thurbrand the Hold on Canute's orders. Uhtred was succeeded by his brother Eadwulf Cudel as Earl of Southern Northumbria. Canute gave the title of Earl of Northumbria to the experienced Norwegian warrior Eric of Hlathir. Eric oversaw the siege of London that helped secure Canute's control. He lost the title in 1023 when Canute exiled him for unknown reasons, and Eric returned to Norway. In 1024, Uhtred's son Ealdred avenged his father by killing Thurbrand. From 1033 until his death in 1055, Siward \"Digri\" strengthened his position as Earl through marriage and loyal service to the King, expanding his territories. Though he wished to die in battle, Siward died from dysentery but insisted on being dressed for war at the end. With Siward's son still a child, King Edward the Confessor gave the title of Earl to Tostig Godwinson in 1055. Tostig was unpopular with his heavy taxes and tyranny, leading to rebellion in 1065. The Northumbrians deposed Tostig and elected Morcar as the new Earl. This led Tostig and Harald Hardrada to invade in 1066. They were defeated by Tostig's brother King Harold Godwinson at Stamford Bridge. The line of Earls was disrupted following the Norman conquest of England in 1066. After the Norman conquest, William the Conqueror appointed several Earls of Northumbria in quick succession as he sought to consolidate his control over the troubled region. Copsi held the title briefly in 1067 before being killed in an uprising. Osulf then claimed the title but also met an early end. In 1068, Gospatrick, descended from the old royal line of Northumbria, paid William for recognition as Earl. Gospatrick joined a rebellion in 1069 and lost the title. He regained it briefly from 1070-1072 after invading from Scotland, only to lose it again for displeasing William. Waltheof, formerly Earl of Northampton, then received the title in 1072. He was executed for treason in 1076. Bishop William Walcher of Durham purchased the earldom but proved unable to defend against Scottish raiders and local revolt. He was killed in 1080. Aubrey de Coucy was next named Earl but resigned the title around 1086. Robert de Mowbray received the title in 1086. He was one of the most powerful barons in England. In 1095 he joined a rebellion and was defeated and imprisoned by William Rufus. The title was dissolved and replaced by separate earldoms of Northumberland and York. In 1139, as part of a treaty to end Scottish cross-border raiding, King David I's heir Henry became the fifteenth Earl of Northumbria. His son William the Lion inherited the title in 1152. In 1157 King Henry II forced William out. This ended the special status of Northumbria and brought it fully into English administration under northern earldoms. In 2010, Kevin Norris became the seventeenth Earl of Northumbria, by rightful ownership of the lawful rights to the earldom. These rights are enshrined in the laws of England as incorporeal hereditaments and have been re-established through due legal process by a learned authority within the realm in compliance with the Honours (Prevention of Abuses) Act of 1925. == References == Category:Feudalism Category:Nobility Category:English Earls",
 "title": "Earl of Northumbria"
}