{
 "id": "1112464",
 "text": "Günter Behnisch (12 June 1922 – 12 July 2010) was a German architect. He was born in Lockwitz. During World War II, he was one of Germany's youngest submarine commanders. After World War II, he became one of the most important architects indeconstructivism. His most important works were the Olympic Park in Munich and the new West German parliament in Bonn. ==Early life== In 1922, Behnisch was born the middle child of three children in Lockwitz, near Dresden.David Childs, Günter Behnisch: The architect behind Munich's groundbreaking Olympic Stadium, in The Independent (London), 7 August 2010, retrieved 1 March 2012 He went to many schools, because his Social Democrat father was arrested, fired, and moved to Chemnitz by the new Nazi government. In 1939 at age 17, Behnisch volunteered to join the navy (Kriegsmarine). This was a less difficult alternative than being conscripted. He eventually became a U-boat officer and served on . In October 1944, he became one of the youngest U-boat commanders. He commissioned . After World War II, he surrendered his submarine to the British. He became a prisoner of war in Featherstone Castle in Northumberland. Behnisch trained to become a bricklayer. In 1947, however he studied architecture at the Technical University in Stuttgart.Thorsten Dörting, Obituary of the Architect Günter Behnisch, in Spiegel online international, 13 July 2010, retrieved 9 August 2010 From 1967 to 1987 he was a professor at the Technische Hochschule Darmstadt. == Main works == * 1967–72: Olympic Park in Munich, Germany * 1984–87: Central library of the Catholic University of Eichstätt-Ingolstadt, Eichstätt, Germany * 1984–90: Museum für Kommunikation Frankfurt, Germany * 1985–87: HYSOLAR-Building der University of Stuttgart, Germany * 1987–92: Plenary Complex of the German Parliament (Bundestag) in Bonn, Germany * 1993–2005: Academy of Arts Building in central Berlin, a six-story glass expansion of the reconstructed Hotel Adlon * 1997: State Clearing Bank – Landesgirokasse in Stuttgart, Germany * 1998: Control tower at Nuremberg Airport, Germany * 1998–2002: North German State Clearing Bank in Hanover, Germany * 1999: Museum der Phantasie, Bernried am Starnberger See, Germany * 2003: Genzyme Center in Cambridge, Massachusetts, USA * 2005: Centre for Cellular and Biomolecular Research in Toronto, Canada ==References== === Sources === * == Other websites == *Official site Category:1922 births Category:2010 deaths Category:German architects Category:20th-century artists Category:German educators Category:People from Munich Category:Prisoners of war",
 "title": "Günter Behnisch"
}