{
 "id": "1112061",
 "text": "Victor Vasarely (; born Győző Vásárhelyi, ; 9 April 1906Birth registered at county archives of Pécs http://www.bml.hu ref. no. 330/1906 – 15 March 1997) was a Hungarian-French artist. He is called the \"grandfather\" and leader of the Op art movement. == Life and work == Vasarely was born in Pécs in 1906. He grew up in Piešťany (then Pöstény) and Budapest. In 1925, he started studying medicine at Eötvös Loránd University. In 1927, he quit medicine to learn how to paint at the private Podolini-Volkmann Academy. In 1928, he went to the private art school Műhely. In 1929, he painted his Blue Study and Green Study. In 1930, he married Claire Spinner (1908–1990). They had two sons together. His sons were Andre and Jean-Pierre. Jean-Pierre was also an artist. In the 1930s, Vasarely became a graphic designer and a poster artist. In 1930, Vasarely moved to Paris. He became a graphic artist and as a creative consultant for many advertising agencies. He did not talk to many other artists. Vasarely mostly lived in cheap hotels. In 1942, he moved to Saint- Céré. After World War II, he opened an atelier in Arcueil. In 1961, he moved to Annet-sur-Marne. Vasarely made art and sculpture using optical illusion. From the 1960s to 1990s, Vasarely made his own style of geometric abstract art. He used many different materials, but used very few colors. In 1967, Will Burtin asked Vasarely to make a presentation in his Vision '67 conference at New York University. On 5 June 1970, Vasarely opened his first museum, and had over 500 works. It was in a renaissance palace in Gordes, and it was closed in 1996. Vasarely also made the Foundation Vasarely in Aix-en-Provence. This was a museum inside of a building that Vasarely designed. The museum is now in disrepair. Many pieces of art here have been damaged. In 1976, he designed the large moving object Georges Pompidou in the Centre Pompidou. Also in 1976, he donated lots of money to help build the Vasarely Museum in his birthplace of Pécs, Hungary. In 1982, Vasarely made 154 serigraphs, which were taken into space by the cosmonaut Jean-Loup Chrétien onto the French-Soviet spacecraft Salyut 7. In 1987, the second Hungarian Vasarely museum was made in Zichy Palace in Budapest. It had more than 400 works. On 15 March 1997, he died in Paris. == Legacy == A exhibit about Vasarely was put in Paris at Musée en Herbe in 2012. The original UK cover for David Bowie's second album 'David Bowie' (1969) had Vasarely's work in the background. == Awards == * 1964: Guggenheim Prize * 1970: French Chevalier de L'Ordre de la Légion d'honneur * Art Critics Prize, Brussels * Gold Medal at the Milan Triennial == Museums == * 1970–1996: Vasarely Museum in the Saint-Firmin Palace in Gordes, Vaucluse, France (closed in 1996) * 1976: Fondation Vasarely, Aix-en-Provence, France * 1976: Vasarely Museum, Pécs, Hungary * 1987: Vasarely Museum, Zichy Palace, Óbuda, Budapest, Hungary == Related pages == * M. C. Escher == References == ==Further reading== * * * * * == Other websites == * Association Vasarely * Vasarely: Images, Exhibits, Descriptions, Biography * Victor Vasarely profile and video documentary at the Central European Art Database * Vasarely Museum, Zichy Palace, Budapest * Online petition to save Museum Fondation Vasarely in Aix-en-Provence, France (Archived on 16 Apr 2009) * Fondation Vasarely 3D Project * Victor Vasarely * Tate Victor Vasarely Category:1906 births Category:1997 deaths Category:Hungarian painters Category:French painters Category:20th-century French people",
 "title": "Victor Vasarely"
}