{
 "id": "1112787",
 "text": "The 1922 United States Women's World Games trials was an athletics meeting to select the American team for the 1922 Women's World Games in Paris, France. The competitions were hosted at the Oaksmere School in Mamaroneck, New York on 13 May 1922. The event was organized by Harry Stewart. 102 women from 22 institutions from all over the East participated at the trials. Next to the trials in Mamaroneck, similar meets took place in the Middle West and in Los Angeles and results were compared. These trials were the first major athletics competition for women in the United States in history. From 1923 USA Outdoor Track and Field Championships women's competition were included in the national track and field. Multiple world records were broken during the trials. A team of 13 female was selected to represent the United States at the 1922 Women's World Games. This was the first ever national women's team to participate at an international competition. ==Results== Key: Long jump Elizabeth Stine (Leonia High School) 16' Nancy Voorhees (East Hampton) 15' 3.875\" Martha Smith (Rosemary Hall) 14' 9.25\" Hok, skip, jump Elizabeth Stine (Leonia High School) 33' 10.25\" Basketball throw Lucile Godbold (Winthrop College) 88' 3.25\" Kathryn Agar (Oaksmere School) 88' 3\" Nancy Voorhees (East Hampton) 75' 7\" Javelin throw (both hands) Kathryn Agar (Oaksmere School) 134' 3.5\" Anne Harwick (Florida State College) 127' 10\" Edith Easton (Leonia High School) 119' 8.5\" 100 yards hurdles Camelia Sabie (Newark Normal School) 15.2 s Hester Smith (Rosemary Hall) Mary McCune (Rosemary Hall) Shot put (8 pound) Lucile Godbold (Winthrop College, SC) 35' 11\" 4 x 110 yards relay Leonia High School Leila Hopper Martha Nyquist Janet Hobson Mabel Gilliand 53.8 s. Rosemary Hall Ethel Walk School Baseball throw Edith Easton (Leonia High School) 200' 6.5\" Anne Harwick (Florida State College) 186' 7.5\" Margaret Kirkner (Wykeham) 186' 5\" Standing long jump Adeline Gehrig (New York Turn Verein) 7' 7\" Nancy Voorhees (East Hampton, NY) Blanche Strebeigh (St. Margaret's) Edith Easton (Leonia High School) 300 meters Mary McCune (Rosemary Hall) 43.6 s. Luella Mueller (Newark High School) Blanche Dixon (New York Municipal Association) 100 yards Mabel Gilliand (Leonia High School) 12.4 Lucile Godbold (Winthrop College) Elizabeth Stine (Leonia High School) 50 yards Mabel Gilliand (Leonia High School) 6.4 Camelia Sabie (Newark Normal School) Ruth Wincoop High jump Nancy Voorhees (East Hampton) 4' 7\" Elizabeth Stine (Leonia High School) 4' 6\" Josephine Stetson (Rosemary Hall) Emma Davis (St. Mary's College) 4' 5\" === Notes === : Camelia Sabie hit the last of the eight hurdles and as a result her time of 15.2 didn't count as a World Record. : Louise Mead Tricard states as time 57.8, while the official world record is listed as 53.8. Possibly Tricard mixed up the old and new world record, as she states: \"The new mark of 57.8 was 4 seconds faster than the old mark.\" ==Selected athletes== ===Athletes who competed at the 1922 Women's World Games=== Name Resicence Institution Notes Kathryn Agar Chicago, Ill Oaksmere School Floreide Batson (C) New Orleans, LA Rosemary Hall, Smith College Didn't compete at the trials. Mabel Gilliland Leonia, NJ Leonia High School Lucile Godbold Estill, SC Winthrop College Ester Green Canal Zone Balboa High School Didn't compete at the trials. Anne Harwick Miami, Flo Florida State College Frances Mead Tarrytown, NY Rosemary Hall, Smith College Didn't compete at the trials. Camelia Sabie Newark, NJ Newark Normal School Janet Snow Rye, NY Oaksmere School Didn't compete at the trials. Elizabeth Stine Leonia, NJ Leonia High School Louise Voorhees East Hampton, NY Rosemary Hall Didn't compete at the trials. Nominated by coaches of Bryn Mawr Nancy Voorhees East Hampton, NY Ethel Walker School ===Seleted athletes who did not join the American team=== Name Resicence Institution Notes Helen Krepps Columbus, Ohio Ohio State University Krepps didn't compete in the trials, but in May 1922, Krepps won individual prizes at the third annual track meet at Ohio State University, including equaling the collegiate record in the 100-yard hurdles. Lucy Fletcher Greensboro High School Fletcher didn't compete in the trials, but in 1922 she competed in a state track meet at the Florida State College for Women. Lucy won the broad jump with an 'outstanding' distance over 8 feet. Fletcher didn't join the American team because her mother asked her not to go. ==References== Category:1922 in women's athletics Category:Sports in the United States Category:1922 in North America Category:1920s in the United States",
 "title": "1922 United States Women's World Games trials"
}