{
 "id": "11128",
 "text": "{{Infobox U.S. state symbols |Name = Tennessee |Flag = Flag of Tennessee.svg |Flagsize = 175px |Seal = |Amphibian = Tennessee cave salamander |Bird = Mockingbird Bobwhite quail |Butterfly = Zebra swallowtail |Crustacean = |Fish = Channel catfish Smallmouth bass |Flower = Iris Passion flower Tennessee echinacea |Insect = Firefly Lady beetle Honey bee |Mammal = Tennessee Walking Horse Raccoon |Reptile = Eastern box turtle |Tree = Tulip poplar Eastern red cedar |Beverage = Milk |Dance = Square dance |Firearm = Barrett M82 |Food = Tomato |Fossil = Pterotrigonia (Scabrotrigonia) thoracica |Gemstone = Tennessee River pearl |Mineral = Agate |Poem = \"Oh Tennessee, My Tennessee\" by William Lawrence |Rock = Limestone |Slogan = \"Tennessee—America at its best\" |Tartan = Tennessee State Tartan |Route Marker = Tennessee 1.svg |Quarter = 2002 TN Proof.png |QuarterReleaseDate = 2002 }} Tennessee is a state in the United States. Its capital is Nashville, which is the country music center of America. It is also the home of the Smoky Mountains which are a famous tourist attraction. Other well known cities and towns are Memphis, Knoxville, Chattanooga, Oak Ridge, Lynchburg, Carthage, Lawrenceburg, Clarksville, Lebanon, Pigeon Forge, Murfreesboro, and Gatlinburg. Tennessee touches eight states: Kentucky and Virginia to the north; North Carolina to the east; Georgia, Alabama, and Mississippi on the south; Arkansas and Missouri (by the Mississippi River) to the west. Tennessee ties Missouri as the state bordering the most other states. Tennessee was the 16th state to join the nation, on June 1, 1796. About 6.9 million people lived there in 2020. Several professional sports teams play there, including the Tennessee Titans of the NFL, the Memphis Grizzlies of the NBA, and the Nashville Predators of the NHL. Cherokee and other Native American tribes lived in Tennessee before the arrival of Europeans. African American slaves worked on plantations in the state. Tennessee is known for its country music and Southern cuisine. File:Tennessee Bicentennial Mall - carillon pillars.jpg File:Alcoa-highway-black-friday-tn1.jpg File:Newfound Gap Road, Great Smoky Mountains National Park, TN.jpg ==Related pages== * Colleges and universities in Tennessee * List of counties in Tennessee ==References== Category:1796 establishments in the United States",
 "title": "Tennessee"
}