{
 "id": "1113142",
 "text": "Georgette Alphonsine Philomène Vandyck (20 February 1906 - 10 December 1996) was a Belgian track and field athlete, being active during the 1920s. She was specialized in the field events (discus throw, javelin throw and shot put). She also played football.Register of the civil status of Anderlecht, birth certificate 203, 23 February 1906 Vandyck was four times national champion, was Belgian record holder in multiple events and represented Belgium internationally. ==Sports career== Vandyck was a member of Sporting Club Anderlecht. As a member of Brussels Femina Club she played football. She played as a defender. In 1921 Vandyck set the Belgian national record shot put on 7.558 meter (one hand) and 13.42 meter (both hands). In 1922 she was also national record holder in the javelin throw: 16.18 meter (one hand) and 29.68 metre (both hands) and also in the shot put with 14.01 meter.100 jaar Belgische atletiek, KBAB, 1989 At the 1922 Belgian Athletics Championships she became national champion in the shot put and javelin throw. In August 1922 Vandyck represented Belgium at the 1922 Brussels international women's athletics competitions, the earliest Belgian women’s athletics competition in Brussels, where she set also two new Belgian records in the javelin throw and shot put. With a throw of 20.45 meter she won the javelin throw ahead of Florence Birchenough. She lost from Florence Birchenough in the shot put, but her with her score of 8.04 meter she finished ahead of Belgian Alice De Pauw and had another national record. In later years she became again national champion in the javelin throw in 1923 and 1924.100 jaar Belgische atletiek, KBAB, 1989 In 1923 she broke the national records in the discus throw with both hands (47.09 meter) and later the year also with one hand (27.17 meter). Vandyck was selected to represent Belgium at the 1924 Women's Olympiad in London for the discus throw and javelin throw events. In 1925 she competed in at the 1925 Brussels international women's athletics competitions and finished second in the javlin throw behind British Halina Konopacka . Later the year she represented Belgium at the 1925 Belgium–France women's athletics competition where she won the javelin throw (both hands) in a new Belgian record of 38.54 m. She was the only Belgian athlete to win a discipline during this event. Later the year she set the Belgian record to 42.21 meter.100 jaar Belgische atletiek, KBAB, 1989 ==References== Category:1906 births Category:1996 deaths Category:Belgian athletes Category:Shot putters Category:Discus throwers Category:Javelin throwers Category:Belgian footballers Category:Sportspeople from Brussels",
 "title": "Georgette Vandyck"
}