{
 "id": "11132",
 "text": "Delaware ()Random House Dictionary is a state in the United States. It is sometimes called the First State because it was the first colony to accept the new constitution in 1787.About Delaware Its capital is Dover and its biggest city is Wilmington. It is the 2nd smallest state in the United States. Delaware is divided into three counties. The Dutch first settled Delaware. The Swedish then took over in the mid-1600s. ==Geography== Delaware is long and ranges from to across, totaling , making it the 2nd-smallest state in the United States after Rhode Island. Delaware is bounded to the north by Pennsylvania; to the east by the Delaware River, Delaware Bay, New Jersey and the Atlantic Ocean; and to the west and south by Maryland. ===Topography=== Delaware is on a flat plain, with the lowest mean elevation of any state in the nation. Its highest elevation, located at Ebright Azimuth, near Concord High School, is less than above sea level. ===Environment=== The transitional climate of Delaware supports a wide variety of vegetation. In the northern third of the state are found Northeastern coastal forests and mixed Oak forests typical of the northeastern United States. In the southern two-thirds of the state are found Middle Atlantic coastal forests. Trap Pond State Park, along with areas in other parts of Sussex County, for example, support the northernmost stands of bald cypress trees in North America. ===Environmental management=== Delaware provides government subsidy support for the clean-up of property \"lightly contaminated\" by hazardous waste. The money for this cleanup comes from a tax on wholesale petroleum sales. The first online page is archived; the page containing information related here is not in the archived version. ==Sister cities and states== Delaware's sister state in Japan is Miyagi Prefecture. ==Gallery== Image:Lewes Outer Harbor.JPG|Lewes Outer Harbor Image:Old Delaware State House 1.jpg|Old Delaware State House Image:Market Street, Wilmington DE.jpg|Market Street Wilmington, Delaware ==Related pages== * Colleges and universities in Delaware * List of counties in Delaware * List of numbered routes in Delaware * List of rivers of Delaware ==References== ==Other websites== * * Category:1787 establishments in the United States",
 "title": "Delaware"
}