{
 "id": "1113432",
 "text": "When an unstable atomic nucleus undergoes radioactive decay, it makes a decay product. This product is the remaining nuclide left over after the decay process. Decay often occurs in a order called a decay chain, where one nuclide changes into another through a series of steps. For example, uranium-238 decays to thorium-234, which further decays to protactinium-234m, and so on, until it reaches a stable isotope like lead-206. These decay products are crucial for understanding radioactivity and managing radioactive waste. == Nuclear Decay Probability == Radioactive decay is a process which depends upon the instability of the particular radioisotope, but which for any given nucleus in a sample is completely unpredictable. The decay process and the observed half-life dependence of radioactivity can be assumed by assuming that single nuclear decays are purely random events. == Developing the Decay Expression == Although radioactive decay involves specific events of nuclear disintegration, the number of events is so large that it can be treated like a continuum and the methods of calculus employed to predict the behavior. This can be integrated directly to give ln N = -λt + C where C is a constant of integration. == Radioactive Decay Constant == The rate of radioactive decay is typically shown in terms of either the radioactive half-life, or the radioactive decay constant. The decay constant is also sometimes called the disintegration constant. The half-life and the decay constant give the same information, so may be used to characterize decay. Another useful concept in radioactive decay is the average lifetime. The average lifetime is the reciprocal of the decay constant as defined here. For example, free neutrons decay with a halflife of about 10.3 minutes. This corresponds to a decay constant of .067/min and an average lifetime of 14.8 minutes or 890 seconds. == Radioactive Decay by Multiple Pathways == Often a radioactive nucleus will decay by two or more pathways, yielding different final products. If there are two modes, leading to products a and b, then we can represent the decay rates by these two modes by partial decay constants λa and λb.Note that the individual decay constants λa and λb never appear in the exponential. Both processes continue to proceed and the rate of decay is determined by the sum of their decay constants. This process can be extended to more pathways if all proceed from the same parent nucleus. If you sought to use the measured population of the isotopes to date a sample, you would not have access to the value N0 of the parent isotope and would need to recast the above expressions in terms of the current measured value N of the parent. This is the approach taken in potassium-argon dating where there are decay modes to both argon and calcium. == References == Category:Nuclear physics Category:Nuclear energy",
 "title": "Decay product"
}