{
 "id": "1113861",
 "text": "On April 5, 2024, at 10:23 EDT (14:23 UTC), a magnitude 4.8 earthquake happened in New Jersey, United States, with the epicenter in Tewksbury Township. It was felt in the New York City, Philadelphia, and Washington, D.C.. No big damage reported in New York and New Jersey. There were many aftershocks after the earthquake. It was the biggest earthquake to hit New Jersey since 1783, and the biggest to hit New York City since an 5.0 magnitude earthquake on 10 August 1884. == Tectonic setting == The fault that maked the earthquake is still not known, but it might be either the Ramapo Fault, or the Flemington Fault in New Jersey. These faults formed a long time ago and could still makes earthquakes today. The Whitehouse Station, New Jersey area had previously an earthquake on 14 March 2024. == Earthquake == The earthquake had a magnitude of 4.8 and a depth of . Its epicenter was in Tewksbury Township, New Jersey. Peoples were felt all across the Northeastern United States from Maine in the north to Washington, D.C., and Norfolk, Virginia, in the south. As of 1 May, over 159 aftershocks happened, the strongest of which had a magnitude of 3.7 and took place about from Gladstone around 17:59 EDT. == Impact == Many buildings in New York City, Philadelphia, and Long Island were shaken. The USGS said that the earthquake was felt by about 42 million people. The earthquake happened, while the Security Council was meeting at the United Nations Headquarters. During a performance at the New York Philharmonic, cell phones went off with an alert about the earthquake at 11:02 EDT, which was sent about 40 minutes after the earthquakes were felt. Gas leaks happened in Rockland County, New York, and an administrative building in Morristown, New Jersey. In Huntington, New York, a vehicle was damaged after falling into a sinkhole shortly after the earthquake. Four three-story houses on Seventh Avenue in Newark, New Jersey, were damaged by the earthquake. Twenty-eight peoples were evacuated, but no injuries were reported. Three of the houses were very damaged. The upper portion of the 264-year old Col. John Taylor's Grist Mill collapsed into a road. The earthquake is also maked water main breaks in Essex County and Morris County. == Aftermath == The government said that it would help if needed. Flights stopped at Newark, Philadelphia, and JFK airports. Flights into Baltimore/Washington, LaGuardia, and Teterboro were delayed. The control tower at Newark was evacuated. Some government buildings closed. Five flights were sent to Lehigh Valley Airport. The first alert to NYC peoples came 26 minutes after the earthquake. A wider alert came even later, 40 minutes after. Officials defended the delay, saying they needed time to confirm the earthquake. PATCO Speedline stopped for checks as a precaution. Amtrak slowed down for inspections in the Northeast. NJ Transit trains delayed for up to 20 minutes for track checks. AirTrain Newark closed for inspection but flights continued. The Holland Tunnel closed for inspection from 11:00 to 11:15 EDT. The Lincoln Tunnel also closed, causing traffic in Weehawken. After the earthquake, a custom T-shirt shop in Manhattan began printing a joke reading \"I survived the NYC earthquake April 5, 2024\". The store put it on the shop window, a pedestrian took a photo of it, was shared on social media, and sold hundreds of shirts. == Related pages == * List of earthquakes * 2011 Virginia earthquake == References == Category:2024 earthquakes Category:April 2024 events Category:2020s in New Jersey Category:2024 disasters in the United States",
 "title": "2024 New Jersey earthquake"
}