{
 "id": "1113117",
 "text": "The Costa Rica national under-17 team represents Costa Rica in youth international football team. They have appeared at the FIFA U-17 World Cup 10 times with their best placing quarter-final four times. == FIFA U-17 World Cup record == ===FIFA U-17 World Cup record=== Year Round GP W D* L GS GA 1985 Group stage 3 0 0 3 1 9 1987 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1989 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1991 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1993 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1995 Group stage 3 1 0 2 2 5 1997 Group stage 3 0 0 3 1 6 1999 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2001 Quarter- finals 4 2 0 2 5 4 2003 Quarter-finals 4 1 1 2 3 5 2005 Quarter-finals 4 1 2 1 5 5 2007 Round of 16 4 1 1 2 3 4 2009 Group stage 3 0 1 2 3 9 2011 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2013 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2015 Quarter-finals 5 1 2 2 4 5 2017 Group stage 3 0 1 2 3 7 2019 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2023 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2025 to be determined to be determined to be determined to be determined to be determined to be determined to be determined Total 10/20 36 7 8 21 30 59 :* Denotes draws include knockout matches decided on penalty kicks. == CONCACAF U-17 Championship record == ===CONCACAF U-17 Championship record=== * 1983: Did not enter * 1985: Runners-up * 1987: Third place * 1988: First stage * 1991: Did not enter * 1992: First stage * 1994: Champions * 1996: Third place * 1999: Third place Group A * 2001: First place Group B * 2003: First place Group B * 2005: Second place Group A (won qualifying playoff)• * 2007: Second place Group B * 2009: Second place Group B (tournament interrupted) * 2011: Quarter- finals * 2013: Group stage * 2015: Final stage - Won qualifying playoff * 2017: Classification stage - Second place Group E * 2019: Quarter-finals * 2023: Round of 16 * From 1983 until 1991, competition was U-16, not U-17 * In 2009 the tournament was interrupted due to the swine flu, but Costa Rica obtained a spot for the U-17 World Cup. •Tournaments from 1999 to 2007 followed a two group format. No championship game took place and no standings were given. The top teams in their respective groups qualified and the second placed teams played in a playoff to decide the final seed. ==References== Category:National under-17 football teams Category:Football in Costa Rica Category:National sports teams of Costa Rica",
 "title": "Costa Rica national under-17 football team"
}