{
 "id": "1113123",
 "text": "Hendrika Maria \"Henriette\" Vandaelen (born 9 December 1898) was a Belgian track and field athlete, being active during the 1920s. She was specialized in middle-distance running and cross country running and also competed in other events. She also played football.Register of the civil status of Brussels, birth certificate 4595, 12 December 1898 Vandaelen was five times national champion, was Belgian record holder in multiple events and represented Belgium internationally. As a footballer she also became national champion with Atalante. ==Sports career== Vandaelen was a member of Brussels Femina Club en Olympic Femina Club Sint-Gillis. She later moved to Atalante. At this club she also played football as a goalkeeper. Vandaelen started her sports career as a gymnast. As an athletics competitor she competed at the first women's Belgian Athletics Championships in 1921. At these championships she finished second in the 80 metres event, third in the high jump and second in cross country running. That year she also was the first Belgian record holder in the high jump with 1.26 meter and in the discus throw. The next year she also broke the Belgian record in the long jump to 3.83 meter. At the 1922 Belgian Athletics Championships she became the first Belgian champion in the discus throw and 83 metres hurdles.100 jaar Belgische atletiek, KBAB, 1989 Vandaelen became a 83 metres hurdles specialist and became in total four times national champion between 1922 and 1926 and won the silver medal in 1925. At the 1922 national championships she set the Belgian record in the 83 metres hurdles to 14.0 seconds and later improved the record to 13.8 seconds.100 jaar Belgische atletiek, KBAB, 1989 Vandaelen represented Belgium at the 1922 Brussels international women's athletics competitions, the earliest Belgian women’s athletics competition in Brussels in August 1922. She finished fourth in the 80 m hurdles event behind the British Hilda Hatt and two French Laloz sister. At this meeting the finished second in the discus throw behind Belgian Alice De Pauw. Vandaelen was selected to represent Belgium at the 1924 Women's Olympiad in London for the 120 yards hurdles event. She also competed outside of competition during the 1924 France–Czechoslovakia women's athletics competition in Paris. In 1925 she competed in at the 1925 Brussels international women's athletics competitions and finished second in the 83 metres hurdles behind British Hilda Hatt. As a football player she became Belgian national champion with Atalante in 1928. ==References== Category:1898 births Category:Year of birth missing Category:Belgian sprinters Category:Hurdlers Category:Belgian discus throwers Category:Belgian footballers Category:Sportspeople from Brussels",
 "title": "Henriette Vandaelen"
}