{
 "id": "1113298",
 "text": "Sukhpal Singh Gill is an academic from the UK who was born in India. Presently, he is an Assistant Professor of Cloud Computing at the Queen Mary University of London. == Leadership == * He is leading IGI Global International Journal of Applied Evolutionary Computation (IJAEC) as an Editor-in-Chief. * He is serving in various editorial positions such as an Area Editor for Springer Cluster Computing Journal, also serving as an Associate Editor in IEEE Internet of Things (IoT) Journal, Nature Scientific Reports, Elsevier IoT Journal, Wiley Transactions on Emerging Telecommunications Technologies (ETT) Journal, IET Networks Journal and Elsevier Telematics and Informatics Reports Journal. == Research Advancements == *He led the development of various innovative tools and simulators for the advancement of cloud, fog and edge computing research, including ThermoSim toolkit Sukhpal Singh Gill, Shreshth Tuli, Adel Nadjaran Toosi, Felix Cuadrado, Peter Garraghan, Rami Bahsoon, Hanan Lutfiyya, Rizos Sakellariou, Omer Rana, Schahram Dustdar, and Rajkumar Buyya, ThermoSim: Deep Learning based Framework for Modeling and Simulation of Thermal-aware Resource Management for Cloud Computing Environments, Journal of Systems and Software (JSS), Volume 166, Pages: 1–20, , Elsevier Press, Amsterdam, The Netherlands, August 2020. which is an extension of the CloudSim toolkit that incorporates thermal properties and employs a temperature prediction based on deep learning for cloud servers and EdgeAISim for the simulation of edge Artificial Intelligence (AI) computing environments, CloudAISim for the simulation of AI based cloud computing environments, iFaaSBus, for the simulation of security and privacy based serverless computing environments and HealthFog for AI based fog computing environments. * Under his leadership, various real testbeds are developed such as CloudAIBus testbedSasidharan Velu, Sukhpal Singh Gill, Subramaniam Subramanian Murugesan, Huaming Wu, Xingwang Li. CloudAIBus: A Testbed for AI based Cloud Computing Environments. Springer Cluster Computing, 2024 for AI based cloud computing environments, EdgeBus testbed for AI based edge computing environments and CAPTAIN testbed for AI based serverless cloud computing environments, released all these testbeds as available open source for public use. * He has authored a research book titled \"Applications of AI for Interdisciplinary Research” published by CRC Press, Taylor & Francis Group and edited research books in hotpot areas of Computer Science such as Serverless computing, Quantum and Blockchain, Automatic Vehicles and Quantum Drones. == Awards and Honours == * He was a recipient of several awards, including Outstanding Reviewer Award from IEEE IT Professional Magazine 2024, Elsevier Internet of Things Editor’s Choice Award 2024, the Queen Mary University Education Excellence Award 2023, Elsevier Best Paper Award 2023, Distinguished Reviewer Award from Journal of Software: Practice and Experience (Wiley), 2018 and Best Paper Award Australasian Symposium on Parallel and Distributed Computing (AusPDC) at Australasian Computer Science Week (ACSW) 2021. * His scientific work was one of the significant items that were published in the field of computing in 2016, and it was chosen to be included in the 21st annual Best of Computing Notable Books and Articles list by the Association for Computing Machinery (ACM). == International Recognition == * ScholarGPS recognized him as a Top Scholar-Lifetime, placing him within the top 0.05% of all scholars worldwide for the year 2023 and 2024 for cloud computing research, ranked him 3rd as a \"Highly Ranked Scholar for Prior Five Years\" and 20th as a \"Highly Ranked Scholar for Lifetime\" in January 2025 and ranked him in the top 20 for the previous five years in August 2024. * His name is included on the listing of the World's Top 2% of Scientists that is compiled and published by Stanford University and Elsevier BV in the year 2022, 2023. and 2024. == Media == * He has been invited for discussion on future of computing biology and his views on this emerging topic has been published by Ars Technica in the article title “Is the future of computing biological?”. * He has been interviewed by Tech Monitor (part of London-based New Statesman Media Group) for an article on “How Green is Your Cloud?” along with other experts from Gartner, Google Cloud and Microsoft Azure Group. * He led the research where the team developed a framework called HealthFaaS for early detection of cardiac disease that can be achieved by the integration of AI, IoT and cloud computing, which received attention within academia and in the private sector and was featured in the international media: IEEE Spectrum, ACM Tech News, and Edge Impulse. == Fellow == * He is a Fellow of the Higher Education Academy (FHEA) and had the honour of serving as an Inspire Fellow with the Department of Science and Technology (India). == UPSC Aspirant == * He was Union Public Service Commission (UPSC) aspirant and appeared for Civil Services Exams. == British Sikh Awards Nomination == He has been nominated as one of the finalists for the 3rd British Sikh Awards 2024 under the Services to Education category, announced by Oceanic Consulting, powered by Oceanic Awards on 23rd Jul 2024. ==References== ==Other websites== Category:Living people Category:Year of birth missing (living people) Category:British computer scientists Category:Indian people",
 "title": "Sukhpal Singh Gill"
}