{
 "id": "1113880",
 "text": "The Thailand national futsal team represents Thailand in international futsal. They have qualified for the FIFA Futsal World Cup since 2000 including hosting the 2012 FIFA Futsal World Cup on their home soil. ==Competitive record== *Denotes draws includes knockout matches decided on penalty shootouts. Red border indicates that the tournament was hosted on home soil. Gold, silver, bronze backgrounds indicates 1st, 2nd and 3rd finishes respectively. Bold text indicates best finish in tournament. ===FIFA Futsal World Cup=== Year Round Pld W D* L GS GA 1989 did not enter did not enter did not enter did not enter did not enter did not enter did not enter 1992 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 1996 did not enter did not enter did not enter did not enter did not enter did not enter did not enter 2000 Round 1 3 0 0 3 2 17 2004 Round 1 3 1 0 2 5 13 2008 Round 1 4 1 0 3 7 15 2012 Round of 16 4 1 0 3 9 16 2016 Round of 16 4 2 0 2 22 25 2021 Round of 16 4 1 1 2 11 16 2024 Qualified Qualified Qualified Qualified Qualified Qualified Qualified Total 6/10 22 6 1 15 56 102 ===AFC Futsal Asian Cup=== Year Round Pld W D* L GS GA 1999 Round 1 4 2 0 2 43 22 2000 Third place 5 3 0 2 29 23 2001 Quarterfinals 4 2 0 2 24 14 2002 Third place 7 6 0 1 42 15 2003 Third place 6 5 0 1 23 7 2004 Third place 6 4 1 1 49 14 2005 Round 2 6 3 2 1 57 12 2006 Round 1 3 2 0 1 19 11 2007 Quarterfinals 4 2 0 2 23 16 2008 Runners-up 6 5 0 1 27 10 2010 Quarterfinals 4 3 0 1 21 16 2012 Runners-up 6 5 0 1 22 16 2014 Quarterfinals 4 2 1 1 17 9 2016 Third place 6 5 1 0 31 10 2018 Quarterfinals 4 2 0 2 16 16 2020 Cancelled due to COVID-19 pandemic Cancelled due to COVID-19 pandemic Cancelled due to COVID-19 pandemic Cancelled due to COVID-19 pandemic Cancelled due to COVID-19 pandemic Cancelled due to COVID-19 pandemic Cancelled due to COVID-19 pandemic 2022 Fourth place 6 3 1 2 16 20 2024 Runners-up 6 4 1 1 17 11 Total 17/17 87 58 7 22 476 242 ===Asian Indoor and Martial Arts Games=== Year Round Pld W D* L GS GA 2005 Runners-up 4 3 0 1 24 6 2007 Runners-up 6 5 0 1 48 14 2009 Runners-up 5 4 1 0 23 12 2013 Third place 5 4 0 1 53 16 2017 Quarterfinals 3 1 0 2 13 18 2023 TBD TBD TBD TBD TBD TBD TBD 2025 TBD TBD TBD TBD TBD TBD TBD Total 5/5 23 17 1 5 161 66 ===AFF Futsal Championship=== Year Round Pld W D* L GS GA 2001 Champions 5 5 0 0 62 5 2003 Champions 6 6 0 0 53 11 2005 Champions 6 6 0 0 47 4 2006 Champions 4 4 0 0 59 7 2007 Champions 5 5 0 0 57 7 2008 Champions 5 4 0 1 22 10 2009 Champions 5 5 0 0 38 14 2010 did not enter did not enter did not enter did not enter did not enter did not enter did not enter 2012 Champions 6 6 0 0 94 9 2013 Champions 6 6 0 0 48 9 2014 Champions 6 5 0 1 39 8 2015 Champions 6 6 0 0 53 8 2016 Champions 4 4 0 0 41 8 2017 Champions 5 5 0 0 49 11 2018 Champions 5 5 0 0 42 5 2019 Champions 5 5 0 0 40 1 2020 Cancelled Cancelled Cancelled Cancelled Cancelled Cancelled Cancelled 2021 Cancelled Cancelled Cancelled Cancelled Cancelled Cancelled Cancelled 2022 Champions 6 4 2 0 40 7 Total 16/19 85 81 2 2 733 124 : : ===Southeast Asian Games=== Year Round Pld W D* L GS GA 2007 Champions 5 5 0 0 50 6 2009 No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host 2011 Champions 4 4 0 0 42 8 2013 Champions 4 4 0 0 32 5 2015 No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host 2017 Champions 4 3 0 1 20 10 2019 No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host 2021 Champions 4 3 1 0 11 4 2023 No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host No competition as not officially selected by host Total 5/5 21 19 1 1 155 33 ===Thailand Friendly Cup=== Year Rank M W D L GF GA Ref 2003 - 0 0 0 0 0 0 2004 - 0 0 0 0 0 0 2008 2nd 3 2 1 0 12 5 2010 - 0 0 0 0 0 0 2016 - 0 0 0 0 0 0 2017 - 0 0 0 0 0 0 2018 - 0 0 0 0 0 0 2019 - 0 0 0 0 0 0 2020-1 - 0 0 0 0 0 0 2020-2 - 0 0 0 0 0 0 2021 - 0 0 0 0 0 0 2022-1 - 0 0 0 0 0 0 2022-1 - 0 0 0 0 0 0 2023-1 - 0 0 0 0 0 0 2023-2 - 0 0 0 0 0 0 Total 15/15 0 0 0 0 0 0 - ==World ranking== There is currently official FIFA futsal world ranking. , the top 8 AFC teams are: AFF AFC FIFA Nation Points 1 6 1469 1 2 9 1316 3 11 1288 4 15 1248 2 5 28 1142 6 30 1138 3 7 33 1117 8 34 1116 ==References== Category:Asian national futsal teams Category:National sports teams of Thailand",
 "title": "Thailand national futsal team"
}