{
 "id": "1113408",
 "text": "The Singapore freshwater crab (Johora singaporensis) is a critically endangered species of freshwater crab. It is unique to Singapore and not found anywhere else in the world. == Habitat == Its habitat is primarily freshwater streams, and it can be found in specific locations like Bukit Timah Nature Reserve, Bukit Batok, and Bukit Gombak. == Physical characteristics == # Size and shape: #* The Singapore Freshwater Crab is tiny, growing to about 30 millimeters (1.2 inches) wide. #* Its body shape is compact and flattened, well-suited for its freshwater habitat. # coloration: #* Their coloration varies, but they often have a mottled appearance. #* Shades of brown, green, and gray blend with their surroundings, providing camouflage. # Legs and claws: #* They have four pairs of walking legs that allow them to move along streambeds and rocks. #* Their claws, or chelae, are adapted for various functions: #** Feeding: They use their claws to grasp and manipulate food. #** Defense: When threatened, they can raise their claws in a defensive posture. #** Mating: During courtship, males use their claws to attract females. # Habitat adaptations: #* The Singapore Freshwater Crab has evolved specific adaptations for its freshwater environment. #* These include specialized behaviors related to feeding, shelter, and reproduction. # Life cycle: #* Like other crabs, they undergo metamorphosis from larvae to adults. #* Their life cycle involves moulting, where they shed their exoskeleton to grow. == Conservation efforts == Unfortunately, the population of the Singapore freshwater crab has declined in some areas due to stream acidification. To conserve this species, a collaborative research program between the National parks board (NParks) and the National University of Singapore (NUS) monitors and enhances its population. == Critical status == The Singapore freshwater crab is classified as critically endangered by the International Union for Conservation of Nature (IUCN). Efforts to protect its habitat and raise awareness are crucial for its survival. == References == Category:Crabs Category:Singapore Category:Endangered species",
 "title": "Singapore freshwater crab"
}