{
 "id": "1113475",
 "text": "Sam J. Estevez, known colloquially as Sam J. Sheen (born March 9, 2004) is an American media personality. She is known for her appearances on reality television, including on E!'s Denise Richards: It's Complicated and Bravo's The Real Housewives of Beverly Hills. == Early life == Sheen was born in Los Angeles, California on March 9, 2004, as the elder of two children to Charlie Sheen, an actor, and Denise Richards, an actress. Her younger sister is Lola. Her parents divorced when she was two years old. She has three paternal half- siblings; older sister, Cassandra Jade Estevez, and younger twin brothers, Bob and Max. She also has a maternal younger adoptive sister, Eloise Joni. Her paternal grandparents are Martin Sheen, an actor, and Janet Sheen, an actress. Her paternal uncles are Emilio Estevez and Ramon Estevez, and her paternal aunt is Renée Estevez. She is a member of the Estevez family by birth. Sheen dropped out of high school. == Career == Sheen made her debut as an actress on November 22, 2004, at the age of eight months old. She portrayed Lisa's daughter on the ninth episode in the second season (\"Yes, Monsignor\") of the CBS television sitcom Two and a Half Men. Charlie Harper, the show's main character, was portrayed by her father, and Lisa, Charlie's ex-girlfriend, was portrayed by her mother. Sheen appeared on the \"20 Cutest Celebrity Babies\" episode of VH1: All Access, which was broadcast in 2006. Sheen appeared on the E! reality television series Denise Richards: It's Complicated. The series ran between May 26, 2008 and July 26, 2009. Sheen appeared on the ninth and 10th season of the Bravo reality television series The Real Housewives of Beverly Hills in 2019 and 2020. Sheen started her OnlyFans career in June 2022. She is reported to make around US$80,000 per month from the social media platform. Sheen will appear on the E! reality television series Denise Richards & Her Wild Things. The series is set to air in 2025. == Personal life == Sheen resides in Los Angeles, California. == Filmography == Year Title Role Notes Ref. 2004 Two and a Half Men Lisa's daughter Episode: \"Yes, Monsignor\" 2006 VH1: All Access Herself Episode: \"20 Cutest Celebrity Babies\" 2008–2009 Denise Richards: It's Complicated 10 episodes 2019–2020 The Real Housewives of Beverly Hills 11 episodes 2025 Denise Richards & Her Wild Things In production == References == Category:2004 births Category:Living people",
 "title": "Sami Sheen"
}