{
 "id": "1113537",
 "text": "Ruby Gillman, Teenage Kraken is a 2023 American computer-animated directed by Kirk DeMicco. It is produced by DreamWorks Animation, distributed by Universal Pictures. It stars the voices of Lana Condor, Toni Collette, Annie Murphy, Colman Domingo, and Jane Fonda. == Plot == Fifteen-year-old Ruby Gilman lives with her family among the people in the coastal city of Oceanville. Her mother Agatha forbids her from going to the prom due to the fact that the event will take place on a ship in the ocean. Ruby initially decides not to go, but her friends Margot, Trevin, and Bliss convince her to invite her lover Connor. As she is about to do so, Connor accidentally falls into the water. Ruby dives and saves him, but due to contact with salt water, she turns into a kraken. Her mother finds out about this and pursues her, reuniting with her brother Bril along the way. They help her calm down and shrink to normal size. Enraged that Agatha was hiding these abilities from her, Ruby, with the help of Bril, runs off to see her grandmother, the Warrior Queen of the Seven Seas, who asks to be called Grand Maman. From her grandmother, she learns that she is the crown princess, as well as about mermaids and how her mother hunted them for ages. Ruby refuses the throne, although she likes the fact that she saw her grandmother. On the way home, she is caught by an elderly sailor, Gordon Grumbling, and nearly kills her. She is saved by Chelsea de la Mare, a new girl at school who turns out to be a mermaid. The next day, Ruby tries to return to normal life, but at this moment, a recording of her in the form of a kraken is actively distributed. She ends up skipping school with Chelsea, who talks about the trident and about her mother, Queen Nerissa, who was allegedly killed while trying to get it back. She asks Ruby to get it for the purpose of an alliance between the krakens and mermaids, and Ruby trains under her grandmother to become strong enough to take the trident. On graduation day, Ruby tells his mother about Chelsea. Upset by Ruby's friendship with the mermaid, Agatha forbids her to see her grandmother. Ruby escapes to get the trident for Chelsea. When she finally retrieves it, Chelsea reveals that she is actually Nerissa, grows to a monstrous size and throws stones at Ruby, and then sets out to destroy the city. Agatha and Grand Maman fight back, while Bril finds an angry Ruby. He encourages her, and she goes to the surface to stop Nerissa. Realizing that the trident can be destroyed, Ruby, Agatha, and Grand Maman work together to destroy it with their eye lasers, defeat Nerissa and shrink her to normal size, after which she is caught by Gordon. She reconciles with her friends and invites Connor to the ball, to which he agrees. After a while, everyone returns to their usual lives, Ruby and Connor become a couple, and Ruby herself becomes the protector of Oceanville. == Other websites == * * * * * * Category:2023 movies Category:2023 animated movies Category:DreamWorks Animation movies",
 "title": "Ruby Gillman, Teenage Kraken"
}