{
 "id": "1114370",
 "text": "Combined Joint Task Force – Operation Inherent Resolve (CJTF-OIR) is a multinational military coalition led by the United States. Its primary mission is to defeat the Islamic State of Iraq and Syria (ISIS), also known as Daesh. == Formation and purpose == CJTF-OIR was established in October 2014. At the time, ISIS was quickly gaining territory in Iraq and Syria. This posed a significant threat to regional stability and international security. CJTF-OIR was formed to defeat ISIS by conducting coordinated military operations, supporting local forces, and making efforts to stabilize liberated areas. == Member nations == The coalition includes a broad range of nations from different regions, reflecting a global commitment to countering ISIS. As of recent updates, there are around 83 members, including NATO allies and other international partners. == Operations == CJTF-OIR has used various methods to fight ISIS, including: * Conducting airstrikes and military ground operations * Sharing military intelligence * Rebuilding infrastructure and restoring essential services in areas reclaimed from ISIS to ensure long-term stability * Training, equipping, and advising local military forces (like the Iraqi Security Forces, Kurdish Peshmerga, and Syrian Democratic Forces), with the goal of empowering them to secure and stabilize their own territories * Providing humanitarian aid == Achievements == CJTF-OIR has significantly reduced ISIS-controlled territories. The coalition retook control of several major urban centers, including Mosul in Iraq and the Raqqa Governorate in Syria. The coalition has also succeeded in killing numerous ISIS leaders, disrupting their financial networks, and destroying key facilities used for propaganda and recruiting new members. == Challenges == Despite these successes, ISIS remains a threat through its insurgency tactics, sleeper cells, and influence in various regions. The situation in Iraq and Syria remains complex, with ongoing conflicts and political instability posing challenges to long-term peace and reconstruction. == Current status == CJTF- OIR continues to support local forces and work towards defeating ISIS. The coalition is an example of international cooperation in counterterrorism efforts. It combines military action with stabilization and support for local governance in order to address both the symptoms and root causes of extremism in the region. == References == Category:Islamic State",
 "title": "Combined Joint Task Force – Operation Inherent Resolve"
}