{
 "id": "1114593",
 "text": "Shivaji Rao Gaikwad , credited as Rajinikanth is an Indian actor, producer and director who works usually in Tamil language movies alongside few Telugu language, Hindi language, Malayalam language and Kannada language movies. In his career of 50 years, he has worked in 170 films. He is also known as one of the most successful actors of Indian Cinema up to now.Ratda, Khushboo (24 August 2022) \"47 Years of Rajinikanth: An Inspiring from Rags-to-Riches Story of a Superstar.\" PinkVilla.com. Retrieved 28 June 2023.Rajinikanth's Journey from Being a Conductor to Becoming Demi-God\" (23 May 2014). The Indian Express. Retrieved 6 July 2023. ==Biography== ===Born=== Rajinikanth was born as Shivaji Rao Gaikwad on 12 December, 1950 in a Marathi Hindu family in Bangalore, Mysore State (present day Karnataka). His mother was a homemaker, and his father Ramoji Rao Gaekwad was a police constable. ===Education=== Rajinikanth had his primary education at the Gavipuram Government Kannada Model Primary School in Bangalore. As a child, he was \"studious and mischievous\" with a great interest in cricket, football and basketball. During this time, his brother enrolled him at the Ramakrishna Math, a Hindu monastery set up by the Ramakrishna Mission. In the math, he was taught Vedas, tradition and history, which eventually instilled a sense of spirituality in him. ===Relationships=== While he was working as a bus conductor in Bangalore, Rajinikanth met a medical student named Nirmala and started a relationship. After seeing him perform in a stage play, she encouraged him to pursue an acting career and sent an application to the Adyar Film Institute on his behalf and unbeknownst to him. Although he took up the offer and proceeded with his acting career, Rajinikanth has since lost contact with her. ===Family=== Rajinikanth married Latha Rangachari, a student of Ethiraj College for Women who interviewed him for her college magazine. The marriage took place on 26 February 1981, in Tirupati, Andhra Pradesh. The couple has two daughters: Aishwarya and Soundarya. He has four grandchildren through his daughters. ==Awards and nominations== He has won many awards including, one National Film Award, seven Tamil Nadu State Film Awards, one Nandi Award and one Filmfare Award. Rajinikanth was also named one of the most influential persons in South Asia by Asiaweek' He was also named by Forbes India as the most influential Indian of the year 2010. ==Movies== The Indian actor Rajinikanth has appeared in 170 films that includes two films which grossed over 600 crore. Similarly, he works in Tamil language films as the main, alongside six more languages’ films in his career. Rajinikanth is gearing up to delight his devoted fans with his upcoming movies in 2024: \"Vettaiyan,\" \"Coolie,\" and the eagerly awaited action-thriller \"Jailer 2\". ==Note== ==Reference== ==Other websites == * * * Category:1950 births Category:Living people",
 "title": "Rajinikanth"
}