{
 "id": "1114306",
 "text": "Roger Courtney was a British military officer. == Early life and education == Roger James Bower Courtney was born on December 19, 1907, in Belfast, Ireland. His early education was completed at the Royal Belfast Academical Institution, where he had a huge interest in outdoor activities and physical fitness. This foundation would later prove useful in his military career. == Military career == Courtney joined the British Army in the late 1920s and was initially commissioned into the Royal Tank Regiment. His early military career was marked by a series of assignments that highlighted his leadership abilities and innovative thinking. However, it was his involvement in the development of unconventional warfare tactics during World War II that brought him significant recognition. === Special Boat Section === In 1940, with the onset of World War II, Courtney proposed the idea of a small, elite force capable of carrying out reconnaissance and sabotage missions behind enemy lines. His vision led to the formation of the Special Boat Section (SBS), an elite unit within the Royal Marines. Previously composed of volunteers, the SBS conducted clandestine operations, often using kayaks to infiltrate enemy-held territory. Courtney's leadership and daring were exemplified in numerous operations, including The raid on the island of Kastellorizo in 1941. This operation, aimed at disrupting Axis communications in the Aegean Sea, showcased the effectiveness of small, specialized units operating with speed and stealth. Courtney's innovative tactics and the success of these missions established the SBS as a crucial component of British special operations. === Post-war contributions === After World War II, Courtney continued to serve in various capacities within the British military, focusing on training and the development of special forces doctrine. He was instrumental in the post-war restructuring of British special operations, ensuring that the lessons learned during the war were integrated into future military planning. == Retirement and later life == Courtney retired from active service in the early 1950s but remained a respected figure in military circles. He authored several works on military tactics and special operations, sharing his extensive knowledge and experience with future generations of soldiers. His contributions to the development of special forces were formally recognized when he was appointed an Officer of the Order of the British Empire (OBE). == Death and legacy == Courtney passed away on February 1, 1964, but his influence endures through the ongoing operations and successes of the SBS. His innovative approach to warfare and his commitment to excellence in special operations have set his place as a key figure in the history of British military strategy. Roger Courtney's pioneering work in unconventional warfare has left a lasting legacy in military history. The Special Boat Service, as it is known today, continues to operate as one of the United Kingdom's premier special forces units, carrying forward the principles and tactics first developed by Courtney. ==References== * \"Courtney, Roger James Bower.\" Oxford Dictionary of National Biography. * Churchill, Winston S. Their Finest Hour. Houghton Mifflin, 1949. * Thompson, Leroy. The SBS in World War II: An Illustrated History. Pen and Sword Books, 2013. ==Other websites== * Imperial War Museums * National Army Museum Category:World War II people Category:British military people Category:1907 births",
 "title": "Roger Courtney"
}