{
 "id": "1114432",
 "text": "A N95 is a type of respirator. A respirator is a type of mask that protects people from dust that makes them sick, like viruses or wildfire smoke. (But only if there is no risk of dying fast. The risk of dying fast is called \"immediately dangerous to life or health\" (IDLH).) N95s do not stop gases, poison gases, or vapors. In the United States, it is against the rule of law to sell things that are not masks with the words 'N95'. Also, N95 masks that are not checked by NIOSH should not be sold. If you buy a N95, NIOSH should have checked your N95. NIOSH checks N95s to make sure the N95s work. The NIOSH CEL lists the N95s NIOSH has checked. A N95 always has the word 'NIOSH' on it. But some N95s that are not real have it too. == How to wear a N95 == OSHA says people wearing N95s who are not at risk of dying fast or being injured while it is worn (under \"IDLH\") should read Appendix D of 1910.134. The air should also be more than 19.5% oxygen, which is said by NIOSH in \"cautions and limitations\". * Look for two head bands. Head bands look like strings. * Hold the N95, letters right way up and out, on your mouth and nose. * Keep the N95 still. ** Pull the bottom head band over your head. ** Place the bottom head band behind your head, below your ears. *** Pull the top head band over your head. *** Place the top head band behind your head, above your ears. == N95s that are not real == Some N95s say they are N95s, but are not. These are not checked by NIOSH. NIOSH only checks N95s that have the words 'TC-84A' with four numbers at the end. The words on the N95 are always on the CEL list. NIOSH has never checked a N95 that... * ...goes on the ears. * ...has one head band. * ...has the words 'KN95', or 'GB2626' The list of rules NIOSH uses to check N95s is called '42 CFR 84', not 'GB2626'. == Beards == For men, some beards may up the amount of air that goes by the N95. To keep the face seal, NIOSH has a beard guide for all N95 users. See the picture for the guide. ==Short history== In 1992, the CDC and the Labor Coalition to Fight TB in the Workplace were both worried about tuberculosis, a bacteria, making people sick in hospitals. People were in hospitals to get better from the HIV virus that made people's immune systems weak. This then made room for tuberculosis to infect them. People sick were both medical doctors and the public. Some doctors not sick with HIV were also sick with tuberculosis. This was likely from evolving tuberculosis. Medicine may not work with evolving tuberculosis. Before the N95 rules were done being made in 1995, the rules NIOSH used to check respirator masks were called '30 CFR 11'. The Mine Safety and Health Administration (MSHA) also checked respirator masks. They both said only HEPA masks could be used safely with tuberculosis. This cost too much money, so NIOSH made new '42 CFR 84' rules quickly. All '42 CFR 84' rules pass tuberculosis checks. This means N95s can be used safely with tuberculosis. === SARS and COVID-19 === Scientific papers have shown that N95s can be used safely with SARS. While SARS was around, doctors not using N95s got sick. Other scientific papers compared N95s with surgical masks by randomized control trial. But one scientific paper said that those randomized control trials were not done well, as you should not compare N95s with surgical masks if people are getting sick outside the hospital. The hospital is where people getting sick are counted or measured, but outside the hospital, people are not using N95s. People not using N95s, outside the hospital, are not counted or measured. Badly done scientific papers made people have problems finding real information on N95s during the COVID-19 pandemic. ==Other websites== * NIOSH CEL - Use this list to make sure your N95 is real ==References== ==Related pages== *Fume hood *Gas mask *Respirator *Self-contained breathing apparatus Category:Protective clothing Category:Headgear Equipment",
 "title": "N95"
}