{
 "id": "1114539",
 "text": "Carlton Wayne Lowe (born July 26, 1957), known professionally as Lucky Lowe, is an American water skier and skiing instructor. He won the Masters Water Ski Tournament in 1972 and the Water Ski World Championships in 1991. He is known as the owner of Lucky Lowe Ski School in Lake Alfred, Florida. == Early life == Carlton Wayne Lowe was born in Birmingham, Alabama on July 25, 1957, as the only child to C.W. Lowe, a professional water skier, and Carole Lowe (née Woods), a businesswoman. His nickname, Lucky, was given to him at birth. Lowe attended the University of Alabama. == Career == Lowe began water skiing at the age of six. He completed his first Water Ski World Championships tournament in 1964. He spent most of his time fishing, but still qualified for his debut, the 1970 U.S. National Water Ski Championships. In 1973, his first year in Boys, he began focusing on his goal, which was to win the Boys overall title, a feat he accomplished in 1974, when he won jumping with a distance of 125 feet. He won the overall title. He became both National Overall and Jump Champion by 1974. Lowe established himself as a contender for the U.S. Elite Water Ski Team at the 1977 US Water Ski Team Trials, when he jumped 170 feet, making the team as an alternate. A week later, he jumped 177 feet to finish fourth overall at the Nationals. He later said: \"I began to realize for the first time that I might be good enough to make the team, but my tricks and slalom left much to be desired.\" Lowe participated in the first World Games in 1981. Lowe increased his trick run by 6000 points, under the supervision of Jim McCormick. He, with McCormick as his coach, became a US Elite Waterski Team member. He went on to take World Championships medals in 1985, 1989, 1991, and 1993. Lowe was invited to ski in the 21st Masters Water Ski Tournament in 1978. He won the jumping event with a leap of 178 feet, two feet shy of the long existing world record. He competed in 14 Masters. He held the Robin Lake Course Jump Record of 191 feet from 1985 through 1989. Lowe was a U.S. Elite Water Ski Team member from 1979 through 1985. In 1979, he placed fifth in slalom at the Water Ski World Championships in Toronto, Canada, and was a silver medalist in men's jumping at the 1985 Water Ski World Championships in Toulouse, France, where he came close to winning the gold medal. Lowe founded Lucky Lowe Ski School, a ski school, in Lake Alfred, Florida, in 1989. Lowe, British-American Andy Mapple and Sweden's Michael Kjellander performed a slalom battle at the 1991 Water Ski World Championships in Villach, Austria. After a three-way tie, Lowe, being last out by draw, he become the oldest to win his first gold medal. Lowe returned as an independent in slalom to the 1993 Water Ski World Championships in Singapore. He earned the bronze medal. Lowe - speaking on the Water Ski National Championship - said: \"I have skied in more than 40 Nationals and can truly say that skiing in the Nationals was always more rewarding to me than any Pro Tour event that I competed in.\" Lowe has coached Collegiate Teams throughout the United States. Lowe competed in the Masters Men slalom in 2009. He was the defending Masters Men national slalom champion with a score of 2 buoys at 41 feet off. === Honors === Lowe was named Athlete of the Year by the USA Water Ski & Wake Sports in 1991. Lowe was inducted into the International Waterski & Wakeboard Federation's International Hall of Fame in 2009. He was honored in 2013. == Personal life == Lowe became a member of the American Water Ski Association (AWSA) in 1963, and a life member in 1979. Lowe was in a relationship with Lisa Vanderpump, an English actress, from 1978 to May 1982. Lowe was married to Leslie Renee Johnson. Their divorce was finalized on July 24, 1995.Florida, U.S., Divorce Index, 1927-2001: JUL 24, 1995 042492 POLK – Carlton Wayne Lowe = Leslie Lowe married Jennifer Lynn Parker (born May 3, 1968),Ohio, U.S., Birth Index, 1908-2003: MAY 3, 1968 1968055097 OHIO – Jennifer Lynn Parker in Polk, Florida on May 10, 1997.Florida, U.S., Marriage Indexes, 1822-1875 and 1927-2001: MAY 10, 1997 059992 POLK – Carlton Wayne Lowe = Jennifer Lynn Parker Their only child, a son, Chance, was born on September 11, 1998. The family reside in Lake Alfred, Florida. Lowe underwent hip replacement surgery in 2013. Travis B. Van Dyke, M.D., performed his operation. He said: \"The injury made it to where I had to almost stop skiing entirely, and it made me feel like I wasn't going to do much of anything for the rest of my life.\" == References == Category:1957 births Category:Living people",
 "title": "Lucky Lowe"
}