{
 "id": "1114081",
 "text": "University College Freiburg (UCF) is a college of the University of Freiburg, Germany. == Study == UCF offers a Liberal Arts and Sciences program. Its language instruction is English. UCF students are in a four-year bachelor program consisting of 240 ECTS credits. They graduate with either a Bachelor of Science or a Bachelor of Arts. == Campus == File:Bertoldstraße_17_(Freiburg_im_Breisgau)_jm61177.jpg|link=https://en.wikipedia.org/wiki/File:Bertoldstra%C3%9Fe_17_(Freiburg_im_Breisgau)_jm61177.jpg|alt=An old wooden door surrounded by a sandstone wall. A blue university of freiburg plaque is on the wall next to it, indicating it is a university building. The door appears accessible, though heavy to open.|Entrance to UCF File:Bertoldstraße_17_(Freiburg_im_Breisgau)_jm61167.jpg|link=https://en.wikipedia.org/wiki/File:Bertoldstra%C3%9Fe_17_(Freiburg_im_Breisgau)_jm61167.jpg|The Old University File:Mosaik_Uni.jpg|link=https://en.wikipedia.org/wiki/File:Mosaik_Uni.jpg|alt=A mosaic laid into stone. It is not visible, but it lays in front of the University Church. It displays the old crest of Albert Ludwig, the leader who instituted the University. It displays a two-headed eagle in dark stone with an austrain crest in the middle, surrounded by brown stones, surrounded by a ring of dark stone and white stone text.|Traditional Freiburg Mosaic in front of the University Church File:Rotteckring_mit_Haltestelle_und_Stadtbahn_in_Freiburg_mit_Stadttheater_und_Universitätsbibliothek.jpg|link=https://en.wikipedia.org/wiki/File:Rotteckring_mit_Haltestelle_und_Stadtbahn_in_Freiburg_mit_Stadttheater_und_Universit%C3%A4tsbibliothek.jpg|alt=A picture of a tram at night. The Freiburg University library is visible in the distance. In the foreground, a blurry person walking is visible. They walk on cobblestone. Streetlights are ablaze, and the tram also lights up the scene.|Stadttheater Tram Stop File:Freiburg_- _Universitätsbibliothek_Freiburg1.jpg|link=https://en.wikipedia.org/wiki/File:Freiburg_- _Universit%C3%A4tsbibliothek_Freiburg1.jpg|alt=Freiburg's futuristic and modern University Library. The building is made of large angular glass and metal panels, and is a stark contrast to the older buildings distantly present in the picture.|Freiburg University Library File:Freiburg_vom_Schlossberg_aus.jpg|link=https://en.wikipedia.org/wiki/File:Freiburg_vom_Schlossberg_aus.jpg|alt=A view of Freiburg's old city taken from a hill. There are lush green trees in the foreground. In the middle ground, the Freiburg Minister is visible, as are older buildings. There are buildings out to the horizon, but the entire scene is very calm.|Freiburg's Old City ==References== Category:Freiburg im Breisgau",
 "title": "University College Freiburg"
}