{
 "id": "1114334",
 "text": "The 1926 Women's World Games (Swedish: or French: ) were the second edition of the Women's World Games from 27 to 29 August 1926 in Gothenburg, Sweden. The games took place at the Slottsskogsvallen Stadium. 71 athletes from eight countries entered for the Games. The athletics competitions consisted of twelve events. The Games were organized by the Fédération Sportive Féminine Internationale under Alice Milliat as a response to the International Olympic Committee's decision not to include women's events in the 1924 Summer Olympics. The games attracted 20,000 spectators and saw several world records being set. ==Venue== The venue of the Games was the Slottsskogsvallen Stadium. The venue was inaugurated on 12 May 1923 by, at the time, crown prince Gustaf VI Adolf as part of the Gothenburg Exhibition. It was the first time a main international event was organized at this venue.Kronologiska anteckningar om viktigare händelser i Göteborg 1619-1982, Agne Rundqvist, Ralf Scander, Anders Bothén, Elof Lindälv, Göteborgs hembygdsförbund, 1982, p. 93 ==Schedule== On 26 July a schedule was published of the Games. The schedule includes the sports Czech handball (in other countries named Hazena). However no Czech handball results are known and it is likely that the sport was not played during the Games. ;27 August :100 yards :250 yards :High jump :Discus throw :Hazena ;28 August :100 yards hurdles :Shot put :Javelin throw :Long jump :Hazena ;29 August :60 metres :100 metres :Long jump :4 x 100 yards relay :Shot put :Javelin throw :Hazena ==Opening Ceremony== The Games started with an Olympic-style opening ceremony. The ceremony included a parade of nations where athletes marched into the stadium, delegation-by-delegation, with the flag carried by one of the athletes. The ceremony was attended by among others Gustaf V of Sweden. , wife of Prime Minister Oscar von Sydow, gave the opening speech. ==Participating nations== A total of 71 athletes from eight nations competed at the Games. However, there are sources stating 100 athletes from nine nations participated. On 26 July a list of nine nations was published including Yugoslavia that was later not mentioned anymore. On 29 August 1926 an entry list of 71 athletes from eight nations was published. However, while 16 athletes were listed for Sweden, only 13 were present on the group image.Women’s World Games 1926 Swedish team.jpg Five nations made their Women's World Games debut: Belgium, Japan, Latvia, Poland and Sweden. After the United States at the 1922 edition, Japan was the second country from outside Europe to participate at the Women's World Games and was the first Asian nation. * (4) * (9) * (19) * (1) * (7) * (11) * (details) (16) * (4) ==Medal summary== 60 m 7.8 7.8 7.8 100 yd 11.8 11.8 12.0 250 m 33.4 34.6 35.4 1000 m 3:08.8 3:09.4 3:10.4 100 yds hurdles 14.4 14.8 15.0 4×110 yds relay Dorothy Scouler Florence Haynes Eileen Edwards Rose Thompson 49.8 Yolande Plancke Marguerite Radideau 51.2 Marie Vidláková 52.8 1000 m track walk 5:10.0 5:12.4 High jump 1.50 m 1.45 m 1.45 m Long jump 5.50 m 5.44 m 5.28 m Standing long jump 2.49 m 2.47 m 2.37 m Discus throw 37.71 m 33.62 m 31.78 m 49.15 m 45.41 m 45.06 m Shot put (two hands) 19.54 m 19.42 m 19.25 m ==Other sports== ===Schleuderball=== Images of the Games showing athletes playing schleuderball (in Swedish called slungboll), including British Sophie Elliott-Lynn and Polish Halina Konopacka.Mrs Elliot- Lynn kastar slungbollKonopacka kastar slungboll However the results are unknown. ===Czech handball=== On 26 July a schedule was published of the Games including the sports Czech handball (in other countries named Hazena) as last event on all three the days. However no Czech handball results are known and unknown if the sport was played. ==Points table== Place Nation Points 1 50 2 27 3 20 4 19 5 15 6 7 7 1 Source: == References == == Other websites== * Picture of the Belgian team * Picture of the British team * Picture of the Czechoslovakian team * Film (SVT) from the 1926 Women's World Games * Film (British Pathé) 1926 Women's World Games * Mixed pictures from the 1926 Women's World Games Category:1926 in women's athletics Category:Sport in Gothenburg Category:1926 in Europe Category:International sports competitions",
 "title": "1926 Women's World Games"
}