{
 "id": "1114893",
 "text": "WWE Worlds Collide was a two-day professional wrestling show made by WWE. It took place at the Phoenix Convention Center in Phoenix, Arizona on January 26 and 27, 2019 at Royal Rumble Axxess and could be watched on the WWE Network on February 2, 2019. It happened after the Royal Rumble and before Halftime Heat. It was the first event in the WWE Worlds Collide chronology. The show had the 15-man Worlds Collide tournament which had five wrestlers each from NXT, NXT UK, and 205 Live. Velveteen Dream from NXT won the tournament and chose to face Johnny Gargano for the NXT North American Championship and won. ==Storylines== The matches were organized as part of stories where wrestlers played faces (heroes), heels (villains) or tweeners (somewhere in between). The winners of these matches were chosen by the writers of the stories from WWE. The winner of the tournament would receive a championship match of their choice for either the United Kingdom, North American, NXT, or Cruiserweight Championship (but he could only choose the Cruiserweight Championship if he weighed less than 205 pounds). On January 10, there was an announcement that there would be a 15-man Battle Royal at the show. The order that the wrestlers were eliminated in the battle royal was used to decide what the first round matches would be in the tournament. The winner of the battle royal would not have a first-round match. Instead, he would start in the second round. ==Participants== These are the wrestlers that competed in the tournament and when there was an announcement that he would be competing. Bright yellow means the wrestler was from NXT at that time, dark yellow means the wrestler was from NXT UK, and purple means the wrestler was from 205 Live. Wrestler Date Adam Cole January 10, 2019 Velveteen Dream Dominik Dijakovic Keith Lee Shane Thorne January 22, 2019 Mark Andrews January 10, 2019 Tyler Bate Travis Banks Jordan Devlin Zack Gibson Cedric Alexander January 10, 2019 Tony Nese Drew Gulak TJP Humberto Carrillo January 15, 2019 ==Event== === Night one === Fourteen matches happened on January 26. In the first, Flash Morgan Webster beat James Drake. It was a dark match (there is no video of the match). The second was the 15-man Battle Royal to decide the first round matches of the Worlds Collide tournament. Jordan Devlin won and got to start the tournament in the second round. The next seven matches were the first round matches of the Worlds Collide tournament. Drew Gulak beat Mark Andrews, Dominik Dijakovic beat TJP, Keith Lee beat Travis Banks, Humberto Carrillo beat Zack Gibson, Velveteen Dream beat Tony Nese, Adam Cole beat Shane Thorne, and Tyler Bate beat Cedric Alexander. The tenth match was a dark match where Walter beat Danny Burch. The last four matches were the quarterfinals of the Worlds Collide tournament. Jordan Devlin beat Drew Gulak, Velveteen Dream beat Humberto Carrillo, Adam Cole beat Keith Lee, and Tyler Bate beat Dominik Dijakovic. === Night two === Ten matches happened on January 27. The first two were dark matches where Candice LeRae beat Xia Li, and Fabian Aichner beat Ligero. The next two matches were the semifinals of the Worlds Collide tournament. Tyler Bate beat Adam Cole and Velveteen Dream beat Jordan Devlin. The next five matches were dark matches where Mia Yim and Taynara Conti beat Chelsea Green and Vanessa Borne, Trent Seven beat Gentleman Jack Gallagher, The Coffey Brothers (Joe Coffey and Mark Coffey) beat Mark Andrews and Flash Morgan Webster, Walter beat Kassius Ohno, and James Drake and Zack Gibson beat Danny Burch and Oney Lorcan. The last match was the Worlds Collide tournament final where Velveteen Dream beat Tyler Bate. ==References== Category:2019 in the United States Category:2010s in Phoenix Category:Professional wrestling Category:January 2019 events Category:WWE Category:2019 in American television Category:2019 in sports Category:Sports in Phoenix, Arizona",
 "title": "Worlds Collide (2019)"
}