{
 "id": "111466",
 "text": "John Edward Gray FRS (12 February 1800 – 7 March 1875) studied medicine in London, and became an English zoologist. Gray was Keeper of Zoology at the British Museum from 1840 until Christmas 1874. That was before the natural history holdings were split off to be the Natural History Museum. Gray published several catalogues of the museum collections which discussed animal groups and described new species. He improved the collections to make them amongst the best in the world. During his life he wrote over 500 academic papers, mostly on new species. Gray was also interested in postage stamps; on 1 May 1840, the day the Penny Black first went on sale, he bought some to keep, thus making him the world's first known stamp collector. == Works (partial list)== * 1825 : An outline of an attempt at the disposition of the Mammalia into tribes and families with a list of the genera apparently appertaining to each tribe. Annals of Philosophy (ns) 10 : 337-344. * 1826 : Vertebrata: Mammalia. (Appendix B in part). p. 412-415 in King P.P. (ed) Narrative of a survey of the intertropical and western coasts of Australia. Performed between the years 1818 and 1822. With an appendix, containing various subjects relating to hydrography and natural history. London: J. Murray, vol. 2. * 1827 : Synopsis of the species of the class Mammalia. p. 1-391 in Baron G. Cuvier The animal kingdom arranged in conformity with its organization, with additional descriptions by Edward Griffith and others. (16 vols: 1827-1835). London: George B. Whittaker, vol. 5. * 1828 : Spicilegia Zoologica, or original figures and short systematic descriptions of new and unfigured animals. Pt 1. London: Treuttel, Würtz & Co. * 1830 : A synopsis of the species of the class Reptilia. pp 1–110 in Griffith E. The animal kingdom arranged in conformity with its organisation by the Baron Cuvier. London: Whitaker and Treacher, vol. 9 : 481 + 110 p. * * 1845: Catalogue of the specimens of lizards in the collection of the British Museum. London: Trustees of the British Museum. * Petit, Richard E. 2012. John Edward Gray (1800–1875): his malacological publications and molluscan taxa. Zootaxa 3214: 1-125 == Further reading == * == Other websites == * * John Edward Gray, the Indian Pond Heron and Walsall Category:1800 births Category:1875 deaths Category:British zoologists Category:English science writers Category:Philatelists Category:Fellows of the Royal Society Category:British naturalists Category:British ornithologists Category:English biologists Category:English botanists",
 "title": "John Edward Gray"
}