{
 "id": "1114483",
 "text": "The Kangxi Emperor (4 May 1654 – 20 December 1722) was the fourth emperor of the Qing dynasty. He was the second Qing emperor to rule over China proper. His reign of 61 years makes him the longest-reigning Chinese emperor. Kangxi was also one of the longest-reigning rulers in history. He is considered one of China's greatest emperors. Kangxi was the third son of the Shunzhi Emperor. He was enthroned at the age of seven. After assuming personal rule, Kangxi's actions sparked the Revolt of the Three Feudatories. He suppressed the revolt. Kangxi also forced his neighbors to submit to Qing rule. He also launched an expedition that brought Tibet into the empire. Kangxi initially welcomed the Jesuits and Catholicism. This came to an end as a result of the Chinese Rites controversy. Later in his reign, Kangxi became involved in a prolonged succession dispute. Kangxi died in 1722 at the age of 68 and was followed by his fourth son. The Kangxi Emperor's reign brought stability and wealth after years of war and chaos. He started the period known as the High Qing era. This era lasted for several generations after his death. His court also produced important literary works: Kangxi Dictionary, the Complete Tang Poems poetry anthology, and the Complete Classics Collection of Ancient China. == Early reign == The Kangxi Emperor was born on May 4, 1654, in Jingren Palace, Beijing. He became emperor at age seven (or eight by East Asian age counting) on February 7, 1661. The era name \"Kangxi\" began on February 18, 1662, the first day of the new lunar year. Sinologist Herbert Giles described the Kangxi Emperor as \"fairly tall and well proportioned, he loved all manly exercises, and devoted three months annually to hunting. Large bright eyes lighted up his face, which was pitted with smallpox.\" Before Kangxi became Emperor, the Grand Empress Dowager Zhaosheng had appointed powerful men as regents. After Sonin died, these men clashed. One of these men, Oboi, took sole control as regent, with the Kangxi Emperor and the court accepting his rule. In the spring of 1662, the regents ordered a mass evacuation of southern China’s seacoast to deal with a resistance movement led by Koxinga, a Ming loyalist general based in Taiwan. In 1669, the Kangxi Emperor, with help from his grandmother Grand Empress Dowager Zhaosheng, who had raised him, had Oboi arrested and started taking control of the empire. He focused on three main issues: managing floods on the Yellow River, repairing the Grand Canal, and dealing with the Revolt of the Three Feudatories in southern China. He was greatly influenced by his grandmother and cared for her until her death in 1688. == Military achievements == === Army === Under the Kangxi Emperor, the Qing Empire's main army, the Eight Banners Army, was smaller than at its peak during Hong Taiji's and the early Shunzhi Emperor's reigns, but larger than during the Yongzheng and Qianlong emperors' times. Meanwhile, the Green Standard Army remained strong, led by notable generals like Tuhai, Fei Yanggu, Zhang Yong, Zhou Peigong, Shi Lang, Mu Zhan, Shun Shike, and Wang Jingbao. The decline happened because the Kangxi Emperor kept the old, strict military system, while the system changed during the Qianlong Emperor's reign. Under Kangxi, if a commander or foot soldier returned alone from a battle, they would be executed. This harsh rule was meant to encourage bravery, as there was no advantage to surviving a battle alone. By the Qianlong Emperor's reign, military commanders had worsened and the training of the army was deemed less important as compared to during the previous emperors' reigns. === Revolt of the Three Feudatories === After the Qing dynasty took over China in 1644, they gave large areas in the south and west to three Ming generals who had helped them: Wu Sangui, Geng Jingzhong, and Shang Zhixin. In 1673, Kangxi, against most advisors' advice, tried to make these generals give up their lands and move to Manchuria. This led to an eight-year rebellion. Kangxi later regretted his decisions and felt partly responsible for the loss of life during the conflict. Wu Sangui's troops took control of much of southwest China, and he sought alliances with local generals like Wang Fuchen. To put down the rebellion, the Kangxi Emperor sent generals such as Zhou Peigong and Tuhai, and he also showed mercy to common people affected by the conflict. Although he planned to lead the armies himself, his advisors dissuaded him. The Kangxi Emperor primarily used Han Chinese Green Standard Army soldiers, with the Manchu Banners playing a minor role. The Qing forces finally defeated the rebels in 1681. === Taiwan === In 1683, the Ming loyalist navy in Taiwan, led by the Zheng dynasty, was defeated by Qing Admiral Shi Lang's fleet at Penghu. Zheng Keshuang, Koxinga's grandson, surrendered Taiwan shortly after, and it became part of the Qing Empire. Zheng Keshuang moved to Beijing, became a Qing noble as the \"Duke Haicheng,\" and joined the Eight Banners military system. His troops, including the rattan-shield soldiers, also joined the Eight Banners and fought against Russian Cossacks at Albazin. Many Ming princes who had joined the Zheng dynasty in Taiwan were sent back to mainland China by the Qing. Among them, Prince Zhu Shugui of Ningjing and his five concubines chose to commit suicide rather than be captured. In 1683, Shi Lang used their palace as his headquarters but later recommended converting it into a Mazu temple to help quell any remaining resistance. The emperor agreed, and the temple was established as the Grand Matsu Temple the following year. Mazu was also promoted to \"Empress of Heaven\" in recognition of her perceived role in the Qing invasion. Mazu continues to be widely worshiped in Taiwan, with her annual celebrations drawing large crowds and sometimes being associated with Guanyin and the Virgin Mary. === Russia === In the 1650s, the Qing Empire and the Tsardom of Russia fought over the Amur River region, with the Qing eventually taking control after the Siege of Albazin. In the 1680s, Russia tried to invade again, leading to battles and negotiations that resulted in the Treaty of Nerchinsk in 1689, which established the border between Russia and China. === Mongolia === Ligdan Khan, a Chahar leader and descendant of Genghis Khan, fought against the Qing until he died of smallpox in 1634. After his death, his son Ejei Khan surrendered to the Qing and was made a prince. The Inner Mongolian nobility became closely connected to the Qing royal family and frequently intermarried with them. Ejei Khan died in 1661 and was succeeded by his brother Abunai. When Abunai showed discontent with Qing rule, he was placed under house arrest in 1669, and the Kangxi Emperor granted his title to his son Borni. n 1675, Abunai and his brother Lubuzung led a revolt against the Qing dynasty during the Revolt of the Three Feudatories. They were joined by 3,000 Chahar Mongols. The Qing quickly crushed the revolt, killing Abunai and his followers by April 20, 1675. The Qing abolished their titles, executed all Chahar Mongol royal males (even those born to Manchu princesses), and sold royal females into slavery, except for the Manchu princesses. The Chahar Mongols were then placed under direct Qing control, unlike other Inner Mongol groups which retained some autonomy. The Outer Khalkha Mongols were independent but paid tribute to the Qing Empire. A conflict between two Mongol factions over Tibetan Buddhism led to the Dzungars, led by Galdan Boshugtu Khan, invading Khalkha lands in 1688. The Khalkha royal families and the first Jebtsundamba Khutuktu fled to the Qing Empire for help and agreed to submit to Qing rule. In 1690, the Qing defeated the Dzungars in the Battle of Ulan Butung. In 1696 and 1697 the Kangxi Emperor personally led campaigns against the Dzungars in the early Dzungar–Qing War. The western section of the Qing army defeated Galdan's forces at the Battle of Jao Modo and Galdan died in the following year. === Manchu Hoifan and Ula rebellion against the Qing === In 1700, about 20,000 Xibe people from Qiqihar were moved to Guisui in what is now Inner Mongolia, and 36,000 Xibe from Songyuan were moved to Shenyang in Liaoning. Liliya M. Gorelova thinks this relocation was connected to the Qing Dynasty's destruction of the Manchu clan Hoifan in 1697 and the Manchu tribe Ula in 1703 after they rebelled. Both the Hoifan clan and the Ula tribe were completely wiped out. === Tibet === In 1701, the Kangxi Emperor commanded the reconquest of Kangding and other border towns in western Sichuan that the Tibetans had captured. The Manchu troops captured Dartsedo, securing the border with Tibet and the profitable tea-horse trade. In 1682, Sangye Gyatso, the Tibetan regent, hid the death of the 5th Dalai Lama and only told the emperor in 1697. He also maintained relations with the Dzungar enemies of the Qing Empire, which angered the Kangxi Emperor. In 1705, Sangye Gyatso was overthrown and killed by Lha-bzang Khan, who was then made Regent of Tibet by the Kangxi Emperor. In 1717, the Dzungars invaded Tibet, captured Lhasa, and killed Lha-bzang Khan. They controlled Lhasa for three years and defeated a Qing army in 1718. The Qing Empire retook Lhasa in 1720 after sending a larger force. === Muslims === The Kangxi Emperor stirred up anti-Muslim feelings among the Mongols in Qinghai to get their support against Galdan, the Dzungar Oirat Mongol leader. He falsely accused Galdan of converting to Islam and plotting with Chinese Muslims to take over China. Kangxi also distrusted Muslims from Turfan and Hami. === Chinese nobility === The Kangxi Emperor awarded the title of Wujing Boshi to the descendants of Shao Yong, Zhu Xi, Zhuansun Shi, the Ran family (Ran Qiu, Ran Geng, Ran Yong), Bu Shang, Yan Yan (a disciple of Confucius), and the Duke of Zhou's descendants. == References == Category:1650s births Category:1722 deaths Category:Emperors and Empresses of China",
 "title": "Kangxi Emperor"
}