{
 "id": "1114358",
 "text": "Ranitomeya is a group of frogs that live in Panama and South America. They are poison dart frogs. ==Taxonomy== In 2006, a group of amphibian scientists looked at the way scientists put frogs into groups. They changed some of the groups. They took some frogs that had been in the groups Dendrobates, Minyobates, and Phyllobates and put them in Ranitomeya instead. In 2011, another team of scientists made the group Andinobates for 12 frogs that had been in Ranitomeya. Ranitomeya and Andinobates frogs are different from frogs in Dendrobates: They are smaller, have more than two colors, and look like glitter. Ranitomeya frogs live in the Amazon basin, and Andinobates frogs live in the northern Andes mountains and in Central America. ==Body== Adult frogs are or smaller from nose to rear end and their skin is bright colors, for example bright yellow, red, or green on the back with stripes or dots. The throat also has color, usually yellow, orange or red. The head is narrower than the body. There are disks on the toes of all four feet for climbing. The disks on the front feet are larger than the disks on the back feet. Some species, for example R. Variabilis, have tadpoles that eat each other. ==Danger== Many Ranitomeya species could die out because human beings change the places where they live and catch them to sell as pets. == Species == There are 16 species of frog in the genus Ranitomeya: Image Scientific name Distribution Ranitomeya amazonica (Schulte, 1999) northeastern Amazonian Peru (Loreto Region, including the type locality) and extreme southeastern Colombia (Amazonas Department), and expected in the adjacent Brazil, Venezuela; extreme southern Guyana; eastern French Guiana; the mouth of the Amazon in Brazil Ranitomeya benedicta Brown, Twomey, Pepper, and Sanchez-Rodriguez, 2008 Ranitomeya cyanovittata Pérez-Peña, Chávez, Twomey, and Brown, 2010 Pampas del Sacramento in southern Loreto and eastern San Martín Region, northeastern Peru Ranitomeya defleri Twomey and Brown, 2009 southeastern Colombia Ranitomeya fantastica (Boulenger, 1884) eastern Sierra del Divisor, Loreto, Peru Ranitomeya flavovittata (Schulte, 1999) northern San Martín and Loreto Regions, Peru Ranitomeya imitator (Schulte, 1986) Loreto Region, Peru Ranitomeya reticulata (Boulenger, 1884) eastern Peru. Ranitomeya sirensis (Aichinger, 1991) Amazon rainforest in Peru and Ecuador. Ranitomeya summersi Brown, Twomey, Pepper, and Sanchez-Rodriguez, 2008 central Huallaga River drainage and adjacent Cordillera Azul National Park in central Peru Ranitomeya toraro Brown, Caldwell, Twomey, Melo-Sampaio, and Souza, 2011 western Brazil in the states of Acre and Amazonas, and in the north of Rondônia state Ranitomeya uakarii (Brown, Schulte, and Summers, 2006) southern Peru (Madre de Dios), central Peru (Pachitea drainage), western Brazil (near Porto Walter), along the upper Amazon (in Peru and Colombia), and as far west as central Guyana. Ranitomeya vanzolinii (Myers, 1982) Amazonian rainforests of Brazil and Peru Ranitomeya variabilis (Zimmermann and Zimmermann, 1988) Huallaga River drainage of San Martín Region, Peru Ranitomeya ventrimaculata (Shreve, 1935) Brazil, southeastern Colombia, Ecuador, French Guiana, and Peru. Ranitomeya yavaricola Pérez-Peña, Chávez, Twomey, and Brown, 2010 Rio Yavari- Mirin, Loreto, Peru Dendrobates rubrocephalus Schulte, 1999 is placed here Incertae Sedis. ==References== Category:Frogs of Central America Category:Frogs of South America",
 "title": "Ranitomeya"
}