{
 "id": "1114121",
 "text": "Rebecca Katie Smith (born 17 June 1981) is a former international footballer who played for New Zealand. Smith played in the World Cup and the Olympics. She was the captain of the New Zealand women's national football team. She finished her club career with VfL Wolfsburg, where she won the UEFA Champions League, the German League, and the German Cup. She retired in 2013. == Early life == Smith was born in Los Angeles, California, to parents from New Zealand. She went to high school at Chadwick School in Palos Verdes, California. There, she played soccer in her first year and also played basketball, water polo, and softball. She graduated in 1999 with the highest honor in her class. == Football career == Smith was the captain of the Duke University soccer team. She graduated with a degree in Economics and Spanish. She decided to play football professionally in Germany with FFC Frankfurt, the European Champions at that time. Smith also played for Sunnanå SK in Sweden and Newcastle Jets in Australia. On 2 February 2009, she joined VfL Wolfsburg in Germany. At VfL Wolfsburg, she helped the team win many trophies, including the Frauen-Bundesliga, the UEFA Women's Champions League, and the DFB Pokal. She stopped playing football in 2013 because of knee problems. == International career == Smith played her first game for the New Zealand national team on 7 April 2003, in a big win against Samoa. She was the captain of New Zealand at the 2007 FIFA Women's World Cup in China and the 2008 Summer Olympics. Smith was nominated for FIFA Women's World Player of the Year in 2007. She was New Zealand Player of the Year in 2007. She was named Oceania's Player of the Year twice, in 2011 and 2013. Smith played her 50th international game against Australia on 12 May 2011. She was the captain of New Zealand at the 2011 FIFA Women's World Cup and the 2012 Summer Olympics. She retired from football on 18 September 2013. == International goals == No. Date Venue Opponent Score Result Competition 1\\. 5 July 2011 Rhein-Neckar- Arena, Sinsheim, Germany 1–2 2–2 2011 FIFA Women's World Cup == Professional life == Smith speaks four languages: English, German, Spanish, and Swedish. In 2013, she started a company called Crux Sports to help women's football. She is the CEO of Crux Sports. == FIFA == After she stopped playing football, Smith worked at FIFA, managing women's competitions. == COPA90 == In December 2018, Smith joined COPA90 as the Global Executive Director of Women's Game. She also hosts \"The Players Podcast\" where she talks with famous football players and other important people about different topics. == Optus Sport == Smith joined Optus Sport to help with the broadcast of the 2023 FIFA Women's World Cup in Australia and New Zealand. She co-hosts a daily morning show called Daily Kick-Off and provides expert commentary for some matches. == Honors == === VfL Wolfsburg === \\- UEFA Women's Champions League: 2012–13 - Frauen-Bundesliga: 2012–13 - DFB-Pokal Frauen: 2012–13 === Individual === \\- IFFHS OFC Woman Team of the Decade 2011–2020 Category:1981 births Category:Living people Category:American soccer players Category:Sportspeople from Los Angeles",
 "title": "Rebecca Smith (footballer)"
}