{
 "id": "1114267",
 "text": "Kosmoceratops was a ceratopsid dinosaur that lived in North America about 76–75.9 million years ago during the Late Cretaceous period. It had distinctive bison-like horns over its eyes, a smaller horn on its nose, and unique hooked spikes on its frill. It was about the size of a cow and was herbivorous, eating plants with its sharp beak. == Discovery == Fossils of Kosmoceratops were discovered in rocks of the Kaiparowits Formation in Southern Utah, which dates back to the Late Cretaceous period, about 76.4–75.5 million years ago. This area was part of a basin created by the Western Interior Seaway. The discovery of Kosmoceratops is significant because it deposed Styracosaurus as the world’s most ornately decorated dinosaur, which could potentially change our understanding of dinosaur horns and their functions. == Unique features == Kosmoceratops had several unique features that distinguished it from other dinosaurs: * It had the most horns of any other dinosaur, with bison-like horns over its eyes and a smaller horn on its nose. * The frill of Kosmoceratops was adorned with strange hooked spikes. * It weighed almost as much as a rhino despite being about the size of a cow. These characteristics made Kosmoceratops one of the most ornately decorated dinosaurs known. == Herds == While there is no direct evidence of Kosmoceratops living in herds, it is known that ceratopsians, the group of dinosaurs to which Kosmoceratops belongs, exhibited social behavior and likely lived in groups. The elaborate frills and horns of Kosmoceratops may have been used for species recognition or sexual selection, suggesting that they interacted socially. == Defence == Kosmoceratops likely used its ornate skull, which included numerous horns and horn-like structures, as a defense mechanism against predators. The fifteen well-developed horns and horn-like structures on its frill could have been used to intimidate predators or protect itself during confrontations. ==References== Category:Dinosaurs",
 "title": "Kosmoceratops"
}