{
 "id": "1114103",
 "text": "Sweden competed at the 1926 Women's World Games in Gothenburg, Sweden from 27 to 29 August. It was the first appearance of the European nation at the Women's World Games. The Swedish team consisted of thirteen athletes. With a total of 20 points, Sweden finished third. ==Medals== Medal Name Event Date javelin throw 1000 metres shot put discus throw javelin throw high jump == Athletes == On 29 August 1926 an entry list 16 Swedish athletes was published. However, only 13 were present on the group image.Women’s World Games 1926 Swedish team.jpg # Name Event 24 javelin throw 29 Elsa Svensson discus throw shot put 35 Inga Gentzel 1000 m 36 long jump 37 Elsa Haglund javelin throw 42 Ann-Margret Ahlstrand 100 yd hurdlesHäcklöpning, heat 1 High jump 50 Emy Pettersson 1000 m 57 Maud Sundberg 60 m 68 Vera Jacobsson 100 yd 250 m 4×100 yd relay long jump standing long jump 78 Sylvia Stave 60 m 4×100 yd relay 80 100 yd 4×100 yd relay long jump standing long jump 97 Ruth Svedberg discus throw shot put 98 high jump == Results == ;Track events Athlete Event Heats Heats Heats Final Final Athlete Event # Result Rank Result Rank Sylvia Stave 60 m 3 3 Did not advance Did not advance Maud Sundberg 60 m 2 3 Did not advance Did not advance Vera Jacobsson 100 yd Did not advance Did not advance Märta Johansson 100 yd 1 2 12.6 7 Vera Jacobsson 250 m Did not advance Did not advance Inga Gentzel 1000 m 3:09.4 Emy Pettersson 1000 m 3:16.8 6 Ann-Margret Ahlstrand 100 yd hurdles 1 5 Did not advance Did not advance Sylvia Stave Vera Jacobsson Märta Johansson Asta Plathino 4×100 yd relay 53.0 4 ;Field Events Athlete Event Final Final Final Final Athlete Event Right Left Total Rank Inga Broman High jump 1.40 m Ann-Margret Ahlstrand High jump 1.40 m 4 Long jump 5.16 m 4 Märtha Johansson Long jump 8 Märtha Johansson Standing long jump 2.29 m 4 Vera Jacobssen Standing long jump 2.28 m 6 Elsa Svensson Shot put 10.68 m 8.76 m 19.42 m Ruth Svedberg Shot put 10.24 m 8.61 m 18.85 m 5 Elsa Svensson Discus throw 31.78 m Ruth Svedberg Discus throw 31.39 m 4 Javelin throw 49.15 m Elsa Haglund Javelin throw 45.06 m Source: ==References== Category:Sport in Sweden Category:1926 Women's World Games Category:Nations at multi-sport events",
 "title": "Sweden at the 1926 Women's World Games"
}