{
 "id": "1114131",
 "text": "Connex South CentralCompanies House extract company # 3010919 New Southern Railway Limited formerly Connex South Central Limited formerly Network SouthCentral Limited was a train operating company in the United Kingdom. It was owned by Connex. It operated the South Central franchise from 26 May 1996 until 25 August 2001. On 24 October 2000 the Shadow Strategic Rail Authority announced that Govia had been awarded the franchise and would operate it from 2003.\"Connex loses rail franchise\" BBC News 24 October 2000 Govia made a deal with Connex to buy out the remainder of its franchise with the transaction completed in August 2001.Acquisition of Connex South Central Limited by Govia Limited Go-Ahead Group 30 May 2001Completion of Acquisition of South Central Franchise Go-Ahead Group 28 August 2001South Central Limited Annual Accounts 29 June 2002 ==Services== Connex South Central ran train services from London Charing Cross, London Bridge and London Victoria to Beckenham Junction, Epsom Downs, East Grinstead, Uckfield, Caterham, Tattenham Corner, Horsham, Littlehampton, Bognor Regis, Bournemouth, Portsmouth, Brighton, Eastbourne and Ore. It also ran train services between Hastings and Ashford, Brighton and Hastings, Brighton, Newhaven Marine and Seaford and Brighton and Southampton as well as South London suburban services serving Crystal Palace, Sutton and West Croydon. Services between West Croydon and Wimbledon, which were operated by Connex South Central following privatisation, ceased in 1997. The line was then changed for Tramlink operation. On 2 June 1997 Connex South Central ran a new service from Gatwick Airport to Rugby via the West London and West Coast lines using Class 319s. In December 2000 it ran to Watford Junction but extended southwards to Brighton.Class 319 Kent Rail ==Trains== Connex South Central had taken on a large fleet of 'slam' and sliding door diesel electric and electric multiple units. The slam-door units were not replaced under Connex, but were all later withdrawn after South Central (later rebranded Southern) took over. Class Image Type Number Carriages Built 205 DEMU 10 2 or 3 1957–1962 207 DEMU 4 3 1962 319 EMU 20 4 1987–1988 411 EMU 3 4 1956–1963 421 EMU 107 4 1964–1972 423 EMU 59 4 1967–1974 455 EMU 46 4 1982–1985 456 EMU 24 2 1990–1991 ==References== ==Other websites== * *Connex website Category:Defunct railway companies of the United Kingdom Category:1996 establishments in England Category:2000 disestablishments in England Category:Post-privatisation British railway companies",
 "title": "Connex South Central"
}