{
 "id": "1115641",
 "text": "* Language * Download PDF * Watch * Edit Jailer is a 2023 Indian Tamil-language action comedy film written and directed by Nelson Dilipkumar and produced by Kalanithi Maran under Sun Pictures. The film stars Rajinikanth in the lead role, alongside Vinayakan, Ramya Krishnan, Tamannaah Bhatia, Vasanth Ravi, Sunil, Yogi Babu and Mirnaa Menon in supporting roles. Mohanlal, Shiva Rajkumar and Jackie Shroff play guest appearances. It revolves around \"Tiger\" Muthuvel Pandian, a retired jailer, seeking to apprehend an eccentric idol smuggler Varman. The film was officially announced in February 2022 under the working title Thalaivar 169, being the 169th film of Rajinikanth, while the official title was announced in June that year. Principal photography commenced in August 2022 in Chennai followed with schedules in Cuddalore, Hyderabad, Jaisalmer, Mangalore, Kerala and wrapped by early-June 2023. The music is composed by Anirudh Ravichander, with cinematography handled by Vijay Kartik Kannan and edited by R. Nirmal. Jailer was released theatrically on 10 August 2023. The film received positive reviews from critics and became the highest-grossing Tamil film of 2023, sixth highest-grossing Indian film of 2023 and second highest-grossing Tamil film of all time. A sequel Jailer 2 is in production. ==Premise== The film revolves around \"Tiger\" Muthuvel Pandian, a retired jailer, seeking to apprehend an eccentric idol smuggler Varman for killing his son, who was the Assistant Commissioner of the Indian Police Force. Seeking for the assassination of Varman, Muthuvel Pandian will be involved in the dark world which he has seen before. == Cast == === Cameo appearances === ==Reception== Jailer was released theatrically on 10 August 2023 and received positive reviews from critics and became the highest-grossing Tamil film of 2023, sixth highest-grossing Indian film of 2023 and second highest-grossing Tamil film of all time. Jailer created various records which includes being the highest grossing Tamil film in North America and the highest grossing Tamil film in Karnataka. == Sequel == Post-release, it was reported that the film would have a sequel. Owing to the film's success, Nelson in an interview confirmed the film would have a sequel titled Jailer 2. Progress on the script for 'Jailer 2' is said to be steady, with Nelson Dilipkumar opting for 'Hukum' as the working title for the sequel. ==Notes== ==References== Category:2020s Indian movies",
 "title": "Jailer (2023 Tamil movie)"
}