{
 "id": "1115221",
 "text": "Michael Des Barres (born January 24, 1948) is a British actor and rock singer, known for his versatile career spanning several decades. He has made significant contributions to both the music and film industries, and his work has earned him a devoted fanbase. == Early Life and Education == Michael Philip Des Barres was born on January 24, 1948, in London, England. He was educated at Harrow School, one of the most prestigious schools in the United Kingdom. His early education provided a foundation for his diverse career in entertainment. == Music Career == Des Barres' music career began in the 1970s as the lead singer of the glam rock band Silverhead, which released two albums before disbanding. He later formed Detective, a hard rock band that was signed to Led Zeppelin's Swan Song Records. Detective released two albums and toured extensively. In 1983, Des Barres joined the band Chequered Past, which included members from Blondie and the Sex Pistols. However, it was in 1985 that he gained wider recognition when he replaced Robert Palmer as the lead singer of the supergroup Power Station, performing at the Live Aid concert in Philadelphia. == Acting Career == Des Barres' acting career is equally notable, with numerous television and film roles. He appeared in popular TV shows such as MacGyver, where he played the recurring villain Murdoc, and had guest roles in series like Seinfeld, Melrose Place, and NCIS. His film credits include roles in To Sir, with Love (1967), Ghoulies (1984), and Pink Cadillac (1989). His versatility as an actor has allowed him to work across various genres, from drama to comedy. == Later Career and Personal Life == In recent years, Des Barres has continued to pursue both music and acting. He hosts \"The Michael Des Barres Program\" on SiriusXM's Little Steven's Underground Garage channel, where he shares his deep knowledge and passion for rock music. Des Barres was married to actress Wendy Hamilton in the early 1970s and later to actress Pamela Des Barres from 1977 to 1991. He has a son, Nicholas Des Barres, from his first marriage. Michael Des Barres' career is a testament to his talent and adaptability, making him a respected figure in the entertainment industry. == References == Category:1948 births Category:Living people Category:British movie actors Category:British television actors Category:British rock singers Category:People from London",
 "title": "Michael Des Barres"
}