{
 "id": "1115897",
 "text": "The Brazilian poison frog, spotted poison frog, or Vanzolini's poison frog (Ranitomeya vanzolinii) is a frog. It lives in the Amazon rainforest in Peru and Bolivia. ==Body== The adult frog is 16.7-19 mm long from nose to rear end. The skin of the frog's back is black in color with light yellow spots. There is a blue pattern on the legs. It looks a little like Adelphobates quinquevittatus, Ranitomeya fantastica, and Ranitomeya reticulatus, but R. vanzolinii's spots are rounder. ==Home== This frog lives in trees in rainforests that are not too high up in the mountains. It lives in forests that have bamboo and bromeliad plants growing in them. There are pools of water in these plants, and the frogs lay eggs there. People have seen this frog between 200 and 1280 meters above sea level. They see them sitting and jumping on leaves 4 m above the ground. These frogs eat ants and mites. ==Young== Both parents care for the young. Scientists say it is not common for amphibians to work as partners like this. The female frog lays eggs in a water-filled hole in a tree or other plant. She lays them above the water. There is almost no light in the hole, so algae cannot grow in the water. After the eggs hatch, the male frog carries the tadpoles to water in holes in bamboo or in bromeliad plants. It puts one tadpole in each pool of water. This is so the tadpoles do not eat each other. The male remembers where the tadpoles are. The male leads the female to the water. When the female sits in the water, the tadpole swims at her. Then she lays eggs that will never hatch for the tadpole to eat. ==Danger== Scientists believe this frog is not danger of dying out because it lives in a large place. But it is in some danger because people cut down trees to make farms, make places to raise animals, and get wood to build with. People also catch this frog to sell as a pet. When people catch the frogs to sell, half of the frogs can die. Some of the places this frog lives are protected parks, for example Parque Nacional da Serra do Divisor and Reserva Extrativista do Alto Juruá. ==References== Category:Frogs of South America",
 "title": "Ranitomeya vanzolinii"
}