{
 "id": "1115401",
 "text": "The Juchault family is a French noble family, originating from Brittany, ennobled by office in 1583.E de Séréville, F de Saint-Simon, Dictionary of the French Nobility, 1975, page 557. == History == The Juchault family, originating from Brittany, was ennobled by the office of counselor in the Chamber of Accounts of Nantes in 1583 and maintained its nobility in 1669. The family traces its lineage back to René Juchault, Royal notary, found in 1598.Henri Jougla de Morenas, Grand Armorial de France, volume 4, page 361. The family formed several branches, of which only the Jamonières branch remains. == Personalities == *Michel Juchault de Blottereau (1544-1634), counselor in the Chamber of Accounts of Brittany, alderman, and deputy mayor of Nantes. *Christophe Juchault (1591-1661), president of the Chamber of Accounts of Brittany in 1635, mayor of Nantes from 1642 to 1644. *Louis-Marie Juchault des Jamonières (1713-1772), deputy of the nobility to the Estates of Brittany in 1764. *Louis-Marie Juchault, seigneur des Jamonières, (1769-1842), baron of the Empire on , hereditary baron on , president of the electoral college of Nantes, mayor of Saint-Philbert-de-Grand-Lieu, married in 1796 to his cousin, Marie Anne Juchault de La Moricière.Henri Frotier de La Messelière Filiations bretonnes, volume 3, 1920, page 222. *Christophe Louis Léon Juchault de Lamoricière, born on in Nantes and died on in Prouzel (Somme), general, diplomat, and politician, governor-general of Algeria, Minister of War, and ambassador of France to Russia. *Charles des Jamonières (born on in Le Cellier and died on in Saint-Herblain), distinguished in sports shooting competitions, bronze medalist at the 1936 Summer Olympics. Général Lamoricière - Vernet.jpg|The general Christophe Louis Léon Juchault de Lamoricière (1806-1865). == Arms & Titles == Azure, a fess Or accompanied by 3 escallops Argent. *Baron of the Empire in 1814. *Hereditary baron in 1826. == Alliances == Bidé de La Provôté, Fournier, Rousseau de Saint-Aignan, Robin, de La Tullaye, Bouhier de La Vérie, du Bot, Jochaud du Plessix, du Chaffault, de La Bourdonnaye, de Sesmaisons, Rousselot de Saint-Céran, Robineau de Bougon, de La Borde, Bascher de Souché, Siffait, de Maistre, Le Tourneulx, de Dampierre (Dampierre), de La Croix de Castries, Cesbron-Lavau, etc. == Possessions == *Château du Grand-Blottereau *Château des Jamonières *Château de Clermont *Manoir de la Vignette *Château de la Moricière *Manoir du Monceau *Château du Chillon *Château de Prouzel *Château de Talhouët == Bibliography == *Théodore Courtaux, Histoire généalogique de la famille Juchault de Lamoricière et des Jamonières de ses alliances et des seigneuries qu'elle a possédées, Paris, 1896, 128 p. ==References== Category:French nobility Category:French noble families",
 "title": "Juchault family"
}