{
 "id": "1115751",
 "text": "Presidential elections in the Philippines are set to be held on Monday, May 8, 2028, as part of the 2028 Philippine general election. This will be the 18th direct presidential election and 16th vice presidential election in the country since 1935, and will be the seventh sextennial presidential and vice presidential election since 1992. Incumbent president Bongbong Marcos will be ineligible for re-election when he has served for four years because the president is limited to a single term if they have served for four years under the 1987 Philippine Constitution. Incumbent vice president Sara Duterte is eligible for re-election for Vice-President. Therefore, this election will determine the 18th president and the 16th vice president, if Duterte decides to run for another position or is not re-elected. The president and vice president are elected separately, so the two winning candidates may come from different political parties. == Eligibility and requirements == Article VII, Section 2 of the constitution states for a person to serve as president must: * be a natural-born citizen of the Philippines. * be a registered voter. * be able to read and write. * be at least forty years old on the day of the election. * be a permanent resident in the Philippines for at least ten years. == Potential candidates == ===For president=== ====Interested==== Candidate Party Current position Sources Sara Duterte Vice President of the Philippines (2022–present) Risa Hontiveros Senator of the Philippines (2016–present) ====Speculated==== Candidate Party Current position Sources Sonny Angara Secretary of Education (2024–present) Bam Aquino Senator of the Philippines (2013–2019; 2025–present) Leila de Lima Member of the Philippine House of Representatives for Mamamayang Liberal (2025–present) Baste Duterte PDP Mayor of Davao City (2022–present) Win Gatchalian Senator of the Philippines (2016–present) Bong Go PDP Senator of the Philippines (2019–present) Imee Marcos Senator of the Philippines (2019–present) Robin Padilla PDP Senator of the Philippines (2022–present) Kiko Pangilinan Senator of the Philippines (2001–2013; 2016–2022; 2025–present) Jonvic Remulla Secretary of Interior and Local Government (2024–present) Martin Romualdez Member of the Philippine House of Representatives from Leyte's 1st district (2019–present) Gibo Teodoro Secretary of National Defense (2023–present) Mark Villar Senator of the Philippines (2022–present) ====Declined==== Candidate Party Current position Notes Sources Chiz Escudero Senator of the Philippines (2022–present) Considering retiring Isko Moreno Mayor of Manila (2019–2022; 2025–present) Will run for re-election Leni Robredo Mayor of Naga, Camarines Sur (2025–present) Will run for re-election Raffy Tulfo Senator of the Philippines (2022–present) Running for the Senate ====Ineligible==== Candidate Party Current position Notes Sources Rodrigo Duterte PDP President of the Philippines (2016–2022) Former president, ineligible according to the constitution Bongbong Marcos President of the Philippines (2022–present) Current president, ineligible according to the constitution Sandro Marcos Member of the Philippine House of Representatives from Ilocos Norte's 1st District (2022–present) Underaged, not 40 years old Vico Sotto Mayor of Pasig (2019–present) Underaged, not 40 years old ===For vice president=== ====Speculated==== Candidate Party Current position Sources Bam Aquino Senator of the Philippines (2013–2019; 2025–present) Bato dela Rosa PDP Senator of the Philippines (2019–present) Rodrigo Duterte PDP President of the Philippines (2016–2022) Win Gatchalian Senator of the Philippines (2016–present) Bong Go PDP Senator of the Philippines (2019–present) Risa Hontiveros Senator of the Philippines (2016–present) Imee Marcos Senator of the Philippines (2019–present) Robin Padilla PDP Senator of the Philippines (2022–present) Koko Pimentel Senator of the Philippines (2011–2025) Francis Tolentino Senator of the Philippines (2019–2025) Cynthia Villar Senator of the Philippines (2013–2025) ====Declined==== Candidate Party Current position Notes Sources Chiz Escudero President of the Senate of the Philippines (2024–present) Considering retiring Isko Moreno Mayor of Manila (2019–2022; 2025–present) Will run for re-election Migz Zubiri Senator of the Philippines (2016–present) Retiring ==Opinon polling== ===President=== Fieldwork date(s) Pollster Sample size MoE R. Duterte PDP S. Duterte HNP Escudero NPC Go PDP Hontiveros Akbayan B. Marcos PFP I. Marcos Nacionalista S. Marcos PFP Moreno Aksyon Pacquiao PFP Padilla PDP Poe Ind. Robredo Liberal Romualdez Lakas Singson Ind. R. Tulfo Ind. Others / None My 20—21, 2025 Tangere ±2.48% — 29 3 15 — — — — — — 3 — 21 6 — 11 1 11 — March 31—April 7, 2025 WR Numero — — 30.2 — 4 2.3 — 3.8 — — 2.1 1.7 4.7 12.7 0.5 — 17.9 2.8 17.5 — February 20—26, 2025 Pulse Asia — — 39 — — 5 — — — — — — 14 — 1 — 28 — — — February 10—18, 2025 WR Numero ±2.0% — 29.1 — — 1.1 — 2.8 — — 4.1 1.9 3.8 12.4 1.2 — 19.3 2.8 22.6 — September 5—23, 2024 WR Numero — — 24 — — 4 — 5 — — 4 3 5 9 1 — 24 — 18 — June 25—30, 2024 Oculum ±3.0% — 25.4 — — 2.9 — 5.7 — 4.8 3.1 2.6 — 10.6 0.8 — 18.5 — 20.4 4.3 May 23—26, 2024 Tangere ±2.5% — 27.67 — — 3.73 — 4.13 — 6.60 1.73 0.60 10.20 14.33 — — 27.07 3.93 — — March 6—10, 2024 Pulse Asia — — 0.2 34 — — 1 — 5 — 0.1 3 2 — 11 0.5 — 35 — 5 2 February 21—29, 2024 Oculum ±2.0% — 42 — — 1 — 4 — 4 4 2 — 10 0.4 — 17 2 14 — January 20—24, 2024 Tangere — — 31.5 — — 1 — 3 — 6 2 — 10 12 0.3 1 30.8 4 — — November 24—December 24, 2023 WR Numero — — 36 — — 1 — 7 — — 5 5 — 9 1 — 23 — 14 — June 11, 2023 SWS ±3.0% 3 28 — — — 1 1 1 1 2 1 — 6 — — 11 5 41 ===Vice president=== Fieldwork date(s) Pollster Sample size MoE Abalos PFP Aquino KANP B. Duterte PDP R. Duterte PDP S. Duterte HNP Escudero NPC Garcia Ind. Go PDP Hontiveros Akbayan I. Marcos Nacionalista Moreno Aksyon Pacquiao PFP Padilla PDP Pangilinan Liberal Poe Ind. Robredo Liberal Romualdez Lakas Teodoro PRP E. Tulfo Lakas R. Tulfo Ind. Zubiri Ind. Others / None My 20—21, 2025 Tangere ±2.48% — 26 — — — 4 — 36 6 — — — 3 — — — — — 4 11 — 4 6 — March 31—April 7, 2025 WR Numero — — — — — — — — — — 7.4 — 5.2 8.4 — 18.4 16.1 1.4 1.6 — — 3 7.7 30.7 — February 20—26, 2025 Pulse Asia — — — — — — — — — — — — — — — 47 — — — — — — — — — February 10—18, 2025 WR Numero ±2.0% — — — — — — — — — 7.0 — 9.7 8.3 — 15.6 13.5 1.1 2.8 — — 3.3 6.2 33 — November 18, 2024 WR Numero — — — — — — — — — — 8 — 8 9 — 20 14 3 3 — — 4 — — — June 25—30, 2024 Oculum ±3.0% — — — 16 — — — 5 6 4 6 4 4 — — 7 1 — — 20 — — 22 — Mayy 23—26, 2024 Tangere ±2.5% 2.33 — 0.87 11.80 0.01 11.27 1.40 9.60 7.80 5.67 — 4.00 3.13 2.27 13.93 — — 2.13 — 17.80 2.13 3.87 — — March 6—10, 2024 Pulse Asia — — — — 0.004 0.001 0.01 — — 0.3 0.05 16 — 14 14 0.02 35 — 1 4 — 0.5 7 — 6 2 November 24—December 24, 2023 WR Numero — — — — — — — — — — 15 — 11 11 — 22 9 2 4 — — 6 — 21 — == Sources == == Other websites == * Official website of the Commission on Elections * Official Gazette of the Philippines Category:2028 elections Category:2028 in the Philippines Category:2020s elections in the Philippines Category:Presidential elections *[MoE]: Margin of error",
 "title": "2028 Philippine presidential election"
}