{
 "id": "1115773",
 "text": "The Indonesian Communist Party (PKI), the largest non-governmental communist party globally, held significant membership and influence in Indonesia until its eradication in 1965. _Pioneer:_ In 1914, Henk Sneevliet and other Dutch East Indies socialists formed the Indies Social Democratic Association (ISDV) to educate Indonesians on resisting colonial rule. The party, initially centered around 100 members, became radical and anti-capitalist. In 1917, the reformist group formed the Indies Social Democratic Party, focusing on the October Revolution. ISDV gained followers among Dutch soldiers and sailors, leading to the formation of the Red Guard and the formation of the revolutionary Marxist-dominated Sarekat Rakjat. _Formation and growth_ The Communist Union in the Indies (PKH) was the first Asian communist party to join the Communist International. However, its strategy of prohibiting dual memberships led to dissatisfaction among members. In 1922, Semaun organized trade unions into the All Indonesian Workers' Organization Union, focusing on gaining control of the working class for a successful revolution. _Uprising of 1926_ In 1925, the Exec Committee of the Comintern ordered communists in Indonesia to form an anti-imperialist front. Extremist elements led by Alimin & Musso called for a revolution to overthrow the Dutch colonial government. The PKI led a rebellion against colonial rule in West Java and West Sumatra, leading to brutal colonial rule. In 1927, the PKI was declared banned by the Dutch government and moved underground. _Post-war revival_ The PKI resurfaced after Japan's surrender in 1945 and actively participated in Indonesia's independence struggle from the Netherlands. However, President Sukarno feared its growing influence threatened its position. In 1948, the PKI and the Socialist Party formed a joint front. \\- Madiun Incident 1948: (Main web: https://id.wikipedia.org/wiki/Peristiwa_Madiun) The Madiun incident of 1948 occurred in Indonesia after the signing of the Renville Agreement, leading to the disarmament of the PKI and the subsequent uprising. The PKI was suppressed, leading to thousands of deaths and 36,000 imprisonments, including Musso. _Arise once more_ In 1950, the PKI relaunched publishing activities and became a nationalist party under D.N. Aidit, supporting anti-colonialist policies. The party grew rapidly, with members reaching 1.5 million in 1959. Despite opposition from the Dutch, the PKI supported Sukarno's government and the launch of the Nasakom slogan in 1960. _Voting of 1955_ The Indonesian Communist Party (PKI) favored Sukarno for its 'guided democracy' plans and finished fourth in the 1955 elections. In 1957, the PKI faced attacks and nationalization of foreign-owned companies. In 1958, the Revolutionary Government of the Republic of Indonesia (PRRI) was formed, leading to the arrest of PKI cadres. In 1960, President Soekarno launched the slogan Nasakom, establishing the PKI as a partner in his politics. _1960_ The PKI, a communist party in Indonesia, gained political autonomy despite criticism of Sukarno's budget and the idea of Malaysia. With 3 million members in 1965, it became the strongest communist party outside the Soviet Union and PRC. The PKI joined the government in 1962 and participated in territorial disputes and the formation of a 5th Force. By the mid-1960s, the party's membership reached 2 million. _Mass murder and the end of PKI_ In the 1960s, Indonesia faced a delicate balance between the Indonesian Communist Party (PKI), military, nationalist factions, and Islamic groups. Tensions escalated as PKI gained power, leading to anti-PKI movements and a brutal anti-communist purge. General Suharto consolidated power, leading to widespread imprisonment without trial and reshaping Indonesian society and politics. _Post-1965 development_ Post-1965, the PKI faced paralysis due to mass murders and self-criticism, leaving many former supporters and sympathizers disorganized. Sudisman, the party's fourth- rank leader, attempted to rebuild but was arrested and sentenced to death. PKI cadres took refuge in Blitar, East Java, but were killed in 1968. Until 2004, former PKI members were banned and blacklisted from jobs. In 1999, Abdurrahman Wahid invited former PKI exiles to return to office and proposed removing restrictions on open discussion of communist ideology. _Discourse of apology_ President Joko Widodo plans to apologize to PKI victims' families, but denies this. Efforts to reconcile past human rights violations are ongoing, and Attorney General Prasetyo seeks non-judicial steps. National Human Rights Commission hopes for apology. _Counter_ Mass organizations and religious elements rejected an apology to the PKI, citing allegations of murder and rebellion, leading to demonstrations. ==References== Category:Communist parties in Asia Category:Politics of Indonesia Category:1914 establishments Category:1910s establishments in Asia Category:1960s disestablishments in Asia",
 "title": "PKI"
}