{
 "id": "1115461",
 "text": "A Television show creator is a screenwriter who creates a Television show. == WGA Rules == According to the Writers Guild of America, the Creator is either the writer who creates the TV format of the show or the writer who writes the Pilot episode. If no one wrote a TV format then the person who wrote the first episode is the Creator of the show. If one person wrote the TV format and another person wrote the first episode then three people who weren’t involved yet try to figure out if the first episode were different enough from the TV format that the person who wrote it counts as the Creator. The WGA says its different enough from the TV format if it changed one (or more) of these things 1) The setting 2) The theme or point of view 3) The premise or general storyline 4) The central running characters 5) The interplay among the characters 6) The flavour, style, or attitude == WGGB Rules == According to the Writer’s Guild of Great Britain, the person whose name follows “created by” on British television is the person who wrote the pilot screenplay, the series pitch document and the Series Bible. If different people wrote them then the show has more than one creator. The “series pitch document” is a five to ten page document explaining what a show will be about. == Co-Creators == Sometimes both writers get the credit and are called co-creators. == Examples == Craig Bartlett created Hey Arnold! Gene Roddenberry created Star Trek and Star Trek: The Next Generation. Marc Brown created Arthur John A. Davis created The Adventures of Jimmy Neutron: Boy Genius. Chris Gifford created Dora the Explorer Matt Groening created The Simpsons, Futurama and Disenchantment. Stephen Hillenburg created SpongeBob SquarePants Butch Hartman created The Fairly OddParents, Danny Phantom, Tuff Puppy and Bunsen is a Beast. Scott Fellows created Ned's Declassified School Survival Guide, Big Time Rush, Johnny Test, 100 Things to Do Before High School and Supernoobs. Aaron Sorkin created The West Wing Dan Povenmire and Swampy Marsh created Phineas and Ferb and Milo Murphy's Law. Povenmire also created Hamster and Gretel Bryan Konietzko and Michael Dante DiMartino created Avatar: The Last Airbender. == References == Category:Television writers",
 "title": "Television show creator"
}