{
 "id": "1115255",
 "text": "ungoogled-chromium Developer(s) Eloston and other hobbyists\"Contributors to ungoogled-software/Ungoogled-chromium\". GitHub. Retrieved 21 April 2021. Initial release December 14, 2015; 8 years ago (2015-12-14) Stable release 124.0.6367.118-1 (3 May 2024; 45 days ago (3 May 2024)) Repository https://github.com/ungoogled-software/ungoogled-chromium Engine V8, Blink Operating system Linux, macOS, Microsoft Windows, Android, BSD Platform x86-64, AArch64, ARMv7, IA-32 License 3-clause BSD License Website github.com/ungoogled-software/ungoogled-chromium ungoogled-chromium is a fork of Chromium that removes Google's services such as Sync. It does this by creating updates to the Chromium source code. The final browser is similar to regular Chromium. == Features == * Anything that requires Google's domains such as Google Safe Browsing has been disabled. * Google domains have been replaced with domains that do not exist and then those have been blocked. * Allowing the user to change how the browser works using chrome://flags. Some parts of regular Chromium are not the same on ungoogled-chromium. For example, a browser extension is required to install extensions from the Chrome Web Store. == History == ungoogled-chromium was created by a hobbyist who goes by the name Eloston in 2015. The program was first made for the Linux operating system but then support for other operating systems was added. Eloston used to release versions of the program that were already compiled from source code, but he eventually stop providing them and instead let other people provide builds with his changes. In 2019, Eloston started to get less involved with the project, and other developers started to maintain his project for him.\"Contributors to ungoogled-software/Ungoogled-chromium\". GitHub. Retrieved 21 April 2021. In 2022, the Github repository was given to the ungoogled- software account from Eloston's own personal account. == References == == Other websites == * * Category:Web browsers Category:Free software",
 "title": "Ungoogled-chromium"
}