{
 "id": "1115434",
 "text": "Ahmed Hussein al-Sharaa (born 29 October 1982), also known by the nom de guerre Abu Mohammad al-Julani, is a Syrian politician and militant leader who is the president of Syria since 2025. He was also the militant leader of the militant group Hay'at Tahrir al-Sham. Al-Sharaa was born to a Syrian Sunni Muslim family from the Golan Heights, and grew up in the capital, Damascus. Shortly before the 2003 invasion of Iraq, he joined al-Qaeda and fought for three years in the Iraqi insurgency. American forces captured and imprisoned him from 2006 to 2011. His release happened around the same time as the Syrian revolution, and he created the al-Nusra Front in 2012 with the support of al- Qaeda to take part in the Syrian civil war against the Ba'athist government of Bashar al-Assad. Before he cut ties with al-Qaeda in 2016, he was the emir of the defunct Jabhat al-Nusra, the official group that repersented al-Qaeda in Syria. ==Early life== Ahmed Hussein al-Sharaa was born on 29 October 1982 in Riyadh to a middle-class family. His father worked there as an oil engineer, and his mother was a geography teacher. The family returned to Syria in 1989. He enrolled at Damascus University, studying media studies and medicine for two years before moving to Iraq in 2003. ==Iraq War activities== Al-Sharaa said that he was \"radicalized\" by the Palestinian Second Intifada in 2000 when he was 17 or 18 years old. Having supported the 9/11 attacks at first, al- Sharaa went to Baghdad by bus just weeks before the 2003 U.S. invasion of Iraq, where he quickly became a well known member of al-Qaeda in Iraq (AQI). Some say he he had a close connection with AQI leader, Abu Musab al-Zarqawi, however he denied this saying he was only a foot-soldier under al-Qaeda against American occupation. In 2003, al-Sharaa was arrested and questioned by the Military Intelligence Directorate for his illegal departure from Syria to Iraq, he was released after he said he was not part of any extremist groups. Before the Iraqi civil war began in 2006, al-Sharaa was arrested by American forces and imprisoned for over five years in many detention centres and prisons. ==Presidency== On 8 December, Syrian Prime Minister Mohammad Ghazi al-Jalali announced that the Syrian government would hand over power to a new elected government following the Fall of Damascus. On the same day, Al-Sharaa delivered a speech at Damascus's Umayyad Mosque, calling the fall of Assad's regime \"a new chapter in the history of the region\". On 9 December, HTS released a video of al-Sharaa, al-Jalali and Mohammed al-Bashir, the head of the de facto government in Idlib. On 12 December, al-Sharaa met with Turkish officials, which made this the first diplomatic delegation since Assad was removed from power. Until 2024, the United States named Al-Sharaa a \"Specially Designated Global Terrorist\". They placed a $10 million reward for information that could lead to him being arrested four years after. On 20 December 2024, the United States removed the $10 million reward it had previously offered for the arrest of al-Sharaa. On 29 January 2025, Al-Sharaa was appointed by the Syrian General Command as the president of Syria for the transitional government. ===Views=== In 2016, when al-Sharaa ended his connection with al- Qaeda, he focused on international support by focusing on governance in Syria rather than transnational jihadism. He supports a technocratic administration in the territory. In recent years, he has become more moderate, saying he does not support going into war against Western nations, and supports protecting Syria's minorities. When talking about the ongoing Israeli airstrikes on Syria, al-Sharaa said that after the fall of the Assad regime, Israel no longer has \"any excuses\" for attacking Syrian territory. He also supports \"diplomatic solutions\" as the only way to have security instead of \"[bad] military adventures\". Al-Sharaa reportedly told a group of journalists that his transitional government would continue to support the 1974 Disengagement of Forces Agreement that ended the Yom Kippur War. ==Notes== == References == ==Other websites== * * Abu Muhammad al-Golani Counter Extremism Project profile Category:People from Riyadh Category:Living people Category:1982 births Category:Presidents of Syria Category:Current national leaders Category:Syrian military people",
 "title": "Ahmed al-Sharaa"
}