{
 "id": "1115324",
 "text": "Julie Ann Pizzi (born December 14, 1971) is an American film and television producer. She is best known as a co-founder of PB&J; Television, and is the current President at Bunim/Murray Productions and 51 Minds Entertainment. Pizzi has won an Emmy Award for her work as an executive producer. == Early life == Julie Ann Pizzi was born in Rhode Island on December 14, 1971. Pizzi attended Northeastern University, a private research university in Boston, Massachusetts, from 1989. She graduated with her bachelor's degree in journalism in 1994. == Career == Pizzi began her career at Bunim/Murray Productions (BMP) in 1998, working as the Creative Vice President and as a Showrunner for six years, leaving BMP in 2004. She returned in 2015 and worked as the President of Entertainment and Development. On February 25, 2021, she was named as the company's new President, following the departure of CEO Gil Goldschein. Speaking on her promotion, she said: \"I started my career at Bunim/Murray and was mentored by its founders, the late Mary-Ellis Bunim and Jonathan Murray. I have incredible admiration for the company they created and it's important for me to continue to build on what they built in both nurturing creativity and developing content that is both innovative and entertaining. At the same time, look forward to working with Cris Abrego, his team and Banijay globally as we shepherd Bunim/Murray into its next successful chapter. Cris is an industry leader, who also worked at BMP during the company's early years. He understands the uniqueness of the company, the brand and its culture.\" On September 23, 2023, Benijay Americas named her as the new President at 51 Minds Entertainment, a Banijay-owned company, after Christian Sarabia stepped down. Pizzi co-founded PB&J; Television with Patty Ivins in 2004. She serves as a Co-President. Pizzi won her first Emmy Award in 2022, for her work as an executive producer on the Amazon Prime Video reality television series Lizzo's Watch Out for the Big Grrrls. Pizzi has served as an executive producer on the Hulu reality television series Vanderpump Villa. The series premiered on April 1, 2024, and focuses on Lisa Vanderpump and her hand-selected staff as they work, live, and play at an exclusive French estate: Château Rosabelle. == Personal life == Pizzi married her college boyfriend, Daniel Joseph Daponde (born February 4, 1969). They have two sons together. == Filmography == === As producer === Year Title Role Notes Ref. 1998 Titanic: Secrets Revealed Segment producer Television film 1998 Movie Magic Segment producer 2000–2019 Real World/Road Rules Challenge Executive producer 106 episodes 2003 Born to Diva Co-executive producer 2003 Living Dangerously Assistant producer 2004 The Simple Life Co-executive producer Episode: \"The Reunion\", Credited as; Julie-Ann Pizzi 2005 Sports Illustrated Swimsuit Model Search Executive producer 5 episodes 2005 Modern Girl's Guide to Life Executive producer 10 episodes 2005 Reversal of Fortune Executive producer Television film 2006 LA Riding Club Executive producer 3 episodes 2006 Pageant School: Becoming Miss America Executive producer Television special 2007 Outrageous Proposals Executive producer Television special 2007–2013 Extreme Weddings Executive producer 2007–2009 Dress My Nest Executive producer 35 episodes 2008 Miss America: Reality Check Executive producer 4 epiaodes 2008 America's Prom Queen Executive producer 6 episodes 2008 Date My House Executive producer 12 episodes 2009 Blonde Charity Mafia Executive producer 6 episodes 2009 Girls on the Wall Executive producer 2011 Bachelorette Party: Las Vegas Executive producer 8 episodes 2011–2014 Bad Sex Executive producer 20 episodes 2013 Matched by Design Executive producer 2014–2015 Flex & Shanice Executive producer 16 episodes 2015 Fix My Mom Executive producer 2017–2018 Bill Nye Saves the World Executive producer 25 episodes 2017 Undressed Executive producer 4 episodes 2017–2019 Ball in the Family Executive producer 82 episodes 2017 The Healer Executive producer 6 episodes 2018–2019 Endless Summer Executive producer 24 episodes 2018 The Challenge: CT's Getting Married Executive producer Television film 2019 Lindsay Lohan's Beach Club Executive producer 13 episodes 2019–2022 Family or Fiancé Executive producer 44 episodes 2019 El Mundo Real Executive producer 12 episodes 2019 Real World: Skeletons Executive producer 3 episodes 2019 Stranded with Sam and Colby Executive producer 8 episodes 2020 Kim Kardashian West: The Justice Project Executive producer Television film 2020–2022 Miz & Mrs. Executive producer 2021 For Real: The Story of Reality TV Executive producer 2021–2022 The Real World Homecoming Executive producer 22 episodes 2021–present The Challenge: All Stars Executive producer 41 episodes 2021 House of Creators Executive producer 12 episodes 2021 Born for Business Executive producer 10 episodes 2022 Like Mother, Like Daughter? Executive producer 8 episodes 2022 WWE Evil Executive producer Episode: \"Hollywood Hulk Hogan\" 2022 Lizzo's Watch Out for the Big Grrrls Executive producer 8 episodes 2022 How Not to Be a Junkie Associate producer Short film 2022–present The Challenge: USA Executive producer 26 episodes 2022 After Happily Ever After Executive producer 8 episodes 2022–2024 Don't Forget the Lyrics! Executive producer 2023 The Challenge: UK Executive producer Episode: \"Welcome to the Challenge\" 2023 Dead Hot: Season of the Witch Producer 2023 Buddy Games Executive producer 8 episodes 2023–2024 The Family Stallone Executive producer 18 episodes 2023 The Challenge: World Championship Executive producer 12 episodes 2024 Vanderpump Villa Executive producer 11 episodes 2024 The Life and Murder of Nicole Brown Simpson Executive producer 2024 The Never Ever Mets Executive producer 10 episodes === As additional crew === Year Title Role Notes Ref. 2002 Playboy: Who Wants to Be a Playboy Centerfold? Additional director Television special 2004 Real World/Road Rules Challenge Special thanks Episode: \"The Inferno II: Real World/Road Rules Challenge Uncensored\" === As herself === Year Title Notes Ref. 2005 Real World/Road Rules Challenge Episode: \"The Inferno II: Real World/Road Rules Challenge Uncensored\" 2022 The Challenge: Untold History 2 episodes == References == Category:1971 births Category:Living people",
 "title": "Julie Pizzi"
}