{
 "id": "1115628",
 "text": "Koreans in Micronesia used to form a large population before World War II, when most of the region was ruled as the South Seas Mandate of the Empire of Japan; for example, they formed 7.3% of the population of Palau in 1943. However, after the area came under the control of the United States as the Trust Territory of the Pacific Islands, most Koreans returned to their homeland. , about seven thousand South Korean workers & immigrants and Korean Americans lived in the Marianas (Guam and the Commonwealth of the Northern Mariana Islands), which have remained under U.S. control. ==Japanese colonial era (1914–1945)== As the demand for work increased largly with the start of war, Japanese authorities turned to the Korean head as a supply of cheap workers. The first Korean workers came in January 1939, a group of 500; they were hired by Hōnan Sangyō K.K. (). A 1943 survey showed Palau's total Korean population at 2,458, or 7.3% of the population at the time; they were only one-tenth the size of the Japanese population. 864 lived on Babeldaob, another 721 were housed at the naval base on Malakal Island, 539 lived at Angaur, and the remaining 334 were found throughout other locations. There were about 2,400 Koreans on Tinian at the time of the eponymous July 1944 battle which brought the island under U.S. control. Along with the Japanese, the Koreans were all banished after the surrender of Japan ended World War II. The process of banishment began in September 1945 and lasted until May 1946. The total number who were banished to Korea from Palau was recorded at greater number than 3,000 people. In total, across all of the islands, U.S. records show 10,966 Korean banished (6,880 civilians, 3,751 military servicemen, and 190 soldiers), while Japanese records show just 7,727. ==Recent years (1945–present)== ===U.S. territories=== Based on the information from South Korea's Ministry of Foreign Affairs, there are 5,016 Koreans residing in Guam (1,933 Korean Americans, 1,426 with immigrant status, 133 international students, and 1,524 South Korean expatriates with other types of visas) and 2,281 in the Northern Mariana Islands (159 Korean Americans, 102 with immigrant status, 214 international students, and 1,806 with other types of visas). In Marpi, Saipan in the Northern Mariana Islands, a remembrance for Korean soldiers in the Imperial Japanese Army who died during the Battle of Saipan was built in 1978. ===Elsewhere=== Only about 120–130 South Korean newcomers live in Palau, including about 80 working on a construction project at Babeldaob. South Korea also seen as the second-largest country for tourists to Palau, behind the Republic of China on Taiwan. ==References== ===Notes=== ===Sources=== * * * * * ==Further reading== * Category:Emigration Category:Korean people Category:Micronesia",
 "title": "Koreans in Micronesia"
}