{
 "id": "1115034",
 "text": "A stirrup strap or stirrup leather is a piece of leather or other material, that, attached to the saddle, holds the stirrup at its lower end. Each saddle has two stirrups and two stirrup straps. The upper end of the stirrup strap is attached to the saddle and the lower end attached to the stirrup. Many systems are possible for such unions, modern solutions use buckles (see image). == History == The first stirrups consisted of a rope that joined the saddle with the rider's big toe. They appeared in the Kushan empire (present-day India ) between the 1st and 2nd centuries BC . From there they moved to China around the year 300, where, due to the colder climate of the area, they began to tie shoes around the foot, and not just over the toe. Shortly after, the original rope was replaced with iron pieces. Maurice's Strategikon: handbook of Byzantine military strategy; George T. Dennis From China the use of the stirrup spread to the Mongol nomads of Central Asia, Korea and Japan . The Huns introduced them to Persia in the IV and to Europe around the V, although there is no news of their adoption by the Roman imperial cavalry until approximately a century later (after the fall of the Western Roman Empire ). Around the year 600 AD. C., the Avars of Pannonia had been pushed west from the steppes by the Turks, and introduced the stirrup into Europe. In turn, the Arabs would take it from the Persians and the Eastern Romans . Maurice's Strategikon: handbook of Byzantine military strategy; George T. Dennis For their part, the Germanic invaders of the Roman Empire quickly adopted the use of stirrups. This improved the effectiveness of his mounted troops to such an extent that it facilitated the defeat of the classical model of the Roman legion, at the Battle of Adrianople (378), which caused an unprecedented military crisis. The stirrup, which allowed the rider to fight comfortably and maximized the impact of the charge, had practically retired the best army in history, beginning a new era in Europe: that of the cavalry corps that would dominate the medieval battlefields for more than a thousand years. (Outside of some particular case such as that of the Almogávares). Maurice's Strategikon: handbook of Byzantine military strategy; George T. Dennis == References == Category:Cavalry",
 "title": "Stirrup strap"
}