{
 "id": "1115540",
 "text": "The surviving ancient translation of the Hebrew Bible into Koine Greek known as the Septuagint (LXX) has been preserved in fragments of ancient manuscripts. Those include three 2nd-century-BCE fragments of Leviticus and Deuteronomy (Rahlfs nos. 801, 819, and 957) and five 1st-century-BCE fragments of Genesis, Exodus, Leviticus, Numbers, Deuteronomy (Rahlfs nos. 802, 803, 805, 848, and 942), only. The vast majority are various later surviving late- antiquity and medieval manuscript versions of the Christian Greek Old Testament tradition.Sidney Jellicoe, The Septuagint and modern study, 1968, pp. 175, Ch. VII: \"For the manuscripts the familiar threefold classification into (1) Uncials, (2) Cursives, and (3) Papyri and Fragments has been adopted, although (see p. 176, n. 1, infra) it is not entirely\"Wolfgang Kraus, R. Glenn Wooden, Septuagint research: issues and challenges, 2006Natalio Fernández Marcos, The Septuagint in Context: Introduction to the Greek Version of the Bible, 2000, Ch. 15Cécile Dogniez, Bibliography of the Septuagint, 1995 [This volume is a successor to \"A Classified Bibliography of the Septuagint (Brill, Leiden 1973), by S.P. Brock, C. T. Fritsch and S. Jellicoe, for the literature on the Septuagint published between 1970 and 1993.\" == Classification == There are currently over 2,000 classified manuscripts of the Greek Old Testament. The first list of manuscripts was presented by Holmes and Parsons. Their edition ends with a full list of manuscripts known to them set out in the Annexes. It enumerates 311 codes (marked with Roman numerals I–XIII and Arab 14–311), of which the codes are designated by their siglum I–XIII, 23, 27, 39, 43, 156, 188, 190, 258, 262. The codes marked with Roman numerals signify given letters from A to Z. The list of manuscripts according to the classification of Alfred Rahlfs—a list of all known manuscripts proposed by Alfred Rahlfs based on census of Holmes and Parsons. === Division in classification by Rahlfs === The table of manuscripts is divided into ten parts: * Part I: A–Z (selected late antiquity christian codices in majuscule). * Part II: 13–311 (medieval manuscripts, numbering given by Holmes and Parsons) * Part III: 312–800 (medieval manuscripts of the Greek Old Testament, with the exception of the Psalms) * Part IV: 801–1000 (antiquity small fragments of the Torah and late antiquity small fragments of the Greek Old Testament, with the exception of the Psalms) * Part V: 1001–1400 (psalms from the twelfth century) * Part VI: 1401–2000 (medieval fragments psalms uncertain dating younger) * Part VII: 2001–3000 (medieval small fragments psalter [to the eighth century] BCE) * Part VIII: 3001–5000 (medieval manuscripts of the Greek Old Testament, with the exception of the Psalms) * Part IX: 5001–7000 (medieval small fragments of the Greek Old Testament, with the exception of the Psalms) * Part X: 7001–xxxx (medieval fragments psalter) === Abbreviations === * Pent. – Pentateuch (Genesis – Deuteronomy) * Hept. – Heptateuch (Genesis – Judges) * Oct. – Octateuch (ἡ ὀκτάτευχος = Genesis – Ruth) * IV Proph. – Four Major Prophets books. * XII Proph. – Twelve Minor Prophets books. * Most book names are not written as full words. They have been abbreviated from their Latin names and can be consulted at the article Books of the Vulgate. Example: Book of Wisdom or, Wisdom of Solomon, is abbreviated as Sap. ==== Acronyms ==== EBE - National Library of Greece ==== Latin terms ==== * aliquot – some * catenae, catenarum – chain, chains (abbreviated as \"cat.\"). Catena. * ecloge – safeguard page * excerpta – items * graduales – Songs of Ascents (Ps 119-133 by the numbering in the LXX) * inter alia – among others * lacunae – missing words/lines/pages * poenitentiales – Penitential Psalms * sine – without == References ==",
 "title": "Septuagint manuscripts"
}