{
 "id": "1116750",
 "text": "Baxter Academy for Technology and Science is a public charter school for grades 9–12 in Portland, Maine. It started in 2013 and is Maine's third charter school. The school is in a city and focuses on science, technology, engineering, and math (STEM). The first senior class graduated in June 2016. Baxter Academy is a high school that prepares students for college. It teaches science, technology, engineering, and math (STEM). Students at Baxter Academy work on hard problems, and use technology tools with help from scientists, engineers, and other professionals. Baxter Academy's students and teachers travel from many towns across Maine to get to school each day. A local bus company runs school bus routes to help students with longer distances to travel. The Greater Portland Metro Bus system is another common way for students to get to school as well as go to Downtown Portland. The school is special because it gives students more choices and freedom to help them get ready for the real world. One way it does this is by letting students go away from school during lunch to shop and eat, spending money in portland. The school also has something called 'Flex Friday' where students can work on long-term projects (1–4 years) related to what the student wants to do. They work on these projects every Friday when school is happening. Some projects include game and software development, robotics, and internships. On March 13, 2020, the school closed due to worries about COVID-19, and switched to remote learning. The school used this model for the whole 2020–2021 school year, even as other schools in the area reopened and new leaders were chosen. On August 1, 2021, an email was sent to students and staff saying the school would return to in-person classes by September 2021, with extra COVID-19 safety measures. In-person graduation ceremonies were held for the classes of 2022 and 2023. == References == == Other websites == * Category:High schools in the United States",
 "title": "Baxter Academy for Technology and Science"
}