{
 "id": "1116044",
 "text": "Egypt Future TV () was a privately owned Egyptian television channel that was launched in February 2007. It was the first channel to be launched in Egypt following the Egyptian revolution. The channel operates on Nilesat Frequency 11823-vertical and its slogan was \"The People Want to Liberate The Minds\". By 2020, it changed its name to FOX with COVID-19 pandemic. ==Channel launch== ===Founders=== The channel was launched before President Hosni Mubarak stepped down on February 11, 2011. Its ownership was first divided amongst three different people. The first was Ibrahim Eissa, a journalist known for his controversial journalistic career under Mubarak's regime. The second was Ahmed Abu-Haiba, a man known to be a supporter of Egypt's Muslim Brotherhood. The third was engineer Mohamed Morad. The founders were known for their participation in the 2011 Egyptian Revolution as opposition leaders. The channel first operated with limited funds and it announced on its Facebook page that it was the first of its kind because it was not associated with businessmen. ===Mission=== The founders had claimed that the channel aimed to voice the perspectives of the protesters while presenting a variety of political positions. Mohamed Morad stated that Ibrahim Eissa had first thought of the channel and explained that the television blackout that took place during the revolution had served as their inspiration. Eissa had recently launched a new newspaper in July 2011 also named Al Tahrir, but there is no connection between the channel and the newspaper. ==Criticisms== The channel had received various criticisms on a wide variety of issues. Former President Hosni Mubarak's sons, Alaa Mubarak and Gamal Mubarak criticized the channel for provoking its audience. There were also criticisms against the channel's highly political programs, and this triggered advertisers to depart from the channel claiming that the audience wishes to be exposed to a variety of programs that were not strictly political. Some also argued that the channel employed youth members who participated in Egypt's revolution but who do not have the appropriate skills to work in a television channel. ==Ownership changes== Controversy broke out regarding changes in the channel's ownership due to financial setbacks and the perceived impact of these changes on the channel's political position. It was announced in October 2011 that Eissa was giving away his share, which was estimated to cover 24% of the channel's total shares to Nabil Hasan Kamel and Dr. Said Tawfiq, two businessmen in Egypt. Morad and Abu-Haiba, the channel's two other owners, kept their original shares. This announcement came after some speculations that the two other owners, Morad and Abu-Haiba were teaming up against Eissa and that they were involved in trying to have other investors take over each other's ownerships. Sources had claimed that Abu-Haiba and Morad were to leave Eissa as the channel's main manager after they sell their shares to publisher Walid al- Moallem and businessman Ahmed Heikal. But these speculations were revoked following Eissa's decision. The controversy surrounding the channel's new owners took a different turn, when speculations arose about the political stance of businessman Nabil Hasan Kamel who partially took over Eissa's share. There were claims by a Muslim Brotherhood specialist, Mohamed Taima, that Kamel belonged to the Muslim Brotherhood, and this triggered the assumption that the channel would not be as revolutionary as it had claimed to be when it was first launched. Owner Abu-Haiba then clarified that the talk show, Fil Midan (In the Square) would maintain and represent the channel's revolutionary stance. Abu-Haiba also announced that the channel was considering the diversification of its programs to include other non-political shows focusing on religion, sports, and art that pertained to a wider range of the Egyptian society. In December 2011, businessman Suleiman Amer bought Tawfiq's shares and owned 84% of the channel's shares. This change in the channel's ownership triggered a series of criticisms by the channel's television reporters and led to major controversies. ==Program controversies== Several of the channel's programs were subjected to controversies that threatened the sustainability of the programs and/or their television hosts. ===Fil Midan=== Fil Midan was a program that alternated between different television hosts on different days. Four prominent individuals have hosted the program: Ibrahim Eissa, Bilal Fadl, Mahmoud Saad, and Amr El-Leithy. In September 2011, Fadl had temporarily stopped hosting his portion of the show. But in October 2011, he announced via his Twitter account that he had permanently left the channel. In September 2011, Saad also quit the program and the channel due to personal reasons that he did not wish to expose. El-Leithy similarly decided to quit hosting the program in October 2011. In February 2012, Eissa quit Fil Midan and now no longer works for the channel. Fil Midan was now hosted by another individual. ===Qalam Rūsas=== Qalam Rūsas was a program hosted by journalist Hamdy Kandeel. In December 2011, shortly after Amer buys Al Tahrir TV, Kandeel stopped airing his show and threatened to leave the channel if it does not maintain its revolutionary vision. Kandeel feared that the change in ownership would instigate a change in the channel's political stance. He gave the channel a ten-day grace period to rethink its decision. In January 2012, after four weeks of the show's suspension, Kandeel decided to permanently end his contract with the channel. This announcement came after Kandeel had decided to resume the show when the channel's board confirmed the channel's unchanging policies and confirmed that the channel would not intervene with his show. However, Kandeel changed his mind for unexplained reasons and now no longer works with the channel. ===Talk Shows=== Talk Shows was a program hosted by television host Doaa Sultan. The program airs clips from other private, state and online talk shows about specific themes. In January 2012, the program was due to air an episode titled \"Celebrating What on the 25th of January?\" The episode was scheduled to air during the regular hours of the program on Fridays, but instead, the channel aired a television series. The channel announced that this was due to a technical difficulty. On her Facebook page, Sultan first reiterated the management of Al Tahrir TV's technical difficulty reasoning. However, later on, she posted that Al Tahrir TV had deliberately prevented the channel from airing and that she was planning to film the episode again from her house to post it online. Mohamed Al-Barghouti, the manager of Al Tahrir TV refuted such claims and argued that the episode was too long and that this was the reason it was not aired. Sultan dismissed this claim and further claims by Egypt Future TV that she had submitted the episode to the channel's management late. The heated arguments between Sultan and Al Tahrir TV were particularly present on Facebook. Sultan posted a link to the banned episode on YouTube after it was reshot at her own expense. ===Al Youm=== Dina Abdulrahman was the television host of Al Youm. On February 11, 2012, Abdulrahman was not permitted to present her daily show Al Youm on Al Tahrir TV. The channel indicated that this was as a result of disagreements regarding Abdulrahman's contract. However, Abdulrahman dismissed these claims, and argued that she was not permitted to present her show because of a conflict with the channel's board who wanted to have a say in the show's editorial policies by introducing some changes to the contract. Sources indicate that the channel's board initiated a conversation about a contractual change after Abdulrahman aired a clip from the controversial anti-Supreme Council of the Armed Forces (SCAF) campaign Askar Kazeboon during her show. In the past, the contract did not give the channel's board the privilege of participating in the show's editorial policies. A new television host presented the show. In response, Abdelrahman completed a file report against the channel's main leaders, including the channel's owner Suleiman. Abdulrahman was involved with an earlier controversy while she hosted the morning show on Dream TV. She was fired from the channel in February 2007 similarly after discussing on air a newspaper article written by a journalist who criticized the Egyptian military. During the same episode of her show, she confronted a major general about the article. ==Abbasiya attack== In February 2007, Al Tahrir TV reporters, along with other television reporters, were attacked during a pro-Supreme Council of the Armed Forces (SCAF) rally in Abbasiya Square in Cairo. ==Name change== In March 2020, Al Tahrir TV announced it will change its name to FOX by March 23, 2020. ==References== Category:21st-century establishments in Egypt Category:2007 establishments in Africa Category:Arabic-language television stations Category:Television stations in Egypt",
 "title": "Egypt Future TV"
}