{
 "id": "1116837",
 "text": "The Nigeria national under-20 football team represents Nigeria in international football completions. They have attended the FIFA U-20 World Cup 12 times with its best placing as runners-up twice in 1989 and 2005. ==Competitive record== ===FIFA U-20 World Cup record=== ** 1983 - Group stage ** 1985 - Third place ** 1987 - Group stage ** 1989 - Runners-up ** 1999 - Quarter-finals ** 2005 - Runners-up ** 2007 - Quarter-finals ** 2009 - Round of 16 ** 2011 - Quarter-finals ** 2013 - Round of 16 ** 2015 - Round of 16 ** 2019 - Round of 16 ** 2023 - Quarter-finals ===Africa U-20 Cup of Nations record=== Africa U-20 Cup of Nations Africa U-20 Cup of Nations Africa U-20 Cup of Nations Africa U-20 Cup of Nations Africa U-20 Cup of Nations Africa U-20 Cup of Nations Africa U-20 Cup of Nations Africa U-20 Cup of Nations Africa U-20 Cup of Nations Year Round Position GP W D* L GS GA 1977 Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter 1979 Semi-finalists 3rd 4 1 2 1 4 3 1981 Semi- finalists 3rd 4 1 0 3 7 8 1983 Champions 1st 8 5 1 2 13 7 1985 Champions 1st 8 4 2 2 14 8 1987 Champions 1st 8 6 1 1 11 9 1989 Champions 1st 8 5 3 0 16 6 1991 Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter 1993 Group stage 5th 3 1 0 2 2 2 1995 Third place 3rd 5 3 1 1 8 6 1997 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1999 Second place 2nd 5 3 1 1 11 5 2001 Group stage 8th 3 0 1 2 1 6 2003 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2005 Champions 1st 5 5 0 0 11 3 2007 Second place 2nd 5 2 1 2 6 6 2009 Third place 3rd 5 3 0 2 8 5 2011 Champions 1st 5 4 0 1 9 4 2013 Third place 3rd 5 3 0 2 6 5 2015 Champions 1st 5 4 0 1 12 4 2017 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2019 Fourth place 4th 5 2 1 2 4 1 2021 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2023 Third place 3rd 6 4 0 2 8 2 Total 18/23 7 titles 97 56 14 27 151 90 A gold background colour indicates that Nigeria won the tournament. *Draws include knockout matches decided on penalty kicks. *There was no third place match from 1979-1989. == References == Category:Football in Nigeria Category:African national under-20 football teams Category:National sports teams of Nigeria",
 "title": "Nigeria national under-20 football team"
}