{
 "id": "1116303",
 "text": "The Bachur Khokani was a Koli chieftain and freedom fighter from Gujarat state of India. He led the Indian independence movement in Kheda district of the state. == Rebellion == In 1808, Bachur Khokani collected a revolutionary army of Kolis of Kheda district and then attacked and plundered the British controlled territory of Dholka town along with nearby villages. Bachur Khokani was captured by British troops and sent to Dholka jail. On 20 February 1808 , a revolutionary group of Kolis attacked at dholka jail and released the Khokani and other revolutionaries and same night Khokani plundered the town. In an attempt to prevent further raids on Dholka, Kheda's magistrate, R. Holford, coordinated a plan that required local elites within the East India company control to capture the rebels.\" Holford recognized the limitations of the EIC's power to arrest individuals residing outside its control, but he believed that officials could force the elites who had villages within their legal jurisdiction to cooperate. Holford wrote to an individual named M. F. M. Purmar for this specific purpose. The outcome of the official strategy had some success: in 1810, large numbers of Kolis led by Khokani had been arrested and convicted of crimes against the EIC. Judge H. W. Diggle recommended that the rebels be transported out of the locality to the British colony the Prince of Wales Island (for merly called Penang), or to a distant jail, for a minimum of seven years. It was argued that such an extreme measure would \"overawe\" and \"check the daring and ferocious nature\" of Kolis while simultaneously serving as a deterrent for others. However, again after capture of Bachur Khokani, a group of four hundred to five hundred armed Kolis seized the jail at Kheda and released him and the imprisoned Kolis. Most of the rebels dispersed into areas outside of British jurisdiction and were saved just days before being transported to the Prince of Wales Island. In 1824, British government sought the help from Baroda State of Gaekwad Maharajas and captured a large number of rebels and their leader Bachur Khokani. He was tried and hanged. == References == Category:Koli people",
 "title": "Bachur Khokani"
}