{
 "id": "1116213",
 "text": "Menasha is a city in Calumet and Winnebago counties in the U.S. state of Wisconsin. As of the 2020 census, 18,268 people live in Menasha. ==History== Ancestors of the Ho-Chunk occupied what is currently Menasha. In the 1600s, the Meskwaki established a village just north of Menasha. A surprise attack by French soldiers and traders resulted in the deaths of nearly all Meskwaki residing in the area. The bodies were subsequently interred in a large mound, known as Butte des Morts (\"Hill of the Dead\"), which served as a prominent landmark until its destruction by the Chicago and North Western Railway in 1863. In 1836, the land was ceded to the United States in the Treaty of the Cedars. This opened up land for public sale, and territorial governor James Duane Doty was one of the first investors in the land. In 1848, Doty and his associates, including Curtis Reed, formed the town of Menasha on the channel north of Doty Island. In 1849, Reed and Doty were successful in convincing the United States government to place the navigational channel of the Fox- Wisconsin waterway through the north channel in Menasha. In 1854 Menasha approved $150,000 in bonding to bring the Manitowoc & Mississippi Railroad in with the intent of establishing Menasha as the principal transportation axis in Wisconsin. Menasha was incorporated as a city in 1874, and at that point was considered to be a transportation hub. The early 1900s saw a shift to industrial production of general and specialized papers. Menasha was home to many paper mills including the George A. Whiting Paper Company Mill, the John Strange Paper Mill, Island Paper Company, and Gilbert Paper Company, to name a few. Menasha was also home to the George Banta Publishing Company which published textbooks, military manuals, yearbooks, and magazines. Menasha Corporation also called Menasha home. It was established in 1849 by Elisha D. Smith as Menasha Wooden Ware. It produced wooden containers like butter tubs and barrels and eventually became the world's largest wooden ware products manufacturer. After wooden ware products fell out of use in the early 1900s, Menasha Wooden Ware shifted to the corrugated packaging business, changing its name to Menasha Corporation. ==Geography== Menasha is located at (44.2129, −88.4362). According to the United States Census Bureau, the city has a total area of , of which, is land and is water. ==Parks and recreation== The 91-acre Heckrodt Wetland Reserve is an urban nature reserve with habitats including forested wetland, cattail marsh, open water, created prairie, open field, and upland forest. The University of Wisconsin–Oshkosh, Fox Cities Campus houses the Weis Earth Science Museum and the Barlow Planetarium. Menasha contains numerous parks. It has a public pool located in Jefferson Park.https://cms5.revize.com/revize/menasha/Park%20list2020.pdf Smith Park is the oldest park in the Menasha Park system, established in 1897. A railroad caboose in Smith Park commemorates the original Wisconsin Central Railroad. At the southern end of the park are several Native American burial mounds and a natural amphitheater used for summer concerts. The north end of the park features semi-formal gardens planted each year with approximately 6,000 annuals, a setting that is a favorite for summer weddings. A gazebo funded with corporate donations was built in this area in 1997.https://cms5.revize.com/revize/menasha/Parks%20&%20Rec/4.OpenSpacePlan_Final_Resolution_8-2012.pdf ==Education== Menasha's Public School system, called the Menasha Joint School District has one high school (Menasha High School), one middle school, and five elementary schools. Parochial education is offered at St. Mary Catholic Elementary School, Bethel Lutheran School (elementary and middle), and Trinity Lutheran School (elementary and middle). Menasha is home to the University of Wisconsin–Oshkosh, Fox Cities Campus, a two-year campus part of the UW System. ==Friendly cities== * Maebashi, Japan == Notes == ==External links== * City of Menasha * Category:Cities in Wisconsin Category:Calumet County, Wisconsin Category:Winnebago County, Wisconsin",
 "title": "Menasha, Wisconsin"
}