{
 "id": "1116784",
 "text": "Roller printing is a textile printing process created by Thomas Bell of Scotland in 1783. He was trying to make copperplate printing cost less. This method was used in Lancashire cloth mills to produce cotton dress cloth from the 1790s. Advancements in the technology resulted in more elaborate roller prints in bright, rich colours from the 1820s. ==Engraved copperplate printing== The printing of textiles from engraved copperplates was first practiced by Bell in 1770. It was no longer common in England after 1900.Strauss, Victor (1967). The printing industry: an introduction to its many branches, processes, and products. Washington: Printing Industries of America. ==Roller printing machines== In its simplest form the roller- printing machine consists of a strong cast iron cylinder mounted in adjustable bearings capable of sliding up and down slots in the sides of the rigid iron framework. Beneath this cylinder the engraved copper roller rests in stationary bearings and is supplied with colour from a wooden roller that revolves in a colour-box below it. The copper roller is mounted on a stout steel axle, at one end of which a cogwheel is fixed to gear with the driving wheel of the machine, and at the other end a smaller cogwheel to drive the colour-furnishing roller. The cast iron pressure cylinder is wrapped with several thicknesses of a special material made of wool and cotton lapping, the object of which is to provide the elasticity necessary to enable it to properly force the cloth to be printed into the lines of engraving.Mastering the Art of Fabric Printing and Design. Laurie Wisbrun. 2012. 208 pag. , ==References== ==Bibliography== *Takeda, Sharon Sadako, and Kaye Durland Spilker, Fashioning Fashion: European Dress in Detail, 1700 – 1915, Prestel USA (2010), *Tozer, Jane and Sarah Levitt, Fabric of Society: A Century of People and their Clothes 1770–1870, Laura Ashley Press, Category:Scottish inventions Roller printing",
 "title": "Roller printing on textiles"
}