{
 "id": "1116783",
 "text": "In the Holocaust, Nazi Germany set up ghettos across Europe. These were separate, closed-off areas where the Nazis forced Jewish people to live, apart from everybody else. Some Roma people, Greeks, and Soviets were also forced into ghettos. Nobody was allowed to leave the ghettos without special permission. Living conditions were so terrible that they killed many people. Tens of thousands of Jews died in ghettos from starvation, disease, freezing to death, and the terrible conditions. In some ghettos, one in every five people died. Eventually, the Nazis used the ghettos to collect people before deporting them to concentration camps. The Nazis established around 1500 ghettos during the Holocaust. They liquidated nearly all of these ghettos between the 1930s and 1945. Sometimes this meant sending everyone to concentration camps and shooting people who resisted. In other cases, the Nazis executed all of the people inside the ghetto. == Purposes == The Nazis used ghettos for many reasons: * To segregate people (almost always Jews) * To persecute and mistreat people * To make people do forced labor * To gather and hold people before deporting them to concentration camps * To starve and kill people == History == Jewish people had often been forced to live in ghettos in Europe, with the first one being set up in Venice in the 1500s. The first Nazi ghetto was established in Beuthen, Germany, in the 1930s. Between that time and the end of World War II in 1945, the Nazis and their collaborators established about 1500 ghettos. They stretched as far west as Amsterdam in German-occupied Netherlands; as far north as Pushkin in partially German- occupied Russian SFSR; as far east as Krasno-Vostochnyi, also in partially German-occupied Russian SFSR; and as far south as Kalavyrta in partially German-occupied Greece.In 1939 Nazi Germany invaded Poland, and took control of areas where two million Polish Jews lived. This was four times as many Jewish people as Germany had in 1933. Two years later the Nazis invaded the Soviet Union, where another few million Jews lived. To control this new population of Jewish people, the Nazis forced Jews into ghettos (also called \"Jewish residential quarters\"). By mid-1941, the Nazis had forced almost all Jews in Nazi-occupied Poland into ghettos. By the end of the war, almost every person who had lived in a ghetto had died or been executed by the Nazis. The last ghetto to exist was the Theresienstadt \"camp-ghetto\" in the town of Terézin, in German-occupied Czechia. It was liberated on 8 May 1945, while the Nazis were liquidating the ghetto (deporting everyone inside, shooting anyone who resisted, and destroying the ghetto.) == Conditions == Conditions in the ghettos were terrible. They were often extremely crowded, and there was not enough food for everyone. The largest (the Warsaw ghetto) held more than 400,000 Jews crowded into an area of 1.3 square miles (3.4 square km). Starvation was widespread. Contagious diseases spread quickly because of the overcrowding and lack of sanitation. In the winter months, freezing to death was common. Historians estimate that tens of thousands of Jews starved, froze to death, or died from illness in the Nazi ghettos. == Types of ghettos == Historians have different opinions about how many ghettos existed in Nazi- occupied Europe. There were some smaller and lesser-known ghettos. (These include Voikovshtadt Ghetto in Kerch Raion, Crimea, and three little-known ghettoes in Stavropol Krai, Russia: the Krasno-Vostochnyi, Georgiyevsk, and Kislovodsk Ghettos.) There may still be ghettos whose names and locations have been forgotten. === Closed ghettos === Closed (or \"enclosed\") ghettos were surrounded by fences, walls, or barbed wire. A person could be executed for trying to escape from an enclosed ghetto - or for helping someone else escape. The largest ghetto in Nazi-occupied Poland, the Warsaw Ghetto, was surrounded by a brick wall. The Minsk and Lwow Ghettos are examples of ghettos enclosed by barbed wire. In the Soviet Union, ghettos in Riga, Glebokie, Daugavpils, and Mir were enclosed. In May 1942 the residents of the Mir Ghetto were transferred to Mir Castle Ghetto, supposedly for better security. === Open ghettos === Open ghettos did not have physical barriers separating them from other parts of town. However, Jews were not allowed to come and go freely. There were rules about when and why they could enter and leave the ghetto. In Poland, there were open ghettos in Dąbie and Zdunska Wola. In Ukraine, the Tuczyn and Uman Ghettos were open. So were the Bielefield Ghetto in Germany; the Mainewicze Ghetto in Volhynia; and the Gnivan Ghetto in GK Zhytomor. In Eastern Belorussia, open ghettos existed in Beshenkovichi, Ostrovno Ghetto, and Chasniki. The Chasniki Ghetto was liquidated in mid-February 1942, six months after it was established. === Partial ghettos === In a few places, only part of the Jewish population had to live in ghettos. These included the Domaczewo, Horochow, Byten, and Letichev Ghettos. === Destruction ghettos === According to the Holocaust Encyclopedia: > Destruction ghettos were tightly sealed off and existed for between two and > six weeks before the Germans and/or their collaborators deported or shot the > Jewish population [gathered] in them. In Belarus, destruction ghettos existed in Parichi and Orsha. In Ukraine, the Samgorodok Ghetto lasted just a few weeks in May 1942 before the Nazis liquidated it. Also in Ukraine, the Khar'kov (Kharkiv) Ghetto was well-known for being short-lived, makeshift, and overcrowded. In Crimea, there was a destruction ghetto in Dzhankoi. == Ghettos in occupied Poland == Ghetto location in prewar and postwar PolandLocation names in other languages are available through the active links. Population Date of creation Date of liquidation (deporting or killing people) Final destination (in alphabetical order) (year, month) (year, month) 1939–1940 The first ghetto (Piotrków Trybunalski Ghetto) was set up on 8 October 1939, 38 days after the German invasion of Poland on 1 September 1939. Within months, the Warsaw Ghetto and the Łódź Ghetto, had been set up. Aleksandrów Lódzki 3,500 1939 to Głowno ghetto Bełżyce 4,500 to Budzyń ghetto → Sobibor and Majdanek Będzin Ghetto 7,000–28,000Maciej i Ewa Szaniawscy, \"Zagłada Żydów w Będzinie w świetle relacji\" (Extermination of Jews in the light of testimony) . According to 1946 research by Wojewódzka Żydowska Komisja Historyczna in Katowice, wrote Maciej i Ewa Szaniawscy, there were around 30,000 Jews in Będzin following the invasion, including those who came in from neighbouring settlements. Between October 1940 and May 1942, the first 4,000 Jews were deported. In May 1942 additional 2,000 and in August, 5,000 more. Deportations between August 1942 and mid June 1943 amounted to additional 5,000. On 22 June 1943 the next transport of 5,000 Jews departed to Auschwitz, and finally, between 1–3 August 1943, the remaining 8,000 were sent away. The dispersed Jews who stayed, amounting to 1,000 persons, were deported between early October 1943 and July 1944. In total, about 28,000 Jews are believed to have been deported from the Będzin Ghetto. This information however, is not confirmed by the two main sources of the remaining data nor the Jewish Historical Institute, listing only 7,000 victims. to Auschwitz (7,000).Będzin in the Jewish Historical Institute community database. Warsaw. Błonie 2,100 to Warsaw Ghetto (all 2,100) Bodzentyn 700 1940 to Suchedniów ghetto → Treblinka.Iwona Pogorzelska, Bodzentyn od 1869 roku do niepodległości. Polska.pl. Accessed June 16, 2011. Brześć Kujawski 630 1940 to Łódź Ghetto → Chełmno death camp Brzesko 4,000-6,000 fall 1941 Sept 1942 to Auschwitz and Belzec Brzeziny 6,000–6,800 to Łódź Ghetto → Chełmno Brzozów 1,000 1940 to Bełżec extermination camp Bychawa 2,700 1940 to Belzyce Chęciny 4,000 to Treblinka Ciechanów 5,000 1940 to labour camps (1,500), Mława Ghetto → Auschwitz, many killed locally. Dąbrowa Górnicza 4,000–10,000 1940 to Auschwitz Dęblin–Irena Ghetto 3,300–5,800 to Sobibor and Treblinka Działoszyce 15,000? to Płaszów and Bełżec extermination camp Gąbin 2,000–2,300 1940 to Chełmno extermination camp Głowno 5,600 to Łowicz ghetto and Warsaw Ghetto (5,600) Gorlice (labor camp 1st) ? 1940 1942 to Buchenwald, Muszyna, Mielec, see Gorlice Ghetto (1941) Góra Kalwaria 3,300 to Warsaw Ghetto (3,000), 300 killed locally Grodzisk Mazowiecki 6,000 to Warsaw Ghetto (all 6,000) Grójec 5,200–6,000 to Warsaw Ghetto (all 6,000) → Treblinka Izbica Kujawska 1,000 1940 to Chełmno extermination camp Jeżów 1,600 1940 to Warsaw Ghetto (all 1,600) Jędrzejów 6,000 to Treblinka Kazimierz Dolny 2,000–3,500 to Sobibor, and Treblinka Kobyłka 1,500 to Treblinka Koło 2,000–5,000 to Treblinka (2,000) and Chełmno Koniecpol 1,100–1,600 1940 to Treblinka Konin 1,500? to Zagórów & other ghettos → killed locally Kozienice 13,000 to Treblinka Koźminek 2,500 1940 to Chełmno Krasnystaw 2,000 to Bełżec extermination camp Krośniewice 1,500 to Chełmno extermination camp Kutno 7,000 to Chełmno Legionowo 3,000 1940 1942 to Treblinka Łańcut 2,700 to Bełżec extermination camp Łask 4,000 to Chełmno extermination camp Łowicz 8,000–8,200 1940 to Warsaw Ghetto (all; with labor camp)\"Getto w Łowiczu,\" at Miejsca martyrologii, Wirtualny Sztetl. Instytut Adama Mickiewicza. Łódź Ghetto 200,000 to Auschwitz and Chełmno extermination camp, labour camps (1,000) Marki ? 1942 to Warsaw Ghetto Mielec 4,000–4,500 1940 to Bełżec extermination camp 5,000–7,000 to Treblinka, 1,300 killed locally Mława 6,000–6,500 to Treblinka and Auschwitz Mogielnica 1,500 1940 to Warsaw Ghetto (all) → Treblinka. Mordy 4,500 to Treblinka Myślenice 1,200 1940 to Skawina Ghetto (all) → Bełżec Nowy Dwór Mazowiecki 2,000–4,000 to Pomiechówek ghetto → Auschwitz Nowy Korczyn 4,000 1940 to Treblinka Opoczno 3,000–4,000 to Treblinka Otwock 12,000–15,000 to Treblinka, and Auschwitz Pabianice 8,500–9,000 to Łódź Ghetto → Chełmno death camp Piaseczno 2,500 1940 to Warsaw Ghetto (all 2,500) Piaski (transit) 10,000 1940 to Bełżec extermination camp, Sobibor, Trawniki concentration camp Piotrków Trybunalski Ghetto 25,000Piotrków Trybunalski – Getto w Piotrkowie Trybunalskim. Virtual Shtetl. Museum of the History of the Polish Jews. Accessed July 1, 2011. to Majdanek and Treblinka (22,000), killed locally also Płock 7,000–10,000 1939–1940 to Działdowo ghetto Płońsk 12,000 to Treblinka, Auschwitz Poddębice 1,500 to Treblinka(?) Pruszków 1,400 1940 1941 to Warsaw Ghetto (all 1,400) Przedbórz 4,000–5,000 to Bełżec extermination camp and Treblinka Puławy 5,000 1940 to Opole Lubelskie → Sobibor Radomsko 18,000–20,000 to Treblinka extermination camp (18,000) Radzymin 2,500 to Treblinka Serock 2,000 to other ghettos Sieradz 2,500–5,000 to Chełmno extermination camp Sierpc 500–3,000 1940 to Warsaw Ghetto → Treblinka Skaryszew 1,800 1940 to Szydlowiec Skierniewice 4,300–7,000 to Warsaw Ghetto (all 7,000) Sochaczew 3,000–4,000 to Warsaw Ghetto (all 3,000) Stalowa Wola 2,500 1940 to Bełżec extermination camp Stryj 12,000 1940–1941 to Bełżec extermination camp Szadek 500 1940 1940 to other ghettos Szczebrzeszyn 4,000 to Bełżec death camp, killed locally also Tomaszów Mazowiecki 16,000–20,000 to Treblinka (16,000), with 4,000 killed locally Tuliszków 230 Dec 1939 to Kowale Pańskie → Chełmno Turek 5,000 1940 to Kowale Pańskie ghetto (all 5,000) Tyszowce 1,500–2,000 1940 to Bełżec extermination camp Uchanie 2,000 1940 to Sobibor Ulanów 500 1940 to other ghettos Uniejów 500 1940 to Kowale Pańskie ghetto (all 500) Warka 2,800 1940 to Warsaw Ghetto (all 2,800) Warta 1,000–2,400 to Chełmno extermination camp Warsaw Ghetto 445,000 to Treblinka extermination camp (300,000), and Majdanek, Trawniki, Poniatowa Włocławek 4,000–13,500 to Chełmno extermination camp Włodawa 10,500 Deportations to Sobibór took place in waves: 1,300 Jews in May 1942, 5,400 in October, 2,800 in November 1942, and 2,000 in April 1943. to Sobibor, also shot locally Włoszczowa 4,000–6,000 to Treblinka Wodzisław 4,000 to Treblinka Wołomin 3,000–5,500 1940–1942 to Treblinka Wyszogród 2,700–3,000 to Treblinka Zagórów 2,000–2,500 all killed locally Zamość 12,000–14,000 to Izbica Ghetto → Bełżec, Majdanek Zduńska Wola 8,300–10,000 1940 to Chełmno extermination camp Żychlin 2,800–4,000 to Chełmno extermination camp Żyrardów 3,000–5,000 to Warsaw Ghetto (all 5,000) 1941 Under the codename Operation Barbarossa, Germany invaded the Soviet Union on 22 June 1941. The Nazis created new ghettos there and used mobile killing squads to murder Eastern European Jews. Augustów 4,000 to Treblinka and Auschwitz, shot locally Bełchatów 5,500–6,000 to Chełmno extermination camp Biała Podlaska 7,000–8,400 to Majdanek, Sobibor, Treblinka Biała Rawska 4,000 to Treblinka Białystok Ghetto 40,000–50,000 to Majdanek, Treblinka Bielsk Podlaski 11,000–15,100 to Treblinka, many killed locally Biłgoraj 2,500–3,000 1941–1942 to Bełżec extermination camp Bobowa 658?Holocaust: \"The Jews in the County of Cracau (sic).\" The JewishGen ShtetLinks. Accessed June 28, 2011. to Gorlice and Biecz ghettos Bochnia 14,000–15,000 to Szebnie → Bełżec and Auschwitz Brześć Litewski Ghetto 18,000 5,000 shot locally before the ghetto was set up → Bronna Góra ravine Busko Zdrój 2,000 1941 to Treblinka Chełm 8,000–12,000 to Sobibor Chmielnik 10,000–14,000 to Treblinka Chodel 1,400 1942 to other ghettos Chrzanów 8,000 to Auschwitz Ciechanowiec 4,000 1941 to Treblinka Ciepielów 600 Yitzhak Arad, Belzec, Sobibor, Treblinka: The Operation Reinhard Death Camps. Indiana University Press. \"Appendix A.\" p. 395. to Treblinka → Polish rescuers killed locally 6 Dec 1942.\"Życie za Życie\" (Righteous of Ciepielów who paid the ultimate price).\" Urząd Gminy w Ciepielowie. . Accessed July 6, 2011. Czeladź 800 to Auschwitz Częstochowa Ghetto 48,000 to Treblinka extermination camp Ćmielów 1,500–2,000?\"Ćmielów – Historia,\" Muzeum Historii Żydów Polskich Wirtualny Sztetl (Museum of the History of the Polish Jews). Accessed July 6, 2011. 1941 to Treblinka (900), rest murdered locally Dąbie 900 1941 to Chełmno extermination camp Dobre 500–1,000 1941 to Treblinka Drohiczyn 700 to Bransk and Bielsk ghettos Drzewica 2,000 1941 to Treblinka Dubienka 2,500–3,000 to other ghettos Głogów Małopolski (120)? 1941 1942 to Rzeszów ghetto → 5,000 shot locally Gniewoszów (open type) 6,580 to Zwoleń (5,000); 1,000 → Treblinka Goniądz 1,000–1,300 to Bogusze ghetto Gorlice 4,500 to Bełżec extermination camp Gostynin 3,500 1941 to Chełmno extermination camp Grajewo 3,000 to Bogusze ghetto Hrubieszów (open type) 6,800–10,000 to Sobibor and Budzyn labour camp, many shot locally, 2,000 fled.The Hrubieszow Genealogy Group. ShtetLinks Project. Accessed June 30, 2011. Iłża 1,900–2,000 1941 to Treblinka Inowłódz 500–600 1941 to Tomaszow Mazowiecki ghetto Iwacewicze 600 1941 to Słonim Ghetto, all killed locally Izbica Ghetto (transit) 12,000–22,700. Pamięć Miejsca. Retrieved April 12, 2012. 1941 to Bełżec extermination camp and Sobibor, 4,500 killed locally Jasło 2,000–3,000 1941 to other ghettos Jedwabne 100–130 to Łomża Ghetto → Treblinka, 340 killed locally.The 90th session of the Senate of the Republic of Poland. Stenograph, part 2.2. A Report by Leon Kieres, president of the Institute of National Remembrance, for the period from July 1, 2,000 to June 30, 2001. Donald Tusk presiding. See statement by Senator Jadwiga Stokarska. Kalisz 400 1941 1942 to other ghettos Kałusz 6,000 to Bełżec extermination camp, several hundreds executed locally Karczew 700 to Warsaw Ghetto Kielce Ghetto 27,000 to Treblinka, with 6,000 killed locally Kłobuck 2,000 1941 to Auschwitz Knyszyn 2,000 to Bialystok Ghetto Kobryn 8,000 all killed locally Kock 2,500–3,000 to Treblinka Kodeń ? to Miedzyrzec Podlaski Ghetto Kolbuszowa 2,500 1941 to Bełżec extermination camp Koluszki 2,000 1941 to Treblinka Końskie 10,000 1941 to Treblinka Korczyn 2,000 1941 to Bełżec extermination camp Kraków Ghetto 20,000 (pop. 68,500) to Bełżec extermination camp and Płaszów; 48,000 expelled in 1940.Kraków – History. Page 3. Virtual Shtetl, Museum of the History of Polish Jews. Accessed July 12, 2011. Kraśnik 5,000–6,000 1940–1941 to Bełżec extermination camp Krynki 5,000–6,000 to Kiełbasin transit camp → TreblinkaNiemiecki obóz tranzytowy Kiełbasin w Grodnie (wul. Sołamawaj) (Kiełbasin transit camp), Virtual Shtetl, POLIN Muzeum Historii Żydów Polskich 2015. Accessed November 15, 2015. Książ Wielki 200?Jack Kugelmass, Jonathan Boyarin, Zachary M. Baker, From a ruined garden: the memorial books of Polish Jewry, United States Holocaust Memorial Museum. Accessed June 27, 2011. 1941 to Miechów ghetto Kunów 500 1941 to Treblinka Limanowa 2,000 1941 to Bełżec extermination camp Lipsk 3,000 to Treblinka Lubartów Ghetto 3,269–4,500 to Bełżec extermination camp Lublin Ghetto 30,000–40,000 to Bełżec extermination camp (30,000) and Majdanek (4,000) Lwów Ghetto 115,000–160,000 to Bełżec extermination camp and Janowska concentration camp Łapy 600 to Białystok Ghetto Łaskarzew 1,300 1941 to Treblinka Łęczyca 3,000–4,300 1941 to Chełmno, many killed locally Łomża Ghetto 9,000–11,000 to Auschwitz, many killed locally Łosice 5,500–6,000 1941 to Treblinka Łuków 10,000 1941 to Treblinka (Oct: 7,000; Nov: 3,000) \"Treblinka Death Camp Day-by-Day,\" at Holocaust Education & Archive Research Team (www.HolocaustResearchProject.org). Accessed June 30, 2011. Łuck Ghetto 25,000 all killed locally (most at Polanka) YIVO Encyclopedia of Jews in Eastern Europe, Lutsk. \"Following the Soviet liberation of Łuck in February 1944, only about 150 Jews returned. By 1959, just 600 Jews were living in Lutsk. The fortified synagogue was turned into a movie theater and later into a sports hall. A residential area was constructed on the site of the Rabbinite and Karaite cemeteries.\" Maków Mazowiecki 3,500–5,000 1941 to Treblinka Michałowo 1,500 1941 to Bialystok Ghetto Miechów 4,000 1941 1942 to Bełżec (1,000 killed locally) Nowe Miasto 3,700 1941 to Treblinka (3,000), rest killed locally Nowogródek 6,000? all killed locally Nowy Sącz Ghetto 20,000 to Bełżec extermination camp Nowy Targ 2,500 1941 to Bełżec extermination camp Nowy Żmigród 1,300 1941 all killed locally Olkusz 3,000–4,000 1941 to Auschwitz Opatów Ghetto 10,000 1941 to Treblinka Opole Lubelskie 8,000–10,000 1941 to Sobibor and Poniatowa ghetto Osiek 500 1941 to Ożarów ghetto → Treblinka Ostrowiec Świętokrzyski 16,000 to Treblinka Ozorków 3,000–5,000 1941 to Łódź Ghetto → Chełmno Pajęczno 3,000 1941 1942 to Łódź Ghetto Parczew 7,000 1941 to Treblinka Piątek ? 1941 to Chełmno extermination camp Pilzno 788? 1941 to Bełżec extermination camp Pińczów 3,000–3,500 1941 to Treblinka Pionki (labor camp) 682 1941 to Zwoleń ghetto → Treblinka Połaniec 2,000 1941 1942 to Chełmno extermination camp Praszka ? 1941 to Chełmno extermination camp Rabka 300 1941 to Bełżec extermination camp Radom Ghetto 30,000–32,000 to Treblinka extermination camp Radomyśl Wielki 1,300? 1941 1942 to Bełżec extermination camp Radoszyce 3,200?Piotr Berghof, \"Radoszyce, wspomnienie o żydowskich mieszkańcach miasteczka.\" . Accessed June 27, 2011. 1941 to Treblinka Radzyn Podlaski 2,000–3,000 1941 to Treblinka Rajgród 1,200 1941 to Bogusze Rawa Mazowiecka 4,000 1941 to Treblinka Rejowiec 3,000 1941 1943 to Auschwitz, Sobibor and Majdanek Ropczyce 800 1941 to Bełżec extermination camp Ryki 1,800–3,500 1941 to Treblinka and Sobibor Rymanów 1,600? 1941 to Kraków Ghetto, Bełżec extermination camp, killed locally Sędziszów Małopolski 2,000 1941 to Bełżec Siedlce Ghetto 12,000–18,000 to Treblinka Siemiatycze 7,000 1941 to Sobibor Sieniawa 3,000 1941 1942 all killed locally Siennica 700? 1941 to Treblinka (700) Skarżysko- Kamienna 3,000 1941 1942 to Treblinka (2,500), the rest killed locally Skrzynno ? 1941 to Opoczno ghetto Słonim Ghetto 22,000 Słonim – History. Jewish community. Virtual Shtetl. Museum of the History of Polish Jews. Accessed July 7, 2011. The prewar Polish city of Słonim was overrun by the Red Army in September 1939 and confiscated as part of Western Belarus. The influx of refugees from Nazi-occupied Poland increased its Jewish population to 27,000. Over 1,000 were deported to Siberia by the NKVD. Following German invasion of USSR, the ghetto was set up in August 1941, but mass executions began already on 17 July (1,200 men shot just outside the city). A second shooting action took place on 14 November 1941 with 9,000 killed. The ghetto was burned to the ground with all its inhabitants between 29 June and 15 July 1942 following a revolt. Only about 500 managed to escape. all killed locally (Jul-41: 1,200; Nov: 9,000; Jul-42: 10,000) Słuck 3,000–8,500 all killed locally Sokołów Małopolski 3,000 1941 to Bełżec Sokołów Podlaski 4,000–7,000 to Treblinka Sokółka 8,000–9,000 to Kiełbasin → Treblinka Solec 800 1941 to Tarlow ghetto Stanisławów Ghetto 20,000 killed locally → to Bełżec Starachowice 6,000 to Treblinka Stary Sącz 1,000 1941 to Bełżec Staszów 7,000 1941 to Treblinka Stopnica 5,000 1941 to Treblinka, many killed locally Strzemieszyce Wielkie 1,800 1940–1941 to Będzin Ghetto (500), Auschwitz (1,400) Strzyżów 1,300 1941 to Rzeszów ghetto, killed locally → Bełżec Suchedniów 5,000 1941 to Treblinka Sulejów 1,500 1941 to Treblinka Szczuczyn 2,000 1941 to Bogusze transit camp, killed locally Śniadowo 650 1941 to Zambrow ghetto Tarczyn 1,600 1941 to Treblinka Tarnobrzeg (ghetto & camp) 500\"Tarnobrzeg. Warto zobaczyć\" (Tarnobrzeg worth seeing) , Wydawnictwo Bezdroża. Accessed June 27, 2011. to Dębica ghetto → Bełżec Tarnogród 2,600–5,000 1941 to Bełżec from ghetto & camp, many killed locally Tarnopol Ghetto 20,000 to Bełżec, many killed locally Tarnów 40,000 10,000 killed locally, Bełżec (10,000), Auschwitz Tomaszów Lubelski 1,400–1,500 1941 to Bełżec Tyczyn ? 1941 to Bełżec extermination camp Wadowice 1,400Wadowice – Historia. Wirtualny Sztetl. . Accessed June 27, 2011. 1941 to Auschwitz Wąwolnica 2,500 1941 to Bełżec extermination camp Węgrów 6,000–8,300 1941 to Treblinka Wieliczka 7,000 1941 to Bełżec extermination camp Wielun 4,200–7,000 1941 to Chełmno extermination camp, killed locally Wieruszów 1,400 1941 to Chełmno extermination camp Wilno Ghetto 30,000–80,000 killed locally (21,000 before ghetto was set up)\"Chronology of Vilna Ghetto,\" at Vilnaghetto.com without additional confirmation of quantitative data. Accessed June 24, 2011. Wiślica 2,000 1941 to Jędrzejów ghetto Wolbrom 3,000–5,000 1941 to Bełżec, many killed locally Wysokie Mazowieckie 5,000 1941 to Zambrow ghetto Zabłudów 1,800\"The Deportation of the Zabludow Jews to Treblinka Death Camp.\" 2003 Tilford Bartman, Jerusalem, Israel. 10th Calvary camp near Białystok → Treblinka (1,400) Zambrów 3,200–4,000 1941 to Auschwitz, mass killings locally Zawiercie 5,000–7,000 1941 to Auschwitz (5,000) Zelów ? 1941 to Chełmno extermination camp Zwoleń (open type) 6,500–10,000 1941 to Treblinka extermination camp (8,000) Żarki 3,200 1941 to Treblinka Żelechów 5,500–13,000 1941 to Treblinka 1942 On January 20, 1942, at the Wannsee Conference near Berlin, Reinhard Heydrich informed senior Nazi officials that \"the final solution of the Jewish question\" was deportation from the ghettos and subsequent mass extermination of the Jews. German companies in Nazi-occupied Poland built six death factories (extermination camps) within two to six months. Andrychów 700 to Auschwitz concentration camp Annopol ? to Kraśnik ghetto Baranów Sandomierski 2,000 to Dębica ghetto, (all) Biecz 700–800 to Bełżec extermination camp Czortków 4,000 to Bełżec extermination camp Dąbrowa Tarnowska 2,400–3,000 to Bełżec extermination camp and Auschwitz Dębica 1,500–4,000 1942 to Bełżec extermination camp Drohobycz Ghetto 10,000 to Bełżec extermination camp Dubno 9,000? all killed locally Frysztak Ghetto 1,600 1942 to Jasło ghetto → killed in Warzyce forest Hrubieszów (labor camp) 200 to Budzyn, killed locally, see Hrubieszów # 122 above (6,800) Jasienica Rosielna 1,500 1942 to Bełżec extermination camp Kołomyja (ghetto & camp) 18,000 1942 to Bełżec extermination camp, many killed locally Koprzywnica 1,800 1940 to Treblinka Kowale Pańskie 3,000–5,000 1939–1942 1942 to Chełmno extermination camp Kowel 17,000 all killed locally Kraśnik (ghetto & camp) 5,000 1940–1942 to Bełżec extermination camp Krosno 600–2,500 to Bełżec extermination camp Lesko 2,000 1942 to Bełżec extermination camp Lubaczów 4,200–7,000 to Sobibor, many killed locally Łachwa Ghetto 2,350 killed locally, 1,500 in an uprising.\"Lachwa, Polesie province, Poland.\", The United States Holocaust Memorial Museum Encyclopedia of Camps and Ghettos, 1933–1945 Łęczna 3,000 to Sobibor, many killed locally Międzyrzec Podlaski Ghetto 20,000 \"The History of Miedzyrzec Podlaski.\" Association of Immigrants of Mezritch Depodalsia Area in Israel. Accessed July 5, 2011. to Treblinka (17,000), hundreds killed locally.\"Mezritch (Międzyrzec) Podlaski in the Jewish sources.\" Association of Immigrants of Mezritch Depodalsia. Accessed June 16, 2011. Ożarów 4,500 to Treblinka Pińsk Ghetto 26,200 to Bronna Góra (3,500), the rest killed locally Przemyśl 22,000–24,000 to Bełżec extermination camp, Auschwitz, Janowska Przeworsk 1,400? to Bełżec extermination camp Przysucha 2,500–5,000 Przysucha, województwo Mazowieckie, Polska. Haapalah Index and Source Database. Accessed July 5, 2011. to Treblinka (5,000)Przysucha – History. Virtual Shtetl. Museum of the History of Polish Jews. Accessed July 5, 2011. Sambor Ghetto 8,000–9,000 to Bełżec extermination camp, many killed locally Sosnowiec Ghetto 12,000 to Auschwitz Starachowice (labor camp) 13,000 1942 1942 to Treblinka, see also Starachowice ghetto Stryj 4,000–12,000 1942 all killed locally Sucha Beskidzka 400Gmina Sucha Beskidzka, powiat suski. Targeo. . Accessed June 27, 2011. 1942 1943 to Auschwitz Szydłów 1,000 to Chmielnik ghetto Tarnogród (labor camp) 1,000 1942 1942 see Tarnogród ghetto → Bełżec extermination camp Tomaszów M. (labor camp) 1,000 1942 to Starachowice,Stefan Krakowski, Tomaszow Mazowiecki, Jewish Virtual Library. Accessed June 24, 2001. see also Tomaszów Mazowiecki Ghetto (1940) Tuchów 3,000 to Bełżec extermination camp Zdzięcioł Ghetto 4,500 killed locally during Zdzięcioł massacres == Ghettos in the Soviet Union == After Operation Barbarossa, many ghettos appeared in Nazi-controlled parts of the Soviet Union. === In modern-day Belarus === There were many ghettos in Belorussia: the region we now call Belarus. In Ostryna, a ghetto was opened in October 1941. Five hundred Jews from a neighboring village, Nowy Dwor, were also forced into the Ostryna Ghetto. Some ghettos in Belarus were large. The Minsk Ghetto (1941-1944) held around 100,000 Jews. Another in Grodno held about 25,000. In Korelicze (now Karelichy), a ghetto operated for just a few months, from February to May 1942. When the ghetto was liquidated, its Jewish residents were sent to the Nowogrodek Ghetto. There were also ghettos in Białystok, Pruzhany, Shklov, and Smilovitsky. === In modern-day Ukraine === In Krymno (now Krymne), a ghetto was formed in May 1942 and liquidated just a few months later, starting on September 6. There were several destruction ghettos in Ukraine. The Berdichev (Berdychiv), Zhytomor (Zhytomyr), and Vysotsk Ghettos existed for just a few weeks. There were also ghettos in: * Bobrka * Brailov * Chelmnik * Kalinovka * L'vov * Medzhybizh * Mogliev Podolski * Proskurov * Zhornishche ===Other areas=== In Lithuania, there were ghettos in Wilno, Kaunas, and Siauliai. There was a ghetto in Liepaja, Latvia. The Red Army liberated the Il'ino Ghetto (in modern-day Russia on January 25, 1942, saving 200 Jews. ==References== Category:Racism Category:Antisemitism Category:The Holocaust Category:Discrimination Category:Antisemitism in Europe Category:Antisemitism in Germany",
 "title": "Ghettos in Europe during the Holocaust"
}