{
 "id": "1116046",
 "text": "Frederick Jackson Turner (November 14, 1861 – March 14, 1932) was an American historian. He worked at the University of Wisconsin-Madison until 1910. Then he worked at Harvard University. People know him because of an idea he had which is called the frontier thesis. Also, he trained many other famous historians. He changed how people study history. His focus was the Midwestern United States. Turner's most famous essay \"The Significance of the Frontier in American History\" shared his idea of frontier thesis. A frontier is an area near a country's borders. Turner argued that the United States' frontier had a big impact on the United States' governmentand people. Many historians argue about if Turner's idea was right. However, they agree that it was important to future writing about history. ==Early life and education== Turner was born in Portage, Wisconsin. His parents were Andrew Jackson Turner and Mary Olivia Hanford Turner. Turner read and learned from Ralph Waldo Emerson, Charles Darwin, Herbert Spencer, and Julian Huxley. He was also interested in maps. He graduated in 1884 from the University of Wisconsin. Turner was very much influenced by the writing of Ralph Waldo Emerson, a poet known for his emphasis on nature; so too was Turner influenced by scientists such as Charles Darwin, Herbert Spencer, and Julian Huxley, and the development of cartography. In 1884, he graduated from the University of Wisconsin. That school is now named the University of Wisconsin–Madison. While there, Turner was a member of the Phi Kappa Psi Fraternity. He earned his PhD in history from Johns Hopkins University in Baltimore in 1890 by writing about the fur trade in Wisconsin. His teacher there was Herbert Baxter Adams. ==Career== Turner did not share much writing. However, his ideas changed how many people thought. His most important ideas are named the Frontier Thesis and the Sectional Hypothesis. Also, he knew much information about United States history. HIs students like Merle Curti and Marcus Lee Hansen learned from him. He also helped them get jobs. Turner started to teach at Harvard in 1910 because he wanted to do more studying and less teaching.Allan G. Bogue, \"'Not by Bread Alone': The Emergence of the Wisconsin Idea and the Departure of Frederick Jackson Turner.\" Wisconsin Magazine of History 2002 86(1): 10–23. He stopped working in 1922. Then, he started studying at the Huntington Library in Los Angeles. ==Frontier thesis idea== Turner first wrote about his frontier thesis idea in 1893. He read a piece called \"The Significance of the Frontier in American History\" to the American Historical Association in Chicago during the World's Columbian Exposition (Chicago World's Fair). His idea was that the United States was successful because it had taken land in the West from Native Americans. He argued that taking land changed the people of the United States because they needed to work in a new environment. ==Influence and legacy== At first, many people liked Turner's ideas. When he died, 3 out of every 5 colleges in the United States had classes that taught frontier history like he did. His ideas also affected popular culture ideas about the Western United States.Richard W. Slatta, \"Taking Our Myths Seriously.\" Journal of the West (2001) 40#3 pp. 3–5. In the 1960s, historians started to disagree with Turner more. They said he needed to think about women and people of color in the frontier. The frontier was not always a place for freedom. However, the way he studied history was still copied.Hutton (2002). Turner's theories became unfashionable during the 1960s, as critics complained that he neglected regionalism. They complained that he claimed too much egalitarianism and democracy for a frontier that was restrictive for women and minorities. After Turner's death his former colleague Isaiah Bowman had this to say of his work: \"Turner's ideas were curiously wanting in evidence from field studies...He represents a type of historian who rests his case on documents and general impression rather than a scientist who goes out for to see.\"Robert H. Block. \"Frederick Jackson Turner And American Geography.\" Annals of the Association of American Geographers. Published by: Taylor & Francis, Ltd. on behalf of the Association of American Geographers. Vol. 70, No.1 (Mar., 1980), p. 40. Article Stable URL: https://www.jstor.org/stable/2562823. His ideas were never forgotten; indeed they influenced the new field of environmental history. Turner gave a strong impetus to quantitative methods, and scholars using new statistical techniques and data sets have, for example, confirmed many of Turner's suggestions about population movements.Hall and Ruggles, 2004. Turner believed that because of his own biases and the amount of conflicting historical evidence that any one method of historical interpretation would be insufficient, that an interdisciplinary method was the most accurate way to analyze history.Wilbur R. Jacobs. \"Wider Frontiers: Questions of War and Conflict in American History: The Strange Solution by Frederick Jackson Turner\". California Historical Society Quarterly, vol. 47, no. 3 (Sep. 1968), p. 230. Article Stable URL: https://www.jstor.org/stable/25154299. The Frederick Jackson Turner Award is given annually by the Organization of American Historians for an author's first scholarly book on American history. Turner's former home in Madison, Wisconsin is in what is now the Langdon Street Historic District. In 2009 he was inducted into the Hall of Great Westerners of the National Cowboy & Western Heritage Museum. ==Marriage, family, and death== Turner married Caroline Mae Sherwood in Chicago in November 1889. They had three children: only one survived childhood. Dorothy Kinsley Turner (later Main) was the mother of the historian Jackson Turner Main (1917–2003), a scholar of Revolutionary America who married a fellow scholar. Frederick Jackson Turner died in 1932 in Pasadena, California, where he had been a research associate at the Huntington Library. ==Related pages== * Edward Alsworth Ross * Charles Henry Ambler – historian of West Virginia and student of Turner * Thomas Perkins Abernethy - student of Turner at Harvard; later a noted historian ==Turner's Writing== * Turner, Frederick Jackson. Edwards, Everett E. (comp.) The early writings of Frederick Jackson Turner, with a list of all his works. Compiled by Everett E. Edwards. Madison: University of Wisconsin Press, 1938. * Turner, Frederick Jackson. * Turner, Frederick Jackson. ed. \"Correspondence of the French ministers to the United States, 1791–1797\" in American Historical Association. Annual report ... for the year 1903. Washington, 1904. * Turner, Frederick Jackson. \"Is Sectionalism in America Dying Away?\" (1908). American Journal of Sociology, 13: 661–675. * Turner, Frederick Jackson. \"Social Forces in American History ,\" presidential address before the American Historical Association American Historical Review, 16: 217–233. * Turner, Frederick Jackson. The Frontier in American History. New York: Holt, 1920. * Turner, Frederick Jackson. \"The significance of the section in American history.\" Wisconsin Magazine of History, vol. 8, no. 3 (Mar 1925) pp. 255–280. *Turner, Frederick Jackson. The Significance of Sections in American History. New York: Holt, 1932. * Turner, Frederick Jackson. \"Dear Lady\": the letters of Frederick Jackson Turner and Alice Forbes Perkins Hooper, 1910–1932. Edited by Ray Allen Billington. Huntington Library, 1970. * Turner, Frederick Jackson. \"Turner's Autobiographic Letter.\" Wisconsin Magazine of History, vol. 19, no. 1 (Sep 1935) pp. 91–102. * Turner, Frederick Jackson. America's Great Frontiers and Sections: Frederick Jackson Turner's Unpublished Essays edited by Wilbur R. Jacobs. University of Nebraska Press, 1965. ==References== : ==Sources== * Hall, Patricia Kelly, and Steven Ruggles. \"'Restless in the midst of Their Prosperity': New Evidence on the Internal Migration of Americans, 1850–2000. Journal of American History 2004 91(3): 829–846. * Hutton, T. R. C. \"Beating a Dead Horse: the Continuing Presence of Frederick Jackson Turner in Environmental and Western History.\" International Social Science Review 2002 77(1–2): 47–57. online * Scharff, Virginia, et al. \"Claims and Prospects of Western History: a Roundtable.\" Western Historical Quarterly 2000 31(1): 25–46. in Jstor. ==Further reading== * Billington, Ray Allen. \"Why Some Historians Rarely Write History: A Case Study of Frederick Jackson Turner\". The Mississippi Valley Historical Review, Vol. 50, No. 1. (June, 1963), pp. 3–27. in JSTOR. * Billington, Ray Allen. America's Frontier Heritage (1984). detailed analysis of Turner's theories from social science perspective. * Billington, Ray Allen. ed,. The Frontier Thesis: Valid Interpretation of American History? (1966). The major attacks and defenses of Turner. * Billington, Ray Allen. Frederick Jackson Turner: Historian, Scholar, Teacher. (1973). full-scale biography. * Bogue, Allan G. Frederick Jackson Turner: Strange Roads Going Down. (1988) along with Billington (1973), the leading full-scale biography. * Burkhart, J. A. \"The Turner Thesis: A Historian's Controversy\". Wisconsin Magazine of History, vol. 31, no. 1 (Sep 1947), pp. 70–83. * Cronon, E. David. An Uncommon Professor: Frederick Jackson Turner at Wisconsin. Wisconsin Magazine of History, vol. 78, no. 4 (Summer 1995), pp. 276–293. * Cronon, William. \"Revisiting the Vanishing Frontier: The Legacy of Frederick Jackson Turner\". The Western Historical Quarterly, Vol. 18, No. 2 (Apr., 1987), pp. 157–176 online at JSTOR. * Curti, Merle E. \"Frontier in American History: The Methodological Concepts of Frederick Jackson Turner\" in Stuart Rice, ed. Methods in Social Science: A Case Book (1931) pp. 353–367. online edition . * * Faragher, John Mack (ed.) Rereading Frederick Jackson Turner: The Significance of the Frontier in American History and Other Essays. New York: Holt, 1994. * Fernlund, Kevin Jon. \"American Exceptionalism or Atlantic Unity? Frederick Jackson Turner and the Enduring Problem of American Historiography\", New Mexico Historical Review, 89 (Summer 2014): 359–399. * Hofstadter, Richard. \"Turner and the Frontier Myth\", American Scholar (1949) 18#4 pp. 433–443 in JSTOR. * Hofstadter, Richard. The Progressive Historians: Turner, Beard, Parrington (1968); detailed critique of Turner. * Jacobs, Wilbur R. On Turner's Trail: 100 Years of Writing Western History (1994). * Jensen, Richard. \"On Modernizing Frederick Jackson Turner: The Historiography of Regionalism\". The Western Historical Quarterly, vol. 11, no. 3 (July 1980), 307–322. in JSTOR. * Limerick, Patricia N. \"Turnerians All: The Dream of a Helpful History in an Intelligible World\", American Historical Review, 100 (June 1995):697–716. in JSTOR. * Nash, Gerald D. Creating the West: Historical Interpretations, 1890-1990. (Calvin P. Horn Lectures in Western History and Culture, University of New Mexico). Albuquerque: University of New Mexico Press. 1991. * Nichols, Roger L. American Frontier and Western Issues: A Historiographical Review (1986) online edition. * Ridge, Martin, ed. Frederick Jackson Turner: Wisconsin’s Historian of the Frontier. Madison: Wisconsin Historical Society Press; Reissue edition, 2016. * Steiner, Michael C. \"From Frontier to Region: Frederick Jackson Turner and the New Western History\". Pacific Historical Review, 64 (November 1995): 479–501. in JSTOR. ==Other websites== *A biography of Frederick Jackson Turner *Frederick Jackson Turner at the Wisconsin Electronic Reader * * * Category:1861 births Category:1932 deaths Category:American historians Category:American academics Category:Harvard University faculty Category:People from Wisconsin",
 "title": "Frederick Jackson Turner"
}