{
 "id": "1117214",
 "text": "In the law of England and Wales, Deprivation of Liberty Safeguards (DoLS) were introduced in the Mental Capacity Act 2005. DoLS make sure that people who can't agree to their care in a care home or hospital are protected if their freedom is taken away. The care arrangements are checked to make sure they are needed and are best for the person. People also have the right to have someone to speak for them and the right to challenge the decision. == Important points == Some of the important messages in the Mental Capacity Act 2005: * The Deprivation of Liberty Safeguards (DoLS) are special rules added to the Mental Capacity Act 2005 for people in England and Wales. * The Mental Capacity Act allows some rules and limits to keep people safe, but only if it's in their best interest and necessary. * When these rules take away someone's freedom, extra protections are needed. These are called the Deprivation of Liberty Safeguards. * DoLS can only be used in care homes or hospitals. In other places, the Court of Protection must approve taking away someone's freedom. * Care homes or hospitals have to ask a local authority for permission to take away someone's freedom. This is called asking for a 'standard authorisation'. * Six checks need to happen before a standard authorisation can be given. * If permission is given, the person will have someone to represent them, usually a family member or friend. This person is called the 'relevant person’s representative'. * Other protections include the right to disagree with the decision in the Court of Protection, and getting help from Independent Mental Capacity Advocates (IMCAs). === Restraint and restrictions === The Mental Capacity Act lets people use some rules and limits to help someone, but only if it's best for the person who can't decide for themselves and only if it's really needed. How urgent the situation is can also affect if short-term limits are used to give care or treatment. Courts make the final decisions about what counts as taking away someone's freedom. The DoLS rules give examples of when courts have said someone’s freedom was or wasn't taken away. These examples help guide decisions. When caregivers make plans for people who can't decide about their care or where they live, they need to check if any rules or limits they want to use would take away the person's freedom and if it's really the best choice for them. ==References== Category:English law Category:Mental health law",
 "title": "Deprivation of Liberty Safeguards"
}