{
 "id": "1117202",
 "text": "The Mental Capacity Act 2005 is a law made by the Parliament of the United Kingdom for people living in England and Wales. This law helps adults who can't make certain decisions on their own by providing rules for others to make those decisions for them.Mental Capacity Act (2005) Code of Practice (2007) London: TSO. == Main parts of the Act == === The five statutory principles === The law has five important rules to help protect people who can't make certain decisions on their own. These rules are there to make sure people get as much help as possible to make their own choices and be involved in decisions about their lives. === Other important information in the Act === * The law lets people make plans for the future in case they need help later. This includes saying no to certain treatments ahead of time. * Decisions should be made based on the specific time and question at hand. * The law says we must always do what is best for the person. * A special court called the Court of Protection helps with tough decisions. The Office of the Public Guardian is part of this court, and helps to make sure the law is used properly. * An Independent Mental Capacity Advocate (IMCA) can help people who don't have close family or friends to support them. * It is a crime if someone decides not to give someone who can't make decisions for themselves the proper support or care. * The law is mostly for people over 16 years old, but can also help some younger people if they will still need support as they grow up. == Changes == In 2004, one of the main courts in Europe said that some parts of the law needed to change to protect people's rights. Because of this, new rules called the Deprivation of Liberty Safeguards (DoLS) were added to the Mental Health Act in 2007. These new rules started in April 2009.The Mental Health Act 2007 These rules help make sure that if an adult is kept in a care home or hospital and can't leave, there are proper procedures to follow. This protects the people taking care of them from getting into trouble. Important parts of the DoLS are: # The person must have someone to represent them. # They must be able to ask a special court called the Court of Protection to review their situation. # There should be regular checks to make sure everything is fair. These rules were made because of a case where a person was kept in a hospital without being told why and without a way to quickly ask a court to help. The European court said that everyone who is kept somewhere must know why and be able to ask a court to review it quickly. === UK laws === * * Explanatory notes to the Mental Capacity Act 2005. == Related pages == * Mental Health Act 2007 ==References== == Other websites == * Department of Health summary * Summary from direct.gov * Easy Read Summary in Plain English * Your statistical guide to the Mental Capacity Act 2005 * Factsheet 460: Mental Capacity Act 2005, Alzheimer's Society * Factsheet 483: Deprivation of Liberty Safeguards (DoLS), Alzheimer's Society * Protecting the Vulnerable? by Anna Raccoon * Cross border incapacity: Will England and Wales find the tin opener? Schedule 3 to the Mental Capacity Act 2005 Category:2005 in England Category:2000s Acts of the Parliament of the United Kingdom",
 "title": "Mental Capacity Act 2005"
}