{
 "id": "1117745",
 "text": "This is a list of cast members in the American animated television series SpongeBob SquarePants. ==Cast== ===Main cast=== Actor Character(s) Character(s) Tom Kenny SpongeBob SquarePants Gary the Snail Patchy the Pirate French Narrator Additional Voices Rodger Bumpass Squidward Tentacles Additional Voices Bill Fagerbakke Patrick Star Additional Voices Clancy Brown Mr. Krabs Additional Voices Mr. Lawrence Plankton Potty the Parrot Realistic Fish Head Larry the Lobster Additional Voices Jill Talley Karen Additional Voices Carolyn Lawrence Sandy Cheeks Additional Voices Mary Jo Catlett Mrs. Puff Additional Voices Lori Alan Pearl Additional Voices ===Other regular cast=== Actor Character(s) Character(s) Carlos Alazraqui Scooter Additional Voices Dee Bradley Baker Bubble Bass Squilliam Fancyson Old Man Jenkins Perch Perkins Additional Voices John Gegenhuber Old Man Jenkins Additional Voices Sirena Irwin Mama Krabs Margaret SquarePants Additional Voices Bob Joles Man Ray Mark Fite Additional Voices Thomas F. Wilson Additional Voices ==Recurring guest voices== Actor Character(s) Notes The Flying Dutchman Doyle-Murray was in ten episodes during the first eight seasons. He returned in the eleventh season, starting with the episode \"The Legend of Boo-Kini Bottom\". King Neptune O'Hurley was in the episodes \"Neptune's Spatula,\" \"The Clash of Triton,\" \"Trident Trouble,\" and \"High Sea Diving.\" Captain Frostymug, Lonnie McKean was in two episodes during the ninth season. He voiced Captain Frostymug in \"License to Milkshake\" and Lonnie the shark in \"Sharks vs. Pods\". ==Former cast members== Actor Character(s) Notes Bubble Buddy, various characters Abrell was in the show's second season. He returned to voice Bubble Buddy for the eighth-season episode \"Bubble Buddy Returns\". He returned again in the eleventh-season episode \"Bubbletown\". * * Mermaid Man Borgnine made the most guest appearances on the show, voicing Mermaid Man from 1999 until his death in 2012. Barnacle Boy Conway started in 1999 with his former McHale's Navy co-star Ernest Borgnine. He has been in more than 15 episodes. In September 2018, he stopped because of health issues. Conway died on May 14, 2019. Potty the Parrot Hillenburg was in the show's second and third seasons. When he left, the writer Paul Tibbitt started voicing the character instead. Grandma SquarePants Ross voiced Grandma SquarePants, who is SpongeBob's paternal grandmother. She was in the episodes \"Grandma's Kisses,\" \"BlackJack,\" \"The Abrasive Side,\" and \"Pet Sitter Pat\". She was also in the related video game Employee of the Month. Potty the Parrot Tibbitt took over the role of Potty the Parrot when Stephen Hillenburg left. He started in the fifth-season episode \"Friend or Foe\". He last voiced the character in the eighth-season episode \"It's a SpongeBob Christmas!\" Various characters Paxton voiced multiple child characters in the show's first three seasons. An old recording of her voice is used in the tenth-season episode \"Unreal Estate.\" Walling voiced multiple child characters throughout the show's second and third seasons. An old recording of his voice is used in the tenth-season episode \"Unreal Estate.\" Welker voiced multiple animal characters in the tenth season. These animals include Clamu, Baby Oyster, Mystery the Seahorse, and the gorilla. He has not been on the show since. ==Awards and nominations== Year Actor Award Category Role Episode Result Ref(s). 2001 Annie Award Outstanding Individual Achievement for Voice Acting by a Female Performer in an Animated Television Production Mrs. Puff \"No Free Rides\" 2001 Annie Award Outstanding Individual Achievement for Voice Acting by a Male Performer in an Animated Television Production SpongeBob SquarePants \"Wormy\" 2008 Annie Award Best Voice Acting in an Animated Television Production SpongeBob SquarePants \"Spy Buddies\" 2010 Annie Award Best Voice Acting in a Television Production SpongeBob SquarePants \"Truth or Square\" 2012 Daytime Emmy Award Outstanding Performer in an Animated Program Squidward Tentacles 2018 Annie Award Outstanding Achievement for Voice Acting in an Animated Television / Broadcast Production SpongeBob SquarePants 2018 Daytime Emmy Award Outstanding Performer in an Animated Program SpongeBob SquarePants ==Notes== * A. Guest star Charles Nelson Reilly originally provided the voice of the character. Reilly died in 2007. * B. Replaced Paul Tibbitt. * C. Replaced John Rhys- Davies, who has voiced Man Ray in two episodes. ==References== ==Other websites== * Cast list at the Internet Movie Database Cast members SpongeBob SquarePants SpongeBob SquarePants",
 "title": "List of SpongeBob SquarePants cast members"
}