{
 "id": "111756",
 "text": "A military alliance is an alliance that is made with the express purpose of military matters and promises the defense of all of its members. == Historic military alliances == *Medic Wars **Hellenic League - Athens, Lacedemonia, Macedon, others *Peloponnesian War **League of Delos - Athens, Chios, Samos, Lesbos, others **Peloponnesian League - Lacedemonia, Corinth, Elis, others *Wars of Scottish Independence **Auld Alliance - Scotland, Norway, France *Italian Wars **League of Cambrai - The Papal States, France, Aragon, Holy Roman Empire **Catholic League (Italian) - The Papal States, Venice, England, Aragon, Holy Roman Empire *Schmalkaldic War **Schmalkaldic League - German Protestant States *Anglo-Portuguese Alliance - England (succeeded by the United Kingdom) and Portugal, since 1373 * Luso-Islamic War **Ethio-Portuguese Treaties - Portugal, Ethiopia * Thirty Years' War ** Catholic League (German) - Bavaria, other Catholic German States ** Protestant Union - Protestant German States *War of the Grand Alliance (Nine Years War) **League of Augsburg - The Netherlands, Holy Roman Empire, Spain, Austria, other German states *War of the Spanish Succession **The Quadruple Alliance of 1718 *Napoleonic Wars ** The Quadruple Alliance of 1814/15 ** First through Seventh Coalitions *The Quadruple Alliance of 1834 *Anglo-Japanese Alliance - United Kingdom and Japan * World War I **the Entente and the Allies - United Kingdom, France, Serbia, New Zealand, Australia, Russia (to 1917), Romania (from 1916), United States (from 1917) **the Central Powers - German Empire, Austria-Hungary, Ottoman Empire, Bulgaria * World War II **the Axis - Nazi Germany, Empire of Japan, Fascist Italy, and many others. **the Allies - United Kingdom and the Commonwealth, Free France, United States, Soviet Union, Republic of China, many others. * Cold War ** Western European Union (WEU) - currently in process of merging into CFSP and ESDP (see below) ** North Atlantic Treaty Organisation (NATO) -- United States, Canada, most of Western Europe (still an active alliance) ** Warsaw Pact - Soviet Union, East Germany, Bulgaria, Hungary, Poland, Czechoslovakia, Romania ** Southeast Asia Treaty Organisation (SEATO) - United States, United Kingdom, France, Australia, Burma, New Zealand, Pakistan, Thailand, Philippines ** Central Treaty Organisation (CENTO) - United States, United Kingdom, Turkey, Iran, Iraq, Pakistan ** ANZUS - United States, Australia, New Zealand (still an active alliance) ** Five Powers Pact - Australia, Malaysia, New Zealand, Singapore, United Kingdom (still an active alliance) == Current military alliances and economic assistance == * North Atlantic Treaty Organisation (NATO) - United States, United Kingdom, Canada, most of Western Europe and Central Europe, parts of Eastern Europe, and Turkey. * Collective Security Treaty Organization (CSTO) - Russia, Belarus, Armenia, Kazakhstan, Kyrgyzstan, Tajikistan * Common Foreign and Security Policy (CFSP) and European Security and Defence Policy (ESDP) of the European Union. * Five Power Defence Arrangements (FPDA) - United Kingdom, Australia, New Zealand, Malaysia, Singapore. * ANZUS Treaty (ANZUS) - United States, Australia, New Zealand. * ECOMOG of Economic Community of West African States Monitoring Group. * Council for Peace and Security in Central Africa (COPAX) of Economic Community of Central African States. * Inter-American Treaty of Reciprocal Assistance (Rio Pact) - Most of the countries of the Americas. * North American Aerospace Defense Command (NORAD) - United States and Canada. NORAD and other defense agreements (such as the Permanent Joint Board on Defense) form the most extensive defense alliance in the world. * Regional Security System (RSS) - several Eastern Caribbean countries. * Shanghai Cooperation Organisation (SCO), political, economic and military organisation - China, Russia, India, Pakistan, Kazakhstan, Kyrgyzstan, Tajikistan, Uzbekistan. *Brazil, Russia, India, China, South Africa (BRICS) - economic and military assistance. == References == Category:Military alliances",
 "title": "Military alliance"
}