{
 "id": "1117591",
 "text": "The Apuriná poison frog (Ranitomeya toraro) is a frog. It lives in Colombia and Brazil. Scientists think it could live in Peru too. ==Other frogs== Scientists used to think this was the same frog as Adelphobates quinquevittaus and Ranitomeya ventrimaculata, but they looked at the frogs again in 2011 and changed their minds. ==Body== The adult frog is about 15 - 17 mm long from nose to rear end. The toes of all four feet have disks on them so the frog can climb. The skin of the frog's head and back is black. It has stripes, like other frogs in Ranitomeya, but they are thinner than other frogs' stripes. This frog has stripes from its eyelids to its rear end and one in the middle from the nose to the rear end. There is a yellow spot on the nose. There is a belly-side stripe that is green-blue in color near the front legs and yellow near the middle of the body. The chin is yellow in color with black spots. The belly and legs are black with light blue patterns. ==Home== This frog lives in forests that have never been cut down and forests that have been cut down and are growing back in places where water flows into the Amazon River. People see the frogs on dead leaves on the ground, on logs, and on branches as high as 35 cm higher than the ground. ==Young== Scientists have seen two groups of eggs above pools of water in plants: one bromeliad plant and one bananeira-brava plant. They have seen tadpoles swimming in pools of water in bromeliad plants, P. guayanese plants, and Heliconia plants. There was one tadpole in each pool. Scientists think the tadpoles might eat each other. They have also seen adult male frogs carrying tadpoles on their backs. Other frogs in Ranitomeya carry their tadpoles from one pool of water to other pools. ==Danger== Scientists believe this frog is not in danger of dying out because it lives in a large place and because there are so many of these frogs alive now. Scientists think people might try to catch this frog to sell as a pet, but they have not seen anyone sell the frog yet. ==References== Category:Frogs of South America",
 "title": "Ranitomeya toraro"
}