{
 "id": "1117637",
 "text": "Samuel son of Elkanah, is a prophet in Judaism and Christianity. The Books of Samuel are named after him. == Birth and childhood == According to the First Book of Samuel, Samuel’s father Elkanah had two wives, Hannah and Penina. Penina had a lot of children. Hannah didn’t have any. Hannah prayed to G-d for a son so she gave birth to one. She named him Shmuel (Samuel) since she had asked for him. Samuel became an assistant for a Chief Kohen named Eli. Then G-d told Samuel to tell Eli that since he didn’t stop his two sons from doing really bad things, he would die and his two sons would die on the same day. == Time as a prophet and judge == The Philistines attacked Israel, killed Eli’s two sons and stole the Ark of the Covenant Eli died when he heard this. Then the Philistines got hemorrhoids so they gave the Ark back to the Israelites. G-d told Samuel to tell the Israelites to stop worshiping idols because it was a sin. The Israelites listened to Samuel and started winning wars against the Philistines. Samuel became a judge in Israel. == Anointment of Saul == After Samuel retired, his sons weren’t very good judges so the Israelites asked Samuel to “anoint for us a king, that we may be like the nations.” Samuel was angry about this because he believed that G-d is the only real King. G-d told Samuel to give the Israelites a king but only if he warned them how hard having a king would be. Samuel told the Israelites they should be worried about the tyranny of kings. The Israelites wanted a king anyway. A man named Saul, son of Kish, came to Samuel’s home in the town of Ramah to ask him for help finding lost donkeys. Samuel told Saul that G-d had told him to make Saul King of Israel. == Saul’s kingship == Samuel used a lottery to find the name of the person who should be king. It was Saul. Saul tried to hide to avoid becoming king of Israel. Samuel convinced him that G-d wanted Saul to be king. The people of the town of Jabesh Gilead didn’t want Saul to be king. When Nachash, king of Ammon attacked them to tear out every person's eye, Saul saved them from the Ammonites. Samuel helped Saul when Saul was king. == Amalek == G-d told Samuel to tell Saul to kill the Amalekites but Saul didn’t kill their king Agag. So Samuel killed Agag for all the women whose children Agag killed. He cut Agag into pieces. Samuel told Saul that because he didn’t listen to G-d about killing the Amalekites, he would lose his kingdom “to your friend who is better than you.” == David == Samuel was sad that Saul wouldn’t be king anymore but G-d told Samuel that it had to be that way. G-d told Samuel to find a young shepherd named David, son of Jesse, and tell him that he would be the new king. So Samuel told David that he would be the new king. After David killed a Philistine giant named Goliath and became a General in Saul’s army, Saul thought David wanted to be king. So Saul tried to kill David but Samuel helped David escape. == Death == When Samuel died in Ramah, everyone there was sad about it. King Saul was also sad. == Witch of Endor == When the Philistines attacked Israel again, Saul couldn’t find a prophet to tell him what would happen. He dressed up as someone who wasn’t king. He hired a Necromancer called the Witch of Endor to bring up Samuel’s ghost. She didn’t want to do that because it was illegal. Saul said she wouldn’t be punished. Then the Witch saw Samuel and screamed. She asked why Saul didn’t tell her he was the king. Saul asked the Witch what she saw. She said “a god risen from the ground.” Saul asked her what the man she saw looked like. She said “an old man who has wrapped himself in a robe”. Saul bowed since it was Samuel but he couldn’t see Samuel. Samuel spoke to Saul and was angry that Saul brought him back from the afterlife. When Saul told him what was happening, Samuel told him that he had told him before that G-d would give his kingdom “to your friend who is better than you. To David.” Samuel told Saul that the next day the Philistines would win against the Israelites and Saul and his three oldest sons would die. Then Saul cried and Samuel disappeared. The Witch got food for Saul to eat. According to the First Book of Chronicles, Saul bringing up Samuel’s ghost was a sin. == Jewish tradition == In Jewish tradition, Samuel wrote the Book of Ruth and the Book of Judges. The Books of Samuel were written by Samuel’s students Gad and Nathan who were also prophets. Category:Old Testament prophets",
 "title": "Samuel (prophet)"
}