{
 "id": "1117908",
 "text": "Chapa also known Chap is a clan of the Gurjar ethnic community of northern India. Once they ruled in the Chapa region of Wadhan and Anhilwada, Gujarat. Chapa Gujjars are distributed in various regions of Pakistan and India. They are mostly Hindus, although some are Muslim. ==Origin== Uncertainty surrounds the origin of the Chapa Gujjars. However, according to Brahman historian, K.M. Munshi, asserts that this Gujar clan as well as the Chapa Gujjars, are descended from Brahman (a varna in Hinduism). ==Etomology== The name Chapa or Chap is a transliteration of the Sanskrit word Chapotkrisht (Chapotkata/Chapotkat), which signifies strong or excelled at archery. ==History== According to some historians, Chapa Gujjars ruled in the Chapa dynasty (from approximately 500 to 670 A.D) of Gujarat before the establishment of the Chavda dynasty (690–742 A.D.) and Bhinmal was their capital now in Rajasthan. Because of their rule and influence their ruling territory got its name as Gurjaradesa/Gurjaratra during the regime of Chapa ruler Vyaghramukha in about 628 A.D later it came to known as Gujarat. Chapa Gujjars ruled in Gujarat for more then 200 hundred years before the Gurjar Pratiharas until the invasion led by Sultan Mehmood Gaznavi of Gazna. In an historical account Sir George Abraham Grierson mentioned about the Chapa dynasty and it's ruler Vyaghramukha of Chapa clan of the Gurjars of Gujarat as; British historian James Campbell about Chapa Gurjars mentioned as; ==Distribution== Chap Gujjars are found in Punjab, Azad Kashmir and Khyber Pakhtunkhwa provinces of Pakistan. In India they are mainly located in Gujarat, Rajasthan, Madhya Pradesh and Jammu and Kashmir. ==References== ===Citations=== ===Sources=== #Printed at the Government Central Press (1901) Gazetteer of the Bombay Presidency :Volume 9, Part 1 p.560 #Sir George Abraham Grierson (1916) Linguistic Survey of India: Volume 9, Part 4 p.12 #Archaeological Survey of India (1911) Indian Antiquary: Volume 40 p.86 #Vintage Books (1988) Hindu Castes and Tribes of Gujarat: Volume 2 p.560 Category:Gurjar clans of India Category:Gurjar clans of Pakistan Category:Gurjar clans Category:Social groups of Gujarat Category:Social groups of Punjab, Pakistan",
 "title": "Chapa"
}