{
 "id": "1117906",
 "text": "The murder of Nagore Laffage was the violent death of a young woman from Irún by Diego Yllanes during the Sanfermines. It received significant media coverage and intense social reaction. == Facts == Nagore Laffage was born in Irún in 1988. She studied nursing in Pamplona, where she met José Diego Yllanes Vizcay, a 27-year-old doctor who was doing his MIR residency in psychiatry at the University Clinic of Pamplona (University of Navarra).The MIR exam (Médico Interno Residente) is a test in Spain to select newly graduated doctors who want to do their medical residency. They met on the night of July 7 2008, during the San Fermín festival. After talking, Nagore said goodbye to her friends and went with José Diego to his house. There, he tried to rape her and when she resisted, he beat her brutally. The autopsy showed that her body had 36 injuries, a broken jaw, and a fractured skull. Nagore was finally strangled to death. The confessed murderer called a friend on July 8, asking for help to get rid of the body, which he tried to dismember. This friend reported the facts to the police. Yllanes gathered his belongings, cleaned the apartment, and left the body in Orondritz, 45 minutes from the crime scene. == Trial == The jury found him guilty but did not classify it as murder: 6 members considered it asesinato (similar to murder) and 3 homicidio (homicide), but 7 were needed. He was sentenced to twelve and a half years in prison. On July 3, 2017, just before the ninth anniversary of Nagore's death, Yllanes was granted third degree status, only returning to prison to sleep. He works as a psychiatrist in a private center and from 2020 can work in public health. In March 2024, the National Court rejected the appeal by José Diego Yllanes Vizcay, in which he invoked his right to be forgotten and asked Google to remove news about the facts for which he was convicted. The Court ruled that the freedom of speech and freedom of information take precedence over the right to be forgotten. == Social impact == The murder of Nagore and the public role of her mother Asun Casasola strengthened social awareness of zero tolerance, not only for crimes but also against any sexist violence. Nagore Laffage became a symbol of this fight and social denunciation, also regarding the justice system in Spain. In 2011, Helena Taberna directed a documentary about the case, titled Nagore, featuring Asun Casasola, who is the main voice of the story. This film was nominated for 5 Goya Awards. == References == == Related pages == * Sexism Category:Spanish criminals Category:Violence against women Category:Crimes by year",
 "title": "Murder of Nagore Laffage"
}