{
 "id": "1117978",
 "text": "The lovely poison frog or lovely poison arrow frog (Phyllobates lugubris) is a frog. It lives in Nicaragua and Panama. People sometimes see it in Costa Rica. ==Body== The adult male frog is about 21 mm long from nose to rear end and the adult female frog is about 24 mm long. The skin of the frog's back is black in color. It has stripes down each side of its body. These stripes can be light blue, yellow, gold, or orange in color. There is another stripe on each side. It is white or light blue in color. The tops of the legs are black with either gold or yellow-green patterns. The iris of the eye is black or dark brown in color, so it is not easy to see the eyes in the head. ==Home== This frog lives on the ground and is awake during the day. It lives in forests where there is water in the air. Sometimes it can live in places that humans cut down, if they have had some time to grow back. Sometimes it can live on farms. People have seen this frog between 10 and 610 meters above sea level. ==Young== The male frog sits somewhere where he is hard to see, like water surrounded by plants. Then he calls to the female frog. The female frog lays eggs on dry dead leaves on the ground. The male frog visits the eggs. He makes sure they do not become too dry. After the eggs hatch into tadpoles, the male frog carries the tadpoles on his back. He carries them to streams, where they swim and grow. ==Danger== Scientists believe this frog is not in danger of dying out. It might be in some danger because of bad chemicals in water and because people cut down trees to make farms and towns and to get wood to build with. Scientists think the fungus Batrachochytrium dendrobatidis could kill this frog. Batrachochytrium dendrobatidis causes the fungal disease chitridiomycosis. Scientists have not seen the fungus on wild P. lugubris frogs yet. At least one of the places this frog lives is a protected park: Reserva de la Biosfera del Sureste de Nicaragua. ==References== Category:Frogs of South America",
 "title": "Phyllobates lugubris"
}