{
 "id": "1117201",
 "text": "Sirvan Khosravi (; born 26 July 1982) is an Iranian singer, songwriter, and music producer. He has produced music for various artists including Xaniar Khosravi, his younger brother, who is also a singer-song writer. He rose to fame in 2005 after releasing his debut album \"To Khial Kardi Beri\". == Early life == Sirvan Khosravi was born in Tehran. He is of Persian descent. He started learning the keyboard at age 11. At 16 he took some lessons with Kaveh Yaghmaei who became his mentor. ==Career== Before releasing his first album in 2005, Sirvan participated in the works of other Iranian artists as an Audio Engineer, Mixing and Mastering Engineer and Producer. After meeting Omid Athari Nejad in 2001, he produced his first album titled \"To Khial Kardi Beri\" and released it in 2005. Khosravi started to produce his second music album \"Sa’ate 9\" from 2005 and released it in 2009. He performed his first concert in February 2009. In 2012, he became very popular among Iranians by performing the end song of \"Sakhteman Pezeshkan\" or \"Doctors' Building\" show. After gaining success with his album Sa'ate 9 with hits such as \"Emrooz Mikham Behet Begam\" (today, I want to tell you), \"Zendegi Hamin Emrooze\" (Life is just today), \"Delam Gerefte\" (I'm Feeling Blue), he started to work on his next album Jaddeie Royaha (Road of Dreams) which was again a success. But after releasing some \"highly energetic\" singles he rose to national fame and started his Iran tour and managed to gain the media and the audience's attention. He continued playing at concerts in major cities of Iran and before his unplugged album, he released some high quality music videos that his fans responded well to. He also recorded a high energy World Cup single with his brother, Xaniar Khosravi, titled \"70 Million Stars\". He received some praise for his unplugged album in 2016 which was filmed in Azadi Tower in 2015 and included his live performances and some behind the scenes from his music videos. This album was sponsored by AXE and was directed by the Farahbod brothers, the cover was designed by Ali Ghazizadeh, and the songs were rearranged by Sirvan's friend Kaveh Yaghmaei and Sirvan himself.. His Song Tanha Nazar reached number 5 on Spotify's Hong Kong Top 50 chart on 24 May 2020. == References == == other website == * * Sirvan Khosravi on Instagram * Sirvan Khosravi on Iran Brands Review Category:1982 births Category:Living people Category:Iranian musicians Category:Iranian composers Category:Iranian singer-songwriters",
 "title": "Sirvan Khosravi"
}