{
 "id": "1118889",
 "text": "{{Infobox writer | name = Ali-Shir Nava'i | image = File-0111Navoii.jpeg | image_size = 150px | caption = 16th-century portrait of Ali-Shir Nava'i by Mahmud Muzahhib, now located in the Museum of the Astan Quds Razavi in Mashhad, Iran | pseudonym = Navā'ī (or Nevā'ī) and Fāni | birth_date = | birth_place = Herat, Timurid Empire | death_date = | death_place = Herat, Timurid Empire | resting_place = Herat, Afghanistan | occupation = Poet, writer, politician, linguist, mystic and painter | nationality = | period = | genre = | subject = | movement = | signature = }} 'Ali-Shir Nava'i (9 February 1441 – 3 January 1501), also known as Nizām-al-Din ʿAli-Shir Herawī (Chagatai: نظام الدین علی شیر نوایی, ) was a poet, writer, official, linguist, Hanafi Maturidi mystic, and painter. He was from the Timurid Empire. He is thought to be one of the best Chagatai literature writers. Nava'i thought that his native Chagatai Turkic language was better than Persian. He defended his opinion in his work called Muhakamat al-Lughatayn (The Comparison of the Two Languages). He made lots of Chagatai language poetry. Nava'i is thought to be the founder of early Turkic literature. Many places in Central Asia are named after him. In Uzbekistan, the province and city of Navoiy are named after him. In Tashkent, Samarkand, Navoi, Seoul, Tokyo, Shanghai, Osh, Astana, Dushanbe, Herat, Baku, Moscow, Minsk, and Washington, D.C., there are statues and busts of him. == References == == Sources == * * * * . * . * . * . * . * . * . == Other websites == *A website about Alisher Nava'i *Alisher Nava'i on UzLib on-line library *Copy of Muhakamat al-Lughatain at Harvard *Mahbub ul-Qulub in Chaghatay *\"Chaucer of the Turks\" by Barry Hoberman *Navoiy haqida\" by Tafakkur Category:Sufis Category:Hanafis Category:1440s births Category:1500s deaths Category:Asian poets Category:Afghan poets Category:Afghan writers Category:Timurid Empire Category:15th-century people",
 "title": "Ali-Shir Nava'i"
}