{
 "id": "1118552",
 "text": "Steven Paul Rigby (born 6 December 1972) is a British Entrepreneur and the Co- Chief Executive Officer of the Rigby Group alongside his brother James Rigby. He is the son of Sir Peter Rigby, the founder of the group.https://www.themarque.com/profile/steve-rigby == Early life and Education == Born in the West Midlands, Rigby attended Wylde Green College for Boys and left school at 17 to join his father's business.https://www.boatinternational.com/luxury-yacht-life/owners- experiences/steve-rigby-haze-superyacht-owner == Personal life == Rigby has three children and lives in Mayfair, London and The Cotswolds. He is Chair of the Rigby Foundation, which supports the local Midlands community and a previous Chair of the Development Board for Place2Be, the leading children's mental health charity.https://www.forbes.com/sites/philipsalter/2023/12/01/steve-rigby-on- leadership-legacy-and-long-term- thinking/https://www.tenentrepreneurs.org/steve-rigby The Rigby Foundation recently collaborated with the Centre for Social Justice to understand the challenges facing young people and identify practical interventions. Using these findings, the foundation is focusing its efforts in the West Midlands and plans to announce several partnerships with charitable organizations as it approaches its 50th anniversary. Rigby has expressed hope that other business leaders will support these effortshttps://www.birminghammail.co.uk/news/midlands-news/inside-ambitious- plans-aimed-tackling-29522713 == Career == Rigby joined the family business in 1990 at the age of 17 when he joined SCC, a provider of digital solutions and services. In 1993, he helped found the Byte Computer Superstore chain and was promoted to Managing Director in 1996,https://www.uktech- awards.co.uk/application/files/9916/1608/2720/UKT14_VotingPanel.pdf a position he held until the company's sale to PC World in 1998.https://www.independent.co.uk/news/business/dixons-buys-byte- stores-1153978.html From 1998 to 2001, Rigby served as CEO of ETC Distribution, and in November 2001, he was appointed Director at SCC UK.https://find-and-update.company- information.service.gov.uk/company/01714613/filing-history?page=2 He founded Rigby & Rigby in 2006 and took on a group management role, assuming responsibility for the group’s finances.https://find-and-update.company- information.service.gov.uk/company/06078300/filing-history?page=3 In 2014, he transformed the Rigby Group into its current structure, expanding it into six key divisions: Airports, Aviation, Finance, Hotels, Real Estate, and Technologyhttps://www.thetimes.co.uk/article/scc-drives-65-profit-rise-for- rigby-group-x577bxc952x https://www.thebusinessdesk.com/westmidlands/news/660884-rigby-group-on-the- acquisition-trail-again-as-it-snaps-up-south-west-air-charter-business In 2017, Rigby Group PLC purchased Bournemouth Airport from Manchester Airport Group (MAG),https://www.telegraph.co.uk/business/2017/12/05/bournemouth- airport-bought-rigby-group-mini-conglomerates-aviation/ with Rigby commenting that the deal would provide \"job security for existing staff\". He served as a Non-Executive Director at British International Helicopters https://www.corporatejetinvestor.com/news/patriot_aerospace_group_buys_british_international_helicopters_bih-202/ from 2020 until 2022, when the company was acquired by Bristow Group.https://www.crunchbase.com/person/steve-rigby-c4e8 In November 2024, he launched The Private Business Commission https://www.thetimes.co.uk/article/uk-new-silicon-valley-jeremy-hunt-budget- tech-mfwmvnsf5 to address the UK's growing difficulty in scaling and retaining private companies.https://www.thetimes.com/business- money/entrepreneurs/article/liberate-the-british-business-bank-plead- entrepreneurs-enterprise-network-thwp5pgx5 In April 2024, he publicly endorsed Family Business UK’s 2024 Manifesto,https://www.thetimes.co.uk/article/uk-new- silicon-valley-jeremy-hunt-budget-tech-mfwmvnsf5 \"Taking The Long Term View\".https://familybusinessuk.org/senior-business-leaders-back-the-launch-of- the-family-business-uk-manifesto/ Rigby stated, “I am delighted to wholeheartedly support the manifesto in its support for UK private enterprise and the changes we believe are needed to boost our sector and the economy” https://www.bbpmedia.co.uk/news/professionalservices/senior-west-midlands- business-leaders-urge-mayoral-and.html Currently, Rigby sits on the boards of SCC, Rigby Technology Investments, Regional & City Airports, Rigby Real Estate, Eden Hotel Collection, Nuvias Unified Communications, CloudClevr, Infinigate, and Rigby Grouphttps://www.rigbygroupplc.com/about/rigby-group- board == Recognitions == In 2021, Rigby was a finalist for the EY Entrepreneur of the Year award. In 2022, he was named Leader of the Year by three organizations: The International Business Awards,https://ibxawards.com/hall- of-fame The UK Brilliance Awards, and The UK Business Awardshttps://ukbizawards.com/hall-of-fame == External Sources == Steve Rigby Profile Steve Rigby on Leadership Bournemouth Airport Acquisition EY Entrepreneur of the Year International Business Awards UK Brilliance Awards UK Business Awards Family Business UK Manifesto == References == Category:1972 births Category:English businesspeople",
 "title": "Steve Rigby"
}