{
 "id": "1118641",
 "text": "Living Advantage, Inc. is a 501(c)(3) nonprofit organization based in Los Angeles, California. It was established by Bernice W. Clay with the mission to provide foster children with financial and independent living skills and access to personal records. == History == Living Advantage's founder, Bernice W. Clay, envisioned a nonprofit to assist underprivileged youth. As a speech pathologist for the Los Angeles Unified School District, she developed a passion for helping high-risk adolescents. On September 30, 1993, LA, Inc. was incorporated as a nonprofit by the state of California. In 1996, Bernice opened her first six-bed group home. Bernice passed away three years later, but her daughter, Pamela R. Clay, the executive director of LA, Inc., has continued LA, Inc.'s mission to help at-risk youth. During her 24-year tenure, Pamela discovered that many youths lack essential life documents necessary for securing jobs, driver's licenses, bank accounts, or enrolling in school. In response, she developed the patent-pending electronic data storage program called Electronic Lockbox or eLockbox. == Living Advantage Youth Center (LAYC) == On May 30, 2024, LA, Inc. opened its first youth center with a grand opening ceremony. The Living Advantage Youth Center (LAYC) grand opening ceremony was attended by Crenshaw community leaders, supporters, and the general public. The ceremony commenced with a poignant ribbon-cutting led by a heartfelt video message from Los Angeles Mayor Karen Bass, setting the tone for the day’s festivities. Joining in the celebration were President JC Lacey of the Crenshaw Chamber of Commerce and Todd Johnson, President of the Beverly Hills Chamber of Commerce. Attendees were invited to explore the expansive facility, a testament to the vision of providing a holistic support system for youth. Classrooms, counseling rooms, recreational areas, and resource centers promised a safe haven for growth and development. == Notable Recognition == === Chad L. Coleman === Chad L. Coleman appeared in a Public Service Announcement for LA, Inc. in 2015. A former foster youth himself, he regularly expresses the need for change in the foster care system. === Los Angeles Rams === Since 2020, Los Angeles Rams player, Joseph Noteboom, has chosen to wear LA, Inc. cleats for the My Cause My Cleats game. === University Of Southern California === In 2023, LA, Inc. was awarded the USC Good Neighbors Grant for the Virtual Assisted Living And Education Program (V.A.L.E.). == References == Category:1993 establishments in California Category:Non-profit organizations of California",
 "title": "Living Advantage, Inc."
}