{
 "id": "1118146",
 "text": "The Golfodulcean poison frog or Golfodulcean poison arrow frog (Phyllobates vittatus) is a frog. It lives in Panama and Costa Rica. ==Body== The adult male frog is about 26 mm long from nose to rear end and the adult female frog is about 31 mm long. The skin of the frog's back and head is black in color. It has two big stripes from its nose to its rear end. The stripes are red- orange in color. The tops of the legs are blue and green in a pattern. The belly is light green or white in color. There is a stripe on each side of the body. It is white or blue-green in color. ==Home== This frog is awake during the day. It lives on the ground near streams in forests that have never been cut down and forests that have been cut down and have been growing back for a long time. It can only live in forests and pieces of forests, not in places that human beings have changed. People have seen this frog between 20 and 550 meters above sea level. ==Young== During the time of year when the frogs lay eggs, tThe female frog lays eggs every one or two weeks. She lays 7 to 21 eggs at a time. The female frog lays eggs on leaves. They eggs take a few days or a week to hatch. The tadpoles are dark brown in color. The male frog takes care of the eggs after the female lays them. He makes sure they do not become too dry. After they hatch, the male frog puts the tadpoles on his back. He sits next to the hatched eggs and hits the ground with his feet. Then the tadpoles climb onto his back. This takes about ten minutes. The male frog carries the tadpoles to water, where they swim and grow. He carries them for 1-2 days. He can carry them to a puddle, a palm leaf with water in it, or a hole in a tree with water in it. The tadpoles become frogs after about 45 days. The small frogs become adult frogs after ten months. ==Poison== This frog has batrachotoxin poison in its skin. Scientists say the frog can only make the poison if it eats beetles that also have poison. It does not have as much poison as P. terribilis. ==Danger== Scientists believe this frog is in some danger of dying out because people cut down trees to make big farms and tree farms. Bad chemicals in the water can also kill this frog. People also catch this frog to sell as a pet, but scientists do not think the wild frogs are in danger of dying out from this. At least two of the places this frog lives are protected parks: Parque Nacional Corcovado and Reserva Forestal Golfo Dulce. ==References== Category:Frogs of South America",
 "title": "Phyllobates vittatus"
}