{
 "id": "1118749",
 "text": "Bedali Temple is one of the oldest Hindu temple sites in Indonesia, built around the 7th century. It is located at the foot of Mount Bismo in Wonosobo, a regency (kabupaten) of Central Java. It is an important religious, historical, cultural, educational, and research site which provides key evidence that an ancient Javanese civilization existed in Watumalang District. == Architecture == Expert teams have concluded that the temple was made of andesite rocks around the seventh century, earlier than the Arjuna Temple complex about 20 kilometers away. These teams have included experts from the Tim Ahli Cagar Budaya (TACB) Wonosobo, Balai Pelestarian Cagar Budaya (BPCB) Prambanan, the Wonosobo Tourism Office, and Gadjah Mada University. The temple's roof has a rectangular pyramid shape that is tapered upward. Reliefs, carvings, and architecture like Bedali Temple's have been found in other regions in Wonosobo. However, the temple's reliefs differ from the ones in the Arjuna Temple complex. == Rediscovering the buried property == On 27 July 2013, a man named Pak Pandi and his son Cahyo were hoeing land in Bedali Hamlet, Kuripan Village, when they found a number of rocks. Cahyo found a relief on one of the rocks and realized that it had belonged to a temple. Over the next few days, Pandi found many sections of the old temple. Pandi reported his findings to Mr. Triantoro, the Wonosobo Regional Secretary, as well as a former Watumalang District Head. Soon, a team from the Regional Secretary's office, tourism officials, and reporters all arrived at the temple site. Curious people also came in large numbers, and a police line was drawn around the temple ruins to protect the artifacts. == Preservation efforts == The temples that Pandi found were collected into one and stored in a classroom at SMAN 1 Watumalang, a local public school. With Pandi's help, a place for the temple was build on school grounds and the temple's rocks were arranged soaring upwards. Because it was found in Bedali Hamlet in Kuripan Village, the temple was given the names Bedali Temple and Kahuripan Temple. At the end of October 2019, a team from the Department of Archeology of Gadjah Mada University conducted research and excavation at Bedali Temple. Students and teachers from SMAN 1 Watumalang assisted them, and so did other members of the Bedali community. Their excavation found stones from another temple, which was reconstructed with the other temples at SMAN 1 Watumalang. == The Temple moves == In 2023, Bedali Temple had to be moved due to construction at SMAN 1 Watumalang. With the approval of the Wonosobo Tourism Office and the Head of Kuripan Village, Bedali Temple was moved to Pak Pandi's house. Pandi's son Innaya brought the temple rocks to his father's house using a makeshift tool, and with his own money he built a simple small house for the temple. Category:Hindu temples Category:Central Java Category:Buildings and structures in Indonesia",
 "title": "Bedali Temple"
}