{
 "id": "1118954",
 "text": "Walburga Albina Augusta Van Steenlandt (1 December 1905 - 8 July 1965) was a Belgian athlete, being active during the 1920s. She was specialized in middle- distance running and cross country running. She was a member of Rust Roest de Bruges. She also played football and gymnastics.Register of the civil status of Bruges, birth certificate 13452, 2 December 1905 Van Steenlandt was two times national champion in the 1000 metres and once in the cross country. She was Belgian record holder in the 1000 metres from 1923. She represented Belgium internationally at multiple meetings. ==Biography== Van Steenlandt was born on 1 December 1905 in Bruges. She had three sister and one brother. Her sister Espérance Van Steenlandt (1910-1996) was also an athlete at Rust Roest de Bruges who competed internationally. Van Steenlandt was a member of Rust Roest de Bruges. In 1923 she became Belgian champion in the 1000 metres. With a time of 3:19.4 she imroved the Belgian national record of Ida Degrande. Later in 1923 she improved the national record to 3:13.2 in the Olympic Stadium of Antwerp. In 1924 she won her second Belgian title in the 1000 metres. In 1925 she again finished first, but was relegated to second place. Van Steenlandt was selected to represent Belgium at the 1924 Women's Olympiad in London for the 1000 metres event. She also represented Belgium at the 1924 France–Belgium women's athletics match and 1925 Belgium–France women's athletics match in the 1000 metres event. In 1925 she finished third behind the French Clémence Mullebrouck and Marcelle Neveu. At the 1925 Brussels Femina Club international women's athletics meeting she finished second in the 1000 metres just behind the British Nora Callebout and also finished with her team second in the relay race behind the United Kingdom. On 1 May 1934 she married Louis Gustaaf Verberckt (1904) in Bruges, who worked at the gas and electricity company. Their oldest son was painter (1935-2014), who married to athletics champion . ==References== Category:1905 births Category:1965 deaths Category:Belgian athletes Category:Middle-distance runners Category:People from Bruges",
 "title": "Walburga Van Steenlandt"
}