{
 "id": "1118290",
 "text": "The Baizai Bangashes are supposed to have settled in the neighborhood of Kohat in the 15th century. == History == === Daulat Khel === Daulat Khel is a sub- tribe of Baizai. This tribe was first settled in Kohat in the end of 14th century. Bai Khan, their reputed ancestor, is said to have had a son named Daulat Khan, and the tappa is often named Daulat Khel after him, Daulat Khel and Baizai being almost synonymous terms. === Divisions of Daulat Khel === The main divisions of Daulat Khel were Malak Miri, Behzadi, Karamdadi, and Allahdadi. The Behzadis constitute an important sub-division of the Baizai. Presently, they settled on the old Bannu Road near the Cantoment. The Malik Miris, the Karamdadis were massacred by the Behzadis, and the few remnants took refuge in the Chahch tract in the Attock district, The Alladadis, like Karamdadis, also suffered at the hands of the Behzadis and migrated to other areas. A few of their families are settled in Nusrat Khel settlement on the west side of Kohat city, some with the Behzadis in Behzadi Chikar Kot, while their majority moved toChahch and other parts of Hind. Allahdad and Karamdad were from the same mother.The elder of the clan narrated that Allahdad was the eldest of the fur brothers. The clans were then settled at the source of the water springs near Company Bagh in Kohat. Allahdad Khan and Karamdad Khan had a contiguous area with Behzad Khan that extended from Kohat city, including the present cantonment, to Kohat Development Authority town, down in the south to village Jarma, and in the east up to Ghandiyali and Shadi Khel,Being an elder, Allahdad Khan allocated a major portion of the tract to the Karamdad and to himself, which was resented by Behzad Khan. Allahdad Khan refused to listen to reasons, and consequently, Behzad Khan and his decendants conspired to destroy Allahdad Khan, his full brother, Karamdad Khan, and their decentants. They invited them to a feast and subsequently massacred them, except for a few. The remnants took refuge in Hazro, and from there descended the Karamdadis Bangashes of Chahch, and to his group of Bangashes, the family ofGeneral jahandad khanA few of the fugitive Allahdadi families subsequently returned to Kohat and are presently settled with the Behzadis. Hey, we are settled in the Kandi Allahdadi in the village of Behzadi Chikarkot, where some of the Allahdadi families live in Bengal and are there to this day. As for the property of Allahdad, except for some land in other villages, the whole of the Jarma tract, Shahpur, and the Kharmatu lands were confiscated by the Emperor Akbar. This tract of land remained resumed by the government and was used by the Mughals, Durranis, Sikhs, and later the British Government as bait for good service by the locals and has been given as 'jagir' to various families who served their cause, The Jarma tract was given to Mubarak Shah Banuri, the Kharmatu surrounding area to Nawab Sher Khan Bangash, and Shahpur to the Kiyani Family for their services during the War of Freedom in 1857. == Sub- tribes of Daulat Khel == Bangash Baizai Daulat Khel Behzadi Janas Khel, Tar Khel and Gula khel Malak Miri Fateh Khan Khel, Regi Shino Khel and Izzat Khel Allahdadi Karamdadi Nusrat Khel etc. == Sub-tribes of Bangashes == Bangash Gaar Baizai Alisher, Gulshah, Landi, Shingi, Biland, Hasan, Mandar, Tapi, Dang, Isa, Mastu, Daulat Khel, Shamshedi, Musa, Darsamand, Kamal, Mysaro, Doda, Kati, Shadi, Makhizai etc. Miranzai Aba, Alisherzai, Azi Khel, Badda Khel, Hasan, Isap, Khoja, Labi, Lodi Khel, Mandar Khel, Mardo Khel, Aaji Khel Shahu Khel etc. Samilzai Alizai, Darbi, Kalesar, Kasi, Khadizai, Khadir, Khoti, Landi, Mamazai, Mari, Mastori, Mozu, Musa, Naso, Pae, Tana, Tazi, Ustarizaietc. == Notable People == # Lieutenant General Jahan Dad Khan was an officer of the Pakistan Army and 14th Governor of Sindh, Pakistan. He was founder of Al-Shifa Trust. Jahan Dad Khan also served as chairman of the Pakistan Red Crescent Society # Shahzad Khan Bangash chief secretary of Khyber Pakhtoon khwa. # Malik Muhammad Saad Khan Shaheed (19 May 1959 – 27 January 2007), was one-star rank senior police officer, engineer, and former Chief Capital City Police Officer (CCPO) of Peshawar, North-West Frontier Province, Pakistan. Malak Saad Khan Shaheed was Behzadi Bangashes == References == Category:Tribes",
 "title": "Baizai Bangashes of Kohat"
}