{
 "id": "1118495",
 "text": "The Kingdom of Karangasem was a Hindu kingdom that developed in the year 1600 on the side of Bali. During its heyday, this kingdom had a vast territory up to the island of Lombok. After losing the war with the Netherlands in 1894, Karangasem came under the control of the Dutch East Indies government. After the independence of the Republic of Indonesia, Karangasem became Karangasem Tier II regent under the Bali Provincial government of Indonesia. == History == === Origin of name === The name Karangasem actually comes from the words \"Karang Semadi\". Several notes containing the origins of the name karangasem are as expressed in the Sading C Inscription found in Geria Mandara, Munggu, Badung. It was further revealed that Mount Lempuyang in the northeast of Amlapura, was originally named Adri Karang which means Mount Coral. In the inscription it is said that in the year 1072 Saka, the 12th of the half-bright month, Wuku Julungwangi in the month of Cetra, Bathara Guru ordered one of his sons Sri Maharaja Jayasakti or Hyang Agnijaya to descend to Bali. The task carried out as quoted in the inscription reads \"...gumawyeana Dharma rikang Adri Karang maka Rahayuan ing Jagat Bangsul...\", which means \"coming to Adri Karang to make a temple (Dharma) to provide inner and outer safety for Bali\". Hyang Agnijaya is said to have come together with his brothers, namely Sambhu, Brahma, Indra, and Vishnu at Adri Karang (Mount Lempuyang to the northeast of Amlapura city). Mount Lempuyang was chosen by Bathara Guru as a place to spread His love for the salvation of mankind. In historical research into the existence of the temple, Lempuyang is connected with the words lampu which means chosen, and Hyang which means God (Bathara Guru, Hyang Parameswara). It was in Adri Karang that Hyang Agnijaya made Lempuyang Luhur Temple a place for meditation (Karang Semadi). Gradually the name \"Karang Semadi\" changed to \"Karangasem\". === Establishment of the Karangasem Kingdom === In the 16th to 17th centuries, Karangasem was under the rule of Gelgel Kingdom, with the king I Dewa Karangamla who was based in Selagumi (Balepunduk). I Dewa Karangamla married the widow of I Gusti Arya Batanjeruk, the royal governor who staged a rebellion and was killed in Bungaya Village, with the condition that after their second marriage, the widow Batanjeruk's children would be the ruler. These conditions were agreed to and then I Dewa Karangamla's family moved from Selagumi to Batuaya. I Dewa Karangamla also had a son from another wife named I Dewa Gde Batuaya. The handover of power to the son of the widow Batanjeruk marked the beginning of the founding of the Karangasem Kingdom which was held by the Batanjeruk Dynasty. === Expansion to Buleleng, Jembrana and Lombok and conquest of Karangasem by the Dutch === After King I Gusti Anglurah Ketut Karangasem died, the government of the Karangasem Kingdom was held by I Gusti Gede Karangasem (Dewata in Tohpati) between 1801-1806. At that time, the territory of the Karangasem Kingdom was getting bigger, expanding its power to Buleleng and Jembrana. After his death, I Gusti Gede Ngurah Karangasem was succeeded by his son, I Gusti Lanang Peguyangan, who was also known as I Gusti Gede Lanang Karangasem. The victory of the Buleleng Kingdom against the power of the Karangasem Kingdom caused the king of Karangasem, I Gusti Lanang Peguyangan, to step aside and at that time the Karangasem Kingdom was once again controlled by the king of Buleleng, I Dewa Pahang. Power was finally reclaimed by I Gusti Lanang Peguyangan. The rebellion of a royal retainer named I Gusti Bagus Karang in [1827] succeeded in overthrowing I Gusti Lanang Peguyangan so he fled to Lombok, and the throne of the Karangasem Kingdom was held by I Gusti Bagus Karang. When I Gusti Bagus Karang died while attacking Lombok, at the same time the king of Buleleng, I Gusti Ngurah Made Karangasem, succeeded in conquering Karangasem and appointed his son-in-law I Gusti Gede Cotong as king of Karangasem. After I Gusti Gede Cotong was killed due to a power struggle, the throne of Karangasem was succeeded by the cousin of the king of Buleleng, namely I Gusti Ngurah Gede Karangasem. Groups of Balinese nobles from the Karangasem Kingdom then began to control the western part of Lombok Island. One of them, namely the Bali-Mataram group, managed to control more than other Bali groups, and even eventually controlled the entire island in 1839. Since then Balinese palace culture has also developed in Lombok. On 25 August 1891, the son of the ruler of Bali-Mataram, Anak Agung Ketut Karangasem, was sent, along with 8,000 soldiers, to quell the rebellion in Praya, which included the region of Selaparang Kingdom. On September 8 1891, a second army, under another son, Anak Agung Made Karangasem, with a strength of 3,000 men was sent as additional troops. Because the royal army seemed to be in difficulty to overcome the situation, further assistance was requested the vassal ruler of Karangasem, namely Anak Agung Gede Jelantik, to send 1,200 elite troops to put down the rebellion. The war raged for a long time from 1891 to 1894, and the Bali-Mataram army which had more sophisticated weapons equipped with two modern warships, Sri Mataram and Sri Cakra, succeeded in occupying many rebellious villages and surrounding the last stronghold of Sasak resistance. On 8 November 1894, the Dutch systematically fired cannons at Balinese positions in Cakranegara, destroying the palace, killing around 2,000 Balinese, while they themselves lost 166 men. By the end of November 1894, the Dutch had succeeded in defeating all Balinese resistance, with thousands of Balinese being killed, surrendering, or performing puputan rituals. Lombok and Karangasem later became part of the Dutch East Indies, and the government was run from Bali. Gusti Gede Jelantik was appointed as Regent by the Dutch in 1894, and he ruled until 1908. === Colonial period === ==== Dutch occupation period ==== After the entry of the Netherlands, it also had an influence on government bureaucracy. In 1906 in Bali there were three types of government, namely: * Rechtstreeks bestuurd gebied (direct government) covers Buleleng, Jembrana and Lombok * Zelfbestuurend landschappen (self- government) are Badung, Tabanan, Klungkung and Bangli * The stedehouder (representative of the Dutch government) are Gianyar and Karangasem Thus, in the Kingdom of Karangasem, successive people who became Stedehouder (ruler) were I Gusti Gede Jelantik in 1894-1908, and Stedehouder I Gusti Bagus Jelantik who had the title Anak Agung Agung Anglurah Ketut Karangasem (Dewata in Maskerdam) in the years 1908-1950, who supervised 21 Punggawa, namely Karangasem, Seraya, Bugbug, Ababi, Abang, Culik, Kubu, Tianyar, Pesedahan, Manggis, Antiga, Ulakan, Banyakdem..htm History of Karangasem Regency and Amlapura City By Decree Governor Generals of the Dutch Indies dated 16 December 1921 No. 27 Stbl. No. 756 of 1921, starting from January 1 1922, Karangasem's Gouvernements Lanschap was abolished, transformed into an autonomous region, directly under the Government of the Dutch East Indies, forming Karangasem Raad ' which is chaired by Regent I Gusti Bagus Jelantik, while as Secretary is held by Controleur Karangasem. As Regent, I Gusti Bagus Jelantik still uses the title Stedehouder. The number of Punggawa which previously numbered 14 was reduced again to 8, namely: Rendang, Selat, Sidemen, Uangdem, Manggis, Karangasem, Abang, Kubu. By Decree Governor General of the Dutch Indies dated 4 September 1928 No. 1, the title Stedehouder was replaced with the title Anak Agung Agung Anglurah Ketut Karangasem. By Decree Governor General of the Dutch Indies dated 30 June 1938 No. 1 starting from 1 July 1938 he was appointed as Zelfbestuur Karangasem (head of self-help). Simultaneously with the formation of Karangasem's Zelfbestuur, starting from July 1, 1938, Zelfbestuur was also formed throughout Bali, namely Klungkung, Bangli, Gianyar, Badung, Tabanan, Jembrana and Buleleng, where the rulers of the self-swapraja (Zelfbestuur) were incorporated into a federation of kings called Paruman Agung. In socio-cultural life, as a result of the influence of education obtained in the 19th century, many young intellectuals in various regions in Bali founded youth, religious and scientific associations and organizations. In 1925 in Singaraja an association was founded which was named \"Suryakanta\" and had a magazine which was also named \"Suryakanta\". Suryakanta wants the Balinese people to progress in the field of knowledge and eliminate customs that are no longer in line with current developments. Meanwhile, in Karangasem an association was born called \"Satya Samudaya Baudanda Bali- Lombok\" whose members consisted of civil servants and the general public with the aim of saving and collecting money for the benefit of studiefonds. === Japanese occupation period === After several battles, the Japan army landed on Sanur Beach, Badung, on 18 and 19 February 1942. From the direction of Sanur, the Japanese army entered the city of Denpasar without experiencing any resistance. Then, from Denpasar, Japan controlled all of Bali, including Karangasem. First of all, what laid the foundations of Japanese power in Bali were the Japanese Army troops (Rikugun). Then, when the situation stabilized, control of the government was handed over to the civil government. When the Japanese entered Bali, Paruman Agung or the council of Balinese kings was changed to Sutyo Renmei. === Independence period === In 1945 after the surrender of the Japan and the independence of the Republic of Indonesia, Bali became part of the Government of State of East Indonesia. The State of East Indonesia was dissolved and all of its territory was merged into the Republic of Indonesia on August 17 1950. The self-swapraja (kingdom) government in Bali was changed to the Council of Kings with its seat in Denpasar and chaired by a king. In October 1950, the Karangasem Swapraja government took the form of the Karangasem Government Council, chaired by the chairman of the Daily Government Council which was held by the Head of Swapraja (Raja) and assisted by members of the Daily Government Council. In 1951, the term Member of the Daily Government Council was changed to Member of the Karangasem Government Council. Based on Law no. 69 of 1958 starting from December 1 1958, self-government areas in Bali were converted into Level II Regions at the level of regency, including Karangasem. == List of kings == * Gusti Nyoman Karang (1600) * Anglurah Ketut Karang * Anglurah Nengah Karangasem * Anglurah Ketut Karangasem (1691-1692) * Anglurah Made Karang * Gusti Wayahan Karangasem (d. 1730) * Anglurah Made Karangasem Sakti aka Bagawan Atapa Rare (1730-1775) * Gusti Gede Ngurah Karangasem (1775–1806) * Gusti Gede Ngurah Lanang (first period, 1806–1822) * Gusti Gede Ngurah Pahang (1822) * Gusti Gede Ngurah Lanang (second period, 1822-1828) * Gusti Bagus Karang (1828–1838) * Gusti Gede Ngurah Karangasem (1838–1849) * Gusti Made Jungutan aka Gusti Made Karangasem (1849-1850) * Gusti Gede Putu (as subordinate ruler, 1850-1893) * Gusti Gede Oka (as subordinate ruler, 1850-1890) * Gusti Gede Jelantik (1890–1908) * Anak Agung Agung Anglurah Ketut Karangasem (1908-1966) * Anak Agung Agung Made Jelantik (as head of the large family of Puri Agung Karangasem, 1967-2007) * Anak Agung Agung Gede Putra Agung (as head of the large family of Puri Agung Karangasem, 2009-2023) == Gallery == File:COLLECTIE TROPENMUSEUM De stedehouder van Karang Asem zit samen met de regenten van Gianjar en Bangli TMnr 10001919.jpg|Anak Agung Agung Anglurah Ketut Karangasem with the king of Gianyar and Bangli. File:COLLECTIE TROPENMUSEUM Het waterpaleis bij Oedjoeng TMnr 60045218.jpg|Taman Ujung Sukasada in the year 1935. This park was built in 1909 on the initiative of Anak Agung Agung Anglurah Ketut Karangasem. File:Ujung Water Palace - Main Building.JPG|Taman Ujung Sukasada in 2014, which has now become one of the mainstay tourist attractions of Bali Province. == Related pages == * Karangasem Regency ==References== == Other websites == * Bali Provincial Government Site * History of the City of Amlapura as the Capital of the Karangasem Kingdom * Puri Karangasem Historical Society Karangasem Category:1600s establishments in Asia",
 "title": "Kingdom of Karangasem"
}