{
 "id": "1118600",
 "text": "Helminthosporium is a group of fungi. Helminthosporium belongs to the Massarinaceae family and is of the Pleosporales order. Currently, 60 species belong to the Helminthosporium genus. However, there is some uncertainty about how many species belong to this genus.Hu YF, Liu JW, Xu ZH, Castañeda-Ruíz RF, Zhang K, Ma J. Morphology and Multigene Phylogeny Revealed Three New Species of Helminthosporium (Massarinaceae, Pleosporales) from China. J Fungi (Basel). 2023 Feb 20;9(2):280. doi: 10.3390/jof9020280. PMID: 36836394; PMCID: PMC9964966. Members of the Helminthosporium genus are most visible in their asexual morph. These species are considered saprobes and are distributed worldwide. They have been seen to infect a range of hosts.Voglmayr H, Jaklitsch WM. Corynespora, Exosporium and Helminthosporium revisited - New species and generic reclassification. Stud Mycol. 2017 Jun;87:43-76. doi: 10.1016/j.simyco.2017.05.001. Epub 2017 May 13. PMID: 28649153; PMCID: PMC5473648. == Identification == It is difficult to identify Helminthosporium by their shape. Instead, suspected members of the Helminthosporium genus undergo molecular tests to evaluate their correct species. For reliable identification, members should undergo both morphological and molecular analysis. The Helminthosporium genus has a cosmopolitan distribution. == Infection == The majority of Helminthosporium species are parasitic. Hosts include grass-like plants such as potatoes,Errampalli, D., Saunders, J.M. and Holley, J.D. (2001), Emergence of silver scurf (Helminthosporium solani) as an economically important disease of potato. Plant Pathology, 50: 141-153. https://doi.org/10.1046/j.1365-3059.2001.00555.x rice,Limtong S, Into P, Attarat P. Biocontrol of Rice Seedling Rot Disease Caused by Curvularia lunata and Helminthosporium oryzae by Epiphytic Yeasts from Plant Leaves. Microorganisms. 2020 Apr 29;8(5):647. doi: 10.3390/microorganisms8050647. PMID: 32365626; PMCID: PMC7285343. corn, barley, oats, wheat, and sorghum.Hesseltine, C.W., Ellis, J. and Shotwell, O.L. (1971). Helminthosporium: secondary metabolites, southern leaf blight of corn, and biology. 19(4), pp.707–717. doi:https://doi.org/10.1021/jf60176a020. Infection usually occurs on the stems and leaves of plants. However, the species that has infected the host may change what the infection looks like. One instance of infection by a Helminthosporium species is the disease Southern Corn Leaf Blight (SCLB). SCLB is caused by Helminthosporium maydis (H. maydis). When infecting a host, H. maydis produces a toxin that causes SCLB. This disease stops root growth and produces yellow or brown lesions on plant leaves. This disease can affect both corn and sorghum grown in warm, humid environments.Soumya C, Ramachandra YL. Assessment of Pathogenicity in Helminthosporium maydis causing Southern Corn Leaf Blight Disease in the Region of Karnataka. JDDT [Internet]. 15Jul.2019 [cited 10Jul.2024];9(4):146-54. Available from: https://jddtonline.info/index.php/jddt/article/view/2991 Another disease caused by Helminthosporium is named seedling rot disease. Rice seedling rot disease is caused by Helminthosporium oryzae (H. oryzae) and infects rice seeds and rice seedlings. This disease significantly decreases the production of rice seedlings. Infected seeds are soft, pulpy and often covered in mould. Some infected seeds are also unable to germinate. Infected seeds that do grow produce unhealthy seedlings. Infected seedlings are characterised by their yellow or light green colour, weakness, slow growth, and early death. == Resistance == Helminthosporium solani (H. solani) causes a disease called silver scurf in potatoes, which reduces their quality and their ability to be sold. Potato crops are commonly treated with Thiabendazole, an anti-fungal agent, for disease control. However, resistance to this drug has been reported.Platt, H.W. \"Resistance to thiabendazole in Fusarium species and Helminthosporium solani in potato tubers treated commercially in eastern Canada.\" Phytoprotection, volume 78, number 1, 1997, p. 1–10. https://doi.org/10.7202/706113ar ==References == Category:Fungi",
 "title": "Helminthosporium"
}