{
 "id": "111800",
 "text": "The governor of Florida is the head of state and government of the U.S. state of Florida and the commander-in-chief of the state's military forces. The governor is also the head of the executive branch of the state government and is the chairman of the gubernatorial cabinet. Ron DeSantis is the 46th and current governor of Florida, in office since January 2019. == History == Florida had been a French and then a Spanish colony. It came under British control and then returned to Spanish control again after the American Revolution. It had many and multiple governors during these colonial periods of time. The British divided the state into East Florida and West Florida, each with its own head of state. There were also five military governors during the colonial period time such as, William P. Duval, John Eaton, Richard K. Call, Robert R. Reid, and John Branch. == Powers and Duties == The governor has the power to enforce state laws and the duty to either approve or veto bills passed by the Florida Legislature or the Florida Senate to assemble the legislature and grant pardons, except in cases of impeachment. == Eligibility & requirements == Section 5 of the state's constitution states for a person to serve as governor must: * be at least thirty years old. * be a permanent resident in Florida for at least seven years. == Election process and gubernatorial terms == The governor is elected by the people through the popular election to a four-year term, along with the lieutenant gubernatorial candidate or the incumbent lieutenant governor of Florida as their running mate. The gubernatorial candidate or incumbent governor must have the majority of the popular vote in order to win the election. Under Section 5 of the state's constitution forbids anyone from being elected governor more than twice. == Governor-elect of Florida == The governor-elect is the candidate who has won the state's gubernatorial election and is awaiting inauguration to become the governor. == Inauguration == The governor-elect, or incumbent governor immediately began their four-year team on inauguration day every four years in the month of January, along with the incumbent lieutenant governor and lieutenant governor-elect. == Gubernatorial line of succession == If the governor dies, reigns, or is impeached, the lieutenant governor ranks first in the succession will assume the gubernatorial office and duties. == Residence == The Florida Governor's Mansion is the official residence of the governor and the state's first family. it has been the official residence of every governor since Thomas LeRoy Collins in 1956. == List of governors of Florida == # William Dunn Moseley # Thomas Brown # James Broome # Madison Perry # John Milton # Abraham Allison # William Marvin # David Shelby Walker # Harrison Reed # Ossian Hart # Marcellus Stearns # George Franklin Drew # William Bloxham # Edward Aylsworth Perry # Francis Philip Fleming # Henry Mitchell # William Bloxham # William Sherman Jennings # Napoleon Broward # Albert Waller Gilchrist # Park Trammell # Sidney Johnston Catts # Cary Hardee # John Wellborn Martin # Doyle Elam Carlton # David Sholtz # Frederick Preston Cone # Spessard Lindsey Holland # Millard Fillmore Caldwell # Fuller Warren # Daniel Thomas McCarty # Charley Eugene Johns # Thomas LeRoy Collins # Cecil Farris Bryant # William Haydon Burns # Claude Roy Kirk # Reubin Askew # Daniel Robert Graham # John Mixson # Bob Martinez # Lawton Mainor Chiles # Kenneth Hood MacKay # John Ellis Bush # Charlie Crist # Rick Scott # Ron DeSantis == List of living former governors of Florida == *Bob Graham *Bob Martinez *Buddy MacKay *Jeb Bush *Charlie Crist *Rick Scott *",
 "title": "List of governors of Florida"
}