{
 "id": "1118775",
 "text": "Alexander McCormick Sturm (June 23, 1923 – November 16, 1951) was an American artist, author, and entrepreneur who co-founded in 1949 the American guns maker Sturm, Ruger & Co. == Early life and career == Sturm was born in Westport, Connecticut, to sculptor, author and Yale football star Justin Sturm and Katherine \"Kit\" McCormick. He had one younger brother, Justin Jr., known as \"Dusty\". Kit's brother Alexander Agnew McCormick Jr. was a World War I officer and pilot.\"Miss McCormick and Justin Sturm Will Be Wed on June 24,\" Chicago Daily Tribune, June 14, 1922; \"Chicago Flier Dies in Battle, Another in Fall,\" Chicago Daily Tribune, October 1, 1918.\"Justin Sturm, Sculptor and Author, Dies,\" Chicago Tribune, August 8, 1967. As a writer and artist, he was known for his two illustrated children's books—The Problem Fox, and From Ambush to Zig-zag. A reviewer for The New York Times described The Problem Fox as \"marvellous\", and \"a little masterpiece.\"Wilson (2008), p. 38. Although Sturm preferred to stay indoors, he was an accomplished polo player.Wilson (2008), p. 22. == Sturm, Ruger & Co. == He is best known today for his co- founding of Sturm, Ruger & Co. in 1949 prompted by his interest in guns and his friendship with William Ruger. Ruger provided the technical know-how as a gunsmith, and business acumen; Sturm provided the company logo and all of the financial backing for starting the business. == Marriage == During World War II, Sturm was an officer in the Office of Strategic Services in Washington D.C. While in D.C., he met Paulina Longworth. Sturm and Longworth married in 1944 and had a daughter. The couple lived in Sturm's home in Westport. == Death == Sturm became ill in 1951 with viral hepatitis and died after a ten- day stay in the hospital. He was 28 years old. The Sturm, Ruger trademark, which had been a red eagle, was changed to a black eagle by his friend Bill Ruger to mourn the death of his business partner. == References == == Other websites == * Category:Yale University alumni Category:People from Connecticut Category:Businesspeople from Connecticut Category:Writers from Connecticut Category:20th-century writers",
 "title": "Alexander Sturm"
}