{
 "id": "11184",
 "text": "Henry Albert \"Hank\" Azaria ( ; born April 25, 1964) is an American actor, voice actor, comedian and producer. He is famous for voicing many characters in the Fox animated television series The Simpsons. He also appeared in movies such as The Birdcage (1996), and on stage as Sir Lancelot in the Monty Python- inspired musical, Spamalot. He married Helen Hunt from 1999 to 2000. Azaria makes a relationship with Katie Wright. He starred in Showtime's original series Huff. ==Filmography== ===Film=== Year Title Role Notes 1990 Pretty Woman Detective Cool Blue Buzz Direct-to-video 1993 Cannibal! The Musical Israel Swan 1994 Quiz Show Albert Freedman 1995 Now and Then Bud Kent Heat Alan Marciano 1996 The Birdcage Agador Spartacus 1997 Grosse Pointe Blank Steven Lardner Anastasia Bartok Voice 1998 Great Expectations Walter Plane Homegrown Carter Godzilla Victor \"Animal\" Palotti Celebrity David 1999 Cradle Will Rock Marc Blitzstein Mystery Men Jeff / The Blue Raja Bartok the Magnificent Bartok Voice Direct-to-DVD Also producer Mystery, Alaska Charles Danner 2001 America's Sweethearts Hector Gorgonzolas 2002 Bark! Sam 2003 Shattered Glass Michael Kelly 2004 Nobody's Perfect Ray Short film Also director, producer and writer Along Came Polly Claude DodgeBall: A True Underdog Story Young Patches O'Houlihan Eulogy Daniel Collins 2007 The Grand Mike \"The Bike\" Heslov The Simpsons Movie Various Voices Run Fatboy Run Whit 2008 Immigrants Jóska Voice 2009 Night at the Museum: Battle of the Smithsonian Kahmunrah, The Thinker, Abraham Lincoln Year One Abraham 2010 Love & Other Drugs Dr. Stan Knight 2011 Hop Carlos, Phil Voices The Smurfs Gargamel Happy Feet Two The Mighty Sven Voice The Smurfs: A Christmas Carol Gargamel Voice Short film 2013 Lovelace Gerard Damiano The Smurfs 2 Gargamel 2016 Norman: The Moderate Rise and Tragic Fall of a New York Fixer Srul Katz ==Other websites== * *Fresh Air interview with Terry Gross *Hank Azaria 1999 Interview on Sidewalks Entertainment ==References== Category:1964 births Category:American movie actors Category:American voice actors Category:American television actors Category:Comedians from New York City Category:Living people Category:Actors from New York City",
 "title": "Hank Azaria"
}