{
 "id": "1118151",
 "text": "Oculus Go is a virtual reality headset made by Oculus, a part of Meta Platforms (formerly Facebook). It was announced in October 2017 and released in May 2018. The Oculus Go is designed to be affordable and easy to use, without needing a PC or smartphone. == History == === Announcement and Development === Oculus announced the Oculus Go at the Oculus Connect 4 conference on October 11, 2017. It was meant to be a middle option between the high-end Oculus Rift and the more basic Samsung Gear VR. === Release === The Oculus Go was released on May 1, 2018, with two storage options: 32GB and 64GB. The prices were $199 for the 32GB model and $249 for the 64GB model. == Specifications == === Hardware === The Oculus Go uses a Qualcomm Snapdragon 821 processor. It has 3GB of RAM and comes in 32GB and 64GB versions. The screen is 5.5 inches with a resolution of 2560x1440 pixels (1280x1440 per eye). === Optics === The Oculus Go has special lenses that provide a wide field of view and reduce visual problems like the screen door effect. === Audio === The Oculus Go has built-in speakers for 3D sound, so you don't need extra headphones. It also has a 3.5mm headphone jack if you prefer using your own headphones. === Controller === The Oculus Go comes with a simple controller that has a touchpad, trigger, and buttons for easy navigation and interaction in VR. == Software and Content == === Operating system === The Oculus Go runs on a custom version of Android, made specifically for VR. The user interface is simple and easy to use. === Content library === At launch, the Oculus Go had over 1,000 apps, games, and experiences available in the Oculus Store. This included content from the Oculus Rift and Gear VR. == Reception == The Oculus Go was well-received, with praise for its price, ease of use, and quality. Some reviews mentioned that the controller's 3DoF tracking was a limitation compared to more advanced 6DoF systems like the Oculus Rift and Oculus Quest. == Discontinuation == In June 2020, Oculus announced that they would stop selling the Oculus Go and end software updates by the end of the year. They decided to focus on the more advanced Oculus Quest, which offers a better VR experience. == Other websites == * https://www.pcmag.com/reviews/oculus-go * https://arstechnica.com/gaming/2018/05/oculus-go-review-the-wireless-vr- future-begins-today-for-only-199/ Category:Virtual reality",
 "title": "Oculus Go"
}