{
 "id": "1118758",
 "text": "Sturm, Ruger & Company, Inc. is an American weapon manufacturing company. The company was founded in 1949 by Alexander Sturm and William Ruger and has been publicly trading since 1969. == History == Sturm, Ruger & Company was founded by William B. Ruger and Alexander McCormick Sturm in 1949 in a small rented shop in Southport, Connecticut. William made a semi-automatic pistol that took inspiration from the Luger and Colt Woodsman pistols and sold it as the Ruger Standard which wasso successful that it started the entire company. Ruger is a dominant manufacturer in the .22 LR rifle market in the U.S. because of its Ruger 10/22 semiautomatic rifle. The 10/22 is very popular for being relatively inexpensive and of high quality. Because of it, after-market accessories and parts were made for it, which has increased its popularity. Ruger also dominates the .22 semi-automatic pistol market with the Ruger Mark IV, based off of the Ruger Standard pistol. Like the 10/22, the Mark Series is has many after-market accessories From 1949 through 2004, Ruger made over 20 million firearms. The company is headquartered in Southport, Connecticut, and maintains manufacturing facilities in Newport, New Hampshire, Prescott, Arizona, and Mayodan, North Carolina. . In September 2020, the company bought the Marlin Firearms company from the bankrupt Remington Outdoor Company. Ruger introduced the first Ruger-made Marlin lever-action rifle, the Model 1895 SBL. In 2024, Ruger is celebrating their 75th anniversary. == Statistics == Ruger was ranked the number one U.S. gun-making company from 2008 to 2011. In 2011, Ruger made 1,114,687 firearms. The company has set a new goal of 2 million firearms produced per year. From 2009 to 2012, Ruger was the top-seller of handguns. == References == == Other websites == * Category:Manufacturing companies of the United States Category:Companies based in Connecticut Category:1949 establishments in the United States",
 "title": "Sturm, Ruger & Co."
}