{
 "id": "1118952",
 "text": "This is the discography of American rapper ASAP Rocky. ==Albums== ===Studio albums=== List of studio albums, with selected chart positions, sales figures and certifications Title Album details Peak chart positions Sales Certifications US US R&B; /HH US Rap AUS * \"L$D\": * \"ASAP Forever\": * Live. Love. ASAP: CAN DEN FRA NZ SWI UK Long. Live. ASAP * Released: January 15, 2013 * Label: ASAP Worldwide, Polo Grounds, RCA * Formats: CD, LP, digital download, streaming 1 1 1 7 1 4 21 7 9 7 *US: 2,000,000 * RIAA: 2× Platinum * ARIA: Gold * BPI: Gold * IFPI DEN: Platinum * MC: Gold At. Long. Last. ASAP * Released: May 26, 2015 * Label: ASAP Worldwide, Polo Grounds, RCA * Formats: CD, LP, digital download, streaming 1 1 1 5 1 4 42 6 5 10 *US: 210,000 * RIAA: Platinum * ARIA: Gold * BPI: Gold * IFPI DEN: Platinum * MC: Platinum Testing * Released: May 25, 2018 * Label: ASAP Worldwide, Polo Grounds, RCA * Formats: Digital download, streaming 4 3 3 5 3 3 93 4 4 11 * RIAA: Gold * BPI: Silver * IFPI DEN: Platinum * MC: Gold * Pro Musica: Gold Don't Be Dumb * Scheduled: TBA * Label: ASAP Worldwide, Polo Grounds, RCA * Formats: Digital download, streaming colspan=\"12\" ==Mixtapes== List of mixtapes, with selected chart positions Title Mixtape details Peak chart positions US US R&B; /HH US Rap AUS CAN SWI Live. Love. ASAP * Released: October 31, 2011 * Re-released: October 29, 2021 * Label: ASAP Worldwide, Polo Grounds, RCA * Formats: CD, digital download, streaming 43 22 20 51 45 31 ==Singles== ===As lead artist=== List of singles as lead artist, with selected chart positions and certifications, showing year released and album name Title Year Peak chart positions Certifications Album US US R&B; /HH US Rap AUS * \"Babushka Boi\": CAN DEN FRA NZ SWI UK \"Peso\" 2011 — 75 — — — — — — — — * RIAA: Platinum * MC: Gold Live. Love. ASAP \"Purple Swag\" — — — — — — — — — — * RIAA: Gold \"Goldie\" 2012 — 55 — — — — — — — 98 * RIAA: 2× Platinum * BPI: Silver Long. Live. ASAP \"Fuckin' Problems\" (featuring Drake, 2 Chainz and Kendrick Lamar) 8 2 2 78 65 — 30 — 65 50 * RIAA: 8× Platinum * ARIA: 3× Platinum * BPI: Platinum * IFPI DEN: Platinum * MC: Platinum \"Wild for the Night\" (featuring Skrillex and Birdy Nam Nam) 2013 80 26 17 — 65 — 169 38 — 43 * RIAA: 2× Platinum * ARIA: Platinum * BPI: Silver * IFPI DEN: Platinum * MC: Platinum \"Fashion Killa\" — 46 — — — — — — — 80 * RIAA: Platinum \"Multiply\" (featuring Juicy J) 2014 — 49 — — — — — — — 184 * RIAA: Gold \"Lord Pretty Flacko Jodye 2 (LPFJ2)\" 2015 — 37 — — — — — — — — * RIAA: 2× Platinum * MC: Platinum At. Long. Last. ASAP \"Everyday\" (featuring Rod Stewart, Miguel and Mark Ronson) 92 31 23 49 87 — 192 — — 56 * RIAA: 2x Platinum * ARIA: Platinum * BPI: Platinum * IFPI DEN: Gold * MC: 2× Platinum \"LSD\" 62 20 — 83 79 — 138 — — — * RIAA: 3× Platinum * ARIA: Platinum * BPI: Silver * IFPI DEN: Gold * MC: Platinum \"Cocky\" (with Gucci Mane and 21 Savage featuring London on da Track) 2018 — — — — 83 — — — — — The Uncle Drew Motion Picture Soundtrack \"Bad Company\" (featuring BlocBoy JB) — 47 — — 68 — — — — — * RIAA: Gold \"ASAP Forever\" (featuring Moby) 63 31 25 72 41 — 95 35 45 60 * RIAA: Platinum * ARIA: Platinum * BPI: Silver * MC: Platinum Testing \"Praise the Lord (Da Shine)\" (featuring Skepta) 45 22 16 33 22 16 41 11 14 18 * RIAA: 4× Platinum * ARIA: 3× Platinum * BPI: 2× Platinum * IFPI DEN: 2x Platinum * IFPI SWI: Gold * MC: 3× Platinum * RMNZ: Platinum * SNEP: Diamond \"Potato Salad\" (with Tyler, the Creator) — — — — — — — — — — * RIAA: Platinum * BPI: Silver rowspan=\"2\" \"Sundress\" — — — — 72 — — — — — * RIAA: Platinum * ARIA: Gold * BPI: Gold * IFPI DEN: Gold \"Runnin\" (with Mike Will Made It, ASAP Ferg and Nicki Minaj) 2019 — — — — — — — — — — Creed II: The Album \"Energy\" (with Burns and Sabrina Claudio) — — — — — — — — — — rowspan=\"3\" \"Live Fast\" (with Alan Walker) — — — — — — — — — — \"Babushka Boi\" 69 27 24 60 48 — — 39 66 89 * RIAA: Gold * MC: Gold \"Mazza\" (with Slowthai) 2021 — — — — — — — — — 72 Tyron \"Arya\" (with Nigo) 2022 — — — — — — — — — — I Know Nigo! \"Doja\" (with $not) 87 30 20 — 67 — — — — — Ethereal \"The God Hour\" (with ASAP Ant) — — — — — — — — — — Lil Black Jean Jacket 3 \"D.M.B.\" — 32 — — 70 — — — — — Don't Be Dumb \"Shittin' Me\" — — — — — — — — — — Don't Be Dumb and Need for Speed Unbound: Original Soundtrack \"Same Problems?\" 2023 — — — — — — — — — — Don't Be Dumb \"Riot (Rowdy Pipe'n)\" (with Pharrell Williams) — 36 — — — — — — — — \"Highjack\" (featuring Jessica Pratt) 2024 89 26 23 — — — — — — — \"Tailor Swif\" 84 18 17 — 80 — — — 72 — \"Ruby Rosary\" (featuring J. Cole) 85 22 21 — 92 — — — — — \"—\" denotes a recording that did not chart or was not released in that territory ===As featured artist=== List of singles as featured artist, with selected chart positions, showing year released and album name Title Year Peak chart positions Certifications Album US US R&B; /HH AUS CAN DEN FRA NOR NZ SWE UK \"Street Knock\" (Swizz Beatz featuring ASAP Rocky) 2012 — — — — — — — — — — \"Hands on the Wheel\" (Schoolboy Q featuring ASAP Rocky) — — — — — — — — — — * RIAA: Gold Habits & Contradictions \"Cockiness (Love It)\" (Remix) (Rihanna featuring ASAP Rocky) — — — — — — — — — — Talk That Talk \"Yellow Tape\" (Fat Joe featuring Lil Wayne, ASAP Rocky and French Montana) — — — — — — — — — — \"Work\" (Remix) (ASAP Ferg featuring ASAP Rocky, French Montana, Trinidad James and Schoolboy Q) 2013 — — — — — — — — — — * RIAA: 3× Platinum Trap Lord \"Shabba\" (ASAP Ferg featuring ASAP Rocky) — 34 — — — — — — — — * RIAA: 2× Platinum \"Choppa\" (Joey Fatts featuring ASAP Rocky and Danny Brown) — — — — — — — — — — Chipper Jones Vol. 2 \"Pretend\" (Tinashe featuring ASAP Rocky) 2014 — 34 — — — — — — — — Aquarius \"Hella Hoes\" (ASAP Mob featuring ASAP Rocky, ASAP Ferg, ASAP Nast and ASAP Twelvyy) — — — — — — — — — — * RIAA: Gold \"Good for You\" (Selena Gomez featuring ASAP Rocky) 2015 5 — 10 8 11 14 9 14 24 23 * RIAA: 3× Platinum * ARIA: 2× Platinum * BPI: Platinum * IFPI DEN: Platinum * IFPI SWE: 2× Platinum *MC: 2× Platinum *RMNZ: Gold Revival \"Where Is the Love?\" (The Black Eyed Peas featuring various artists) 2016 — — 15 — — — — — — 47 \"Lovesick\" (Mura Masa featuring ASAP Rocky) — — 14 — 20 — — 13 65 59 * RIAA: Gold * ARIA: 2× Platinum * BPI: Platinum * MC: Platinum * RMNZ: Platinum * IFPI DEN: Platinum Mura Masa \"R.I.P. Yams\" (SpaceGhostPurrp featuring ASAP Rocky) — — — — — — — — — — \"Blended Family (What You Do for Love)\" (Alicia Keys featuring ASAP Rocky) — — — — — 62 — — 85 — Here \"Said n Done\" (French Montana featuring ASAP Rocky) — — — — — — — — — — MC4 \"Telephone Calls\" (ASAP Mob featuring ASAP Rocky, Tyler, The Creator, Playboi Carti and Yung Gleesh) — — — — — — — — — — * RIAA: Gold Cozy Tapes Vol. 1: Friends \"Gilligan\" (DRAM featuring ASAP Rocky and Juicy J) 2017 — — — — — — — — — — Big Baby DRAM \"Wrong\" (ASAP Mob featuring ASAP Rocky and ASAP Ferg) — — — — — — — — — — Cozy Tapes Vol. 2 \"Feels So Good\" (ASAP Mob featuring ASAP Rocky, ASAP Ferg, ASAP Nast, ASAP Twelvyy and ASAP Ant) — — — — — — — — — — \"Raf\" (ASAP Mob featuring ASAP Rocky, Playboi Carti, Quavo, Lil Uzi Vert and Frank Ocean) — — — 82 — — — — — — * RIAA: Platinum * ARIA: Gold \"Who Dat Boy\" (Tyler, The Creator featuring ASAP Rocky) 87 36 92 60 — — — — — 93 * RIAA: Platinum Flower Boy \"Summer Bummer\" (Lana Del Rey featuring ASAP Rocky and Playboi Carti) — — — 80 — 133 — — — 81 * RIAA: Gold * ARIA: Gold Lust for Life \"Groupie Love\" (Lana Del Rey featuring ASAP Rocky) — — — — — 141 — — — — \"East Coast\" (Remix) (ASAP Ferg featuring Busta Rhymes, ASAP Rocky, Dave East, French Montana, Rick Ross & Snoop Dogg) — — — — — — — — — — Still Striving \"No Limit\" (G-Eazy featuring ASAP Rocky and Cardi B) 4 2 43 7 — — — 21 57 45 * RIAA: 7× Platinum * ARIA: Platinum * BPI: Gold * MC: 4× Platinum * RMNZ: Gold The Beautiful & Damned \"Pick It Up\" (Famous Dex featuring ASAP Rocky) 54 26 — 60 — — — — — — * RIAA: 2× Platinum * BPI: Silver Dex Meets Dexter \"Doja Sweet\" (Killa Kyleon featuring ASAP Rocky and Bun B) 2018 — — — — — — — — — — Candy Paint N Texas Plates \"Flight to Memphis\" (Smooky MarGielaa featuring Chris Brown, Juicy J & A$AP Rocky) — — — — — — — — — — MarGielaa Mad Man \"Pups\" (A$AP Ferg featuring A$AP Rocky) 2019 — — — — — — — — — — Floor Seats \"Twisted\" (French Montana featuring Juicy J, Logic and ASAP Rocky) — — — — — — — — — — Montana \"Count On Me\" (Brockhampton featuring ASAP Rocky, SoGone SoFlexy, Ryan Beatty, and Shawn Mendes) 2021 — — — — — — — — — — Roadrunner: New Light, New Machine \"Stoozy\" (Dean Blunt featuring ASAP Rocky) — — — — — — — — — \"—\" denotes a recording that did not chart or was not released in that territory. ===Promotional singles=== List of promotional singles, with selected chart positions, showing year released and album name Title Year Peak chart positions Certifications Album US US R&B; /HH US Rap \"4 Loko\" (Remix) (Smoke DZA featuring ASAP Rocky, ASAP Twelvyy, Danny Brown, Killa Kyleon and Freeway) 2012 — — — Sweet Baby Kushed God \"Long Live ASAP\" 2013 86 27 21 * RIAA: Gold Long. Live. ASAP \"U.O.E.N.O.\" (Remix) (Rocko featuring Future and ASAP Rocky) — — — rowspan=\"2\" \"I'm Not the Only One\" (Remix) (Sam Smith featuring ASAP Rocky) 2014 — — — \"M's\" (solo or featuring Lil Wayne) 2015 — 41 — * RIAA: Gold At. Long. Last. ASAP \"Whiskey\" (Maroon 5 featuring ASAP Rocky) 2017 — — — Red Pill Blues \"Handgun\" (YG featuring ASAP Rocky) 2018 98 43 — Stay Dangerous \"—\" denotes a recording that did not chart. ==Other charted songs== List of songs, with selected chart positions, showing year released and album name Title Year Peak chart positions Certifications Album US US R&B; /HH US Rap CAN NZ SWI UK \"Hot Thing\" (Usher featuring ASAP Rocky) 2012 — — — — — — — Looking 4 Myself \"Wildside\" (T.I. featuring ASAP Rocky) — — — — — — — Trouble Man: Heavy Is the Head \"PMW (All I Really Need)\" (featuring Schoolboy Q) 2013 — 39 — — — — — * RIAA: Gold Long. Live. ASAP \"LVL\" — 50 — — — — * RIAA: Gold \"Hell\" (featuring Santigold) — — — — — — — \"Pain\" (featuring OverDoz) — — — — — — — \"1 Train\" (featuring Kendrick Lamar, Joey Badass, Yelawolf, Danny Brown, Action Bronson and Big K.R.I.T.) — 31 25 — — — — * RIAA: Gold \"Phoenix\" — — — — — — * RIAA: Gold \"Suddenly\" — — — — — — — \"Ghetto Symphony\" (featuring Gunplay and ASAP Ferg) — — — — — — — * RIAA: Gold \"I Come Apart\" (featuring Florence Welch) — — — — — — — \"Brothers\" (Kid Cudi featuring King Chip and ASAP Rocky) — — — — — — — Indicud \"Scholarship\" (Juicy J featuring ASAP Rocky) — — — — — — — Stay Trippy \"Holy Ghost\" (featuring Joe Fox) 2015 — — — — — — — At. Long. Last. ASAP \"Canal St.\" (featuring Bones) — 39 — — — — — * RIAA: Platinum * MC: Gold \"Fine Whine\" (featuring Future, Joe Fox and M.I.A.) — — — — — — — \"Excuse Me\" — — — — — — — * RIAA: Gold \"JD\" — — — — — — — \"Electric Body\" (featuring Schoolboy Q) 80 27 21 — — — — * RIAA: Platinum * MC: Gold \"Jukebox Joints\" (featuring Kanye West and Joe Fox) — — — — — — — * RIAA: Gold \"Max B\" (featuring Joe Fox) — — — — — — — \"Wavybone\" (featuring Juicy J and UGK) — — — — — — — \"Fukk Sleep\" (featuring FKA Twigs) 2018 — — — 89 — 65 99 * RIAA: Gold * MC: Gold Testing \"Distorted Records\" — — — — — — — \"Tony Tone\" — — — — — — — \"Buck Shots\" — — — — — — — \"Purity\" (featuring Frank Ocean) — — — — — — — * RIAA: Gold \"T.D\" 2020 83 34 — — — — — Lil Boat 3 \"Rich Nigga Problems\" 2021 — — — — — — — Judas and the Black Messiah: The Inspired Album \"Bankroll\" — — — — 11 — — Roadrunner: New Light, New Machine \"Livin It Up\" 68 — — 62 — — — Punk \"Sandman\" — — — — — — — Live. Love. ASAP \"Wave Gods\" — — — — — — — Magic \"Feel the Fiyaaaah\" 2022 59 23 17 52 — — — Heroes & Villains \"Am I Dreaming\" 2023 51 17 11 28 16 — 51 * ARIA: Platinum Spider-Man: Across the Spider-Verse (Soundtrack from and Inspired by the Motion Picture) \"Nonviolent Communication\" — — — — — — — \"I Smoked Away My Brain (I'm God x Demons Mashup)\" — 50 — — — — — \"Wow\" 2024 — — — — — — — Insano \"Show of Hands\" 71 30 — 71 — — — We Still Don't Trust You \"—\" denotes a recording that did not chart. ==Guest appearances== List of non-single guest appearances, with other performing artists, showing year released and album name Title Year Artist(s) Album \"4 Loko\" 2011 Smoke DZA Rolling Stoned \"Sour State of Mind\" Chase Fetti rowspan=\"3\" \"U.G.K.\" Main Attraktionz \"Megan Good\" ASAP Ferg \"Real Hustler's Don't Sleep\"Juicy J - \"Real Hustler's Don't Sleep\" DatPiff. Retrieved August 7, 2012. Juicy J, SpaceGhostPurrp Blue Dream & Lean \"Make It Stack\"Lloyd Banks - \"Make It Stack\" DatPiff. Retrieved August 7, 2012. Lloyd Banks The Cold Corner 2 \"Big Spender\" Theophilus London Rose Island Vol. 1 \"Yao Ming\" (Remix) 2012 David Banner, Chris Brown Sex, Drugs & Video Games \"Hot Thing\" Usher Looking 4 Myself \"Beastin'\" Chase N. Cashe Charm \"Lines\" Big Boi, Phantogram Vicious Lies and Dangerous Rumors \"Wildside\" T.I. Trouble Man: Heavy Is the Head \"Baking Soda\" All Over Chief \"Gangsta\" 2013 Yelawolf, Big Henry Trunk Muzik Returns \"Brothers\" Kid Cudi, King Chip Indicud \"Wildest Moments\" (Remix) Jessie Ware Devotion \"24K\" Trips N Slim The Preface \"Max Julien\" Funkmaster Flex, ASAP Ferg Who You Mad At? Me or Yourself? \"We Them Niggas\" P. Reign Dear America \"Beautiful\" (Remix) Mariah Carey, Miguel \"Scholarship\" Juicy J Stay Trippy \"Kush Coma\" Danny Brown, Zeeloperz Old \"T.K.O.\" (Remix) Justin Timberlake, J. Cole, Pusha T \"R - Cali\" The Music of Grand Theft Auto V \"Californication\" 2014 Schoolboy Q Oxymoron \"Servin' Lean\" (Remix) Peewee LongWay The Blue M&M; \"No Rest for the Wicked\" (Remix) Lykke Li I Never Learn \"Crib in My Closet\" 2 Chainz, Rick Ross Freebase \"Awwsome\" (Remix) Shy Gilzzy, 2 Chainz LAW 3: Now or Never \"I Got Money\" 2015 Raekwon Fly International Luxurious Art \"Superheroes\" Chief Keef Bang 3 \"Off the Rip\" (Remix) French Montana, Chinx Wave Gods \"M.P.A.\" Pusha T, Kanye West, The-Dream King Push – Darkest Before Dawn: The Prelude \"Wu-Tang Forever\" (Remix) 2016 Drake \"Lords Never Worry\" ASAP Twelvyy, ASAP Nast \"Nine\" Smoke DZA George Kush da Button: Don't Pass Trump the Blunt \"Be Somebody\" Clams Casino, Lil B 32 Levels \"Prima Donna\" Vince Staples Prima Donna \"New Level\" (Remix) ASAP Ferg, Future, Lil Uzi Vert rowspan=\"2\" \"Chanel\" (Remix) 2017 Frank Ocean \"New Choppa\" Playboi Carti Playboi Carti \"Diamonds\" ASAP Twelvyy 12 \"Love Yourself\" (Remix) Mary J. Blige rowspan=\"3\" \"Dawsin's Breek\" (Remix) Ty Dolla Sign \"Reminder\" (Remix) The Weeknd, Young Thug \"The Mattress\" (Remix) ASAP Ferg, Playboi Carti, Rich the Kid, Famous Dex Still Striving \"Jumped Out the Whip\" Gucci Mane Mr. Davis \"Ghost Ride\" Skepta, ASAP Nast Vicious EP \"Breakfast\" Jaden Smith Syre \"Freaky\" Juicy J, Suicideboys Highly Intoxicated \"Feed the Streets\" Juicy J, Project Pat Rubba Band Business \"FTW (Fuck the World)\" Tom Morello Bright: The Album \"One Track Mind\" 2018 Thirty Seconds to Mars America \"Nights Like This\" Lord Fubu First Name Lord, Last Name Fubu \"Mario Cart\" ASAP Ant \"Chewing Gum\" Blood Orange, Project Pat Negro Swan \"Chancer\" Dean Blunt Soul On Fire \"Swerve On Em\" Action Bronson White Bronco \"Walk\" (Remix) 2019 Comethazine \"Too Many Gods\" Joey Badass For the Throne: Music Inspired by the HBO Series Game of Thrones \"Benzo Amore Freestyle\" 2020 Babyfather Roaches 2012-2019 (Super Deluxe) \"T.D\" Lil Yachty, Tierra Whack, Tyler, the Creator Lil Boat 3 \"Corner\" French Montana, Zak CB5 \"Po Up\" Juicy J The Hustle Continues \"Triple Double\" Jean Dawson Pixel Bath \"19\" Dean Blunt ZUSHI \"Count On Me\" 2021 Brockhampton Roadrunner: New Light, New Machine \"Bankroll\" \"Lane Switcha\" Skepta, Pop Smoke, Juicy J, Project Pat F9 \"Livin It Up\" Young Thug, Post Malone Punk \"For Sale\" Strick Strick Land \"Wave Gods\" Nas, DJ Premier Magic \"Doja\" 2022 $not Ethereal \"Confidence\" Fivio Foreign B.I.B.L.E. \"Frankenstein\" Swedish House Mafia Paradise Again \"Shootouts In Soho\" Westside Gunn, Stove God Cooks 10 \"Feel the Fiyaaaah\" Metro Boomin, Takeoff Heroes & Villains \"Am I Dreaming\" 2023 Metro Boomin, Roisee Spider-Man: Across the Spider-Verse (Soundtrack from and Inspired by the Motion Picture) \"Nonviolent Communication\" Metro Boomin, James Blake, 21 Savage \"Outside All Night\" Brent Faiyaz, N3WYRKLA Larger than Life \"Wow\" 2024 Kid Cudi Insano \"Show of Hands\" Future, Metro Boomin We Still Don't Trust You ==Production discography== List of production (songwriting and arrangement) and non-performing songwriting credits (excluding guest appearances, interpolations, and samples) Track(s) Year Credit Artist(s) Album 1\\. \"Long Live ASAP\" 2013 Co-producer ASAP Rocky Long. Live. ASAP 4\\. \"Fashion Killa\" Producer 8\\. \"Wild for the Night\" Remix producer 12\\. \"Suddenly\" Producer 13\\. \"Jodye\" Producer 14\\. \"Ghetto Symphony\" Producer Executive producer ASAP Ferg Trap Lord 6\\. \"Good for You\" 2015 Co-producer (as \"Lord Flacko\") Selena Gomez Revival 2017 Executive producer Playboi Carti Playboi Carti Art director, designer Juicy J Rubba Band Business 4\\. \"Wolves\" 2020 Songwriter, additional vocals Big Sean Detroit 2 5\\. \"WOT\" 2021 Songwriter Slowthai TYRON 3\\. \"Count on Me\" Songwriter Brockhampton Roadrunner: New Light, New Machine 8\\. \"Livin' It Up\" Producer Young Thug Punk 6\\. \"Frankenstein\" 2022 Producer Swedish House Mafia Paradise Again 9\\. \"Lifetime\" Songwriter ==Music videos== List of music videos, with directors, showing year released ! style=\"width:16em;\" | Title Year Director(s) Ref. \"Get High\" (featuring ASAP Ferg) 2010 King Zulu \"Purple Swag\" 2011 Jason Ano \"Peso\" Abteen Bagheri \"Demons\" Donjai \"Wassup\" 2012 ASAP Rocky, Jacob Burghart and Andy Capper \"Goldie\" ASAP Rocky \"Brand New Guy\" (featuring Schoolboy Q) The ICU, ASAP Rocky \"Purple Kisses\" ASAP Rocky, Luke Monaghan \"Bath Salt\" (with ASAP Ant featuring Flatbush Zombies) Shomi Patwary, ASAP Rocky \"Fuckin' Problems\" (featuring Drake, 2 Chainz and Kendrick Lamar) Samantha Lecca, Clark Jackson \"Long Live ASAP\" Samantha Lecca, ASAP Rocky \"Wild for the Night\" (featuring Skrillex and Birdy Nam Nam) 2013 Chris Robinson, ASAP Rocky \"Fashion Killa\" ASAP Rocky, Delaware \"Angels\" ASAP Rocky, Luke Monaghan \"Phoenix\" Francesco Carrozzini \"Multiply\" (featuring Juicy J) 2014 Shomi Patwary, ASAP Rocky \"Lord Pretty Flacko Jodye 2\" 2015 Samantha Lecca \"L$D\" Dexter Navy, ASAP Rocky \"Jukebox Joints\" ASAP Rocky, Shomi Patwary, Awge \"JD\" 2016 ASAP Rocky, Dexter Navy \"ASAP Forever\" (featuring Moby) 2018 Dexter Navy \"Herojuana Blunts\" Awge \"Praise the Lord (Da Shine)\" (featuring Skepta) Dexter Navy \"Potato Salad\" (featuring Tyler the Creator) Awge \"Crazy Brazy\" (featuring ASAP Twelvyy and KEY!) \"Money Bags Freestyle\" \"Fukk Sleep\" (featuring FKA Twigs) Diana Kunst \"Sundress\" Frank Lebon \"Gunz N Butter\" (featuring Juicy J) James Mackel \"Tony Tone\" Hidji Films / Awge \"Kids Turned Out Fine\" 2019 Dexter Navy \"Babushka Boi\" Nadia Lee Cohen \"Arya\" (with Nigo) 2022 Awge \"D.M.B.\" ASAP Rocky for Awge \"Shittin' Me\" Grin Machine \"Riot (Rowdy Pipe'n)\" (with Pharrell Williams) 2023 ASAP Rocky ==Related pages== *ASAP Mob discography ==Notes== ==References== ==Other websites== * Official website * ASAP Rocky at AllMusic * * Category:Discographies of American artists *[Ref.]: References",
 "title": "ASAP Rocky discography"
}