{
 "id": "1118336",
 "text": "Achromobacter is a group of gram negative bacteria found in many places throughout the world. These bacteria have the ability to move, and are found in water, plants, and most commonly in moist soil. It is difficult to eliminate Achromobacter infections because these bacteria are resistant to a variety of disinfectants and first line antibiotics. == Taxonomy == Achromobacter spp. are considered β- proteobacteria. They belong to the order Burkholderiales and the family Alcaligenaceae. Identification of bacteria in the Achromobacter genus involves biochemical testing. Achromobacter are frequently misidentified as other gram negative, nonfermenting bacteria. As of 2020, 22 named species are included in the genus Achromobacter. == Clinical Spectrum == Achromobacter cause a range of infections, particularly in patients with weakened immune systems. The majority of Achromobacter infections occur in cystic fibrosis patients. However, common infections that are not cystic fibrosis include pneumonia and blood stream infections. Rarer infections include infections of the skin, urinary tract, and central nervous system. It was once believed that Achromobacter infections only occurred in immunocompromised hosts, which has proved to be untrue. Risk factors for Achromobacter infection include use of a foreign device (such as catheters), underlying conditions (such as diabetes or heart disease), and hospitalization. == Role in Cystic Fibrosis == Cystic Fibrosis is a disorder associated with bacterial infections in the respiratory system, leading to lung inflammation and an impairment in lung functioning. Many different pathogens can contribute to lung infection in cystic fibrosis, including Achromobacter. The most common Achromobacter species found in cystic fibrosis patients is A. xylosoxidans. A. xylosoxidans infection has been shown to cause increased lung inflammation and lung disease progression in cystic fibrosis patients. The prevalence of Achromobacter infection in cystic fibrosis patients varies with age, as there is a higher rate of infection in adults than in paediatric patients. == Treatment of Infection == Treatment of Achromobacter infection has proved to be challenging due to inherent antibiotic resistance to the majority of first line antibiotics. In addition, it is difficult to determine how well treatment of the infection works. This is because oftentimes Achromobacter infections present themselves alongside infections of other pathogens. The clinical features of Achromobacter infections are not well understood. == Antibiotic Resistance Mechanisms == Achromobacter have two central mechanisms for antibiotic resistance. Firstly, they pump the antibiotics out of the cell to contribute to antibiotic resistance through efflux pumps. A second mechanism for antibiotic resistance is hydrolysis, or the breaking down, of a type of antibiotic called piperacillin. This is done through chromosomal OXA-114-like β-lactameses. == References == Category:Gram-negative bacteria",
 "title": "Achromobacter"
}