{
 "id": "1119329",
 "text": "The Raffles’ banded langur (Presbytis femoralis), also known as the banded leaf monkey or banded surili, is a critically endangered primate species found in Singapore and southern Peninsular Malaysia. Named after Sir Stamford Raffles, this langur is distinguished by its black fur with white bands on its chest and inner thighs. Conservation efforts have been crucial for this species. Once nearly extinct, their numbers in Singapore are projected to double from 75 to 150 by 2038. However, they still face threats from habitat loss and road accidents. == Features == The Raffles’ banded langur has several distinctive features: # Coloration: They have black fur with striking white bands on their chest and inner thighs, which makes them easily recognizable. # Size: These langurs are medium-sized primates, with adults typically weighing between 6 to 8 kilograms. # Diet: They mainly eat leaves, fruits, and seeds. # Social Structure: They live in small, cohesive groups usually consisting of one male, several females, and their offspring. # Habitat: They are arboreal, spending most of their time in the trees. # Behavior: Raffles’ banded langurs are known for their shy and elusive nature, often avoiding human contact. # Reproduction: Females typically give birth to a single offspring after a gestation period of about 6 months. == Threats faced == The Raffles’ banded langur faces several threats: # Habitat Loss: The primary threat is deforestation and habitat fragmentation due to urban development and agricultural expansion, particularly oil palm plantations in Malaysia. # Road Accidents: Infrastructure development, such as the construction of highways, has led to increased road accidents involving these langurs. # Limited Habitat: They are now confined to small, isolated forest patches, mainly in the Bukit Timah and Central Catchment Nature Reserves in Singapore. # Human Disturbance: Increased human activities in their habitats can lead to disturbances that affect their natural behavior and breeding. # Climate Change: Changes in climate patterns can also impact their habitat and food availability. == References == Category:Old World monkeys Category:Mammals of Asia Category:Endangered species",
 "title": "Raffles' banded langur"
}