{
 "id": "1119662",
 "text": "The Total World Tour was the fifth concert tour of the English singer Joss Stone. The tour was six years long. The tour visited almost every country. It began in Casablanca, Morocco, on 29 March 2014. It ended in Barcelona, Spain, on 3 July 2019. On every day of the tour, Joss Stone met singers in the area and sang with them. She also volunteered for charities in every country. At the concerts in the Middle East, Stone wore a hijab. A hijab is a popular head covering that Muslim women wear. The concert had opening acts in some countries. Some were from the area and others were not. == Iran concert == There was a private show in Iran scheduled for 4 July 2019. Joss Stone arrived for the concert at Kish International Airport. Stone was deported because women are not allowed to perform solo concerts in Iran. The concert did not end up happening. Stone said on Instagram that she cooperated because she did not want to go to prison. == Shows == List of shows, including the date, city, country and venue. Date City Country Venue Ref. Africa 29 March 2014 Casablanca Hippodrome Casa-Anfa 31 March 2014 Vacoas-Phoenix J&J; Auditorium 2 April 2014 Brakpan Big Top Arena 5 April 2014 Maseru 9 April 2014 Manzini House on Fire 13 April 2014 Tunis Carthage Thalasso Resort Oceania 18 April 2014 Tyagarah Tyagarah Tea Tree Farm 20 April 2014 Brisbane The Tivoli 21 April 2014 Tyagarah Tyagarah Tea Tree Farm 24 April 2014 Sydney Enmore Theatre 25 April 2014 Auckland Vector Arena 27 April 2014 Wellington Michael Fowler Centre Asia 1 May 2014 Dubai Dubai Media City Amphitheatre South America 10 May 2014 São Paulo WTC Golden Hall Asia 2 July 2014 Beit ed-Dine Beiteddine Palace Europe 10 July 2014 Henley-on-Thames River Thames 12 July 2014 Rotterdam Ahoy Arena 13 July 2014 Luxembourg City Neumünster Abbey 16 July 2014 Juan-les-Pins La Pinède Gould 17 July 2014 Barcelona Sala Bikini 19 July 2014 Vila Nova de Gaia Praia do Cabedelo do Douro 23 July 2014 Prague Lucerna Music Bar 25 July 2014 Lucerne Lucerne Culture and Congress Centre 27 July 2014 Bratislava Refinery Gallery 29 July 2014 Budapest Budapest Park 30 July 2014 Vienna Arena 1 August 2014 Pula Pula Amphitheatre 2 August 2014 Ljubljana Križanke 23 August 2014 Hamburg Banksstraße South America 27 August 2014 Bogotá Teatro Royal Center North America 29 August 2014 Willemstad Dolphin Academy Curaçao 7 September 2014 Kansas City Crossroads KC 10 September 2014 Highland Park Ravinia Park 11 September 2014 Detroit Sound Board 14 September 2014 Ottawa Hog's Back Park 15 September 2014 Toronto Massey Hall Europe 24 October 2014 Chișinău Filarmonica Națională „Serghei Lunchevici” South America 1 March 2015 Quito Teatro Nacional Sucre 3 March 2015 Lima Huaca Pucllana 6 March 2015 Santiago Teatro Caupolicán 8 March 2015 Buenos Aires Estadio Luna Park 11 March 2015 São Paulo Citibank Hall 13 March 2015 Brasília NET Live Brasília 15 March 2015 Olinda Chevrolet Hall 18 March 2015 Montevideo Gran Teatro Metro 21 March 2015 Asunción Gran teatro del banco central 24 March 2015 Santa Cruz de la Sierra Hard Rock Café Asia 10 April 2015 Muharraq Arad Fort North America 16 May 2015 Winchester MGM Resorts Festival Grounds 18 May 2015 Mexico City El Plaza Condesa Europe 3 July 2015 Schaan SAL North America 5 July 2015 Montreal Métropolis 10 July 2015 Philadelphia World Cafe Live 23 July 2015 Los Angeles The Fonda Theatre Europe 1 August 2015 Little Budworth Oulton Park 3 October 2015 Zürich Kaufleuten 4 October 2015 Murten Hotel Murten Asia 10 October 2015 Hanoi Imperial Citadel of Thăng Long 12 October 2015 Tokyo Billboard Live 13 October 2015 15 October 2015 Osaka 17 October 2015 Shanghai Shanghai Expo Park 18 October 2015 South America 14 November 2015 Punta del Este Conrad Hotel & Casino Africa 20 November 2015 Gaborone Botswanacraft 21 November 2015 Lusaka The Web Asia 10 December 2015 Colombo Barefoot Garden Café North America 15 January 2016 Tela Tela Railroad Company 17 January 2016 San Salvador Scenarium 18 January 2016 Managua Rubén Darío National Theatre 24 January 2016 San José Jazz Café 27 January 2016 Panama City Teatro Amador 29 January 2016 Guatemala City Teatro Lux Asia 14 February 2016 Mumbai Mehboob Studio 18 February 2016 Kathmandu Hyatt Regency Kathmandu 20 February 2016 Dhaka Pop Republic 23 February 2016 Thimphu YDF Hall 28 February 2016 Kaafu Atoll Huvafen Fushi 5 March 2016 Marina Bay Sands North America 18 March 2016 Westbury The Space at Westbury Theater 20 March 2016 Norfolk Infinity Music Hall & Bistro 9 April 2016 St. George's Camper & Nicholsons Port Louis Marina 12 April 2016 Palm Island Palm Island Resort South America 21 April 2016 Caracas La Quinta Bar North America 23 April 2016 Punta Cana Hard Rock Café 3 May 2016 Port of Spain RuStreet Europe 15 May 2016 London Roundhouse 23 June 2016 Rapperswil-Jona Blues 'N' Jazz Festival Grounds 25 June 2016 Tivat Almara Beach Club 4 July 2016 London Royal Festival Hall 9 July 2016 Bree Festivalpark Berkenbroek 12 July 2016 Vilnius Palace of the Grand Dukes of Lithuania 15 July 2016 Pori Kirjurinluoto 16 July 2016 Salacgrīva Salacgrīva Fisherman's Park 18 July 2016 Copenhagen Amager Bio 21 July 2016 Molde Romsdalsmuseet 23 July 2016 Istanbul KüçükÇiftlik Park Asia 25 July 2016 Tel Aviv Barby Europe 29 July 2016 Kassandreia Sani Resort 30 July 2016 Kato Drys Fengaros Festival 12 August 2016 Zofingen Heiternplatz 13 August 2016 Bansko Nikola Vaptsarov Square 14 August 2016 Niš Niš Fortress 6 September 2016 Minsk Palace of the Republic 8 September 2016 Timișoara Banat Village Museum 11 September 2016 Wrocław The Business Club Room at Stadion Wrocław 15 September 2016 Sarajevo Sarajevo National Theatre 17 September 2016 Pristina ZONE Club 11 October 2016 Tallinn Nordea Concert Hall 14 October 2016 Skopje Macedonian Opera and Ballet 16 October 2016 Yerevan Karen Demirchyan Complex 19 October 2016 Kyiv The Freedom Hall 20 October 2016 30 October 2016 Reykjavík Harpa Africa 26 November 2016 Nairobi The Purdy Arms 27 November 2016 Zanzibar City Red Monkey Lodge 1 December 2016 Lilongwe Bingu wa Mutharika International Convention Centre 3 December 2016 Maputo Cinema Scala 5 December 2016 Khartoum Khartoum International Community School 17 January 2017 Djibouti City 21 January 2017 Malabo Sofitel malabo sipopo le golf 23 January 2017 Douala French Institute of Cameroon 26 January 2017 Libreville No Stress Bar 28 January 2017 São Tomé Pestana São Tomé 30 January 2017 Accra +233 Jazz Bar & Grill Asia 2 March 2017 Siem Reap Jaya House River Park 4 March 2017 Yangon Kandawgyi Palace Hotel 6 March 2017 Vientiane Embassy of the United Kingdom 9 March 2017 Bangkok Cloud47 12 March 2017 Dili Hotel Timor 16 March 2017 Taipei ATT Show Box 18 March 2017 Petaling Jaya The Roof at First Avenue Bandar Utama Europe 22 March 2017 Burghausen Wackerhalle Africa 28 April 2017 Ouagadougou French Institute of Burkina Faso 30 April 2017 Lagos Eko Hotels and Suites 3 May 2017 Monrovia RLJ Kendeja Resort & Villas 5 May 2017 Freetown Radisson Blu Mammy Yoko Hotel 8 May 2017 Cotonou Africa Sound City 9 May 2017 Lomé French Institute of Togo 1 June 2017 Kigali Kigali Marriott Hotel 2 June 2017 Harare 7 Arts Theatre 5 June 2017 Brazzaville Hôtel de la préfecture de Brazzaville North America 22 June 2017 Detroit Chene Park 23 June 2017 Rochester Kodak Hall at Eastman Theatre 25 June 2017 Ottawa Confederation Park 26 June 2017 Toronto Danforth Music Hall 28 June 2017 Chicago Thalia Hall 30 June 2017 Milwaukee Briggs & Stratton Big Backyard 1 July 2017 Sioux City Grandview Park Music Pavilion 3 July 2017 Portland Tom McCall Waterfront Park 5 July 2017 Montreal Salle Wilfrid‐Pelletier Europe 7 July 2017 Rotterdam Ahoy Arena 20 July 2017 Pratteln Z7 22 July 2017 Andorra la Vella Acta Arthotel 24 July 2017 Salle Garnier 28 July 2017 Tarvisio Piazza Unità 30 July 2017 Batumi Batumi Tennis Club 5 August 2017 Notodden Hovigs Hangar Africa 30 August 2017 Algiers Sofitel Algiers Hamma Garden 2 September 2017 Bissau Portuguese Cultural Centre 5 September 2017 Banjul Jaama Hall at the Kairaba Beach Hotel 8 September 2017 Dakar Pullman Dakar Teranga 9 September 2017 Nouakchott Rotana Café 13 September 2017 Bamako French Institute of Mali Europe 8 October 2017 Dublin Vicar Street 10 October 2017 Belfast Ulster Hall 13 October 2017 Glasgow Glasgow Royal Concert Hall 15 October 2017 Cardiff Neuadd Dewi Sant 17 October 2017 London Royal Festival Hall 2 October 2017 Chișinău Filarmonica Națională „Serghei Lunchevici” 26 October 2017 Tirana Tulla Culture Center 18 November 2017 Rotterdam Ahoy Arena 22 November 2017 Hasselt Ethias Arena 23 November 2017 Antwerp Sportpaleis 24 November 2017 25 November 2017 Africa 28 November 2017 Luanda Clube Naval 30 November 2017 Windhoek Warehouse Theatre 2 December 2017 Addis Ababa Mosaic Hotel 10 January 2018 Conakry Noom Hotel Conakry 12 January 2018 Abidjan Sofitel Abidjan Hôtel Ivoire 18 January 2018 Kampala Design Hub Kampala 20 January 2018 Cairo Mantis 23 January 2018 Asmara Cinema Roma 26 January 2018 N'Djamena French Institute of Chad Asia 3 March 2018 Baku Rotunda Jazz Club 6 March 2018 Tashkent Ilkhom Theatre 9 March 2018 Almaty Hard Rock Café 11 March 2018 Bishkek Asanbay Center 14 March 2018 Ulaanbaatar Kempinski Hotel Khan Palace 18 March 2018 Seoul Hanatour V-Hall 26 April 2018 Muscat Crowne Plaza 27 April 2018 Kuwait City Dar al Athar al Islamiyyah 30 April 2018 Ramallah Capers 3 May 2018 Amman Odeon theater 4 May 2018 Doha InterContinental North America 3 June 2018 Columbia Merriweather Post Pavilion 7 June 2018 Nassau Bond Nightclub 10 June 2018 Kingston Strawberry Hill 13 June 2018 St. John's Galley Bay Resort & Spa Europe 14 July 2018 Veszprém História kert 15 July 2018 Villafranca di Verona Scaligero Castle 17 July 2018 Serravalle Palace Hotel 19 July 2018 Stuttgart Schloßplatz 20 July 2018 Ostrava Lower Vítkovice 22 July 2018 Porto Cabedelo do Douro Beach 28 July 2018 Saint Petersburg Kirov Central Park of Culture and Recreation 9 August 2018 Schaffhausen Festivalgelände Herrenacker North America 11 August 2018 Richmond Maymont Europe 12 October 2018 St. Julian's Hugo's Terrace Africa 14 October 2018 Niamey Level Club & Lounge 18 October 2018 Bangui La brasserie KISS 20 October 2018 Victoria Tamassa Lounge and Bar 25 October 2018 Antananarivo KUDéTA 27 October 2018 Moroni Golden Tulip Grande Comore Moroni Resort & Spa 2 November 2018 Hargeisa Hiddo Dhowr North America 27 November 2018 Gros Islet Harbor Club St. Lucia, Curio Collection by Hilton 30 November 2018 Charlestown Nevis Performing Arts Center South America 3 December 2018 Buenos Aires Teatro Colón 5 December 2018 São Paulo Tom Brasil 7 December 2018 Mostazal Gran Arena Monticello Antarctica December 2018 North America 21 December 2018 Belize City The Signature Lounge 17 January 2019 Havana National Theatre of Cuba 20 January 2019 Surinam Naniki 22 January 2019 Roseau Alliance française de la Dominique 26 January 2019 Port-au-Prince Karibe Hotel 28 January 2019 Georgetown Eucalyptus Garden Theatre 30 January 2019 Paramaribo Courtyard by Marriott Asia 25 February 2019 Bandar Seri Begawan JIS Arts Centre 1 March 2019 Al-Malikiyah rowspan=\"2\" 5 March 2019 Duhok 7 March 2019 Ashgabat Watan Theatre 9 March 2019 Dushanbe Istiqlol Sports Bar 13 March 2019 Pyongyang International Cinema Hall 16 March 2019 Islamabad Africa 6 April 2019 Praia Pestana Trópico Europe 10 April 2019 Stockholm O-Baren Oceania 15 April 2019 Koror Palau Central Hotel 20 April 2019 Port Moresby Lamana Hotel 22 April 2019 Honiara Coral Sea Resort & Casino 24 April 2019 Port Vila K2 26 April 2019 Savusavu Jean-Michel Cousteau Resort 27 April 2019 Nukuʻalofa New Zealand High Commission in Tonga 1 May 2019 Funafuti Funafuti International Airport 4 May 2019 Yangor Nauru Centennial Hall 7 May 2019 Apia Funway Park 9 May 2019 Betio Betio Sports Complex 11 May 2019 Laura Laura Beach 14 May 2019 Peidie Cupid's Asia 19 May 2019 Lhasa Africa 22 May 2019 Kinshasa Showbuzz 25 May 2019 Bujumbura Arena 27 May 2019 Juba Acacia Village Asia 3 June 2019 Kabul rowspan=\"2\" 23 June 2019 Jeddah North America 21 June 2019 Eagan Twin Cities Orthopedics Performance Center Africa 30 June 2019 Tripoli Gargarish Park 1 July 2019 Al Mahrah 3 July 2019 Barcelona Palau Reial de Pedralbes === Cancelled shows === Date City Country Venue Reason for cancellation Ref. 16 April 2016 Durants Holders House Cancelled so Joss Stone could be with her sick dog. Initially postponed to 5 May. Later cancelled. 4 July 2019 Kish Island Cancelled by the Government of Iran. Women are not allowed to perform concerts in Iran. == Notes == == References == Category:Concert tours",
 "title": "Total World Tour"
}