{
 "id": "1119731",
 "text": "Category:Lists of stars This is an incomplete list of the smallest known stars. Most of the stars in this list are within the Milky Way except BAT99-123 (near the end of the list), which is in the Large Magellanic Cloud. Smallest stars are mostly red dwarfs, brown dwarfs, white dwarfs and neutron stars. 1 solar radius (radius of the Sun) = 695700 km Star name Star radius (in solar radii) Star type Notes RX J0720.4-3125 0.000007187 Neutron star 4U 1820-30 0.00001308035 Pulsar PSR B1257+12 0.00001437401 Pulsar Coolest neutron star known. Orbited by 3 exoplanets. Crab Pulsar 0.00001437401 Pulsar A very young neutron star (went supernova in 1054 AD) Geminga 0.00001437401 Pulsar PSR B0943+10 0.00001437401 Pulsar Hottest neutron star known XTE J1739-285 0.00001566767 Neutron star or quark star Vela Pulsar 0.00001799626 Pulsar PSR J0348+0432 A 0.00001868621 Pulsar PSR J1748-2446ad 0.00002299841 Pulsar Fastest rotating neutron star known PSR B1620-26 A 0.00003737243 Pulsar Orbited by one of the oldest exoplanets known HD 49798 0.0023 White dwarf One of the hottest white dwarfs known, GRW+70 8247 0.0047 White dwarf BPM 37093 0.0057 White dwarf IK Pegasi B 0.006 White dwarf One of the closest stars to Earth that can possibly become a Type Ia supernova. Sirius B 0.0079 White dwarf Closest known white dwarf Earth (for comparison) 0.00916 Rocky planet Reported for reference AR Scorpii 0.01 White dwarf Only known white dwarf pulsar DN Draconis 0.01 White dwarf Van Maanen 2 0.011 White dwarf Procyon B 0.0124 White dwarf ESO 439-26 0.0126 White dwarf Least luminous white dwarf known WD 1145+017 0.02 White dwarf NGC 3132 Central Star 0.0323 Proto-white dwarf Has an A-type star companion. KPD 0005+5106 0.055 White dwarf One of the hottest white dwarfs known PSR J0348+0432 B 0.0651 White dwarf TMTS J052610.43+593445.1 0.0659 B type subdwarf Smallest known non-degenerate star. [MCG2003] Sex A PN 1 Central Star 0.079 O type subdwarf CWISE J124909.08+362116.0 0.08 Brown dwarf or red dwarf A hypervelocity star. Epsilon Indi Ba 0.08 Brown dwarf Epsilon Indi Bb 0.082 Brown dwarf Luhman 16A 0.085 Brown dwarf Nearest brown dwarf system to the Sun. EBLM J0555-57Ab 0.0862 Red dwarf Commonly known as the lower limit for main sequence stars. SSSPM J0829-1309 0.088 Red dwarf WISE 0855-0714 0.09 Brown dwarf The coolest star known (temperature very similar to Earth). 2MASS 0939-2448 0.09 Brown dwarf SCR 1845-6357 B 0.096 Brown dwarf SCR 1845-6357 A 0.096 Red dwarf Jupiter (for comparison) 0.1 Gas giant planet Reported for reference CoRoT-3b 0.1 Brown dwarf HD 114762 B 0.1 Red dwarf R Aquarii B 0.1 White dwarf 2MASS J0523-1403 0.101 Red dwarf Coolest and least massive main sequence star known LHS 2924 0.103 Red dwarf Luhman 16B 0.104 Brown dwarf Nearest brown dwarf system to the Sun. 2MASS J04285096-2253227 0.1095 Red dwarf DX Cancri 0.11 Red dwarf LHS 292 0.11 Red dwarf TVLM 513-46546 0.11 Red dwarf Gliese 229B 0.112 Brown dwarf OGLE-TR-122B 0.116 Red dwarf VB 10 0.1183 Red dwarf TRAPPIST-1 0.1192 Red dwarf Orbited by at least 7 confirmed Earth-sized rocky exoplanets, at least 3 are potentially habitable. Teegarden's star 0.12 Red dwarf Has 2 potentially habitable exoplanets. LHS 2090 0.12 Red dwarf VB 8 0.1214 Red dwarf SPECULOOS-3 0.123 Red dwarf CFBDSIR 1458+10B 0.13 Brown dwarf Teide 1 0.13 Brown dwarf Gliese 412B 0.13 Red dwarf Wolf 359 0.145 Red dwarf NN Serpentis B 0.15 Red dwarf CFBDSIR 1458+10A 0.15 Brown dwarf Proxima Centauri 0.1542 Red dwarf Closest star to Sun. UV Ceti 0.16 Red dwarf BL Ceti 0.167 Red dwarf YZ Ceti 0.168 Red dwarf UY Sextantis 0.17 B type subdwarf A B type subdwarf star is a star with temperatures similar to B type main sequence stars but are significantly smaller and less luminous. Cha 110913-773444 0.18 Brown dwarf One of the least massive stars known HW Virginis 0.183 B type subdwarf Barnard's star 0.187 Red dwarf Ross 248 0.19 Red dwarf Will become closest star to Sun about 35000 years later Ross 128 0.1967 Red dwarf Ross 154 0.2 Red dwarf Kepler-70 0.2 B type subdwarf Wolf 227 0.2 Red dwarf RR Caeli 0.203 Red dwarf Gliese 1214 0.204 Red dwarf LHS 1140 0.2055 Red dwarf CT Chamaeleontis B 0.22 Brown dwarf One of the least massive stars known NGC 5882 Central Star 0.227 Proto-white dwarf Fomalhaut C 0.23 Red dwarf OTS 44 0.23 Brown dwarf One of the least massive stars known CM Draconis B 0.2396 Red dwarf 2M1207A 0.25 Brown dwarf CM Draconis A 0.2529 Red dwarf DG Canum Venaticorum 0.2529 Red dwarf 55 Cancri B 0.27 Red dwarf Kapteyn's star 0.29 Red dwarf Gliese 581 0.3 Red dwarf Wolf 1061 0.319 Red dwarf Gliese 1 0.33 Red dwarf Luyten's star 0.35 Red dwarf Kruger 60A 0.35 Red dwarf Struve 2398A 0.354 Red dwarf Z Andromedae B 0.36 White dwarf Largest and most luminous white dwarf known EV Lacertae 0.36 Red dwarf AT Microscopii B 0.37 Red dwarf Regulus C 0.37 Red dwarf Groombridge 34A 0.38 Red dwarf Lalande 21185 0.393 Red dwarf AT Microscopii A 0.41 Red dwarf AD Leonis 0.423 Red dwarf Gliese 436 0.432 Red dwarf WR 93b 0.44 Wolf-rayet star BAT99-123 0.47 Wolf-rayet star Located in the Large Magellanic Cloud Lacaille 9352 0.473 Red dwarf Kepler-1 B 0.5 Red dwarf Sun (for comparison) 1 G type main sequence star Reported for reference",
 "title": "List of smallest stars"
}