{
 "id": "111989",
 "text": "The WWE Brand Extension or brand split is a process used by professional wrestling company WWE with the purpose of dividing their personnel (wrestlers, commentators, referees, etc.) into two brands, Raw and SmackDown. The first brand extension started in 2002 and ended in 2011. From 2006 to 2010 ECW was the third brand. The second and current brand extension started in 2016, with their developmental territory NXT being added as a brand. Former brands also include the United Kingdom-based NXT UK and the cruiserweight brand 205 Live. == History == === Beginning of first brand extension (2002) === ==== Background ==== After buying World Championship Wrestling (WCW), its business opponent through the 1990s, in March 2001, the World Wrestling Federation (WWF) wanted to find a way to split itself into two separate brands, because of the numbers of Superstars that it had gotten as part of WCW's purchase. On March 18, 2002, Linda McMahon announced the \"brand extension\" in which the company would be split into two distinct brands. In terms of storyline, Ric Flair had become co-owner of the WWF following Survivor Series 2001 where Shane and Stephanie McMahon sold their stocks to Flair in order to buy WCW and Extreme Championship Wrestling (ECW). Mr. McMahon did not like having to share his creation with Flair and looked for a way to stop their partnership. After entering a feud with The Undertaker, Flair sought a match with him at WrestleMania X8. However, the WWF Board of Directors would only allow the match if Flair were to give all control of the WWF to McMahon. Flair agreed, however, the Board also reserved the right to review the ownership status of the WWF following WrestleMania. Their decision was to split the entire WWF roster into two separate brands, with Vince McMahon in control of the SmackDown! brand and Ric Flair in control of the RAW brand. A draft was started the following week on RAW. Each owner would get a total of thirty picks. The brand extension officially began on April 1, 2002. By having two brands in place, the WWF was able to increase the number of live events held each year from 200 to 350. ==== Superstar selections ==== The 2002 World Wrestling Federation (WWF) Brand Extension Draft took place at Penn State University in State College, Pennsylvania on March 25, 2002. The first half of the draft was televised live on TNN for two hours, on WWE's flagship program, Raw. The second half, or the supplemental draft, was conducted over the internet on WWF's official website, WWF.com. There were thirty draft picks, with sixty superstars drafted overall by co-owners of the WWF, Ric Flair and Mr. McMahon, onto their respective brands, RAW and SmackDown!. For the televised half of the draft, ten brand selections were manually made by Flair and McMahon. The supplemental draft was however conducted as a draft lottery, with each brand receiving twenty random draft selections. On the March 18, 2002 episode of RAW, Mr. McMahon won a coin toss to determine who would receive the first draft selection. Pick No. Brand (to) Round No. Employee Notes SmackDown! The Rock Raw The Undertaker SmackDown! Kurt Angle Raw nWo (Kevin Nash, X-Pac and Scott Hall) SmackDown! Chris Benoit Drafted while recovering from neck surgery. Benoit returned on the Raw brand instead. Raw Kane SmackDown! Hollywood Hulk Hogan Raw Rob Van Dam Van Dam was the WWF Intercontinental Champion, making the title exclusive to Raw. SmackDown! Billy and Chuck Billy and Chuck were the WWF Tag Team Champions, making the titles exclusive to SmackDown!. Billy and Chuck's manager, Rico, went along with them in the draft. Raw Booker T SmackDown! Edge Raw Big Show SmackDown! Rikishi Raw Bubba Ray Dudley SmackDown! D-Von Dudley Raw Brock Lesnar McMahon tried to use his 9th draft pick for Lesnar but, as it was not his pick, Flair immediately picked Lesnar as his 8th pick. Lesnar's manager, Paul Heyman, went along with him in the draft. SmackDown! Mark Henry Raw William Regal Regal was the WWF European Champion, making the title exclusive to Raw. SmackDown! Maven Maven was the WWF Hardcore Champion, making the title exclusive to SmackDown!. However, Raven defeated Maven for the championship before the brand extension became active, bringing the title to Raw with him. Raw Lita SmackDown! Billy Kidman Raw Bradshaw SmackDown! Tajiri Tajiri was the WWF Cruiserweight Champion, making the title exclusive to SmackDown!. Raw Steven Richards SmackDown! Chris Jericho Raw Matt Hardy SmackDown! Ivory Raw Raven SmackDown! Albert Raw Jeff Hardy SmackDown! The Hurricane Raw Mr. Perfect SmackDown! Al Snow Raw Spike Dudley SmackDown! Lance Storm Raw D'Lo Brown SmackDown! Diamond Dallas Page Raw Shawn Stasiak SmackDown! Torrie Wilson Raw Terri SmackDown! Scotty 2 Hotty Raw Jacqueline SmackDown! Stacy Keibler Raw Goldust SmackDown! Christian Raw Trish Stratus SmackDown! Test Raw Justin Credible SmackDown! Faarooq Raw Big Boss Man SmackDown! Tazz Raw Tommy Dreamer SmackDown! Hardcore Holly Raw Crash Holly SmackDown! Val Venis Raw Mighty Molly SmackDown! Perry Saturn Notes: * Picks No. 1–20 were made live on Raw * Picks No. 21–57 were conducted via lottery on the WWF's website ===== Undrafted ===== Several wrestlers remained undrafted for various reasons. Employee Reason for not being drafted Brand after being drafted Triple H Triple H was the Undisputed WWF Champion, and could appear on both shows as the title could be competed for on both brands. It was then announced that whoever was to defeat him for the title, Triple H would join that challenger’s brand. SmackDown!'s Hollywood Hulk Hogan won the title from Triple H, therefore Triple H was assigned to SmackDown! SmackDown! Jazz Jazz was the WWF Women's Champion, and could appear on both shows as the title could be competed for on both brands After losing the title, she joined the Raw brand. Raw Chris Jericho Jericho had a match for the Undisputed WWF Championship on the night of the draft. After losing, Jericho joined SmackDown!. SmackDown! Stephanie McMahon McMahon had a match for the Undisputed WWF Championship the night of the draft. After losing, McMahon was forced to leave the company. She later returned as SmackDown!'s General Manager. SmackDown! Stone Cold Steve Austin Austin was named a free agent in the draft by Linda McMahon, and chose to sign to Raw. Raw ==== Aftermath ==== On the June 10, 2002 edition of Raw, McMahon became the only owner of World Wrestling Entertainment when he defeated Flair in a No Holds Barred match. === Addition of ECW (2006) === ==== Background ==== After World Wrestling Entertainment (WWE) bought all of Extreme Championship Wrestling (ECW) in 2003, the company began releasing DVDs showing the original ECW. Soon afterwards, the company promoted two ECW reunion shows featuring WWE and former ECW wrestlers, One Night Stand in 2005 and in 2006. On May 26, 2006, WWE announced a new brand, ECW, a revival of the 1990s promotion. The new brand debuted on the Sci Fi Channel on June 13, 2006. ==== Superstar selections ==== The 2006 World Wrestling Entertainment (WWE) Brand Extension Draft took place from the Tacoma Dome in Tacoma, Washington on May 29, 2006, where ECW representative, Paul Heyman, drafted two superstars, one from SmackDown! and one from RAW onto the new ECW brand. Pick No. Brand (to) Employee Role Brand (from) 1 ECW Rob Van Dam Male wrestler Raw 2 Kurt Angle SmackDown! === Aftermath and end of first brand extension (2007–2011) === In late 2007, SmackDown! and ECW superstars began to appear on both shows as part of a (kayfabe) deal between ECW General Manager Armando Estrada and SmackDown General Manager Vickie Guerrero. On February 2, 2010, ECW was announced to be replaced by a new show, NXT. The ECW brand no longer existed, with every ECW wrestler becoming a free agent after the show ended. On August 29, 2011, it was announced that wrestlers and championships were no longer exclusive to Raw and SmackDown, and that everyone could now compete for both shows, therefore the first brand extension came to an end. === Second brand extension (2016–present) === On May 25, 2016, it was announced that beginning July 19, SmackDown would broadcast live on Tuesday nights. Previously the show was usually filmed on Tuesdays and aired on Thursdays or Fridays. It was also said that from that date on both Raw and SmackDown would get a unique roster and set of writers. This started the second brand extension. NXT, which in the meantime was changed to be WWE's developmental territory, became the third brand where people could be drafted from to one of the two main roster shows. From May to September 2019, following the Superstar Shake-up, a Wild Card Rule allowed a limited number of wrestlers per week to compete at the other show, with interbrand matches happening weekly on Raw and SmackDown Live, as well as at pay-per-view and livestreaming events. == Impact == === Interbrand competition === Interbrand competition was kept at a minimum, with superstars from all brands competing together only at pay-per-view events. However, in 2003, all pay-per-view events became brand exclusive, except for the \"big four\" pay-per-views (WrestleMania, SummerSlam, Survivor Series, and the Royal Rumble), which remained interbrand shows. Starting in late 2006, in an attempt to add more star power to the shows, interbrand matches became more common. Most notably, MNM and The Hardys reformed, despite the fact that the teammates were on separate brands. Bobby Lashley is also notable for his interbrand action, who was involved in a storyline with the WWE Chairman, Mr. McMahon. The return of Saturday Night's Main Event to NBC has also lead to more interaction between the brands. In 2009 and 2010, WWE held the Bragging Rights pay-per-view event, where Raw's wrestlers competed against SmackDown's wrestlers. A similar concept was used at Survivor Series between 2016 and 2021. === Pay-per-views === The separation of the WWE roster between two brands also intended to split the pay-per-view offerings, which began with Bad Blood in June 2003. The original idea had the \"major\" pay-per-view events at the time (Royal Rumble, SummerSlam, Survivor Series, and WrestleMania) would be the only shows where wrestlers from different brands would interact with each other, and even among the four shows only the Royal Rumble and WrestleMania would have wrestlers from different brands competing against each other. Wrestlers, as a result, appeared only in two thirds of the shows. Eventually, WWE stopped making single-brand pay-per-view events following WrestleMania 23. December to Dismember and New Year's Revolution were cancelled following the announcement. After the brand extension was reintroduced in 2016, WWE started making their pay-per-view and livestreaming events single-branded again, except for the \"big four\" events. This stopped again following WrestleMania 34 in 2018. === Championships === In the early months of the brand extension. the WWE Undisputed Championship and WWE Women's Championship were available to both brands. The other championships were exclusive to the brand the champion was a part of. With several championships being exclusive to one brand, numerous wrestlers were left with no title to fight for. This issue was solved in September 2002 when the Undisputed Championship became the WWE Championship again and was moved to SmackDown!, while Eric Bischoff created the World Heavyweight Championship for RAW. SmackDown! then created the WWE Tag Team Championship, brought back the the United States Championship, and became the exclusive home of the Cruiserweight Championship. Meanwhile, Raw became the exclusive home of the World Tag Team Championship, the Intercontinental Championship, and the Women's Championship. This meant that each brand now had four championships. When ECW was added in 2006, the ECW Championship was re-established as that brand's world title. ==Related pages== * WWE Draft * List of WWE personnel == References == Category:WWE Category:WWE Raw Category:WWE SmackDown! Category:Extreme Championship Wrestling",
 "title": "WWE Brand Extension"
}