{
 "id": "1119113",
 "text": "The Ghana national under-17 football team represents Ghana in youth international football completions. They have won the FIFA U-17 World Cup twice in 1991 and 1995. They have also won the Africa U-17 Cup of Nations twice in 1995 and 1999. == Competitive Record == === FIFA U-17 World Cup Record === Year Round GP W D* L GS GA 1985 did not participate did not participate did not participate did not participate did not participate did not participate did not participate 1987 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 1989 First round 3 0 2 1 2 3 1991 Champions 6 4 2* 0 8 3 1993 Runners-up 6 5 0 1 14 3 1995 Champions 6 6 0 0 13 4 1997 Runners-up 6 4 1 1 14 5 1999 Third place 6 4 2* 0 19 5 2001 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2003 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2005 First round 3 0 3 0 3 3 2007 Fourth place 7 4 0 3 13 9 2009 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2011 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2013 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2015 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2017 Quarterfinals 5 3 0 2 8 3 2019 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2023 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2025 to be determined to be determined to be determined to be determined to be determined to be determined to be determined Total 9/20 48 30 10 8 94 38 === Africa U-17 Cup of Nations Record === Year Round GP W D* L GS GA 1995 Champions 5 5 0 0 16 1 1997 Third place 5 3 0 2 9 6 1999 Champions 5 3 1 1 8 3 2001 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2003 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2005 Runners- up 5 3 0 2 7 5 2007 Third place 5 3 0 2 11 5 2009 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2011 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2013 Group stage 3 0 2 1 2 7 2015 Disqualified Disqualified Disqualified Disqualified Disqualified Disqualified Disqualified 2017 Runners-up 5 2 2* 1 9 1 2019 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2023 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify 2025 did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify did not qualify Total 7/15 33 19 5 9 62 28 === CAF U-16 and U-17 World Cup Qualifiers record === Year Round GP W D* L GS GA GD 1985 did not participate did not participate did not participate did not participate did not participate did not participate did not participate did not participate 1987 Second round 2 0 2 0 1 1 0 1989 Third round 4 2 1 1 5 3 +2 1991 Fourth round 5 3 1 1 8 3 +5 1993 Final Round 4 4 0 0 9 1 +8 Total 4/5 15 9 4 2 23 8 +15 *Draws include knockout matches decided on penalty kicks. ;Overall U17 Record: U17 Record GP W D L GF GA GD Success U17 World Cup Finals 48 30 10 8 94 38 +56 74.42% U17 Africa Quals/ Finals 58 38 8 12 108 44 +64 72.41% U17 Total 106 68 18 20 202 82 +120 73.42% FIFA U-17 World Cup Record by team Ghana versus GP W D* L GF GA GD Succ. 5 2 2 1 6 5 +1 60% 5 3 1* 1 9 7 +2 70.00% 2 2 0 0 2 0 +2 100% 2 1 1 0 4 3 +1 75% 2 1 0 1 5 1 +4 50% 2 2 0 0 8 1 +7 100% 2 2 0 0 5 2 +3 100% 3 2 0 1 4 1 +3 75% 2 2 0 0 7 2 +5 100% 2 1 1 0 3 1 +2 75% 1 0 1 0 0 0 0 50% 1 1 0 0 2 1 +1 100% 1 1 0 0 2 0 +2 100% 1 0 1 0 0 0 +0 50% 1 1 0 0 7 1 +6 100% 1 0 1* 0 0 0 0 50% 1 1 0 0 4 0 +4 100% 1 1 0 0 1 0 +1 100% 1 1 0 0 3 0 +3 100% 2 1 1 0 3 1 +2 75% 1 0 1 0 1 1 0 50% 1 0 0 1 1 2 -1 0% 2 0 0 2 3 5 -2 0% 1 1 0 0 4 1 +3 100% 2 2 0 0 3 1 +2 100% 1 1 0 0 4 0 +4 100% 1 1 0 0 2 0 +2 100% 1 0 0 1 1 2 -1 0% Total 47 29 10 8 92 38 +54 74.42% *Denotes draws including the 1991 & 1999 Semi-Final matches decided on penalty kicks v Qatar (4-2p) & Brazil (2-4p). Africa U-17 Cup of Nations Record by team Ghana versus GP W D* L GF GA GD Succ. 5 2 1 2 5 5 0 50% 1 1 0 0 2 0 +2 100% 2 2 0 0 8 0 +8 100% 2 1 1 0 3 0 +3 75% 4 1 0 3 5 11 -6 0% 2 2 0 0 5 1 +4 100% 2 1 0 1 4 3 +1 50% 1 1 0 0 2 0 +2 100% 2 2 0 0 5 0 +5 100% 3 2 0 1 7 4 +3 75% 2 1 0 1 1 1 0 50% 2 1 1 0 2 0 +2 75% 1 1 0 0 6 0 +6 100% 1 0 0 1 1 2 -2 0% 1 0 1 0 1 1 0 50% 1 1 0 0 7 1 +6 100% 1 0 1* 0 0 0 0 50% Total 33 19 5 9 64 29 +35 69.11% *Denotes draws including the 2017 Semi-Final match decided on penalty kicks v Niger (6-5p). CAF U-16 and U-17 World Cup Qualifiers record by team Ghana versus GP W D* L GF GA GD Succ. 2 1 1 0 1 1 0 75% 2 1 0 1 2 2 0 50% 2 1 1 0 2 1 +1 75% 2 1 0 1 3 3 0 50% 2 1 1 0 3 0 +3 75% 1 1 0 0 2 0 +2 100% 2 2 0 0 4 1 +3 100% 2 2 0 0 5 0 +5 100% Total 15 9 4 2 23 8 +15 78.12% ==References== Category:National under-17 football teams Category:National sports teams of Ghana Category:Football in Ghana",
 "title": "Ghana national under-17 football team"
}