{
 "id": "1119817",
 "text": "Andinobates is a group of frogs. They are poison dart frogs. They live in Ecuador, Colombia, and Panama. Scientists used to think these frogs were in Dendrobates and Ranitomeya but they changed their minds in 2011. Twomey, Brown, and their colleagues made the genus Andinobates for 12 frogs. Andinobates frogs are different from Ranitomeya frogs because their 2nd and 3rd back bones grow together into one bone. They do not have color patterns on their legs, and Ranitomeya frogs do have patterns. ==Home== Andinobates live in rainforests in Ecuador, Colombia, and Panama, but Ranitomeya frogs only live in the Amazon Basin. == Species == Andinobates had 12 species from Ranitomeya. In 2013, scientists found Andinobates cassidyhornae in the Andes mountains and wrote a paper about it.Amézquita, A., et al. (2013). A new species of Andean poison frog, Andinobates (Anura: Dendrobatidae), from the northwestern Andes of Colombia. Zootaxa 3620 (1): 163-178. In 2014, they found Andinobates geminisae in Panama.Batista, A., et al. (2014). A new species of Andinobates (Amphibia: Anura: Dendrobatidae) from west central Panama. Zootaxa 3866 (3): 333-352. This brings the current total to 16 species: Image Scientific name Common name Distribution Andinobates abditus (Myers and Daly, 1976) Collins' poison frog. Ecuador Andinobates altobueyensis (Silverstone, 1975) Alto de Buey poison frog, golden poison-arrow frog, and golden poison frog Chocó Department of western Colombia Andinobates bombetes (Myers and Daly, 1980) Cauca Poison Frog Colombia. Andinobates cassidyhornae (Amézquita et al., 2013) Colombia Andinobates claudiae (Jungfer, Lötters, and Jörgens, 2000) Panama. Andinobates daleswansoni (Rueda-Almonacid, Rada, Sánchez-Pacheco, Velásquez-Álvarez, and Quevedo-Gil, 2006) Caldas, Colombia Andinobates dorisswansonae (Rueda-Almonacid, Rada, Sánchez-Pacheco, Velásquez- Álvarez, and Quevedo-Gil, 2006) Tolima, Colombia Andinobates fulguritus (Silverstone, 1975) yellow-bellied poison frog, yellow-bellied poison-arrow frog, or yellowbelly poison frog northwestern Colombia (Chocó Department and the westernmost Antioquia and Risaralda) and east-central Panama Andinobates geminisae (Batista et al., 2014) Panama Andinobates minutus (Shreve, 1935) blue-bellied poison frog or bluebelly poison frog Colombia and Panama Andinobates opisthomelas (Boulenger, 1899) Andean Poison Frog Colombia Andinobates tolimensis (Bernal-Bautista, Luna-Mora, Gallego, and Quevedo-Gil, 2007) Tolima, Colombia Andinobates viridis (Myers and Daly, 1976) Green poison frog Cordillera Occidental, Colombia Andinobates virolinensis (Ruiz-Carranza and Ramírez-Pinilla, 1992) Santander poison frog Colombia Santander and Cundinamarca departments ==References== Category:Poison dart frogs Category:Frogs of South America",
 "title": "Andinobates"
}