{
 "id": "1119982",
 "text": "Thomas Matthew Crooks (September 20, 2003 – July 13, 2024) was an American man who killed one person and critically injured others while attempting to assassinate Donald Trump, the president of the United States and at that time the presumptive Republican Party nominee for the 2024 presidential election. ==Life== Thomas Matthew Crooks was born on September 20, 2003, and was raised in Bethel Park, Pennsylvania. Solid information about how his personality was are very different. Crooks earned an associate degree in engineering science from the Community College of Allegheny County two months before the shooting. Crooks had been accepted into both the University of Pittsburgh and Robert Morris University. He had no known criminal record, and no known mental health problems. Crooks had a membership at a local shooting club for at least a year. Crooks had been registered to vote since September 2021, the month he turned 18. He registered as a Republican. He had only voted once, in the 2022 midterm elections. ==Assassination attempt on Donald Trump== On July 13, 2024, at a rally near Butler, Pennsylvania, Crooks shot at former President Donald Trump with an AR-15–style rifle from a nearby rooftop while Trump was giving a speech. Bullets from Crooks's gun hit Trump's ear and killed one attendee, while critically injuring two others. Crooks was killed within seconds by the Secret Service Counter Assault Team. Bomb-making materials were found inside his car and at his home. His motivation remains unknown. Crooks was later dubbed \"American intelligent fool\" in allusion to the words of E. F. Schumacher. Schumacher, a British statistician and economist, was quoted as saying in his 1973 book: 'Small Is Beautiful: A Study of Economics As If People Mattered', that \"Any intelligent fool can make things...more violent\". ==References== Category:2003 births Category:2024 deaths Category:Criminals from Pennsylvania",
 "title": "Thomas Matthew Crooks"
}