{
 "id": "1119861",
 "text": "The UEFA Euro 2024 final was a football game to decide the winners of the UEFA Euro 2024. It was played in Berlin, Germany, on 14 July 2024. Spain played England. This was England's second final in a row, but their first final outside their home country. The match started slow, with no goals in the first half. Spain's Rodri got hurt and had to be replaced. In the second half, Spain's Nico Williams scored first. Later, England's Cole Palmer made it 1-1. Near the end, Mikel Oyarzabal scored for Spain, making it 2-1. Spain won the match. Nico Williams was the best player in the game. Rodri was named Player of the Tournament. Lamine Yamal, who helped with the first goal, was the best young player. Spain won their fourth title, more than any other team. They won all their games and scored the most goals in a single tournament. England lost two finals in a row, the first team to do so. == Road to the final == === Spain === Spain's route to the final Opponent Result 3–0 1–0 1–0 4–1 2–1 2–1 Spain qualified for the tournament by winning Group A, with seven wins out of eight matches. They lost only to Scotland. In Group B, they were with Croatia, Italy, and Albania. Spain started by beating Croatia 3-0, with goals from Álvaro Morata, Fabián Ruiz, and Dani Carvajal. Lamine Yamal became the youngest player to play in the tournament. Next, Spain won against Italy 1-0 with a Riccardo Calafiori own goal. They finished the group stage with a 1-0 win over Albania, thanks to a goal by Ferran Torres. In the Round of 16, Spain defeated Georgia 4-1. Goals came from Rodri, Fabián, Nico Williams, and Dani Olmo. In the quarter-finals, Spain beat Germany 2-1 after extra time, with Mikel Merino scoring the winning goal. In the semi-finals, Spain won 2-1 against France. Randal Kolo Muani scored first for France, but Yamal and Olmo scored for Spain. Spain reached the final for the first time since 2012. Yamal became the youngest player to score in the tournament. === England === England's route to the final Opponent Result 1–0 1–1 0–0 2–1 1–1 2–1 England qualified for the tournament by winning Group C, with six wins out of eight matches. In Group C, they played Serbia, Denmark, and Slovenia. England started with a 1-0 win over Serbia, thanks to a header by Jude Bellingham. Next, they drew 1-1 with Denmark; Harry Kane scored first, and Denmark equalised before half-time. Their last group match against Slovenia ended 0-0. England finished top of the group and moved to the knockout stage. In the Round of 16, England played Slovakia and won 2-1. Ivan Schranz scored first for Slovakia, but Bellingham equalised with a bicycle kick in added time. Kane scored the winner in extra time. In the quarter-finals, England drew 1-1 with Switzerland and won the penalty shoot-out 5-3. Saka scored England's goal in the match. In the semi-finals, England played the Netherlands and won 2-1. Xavi Simons scored first for the Dutch, but Kane equalized with a penalty. Palmer assisted Ollie Watkins for the winning goal in the 90th minute. England reached their first major final outside their home country and their second consecutive European Championship final. === Head-to-Head === England and Spain last played in a major tournament during the Euro 1996 quarter-final. England won 4-2 on penalties after a 0-0 draw. Gareth Southgate, the current England manager, was a player in that match. Spain's only win over England in a major tournament was 1-0 in the 1950 FIFA World Cup. Their latest competitive matches were in the 2018–19 UEFA Nations League. Spain won 2-1 at Wembley, and England won 3-2 in Seville. In the past year, England and Spain have faced each other in four finals across different levels: the 2023 UEFA European Under-21 Championship, the 2023 FIFA Women's World Cup, and the 2024 UEFA Women's Under-17 Championship. England won the Under-21 final 1-0, featuring players Álex Baena for Spain, and Cole Palmer and Anthony Gordon for England, all of whom are in the Euro 2024 squads. == Match == === Summary === Spain won an early corner, but England cleared it. Spain kept the ball well, creating chances through Nico Williams. England got a free kick around the tenth minute after a foul on Jude Bellingham, but Spain regained possession. England had little of the ball and struggled, while Spain looked more settled. After the fifteenth minute, England started to improve with Bukayo Saka creating opportunities. In the 21st minute, England won the ball but quickly lost it under pressure from Dani Olmo, who sent it to Lamine Yamal. Yamal's shot was blocked for a corner, leading to an England counter-attack stopped by Dani Carvajal fouling Saka. Harry Kane got a yellow card for a foul on Fabián Ruiz. Around the 30th minute, Dani Olmo fouled Declan Rice and got a yellow card. Yamal made a good run into the box but was stopped by a strong tackle from Luke Shaw. Spain had a few more chances but didn't score. England improved at the end of the first half with some good plays, but the half ended 0-0. Rodri was injured in the first half and replaced by Martín Zubimendi at half-time. In the second half, Spain dominated again. In the 47th minute, Yamal crossed to Williams, who scored, making it 1-0. Spain continued to have more chances but didn't score again. England made substitutions, with Ollie Watkins coming on for Kane. In the 73rd minute, Cole Palmer scored for England, making it 1-1. Spain then dominated possession again. In the 86th minute, Oyarzabal scored for Spain after a cross from Cucurella, confirmed by VAR. England tried to equalize, with Marc Guéhi nearly scoring from a corner, but Dani Olmo cleared it off the line. Spain played defensively in the final minutes and won the match 2-1. === Details === {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 23 Unai Simón RB 2 Dani Carvajal CB 3 Robin Le Normand CB 14 Aymeric Laporte LB 24 Marc Cucurella CM 16 Rodri CM 8 Fabián Ruiz RW 19 Lamine Yamal AM 10 Dani Olmo LW 17 Nico Williams CF 7 Álvaro Morata (c) Substitutions: MF 18 Martín Zubimendi FW 21 Mikel Oyarzabal DF 4 Nacho MF 6 Mikel Merino Manager: Luis de la Fuente Man of the Match: Nico Williams (Spain) Assistant referees: Cyril Mugnier (France) Mehdi Rahmouni (France) Fourth official: Szymon Marciniak (Poland) Reserve assistant referee: Tomasz Listkiewicz (Poland) Video assistant referee: Jérôme Brisard (France) Assistant video assistant referees: Willy Delajod (France) Massimiliano Irrati (Italy) |} === Statistics === First half Statistic Spain England Goals scored 0 0 Total shots 5 3 Shots on target 0 1 Saves 1 0 Ball possession 66% 34% Corner kicks 6 1 Fouls committed 6 2 Offsides 0 0 Yellow cards 1 1 Red cards 0 0 Second half Statistic Spain England Goals scored 2 1 Total shots 10 6 Shots on target 5 2 Saves 1 3 Ball possession 59% 41% Corner kicks 4 1 Fouls committed 5 3 Offsides 1 0 Yellow cards 0 2 Red cards 0 0 Overall Statistic Spain England Goals scored 2 1 Total shots 15 9 Shots on target 5 3 Saves 2 3 Ball possession 63% 37% Corner kicks 10 2 Fouls committed 11 5 Offsides 1 0 Yellow cards 1 3 Red cards 0 0 == References == == Other websites == * final Category:2024 in Germany Category:July 2024 events Category:2024 in European sport Category:International association football competitions hosted by Germany",
 "title": "UEFA Euro 2024 final"
}