{
 "id": "1119068",
 "text": "{{Infobox writer | name = France Prešeren | image = Prešern-Goldenstein.jpg | caption = Prešeren, 1850 oil portrait | birth_date = | birth_place = Vrba, Carniola, Habsburg monarchy (now Slovenia) | death_date = | death_place = Kranj, Austrian Empire (now Slovenia) | occupation = Poet, lawyer | nationality = Carniolan, Slovene | genre = | movement = Romanticism | notableworks = The Baptism on the Savica O Vrba Sonnets of Misfortune A Wreath of Sonnets Zdravljica | language = Mostly in Slovene, some in German. | website = }} France Prešeren () (2 or 3 December 1800 – 8 February 1849) was a 19th-century Romantic Slovene poet. His poems have been translated into many languages.Šinkovec, Ana: A Man Who Turned Literacy into Art , Slovenia Times, 6 February 2009Database of translations – Prešeren , Slovene Book Agency, 2013 He is thought to be the best Slovene classical poet. He inspired later Slovene literature. He wrote the first Slovene ballad and the first Slovene epic. After he died, he became the most popular Slovene literary canon.Božič, Zoran (2011).Dejavniki literarne kanonizacije v srednješolskih berilih – na primeru Prešerna (Factors of literary canonisation in high school reading materials – the case of Prešeren), Jezik in slovstvo, vol.56, 5–6, pp. 3–26 He created motifs of his unhappy love with his homeland. His homeland was often invaded at this time. One of his famous motifs was the \"hostile fortune\". After World War II in the Slovene Lands, the Slovenes made this a national myth. Prešeren was conflicted with many of the churches and politicians in Ljubljana. He had alcoholism. He tried to kill himself two times. He also saw many of his closest friends die horribly. His lyric poetry talked about his love of his homeland and suffering. He also talked about his unfulfilled love of his muse, Julija Primic. He mostly wrote poetry in Slovene and in German. He lived in Carniola. At first, he thought himself as a Carniolan. Over time, however, he created his own Slovene identity. ==Notes== ==References== ==Further reading== *Henry Ronald Cooper, Francè Prešeren (Boston, MA: Twayne, 1981). *Janko Lavrin, Francè Prešeren: 1800–1849 (Bristol: Western Printing Services Ltd., 1955). ==Other websites== * Preseren.net Prešeren.net – web page dedicated to the poet in Slovene, English, and German * Free sheet music by Prešeren at International Music Score Library Project (IMSLP) * F. Prešeren. 5 poems in the English translation (audio) * F. Prešeren. Sonnets in the English translation (audio) Category:1800 births Category:1849 deaths Category:Deaths from cirrhosis Category:Slovenian poets Category:19th-century people Category:Slovenian lawyers",
 "title": "France Prešeren"
}