{
 "id": "1119698",
 "text": "Mughal-Safavid conflict was fought between the Mughal Empire of Hindustan and Safavid Empire of Persia over Kandahar. Initially the Persians had occupied the city of Kandahar, Akbar and His generals together planned to retake it in the period of 1593, The siege lasted for 2 years and it ended in a victory for Mughals and Kandahar was finally retaken by the Mughals. ==Backround== Kandahar (also known as the ancient Indian kingdom of Gandhara) had connections with the Mughals from the early times. However, the Safavids considered it to be an appanage of the Persian-ruled territory of Khorasan and declared its association with the Mughal emperors to be a usurpation. In 1558, while Akbar was consolidating his rule over northern India, Safavid Shah Tahmasp I seized Kandahar and expelled its Mughal governor. The recovery of Kandahar had not been a priority for Akbar, but after his military activity in the northern frontiers, he moved to restore Mughal control. At the time, the region was also under threat from the Uzbeks, but the Emperor of Persia, himself beleaguered by the Ottoman Turks, was unable to send reinforcements. ==Taking of Kandahar== In 1593, Akbar received the exiled Safavid prince, Rostam Mirza. Rostam Mirza pledged allegiance to the Mughals; he was granted a rank (mansab) of command over 5,000 men and received Multan as a jagir. The Safavid prince and governor of Kandahar, Mozaffar Hosayn, also agreed to defect to the Mughals. Hosayn, who was in an adversary relationship with his overlord, Shah Abbas, was granted a rank of 5,000 men, and his daughter Kandahari Begum was married to Akbar's grandson, the Mughal prince Khurram. Kandahar was secured in 1595 with the arrival of a garrison headed by the Mughal general, Shah Bayg Khan. By the end of this conflict, Kandahar ended up falling to the Mughals. Now the Indian Mughal empire had expanded through Afghanistan as well as into the Iranian territory ==Aftermath== Kandahar fell to back to the Hindustanis however, the reconquest of Kandahar did not overtly disturb Mughal-Persian relations. Akbar and the Persian Shah continued to exchange ambassadors and presents. However, the power equation between the two had now changed in favour of the Mughals. Soon, the Persians will try to take Kandahar in 1605 again but would fail. Later on will Succeed in their Second trial in 1623Burton 1997, p. 162 and the conflict over Kandahar will continue. ===Subjugation of Balochistan=== As early as 1586, about half a dozen Baluchi chiefs, under nominal Pani Afghan rule, had been persuaded to subordinate themselves to Akbar. In preparation for taking Kandahar from the Safavids, Akbar ordered the Mughal forces to conquer the rest of the Afghan-held parts of Baluchistan in 1595. The Mughal general Mir Masum led an attack on the stronghold of Sibi, which was northeast of Quetta, and defeated a coalition of local chieftains in battle. They were required to acknowledge Mughal supremacy and attend Akbar's court. As a result, the modern-day Pakistani and Afghan parts of Baluchistan, including the Makran coast, became a part of the Mughal Empire. == References == Category:Pages created with the Article Wizard from 2024 Category:15th-century conflicts Category:16th-century conflicts Category:Mughal Empire Category:Kandahar Province",
 "title": "Mughal—Safavid conflict (1540-1605)"
}