{
 "id": "1119193",
 "text": "Many people smoke. Some of them started when they were young. This is known as youth smoking or adolescent smoking. 90% of smokers begin smoking before the age of 18. Tobacco contains nicotine, which is addictive. Advertising for tobacco products often targets young people. This is a problem, because smoking can cause or influence different diseases, most notably cancer, diabetes and peumonia. == Measures against youth smoking == Different countries have different measures to keep people from starting to smoke. Some of these measures are: * People need to have a certain age, before they can legally buy tobacco products. * There may be high taxes on products containing tobacco. This means, that such products usually are expensive. * Advertising these products may be forbidden, or it may only be allowed, if certain rules are followed. These measures are very similar to those that are used to prevent young people from drinking alcohol. == Factors that influence people to start or keep smoking == Factors that influence people to start smoking * Age: Older adolescents are more likely to start smoking than younger ones. * Education: People who are less educated are more likely to smoke * Sex: male adolescents are more likely to smoke than female ones. * People who often experience stress are more likely to smoke than others. == Statistics == In the United States, the rates of cigarette smoking among adults and adolescents have declined in the past ten years. Still, many young adults continue to smoke cigarettes. In 1964, there was a Surgeon General's Warning, which was a key factor for this change. In 1965, approximately 45% of Americans smoked. In the 2020s, the prevalence of tobacco smokers is less than 25% of adults. This is different for young people: smoking rates for high school students began to increase in the early 1990s and did not begin to decrease until the end of the decade. If the current smoking trends continue, 5.6 million youths alive today will die prematurely.General, S. (2014). The health consequences of smoking—50 years of progress: a report of the surgeon general. In US Department of Health and Human Services. According to economist Kenneth Warner, Ph.D., the tobacco industry needs 5,000 new young smokers every day to maintain the total number of smokers. In 2020, the Center for Disease Control and Prevention (CDC) estimated that four million middle school and high school students in the United States currently used tobacco products. National epidemiological surveys often give proportions of youth that are consuming tobacco. The National Youth Tobacco Surveys (NYTS) was designed to provide data on middle school and high school students tobacco behaviors,. It also records thei attitudes, beliefs, and exposure to pro- and anti- tobacco influences. Results from the 2011-2016 NYTS revealed that approximately 20.2% of high school students (grades 9-12) reported current tobacco use. This meant that they said that they had used any tobacco product in the past 30 days. The National Survey on Drug Use and Health (NSDUH) is a prominent epidemiological survey that assesses national and state-level information on alcohol, tobacco, illicit drug use, as well as mental health, in the United States. The NSDUH defines current cigarette smoking as smoking all or part of a cigarette over the past 30 days. The 2012 NSDUH survey revealed that 6.6% of youth between the ages of 12 and 17 were current cigarette smokers. Females and males had similar prevalence estimates, 6.3% and 6.8% respectively. The demographic breakdown was such that Caucasian youth exhibited the greatest prevalence of smoking (8.2%), followed by Hispanic or Latino youth (4.8%) and African- American youth (4.1%). The age range between 16 and 17 had highest prevalence (13.6%), followed by the 14 to 15 age range (4.6%), and the 12 to 13 age range (1.2%). In terms of socioeconomic status, there was a greater prevalence of youth currently smoking below the poverty level (7.6%) than at or above the poverty level (6.2%). There are regional differences in the United States : In the Midwest (7.8%) and South (7.2%) regions, the prevalence was highest, followed by the Northeast (5.7%) and West (5.1%) regions. Results form these studies show that many adolescents still smoke. Prevention and control measures that reduce smoking in among adolescents can improve the nation's short- and long-term health. ==References== Category:Smoking",
 "title": "Youth smoking"
}