{
 "id": "1119761",
 "text": "The 2022 United States Senate election in Ohio was held on November 8, 2022, to elect a member of the United States Senate to represent the State of Ohio. Republican writer and venture capitalist JD Vance won the election, beating Democratic U.S. Representative Tim Ryan to replace retiring Republican Senator Rob Portman. ==Republican primary== ===Candidates=== ====Nominee==== *JD Vance, author of Hillbilly Elegy, U.S. Marine Corps veteran, and venture capitalist ====Eliminated in primary==== *Matt Dolan, state senator from the 24th district since 2017 and nominee for Cuyahoga County executive in 2010 *Mike Gibbons, investment banker and candidate for the U.S. Senate in 2018 *Josh Mandel, U.S. Marine Corps Reserve Iraq War veteran, former Ohio state treasurer (2011–2019), nominee for the U.S. Senate in 2012 and candidate for the U.S. Senate in 2018 *Neil Patel, businessman *Mark Pukita, IT executive *Jane Timken, former chair of the Ohio Republican Party (2017–2021) ====Withdrawn==== *John Berman, electronic hardware design, test engineer and candidate for U.S. Senate (Minnesota and Kansas) in 2020 *Bernie Moreno, businessman ==Democratic primary== ===Candidates=== ====Nominee==== * Tim Ryan, U.S. representative for Ohio's 13th congressional district (2013–2023) and candidate for President of the United States in 2020 ====Eliminated in primary==== *Morgan Harper, former senior advisor at the Consumer Financial Protection Bureau and candidate for in 2020 *Traci Johnson, activist and tech executive ==Results== Vance won by 6.1%, which was predicted in polling before the election was held. Even though he lost, Ryan flipped four counties carried by Portman in re-election in 2016: Summit, Montgomery, Hamilton, and Lorain. It is also the closest election since 1992. Vance was supported by former President Donald J. Trump and became the only candidate in the seven statewide general election races funded by Trump's PAC to win. ==References== Category:2022 elections in the United States Category:United States Senate elections Category:November 2022 events",
 "title": "2022 United States Senate election in Ohio"
}