{
 "id": "1119163",
 "text": "Eli Stanley Jones (1884–1973) was an American Methodist Christian missionary and author. He is remembered for his talks about religion with the educated classes in India. In 1925 he wrote the book \"The Christ of the Indian Road (ISBN 0-687-06377-9)\" It sold more than a million copies. By 2018, three million copies of all of his books have been sold. \"E. Stanley Jones\". Asbury University. Retrieved 2020-09-09. He is the founder of the Christian ashram (forest retreat) movement. In 1938, Time magazine called him \"the world's greatest Christian missionary.\". \"Religion: One Hope\". Time. 1938-12-12. ISSN 0040-781X. Retrieved 2020-09-09. E. Stanley Jones was born in the U.S.A.in 1884. He graduated from Asbury College, Wilmore, Kentucky in 1907. He went to India in 1907 and began working with the lowest castes, including Dalits. He became a close friend of many leaders in the Indian Independence movement, worked with people of many religions. He was a good friend of Mohandas K. Gandhi and the Nehru family. Gandhi taught him greater respect for the Indian character. Jones said, “Peace is a by-product of conditions out of which peace naturally comes. If reconciliation is God’s chief business, it is ours - between man and God, between man and himself, and between man and man.”. \"E. Stanley Jones\". Read the Spirit. Jones spoke many times about the need for conversion. By this he meant that a person's life must be changed by an encounter with God. This is both a sudden and a lifetime process.https://renovare.org/articles/conversion-moment-lifetime In 1959 Jones devoted an entire book to the subject of conversion. It is not a change of religion, but a change of a person's relationship to God through faith in Christ. https://www.estanleyjonesfoundation.com/about-esj/ == Books == * The Christ of the Indian Road (1925).ABE Books website, Jones, Eli Stanley German transl. Der Christus der indischen Landstraße. Jesu Nachfolge in Indien by Paul Gäbler (1928). * Christ at the Round Table (1928). German transl. Christus am Runden Tisch. Offene Aussprachen unter Jesu Augen in Indien by Paul Gäbler (1930). * The Christ of Every Road - A study in Pentecost (1930). German transl. by H[einrich] Fellmann (1931) * The Christ of the Mount - A Working Philosophy of Life (1931). German transl. by H[einrich] Fellmann (1933) * Christ and Human Suffering - Hodder & Stoughton, First English Edition, August 1933. * Christ’s Alternative to Communism (1935) US title * Christ and Communism (1935) UK titleGoodReads website, Eli Stanley Jones * Victorious Living (1936) (devotional) * The Choice Before Us (1937) * Christ and Present World Issues (1937) * Along the Indian Road (1939) * Is the Kingdom of God Realism? (1940) * Abundant Living (1942) (devotional) * How to Pray (1943) * The Christ of the American Road (1944) * The Way (1946) (devotional) * Mahatma Gandhi: An Interpretation (1948); 2nd ed.: Gandhi - Portrayal of a Friend (Abingdon, 1993) * The Way to Power and Poise (1949) (devotional) * How to be a Transformed Person (1951) (devotional) * Growing Spiritually (1953) (devotional) * Mastery (1953) (devotional) * Christian Maturity (1957) (devotional) * Conversion (1959) * In Christ (1961) (devotional) * The Word Became Flesh (1963) (devotional) * Victory Through Surrender (1966) * Song of Ascents (1968) (autobiography) * The Unshakable Kingdom and the Unchanging Person (1972) * The Reconstruction of the Church - On what Pattern? (1970) * The Divine Yes (1975) (posthumously) ==References== Category:1884 births Category:1973 deaths Category:American Methodist ministers Category:Christian missionaries",
 "title": "E. Stanley Jones"
}