{
 "id": "1119628",
 "text": "2024 Quota Reform Movement dubbed as the Bangla Blockade by protesters is an ongoing movement spearheaded by students and teachers of both public universities in Bangladesh. They are demanding reforms to change quota-based recruitment system for all types of government jobs within their country (the majority have been hired on a \"quota\" basis). protests started in response to a verdict by the High Court division on 5 June, which declared that government circular of January 2018 cancelling quota for freedom-fighter and their descendants was illegal. circular was issued in the wake of 2018 Bangladesh quota reform movement. the court decision, online activism started against this verdict and people were calling for \"another 2018\". itial protests were staged in early-June, mainly concentrated on the capital Dhaka but was later discontinued due to Eid ul Adha and summer holiday. the holiday, peaceful demonstrations started again from 1 July. Public university teachers went on strike to protest against a new Universal Pension Scheme and universities closed indefinitely after that day's events were overdue by government officials who wanted them back into work as soon as possible but they refused because of their fear for future violence or unrest among students at public schools around India's capital Delhi (the city). protests spread nationwide as the movement became called by a newly-organized 'Boishommobirodhi Chhatro Andolon', an umbrella organization for student demonstrators. 7 July, protesters started nationwide 'Bangla Blockade' organizing traffic and rail obstruction with demonstrations in major suburbs. Appellate Division ordered a four-week status quo on the issue, but protests continued and people were asking for an answer from government. protests became violent for the first time on 25 January when police clashed with students as government began to be hardline. July 14, controversy erupted about Prime Minister Sheikh Hasina's statement. The situation escalated and the protesters were forced to leave their homes on Sunday afternoon in a mass demonstration against his government's policies of violence towards Muslim people. in 15 July, the ruling Awami League solidified its's stand against demonstration and protesters met violent suppression from Chhatra league. The situation got to a deadlock after several hundred people were injured by police forced into their houses in front of many buildings on both sides of roadways near Dhaka city center during this time period. In the United Arab Emirates, several Bangladeshi nationals were charged in relation for holding protests against their government. Following a trial on 21 July, three defendants were sentenced to life imprisonment for \"rioting\", while 54 others received sentences ranging from 10 to 11 years and were ordered to be deported upon release. On August 4, More than seventy people were killed in violent clashes between anti-government demonstrators and police units. == Background == the High Court verdict was published on June 5, students of various universities in Dhaka united to demand quota reform. the movement was started, it had to be postponed because of Eid and summer holidays. the holidays, it started again peacefully but gradually became widespread. itially the students and teachers of public universities including University of Dhaka, Jagannath university, Rajshahi universitet for Engineering & Technology (RUET), Bangabandhu Sheikh Mujibur Rahman Maritime University (BMURU).Jahangirnagar University, Chittagong Univeristy, Rajshhashi University, Comilla University, University Islamic, Universitasand other educational institutions joined this movement. the students of private universities including North South University and American International university-Bangladesh also joined in. The protesters were opposing government policies toward women who are being discriminated against for their gender identity or religion as well as because they have been forced into marriage by Muslim men with whom there is no legal agreement between them on a sexual basis (see below). the banner of \"anti-discrimination student movement\", students started a blockade program called Bangla Blockage. During the movement, on July 10th (the day of Freedom Day), The Appellate Division issued a status quo for four weeks. students said they are seeking a final solution to the quota issue from government, saying that their movement has nothing with court. llate Division upholds status quo in High Court verdic. == References == Category:2024 protests Category:June 2024 events Category:July 2024 events Category:2020s in Bangladesh",
 "title": "2024 Bangladesh quota reform movement"
}