{
 "id": "1119684",
 "text": "A social experiment is a method of psychological or sociological research that observes people's reactions to certain situations or events. The experiment depends on a particular social approach. The main source of information is the participants' point of view and knowledge. To carry out a social experiment, specialists usually split participants into two groups — active participants (people who take action in particular events) and respondents (people who react to the action). Throughout the experiment, specialists monitor participants to identify the effects and differences resulting from the experiment. A conclusion is then created based on the results. Intentional communities are generally considered social experiments. Social psychology shows how individuals act in groups and how behavior is affected by social burdens and pressures. In most social experiments, the subjects are unaware that they are participating in an experiment. This is done to prevent bias. Like with any experiment, there may be ethical issues. Several \"actors\" or \"plants\" are used to study social behaviors. Companies have also used social experiments to collect consumer data and their opinions about a product or a particular topic. == Ethics == There are many ethical concerns associated with social experiments. This is because social experiments manipulate of large population groups, often without the consent or knowledge of the subjects. In some instances, social experimentation has been staged unknowingly to the viewer to promote the image of the individual or for the pure purpose of generating controversy. Researchers also believed that the impact of Informal Social Experiments via social media videos may have negative consequences on formal social marketing research as well as the society in general. They say that even though Informal Social Experiments address moral and social issues such as child safety, self-confidence, etc., producers of these social experiments might do it for their gain and benefits. == Digital platforms for social experiments == The use of digital platforms has changed the way in which researchers perform social experiments. Studies that take these platforms into account have to be done in a different way. Data gathering is different too. Digital platforms allow to reach a broader audience. This allows to conduct experiments outside the pure laboratory setting. For example, the Citizen Social Lab platform combines human behavioral experiments with a citizen science approach, allowing researchers to bring science to a wider audience and conduct experiments in open and diverse environments. == References == Category:Sociology Category:Psychology experiments",
 "title": "Social experiment"
}