{
 "id": "1120041",
 "text": "Miss Kobayashi's Dragon Maid is a manga series. It was made by Coolkyousinnjya. It first started being made on May 25, 2013. The first volume was released on May 10, 2014. It is published by Futabasha. The show was popular and well liked. The anime was nominated for 4 awards at the 2nd Crunchyroll Anime Awards winning Best Comedy and Best Ending for \"Ishukan Communication\" by Chorogonzu. It was also nominated for Best Animation and Best Boy for Fafnir. At the 6th Crunchyroll Anime Awards, it would be nominated for Best Fight Scene, Best Animation, Best Opening Sequence, and Best Comedy. ==Plot== The series is about Kobayashi, a 25-year-old office worker who lives alone in her apartment. One day when she is getting ready for work, she comes face-to-face with a gigantic dragon outside her apartment door. The dragon introduces herself as Tohru and reveals that Kobayashi had met her while she was drunk in the mountains and had invited her to live in her apartment with her. Kobayashi tells Tohru that she was drunk when she offered and that she cannot let her live there. Kobayashi eventually lets Tohru stay in her apartment but gives her the condition of acting as her maid and doing chores. One day when Tohru clears the cloudy skies with a beam, she ends up drawing the attention of another dragon named Kanna Kamui. Tohru ends up having a nightmare about being stabbed in a battle and is cheered up by Kobayashi which helps build their relationship. Kanna shows up to Kobayashi's apartment and is angry at Kobayashi because she thinks that she seduced Tohru. She wants to go back to her world but she cannot without Tohru. Tohru refuses to go back because she wanted to escape from their world so Kanna decides to stay with the two. Kobayashi decides to host her own work event because she did not want to go to the work's official event. Tohru invites her other dragon friends Fafnir and Quetzalcoatl to Kobayashi's event. After Kanna sees children going to school, Kobayashi enrolls her. She meets a rival girl named Riko Saikawa who later becomes obsessed with and developing a crush on her. When they meet a group of bullies, Kanna, Rico and the other girls defeat them in a game of dodgeball. Tohru and Kobayashi get into a cooking battle against each other and a dragon named Elma crashes into their apartment during it. Elma announces that she is there to take Tohru back to her world because it is against the law to stay in the human world. Tohru gives Elma a piece of bread and she goes away. Elma and Kobayashi later become friends after Elma went undercover at her work to see if dragons and humans can con-exist peacefully. After Kobayashi is not able to go to Kanna's school sports festival, she gets upset at her. Kobayashi feels bad about this and works overtime at her work to eventually be able to go to the festival and see Kanna's school win. Tohru wants to make a meal for Kobayashi and when she is shopping for ingredients, she is confronted by her father Damocles. He demands that she return to the dragon world and takes her with him. Kanna explains what happened to the rest of the friend group and everybody gets sad that Tohru is gone. Tohru and her father end up appearing in front of Kobayashi's apartment one day. Tohru says that she wants to stay in the human world but her father explains that she cannot because it could lead to an invasion by dragons. Kobayashi yells at Damocles and he goes to attack her but is stopped by Tohru. She ends up fighting her father in the dragon world but they are stopped by Kobayashi. She is then able to stay in the human world. ==Anime== The anime started broadcasting in Japan on January 12, 2017. The anime was directed by Tatsuya Ishihara and Yasuhiro Takemoto. It was written by Yuka Yamada and was produced by Kyoto Animation. On September 17, 2022, director Yasuhiro Takemoto was murdered in the Kyoto Animation arson attack. The second season Miss Kobayashi's Dragon Maid S debuted on July 8, 2021 and Tatsuya Ishihara took over the directing with Takemoto being credited posthumously. ==References== ==Other websites== * Category:2013 manga Category:2016 manga Category:2010s manga Category:2017 television series debuts Category:2010s Japanese television series debuts Category:2021 television series debuts Category:2022 video games Category:Anime series based on manga Category:Comedy anime and manga Category:Kyoto Animation Category:LGBT comedy television series Category:Manga series",
 "title": "Miss Kobayashi's Dragon Maid"
}