{
 "id": "1120756",
 "text": "Sclerotium is a genus, or group of fungi. It was first described in 1790. The Sclerotium genus includes fungi that develop sclerotia and whose mycelia are unable to reproduce. Sclerotia are small circular structures that are typically brown or black in colour. A diverse range of fungi are found in this genus. Sclerotium complanatum was the first official species in this genus. Sclerotium rolfsii is the most common and most well-researched species in the genus Sclerotium. This is because S. rolfsii is a destructive plant pathogen. == Plant disease == === Sclerotium Rolfsii === The most common plant pathogen of this group is S. rolfsii. S. rolfsii is a very destructive fungus that causes disease. It can infect a wide variety of hosts, over 500 species across the world. Many of the hosts for this fungus are crops that are important to the economy, such as peanut, tomato, chickpea, onion, and sesame. S. rolfsii causes Southern Blight mainly in environments that are hot and humid, particularly tropical and subtropical. Southern Blight refers to a variety of diseases including seedling damping-off, crown and root rot, and dry rot canker. When infecting plants, it releases chemicals that break down plant enzymes, called cellulases />. This causes the cell wall of plant cells to break down. Like all members of this group, S. rolfsii produces sclerotia. These sclerotia can remain in the soil for years after being produced. S. rolfsii is considered a facultative parasite, meaning it does not rely on its host to complete its life cycle. Because this is a danger to crops throughout the world, fungicides are used to control it. There is concern that S. rolfsii will develop resistance to many common fungicides used against it. == Identification == You can distinguish members of this genus based on the sclerotia produced. Different species will have sclerotia of different sizes, numbers, and appearance. For example, the sclerotia of S. rolfsii are dark brown, small, smooth, and occur in large numbers. The sclerotia of S. delphinii are larger and red-brown in colour. The sclerotia of S. coffeicola are large, tan, and do not occur in large numbers. To identify the species reliably, one should look at a few things. First, look at the shape and size of the sclerotia. Second, look at the host or the organism that produced the sclerotia. Third, look at where in the world the fungus was found, because growth of different species in this genus varies on climate. == Composition == Sclerotia are small, circular structures that are typically brown or black in colour. Each sclerotia has three distinct cell layers. The outer layer, called the rind, is a layer of dark coloured cells that are typically closely packed together. The middle layer of cells is called the cortex. The cells of the cortex are also tightly packed together. The cortex is thicker than the rind. The layer in the centre is called the medulla. The cells in this layer have a looser arrangement. Even though each sclerotia has these three layers, the cellular characteristics of these layers may vary across species. == References == Category:Fungi Category:Parasites Category:Diseases and disorders of plants",
 "title": "Sclerotium"
}