{
 "id": "1120306",
 "text": "The European theatre of World War I, was a major theatre of operations during World War I. ==Western Front== Germany planned to apply the Schlieffen plan. The Schlieffen plan was to attack France first since Russia would not be able to mobilise quickly. Germany launched an offensive through Belgium, which made the British Empire declare war against Germany. France's Plan XVII - a concentrated offensive meant to overwhelm the German army - also failed. The Western front quickly became a military stalemate, claiming hundreds of thousands of lives on each side. This led to the armies digging in. Mobile warfare only resumed in the final months of the war. During the spring of 1918, the German army launched a massive offensive towards Western France with the aim of defeating France before American reinforcements arrived. Since Russia was in a civil war at the time, many German divisions were sent to the Western front. The Germans advanced towards the Marne after the Micheal Offensive, Operation George, Gneisenau, and Blücher-Yorck. Major ground was taken in the German front taking many lands that they lost from Pre-Hindenburg Line, but at a cost of 600,000 casualties. This overextension of lines caused the Allies to launch a counteroffensive, the Germans were collapsing on all fronts, and on November 11, 1918 the Germans surrendered to the Allies.VCs Spring Offensive 1918, 2013. ==Eastern Front== The fighting on the Eastern Front was primarily contested by the German army and the Austria-Hungarian army on one side and the forces of the Russian Empire and Romania on the other. The Eastern front covered a very large territory, from the Baltic in the north to the Black Sea in the south and from Prussia and Galicia in the west to Latvia and Minsk to the east. The fighting on this front ended early, with the last significant military operation taking place in the autumn of 1917. The two Russian Revolutions of 1917 forced Russia out of the war. The Bolshevik government that took power in November 1917 had promised an end to the war and that government signed the Treaty of Brest-Litovsk which ended the war for Russia in March 1918. ==Italian Front== The Italian Front covered only a small part of northern Italy and the western border of Austria-Hungary. The fighting here began on 23 May 1915 and lasted till 3 November 1918. Most of the fighting was concentrated on a very small bit of land between the Alps and the Adriatic, near the town of Trieste. The fighting primarily involved Italy and Austria-Hungary but also included smaller contingents from France, the UK, and the US (who fought on the side of Italy), and Germany (who was allied with Austria-Hungary). ==Balkans Front== The Balkans Front covered all of Serbia, Montenegro, Albania, and Romania. It also covered northern Greece, the western part of Bulgaria, and the south and eastern parts of Austria-Hungary. Very little fighting took place in this theatre for long periods of time. It was considered a lesser theatre of war by the Great Powers. The Central Powers of Austria-Hungary, Germany, Bulgaria, and the Ottoman Empire were opposed by the allied powers of Serbia, France, the United Kingdom, Romania, Russia, Montenegro, and Greece. ==Naval conflict== Because of the dominance of the British and French navies, only limited fighting took place in the seas around Europe. The German U-boat fleet tried to sink British merchant ships, with some success early in the war. German U-boats had only moderate cruising range in this war and operated mostly in the North Sea, the Irish Sea and in the Mediterranean. The German U-boat threat was drastically reduced when the British finally adopted a convoy system in early 1917. There was one great battle in the waters near Europe: the Battle of Jutland 31 May 1916 - 1 June 1916 between the German High Seas Fleet and the British Grand Fleet. This was one of the largest sea battles in world history though, in some respects, the battle was inconclusive. In the Adriatic, some very limited sea combat took place between the navy of Austria-Hungary and the Allied navies of France, Britain, and Italy. The strategy of the Allies was to blockade the Adriatic and monitor the movements of the Austrian fleet. In general, this strategy was successful but the Germans and the Austrians were able to send submarines out into the Mediterranean where they did some damage. The main sea base for the Austrian and German fleet in the Adriatic was Pola (modern day Pula in Croatia). Japan, an ally of the United Kingdom, sent some destroyers to the Mediterranean and they were very effective in patrol and anti-submarine activity. By contrast the Italian Navy was \"languid and apathetic\" (Cyril Falls \"The Great War\" p. 295). The only significant naval battle occurred on 15 May 1917 when three Austrian cruisers under Captain Miklós Horthy staged a raid on some Italian and British transports near Valona Albania. The raid was a partial success but the raiders were nearly destroyed by shell fire from Italian ships that chased them back to Pola. In the Black Sea, the Russian fleet was dominant and it was led by two skilled commanders, Admiral Eberhart and then Admiral Kolchak (who took over in 1916). By the end of 1915, the Russian fleet had nearly complete control of the sea. The Black Sea fleet was used mainly to support General Yudenich in his Caucasus Campaign. In the Baltic Sea, the Russian fleet was essentially inactive, hiding behind the belts of mines which stretched across the entry into the Gulf of Finland. So the German Baltic fleet dominated the sea and was of occasional use to the German army on the Eastern front. ==Related pages== *Finnish Civil War *World War I *Europe ==References== Category:World War I",
 "title": "European theatre of World War I"
}