{
 "id": "1120379",
 "text": "Stephan Helm (born April 10, 1983) is a former Austrian football player and now coach. ==Career == Helm began his career at UFC Pamhagen. For the 2004/05 season he moved for two seasons to FC Mönchhof. For the 2006/07 season he joined the fourth-rate UFC Purbach. For the 2007/08 season he moved to the third-class amateurs of the Bundesliga club SV Mattersburg. In the 2008/09 season he played 26 games for Mattersburg II in the Regionalliga East. For the 2009/10 season he moved to SC-ESV Parndorf 1919. In two seasons in Parndorf he made 35 league appearances and also played ten times for the Parndorf second team in the Burgenland League. For the 2011/12 season, Helm returned to Purbach, which was now only in fifth class. With Purbach he was promoted back to the Burgenland League at the end of the 2011/12 season. For the 2013/14 season he moved to 1. SC Sollenau. Ligaportal.at (German) For the 2015/16 season he moved back to Burgenland to league rivals SC Neusiedl am See. In January 2016 he returned to the sixth-rate UFC Pamhagen, where he had once started his career. During the 2017/18 winter break, he ended his playing career. ==Manager career == Helm became coach at UFC Pamhagen in May 2010 till November 2010. In January 2016 he took over Pamhagen as coach for a second time. This time he was also an active player for the club. In January 2018 he moved to the Bundesliga club FK Austria Wien. There he worked as a video analyst under Thorsten Fink and Thomas Letsch. For the 2018/19 season, Fink brought him to the Grasshopper Club Zurich in Switzerland as a video analyst. From the 2019/20 season he also became the coach of Zurich's fourth-class U-21 team. He returned to Austria for the 2020/21 season and became Dominik Thalhammer's assistant coach at LASK. For the 2021/22 season he took over as head coach of the second division team SKN St. Pölten. In October 2023, the club parted with Helm. After a break of a few months, Helm took over the third-class amateurs from Austria Wien in February 2024. For the 2024/25 season he became the successor to Michael Wimmer as head coach of the first team. FK Austria Wien Homepage ==References== Category:1983 births Category:Living people Category:Austrian football managers Category:FK Austria Wien managers Category:Austrian footballers Category:Austrian football midfielders",
 "title": "Stephan Helm"
}