{
 "id": "1120496",
 "text": "Zwi Migdal (, Polish: Cwi Migdał) was a criminal organisation founded in the 19th century. It was based mainly in Argentina and Brazil. The idea was to lure Jewish girls and women from Europe, to make them work as prostitutes in South America. The group is said to have been founded by European immigrants of Jewish origin. Officially, the organization was founded with the name Varsovia in 1906. ==Overview== Usually, a well-clothed man would go to one of the poorer areas, where he would put up a note in the synagogue to looking for girls, to work in South America. They would tell the family, that theur daughter would have a bright future by emigrating to South America. In South America, they had to work as prostitutes. They were called polacas. End of the 1920s, the organization is said to have consisted of 500 people, who served 2.000 brothels, and controlled up to 30.000 women. The Jewish communities didn't like the organization. For this reason, the organization had to build their own synagogues and graveyards. Authorties disbanded the organization in 1930. In the 1920s, the Polish government intervened, and the organization changed its name to Zwi Migdal, ater one of its founders. The organisation's annual turnover was $50 million at the turn of the 20th century. Prostitutes who failed to satisfy their clients were beaten, fined, or sent to work in rural houses. Every business transaction was logged. The ruffians held a \"meat market\" where newly arrived girls were paraded naked in front of traders in places such as Hotel Palestina and Cafe Parisienne. These activities went on undisrupted because government officials, judges, and journalists frequented the brothels. City officials, politicians, and police officers were bribed. The pimps had powerful connections everywhere. The largest brothels in Buenos Aires housed as many as 60 to 80 sex slaves. Although there were brothels all over Argentina, most were in Buenos Aires, in the Jewish quarter on Junin Street. ==Books== * Schalom, Myrtha. \"La Polaca. Inmigraciòn, rufianes y esclavas a comienzos del siglo XX\". Buenos Aires: Grupo Editorial Norma, 2003 (out of print). Republished: Buenos Aires: Galerna, 2013. . * Vincent, Isabel. Bodies and Souls, Harper Collins ed., New York. / . * The Case of the Zwi Migdal Society. * ==References==",
 "title": "Zwi Migdal"
}