{
 "id": "1120212",
 "text": "The 2024 Copa América final was an international soccer game to decide the winners of the 2024 Copa América. The game was played at Hard Rock Stadium in Miami Gardens, Florida, on July 14, 2024. The start of the game was delayed by over an hour and twenty minutes because of too many people and other problems near the stadium. Defending champion Argentina beat Colombia 1–0 after extra time to win its 16th Copa América title, which is a record. This was Argentina's 30th final, adding to its record, and Colombia's third Copa América final. Before the game, Argentina had won 15 titles out of 29 finals, and Colombia's last final win was in 2001. It was also Argentina's third major tournament win in a row, after winning the 2021 Copa América and the 2022 FIFA World Cup, a streak previously achieved only by Spain (2008, 2010, and 2012) and Argentina itself (1945, 1946, and 1947).https://www.rsssf.org/tabless/sachamp.html == Road to the final == Colombia's road to the final Opponent Result 2–1 3–0 1–1 5–0 1–0 Colombia's journey to the final was filled with strong performances and exciting matches. They started by beating Paraguay 2-1 in a close game, and then they showed their strength with a big 3-0 win against Costa Rica. Their match against Brazil ended in a 1-1 draw, showing they could hold their own against tough opponents. In the quarterfinals, Colombia dominated Panama with a 5-0 victory, and they secured their spot in the final by defeating Uruguay 1-0 in a tight semifinal match. Argentina's path to the final was also impressive. They began with a solid 2-0 win over Canada, followed by a narrow 1-0 victory against Chile. They continued their winning streak by beating Peru 2-0. The quarterfinals saw them face a challenging match against Ecuador, which ended in a 1-1 draw after extra time, but Argentina won 4-2 in the penalty shootout. In the semifinals, they faced Canada again and won 2-0, securing their place in the final. Both teams showed great skill and determination to reach the final, promising an exciting showdown. == Entertainment == Before the final, Colombian singer Karol G and Argentine singer Abel Pintos sang their respective national anthems. During the halftime show, Shakira performed four songs with backup dancers and robots. This performance extended halftime from the traditional 15 minutes to 26 minutes, which drew criticism from Colombia's coach, Néstor Lorenzo. Argentina's road to the final Opponent Result 2–0 1–0 2–0 1–1 2–0 == Match == === Details === {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 23 Emiliano Martínez RB 4 Gonzalo Montiel CB 13 Cristian Romero CB 25 Lisandro Martínez LB 3 Nicolás Tagliafico RM 11 Ángel Di María CM 7 Rodrigo De Paul CM 24 Enzo Fernández LM 20 Alexis Mac Allister CF 10 Lionel Messi (c) CF 9 Julián Álvarez Substitutions: FW 15 Nicolás González DF 26 Nahuel Molina FW 22 Lautaro Martínez MF 5 Leandro Paredes MF 16 Giovani Lo Celso DF 19 Nicolás Otamendi Manager: Lionel Scaloni Man of the Match: Ángel Di María (Argentina) Assistant referees: Bruno Pires (Brazil) Rodrigo Correa (Brazil) Fourth official: Juan Benítez (Paraguay) Fifth official: Eduardo Cardozo (Paraguay) Video assistant referee: Rodolpho Toski (Brazil) Assistant video assistant referees: Danilo Manis (Brazil) Daniel Nobre (Brazil) Pablo Gonçalves (Brazil) |} == References == Category:Copa América tournaments",
 "title": "2024 Copa América final"
}