{
 "id": "1120288",
 "text": "The FIA Formula 2 Championship is a second-tier single-seater championship organized by the Fédération Internationale de l'Automobile (FIA). Held on racing circuits, the championship was introduced in 2017, following the rebranding of the long-term Formula One feeder series GP2. The series' original founders were Flavio Briatore and current managing director Bruno Michel. It is the last step on the FIA Global Pathway from Karting to Formula One. While it is not absolutely necessary to do so, most current F1 drivers have participated in either Formula 2 or GP2 before graduating to Formula One. ==Drivers who graduated to Formula One== 2017 Formula 2 Championship champion Charles Leclerc was the only full-time driver of the season to graduate to Formula One, joining Sauber for 2018. Sergey Sirotkin also made his Formula One debut in 2018 with Williams; he had raced in the GP2 Series in 2015 and 2016, placing third in both championships, and made a one-round appearance in Formula 2 in 2017 as a replacement for an injured driver. The top three in the 2018 Drivers' Championship all graduated to Formula One for 2019, with George Russell, Lando Norris and Alex Albon joining Williams, McLaren and Toro Rosso respectively. 2019 runner-up Nicholas Latifi, who had raced in Formula 2 since 2017 and previously raced in the GP2 Series in 2014, 2015 and 2016, graduated to Formula One with Williams in 2020. 2019 fifth-placed finisher Jack Aitken also made his Formula One debut in 2020 with a single appearance at the Sakhir Grand Prix in his capacity as Williams' reserve driver. Three graduates of the 2020 season achieved promotions to Formula One in 2021. Champion Mick Schumacher and fifth-placed Nikita Mazepin joined Haas, and third-placed Yuki Tsunoda debuted with AlphaTauri. 2021 third-placed finisher Zhou Guanyu was the only Formula 2 driver to graduate to a full-time Formula One seat in 2022, joining Alfa Romeo. 2019 Formula 2 champion Nyck de Vries also made his Formula One debut in 2022. He had raced in the FIA World Endurance Championship and in Formula E (of which he was champion in 2021) since his Formula 2 win, and had also served as a Formula One reserve driver for Mercedes; it was through this role that he raced at the 2022 Italian Grand Prix for Williams as a replacement driver. De Vries would later gain a full- time seat with AlphaTauri in 2023. Two Formula 2 graduates debuted in Formula One at the start of 2023; Oscar Piastri, who was Formula 2 champion in 2021 and served as Alpine's reserve driver in 2022, signed with McLaren, and 2022 fourth-placed finisher Logan Sargeant signed with Williams. The 2023 season also saw the debut of Liam Lawson, who finished third in Formula 2 in 2022 and made reserve driver appearances for AlphaTauri whilst also competing in Super Formula. He would later gain a full-time seat with the team during 2024. No Formula 2 graduates joined the Formula One grid at the start of 2024; however, three drivers made in-season debuts. Oliver Bearman, who finished sixth in the 2023 Formula 2 Championship, competed in races for Ferrari and Haas in his capacity as a reserve driver for both teams. He is set to make his debut as a full-time driver with Haas in 2025. Franco Colapinto ended his 2024 Formula 2 campaign mid-season to join Williams for the remainder of the year. 2023 Formula 2 third-place finisher Jack Doohan is the most recent graduate, having made his Formula One debut with Alpine in the final race of 2024 ahead of a full-time promotion in 2025. Formula One is due to feature three further Formula 2 graduates for the 2025 season as 2024 champion Gabriel Bortoleto, runner-up Isack Hadjar and sixth-place finisher Andrea Kimi Antonelli join Sauber, Racing Bulls and Mercedes, respectively. * Bold denotes an active Formula One driver. Driver Formula 2 Formula 2 Formula 2 Formula 2 Formula 2 Formula 1 Formula 1 Formula 1 Formula 1 Formula 1 Formula 1 Driver Seasons Races Wins Podiums Seasons First team Races Wins Podiums Points Charles Leclerc 22 7 10 1st 2018–2025 Sauber 2017 2 0 0 20th 2018 Williams 21 0 0 1 2018 24 7 11 1st 2019–2025 Williams 2017–2018 26 1 9 2nd 2019–2025 McLaren 2017–2018 44 4 10 3rd 2019–2020, 2022–2025 Toro Rosso Nicholas Latifi 2017–2019 67 6 20 2nd 2020–2022 Williams 61 0 0 9 2018–2021 76 4 11 5th 2020 Williams 1 0 0 0 Yuki Tsunoda 2020 24 3 7 3rd 2021–2025 AlphaTauri Mick Schumacher 2019–2020 46 3 11 1st 2021–2022 Haas 43 0 0 12 Nikita Mazepin 2019–2020 46 2 6 5th 2021 Haas 21 0 0 0 Zhou Guanyu 2019–2021 68 5 20 3rd 2022–2024 Alfa Romeo Nyck de Vries 2017–2019 67 8 23 1st 2022–2023 Williams Oscar Piastri 2021 23 6 11 1st 2023–2025 McLaren Logan Sargeant 2021–2022 31 2 4 4th 2023–2024 Williams Liam Lawson 2021–2022 51 5 13 3rd 2023–2025 AlphaTauri Oliver Bearman 2023–2024 50 7 9 6th 2024–2025 Ferrari Franco Colapinto 2023–2024 22 1 3 9th 2024-2025 Williams Jack Doohan 2021–2023 59 6 11 3rd 2024–2025 Alpine Gabriel Bortoleto 28 2 8 1st 2025 Sauber Isack Hadjar 2023–2024 54 5 10 2nd 2025 Racing Bulls Andrea Kimi Antonelli 2024 26 2 3 6th 2025 Mercedes Category:Auto racing",
 "title": "FIA Formula 2 Championship"
}