{
 "id": "112000",
 "text": "The Royal Rumble is a yearly professional wrestling pay-per-view and livestreaming event made by WWE, usually in January. The show's main event is a Battle Royal-type match, named the Royal Rumble match. The pay-per-view is part of WWE's \"Big Four\", along with WrestleMania, SummerSlam, and Survivor Series.Ian Hamilton. Wrestling's Sinking Ship: What Happens to an Industry Without Competition (p.160) The Royal Rumble is also one of WWE's more popular pay-per-views. Since 1993, the winner of the Rumble match has received a title match at that year's WrestleMania. ==History== ===Match=== The idea behind the Royal Rumble match is credited to Pat Patterson. Before the match begins, the contestants draw spots in the Rumble. The match consists of thirty competitors, beginning with the two who chose entry numbers one and two in the ring. At regular timed intervals, usually ninety seconds, one of the remaining 28 wrestlers enters the ring. Participants must eliminate all other opponents, and the winner of the matcht is the last wrestler remaining after all others have been eliminated. Similar to a Battle Royal, a wrestler is eliminated when thrown over the top rope, with both feet touching the floor. A referee, who is seated at ringside, must see an elimination in order for it to be valid. A wrestler who is eliminated without a referee noticing may sometimes sneak back into the match. For example, Stone Cold Steve Austin was eliminated during the 1997 event, but he re-entered without the referees' seeing and eventually won the match. A wrestler who leaves the ring without going over the top rope is not eliminated from the match. During the 1999 Rumble match, both Vince McMahon and Steve Austin left the ring, only to return later in the match. In the 1994 match, the last two wrestlers, Bret Hart and Lex Luger were named co- winners when it was decided that both of their feet touched the floor at the same time. A similar situation occurred in the 2005 match, however the match was restarted after Batista and John Cena eliminated each other at the same time. Batista eliminated Cena afterwards to win the match. The reward for the 1992 Royal Rumble was the WWF Championship. This title, now named the WWE Championship, was also the reward for the 2016 Royal Rumble. The tradition of granting a WWF/E Championship match at WrestleMania started in 1993. Beginning in 2004, the winner had their choice of a World Heavyweight Championship or WWE Championship match at WrestleMania. Because of the revival of the ECW Championship as a brand championship in mid-2006, the 2007 Rumble added this championship as a choice to the winning wrestler. From 2001 to 2007 the Royal Rumble match winner has gone on to win a World Championship title at WrestleMania. After winning the 2008 match, John Cena became the first to use his championship opportunity at an event other than WrestleMania. He also became the first man since 2000 to win the Royal Rumble match but fail to win the title in his championship opportunity as a result. Since 2018 there also is a women's Royal Rumble match, where the winner can challenge for the WWE Women's Championship or the Women's World Championship at that year's WrestleMania. The first one was won by Asuka. ===Pay-per-view=== The Royal Rumble is a pay-per-view consisting of the Royal Rumble match, championship matches, and various other matches. The first Royal Rumble took place on January 24, 1988 and was broadcast live on the USA Network. The following year, the event became a pay-per-view. It is part of WWE's \"classic five\" pay- per-views, along with WrestleMania, Survivor Series, SummerSlam, and King of the Ring.Brian Shields. Main Event: WWE in the Raging 80s (p.166) The Royal Rumble match is usually at the top of the card. However, it is not always the case, as the 2006 event had the match in the middle of the pay-per-view. The first Rumble match featured only twenty men, and it was called the Rumble Royale.Ric Flair. Ric Flair: To Be the Man (p.161) It lasted about 33 minutes of the 2-hour broadcast. Today, Rumble matches are much longer, with the longest match happening at the Greatest Royal Rumble (the only edition to have 50 men enter the match), lasting one hour and 17 minutes of a five-hour event. With the brand extension introduced in mid-2002, the 30 entrants from 2003 to 2006 had 15 wrestlers from both the RAW and SmackDown! brands. At first, the winner of the match received a shot at his brand's championship. Starting in 2004, the Rumble winner had the option of challenging either brand's champion. For instance, Chris Benoit switched brands in 2004 and won the World Heavyweight Championship. The 2007 Royal Rumble marked the first year participants from the ECW brand competed along with the RAW and SmackDown! brands. The winner of the Royal Rumble now had the option to challenge for the ECW Championship as well. The 2008 Royal Rumble was the first WWE pay-per-view to be aired in HD. ==Dates and venues== Event Date City Venue Winner Entry Royal Rumble (1988) January 24, 1988 Hamilton, Ontario, Canada Copps Coliseum Jim Duggan 13 Royal Rumble (1989) January 15, 1989 Houston, Texas The Summit Big John Studd 27 Royal Rumble (1990) January 21, 1990 Orlando, Florida Orlando Arena Hulk Hogan 25 Royal Rumble (1991) January 19, 1991 Miami, Florida Miami Arena 24 Royal Rumble (1992) January 19, 1992 Albany, New York Knickerbocker Arena Ric Flair 3 Royal Rumble (1993) January 24, 1993 Sacramento, California ARCO Arena Yokozuna 27 Royal Rumble (1994) January 22, 1994 Providence, Rhode Island Providence Civic Center Bret Hart Lex Luger 27 23 Royal Rumble (1995) January 22, 1995 Tampa, Florida USF Sun Dome Shawn Michaels 1 Royal Rumble (1996) January 21, 1996 Fresno, California Selland Arena 18 Royal Rumble (1997) January 19, 1997 San Antonio, Texas Alamodome Steve Austin 5 Royal Rumble (1998) January 18, 1998 San Jose, California San Jose Arena 24 Royal Rumble (1999) January 24, 1999 Anaheim, California Arrowhead Pond Vince McMahon 2 Royal Rumble (2000) January 23, 2000 New York, New York Madison Square Garden The Rock 24 Royal Rumble (2001) January 21, 2001 New Orleans, Louisiana New Orleans Arena Steve Austin 27 Royal Rumble (2002) January 20, 2002 Atlanta, Georgia Philips Arena Triple H 22 Royal Rumble (2003) January 19, 2003 Boston, Massachusetts Fleet Center Brock Lesnar 29 Royal Rumble (2004) January 25, 2004 Philadelphia, Pennsylvania Wachovia Center Chris Benoit 1 Royal Rumble (2005) January 30, 2005 Fresno, California Save Mart Center Batista 28 Royal Rumble (2006) January 29, 2006 Miami, Florida AmericanAirlines Arena Rey Mysterio 2 Royal Rumble (2007) January 28, 2007 San Antonio, Texas AT&T; Center The Undertaker 30 Royal Rumble (2008) January 27, 2008 New York, New York Madison Square Garden John Cena 30 Royal Rumble (2009) January 25, 2009 Detroit, Michigan Joe Louis Arena Randy Orton 8 Royal Rumble (2010) January 31, 2010 Atlanta, Georgia Philips Arena Edge 29 Royal Rumble (2011) January 30, 2011 Boston, Massachusetts TD Garden Alberto Del Rio 38 Royal Rumble (2012) January 29, 2012 St. Louis, Missouri Scottrade Center Sheamus 22 Royal Rumble (2013) January 27, 2013 Phoenix, Arizona US Airways Center John Cena 19 Royal Rumble (2014) January 26, 2014 Pittsburgh, Pennsylvania Consol Energy Center Batista 28 Royal Rumble (2015) January 25, 2015 Philadelphia, Pennsylvania Wells Fargo Center Roman Reigns 19 Royal Rumble (2016) January 24, 2016 Orlando, Florida Amway Center Triple H 30 Royal Rumble (2017) January 29, 2017 San Antonio, Texas Alamodome Randy Orton 23 Royal Rumble (2018) January 28, 2018 Philadelphia, Pennsylvania Wells Fargo Center Shinsuke Nakamura Asuka 14 25 Greatest Royal Rumble April 27, 2018 Jeddah, Saudi Arabia King Abdullah International Stadium Braun Strowman 41 Royal Rumble (2019) January 27, 2019 Phoenix, Arizona Chase Field Becky Lynch Seth Rollins 28 10 Royal Rumble (2020) January 26, 2020 Houston, Texas Minute Maid Park Charlotte Flair Drew McIntyre 17 16 Royal Rumble (2021) January 31, 2021 St. Petersburg, Florida WWE ThunderDome at Tropicana Field Bianca Belair Edge 3 1 Royal Rumble (2022) January 29, 2022 St. Louis, Missouri The Dome at America's Center Ronda Rousey Brock Lesnar 28 30 Royal Rumble (2023) January 28, 2023 San Antonio, Texas Alamodome Rhea Ripley Cody Rhodes 1 30 Royal Rumble (2024) January 27, 2024 St. Petersburg, Florida Tropicana Field Bayley Cody Rhodes 3 15 Royal Rumble (2025) February 1, 2025 Indianapolis, Indiana Lucas Oil Stadium Charlotte Flair Jey Uso 27 20 ==Video box set== On March 13, 2007, WWE released a full DVD box-set called Royal Rumble: The Complete Anthology, which showcases every Royal Rumble event in its entirety. == Footnotes == ==References== General * * Specific * * * ==Further reading== * * * * * * == Other websites == *Official Royal Rumble Website *WWE.com: Royal Rumble match description *WWE.com: Royal Rumble Facts & Figures *Royal Rumble History at About.com Category:1988 establishments Category:January events",
 "title": "Royal Rumble"
}