{
 "id": "1120687",
 "text": "The Wayback Machine or WABAC Machine is a fictional time machine from the \"Peabody's Improbable History\" segment of the 1960s cartoon The Rocky and Bullwinkle Show. ==The Rocky and Bullwinkle Show== The Wayback Machine is the main element of the \"Peabody's Improbable History\" segment. It was invented by Mr. Peabody, a genius, polymath, and bow tie-wearing beagle, as a birthday gift for his adopted pet boy, Sherman. With the Wayback, Peabody and Sherman have all sorts of adventures through different times and places. Examples of the places or people visited are the Marquess of Queensberry and the rules of boxing, the imprisonment and memoirs of Casanova, and Jim Bowie and the Bowie knife. The machine apparently later returned Mr. Peabody and Sherman to the present, although the return trip was never shown. The segment traditionally ended with a pun. The Wayback is also a translator. Either of the names \"Wayback\" or \"WABAC\" are in common usage, with the term \"WAYBACK\" are spoken out during the segment in which Mr. Peabody and Sherman visit the \"Charge of the Light Brigade\". The precise meaning of the acronym WABAC is unknown. According to Gerard Baldwin, one of the show's directors, the name \"WABAC\" is a reference to the UNIVAC I. Mid-century, large-sized computers often had names that ended in \"AC\" (generally for \"Automatic/Analogue Computer\" or similar), such as ENIAC or UNIVAC. The term \"Wayback\" suggests the common expression \"way back in [some former time]\". == Mr. Peabody and Sherman film (2014)== The movie studio DreamWorks Animation announced in 2006 and again in 2012 that they were creating an animated movie entitled Mr. Peabody & Sherman, which was released March 7, 2014. The WABAC machine is a central element to the plot. In the movie, the acronym is revealed to be Wavelength Acceleration Bidirectional Asynchronous Controller (WABAC). ==See also== * Back to the Future (film) * DeLorean time machine * Memory hole * TARDIS * Time travel ==References== Category:Time travel Category:The Rocky and Bullwinkle Show",
 "title": "Wayback Machine (Peabody's Improbable History)"
}