{
 "id": "1120706",
 "text": "Cult of the Lamb is a roguelike video game. It was published by Devolver Digital and was developed by Massive Monster. It was released on August 11, 2022 for the macOS, Nintendo Switch, PlayStation 4, PlayStation 5, Windows, Xbox One, and Xbox Series X/S. The game is about a lamb who is saved from death by a stranger called \"The One Who Waits\". To come back to life, they are given the task of recruiting followers for a cult in the name of The One Who Waits. The player can recruit followers by rescuing them, defeating bosses, and doing quests. Players can also tell followers to do different tasks such as building structures, getting items, and becoming a demon to help in battle. The needs of the members have to be looked after or else they will dissent and leave the cult. == Gameplay == Cult of the Lamb is centered around a lamb, controlled by the player, who is given the job of forming a cult in order to calm down the god \"The One Who Waits\". Having saved the player character's life at the start of the game, it instructs them to start on roguelike-style \"crusades\" by going out into one of the game's four areas in order to defeat different heretics. There they can find or rescue other lost or imprisoned followers in order to create and grow a cult dedicated to the player. The randomly generated world contains valuable supplies to gather, perks and weapons to collect, enemies in the form of rival cultists and non-believers to fight, and other followers to rescue; these followers can be indoctrinated into the player's cult. They have appearances that can be changed and both positive and negative qualities, which can affect how they act in the cult or how they react to the player's actions relating to the cult. The player can manage their followers in their team's village. Followers can be assigned tasks at the base such as gathering valuable supplies, building structures, worshipping, sending them to help the player during the fight, or sacrificing them, which can affect the lamb's abilities and the team itself. The player must make sure their followers' needs are met by performing sermons and rituals to strengthen their faith, cooking food for them to survive, providing them with shelter, and making sure the cult is clean and sanitary. Otherwise, the followers can turn against the player, spread dissent, and eventually leave the cult with other followers; to prevent this, the player can provide for them, give them gifts, reeducate them, reeducate them in prison(Which does more.),or sacrifice them, until they stop disagreeing. === Twitch Integration === The game has Twitch integration via the \"Companion of the Lamb\" Twitch extension. Viewers can customize their follower by entering via a \"Follower Raffle\", which (when chosen at random) will have their username displayed above their character at all times. Other features include the \"Twitch Totem Bar\" which lets viewers add channel points, resulting in a random reward for the player, and a \"Help or Hinder\" event where they can vote to either help or interfere with the player's progress. ==Reception== The game received positive reviews by game critics. Critics said that they liked the combat, art style, customization, and replayability. However, critics also felt that the cult customization was too difficult at times and resources were sometimes too hard to find. The game would also win many awards. Among the awards won, it won Game of the Year, Excellence in Music, Excellence in Art, and Excellence in Gameplay at the 2022 Australian Game Developer Awards. It also won Best Indie Game at the 2022 Golden Joystick Awards and was nominated for Best Independent Game at The Game Awards in 2022. ==References== Category:2022 video games Category:Construction and management simulation games Category:Cooperative video games Category:Dark fantasy video games Category:Dungeon crawler video games Category:Indie video games Category:Life simulation games Category:MacOS games Category:Nintendo Switch games Category:PlayStation 4 games Category:PlayStation 5 games Category:Roguelike video games Category:Multiplayer and single-player video games Category:Video games about animals Category:Windows games Category:Xbox One games Category:Xbox Series X and Series S games",
 "title": "Cult of the Lamb"
}