{
 "id": "1120297",
 "text": "The inauguration of James Buchanan as the 15th president of the United States happened on March 4, 1857. It was the start of the only term of James Buchanan as president and John C. Breckinridge as vice president. A public ceremony was held at the East Portico of the United States Capitol in Washington, D.C. This was the 18th presidential inauguration, and was the first one known to be photographed. Chief Justice Roger B. Taney administered the presidential oath of office. In his inaugural address, President Buchanan spoke on the issue of slavery. He supported the Kansas–Nebraska Act, but did not have a strong position on slavery. He said he would accept the Supreme Court's decision in Dred Scott v. Sandford. Buchanan also talked about the economy and his plans for it, such as making the Navy bigger. Buchanan talked about the expansion of the United States, saying that territories and hold holdings were peacefully taken, and enjoyed increased economic trade and prosperity due to America's influence.Buchanan, James. \"Miller Center.\" Inaugural Address (March 4, 1857)-. N.p., n.d. Web. 11 Nov. 2016. During the ceremony, Buchanan was seen quietly talking with Chief Justice Roger Taney. This, along with the president mentioning the Dred Scott v. Sanford decision in his speech, made supporters of the Republican Party suspicious. They believed the two men may have had improper discussions before the court's decision, which was seen as breaking the separation between the executive and judicial branches.America in 1857: A Nation on the Brink by Kenneth M. Stampp (1990) , pp. 64, 106Slavery, Law and Politics: The Dred Scott Case in Historical Perspective by Don E. Fehrenbacher (1981) , p. 168 The conversations did indeed happen, but through letters exchanged between Buchanan and Supreme Court Justice John Catron in February.Slavery, Law and Politics: The Dred Scott Case in Historical Perspective by Don E. Fehrenbacher (1981) , pp. 164-168 ==References== ==Other websites== *More documents from the Library of Congress *20th Presidential Inauguration (Buchanan) from Our Campaigns *Text of Buchanan's Inaugural Address Category:United States presidential inaugurations Category:James Buchanan Category:1857 in the United States",
 "title": "Inauguration of James Buchanan"
}