{
 "id": "1120422",
 "text": "James K. Vardaman was an American Democratic Party politician who served in different political functions, including that of governor of Mississippi from January the 19th 1904 to January the 21st 1908.The Official and Statistical Register of the State of Mississippi Volume 6 by Mississippi Department of Archives and History, 1924, P.26 Prior to his entry into politics, Vardaman practiced law and also became involved in the newspaper business.Encyclopedia of Mississippi by Nancy Capace, 2001, P.438 A wide range of social reforms were carried out during Vardaman's time as governor. According to one study, this included measures such as the adoption of a law reducing the legal rate of interest from 10% to 8% and laws governing life insurance companies.Biographical sketches of James Kimble Vardaman by A.S. Coody, 1922, P.36 State regulation of utilities, banks and railroads was also increased.[https://www.google.co.uk/books/edition/Mississippi_Government_and_Politics/ygMQDdnlH6cC?hl=en&gbpv;=1&dq;=In+a+Democratic+primary+election+in+1911,+Vardaman+was+able+to+unseat+Percy&pg;=PA33&printsec;=frontcover Mississippi Government and Politics Modernizers Versus Traditionalists By Dale Krane and Stephen Daryl Shaffer, 1992, P.33] Increases were made in common- school appropriations by almost 20% while teacher’s salaries went up by almost 30.%Revolt of the rednecks: Mississippi politics, 1876-1925 by Albert Dennis Kirwan, 1951, P.175 Educational provision was also made for those classed as deaf or dumb.Biographical sketches of James Kimble Vardaman by A.S. Coody, 1922, P.33-34 A uniform text book law was adopted, giving the same books in all of the schools throughout Mississippi. This saved people a lot of money in purchasing school books for their children.Biographical sketches of James Kimble Vardaman by A.S. Coody, 1922, P.345 At a hospital for those classed as insane, the first open air hospital for treating TB in the South was built. A state home was also set up to care for old and indigent Confederate veterans.Biographical sketches of James Kimble Vardaman by A.S. Coody, 1922, P.34 Laws aimed at improving public health and sanitation were also introduced.Laws of the state of Mississippi 1906, P.100-101 A Department of Agriculture was set up in 1906 which, according to one study, “was especially important, given the recent appearance of the boll weevil in the state. State and federal scientists working together would help the state’s cotton farmers cope with this new crisis.”Rednecks, Redeemers, and Race Mississippi After Reconstruction, 1877-1917 by Stephen Cresswell, 2021, P.198 Banks were also required to submit competitive interest-rate bids for deposits of state revenue, and the practice of letting private landowners use convicts from state prisons as free labor was ended.The Improbable First Century of Cosmopolitan Magazine by James Landers, 2010, P.162 While serving as senator in Congress, Vardaman supported various progressive measures.Populism in the White Southern Democratic Party With Reference to Alabama and Mississippi by William Sheward, 2001, P.233 Many of Vardaman's successors would continue his reform agenda.[https://www.google.co.uk/books/edition/Redneck_Liberal/f8_t3_Ss0_MC?hl=en&gbpv;=1&dq;=This+combination+of+race- baiting+and+economic+realism&pg;=PA16&printsec;=frontcover Redneck Liberal Theodore G. Bilbo and the New Deal By Chester M. Morgan, 1985, P.16] Hamilton, Charles Granville (1956) \"Mississippi Politics During the Progressive Period,\" Journal of the Arkansas Academy of Science: Vol. 9, Article 9 (https://scholarworks.uark.edu/jaas/vol9/iss1/9/) Less progressive was Vardaman’s views on race. Vardaman believed that African-Americans were inherently inferior and indolent. He was also opposed to the 14th and 15th amendments to the United States Constitution. These extended citizenship rights to African-Americans. Vardaman also opposed the appointment of a black postmaster in the state, along with an invitation of Booker T. Washington to the White House.Mississippi A History by Westley F. Busbee, 2015, P.207 ==References== Category:1861 births Category:1930 deaths Category:Governors of Mississippi Category:United States senators from Mississippi Category:State legislators of the United States Category:White supremacists Category:Democratic Party (United States) politicians Category:20th-century American politicians",
 "title": "James K. Vardaman"
}