{
 "id": "1120485",
 "text": "Peppa Pig is a British preschool animated television series, It was produced by Astley Baker Davies. The show is about a piglet and her friends and family. Each episode is ten minutes long. ==Series overview== ==Episodes== The following tables list with details the episodes for the children's television programme Peppa Pig, which were first broadcast in the UK on Channel 5 and Nick Jr., and in the US on Cartoon Network, starting in 2003. Each episode is approximately ten minutes long, except for a 10-minute \"Special\" (\"Peppa's Christmas\") and two 15-minute \"Specials\" (\"The Golden Boots\") and (\"Around The World with Peppa\"). This list also includes upcoming episodes. The \"DVD reference\" column in the episode lists is used to relate an episode to the DVD volume(s) on which it can be found (e.g. episode 10 in series 1 \"Gardening\" has a DVD reference of 1.09, which indicates that the episode is track 9 on primary DVD volume 1). A prefix of \"NP\" (e.g. NP1.01) indicates the episode is the first episode on \"Non-Primary\" DVD 1. ===Series 1 (2003-04)=== ===Series 2 (2005–07)=== ===Christmas special (2007)=== ===Series 3-4 (2009–10)=== ===Series 5-6 (2011–13)=== ===Specials (2014–16)=== ===Series 7 (2016–18)=== ===Film (2017)=== ===Series 8 (2019–20)=== ===Series 9 (2021–23)=== ===Series 10 (2023–25)=== ==Peppa Pig Tales (2022–2025)== These episodes are uploaded weekly on Saturdays on YouTube. These have a different voice cast for the characters to typical episodes. ===Series 1 (2022-23)=== ===Series 2 (2023)=== ===Series 3 (2023-24)=== ===Series 4 (2024)=== ===Series 5 (2024-25)=== ===Notes=== The episode numbering is based on the original (UK) broadcast dates. The US and Australian air dates are only listed if an episode premiered in one of those countries first. The original broadcast dates for series 1 & 2 and the \"special\" were derived by an analysis across various data sources, in particular: :(a) the Radio Times listings (paper archive) :(b) the Channel 5 episode list :(c) notes on TVThrong :(d) the MSN TV episode list and :(e) the Daily & Sunday Express newspaper archives. ==References== ==Other websites== * * Peppa Pig official website * Peppa Pig at milkshake.tv * Peppa Pig at nickjr.co.uk * Category:Lists of comedy television series episodes",
 "title": "List of Peppa Pig episodes"
}