{
 "id": "1121013",
 "text": "Sterilization of Native American women happened throughout the 1960s and 1970s. (Sterile here means unable to have children; sterilization means making a person unable to have children forever.) During this time, many Native American women were given cutting to make health better or drugs to make it impossible to have children. The Indian Health Service (IHS) and the doctors working with them often made women unable to have children forever. Native American women were told various lies to trick them into being made unable to have children forever. Sometimes they were told that cutting them to make them unable to have children forever could be undone. Sometimes they were not told all the things they needed in order to say \"yes\" while knowing all they needed to know. Sometimes they were told nothing at all. In other cases, Native American women were told they would lose their healthcare or welfare if they did not get health workers to make them unable to have children forever. In some of these cases, girls as young as 11 were made unable to have children forever. Normally and often, doctors told Native American women they should be made unable to have children forever, but did not do the same with wealthier white women. == Numbers == Indian Health Service (IHS) areas had rules about letting people choose whether to become unable to have children forever. In a 1976 study, the U.S. Government Accountability Office (GAO) found that four Indian Health Service areas did not follow these rules. In many cases, doctors were using forms that did not ask what the women had been told and whether they had the information they needed. In these four IHS areas, between 1973-1976, doctors made 3,406 women unable to have children. 36 of those women were under the age of 21, even though the IHS had been told not to do this. People found they needed to know more. The IHS had only studied and counted the number of times Native American women were made unable to have children forever for four out of twelve IHS areas. It is hard to know how many Native American women were made unable to have children forever. The GAO suggests the smallest possible number. Other tries at the right number say that between 1970-1976, the IHS made 25-50% of Native American women unable to have children. In that same time span, the highest number anybody thought was possible said that up to 70,000 women may have been made unable to have children forever. Meanwhile, about 15% of white women were made unable to have children during the 1970-1976 time period. Gartner et al., 2020 find that Native American women are made unable to have children forever more often than most women in .LeMasters et al., 2022 and Linder et al., 2022 say good things about Gartner et al., 2020. This is Gartner et al., 2020: http://doi.org/10.1097/EDE.0000000000001171 The number of Native American women who have been made unable to have children forever is surprisingly high when you remember that Native American women are less likely to have health insurance. That means a lot of money is being given to pay for making Native American women unable to have children forever.Many experts say good things about Shreffler et al., 2015. Some of those experts are: Koppl 2018, Guzzo and Hayford 2020, American College of Obstetricians and Gynecologists Committee on Ethics 2017, Britton et al., 2020, Shreffler et al., 2017, American College of Obstetricians and Gynecologists Committee on Ethics 2017, Jackson-Bey et al., 2021. This is Shreffler et al., 2015: http://doi.org/10.1016/j.ssresearch.2014.10.010 == Ways of making Native American women unable to have children forever == These are . In Simple English that means: This section is about ways of making Native American women unable to have children forever. === Cutting for health === There were two major surgical techniques for sterilizing women. That means there were 2 most used ways for health workers to cut women to make them unable to have children. The first involved cutting out the womb (the uterus). The second technique involved tying, blocking, or cutting the fallopian tubes. The first way was more dangerous, and had a higher risk that things might go wrong. Still, in 1971, a medical doctor named James Ryan said that he enjoyed cutting the womb out more than binding the fallopian tubes because \"it's more of a challenge... and it's good experience for the junior resident [a newer doctor]\". Women were not asked how (or whether) they wanted to be sterilized; doctors made that choice for them. After finding out that they had been made unable to have children forever, some women asked their doctors to give them someone else's womb. === Drugs for health === Sometimes, ways of making women unable to have children only for a short time were used. These are drugs that make it impossible to have children - but only while a woman is taking those medications. They are only for women. One medication like this was Norplant. It involved pills with chemicals in them being stuck under a woman's skin. Norplant has many things that may happen other than what the drug was meant to do, including irregular or heavy menstrual bleeding; headaches; nausea; and depression. Later, a group of people sued Wyeth Pharmaceuticals (Norplant's maker). They argued that Wyeth did not tell people enough about the drug's possible side effects. This medication is no longer used in the United States. Depo-Provera was another drug to make women unable to have children for a short time that doctors used on Native American women. It is given as a shot (an injection) every three months. Before the FDA said Depo-Provera was safe to use in 1992, doctors were already using it on Native American women with intellectual disabilities. Today, the Indian Health Service still makes women unable to have children forever to change the number or timing of children. However, binding the fallopian tubes and cutting men's tubes are the only things that may be done if the real reason is to make someone unable to have children forever. Today the law says the IHS must get the woman to: say yes to doing this, be 21 years of age or older, and not be involuntary commitment in a correctional or a mental health facility building. == The past of making people in the United States unable to have children against their will == Native American women were not the only people to be made unable to have children against their will. Women of African ancestry were also made unable to have children against their will. Poor women were also made unable to have children against their will. Making people unable to have children against their will to try to make more people have good genes stemmed from Francis Galtons writings on using learning about genes to better the human race. The groups who wanted to do this got more and more people, and in 1907, Indiana was America's first state to make a law making people unable to have children against their will. Doing this became someone that was done often and over the next twenty years fifteen more states would make laws that were almost the same. === Buck v. Bell === In 1927, the Supreme Court case Buck v. Bell allowed a law in Virginia to stand that made people unable to have children against their will. The case was about a woman and her daughter and her daughter from the Buck family: Emma, Carrie and Vivian. By looking at more than one generation of women from the same family, people who talked about making people have better genes with science hoped to make the Court believe that Carrie Bell was not as smart because of things she got from her mother and a danger to public welfare; they won, and she was made unable to have children against their will. Oliver Wendell Holmes Jr. said in his part of what the court said, \"it is better for all the world if instead of waiting to execute degenerate offspring for crime, or to let them starve for their imbecility, society can prevent those who are manifestly unfit from continuing their kind. The principle that sanctions compulsory vaccination is broad enough to cover cutting the Fallopian tubes.\" This means Oliver Wendell Holmes thought: It is better for all the world if instead of waiting to kill less good children because they have done something against the law, or to let them starve for their lack of intelligence, we can all stop those who are doing things that are not good enough from having children. The idea that lets people make someone get vaccines even if they don't want to is broad enough to cover cutting the Fallopian tubes. The case made people think better things about laws making people unable to have children against their will. This made people think better things about making people unable to have children against their will. During the 1960s and 70s, as making people unable to have children was happening more and more there was no law that stopped it and it was seen as a good way to not have children. === Relf sterilization case === The 1974 Relf sterilization case was about Department of Health and Human Services rules on making people unable to have children. This case happened in a district court. The court found that Department of Health and Human Services rules on making people unable to have children were not written in a way that makes sense. The court said that because the rules did not check enough whether the person had said yes. This case was part of a growing awareness during the 1970s that making people unable to have children the wrong way was becoming a really bad thing. Among other things shown in the case, it was found that 100,000 to 150,000 people were made unable to have children every year using money from things paid for by the federal government. Other people hearing about the case made people know that the poor and people who were not white were at risk of being talked into being made unable to have children without getting to say yes or no. This led to the law saying that people have to be able to say yes or no before being made unable to have children. == The Indian Health Services == After Congress raised the pay for Indian Health Services (IHS) doctors two things happened: the things the doctors did were safer; and the doctors began to do things to make women not have children. Doctors doing things to make women not have children led to them making people unable to have children forever. ==Reasons for making people unable to have children forever== Native American women were not the only people to be treated to making people unable to have children forever against their will. Black and poor women were also made unable to have children forever against their will. In the 1970s, Native American people got things they needed from parts of the government like the IHS, Department of Health, Education, and Welfare (HEW) and the Bureau of Indian Affairs (BIA). The Indian Health Service (IHS) was their main health helper. Because Native Americans were could not get health help anywhere other than these government groups, they were more at risk for being made unable to have children forever against their will than other groups of people. Six years after the passing of the Population Research Act of 1970, the numbers make it seem that doctors made maybe 25% of Native American women of childbearing age unable to have children forever. The numbers make it seem like that the numbers were higher. These high numbers could be linked to a law giving more money to help make people unable to have children forever if they used Indian Health Service and Medicaid. Some health experts point out that sterilization of Native American women is important to prevent cervical cancer.https://www.sciencedirect.com/science/article/abs/pii/S0027968420300432 Wong et al., 2011 find that sterilization of Native American women has made Native American women have less cancer. Wong et al., 2011 find that sterilization of Native American women has made Native American women have 43% less cervical cancer.http://doi.org/10.3389/fonc.2016.00089 DeSantis et al., 2019, Temkin et al., 2018, Kaufman 2017 and others have said good things about this paper. This paper says good things about this paper: http://doi.org/10.1007/s10552-011-9844-2 Cackler et al., 2016 is a finding of many mental illnesses among Native American women. Cackler et al., 2016 is a finding that mental illnesses and being made unable to have children forever often go together among Native American women. Cackler et al., 2016 find that health workers should think about Native American women being made unable to have children forever when talking to Native American women about mental health. Cackler et al., 2016 find that health workers should think about Native American women's mental health when talking to Native American women about Native American women being made unable to have children forever.Many experts say good things about Cackler et al., 2016. Some of those experts are Maxwell and Leat 2022, Taylor et al., 2023, Davis et al., 2019, French 2019. This is Cackler et al., 2016: http://doi.org/10.1016/j.whi.2015.10.002 === Paternalism === Most of the doctors making these women unable to have children forever saw this as the best choice for these women. They claimed it would leave these women with more money and their family's with a better life. Many of these doctors believed that Native American women were not smart enough to use other ways of not having children. Thus, making these women unable to have children forever was seen as the way of not having more children most likely to keep working. When doctors were asked on what they say to people they talked to away from other people, only 6% said it was better to make people unable to have children forever, while 14% would say it to those on welfare. When they were asked about their thinking about government rules about ways to not have children, 94% said they would be happy about making a mother unable to have children forever against her will if she is on welfare with three or more children. With fewer people asking to have Medicaid and welfare, the federal government could lower spending on welfare. Poor women, people who can't do all the same things as other people, and women of color were pushed to become unable to have children forever for almost the same reasons. Also, the higher number of health jobs where some cutting happens was seen as good training for doctors and as a way to keep their skills good for resident doctors. === Pay === One idea people have is that IHS doctors were underpaid and overworked and they made Native American women unable to have children forever so they would have less work in the later years. The most new IHS doctors made $17,000 to $20,000 a year and worked around 60 hours per week. In 1974 the number of doctors to number of people they must help was dangerously low, with only one doctor to 1,700 people in the areas they worked. The problems caused by a lack of doctors were made even worse when a the military stopped trying to draft doctors was ended in 1976. This strongly changed things in the IHS because they got many of their doctors from the military. Between 1971 and 1974 doctors asking to work in an empty IHS job went from 700 to 100, meaning that the burden of more work fell on an ever falling number of doctors. One big difference is between doctors who worked for the IHS itself and other doctors who only worked for IHS when called and paid money, who made people unable to have children forever. For IHS doctors, there was no more money they would get to make people unable to have children forever, and therefore other things they thought about likely played the biggest part. Doctors who worked for IHS only when called and paid were paid more when they made women unable to have children forever instead of giving them pills, making a money reason more believable. Even though there was no money reason for the IHS doctors to say people should be made unable to have children forever, as written above, becoming unable to have children forever was seen as the best way to have fewer children for Native Americans during the 1960s and 1970s. IHS doctors had mostly Protestant and middle-class ideas about choosing when and how many children to have, caring more about a nuclear family with a small number of children. The idea they already had that Native American women wanted the same family numbers and ages as middle class white Americans helped make making people unable to have children forever in the wrong ways possible. ==Effects== === Low birth rate === A big thing that making Native American women unable to have children forever did was that the number of children Native Americans became lower. In 1970, the number of children of Native American women was 3.29, but it went down to 1.30 in 1980. The birthrate of Apache women fell from 4.01 to 1.78. To look at the numbers for other people, the birth rate among white women fell from 2.42 to 2.14. By some counts, at least 25% of Native American women between the ages of 15 and 44 were made unable to have children forever during the time this was done the most. Native women lost money and government power by not being able to have children at the same rate as white women. One thing that making Native American women unable to have children forever did was increase the risk of extinction of the Native American culture. That is to say: One thing that making Native American women unable to have children forever may do in later years is cause the extinction of the Native American culture. === Stigma === The lowering of birth rate was a thing you can count with numbers, however, making them unable to have children forever changed the lives of many Native American women in ways that are not countable with numbers as well. Within the ways that Native Americans do things a woman's being able to have children is greatly valued, leading to problems of the mind and with other people from being made unable to have children forever. A woman being made unable to bear children would cause shame. A woman being made unable to bear children may cause the woman's tribe to say bad things about her. Those bad things would be due to how Native American peoples see motherhood. In 1977, lawyer Michael Zavalla did something in a court in Washington State after three Cheyenne women from Montana were made unable to have children forever without being able to choose. However, the women who had been made unable to have children forever did not give their names because they feared bad things would happen with their tribes. Worse than having to pay to do things in court was the risk of losing one's place among the natives, because becoming unable to have children is a big problem in religion. In some areas, the cutting itself was not clean enough, which led to bad things afterward. When bad things afterward happened, more health help was needed, but government money only covered the health job to cut the woman. Because most women could not pay for follow-up health help, in many cases they did not get it, and some died because of it. Marie Sanchez says large numbers of Native Americans being made unable to have children forever was a way to do away with a whole people, today. === Distrust === Native American women and men do not fully trust the U.S. government due to being made unable to have children forever against their will, and are still not sure about new ways to not have children. ==Today== Today the law says that before sterilizing a woman, the woman must: * Give her informed consent * Be 21 years of age or older * Be making her decision freely * Not be put against her will in jail or a psychiatric hospital Science needs to learn more about making Native American women unable to have children forever.https://aacrjournals.org/cebp/article-abstract/33/1/20/732007/Racial- and-Ethnic-Disparities-in-the-Use-of-Robot ==Related pages== *Abortion in the United States *Compulsory sterilization#United States ==References== ==Works cited== * Category:Native Americans",
 "title": "Sterilization of Native American women"
}