{
 "id": "1121837",
 "text": "Yaser Bakhtiari (, born 1982 in Talesh, Iran) better known by his stage name Yas (), is an Iranian Hip hop Artist (rapper). He wears a Faravahar symbol pendant, a symbol of Iranian nationalism and Zoroastrianism.Iranian rapper YAS at UNC, Herald Sun, 2009Iranian Rapper Speaks of Peace at Film Screening , Western Herald, 19 October 2008Iranian Filmmaker Sarmast and Rapper YAS to Visit Campus , Daily Swarthmore, 26 March 2009 On 21 December 2011 Yas was chosen by the voters as the Artist of the Week in MTV IGGYYAS as the Artist of the Week in MTV IGGY Entitled Tehran’s Hard-Hitting MC.Artist of the Week: Tehran's Censor-Busting MC Yas. MTVIGGY.com ==Early life== Yas first began to listen to rap music at the age of 14 his father returned from his business trip in Germany and brought him the latest Tupac album and other hip-hop songs and he was heavily influenced by them. After the sudden death of his father, he was faced with the responsibility of becoming the primary caretaker of his household with his father's debts to pay.Yas Biography in bio98(WebArchive) Yas was forced to leave his college ambitions behind and begin to work and support his entire family. It was at this time that he began to write poetry which soon turned into lyrics for his music. ==Music career== Yas started his work after the 2003 Bam earthquake. Devastated by the disaster, it was then, that he wrote his first song \"Bam\". This was the beginning of his rapping career.Yas Biography in Fanpop Yas in 2006 made a song called CD Ro Beshkan (Break The Disk) which was written about actress Zahra Amir Ebrahimi in Iran who was the victim of a Sex scandal tape. The scandal ultimately ended her career. In the song, Yas criticizes the people for playing a role in her demise and asked everyone to stop spreading her shame and to get rid of the footage from their computers and cellphones. The song was listened to and downloaded by millions in Iran alone. In 2013, he became the first rapper allowed to perform by the Iranian government. In 2014, Yas teamed up with Tech N9ne. They were the first rappers from Iran and the United States to make music together. Their song, called \"The Sound of Unity,\" was released with a music video. ==References== ==Other websites== * Yastunes website * Yas Story: From Tehran Streets to Global Beats Category:1982 births Category:Living people Category:Iranian songwriters",
 "title": "Yas (rapper)"
}