{
 "id": "1121156",
 "text": "The Cauca poison frog (Andinobates bombetes) is a frog. It lives in Colombia. ==Body== The adult male frog is about 17.76 mm long from nose to rear end and the adult female frog is about 18.63 mm. The skin of the frog's back is black or dark brown in color with red or orange marks from the nose to the middle of the body. There is more red or orange color on the head. The sides of the body are black in color, even if the rest of the back is brown. There are yellow or yellow-green spots on the sides. The front legs can be red or orange in color but are always the same color as the stripes. The outside of the mouth can be the same color as the stripes or it can be green with some red. The tops of all four feet can have some blue, green, or yellow color. The toes of all four feet are light brown or gray in color. The bottoms of the feet are dark gray in color. The bottoms of the front legs are black with lighter marks. The belly can be black with green, yellow, or blue-green marks. The tongue and mouth are dark gray in color. The iris of the eye is brown, so dark that the pupil is hard to see. ==Home== This frog lives in cloud forests high in the hills. People have seen this frog between 850 and 2300 meters above sea level. It sits on bromeliad plants because pools of water stay in the leaves. It can live in places that human beings have changed if bromeliad plants grow there. ==Young== The female frog lays eggs in dead leaves on the ground. The tadpoles swim in water in bromeliad plants. Scientists have seen the male frogs carrying tadpoles on their backs. The tadpoles are gray-brown in color and part of the tail is clear. The tadpoles have large beaks. ==Danger== Scientists say this frog is in some danger of dying out. Human beings change the places where the frog lives to make farms and places for cows to eat grass. They also cut down trees to get wood to build with and plant pine trees to cut down later. People sometimes catch this frog to sell as a pet, even though that is against the law. Bad chemicals from farms, for example chemicals that make plants grow and chemicals that kill insects can also kill this frog. ==References== Category:Frogs of South America",
 "title": "Andinobates bombetes"
}