{
 "id": "1121010",
 "text": "Extinction threshold are words used in the study of finding out how to keep groups of living things alive. An extinction threshold is the level below which we are sure that a species, group of things of the same species or group of group of living things of the same species will go extinct. This occurs because of a change in an important number, such as how much habitat it has.Ovaskainen, O. and Hanski, I. 2003:Extinction Threshold in Metapopulation Models, Ann.Zool.Fennic.40:81-97. This may take any amount of time. This may take a long time. This often takes a long time for species just below the threshold. This taking of a long time is known as extinction debt. Extinction thresholds are important to conservation biologists when studying a species in a population or metapopulation context because the colonization rate must be larger than the extinction rate, otherwise the entire entity will go extinct once it reaches the threshold.Groom, M., Meffe, G. K., and Carroll, C.R. 2000:Principles of Conservation Biology, 3rd Ed, Sinauer Associates. Extinction thresholds are found in a lot of different situations. The reason to study and think and talk a lot about extinction thresholds is to find out what those situations are.With, K.A. and King, A.W. 1999:Extinction Thresholds For Species in Fractal Landscapes, Conservation Biology: Vol 13, No.2, pp.314-326. Modeling extinction thresholds can explain the relationship between extinction threshold and habitat loss and habitat fragmentation.Fahrig, Lenore. 2002:Effect of Habitat Fragmentation on the Extinction Threshold: A Synthesis, Ecological Applications: Vol.12, No.2, pp.346-353. == Mathematical models == Metapopulation-type models are used to predict extinction thresholds. The classic metapopulation model is the Levins Model, which is the model of metapopulation dynamics established by Richard Levins in the 1960s. It was used to evaluate patch occupancy in a large network of patches. This model was extended in the 1980s by Russell Lande to include habitat occupancy. This mathematical model is used to infer the extinction values and important population densities. These mathematical models are primarily used to study extinction thresholds because of the difficulty in understanding extinction processes through empirical methods and the current lack of research on this subject.Deredec, A. and Courchamp, F, 2003:Extinction Thresholds in Host-Parasite Dynamics, Ann. Zool. Fennic. 40:115-130. When determining an extinction threshold there are two types of models that can be used: deterministic and stochastic metapopulation models. === Deterministic === Deterministic metapopulation models assume that there are an infinite number of habitat patches available and predict that the metapopulation will go extinct only if the threshold is not met. dp/dt = chp (1-p)-ep Where p= occupied patches, e= extinction rate, c= colonization rate, and h= amount of habitat. A species will persist only if h> δ where δ=e/c δ= species parameter, or how successful a species is in colonizing a patch. === Stochastic === Stochastic metapopulation models take into account stochasticity, which is the non-deterministic or random processes in nature. With this approach a metapopulation may be above the threshold if determined that it is unlikely it will go extinct within a certain time period. The complex nature of these models can result in a small metapopulation that is considered to be above the deterministic extinction threshold, but in reality has a high risk of extinction. == Other factors == When using metapopulation- type models to predict extinction thresholds there are a number of factors that can affect the results of a model. First, including more complicated models, rather than relying solely on the Levins model produces different dynamics. For example, in an article published in 2004, Otso Ovaskainen and Ilkka Hanski explained with an empirical example that when factors such as Allee effect or Rescue effect were included in modeling the extinction threshold, there were unexpected extinctions in a high number of species. A more complex model came up with different results, and in practicing conservation biology this can add more confusion to efforts to save a species from the extinction threshold. Transient dynamics, which are effects on the extinction threshold because of instability in either the metapopulation or environmental conditions, is also a large player in modeling results. Landscapes that have recently endured habitat loss and fragmentation may be less able to sustain a metapopulation than previously understood without considering transient dynamics. Finally, environmental stochasticity, which may be spatially correlated, can lead to amplified regional stochastic fluctuations and therefore greatly affect the extinction risk. ==Related pages== * Population genetics * Endangered species * Wildlife conservation == References == ==Other websites== *Anne Deredec & Franck Courchamp, \"Extinction thresholds in host–parasite dynamics\" *\"Extinction Thresholds and Metapopulation Persistence in Dynamic Landscapes\" Threshold",
 "title": "Extinction threshold"
}