{
 "id": "1121806",
 "text": "The Santander poison frog (Andinobates virolinensis) is a frog. It lives in Panama and Colombia. ==Body== The adult frog is 14.6-18.9 mm long from nose to rear end. The front of the frog's body is deep red and the back of the body is brown. The color red slowly changes to the color brown on the frog's body. The eardrum is brown in color. The tops of the front and back legs are brown in color. ==Name== Scientists gave this frog the English name Santander because that was where they first saw it: Santander on the Cordillera Occidental. ==Home== This frog lives on the ground in cloud forests. It lives in forests that have never been cut down and in forests that have been cut down and are growing back. People also see this frog on farms. People have seen this frog between 1300 and 2400 meters above sea level. Scientists have seen adult frogs in the same bromeliad plant, so they think the adults do not fight each other for good places to find food and have young. ==Young== The female frog lays eggs on dead leaves on the ground. When the eggs hatch, the male frog carries the tadpoles on his back. He takes them to water in the leaves of bromeliad plants. Scientists have seen tadpoles swimming in the water in bromeliad plants. The tadpoles are red in color on top and cream-white on the belly. ==Danger== Habitat fragmentation and loss is the main threat, which is primarily taking place due to agricultural expansion but also from logging. This species was previously reported to have been threatened by international pet trade, however this was an error and there is no evidence to suggest that this is a problem Scientists say this frog is in some danger of dying out because human beings change the places where it lives to make farms and towns and get wood to build with. People do not catch this frog to sell as a pet, even though people do catch other frogs in Acidinobates. Some of the places this frog lives are protected parks: Santuario de Fauna y Flora Guanentá-alto Río Fonce, Reserva Natural Reinita Cielo Azul, and Parque Nacional Natural Serranía de los Yariguies. ==References== Category:Frogs of South America",
 "title": "Andinobates virolinensis"
}