{
 "id": "1122604",
 "text": "Vladimir Vladimirovich Mayakovsky (; – 14 April 1930) was a Soviet Russian poet, playwright, artist, and actor. Before the Russian Revolution until 1917, Mayakovsky became an important part of the Russian Futurist movement. He signed the Futurist manifesto, A Slap in the Face of Public Taste (1913). He wrote poems. His famous poems are \"A Cloud in Trousers\" (1915) and \"Backbone Flute\" (1916). Mayakovsky made many works in his career. He wrote many poems, wrote and directed plays, was in many movies, edited the art journal LEF, and made agitprop posters for the Communist Party during the Russian Civil War. Mayakovsky's work showed that he supported the Bolsheviks and supported Vladimir Lenin. However, he often had issues with the Soviet state. Mayakovsky did not like their cultural censorship and Socialist realism. He made some works that satirized or attacked the Soviet Union. These included the poem \"Talking With the Taxman About Poetry\" (1926), and the plays The Bedbug (1929) and The Bathhouse (1929). The Soviet state did not like this. In 1930, Mayakovsky killed himself. After his death, Joseph Stalin said that Mayakovsky was one of the most important poets in the Soviet Union. ==Famous works== ===Poems=== *A Cloud in Trousers (, 1915) *Backbone Flute (, 1915) *The War and the World (, 1917) *The Man (, 1918) *150 000 000 (1921) *About That (, Pro eto, 1923) *Vladimir Ilyich Lenin (, 1924) *A Flying Proletarian (, 1925) *All Right! (, 1927) ====Poem cycles and collections==== *The Early Ones (, 1912–1924, 22 poems) *I (, 1914, 4 poems) *Satires. 1913–1927 (23 poems, including \"Take That!\", 1914) *The War (, 1914–1916, 8 poems) *Lyrics (, 1916, , 1916, 3 poems) *Revolution (, 1917–1928, 22 poems, including \"Ode to Revolution\", 1918; \"The Left March\", 1919) *Everyday Life (, 1921–1924, 11 poems, including \"On Rubbish\", 1921, \"Re Conferences\", 1922) *The Art of the Commune (, 1918–1923, 11 poems, including \"An Order to the Army of Arts\", 1918) *Agitpoems (, 1923, 6 poems, including \"The Mayakovsky Gallery\") *The West (, 1922–1925, 10 poems, including \"How Does the Democratic Republic Work?\", and the 8-poem Paris cycle) *The American Poems (, 1925–1926, 21 poems, including \"The Brooklyn Bridge\") *On Poetry (, 1926, 7 poems, including \"Talking with the Taxman About Poetry\", \"For Sergey Yesenin\") *The Satires. 1926 (, 1926. 14 poems) *Lyrics. 1918–1924 (. 12 poems, including \"I Love\", 1922) *Publicism (, 1926, 12 poems, including \"To Comrade Nette, a Steamboat and a Man\", 1926) *The Children's Room (, 1925–1929. 9 poems for children, including \"What Is Good and What Is Bad\") *Poems. 1927–1928 (56 poems, including \"Lenin With Us!\") *Satires. 1928 (. 1928, 9 poems) *Cultural Revolution (, 1927–1928, 20 poems, including \"Beer and Socialism\") *Agit…(, 1928, 44 poems, including \"'Yid'\") *Roads (, 1928, 11 poems) *The First of Five (, 1925, 26 poems) *Back and Forth (, 1928–1930, 19 poems, including \"The Poem of the Soviet Passport\") *Formidable Laughter (, 1922–1930; more than 100 poems, published posthumously, 1932–1936) *Poems, 1924–1930 (. 1924–1930, including \"A Letter to Comrade Kostrov on the Essence of Love\", 1929) *Whom Shall I Become? (, Kem byt'?, published posthumously 1931, poem for children, illustrated by N. A. Shifrin) ===Plays=== *Vladimir Mayakovsky (. Subtitled: Tragedy, 1914) *Mystery-Bouffe (, 1918) *The Bedbug (, 1929) *The Bathhouse (. 1930) *Moscow Burns. 1905 (. 1905, 1930) ===Essays and sketches=== *My Discovery of America (, 1926), in four parts *How to Make Verses (, 1926) === Movies === * Not Born for Money (Не для денег родившийся, 1918) * Fettered by Film (Закованная фильмой, 1918) * Lady and the Hooligan (Барышня и хулиган, 1918) === Translations === * Mayakovsky, Vladimir. The Bedbug and selected poetry. Ed. with introd. by Patricia Blake. Trans. by Max Hayward and George Reavey. New York: Meridian Books, 1960. Reprint: Indiana University Press, 1975. * Mayakovsky, Vladimir. Mayakovsky: Plays. Trans. Guy Daniels. (Northwestern University Press, Evanston, Il, 1995). . * Mayakovsky, Vladimir. For the voice (The British Library, London, 2000). * Mayakovsky, Vladimir (ed. Bengt Jangfeldt, trans. Julian Graffy). Love is the heart of everything : correspondence between Vladimir Mayakovsky and Lili Brik 1915–1930 (Polygon Books, Edinburgh, 1986). * Mayakovsky, Vladimir (comp. and trans. Herbert Marshall). Mayakovsky and his poetry (Current Book House, Bombay, 1955). * Mayakovsky, Vladimir. Selected works in three volumes (Raduga, Moscow, 1985). * Mayakovsky, Vladimir. Selected poetry. (Foreign Languages, Moscow, 1975). * Mayakovsky, Vladimir (ed. Bengt Jangfeldt and Nils Ake Nilsson). Vladimir Majakovsky: Memoirs and essays (Almqvist & Wiksell Int., Stockholm 1975). === Books === * Aizlewood, Robin. Verse form and meaning in the poetry of Vladimir Maiakovsky: Tragediia, Oblako v shtanakh, Fleita-pozvonochnik, Chelovek, Liubliu, Pro eto (Modern Humanities Research Association, London, 1989). * Brown, E. J. Mayakovsky: a poet in the revolution (Princeton Univ. Press, 1973). * Charters, Ann & Samuel. I love : the story of Vladimir Mayakovsky and Lili Brik (Farrar Straus Giroux, NY, 1979). * Humesky, Assya. Majakovskiy and his neologisms (Rausen Publishers, NY, 1964). * Jangfeldt, Bengt. Majakovsky and futurism 1917–1921 (Almqvist & Wiksell International, Stockholm, 1976). * Lavrin, Janko. From Pushkin to Mayakovsky, a study in the evolution of a literature. (Sylvan Press, London, 1948). * Novatorskoe iskusstvo Vladimira Maiakovskogo (trans. Alex Miller). Vladimir Mayakovsky: Innovator (Progress Publishers, Moscow, 1976). * Noyes, George Rapall (ed.). Masterpieces of the Russian drama. Vol. 2 (Dover Pub., NY, 1961 [1933]). * Nyka-Niliūnas, Alfonsas. Keturi vėjai ir keturvėjinikai (The Four Winds literary movement and its members), Aidai, 1949, No. 24. * Rougle, Charles. Three Russians consider America : America in the works of Maksim Gorkij, Aleksandr Blok, and Vladimir Majakovsky (Almqvist & Wiksell International, Stockholm, 1976). * Shklovskii, Viktor Borisovich. (ed. and trans. Lily Feiler). Mayakovsky and his circle (Dodd, Mead, NY, 1972). * Stapanian, Juliette. Mayakovsky's cubo-futurist vision (Rice University Press, 1986). * Terras, Victor. Vladimir Mayakovsky (Twayne, Boston, 1983). * Vallejo, César (trans. Richard Schaaf) The Mayakovsky case (Curbstone Press, Willimantic, CT, 1982). * Volk, Craig, \"Mayakovsky Takes The Stage\" (full-length stage drama), 2006 and \"At The Top Of My Voice\" (feature-length screenplay), 2002. * Wachtel, Michael. The development of Russian verse : meter and its meanings (Cambridge University Press, 1998). ==References== ==Other websites== * * * Vladimir Mayakovsky Archive at marxists.org * English translations of three early poems * English translation of two poems, \"So This is How I Turned Into a Dog” and “Hey!” * English translation of “To His Beloved Self….” * Rhymed English translation of \"Backbone Flute\" * Includes English translations of two poems, 127–128 * A recording of Mayakovsky reading \"An Extraordinary Adventure...\" in Russian, English translation provided * \"A Show-Trial,\" an excerpt from Mayakovsky: A Biography by Bengt Jangfeldt, 2014. * Isaac Deutscher, The Poet and the Revolution, 1943. * Chapter on Russian Futurists incl Mayakovsky in Trotsky's Literature and Revolution * The 'raging bull' of Russian poetry article by Dalia Karpel at Haaretz.com, 5 July 2007 * * The State Museum of V.V. Mayakovsky at Google Cultural Institute * * The Motherland will Notice her Terrible Mistake: Paradox of Futurism in Jasienski, Mayakovsky and Shklovsky Category:1893 births Category:1930 deaths Category:Atheists Category:Russian atheists Category:Movie directors from Georgia (country) Category:Writers from Georgia (country) Category:Soviet writers Category:20th-century poets Category:Silent movie actors Category:Russian painters Category:20th-century painters Category:Russian playwrights Category:Futurists Category:Marxists Category:Russian stage actors Category:Suicides by firearm Category:People from the Russian Empire",
 "title": "Vladimir Mayakovsky"
}