{
 "id": "1122518",
 "text": "Here is a list of P. Ramlee's films. He worked on 69 films and 4 television shows. ==Film== Original title English title Release year Also credited as Also credited as Also credited as Also credited as Role Notes Original title English title Release year Actor Director Writer Composer Role Notes Chinta Love 1948 Putar First film debut Noor Asmara Noor Love 1949 Musician Nasib Fate 1949 Baki Nilam Nilam 1949 Rashid Aloha Aloha 1950 Banjo Rachun Dunia Poison of the World 1950 Harun Bakti Faithfulness 1950 Nasir Takdir Ilahi God's Destiny 1950 Dato Muda Arshad Penghidupan Livelihood 1951 Salim Sejoli Lovebird 1951 Leftenan Jamil Juwita Juwita 1951 Ramlee Antara Senyum Dan Tangis Between Smiles and Tears 1952 Abidin Anjoran Nasib Fate's Hand 1952 Bahar Patah Hati Broken Hearted 1952 Kasim Sedarah Incest 1952 Harun Miskin The Poor 1952 Kamil Putus Harapan Losing Hope 1953 Yusof Ibu Mother 1953 Raimy Hujan Panas Rain Shower 1953 Amir Siapa Salah? Who's Guilty? 1953 Jamil Panggilan Pulau Island's Calling 1954 Zulkifli Merana Languish 1954 Amir Perjodohan Matchmaking 1954 Rashid Abu Hassan Penchuri Abu Hassan the Thief 1955 Abu Hassan Penarek Becha The Trishaw Man 1955 Amran First directorial film Hang Tuah The Legend of Hang Tuah 1956 Hang Tuah Semerah Padi Red Rice 1956 Aduka Anak-ku Sazali My Son, Sazali 1956 Hassan & Sazali Pancha Delima Pancha Delima 1957 Poet's Voice Bujang Lapok Three Over-age Bachelors 1957 Ramli Sumpah Orang Minyak Curse of the Oil Man 1958 Si Bongkok Sarjan Hassan Sergeant Hassan 1958 Sgt. Hassan Pendekar Bujang Lapok The Three Over-age Bachelor Warriors 1959 Ramli bin Puteh (Ramli) Musang Berjanggut The Bearded Fox 1959 Tun Nila Utama, aka Raja Muda Pura Cendana Nujum Pak Belalang Pak Belalang the Fortune Teller 1959 Pak Belalang Antara Dua Darjat Between Two Classes 1960 Ghazali Sumpah Wanita Women's Oath 1960 Seniman Bujang Lapok The Nitwit Movie Stars 1961 Ramli Ali Baba Bujang Lapok Ali Baba in Burlesque 1961 Ketua Penyamun (Leader of the Thieves) Singapura Dilanggar Todak Singapore Was Hit by a Sword 1961 Ibu Mertuaku My Mother in Law 1962 Kassim bin Osman Selamat @ Osman Jailani Gerhana Eclipse 1962 Labu dan Labi Labu and Labi 1962 Labi 花團錦簇 Love Parade 1963 Himself (guest singer) Hong Kong movie Nasib Si Labu Labi The Fate of Labu and Labi 1963 Labi Madu Tiga Three Wives 1964 Jamil Melanchong Ke Tokyo Travelling to Tokyo 1964 Himself (Invitation Singer) Tiga Abdul The Three Abduls 1964 Abdul Wahub, the youngest son Sitora Harimau Jadian Sitora the Man-Tiger 1964 Dr. Affendi Ragam P. Ramlee The Antics of P. Ramlee 1964 Singer/ Ramlee & Damaq Masam Masam Manis Sourness and Sweetness 1965 Teacher Shaari Suleiman Dajal Suchi Devotion 1965 Himself (invitation singer) Sabarudin Tukang Kasut Sabaruddin the Cobbler 1966 Sabarudin Do Re Mi Do Re Mi 1966 Do (Masdo) Nasib Do Re Mi The Fate of Do Re Mi 1966 Do Sesudah Suboh After Dawn 1967 Ariffin Mahmud Keluarga 69 Family 69 1967 Osman Bakar Ahmad Albab Ahmad Albab 1968 Syawal Anak Bapak Like Father Like Son 1968 Che' Harun Gerimis Drizzle 1968 Kamal Bukan Salah Ibu Mengandung Not the Fault of the Mother Who Became Pregnant 1969 Dad Murad Enam Jahanam Six Plunderers 1969 Tantari Kanchan Tirana Kanchan Tirana 1969 Pendekar Silat Doktor Rushdi Doctor Rushdi 1970 Dr. Rushdi Di Belakang Tabir Behind the Curtain 1970 ASP Azman Gelora Storm 1970 Rozaimi (Remy) Jangan Tinggal Daku Don't Leave Me 1971 Dato' Mahmud Putus Sudah Kaseh Sayang Love Is Gone 1971 Rostam Laksamana Do Re Mi Warriors Do Re Mi 1972 Do The final acting and directing last film ==Television== Year Title Role TV channel Notes 1970 Intan Jamal TV1 1972 Ranjau Selamat 1972 Bakat TV RTM Himself (jury) 2010 Biography: P. Ramlee Himself History Documentary ==References== Category:Malaysian movies",
 "title": "P. Ramlee filmography"
}