{
 "id": "1122867",
 "text": "David Charles Rothenberg ( (aged 42).), was a French-born American film actor, comedian, conceptual artist, host, and severe burn survivor. ==Early life== He was born in the town of Yssingeaux, in France, to parents Marie and Charles Rothenberg. His mother divorced his father, and had a boyfriend. David continued to regularly see his father, despite very tense problems and arguments between his father and mother after their divorce. ==Personal life== When he was just and only six (6) years old, in early March of 1983, once when David stayed over with his father at a motel, presumably as a result of those tense problems, with his spouse (wife) Marie, in order to get back at her, and retaliate on her and get revenge, after a very harsh argument over the telephone with his wife (spouse), his father got up, poured gasoline all over his son, and set his body on fire, before fleeing, leaving David alone to be burned and to die. Despite his wounds, and third degree burns, covering more than 90% of his entire body, resulting in some of his skin falling out from his body and parts of his body being amputated, such as his fingers and toes, David had miraculously survived, and was able to move, talk, and walk, and with being given proper care, he was able to thrive, live, and survive. ==Prison== Charles and his father was caught by the police, and was arrested and detained in a prison cell. He was given a harsh sentence for his crime. During an interview with the police, Charles did stated that he wanted to commit suicide and kill himself, but ultimately did not. In July of 1983, he was given 25 years to life in prison, and his child (his son) David did ultimately ended up visiting his father in prison in 1996. After he recovered from those wounds that his father gave to him, David did became a film actor, a comedian, and a conceptual artist, and did have a remarkable career, and was quite popular and famous. ==Death== Presumably, becuase of his severe wounds, from the past, David ultimately did in fact actually died from complications of pnuemonia, in Sunrise Hospital, in the city of Las Vegas, Nevada, United States (U.S.)., on , aged just and only 42 years old, at the time of his death. Category:1976 births Category:2018 deaths Category:French people Category:American actors Category:American comedians",
 "title": "David Rothenberg"
}