{
 "id": "1122376",
 "text": "== List == President Portrait Tenure Political affiliation Took office Left office 1 Léon M'ba 1960 1967 BDG 2 Daniel Mbene Briefly interrupted during the 11–18 February 1964 coup d'état Revolutionary Committee. 3 Valere Essone 4 Jacques Mambo 5 Daniel Mbo Edou 6 Jean-Hilaire Aubame 17 February 1964 18 February 1964 Gabonese Democratic Party 7 Léon M'ba 18 February 1964 27 November 1967 Gabonese Democratic Party 8 Omar Bongo Ondimba 1967 2009 BDG / PDG 9 Didjob Divungi Di Ndinge 2009 2009 ADERE 10 Rose Francine Rogombé 2009 2009 PDG 11 Ali Bongo Ondimba 16 October 2009 15 November 2018 Gabonese Democratic Party 12 Pierre Claver Maganga Moussavou 15 November 2018 14 January 2019 Gabonese Democratic Party 13 Ali Bongo Ondimba 14 January 2019 17 January 2019 Gabonese Democratic Party 14 Pierre Claver Maganga Moussavou 17 January 2019 25 February 2019 Gabonese Democratic Party 15 Ali Bongo Ondimba 30 August 2023 PDG 16 Rose Christiane Raponda 30 August 2023 30 August 2023 PDG 17 Alain Claude Bilie By Nze 30 August 2023 30 August 2023 PDG 18 Lucie Milebou Aubusson 30 August 2023 30 August 2023 PDG 19 Brice Oligui 2023 Incumbent Military ==List== Portrait Name Term of office Political affiliation President(s) Took office Left office Time in office 1 Léon M'ba 1960 1961 BDG Himself Post abolished (21 February 1961 – 16 April 1975) 2 Léon Mébiame 1975 1990 PDG O. Bongo Ondimba 3 Casimir Oyé-Mba 1990 1994 Independent O. Bongo Ondimba 4 Paulin Obame-Nguema 1994 1999 PDG O. Bongo Ondimba 5 Jean-François Ntoutoume Emane 1999 2006 PDG O. Bongo Ondimba 6 Jean Eyeghé Ndong 2006 2009 PDG O. Bongo Ondimba Divungi Di Ndinge Rogombé 7 Paul Biyoghé Mba 2009 2012 PDG Rogombé A. Bongo Ondimba 8 Raymond Ndong Sima 2012 2014 PDG A. Bongo Ondimba 9 Daniel Ona Ondo 2014 2016 PDG A. Bongo Ondimba 10 Emmanuel Issoze-Ngondet 2016 2019 PDG A. Bongo Ondimba 11 Julien Nkoghe Bekale 2019 2020 PDG A. Bongo Ondimba 12 Rose Christiane Ossouka Raponda 2020 2023 PDG A. Bongo Ondimba 13 Alain Claude Nze 2023 2023 (deposed) PDG A. Bongo Ondimba Vacant (30 August 2023 – 7 September 2023) (8) Raymond Ndong Sima 2023 Incumbent PDG Brice Oligui Gabon Gabon Category:Lists of African politicians",
 "title": "List of heads of State of Gabon"
}