{
 "id": "1122896",
 "text": "Prophet Saleh is a significant figure in Islamic tradition, known for his prophethood to the people of Thamud. His story is mentioned several times in the Quran, highlighting the themes of faith, disobedience, and divine retribution. Here is a detailed account of his story: The People of Samad The people of samad were an ancient Arabian tribe that succeeded the people of ‘Ad. They were known for their engineering prowess, carving homes out of mountains and creating a thriving civilization. Despite their advancements, they, too, turned to idol worship and disobedience to God. Saleh’s Prophethood God chose Saleh, a member of the samud tribe, as a prophet to guide his people back to monotheism. Saleh was respected and well-known among his people, which gave him the credibility to call them to the worship of the One True God. Saleh’s Message Prophet Saleh’s message to the samud was to abandon their idols and worship God alone. He reminded them of God’s blessings and warned them against arrogance and ingratitude. Saleh also urged them to follow the path of righteousness and obedience to God’s commands. The Quran narrates Saleh’s plea to his people in several verses, including Surah Hud (11:61-62): “And to Thamud [We sent] their brother Saleh. He said, ‘O my people, worship Allah; you have no deity other than Him. He has produced you from the earth and settled you in it, so ask forgiveness of Him and then repent to Him. Indeed, my Lord is near and responsive.’ They said, ‘O Saleh, you were among us a man of promise before this. Do you forbid us to worship what our forefathers worshipped? And indeed we are about that to which you invite us in disquieting doubt.’” (Quran 11:61-62) The She-Camel and the Sign To prove his prophethood, Saleh was given a miraculous sign by God—a she-camel that emerged from a rock. This she-camel was a test for the Thamud, as they were instructed to allow her to graze freely and to drink from their water source on specific days. The Disobedience and the Plot Despite the clear sign and Saleh’s warnings, the majority of the Thamud tribe disbelieved and plotted against the she-camel. They hamstrung and killed her, thereby defying God’s command and sealing their fate. The Punishment As a result of their persistent disobedience and the killing of the she-camel, God sent a severe punishment upon the Thamud. A devastating earthquake struck them, followed by a thunderous blast, annihilating the entire tribe except for Saleh and the few believers who followed him. The Quran describes their punishment in Surah Al-A’raf (7:77-78): “So they hamstrung the she-camel and were insolent toward the command of their Lord and said, ‘O Saleh, bring us what you promise us, if you should be of the messengers.’ So the earthquake seized them, and they became within their home [corpses] fallen prone.” (Quran 7:77-78) Legacy of Saleh Prophet Saleh’s story serves as a powerful reminder of the consequences of arrogance, disbelief, and defiance against God’s commands. It emphasizes the importance of faith, obedience, and humility. Saleh’s perseverance and dedication in delivering God’s message, despite facing immense opposition, highlight the qualities of true prophethood. References: 1\\. The Quran, Surah Hud (11:61-62). 2\\. The Quran, Surah Al-A’raf (7:77-78). 3\\. The Quran, Surah Ash-Shu’ara (26:141-159) - Additional context on the people of Thamud and Prophet Saleh’s message. 4\\. The Quran, Surah Al-Qamar (54:23-31) - Further details on the punishment of the Thamud. Category:Quranic figures",
 "title": "Saleh"
}