{
 "id": "1122893",
 "text": "The story of Ishmael (Isma’il in Arabic) holds significant importance in Islamic tradition. Ishmael is considered a prophet and an ancestor of the Prophet Muhammad. Here is an outline of his story as presented in Islamic sources: Birth of Ishmael Ishmael was the son of Prophet Abraham (Ibrahim) and Hagar (Hajar). According to Islamic tradition, Sarah, Abraham’s wife, was initially barren, and she offered her Egyptian maidservant Hagar to Abraham to bear a child. Hagar conceived and bore Ishmael. Hagar and Ishmael in the Desert Following Ishmael’s birth, Sarah became jealous and requested Abraham to take Hagar and Ishmael away. Abraham, following God’s command, took Hagar and Ishmael to the desert valley of Mecca (then a barren land). He left them with some provisions and prayed for their sustenance. The Miracle of Zamzam When the provisions ran out, Hagar desperately searched for water. She ran between the hills of Safa and Marwah seven times in her quest. God responded to her distress by sending the angel Gabriel (Jibril), who struck the ground, causing the Zamzam well to spring forth. This well provided them with water, attracting tribes to settle in the area, making Mecca a thriving community. Ishmael’s Role in the Construction of the Kaaba Years later, Abraham returned to visit Ishmael. Together, they built the Kaaba, the sacred house in Mecca, as a center for monotheistic worship. During the construction, they prayed for the acceptance of their efforts and for their descendants to be a community that submits to God’s will. The Sacrifice of Ishmael One of the most significant aspects of Ishmael’s story is the test of sacrifice. God commanded Abraham in a dream to sacrifice his beloved son, Ishmael. When Abraham revealed the dream to Ishmael, he willingly agreed to comply with God’s command. However, as Abraham was about to sacrifice Ishmael, God intervened and provided a ram to be sacrificed instead, acknowledging Abraham’s faith and submission. This event is commemorated annually during the Islamic festival of Eid al-Adha, where Muslims worldwide perform the ritual sacrifice of an animal. Ishmael’s Prophetic Legacy Ishmael is considered a prophet in Islam, and his descendants, including the Prophet Muhammad, are believed to have carried forth the message of monotheism. Ishmael’s story emphasizes themes of faith, obedience, and God’s mercy and provisions. The Quran mentions Ishmael several times, highlighting his righteousness and his role in continuing the monotheistic tradition of his father, Abraham. Category:Islamic theology",
 "title": "Ishmael in Islam"
}