{
 "id": "1122514",
 "text": "Natasha Louise Baker (born 30 December 1989) is an English para-equestrian. She won six gold, two silver and two bronze medals at the Paralympic Games. == Early life == Natasha Baker was born on 30 December 1989 in Hammersmith, London, England. When she was 14 months old, she got transverse myelitis, a rare condition. Because of that, she has nerve damage and she cannot feel her legs. Baker started to ride horses when she was a child. She wanted to go to the Paralympic Games since 10, when she watched the 2000 Summer Paralympics on TV. Baker cannot use her legs, so she uses her voice to tell her horses what to do. == Career == === Dressage rider === Baker and , her 11-year-old male horse, went to the 2012 Summer Paralympics in London, her home city. There, they won two gold medals. They also went to the 2016 Summer Paralympics in Rio de Janeiro, where they won three gold medals. However, on 26 February 2017, Cabral died of bacterial infection. Baker and Keystone Dawn Chorus (\"Lottie\"), her new mare (female horse), went to the 2020 Summer Paralympics in Tokyo and they won a gold and two silver medals. They also went to the 2024 Summer Paralympics in Paris and they won two bronze medals. === Sports commentator === Baker is also a sports commentator. In 2017, she commentated with Rupert Bell on para-dressage grade III at the European Dressage Championships in Gothenburg. She commentated on dressage competitions again in 2018 and in 2019. == Personal life == Baker got married in June 2022. She has a child. == Related pages == * Lee Pearson – another English para-equestrian * Sophie Wells – another English para-equestrian == References == == Other websites == * * Category:1989 births Category:British dressage riders Category:English equestrians Category:English sports commentators Category:Living people Category:Officers of the Order of the British Empire Category:Paralympic bronze medalists for Great Britain Category:Paralympic equestrians for Great Britain Category:Paralympic gold medalists for Great Britain Category:Paralympic silver medalists for Great Britain Category:People from Hammersmith Category:Sportspeople from London",
 "title": "Natasha Baker"
}