{
 "id": "1122643",
 "text": "The Roman Catholic Archdiocese of Gniezno () is one of the oldest dioceses in Poland, with a history dating back to the year 1000. It is located in central- western Poland and is the primary see of the Primate of Poland. == History == The Archdiocese of Gniezno was established in 1000 during the Congress of Gniezno, when Pope Sylvester II and Emperor Otto III agreed to create an independent Polish ecclesiastical province. The first archbishop was Saint Adalbert, whose relics are housed in the Gniezno Cathedral. Over the centuries, Gniezno played a crucial role in the Christianization of Poland and the consolidation of the Polish state. During the medieval period, the archdiocese was one of the most important religious centers in Poland. It was the site of several synods. In 1412, the Gniezno archbishops were granted the title of Primate of Poland, making them the highest-ranking church officials in the country. == Gniezno Cathedral == The Gniezno Cathedral, officially the Basilica of the Assumption of the Blessed Virgin Mary and St. Adalbert, is one of the most important churches in Poland. It is located on the Gniezno hill. The cathedral has been the site of numerous coronations of Polish kings and is the final resting place of Saint Adalbert. The cathedral's history dates back to the early 11th century. The current Gothic structure was largely built in the 14th and 15th centuries. Inside, the cathedral houses numerous artworks, including a silver reliquary of Saint Adalbert, which is one of the most important treasures of the Polish Church. == Demographics == As of 2017, the archdiocese serves a population of approximately 639,000 Catholics. The archdiocese is divided into 264 parishes. == Leadership == The current archbishop of Gniezno is Wojciech Polak, who also holds the title of Primate of Poland. Archbishop Polak was appointed in 2014. The archdiocese is part of the ecclesiastical province of Gniezno, which also includes several suffragan diocese. == References == == Other websites == * Official website of the Archdiocese of Gniezno Category:Catholic dioceses in Poland Category:Greater Poland Voivodeship",
 "title": "Archdiocese of Gniezno"
}