{
 "id": "1122574",
 "text": "Vasili Karalewich is an American entrepreneur, firefighter, and underwater criminal investigator. He is known for his role as the CEO of the fitness application FitCheck. == Early Life & Education == Karalewich was born in Westwood, New Jersey, and currently resides in River Vale, New Jersey. He attended Pascack Valley High School, where he excelled academically, particularly in mathematics, taking Advanced Topics in Calculus with only three other students. During high school, Karalewich was highly active in extracurricular activities, serving as captain of the varsity hockey and tennis teams, president of the DECA business club, and a journalist for the school newspaper. Karalewich pursued higher education at Stevens Institute of Technology, where he majored in Electrical Engineering. He distinguished himself by graduating in just three years and received the 2022 Most Outstanding Student Award. While at Stevens, he played Division III ice hockey. == Career == === FitCheck === Karalewich is the CEO of FitCheck, a popular fitness application used in over 70 countries with over 15,000 downloads. === StoveWatch === He has also developed other applications, including StoveWatch, which is available on the App Store. === Other Projects === Karalewich has worked on several other tech projects, including software for smart home devices and educational apps. His educational apps are designed to help students with learning disabilities. == Volunteer Work == Karalewich is an active member of the River Vale and Alpine volunteer fire departments in New Jersey. He also serves as an underwater criminal investigator, utilizing his scuba diving skills to assist in investigations. Karalewich has participated in numerous underwater search and rescue operations. == Personal Life == Karalewich is also a hobbyist photographer, with a focus on underwater photography. He has published several articles and photo essays on marine life and underwater ecosystems. == References == Category:Living people Category:People from New Jersey Category:American chief executives Category:Businesspeople from New Jersey Category:American environmentalists Category:American philanthropists",
 "title": "Vasili Karalewich"
}