{
 "id": "1122717",
 "text": "Laurence Sterne (24 November 1713 – 18 March 1768) was an Anglo-Irish novelist and Anglican cleric. He wrote the novels The Life and Opinions of Tristram Shandy, Gentleman and A Sentimental Journey Through France and Italy. He also published many sermons and memoirs. Many people in his family were in the military. Because of this, he traveled in Ireland and England. One of his uncles paid for Sterne to go to the Hipperholme Grammar School in the West Riding of Yorkshire. He went to Jesus College, Cambridge on a sizarship. In that college, he got bachelor's and master's degrees. In 1741, he married Elizabeth Lumley. His satire A Political Romance made the church angry. The book was burnt. Sterne had tuberculosis, so he moved to France. He wrote about his travels to France in A Sentimental Journey Through France and Italy. This book was published a few weeks before he died. He also wrote Journal to Eliza, which was about his romantic feelings for Eliza Draper. This was published after he died. Sterne died in 1768 and was buried at St George's, Hanover Square. His body was stolen and sold to anatomists at Cambridge University. His body was then found and brought back. ==Books== *1743 – The Unknown World: Verses Occasioned by Hearing a Pass-Bell (disputed, possibly written by Hubert Stogdon) *1747 – The Case of Elijah and the Widow of Zerephath *1750 – The Abuses of Conscience *1759 – A Political Romance *1759 – Tristram Shandy vols. 1 and 2 *1760 – The Sermons of Mr. Yorick vol. 1 and 2 *1761 – Tristram Shandy vols. 3–6 *1765 – Tristram Shandy vols. 7 and 8 *1766 – The Sermons of Mr. Yorick vols. 3 and 4 *1767 – Tristram Shandy vol. 9 *1768 – A Sentimental Journey through France and Italy *1769 – Sermons by the Late Rev. Mr. Sterne vols. 5–7 (a continuation of The Sermons of Mr. Yorick) ==Citations== ==References== * * * * * * * * * * * * * * * * * * * * * * * * ==Further reading== *René Bosch, Labyrinth of Digressions: Tristram Shandy as Perceived and Influenced by Sterne's Early Imitators (Amsterdam, 2007) *W. M. Thackeray, in English Humourists of the Eighteenth Century (London, 1853; new edition, New York, 1911) *Percy Fitzgerald, Life of Laurence Sterne (London, 1864; second edition, London, 1896) *Paul Stapfer, Laurence Sterne, sa personne et ses ouvrages (second edition, Paris, 1882) *H. D. Traill, Laurence Sterne, \"English Men of Letters\", (London, 1882) * *Texte, Rousseau et le cosmopolitisme littôraire au XVIIIème siècle (Paris, 1895) *H. W. Thayer, Laurence Sterne in Germany (New York, 1905) *P. E. More, Shelburne Essays (third series, New York, 1905) *L. S. Benjamin, Life and Letters (two volumes, 1912) * Rousseau, George S. (2004). Nervous Acts: Essays on Literature, Culture and Sensibility. Basingstoke: Palgrave Macmillan. ==Other websites== * * * *Tristram Shandy (beta) In Our Time – BBC Radio 4 *Laurence Sterne at the Google Books Search * *\"Tristram Shandy\". Annotated, with bibliography, criticism. *Ron Schuler's Parlour Tricks: The Scrapbook Mind of Laurence Sterne *The Life and Opinions of Tristram Shandy & A Sentimental Journey. Munich: Edited by Günter Jürgensmeier, 2005 *The Shandean: A Journal Devoted to the Works of Laurence Sterne (tables of contents available online) *Laurence Sterne at the National Portrait Gallery, London *The Laurence Sterne Trust * *Anonymous parodies of the kinds of letters written by Elizabeth Draper to Laurence Sterne (as Yorick), MSS SC 4, L. Tom Perry Special Collections, Harold B. Lee Library, Brigham Young University Category:1713 births Category:1768 deaths Category:18th-century English writers Category:Irish writers Category:Deaths from tuberculosis Category:Christian clergy Category:Irish novelists Category:18th-century novelists Category:English novelists Category:Memoirists Category:Christian writers Category:Satirists Category:Priests Category:People from the Republic of Ireland",
 "title": "Laurence Sterne"
}