{
 "id": "1122938",
 "text": "Andinobates daleswansoni is a frog. It lives in Colombia. ==Body== The adult male frog is 17.83-18.46 mm long from nose to rear end and the adult female frog is 19.01-19.74 mm long. This frog has big eyes. This frog's eardrum is oval-shaped, not circle-shaped. There are disks on the toes for climbing, but the disks on the back feet are smaller than the disks on the front feet. The front of the frog's head and body is bright red. The rest of the body is brown, with darker and lighter brown marks. Some frogs have yellow-orange marks on the back of the body and back legs. The iris of the eye is black in color. This frog has only four toes on each foot. The first toe and the second toe grow together until they look almost like one toe. Almost no other frogs have feet like this. ==Name== Scientists named this frog after Dale Swanson, a person from Spokane, Washington. Swanson worked to protect plants and animals in the Andes Mountains for many years. ==Home== This frog lives in the smaller plants under the trees in cloud forests. It can live in forests that have never been cut down and in forests that have been cut down if they have enough holes and other places on the ground for the frogs to hide in. It can live in places where people have cut down some trees if there is old forest near. People have seen this frog between 1800 and 2500 meters above sea level. This frog lives in the same place as Andinobates opisthomelas near 1800 meters above sea level. Scientists know which frog is which because A. opisthomelas is red-orange in color with no marks. ==Young== The female frog lays eggs on dead leaves on the ground. The tadpoles swim in water in the leaves of bromeliad plants. People have seen the tadpoles in water all year. ==Danger== Scientists say this frog is in danger of dying out because human beings cut down forests to make farms and places for cows to eat grass. One of the places this frog lives is a protected park: Selva de Florencia National Park. ==References== Category:Frogs of South America",
 "title": "Andinobates daleswansoni"
}