{
 "id": "1122897",
 "text": "Prophet Muhammad is the final prophet in Islam, known as the \"Seal of the Prophets.\" He is regarded as the messenger of God, who delivered the final and complete revelation of God's guidance to humanity, which is encapsulated in the Quran. Here is a detailed account of his life and significance in Islam: == Life == === Early Life === Muhammad was born in 570 CE in Mecca, a city in present-day Saudi Arabia. He belonged to the Quraysh tribe, a respected and powerful tribe in Mecca. His father, Abdullah, died before his birth, and his mother, Amina, died when he was six years old. Muhammad was then raised by his grandfather, Abdul Muttalib, and later by his uncle, Abu Talib. === Early Adulthood === Muhammad was known for his honesty, integrity, and trustworthiness, earning him the nickname \"Al-Amin\" (the Trustworthy). He worked as a merchant and was employed by a wealthy widow named Khadijah. Impressed by his character, Khadijah proposed marriage to Muhammad, and they married when he was 25 years old. They had several children together, including Fatimah, who would later marry Ali, the fourth caliph of Islam. === The First Revelation === At the age of 40, while meditating in the cave of Hira near Mecca, Muhammad received his first revelation from God through the angel Gabriel (Jibril). This event marked the beginning of his prophethood. The first revealed verses were from Surah Al-Alaq (96:1-5): > \"Read in the name of your Lord who created—created man from a clot [of congealed blood]. Read, and your Lord is the Most Generous—who taught by the pen—taught man that which he knew not.\" (Quran 96:1-5) === The Meccan Period === Muhammad began preaching the message of monotheism, calling people to worship the one true God (Allah) and to abandon idolatry. His message emphasized social justice, equality, and compassion. Initially, he faced strong opposition from the Quraysh leaders, who saw his message as a threat to their social and economic status. Despite the persecution, Muhammad's followers grew, including notable early converts like Abu Bakr, Umar, Uthman, and Ali. The Muslims faced severe oppression, and many were forced to migrate to Abyssinia (modern-day Ethiopia) for refuge. === The Hijra and the Medinan Period === In 622 CE, Muhammad and his followers migrated from Mecca to Yathrib (later renamed Medina) in an event known as the Hijra. This migration marks the beginning of the Islamic calendar. In Medina, Muhammad established a Muslim community (ummah) based on Islamic principles. He acted as a religious, political, and military leader, forging alliances and ensuring the safety and unity of the Muslim community. === Key Battles and the Conquest of Mecca === The Muslims in Medina faced several battles with the Quraysh, including the Battle of Badr, the Battle of Uhud, and the Battle of the Trench. Despite setbacks, the Muslims eventually gained the upper hand. In 630 CE, Muhammad led a peaceful conquest of Mecca, where the idols in the Kaaba were destroyed, and the city was brought under Islamic rule. === Final Years and Death === After the conquest of Mecca, Islam spread rapidly across the Arabian Peninsula. Muhammad delivered his Farewell Sermon during his final pilgrimage to Mecca in 632 CE, emphasizing the importance of following the Quran and his teachings, the rights and duties of Muslims, and the principles of justice and equality. Shortly after returning to Medina, Muhammad fell ill and passed away at the age of 63. == Significance in Islam == Prophet Muhammad is considered the last and final prophet in Islam, completing the line of prophethood that includes figures like Adam, Noah, Abraham, Moses, and Jesus. His life and teachings, recorded in the Hadith (sayings and actions of the Prophet), serve as a model for Muslims to follow. The Quran, revealed to Muhammad over 23 years, is the central religious text of Islam and is regarded as the literal word of God. == The Five Pillars of Islam == Muhammad's teachings form the foundation of Islamic practice, encapsulated in the Five Pillars of Islam: 1\\. **Shahada** (Faith): The declaration of faith in the oneness of God and the prophethood of Muhammad. 2\\. **Salah** (Prayer): Performing the five daily prayers. 3\\. **Zakat** (Almsgiving): Giving to charity to benefit the poor and needy. 4\\. **Sawm** (Fasting): Observing the fast during the month of Ramadan. 5\\. **Hajj** (Pilgrimage): Performing the pilgrimage to Mecca at least once in a lifetime, if physically and financially able. == Legacy == Prophet Muhammad's legacy is profound and enduring. He is regarded as the exemplary human being, and his life serves as a guide for personal conduct, spirituality, and community leadership. His emphasis on justice, mercy, and the worship of one God continues to inspire over a billion Muslims worldwide. \\--- **References:** 1\\. The Quran, Surah Al-Alaq (96:1-5). 2\\. The Quran, Surah Al-Baqara (2:143). 3\\. The Quran, Surah Al-Hujurat (49:13). 4\\. The Hadith collections, including Sahih Bukhari and Sahih Muslim. 5\\. \"Muhammad: His Life Based on the Earliest Sources\" by Martin Lings. 6\\. \"In the Footsteps of the Prophet: Lessons from the Life of Muhammad\" by Tariq Ramadan. Category:Muhammad",
 "title": "Muhammad in Islam"
}