{
 "id": "1122566",
 "text": "María Gabriela Otaiza, who goes by the stage name Briella, is a Venezuelan singer, songwriter, and music producer. == Early years == Born on November 23, 1998 in Valencia, Carabobo, Venezuela . From an early age, Briella demonstrated a strong passion for music, taking part in multiple singing and composition competitions. In 2010, she started his career on social networks, standing out for his compositions and charisma. == Musical career == In 2021, Briella launched her debut official single, *\"Otra Vez,\"* which gained exposure through profile after Briella won a verse contest. Since then, he has worked tirelessly on his musical career, dabbling in genres such as reggaeton, urban pop, and R&B; . His dynamic and versatile style, combined with his skills in producing and composing his own music, has enabled him to attract a broad and diverse audience. In 2023, he released his debut studio album, *\"Al Mando,\"* which features 13 tracks. His music is known for its self-penned lyrics that explore themes of empowerment and personal experiences. === Controversy with Shakira === In January 2023, Briella attracted international media attention when she accused Shakira and Bizarrap of plagiarizing her song \"Sólo Tú\" in \" BZRP Music Session #53 \". Briella asserted that her song, released six months prior, featured notable similarities in both chorus and melody to the collaboration between Shakira and Bizarrap. Although Shakira did not address the controversy, it sparked significant discussion on social media and in the press. === Presence on Social Networks and Repercussion === Briella has made a huge impact on social media, especially on TikTok, where her songs and videos have gone viral. On Spotify, It has garnered thousands of views, showcasing his talent for engaging young audiences and broadening his impact on urban music. == Style and Influences == Briella's musical style is a fusion of urban and pop genres. His lyrics often reflect personal experiences and themes of love and heartbreak. His creative methods and talent for producing and writing his own music have enabled him to retain complete control over his career. Briella has skillfully combined his ethnic heritage with Western musical influences, a blend that has been crucial to his success. == Discography == === Studio albums === * \"Al mando\" (2023) * Codigo Rosa (2025) === Extended Plays === * \"La Última Noche\" (2021) == References == == Other websites == Category:Venezuelan composers Category:Venezuelan singers Category:Venezuelan artists Category:Venezuelan musicians Category:Musicians Category:Singers Category:1998 births",
 "title": "Briella"
}