{
 "id": "1123726",
 "text": "On 31 July 2024, Ismail Haniyeh, the political leader of Hamas, was assassinated after going to the inauguration ceremony for Iranian president Masoud Pezeshkian in Tehran, Iran. His personal bodyguard was also killed. ==Details== The cause of Haniyeh's death is under investigation by the Islamic Revolutionary Guard Corps. There was different reports about how Haniyeh was killed. Some Hamas officials are saying he was killed by a airstrike while others say he was killed by a bomb that was hidden in his guest house two months before his assassination. ==Funeral== thumb|200x200px| The funeral of Ismail Haniyeh. A funeral was held for Haniyeh at Tehran University on 1 August, with Iran's Supreme Leader Ali Khamenei leading prayers. Afterwards, the bodies of Haniyeh and his bodyguard were taken to Azadi Square. Haniyeh's remains will then be taken to Qatar to be buried in Doha. ==Aftermath== Iran's Supreme Leader Ali Khamenei ordered a direct attack on Israel in response to the assassination. Israeli Prime Minister Benjamin Netanyahu threatened that Israel will attack Iran should they attack first. A few hours after Haniyeh's death was announced, the al-Qassam Brigades claimed responsibility for a shooting and stabbing attack near Beit Einun, north of Hebron in the West Bank as a response to Haniyeh's assassination. == Reactions == In Palestine, President Mahmoud Abbas condemned the killing of Haniyeh calling it a \"cowardly act and a dangerous development.\" The Iranian supreme leader Ayatollah Khamenei condemned the killing of Haniyeh and vowed to avenge Haniyeh. The Turkish president Recep Tayyip Erdoğan condemned the killing of Haniyeh saying that the goal of the attack was to stop the Palestinian cause and said that Zionists will not be successful in their goal of doing so. The Deputy Minister of Afghanistan Zabihullah Mujahid called Haniyeh an \"intelligent and resourceful Muslim leader who made great sacrifices.\" He also said that it was the duty of all Muslims to defend Hamas and condemn Israel for its crimes. The Foreign Minister of China Lin Jian condemned the death of Haniyeh and said that they are \"deeply concerned that this incident may lead to further instability in the regional situation.\" He added that \"Gaza should achieve a comprehensive and permanent ceasefire as soon as possible.\" The Israeli Minister of Heritage Amichai Eliyahu supported the killing of Haniyeh and said to have \"no more mercy.\" Al-Qaeda condemned the murder of Ismail Haniyeh and offered condolences for it. ==References== Category:July 2024 events",
 "title": "Assassination of Ismail Haniyeh"
}