{
 "id": "112390",
 "text": "The National Hockey League presents lots of annual awards and trophies to recognize its teams and players. The oldest, and most notable, is the Stanley Cup. First awarded in 1893, the Stanley Cup is awarded to the NHL's playoff champion. The Stanley Cup is the third trophy to be used as the league's championship, as for the first nine years of the NHL's existence, it remained a multiple league challenge cup. ==History== The NHL's first championship trophy was the O'Brien Trophy, which was created by the National Hockey Association in 1910 and was acquired by the NHL in 1918, after which it was awarded to the playoff champion until 1923. The O'Brien Trophy was retired in favour of the Prince of Wales Trophy in 1924, which became the league's championship until the end of the Western Hockey League following the 1926 season, leaving the Stanley Cup exclusively in the hands of the National Hockey League. The Prince of Wales Trophy remains an active award. It is presently awarded to the playoff champion of the Eastern Conference, while the Clarence S. Campbell Bowl, created in 1967, is currently awarded to the Western Conference champion. The youngest team trophy is the Presidents' Trophy, which has been awarded to the NHL's regular season champion since 1986. The first individual trophy was the Hart Trophy, first awarded in 1924 to the league's most valuable player. The Lady Byng Trophy followed a year later, awarded to the most gentlemanly player in the league. Two years later, the Vezina Trophy was created for the NHL's top goaltender. The Conn Smythe Trophy was first awarded to the NHL's playoff most valuable player in 1965. Presently, the NHL has 17 annual individual trophies and awards, the most recently created being the Mark Messier Leadership Award, first awarded in 2007. ==Team trophies== Image Award Created Description Current holder Stanley Cup 1893 Awarded to the NHL playoff champion. Previously it was a challenge cup (1893–1914) and then an interleague championship trophy (1915–1926). Named after Lord Stanley of Preston, the 6th Governor General of Canada, who donated the original cup. Colorado Avalanche (2021–22) Prince of Wales Trophy 1925 Awarded to the Eastern Conference playoff champion. Previously awarded as the NHL playoff championship (1925–1927), the American Division Champion (1928–1938), the regular season championship (1939–1967), East Division championship (1968–1974) and Wales Conference championship (1975–1993). Named after Edward, Prince of Wales, who donated the trophy to the league in 1924. It was first awarded to the winner of the first game in Madison Square Garden in 1925. Tampa Bay Lightning (2021–22) Clarence S. Campbell Bowl 1968 Awarded to the Western Conference playoff champion. Previously awarded as the West Division title (1968–1974) and Campbell Conference championship (1975–1993). Named after Clarence Campbell, the third NHL President. Colorado Avalanche (2021–22) Presidents' Trophy 1986 Awarded to the club finishing the regular season with the best overall record (based on points). Florida Panthers (2021–22) O'Brien Trophy 1910 Awarded by the National Hockey Association (1910–1917) and NHL (1918–1927) to the league playoff champion, Canadian Division regular season champion (1928–1938), and Stanley Cup runner-up (1939–1950). It was originally donated to the NHA by Canadian Senator M. J. O'Brien, in recognition of his son, NHA founder Ambrose O'Brien Last awarded in 1950 Last winner: New York Rangers ==Individual trophies and awards== Image Award Created Description Current holder Hart Memorial Trophy 1924 Awarded to the \"player judged most valuable to his team\". The original trophy was donated to the league by Dr. David A. Hart, father of coach Cecil Hart. Edmonton Oilers Lady Byng Memorial Trophy 1925 Awarded to the player who exhibited outstanding sportsmanship and gentlemanly conduct combined with a high standard of playing ability. Named after Lady Byng of Vimy, 40th viceregal consort of Canada, who donated the original trophy to the league. Winnipeg Jets Vezina Trophy 1927 Awarded to the league's top goaltender. Named after goaltender Georges Vezina. Vegas Golden Knights Calder Memorial Trophy 1937 Awarded to the league's most outstanding rookie player. Named after Frank Calder, the first NHL President. Minnesota Wild Art Ross Trophy 1948 Awarded to the player who leads the league in total points at the end of the regular season. Named after player, coach and team executive Art Ross, who originally donated the trophy. Edmonton Oilers James Norris Memorial Trophy 1954 Awarded to the defenseman who demonstrates throughout the season the greatest all-round ability in the position. Named after team owner James E. Norris. Colorado Avalanche Conn Smythe Trophy 1965 Awarded to the most valuable player for his team in the playoffs. Named after coach and team owner Conn Smythe. Colorado Avalanche Bill Masterton Memorial Trophy 1968 Awarded to the player who best exemplifies the qualities of perseverance, sportsmanship, and dedication to hockey. Named after Bill Masterton, the only player in NHL history to die as the direct result of injuries suffered during a game. Montreal Canadiens Ted Lindsay Award 1971 Awarded to the NHL's outstanding player as selected by the members of the NHL Players Association (called the Lester B. Pearson Award from 1971 to 2009). Named after forward Ted Lindsay (and previously Lester B. Pearson, noted college athlete who became the 14th Prime Minister of Canada). Edmonton Oilers Jack Adams Award 1974 Awarded to the NHL coach adjudged to have contributed the most to his team's success (i.e. Coach of the Year). Named after player, coach and general manager Jack Adams. Calgary Flames Frank J. Selke Trophy 1978 Awarded to the forward who best excels in the defensive aspects of the game. Named after general manager Frank J. Selke. Boston Bruins William M. Jennings Trophy 1982 Awarded to the goaltender(s) having played a minimum of 25 games for the team with the fewest goals scored against it in the regular season. Named after team executive William M. Jennings. and Antti Raanta Carolina Hurricanes NHL Plus-Minus Award 1983 Awarded to the player with the highest plus/minus statistic in the regular season Last awarded in 2008 King Clancy Memorial Trophy 1988 Awarded to the player who best exemplifies leadership qualities on and off the ice and has made a noteworthy humanitarian contribution in his community. Named after player, coach and team executive King Clancy. New Jersey Devils NHL Foundation Player Award 1998 Awarded to the player who applies the core values of hockey to enrich the lives of people in his community. Last awarded in 2017 Maurice \"Rocket\" Richard Trophy 1999 Awarded to the top goal scorer in the regular season. Named after Maurice Richard, the first NHL player to score 50 goals in 50 games. Toronto Maple Leafs Roger Crozier Saving Grace Award 2000 Awarded to the goaltender who has played a minimum of 25 games in the regular season and has the highest save percentage. Named after goaltender Roger Crozier. Last awarded in 2007 Mark Messier Leadership Award 2007 Awarded by former player Mark Messier, himself, to the player who exemplifies great leadership qualities to his team, on and off the ice, during the regular season. Los Angeles Kings NHL General Manager of the Year Award 2010 Awarded to the top National Hockey League General Manager. New York Islanders E.J. McGuire Award of Excellence 2015 Awarded by NHL Central Scouting to the draft prospect who best exemplifies the commitment to excellence through strength of character, competitiveness and athleticism. Named after former NHL Director of Central Scouting E. J. McGuire. The league has also given some short-lived awards over the years, including: *NHL/Sheraton Road Performer Award – awarded to the player who accrued the most road points during the regular season. It was awarded to Joe Sakic of the Colorado Avalanche in 2004 and not subsequently. *Scotiabank/NHL Fan Fav Award – awarded to a National Hockey League player based on fan voting. It was awarded to Roberto Luongo of the Vancouver Canucks in 2010 and not subsequently. *NHL Lifetime Achievement Award – awarded to a National Hockey League veteran in recognition of their overall contributions to the league and sport. It has been awarded twice, first to Gordie Howe in 2008 and then to Jean Béliveau in 2009. ==Related pages== *Lester Patrick Trophy - presented, in part by the NHL, for contributions to hockey in the United States, but not considered an NHL award *Hockey Hall of Fame ==References== ==Other websites== *NHL trophies at nhl.com *NHL trophies at legendsofhockey.net *",
 "title": "National Hockey League awards"
}