{
 "id": "1123086",
 "text": "2024 () in Meitei culture, including but not limited to Meitei architecture, Meitei cinema, Meitei cuisine, Meitei dances, Meitei festivals, Meitei language, Meitei literature, Meitei music, Meitei religion, Meitei script, etc. == Events == * January : Microsoft Translator added Meitei language in two writing systems, Meitei script and Latin script, in its system. * January : Manipuri classical dance was showcased in the 75th Republic Day of India, in Kartavya Path of New Delhi. * January : 2 Jhaveri sisters performed Manipuri classical dance in the Goa Open Arts Festival, in Goa. * February 6 : In a curatorial event by the National Gallery of Modern Art, New Delhi along with the Penguin Books and the Imasi Foundation, Indian Union Minister Meenakashi Lekhi officially released a book about Meitei mythology and folklore titled \"Feathers, Fools and Farts\" authored by L. Somi Roy and Thangjam Hindustani Devi. * February : A 2015 Meitei short film “It’s Not My Choice” written and directed by Meitei actor and filmmaker Priyakanta Laishram about LGBT issues, becomes the first Indian short film to be adapted into Thai language. * February : Traditional Manipuri recital was performed by Thingbaijam Chourjeet and his troupe in the Vivekananda Music Festival, in Kolkata. * February : A socio cultural group named MEELAL (Meetei Erol Eyek Loinasillon Apunba Lup) urged the governor of Manipur for the usage of the Meetei Mayek script for the government official transactions of the House recorded in the Meitei language, alongside the current usage of the Bengali script. * February : Government of Assam declared Meitei language as one of its official languages, through the Assam Official Language (Amendment) Bill, 2024, to be used in its 4 districts, Cachar district, Karimganj district, Hailakandi district and Hojai district. * March : Benita Laishram became the first Manipuri folk singer to perform in Bharat ka Amrit Kalash, India's biggest folk song competition, where she showed traditional Meitei cultural dance and music. She was nicknamed 'triple threat' for her performances in singing, dancing, and acting. * March : 110 artistes of Thang Ta, a traditional Meitei martial art, showed their art form, in a dance drama based on the life of Gond queen Rani Durgavati for the first time, in Bhopal, Madhya Pradesh. * March : Government of Assam announced that Meitei Mayek script will be introduced to be used in the academic educational institutions of Assam state. * April : A Meitei language speaking robot, named \"Kangleinganbi\", was developed. * June : Chief Secretary of the Government of Manipur Vineet Joshi declared for the introduction of Meitei language to the filing of FIRs to facilitate people in communicating their complaints and grievances. * July : An art exhibition on traditional Meitei 'Subika painting' was conducted by Yumnam Sapha, an artist from the Department of Fine Art at Manipur University, getting inspired by Meitei indigenous paintings and illustrations found in ancient Meitei manuscripts known as the Subika. * July : One Meitei woman from Manipur and another from Tripura achieved the National Handloom Awards 2023 from the Ministry of Textile, Government of India, for their outstanding performance in the handloom industry of making traditional Meitei clothing called \"Innaphi\", also spelled as \"Ennaphi\". == Deaths == * July : Renowned Meitei filmmaker Rajkumar Kripajit Singh passed away at the age of 67. == References == Category:2024 Category:Meitei culture",
 "title": "2024 in Meitei culture"
}