{
 "id": "1123009",
 "text": "Transnistria (also called Transdniestria, or Pridnestrovie, officially the Pridnestrovian Moldavian Republic, PMR; ), is a separatist country in Eastern Europe. This means it says it is a different from Moldova. However, this is not legally true. Most countries have no diplomatic relations with it. Transnistria is the only country that still has a hammer and sickle on its flag. ==Pridnestrovian Moldavian Republic== ===History=== The flag of the Moldavian Soviet Socialist Republic was the flag of the republic until December 1991. When Moldova became independent, some places in Transnistria refused to fly the new Moldovan flag and kept flying the flag of the Soviet Union. Many people still liked the old Moldavian SSR flag, so it was officially brought back as the flag of Transnistria in 1991. Even though the flag and coat of arms have socialist symbols, Transnistria is not a socialist state. The original flag and its description are kept in the official residence of the President of Transnistria. In 2009, the Supreme Council talked about changing the civil flag, which is just red-green-red without the hammer and sickle. They wanted a new flag with three horizontal stripes in white, blue, and red, almost the same as the flag of Russia, but with a different size ratio (1:2 instead of Russia's 2:3). Moldova.org: Transnistria considers broadening its state symbols (5 May 2009) Supreme Council – parliamentary news: On state insignia (2 June 2009) Supreme Council – parliamentary news: Reaffirming commitment to harmonization of PMR and RF legislation (28 May 2009) The main reason for the co-official national flag is to show that Transnistria wants closer ties with Russia, which supports Transnistria's claim of independence from Moldova. In a 2006 referendum, 97.2% of Transnistrians voted to have closer ties with Russia. The new flag is used alongside the state flag. In April 2017, the Supreme Council decided to make the new design Transnistria's co-official national flag. ==References== ==Other websites== * About the State Flag of the Pridnestrovian Moldavian Republic Category:Politics of Europe Category:Flags of Europe Transnistria Category:Transnistria",
 "title": "Flag of Transnistria"
}