{
 "id": "1123206",
 "text": "The Campaign against Pratiharas was led by Devapala of Pala Empire against Nagabhatta II, Ramabhadra and Bhoja who were the rulers of the Gurjara Pratihara dynasty. Devapala's Campaigns began when Nagabhatta II tried to establish Pratihara rule over Kannauj after the death of Dharmapala who was the father of Devapala. ==Background== When Govinda III went back to South India, Kannauj was left unguarded from Nagabhatta II and Dharmapāla. Nagabhatta II took control of Kannauj, but there was no battle fought between them. It is possible that Nagabhatta II attempted to take control of Kannauj after Dharmapala's death since Nagabhatta II relocated his capital to that location. However, Devapāla, Dharmapala's son, regained the Pāla rule over Kannauj by defeating Nagabhatta II. Ramabhadra, who was the son of Nagabhatta II, was also defeated by Devapala in his campaign. After Ramabhadra, Bhoja became the next ruler of the Gurjara Pratihara dynasty and he was defeated by Devapala too. ==Campaigns against Nagabhatta II== During the reigns of Dharmapala and Devapala, the Tibetans, led by Mu-tig Btsan-po, claimed to have subdued Dharmapala, while his successor Ralpacan claims to have boasted their success all the way to Gangāsāgara. These took place at the end of Dharmapala's reign and the beginning of Devapala's reign. Additionally, Tibet was allied with the Pratihāras in their attack on the Pala empire. But the Pratihāras under Nagabhatta II were successfully expelled from western territories of Bihar by Devapāla. ==Campaign against Ramabhadra== After the death of Nagabhatta II, Ramabhadra became the next king of Gurjara Pratihara dynasty. Devapala launched a campaign against the Gurjara Pratihara occupation of Madhyadesha, using a successful military strategy. Devapala's bold actions, combined with Ramabhadra's weak leadership, caused a crisis within the Gurjara Pratihara dynasty. In 836, Ramabhadra was killed by his own son, Mihir Bhoja. ==Campaign against Bhoja== While Devapāla was busy fighting the Tibetans, Mihir Bhoja took advantage of the situation and attacked him. After dealing with the Tibetans, Devapala led a campaign against Bhoja. Not only did Devapala humble the ruler of Gurjara, but he also defeated the Hunas and Kambojas in his campaign against Bhoja. Devapala, in the inscriptions and on the inscription recording his reign, credits to him for subjugating the Gurjara Pratihara Empire, Hunas and Kambojas. It is inferred that the Gurjara Pratihara king in this case was Bhoja. Devapala's victory over the Pratihara king probably occurred late in his reign, sometime between 840 and 850 CE. ==Aftermath== Mihir Bhoja, the ruler of the Gurjara Pratihara Empire, was unable to regain his family's wealth and power as long as Devapala was alive. Therefore, Devapala successfully defeated three different rulers from the Gurjara Pratihara Empire in his campaigns and continued the Pala Supremacy over North India. ==References== Category:Pala Empire Category:Battles involving the Pala Empire",
 "title": "Campaign against Pratiharas"
}