{
 "id": "1123145",
 "text": "This is a list of songs recorded by Australian rapper Iggy Azalea. ==Songs== #ABCDFGHIJKLMNOPQRSTWY Title Other performer(s) Writer(s) Album 2012 \"1 800 BONE\" TrapGold 2014 \"100\" Watch The Duck Iggy Azalea T.I. Oscar White Watch The Duck The New Classic 2017 \"7Teen\" * Iggy Azalea Digital Distortion 2014 \"Acting Like That\" Jennifer Lopez Leon Youngblood XSDTRK Terence Coles James \"JDoe\" Smith Mark Pitts K. Stephens Iggy Azalea Jennifer Lopez A.K.A. Jennifer Lopez – A.K.A.. Album booklet. Capitol Records (Universal Music Group). 2015 \"All Hands on Deck\" Tinashe Tinashe Stargate Cashmere Cat Bebe Rexha Iggy Azalea 2014 \"Animal Noise\" 2016 \"Azillion\" Iggy Azalea Digital Distortion 2012 \"Bac 2 Tha Future (My Time)\" Iggy Azalea TrapGold 2011 \"Backseat\" Chevy Jones Iggy Azalea Ignorant Art 2012 \"Beat Down\" Steve Aoki Angger Dimas Steve Aoki Angger Dimas Iggy Azalea Brandon Salaam Bailey Wonderland (Remixed) 2014 \"Beg for It\" MØ Iggy Azalea Charli XCX The Invisible Men Kurtis McKenzie Jon Turner Reclassified 2012 \"Best Friend\" B.o.B Mac Miller B.o.B Mac Miller Iggy Azalea Jamieson James Fuck 'Em We Ball 2019 \"Big Bag\" Stini Iggy Azalea Stini In My Defense 2014 \"Black Widow\" Rita Ora Iggy Azalea Tor Erik Hermansen Mikkel Storleer Eriksen Benny Blanco Katy Perry Sarah Hudson The New Classic 2017 \"Boom Boom\" Zedd Iggy Azalea Stix Starrah Zedd Alexander Palmer Jeremy Hawkins Priscilla Hamilton Mike Fonseca Marlon \"Chordz\" Barrow Pitch Perfect 3: Original Motion Picture Soundtrack 2014 \"Booty\" Jennifer Lopez Cory Rooney Jennifer Lopez Benny Medina Chris Brown Asia Bryant Diplo Lewis D. Gittus Tedra Renee Wilson Danny Omerhodic Iggy Azalea A.K.A. 2012 \"Boss Lady\" Woman On Top 2013 \"Bounce\" Iggy Azalea Mark Orabiyi Oladayo Olatunji Natalie Sims Mike Di Scala Speedy J The New Classic 2019 \"Boys Like You\" VVAVES Iggy Azalea VVAVES 2012 \"Burgundy Shit\" * 2021 \"Brazil\" Iggy Azalea Bobby D. Session Jr. The End Of An Era 2021 \"Brazil (Remix)\" Gloria Groove Iggy Azalea Bobby D. Session Jr. 2017 \"Can't Lose\" Lil Uzi Vert Iggy Azalea Lasanna \"Ace\" Harris Verse Simmonds Shama \"Sak Pase\" Joseph Tumeh Gailor Lil Uzi Vert Def Jams Presents: Direct Deposit (Vol. 2) 2013 \"Change Your Life\" T.I. Iggy Azalea Natalie Sims Raja Kumari The Messengers Lovy Longomba T.I. The New Classic 2013 \"Chasin Me\" T.I. Young Dro Kris Stephens G.D.O.D. (Get Dough or Die) 2013 \"Cheeks\" * 2019 \"Clap Back\" Iggy Azalea In My Defense 2019 \"Comme des Garçons\" Iggy Azalea In My Defense 2019 \"Cum\" Brooke Candy Brooke Candy Iggy Azalea Ashnikko Oscar Scheller Sexorcism 2020 \"Dance Like Nobody's Watching\" Tinashe Iggy Azalea Tinashe Bobby D. Session Jr. Haven Jordan Harry Monroe Baum Michael McNamara 2011 \"D.R.U.G.S.\" YG Iggy Azalea 2012 \"Demons\" TrapGold 2013 \"Designer Drugs\" * 2013 \"Dibby Sound\" * 2014 \"Don't Need Y'all\" Iggy Azalea The Invisible Men Jon Mills Jon Turner The New Classic 2012 \"Down South\" TrapGold 2011 \"Drop That Shit\" Problem Iggy Azalea T.I. Problem Ignorant Art 2017 \"Elephant\" * YG Iggy Azalea YG Digital Distortion 2014 \"Fancy\" Charli XCX Iggy Azalea Charli XCX The Invisible Men The Arcade The New Classic 2012 \"Flash\" Mike Posner Iggy Azalea Mike Posner Glenda Proby Glory 2012 \"Flexin' & Finessin Juicy J Iggy Azalea Juicy J FKi TrapGold 2019 \"Freak Of The Week\" Juicy J Iggy Azalea Juicy J In My Defense 2019 \"F*ck It Up\" Kash Doll Iggy Azalea Kash Doll In My Defense 2014 \"Fuck Love\" Iggy Azalea Jon Turner Jon Mills Rock City The Invisible Men The New Classic 2015 \"G.U.N.S.\" Sauce Lord Rich Know Me 2015 \"Girl Crush\" * Selena Gomez 2012 \"Glory\" Iggy Azalea Glenda Proby Glory 2015 \"Go Hard or Go Home\" Wiz Khalifa Wiz Khalifa Iggy Azalea The Featherstones Furious 7: Original Motion Picture Soundtrack 2014 \"Goddess\" Iggy Azalea The Invisible Men Jon Turner Jon Mills Frank Farian The New Classic 2017 \"Going Up\" Ljay Currie Iggy Azalea Ljay Currie 4 My Ratz 2012 \"Golddust\" TrapGold 2017 \"Good\" Iggy Azalea Ljay Currie 4 My Ratz 2017 \"Hate On It\" Iggy Azalea Ljay Currie 4 My Ratz 2014 \"He Ain't Goin' Nowhere\" Jennifer Hudson Pharrell Williams Amethyst Kelly JHUD Jennifer Hudson – JHUD. Album booklet. RCA Records (Sony Music Entertainment). 2014 \"Heavy Crown\" Ellie Goulding Iggy Azalea The Invisible Men Ellie Goulding Jon Turner Salt Wives Reclassified 2014 \"Hell You Sayin T.I. Young Dro Travis Scott SXEW (South by East West) 2011 \"Hello\" Joe Moses Ignorant Art 2018 \"Hey Iggy\" Iggy Azalea Tyga Michael Chapman Nicky Chinn Dylan Wiggins Joseph Epperson Survive the Summer 2013 \"Hilife\" * 2013 \"High Level\" Skeme Skeme Iggy Azalea Ingleworld 2019 \"Hoemita\" Lil Yachty Iggy Azalea Lil Yachty In My Defense 2011 \"Home Town Hatred\" 2012 \"Hustle Gang\" Chip T.I. S-X London Boy 2012 \"I Think She Ready\" FKi Diplo Transformers n the Hood 2014 \"I'm Coming Out\" Keyshia Cole Bernard Edwards Nile Rodgers Iggy Azalea 2012 \"Iggy in Moscow\" 2014 \"Iggy SZN\" Iggy Azalea The Invisible Men Darryl Reid Jon Turner Reclassified 2014 \"Impossible Is Nothing\" Iggy Azalea The Arcade Joey Dyer The Invisible Men Gabriel Yared The New Classic 2018 \"In a Haze [Remix]\" Total Ape Iggy Azalea In a Haze - EP 2014 \"Just Askin Iggy Azalea The Invisible Men Natalie Sims Ryan Woodcock Markous Roberts The New Classic 2019 \"Just Wanna\" Iggy Azalea In My Defense 2018 \"Kawasaki\" Iggy Azalea Joseph Epperson Survive the Summer 2015 \"Kingdom Come\" Demi Lovato Demi Lovato Julia Michaels Iggy Azalea Steve Mac Confident 2014 \"Know About Me\" DJ Green Lantern Valentino Khan Iggy Azalea DJ Green Lantern Valentino Khan 2018 \"Kream\" Tyga Iggy Azalea Tyga Lamont Hawkins Corey Woods Brother J Dennis Coles RZA Ol' Dirty Bastard Method Man Gary Grice David Porter Isaac Hayes Paimon Jahanbin Ronny J Survive the Summer 2014 \"Lady Patra\" Mavado Iggy Azalea Mavado Jon Turner The Invisible Men Rock City Daler Mehndi The New Classic 2013 \"Last Plane\" * 2013 \"Leave It\" * 2012 \"Light as a Feather\" Katy B Diplo Diplo Iggy Azalea Katy B Danger EP 2019 \"Like Dat\" * Fergie Major Lazer Fergie Iggy Azalea Major Lazer 2013 \"Live a Little\" * 2013 \"Live Free\" * 2018 \"Love Don't Fail Me Now\" * Jeremih Iggy Azalea Jeremih Digital Distortion 2019 \"Lola\" Alice Chater Iggy Azalea Alice Chater Fahad Alhaj Kinnda Wicked Lips 2019 \"Mek It Bunx Up\" * DJ Fresh Marcy Chin DeeWunn Iggy Azalea Marcy Chin 2017 \"Middle Man\" * Iggy Azalea Digital Distortion 2014 \"Million Dollar Dream\" A. R. Rahman A. R. Rahman Iggy Azalea Million Dollar Arm (Original Motion Picture Soundtrack) 2012 \"Millionaire Misfits\" B.o.B Iggy Azalea B.o.B T.I. Maejor Glory 2017 \"Mo Bounce\" Iggy Azalea Lasanna \"Ace\" Harris Verse Simmonds Shama \"Sak Pase\" Joseph Tumeh Gailor Lil Uzi Vert 2012 \"Mo Flow\" Skeme Skeme Iggy Azalea Alive & Living 2013 \"Monkey\" * 2012 \"Murda Bizness\" T.I. Iggy Azalea Glenda Proby T.I. Maejor Rock City Glory 2011 \"My World\" Iggy Azalea Marlon \"Chordz\" Barrow Stix Ignorant Art 2017 \"Never Satisfied\" Iggy Azalea LJay Currie 4 My Ratz 2014 \"New Bitch\" Iggy Azalea The Invisible Men Natalie Sims Joey Dyer The New Classic 2014 \"No Mediocre\" T.I. T.I. Iggy Azalea DJ Mustard Paperwork T.I. – Paperwork. Album booklet. Columbia Records (Sony Music Entertainment). 2019 \"Not Important\" Iggy Azalea Wicked Lips 2018 \"OMG\" Wiz Khalifa Iggy Azalea Wiz Khalifa Eric Weaver Akil C. King Smash David Survive the Summer 2013 \"Otis\" Angel Haze 2019 \"Personal Problem\" Iggy Azalea Wicked Lips 2012 \"Picture Me Rollin * 2015 \"Pretty Girls\" Britney Spears The Invisible Men Maegan Cottone Iggy Azalea Little Mix 2014 \"Problem\" Ariana Grande Max Martin Savan Kotecha Ilya Iggy Azalea Ariana Grande My Everything Ariana Grande – My Everything. Album booklet. Republic Records (Universal Music Group). 2011 \"Pu$$y\" Iggy Azalea Marlon \"Chordz\" Barrow Stix Ignorant Art 2019 \"Pussy Pop\" Iggy Azalea In My Defense 2012 \"Quicktime\" TrapGold 2012 \"Raise Your Weapon\" Stix deadmau5 Stix Iggy Azalea I Told U So 2014 \"Rolex\" Iggy Azalea The Invisible Men Kurtis McKenzie The New Classic 2012 \"Runway\" Pusha T Iggy Azalea Pusha T B.o.B Glory 2019 \"Sally Walker\" Iggy Azalea J. White Did It In My Defense 2018 \"Savior\" Quavo Iggy Azalea Quavo Akil King Myjah Veira Kyle Owens Verse Simmonds Ian Devaney Dr. Luke Lisa Stansfield Andy Morris Cirkut 2016 \"Sexy\" * French Montana 2021 \"Sex On The Beach\" Sophia Scott Iggy Azalea Sophia Scott Bobby D. Session Jr. The End Of An Era 2021 \"Sip It\" Tyga Iggy Azalea Tyga OG Parker The End Of An Era 2012 \"Slo.\" Iggy Azalea TrapGold 2019 \"Spend It\" Iggy Azalea In My Defense 2017 \"Somebody Else\" * Iggy Azalea Digital Distortion 2019 \"Started\" Iggy Azalea Ronny Wright In My Defense 2018 \"Survive the Summer\" Iggy Azalea Ljay Currie Survive the Summer 2017 \"Switch\" Anitta Iggy Azalea The Notorious B.I.G. Christopher Martin Jalacy Hawkins Akil C. King Kyle Owens Maurice Simmonds Georgia Ku Anton Malmberg Hård af Segerstad 2011 \"T.W.O. Interlude\" * 2016 \"Team\" Iggy Azalea Bebe Rexha Lauren Christy Juvenile Lil Wayne Mannie Fresh 2019 \"Thanks I Get\" Iggy Azalea In My Defense 2011 \"The Last Song\" Iggy Azalea Tiffany Gouche Marlon \"Chordz\" Barrow Ignorant Art 2019 \"The Girls\" Pabllo Vittar Iggy Azalea Noah Cyrus Wicked Lips 2018 \"Tokyo Snow Trip\" Iggy Azalea Joseph Epperson Survive the Summer 2016 \"Tonight (It's a Party)\" Stephen Marley DJ Khaled Waka Flocka Flame Rohan Bennett Trevor James Amethyst Kelly DJ Khaled Juaquin Malphurs Stephen Marley Morgan Memmalatel Revelation Pt. II: \"The Fruit of Life\" 2011 \"Treasure Island\" Ignorant Art 2014 \"Trouble\" Jennifer Hudson Iggy Azalea Judith Hill Isabella Summers The Invisible Men Salt Wives Jon Turner Reclassified 2014 \"Walk the Line\" Iggy Azalea Kurtis McKenzie The Invisible Men Jon Turner The New Classic 2012 \"Waste It All\" * Trey Songz 2014 \"We Go Hard\" T.I. Spodee T.I. Spodee Iggy Azalea G.D.O.D. II 2014 \"We in This Bitch\" Iggy Azalea The Invisible Men Salt Wives Jon Turner Reclassified 2013 \"Whatchu Lookin At\" Iggy Azalea 2013 \"Wickedest Style\" Sean Paul Jason \"Jigzagula\" Henriques Sean Paul Keyz Polow da Don Iggy Azalea Full Frequency 2013 \"Work\" Iggy Azalea The Invisible Men Trocon Markous Roberts Natalie Sims The New Classic 2012 \"Yo El Ray\" TrapGold 2011 \"You\" YG Iggy Azalea YG Ignorant Art 2021 \"Is That Right\" BIA Iggy Azalea BIA The End Of An Era ==Notes== ==References== Azalea, Iggy Category:Iggy Azalea",
 "title": "List of songs recorded by Iggy Azalea"
}