{
 "id": "1123240",
 "text": "General elections were held in Ecuador on 9 February 2025. Incumbent president Daniel Noboa is running for re-election after his 2023 victory. He will face leftist candidate Luisa González in the runoff, as no candidate secured a majority in the first round. The elections also include the selection of members for the National Assembly, Assemblies of the 21 Provinces of Ecuador and representatives for the Andean Parliament which will serve a full four- year term. The presidential runoff will be held on 13 April 2025. ==Presidential candidates== === Advanced to run-off === Name Name Born Experience Home province Campaign Ref Luisa González (age ) Quito, Pichincha Member of the National Assembly (2021–2023) Secretary of Public Administration (2017) 2023 presidential candidate Manabí Citizen Revolution * * * Daniel Noboa (age ) Miami, Florida, U.S. 48th President of Ecuador (2023-present) Member of the National Assembly (2021–2023) Santa Elena ADN * * * === Eliminated in first round === The following candidates have officially submitted their candidacy through the CNE and were eliminated in the first round of voting: Name Name Born Experience Home province Campaign Ref Jimmy Jairala (age ) Guayaquil, Guayas Leader of the Democratic Center (2012–present) Prefect of Guayas Province (2009–2018) Member of the National Congress (2007) Guayas MCD nomination * * * Jorge Escala (age ) Ventanas, Los Ríos Member of the National Assembly (2009–2013) Los Ríos Popular Unity * * * Andrea González Náder (age ) Guayaquil, Guayas Environmental activist 2023 vice presidential candidate Guayas PSP * * * Henry Kronfle (age ) Guayaquil, Guayas President of the National Assembly (2023–present) Member of the National Assembly (2017–present) Pichincha PSC nomination * * * Carlos Rabascall (age ) Guayaquil, Guayas Businessman 2021 vice presidential candidate Guayas ID nomination * * * Leonidas Iza (age ) Latacunga, Cotopaxi President of CONAIE (2021–present) Cotopaxi Pachakutik nomination * * * Iván Saquicela (age ) Cuenca, Azuay President of the National Justice Court (2021–2024) Azuay Democracy Yes * * * Francesco Tabacchi (age ) Guayaquil, Guayas Governor of Guayas (2023) Guayas CREO * * * Henry Cucalón (age ) Guayaquil, Guayas Minister of the Government (2023) Member of the National Assembly (2013–2021) Guayas MC25 nomination * * * ====Minor candidates==== The following pre-candidates have also been selected in the primaries of the national parties and are eligible for inscription but have not been notable enough due to lack of coverage or not being present in a national opinion poll: * Víctor Araus (People, Equality and Democracy), former General of the National Police of Ecuador * Juan Iván Cueva (AMIGO), businessman * Pedro Granja (PSE), criminal lawyer * Eduardo Sánchez (RETO), businessman * Luis Tillería (Avanza), businessman, council member of the City of London Corporation * Enrique Gómez (SUMA Party), psychologist ===Withdrawn=== Name Born Experience Home province Campaign Ref José Serrano (age ) Cuenca, Azuay President of the National Assembly (2017–2018) Member of the National Assembly (2017–2021) Minister of the Interior (2011–2016) Pichincha MCD nomination * * * Paola Pabón (age ) Ibarra, Imbabura Prefect of Pichincha Province (2019–present) Member of the National Assembly (2009–2015) Pichincha RC nomination * * * ===Declined=== The following notable individuals have been the subject of speculation about their possible candidacy but have publicly denied interest in running or were rejected as pre-candidates and declined to pursue their candidacies. * Bolívar Armijos Velasco, President of the National Council of Rural Parochial Governments of Ecuador (2014–2019) and 2023 presidential candidate * Pedro Freile, Director of the Inter-American Development Bank Ecuadorian Division (2004–2005), 2021 presidential candidate (endorsed Topić) * Lucio Gutiérrez, member of the National Assembly (2023–present) and 43rd President of Ecuador (2003–2005) (endorsed González Náder) * Guillermo Lasso (CREO), 47th President of Ecuador (2021–2023) (endorsed Tabacchi) * Claudia Ormaza Loor (MCD), engineer * Edwin Ortega (Gente Buena), retired Captain of the Ecuadorian Army (did not find support from any national party) * Dallyana Passailaigue, member of the National Assembly (2017–present) (running for vice president; endorsed Kronfle) * Cristina Reyes, President of the Andean Parliament (2023–present), Member of the National Assembly (2013–2021), Municipal Councillor of Guayaquil (2009–2012) (running for vice president; endorsed Cueva) * Diana Salazar Méndez, Attorney General of Ecuador (2019–present) ==Polling== Date Polling source Sample size Margin of error (+/-) Luisa González (RC) Daniel Noboa (ADN) Null Blank Undecided 14–22 Feb 2025 MR Analítica 10,005 1.5% 52.56% 47.44% _ _ 47.91% 43.24% 8.85% 11–13 Feb 2025 TresPuntoZero 1,000 3.2% 51.2% 47% _ 1.2% 50.6% 46.5% 1.7% ==References== Category:2020s in Ecuador Category:2025 elections Category:Elections in Ecuador Category:February 2025 events Category:April 2025 events",
 "title": "2025 Ecuadorian general election"
}