{
 "id": "11232",
 "text": "Kazakhstan is a landlocked country in the middle of Eurasia. Its official name is the Republic of Kazakhstan. Kazakhstan is the ninth biggest country in the world, and it is also the biggest landlocked country in the world. Before the end of the Soviet Union, it was called \"Kazakh Soviet Socialist Republic\". The president of the country from 1991 through March 2019 was Nursultan Nazarbayev. Astana is the capital city of Kazakhstan. Almaty was the capital until 1998, when it moved to Astana. The Kazakh language, which is a Turkic language, is the native language, but Russian has equal official status for all administrative and institutional purposes.The constitution of Kazakhstan , CONSTITUTION OF THE REPUBLIC OF KAZAKHSTAN: 1. The state language of the Republic of Kazakhstan shall be the Kazakh language. 2. In state institutions and local self-administrative bodies the Russian language shall be officially used on equal grounds along with the Kazakh language. Islam is the largest religion- about 70% of the population are Muslims, with Christianity practiced by 26%; Russia leases (rents) the land for the Baikonur Cosmodrome (site of Russian spacecraft launches) from Kazakhstan. == Geography == Kazakhstan is a transcontinental country mostly in Asia with a small western part across the Ural River in Europe. It has borders with the Russian Federation in the north and west, Turkmenistan, Uzbekistan and Tajikistan in the southwest, and China in the far east. The northern border is mostly with Siberia, Russia, so Russia has the longest border with Kazakhstan. Basically, Kazakhstan runs from the Caspian Sea in the west to the mainly Muslim Chinese autonomous region of Xinjiang. Kazakhstan has no ocean shoreline, but borders the Caspian Sea, which boats use to get to neighboring countries. The Caspian Sea is an Endorheic basin without connections to any ocean. == Natural resources == Kazakhstan has plenty of petroleum, natural gas, and mining. It attracted over $40 billion in foreign investment since 1993 and accounts for some 57% of the nation's industrial output. According to some estimates,Mineral Wealth. homestead.com Kazakhstan has the second largest uranium, chromium, lead, and zinc reserves, the third largest manganese reserves, the fifth largest copper reserves, and ranks in the top ten for coal, iron, and gold. It is also an exporter of diamonds. Kazakhstan has the 11th largest proven reserves of both petroleum and natural gas.International Crisis Group, 2007. Central Asia's Energy Risks, Asia Report No. 133 . ==Regions== Kazakhstan is divided into 17 regions. They are divided into districts. Almaty and Astana cities have the status of State importance and are not in any region.CIA World Factbook: Kazakhstan . Baikonur city has a special status because it is leased to Russia for Baikonur cosmodrome until 2050. Each province is headed by an Akim (provincial governor) appointed by the president. Municipal Akims are appointed by province Akims. The Government of Kazakhstan moved its capital from Almaty to Astana on December 10, 1997. Coat of arms Full English name Type Capital Full Kazakh name Full Russian name Standard time Abai Region region Semey Абай облысы Abai oblysy Абайская область Abaiskaya Oblast′ UTC+06:00 Akmola Region region Kokshetau Ақмола облысы Aqmola oblysy Акмолинская область Akmolinskaya Oblast′ UTC+06:00 style=\"text-align:center;\" Aktobe Region region Aktobe Ақтөбе облысы Aqtöbe oblysy Актюбинская область Aktyubinskaya Oblast′ UTC+05:00 style=\"text-align:center;\" Almaty city Алматы қаласы Almaty qalasy город Алматы gorod Almaty UTC+06:00 style=\"text-align:center;\" Almaty Region region Qonaev Алматы облысы Almaty oblysy Алматинская область Almatinskaya Oblast′ UTC+06:00 style=\"text-align:center;\" Astana city Астана қаласы Astana qalasy город Астана gorod Astana UTC+06:00 style=\"text-align:center;\" Atyrau Region Atyrau Атырау облысы Atyrau oblysy Атырауская область Atyrauskaya Oblast′ UTC+05:00 style=\"text-align:center;\" Baikonur city Байқоңыр қаласы Baiqoñyr qalasy город Байконур gorod Baykonur UTC+05:00 style=\"text-align:center;\" East Kazakhstan Region region Oskemen Шығыс Қазақстан облысы Şyğys Qazaqstan oblysy Восточно-Казахстанская область Vostochno-Kazakhstanskaya Oblast′ UTC+06:00 style=\"text-align:center;\" Jambyl Region region Taraz Жамбыл облысы Jambyl oblysy Жамбылская область Zhambylskaya Oblast′ UTC+06:00 Jetisu Region region Taldykorgan Жетісу облысы Jetısu oblysy Жетысуская область Zhetysuskaya Oblast′ UTC+06:00 style=\"text-align:center;\" Karaganda Region region Karaganda Қарағанды облысы Qarağandy oblysy Карагандинская область Karagandinskaya Oblast′ UTC+06:00 style=\"text-align:center;\" Kostanay Region region Kostanay Қостанай облысы Qostanai oblysy Костанайская область Kostanayskaya Oblast′ UTC+06:00 style=\"text-align:center;\" Kyzylorda Region region Kyzylorda Қызылорда облысы Qyzylorda oblysy Кызылординская область Kyzylordinskaya Oblast′ UTC+05:00 style=\"text-align:center;\" Mangystau Region region Aktau Маңғыстау облысы Mañğystau oblysy Мангыстауская область Mangystauskaya Oblast′ UTC+05:00 style=\"text-align:center;\" North Kazakhstan Region region Petropavl Солтүстік Қазақстан облысы Soltüstık Qazaqstan oblysy Северо-Казахстанская область Severo-Kazakhstanskaya Oblast′ UTC+06:00 style=\"text-align:center;\" Pavlodar Region region Pavlodar Павлодар облысы Pavlodar oblysy Павлодарская область Pavlodarskaya Oblast′ UTC+06:00 style=\"text-align:center;\" Shymkent city Шымкент қаласы Şymkent qalasy город Шымкент gorod Shymkent UTC+06:00 style=\"text-align:center;\" Turkistan Region (formerly South Kazakhstan) region Turkistan Түркістан облысы Türkıstan oblysy Туркестанская область Turkestanskaya Oblast′ UTC+06:00 style=\"text-align:center;\" Ulytau Region region Jezkazgan Ұлытау облысы Ūlytau oblysy Улытауская область Ulytauskaya Oblast′ UTC+06:00 style=\"text-align:center;\" West Kazakhstan Region region Oral Батыс Қазақстан облысы Batys Qazaqstan oblysy Западно-Казахстанская область Zapadno-Kazakhstanskaya Oblast′ UTC+05:00 == Population == The population of Kazakhstan is 17,165,000. It takes the 62th place in the List of countries by population. Average density is one of the lowest on earth with almost 6 people/km2 (List of countries by population density). ==Related pages== *Kazakhstan at the Olympics *Kazakhstan national football team *List of rivers of Kazakhstan ==References== Notes ==Other websites== * Official Website of Kazakh Parliament, in Қазақша, Русский, and English Category:Members of the Organisation of Islamic Cooperation",
 "title": "Kazakhstan"
}