{
 "id": "1123784",
 "text": "Geminis' dart frog (Andinobates geminisae) is a frog. It lives in Panama. ==Body== The adult frog is 11.63 - 13.63 mm long from nose to rear end. It has disks on its toes for climbing. There is no webbed skin on the feet. This frog is shiny orange in color with darker color between the eyes. There are light brown marks under the eardrum and near where the front leg meets the body. There is blue-gray color on the toes of all four feet. There is dark purple- black color on the mouth and face. ==Home== Scientists have only seen this frog in one place: the Río Belén basin in Colón Province. They saw it between 50 and 136 meters above sea level. This frog lives in dry forests that have never been cut down. They live on the ground in dead leaves on the ground, on tree roots, or near rocks and logs with holes under them. ==Young== Scientists believe this frog has eggs the same way as other frogs in Andinobates: The female frog lays eggs on the ground. The adult frogs carry the tadpoles on their backs. Scientists saw one adult frog carrying one tadpole on its back, but they could not see if the frog was male or female. They carry them to water in plant leaves. ==Danger== Scientists say the frog is in big danger of dying out because it only lives in forests that have never been cut down, and people cut down many forests. This is both people who came to Panama from over the ocean and people who were always from Central America but had to move away from their homes. People are building a place to dig copper metal out of the ground nearby, and scientists think more people will come to this part of Panama to work there. Scientists think the fungal disease chytridiomycosis could kill this frog, but they do not know if it is killing the frog now. Scientists think people might also catch this frog to sell as a pet because it is so colorful, but they do not think anyone is doing this now. ==References== Category:Frogs of South America",
 "title": "Andinobates geminisae"
}