{
 "id": "1123748",
 "text": "The Slave Market is a painting by the French artist Gustave Boulanger. It was first shown at the Paris Salon of 1886. Boulanger specialized in classical and Orientalist genre scenes. Its title in the Salon catalogue was Un Maquignon d’esclaves à Rome (A Slave Dealer in Rome).Lafenestre (1886), p.31.As early as 1888 the French press called it Vente d’esclaves (Sale of Slaves).Javel (1888), p. 5. In English it is known as The Slave Market. As showing slave markets was a popular theme in orientalist art, there are many paintings with this theme. It is often compared to the other paintings, and confused with them. Very often, it is taken for a painting by Boulanger's friend and fellow painter Jean-Léon Gérôme. == Description == The painting shows an Ancient Roman slave auction. It shows the marketing of seven young people, ranging in age from children to young adults, as slaves. Both male slaves, as well as three of the female slaves, look similar. They might be members of a family forced into slavery by economic conditions. All are wearing tags to indicate their availability as slaves. The youngest boy is completely naked, while the young man next to him is wearing a loincloth. The young woman sitting next to them is topless, wearing only a skirt, but she is covering her breasts with her legs in a protective pose. The standing African woman is also topless, wearing a white loincloth, and she is covering her breasts with her hands. Her feet are whitened with chalk to show she is a foreign import, unlike the others, and tax has been paid on her. The taller, standing, young woman is wearing a translucent garment which clearly shows her breasts and pubic hair—she is trying to shield her eyes, perhaps because her potential buyers include former friends and neighbors, who are probably seeing her nude for the first time. The adolescent girl next to her is also topless and barefoot, wearing a skirt. The red-haired woman crouching next to them is wearing a loose garment which leaves both her breasts and her genitals exposed. The auctioneer sits eating his lunch with a very casual attitude.The stand is made of wood with a stick tied to a sheet of cloth providing shade. Some of the slaves lean on a white stone wall, on which is written in red, STORAX SERVORUM MANGO, Latin for \"Storax, Slave Merchant.'\" From a common type of Salon academic art of the period, it depicts an eroticized scene clad as a history painting, as was customary at the time in Paris. Boulanger had visited Italy, Greece, and North Africa, and the painting reflects his attention to culturally correct details and skill in rendering the female form. == Slaves for sale == Two years later, in 1888, Boulanger showed a paintingthat is very similar to The Slave Market. It was called Esclaves à vendre (\"Slaves for Sale\"). It was the last of his paintings that was shown at a salon. Boulanger die in 1888. It is currently known only from a black and white reproduction. The art criric Georges Lafenestre said there were colors colors and talked about other details in this description: > Naked girl, standing, almost full-on, leaning against a wooden partition. > Her head tilted to the right, her blonde hair loose and falling, she leans > her left hand against the planks. She wears, as a belt, a torn flap of black > cloth, held in place by a red cord, which falls down her right leg. On her > neck hangs a small label on which is written: Virgo gallica honesta corpore, > XVIII annum, etc. [The Latin indicates this is a scene from the ancient > Roman world, not from the Arab world, as might be thought from the other > figure's burnous.] To the right, at the feet of the young girl, squatting on > the ground, both hands on his knees, is a Negro wrapped in a striped burnous > with a blue background, his head covered with a pink cloth, crowned with > myrtle leaves. On the left, on the straw, a jar. The Slave Market is thought to be in a private collection. The status and location of Esclaves à vendre is unknown.[citation needed] == References == == Sources == * Javel, Firmin (1888). \"Le prochain Salon,\" L'Art français: revue artistique hebdomadaire, 4 Feb 1888, p 5. * Lafenestre, Georges (1886), Le Livre d'Or de Salon de peinture et de sculpture, Paris: Librairie des Bibliophiles, Volume 8, 1886, pp. 31–32. * Lafenestre, Georges (1888), Le Livre d'Or de Salon de peinture et de sculpture, Paris: Librairie des Bibliophiles, Volume 10, 1888, pp. 34\\. * Masler, Marilyn (2009). \"Embracing the Academic Tradition,\" in Masler, Marilyn and Pacini, Marina (eds.), Carl Gutherz: Poetic Vision and Academic Ideals, Jackson, Tennessee: University Press of Mississippi, pp. 38–39. . * Smith, William (1875). \"Servus\" in A Dictionary of Greek and Roman Antiquities, London: John Murray, pp. 1036–1042. Category:Slavery in art Category:Paintings Category:1882 paintings",
 "title": "The Slave Market (Boulanger)"
}