{
 "id": "1123260",
 "text": "Live and Let Die is a book by Ian Fleming. It is the sequel to Casino Royale. == Story == James Bond gets plastic surgery to get rid of the first letter in the Russian word for spy on his hand. Bond wants revenge against the Soviet spy agency SMERSH. Bond’s boss M tells him that a “Negro” criminal called Mister Big who tricked a lot of people into thinking he was Baron Samedi was trained by the OSS during World War Two and is now a Soviet agent working for SMERSH. Bond has a hard time believing that a black person can be smart enough to be a supercriminal but M tells him that are too many black people in the world for none of them to be that smart. Bond goes to New York City and meets with his CIA friend Felix Leiter who loves Jazz. Leiter takes Bond to Harlem to help him find out what “Negroes” are like and Bond finds out they’re the same as White people. Mr. Big kidnaps Bond and Leiter and breaks Bond’s finger. Mr. Big brings in a white woman named Solitaire who he thinks is a Voodoo Witch to find out if Bond’s honest. Leiter convinces one of Big’s henchmen to let him go while Bond escapes by killing four of Big’s henchmen. Bond runs away on a train with Solitaire and they find out from a black conductor that Mr. Big plans to kill them once they’re done so they leave early and go to Florida. Leiter thinks a man there called The Robber (who owns an Aquarium with dangerous animals) works for Mr. Big so The Robber feeds Leiter’s arm and leg to a shark and sends the rest of his body in bandages to Bond with a letter saying Leiter “disagreed with something that ate him” though Leiter survives. Bond breaks into The Robber’s fish store and kills him. Mr. Big kidnaps Solitaire. Bond goes to Jamaica and finds out that Mr. Big found a pirate treasure from Sir Henry Morgan. Bond has a plan to use a Land mine to kill Me. Big if Bond can’t catch him. Bond goes Scuba diving to catch him but gets in a fight with an Octopus which he kills with a harpoon. Mr. Big notices and kidnaps Bond. Mr. Big has Bond and Solitaire tied to a rope and thrown off his ship. Bond thinks he’ll have to kill Solitaire and then himself to end the pain but then an explosion destroys Mr. Big’s ship. Sharks smell Mr. Big’s blood in the water and eat him. Bond and Solitaire make it back to Jamaica alive. Category:Books by British authors Category:James Bond",
 "title": "Live and Let Die (novel)"
}