{
 "id": "112375",
 "text": "The Entertainment Software Rating Board (ESRB) is an organization that provides age ratings in video games. It was created in 1994, and it serves in North America. Its primary goal is to inform parents and adults which video games are suitable for children. ==Ratings== Icon Rating Years active Description Is it Restricted? Rating Pending (RP) January 1st, 1993-present Rating Pending is an ESRB rating that means that the video game has not yet been rated by the ESRB. Appears only in advertising marketing and promotional materials. It may show a symbol called Likely Mature (August 19th, 2021-present) meaning that the video game will likely receive a Mature rating. No Early Childhood (EC) September 1st, 1994-March 1st, 2018 This rating means that ESRB has determined this product to be appropriate for ages 5 and under. It contains no inappropriate content. No Everyone (E) January 1st, 1998-present This rating means the ESRB has determined this product to be appropriate for all ages. It contains little to no violence or mild language. No Everyone 10+ (E10+) March 2nd, 2005-present This rating means the ESRB has determined this product to be appropriate for ages 10 and over. It may have more mild violence or language than the Everyone (E) rating or has crude humor or suggestive content. No Teen (T) September 1st, 1994-present This rating means the ESRB has determined this product to be appropriate for ages 13 and over. The content clearly goes deeper than the Everyone 10+ rating but not as high as the Mature (M) rating. It may have blood, violence, suggestive themes, brief nudity, more crude humor, or language. No Mature 17+ (M) September 1st, 1994-present This rating means the ESRB has determined this product to be appropriate for ages 17 and over. It may have blood and gore, intense violence, sexual themes and content, nudity, or strong language. Yes (unless those under 17 are accompanied by a parent or adult guardian) Adults Only 18+ (AO) September 1st, 1994-present This rating means the ESRB has determined this product be appropriate only for adults ages 18 and over. Most video games are assigned this rating because their violence or sexual content is too strong to be allowed in the Mature (M) rating. AO-rated video games are only available on Microsoft Windows or Macintosh. Sony, Microsoft, and Nintendo all banned the AO rating from their video game consoles, and most retailers refuse to sell them. Yes ==Controversy== ===The AO rating=== Some critics come to believe that the ESRB only rates games AO if they have sex in them, regardless of how explicit the language, violence or even blood is.Critics on the case of the ESRB, ESRB Site. 2000-5-6. Retrieved 5-6-00. This also lead them to think the ESRB is not doing its job.Is the ESRB Actually Doing Its Job? 2010-4-9. Retrieved 4-9-10. Twenty-three games have received and kept adult ratings, but apparently twenty (almost all) games were given it for sexual themes and content. Two had violence, and the other one was given the \"Adult\" rating for real gambling.Critics on the ESRB's case for the AO rating. 2008-9-8. Retrieved 9-8-10. ===\"Tone Down\" controversy=== Some publishers of games decide to tone down the game's explicitness in order to qualify for an \"M\" rather than an \"AO\" rating.Tone-Downing: From AO to M. For example, the game Grand Theft Auto: San Andreas had an original M rating, but the game that could be unlocked by bypassing the patch, called \"Hot Coffee\", seemed to spark major controversy with the game, because it features sex and erotica. Thus, the ESRB decided to re-rate the game as an AO. Rockstar Games then chose to leave the game out of the release, then release an exploit fix that completely disallowed access to the game. However, other games have trouble being \"toned down\". Thrill Kill, for instance, was given an AO, and then Electronic Arts decided to purchase the publisher, Virgin Entertainment. The release of the game was then canceled, and the game never was toned down.The GTA Exploit from Rockstar Games.Thrill Kill company bought by Electronic Arts, from concern of sadomasochistic sex. == References == == Other websites == * Category:1994 establishments in the United States Category:Censorship Category:Video game content rating systems",
 "title": "Entertainment Software Rating Board"
}