{
 "id": "1123089",
 "text": "Sextortion is a form of coercion. The word is a portmanteau with the parts sex and extortion. It is a form of sexual exploitation. The idea is that someone forces another person to pay money, or do other things. If these things are not done, the offender will release sexual images, videos, or other kinds of information. The things asked for are very often of a sexual nature. An example is having sex with the victim. Very often, victims are asked to make a video showing them stripping or masturbating. Sextortion is an abuse of power. == Corrupt officials == Sextortion is a form of corruption. People with power seek to get sexual favors in exchange for something that they can grant or withhold. These people include government officials, judges, educators, law enforcement personnel, and employers. An example might be a : government official who requests sexual favors to obtain licenses or permits. Another example is that of a teacher who trades good grades for sex with students. Still another is hat of an employer who will only give a job or a promotion to somenoe, if he or she also gets sexual favors. A Transparency International report on sextortion found that often, it was difficult to prosecute sextortion with the existing anti-corruption and gender-based violence laws. == As a form of blackmail == Sextortion also refers to a form of blackmail. An offender collects sexual information, images or videos. Very often these come from social media and text messages. The peretrator can then use this to ask for money or sexual favors from the victim. If the victim does not comply, the offender will relase the information.. People might be extorted with a nude image of themselves. They might have shared this through sexting. They are later forced to give money, or perform sexual acts with the person asking. They may laso be forced into posing or performing sexually on camera and producing hardcore pornography. This method of blackmail is also frequently used with LGBT people who keep their true sexual orientation private. The National Crime Agency in the UK released a video showing the dangers of extorion. They did this to educate people. Blackmail of a sexual nature is often humiliating. People have taken their own lives, because of this. The National Crime Agency has also done other things to tell people about the risks of sextortion. == Webcam blackmail == Many people use webcams for flirting or cybersex. The content that is produced that way can be recorded. It can then be used for sextortion. This is called webcam blackmail. An increase in webcam blackmails have been reported, and it affects both young and old, male and female alike. Webcam blackmail is also connected with webcam trolling. === How it works === Often the cybercriminal is posing as someone else. They might say that they are an attractive person. After this, they start communication with the victim. This communication has a sexual nature. About 95% of the victims are male. Often, the cybercriminal simply shows a pre-recorded video of a performer from a cybersex webcam site. The site is one the victim knows. The criminal then messages the victim at certain points in the video. At these points, the performer appears to be typing on the keyboard. This is done to give the illusion that the performer in the video is messaging them. The victim is then persuaded to undress in front of a webcam. The victim may also be persuaded to engage in other sexual behaviour, such as masturbation. The video is recorded by the cybercriminal, who then reveals their true intent and demands money or other services. An example might be to get more explicit sexual images, in the case of online predation. The offender will threaten to publicly release the video and to send it to websites like YouTube and to family members and friends of the victim if they do not comply. They may also falsely accuse the victim of paedophilia. === Webcam trolling === Webcam trolls also act in the way described above. They target children. They will then talk to the child to get his or her trust. Then they ask the children to expose themselves and film it using the webcam. They may also ask for other sexually explicit material, which is classified as child pornography. When the children find out what they have done, they are often scared, and don't tell their parents. The troll can then use the material to ask for money or more explicit material, much like with regular sextortion. == References == == Other websites == * Institute for Responsible Online and Cell-Phone Communication. sextortion.org * Frederick S. Lane, Cybertraps for the Young (Chicago: NTI Upstream, 2011) * Gross, Doug. \"Police: Naked scammers seduce, blackmail men on Web.\" CNN. February 18, 2013. * \"Cyber Alerts for Parents & Kids Tip #2: Beware of 'Sextortion'.\" (Archive) Federal Bureau of Investigation. February 10, 2012. * \"A Case of 'Sextortion' Cons Like 'Bieber Ruse' Targeted Minor Girls.\" (Archive) Federal Bureau of Investigation. February 5, 2013. * Morris, Kevin. \"Man strips on camera for \"girlfriend\", gets blackmailed.\" The Daily Dot. May 6, 2013. * \"Kids blackmailed into online Sex.\" CNN. September 20, 2013. * Vives, Ruben. \"Glendale man sentenced to 5 years in 'sextortion' case.\" Los Angeles Times. December 9, 2013. * \"Sextortion scam email campaign has netted $143k in Bitcoin.\" Thexyz. November 13, 2018. Category:Sexual abuse Category:Revenge Category:Pornography Category:Sex crimes Category:Internet culture",
 "title": "Sextortion"
}