{
 "id": "112399",
 "text": "\"Simpsons Roasting on an Open Fire\" is the first episode of The Simpsons. It was first shown on television on December 17, 1989. It is the first time the Simpson family is seen on half-hour (30 minutes) television. In the episode, Bart Simpson gets a tattoo without permission from his mother Marge. Marge uses all of the money for Christmas to get the tattoo off. Homer's boss will not give him a bonus for Christmas. Homer gets a job to be Santa Claus at a shopping mall, but he does not get enough money. He loses more money when he loses a bet at dog racing. Santa's Little Helper, the dog they betted on, did bad at the race and is abandoned by his owner. Homer and Bart keep him as a pet for the family. Mimi Pond wrote the dialogue of the episode. David Silverman is the director of the episode. \"Simpsons Roasting on an Open Fire\" was nominated for two Emmy Awards in 1990. Critics of television gave good reviews for the episode. About 13.4 million people watched the episode when it was first shown on television. The Simpsons was first going to start with the episode \"Some Enchanted Evening\". The animation of that episode was not good enough at that time to be the first episode. == Story == The Simpson family go to the Christmas pageant at Springfield Elementary School. After that, Bart and Lisa write letters to Santa Claus. Lisa wants a pony and Bart wants a tattoo. Marge does not want Bart to get a tattoo. On the day after that, the family goes shopping at a mall. Bart gets a tattoo that says the word \"Mother\". He thinks that Marge will like it. Marge sees the tattoo and takes Bart to a dermatologist to get it removed. She has to use all of the money that would have been used for Christmas. She thinks that his husband Homer will get a bonus for Christmas. Homer works at a power plant. His boss Mr. Burns says that there will be no bonuses for Christmas. Homer wants to get more money, so he gets a side job as being Santa Claus at the mall. Bart goes to the mall on Christmas Eve. He takes Santa's beard off and sees that he is Homer. Bart apologizes and is happy that Homer is trying to get more money for the family. Homer does not get a lot of money because of tax deductions. His friend Barney Gumble tells him to go to a greyhound racing track. Homer bets all of his money on a dog named Santa's Little Helper. The dog does very bad at the race. His owner is angry and abandons him. Bart and Homer see Santa's Little Helper and keeps him as a pet. When they get home, Homer tries to tell the family that he did not get a bonus. The family is very happy to see Santa's Little Helper. == Production == === Start of The Simpsons === The Simpsons was made by Matt Groening. He got the idea for the show in the lobby of James L. Brooks's office. Brooks was the producer of The Tracey Ullman Show. Brooks wanted to make short films with Groening during comedy sketches in the show. Groening wanted to make his comic strip Life in Hell as short films. If he did this, he would have to give up his publication rights for Life in Hell. He did not want to, so he made the Simpson family. The family was first seen in the shorts on The Tracey Ullman Show. The first short they were in was on April 19, 1987. Groening gave the animators simple sketches. He thought that the animators would make them look better. The animators only made the sketches have color. This made the family look very rough in the shorts. In 1989, a few production companies wanted to make The Simpsons its own 30 minute television show. The episodes would be shown on the Fox Broadcasting Company. Brooks put a statement in a contract that said Fox can not make changes to the episodes. Groening said that he wanted to give the audience something that was not \"mainstream trash\" (bad things that many people know). The show started on December 17, 1989 with \"Simpsons Roasting on an Open Fire\". === How the episode was made === The Fox Broadcasting Company was worried about The Simpsons. They thought that their audience would get bored of the show. They said to the producers that one episode should have three stories that were 7 minutes, and that four episodes would be longer. They thought that this should happen until the audience liked the show. The producers got Fox to let them make 13 regular episodes. The show was going to start in Autumn of 1989 with the episode \"Some Enchanted Evening\". That episode had problems with its animation, so it could not be shown on television at the time. \"Simpsons Roasting on an Open Fire\" did not have the opening sequence. It was first put on the second episode (\"Bart the Genius\"). \"Simpsons Roasting on an Open Fire\" was the 8th episode made, but it was the first to be shown on television. This means that it has better animation than some of the episodes shown after this one. Part of the Christmas pageant is similar to an event Groening had in second grade. He had to talk about Christmas in Russia. He also talks about it in his comic strip Life in Hell. In the comic, a boy's grandmother is in Russia. He learns that his grandmother can not celebrate Christmas because it is illegal in Russia. Groening said that people thought the episode made another form of the song \"Jingle Bells\". While Lisa is on the Christmas pageant, she is seen to be not wearing anything lower than the waist. David Silverman said that she is wearing clothing, but the animators made it the same color as Lisa (yellow). This episode is the only one that was written by Mimi Pond. Al Jean made the name of the episode. It is an allusion to the song \"The Christmas Song\" (also named \"Chestnuts Roasting on an Open Fire\"). David Silverman is the director of the episode. Rich Moore made the storyboard and the design of Ned Flanders. Eric Stefani animated some parts of the episode. Barney Gumble is seen with blonde hair in the episode. His hair color was changed to brown because Groening wanted the Simpson family to only have yellow hair. These characters are first seen in the episode: Principal Skinner, Milhouse Van Houten, Sherri and Terri, Moe Szyslak, Mr. Burns, Barney Gumble, Patty and Selma, Ned Flanders, Todd Flanders, Santa's Little Helper, Snowball II, Dewey Largo, and Lewis. Waylon Smithers talks in a speaker, but he is not seen in the episode. == References == === Books === * == Other websites == * * * Category:1989 in American television Category:The Simpsons (season 1) episodes Category:Christmas television episodes Category:1980s television episodes",
 "title": "Simpsons Roasting on an Open Fire"
}