{
 "id": "1123753",
 "text": "Primos is an American animated television series made by Natasha Kline and played on Disney Television Animation. It came out on July 25, 2024 on Disney Channel. ==Summary== The show is about a big Mexican-American family living in Los Angeles. Told through the diary of nine-year-old Tater Ramirez Humphrey, the show is mostly about her as she finds the \"it factor\" that makes her special next to her cousins, who moved in with her for the summer. ==Voice cast== ===Main=== * Myrna Velasco as Tater Ramirez Humphrey, the show's nine- year-old protagonist with colorful braces. ====Tater's cousins==== * Elizabeth Grullón as Julita \"Lita\" Perez * Jonathan Melo as Scooter Perez * Rick Simon as Cousin Bud Humphrey and Ignacio \"Big Nacho\" Ramirez * Cristina Vee Valenzuela as Tere and Toñita Ramirez * Natasha Kline as Gordita Humphrey and ChaCha Ramirez * Nomi Ruiz as Tabi Ramirez * Becca Q. Co as LotLot Ramirez * Ryan Anderson Lopez as Nachito Ramirez * Sarah Tubert as Lucita Perez ===Recurring=== * Angélica María as Buela Ramirez, Tater's grandmother. * Melissa Villaseñor as Nellie Ramirez Humphrey, Tater's little, but taller sister. * Jim Conroy as Bud Humphrey, Tater's father. * Michelle Ortiz as Bibi Ramirez Humphrey, Tater's mother. * Cheech Marin as Pop Ramirez, Tater's grandfather. * Cristina Milizia as Bud Ramirez Humphrey, Tater's baby brother. * Liza Koshy as Serena, Tater's best friend. ===Guest=== * Joel \"The Kid Mero\" Martinez as Diego Perez, Lita, Scooter and Lucita's father and Tater's uncle. * Mark Consuelos as Ivan Ramirez, Tere, Tabi and Toñita's father and Tater's uncle. * Ricardo Chavira as Ignacio Ramirez, Big Nacho and Nachito's father and Tater's uncle. * Gabriel Iglesias as Gustavo Ramirez, LotLot's father and Tater's uncle. * Sarah Sherman as Carmela, Big Nacho's pen pal. * Sherry Cola as Ms. Mahoney * Kyle MacLachlan as Bill * Jaime Jarrín as Día de la Cultura Announcer ==Episodes== ==Shorts== ===A Piece of My Mind=== These shorts focus on Disney Channel cartoon people seeing their makers and learning how the idea of their shows were made. === Chibi Tiny Tales === A few days later, after the show came out, Primos joined the Chibi Tiny Tales show. ==Creation== ===Early Growth=== On November 3, 2021, it was said that Natasha Kline, a long-time cartoon artist and designer, is making a cartoon called Primos for Disney Television Animation (DTVA). The series was brought to life by Kline's summers as a child living with her cousins next to her extended Mexican-American family and she wanted the lead cartoon people to also be Mexican-American because of the very little Mexican-American shows on television when she was a child. Meredith Roberts, who is working at Disney Television Animation said the series has the \"real voice\" of Kline and \"her family's values\", saying the show will be pointed at kids and families. Edward Mejia, a DTVA worker, saw the show. On June 15, 2022, at the 2022 Annecy Worldwide Film Festival, it was said that the show's first season would have 30 episodes. Philip Cohen was announced as the show writer. In March 2023, Kline told Animation Magazine that the show was moved by an adult film she had made for an Standing People's Unit stand-up comedy show in 2017, was moved by Peanuts and Calvin and Hobbes, and said she loved working with the show's crew, liking their \"strong passion, drive, and talent\". On July 8, 2024, the show's official trailer was released. The show will make half-hour videos that are split into 11-minute stories. ==Release== Primos came out on Disney Channel on July 25, 2024, and the first nine videos of the show were added to Disney+ the next day. The first two videos came out to YouTube on July 25. ==Reviews== ===Before Release=== On June 13, 2023, the shows' opening song was sent by Disney Branded Television. It received bad reviews on social media, even from Mexicans and other Latin Americans. Some said it was like Nickelodeon's The Casagrandes. Other viewers argued that the opening song had many negative stereotypes, argued that the names of some characters and the setting were too usual, and that the Spanish grammar in the opening sequence was wrong. Also talked about was the use of \"yellow tint\", a way that was used in some American media to make a feeling of \"different\" in Mexican places. Online bad reviews kept on following social media posts made by Tater's voice actress Myrna Velasco, including a post on Instagram where she said critics of the Spanish used in the show were \"grammar Nazis\" and a story in which she described the Spanish language as being \"forced upon Latin American people\" by Spanish conquistadors. In a meeting on June 16, 2023, Kline said the show is based on her own events of growing up with a multicultural Mexican-American family in Los Angeles in the 1990s, being bicultural, biracial, and said that her project's relatability brought well-known individuals to her show, like Melissa Villaseñor. She also said that Tater doesn't speak Spanish, which is why her grammar is wrong; stated how important cousins were in her life; and said that the art style showed the things in L.A. She also hoped the show would make people proud of their roots. The interview is here Later, the name of the fake town was changed from Terremoto Heights to Hacienda Hills, as the other name had bad reviews for the earthquakes common in the region. The name of one of the cousins was changed from Cookita to Lucita, as the first name is close to a bad word in several languages of Latin American Spanish. As a result of online bad reviews, the show release was delayed several times. Changes were made for watchers to see that the show is set in Los Angeles and not in Latin America. ==Notes== ==References== == Other websites == * Category:Family",
 "title": "Primos (TV series)"
}