{
 "id": "1123164",
 "text": "The Cyrillic alphabets are based on the Cyrillic script. The early Cyrillic alphabet was developed in the 9th century and replaced the previous Glagolitic script created by Saints Cyril and Methodius. It's used in the alphabets of many different languages, both Slavic and non-Slavic. As of 2011, around 252 million people use it as the official alphabet for their national languages, with half of them being in Russia. Cyrillic is one of the most-used writing systems in the world. Some of these alphabets are shown below; for others, see the links. Sounds are written using the International Phonetic Alphabet (IPA). Most of these languages have phonemic spelling, but there are some very special cases. For example, in Russian, the letter \"г\" is pronounced /v/ in some words, like in его (yego), which is pronounced /jɪˈvo/ instead of /jɪˈɡo/. Unlike the Latin script, which adds marks to letters in order to change languages, the Cyrillic alphabet often creates new letter shapes instead. == Common letters == The table below shows the Cyrillic letters used in most national languages with a Cyrillic alphabet. Exceptions and additions for particular languages are noted below. Common Cyrillic letters Upright Italic Name(s) IPA А а А а A /a/ Б б Б б Be /b/ В в В в Ve /v/ Г г Г г Ge /g/ Д д Д д De /d/ Е е Е е Ж ж Ж ж Zhe З з З з Ze /z/ И и И и I /i/ Й й Й й /j/ К к К к Ka /k/ Л л Л л El М м М м Em /m/ Н н Н н En /n/ О о О о O /o/ П п П п Pe /p/ Р р Р р Er /r/ С с С с Es /s/ Т т Т т Te /t/ У у У у U /u/ Ф ф Ф ф Ef /f/ Х х Х х /x/ Ц ц Ц ц Tse /t͡s/ Ч ч Ч ч Che /t͡ʃ/ Ш ш Ш ш Sha /ʃ/ Щ щ Щ щ Shcha /ʃt͡ʃ/ Ы ы Ы ы Y /ɨ/ Э э Э э E /ɛ/ Ю ю Ю ю Я я Я я == Language-specific letters == Some languages may have letters that are not listed above, or may use special marks in certain letters. These are listed below by language. * Belarusian alphabet * Macedonian alphabet * Serbian alphabet * Ukrainian alphabet * Abkhaz alphabet * Kazakh alphabet * Mongolian alphabet * Tajik alphabet == References ==",
 "title": "Cyrillic alphabets"
}