{
 "id": "1124963",
 "text": "Devapala's Expedition in Northwest was fought between the Pala Empire, the Hunas and the Kambojas in the Northwest region of South Asia. The expedition was led by Devapala, the ruler of the Pala Empire. ==Background== Devapala, the ruler of the Pala Empire, was fighting the Tibetan Empire. Bhoja, the ruler of the Gurjara Dynasty, took advantage of the situation and attacked the Pala Empire. Bhoja's aggressive campaign put him in conflict with Devapala. After dealing with the Tibetan Empire, Devapala started a campaign against Bhoja. In this campaign, Devapala not only defeated Bhoja but also led campaigns against the Hunas and the Kambojas in the northwest. The Hūnas were a nomadic tribe from Central Asia, that had a significant impact on Indian history. However, they eventually lost their power. They continued to rule over some principalities in the Indian subcontinent. The Hūnas that Devapala, ruler of the Pala empire, invaded was the Huna principality located in the Uttarapatha. ==Campaign== The Hunas that Devapala, ruler of the Pala empire, invaded was the Huna principality located in the Uttarapatha. Devapala launched a campaign against the Hunas principality in the region of Uttarapatha and emerged victorious. He then waged war against the Kambojas in the same campaign after defeating the Hunas. Both the Hunas and the Kambojas were located at the outer reaches of the Pala Empire, which may explain Devapala's hostility towards them. Devapala is given credit for subduing both the Hunas and Kambojas, according to his inscription as well as the inscription that references his reign. ==Aftermath== Devapala had appointed a Buddhist priest named Indragupta from Nagarahara or Jalalabad in Afghanistan. Uttarapatha, which included parts of Punjab and the Northwestern territories, also had portions of the Kabul valley or Eastern Afghanistan, which was the homeland of the Kambojas. The inscription of King Devapala of the Pala empire from this period serves as evidence for this. The inscription mentions a place called Nagarahara near Jalalabad, which was in Uttarapatha. This statement is in agreement with the assertion \"Uttarapathe Purusapuramandale,\" as mentioned in a Pala period manuscript held in the Cambridge University library. Purusapura in the statement refers to Peshwar. ==References== Category:Pala Empire Category:Gurjara-Pratihara Dynasty Category:Battles involving the Pala Empire",
 "title": "Devapala's Expedition in Northwest"
}