{
 "id": "1124805",
 "text": "A can opener or tin opener is a tool used to open tin cans. ==History== ===18th century=== Food preserved in tin cans was in use by the Dutch Navy from at least 1772. Before 1800, there was already a small industry of canned salmon in the Netherlands. Freshly caught salmon were cleaned, boiled in brine, smoked and placed in tin-plated iron boxes. This canned salmon was known outside the Netherlands, and in 1797 a British company supplied one of their clients with thirteen cans. ===19th century=== Preservation of food in tin cans was patented by Peter Durand in 1810. The patent was acquired in 1812 by Bryan Donkin, who soon set up the world's first canning factory in London in 1813.https://www.sciencedirect.com/topics/agricultural-and-biological- sciences/canned-food The can opener consisting of the now familiar sharp rotating cutting wheel that runs round the can's rim to cut open the lid was invented in 1870, but was considered very difficult to operate for the ordinary consumer. ===20th century=== A more successful design came out in 1925 when a second, serrated wheel was added to hold the cutting wheel on the rim of the can. This easy-to-use design has become one of the most popular can opener models. ====World War II==== Around the time of World War II (WWII), several can openers were developed for military use, such as the American P-38 and P-51. These featured a robust and compact design with a pull cutting blade hinged to a corrugated handle with a pivot. ====Cold War==== Electric can openers were introduced in the late 1950s and met with success. The development of new can opener types continues with a recent redesign of a side-cutting model.https://www.foodnetwork.com/how- to/packages/shopping/product-reviews/best-can-openers ==Twist key can-opener== Also called tin can key can-opener. During the 1800s, the canning process was mechanised and refined, with can walls becoming thinner. The twist-key can- opener was patented by J. Osterhoudt in 1866. There still was no general- purpose can-opener, thus each can came with a spot-welded or soldered-on twist-key can-opener which snapped off after fatiguing the metal by bending at a thin region. Each food-type had its own can-type, and came with its own can- opener-type. Tinned fish and meat were sold in rectangular cans. These cans were fitted with a twist-key that would roll around the top of the can, peeling back a pre-scored strip. Coffee, beans, and most other types of meat were packaged in cylinders with metal strips that could be peeled back with their own kinds of built-in keys that would roll around the top of the can. Cans of milk used puncture devices. ==References== Category:Tools Category:Kitchenware Category:Cooking appliances",
 "title": "Can opener"
}