{
 "id": "1124700",
 "text": "NG-21 is the twenty-first flight of the Cygnus, an expendable American cargo spacecraft used for International Space Station (ISS) logistics missions. It launched on 4 August 2024. NG-21 is the tenth Cygnus mission operated by Northrop Grumman under a contract with NASA. == History == Cygnus was developed by Orbital Sciences Corporation and partially funded by NASA. The NG-21 spacecraft is an Enhanced Cygnus, named the S.S. Francis R. \"Dick\" Scobee in honor of the NASA astronaut who died in the Space Shuttle Challenger disaster. === Replacement of Antares 230+ rockets === NG-21 is the second launch of a Cygnus spacecraft after Northrop Grumman ran out of its Antares 230+ rockets. The Antares used a Russian-built engine and Ukrainian-built first stage, and production ceased after the Russian invasion of Ukraine. In response, Northrop Grumman began planning to use its next-generation Antares 300 rocket, which does not depend on Ukrainian or Russian parts, to fly NG-23. In the meantime, the company contracted with its CRS competitor SpaceX to launch NG-20, 21 and 22 using its Falcon 9 Block 5 rocket. == Development == To create Cygnus, Orbital paired the Multi-Purpose Logistics Module, built by Thales Alenia Space and previously used by the Space Shuttle for ISS logistics, with a service module based on Orbital's GEOStar, a satellite bus. The larger Enhanced Cygnus was introduced in 2015. Orbital Sciences was renamed Orbital ATK in 2015. Northrop Grumman purchased Orbital in 2018 and has continued to operate Cygnus missions. == Production and operations == Cygnus spacecraft are produced and put together in Dulles, Virginia. Once it arrives at the launch site, the Cygnus service module is paired with the pressurized cargo module. NG-21 was the sixteenth flight of the Enhanced-sized Cygnus Pressurized Cargo Module. Mission operations are conducted from control centers in Dulles, Virginia and Houston, Texas. Category:2020s in spaceflight Category:2024",
 "title": "Cygnus NG-21"
}