{
 "id": "112468",
 "text": "The Autonomous Province of Kosovo and Metohija, or in ; in Albanian: Krahina Autonome e Kosovës dhe Metohisë, commonly known as Kosovo and Metohija, or in ; in Albanian: Kosova dhe Metohija, or Kosovo, or in ; in Albanian: Kosova, for short, and abbreviated as KiM or Kosmet from Kosovo and Metohija; means the area of Kosovo as the Constitution of Serbia says. The land is disputed between Serbia and the self-declared Republic of Kosovo, which currently has actual control over the land. Before the Republic of Kosovo, the area was controlled by Serbia (while Serbia was part of Yugoslavia) between 1912 and 1999. The Constitution and laws of Serbia say that Kosovo in the southern part of Serbia and covers the areas of Kosovo and Metohija. The capital is Pristina. In the past, Kosovo was an autonomous province of Serbia when Serbia was part of Socialist Yugoslavia (1946–1990). When Socialist Yugoslavia ended in 1990, Kosovo became part of Serbia until the Kosovo War (1998–99). After the war, it became a United Nations (UN) controlled area due to United Nations Security Council Resolution 1244 but legally it was still part of Serbia. In that time, the United Nations Interim Mission in Kosovo (UNMIK) governed. In 2008, some Albanian politicians said that Kosovo would be its own country. 98 member countries of the United Nations agree, but Serbia does not. It still thinks that Kosovo is part of it. In 1990, when Kosovo was part of Yugoslavia, Slobodan Milošević's Anti-bureaucratic Revolution happened. This meant that Kosovo's government became less powerful and that Serbia had more control, like in 1971–74. That year, Kosovo's Albanian majority and also the Republic of Albania agreed with the declaration of independence of the Republic of Kosova. Because of the Kosovo War in 1999, the Serbian army was kicked out of Kosovo. In February 2008, the Republic of Kosovo declared independence. Serbia does not agree, but in the Brussels agreement of 2013, it got rid of the Autonomous Province of Kosovo and Metohija government.. Kosovo's independence is currently recognized by 95 UN member states.Dačić: Centralnoafrička republika povukla priznanje Kosova; Priština: Nevažno je šta kaže Dačić | Insajder In 2013, the Serbian government said it was getting rid of the Serb minority councils it had made in northern Kosovo, in order to allow the Kosovo Serb minority to become more like the general population of Kosovo.Serbia Pulls Plug on North Kosovo Assemblies ==References== Category:History of Kosovo Category:Autonomous areas Category:Former countries in Europe Category:Geography of Serbia Category:Territorial disputes",
 "title": "Autonomous Province of Kosovo and Metohija"
}