{
 "id": "1124217",
 "text": "In Alaska, there are four political parties, three limited political parties, and nine political groups. Each of them is recognized by the goverment of Alaska. == List of Recognized Political Parties == Recognized Political Parties in Alaska have ballot access in all elections. There are four of them. Party Chairman Beliefs Headquarter Location Ref. Alaska Democratic Party Mike Wenstrup Modern Liberalism Anchorage, Alaska Alaska Libertarian Party Nicholas Conrad Libertarianism Anchorage, Alaska Alaska Republican Party Carmela Warfield Conservatism Unionism Anchorage, Alaska Alaskan Independence Party John Wayne Howe Alaska nationalism Libertarian conservatism Social conservatism Fairbanks, Alaska == List of Limited Political Parties == Limited Political Parties in Alaska have ballot access in only elections for President. There are three of them. Party Chairman Beliefs Headquarter Location Ref. Alaska Constitution Party Karen Murray Christian Conservatism Houston, Alaska Aurora Party Marc Belk Progressivism Socialism Anchorage, Alaska No Labels Party Darrell Brown, Sr. Centrism Palmer, Alaska == List of Political Groups == Political Groups in Alaska do not have ballot access. They are just groups of people the goverment registers. There are nine of them. Party Chairman Beliefs Headquarter Location Ref. Alliance Party of Alaska Hezekiah \"Ky\" HollandFormer Election Reform Anchorage, Alaska Freedom Reform PartyAlaska Branch of the Reform Party G. “AK” Richardson Centrism Reno, Nevada Green Party of AlaskaNot connected with National Green Party Robert Shields Green Politics Fairbanks, Alaska Has ballot access due to Jasmine Sherman Moderate Party of Alaska Danny Alkasmi Centrism Wallinford, Iowa OWL Party James Jarrett Humanism Anchorage, Alaska == Parties trying to become official == Besides the parties and groups listed above, a few parties are trying to become official in Alaska: Party Chairman Beliefs Headquarter Location Ref. Green Party of the United States Joseph Naham Green Politics Takoma Park, Maryland == References == Category:Politics of Alaska",
 "title": "Political parties and groups in Alaska"
}