{
 "id": "1124621",
 "text": "Suffrage drama, also known as suffrage plays or suffrage theatre, is a type of play that started during the British women's suffrage movement in the early 1900s. These plays were popular from around 1907 to 1914. Many suffrage plays featured mostly or only female actors. They highlighted the issues of the suffrage movement and showed the unfair treatment women faced daily. Suffrage theatre was a type of realistic theatre, inspired by the works of Henrik Ibsen. It used everyday situations and characters to make the stories feel more real. == Pro-Suffrage plays == Suffrage dramas that support women's right to vote often show strong female characters who are smart and well-informed. These characters challenge old stereotypes that said women shouldn't vote. In the plays, these characters often persuade people who are against women's suffrage to change their minds and support it. Some plays make fun of people who are against women's suffrage, showing them as foolish or narrow-minded. Many of these plays used few props and no sets to keep costs low. This allowed amateur acting groups to perform them cheaply and spread the message about women's suffrage. Because they were inexpensive to put on, suffrage plays were often performed in private homes and small theaters. The UK had many prominent suffragist playwrights, including Cicely Hamilton, George Bernard Shaw, Beatrice Harraden, and Bessie Hatton. Today, plays about women's suffrage are still written and performed in Britain, such as Ian Flint's Woman (2003), Rebecca Lenkiewicz's Her Naked Skin (2008), and Sally Sheringham's The Sound of Breaking Glass (2009).Croft, Susan (2009). Votes for Women and Other Plays. London: Aurora Metro. pp. 216–243. . While most suffrage dramas were written by British authors, some American writers also contributed to pro-suffrage plays. Notable American writers include Charlotte Perkins Gilman, who wrote Three Women, Something to Vote For, and The Ceaseless Struggle of Sex: A Dramatic View. Inez Milholland, a suffragist and World War I correspondent, wrote If Women Voted. The National American Woman Suffrage Association (NAWSA) saw theatre as a good way to promote suffrage and provided these plays to both professional and amateur theatres. == Anti-Suffrage plays == Some of the earliest plays about women's suffrage were actually against giving women the vote. These plays made fun of the idea of equal gender roles by showing women as unable to handle the same responsibilities as men or portraying suffragists as strange and unattractive. There hasn't been much research on how common or popular these anti-suffrage plays were. One notable example is The Spirit of Seventy-Six; or, The Coming Woman, A Prophetic Drama (1868) by Ariana Randolph Wormeley Curtis and Daniel Sargent Curtis. This play moved from small performances to being widely popular in the United States. It was written after the Civil War when many abolitionists began to focus on new issues, like women's suffrage. The play is a fantasy that imagines life if women and men switched roles. In it, women wear men's clothes, smoke cigars, and hold political offices, while men try to manage household duties. The play suggests that giving women the vote would make them overly masculine and implies that radical suffrage activists are trying to hide their own flaws or lack of skills.Friedl, Bettina. On To Victory: Propaganda Plays of the Woman Suffrage Movement. Northeastern, 1990. Print. == References == Category:20th century Category:Theatrical genres",
 "title": "Suffrage drama"
}