{
 "id": "112470",
 "text": "The French Grand Prix (1906-1967: Grand Prix de l'ACF, 1968-2022: Grand Prix de France) was a race held as part of Fédération Internationale de l'Automobile's (FIA) annual Formula One (F1) automobile racing championships. Grand Prix motor racing started in France. The French Grand Prix was open to international competition. It is the oldest Grand Prix race. It was first run on 26 June 1906, under the Automobile Club de France in Sarthe. The first race had a starting field of 32 automobiles. == History == The first World Championships were organized in 1925. It included the French Grand Prix, the Italian Grand Prix, the Belgian Grand Prix and the Indianapolis 500. The French Grand Prix was part of the Formula One championships from their start in 1950. The last F1 Grand Prix was held in 2008. It was called the European Grand Prix four times between 1924 and 1966. During this time, the title was an honorary name. It was given to one grand prix race held in Europe each year The race has been held at several racetracks in France, such as the Autodrome de Montlhéry. Since 1991 its permanent home was the Circuit de Nevers Magny- Cours (often called just Magny-Cours). The move to Magny-Cours was an attempt to stimulate the economy of the area, but many within Formula One complained about the remote nature of the circuit. On 29 March 2007 it was announced by the FFSA, the race promoter, that the 2008 French Grand Prix was put on an indefinite \"pause\". This suspension was due to the financial problems of the circuit. Many in F1 did not like the circuit because of the remote location. On 31 May, Bernie Ecclestone confirmed that the 2007 French Grand Prix would be the last to be held at Magny-Cours. After negotiations, the future of the race improved. Ecclestone himself stating \"We're going to maybe resurrect it for a year, or something like that\". On 24 July, Ecclestone and the Prime Minister of France met. They agreed to try to keep the race at Magny-Cours for 2008 and 2009. On 27 July, when the FIA published the calendar with a French Grand Prix scheduled at Magny-Cours. The 2009 race, however, was again cancelled on 15 October 2008, with the official website citing \"economic reasons\". == The future == A major remodeling project of Magny-Cours (\"2.0\") was planned, but canceled in the end. FFSA, the race's promoter, started looking for an another host circuit. There were five different proposals for a new circuit. One in Rouen with 3 possible layouts: a street circuit, in the dock area, or a permanent circuit near the airport. A street circuit located near Disneyland Resort Paris. A location in Versailles. And one in Sarcelles (Val de France). They were all were canceled. A final location in Flins-Les Mureaux, near the Flins Renault Factory was considered, that was canceled as well on 1 December 2009. In 2010 and 2011, there was no French Grand Prix on the Formula 1 calendar, although the Paul Ricard Circuit has proposed itself for 2012. The French Grand Prix was not included in the released 2012 schedule. == Sponsors == *Rhône-Poulenc Grand Prix de France 1988-1993 *Mobil 1 Grand Prix de France 1998-2004 *Allianz Grand Prix de France 2005-2007 *RBS Grand Prix de France 2008 *Pirelli Grand Prix de France 2018-2019, 2021 *Lenovo Grand Prix de France 2022 == Winners of the French Grand Prix == === Repeat winners (drivers) === Number of wins Driver Years 8 Michael Schumacher 1994, 1995, 1997, 1998, 2001, 2002, 2004, 2006 6 Alain Prost 1981, 1983, 1988, 1989, 1990, 1993 4 Louis Chiron 1931, 1934, 1937, 1947 Juan Manuel Fangio 1950, 1951, 1954, 1957 Nigel Mansell 1986, 1987, 1991, 1992 3 Jack Brabham 1960, 1966, 1967 Jackie Stewart 1969, 1971, 1972 2 Christian Lautenschlager 1908, 1914 Felice Nazzaro 1907, 1922 Georges Boillot 1912, 1913 Giuseppe Campari 1924, 1933 Robert Benoist 1925, 1927 William Grover-Williams 1928, 1929 Jean-Pierre Wimille 1936, 1948 Dan Gurney 1962, 1964 Jim Clark 1963, 1965 Ronnie Peterson 1973, 1974 Mario Andretti 1977, 1978 Niki Lauda 1975, 1984 Active drivers are in bold. Event that were not part of the Formula One World Championship have a pink background. Event that were part of the pre-war European Championship have a cream background. Louis Chiron won the 1931 race, but shared the win in the Bugatti with Achille Varzi. Juan Manuel Fangio won the 1951 race, but shared the win in the Alfa Romeo 159-car with Luigi Fagioli. === Repeat winners (constructors) === # of wins Constructor Years won 17 Ferrari 1952, 1953, 1956, 1958, 1959, 1961, 1968, 1975, 1990, 1997, 1998, 2001, 2002, 2004, 2006, 2007, 2008 8 Williams 1980, 1986, 1987, 1991, 1992, 1993, 1996, 2003 7 Lotus 1963, 1965, 1970, 1973, 1974, 1977, 1978 6 Bugatti 1926, 1928, 1929, 1930, 1931, 1936 Alfa Romeo 1924, 1932, 1934, 1948, 1950, 1951 Renault 1906, 1979, 1981, 1982, 1983, 2005 5 McLaren 1976, 1984, 1988, 1989, 2000 4 Brabham 1964, 1966, 1967, 1985 2 Peugeot 1912, 1913 Mercedes 1908, 1914 Fiat 1907, 1922 Delage 1925, 1927 Mercedes-Benz 1935, 1938 Talbot-Lago 1947, 1949 Maserati 1933, 1957 Tyrrell 1971, 1972 Benetton 1994, 1995 Active constructors are in bold. Event that were not part of the Formula One World Championship have a pink background. Event that were part of the pre-war European Championship have a cream background. === By year === Year Driver Constructor Location Max Verstappen Red Bull-RBPT Paul Ricard Full Circuit Max Verstappen Red Bull-Honda Paul Ricard Full Circuit 2020 Cancelled due to the COVID-19 pandemic Lewis Hamilton Mercedes Paul Ricard Full Circuit Lewis Hamilton Mercedes Paul Ricard Full Circuit 2017 - 2009 Not held 2008 Felipe Massa Ferrari Magny-Cours 2007 Kimi Räikkönen Ferrari Magny-Cours 2006 Michael Schumacher Ferrari Magny-Cours 2005 Fernando Alonso Renault Magny-Cours 2004 Michael Schumacher Ferrari Magny-Cours 2003 Ralf Schumacher Williams-BMW Magny-Cours 2002 Michael Schumacher Ferrari Magny-Cours 2001 Michael Schumacher Ferrari Magny-Cours 2000 David Coulthard McLaren-Mercedes Magny-Cours 1999 Heinz-Harald Frentzen Jordan-Mugen-Honda Magny-Cours 1998 Michael Schumacher Ferrari Magny-Cours 1997 Michael Schumacher Ferrari Magny-Cours 1996 Damon Hill Williams-Renault Magny-Cours 1995 Michael Schumacher Benetton-Renault Magny-Cours 1994 Michael Schumacher Benetton-Ford Magny-Cours 1993 Alain Prost Williams-Renault Magny-Cours 1992 Nigel Mansell Williams-Renault Magny-Cours 1991 Nigel Mansell Williams-Renault Magny-Cours 1990 Alain Prost Ferrari Paul Ricard Short Circuit 1989 Alain Prost McLaren-Honda Paul Ricard Short Circuit 1988 Alain Prost McLaren-Honda Paul Ricard Short Circuit 1987 Nigel Mansell Williams-Honda Paul Ricard Short Circuit 1986 Nigel Mansell Williams-Honda Paul Ricard Short Circuit 1985 Nelson Piquet Brabham-BMW Paul Ricard Full Circuit 1984 Niki Lauda McLaren-TAG Dijon 1983 Alain Prost Renault Paul Ricard Full Circuit 1982 René Arnoux Renault Paul Ricard Full Circuit 1981 Alain Prost Renault Dijon 1980 Alan Jones Williams-Ford Paul Ricard Full Circuit 1979 Jean-Pierre Jabouille Renault Dijon 1978 Mario Andretti Lotus-Ford Paul Ricard Full Circuit 1977 Mario Andretti Lotus-Ford Dijon 1976 James Hunt McLaren-Ford Paul Ricard Full Circuit 1975 Niki Lauda Ferrari Paul Ricard Full Circuit 1974 Ronnie Peterson Lotus-Ford Dijon 1973 Ronnie Peterson Lotus-Ford Paul Ricard Full Circuit 1972 Jackie Stewart Tyrrell-Ford Charade 1971 Jackie Stewart Tyrrell-Ford Paul Ricard Full Circuit 1970 Jochen Rindt Lotus-Ford Charade 1969 Jackie Stewart Matra-Ford Charade 1968 Jacky Ickx Ferrari Rouen-Les-Essarts 1967 Jack Brabham Brabham-Repco Le Mans-Bugatti 1966 Jack Brabham Brabham-Repco Reims 1965 Jim Clark Lotus-Climax Charade 1964 Dan Gurney Brabham-Climax Rouen-Les-Essarts 1963 Jim Clark Lotus-Climax Reims 1962 Dan Gurney Porsche Rouen-Les-Essarts 1961 Giancarlo Baghetti Ferrari Reims 1960 Jack Brabham Cooper-Climax Reims 1959 Tony Brooks Ferrari Reims 1958 Mike Hawthorn Ferrari Reims 1957 Juan Manuel Fangio Maserati Rouen-Les-Essarts 1956 Peter Collins Ferrari Reims 1955 Cancelled due to 1955 Le Mans disaster 1954 Juan Manuel Fangio Mercedes Reims 1953 Mike Hawthorn Ferrari Reims 1952 Alberto Ascari Ferrari Rouen-Les-Essarts 1951 Luigi Fagioli Juan Manuel Fangio Alfa Romeo Reims 1950 Juan Manuel Fangio Alfa Romeo Reims 1949 Louis Chiron Talbot-Lago Reims 1948 Jean-Pierre Wimille Alfa Romeo Reims 1947 Louis Chiron Talbot-Lago Lyon-Parilly 1946 - 1940 Not held due to World War II 1939 Hermann Paul Müller Auto Union Reims 1938 Manfred von Brauchitsch Mercedes-Benz Reims 1937 Louis Chiron Talbot Montlhéry 1936 Jean-Pierre Wimille Raymond Sommer Bugatti Montlhéry 1935 Rudolf Caracciola Mercedes-Benz Montlhéry 1934 Louis Chiron Alfa Romeo Montlhéry 1933 Giuseppe Campari Maserati Montlhéry 1932 Tazio Nuvolari Alfa Romeo Reims 1931 Louis Chiron Achille Varzi Bugatti Montlhéry 1930 Philippe Étancelin Bugatti Pau 1929 William Grover-Williams Bugatti Le Mans 1928 William Grover-Williams Bugatti Saint-Gaudens 1927 Robert Benoist Delage Montlhéry 1926 Jules Goux Bugatti Miramas 1925 Robert Benoist Albert Divo Delage Montlhéry 1924 Giuseppe Campari Alfa Romeo Lyon 1923 Henry Segrave Sunbeam Tours 1922 Felice Nazzaro Fiat Strasbourg 1921 Jimmy Murphy Duesenberg Le Mans 1920 - 1915 Not held due to World War I 1914 Christian Lautenschlager Mercedes Lyon 1913 Georges Boillot Peugeot Amiens 1912 Georges Boillot Peugeot Dieppe 1911 - 1909 Not held 1908 Christian Lautenschlager Mercedes Dieppe 1907 Felice Nazzaro Fiat Dieppe 1906 Ferenc Szisz Renault Le Mans Event that were not part of the Formula One World Championship have a pink background. Event that were part of the pre-war European Championship have a cream background. ==Broadcasting== ===United Kingdom=== Year Network Lap-by-lap Colour commentator(s) Sky Sports F1 David Croft Martin Brundle Channel 4 Ben Edwards David Coulthard ITV James Allen Martin Brundle ITV James Allen Martin Brundle ITV James Allen Martin Brundle ITV James Allen Martin Brundle ITV James Allen Martin Brundle ITV James Allen Martin Brundle F1 Digital+ Ben Edwards John Watson ITV James Allen Martin Brundle ITV James Allen Martin Brundle ITV James Allen Martin Brundle ITV Murray Walker Martin Brundle ITV Murray Walker Martin Brundle ITV Murray Walker Martin Brundle BBC Two Murray Walker Jonathan Palmer Eurosport Ben Edwards John Watson BBC Two Murray Walker Jonathan Palmer Eurosport Ben Edwards John Watson BBC One Murray Walker Jonathan Palmer Eurosport Allard Kalff John Watson BBC One Murray Walker Jonathan Palmer Eurosport Allard Kalff John Watson BBC One Murray Walker James Hunt Eurosport Allard Kalff John Watson BBC Two Murray Walker James Hunt Eurosport Richard Nicholls John Watson BBC Two Murray Walker James Hunt Eurosport Richard Nicholls John Watson BBC Two Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC One Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC One BBC Two Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC Two Murray Walker BBC Two Murray Walker BBC Two Murray Walker BBC One Raymond Baxter BBC One Raymond Baxter BBC One Raymond Baxter BBC One Raymond Baxter BBC Television Raymond Baxter BBC Television Raymond Baxter BBC Television Raymond Baxter BBC Television Robin Richards BBC Television 1985, Race started on BBC One but coverage of the race moved to BBC Two because of other scheduled programming. == References == == Other websites == * French Grand Prix Results, Live Timing, Quiz & Discussion * Site officiel du Circuit de Nevers Magny-Cours * Official Website of the French Grand Prix Category:Formula One Grands Prix",
 "title": "French Grand Prix"
}