{
 "id": "1125051",
 "text": "The men's marathon was a race that was created for the Athletics at the 1896 Summer Olympics. Seventeen athletes from 5 nations were in the race. Spyridon Louis won the marathon. His win was the only win for Greece in the 1896 Summer Olympics. ==Background== Michel Bréal created the idea of a race from the city of Marathon to Athens. It was inspired by the legend of Pheidippides. The first ever marathon race was a Greek qualification race for the 1986 olympics. The marathon was won by Charilaos Vasilakos. In 1896, the length of the marathon was only 40 km (25 mi). 25 athletes went to Marathon to run in the race. However, only 17 people actually ran in the race. At least one woman, Stamata Revithi, tried to run in the race. However, she was not allowed to run. The official reason she was not allowed to run was because she entered after the deadline. The actual reason she was not allowed to run was because she was a woman. She ran the course by herself the next day in 5½ hours.Martin & Gynn, Running through the Ages, 22; Tarasouleas, Stamata Revithi, \"Alias Melpomeni\", 55; Tarasouleas, The Female Spiridon Loues, 12. However, some of the authors who believe that \"Melpomene\" and Revithi are the same person attribute to the latter the more favorable time of 4½ hours. E.g. Miragaya, The Female Olympian, 314, who cites It was also possible that a woman named Melpomene tried to run in the race. It is not sure whether it was a second who tried to run, or if it was Revithi.Martin & Gynn, Running through the Ages, 20–21 ==Schedule== The runners went to the town of Marathon on Thursday night. They started the race at a bridge at 2 p.m. on Friday.Official Report, p. 86. Date Time Round Gregorian Julian Friday, 10 April 1896 Friday, 29 March 1896 14:00 Final ==Summary== Albin Lermusiaux went to the front of the race when the race started. Edwin Flack and Arthur Blake stayed in second and third place. Blake quit the race at 23 kilometres. At 32 kilometres, Lermusiaux also quit. This meant that Flack was in front. Flack would not be in the front of the race for a long time. Spyridon Louis began moving to the front of the race. At the 37th kilometre, Flack was very tired and quit the race. This meant that Louis was alone in the front. Louis finished the race with a time below 3 hours. Charilaos Vasilakos was in second place. Spyridon Belokas finished soon after. Gyula Kellner finished 5 seconds behind Belokas. This made Kellner in 4th place. However, after the race, Kellner said that Belokas used a carriage to go through part of the course. Belokas was disqualified and Kellner was put into 3rd place. ==Results== Rank Athlete Nation Time Notes Spyridon Louis 2:58:50 Charilaos Vasilakos 3:06:03 Gyula Kellner 3:06:35 4 Ioannis Vrettos Unknown 5 Eleftherios Papasymeon Unknown 6 Dimitrios Deligiannis Unknown 7 Evangelos Gerakeris Unknown 8 Stamatios Masouris Unknown 9 Sokratis Lagoudakis Unknown — Edwin Flack (37 km) Albin Lermusiaux (32 km) Ioannis Lavrentis (24 km) Georgios Grigoriou (24 km) Arthur Blake (23 km) Ilias Kafetzis (9 km) Dimitrios Christopoulos (? km) — Spyridon Belokas ~~3:06:30~~ ==Records== At the time, Marathon distances were not agreed on, so the records are not recognized. The best time in a qualifying race was by Ioannis Lavrentis. This record was created during the competition: Date Event Athlete Nation Distance (m) Record April 10 Final Spyridon Louis 2:58:50 ==References== * (Digitally available at la84foundation.org ) * (Excerpt available at la84foundation.org ) * ;Specific Men's marathon Category:Marathons",
 "title": "Athletics at the 1896 Summer Olympics – Men's marathon"
}