{
 "id": "1125344",
 "text": "The men's foil was one of the fencing events in the 1896 Summer Olympics. It was on 7 April. There were 8 fencers. There was 2 semifinal round-robin rounds. The first semifinal round had Perikles Pierrakos-Mavromichalis, Henri de Laborde, Henri Callot, and Ioannis Poulos. The second semifinal round had Konstantinos Komninos-Miliotis, Georgios Balakakis, Eugène-Henri Gravelotte, and Athanasios Vouros. Callot and Gravelotte won every round in their groups. They went against each other in the final round. Pierrakos-Mavromichalis and Vouros were both given third place. ==Background== The foil has been at every Summer Olympics except 1908. ==Competition format== The event had a semifinal round. After the semifinals, there was a final. You would win a match if you \"touched\" a player three times. The normal foil rules were used. However, there was a different rule that the president could give someone a touch if the defender did not defend himself correctly. The semifinals had 2 rounds. Each of these had 4 fencers. The fencers played everyone else in their round. The winner of each pool would go to the final round. The final round was a single round with two fencers.Official Report, p. 65. ==Schedule== The fencing started at 10 a.m.. It was on the 2nd day of events. Date Date Time Round Gregorian Julian Time Round Tuesday, 7 April 1896 Tuesday, 26 March 1896 10:00 Semifinals Final ==Results== ===Semifinals=== ====Semifinal A==== It was written that de Laborde lost to Poulos, 3–1. However, other sources say that de Laborde won 3–2. In the table, it shows the 3-2 version.Official Report, p. 67. ====Semifinal B==== ===Final=== ==Final classification== This is the results according to the IOC. Rank Fencer Nation Eugène-Henri Gravelotte Henri Callot Perikles Pierrakos-Mavromichalis Athanasios Vouros 5 Henri de Laborde 6 Konstantinos Komninos-Miliotis 7 Georgios Balakakis 8 Ioannis Poulos ==References== * (Digitally available at ) * (Excerpt available at ) * Men's amateur foil",
 "title": "Fencing at the 1896 Summer Olympics – Men's foil"
}