{
 "id": "1125680",
 "text": "Lee Hyeon-seo (, born January 1980) is a North Korean defector and activist. She is known for her book, The Girl with Seven Names. Lee lives in Seoul, South Korea. She is a student. She escaped North Korea and later helped her family escape through China and Laos. == Early life in North Korea == Lee Hyeon-seo grew up in Hyesan, North Korea, believing her country was the best and feeling proud, even though she saw a public execution at age seven. Despite her family's relative comfort, the North Korean famine caused widespread suffering and death. == Escape == === China === In 1997, Lee crossed the frozen Yalu River with the help of a friendly border guard. She only meant to stay for a little while and then go back. But things got complicated, and she had to live with her relatives in China as an illegal immigrant. Lee bought the identity of a mentally challenged girl from Heilongjiang. With it, she got a passport and driver's license. At one point, after being accused of being North Korean, she was interrogated by police and tested on her Chinese language skills and what she knew about China. Thanks to her father's insistence that she learn Chinese when she was younger, she was able to pass the test. === South Korea === After 10 years of being a fugitive in China, Lee managed to escape to South Korea.Upon arriving at Incheon International Airport in January 2008, she identified herself as an asylum- seeker. Officials quickly took her to another room to check her papers and verify her identity. They warned her that if she broke Korean law, she would be detained and then deported back to China. Lee requested that they contact the National Intelligence Service, which then transported her to downtown Seoul three hours later. She went through an orientation for life in South Korea and was given a house to live in. At first, she felt both scared and excited, but settling in was harder than she expected. She noticed significant differences between North and South Korea in education, culture, and language, despite their shared ethnicity. She endured anti-North Korean prejudice and sometimes thought \"It would be so much easier to return to China.\" However, after a year of confusion, she eventually found meaning in her new life. == Family Escape == Lee learned that North Korean police had intercepted money she sent to her family and that her mother and brother were about to be sent to a remote area. Worried and knowing they couldn’t speak Chinese, she decided to go back for them. She returned to China, met her family in Changbai, and her brother helped their mother cross the border. She guided them on a 2000-mile journey through China, where they nearly got caught several times. When stopped and questioned by a police officer, Lee claimed her family was deaf and mute and didn’t speak Chinese. The officer believed her and let them go. At the Lao border, Lee paid a broker to help her mother and brother get to the South Korean Embassy in Vientiane. However, while she was traveling to China to return to South Korea, she learned that her mother and brother had been caught crossing the border. She then traveled to Luang Namtha, Laos, where she paid a bribe and fine. After a month of ordeals her family members were released. She traveled with them to Vientiane, but her family was arrested and jailed near the South Korean embassy. Lee went back and forth between the immigration office and the National Police Agency for almost 50 days, \"desperately trying to get my family out … but I didn't have enough money to pay the bribes. I lost all hope.\" An English-speaking Australian named Dick Stolp helped her by paying the remaining amount needed for her family and two other North Koreans to get out of jail. When she asked why he was helping, he said it was for the North Korean people, not just her. She saw this as a significant moment that represented hope and the support of strangers and the international community for North Koreans. She later said that this encounter marked the moment \"when my view of the world changed and I realized there were many good people on this planet. I also realized how precious life is.\" Soon she and her family were living in South Korea. == Current life == In 2011, Lee wrote that she was learning English \"to boost [her] prospects,\" noting that North Koreans' \"lack of English is a handicap\" on the job market. In China, she spent a lot of time learning Chinese but didn't expect to face so much stress about the language in South Korea. She worked part-time, took accounting classes, and earned the necessary certifications. In 2011, she was specially admitted to the Chinese language department at Hankuk University of Foreign Studies, hoping to be involved in growing trade with China. She noted that she was working as a student journalist at South Korea's Ministry of Unification with South Korean college students, writing about North-South Korea relations and reunification. Additionally, she was one of 50 North Korean escapees in the 'English for the Future' program sponsored by the British Embassy in Seoul, which helps her maintain her English studies. She was doing volunteer work \"out of gratitude for all the aid [she has] received since [she] came here and of hope to return the favor to other people in need.\" As of May 2014, Lee was still studying at the Hankuk University of Foreign Studies and working as a student journalist with the Ministry of Unification. === Activist work === Lee shared her experiences at a TED conference in Long Beach, California. Her talk has over 18 million views on YouTube. In May 2013, she reunited with Australian Dick Stolp on an Australian TV program, where she praised him as a modern hero. Stolp felt proud to see her doing good work and felt he had helped her change her life. She has been interviewed by the BBC, CNN, CBS News, and many other TV and radio outlets around the world. Lee has also been interviewed by major media outlets worldwide, spoke at the Oslo Freedom Forum in May 2014, and executive produced the PBS documentary Beyond Utopia about South Korean pastor Kim Sungeun, which aired on January 9, 2024. == References == Category:1980 births Category:Living people Category:North Korean people",
 "title": "Lee Hyon-seo"
}