{
 "id": "1125586",
 "text": "On 8 August 2024, at 16:42 JST (07:42 UTC), a magnitude 7.1 earthquake happened in Miyazaki Prefecture, Kyushu, Japan, northeast of Nichinan. == Tectonic setting == The Hyūga Sea is in the southwestern part of the Nankai Trough, where the Philippine Sea Plate moves under the Eurasian Plate. This area has had big earthquakes in 1968 and 1996. The Hyūga Sea is a zone between two different parts of the Nankai Trough. Below the sea floor, there are small earthquakes and slow movements in the deeper part of the zone. == Earthquake == The United States Geological Survey reported a magnitude () of 7.1, at a depth of and a maximum Modified Mercalli intensity of VII (Very Strong). The United States Geological Survey first reported two earthquakes with magnitudes 7.1 and 6.9, but then fixed it later. Locations with a seismic intensity of Shindo 5− and higher Intensity Prefecture Locations 6− Miyazaki Nichinan 5+ Miyazaki Miyazaki, Kushima, Miyakonojō Kagoshima Ōsaki 5− Miyazaki Mimata, Kunitomi, Shintomi, Takanabe, Takaharu, Kobayashi Kagoshima Soo, Kanoya, Kimotsuki, Higashikushira, Tarumizu, Kirishima, Kagoshima, Aira == Tsunami == After the earthquake, a tsunami advisory was issued for Kōchi, Ehime, Oita, Miyazaki, and Kagoshima Prefectures, warning of waves up to 3.3 feet. In Miyazaki, waves were , and in Kōchi, they were . The advisories were lifted at 20:00 JST. == Impact == The earthquake injured at least 16 people, with two seriously injured, and destroyed two houses in Kyushu. In Miyazaki Prefecture, five people were injured, with two in Nichinan, two in Miyazaki, and one in Miyakonojō, with damage to Obi Castle Town, a road was closed because of rocks falling, a house partly fell down, and Miyazaki Airport had little bit broken, with some flight cancellations and delays. Water pipes leaked in Kushima. In Kagoshima Prefecture, two people were injured, several walls and a two-story house collapsed, roads were raised in Ōsaki, and there was a landslide in Shibushi. Two people were also injured in Kumamoto Prefecture. Shinkansen trains on the Kyushu and Nishi Kyushu lines stopped running. The Ikata and Sendai Nuclear Power Plants near the epicenter had no problems. == Aftermath == After the earthquake, the Japan Meteorological Agency said that there was a higher chance of a very big earthquake along the Nankai Trough. This was the first advisory like this, but they said it wasn't happening soon. They told people in affected areas to follow safety tips from the government. Because of this, the Central Japan Railway made trains go slower for a week, and Prime Minister Fumio Kishida canceled his trip to Central Asia on 9 August. == Related pages == * 2024 Noto earthquake * 2016 Kumamoto earthquakes == References == Category:2024 earthquakes Category:2024 disasters in Asia Category:August 2024 events Category:Earthquakes in Japan Category:Miyazaki Prefecture",
 "title": "2024 Hyūga-nada earthquake"
}