{
 "id": "112541",
 "text": "This is the title history of the World Heavyweight Championship. The title was introduced in 2002 when WWE bought out World Championship Wrestling WCW. It was retired and made into one with the WWE Championship on December 16, 2013 when Randy Orton defeated John Cena at TLC: Tables, Ladders & Chairs. It does not share the title history of the new World Heavyweight Championship that was created in 2023. == Title History == # Wrestlers Reign Date Days held Location Event Notes Ref Milwaukee, WI Raw Awarded the championship by Eric Bischoff. At No Mercy on October 20, 2002, Triple H defeated Intercontinental Champion Kane to unify the Intercontinental Championship into the World Heavyweight Championship. New York, NY Survivor Series This was the first ever Elimination Chamber match, also involving Chris Jericho, Booker T, Rob Van Dam, and Kane. Sunrise, FL Armageddon This was a Three Stages of Hell match. Hershey, PA Unforgiven This was a Career vs. Title match. Orlando, FL Armageddon This was a Triple Threat match also involving Kane. New York, NY WrestleMania XX This was a Triple Threat match also involving Shawn Michaels. Benoit became the first Canadian to win the title. Toronto, ON, Canada SummerSlam Orton became the youngest world champion in the history of WWE. Portland, OR Unforgiven — Vacated Charlotte, NC Raw The championship was vacated after a double pinfall happened in a triple threat match, also involving Chris Benoit and Edge. San Juan, Puerto Rico New Year's Revolution Triple H beat Chris Benoit, Chris Jericho, Randy Orton, Batista, and Edge in an Elimination Chamber match with Shawn Michaels as the Special Guest Referee to win the vacant championship. Los Angeles, CA WrestleMania 21 Batista was drafted to the SmackDown! brand as the last pick on June 30, 2005, making the title exclusive to that brand. — Vacated Philadelphia, PA SmackDown! Batista vacated the title after he suffered a triceps injury. Aired on tape delay on January 13, 2006. Philadelphia, PA SmackDown! Angle won the vacant championship in a 20 man battle royal, last eliminating Mark Henry. Rosemont, IL WrestleMania 22 This was a Triple Threat match also involving Randy Orton. Indianapolis, IN The Great American Bash Booker T became the first African American to win the title. Philadelphia, PA Survivor Series This was a Last Chance match. Detroit, MI WrestleMania 23 This was a title vs streak match in which the Undertaker's undefeated streak at WrestleMania went up to 15-0. Pittsburgh, PA SmackDown! Edge cashed in his Money in the Bank contract to earn the right to challenge for the title. Aired on tape delay on May 8, 2007. — Vacated Laredo, TX SmackDown! Edge vacated the title after he suffered a pectoral injury. Aired on tape delay on July 20, 2007. Laredo, TX SmackDown! Khali won the vacant championship in a 20-man battle royal and became first Indian to win the title. Memphis, TN Unforgiven This was a Triple Threat match also involving Rey Mysterio. Pittsburgh, PA Armageddon This was a Triple Threat match also involving The Undertaker. Orlando, FL WrestleMania XXIV This was a title vs streak match in which the Undertaker's WrestleMania undefeated streak went up to 16-0. WWE lists the end of Undertaker's reign on May 2, 2008, when the following episode aired on tape delay. — Vacated Atlantic City, NJ SmackDown SmackDown's General Manager Vickie Guerrero stripped The Undertaker of the title for using the Hell's Gate submission hold, which she said was dangerous. Aired on tape delay on May 2, 2008. San Diego, CA One Night Stand Edge beat The Undertaker in a Tables, Ladders, and Chairs match to win the vacant title. Oklahoma City, OK Raw This was Punks Money in the Bank cash-in match. CM Punk was a part of the Raw brand, so his win made the title exclusive to that brand again. Cleveland, OH Unforgiven (2008) This was a Championship Scramble, also involving John \"Bradshaw\" Layfield, Batista, Rey Mysterio, and Kane. Jericho was a late replacement for champion CM Punk, who was attacked by Legacy before the match. Phoenix, AZ Cyber Sunday \"Stone Cold\" Steve Austin was the Special Guest Referee. Tampa, FL Raw This was a Steel Cage match. Boston, MA Survivor Series Seattle, WA No Way Out This was an Elimination Chamber match also involving Chris Jericho, Rey Mysterio, Mike Knox, and Kane. The title became exclusive to SmackDown again because Edge was a part of that brand. Houston, TX WrestleMania XXV This was a Triple Threat match also involving The Big Show. The title became exclusive to Raw again because Cena was a part of that brand. Providence, RI Backlash This was a Last Man Standing match. The title became exclusive to SmackDown again because Edge was a part of that brand. <1 New Orleans, LA Extreme Rules This was a Ladder match. This was Punk's Money in the Bank cash-in match. Philadelphia, PA Night of Champions Los Angeles, CA SummerSlam This was a Tables, Ladders, and Chairs match. Newark, NJ Hell in a Cell This was a Hell in a Cell match. St. Louis, MO Elimination Chamber This was an Elimination Chamber match, also involving John Morrison, R-Truth, CM Punk and Rey Mysterio. WWE lists the end of Jericho's reign on April 2, 2010, when the following episode aired on tape delay. Las Vegas, NV SmackDown This was Swagger's Money in the Bank cash-in match. Swagger was drafted to SmackDown following his win. WWE lists the start of Swagger's reign on April 2, 2010, when the episode aired on tape delay. Uniondale, NY Fatal 4-Way This was a Fatal 4-Way match also involving The Big Show and CM Punk. Kansas City, MO Money in the Bank This was Kane's Money in the Bank cash-in match. Houston, TX TLC: Tables, Ladders & Chairs This was a Fatal 4-Way Tables, Ladders, and Chairs match, also involving Alberto Del Rio and Rey Mysterio. WWE lists the end of Edge's reign on February 18, 2011, when the following episode aired on tape delay. — Vacated Albany, NY SmackDown Edge was stripped as a result of using the spear in a banned move match by Vickie Guerrero. This episode aired on tape delay on February 18, 2011. <1 San Diego, CA SmackDown Vickie Guerrero awarded the belt to Ziggler. This episode aired on tape delay on February 18, 2011. WWE lists the start of Edge's reign on February 18, 2011 and the end on April 15, 2011. Both episodes aired on tape delay. — Vacated Albany, NY SmackDown Vacated when Edge announced his retirement. This episode aired on tape delay on April 15, 2011. Tampa, FL Extreme Rules Christian defeated Alberto Del Rio in a Ladder match to win the vacant world championship. WWE lists the end of Christian's reign on May 6, 2011, when the following episode aired on tape delay. Orlando, FL SmackDown WWE lists the start of Orton's reign on May 6, 2011, when the episode aired on tape delay. Rosemont, IL Money in the Bank Defeated Randy Orton by disqualification after Orton gave him a low-blow in view of the official. The stipulations of the match allowed the title to change hands via disqualification. Los Angeles, CA SummerSlam This was a No Holds Barred Match. Buffalo, NY Night of Champions <1 Baltimore, MD TLC: Tables, Ladders & Chairs This was a chairs match. This was Bryan's Money in the Bank cash-in match. Miami, FL WrestleMania XXVIII Sheamus defeated Daniel Bryan in 18 seconds, this was one of the shortest title matches in WWE history.. Atlanta, GA Hell in a Cell Miami, FL SmackDown! This was a Last Man Standing match. East Rutherford, NJ Raw This was Ziggler's Money in the Bank cash-in match. Rosemont, IL Payback Miami, FL Hell in a Cell <1 Houston, TX TLC: Tables, Ladders & Chairs This was a Tables, Ladders, and Chairs Winner takes all match, in which Orton also defended his WWE Championship. — Houston, TX TLC: Tables, Ladders & Chairs Retired when the title was made into one with the WWE Championship to create the WWE World Heavyweight Championship. ==Combined reigns== Rank Wrestler No. of reigns Combined days Combined days recognized by WWE 1 5 616 611 2 4 507 503 3 7 409 405 4 2 223 5 1 210 6 3 207 7 3 160 157 8 1 154 153 8 3 154 152 8 1 154 153 11 2 140 138 12 4 138 132 13 1 126 125 14 3 106 15 1 105 104 16 1 91 17 1 84 83 18 1 82 78 18 1 82 81 20 2 72 21 2 69 22 1 61 60 23 2 30 31 24 2 28 27 24 1 == References == == Other websites == * WWE World Heavyweight Title History Category:Lists of professional wrestlers Category:World Wrestling Entertainment championships",
 "title": "List of World Heavyweight Champions (WWE)"
}