{
 "id": "1125965",
 "text": "The 31st Writers Guild of America Awards showed the best movie writers and television writers from 1978. The winners of these awards were announced in 1979. == Winners and nominations == === Movie === Winners are bolded. * Coming Home. Written by Waldo Salt and Robert C. Jones. Story by Nancy Dowd. ** An Unmarried Woman. Written by Paul Mazursky. ** Days of Heaven. Written by Terrence Malick. ** The Deer Hunter. Written by Deric Washburn, Michael Cimino, Louis Garfinkle and Quinn K. Redeker. ** Interiors. Written by Woody Allen. * Movie Movie. Written by Larry Gelbart and Sheldon Keller. ** A Wedding. Screenplay by John Considine, Patricia Resnick, Allan F. Nicholls and Robert Altman; Story by Robert Altman and John Considine. ** House Calls. Screenplay by Max Shulman, Julius J. Epstein, Alan Mandel, and Charles Shyer. Story by Max Shulman and Julius J. Epstein. ** National Lampoon's Animal House. Written by Harold Ramis, Douglas Kenney and Chris Miller ** Once in Paris.... Written by Frank D. Gilroy. * Midnight Express. Screenplay by Oliver Stone. This drama was based on the book by Billy Hayes and William Hoffer. ** Bloodbrothers. Screenplay by Walter Newman. This drama was based on the novel by Richard Price. ** Go Tell the Spartans. Screenplay by Wendell Mayes. This drama was based on the novel by Daniel Ford. ** Invasion of the Body Snatchers. Screenplay by W.D. Richter. This drama was based on the novelby Jack Finney. ** Who'll Stop the Rain. Screenplay by Judith Rascoe and Robert Stone. This drama was based on the novel by Robert Stone. * Heaven Can Wait. Screenplay by Elaine May and Warren Beatty. This comedy was based on the play by Harry Segall. ** California Suite. Screenplay by Neil Simon. This comedy was based on his play. ** Same Time, Next Year. Screenplay by Bernard Slade. This comedy was based on his play. ** Superman. Screenplay by Mario Puzo, David Newman, Leslie Newman and Robert Benton. This comedy was based on another character. This character was made by Jerry Siegel and Joe Shuster. ** Who Is Killing the Great Chefs of Europe?. Screenplay by Peter Stone. This comedy was based on a novel by Nan Lyons and Ivan Lyons. === Television === * \"Baby, It's Cold Outside\" – M*A*S*H (CBS) – Gary David Goldberg ** \"California, Here We Are\" – All in the Family (CBS) – Milt Josefsberg, Phil Sharp, Bob Schiller and Bob Weiskopf ** \"The Ghost\" – Barney Miller (ABC) – Reinhold Weege ** \"Point of View\" – M*A*S*H (CBS) – Ken Levine and David Isaacs ** \"Pilot\" – Mork & Mindy (ABC) – Dale McRaven ** \"Rhoda vs. Ida\" – Rhoda (CBS) – Bob Ellison ** \"Memories of Cab 804: Part 1 & 2\" – Taxi (ABC) – Barry Kemp ** \"Blind Date\" – Taxi (ABC) – Michael Leeson * \"Prisoner\" – Lou Grant (CBS) – Seth Freeman ** \"The Conspirators\" – Columbo (NBC) – Howard Berk ** \"Murder\" – Lou Grant (CBS) – Gary David Goldberg ** \"The House on Willis Avenue\" – The Rockford Files (NBC) – Stephen J. Cannell ** \"The Illusion\" – The Waltons (CBS) – John McGreevey ** \"The Captive\" – The Waltons (CBS) – Ray Cunneff * Ryan's Hope (ABC) – Claire Labine, Jeffrey Lane, Paul Avila Mayer, Mary Munisteri and Judith Pinsker ** Love of Life (CBS) – Gabrielle Upton ** One Life to Live (ABC) – Lanie Bertram, Margaret DePriest, Marisa Gioffre, Sam Hall, Peggy O'Shea, Gordon Russell and Don Wallace * \"Mom and Dad Can't Hear Me\" – ABC Afterschool Special (ABC) – Irma Reichert and Daryl Warner ** Christmas Eve on Sesame Street (PBS) – Jon Stone and Joseph A. Bailey ** \"The Tap Dance Kid\" – NBC Special Treat (NBC) – Barra Grant * A Christmas to Remember (CBS) – Stewart Stern; Based on the novel by Glendon Swarthout * A Woman Called Moses (NBC) – Lonne Elder III; Based on the book by Marc Heidish * Scott Joplin (NBC) – Christopher Knopf * \"Steve Martin and Betty White\" – The Carol Burnett Show (CBS) – Roger Beatty, Rick Hawkins, Liz Sage, Bob Illes, James R. Stein, Franelle Silver, Larry Siegel, Tim Conway, Bill Richmond, Gene Perret, Dick Clair, Jenna McMahon and Ed Simmons === Special awards === Laurel Award for Screenwriting Achievement Neil Simon Laurel Award for TV Writing Achievement James Costigan Valentine Davies Award Melville Shavelson Morgan Cox Award George Seaton == References == == Other websites == * WGA.org Category:Movie awards Category:1978 in American television",
 "title": "31st Writers Guild of America Awards"
}