{
 "id": "1125723",
 "text": "The men's 100 metres was a sprinting event in the 1900 Summer Olympics in Paris. It was on July 14, 1900. There were 20 athletes. These athletes were from 9 different nations. Frank Jarvis won the event. He was from the United States. Walter Tewksbury was in 2nd place. He was also from the United States. Australia won their first medal in the 100 metres. Stan Rowley won a bronze medal in this event. ==Background== This was the second time this event happened. None of the runners also ran in the 1896 Olympics. The American Arthur Duffey had just won the AAA Championships for 100 yards. He was the favorite for the competition. 7 people had ran the unofficial world record of 10.8 for this event. One of these people was Isaac Westergren of Sweden. He was also in this competition. There were no athletes from France. Australia, Bohemia, India, and Italy were in this event for the first time. The 100 metres was not the shortest sprint. The 60 meters was the shortest sprint. This has only happened in 1900 and 1904. ==Records== These were the world records and Olympic records before the 1900 Olympics. The times are all in seconds. World Record 10.8 Luther Cary Paris (FRA) July 4, 1891 Cecil Lee Brussels (BEL) September 25, 1892 Étienne De Re Brussels (BEL) August 4, 1893 L. Atcherley Frankfurt/Main (GER) April 13, 1895 Harry Beaton Rotterdam (NED) August 28, 1895 Harald Anderson-Arbin Helsingborg (SWE) August 9, 1896 Isaac Westergren Gävle (SWE) September 11, 1898 Isaac Westergren Gävle (SWE) September 10, 1899 Olympic Record 11.8 Thomas Burke Athens (GRE) April 6, 1896 (NS) In the first heat of the first round, Arthur Duffey ran 11.4 seconds. This beat the Olympic record. In the second heat of the first round, Walter Tewksbury ran 11.4 seconds. This tied the Olympic record. In the third heat of the first round, Frank Jarvis ran 10.8 seconds. This tied the unofficial world record. In the second semifinal, Tewksbury also ran 10.8 seconds. This would tie the unofficial world record. ==Competition== The competition had 4 rounds. There was the heats, the semifinals, the repechage, and the final. The fastest 2 runners in the heats would run in the semifinals. In the semifinals, 12 men were put into each 3 semifinals. Each semifinals had 4 runners. In the semifinal, the 1st-place runner ran in the finals. The 2nd and 3rd place runners ran in the repechage. In the repechage, there were 6 runners. Only the runner of the repechage would run in the final. ==Schedule== Date Time Round Saturday, 14 July 1900 11:15 First round Semifinals Repechage Final ==Results== ===First round=== In the first round, there were six heats. The fastest 2 runners in each heat could run in the semifinal round. ====Heat 1==== Rank Athlete Nation Time Notes 1 Arthur Duffey 11.4 , 2 Frederick Moloney 11.5 3 Václav Nový Unknown ====Heat 2==== Rank Athlete Nation Time Notes 1 Walter Tewksbury 11.4 , = 2 Thaddeus McClain 11.4 3 Pál Koppán Unknown ====Heat 3==== This heat was the fastest heat. It would have 2 medallists. Jarvis tied the world record. Rank Athlete Nation Time Notes 1 Frank Jarvis 10.8 , = 2 Stan Rowley 10.9 3 Umberto Colombo Unknown 4 Julius Keyl Unknown ====Heat 4==== Rank Athlete Nation Time Notes 1 Clark Leiblee 11.4 2 Kurt Doerry 11.5 3 Johannes Gandil Unknown ====Heat 5==== The fifth heat was the only heat that was not won by an American. Rank Athlete Nation Time Notes 1 Norman Pritchard 11.4 2 Edmund Minahan 11.5 3 Ernő Schubert Unknown 4 Isaac Westergren Unknown ====Heat 6==== Rank Athlete Nation Time Notes 1 Charles Burroughs 11.4 2 Dixon Boardman 11.5 3 Henry Slack Unknown ===Semifinals=== There were three semifinals. Each semifinal had 4 runners. The fastest runner in each semifinals went to the final. The 2nd and 3rd place runners ran in the repechage. The winner of the repechage would also go to the finals. ====Semifinal 1==== Rank Athlete Nation Time Notes 1 Arthur Duffey 11.0 2 Stan Rowley 11.2 3 Charles Burroughs Unknown 4 Dixon Boardman Unknown ====Semifinal 2==== Tewksbury tied the world record. Rank Athlete Nation Time Notes 1 Walter Tewksbury 10.8 , = 2 Clark Leiblee 10.9 3 Frederick Moloney Unknown — Kurt Doerry ====Semifinal 3==== Rank Athlete Nation Time Notes 1 Frank Jarvis 11.2 2 Thaddeus McClain 11.3 3 Norman Pritchard Unknown 4 Edmund Minahan Unknown ===Repechage=== The repechage was a very close race. Rowley only beat Pritchard by 1 inches. He would be allowed to run in the final round. Rank Athlete Nation Time Notes 1 Stan Rowley 11.0 2 Norman Pritchard 11.0 3 Clark Leiblee Unknown 4–6 Charles Burroughs Unknown 4–6 Thaddeus McClain Unknown 4–6 Frederick Moloney Unknown ===Final=== Duffey was faster than everybody else at first. However, he pulled a tendon halfway in the race. Jarvis beat Tewksbury by two feet. Rowley was half of a yard behind. Rank Athlete Nation Time Frank Jarvis 11.0 Walter Tewksbury 11.1 Stan Rowley 11.2 — Arthur Duffey ==Sources== ===References=== ===Citations=== * International Olympic Committee. * De Wael, Herman. Herman's Full Olympians: \"Athletics 1900\". Accessed 18 March 2006. Available electronically at . * Men's 0100 metres",
 "title": "Athletics at the 1900 Summer Olympics – Men's 100 metres"
}