{
 "id": "1125703",
 "text": "Taylor Gayle Rutherfurd (born June 10, 2004), known as her other name, Gayle (in all caps), is an American singer and songwriter. After signing with Atlantic Records and Arthouse Entertainment, she released her hit single \"ABCDEFU\" in 2021. It went worldwide. It reached number one in the United Kingdom and Ireland. It got on the Billboard Global 200 and earned her a Grammy Award nomination for Song of the Year. == Early life == Taylor Gayle Rutherfurd was born on June 10, 2004 in Plano, Texas. She started singing at the age of seven and later moved to Nashville, Tennessee, to get a musical career. She reports that she is dyslexic and has synesthesia. When sound is playing, she gets an experience of color because of her conditon. == Career == === 2020–2022: Beginnings, breakout success and EPs === In 2020, she signed her first record with Arthouse Entertainment. After letting out several self- produced singles, Gayle was discovered by former American Idol judge and Arthouse music publisher Kara DioGuardi. Gayle then was signed to Atlantic Records and Arthouse. In 2021, Gayle let out \"ABCDEFU\", her major-label debut single with Atlantic and Arthouse. It became viral on TikTok and Spotify. \"ABCDEFU\" went at number three on the Billboard Hot 100. Outside of the United States, \"ABCDEFU\" was at the top of the charts in Finland, Germany, Ireland, Norway, Sweden, and the United Kingdom, and the top ten in Australia, Austria, New Zealand, and Switzerland. Gayle later let out the song \"Ur Just Horny\" on January 19, 2022. On March 18, 2022, Gayle released a six-song extended play (EP) named A Study of the Human Experience Volume One through Atlantic and Arthouse. On March 19, 2022, Gayle was a fill-in host for the CHR version of Ryan Seacrest's American Top 40. Her song, \"ABCDEFU\" spent its first week at number one. On September 19, 2022, Gayle said that she was canceling her Avoiding College Tour. On October 7, 2022, Gayle let out her second extended play, A Study of the Human Experience Volume Two. On December 9, 2022, Gayle let out a third extended play, A Study of the Human Experience Volume Two and a Half. === 2023–present: Touring and Standalone releases === On March 9, 2023, Gayle released the single \"Everybody Hates Me\". She served as an opening act on many shows of the US leg of Taylor Swift's Eras Tour from March to August. She was also the opening act of Pink's Summer Carnival tour from June to July 2023.* * * She also was a opening act on the second European leg of the Summer Carnival, in June and July 2024. On April 14, 2023, Lauren Spencer- Smith's \"Fantasy\", a collaboration with Gayle and Em Beihold, was let out as the sixth single from Spencer's album, Mirror (2023). Gayle co-wrote Kelly Clarkson's 2023 single \"Me\", which was let out on the same day. On May 5, 2023, she let out \"Don't Call Me Pretty\". Gayle performed and co-wrote \"Butterflies\" for Barbie the Album, which was let out in July. In August, she let out the single \"Leave Me for Dead\". Her next song, \"I Don't Sleep as Good as I Used to\", followed on October 6. Gayle went on her debut tour, the Scared but Trying Tour. It started on October 17 in Tampa, Florida. It ended on November 15, 2023 in Nashville, Tennessee. Also in November, she let the compilation album Hello This Is the Setlist for My Tour. Her first release of 2024 was \"Kinda Smacks\" with Royal & the Serpent in February. From May to June, she made her short tour, the My First Time (in Asia) Tour, which was made up of four shows in Asia. It also was made up of her slot at the Seoul Jazz Festirea. On June 28, Gayle let out the single \"Internet Baby\". == Tours == Headlining * The FU Tour * Scared but Trying Tour (2023) * My First Time (in Asia) Tour (2024) Supporting * Winnetka Bowling League – Live on Tour (2021) * Tate McRae – Tate McRae Live on Tour (2022) * AJR – OK Orchestra Tour (2022) * My Chemical Romance – Reunion Tour (2022) * Taylor Swift – The Eras Tour (2023) * Pink – Summer Carnival (2023–2024) == Awards == Year Award Category Work Result Ref. 2022 American Music Awards New Artist of the Year Billboard Music Awards Top Viral Song \"ABCDEFU\"| Danish Music Awards Los 40 Music Awards Best International New Artist Herself| MTV Europe Music Awards MTV Millennial Awards Global Hit of the Year MTV Video Music Awards Best New Artist Push Performance of the Year \"ABCDEFU\"| NRJ Music Awards International Revelation of the Year Herself| People's Choice Awards 2023 Grammy Awards Song of the Year Kids' Choice Awards Favorite Breakout Artist Herself| Circle Chart Music Awards iHeartRadio Music Awards Best Lyrics \"ABCDEFU\"| APRA Music Awards == Related pages == * ABCDEFU * Billboard Global 200 * Grammy Awards * Tate McRae * Taylor Swift * Pink (singer) == References == == Other websites == * Category:American Grammy Award winners Category:Singer-songwriters from Texas Category:2004 births Category:21st- century American singer-songwriters Category:Singers from Dallas Category:Living people Category:American child singers Category:Atlantic Records artists Category:American pop singers",
 "title": "Gayle"
}