{
 "id": "1125062",
 "text": "At the 1896 Summer Olympics, there were 12 athletics events. 25 medals were given. 12 silver medals were given to winners. 13 bronze medals were given for 2nd place. No medals were given for 3rd. After the olympics 37 modern medals were given out (12 gold, 13 silver, 12 bronze). All of the events except the marathon were in the Panathinaiko Stadium. This stadium was also the finish for the marathon. Events were held on 6 April, 7 April, 9 April, and 10 April 1896 There were 63 athletes from nine nations competed. All of these athletes were men. Athletics had the biggest number of countries out of any sport in the 1896 Olympics. == Schedule == Men's Men's Men's Men's Men's Men's Men's Men's Men's Men's Men's Date Apr 6 Apr 7 Apr 8 Apr 9 Apr 10 Event M E M E M E M E M E 100 m H H F 400 m H H F 800 m H H F 1500 m F 110 m H F Marathon F High jump F Pole vault F Long jump F Triple jump F Shot put F Discus throw F ==Medal summary== These medals were given after the Olympics by the International Olympic Committee. At the time, winners were given a silver medal and athletes in 2nd place were given bronze medals. There was no award for 3rd place. 100 metres rowspan=2 rowspan=2 12.6 100 metres 12.6 400 metres 56.2 58.2 60.7 800 metres 2:11.0 2:11.8 2:28.0 1500 metres 4:33.2 4:33.6 4:36.0 110 metre hurdles 17.6 17.7 none awarded Marathon 2:58:50 3:06:03 3:06:35 High jump rowspan=2 1.65 m none awarded High jump 1.65 m none awarded Pole vault rowspan=2 rowspan=2 2.60 m Pole vault 2.60 m Long jump 6.35 m 6.00 m 5.84 m Triple jump 13.71 m 12.70 m 12.52 m Shot put 11.22 m 11.03 m 10.36 m Discus throw 29.15 m 28.95 m 27.78 m ==Medal table== ==Nations== 63 athletes from 9 nations were at the Athens Games. National Olympic Committees had not been fully made yet, so it is not sure what countries competed. For example, Olympedia says there was 1 athlete from Cyprus and 2 athletes from Smyrna. However, Cyprus and Smyrna both competed for the Greek team. Chile also says they had a competitor. However, some sources say that Luis Subercaseaux did not start his race. * * * * * * * * * ==Notes== ==References== * International Olympic Committee results database * (Digitally available at ) * (Excerpt available at ) * Category:1896 Summer Olympics events 1896",
 "title": "Athletics at the 1896 Summer Olympics"
}