{
 "id": "1125370",
 "text": "Kenya Grace Johnson (born 8 May 1998) is a British singer, songwriter, and record producer. She is from South Africa. Her 2023 single \"Strangers\" was on the UK Singles Chart. It made her the first British female singer to do this with a debut single since 2014. She became the second British female singer ever to reach Number 1 with a track made all by herself after Kate Bush's \"Running Up That Hill\". == Life and career == === Early life === Kenya Grace Johnson was born in South Africa. She was born to a South African mother and a British father. She grew up in “very quiet and chill” town near Southampton. She went to Thornden School. She used to play hockey for Hampshire. She started writing when she was 10 years old. She started singing in elementary school when she got a Yamaha keyboard. She first liked musical theater. Later, she liked dance music. She liked dubstep first. She went to Academy of Contemporary Music in Guildford. She first read history and English works. Grace later switched to music after choosing to become a musician. She graduated in September 2019 with a degree in songwriting and creative artistry. She has said that the university helped cure her stage fright. === Personal life === She has blue eyes. She also has a nose piercing. She has many tattoos on both arms (mostly on her forearms). She said she wants to be completely covered in tattoos someday. In 2019, she let out \"Obsessed\". Then, she let out \"Tell Me Why\". Grace wrote \"Tell Me Why\" while drunk and arguing with someone. She won a music video shoot for \"Tell Me Why\" , which was her first music video. She then let out \"Talk\". Kenya wrote in her parents' bedroom during the COVID-19 lockdown in the United Kingdom after getting out of a bad relationship. Kenya later moved to North London. Her move was slowed down by the pandemic. In 2022, she let out \"Oranges\". === 2023–present: Strangers and The After Taste === In February and May 2023, she let out \"Afterparty Lover\" and \"Meteor\". In late July 2023, she started to support \"Strangers\", a drum and bass song she had written and made in her bedroom. She had the plan of making a euphoric track. She sent a clip of it on her TikTok account. This clip was seen over 11 million times. There was a following video that was seen over 38 million times. Strangers was let out on September 1st, 2023 on FFRR Records. By September 26, 2023, it had been used in over 570 thousand videos. Strangers went viral on Instagram Reels. A week after being let out, the song went into the UK Singles Chart. It came out at Number 1. Strangers was chosen for the BRIT awards. Strangers won the iHeartRadio Music Awards. On September 15, 2023, she let out a \"slower and sadder\" remix of Strangers. Three weeks after that, she let out another single called \"Only in My Mind\". On October 13, 2023, Strangers was at No. 1 on the UK Singles Chart. It made her the first British female artist to be at the top of the charts with a debut single since X-Factor star Ella Henderson's \"Ghost\" in 2014. It also made her the second British female artist ever to reach No. 1 with a track made, written and produced entirely by themselves after Kate Bush's \"Running Up That Hill\". In December 2023, she said on Instagram that she was working on her debut EP, The After Taste. It was let out on March 22nd, 2024. As of 10 July 2024, on Spotify, Strangers has been streamed almost 1 billion times. She has over 13 million listeners every month. == Artistry == Kenya has said that her biggest inspiration is Banks. She also gets inspiration from Adele and Amy Winehouse. She also gets inspiration from Norah Jones and Katie Melua. She writes her songs instrumental first. == Live performances == Kenya has played live in: * New York City * Chicago * BBC Music Introducing * Melkweg (Amsterdam) - 2023 * Amsterdam Dance Event (Amsterdam) - 2023 * iHeart Radio Jingle Ball - 2023 * El Rey Theatre (Los Angeles) - 2023 * Spotify Wrapped - 2023 * Roundhouse (London) for the Rolling Stone UK Awards - 2023 * Village Underground (London) - 2023 * BBC Radio 1's Big Weekend - 2024 * Gorilla (Manchester) - 2024 == Festivals == Kenya played her first festival at Coachella in 2024. She said it \"was literally the best day of my life\". She also said, \"I ran off the stage before I started sobbing\". == References == Category:21st-century British singer-songwriters Category:English electropop singers Category:English singer-songwriters Category:Living people Category:South African singers Category:1998 births Category:People from Southampton Category:English dance musicians Category:English record producers Category:Warner Bros. Records artists",
 "title": "Kenya Grace"
}