{
 "id": "1125473",
 "text": "The Homestead Act was a law in the United States that started on May 20, 1862. It allowed people to claim 160 acres of land for a small fee, as long as they agreed to build a house and farm the land. The law aimed to encourage people to move west and settle new areas. == Background == === Before the Civil War === Before the Civil War, the U.S. government wanted to help people move westward. They believed giving away land would help people settle new areas, boost the economy, and strengthen the country. === Passing the Law === In the 1850s, there were efforts to pass a law about free land, but Southern states opposed it because they didn't want more free states. When the Southern states seceded in 1861, the remaining Congress members passed the Homestead Act. == Key Points == * Who Could Apply: Any adult who had never fought against the U.S. government could apply. This included women, immigrants, and freed slaves. * Land Size: People could claim up to 160 acres of land. * Requirements: They had to build a house and farm the land. * Ownership: After five years of living on the land, they could own it. They could also buy the land after six months for $1.25 per acre. == Implementation == === How It Worked === People applied for land at local offices. They had to pay a small fee and promise to improve the land by building and farming. === Effects === The Homestead Act led to many people moving west and settling new areas. About 1.6 million homesteads were granted, covering around 270 million acres. == Problems == === Hard Conditions === Many people struggled with tough conditions and poor land, especially in dry areas like the Great Plains. The 160 acres were sometimes not enough for successful farming. === Fraud and Speculation === Some people cheated the system, using tricks to get more land than allowed. This led to reforms to fix these problems. === Impact on Native Americans === The law also affected Native Americans, as it led to the loss of their land and disrupted their lives. == Legacy == The Homestead Act was in effect until 1976, and parts of it continued in Alaska until 1986. It played a big role in settling the American West but also caused problems for Native Americans and the environment. === Historical Importance === The Homestead Act is seen as a key part of U.S. history, representing the country’s drive to expand and provide land to its people. == Related pages == * Morrill Act * Pacific Railway Acts == References == # Gates, Paul W. History of Public Land Law Development. Washington: Public Land Law Review Commission, 1968. # Lamar, Howard R. The Far Southwest, 1846-1912: A Territorial History. New Haven: Yale University Press, 1966. # Trennert, Robert A. The Phoenix Indian School: Forced Assimilation in Arizona, 1891-1935. Norman: University of Oklahoma Press, 1988. # U.S. Department of the Interior. \"The Homestead Act of 1862.\" Bureau of Land Management, 2022. Category:United States law Category:1862 in the United States",
 "title": "Homestead Act"
}