{
 "id": "1125476",
 "text": "Prong is an American heavy metal band formed in 1986. They are based out of Brooklyn, New York City. They are fronted by guitarist and vocalist Tommy Victor, the band's sole constant member. To date, Prong have released 13 studio albums (including a covers album), one live album, four EPs, one DVD and one remix album. Prong's first two records were the EP Primitive Origins and studio album Force Fed. They released in 1986 and 1989 respectively, and were noted for having a very raw sound. After signing to Epic Records in 1989, they released Beg to Differ (1990) and Prove You Wrong (1991) to critical acclaim. 1994's Cleansing was also successful, and included their best-known song, \"Snap Your Fingers, Snap Your Neck\". Upon releasing one more album (Rude Awakening in 1996), Prong disbanded in 1997, but reformed in 2002 and has continued to tour and record since then. ==Musical style== Prong has been described as groove metal, industrial metal, and thrash metal. They started out as a crossover thrash band who emerged from the New York hardcore scene. Prong, along with bands such as Pantera, Sepultura and Machine Head, was part of the groove metal movement of the 1990s. ==Discography== * Force Fed (1989) * Beg to Differ (1990) * Prove You Wrong (1991) * Cleansing (1994) * Rude Awakening (1996) * Scorpio Rising (2003) * Power of the Damager (2007) * Carved into Stone (2012) * Ruining Lives (2014) * X – No Absolutes (2016) * Zero Days (2017) * State of Emergency (2023) == References == Category:1980s American music groups Category:1990s American music groups Category:2000s American music groups Category:2010s American music groups Category:Musical groups established in 1986 Category:Musical groups disestablished in 1997 Category:Musical groups from New York (state) Category:Musical groups from New York City Category:American heavy metal bands Category:Groove metal bands Category:Thrash metal bands Category:Alternative metal bands",
 "title": "Prong (band)"
}