{
 "id": "1125694",
 "text": "Growing Up is the first album by the Linda Lindas, released on April 8, 2022, by Epitaph Records. Produced by Carlos de la Garza, father of band members Lucia and Mila, the album was recorded in Los Angeles from June to October 2021. It's a punk rock album with lyrics about growing up and teenage anxieties, written during the COVID-19 pandemic, which made it hard for the band to work together. The album received mostly positive reviews and appeared on several year-end lists in 2022. It reached number 19 on Billboards US Top Album Sales chart and also charted in Japan and the UK. The singles \"Oh!\", \"Nino\", \"Growing Up\", and \"Talking to Myself\" were promoted with music videos featuring guest appearances from skateboarder Ray Barbee and Bikini Kill's Kathleen Hanna. To support the album, The Linda Lindas toured in late 2022 with Japanese Breakfast, Bacchae, and Yeah Yeah Yeahs. == Background == The Linda Lindas formed in 2018 as a part of a pickup band for Kristin Kontrol. The band's name comes from the 2005 Japanese film Linda Linda Linda, which was inspired by the Blue Hearts' song \"Linda Linda.\" The group consists of Bela Salazar (guitar), Eloise Wong (bass guitar), Lucia de la Garza (guitar), and Mila de la Garza (drums). The band began as a cover band, playing songs by groups like the Go-Go's and Le Tigre. They released their first extended play (EP), The Linda Lindas, independently in December 2020. In 2019, they opened for Bikini Kill, which led to an appearance in Amy Poehler's 2021 film Moxie. The band also released an EP with covers of Bikini Kill's \"Rebel Girl\" and the Muffs' \"Big Mouth.\" In May 2021, a video of them performing \"Racist, Sexist Boy\" at a library event went viral, earning praise from musicians like Tom Morello, Flea, and Kathleen Hanna. Shortly after, on May 22, Epitaph Records announced they had signed the band. == Writing and recording == Most of Growing Up was written during the COVID-19 pandemic, which made it difficult for the Linda Lindas to write together. They attended school remotely and wrote about their \"feelings of loneliness and confusion.\" While \"Oh!\" was written by the whole band, many songs were written by just one or two members. Mila de la Garza wrote \"Racist, Sexist Boy\" after experiencing racism for the first time during the pandemic. The album was recorded and mixed at Carlos de la Garza's backyard studio, Music Friends, from June to October 2021. == Composition == Growing Up features 10 regular songs, with a bonus cover of the Blue Hearts' \"Linda Linda.\" Each band member contributed to the songwriting. The album's themes include growing up, finding oneself, and the anxieties of being a teenager. Critics have described the music as punk rock, pop-punk, and power pop, with some comparisons to riot grrrl. == Art == The album cover features a photograph of paper dolls, designed by Eloise Wong to represent the band members as cats. The photo was taken by Zen Sekizawa, a friend of the band. Cutouts resembling the album cover were included in the vinyl pressings of the album. == Release and promotion == Growing Up was released on April 8, 2022, by Epitaph Records. The album spawned four singles: \"Oh!\", \"Nino\", \"Growing Up\", and \"Talking to Myself.\" Each single was accompanied by a music video, with guest appearances from skateboarder Ray Barbee and Bikini Kill's Kathleen Hanna. In support of the album, The Linda Lindas embarked on a tour from June to October 2022, performing with Japanese Breakfast, Bacchae, and Yeah Yeah Yeahs. == Reception == Growing Up received generally favorable reviews. On Metacritic, it holds a score of 80 out of 100, based on 10 critic reviews. The album was praised for its catchy and fun music, though some critics debated the quality of its production. It also appeared on several year-end lists in 2022. === Year-end lists === Rankings for Growing Up Publication Accolade Rank Alternative Press The 55 best albums of 2022 * Billboard The 50 best albums of 2022 so far * Good Morning America 50 best albums of 2022 38 Kerrang! The 50 best albums of 2022 48 Loudwire Best Rock + Metal Debut Albums of 2022 * NME The 25 best debut albums of 2022 * No Ripcord The 50 best albums of 2022 34 Punknews Samantha B's Picks: Top 10 LP's of 2022 7 Rolling Stone Best Music of 2022 (Lisa Tozzi) 7 Tape Op The Rest of the Best List 2022 * Under the Radar Top 100 Albums of 2022 41 (*) denotes an unranked list == Tracks == # \"Oh!\" (Lucia de la Garza, Mila de la Garza, Bela Salazar, Eloise Wong) – 2:35 # \"Growing Up\" (L. Garza) – 3:06 # \"Talking to Myself\" (M. Garza) – 2:22 # \"Fine\" (Wong) – 2:02 # \"Nino\" (Salazar) – 1:49 # \"Why\" (Wong) – 2:19 # \"\" (Salazar) – 3:13 # \"Remember\" (L. Garza) – 3:39 # \"Magic\" (L. Garza, M. Garza) – 2:36 # \"Racist, Sexist Boy\" (M. Garza, Wong) – 1:49 Bonus edition # \"Linda Linda\" (Hiroto Kōmoto) – 2:34 == Personnel == Credits are adapted from the liner notes of Growing Up. === The Linda Lindas === * Bela Salazar – guitar, vocals * Eloise Wong – bass guitar, vocals * Lucia de la Garza – guitar, vocals * Mila de la Garza – drums, percussion, vocals === Other musicians === * Lil' Dude – piano on \"Nino\" === Technical === * Carlos de la Garza – producer, engineer, mixer * Dave Cooley – mastering * Sergio Chavez – engineer * Matt Maroalakos – engineer * Alec Wingfield – engineer === Artwork === * Wendy Lau – design * Eloise Wong – cover paper art * Zen Sekizawa – cover photo, sleeve background photos * Albert Licano – photography * Alice Baxley – photography * Humberto Leon – photography * Batsheva – outfits * Opening Ceremony – outfits * Thy Mai – hair * Valerie Vonprisk – cat eye makeup * Littlerock Nia – additional hair, makeup * Michael Meeks Silva – additional hair, makeup == Charts == Weekly charts for Growing Up Chart (2022) Peak position US Top Album Sales (Billboard) 19 US Vinyl Albums (Billboard) 10 Japanese Albums (Oricon) 49 Japanese Hot Albums (Billboard Japan) 92 Japanese Top Album Sales (Billboard Japan) 47 UK Independent Album Breakers Chart (OCC) 4 UK Vinyl Albums (OCC) 37 UK Album Sales (OCC) 60 UK Physical Albums (OCC) 51 UK Record Store (OCC) 14 == Release history == Release history for Growing Up Region Date Type Multiple April 8, 2022 Digital download May 17, 2023 Digital download (bonus edition) United States April 8, 2022 CD, LP Japan June 3, 2022 CD Europe June 24, 2022 LP == Notes == == References == == Other websites == * * Category:Album chart usages for Oricon Category:Album chart usages for BillboardVinyl Category:Album chart usages for BillboardAlbumSales Category:CS1 Japanese-language sources (ja) Category:Album chart usages for UKDigital Category:Album chart usages for UKIndependent Category:Album chart usages for Scotland Category:Articles containing Spanish-language text",
 "title": "Growing Up"
}