{
 "id": "1125733",
 "text": "Her Loss is a collaborative studio album by Canadian rapper Drake and British- American rapper 21 Savage. Her Loss was released on November 4, 2022. On October 22, 2022, Drake would reveal both the name Her Loss and release date for the album in the middle of the music video for the song \"Jimmy Cooks\". However, the album's release would have to be pushed back until November 4 because Drake's producer 40 had contracted COVID-19 while they were finishing the mixing and mastering of the album. Drake and 21 would promote the album by doing a press run of fake events like performing a fake version of a Tiny Desk Concert, creating fake issues of Vogue with both Drake and 21 on the cover, and having a deepfake interview on The Howard Stern Show, and a performance of the song \"On BS\" on a fake set of Saturday Night Live switch help from actor Michael B. Jordan. The two would end up being sued by Condé Nast, a publisher for Vogue for not using their property and trademarks with their permission. Both parties would end up settling the $4 million lawsuit for an unknown amount of money. The album's cover art was made by Paris Aden and was proposed by Lil Yachty. It features a photography of stripper and model Quiana \"Qui\" Yasuka, known as Suki Baby. The album debuted at #1 on the Billboard 200, selling 404,000 album-equivalent units. It was both Drake's twelfth and 21 Savage's third number-one album in the United States. Every song on the album made it on to the Billboard Hot 100 chart. Her Loss would be certified 2× Platinum by the Recording Industry Association of America (RIAA). The album would be nominated for Best Rap Album at the 66th Annual Grammy Awards. It would win Top Rap Album at the 2023 Billboard Music Awards. The album features the singles \"Rich Flex\" and \"Circo Loco\" which were both released on November 11, 2022 and \"Spin Bout U\" which was released on February 24, 2023. ==Songs== ==References== Category:2022 albums Category:Drake (musician) albums Category:OVO Sound albums",
 "title": "Her Loss"
}