{
 "id": "1125015",
 "text": "The Rashtrakuta Empire (r. 753–982 CE) was a powerful Indian empire that ruled large parts of the Indian subcontinent from 6th to 10th century. Their earliest known inscription is from the 7th century, detailing their rule in central or west India. Various clans, including the Elichpur clan, were feudatories under the Badami Chalukyas. Under Dantidurga, the Elichpur clan overthrew the Chalukyas and established the Rashtrakutas empire, with their base in modern Karnataka. In around 786 CE, the Rashtrakutas entered the political scene in Northern India, where they competed with the Palas from the east and the Gurjara-Pratiharas from the west. This rivalry, known as the \"Tripartite Struggle\" or \"The Kanauj Triangle\" and was focused on controlling the strategic city of Kannauj, which had been a symbol of power and prestige at that time. The struggle lasted for about two centuries, with each of the three powers experiencing periods of success, capturing Kannauj, and asserting dominance over northern India. ==History== === Establisment === The Samangadh copper plate (753) records that Dantidurga, a feudatory ruler from Achalapura (modern Elichpur in Maharashtra), defeated the Badami Chalukyas under Kirtivarman II in 753 and seized control of their northern territories.Reu (1933), p54From Rashtrakuta inscriptions call the Badami Chalukya army Karnatabala (power of Karnata) (Kamath 2001, p57, p65)Altekar in Kamath (2001), p72 He also helped his son-in-law, Pallava King Nandivarman II, reclaim Kanchi and defeated the rulers of Kalinga, Kosala, and Srisailam.Sastri (1955), p141Thapar (2003), p333 Dantidurga's successor, Krishna I, expanded the Rashtrakuta territory to include present-day Karnataka and Konkan. Sastri (1955), p143Sen (1999), p368 === Expansion === Under Dhruva Dharavarsha, who became king in 780, the Rashtrakutas grew into a powerful empire stretching from the Kaveri River to Central India. Dhruva defeated the Pratiharas and Palas in Kannauj, solidifying the Rashtrakutas as a dominant force in India.Desai and Aiyar in Kamath (2001), p75Reu (1933), p62Sen (1999), p370 Govinda III's reign marked a peak of Rashtrakuta power.The ablest of the Rashtrakuta kings (Altekar in Kamath 2001, p77) During his rule, a three-way conflict began between the Rashtrakutas, Palas, and Pratiharas for control of the Gangetic plains. Govinda III defeated both the Pratihara ruler Nagabhatta II and the Pala emperor Dharmapala. According to the Sanjan inscription, his horses drank from the icy waters of the Himalayan streams and his war elephants tasted the sacred waters of the Ganges, suggesting that his army reached the Himalayan streams and the Ganges. Kamath 2001, MCC, p76From the Sanjan inscriptions, After conquering Kannauj, Govinda III expanded his control southward, securing Gujarat, Kosala, and Gangavadi. He subdued the Pallavas of Kanchi, installed his choice of ruler in Vengi, and received tribute, including statues, from the king of Ceylon. The Cholas, Pandyas, and Kongu Cheras also paid him tribute.From the Nesari records (Kamath 2001, p76)Reu (1933), p65Sastri (1955), p144Narayanan, M. G. S. (2013), p95, Perumāḷs of Kerala: Brahmin Oligarchy and Ritual Monarchy: Political and Social Conditions of Kerala Under the Cēra Perumāḷs of Makōtai (c. AD 800 – AD 1124). Thrissur (Kerala): CosmoBooks === Amoghavarsha === Amoghavarsha I, the successor of Govinda III, made Manyakheta the capital of the Rashtrakuta Empire, which remained so until its fall.Which could put to shame even the capital of gods-From Karda plates (Altekar 1934, p47)A capital city built to excel that of Indra (Sastri, 1955, p4, p132, p146)Reu 1933, p71 He ascended the throne in 814 but took until 821 to suppress revolts. Amoghavarsha secured peace with the Western Ganga dynasty through marriage alliances and defeated the Eastern Chalukyas at Vingavalli, earning the title Viranarayana.from the Cambay and Sangli records. The Bagumra record claims that Amoghavarsha saved the \"Ratta\" kingdom which was drowned in an \"ocean of Chalukyas\" (Kamath 2001, p78)Sastri (1955), p145 Unlike Govinda III, Amoghavarsha preferred diplomacy over warfare, maintaining friendly relations with neighbors like the Gangas, Eastern Chalukyas, and Pallavas.Narasimhacharya (1988), p1 His reign was a golden age for arts, literature, and religion. An accomplished scholar, he authored Kavirajamarga in Kannada, a landmark in Kannada literature, and Prashnottara Ratnamalika in Sanskrit, later translated into Tibetan. Reu (1933), p38 Due to his peace-loving nature and cultural contributions, he is often compared to Emperor Ashoka and called the \"Ashoka of the South.\" Panchamukhi in Kamath (2001), p80 === Later Rashtrakuta Kings === Under Krishna II, the Rashtrakuta Empire faced challenges, including a revolt by the Eastern Chalukyas, shrinking its territory to the Western Deccan and Gujarat.Sastri (1955), p161 Krishna II ended the autonomy of the Gujarat branch, bringing it under direct rule from Manyakheta. Indra III restored the empire by defeating the Kingdom of Malwa and launching successful campaigns in the Ganges-Yamuna doab, where he defeated both the Pratiharas and Palas and maintained political influence over the Western Chalukyas.From the writings of Adikavi Pampa (Kamath 2001, p81)Sen (1999), pp373-374 His victories in Kannauj had lasting effects, as noted in a 930 CE copper plate issued by Govinda IV.Kamath (2001), p82The Rashtrakutas of Manyakheta gained control over Kannauj for a brief period during the early 10th century (Thapar 2003, p333) After a series of weak rulers, Krishna III, the last powerful Rashtrakuta king, restored the empire's strength. He expanded its borders from the Narmada to the Kaveri River, including northern Tamil regions, and even received tribute from the king of Ceylon.From the Siddalingamadam record of 944 – Krishna III captured Kanchi and Tanjore as well and had full control over northern Tamil regions (Aiyer in Kamath 2001, pp82–83)From the Tirukkalukkunram inscription – Kanchi and Tanjore were annexed by Krishna III. From the Deoli inscription – Krishna III had feudatories from Himalayas to Ceylon. From the Laksmeshwar inscription – Krishna III was an incarnation of death for the Chola Dynasty (Reu 1933, p83)Conqueror of Kanchi, (Thapar 2003, p334)Conqueror of Kanchi and Tanjore (Sastri 1955, p162)Sen 1999), pp374-375 === Decline === In 972 CE, during the reign of Khottiga Amoghavarsha, the Malwa king Siyaka Harsha attacked and plundered Manyakheta, the Rashtrakuta capital. This defeat damaged the empire's reputation and began its downfall. Taking advantage of the chaos, Tailapa II, a Rashtrakuta feudatory from Tardavadi (modern Bijapur), declared independence and started the Western Chalukya dynasty.The province of Tardavadi in the very heart of the Rashtrakuta empire was given to Tailapa II as a fief (provincial grant) by Rashtrakuta Krishna III for services rendered in war (Sastri 1955, p162)Kamath (2001), p101 Indra IV, the last Rashtrakuta emperor, gave up his throne and ended his life through Sallekhana (fasting unto death) at Shravanabelagola. With the Rashtrakutas' fall, their feudatories and allied clans in the Deccan and northern India declared independence. The Western Chalukyas took control of Manyakheta, making it their capital and building a powerful empire. Meanwhile, the focus of power shifted to the Krishna-Godavari region (Vengi), and the Chalukyas faced rising competition from the re-emerging Cholas in the south.Kamath (2001), pp100–103 ==List of King== Serial no. Regnal names Reign 1 Dantidurga (Founder) 735–756 CE 2 Krishna I 756–774 CE 3 Govinda II 774–780 CE 4 Dhruva Dharavarsha 780–793 CE 5 Govinda III 793–814 CE 6 Amoghavarsha 814–878 CE 7 Krishna II 878–914 CE 8 Indra III 914–929 CE 9 Amoghavarsha II 929–932 CE 10 Govinda IV 930–935 CE 11 Amoghavarsha III 934–939 CE 12 Krishna III 939–967 CE 13 Khottiga Amoghavarsha 967–972 CE 14 Karka II or Amoghhavarsha IV 972–973 CE 15 Indra IV (only a claimer for the lost throne.) 973–982 CE == References == Category:History of India",
 "title": "Rashtrakuta Empire"
}