{
 "id": "1125923",
 "text": "Alan Michael Gratz (born January 27, 1972) is the author of 19 novels for young adults. They include Prisoner B-3087, Code of Honor, Grenade, Something Rotten, Ground Zero and Refugee. == Life == Alan Gratz was born in Knoxville, Tennessee. He has a B.A. in creative writing and a master's degree in English education, both from the University of Tennessee, Knoxville. He worked for the school's newspaper, the Daily Beacon. Gratz now lives in Portland, Oregon with his wife and children. == Created works == * Samurai Shortstop (Dial Books, 2006) * Something Rotten (Dial, 2007) * Fantasy Baseball (Dial, 2011) * Starfleet Academy: The Assassination Game (Simon Spotlight, 2012) * Prisoner B-3087 (Scholastic, 2013) * The League of Seven (Tor Forge, 2014) * The Dragon Lantern: A League of Seven Novel (Tor Forge, 2015) * Code of Honor (2015) * The Monster War: A League of Seven Novel (Tor Forge, 2016) * Projekt 1065 (Scholastic, 2016) * Ban This Book (Tor Forge, 2017) * Refugee (Scholastic, 2017) * Grenade (Scholastic, 2018) * Allies (Scholastic, 2019) * Resist (Scholastic, 2020) * Ground Zero (Scholastic, 2021) * Two Degrees (Scholastic, 2022) * Captain America: The Ghost Army (Scholastic, 2023) * Heroes (Scholastic, 2024) == Made plays == * The Legend of Sleepy Hollow (Knoxville Actors Co-op, 2004), made from the 1820 short story by Washington Irving * Measured in Labor: The Coal Creek Project (Knoxville Actors Co-op, 2004) * Young Nickory (Knoxville Actors Co-op, 1999) * The Gift of the Magi (Knoxville Actors Co-op, 1999), made from the 1905 short story by O. Henry * Indian Myths and Legends (Knoxville Actors Co-op, 1998) * Sweet Sixteen (Knoxville Actors Co-op, 1998) == Grants and awards == * Finalist, 2002 Marguerite de Angeli Contest (now known as the Delacorte Dell Yearling Contest for a First Middle- Grade Novel) * Co-winner, 2003 Kimberly Colen Memorial Grant from SCBWI * Winner of the 2017 National Jewish Book Award in the Young Adult Literature category for his book Refugee * Winner of the 2018 Global Read Aloud in the Middle School/Junior High Choice category of his book Refugee * Winner of the 2019–2020 Young Hoosier Book Award (Middle Grades) for Refugee * 2020 Buxtehude Bull == References == == Other websites == * * Category:1972 births Category:Living people Category:American novelists Category:Writers from Tennessee Category:People from Knoxville, Tennessee",
 "title": "Alan Gratz"
}