{
 "id": "1125117",
 "text": "This article are the athletes who won a medal in the 1896 Summer Olympics. At the time, winners were given silver medals and 2nd place athletes were given bronze medals. 3rd place athletes were not given any award. This list only shows medals given after the Olympics by the International Olympic Committee. Contents Contents Contents #Athletics #Cycling #Fencing # * Gymnastics #Shooting #Swimming # * Tennis #Weightlifting #Wrestling __NOTOC__ == Athletics == 100 metres 100 metres 400 metres 800 metres 1500 metres 110 meter hurdles none awarded Marathon High jump none awarded High jump none awarded Pole vault Pole vault Long jump Triple jump Shot put Discus throw == Cycling == Road race Sprint Time trial 10 km 100 km not awarded 12 hour race not awarded == Fencing == Foil Foil Masters foil not awarded Sabre == Gymnastics == Horizontal bar not awarded Parallel bars not awarded Pommel horse not awarded Rings Rope climbing Vault Team parallel bars Conrad Böcker Alfred Flatow Gustav Flatow Georg Hilmar Fritz Hofmann Fritz Manteuffel Karl Neukirch Richard Röstel Gustav Schuft Carl Schuhmann Hermann Weingärtner Nikolaos Andriakopoulos Sotirios Athanasopoulos Petros Persakis Thomas Xenakis Ioannis Chrysafis Ioannis Mitropoulos Dimitrios Loundras Filippos Karvelas Team horizontal bar Conrad Böcker Alfred Flatow Gustav Flatow Georg Hilmar Fritz Hofmann Fritz Manteuffel Karl Neukirch Richard Röstel Gustav Schuft Carl Schuhmann Hermann Weingärtner not awarded not awarded == Shooting == 200 metre military rifle 300 metre free rifle, three positions 25 metre military pistol 25 metre rapid fire pistol 30 metre free pistol == Swimming == 100 m freestyle not awarded 500 m freestyle 1200 m freestyle none awarded Sailors 100 m freestyle == Tennis == Men’s singles Men’s singles Men's doubles Demetrios Petrokokkinos Dionysios Kasdaglis == Weightlifting == One hand lift Two hand lift == Wrestling == Greco-Roman ==References== ==Other websites== * Medalists Category:Olympics-related lists",
 "title": "List of 1896 Summer Olympics medal winners"
}