{
 "id": "1125919",
 "text": "The men's 1500 metres was a middle-distance running event. It was apart of the 1900 Summer Olympics in Paris. It was held on July 15, 1900. The race on a track. This track had a circumference of 500 metres. There were 9 athletes. These athletes were from 6 different nations. The event was won by Charles Bennett of Great Britain. This was their first medal in this event. ==Background== This was the 2nd time this event was run at the Olympics. It is one of 12 athletics events that has been at every Summer Olympics. None of the runners in the 1896 Summer Olympics also ran in this event. John Bray from the United States had the unofficial world record. Other than Bray, there were not many important 1500 runners. John Cregan, Alexander Grant, and George Orton were some of the most important distance runners in the 1900 Olympic games. However, they did not run in this event. This might have been because the event was on a Sunday. This was the first time that Austria, Bohemia, Denmark, and Great Britain ran in this event. France and the United States were the only countries that had competed in 1896 and in 1900 in this event. ==Competition== The competition had one round. It was 3 laps around the track. The track was 500-metres long. ==Records== These were world records and Olympic records before the 1900 Summer Olympics. The times are in minutes. Charles Bennett ran a new Olympic record and an unofficial world record. His time was 4:06.2. ==Schedule== Date Time Round Sunday, 15 July 1900 15:30 Final ==Results== Bennett was in front of the race the entire time. Deloge was slightly behind. In the last lap, Bennett sped ahead. His last 500 metres was in 1 minute and 10.2 seconds. This beat he unofficial world record. Bennett finished 5 yards ahead of Deloge. John Bray beat David Hall by two yards. Rank Athlete Nation Time Notes Charles Bennett 4:06.2 Henri Deloge 4:06.6 John Bray 4:07.2 4 David Hall 4:07.5 5 Christian Christensen Unknown 6 Hermann Wraschtil Unknown 7–9 Ondřej Pukl Unknown 7–9 John Rimmer Unknown 7–9 Louis Segondi Unknown ==References== ==Sources== * International Olympic Committee. * De Wael, Herman. Herman's Full Olympians: \"Athletics 1900\". Accessed 18 March 2006. Available electronically at . * Men's 1500 metres Category:1500 metres at the Olympics",
 "title": "Athletics at the 1900 Summer Olympics – Men's 1500 metres"
}