{
 "id": "1125745",
 "text": "Loglan is a constructed language made to test the Sapir–Whorf hypothesis. Dr. James Cooke Brown made the language starting in 1955 with the goal of making it so different from natural languages that learners would think in differently if the hypothesis was true. Loglan was the first logical language, although the most famous one is Lojban. Lojban was inspired by Loglan. Brown founded The Loglan Institute (TLI) to expand the language and other applications of it. Although he released many publications about its design, he continued to claim legal restrictions on its use. Because of this, a group of his followers later formed the Logical Language Group to create the language Lojban along the same principles, but with the intention to make it freely available and encourage its use as a real language. In addition, Lojban had a new vocabulary. == Goals == Loglan (a shorter version of \"logical language\") was made to test if people speaking a \"logical language\" would in some way think more logically, as the Sapir–Whorf hypothesis might predict. The language's grammar is based on predicate logic. The grammar was intended to be simple enough to be teachable and manageable, yet complex enough to allow people to think and speak in the language. Brown wanted Loglan to be as culturally neutral as possible and metaphysically parsimonious, which means that the language has few \"categories\" necessary to be used. In English an example of a necessary (or obligatory) category is the time-tense of verbs, as all verbs must have a tense. Brown also wanted the language to be completely regular and unambiguous. Readers can only understand a sentence in one way. Additionally, the syllables of words were made so that a series of syllables can be separated into words in only one way, even if the word separation is not easily known from pauses in speech. It has few phonemes (sounds that make up syllables), so that speakers with \"accents\" can be understood more often. To make the vocabulary easier to learn, words were made to be partly the same with related words in the eight most widely spoken languages in the world in 1955. == Alphabet == In the final version of 1989Brown, James Cooke (1989, 4th edition). Loglan 1: A Logical Language. Gainesville, Florida: The Loglan Institute, Inc. the alphabet used to write Loglan was the same as the alphabet used to write English, with 26 letters. Each letter represented a phoneme. == References == Category:Constructed languages",
 "title": "Loglan"
}