{
 "id": "1125372",
 "text": "At the 1900 Summer Olympics, there were athletics events. In total, there were 117 athletes. These 117 athletes were from 15 different nations. There were 68 medals given out. 23 of these were gold medals. 23 of the medals were silver medals. 22 of the medals were bronze medals. In many countries, the media talked about the athletics events. They ignored the other events. The 23 events are the events that are said to be events by the International Olympic Committee. Some events used a handicap system, where some people were given advantages. Other events were only open to professional athletes. The IOC does not count these events. Competitions were on 14 July, 15 July, 16 July, 19 July, and 22 July. One of the competition days was on a Sunday. Many American athletes protested because of this. Some Americans did not compete in the finals. The competing conditions were worse than in 1896. There was no track for the Paris Games. The runners ran in a grass field with trees. The course was also 500 metres. Modern tracks are usually 400 metres long. ==Medal summary== 60 metres 7.0 7.1 7.2 100 metres 11.0 11.1 11.2 200 metres 22.2 22.8 22.9 400 metres 49.4 49.6 51.5 800 metres 2:01.2 2:03.0 2:03.8 1500 metres 4:06.2 4:06.6 4:07.2 Marathon 2:59:45 3:04:17 3:37:14 110 metres hurdles 15.4 15.5 15.6 200 metres hurdles 25.4 26.0 26.1 400 metres hurdles 57.6 58.3 58.8 2500 m steeplechase 7:34.4 7:38.0 7:52.4 4000 m steeplechase 12:58.4 12:58.6 12:58.8 5000 m team race 26 pts Henri Deloge Jacques Chastanié André Castanet Michel Champoudry Gaston Ragueneau 29 pts only two teams entered only two teams entered High jump 1.90 m 1.78 m 1.75 m Pole vault 3.30 m 3.25 m 3.20 m Long jump 7.185 m 7.175 m 6.950 m Triple jump 14.47 m 13.97 m 13.64 m Standing high jump 1.655 m 1.525 m 1.500 m Standing long jump 3.30 m 3.135 m 3.03 m Standing triple jump 10.58 m 9.95 m 9.50 m Shot put 14.10 m 12.85 m 12.37 m Discus throw 36.04 m 35.14 m 34.60 m Hammer throw 51.01 m 46.26 m 43.58 m These medals were given afterwards by the International Olympic Committee. At the time, winners were given silver medals. * ==Participating nations== * * * * * * * * * * * * * * * ==Notes== ==References== ==References== * International Olympic Committee. * De Wael, Herman. Herman's Full Olympians: \"Athletics 1900\". Accessed 18 March 2006. Available electronically at . * Category:1900 Summer Olympics events 1900",
 "title": "Athletics at the 1900 Summer Olympics"
}