{
 "id": "1125714",
 "text": "The forest rocket frog (Hyloxalus sylvaticus) is a frog. It lives in Peru. Scientists think it could live in Ecuador too. ==Body== The adult male frog is 25.7 mm long from nose to rear end and the adult female frog is 30.0 long. There are disks on its toes for climbing. There is extra skin on the toes of all four feet. The skin of the frog's back is dark green-brown in color to light copper brown in color. There are dark brown and black marks on the back. There is light dark gray and brown on the toes with some light gray. The top of the mouth is tan in color. The stripes on the sides of the body are light brown in color. The front of the neck, back of the belly, and bottoms of the back legs are dark yellow or orange in color. The chest and the rest of the belly are gray in color with black marks. The iris of the eye is bronze in color with black marks. The male frog's male organs are white in color. The male frog's voice sounds like a trill. ==Home== This frog lives on the east side of the Andes Mountains and in a place called the Huancabamba Depression. This frog lives in cloud forests. During the day, it looks for food near streams. At night, people find it under rocks, in streams, and near streams. People have seen this frog between 1920 and 3250 meters above sea level. ==Young== Scientists think the female frog lays eggs on dead leaves on the ground. After the eggs hatch, the male adult frogs carry the tadpoles on their backs. They carry them to muddy parts of streams. Scientists saw frogs carrying tadpoles and tadpoles swimming in muddy water in February. The tadpole is 13.0 mm long not counting the tail and 29.4 mm long counting the tail. ==Danger== Scientists say this frog is in big danger of dying out because people cut down forests to make farms, for example potato farms and because the fungal disease chytridiomycosis kills the frog. Because this frog lives at the tops of mountains, scientists think climate change could kill it. Climate change could make its home too dry. Other frogs from lower on the mountains could climb up looking for cooler places to live. Then all the frogs would try to eat the same food. ==References== Category:Frogs of South America",
 "title": "Hyloxalus sylvaticus"
}