{
 "id": "1125352",
 "text": "The 100 metres was the shortest track race in the 1896 Summer Olympics. The event had 3 heats (or rounds) and a final. The first round of the men's 100 metres race was the first event run at modern Olympics. It was run on 6 April 1896. The final was on 10 April. There were 15 athletes in this event. These 15 athletes were from 8 different nations. The event was won by Thomas Burke of the United States. Fritz Hofmann of Germany was in 2nd place. The Hungarian Alajos Szokolyi and American Francis Lane tied for 3rd place. ==Background== Fritz Hofmann was the most famous sprinter at this time. In 1893, he won the Championship of the Continent. Thomas Burke was an American champion in the 400 metres. However, he was not known in the 100 metres. The best sprinters in the world at the timedid not run. ==Competition== There were 21 athletes in the first round. These athletes were in 3 heats (or rounds). Each heat had 7 runners. The fastest 2 athletes in each round would run in the final. 6 of the runners quit before the races began. ==Records== This was the world record (in seconds) before the 1896 olympics. World Record 10.8 Luther Cary Paris (FRA) July 4, 1891 Cecil Lee Brussels (BEL) September 25, 1892 Étienne De Re Brussels (BEL) August 4, 1893 L. Atcherley Frankfurt (GER) April 13, 1895 Harry Beaton Rotterdam (NED) August 28, 1895 A new Olympic record was made after the competition. Date Event Athlete Time Notes 6 April 1896 Round 1 11.8 s OR In the first heat, Francis Lane set the first Olympic Record in 12.2 seconds. This time was tied in Heat 2 by Thomas Curtis. In the 3rd heat, Thomas Burke ran 11.8 seconds. This became the Olympic Record until the 1900 Olympics. ==Schedule== The times when the event started were not written down. The races started after King George I of Greece arrived at 3 p.m..Official Report, p. 57. The final was the first competition in the afternoon on Friday.Official Report, p. 84. Date Date Round Gregorian Julian Round Monday, 6 April 1896 Monday, 25 March 1896 Round 1 Friday, 10 April 1896 Friday, 29 March 1896 Final ==Results== ===Heats=== The first round of heats were on 6 April. The first heat of the 100 metres was the first competition in the Olympic Games. Francis Lane won the first heat. This made him the first winner of a modern Olympic race. All of the heats were won by people from the United States. ====Heat 1==== Rank Athlete Nation Time Notes 1 Francis Lane 12.2 , 2 Alajos Szokolyi 12.75 3 Charles Gmelin 12.9 4 Adolphe Grisel Unknown 5 Kurt Doerry Unknown — Leonidasz Manno — Luis Subercaseaux ====Heat 2==== Rank Athlete Nation Time Notes 1 Thomas Curtis 12.2, 2 Alexandros Chalkokondylis 12.75 3 Launceston Elliot 12.9 4 Eugen Schmidt Unknown 5 George Marshall Unknown — Alexandre Tuffère — Unknown Unknown (France or Hungary) ====Heat 3==== Rank Athlete Nation Time Notes 1 Thomas Burke 11.8 , 2 Fritz Hofmann 12.75 3 Friedrich Traun 13.6 4–5 Georgios Gennimatas Unknown 4–5 Henrik Sjöberg Unknown — Alfred Flatow — Konstantinos Mouratis ===Final=== Rank Athlete Nation Time Thomas Burke 12.0 Fritz Hofmann 12.2 Francis Lane 12.6 Alajos Szokolyi 12.6 5 Alexandros Chalkokondylis 12.6 — Thomas Curtis ==Results summary== Rank Athlete Nation Semifinals Final Notes Thomas Burke 11.8 12.0 Fritz Hofmann 12.6 12.2 Francis Lane 12.2 12.6 Alajos Szokolyi 12.8 12.6 5 Alexandros Chalkokondylis 12.8 12.6 6 Thomas Curtis 12.2 Launceston Elliot 12.9 Did not advance Charles Gmelin 12.9 Did not advance Friedrich Traun 13.5 Did not advance Eugen Schmidt Unknown Did not advance 4th in semifinal Adolphe Grisel Unknown Did not advance 4th in semifinal Georgios Gennimatas Unknown Did not advance 4th–5th in semifinal Henrik Sjöberg Unknown Did not advance 4th–5th in semifinal George Marshall Unknown Did not advance 5th in semifinal Kurt Doerry Unknown Did not advance 5th in semifinal — Louis Adler Did not advance — Harald Arbin Did not advance — Nándor Dáni Did not advance — Ralph Derr Did not advance — Alfred Flatow Did not advance — Leonidasz Manno Did not advance — Konstantinos Mouratis Did not advance — Luis Subercaseaux Did not advance — Jean Tournois Did not advance — Alexandre Tuffère Did not advance — Charles Vanoni Did not advance — István Zachar Did not advance ==References== * (Digitally available at la84foundation.org ) * (Excerpt available at la84foundation.org ) * * Men's 0100 metres",
 "title": "Athletics at the 1896 Summer Olympics – Men's 100 metres"
}