{
 "id": "1125711",
 "text": "BET Soul is an American pay television channel. The network is owned by Paramount Global. The channel debuted on August 1, 1998, and is currently owned by Paramount Global's BET. The channel showcases R&B;, funk, soul, neo soul, hip hop, jazz and Motown music from various decades. == History == From 1998-2015 the channel was originally named VH1 Soul. core artist as VH1 Soul included Aretha Franklin, Stevie Wonder, and Patti LaBelle. ===Early years (1998-2006)=== The channel, which was originally a commercial-free service, debuted on August 1, 1998 at 4:00pm, with VH1 Smooth which took the air an hour before, as part of the \"MTV Digital Suite\" of digital cable channels, which was sold only to cable providers to give them an advantage over satellite services. The first video shown on the channel was \"Boogie Wonderland\" by Earth, Wind & Fire. The channel’s theme music was composed by Walter Afanasieff. Before the first music video played, at 3:55pm, the channel showed a picture of Tupac Shakur, and underneath it the words In Memory of Tupac Shakur, 1971-1996, we will never be forgotten appeared, as the channel was dedicated to Tupac Shakur, and the rest of Shakur's life. In its early years, VH1 Soul's main focus was on R&B; and soul videos of the late 1960s, 1970s, 1980s, and 1990s, along with live performance clips from even earlier years. Janet Jackson, Prince, TLC, Usher, Tony Toni Tone, Marvin Gaye, Aretha Franklin, Patti LaBelle and Stevie Wonder were some of the channel's main staples. By 2003, the channel had stopped showing most of the pre-1990s videos, since these were often played on VH1 Classic's Soul Power program. The channel then gradually began to focus more on underground, alternative, and old skool hip-hop videos, while continuing to feature new R&B; musicians. ===Change of format (2006-2015)=== On February 1, 2006, VH1 Soul revamped its programming and introduced different one-hour themed video blocks to its schedule, as opposed to the prior random rotation of videos. However, the basic 'wheel schedule' structure remained, and does so to this day. After VH1 Soul revamped its programming, most record labels signed deals for Hip Hop videos broadcast on VH1 Soul in June 2006, including the labels Columbia Records and Epic Records. In Spring 2007, VH1 Soul, alongside its sister networks MTV Jams and MTV Hits, were briefly dropped from Time Warner Cable's Southern California systems that were formerly operated by Adelphia and Comcast. However, all three channels returned to TWC within a few months, under a new, specialized service tier. To date, however, the three networks remain conspicuously absent from many of Time Warner Cable and Bright House Networks' systems, most notably in New York City. Even as the 'Digital Suite' concept was discontinued, the network has neither offered to DirecTV nor Dish Network until 2016. The last edition of the Vibe Awards aired on the channel in November 2007, after a one-year hiatus due to the merger of The WB and UPN into The CW. By this time, as the channel's distribution increased, VH1 Soul began showing regular advertising. Commercials were removed in 2009, but were restored on January 1, 2011. For a short time from 2008 until 2009 the network aired non-music video programming in some timeslots, including VH1's The Salt- n-Pepa Show, alongside the documentary Black to the Future as part of the network's February 2009 Black History Month programming, along with out-of- format programming such as Hip Hop Honors, VH1 Rock Docs, and other programming from its Celebreality strand of original programming. Viewer complaints that resulted from the programming substitutions soon overpowered VH1's management, alongside other complaints for sister network VH1 Classic straying from its own mission. Soon, VH1 moved away from out-of-format programming on both channels, and by late 2009, VH1 Soul resumed a 24/7 video format. ===BET era (2015-present)=== On December 28, 2015, the channel was given over to BET Networks as part of the continuing reorganization of Viacom's (now Paramount's) assets due to ratings and financial issues in 2015, an issue that had already resulted in BET Networks taking editorial control of the former MTV Jams two months before. The network was rebranded as BET Soul on that day. Core artist as BET Soul include Musiq Soulchild, Kelly Price, Christina Milian, Aaron Soul, Terri Walker, Dru Hill, 112, Patti LaBelle and The Isley Brothers. The first song as BET Soul was \"True to Your Heart\" by 98 Degrees and Stevie Wonder. The launch party of the channel's rebrand to BET Soul was held in New Orleans, guests included Britney Spears, Eminem, Dr. Dre, 50 Cent, Jennifer Lopez, Pharrell, Mase, the members of Bone Thugs-n-Harmony, Jamie Foxx, Ginuwine, Mary J. Blige, 112, Jay-Z, Lil' Kim, DMC of Run DMC, R. Kelly, and Sean Combs. Other guests included Rick Rubin, and Russell Simmons, the founders of Def Jam Recordings. The launch party was presented by Billboard. BET Soul would change its image again on November 27, 2021, introducing a new logo more in line with BET's current re-imaging. This rebrand also saw the channel expand its blocks from one hour to two hours each, alongside the renaming of some blocks (such as \"Soul School\" to \"Diggin' in the Crates\") and the introduction of new blocks to the schedule (such as \"Woke Wednesday\"). Another alteration to the channel's programming was the return of non-music video programming to the network's schedule, via the weekly \"Cuffing SZN\" block. However, as of Spring 2022, the block seems to have been discontinued and returned to an all-music video format. Presently, a selection of R&B; hits from the past 10 years, as well as several 1980s and early 1990s hip-hop videos, can be seen on BET Soul. Several of the more R&B-influenced; modern-day rappers and their newest videos can also be regularly seen in heavy rotation on the channel; for example: The Roots, De La Soul, Kanye West, Common, and Talib Kweli. However, the channel still occasionally airs older 1980s or early 1990s R&B;/soul hits, such as Prince's \"Kiss\", Mariah Carey's \"Vision Of Love\", Stevie Wonder's \"Superstition\", or Chaka Khan's \"I Feel For You\". == Programming == === Current === * In Rotation (formerly \"The Soul Player\") – A random rotation of videos. The format is similar to how the channel was operated before February 1, 2006. * Chronicled (formerly \"The Soul Story\") – A block of videos by a single artist or group that are mostly shown in chronological order. * Diggin' In The Crates (formerly \"Soul School\") – This show features old school hip-hop and R&B; music videos. * WORLDwide (formerly \"One Planet, One Soul\" and \"Island Soul\") – This show features music videos by Caribbean and international artists with diverse genres such as Afrobeat, dancehall and reggae. * The Calming (formerly \"Soulphrodisiac\") – A Quiet Storm formatted show. The show primarily plays love songs and slow jams, and is similar to BET After Dark or BET's Midnight Love. * Woke Wednesday - A weekly block showcasing politically-charged or \"woke\" music videos every Wednesday. * Hit List: Loading... - A countdown block featuring the Top 20 Soul and R&B; videos of the week. * Ascending Soul - A block which features experimental soul videos. === Former === * Soul Squared – A block of old and current videos by various artists which airs two videos from the same artist back-to-back, in a similar manner to VH1 Classic's Tuesday Twoplay program. * Speak Your Soul – A viewer-requested video block. Viewers made requests on the channel's official website. (Discontinued with rebrand to BET Soul) * Live Soul – This show featured live performance clips by soul artists. (Discontinued) * Top 10 Best in Soul – This show featured videos by the most popular artists in R&B; and hip-hop music. The format is similar to MTV's Big 10. * Sub Soul – This show featured videos by Underground Soul artists. * Cuffing SZN - A short-lived weekly block of BET original programming such as American Soul and The Encore. Aired every Saturday night at 7:00pm EST. == References == Category:African-American culture Category:American television networks Category:Viacom Category:1998 establishments in the United States",
 "title": "BET Soul"
}