{
 "id": "112657",
 "text": "The Golden State Warriors are an American professional basketball team in the National Basketball Association. They are one of the oldest teams in the NBA. They played in Philadelphia as the Philadelphia Warriors from 1946 to 1962, in San Francisco from 1962 to 1971 and in Oakland as the Golden State Warriors from 1971 to 2019. Currently, they play in San Francisco, California at the Chase Center. The Warriors have won seven NBA championships, in 1947, 1956, 1975, 2015, 2017, 2018, and 2022. The Warriors are the third for both the most NBA championships and most Finals appearances; only the Los Angeles Lakers and Boston Celtics have more. Many great basketball players have played or still play for the Warriors, these players are Joe Fulks, Paul Arizin, Neil Johnston, Tim Hardaway, Wilt Chamberlain, Guy Rodgers, Al Attles, Rick Barry, Nate Thurmond, Chris Mullin, Latrell Sprewell, Stephen Curry, Kevin Durant, Klay Thompson, Draymond Green, Andre Iguodala, Shaun Livingston, Harrison Barnes, Matt Barnes, Zaza Pachulia, Kevon Looney, David West, Andrew Wiggins, Chris Paul, Jimmy Butler, and Jordan Poole. In the 2007 NBA playoffs, they pulled off one of the biggest upsets in NBA playoff history by upsetting the Dallas Mavericks, who lost to the Miami Heat in last year's Finals in six games and finished with 67 wins and 15 losses. The Mavs also had Dirk Nowitzki, who won MVP that year. Before they shocked Dirk's Mavericks, the Warriors had Baron Davis and they also had 42 wins and 40 losses. They won the series 4-2 in Game 6, but lost to the Utah Jazz in five games in the second round. In 2016, the Warriors went back to NBA Finals and met the Cleveland Cavaliers, who they beat the year before in six games, but they became the 11th team to blow a 3-1 series lead and the first to do it in the NBA Finals and lost. Before losing 4-3 to the Cavaliers, they had 73 wins and 9 losses, breaking the 1996 Chicago Bulls' 72-10 record and also becoming the 10th team to overcome a 3-1 series deficit to win the series against the Oklahoma City Thunder. With the addition of Durant, the Warriors would win back-to-back titles against the Cavaliers in 2017 and 2018 (including sweeping the Cavs in the latter) with Durant being the Finals MVP both times before losing to the Toronto Raptors in 2019 in six games following injuries to Durant and Klay, ending their chances of a three-peat. Durant then left the Warriors and joined the Brooklyn Nets. After missing the playoffs the next two seasons, the Warriors (with their core at full strength) returned to the 2022 Finals and defeated the Boston Celtics in six games. ==References== ==Other websites== * Category:1946 establishments in the United States Category:1940s establishments in California",
 "title": "Golden State Warriors"
}