{
 "id": "1126609",
 "text": "Hunting High and Low is the debut studio album by the Norwegian band a-ha. It was released on 1 June 1985 by Warner Bros. Records. The album was a commercial success. It had several hit singles, including \"Take On Me\" and \"The Sun Always Shines on T.V.\". The album's success helped a-ha gain international recognition. It established them as one of the most popular bands of the 1980s. == Background and production == a-ha formed in 1982 and spent several years refining their sound and recording demos. After signing with Warner Bros. Records in 1983, the band began recording Hunting High and Low with producer Tony Mansfield. The album has a mix of synth-pop and new wave styles. It has a distinctive sound characterized by Morten Harket's soaring vocals, Paul Waaktaar-Savoy's guitar work, and Magne Furuholmen's keyboard melodies. == Release and reception == Hunting High and Low was released on 1 June 1985. It received widespread acclaim. Critics praised the album's polished production, catchy melodies, and the band's ability to blend pop sensibilities with emotional depth. The album reached the top 10 in several countries, including the United Kingdom and the United States, and has sold over 10 million copies worldwide. == Singles == The album produced five singles. \"Take On Me\" was the most successful. The song's innovative music video, which combined live-action and animation, played a significant role in its success and won several awards. * \"Take on Me\" – released 19 October 1984 * \"Love Is Reason\" – released 1 April 1985 * \"The Sun Always Shines on T.V.\" – released 16 December 1985 * \"Train of Thought\" – released 24 March 1986 * \"Hunting High and Low\" – released 2 June 1986 == Track listing == == Personnel == * Morten Harket – vocals * Paul Waaktaar-Savoy – guitars, backing vocals * Magne Furuholmen – keyboards, backing vocals * Tony Mansfield – production * John Ratcliff – engineering, production on \"Take On Me\" and \"The Sun Always Shines on T.V.\" * Alan Tarney – production on \"Take On Me\" == Charts == * Norway: #2 * UK: #2 * US: #15 == Certifications == * United Kingdom: 3× Platinum * United States: Platinum * Norway: Platinum == Other websites == * Hunting High and Low at AllMusic Category:1985 albums Category:A-ha",
 "title": "Hunting High and Low"
}