{
 "id": "1126359",
 "text": "Cháná Szenes (born Szenes Aniko; ), was a female well-assimilatied Hungarian- born Jewish writer, poet, diarist, a British army paratrooper, soldier, and a Special Operation Executive (SOE) member and recruit. Born into a well- assimilatied Hungarian-born Jewish family in 1921 in Budapest, the capital city of Kingdom of Hungary (now modern-day Hungary), she graduated in 1939, and went to live in Mandatory Palestine. In 1943, she enlisted in the British Army as a paratrooper and soldier, and served in the British Army until 1944. Hannah and her comrades had parachuted into German-occupied territories, and fought the Germans there in battles. On 14 March 1944, Hannah and two (2) of her comrades had parachuted themselves on a journey mission to German-occupied Yugoslavia, and had landed there. Less than two months later, on 2 May, they approached a Nazi German train, and seriously wounded/killed the soldiers. When they took control over the train and opened the train, they discovered and rescued Jewish refugees about to be deported to a concentration camp. Cháná spoke to and comforted/consoled a young Jewish woman, who had gotten grey hair, due to the fear of seeing the horrific atrocities commited by the Nazi officers. Due to her excessive love and taste for poetry, in her free time, Cháná had later wrote about a poem about the incident. Ultimately, Cháná and her comrades were supposed to go on a further mission in Yugoslavia, but were asked by the commander to reconsider, as they learned that Hungary had just been invaded and occupied by Nazi Germany, in March. Regardless, Cháná and two (2) of her comrades decided to journey to Hungary, and defend the country from the German officers. Cháná and her two (2) comrades did illegaly cross the border into Hungary, but shortly after, they were discovered by Hungarian soldiers to have illegally crossed the border, and were arrested on 7 June. Cháná and her two (2) comrades were taken to and locked in different prison cells. The Hungarian soldiers had discovered that Cháná and her comrades were British Army paratroopers and soldiers, after discovering their transmitter code. When Cháná was in prison, the Hungarian soldiers and police officers asked her the number for her transmitter code, several times. When she refused to answer them, she was stripped naked, tied to a chair, and beaten/tortured for several hours, for refusing to give out information from the army. She still did not give out information. Cháná was frequently tortured and beaten by the guards for refusing to give out information she had when she was in the British Army, when they interrogated her. Ultimately, Katarin Szenes, the mother of Chána, was arrested and detained by the Hungarian police officers and guards. The Hungarian officers threatened to torture and murder her mother, if she refused to cooperate with them. Regardless, other than giving out her full name, Cháná still refused to give out the information. Cháná wrote her last poem on 15 June, just eight (8) days after her arrest and detainment. It was later discovered by a guard in the prison, after her execution and murder. On 28 October, Cháná Szenes was put on trial and charged with treason, for supposedly betraying Hungary, her country. Cháná plead innoncent, and said that the criminal charges against her were simply just false. She was asked to plea guilty by the court, and acknowledge her supposed \"crimes\", but she strongly refused. As a result, she was given a death sentence. She was going to be executed the same day, but due to the fact that the court was just given a new judge, the execution was rescheduled for 7 November, which would be about ten (10) days from the day she was put on trial. On that same day she was resechuled to be executed, she was taken away from her prison cell and was executed by firing squad. Cháná Szenes was murdered on , by execution via firing squad, in Budapest, the capital city of Hungary. Category:1921 births Category:1944 deaths Category:Poets Category:Diarists",
 "title": "Cháná Szenes"
}