{
 "id": "1126823",
 "text": "Julia Cuthbert Geary (née Smith; 26 May 1927 – 19 June 1997) was an English television director and producer. She was best known as the co-creator (along with Tony Holland) of the BBC soap opera EastEnders, also working as the director and the first producer of the series. == Early life == Julia Cuthbert Smith was born in Paddington, Greater London, England on 26 May 1927,England & Wales, Civil Registration Birth Index, 1916-2007: APR 1927 1a 37 PADDINGTON — Julia C Smith as the only child to Edward Cuthbert Smith (1897–1968),England & Wales, Civil Registration Birth Index, 1837-1915: APR 1897 10b 229 TYNEMOUTH — Edward Cuthbert SmithEngland & Wales, Civil Registration Death Index, 1916-2007: APR 1968 (aged 70) 5e 506 WANDSWORTH — Edward Smith a musician who taught at the Royal Academy of Music (RAM), and Elfriede Frances Gritton (née Menges; 1897–1988).England & Wales, Civil Registration Birth Index, 1837-1915: JUL 1897 2b 287 STEYNING — Frances Elfriede G MengesEngland & Wales, Civil Registration Death Index, 1916-2007: JAN 1988 (aged 90) 12 1640 HAMMERSMITH — Elfrieda Frances G C Smith Smith trained at the Royal Academy of Dramatic Art (RADA). She graduated with her diploma in acting in 1946. Smith was a maternal niece of Isolde Marie Boyd (née Menges; 1893–1976),England & Wales, Civil Registration Birth Index, 1837-1915: APR 1893 2b 296 STEYNING — Isolde Marie MengesEngland & Wales, Civil Registration Death Index, 1916-2007: JAN 1976 (aged 82) 14 2460 RICHMOND UPON THAMES — Isolde Marie Boyd a violinist, and Sigfried Frederick Herbert Menges (1902–1972),England & Wales, Civil Registration Birth Index, 1837-1915: OCT 1902 2b 248 STEYNING — Siegfried F H MengesEngland & Wales, Civil Registration Death Index, 1916-2007: JAN 1972 (aged 69) 5b 2201 HAMPSTEAD — Siegfried Frederick N Menges a composer and conductor. She was a cousin of Christopher J Menges (born 1940),England & Wales, Civil Registration Birth Index, 1916-2007: OCT 1940 6a 1563 KINGTON — Christopher J Menges a cinematographer and film producer. Her cousin credits her with being an inspiration of his own career. == Personal life == Smith married David Maxwell Valentine Geary (1928–2006)England & Wales, Civil Registration Birth Index, 1916-2007: JAN 1928 3a 1261 HATFIELD — David M V GearyEngland & Wales, Civil Registration Death Index, 1916-2007: AUG 2006 (aged 78) KDT13 063 KENT — David Maxwell V Geary in Ealing, Middlesex on 2 April 1962, when they were both 34.England & Wales, Civil Registration Marriage Index, 1916-2005: APR 1962 5e 21 EALING — Julia C Smith = David M Geary The couple divorced in 1966. She retained Geary's surname legally after their divorce and sometimes used it when conducting personal business, while continuing to use her maiden name professionally. Smith resided in Chiswick, London, with her dog, Roly, an apricot coloured standard poodle. Roly portrayed Roly in EastEnders (1985–1993). Roly died on 2 August 1995, at the age of 10, following an operation for breathing problems which were aggravated by the heatwave. === Death === Smith died from cancer at the Royal Marsden Hospital in Chelsea, London on 19 June 1997, after a short battle with the illness. She was 70.England & Wales, Civil Registration Death Index, 1916-2007: JUN 1997 B55B 88 KENSINGTON AND CHELSEA — Julia Geary Her funeral took place at Mortlake Crematorium in Kew, London Borough of Richmond upon Thames on 30 June 1997, and was attended by several stalwart cast members from EastEnders, including; June Brown (Dot Cotton), Pam St Clement (Pat Evans), Wendy Richard (Pauline Fowler), and Leslie Grantham (Den Watts). == References == Category:1927 births Category:1997 deaths",
 "title": "Julia Smith"
}