{
 "id": "1126964",
 "text": "In homogeneous catalysis, the catalyst and the reagents are in the same phase of matter as each other (e.g. solid, liquid, gas). Most homogeneous catalysis takes place in the liquid phase. The word homogeneous comes from the Ancient Greek homos ( “the same”) and genos (“kind”). == Examples == === Enzymes === Enzymes are special proteins in living things that speed up biochemical reactions. Without enzymes, life as we know it would not exist, as most of the processes keeping animals, plants, and fungi alive would be too slow. In industry, enzymes are used to make cheese, washing detergents, and leather. === Organometallic complexes === In industry, many homogeneous catalysts are co-ordination complexes. These molecules have an electrically charged metal atom known as an ion in their centres, which is connected to a number of functional groups through pairs of donated electrons. Co-ordination complexes are often intensely coloured, and in high concentrations, they are typically highly toxic to humans. == Advantages == * Homogeneous catalysts are often highly selective. This means that they do not produce many waste products. * As the catalyst and the reactants are in the same phase of matter as each other, it is easy for the atoms to get close to each other. If the conditions are right, this results in very high reaction rates, even at low temperatures. * Working out the structure of homogeneous catalysis is comparatively easy. Scientists can do this with a special type of spectroscopy known as NMR. == Disadvantages == * It is often tricky to recover homogeneous catalysts from reactors. Every time a reaction runs to completion, some catalyst will be lost. This quickly becomes expensive to replace if the reaction is being ran on an industrial scale. * Homogeneous catalysts are often very sensitive to temperature and pH (how acidic or basic the reaction mixture is). If chemists do not carefully monitor the reactor conditions, the catalyst may be irreversibly damaged. == References == Category:Chemistry",
 "title": "Homogeneous catalysis"
}