{
 "id": "1126535",
 "text": "The Dennis Dart is a single-decker chassis of a bus. It was built from 1989 to 2008 by Dennis, and then TransBus International and then Alexander Dennis. == First generation (step-entrance) == The Dennis Dart is a chassis of a bus, It has a step-entrance. It was made from 1989 to 1996 by Dennis. The Dart chassis could be built on the following bodies: * Duple Dartline bodyworkMajor Show 88 Commercial Motor 27 October 1988 * Wadham Stringer bodywork, * UVG Urbanstar bodywork * Wright Handybus bodywork * East Lancs EL2000 bodywork * Alexander Dash bodywork === Gallery === File:DennisDartDupleDartlineBusG123RGT (cropped).jpg|Arriva North West & Wales early (1989) Dennis Dart with Duple Dartline bodywork in Crewe File:Avon Buses Dennis Dart 962.JPG|Dennis Dart with Plaxton Pointer (step entrance) bodywork at Birkenhead bus station File:Arriva Southern Counties 3132.JPG|Dennis Dart with Northern Counties Paladin bodywork at the 2007 Cobham bus museum ==Second generation (Dart SLF)== The Dennis Dart SLF (Super Low Floor) is a chassis of a bus, It has a low-floor.25 Years Ago: The birth of the Dennis Dart Buses issue 714 September 2014 page 22The History of Alexander Dennis Alexander Dennis It was made from 1996 to 2008 by Dennis. From 1996 to 1997, Dennis made a chassis of the Dart SLF for the Plaxton Pointer 1 bodywork. === Improvements === From 1997 to 2008, Dennis made an improved chassis of the Dart SLF for the Plaxton Pointer 2 bodywork. The improved Dart SLF chassis could be built on the following bodies: * Plaxton Pointer 2 bodywork * East Lancs Spryte bodywork * UVG Urbanstar bodywork * Wright Crusader bodywork * Alexander ALX200 bodywork * Marshall Capital bodywork * Caetano Nimbus bodywork * MCV Evolution bodywork ==== Dart SPD ==== In 1997, Dennis made a longer chassis of the Dart SLF called the Dart SPD (Super Pointer Dart), Its length was long. The Dart SPD chassis could be built on the Plaxton Pointer 2 bodywork and the East Lancs Myllennium bodywork, ==== Dart MPD ==== In 1998, Dennis made a smaller chassis of the Dart SLF called the Dart MPD (Mini Pointer Dart), Its length was long. The Dart MPD chassis could be built on the following bodies: * Plaxton Pointer 2 bodywork * Alexander ALX200 bodywork * Alexander Dennis Enviro200 bodywork * East Lancs Esteem bodywork * East Lancs Myllennium bodywork ==== Narrow width Dart SLF ==== In 2002, TransBus made a narrower chassis of the Dart SLF called the Narrow width Dart SLF, These were made because Guernsey and Jersey's roads are narrow. ==== Thomas SLF 200 ==== In 1998, Dennis and Thomas Built Buses made a chassis of the Dart SLF called the Thomas SLF 200. It was made for the North American market, It was built on Alexander ALX200 bodywork. In the 2000s, Thomas Built Buses stopped making the chassis. From 2000 to 2003, It was made by Dennis and Daimler Truck North America and called the DaimlerChrysler SLF 200.Thomas SLF 200 Thomas Built BusesDaimlerChrysler SLF 200 Thomas Built Buses ==== Gallery ==== File:S824 WYD 42824 East Lancs Spryte- Dennis Dart (8528234001).jpg|First Somerset & Avon East Lancs Spryte with Dennis Dart SLF bodywork in Bath File:Arriva NWW Dart ALX200 1.jpg|Arriva North West and Wales Dennis Dart SLF with Alexander ALX200 bodywork in Liverpool File:CHASE BUS SERVICES Chasetown, Staffs - Flickr - secret coach park.jpg|Chase Coaches Dennis Dart SLF with UVG Urbanstar bodywork ==Exports== ===Australia=== In 1997; ACTION of Canberra ordered 25 Dart SLFs with Wright Crusader bodywork,Low-Floor Buses Fleetline issue 247 July 1997 page 132 Brisbane Bus Lines ordered 3 Dart SLFs,A Friendly Dart Truck & Bus Transportation July 1997 page 150 Invicta Bus Services ordered 27 Dart SLFs,Invicta Sells to Grenda Australian Bus Panorama issue 24/5 March 2009 page 12Melbourne's TeleBus: a pioneer of on-demand services Australian Bus issue 98 March 2020 page 20 TransAdelaide ordered 2 Dart SLFsDennis Buses in Adelaide Transit Australia June 1997 page 138 Transperth ordered 2 Dart SLFs.Transperth News Rattler issue 399 January 2006 page 6 ===Canada=== In British Columbia, BC Transit ordered 90 Dart SLFs with Plaxton Pointer 2 bodies. ===Hong Kong & Macau=== In Hong Kong, Citybus, Kowloon Motor Bus, New Lantao Bus, New World First Bus and Park Island Transport ordered Dart SLFs. Some of Citybus buses were sent back to Stagecoach Group in England for use in Devon and Hampshire.Dart regains its Hong Kong look Buses issue 775 October 2019 page 67Far East Pointer Darts Buses issue 784 July 2020 pages 44/45 In Macau, Transmac ordered air-conditioned Dart SLFs with Plaxton Pointer 2 bodies in January 1996. ===Malta=== In 1997, Paramount Garage of Malta ordered 4 Dart SLFs, the first two were with East Lancs Spryte bodies and the last 2 were with Plaxton Pointer bodies. ===Netherlands=== In the Netherlands. Arriva Netherlands ordered 50 Darts with Alexander ALX200 bodies. ===Portugal=== In Portugal, Stagecoach Group ordered 10 Dart SLFs.Darting around Lancashire Buses issue 793 April 2021 ===Singapore=== In 1994, Singapore Bus Service ordered 10 Darts with Duple Metsec bodies. ==Notes== ==References== ==Other websites== * Dennis Dart SLF Alexander Dennis Category:Alexander Dennis buses Dart Category:Low-floor buses Category:Full-size buses",
 "title": "Dennis Dart"
}