{
 "id": "11265",
 "text": "The New Testament is part of the Christian Bible, and the most important religious writing of Christianity. It tells the story of Jesus Christ, his followers, and the beginnings of Christianity. It was written in Ancient Greek. The New Testament is made up of different parts. In total, there are 27 texts in the New Testament. The Eastern Orthodox Church, the Roman Catholic Church and the Protestant Churches have the same texts, but their arrangement varies; the Syriac Churches and the Ethiopian Churches have different versions. The Syriac Churches do not put Peter 2, John 2 and 3, Jude and the Revelations in the New Testament. The Ethiopian Churches do not have a common canon. Four of the Books of the New Testament are the Gospels. Most of the others are Epistles. == The Four Gospels == Each of the Gospels tells the story of Jesus Christ, or the young Messiah, who Christians believe is the \"Son of God who is born to save the world from sin\". Each of the Gospels tell this same story, with a little more or less detail from the other. The other books tell about the history of the church and explain the Christian faith through letters written to persons and groups that have believed in Jesus The traditional author is listed after each entry. * The Gospel of Matthew, traditionally the Apostle Matthew, son of Alphaeus. * The Gospel of Mark, traditionally Mark, who wrote down the narrative given by the Apostle Simon, called Peter. * The Gospel of Luke, traditionally Luke, who was a companion of the Apostle Paul, who was formerly called Saul. * The Gospel of John, traditionally John the Apostle. == Acts of the Apostles == * Acts of the Apostles (or Acts), the story of the apostles after the Gospels' story == Pauline epistles == Pauline epistles, the 13 or 14 letters believed to be written by Saint Paul the Apostle. They are named for the person or group to which they were sent. * Romans * First Corinthians * Second Corinthians * Galatians * Ephesians * Philippians * Colossians * First Thessalonians * Second Thessalonians * First Timothy * Second Timothy * Titus * Philemon * Hebrews was traditionally attributed to Paul, but nowhere is the author mentioned. == General epistles == General epistles are other letters which are named for the person traditionally believed to have written them. * James * First Peter * Second Peter * First John * Second John * Third John * Jude == Book of Revelation == * Book of Revelation == References == == Other websites == * The New Testament Gateway *Full text in original Greek",
 "title": "New Testament"
}