{
 "id": "1126077",
 "text": "The men's points race was a track cycling event in the 1900 Summer Olympics. It was also called the “Course de Primes.” The competition was on 15 September 1900. It was at the Vélodrome de Vincennes. There were 13 athletes. These athletes were from 3 nations. Enrico Brusoni of Italy won. He won 5 of the laps. Karl Duill of Germany was in 2nd place. Louis Trousselier of France was in 3rd. == Background == This was the first time this event was in the Olympics. It was no in the Olympics again until 1984. After 1984, it was in every Summer Games until 2008. The women's version was from 1996 through 2008. ==Competition== The competition was similar to the modern points race. The event was 5 kilometres. The first 3 cyclists to finish a lap were given points. You were given 3 points to finish the lap in 1st. You were given 2 points to finish the lap in 2nd. You were given 1 point to finish the lap in 3rd. The cyclist with the most points won. On the last lap, the points were tripled. There was one race. All cyclists started at once. ==Schedule== Date Time Round Saturday, 15 September 1900 Final ==Summary== The event was on 15 September. Ferdinand Vasserot won the first lap. He only won 1 point after that. Enrico Brusoni won the 2nd and 3rd laps. This put him in 1st place. He had 6 points. Louis Trousselier was behind him on those laps. This gave him 4 points. This put him in 2nd place. J. Bérard won the 4th lap. This put him in 2nd place(between Brusoni and Trousselier). He had 5 points. Brusoni won the 5th lap. At this time, he had 9 points. Bérard's had 5 points. Trousselier had 4 points. Karl Duill won the 6th and 7th laps. This put him at 7 points. He was now in 2nd place. He was only 2 points behind Brusoni. On the 6th lap, Trousselier also gained 2 points. He stayed in 3rd place. Bérard was now in 4th place. Brusoni, Duill, and Trousselier stayed in 1st, 2nd, and 3rd place after that for the rest of the race. Brusoni won the 8th lap. He now had 12 points. Duill had 7. Trousselier won the 9th lap. Duill was in 2nd place. This made Duill and Trousselier tied in 2nd place. they both had 9 points now. Brusoni won the last lap, however. This gave him 9 extra points. Duill and Trousselier did not score on the last lap. Duill had a race with Trousselier for 2nd place. Duill won. Rank Cyclist Nation 1 2 3 4 5 6 7 8 9 10 Total Enrico Brusoni 0 3 3 0 3 0 0 3 0 9 21 Karl Duill 0 0 1 0 0 3 3 0 2 0 9 Louis Trousselier 0 2 2 0 0 2 0 0 3 0 9 4 Chaput 0 0 0 0 2 0 0 0 0 6 8 5 J. Bérard 2 0 0 3 0 0 0 0 0 0 5 6 Adolphe Cayron 0 1 0 0 0 0 0 0 0 3 4 7 Octave Coisy 0 0 0 0 0 0 2 2 0 0 4 7 Ferdinand Vasserot 3 0 0 0 0 1 0 0 0 0 4 9 Marcel Dohis 1 0 0 0 1 0 0 0 0 0 2 9 Germain 0 0 0 0 0 0 1 1 0 0 2 9 Giacomo Stratta 0 0 0 2 0 0 0 0 0 0 2 12 Georges Coindre 0 0 0 1 0 0 0 0 0 0 1 12 Luigi Colombo 0 0 0 0 0 0 0 0 1 0 1 ==References== Men's points race",
 "title": "Cycling at the 1900 Summer Olympics – Men's points race"
}