{
 "id": "1126079",
 "text": "The men's 25 kilometres was a cycling event in the 1900 Summer Olympics. Amateurs could race in this event. There was no handicapping. It was on 15 September. There were 10 cyclists. 4 of these cyclists were also in the sprint. Louis Bastien of France won the event. Lloyd Hildebrand was in 2nd. Auguste Daumain was in third. Won of the cyclists, Louis Trousselier, would win the 1905 Tour de France. There were prizes for the top 4 athletes. Art was given for 1st place. The art was worth 400 francs. 300 francs was given for 2nd place. 200 francs were given for 3rd place. 100 francs were given for 4th. ==Background== From 1896 to 1924 (except 1912), track cycling had many different racing distances. This distance changed each time. The distance was anywhere from -mile to 100 kilometres. In 1896, there was also a 12 hour race. Some of the racers went further than 300 kilometres. 1900 was the only 25 kilometres race in the Olympics.Louis Bastien was the favorite racer. He had won the 100 kilometres world championship. John Henry Lake and Lloyd Hildebrand were also popular cyclists. ==Competition format== The race was 25 kilometres long. The race track was 500 metres. This meant that there were 50 laps. There was one race. ==Schedule== Date Time Round Saturday, 15 September 1900 Final ==Results== Bastien quickly went to the front. Lake and Hildebrand were close behind. Lake dropped out, however. Rank Cyclist Nation 10 km 20 km Time Louis Bastien 10:04.6 20:28.0 25:36.2 Lloyd Hildebrand Recorded as Great Britain and Ireland until 2024. Unknown Unknown 28:09.4 Auguste Daumain Unknown Unknown 29:36.2 4 Maxime Bertrand Unknown Unknown Unknown — Léon Gingembre Unknown Unknown — Louis Trousselier Unknown Unknown — John Henry Lake Unknown Unknown — A. Porcher Unknown Unknown — Paul Gottron Unknown Unknown — J. Bérard Unknown Unknown ==References== * International Olympic Committee medal winners database * De Wael, Herman. Herman's Full Olympians: \"Cycling - track 1900\". Accessed 19 March 2006. Available electronically at . * Category:Cycling at the 1900 Summer Olympics",
 "title": "Cycling at the 1900 Summer Olympics – Men's 25 kilometres"
}