{
 "id": "1126901",
 "text": "==Premiers of Barbados (1953-1966)== # Incumbent Portrait Tenure Political Affiliation Took Office Left Office 1 Grantley Herbert Adams 1 February 1953 17 April 1958 Barbados Labour Party 2 Hugh Gordon Cummins 17 April 1958 8 December 1961 Barbados Labour Party 3 Errol Barrow 8 December 1961 18 November 1966 Democratic Labour Party == Monarch (1966–2021) == The succession to the Barbadian throne was the same as the succession to the British throne. Monarch Portrait Reign Royal House Prime Minister Reign start Reign end Duration 1 Queen Elizabeth II 1966 30 November 2021 years Windsor Barrow Adams St. John Sandiford Arthur Thompson Stuart Mottley === Governor-General === Under the Constitution of Barbados, before its amendment in 2021, the governor-general was the representative of the monarch in Barbados and exercised most of the powers of the monarch. The governor-general was appointed for an indefinite term, serving at the pleasure of the monarch. Since Barbados was granted independence by the Barbados Independence Act 1966, rather than being first established as a semi-autonomous Dominion and later promoted to independence by the Statute of Westminster 1931, the governor-general had always been appointed solely on the advice of the Cabinet of Barbados, without the involvement of the British government, with the sole exception of John Montague Stow, the last colonial governor, who served as governor-general temporarily until he was replaced by Sir Arleigh Winston Scott. In the event of a vacancy the chief justice served as administrator of the government. ; Status Portrait Governor-General Term of office Monarch Prime Minister Took office Left office Time in office 1 Sir John Montague Stow 1966 1967 Elizabeth II Barrow 2 Sir Arleigh Winston Scott 1967 1976 – Sir William Randolph Douglas 1976 1976 Barrow Adams 3 Sir Deighton Lisle Ward 1976 1984 Adams – Sir William Randolph Douglas 1984 1984 4 Sir Hugh Springer 1984 1990 Adams St. John Barrow Sandiford 5 Dame Nita Barrow 1990 1995 Sandiford Arthur – Sir Denys Williams 1995 1996 Arthur 6 Sir Clifford Husbands 1996 2011 Arthur Thompson Stuart – Judge of the Supreme Court Elliott Belgrave 2011 2012 Stuart – Sandra Mason 2012 2012 7 Sir Elliott Belgrave 2012 2017 Stuart – Former Deputy Prime Minister Sir Philip Greaves 2017 2018 8 Dame Sandra Mason 2018 2021 Stuart Mottley ==President (2021–present)== Under the Constitution of Barbados, as amended in 2021, the position of president of Barbados replaced the monarch as head of state. The position of president is elected by parliament for a four- year term. In the event of a vacancy, or for any reason the president is unable to perform the functions conferred upon them by the constitution, those functions are performed by an acting president appointed by the prime minister, after consultation with the leader of the opposition. However, while the president is suspended from office in case of ongoing impeachment proceedings, the president of the Senate of Barbados serves as acting president. The presidential line of succession is not defined beyond that. Portrait President Elected Term of office Term of office Term of office Prime Minister Portrait President Elected Took office Left office Time in office Prime Minister 1 Sandra Mason 2021 2021 Mottley ==Prime ministers of Barbados (1966-present)== # Incumbent Portrait Tenure Political Affiliation Took Office Left Office 1 Errol Barrow 18 November 1966 8 September 1976 Democratic Labour Party 2 John \"Tom\" Adams* 8 September 1976 11 March 1985 Barbados Labour Party 3 Bernard St. John 11 March 1985 29 May 1986 Barbados Labour Party (1) Errol Barrow* 29 May 1986 1 June 1987 Democratic Labour Party 4 Erskine Sandiford 1 June 1987 7 September 1994 Democratic Labour Party 5 Owen Arthur 7 September 1994 16 January 2008 Barbados Labour Party 6 David Thompson* 16 January 2008 23 October 2010 Democratic Labour Party 7 Freundel Stuart 23 October 2010 25 May 2018 Democratic Labour Party 8 Mia Mottley 25 May 2018 Incumbent Barbados Labour Party * * Note - Died in office == References == Barbados *",
 "title": "List of heads of state of Barbados"
}