{
 "id": "1126356",
 "text": "Imagine Dragons is an American pop rock band from Las Vegas, Nevada in 2008. The band was formed by lead singer Dan Reynolds and drummer Andrew Tolman. The current lineup for the band is Reynolds, guitarist Wayne Sermon, and bassist Ben McKee. The band is very successful, selling over 74 million albums worldwide. ==Career== The band was formed in 2008 under the name Imagine Dragons by Brigham Youth University students Dan Reynolds and Andrew Tolman. The band has said that the meaning of their name is an anagram. However, the meaning is unknown to anybody outside of members of the band. Andrew Beck, Dave Lemke, and Aurora Florence would later join the band shortly after it was formed. The band released their first studio album Night Visions on September 4, 2012. The album was successful and would debut at #2 on the Billboard 200, selling 83,000 album-equivalent units. It became the highest debut rock album to chart since 2006. The album featured the singles \"It's Time\", \"Radioactive\", \"Hear Me\", \"Demons\", and \"On Top of the World\" The band's single \"Radioactive\" would be nominated for Record of the Year and would win Best Rock Performance at the 56th Annual Grammy Awards on January 26, 2014. == Band members == ;Current *Dan Reynolds – lead vocals, guitars, piano, keyboards, percussion (2008–present), drums (studio; 2023–present) *Wayne Sermon – guitars, backing vocals, mandolin, synthesizers, violin (2009–present) *Ben McKee – bass, keyboards, backing vocals (2009–present) ;Former * Andrew Tolman – drums, percussion, backing vocals (2008–2011; touring 2023–present) * Andrew Beck – guitars, backing vocals (2008–2009) * Aurora Florence – keyboards, backing vocals (2008–2009) * Dave Lemke – bass, backing vocals (2008–2009) * Brittany Tolman – keyboards, backing vocals (2009–2011) * Theresa Flaminio – keyboards, backing vocals (2011) * Daniel Platzman – drums, percussion, backing vocals, viola (2011–2023) == Discography == ===Studio albums=== * Night Visions (2012) * Smoke + Mirrors (2015) * Evolve (2017) * Origins (2018) * Mercury – Acts 1 & 2 (2022) * Loom (2024) ==References== ==Other websites== * Category:2000s establishments in Nevada Category:2000s American music groups Category:2010s American music groups Category:American alternative rock bands Category:Musical groups established in 2008 Category:Musicians from Las Vegas Category:American pop rock bands",
 "title": "Imagine Dragons"
}