{
 "id": "1126904",
 "text": "Aditya Ranoliya is an Indian filmmaker, writer, producer, and director based in Mumbai, India. He is the founder of Admake India Media Pvt. Ltd. and AR Studios, known for his significant contributions to the Indian film industry.https://www.bhaskar.com/local/haryana/hisar/news/hisar-director- aditya-ranoliya-story-film-release-on-5th-april-132798566.html == Early Life and Education == Aditya Ranoliya was born in Hansi, Haryana. He completed his Bachelor of Science degree from Kurukshetra University and later pursued a Master in Journalism from Guru Jambheshwar University, Hisar. == Career == Aditya Ranoliya was born in Hansi, Haryana to Radhe Shyam Ranoliya and Chameli Devi. Aditya Ranoliya is the third among his four siblings. in 1997 He received his higher education from PCSD School in Hansi, his hometown. Aditya's childhood was full of hardships, His father had to work as a laborer to support the family. From a young age, he was interested in films and dreamed of coming to Mumbai. One day, his hard work brought him to the city of dreams, Mumbai.. He completed his Bachelor of Science degree in 2003 from Kurukshetra University and later pursued a Master in Journalism from Guru Jambheshwar University, Hisar. in 2005. == Filmography == === As a Producer, Writer, and Director === * 444 Days in the City (MX Player) * The Lost Girl (Hindi: Released nationwide in cinemas on April 5, 2024, by Panorama International Studios) == Admake India Media Pvt. Ltd. == Admake India Media Pvt. Ltd. is a renowned film production design and advertising agency based in Mumbai. The company has collaborated with some of the most prominent personalities and banners in the film industry, including Yash Raj Films, Dharma Productions, Fox Star Studios, UTV Motion Pictures, and more. Admake India is celebrated for its work on the Aiena Mahal set design in Sanjay Leela Bhansali's Bajirao Mastani.https://www.filmibeat.com/celebs/aditya- ranoliya.html == Awards == * Cannes Film Festival - Best Director Award 2022 * Venice Film Festival - Golden Lion 2018 * Berlin International Film Festival - Silver Bear for Best Director 2019 * Toronto International Film Festival - People's Choice Award 2022 * Sundance Film Festival - Grand Jury Prize 2018 * BAFTA Award for Best Film 2018 * Academy Award for Best Foreign Language Film 2019 * Golden Globe Award for Best Director 2020 == References == == Other websites == Category:Indian screenwriters Category:People from Haryana Category:Living people Category:Year of birth missing (living people)",
 "title": "Aditya Ranoliya"
}