{
 "id": "1127003",
 "text": "Christina Soontornvat (; born 1980) is an American author, educator, and mechanical engineer. She won two Newbery Honors in 2021 for the children's books A Wish in the Dark and All Thirteen: The Incredible Cave Rescue of the Thai Boys' Soccer Team (fiction and nonfiction, respectively). She won another Newbery Honor in 2023 for the middle grade novel \"The Last Mapmaker\". == Early life and school == Christina was born in 1980. She was the daughter of Amnaj Soontornvat, a business-owner from Thailand and granddaughter of Thai broadcasting executive Saengchai Sunthornwat. She went to Weatherford High School in Weatherford, Texas. She graduated in 1998. She earned a Bachelor of Science degree in mechanical engineering from Trinity University in 2002. She also has a Master of Science degree in science education from the University of Texas at Austin in 2007. == Career == Soontornvat worked at a science museum. In 2020, Soontornvat wrote the children's books A Wish in the Dark and All Thirteen: The Incredible Cave Rescue of the Thai Boys' Soccer Team. In an interview, she said that All Thirteen, which tells the story of the 2018 Tham Luang cave rescue, was told \"from the Thai perspective as much as possible, and to let people know about Thailand\". Both books were givrn a Newbery Honor in 2021. It made Christina the third author to get two Newbery awards in the same year (after Meindert DeJong in 1954 and E. L. Konigsburg in 1968). She is also the first author to win two Newbery awards in the same year for both fiction (A Wish in the Dark) and nonfiction (All Thirteen). Christina, with fellow writers Ellen Oh and Melanie Conklin, made the Everywhere Book Fest, which took place from May 1 to May 2, 2020. It was created because of book festival cancellations due to the COVID-19 pandemic. It included the Tucson Festival of Books, where Christina and Ellen had been told to speak on a panel. The event included live and pre-recorded parts featuring authors of children's and young adult books. 43,000 online viewers came on to see it. == Personal life == Christina lives in Austin, Texas with her husband. They have two children. == Book Creations == === Changelings books === # The Changelings (September 6, 2016) # In a Dark Land: A Changelings Story (October 1, 2017) === Diary of an Ice Princess books === # Snow Place Like Home (June 25, 2019) # Frost Friends Forever (June 25, 2019) # On Thin Ice (October 1, 2019) # The Big Freeze (March 3, 2020) # Slush Puppy Love (June 2, 2020) # Icing on the Snowflake (September 15, 2020) === Other books === * The Blunders: A Counting Catastrophe! (February 11, 2020) * A Wish in the Dark (March 24, 2020) * Simon at the Art Museum (June 9, 2020) * All Thirteen: The Incredible Cave Rescue of the Thai Boys' Soccer Team (October 13, 2020) * The Ramble Shamble Children (March 9, 2021) * The Last Mapmaker (April 12, 2022) * The Tryout == References == == Other websites == * Official website Category:Living people Category:Writers from Texas Category:American mechanical engineers Category:Educators from Texas Category:Newbery Medal winning authors Category:1980 births",
 "title": "Christina Soontornvat"
}