{
 "id": "1127015",
 "text": "The withdrawal of United States troops from Afghanistan happened between 2020 and 2021. This event marked the end of nearly 20 years of American military involvement in the country. The process started with an agreement between the United States and the Taliban, and ended with the complete withdrawal of U.S. forces in August 2021. This had a big impact on Afghanistan and drew many different reactions around the world. == Background == === U.S. involvement in Afghanistan === The United States entered Afghanistan in October 2001, after the 9/11 terrorist attacks. The goal was to remove the Taliban from power and stop al-Qaeda from using Afghanistan as a base. The mission quickly succeeded in removing the Taliban government, but the U.S. stayed to help rebuild the country and support a new government. Over the years, the number of U.S. troops in Afghanistan changed, with a peak of over 100,000 troops in 2011. === The Doha Agreement === On February 29, 2020, the U.S. and the Taliban signed the Doha Agreement. This agreement had several key points: * The U.S. would reduce its troop numbers from about 13,000 to 8,600 within 135 days. * All U.S. troops would leave within 14 months if the Taliban kept their promises. * The Taliban would stop al-Qaeda and other terrorist groups from operating in areas they control and start peace talks with the Afghan government. == The withdrawal process == === Initial phases === After the Doha Agreement, the U.S. began to reduce its troops in Afghanistan. By early 2021, there were about 2,500 U.S. troops left. However, the Taliban continued to fight and the peace talks were slow. === Withdrawal and Taliban offensive === In April 2021, President Joe Biden announced that all U.S. troops would leave Afghanistan by September 11, 2021. This decision received mixed reactions. Some people thought it was time to end the war, while others worried about what would happen next. In July 2021, the U.S. sped up its withdrawal. The Taliban quickly took control of many areas, and by mid-August, they entered Kabul, the capital city. This led to the collapse of the Afghan government. === Evacuation efforts === As Kabul fell, there was a chaotic effort to evacuate U.S. citizens, foreign nationals, and Afghan allies. Thousands of people tried to leave the country through Hamid Karzai International Airport. The evacuation faced many problems, including a suicide bombing on August 26, 2021 that killed 13 U.S. service members and over 170 Afghan civilians. == Aftermath == The Taliban takeover caused a humanitarian crisis. Many Afghans faced displacement, economic problems, and uncertainty about their future. The international community tried to provide help and support, especially for women and minorities. The U.S. withdrawal changed the balance of power in the region. Neighboring countries like Pakistan, China, and Russia reconsidered their roles. The withdrawal also sparked debates in the U.S. about foreign policy and military strategy. People had different views on the withdrawal. Some believed it was necessary to end a long and costly conflict. Others criticized how it was done and the resulting instability. The quick collapse of the Afghan government and security forces showed the difficulties of building a nation and the limits of military intervention. == Related pages == * War in Afghanistan (2001-2021) * Taliban insurgency == References == # U.S. Department of Defense. \"Operation Freedom's Sentinel: Lead Inspector General Report to the United States Congress.\" Defense Department Website. # Biden, Joe. \"Remarks by President Biden on the Way Forward in Afghanistan.\" White House Website. # \"The Doha Agreement: 29 February 2020.\" State Department Website. # United Nations Office for the Coordination of Humanitarian Affairs. \"Afghanistan Humanitarian Needs Overview 2021.\" UN OCHA Website. # \"Afghanistan: Background and U.S. Policy: In Brief.\" Congressional Research Service. Category:2020s events Category:2020s in Afghanistan Category:Military of the United States",
 "title": "Withdrawal of United States troops from Afghanistan (2020–2021)"
}