{
 "id": "112762",
 "text": "Kimi-Matias Räikkönen () (born October 17, 1979 in Espoo, Finland) is a race car driver, currently driving for Alfa Romeo Racing. He is the 2007 Formula One World Drivers' Champion. Räikkönen entered Formula One as a regular driver for Sauber-Petronas in 2001. Having previously only raced in very junior open- wheel categories, he was given his Super Licence from the Fédération Internationale de l'Automobile (FIA) after a performance delivery promise from his team boss, Peter Sauber. He joined McLaren Mercedes in 2002, and became a title contender by finishing runner-up in the 2003 and 2005 championships to Michael Schumacher and Fernando Alonso, respectively. Switching to Ferrari in 2007, Räikkönen became the highest paid driver in the sport,Forumula1.net - Räikkönen now highest paid driver in F1 and secured his first Formula One World Drivers' Championship, beating McLaren drivers Lewis Hamilton and Fernando Alonso by one point. Räikkönen is very calm, cool, and calculating in his race strategy—prompting the nickname \"Iceman\", which is subtly written on the side of his current helmet design. His other nicknames include Kimppa, Räikkä and Kimster (used by his mechanics). == NASCAR == Räikkönen joined the ranks of former F1 drivers who have moved to NASCAR in 2011. His first race was the Camping World Truck Series on May 20 at the Charlotte Motor Speedway in Charlotte, North Carolina. He finished in 15th place on the lead lap. He hopes to work his way up to the NASCAR Sprint Cup Series. Räikkönen's second NASCAR race was also at Charlotte. He raced in the Nationwide Series. He received a penalty for speeding on pit lane, and finished in 27th place. After the race, he returned to Europe to compete in some more rally races. Räikkönen said his plans are to \"see what happens.\" == Results and records == === Career summary === Season Series Team Name Races Poles Wins Points Final Placing 1999 European Formula Ford ? 2 ? ? ? 5th Formula Ford Festival Continental Racing Van Diemen 1 0 0 N/A NC Formula Renault 2000 UK Winter Championship Manor Motorsport 4 4 4 40 1st Formula Renault 2000 UK Haywood Racing 4 0 0 ? ? 2000 Formula Renault 2000 Eurocup ? 2 2 2 62 7th Formula Renault 2000 UK Manor Motorsport 10 6 7 316 1st 2001 Formula One Sauber 17 0 0 9 10th 2002 Formula One McLaren 17 0 0 24 6th 2003 Formula One McLaren 16 2 1 91 2nd 2004 Formula One McLaren 18 1 1 45 7th 2005 Formula One McLaren 19 5 7 112 2nd 2006 Formula One McLaren 18 3 0 65 5th 2007 Formula One Ferrari 17 3 6 110 1st 2008 Formula One Ferrari 18 2 2 75 3rd 2009 Formula One Ferrari 17 0 1 48 6th World Rally Championship Tommi Mäkinen Racing 1 0 0 0 - 2010 World Rally Championship Citroën Junior Team 13 0 0 15 10th 2011 World Rally Championship Ice 1 Racing 4 0 0 18* 8th* NASCAR Camping World Truck Series Kyle Busch Motorsports 1 0 0 0 NC NASCAR Nationwide Series Kyle Busch Motorsports 1 0 0 0 NC 2012 Formula One Lotus 20 0 1 207 3rd 2013 Formula One Lotus 17 0 1 183 5th 2014 Formula One Ferrari 19 0 1 55 12th Season in progress As a guest driver, Räikkönen was ineligible for points ===Complete Formula One results=== (key) (Races in bold indicate pole position; races in italics indicate fastest lap) Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 Points Red Bull Sauber Petronas Sauber C20 Petronas 01A 3.0 V10 AUS MAL BRA SMR ESP AUT MON CAN EUR FRA GBR GER HUN BEL ITA USA JPN 10th 9 West McLaren Mercedes McLaren MP4-17 Mercedes FO 110M 3.0 V10 AUS MAL BRA SMR ESP AUT MON CAN EUR GBR FRA GER HUN BEL ITA USA JPN 6th 24 West McLaren Mercedes McLaren MP4-17D Mercedes FO 110M/P 3.0 V10 AUS MAL BRA SMR ESP AUT MON CAN EUR FRA GBR GER HUN ITA USA JPN 2nd 91 West McLaren Mercedes McLaren MP4-19 Mercedes FO 110Q 3.0 V10 AUS MAL BHR SMR ESP MON EUR CAN USA 7th 45 McLaren MP4-19B FRA GBR GER HUN BEL ITA CHN JPN BRA West McLaren Mercedes McLaren MP4-20 Mercedes FO 110R 3.0 V10 AUS MAL BHR SMR ESP MON EUR CAN USA FRA GBR GER 2nd 112 Team McLaren Mercedes HUN TUR ITA BEL BRA JPN CHN Team McLaren Mercedes McLaren MP4-21 Mercedes FO 108S 2.4 V8 BHR MAL AUS SMR EUR ESP MON GBR CAN USA FRA GER HUN TUR ITA CHN JPN BRA 5th 65 Scuderia Ferrari Marlboro Ferrari F2007 Ferrari 056 2.4 V8 AUS MAL BHR ESP MON CAN USA FRA GBR EUR HUN TUR ITA BEL JPN CHN BRA 1st 110 Scuderia Ferrari Marlboro Ferrari F2008 Ferrari 056 2.4 V8 AUS MAL BHR ESP TUR MON CAN FRA GBR GER HUN EUR BEL ITA SIN JPN CHN BRA 3rd 75 Scuderia Ferrari Marlboro Ferrari F60 Ferrari 056 2.4 V8 AUS MAL CHN BHR ESP MON TUR GBR GER HUN EUR BEL ITA SIN JPN BRA ABU 6th 48 Lotus F1 Team Lotus E20 Renault RS27-2012 2.4 V8 AUS MAL CHN BHR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU USA BRA 3rd 207 Lotus F1 Team Lotus E21 Renault RS27-2013 2.4 V8 AUS MAL CHN BHR ESP MON CAN GBR GER HUN BEL ITA SIN KOR JPN IND ABU USA BRA 5th 183 Scuderia Ferrari Ferrari F14 T Ferrari 059/3 1.6 V6 t AUS MAL BHR CHN ESP MON CAN AUT GBR GER HUN BEL ITA SIN JPN RUS USA BRA ABU 12th 55 Scuderia Ferrari Ferrari SF15-T Ferrari 060 1.6 V6 t AUS MAL CHN BHR ESP MON CAN AUT GBR HUN BEL ITA SIN JPN RUS USA MEX BRA ABU 4th 150 Scuderia Ferrari Ferrari SF16-H Ferrari 061 1.6 V6 t AUS BHR CHN RUS ESP MON CAN EUR AUT GBR HUN GER BEL ITA SIN MAL JPN USA MEX BRA ABU 6th 186 Scuderia Ferrari Ferrari SF70H Ferrari 062 1.6 V6 t AUS CHN BHR RUS ESP MON CAN AZE AUT GBR HUN BEL ITA SIN MAL JPN USA MEX BRA ABU 4th 205 Scuderia Ferrari Ferrari SF71H Ferrari 062 EVO 1.6 V6 t AUS BHR CHN AZE ESP MON CAN FRA AUT GBR GER HUN BEL ITA SIN RUS JPN USA MEX BRA ABU 3rd 251 Alfa Romeo Racing Alfa Romeo Racing C38 Ferrari 064 1.6 V6 t AUS BHR CHN AZE ESP MON CAN FRA AUT GBR GER HUN BEL ITA SIN RUS JPN MEX USA BRA ABU 12th 43 Alfa Romeo Racing Orlen Alfa Romeo Racing C39 Ferrari 065 1.6 V6 t Alfa Romeo Racing Orlen Alfa Romeo Racing C41 Ferrari 065/6 1.6 V6 t * * † Did not finish, but was classified as he had completed more than 90% of the race distance. * Season still in progress. === Complete WRC results === Year Entrant Car 1 2 3 4 5 6 7 8 9 10 11 12 13 WDC Points 2009 Tommi Mäkinen Racing Fiat Grande Punto S2000 IRE NOR CYP POR ARG ITA GRC POL FIN Ret AUS ESP GBR NC 0 2010 Citroën Junior Team Citroën C4 WRC SWE 29 MEX Ret JOR 8 TUR 5 NZL POR 10 BUL 11 FIN 25 DEU 7 JPN Ret FRA Ret ESP DNS GBR 8 10th 25 2011 ICE 1 Racing Citroën DS3 WRC SWE 8 MEX POR 7 JOR 6 ITA ARG GRE FIN DEU AUS FRA ESP GBR 8th* 18* Season in progress == References == Category:1979 births Category:Living people Category:Finnish racecar drivers Category:Formula One drivers Category:NASCAR drivers Category:People from Espoo",
 "title": "Kimi Räikkönen"
}