{
 "id": "1127524",
 "text": "Yasuní National Park () is a place in Ecuador. It is a park, a place for plants and animals and some people to live. It is about in size. It is between the Napo and Curaray Rivers in Pastaza and Orellana Provinces. It is in the Amazon Basin. This national park has forests with lots of water and it is mostly rain forest. The park is about from the town of Quito. The United Nations named it a UNESCO Biosphere Reserve in 1989. This park is inside the place where the Huaorani people lived. The Huaorani are indigenous people who have lived in Ecuador since before Europeans knew about South America. Two groups of people who have not met many other humans before, the Tagaeri and the Taromenane, also live in Yasumi. Many indigenous people use the rivers in the park to travel. Many of the rivers go into the Amazon River. Some of these rivers have a lot of tannin chemicals in their water. This means that different plants live in them than live in water without tannins. The spine- covered palm, Bactris riparia, and water plant Montrichardia linifera grow on the sides of the rivers. The park has oil in it. Scientists say it could have 1.7 billion barrels of crude oil. This would be 40 percent of Ecuador's oil. Indigenous people and scientists say it would be bad to try to get the oil out of ht epark. In 2007, president Rafael Correa started the Yasuní-ITT Initiative to protect the park. This project promised to protect the park's living things if people in other countries would pay, but it did not raise enough money. People began taking oil out of the park in 2016. In August 2023, the people of Ecuador voted about the oil in the national parks, and people stopped taking oil out of the park. == Living things == Yasuní National Park (YNP) has many different kinds of living things, maybe more different living things than anywhere on Earth. This is because it is where the Equator, Andes Mountains, and the Amazon rainforest MEET. Amphibian, bird, mammal, and plant species can all be very different from each other. The park has some of the biggest numbers of plants and animals in the world: birds, trees, and bats (less than 100 km2). There are 121 reptile species in the park. More than 382 species of fish live in the park. That is one third of the fish species in all of the Amazon area. Yasuni has many bats in it. About 100,000 species of insect live in the park. It has many, many kinds of plants. It has more than 4000 species of plants with organs that move water for each . The park has many species of trees and shrubs. The park has some of the biggest differences between species in one place in the entire world. There is a research center in the northwest part of the park. This is the Forest Dynamics Plot. It is 50 hectares in size. Pontificia Universidad Católica de Ecuador (PUCE), the Aarhus University in Denmark, and ForestGEO-STRI made it in 1995. === Mammals === Many mammals live in national park. Pteronura brasiliensis, the giant otter, is an endangered species that lives in the rivers in and near the park.Utreras B, V, Suárez R, E, Zapata-Ríos, G, Lasso, G, Pinos, L (2005) Dry and rainy season estimations of Giant Otter, Pteronura brasiliensis, home range in the Yasuní National Park. LAJAM 4(2): 191–194. A species of bat, Lophostoma yasuní, lives in to the park. Many species of monkey lives high in the trees, for example the Eastern Ecuadorian squirrel monkey (Saimiri cassiquiarensis macrodon) and Humboldt's squirrel monkey (Saimiri cassiquiarensis), pygmy marmoset (Cebuella pygmaea), Ecuadorian white-fronted capuchin (Cebus aequatorialis), Red-crowned Titi (Plecturocebus discolor), Napo saki (Pithecia napensis), Colombian red howler (Alouatta seniculus), white-bellied spider monkey (Ateles belzebuth), and brown woolly monkey (Lagothrix lagothricha). These animals move plant seeds from place to place and remove insects from plants by eating them. === Herpetofauna === Yasuní has about one-third of the amphibian and reptile species in the Amazon Basin. The park has 150 amphibian species, more than other other place like it for places with comparable landscapes. Treefrog Osteocephalus Yasuní is named after the park. There are 121 species of reptile. === Fish === The park has about 500 species of fish.Escobar-Camancho, D., Barriga, R., Ron, S. R., (2015) \"Discovering Hidden Diversity of Characins (Teleostei: Characiformes) in Ecuador’s Yasuní National Park\" PLOS ONE: 10(8): e0135569.Galacatos K, Barriga-Salazar R, Stewart DJ (2004) \"Seasonal and habitat influences on fish communities within the lower Yasuni River basin of the Ecuadorian Amazon\" Environ Biol Fishes. 71: 33–51. === Birds === Yasuní also has at least 596 bird species, which is one-third of the total bird species for the Amazon. It has hunting birds like falcons, hawks, and eagles and other birds such as macaws, antwrens, manakins, and thrushes. Because the tree branches come together like a roof in many different ways, many different birds can live there: birds that help plants make seeds, and hummingbirds. === Insects === This national park has many different kinds of insects, and it has insects and plants that help each other in unusual ways. In each hectare, Yasuní has more than 100,000 different species of insects, the same as all of North America. === Plants === The park has many, many plants that move water inside their bodies (mostly, this means plants that are not moss). It is one of nine places in the world that has over 4,000 different species of vascular plant per 10,000 km2. There are many trees and smaller woody plant and lianas. In some ways, this park is has the most different kinds of plants in the world. == Danger == === Oil === Yasuní National Park has about 1.7 billion barrels of oil still in the ground 40 percent of Ecuador's oil. The oil is in the Ishpingo-Tiputini-Tambococha (ITT) oil fields. People began to look for oil in the park in 1995. In 2005, there was a plan to build more roads into the park so people could get the oil. Environmentalists and scientists, for example Jane Goodall, E.O. Wilson, and Stuart Pimm, asked the government of Ecuador to tell people not to get the oil. Indigenous people and environmentalists asked the government to let the people vote about whether to allow the roads and oil drills. President Rafael Correa started the Yasuní-ITT Initiative to protect the park and the valuable things in it in June 2007. The initiative promised to not dig for oil in the park if people in other countries would pay. The government hoped to raise half of what the oil was worth, US$3.6 billion over 12 years. By 2009 many people from many parts of the world promised to pay $1.7 billion. Not drilling in the park would prevent 400 million metric tons of carbon dioxide from going into the air, officials said. At the time, the environmentalists said the plan was good and would help other people do other plans like it: it would make it easier for countries with less money to keep places like Yasuni healthy. Actors Leonardo DiCaprio and Edward Norton, filmmaker Michael Charles Tobias, and former Vice President of the United States Al Gore promised to help the government of Ecuador. Turkey, Chile, Colombia, Georgia, Australia, Spain, and Belgium all sent money. But President Correa said that once Ecuador would decide how to spend the money. In July 2013, Correa started a group to look at whether the Yasuní-ITT initiative was working well. The commission said that it had made money but not enough money. On August 15, Correa ended the plan. He said this was because people in other countries had not done enough of their part. \"The world has failed us,\" he said. He also said that rich countries make more pollution and gases that make the world hotter and then tell poorer countries that they cannot build what they think is best. He ended the Yasuní-ITT trust fund. Correa said that people had only promised US$336 million, (in contrast to the $1.6 billion stated in the report cited above), and of that only US$13.3 million had actually been paid to Ecuador. Correa also said he had asked scholars to do economic, legal, and technical studies on what drilling would do so that the National Assembly could read them. He said Ecuador had to make more oil so that it could do economic programs, which poor people in Ecuador wanted. He said the drilling would affect only 1% of the Yasuní basin. A spokesperson said the drilling did not have to harm the environment. Environmentalists still said people should not drill for oil in the park. Hundreds of protesters went to the presidential palace. Oil production is one-third of Ecuador's national budget. People began to drill for oil in 2016, and, in 2019 President Lenín Moreno allowed more drilling, closer to where indigenous people lived. ==== 2023 Ecuadorian Yasuní National Park oil exploitation referendum ==== On August 20, 2023, the people of Ecuador all voted on whether people should did for oil in the park. This was the same day as the regular elections. The new law said that oil drillers that were already in the park could stop drilling slowly and that the government could not let new people drill for oil in the park. Indigenous people had asked for the law for more than ten years before the Constitutional Court said Ecuador had to let the people vote. The voters said Ecuador should stop drilling. Politicians said this was bad for President Guillermo Lasso, who had said more drilling would be good. The government's oil company, Petroecuador, must stop drilling in the park soon. === Other danger to the park === Colonization, cutting down too many trees, people who come into the park to take wood even when that it against the law, and too much hunting hurt the park. == Other pages == * 2023 Ecuadorian Yasuní National Park oil exploitation referendum * Finding Species * Tiputini Biodiversity Station * Yasuní-ITT Initiative == References == == Other things to read == * *Hennessy, L. A. (2000). Whither the Huaorani? competing interventions in indigenous Ecuador. Master's thesis, Berkeley, University of California, Berkeley. *Lu, F. E. (1999). Changes in subsistence patterns and resource use of the Huaorani Indians in the Ecuadorian Amazon. PhD dissertation. Chapel Hill, University of North Carolina at Chapel Hill. *Pitman, N. C. A. (2000). A large-scale inventory of two Amazonian tree communities. PhD dissertation. Durham, Duke University. *Vogel, J.H. (2009). The economics of the Yasuní Initiative: climate change as if thermodynamics mattered. London, Anthem Press . == Other websites == *\"Opinion: Yasuní and the New Economics of Climate Change\" CNN. Edition: International. August 23, 2010. *Yasuní Green Gold Campaign to save the park and its indigenous people *Yasuní Campaign by New Internationalist *Yasuní Campaign by Ecuadorian civil society organizations – Amazonia por la Vida *Background article at Deutsche Welle climate-project 'Global Ideas' on Ecuador's controversial plan to refrain from drilling for oil in its rainforests in return for money. *Deutsche Welle report on Yasuní National Park * *Where do we draw the line? Documentary directed by Joseph Wordsworth, and produced by Cora Fern and Mike Smith, vimeo.com/193289299 Category:National parks in Ecuador Category:Huaorani Category:Orellana Province Category:Pastaza Province",
 "title": "Yasuní National Park"
}