{
 "id": "1127899",
 "text": "The men's 100 metres sprint was an event in the 1936 Olympic Games in Berlin, Germany. They were in the Olympiastadion on 2 and 3 August. The final was won by 0.1 seconds by the American Jesse Owens. Ralph Metcalfe was also from America, and was in 2nd place. Tinus Osendarp of the Netherlands won 3rd place. This was their first medal in this event. ==Background== This was the 10th time this event was in the Olympics. This event has been in every Olympics. There were 2 finalists from 1932 in this event. Ralph Metcalfe was in 2nd place in 1932. Takayoshi Yoshioka was in 6th place in 1932. The favorite runner in this race was Jesse Owens. This was the first time that Afghanistan, Colombia, Liechtenstein, Malta, Peru, and Yugoslavia were in the Olympics. The United States was the only nation that had been in this event for every Olympic games. ==Competition== The event had the same format from 1920–1932. There were heats, quarterfinals, semifinals, and a final. There were 12 heats. Each heat had 4–6 athletes. The 2 fastest runners in each heat went to the quarterfinals. The 24 quarterfinalists were put into 4 heats. Each heat had 6 athletes. The 3 fastest runners in each quarterfinal went to the semifinals. There were 2 semifinals. Each semifinal had 6 racers. The 3 fastest racers in each semifinal went to the final. The final had 6 athletes. ==Records== These were the world records and Olympic records before the 1932 Olympics. The times are in seconds. World Record 10.2 Jesse Owens Chicago, USA June 20, 1936 Olympic Record 10.3 Eddie Tolan Los Angeles, USA August 1, 1932 Olympic Record 10.3 Ralph Metcalfe Los Angeles, USA August 1, 1932 Jesse Owens tied the Olympic record with 10.3 seconds in the last heat of the first round. In the quarterfinals, he tied his world record of 10.2 seconds. However, this time was not official because of the wind. In the finals, he ran 10.3 again. This would not count because of the wind. ==Results== ===Heats=== The 2 fastest runners in each heat went to the quarterfinals. ====Heat 1==== Rank Athlete Nation Time Notes 1 Lennart Strandberg 10.7 2 Takayoshi Yoshioka 10.8 3 Manfred Kersch 10.8 4 Maurice Carlton 5 Aristidis Sakellariou ====Heat 2==== Rank Athlete Nation Time Notes 1 Chris Berger 10.8 2 Pat Dannaher 11.0 3 Bernard Marchand 11.2 4 Antonio Sande 11.2 5 Julije Bauer 11.5 ====Heat 3==== Rank Athlete Nation Time Notes 1 Wil van Beveren 10.8 2 Eric Grimbeek 10.9 3 Ruudi Toomsalu 11.0 4 Antonio Salcedo 5 José Domingo Sánchez 6 Mohammad Khan ====Heat 4==== Rank Athlete Nation Time Notes 1 Gyula Gyenes 10.7 2 Monta Suzuki 10.7 3 Palle Virtanen 10.9 4 Paul Bronner 11.1 5 Antonio Cuba 6 Elias Gutiérrez ====Heat 5==== Rank Athlete Nation Time Notes 1 Howard McPhee 10.8 2 Lennart Lindgren 10.8 3 Robert Paul 11.0 4 George Fahoum 5 Poh Kimseng ====Heat 6==== Rank Athlete Nation Time Notes 1 Marthinus Theunissen 10.7 2 Gerd Hornberger 10.7 3 Tomás Beswick 10.9 4 Toivo Sariola 5 Sveinn Ingvarsson 6 Oskar Ospelt ====Heat 7==== Rank Athlete Nation Time Notes 1 Ralph Metcalfe 10.8 2 József Sir 10.8 3 Nemesio de Guzman 11.1 4 Fritz Seeger ====Heat 8==== Rank Athlete Nation Time Notes 1 Erich Borchmeyer 10.7 2 Bruce Humber 10.8 3 Gábor Gerő 11.3 4 Chen Kingkwan 5 Alfred Bencini ====Heat 9==== Rank Athlete Nation Time Notes 1 Frank Wykoff 10.6 2 Arthur Sweeney 10.7 3 Antonio Fondevilla 11.0 4 Toivo Ahjopalo 5 Oswaldo Domingues 6 Xaver Frick ====Heat 10==== Rank Athlete Nation Time Notes 1 Tinus Osendarp 10.5 2 Alan Pennington 10.6 3 Lee Orr 10.6 4 Robert Struckl 5 Eric Whiteside ====Heat 11==== Rank Athlete Nation Time Notes 1 Paul Hänni 10.7 2 Cyril Holmes 10.8 3 Renos Frangoudis 10.8 4 François Mersch 10.9 5 Liu Changchun ====Heat 12==== Rank Athlete Nation Time Notes 1 Jesse Owens 10.3 , 2 Kichizo Sasaki 11.0 3 José de Almeida 11.1 4 Dieudonné Devrindt 5 Austin Cassar-Torreggiani ===Quarterfinals=== The fastest 3 runners in each quarterfinal went to the semifinal round. ====Quarterfinal 1==== Rank Athlete Nation Time Notes 1 Lennart Strandberg 10.5 2 Tinus Osendarp 10.6 3 Frank Wykoff 10.6 4 Gerd Hornberger 10.7 5 Gyula Gyenes 6 Cyril Holmes ====Quarterfinal 2==== Jesse Owens tied the world record for this event. However, there was too much wind. Therefore, this time did not count. Rank Athlete Nation Time Notes 1 Jesse Owens 10.2 2 Paul Hänni 10.6 3 József Sir 10.7 4 Takayoshi Yoshioka 10.8 5 Eric Grimbeek 10.9 6 Lennart Lindgren 11.0 ====Quarterfinal 3==== Rank Athlete Nation Time Notes 1 Ralph Metcalfe 10.5 2 Alan Pennington 10.6 3 Wil van Beveren 10.7 4 Marthinus Theunissen 5 Bruce Humber 6 Kichizo Sasaki ====Quarterfinal 4==== Rank Athlete Nation Time Notes 1 Erich Borchmeyer 10.5 2 Arthur Sweeney 10.6 3 Howard McPhee 10.6 4 Monta Suzuki 10.8 5 Chris Berger 11.0 6 Pat Dannaher ===Semifinals=== The fastest 3 runners in each semifinal went to the final round. ====Semifinal 1==== Rank Athlete Nation Time Notes 1 Jesse Owens 10.4 2 Frank Wykoff 10.5 3 Lennart Strandberg 10.5 4 Paul Hänni 10.7 5 Wil van Beveren 10.8 6 Alan Pennington ====Semifinal 2==== Rank Athlete Nation Time Notes 1 Ralph Metcalfe 10.5 2 Tinus Osendarp 10.6 3 Erich Borchmeyer 10.7 4 Howard McPhee 10.7 5 Arthur Sweeney 10.7 6 József Sir 10.9 ===Final=== Wind: +2.7 m/s Owens was in front of the race by the first 30 metres. At 70 metres, Metcalfe ran ahead of everyone else. At 50 metres, Strandberg got an injury in his ligament.Official Report, vol. 1, p. 604. Rank Athlete Nation Time Jesse Owens 10.3 Ralph Metcalfe 10.4 Tinus Osendarp 10.5 4 Frank Wykoff 10.6 5 Erich Borchmeyer 10.7 6 Lennart Strandberg 10.9 ==References== Category:Athletics at the 1936 Summer Olympics Category:Men's events at the 1936 Summer Olympics",
 "title": "Athletics at the 1936 Summer Olympics – Men's 100 metres"
}