{
 "id": "1127264",
 "text": "For All the Dogs is the eighth studio album by Canadian rapper Drake. For All the Dogs was released on October 6, 2023. During a concert at the Apollo Theater on January 21, 2023, Drake would tease a new album to the crowd. On June 23, Drake released a poetry book titled Titles Ruin Everything. For promotion, he would take out a full-page advertisement in The New York Times along with a QR code. When scanned, the message \"I made an album to go with the book... They say they miss the old Drake, girl don't tempt me. For all the dogs\" was shown and the album would be confirmed by both OVO Sound and Republic Records. On August 21, Drake revealed the album's cover art. The artwork being a picture of a white goat with evil red eyes. The picture was drawn by Drake's son Adonis. Amazon's Music would reveal the release date in a tweet \"drizzy’s son has a future as a cover artist. new @drake august 25th!!\" but would later delete it. Drake would then reveal the release date as September 22. Drake would later pushback the release date to October 6 because of the ongoing tour's schedule. The album debuted at #1 on the Billboard 200, selling 402,000 album-equivalent units. The album would chart as 2023's largest streaming week of any album, the fourth-largest ever for an album, and was Drake's thirteenth number-one album in the United States. All of the songs for the album appeared on the Billboard Hot 100, seven of them in the top ten. The album features the singles \"Slime You Out\" which was released on September 15, \"8AM in Charlotte\" on October 5, \"Rich Baby Daddy\" on October 13, \"First Person Shooter\" on October 31, and \"You Broke My Heart\" on November 28. On November 17, 2023, Drake would release a bonus disc titled For All the Dogs: Scary Hours Edition. The bonus disc contained an extra 6 songs. ==Songs== ==References== Category:2023 albums Category:Drake (musician) albums Category:OVO Sound albums",
 "title": "For All the Dogs"
}