{
 "id": "1127641",
 "text": "Nakba denial is a form of historical denialism (saying that things that did happen didn't happen) about the 1948 Palestinian expulsion and flight and the things it caused, which Palestinians refer to collectively as the \"Nakba\" (). Underlying assumptions of Nakba denial mentioned by people who read and write a lot can include the denial of historically documented violence against Palestinians, the denial of a distinct Palestinian identity, the idea that Palestine was barren land, and the idea that Palestinians leaving their land was part of mutual transfers between Arabs and Jews justified by war. == Laws == === In Israel === In 2009 the Israeli government banned uses of the term \"Nakba\" in school textbooks and required the removal of existing textbooks that mentioned it. In 2011, Israel passed a law known colloquially as the \"Nakba Law\" that allowed the government to refuse to pay the bills for to people and organisations that commemorated \"Israel's Independence Day or the day on which the state was established as a day of mourning\", or that denied the existence of Israel as a \"Jewish and democratic state\". While the original bill proposed to make this a crime for individuals, the proposed legislation was amended to refuse to give government money to organizations instead. Yehouda Shenhav wrote in 2019 that the Nakba Law had the opposite of its intended effect, because it made more people talk about the Nakba. === In Palestine === In May 2023, Palestinian Authority President Mahmoud Abbas issued a decree defining the Nakba as a \"crime against humanity\", and making its denial a criminal offense punishable by up to two years in jail. The legislation echoed developments in Israel, where lawmakers in the hardline 37th government had proposed outlawing the waving of Palestinian flags. === In Germany === In March 2024, amid the Israel–Gaza war, Germany's Social Democratic Party and Christian Democratic Union Party issued a directive for the distribution of leaflets in high schools in Neukölln that dismissed the historical realities of the Nakba as \"myth\". By contrast, denial of the Holocaust in Germany is a very serious criminal offence. == Notes == === References === == Other websites == * Denying the Nakba, 75 Years Later: A Democracy in Exile Roundtable. DAWN. * Nakba Denial. Arab-American Institute. * Israel denies the Nakba while perpetuating it. Al Jazeera. * Five things the United States knew about the Nakba as it unfolded. Middle East Institute. * Erasing the Nakba, Upholding Apartheid: Atrocity Denial in the U.S. Media. Institute of Palestine Studies. Category:Zionism Category:Nakba Category:Propaganda Category:Genocide Category:Conspiracy theories Category:Islamophobia Category:Anti-Palestinian sentiment",
 "title": "Nakba denial"
}