{
 "id": "1127154",
 "text": "Dictatus papae is a list of 27 rules written by Pope Gregory VII in 1075. These rules describe the powers of the Pope and show his authority over both the Church and the kings. The Dictatus papae is important in history because it played a big part in a conflict between the Pope and European rulers called the Investiture Controversy. == Historical background == === The Church and the Pope's power === In medieval times, the Church was very powerful and influenced many aspects of life, including politics. The Pope was the leader of the Church, but his authority was often challenged by kings who wanted to control the Church in their countries. === Pope Gregory VII === Pope Gregory VII, born Hildebrand of Sovana, became Pope in 1073. He wanted to make the Church stronger and more independent from kings. Gregory VII worked to end corruption in the Church, enforce rules for priests to be celibate (not marry), and stop the buying and selling of Church positions. == Contents of the Dictatus papae == The Dictatus papae includes 27 statements about the Pope's powers. Some key points are: # The Roman Church was founded by God alone. # Only the Pope can use the symbols of the emperor. # All princes must kiss the Pope's feet. # The Pope has the power to remove emperors. # Only the Pope can call general church meetings. # The Pope can release people from their loyalty to bad rulers. These rules show that the Pope claimed to have supreme authority over both the Church and the rulers of countries. == Impact and importance == === Investiture Controversy === The Dictatus papae was important in the Investiture Controversy, a conflict about who had the right to appoint church leaders like bishops. Pope Gregory VII said only the Pope could do this, not kings. This led to a fight with Emperor Henry IV of the Holy Roman Empire. Gregory VII excommunicated (excluded) Henry IV from the Church, and Henry IV had to ask for forgiveness. === Church reforms === The Dictatus papae was part of a larger effort to reform the Church and make it more independent from kings. These reforms, led by Gregory VII, changed how the Church was run and made the Pope more powerful. === Lasting effects === The ideas in the Dictatus papae influenced the relationship between the Church and European rulers for many years. The document helped develop the idea that the Pope had ultimate authority over both religious and political matters. This set the stage for future conflicts and negotiations between the Church and kings. == References == # \"The Papacy and the Papal State.\" Catholic Encyclopedia. # \"Investiture Controversy.\" Encyclopedia Britannica. # \"Pope Gregory VII and the Dictatus Papae.\" Medieval History. # \"The Gregorian Reform Movement.\" The Oxford Handbook of Medieval Christianity. # \"The Role of the Pope in Medieval Europe.\" The Metropolitan Museum of Art. Category:1075 Category:Documents Category:Roman Catholicism",
 "title": "Dictatus Papae"
}