{
 "id": "1127595",
 "text": "Pop metal (often confused with glam metal) is an umbrella term for commercial heavy metal. It's a fusion genre of heavy metal and pop music. It often has catchy hooks and anthemic choruses. It became popular in the 1980s among acts such as Bon Jovi, Europe, Def Leppard, Poison, Mötley Crüe, and Ratt. The term is also applied to some bands and artists that have formed since the 1990s that mix aspects of pop and heavy metal into their sound. ==Characteristics== Pop metal is a variation of heavy metal. Its's characterized by catchy pop- influenced hooks and guitar riffs. It was influenced by the anthemic choruses of arena rock. Pop metal recordings are often loud, but usually have \"slick,\" radio-friendly production. Starting in the late 1970s, pop metal was combined with glam rock, resulting in the genre of glam metal. The alternate term \"metal pop\" was coined by Philip Bashe in 1983. He described Van Halen and Def Leppard as such.D. Weinstein, Heavy Metal: The Music and Its Culture (Cambridge, MA: Da Capo Press, 2000), , pp. 45–47. Sam Dunn, in his documentary, Metal: A Headbanger's Journey, tries to differentiate pop and glam metal. He labeled the bands Def Leppard, Europe, and Whitesnake as pop metal, but Mötley Crüe and Poison as glam metal.Metal – A Headbanger's Journey, DVD, ASIN B000FS9OZY (2005). ==History== The catchy hard rock of Kiss, Van Halen, Thin Lizzy and AC/DC in the 1970s helped spawn the genre. Van Halen's 1978 debut album marked a turning point in the style, making the sound \"flashier, more creative, and more energetic than before.\" The first wave of pop metal, which isn't as pop-oriented as later acts, includes bands such as Mötley Crüe, Quiet Riot, Dokken, Ratt, and Twisted Sister. More melodic acts such as Def Leppard and Bon Jovi saw further success in the 1980s with albums like Pyromania (1983) and Slippery When Wet (1986). The genre's popularity was at its peak between 1982 and 1991. The arrival of grunge in 1991 turned audiences away from pop metal. Despite the decline in popularity, the term \"pop metal\" is also applied to a number of rock and metal acts not associated with glam metal. This includes bands and artists such as Amaranthe, Andrew W.K., Architects, Bring Me the Horizon, Coheed and Cambria, Dead by April, Evanescence, Halestorm, Ghost, In Flames, In This Moment, Issues, Lacuna Coil, Poppy, Shinedown, the Pretty Reckless, We Are the Fallen, and Weezer. ==References== Category:1980s in music Category:Fusion music genres",
 "title": "Pop metal"
}