{
 "id": "1127529",
 "text": "Illit (; ; ; stylized in all caps) is a South Korean girl group formed by Belift Lab, a sub-label of Hybe, through the JTBC 2023 survival competition show R U Next?. The group has five members. They are Yunah, Minju, Moka, Wonhee, and Iroha. The group let out a song on March 25, 2024, with the extended play (EP) Super Real Me. == Name == The name I'll-It (before) was chosen during the live broadcast of the final vidoe of R U Next?. In the video, it was said that the name \"shows choosing your own verb to put between I'll and It\", showing the ability of the members to act and make decisions by themselves. == Career == === 2023–2024: Pre-debut activities and making through R U Next? === The JTBC show R U Next? aired for ten episodes from June 30, through September 1, 2023. 22 people competed to debut in a six-member girl group under Belift Lab, their first girl group. It was the third girl group to debut under Hybe, after Le Sserafim and NewJeans. The final video saw the making of the group's six-member group. Two members would be selected by the public. Four members would be selected by the company's producers. The final group of Wonhee, Youngseo, Minju, Iroha, Moka, and Yunah, was shown at the end of the episode. On January 5, 2024, Belift Lab said Youngseo was leaving the group. Before, Youngseo and Belift Lab had talked about the future activities of her and her group and had decided with agreement to end her contract. === 2024–present: Debut with Super Real Me === On February 13, 2024, Belift Lab said that Illit will be debuting in March. On February 21, it was said again that Illit will debut on March 25 with their first extended play. Hybe's chairman, Bang Si-hyuk, would be participating as producer of their album. On February 26, the agency said the name of Illit's first extended play, Super Real Me, with pre-orders opening on the same day as the report. On February 28, Illit made their first public appearance as a group at the Acne Studios show during Paris Fashion Week. It made Illit the first K-pop artist to appear at the event before their official debut. The list of songs of Super Real Me was shown a week later on March 9, with \"Magnetic\" serving as the lead single. A total of four tracks, including \"Magnetic\", would be let out. The three other tracks on the album are \"My World\", \"Midnight Fiction\", and \"Lucky Girl Syndrome\". The teaser for the music video of their next debut single \"Magnetic\", was officially let out on March 22. Eight days after the debut of Illit, \"Magnetic\" entered four U.S. Billboard charts. Illit became the first K-pop group to enter the UK Official Singles with their debut single, which was at number 80. On April 16, 2024, Illit became the fastest K-pop act to go on the Billboard Hot 100, when \"Magnetic\" was at number 91. \"Magnetic\" also became the first debut song by a K-pop act to come on the Hot 100. The music video for the track \"Lucky Girl Syndrome\" was let out on April 17. In May 2024, Super Real Me went on the Billboard 200 chart at number 93. Also, Illit also went at number 41 on the Billboard Artist 100 chart, and went at number two on the Emerging Artist chart. On June 28, Billboard named Illit as their first ever \"K-Pop Rookie of the Month\". On July 10, the music-themed Grammy Museum in Los Angeles, California said that a special K-pop exhibit will be there in August 2024, showing off the accessories and gear worn by artists under Hybe, including Illit, Le Sserafim, BTS, Tomorrow X Together, and Enhypen. == Public approval and support == On March 2024, Illit was chosen as the new face of Acne Studios' latest SS24 global campaign. Three weeks after Illit's debut, Wonhee was chosen as a new model for Japanese sports drink Pocari Sweat in May 2024. On March 28, 2024, Illit was chosen as the new Y brand model of KT Y. On May 1, 2024, Illit became the new model for the French cosmetics brand Bioderma. On May 28, 2024, Illit became the new model for the American footwear company Crocs. == Members == * Yunah () * Minju () * Moka () * Wonhee () * Iroha () == Discography == === Extended plays === List of extended plays, showing selected details, selected chart positions, sales figures, and certifications Title Details Peak chart positions Sales Certifications KOR JPN JPN Hot US US World Super Real Me * Released: March 25, 2024 * Label: Belift Lab, YG Plus * Formats: CD, digital download, streaming 3 3 3 93 2 * KOR: 672,566Total album sales for Super Real Me (South Korea): * * * * JPN: 31,980Total album sales for Super Real Me (Japan): * * * * US: 4,000 * KMCA: Platinum === Singles === List of singles, showing year released, selected chart positions, and name of the album Title Year Peak chart positions Sales Certification Album KOR Peak chart positions on the Circle Digital Chart: * \"Magnetic\": * \"My World\": * \"Lucky Girl Syndrome\": KOR Songs AUS CAN JPN Hot Peak chart positions on the Billboard Japan Hot 100: * \"Magnetic\": * \"Lucky Girl Syndrome\": NZ Peaks chart positions on the New Zealand Singles Chart: * \"Magnetic\": SGP Peaks chart positions on the RIAS Top Charts: * \"Magnetic\": UK US WW Peaks chart positions on the Billboard Global 200 Chart: * \"Magnetic\": \"Magnetic\" 2024 1 1 29 37 3 30 1 80 91 6 * JPN: 27,935 Cumulative sales for \"Magnetic\": * * * * * * * * * * * * * * RIAJ: Platinum Super Real Me === Other charted songs === List of other charted songs, showing year released, selected chart positions, and name of the album Title Year Peak chart positions Album KOR JPN Hot \"My World\" 2024 153 — Super Real Me \"Lucky Girl Syndrome\" 28 95 \"Midnight Fiction\" 173 — \"—\" denotes releases that did not chart or were not released in that region. == Videography == === Music videos === List of music videos, showing year released, and name of the director(s) Title Year Director(s) \"Magnetic\" 2024 DQM \"Lucky Girl Syndrome\" Kim In Tae (AFF) == Filmography == === Television shows === Year Title Notes 2023 R U Next? Reality competition show that determined the members of Illit === Web shows === Year Title Notes 2023 I'll Like It! Pre-debut reality show; 6 episodes 2024 Illit Ready Pre-debut reality show; 4 episodes Super Real Illit Documentary of the group's debut preparations; 3 episodes 2024–present Super Illit Weekly variety shows; premiered on July 1, 2024 The Night of Illit Weekly variety shows; premiered on July 5, 2024 == Live performances == Date Event Venue City Country Performed song(s) May 3, 2024 Rakuten GirlsAward 2024 Yoyogi National Gymnasium Shibuya Japan \"My World\", \"Magnetic\", and \"Lucky Girl Syndrome\" May 12, 2024 KCON Japan 2024 Zozo Marine Stadium Makuhari Messe Chiba \"Magnetic\", \"Lucky Girl Syndrome\", and \"What Is Love?\" (orig. Twice) June 2, 2024 K-Wave Concert Inkigayo Inspire Arena Incheon South Korea \"Magnetic\", and \"Lucky Girl Syndrome\" June 15, 2024 Weverse Con Festival 2024 Inspire Entertainment Resort \"Magnetic\", \"Midnight Fiction\", \"Lucky Girl Syndrome\", and \"When We Disco\" with J. Y. Park (orig. J. Y. Park and Sunmi) June 29–30, 2024 Show! Music Core In Japan 2024 Belluna Dome Tokorozawa, Saitama Japan \"Magnetic\", and \"Lucky Girl Syndrome\" July 6, 2024 Makuhari Messe Chiba \"Magnetic\" July 19, 2024 2024 TMEA 5th Tencent Music Entertainment Awards Macau Galaxy Arena Cotai, Macau China \"My World\", \"Lucky Girl Syndrome\", \"Midnight Fiction\", and \"Magnetic\" July 21, 2024 2024 SBS Gayo Daejeon Summer Inspire Arena Incheon South Korea \"Lucky Girl Syndrome\", \"Magnetic\" (festival version), and \"Plot Twist\" (orig. TWS) August 12, 2024 2024 Ulsan Summer Festival X MBC Show! Ulsan Sports Complex Auxiliary Stadium Ulsan \"Magnetic\", and \"Lucky Girl Syndrome\" August 22, 2024 2024 K World Dream Awards Jamsil Arena rowspan=\"6\" August 22, 2024 NHK Music Expo 2024 NHK Hall Shibuya Japan September 22, 2024 Korea-Japan Festival 2024 COEX Convention & Exhibition Center Seoul South Korea September 28, 2024 KCON Germany 2024 Messe Frankfurt Frankfurt Germany October 12, 2024 SBS Inkigayo Live in Tokyo 2024 Saitama Super Arena Chūō-ku, Saitama Japan December 14-15, 2024 Music Bank Global Festival in Japan 2024 Mizuho PayPay Dome Fukuoka Fukuoka == Awards == === Listicles === Name of publisher, year listed, name of listicle, and placement Publisher Year Listicle Placement Teen Vogue 2024 12 Girl Groups to Watch in 2024 Placed == Related pages == * Girl group * K-pop == References == == Other websites == * Category:2020s South Korean music groups Category:2020s establishments in South Korea Category:2024 establishments in Asia Category:Hybe Corporation artists Category:K-pop music groups Category:Musical groups established in the 2020s Category:Musical quintets Category:South Korean girl groups",
 "title": "Illit"
}