{
 "id": "1127730",
 "text": "Bajirao's march to Delhi also known as Bajirao's dash upon Delhi was an invasion led by the Maratha Peshwa Bajirao I on the Mughal Capital Delhi, Bajirao started from Pune on November 12, 1736 and divided his army into two units as per his war strategy. One led by his General, Malhar rao Holkar who started looting the lower Ganges-Yamuna Doab and attacking few places. Holkar entered Jalesar and faced the Mughal army, where he was defeated. The fearful Maratha army suffered heavy loses but was successful in withdraw. Bajirao then planned to skip the direct Delhi-Agra route and moved towards Delhi from the Jat country. There, he defeated the Mughal army at the borders of Delhi and started to withdraw back as he got the news of a Mughal army heading towards him. The campaign though resulted Indecisive, forced the Mughal Emperor to pay money to the Marathas. == Prelude == === Campaigns in Malwa and Bundelkhand === Bajirao gathered a big army of 50,000 horsemen and started his journey from Pune on November 12, 1736. In December, he arrived in Bhopal, which was ruled by a chief named Yar Muhammad. Bajirao made him pay 500,000 rupees before moving on to Bhilsa on January 5, 1737, where he met two other leaders, Malharji Holkar and Ranoji Scindia. After a short fight, they took control of the Bhilsa fort on January 13. Next, they entered Bundelkhand and reached Orchha in February 1737. Pilaji Jadhav Rao reported that they collected taxes from Orchha, Narwar, and Datia. Hence, Malwa and Bundelkhand were conquered. === Attack on Bhadawar and Ater === Ater and Bhadawar were protected by Sadat Khan, and Gopal Singh decided to fight against the Marathas. He gathered an army of 7,000 men, many horses, and 45 elephants to fight against them. Meanwhile, Aniruddha Singh's brother joined the Marathas and told them a secret to win the battle. The Marathas divided their army into two groups: one group fought against Aniruddha, and the other group attacked Ater. The king had to run away to the safety of Ater fort. From there, he sent messages to Sadat Khan asking for help. Baji Bhivrao was given the task of crossing the Yamuna River, and he got help from Chhatrasal's son, Hirde Sa. They took control of the river crossings and boats, which stopped Sadat Khan from crossing the river. Raja Gopal Singh, who was in a difficult situation, came out of the fort and met Bajirao. Bajrao asked for a lot of money, 20 lakh rupees, as a penalty. 15 lakh rupees were paid in cash, and the rest was promised to be paid later. The capture of Ater on February 18, 1737, finally woke up the Mughal court, and they started making big preparations to fight against the Marathas. == The Expedition == At Ater, Bajirao was only about 30 miles south of Agra. Two big Mughal armies, led by Khan Durran and Qamruddin Khan, were moving towards Agra and seemed to be blocking the direct road to Delhi. Sadat Khan's army from the doab region was trying to cross the Yamuna River to join them. So, the Peshwa came up with a plan to create a distraction by launching a surprise attack into the doab region. === Battle of Jalesar === On March 1, 1737, Malharji Holkar, Satvaji Jadhav, and Baji Bhivrao led a fast-moving army of 10,000 Horse men, who were lightly equipped and movable. They crossed the Yamuna River at Rapri, which is about 30 miles northwest of Etawah. Then, they started raiding and looting cities in the doab region. First, Holkar went to Etawah, and then moved on to Shukohabad, Firozabad, and Itimadpur, looting the area. The chief of Shukohabad, Lalji Khatri, paid Holkar 1.5 lakh rupees and gave him an elephant to spare his city. At Itimadpur, Holkar came very close to Agra, just a dozen miles away across the Yamuna River. After that, Holkar turned east and went deeper into the doab region, attacking Jalesar. At that time, Sadat Khan was in Etawah. He quickly marched his army east to find Holkar's army. On March 12, 1737, at sunrise, Holkar's army encountered Sadat Khan's vanguard, led by Abul Mansur Khan (later known as Safdar Jung), which had 12,000 horse men. Holkar started to surround this army, but Mansur Khan withdraw, with the Marathas chasing him. This led Holkar to face the main army of 50,000 men led by Sadat Khan himself. Realizing his army was too small to fight an army six times larger, Holkar decided to withdraw. The Mughal army chased after them, killing around 1,500 Marathas, including some of their leaders. During the chase, the Marathas got lost and entered the Yamuna River at the wrong place, causing many to drown. The remaining army finally reached Baji Rao's camp at Kotila, near Gwalior. The Siyar-ul-Mutaqherin states the event as: Sadat Khan crossed the Yamuna River and arrived in Agra. According to the Siyar-ul-Mutaqherin, before giving up the chase, Sadat Khan reached the north bank of the Chambal River, intending to drive away Bajirao's main army. However, he couldn't find a single Maratha soldier. Sadat Khan then returned to Agra. He wrote a letter to the Nizam, claiming that he had defeated the Marathas and punished them. He also sent similar letters to the Emperor, stating that he had defeated the Marathas and chased them south of the Chambal River. The Emperor was joyfull with Sadat Khan's news and rewarded him with expensive gifts. Just as Sadat Khan was about to take action, he received a letter from Khan Dauran saying that he was on his way to join him and suggested that Sadat Khan wait a little until they could proceed together to defeat the Marathas. Sadat Khan was already mounted on his horse, unsure of what to do. However, he eventually decided to stop his march and instead moved west to meet Khan Dauran near Mathura three days later. Meanwhile, Qamruddin Khan and Bangash were still about 30 kilometers from Delhi, on their way to Ajmer, waiting for the Marathas to arrive in that area. When Khan Dauran arrived in Agra, they spent six or seven days socializing and enjoying each other's company. Khan Dauran brought with him 25,000 horsemen, many cannons, and elephants. Soon, Muhammad Khan Bangash joined them with an additional 12,000 men. As a result, there were nearly 90,000 men gathered around Agra, while Wazir Qamruddin Khan, who was closer to Delhi, was only a day's march to the west of them. === Bajirao's reaction === At Kotila, near Gwalior, Bajirao judged the situation. He had three options to consider. The safest choice was to withdraw back to the Deccan, as three massive Mughal armies were blocking his path to Delhi. The second option was to stay in the gap of the Chambal River, near Ater or Gwalior, for an extended period. However, this option was not safe either. The third and most daring option was to press on and launch an attack on Delhi itself. In his letter to Chimaji Appa, he wrote : === The Dash to Delhi === Bajirao traveled nearly 200 kilometers in just four days and nights, passing through the camps of Wazir and Sadat Khan, and avoiding multiple Mughal armies to the south of the capital. He reached the gates of Delhi, achieving this journey in a short time. Meanwhile, Sadat Khan, Khan Dauran, and Bangash were still 140 kilometers away, at Radha Kund near Mathura, on Tuesday, March 23rd. In Delhi, Bajirao made a bold statement by appearing at the Ram Navami festival being held at the Kalika temple, near the Khizrabad grove. The festival was busy with people, and Bajirao's men took advantage of the situation by looting some goods, elephants, and camels. The Siyar-ul- Mutaqherin, a historical text, describes the shock and distrubance caused by Bajirao's arrival at the many fairs and markets that surrounded Tughlaqabad, a region located to the south of the walled city of Delhi. Before Bajirao's arrival, afraid citizens had already ran to the city, sharing stories of their scary encounters. The first to bring the news to the city were pilgrims who had been robbed and mistreated by Bajirao's men. Filled with fear, they created a huge disturbance at the city gates, shouting that Bajirao had arrived in Delhi. When asked what was wrong, they reported that Bajirao was in the city. The news was then brought to the Emperor and his advisors, who first laughed at the idea, thinking it was impossible. Ashob, a historian who lived at the time, describes the scene in detail: The city and the Emperor's court were in a state of disturbance throughout the night. It was unbelievable that the Marathas had reached Delhi, considering that two large armies were placed to the south of the capital. People wondered if these armies had been defeated, which would leave the Emperor with no choice but to surrender. Sad- ud-din Khan, an experienced soldier who had fought under the Nizam, felt that it was beneath the Emperor's dignity to personally lead the army against the Marathas, whom he considered to be \"lowly\" and \"mere ploughmen\". He also thought it would be even more shameful to hide behind the fort walls. Instead, he suggested that the remaining 10,000 to 12,000 horsemen and 20,000 foot soldiers in the city should be sent to fight the Marathas. Amir Khan, the Emperor's current favorite, was chosen to lead the troops. Leaving a small force to guard the Emperor and securing the boats on the Yamuna River behind the fort in case they needed to escape to protect the women, the army gathered under Amir Khan's command near the Misri Khan gate in the Paharganj area at night. Some more Mughal officers joined him, and they set up a defensive position with guns and intervals from the city to Tal Katora. As sunrise broke, the Marathas still hadn't attacked. Then, a young and energetic officer named Mir Hasan Koka Khan saw an opportunity to gain fame and interfered in the situation. He called the Emperor for hiding and marched out to join Amir Khan's forces. However, Amir Khan cautioned against acting foolishly and didn't encourage a hurried attack on the Marathas. But the young officers ignored his advice, gathered around 7,000 to 8,000 men, and insulted Amir Khan. They then set out towards Rakabganj, where they were spotted by the alert Bajirao. === Battle with Mir Hasan Koka === Sarvaji Jadhav tricked Mir Hasan Koka and his inexperienced soldiers into moving forward, moving them about two miles away from Amir Khan's main force. At that moment, Bajirao received a message from Sarvaji Jadhav and launched a full-scale attack on the Mughal army with his entire force, defeating and destroying most of it. Bajirao's own letter describes the situation : === Sudden Retreat === At the lake (jheel), Bajirao received news that Qamruddin Khan's army was getting close. Qamruddin was the nearest to Delhi, only about 100 kilometers away at Kaman Pahari. After a short stop at Malcha, he moved to Mehramnagar, which is west of Delhi and near the current airport. From there, he went to the rest stop of Alla Vardi in Gurgaon. The Emperor stayed up late in his court, waiting for messengers to confirm that the enemy had left. The messengers also brought news that the Wazir, accompanied by his cousin Azimullah at the front and the Nizam's eldest son Ghaziuddin at the back, were approaching the capital city. === Battle with the Wazir, Badshahpur === At Badshahpur, the Wazir didn't want to engage in a battle as the day was coming to an end, especially since he had only half of his troops with him and they weren't prepared for battle. It was March 31, 1737. However, his cousin Azimullah was ready to fight. As night fell, the Wazir's main army finally caught up with his advance group. As they faced more and more enemy soldiers, the Marathas decided to withdraw. At night, they moved away from the battlefield and headed towards Rajputana, traveling all through the night until they reached Rewari and Kot Putli. == Aftermath == File:Itimad ad Daula, Qamar-ud-din.jpg|Grand Wazir of Mughal Empire Khan Dauran received news of Bajirao's attack while he was in Agra, at a place called Gau Ghat. He marched quickly for three days, taking short breaks, and joined the Wazir's army the day after Bajirao's battle. Sadat Khan arrived two days later. By that time, Bajirao had already reached Kotputli. The four Mughal leaders decided that the best course of action was to go to the royal court and congratulate the Emperor on the occasion of the Eid festival. However, Sadat Khan fell out of favor with the Emperor. He had asked the Emperor for control of four provinces: Agra, Malwa, Gujarat, and Ajmer, and promised to keep the Marathas from entering the north. The Emperor gave a loose response and didn't grant him his demands, instead ordering him to return to Awadh and Bangash to protect Agra. The Wazir and Khan Durran were told to go back to their homes. == List of Military engagements == Date Conflict Marathas Mughals Result 1 March 1737 Plunder of Doab Maratha Empire Mughal Empire Marathas under Malhar rao Holkar Plundered the Doab region * Etawah, Shukohabad, Firozabad and Itimadpur plundered and looted. 12th March 1737 Battle at Jalesar Maratha Empire Mughal Empire Maratha armies destroyed, Mughals killing about 1500 of them. 30th March 1737 Plunder at Kalika Temple Maratha Empire Mughal Empire Bajirao suddenly arrives at the borders of Delhi, plundering and looting few of the pilgrims. 31st March 1737 Battle at Tal Katora Maratha Empire Mughal Empire Marathas under Bajirao defeats and destroys almost all of the Mughal army under Mir Koka. 1st-2nd April 1737 Skirmishes at Badshahpur Maratha Empire Mughal Empire Both Marathas and Mughals avoids pitched battle. Few horses and elephants seized by Marathas, with the loss of 30 men. == References == Category:1730s Category:18th century in India",
 "title": "Bajirao's march to Delhi"
}