{
 "id": "1127761",
 "text": "Alta California ('Upper California'), also known as Nueva California ('New California') among other names, was a province of New Spain formally established in 1804. Along with the Baja California peninsula, it had previously comprised the province of , but was made a separate province in 1804 (named ). Following the Mexican War of Independence, it became a territory of Mexico in April 1822 and was renamed in 1824. The territory included all of the U.S. states of California, Nevada, and Utah, and parts of Arizona, Wyoming, and Colorado. The territory was with Baja California (as a single ) in Mexico's 1836 Siete Leyes (Seven Laws) constitutional reform, granting it more autonomy. That change was undone in 1846, but rendered moot by the outcome of the Mexican–American War in 1848, when most of the areas formerly comprising Alta California were ceded to the U.S. in the treaty which ended the war. In 1850, California joined the union as the 31st state. ==References== ==Further reading== * Album of Views of the Missions of California, Souvenir Publishing Company, San Francisco, Los Angeles, 1890s. *Beebe, Rose Marie (2001). Lands of Promise and Despair: Chronicles of Early California, 1535–1846. Berkeley: Heyday Books. * Blomquist, L.R., A Regional Study of the Changes in Life and Institutions in the San Luis Obispo District, 1830–1850 (M.A. thesis, History Department, University of California, Berkeley, 1943). Source consulted by Ryan & Breschini (2010). * Breschini, G.S., T. Haversat, and R.P. Hampson, A Cultural Resources Overview of the Coast and Coast-Valley Study Areas [California] (Coyote Press, Salinas, CA, 1983). Source consulted by Ryan & Breschini (2010). * California Mission Sketches by Henry Miller, 1856 and Finding Aid to the Documents relating to Missions of the Californias : typescript, 1768–1802 at the Bancroft Library * Fink, Augusta (1972). Monterey, The Presence of the Past. San Francisco, CA: Chronicle Books. * * Milliken, Randall (1995). A Time of Little Choice: The Disintegration of Tribal Culture in the San Francisco Bay Area 1769–1910. Menlo Park, CA: Ballena Press Publication. * The Missions of California, by Eugene Leslie Smyth, Chicago: Alexander Belford & Co., 1899. ==Footnotes== ==Other websites== * Worldstatesmen.org: Provinces of New Spain * Alta California grants in UC Library System Calisphere * Mexican Land Grants of Santa Clara County at the University of California, Berkeley, Earth Sciences & Map Library * POPULATION IN ALTA CALIFORNIA:1790-1830 . CALIFORNIA STATE UNIVERSITY, NORTHRIDGE Category:New Spain",
 "title": "Alta California"
}