{
 "id": "1127471",
 "text": "\"Snap Your Fingers, Snap Your Neck\" is a song by the American heavy metal band Prong. It was released in 1994 as the lead single from their fourth studio album Cleansing. It's the band's biggest hit, peaking at #80 on the UK single chart for two weeks. ==Recording== Metal Hammer writer Stephen Hill states that \"Snap Your Fingers, Snap Your Neck\" was built on fat hooks, straight-to- the-point beats and a downtuned, chugging riff that would later become a staple of the emergent nu metal scene. But although Snap... has one of Prong’s most iconic riffs, Tommy admits he can’t remember much about writing it.\" “We didn’t want to do thrash or crossover,” Tommy Victor explains. “We didn’t know what to do, but we knew we didn’t want to do that. So we thought, ‘Let’s go back to floor-danceable metal’, the kind of thing that people wanted to listen to in clubs. Regular songs rather than Master of Puppets.” ==Legacy== “That song enabled Prong to have some longevity,” Victor says. “I look at it like this: it contributed to this career that I’ve had for so long. We’ve got something to preserve now, we’ve got our 13th album State Of Emergency coming out, that’s pretty cool. That legacy of Prong, to be able to continue that and still be on a record label, probably because of that song, it’s great. It still gets added to Spotify playlists, the numbers are good, and it doesn’t stop.” A music video of \"Snap Your Fingers, Snap Your Neck\" was released in 1994. It saw heavy rotation on MTV. It was also featured on an episode of Beavis and Butt-Head. The song has been covered by Dry Kill Logic, Demon Hunter, Six Feet Under and Grinspoon. ==Track listing== ;Vinyl single ;CD single ==Personnel== ;Prong *Tommy Victor — vocals, guitar *Paul Raven — bass guitar *Ted Parsons — drums *John Bechdel — keyboards, programming ;Technical credits *Terry Date — producer, engineer *Prong — producer *Ted Jensen — mastering ==References== Category:1994 songs Category:Groove metal songs",
 "title": "Snap Your Fingers, Snap Your Neck"
}