{
 "id": "112747",
 "text": "Damon Graham Devereux Hill OBE (born 17 September 1960) is a British retired racing driver. He was the 1996 Formula One World Champion. As the son of double Formula One world champion Graham Hill, he is the only son of a world champion to win the title, until Nico Rosberg, son of 1982 World Champion Keke Rosberg, clinched the title in 2016 . Despite the famous family name, Hill had an uphill struggle to reach the ranks of F1. Damon Hill came to professional motorsports relatively late: he began racing motorcycles in 1983 at the age of 23. The following year, he won the 350 cc Clubman's cup at Brands Hatch. In 1985, he moved on to four-wheel single-seater racing with Team Van Diemen in the Formula Ford championship, before moving up into the UK Formula 3 championship in 1986. After three seasons in Formula 3, where he won four races, Hill ascended another tier of open-wheel racing by joining Mooncraft in the International Formula 3000 championship, where, although often competitive, he never won a race. Hill started his Formula One career in 1992 with the then uncompetitive Brabham team. His debut race was at the British Grand Prix where he qualified on the back row. He took the first of his 22 victories at the 1993 Hungarian Grand Prix for the Williams team the following year. In 1994, he won the British Grand Prix, a race his father had never won in his long and successful career. During the mid 1990s, Hill was Michael Schumacher's main rival for the Formula One Driver's Championship, finishing runner-up in the German's 1994 and 1995 title seasons. The two had a series of controversial clashes on and off the track, including the collision at the 1994 Australian Grand Prix that gave Schumacher his first title by a single point. Hill took eight victories and the world championship in 1996. Despite this, Williams decided in mid-1996 not to renew Hill's contract for 1997. He went on to record the Jordan team's first ever win at the 1998 Belgian Grand Prix, and came within a few miles of being the only driver to win a Grand Prix for the Arrows team and their Yamaha engine supplier at the 1997 Hungarian Grand Prix. He retired from the sport at the end of the 1999 season, after 122 races. In 2006, Hill became president of the British Racing Drivers' Club, succeeding Jackie Stewart. Hill's son Josh is a racing driver. ==Formula One results== Races in bold indicate pole position Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 WDC Points 1992 Motor Racing Developments Ltd. Brabham BT60B Judd GV 3.5 L V10 RSA MEX BRA ESP DNQ SMR DNQ MON DNQ CAN DNQ FRA DNQ GBR 16 GER DNQ HUN 11 BEL ITA POR JPN AUS NC 0 1993 Canon Williams Team Williams FW15C Renault RS5 3.5 L V10 RSA Ret BRA 2 EUR 2 SMR Ret ESP Ret MON 2 CAN 3 FRA 2 GBR Ret GER 15 HUN 1 BEL 1 ITA 1 POR 3 JPN 4 AUS 3 3rd 69 1994 Rothmans Williams Renault Williams FW16, FW16B Renault RS6 3.5 L V10 BRA 2 PAC Ret SMR 6 MON Ret ESP 1 CAN 2 FRA 2 GBR 1 GER 8 HUN 2 BEL 1 ITA 1 POR 1 EUR 2 JPN 1 AUS Ret 2nd 91 1995 Rothmans Williams Renault Williams FW17, FW17B Renault RS7 3.0 L V10 BRA Ret ARG 1 SMR 1 ESP 4 MON 2 CAN Ret FRA 2 GBR Ret GER Ret HUN 1 BEL 2 ITA Ret POR 3 EUR Ret PAC 3 JPN Ret AUS 1 2nd 69 1996 Rothmans Williams Renault Williams FW18 Renault RS8 3.0 L V10 AUS 1 BRA 1 ARG 1 EUR 4 SMR 1 MON Ret ESP Ret CAN 1 FRA 1 GBR Ret GER 1 HUN 2 BEL 5 ITA Ret POR 2 JPN 1 1st 97 1997 Danka Arrows Yamaha Arrows A18 Yamaha OX11A 3.0 L V10 AUS DNS BRA Ret ARG Ret SMR Ret MON Ret ESP Ret CAN 9 FRA 12 GBR 6 GER 8 HUN 2 BEL 13 ITA Ret AUT 7 LUX 8 JPN 11 EUR Ret 12th 7 1998 B&H; Total Jordan Jordan 198 Mugen–Honda MF-301 HC 3.0 L V10 AUS 8 BRA DSQ ARG 8 SMR 10 ESP Ret MON 8 CAN Ret FRA Ret GBR Ret AUT 7 GER 4 HUN 4 BEL 1 ITA 6 LUX 9 JPN 4 6th 20 1999 B&H; Jordan Jordan 199 Mugen–Honda MF-301 HC 3.0 L V10 AUS Ret BRA Ret SMR 4 MON Ret ESP 7 CAN Ret FRA Ret GBR 5 AUT 8 GER Ret HUN 6 BEL 6 ITA 10 EUR Ret MAL Ret JPN Ret 12th 7 Category:1960 births Category:Living people Category:Sportspeople from London Category:English Formula One drivers Category:Officers of the Order of the British Empire",
 "title": "Damon Hill"
}