{
 "id": "1127598",
 "text": "The men's 1000 metre freestyle was an event in the 1900 Summer Olympics in Paris. It was the middle length of the events. It was on 11 August and 12 August 1900. There were 16 swimmers. These swimmers were from 6 different nations. John Arthur Jarvis of Great Britain won the event. Otto Wahle of Austria was in 2nd place. Zoltán Halmay of Hungary was in 3rd place. ==Background== This was the only 1000 metre freestyle event in the Olympics. In 1896, they swam 1200 metres. The 1000 metres was supposed to replace the 1200. In 1904, the 880 yard and 1 mile replaced the 1000 metres. The 800 metres was used every year after that. The 1500 metres would not be used until 2020. John Arthur Jarvis was most famous distance swimmer of the time. He was the favorite swimmer in the race. ==Competition== There was a semifinals and a final. There were 4 semifinals. Each semifinal had 4 swimmers. The fastest swimmer in each semifinal went to the final. The fastest 6 times also went to the final. If you were the fastest swimmer in your semifinal, you would not be counted in the 6 fastest times. This meant that the final had 10 swimmers. The races were in the Seine. ==Schedule== Date Time Round Sunday, 11 August 1900 11:45 Semifinals Monday, 12 August 1900 14:00 Final ==Results== ===Semifinals=== There were 4 semifinals. The semifinals were on 11 August. ====Semifinal 1==== Rank Swimmer Nation Time Notes 1 14:28.6 , 2 17:13.2 3 17:41.2 4 Fumouze 18:00.0 ====Semifinal 2==== Place Swimmer Nation Time Notes 1 17:18.0 2 Lué 24:15.0 3 Lapostolet 25:52.0 — Souchu ====Semifinal 3==== Place Swimmer Nation Time Notes 1 14:52.0 2 15:27.0 3 17:09.6 4 18:17.2 ====Semifinal 4==== Place Swimmer Nation Time Notes 1 15:54.0 2 16:54.0 3 16:58.0 4 Texier 21:33.0 ===Final=== The final was held on 12 August. Jarvis won easily. He was a minute faster than 2nd place. Rank Swimmer Nation Time Notes 13:40.2 14:43.6 15:16.4 4 15:22.6 5 16:30.4 6 16:53.2 7 16:53.4 8 17:13.8 9 17:50.0 — ==Results summary== Rank Swimmer Nation Semifinals Final Notes 14:28.6 13:40.2 15:27.0 14:43.6 14:52.0 15:16.4 4 15:54.0 15:22.6 5 16:58.0 16:30.4 6 17:09.6 16:53.2 7 17:13.2 16:53.4 8 17:18.0 17:13.8 9 17:41.2 17:50.0 10 16:54.0 11 Fumouze 18:00.0 rowspan=6 12 18:17.2 13 Texier 21:33.0 14 Lué 24:15.0 15 Lapostolet 25:52.0 — Souchu ==References== Category:Swimming at the 1900 Summer Olympics",
 "title": "Swimming at the 1900 Summer Olympics – Men's 1000 metre freestyle"
}