{
 "id": "1127199",
 "text": "Fifty Fifty (; put in all caps) is a South Korean girl group made by Attrakt in 2022. The group has five members. They are Keena, Chanelle, Yewon, Hana, and Athena. It used to be a four-people group. Saena, Aran, and Sio left in 2023 following the ending of their contracts. They make music since November 18, 2022, with their extended play (EP) The Fifty. They became famous with their viral hit single \"Cupid\". The single was released in February 2023. It made Fifty Fifty the fastest K-pop group to enter the US Billboard Hot 100 and UK Singles Chart, within four months of letting out a song. It also made them the first K-pop girl group to get to the top ten of the UK charts. In 2023, they signed to Warner Music Korea. Later that year, in the middle of a long time of legal debates and claims surrounding the group's contracts and treatment by Attrakt, group members Saena, Aran, and Sio had their contracts ended. Keena was the only member left in the group. It was later decided that Fifty Fifty would re-debut in September 2024. Four new members were added to the group. == Name == The group's name, Fifty Fifty, shows the state, in equal parts, of a hope-filled ideal and a difficult reality, as well as their hope to become a whole 100 with their fans. == History == === Pre-debut === In 2019, Attrakt CEO Jeon Hong-joon and the CEO of performance making company KAMP met in Singapore during a festival. They decided to work together to make a global K-pop girl group. They put KAMP in charge of the overseas marketing. The two companies were joined by one of KAMP workers and producers, Ahn Sung- il. Twelve trainees were hired by Jeon for a year. It was from December 2019 and was finally put down to four through monthly evaluations. In January 2021, KAMP left the project because of different views over the global strategy. In May, Ahn and two other KAMP workers who had been in the project left and made The Givers. Jeon was in charge of raising money. Ahn chose the music direction and trained the members in music theory, singing, dancing, rapping, acting and English. More than a month were spent on the group, and more than a billion dollars was invested in the making of four music videos. Prior to the group's debut, Saena was a contestant on KBS' dancing competition show Dancing High. === 2022: Starting and debut with The Fifty === After two years of training, on November 14, 2022, Fifty Fifty said that they would be letting out their debut in November 2022. They let out the group's official logo image posted across all the group's social media accounts. The same day, a pre-released music video for the song \"Lovin Me\" was let out on their official YouTube channel. The members were shown on November 15 through the photo of their debut album. It showed the names and the debut date, and official photos of the members for the first time. A performance video of \"Log In\" was also let out the same day. Fifty Fifty let out their debut extended play (EP) The Fifty on November 18, 2022. \"Higher\" was the lead single. The album has the first journey of girls who want freedom beyond the troubles of reality and later move on to a utopia. It has four tracks – \"Higher\", which has an R&B; pop feeling that sings about the world of ecstasy and dreams. Another track is \"Tell Me\", a city pop song. There is also \"Lovin Me\", which gives a message of comfort to people who are going through growing pains. There is also \"Log In\", which shows the movements of girls who rebel to escape from the real world with extreme performances. Promotions for the extended play's let out began on November 22 with their music broadcast debut on SBS M's The Show. It ended on KBS2's Music Bank on December 2. The EP did not go to the Circle Album Chart when it was first let out.Cumulative sales of The Fifty: * * * * It debuted at number forty-four on the chart issue dated December 18–24, 2022. It has 2,597 album sales. Korean critic magazine IZM rated the album 4.5 out of 5 stars. It was the highest rating the magazine had ever given to a girl group. The writer, Son Seung-geun, said that Fifty Fifty \"is a good example of what happens when great songs and good singers meet. Thanks to them, Korea has one more good girl group.\" === 2023: Worldwide success with \"Cupid\" and legal dispute with Attrakt === On February 24, 2023, the group let out its first album, The Beginning: Cupid, along with the music video for the title track \"Cupid\". The song was recorded both in Korean and English. It saw Keena writing part of the Korean lyrics. Soon after, a fan-made sped-up song of the English version went viral on TikTok. \"Cupid\" then went on the Billboard Hot 100 on March 27. It made them the sixth group and the fastest K-pop group in history to do so. The song went on to become the highest-charting song by a South Korean girl group in the history of the Pop Airplay chart. It's also the second South Korean music act to land on the Adult Pop Airplay after BTS. On June 19, the members of the group wanted an order to stop their contracts with Attrakt, talking about the violation of in-contract duties, as well as the lack of truth in money settlements, and medical negligence, during the group's promotions. They also wanted trademarks of the group's name and their stage names. The news of the lawsuit was later shown to the public after Attrakt accused Warner Music Korea and Ahn Sung-il of trying to get the members to break their contracts to sign with another agency. The ongoing lawsuit ended in the ending of advertising contracts and the KCON LA 2023 appearance scheduled for August 19. On October 17, one of the members, Keena, took away her lawsuit against Attrakt and returned to her original agency. On October 23, Attrakt announced the ending of the contracts of the other three members (Saena, Aran, and Sio) as of October 19. On October 29, Attrakt said that Keena would be at the Billboard Music Awards for the group, with plans to put together the group in the future. On November 2, it was said that the group would be going on again with a \"second generation\" of members, with Keena as part of the group, along with three new members. === 2024–present: Re- organization as 5-member group === On January 8, 2024, it was said that auditions were made to recruit three to four new members to join Fifty Fifty alongside Keena, with a view to re-launch the group as a four or five-member girl group. One of these auditions was set to take place from January to February 2024 in the Southeast Asian region, exactly in Singapore and Thailand, to get new members for the re-debut of Fifty Fifty, which was covered to take place in the second quarter of 2024. Attrakt's CEO Jeon Hong- joon and Singaporean K-pop singer David Yong (who is also CEO of a Singaporean company) are set to see the Southeast Asia audition as part of its judging panel. On June 14, it was said that Fifty Fifty would make their comeback in September 2024 as a five-member group, with four new members joining the new group with the current member Keena. A pre-release single is also said to be in the making, and made to be let out before their official comeback date. On August 7, it was said that the group will let out their second EP on September 20, with a pre-release single to be let out on August 30. Two days later, Chanelle, Yewon, and Hana were shown as the three of the four new members. Before joining the group, Yewon and Chanelle were former trainees of Hybe Corporation and contestants of 2023 survival show R U Next?, which made the girl group Illit. Hana was a 18-year-old former contestant of Mnet's children's song survival program We Kid in 2016. On August 12, Athena was shown as the final new member. == Members == Current * Keena (; 2022–present) * Chanelle (; 2024–present) * Yewon (; 2024–present) * Hana (; 2024–present) * Athena (; 2024–present) Past * Saena (; 2022–2023) * Aran (; 2022–2023) * Sio (; 2022–2023) == Videography == === Music videos === Title Year Director(s) \"Lovin' Me\" 2022 Byunghak Park, Sujung Lee \"Log In\" Performance Video Jin Juyi, Moon MinJoo (Zanybros, Rollcam Media) \"Higher\" Naive Creative Production \"Tell Me\" Official Lyric Video Danny JY Lee \"Cupid\" 2023 Myunghyun Bae (Zanybros) \"Cupid\" (TwinVer.) Official Lyric Video Danny JY Lee === Other videos === Title Year Director(s) \"What If\" – Aran's Concept Film 2022 rowspan=\"4\" \"What If\" – Keena's Concept Film \"What If\" – Sio's Concept Film \"What If\" – Saena's Concept Film == Filmography == === Web shows === Year Title Note 2022–2023 Fifty Company Premiered on November 18, 2022 == References == == Other websites == * Category:2020s South Korean music groups Category:2022 establishments in South Korea Category:K-pop music groups Category:Musical groups established in 2022 Category:Musical quartets Category:Musical quintets Category:South Korean girl groups Category:Dance music groups",
 "title": "Fifty Fifty (group)"
}