{
 "id": "1127014",
 "text": "Permanent Residence in the United States, commonly known as having a Green Card, gives a person the right to live and work permanently in the U.S. It is a big step for many people who want to become U.S. citizens. The process for getting permanent residence can be complicated and involves several steps. == Overview == A Green Card allows a person who is not a U.S. citizen to live and work permanently in the United States. People with Green Cards are called lawful permanent residents (LPRs). They have many of the same rights as U.S. citizens but cannot vote in federal elections or serve on juries. == Ways to Get a Green Card == === Family-Based Immigration === Family-based immigration allows U.S. citizens and lawful permanent residents to sponsor certain relatives for a Green Card. Close relatives of U.S. citizens, like spouses, unmarried children under 21, and parents, have the highest priority and do not have to wait for a visa number. Other family members, like married children and siblings of U.S. citizens, and spouses and unmarried children of permanent residents, have to wait for a visa number and fall into categories with yearly limits. === Employment-Based Immigration === Employment-based immigration is divided into five categories: # First Preference (EB-1): People with special abilities, outstanding professors and researchers, and certain managers and executives of multinational companies. # Second Preference (EB-2): Professionals with advanced degrees or people with exceptional abilities. # Third Preference (EB-3): Skilled workers, professionals, and other workers. # Fourth Preference (EB-4): Special immigrants, including certain religious workers and employees of U.S. foreign missions. # Fifth Preference (EB-5): Investors who invest a lot of money in a new business that creates jobs for U.S. workers. === Diversity Visa Lottery === The Diversity Visa (DV) Lottery program, also known as the Green Card Lottery, gives up to 50,000 visas each year. It aims to diversify the U.S. population by selecting people from countries with low rates of immigration to the U.S. === Refugees and Asylees === People who are granted asylum or refugee status in the U.S. can apply for a Green Card after one year. Refugees are usually referred by the United Nations Refugee Agency (UNHCR) and go through a thorough screening process before coming to the U.S. == Application Process == === Family-Based Process === For family-based Green Cards, the U.S. citizen or permanent resident sponsor must file a Petition for Alien Relative (Form I-130) with U.S. Citizenship and Immigration Services (USCIS). Once approved, the relative must wait for a visa number (if needed) and then file an Application to Register Permanent Residence or Adjust Status (Form I-485). === Employment-Based Process === For employment-based Green Cards, the process often starts with the employer getting a labor certification from the Department of Labor (DOL). The employer then files an Immigrant Petition for Alien Worker (Form I-140) with USCIS. Once approved and a visa number is available, the worker can file Form I-485. === Diversity Visa Process === Winners of the DV Lottery must submit a visa application and go to an interview at a U.S. embassy or consulate. If approved, they get an immigrant visa and can apply for a Green Card when they enter the U.S. == Rights and Responsibilities == === Rights of Green Card Holders === * Work: Green Card holders can work in any legal job in the U.S. * Residency: They can live permanently in the U.S. and travel within the country. * Education: They can go to public schools and may qualify for in-state tuition at public colleges. * Legal Protection: They are protected by U.S. laws and can get certain government benefits. === Responsibilities of Green Card Holders === * Laws: They must follow all U.S. laws. * Taxes: They must pay federal, state, and local taxes. * Address Changes: They must tell USCIS if they move within 10 days. * Selective Service: Male Green Card holders aged 18-25 must register with the Selective Service. == Keeping Permanent Residence == Green Card holders must maintain their status by living in the U.S. and not staying outside the country for long periods. If they plan to be outside the U.S. for more than a year, they should apply for a re-entry permit to avoid losing their status. == Path to Citizenship == Green Card holders can apply for U.S. citizenship through naturalization. Generally, they must live in the U.S. as permanent residents for at least five years (three years if married to a U.S. citizen), show good moral character, and pass English and civics tests. == References == * U.S. Citizenship and Immigration Services. \"Green Card Eligibility Categories.\" USCIS Website. * U.S. Department of State. \"Diversity Visa Program.\" State Department Website. * Federal Register. \"Immigration and Nationality Act.\" Federal Register Website. * U.S. Department of Homeland Security. \"Lawful Permanent Residents.\" DHS Website. * \"The Immigration and Nationality Act.\" U.S. Code, Title 8. Category:Immigration to the United States",
 "title": "Permanent residence (United States)"
}