{
 "id": "1127013",
 "text": "The Glass–Steagall Legislation refers to a set of laws in the United States that were put into place in 1933 to fix problems in the banking system during the Great Depression. These laws aimed to restore trust in banks and prevent future financial crises. == Historical Context == === The Great Depression === The Glass–Steagall laws came about after the Great Depression began. The stock market crash of 1929 caused many banks to fail, leading to a loss of trust in financial institutions. People believed that banks were taking too many risks, which contributed to the economic collapse. === The Pecora Investigation === The Pecora Investigation, led by Ferdinand Pecora, uncovered widespread problems in the banking industry. It revealed risky practices and conflicts of interest among banks. This investigation helped build support for the Glass–Steagall laws, which were designed to address these issues. == Key Provisions == === Separation of Commercial and Investment Banking === The Glass–Steagall Act required that commercial banks, which handle deposits and loans, be kept separate from investment banks, which deal in stocks and bonds. This separation was intended to prevent banks from taking excessive risks with depositors' money. === Creation of the Federal Deposit Insurance Corporation (FDIC) === The FDIC was created to insure bank deposits. This meant that if a bank failed, depositors would still get their money back up to a certain amount. This insurance helped to rebuild public confidence in the banking system. === Regulation of Securities Activities === The Act restricted banks from engaging in certain securities activities. It aimed to prevent banks from using depositor money for risky investments and to reduce conflicts of interest. === Prohibition of Interest on Demand Deposits === The Glass–Steagall Act also banned banks from paying interest on checking accounts. This rule was intended to make banks less likely to engage in speculative activities with depositor funds. == Implementation and Impact == === Immediate Effects === The Glass–Steagall Act quickly led to the restructuring of banks, with many institutions separating their commercial and investment activities. The FDIC insurance also helped restore trust in banks. === Long-Term Effects === Over time, the Glass–Steagall Act contributed to a more stable banking environment by limiting the types of risks banks could take. This helped prevent conflicts of interest and speculative bubbles, making the financial system more secure. == Repeal and Modern Implications == === Erosion and Repeal === Starting in the 1980s, parts of the Glass–Steagall Act were weakened. The most significant change came in 1999 with the Gramm- Leach-Bliley Act, which allowed banks to combine commercial and investment banking activities once again. === Financial Crisis of 2007-2008 === The repeal of Glass–Steagall has been blamed for contributing to the financial crisis of 2007-2008. Critics argue that the deregulation led to risky practices and conflicts of interest that played a role in the crisis. === Calls for Reinstatement === After the financial crisis, there were calls to bring back some aspects of the Glass–Steagall Act to prevent similar problems in the future. Some people believe that separating commercial and investment banking is necessary for financial stability. == Legacy == The Glass–Steagall Legislation is a key part of U.S. financial history. It established important regulations for banks and helped build confidence in the financial system. Although parts of the Act have been repealed, its principles continue to influence discussions on financial regulation and stability. == References == # Benston, George J. The Separation of Commercial and Investment Banking: The Glass–Steagall Act Revisited and Reconsidered. Oxford University Press, 1990. # Kroszner, Randall S., and Raghuram G. Rajan. \"Is the Glass-Steagall Act Justified? A Study of the U.S. Experience with Universal Banking Before 1933.\" American Economic Review, vol. 84, no. 4, 1994, pp. 810-832. # Whalen, Gary. The Origins of the Glass–Steagall Act and the Great Depression. Office of the Comptroller of the Currency, 2001. # Barth, James R., et al. Rethinking Bank Regulation: Till Angels Govern. Cambridge University Press, 2006. # \"Glass- Steagall Act (1933).\" Federal Reserve History. Category:United States law Category:1933 in the United States",
 "title": "Glass–Steagall legislation"
}