{
 "id": "1127892",
 "text": "At the 1936 Summer Olympics in Berlin, there were 29 athletics events. 23 of these were for men. 6 of these were for women. These events were the same in the 1932 games. There were 776 athletes. These athletes were from 43 different nations. ==Medal summary== ===Men=== 100 metres 10.3 10.4 10.5 200 metres 20.7 21.1 21.3 400 metres 46.5 46.7 46.8 800 metres 1:52.9 1:53.3 1:53.6 1500 metres 3:47.8 3:48.4 3:49.2 5000 metres 14:22.2 14:25.8 14:29.0 10,000 metres 30:15.4 30:15.6 30:20.2 110 metres hurdles 14.2 14.4 14.4 400 metres hurdles 52.4 52.7 52.8 3000 metres steeplechase 9:03.8 9:06.8 9:07.2 4 × 100 metres relay Jesse Owens Ralph Metcalfe Foy Draper Frank Wykoff 39.8 Orazio Mariani Gianni Caldana Elio Ragni Tullio Gonnelli 41.1 Wilhelm Leichum Erich Borchmeyer Erwin Gillmeister Gerd Hornberger 41.2 4 × 400 metres relay Freddie Wolff Godfrey Rampling Bill Roberts Godfrey Brown 3:09.0 Harold Cagle Robert Young Edward O’Brien Al Fitch 3:11.0 Helmut Hamann Friedrich Von Stülpnagel Harry Voigt Rudolf Harbig 3:11.8 Marathon Both Sohn Kee-chung (Son Kitei) and Nam Sung-yong (Nan Shoryu) were from Korea. The IOC credits both medals to Japan due to Korea being a Japanese colony at the time. All Korean Olympians during the Japanese colonial rule could only participate in the Games as a representative of Japan and Japan required them to use the Japanese forms of their names. However, some sources still refer to Son Kitei as the first Korean to win an Olympic marathon. 2:29:19.2 2:31:23.2 2:31:42.0 50 kilometres walk 4:30:41.4 4:32:09.2 4:32:42.2 High jump 2.03 m 2.00 m 2.00 m Pole vault 4.35 m 4.25 m 4.25 m Long jump 8.06 m 7.87 m 7.74 m Triple jump 16.00 m 15.66 m 15.50 m Shot put 16.20 m 16.12 m 15.66 m Discus throw 50.48 m 49.36 m 49.23 m Hammer throw 56.49 m 55.04 m 54.83 m Javelin throw 71.84 m 70.77 m 70.72 m Decathlon 7900 7601 7275 ===Women=== 100 metres 11.5 11.7 11.9 80 metres hurdles 11.7 11.7 11.7 4 × 100 metres relay Harriet Bland Annette Rogers Betty Robinson Helen Stephens 46.9 Eileen Hiscock Violet Olney Audrey Brown Barbara Burke 47.6 Dorothy Brookshaw Mildred Dolson Hilda Cameron Aileen Meagher 47.8 High jump 1.60 m 1.60 m 1.60 m Discus throw 47.63 m 46.22 m 39.80 m Javelin throw 45.18 m 43.29 m 41.80 m == Records broken == There were 20 new Olympic records. There were also 6 new world records that were broken. === Men's Olympic and world records === Event Date Round Name Nationality Result OR WR 200 metres 5 August Final Jesse Owens 20.7 OR 1500 meters 6 August Final Jack Lovelock 3:47.8 OR WR 5000 metres 7 August Final Gunnar Höckert 14:22.2 OR 110 metres hurdles 6 August Semi-final Forrest Towns 14.1 OR WR 3000 metres steeplechase 8 August Final Volmari Iso-Hollo 9:03.8 OR Was a \"world best\" time as world records were not yet recognised for the event. 4 × 100 metres relay 9 August Final Jesse Owens Ralph Metcalfe Foy Draper Frank Wykoff 39.8 OR WR Marathon 9 August Final Son Kitei 2:29:19.2 OR 50 kilometres walk 5 August Final Harold Whitlock 4:30:41.4 OR Long jump 4 August Final Jesse Owens 8.06 m ORWind-aided mark recognised as Olympic record. Triple jump 6 August Final Naoto Tajima 16.00 m OR WR High jump 2 August Final Cornelius Johnson 2.03 m OR Pole vault 5 August Final Earle Meadows 4.35 m OR Shot put 2 August Final Hans Woellke 16.20 m OR Discus throw 5 August Final Ken Carpenter 50.48 m OR Hammer throw 3 August Final Karl Hein 56.49 m OR Decathlon 8 August Final Glenn Morris 7900 OR WR === Women's Olympic and world records=== Event Date Round Name Nationality Result OR WR 80 metres hurdles 5 August Semi-final Trebisonda Valla 11.6 OR 4 × 100 metres relay 8 August Heats Emmy Albus Käthe Krauß Marie Dollinger Ilse Dörffeldt 46.4 OR WR Discus throw 4 August Final Gisela Mauermayer 47.63 m OR Javelin throw 2 August Final Tilly Fleischer 45.18 m OR ==References== *1936 Summer Olympics results: athletics, from https://www.sports- reference.com/; retrieved 2010-04-05. *International Olympic Committee results database ==Notes== Category:1936 Summer Olympics events 1936",
 "title": "Athletics at the 1936 Summer Olympics"
}