{
 "id": "1127069",
 "text": "Black women have made important contributions in many areas, including civil rights, women's rights, politics, the arts, science, and more. Despite facing racism and sexism, they have played key roles in shaping history and society. == Historical context == === Slavery and abolition === During slavery in the United States, Black women faced severe hardships. Many became leaders and symbols of resistance. Harriet Tubman helped many slaves escape to freedom through the Underground Railroad. Sojourner Truth, a former slave, became famous for her speeches against slavery and for women's rights. === Civil Rights Movement === In the 20th century, Black women were crucial in the American Civil Rights Movement. Rosa Parks' refusal to give up her bus seat led to the Montgomery Bus Boycott, a major event in the fight for racial equality. Women like Ella Baker and Fannie Lou Hamer organized and fought for voting rights and justice. == Contemporary Contributions == === Politics and leadership === Black women have made significant progress in politics. Shirley Chisholm was the first Black woman elected to the U.S. Congress in 1968. Kamala Harris made history as the first female Vice President of the United States and the first Black and South Asian woman in the role. === Arts and culture === Black women have greatly influenced arts and culture. Writers like Toni Morrison and Maya Angelou have received praise for their work on race and identity. In music, artists like Aretha Franklin, Beyoncé, and Nina Simone have made lasting impacts with their powerful voices and messages. === Science and technology === In science and technology, Black women have achieved remarkable success. Dr. Mae Jemison was the first Black woman astronaut to go to space in 1992. Katherine Johnson's mathematical work at NASA was vital to the U.S. space program and is featured in the movie \"Hidden Figures.\" == Social and economic impact == === Entrepreneurship and business === Black women have also excelled in business. They are one of the fastest-growing groups of entrepreneurs in the United States. Leaders like Ursula Burns, former CEO of Xerox, and Oprah Winfrey, media mogul and philanthropist, have set examples for future generations. === Advocacy and activism === Black women continue to lead in advocacy and activism. Tarana Burke started the Me Too movement, and Alicia Garza co-founded the Black Lives Matter movement, both addressing important social issues like sexual violence and racial injustice. == Challenges and resilience == === Systemic Barriers === Despite their achievements, Black women still face systemic barriers. These include gaps in education, employment, healthcare, and representation. They often experience higher rates of discrimination and violence, and their contributions are sometimes overlooked. === Ongoing Struggle for Equality === The fight for equality continues. Black women advocate for policies to address racial and gender disparities. Their strength and determination help drive efforts for a more equal society. == Related pages == * Civil Rights Movement * Women's rights * Black Lives Matter * Intersectionality == References == * \"Women in the Civil Rights Movement.\" National Park Service. * \"Shirley Chisholm: Unbought and Unbossed.\" Biography. * \"The Impact of Black Women on the Arts.\" Smithsonian Institution. * \"Black Women in Science and Technology.\" NASA. * \"The Economic Contributions of Black Women.\" Brookings Institution. Category:Women Category:African-American people",
 "title": "Black women"
}