{
 "id": "1127687",
 "text": "The Battle of Palkhed took place on February 28, 1728, in the village of Palkhed, near Vaijapur, Maharashtra, India. It was a fight between the Maratha Empire and the Hyderabad State. The Marathas won the battle, defeating the Nizam of Hyderabad. == Beginning == In 1725 and 1726, when Bajirao led campaigns into the Carnatic region, the Nizam of Hyderabad became very angry and began preparing to face the Marathas. The Nizam convinced several Maratha nobles, like Chandrasen Jadhav, Udaji Chavan, and Rao Rambha Nimbalkar, to join his side. He also tried to create divisions between the two Maratha leaders, Sambhaji and Shahu. The Nizam moved his capital from Aurangabad to Hyderabad, a more distant place where he could plot against the Marathas without them knowing. When Baji Rao demanded taxes (chauth and sardeshmukhi), the Nizam responded by asking him to first decide whether Shahu or Sambhaji was the true king of the Marathas. == Campaign == Sambhaji joined forces with the Nizam, forcing Baji Rao to act. On August 27, 1727, Baji Rao began attacking and plundering several of the Nizam’s territories, including Jalna, Burhanpur, and Khandesh. Taking advantage of the situation, the Nizam suddenly attacked Pune, where he declared Sambhaji as the Maratha king. However, he soon had to leave the city, leaving Fazal Beg to defend it, as he needed to deal with Baji Rao, who was plundering his lands along the Godavari River. The two armies finally met near Palkhed, about 20 miles from Daulatabad, where the Nizam was eventually forced to seek peace and he surrendered. == Aftermath == After the Battle of Palkhed, the Nizam was forced to make the following grants: # He acknowledged Shahu as the only legitimate ruler of the Marathas. # He recognized Shahu's right to collect the taxes known as chauth and sardeshmukhi in the Deccan region. # The Maratha tax collectors who had been removed were allowed to return to their positions. # The Nizam agreed to pay the overdue amounts of chauth and sardeshmukhi. == References == Category:1728 Category:18th century in India Category:Battles involving India",
 "title": "Battle of Palkhed"
}