{
 "id": "1127544",
 "text": "The North Coast of California (also called the Redwood Empire or the Redwood Coast in reference to the dense redwood forests throughout the region) is a region in Northern California that lies on the Pacific coast between San Francisco Bay and the Oregon border. It commonly includes Mendocino, Humboldt, and Del Norte counties and sometimes includes Lake and two counties from the San Francisco Bay area, Marin and Sonoma. ==Cities== Much of the area is rural containing few major cities. The only city with a population of over 100,000 is Santa Rosa (population 178,000) in Sonoma County, which is the largest city of the North Coast under the five-county definition. Eureka (population 27,000) in Humboldt County is the largest under the three-county definition. Despite their relatively smaller size to the major cities elsewhere in the state, many of the region's cities and towns have historical importance to the state or regional importance. ===County seats=== * Del Norte: Crescent City * Humboldt: Eureka * Lake: Lakeport * Marin: San Rafael * Mendocino: Ukiah * Sonoma: Santa Rosa ==Geography== The Pacific Ocean coast stretches from San Francisco Bay to Humboldt Bay and on to the border of Oregon. The coastline is often inaccessible, and includes rocky cliffs and hills, streams and tide pools. The coastline from Centerville Beach near Ferndale to the mouth of the Klamath River is mostly beach accessible and there are many small towns and a few cities along Highway 101, the main route through the region. The sparsely populated interior territory further inland is characterized by rugged, often steep mountains, bisected by rivers and their typically narrow valleys and canyons, and dense redwood, Douglas fir, and oak forests. The climate can range from coast side lands drenched with fog in mild winters and summers to inland reaches baked by hot sunshine on long summer days, which, at higher elevations, can be blanketed with snow in winter. The southern portion of the North Coast is largely urbanized while the rest is mostly rural. The more remote northern areas are often referred to as being located \"behind the Redwood Curtain.\" A segment of the coastline in Mendocino and Humboldt Counties is known as the Lost Coast, and is only accessible by a few back roads. Notable seaside beaches can be found at Marin Headlands and Point Reyes National Seashore in the south, with innumerable examples of remote or less used beaches north of the San Francisco Bay area. ==Related regions== * San Francisco Bay Area * Northern California ==See also== * Central Coast (California) * South Coast (California) ==References== Category:Regions of California Category:Northern California",
 "title": "North Coast (California)"
}