{
 "id": "1128234",
 "text": "Mahidevran Hatun (, meaning \"moon of fortune\", died 1581) also known as Gülbahar Hatun, (, meaning \"spring rose\"), was a concubine of sultan Suleiman the Magnificent and the mother of Şehzade Mustafa of the Ottoman Empire. == Title and status == Mahidevran was the mother of Prince Mustafa, the eldest surviving son of Sultan Suleiman the Magnificent, the ruler of the Ottoman Empire. She held an important position in her son's harem in Manisa. Although Hürrem became the beloved and legitimate wife of Sultan Suleiman, Mahidevran retained the status of mother of Suleiman's eldest son, and some diplomats referred to her as Suleiman's \"first wife\", although they never married. Until Hürrem was given the title \"Sultan\" and later \"Haseki Sultan\", all the sultan's wives were given the title \"Hatun\", meaning \"lady, woman\". Therefore, Mahidevran never had the title of Sultana in the hierarchy of the harem and was simply called \"Mahidevran Hatun\". Although her rank as mother of the eldest son was that of Baş Kadın.Mahidevran is described in academic history books (incl. Harem II by M. Çağatay Uluçay, p. 45, e.g., Mustafa'nin annesi Mahidevran baş kadinin mũeadelesi gelir by Pars Tuğlacı p. 189, 315 and in Tarih Dergisi, Issue 36 by İbrahim Horoz Basımevi, eg; Mustafa'nin annesi ve Kanuni'nin baş kadin olan Mahidevran Hatun... vya Gũlbahar Sultan p. 357) as Suleiman's consort. Despite this, he is often mistakenly referred to with the title Sultan in historical fiction. == Life with Suleiman == Mahidevran was of Circassian,Marie Broxup (1996). The North Caucasus Barrier: The Russian Advance Towards the Muslim World. Hurst. . p.29AlbanianAccording to which she was the daughter of a local composer, and that her original name was Pranverë Rosne. Note that Pranverë Rosne means, respectively, \"spring\" and \"rose\" in Albanian, the same meaning as Gülbahar, or \"spring rose\". (Relazione dell'impero ottomano riferita in Senato, Daniello de Ludovisi, Venice, 3 June 1534) or Montenegrin descent.Nicolae Iorga, Geschichte des Osmanischen Reiches, vol.2, 1909, p.344. The Turkish translation by Nilüfer Epçeli, p.291, translates it by \"Euboean\". Mahidevran was one of seventeen other women who were enrolled in the harem during Suleiman's governorship of Manisa. As a stipend, three women received 5 aspers a day as they were of high rank, and the other two received 4 aspers a day as they were of lower rank. The harem also included two concubines, Akile Hatun and Belkis Hatun, who served as Mahidevran's maids. These two women were buried with Mahidevran in a tomb in the Muradiye complex in Bursa. They are sometimes considered Mahidevran's older sisters, but it is possible that they were simply sold into the harem with Mahidevran and were employed by Mahidevran when she became Suleiman's favorite concubine. Mahidevran gave birth to her only child, Prince Mustafa, in 1516 or 1517, and her status in the harem increased. After the death of Sultan Selim I in 1520, Suleiman ascended the throne. After his accession, Mahidevran came to live in the old palace in Constantinople. In 1521, Suleiman's two sons, Mahmud and Murad, died, and Mustafa became the eldest prince of the Ottoman dynasty. This gave Mahidevran a high position. But early in Suleiman's reign, Mahidevran faced a new rival, Hurrem, who soon became Suleiman's favorite and later his wife. It is recorded by Bernardo Navaguero that Suleiman loved Mahidevran very much, as well as Hurrem. According to his report, the intense rivalry led to a fight between the two women, with Mahidevran beating Hürrem, which angered Suleiman. Hürrem was known throughout the harem for her graceful manners and beauty. She believed that every woman should submit to her authority and always respect her because she was the Sultan's favorite concubine or wife. Suleiman's mother Hafsa Sultan was able to suppress the rivalry between the two women. By 1526, Suleiman had stopped paying attention to Mahidevran and devoted all his affection to Hürrem. Although Suleiman and Hürrem had developed a close relationship long before, Mahidevran maintained a special status in the harem as the mother of their eldest son Mustafa. Suleiman ensured all the privileges for Mahidevran and their son Mustafa. In the early years of Suleiman's reign, ambassador Pietro Bragadin noted that Mahidevran and Mustafa lived in the palace in Istanbul, and Mustafa was his mother's \"all joy\". == Mustafa's governorship == According to Turkish tradition, all princes seved as provincial governors (sanjak-bey) for training. In 1553 Mustafa was sent to Manisa and Mahidevran accompanied him.Bassano wrote in 1540 about the court of Şehzade Mustafa at Diyarbakir near the Safavid border that, Şehzade had \"a wonderful and opulent court, in no way interior to that of his father\". He also wrote that, \"his mother, who was with him, showed him how to favourite himself to the people\". According to tradition, Mahidevran was the head of Mustafa's royal harem. She tried to protect Mustafa from his political rivals until the last days of her sons and probably kept in touch with several correspondents to do this. Pargali Ibrahim Pasha was also a supporter of Mustafa. In 1541, Mustafa moved to Amaysa. By 1546, compettion for Mustafa's succession began with Suleiman's three other sons, altrough the sultan would live another twenty years. Mustafa was a talented, popular and a warrior prince. So, jannisaries loved him very much. Towards the end of Suleiman's long reign, a rivalry arose between his sons. Both Hürrem and Grand Vizier Rüstem Pasha turned Mustafa against Suleiman and they were responsible for Mustafa's unrest. The envolvement of Hürrem Sultan and Grand Vizier Rüstem Pasha was questioned but never proved. During the campaing against Safavid Iran in 1553, Suleiman ordered to kill Mustafa,Lord Kinross: The Ottoman Centuries, (Trans. by Nilifer Epçeli) Altın Kitaplar, İstanbul, 2008, p. 233. accused of plotting to dethrone his father, later, proved wrong. Mahidevran sent a letter to him that his father want to kill him. But Mustafa don't take her mother's words. == Last years and death == After the death of Şehzade Mustafa, Mahidevran lived a trouble life. She went to Bursa, where her son Mustafa is buried. She was the last concubine who went to Bursa. She could not to pay the rent of the house she lived in, and her servants were mocked and cheated in the local markets. Suleiman's childhoob friend Yahya Efendhi request Mahidevran to back the palace. She asked Yahya to intercede on her behalf. Suleiman's considered Yahya request to be insolent, causing him to be dismissed from his teaching position. Mahidevran's situation improved when Sultan Selim II ascended the throne in 1566. She died in 3 February 1581, after the death of Suleiman and his all childrens. She was buried in Mustafa's tomb. == In literature and popular culture == * Mahidevran is a character in a historical novel Hurrem Sultan (1937) by M. Turhan Tan's. * Hatice Aslan played Mahidevran in the TV series, Hürrem Sultan (2003). * Nur Fettahoğlu played Mahidevran in the TV series, Muhteşem yüzyil (2011-2014). * Mahidevran is the main character in a historical novel Mahidevran Sultan (2012) by Kemalettin Çalik. == See also == * Suleiman the Magnificent * Hurrem Sultan * Selim I * Selim II == References == Category:1500s births Category:1581 deaths Category:Consorts of Ottoman sultans Category:Suleiman the Magnificent Category:16th-century slaves from the Ottoman Empire Category:Concubines of Ottoman sultans",
 "title": "Mahidevran"
}