{
 "id": "1128399",
 "text": "Full-body workout is a type of exercise workout routine where the entire body is targeted in a single session. It is the opposite of a split workout routine, also known as split weight training, or split routine, where different muscle groups are targeted on separate days. ==History== During the Bronze Era of bodybuilding, traditionally dated from the late 19th century to the end of the 1930s, bodybuilders favored full-body routines, working out multiple muscle groups in a single session. Workouts were also done multiple times a week, emphasizing compound movements.https://fitnesslifeabc.com/bronze-era-bodybuilding The bodybuilder Eugen Sandow (1867-1925) emphasised full-body workouts, progressive overload, and simple dietary choices.https://steelsupplements.com/blogs/steel- blog/eugen-sandows-real-workout-routine-amp-diet- planhttps://fitnessvolt.com/eugen-sandow- workout/https://www.drworkout.fitness/eugen-sandow-workout-and-diet/ Back in the 1950’s and 1960’s, full body workouts were the normal way to train, and bodybuilders such as John Grimek (1940-41 Mr. America), Steve Reeves (Mr. America of 1947, Mr. World of 1948, and Mr. Universe of 1950), George Eiferman (Mr. America of 1948, and Mr. Universe of 1962), Armand Tanny, Reg Park (Mr. Universe of 1951, 1958, and 1965), and Leroy Colbert (Mr. Eastern America of 1953), normally trained the whole body during their workouts.https://gymtalk.com/george-eiferman-full-body- workout/https://oldschooltrainer.com/practical-full-body- training/https://www.hdfitnessbc.com/news/workoutsfromlegendshttps://www.spcfitz.com/full- body-workouts-leroy-colbert/ Similar to Reeves and Eiferman, Vince Gironda favoured a full-body workout.https://oldschooltrainer.com/practical-full-body- training/ ==Advantages== Regarding the advantages of exercising the entire body in a single session, Steve Reeves stated, \"When you work your whole body in each workout, it forces you to think about symmetry. Your focus is always on the whole and not the parts\". ==References== Category:Training",
 "title": "Full-body workout"
}