{
 "id": "1128297",
 "text": "\"Die with a Smile\" is a song recorded by American singers Lady Gaga and Bruno Mars. It was released on August 16, 2024. This was the first release for Gaga in two years and for Mars in three years, since his work as part of Silk Sonic with Anderson .Paak. The artists wrote and produced the song with D'Mile and Watt with additional writing from James Fauntleroy. Gaga teased the song by posting a video of her wearing a Bruno Mars shirt and playing piano. Mars similarly posted a photo of himself in a Born This Way-era Gaga shirt. The ballad speaks of living happily with a love interest. The song reached number one on the iTunes charts in 37 countries on its first day. \"Die with a Smile\" became Gaga's eighth chart-topper on Billboards Pop Airplay chart and Mars' tenth on that chart. It was also one of the longest-running number-one songs on the Spotify global chart in 2024. The song reached number one in over 20 countries, and the top ten in several other countries, including the UK, Australia, and Canada. For multiple weeks in December 2024, it was the highest-ranking non-holiday song on the Billboard Hot 100 in the US. For the week ending January 11, 2025, the song finally topped the US Hot 100 after four weeks at number two, becoming Gaga's sixth US number-one and Mars' ninth. Gaga became the third artist in history to have multiple number-ones in three decades (\"Just Dance\" and \"Poker Face\": 2000s, \"Born This Way\" and \"Shallow\": 2010s, \"Rain on Me\" and \"Die with a Smile\": 2020s). The only other artists to achieve this are Michael and Janet Jackson. Additionally, it became Gaga's seventh Canadian chart-topper. In an Instagram Reel thanking fans for her sixth US number-one and tied record with the Jackson siblings, Gaga confirmed the song is part of the track listing for her upcoming eighth studio album, Mayhem (2025). The song won the Grammy Award for Best Pop Duo/Group Performance at the 67th Grammy Awards on February 2, 2025. This is Gaga's 14th and Mars' 16th Grammy win. \"Die with a Smile\" became the first song to ever spend over 200 days at number one on the Global Spotify chart and has passed two billion streams on Spotify alone. == Charts == Weekly chart performance for \"Die with a Smile\" Chart (2024–25) Peak Bulgaria 1 US Pop Airplay (Billboard) 1 Year-end chart performance for \"Die with a Smile\" Chart (2024) Rank Canada (Canadian Hot 100) 57 UK Singles (OCC) 37 US Billboard Hot 100 62 US Adult Contemporary (Billboard) 25 US Adult Pop Airplay (Billboard) 48 == Awards and nominations == Awards and nominations for \"Die with a Smile\" Year Ceremony Award Result 2025 67th Grammy Awards Best Pop Duo/Group Performance Song of the Year == References == Category:2024 songs Category:Lady Gaga songs Category:Bruno Mars songs Category:Soft rock songs Category:Grammy Award-winning songs",
 "title": "Die with a Smile"
}