{
 "id": "112803",
 "text": "Mouse-like hamsters are a group of small rodents found in Syria, Azerbaijan, Iran, Turkmenistan, Afghanistan, and Pakistan. They are found in rocky and slightly high areas in desert regions. The mouse-like hamsters are not real hamsters, although they look like hamsters. They were once thought to be hamsters based on the shape of their teeth, but they do not have the cheek pouches, and short tail of the true hamsters. All animals in this genus were part of the same species before, Calomyscus bailwardi, but they are now separate species because they have big differences in chromosome number, skull length and weight, and other differences. In Europe, species of Calomyscus can be kept as a pet. They are called Calomyscus bailwardi mystax or Calomyscus bailwardi. Only special people sell them, not pet shops. And so only people who really like mice will buy them. Mouse-like hamsters live the longest of all the mouse species. They have been recorded as living 9 years, 3 months and 18 days in captivity. They regularly live over 4 years in captivity. The species which lives the second longest in the muroids lives 7 years, 8 months, which is the Canyon Mouse, Peromyscus crinitus. == Species == *Calomyscus bailwardi - Zagros Mountains mouse-like hamster from Iran *Calomyscus baluchi - Pakistan mouse-like hamster from Pakistan and Afghanistan *Calomyscus elburzensis Goodman's mouse-like hamster from northeastern Iran and southern Turkmenistan **Subspecies Calomyscus elburzensis zykovi Zykov's mouse-like hamster from southeastern Turkmenistan *Calomyscus grandis - Noble mouse-like hamster from near Teheran *Calomyscus hotsoni Hotson's mouse-like hamster from southern Pakistan *Calomyscus mystax Great Balkhan mouse-like hamster from Turkmenistan *Calomyscus tsolovi Syrian mouse-like hamster from Syria *Calomyscus urartensis Urar mouse-like hamster from Azerbaijan and northwestern Iran == References == *Jansa, S. A. and M. Weksler. 2004. Phylogeny of muroid rodents: relationships within and among major lineages as determined by IRBP gene sequences. Molecular Phylogenetics and Evolution, 31:256-276. *Michaux, J., A. Reyes, and F. Catzeflis. 2001. Evolutionary history of the most speciose mammals: molecular phylogeny of muroid rodents. Molecular Biology and Evolution, 17:280-293. *Musser, G. G. and M. D. Carleton. 2005. Superfamily Muroidea. Pp. 894-1531 in Mammal Species of the World a Taxonomic and Geographic Reference. D. E. Wilson and D. M. Reeder eds. Johns Hopkins University Press, Baltimore. *Steppan, S. J., R. A. Adkins, and J. Anderson. 2004. Phylogeny and divergence date estimates of rapid radiations in muroid rodents based on multiple nuclear genes. Systematic Biology, 53:533-553. *Volf, J. 2003. Rekord dlouhovekosti kreckovitych savcu (Cricetidae). Gazella 30:69-72. == Other websites == * Animal Diversity Web: Detailed description * Photos of the Turkmen Mouse-like hamster (German page) Category:Rodents",
 "title": "Mouse-like hamsters"
}