{
 "id": "1128386",
 "text": "The Concordat of Worms was an agreement made on September 23, 1122, between Pope Callixtus II and Holy Roman Emperor Henry V. This agreement ended a long conflict called the Investiture Controversy. The conflict was about who had the right to appoint church officials like bishops and abbots. The Concordat of Worms helped to clearly separate the powers of the church and the state. == Historical Background == === Investiture Controversy === The Investiture Controversy started in the 11th century. It was about whether kings and emperors (secular leaders) or the Pope (church leader) had the right to appoint church officials. The church wanted to stop secular leaders from appointing bishops and abbots because they believed only the church should have that power. The conflict became very serious during the time of Pope Gregory VII and Emperor Henry IV. Gregory VII even excommunicated Henry IV, which means he kicked him out of the church. Henry IV later had to ask for forgiveness. The problem continued with Henry V, Henry IV’s son. === Making the Concordat === Both Pope Callixtus II and Emperor Henry V wanted to solve this problem. They talked and agreed on the Concordat of Worms to find a solution that both sides could accept. == Terms of the Concordat == === Separation of Powers === The Concordat of Worms decided that the church and state would have different roles in appointing bishops and abbots: # Spiritual Power: Only the Pope and the church could give bishops and abbots their religious authority, shown by giving them a ring and a staff (symbols of their spiritual office). # Temporal Power: The Emperor could give bishops and abbots their land and secular (non-religious) power, shown by giving them a sceptre (a symbol of temporal power). === Election of Bishops and Abbots === The Concordat also said that bishops and abbots should be chosen by church officials, not by the emperor. However, the emperor could still be present at the election and had some say in granting them their lands and properties. == Importance == === End of the Investiture Controversy === The Concordat of Worms ended the Investiture Controversy by making a compromise. It was a win for the church because it confirmed that only the church had the authority to appoint church leaders. The emperor still had a role in the secular aspects of these appointments. === Influence on Church and State Relations === The Concordat set a precedent for how the church and state would interact in the future. It established that spiritual and secular powers should be separate and that the church should handle its own matters without interference from secular rulers. === Long-term Effects === By resolving the Investiture Controversy, the Concordat of Worms brought more stability to the Holy Roman Empire and the Christian world. It helped to strengthen the authority of the Pope and led to a more organized church structure. == Related pages == * Investiture Controversy * Pope Gregory VII * Holy Roman Empire == References == # \"Concordat of Worms.\" Encyclopedia Britannica. # \"The Investiture Controversy and the Concordat of Worms.\" Catholic Encyclopedia. # \"The Medieval Papacy and the Concordat of Worms.\" History Extra. # \"Papal Authority and the Concordat of Worms.\" The Oxford Handbook of Medieval Christianity. # \"The Holy Roman Empire and the Church: The Concordat of Worms.\" Metropolitan Museum of Art. Category:1100s Category:Christianity of the Middle Ages",
 "title": "Concordat of Worms"
}