{
 "id": "1128859",
 "text": "Chenab Valley is a loosely-defined contentious term sometimes used to refer to parts of the Jammu Division of Jammu and Kashmir, India. The term is used to describe the present-day districts of Doda, Kishtwar, and Ramban, and at times Reasi and parts of Udhampur and Kathua. The first three districts were originally part of a single district called Doda, which was created in 1948 from the eastern parts of Udhampur district in the princely state of Jammu and Kashmir. These districts are sometimes collectively referred to as the Doda belt. The term is seen to be aimed at a communal break-up of the Jammu Division and iteration of Kashmiri Muslim irredentism. ==Name== The name derives from the Chenab river, which flows through and forms the valley. The term \"Chenab Valley\" was used by Erik Norin in a 1926 journal article \"The Relief Chronology of Chenab Valley\", to refer to the valley formed by the Chenab river in the Himalayas. More recently, this term has also come to be used by various social activists and politicians referring to the areas of the former Doda district formed in 1948. The term is used by many residents of Doda, Ramban, Kishtwar districts to assert a distinct cultural identity within the larger Jammu division. ==Geography== The Chenab Valley lies between the middle and great Himalayan range in the Jammu region of Jammu and Kashmir, India. It constitutes parts of the Doda, Ramban, and Kishtwar districts of Jammu and Kashmir. The area is an active seismic zone.\"Chenab valley quakes not due to hydro projects: Scientists\" ==History== In the past, the area around Doda was largely inhabited by Sarazi population before people started settling here from the Kashmir valley and other adjoining areas. The reasons for this migration in the 17th and 18th centuries are a matter of ambiguity among historians. Sumantra Bose says that repression by the feudal class in the Kashmir valley drew people to these areas. The three districts consist of areas drawn from the principalities of Kishtwar and Bhadarwah, both of which were part of Udhampur district in the princely state of Jammu and Kashmir. In addition, Paddar used to be part of Chamba State in the past and was later added to the princely state. Kashmiris form the largest group in the three districts while Gujjars, Dogras, Paharis and Bhaderwahis have significant population. Chenab Valley is rich in cultural heritage and ethical values, but also has age-old traditions of secularism and tolerance. This region in Jammu and Kashmir has a long history intertwined with legends and stories of various rulers and dynasties. According to records from the State Revenue Department, the erstwhile district Doda got its name from its headquarters in Doda, which was named after a migrant from Multan, a utensil maker. He was persuaded by one of the ancient rulers of Kishtwar to settle in the area and establish a utensil factory. Over time, the name Deeda was distorted into Doda. The early history of Chenab Valley is not well documented, with few chronicles available about the rulers of Kishtwar and Bhaderwah. The settlement reports indicate that the area was ruled by various groups including Ranas, Rajas, and independent chiefs from time to time, including the Jaral Ramas, Katoch Rajas, Bhaus Manhases, Chibs, Thakkars, Wanis, and Gakkars. In 1822 AD, Doda was conquered by Maharaja Gulab Singh and became the winter capital of the Kishtwar state. Despite their geographical proximity, the Chenab Valley's history diverged from that of Jammu and Kashmir. While the latter served as a historical crossroads and witnessed the rise of the Dogra dynasty, the Chenab Valley, nestled in the Himalayas, maintained a relative degree of independence. Though communities like the Saraji and Gujjars inhabited the valley and contributed to its unique cultural tapestry, it remained outside Dogra control until the 19th century, eventually becoming part of their expanding kingdom. The Fort of Doda was significant in the district's history and was one of the seventy forts in Jammu province, according to author Thakur Kahan Singh Balowria. The fort served as the office of the Thanedar and provided storage space for armaments and food grains. The fort was also built to protect against potential attacks from the Bhaderwah Rajas. The fort was made of unbaked bricks and had walls that were four feet wide and forty to fifty feet high, with dome-like towers at the corners. The fort was demolished in 1952 and as of 2023, the Government Boys Higher Secondary School Doda occupies its site. English traveller G.T. Vigne visited Doda in 1829 and described his journey through the region. He mentions traveling through a deep and rocky nullah which joins the Chenab River, and then crossing the river over a dangerous bridge in the Himalayas. Vigne writes about the bridge in Doda, a strong rope stretched from one bank to the other, tied to rocks. A wooden structure was placed over the rope and additional ropes were tied to it, allowing the structure to move back and forth. He also encountered another type of bridge, which was crossed on foot, made of small ropes bound with pieces of bark and woven into a thick rope. Hanging ropes were provided for support. The area that includes the tehsil of Bhaderwah has a long history dating back to the 10th century. In 1846, Doda and Kishtwar became part of the newly created Jammu and Kashmir state after the Amritsar pact between the British government, Lahore Darbar, and Raja Gulab Singh of Jammu. Bhaderwah was once a principality with 15 administrative units and has a recorded history going back to the Rajtarangni of Kalhan. The state of Bhadhrwah was established in the 15th century by a Sicon of the Baloria family of Bilawar. It was later ruled by the Raja of Chamb until Raja Nagpal became the ruler in the 16th century. Bhaderwah was then ruled by Nagpal's descendants until it was captured by the Kishtwar Raja. It became part of Chamba in 1821 and was transferred to Jammu Darbar in 1846. During this time, Bhaderwah was military- administered Label was appointed as the Kardar. The Bhaderwah Jagir was later bestowed upon Raja Amar Singh of Jammu and then to his son, Raja Hari Singh. When Raja Hari Singh became the Maharaja of J&K; in 1925, he dissolved his Jagirs and converted Bhaderwah into a tehsil of Udhampur in 1931. In 1948, the erstwhile Udhampur district was partitioned into the present Udhampur district, containing the Udhampur and Ramanagar tehsils, and Doda district containing the Ramban, Bhadarwah, Doda, Thathri and Kishtwar tehsils. From 1975 to 1976, the Government of India conducted the Preinvestment Survey of Forest Resources specifically in the Chenab Valley by Department of Agriculture. During this period, a detailed survey of forests in the Chenab Catchment area was done in Doda, Bhaderwah, Kishtwar, and Ramban divisions of the forest. In 1990s, various incidents were reported about the suppression of Hindus by the Militant organizations. In response to the rising terrorism, the government authorities made Village Defense Committee (VDC) in various villages. However some reports of VDC members indulging in criminal activities have also reported in the past. In a village called Karada, four Muslims were allegedly killed by VDC members. This incident also triggered the Terrorist organisations to target those who supported the VDCs, believing them to be anti-Muslim. Since 1990s, many such incidents of killings by Terrorist and VDCs have been reported. census, the total population of Chenab Valley stood at 690,474, with 362,471 males and 328,003 females. Among the tehsils within the district, Kishtwar had the highest population, totaling 1.9 lakhs, while Thathri tehsil had the lowest population, with 0.42 lakhs. Doda ranked as the second most populous tehsil within the district, with a population of 1.5 lakhs, followed by Banihal at 0.94 lakhs, Bhadarwah at 0.61 lakhs, Ramban at 0.86 lakhs, and Gundoh at 0.58 lakhs. The hilly and challenging terrain of the region contributed to a low population density of only 59 people per square kilometer. In 2006, Ramban was made into an independent district and the hilly area to the east of the present Doda district was separated as the Kishtwar district. The remaining areas include the Doda tehsil carved out of Kishtwar and the original Bhadarwah, now divided into three tehsils. ==Economy== The economy of Chenab Valley is influenced by its challenging topography and limited access to raw materials, technical expertise, and skilled labor. Data from the District Industries Center (DIC) in 1999-2000 indicates a limited industrial presence with only three registered factories and 43 formally registered small industries (SSI) units, along with 81 provisionally registered ones. The Khadi and Village Industries Board Doda established 69 cooperative societies and 2,190 units, providing employment to 4,380 workers during the same year. The district also hosts four industrial training institutes, offering training in various trades with an intake capacity of 497 students in 1999-2000. Chenab Valley is endowed with vast forest resources, covering approximately 6,226 square kilometers, which accounts for 28% of the state's total area. These forests yield valuable timber varieties such as deodar, fir, kail, chir, and products like doop, resin, and guchhian. The region's topography and agroclimatic conditions make it highly suitable for goat and sheep rearing, benefiting about 65% of the rural population. According to the 1997 census, there were 3.91 lakh sheep and 1.51 lakh goats. Presently, there are 98 sheep extension centers and two mobile sheep centers, along with 160 sheep units under Centrally Sponsored Schemes. Agriculture and horticulture constitute the primary economic activities in Chenab Valley, complemented by the cultivation of commercial cash crops like saffron in Kishtwar, zeera in Paddcr, and Marsheela (Guchhi) in the coniferous areas of Bhaderwah, Doda, and Gandoh. The district's climate also supports sericulture, particularly in Bhaderwah. Livestock farming plays a pivotal role in the economic development of Chenab Valley, with a livestock population of 797,779 as per the 1997 census, encompassing cattle, buffaloes, and poultry birds. During leisure time, people engage in various handicrafts, including the production of lois, blankets, and woolen cloth (puttos). The government is taking steps to promote this sector alongside overall development efforts, including education, healthcare, and road construction. ==Demographics== ===Religion=== Muslims form a majority in the three districts constituting Chenab Valley. About 60% of the population was Muslim according to the 2011 census, and the rest 40% are mostly Hindus. ===Languages=== Chenab Valley is home to a variety of ethnic groups. Officially, Urdu and English are used, but the Chenab Valley is home to a variety of languages, including Kashmiri—spoken by almost half of the population, Gojri, Kishtwari, Bhaderwahi, Sarazi, Dogri, Rambani, Pogali, Pahari, Bhalessi, and Padri. ==Notes== ==References== ==Bibliography== * * * Category:Jammu and Kashmir",
 "title": "Chenab Valley"
}