{
 "id": "1128165",
 "text": "The 2023 Jabalia massacre () happened on 9 October 2023. On the third day of the Battle of Al-Aqsa Flood, the Israeli Air Force bombed the commercial area in the middle of Jabalia refugee camp in the northern Gaza Strip. This bombing was concentrated on a densely populated area, and at least 50 Palestinians were killed, mostly civilians. In response, the Palestinian factions active in the Gaza Strip launched dozens of rocket strikes towards the towns next to the Strip. They also targeted other cities, including Tel Aviv, with more distant barrages. Israel evacuated most of the residents from the border areas and pushed the rest of them into shelters. In addition, Israel's Iron Dome air defense system stopped most of Gaza's rockets. As a result, no Israelis died in the bombings. == Background == Also see: 2023 Hamas attack on Israel Hamas (through its military wing the Qassam Brigades) and other factions in the Gaza Strip launched an attack on Israel in the early morning hours of 7 October 2023. Muhammad Deif, the commander-in-chief of the Al-Qassam Brigades, launched this operation. It was called the Battle of the Flood of Al-Aqsa. This name referred to Al-Aqsa Mosque and its relationship to settlemen, and oppression of the Palestinians. During this attack, the Qassam fighters stormed dozens of Israeli towns and settlements near the Gaza Strip. After they battled the Israeli army, the Qassam fighters marched dozens of kilometers beyond the Gaza Strip's borders. In response, Israel further increased its forces in the southern region and used helicopters, dogs, and heavy weapons to confront the resistance fighters and force them to withdraw. == The massacre at Jabalia Camp == Also see: Jabalia refugee camp The Israel Air Force launched repeated air raids on sites south and east of Gaza City, starting at 10:45am in the morning. The most violent bombing hit a popular market in the city of Jabalia shortly after 12:00 at night; the sounds of the explosions were heard from great distances. It was clear that the bombing would leave a large number of victims because it was so intense, and because the bombings targeted a large and lively popular market. Videos broadcast in the minutes after the bombing showed massive destruction, with two large houses completely collapsed, and later videos documented bodies scattered in the street, people trapped under the rubble, and injured people everywhere. === 12 October === On 12 October, a second airstrike hit a residential building in Jabalia camp, destroying several apartments and killing people from two families. The Interior Ministry in Gaza reported that 45 people were killed and at least four others were injured. Some of these victims were taking refuge in the area after they were displaced from Beit Hanoun. === 19 October === On 19 October, the Jabalia camp was hit by a third airstrike, killing 18 refugees. === 22 October === On 22 October, during the intense bombing of Gaza, the Israeli armed forces bombed the Jabalia camp for the fourth time. Several houses were hit and at least 30 bodies were pulled from the rubble. === 31 October === Israeli dropped 6 bombs on a residential neighborhood in Jabalia camp, which led to the deaths of more than 400 Palestinians. == Palestinian response == The resistance factions responded to the Jabalia massacre by shooting about 120 missiles towards the Israeli towns of Ashdod and Ashkelon. Israel's Iron Dome system was able to intercept most of these missiles, but not all of them. Four Israelis were wounded, one critically. == Victims == More than 50 people were killed in the Jabalia airstrikes, most of them civilians, and dozens were wounded. A video clip filmed by a Palestinian in Jabalia showed how the bombing had damaged an ambulance and its surroundings. == References == Category:Refugee camps in the Gaza Strip Category:Gaza Strip Category:Arab–Israeli conflict Category:Gaza–Israel conflict Category:Israel–Palestine conflict",
 "title": "2023 Jabalia refugee camp airstrikes"
}