{
 "id": "1128592",
 "text": "The Happy Merchant is an antisemitic caricature of a Jewish man and an internet meme, which is used as a racist hate symbol especially on various website on the internet. The image often appears on websites such as 4chan or Reddit, where it is often used in hateful and derogatory anti-Semitic contexts. == History == The image was first created by cartoonist A. Wyatt Mann – a pun on \"A White Man\" – a pseudonym of Nick Bougas. The image was part of a cartoon that also included a racist caricature of a Black man, using this imagery to say, \"Let's face it! A world without Jews and blacks would be like a world without rats and cockroaches.\" The cartoon was first published in print, but appeared on the Internet in February 2001. This stereotypical caricature spread to various online communities, where users began to create variations. The \"Happy Merchant\" meme supports the antisemitic libel that Jews are \"secretly planning to take over the world\". Perry, Marvin., and Frederick M. Schweitzer.Antisemitic Myths: a Historical and Contemporary Anthology. Bloomington, IN: Indiana University Press, 2008. == Description == The image is intended as a derogatory representation and uses many stereotypes about Jews. These include: * A large, hooked-shaped nose (\"Jewish nose\") * A kippah (Jewish head covering) * An evil smile, a slightly hunched back and hands rubbed together to indicate greed or intrigue * A bald head, thick curly black hair and a thick curly black beard == Use == This image is a form of antisemitic propaganda that is widely circulated in alt-right online communities such as 4chan, other \"chan\" websites, and other websites such as Reddit or Gab. \"Happy Merchant\" has also been incorporated into other common Internet memes, including \"Pepe the Frog\", an originally nonpolitical caricature of a frog, which is often used by the alt-right for racist purposes. In 2017, the Qatari international television news channel Al Jazeera tweeted an image of the \"Happy Merchant\" on its official English-language Twitter account. The tweet promoted a story about climate change and implied that Jews are behind climate change. Al Jazeera later deleted the tweet, saying it had been used in a segment discussing anti-Semitic alt-right conspiracy theories about climate change. == References == === Notes === === Bibliography === * == Other websites == * Happy Merchant entry at Know Your Meme Category:Internet memes Category:Antisemitism Category:Fictional characters introduced in 2001",
 "title": "Happy Merchant"
}