{
 "id": "1128926",
 "text": "Princess Bajrakitiyabha, the Princess Rajasarini Siribajra (, , also known as Princess Bha or Patty, born 7 December 1978) is a Thai princess, lawyer and politician. She is the first grandchild of King Bhumibol Adulyadej and Queen Sirikit of Thailand. She is the only one of the seven children of King Vajiralongkorn born to his first wife Princess Soamsawali. Since December 2022, Bajrakitiyabha has been in a coma after collapsing due to a heart condition. ==Early life== Bajrakitiyabha was born on 7 December 1978 at Dusit Palace in Bangkok. She is the oldest child and first daughter of Vajiralongkorn and his first wife princess Soamsawali. She got her LL.B. degree from Thammasat University, as well as a B.A. degree in International Relations from Sukhothai Thammatirat University, both in 2000. She later got a LL.M. degree from Cornell Law School in 2002 and a J.S.D. degree from Cornell University in 2005.CURRICULUM VITAE Her Royal Highness Princess Bajrakitiyabha Mahidol of Thailand- website Thailand Institute of Justice ==Career== In 2002, Bajrakitiyabha was a summer legal intern at a law firm in Washington, D.C.. For a short time, she worked at the Thai Permanent Mission to the United Nations, in New York City. In September 2006, she was hired as a lawyer in the Office of the Attorney General in Bangkok. From 2012 to 2014, she was the Thai ambassador to Austria. On 3 February 2021, she became the Chief of Staff of The King's Close Bodyguard Command and was promoted to general. Until December 2022 due to her medical condition, Bajrakitiyabha was seen as the next in line to the throne. ==Health== In December 2022, Bajrakitiyabha was hospitalized in Bangkok while walking her dogs. She collapsed because of her heart condition. She was taken to two hospitals after the medical episode. She remains in a coma with no information on any possible recovery. ==References== ==Other websites== * The Friend in need of \"PA\"'s website * Kamlangjai Project website * The Children's Foundation, Phramongkutklao Hospital's website * \"ELFI\" project * Na Bha Foundation under HRH Princess Bajrakitiyabha's website * Website, Office of the Attorney General, Thailand Category:1978 births Category:Living people Category:Princes and princesses Category:Thai businesspeople Category:Thai politicians Category:Asian diplomats Category:Ambassadors Category:Thai lawyers Category:People from Bangkok Category:Thai royalty",
 "title": "Bajrakitiyabha"
}