{
 "id": "1128314",
 "text": "Karauli State was a princely state in the north eastern edge of modern day Rajasthan, India from 1348 to 1949. It is located in the cultural Braj region. Karauli city was the capital while Mandrayal or Mandrail was another important town. The present and 43rd king since 1984, Maharaja Krishna Chandra Pal Deo Bahadur of Karauli is the descendant of Raja Bijay Pal ji, the 88th descendant of Lord Krishna who originated from the Yaduvanshi Rajput kingdom of Mathura. ==History (Origin)== The rulers of Karauli belonged to the Jadaun clan of Rajputs belonging to the Yaduvanshi branch of the Chandravanshi (Lunar) descent. The Yaduvanshi Rajputs of Karauli are believed to be the real and direct descendants of Lord Krishna. The founder of the dynasty was Raja Vijaypal who came from Mathura and founded the fort of Bayana in 1040. Vijaypal also came into conflict with the Ghaznavid tribes during his reign. Raja Timanpal (r.1093-1159) was an important ruler of the dynasty, he extended his domain by conquering the territories of modern day Dang, Alwar, Bharatpur, Dholpur, Gurgaon, Mathura, Agra and Gwalior. Raja Arjunpal founded Karauli in the year 1348. Sultan Mahmud Khilji of the Malwa Sultanate invaded and captured Karauli in 1454 which led the kingdom into a decline. The rulers of Karauli shifted to Untagarh and ruled a small territory. During Mughal Emperor Akbar's reign Raja Gopaldas of Karauli got back his ancestral capital of Karauli. ===British era=== For his loyalty to the British Empire, Madan Pal was made a Grand Commander of the Order of the Star of India. The salute of honour, to which the Chiefs of Karauli were entitled, was also enhanced from 15 to 17 in appreciation of the loyal services of Raja Madan Pal, who was also decorated with a rich dress of honour. The state under Maharaja Ganesh Pal Dev acceded to the Dominion of India on 4 August 1947.\"Instrument of Accession of Karauli State (Rajputana)\". Karauli State- Instrument of Accession and Standstill Agreement signed between H.H. Maharaja Ganesh Pal Deo Bahadur Yadukul Chandra Bhal, Ruler of Karauli State and the Dominion of India. New Delhi: States Department, Government of India. 1947. pp. 2–3, 5. Retrieved 31 January 2023-- via National Archives of India. Karauli later merged with the Union of India and became part of the state of Rajasthan. == Present Scenario == Yuvraj Vivasvatpal Jadaun is the current prince of Karauli, India. He is the son of HH Maharaja shri krishna Chandra Pal Deo Bahadur Yadakul Chandra Bhal and HH Maharani Rohini Kumari. The Janaeu Ceremony of Yuvraj Vivasvatpal Karauli, was held at Bhanwar Vilas Palace where the royal family invited thousands of guests from all parts of the country and local villages as they are the head of the Yaduvanshi clan of the Rajputs, the descendant of Raja Bijay Pal ji, the 88th descendant of Lord Krishna who originated from the Yaduvanshi kingdom of Mathura. They trace their lineage to Lord Krishna and claim to have all the proofs for their claim. ==References== Category:Indian princely states",
 "title": "Karauli Princely State"
}