{
 "id": "1128797",
 "text": "Canning is a way to make food last longer. It involves sealing processed food into a container so no air can get in. Canning can make food last at least a year, sometimes much longer. A freeze-dried canned product, such as canned dried lentils, could last as long as 30 years and still be safe to be eaten. In 1974, the National Food Processors Association tested canned food from a sunken ship called the Bertrand, a steamboat that sank in the Missouri River in 1865. Although it looked and smelled different, and had a different amount of vitamins, there were no signs of microbial growth in the 109-year-old canned foods, and they were determined to be safe to eat. == Methods == Originally, glass containers were used for canning. However, these were heavy, easily breakable, and hard to transport. In 1818, Peter Durand introduced the tin can into the United States. After this, glass jars were mostly replaced with cylindrical tin or iron canisters (later shortened to \"cans\"). Cans are cheaper, quicker to make, and not as breakable as glass jars. Can openers were not invented for another thirty years. At first, soldiers would cut the cans open with bayonets or smash them open with rocks. Today, tin-coated steel is the most commonly used material. Aseptically processed retort pouches are also used. Glass jars are still used for some expensive products and in home canning. === Microbial control === There are several ways to prevent food from being spoiled, either before or during canning. Sterilization is the only method which is completely dependable as a preservative. Sterilization is done after the can is sealed, so that both the container and the food are secured. Boiling, heating using a flame, and Pasteurization (heating the food to kill most harmful microbes) are forms of heat sterilization. Refrigeration, freezing, and drying food can also prevent some spoiling. Commercial canners may use vacuums, ionizing radiation, chemical baths, or other methods for food preservation. === Botulism === Special measures are needed to make sure canned foods do not contain Clostridium botulinum (a type of bacteria which causes botulism). Some foods are too acidic to let the bacteria grow. These foods can safely be canned and sterilized with boiling water. Fruits, pickled vegetables, and foods with added acid fall into this category. However, to protect less acidic foods, a pressure canner (similar to a pressure cooker) is needed to reach temperatures high enough to kill the bacteria. Ordinary boiling temperatures do not kill botulism spores; sterilizing these foods requires high temperatures (116–130 °C). Most vegetables, meat, seafood, poultry, and dairy products need to be pressure canned to ensure they are safe from C. botulinum. == References == Category:Food preservation",
 "title": "Canning"
}