{
 "id": "1128173",
 "text": "right|thumb|200x200px| The body of a person killed in the home of 'Abd al- Hafez Hamad. Six members of one family were killed when their house was bombed on the night of 8 July 2014, see Hamad family home Beit Hanoun () is a town in the northeastern Gaza Strip, with a population of about 32,187 people. It is located within the areas of the Palestinian National Authority and is about 6 kilometers away from the Sderot settlement located within the lands of 1948. Projected Mid -Year Population for North Gaza Governorate by Locality 2004– 2006 الجهاز المركزي للإحصاء الفلسطيني http://www.pcbs.gov.ps/Portals/_pcbs/populati/pop12.aspx == History == Beit Hanoun is an ancient village that had a house for the worship of gods and idols. It was founded by a pagan king, King Hanoun. It was his summer resort. Long wars took place between him and King Jaffa until they killed each other. They made a statue for him according to their customs as a memorial to their great ones and placed it in the house of worship. The village became famous as Beit Hanoun. It was mentioned in the history of Beersheba in the year 720 BC. Sargon marched with his armies to southern Palestine and subdued the Philistines. Its people converted to Islam since the Islamic conquest. === British Mandate era === In the 1922 census of Palestine conducted by the British Mandate authorities, Beit Hanoun had a population of 885 inhabitants, all Muslim, decreasing in the 1931 census to 849, still all Muslims, in 194 houses. In the 1945 statistics, Beit Hanun had a population of 1,680 Muslims and 50 Jews, with 20,025 dunams of land, according to an official land and population survey. Quoted in Of this, 2,768 dunams were for citrus and bananas, 697 were plantations and irrigable land, 13,186 used for cereals, Quoted in while 59 dunams were built-up land. Quoted in === Israeli occupation === According to the Palestinian Authority, 140 Palestinians were killed by Israeli forces in Beit Hanoun from September 2000 to November 2006. == War == Because of the town's location, Palestinian factions have become accustomed to using the lands adjacent to Beit Hanoun to launch their locally- made rockets, such as Qassam rockets. The town of Beit Hanoun was subjected to a great deal of destruction at the hands of the during the years of the Second Intifada, as the Israeli army invaded the town many times, in addition to bulldozing large areas of its agricultural land and repeatedly bombing the area. One of the most famous of these bombings was the bombing carried out by Israeli artillery on 8 November 2006, which caused a massacre in which 19 civilians were killed (13 of whom were from the same family) and 40 people were wounded. Israel, claimed that the bombing came in response to Palestinian rocket fire from the area, and that civilian casualties occurred as a result of an error in the artillery guidance system. The United Nations set up a fact-finding mission headed by Desmond Tutu, but Israel refused to allow the mission members to come and the investigation was cancelled. == Educational and health institutions == There were twelve secondary, primary and agricultural schools in Beit Hanoun and an agricultural college which is related to al-Azhar University - Gaza. There was a medical center and hospital in the city and several clinics mostly managed by the United Nations. All have been rendered unusable or destroyed during the 2023 Israel-Hamas war. As of mid-December 2023, as a result of the 2023 Israel-Hamas War, Beit Hanoun has been entirely depopulated, and virtually all its structures either destroyed or rendered unusable due to extreme damage. == Economy == === Agriculture === Beit Hanoun is an agricultural city, as most of its residents depend on agriculture and farming to earn their living. The most famous thing that distinguishes the city is the cultivation of citrus fruits and vegetables, which provide the city and the surrounding areas with the fresh vegetables they need. The area allocated for agriculture constitutes 45% of the total area of the city. But the city has become barren as a result of the ongoing aggression carried out by the Israeli military, as it bulldozed 7,500 acres of the city’s lands during the current uprising, all of which are agricultural lands. === Industry === There is an industrial zone in the city covering an area of 261 acres. This zone contains a number of factories and light workshops and employs approximately 200 workers. The most important industries in this zone are (concrete industry - tiles - fabrics - plastics - medicines and cosmetics). There are also many private blacksmith and carpentry workshops in the city. These are simple workshops that carry out daily work and do not operate outside the city. == Environmental situation == Beit Hanoun city suffers from multiple environmental problems: * Urban renaissance in the city resulting in the accumulation of construction waste. * Accumulation of waste from destroyed homes, and waste resulting from the excavation of lands, facilities, farms, and cars. * The presence of old abandoned waste dumps that have not been treated and disposed of. * Incomplete sewage network in some areas and neighborhoods. * Lack of land area in industrial areas and congestion in this area. * High nitrate levels in drinking water. * The temperature has risen by 4 degrees above normal due to the encroachment on trees, and random and unorganized construction. Therefore, the city needs to reforest the land and support projects that focus on establishing public gardens and parks and planting trees on streets and roads. == References == == Other websites == * Welcome To The City of Bayt Hanun * Survey of Western Palestine, Map 19: IAA, Category:Coordinates on Wikidata Category:Pages using gadget WikiMiniAtlas Category:Articles containing Arabic-language text Category:Gaza Strip",
 "title": "Beit Hanoun"
}