{
 "id": "1128566",
 "text": "The Vesconte Maggiolo Map is a Portolan map created in 1516 in Naples by the cartographer Vesconte Maggiolo. This map is notable for its detailed depiction of the coasts of Eastern America including what was named India, known today as the \"West Indies\" in the Anglo-Saxon world. == Description == Maggiolo's map, which is in fact like portolan chart, with numerous windrose lines, that shows a wide geographical extent that includes the eastern coasts of America, Europe, Africa and Asia. These types of maps were essential to navigation during the Renaissance, providing crucial information about sea routes and ports. == History == Vesconte Maggiolo (1478 – after 1549) was an outstanding Italian cartographer, born in Genoa. In 1511, he moved to Naples, where he produced several nautical atlases. His work is known for precision and detail, characteristics that are reflected in his 1516 map. In 1527 he left a map describing Verrazzano 's travels. This map had a major error (supposed \"Mar Verrazzano\" with its \"Isthmus Verrazzano\", as Giovanni incorrectly described the North American continent). This error continued to appear on maps for more than a century. A copy of this map from 1527 was destroyed during World War II.Giovanni Da Verrazzano, “Life” – Centro Studi Da Verrazzano. == Characteristics == * Date of creation : 1516 * Material : Parchment * Dimensions : Approximately * Contents : Depicts the coasts from East America to India, including details of islands, ports and sea routes. == Importance == Maggiolo's map is a significant example of Renaissance cartography. Its accuracy and detail helped navigators of the time explore and trade more effectively. In addition, this map is a valuable historical source that provides insight into how the world was understood in the 16th century. == Conservation == The original map is preserved in the Biblioteca Ambrosiana in Milan, Italy. Despite the damage suffered during the Second World War, reproductions have been made that allow their study and appreciation. File:Vesconte_Maggiolo._World_chart,_from_eastern_coasts_of_America_to_India._PORTOLAN_CHART._Naples,_1516.A.jpg|link=Fitxer:Vesconte_Maggiolo._World_chart,_from_eastern_coasts_of_America_to_India._PORTOLAN_CHART._Naples,_1516.A.jpg File:Vesconte_Maggiolo._World_chart,_from_eastern_coasts_of_America_to_India._PORTOLAN_CHART._Naples,_1516.B.jpg|link=Fitxer:Vesconte_Maggiolo._World_chart,_from_eastern_coasts_of_America_to_India._PORTOLAN_CHART._Naples,_1516.B.jpg File:Vesconte_Maggiolo._World_chart,_from_eastern_coasts_of_America_to_India._PORTOLAN_CHART._Naples,_1516.C.jpg|link=Fitxer:Vesconte_Maggiolo._World_chart,_from_eastern_coasts_of_America_to_India._PORTOLAN_CHART._Naples,_1516.C.jpg File:Vesconte_Maggiolo._World_chart,_from_eastern_coasts_of_America_to_India._PORTOLAN_CHART._Naples,_1516.D.jpg|link=Fitxer:Vesconte_Maggiolo._World_chart,_from_eastern_coasts_of_America_to_India._PORTOLAN_CHART._Naples,_1516.D.jpg == References == == Bibliography == * Navigazione e carte nautiche nei secoli XIII-XVI, Genoa, SAGEP, 1983. * Corradino Astengo, Der genuesische Kartograph V. m. und sein Werk, in Cartographica Helvetica , 1996, n. 13, pp. 9–17 * Corradino Astengo, \"Mediterranean nautical cartography of the XVI and XVII centuries \", Genova 2000, pp. 80–88 and 149-192. * Corradino Astengo, The Graphical Tradition of the Renaissance in the Mediterranean , in The History of Cartography, Volume Three (Part 1): Cartography in the European Renaissance , Edited by David Woodward, Chicago, Universidad de Prensa of Chicago, 2007, pp. 174–262. * Corradino Astengo, Vesconte Maggiolo (alias Vesconte de Maiolo, Vesconte de Maiollo) , in Cartography in Liguria (14th-19th centuries) edited by Massimo Quaini, Genova, Brigati, 2007, pp. 72@–75. == Other websites == * Compass Rose by Pedro Reinel, Marinha Museum, Lisbon Category:Maps",
 "title": "Vesconte Maggiolo Map"
}