{
 "id": "1128030",
 "text": "Waterford Baptist Church is a Christian congregation located on Catherine Street in Waterford, Ireland. The church is known for its commitment to the teachings of the Bible, emphasizing a return to the practices of the early Christians. As a congregation, they identify as \"Bible Christians,\" focusing on the belief that the Bible is the final authority on all matters of faith and practice. The church also aligns itself with evangelical principles, emphasizing the message of salvation through Jesus Christ. == History == Waterford Baptist Church has served the local community for centuries, offering regular worship services and community activities. The church's doctrine is rooted in the teachings of the New Testament, with a focus on the gospel's message of reconciliation with God through Jesus Christ. Established in 1650, it is thought to be one of the oldest Baptist churches in Ireland. The founding is attributed to Thomas Patient, a signatory to the 1644 Confession of Faith, and one of six Baptist ministers sent by the British parliament to Ireland. On 1st June 1653, representatives of ten Irish congregations met in Waterford and sent what became known as The Waterford Letter to London. This letter is said to have influenced the London Baptist leaders in determining which churches were regarded as being in fellowship with them. For these reasons, despite continuing to be a small congregation, The Waterford Baptist Church is considered significant in the history of Baptism in Ireland. == Beliefs and Practices == Waterford Baptist Church identifies primarily as \"Christians,\" aiming to follow Jesus Christ closely as recorded in the Bible. They describe themselves as \"Bible Christians,\" upholding the Bible as the authoritative word of God. The church also considers itself evangelical, focusing on the message of salvation, which is central to their teachings. == Services and Community Involvement == The church holds regular services every Sunday at 11 a.m., including communion on the first Sunday of each month. In addition to worship services, they host a Wednesday evening study group at 7:30 p.m. The church is actively involved in community-building activities, including monthly church lunches and other events. == Contact and Location == Waterford Baptist Church is located on Catherine Street, Waterford, Ireland. == References == == Other websites == * Waterford Baptist Church Official Website Category:Churches",
 "title": "Waterford Baptist Church"
}