{
 "id": "1128695",
 "text": "Edward Jacobs Crawford IV is an American businessman, investor, and former intelligence officer. He is known for serving as Vice President of Goldman Sachs and for being the CEO and co-founder of the private equity firm Coltala Holdings. Crawford has also served in the Peace Corps and has been active in politics by organizing super PACs, supporting politicians such as Jeb Bush. He is a Bronze Star Medal recipient for his service during Operation Enduring Freedom. == Education == Crawford graduated from Caddo Magnet High School in 1999. In 2003, he graduated from Texas Christian University with a B.A. in English and communications. Crawford also received MBA, MA, and MGM degrees from Tulane University in 2009.At Tulane University, Crawford was a Morton A. Aldrich Fellow, a FLAS Fellow, and a Cowen Scholar in Latin American Studies. Crawford also received and the Robert V. Tessaro Young Volunteer Award from Tulane. Crawford also received an MBA from MIT. At MIT, he was a Sloan Leadership Fellow. == Public service career == As part of the Peace Corps, Crawford served in the Dominican Republic, where he established a local coffee cooperative to help farmers earn more money from their yearly harvests in 2005..The cooperative, named “CoopCafeSur” eventually expanded to include over 300 coffee farmers across the country. It also began selling products to coffee buyers in global markets. During his service in the Peace Corps, Crawford worked closely on rural projects with Joe Kennedy III, with whom he trained alongside in the Peace Corps DR program. The two eventually reunited for a joint speaking engagement at New World Symphony in 2015. On the 40th anniversary of the Peace Corps’ founding, Crawford was named to the Peace Corps’ Top 40 Under 40 list. == Military career == Crawford served in the U.S. Navy as a Naval Intelligence Officer, first serving as an intelligence officer with Special Operations Command in Latin America. He was assigned to Afghanistan during Operation Enduring Freedom, during which he served as a Tribal and Political Advisor for SEAL Teams Two and Four as part of a Special Operations Task Force. In the Navy, he reached the rank of lieutenant and served as intelligence support in regions such as Uruzgan, establishing contact with local tribes. Crawford received a Bronze Star Medal for his service in Afghanistan during Operation Enduring Freedom. == Business career == After finishing his tenure with the Peace Corps, Crawford worked at the private equity firm Advantage Capital Partners (AC), before leaving the company to join the investment bank Goldman Sachs. Crawford worked for seven years at Goldman Sachs, where he was eventually appointed Vice President. Crawford also served as managing director of Avesta, which would become InvestRes and Trustwork. Crawford founded Coltala Group, later known as Coltala Holdings, with Ralph Manning in 2017. Coltala Holdings is a holding company focused on acquiring controlling stakes in businesses. It owns subsidiaries such as Trüdela Partners, Choice Health at Home, and Revere Packaging. Crawford is a member of the Young Presidents’ Organization. He was named in Diversity MBA Magazine’s Top 50 Under 50 list. He was also named one of Fort Worth Inc.’s Entrepreneurs of Excellence in 2021. Crawford is the coordinator of War Veterans Fund which was founded by Dan Crenshaw. The organization for helps fellow war veterans. == References == Category:Living people Category:Businesspeople from Texas Category:Businesspeople from Louisiana",
 "title": "Edward J. Crawford"
}