{
 "id": "1129208",
 "text": "Pakistani musical instruments are the musical instruments that developed and are used in Pakistan or the Greater Indus region. Pakistani classical music, also known as Hindustani classical music () uses a lot of these instruments. These musical instruments known as Vādya are traditionally grouped into five types.In Ain-i-Akbari (Administration of Akbar), we find classification as Tata (string), Vitata (over which skin is stretched), Ghana, and Sushira or Sukhira (wind) instruments. According to him, Ghana vadyas produce ‘resonance by the conclusion of two solid bodies’. This classification continued to be accepted as we find it in Faquirullah’s Raga Darpana and in Tofat-ul-Hind of Mirza Khan-ibn-Fakhruddin Muhammad. The five types are: Tāt Vādya which are string instruments played with fingers or a plectrum; Vitāt Vādya which are string instruments played with a bow; Avanaddh Vādya which are percussion instruments that are hollow and covered with membranes; Ghaṇa Vādya which are based upon percussive instruments which do not have membranes, specifically those which have solid resonators; and Śushira Vādya which are wind instruments played by blowing air. This is the grouping of musical instruments used during the Mughal era in Pakistan as mentioned in the Ain-i-Akbari. Sangita Ratnakara, a 13th-century musicological text by Śārṅgadeva from Kashmir, gives another classification based on the function of the instruments: Sushkám, which is for solo playing; Gītānugám, which is for accompaniment to vocal music; Nṛttyānugám, which is for accompaniment to dance; and Dvayānugám, which is for accompaniment to both dance and vocal music. There are many other Pakistani musical instruments in the semi- classical and folk categories but may not fit in these groups.Baloch, N. A. 1988 \"Musical Instruments of The Lower Indus Valley\" in Rhythms of the Lower Indus: Perspectives on the Music of Sind. Edited by Zohra Yusuf. == Music theory == The Natyashastra, according to Emmie te Nijenhuis, is the oldest surviving text that systematically discusses the theory and instruments of South Asian music. Music has been an essential part of performance arts in ancient Pakistan since the Vedic times. Before the Natyashastra was written, the ancient tradition in Pakistan grouped musical instruments into four to five categories based on how they produce sound (how they work, rather than the material they are made of). These categories are stringed instruments (tat or chordophones), wind instruments (sushir or aerophones), solid instruments (ghan or idiophones), and percussion instruments with a membrane (avanaddha or membranophones). According to Maurice Winternitz, the Natyashastra's music theory focuses on three themes – sound, rhythm, and the structure of musical texts. The text states that there are 22 shrutis (microtones) or 1200 cents in an octave, which are small intervals of sound measuring about 54.5 cents each. This system is very close to the ancient Greek system, where similar intervals measured 55 cents. The Natyashastra also discusses musical scales (gramas) and modes (murchanas), with 21 combinations, some of which are same as the Greek modes. However, the Gandhara-grama is just mentioned in Natyashastra, which mainly focuses on two scales, fourteen modes, and four tanas (notes). The text also discusses which scales are best for different forms of performance arts. Musical scale in Pakistani classical music Svara (Long) Shadja () Rishabha () Gandhara () Madhyama () Panchama () Dhaivata () Nishada () Shadja () Svara (Short) Sa () Ri () Ga () Ma () Pa () Dha () Ni () Sa () (shadja-graama) Varieties C D♭, D E♭, E F, F♯ G A♭, A B♭, B CC From chapter 28 onwards, the Natyashastra describes four main types of musical instruments. It gives examples like the veena for stringed instruments, drums for covered instruments, cymbals for solid instruments, and flutes for wind instruments. Chapter 33 talks about group performances, which it calls kutapa (orchestra). It suggests that an orchestra should include one male and one female singer, along with nine to eleven musical instruments. == Musical instruments == Following is the list of Pakistani musical instruments grouped into several types: === Plucked String Instruments === Tāt Vādya (Plucked String Instruments) Name Image Description Tanbur, also called Tambura or Tampura A long-necked plucked string instrument used for providing drone in classical music. There are different versions of it among the Baloch and Hazara communities of Pakistan. Veena Various chordophone instruments from South Asia. Ancient musical instruments evolved into many variations, such as lutes, zithers, and arched harps. Sitar A plucked string instrument with a long neck and gourd resonator. Originated during the Delhi Sultanate period. Surbahar A large plucked string instrument similar to the sitar but with a deeper tone. Sarod A fretless string instrument used in Hindustani classical music. Rubab A string instrument from the northwestern and northern regions of Pakistan. Sarangi A fretless string instrument from North India. Dilruba A plucked string instrument similar to both the Sitar and Sarangi. Believed to be a mix of both. Esraj A bowed string instrument with a resonator body. Santur A hammered dulcimer from Kashmir of Iranian origins. == References == == Further reading == * Enayetullah, A. (1970). Musical Instruments of Pakistan. * Who’s Who: Music in Pakistan. (2012). United States: Xlibris UK. . * Dehlavi, S. A. (1959). Tradition and Change in Indo-Pakistani Classical Music. * Nabī Bak̲h̲shu K̲h̲ānu Balocu. Musical Instruments of the Lower Indus Valley of Sindh. Pakistan, Culture Department, Government of Sindh, 2012. * Malik, M. S. (1983). The Musical Heritage of Pakistan. Pakistan: Idara Saqafat-e-Pakistan (Pakistan National Council of the Arts). * Qureshi, R. (1986). Sufi Music of India and Pakistan: Sound, Context and Meaning in Qawwali. United Kingdom: Cambridge University Press. . * * Pakistan Living Traditions of Arts & Music. (1996). Pakistan: Pakistan National Council of the Arts. == Other websites == * Musical Instruments of the Indian Subcontinent Heilbrunn Timeline of Art History. Metmuseum.org * Ayeen Akbery (1684) * The Ain i Akbari, Volume 3 (1894) * Supplement to the first volume of Gladwin's Ayeen Akberi (1918) * *Natya shastra Manuscript (with 37 chapters), in Sanskrit (Chapters 31, 32 and 34 missing) * Musical instruments",
 "title": "Pakistani musical instruments"
}