{
 "id": "112974",
 "text": "The 2003–04 NHL season was the 87th regular season of the National Hockey League. The thirty teams played 82 games in a new format that increased divisional games from 5 to 6 per team (30 total), conference games from 3 to 4 (32 total), and decreased inter-conference games to at least one per team, with three extra games (18 in total). The Stanley Cup winners were the Tampa Bay Lightning, who won the best of seven series 4–3 against the Calgary Flames. This was the first season since the 1969–70 season that teams would wear their dark jerseys at home. For the fourth time in eight years, the all- time record for total shutouts in a season was shattered, as 192 shutouts were recorded. The 2003–04 regular season was also the first one (excluding the lockout-shortened regular season of 1994–95) since 1967–68 in which there was neither a 50-goal scorer, nor a 100-point scorer. This was the final season that ABC and ESPN televised NHL games. It was also the final NHL season before the 2004–05 NHL lockout, and the final season in which games could end in ties. ==Regular season== ===Final standings=== Detroit Red Wings won the Presidents' Trophy and home-ice advantage throughout the playoffs. For rankings in conference, division leaders are automatically ranked 1–3. These three, plus the next five teams in the conference standings, earn playoff berths at the end of the season. ====Eastern Conference==== ====Western Conference==== ===Scoring leaders=== Note: GP = Games Played, G = Goals, A = Assists, Pts = Points Player Team GP G A Pts Martin St. Louis Tampa Bay 82 38 56 94 Ilya Kovalchuk Atlanta 81 41 46 87 Joe Sakic Colorado 81 33 54 87 Markus Naslund Vancouver 78 35 49 84 Marian Hossa Ottawa 81 36 46 82 Patrik Elias New Jersey 82 38 43 81 Daniel Alfredsson Ottawa 77 32 48 80 Cory Stillman Tampa Bay 81 25 55 80 Robert Lang Washington / Detroit 69 30 49 79 Brad Richards Tampa Bay 82 26 53 79 ===Leading goaltenders=== Note: GP = Games Played; Mins = Minutes Played; W = Wins; L = Losses: OT = Overtime Losses; GA = Goals Allowed; SO = Shutouts; GAA = Goals Against Average Player Team GP Mins W L T GA SO SV GAA Martin Brodeur New Jersey 75 4554 38 26 11 154 11 .917 2.03 Marty Turco Dallas 73 4359 37 21 13 144 9 .913 1.98 Ed Belfour Toronto 59 3444 34 19 6 122 10 .918 2.13 Tomas Vokoun Nashville 73 4221 34 29 10 178 3 .909 2.53 Dan Cloutier Vancouver 60 3539 33 21 6 134 5 .914 2.27 ==Stanley Cup Playoffs== Note: All dates in 2004. The 2004 playoffs were considered to be wide open with no clear favourite. All of the top teams had weaknesses. Tampa Bay and Boston were both young teams with no history of recent postseason success. Detroit, Ottawa, Colorado, and Philadelphia all had major questions in goal. New Jersey was marred by injuries to Scott Stevens and Brian Rafalski, while Vancouver was missing the suspended Todd Bertuzzi. The first-round Eastern Conference matchups were notable for the number of heated rivalries. The Ottawa Senators met the Toronto Maple Leafs for the fourth time in five years in the always passion-filled Battle of Ontario. The Boston Bruins and Montreal Canadiens met in a resumption of the most common of all NHL playoff series, and one which the Canadiens have thoroughly dominated, including an upset win two years prior. The Philadelphia Flyers also played a hated division rival in the New Jersey Devils. The only non-rivalry was the Tampa Bay-New York Islanders series. The West saw the resumption of the Vancouver-Calgary rivalry, which had been somewhat dormant as the Flames made the playoffs for the first time since 1996. In a less passionate but still interesting matchup, Detroit played division rival Nashville (whom they had struggled against during the regular season) in Nashville's first ever franchise visit to the playoffs. San Jose met the St. Louis Blues, while the always difficult four- five matchup saw Colorado and Dallas meet. The Calgary Flames, a sixth seed, defeated three straight division champions, the Canucks, the Red Wings and the Sharks to become the first Canadian team to reach the Stanley Cup Finals in ten years, since the Canucks lost to the Rangers in the Finals in 1994. They faced the Tampa Bay Lightning, who defeated the Islanders in five, swept the Canadiens and defeated the Flyers in seven games. The Flames and the Lightning battled hard in the Stanley Cup Finals, eventually pushing the series to seven games. By game 5, the Flames took the 3–2 series lead back to Calgary, and in game six, a puck appeared to have gone into the net, which would have made the game 3–2, but the goal light did not go on, the referee did not signal that a goal had been scored, and play went on, no goal counted. Extensive replays showed the play was inconclusive. The Lightning would win the game in double overtime, and go on to win the Stanley Cup with a 2–1 win in game seven, with two goals from Ruslan Fedotenko. Brad Richards, with a team-high 25 points in the playoffs, was awarded the Conn Smythe Trophy. ===Playoff bracket=== ===Conference Quarterfinals=== ====Eastern Conference Quarterfinals==== {| cellpadding=\"5\" border=\"1\" Tampa Bay vs. NY Islanders Date Away Home OT Score April 8 NY Islanders Tampa Bay 3 – 0 April 10 NY Islanders Tampa Bay 3 – 0 April 12 Tampa Bay NY Islanders 3 – 0 April 14 Tampa Bay NY Islanders 3 – 0 April 16 NY Islanders Tampa Bay OT 3 – 2 Tampa Bay wins series 4–1 ====Western Conference Quarterfinals==== {| cellpadding=\"5\" border=\"1\" Colorado vs. Dallas Date Away Home OT Score April 7 Dallas Colorado 3 – 1 April 9 Dallas Colorado 5 – 2 April 12 Colorado Dallas OT 4 – 3 April 14 Colorado Dallas 2OT 3 – 2 April 17 Dallas Colorado 5 – 1 Colorado wins series 4–1 ===Conference Semifinals=== ====Eastern Conference Semifinals==== {| cellpadding=\"5\" border=\"1\" Tampa Bay vs. Montreal Date Away Home OT Score April 23 Montreal Tampa Bay 4 – 0 April 25 Montreal Tampa Bay 3 – 1 April 27 Tampa Bay Montreal OT 4 – 3 April 29 Tampa Bay Montreal 3 – 1 Tampa Bay wins series 4–0 ====Western Conference Semifinals==== {| cellpadding=\"5\" border=\"1\" Detroit vs. Calgary Date Away Home OT Score April 22 Calgary Detroit OT 2 – 1 April 24 Calgary Detroit 2 – 5 April 27 Detroit Calgary 2 – 3 April 29 Detroit Calgary 4 – 2 May 1 Calgary Detroit 1 – 0 May 3 Detroit Calgary OT 0 – 1 Calgary wins series 4–2 ===Conference Finals=== {| cellpadding=\"3\" border=\"1\" Eastern Conference Tampa Bay vs. Philadelphia Date Away Home May 8 Philadelphia 1 3 Tampa Bay May 10 Philadelphia 6 2 Tampa Bay May 13 Tampa Bay 4 1 Philadelphia May 15 Tampa Bay 2 3 Philadelphia May 18 Philadelphia 2 4 Tampa Bay May 20 Tampa Bay 4 5 Philadelphia OT May 22 Philadelphia 1 2 Tampa Bay Tampa Bay wins series 4–3 and Prince of Wales Trophy ===Finals=== Tampa Bay vs. Calgary Date Away Home May 25 Calgary 4 1 Tampa Bay May 27 Calgary 1 4 Tampa Bay May 29 Tampa Bay 0 3 Calgary May 31 Tampa Bay 1 0 Calgary June 3 Calgary 3 2 Tampa Bay OT June 5 Tampa Bay 3 2 Calgary 2OT June 7 Calgary 1 2 Tampa Bay Tampa Bay wins series 4–3 and Stanley Cup Brad Richards (Tampa Bay) wins Conn Smythe Trophy ===Scoring leaders=== Note: GP = Games Played, G = Goals, A = Assists, Pts = Points Player Team GP G A Pts Brad Richards Tampa Bay 23 12 13 25 Martin St. Louis Tampa Bay 23 9 15 24 Jarome Iginla Calgary 26 13 9 22 Fredrik Modin Tampa Bay 23 8 11 19 Craig Conroy Calgary 26 6 11 17 Vincent Lecavalier Tampa Bay 23 9 7 16 Keith Primeau Philadelphia 18 9 7 16 Martin Gelinas Calgary 26 8 6 14 Vincent Damphousse San Jose 17 7 7 14 Alexei Zhamnov Philadelphia 18 4 10 14 ==NHL awards== The NHL Awards presentation took place in Toronto. Presidents' Trophy: Detroit Red Wings Prince of Wales Trophy: Tampa Bay Lightning Clarence S. Campbell Bowl: Calgary Flames Art Ross Memorial Trophy: Martin St. Louis, Tampa Bay Lightning Bill Masterton Memorial Trophy: Bryan Berard, Chicago Blackhawks Calder Memorial Trophy: Andrew Raycroft, Boston Bruins Conn Smythe Trophy: Brad Richards, Tampa Bay Lighting Frank J. Selke Trophy: Kris Draper, Detroit Red Wings Hart Memorial Trophy: Martin St. Louis, Tampa Bay Lightning Jack Adams Award: John Tortorella, Tampa Bay Lightning James Norris Memorial Trophy: Scott Niedermayer, New Jersey Devils King Clancy Memorial Trophy: Jarome Iginla, Calgary Flames Lady Byng Memorial Trophy: Brad Richards, Tampa Bay Lightning Lester B. Pearson Award: Martin St. Louis, Tampa Bay Lightning Lester Patrick Trophy: Mike Emrick, John Davidson, Ray Miron Maurice 'Rocket' Richard Trophy: Jarome Iginla, Calgary Flames; Ilya Kovalchuk, Atlanta Thrashers; Rick Nash, Columbus Blue Jackets NHL Plus/Minus Award: Martin St. Louis, Tampa Bay Lightning; Marek Malik, Vancouver Canucks Roger Crozier Saving Grace Award: Dwayne Roloson, Minnesota Wild Vezina Trophy: Martin Brodeur, New Jersey Devils William M. Jennings Trophy: Martin Brodeur, New Jersey Devils ===All-Star teams=== First Team Position Second Team Martin Brodeur, New Jersey Devils G Roberto Luongo, Florida Panthers Scott Niedermayer, New Jersey Devils D Chris Pronger, St. Louis Blues Zdeno Chara, Ottawa Senators D Bryan McCabe, Toronto Maple Leafs Joe Sakic, Colorado Avalanche C Mats Sundin, Toronto Maple Leafs Martin St. Louis, Tampa Bay Lightning RW Jarome Iginla, Calgary Flames Markus Naslund, Vancouver Canucks LW Ilya Kovalchuk, Atlanta Thrashers ==First games== The following is a list of players of note who played their first NHL game in 2003–04 (listed with their first team): *Joffrey Lupul, Anaheim Mighty Ducks *Kari Lehtonen, Atlanta Thrashers *Patrice Bergeron, Boston Bruins *Jason Pominville, Buffalo Sabres *Matthew Lombardi, Calgary Flames *Eric Staal, Carolina Hurricanes *Tuomo Ruutu, Chicago Blackhawks *John-Michael Liles, Colorado Avalanche *Marek Svatos, Colorado Avalanche *Nikolai Zherdev, Columbus Blue Jackets *Pascal Leclaire, Columbus Blue Jackets *Michael Ryder, Montreal Canadiens *Jordin Tootoo, Nashville Predators *Marek Zidlicky, Nashville Predators *Antoine Vermette, Ottawa Senators *Antero Niittymaki, Philadelphia Flyers *Joni Pitkanen, Philadelphia Flyers *Marc-Andre Fleury, Pittsburgh Penguins *Tom Preissing, San Jose Sharks *Alexander Semin, Washington Capitals ==Last games== The following is a list of players of note that played their last game in the NHL in 2003–04 (listed with their last team): *Patrick Roy, Colorado Avalanche *Steve Thomas, Detroit Red Wings *Adam Oates, Edmonton Oilers *Igor Larionov, New Jersey Devils *Scott Stevens, New Jersey Devils *Cliff Ronning, New York Islanders *Mark Messier, New York Rangers *Vincent Damphousse, San Jose Sharks *Al MacInnis, St. Louis Blues *Ron Francis, Toronto Maple Leafs ==References== *Hockey Database *NHL Official Website NHL NHL Category:National Hockey League seasons",
 "title": "2003–04 NHL season"
}