{
 "id": "1129902",
 "text": "Nurbanu Sultan (, \"queen of light\"; 1525/1527A.H. de Groot, s.v. in Encyclopaedia of Islam vol.8 p.124 – 7 December 1583) was the Haseki Sultan of the Ottoman Empire and the legitimate wife of Sultan Selim II (reigned 1566–1574), and the mother of Sultan Murad III (reigned 1574–1583), and the Valide Sultan of the Ottoman Empire from 1574 until her death in 1583. She was one of the most prominent person during the period of the Sultanate of Women. == Theories about her origin == There are several theories about the origins of Nurbanu's lineage. Although none of them have been definitively proven, the theory that she was from Venice is the best known and most widely accepted, and the one that historians follow the most. === Cecilia Venier-Baffo === In 1900, Emilio Spagni stated that Nurbanu was the illegitimate daughter of a Venetian patrician, Nicolo Venier, and Violante Baffo. She was kidnapped during the capture of Paros by the Ottoman admiral Hayreddin Barbarossa during the Third Ottoman–Venetian War. This information that Nurbanu Sultan was Cecilia Venier-Baffo was followed by Franz Babinger, who used this source when writing about Nurbanu Sultan in his article Digionorio Biografico degli Italiani. === Kale Kartanou === In 1992, historian Benjamin Arbel, while re- evaluating an old source, found that Nurbanu was born on the island of Corfu and was a Greek named Kale Kartanou. She was the daughter of Nikolaos Kartanos and was abducted from the island in 1537, a theory he considers plausible, although he cannot fully prove it. According to this theory, Venetian senators deliberately introduced her as Cecilia Venier-Baffo, and Nurbanu admitted this for political and material gain.Pedani, M.P. (2000). Safiye's Household and Venetian Diplomacy. Turcica, 32, 9-32. This theory was followed by Italian historian Maria Pia Pidani and Turkish historian Emrah Safa Gürkan, among others. According to other historians, she \"created an inter-imperial connection to associate herself with the Venetians\", as indicated by the fact that the Ottomans also generally maintained diplomatic relations with Venice\". === Jewish descent === Turkish historian Ahmet Refik believed that her name was RachelÇağatay Uluçay, Padişahların Kadınları ve Kızları p.68, citing Kadınlar Saltanatı I p.95 and that she came from Jewish ancestry, a theory also followed by other Turkish historians.A.H. de Groot, s.v. in Encyclopaedia of Islam vol.8 p.124 == Early life == Nurbanu, renowned at court for her beauty and extraordinary intelligence, was sent to Manisa in 1543 as a concubine in the harem of Şehzade Selim, and she bore him a son, Murad (succeeded Sultan of the Ottoman Empire after his father, Selim II), and four daughters. == Haseki Sultan == Nurbanu was the favorite wife of Prince Selim (who became the Ottoman Sultan as Selim II in 1566) and the mother of Prince Murad (the future Sultan Murad III, he was born in 1546). While her husband Selim was şehzade, Nurbanu was the head of Selim's royal harem in Manisa. After becoming sultan, Selim allowed his beloved wife, Haseki Nurbanu, to reside in Topkapi Palace during his reign, as his predecessor (Suleiman the Magnificent) had done. Selim had many concubines after becoming sultan, but Nurbanu was always dear to Selim for her beauty and intelligence. As the mother of the heir, Nurbanu would advise her husband on various matters. Although this was not well received at the time, Selim II often consulted Nurbanu on various matters because Selim liked Nurbanu's judicial system. The Venetian ambassador Jacopo Soranzo stated that: > \"It is said that the Haseki was greatly loved and respected by His Majesty > for her extraordinary beauty and unusual intelligence.\" During this time, Nurbanu had become a powerful figure with far-reaching influence. According to some sources (mostly Venetian accounts), her influence was so great that Nurbanu Sultan effectively ran the government with the Grand Vizier Sokollu Mehmed Pasha. Selim had transferred almost all of his power to Sokollu, who effectively ruled the empire in Selim's stead. Nurbanu did not directly manage political affairs, but she regularly consulted with Sokollu. The Ottoman Empire was geographically unstable and the throne was often contested. If a new sultan ascended the throne, the sultan's brothers would be killed along with their entire families. However, Nurbanu Sultan was determined that when the time came for her son to succeed his father, she would not interfere with the killing of the new sultan's brothers. By the time Selim II's reign ended in 1574, Haseki Nurbanu was earning 1,100 aspers a day, while Selim's other wives, who each had one son, were earning only 40 aspers. In addition, Selim repeatedly publicly stated that Murad was his heir and thus secured his eldest son's position, and Selim had his other sons executed if they interfered in this matter. Selim, however, insisted that his entire affection was for Nurbanu. He legally married Nurbanu. According to the ambassadors accounts, the marriage took place in early 1571, and this remark suggests that Selim wanted to express through the marriage how much he loved Nurbanu and that his only legitimate heir was his and Nurbanu's son Murad. == Valide Sultan == Şehzade Murad was sent to serve as governor of Manisa on the Aegean coast and remained there until the death of Sultan Selim II in 1574. Nurbanu was the first to hear the news of Selim's death and then ordered everyone to keep quiet for a while. She did not share the news of the Sultan's death with anyone other than the Grand Vizier Sokollu Mehmed Pasha. Her goal was to have her son Murad come to Istanbul secretly, so that no one could take advantage of the situation and ascend the throne. Nurbanu understood this, and if Murad could not come to Istanbul quickly, she would have to take other steps quickly. Security and secrecy were tightened everywhere in the harem and no one knew that Selim II was actually dead. Nurbanu did not tell anyone, hid her husband's body in an ice box, and in Manisa, Nurbanu sent a message to her son to come to Constantinople immediately. Twelve days later, Nurbanu revealed Selim's body to Murad. The news was not immediately made public. Her son later became sultan, and Nurbanu became Valide Sultan, the highest position for a woman in the Ottoman Empire. Nurbanu's real influence extended during this time, as she enjoyed the power of Valide Sultan between 1574 and 1583. Although she did not reside in the palace after Selim II's death, she did not live there. Although she had had influence in many matters as a Haseki in the past, she advised Selim on various matters and gradually built a powerful group of her confidants for the future. However, as a Valide, she immediately began to act directly in political matters and appointed her own confidants to high positions in order to strengthen herself and her son through them. During her son's reign, she was honored as Valide-i Atik Sultan (\"First Powerful Mother of the Ruling Sultan\") until her death. Nurbanu was the first woman to hold both the Haseki and Valide titles. Although the Valide Sultan title had existed since the reign of Bayezid II, it was Murad III who converted the title into a legally registered title for his mother, Nurbanu. This meant that previously the Valide Sultan title had been considered simply \"mother of the Sultan\". But after Murad legalized the title, the Valide Sultan title acquired a formal title, and after this change, the Valide Sultans not only performed the usual duties according to tradition. Their influence also increased significantly. Nurbanu did not try to rule the Ottoman Empire through her son, but simply helped her son become a just and worthy sultan. Who would be loved and respected by the people. Thus, Valide became a high status and became an important and powerful position in the dynasty. Nurbanu had more money than the combined wealth of other members of the dynasty and high-ranking officials. She was considered the epitome of Valide Sultan. As Valide Sultan, she was allocated 2000 coins per day. Due to his absolute and ultimate authority, her mistresses, Canfeda Hatun, Raziye Hatun, and Hubbi Hatun, as well as other female servants trusted by Murad and Nurbanu, are also believed to have been very powerful and influential during his reign. === The rivalry with Safiye === Of all the sultans, Murad was the most devoted to his mother. However, Nurbanu's dominance and power were still under threat. Murad never married and he loved a woman named Safiye. Safiye Sultan was given the rank of Haseki only after Murad became sultan. Safiye wanted to manage state affairs herself, so she tried to influence Murad, which angered Nurbanu. Safiye's efforts were unsuccessful, as Murad would not listen to any woman except his mother. The details of the fight between Safiye and Nurbanu are not known, but it is likely that they had a conflict within the harem, as their hostility had greatly increased in 1582. To avoid the danger of the dynasty's extinction, Safiye would have been justified in having more children, but she did not become pregnant for many years. Even if she did become pregnant, she either miscarried or the child was born prematurely and subsequently died. However, Murad refused to accept a new concubine because he loved Safiye so much—so much so that he did not want to have sex with anyone else. Nurbanu then hatched a plan and conspired with Safiye to falsely accuse Safiye of using black magic to make Sultan Murad impotent. The rumor spread throughout the city, and Murad eventually exiled Safiye to the old palace to protect his self-respect. Doctors eventually cured Murad of his impotence. Later, Murad had many children. Nurbanu thought that her son Murad might have finally given up on Safiye, but she did not win the fight so easily. Her grandson Mehmed openly disagreed with both Nurbanu and Sultan Murad over his mother Safiye. In fact, the sources clearly indicate that Nurbanu was afraid because if Murad did not execute her, Mehmed might anger Murad even more. Although Nurbanu did not like Safiye, she loved Mehmed as much as she loved all her grandchildren. This is clearly evidenced by a follow-up report from 1582, and according to it, after Mehmed's circumcision, one of Nurbanu's maidservants became pregnant by Mehmed, which was forbidden, because the girl was a member of Murad's harem, not Mehmed's. Since Mehmed already had a very bad relationship with her father, Nurbanu killed the girl to hide the news from Murad. Murad never realized what had happened and Nurbanu was finally able to restore her relationship with Mehmed. Nurbanu died suddenly in 1583 and less than two years later, in early 1585, Safiye regained her husband's trust and love for her. She and her exiled daughters returned to the royal harem. Safiye thus regained enough power and influence to protect her son and prepare for his reign, and she was now even more powerful. Like Nurbanu and her predecessor Hürrem Sultan, Safiye formed a faction of herself, her son, and supporters, and was able to expel opponents from the palace. After Murad's death in January 1595, Safiye, like her late mother-in-law Nurbanu, kept the news of Sultan Murad's death a secret until her son arrived in Constantinople to ascend the throne. === Foreign politics === After Nurbanu became Valide Sultan during the reign of her son Murad III, she effectively ran the government with Grand Vizier Azam Sokollu Mehmed Pasha. Nurbanu served as the Sultan's co- ruler during the women's sultanate. Outside the harem, she was kept informed of all the news of the country by one person, her \"Kira\", her name was Esther Handali. Esther Handali was in contact with the French Queen Catherine de' Medici. It is understood that Nurbanu Sultan used Kira Esther Handali, who was of Jewish descent, for her personal affairs and that she was in contact with Joseph Nasi, Duke of Naxos, on financial matters. Perhaps this relationship led to rumors that she was of Jewish descent. Among her close associates were Babusade Agasi Gazenfar Aga, the priest Semsi Pasha, and the powerful women of the harem who accompanied her from Manisa, Canfeda Hatun and Raziye Hatun. An envoy's report provides information about the close political diplomatic contacts between Nurbanu Sultan and the Venetians. In 1583, a Venetian senate sent her a gift worth 2000 Venetian gold coins. According to another report, she stopped the Ottoman invasion of Crete and warned Captain Ali Pasha not to declare war on Venice. Nurbanu Sultan is most often mentioned as a powerful woman in the Venezia article. Nurbanu never forgot her birthplace, Venice. She is said to have maintained contact with Venice through her lady-in-waiting Chirana, who was in regular contact with the Venetian Council of Ten, from whom Chirana received an allowance as a Venetian agent.Ioanna Iordanou, Venice's Secret Service: Organizing Intelligence in the Renaissance During his nine-year reign as Valide Sultan, she was so pro-Venetian in his politics that the Republic of Genoa hated him. Some believe that she was poisoned by a Genoese agent. However, she died on 7 December 1583 in her palace in the Yenikapi quarter of Istanbul. === Patroness of architecture === Nurbanu built a mosque complex that Mimar Sinan had built over a large area. The buildings of the complex were established in a continuous and stepped plan. The buildings were built on two separate plains as mosques, madrasas, schools and houses for dervishes. To the west of this, a complex of buildings designed to perform social functions such as charitable institutions was built on a lower plan. To the south were public baths. Between 1570 and 1579, Mimar Sinan built new parts of the Darüşşifa Mosque complex next to the Darüşşifa Mosque complex. Nurbanu sold a piece of land next to his mosque complex, next to the Darüşşifa Hospital, which is scattered in many corners of Istanbul, Rumelia and Anatolia. The money from the sale of the land was spent on the treatment and needs of the patients admitted to the darüşşifa. The complex also benefited the revenue administration. During his tenure as Valide Sultan, he commissioned the famous Ottoman architect Mimar Sinan to build the Atik Valide Mosque and its surrounding kulli in the Üsküdar district of Istanbul, where a \"Jewish bathhouse\" had previously been located. The kulli was completed and opened in late 1583, just before his death. The Atik Valide complex included a mosque, a madrasah, a primary school, a convent for worshippers, a place for Quran recitation and a school for Hadith scholars, a soup kitchen, a hospital, and baths. Mimar Sinan would test his major mosques by playing finely tuned musical instruments to see if the sounds were repeating because the room was designed for Quran recitation. He even installed sound-bearing stones in the domes to ensure the beautiful performance of the holy readings. Nurbanu Sultan also built the İmarets and baths in Markan, Alemdag and Langa in Istanbul. She was the first Ottoman woman to build a library in the mosque complex. The stones needed for the construction of this mosque and complex were collected from places near Istanbul such as İznik and Gallipoli, and the wood from Sapanca and İznik. She was buried in the tomb of her husband Selim II, located inside a mosque in the Hagia Sophia in Sultanahmet, Istanbul, Turkey. == Death == Nurbanu died in Istanbul on 7 December 1583, during the reign of her son Murad III. She was buried in the courtyard of Hagia Sophia next to Selim II in his türbe (tomb) making her the first wife of a sultan to be honored to be buried next to her husband. Nurbanu Sultan gained great respect not only during her lifetime but also after her death. Sultans remained in the palace during the funeral, but Murad ignored this custom and walked and cried with his mother's body to the Fatih Mosque where Nurbanu's funeral was held. The Sultan's mosque, the farthest from the palace, Fatih Mosque, was designated for her funeral. Nurbanu Sultan was not only blessed by the common people but also by the inhabitants of the imperial capital. Even people of other religions were saddened by her death. Before Nurbanu's death, Paolo Contarini, the Venetian ambassador to one of the Ottoman palaces, said: > \"All good and bad aspects are in the nature of the Queen Mother.\" When Nurbanu died in December 1583, Contarini reported the following information: > \"The death of this woman upset some people's interests and pleased others. > The great authority she enjoyed with her son brought important benefits to > many people, on the contrary, but ruined the hopes of others to fulfill > their desires. Nevertheless, everyone generally admits that she was an > extremely good, courageous and learned woman.\" == Issue == Selim and Nurbanu had one son and three daughters: Shah Sultan (c. 1543, Karaman Palace, Karaman - 3 November 1580, Constantinople, Zal Mahmud Pasha Mausoleum, buried in Eyüp). She first married Hasan Ağa in 1562. She later married Zal Mahmud Pasha in 1575.Tezcan, Baki (2001). Searching For Osman: A Reassessment Of The Deposition Of Ottoman Sultan Osman II (1618-1622). unpublished Ph.D. thesis. pp. 327 n. 16. * Gevherhan Sultan (1544, Manisa Palace, Manisa - 1624, Constantinople, buried in the Mausoleum of Selim II, Hagia Sophia Mosque). She first married Piyale Pasha in 1562 and later married Serah Mehmed Pasha. * Ismihan Sultan (1545, Manisa Palace, Manisa – 8 August 1585, Constantinople, buried in the Mausoleum of Selim II, Hagia Sophia Mosque). She married firstly Sokollu Mehmed Pasha in 1562, secondly Kalailkoz Ali Pasha in 1584. * Murad III (4 July 1546, Manisa Palace, Manisa – 16 January 1595, Topkapi Palace, Constantinople, buried in the Mausoleum of Murad III, Hagia Sophia). It is believed that Nurbanu had another child, but this is disputed: * Fatma Sultan (c. 1558, Konya Palace, Konya – October 1580, Constantinople, buried in the Siyavus Pasha Mosque). She married Kanizeli Siyavus Pasha in 1573. == In literature and popular culture == * The life and death of Nurbanu Sultan was the subject of a fictional novel by Rup Marina, published in Venetian Contract, in which she is portrayed as the niece of Dos Sebastiano Venier and the mother of Freyr, one of the novel's main characters. * Nurbanu Sultan was the main character in the novel The Mapmaker's Daughter by Catherine Nuri Hughes, which is based on the life of Nurbanu Sultan. * Turkish actress Merve Bolgur played the role of Nurbanu Sultan in the Turkish television series Muhtesem Yüzil. == Related pages == * Ottoman dynasty * Ottoman Empire * Murad III * Selim II * Safiye Sultan * Canfeda Hatun * Suleiman the Magnificent == References == == Bibliography == * * * A.D. Alderson, The Structure of the Ottoman Dynasty. Clarendon Press, Oxford, 1956. * * Burke's Royal Families of the World, Volume II: Africa & The Middle East, Burke's Peerage Ltd., London, 1980. * A.H. de Groot, s.v. in Encyclopaedia of Islam vol.8 p. 124 * Yılmaz Öztuna, Devletler ve Hanedanlar, Turkiye 1074-1990, Ankara, 1989. * Osman Selâheddin Osmanoğlu, Osmanli Devleti'nin Kuruluşunun 700. Yılında Osmanlı Hanedanı, Islâm Tarih, Sanat ve Kültür Araştırma Vakfı (ISAR), Istanbul, 1999. * Emine Fuat Tugay, Three Centuries: Family Chronicles of Turkey and Egypt, Oxford, 1963. * * * Category:Turkish Muslims Category:Ottoman people Category:Consorts of Ottoman sultans Category:1583 deaths Category:1520s births Category:Haseki Sultan Category:Mothers of Ottoman sultans Category:Concubines of Ottoman sultans",
 "title": "Nurbanu Sultan"
}