{
 "id": "1129067",
 "text": "The music for the 2013 action-adventure game Grand Theft Auto V was made by the German electronic group Tangerine Dream, American composer Woody Jackson, and American hip hop artists The Alchemist and Oh No. The game was developed by Rockstar North and published by Rockstar Games. Grand Theft Auto V has a radio in the game with sixteen stations that play over 441 songs, and two stations with talk shows. The game’s music was made to go well with these songs, not to take attention away from them. The game's music has been released in five official soundtracks: * The Music of Grand Theft Auto V - This was released with the game and includes three volumes of the game’s score and songs from the in-game radio. * The Cinematographic Score — GTA 5 - An electronic album released in March 2014 with tracks by Edgar Froese, the founder of Tangerine Dream. * Welcome to Los Santos - Released with the Windows version of the game. == Production and composition == Grand Theft Auto V has its own original music, which is different from most of the previous games in the series. Music supervisor Ivan Pavlovich said that creating this original score was \"daunting\" because it was a new approach for the Grand Theft Auto games. Like the earlier games in the series, Grand Theft Auto V also features licensed music tracks on its in-game radio. Pavlovich hoped that the original score would make the licensed music even better, not take away from it. To work on the score, Rockstar engaged The Alchemist, Oh No, Tangerine Dream and Woody Jackson, the latter of which had previously worked on Red Dead Redemption, L.A. Noire and Max Payne 3's music. == Soundtracks == The Music of Grand Theft Auto V was released digitally on September 24, 2013, in three volumes. It includes the original score composed for the game and songs licensed for the in-game radio. The retail version of the soundtrack came out on December 9, 2014, and was available on CD and vinyl through Mass Appeal Records. ==Notes== ==References== soundtrack",
 "title": "Music of Grand Theft Auto V"
}