{
 "id": "1129385",
 "text": "Mufti Muhammad Shafi Deobandi (1897 – 6 October 1976) was a prominent Islamic scholar and a leading figure in the Deobandi movement. He was the father of renowned scholars, Muhammad Rafi Usmani and Mufti Muhammad Taqi Usmani, a globally respected Islamic jurist, scholar, and expert in Islamic finance. == Early life and education == Mufti Muhammad Shafi was born in 1897 in Deoband, British India. He pursued his early education at local schools before enrolling in the renowned Darul Uloom Deoband, where he studied under notable scholars such as Ashraf Ali Thanwi and Mahmud Hasan Deobandi. His academic foundation at Darul Uloom was pivotal in shaping his scholarly contributions. == Career == Mufti Muhammad Shafi served as the Grand Mufti of Darul Uloom Deoband and authored numerous Islamic books, including Maariful Qur'an, a widely regarded commentary on the Quran in Urdu. After migrating to Pakistan following the partition of India, he founded the Darul Uloom Karachi, one of Pakistan's largest Islamic seminaries. His leadership and educational efforts significantly impacted Islamic scholarship in the region. == Notable works == Mufti Shafi Deobandi was a prolific writer who contributed extensively to Islamic literature. His most notable work, Maariful Qur'an, remains a key reference for Quranic interpretation. His writings on Islamic jurisprudence (fiqh) and fatwas continue to be influential in Islamic legal and theological discussions. == Legacy == Mufti Muhammad Shafi's scholarly contributions, particularly in the fields of Islamic jurisprudence (fiqh) and tafsir (Quranic interpretation), continue to influence scholars and students worldwide. His son, Mufti Muhammad Taqi Usmani, has carried forward his legacy by becoming one of the leading contemporary scholars in Islamic finance and Shariah law. His influence remains significant in Islamic scholarship and practice. == References == Category:1897 births Category:1976 deaths Category:Muslim scholars",
 "title": "Muhammad Shafi Deobandi"
}