{
 "id": "1129758",
 "text": "The men's 200 metres sprint at the 1936 Olympic Games was on August 4 and August 5. There were 44 athletes. These athletes were from 22 different nations. Each country could only have 3 athletes in this event. Jesse Owens won the event by 0.4 seconds. Mack Robinson(brother of baseball's Jackie Robinson) was in 2nd place. This was Owen's 3rd gold medal. He had also gotten a medal in the 100 metres and long jump. Later, he would also win the sprint relay. Tinus Osendarp of the Netherlands was in 3rd place. This was their first medal in this event. ==Background== This was the 200 metres in the Olympics. It was not in the 1896 Summer Olympics, but it was in every Olympics after that. None of the 6 athletes from the 1932 finals were also in this event. Jesse Owens was the favorite Olympian. He had already won both the 100 metres and the long jump in Berlin. This was the first time that Liechtenstein ran in this event. This was the 9th time that the United States was in this event. They were the only country to have been at every 200 metres in the Olympics so far. ==Competition== The competition was the same since 1920. There were heats, quarterfinals, semifinals, and a final. There were 8 heats. Each heat had 4 to 6 runners. The 3 fastest runners in each heat went to the quarterfinals. The quarterfinals consisted of 4 heats. Each heat had 6 athletes each. The 3 fastest men in each quarterfinal went to the semifinals. There were 2 semifinals. Each semifinal had 6 runners. The 3 fastest athletes in each semifinal went to the finals. The final had 6 runners. Before, some 200 metres races were on a straight trace. These races were run on the new standard 400-metre track. ==Records== Before this competition, these were the world and Olympic records. *On straightaway. No world record existed for running on a curve.Official Report, p. 621. Jesse Owens beat the Olympic record in the 3rd heat. He ran 21.1 seconds. He tied that time in the 3rd quarterfinal. Mack Robinson tied that time in the 1st semifinal. He also tied that time in the final. However, Owens had won with the time of 20.7 seconds. This beat the Olympic record. It also was the unofficial record for the 200 metres on a curved track. ==Schedule== Date Time Round Tuesday, 4 August 1936 10:30 15:30 Heats Quarterfinals Wednesday, 5 August 1936 15:00 18:00 Semifinals Final ==Results== ===Heats=== The fastest 3 runners in each heat went to the quarterfinal. ====Heat 1==== Rank Athlete Nation Time Notes 1 Wil van Beveren 21.4 2 Tomás Beswick 22.1 3 Mutsuo Taniguchi 22.2 4 Antonio Salcedo Unknown 5 José de Almeida Unknown 6 Aristidis Sakellariou Unknown ====Heat 2==== Rank Athlete Nation Time Notes 1 Tinus Osendarp 21.7 2 Egon Schein 22.0 3 Alan Pennington 22.1 4 Masao Yazawa 22.4 5 Pierre Dondelinger Unknown 6 Xaver Frick Unknown ====Heat 3==== Rank Athlete Nation Time Notes 1 Jesse Owens 21.1 , 2 Lee Orr 21.6 3 Karl Neckermann 21.8 4 Arthur Sweeney 22.1 5 Nemesio de Guzman 22.9 6 Gunnar Christensen 23.1 ====Heat 4==== Rank Athlete Nation Time Notes 1 Bruce Humber 22.1 2 Gyula Gyenes 22.1 3 Felix Rinner 22.4 4 Paul Bronner 22.6 5 Chen Kingkwan Unknown ====Heat 5==== Rank Athlete Nation Time Notes 1 Paul Hänni 21.9 2 Renos Frangoudis 22.1 3 József Sir 22.2 4 Poh Kimseng Unknown 5 Pat Dannaher Unknown ====Heat 6==== Rank Athlete Nation Time Notes 1 Marthinus Theunissen 21.7 2 Howard McPhee 21.8 3 Börje Strandvall 22.6 4 George Fahoum Unknown 5 Liu Changchun Unknown 6 Antonio Fondevilla Unknown ====Heat 7==== Rank Athlete Nation Time Notes 1 Bob Packard 21.2 2 Eric Grimbeek 21.8 3 Albert Steinmetz 21.9 4 Eric Whiteside Unknown ====Heat 8==== Rank Athlete Nation Time Notes 1 Mack Robinson 21.6 2 Aki Tammisto 22.2 3 Carlos Hofmeister 22.3 4 Dieudonné Devrindt Unknown 5 Mario Minai Unknown 6 Alfred König Unknown ===Quarterfinals=== The 3 fastest runners in each quarterfinal went to the semifinal. ====Quarterfinal 1==== Rank Athlete Nation Time Notes 1 Lee Orr 21.2 2 Paul Hänni 21.3 3 Bob Packard 21.3 4 József Sir 21.6 5 Egon Schein 21.7 6 Tomás Beswick Unknown ====Quarterfinal 2==== Rank Athlete Nation Time Notes 1 Wil van Beveren 21.7 2 Marthinus Theunissen 21.9 3 Bruce Humber 22.1 4 Renos Frangoudis Unknown 5 Mutsuo Taniguchi Unknown 6 Carlos Hofmeister Unknown ====Quarterfinal 3==== Rank Athlete Nation Time Notes 1 Jesse Owens 21.1 , 2 Howard McPhee 21.8 3 Eric Grimbeek 21.9 4 Aki Tammisto 22.0 5 Felix Rinner Unknown — Albert Steinmetz ====Quarterfinal 4==== Rank Athlete Nation Time Notes 1 Mack Robinson 21.2 2 Tinus Osendarp 21.3 3 Karl Neckermann 21.6 4 Gyula Gyenes Unknown 5 Börje Strandvall Unknown — Alan Pennington ===Semifinals=== The 3 fastest times in each semifinal went to the finals. ====Semifinal 1==== Rank Athlete Nation Time Notes 1 Mack Robinson 21.1 , 2 Lee Orr 21.3 3 Wil van Beveren 21.5 4 Bob Packard 21.6 5 Karl Neckermann 21.8 6 Eric Grimbeek 22.2 ====Semifinal 2==== Rank Athlete Nation Time Notes 1 Jesse Owens 21.3 2 Tinus Osendarp 21.5 3 Paul Hänni 21.6 4 Marthinus Theunissen 21.8 5 Bruce Humber 22.0 6 Howard McPhee 22.0 ===Final=== Rank Athlete Nation Time Notes Jesse Owens 20.7 Mack Robinson 21.1 Tinus Osendarp 21.3 4 Paul Hänni 21.6 5 Lee Orr 21.6 6 Wil van Beveren 21.9 ==References== Category:Athletics at the 1936 Summer Olympics Category:Men's events at the 1936 Summer Olympics",
 "title": "Athletics at the 1936 Summer Olympics – Men's 200 metres"
}