{
 "id": "1129211",
 "text": "This the discography of American rapper Ludacris. ==Albums== ===Studio albums=== List of albums, with selected chart positions, sales figures and certifications Title Album details Peak chart positions Sales Certifications US Peak chart positions for albums in the United States: * All except Golden Grain: * Golden Grain: US R&B; /HH Peak chart positions for albums on the Top R&B;/Hip-Hop Albums chart in the United States: * All except Golden Grain: * Golden Grain: US Rap AUS Peak chart positions for albums in Australia: * Chicken-n-Beer: * The Red Light District: * Release Therapy: CAN GER IRE SWI UK Peak chart positions for albums in the United Kingdom: * Word of Mouf, Chicken-n-Beer and Release Therapy: * Back for the First Time, The Red Light District, Theater of the Mind and Battle of the Sexes: Incognegro * Released: August 17, 1999 * Label: Disturbing tha Peace * Format: CD 179 68 — — — — — — — Back for the First Time * Released: October 17, 2000 * * Formats: CD, LP, digital download 4 2 — — — — — — 160 * US: 3,103,000 * RIAA: 3× Platinum * MC: Gold Word of Mouf * Released: November 27, 2001 * * Formats: CD, LP, digital download 3 1 — — 30 98 — — 57 * US: 3,674,000 * RIAA: 4× Platinum * BPI: Gold * MC: Platinum Chicken-n-Beer * Released: October 7, 2003 * * Formats: CD, LP, digital download 1 1 — 98 5 87 71 — 44 * US: 2,648,000 * RIAA: 2× Platinum * BPI: Gold * MC: Platinum The Red Light District * Released: December 7, 2004 * * Formats: CD, LP, digital download 1 1 1 54 — — — 91 98 * US: 2,084,000 * RIAA: 2× Platinum * BPI: Silver * MC: Gold Release Therapy * Released: September 26, 2006 * * Formats: CD, LP, digital download 1 2 1 93 11 — — 57 69 * US: 1,300,000 * RIAA: Platinum Theater of the Mind * Released: November 24, 2008 * * Formats: CD, LP, digital download 5 2 1 — 22 — — 46 137 * US: 671,000 * RIAA: Gold Battle of the Sexes * Released: March 9, 2010 * * Formats: CD, LP, digital download 1 1 1 — 17 — — 82 58 * US: 632,000 * RIAA: Platinum Ludaversal * Released: March 31, 2015 * * Formats: CD, LP, digital download 3 2 2 — 20 — — — 86 * US: 130,000 \"—\" denotes a recording that did not chart or was not released in that territory. === Compilation albums === List of albums, with selected chart positions, sales figures and certifications Title Album details Peak chart positions Sales Certifications US US R&B; Peak chart positions for albums on the Top R&B;/Hip-Hop Albums chart in the United States: * All except Golden Grain: * Golden Grain: US Rap Golden Grain (with Disturbing tha Peace) * Released: September 10, 2002 * * Formats: CD, LP, digital download 6 1 — * US: 500,000 * RIAA: Gold Disturbing tha Peace (with Disturbing tha Peace) * Released: December 13, 2005 * * Formats: CD, LP, digital download 11 1 1 * US: 630,000 * RIAA: Gold \"—\" denotes a recording that did not chart. === Mixtapes === List of mixtapes, with year released Title Album details DTP Takeover: It's an Epidemic (with Disturbing tha Peace and DJ Storm) * Released: 2006 * * Formats: CD, digital download Pre-Release Therapy (with DJ Green Lantern) * Released: September 19, 2006 * * Formats: CD, digital download The Preview (with DJ Drama) * Released: November 4, 2008 * * Formats: digital download Conjure: A Hustler's Spirit * Released: January 20, 2010 * * Formats: Digital download 1.21 Gigawatts: Back to the First Time * Released: November 15, 2011 * * Formats: Digital download #IDGAF * Released: May 24, 2013 * * Formats: CD, Digital download == Extended plays == List of extended plays, with selected chart positions, sales figures and certifications Title Details Peak chart positions US US R&B; /HH US Rap Burning Bridges * Released: December 16, 2014 * * Formats: Digital download 158 23 18 == Singles == === As lead artist === List of singles as lead artist, with selected chart positions and certifications, showing year released and album name Title Year Peak chart positions Certifications Album US US R&B; /HH US Rap AUS Peak chart positions for singles in Australia: * \"Act a Fool\", \"Stand Up\", \"Pimpin' All Over the World\" and \"Rest of My Life\": * \"Area Codes\": * \"Rollout (My Business)\": * \"What Them Girls Like\": * \"How Low\": * \"Why Don't We Fall in Love\": CAN GER Peak chart positions for singles in Germany: * All except \"Yeah!\": * \"Yeah!\": IRE Peak chart positions for singles in Ireland: * All except \"Yeah!\": * \"Yeah!\": NZ Peak chart positions for singles in New Zealand: * All except \"Yeah!\": * \"Yeah!\": SWI Peak chart positions for singles in Switzerland: * All except \"Yeah!\": * \"Yeah!\": UK Peak chart positions for singles in the United Kingdom: * All except \"Lovers and Friends\" and \"Break Your Heart\": * \"Lovers and Friends\": * \"Break Your Heart\": \"What's Your Fantasy\" (featuring Shawnna) 2000 21 10 5 — — — — — — 19 * RIAA: 2× Platinum Back for the First Time \"Southern Hospitality\" 23 6 5 — — — — — — — \"Fatty Girl\" (with LL Cool J and Keith Murray) 2001 87 32 6 — — — — — — — The Good Life \"Area Codes\" (featuring Nate Dogg) 24 10 7 83 — — — 40 — 25 * RIAA: Gold Word of Mouf \"Rollout (My Business)\" 17 7 20 84 — — 48 — — 20 * RIAA: Platinum \"Saturday (Oooh! Ooooh!)\" (featuring Sleepy Brown) 2002 22 10 4 — — — — — — 31 \"Welcome to Atlanta\" (with Jermaine Dupri) 35 15 3 — — — — — — — Word of Mouf and Instructions \"Move Bitch\" (featuring Mystikal and I-20) 10 3 3 — — — — — — — Word of Mouf \"Act a Fool\" 2003 32 20 10 39 — — — — — — * RIAA: Gold 2 Fast 2 Furious and Chicken-n-Beer \"P-Poppin\" (featuring Shawnna and Lil' Fate) — — — — — — — — — — Chicken-n-Beer \"Stand Up\" (featuring Shawnna) 1 1 1 30 — 56 43 13 22 14 * RIAA: Platinum \"Splash Waterfalls\" 6 2 3 — — — — — — — \"Diamond in the Back\" 2004 94 51 — — — — — — — — \"Blow It Out\" — 56 — — — — — — — — \"Get Back\" 13 9 5 — — — — 30 48 30 * RIAA: Platinum The Red Light District \"Number One Spot\" 2005 19 8 6 — — — 46 — — * RIAA: Gold \"The Potion\" — 65 — — — — — — — — \"Pimpin' All Over the World\" (featuring Bobby Valentino) 9 5 2 28 — — — — — — \"Blueberry Yum Yum\" (featuring Sleepy Brown) — — — — — — — — — — * RIAA: Gold \"Georgia\" (with Field Mob featuring Jamie Foxx) 39 31 21 — — — — — — — * RIAA: Gold Disturbing tha Peace \"Money Maker\" (featuring Pharrell) 2006 1 1 1 — — 86 — — — — * RIAA: 2× Platinum Release Therapy \"Grew Up a Screw Up\" (featuring Young Jeezy) — 60 — — — — — — — — \"Runaway Love\" (featuring Mary J. Blige) 2007 2 3 1 — — — 37 21 — 52 * RIAA: Platinum \"Slap\" — 56 21 — — — — — — — \"What Them Girls Like\" (featuring Chris Brown and Sean Garrett) 2008 33 17 8 98 53 — — — — — * RIAA: Gold Theater of the Mind \"Wish You Would\" (featuring T.I.) — — — — — — — — — — \"Undisputed\" (featuring Floyd Mayweather Jr.) — — — — — — — — — — \"One More Drink\" (featuring T-Pain) 24 15 4 — — — — — — — \"Nasty Girl\" (featuring Plies) 2009 — 54 23 — — — — — — — \"How Low\" 6 2 1 54 41 — — 21 — 67 * RIAA: 3× Platinum Battle of the Sexes \"My Chick Bad\" (featuring Nicki Minaj) 2010 11 2 2 — — — — — — — * RIAA: 3× Platinum \"Sex Room\" (featuring Trey Songz) 69 5 6 — — — — — — — \"Jingalin\" 2012 — 63 — — — — — — — — rowspan=\"2\" \"Representin\" (featuring Kelly Rowland) 97 28 20 — — — — — — — \"Rest of My Life\" (featuring Usher and David Guetta) 72 — — 16 47 32 57 19 42 41 * ARIA: Platinum * RIANZ: Gold Fast & Furious 6 \"Helluva Night\" 2013 96 31 23 — — — — — — — #IDGAF \"Party Girls\" (featuring Wiz Khalifa, Jeremih and Cashmere Cat) 2014 113 36 20 — — — — — — — \"Good Lovin''\" (featuring Miguel) 91 30 21 — — — — — — — * RIAA: Gold Burning Bridges & Ludaversal \"Vitamin D\" (featuring Ty Dolla Sign)Vitamin D (feat. Ty Dolla $ign) - Single Ludacris 2017 — — — — — — — — — — rowspan=\"5\" \"Vices\" — — — — — — — — — — \"Found You\" 2020 — — — — — — — — — — \"Butter.Atl\" 2021 — — — — — — — — — — \"Buying All Black\" (featuring Flo Milli and PJ) 2022 — — — — — — — — — — \"—\" denotes a recording that did not chart or was not released in that territory. ===As featured artist=== List of singles as featured artist, with selected chart positions and certifications, showing year released and album name Title Year Peak chart positions Certifications Album US US R&B; US Rap AUS Peak chart positions for guest appearances in Australia: * All except \"One Minute Man\", \"Yeah!\", \"How Do You Sleep?\" and \"Ride\": * \"One Minute Man\": * \"Yeah!\": * \"How Do You Sleep?\": * \"Ride\": CAN GER IRE NZ SWI UK \"One Minute Man\" (Missy Elliott featuring Ludacris) 2001 15 8 — 91 — 38 47 — 92 10 Miss E... So Addictive \"Bia' Bia' (Lil Jon & The East Side Boyz featuring Ludacris, Too $hort and Chyna Whyte) 94 47 — — — — — — — — Put Yo Hood Up \"B R Right\" (Trina featuring Ludacris) 2002 83 50 24 — — — — — — — Diamond Princess \"Why Don't We Fall in Love\" (Remix) (Ameriie featuring Ludacris) — — — 73 — — — — — 40 All I Have \"Gossip Folks\" (Missy Elliott featuring Ludacris) 8 5 2 22 — 28 28 — 50 9 Under Construction \"Holidae In\" (Chingy featuring Snoop Dogg and Ludacris) 2003 3 2 2 13 — 56 27 4 43 35 * RIAA: Gold * ARIA: Gold Jackpot \"Hot & Wet\" (112 featuring Ludacris) 70 29 — — — — — — — — Hot & Wet \"Yeah!\" (Usher featuring Lil Jon and Ludacris) 2004 1 1 — 1 1 1 1 1 1 1 * RIAA: 13× Platinum * ARIA: 9× Platinum * BPI: 3× Platinum * BVMI: Platinum * IFPI SWI: Gold * MC: Platinum * RIANZ: 2× Platinum Confessions \"Break Bread\" (I-20 featuring Ludacris and Bone Crusher) — 78 — — — — — — — — Self Explanatory \"Lovers and Friends\" (Lil Jon & The East Side Boyz featuring Usher and Ludacris) 3 2 1 36 — 68 22 15 44 10 Crunk Juice \"Shake Dat Shit\" (Shawnna featuring Ludacris) 63 28 16 — — — — — — — Worth tha Weight \"Oh\" (Ciara featuring Ludacris) 2005 2 2 — 7 — 7 7 5 11 4 * RIAA: Platinum * ARIA: Gold Goodies \"Sugar (Gimme Some)\" (Trick Daddy featuring Cee Lo Green, Ludacris and Lil' Kim) 20 36 12 31 — — — — — 61 * RIAA: Gold Thug Matrimony: Married to the Streets \"Unpredictable\" (Jamie Foxx featuring Ludacris) 8 2 — 22 — 73 26 13 85 16 * RIAA: Platinum Unpredictable \"Need a Boss\" (Shareefa featuring Ludacris) 2006 62 10 — — — — — — — — Point of No Return \"Glamorous\" (Fergie featuring Ludacris) 2007 1 41 — 2 12 16 3 9 38 6 * RIAA: 3× Platinum * ARIA: 3× Platinum * BPI: Platinum * BVMI: Gold * RIANZ: 2× Platinum The Dutchess \"Get Buck in Here\" (DJ Felli Fel featuring Diddy, Ludacris, Akon and Lil Jon) 41 72 13 — 58 — — — — — * RIAA: Gold \"Rock Star\" (R. Kelly featuring Ludacris and Kid Rock) — 54 — — — — — — — — Double Up \"U Can Believe It\" (Playaz Circle featuring Ludacris) — — — — — — — — — — Supply & Demand \"Gimme Dat\" (Chingy featuring Ludacris and Bobby V) 2008 — — — — — — — — — — Hate It or Love It \"Mr. Magnificent\" (Small World featuring Ludacris) — — — — — — — — — — World Premiere \"Grippin (Sean Garrett featuring Ludacris) — 40 — — — — — — — — Turbo 919 \"How We Do It (Around My Way)\" (Lloyd featuring Ludacris) — 77 — — — — — — — 75 Lessons in Love \"Pretty Girl\" (Jarvis featuring Ludacris) — — — — — — — — — — Dream Girls \"Chopped 'n' Skrewed\" (T-Pain featuring Ludacris) 27 3 — — — — — 14 — — * RIAA: Gold Thr33 Ringz \"How Do You Sleep?\" (Jesse McCartney featuring Ludacris) 2009 26 — — 75 40 — — — — — Departure: Recharged \"Creepin' (Solo)\" (Chamillionaire featuring Ludacris) — — — — — — — — — — \"Regret\" (LeToya featuring Ludacris) 78 8 — — — — — — — — Lady Love \"Addicted to Money\" (Lil Scrappy featuring Ludacris) — 96 — — — — — — — — The Grustle \"Bulletproof\" (Raheem DeVaughn featuring Ludacris) — 46 — — — — — — — — The Love & War MasterPeace \"Baby\" (Justin Bieber featuring Ludacris) 2010 5 96 — 3 3 22 7 4 25 3 * RIAA: 12× Platinum * ARIA: 8× Platinum * BPI: 2× Platinum * BVMI: Gold * RIANZ: Platinum My World 2.0 \"All I Do Is Win\" (DJ Khaled featuring T-Pain, Ludacris, Rick Ross and Snoop Dogg) 24 8 6 — 69 — — — — — * RIAA: 3× Platinum * MC: Platinum * BPI: Silver Victory \"Atlanta, GA\" (Shawty Lo featuring The-Dream, Ludacris and Gucci Mane) — — — — — — — — — — Fright Night \"Break Your Heart\" (Taio Cruz featuring Ludacris) 1 — — 2 1 5 2 17 1 1 * RIAA: 3× Platinum * ARIA: 2× Platinum * BPI: Platinum * BVMI: Platinum * IFPI SWI: 2× Platinum * MC: 3× Platinum * RIANZ: Gold Rokstarr \"Porn Star Dancing\" (My Darkest Days featuring Ludacris and Chad Kroeger) 90 — — — — — — — — — \"Ride\" (Ciara featuring Ludacris) 42 3 — 75 — — — — — 75 * RIAA: Platinum Basic Instinct \"I Like\" (Jeremih featuring Ludacris) — 25 — — — — — — — — * RIAA: Gold All About You \"Saturday Night\" (Jessica Mauboy featuring Ludacris) — — — 7 — — — — — — * ARIA: 2× Platinum Get 'Em Girls \"Tonight (I'm Lovin' You)\" (Enrique Iglesias featuring Ludacris and DJ Frank E) 4 — — 2 3 12 5 2 4 5 * RIAA: 3× Platinum * ARIA: 7× Platinum * BPI: Gold * BVMI: Gold * MC: 3× Platinum * RIANZ: Platinum Euphoria \"Be with You\" (David Banner and 9th Wonder featuring Ludacris and Marsha Ambrosius) — 44 — — — — — — — — Death of a Popstar \"Country Shit\" (Remix) (Big K.R.I.T. featuring Ludacris and Bun B) 2011 — 50 23 — — — — — — — Return of 4Eva \"Little Bad Girl\" (David Guetta featuring Taio Cruz and Ludacris) 70 — — 15 14 5 8 19 7 4 * ARIA: Platinum * BPI: Gold * BVMI: Gold * IFPI SWI: Gold Nothing but the Beat \"Wet the Bed\" (Chris Brown featuring Ludacris) 77 6 — — — — — — — — * RIAA: Platinum F.A.M.E. \"Too Easy\" (Tyrese featuring Ludacris) — 38 — — — — — — — — Open Invitation \"Just (The Tip)\" (Plies featuring Jeremih and Ludacris) — 75 — — — — — — — — Purple Heart \"Tonight (Best You Ever Had)\" (John Legend featuring Ludacris) 2012 79 12 — — — — — — — — * RIAA: 2× Platinum * ARIA: Gold Think Like a Man soundtrack \"We in This Bitch\" (DJ Drama featuring Young Jeezy, T.I., Ludacris and Future) — 68 — — — — — — — — Quality Street Music \"Changed the Way You Kiss Me\" (Remix) (Example featuring Ludacris) — — — — — — — — — — Playing in the Shadows \"Everyday Birthday\" (Swizz Beatz featuring Chris Brown and Ludacris) — 44 — — — — — — — — Haute Living \"All Around the World\" (Justin Bieber featuring Ludacris) 2013 22 — — 34 10 53 31 15 — 30 * RIAA: Platinum * ARIA: Platinum * MC: Platinum Believe \"Run the Check Up\" (DJ Infamous featuring Jeezy, Ludacris and Yo Gotti) 2016 — — — — — — — — — — \"Grey\" (LeToya Luckett featuring Ludacris) 2017 — — — — — — — — — — Back 2 Life \"Everything\" (Tank featuring Trey Songz and Ludacris) — — — — — — — — — — Savage \"The Champion\" (Carrie Underwood featuring Ludacris) 2018 47 — — — — — — — — — * RIAA: Platinum Cry Pretty \"Quiero Saber\" (Pitbull and Prince Royce featuring Ludacris) — — — — — — — — — — rowspan=\"2\" \"SexBeat\" (Usher featuring Lil Jon and Ludacris) 2020 — — — — — — — — — — \"Tell Me Again\" (Pitbull featuring Prince Royce and Ludacris) — — — — — — — — — — Libertad 548 \"Peaches\" (Remix) (Justin Bieber featuring Ludacris, Usher and Snoop Dogg) 2021 — — — — — — — — — — \"—\" denotes a recording that did not chart or was not released in that territory. ===Promotional singles=== List of promotional singles, with selected chart positions, showing year released and album name Title Year Peak chart positions Album US US R&B; NZ \"I'm So Hood\" (Remix) (DJ Khaled featuring Young Jeezy, Ludacris, Busta Rhymes, Big Boi, Lil Wayne, Fat Joe, Birdman and Rick Ross) 2007 — — — We the Best \"Down in tha Dirty\" (featuring Bun B and Rick Ross) — — — Strength in Numbers \"Still Standing\" (Monica featuring Ludacris) 2008 — 74 — Still Standing \"Hey Ho\" (featuring Lil' Kim and Lil' Fate) 2010 — — — Battle of the Sexes \"Beamer, Benz or Bentley\" (Remix) (Lloyd Banks featuring The-Dream, Ludacris, Jadakiss and Yo Gotti) — — — rowspan=\"\" \"Shake Señora\" (Remix) (Pitbull featuring T-Pain, Sean Paul and Ludacris) 2011 — — 40 Planet Pit \"Dirt Road Anthem\" (Remix) (Jason Aldean featuring Ludacris) 7 — — \"Welcome to My Hood\" (Remix) (DJ Khaled featuring Ludacris, T-Pain, Busta Rhymes, Mavado, Twista, Birdman, Ace Hood, Fat Joe, Jadakiss, Bun B, Game and Waka Flocka Flame) — — — We the Best Forever \"Same Damn Time\" (Remix) (Future featuring Diddy and Ludacris) 2012 — — — Pluto 3D \"22 Jump Street\" 2014 — — — 22 Jump Street \"Call Ya Bluff\" 2015 — — — Ludaversal \"Beast Mode\" — — — \"—\" denotes a recording that did not chart or was not released in that territory. == Other charted songs == List of songs, with selected chart positions, showing year released and album name Title Year Peak chart positions Album US US R&B; \"Ho\" 1999 — — Incognegro \"Pick Up the Phone\" (with Tyrese and R. Kelly) 2003 — 65 2 Fast 2 Furious soundtrack \"Stomp\" (Young Buck featuring Ludacris and T.I.) 2004 — — Straight Outta Cashville \"In da Club\" (Lil Jon & The East Side Boyz featuring R. Kelly and Ludacris) — — Crunk Juice \"Virgo\" (with Nas, featuring Doug E. Fresh) — 69 The Red Light District and Street's Disciple \"Ludacrismas\" 2007 — — Fred Claus soundtrack \"Dat Girl Right There\" (Usher featuring Ludacris) — 74 \"Grown Woman\" (Mary J. Blige featuring Ludacris) — — Growing Pains \"I Do It for Hip Hop\" (featuring Nas and Jay-Z) 2008 — 89 Theater of the Mind \"Last of a Dying Breed\" (featuring Lil Wayne) 65 — \"Born an OG\" (Ace Hood featuring Ludacris) 2009 — — Ruthless \"Everybody Drunk\" (featuring Lil Scrappy) 2010 — — Battle of the Sexes \"Atlanta Zoo\" (Gucci Mane featuring Ludacris) — — Burrrprint (2) HD \"She Don't Know\" (Usher featuring Ludacris) — — Raymond v. Raymond \"Tongues\" (R. Kelly featuring Ludacris) — — \"Rich & Flexin (featuring Waka Flocka Flame) 2011 — — 1.21 Gigawatts: Back to the First Time \"—\" denotes a recording that did not chart. Make 3 Mixtapes Sign The Albums LUDACRIS ==Guest appearances== List of guest appearances, with other performing artists, showing year released and album name Title Year Other artist(s) Album \"Catch Up\" 1999 James Prince, Infamous 2-0, Lil' Fate J Prince Presents R.N.D.S. \"Block Lockdown\" 2000 Funkmaster Flex, I-20 The Mix Tape, Vol. IV \"That's How I Get Down\" 2001 Ginuwine The Life \"Cut Somethin Jagged Edge Jagged Little Thrill \"Get the Hell on with That\" Fat Joe, Armageddon Jealous Ones Still Envy (J.O.S.E.) \"Considerate Brotha\" Timbaland & Magoo, Playa Indecent Proposal \"Real Pimp\" Nate Dogg Music and Me \"Some South Shit Fiend, Yung Wun Ryde or Die Vol. 3: In the \"R\" We Trust \"You Got What I Want\" 2002 Snoop Dogg, Charlie Wilson, Goldie Loc Paid tha Cost to Be da Boss \"It Wasn't Us\" 2003 I-20 The Neptunes Present... Clones \"Tomb of the Boom\" OutKast, Konkrete, Big Gipp Speakerboxxx/The Love Below \"Down South\" Big Tymers, Lil Wayne, Jazze Pha Big Money Heavyweight \"Higher\" 2004 Twista Kamikaze \"The Whole City Behind Us\" The Game, Kanye West Westside Story: the Compton Chronicles \"Breathe In Breathe Out\" Kanye West The College Dropout \"Childz Play\" Cee Lo Green Cee-Lo Green... Is the Soul Machine \"Shot Off\" 8Ball & MJG Living Legends \"Rodeo\" Method Man Tical 0: The Prequel \"I Came to Bring the Pain\" Lil' Flip, Static Major, Tity Boi U Gotta Feel Me \"Stomp\" Young Buck, The Game Straight Outta Cashville \"Give Me a Chance\" 2005 Bobby V Bobby Valentino \"Trill Recognize Trill\" Bun B Trill \"Pacific Coast\" (Remix) DJ Quik, Kimmi J. Trauma \"Living the Life\" The Notorious B.I.G., Faith Evans, Cheri Dennis, Bobby V, Snoop Dogg Duets: The Final Chapter \"Pop U\" 2006 Juvenile, Fat Joe Reality Check \"Smilin Field Mob Light Poles and Pine Trees \"Gettin' Some\" (Remix) Shawnna, Lil Wayne, Pharrell, Too $hort Block Music \"Take It Slow\" Shawnna, Bobby V \"Playa Cardz Right\" (Male) 2Pac, Keon Bryce Pac's Life \"Do It Well\" (Remix) 2007 Jennifer Lopez Brave \"Rearview (Ridin')\" Bobby Valentino Special Occasion \"Grown Woman\" Mary J. Blige Growing Pains \"Ya Heard\" 2008 Game LAX \"Pocketbook\" Jennifer Hudson Jennifer Hudson \"On Top of the World\" T.I., B.o.B Paper Trail \"Pop Champagne\" (Remix) Ron Browz, Lil Kim, Swizz Beatz \"High Price\" 2009 Ciara Fantasy Ride \"Born an OG\" Ace Hood Ruthless \"Creepin' (Solo)\" Chamillionaire Venom Unreleased \"We Must Be Heard\" DJ Drama, Willie the Kid, Busta Rhymes Gangsta Grillz: The Album (Vol. 2) \"Spanish Fly\" Aventura, Wyclef Jean The Last \"Coochie\" The Black Keys, Ol' Dirty Bastard BlakRoc \"She Don't Know\" 2010 Usher Raymond v. Raymond \"Atlanta Zoo\" Gucci Mane Burrrprint (2) HD \"Black Man's Dream\" Rick Ross Ashes to Ashes \"Beamer, Benz or Bentley\" (Remix) Lloyd Banks, The-Dream, Jadakiss, Yo Gotti \"Porn Star Dancing\" (Remix) My Darkest Days, Chad Kroeger My Darkest Days \"Soul Bossa Nostra\" Quincy Jones, Naturally 7, Rudy Currence Q: Soul Bossa Nostra \"Addicted to Money\" Lil Scrappy The Grustle \"Why You Up in Here\" Flo Rida, Git Fresh, Gucci Mane Only One Flo (Part 1) \"Yep Dat's Me\" Jamie Foxx, Soulja Boy Best Night of My Life \"Knockin 2011 Travis Barker, Snoop Dogg, E-40, Dev Give the Drummer Some \"Furiously Dangerous\" Slaughterhouse, Claret Jai Fast Five \"Shake Senora\" (Remix) Pitbull, T-Pain, Sean Paul Planet Pit \"Money\" DJ Khaled, Young Jeezy We the Best Forever \"Welcome to My Hood\" (Remix) DJ Khaled, T-Pain, Busta Rhymes, Twista, Mavado, Birdman, Ace Hood, Fat Joe, Jadakiss, Bun B, Game, Waka Flocka Flame \"Country Shit\" (Remix) Big K.R.I.T., Bun B Return of 4eva \"What U Mean\" 2012 Big K.R.I.T. Live from the Underground \"Candy Paint & Gold Teeth\" Waka Flocka Flame, Bun B Triple F Life: Friends, Fans and Family \"Little Boy\" I-20, Twista Endless Pursuit \"My Swag\" I-20 \"Hungry in the Streets\" I-20, 2 Chainz, Dolla Boy \"Ridin' Around\" I-20 \"In the A\" Big Boi, T.I. Vicious Lies and Dangerous Rumors \"Ceelo\" 2013 DJ Scream, Wale, Future The Ratchet Superior \"Disappointed\" Los, Diddy Becoming King \"Rep The Dirty\" Slim Thug, Dre Day, Kez Welcome to Texas EP \"Hands in the Air\" Miley Cyrus Bangerz \"Fantasy\" Chris Brown X Files \"Sleep\" 2014 E-40, Plies Sharp On All 4 Corners: Corner 2 \"Errybody\" (Remix) Yo Gotti, Lil Wayne rowspan=\"2\" \"Turn Down For What\" (Remix) Lil Jon, DJ Snake, Pitbull \"Shake Em Off\" 2015 Big K.R.I.T., K Camp It's Better This Way \"Tell Me Again\" 2019 Pitbull, Prince Royce Libertad 548 \"Scatter Brain\" 2021 Conway the Machine, J.I.D La Maquina ==Production discography== List of producer and songwriting credits (excluding guest appearances, interpolations, and samples) Track(s) Year Credit Artist(s) Album 5\\. \"Come On Over\" 2001 Producer Ludacris Back for the First Time 6\\. \"Hood Stuck\" 8\\. \"Mouthing Off\" 13\\. \"Catch Up\" 3\\. \"Stand Up\" 2003 Producer (with Kanye West) Ludacris Chicken-n-Beer 2004 Executive producer I-20 Self Explanatory 2\\. \"Party Starter\" 2005 Songwriter Will Smith Lost and Found 4\\. \"Fly Like Me\" 2007 Songwriter Chingy Hate It or Love It == Explanatory notes == *A \"Slap\" did not enter the Billboard Hot 100, but peaked at number 13 on the Bubbling Under Hot 100 Singles chart. *B \"Jingalin\" did not enter the Billboard Hot 100, but peaked at number 25 on the Bubbling Under Hot 100 Singles chart. *C \"Pretty Girl\" did not enter the Hot R&B;/Hip-Hop Songs chart, but peaked at number 3 on the Bubbling Under R&B;/Hip-Hop Singles chart. *D \"Creepin' (Solo)\" did not enter the Hot R&B;/Hip-Hop Songs chart, but peaked at number 1 on the Bubbling Under R&B;/Hip-Hop Singles chart. *E \"Break Your Heart\" did not enter the Hot R&B;/Hip-Hop Songs chart, but peaked at number 21 on the Bubbling Under R&B;/Hip-Hop Singles chart. *F \"I Like\" did not enter the Billboard Hot 100, but peaked at number 16 on the Bubbling Under Hot 100 Singles chart. *G \"Down in tha Dirty\" did not enter the Hot R&B;/Hip-Hop Songs chart, but peaked at number 10 on the Bubbling Under R&B;/Hip-Hop Singles chart. *H \"Still Standing\" did not enter the Billboard Hot 100, but peaked at number 1 on the Bubbling Under Hot 100 Singles chart. *I \"Wish You Would\" did not enter the Billboard Hot 100, but peaked at number 14 on the Bubbling Under Hot 100 Singles chart. It did not enter the Hot R&B;/Hip-Hop Songs chart, but peaked at number 18 on the Bubbling Under R&B;/Hip-Hop Singles chart. *J \"Undisputed\" did not enter the Billboard Hot 100, but peaked at number 12 on the Bubbling Under Hot 100 Singles chart. *L \"Hey Ho\" did not enter the Billboard Hot 100, but peaked at number 8 on the Bubbling Under Hot 100 Singles chart. *M \"Ho\" did not enter the Hot R&B;/Hip-Hop Songs chart, but peaked at number 3 on the Bubbling Under R&B;/Hip-Hop Singles chart. *N \"Stomp\" did not enter the Hot R&B;/Hip-Hop Songs chart, but peaked at number 10 on the Bubbling Under R&B;/Hip-Hop Singles chart. *O \"In da Club\" did not enter the Hot R&B;/Hip-Hop Songs chart, but peaked at number 7 on the Bubbling Under R&B;/Hip-Hop Singles chart. *P \"Ludacrismas\" did not enter the Hot R&B;/Hip-Hop Songs chart, but peaked at number 4 on the Bubbling Under R&B;/Hip-Hop Singles chart. *Q \"Grown Woman\" did not enter the Hot R&B;/Hip- Hop Songs chart, but peaked at number 19 on the Bubbling Under R&B;/Hip-Hop Singles chart. *R \"Born an OG\" did not enter the Billboard Hot 100, but peaked at number 17 on the Bubbling Under Hot 100 Singles chart. *S \"Everybody Drunk\" did not enter the Billboard Hot 100, but peaked at number 12 on the Bubbling Under Hot 100 Singles chart. *T \"Atlanta Zoo\" did not enter the Hot R&B;/Hip- Hop Songs chart, but peaked at number 15 on the Bubbling Under R&B;/Hip-Hop Singles chart. *U \"She Don't Know\" did not enter the Hot R&B;/Hip-Hop Songs chart, but peaked at number 7 on the Bubbling Under R&B;/Hip-Hop Singles chart. *V \"Tongues\" did not enter the Hot R&B;/Hip-Hop Songs chart, but peaked at number 11 on the Bubbling Under R&B;/Hip-Hop Singles chart. *W \"Rich & Flexin did not enter the Hot R&B;/Hip-Hop Songs chart, but peaked at number 22 on the Bubbling Under R&B;/Hip-Hop Singles chart. *X \"Call Ya Bluff did not enter the Billboard Hot R&B;/Hip-Hop Songs, but peaked at number 1 on the Bubbling Under R&B;/Hip-Hop Singles chart. == References == ==Other websites== * Category:Discographies of American artists",
 "title": "Ludacris discography"
}