{
 "id": "1129110",
 "text": "Georgia Witchel is an American entrepreneur, former USA ice climbing team captain, and the first American woman to bring ice climbing onto an Olympic stage. Witchel is credited as being the youngest American female to send D9, D10, D11, D12, and D13 and the first female to represent the US on an international stage for ice climbing. == Early life and education == Witchel was born in San Francisco, California, and attended San Francisco Friends School for preparatory school before moving to Colorado in 2008. Witchel attended Durango High School from 2015 to 2017. In 2019, she subsequently dropped out of high school and became the first student in the history of Harvey Mudd to attend without a high school diploma. Witchel studied computer science and psychology at Mudd and pursued a career as an artist. She did her first solo show in 2022 and contributed to a zine of local fruit vendors in downtown LA, which was subsequently published by the Museum of Contemporary Art (MOCA) in LA. Witchel graduated from Harvey Mudd in 2023. == Ice climbing == Witchel is also credited for breaking the US record as the youngest competitor at the Ouray Ice Fest in 2015 and is noted as one of the five most influential women in ice climbing in the Arcteryx documentary \"The Mixtress.\" In 2015, Witchel was a founding member of the US ice climbing team and placed first at the first-ever US ice climbing World Cup. Following this, Witchel became one of the first international competitors at the French World Cup (17th). That same year, witchel attended the 2016 Junior Olympics and became one of the first women to represent the US on an Olympic stage for ice climbing. The following year, Witchel competed in the American cup and placed third in lead and second in speed for all age categories, making her the youngest podium in US history. Witchel then competed at her second World Cup in Uluru, Finland, where she placed 4th, breaking her previous record as the highest-ranked female. == Career == Category:American sportspeople",
 "title": "Georgia Witchel"
}