{
 "id": "1129937",
 "text": "Yayue () was a type of classical music and dance performed at the royal court and temples in ancient China. The basic rules for yayue were set during the Western Zhou period. Along with laws and ceremonies, yayue represented the formal power of the aristocracy. During the Zhou dynasty, the word ya () was used for special songs used in the court and collected in the Shijing. Confucius mentioned yayue in his Analects, saying it was good and beneficial music, unlike the popular music from Zheng, which he thought was corrupt. In Confucianism, yayue is seen as beneficial and refined music that promotes self-improvement and symbolizes good governance. It includes solemn ceremonial music for the court and ritual music for temples, and in a broader sense, it can mean any refined Chinese music compared to popular music called suyue (俗樂) or \"uncultivated music,\" including music of the literati like qin music. Yayue has mostly disappeared from China, but there are modern efforts to recreate it. In Taiwan, yayue is still performed in Confucian ceremonies, and in China, a revived form is used for tourism. Similar music can be found in rest of East Asia, such as gagaku in Japan, aak in Korea, and nhã nhạc in Vietnam. While these countries use the same word (pronounced differently), their music might not be the same as Chinese yayue. The Korean aak, however, keeps some elements of Song dynasty yayue that are lost in China. ==History== According to tradition, yayue was created by the Duke of Zhou, who was asked to do so by King Wu of Zhou after he conquered the Shang. Yayue included elements of early Chinese folk music and religious traditions. Dance was an important part of yayue, with each piece often having a special ceremonial or ritual dance. The most important yayue pieces of the Zhou dynasty were the Six Great Dances, each linked to a legendary or historical figure: Yunmen Dajuan (雲門大卷), Daxian (大咸), Daqing (大磬), Daxia (大夏), Dahu (大濩) and Dawu (大武). Note some of alternate names given for these dances, such as Xianchi (咸池), Dashao (大韶), and Dazhang (大章) The Book of Rites describes many situations where yayue might be performed, including ceremonies for Heaven, Earth, gods, or ancestors. It was also used at diplomatic meetings, aristocratic archery contests, hunting trips, and after successful military campaigns. Yayue was formal and stately, meant to show the distinction of the aristocracy, and sometimes included lyrics, some of which are preserved in the Book of Songs. As the importance of ceremonies declined during the Spring and Autumn period, yayue also declined. Confucius lamented this loss, and Marquess Wen of Wei was said to prefer popular music over ancient court music. Yayue continued into the Qin dynasty, but some pieces were lost or changed by the Han dynasty. The Han dynasty included singing but no string instruments in yayue, while the Sui dynasty added string instruments. The Tang dynasty added popular music elements to yayue, but the main court music in Tang and Sui became yanyue, which was used for banquets. Yayue was then reserved for Confucian rituals in temples. During the Song dynasty, yayue gained importance again with significant development. A yayue orchestra then had over 200 musicians with many new instruments. Two important texts from this time are Zhu Xi's Complete Explanation of the Classic of Etiquette and Its Commentary and Chen Yang's Collection of Music. In 1116, Emperor Huizong sent 428 yayue instruments and 572 costumes to Korea, where elements of Song dynasty yayue are still preserved. Yayue continued to be used for imperial ceremonies and rituals until the end of the Qing dynasty. It was still performed in Confucian rituals in China until the Communist takeover in 1949, after which it disappeared. There has been a revival of yayue in Confucian rituals in Taiwan since the late 1960s and in mainland China since the 1990s. Research and reconstruction efforts have been made, such as a 2009 performance by Nanhua University's yayue music ensemble in Beijing. However, there are questions about the authenticity of these revivals, as modern instruments and substitutions are used, but some argue that music and dances have always evolved over time. ==Performance== The court yayue orchestra could be divided into two groups, representing yin and yang. The smaller group, called dengge, played on the terraces of a building, while the larger group, called gongxian, performed in the courtyard. The smaller group mainly used string instruments (like qin and se zithers) and wind instruments (like dizi and xiao flutes, and panpipes), along with singers. The larger group was mostly instrumental and had all types of musical instruments. The musicians were arranged in five directions in the courtyard: the center and the four points of the compass. Wind instruments were in the center, bronze bells and stone chimes (yuexuan) were at the sides, and drums were at the corners. At the front, two wooden instruments marked the beginning and end of a piece. The music in the courtyard praised heaven, and its size and setup changed based on the occasion. The \"inside\" music was used to honor the emperors and their ancestors. The music was usually slow and formal, with little rhythmic change. When sung, there might be four to eight beats per phrase, depending on the text. The courtyard music was accompanied by dances, with the number of dancers depending on the rank of the patron. The emperor could have up to 64 dancers in eight rows of eight, while a noble or chief minister might have 36 dancers in six rows of six, and a lesser officer even fewer (four by four or two by two). In Confucian rituals, the six-row dance was for Confucius's status, and later the eight-row dance was added when Confucius received more regal titles. The dances were either civil or military. In civil dance, dancers held a flute in their left hand and a feather plume in their right. In military dance, dancers held a shield in their left hand and a battleaxe in their right. ==Instruments used== Yayue music does not use just any kind of traditional Chinese musical instruments, but instead includes only a small selection, taken from the oldest ones, according to the eight categories of materials used in their construction.François Picard. La classification en huit matériaux des instruments en Chine. Études chinoises, XV N° 1–2, 1996, pp. 159–180 ===Silk (絲)=== *Gǔqín (古琴) – Seven-stringed fretless zither *Sè (瑟) – 25 stringed zither with moveable bridges (ancient sources say 13, 25 or 50 strings) ===Bamboo (竹)=== *Dízi (笛子) – Transverse bamboo flute *Xiāo (簫) – End-blown flute *Páixiāo () – Pan pipes *Chí (篪) – Ancient Chinese flute ===Wood (木)=== *Zhù (柷) – A wooden box that tapers from the bottom, played by hitting a stick on the inside, used to mark beats or sections *Yǔ (敔) – A wooden percussion instrument carved in the shape of a tiger with a serrated back, played by running a stick across it and to mark the ends of sections ===Stone (石)=== *Biānqìng () – A rack of 16 hung stone tablets (usually Nephrite) struck using a mallet ===Metal (金)=== *Biānzhōng (編鐘) – 16 gilt bronze bells hung on a rack, struck using a mallet *Fāngxiǎng () – A set of tuned metal slabs (metallophone) ===Clay (土)=== *Xūn (塤) – Ocarina made of baked clay ===Gourd (匏)=== *Shēng (笙) – A free reed mouth organ consisting of varying number of bamboo pipes inserted into a gourd chamber with finger holes *Yú (竽) – An ancient free reed mouth organ similar to the sheng but generally larger ===Hide (革)=== *Gǔ – (鼓) – Drum == References == Category:Chinese music Category:Music genres",
 "title": "Yayue"
}