{
 "id": "1129576",
 "text": "Govinda III's campaign in North India was fought between the Rashtrakuta Empire against the Gurjara Pratihara Empire and Pala Empire. In this campaign Govinda III, the ruler of the Rashtrakuta Empire led an campaign against the Nagabhatta II, the ruler of Gurjara Pratihara Empire and Dharmapāla, the ruler of Pala Empire. ==Background== In Northern India, the Pala Empire, under the rule of Dharmapala, was invaded by Nagabhatta II, who was the ruler of the Gurjara Pratihara Empire. Nagabhatta II succeeded in defeating Dharmapala and took control of Kannauj, even driving away Chakrayudha, who was Dharmapala's puppet. Govinda III took the opportunity in Northern India and led an expedition against Nagabhatta II, ruler of the Gurjara Pratihara Empire, and Dharmapala, ruler of the Pala Empire. ==Campaign== Govinda III sent his brother, Indra, to attack the Gurjara Pratihara Empire. Govinda III also ordered many of his generals to keep the other rulers of Kalinga, Vengi, Kosala, and Malva under control or subdue them. While on his mission to invade the heartland of the Gurjara Pratiharas, Indra advanced himself to the Doab and Kannauj to attack Nagabhatta II himself. In the end, Indra's army won the battle. The Baroda plate, issued by the son of Indra, says that Indra had defeated the lord of the Gurjaras, i.e., Nagabhatta II, single-handedly. Govinda III defeated the ruler of Chitrakut and then led an expedition against Nagabhatta II in the Doab region and won, thereby expanding the boundaries of his empire up to the Himalayas. Following Govinda III's victory, Nagabhatta II fled from the Doab region and escaped to Rajputana. Chakrayudha and Dharmapala, both submitted to Govinda III after his victory. Govinda III's Nesarika grant records his victory over Dharmapala, while the Sanjan plates say that both Dharmapala and Chakrayudha surrendered to Govinda III. Apart from the Palas and the Pratiharas, Govinda III also defeated other rulers in Northern India during the campaign, like the kingdoms of Odraka, Kosala, Kalinga, Vengi, Dahala, and Malava. These kingdoms, after being defeated, became his servants and were subjugated by him. == Aftermath == While Govinda III was away for his northern campaign, the southern Indian kings had formed an alliance against him, taking advantage of his absence. The North Indian campaign of Govinda III was simply an act of 'digvijaya'. Govinda III did not annex the territories of the Palas and Pratiharas, but he likely collected heavy tributes from them. After his northern expedition, Govinda III spent most of the rainy seasons at his capital, preparing for another campaign against the southern Indian rulers who formed an alliance against him. == Notes == == References == * * Category:Battles involving the Pala Empire",
 "title": "Govinda III's Campaign in North India"
}