{
 "id": "1129934",
 "text": "The is a list of winners of the Eurovision Song Contest from 1956 to the present day. == Winners by year == Year Country Song Artist \"\" \"\" \"\" \"\" \"Tom Pillibi\" \"\" \"\" \"\" \"\" \"\" \"\" \"Puppet on a String\" \"La La La\" Massiel \"\" Salomé \"Boom Bang-a-Bang\" Lulu \"\" \"\" \"All Kinds of Everything\" Dana \"\" Séverine \"\" \"\" \"Waterloo\" ABBA \"Ding-a-dong\" Teach-In \"Save Your Kisses for Me\" Brotherhood of Man \"\" \"A-Ba-Ni-Bi\" and the Alphabeta \"\" Milk and Honey \"What's Another Year\" \"Making Your Mind Up\" Bucks Fizz \"\" Nicole \"\" \"Diggi-Loo Diggi-Ley\" Herreys \"\" Bobbysocks! \"\" \"Hold Me Now\" \"\" \"Rock Me\" Riva \"\" \"\" Carola \"Why Me?\" \"In Your Eyes\" \"Rock 'n' Roll Kids\" and Charlie McGettigan \"\" Secret Garden \"The Voice\" \"Love Shine a Light\" Katrina and the Waves \"Diva\" Dana International \"Take Me to Your Heaven\" \"Fly on the Wings of Love\" Olsen Brothers \"Everybody\" , Dave Benton and 2XL \"I Wanna\" \"Everyway That I Can\" \"Wild Dances\" Ruslana \"My Number One\" \"Hard Rock Hallelujah\" Lordi \"\" \"Believe\" \"Fairytale\" \"Satellite\" Lena \"Running Scared\" Ell and Nikki \"Euphoria\" Loreen \"Only Teardrops\" \"Rise Like a Phoenix\" \"Heroes\" \"1944\" Jamala \"\" \"Toy\" Netta \"Arcade\" colspan=\"3\" \"\" Måneskin \"Stefania\" Kalush Orchestra \"Tattoo\" Loreen 2024 \"The Code\" Nemo 2025 \"Wasted Love\" JJ == Winners by country == Table key Inactivecountries which were in the contest in the past but did not appear in the most recent contest, or will not appear in the upcoming contest Ineligiblecountries whose broadcasters are no longer part of the EBU and are therefore ineligible to participate Formercountries which previously participated but no longer exist Wins Country Years 7 , , , , , , , , , , , , 5 , , , , , , , , , , , , , , , , 4 , , , 3 , , , , , , , , , , , , 2025 2 , , 1 † ‡ † ◇ 1969 is in italics to indicate the joint (four- way) win. == Gallery == === Performers === File:Lys Assia (1957).jpg|Lys Assia, winner of the inaugural 1956 contest for Switzerland. File:Eurovision Song Contest 1958 - Corry Brokken.png|Corry Brokken, winner of the 1957 contest for the Netherlands. File:Eurovision Song Contest 1958 - André Claveau.png|André Claveau, winner of the 1958 contest for France. File:Dam tot Dam race , Teddy Scholten in aktie, Bestanddeelnr 910-6304.jpg|Teddy Scholten, winner of the 1959 contest for the Netherlands. File:Jacqueline Boyer (1960).jpg|Jacqueline Boyer, winner of the 1960 contest for France. File:Jean- Claude Pascal 1945.pdf|Jean-Claude Pascal, winner of the 1961 contest for Luxembourg. File:Isabelle Aubret.jpg|Isabelle Aubret, winner of the 1962 contest for France. File:Jørgen & Grethe Ingmann.jpg|Jørgen & Grethe Ingmann, winners of the 1963 contest for Denmark. File:Gigliola Cinquetti (1966).jpg|Gigliola Cinquetti, winner of the 1964 contest for Italy. File:Eurovision Song Contest 1965 - France Gall.jpg|France Gall, winner of the 1965 contest for Luxembourg. File:Eurovision Song Contest 1965 - Udo Jürgens.jpg|Udo Jürgens, winner of the 1966 contest for Austria. File:Sandie Shaw 3.jpg|Sandie Shaw, winner of the 1967 contest for the United Kingdom. File:Spaanse zangeres Massiel, winnares Euro Song Festival tijdens opname in studio K, Bestanddeelnr 921-2648.jpg|Massiel, winner of the 1968 contest for Spain. File:Popzangeres Salome zal Spanje vertegenwoordigen op Euro Songfestival in Madrid, Bestanddeelnr 922-1722.jpg|Salomé, one of the four winners of the 1969 contest for Spain. File:Fanclub1965Lulu (cropped).jpg|Lulu, one of the four winners of the 1969 contest for the United Kingdom. File:Nationale finale van het Eurovisie Songfestival in Scheveningen, Lenny Kuhr zong, Bestanddeelnr 922-1416.jpg|Lenny Kuhr, one of the four winners of the 1969 contest for the Netherlands. File:Grand Gala du Disque in RAI Amsterdam. Frida Boccara, Bestanddeelnr 923-3017.jpg|Frida Boccara, one of the four winners of the 1969 contest for France. File:Eurovision Song Contest 1970 - Dana 1.jpg|Dana, winner of the 1970 contest for Ireland. File:Séverine - Un Banc... Une Arbre... Une Rue..., 1971 (cropped).jpg|Séverine, winner of the 1971 contest for Monaco. File:2010-10-03-quadriga-vicky- leandros2.jpg|Vicky Leandros, winner of the 1972 contest for Luxembourg. File:Anne-Marie David 2015 1094.jpg|Anne-Marie David, winner of the 1973 contest for Luxembourg. File:ABBA1974TopPop.jpg|ABBA, winners of the 1974 and 2005's 50th anniversary contests for Sweden. File:Popgroep Teach in van Schiphol naar Stockholm voor Eurovisie Songfestival, Bestanddeelnr 927-8106.jpg|Teach-In, winners of the 1975 contest for the Netherlands. File:Eurovision Song Contest 1976 rehearsals - United Kingdom - Brotherhood of Man 20.jpg|Brotherhood of Man, winners of the 1976 contest for the United Kingdom File:MarieMyriam.jpg|Marie Myriam, winner of the 1977 contest for France. |Izhar_Cohen, winner of the 1978 contest for Israel. File:Gali Atari.jpg|Gali Atari, winner (as part of Milk and Honey) of the 1979 contest for Israel. File:Eurovisie Songfestival 1980 ( Den Haag ) winnaar Johnny Logan in aktie, Bestanddeelnr 930-7803.jpg|Johnny Logan, winner of the 1980 and 1987 contests for Ireland. File:Bucks Fizz 1984.jpg|Bucks Fizz, winner of the 1981 contest for the United Kingdom. File:Nicole Hohloch.jpg|Nicole Hohloch, winner of the 1982 contest for Germany. File:Richard Herrey 001.jpg|Richard Herrey from Herreys, winners of the 1984 contest for Sweden. File:Bobbysocks.JPG|Bobbysocks!, winners of the 1985 contest for Norway. File:Sandra Kim.jpg|Sandra Kim, winner of the 1986 contest for Belgium. File:Céline Dion 2012.jpg|Celine Dion, winner of the 1988 contest for Switzerland. File:Emilija Kokić.jpg|Emilija Kokić, lead vocalist for the winning band Riva in 1989 for Yugoslavia. File:Toto Cutugno.jpg|Toto Cutugno, winner of the 1990 contest for Italy. File:Carola Häggkvist.jpg|Carola Häggkvist, winner of the 1991 contest for Sweden. File:Linda Martin 2013 01 (crop 2).jpg|Linda Martin, winner of the 1992 contest for Ireland. File:Niamh Kavanagh in Oslo 2010.jpg|Niamh Kavanagh, winner of the 1993 contest for Ireland. File:Secret Garden1.jpg|Secret Garden, winner of the 1995 contest for Norway. File:Eimear Quinn tijdens Het Grote Songfestivalfeest 2019.jpg|Eimear Quinn, winner of the 1996 contest for Ireland. File:Katrina and the Waves - Malmö 1988.jpg|Katrina and the Waves, winners of the 1997 contest for the United Kingdom. File:Dana International 2008 Eurovision.jpg|Dana International, winner of the 1998 contest for Israel. File:Charlotte Perrelli By Daniel Åhs.jpg|Charlotte Nilsson, winner of the 1999 contest for Sweden. File:Olsen Brothers.jpg|Olsen Brothers, winners of the 2000 contest for Denmark. File:Dave Benton.jpg|Dave Benton, winner (together with Tanel Padar and 2XL) of the 2001 contest for Estonia. File:Padar, Tanel 2011 240.jpg|Tanel Padar, winner (together with Dave Benton and 2XL) of the 2001 contest for Estonia. File:Maria Naumova 2.JPG|Marie N, winner of the 2002 contest for Latvia. File:Sertab Erener (cropped).jpg|Sertab Erener, winner of the 2003 contest for Turkey. File:Ruslana, 2009-05-09 (2).jpg|Ruslana, winner of the 2004 contest for Ukraine. File:Paparizou HBH Fruitea.jpg|Helena Paparizou, winner of the 50th contest, the 2005 contest, for Greece. File:MrLordi2013.jpg|Lordi, winner of the 2006 contest for Finland. File:Marija Šerifović.jpg|Marija Šerifović, winner of the 2007 contest for Serbia. File:Dima Bilan 2008 Eurovision 2.jpg|Dima Bilan, winner of the 2008 contest for Russia. File:Alexander Rybak at the Eurovision press conference.jpg|Alexander Rybak, winner of the 2009 contest for Norway. File:Lena Meyer-Landrut at PC after 2010 Eurovision 2.jpg|Lena, winner of the 2010 contest for Germany. File:Ell & Nikki - Azerbaijan (Eurovision Song Contest 2011) cropped 2.jpg|Ell and Nikki, winners of the 2011 contest for Azerbaijan. File:Loreen Eurovision 2012 winner.jpg|Loreen, winner of the 2012 and 2023 contests for Sweden. File:ESC2013 winner's press conference 06 (crop).jpg|Emmelie de Forest, winner of the 2013 contest for Denmark. File:ESC2014 winner's press conference 11 (crop).jpg|Conchita Wurst, winner of the 2014 contest for Austria. File:20150514 ESC 2015 Måns Zelmerlöw 5767.jpg|Måns Zelmerlöw, winner of the 2015 contest for Sweden. File:ESC2016 winner's press conference 02 (cropped).jpg|Jamala, winner of the 2016 contest for Ukraine. File:Salvador Sobral RedCarpet Kyiv 2017.jpg|Salvador Sobral, winner of the 2017 contest for Portugal. File:Netta (3) 20180508 EuroVisionary (cropped).jpg|Netta, winner of the 2018 contest for Israel. File:Duncan Laurence with the 2019 Eurovision Trophy.jpg|Duncan Laurence, winner of the 2019 contest for the Netherlands. File:Maneskin 2018.jpg|Måneskin, winners of the contest for Italy. File:Kalush Orchestra, May 2022.png|Kalush Orchestra, winners of the contest for Ukraine. File:Nemo Eurovision Song Contest 2024 Final Malmö dress rehearsal semi 2 07.jpg|Nemo, winner of the contest for Switzerland. == Related pages == * Eurovision Song Contest winners discography * List of Junior Eurovision Song Contest winners == Notes and references == === Notes === === References === === Other websites=== * Winners Eurovision Song Contest winners",
 "title": "List of Eurovision Song Contest winners"
}