{
 "id": "1129880",
 "text": "During the night of August 23, 2024, there was a man mass stabing of civilians in Solingen. A person killed three people with a knife. Eight others were wounded, five of these are in a critical condition. ==Overview== The attack occurred at a festival marking the 650th anniversary of the city of Solingen. The attack took place at about 9:40 PM local time, on a busy market square. DJ Topic, performing at the time of the attack, was asked by security to continue his set to prevent mass panic. After the stabbing, the festival was stopped. ==Background== Solingen lies between Düsseldorf and Cologne, in North-Rhine Westphalia. About 160,000 people live in the city. According to sources, the perpetrator was a man. He was armed with a knife, and aimed for the neck of the people. Two men, and one women were killed. Eight others were wounded, five of these are in a critical condition. After the attack, the perpetrator was able to flee. As there is no visible connection between the victims, the police suspect that this may have been a terrorist attack. The police also suspects that it was a single person who carried out the attack. ==Aftermath== ===Responses=== The German chancellor, Olaf Scholz, said that the perpetrator must be caught quickly and punished to fullest extent of the law. The Islamic State (ISIS) released a statement on the messaging app Telegram on 24 August claiming responsibility. However, there is no proof so far that the group is involved. ===Suspects=== A fifteen year-old teenager from Kyrgyzstan was arrested and questioned in connection with the events. The fifteen year old did not carry out the attack. People saw how the fifteen-year old talked to the attacker, shortly before the attack. On the day after the attack, police arrested the 26-year-old Syrian suspect Issa al H. He had presented himself to officers of a patrol car, and told them he had been the attacker. His clothes were bloody and dirty, sources say. He arrived in Germany in December 2022 and was granted protection after a year as a refugee. He is from Deir ez-Zor. He is a Sunni Muslim. Authorities had not suspected him of Islamist ties. ==References== Category:Solingen Category:2024 crimes in Europe Category:2024 in Germany Category:Crime in Germany Category:August 2024 events Category:Mass stabbings in Europe Category:History of North Rhine-Westphalia Category:Islamic terrorist incidents in Europe Category:Islamic terrorist incidents in the 2020s",
 "title": "2024 Solingen stabbing"
}