{
 "id": "112987",
 "text": "London Heathrow Airport, or Heathrow, is the main, and busiest airport serving the United Kingdom. Heathrow is also Europe's busiest airport for passenger traffic, and handles more international passenger traffic than any other airport in the world. Heathrow is owned and operated by BAA Limited, which also owns/operates six other UK airports and is itself owned by an international group led by the Spanish Ferrovial Group. Heathrow is the main hub of British Airways and Virgin Atlantic. Heathrow is in the London Borough of Hillingdon, west of Central London, England, Heathrow has two parallel main runways running east-west and five terminals. The site covers 12.14 square kilometres (4.69 square miles). Terminal 5 was officially opened by Queen Elizabeth II on 14 March 2008 and opened to passengers on 27 March 2008. Terminal 2 opened in 2014, and Terminals 3 and 4 will be refurbished during this period. In November 2007 a consultation process began for the building of a new third runway. Heathrow Airport has a CAA Public Use Aerodrome Licence (Number P527) that allows flights for the public transport of passengers or for flying instruction. == Runway use == Today, Heathrow airport uses two operation runways. These are: * Northern runway (09L/27R) * Southern runway (09R/27L). Currently, 1 runway is used for takeoff and another used for landing, depending on the approach path used at the time. Approaching planes are normally cycled between two options at 12 hour intervals in order to reduce noise and environmental impacts for residents. In the future, BAA are considering changing to \"Mixed mode\" where both runways are used for landing and takeoff. This would boost space. == Terrorism and security incidents == * On 8 June 1968, James Earl Ray, the man convicted of the assassination of Martin Luther King, Jr., was captured and arrested at Heathrow Airport while attempting to leave the United Kingdom on a false Canadian passport. * The Brink's-MAT robbery happened on 26 November 1983 when six robbersBrinks Mat gold: The unsolved mystery. BBC News broke into the Brink's-MAT warehouse at Heathrow Airport, London. At the time, it was described as \"the crime of the century\". Only a fraction of the gold was ever got back, and only two men were convicted of the crime, plus the 'inside man' who gave them access. * On 17 April 1986, semtex explosives were found in the bag of a pregnant Irishwoman attempting to board an El Al flight. The explosives had been given to her by her Jordanian boyfriend (and father of their unborn child) Nizar Hindawi. The incident became known as the Hindawi Affair. * On 21 December 1988, Pan Am Flight 103 from Heathrow to New York/JFK was blown up over Lockerbie, Scotland, killing all 259 on board and 11 other people on the ground. * In 1994, over a six-day period, Heathrow was targeted three times (8, 10, and 13 March) by the IRA, who fired 12 mortars. Heathrow was a symbolic target due to its importance to the UK economy, and much disruption was caused when areas of the airport were closed over the period. The importance of the incident was heightened by the fact that the Queen was being flown back to Heathrow by the RAF on 10 March. * In March 2002, thieves stole US$3 million that had arrived on a South African Airways flight. * In February 2003, the British Army was sent to Heathrow, along with 1,000 police officers, in response to intelligence reports suggesting that al-Qaeda terrorists might launch surface- to-air missile attacks at British or American airliners. * On 17 May 2004, Scotland Yard's Flying Squad foiled an attempt by seven men to steal £40 million in gold bullion and a similar quantity of cash from the Swissport warehouse at Heathrow. * On 10 August 2006, the airport caused changes in security, when a supposed al-Qaeda terrorist plot was uncovered. New security rules were put in force immediately, causing restrictions about carrying liquids on board flights. This caused longer queues and wait times at security. Restrictions included the prohibition of carry-on luggage (except essential items such as travel documents and medication) and all liquids – although this rule was later relaxed to allow the carrying on board of liquid medications and baby milk. == Cargo == Heathrow has had a large increase in cargo-only flights. Established carriers at the airport may have cargo-only flights using passenger aircraft. Also there are cargo-only airlines.\\- Heathrow News retrieved 20 January 2021 ==Rail links== ===Existing=== *Heathrow Express: a non-stop service direct to London's Paddington station. *TfL Rail: a stopping service to Paddington calling at up to five National Rail stations en route. Calls at Hayes & Harlington for connecting trains to Reading. *London Underground (Piccadilly line): four stations on this line serve the airport. ===Proposed=== * The Western Rail Approach to Heathrow is a proposed rail link which would create an additional connection between London's Heathrow Airport and the Great Western Main Line. The line would begin at Heathrow Terminal 5 and run, via a tunnel, to a junction east of Langley station. This would allow trains to run westwards towards and Slough. * Heathrow Airtrack is a proposed railway link in west London. The line was proposed by BAA and would run from Heathrow Terminal 5 into central London and across the suburbs of southwest London. In October 2011, Wandsworth Council announced a revised plan called Airtrack-Lite. * Heathrow Southern Railway is a proposed new railway up to 8 miles long. It would link Heathrow Terminal 5 with Chertsey or Virginia Water and Staines. The scheme was announced in August 2017. It is promoted by Heathrow Southern Railway Limited and is to be financed privately. * The Windsor Link Railway is a proposed new railway in Windsor, Berkshire. It would replace the two stations in Windsor with a single underground station and there would be an extension to Heathrow Airport. * A Light Rail Scheme has been proposed by Spelthorne Council. It would link a new station in Staines to Heathrow Airport. == References == Heathrow Category:London Borough of Hillingdon Category:Buildings and structures in London",
 "title": "Heathrow Airport"
}