{
 "id": "1129368",
 "text": "Yemi Emiko born on (12th April, 1958) is a Nigerian ,Politician and Businessman Chairman of Sica Intercontinental Ltd, and Chairman Dominion Shipping and Freight Ltd, Lagos State. == Early life and Education == Yemi Emiko born on 12th April 1958, he started his primary education at St. John's primary school, Warri and secondary school at Hussey College, Warri. He got degree in Mass Communication at the University of Nigeria, NSUKKA, Enugu State in 1983. He did his youth service with Rima radio Sokoto State from 1983 to 1984.. Prince Emiko was born to His Majesty Erejuwa II, who was Olu of Warri from 1951 to 1986, by Her Royal Highness, Olori Bokatsere Erejuwa, who hailed from Ekurede in Warri South local government area of delta state. == Career == Yemi Emiko started his career with the federal ministry of communications in Sokoto State. He worked with Bendel Television from 1985 to 1989. He then joined Chevron Corp in Nigeria, where he worked from 1989, opting for early retirement in 2007. He was the special adviser, planning and strategy to the Delta State Chairman of the Action Congress of Nigeria, (ACN) in 2011. He ran for election as the APC Senatorial Candidate for Delta South in the 2015 general elections in Nigeria. He served in the election planning and monitoring directorate of the APC campaign Council in 2019. And also served as the coordinator of the APC campaign for Delta South zone in 2023. He is a member of the Olu of Warri's advisory Council and he also recognised as a prominent Prince of Warri kingdom. Yemi Emiko is the chairman of Sica Intercontinental Ltd, Chairman of Dominion Shipping and Freight Ltd, and chairman of Eurowells Ltd. == Personal Life == Yemi Emiko is married to Kathy Emiko; they are blessed with children. He lost his 23 year old son to unknown gunmen in Houston, Texas, USA. He studied at Hussey College, Warri, and left there in 1975. He thereafter went to the Shell BP training school in Warri, and earned a certificate as a plant operator, before proceeding to the University of Nigeria in 1979. ==References== Category:1958 births Category:Living people Category:Nigerian politicians Category:Nigerian businesspeople",
 "title": "Yemi Emiko"
}