{
 "id": "112968",
 "text": "The Umayyad Caliphate (Arabic: الخلافة الأموية) also known as the Umayyad Empire, was the second of the four major Islamic caliphates established after the death of the Islamic prophet Muhammad. It was founded by Mu'awiya I, a companion of Muhammad. It was ruled by the Umayyad dynasty (, Banu Umayyah), an Arab dynasty who came from Mecca, in present-day Saudi Arabia. Damascus was their capital from 661–744, Harran from 744–750, and after the Abbasid revolution, Córdoba (756–1031) in Al-Andalus, where they established the Emirate of Córdoba (756-929) and then the Caliphate of Córdoba (929-1031), also known as the Second Umayyad Caliphate.AL-Ajmi, Abdulhadi, The Umayyads, in Muhammad in history, thought, and culture: an encyclopedia of the Prophet of God. 2 vols, edited by C. Fitzpatrick and A. Walker. Santa Barbara, ABC- CLIO, 2014. By the mid 8th century AD, the territories of the Umayyad Caliphate spanned across three continents (Asia, Africa, and Europe). The Umayyad Caliphate was the largest empire in the world at the time. It is the fifth largest empire in history.It is the third largest contiguous empire and the third largest empire by percentage of world population (33.5%) Some place the beginning of the Islamic Golden Age as early as the Umayyad Caliphate. == Origins == According to tradition, the Umayyad family (also known as the Banu Abd-Shams) and the Islamic Prophet Muhammad both have a common ancestor, Abd Manaf ibn Qusai. Muhammad descended from Abd Munaf via his son Hashim, the Umayyads descended from Abd Munaf via a different son, Abd-Shams. The two families are therefore considered to be different clans (those of Hashim and of Umayya, respectively) of the same Arabian tribe (that of the Quraish). The Umayyads and the Hashimites were bitter rivals. The rivalry came from the initial opposition of Abu Sufyan ibn Harb, the grandson of Umayya, to Muhammad and to Islam. He tried to get rid of the new religion by waging a series of battles. But eventually he accepted Islam, as did his son (the future caliph Muawiyah IMost historians consider Caliph Muawiyah I (661-80) to have been the second ruler of the Umayyad dynasty, as he was the first to assert the Umayyads' right to rule on a dynastic principle. Caliph Uthman (644-56) was also descended from Umayya, and during his time had been criticized for placing members of his family within political positions. But because Uthman never named an heir, he cannot be considered the founder of a dynasty.), and the two provided much-needed political and diplomatic skills for the management of the quickly expanding Islamic empire. The origins of Umayyad rule date back to the assassination of Uthman in 656. At this time Ali, a member of the Hashim clan and a cousin of Prophet Muhammad, became the caliph. He soon met with resistance from several factions, including the Uthmaniyya, and moved his capital from Medina to Kufa. The resulting conflict, which lasted from 656 until 661, is known as the First Fitna (\"time of trial\"). Ali was first opposed by an alliance led by Aisha, the widow of Muhammad, and Talhah and Al-Zubayr, two of the Companions of the Prophet. The two sides clashed at the Battle of the Camel in 656, where Ali won a decisive victory. When Ali was assassinated in 661, Muawiyah marched to Kufa. There he persuaded a number of Ali's supporters to accept him as caliph instead of Ali's son, Hasan. Then he moved the capital of the caliphate to Damascus. Syria would remain the base of Umayyad power until they established an emirate in Cordoba, which also became a world centre of science, medicine, philosophy and invention during the Islamic Golden Age. ==Related pages== * Muslim history * Uthmaniyya * Arabs == Notes == == References == * Previté-Orton, C. W (1971). The Shorter Cambridge Medieval History. Cambridge: Cambridge University Press. == Further reading == * G.R. Hawting, The first dynasty of Islam: the Umayyad caliphate, AD 661-750 (London, 2000). * H. Kennedy, The Prophet and the age of the caliphates: the Islamic Near East from the sixth to the eleventh century (London, 1986). == Other websites == * Ummayad Lineage Chart * Ummayads * Umayyads - First caliphate dynasty Category:Former countries in Africa Category:Al-Andalus Category:Former countries in Asia Category:Royal dynasties Category:660s establishments Category:750s disestablishments Category:7th- century establishments in Africa Category:Establishments in Europe Category:7th-century establishments in Asia Category:Disestablishments in Africa Category:Disestablishments in Europe Category:Disestablishments in Asia Category:Medieval Azerbaijan Category:History of North Africa Category:History of West Asia Category:Caliphates Category:Empires in Africa Category:Empires in West Asia Category:Empires in Europe",
 "title": "Umayyad Caliphate"
}