{
 "id": "1129564",
 "text": "Francesco \"Pecco\" Bagnaia (born 14 January 1997) is an Italian Grand Prix motorcycle racer competing in MotoGP for the Ducati Lenovo Team. He is the 2022 and 2023 MotoGP World Rider's Championship. Bagnaia, a 2018 Moto2 Champion, is the first VR46 Academy rider to win a premier class title. His 2022 victory was Ducati’s first in 15 years and the first for an Italian since Valentino Rossi in 2009. == Career == Bagnaia was born in Turin, Italy, and started riding Minimoto bikes as a child, winning the European MiniGP championship in 2009. In 2010, he made his debut in the pre-GP 125 Mediterranean championship with Monlau Competición, finishing as runner-up. In 2011, he raced in the Spanish 125cc Championship, winning a race and ending up third overall. In 2012, he competed in the CEV Moto3 season on a Honda NSF250R, finishing third in the championship with a race win and two second- place finishes. He joined the VR46 Riders Academy and is still a member. === Moto3 World Championship === Bagnaia made his Grand Prix debut in the 2013 Moto3 World Championship with Team Italia FMI but struggled throughout the season, failing to score points. In 2014, he joined Sky Racing Team by VR46 and showed improvement, finishing in the top 10 frequently despite missing races due to injury, ending the season 16th. In 2015, Bagnaia switched to Aspar Team on a Mahindra and achieved his first podium at Le Mans. Despite showing some progress, he ended the season 14th in the standings, with 76 points. In 2016, Bagnaia began strong with several podium finishes, including a win at Assen and Sepang. He had a competitive season, finishing 4th in the Moto3 Championship with 145 points, but missed out on a higher position due to crashes caused by Gabriel Rodrigo. === Moto2 World Championship === After spending four seasons in Moto3, Francesco Bagnaia moved to Moto2 with Sky Racing Team VR46 in 2017. During his rookie season, he quickly made an impact, finishing 2nd in his fourth race and securing multiple podiums throughout the year. He was named Moto2 Rookie of the Year and ended the season 5th in the championship with 174 points. In the following season, Bagnaia excelled, winning 8 races and finishing on the podium 12 times. He started the season with a win in Qatar and continued to dominate with victories in Austin, Le Mans, Assen, Austria, Misano, Buriram, and Motegi. His consistent performance and a championship-leading position led him to win the Moto2 World Championship. Bagnaia completed all 36 races he participated in and scored points in 34 of them, setting a notable 30-race point-scoring streak. === MotoGP World Championship === In 2019, Francesco Bagnaia moved to MotoGP with Pramac Ducati after a successful stint in Moto2. He struggled initially, retiring from the Qatar race and having mixed results in subsequent races. His best finish was 4th at Phillip Island, ending his rookie season 15th in the championship with 54 points. He missed the final race due to injury. In 2020, Bagnaia received an upgraded GP20 bike. Despite a challenging season affected by the COVID-19 pandemic, he showed promise with a 7th place finish in the season opener and a strong performance in Jerez, where he retired with an engine failure while in 2nd place. A leg injury at Brno sidelined him for several races, but he returned to achieve his first MotoGP podium with a 2nd place at Misano. However, he struggled in the latter part of the season, finishing 16th with 47 points. In 2021, Francesco Bagnaia joined the factory Ducati team alongside Jack Miller. He had a strong start to the season, earning his first MotoGP pole position in Losail and finishing 3rd in the race. He continued to perform well, securing podiums in Qatar, Portimao, and Jerez. Bagnaia achieved his first MotoGP win at Aragon, where he also set a track record. He followed this with another win in Rimini and continued his impressive form by securing multiple pole positions. Despite crashing out of the lead in Misano, which helped Fabio Quartararo clinch the championship, Bagnaia won in Portimao and Valencia. He ended the season 2nd in the championship with 252 points, 26 points behind Quartararo. In 2022, Francesco Bagnaia started the 2022 season with high expectations but faced a challenging beginning, including crashes and low finishes. After a disappointing start, he turned his season around with a series of dominant performances, winning four consecutive races at Assen, Silverstone, Red Bull Ring, and Misano. Despite a few setbacks, including crashes and a close second place in Aragón, Bagnaia closed the gap to championship leader Fabio Quartararo. He ultimately won his first MotoGP World Championship by overtaking Quartararo in the final races, completing the largest points overhaul in premier class history. In 2023 Bagnaia continued with Ducati, now with Enea Bastianini as his teammate. Throughout the season, he was in a tight championship battle with Jorge Martín. Despite the competition, Bagnaia maintained the lead and secured his second consecutive MotoGP World Championship, becoming the first Ducati rider to defend a championship title and only the third rider in the MotoGP era to win back-to-back titles. ==References== Category:Motorcycle racers Category:1997 births Category:Italian sportspeople Category:Living people",
 "title": "Francesco Bagnaia"
}