{
 "id": "1129580",
 "text": "Concerned is a webcomic that parodies the video game Half-Life 2. It was created by Christopher C. Livingston and ran from May 1, 2005, to November 6, 2006. The comic follows the story of a character named Gordon Frohman, who is an unlucky and clumsy person trying to survive in the chaotic world of Half- Life 2. == Background == The webcomic is set in the same universe as Half-Life 2, a first-person shooter game developed by Valve Corporation. However, instead of focusing on the serious and intense storyline of the game, Concerned uses humor to explore the world. The comic is made by taking screenshots within the game and adding funny dialogue and situations. == Plot == The main character, Gordon Frohman, is different from the game’s hero, Gordon Freeman. While Freeman is a skilled scientist and fighter, Frohman is incompetent and often makes bad decisions. He often finds himself in absurd and dangerous situations, mostly because of his own mistakes. Throughout the comic, Frohman tries to join the Resistance (the group fighting against the alien forces known as the Combine), but he usually ends up making things worse. Despite his many failures, Frohman remains optimistic and cheerful, which adds to the comic’s humor. == Style and Humor == Concerned is known for its clever use of the Half-Life 2 game world and its humorous take on the serious events of the game. The comic often pokes fun at video game logic, like why NPCs (non-playable characters) behave in certain ways or why some game environments don’t make sense in real life. == Popularity and Impact == Concerned became quite popular among fans of Half-Life 2 and the gaming community. Many readers appreciated the comic for its witty humor and the way it creatively used the game’s assets. The comic’s entire run consists of 205 episodes, and it was concluded with a final strip in November 2006. Even though it has been years since the comic ended, Concerned is still remembered by many gamers as a classic parody of the Half-Life series. == Legacy == Christopher C. Livingston, the creator of Concerned, went on to work on other projects after finishing the comic. However, Concerned remains his most well- known work. The comic is still available online for new readers to enjoy, and it serves as an example of how video games can be used creatively in webcomics. == Other websites == * Official Website Category:Fan fiction Category:Parodies Category:Webcomics Category:Half-Life",
 "title": "Concerned"
}