{
 "id": "1129920",
 "text": "John William Wactor III (August 31, 1986 – May 25, 2024) was an American actor. He is known for playing Brando Corbin on the television series General Hospital and Johnny on the NBC television series Siberia. He also had roles in the television series Army Wives and the movies USS Indianapolis: Men of Courage and Supercell. Wactor was killed in downtown Los Angeles, at the age of 37. == Life == John William Wactor III was born on August 31, 1986, in Charleston, South Carolina. He has two brothers, Lance and Grant. He grew up in Summerville, South Carolina, where he graduated from Summerville High School in 2004. Wactor then graduated from the College of Charleston in May 2009 with a Bachelor of Science in business administration and a Bachelor of Arts in Spanish. == Career == Wactor moved to Los Angeles to work as an actor. He made his television debut in 2007 with Army Wives. Wactor played Brando Corbin in the series General Hospital in 164 episodes from 2020 to 2022. He also played Johnny in the television series Siberia, and had roles in the movies USS Indianapolis: Men of Courage and Supercell. Wactor had a voice acting role in the video game Call of Duty: Vanguard. == Murder == After finishing his bartending job, Wactor was gunned down in downtown Los Angeles on May 25, 2024, when he saw three men trying to steal a catalytic converter from his Toyota Prius. His funeral was held at the Summerville Baptist Church in Summerville, South Carolina, on June 16, 2024, three weeks after he was killed. On August 15, 2024, four people were arrested in connection with Wactor's murder. Four days later, prosecutors charged two men with ties to a South Los Angeles street gang, with Wactor's murder. Two other men were charged with lesser crimes. == Filmography == === Movies === Year Title Role Director(s) Notes 2010 The Grass Is Never Greener Johnny Alex Vivian Short movie Lover's Speed Johnny Candace Infuso Short movie 2011 GoldenBox Tucker Matt MacDonald Short movie Snap Judgment Orderly Trevor Erickson Roundhay Hall Ethan Rob Wood Short movie Synchronicity Kevin Monique Thomas Short movie 2012 The Con-Artist Journalist Luis F. Pazos Short movie The Proposal Bobby Jason Federici Short movie Mr. and Mrs. Kill Eloped Husband Doc Vidal, Ryan Kibby Short movie: Voice role 2014 Menthol John Micah Van Hove Ever John Josh Beck Life, Perfected Howie Tyler Seiple Short movie 2015 Flyover States Mike Alexander Malt Short movie A Most Suitable Applicant Johnny Baker Krystal White Short movie 2016 The Interrogation Troy Michael B. Silver Short movie USS Indianapolis: Men of Courage Connor Mario Van Peebles 2017 F***, Marry, Kill Jacob Scott Donovan Short movie 2018 Cold Soldiers Orderly Nick Smith Boy Crazy Troy Tessa Farrell Short movie 2019 Anything for You, Abby Tom Jamin Bricker Short movie 2020 The Relic Marcus J.M. Logan Short movie 2022 Broken Riders Moxin Robert Benson Short movie 2023 Trapper's Edge Billy Johnny Hickey, Jimmy Scanlon Supercell Martin Herbert James Winterstern 2024 Dead Talk Tales: Volume 1 Marcus John Vizaniaris === Television series === Year Title Role Notes 2007–2009 Army Wives Airman Byers, PFC Kantor, Soldier 3 episodes 2010–2016 Hollywood Girl Shane Hudson 8 episodes 2013 Siberia Johnny 11 episodes 2015 Agent X John's Father Episode: \"Truth, Lies and Consequences\" 2016 Vantastic Beyanna BamBam 3 episodes Animal Kingdom MP #1 Episode: \"Man In\" 2017 Training Day Greg Episode: \"Code of Honor\" Criminal Minds Trey Gordon Episode: \"In the Dark\" Sisters of the Groom Tim Television movie Struggling Servers Actor Episode: \"The Move\" 2017–2018 Age Appropriate Jake 3 episodes 2018 Disillusioned Jared Television movie 2019 NCIS Navy Lieutenant Ross Johnson Episode: \"The Last Link\" The OA EMT 2 Episode: \"Angel of Death\" 2020 Westworld Gunny Thompson 2 episodes The Passenger Horace Parker 3 episodes 2020–2022 General Hospital Brando Corbin 164 episodes 2023 Station 19 Lt. Cooper Episode: \"Even Better Than the Real Thing\" Barbee Rehab Star Trek Ken 7 episodes === Video games === Year Title Role Notes 2021 Call of Duty: Vanguard Additional Voice Voice role == References == == Other websites == * * Category:1986 births Category:2024 deaths Category:21st-century American actors Category:American movie actors Category:American television actors Category:American voice actors Category:American video game actors Category:Soap opera actors Category:Actors from Charleston, South Carolina Category:Murdered actors Category:Murders by firearm in California",
 "title": "Johnny Wactor"
}