{
 "id": "1130487",
 "text": "Crash is Charli XCX's fifth studio album. The album contains singles like \"Good Ones\", \"New Shapes\" featuring Christine and the Queens and Caroline Polachek, \"Beg for You\" featuring Rina Sawayama, \"Baby\", \"Every Rule\" and \"Used to Know Me\". ==Accolades== Since the album's release, Crash has been named by several magazines as one of the best albums of 2022. Commercially, it is Charli XCX's best-selling record, being one of the UK's best-selling vinyl and cassette records. Year-end rankings for Crash Publication List Rank Rolling Stone The 100 Best Albums of 2022 Loud and Quiet Albums of the Year 2022 The Line of Best Fit The Best Albums of 2022 Ranked Vulture The Best Albums of 2022 (So Far) The Forty Five Albums of the Year 2022 Pitchfork The 50 Best Albums of 2022 NME NMEs 50 Best Albums of 2022 DIY DIYs Albums of 2022 Nylon Magazine Nylons favorite albums of 2022 Billboard The 50 Best Albums of 2022: Staff List Slant Magazine The 50 Best Albums of 2022 The Fader The 50 Best Albums of 2022 Esquire The 25 Best Albums of 2022 The Independent The best albums of 2022 Gorilla vs. Bear Gorilla vs. Bears albums of 2022 MondoSonoro Los 50 mejores discos internacionales de 2022 PopMatters The 80 best albums of 2022 Dazed The 20 best albums of 2022 Insider The best albums of 2022 Gigwise Best Albums of 2022 The Guardian The 50 best albums of 2022 Under the Radar Under the Radars Top 100 Albums of 2022 Part 1 The Vinyl Factory Our favourite albums of 2022 Ones to Watch The 25 Best Albums of 2022 === Awards for Crash === Awards and nominations for Crash Award Year Category Result Gold Derby Music Awards 2023 Best Pop Album ===Ranking of Crash songs=== Year-end rankings for \"Constant Repeat\" Publication List Rank Pitchfork The 100 Best Songs of 2022 The New York Times Best Songs of 2022 Year-end rankings for \"Yuck\" Publication List Rank DIY Magazine DIYs Tracks of 2022 Insider The best songs of 2022 Gigwise 22 Best Tracks of 2022 Nylon Magazine Nylons Favorite Songs of 2022 Year-end rankings for \"Lightning\" Publication List Rank I-D Magazine The 100 best songs of 2022 Brooklyn Vegan Best songs of 2022 Gorilla vs. Bear Gorilla vs. Bears songs of 2022 Year-end rankings for \"Used to Know Me\" Publication List Rank Billboard The 50 Best Dance Songs of 2022: Staff Picks == Track listing == Notes * signifies an additional producer. * \"Beg for You\" contains samples of \"Don't Cry\" by Milk Inc. and \"Cry for You\" by September. * \"Used to Know Me\" contains samples of \"Show Me Love\" by Robin S. * \"How Can I Not Know What I Need Right Now\" contains samples of \"Saturday Love\" by Cherrelle and Alexander O'Neal. == Personnel == === Musicians and vocals === * Charli XCX – vocals * George Daniel – vocal chops, drums, bass programming , synth and keys programming * Waylon Rector – guitar * A. G. Cook – programming, synths * Christine and the Queens – vocals * Caroline Polachek – vocals * Deaton Chris Anthony – additional vocals, synths, keyboard programming, bass programming, instrumentation , drum programming * Lotus IV – drum programming, instrumentation , keyboard programming, bass programming * Caroline Ailin – background vocals * Oscar Holter – programming, drums, bass, keys * Rina Sawayama – vocals * Sorana – additional backing vocals * Sadpony – synths, bass, drum programming * Justin Raisen – guitar, FX * Ariel Rechtshaid – drum programming, synths, nylon guitar * Jon Shave – keyboards, programming * Darryl Reid – keyboards, programming * Noonie Bao – percussion === Technical === * Geoff Swan – mixing * Niko Battistini – mix assistance * Matt Cahill – mix assistance * A. G. Cook – engineering * Randy Merrill – mastering * Serban Ghenea – mixing * Bryce Bordone – mix assistance * Lionel Crasta – bridge vocals engineering * John Hanes – engineering * Oscar Holter – engineering * Thomas Warren – engineering * Kevin Grainger – mixing * Alexander Soifer – additional vocal production * Ben Hogarth – vocal engineering * Jonathan Gilmore – vocal production & engineering for Rina Sawayama * Anthony Tucci Jr. – Charli vocal recording * Manny Marroquin – mixing * Ian Kirkpatrick – recording * Ainjel Emme – assistant engineering * Anthony Paul Lopez – engineering * Justin Raisen – engineering * Sadpony – engineering * Rami Yacoub – vocal recording * Matt DiMona – engineering * Matt Cohn – engineering * Jon Shave – engineering * Darryl Reid – engineering * Lou Carrao – engineering * Oli Jacobs – mixing ==Charts== Chart performance for Crash Chart (2022) Peak position Croatian International Albums (HDU) 8 Greek Albums (IFPI) 15 Japanese Download Albums (Billboard Japan) 48 Lithuanian Albums (AGATA) 36 == Certifications == ==Release history== Release dates and formats for Crash Region Date Format(s) Version Label Various 18 March 2022 Standard Crash release formats: # # # # 25 March 2022 Deluxe Japan 30 March 2022 CD Standard Warner == References == Category:2022 albums Category:Charli XCX albums",
 "title": "Crash (Charli XCX album)"
}