{
 "id": "1130740",
 "text": "The sky-blue poison frog (Hyloxalus azureiventris) is a frog. It lives in Peru. ==Body== The adult frog is about 27 mm long from nose to rear end. The frog's skin is black with bright yellow and blue-green marks to tell other animals that the frog is poisonous. There are yellow stropes from the nose over the eyes to the back legs. There are more yellow stripes from the nose to the front legs. The tops of the back, front legs, and back legs have blue- green patterns. The sides of the body are black in color, and all four legs have bright blue marks. ==Home== This frog lives in forests. People have seen this frog in caves and near piles of rock. Sometimes people see young frogs on dead leaves on the ground. Scientists do not know if this frog can live in place that humans have changed. People have seen this frog between 200 and 1200 meters above sea level. This frog lives in at least one protected park: Cordillera Escalera Regional Conservation Area. ==Young== When the day begins to end the male frogs sit on the rocks or in cracks in the rocks and call to the female frogs. The female frog lays her eggs in water in coconut skin, on the dead leaves on the ground, or in bromeliad plants. She lays 12-16 eggs at a time. The male frog watches the eggs. After they hatch, he carries the tadpoles to water. The tadpoles can swim in streams, in water in palm tree leaves on the ground, or in water in other plants on the ground. The tadpoles can be 11.5 mm long. The end of the tail is round. It has five rows of teeth, two on top and three on the bottom. The tadpoles are dark gray in color. ==Danger== Scientists say this frog is in danger of dying out. It is in danger because people change the places where it lives to farms, do things for fun, and other things. People sometimes sell this frog as a pet, but because it can have tadpoles in when living with humans, this is not against the law. ==References== Category:Frogs of South America",
 "title": "Hyloxalus azureiventris"
}