{
 "id": "1130287",
 "text": "Emily Mahin Beihold (; born January 21, 1999) is an American singer and songwriter. She let out her debut EP Infrared in 2017. In 2020, she was seen by music promotion brand Live2 LCC. They teamed up with her to help support music going forward. After signing to Republic Records and Moon Projects, she let out her major-label debut single \"Numb Little Bug\" in 2022. It made her famous. On July 22, 2022, Beihold let out her second EP, Egg in the Backseat. == Early life and education == Emily Beihold was born on January 21, 1999, in Los Angeles, California. Her mother came in from Iran to the United States during the Iranian Revolution. At the age of six, Beihold began to play the piano when she saw it in a shop window. She begged her parents to let her learn to play the piano. She began writing songs at the age of seven. When she was seven years old, Beihold wrote her first song, a patriotic song called \"America Home\". In 2017, Beihold went to the University of California, San Diego where she was in NCAA Fencing and got NCAA All-American Honors in 2019. == Career == In the film I'm Not Here, director Michelle Schumacher invited Beihold to write a track for the film. She wrote the song called \"Not Who We Were\". She let out singles after that and got attention on the social media platform TikTok for her song \"City of Angels\". On May 28, 2021, Beihold let out her song \"Groundhog Day\". It also got popularity through TikTok. She was signed on to Republic Records. With them, she let out her most successful single called \"Numb Little Bug\". In May 2022, Beihold let out the single \"Too Precious\". On July 22, 2022, she let out her second EP, Egg in the Backseat. The song went through themes of her mental health problems and her relationships. On July 27, 2022, she signed to Sony Music Publishing. Beihold began touring in 2022, and opened for King Princess, AJR, and the Jonas Brothers. In 2023, she opened for Lewis Capaldi. In 2024, she went on the Maybe Life Is Good Tour, which was her first tour as a headlining act. == Musical role models == Beihold said that Queen and Regina Spektor were her role models. She grew up listening to Feist, Fiona Apple, Kate Nash, Sara Bareilles, and Lily Allen. == Discography == === Extended plays === List of EPs, with selected details Title EP details Infrared * Released: May 11, 2017 * Label: Self-released * Formats: Digital download, streaming Egg in the Backseat * Released: July 22, 2022 * Label: Republic * Formats: Digital download, streaming, LP === Singles === Title Year Peak chart positions Certifications Album US AUS Peaks in Australia: * \"Numb Little Bug\": * \"Until I Found You\": CAN NZ UK WW \"Infrared\" 2018 — — — — — — Infrared \"Blink of an Eye\" 2019 — — — — — — rowspan=\"7\" \"Forgive Yourself\" 2020 — — — — — — \"City of Angels\" — — — — — — \"Painful Truth\" — — — — — — \"Drive by Lovers\" 2021 — — — — — — \"Nobody Else\" — — — — — — \"Groundhog Day\" — — — — — — \"Numb Little Bug\" 2022 18 31 44 31 25 40 * RIAA: Platinum * BPI: Gold * MC: Platinum Egg in the Backseat \"Too Precious\" — — — — — — \"Until I Found You\" — 8 — 13 — — * ARIA: 6× Platinum * RMNZ: 2× Platinum \"Roller Coasters Make Me Sad\" 2023 — — — — — — rowspan=\"2\" \"Pedestal\" — — — — — — \"Fantasy\" — — — — — — Mirror \"Phone\" — — — — — — rowspan=\"3\" \"House on a Hill\" — — — — — — \"Maybe Life Is Good\" 2024 — — — — — — == Notes == == Related pages == * Singer * Songwriter * Numb Little Bug == References == == Other websites == * Category:1999 births Category:Living people Category:Singer-songwriters from California Category:American pop singers Category:Singers from Los Angeles Category:21st- century American singer-songwriters Category:American child singers Category:American pianists Category:American guitarists",
 "title": "Em Beihold"
}