{
 "id": "1130228",
 "text": "Catwalk Entertainment is a modeling agency in Taiwan, founded by Taiwanese fashion figure Hung Wei-ming in 1997. In 2000, it branched out into entertainment agency, and in 2007, it held its first talent show, the \"Catwalk Dream Star\". == Catwalk Entertainment Services == Since its founding by Hung Wai-ming in 1986, the company has sparked a supermodel craze and driven trends with its professional qualities and elite team. Notably, the first open talent show competition, \"Dream Star,\" launched in 2007, successfully attracted attention as a platform for cultivating new talent. Well-known celebrities and models such as Lin Chi-ling, Bianca Bai, Sui Tang, Xu Weining, Chen Tingni, Zheng Yuanchang, Ethan Ruan, Fann Wong, and Li Mingshun all come from the Catwalk family. In 2018, Felix Wu, CEO of Seed Music Group, joined the team to develop a new vision, expand with new offices in Beijing and Xiamen, and collaborate with renowned film companies in the industry. The business now spans model and artist management, fashion show and event planning, integrated creative styling, public relations execution, brand marketing consulting, and more, establishing a comprehensive presence in fashion, film and television, music, and cultural creativity. === Casting audition === In addition to having abundant model resources, Catwalk have numerous contracted models, actors, and artists, along with many years of casting experience. Catwalk source a diverse range of actors, models, and performers for various film and television productions, advertising shoots, brand launches, and commercial performances. Catwalk maintain strong cooperative relationships with many brands and provide the most professional and high-quality casting services. === Makeup and hair === With many years of experience collaborating with stylists, Catwalk Entertainment has created exclusive looks for numerous well-known models and artists. The company also provides professional styling services for various advertising shoots, print campaigns, music video productions, events of all sizes, and brand launches. == Creative team == The creative production team at Catwalk has many years of experience in event management. Their creativity stems from a deep understanding of customer needs and market trends, combined with extensive industry experience and innovation. They deliver creative, personalized, and high-quality event planning tailored to the unique tone of each brand. Whether it's stage design, performance structure, styling for event performances, or guiding the movements of models on the catwalk, Catwalk provides expert guidance in every detail. Show Director Bigi Yang Amanda Wang Alan Lee Benny Fu === Live point resume === * TAIPEI FASHION WEEK SS24 * APUJANAutumn Winter 2023 * Adidas Asia Pacific & Greater China Order Fair Opening Show * adidas 2024 SS trade show * The North Face FW24 order meeting opening show * JNBY 23AW * LESS 23AW * Bosideng recreates the classic snow house show * China's Best Down Show in Altay Snow Mountain * Converse Sportchella Fashion Show * Kimberley Diamond 23rd Anniversary Celebration * MG LAUNCH * Marie Claire 10th Anniversary Super Celebration * Zhuben·China's Unloading Dream·Sailing Chapter and 2023 New Product Launch Conference * Martell [Life is a Flight] 2024 Flying Night opens with glory * Qiaofu Grassland VIP Night * Walt Disney Company Greater China 2024 Consumer Products Division Kick-off Conference * 2023 Sophia Wedding Dress Shanghai Order Fair == Artists == === Male artists === Male Artist Li Mingshun Li Mingzhong Zhuang Kaixun Lin Boyui Liu Jingyu Fukuchi Yusuke Lin Hui-hong Wang Tingxun You Ziyi Qiu Chonghan Zhou Ziyi Suzuki Yuki Zhang Zhenxuan Mao Huafeng === Female artists === Female Artist Fann Fong Zhang Rongrong Lei Jiali Liao Yixuan Zheng Jiayu Yao Yishan Kim Yoo Lu Jiaxin Wang Xintian Jiang Ping Lin Weiting Pan Yuxuan Pan Xingyu Gao Yuchen Michelle Reis === Collaborating artists === Wang Yangming Zhang Liang Wang Hedi Peng Guanying Ren Xianqi Li Caihua Jiang Xin Guli Nazha Liu Tao Lin Chi-ling == Film and TV investment == The Catwalk Group has invested in numerous films and TV series, such as *When Will You Move Out of My Home*, *The Unknown River*, *The Battle of the Chaos World*, *The Iron Monkey: The Desperate Thunder*, *The Iron Monkey 2: Dawn of War*, *The Strongest Iron-Blooded Dad*, and *The Demon Queen of the Yangtze River*. === Some of our past investment projects === * Classmate, when will you move out of my house? * Bloodbath in the Nameless River * Fighting the chaos * Iron Monkey: Desperate Thunder * Iron Monkey 2: Dawn of War * The Strongest Iron- Blooded Dad * Yangtze River Enchantress * Both! Only children make choices! == Partner brands == * Louis Vuitton * Dior * Gucci * Fendi * Chanel * Hermès * Burberry * Nike * adidas * Puma == Annual Awards == === Cleveland Drama === 2007 * Lin Chi-ling was nominated for the 13th China Huabiao Awards for Outstanding Overseas Chinese Actress and the 28th Hong Kong Film Awards for Best New Actor for her film Red Cliff. 2010 * Chuang Kai-hsun was nominated for the 49th Golden Horse Awards for Best Supporting Actor for his film Birds of the Year. * Christopher Lee was nominated for the 47th Golden Bell Awards for Best Actor in a Television Film for his film Forgotten. * Cheng Yuan-chang won Best Actor in a Television Series in Taiwan at the 14th Global Chinese Chart Awards and Asian Influence Awards. * Ethan Ruan won the 47th Golden Horse Awards for Best Actor for his film Monga. * Bianca Bai was nominated for the 45th Golden Bell Awards for Best Actress in a Drama Program for her film Bright Days. 2011 * Ethan Ruan was nominated for Best Actor at the 5th Asian Film Awards for his film *Monga*. 2012 * Chen Tingni won the 1st Chinese Drama Awards for Best Actress for her films *True Love Now* and *True Love Trouble*. 2013 * Chen Tingni won the Best Actress Award at the 2nd Chinese Drama Awards for her role in *The Legend of Zu*. 2014 * Christopher Lee was nominated for the 49th Golden Bell Awards for Best Actor in a Drama Program for his performance in *Go Go Squid!*. 2015 * Chuang Kai-hsun won the 50th Golden Bell Award for Best Actor in a TV Film for his role in the PTS Lifetime Drama *On the Way Home*. * Hsu Weining won the 50th Golden Bell Award for Best Supporting Actress in a Drama Series for her role in *16 Summers*. 2016 * Chuang Kai-hsun won the Best Supporting Actor award at the 18th Taipei Film Festival for *The Rookie*. * Chen Ting-ni was nominated for the Best Newcomer award at the 52nd Golden Horse Awards for *The Little Girl in Red*. * Xu Weining was nominated for the Best Actress award at the Golden Horse Awards for *The Little Girl in Red*, and won the Best Actress award at the 18th Taipei Film Festival for *The Little Girl in Red* and *End of the Century*. 2017 * Christopher Lee won the 52nd Golden Bell Award for Best Actor in a Miniseries/TV Movie for his role in *The Farewell*. * Chuang Kai-hsun was nominated for Best Actor at the 19th Taipei Film Festival for his role in *Witness*. * Chen Ting-ni was nominated for the 52nd Golden Bell Award for Best Actress in a Miniseries/TV Movie for her role in *The Farewell*. 2019 \\- Li Mingzhong was nominated for Best Supporting Actor at the 21st Taipei Film Awards for *The Outlaws*. \\- Fann Wong was nominated for Best Actress at the 25th Star Awards for *The Intruder*. 2021 \\- Christopher Lee won the 56th Golden Bell Award for Best Actor in a Miniseries or TV Film for his role in *Working Man*. 2022 \\- Li Mingshun won the 57th Golden Bell Awards for Best Supporting Actor in a Drama Program for *The Adversary*. \\- Lei Jiayu was selected as the Outstanding Newcomer at the Taipei Film Festival. \\- Fann Wong was nominated for Best Actress at the 59th Golden Horse Awards for *Flower Road Ajumma* and won Best Actress at the 8th Asian International Film Festival. 2023 \\- Li Mingzhong was nominated for Best Actor in a Drama Program at the 58th Golden Bell Awards for *Taiwan Crime Story* - *Life and Death Dilemma*. \\- Zhuang Kaixun was nominated for the Mini Series (TV Movie) Actor Award for *Extra Journey*. \\- Huang Peiqi was nominated for the Most Promising Newcomer Award for *Sisters*. \\- Lin Yujia won Best Actor at the 10th Taoyuan Film Festival for *Bridget Boys*. 2024 \\- Li Mingzhong was nominated for Best Actor at the 28th Asian Television Awards for *Taiwan Crime Story* - *Life and Death Dilemma*. He won Best Actor at the Asian Film Festival in Rome, Italy for *(True) New Day*, was nominated for Best Actor at the 26th Taipei Film Awards for *(True) New Day*, and was also nominated for Best Supporting Actor at the 26th Taipei Film Awards for *Boys and Girls*. \\- Fukuchi Yusuke was nominated for Best Actor at the 2024 New York Television Awards for *Last Madame: Sisters of the Night*. \\- Hong Huifang was nominated for Best Supporting Actress at the 29th Star Awards 2024 for *Golden Tower*. \\- Lin Yujia was selected as the Very Newcomer at the Taipei Film Festival. == References == == Other websites == * CatWalk （中文） （英文） * * * * * Taiwan company information Category:Modeling agencies Category:Companies of Taiwan Category:1997 establishments in Asia",
 "title": "Catwalk Entertainment"
}