{
 "id": "1130931",
 "text": "The Securities and Exchange Commission (Filipino: Komisyon sa mga Panagot at Palitan; SEC) is the government agency of the Philippines that registers and supervises of corporations and securities, as well as capital market institutions and participants in the Philippines. The SEC promotes investor protection in the Philippines as part of its mandate and operated under the Department of Finance. SEC is headquartered at 7907 Makati Avenue, Barangay Bel-Air, Makati. It has ten extension offices located in Baguio, Tarlac, Legazpi, Iloilo, Bacolod, Cebu, Tacloban, Cagayan de Oro, Davao, and Zamboanga. == History == The SEC was started on October 26, 1936, by virtue of Commonwealth Act No. 83, or the Securities Act, in order to protect public interest because of a local stock market boom. It was created just two years after the United States Congress created their own SEC. The SEC started working on November 11, 1936, with Ricardo Nepumoceno as its first commissioner. It dealt with the registration of securities, analysis of registered securities, evaluation of the financial status of securities and operations of people for security issuances, applicant screening for licenses, and supervision of stock and bond brokers, and stock exchanges. The SEC was abolished when Japan occupied the Philippines and replaced by the Philippine Executive Commission. It restarted in 1947 with the restoration of the Commonwealth Government. President Marcos reorganized the SEC on September 29, 1975. Under Presidential Decree No. 902-A, the Commission shall have absolute jurisdiction, supervision and control over all corporations, partnerships or associations, who are the grantees of primary franchise and/or a license or permit issued by the government to operate in the Philippines. In 1981, the SEC was expanded with two more commissioners and two departments–one for prosecution and enforcement, and another for supervision and monitoring. In 2000, the SEC was reorganized, as Republic Act (RA) No. 8799, or the Securities Regulation Code, gave greater focus on the Commission’s role in developing the capital market, fostering good corporate governance and enhancing investor protection. Category:1936 establishments Philippines",
 "title": "Securities and Exchange Commission (Philippines)"
}