{
 "id": "113092",
 "text": "Gilgit Baltistan (), previously known as the Northern Areas, is the northern- most autonomous territory of Pakistan. In terms of land area it is bigger than Sierra Leone but smaller than Panama. It was part of the former Princely state of Kashmir and Jammu in 1800s and later leased to British eventually liberated after a planned liberation movement led by Gilgit Scouts. It borders Azad Jammu and Kashmir in the south, Indian-administered Kashmir in the southeast, where the KPK province of Pakistan to the west, and internationally borders Afghanistan to the north. However, Tajikistan is separated by fourteen kilometers via Wakhan Corridor, the People's Republic of China to the northeast. Gilgit Baltistan, which became a single administrative unit in 1970, was formed from the amalgamation of the Gilgit Agency, the Baltistan District of the Ladakh Wazarat, and the states of Hunza and Nagar. Gilgit Baltistan remains part of the Kashmir dispute. The Government of Pakistan since 1947 Independence regards the entire area of Jammu and Kashmir as \"Territory in dispute\" to be resolved by a Plebiscite to be held throughout the former state to determine the area's final accession to either India, or the neighboring country of Pakistan. Gilgit Baltistan is governed by a governor and a chief minister, with the latter being elected by the legislative assembly. Gilgit Baltistan covers 72,971 km² (28,174 mi²) and is very mountainous. It had an estimated population of 1.8 million in 2015. Its capital city is Gilgit, and the largest city is Skardu. The region is home to five of the 14 eight-thousanders, including K2 (\"National Mountain\"). Three of the world's longest glaciers outside of Earth's polar regions are found in Gilgit-Baltistan. The main tourism activities are trekking and mountaineering. Much of the population of Gilgit-Baltistan reportedly wants the territory to become integrated with Pakistan proper as a Fifth province, and opposes integration with the rest of the Kashmir region. The Pakistani government had rejected calls from the territory for Provincial status on the grounds that granting such a request would jeopardise Pakistan's demands for the entire Kashmir conflict to be resolved according to UN mediation of the Kashmir dispute. However, in November 2020, former Pakistani Prime minister Imran Khan announced that Gilgit-Baltistan would attain Provisional Provincial Status after the 2020 Gilgit-Baltistan Assembly election. This move was however met with strong opposition from India which claimed that this was a Pakistani ruse to codify their illegal annexation of the region. == Northern History == Muslim rule in the area ended with the expansion of the Sikh Empire. After the British defeat of the Sikhs in the Anglo-Sikh wars, the region was ruled by the Dogras under British paramountcy. After the 1947 Independence, the region became part of the newly formed Sovereign state of Pakistan through Gilgit rebellion in the First Kashmir War of 1947/48. Gilgit Baltistan was liberated from the Dogra rule on the 1st of November in 1947, and this date marks its freedom of the region. Prior to its freedom, the area of Gilgit Baltistan was once a part of the state of Jammu and Kashmir, one of India’s major princely states. The state of Jammu and Kashmir was established in 1846 with the signing of the Treaty of Amritsar between the British Raj and Gulab Singh of the Dogra Dynasty. The treaty also effectively delineated the southern, eastern, and western borders of a new political entity, pushing the Dogras to the forefront of Northern India’s rule. During the first Anglo-Sikh war, Gulab Singh of Jammu opted to stand with the East India Company (EIC) by remaining neutral. Therefore, the EIC acknowledged Singh’s dedication during the war and thus ‘sold’ the state to him for 7.5 million Rupees. Subsequently, Gulab Singh became the first Maharaja of the state. Jammu and Kashmir’s princely state was divided into four units: the provinces of Jammu and Kashmir as well as the districts of Ladakh and Gilgit. Before signing the Treaty of Amritsar, in 1840, Gulab Singh’s Dogra army attacked and annexed Baltistan. As a result, under the new administrative setup, Baltistan was included in the district of Ladakh. Due to this linkage, the region still has the Status quo of a Disputed territory. Subsequently, the region is in constitutional limbo and denied representation in the Federal National legislature. Successive Governments have tried to regulate the problems and solve the puzzle through different measures; however, the anomaly still exists. The question of GB’s integration into Dominion of Pakistan is complicated as Pakistan and the Republic of India both maintain GB is part of Kashmir. When India raised the case of Kashmir before the UN, India’s claim on Kashmir was denied and the whole state of Kashmir — including GB — became a Disputed territory. The issue was supposed to be resolved through a plebiscite with certain preconditions. GB’s scholars and political analysts take a contrary position. As per historical accounts, Kashmir’s Dogras captured Baltistan through military aggression; there was no legal or constitutional rationale for their rule. The people never accepted their rule, either. Thus, arguing that the occupation of the region through military invasion cannot justify associating the region with Kashmir. Qasim Naseem, a senior journalist and writer from GB, argues that, if the justification behind declaring GB a part of Kashmir is accepted, Pakistan and India could also be declared a constitutional part of Great Britain. Kashmir itself was, at one time, ruled by Sultan Saeed Khan Kashgiri and came under control of the Afghans for a long period. However, Kashmir neither became part of Kashgar nor of Afghanistan. Naseem further contends that we do not accept Indian Occupied Kashmir as a so-called integral part of India, despite it being under Indian administration since 1948. However, this being the individual opinion of a Gilgit-Baltistan resident, there are contradicting statements from studies (EFSAS) that state that the accession of the region was to be done to India, but due to political forces from neighbouring Pakistan, this did not take place. ==Baltistan== The regions of Baltistan, and Ladakh (including Kargil) and Chitral are also considered to be a part of Balawaristan by nationalist parties of Gilgit. The peoples' do not consider areas of Gilgit and Baltistan to be legally or constitutionally part of Pakistan or India. Nor do they regard neighboring regions of Ladakh wazarat to be legitimately part of India or Pakistan. They demand freedom not just for regions within Pakistan, but also Indian held areas. They also assert that as per UNCIP resolutions, (Pakistan and India) must withdraw their occupational armed forces and handover the control of the disputed region to the people of Gilgit Baltistan, under the supervision of the United Nations, until a final settlement of the whole Jammu and Kashmir issue is reached, as per a United Nations sponsored plebiscite that would be held in both Pakistan and Indian- administered Kashmir.\" ==Semi-autonomous status and present-day Gilgit- Baltistan== On 29 August 2009, the Gilgit-Baltistan Empowerment and Self- Governance Order 2009, was passed by the Pakistani cabinet and later signed by the country's President. The order granted self-rule to the people of the former Northern Areas, now renamed Gilgit-Baltistan, by creating, among other things, an elected legislative assembly. There has been criticism and opposition to this move in Pakistan, India, and Gilgit-Baltistan.Gilgit- Baltistan package termed an eyewash , Dawn, 2009-08-30 Gilgit Baltistan United Movement—while rejecting the new package—demanded that an independent and autonomous legislative assembly for Gilgit-Baltistan should be formed with the installation of local authoritative government as per the UNCIP resolutions, where the people of Gilgit-Baltistan will elect their president and the prime minister. In early September 2009, Pakistan signed an agreement with the People's Republic of China for a mega energy project in Gilgit-Baltistan which includes the construction of a 7,000-megawatt dam at Bunji in the Astore District. This also resulted in protest from the Republic of India, although Indian concerns were immediately rejected by Pakistan, which claimed that the Government of India has no locus standi in the matter. On 29 September 2009, the Pakistani Prime Minister, while addressing a huge gathering in Gilgit- Baltistan, announced a multi-billion rupee development package aimed at the socio-economic uplifting of people in the area. Development projects will include the areas of education, health, agriculture, tourism and the basic needs of life. The Prime Minister further went on to say: \"You are getting your identity today. It is your right and has been your demand, and today we are fulfilling it.\" Gilgit–Baltistan thus gained de facto province-like status without constitutionally becoming part of Pakistan. The official poistion of Pakistan has rejected Gilgit–Baltistani calls for integration with Pakistan on the grounds that it would prejudice its international obligations with regard to the Kashmir dispute. In 1982 the Pakistani President General Zia ul Haq proclaimed that the people of the Northern Areas were Pakistanis and had nothing to do with the State of Jammu and Kashmir. An attempt in 1993 by the High Court of Azad Kashmir to annex Gilgit–Baltistan was quashed by the Supreme Court of Pakistan, after protests by the predominantly Shia population of Gilgit–Baltistan, who feared domination by the Sunni Kashmiris. ==Gilgit Baltistan Order 2018== The Federal government of Pakistan was to announce the new reforms within a week of its announcement; however, it took considerable time to do so. The delay indeed created rumors and confusion which resulted into the passing of a unanimous resolution by Gilgit Baltistan Assembly for sharing the recommendations of Sartaj Aziz Committee which was formed on 29 October 2015 to recommend new political and administrative reforms for Gilgit Baltistan. The Committee took three years for formulation and the new order was decided in 27 meetings. The draft was also debated in all parties’ conference held in Gilgit on 20 November 2017 as claimed by the government spokesman. The positive points of new order are that it has repealed 2009 order and annulled powerful Gilgit Baltistan Council and powers shifted to Gilgit Baltistan Legislative Assembly. Apparently, there is no role of Kashmir Affairs ministry as it is Gilgit Baltistan Assembly with the powers of legislation. Chief Court will be renamed as High Court comprising of 7 Judges. Appointments of Judges will be made at Gilgit Baltistan level. There will be Gilgit Baltistan provincial service commission and a provincial Auditor General. The Gilgit-Baltistan Order 2018 was promulgated by the former Prime Minister Shahid Khaqan Abbasi on May 21, 2018, and replaced the Gilgit Baltistan Empowerment and Self Governance Order 2009, with the ostensible aim of providing the “same rights enjoyed by the other citizens of Pakistan to people of Gilgit Baltistan.” The August 8, 2018, order purportedly provided political, administrative, financial and judicial powers to people in the region. In actual fact, however, the order shifted powers from the Gilgit Baltistan Council — including those related to passing laws relating to minerals and tourism — to the Gilgit Baltistan Assembly. A comparative analysis of the 2009 ad 2018 Orders indicates that the ‘Special Provisional Rights’ the people of Gilgit Baltistan enjoyed have been curtailed further. For instance, the Legislative Power, according to the 2009 Order, was vested in the Gilgit Baltistan Council (though this was led by the Prime Minister of Pakistan, but also had representatives from Gilgit Baltistan) and the Gilgit Baltistan Assembly. As per the 2018 Order, this power lies with the Prime Minister of Pakistan and the Gilgit Baltistan Assembly, which comprises 33 members of which 24 members were Elected through direct Election. The Prime Minister seems to hold final authority in terms of legislative powers, as the Gilgit-Baltistan Order 2018 reads, Thus this Order in Immediate Effect ‘‘Made Gilgit—Baltistan a Provisional Province without it becoming a Constitutional Part of Pakistan’’, with complete Internal Autonomous status respectively. The order also defines the ambit of discussions in the assembly; with Article 57 restricting it from even discussing “matters relating to foreign affairs, defense [and] internal security”, which is highly unlikely given the region’s borders with China, Kashmir, Pakistan Occupied Kashmir and Afghanistan. Moreover, civil society activists have demanded a share in income from the China-Pakistan Economic Corridor (CPEC), citing Pakistan’s dependence on a Disputed territory for directly connecting it with China. For these voices, Pakistan’s obsession with Kashmir Region has also been subject to criticism as Islamabad has failed to address GB’s grievances while at the same time criticizing India’s so-called Kashmir policy. While the order, in theory may not be closer to addressing these grievances, hope rests on whether Islamabad’s promise of the greater power devolution is able to tackle the growing alienation which seems to be dwindling by the moment with the turmoil within the Government of Pakistan leading to economic weakening in the mainland itself. === Northern languages === Gilgit-Baltistan is a multilingual region where Urdu being a national and official language serves as the lingua franca for inter ethnic communications. Main languages are Balti, Shina Burushaski, Wakhi and Khowar. Pakistani English is co-official and also used in education, while Arabic is used for religious purposes. The table below shows a break-up of Gilgit-Baltistan first-language speakers. Rank Language Detail 1 Shina It is a Dardic language spoken by the majority in six tehsils (Gilgit, Diamir/Chilas, Darel/Tangir, Astore, Puniyal/Gahkuch and Rondu). 2 Balti It is spoken by the majority in five tehsils (Skardu/Shigar, Kharmang, Gultari, Khaplu and Mashabrum). It is from the Tibetan language family and has Urdu borrowings. 3 Burushaski It is spoken by the majority in four tehsils (Nagar 1, Hunza/Aliabad, Nagar II, and Yasin). It is a language isolate that has borrowed considerable Urdu vocabulary. 4 Khowar It is spoken by the majority in two tehsils (Gupis and Ishkomen) but also spoken in Yasin and Puniyal/Gahkuch Tehsils. Like Shina, it is a Dardic language. 5 Wakhi It is spoken by the majority of people in Gojal Tehsil of Hunza. But it is also spoken in the Yasin and Ishkomen tehsils of Gupis-Yasin and Ghizer districts. It is classified as eastern Iranian/ Pamiri language. Unranked Others Pashto, Kashmiri, Domaaki (spoken by musician clans in the region) and Gojri languages are also spoken by a significant population of the region. ==Demography== The population of Gilgit-Baltistan is entirely Muslim and is denominationally the most diverse in the country. The region is also the only Shia-plurality area in an otherwise Sunni-dominant Pakistan. People in the Skardu district are mostly Shia, while Diamir and Astore districts have Sunni majorities. Ghanche has a Noorbakhshi population, and Ghizar has an Ismaili majority. The populations in Gilgit, Hunza and Nagar districts are composed of a mix of all of these sects. According to Indian government official, B. Raman, the Shias and Ismailis constituted about 85% of the population in 1948. ==Government== The Government of Gilgit Baltistan also known as the State Government of the Northern Areas, is the highest governing authority of the territory and its 10 districts. It consists of an executive, led by the Governor of Gilgit Baltistan, a judiciary and a legislative branch. Like other provinces in Pakistan, the head of state of Gilgit Baltistan is the governor. The governor is chosen by the President of Pakistan on the advice of the central government. The governor's post is largely ceremonial. It does not have much power. The Chief Minister is the head of government and is holds most of the executive powers. The Gilgit Baltistan Legislative Assembly is a 33-seat unicameral legislative body. It was formed as part of the Gilgit–Baltistan Empowerment and Self-Governance Order, 2009. This order gave the region self- rule and an elected legislative assembly. Before this, the region had been directly ruled from Islamabad. == Districts of Gilgit Baltistan == * Astore District - (Diamir Division) * Diamir District - (Diamir Division) * Ghanche District - (Baltistan Division) * Ghizar District - (Gilgit Division) * Gilgit District - (Gilgit Division) * Hunza District - (Gilgit Division) * Nagar District - (Gilgit Division) * Skardu District - (Baltistan Division) * Shigar District - (Baltistan Division) * Kharmang District - (Baltistan Division) == Geography and climate == Gilgit–Baltistan borders the Wakhan corridor of Afghanistan to the northwest, China's Uygur Autonomous Region of Xinjiang to the northeast, the disputed territory of Jammu and Kashmir to the south and southeast, the Pakistani-controlled state of Azad Jammu and Kashmir to the south, and Pakistan's Khyber Pakhtunkhwa to the west. Gilgi-Baltistan is home to five of the \"eight-thousanders\" and to more than fifty peaks above 7000 meters. Gilgit and Skardu are the two main hubs for expeditions to those mountains. The region is home to some of the world's highest mountain ranges—the main ranges are the Karakoram Mountains and the western Himalayas. The Pamir mountains are to the north, and the Hindu Kush lies to the west. Amongst the highest mountains are K2 (Mount Godwin-Austen) and Nanga Parbat, the latter being one of the most feared mountains in the world. The Deosai Plains are located above the tree line, and constitute the second-highest plateau in the world at 4,115 meters (14,500 feet) after the Chinese region of Tibet. The plateau lies east of Astore, south of Skardu and west of Ladakh. The area was declared as a national park in 1993. The Deosai Plains cover an area of almost 5,000 square kilometres. For over half the year (between September and May), Deosai is snow-bound and cut off from rest of Astore & Baltistan in winters. The village of Deosai lies close to Chilum chokki and is connected with the Kargil District of Ladakh in the Kashmir disputed region through an all-weather road. == References == Category:1974 establishments in Asia Category:1970s establishments in Pakistan Category:Central Asia Category:Foreign relations of Pakistan Category:Geography of Kashmir",
 "title": "Gilgit-Baltistan"
}