{
 "id": "1130226",
 "text": "Raghunath Rao's Northern ExpeditionA Study of Eighteenth Century India: Political history, 1707-1761 was a military campaign from 1757 to 1758 conducted by the Maratha general Raghunath Rao. The campaign was initially a success, bringing Delhi, Punjab, Kashmir, several parts of Khyber pass and the surrounding territory under Maratha rule in north-western India for a brief period. ==Backround== After the death of the Indian Emperor Aurangzeb in 1707. This was followed by the phase of rapid expansion of the Maratha confederacy into Western and Central India for the next 50 years under the support of Chhatrapati Shahu and his appointed Peshwa Baji Rao I and Raghoji I Bhonsle. These Hindu armies conquered Gujarat, the whole of Central India and Orissa, subdued Rajputana, and raided into Bengal making it a tributary and conquered Tiruchirapalli in Tamil Nadu, and imposed Chauth (tax) upon these areas. Their ambition pushed them further northwards to Delhi and into Haryana, which collided with the ambitions of Ahmad Shah Durrani, the founder of Durrani Empire. In 1757, Ahmad Shah Abdali raided Delhi and captured Punjab and Kashmir with the help of Rohilla Chief Najib Khan. He installed his son Timur Shah Durrani in Multan and went back to Afghanistan. ==Conquest of Delhi== Peshwa Balaji Baji Rao sent his brother Raghunath Rao along with Gangadhar Tatya, Sakharam Bapu, Naroshankar and Maujiram Bania and a large army towards Delhi. They were accompanied by Malhar Rao Holkar of Malwa who had a long experience of North India and its rulers. The Hindu army conquered Delhi in August 1757. They decisively defeated the Rohillas near Delhi in 1758. The defeat was so decisive that Najib Khan surrendered to the Marathas and became their prisoner.The New Cambridge Modern History, Volume 4 The Marathas encamped opposite the Red Fort on the other side of Yamuna River. Najib gave the charge of 2,500 strong infantry to Qutub Shah and Mulla Aman Khan and himself commanded another infantry contingent of 5,000 elite Rohilla troops and heavy artillery which were deployed by him to prevent Marathas from entering the city. The battle started on 11 August and after two weeks of intense fighting with heavy Rohilla losses, Najib surrendered and was arrested by Marathas.History of Indian subcontinent Maratha commander Raghunath Rao ordered the immediate withdrawal of Najib from Delhi along with a tribute of 50 lakh rupees. Najib also promised that he would never return to Delhi and never threaten any Maratha fort. The Maratha had now become the de facto rulers of Delhi. Raghunath Rao appointed Antaji Mankeshwar as Vakil of the Mughal Empire while Alamgir II was retained as the Emperor with no actual power. ==Conquest of Punjab and parts of Khyber pakhtunkhwa== In Punjab, Adina Beg Khan, along with the Sikhs, was already in revolt with Ahmad Shah Durrani who had invaded Punjab multiple times and had been repelled each time. He decided to call the Marathas for help. On 7 March, Raghunath Rao had encamped at Rajpura where he received Adina Beg Khan’s envoys, and was informed that the latter, accompanied by 15,000 Sikh fighters, belonging to the bands (the jathas) of Jassa Singh Ahluwalia and Baba Ala Singh of Patiala had closed upon Sirhind from the other side of Satluj. A concerted attack on the fort of Sirhind was made by the Sikhs and Marathas on 8 March 1758. Ahmad Samad Khan, with his 10,000 Afghan troops, held out for about two weeks before his capitulation on 21 March. After the victory, the town was thoroughly sacked by the victors. After defeating the Afghan-Rohilla forces, the Marathas forced the Afghans into the Khyber Pass. The Hindus then gave chase to the Pathans on horseback and were in quick pursuit of them in which they went on to capture Attock and then Peshawar from the Afghans. Adina Beg's sudden death threw Punjab into turmoil. Many of his soldiers, particularly Afghan mercenaries deserted his army camp and added to the number of freebooters, thus creating chaos and anarchy everywhere. Sikhs started again to revolt against Muslim ruling elite, which had failed to make any permanent settlement with them. Khawaja Mirza who was now the Maratha governor of Punjab could not cope with the situation. He sent an express appeal to the Peshwa for reinforcements, alerted all the junior Maratha officers to help him restore law and order in the state and he also recalled Maratha detachments from Peshawar and Attock to safeguard his position in Lahore. Tukoji Holkar and Narsoji Pandit, the Maratha Hindu commanders of Peshawar and Attock had to withdraw their troops from the frontier posts. Sabbaji Patil was now given the charge of Peshawar. Raghunath Rao and his deputy Malhar Rao were not interested in holding the position in the north for long. On their request, Peshwa had to find their substitutes. He gave supreme command of Dehli to Dattaji Scindia, while Jankoji Scindia was appointed his deputy. They proceeded towards Delhi separately at different times. A massive army of Marathas under their new commanders, Scindias reached Machhiwara in March 1759. Like Raghunath Rao, Dattaji also didn't want to stay in Punjab for long. As there was no news of Abdali's invasion, Dattaji deferred the appointment of any permanent governor in Punjab and left it to the Peshwa for decision at his convenience. After deliberations with his advisors, Dattaji deputed Sabbaji to take care of Punjab and Khyber Pakhtunkhwa, Peshawar and Attock along with assistance of Bapu Rao, Dadu Rao and Sena Pandit for time being and himself left Punjab for the suppression of Najib-ud-Daula in the Ganga valley. Bapu Rao took the charge of Rohtas Fort, while other officers were appointed on the frontier posts. Taking advantage of Sabbaji's absence from Peshawar post, the Afghans marched to Peshawar. The Peshawar fort was taken by Afghans with heavy losses to the besieged Maratha garrison. Thereafter the Afghan invaders, under Jahan Khan overran Attock and threatened the Rohtas Fort. By that time, Sabaji Patil (Sabaji Scindia) reached the place in the Battle of Lahore, (1759) with fresh troops and a large number of Sikh fighters, who had once again allied with the Marathas. The combined forces of the Marathas and Sikhs defeated the Afghan garrison in which Jahan Khan lost his son and was himself wounded. The Afghans quickly vacated the forts of Peshawar and Attock and retreated west to Western Afghanistan. So, Peshawar once again fell to Marathas, With this Marathas started planning their expansion deeper into Afghanistan by invading Kabul ==Aftermath== This was a major blow to the muslim powers. Islam started rapidly declining in Northern India, entire Punjab, much of North India, and several parts of Khyber Pakhtunkhwa and Kashmir came under Maratha control. On 4 May 1758, Raghoba from Lahore wrote the following letter to his brother, Balaji Baji Rao: == References == Category:Pages created with the Article Wizard from 2024 Category:17th-century conflicts Category:Maratha Empire",
 "title": "Northern Campaign of Raghunath Rao"
}