{
 "id": "1130615",
 "text": "The Hachani Cabinet is the current government of Tunisia since 2 August 2023. It is led by Prime Minister of Tunisia Ahmed Hachani. All ministers from the previous cabinet stayed in office. == Cabinet members == Office Name Party Prime Minister Ahmed Hachani Independent Minister of Interior Kamel Feki Independent Minister of Defence Imed Memmich Independent Minister of Foreign Affairs, Migration and Tunisians Abroad Nabil Ammar Independent Minister of Justice Leïla Jaffel Independent Minister of Finance Sihem Boughdiri Independent Minister of Economy and Planning (Acting) Sihem Boughdiri Independent Minister of Industry, Energy and Mines Vacant Independent Minister of Trade and Export Development Independent Minister of Agriculture, Water Resources and Fisheries Abdelmonem Belaâti Independent Minister of Social Affairs Independent Minister of Health Independent Minister of Education Mohamed Ali Boughdiri FVP Minister of Youth and Sports Independent Minister of Employment and Vocational Training, Government spokesperson Vacant Independent Minister of Higher Education, Scientific Research Independent Minister of Transport Independent Minister of Communication Technologies Nizar Ben Néji Independent Minister of Equipment and Housing Independent Minister of State Domains and Land Affairs Independent Minister of Environment Independent Minister of Tourism Independent Minister of Religious Affairs Vacant Independent Minister of Women, Family, Children and Elderly Amel Moussa Independent Minister of Culture Independent Secretary of State for Foreign Affairs Mounir Ben Rjiba Independent Secretary of State for Agriculture Ridha Gabouj Independent Secretary of State for International Cooperation Vacant Independent ==Cabinet reshuffle== On 17 October 2023 the President of the Republic Kais Saied appointed Sihem Boughdiri Minister of Finance, to run the Ministry of Economy and Planning on a temporary basis. He replaced Samir Saied. On 21 June 2024 President Kais Saied fired Minister of Religious Affairs , after 49 Tunisian Hajj pilgrims died in Saudi Arabia. == References == Category:21st-century establishments in Tunisia Category:2023 establishments in Africa Category:Politics of Tunisia",
 "title": "Hachani Cabinet"
}