{
 "id": "1130926",
 "text": "Anna Elisabeth Maria \"Anna-Lisa\" Adelsköld with married name Bruun (29 August 1904 - 22 June 1991) was a Swedish track and field athlete specialized in the throwing events.Sveriges Dödbok 1860–2016, USB, Version 7.10, Sveriges Släktforskarförbund (2016).Elsa Sanfridsson Svensson 1906-1992, storagrabbar.se ==Sports career== Adelsköld was a member of Floda IF.Adelsköld Wårgårda Idrottshistoriska Sällskap She was a pioneer in women's sports and one of Sweden's early female athletics stars. Her main achievements were winning the gold medal at the 1926 Women's World Games in the javelin throw and becoming the first Swedish national champion in 1927 in a Swedish national record of 34.93 meters.Svenska dagbladets Årsbok 1927 Runeberg.org Her other main achievements includes winning after the 1926 the javelin throw event at the 1926 Stockholm international women's athletics meeting. ==Personal life== Adelsköld was born on the manor in the municipality of Lerum as the second child of the agronomist Gustaf Fredrik Sebastian Adlerstierna-Adelsköld (1876–1936) and his wife Signe Elisabet Anrep (1877–1961). Her father was a member of the Swedish noble Adelsköld family and her mother of the Baltic- German noble family Anrep.Adelsköld, tabell 5 AdelsvapenAdelsköld Sveriges ridderskaps och adels kalender , 1923, 46th annualBruun Vem är vem ? / Götaland utom Skåne, Halland, Blekinge, 1965, page 187 She studied at the now called Swedish School of Sport and Health Sciences in Stockholm. She later worked, next to her sports activities, as a gymnastics director and also as a church minister. In 1929 she moved to Siene in Vårgårda Municipality.Bruun Alingsås släktforskarförening, page 184 On 22 June 1929, she married agronomist and landowner Öyvind Fritiof Bruun from Tubbetorp manor in Stora Lundby parish, and she retired as an athlete. They had six children together. ==References== Category:1904 births Category:1991 deaths Category:Swedish athletes Category:Javelin throwers Category:Discus throwers",
 "title": "Anna-Lisa Adelsköld"
}