{
 "id": "1130929",
 "text": "[[File:Plasma fountain.gif|thumb|200px|right|The plasma fountain (or polar wind) in the Earth's atmosphere. The bright yellow (next to the green-colored area) indicates ions released from gas in the atmosphere escaping into space. The escape of those oxygen, hydrogen and helium ions are part of the plasma fountain effect. The atmosphere near the North and South poles rises higher above Earth's surface than in other places. The illustration shows the plasma fountain at the North pole.Plasma fountain Source, press release: Carlowicz, Mike; \"Solar Wind Squeezes Some of Earth's Atmosphere into Space\", December 1998]] The ambipolar electric field is an electric field responsible for the polar wind (or plasma fountain), an effect in the upper atmosphere, about 150 miles (240 km) above the surface of the earth. There is at least one polarization electric field in the atmosphere of Earth. Research on electric fields are a part of physics. Claims were made in 2024 that some voltages in an ambipolar electric field in the ionosphere were measured during a rocket flight in 2022. In August 2024, research was published about the different voltages that were measured. The research was published in an article in Nature, peer reviewed by a team of science experts. The ambipolar electric field causes the polar winds, which have been recorded by spacecraft passing over the earth's poles. These polar winds move: * electrons * hydrogen ions (H+) * helium ions (He+) * oxygen ions (O+) These three types of ions, or ion species, reach supersonic velocities at altitudes above 7000 km; at 50,000 km, these ion species reach \"double supersonic\" velocities.. Quote, \"All three ion species are supersonic by the time they reach 7000 km, the ion Mach number of H+ , He+ , and O + being 1.5, 1.5, and 5, respectively, at this altitude and increasing to 4.6, 2.5, and 3.5 at 50,500 km\" The movement of air is not known to happen in any significant way by the plasma fountain. ==Voltage measurements done from a rocket traveling through space== The polarization or ambipolar electric field was measured in 2022 by a rocket launched from Svalbard; That electric field was directly measured; The rocket that did the measurement, was a sounding rocket. There is at least one polarization electric field, in the atmosphere of Earth. The strength of the field was first measured by the NASA mission called Endurance, in 2022. The sub-orbital mission launched from Svalbard Rocket Range in Norway, and landed in the Greenland Sea after taking the measurements. Endurance launched on May 11, 2022, and reached a height of c. 477 miles (c. 768 kilometers), splashing down 19 minutes later in the Greenland Sea. Across the 322-mile height range where it collected data, Endurance measured a change in electric potential of only 0.55 volts. The measurement (is not sure, or) has uncertainty: The voltage can be anywhere from 0.46 volts to 0.64 volts. Another way of saying that, is that the measurement has uncertainty of 0.09 volts, according to the article in Nature. In regard to later measurements (of an ambipolar electrical field in the ionosphere): Later measurements have not been published (as of 2024's third quarter). ==Information about Physics, without saying anything about ambipolar electric fields in the ionosphere of planet Earth== Media sometimes talks about supersonic in space (and thereby also, the speed of sound in space). Furthermore, sometimes one then uses a number (or value) for supersonic speed in the Earth's atmosphere, and calls that supersonic in space. By simplifying one idea, it sometimes is a help in explaining another idea (such as things traveling in space at 'twice the speed of sound'). Research paper (year 2019) in regard to planet Mars: The ionosphere of planet Mars, has an ambipolar electric field, according to a research paper.Retrieved 2024-09-27 There is \"a global electrostatic field between the ionosphere and space\"Retrieved 2024-10-08 (called the ambipolar or polarization field), according to media. All ambipolar electric fields, are a kind of polarization electric field. The existence of ambipolar electric field [in different places], was hypothesized (suggested) in 1955. ===More information about Plasma fountain (or Polar wind)=== Much research has been done on Plasma fountain (or Polar wind). Satellites have been used (since the 1960's), when doing research. Some of them are ISIS-2, Dynamics Explorer, the Akebono satellite, and the Polar satellite. That research has covered different places above the surface of Earth. Those places are at different altitudes and latitudes. Research has also been done at different times of [one or more] solar cycles. In 2007, a research paper said that Plasma fountain (or Polar wind) is \"an ambipolar outflow of thermal plasma from the [the ionosphere near the North pole and South pole, or] high-latitude ionosphere\"; That plasma moves from the ionosphere to the magnetosphere.Retrieved 2024-10-11 ==Article by NASA (on the same day as the Nature article)== NASA ran the rocket project. NASA published an article on the same day that the article in Nature was published. NASA's article says that the ambipolar electric field (that was measured by equipment that traveled with the rocket), is one of three known energy fields around the planet Earth. The other two are gravity and the magnetic field. ==Related pages== * Ionosphere ==References== Category:Atmosphere",
 "title": "Ambipolar electric field"
}