{
 "id": "1130738",
 "text": "M. Hoke Smith was an American Democratic Party politician who served as governor of Georgia from 1907 to 1909 and then for a few months in 1911. A racist who believed that blacks were “inferior mentally to the white man,”The African American Electorate A Statistical History, Volume 1 By Hanes Walton, Sherman C. Puckett, Donald R. Deskins, 2012, P.353 Smith helped bring about legislation that disenfranchised the black voters of Georgia.Gov. Hoke Smith National Governors Association biography More positive was Smith’s reform record. During his two terms as governor, a wide range of progressive social reforms were introduced. An Act of 1907 provided for the purchase and maintenance of charitable homes for indigent old women. This applied to counties with populations of 75,000 people or more.Acts of the General Assembly of the State of Georgia 1907, P.109 An Act of 1908 limited the interest rate on loans made in Georgia. A pure food and drug act of 1908 extended the provisions of a previous 1906 law. It did this by providing for a drug inspector and food inspector. Other legislation provided for the setting up of a tuberculosis sanitarium.Hoke Smith and the Politics of the New South By Dewey W. Grantham, 1967, P.173 Juvenile courts were also set up as branches of the superior courts. In addition, a parole system was established. The legislature also provided for the improved treatment of women prisoners.Hoke Smith and the Politics of the New South By Dewey W. Grantham, 1967, P.174 Public school funding went up by 30% and child labor conditions were improved.Gov. Hoke Smith National Governors Association biography During Smith’s last year in office, an Act was passed that provided for the reduction in the weekly hours of textile workers to sixty.Acts of the General Assembly of the state of Georgia, 1911, P.65 Following the end of his time as governor, he became a United States senator.Gov. Hoke Smith National Governors Association biography ==References== Category:Democratic Party (United States) politicians Category:Governors of Georgia (U.S. state)",
 "title": "M. Hoke Smith"
}