{
 "id": "1130935",
 "text": "Carlos Enrique Cavelier (born 1961) is a Colombian authorentrepreneur,sociologist and columnist,living in Cajicá. == Professional career == He has been invited to give lectures at the universities of Los Andes, Externado, El Rosario, Javeriana, La Sabana, CES and EAFIT in Medellín, del Norte in Barranquilla, and Columbia, Harvard, Yale and Vermont in the United States, on topics such as the action of justice in Colombia, the legalization of drugs, marketing, business strategy, leadership, sustainability, the development of Alquería, the Colombian peace process and the impact of Alquería in La Macarena. He serves as the board president and coordinator for dreams in Alquería;Alquería was founded in 1959 by his father and grandparents. He became a member of the Food Bank of Bogotá's board of directors in 2009, and from 2011 to 2019, he presided over it. In 2019, he was awarded Best Business Leader in Colombia, at the Portafolio 25 Años Awards ceremony. He worked as the state of Cundinamarca's governor's senior education advisor. === As an author === * 1992- Prelude to the New Colombia: two years of reflection on our future * 2022- Coordinating dreams: Alquería's path to sustainability * 2022- Coordinating dreams: Alquería's path to sustainability * Economics of scarcity, or abundance? == Early life and Education == After earning a master's degree in public administration from Harvard University's Kennedy School of Government, he went back to Colombia to work as an assistant professor at Universidad de los Andes. He also won elections to serve as a state senator, a congressman representing Cundinamarca, and a member of the Cajicá municipal council. Later on, he was named secretary general of the Ministry of Justice and senior adviser to the minister of agriculture for the National Rehabilitation Plan. == References == Category:1961 births Category:Living people Category:Colombian businesspeople Category:Colombian writers",
 "title": "Carlos Enrique Cavelier"
}