{
 "id": "1130154",
 "text": "Rivero's rocket frog (Hyloxalus idiomelus) is a frog. It lives in Peru. ==Body== The adult male frog is about 24.8 mm long from nose to rear end and the adult female frog is 27.8 mm long. There is no webbed skin on the back feet. The skin of the frog's back is brown or orange-brown or gray-brown in color. It has stripes on the sides of its body. These stripes can be pink- brown, yellow-orange, or nearly white in color. They have dark brown color on their edges. The sides of the frog's body are light brown or gray in color. There is a stripe on its mouth that is pink-white in color. The fronts and backs of the back legs are yellow or orange in color. Parts of the belly and the bottoms of the legs are yellow in color. The iris of the eye is bronze in color. ==Home== This frog is awake during the day. Scientists saw it in forests on mountains with water in the air. They found it near streams and places where water comes out of the ground. People have seen this frog between 1620 and 2840 meters above sea level. Scientists think this frog is good at living in places that human beings have changed because they have seen adult frogs and tadpoles on farms near towns and in forests that human beings have changed. Scientists saw this frog in two protected parks: Alto Mayo Protection Forest and Tilacancha Private Conservation Area. ==Young== The male frog sits under a rock or in a crack in a rock and calls to the female frogs. The female frog lays her eggs in dead leaves on the ground. The male frog watches the eggs until they hatch. Then he carries the tadpoles to streams where they swim and grow. Scientists have seen male frogs with 12 tadpoles on their backs at the same time. He takes the tadpoles to streams where the water moves slowly. The biggest tadpoles are 16.3 mm long without the tail and 36.6 mm long with the tail. Their noses are round and their eyes are on the tops of their heads and their mouths are on the bottoms of their heads. They have strong swimming muscles and pointed tails. The tadpoles are olive-brown in color with gray bellies. The tail is light brown in color with olive spots. Young frogs are 10.8–14.1 mm long from nose to rear end. They are the same color as adult frogs. ==Danger== Scientists wrote the first paper about one frog in 1991 and they found many more in 2004. Since then, no scientist has said they have seen this frog. So scientists do not know if it is in danger of dying out. People changes the places where the frog lives to get wood to build with and to make farms and towns. The fungal disease chytridiomycosis has killed other frogs and amphibians in Peru, so scientists think it could kill this frog too. ==References== Category:Frogs of South America",
 "title": "Hyloxalus idiomelus"
}