{
 "id": "1130954",
 "text": "Collage is a freestyle duo, featuring vocalist Anthony Monteleone and producer/songwriter Adam Marano in 1993, who also ran the Viper Records label for which Collage recorded. Viper's parent label Metropolitan issued the Viper's Freestyle Hit Parade compilation in 1994; it helped break the Collage single \"I'll Be Loving You\" nationally. The song went to number 56 on the Billboard Hot 100. However, \"I'll Be Loving You\" received significant Top 40 airplay on the handful of radio stations across the U.S. that had not abandoned the format in the early 1990s, due to rapidly changing musical tastes. Among the radio stations playing the song at the time are WRVQ \"Q94\" in Richmond and WBSS \"Boss 97\" in Atlantic City, N.J., in addition to Rhythmic stations such as WQHT \"Hot 97\" in New York, Wild 107.7 in San Francisco, Q97 in San José, CA KHTN Modesto's 104.7 FM, San Diego's Z90, Channel 933 and WPOW \"Power 96\" in Miami. It is largely considered to be the final freestyle dance release to receive airplay, concluding a nearly 10-year period, in fall 1994. Internationally, the song can be heard today on such stations as \"Planet 107.5\" in San Jose, Costa Rica, which played the song at 1:35pm on 28 July 2022. To this date, the song continues to be a major spin in many of the old school radio stations around the U.S. Debut album Chapter One was released in 1994, producing the less-successful follow-up single, \"Gangster of Love\". It also prominently featured female backup vocalist .Denine. Collage's success helped spark a renewal of interest in freestyle during the 1990s (on a more underground rather than mainstream level), and Marano went on to work with several other vocalists like Alexia Phillips, Chris Phillips, Denine, Rockell and others. The second Collage album Chapter II, released in 1999, didn't appear for another five years. However, it still managed to produce a hit single, \"Angel\". Third album Chapter 3 was released in late 2001, spawning the hit single \"Tonight\". In 2007, a fourth album was released, Chapter 4. Category:American musical groups",
 "title": "Collage (American duo)"
}