{
 "id": "1130310",
 "text": "Kim Min-ju (; born February 5, 2001), also known as Minju, is a South Korean actress and former singer under Management SOOP. She is known for being a member of the South Korean–Japanese girl group Iz*One. Kim is also best known for her roles in Tempted (2018), The Fault Is Not Yours (2019), and The Forbidden Marriage (2022–2023). == Life and career == === Early life and career beginnings === Kim was born on February 5, 2001. She has a younger sister. She also has an older brother. She went to School of Performing Arts Seoul and graduated in February 2020. In 2016, she was part of a pre-debut girl group called Girls' Recipe. Their debut was scrapped in the end on the same year. Before joining the reality girl group survival show Produce 48 (the third season of Produce 101), she had been shown as an actress in music videos and Korean dramas. She played in the 2018 MBC television series Tempted. She played the role of the young Choi Su-ji (Moon Ga-young). === 2018–2021: Produce 48, Iz*One, solo activities === From June to August 2018, Kim represented Urban Works on Produce 48. On the last episode, she was placed eleventh and then joined the show's final debut lineup, Iz*One. On October 29, 2018, she officially preformed as a member of the group with the let out of their first extended play (EP) Color*Iz. In 2019, Kim starred in the film The Fault Is Not Yours, which was premiered in May at 20th Jeonju International Film Festival. It was recorded before she appeared in Produce 48. In June 2020, Kim was chosen as a co-host for the South Korean music program Show! Music Core. === 2021–present: Solo career, return to acting and new agency === After Iz*One's breakup on April 29, 2021, Kim went back to Urban Works. On October 7, her company said that she will promote as an actress. On September 1, 2022, Kim left Urban Works. She then signed a contract with Management SOOP. In 2022, Kim starred in the historical drama The Forbidden Marriage, an adaptation of the same webtoon. Kim got the Best New Actress Award at the 2022 MBC Drama Awards. == Discography == === Singles === ==== Soundtrack appearance ==== List of soundtrack appearances, showing year it was let out and album name Title Year Album \"Christmas\" 2019 The Fault Is Not Yours OST ==== Guest appearance ==== List of non-single guest appearances with other performing artist(s) Title Year Other artist(s) Album \"Falling Star\" 2018 Kriesha Chu Dream of Paradise === Songwriting credits === All song credits are adapted from the Korea Music Copyright Association's database unless stated otherwise. Year Song Album Artist Notes 2019 \"Really Like You\" Heart*Iz Iz*One as lyricist \"Neko ni Naritai (Korean Ver.)\" \"Love Bubble\" Vampire 2020 \"You & I\" Bloom*Iz \"With*One\" Oneiric Diary == Filmography == === Film === Year Title Role 2019 The Fault Is Not Yours Soo-yeon Hear Me: Our Summer Gaeul === Television series === Year Title Role 2018 Tempted Choi Su-ji (young) 2022–2023 The Forbidden Marriage Ahn Ja-yeon / Cha-nyeon 2024 Connection Oh Yun-jin (young) 2025 Undercover High School Lee Ye-na === Television shows === Year Title Role Notes 2018 Produce 48 Contestant Finished 11th 2019 Happy Together Special host with Jang Won-young 2020–2023 Show! Music Core Main host 2021 Where Is My Destination Cast member === Music videos appearance === Year Song Title Artist 2016 \"#WYD (오늘 모해)\" iKon 2017 \"Trouble\" Kriesha Chu 2018 \"Like Paradise\" == Bibliography == === Solo photobooks === Year Title Publisher Catalog No./EAN Notes 2021 Kim Min-ju 1st Photobook [Pro Memoria] Urban Works, Kakao Entertainment L200002325 (EAN: 8804775250378) First solo photobook 2023 Kim Min-ju 1st Present [ALL MY FAVES] Management SOOP, Kakao Entertainment 1544-4205 Second solo photobook , 2024 Kim Min-ju 2024 Season's Greetings 문득 Anywhere Management SOOP 1000004433 First Solo Season's Greetings , == Awards and nominations == Name of the award ceremony, year presented, category, nominee of the award, and the result of the nomination Award ceremony Year Category Nominee / Work Result MBC Drama Awards 2022 Best New Actress MBC Entertainment Awards 2020 Female Rookie of the Year Show! Music Core| 2021 === Listicles === Name of publisher, year listed, name of listicle, and placement Publisher Year Listicle Placement Cine Rewind 2020 Special New Actor of the Year Placed == Notes == == Related pages == * Iz*One * Mononym * Korean name == References == == Other websites == * Kim Min-ju at Management SOOP * Category:2001 births Category:Award winning actors Category:Actors from Seoul Category:K-pop singers Category:Living people Category:Produce 48 Category:South Korean singers Category:Iz*One Category:J-pop singers",
 "title": "Kim Min-ju"
}