{
 "id": "1130180",
 "text": "L'Origine du monde is a painting by Gustave Courbet. Courbet painted it in 1866. It is a female nude. The painting shows the hairy vulva of a woman, lying down, spreading her legs. One of her breasts with a nipple can also be seen. The rest of the body is not shown. The painting was done oil on canvas. It measures . Courbet painted it for Halil Şerif Paşa, a Turkish diplomat. Şerif Paşa is also known as Khalil Bey. Bey also had other nude paintings, which he showed to his guests. He dd not show this painting though. Today, it is unclear who the woman was that he painted. It might have been Bey's lover, Constance Quéniaux. Another option us that it was Joanna Hiffernan. Courbet painted Hifferman on several occasions. The painting has been in the Musée d'Orsay in Paris, since 1955. == Provocative work == During the 19th century, the display of the nude body in painting changed noticeably. The main activists behind this change were Courbet and Manet. Courbet rejected academic painting and its smooth, idealised nudes. He was also against the hypocritical social conventions of the Second Empire. During this time, eroticism and even pornography were acceptable in mythological or oneiric paintings. Courbet later insisted he never lied in his paintings, and his realism pushed the limits of what was considered presentable. With , he has made even more explicit the eroticism of Manet's Olympia. Maxime Du Camp, in a harsh tirade, reported his visit to the work's purchaser, and his sight of a painting \"giving realism's last word\". Because of ts realistic, graphic nudity, the painting still has the power to shock and trigger censorship. The moral stanards and taboos have changed since Courbet's times. These standards tell about the artistic display of nudity. They were done mainly because of photography and cinema. Even with the changes, the painting remained provocative. People were very excited when the painting arrived at the Musée d'Orsay. According to postcard sales, in 2007 was the second most popular painting in the Musée d'Orsay, after Renoir's Bal du moulin de la Galette. Some critics maintain that the body depicted is not (as has been argued) a lively erotic portrayal of a female but of a corpse: \"L'Origine does not represent a full female body but rather a slice of one, cut off by the frame [...]. The pallidness of the skin and the mortuary gauze surrounding the body suggest death.\" ==References== === Sources === * * * * * * * * * * Category:19th-century paintings",
 "title": "L'Origine du monde"
}