{
 "id": "1131753",
 "text": "Nito Verdera (short name of Joan Verdera i Escandell, Ibiza, 1934 - Ibiza, 2022) was an Ibizan journalist, merchant marine pilot and researcher about Christopher Columbus. A member of the Centre d'Estudis Colombins, he has published several books in which he maintains the thesis that Columbus was crypto-Jewish and from Ibiza. He left the merchant marine to dedicate himself to journalism as editor of the Diario de Ibiza, correspondent of Ràdio Nacional d'Espanya, and collaborator of the EFE agency, Catalunya Ràdio, Cadena COPE and Televisió Española . == Columbus from Ibiza == He had studied the place names that Columbus used in the Indies and concludes that a significant part is related to Ibiza and Formentera . After researching the Columbus families in Ibiza, and the navigator's knowledge related to the Mallorca school of cartography, he states that Columbus was of Jewish origin born in Ibiza. Verdera: 1988 His latest book Cristóbal Colón, el libro de las Falacias y cuatro Verdades had been presented at the Ateneo de Madrid by the current Duke of Veragua, a direct descendant of the Admiral. The book not only fervently demonstrates Columbus' relationship with Ibiza and his Jewish origin, but dismantles one by one all the \"fallacies\" that have surrounded the discoverer. Nito Verdera was also, due to his trade as a merchant marine pilot, an outstanding scholar of pre-Columbian maps of America. In his latest book he shows that the Cantino Map contains the evidence (Portuguese place names) of Portuguese knowledge of the Caribbean and Florida before it was explored by Juan Ponce de León. He added, as proof of the Admiral's cultural Catalanity, several lists of colloquial, nautical and toponymic vocabulary of words used by Columbus in his writings, which prove not only that Columbus was Catalan-speaking but, according to the Diccionario Etimológico itself Castilian and Hispanic, Columbus is the first to use many words in Spanish, especially nautical vocabulary, all of which, according to the Etymological and Complementary Dictionary of the Catalan Language, were documented in Catalan much earlier. He is also the one who has best followed the line of research of Simon Wiesenthal and Madariaga that Columbus was Jewish. In his latest book, he expands on the theses of the famous Nazi hunter with the contributions and studies of Professor Estelle Irizarry (study of the Book of Prophecies by Columbus), Sara Leibovicci (the initials Bet Hai on the headers of Columbus's letters to their children). He had studied what he called the linguistic DNA of Columbus, together with Dr. Estelle Yrizarri, who had already published the article of this study in the magazine Aki Yerushalayim, the only magazine of scope world written in Ladino . == Published books == * * * * * * == References == == Other websites == * Author's website * Video from TV Ibiza * Video in Poblet, about the prince of Viana. Category:1934 births Category:2022 deaths Category:Sailors Category:Spanish journalists",
 "title": "Nito Verdera"
}