{
 "id": "1131199",
 "text": "Universidad de Santa Isabel, also called USI or Santa Isabel, is a Catholic private school ran by Sisters of Charity of Saint Vincent De Paul in Naga, Camarines Sur, Philippines. It was found by Rt Rev. Francisco Gainza, O.P., Bishop of Caceres. in 1868 as the first normal school for girls in the Philippine area named in credit of St. Isabel, Queen of Hungary. == History == Colegio de Santa Isabel was founded by Rt Rev. Francisco Gainza. The management of the school gave to six Daughters of Charity that go to the Bicol Region of the Philippines. It was opened in September 18, 1870. Queen Isabella II of Spain allowed Don Fray Francisco Gainza, Bishop of Nueva Caceres. to make the school girls only which will be under the Daughters of Charity's care. This school was the first normal school only for girls in the Philippines and the Southeast Asia named Escuela Normal de Maestras. The school was opened April 12, 1868, achieved its university status in 2001, and got renamed to Universidad de Sta. Isabel. == Location == It is in Elias Angeles St., Bagumbayan Sur, Naga City. == Graduate School == * Doctor of Philosophy ** Major in Human Development Management * Master of Arts in Education (Thesis Tract) ** Major in: Administration and Supervision, Guidance and Counseling, Filipino, Mathematics, Religious Education, Music Education & History *Master in Education (Non-thesis track) *Master in Management *Master of Arts in Nursing **Major in: Medical Surgical Nursing, Community Health Nursing, Maternal Child Nursing & Nursing Administration (non-thesis program) * Master of Science in Social Work == Higher Education == * College of Health Education **BACHELOR OF SCIENCE IN MEDICAL TECHNOLOGY **BACHELOR OF SCIENCE IN NURSING **BACHELOR OF SCIENCE IN PHYSICAL THERAPY **BACHELOR OF SCIENCE IN RADIOLOGIC TECHNOLOGY *College of Business Education **BACHELOR OF SCIENCE IN HOSPITALITY MANAGEMENT **BACHELOR OF SCIENCE IN BUSINESS ADMINISTRATION **BACHELOR OF SCIENCE IN ENTREPRENEURSHIP *College of Arts and Sciences, Teacher Education, Social Work and Music Education **BACHELOR OF ARTS AND SCIENCES **BACHELOR OF SCIENCE IN SOCIAL WORK **BACHELOR OF MUSIC **BACHELOR IN HUMAN SERVICES *TEACHER EDUCATION PROGRAMS **Bachelor of Elementary Education (BEED) **Bachelor of Secondary Education (BSE) **Bachelor of Special Needs Education (BSNed) **Bachelor of Physical Education (BPEd) **Bachelor of Culture and Arts Education (BCAEd) **Bachelor of Early Childhood Education (BECE) == USI as National Landmark == The Republic Act No. 10086 announced that Universidad de Santa Isabel should be now marked as a national historical landmark due to its important role in academics in Philippine History. == References == Category:Christian colleges and universities Category:Colleges and universities in the Philippines",
 "title": "Universidad de Sta. Isabel"
}