{
 "id": "1131699",
 "text": "Trischa Zorn (born June 1, 1964, in Orange, California) is an American Paralympic swimmer. Born blind, she took part in Paralympic swimming (S12, SB12, and SM12 disability categories). She is the most successful athlete in the history of the Paralympic Games, having won 55 medals (41 gold, 9 silver, and 5 bronze), and was added into the Paralympic Hall of Fame in 2012. She took the Paralympic Oath for athletes at the 1996 Summer Paralympics in Atlanta.Speakers of the Athletes' Oath , International Paralympic Committee ==Biography== Zorn studied special education at the University of Nebraska. She competed in the 1980, 1984, 1988, 1992, 1996, 2000 and 2004 Paralympic Games and won a combined total of 55 medals (41 gold, 9 silver, 5 bronze).\"China shine in Paralympic swimming\" , People's Daily, September 26, 2004\"Great Paralympians Past and Present\" , About Olympics\"American Trischa Zorn Most Decorated Paralympian of All-Time With 55th Medal\" , Swimming World Magazine, September 27, 2004. In the 1996 Games in Atlanta, she won more medals than any other athlete: two gold, three silver and three bronze. She had also increased the individual medal table at the 1992 Paralympic Games in Barcelona, with ten gold medals and two silver.\"Paralympic Summer Games -- Barcelona 1992\" , official website of the 2008 Beijing Paralympics She had won seven gold medals during her first game in 1980.\"Trischa Zorn Wins Fifth Gold\", The New York Times, June 23, 1984 After the Sydney Games in 2000, she also held eight world records in her disability category.\"TRISCHA ZORN\" , International Blind Sport Federation On 1 January 2005, Zorn was one of eight athletes admired during New Year celebrations in Times Square in New York City. The other seven were Ian Thorpe of Australia, Nadia Comăneci of Romania, George Weah of Liberia, Françoise Mbango Etone of Cameroon, Gao Min of China, Félix Sánchez of the Dominican Republic and Bart Conner of the United States. ==References== Category:Paralympic gold medalists Category:1964 births Category:People with disabilities",
 "title": "Trischa Zorn"
}