{
 "id": "1131506",
 "text": "Agar.io is a massive multiplayer online action game created by Brazilian developer Matheus Valadares. Players control one or more circular cells in a map representing a Petri dish. == Gameplay == The objective of Agar.io is to grow a cell on a Petri dish by swallowing both randomly generated cells, known as \"agar\", which slightly increases a cell's mass, and other smaller cells (players), without being swallowed by even larger cells. This can be played in a deathmatch or between teams. There is no salvation; players restarting when all their cells are swallowed. There are certain usernames that style the players' cells. Agar.io contains three entities: Pellets, Cells and Viruses: The browser version currently holds five game modes: FFA (Free-For-All), Battle Royale, Teams, Experimental, and Party. The mobile version of the game includes Classic (like FFA), Rush Mode, Burst, and Battle Royale. Viruses divide large cells into several pieces thus becoming vulnerable. Small cells can hide behind them for protection against larger cells. == Reception == Because it was frequently propagated through social media and broadcast on Twitch and YouTube, Agar.io was a quick success. The agar.io website (for the browser version) was ranked by Alexa as one of the 1,000 most visited websites and the mobile versions were downloaded more than ten million times during their first week, and 113 million times as of December 2016. During 2015, Agar.io was Google's most searched video game. It was Google's second-most searched game in the United States in 2016. A 2015 press release by Miniclip stated that Agar.io was listed as the fifth top game on YouTube's list of top games. == References == Category:2015 video games Category:Action video games Category:Android (operating system) games Category:Battle royale games Category:Browser games Category:Casual games Category:Free-to-play video games Category:IOS games Category:Multiplayer video games Category:Miniclip games Category:Multiplayer online games Category:Social casual games Category:Video games developed in Brazil Category:.io video games",
 "title": "Agar.io"
}