{
 "id": "1131736",
 "text": "A webcam model is a person who does some performance, which is also recorded or streamed using a webcam. These people are also known as camgirl, camboy, or cammodel.These performances are often erotic. Examples are that a striptease, masturbation or other sex acts are done. Usually, these performances are done in exchange of money, goods or attention. They may also sell videos of their performances. Once viewed as a small niche in the world of adult entertainment, camming became \"the engine of the porn industry,\" according to Alec Helmy, the publisher of XBIZ, a journal about the sex-trade industry. Most webcam models perform from home. They can therefore choose how much they reveal for their boradcasts. While most display nudity and sexually provocative behavior, some choose to remain mostly clothed and merely talk about various topics, while still soliciting payment as tips from their fans. Webcam models are predominantly women, and also include noted performers of all genders and sexualities. == Websites as intermediaries == Usually, the models are present on some websites. These websites help them get their payment. People accessing the website can buy 'tokens'. In the case of a free website, they can give 'tips' to the performers. In the case of private chatrooms, they pay the performance with these tokens. The owner of the website then transfers the money to the model, minus some handling fee. The owner of the website also makes sure that the performers have a certain minimum age, as required by law. A July 2020 survey found the average webcam model in the United States works 18 hours per week, and earns $4,470 per month. Webcam models who work full-time (40 hours per week or more) earn $11,250 per month on average. Top-earning webcam models have a self-reported income of over $312,000 annually, while bottom earners take home as little as $100 per week. == References == Category:Sex industry Category:Internet culture",
 "title": "Webcam model"
}