{
 "id": "1131400",
 "text": "A rape kit is a set of tools that police and medical professionals can use after a sexual assault occurred. The main purpose is to collect evidence that can be used to help find the attacker. As some of the evidence disappears, rape kits have to be used shortly after the assault took place. Using a rape kit takes a long time. It is also a highly invasive examination. == Use == Rape kit examinations are performed by medical professionals, most commonly physicians and nurses. In some locations, examiners have received special training on performing sexual assault forensic exams. The process of collecting a rape kit is highly invasive and extremely time-consuming. The physical examination begins with the victim undressing while standing on a large sheet of paper. This sheet collects any trace evidence that may fall from the victim's body or clothes. The victim's clothing is carefully examined before each itm of clothing is individually packaged with sheets of paper between folds to protect against cross-contamination. Examiners then collect biological samples of semen, blood, saliva and other bodily fluids by swabbing the victim's genitals, rectum, mouth and body surfaces. Examiners also collect fingernail scrapings and pluck head and pubic hairs. If the facility has the means, and the victim consents, the examiner will also take photographs of genital injuries using a colposcope. The kit allows to collect biological samples, and documrnts injuries. It also helps with getting the victim's medical hisotry, emotional state, and an account of how the assoult happened. The entire process takes between 2.5 and 5 hours to complete. While the exam is going on, the victim has the right at any point to ask questions or stop the examination completely. When the collection has finished, the rape kit is sealed and typically transferred to local law enforcement. In the United States, if the victim is undecided about reporting the rape, the kit may instead be stored at the exam facility or a law enforcement facility as an \"anonymous\" kit. The law enforcement agency conducting the rape investigation can send the rape kit, in whole or in part, to the forensic science crime lab for analysis. Forensic scientists will try to develop a DNA profile of the assailant using the samples collected. If successful, the crime lab will search the DNA profile against the DNA profiles of convicted offenders and other crime scenes using a DNA database. For example, crime labs in the United States run DNA profiles through the three-tiered Combined DNA Index System (CODIS), which was developed in 1990 and contains DNA profiles at the national, state, and local levels. Similarly, the need to solve sexual assault crimes in Brazil led the Forensic DNA Research Institute of Federal District Civil Police to create a DNA database in 1998 containing evidence specifically collected in sexual assault cases. DNA matches in such databases not only aid in identifying the assailant where unknown to the victim, but also may help determine whether the assailant (known or unknown to the victim) is a serial rapist. These findings eventually may be made available for use in court. In some cases, the rape kit does not yield DNA evidence and the forensic scientist is unable to develop a DNA profile of the assailant. This may be because the assailant did not leave DNA behind, or too much time passed before the victim had a rape kit exam performed, or the rape kit evidence may have been improperly collected, stored or handled. Due to the backlog of sexual assault cases, forensic scientists have been challenged with the task of determining how to process the sexual assault kits effectively and within the statute of limitation on assaults. Damaged evidence is something that is common among rape kits because survivors of sexual assault typically desire to wash themselves as soon as possible following an attack. Prior to the exam, it is desired that patients avoid using the rest room, combing their hair, bathing, changing their clothes or cleaning up the scene of the assault. Most evidence needs to be collected within 72 hours to be viable, and patients are advised to either bring or wear the clothing they had on when attacked to the exam. == Problems == There are also some problems with using rape kits: * Some of the samples need to be tested in specially-equipped laborartories. In some cases, these laboratories do not have enough time ot test all samples. * Sometimes, rape kits are destoryed after the evidence has been collected. The victim may not be informed of this. * In many places, rape kits are not available. Also, there may not be enough medical staff trained in using them. * Rape kits are expensive. In many cases, the victim has to pay for the rape kit, but will get the money back later. == References == Category:Rape Category:Forensics",
 "title": "Rape kit"
}