{
 "id": "1132068",
 "text": "The Mujahideen Brigades () is the armed wing of the Palestinian Mujahideen Movement (). The General Secretary of the group is Dr. Asad Abu Sharia (). They are a relatively small group. The group is ideologically more extreme than Hamas, but much smaller. == History == The organization was founded in 2006 by Omar Abu Sharia (). The Mujahideen Brigades are the military wing of the Palestinian Mujahideen Movement, they split from the Fatah Movement, and its forces represent a former brigade in Fatah's militant wing the Al-Aqsa Martyrs Brigades, which was called the Brigade of the Martyr Jihad Al-Amarin () before the schism. Quote in Soon after the split they called themselves \"Al-Aqsa Brigades - Mujahideen Brigades\", and then they became \"Mujahideen Brigades\", and later \"Palestinian Mujahideen Movement - Military Wing of Mujahideen Brigades\". Quote in The leaders and founders of the Palestinian Mujahideen Movement are from the Al-Hasayna () and Abu Sharia () families in Gaza, and have Bedouin roots. == Political wing == The political wing is the Palestinian Mujahideen Movement (). == Militant activity == The militant wing is also led by the movement's leader Dr. Asad Abu Sharia (). The Mujahideen Brigades took part in the 2021 Israel–Palestine crisis. === 2023-2024 war and hostage crisis === The Mujahideen Brigades participated in the Israel–Hamas war, attacking Israeli forces in the Gaza Envelope, the Gaza Strip, and the West Bank. They joined the 7 October attacks initiated by Hamas' Al-Qassam Brigades military wing. On their telegram channels they published videos and photographs of themselves attacking a military base and a kibbutz, fighters posing with a dead IDF soldier in full combat uniform. They were largely ignored by the media for the first few months of the war, until their videos were broadcast by Arabic language news channels like Al Jazeera Mubasher and Al Araby TV. Propaganda videos from the Mujahideen Brigades used a blue triangle to highlight targets, title كتائب المجاهدين تنشر صورا لقنص 6 جنود إسرائيليين غربي خان يونس في عملية مشتركة مع سرايا القدس https://www.youtube.com/watch?v=YXhP_CUC08I Al Jazeera Live in place of the red triangle used in videos made by the Qassam Brigades. https://www.youtube.com/watch?v=oYZtzYCOvLk (note, the al-Qassam fighter in this video is using the word \"mujahideen\" in a general sense, not referring to the Mujahideen Brigades.) On 23 November the homes of the Al-Hasayna () and Abu Sharia () families were destroyed in an , that allegedly killed 93 Palestinians (). Neither side acknowledged a possible target, and only civilians casualties were reported. === Kidnapping of the Bibas family === Shiri Bibas and her two young children, Ariel and Kfir, were abducted from Kibbutz Nir Oz on 7 October 2023. Kfir was less than one year old at the time and the youngest hostage held by Gaza's militant factions. The IDF claimed they were kidnapped by Hamas, but then said were held by \"another group\" after they were excluded from the 2023 Israeli–Palestinian prisoner exchange in November 2023. In November 2023, Mujahideen Brigades stated on social media that the Bibas family was in their custody. Then on 29 November, during hostage negotiations, Hamas claimed Shiri Bibas and her children had been killed in an Israeli air strike while in captivity. In January the IDF said they were not sure if the trio were being held by Hamas. On 19 February, the IDF presented a video showing Shiri and the children still alive several days after the abduction. The video was apparently filmed in southern Gaza. The group holding the Bibas family was shown to be the Mujahideen Brigades based on CCTV footage found in Khan Younis. == Related pages == * Saraya Al-Quds * == Notes == == References == Category:Gaza Strip Category:West Bank Category:Palestinian political violence Category:National liberation movements Category:Fatah breakaway groups Category:Palestinian nationalism Category:Islamism Category:Military wings of political parties Category:Palestinian Joint Operations Room Category:Sunni Islamist groups",
 "title": "Mujahideen Brigades"
}