{
 "id": "1132887",
 "text": "Daniel Blatman (born 31 January 1953 in Tel Aviv) is an Israeli historian. He studies the history of the Holocaust. Blatman is the head of the Institute for Contemporary Jewry at the Hebrew University of Jerusalem. == Career History == Blatman was a visiting scholar at the Centre for European Studies at Harvard University, 2012–13. == Life == Daniel Blatman attended school in and studied history at the Hebrew University of Jerusalem, where he passed the first exam in 1981, completed his master's degree in 1988 and received his doctorate under in 1992. From 1981 to 1992 he worked as a high school teacher in Kiryat Shmona. Blatman became a research fellow at the Hebrew University in 1997 and an associate professor at the Institute for Contemporary Judaism in 2009. He has held visiting professorships at Tel Aviv University, New York University, Jagiellonian University, Georgetown University and Sciences Po in Paris. Blatman researched the . In 2006, during a research stay at the United States Holocaust Memorial Museum in Washington, he studied the of 1945. His publication on the death marches of concentration camp prisoners at the end of National Socialism received the Yad Vashem International Book Prize for Holocaust Research in 2011. == Criticism of the Israeli Government == In association with the the Likud-led coalition were compared to Germany in the 1930s, by journalists and historians in Israel, including Daniel Blatman. When interviewed by Ayelett Suhani for Haaretz, Blatman said \"Israel's government has neo-Nazi ministers. It really does recall Germany in 1933\". This comment got a lot of attention internationally. But it should be pointed out that he was talking about the authoritarian aspects of 1930s Germany, not the ghettos or the Holocaust. In 2016 he criticised Benjamin Netanyahu for referring to removal of from the West Bank, and other things done by Israel, as \"ethnic cleansing\". This triggered a discourse with . He is also an Israeli historian and he wrote a response article called, \"Israel Conducted No Ethnic Cleansing in 1948\". Blatman replied that ethic cleansing had been done by Israel during the . Daniel Blatman is listed in the signatures on the open letter, \"STATEMENT OF GENOCIDE SCHOLARS ON ISRAEL-PALESTINE\", from 21 May 2021. == Writing == * For our freedom and yours. The Jewish Labor Bund in Poland 1939–1949 . Translation Naftali Greenwood. London: Vallentine Mitchell, 2003, ISBN 0-85303-458-3 (Jerusalem, Hebrew Univ., Diss., 1996, Yad Vashem, 1996) * Reportage from the Ghetto, The Jewish Underground press in Warsaw, 1939–1945 . Yad Vashem, 2002 * The death marches – decision makers, murderers and victims . In: Ulrich Herbert and others (eds.): The National Socialist Concentration Camps . Vol. 2, Frankfurt am Main: Fischer, 2002, p. 1069, ISBN 3-596-15516-9 (German edition) * The Polish Street Fell Short in Its Relations with the Jews, in: Beate Kosmala, Feliks Tych (ed.) : Facing the Nazi Genocide: Non- Jews and Jews in Europe. London: Oxford University Press, 2004 * Directly from the ghetto : La presse clandestine juive dans le ghetto de Varsovie (1940–1943), ed. Cerf, 2005 * Federal Government . In: YIVO Encyclopedia of Jews in Eastern Europe, 2008 * The death marches of 1944/45. The final chapter of National Socialist mass murder . Translation from Hebrew. Reinbek: Rowohlt, 2011, ISBN 978-3-498-02127-6 (German edition) * The Death Marches. The Final Phase of Nazi Genocide, Cambridge Mass. and London: Harvard University Press, 2011 (English edition). == Prizes == *1991: The Pridan Prize for Studies in East European Jewish History, Hebrew University. *1993: Jakob Buchman Prize for the Memory of the Holocaust *2011: Yad Vashem International Book Prize for Holocaust Research. == References == == Other Websites == * Prof. Daniel Blatman at the Hebrew University of Jerusalem * Daniel Blatman at Haaretz * Daniel Blatman at en.jewish-history.huji.ac.il * Daniel Blatman, at USHMM. * Category:Living people Category:1953 births Category:The Holocaust Category:Israeli historians Category:Hebrew University of Jerusalem faculty Category:Israeli news media",
 "title": "Daniel Blatman"
}