{
 "id": "1132414",
 "text": "Nominalism is a belief in philosophy that says things like \"universals\" and \"abstract objects\" do not exist in reality. Instead, they are just names or labels we use. For example, concepts like \"strength\" or \"humanity\" are not real things on their own but are simply words we use to describe many individual things that share similar characteristics.Mill (1872); Bigelow (1998). There are two forms of nominalism. One denies the existence of universals, which are qualities or properties that can appear in different things, such as the idea of \"redness\" in red things. The other denies the existence of abstract things, which are things that are not tied to a specific time or place, like numbers.Rodriguez-Pereyra (2008) writes: \"The word 'Nominalism', as used by contemporary philosophers in the Anglo-American tradition, is ambiguous. In one sense, its most traditional sense deriving from the Middle Ages, it implies the rejection of universals. In another, more modern but equally entrenched sense, it implies the rejection of abstract objects\" (§1). Most nominalists believe that only physical things that exist in time and space are real, while universals are just ideas we have after seeing individual things.Feibleman (1962), p. 211. Some, however, believe that certain abstract entities, like numbers, are also real but different from physical objects like chairs or animals. Nominalism deals with the problem of universals, a question about which things like \"catness\" or \"greenness\" really exist outside our minds. Nominalism opposes realism, an idea that universals do exist freely of the things we see in the world. This debate has been said throughout history, dating back to philosophers like Plato and Aristotle, who had different views on this issue. In the middle ages, philosophers like Roscellinus and William of Ockham were famous in developing nominalism. Ockham's version of nominalism, known as conceptualism, argued that universals exist only as ideas in our minds, not as real things in the world. Nominalism has also affected modern philosophy, with people like Thomas Hobbes and Rudolf Carnap supporting it. In mathematics, nominalism suggests we should do math without assuming that abstract sets or groups exist as real entities. Nominalism is a way of thinking that sides with simplicity, to explain the world without adding theories or things that aren't necessary. Some philosophers argue that nominalism helped turn modern thinking and continues to affect modern philosophy and science. == References == == Further reading == * Adams, Marilyn McCord. William of Ockham (2 volumes) Notre Dame, IN: Notre Dame University Press, 1987. * American Heritage Dictionary of the English Language, Fourth Edition, 2000. * Borges, Jorge Luis (1960). \"De las alegorías a las novelas\" in Otras inquisiciones (pg 153–56). * Burgess, John (1983). Why I am not a nominalist. Notre Dame J. Formal Logic 24, no. 1, 93–105. * Burgess, John & Rosen, Gideon. (1997). A Subject with no Object. Princeton University Press. * Courtenay, William J. Adam Wodeham: An Introduction to His Life and Writings, Leiden: E. J. Brill, 1978. * Feibleman, James K. (1962). \"Nominalism\" in Dictionary of Philosophy, Dagobert D. Runes (ed.). Totowa, NJ: Littlefield, Adams, & Co. (link) * Goodman, Nelson (1977) The Structure of Appearance, 3rd ed. Kluwer. * Hacking, Ian (1999). The Social Construction of What?, Harvard University Press. * Karin Usadi Katz and Mikhail G. Katz (2011) A Burgessian Critique of Nominalistic Tendencies in Contemporary Mathematics and its Historiography. Foundations of Science. See link * Mill, J. S., (1872). An Examination of William Hamilton's Philosophy, 4th ed., Chapter XVII . * Oberman, Heiko. The Harvest of Medieval Theology: Gabriel Biel and Late Medieval Nominalism, Grand Rapids, MI: Baker Academic, 2001. * Penner, T. (1987). The Ascent from Nominalism, D. Reidel Publishing. * Peters, F. (1967). Greek Philosophical Terms, New York University Press. * Price, H. H. (1953). \"Universals and Resemblance\", Ch. 1 of Thinking and Experience, Hutchinson's University Library. * Quine, W. V. O. (1961). \"On What There is,\" in From a Logical Point of View, 2nd/ed. N.Y: Harper and Row. * Quine, W. V. O. (1969). Set Theory and Its Logic, 2nd ed. Harvard University Press. (Ch. 1 includes the classic treatment of virtual sets and relations, a nominalist alternative to set theory.) * Robson, John Adam, Wyclif and the Oxford Schools: The Relation of the \"Summa de Ente\" to Scholastic Debates at Oxford in the Late Fourteenth Century, Cambridge, England: Cambridge University Press, 1961. * Utz, Richard, \"Literary Nominalism.\" Oxford Dictionary of the Middle Ages. Ed. Robert E. Bjork. Oxford: Oxford University Press, 2010. Vol. III, p. 1000\\. * Russell, Bertrand (1912). \"The World of Universals,\" in The Problems of Philosophy, Oxford University Press. * Williams, D. C. (1953). \"On the Elements of Being: I\", Review of Metaphysics, vol. 17, pp. 3–18. ==Other websites== * * * * Universals, entry by Mary C. MacLeod and Eric M. Rubenstein in the Internet Encyclopedia of Philosophy * * Nominalism, Realism, Conceptualism, from The Catholic Encyclopedia. * Rosen, Burgess: Nominalism Reconsidered in The Oxford Handbook of Philosophy of Mathematics and Logic (2007) * Medieval Nominalism and the Literary Questions: Selected Studies by Richard Utz, with the assistance of Terry Barakat Perspicuitas, (2004) Category:Philosophy",
 "title": "Nominalism"
}