{
 "id": "1132702",
 "text": "Rose Ellen Thompson after marriage Rose Gillis (born 6 October 1902) was a British track and field athlete during the 1920s, the early era of women's athletics. She was specialized in the sprint events. She was a world record holder and a gold medalist at the second Women's World Games in 1926. ==Biography== Thompson was born in West Plumstead, Woolwich on 6 October 1902. Her parents were Jennie and James Thompson. From a young age, Rose was active in sports and also played field hockey. At the national championships in 1923 she finished second behind Mary Lines in the 100 yards event. That year she also competed at the 1923 France–Great Britain women's athletics competition and won the 100 yards, in the same time as the current world record. The medal she won that day was used as the model for the WAAA Championships medals. Two years later, in 1925, she became national champion in the 100 yards. She represented Great Britain at international competitions. In 1925 she won the 100 yards event at the 1925 Great Britain–Czechoslovakia–Canada women's athletics competition in London. The next year qualified via the 1926 Great Britain Women's World Games trials for the 1926 Women's World Games in Gothenburg. There she won the gold medal in the 4 × 110 yds relay event together with Dorothy Scouler, Eileen Edwards and Florence Haynes. Their time of 49.8 seconds was a world record, ratified by the International Women's Sports Federation, and was the first time the world record broke 50 seconds for the discipline. Their performance was used as a case study in correct form for relay racing in the 1930 book \"Athletics of To-day for Women\" by F.A.M. Webster. Their world record held until the 1928 Olympic Games, the first in which women were able to compete in athletics. Individually she won furthermore the silver medal in the 100 yards event and the bronze medal in the 60 metres event. She also competed at the 1928 Great Britain–Germany–France women's athletics match and 1929 Germany–Great Britain women's athletics match. Thompson married to Jack Gillis, who competed at the 1948 Summer Olympics and had no children. Between 1984 and 1993 there was the The Rose Gillis Trophy, named after her, that was a WAAA throphy to winners of the intermediate girls' 200 metres. ==References== ==Other websites== * Image of Thompson 100 yards (heat 2) at the 1926 Women's World Games * Image of Thopson (#16) 4x 110 yrds relay at the 1926 Women's World Games * Image of Thompson (#16), British team at the 1926 Women's World Games Category:1902 births Category:British athletes Category:British sprinters Category:World record holders",
 "title": "Rose Thompson"
}