{
 "id": "1132833",
 "text": "A source port is a project that uses the source code of a game engine to make games run on different operating systems or platforms. ==Description== Source ports are not official but use officially released source code. If this is not available, the developers try to turn the game into source code again. Most source ports require the user to provide files from the game. The phrase \"source port\" was created after Doom's source code was released. Only the Linux version of this was released because the creators of the DOS version's sound library would not have allowed it. Because most players of Doom were using DOS, the first source port of the game (DOSDoom) was made for DOS. Many source ports improve the original game. They can add support for higher display resolutions, new aspect ratios, hardware acceleration, more input devices, 3D character models (for 2.5D games), more detailed textures, digital audio (e.g. MP3) where MIDI is used, online multiplayer and more. For online multiplayer, some older games use obsolete protocols, such as IPX, or need users to know the IP address of other players. Because of this, some source ports, like Skulltag, use \"lobbies\" to make it easier to play with anyone, as players can say which games they are hosting or joining. Some newer games and services such as Valve's Steam, Blizzard's battle.net and GameSpy Arcade also have lobbies as an option. ==Alternatives== If the source code of a software is not available, emulation, remakes or static recompilation can also be used. ==Notable source ports== Original name Port Aliens versus Predator icculus.org/avp Arx Fatalis Arx Libertatis Blake Stone: Aliens of Gold / Blake Stone: Planet Strike BStone, Blake4SDL Blood BloodGDX, NBlood, Raze Carmageddon Dethrace Catacomb CatacombSDL Catacomb 3D Reflection Keen, CatacombGL Call to Power II Apolyton Civilization Site: Call to Power II: Source Code Project Commander Keen Commander Genius Descent / Descent II DXX-Rebirth, D2X-XL, DXX-Retro Diablo/ Diablo: Hellfire DevilutionX, Diablo 1 Mod (Belzebub) Doom/Doom II PrBoom, ZDoom, Chocolate Doom, etc. Doom 64 Doom64EX, Doom64Ex+ Doom 3 dhewm3, RBDOOM-3-BFG Duke Nukem II Rigel Engine Duke Nukem 3D EDuke32, DukeGDX, JFDuke3D, Rancidmeat Port, xDuke Port, nDuke Port, hDuke Port, Rednukem, Raze FreeSpace 2 FreeSpace 2 Source Code Project Gloom ZGloom Heretic Chocolate Heretic, ZDoom, Doomsday, GLHeretic for Linux, Heretic for Linux, HHeretic Hexen Chocolate Hexen, ZDoom, Doomsday, GLHexen, HHexen, WinHexen Hexen II jsHexen 2, UQE Hexen 2, Hammer of Thyrion Homeworld Homeworld SDL Ken's Labyrinth LAB3D/SDL Jagged Alliance 2 Wildfire Stracciatella/SDL The Legend of Zelda: Ocarina of Time Ship of Harkinian Marathon 2 Aleph One, Aleph One/SDL Myth II Project Magma PowerSlave PowerSlaveGDX, PCExhumed, PowerSlaveEX, ExhumedEX-Plus Quake QuakeSpasm, QuakeDS, DarkPlaces, FitzQuake, GLQuake, Project: Twilight, Telejano, Tenebrae, WinQuake, QuakeWorld, ezQuake, fodQuake, FreeQuake, vkQuake Quake II vkQuake2, KMQuake II, q^2, Q2PRO, Yamagi Quake II Quake III ioquake3, Quake3e, OpenMoHAA, Q3Base, Quake III: Arena for FreeBSD, Spearmint Quake 4 Quake4Doom, gbQuake4 Redneck Rampage RedneckGDX, Rednukem, Raze Return to Castle Wolfenstein iortcw Rise of the Triad WinROTT, GLROTT, icculus, rottexpr, NakedTriad Savage: The Battle for Newerth Savage: Rebirth Serious Sam: The First Encounter / Serious Sam: The Second Encounter icculus, Ray-Traced, Serious Sam Classic, Serious Sam Evolution Shadow Warrior JFShadowWarrior, SWP, VoidSW, Raze, WangGDX SimCity Micropolis Spelunky Spelunky ClassicHDSpelunkyClassicHD on github.com Star Control II The Ur-Quan Masters Star Trek: Voyager – Elite Force (Holomatch) iostvoyHM, cMod, Lilium Voyager Star Wars: Dark Forces The Force Engine Star Wars Jedi Knight: Dark Forces II / Star Wars Jedi Knight: Mysteries of the Sith OpenJKDF2 Star Wars Jedi Knight II: Jedi Outcast / Star Wars Jedi Knight: Jedi Academy OpenJK Strife Chocolate Strife, Vavoom Super 3D Noah's Ark ECWolf Super Mario 64 Super Mario 64 PC Port System Shock Shockolate System Shock 2 / NewDark / Thief: The Dark Project / Thief II: The Metal Age NewDark Tomb Raider OpenTomb, OpenCroft, OpenLara, CroftEngine, TR1X 'Tyrian OpenTyrian Warzone 2100 Warzone Resurrection William Shatner's TekWar BuildGDX, JFTekWar Witchaven BuildGDX, JFWitchaven Wolfenstein 3D ECWolf, NewWolf, Wolf4SDL, Wolfenstein 3-D Redux, WolfGL, WolfGL-3D Wolfenstein: Enemy Territory ioWolfET, ET: Legacy ==See also== *Fork (software development) ==References== Category:Game engines",
 "title": "Source port"
}