{
 "id": "1132072",
 "text": "The Lord Lyon King of Arms is the lowest-ranking of the officers to the Crown in Scotland. They are responsible for overseeing heraldry in the country, giving out new coats of arms, and acting as the judge in the Court of the Lord Lyon, the oldest heraldic court that is still running every day. The old name for the role was High Sennachie, which means \"high storyteller\", and they got the name \"Lord Lyon\" from the lion on Scotland's coat of arms.Moncrieffe, Ian; Pottinger, Don. Simple Heraldry Cheerfully Illustrated. Thomas Nelson and Sons. p. 48. In the early 1800s, the role was held by a nobleman, the Earl of Kinnoull. But most of the work was actually done by the Lyon-Depute. They stopped appointing Lyon-Deputes in 1866. == Responsibilities == The Lord Lyon in Scotland looks after official ceremonies, gives out new coats of arms, checks family histories and claims to old arms, and acknowledges clan chiefs after checking. The Lyon Register, where the Lord Lyon writes down all of Scotland's coats of arms, started in 1672.Moncrieffe, Ian; Pottinger, Don. Simple Heraldry Cheerfully Illustrated. Thomas Nelson and Sons. p. 63. Before, the Lord Lyon also kept records of clan tartans, but now this job is done by the Scottish Register of Tartans. Since Lyon Court is part of the government, the money paid for getting coats of arms goes to the Treasury. Using coats of arms wrongly is against the law in Scotland and is treated like not paying taxes. If someone breaks this law, they are taken to Lyon Court, where the Lord Lyon is the only judge. If someone wants to challenge Lyon Court's decision, they can do so in the Court of Session in Edinburgh. If the Lord Lyon says no to giving a coat of arms, you can't challenge their decision because it's not a court decision but a government decision. However, you could go to court and challenge if you can prove that the Lord Lyon was not fair in making the decision. == Powers == The Lord Lyon in Scotland is similar to the Earl Marshal in England, who manages state ceremonies. In Scotland, the Lord Lyon is like the English Kings of Arms, who give out coats of arms. England has three Kings of Arms: Garter Principal, Clarenceux for southern England, and Norroy and Ulster for northern England and Northern Ireland. Unlike the English Kings of Arms, the Lord Lyon can give out coats of arms without needing permission. The Lyon Court often meets and can handle criminal cases. The Lord Lyon can even destroy coats of arms that have been wrongly used. For instance, during renovations in the 1990s, some coats of arms in Leith Town Hall were found to be incorrect. The police were allowed to keep them on display, but had to explain the mistakes to visitors. The Lord Lyon is one of the rare people in Scotland who can fly the \"Lion Rampant\", which is the Royal Banner of Scotland. == Jewellry == In 1998, a new fancy chain with 40 gold links was created to replace the one lost after the Battle of Culloden. Then, in 2003, a new crown was made for the Lord Lyon, inspired by the Scottish royal crown from the Honours of Scotland. This crown has removable arches, similar to one of Queen Elizabeth The Queen Mother's crowns, which can be taken off during coronations to show respect and avoid disrespect to the monarchy. == See also == * Earl Marshal * Lord-lieutenant == References == == Other websites == * Official website Category:Heraldry Category:Monarchy of the United Kingdom",
 "title": "Lord Lyon King of Arms"
}