{
 "id": "1132859",
 "text": "Geresh and Gershaim are punctuation marks in the Hebrew script that mark abbreviations and other groups of letters that are often not Hebrew words. Its function is similar to that of the period in abbreviations, as well as the apostrophe in the Latin script, which Geresh also resembles in form. The word Gershayim is the \"dual form\" of Geresh and refers to two such characters written next to each other, which together are understood as one written character. Geresh usually comes after a group of one or more letters; Gershayim always in a group of two or more letters before the last one. The punctuation marks Geresh and Gershayim, unlike the Teamim of the same name, do not belong to the character set used in Bible texts. But they existed even before the revival of the Hebrew language in the 19th century. and 20. Century in use. == Use of Geresh and Gershayim == === Abbreviations === Abbreviations that stand for a shortened word at the end are written with Gershayim. If the abbreviation includes several words or the last letter of a single word is retained, Gershayim is used. The dot is also used as a symbol for abbreviations. The resulting sequences of letters are often pronounced as acronyms. For example (), which is an acronym for \"Israeli freedom fighters\" (note: Hebrew is written from right to left, so the first word is the word on the right, and the first letter of each word is on the right), it was the name of a militant group in Mandatory Palestine, in the 1940s. === Numbers === When using Hebrew letters as numbers, Geresh is used for single-digit numbers and Gershayim for multi-digit numbers. === Transcriptions of foreign sounds === Geresh is used to mark individual Hebrew letters to show sounds that are not used in Hebrew, when writing foreign words in Hebrew. This is particularly common in Arabic words, many letters in Hebrew are two letters in Arabic with slightly different sounds. However the Geresh is often omitted leading to mispronunciation of the Arabic words. == Typing these marks using a computer == ISO 8859-8 does not describe Geresh and Gershaim. The ASCII characters apostrophe and quotation marks (0x27 for Geresh and 0x22 for Gerschajim) should be used instead. This is also hard in writing texts encoded with a character set that includes Geresh and Gershaim, for example in pages names on Hebrew Wikipedia. == Further reading == * Heinrich Simon : Textbook of the modern Hebrew language. 9th, unchanged edition. Verlag Enzyklopädie, Leipzig 1988, ISBN 3-324-00100-5, pp. 13, 87, 161–162. == Footnotes == Category:Hebrew alphabet Category:Hebrew language Category:Punctuation",
 "title": "Geresh and Gershayim"
}