{
 "id": "1132703",
 "text": "Sangay National Park () is a national park in Ecuador. It is in more than one province: Morona-Santiago, Chimborazo, Tungurahua, Ca침ar, and Azuay. The park has two active volcanoes (Tungurahua and Sangay), and one volcano that does not erupt any more: El Altar (Kapak Urku). The park is from above sea level. Sangay National Park has many different kinds of places: ice sheets, volcano ground, tropical rainforests, cloud forests, wetlands, grasslands, and one of the largest p치ramo mountain grasslands in Ecuador. It has 327 lakes, and its wetlands covering . The park is a UNESCO World Heritage Site, listed in 1983. In 1992, it was added to the List of World Heritage in Danger because people sneak in to kill animals against the law, extensive animals eating grass, people making roads, and people doing things too close to or inside the park. It was removed from the UNESCO list of endangered sites in 2005. ==Name== The word \"sangay\" comes from the Shuar language word samkay, or \"volcano.\" ==Living things== Because the park has many different kinds of places for plants and animals to live, there are many different plants and animals there. It has more than 3,000 species of flowering plants, more than 430 birds, 107 mammals, 33 amphibians, 14 reptiles, and 17 fish species. Many rare animals live in the park, for example, the mountain tapir and spectacled bear. The mountain tapir is in danger of dying out, and the park is important to keeping it alive. Spectacled bears, giant otters, jaguars, ocelots, margays, Brazilian tapirs, white-tailed deer (Odocoileus virginianus ustus), little red brocket deer, and Northern pudu live in forests in the park. People have seen the cougar and pampas cat in the park too. Caenolestes sangay, a species of shrew opossum, was originally described in 2013 from specimens collected from Sangay National Park. Over 400 species of bird live in the park.UNEP & WCMC: SANGAY NATIONAL PARK ECUADOR, (letztes update 2005) PDF BirdLife International says this park is an Important Bird Area. The Andean Condor and Andean Cock-of-the- rock both live in the park. In 2016, scienitsts found a frog that no one had written science papers about before. They named it Pristimantis tinguichaca. ==Gallery== File:19991102 Tung large.jpg|Tungurahua volcano in 1999 File:Sangay peak.jpg|Sangay from the air File:Sangay2.jpg|Sangay ==References== ==Other websites== * http://logronoturismo.com/ * Sangay National Park on UNESCO World Heritage Centre * Jean-Claude Petit Butterflies of Sangay National Park * Spectacled Bear Research and Conservation Project in Sangay National Park by Fundaci칩n Cordillera Tropical Category:National parks in Ecuador Category:Morona-Santiago Province Category:Chimborazo Province Category:Tungurahua Province Category:Ca침ar Province Category:Azuay Province Category:World Heritage Sites in Ecuador",
 "title": "Sangay National Park"
}