{
 "id": "1132932",
 "text": "Camilla Nascimento de Oliveira (born June 28, 1975) is a Brazilian dental surgeon and public administrator with over 25 years of experience in the health sector. Throughout her career, she has distinguished herself in leadership roles and is recognized for her work in improving public health services across various municipalities in Brazil. In 2024, she was announced as the vice mayoral candidate for Campo Grande, Mato Grosso do Sul, running alongside incumbent mayor Adriane Lopes, who is seeking re-election. == Education and training == Camilla Nascimento de Oliveira graduated with a degree in Dentistry from the University of Cuiabá (UNIC). She later specialized in Restorative Dentistry and pursued additional training in the care of special needs patients. Her educational journey also includes advanced studies in health management and leadership, which have equipped her for various administrative roles within the public sector. == Career == === Public health === Dr. Camilla began her career in public health, where she quickly rose to prominent positions in different municipalities. In her hometown of São Gabriel do Oeste, she served as the President of the Health Foundation and the Municipal Secretary of Health. During her tenure, she implemented several improvements to the local health system, including the creation and coordination of the first Health Audit, Evaluation, and Control Commission, aimed at enhancing the transparency and efficiency of health services. In Campo Grande, she held the position of Head of Dentistry at SERVIMED, the municipal health service provider, ensuring high-quality dental care for municipal employees. Later, she was appointed President of the Municipal Institute of Social Security of Campo Grande, where she oversaw the administration of the city's public employee pension fund and health services, focusing on improving care for municipal workers. === Political involvement === In 2024, Camilla Nascimento de Oliveira was invited by Mayor Adriane Lopes (PP) to join her re-election campaign as the vice mayoral candidate for Campo Grande. Affiliated with the political party Avante, her candidacy was viewed as a strategic move to strengthen the administration’s focus on health management in the city. Her technical expertise and extensive experience in public administration were seen as key assets. During the official announcement of her candidacy, Dr. Camilla emphasized her commitment to the transformation of Campo Grande and her dedication to achieving positive outcomes for the city's residents. Mayor Lopes highlighted Camilla’s competency and leadership, forming a historic all-women ticket. == Personal life == Camilla Nascimento de Oliveira is married and has three children. In addition to her professional career, she is actively involved in several health and pension boards, contributing to discussions and decisions that directly impact the public health system and municipal employees' welfare. == References == Category:1975 births Category:Living people Category:Anti- communists Category:Politicians from Mato Grosso do Sul Category:People from Campo Grande",
 "title": "Camilla Nascimento de Oliveira"
}