{
 "id": "1132675",
 "text": "The Santiago rocket frog (Hyloxalus shuar) is a frog. It lives in Peru and Ecuador. ==Body== The adult male frog is about 24.2–30.8 mm long from nose to rear end and the adult female frog is 25.0–31.5 mm long. The frog has a stripe down each side of its body and marks on its chest and throat. The adult male frog has a gray throat. The male frog's male organs are white in color. ==Name== Scientists named this frog shuar after the people who have lived in this place for a very long time, the Shuar people. The Shuar people are also called Jíbaros. Some Jíbaros helped scientist John E. Simmons go to the Cordillera del Cóndor to look for frogs and other animals. ==Home== This frog lived and lives in cloud forests that are not too high up in the mountains. It used to live in many places like this. Now, scientists think it only lives in two places: One place in Santa Rosa in Peru and one place in Morona Santiago in Ecuador. Scientists saw these frogs between 1270 and 2370 meters above sea level. Scientists found one frog under a plant at night. Scientists found another frog moving around on the ground during the day. Scientists saw the frog in some protected parks: Parque Nacional Sumaco Napo-Galeras, Parque Nacional Sangay, Parque Nacional Llanganates, the Reserva Ecológica Antisana, and the Reserva Ecológica Cayambe-Coca. But they think the frogs do not live there now. The two places where the frogs live now are not in protected parks. ==Young== Scientists think that the female frog lays eggs on the ground and that the male frog carries the tadpoles to streams after they hatch, but they have not written about seeing the frogs do this yet. ==Danger== In the 1970s and 1980s, there were many of these frogs. Now, the frog is in big danger of dying out. Scientists think there are no more than 250 adult frogs alive today, no more than 50 in any one place. But when scientists look for frogs in the many of the places where this frog used to live, they do not find it: They looked in near the Reventador volcano, the Río Quijos-Topo low place, Zamora, and the Cordillera del Condór any more, and they did not find this frog there. In 2008, scientists found one frog in Morona Santiago, in Ecuador and four frogs in Santa Rosa in Peru. Scientists think many of the frogs died from people changing the places where it lives and from the fungus Batrachochytrium dendrobatidis, which causes the disease chytridiomycosis, but they do not know if the frogs still die from the disease now. People change the frog's habitat to build farms and get wood to build with. Bad chemicals in the water can also hurt this frog. ==References== Category:Frogs of South America",
 "title": "Hyloxalus shuar"
}