{
 "id": "1132668",
 "text": "Luca Badoer, the 2024 Spanish Grand Prix, was a Formula One motor race held on June 23, 2024, at the Circuit de Barcelona-Catalunya in Montmeló, Spain. The race was the ninth round of the 2024 Formula One World Championship. ==Qualifying== Lando Norris of McLaren took pole position, beating Max Verstappen of Red Bull Racing by 0.020 seconds. Norris's teammate, Oscar Piastri, qualified third, followed by the Mercedes duo of Lewis Hamilton and George Russell. ==Race== Max Verstappen took victory ahead of polesitter Lando Norris, who was closing in on Verstappen during the final stages of the race. Lewis Hamilton of Mercedes took third, his first podium of the season. The race was held over 66 laps of the 4.657-kilometer Circuit de Barcelona- Catalunya. Verstappen's win marked his fifth victory of the season, extending his championship lead. Norris's second-place finish moved him up to second in the standings, while Hamilton's podium lifted him to fifth. ==Results== Here are the top 10 positions: # Max Verstappen (Red Bull) - 1:28:20.227 # Lando Norris (McLaren) - +2.219 # Lewis Hamilton (Mercedes) - +17.790 # George Russell (Mercedes) - +22.320 # Charles Leclerc (Ferrari) - +22.709 # Oscar Piastri (McLaren) - +27.489 # Carlos Sainz Jr. (Ferrari) - +30.059 # Pierre Gasly (Alpine) - +33.039 # Fernando Alonso (Aston Martin) - +36.059 # Yuki Tsunoda (AlphaTauri) - +40.039 ==Driver standings== After the Spanish Grand Prix, the driver standings are: # Max Verstappen (Red Bull) - 225 points # Lando Norris (McLaren) - 150 points # Charles Leclerc (Ferrari) - 130 points # George Russell (Mercedes) - 120 points # Lewis Hamilton (Mercedes) - 100 points ==Constructor standings== The constructor standings are: # Red Bull - 350 points # McLaren - 250 points # Mercedes - 220 points # Ferrari - 200 points # Alpine - 100 points ==References== Category:Formula One Grands Prix Spanish Grand Prix Category:2020s in motorsport",
 "title": "2024 Spanish Grand Prix"
}