{
 "id": "1132050",
 "text": "The Palestinian Joint Operations Room (Arabic: ), also known as the Joint Room for Palestinian Resistance Factions (Arabic: ), is a united front that includes the military arms of the Palestinian armed factions in the Gaza Strip. It includes armed groups from various backgrounds, and ideologies from both the right and the left, including Islamists, socialists, nationalists, and others. * : Hamas * : Palestinian Islamic Jihad (PIJ) * : Popular Front for the Liberation of Palestine (PFLP) * : Democratic Front for the Liberation of Palestine (DFLP) * : Popular Resistance Committees (PRC) * Mujahideen Brigades: (Palestinian Mujahideen Movement) * (ex-Fatah, no longer aligned with it) * : (Popular Front for the Liberation of Palestine – General Command (PFLP-GC) * Al-Ansar Brigades (Palestinian Freedom Movement) Ex-Fatah groups not mentioned by Nofal:\"Hamas terrorist Ayman Nofal explains the workings of the Palestinian organizations' joint operations room in the Gaza Strip\". * Ayman Jawda Squadsموسى, رائد. * Abd al-Qadr al-Husseini Brigades * Al-Assefa Army ==Background== It was formed for the first time in 2006 in order to unite against Israel during clashes and wars and included Hamas and the Islamic Jihad Movement. It was then developed, expanded, and was formed under its current name on July 23, 2018, among 12 military wings after clashes around Al-Aqsa Mosque, the most prominent of which was the installation of electronic gates there by Israel, in what is considered Israeli-occupied East Jerusalem. It currently consists of 12 different armed groups, and has coordinated a large number of attacks on Israel including the October 7 attacks, and has also coordinated defence and retaliations against Israeli attacks. Ayman Nofal in May 2023 explained the goals and organization of the room, which he said was to create an inter-organizational alliance to coordinate operations, and increase the potential of the \"Palestinian Resistance\", and for it to \"become a comprehensive framework for all the organizations, networks and fighters, without exception\". He also gave a list of the 9 factions out of 12 which he said were \"fully unified under the room\". == References == Category:Gaza–Israel conflict Category:Palestinian Joint Operations Room",
 "title": "Palestinian Joint Operations Room"
}