{
 "id": "1132091",
 "text": "Cryptids are animals that cryptozoologists believe may exist somewhere in the wild, but whose present existence is not verified. Creatures that may be considered cryptids include Bigfoot, Yeti, the chupacabra, the Jersey Devil, the Loch Ness Monster, and the Mokele-mbembe. == List == === Found in the ocean/ocean and water === Name Other Names Description Purported Location Depiction Hairy Eel Pond animal Pamital ravine, Canary Islands Caddy Sea animal Pacific Coast of North America Champ Champy Lake monster Lake Champlain, North America Cryptid WhalesMörzer Bruyns, W. F. J. (1971). Field guide of whales and dolphins. Rivonverhandeling. Tor. pp. 124–125. Giglioli's Whale, Rhinoceros dolphin, High-finned sperm whale, Alula whale, Unidentified beaked whales Sea animal Pacific Ocean, Atlantic Ocean, Indian Ocean Dobhar- chú Water Hound, King Otter Extra-large otter-like carnivorous aquatic mammal Ireland Gloucester sea serpent Large serpent Gloucester, Cape Ann Iemisch Iemisch Listai Mix of a jaguar and otter Patagonia Igopogo Kempenfelt Kelly Lake monster Lake Simcoe, Ontario (Canada) Isshii Issie Lake monster Japan Labynkyr Devil Labynkyrsky Chert Lake monster Oymyakonsky Ulus, Sakha Republic, Russia Loch Ness Monster Nessie Lake monster Loch Ness, Scotland Loveland Frog Loveland frogman, Loveland lizard Humanoid frog Loveland, Ohio Lusca Giant Octopus Blue holes in the Bahamas Mamlambo Lake monster South Africa Manipogo Winnipogo Lake monster Lake Manitoba, Canada Megalodon Otodus megalodon Giant Shark Oceans Mokele-mbembe Dinosaur (lake, river and/or swamp monster) Republic of the Congo Ogopogo N'ha•a•itk, Naitaka Lake monster Lake Okanagan, Canada Sea serpents Sea animals, dinosaurs All bodies of water Selma Seljordsormen Lake monster Lake Seljord, Telemark, Norway Steller's sea ape Sea animal Pacific Ocean === Found on land === Name Other names Description Purported location Depiction British big cats Alien big cats (ABCs), phantom cats, mystery cats, English lions, Beast of Bodmin, Beast of Exmoor Carnivorous mammal Great Britain Capelobo Humanoid anteater monster Brazil Chupacabra Chupacabras (Spanish for goat- sucker) Puerto Rico (originally), South and Central America, Southern North America Dover Demon Dover, Massachusetts Eastern Cougar Eastern United States Lizard Man of Scape Ore Swamp Lizard Man of Lee County Bipedal South Carolina, United States Malagasy hippo Malagasy pygmy hippopotamus, Madagascan pygmy hippopotamus, kilopilopitsofy, tsy-aomby-aomby, omby-rano, laloumena, mangarsahoc Hippo Madagascar Mapinguari Mapinguary Giant Ground Sloth or primate Amazons Michigan Dogman Humanoid dog Wexford County, Michigan Minhocão Big Earthworm Caecilian South America Moa Flightless bird New Zealand Mongolian death worm Allghoi (or orghoi) khorkhoi Worm-like animal Gobi Desert (Asia) Nandi bear Chemosit, Kerit, Koddoelo, Ngoelo, Ngoloko, Duba Large carnivore Eastern Africa Queensland Tiger Yarri Large feline Queensland Thylacine Tasmanian Tiger, Tasmanian Wolf Marsupial Australia, New Guinea Zanzibar leopard Large feline Zanzibar ====Primates==== Name Other names Description Purported location Depiction Almas Abnauayu, almasty, albasty, bekk-bok, biabin-guli, golub-yavan, gul-biavan, auli-avan, kaptar, kra-dhun, ksy-giik, ksy-gyik, ochokochi, mirygdy, mulen, voita, wind-man, Zana Non-human ape or hominid Asia/Caucasus Amomongo Orang Mawas, Impakta Ape or hominid Negros Occidental, Philippines Barmanou Barmanu, Big Hairy One Ape or hominid Middle East/Asia Bigfoot Sasquatch Large and hairy ape-like creature United States and Canada Bukit Timah Monkey Man BTM, BTMM Forest-dwelling hominid or other primate Singapore Chuchunya Large hominid Russia Fouke Monster Jonesville Monster, Southern Sasquatch, Boggy Creek Monster Hominid or other primate Arkansas, United States Honey Island Swamp monster Letiche, Tainted Keitre Hominid or other primate Louisiana, United States Orang Pendek Small hominid Sumatra Nittaewo Nittevo Small hominids Sri Lanka Skunk ape Stink Ape, Myakka Ape, Myakka Skunk Ape Primate Florida, United States Yeren Yiren, Yeh Ren, Chinese Wildman Primate (possible hominin) China Yeti Abominable Snowman Large and hairy human-like entity, various other descriptions Himalayas (Asia) Yowie Large and hairy human-like entity, various other descriptions Australia === Flying === Name Other names Description Purported location Depiction Jersey Devil Leeds Devil Winged bipedal horse United States, mainly the South Jersey Pine Barrens, as well as other parts of New Jersey and southeastern Pennsylvania Mothman Winged Man, Bird Man, UFO-Bird, Mason Bird Monster Winged bipedal Mason County, West Virginia, United States Rod Skyfish, Air Rod, Solar Entity Small flying stick-like creatures Worldwide Ropen Large bat-like creature or pterosaur New Guinea Thunderbird Giant bird North America ==References== Category:Lists *",
 "title": "List of cryptids"
}