{
 "id": "1132969",
 "text": "Safiye Sultan (, \"the pure one\"; 1550 – post 1619) was the Haseki Sultan of the Ottoman Sultan Murad III and the Valide Sultan as the mother of Mehmed III. Safiye was one of the most influential woman during the time of the Sultanate of Women. She lived through the reigns of seven Ottoman sultans, Suleiman the Magnificent, Selim II, Murad III, Mehmed III, Ahmed I, Mustafa I and Osman II. After the death of Selim II in 1574, Murad ascended the throne as the new Sultan of Constantinople. Safiye also came to Constantinople and moved with him to the Topkapi Palace. Before Murad had been in power for a year, she had been given the title Haseki Sultan, and had attained a higher rank than the Sultan's own sisters Şah Sultan, Gevreyhan Sultan, Ismihan Sultan, and Fatma Sultan. Murad's mother, Nurbanu Sultan, was upset with Safiye's influence over Murad and wanted to replace her with other concubines and banish her from the harem. From 1577 to 1580, Nurbanu even plotted against Safiye, with the help of Murad's cousins Ayşe Humaşah Sultan (daughter of Mihrimah Sultan) and Humaşah Sultan (daughter of Şehzade Mehmed). The death of the powerful Grand Vizier Azam Sokollu Mehmed Pasha left the Sultan isolated and the Sultan allowed his close associates to exercise power, which intensified the conflict between Safiye and Nurbanu. In 1580, the conflict between Safiye and Nurbanu reached a critical point, and Murad sent Safiye into exile in Eski Saray. She lived there for a few years before Nurbanu's death, but Murad brought her back to him after his mother's death in December 1583. Apart from Nurbanu, she had become the most powerful woman in the harem. Moreover, she was not satisfied with her position and began to interfere in state affairs. She eventually became one of the most powerful figures in Murad's reign and managed the union network on a larger scale to regain influence in state affairs. Her position at court became even more influential when she became Valide Sultan after the accession of her son Mehmed III to the throne in 1595 after Murad's death. As Valide Sultan, her personal wealth was three times that of the sultan, the highest salary for a person in the empire. During her son's reign, Mehmed consulted her on important matters and would not make any decisions without her consent. Safiye Sultan interfered not only in domestic affairs, but also in the foreign affairs of the empire. It is known that she corresponded with foreign kings and queens (the most famous of whom was Elizabeth I of England) and established diplomatic relations with them. But in the last years of his son's reign, her interference in state affairs led to three disastrous rebellions and Safiye became highly disliked by the soldiers and the people. However, no one could break Safiye's influence and dominance over the government until the end of her son's reign. After the death of Mehmed III in 1603, she was sent to Eski Saray by his grandson, the new Sultan Ahmed I, on 9 January 1604, where she lived a retired life without political influence until her death. She died after 1619 and was buried in the Mausoleum of Murad III (Hagia Sophia). == Background == According to the Venetian ambassadors Bailos Morosini (1585) and Lorenzo Bernardo (1592), she was of Albanian origin, a fact confirmed by Lazzaro Soranzo (1598) who claimed that she was from the village of \"Rezi\" (probably modern Krizi) in the Dukagjin Mountains of Albania. However, other primary sources give different information: Stefan Gerlach in 1575 says she was born in Moldavia, another in 1576 says she was born in Bosnia, Bailo Antonio Tiepolo in 1576 says she was born in Slovenia, and Bailo Jan in 1594 says she was Circassian. citing: Morosini, Bernardo, Tiepolo and Zane in Albèri (ed.), Relazioni Degli Ambasciatori Veneti III, iii p.283-286, ii p.259, ii p.166, iii p.439; Soranzo, L'Ottomano, p.2She is sometimes mistakenly described as a Venetian from the Baffo family. Modern scholars generally describe him as of Albanian origin. In 1563, at the age of thirteen, she was brought as a slave to Humaşah Sultan, the daughter of Şehzade Mehmed. Later, she became the concubine of Şehzade Murad, the eldest son of Şehzade Selim. On 26 May 1566, after two daughters, she gave birth to Murad's first son, Mehmed. That same year, Suleiman the Magnificent died and Şehzade Selim ascended the throne as Sultan Selim II. == Haseki Sultan == In 1574, Selim died and Sehzade Murad became the new sultan as Murad III. Safiye and her children immediately returned from exile to Constantinople. Safiye immediately received the rank of Haseki and received a daily salary of 800 aspers. However, in Constantinople, she wanted Murad's mother, Nurbanu Sultan, who was the most beloved and respected by Murad, to be part of their personal daily life. Nurbanu ruled over the entire palace and household as the valide and head of the harem, and Safiye lived as haseki next to Nurbanu. For the first few years, although the harem was usual, there was no open struggle between the two women. However, Safiye tried to gain political power, which was a completely reasonable move as the mother of princes. However, Nurbanu did not value Safiye's aspirations in political life or her attempts to influence Murad. Nurbanu Safiye sees her influence over the family and Murad as a threat to Nurbanu. At that time, Murad, being away from the harem, and due to his trust in his mother and love for his wife, Murad trusted them. Safiye was Murad's only concubine before he ascended the throne. She had been monogamous with him for several years. Nurbanu advised Murad to take other concubines for the good of the dynasty, because by 1580 Murad had only one surviving son as heir: Mehmed, son of Murad and Safiye. In 1580, Nurbanu Safiye was accused of being a witch and sorcerer and accused of making Murad impotent and preventing him from taking new concubines. This resulted in the imprisonment, exile, torture, and execution of Safiye's close friends and servants. Murad, who believed in witchcraft and astrology, took the rumor seriously - eventually, in 1580, Safiye was exiled to the Eski Saray (Old Palace) by Sultan Murad. Murad's sister Ismihan presented him with two beautiful concubines, which he accepted. After he recovered from his impotence, he fathered over fifty children, although according to some sources, the total number of children, including those who died in infancy, may have exceeded one hundred. Venetian reports state that after initial bitterness, Safiye maintained her dignity and showed no jealousy towards Murad's concubines. He valued Safiye and consulted her on political matters, especially after Nurbanu's death. After Nurbanu's death in December 1583 and Safiye's arrival at the Topkapi Palace, Safiye probably increased her influence over Murad, perhaps simply to participate in political affairs. As Giovanni Moro reported in 1590: Safiye occasionally interfered in state affairs, although she was respected by the people and was considered prudent and wise by her Majesty. Safiye also developed her own extensive network of relations during this period and began to immerse herself in every aspect of politics. With the support of the chief Khoja Ghazanoff Agar, she increasingly influenced Murad's decisions and gained more power. This greatly unsettled the Grand Vizier. Of course, Koca Sinan Pasha, also an Albanian, who served as Grand Vizier for three terms during Murad's reign, was Safiye's greatest supporter. Like Nurbanu, she also spoke to Murad about Venice for the sake of Venice. Although she was able to influence the Sultan in various ways, she was not always able to shape events to her own taste. For example, in 1593, he tried to persuade Murad to accept the English ambassador of his choice. However, Murad did not listen much, having already rejected Safiye's proposal. Thus, although Murad's power and influence increased during his reign and he was not able to achieve many of his interests and goals, the Sultan also set serious boundaries for him. === The question of marriage === Safiye arrived at the Istanbul palace as a baş haseki (chief favorite) and during her 32 years of marriage to Murad, she was the only concubine for 20 years. Selianiki called Safiye \"the glorious and honorable lawful wife Safiye Hatun\", from which we can conclude that Murad III granted her freedom and performed a nikah. Pedani noted that foreign sources did not report this marriage until 1585. Furthermore, in 1585, Bailo Giovan Francesco Morosini, in response to a question from the Venetian Senate, stated that Murad III did not marry his haseki,although he granted her exceptional privileges. However, Pedani noted that Morosini left Istanbul that year and after his departure, rumors of his marriage began to spread. Another ambassador, Lorenzo Bernardo, received information from Kira Esther Handali in October 1585 that preparations were underway for the marriage of Safiye and Murad's daughter Ayşe Sultan to the vizier İbrahim Pasha, and that Safiye was to be married at the same time. On 11 December, it was decided that the double wedding would be celebrated during the spring festival of Nowruz. At the same time, Bailo sent information to Venice and generous gifts for the Sultan and Sultana. On 24 December, Safiye sent a reply thanking Venice for the fact that a \"Venetian gentleman shared his joy\" with the Sultan's gift. The Venetian Senate immediately sent a letter to Safiye congratulating her on the occasion of the marriage. However, Pearce notes that \"the Jew Solomon\", who prepared a report for the English envoy at the time of Murad III's death, wrote that the Sultan did not marry Safiye because \"some bitter enemy of his mother advised him not to do so, otherwise he would not be able to live long after the marriage, as was done by his father\". Akildiz also believed that the marriage was never consummated, especially if foreign sources are taken into account. Ottoman scholar Anthony Alderson also denies information about this marriage, noting that after 1520, the Ottoman sultans entered into only three formal marriages, and the marriage of Murad III and Safiye was not among them.Among these three marriages, Alderson lists the union of Suleiman I and Hürrem Sultan, Osman II and the daughter of Shaykh al-Islām Akile Hatun and Ibrahim I and Hümaşah Sultan. All three marriages were contrary to the traditions and interests of the empire, and in two cases even led to the overthrow of the sultans. At the same time, Pearce, noting that since the end of the 15th century, the Ottoman sultans had not entered into legal marriages, although the princes could marry. == Valide Sultan == After Murad's death in 1595, Safiye succeeded her son Mehmed as sultan, becoming one of the most powerful sultans in Ottoman history. Her son trusted her greatly, so she became more active in domestic and foreign affairs, allowing the new sultan to largely rule and gain influence. One example of this was the execution of Fürkla by drowning adulterous women in the Bosphorus. Until her son's death in 1603, Ottoman politics were determined by a group led by her and the head of the White Guards and the head of the Endurance (imperial inner palace), Ghazanfar Ağa. She was to lead the army in her son's stead. She paid for her son's war expenses from her personal account. The people and civil servants appealed to her directly for help, as they knew how influential she was in the Ottoman court. Sometimes they would even jump in front of his horse-drawn carriage for help. He was the most influential in managing everything related to the empire and in the terms of appointment and dismissal of everyone in the empire, even the Grand Vizier and Sheikh al-Islam. When Mehmed III went on his Eger campaign in 1596, he left one billion aks for Safiye's service and gave Safiye the power to oversee important matters in his absence. After the fall of the Eger fortress, he distributed alms to the poor, orphans and widows. Safiye Valide arranged for himself the highest allowance as sultan. Finally, towards the end of his son's reign, he enjoyed a huge allowance of 3,000 aspers per day. When Mehmed III went on the Eger campaign in Hungary in 1596, he gave his mother great power over the empire and put her in charge of the treasury. During his interim reign, he persuaded his son to revoke the political appointment of the judge of Constantinople and to restore the office of Grand Vizier to his son-in-law, Damat Ibrahim Pasha. Therefore, no one could do anything in the capital, or even in the entire empire, without Safiye's permission. During his son's nine- year reign, corruption in his government was revealed against him. During this period, the English ambassador's secretary reported that, while at the palace, Safiye \"saw several boats rushing together on the [Bosphorus] river. The queen mother wanted to know [and] was told that the vizier had executed some of the keys [kahpe], i.e. prostitutes. She was displeased and sent word and advised [the vizier] that her son had left her to manage the city and not to consume women; [thus] ordering him to concentrate on other matters and not to interfere with women again until his master returned.\" Safiye's greatest crisis as a legitimate sultan came from his dependence on Kira, Esperanza Malchi. Kira was a non-Muslim woman (usually Jewish) who was a recluse in the harem and acted as an intermediary between the outside world, acting as a business agent and secretary. It is known that Malchi tried to negatively influence Safiye (and through her the Sultan) in their policy towards the Republic of Venice through a conflict with the Venetian spy Beatrice Megil, which led to open conflict at court on at least one occasion. In 1600, Malchi and her son revolted as a result of the imperial cavalry, who owned more than 50 million shillings. Safiye was blamed for this, almost incurring the wrath of the soldiers, who brutally murdered Malchi and her son. Mehmed III was forced to say that \"he advised his mother and corrected his slaves.\" So that the soldiers would not suspect his influence over the Sultan, Safiye persuaded Mehmed to have his decrees written by the Grand Vizier instead of signing them personally. But for a few weeks in 1600, the Sultan found his mother's influence over him and her presence at the palace annoying and wanted her to leave the palace and no longer control his affairs. However, she had built up a large support group and continued to exert a silent influence over the kingdom through a chief eunuch, appointing her allies to powerful positions. After five weeks, the Sultan revoked his mother's exile and returned her to his palace, placing her in the inner circle of advisors who effectively ran the government. Safiye played a key role in the execution of her grandson Mahmud in 1603. She did not reveal a message from a religious sage, which predicted that Mehmed III would die within six months and that his son would succeed him. According to the English ambassador, Mahmud was \"dejected by the fact that his grandmother Safiye Sultanate and the Ottoman Empire were heading towards ruin under his father, he only wanted to gain money and often expressed his grief to his mother,\" who \"did not distrust the queen mother.\" Mahmud was therefore a serious threat to Safiye and her son's reign. The sultan was provoked by Safiye, suspected of a plot and jealous of his son's popularity, and Mehmed strangled her to death. His son Ahmed I succeeded Mehmed in 1603. One of his first important decisions was to deprive his grandmother of power - she was exiled to the Old Palace on Friday, 9 January 1604. This was the end of her reign, which had lasted 19 years through her husband and son. When Ahmed I's brother Mustafa I became sultan in 1617, his mother Halime Sultan received 3,000 aspers, although her mother-in-law Safiye was still alive. However, during her son's two reigns, Halime only received 2,000 aspers when she retired to the Old Palace; Safiye was still alive during the first months of Halime's retirement, probably because she had no family in the Old Palace, Safiye received 3,000 aspers per day, while Ahmed I's Haseki Sultan, Kösem Sultan, also lived in the Old Palace, receiving 1,000 aspers per day. All subsequent sultans were descendants of Safiye. == Foreign Relations == Like Nurbanu, Safiye generally favored pro-Venetian policies and regularly corresponded with Venetian ambassadors, one of whom described her in a letter as \"a faithful woman of one word and I say that in her alone I have found the truth in Constantinople; so I thank her for her gratitude and help.\" Safiye also maintained good relations with England. She persuaded Mehmed III to allow the English ambassador to go to war with him in Hungary. A unique aspect of her career is that she corresponded personally with Queen Elizabeth I of England, volunteering to petition the Sultan on Elizabeth's behalf. The two women also exchanged gifts. On one occasion, Safiye gave \"two dresses of silver cloth, a girdle of silver cloth, [and] two handkerchiefs made of large gold\" to someone, and Safiye gave Elizabeth a portrait in return. In a letter from 1599, Safiye responded to Elizabeth's request for good relations between the empires: > I have received your letter...God willing, I will act according to what you > have written. Be assured of this. I will always advise my son, the Padishah, > to act according to the agreement. I will talk to him. God willing, may you > not be sad about this. May you also always be firm in friendship. God > willing, may [our friendship] be eternal. You sent me a carriage and it was > delivered. I accepted it with joy. And I sent you a dress, a wristlet, two > large gold embroidered bath towels, three handkerchiefs and a ruby and pearl > tiara. You forgive [the unworthiness of the gift]. Safiye would cover the carriage and use it when travelling around the city, which was considered scandalous. This exchange of letters and gifts between Safiye and Elizabeth presented an interesting gender dynamic in their political relationship. In keeping with the traditional means of exchange to secure diplomatic, economic or military alliances, Elizabeth and Safiye's exchanges brought them positions of power rather than objects of exchange. An unusual incident in Safiye's relationship with England was Safiye's attraction to Sir Paul Pinder, secretary to the English ambassador and rescuer of Elizabeth's coach. According to Thomas Dallam, \"The Sultana was very fond of Mr. Pinder and, later, she sent him to the Sultan to be her personal companion, but their meeting was cancelled.\" == Public works == Safiye Sultan is also famous for having begun construction of the Yeni Mosque in Eminonu, Constantinople, in 1597. Part of Constantinople's Jewish quarter was demolished to build the mosque, which made Safiye unpopular with the soldiers, who wanted to exile him. At one point, Mehmed III temporarily sent him to the Old Palace. Although he returned, he did not live to see the mosque completed. After Mehmed's death, Safiye lost power and Sultan Ahmed I permanently exiled him to the Old Palace. Construction of the mosque was halted for several decades. It was finally completed in 1665 by another Valide Sultan, Turhan Hatice, the mother of Mehmed IV. === Masjid al-Malika Safiyya === The Al- Malika Safiye Mosque in Cairo was built in honor of Safiye Sultan. It was initially occupied by Osman Agha, who held the position of Agha Dar al-Sa'da, who was in charge of the harem, as well as the Egyptian waqf property of the holy places in the Hejaz. He was also Safiye Sultan's agent and servant. However, he died before the mosque was completed and it damaged much of Safiye's property. He assigned the mosque to thirty-nine guardians by deed, which included a general caretaker, a preacher, a khatib (speaker), two imams, a timekeeper, an incense burner, a repairman, and a gardener. == Death == Safiye Sultan died in the old palace after 1619, following the deaths of Murad III, her son Mehmed III, and even her grandson Ahmed I. Safiye was buried in the tomb of Murad III inside the Hagia Sophia. == Issue == It is believed that Murad had a monogamous relationship with Safiye Sultan and that she was his sole concubine between 1563 and 1580.Baki Tezcan - The Debut of Kosem Sultan’s Political Career (2008)Uluçay, Mustafa Çağatay (2011). Padişahların kadınları ve kızları. Ankara, Ötüken. From Murad, Safiye had at least six children, three sons and three daughters: * Hümaşah Sultan (Manisa, c. 1564 – Constantinople, c. 1648. Buried in Murad III's mausoleum in Hagia Sofia Mosque). Also called Hüma Sultan. She married Nişar Mustafazade Mehmed Pasha (died 1586). Then she married Serdar Ferhad Pasha (died 1595) in 1591. She was lastly married in 1605 to Damad Nakkaş Hasan Pasha (died 1622). * Ayşe Sultan (Manisa, 1565 – Constantinople, 15 May 1605). She married three times. * Mehmed III (Manisa, 26 May 1566 – Constantinople, 21 December 1603); he succeeded his father as Ottoman sultan. * Şehzade Selim (Manisa, 1567 – 25 May 1577, buried in Hagia Sofia Mosque). * Şehzade Mahmud (Manisa, 1568 – before 1580, buried in Hagia Sofia Mosque). * Fatma Sultan (Manisa, 1573 – Constantinople, 1620). She married four times. Also, she was probably, but not definitely, the mother of: * Mihrimah Sultan (Constantinople, 1578/1579 – Constantinople, post 1625). * Fahriye Sultan (died 1656, buried in the Mausoleum of Murad III in the Hagia Sophia Mosque), also called Fahri Sultan. Probably Safiye's daughter, born to her mother after her return from exile in the Old Palace. In addition to these, a European named Alexander of Montenegro claimed to be the lost son of Murad III and Safiye Sultan. He presented himself as Shahzade Yahya and claimed the throne for himself. His claim to the throne has never been proven and is not believed by modern historians to be true. == In literature and popular culture == * In Anne Chamberlain's book Sophia, Safiye Sultan is portrayed as the 14-year-old daughter of a Venetian nobleman who was taken to Constantinople by corsairs. * In Katie Hickman's book The Aviary Gate, which tells the story of Safiye Sultan's affair with an English merchant and an English captive in the harem, Safiye is seen as an important character. There is an explanation given of how she arrived in the harem from the Albanian mountains. * Mary Shelley's 1818 novel Frankenstein features a minor character named Safie, believed to be Safie Sultan. * In the 2011 TV series Muhtesem Yuzyil, Gozde Türker played the role of Safiye Sultan. She was a maidservant of Murad's aunt Mihrimah Sultan before becoming Murad's concubine. * The 2015 TV series Muhtesem Yuzyil: Kösem, featured Turkish actress Hulya Avsar as the elderly Safiye Sultan. == Related pages == * Ottoman dynasty * Ottoman Empire * Suleiman the Magnificent * 1600 Year * 1550 Year * Murad III == References == == Notes == == Bibliography == * * * * * * * Category:1550s births Category:1620s deaths Category:Consorts of Ottoman sultans Category:Haseki Sultan Category:Mothers of Ottoman sultans Category:Royal favourites Category:Former Christians from the Ottoman Empire",
 "title": "Safiye Sultan (mother of Mehmed III)"
}