{
 "id": "1132112",
 "text": "Hanna Jędrzejewska with married name Jabłczyńska (15 April 1906 - 29 May 2002) was a Polish track and field athlete competing in sprint events, middle distance, long jump and standing long jump. She was a member of AZS Poznań and represented Poland internationally. She later became a chemist and conservator of monuments. ==Biography== ===Sports career=== Jędrzejewska was a member of AZS Warszawa. During 1923 and 1927 she won 12 medals at the Poland Athletics Championships, and became Polish champion in the long jump in 1926 and in the 4 × 75 metres relay and 4 × 200 metres relay in 1927. She represented Poland at the 1926 Women's World Games in Gothenburg, where she finished 11th in the long jump event and also competed in the 100 yard hurdles event. The next year she competed at the 1927 Poland-Austria women's athletics match in the 80 metres hurdles and long jump. She was co-author of the book Narciarstwo published in 1935. ===Professional career=== Jędrzejewska began her studies at the university in 1923. She obtained her doctorate in chemistry in 1930. She worked at the Faculty of Chemistry at the University of Warsaw as an assistant professor. She spent the German occupation during World War II in Zakopane. The materials for her habilitation thesis were burned during World War II. She was running a photography studio. Her husband Edward Jędrzejewski fought as a pilot in England. After the war, she took up work at the Faculty of Chemistry at the University of Warsaw, but had to resign as a result of unconfirmed reports of contributing to the exposure of an emissary of the emigration authorities during the occupation. From 1956, she focused on work in the field of conservation of monuments, lecturing on chemistry and theoretical technology as an assistant professor at the Academy of Fine Arts in Warsaw. She also organized the Research Laboratory for the Department of Ancient Art at the Warsaw National Museum. She distinguished herself in the study of ancient frescoes from Faras. She worked at the National Museum until 1970. Between 1972–1974 she lectured at the Faculty of Art History of the Cardinal Stefan Wyszyński University. She was a UNESCO expert in the field of conservation of monuments. She published, among others, the work Ethic in Conservation (Stockholm 1976). Her daughter Teresa Jędrzejewska-Ścibak is a retired professor at the Warsaw University of Technology. Jędrzejewska died in May 2002 and was buried at the Powązki Cemetery.Cmentarz Stare Powązki: EDWARD JĘDRZEJEWSKI ==References== Category:1906 births Category:2002 deaths Category:Polish long jumpers Category:Polish sprinters Category:Sportspeople from Warsaw Category:Polish hurdlers Category:Polish chemists",
 "title": "Hanna Jędrzejewska"
}