{
 "id": "1132140",
 "text": "\"867-5309/Jenny\" is a song by American rock band Tommy Tutone. It was released as a single on November 16, 1981. It peaked at number four on the Billboard Hot 100 and number one on the Rock Top Tracks chart in April 1982. The song led to a fad of prank calling the number 867-5309 and asking for \"Jenny\". Bruce Springsteen's 2007 single \"Radio Nowhere\" has a set of guitar riffs at the beginning that are similar to \"867-5309/Jenny\". The lyrics and the tone of the two songs are quite different. Tommy Heath has stated he had no interest in suing. If anything, he felt \"really honored at a similarity, if any\". == Creation == Lead guitarist Jim Keller has said \"Jenny is a regular girl, not a hooker. Friends of mine wrote her name and number on a men's room wall at a bar. I called her on a dare, and we dated for a while. I haven't talked with her since the song became a hit, but I hear she thinks I'm a real jerk for writing it.\" Tommy Tutone lead singer Tommy Heath stated on the WGN Morning News that the number was real. He said it was the number of a girl he knew. As a joke, he wrote it on a bathroom wall in a motel where they were staying. \"We laughed about it for years,\" he said. In a June 2004 interview with Songfacts, co-writer Alex Call explained the song's real origins. \"There was no Jenny. \"I was just trying to write a 4-chord Rock song and it just kind of came out.\" He added that \"Tommy Tutone's been using the story for years that there was a Jenny and she ran a recording studio and so forth. It makes a better story but it's not true. That sounds a lot better than I made it up under a plum tree in my backyard.\" In the song's music video, the \"Jenny\" character is played by Karen Elaine Morton. == Charts == ===Weekly charts=== Chart (1982) Peak position Australia (Kent Music Report) 22 US Cash Box Top 100 5 ===Year-end charts=== Chart (1982) Rank Canada Top Singles (RPM) 20 US Billboard Hot 100 16 US Cash Box Top 100 38 ==References== ==Other websites== * * 867-5309 in all US and Canadian Area Codes (Telephone World) Category:1981 songs Category:Telephone numbers in the United States",
 "title": "867-5309/Jenny"
}