{
 "id": "1132438",
 "text": "Unilateral secession is the alleged right for a part of the population to secede from the union, or separate and secede from the territory of a State, without prior consent of the previous Sovereign state to become independent, this creates strain for the relationship to the state. ==Examples== Examples of secession other than Rhodesia's UDI in 1965 include that of the United States in 1776,Don H. Doyle. Secession as an International Phenomenon: From America's Civil War to Contemporary Separatist Movements. University of Georgia Press, 2010. the Irish Declaration of Independence of 1916 by a revolutionary parliament, Katanga's declaration of independence by Moise Tshombe in July 1960, the attempted secession of Biafra from Nigeria in 1967, the Proclamation of Bangladeshi Independence from Pakistan in 1970, the (internationally unrecognized) secession of the Turkish Republic of Northern Cyprus from Cyprus in 1983.United Nations. Index to Proceedings of the General Assembly 2008/2009: Subject Index. New York City, USA: United Nations, 2010. Pp. 138. During the Dissolution of the Soviet Union throughout 1991, many of its republics declared their independence unilaterally without agreement and were thus not recognised as legitimate by the Soviet Central Government. During the breakup of Yugoslavia, the government of the United States asked the governments of Croatia and Slovenia to drop their UDI plans because of the threat of major war erupting in the Balkans because of it, and threatened that it would oppose both countries' UDIs on the basis of the Helsinki Final Act if they did so. However, four days later both Slovenia and Croatia announced their UDIs from Yugoslavia.Florian Bieber, Džemal Sokolović. Reconstructing multiethnic societies: the case of Bosnia-Herzegovina. Ashgate, 2001. Pp. 41. Date Declared state Parent state International recognition Notes 1776 Great Britain 1777 Vermont Great Britain Vermont signed a separate armistice with Britain in 1781 before the surrender of Cornwallis at Yorktown. Effective retroactive recognition by the United States was granted in 1791 when Vermont became the 14th state. 1816 Río de la Plata , after the military victory Division and dismembering of the independent country. Paraguay secession. Brazil invaded Uruguay. Spain recognized Argentine Independence in 1859 1821 Intervention by France, Russia, and the United Kingdom in favour of Greece in the Greek War of Independence secured its independence in 1832. 1830 Belgium UDI (4 October 1830) recognized by the major European powers following the London Conference of 20 December 1830 1898 Philippines Spain Conquered by United States; became independent in 1946 by agreement 1903 1912 Albania 1916 Irish Republic 1922 Unilateral grant of independence by the British government 1931 1945 1960 Republic of the Congo Breakaway Congolese province, secession forcibly ended by the United Nations Operation in the Congo in 1963. 1965 Self-governing British colony, unilaterally declared itself independent as Rhodesia in 1965, renamed Zimbabwe Rhodesia 1979, then gained international recognition as Zimbabwe in 1980. 1967 Returned as a British Crown Colony in 1969. 1967 Recognized by five countries. Present-day Nigeria 1971 Bangladesh 1973 Guinea-Bissau 1975 Cabinda Present-day Angola 1975 Shortly following the declaration of independence, the territory was invaded and annexed by Indonesia. A referendum in 1999 led to eventual independence in 2002. 1983 Cyprus Still claimed by Cyprus, and recognized as such by all UN member-states except for Turkey. 1988 Claims territories occupied by Israel since 1967 Israeli–Palestinian conflict and peace process still ongoing See: International recognition of the State of Palestine 1990 1990 Still claimed by Moldova 1990 Incorporated into Uzbekistan in 1993. 1991 Somaliland Still claimed by Somalia 1991 Set off Croatian War of Independence 1991 Set off Ten-Day War 1991 Republic of Ichkeria Present-day Chechen Republic, part of Russia. Retroactively recognized by Ukraine in 2022 1991 Still claimed by Azerbaijan. Recognized by 3 other post-Soviet breakaway states 1991 Georgia Still claimed by Georgia. Recognized by 5 UN member-states. 1992 Set off Bosnian War 1999 Georgia Still claimed by Georgia. Recognized by 5 UN member- states. 2008 Still claimed by Serbia A United Nations General Assembly (UNGA) resolution adopted on 8 October 2008 backed the request of Serbia to seek an International Court of Justice advisory opinion on Kosovo's declaration of independence.Backing Request by Serbia, General Assembly Decides to Seek International Court of Justice Ruling on Legality of Kosovo's Independence, United Nations, 8 October 2008 On 22 July 2010, the ICJ ruled that the declaration of independence of Kosovo \"did not violate any applicable rule of international law\", because its authors, who were \"representatives of the people of Kosovo\", were not bound by the Constitutional Framework (promulgated by UNMIK) or by UNSCR 1244 that is addressed only to United Nations member states and organs of the United Nations.Accordance with international law of the unilateral declaration of independence in respect of Kosovo, Nspm.rs, 22 July 2010Accordance with international law of the unilateral declaration of independence in respect of Kosovo , International Court of Justice, 22 July 2010 See: International recognition of Kosovo 2014 Annexed by Russia; still claimed by Ukraine 2014 Annexed by Russia; still claimed by Ukraine 2017 Spanish sovereignty remained unchanged ==Legal aspects== The International Court of Justice, in a 2010 advisory opinion, declared that unilateral declarations of independence were not illegal under international law. ==See also== * Declaration of Independence * Decolonization * Helsinki Accords (also known as the Helsinki Final Act) * International law * International relations * List of sovereign states by date of formation * Secession * United Nations ==References== Category:International law Category:Separatism Category:Sovereignty Category:Changes in political power Category:Partition (politics)",
 "title": "Unilateral secession"
}