{
 "id": "1132052",
 "text": "The Russian alphabet is the alphabet used to write the Russian language. It is based on the Cyrillic script and has 33 letters. Capital letters Capital letters Capital letters Capital letters Capital letters Capital letters Capital letters Capital letters Capital letters Capital letters Capital letters А Б В Г Д Е Ё Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я Lowercase letters Lowercase letters Lowercase letters Lowercase letters Lowercase letters Lowercase letters Lowercase letters Lowercase letters Lowercase letters Lowercase letters Lowercase letters а б в г д е ё ж з и й к л м н о п р с т у ф х ц ч ш щ ъ ы ь э ю я ==Letters== The Russian alphabet has 10 vowels, 21 consonants, and 2 \"signs\" that change how letters around them sound. The table below lists the letters of the Russian alphabet and what sound they make. Letter Letter Sound (IPA) English approximation А а As a in father Б б As b in bat В в As v in delve Г г As g in good Д д As d in dart Е е [], As ye in yet Ё ё [], As yo in yolk Ж ж As s in measure З з As z in zipper И и As ee in meet Й й As y in yes К к As c in crisp Л л As l in long М м As m in mat Н н As n in night О о As o in more П п As p in pack Р р As r in ring С с As s in sink Т т As t in steep У у As oo in boot Ф ф As f in frog Х х As h in hit, but the tongue is more forward Ц ц As ts in cats Ч ч As ch in chip Ш ш As sh in fish Щ щ As sh in sheet Ъ ъ ————————————————— ————————————————— Ы ы As ury in bury, but said very quickly Ь ь ————————————————— ————————————————— Э э As e in net Ю ю [] As the word you Я я [] As ya in yard ==Palatalization== Palatalization changes a sound so that it is made while the tongue is close to the palate. ===Signs=== The letter Ь (soft sign) palatalizes the sound of the letter right after it. For example, if Г is right before Ь, the sound Г makes will go from to , which sounds like, but is not the same as, a palatal plosive . The letter Ъ (hard sign) is the opposite of the soft sign, and instead depalatalizes the sound right before it. For example, if the letter sequence ЗЪЯ appears, the hard sign prevents , being represented by З, from being palatalized to because of Я, and a is added right after , making the letter sequence sound like instead of . ===Vowels=== Vowels can either be 'soft' or 'hard'. The hard vowels are А, О, У, Ы, and Э, and the soft vowels are Е, Ё, И, Ю, and Я. The soft vowels palatalize the consonant sound right before them. For example, if Н occurs before Ю, Ю will be pronounced and , represented by Н, will be palatalized to , which is a sound similar to, but not the same as, a palatal nasal /ɲ/. A hard sign can appear right before a soft vowel and get rid of the palatalization of the consonant sound right before the vowel. If И is right before the hard sign, a will not be added. ===Consonants=== Most consonants can either be palatalized or depalatalized. The letters Ж, Ц, and Ш can never be palatalized because they make retroflex sounds, which sound deep, and the letters Й, Ч, and Щ can never be depalatalized because they already make palatal sounds. Consonants can be palatalized by the soft sign and soft vowels, and they can be depalatalized by the hard sign. The sound , being represented by Л, becomes [ʲ] when palatalized. Category:Russian language Category:Alphabets",
 "title": "Russian alphabet"
}