{
 "id": "1132453",
 "text": "Edwards' rocket frog (Hyloxalus edwardsi) is a frog. It lives in Colombia. ==Body== The adult female frog is about 30.8 to 37.3 mm long from nose to rear end and the adult male frog is 27.5 to 27.6 mm long. The skin of the frog's back is brown in color with darker brown spots. Sometimes the middles of the spots have lighter colored warts. The mouth can have white or yellow spots. The sides of the body are dark brown with lighter brown spots. The insides of the legs are dark olive color to light brown color with more brown spots. There are stripes going sideways on the legs. The legs also have spots. The skin of the frog's belly is olive colored or brown with yellow spots. Larger frogs have bellies that are almost white in color with brown marks. There is a little orange color on the throat and bottoms of the legs. Larger adult frogs have a yellow stripe from the eye to the front leg, but scientists are not sure whether this is because they are large or because they are female. The iris of the eye is copper in color with black lines in it. This frog does not have a vocal sac, so scientists think it does not have a voice or call. ==Name== Scientist John D. Lynch named this frog edwardsi for Stephen R. Edwards, an amphibian scientist who studied frogs in the same family as Hyloxalus frogs. ==Home== This frog lives in forests and caves and in cracked places in the rocks. It lives near streams in those places. People have seen it on both sides of the Cordillera Oriental (Eastern Mountains) for example in La Cueva de las Moyas the Páramo de Cruz Verde. Scientists saw these frogs between 3030 and 3300 meters above sea level. ==Young== From the top, this frog's tadpole looks like a long oval. It has a round nose. The top fin and back fin are the same size. The tadpoles are brown on the top and clear in the belly and throat. The muscles in the tail are white or olive in color with brown spots. They swim in streams that are .3 to .5 m deep. ==Danger== Scientists last saw this frog in 1996. They did not see it again after that, even though they went to its home to look for it. Scientists say this frog is in very big danger of dying out because it lives in such a small place (8 km2), because not all the frogs can get to each other, and because its home keeps changing: people cut down trees to make farms and towns and get wood to build with. Bad chemicals from towns and climate change can also hurt this frog. ==First paper== * ==References== Category:Frogs of South America",
 "title": "Hyloxalus edwardsi"
}