{
 "id": "1132198",
 "text": "JackTheBus (born June 28, 1999) a.k.a Little Pookie Bear or simply Pookie is an American content creator, YouTuber, and Twitch streamer known for his anime reaction videos and gaming content. He gained prominence through his reactions to popular anime series such as Naruto, One Piece, and Hunter x Hunter. His engaging commentary and enthusiastic reactions have earned him a dedicated following. == Early Life and Education == JackTheBus was born in Dallas, Texas. He initially pursued an Associate of Applied Science degree in cybersecurity and later attended the University of North Texas, where he focused on broadcast technology. However, in the fall of 2020, he decided to leave college to become a full-time content creator. == Career == JackTheBus began his YouTube career in 2019, initially focusing on gaming content before transitioning into anime reaction videos. His primary YouTube channel, JackTheBus, has amassed over 200,000 subscribers. In addition to his main channel, he operates a secondary channel, JackTheBus Reacts, where he shares uncut reaction videos, offering in-depth commentary on various anime series. Beyond YouTube, JackTheBus is active on Twitch, where he streams anime-related discussions and gaming sessions for his audience of over 43,000 followers. He is also present on Instagram, where he shares behind-the-scenes content and interacts with fans. == Story Arcs of JackTheBus == Throughout his career, JackTheBus has gone through various phases, or \"arcs,\" each defining a significant shift in his content style and audience engagement. === The Bleach Arc === The Bleach Arc is one of the most unexpected yet legendary moments in JackTheBus' content history. In a video titled *\"I WON a Bleach Tournament Without Watching Bleach...\"*, he participated in a competitive Bleach-themed tournament despite having little to no prior knowledge of the series. Against all odds, he managed to win, outmaneuvering opponents who were seasoned Bleach fans. The video quickly gained traction among both anime and gaming communities, with viewers entertained by his strategic decision-making, lucky guesses, and comedic commentary. His victory in the tournament became an inside joke among his fanbase, reinforcing his reputation for thriving in chaotic and unpredictable scenarios. This arc symbolizes JackTheBus' ability to create engaging content regardless of his level of expertise in a given anime, proving that personality and entertainment value can often surpass in- depth knowledge. === The Crash Out Arc === The Crash Out Arc is a notorious phase in JackTheBus' content history, marked by his intense and often hilarious rage-filled moments while playing Dragon Ball games. This arc spans across multiple titles, including Dragon Ball Xenoverse 2, Sparking Zero, and the mobile gacha game Dragon Ball Legends. Known for his highly competitive nature, JackTheBus frequently engaged in **online 1v1 battles**, often facing frustrating mechanics, overpowered opponents, and the unpredictability of ranked matchmaking. His raw, unfiltered reactions—ranging from mild frustration to full-on rage quits—became a fan favorite, leading to countless meme-worthy clips. The arc reached its peak when he suffered an especially crushing defeat in Dragon Ball Xenoverse 2, prompting an infamous **controller throw moment**, which fans dubbed the \"Jack Crash.\" Similarly, in Dragon Ball Legends, his encounters with unlucky summons and overpowered meta units added to the chaos, fueling his on-stream meltdowns. Despite the rage, the Crash Out Arc became an integral part of his brand, drawing in viewers who enjoyed both the gameplay and the comedic outbursts. Over time, this arc solidified JackTheBus as one of the most entertaining personalities in the Dragon Ball gaming community. == Timeline == Key Events in JackTheBus' Life and Career Year Event 1999 Born in Dallas, Texas, U.S. 2019 Launched his YouTube channel 2020 Left college to pursue content creation full-time 2021 Reached 100,000 subscribers on YouTube 2023 Expanded content to include more gaming-related reactions == Personal Life == JackTheBus is known for his passion for anime and gaming. His content primarily focuses on engaging with anime culture and sharing his genuine reactions with fans. Legend states that on the very first JackTheBus stream he said that he would one day oil up and his fans have been asking ever since that day for him to oil up. Clarification: JackTheBus (Anime Reactor/One Piece Pirate Warriors 1 Pro) has multiple correlations to the character \"Dodoria\" from Dragon Ball Z, and is him. He also has a deep passion for Lord Frieza and wants to be him, as seen in cosplays in many of his streams and videos. Aliases: JackTheBus has gone by many names. Some of them are: Pookie, Bigweld, and Pwincess Spouse(s): Charlotte Brulee,Charlotte Linlin. Dodoria (ドドリア, Dodoria) is a character in Dragonball Z. https://cdn.discordapp.com/attachments/653824027915321355/1270173436504965200/DodoriaTheBus.png?ex=66d6fdf1&is;=66d5ac71&hm;=40f3e5864e63b6ee0c567bd0de2a38e4ee1b4ab51e6424d754c3ce96d76855ab& () Credit - ZamboniWizard - (ZamboniWizard was here and saw this) Appearance: Dodoria is a large, round alien warrior, appearing to be overweight by human standards. He has protruding spikes on his arms and head. He also wears the common armor that most of Lord Frieza's men have, including the shoulder pads and a green scouter. Storyline: Before the events of Dragon Ball Z, Dodoria was always by Frieza's side along with Zarbon. He witnessed the killing of King Vegeta and the destruction of planet Vegeta. Before the destruction of Planet Vegeta, he and a group of his elites were sent to eradicate Bardock and his team of fighters. He was successful in killing most of the team, but left Bardock alive after using a powerful mouth blast on him. Both Frieza and Zarbon looked down upon him for carelessly leaving him alive. Dodoria accompanied his master Frieza and his comrade in battle, Zarbon, to the green Planet Namek in search of the Namek Dragonballs. While searching in a village for a Dragonball, Dodoria killed a few villagers, but before he could kill Dende, he was attacked by Krillin and Gohan. He pursued them, but they escaped after Krillin used a blinding attack called Solar Flare. Dodoria then launched an attack over a large area, which lead him to believe that he had killed them. On his way back, he was ambushed by Vegeta who easily overpowered him. Dodoria tried to bargain with Vegeta by telling him the secret of the destruction of Planet Vegeta, but he did not care. Vegeta killed him during his attempted escape. He only cameos again during the movie Fusion Reborn and in the Super Android 17 Saga when people from Hell are able to escape. He is killed again both times. In addition he also loses his scouter while searching for Vegeta. Abilities: Dodoria uses his brute force to overwhelm his opponents. He has the generic powers that many other Dragon Ball characters share, including the ability to throw numerous exceptionally powerful rapid blasts. He can also emit blasts from his mouth as well, most commonly known as mouth blasts. The most noticeable trait that Dodoria has is his ability to throw his weight around. He is extremely fast in spite of his weight. He can perform multiple spins and aerial strikes regardless of his size. Video game appearances: Dodoria has appeared as a playable character in many video games, some of which include Dragon Ball Xenoverse 2, Dragon Ball Z: Budokai, Dragon Ball Z: Budokai Tenkaichi, and Dragon Ball Z: Budokai Tenkaichi 2. He is also in Dragon Ball Z: Super Sonic Warriors 2 but only as a support-type character. == Other websites == * Official YouTube Channel * Twitch Profile * Instagram Profile Category:Anime characters",
 "title": "JackTheBus"
}