{
 "id": "1132907",
 "text": "The Green-skinned children of \"St. Martin's Land\", were two children (a boy and a girl) of unusual racial colour, who appeared in a disputed village or town in Suffolk, England, most likely during the 12th century. The village people found the \"green\" boy and girl in a field, disoriented and confused, and took them into their house. The village people attempted to communicate with the children, but they spoke an unknown language, and therefore could not be understood. The boy and girl were taken to the house of Sir Richard (last name disputed), who was probably some English offical and/or nobleman, and they stayed there, in his place. Ultimately, Richard gave the children food, but they refused to consume it, and they chose to stay hungry for the next few hours or even days. Ultimately, after those hours or days, the boy and girl came across raw beans, which they eargerly consumed with delight. The raw beans was all the children were known to even consume and eat. Ultimately, Sir Richard took the beans away from the children, and gave them other food, presumably in a attempt to get them to adapt to eating other food. Ultimately, the boy and girl protested, then adapted to the other food. Ultimately, when the children ate other food, every day, they began to lose their green skin. Ultimately, the children lost the green skin, completely, altogether, and adapted into a healthy diet of food, and not just the raw beans. Sir Richard ultimately ended up taking custody of the boy and girl, all along. It is disputed for how long he cared for them, and raised them. Ultimately, Sir Richard came upon the suggestion to baptise the children. Around this time, the boy became sick and ill. The illness got worse, and the boy ultimately died (probably of malnutrition or eating-related causes/disorders.), and his carcass was buried or cremated somewhere. After the girl was baptised, when Sir Richard consulted a priest in a church, Sir Richard suggested that the girl learn English. When the girl learned English and was able to speak to other people, she said that boy (found alongside her) was her brother. According to her, she and her brother had came from a town called \"St. Martin's Land\", where there was no sun. Instead of sun, during the day, twilight would shine upon the town. Also, her brother, her family and basically everyone living in her town had green skin and eat just raw beans. She and her brother would often help their parents to take care of the cattle and flock. One day, while taking care of the cattle and flock, she and her brother had heard weird bells ringing and bright sunlight. She, her brother, and the cattle had followed the ringing bells and the sunlight, and it led them into a cave. The further they went through the cave, the closer the bells were ringing. While exploring, there was a sudden loud noise, and somehow it got them into the English village or town. The children explored the area, and were found by the village people and brought into Sir Richard's house. After her brother's death, the girl continued to live in the town in England. Anyways, Sir Richard had close connections with English priests and abbots. Due to his close connections with the abbots and priests, people (such as historians and scholars) asked those English priests and abbots with whom Sir Richard had close connections with, about the story of the \"green children\" and what Sir Richard did to raise them. Later in life, at a unknown year, Sir Richard had died from disputed causes. == Speculations and theories on the bizzare story and case == In the modern era, some people (such as scholars) suggest that Sir Richard may have had French or Norman background, though there is not much evidence supporting it. According to scholars, Sir Richard may have possibly been Richard Calne, an English offical of high status, who died in 1189, and probably lived either in a village called Woolpit in England, or somewhere near the village of Woolpit. It is believed that the Green Children were first met by the village people of Woolpit. That is the story is often called the \"Green Children of Woolpit\". Sir Richard may have also possibly been Richard Caen, another high-ranking offical who came from the city of Caen, in Normandy, and possibly immigrated to England. Through deep research, some modern-day people (such as scholars) suggest that the girl, who was under Richard's care (temporarily or permanently), went to a English school and ended up taking the name of Agnes. The girl is believed to have presumably took the name of Agnes, presumably ended up working as a maid and servant in her later adult life, and presumably was the Agnes Barre who got into a relationship with Richard Barre, a high-ranking English offical, and ultimately ended up marrying him, and presumably went to live with him. It is unknown how the relationship or marriage between Agnes and Richard Barre ended, or if the girl who was found alongside her brother and taken into Sir Richard's house is in fact Agnes Barre. That is just some speculation. Regardless, it is widely supported that the girl is actually the Agnes Barre who married Richard Barre, the high-ranking English offical and probably even royal member of the English court. Very few details is known about Agnes Barre and her husband, Richard Barre, or about their relationship. It is unknown if the girl was even Agnes Barre, as scholars and researchers have speculated, but if it turned out that she was, then the girl's brother, who died as a child, would obviously be Agnes Barre's brother. It is unknown who originally the Green Children were, and why their skin was originally green. It has been suggested that the everyone in the village or town of \"St. Martin's Land\", where the Green Childrn supposedly came from, ate only raw green beans. Eating nothing but raw green beans, or other green food, can make your skin turn greenish, after a while. When the children were adapted into a meal of other food, and the beans were taken away, they slowly lost their green skin, and it turned white. The children's parents and family were probably Flemish immigrants. During the time and century that the Green Children lived in, a lot of Flemish people had immigrated to England, and decided to settle and ultimately live there, and raise families there, also. The Flemish immigrants came to live in England, after the infamous Norman invasion of England and the Occupation of England from 1066 to 1135, when the English recaptured their country from Normandy. Also, the Flemish immigrants were known to be strict vegetarians and vegans, who ate only certain foods, such as beans and vegetables, and they loooked differently. And the Flemish immigrants would also establish and own villages and towns in England, where only immigrants would live and settle there, in their little humble community. Even though they had their own communities in England, and they lived by their own rules and government, their lives were not often happy or safe. Yes, unfortunately, during the 12th century, those Flemish immigrants to England were victims to pogroms and violent riots. The immigrants were not safe in England, even in their own community which they established. English people would often go into the communities of the Flemish immigrants, and they would attack them and their families, for no reasons. Presumably, the Green Children lived in one of those communities in England. When the English attacked their community and massacred their parents, while the children were tending to the cattle, they heard bells and escaped to the cave and followed the noise of the ringing bells and sunlight, until they reached the village, in a disoriented and confused state. When the English people would see the children, it is obviously they would not know their background or where they originally come from. However, there is a large problem with this theory. This does not explain why Sir Richard did not understand their native language, or understand where they even come from. After all, obviously, Sir Richard should have known where the children came from, and he should have understood their language, becuase he was a high-ranking English offical. The village people who encountered the children were not high-ranking officals, and were mostly simple farmers, so this case is totally different. This problem has led scholars to be deeply surprised by it, and it has been suggested and theorized that Sir Richard himself pretended he could not understand the children or know where they came from, or even used/partially neglected them just for attention, due to their background and story. However, this is a theory, and it does not necessarily mean that any of this is even true. It is also theorized that the children were not Flemish, but instead they came from a underground world, or maybe they were extraterrestrials (aliens) from a different world, and they were presumably sent by their extraterrestrial parents by complete accident to planet Earth, and the cave which the children went to, was actually some portal which ended up leading (led) to a different world and/or dimension, and they landed in that village (or that town) in England. Even though it would partially explain the green skin of the children, the extraterrestrial theory is obviously very unlikely, and probably not even true. It is extremely unlikely and extremely rare that if extraterrestrials (aliens) even exist, that they would visit planet Earth. There are a range of theories of why the children have green skin, or why they spoke in a different language or ate only raw beans, in the beginning, the theory that they were Flemish and that their community was boycotted and massacred by the English, seems like a very likely version. Since, the carcasses of the children (boy and girl) have gotten lost and even their burials are unknown/disputed, DNA tests can not be taken to discover their true and genuine origins and background, even with the proper modern-day technological advances and devices. Currently, as of today, the case of the Green Children from \"St. Martin's Land\", remains as a bizzare and surprising but unsolved mystery. == Artistic and literal depictions of the case == The Green Children have been featured in several artistic and literal depictions. For already several centuries, their case has gotten and recieved much attention and news, by people (especially researchers, historians, scholars, authors, artists, writers, film directors, filmakers, poets, painters, etc.). Scholars today are currently still trying to solve the mystery of the Green Children. Here are some artistic and literal depictions: They have been featured and were the protagonists of the 1621 English book (novel) written by some English author and writer. In this novel, the writer suggests the children are not from Earth, and have been \"dropped from Heaven\" and/or Paradise. The children were the subjects of the popular drawing, the Babes in the Woods. The case of the Green Children have also served as the inspiration for a movie (film). Category:12th century in England Category:British children Category:Middle Ages Category:Suffolk Category:Urban legends",
 "title": "Green-skinned children of \"St. Martin's Land\""
}