{
 "id": "1133380",
 "text": "Targeted killing is a form of assassination. Assassination are often called targeted killing when governments do them, particularly if they are done by the United States or their allies. They are a type of execution that is done without a trial, sometimes on a battlefield, and sometimes in their family homes. Most people in the Western world think it's illegal for governments to assassinate people. Some people who lead militaries or study them describe targeted killing as legitimate within the context of \"self-defense\", when employed against people they classify as \"terrorists\" or people from armed groups that are smaller or less well armed than the government's own military but are still winning. The governments say that unmanned combat aerial vehicles (drones) are more humane and more accurate than human assassins doing it in person. People who study war disagree with each other about whether killing people like this works to stop terrorism. == Assassinations by the United States == Operation_Condor_participants.svg|Operation Condor participants. Sam_Giancana.jpg | The CIA recruited Sam Giancana (pictured), Santo Trafficante and other mobsters to assassinate Fidel Castro. Graph_of_Average_Casualties_in_US_Drone_Strikes_in_Yemen_2002-present.png | Graph of average casualties in drone strikes ordered by the United States in Yemen, 2002–2017. Obama_2012_78.jpg | John O. Brennan, bosused to be the s of the Central Intelligence Agency and the boss of the team who gave President Barack Obama advice about how to stop terrorism. Stop_Killer_Drones_(15836463196).jpg|Minneapolis anti-war protest: 'Stop Killer Drones', 5 May 2013. == Assassinations by governments in Asia == === Use by Iranian government === === Use by Saudi Arabia === === Use by Israel === === Use by North Korean government === == References == Category:National security Category:Law of war Category:International law Category:Central Intelligence Agency Category:Assassinations",
 "title": "Targeted killing"
}