{
 "id": "1133899",
 "text": "The Battle of Buʿāth (Arabic: معرکة بُعاث) was a 7th-century battle in Medina that was fought between the two dominant tribes living there, the Aws and the Khazraj. The battle marked the final armed conflict between both tribes before their conversion to Islam after the arrival of the Islamic prophet Muhammad. == Time period == The events of this battle are dated to around the 610–620s within the 7th century CE. This would also be consistent with the narrative that the battle occurred during the arrival of prophethood of Muhammad, and ended not too long before Muhammad arrived to Medina during the Hijrah. == Background == The Aws and Khazraj tribes were known for their many armed rivalries throughout history.Mubarakpuri, Saifur Rahman (2008). The Sealed Nectar: Biography of the Noble Prophet. Dar-us-Salam Publications. As the Aws were preparing for yet another war, they pleaded with the Jewish tribes of Qurayza and Nadir to assist them; the Jews were reluctant at first because the Khazraj had threatened to take their children hostage if they assisted the Aws.Abu al-Faraj al-Isfahani (2010). Kitab al-Aghani. Beirut, Lebanon: Dar Sadr. . However, a tribal chief of Khazraj by the name of 'Amr ibn Nu'man al- Bayadi soon kidnapped hostages from the Jewish tribes and subsequently killed them when the Jews did not agree to give away a portion of their properties to the Khazraj. Angered, the Jewish tribes would bitterly support the Aws in this war. == Course of conflict == === Preparations === The Aws put all of their efforts into gathering external support from other Arabian tribes, which was succesful with the Ghassanids. The Khazraj were unable to gain external support, so the whole group of Khazraj tribes, their branches included, were required to fight in the battle. === Day of Bu'ath === This day, known as the Day of Bu'ath, was when the actual battle itself occurred. Both armies met at a place known as Bu'ath, where they began the fighting. The Aws were losing at first; but then their chief, Hudayr al-Kata'ib ibn Simak al-Ashhali, shouted out to the Aws and reminded them of the evils and injustice done by the Khazraj towards their tribe. The Aws, motivated by this, persisted in their fight and then managed to kill a large number of Khazraji tribal warriors including 'Amr ibn Nu'man al-Bayadi. The Khazraj were ultimately defeated by the sudden reversal of power and then sounded the retreat. == Aftermath == === Peace talks === Tired of fighting, the Aws and Khazraj elected 'Abd Allah ibn Ubayy as a ruler over Medina that ensured peace between both tribes.Ibn Sa'd (1998). Kitab Tabaqat al-Kubra [The Book of Major Classes]. Beirut, Lebanon: Dar Sader. However, the arrival of the Islamic prophet Muhammad would lead to 'Abd Allah losing prominence in Medina. === Arrival of Muhammad === Muhammad arrived in Medina in 622 accompanied by his followers, the early Muslims, which included Abu Bakr, Umar ibn al-Khattab, and Bilal. Both the tribes of Aws and Khazraj would engage in conversations with Muhammad; resulting in their conversion to Islam. They were then united as the Muslim Ansar unit, which fought alongside the Muhajirun unit against the Quraysh polytheist warriors in the Battle of Badr in 624.Ibn Hisham (2008). The Prophetic Biography: Sirah of Ibn Hisham. Dar Al Kutub Al Ilmiyah. == Related pages == *Battle of Badr *Battle of Uhud == Notes == == References == Category:History of Medina Category:Battles Category:7th-century conflicts",
 "title": "Battle of Buath"
}