{
 "id": "1133078",
 "text": "The Magen David Adom (, acronym: MDA, pronounced MAH-dah per its Hebrew acronym, ), is Israel's national emergency medical, disaster, ambulance, and blood bank service. The literal meaning of name is \"Red Shield of David,\" but the symbol is more frequently called the \"Red Star of David\" in many languages. Since June 2006, Magen David Adom has been officially recognized by the International Committee of the Red Cross (ICRC) as the national aid society of the State of Israel under the Geneva Conventions, and a member of the International Federation of Red Cross and Red Crescent Societies. MDA has a dedicated medical emergency phone number in Israel, 101. == Pictures == File:Star_and_Stripes_(8578716709).jpg | The Red Magen David headquarters in Jerusalem. File:MDA_Armoured_Ambulance.jpg | Armored mobile intensive care unit, Jerusalem District 2006. File:HeIicopter_MADAIS.jpg | Helicopter of Magen David Adom. File:Mda_motorcycle.JPG | An MDA motorcycle used by a community first responder in Jerusalem's Old City. File:A_Magen_David_Adom_ambulance_in_action_(FL63631806).jpg | A Magen David Adom ambulance. File:A_MAGEN_DAVID_ADOM_WORKER_IN_THE_TEL_AVIV_CIVIL_DEFENSE._מתנדבת_של_מגן_דוד_אדום_במשמר_האזרחי.D23-016.jpg | A Magen David Adom paramedic in the Tel Aviv civil defense, 1939. File:Magen_David_Adom1948.jpg | A Magen David Adom ambulance in June 1948, Palestine. File:Blood_Services_Center,_Magen_David_Adom.JPG|Blood bank File:BloodDonorIsrael.jpg | Blood donation in a shopping-center in Ramat Gan 2009. File:Mobile_Blood_Donor_Units.JPG | Mobile blood donor units File:Israel_Batch_1_(732).JPG | Standard MDA Basic Life Support Ambulance. File:Ambulance_magen_david_red_jerusalem_efi_elian.JPG|MDA Advance Life Support Ambulance. File:Magen_David_Adom_scooter.jpg|MDA Piaggio MP3 three-wheeled scooter. == Ranks == Management and senior administration Rank Insignia Role General Director of the MDA Division director Area director Deputy division director Department director Deputy laboratory director Assistant department director Supervision Section Supervisor Paramedic educator Chair of Volunteer Management Serving on the MDA Council Junior laboratory director Paramedics Rank Insignia Role Chief of station Coordinator of blood donation operations Chief paramedic Paramedic with 14-23 years experience Paramedic with 8-14 years experience Paramedic with 3-8 years experience Paramedic with less than 3 years experience Medical Assistants and Blood Donation Operators Rank Insignia Role Station-Driver supervisor Senior emergency medical assistant Head of blood donation group Emergency medical assistant Blood donation group supervisor Head of shift Blood donation supervisor Senior medical assistant Senior blood donation operator Medical assistant Blood donation operator == Related pages == * First Geneva Convention * Palestine Red Crescent Society * ZAKA == References == == Other websites == * AFMDA OAmerican Friends of Magen David Adom * United Kingdom Friends of the MDA * MDA Israel in English * Magen David Adom, on the Jewish Virtual Library * Irish Friends of Magen David Adom Category:Emergency medicine Category:Emergency services Category:Israel",
 "title": "Magen David Adom"
}