{
 "id": "1133828",
 "text": "On 17 August 2017, a suicide bomber detonated on the Palestinian side of Rafah Border Crossing. The man and his companion were described in most sources as members of ISIS. When the Hamas government border guard attempted to apprehend the two men, one of them detonated a suicide bomb, killing the guard, and injuring 5 others, one severely. The other offender was also injured in the attack. The severely wounded border guard died of his wounds. https://www.npr.org/2018/01/15/578172703/what-effect-isis-declaration-of-war- against-hamas-could-have-in-the-middle-east https://www.arabnews.pk/node/1146196/middle-east The first guard who died was a 28 year old man from the Gaza Strip. Hamas responded to that bombing with a crackdown on followers of the \"deviant ideology\" (their term for ISIS and similar extremist groups).https://www.arabnews.com/node/536401/amphttps://www.latimes.com/world/la- fg-gaza-suicide-bomber-20170817-story.html ISIS are an anti-nationalist cult with an ideology that is fundamentally incompatible with the Palestinian nationalism of Hamas and their allies, ISIS also object to Hamas' international Shia allies. https://www.usmcu.edu/Outreach/Marine-Corps- University-Press/MES-Publications/MES-Insights/Excommunicating-Hamas/ ISIS in the Sinai declared war on Hamas the following year, demanding Hamas release ISIS militants held in Gaza's prisons. == Related pages == * Hamas–ISIS conflict * * * ISIS Sinai Province * Sinai Peninsula == References == Category:Israel–Palestine conflict Category:Terrorist attacks attributed to Palestinians Category:Suicide bombings in Asia Category:Attacks against Palestinians Category:Hamas–ISIS conflict Category:Gaza Strip Category:Palestinian border crossings Category:Rafah, Palestine Category:Egyptian border Category:Gaza border Category:Hamas government in the Gaza Strip Category:Attacks on Hamas Category:Suicide bombers Category:Islamic State people Category:Sinai Peninsula Category:Islamic State",
 "title": "2017 Rafah crossing bombing"
}