{
 "id": "1133814",
 "text": "The Israeli Army, officially known as the Israeli Ground Forces () are the ground forces of the Israel Defense Forces (IDF). == Service == The military service is held in three different tracks: * Regular service (): mandatory military service which is held according to the Israeli security service law. * Permanent service (): military service which is part of a contractual agreement between the IDF and the soldier. The soldier agrees to do the job beyond the minimum mandatory service. * Reserve service (): a military service in which citizens are called for active duty of at most a month every year, in accordance with the Reserve Service Law, for training and ongoing military activities and especially for the purpose of increasing the military forces in case of a war. Sometimes the IDF would also hold pre-military courses (קורס קדם צבאי or קד\"צ) for soon-to-be regular service soldiers. ==Gallery== IDF_Ground_Forces_Command.png|Structure GOC Dayan_w_Kuntila_Raid_comm.jpg|Israeli officers of the Paratrooper Battalion 890 in 1955 with Moshe Dayan (standing, third from the left). Ariel Sharon is standing, second from the left and commando Meir Har Zion is standing furthest left. Flickr_- _Israel_Defense_Forces_-_13th_Battalion_of_the_Golani_Brigade_Holds_Drill_at_Golan_Heights_(22).jpg|Soldiers of the Golani Brigade on the Golan Heights Idf-uniform-en.png|IDF uniform colours Flickr_-_Israel_Defense_Forces_- _Nahal's_Brigade_Wide_Drill_(22).jpg|Nahal Brigade soldier with full combat gear Israeli_Honor_Guards_stand_at_attention_01.jpg|IDF female Military Police wearing skirts with their White caps and belts Flickr_- _Israel_Defense_Forces_-_Karakal_Winter_Training.jpg|The unisex Caracal Battalion, which serves in routine security missions Israeli_Urban_combat.jpg|Israeli \"Netzah Yehuda\" recon company in full combat gear prepare for a night raid in the West Bank. Merkava-Tanks- Wikipedia-02.jpg|Merkava – Israeli main battle tank, with 4 generations IDF- Ground-Forces-AFVs-01.jpg|IDF's current (2017) armored fighting vehicles, clockwise: IDF Namer, IDF Caterpillar D9, M270 MLRS and Merkava Mk 4M Merkeva_Mk_4M_-_Israeli_Tanks_2019-04-21_IZE-42.jpg|A profile of a Merkava Mk 4M tank, armed with an IMI 120 mm gun, a M2 Browning .50-cal, a 7.62x51 mm NATO commander's FN MAG, and equipped with the Trophy active protection system == Related pages == * Arab–Israeli conflict == References and footnotes == == Other websites == * Category:1948 establishments in Israel Category:Israel Defense Forces Category:Official website not in Wikidata Category:Military units in the Middle East",
 "title": "Israeli Ground Forces"
}