{
 "id": "1133311",
 "text": "The Sistan Basin is an inland endorheic basin (a basin where no water goes to the ocean or other lakes) in the southwest of Afghanistan and the southeast of Iran. It is one of the driest places in the world and an area where there are many long droughts. Its drainage basin is a river going from the mountains of Afghanistan into freshwater lakes and marshes and then to the salty Godzareh Depression. The Helmand River drains the basin's largest watershed. This river gets its water mostly from snow melting from the mountains of Hindu Kush, but other rivers bring water too. == Lakes == The lowest part of the Sistan Basin has many small lakes, known as hamuns. In the past there was one Hamun Lake, but there are now three lakes. The lakes are: === Hamun-e Puzak === The Hamun-e Puzak is mostly in Afghanistan. It gets water from the Shelah Charkh channel of the Helmand River, and also from the Khash River and other small rivers. === Hamun-e Sabari === The Hamun-e Sabari is in both Afghanistan and Iran. It gets water from the Parian branch of Helmand River, the Farah River and the Harut River. === Hamun-e Hirmand === The most water from the Helmand River flows into the Hamun-e Helmand, which is in Iran, by a channel known as the Rud-e Sistan. == Hydrology == When there is a flood the hamuns become one big lake, and every 20 years the flood creates an overflow from the Hamun-e Helmand by a river that is normally dry, called the Shela Rud, ending in the Godzareh Depression. In 1885 there was an very big flood, and the floodwaters filled the depression for three years. In recent times, like during a drought from 1998 to 2005, the hamuns have dried up completely. == Ecological importance == The region's economy depends on agriculture. Plants need water to grow, and the area's water level changes a lot. Sometimes there are big floods, and other times there are droughts that kill the plants, such as in 2005. ==Archaeology== For more than 5,000 years, people have lived in the Sistan Basin. The basin has some archaeological sites. The Shahr-e Sukhteh, or \"Burnt City\", in Iran, was built in 3100 B.C. near a dried-up part of the Helmand River. People left it one thousand years later, most likely because of climate changes that changed the river's path. Also, Shahdad, located further to the west, on the western side of the Lut desert, is a site from the Bronze Age. Kang and Zaranj in Afghanistan were medieval cultural hubs, now covered by sand. Here, signs of ancient irrigation systems, including canals, can still be seen in the Dasht-e Margo and Chakhansur areas while elsewhere canals are filled with silt and fields covered in sand. Today the area has only a few people. Excavations have also revealed a citadel complex, and the broken parts of a Zoroastrian fire temple, on Mount Khajeh. There are other important places in this area: *Dahan-e Gholaman is an Achaemenid archaeological site. Archeologists say it was capital of the ancient satrapy of Zranka/Drangiana. *Ram Shahristan (or Abrashariyar) was an ancient capital of Sistan. == See also == * Arachosia * Bahram III == Notes == Category:Landforms of Iran Category:Landforms of Afghanistan",
 "title": "Sistan Basin"
}