{
 "id": "1133929",
 "text": "The Battle of the Indus was a big battle that happened on November 24, 1221, by the Indus River in what is now Pakistan. Two armies fought: one was led by Shah Jalal al-Din Mingburnu from the Khwarazmian Empire, and the other was led by Genghis Khan from the Mongol Empire. The Mongols won the battle, and it was the last big fight in their conquest of the Khwarazmian Empire. Shah Jalal al- Din became the ruler after his father, Muhammad II, died on an island in the Caspian Sea. He tried to escape from the Mongols many times. He went to the city of Ghazni and gathered a large army. He won a surprise victory against a Mongol leader named Shigi Qutuqu in the Battle of Parwan. This made Genghis Khan very angry. He gathered a huge army of at least 50,000 men and chased after Shah Jalal al-Din. By then, Shah Jalal al-Din’s army had become smaller because of a fight over the spoils of war. Realizing he could not win against Genghis Khan, he moved east towards the Indus River. But the Mongols caught up with him before he could cross the river. Shah Jalal al-Din’s army, now about 30,000 men, took a strong position by the river. At first, they fought well and pushed the Mongols back, even though they were outnumbered. But when some elite Mongol soldiers outflanked them, Shah Jalal al-Din knew he could not win. Wearing full armor, he rode his horse off a cliff into the Indus River. Genghis Khan, impressed by his bravery, told his archers not to shoot. Shah Jalal al-Din made it to the other side of the river, but his family and almost all of his army were killed. == Background == Genghis Khan started his invasion of Khwarazm in late 1219 with a huge army of 75,000 to 200,000 soldiers. Shah Muhammad II was scared of the Mongols' fighting skills and didn't trust his own leaders. Instead of fighting the Mongols directly, he chose to protect his important cities like Otrar, Samarkand, and Gurganj. But Genghis Khan proved to be a better planner. He divided Shah Muhammad II’s forces, capturing the city of Bukhara in February 1220 and Samarkand in March. The town of Otrar held out for six months but finally fell in April. Genghis Khan then sent an army of 30,000 to 40,000 men, led by generals Jebe and Subutai, to chase Shah Muhammad II, who was fleeing west with his eldest son, Jalal al-Din. The Mongol army destroyed many cities during the long chase, including Tus, Qazvin, and Ardabil. The Shah found safety on an island in the Caspian Sea, where he died in December 1220. After his father’s death, Jalal al-Din went to Gurganj, the old capital of the empire. But the local leaders didn’t support him and preferred his half-brother, Uzlaq-Shah. After finding out about a plan to kill him, Jalal al-Din left the city and traveled south across the Karakum Desert. Near Nisa, he defeated a small group of Mongol soldiers. Meanwhile, two large Mongol armies, led by Genghis Khan’s sons Jochi and Chagatai, moved toward Gurganj from different directions. It took six more months and help from another Mongol army led by Ögedei for the Mongols to capture the city. At the same time, Genghis Khan sent his youngest son, Tolui, to conquer Khorasan. Tolui completed this quickly and with much destruction. The cities of Merv and Nishapur were destroyed, and most of their people were killed. Herat was betrayed and surrendered to the Mongols, so it was spared from destruction. Jalal al-Din barely escaped capture at Nishapur, where he had hoped to gather an army. He avoided his pursuers and reached Bost, where his uncle, Amin Malik, joined him with more troops. Jalal al-Din then moved to Ghazni, where many supporters from Khwarazm, including the Qurlaq, Khalaj, and Turkmens, joined him. In just a few weeks, he had an army of around 65,000 soldiers, although they were not very united. == Before the Battle == After Jalal al-Din attacked some Mongol forces, Genghis Khan sent a commander named Shigi Qutuqu with 30,000 to 50,000 soldiers to defeat him. However, Qutuqu was unexpectedly beaten in the Battle of Parwan in the fall of 1221. This defeat caused big rebellions in cities like Merv and Herat. Unfortunately for Jalal al-Din, many of his soldiers, led by Saif al-Din Ighrak, left after the battle due to a dispute over the loot. The Shah knew losing almost half his army was a serious problem, so he decided to escape across the Indus River. He returned to Ghazni and then headed east towards the Indus River. However, his progress was slow because many refugees were traveling with his army. While this was happening, the Mongols were busy with two month-long sieges at Rang Castle and Bamyan. After hearing about the defeat at Parwan, Genghis Khan moved his forces towards Ghazni. The Mongols sent groups ahead to take control of important mountain passes leading from Ghazni to Peshawar. When the deserters under Ighrak finally tried to rejoin Jalal al-Din, they found their way blocked. Jalal al-Din managed to defeat one Mongol group at Gadriz, but the Mongols, moving quickly, caught up with him by the Indus River and defeated his rear guard. === Battle planning === At dawn, both armies prepared for battle. Jalal al-Din led the center with 5,000 troops, including 700 bodyguards in reserve. Amin Malik led the right wing, and the left wing was probably commanded by Temur Malik. The Shah placed his left wing on a ridge that extended into the river and protected his right flank with the riverbank. This setup reduced the Mongols' advantage in mobility and numbers. Genghis Khan arranged his forces in a crescent shape to trap the Khwarazmians against the river. He led the reserve force to make sure the Shah could not break through and escape. The Mongol right was led by Chagatai and the left by his brother Ögedei. The Mongols greatly outnumbered Jalal al-Din’s forces, but they were likely tired from their quick march across the mountains, and Genghis Khan might have attacked before all his troops were ready. == Battle == On November 24, the battle started at dawn. The two sides began fighting, with the Khwarazmian left wing holding its strong defensive position. Even though Genghis Khan kept sending new troops, the Mongols on the left, led by Ögedei, were pushed back. Seeing the strength of the ridge where the Khwarazmians were positioned, Genghis sent a general named Bela Noyan with an elite group of soldiers to climb the ridge and attack the Khwarazmians from the side. Jalal al-Din attacked the Mongol center. According to his personal biographer, al-Nasawi, Jalal al-Din reached Genghis Khan and forced him to flee. Despite being in a crowded area where their arrows were not very effective, the Mongols managed to stop the Khwarazmian advance and killed Temur Malik in the fighting. Although many Mongol soldiers were lost climbing the ridge, they successfully reached the top and attacked the Shah's left wing from the side and rear. The Khwarazmian right wing also began to retreat and eventually broke apart. Amin Malik, who was trying to escape to Peshawar, was intercepted and killed. Even though it was clear that the battle was lost, Jalal al-Din continued fighting until noon. After his cousin, Akhash Malik, urged him to escape, Jalal al-Din charged up the Mongol-controlled ridge and broke through the Mongol lines. He then rode his horse off a 30-foot cliff and managed to reach the other side. Genghis Khan, impressed by his bravery, told his sons to watch and ordered his archers not to shoot, saying, \"Fortunate should be the father of such a son.\" Although Jalal al-Din's life was spared, most of his men were not so lucky. About 4,000 soldiers made it to the other side, but many were shot in the water by Mongol archers. The Shah's camp, harem, and treasures were captured, and all male members of his family, including his young sons, were killed. == After the Battle == After the battle, Jalal al-Din gathered the survivors of his army and used his military skills to defeat local rulers across the Indus River in now Pakistan, where he started to build a small state. Genghis Khan did not make a big effort to chase him, only sending some troops when Jalal al-Din crossed the Indus River again to bury his dead soldiers. Genghis Khan was mostly focused on controlling the Afghans near Jalalabad, and his army spent the winter in the Swat valley. Genghis Khan then sent his son Ögedei to attack Ghazni and take control of some Afghan mountain forts. This task took fifteen months to complete. Once Ögedei finished, Genghis Khan slowly returned to Mongolia, arriving there in 1224–25. A small Mongol force led by Dorbei Doqshin tried but failed to find Jalal al-Din. When Dorbei Doqshin rejoined Genghis Khan at Samarkand, he was sent out again with strict orders not to fail. They besieged Jalal al-Din for forty days in the spring of 1224, but the summer heat forced them to retreat. Later, Jalal al-Din received a message from his brother, Ghiyath al-Din, who had taken control of Khwarazmian lands in Western Iran and Iraq. Ghiyath invited him to return and restore Khwarazmian power. Jalal al- Din left his territory in the Punjab under a lieutenant and traveled across Makran to Persia and Anatolia. Before the Battle of Garni in 1225, he sent a letter to Queen Rusudan of Georgia demanding submission. Rusudan replied with a mocking letter, making fun of how badly Jalal al-Din had been defeated by Genghis Khan at the Indus River. == Notes == == References == === Citations === === Sources === * * * * * * * * * * * * * Category:History of Pakistan Category:13th century in India",
 "title": "Battle of the Indus"
}