{
 "id": "1133422",
 "text": "Operation Defensive Shield () was a 2002 Israeli military operation taking place in Israeli-occupied West Bank during the Second Intifada. In response to a terrorist attack in an Israeli hotel which killed 30 Israeli civilians 2 days prior to the start of Operation Defensive Shield. The operation lasted 42 days. It is the largest operation in the West Bank since the start of the Israeli occupation of the West Bank in 1967 after the Six-Day War. == Operation == \"Operation Defensive Shield\" was announced on 29 March. The goal of the operation was to eliminate terrorist infrastructure and gain operational action.. By early April, the IDF was conducting military operations inside many West Bank cities, with major conflicts existing in Bethlehem, Jenin, Nablus, and Ramallah. == Locations == === Jenin === thumb|center| Israeli soldiers in Jenin === Ramallah === thumb|center| Israeli soldiers in Ramallah. === Bethlehem === thumb|center| Israeli troops invading Bethlehem in April 2002. === Nablus === thumb|left| Israeli soldiers in Nablus. center|thumb| Israeli paratroopers serving in Nablus as part of Operation Defensive Shield. === Tulkarm === IDF Reserve Paratroop Battalion 55 entered Tulkarm with armored support. Palestinian militants abandoned their weapons and melted into the local population, and nine were killed by the IDF. A Tegart fort that had served as their headquarters was destroyed by an Israeli airstrike. The IDF also raided nearby villages, arresting hundreds of wanted men. === Hebron === On 4 April, gendarmes from an Israel Border Police undercover unit surrounded a house in Hebron where a member of the Al-Aqsa Martyrs' Brigades who was, along with his brother. The gendarmes demanded that the men in the house surrender. Shots were fired at the troops, killing one of them. After a gun battle lasting several hours, the Israeli troops stormed the house, discovering their suspect's wounded brother. They also discovered that the alleged arms merchant was not there anymore. == Controversies == === EU on Hamas Human Shields Usage === The European Union condemned the usage of human shields by Hamas.\"EU strongly condemns indiscriminate Hamas rockets on Israel and use of Palestinian population as human shields, 'terrorist groups in Gaza must disarm', calls for 'immediate ceasefire. The EU accused the Hamas movement of asking civilians in the Gaza Strip to provide themselves as human shields. === people disagreeing about the Jenin massacre === A lot of stories on the news about Operation Defensive Shield was about the massacre of Palestinians in Jenin. Palestinian cabinet minister Saeb Erekat was quoted by the press as saying there were 500 massacred Palestinians massacred by the IDF ion Jenin. In 2002, Mohammed Bakri, a prominent Arab actor and Israeli citizen, made a documentary called Jenin, Jenin, tell \"the Palestinian truth\" about the Battle of Jenin. The documentary said that a massacre of civilians occurred in Jenin. A French Jewish film maker, Pierre Rehov, also directed a documentary on what happened in Jenin during Defensive Shield. His film, The Road to Jenin, was produced to argue against the story Bakir's documentary told about the massacre. Pro-Israel media lobby group CAMERA reviewed the two documentaries. Their review said that Bakri has \"admitted to\" shortening his film by 25 min in the wake of criticism. ==== Reported first-hand allegations ==== David Rohde of The New York Times on the 16 April said: == Related pages == * 2002 Jenin massacre * Second Palestinian Uprising * List of invasions in the 21st century == References == Category:Second Palestinian Uprising Category:Israeli military operations",
 "title": "Operation Defensive Shield"
}