{
 "id": "1133318",
 "text": "The Los Tayos rocket frog or limon rocket frog (Hyloxalus nexipus) is a frog. It lives in Peru and Ecuador. ==Body== The adult male frog can be as big as 30.0 mm long from nose to rear end and the adult female frog can be 33.0 mm long. This frog has big disks on its toes for climbing. The skin of the frog's head and back is dark brown or almost black in color with darker marks. The sides of the body are black in color. There are two stripes from the nose all the way to the rear end. They can be red, light brown, or orange in color. There are smaller stripes closer to the belly. They can be blue-white, cream, or orange in color. The mouths and tops of the front legs can be yellow or light brown in color. The tops of the back legs are light brown to blue-white in color. They have brown marks on them. Other parts of the legs and the scutes on the feet are gray in color. The belly is white or yellow in color. The male frog's male organs are black in color. The iris of the eye is copper- red brown in color. ==Home== This frog lives in forests on hills where there is water in the air. It lives near streams that flow over rocks (not mud or sand). Some scientists found it in one forest with less water. It is usually the only poison dart frog in its home. This frog can live in gardens and in other places that human beings have changed. Scientists saw these frogs between 325 and 810 meters above sea level in Peru and between 500 and 1550 meters above sea level in Ecuador. Scientists saw the frog two protected parks: Santiago Comaina Reserved Zone and Alto Mayo Protection Forest. They think it could live in Sangay National Park too. ==Young== The female frog lays eggs on the dead leaves on the ground. After the eggs hatch, adult frogs carry the tadpoles to streams. The tadpoles swim in pools on the sides of streams where the water moves slowly. Scientists saw one adult male frog carrying 12 tadpoles at the same time. The tadpoles' bodies are wider than they are tall. The tadpoles are dark brown in color. Some of them have with light brown stripes. The tail is light brown with dark brown marks. ==Danger== Scientists say the frog is not in danger of dying out because many of them are alive now, because their home is big, and because they are good at living in places that human beings have changed. The only things that hurt this frog are bad chemicals and if people change a large place too much for the frog to live there. Scientists do not know if people catch this frog to sell as a pet. ==References== Category:Frogs of South America",
 "title": "Hyloxalus nexipus"
}