{
 "id": "1133742",
 "text": "The 2024 United States presidential debates were a series of debates held during the upcoming 2024 U.S. presidential election. The first general election debate between two major party candidates was moderated by CNN and attended by then-presumptive Democratic nominee Joe Biden and then-presumptive (at that time) Republican nominee Donald Trump on June 27, 2024. After the first debate, Biden withdrew from the race in July because of his poor performance, and Vice President Kamala Harris has replaced by being selected as the Democratic presidential nominee, while Trump became the official Republican nominee in the same month. The second debate, which was moderated by ABC, was held on September 10, 2024. There were previously four debates sponsored by the Commission on Presidential Debates (CPD) scheduled between September 16 and October 9, 2024. Biden and Trump both objected and scheduled a debate themselves. After Biden withdrew from the race, Trump suggested that the September 10 debate should be held by Fox News. Trump also suggested about additional debates on September 4 on Fox News and September 25 on NBC, the Harris campaign has not yet announced whether would participate in the two additional debates, instead of negotiating a presidential debate in October. A vice presidential debate was held on October 1, 2024 on CBS News. == List == == Debates == === First presidential debate === The first presidential debate takes place on June 27, 2024, on Thursday, at 9:00 p.m. (U.S. Eastern Time) in Atlanta, Georgia. CNN held the debate. The debate lasted 90 minutes. Trump spoke 4 minutes more than Biden (Trump spoke for 40 minutes and 12 seconds, Biden for 35 minutes and 41 seconds). There were 20 questions not counting the conclusion. Jake Tapper and Dana Bash were the moderators. During the debate, Biden often stuttered, spoke unclearly or even misspoke, which considered as the main reason of Biden withdrawal. Biden went off topic about 30% of the time during the debate, while Trump went off topic about 50% of the time. Both attacked each other during the debate. There was no audience or handshake before the debate, similar to the 2020 debate four years earlier. ==== Fast- checking ==== Moderators were criticized for not fact-checking both during the debate, according to journalist Daniel Dale of CNN, Trump made about 30 false claims while Biden made about 9 false claims during the debate. ==== Viewership ==== CNN reported that 47.9 million people watched the first debate, down more than 20 million from 73 million viewers in 2020. But it was later re-reported at 51.3 million. Network Viewers CNN 9,530,000 Fox News 9,276,000 ABC 9,210,000 NBC 5,390,000 CBS 5,011,000 MSNBC 4,122,000 Fox 3,677,000 Fox Business 397,000 Broadcast networks Cable news networks ==== Reactions ==== Trump was seen as the winner by many news, including The Hill, CNN, The New York Times, while some news, MSNBC and The Guardian, said neither Biden nor Trump won. A CNN poll found that 67% of respondents said Trump won the debate, compared to 33% who said Biden won. Biden's performance was widely considered \"a disaster\" in the history of television and presidential debates by a sitting president. Biden later claimed to have a cold and was tested for COVID-19 while at Camp David, which came back negative. Biden attended a debate watch party immediately after the debate, where many of his supporters and Biden called it the reason “America is so good.” Biden also stated that \"it's hard to argue with a liar,\" referring to Trump, then said that a New York Times article showed that Trump made more false claims than he did. Biden was congratulated on his performance by his wife, First Lady Jill Biden, at a post-debate conference. She told him on stage that he did “a fantastic job. He answered every question.” Biden’s running mate, Vice President Kamala Harris, said that although Biden “started slowly,” he managed to have a strong finish. Several other Democrats have also called for unity and wished Biden well, adding that it is necessary to join hands to help Biden, such as California governor Gavin Newsom, two former Presidents Barack Obama and Bill Clinton. Internationally, things are not looking good either, as top officials often worry or ridicule Biden for his poor performance, many European countries are extremely concerned about the debate, while Russian state media mocked Biden's performance. ===== Calls for Biden to drop out ===== Following the debate, many Democratic officials began calling for Biden to drop out. One day before Biden withdrew, 38 Democratic in House of Representatives and Senate called on Biden to stop running, including four independents that caucus with Democrats. With U.S. representatives Lloyd Doggett of Texas becoming the first to call on him to end his presidential campaign, a growing number of Democrats have since called on Biden to end his candidacy. Biden has repeatedly refused to give up, the 2024 NATO summit in Washington is considered another motivation for Biden to ignore the doubts after the debate, but during the conference, Biden mistakenly called Vice President Kamala Harris 'Vice President Trump', as well as mistakenly called Ukrainian President Volodymyr Zelenskyy 'President Putin', which further raised doubts, and more and more people are calling for him to give up. On July 21, 2024, Biden suspended his presidential campaign, endorsing Vice President Kamala Harris for president. === Second presidential debate === The second presidential debate takes place on September 10, 2024, on Tuesday, at 9:00pm (U.S. Eastern Time) at the National Constitution Center in Philadelphia, Pennsylvania. ABC held the debate. David Muir and Linsey Davis were the moderators. Previously, Trump and Biden both agreed to a second debate, after Biden withdrew, Kamala Harris became the Democratic presidential candidate. Trump changed his mind and wanted to transfer ABC to Fox News as the manager. There were many doubts about whether the second debate would take place. Trump tweeted on Truth Social on September 2 that he was “terminating” the debate on ABC and moving it to Fox News instead. Harris said she would still appear on ABC as agreed whether Trump showed up or not. On August 8, Trump announced that he would rejoin the ABC debate, but he made it conditional on Harris participating in other debates. On August 27, Trump withdrew his request and pledged to rejoin the ABC debate. Harris and Trump both met ABC's criteria to participate in the debate. This is also the first time the two candidates from the two major parties have shaken hands, something that has not happened in any debate since 2016. Before the debate began, there were false reports that Haitian immigrants in Springfield, Ohio, were stealing and eating cats and dogs. Trump also raised the issue during the debate. His opponent, Harris, just laughed when he heard it. During the debate, Harris often smirked, grinned or shook her head, looking at her opponent or the camera, when Trump answered, while Trump often showed annoyance and frowned. Trump also frequently refers to Harris as a Marxist and a communist, Trump also makes many false claims, disinformation, Harris and Trump often attack each other, Trump even compares Harris as \"the worst vice president in US history\" and Biden \"the worst president in US history\". Harris and Trump also talked about crowd size at campaign rallies during debate. Trump was also asked about the January 6 attack, whether he regretted it, to which he said no and changed the subject, criticizing then-House Speaker Nancy Pelosi for \"not sending in the National Guard.\" Trump and Harris were asked about the war between Russia and Ukraine. Trump did not directly answer, saying that he did not want anyone to die in the war and wanted the war to end. Harris said that Trump \"supported\" and \"conceded\" to Putin and said that if Russia invaded Ukraine while he was president, Putin \"would be sitting in Kyiv\". She also criticized Trump's statement that the war would end in 24 hours. Trump groused that Putin actually loves Harris: \"Putin endorsed her last week. Said I hope she wins. And I think he meant it.\" Kremlin Spokesman Dmitry Peskov said later the debate that \"Leave our president alone\". ==== Fast-checking ==== Moderators fast-checked candidates during the debate, but were accused of fast-checking only Trump and leaving out Harris. Both Harris and Trump made false claims, with Trump claiming that immigrants in Springfield, Ohio were eating pets, to which moderator David Muir responded that there were no credible reports of pets being harmed. Trump countered by claiming that he had seen TV interviews in which people said their dogs had been taken and eaten. Harris falsely claimed that during Trump's tenure there had been more unemployment than since the Great Depression. Harris also falsely claimed that no members of the US military were actively serving in a war zone, with the US military's Central Command soon after issuing a statement saying that they had engaged multiple Houthi targets in Yemen in the past 24 hours. ==== Viewership ==== Nielsen Media Research reported that 67.1 million viewers across ABC and 16 other television networks watched the debate, up from 51.3 million who watched the June 27 presidential debate between Biden and Trump, but still lose for more than 5 million viewers compared to the first 2020 presidential debate. ==== Reactions ==== Harris was seen as the winner by CNN, Politico, The New York Times, The Guardian, and MSNBC. A CNN poll found that 63% of people believed Harris won the debate, while 37% thought Trump won. Trump's performance was widely seen as problematic, similar to Biden's. One of Trump's statements, \"They're eating the dogs ... they're eating the cats ... they're eating the pets,\" became an Internet meme, most notably on the short-form video sharing platform TikTok, along with Harris's expression. Trump's eating cat claims are considered his weakest point, while others find the claim unbelievable. Despite being seen as the debate winner, Harris still struggles with public recognition and policy changes because she is still less well-known than Biden. === Vice presidential debate === The vice presidential debate was held on Tuesday, October 1, 2024, at 9:00 p.m. (U.S. Eastern Time) at the CBS Broadcast Center in New York City, New York. CBS News hosted the debate, with Margaret Brennan and Norah O'Donnell serving as moderators. After Biden suspended his campaign, a vice presidential debate was in doubt, as previously after JD Vance was selected as the Republican vice presidential nominee, he hoped to debate Vice President Kamala Harris, after Harris selected Minnesota Governor Tim Walz as her running mate, Walz said he would love to debate Vance. Both vice presidential candidates prepared before the debate. The debate, broadcast by CBS News, lasted more than 90 minutes, with both candidates' microphones on while the other spoke, a precedent not seen in the 2024 presidential debates, although CBS said in a press release that it \"reserves the right to mute candidates' microphones.\" Neither vice presidential candidate was allowed to ask questions of the other, only the moderator. At the end of the debate, Walz gave the first closing remarks, followed by Vance. CBS has said it will not fact-check, which will happen after the debate. Walz spoke more than Vance during the debate, Walz spoke for about 40 minutes and 42 seconds, while Vance spoke for 38 minutes and 59 seconds, according to CNN. The two talked about climate change, the economy, immigration, abortion and even the carnivore allegations in Springfield, Ohio. As for the economy, Vance said Harris' economic agenda sounded pretty good, but implied that she \"could do it as vice president if she wanted to, and he blamed her for many of the country's economic challenges, claiming that many voters trust Trump more on the economy.\" When Walz spoke about Amber Thurman, a woman lived in the state of Georgia who died after a delay in having fetal tissue removed from her body following a medication abortion, Vance said, “I agree with you. Amber Thurman should be alive.” Vance also said he does not support a nationwide abortion ban, although he did support a “national minimum standard” when he ran for the Senate. During the debate, Trump tweeted that he would veto any bill that would ban abortion nationwide. ==== Fast-checking ==== As mentioned above, CBS will not fact-check the candidates until the debate is over. However, moderators also questioned Vance about Haitian immigrants in Springfield, Ohio, which Vance later objected to due to CBS rules, adding that immigrants should not be considered legal because the federal government decided their protected status after they arrived in the United States, Walz rejected Vance's argument and the microphone was turned off while Vance was speaking. ==== Viewership ==== Nielsen Media Research reported that 43 million viewers tuned in to watch the debate, down more than 14 million viewers from the 57 million viewers who watched the 2020 vice presidential debate. ==== Reactions ==== Vance was declared the winner by The New York Times, The Wall Street Journal, USA Today, and The Los Angeles Times. A columnist from MSNBC said Walz the winner of the debate. According to polls, the debate was considered a tie, with a CNN poll showing Vance narrowly winning over Walz, with 51% of people thinking Vance won while 49% thought Walz won. Vance's debate performance was positively reviewed by experts, with commentators from major newspapers such as The Washington Post and Reuters surprised by the focus on policy and civility towards each other compared to the two previous divisive presidential debates. == Other debates == Many debates and forums were held, mostly moderated by the Free and Equal Elections Foundation. == Notes == == References == Category:2024 in the United States Category:2024 United States presidential election Category:2024 United States presidential campaigns Category:Presidency of the United States Category:Controversies in the United States Category:June 2024 events Category:2024 elections in the United States",
 "title": "2024 United States presidential debates"
}