{
 "id": "1133084",
 "text": "thumb| A destroyed ambulance at the Red Crescent's Al-Quds Hospital during the 2009 war in Gaza. thumb| A Palestinian Red Crescent ambulance at an Israeli checkpoint. The Palestine Red Crescent Society was founded in 1968 by Fathi Arafat, brother of Yasser Arafat.وفاة فتحي عرفات أخ زعيم منظمة التحرير الفلسطينية عن عمر يناهز 67 عاماً This association is an emergency services and humanitarian organisation. It is one of the member associations of the International Red Cross and Red Crescent Movement. It provides its services through hospitals, medicines, first aid, and other health care in the West Bank and the Gaza Strip. The association's general administration offices are located in the city of Al-Bireh, in the occupied West Bank. In 2006, the Society was recognized as a full member of the International Federation of Red Cross Societies. == Ambulance services == The Palestine Red Crescent Society provides the majority of ambulance services in Palestine, providing emergency medical and relief services to Palestinians, a job signed to them by Chairman of the Palestine Liberation Organization, Yasser Arafat in 1996. Ambulance services are provided by 41 main and sub-stations, 22 mobile field centres, 122 ambulances, 346 emergency medical technicians and more than 500 volunteers. 1996 was also the year that the Medical Emergency Institute was started, which trains staff and emergency medical teams according to international standards. Also, the Palestinian Red Crescent Association played an effective role in choosing the national emergency number (101). == Attacks on the Palestine Red Crescent == The conflict between the Israel and Palestinians has created some special problems for the provision of services. The Israel Defense Force (IDF) claims that there have been several incidents in which Palestinian ambulances were found transporting bombs, rockets, or Palestinian fighters \"disguised as patients\". WORLD HEALTH ORGANIZATION FIFTY- SIXTH WORLD HEALTH ASSEMBLY A56/INF. As a result, the IDF has a policy of stopping and searching all Palestinian ambulances at roadblocks, regardless of the seriousness of the patient’s condition. WORLD HEALTH ORGANIZATION FIFTY- SIXTH WORLD HEALTH ASSEMBLY A56/INF. The First Geneva Convention says that if fighters are wounded they are not allowed to be attacked, but the IDF does not acknowledge that this also applies to resistance fighters and other so-called non-state actors. The IDF says they are \"illegal combatants\" or \"terrorists\", categories of person do not exist in international law. According to the Palestinian Red Crescent Society, the Israeli Army and Israeli Air Force deliberately target Palestinian ambulances, preventing and obstructing them from performing their duties, in violation of international humanitarian law. For example, in 2003, the Palestine Red Crescent Society reported that seven staff members were injured and 12 ambulances were damaged in attacks by Israeli settlers and the Israeli military, and that Palestine Red Crescent Society ambulances were prevented or delayed from reaching areas 584 different times. During the 2008–2009 Gaza War, Amnesty International rejected accusations by Israel that Hamas and Al-Qassam systematically used medical facilities, vehicles, and uniforms as cover, they said that Israel had not shown any evidence to prove this happened. Also Magen David Adom stated to the UN mission investigating the war that “there was no use of PRCS ambulances to transport weapons or ammunition… [and] there was no misuse of the emblem by the PRCS.” == International == On 4 August 2020, the Palestine Red Crescent Society in Lebanon participated in relief operations after the Beirut port explosion, and declared a state of emergency in its facilities, vehicles and personnel in Beirut to support the efforts of the Lebanese Red Cross crews. Haifa and Al-Hamshari hospitals received dozens of injured people, and the association launched a blood donation campaign in Beirut and Sidon. == References == == Other websites == * Palestine Red Crescent Society website * Society's summary of relief operations * Press release from the International Red Cross and Red Crescent Movement * The International Red Cross and Red Crescent Movement calls for support for the Palestinian Red Crescent Society. Category:Official website different in Wikidata and Wikipedia Category:Articles containing German-language text",
 "title": "Palestine Red Crescent Society"
}