{
 "id": "1134291",
 "text": "Mercy Asiedu (born May 9, 1971) is a well-known Ghanaian actress who has helped the movie industry grow. She is famous for her roles in Concert Party and Asoreba. She is also known for being one of the popular Kumawood actresses in the 2000s. ==Career== Before she started acting, Mercy Asiedu worked as a seamstress. Her godfather, Apostle Kwadwo Sarfo, helped her get into acting. She first performed with a small group at church events, especially during conventions. The 50-year-old actress often thanks Apostle Sarfo for spotting her talent and encouraging her and her friends to act. She shared that Apostle Sarfo invited her, Agyekoo, and Akrobeto to join the concert party group since they were already doing similar work. She remembers him writing a story to help them in their acting careers and telling them it would be important one day. Mercy Asiedu’s career took off as she starred in many films like Obaakofou, Sumsum, Aware, Kakra Yebedie, Agya Koo Trotro, Ghana Yonko, Emma Dodo Kunu, Divine Prayer, Obi Yaa, Sama Te Fie, and Old Soldier. Her role in Asoreba made her well-known to audiences around the world. She said, \"Since then, I've been in many movies. Asoreba helped me reach a larger audience, and it’s one of my favorite films, along with *I Know My Right*. I’m proud of what I’ve achieved.\" Born on May 9, 1971, Mercy Asiedu is a well-known Ghanaian actress who has greatly helped the film industry. She became famous for her roles in the 1990s stage drama Concert Party and was a top Kumawood actress in the 2000s. She is known for her varied and sometimes controversial roles. She started acting as a teenager with the Kristo Asafo Concert Party group. She is recognized for her roles in Kumawood films, which are made in Akans, Twi, a local dialect. She has acted in movies with stars like Agya Koo, Lil Win, Kwaku Manu, Aboagye Brenya. == Personal life == On April 2, 2017, she married Nana Agyemang Badu Duah, who is a Chief of Kunsu in the Ahafo Ano South District, Ashanti Region. She has three children: two sons and a daughter. === Politics === In September 2016, she supported the presidential candidate Nana Addo Dankwa Akufo-Addo from the New Patriotic Party. In July 2016, she said she would curse anyone who claimed she took money to campaign for the ruling National Democratic Congress. == Filmography == * Obaa Hemaa (2007) as Abrafi * Susubiribi (2013) as Kwaku's Mum * Kakra A Yebedie Nti (2006) as Maame Achia * Agya Koo Trotro Driver (2012) * Ghana Yonko * Emaa doduo Kunu * Eye Asem (2011) as Bruwaa * Obidee Aba (2005) as Maame Nyarkoaa * Asoreba (2007) * Akurasi Burgers (2008) as Frema ==References== == Other websites == * Mercy Asiedu on IMDb * Official Instagram Page * DELAY interviews Mercy Asiedu Category:1971 births Category:Living people Category:Ghanaian movie actors Category:Ghanaian actors",
 "title": "Mercy Asiedu"
}