{
 "id": "1134344",
 "text": "Leila Afua Djansi is a filmmaker from America and Ghana. She started making movies in the Ghana movie industry. == Early life == Leila Afua Djansi was born on July 17.Nelmes, Jill; Selbo, Jule, Women Screenwriters: An International Guide, Springer (2015), p. 20, . Retrieved 12 January 2019. Her dad was a pilot, and her mom was a nurse. She grew up in India and Ghana. She liked acting and writing but wanted to be a gynecologist at first. Later, she became interested in forensics. While studying criminology, she met a Ghanaian actor named Sam Odoi. He asked her to write a script for him. At 19, her script called Babina was turned into a movie by producer Akwetey Kanyi.\"10 Must See African Movies of the 21st Century\", CNN, 02 August 2022 == Education == Djansi went to Kabore Primary and JSS, and then Mawuli School for her primary, junior, and secondary education. All these schools are in Ho, in the Volta Region of Ghana. She started learning about film at the National Film and Television School. Later, she moved to the United States to finish her film studies at Savannah College of Art and Design, where she got a special scholarship for her art. == Career == Djansi was the president of the Ghana Library Board Readers Club for three years. She started in entertainment in 1998 when she was a runner-up in a regional beauty pageant in junior high school. At age 19, Djansi began her movie-making career in Ghana with the Ghana Movie Company. She worked with the Gama Movie Company, where she wrote and produced the film \"Legacy of Love.\" In 2009, her first film as a director, \"I Sing of a Well,\" got 11 nominations at the Africa Movie Academy Awards and won the Special Jury Award for Best Film. The film also won the BAFTA/LA Choice Award at the Pan African Film Festival. Djansi made the film \"Sinking Sands\" to support the Say No to Violence Against Women Campaign by UNiFEM Ghana. In 2011, her film \"Ties That Bind\" won Best Diaspora Film at the San Diego Black Film Festival and was chosen for the AFI's New African Films Festival in 2012. The star of the film, Kimberly Elise, was nominated for Best Actress at the American Black Film Festival. The film was also nominated for Outstanding Foreign Film at the 2012 Black Reel Awards. Her film \"Like Cotton Twines\" was chosen for the 2016 Los Angeles Film Festival in the World Fiction Section. The film, shot entirely in Ghana, tells the story of a 14-year-old girl who becomes a religious slave. Other works by Djansi include \"Where Children Play\" with Grammy winner Macy Gray, \"40 and Single\" which won Best Episodic Television Show at the LA Film Festival, and \"All The Men in my Life\" starring Rochelle Aytes. Djansi has received international recognition for using filmmaking to highlight women's issues. She is praised for making movies about and for women, and for bringing a new storytelling style to Ghana's film industry. Her work has inspired other Ghanaian filmmakers to return and share African stories. Djansi continues to be celebrated for her films about black women. == Awards and recognition == Djansi's first film, \"Grass Between My Lips\" won a 2009 worldFest Platinum Award. It is about female circumcision and early marriage in a village in northern Ghana. In 2010, her first big film, \"I Sing of a Well\" was nominated for 11 Africa Movie Academy Awards. It won 3 awards: Best Sound, Best Costume, and the Jury Special Award for Best Film. In 2011, Djansi also received the BAFTA/LA Pan African Film Festival Choice Award for \"I Sing of a Well.\" In 2011, her film \"Sinking Sands\" got 10 nominations at the Africa Movie Academy Award. Ama K Abebrese won Best Actress, and Djansi won Best Original Screenplay. Her third film, \"Ties That Bind,\" was nominated for a Black Reel Awards in 2012. It also won Best Diaspora Film at the 2012 San Diego Black Film Festival. In 2016, Djansi directed \"Like Cotton Twines,\" which explores the practice of Trokosi in Ghana. The film was nominated for \"Best World Fiction Film\" at the Los Angeles Film Festival. It won Best Narrative Feature at the 2016 Savannah Film Festival and also at the Riverbend Film Festival in 2017. Djansi's other work includes \"40 and Single\" which won Film Independent Best Episodic for 2018 and was made for AMC's Allblk. == References == == Other websites == * * Turning Point Pictures * Keisha Hatchett, \"Interview: Like Cotton Twines Filmmaker Leila Djansi on Slavery, Black Unity and Diversity in Hollywood\", The Mary Sue, 20 January 2017. * Borys Kit, And Then There Was You. Garcelle Beauvais to star in Leila Djansi's And Then There was You\", The Hollywood Reporter, 18 April 2013. * Stephen Saito, \"LA Film Fest '16 Interview: Leila Djansi on Untangling 'Like Cotton Twines, The Moveable Fest, 15 June 2016. Category:Living people Category:1981 births Category:Ghanaian movie directors Category:Ghanaian movie producers",
 "title": "Leila Djansi"
}