{
 "id": "1134756",
 "text": "Wallows is an American alternative rock band based in Los Angeles. The band is composed of Dylan Minnette, Braeden Lemasters, and Cole Preston. The band began releasing songs independently in April 2017. In 2018, Wallows signed a deal with Atlantic Records and released their major-label debut EP, Spring. The band released their debut studio album, Nothing Happens, in 2019. It was followed by their 2020 EP Remote. The band released their second album Tell Me That It's Over in 2022. Their third album, Model, was released in 2024. ==History== === 2011–2018: Early years, singles, and Spring EP === As teenagers in 2011, Braeden Lemasters (guitar/vocals), Cole Preston (guitar/drums), and Dylan Minnette (guitar/vocals) formed the band at a music studio called Join the Band in Van Nuys with Zack Mendenhall (bass). They changed their name to Feaver and played the 2011 Warped Tour. They also used the name The Narwhals before settling on Wallows in 2017, without Mendenhall. In April 2017, the band released their first single under the name Wallows, \"Pleaser\". The song eventually reached number two on the Spotify Global Viral 50 chart and number one on the KROQ Locals Only playlist. In May 2017, Wallows released a second single, \"Sun Tan\". They also started playing live shows in the Los Angeles area, selling out The Roxy and the Troubadour. Their third single, \"Uncomfortable\", was released in September 2017. In November 2017, their song \"Pulling Leaves off Trees\" premiered on Zane Lowe's Beats 1 radio show. That month, the band also announced their first major North American tour. The tour would last from January to March 2018. The tour started in San Francisco on January 24. In February 2018, the band announced that they had signed to Atlantic Records and were planning to release their major label debut EP, Spring, in April 2018. They also released a new single, \"Pictures of Girls\", their first on Atlantic. The song was chosen as a \"Critical Cut\" by SiriusXM Alt Nation. Wallows ended their North American tour at South by Southwest in March 2018. Later in March, they released a second track from Spring titled \"These Days\". The EP was released on April 6, 2018, by Atlantic Records and was produced by John Congleton. === 2019–2021: Nothing Happens and Remote EP === On February 1, 2019, the band released a single titled \"Are You Bored Yet?\", featuring Clairo. It was released along with a music video which featured cameo appearances from Noah Centineo and The Regrettes. The music video was nominated for an MTV Video Music Award in the \"Best Push Performance of the Year\" category. \"Are You Bored Yet?\" was a certified 2× platinum single by the RIAA, becoming the band's first song to be certified platinum. This song is the lead single for their debut album, Nothing Happens, released on March 22, 2019. The album was liked by most critics and peaked at number 75 on the US Billboard 200. It also reached No. 8 and 13 on the Billboard Alternative and Rock Album charts respectively. Wallows continued their Nothing Happens Tour in February 2020, for 15 additional stops. The band partnered with local non-profit charities in each of the cities in this part of the tour, such as Project Lazarus and the LGBT Center of Raleigh. Before each show, the band posted a list of items for their attendees to bring to donate on their social media accounts, and they were able to get a lot of items to donate after each show. On March 20, 2020, Wallows released a new single titled \"OK\" alongside a music video. On September 9, 2020, Wallows released another single, titled \"Nobody Gets Me (Like You)\", and announced their second major EP, Remote. The EP was released on October 23, 2020. On February 15, 2021, Wallows announced a deluxe version of Remote alongside the release of a new single titled \"Quarterback\". The deluxe edition was released on February 19, 2021, with two new songs. Those songs were the previously released single, \"OK\", and a remixed version of \"OK\" that features Remi Wolf and Solomonophonic. === 2021–present: Tell Me That It's Over and Model === On September 30, 2021, Wallows released the single \"I Don't Want to Talk\". This song is the lead single off of their second album, Tell Me That It's Over, which was released on March 25, 2022. Wallows went on their Tell Me That It's Over Tour in April 2022 and toured throughout 2022 and into 2023. On February 16, 2024, Wallows released \"Your Apartment\", the lead single from their third album. On March 5, 2024, Wallows announced the album, Model, which was released on May 24, 2024. Wallows also released a short film to accompany the album when they announced it. ==Members== ===Current members=== * Dylan Minnette – lead and backing vocals, rhythm guitar, keyboards, bass (2011–present) * Braeden Lemasters – lead and backing vocals, lead guitar (2011–present) * Cole Preston – drums, percussion, guitars, keyboards, piano, backing vocals (2011–present) ===Former members=== * Zack Mendenhall – bass (2011–2017) ==Discography== ===Albums=== List of albums with selected album details Title Details Peak chart positions Certifications US US Rock AUS Peaks in Australia: * Tell Me That It's Over: * Model: FRA Phys. HUN Phys. IRE NED Vinyl SCO UK Nothing Happens * Release date: March 22, 2019 * Label: Atlantic * Formats: Digital download, CD, cassette, LP 75 13 — — — — — — — * RIAA: Gold Tell Me That It's Over * Release date: March 25, 2022 * Label: Atlantic * Formats: Digital download, CD, cassette, LP 49 7 80 — — 97 — 9 88 Model * Release date: May 24, 2024 * Label: Atlantic * Formats: Digital download, CD, cassette, LP 28 7 14 134 40 — 14 8 38 \"—\" denotes a recording that did not chart or was not released in that territory. ===EPs=== List of EPs with selected album details Title Details Peak chart positions US US Rock SCO UK Sales The Narwhals * Released: October 10, 2014 * Label: Independent * Formats: Streaming — — — — Spring * Released: April 6, 2018 (US) * Label: Atlantic * Formats: Digital download, LP, CD, vinyl record — — — — Remote * Released: October 23, 2020 * Label: Atlantic * Formats: Digital download, streaming, LP, CD, vinyl record 129 23 58 88 \"—\" denotes a recording that did not chart or was not released in that territory. === Compilation albums === Title Details Peak chart positions US US Rock SCO UK Rec. Singles Collection 2017—2020 * Released: April 23, 2022 * Label: Atlantic * Formats: LP, digital download, streaming 108 17 42 33 Nothing Happens: 5th Anniversary Edition * Release date: April 20, 2024 * Label: Atlantic * Formats: LP — — — — \"—\" denotes a recording that did not chart or was not released in that territory. ===Singles=== Title Year Peak chart positions Certifications Album US Bub. US Rock AUS Hit. BEL CAN Rock IRE JPN Over. LTU MEX UK *For \"Are You Bored Yet\": \"Pleaser\" 2017 — — — — — — — — — — * RIAA: Gold rowspan=\"4\" \"Sun Tan\" — — — — — — — — — — \"Uncomfortable\" — — — — — — — — — — \"Pulling Leaves Off Trees\" — — — — — — — — — — \"Pictures of Girls\" 2018 — — — — — — — — — — Spring \"These Days\" — — — — — — — — — — * RIAA: Gold \"Underneath the Streetlights in the Winter Outside Your House\" — — — — — — — — — — Nothing Happens \"1980s Horror Film\" — — — — — — — — — — Spring \"1980s Horror Film II\" — — — — — — — — — — rowspan=\"2\" \"Drunk on Halloween\" — — — — — — — — — — \"Are You Bored Yet?\" 2019 12 7 8 193 37 59 — 82 15 65 * RIAA: 3× Platinum * ARIA: Platinum * MC: Platinum * ZPAV: Gold * BPI: Gold Nothing Happens \"Scrawny\" — — — — — — — — — — * RIAA: Gold \"Sidelines\" — — — — — — — — — — \"Trust Fall\" / \"Just Like a Movie\" — — — — — — — — — — \"Treacherous Doctor\" — — — — — — — — — — \"Remember When\" 2020 — — — — — — — — — — * RIAA: Gold \"OK\" — 28 — — — — — — — — * RIAA: Gold Remote \"Nobody Gets Me (Like You)\" — — — — — — — — — — \"Virtual Aerobics\" — — — — — — — — — — \"Wish Me Luck\" — — — — — — — — — — \"Quarterback\" 2021 — — — — — — — — — — \"I Don't Want to Talk\" — — — — — — — — — — Tell Me That It's Over \"Especially You\" 2022 — — — — — — — — — — \"At the End of the Day\" — — — — — — — — — — \"Your Apartment\" 2024 — — — — — — — — — — Model \"Calling After Me\" — 39 — — — — 8 — — — \"Bad Dream\" — — — — — — — — — — \"A Warning\" — — — — — — — — — — \"You (Show Me Where My Days Went)\" — — — — — — — — — — \"—\" denotes a recording that did not chart or was not released in that territory. === Music videos === Song Year Views (August 2024) Corresponding Release \"Pictures of Girls\" 2018 12M Spring EP \"These Days\" 30M \"1980s Horror Film\" 3.7M \"Are You Bored Yet?\" 2019 83M Nothing Happens \"Scrawny\" 9.4M \"Treacherous Doctor\" 2.2M \"Remember When\" 2020 7.3M \"OK\" 11M Remote \"Nobody Gets Me (Like You)\" 1.9M \"Wish Me Luck\" 614K \"Quarterback\" 2021 2.8M \"I Don't Want to Talk\" 3.1M Tell Me That It's Over \"Especially You\" 2022 1M \"At The End of the Day\" 1.3M \"Marvelous\" 740K \"Your Apartment\" 2024 1.2M Model \"Calling After Me\" 2.8M \"A Warning\" 286K \"You (Show Me Where My Days Went)\" 460K \"Bad Dream\" 338K === Notes === ==Awards and nominations== Year Award Category Winner(s) / Work(s) Result 2020 MTV Europe Music Award Best Push Act Themselves 2021 MTV Video Music Awards Best Push Performance of the Year \"Are You Bored Yet?\" iHeartRadio Music Award Best New Rock/Alternative Rock Artist Themselves ==Notes== ==References== ==Other websites== * Category:2010s American music groups Category:2011 establishments in California Category:American alternative rock bands Category:Atlantic Records artists Category:Musical groups established in 2011 Category:Musical groups from Los Angeles Category:Musical trios",
 "title": "Wallows"
}