{
 "id": "1134678",
 "text": "Kofi Adjorlolo (born 23 March 1956 in Keta) is an actor and movie producer from Ghana. He was nominated once for Best Actor in a Lead Role at the Ghana Movie Awards and four times for Best Supporting Actor at the Africa Movie Academy Awards, Africa Magic Viewers Choice Awards, and Africa Magic Viewers Choice Awards. He has won awards like the International Golden Image award from Liberia's President Ellen Johnson Sirleaf and the Best Cameo Actor award at the 2011 Ghana Movie Awards. == Early life and education == Kofi Adjorlolo was born in Keta, in the Volta Region of Ghana. As a child, he loved the arts, especially music, and later became interested in acting. He went to Keta Senior High Technical School, where he showed his talent in school plays and cultural activities. His early experiences helped him become a versatile actor, able to take on many different roles. He finished AME Zion School in Keta and went to Keta Keta Senior High Technical School. After that, he got his sixth form Certificate from Ebenezer Secondary School in Dansoman. He also studied at the University of Ghana, where he earned a degree in Mass Communication. == Career == Kofi Adjorlolo started his career as a musician, playing instruments like the trumpet and organ. In his twenties, he went to Nigeria and played with a famous musician named Victor Uwaifo. He also performed with another well-known musician, Felix Bell. When he returned to Ghana, he formed the Osagyefo band and played with the Dasebre band. He worked as a civil servant and a radio presenter at Ghana Broadcasting Corporation and Peace FM. He also helped start a religious radio station called Channel R. A radio station called HOT 93.9FM in Accra honored him for 30 years of work in the entertainment industry. He joined the Ghana movie industry in 2003. Kofi Adjorlolo entered the entertainment world through music, playing with bands like the Uhuru Band and Osagyefo Band. His talent for performing helped him smoothly move into acting in the late 1990s. His early movie roles in Ghana made him well-known, as he brought both strength and charm to the screen. His skill in playing different characters made him stand out in the growing Ghanaian movie industry. == Notable Works and Achievements == Kofi Adjorlolo has acted in many movies in both Ghana and Nigeria, getting a lot of praise for his performances. Some of his important movies are The Will, Ties that Bind, and Single and Married. He has won several awards, including the Ghana Movie Awards, and has been nominated for Africa Movie Academy Awards. He has also acted in many Ghallywood movies with famous actors like Yvonne Nelson, Jackie Appiah, John Dumelo, Van Vicker, Nadia Buari, Majid Michel, and others. His work in both the Ghanaian and Nigerian film industries has made him a well-respected actor with a lasting legacy. == Impact on the Ghanaian Film Industry == Kofi Adjorlolo has had a big impact on the Ghanaian film industry. As one of the first actors of his time, he helped the industry grow from something small to something more organized and respected. He has mentored many young actors, sharing his experience and giving them advice. His work has also helped connect the Ghanaian and Nigerian film industries, leading to more teamwork and movies made between the two countries. == Personal Life and Philanthropy == Outside of his career, Kofi Adjorlolo is known for helping others, especially in education and health projects in his hometown of Keta. He often speaks out about social issues and believes in giving back to the community. Even though his personal life is sometimes mentioned in the media, he mostly keeps it private and focuses on his work and charity. == Legacy and Future Prospects == Kofi Adjorlolo is still acting in new roles and is one of Ghana's most famous actors. His path from being a musician to a well-known actor shows how talented and dedicated he is to the arts. His influence is expected to last into the future. == Filmography (selected) == Year Title Role Notes 2003 The Chosen One Part 1&2 Deacon Prempeh 2006 My Mother's Heart Boakye Nominated for Best Actor (Supporting Role) at the 2nd Africa Movie Academy Awards 2007 Princess Tyra King 2009 Heart of Men Bernard 2009 Agony of Christ 2010 The Beast Dr. Brooks Nominated for Best Actor in a Supporting Role (English) at the 2010 Ghana Movie Awards 2011 Ties that Bind Father 2011 Somewhere in Africa General Olemba Winner, Best Cameo Actor at the 2011 Ghana Movie Awards 2012 Adesuwa (A Wasted Lust) 2012 Single and Married Ranesh 2012 Wipe My Tears Nominated for Best Actor in a Lead Role (English) at the 2012 Ghana Movie Awards 2014 Family Album Nominated for Best Actor in a Supporting Role at the 2014 Ghana Movie Awards 2014 A Northern Affair 2015 Code of Silence 2015 Falling Mr Mazi Mba 2016 Ghana Must Go father Nominated for Best Supporting Actor Movie/TV series at the 2017 Africa Magic Viewers Choice Awards 2017 Crime Suspect 2018 That Night 2019 Hero: Inspired by the Extraordinary Life and Times of Mr. Ulric Cross Asantehene 2020 Aloe Vera Papa Aloe == Related pages == * Ghana Movie Awards == References == == Other websites == * Kofi Adjorlolo on IMDb Category:1956 births Category:Living people Category:20th-century Ghanaian actors Category:21st-century Ghanaian actors Category:Ghanaian movie actors Category:Ghanaian movie producers",
 "title": "Kofi Adjorlolo"
}