{
 "id": "1134380",
 "text": "A law enforcement agency (LEA) is any government agency responsible for law enforcement within a specific jurisdiction through the employment and deployment of and their resources. The most common type of law enforcement agency is the police, but there are also other types including organisations that focus on specific legal violation, or are run by a particular authority. They typically have various and legal rights to allow them to enforce the law. Such as the and the . left|thumb| Scotland Yard, headquarters of the Metropolitan Police, the law enforcement agency of London, England. center|thumb| The exterior of the Los Angeles Police Department's West Valley Area Police Station. The LAPD operates approximately 21 such stations divided across Los Angeles; this one covers policing in the San Fernando Valley. == International and multinational == right|thumb| Countries in Europe that are members of Sometimes groups of countries team up to enforced the law. One examples of this is Europol. === Federal === thumb| officers with their police car. Some countries are a federation of multiple states, the states team up to form a . Examples: * Argentine Federal Police (Argentina) * Australian Federal Police (Australia) * Federal Police of Brazil (Brazil) * Royal Canadian Mounted Police (Canada) * Bundespolizei (Germany) * Mexican Federal Police (Mexico) * Federal Bureau of Investigation, Federal Protective Service, United States Park Police (United States) * Central Bureau of Investigation (India) === National === thumb| Ishikawa Prefectural police officers with their police cars. Japanese police are managed and coordinated by the , and divided into agencies for their respective prefectures. == State law enforcement agencies == == Military == right|thumb| officers with their police car. Military organizations often have law enforcement units. These units within armed forces are generally referred to as == Related pages == * Sheriff * Police == Other websites == * Berlin: Metropolis of crime 1918 - 1933 Part 1 , Part 2 (warning: graphic depiction of murder and other violence), a Deutsche Welle English television documentary comprehensively depicting a major European police force and its methods, investigations, and political activities during the early 20th century Category:Law enforcement agencies Category:Law enforcement",
 "title": "Law enforcement agency"
}