{
 "id": "1134945",
 "text": "Mária Vidláková sometimes written as Marie Vidláková with marriage name Kuchovská (4 September 1904 - 13 August 1994) was a Czechoslovak track and field athlete, handball player and tennis player. She was active during the 1920s, the early era of women's athletics. She was a world record holder won a gold and bronze medal at the second Women's World Games in 1926. ==Biography== Vidláková was born in 1904 in Třebíč and was a member of SK Trebic (1924-1925), AC Moravská Slavia Brno and SK Židenice (1926-1929). As an athlete she competed in sprint events, discus throw, shot put, javelin throw and hurdles. She also played handball at national level and tennis. At the 1924 Brussels Femina Club international women's athletics meeting she won the discus throw event and finished third in the 83 metres relay event. On 12 July 1925, she set the world record in the 4 x 75 meters relay for the national team in Ljubljana (together with Miloslava Havlíčková, Kamila Olmerová and Zdena Smolová). On 11 October 1925 she set the world record in the discus throw with a disctance 31.15 meters in Prague. In 1925 she also held the unofficial world record in the javelin throw. In 1926, she represented Czechoslovakia at the 1926 Women's World Games in Gothenburg. She won the gold medal in the shot put event ahead of Swedish Elsa Svensson and Polish Halina Konopacka. She won the bronze medal in the 4 × 110 yards relay together with Zdena Smolová, Štepánka Kucerová and Ludmila Sychrová. On 19 June 1927 she became the first Czech shot putter throwing over 10 metres (with one hand) with a distance of 10.24 metres. ==References== ==Other websites== *Vidláková at the 1926 Women's World Games *Vidláková (with number 4) at the 1926 Women's World Games Category:1904 births Category:Czechoslovak sportspeople Category:Hurdlers Category:Shot putters Category:Discus throwers Category:Javelin throwers Category:Tennis players Category:Handball players Category:1994 deaths Category:Sprinters Category:World record holders",
 "title": "Mária Vidláková"
}