{
 "id": "1134902",
 "text": "Jeremiah Thoronka, a student from Sierra Leone, is known for inventing a device that captures kinetic energy from moving traffic and pedestrians, turning it into clean power. In recognition of his inspiring work, he received both the Chegg.org Global Student Prize and the Global Teacher Prize in 2021. == Education & Career == Jeremiah Thoronka became a member of the founding class at the African Leadership University in Rwanda. There, he pursued a program called \"Global Challenge\", which was designed based on the Sustainable Development Goals (SDGs). Jeremiah Thoronka dedicated his efforts to climate action, energy, and innovation. He delved into both sociocultural and technical aspects of energy efficiency. Notably, Thoronka founded Optim Energy—a start-up that explored the use of piezoelectricity to generate clean and affordable energy for vulnerable communities. Additionally, Thoronka was selected to join the Climate Overshoot working on strategies to mitigate risks if the world surpasses its Paris climate commitments by 2030. Jeremiah Thoronka gained recognition for his efforts to establish sustainable energy solutions across Sierra Leone. Thoronka was listed among the 100 Most Influential Africans in 2021. The World Wildlife Fund recognized him as one of the 100 Young African Conservation Leaders. Thoronka was honored as the laureate of the inaugural Global Student Prize. He also received recognition for excellence in development work in Africa. == Contributions == At just 17 years old, Jeremiah Thoronka developed an impressive kinetic energy system while studying at the African Leadership University in Rwanda. His system captures vibrations from vehicles and pedestrians on roads. These captured vibrations are transformed into usable electric current. Unlike many other energy source, Thoronk's system doesn't rely on weather conditions or external factors, it doesn't need any batteries or an external electricity connection. Thoronka has even extended this technology to the healthcare sector. it can power medical equipment, including medicines and vaccines, and provide sufficient light for treating patients after dark. In a pilot program in Jeremiah's hometown of Makawo, his innovative technology successfully powered 150 homes and 15 schools. This provided essential services to over 10,000 people, including 9,000 Students. == Awards == • In 2021, Jeremiah Thoronka received the Global Student Prize from UNESCO. In the same year he won the Commonwealth Youth Awards for Excellence in Development. • Then, in 2023, he achieved the \"Youngest Green Awards\" at the 2023 Green Tech Festival in Germany. == References == Category:Inventors",
 "title": "Jeremiah Thoronka"
}