{
 "id": "1134728",
 "text": "The Jordan–Syria border is an international boundary that extends 362 kilometers (225 miles) from the tripoint with Israel in the west to the tripoint with Iraq in the east. It delineates the boundary between Jordan and Syria and is a significant geographic and political demarcation in the Middle East. == Description == The border begins at the tripoint with Israel, though its precise location is affected by the Israeli occupation of the Golan Heights, which Syria claims. The de jure tripoint is situated east of the Israeli town of Sha'ar HaGolan, while the de facto tripoint lies at the junction of the border with the United Nations UNDOF Zone south-east of Metzar. From the tripoint, the border follows the Yarmouk River for the westernmost section. It continues eastward, separating between Ar Ramtha and Daraa, passing through the Daraa Border Crossing and continuing along the Amman–Damascus road to the Nasib Border Crossing. The border then turns northeast across the Syrian Desert, reaching the Iraqi tripoint. == History == At the beginning of the 20th century, the Ottoman Empire controlled the region now known as Jordan and Syria. During World War I, the Arab Revolt, supported by Britain, led to the removal of Ottoman control from much of the Middle East. The 1916 Sykes–Picot Agreement divided the Ottoman Vilayet of Syria between France and Britain. France managed the northern part as the Mandate for Syria and the Lebanon, while Britain administered the southern part, which included modern Jordan. The Jordan–Syria border was established through the Paulet–Newcombe Agreement between France and Britain between 1920 and 1923, and a detailed description was agreed upon on October 31, 1931. In 1967, Israel occupied the Golan Heights during the Six-Day War, affecting the westernmost part of the border. The region has experienced various incidents, particularly since the onset of the Syrian Civil War in 2011. Jordan's last territorial dispute concerning the border was resolved in February 2005, when Jordan and Syria signed an agreement that ended over 30 years of controversy through a land-swap arrangement. == References == Category:Borders Category:Jordan Category:Syria",
 "title": "Jordan–Syria border"
}