{
 "id": "113410",
 "text": "The 1993–94 NHL season was the 77th regular season of the National Hockey League. Twenty-six teams each played 84 games. The New York Rangers were the Stanley Cup champions. It was the Rangers' fourth championship. In addition, the final game started the 1994 Stanley Cup riots in Downtown Vancouver. The play of Martin Brodeur of the New Jersey Devils and Dominik Hasek of the Buffalo Sabres brought in a new era of goaltending dominance in the NHL. Only three teams reached the 300-goal plateau, and only one team, the Detroit Red Wings, averaged more than four goals scored per game. Goaltenders combined for 99 shutouts during the regular season. ==Regular season== This was the first and only season (as of the 2007-08 season) that all 4 former WHA teams (Edmonton, Hartford, Quebec, Winnipeg) missed the playoffs since joining in 1979. ===Final standings=== Note: W = Wins, L = Losses, T = Ties, GF = Goals For, GA = Goals Against, Pts = Points ====Eastern Conference==== {| border=\"1\" cellpadding=\"3\" cellspacing=\"0\" class=\"wikitable\" Team GP W L T Pts GF GA y - Pittsburgh Penguins 84 44 27 13 101 299 285 x - Boston Bruins 84 42 29 13 97 289 252 x - Montreal Canadiens 84 41 29 14 96 283 248 x - Buffalo Sabres 84 43 32 9 95 282 218 Quebec Nordiques 84 34 42 8 76 277 292 Hartford Whalers 84 27 48 9 63 227 288 Ottawa Senators 84 14 61 9 37 201 397 ====Western Conference==== {| border=\"1\" cellpadding=\"3\" cellspacing=\"0\" class=\"wikitable\" Team GP W L T Pts GF GA y - Detroit Red Wings 84 46 30 8 100 356 275 x - Toronto Maple Leafs 84 43 29 12 98 280 243 x - Dallas Stars 84 42 29 13 97 286 265 x - St. Louis Blues 84 40 33 11 91 270 283 x - Chicago Blackhawks 84 39 36 9 87 254 240 Winnipeg Jets 84 24 51 9 57 245 344 Note: x = clinched playoff berth, y = clinched division title, z = won Presidents' Trophy ===Scoring leaders=== Player Team GP G A PTS Wayne Gretzky Los Angeles 81 38 92 130 Sergei Fedorov Detroit 82 56 64 120 Adam Oates Boston 77 32 80 112 Doug Gilmour Toronto 83 27 84 111 Jeremy Roenick Chicago 84 46 61 107 Pavel Bure Vancouver 74 60 47 107 Mark Recchi Philadelphia 84 40 67 107 Brendan Shanahan St. Louis 81 52 50 102 Jaromir Jagr Pittsburgh 80 32 67 99 Dave Andreychuk Toronto 83 53 46 99 ==Stanley Cup Playoffs== ===Playoff bracket=== ===Conference Quarterfinals=== ====Eastern Conference==== {| border=\"1\" cellpadding=\"3\" cellspacing=\"0\" class=\"wikitable\" Date Away Home OT April 17 NY Islanders 0 6 NY Rangers April 18 NY Islanders 0 6 NY Rangers April 21 NY Rangers 5 1 NY Islanders April 24 NY Rangers 5 2 NY Islanders NY Rangers wins series 4–0 {| border=\"1\" cellpadding=\"3\" cellspacing=\"0\" class=\"wikitable\" Date Away Home OT April 17 Buffalo 2 0 New Jersey April 19 Buffalo 1 2 New Jersey April 21 New Jersey 2 1 Buffalo April 23 New Jersey 3 5 Buffalo April 25 Buffalo 3 5 New Jersey April 27 New Jersey 0 1 Buffalo 4 OT April 29 Buffalo 1 2 New Jersey New Jersey wins series 4–3 ====Western Conference==== {| border=\"1\" cellpadding=\"3\" cellspacing=\"0\" class=\"wikitable\" Date Away Home OT April 18 San Jose 5 4 Detroit April 20 San Jose 0 4 Detroit April 22 Detroit 3 2 San Jose April 23 Detroit 3 4 San Jose April 26 Detroit 4 6 San Jose April 28 San Jose 1 7 Detroit April 30 San Jose 3 2 Detroit San Jose wins series 4–3 {| border=\"1\" cellpadding=\"3\" cellspacing=\"0\" class=\"wikitable\" Date Away Home OT April 18 Chicago 1 5 Toronto April 20 Chicago 0 1 Toronto OT April 22 Toronto 4 5 Chicago April 24 Toronto 3 4 Chicago OT April 26 Chicago 0 1 Toronto April 28 Toronto 1 0 Chicago Toronto wins series 4–2 ===Conference Semifinals=== {| border=\"1\" cellpadding=\"3\" cellspacing=\"0\" class=\"wikitable\" Date Away Home OT May 1 Washington 3 6 NY Rangers May 3 Washington 2 5 NY Rangers May 5 NY Rangers 3 0 Washington May 7 NY Rangers 2 4 Washington May 9 Washington 3 4 NY Rangers NY Rangers win series 4–1 {| border=\"1\" cellpadding=\"3\" cellspacing=\"0\" class=\"wikitable\" Date Away Home OT May 2 San Jose 3 2 Toronto May 4 San Jose 1 5 Toronto May 6 Toronto 2 5 San Jose May 8 Toronto 8 3 San Jose May 10 Toronto 2 5 San Jose May 12 San Jose 2 3 Toronto OT May 14 San Jose 2 4 Toronto Toronto wins series 4–3 ===Conference Finals=== {| border=\"1\" cellpadding=\"3\" cellspacing=\"0\" class=\"wikitable\" Date Away Home OT May 15 New Jersey 4 3 NY Rangers 2 OT May 17 New Jersey 0 4 NY Rangers May 19 NY Rangers 3 2 New Jersey 2 OT May 21 NY Rangers 1 3 New Jersey May 23 New Jersey 4 1 NY Rangers May 25 NY Rangers 4 2 New Jersey May 27 New Jersey 1 2 NY Rangers 2 OT NY Rangers wins series 4–3 and Prince of Wales Trophy ===Finals=== {| border=\"1\" cellpadding=\"3\" cellspacing=\"0\" class=\"wikitable\" Date Away Score Home Score OT May 31 Vancouver 3 New York 2 OT June 2 Vancouver 1 New York 3 June 4 New York 5 Vancouver 1 June 7 New York 4 Vancouver 2 June 9 Vancouver 6 New York 3 June 11 New York 1 Vancouver 4 June 14 Vancouver 2 New York 3 New York Rangers wins series 4–3 and Stanley Cup Brian Leetch (NY Rangers) wins Conn Smythe Trophy ==NHL Awards== The NHL Awards presentation took place on June 16, 1994. 1993–94 NHL Awards Presidents' Trophy: New York Rangers Prince of Wales Trophy: New York Rangers Clarence S. Campbell Bowl: Vancouver Canucks Art Ross Memorial Trophy: Wayne Gretzky, Los Angeles Kings Bill Masterton Memorial Trophy: Cam Neely, Boston Bruins Calder Memorial Trophy: Martin Brodeur, New Jersey Devils Conn Smythe Trophy: Brian Leetch, New York Rangers Frank J. Selke Trophy: Sergei Fedorov, Detroit Red Wings Hart Memorial Trophy: Sergei Fedorov, Detroit Red Wings Jack Adams Award: Jacques Lemaire, New Jersey Devils James Norris Memorial Trophy: Ray Bourque, Boston Bruins King Clancy Memorial Trophy: Adam Graves, New York Rangers Lady Byng Memorial Trophy: Wayne Gretzky, Los Angeles Kings Lester B. Pearson Award: Sergei Fedorov, Detroit Red Wings NHL Plus/Minus Award: Scott Stevens, New Jersey Devils Vezina Trophy: Dominik Hasek, Buffalo Sabres William M. Jennings Trophy: Dominik Hasek and Grant Fuhr, Buffalo Sabres Lester Patrick Trophy: Wayne Gretzky ===All-Star teams=== First Team Position Second Team Dominik Hasek, Buffalo Sabres G John Vanbiesbrouck, Florida Panthers Ray Bourque, Boston Bruins D Al MacInnis, Calgary Flames Scott Stevens, New Jersey Devils D Brian Leetch, New York Rangers Sergei Fedorov, Detroit Red Wings C Ron Francis, Pittsburgh Penguins Pavel Bure, Vancouver Canucks RW Cam Neely, Boston Bruins Brendan Shanahan, St. Louis Blues LW Adam Graves, New York Rangers ==First games== The following is a list of players of note who played their first NHL game in 1993–94 (listed with their first team, stars(*) mark start in playoffs): *Mariusz Czerkawski, Boston Bruins *Chris Osgood, Detroit Red Wings *Darren McCarty, Detroit Red Wings *Greg Johnson, Detroit Red Wings *Jason Arnott, Edmonton Oilers *Kirk Maltby, Edmonton Oilers *Rob Niedermayer, Florida Panthers *Chris Pronger, Hartford Whalers *Donald Brashear, Montreal Canadiens *Jason Smith, New Jersey Devils *Martin Brodeur, New Jersey Devils *Zigmund Palffy, New York Islanders *Mattias Norstrom, New York Rangers *Todd Marchant, New York Rangers *Alexandre Daigle, Ottawa Senators *Alexei Yashin, Ottawa Senators *Pavol Demitra, Ottawa Senators *Mikael Renberg, Philadelphia Flyers *Markus Naslund, Pittsburgh Penguins *Jocelyn Thibault, Quebec Nordiques *Ian Laperriere, St. Louis Blues *Chris Gratton, Tampa Bay Lightning *Yanic Perreault, Toronto Maple Leafs *Mike Peca, Vancouver Canucks *Jason Allison, Washington Capitals ==Last games== The following is a list of players of note that played their last game in the NHL in 1993–94 (listed with their last team): *Gordie Roberts, Boston Bruins *Dave Christian, Chicago Blackhawks *Michel Goulet, Chicago Blackhawks *Mike Foligno, Florida Panthers *Brian Propp, Hartford Whalers *Dave Taylor, Los Angeles Kings *Mark Hardy, Los Angeles Kings *Keith Acton, New York Islanders *Rob Ramage, Philadelphia Flyers *Bryan Trottier, Pittsburgh Penguins ==1994 Trading Deadline== * Trading Deadline: MARCH 21, 1994 http://www.habsinsideout.com/main/3969 *March 19, 1994: Donald Dufresne traded from Tampa Bay to Los Angeles for Los Angeles's 6th round pick in 1994 Entry Draft. *March 19, 1994: Jeff Daniels traded from Pittsburgh to Florida for Greg Hawgood. *March 19, 1994: Doug Zmolek and Mike Lalor traded from San Jose to Dallas for Ulf Dahlen. *March 21, 1994: Joe Juneau traded from Boston to Washington for Al Iafrate. *March 21, 1994: Craig Janney traded from Vancouver to St. Louis for Jeff Brown, Bret Hedican and Nathan Lafayette. *March 21, 1994: Jim Johnson traded from Dallas to Washington for Alan May and Washington's 7th round pick in 1995 Entry Draft. *March 21, 1994: Joe Reekie traded from Tampa Bay to Washington for Enrico Ciccone and Washington's 3rd round pick in 1994 Entry Draft and a conditional draft pick. *March 21, 1994: Steve Konroyd traded from Detroit to Ottawa for Daniel Berthiaume. *March 21, 1994: Phil Bourque traded from NY Rangers to Ottawa for future considerations. *March 21, 1994: Tony Amonte and the rights to Matt Oates traded from NY Rangers to Chicago for Stephane Matteau and Brian Noonan. *March 21, 1994: Peter Andersson traded from NY Rangers to Florida for future considerations. *March 21, 1994: Robert Dirk traded from Vancouver to Chicago for Chicago's 4th round pick in 1994 Entry Draft. *March 21, 1994: Mike Gartner traded from NY Rangers to Toronto for Glenn Anderson, the rights to Scott Malone and Toronto's 4th round pick in 1994 Entry Draft. *March 21, 1994: Craig MacTavish traded from Edmonton to NY Rangers for Todd Marchant. *March 21, 1994: Paul Ysebaert traded from Winnipeg to Chicago for Chicago's 3rd round pick in 1995 Entry Draft. *March 21, 1994: Alexei Kasatonov traded from Anaheim to St. Louis for Maxim Bets and St. Louis's 6th round pick in 1995 Entry Draft. *March 21, 1994: Mike Needham traded from Pittsburgh to Dallas for Jim McKenzie. *March 21, 1994: Kevin Todd traded from Chicago to Los Angeles for Los Angeles's 4th round pick in 1994 Entry Draft. *March 21, 1994: Pelle Eklund traded from Philadelphia to Dallas for future considerations. *March 21, 1994: Roy Mitchell and Reid Simpson traded from Dallas to New Jersey for future considerations. *March 21, 1994: Steve Passmore traded from Quebec to Edmonton for Brad Werenka. ===Complete List of Neutral-Site Games=== Date Score City Arena Attendance October 21, 1993 St. Louis Blues 5, San Jose Sharks 2 Sacramento, CA ARCO Arena 7,144 October 30, 1993 New York Rangers 4, New Jersey Devils 1 Halifax, N.S. Halifax Metro Centre 8,200 November 3, 1993 Pittsburgh Penguins 6, Buffalo Sabres 2 Sacramento, CA ARCO Arena 10,117 November 9, 1993 Mighty Ducks of Anaheim 4, Dallas Stars 2 Phoenix, AZ America West Arena 8,143 November 18, 1993 New York Islanders 5, Montréal Canadiens 1 Hamilton, ON Copps Coliseum 17,008 December 9, 1993 Dallas Stars 6, Ottawa Senators 1 Minneapolis, MN Target Center 14,058 December 23, 1993 Vancouver Canucks 4, Calgary Flames 3 Saskatoon, Sask. SaskPlace 11,429* December 31, 1993 Philadelphia Flyers 4, Boston Bruins 3 Minneapolis, MN Target Center 10,855 January 4, 1994 Tampa Bay Lightning 1, Toronto Maple Leafs 0 Hamilton, ON Copps Coliseum 17,526* January 5, 1994 Montréal Canadiens 2, Québec Nordiques 0 Phoenix, AZ America West Arena 11,393 January 6, 1994 St. Louis Blues 2, Hartford Whalers 1 Cleveland, OH Richfield Coliseum 6,956 January 16, 1994 Detroit Red Wings 6, Tampa Bay Lightning 3 Minneapolis, MN Target Center 8,764 January 23, 1994 Vancouver Canucks 5, Edmonton Oilers 4 (OT) Saskatoon, Sask. SaskPlace - January 24, 1994 Los Angeles Kings 3, Calgary Flames 3 (OT) Phoenix, AZ America West Arena 14,864 February 2, 1994 Washington Capitals 5, Philadelphia Flyers 2 Cleveland, OH Richfield Coliseum 8,312 February 8, 1994 San Jose Sharks 4, Chicago Blackhawks 3 Sacramento, CA ARCO Arena 14,182* February 22, 1994 Florida Panthers 3, Winnipeg Jets 2 Hamilton, ON Copps Coliseum 6,291 February 24, 1994 Detroit Red Wings 3, Hartford Whalers 0 Cleveland, OH Richfield Coliseum 11,621 March 4, 1994 Winnipeg Jets 6, Ottawa Senators 1 Minneapolis, MN Target Center 6,388 March 8, 1994 Chicago Blackhawks 3, Mighty Ducks of Anaheim 0 Phoenix, AZ America West Arena 13,847 March 9, 1994 New York Rangers 7, Washington Capitals 5 Halifax, N.S. Halifax Metro Centre 9,200* March 18, 1994 New York Islanders 2, Buffalo Sabres 2 Minneapolis, MN Target Center 8,016 March 23, 1994 Toronto Maple Leafs 1, Florida Panthers 1 (OT) Hamilton, ON Copps Coliseum 17,096* March 27, 1994 New Jersey Devils 5, Quebec Nordiques 2 Minneapolis, MN Target Center 6,222 April 3, 1994 Pittsburgh Penguins 6, Boston Bruins 2 Cleveland, OH Richfield Coliseum 17,224 April 3, 1994 Los Angeles Kings 6, Edmonton Oilers 1 Sacramento, CA ARCO Arena 10,363 ==Notes== ==References== ==Other websites== *Hockey Database *http://nhl.com/ Category:National Hockey League seasons",
 "title": "1993–94 NHL season"
}