{
 "id": "113432",
 "text": "Ladakh (\"land of high passes\") is a Union Territory in northern India. It is located between the Karakoram mountain range in the north and the main Himalayas to the south. Ladakh is well-known for its remote mountain scenery. It is inhabited by Tibetan people and Small Indo aryan population. Their language is an archaic dialect of the Tibetan language. It is sometimes called \"Little Tibet\", because it has been strongly influenced by Tibetan culture. Ladakh is one of the least populated regions in the area. Ladakh region borders Tibet to the east, Lahaul and Spiti to the south, and Kashmir, Jammu and Baltistan to the west. In the past, Ladakh was important for trade. It was where several important trade routes met. However, China closed the border with Tibet in the 1960s, and since then, international trade has suffered. Tourism is an exception, and it has been very important for Ladakh's economy since about 1974. Because the wider region is a part of the Kashmir conflict, the Indian military has a strong presence in Ladakh. The largest town in Ladakh is Leh. Ladakh's most population are followers of Shia Islam and rest majority is Buddhists which are 35%of population. Leh is followed by Kargil as the second largest town in Ladakh.Osada et al (2000), p. 298. Some Ladakhi activists have in recent times called for Ladakh to be made into a union territory because of its religious and cultural differences with Kashmir, which is mostly Muslim. Under Jammu and Kashmir Reorganisation Act, 2019 Ladakh was declared as a separate union territory. \\---- \\---- Districts/Divisions: Indian government accounced new 5 districts(Nubra,Sham, Changthang, Zanskar,Drass) in Ladakh U.T. Ladakh has 2 divisions and 7 districts. A.Leh division: 1.Changthang District - Nyoma,it has two tehsils:Durbuk and Nyoma 2.Sham District - Khaltsi,it has two tehsils:Likir and Khaltsi 3.Nubra District - Diskit 4.Leh District - Leh 4.Leh District - Leh,it has two tehsils:Leh and Karu B.Kargil Division: 5.Zanskar District - Padum 6.Drass District - Drass 7.Kargil District - Kargil ==Geography== Ladakh is a high plateau. Much of it is over 3,000 m (9,800 ft) above sea level. It spans the Himalayan and Karakoram mountain ranges and the upper Indus River valley. The Indus is the most important part of Ladakh for its people. Most major historical and current towns (Shey, Leh, Basgo and Tingmosgang) are located close to the Indus River. The stretch of the Indus flowing through Ladakh is the only part of this river in India, most of the river is in Pakistan. The river is sacred in Hindu religion and culture. ==People and culture== Like the land itself, the people of Ladakh are generally quite different from those of the rest of India. The faces and physique of the Ladakhis, and the clothes they wear, are more akin to those of Tibet and Baltistan than of India. The original population may have been Dards, an Indo- Aryan race down from the Indus and the Gilgit area About 46% are Buddhist by faith. Just over 47% are Muslim, and 6% are Hindu. Kargil District and Drass District is Muslim-majority and Leh, Changthang, Zanskar,Sham,Nubra District is Buddhist-majority within Ladakh. They traditionally lead a nomadic pastoral life. About 90% of them depend on agriculture based on the Indus River for their livelihood. Barley, wheat, buckwheat, peas, rapeseed and beans are the main agricultural products. Apples and apricots are grown in warmer regions of low altitude. Another occupation of the people is sheep-rearing. The herdsmen are called Chang-pas. They rear long-haired goats and sheep from whose under- fleece the famous Kashmiri Pashmina shawls are made. Chang-pas live in tents and are nomadic, going from place to place in search of pastures. The people are keenly interested in trade. Wool, in raw form is their chief commercial product. The men travel long distances, seeking favourable prices for their wares, which consist of salt, dry fruits and cultured pearls and semi-precious stones. In return they get tea, tobacco, grain, sugar and other essential goods. Playing polo on fast-racing ponies is the most popular entertainment in Ladakh, the game was introduced in Ladakh by the Balti emperor's of Makpon. The horse is not changed with each chukker (chukka) as in western style polo, but each player carries on with the same sturdy pony. Primitive wooden balls are still used for the game, played on a rough, uneven pitch whose popularity persists in Ladakh. Ladakh offers the hunters exotic hunts of the markhor, ibex, red bear, snow leopard, wild sheep, antelope, gazelle and marmot. Ladakh is also rich in minerals like gold, copper and semi-precious == Flora and fauna of Ladakh == Ladakh is also known as land of high passes in India. It has a greater diversity of animal and plants. Vegetation is extremely sparse in Ladakh except along streambeds and wetlands, on high slopes, and in irrigated places. The first European to study the wildlife of this region was Ferdinand Stoliczka, an Austrian-Czech palaeontologist, who carried out a massive expedition there in the 1870s. The fauna of Ladakh has much in common with that of Central Asia in general and that of the Tibetan Plateau in particular. Exceptions to this are the birds, many of which migrate from the warmer parts of India to spend the summer in Ladakh. For such an arid area, Ladakh has a great diversity of birds — a total of 225 species have been recorded. Many species of finches, robins, redstarts (like the black redstart), and the hoopoe are common in summer. The brown-headed gull is seen in summer on the river Indus and on some lakes of the Changthang. Resident water-birds include the brahminy duck also known as the ruddy sheldrake and the bar-headed goose. The black-necked crane, a rare species found scattered in the Tibetan plateau, is also found in parts of Ladakh. Other birds include the raven, Eurasian magpie, red-billed chough, Tibetan snowcock, and chukar. The lammergeier and the golden eagle are common raptors here specially in Changthang region. == History == At the Partition of India in 1949, the territory (then called Jammu and Kashmir) was split between India and Pakistan. India lost part of it to China as result of the Sino-Indian War, of 1962. ==References== Category:Jammu and Kashmir Category:Territorial disputes of India Category:Territorial disputes of China Category:Territorial disputes of Pakistan Category:Ladakh",
 "title": "Ladakh"
}