{
 "id": "1134970",
 "text": "Gupta–Hunnic Wars was a series of the wars between the Hunas (Hunnics) and the Gupta Empire. == Background == === Samudragupta's Āryāvarta campaigns === According to the Allahabad Pillar inscription, Samudragupta \"forcibly uprooted\" the following kings of Aryavarta, the northern region: Unlike the southern kings, the inscription does not mention the territories ruled by these kings, which suggests that their kingdoms were annexed to the Gupta empire. The inscription also mentions that Samudragupta defeated some other kings, but does not mention their names, presumably because the poet saw them as unimportant. === Rise of Kidara Kushans === The emergence of the Great Kushans in Bactria and Northwestern India during the first century A.D. transformed these regions into significant players in international politics. The Kushan empire posed a dual threat to the Parthians of Iran. Economically, the Kushans, like the Parthians, acted as intermediaries in trade. They controlled three crucial sections of the renowned Silk Road: firstly, the route connecting the Caspian and Euxine Seas; secondly, the path passing through Merv, Hecatompylos, and Ecbatana, crossing the Euphrates and reaching Mediterranean ports; and thirdly, the maritime route between India and the Red Sea, which gained immense importance after the discovery of monsoons. Consequently, they had the ability to redirect trade between China, India, and the eastern countries away from Parthian territory, posing a significant economic challenge to Parthian rulers. The political implications of the Kushans' rise as a major power were also profound for Iran. Instead of facing a single enemy in the West, Iran found itself sandwiched between the Roman Empire and the Kushans. The Romans, who were constantly engaged in rivalry and conflict with the Parthians, recognized the strategic importance of this empire and sought direct relations with its rulers to safeguard trade routes between Rome, China, and India. Caught between these two powers, the early Sasanians, who succeeded the Parthians as the imperial rulers of Iran in 224 A.D., made the conquest of the Kushan empire their primary objective in Eastern policy, and they achieved remarkable success in this endeavor. The first Sasanian emperor, Ardashir I (224-241 A.D.), conquered Kushan principalities to the north of the Hindukush. Although Kushan chiefs continued to govern these territories, they had to accept the overlordship of the Sasanian emperor. === Submission of Kidarites (Little Kushans) === The Kushan Empire continued as a remnant known as the \"Little Kushans\", based in the Punjab. Around 270 their territories on the Gangetic plain became independent under local dynasties such as the Yaudheyas. Then in the mid-4th century they were subjugated by the Gupta Empire under Samudragupta. In his inscription on the Allahabad pillar Samudragupta proclaims that the Dēvaputra-Shāhi-Shāhānushāhi (referring to the last Kushan rulers, being a deformation of the Kushan regnal titles Devaputra, Shao and Shaonanoshao: \"Son of God, King, King of Kings\") are now under his dominion, and that they were forced to \"self-surrender, offering (their own) daughters in marriage and a request for the administration of their own districts and provinces\".Lines 23-24 of the Allahabad pillar inscription of Samudragupta: \"Self-surrender, offering (their own) daughters in marriage and a request for the administration of their own districts and provinces through the Garuḍa badge, by the Dēvaputra-Shāhi-Shāhānushāhi and the Śaka lords and by (rulers) occupying all Island countries, such as Siṁhala and others.\" This suggests that by the time of the Allahabad inscription the Kushans still ruled in Punjab, but under the suzerainty of the Gupta Emperor. === North-western policy of Samudragupta === The reconstruction of Samudragupta's northwest policy mentioned earlier aligns with other intriguing facts. In 361 AD, an Indian delegation reportedly visited Rome, as stated by Roman historians. Despite having been dispatched from India earlier, the embassy did not reach Rome until 351 AD. Taking into account the political circumstances in India during the mid-4th century AD, this fact holds significant value. Before the year 361 AD, it was noted that the Roman emperors were engaged in a conflict with the Sassanids. Hence, it was not unexpected for Samudragupta to try to stop future conflicts with the Persian army on the Western Front by allying with Kidara I against Shahpur II. Hence, it is possible that he dispatched an embassy to Rome prior to 361 AD. Additionally, considering the political background of Bactria and north-west India described earlier, it is more probable that Kalidasa authored the Digvijaya story of Raghu using the real events resulting from Samudragupta's conquest, assuming great force. Kalidasa stated that Raghu conquered the Deccan's Trikutas before heading overland to conquer the Parasikas. Having emerged victorious over them, he went on to conquer the Hunas before launching an assault on the Kambojas. The Parasikas mentioned by Kalidasa are evidently related to the Sasanians. He mentioned that the Hunas resided by the Vankshu or Oxus river. During the third quarter of the fourth century AD, this was exactly the area where they resided. Ultimately, it may be concluded that the Kambojas of Raghuvamsa are likely to be the same as Kidara Kushans, as historical evidence shows that Kidara Inot only conquered Gandhara but also the five neighboring kingdoms, of course which were in Kambojas. === Gupta-Kidara alliance === The Kushan contemporary of Samudragupta, was Kidāra. He was initially a part of the Great Kushan family. It was after him that his individuals got to be celebrated as the small Kushans. Hence, it can be promptly conceded that he was known to his counterparts as a ruler of the Devaputra family. But he was not effective enough to utilize the title Shahanushahi. He was simply a Shahi. His coins bearing the legend 'Kidāra Kushāṇa Shāhi' proved it. Subsequently, he can be effectively recognized with Daivaputrashāhi of the Allahabad pillar inscription. Here it is curiously to note that opposite to the for the most part acknowledged see, within the Prayaga Prasasti the word Devaputra has not been utilized as a title, for the reality that it has been utilized in its taddhita shape not simply appears that it must be taken in conjunction with the another word 'Shāhi', it moreover demonstrates that the compound Daivaputrashahi would connote 'Shāhi, who had a place to (the family of) the Devaputras'. As respects Kidāra's contemporary Shahanushahi, he might have been no other than Shapur II, the Sassanian Shahanshah. On the premise of this proposal the course of history of Bactria and North-Western India may be reproduced as takes after: Kidara, after having set up himself in Gandhara, apparently at the cost of the Saka rulers, drew closer to Samudragupta a few times after 359 A. D., sent him presents and callings of steadfastness and inquired for his offer of assistance against the Sasanians. Samudragupta, on his part, was exceptionally much on edge to amplify his circle of impact past the central Punjab where his subordinate partners, the Gadaharas, were administering. He saw with uneasiness the tribal developments which were taking place in that heading and were posturing a risk to his recently established domain. But he was not a vanquisher, he was a statesman as well. He knew he possessed impediments and had the intelligence of restoring the prevailed rulers of the South. He needed to be included in a North-Western experience, indeed less. But, in any case, he was anxious to make the wildernesses of the domain and the western trade-routes secure and secure. He subsequently, did what was the most excellent; beneath the circumstances he concluded an alliance with Kidara and as the more grounded part of the association gave him an offer of assistance against Shapur II. His arrangement was prominently effective and Kidara vanquished the Sasanians twice in 367-68 A. D. It may not suggest that Shapur II got to be a vassal of Kidara or Samudragupta. But it does indicate that the articulation of Harishena about the connection of his master with the Sasanian ruler ought to not be suggested as through and through altogether without foundation. === First Hephthalite invasion === Kidara, thereafter the year 367-68 A. D., likely in c. 370 A. D. had to bargain with the attack of the Jouan-Jouan or Hiung-nu or the White Huns from Bactria or Valhika. He put his son within the charge of his capital and went towards west to meet the intruders. This time too, Samudragupta shows up to have given considerable assistance to his Kushan ally. As a matter of truth, the victory of Kidara against the Hunas, whom he seem not check prior when he was in Bactria, demonstrates that this time he had an effective partner on his side. In this way, a fruitful endeavor by the Gupta sovereign in c. 370 A. D. against the Valhikas 'across the seven mouths of the river Indus' gets to be a really solid plausibility. It is one of the reasons which have driven us to hypothesize the identicality of the lord 'Chandra' with Samudragupta. It may, in any case, be recollected that the history of Bactria and the North-Western India as laid out over does not depend upon the recognizable proof of Samudragupta with the ruler of the Meharauli inscription. For example, in case we are to incline toward the hypothesis of the distinguishing proof of Chandragupta II with the ruler of this record, we can assume that it was Chandragupta, the offspring of Samudragupta, was the one sent as the pioneer of this expedition. === Geographical factors in North-western policy === The general station of the ancient conglomerate-builders of the Ganga Valley towards the North-West was conditioned by the interplay of several factors. Geographically, the Indus valley is the western of cornucopia of what may be called the Fertile Crescent of India, and gives the print that it's nearly connected with the Ganga Valley. But there's another side of this picture also. It may be noted and needs to be emphasized that the Indus river-system is not only unconnected with any other river of North India, but it's indeed separated from the rest of the country by the vast desert of Thar. The stretch of the home which connects it with the Ganga Valley viz. The Thanesar-Delhi-Kurukshetra division–roughly the ancient realm of the Kuru Kingdom-is veritably narrow and communication through it was rendered delicate in the ancient times by the great timbers, similar as the Khandava, Kāmākhyā, Kurujāngala and Dvaitavana and also by a large number of small gutters. These walls, it seems, rendered the subjection of the Indus receptacle by the powers of the Ganga Valley relatively delicate and made these two regions to appear more distant and remote from each other than they actually were. It's a literal fact that with the exception of the Mauryas, nearly all the conglomerate-builders of the Ganga Valley the Nandas, the Sungas, the Nagas, the Guptas and indeed the Vardhanas noway seriously tried to conquer the region to the west of the Divide. It doesn't mean that they noway took any interest in the political fortunes of the Indus receptacle; they couldn't go to neglect it altogether. piecemeal from the fact that this region also belonged to the larger Indian world and, thus, the achievement of universal sovereignty (chakravartitra) was regarded as deficient without establishing some kind of suzerainty over it, they could hardly forget that utmost of the routes of the Indian trade with the Western countries were controlled by the North-Western powers. Above all, the nearly constant affluence via the Indus receptacle of Central and Western Asiatic peoples who relatively constantly hovered the security of the antarvedi itself, impelled them to take note of the political developments in the Indus receptacle. But these lodestones weren't sufficient enough to bait them to take over wars of subjection in that region. The Vardhanas, though a power of Thanesar, were interested in it only to the extent of transferring occasional peregrinations against the Hunas; the Sungas communicated some interest only when they were hovered by the Bactrian Greeks; indeed the Mauryan subjection of this region was maybe the result of the fact that Chandragupta Maurya started his political career there and the irruptions of Alexander and Seleucus had rendered its objectification in the conglomerate necessary. In the early mediaeval period also, the Rajput autocrats of the Ganga receptacle generally communicated interest in the politics of the Indus Valley states only when they were themselves hovered by the raiders coming from that direction. Prithviraja III, the Chahamanas of Shakambhari king of Delhi, for illustration, took no notice of the expansion of the Ghurid area in the Punjab till his own security was hovered and indeed after achieving palm in the first battle of Tarain he took no suitable way to oust the Muslims from the Punjab; he was putatively more interested in the politics of the antarvedi. In the light of the below discussion, the station of the Guptas towards the Indus Valley becomes comprehensible, though not justified. But whatever the causes, the fact remains that the first four generations of the Gupta emperors didn't take any way whatsoever to guard the north-western borders of the conglomerate. How strong were the roots of their cerebral incuriosity towards the North West, becomes clear by the fact that Skandagupta himself, who had to taste the bitter fruits of the idiocy of his forerunners, did nothing to amend it by taking measures against the possible rush of the Huna irruption. The Hunas now appear for the alternate time in Indian history, their first irruption being the bone which the king 'Chandra' met across the seven mouths of the swash Indus'. Their consecutive irruptions against the Gupta conglomerate present a veritably intriguing pattern of their growing power vis-a-vis the adding failure of the Guptas to stem their advance in the country. During the ending times of the reign of Samudragupta, the Hunas succeeded in enwrapping Bactria and expelling the Kidara Kushans from there. But veritably soon the Guptas took obnoxious and the king 'Chandra' led a successful passage against them. In their alternate attempt, which took place in the original times of the reign of Skandagupta, these invaders shook the foundations of the conglomerate, though ever Skandagupta eventually succeeded in checking the drift of their progress. In their third irruption, still, which they launched in the first decade of the sixth century, the Hunas were eminently successful, for, also they not only enthralled the antarvedi, the heart of the conglomerate, but also reduced the Gupta emperor to the status of their vassal. === India and Central Asia === The Hunas, led by Attila until his death in 453 A.D., posed a considerable threat to contemporary civilizations, challenging the courts of Ravenna and Constantinople and causing devastation from the Indus to the Danube. Despite their aggression, Skandagupta's leadership and military strategy enabled him to resist their advances. Gupta Kings. Skandagupta. AD 455-467.jpg | Coin of Skandagupta (455-467), in the style of the Western Satraps.\"Evidence of the conquest of Saurastra during the reign of Chandragupta II is to be seen in his rare silver coins which are more directly imitated from those of the Western Satraps... they retain some traces of the old inscriptions in Greek characters, while on the reverse, they substitute the Gupta type ... for the chaitya with crescent and star.\" in Rapson \"A catalogue of Indian coins in the British Museum. The Andhras etc.\", p.cli Skandagupta Kramaditya Circa 455-467 CE.jpg | Coin of Skandagupta Kramaditya with facing Garuda. File:Gold dinar of Skandagupta.jpg|Gold dinar of Skandagupta. India's geographical barriers shielded it from the full impact of racial and cultural currents originating in Western and Central Asia. While Iran bore the brunt of continuous Huna incursions, India faced comparatively weaker and intermittent invasions. Skandagupta's success exemplifies this pattern, with the Gupta Empire enduring less severe impacts compared to Iran. Skandagupta's victory against the Hunas, while notable, should be viewed within its proper historical context. It occurred amidst a backdrop of other challenges to the empire's stability, highlighting the complexity of the political landscape during his reign. Skandagupta's achievement in repelling the Hunas underscores his effectiveness as a leader and military strategist. However, it is essential to avoid overestimating its significance in the broader context of Gupta history, recognizing the multitude of factors at play during that time. === Route of the Huna invasion === Several scholars hypothesize that the Hunas entered India via the Bolan Pass, with Surashtra and Malwa being the initial regions to face their aggression. It's noted that Arab chroniclers equated Zabulistan, interpreted as 'the land of Zabuls', with a portion of modern Afghanistan, potentially inhabited by the Hunas. The Kura inscription of Toramana refers to him as Shahi Jauvla, with variants like Jaubla, Jabubla, and Jabula found on his silver coins, while Hephthalite coins mention it as Zabol. Inscriptions of Mihirakula in Afghanistan support the notion of a Huna settlement in Zabulistan. Despite these connections, it's debated whether the Hunas responsible for naming Zabulistan were the same ones invading India in the mid-fifth century AD. Scholars disagree on the extent of damage caused by the Huna invasion. McGovern suggests a series of defeats leading to near-total destruction of the Gupta empire, while R. D. Banerji posits Skandagupta's demise while resisting a significant Huna incursion. Smith also supports renewed Huna invasions during Skandagupta's later rule, leading to his eventual defeat. However, Bindeshwari Prasad Sinha argues against the belief in repeated and successful Huna invasions during Skandagupta's reign. The theory of multiple invasions is anchored in numismatic evidence, specifically the debasement of heavier coins attributed to Skandagupta's later reign, allegedly due to Huna invasions. Yet, this hypothesis has been refuted, as the heavier coins show no higher percentage of alloy compared to lighter varieties. == Chandragupta II's Expeditions == === Battle of Begram === References to Kāpiši wine persist in literary works like Dhanapala's Tilakamanjari, describing it as a favored royal beverage with a reddish hue akin to a woman's eyes filled with resentment or the petals of a red lotus. Archaeological findings at Begram reveal ceramic motifs illustrating wine production, featuring jars, vines, grape bunches, and birds, reminiscent of Pompeii's artistry. Additionally, plaster medallions depict symmetrical arches formed by grape leaves and bunches, indicating Begram's historical significance as a grape-growing hub and wine production center. Recent archaeological endeavors uncovered a sizable wine cellar in Nisa, the former Parthian capital near modern-day Ashkabad, containing nearly 200,000 liters of wine stored in clay pitchers. Inscriptions on broken pieces of pitchers suggest wine distribution to significant establishments like Nisa's prominent slave-owning palace and temple. The mention of grape wine in the Raghuvamsa underscores the poet's geographical awareness of Kapisi's significance along land routes during Raghu's Persian campaign. After having crossed swords with the Yavanas. Raghu (Chandragupta II) fought a battle against the Parasikas (Persians) somewhere at the valley of Kāpiśi. === Battle of Sistan and the Submission of Varahran === After the (Persian) Sasanians suffered defeat in the battle of Sistan, which demorilzed the Persian contingents in present day Afghanistan. As the Gupta Army marched northwards to Kapisa Province, Varahran was quick to grasp the political realities and offered his submission to the Gupta Emperor Chandragupta II. === Gupta cavalry's arrival by the Oxus river === Bactria was under the Huna occupation in the last quarter of the fourth century AD. The sudden attack into the Oxus valley caught the Transoxiana alliance off-guard. The Pamir Mountains Tocharians were unable to combine with the Hunas (Hephtalites). On hearing the news of the Gupta Empire advanced, the Hephtalites resorted to a tactical retreat to the north of the Oxus River into the plains of southern Uzbekistan. When the Gupta cavalry arrived by the Oxus river on the southern banks, they camped there. Kalidasa poetically described how the cavalry camped on the banks of the river Vankshu in the midst of saffron fields in a verse of his Raghuvamsa: Historians studied this as a description of the Gupta cavalry camping on the banks of the Oxus during Chandragupta II's expedition. === Kidara's conquest of Gandhara 356 CE and the Battle of the Oxus 399 CE === Kidara I (Late Brahmi script: Ki-da-ra; fl. 350-390 CE) was the first major ruler of the Kidarite Kingdom, which replaced the Indo-Sasanians in northwestern India, in the areas of Kushanshahr, Gandhara, Kashmir and Punjab.History of Civilizations of Central Asia, Ahmad Hasan Dani, B. A. Litvinsky, Unesco p.38 sq However, Altekar suggests that Candragupta II attacked the Kidara Kushans. But in the situation also prevailing it isn't insolvable that Chandragupta really raided Balkh or Bactria appertained to as Bahlikas in the inscription. We already saw that Bactria was enthralled by the Hepthalites in about 350 A.D. (Kalidasa refers to the Hunas on the Oxus) and therefore had led to the eventual subjection of Gandhara by Kidara by 356 A.D., the contemporary (Daivaputrashātā of Samudragupta). After Kidara, his successors were known as little Yue-chi. As we have seen Samudragupta was satisfied with the offer of submission of Kidara, and he also claims to have entered the submission of Shāhānushāhī (the Sasanian emperor), substantially to consolidate his vanquishing in the country, and to have some share and control over the renowned Silk-route. The Hunas in Bactria were not a peaceful community and because they posed peril to both Iran and India, and they might have tried to pursue Kidara or his successors in Gandhara, and Fa-hsien refers to Hepthalite king trying to remove Buddha's coliseum from Purushapur. This may indicate Huna invasion in Gandhara some time before Fa-hsien concluded his peregrination in India. It is said that Kidara towards the end of the 4th century had to go northwestwards against the Hunas, leaving his son Piro at Peshawar. It's possible that Kidara might have gained some help from the Gupta emperor. It is thus possible that Chandragupta II led an adventure to Bactria through Gandhara against the Hunas, and this may be appertained to as his crossing of the seven rivers of Sindhu and conquering Bahlika in the Mehrauli Pillar Inscription. This event may be placed towards the end of the 4th century A.D. Chandragupta II's Bactrian expedition also led to the battle of the Oxus with his Gupta cavalry against the Hunas, who were defeated and the Gupta emperor having planted the Gupta flag on the banks of the river of Oxus. == The Imperial crisis == === Gupta interregnum === One of the topmost problems, which the Guptas, had to face in those times of excited conditioning, was the problem of race. At that time there were several ambitious tycoons in the Homeric family. Skandagupta and Purugupta were two of them. also, there was Ghatotkachagupta presumably also a son of Kumaragupta I. According to the law of royal race, which the ancient Indian autocrats generally followed, the eldest son of Kumaragupta I should have succeeded him. But so far, the Guptas had shown spare respect to this principle. It's also not clear whether they regarded the first son sired on the senior-most queen or the eldest son, indeed if he happed to be the son of an inferior queen, as the licit descendant . maybe they hadn't bothered themselves to evolve a specific rule on this point. As regards the Hindu law books, it's nowhere laid down that the son of the principal-queen alone should succeed to the throne. In the early days of the conglomerate the nomination by the ruling autonomous was the most important factor. Chandragupta I had nominated Samudragupta as his successor and the ultimate, in his turn, presumably expressed his preference for his young son Chandragupta II, over and above the claim of Ramagupta, the elder brother of Chandragupta II. It is not beyond the realm of possibility that towards the close of his reign, Kumaragupta I also expressed his preference for his valliant son Skandagupta, though the evidence on this point is rather inconclusive. In this connection the Apratigha type of coins of the former furnish veritably intriguing substantiation. On the obverse of these issues we have three numbers. The central bone is really Kumaragupta I since he is expressly labelled as similar. He is shown wearing a dhoti. His hands are folded at midriff and he wears no jewelry on his person. He is adjoined on his right by a woman with her right hand bent up and raised in the station of ritarka (argumentation) and on his left by a joker, his left hand holding a guard and the right in the vitarka mudrā. According to Altekar, in this scene the emperor Kumaragupta I is shown as meaning repudiation and his queen and crown-prince are trying to inhibit him without success. The suggestion is relatively intriguing, though it is good to note that as these coins were issued during the reign of Kumaragupta I himself, he supposedly had not renounced his Homeric status altogether. To us it appears that in the ending times of his reign, Kumaragupta I entrusted the government of the conglomerate in the hands of his crown-prince and himself retired to lead a life of religious pursuits. Maybe commodity like this was behind the tradition recorded in the Kathasaritsagara according to which Mahendrāditya, generally linked with Kumaragupta I, nominated his son Vikramaditya who had succeeded in inflicting a crushing defeat on the Mlechchhas as his successor and himself retired to Varanasi. According to the Buddhist work Chandragarbbapaṛiprichchhā also, the king Mahendrasena, identified with Kumaragupta I by K.P. Jayaswal, culminated his son Duprasahahasta, the whipper of the Yavanas, Palhikas and Sakunas as his successor and himself retired to lead religious life. therefore, from the combined evidence of the Apratigha type of coins and the erudite tradition it appears that in his old age Kumaragupta I came virtually a isolate and the responsibility of administering his vast conglomerate regressed upon the shoulders of one of his sons. The prince who was named for this favour was supposedly no other than Skandagupta, for, the Kathisarilsigara refers to him by the name of Vikramaditya, one of the titles espoused by Skandagupta, and gives him the credit of conquering the Mlechchhas, an achievement for which Skandagupta was regarded as the unique hero of the Gupta dynasty. Numerous scholars, still believe that Skandagupta had no licit right to the throne and Kumaragupta I, indeed if he'd all his affections reserved for the former couldn't give his throne to him. But the arguments cited in support of this proposition aren't conclusive. The view that the expression talpādānadhyāta was reflective of legal right to the throne and accordingly its elision in the Bhitari necrology for Skandagupta suggests that his claim was not licit, is not correct. The expression didn't have any indigenous significance. It was used indeed by the feudatory autocrats to express their fidelity towards their overlord. It is also relatively possible that as the author of the Bhitari record switched over from prose to verse at the place where the expression tatpādānadhyāta was to be used for Skandagupta to describe his devotion to his father, he gave its lyrical interpretation pitṛiparigatapādapadmavarti. P.L. Gupta remarks that this expression does not convey the sense that Skandagupta was the favourite of Kumaragupta I; it rather reflects his own anxiety to show that he was veritably important devoted to his father. But does not the expression tatpādānudhyāta also suggest the same idea–the devotion of the sovereign for which it was used for his precursor? It should also not be forgotten that in the Bhitari record the expression tatpādanadhyāta has been used neither for Ghatotkacha and nor for Chandragupta I and Samudragupta. Would it mean that none of these autocrats was the licit successor of his father? As regards the status of the mother of Skandagupta, the elision of her name in the genealogical portion of the Bhitari record does not inescapably prove that she was not a Mahādevi. As refocused out by Raychaudhuri, the names of the maters of the lords were occasionally neglected in the ordinary pratastis, however in the royal seals they were always appertained indeed if it meant reiteration. In the genealogical portion of the Madhuban and Banskhera plates, the name of Yaśomati as Harsha's mother is not mentioned, but in the Sonepat and Nalanda seals she is mentioned both as the mother of Rajyavardhana and as the mother of Harsha. The view that the mother of Skandagupta was a doxy of Kumaragupta I and not a full-fledged queen, and that Skandagupta was ashamed of her status is altogether unwarranted. Skandagupta refers to her veritably proudly in the verse 6 of the Bhitari record. The change-over from prose to verse incontinently after the name of Kumaragupta I, which redounded in the lyrical picture of the expression tatpādānadhyāta was maybe also the cause of the elision of her name in the genealogical portion of this record. Actually, so far as the struggle for the throne among the sons of Kumaragupta I is concerned, the question of the legality of Skandagupta is hardly applicable. For, indeed if he was not entitled to inherit the conglomerate, he could raise the banner of rebellion against the licit descendant and could win the preceding struggle. still, as yet there is nothing to show that his claim was less justified than that of other contenders. He was putatively devoted to and had the blessings of his father–a fact which is also suggested by the installation by him of an image of Sārngin in the memory of Kumaragupta I. It also needs no arguments to prove that he must have been the darling of the Homeric army. His consecutive military palms suggest it veritably explosively. But his rivals were not exactly helpless. Take, for illustration, Purugupta. In the Bhitari seal of Kumaragupta II he's described as begotten on the Mahadevi Anantadevi. Now, from the Bihar gravestone pillar necrology we learn that Kumaragupta I had married the family of his minister Anantasena. As in that period sisters were generally named after their sisters, it is nearly insolvable not to imagine that the queen Anantadevi was the family of Anantasena, the Homeric minister. However, it may be fluently conceded that Purugupta had an important section of ministers to support his candidature. If it was so. Then it may so be noted that after having consolidated his position as the new emperor, Skandagupta was obliged to appoint new 'pro-tectors' in all the businesses'. It may indicate that in some of the Homeric businesses his accession to the throne was opposed by the advanced officer-class. It is relatively possible that other contenders similar as Ghatotkachagupta, who had been the governor of the eastern Malwa, reckoned substantially on similar original support. therefore, it appears that during the last times of the reign of Kumaragupta I pulls from colorful directions sought to impact the question of race the emperor and the army favoured Skandagupta, the queen Anantadevi and an important clerical party supported the cause of Purugupta and in some businesses original officers stoned the ambition of tycoons similar as Ghatotkachgupta. In such a condition, dominated by factional power- polities, a close contest for the throne was but ineluctable. Fortunately for the conglomerate, Skandagupta, the unique hero of the Gupta dynasty, who had the blessings of his father and the support of the Homeric army on his side surfaced victorious in it. His rise gave a farther parcel of life to the conglomerate the palm of a weaker seeker would have quickened the pace of decomposition. === Pushyamitra invasion === Some of the troubles of Skandagupta were the result of the programs followed during the after times of the reign of Kumaragupta I. As we have seen, Kumaragupta I had launched a vigorous crusade against his Vakataka relations eventually towards the concluding period of his reign which coincided with the early times of the reign of Narendrasena (c. 440-60 A.D.), the son and successor of Pravarasena II. In this adventure, the Guptas had an important inferior supporter in the Nala king Bhavattavarman. But from the Vakataka records, it appears that Narendrasena veritably soon succeeded in reacquiring the fallen fortunes of his family. In this attempt, he was mainly helped by his Kadamba dynasty relations; else one can not explain why Prithvishena II, the son of Narendrasena, should have mentioned his maternal forefather in the line of his family. therefore, in the middle of the fifth century A.D. two power-blocks-one conforming of the Guptas and the Nalas and the other comprising the Vakatakas and the Kadambas crystallized, and dominated the politics of the Deccan. Against this background the irruption of the Pushyamitras, mentioned in the Bhitari record, assumes a new significance. The identification and position of the home of the Pushyamitras of the Bhitari record have been largely controversial issues. But now it's generally honored that they belonged to the Mekala region. In the Vishnupurana MSS consulted by Wilson it's stated that the Pushpamitra (according to Wilson a variation of Pushyamitra), Patumitra and others, to the number of thirteen, will rule over Mekala. opining on this statement Wilson says\" it seems most correct to separate the thirteen sons or families of the Vindhya queen( sic.) from these Bahlikas, and them from the Pushpamitras and Patumitras, who governed Mekala, a country on the Narmada. A statement of analogous import is set up in the Vaynpurana which is generally regarded as one of the oldest and the most dependable of Purana textbooks. It was on the base of this substantiation that Fleet and numerous others have located the Pushyamitras of the Bhitari record 'in central India nearly in the country along the banks of the Narmada'. Some scholars have expressed mistrustfulness about this suggestion, but the recent epigraphic discoveries haven't only given fresh support to his proposition but have also thrown a new light on the alignment of powers in this area. The most important of these documents is a bobby plate entitlement of the Pandavavarṁśi king Bharatabala alias Indra, discovered at Bamhani in Sohagpur tahsil of Rewa district in Baghelkhand. It records the entitlement of the village Vardhamanaka positioned in the Panchagarta Vishaya of Mekala to Lohita, a Brahmana of Vatsa gotra. Palaeographically, it has been credited to the middle of the fifth century A.D. by Chhabras and Mirashi. Accordingly, the origin of the Pandava family mentioned in it may be placed in the last quarter of the fourth century A.D. It is true that in this record Jayabala and Vatstāja, the first two members of the family, have no royal title prefixed to their names, but it was maybe due to the fact that their description occurs in verse; the coming two lords are described both in prose and verse. In any case, it appears certain that the early autocrats of this family were the feudatories of the Guptas. It is relatively possible that during the re-organisation of Baghelkhand, Samudragupta gave an arena of Jayabala, the first member of this family. But the situation changed during the reign of Bharatabala. He is said to have married Lokaprakāśā, the queen of Kosalā. She was presumably the son of the Sura king Bhimsena I who, according to Mirashi, was the contemporary of Bharatabala. In the 11th verse of the Bahmani record, Bharatabala makes a veiled reference to a certain Narendra, who appears to have been his suzerain. Chhabra and Mirashi identify this Narendra with Narendrasena, the contemporary Vakataka sovereign . It is not at each insolvable, for, from the Balaghat plates of Prithvisheņa II(c. 460- 80A.D.), the son and successor of Narendrasena, we learn that the cominands of the ultimate were fete by the autocrats of Kosala, Mekalā and Malavā. therefore, the combined evidence of the Bamhani and the Balaghat plates prove it nearly conclusively that eventually in the middle of the fifth centuryA.D. the sovereign of Mekala transferred his constancy from the Guptas to the Vakatakas. From what we know about the history of the contemporary period, it's insolvable not to suggest that it must have happed either towards the close of the reign of Kumāragupta I or in the carly times of the reign of Skandagupta. It appears that as a response against the aggressive policy of the Guptas, which led to the occupation of the Vakataka capital Nandivardhana by Bhavattavarman, the Nala supporter of the Guptas, the Vakataka sovereign Narendrasena, soon after recovering the lost ground, launched an descent against the Guptas when their conglomerate was passing through a period of grave extremity. The Pandava sovereign Bharatabala of Mekalā readily transferred his constancy to him. Studied against this background, the statement of the Bhitari record that Skandagupta conquered \"the Pushyamitras, who had developed great power and wealth, (and) he placed (his) left foot on a foot-stool which was the king (of that lineage himself)\" becomes significant. It's impeccably in consonance with what we know of the history of the Mekala region to which the Pushyamitras belonged. supposedly, Pushyamitras king of the Bhitari record was no other than the Pandava sovereign of Mekala, the inferior supporter of Narendrasena Vakataka and his irruption on the Gupta conglomerate, obviously with the help of the Vakataka sovereign , was a part of the general descent which Narendrasena had launched against the Guptas. === The Second Huna invasion === During Skandagupta's period, the Indo-Hephthalites (known as the White Huns or Hunas) invaded India from the northwest, advancing as far as the Indus River. ==== Battle of the Indus river (458 A.D.) ==== During the Hun invasion, a battle along the Indus river took place which resulted in Skandagupta checking the advances of the Huns with them facing heavy losses. The Bhitari pillar inscription states that Skandagupta defeated the Hunas: ==== Victory against the invaders ==== The date of the Huna invasion is not certain. The Bhitari inscription mentions it after describing the conflict with the Pushyamitras (or the Yudhyamitras), which suggests that it happened later during Skandagupta's reign. However, a possible reference to this conflict in the Junagadh inscription suggests that it may have happened at the beginning of the Skandagupta's reign or during the reign of his father Kumaragupta. The Junagadh inscription, dated to the year 138 of the Gupta era (c. 457–458 CE) mentions Skandagupta's success against the invaders: The victory against the invaders happened in or before the year 136 of the Gupta era (-456 CE), when Skandagupta ascended the throne and when he appointed Parnadatta as the governor of the Saurashtra region, in which Junagadh is located. Since Skandagupta is not known to have fought against any other foreigners, these invaders were probably the Hunas. If this identification is correct, it is possible that as a prince, Skandagupta was sent to check the Huna invasion at the frontier, and Kumaragupta died in the capital while this conflict was happening; Skandagupta returned to the capital and overcame rebels or rival claimants to ascend the throne. A sentence in the Sanskrit text Chandra-Vyakarana () states Ajayad-Gupto Hunan, literally, \"The Gupta conquered the Hunas\". This may be a reference to Skandagupta's victory over the Hunas, although an alternative reading by scholar K. P. Jayaswal has \"Jato\" instead of \"Gupto\". A story in the Kathasaritsagara (11th century) states that the legendary king Vikramaditya ascended the throne after his father Mahendraditya abdicated it, and inflicted a crushing defeat on the invaders. Since Mahendraditya was a title of Kumaragupta, and Vikramaditya that of Skandagupta, this may be a reference to Skandagupta's victory over the Hunas. Mahendraditya was the title of Kumaragupta, in fact it seems that he sent his army under Skandagupta to check the progress of the invaders (which included the hoardes of the Hunas/Hepthalites, Persians/Sasanians and Kidarites/Kushanas) who invaded the northwestern frontiers and territory of the Gupta Empire, eventually, the wars and invasion were repelled by Skandagupta.Line 12 of the Bhitari pillar inscription of Skandagupta : \"Who, when (his) father had attained the skies, conquered (his) enemies by the strength of (his) arm, and established again the ruined fortunes of (his) lineage; and then, crying \"the victory has been achieved\" betook himself to (his) mother, whose eyes were full of tears from joy, just as Krishna, when he had slain (his) enemies, betook himself to (his mother) Dêvakî\" == The Huna Volkerwanderung == The term post-Indic Völkerwanderung was first coined by an English historian Arnold J. Toynbee in the context when Gupta Empire was quivered to its roots. Considering that their earlier invasions had been repulsed by Chandragupta II and Skandagupta but the continuous incursions weakened the empire and trembled its internal affairs so well that they reduced them to a mere vassalage of the Hunas. If we look to the archaic and mediaeval periods of Indian history, the greatest compulsion to which the empires of the Ganga Valley were openly faced, came from the North-Western gates of Indian subcontinent. As indicated, the Indus basin was an area of great allurement for the Central and Western Asiatic hordes, who never missed any opportunity to exploit the weakened Gangetic empires. For instance, the fall of the Maurya Empire was associated with the successive invasions into the hinterland of the empire made by Bactrians, and the Indo-Greeks. Although some gangetic empires endeavoured to impede these foreign aggression, For example, The Shungas halted the Indo Greek invasions but they could not retain the old glory of Chandragupta Maurya, which further resulted in a successive foreign invasions by Sakas, Kushan and Hunnic hordes. The onslaught of the Hunas adhered the uniform geographical pattern which had been abided by the Indo-Greeks in the post-Maurya era and was to be adhered to by the Turkic peoples in the medieval dates. Like the Indo-Greeks and the Turkic peoples, the Hunas first amalgamated their power in the Punjab. After the setback endured at the hands of Skandagupta they had afresh turned the spotlight on Persia. When they made incursions in 456 A. D. we find Yazdegird II relentless brawl against them. After his death in 457 A. D., Phiroz became the emperor of the Sassanian empire, but the Hephthalite king Akhshunwar thwarted him and coercive him to pay tribute. In 484 A. D. Phiroz ventured a campaign against the Hephthalites, but was defeated and killed. According to Chavannes it visible that in c. 500 A. D. the Hunnic empire was Tokharistan, Kabulistan and Zabulistan region but no territories of India were properly amalgamated except Gandhara and Chitral, which were the north-western fringes of the Indian subcontinent. As Sung-Yun tells us: It is evident by the statement of Sung-Yun that extended up to Gandhar at least two generations before his visit to Gandhar in c. 520 A.D. Though it's unknown under whom leadership that these hunas conquered Gandhar but according to S.R Goyal, it is likely to be Rāmāṇila who subjugated Gandhar whose successor was Toramana. Later came Toramana who amalgamated hunnic hordes in Punjab and further extended hunnic power up to Punjab. After consolidating in Punjab he launched a successive expedition in the Gupta domains when the empire was trembled by the internal strife as many emperors were getting either murdered or sidelined by tributary states. For instance a Jain work composed in 778 CE tells us that: Moreover, it tells that Harigupta who claimed to be a scion of the Gupta family was the instructor of Toramāṇa. Devagupta, a pupul of Harigupta is said to have a Rājarishi (Royal sage), the copper coins of Rasool Nagar and Panchala reaffirms the certainty of Harigupta. Recent discoveries of the two seals of Toramāṇa from Kaushambhi states that he reached at least up to Kaushambhi. S.R. Goyal agrees with this conjecture and is given a factual reasons for it, from the ancient periods of Indian history the invaders from north-west were always swept down up to Ganga valley and considering that Toramāṇa could not march up to Malwa without consolidating Kaushambhi was not possible. As a result, it is feasible that most of the upper Ganga valley had been conquered by Toramāṇa before he advanced as far as Eran. == First Hunnic War == === Huna conquest of Malwa === The Huna conquest of the Gupta Empire was facilitated by the administrative structure of the empire, particularly its feudal system, which enabled the Huna king to gain the support of local chiefs. Notably, inscriptions found in Eran provide insight into this dynamic. One inscription, dating to Gupta era 165 (484 AD), documents constructions undertaken by Maharaja Matrivshnu and his brother Dhanyavishnu during the reign of Budhagupta. Another inscription, following Matrivshnu's death, details the temple construction by Dhanyavishnu during the rule of Toramana Sahi Jauvla, indicating his allegiance shift to the Huna invader. This transition likely occurred after 484 AD, within a generation of that date. Additionally, an inscription from Eran, dated Gupta era 191 (510 AD), recounts a battle where King Bhanugupta fought against the Hunas, resulting in the death of his general Goparaja. This engagement possibly aimed to halt Huna incursions into eastern Malwa or expel them from the region. If the former, Toramana's conquest of eastern Malwa could be dated to 510 AD, and if the latter, sometime prior to that year. While the exact date of Huna occupation in the region remains uncertain, it is plausible that Toramana established his rule in Malwa around 510 AD, considering the Huna incursions into India began after 500 AD, following their confinement to Gandhara. === Bhanugupta and Toramana === Bhanugupta is known from a stone pillar inscription in Eran, Malwa. The inscription was translated by John Faithfull Fleet in 1888, and then a second time in 1981, leading to different interpretations. ==== Initial translation (J.F Fleet 1888) ==== According to the initial translation of the Eran inscription (by John Faithful Fleet in 1888), Bhanugupta participated to a non-specific battle in 510 CE (Line 5). This translation was the basis for various conjectures about a possible encounter with Toramana, the Alchon Huns ruler. It has been suggested that Bhanugupta was involved in an important battle of his time, and suffered important losses, possibly against the Hun invader Toramana, whom he may or may not have defeated in 510.Ancient Indian History and Civilization by Sailendra Nath Sen p.220Encyclopaedia of Indian Events & Dates by S. B. Bhattacherje p.A15 Mookerji actually considers, in view of the inscription, that Bhanugupta was vanquished by Toramana at this 510 CE Eran battle, so that the western Gupta province of Malwa fell into the hands of the Hunas at that point. Toramana would then have made his Eran boar inscription, claiming control of the region. ==== New translation (1981) ==== A new revised translation was published in 1981. Verses 3-4 are markedly differently translated, in that ruler Bhanugupta and his chieftain or noble Goparaja are said to have participated in a battle against the \"Maittras\" in 510 CE, thought to be the Maitrakas (the reading being without full certainty, but \"as good as certain\" according to the authors). This would eliminate the suggestion that Bhanugupta alluded to a battle with Toramana in his inscription. Bhanugupta in the inscription is only mentioned as a \"Raja\" and not a \"Maharaja\" or a \"Maharajadhiraja\" as would be customary for a Gupta Empire ruler. Therefore, he may only have been a Governor for the region of Malwa, under Gupta Emperor Narasimhagupta. === Battle of Eran 510 CE, Sack of Kausambhi 497–500 CE and the Battle of Malwa 510 CE === A decisive battle occurred in Malwa, where a local Gupta ruler, probably a governor, named Bhanugupta was in charge. In the Bhanugupta Eran inscription, this local ruler reports that his army participated in a great battle in 510 CE at Eran, where it suffered severe casualties. Bhanugupta was probably vanquished by Toramana at this battle, so that the western Gupta province of Malwa fell into the hands of the Hunas. According to a 6th-century CE Buddhist work, the Manjusri-mula-kalpa, Bhanugupta lost Malwa to the \"Shudra\" Toramana, who continued his conquest to Magadha, forcing Narasimhagupta Baladitya to make a retreat to Bengal. Toramana \"possessed of great prowess and armies\" then conquered the city of Tirtha in the Gauda country (modern Bengal).\"After the successful conclusion of the Eran episode, the conquering Hunas ultimately burst out of Eastern Malwa and swooped down upon the very heart of the Gupta empire. The eastern countries were overrun and the city of the Gaudas was occupied. The Manjusrimulakalpa gives a scintillating account of this phase of Toramana's conquest. It says that after Bhanugupta's defeat and discomfiture, Toramana led the Hunas against Magadha and obliged Baladitya (Narasimha-gupta Baladitya, the reigning Gupta monarch) to retire to Bengal. This great monarch (Toramana), Sudra by caste and possessed of great prowess and armies took hold of that position (bank of the Ganges) and commanded the country round about. That powerful king then invested the town called Tirtha in the Gauda country.\" in Toramana is said to have crowned a new king in Benares, named Prakataditya, who is also presented as a son of Narasimha Gupta. Having conquered the territory of Malwa from the Guptas, Toramana was mentioned in a famous inscription in Eran, confirming his rule on the region. The Eran boar inscription of Toramana (in Eran, Malwa, 540 km south of New Delhi, state of Madhya Pradesh) of his first regnal year indicates that eastern Malwa was included in his dominion. The inscription is written under the neck of the boar, in 8 lines of Sanskrit in the Brahmi script. The first line of the inscription, in which Toramana is introduced as Mahararajadhidaja (The Great King of Kings), reads: On his gold coins minted in India in the style of the Gupta Emperors, Toramana presented himself confidently as: The fact that the Alchon Huns issued gold coins, such as the Toramana issue, in addition to their silver and copper coins, suggest that their empire in India was quite rich and powerful.\"This makes it quite clear that the Alchon Huns in India must have had a substantial and rich empire, with the capacity to issue a relatively large volume of gold coins.\" in Full article In the First Hunnic War (496–515), the Alchon reached their maximum territorial extent, with King Toramana pushing deep into Indian territory, reaching Gujarat and Madhya Pradesh in Central India, and ultimately contributing to the downfall of the Gupta Empire. To the south, the Sanjeli inscriptions indicate that Toramana penetrated at least as far as northern Gujarat, and possibly to the port of Bharukaccha. To the east, far into Central India, the city of Kausambi, where seals with Toramana's name were found, was probably sacked by the Alkhons in 497–500, before they moved to occupy Malwa. In particular, it is thought that the monastery of Ghoshitarama in Kausambi was destroyed by Toramana, as several of his seals were found there, one of them bearing the name Toramana impressed over the official seal of the monastery, and the other bearing the title Hūnarāja (\"King of the Huns\"), together with debris and arrowheads. Another seal, this time by Mihirakula, is reported from Kausambi. These territories may have been taken from Gupta Emperor Budhagupta. Alternatively, they may have been captured during the rule of his successor Narasimhagupta. === Toramana and Prakasaditya === The success of Bhanugupta's campaign against the Hunas remains unspecified in the posthumous inscription of Goparaja. However, the absence of explicit mention of a great victory suggests a different outcome. Subsequent events, as chronicled in the Arya Manjulsri Mula Kalp, reinforce this notion. The narrative portrays Prakāśāditya, identified as the son of Bhanugupta, imprisoned by King Goparaja, possibly on the orders of his own father. Prakāśāditya's release by Hakarakhya (Toramana), who extended his dominion along the banks of the Ganga, signifies the inability of Bhanugupta to thwart Toramana's advance, with the latter eventually occupying much of the Ganga valley. This narration underscores Toramana's prowess as a conqueror and adept diplomat. His swift conquests effectively reduced the Gupta emperor to a vassal status. Numismatic evidence reveals Toramana's rule over regions including U.P., Rajputana, Punjab, and Kashmir, while textual sources suggest his victorious campaigns extended as far as Gauda. Toramana's strategic approach involved leveraging internal discord within the Gupta empire, thereby facilitating the consolidation of his power in central provinces. Notably, he preserved existing administrative structures and enlisted the support of ancient Gupta official families, exemplified by the case of Dhanyavishnu. Toramana's reign marked a significant period of political upheaval and realignment in ancient India, reshaping the dynamics of power in the region. === Battle of Daśapura (515 CE) === Toramana was finally defeated by the local Indian rulers. The local ruler Bhanugupta is sometimes credited with vanquishing Toramana, as his 510 CE inscription in Eran, recording his participation in \"a great battle\", is vague enough to allow for such an interpretation. The \"great battle\" in which Bhanagupta participated is not detailed, and it is impossible to know what it was, or which way it ended, and interpretations vary. Radha Kumud Mukherjee and others consider, in view of the inscription as well as the Manjusri-mula-kalpa, that Bhanugupta was, on the contrary, vanquished by Toramana at the 510 CE Eran battle, so that the western Gupta province of Malwa fell into the hands of the Hunas at that point, so that Toramana could be mentioned in the Eran boar inscription, as the ruler of the region. Toramana was finally vanquished with certainty by an Indian ruler of the Aulikara dynasty of Malwa, after nearly 20 years in India. According to the Rīsthal stone-slab inscription, discovered in 1983, King Prakashadharma defeated Toramana in 515 CE. The First Hunnic War thus ended with a Hunnic defeat, and Hunnic troops apparently retreated to the area of Punjab. The Manjusri-mula-kalpa simply states that Toramana died in Benares as he was returning westward from his battles with Narasimhagupta. == Religious impact on the Hunas == The four Alchon kings Khingila, Toramana, Javukha, and Mehama are mentioned as donors to a Buddhist stupa in the Talagan copper scroll inscription dated to 492 or 493 CE, that is, at a time before the Hunnic wars in India started. This corresponds to a time when the Alchons had recently taken control of Taxila (around 460 CE), at the center of the Buddhist regions of northwestern India. Numerous Alchon coins were found in the dedication compartment of the \"Tope Kalān\" stupa in Hadda. Mural with paintings of probable Alchon devotees can be seen in the Buddhist complex of the Butkara Stupa (Butkara I, construction phase 4). Dated to the 5th century CE, they suggest that the Alchon Huns may have been participants to the local Buddhist culture. === Persecution of Buddhists === Later, however, the attitude of the Alchons towards Buddhism is reported to have been negative. Mihirakula in particular is remembered by Buddhist sources to have been a \"terrible persecutor of their religion\" in Gandhara in northern (modern day) Pakistan. During his reign, over one thousand Buddhist monasteries throughout Gandhara are said to have been destroyed. In particular, the writings of Chinese monk Xuanzang from 630 CE explained that Mihirakula ordered the destruction of Buddhism and the expulsion of monks. Indeed, the Buddhist art of Gandhara, in particular Greco-Buddhist art, becomes essentially extinct around that period. When Xuanzang visited northwestern India in CE, he reported that Buddhism had drastically declined, and that most of the monasteries were deserted and left in ruins. Although the Guptas were traditionally a Hindu dynasty, around the period of the invasions of the Alchon the Gupta rulers had apparently been favouring Buddhism. According to contemporary writer Paramartha, Mihirakula's supposed nemesis Narasimhagupta Baladitya was brought up under the influence of the Mahayanist philosopher Vasubandhu. He built a sangharama at Nalanda and a high vihara with a Buddha statue within which, according to Xuanzang, resembled the \"great Vihara built under the Bodhi tree\". According to the Manjushrimulakalpa (c. 800 CE), king Narasimhsagupta became a Buddhist monk, and left the world through meditation (Dhyana). Xuanzang also noted that Narasimhagupta Baladitya's son Vajra, who also commissioned a sangharama, \"possessed a heart firm in faith\". The 12th century Kashmiri historian Kalhana also painted a dreary picture of Mihirakula's cruelty, as well as his persecution of the Buddhist faith: === Sun cult, Vaishnavism and Shaivism === The Alchons are generally described as sun worshipers, a traditional cult of steppe nomads. This stems from the appearance of sun symbols on some of their coins, combined with the probable influence they received from the worship of Surya in India. The Hindu Vaishnavite goddess Lakshmi, goddess of wealth, fortune, power, beauty, fertility and prosperity and also an ancient goddess of Buddhism, also appears on the coinage of some rulers, especially Khingila,Alram Alchon und Nēzak: Zur Geschichte der iranischen Hunnen in Mittelasien and Toramana. Mihirakula is also said to have been an ardent worshiper of Shiva, although he may have been selectively attracted to the destructive powers of the Indian deity. Mihirakula is said to have been the founder of the Shankaracharya Temple, a shrine dedicated to Shiva in Srinagar,\"He is credited with the building of the temple named Jyeshteswara on the Gopa (Sankaracharya) hill in Srinagar\" in == Second Hunnic War == === Mihirkula the Huna === The Second Hunnic War began when Mihirakula, the son of Toramana, established his position in West Punjab shortly after taking over as leader of his father shortly after 515. Based on numismatic evidence, it appears that Mihirakula led a group of Alkhan chiefs and was not as powerful as his father. Song Yun met the \"King of the Huns\" in 520, as we have seen above, on the banks of the Jhelum River. The Northern Wei envoy depicted the king (chiqin) as having a violent and harsh disposition and having perpetrated massacres. The meeting was unpleasant. Mihirakula tightened his hold in India by going the same path his father had taken during the latter's initial campaign. This is inferred from the one known inscription of Mihirakula, which was discovered \"built into the wall in the porch of a temple of the Sun in the fortress of Gwalior,\" between the Chambal and Betwa rivers. The Sun Temple at Surāj Kund, where the inscription was discovered, is no longer standing; it might have been the heir to the first Sun (Surya) temple established by Mātrceta. One of the people who was rumoured to live there because of King Mihirakula (prasadena) was Mātrceta. These individuals are identified as the heirs who will benefit from the foundation's success. Consequently, the recently established Sun Temple might have served as a Hun temple, with a garrison inside the fort. A monarch named Mihirakula, which means \"Family of Mihira\" and is of Mitra, is a direct example of the Alkhan's Iranian ties. According to Hans T. Bakker It's possible that some of the garrison's members were of Iranian descent, and a temple that combined the sun gods of India's Surya (Bhanu) and Iran's Mithra catered to their religious needs.The Roman legionary stations contain Mithraea. It is clear that Mihirakula ruled over a wide swath of territory that connected his stronghold of Gwalior Hill in eastern Malwa to his home base of Sialkot in northern Punjab. This corridor shared borders with the Aulikara kingdom of Yashodharman to the southwest and the Maukharis' territory to the northeast, where they had previously taken over portions of the Ganga-Yamuna Plain. === Hunnic reverses === The Second Hunnic War started in 520, when the Alchon king Mihirakula, son of Toramana, is recorded in his military encampment on the borders of the Jhelum by Chinese monk Song Yun. At the head of the Alchon, Mihirakula is then recorded in Gwalior, Central India as \"Lord of the Earth\" in the Gwalior inscription of Mihirakula. According to some accounts, Mihirakula invaded India as far as the Gupta capital Pataliputra, which was sacked and left in ruins. The destructions of Mihirakula are also recorded in the Rajatarangini: Finally however, Mihirakula was defeated in 528 by an alliance of Indian principalities led by Yasodharman, the Aulikara king of Malwa, in the Battle of Sondani in Central India, which resulted in the loss of Alchon possessions in the Punjab and north India by 542. The Sondani inscription in Sondani, near Mandsaur, records the submission by force of the Hunas, and claims that Yasodharman had rescued the earth from rude and cruel kings,\"The earth betook itself (for succour), when it was afflicted by kings of the present age, who manifested pride; who were cruel through want of proper training; who,from delusion, transgressed the path of good conduct; (and) who were destitute of virtuous delights \" from and that he \"had bent the head of Mihirakula\". In a part of the Sondani inscription Yasodharman thus praises himself for having defeated king Mihirakula: The Gupta Empire emperor Narasimhagupta is also credited in helping repulse Mihirakula, after the latter had conquered most of India, according to the reports of Chinese monk Xuanzang. In a fanciful account, Xuanzang, who wrote a century later in 630 CE, reported that Mihirakula had conquered all India except for an island where the king of Magadha named Baladitya (who could be Gupta ruler Narasimhagupta Baladitya) took refuge, but that was finally captured by the Indian king. He later spared Mihirakula's life on the intercession of his mother, as she perceived the Hun ruler \"as a man of remarkable beauty and vast wisdom\". Mihirakula is then said to have returned to Kashmir to retake the throne. This ended the Second Hunnic War in 534, after an occupation which lasted nearly 15 years. ==== Victories of the Maukharis ==== According to the Aphsad inscription of Ādityasena, the Maukharis also fought against the Hunas in the areas of the Gangetic Doab and Magadha. The Aphsad inscription of Ādityasena mentions the military successes of kings of the Later Gupta dynasty against the Maukharis, and explains that the Maukharis were past victors of the Hunas: The Maukharis led by their king Ishanavarman, rather than any of the Guptas, were therefore pivotal in repelling the Hunas. === Battle of Sondani === This resulted in the loss of Alchon possessions in the Punjab and north India by 542. The Sondani inscription in Sondani, near Mandsaur, records the submission by the Hunas, and claims that Yasodharman had rescued the earth from rude and cruel kings, and that he \"had bent the head of Mihirakula\". In a part of the Sondani inscription Yasodharman thus praises himself for having defeated king Mihirakula: The Gupta Empire emperor Narasimhagupta is also credited in helping repulse Mihirakula, after the latter had conquered most of India, according to the reports of Chinese monk Xuanzang. In a fanciful account, Xuanzang, who wrote a century later in 630 CE, reported that Mihirakula had conquered all India except for an island where the king of Magadha named Baladitya (who could be Gupta ruler Narasimhagupta Baladitya) took refuge, but that was finally captured by the Indian king. He later spared Mihirakula's life on the intercession of his mother, as she perceived the Hun ruler \"as a man of remarkable beauty and vast wisdom\". Mihirakula is then said to have returned to Kashmir to retake the throne. Moreover, according to some scholars' suggestions, a confederacy of Yashodharman and Narasimhagupta Baladitya defeated and overthrew the Hunas in Malwa and eastern India. == List of conflicts == Conflict Combatant 1 Combatant 2 Result The First Huna Invasion (356–399 CE) _Location:_ Bactria and Gandhara Gupta Empire * Kidarites (Kushans) Hephthalites Gupta victory * The Hephthalites were successful in occupying Bactria and expelling the Kidarite (Kidara Kushans) from there. * The Hepthalites invaded Gandhara. * Then Chandragupta II led a successful expedition against the Hepthalites (Hunas). Chandragupta II's Huna Expedition (356–399 CE) _Location:_ Gandhara and Bactria Gupta Empire * Kidarites (Kushans) Hephthalites Gupta victory * Successful expedition by the Gupta emperor against the Hephthalites (Hunas) across the seven mouths of the Indus River. Kidara's conquest of Gandhara (356 CE) _Location:_ Gandhara Gupta Empire * Kidarites (Kushans) Hephthalites Gupta-Kidarite victory * With the help from the Gupta emperor, Kidara eventually conquered Gandhara from the Hephthalites. Chandragupta II's Campaign of Balkh (367 CE) _Location:_ Balkh Gupta Empire Hephthalites * Sakas * Kidarites (Kushans) * Sasanians (Parasikas) Gupta victory * Chandragupta II's campaign of Balkh resulted in Chandragupta II conquering Balkh. Battle of the Oxus (399 CE) _Location:_ Oxus valley Gupta Empire Hephthalites Gupta victory * Chandragupta II with his Gupta cavalry defeated the Hephthalites and planted the Gupta flag on the banks of the Oxus. The Second Huna Invasion (c. 450s–460s or c. 453–459 CE) _Location:_ Northwest frontiers and Northwest India Gupta Empire Hephthalites * Sasanians * Kidarites (Kushans) Gupta victory * Skandagupta repulsed the invading hordes of Kushans, Hephthalites and Sassanids. Battle of the Indus river (c. 458) _Location:_ Indus river Gupta Empire Hephthalites Gupta victory * Skandagupta checked the Hephthalites' progress. First Hunnic War (502–515 CE) _Location:_ Malwa Gupta Empire * Second Aulikara dynasty Hephthalites * Alchon Huns Gupta victory * The Huna king was vanquished by an Indian ruler of the Aulikara dynasty. Battle of Eran (502 CE) _Location:_ Eran Gupta Empire Hephthalites * Alchon Huns Hunnic Victory * Toramana defeated and killed Matrvishnu who was the local governor and installed his brother Dhanyavishnu in Eran. Sack of Kausambhi (497–500 CE) _Location:_ Kausambhi Gupta Empire Hephthalites * Alchon Huns Hunnic Victory * Alchon Huns sacked Kausambhi before they moved to occupy Malwa. Huna conquest of Malwa (510 CE) _Location:_ Malwa Gupta Empire Hephthalites * Alchon Huns Hunnic victory * The Huna king occupied and conquered Malwa from the Gupta Empire. Battle of Eran (510 CE) _Location:_ Eran Gupta Empire Hephthalites * Alchon Huns Hunnic Victory * Emperor Bhanugupta fought a fierce battle against Toramana in which his general Goparaja was killed. Battle of Daśapura (515 CE) _Location:_ Malwa Gupta Empire * Second Aulikara dynasty Hephthalites * Alchon Huns Gupta Victory * The Second Aulikara dynasty king Prakaśadharman of Daśapura reports victory over the Toramana. Second Hunnic War (520–528 CE) _Location:_ Malwa Gupta Empire * Second Aulikara dynasty * Maukhari dynasty Hephthalites * Alchon Huns Gupta victory * The Huna king Mihirakula was defeated by Yashodharman. Battle of Sondani (528 CE) _Location:_ Betwa river Gupta Empire * Second Aulikara dynasty * Maukhari dynasty Hephthalites * Alchon Huns Gupta victory * A confederacy of Indian rulers led by Yashodharman and possibly even supported by the Gupta emperor Narasimhagupta, decisively defeated the Hunnic armies at Battle of Sondani in 528 CE Northwest campaign of Iśanavarman (532 CE) _Location:_ North-western India Gupta Empire * Maukhari dynasty Hephthalites * Sulikas Gupta Victory * Maukhari dynasty king Iśanavarman routed the Sulikas, who may have been the Hunnic adversaries or their allies. == Aftermath == === Collapse of Huna power === The Alchon huns, following their loss to Yaśodharman at Sondani, withdrew to the mountainous country, the fortified town of Sakala (Sialkot), the Himalayan foothills in northern Pakistan between the Jhelum river, Chenab river, and Ravi River, and the region from which Toramana had launched his conquests. === Rise of Shaivism === All of the royal families of these successor states including the Alchon Mihirakula had embraced Saivism, which had equally profound effects. Vaisnavism had been rendered obsolete by the fall of the Empire, particularly in its former lands. A theological innovation that specifically aided in this growth was Saivism's ability to provide access to both humdrum rewards and superformance power, in addition to this political component. This was accomplished by human agent lineages personifying god. This provided the Śaiva officials with a unique advantage over their Vaisnava counterparts. This is a unique factor, while Vaisnavism's diminished political standing following the collapse of the Gupta Empire. Saivism particularly gained traction in the regions of former Gupta territories. Although Vaisnavism flourished in the regions of Kashmir and Southern India. === Gupta-Aulikara War === Vajra, who succeeded Baladitya II, did not surpass his predecessor's accomplishments. Despite his construction of an additional monastery at Nalanda and his depiction as a devout Buddhist by Chinese sources, he proved incapable of resisting the formidable Yaśodharman of Malwa. However, the rapid expansion of Malava power was soon curtailed, likely through the influence of emerging feudatory royal houses rather than direct Gupta intervention. Evidence from the Jaunpur, Uttar Pradesh stone inscription suggests that either Isvaravarman or his successor, presumably Isanavarman, successfully repelled a threat originating from 'the city of Dhar'. This conflict, occurring in the second quarter of the sixth century, likely corresponds to the invasion led by Yasodharman. The Maukhari kings played a significant role in opposing the Malava adventurer, receiving support from these feudatories. Through alliances with such feudatories, Kumāragupta III, the son of Narasimhagupta II, and Vishnugupta Chandraditya, the son and successor of Kumāragupta III, were able to retain control of the imperial throne until the middle of the sixth century AD. These alliances were crucial for the Gupta dynasty's survival amidst political instability and external threats. The Gupta Empire faced significant challenges during Yashodharman's conquests, as he expanded his victorious campaigns across North India. Despite initial successes, Yasodharman's ability to consolidate his conquests was limited, resulting in a short-lived reign reminiscent of a meteoric rise and fall. The circumstances surrounding his downfall remain unclear, but it is likely that the disintegration of the Gupta Empire, triggered by his victories, contributed to his demise. The emergence of powers like the Maukharis and Later Guptas during this period suggests a shifting political landscape influenced by Yashodharman's actions. It is possible that the Gupta Emperor orchestrated Yashodharman's defeat by rallying these forces against him. Alternatively, Yashodharman may have succumbed to the chaos he instigated to dismantle the Gupta Empire. === Disintegration of the Gupta Empire === The Gupta Empire, a beacon of stability and prosperity in ancient India, faced a tumultuous period following the demise of Budhagupta, its illustrious ruler. This era was characterized by internal discord, exacerbated by external threats, which precipitated the empire's gradual decline. Succession disputes emerged as a primary catalyst for the empire's instability, leading to fragmentation and partition. The absence of a clear line of succession plunged the Gupta realm into uncertainty, opening the door to rival claimants vying for power. Among these contenders were Narasimhagupta, Budhagupta's brother, and his successors. Narasimhagupta, known by the honorific title Baladitya, assumed the throne amidst a backdrop of political turmoil and uncertainty. However, his ascendancy was not without challenge, as other claimants, such as Vainyagupta and Bhanugupta, also sought to assert their authority. Vainyagupta's rule, centered in Bengal, and Bhanugupta's reign, commemorated in an inscription at Eran, added further complexity to the Gupta political landscape. The inscription detailing Bhanugupta's exploits suggests Gupta efforts to resist external threats, particularly the incursions of Huna chief Toramana. Narasimhagupta's reign witnessed both triumph and tragedy. His notable victory over Huna chief Mihirakula demonstrated Gupta military prowess, yet internal discord continued to erode the empire's stability. As rival factions vied for supremacy, the Gupta Empire entered a period of decline marked by territorial loss and political fragmentation. These tumultuous events marked a pivotal chapter in Gupta history, signaling the empire's eventual demise and the end of an era of unparalleled prosperity and cultural flourishing in ancient India. == Legacy == === Hunnic impact on India === It can be seen that the most noticeable shift has been the development of independent, regional states in Northern India following the fall of the Gupta Empire. Not only the rise of the Aulikara kingdom of Daśapura and the Maukhari kingdom of Kanyakubja occurred after disintegration of Gupta Empire, but it is also possible to include the Maitrakas of Valabhi, the Vardhanas of Sthaneśvara, and the Kalachuris of Mahismati. This new constellation was constantly changing since their independence had to be repeatedly reaffirmed; the fall of the Daśapura Kingdom is one example of this. The power of the Huna in northwest India endured as long as it received support from its formidable ally across the Hindu Kush. However, when the Hephthalites faced intense pressure from the resurgent Sasanian Empire led by Khosrow I in the 530s, and the natural dynamics of the Hunnic Peoples on both sides of the Hindu Kush were disrupted, the Indian Hunas, notably the Alkhan led by Mihirakula, lost their capacity to recover from defeats. This underscores the interconnectedness of the history of the Hunas in India with the political landscape to the north of the Hindu Kush. In contrast to its Iranian counterpart, the Gupta Empire did not experience a revival. Over the fifty years under consideration, the most notable change was the emergence of autonomous regional states in Northern India following the dissolution of the Gupta Empire. Examples include the Aulikara kingdom of Daśapura and the Maukhari kingdom of Kanyakubja, among others. This period witnessed a constant state of flux as the independence of these states had to be reaffirmed repeatedly. The disappearance of the Daśapura Kingdom serves as a poignant example of this instability. As a consequence of this regional division, major political and commercial centers of the fallen empire experienced decline. Cities such as Kauśambı, Ujjain, Vidiśa, and Mathura lost their prominence, eclipsed by new urban centers like Daśapura, Kanyakubja, Sthaneśvara, Valabhi, and Śripura. This shift in urban centrality reflects the evolving political and economic landscape of Northern India during this period. == Related pages == * Gupta Empire * Huna people == Notes == == References == == Bibliography == * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * == Further reading == * * == Other websites == * Huns in Central and South Asia. How Two Centuries of War against Nomadic Invaders from the Steps are Concluded by a Game of Chess between the Kings of India and Iran in Academia.edu Category:Wars involving India",
 "title": "Gupta–Hunnic Wars"
}