{
 "id": "1134827",
 "text": "Daniel M’Naghten was a Scottish woodcutter who shot and killed Sir Robert Peel’s secretary Edward Drummond because he thought Drummond was Peel. At his trial, the jury said he wasn’t guilty because of the Insanity defense. == Early Life == M’Naghton was born in Glasgow in 1813 after his father had an affair. After his mother died, he went to live with his father and learned to cut wood. Then M’Naghton left to become an actor. He went to London, then France and came back to Scotland. == Paranoia == When he was in Scotland, M’Naghton voted against the Tories and then started to think the Tories were stalking him. M’Naghton told his father but he didn’t believe him. Then he told the Glasgow Police and they didn’t believe him. Then he told a Whig politician and he also didn’t believe him. Then M’Naughten bought two guns and lied that he wanted to use them for hunting. == Drummond assassination == M’Naughten went to England and waited for Sir Robert Peel to come where he was but then Peel’s secretary Edward Drummond came and M’Naughten thought Drummond was Peel and shot him in the back. The police then caught M’Naughten before he could shoot Drummond again. Drummond died five days later. == Trial == M’Naughten’s friends and family said that he wasn’t guilty because of the Insanity defense. The judge asked M’Naughten if he were guilty. M’Naughten said he was persecuted. The judge asked him again if he were guilty and M’Naughten said he was “guilty of firing.” The judge thought that counted as him saying he wasn’t guilty. The Prosecutors said that M’Naughten was mentally ill but that he was sane enough to know he was murdering Drummond. M’Naughtens lawyers said that if a mentally ill person can’t tell what is or isn’t real and that leads him to commit a crime then he’s insane. They asked a lot of Psychiatrists about M’Naughten and they said he was psychotic. The jury decided that M’Naughten was insane. == Reaction to the Trial == Because Queen Victoria had survived assassination attempts, she was worried that M’Naughten being legally insane meant someone could kill her and not be found guilty of murder. So she wrote letters to the judges asking why M’Naughten wasn’t punished. The House of Lords also talked to the judges and asked a lot of questions about how the Insanity defense was supposed to work. The judges said that if a criminal has a Mental illness and because of it can’t tell the difference between what is or isn’t real then he’s “not guilty by grounds of insanity” and if a criminal has a Mental illness and because of it can’t understand why what he did was bad then he’s insane. If he doesn’t have those kinds of mental illnesses then he’s sane. They also said the Insanity defense only works if the criminal were insane when he committed the crime. And they said that judges had to explain the rules for the insanity defence to the jury at the beginning of the trial. This is called the M’Naughten rule. == Death == In 1865, M’Naughten was transferred to another hospital but he died of diabetes and heart problems. == Impact == Great Britain and most countries that use Common law base their versions of the Insanity Defence on the M’Naughten rule. == References == Category:Scottish people Category:People acquitted of murder",
 "title": "Daniel M’Naghten"
}