{
 "id": "1134941",
 "text": "The Nukhba (, from ) is an Israeli name for trained fighters of from the Ezzedeen Al-Qassam Brigades, the military wing of the Islamic Resistance Movement (Hamas). Israel claims the unit led the 7 October 2023 attack on Israel, at the beginning of the 2023 Israel–Hamas war. == History == In 2016 Israel's said there were 5,000 trained fighters in the Nukhba. In 2017, some of its members detected to join ISIS in the Sinai Peninsula. That same year a Hamas government border guard at Rafah crossing was killed by an ISIS suicide bomber. == Post 7 October attack == According to an IDF spokesman, the Israeli air force have been specifically targeting Nukhba. Shin Bet set up a new unit called Nili – an abbreviation of the Hebrew phrase () tasked with hunting down Nukhba members. Sources from the military said that some of the strikes targeted at top level Hamas militants were authorized despite the people authorising the strike knowing that they would kill large mines of other people. According to the IDF, on October 17, Hamas' fourth most senior commander Ayman Nofal who had responsibility for the Nukhba and the Be'eri massacre and Re'im music festival massacres was killed in an airstrike. Sources from the Israeli military said that in order to kill Nofal the military knowingly authorized a strike that they knew would kill approximately 300 other people. Four multi-story apartment buildings were destroyed in the strike. Only 70 bodies were recovered from the site on the first day, but locals in Gaza continued digging through the ruble of the building for 5 days, and believed some bodies remind under the ruble months later in April 2024. The Qassam Brigades confirmed that Nofal had been killed in the strike. === Nukhba prisoners === The Israeli military described most of their prisoners of war as \"Nukhba\". According to footage the Israeli security services released of interrogation of purportedly captured Nukhba members, Hamas has been using medical facilities in the Gaza Strip, especially the Shifa Hospital in Gaza City, to shield themselves from Israeli strikes and that the underground levels of the hospital are utilized for hiding resources like weapons and ammunition. Hamas denied these claims. Israeli officials claimed that Palestinian prisoners of war who were tortured and sexually assaulted were members of the Nukhba and that this justified abuse against them. For example, Knesset member (KM) Hanoch Milwidsky, from the Likud party, said: “If he is a Nukhba, everything is legitimate to do! Everything!” When responding to a question from Arab Israeli KM Ahmad Tibi's criticism. of the treatment of Palestinian prisoners by Israeli soldiers. Knesset member Simcha Rothman also commented on the Nukhba, \"we see over and over again an enormous disconnect between the justice and enforcement agencies, who persecute reservists, heroic fighters, who left everything behind in order to protect us from the Nukhba terrorists, for whom 'animals' is a compliment\". In response to the reports of mistreatment of Nukhba prisoners Gidion Levy wrote that, \"…the reports about sex crimes remained as defining the barbarity of the Nukhba. Now we have rape by our own Nukhba. There is not just \"suspicion of rape\" here and there is no need to recite the prefix \"alleged.\" Somebody raped the Palestinian prisoner…\" in his opinion piece in Haaretz. == Other websites == * What is the Nukhba, the special force of Hamas? (Podcast) , with Dr. Michael Milstein, former head of the Palestinian arena at AMAN. == Related pages == * Qassam naval commandos * * * * Quds Force (Iran) == Footnotes == Category:Israel–Hamas war Category:Palestinian nationalism Category:Israel–Palestine conflict Category:Hamas Category:7 October attacks Category:Public diplomacy of Israel Category:Neologisms Category:Propaganda in Israel Category:Military Category:Anti-Palestinian sentiment Category:Anti-Arab racism Category:Islamophobia Category:Articles containing Arabic-language text Category:Pages with unreviewed translations Category:Crimes against prisoners of war",
 "title": "Nukhba (Al-Qassam)"
}