{
 "id": "1134379",
 "text": "The Australian Federal Police (AFP) is the national and principal law enforcement agency of the Australian Government with the unique role of investigating crime and protecting the national security of the Commonwealth of Australia. The AFP is an independent agency of the Attorney-General's Department and is responsible to the Attorney-General and accountable to the Parliament of Australia. The Australian Federal Police (AFP) is the national and principal law enforcement agency of the Australian Government with the unique role of investigating crime and protecting the national security of the Commonwealth of Australia. The AFP is an independent agency of the Attorney- General's Department and is responsible to the Attorney-General and accountable to the Parliament of Australia. the Commissioner of the Australian Federal Police is Reece Kershaw, formerly the Northern Territory Police Commissioner. == Commissioners == the Commissioner of the Australian Federal Police is Reece Kershaw, formerly the Northern Territory Police Commissioner. Rank Name Post-nominals Term began Term ended Time in appointment Commissioner of the AFP Commissioner Sir Colin Woods Commissioner (Major General) Ronald Grey Commissioner Peter McAulay Commissioner Michael Palmer Commissioner Mick Keelty Commissioner Tony Negus Commissioner Andrew Colvin Commissioner Reece Kershaw Incumbent Australian_Federal_Police_Headquarters.jpg|Former Australian Federal Police Headquarters Melbourne,_Australia.jpg|AFP vehicles in Melbourne 2006-2007_Holden_Captiva_(CG_MY07)_SX_AWD_wagon,_Australian_Federal_Police_(2007-04-03).jpg|An AFP vehicle on duty at Gold Coast Airport in Queensland == References == == Other websites == * * Specialist Protective Command * Australian Federal Police Former Members Association * Australian Federal Police Act 1979 * ACT Policing Category:Organisations based in Canberra Category:1979 establishments in Australia Category:Pages with unreviewed translations",
 "title": "Australian Federal Police"
}