{
 "id": "1134727",
 "text": "Battle of the Yarmuk (also spelled Yarmouk) was a major battle fought between the Byzantine Empire and the Arab Muslim forces of the Rashidun Caliphate. The battle, consisting of a series of engagements over six days, took place from August 15 to August 20, 636, near the Yarmuk River (also called the Hieromyces River) along the present-day borders of Syria–Jordan and Syria-Israel, southeast of the Sea of Galilee. The result was a decisive victory for the Rashidun Caliphate, leading to the end of Roman rule in Syria after about seven centuries. To check the Arab advance and to recover lost territory, Emperor Heraclius had sent a massive expedition to the Levant in May 636. As the Byzantine army approached, the Arabs tactically withdrew from Syria and regrouped all their forces at the Yarmuk plains close to the Arabian Peninsula, where they were reinforced, and defeated the numerically superior Byzantine army. The battle is widely regarded to be Khalid ibn al-Walid's greatest military victory and to have cemented his reputation as one of the greatest tacticians and cavalry commanders in history.. == Background == During the Byzantine–Sasanian War of 602–628, Heraclius became the Byzantine Emperor in 610. After expelling the Persians from Anatolia and achieving victories, he managed to restore the True Cross to Jerusalem in 629. Concurrently, the rise of Islam under Muhammad led to the unification of the Arabian Peninsula. After Muhammad's death in 632, his successor Abu Bakr launched a series of conquests, including the invasion of Syria. The Rashidun forces, led by Khalid ibn al-Walid, achieved significant victories against the Byzantine forces, including at the Battle of Ajnadayn and the capture of Damascus in 635. == Byzantine Counterattack == In response to the Muslim conquests, Byzantine Emperor Heraclius prepared a large counteroffensive. By May 636, he had assembled a vast army from various regions. Despite this, coordination with an allied Persian counteroffensive failed. The Byzantine forces, commanded by Theodore Trithyrius, Vahan, Buccinator, Jabalah ibn al- Aiham, and others, advanced towards the Yarmuk River. ==Troop deployment== Muslim forces were heavily outnumbered by Byzantine forces. Modern estimates for the size each army varies, ranging from 15,000 to 40,000 for the Muslim forces, and from 40,000 to 150,000 for the Byzantine forces. == The Battle == The battle took place in the Yarmuk River basin. The Rashidun forces, commanded by Khalid ibn al-Walid, Abu Ubayda ibn al-Jarrah, and other leaders, used tactical withdrawals and reinforcements to overcome the larger Byzantine army. The victory at Yarmuk marked the end of Byzantine control in Syria and led to the rapid expansion of the Rashidun Caliphate into the Levant. == Aftermath == The Battle of Yarmuk had significant repercussions, leading to the annexation of the Levant by the Rashidun Caliphate and weakening Byzantine influence in the region. The battle is considered one of the most decisive in military history. ==Notes== ==References== ==Bibliography== ===Primary sources=== * * * * * * * * * * * * * *Chronicle of 819 ===Secondary sources=== ====Journals==== * * ====Books==== * * * * * * * * * * * * * * * * * * * * * * * ==External links== *Yarmouk in Sword of Allah at GrandeStrategy by A. I. Akram *Battle of Yarmuk, 636 == References == Category:636 Category:630s Category:630s conflicts Category:630s in the Byzantine Empire Category:630s in the Rashidun Caliphate Category:Battles involving the Byzantine Empire Category:Battles involving the Rashidun Caliphate Category:Battles of Abu Ubaidah ibn al-Jarrah Category:Battles of Khalid ibn Walid Category:Battles of the Arab–Byzantine wars Category:Byzantine Empire Category:Heraclius Category:History of Syria Category:Muslim conquest of the Levant en:Battle of the Yarmuk",
 "title": "Battle of the Yarmuk"
}