{
 "id": "1134023",
 "text": "Ernest Kofi Abbeyquaye, also known as Ernest Abbeyquaye, is a filmmaker from Ghana. He worked as a filmmaker, producer, and director for the Ghana Film Industry Corporation (GFIC). His movies have been recognized in Ghana and other countries. Some of his films are 'A Mother's Revenge' (1994), 'The Other Side of the Rich' (1992), and 'Confessions' (1993). == Personal life == Ernest Abbeyquaye has a wife, Benedicta Abbeyquaye. They have five children, but one has passed away.. == Career == In the 1960s, Abbeyquaye went to the Arts Council Acting School and was one of the first students. He later graduated with a degree in Drama and Theatre Arts from the University of Ghana, School of Performing Arts. From 1966 to 1970, he taught English, Literature, and Drama. Between 1972 and 1975, he trained at the National Film and Television School in Beaconsfield, Buckinghamshire, UK and worked for a short time with Samuelson Film Services Ltd. In 1978, he taught at the National Film Institute (NAFTI) and then became the Deputy Managing Director and the first Head of Studies at the institute. Ernest also worked for several years with the Ghana Film Industry Corporation (GFIC) and became the Executive Producer. He made many films and documentaries that have been shown in Ghana and other countries. He also filmed in Nigeria, Sierra Leone, The Gambia and Eritrea. During his career, Ernest interviewed many people, including academics, military generals, politicians, heads of states, farmers, market women, workers, and children. He also worked as a UNESCO consultant on film and television for rural development. Abbeyquaye has done several other jobs, including: * Local coordinator for Yorkshire TV in Ghana for the show \"The Dying of the Light\" (1992). * Local fixer for the HBO-BBC show \"Deadly Voyage\" (1996) in Ghana. * Director for the 1995 stage musical and drama \"King Lions Law.\" * Co-director for the pilot \"Hopes on the Horizon,\" a Blackside (Boston) and Multi-Media Africa Production funded by the Ford Foundation.. * Director of the stage musical drama \"Fairy Tale Africa,\" a Ghana-Nigeria production planned for a tour in the USA. He has also worked on productions like \"Hamele: The Prince of Tongo\" (actor), \"The Chronicles of Odumkrom – The Headmaster\" (director), and \"No Tears for Ananse\" (narrator). Currently, Abbeyquaye works with Trumpet Africa Productions and Emerald Films. In 2001, Abbeyquaye and other filmmakers helped create the Ghana Academy of Film and Television Arts (GAFTA). == Award == In 2018, Abbeyquaye won the Television and Film Pioneer Award in London, UK, as part of the GUBA Awards. == Filmography == * A Mother's Revenge (1994) * The Other Side of the Rich (1992) * Confessions (1993) == References == ==Other websites== * Category:Living people Category:Ghanaian movie directors Category:Ghanaian movie producers Category:Alumni of the National Film and Television School Category:University of Ghana alumni Category:Year of birth missing (living people)",
 "title": "Ernest Abbeyquaye"
}