{
 "id": "1134621",
 "text": "The kouprey (Bos sauveli), also known as the forest ox and grey ox, is a possibly extinct species of forest-dwelling wild bovine native to Southeast Asia. It was first scientifically described in 1937. The name kouprey is derived from the Khmer language and means \"forest ox\". The kouprey is listed as Critically Endangered and possibly extinct on the IUCN Red List. The last confirmed sighting of a wild individual took place in 1969. ==Taxonomy and phylogeny== The kouprey was described by Achille Urbain in 1937 based on an adult individual that was caught in northern Cambodia and was kept at the Paris Zoological Park. In 2006, a comparison of mitochondrial DNA sequences indicated that the kouprey may be a hybrid between zebu and banteng. However, the authors of the study rescinded their conclusion. In 2021, it was established that the kouprey represents a distinct species unrelated to zebu, forming a polytomy with the banteng and gaur due to incomplete lineage sorting, suggesting extensive hybridisation between their ancestors and resulting in the mitochondrial DNA of kouprey being nested within a group including a mixture of both banteng and gaur. Relationships of members of the genus Bos based on nuclear genomes after Sinding, et al. 2021. ==Description== The kouprey has a light and gracile build, in comparison to other wild cattle species. Both sexes have notched nostrils. It is long from nose to rear, tall at the shoulders and weighs . Calves have a reddish bay colour and turn grey at around 5 months of age. Their horns start appearing at the age of 6 months. The pelage of cows and bulls diverges as they mature; cows turn a mouse to brownish grey, while bulls become progressively darker, until individuals of 12 years or older are entirely dark brown. Both sexes have white stockings, with a dark strip down the front of each foreleg. Kouprey are a sexually dimorphic species and along with having different colour coats, males and females are distinguishable by the remarkably different shapes of their horns. Those of bulls are widely-set, similar to those of wild yaks, growing outwards before arching forwards and upwards, eventually fraying at the tips. While those of cows spiral upwards, growing into a shape reminiscent of a lyre. The horns of bulls reach up to , and those of cows up to . Bull kouprey develop large dewlaps as they age, with those of mature individuals reaching lengths of 16 inches (40 cm) long. In some cases, the dewlap is so pronounced that it drags along the ground. ==Distribution and habitat== The range of the kouprey once stretched from southeastern Thailand and southern Laos to the western edge of Vietnam and northern Cambodia. Archaeological evidence shows that it also occurred in northern Yunnan, China. The primary habitat of the kouprey is described as a mix of open grassland and dense open canopy forests featuring grassy glades, waterholes and salt licks. == Behaviour and ecology == Kouprey behaviour is described as similar to that of the banteng, with the two species often being found grazing alongside each other, though not intermixing. Herds, made up of cows, their calves, and periodically bulls, are always led by a mature cow. Kouprey are active, if nervous, animals, being quick to flee if approached. Bulls have been observed to plough up soil with their horns, especially around mineral licks and waterholes, which leads to the tips fraying. To avoid the hottest parts of the day, kouprey feed during the early morning and late afternoon, moving into denser forest for respite during midday. Little information is available on the animal's diet, though various grasses and some browse, supplemented with mineral soil, have been recorded. Kouprey come together to mate during the month of April, with bulls dispersing back into bachelor herds by the beginning of May. Gestation is between 8 and 9 months, with cows giving birth to a single calf between December and February. Female kouprey will isolate themselves to give birth, and remain away from the herd with their calf for the first month of its life. The total lifespan of a kouprey is thought to be around 20 years. ==Threats == The kouprey is thought to have never been numerous, likely never exceeding 2,000 individuals during the 20th century. In 1989, the total kouprey population in Cambodia was estimated at less than 200 individuals, with between 40 and 100 surviving in Laos, and less than 30 in Vietnam. As of 2016, the IUCN Red List puts the wild population at no more than 50 individuals, with a decreasing population trend. Kouprey have been hunted by local people for their meat, horns and skulls, the latter being highly symbolic culturally. Trophy hunting has likely been a considerable pressure on kouprey since their discovery by the Western world in the 1930s. War and political conflict, such as the Vietnam War and the Cambodian Civil War, have also played a role in the species' decline through the destruction of habitat, poaching, and significantly disrupting conservation efforts and further study of the animal in the wild. Snares are a potential risk for any surviving kouprey, with a 2020 report by the World Wildlife Fund estimating that over 12.2 million snares were present within protected areas in Cambodia, Laos and Vietnam. == Conservation == Conservation efforts for the kouprey began in 1960 when Norodom Sihanouk, then head of state of Cambodia, gave the species protected status and created three natural reserves for it. These protected areas continued to be maintained by Norodom Sihanouk's successor, Lon Nol, but became neglected during the time of Khmer Rouge rule under Pol Pot. During this period, the majority of the country's Forestry Bureau staff were killed, and all documents relating to the reserves were destroyed. Despite several expeditions by Dr. Charles H. Wharton to document kouprey during the 1950s, conservation efforts did not truly pick up again until the 1980s when, on the 15th and 16 January 1988, the University of Hanoi hosted the International Workshop on the Kouprey: Conservation Programme. Headed and coordinated by the IUCN, in collaboration with the governments of Cambodia, Laos, Vietnam, and Thailand, this had the aim of creating a feasible and realistic action plan for immediate kouprey conservation. Other organizations that attended and contributed to the action plan were the Association of Zoos and Aquariums, the Centre for Environmental Studies, VNIUCN Species Survival Commission (SSC), the Asian Wild Cattle Specialist Group, as well as WWF International. A 2011 examination by the IUCN of camera trap photos from northern Cambodia, some taken in known kouprey habitat, failed to turn up evidence of the animal. In late 2022, researchers from Re:wild and the Leibniz Institute for Zoo and Wildlife Research began a study to determine the status of kouprey in the wild. The goal of the study, through the examination of historical surveys and camera trap records, is to determine whether or not there is still suitable kouprey habitat that has yet to be searched. === In captivity === Only two kouprey have ever been kept in zoos. A young male was captured in Preah Vihear Province, Cambodia, and sent to the Paris Zoological Park by a French veterinarian. It arrived at the zoo in April 1937 and was housed alongside a juvenile gaur and a juvenile water buffalo. It died sometime during World War II. Another calf was kept in a captive setting by Norodom Sihanouk during the 1950s, though details surrounding this individual are limited. ==Cultural significance == Potential depictions of kouprey in rock art have been documented in the Cardamon Mountains of Cambodia, and carvings in the temples of Angkor Wat have been found to resemble the animal as well. The kouprey is the national animal of Cambodia, being designated as such by Norodom Sihanouk in 1960, its name is also the nickname of the country's national football team. Several statues depicting and dedicated to the kouprey have been established across Cambodia, including in the country's capital city, Phnom Penh. During the 2022 Miss Grand Cambodia contest, model Pich Votey Saravody wore a costume depicting a kouprey, which stirred considerable controversy amongst viewers, many of whom felt the depiction disrespected the animal. ==References== * Hassanin, A., and Ropiquet, A. 2004. Molecular phylogeny of the tribe Bovini (Bovidae, Bovinae) and the taxonomic status of the kouprey, Bos sauveli Urbain 1937. Mol. Phylogenet. Evol. 33(3):896–907. * Hendrix, S. (1995). Quest for the Kouprey. International Wildlife Magazine 25(5): 20–23. * Steve Hendrix: The ultimate nowhere. Trekking through the Cambodian outback in search of the Kouprey, Chicago Tribune – 19 December 1999. *Last Kouprey: Final Project to the Critical Ecosystem Partnership Fund for Grant Number GA 10/0.8\" Global Wildlife Conservation. Austin, TX, 25 Apr. 2011. Web 13 Nov. 2013. ==References== ==Other websites== * Animal info page on kouprey * CSEW factsheet on kouprey * Copy of New York Times item about possible hybrid origin. Category:Bovines",
 "title": "Kouprey"
}