{
 "id": "1134877",
 "text": "Pandava refers to a group of brothers from the epic of Mahabharata. It literally refers to ' the sons of pandu. The Pandavas were the main characters of the Mahabharata created by sage Veda Vyasa. The Pandavas include five brothers namely Yudhishthir (eldest), Bheem, Arjun, Nakul and Sahadev (youngest). ==Background== Pandu, the king of the Hastinapur Kingdom gives up his title and sets off to the forest with his wives Kunti and Matiri due to his guilt of killing a sage and his wife. The sage before his death curses Pandu that he would due if he ever touches a girl with sexual desire. When in forest Kunti reveals to Pandu a boon of hers through which she can get children from any deity by chanting a mantra. A greatly joyed Pandu and Kunti get three children Yudhishthir, Bheem and Arjun from the Yama ( God of death and justice ), Vayu ( God of wind) , Indra ( Head of Gods ) respectively. Later Pandu asks for few more children for which Kunti refuses stating dharma so instead Kunti teaches the mantra to Matiri and hence Matiri gets twins from the Ashwini Kumars. After the death of Pandu and Matiri , the five of children and Kunti move to Hastinapur. ==Rivalry with cousins== The Kauravas, paternal cousins of the Pandavas engage in fierce rivalry with the Pandavas which is further stimulated when the eldest of Kauravas, Duryodhana tries to kill Bheem with the help of his maternal uncle Shakuni. The princes grow up with continued rivalry which ends up as a power struggle for the throne. The Kauravas try to kill the Pandavas several times. Meanwhile all five brothers marry the princess of Panchala, Draupadi due to a series of complications. The Kingdom of Hastinapur is split between the cousins in order to put an end to their fight. But the Pandavas strengthen up their kingdom enormously with the help of Krishna considered an incarnation of Lord Vishnu and their maternal cousin. This triggers the Kauravas who win the kingdom of Pandavas treacherously through a game of dice and also insult their wife Draupadi by trying to remove off her saree which is prevented by the divine grace of Krishna. The scandal prompts the King of Hastinapur and father of the Kauravas, Dhritarashtra, to grant the Pandavas the right to get back their kingdom after 12 years of life in forest and one year of undercover during which they must not be identified by anyone. Despite trouble from the Kauravas the Pandavas successfully complete the mission but the Kauravas refuse to give back their kingdom. The refusal results in a war which is finally won by the Pandavas after a lot of casualities and help from Krishna. ==Rule== After the war the eldest of the Pandavas, Yudhishthir, ascends the throne and rules the kingdom with dharma and virtue. The Pandavas then name the grandson of Arjun, Pareekshit , via his son Abhimanyu as their heir and retire off to face the end of their lives. ==Death== The Pandavas decide the ascend heaven directly from the mortal world after a tiring and hard walk to Mount Kailash. Everyone except Yudhishthir die along the way while Yudhishthir successfully reaches heaven in his mortal form. Category:Mahabharata",
 "title": "Pandava"
}