{
 "id": "1134060",
 "text": "Bandar Tasik Selatan (Malay for \"South Lake City\") is a township in Sungai Besi, Kuala Lumpur, Malaysia. Established in 1991, Bandar Tasik Selatan is well-known for its strategic location and integrated transportation facilities. == Transportation == Bandar Tasik Selatan is a notable hub for public transportation in Kuala Lumpur. The Bandar Tasik Selatan railway station serves as a major rail interchange station that connects several different rail services: * KTM Komuter: A commuter train service that provides connectivity to various parts of Klang Valley and beyond. * LRT (Light Rail Transit): Part of the rapid transit system in Kuala Lumpur, the LRT service at Bandar Tasik Selatan is on the Sri Petaling Line. * KLIA Transit: An airport express service that connects the city center to the Kuala Lumpur International Airport (KLIA). The station's integration of various rail lines provides convenient access for commuters to the city center, surrounding suburbs, and other key destinations. === Terminal Bersepadu Selatan (TBS) === The Terminal Bersepadu Selatan (TBS) is a major bus terminal located adjacent to the Bandar Tasik Selatan railway station. It serves as one of the key intercity bus terminals in Kuala Lumpur, connecting to various parts of Peninsular Malaysia. TBS is known for its modern facilities and offers a range of amenities for travelers, including food courts, shops, ticketing counters, and waiting areas. == Bus Services == Bandar Tasik Selatan is also served by several bus routes that connect to nearby areas: * T410: Bandar Tasik Selatan station - MRT Taman Connaught * 581: Desa Tasik - Hospital Universiti Kebangsaan Malaysia (HUKM) via Bandar Tasik Selatan station - Desa Tasik == Related pages == * List of Kuala Lumpur bus stations * Public transport in Kuala Lumpur == References == == Other websites == * MyRapid official website * KTM Berhad official website Category:1991 establishments in Asia",
 "title": "Bandar Tasik Selatan"
}