{
 "id": "1134708",
 "text": "The **Euclidean plane** is a two-dimensional Euclidean space, denoted as \\\\( E^2 \\\\) or \\\\( \\mathbb{E}^2 \\\\). It is a geometric space where two real numbers are required to specify the position of each point. The Euclidean plane is characterized by properties such as parallel lines, distances (allowing for the definition of circles), and angle measurement. == History == The Euclidean plane is a fundamental concept in Euclidean geometry, as introduced by the ancient Greek mathematician Euclid in his work, Elements. Euclid's geometry dealt extensively with two-dimensional shapes, developing theorems related to similarity, the Pythagorean theorem, parallelism, and the sum of angles in a triangle. The concept of the plane was further developed with the introduction of the Cartesian coordinate system by René Descartes and Pierre de Fermat in 1637. In this system, each point on the plane is represented by a pair of numerical coordinates corresponding to signed distances from two fixed perpendicular lines called the x-axis and y-axis, which intersect at the origin. == Cartesian Plane == A Cartesian plane is a Euclidean plane equipped with a Cartesian coordinate system. The set \\\\( \\mathbb{R}^2 \\\\) of ordered pairs of real numbers, equipped with the dot product, is commonly called the Euclidean plane or the standard Euclidean plane, as every Euclidean plane is isomorphic to it. In this context, every point can be uniquely determined by a pair of coordinates \\\\((x, y)\\\\). == Polar Coordinates == Another widely used coordinate system on the Euclidean plane is the polar coordinate system, where a point is specified by its distance from a fixed origin and its angle relative to a reference direction. This system is particularly useful in cases involving symmetry around a central point. == Complex Plane == The complex plane extends the idea of the Euclidean plane by associating each point with a complex number, combining real and imaginary components. It is often used to visualize functions in complex analysis and is also referred to as the Argand plane, named after Jean-Robert Argand. Argand diagrams are graphical representations of complex numbers and are commonly used to plot functions' poles and zeroes. == Applications == The Euclidean plane serves as the foundation for many areas of mathematics, including analytic geometry, where it is used to describe geometric shapes and their properties using algebraic equations. It is also crucial in fields such as physics, engineering, computer graphics, and navigation. == References == * Euclid's Elements, Books I-IV, VI. * Descartes, R., La Géométrie (1637). * Argand, J.-R., and Wessel, C., on the complex plane and Argand diagrams. Category:Geometry",
 "title": "Euclidean plane"
}