{
 "id": "1134776",
 "text": "Ajatashatru (Pāli: Ajātasattu; Sanskrit: Ajātaśatru), also known as Kunika (Kūṇika) and Kuniya (Kūṇiya) in Jain traditions, was a prominent king of the Haryanka dynasty of Magadha in ancient India. His reign is estimated to be around 492 to 460 BCE, or 405 to 373 BCE, depending on different historical sources. He was the son of King Bimbisara and is a significant figure in both Buddhist and Jain traditions. Ajatashatru is known for his conquests, including the war against the Vajjika League led by the Licchavis, and his role in the formation of the city of Pataliputra. == Early Life and Birth == Ajatashatru was born to King Bimbisara and Queen Chellana according to Jain traditions, while Buddhist accounts name his mother as Kosala Devi. Both traditions refer to his mother as \"Vaidehi.\" During her pregnancy, it is said that Queen Chellana desired to eat the fried flesh of her husband's heart and drink liquor. Prince Abhayakumara, son of Bimbisara and Queen Nanda, deceived her with a wild fruit that resembled a heart. Feeling ashamed of her desire, the queen feared that her son might grow up to be dangerous for the family. Shortly after Ajatashatru's birth, he was thrown out of the palace, where he was bitten on the little finger by a cock near a garbage dump. King Bimbisara discovered this and, showing his affection, sucked the wound until it healed, earning Ajatashatru the nickname Kunika (\"Sore Finger\"). == War and Conquest == Ajatashatru was known for his military prowess and strategic acumen. His reign saw multiple military campaigns aimed at expanding Magadha's territory. After capturing Vaishali, he fortified a village that later developed into the city of Pataliputra, which became a prominent capital in ancient India. He also fought a war against the King of Kosala. The conflict was triggered when his brothers, who were at odds with him, fled to Kashi. Kashi had been given to Bimbisara as dowry, and its control was contested, leading to the war between Magadha and Kosala. Ajatashatru emerged victorious, annexing Kashi and further strengthening his kingdom. == Religious Significance == Ajatashatru is a significant figure in both Buddhist and Jain traditions. He is known to have interacted with Gautama Buddha and Mahavira, the 24th Tirthankara of Jainism. The Samaññaphala Sutta mentions that Ajatashatru visited six different teachers, including the Buddha, to hear their doctrines. His reign coincided with a period of significant religious activity in the region, which saw the growth and spread of both Buddhism and Jainism. == Dating and Historical Sources == Dating Ajatashatru's reign varies among scholars. Arthur Llewellyn Basham dated his accession to 491 BCE based on the correlation with the dates of the Mahāvaṃsa and estimates the Buddha's death around 483 BCE. Basham places Ajatashatru's first campaign in 485 BCE and the second campaign against the Vajjika League in 481–480 BCE. However, historian K. T. S. Sarao estimates the Buddha's lifespan as c. 477 to 397 BCE, with Ajatashatru's reign from c. 405 to 373 BCE. == Jain Tradition == In Jain narratives, Ajatashatru is also referred to as Kunika. One famous story involves Queen Padmavati, Ajatashatru's wife, who, while sitting in her balcony, saw Halla and Vihalla Kumara with their wives riding an elephant and wearing a divine necklace. A maidservant's comment that these princes enjoyed the real pleasures of the kingdom provoked her desire to possess both the jewels, further illustrating the intrigues and personal dynamics of his court. == Legacy == Ajatashatru's conquests and policies laid the foundation for Magadha's future dominance in northern India, eventually leading to the rise of the Mauryan Empire. His strategic use of fortification and military innovations contributed to his kingdom's strength and influence. His interactions with significant religious figures of his time also reflect the complex interplay between politics and religion in ancient India. == References == Category:History of India",
 "title": "Ajatashatru"
}