{
 "id": "1134961",
 "text": "Pinkwashing, also known as rainbow-washing, is the strategy of using messages that are superficially nice to the LGBTQ community for things that have little or nothing to do with LGBTQ equality or inclusion. == Origin of the term == In April 2010, Queers Undermining Israeli Terrorism (QUIT) in the Bay Area, used the phrase pinkwashing as a twist on greenwashing, a practice where companies claim to be eco-friendly in order to make profit. Dunya Alwan was at a talk with Ali Abunimah, editor of Electronic Intifada in 2010, when he said \"We won't put up with Israel whitewashing or greenwashing\" and she thought, \"or pinkwashing!\" == Corporate marketing == Pinkwashing in the United States, according to author Stephan Dahl from the University of Hull, is centered around pride merchandise created and sold by companies that do nothing for queer people. == By country or region == === Israel === thumb|center| Anarcho- queer collective Mashpritzot hold a protest against Israeli pinkwashing. ==== Ireland ==== According to Professor of Gender and Women's Studies Eithne Luibhéid, Ireland used its 2015 same-sex marriage referendum, \"to pinkwash its migration regimes, thereby naturalizing harsh policies that reproduce gendered, sexual, racial, economic, and geopolitical inequalities\". == Intersex movement == In June 2016, pointed to contradictory statements by Australian governments, suggesting that the dignity and rights of LGBT and intersex people are recognized while harmful practices on intersex children continued. In August 2016, described actions to promote equality or civil status legislation without action on banning \"intersex genital mutilations\" as a form of pinkwashing. The organization has previously pointed out government statements to UN Treaty Bodies that conflate intersex, transgender, and other LGBTI issues, instead of addressing harmful practices on infants. == Related pages == * Queerbaiting * Rainbow capitalism == References == Category:Neologisms Category:terminology Category:Public relations Category:Propaganda Category:LGBT-related controversies Category:Pages with unreviewed translations Category:Public diplomacy of Israel",
 "title": "Pinkwashing (LGBTQ)"
}