{
 "id": "1134226",
 "text": "Jessica Rae Springsteen (born December 30, 1991) is an American equestrian. She is a show jumping champion rider who has represented the United States Equestrian Team in a competition. She won a silver medal in the Team jumping at the 2020 Summer Olympics held in 2021 in Tokyo. == Early life == Jessica Rae Springsteen was born on December 30, 1991. She was the second child and only daughter of musicians Bruce Springsteen and Patti Scialfa. She has one older brother and one younger brother. When she and her brothers were in school in the early 1990s, their parents left Los Angeles with them to have a family in a non-paparazzi place. The family had and lived on a horse farm in Colts Neck Township, New Jersey. Springsteen went to the Rumson Country Day School and Ranney School in New Jersey. She earned an undergraduate degree from Duke University in 2014. She also did some modeling. Later, she was named the equestrian ambassador for Gucci. == Career == Springsteen has been riding since she was four years old. There were horses in the Springsteen family's 300-acre Stone Hill Farm in Colts Neck, New Jersey. She got her first pony when she was six years old. She won the 2009 George H. Morris Excellence in Equitation Championship.In 2014, she won the American Gold Cup. In 2016, she won her first five-star Grand Prix jumping competition with her horse Cynar VA. She used to train with Frank and Stacia Klein Madden. Later, she trained with Laura Kraut from 2010 to 2015. Since 2015, she trains with Edwina Tops- Alexander. In 2021, Springsteen was chosen in the US team to compete in Equestrian at the 2020 Summer Olympics. It had been cancelled for a while due to the COVID-19 pandemic. == Gallery == File:Pfingstturnier-2013-Jessica- Springsteen.jpg|Springsteen on Zero at Wiesbaden, 2013 File:Hessischen_Ministerpräsidenten_Jessica_Springsteen_auf_Vindicat_W_2_mk.jpg|Springsteen on Vindicat W at Wiesbaden, 2013 == Related pages == * Equestrianism * Horse * Pony == References == == Other websites == * * Jessica Springsteen at US Equestrian * Category:21st-century American people Category:1991 births Category:American equestrians Category:Bruce Springsteen Category:Living people Category:Medalists at the 2020 Summer Olympics Category:Olympic silver medalists for the United States Category:American show jumping riders Category:Sportspeople from Los Angeles Category:Olympic equestrians for the United States",
 "title": "Jessica Springsteen"
}