{
 "id": "113402",
 "text": "The 1994–95 NHL season was the 78th regular season of the National Hockey League. Twenty-six teams each played 48 games, a shortened season, due to a lockout of the players by the owners. For the first time since the 1969–70 NHL season, no team averaged more than four goals scored per game. A total of 60 shutouts happened in the 624 regular-season games. The New Jersey Devils won the Stanley Cup in a four-game sweep of the Detroit Red Wings. An unusually high number of shorthanded goals (28) were scored in the 81 playoff games of 1995. In addition, 7 hat-tricks were recorded in the 1995 Playoffs. ==Regular season== The shortened season ended much later than usual. For the first and, as of 2007, the only time in NHL history, the Stanley Cup Finals concluded after the Summer Solstice. Despite the late end to the playoffs, only 79 total playoff games were held, the lowest number to date under the \"16 wins\" playoff format. ===Final standings=== Note: W = Wins, L = Losses, T = Ties, GF= Goals For, GA = Goals Against, Pts = Points ====Eastern Conference==== Northeast Division GP W L T GF GA Pts Quebec Nordiques 48 30 13 5 185 134 65 Pittsburgh Penguins 48 29 16 3 181 158 61 Boston Bruins 48 27 18 3 150 127 57 Buffalo Sabres 48 22 19 7 130 119 51 Hartford Whalers 48 19 24 5 127 141 43 Montreal Canadiens 48 18 23 7 125 148 43 Ottawa Senators 48 9 34 5 117 174 23 Atlantic Division GP W L T GF GA Pts Philadelphia Flyers 48 28 16 4 150 132 60 New Jersey Devils 48 22 18 8 136 121 52 Washington Capitals 48 22 18 8 136 120 52 New York Rangers 48 22 23 3 139 134 47 Florida Panthers 48 20 22 6 115 127 46 Tampa Bay Lightning 48 17 28 3 120 144 37 New York Islanders 48 15 28 5 126 158 35 ====Western Conference==== Central Division GP W L T GF GA Pts Detroit Red Wings 48 33 11 4 180 117 70 St. Louis Blues 48 28 15 5 178 135 61 Chicago Blackhawks 48 24 19 5 156 115 53 Toronto Maple Leafs 48 21 19 8 135 146 50 Dallas Stars 48 17 23 8 136 135 42 Winnipeg Jets 48 16 25 7 157 177 39 Pacific Division GP W L T GF GA Pts Calgary Flames 48 24 17 7 163 135 55 Vancouver Canucks 48 18 18 12 153 148 48 San Jose Sharks 48 19 25 4 129 161 42 Los Angeles Kings 48 16 23 9 142 174 41 Edmonton Oilers 48 17 27 4 136 183 38 Mighty Ducks of Anaheim 48 16 27 5 125 164 37 ===Scoring leaders=== Note: GP = Games Played, G = Goals, A = Assists, Pts = Points Player Team GP G A PTS Jaromir Jagr Pittsburgh 48 32 38 70 Eric Lindros Philadelphia 46 29 41 70 Alexei Zhamnov Winnipeg 48 30 35 65 Joe Sakic Quebec 47 19 43 62 Ron Francis Pittsburgh 44 11 48 59 Theoren Fleury Calgary 47 29 29 58 Paul Coffey Detroit 45 14 44 58 Mikael Renberg Philadelphia 47 26 31 57 John LeClair Montreal/ Philadelphia 46 26 28 54 Mark Messier NY Rangers 46 14 39 53 ==Stanley Cup playoffs== ===Conference quarterfinals=== ====Eastern Conference==== {| cellpadding=\"3\" border=\"1\" Quebec vs. NY Rangers Date Away Home May 6 NY Rangers 4 5 Quebec May 8 NY Rangers 8 3 Quebec May 10 Quebec 3 4 NY Rangers May 12 Quebec 2 3 NY Rangers OT May 14 NY Rangers 2 4 Quebec May 16 Quebec 2 4 NY Rangers NY Rangers wins series 4–2 ====Western Conference==== {| cellpadding=\"3\" border=\"1\" Detroit vs. Dallas Date Away Home May 7 Dallas 3 4 Detroit May 9 Dallas 1 4 Detroit May 11 Detroit 5 1 Dallas May 14 Detroit 1 4 Dallas May 15 Dallas 1 3 Detroit Detroit wins series 4–1 ===Conference semifinals=== Eastern Conference {| cellpadding=\"3\" border=\"1\" Pittsburgh vs. New Jersey Date Away Home May 20 New Jersey 2 3 Pittsburgh May 22 New Jersey 4 2 Pittsburgh May 24 Pittsburgh 1 5 New Jersey May 26 Pittsburgh 1 2 New Jersey OT May 28 New Jersey 4 1 Pittsburgh New Jersey win series 4–1 Western Conference {| cellpadding=\"3\" border=\"1\" Detroit vs. San Jose Date Away Home May 21 San Jose 0 6 Detroit May 23 San Jose 2 6 Detroit May 25 Detroit 6 2 San Jose May 27 Detroit 6 2 San Jose Detroit wins series 4–0 ===Conference finals=== {| cellpadding=\"3\" border=\"1\" Philadelphia vs. New Jersey Date Away Home June 3 New Jersey 4 1 Philadelphia June 5 New Jersey 5 2 Philadelphia June 7 Philadelphia 3 2 New Jersey OT June 10 Philadelphia 4 2 New Jersey June 11 New Jersey 3 2 Philadelphia June 13 Philadelphia 2 4 New Jersey New Jersey wins series 4–2 and Prince of Wales Trophy ===Finals=== Detroit Red Wings vs. New Jersey Devils Date Away Score Home Score Notes June 17 New Jersey 2 Detroit 1 June 20 New Jersey 4 Detroit 2 June 22 Detroit 2 New Jersey 5 June 24 Detroit 2 New Jersey 5 New Jersey wins series 4–0 and Stanley Cup Claude Lemieux (New Jersey) wins Conn Smythe Trophy ===Scoring leaders=== Note: GP = Games Played, G = Goals, A = Assists, Pts = Points Player Team GP G A Pts Sergei Fedorov Detroit 17 7 17 24 Stephane Richer New Jersey 19 6 15 21 Neal Broten New Jersey 20 7 12 19 Ron Francis Pittsburgh 12 6 13 19 Denis Savard Chicago 16 7 11 18 Paul Coffey Detroit 18 6 12 18 John MacLean New Jersey 20 5 13 18 Claude Lemieux New Jersey 20 13 3 16 Vyacheslav Kozlov Detroit 18 9 7 16 Nicklas Lidstrom Detroit 18 4 12 16 ==NHL Awards== The NHL Awards presentation took place on July 6, 1995. Presidents' Trophy: Detroit Red Wings Prince of Wales Trophy: New Jersey Devils Clarence S. Campbell Bowl: Detroit Red Wings Art Ross Memorial Trophy: Jaromir Jagr, Pittsburgh Penguins Bill Masterton Memorial Trophy: Pat LaFontaine, Buffalo Sabres Calder Memorial Trophy: Peter Forsberg, Quebec Nordiques Conn Smythe Trophy: Claude Lemieux, New Jersey Devils Frank J. Selke Trophy: Ron Francis, Pittsburgh Penguins Hart Memorial Trophy: Eric Lindros, Philadelphia Flyers Jack Adams Award: Marc Crawford, Quebec Nordiques James Norris Memorial Trophy: Paul Coffey, Detroit Red Wings King Clancy Memorial Trophy: Joe Nieuwendyk, Calgary Flames Lady Byng Memorial Trophy: Ron Francis, Pittsburgh Penguins Lester B. Pearson Award: Eric Lindros, Philadelphia Flyers NHL Plus/Minus Award: Ron Francis, Pittsburgh Penguins Vezina Trophy: Dominik Hasek, Buffalo Sabres William M. Jennings Trophy: Ed Belfour, Chicago Blackhawks Lester Patrick Trophy: Joe Mullen, Brian Mullen, Bob Fleming ===All-Star teams=== First Team Position Second Team Dominik Hasek, Buffalo Sabres G Ed Belfour, Chicago Blackhawks Paul Coffey, Detroit Red Wings D Ray Bourque, Boston Bruins Chris Chelios, Chicago Blackhawks D Larry Murphy, Pittsburgh Penguins Eric Lindros, Philadelphia Flyers C Alexei Zhamnov, Winnipeg Jets Jaromir Jagr, Pittsburgh Penguins RW Theoren Fleury, Calgary Flames John LeClair, Montreal/Philadelphia LW Keith Tkachuk, Winnipeg Jets ==First games== The following is a list of players of note who played their first NHL game in 1994–95 (listed with their first team, stars(*) mark debut in playoffs): *Paul Kariya, Mighty Ducks of Anaheim *Manny Fernandez, Dallas Stars *Ryan Smyth, Edmonton Oilers *Adam Deadmarsh, Quebec Nordiques *Peter Forsberg, Quebec Nordiques *Sergei Gonchar, Washington Capitals ==Last games== The following is a list of players of note that played their last game in the NHL in 1994–95 (listed with their last team): *Mats Naslund, Boston Bruins *Mark Howe, Detroit Red Wings *Peter Stastny, St. Louis Blues *Rich Sutter, Toronto Maple Leafs ==1995 Trading Deadline== * Trading Deadline: APRIL 7, 1995 http://www.habsinsideout.com/main/3969 *April 7, 1995: D Petr Svoboda traded from Buffalo to Philadelphia for D Garry Galley. *April 7, 1995: C Troy Murray and D Norm Maciver traded from Ottawa to Pittsburgh for RW Martin Straka. *April 7, 1995: D Gord Kruppke traded from Toronto to Detroit for other considerations. *April 7, 1995: RW Russ Courtnall traded from Dallas to Vancouver for LW Greg Adams and RW Dan Kesa and Vancouver's 5th round pick in 1995 Entry Draft. *April 7, 1995: G Corey Hirsch traded from New York Rangers to Vancouver for C Nathan Lafayette. *April 7, 1995: D Gerald Diduck traded from Vancouver to Chicago for RW Bogdan Savenko and Hartford's 3rd round pick in 1995 Entry Draft (previously acquired). *April 7, 1995: G Rick Tabaracci traded from Washington to Calgary for a conditional 5th round draft pick. *April 7, 1995: LW Gaetan Duchesne traded from San Jose to Florida for Florida's 6th round pick in 1995 Entry Draft. *April 7, 1995: G Craig Billington traded from Ottawa to Boston for other considerations. *April 7, 1995: LW Bill Huard traded from Ottawa to Quebec for D Mika Stromberg and Quebec's 4th round pick in 1995 Entry Draft. *April 7, 1995: D Daniel Laperriere and St. Louis' 9th round pick in 1995 Entry Draft traded from St. Louis to Ottawa for Ottawa's 9th round pick in 1995 Entry Draft. *April 7, 1995: RW Roman Oksiuta traded from Edmonton to Vancouver for D Jiri Slegr. *April 7, 1995: LW Alan May traded from Dallas to Calgary for Calgary's 8th round pick in 1995 Entry Draft. *April 7, 1995: C Mike Eastwood and Toronto's 3rd round pick in 1995 Entry Draft traded from Toronto to Winnipeg for RW Tie Domi. *April 7, 1995: D Grant Jennings traded from Pittsburgh to Toronto for D Drake Berehowsky. *April 7, 1995: D Igor Ulanov and C Mike Eagles traded from Winnipeg to Washington for Washington's 3rd and 5th round draft picks in 1995 Entry Draft. *April 7, 1995: LW Scott Pearson traded from Edmonton to Buffalo for D Ken Sutton. *April 7, 1995: D Greg Brown traded from Pittsburgh to Winnipeg for a conditional 8th round draft pick in 1996 Entry Draft. *April 7, 1995: C Ed Olczyk traded from NY Rangers to Winnipeg for Winnipeg's 5th round pick in 1995 Entry Draft. *April 5, 1995 - Montreal Canadiens obtain Pierre Turgeon and Vladimir Malakhov from the New York Islanders for Kirk Muller, Mathieu Schneider and Craig Darby. ==References== ==Other websites== *Hockey Database *NHL.com Category:National Hockey League seasons",
 "title": "1994–95 NHL season"
}