{
 "id": "1135827",
 "text": "Sonia Ritter (born 20 July 1958) is an English actress, theatre director and practitioner, and teacher. She is known for portraying Doreen 'Dor' Coleman in the BBC One soap opera EastEnders. == Early life == Sonia Ritter was born in Surrey Northern, Surrey, England in 20 July 1958, as the younger child to Hans Wolfgang Ritter and Madeleine Gwen (née Arnup). She has an elder sister, Phyllida. Ritter attended the University of Birmingham; graduating in 1979. She studied at Bristol Old Vic; graduating in 1981. == Career == Ritter has worked as an actress since August 1981. She began her career in theatre. Ritter made her television debut on 29 August 1989, with the role of Charlie on the final episode of the ITV crime drama series Hard Cases. She has appeared in The Bill, Casualty, Performance, Doctors, Dickens, Holby City, Silk, and Requiem. Ritter has appeared in three roles on the BBC One soap opera EastEnders. Her first appearance was as a welfare office in 1995. She then portrayed a registrar during the first part of the New Year's Eve 1999 episodes. She portrayed Doreen 'Dor' Coleman, a prison friend of Chrissie Watts (Tracy-Ann Oberman) and later the cellmate of Sharon Watts (Letitia Dean), who was imprisoned for shoplifting, for five episodes in September 2024. Ritter has previously worked at Coventry University. She has works as a creative coordinator at the Lions part since 1995. She has worked as a tutor at the East 15 Acting School in Loughton, Essex since 2010. == Filmography == Year Title Role Notes Ref. 1989 Hard Cases Charlie Episode: \"Episode #2.7\" 1990, 1994, 1996, 2008 The Bill Sharon Sharp, Sadie Hanson, Sharon Morris, Yvonne McGuire Episode(s): \"Addresses\" (series six), \"Ways and Means\" (series 10), \"Butting In\" (series 12), \"Unnecessary Heroics; Part One – Demolition Girl\" (series 24) 1991 Sex and the Censors Actress Original title: Banned; Television special 1991, 2001 Casualty Beverley Atkinson, Tracey Yorath Episode(s): \"Making the Break\" (series six), \"Allied Forces\" (series 15) 1992 Performance Helene Episode: \"A Doll's House\" 1994 The Chief Det. Insp. Patricia Hynde Episode: \"Episode #4.9\" 1995, 1999, 2024 EastEnders Welfare Officer, Registrar, Doreen 'Dor' Coleman Episode(s): \"Episode #1.1179\", \"New Year's Eve 1999: Part 1\", \"Episode #1.6975\", \"Episode #1.6976\", \"Episode #1.6977\", \"Episode #1.6978\", \"Episode #1.6979\" 1997 Bramwell Mrs. Loach Episode: \"Episode #3.6\" 1997 A Dance to the Music of Time Ada Episode: \"Post War\" 1997 Oscar and Lucinda Fanny Drabble 1998, 2001 Peak Practice Margaret Bannerman, Sally Spinx Episode(s): \"The Ghost in the Machine\" (series six), \"Bald Retribution\" (series 12) 1998 Touched Angela Short film 2000, 2005, 2007, 2018 Doctors Karen, Vicky Preston, Susan Hillier Episode(s): \"With Friends Like This\" (series one), \"My Own Flesh and Blood\" (series six), \"Lost Boys\" (series eight), \"Desperately Seeking Susan\" (series 19) 2002 Dickens Former prostitute Episode: \"Blazing Away\" 2002, 2006 Holby City Amanda Cummings, Sue Breen Episode(s): \"Repercussions\" (series five), \"Crossing the Line\" (series nine) 2003 Murder Investigation Team Mrs. Small Episode: \"Reading, Writing and Gangbanging\" 2003 Sylvia Midwife 2005 Murder in Suburbia Christine Archer Episode: \"Dogs\" 2012 Silk Mrs Rivers Episode: \"The House of Ill Repute\" 2015 Arthur & George Miriam Bostock Episode(s): \"Episode #1.2\", \"Episode #1.3\" 2016 The Five Carol Episode: \"Episode #1.9\" 2018 Requiem Kath Episode(s): \"The Blue Room\", \"The Necklace\", \"Bessie\" == References == Category:1958 births Category:Living people",
 "title": "Sonia Ritter"
}