{
 "id": "1135629",
 "text": "The Israel–Palestine conflict has been there for a long time, at least since the creation of Israel in the 1940s. The population in the region is very young. Children and teenagers have been affected by the conflict in many ways: * Very often, they were victims; the hostilities led to them being displaced, injured, or killed. Their homes or schools were often affected. As with any war, as civilians they have been victims of violence. * Sometimes, militant groups used them as suicide bombers. * Both parties accuse each other of using children and teenagers as fighters. Such fighters can be classified as child soldiers. Recruiting chidren for regular armed forces is against international law. * Sometimes Palestinian children and adolescents protested against Israeli occupation. Some of them were arrested. * There have been human rights abuses, where children and adolsecents were affected. Such violence has a lasting psychological impact on children. It causes trauma and PTSD. International organizations, including the UN and Human Rights Watch are worried about the way in which children are treated in the conflict. These organizations have called both sides to adhere to intenational conventions on the rights of children. During the Israel–Hamas war, the United Nations added the Israeli Defense Forces to a list of offenders who fail to protect children. According to B'tselem's calculations, as of 2021, some 2,171 Palestinian children have been killed in the last two decades by Israeli forces.Gideon Levy 'A Brief History of Killing Children,' Haaretz, 20 November 2021.'Killing of Minors,' B'tselem 2021. 139 Israeli children have been killed by Palestinian forces. Save the Children has estimated that up to 21,000 children have gone missing from the Gaza Strip between October 2023 to June 2024.Gaza's Missing Children: Over 20,000 children estimated to be lost, disappeared, detained, buried under the rubble or in mass graves,' Save the Children 24 June 2024. Efforts have been made to address the conflict's impact on children. There have been different peace projects involving youth from both sides. These initiatives aim to foster understanding, reconciliation, and dialogue, emphasizing education and shared experiences. Despite these efforts, the ongoing conflict continues to significantly affect the lives of children in both Israeli and Palestinian societies. == References == category:Israel–Palestine conflict Category:7 October attacks Category:Israel Defense Forces",
 "title": "Children and teenagers in the Israel–Palestine conflict"
}