{
 "id": "1135289",
 "text": "{{Infobox settlement | name = Yerbas Buenas | native_name = | native_name_lang = es | settlement_type = Town and Commune | imagesize = 175px | image_alt = | image_caption = | image_flag = Bandera Yerbas Buenas.svg | flag_alt = Flag | image_shield = | shield_alt = Coat of arms | image_map = Comuna de Yerbas Buenas.svg | map_alt = Location of the Yerbas Buenas commune in the Maule Region | map_caption = Location of the Yerbas Buenas commune in the Maule Region | pushpin_map = Chile | pushpin_map_narrow = yes | pushpin_label_position = bottom | pushpin_map_alt = Location in Chile | pushpin_map_caption = Location in Chile | coordinates = | coor_pinpoint = city | coordinates_footnotes = | subdivision_type = Country | subdivision_name = Chile | subdivision_type1 = Region | subdivision_name1 = Maule | subdivision_type2 = Province | subdivision_name2 = Linares | established_title = Founded | established_date = 1744 | founder = | named_for = | seat_type = <\\--Capital--> | seat = | government_footnotes = | government_type = Municipality | leader_title = Mayor | leader_party = | leader_name = Jonathan Norambuena | unit_pref = Metric | area_footnotes = | area_total_km2 = 262.1 | area_rank = | elevation_footnotes = | elevation_m = 136 | population_footnotes = | population_total = 16738 | population_as_of = 2012 Census | population_density_km2 = auto | population_rank = | population_blank1_title = Urban | population_blank1 = 1595 | population_blank2_title = Rural | population_blank2 = 14539 | population_demonym = Yerbabuenino | demographics_type1 = Sex | demographics1_footnotes = | demographics1_title1 = Men | demographics1_info1 = 8,380 | demographics1_title2 = Women | demographics1_info2 = 7,754 | timezone = CLT | utc_offset = -4 | timezone_DST = CLST | utc_offset_DST = -3 | postal_code_type = | postal_code = 3600000 | area_code_type = | area_code = 56 + 73 | website = Official website | footnotes = }} Yerbas Buenas is a Chilean commune in the Province of Linares, in the central zone of Chile, belonging to the Maule Region, and the town that serves as the capital of the commune, located 12 kilometers northeast of the city of Linares, the provincial capital. It has a very outstanding architectural and historical heritage and is a true example of a Chilean colonial rural village, preserving the atmosphere of that time and enriching the cultural heritage of the province, the region and the country. The commune, one of the smallest in the region, has 262 km² and is located entirely within the intermediate depression. It borders to the north with San Clemente (Talca Province); to the south, with Linares; to the west, with Villa Alegre and San Javier, and to the east, with Colbún. Together with the communes of Cauquenes, Chanco, Colbún, Linares, Longaví, Parral, Pelluhue, Retiro, San Javier, Villa Alegre, it integrates the 18th district (deputies), and the 9th District (senators) that covers the entire Maule Region. == Demographics == The commune of Yerbas Buenas covers an area of 262.1 km² and a population of 16,134 inhabitants (INE census 2002), corresponding to 1.61% of the total population of the region and a density of 61.56 inhabitants/km². Of the total population, 7,754 are women (48.06%) and 8,380 are men (51.94%). 90.11% (14,539 inhabitants) corresponds to the rural population, and 9.89% (1,595 inhabitants) corresponds to the urban population. It is one of the communes that grew the most in the province between the 1992 and 2002 censuses. This is partly due to its proximity to the provincial capital, of which the southernmost sector of the Yerbas Buenas commune is becoming a suburb, favoured by more affluent groups of residents. Another demographic attraction is the northern end of the commune, but for another reason: the location there of the CMPC Cartulinas Maule industry. == History == Yerbas Buenas was formed with the construction of its first church in 1785 and families began to build their homes around it. On April 27, 1813, Yerbas Buenas stands out in the history of the country, as it is here that the event that marks the beginning of Chile's independence occurred: \"The Surprise of Yerbas Buenas\", a battle in which a significant part of the Royalist Army and a handful of Patriots faced each other for the first time. Around 1835, the incipient village of Yerbas Buenas, with only 6 houses built around the church, was hit by an earthquake that completely destroyed its buildings. Only the house of the Contreras family was saved, which remains standing today and houses the current Historical Museum. After this great earthquake, the village took on the character of a town, with the arrival of new families such as the Astete, Muñoz Olave, Bobadilla, Ferrada, etc., who were the driving forces and precursors of a new era. Thanks to the work of the architect and parish priest in charge of the village, Don Heráclito Merino, the second church was built between 1886 and 1900. This building, designed by the same priest, was eclectic in style, with Gothic details predominating, becoming one of the most imposing buildings at that time for the town and region. The construction was made up of 2 enormous towers 40 meters high and at the time, it was the second most important ecclesiastical construction after that of Concepción. In 1891, President Jorge Montt promulgated the Decree for the creation of 195 Municipalities throughout Chile, one of them being our beloved Yerbas Buenas. As a Municipality and autonomous Commune, it was established on December 22, 1891, with its founder and first Mayor Don Estanislao Astete Osses. In 1913, the commune celebrated one of the greatest milestones of the time: the Centennial of the Surprise of Yerbas Buenas, with José Miguel Ferrada as mayor at that time. There were great celebrations and the construction of the first railroad that ran through Yerbas Buenas and other surrounding communes began. Around 1925, during the celebration of the month of Mary, another important event for the commune occurred. The magnificent and imposing Church, only 25 years old, was consumed by a devastating fire that started in one of the towers. The Linares Fire Department attended the scene, and upon arrival they found that only the walls of the temple remained, cracked and blackened by fire and smoke. Finally, it is important to mention that the town suffered devastating effects during the earthquake of February 27, 2010, destroying part of the architectural heritage that was located on the main streets of the commune, but over time it has managed to get back on its feet and return to the splendor that has characterized Yerbas Buenas since its beginnings. == Administration == The Mayors of Yerbas Buenas is Jonathan Norambuena. The members of the communal council are the following: * José Parra Parada (UDI) * Rodrigo González Villalobos (RN) * Flavio Hernán Ramos Gutiérrez (PPD) * Cristina Zehender Soto (DC) * Michael Mendez Gonzalez (UDI) * Cristián Patricio Fuentealba Retamal (PR) === Parliamentary Representation === Yerbas Buenas is part of Senatorial District IX and Electoral District 18. It is represented in the Chamber of Deputies of the National Congress by the following deputies: * Gustavo Benavente Vergara (Independent Democratic Union) * Paula Labra Besserer (IND - RN) * Jaime Naranjo Ortiz (Socialist Party of Chile) * Consuelo de Los Ángeles Veloso Ávila (Democratic Revolution) === In the Senate, they are represented by: === * Paulina Vodanovic Rojas (PS) * Juan Antonio Coloma Correa (UDI) * Juan Castro Prieto (IND - RN) * Ximena Rincón González (D) * Rodrigo Galilea Vial (RN) == Economy == In 2018, 179 companies were registered in Yerbas Buenas. The Economic Complexity Index (ECI) in the same year was -0.69, while the economic activities with the highest Revealed Comparative Advantage (RCA) index were Nitrate and Iodine Extraction (949.04), Corn Cultivation (187.29), and Other Food Product Manufacturing (58.98). == Culture == === Yerbabueninos === The commune of Yerbas Buenas has been the birthplace of several famous figures in different fields. Among them are Estanislao Astete Osses, who was the first mayor of Yerbas Buenas, and the diplomat César Correa Barros. In the literary field, the surrealist poet Eduardo Anguita, the poet Max Jara, and the writer Reinaldo Muñoz Olave stand out. In military history, Juan de las Rosas Oliveros, a veteran of the War of the Pacific, stands out. In the religious and architectural fields, José Heráclito Merino Ávila, was a prominent architect and parish priest of the commune. Also mentioned is the royalist brigadier Antonio Pareja, who served as a brigadier of the royalist troops. == Places of Interest == === Yerbas Buenas Historical Museum === The Yerbas Buenas Historical Museum is housed in the oldest and most prestigious building in the town and its surroundings. It is considered the only surviving witness of the dawn of Chile's independence. Its walls are made of adobe, the floor is made of square brick, the ceiling is made of coligüe tied with leather, the beams are exposed, and the roof is made of clay tiles. This was the house where the Spanish general brigadier Antonio Pareja, commander of the royalist army, stayed on the night of April 26, 1813. Pareja's troops and the patriot troops held what was the first important encounter in the Chilean emancipation struggle, known until today as the \"Surprise of Yerbas Buenas\". == See also == * List Mayors of Yerbas Buenas ==References== == Other websites == * Illustrious Municipality of Yerbas Buenas * \"Google maps\": sector of the commune of Yerbas Buenas, with the town of the same name, in the center Category:Maule Region",
 "title": "Yerbas Buenas"
}