{
 "id": "1135679",
 "text": "DJ Abass (born Abass Abayomi Tijani) is a media and entertainment consultant, DJ, and event host based in the United Kingdom. He runs DJAMEDIA, a company that focuses on entertainment and media management. DJ Abass is well-known in the Nigerian and African community in the UK for hosting the TV show Intro and the Big Nigerian Independence Intro Jam events. == Background == DJ Abass was born in London to Kolawole Rasak Tijani and Deborah Kojusola Tijani. He moved to Nigeria with his brother and went to school in Lagos and Baptist High School Port-Harcourt. Later, he studied Political Science at the University of Ado-Ekiti which was then called Ondo State University, but now called Adekunle Ajasin University. He is the first of four children and has two older half- brothers. == Early life and education == DJ Abass, whose real name is Abass Abayomi Tijani, is well-known in the UK entertainment world. He works as a media consultant, broadcaster, and DJ. DJ Abass was born in London to Nigerian parents, Kolawole Rasak Tijani and Deborah Kojusola Tijani. When he was young, he moved to Nigeria, where he went to Mate Nursery and Primary School in Lagos, then Baptist Academy in Obanikoro, Lagos, and Baptist High School in Port-Harcourt. After that, he studied Political Science at the University of Ado-Ekiti. == Early career == DJ Abass started his career in 2000 as one of the people who created the Nigerian DJs Association in the UK. He helped organize concerts that showed off Nigerian DJs, helping to make Nigerian music popular abroad. In 2002, he began managing artists, working with groups like Solek Crew and helping artists like KAS. This made him even more important in promoting Nigerian music and culture in the UK. Besides managing artists, DJ Abass became well-known as a TV host when he started presenting and co- producing the music show Intro Live with DJ Abass on Ben TV. This show gave African music stars, like King Sunny Adé and 2Face Idibia, a chance to perform and be interviewed. DJ Abass also played a big role in organizing Nollywood movie premieres in the UK with his company, DJAMEDIA. His company became one of the best in the African entertainment scene in the UK, managing events and premieres for movies like The Mirror Boy and Anchor Baby. In 2000, DJ Abass co-founded the Nigerian DJs Association UK and organized concerts showcasing top Nigerian DJs. In 2002, he started managing Solek Crew, a popular Nigerian band in the UK, and helped them perform at many events, including The BIG Nigerian Independence Intro Jam and the Nigerian Corner at the Notting Hill Carnival. DJ Abass also mentored KAS and took him on a music trip to Nigeria in 2006. == Television == In 2003, DJ Abass hosted and helped produce a live music show on TV called *Intro Live with DJ Abass*. The show focused only on Nigerian and African music, with live interviews and new music videos. *Intro Live* was a two-hour program created by his good friend Ayo Shonaiya. It was shown on Ben TV (and later OBE TV) and watched across Europe and parts of North Africa. Some famous guests on the show were King Sunny Adé, Chaka Demus & Pliers, D'banj, Nneka, Eldee, 2Face Idibia, P-Square, JJC, Erykah Badu, George Clinton, Brenda Fassie, Ying Yang Twins, Wasiu Ayinde Marshall, Lady Saw, Sir Shina Peters, Werason, Ebenezer Obey and many more. The show led to successful events like The BIG Nigerian Independence Intro Jam, The Intro Summer Jam, and The Intro Christmas Jam. D'banj's first solo performance happened at the 2004 BIG Independence Intro Jam, and soon after, he had his first TV interview on Intro with DJ Abass. == Media and entertainment consultancy == DJ Abass is the boss of DJAMEDIA, a company that helps plan and run big entertainment events and media promotions for Nigerian and African communities in the UK. DJAMEDIA has managed some of the biggest and most important events in the African community, especially Nollywood movie premieres in the UK. Some of the famous movies it has worked on include Fifty, When Love Happens, The First Lady, The Figurine, The Mirror Boy (Mirror Boy), Anchor Baby, Bursting Out, Family on Fire, and Kiss & Tell. DJAMEDIA also organizes football matches with the Super Eagles, concerts, comedy shows like Crack Ya Ribs UK, and nightclub events. == Recognition == Throughout his career, DJ Abass has been praised for his work in entertainment. He won the Entertainment Journalist of the Year award at the Nigerian Music Awards UK in 2006 and the Smade Recognition Award in 2016 for his great work in UK Afrobeats. His efforts have helped make Nigerian music and culture well-known around the world and given African artists a bigger audience. == Awards == * Smade Recognition Award 2016 – 'Outstanding Contribution to UK Afrobeats' * Afrobeats Music Awards 2015 – 'Outstanding contribution to Afrobeats' * African Film Awards 2014 – 'Entertainment Promoter of the Year' * Nelawards Awards 2014 – 'Leadership & Mentoring in the Entertainment Industry' * Beffta Awards 2011 – 'Entertainment Icon of the Year' * The Diamond Special Recognition Awards UK 2011 – \"Entertainment Personality of the Year' * Africa Music Awards 2008\\- 'Club DJ of the Year' * Nigerian Music Awards UK 2006 – 'Entertainment Journalist of the Year' * AEPEG Awards 2006 – 'Outstanding Entertainment Personality of the Year' * Academy of Creative Arts in Nigeria (ACAN) 2006 – Inducted as Honorary Member == Other projects == * UK Nollywood Movie Premieres Organiser * Wazobia Lounge at Africa Olympics Village London, 2012. Media and Entertainment co-ordinator. * Super Eagles vs Black Stars of Ghana International Friendly in London October 2011. Media Consultant. * Kanu Heart Foundation UK Charity Gala 2006. Official DJ * Intro Independence Tou', Napoli Italy, London UK and Dublin Ireland 2005. Co-Producer. * Intro Afro-Hip Hop Jam, Atlanta US 2005. Official DJ * Big Nigerian Independence Intro Jam & Intro Summer Jam series, London UK 2003 – 2005. Co-Producer with Ayo Shonaiya. * Nigeria Corner Notting Hill Carnival London UK 1986–Present. DJ Abass is one of the original members of the popular Nigerian Corner at the Notting Hill Carnival in London, starting in 1986. He has been a co-organizer and the official DJ since 1997 at the Cambridge Gardens site (except for 2007 and 2008 when the site was closed). Since 2009, he has helped bring the Nigerian Corner back to a new site on Adela Road == Personal life == DJ Abass is married to Adenike and has two children, Toby and Tomi. He is a fan of Arsenal F.C., a team his father also supported. == Related pages == * List of Nigerian DJs == References == Category:1968 births Category:Living people Category:Black British people Category:British DJs",
 "title": "DJ Abass"
}