{
 "id": "1135539",
 "text": "The Pala–Kalachuri Conflict also known as Pala–Kalachuri Struggle and Karna's Invasion of Bengal,: \"Karņa's invasion of Bengal has also been alluded to in the Bheraghat inscription of Ahlaņādevi and in the Karanabel inscription of Jayashmia\" was a war between the Pala Empire and the Kalachuris. The conflict was fought between Karna, the successor of King Gangeyadeva of the Kalachuri dynasty of Tripuri, and Nayapala and Vigrahapala, who were the successors of King Mahipala of the Pala Empire.: \"The Pala-Kalachuri conflict took place on a protracted basis under the Kalachuri Gangeyadeva's successor Karna and Mahipala's successors Nayapala (C. AD 1038-55) and Vigrahapala (C. AD 1055-70).\" == Background == Mahipala was the ruler of the Pala Empire. He expanded his rule to Banaras, which is known from his inscription found in Banaras itself. The inscription records Mahipala's involvement in restoring structures in Sarnath. During his reign, Rajendra Chola invaded Bengal. The Cholas defeated the kings of Dandabhukti, Palas, Vanga, and Southern Radha in their invasion of Bengal. This invasion lasted for a short period. However the Palas had more trouble with Gangeyadeva, the king of Kalachuris, than they did with the Cholas. The struggle between the Pala Empire and the Kalachuri Dynasty started due to the control of the Pala Empire over Banaras. The Kalachuris wanted to expand their control into the middle Ganga valley from Tripuri. Since Banaras is along this route, the Kalachuris of Tripuri came into conflict with the Pala Empire. == Conflicts == The control of Banaras appears to have passed from the Pala Empire to the Kalachuris during this time. Mahipala was succeeded by his son Nayapala. The most significant event during the reign of Nayapala was the struggle against the Kalachuri king, Karna. The Kalachuris became the most active enemies of the Pala Empire after the fall of the Gurjara Pratihara Empire. Karna, the son of Kalachuri king Gangeyadeva, brought Kalachuri power to its peak. Numerous kings from northern India, who lived during Karna's time felt the brunt of his strength. Continuing their struggle with the Pala Empire, Karna, the son of Gangeyadeva, invaded the Pala Empire in Gaya during Nayapala's reign. Nayapala was initially defeated by Karna in the invasion, and Karna's troops looted sacred Buddhist institutions of Gaya as they failed to capture the city. They also took a considerable amount of church furniture. However, victory turned to Nayapala, and the army of Magadha i.e. the army of the Palas slaughtered the army of Karna. The forces of the Pala Empire quickly regrouped and inflicted a crushing defeat on the troops of Karna.The conflict between them ultimately ended with a treaty. The battle between Nayapala and Karna took place at the beginning of Nayapala's reign. A brahmin named Sudraka helped Nayapala in fighting against Karna. Nayapala granted Gaya-mandala to the care of his vassal who had assisted him in the battle. After Nayapala, his son Vigrahapala III ascended to the throne. The hostilities between the Pala Empire and the Kalachuris broke out once again during Vigrahapala's reign. During Vigrahapala's reign, Karna launched an invasion of Gauda, but ultimately met defeat and was thoroughly bested by Vigrahapala III. Following his defeat in the final war against the Pala Empire, Karna had to sue for peace. As part of the agreement, Karna gave his daughter in marriage to Vigrahapala III. == Aftermath == The war between the Pala Empire and the Kalachuris ended with a treaty and a matrimonial alliance. After Karna's defeat at the hands of Vigrahapala III in the final war, he had to sue for peace and agreed to give his daughter Yauvanasri in marriage to Vigrahapala III. Vigrahapala III avoided entirely conceding power to his father-in-law. Karna had conquered much of northern India, but suffered defeats later in his rule. The Chalukyas, Paramaras, and Chandellas all defeated Karna in his later years. Facing challenges from the Chalukyas and Paramaras in the South and West, as well as the rising power of the Chandellas, posed a significant threat to Karna's power. It is possible that the matrimonial alliance with Vigrahapala III was for this reason. == List of Conflicts == Name of Conflict Belligerents Belligerents Outcome Karna's Raid on Gaya Pala Empire * Nayapala Kalachuris of Tripuri * Karna Kalachuri Victory * Buddhist Institutions and a considerable amount of church furniture sacked by Karna's troops. Slaughter of Karna's troops Pala Empire * Nayapala Kalachuris of Tripuri * Karna Pala Victory * Army of Karna slaughter by the army of Nayapala. * Treaty established between Nayapala and Karna. Karna's Invasion of Gauda Pala Empire * Vigrahapala III Kalachuris of Tripuri * Karna Pala Victory * Karna sues for peace and agrees to give his daughter in marriage to Vigrahapala III. == Notes == == References == == Bibliography == * * * * * * * * * * Category:Battles involving the Pala Empire",
 "title": "Pala Kalachuri Conflict"
}