{
 "id": "1135757",
 "text": "Omid Madani (Persian:) is an Iranian-American distinguished computer scientist specializing in artificial intelligence (AI) and machine learning. He is known for his contributions to developing and applying learning algorithms to diverse problems spanning information retrieval and network security, as well as the analysis of the computational complexity of planning and control problems in AI. Madani is a lifetime member of the Association for the Advancement of Artificial Intelligence (AAAI) and a member of the Association for Computing Machinery (ACM). == Early life and education == Madani’s family originate from the Dehkuyeh Rural District in Larestan County and the city of Shiraz, in south central Iran. He grew up in Bandar Abbas, Iran, and Dubai (one year after the onset of Iran-Iraq war). He moved to the United States in 1989 to pursue higher education. At Saddleback College, he presented Penrose’s *The Emperor's New Mind*, introducing him to Turing Machines and AI. He earned a B.S. in Computer Science with a Math minor from the University of Houston in 1993 and an M.S. in Computer Science from the University of Washington in 1996, focusing on computational biology under Larry Ruzzo and Richard Karp. He completed his Ph.D. in 2000 at the University of Washington, researching Markov Decision Processes with Steve Hanks and Richard Anderson. After a brief industry stint, he pursued postdoctoral work at the University of Alberta from 2001 to 2003 with Russell Greiner. == Academic career == Madani's recent publications include his 2023 paper on hierarchical concept learning in Frontiers in Computational Neuroscience and his earlier works on many-class online learning, models of active learning, and the computational complexity of decision making. Madani’s early work in machine learning aimed to reduce manual model-building costs, focusing on unsupervised learning inspired by how humans learn without explicit feedback. In 2020, he revisited his 2000s framework, Prediction Games, where systems self-develop hierarchical concepts by improving their predictions. His goal is to enhance these learning systems for applications like computer vision and robotics. From 2003 to 2008, he was a Senior Research Scientist at Yahoo! Research, focusing on large-scale learning. He then joined SRI International's AI Center. From 2011 to 2014, Madani worked at Google Research on video classification and object detection for YouTube. He then joined Cisco’s Tetration Analytics Group as a founding member, developing a platform for data center security and visibility. == Patents and awards == Madani holds over 20 patents in various areas of machine learning, including unsupervised concept induction, large-scale classification, and network security. His work has been recognized with several awards, including the Above & Beyond award from SRI International in 2009 and the Alberta Ingenuity postdoctoral fellowship in 2002. == Selected publications == === Prediction games (open-ended unsupervised learning for perception) === * Madani, O. (2023). \"An Information Theoretic Score for Learning Hierarchical Concepts.\" Frontiers in Computational Neuroscience. * Madani, O. (2024). “Tracking Changing Probabilities via Dynamic Learners.” Arxiv. === Other topics in machine learning (online learning, active learning, …) === * Madani, O., Connor, M., Greiner, W. (2009). “Learning When Concepts Abound.”, Journal of Machine Learning Research. * Raghavan, H., Madani, O., Jones, R. (2006). “Active Learning with Feedback on Features and Instances.”, Journal of Machine Learning Research. * Madani, O., Lizotte, D., Greiner, R. (2004). “Active Model Selection.”, Uncertainty in AI. * === Algorithm design and computational complexity of dynamic decision making === * Madani, O., Hanks, S., & Condon, A. (2003). \"On the Undecidability of Probabilistic Planning and Related Stochastic Optimization Problems.\" Artificial Intelligence Journal. * Etzioni, O., Hanks, S., Jiang, T., Karp, R.M., Madani, O., and Waarts, O. (1996)“Efficient Information Gathering on the Internet.” IEEE FOCS. == References == Category:Computer scientists Category:Living people Category:Year of birth missing (living people)",
 "title": "Omid Madani"
}