{
 "id": "1135048",
 "text": "Anti-tank warfare originated during World War I from the desire to develop technology and tactics to destroy tanks. == Pictures == File:FGR-17 VIPER.jpg |A soldier preparing to fire the , an American experimental one-man disposable antitank rocket. File:Indian troops in North Africa parade with a Boys anti-tank rifle and 'Molotov cocktail' petrol bombs, 6 October 1940. E699.jpg |British Indian Army tank-hunting squad with anti-tank rifle and Molotov cocktails in the North African Campaign, on 6 October 1940. File:The British Army in Italy 1944 NA18188.jpg|right | A British towed behind in Italy, 1 September 1944. File:The Battle of Arras, April-May 1917 Q6286.jpg | A of World War One. File:Bundesarchiv Bild 183-R27012, Bei Cambrai erbeuteter englischer Panzer.jpg|right |A disabled near Cambrai, 1917 – World War I. File:Protitankový kanón 3,7 cm vz.gif | Czechoslovak anti-tank gun . File:RIAN archive 225 IL-2 attacking.jpg |Soviet Ilyushin Il-2 planes with 23mm cannons attacking a German tank column during the Battle of Kursk. File:37mm bofors antitank gun parola 2.jpg |Bofors 37 mm anti-tank gun as used by several nations. File:Pak38 cfb borden 2.JPG | German 50-mm anti-tank gun. File:Archer SP 17 pdr Tank Destroyer.jpg|right |The British self-propelled anti-tank gun put the 17-pdr gun on the hull of a . File:PTRS rifle at Great Patriotic War museum in Smolensk.jpg | anti-tank rifle at the in Moscow. File:PIAT cropped.jpg |British . File:Trigat-LR-detoured.jpg | with HEAT warhead of the . File:Lunge AT Mine.jpg|right |A statue of a Vietminh soldier holding a Lunge AT Mine. In Vietnamese the mine is called bom ba càng, literally means \"three-clawed bomb\". File:Production of Sticky Bombs.jpg | in production. File:Talvisota Molotov Cocktail.PNG|right |A with a Molotov cocktail in the 1939–40 Winter War. File:Bundesarchiv Bild 101I-719-0240-26, Pas de Calais, Atlantikwall, Panzersperren.jpg | Examples of deployed on the Atlantic Wall in the vicinity of Calais. File:Bundesarchiv Bild 183-H28150, Deutsche Soldaten mit Panzerfäusten.jpg|Panzerfaust armed German soldiers on the Eastern Front, 1945. File:Chinese infantry soldier preparing a suicide vest of Model 24 hand grenades at the Battle of Taierzhuang against Japanese Tanks.jpg |Chinese suicide bomber putting on an explosive vest made out of Model 24 hand grenades to use in an attack on Japanese tanks at the in 1938. File:Boeing AH-64D Apache Longbow, Netherlands - Air Force AN0880457.jpg|AH-64 Apache, an anti-tank helicopter with eight missiles. File:Baasjan1.JPG |South African tank gun retrofitted to an carriage. File:106mm land rover.JPG | \"gunbuggy\" with an used in the anti-tank role. File:ISF member armed with RPG-7.jpg |Soviet RPG-7. File:6SADiv Tanks disabled Perugia.jpg|South African Sherman tank disabled in the fight to take the Perugia Highlands in Italy 1944 – World War 2. == Related pages == * * Anti-tank gun () * Bombard (weapon) * Attack aircraft * Attack helicopter * * * * * * * * == References == == Other websites == * A 1987 U.S. Army news archive about light anti-tank weapon training by the 7th Infantry Division (Light), Fort Ord, Calif. Category:Military Category:Weapons Category:Tanks Category:Pages with unreviewed translations",
 "title": "Anti-tank warfare"
}