{
 "id": "1135842",
 "text": "The 1922 Women's World Games (French Jeux Olympiques Féminins and Jeux féminins mondiaux) also dubbed the 1922 Women's Olympic Games were the first regular international Women's World Games. The tournament was held 20 August 1922 at the Stade Pershing in Paris.Laurence Prudhomme-Poncet, \"Histoire du football féminin au XXe siècle\" L'Harmattan 2003, page 99, Retrieved 10 December 2013Jeux Mondiaux Féminins Commission documentation et histoire, cdm.athle.com (Retrieved 15 August 2016)They set the mark Columbia College, Retrieved 10 December 2013Chronique de l'athlétisme féminin NordNet.fr, Retrieved 10 December 2013Ana Miragaya, Lamartine DaCosta: Olympic entrepreneurs, page 105-106 Olympic Studies Centre, Universitat Autònoma de Barcelona, Retrieved 10 December 2013 The games were organized by the Fédération Sportive Féminine Internationale under Alice Milliat as a response to the refusal of the International Olympic Committee to include women's events in the 1924 Olympic Games. The Games consisted of eleven events: six track events (60 metres, 100 yards, 300 metres, 1000 metres, 4 x 110 yards relay and hurdling 100 yards and five track events (high jump, long jump, standing long jump, javelin and shot put).FSFI Women's World Games GBR Athletics, Retrieved 10 December 2013 Each country was allowed two participants in each event. Next to these events the final of the French Basketball Championships was scheduled and several demonstration events. A total of 18 world records were set. ==Venue== The venue of the Games was the Percing Stadium in in the Bois de Vincennes. The stadium was build by engineers of the United States Army. The stadium was inaugarsted on 22 June 1919. It hosted that year the Inter-Allied Games and was presented after the Games as a gift by the United States to France. It was also the venue of the first women's athletics matches in France, the 1921 France–Great Britain women's athletics match and in May 1922 the 1922 France–Czechoslovakia women's athletics match. The venue was in general mainly used as a football stadium and was also used during the 1924 Summer Olympics. The stadium was able to hold 29,000 spectators. ==Nations== A list of 77 women from five nations were listed to participate. However, note not all entered athletes also participated. The athletes were selected by the nations. Some countries used specific matches to select athletes, like the United States organized the 1922 United States Women's World Games trials. * (10) * (32) * (13) * (7) * (15) ==The Games== ===Schedule=== The morning session on 20 August consisted of the heats in the 60 metres, 100 yards, 100 yards hurdles, high jump, long jump, standing long jump and 300 meters. Before the afternoon session, the Games were opened with an olympic style ceremony, including a parade of nations. American Lucile Godbold was selected to carry the American flag, with the American team wearing white uniforms. Les premiers Jeux olympiques féminins In the 20 August 1922 newspaper a schedule was published of the Games. ;Morning session (from 9.00am) :High jump (qualificaion) :Standing long jump (qualificaion) :300 metres (qualificaion) :Javelin throw (qualificaion) :Long jump (qualificaion) :4 x 110 yards relay (qualification) ;Opening ceremony ;Afternoon session (from 14.30pm) :100 yards hurdles (qualification) :High jump :60 metres (qualification) :Shot put :100 yards (qualification) :Long jump :300 metres :French Basketball Championships (final) :100 yards hurdles :60 metres :Javelin throw :100 yards :Long jump :1000 metres :4x 110 yards relay :Demonstration events The Games took place in \"perfect weather conditions\". There were 20,000 spectators. ==Medal summary== 60 m 7.6 7.7 7.8 100 yds 12.0 Mary Lines 300 m Mary Lines 44.8 1000 m Lucie Bréard 3:12.0 Georgette Lenoir 3:12.2 100 yds hurdles Camille Sabie 14.4 Hilda Hatt 14.8 Geneviève Laloz 15.0 4×110 yds relay Mary Lines Nora Callebout Gwendoline Porter 51.8 51.2 Marie Mejzlíková II Bozena Srámková Marie Mejzlíková I Marie Jirásková 52.8 High jump Hilda Hatt * * * Nancy Voorhees 1.46 m Not awarded Not awarded Ivy Lowman 1.42 m Long jump Mary Lines 5.06 m Elizabeth Stine 5.025 m Camille Sabie 4.96 m Standing long jump Camille Sabie 2.485 m 2.405 m 2.34 m Shot put Lucile Godbold 20.22 m Violette Morris 19.85 m Maud Rosenbaum 17.37 m Javelin throw Francesca Pianzola 43.24 m Yvonne Gancel 41.62 m Lucile Godbold 39.70 m ==Points table== Place Nation Points 1 50 2 31 3 29 4 12 5 6 ==References== Category:1922 Women's World Games Category:1922 in women's athletics Category:Sport in Paris Category:1922 in Europe Category:International sports competitions Category:1920s in France",
 "title": "1922 Women's World Games"
}