{
 "id": "1135844",
 "text": "Otis Crandall Davis (July 12, 1932 - September 14, 2024) was an American athlete. He won two gold medals for record-breaking performances in both the 400 m and 4 × 400 m relay at the 1960 Summer Olympics. Davis set a new world record of 44.9 seconds in the 400 m event. He became the first man to break the 45-second barrier at the Olympics. Davis was born in Tuscaloosa, Alabama on July 12, 1932.\"Otis Davis\". USA Track & Field. Retrieved March 20, 2012. He was black and Native American.\"Team USA Medal Winners at the Olympic Games\". USA Track & Field. Retrieved March 21, 2012. He served four years in the United States Air Force, during the Korean War.Staab, Amanda (December 10, 2008). \"Honoring the brave UC high school students hear from local veterans\" . The Hudson Reporter. During the 1960 Summer Olympics, Davis became friends with boxer Muhammed Ali. He was coached by Bill Bowerman. Following the Olympics, Davis competed in some track meets, such as the 1961 U.S. Nationals at Randall's Island. He returned to Oregon, where he obtained his degree, a B.S. Health & Physical Education, in 1960.\"Biography\". OtisDavisOlympian.com. Retrieved March 20, 2012. He later considered playing as wide receiver for the Los Angeles Rams. After retiring from competition, Davis become a high school teacher, working in Springfield, Oregon for many years. In his later years, he worked as a verification officer at a high school in Union City, New Jersey and helped children with special needs.Machcinski, Anthony J. (December 20, 2012). \"Union City Olympian Otis Davis, now 80, keeps up with community contributions\". NJ.com. Davis died on September 14, 2024 under hospice care in North Bergen, New Jersey at the age of 92. ==References== ==Other websites== *Official website *University of Oregon Duck Record Holders Category:1932 births Category:2024 deaths Category:American track and field athletes Category:Sportspeople from Alabama Category:Sportspeople from Oregon Category:Sportspeople from New Jersey Category:Educators from Alabama Category:Educators from Oregon Category:Educators from New Jersey Category:People from Tuscaloosa, Alabama Category:People from Union City, New Jersey Category:People from Springfield, Oregon Category:American military personnel of the Korean War Category:Olympic gold medalists for the United States",
 "title": "Otis Davis"
}