{
 "id": "1135008",
 "text": "Mihira Bhoja (c. 836 – c. 885 CE), also known as Bhoja I, was a Pratihara Emperor who ruled from 836 to 885 CE. He took over a weak kingdom from his father, Ramabhadra, but his strong rule turned it into a large and successful empire. Bhoja was a follower of Brahmanism and used the title Ādivarāha, which is seen on some of his coins. He is known as one of the important leaders of ninth-century India, along with Dhruva Dharavarsha and Dharmapala, for being a great general and empire builder. == Military Career == === Early Career === Mihira Bhoja first strengthened his kingdom by defeating rebellious feudatories in Rajasthan, then focused on fighting his old enemies, the Palas and Rastrakutas. After securing his rule, Mihira Bhoja got involved in a succession war for the Gujarat throne between Dhruva II of the Gujarat Rashtrakuta dynasty and his younger brother. Bhoja led a cavalry raid into Gujarat against Dhruva while supporting Dhruva's younger brother. Though the raid was defeated by Dhruva II, Bhoja managed to keep control over parts of Gujarat and Malwa. Sometime before 888, the Gurjara-Pratiharas were defeated in a major battle at Ujjain by Krishna II, the Rashtrakuta king of Gujarat. However, the Pratiharas likely retaliated soon after, and by the end of his reign, Bhoja had successfully ended the Gujarat Rashtrakuta dynasty. === Conflict with Arabs === In the early 8th century, Arabs repeatedly tried to take control of Sindh. Imran ibn-Musa, the governor of Sindh, attempted to expand Arab rule to nearby regions. When Bhoja rose to power, the Pratiharas fought back and drove the Arabs out of the fort of Sindan, pushing them out of Kutch between 833 and 842 AD. Later, the Arabs lost most of Sindh. == Extent of the Empire == At its peak, Bhoja's empire stretched to the Narmada River in the south, the Sutlej River in the northwest, and Bengal in the east. It covered a vast area from the foothills of the Himalayas to the Narmada River and included the present-day Etawah district in Uttar Pradesh. Kalhana's Rajatarangini mentions that Bhoja's territories extended to Kashmir in the north and that he had conquered Punjab by defeating the ruling Thakkiyaka dynasty. == References == Category:836 births Category:885 deaths",
 "title": "Mihira Bhoja"
}