{
 "id": "1135291",
 "text": "The German invasion of Belgium was a military campaign that marked the beginning of the World War I on the Western Front. The invasion began on 4 August 1914 and lasted until 31 October 1914. Belgium, having declared its neutrality, mobilized its armed forces in response to escalating tensions in Europe, while Germany sought to pass through Belgium as part of the Schlieffen Plan to quickly invade France. == Background == On 24 July 1914, the Belgian government declared that it would uphold its neutrality in the event of war. However, as German forces began to mobilize, Belgium reinforced its borders and raised a state of alert. On 2 August, Germany issued an ultimatum to Belgium, demanding passage through the country to invade France. Belgium refused, and on 4 August, German troops crossed into Belgium, leading to the Battle of Liège. == Invasion and Early Battles == The German invasion aimed to position the 1st, 2nd, and 3rd German Armies in Belgium to initiate their advance into France. After the fall of Liège on 7 August, German forces besieged Belgian fortresses along the Meuse River, capturing the city of Namur on 16–17 August. Brussels fell on 20 August as the Belgian government retreated to Antwerp. The Belgian Army continued to resist, staging sorties from Antwerp and harassing German supply lines. However, by September, most of Belgium was under German control, with the exception of areas around Antwerp. == Rape of Belgium == The German occupation of Belgium became notorious for its harsh treatment of civilians. The fear of guerrilla fighters, or francs- tireurs, led to widespread atrocities against the Belgian population. Villages were burned, and civilians were executed in what became known as the Rape of Belgium, leading to international condemnation. == British and French Reinforcements == Although the bulk of the German forces moved south into France, British and French forces supported Belgian efforts in the later stages of the invasion. The British Expeditionary Force (BEF) arrived in Belgium, and the Royal Naval Air Service (RNAS) conducted air reconnaissance missions over Belgian territory. Despite these reinforcements, the Siege of Antwerp ended with the city’s fall on 9 October 1914. == Aftermath == By the end of October, most of Belgium was occupied by German forces. The Belgian government and military were forced to withdraw to a small corner of West Flanders. The German occupation of Belgium would last until the end of the war in 1918. == Legacy == The German invasion of Belgium had a profound impact on public opinion, particularly in the United Kingdom and the United States, helping to galvanize support for the Allied cause. The invasion, and the atrocities committed against Belgian civilians, contributed to the demonization of Germany in Allied propaganda. == Related pages == * Battle of Liège * Western Front (World War I) == References == Category:Battles of World War I Category:1910s in Belgium Category:History of Belgium",
 "title": "German invasion of Belgium (1914)"
}