{
 "id": "1135991",
 "text": "Hanna (Anna) Bloha ( uncertain; 11 August 1941? (aged 19)), was a Jewish Kosmosol member, diarist, and presumably even a Holocaust victim. She was considered as the \"most important folk hero and historical figure of Latvia\", after its independence from the USSR in 1991. The diary was written from 21 January, the day before her nineteenth (19) birthday, to 17 July 1941. When war broke out in June 1941, Hanna Bloha had supported and gave aid to Latvian partisans; after succesfully suppressing them. Regardless, she was betrayed by \"Latvian patriots\", especially by Purįna Paulis, and she may have been shot and murdered, at somepoint 11 August 1941?, or maybe before or after that time, if Hanna Bloha was even killed, though she likely was. The diary, which Hanna Bloha wrote before her tragic fate and murder, was discovered and rescued by the National Guard of Latvia in 1944, after the war ended. It was stored and kept in archives. After Latvians heard about Hanna Bloha's story and what she did to help Latvian partisans, attempts were made to consider Hanna Bloha as the most important folk hero and historical figure of Latvia. However, this was almost impossible with the Bolshevik rule and control over Latvia. When Latvia gained complete independence from the USSR in 1991, one of the first changes made to the now independent country and government was by making Hanna Bloha as the most important folk hero and historical figure of Latvia. Despite the fact that at the time the Latvian government did not know Hanna Bloha's name, identity, or background, she was anyways considered and awarded as being the \"most important Latvian folk hero and historical figure ever\". Eight (8) years later in 1999, an old Latvian woman discovered the diary in the archives; she recognized as belonging to her former childhood friend and classmate, Hanna Bloha, but unfortunately (as stated above) at that time her name and identity was not known. Her name was restored when the old woman shared information she had about her former childhood classmate and friend, Hanna Bloha. Hanna had studied with her at the elementary school in Strenči as a young child, and they had some forms of connection and friendship. == Diary == Hanna Bloha wrote her diary from 21 January, the day before her nineteenth birthday, to 17 July 1941, over a six-month long period. She wrote about her feelings and experiences during the Soviet occupation of Latvia, the June 14 deportation which Hanna calls \"Bertuli Night\", and during the Holocaust, the Nazi occupation of Latvia and virtually the rest of Europe, and also about the brave actions she took to help Latvian partisans, during the war. She had made some forms of connections with them. She tried to join them and become a partisan herself, but unfortunately in that part she was Jewish, and therefore she actually could not pass and was never accepted. Hanna Bloha also mentioned her relationship connections with someone named Dunkin; probably a boyfriend, and about her financial situations, after leaving and moving out of her home. Hanna Bloha wrote a diary entry about how she was betrayed and given to German officers. The person who betrayed her was some unknown Latvian \"real and true patriot\" named Purįna Paulis, \"who can not take such dishonesty\", when Hanna Bloha tells the German she is not Jewish, when he asks and confronts her about the matter. The diary entry was written on Friday, 4 July 1941, the first day of the German occupation of Valmiera, Hanna Bloha's homecity. == Death == Hanna Bloha presumably may have been Holocaust victim. She presumably may have been shot and killed around late July or August 1941, during the Strenči massacres. It is said that on 11 August 1941 in Strenči, eight (8) Jews were kept in the back of a German military truck, and they were driven to the forest, to be shot and murdered. Hanna Bloha is said to have been one of the eight (8) Jews who were shot and murdered in the forest, that day, even though she probably did die on that day, but anyways since this small shooting (or even if Hanna Bloha was among the victims), is something not fully confirmed yet, her death date should not be marked \"only\" as 11 August 1941, until further proof is even found. Category:Soviet Jews Category:Holocaust victims Category:Diarists",
 "title": "Hanna Bloha"
}