{
 "id": "1135006",
 "text": "Chandragupta II's conquest of Vahlika Hunas also known as Chandragupta II's campaign of Balkh was a campaign led by the Gupta emperor Chandragupta II. Chandragupta II crossed the Indus and its tributary rivers (the Jhelum, Chenab, Ravi, Beas, and Sutlej). This expedition was probably against the Huns and the Sassanids. Another goal of this campaign was to access horses from Central Asia and Afghanistan. From numismatic evidence, we see Gupta military innovations. The Archer-type coins issued by the Gupta emperors show the ruler standing with a bow in the left hand and an arrow in the right. The bows look like double-curved bows used by mounted nomads. The Horseman-type coins were introduced by Chandragupta II. On the obverse of these coins, the king is shown riding a caparisoned horse, sometimes armed with a bow, arrow, and sword. Chandragupta II, after expelling the Sakas from western India, sought to free the north-western frontier from the control of the Daivaputra, Sahisahanusahi (Little Kushanas), and Saka-murunda rulers. These rulers had been left in power by Samudragupta after acknowledging his supremacy. Aiming for control over all of northern India, Chandragupta II targeted the important north-western passes, which were important for defence and trade. After a well-fought battle in southern Afghanistan, he defeated these rulers and pushed them towards the Persian border. Encouraged by this success, he then turned to invade the Oxus Valley, using the northern route. The Hunas, who had not offended him, were caught by surprise and quickly defeated by the Gupta forces. He recognized the challenges of controlling the Huna kingdom, understanding the administrative and financial burdens, increased by distance. Following his father Samudragupta's approach to the south Indian subordinates, Chandragupta II signed a peace treaty with the Hunas. The Hunas accepted Gupta overlordship and agreed to pay war indemnity, while retaining autonomy in their own affairs and Central Asian politics. ==The Expedition== ===Battle of Oxus=== The Hunas in Bactria were not a peaceful community and because they posed peril to both Iran and India, and they might have tried to run after Kidara or his successors in Gandhara, and Fa-hsien refers to Hepthalite king trying to remove Buddha's coliseum from Purushapur. This may indicate Huna invasion in Gandhara some time before Fa-hsien finished his journey in India. It is said that Kidara towards the end of the 4th century had to go northwestwards against the Hunas, leaving his son Piro at Peshawar. It is possible that Kidara might have gained some help from the Gupta emperor. It is thus possible that Chandragupta II led an adventure to Bactria through Gandhara against the Hunas, and this may be related to as his crossing of the seven rivers of Sindhu and conquering Bahlika in the Mehrauli Pillar Inscription. This event may be placed towards the end of the 4th century A.D. Chandragupta II's Bactrian expedition also led to the battle of the Oxus with his Gupta cavalry against the Hunas, who were defeated and the Gupta emperor having planted the Gupta flag on the banks of the river of Oxus. The Mehrauli inscription highlights Chandragupta II's victory over the Bactrians (Vahlikas), achieved after crossing the seven tributaries of the Indus—Kabul, Swat, Sindh, Jhelum, Chenab, Ravi, and Beas. This conquest is regarded as more significant than his earlier defeat of the Sakas in western India, despite the latter being central to his legacy. Kalidasa's Raghuvamsha provides additional context by recounting the campaigns of King Raghu, believed to represent Chandragupta II, against the Bactrians, Persians (Parasikas), and Huns near Kapisa. These battles, likely between 390 and 399 CE, coincided with the decline of the Kushanas and Sasanian weakness under monarchs like Ardashir II and Bahram IV, who were preoccupied with conflicts in the west. ===Battle of Kapisa=== The Battle of Kapisa, near Begram, stands out as a significant event during this period. Chandragupta II's forces overcame Persian cavalry stationed in the region, marking his dominance over the Parasikas (Persians). Following this victory, he advanced northward to quell uprisings in Bactria and confront the Huns on the Oxus. These campaigns established Chandragupta II as a formidable ruler who consolidated Gupta power in the northwest, ensuring stability in the region. Archaeological evidence, such as the desertion of Begram in the late 4th century, further supports the impact of these invasions, which reshaped the political landscape of northern India and Central Asia. == Modern Reconstruction == === Identification of the people of Vahlika === The Mehrauli Inscription identifies the people of Vahlika as the Vahlikas. Kalidasa,Raghuvamsha, IV, 68 Ksirasvami,Namalinganushasana, p.159 and VallabhaNarayan Ram Acharaya's Raghuvamsha, p.101 agree that these individuals were associated with the Hunas and resided along the banks of the Vanksu River. This identification is further supported by historical sources from fifth-century Persia, which confirm the presence of the Hunas in the region of the Oxus River during that period. === Campaign === After expelling the Sakas from western India, Chandragupta II decided to free the north- western frontier from the domination of the Daivaputra, Sahisahanusahi, and Saka-murunda rulers, whom Samudragupta had allowed to stay in power after accepting his supremacy. Since Chandragupta II wanted to have control over all of northern India, he decided to control the north-western passes. These passes were important for India's defence and also provided land routes for trade with Central Asia and other countries. In a well-contested battle, Chandragupta defeated the rulers. This battle took place somewhere in southern Afghanistan. After his victory, he pushed them towards the Persian border. His success in this campaign inspired him to invade the Oxus valley. Once Chandragupta II decided to invade the Oxus valley, he chose the northern route and moved towards the region. The Hunas, who had not done anything to make the Indian ruler their enemy, did not expect an invasion from the south. They were caught by surprise, and before they could react, they were defeated by the Gupta forces. === Aftermath and Peace treaty === Although Chandragupta II won a decisive victory over the Hunas, he realized the challenges of maintaining control over the Huna kingdom. He understood that it would involve administrative and financial burdens, and the distance would only make the situation more difficult. Therefore, being practical, he followed the same policy as his father, Samudragupta, had used towards his south Indian subordinates. A peace treaty was quickly signed by both sides. As part of the agreement, the Hunas accepted Gupta overlordship and agreed to pay war indemnity. In return, Chandragupta allowed the Hunas to manage their own affairs and gave them freedom in Central Asian politics. Even so, as a victorious ruler, Chandragupta asserted that his empire had gained a new northern boundary, marking a new limit in the north. ==Notes== == References == Category:Pages created with the Article Wizard from 2024 Category:367 Category:History of Asia",
 "title": "Chandragupta II's conquest of the Vahlika Hunas"
}