{
 "id": "1135996",
 "text": "On January 5, 2014, Bangladesh held its 10th general elections. The opposition, Bangladesh Nationalist Party (BNP) and its ally Jamaat-e-Islami, did not take part in the elections. Before the election, there were many strikes and violence caused by the opposition. Victims said that following the January elections, supporters of those opposition parties started attacking the minority Bengali Hindus. They were accused of looting, destroying, and burning Hindu homes in different parts of the country. == Attacks == === Chittagong Division === On 5 January, in the evening, Hindus were attacked in Satkania Upazila, Lohagara Upazila, and Banshkhali Upazila of Chittagong District. At least 150 Hindu houses were set on fire by members of Jamaat-e- Islami and Islami Chhatra Shibir. In Lohagara Upazila, activists of Jamaat-e- Islami and BNP looted and vandalized shops belonging to Hindus in Hindur Hat in Kolujan area. They also tried to vandalize a Hindu temple. In Lakshmipur District, a Kali temple in Narayanpur village under Ramganj Upazila was set on fire on 9 January night. In Sonagazi Upazila of Feni District, Islamic fundamentalists burned Shree Shree Dakshinashwer temple on 16 January. They also looted valuable items from the temple. === Dhaka Division === In Netrakona District, a Kali temple was vandalized and then set on fire after midnight on 7 January. In Bade-dudhkora village of Sadar Upazila of Netrakona District, Islamist fundamentalists burned another Kali temple. The temple was situated at the house of Mr. Chandan, a member of local union parishad. On 10 January, early morning, unidentified miscreants set fire to the house of a Hindu family in Bhakoadi Malibari area under Chandpur Union of Kapasia Upazila in Gazipur District. In Dhaka City Corporation South Zone, the International Society for Krishna Consciousness (ISKCON) Temple at Swamibagh, which is also ISKCON headquarters in Bangladesh, was attacked by more than 100 Muslims at about 10:20 pm (local time) on 30 June 2014. === Khulna Division === In Abhaynagar Upazila of Jessore District, at around 10 am on 5 January, 70 to 80 workers of the opposition parties hacked five Hindu men for casting their votes. As the police fired in the air to save the victims, the attackers fled, threatening to return with dire consequences. At around 6 pm, around 250 workers of Jamaat-e-Islami and the Bangladesh Nationalist Party, armed with sharp weapons and sticks, attacked the Hindu-inhabited Malopara village, where they vandalized 130 houses and set another 10 on fire. The activists of Jamaat-e-Islami and Islami Chhatra Shibir, armed with firearms, Molotov cocktails, machetes, iron rods, and sticks, chased the Hindus, causing about 100 of them to jump into the Bhairab River and swim to the other side. The coconut and banana trees were either chopped or burned. The cowsheds were burned. Idols were desecrated. At least 20 people were injured in the attack. Around 600 Hindus from the village swam across the Bhairab and took shelter in Diyapara village under Sridhar Union. On 7 January at night, masked men raided two Hindu houses in Hajrail Rishipalli of Manirampur Upazila in Jessore District. They held the men hostage and gang-raped two housewives. In Bagerhat District, one Radha Govinda temple and one Kali temple were set on fire on the night of 8 January in Kachubunia in Morrelganj Upazila. On 9 January, Radhagobinda Sebashram of Ramchandrapur and Shree Shree Shyma temple were burned by Islamic fundamentalists. In Bagerhat District again, Islamic fundamentalists burned Saswati Puja Mandap of Radha Gobinda temple on 16 January in Morrelganj Upazila. In Magura District, gold ornaments and money were stolen from two Hindu temples in Satdoha area of Magura town in Magura Sadar Upazila on 10 January. Miscreants broke into the two temples of Sri Sri Nengta Babar Ashram in the early hours and took away gold and silver ornaments and cash from the donation box. In Satkhira District, 46 houses and establishments belonging to Hindus were vandalized and another six set on fire on the night of 5 January. The miscreants accused the Hindus of voting for the Awami League. === Rajshahi Division === In the Nandigram Upazila of Bogra District, the Hindus were attacked by the activists of Jamaat-e-Islami and BNP. One Hindu house was set on fire in Kusumba Union of Joypurhat Sadar Upazila, Joypurhat District. One elderly person died due to a heart attack because of the panic caused by the fire. The Hindus of Boalia village under Sukash Union of Natore District were threatened against voting in the elections. Despite the threats, three Hindus cast their votes on 5 January. After the polls, their houses were set on fire. Islamist fundamentalists again attacked Nandigram Upazila of Bogra District. On 12 January, after the national election, they set on fire some haystacks, some houses, and looted a tube well of Hindu families. === Barisal Division === In Barisal District, a Hindu family was evicted from their house. It was situated in Thaneshwarkathi village of Agailjhara Upazila. A Jubo League cadre of the present government party Awami League came to take possession of Mr. Tapan Sarker's house with a gang of terrorists. They beat Mr. Tapan and his family members. After that, the family took shelter in an unused classroom of a nearby primary school. On 12 January, some Islamic fundamentalists burnt an ancient Durga temple into ashes in Bhandaria Upazila of Pirojpur District after the national election of Bangladesh on 5 January. == References == Category:Anti-Hindu violence in Bangladesh Category:2014 Category:Religious riots in Bangladesh Category:Attacks on Hindu temples in Bangladesh",
 "title": "2014 Bangladesh anti-Hindu violence"
}