{
 "id": "1135249",
 "text": "Taslima Nasrin (born 25 August 1962) is a Bangladeshi writer and doctor. She writes about problems of women's oppression and criticizes religion. Some of her books are banned in Bangladesh. She has been banned from Bangladesh and also from the Indian state of West Bengal. In the early 1990s, she gained international prominence with her essays and novels that expressed feminist notions along with criticism of women-hostile religions. Because of death threats, she has lived in exile since 1994. After over a decade of living in Europe and the USA, in 2004, she shifted to India and has been living there on a long-term visa. == Early life and career == Nasrin is the daughter of Dr. Rajab Ali and Edul Ara, Bengali Muslims from Mymensingh. Her father was a doctor and a professor at several medical colleges. After finishing high school in 1976 and college in 1978, she studied medicine at Mymensingh Medical College and obtained her MBBS degree in 1984. While still at college, she wrote and edited a poetry magazine called Shenjuti. After graduating, she worked at a family planning clinic in Mymensingh, then at the gynaecology department of Mitford Hospital and the anesthesia department of Dhaka Medical College Hospital. While working she saw many girls who had been raped and heard women cry in despair if their baby was a girl. She was born into a Muslim family but later in life became an atheist. Her writing reflected a feminist approach. == Literary career == Early in her career, Nasrin had written mainly poetry, and from 1982 to 1993 issued six collections. Her poems spoke to many of female oppression and displayed very graphic language. She started writing prose in the late 1980s, publishing three essay collections along with four novels before her documentary novel Lajja (). This novel told of a Hindu family under attack from Muslim fanatics, which drove them to flee their country. Nasrin faced many physical and other attacks for criticizing Islam and demanding women’s equality. Hundreds of thousands of fanatics demanded her execution. In October 1993, a radical group called the Council of Islamic Soldiers announced a reward for her death. In May 1994, she gave an interview to The Statesman, which quoted her as advocating a revision of the Quran. She claims all she did was advocate the abolition of Sharia, the Islamic law. In August 1994 she was indicted for inflammatory remarks. Tens of thousands of Islam fundamentalists attacked her as an apostate. Hundreds of thousands of demonstrators labeled her an apostate and a militant faction threatened to release poisonous snakes in the capital unless she was executed. After two months in hiding, she fled to Sweden in the end of 1994, gave up medical practice and became a full-time writer and activist. == Life in exile == After leaving Bangladesh in 1994, Nasrin lived in Sweden, Germany, France, and the US for ten years. She moved to Kolkata in India in 2004 and stayed there till 2007. After being attacked in Hyderabad, she was put under house arrest in Kolkata and then forced to leave West Bengal on November 22, 2007. She was under house arrest in New Delhi for three months before leaving India in 2008. She later returned to India from the US. Nasrin’s Bangladeshi passport was revoked, and she got Swedish citizenship, taking refuge in Germany. She had to wait six long years from 1994 to 1999 to get a visa to visit India. In 1998, she wrote \"Meyebela, My Bengali Girlhood,\" related to her early life. A Bangladeshi passport never came her way before her parents died to visit them. === 2004–2007, life in Kolkata === In 2004, the Indian government gave Taslima Nasrin a temporary residential permit to relocate to Kolkata in West Bengal. The Indian government extended her visa periodically but did not grant her citizenship, though Taslima called Kolkata her home. In Kolkata, she began writing for Indian newspapers and magazines. Her criticism of Islam invoked opposition from religious fundamentalists, including death threats and bounties against her. In 2007, the members of All India Majlis-e- Ittehadul Muslimeen had attacked her during a book release function at Hyderabad. Three members of the party were arrested in that connection. ===Expulsion from Kolkata=== On 9 August 2007, Nasrin was in Hyderabad to present the Telugu translation of her novel \"Shodh\". Then she was allegedly attacked by a mob led by members of the Majlis-e-Ittehadul Muslimeen, an Indian Islamic political party. A week later, on 17 August, Muslim leaders in Kolkata revived an old fatwa against her that she had to leave the country and offered unlimited amount of money for her death. On November 21, chaos erupted owing to a protest organized by \"All India Minority Forum\" in Kolkata. And the army was deployed in order to restore the situation. Nasrin was forced to move from Kolkata to Jaipur and then to New Delhi. The Indian government kept her in an undisclosed location in New Delhi for over seven months. In January 2008 she was selected for the Simone de Beauvoir award for her writing on women's rights but declined to go to Paris to receive it. She canceled publication of part of her autobiography and deleted some passages from another book. She migrated to Sweden in 2008 and later worked at New York University. She donated her body to medical purposes in India after her death. Them She eventually returned to India, but was forced to stay in New Delhi as the West Bengal government refused to permit her entry. In 2015, she received a threat from Al Qaeda-linked extremistsves. and came to America with the help of the Center for Inquiry. ==Other activities== * Reporters Without Borders (RWB), Member of the Emeritus Board.Emeritus Board Reporters Without Borders (RWB). ==Awards== Taslima Nasrin has received international awards in recognition of her contribution towards the cause of freedom of expression. Awards and honors conferred on her include the following: * Ananda Award or Ananda Puraskar from West Bengal, India in 1992 and 2000 for \"Nirbachita Kolam\" and \"Amar Meyebela\" * Sakharov Prize for freedom of thoughts from European Parliament, in 1994 * Simone de Beauvoir Prize in 2008 * Human Rights Award from the Government of France, 1994 * Edict of Nantes Prize from France, 1994 * Kurt Tucholsky Prize, Swedish PEN, Sweden, 1994 * Feminist of the Year from Feminist Majority Foundation, US, 1994 * Scholarship from the German Academic Exchange Service, Germany, 1995 * Honorary Doctorate from Ghent University, Belgium, 1995 Overzicht eredoctoraten * Distinguished Humanist Award from International Humanist and Ethical Union, Great Britain, 1996 * Erwin Fischer Award, International League of non-religious and atheists (IBKA), Germany, 2002 * Freethought Heroine Award, Freedom From Religion Foundation, US, 2002 * Fellowship at Carr Centre for Human Rights Policy, John F. Kennedy School of Government, Harvard University, US, 2003 * UNESCO-Madanjeet Singh Prize for the promotion of tolerance and non-violence, 2004 * Honorary doctorate from American University of Paris, 2005 * Grand Prix International Condorcet-Aron, 2005 * Woodrow Wilson Fellowship, US, 2009 * Feminist Press award, US, 2009 * Honorary doctorate from Universite Catholique de Louvain, Belgium, 2011 * Honorary citizenship from Esch, Luxembourg, 2011 * Honorary citizenship from Metz, France, 2011 * Honorary citizenship from Thionville, France, 2011 * Honorary doctorate from Paris Diderot University, Paris, France, 2011 * Universal Citizenship Passport. From Paris, France, 2013 * Academy Award from the Royal Academy of Arts, Science and Literature, Belgium, 2013 * Honorary Associate of the National Secular Society ==Bibliography== ==Titles in English== * Split * Exile * French Lover * * * Trans. of Lajja. * * Trans. of Meyebela ==Secondary works== * * * * Hasan, Md. Mahmudul (July 2016), \"Nasrin Gone Global: A Critique of Taslima Nasrin's Criticism of Islam and Her Feminist Strategy.\" South Asia Research. 36(2): 167–185. Nasrin Gone Global: A Critique of Taslima Nasrin's Criticism of Islam and Her Feminist Strategy == References == ==Other websites== * Women's untold stories: Michael Deibert interviews with Taslima Nasrin * For freedom of expression by Taslima Nasrin Category:1962 births Category:Living people Category:20th-century people Category:Atheists Category:Essayists Category:Bangladeshi poets Category:21st- century people Category:Activists Category:Feminists Category:Former Muslims Category:Humanists Category:Memoirists Category:Bangladeshi novelists Category:Critics Category:Gynecologists",
 "title": "Taslima Nasrin"
}