{
 "id": "1135237",
 "text": "Alois Hitler Jr. (born Alois Matzelsberger, 13 January 1882 - 20 May 1956) was the half-brother of Adolf Hitler. ==Biography== Alois Hitler Jr. was born Alois Matzelsberger, the illegitimate son of Alois Hitler and his later second wife Franziska Matzelsberger, and was baptized in the parish church of St. Othmar unter den Weißgerbern. It was not until his parents' wedding in 1883 that his parentage was confirmed. In the same year, his sister Angela was born. After this birth, his mother fell ill with tuberculosis and died on August 10, 1884. Alois and his sister then grew up with their father and his third wife Klara Hitler. Alois left his parents' home before his father's death. Alois never seemed to get along well with his half-brother Adolf. He later reported that Adolf was always favored by his mother Klara, while Alois was beaten by his father for Adolf's pranks. Since Alois Hitler Jr. showed technical talent, his father intended to send him to a suitable school and become an engineer. It seems that these hopes were suddenly abandoned, perhaps thanks to the intervention of Klara, the father was not willing to invest large sums in his son's education. Instead, Alois received an apprenticeship. With the end of his apprenticeship, Alois Hitler Jr.'s downfall began. In 1900, he was sentenced to five months in prison for theft. In 1902, he had to go to prison for another eight months. Finally, in 1905, after serving his prison sentence, he emigrated to London, where he resumed his apprenticeship, and in 1909, he married Bridget Dowling, who was of Irish descent. In 1911, their son William Patrick was born in Liverpool. The next four years were marked by tensions in the family. Alois was a heavy drinker and beat his wife and probably their young child as regularly as he drank. In 1915, his father left the family and returned to Austria In 1924, Alois Hitler Jr. was arraigned in Hamburg on charges of bigamy. However, because his wife did not press further charges, the six-month prison sentence was suspended or overturned. He also had a child, Heinrich, with his second, illegitimate wife, Hedwig Frieda Amalie \"Hete\" Mickley (1889–1966) from Groß Neuendorf, whom he married on 13 December 1919 in Hamburg. He joined the NSDAP on 3 August 1926 (membership number 41,754), and left it again on 30 September 1927. His unspecified businesses in Germany flourished positively until the world economic crisis, but then collapsed. He survived until 1934 by doing odd jobs. On 15 September 1937, he opened the \"Konditorei Cafe Alois\" in Berlin, Wittenbergplatz 3, which became a popular meeting place for SA men. Since his half-brother Alois Jr. came to power, Adolf and he no longer have any known contact with each other. In Mein Kampf, Alois Jr. is kept completely secret. Only a few knew about Hitler's half-brother. After the end of World War II, Alois Hitler – now called Alois Hiller – lived unrecognized in a middle-class environment with his family in Hamburg-Fuhlsbüttel. His grave was in the main cemetery in Ohlsdorf; it was abandoned in 2005. In addition to Alois's wife Hete, the family grave included a distant relative (Johannes Theodor) Hans Hitler and his wife Erna, called Petra, née Schünemann, married to Mach. Hans and Erna Hitler also officially changed their name to Hiller. Category:1882 births Category:1956 deaths Category:German people Category:Hitler family",
 "title": "Alois Hitler Jr."
}