{
 "id": "1136465",
 "text": "The 1924 Brussels Femina Club international women's athletics meeting was an international women's athletics competition in Brussels, Belgium organized by the Brussels Femina Club. The meeting was held at Duden Park from 9 to 10 August 1924. It was the third time the meeting was held. Compared to the two former editions in 1922 and 1923 where the Belgian athletes competed against French and Belgian athletes, in this edition the Belgian athletes competed against athletes from Czechoslovakia. Next to the competitions there was a demonstration of ball throwing (derived from hammer throwing) and on Sunday an match of Czhech handball (in some countries called hazena), a Czechoslovak national sport. Next to the international events, the meeting also included national 2nd division and students' athletics events. ==Entrants== The names of Czechoslovak athletes were published on 7 August. On 9 August a the schedule of the first day was published with the name of the athletes. Czechoslovak athletes Name Event(s) Bozena Srámková 60 metres 83 metres hurdles Long jump Javelin throw 4 x 80 metres relay 80 metres 200-100-200-100 metres relay Aloisie Prokešová 60 metres 250 metres Long jump 4 x 80 metres relay 80 metres 200-100-200-100 metres relay Marie Mejzlikova II 60 metres Long jump 4 x 80 metres relay Discus throw? 80 metres 200-100-200-100 metres relay 60 metres Long jump 4 x 80 metres relay Shot put 80 metres High jump Marie Mejzlikova I 250 metres Discus throw? Shot put 200-100-200-100 metres relay Kamila Olmerova 250 metres Javelin throw Mária Vidláková 83 metres hurdles Discus throw Katzova 83 metres hurdles Javelin throw Věra Galusková Shot put High jump Belgian international athletes Name Club Event(s) Elise Van Truyen Brussels Femina Club 60 metres 250 metres Long jump 4 x 80 metres relay 80 metres 200 metres High jump Lisette Pétré Brussels Femina Club 60 metres 4 x 80 metres relay 4 x 80 metres relay 200-100-200-100 metres relay Callebout Brussels Femina Club 60 metres Long jump 4 x 80 metres relay 200-100-200-100 metres relay Denis Brussels Femina Club 60 metres 200-100-200-100 metres relay Desmedt Brussels Femina Club Javelin throw Pinnel Brussels Femina Club Javelin throw Verduyn Brussels Femina Club Shot put Jenny Toitgans Brussels Femina Club Discus throw Henriette Vandaelen Olympic Fémina 60 metres 83 metres hurdles Louise Gits Olympic Fémina 60 metres 250 metres 4 x 80 metres relay Paulette Andry Olympic Fémina 60 metres 83 metres hurdles 80 metres 200-100-200-100 metres relay Seminckx Olympic Fémina 60 metres 200 metres Lucienne Renaux Olympic Fémina Javelin throw Léontine Stevens Sportives 250 metres Long jump Javelin throw? High jump Sportives 250 metres Long jump Javelin throw(?) Georgette Vandyck Sportives Javelin throw ==Schedule== The meeting stated on both days at 15:00 (local time). Category Event Round Saturday 10 August Saturday 10 August Saturday 10 August Saturday 10 August students 60 metres international Javelin throw right + left international 60 metres heats + final 2nd division 80 metres heats + final international Long jump international 83 metres hurdles international 250 metres students High jump 2nd division 4 x 200 metres relay international 4 x 80 metres relay Sunday 11 August Sunday 11 August Sunday 11 August Sunday 11 August 2nd division 200 metres international Discus throw international 80 metres Heats + Final international Shot put Right + Left 2nd division 300 metres international 200 metres 2nd division Long jump 2nd division 4 x 80 metres relay international High jump national 1000 metres international 100-200-100-200 metres relay ==Results (international)== ===Javelin throw=== The javelin throw was won with \"superiority\" by the world record holder Kamila Olmerova. Place. Athlete Right Left Total Note 1 26.81 m 20.43 m 47.24 m 2 26.73 m 17.41 m 44.16 m 3 21.62 m 16.91 m 38.53 m 4 19.64 m 16.84 m 36.48 m 5 19.84 m 13.19 m 33.03 m ===60 metres=== All Czechoslovak athletes qualified for the final. The Belgians Callebout, Denis, Henriette Vandaelen, Louise Gits, Paulette Andry and Seminckx didn't qualify for the final. Heat 1 Place Athlete Time Note 1 8.4 sec Q 2 +1 m Q 3 + 0.5 m Q Heat 2 Place Athlete Time Note 1 8.2 sec Q 2 +1 m Q 3 + 0.75 m Q Final Place Athlete Time Note 1 8.6 sec 2 3 4 5 6 ===Long jump=== Place Athlete Distance 1 4.84 m 2 4.78 m 3 4.62 m 4 4.19 m 3 4.17 m 4 3.93 m ===83 metres hurdles=== The 83 metres hurdles was won by Henriette Vandaelen who was leading the whole race. She ran with a \"very classic\" style. Place Athlete Time 1 14.2 sec 2 14.4 sec +4 m 3 14.4 sec ===250 metres=== The race was led from start to finish by Marie Mejzlikova I. Place Athlete Time 1 36.8 s 2 + 3 m 3 + 1 m 4 + 5 m 5 ===4 x 80 metres relay=== Denis dropped the baton and lost several meters, and so there was an easy victory by Czechoslovakia. Place Team Time 1 Marie Mejzlikova II Aloisie Prokešová Bozena Srámková 2 Elise Van Truyen Denis Louise Gits Lisette Pétré + 25 m ===Discus throw=== Each athlete had three attempts. Place Athlete Distance 1 26.05 m 2 24.88 m 3 24.68 m ===Spot put=== After three additional attempts, Marie Mejzlikova I broke the national record. Place. Athlete Right Left Total Note 1 9.74 m 7.88 m 18.75 m 10.075? 2 8.11 m 8.34 m 16.43 m 8.23? 3 8.40 m 6.86 m 13.97 m 7.99? 4 7.83 m ===80 metres=== There were several false start during the final race. Marie Mejzlikova II won after leading the whole race. Heat 1 Place Athlete Time Note 1 10.5 sec Q 2 +4 m Q 3 Q Heat 2 Place Athlete Time Note 1 11.2 sec Q 2 +1 m Q 3 Q Final Place Athlete Time Note 1 10.4 sec 2 +1 m 3 +0.5 m 4 5 6 ===200 metres=== Elise Van Truyen was leading after the start, but was overtaken by Marie Mejzlikova I at the first corner. Place Athlete Time 1 28.4 s 2 + 2 m 3 4 ===High jump=== Place Athlete Height Note 1 1.44 m 2 1.35 m or 1.39 m 3 1.34 m 4 1.30 m ===200-100-200-100 metres relay=== Place Team Time 1 Marie Mejzlikova I Marie Mejzlikova II Aloisie Prokešová Bozena Srámková 1:24.3 2 Denis Paulette Andry Callebaut Lisette Pétré + 10 m ===Czech handball match=== The Czechoslovak team gave a demonstration in Czech handball. The game of two teams was well received by the spectators. ==Related pages== *1922 Brussels international women's athletics competitions ==References== ==Other websites== *Images of athletes during the meeting (page 4) Category:1924 in women's athletics Category:Sport in Belgium Category:1924 in Europe Category:1920s in Belgium Category:Brussels",
 "title": "1924 Brussels Femina Club international women's athletics meeting"
}