{
 "id": "1136054",
 "text": "Helen M. Krepps with marriage name Smith (30 September 1901 - 29 June 1960) was an American track and field athlete during the 1920s, the early era of women's athletics. She was specialized in hurding and sprinting. She also played basketball. ==Biography== Krepps was born on 30 September 1901 as a daughter of Samuel A. Krepps (1866-1935) and Cora Busby (1870-1963). She had a youngher sister Dorothy Elizabeth Krepps (1908-2001). As a student at the Ohio State University she was for three years active in athletics and playing basketball. At the third annual track meet at the Ohio State University in May 1922 she won individual honors with 23 points, ahead of Margaret Meyer with 13 points and Mary Dustman third with 12 points. She won the 100 yard hurdles events in a time of 16 seconds, equalling the Collegiate record. She also won the 50 yard event in 7 seconds. In the 220 yard relay she broke the collegiate record held by Ohio Wesleyan with a time of 28.8 together with Ruth Smith, Helen Rheuhlen, and Elizabeth Winans. While Krepps didn't compete at the 1922 United States Women's World Games trials she was selected to represent the United States at the 1922 Women's World Games in Paris, France. However, the decided not to join the American team. In 1923 she graduated with a Bachelor of Arts degree from the Ohio State University. In 1924 Krepps started working as a physical education instructor and women's basketball coach at the East Tennessee Normal School (nowadays called East Tennessee State University). In 1930, Krepps was voted as the most popular faculty member by the studens. The same year the college replaced women's intercollegiate sports with an intramural program. Krepps continued working at the college until 1933. Krepps was sponsor of the literary society Sigma Pi. Krepps married in 1932 to Melville Dwight \"Mel\" Smith (1900-1982). Krepps Smith died on 29 June 1960 at the age of 58 years old. She is buried at the Happy Valley Memorial Park in Elizabethton. ==References== ==Other websites== *Image of Krepps Category:1901 births Category:American sprinters Category:1960 deaths Category:American hurdlers Category:Coaches Category:American basketball players Category:Ohio State University Category:Sportspeople from Columbus, Ohio",
 "title": "Helen Krepps"
}