{
 "id": "1136406",
 "text": "Gaston Defferre (14 September 1910 – 7 May 1986) was a French Socialist politician who served as the mayor of Marseille for 33 years, from 1953 until his death in 1986. He also held various ministerial positions throughout his political career, including Minister of the Interior and Decentralization, and was a key figure in the French Section of the Workers' International (SFIO), later the Socialist Party. == Early life and career == Born in Marsillargues, Defferre became a lawyer and entered politics as a member of the French Section of the Workers' International (SFIO). He was active in the French Resistance during World War II as part of the Brutus Network. He was first elected to the National Assembly in 1945 and remained an influential political figure for decades.https://www.nytimes.com/1986/05/08/obituaries/gaston- defferre-of-marseilles-socialist-and-a-tough-mayor.html == Ministerial roles == Defferre served as Minister of Overseas Territories in the mid-1950s, playing a significant role in France's decolonization of Africa. His legislative effort, the Loi-cadre Defferre, laid the groundwork for the independence of many French colonies in sub-Saharan Africa. In 1981, following the election of François Mitterrand, Defferre was appointed Minister of the Interior and Decentralization, where he pushed for greater local governance reforms. == Duel with René Ribière == In 1967, Defferre became notorious for engaging in the last known duel in French history. Following a heated argument in the National Assembly, Defferre insulted René Ribière, who challenged him to a sword duel. Defferre won the duel, but Ribière was only lightly wounded.https://www.historia.fr/histoire-de-france/xxeme-siecle-a- aujourdhui/21-avril-1967-gaston-deferre-contre-rene-ribiere-le-dernier-duel- en-france-2095876 == Personal life == Defferre was married three times, most notably to writer Edmonde Charles-Roux. He died on 7 May 1986 in Marseille at the age of 75. == References == Category:1910 births Category:1986 deaths Category:Socialist Party (France) politicians Category:French mayors Category:Politicians from Marseille Category:People from Hérault",
 "title": "Gaston Defferre"
}