{
 "id": "1136665",
 "text": "The South Kermadec Ridge Seamounts are a chain of underwater volcanic formations located along the Kermadec Ridge, in the Pacific Ocean. This region marks the convergent boundary where the Pacific Plate subducts beneath the Indo-Australian Plate, forming the Kermadec Trench, one of the deepest oceanic trenches in the world. The seamounts are part of a larger volcanic island arc system that became active during the Quaternary period. The Kermadec Ridge extends southwest from the Kermadec Islands towards New Zealand's North Island, and northeast towards Tonga.https://www.researchgate.net/publication/334050397 == Geology == The South Kermadec Ridge Seamounts are part of a relatively young oceanic arc- back-arc system in the Kermadec Arc - Havre Trough, and include several significant seamounts with varying depths: * Speight Knoll −1,840 metres (−6,037 ft) * Oliver Knoll −2,200 metres (−7,218 ft) * Haungaroa Seamount −660 metres (−2,165 ft) * Kuiwai Seamount −560 metres (−1,837 ft) * Ngātoroirangi Seamount −340 metres (−1,115 ft) * Brothers Seamount −1,350 metres (−4,429 ft) * Rumble III Seamount −140 metres (−459 ft) The Brothers Seamount features two large calderas, formed during a major volcanic eruption in 1360 ± 75 CE. Rumble III Seamount is the largest of the Rumbles seamount chain and has experienced multiple eruptions, the most recent being on 2 July 2008. === Notable Seamounts === Other significant seamounts in the area include: * Sonne Seamount * Kibblewhite Seamount −990 metres (−3,248 ft) * Gill Seamount −1,200 metres (−3,937 ft) * Yokosuka Seamount −1,060 metres (−3,478 ft) * Rapuhia Seamount −650 metres (−2,133 ft) * Rumble I Seamount −1,100 metres (−3,609 ft) == Eruptions == The Rumble III Seamount has erupted multiple times, with notable eruptions occurring on: * 9 July 1958 * 16 January 1963 * 15 October 1973 * 15 June 1986 * 2 July 2008 == References == == Other websites == * OpenStreetMap link to the South Kermadec Ridge Seamounts Category:Pacific Ocean",
 "title": "South Kermadec Ridge Seamounts"
}