{
 "id": "1136873",
 "text": "Edith Trickey (born 31 August 1903) was a British track and field athlete during the 1920s, the early era of women's athletics. She was specialized in the middle-distance events (800 meters, 880 yards, 1000 metres) and in race walking but also competed in the 200 metres. She was the world record holder and won among others the gold medal at the 1926 Women's World Games. ==Biography== On 8 August 1923, she set the world record the 880 yards at events at Bromley. On 28 June 1924 she improved the record. British World Record Breakers GBR Athletics (läst 8 augusti 2015) In 1923, 1924 and 1936 she became British champion in race walking. British Athletics Championships 1919-1939 GBR Athletics On 4 August 1924, she set a world record in the 1000 meters at the 1924 Women's Olympiad at Stamford Bridge in London, where she broke Lucie Bréard's two-year-old world record. She also won the silver medal in the 1000 meters behind Albertine Regel. Track and Field Statistics Brinkster.net Harris became national 880 yards champion five times in a row from 1923 to 1927. At the national championships in 1925 she won in a new world record time of 2:26.6. At the 1925 Great Britain–Czechoslovakia–Canada women's athletics match she improved her world record time to 2.24.0. In 1925 she had also won the 800 meters event at the 1925 Brussels Femina Club international women's athletics meeting. The next she competed at the 1926 Women's World Games in Gothenburg. Trickey won the 1000 metres event. After the games she also won the 1000 metres event at the 1926 Stockholm international women's athletics meeting. In October 1926 she won the 1000 metres at the 1926 Paris international women's athletics meeting. At the 1927 Berlin international women's athletics meeting she won the 800 metres in a time of 2:27.6 that was stated to be a world record. ==References== Category:1903 births Category:British middle-distance runners Category:Year of death missing Category:Racewalkers Category:British sprinters",
 "title": "Edith Trickey"
}