{
 "id": "1136738",
 "text": "Robert Emory Pattison (December 8, 1850 – August 1, 1904) was an American Democratic politician and lawyer who served as Governor of Pennsylvania from 1883 to 1887 and again from 1891 to 1895. ==Governorship== During Pattison’s two terms as governor, a number of progressive social reforms were carried out. During his first term, several measures of a progressive nature were passed, while Pattison revealed a scandal in the conduct of soldiers’ orphans’ schools. This led, according to one study, to “their greatly improved condition.” Pennsylvania, the story of a commonwealth, by Robert Fortenbaugh and H. James Tarman, P.291 In addition, an Act of 1885 made it the duty of the “owner or owners in fee or for life” to erect fire-escapes.Factory legislation in Pennsylvania : its history and administration by J. Lynn Barnard no.19, P.30 In 1893, an Act was passed that forbade “the employment of any minor under the age of fourteen in and about elevators.”[https://babel.hathitrust.org/cgi/pt?id=mdp.39015069408345&seq;=83 Factory legislation in Pennsylvania : its history and administration by J. Lynn Barnard no.19, P.66 That same year, an Act was passed that enlarged the scope of a Factory Act from 1889. It did this by adding laundries and renovating establishments while also limiting the number of hours which a minor might work to 12. In addition, it extended the 1889 Act to factories and mercantile establishments that employed 5 persons, instead of 10, and raised the age of admission from 12 to 13.Factory legislation in Pennsylvania : its history and administration by J. Lynn Barnard no.19, P.66-67 ==Death== He died at his home in Philadelphia on August 1, 1904. The New York Times said that the stress of his final gubernatorial campaign led to his death. ==References== Category:Democratic Party (United States) politicians Category:Governors of Pennsylvania Category:Politicians from Maryland Category:1850 births Category:1904 deaths Category:Lawyers from Maryland Category:Lawyers from Philadelphia Category:Politicians from Philadelphia",
 "title": "Robert E. Pattison"
}