{
 "id": "1136712",
 "text": "SING, or the Super Impassioned Net Generation, (simplified Chinese: SING女团; traditional Chinese: SING女團) is a Chinese girl group formed by KuGou Music in 2015. Originally consisting of 10 members from various regions of China, the current lineup features 5 members. They primarily produce electronic dance music with influences from traditional Chinese music. == History == === 2015: Formation and debut === SING made its debut on August 10, 2015, with 10 members. Due to a limited budget, the group focused on generating revenue through royalties, licensing fees, and merchandise sales rather than relying on concert ticket income. === 2016: Line-up changes === Four members suspended their activities in 2016, and three new members were added to the group. === 2017: Change in sound === In September, the group SING released a new song called \"Moonlight Thoughts,\" which is their first electronic dance song with a Chinese style. This song helped them become more popular in China. In December, they had a Christmas concert called Part of Me. After the concert, one of the members, Lin Jinyi, took a break due to health concerns. In November, the Super Impassioned Net Generation launched their first international album, SING, on iTunes and Spotify. === 2018-2019: More === In March 2018, three members of SING took part in a reality show called Produce 101. Jiang Shen finished in 23rd place, and Xu Shiyin came in 75th place. However, Lai Meiyun finished in 6th place, which let her join the group Rocket Girls. ING performed at the 2nd International Youth Conference in Shenzhen on August 12. Sophie gave a speech called \"Mixing Youth Culture with Traditional Culture through Electronic Chinese Style Music.\" In her speech, she shared her thoughts on how young people can carry on and change traditional Chinese culture based on her own experience. SING joined the TV show competition called \"Wo Yao Shang Chun Wan\" with their song \"Moonlight Thoughts\" on December 29, 2018. This show helped pick the performance for the big CCTV Spring Festival Event. Even though SING lost, they moved on to the finals because their fans voted for them. Xu Shiyin released her first solo \"Bai Yi Shao Nian\" on March 14 with the accompanying music video music video on June 26. The song was used as the ending theme for the drama, \"I Will Never Let You Go\" which aired on January 8, 2019. The variety show SING HOME premiered in 2019, with each episode centered around a different theme. It includes activities like games, team discussions, and fan interactions. Debbie released her first solo song, \"Mermaid,\" on January 4, and the music video came out on January 21. She said she picked the title because she wanted her song to draw people in, just like a mermaid's singing. SING sang the song \"Ru Meng Ling\" in the final of \"Wo Yao Shang Chun Wan\" on January 26, but they lost to their competitor with a score of 0–5. On January 28, SING, Han Xue, and Wu Mochou performed \"Hui Jia Guo Nian La\" at the CCTV Internet Spring Festival Event. Then, on January 29, SING, Han Xue, and Oscar Qian sang \"Nian Ye Fan\" for the Hunan TV Spring Festival Event. On February 3, SING performed \"Huan Le Zhong Guo Nian\" at the Jiangxi TV Spring Festival Event. The next day, on February 4, they sang \"Tuan Tuan Yuan Yuan\" for the CCTV Spring Festival Countdown. Also, on February 4, SING performed \"Ru Meng Ling\" and \"Qian Nian\" for the Guangdong TV Spring Festival. Their song \"Tuan Tuan Yuan Yuan\" was used as the background music for \"The Reunion\" during the 7th Hong Kong Lunar New Year Firework Show on February 6. == References == Category:Chinese people Category:Girl groups Category:2015 establishments in Asia",
 "title": "Super Impassioned Net Generation"
}