{
 "id": "1136958",
 "text": "Border support operationss old name is Operation Faithful Patriot. Operation Faithful Patriot is happening now. Operation Faithful Patriot is like a war for the armed forces but in the United States. Operation Faithful Patriot is the armed forces helping parts of the government that are not armed forces. Operation Faithful Patriot is happening at the Mexico–United States border. United States Northern Command says Operation Faithful Patriot is stopping border crossings against the law before they happen. The National Guard's Operation Guardian Support was already happening. Operation Faithful Patriot is also helping Operation Guardian Support. ==What was happening before== In early October 2018, several thousands people fled gangs from the Northern Triangle of Central America (NTCA) overland north in three groups. Some of these people said they would cross through Mexico and later into the U.S. border. Newsweek says that is why Donald Trump took a hard-line stance against people breaking the law to come through on the Mexican border. ==What happened by date== Operation Guardian Support is made of National Guard the states have chosen to send to help at the border. In April 2018, President Donald Trump told Operation Guardian Support to help the United States Border Patrol in their ongoing work to guard the border. In October 2018, these border support operations were then known as Operation Faithful Patriot. Operation Faithful Patriot was started to give U.S. military help to U.S. Customs and Border Protection (CBP) in the southwest United States. This help was help to fight the people coming to cross the border in a way that is against the law. Trump told them to do this on October 26, 2018. That made United States Secretary of Defense Jim Mattis sign the thing that told them to go and do that later that day. General Terrence J. O’Shaughnessy of the United States Northern Command says that Operation Faithful Patriot is the sending of federal troops to do two things: \"to harden the southern border\"; and help the National Guard soldiers already there helping the CBP along the United States' southwestern border. By October 29, 2018, about 800 soldiers of the first soldiers to go there had been sent. People heading the soldiers said the rest would be in place by the end of that week. KQED-FM said that someone had talked to them. They said that they would not give someone's name. They said that someone said the soldiers were being moved to areas where they would wait and then go somewhere else. Those areas were in California, Texas, and Arizona From there the soldiers would be sent to places CBP asked them to go. Things that are worn and used when fighting a riot were also given to the CBP. These things were owned by the United States Army. These things were given by the United States Army. This giving was also part of Operation Faithful Patriot. On November 7, 2018, the Pentagon told the world that the name Operation Faithful Patriot was no longer in use. Instead, Operation Faithful Patriot will be simply called \"border support.\" Defense Secretary Jim Mattis told them to change the name the day before because the original name had \"political overtones.\" Most of the troops went to Texas. The place they went to is hundreds of miles away from the place where the people were crossing the border against the law. That place was Tijuana. Under the Posse Comitatus Act of 1878, federal soldiers are not allowed to carry out law jobs. During border jobs, they may not stop people crossing the border against the law or take drugs that are against the law away from people. They have helped the Border Patrol by fixing vehicles. Other things they do are: using flying things that carry soldiers to carry border patrol workers to and from places along the U.S.-Mexico border; and using cranes to put towering things made of metal bars into place. They have also strung sharp wire and wrapped it around things that stop people to make the border stronger. On January 31, 2019, Acting Defense Secretary Patrick M. Shanahan told the world that more troops, likely a few thousand, would be sent to the border. The count of soldiers was raised to roughly 6,000 troops, drawn from the Marines, Army, Air Force and Navy, and their stay was made even longer, through September 2019. By March, a plan was being worked on to ask the Defense Department for more federal troops to help with dealing with the people who cross the border against the law, moving people to other places and health help in high-crossing areas. The draft plan also uses Defense Department land to house people who cross the border against the law in places where they can't leave. On March 23, 2020, in spite of the COVID-19 pandemic across the U.S. and worldwide, Lt. Col. Chris Mitchell said that the Pentagon “has no plans to pull units off the border for [helping stop this disease]” and the Defense Department said that the troops at the border were allowed to stay there through September 30, 2020. ==Groups of soldiers sent there== As of October 29, 2018, a full list of groups of soldiers helping Operation Faithful Patriot had not been given to the world, but those were said to be: military police, and combat aviation, combat engineer, health, and civil affairs. These groups of soldiers are 5,000 U.S. soldiers and 2,000 National Guard troops who had already been sent there to help Operation Guardian Support. A group of soldiers with 7,000 more troops had been placed on \"24-hour [warning]\" to help the border guards if those soldiers turned out to not be enough. ===U.S. soldier groups=== 1st MLG 7TH ENGINEER SUPPORT BATTLION SUPPORT COMPANY MOTOR TRANSPORT PLT * 3rd Brigade, 101st Airborne Division (Rakkasans) ==== 1st Engineer Battalion ==== * 41st Engineer Company ==== 16th Military Police Brigade ==== * 503rd Military Police Battalion (ABN, -65th Military Police Company -108th Military Police Company * 91st Military Police Battalion -563rd Military Police Company *42nd Military Police Brigade -66th Military Police Company ====36th Engineer Brigade ==== * 62nd Engineer Battalion ==== 89th Military Police Brigade ==== * Headquarters and Headquarters Company * 287th Military Police Company * 212th Military Police Company * 591st Military Police Company * 977th Military Police Company ==== 63rd Expeditionary Signal Battalion ==== *Charlie Company ====3rd Combat Aviation Brigade (Hunter Army Airfield)==== 2nd Battalion 82nd Combat Aviation Brigade Fort Bragg, NC, Alpha/Charlie Air Assault Assault Companies, D Co Aviation maint support 2nd Battalion Bravo General Support 3rd Brigade Combat Team, 101st Airborne DIV ==== 3rd Squadron, 89th Cavalry Regiment ==== HHT A Troop B Troop D Forward Sustainment Troop ===National Guard=== A National Guard job to stop people from crossing the border against the law was already being done at the US–Mexico border. That National Guard jobs is called Operation Guardian Support. Operation Guardian Support has four parts: Task Force Anzio, Task Force Salerno, Task Force Defender, and Task Force Aviation. The National Guards of Arizona, Texas, South Carolina, Oklahoma, Georgia, Missouri, Alabama, Florida, and Mississippi have sent soldiers to be part of Operation Guardian Support. Virginia sent soldiers to help Operation Guardian Support early. Virginia then withdrew its soldiers in June 2018 on the order of Governor Ralph Northam. 285th Aviation Regiment (Arizona) * 2nd Battalion Alpha/Bravo Air Assault Assault Companies ====72nd Infantry Brigade Combat Team (Texas)==== * 536th Brigade Support Battalion (elements) ====114th Aviation Regiment (Mississippi)==== * 1st Security and Support Aviation Battalion (elements) ====133rd Field Artillery Regiment (Texas)==== * 3rd Field Artillery Battalion (elements) ====151st Aviation Regiment (South Carolina)==== * 2nd Security and Support Aviation Battalion (elements) ==Piece of metal given for helping== The Armed Forces Service Medal will be given to troops who have been sent to the border. The AFSM is given to soldiers who have helped Operation Faithful Patriot because: these soldiers are helping as part of groups; Operation Faithful Patriot is a U.S. soldier job that the U.S. military has said is an important job; and if they have not been in danger during this time. == References == Category:October 2018 events Category:2018 in the United States Category:Immigration to the United States Category:Presidency of Donald Trump",
 "title": "Operation Faithful Patriot"
}