{
 "id": "1136772",
 "text": "The 56th Arizona Legislature is the current legislative session of the Arizona Legislature. There are 30 senators and 60 representatives. Republicans had a Majority in both chambers. https://www.azleg.gov/alispdfs/Session_Timeline_2023.pdf ==List of Members of the Senate== Members of the Senate District Senator Party 1 Ken Bennett Republican 2 Steve Kaiser Republican 3 John Kavanagh Republican 4 Christine Marsh Democratic 5 Lela Alston Democratic 6 Theresa Hatathlie Democratic 7 Wendy Rogers Republican 8 Juan Mendez Democratic 9 Eva Burch Democratic 10 Dave Farnsworth Republican 11 Catherine Miranda Democratic 12 Mitzi Epstein Democratic 13 J. D. Mesnard Republican 14 Warren Petersen Republican 15 Jake Hoffman Republican 16 T. J. Shope Republican 17 Justine Wadsack Republican 18 Priya Sundareshan Democratic 19 David Gowan Republican 20 Sally Ann Gonzales Democratic 21 Rosanna Gabaldón Democratic 22 Eva Diaz Democratic 23 Brian Fernandez Democratic 24 Anna Hernandez Democratic 25 Sine Kerr Republican 26 Raquel Terán Democratic 27 Anthony Kern Republican 28 Frank Carroll Democratic 29 Janae Shamp Republican 30 Sonny Borrelli Republican == List of Members of the House == District Representative Party 1 Quang Nguyen Republican Selina Bliss Republican 2 Judy Schwiebert Democratic Justin Wilmeth Republican 3 Joseph Chaplik Republican Alexander Kolodin Republican 4 Matt Gress Republican Laura Terech Democratic 5 Jennifer Longdon Democratic Amish Shah Democratic 6 Myron Tsosie Democratic Mae Peshlakai Democratic 7 David Cook Republican David Marshall Republican 8 Athena Salman Democratic Melody Hernandez Democratic 9 Lorena Austin Democrat Seth Blattman Democrat 10 Justin Heap Republican Barbara Parker Republican 11 Marcelino Quiñonez Democratic Oscar De Los Santos Democratic 12 Patty Contreras Democratic Stacey Travers Democratic 13 Jennifer Pawlik Democratic Liz Harris Republican 14 Travis Grantham Republican Laurin Hendrix Republican 15 Jacqueline Parker Republican Neal Carter Republican 16 Teresa Martinez Republican Keith Seaman Democratic 17 Rachel Jones Republican Cory McGarr Republican 18 Christopher Mathis Democrat Nancy Gutierrez Democrat 19 Gail Griffin Republican Lupe Diaz Republican 20 Andrés Cano Democratic Alma Hernandez Democrat 21 Consuelo Hernandez Democratic Stephanie Stahl Hamilton Democratic 22 Lupe Contreras Democratic Leezah Sun Democratic 23 Mariana Sandoval Democratic Michele Pena Republican 24 Lydia Hernandez Democrat Analise Ortiz Democrat 25 Tim Dunn Republican Michael Carbone Republican 26 Cesar Aguilar Democrat Flavio Bravo Democrat 27 Kevin Payne Republican Ben Toma Republican 28 David Livingston Republican Beverly Pingerelli Republican 29 Steve Montenegro Republican Austin Smith Republican 30 Leo Biasiucci Republican John Gillette Republican ==References== Category:Arizona Legislature Category:Sessions of the Arizona Legislature",
 "title": "56th Arizona Legislature"
}