{
 "id": "1136161",
 "text": "On September 29, 2023, the Roman Catholic Archdiocese of Baltimore asked a court to let them not pay some of their debts.http://www.mdb.uscourts.gov/case-info/re-roman-catholic-archbishop- baltimore-chapter-11-case-23-16969 They asked for this so the Maryland Child Victims Act would not be able to make them pay money. The Maryland Child Victims Act was going to begin working on October 1, 2023. One of the reasons for asking for this bankruptcy was the Baltimore Catholic Archdiocese wanting to avoid having to pay money for a thing under the Maryland Child Victims Act. That thing was the Archbishop Keough High School sex abuses. Those sex crimes have to do with the Murder of Catherine Cesnik. Some people say that this bankruptcy makes the Maryland Child Victims Act not work. Those people are people who say they had bad sex things done to them as children and people who talk for people who say they had bad sex things done to them as children.http://www.wypr.org/wypr-news/2023-10-03/baltimore-archdiocese- bankruptcy-brings-new-time-crunch-for-alleged-victims ==Why did the Roman Catholic Archdiocese of Baltimore file for bankruptcy in 2023?== The Roman Catholic Archdiocese of Baltimore has chosen to ask a court to let it not pay some of its bills because the Roman Catholic Archdiocese of Baltimore will thereby avoid going to court with the people who say the Roman Catholic Archdiocese of Baltimore did bad sex things to them.http://www.archbalt.org/chapter-11-faq/ ==What the 2023 bankruptcy of the Roman Catholic Archdiocese of Baltimore does== This bankruptcy keeps the stories of bad sex things people say the Archdiocese has done from being heard in civil court.http://msmagazine.com/2023/10/11/archdiocese-catholic- baltimore-bankruptcy-child-sexual-abuse/ This bankruptcy makes it harder to find out about those stories in the bankruptcy court.http://apnews.com/article/church-abuse-bankruptcy-baltimore-archdiocese- fd2c76a1764af8c61f17db73c6655510 The 2023 bankruptcy of the Baltimore Catholic Archdiocese prevents subpoenas and public testimony before a jury. That means ther 2023 bankruptcy of the Baltimore Catholic Archdiocese will prevent information from reaching the public.http://www.washingtonpost.com/religion/2023/09/29/catholic-bankruptcy- baltimore/ The 2023 bankruptcy of the Roman Catholic Archdiocese of Baltimore has made a disagreement between the Baltimore Catholic Archdiocese and its insurers.http://www.baltimoresun.com/2024/04/26/archdiocese-bankruptcy- insurer-tension/ A message was sent to many people in Maryland. That message was sent September 5, 2023. That message was Roman Catholic Archbishop of Baltimore William E. Lori saying \"If a plan is approved by the bankruptcy court, no future claims for past cases of abuse can be brought against the Church.\" That means: If the bankruptcy court says yes to the Roman Catholic Archdiocese of Baltimore, some things can never happen again. Those some things are people going to court against the Roman Catholic Archdiocese of Baltimore for some reason. That some reason is bad sex things that those people say happened in the past.http://www.baltimoresun.com/2023/09/29/baltimore-archdiocese-declares- bankruptcy-ahead-of-child-victims-act-becoming-law/ The 2023 bankruptcy of the Roman Catholic Archdiocese of Baltimore may let the parishes also not pay some money for bad sex things.http://www.nbcwashington.com/investigations/what- archdiocese-of-baltimore-bankruptcy-proceedings-mean-for-survivors-of- abuse/3457203/ On December 18 2023, Judge Michelle M. Harner ordered May 31 to be the \"bar date\" for the 2023 bankruptcy of the Roman Catholic Archdiocese of Baltimore.http://catholicreview.org/5-things-to-know-about-the-bar-date-in- the-archdiocese-of-baltimores-bankruptcy-case/ ==About the 2023 bankruptcy of the Roman Catholic Archdiocese of Baltimore== The papers for the 2023 bankruptcy of the Roman Catholic Archdiocese of Baltimore are wriiten in the name of the Roman Catholic Archbishop of Baltimore. The 2023 bankruptcy of the Roman Catholic Archdiocese of Baltimore is Case # 23-16969. The next hearing for the 2023 bankruptcy of the Roman Catholic Archdiocese of Baltimore will be 10:00AM ET, December 9 2024. The next hearing for the 2023 bankruptcy of the Roman Catholic Archdiocese of Baltimore will be an omnibus hearing.http://dm.epiq11.com/case/rcabaltimore/info ==References== ==Other things to read== * http://www.baltimoresun.com/2024/10/15/900-to-1000-sex- abuse-claims-filed-baltimore-archdiocese-bankruptcy/ Category:2023 in the United States Category:Roman Catholicism",
 "title": "2023 bankruptcy of the Roman Catholic Archdiocese of Baltimore"
}