{
 "id": "1136746",
 "text": "Mina Harker is a fictional character in Dracula by Bram Stoker. She is Jonathan Harker’s wife. == Early Life == When Mina was born, her name was Wilhelmina Murray. Mina was a nickname. She was best friends with a girl named Lucy Westenra. == Marriage to Jonathan Harker == When she was an adult, a lawyer named Jonathan Harker asked her to marry him and she said yes. After Jonathan went to Transylvania to meet Count Dracula, Mina’s friend Lucy Westenra started sleepwalking. Mina later visited Jonathan at a hospital in Transylvania and he gave her his diary. Then Jonathan and Mina went back to England and got married. Then Mina started using Jonathan’s last name. == Joining Van Helsing == After Lucy Westenra died, Jonathan saw Count Dracula and was scared of him so Mina read his diary and was worried about it. Dr. Abraham Van Helsing asked her for the diary and she gave it to him. Van Helsing read it and told her that everything in it was real. Mina and Jonathan then tried to help Van Helsing find and kill Dracula. Mina talked to Dr. John Seward so she could make everyone’s letters and diaries into a book about what happened. == Getting attacked by Dracula == When Count Dracula realized the Harkers knew about him, he found out that Mina was staying in Dr. Seward’s house so he told R.M. Renfield that he’d feed him mice if Renfield invited him in. Renfield invited Dracula in, so Dracula secretly bit Mina. When Mina went to speak to Renfield, he realized how pale she was so he attacked Dracula. Then Dracula attacked Mina, bit her in front of Jonathan, said this wasn’t the first time he drank her blood, cut his own chest and fed her some of his blood and told her she would become a Vampire. Then Dracula left and killed Renfield. == Helping Van Helsing hunt Dracula == Dracula could see and know everything Mina could because he bit her but then she figured out she could see and know everything Dracula did. So she helped Van Helsing chase Dracula to Transylvania but she was becoming more and more like a Vampire. Then when they made it to Dracula’s castle, three female vampires attacked but Van Helsing drew a circle around her and surrounded it with garlic and wafers so they couldn’t get in but Mina couldn’t get out either because she was becoming a vampire. When the sun rose, Van Helsing killed the three vampires. == Getting cured == Then Jonathan and Quincy Morris killed Dracula so Mina stopped being a vampire and went back to being a human. == Epilogue == Seven years later, Jonathan, Mina and their son Quincy live happy lives. Category:Characters in written fiction",
 "title": "Mina Harker"
}