{
 "id": "1136229",
 "text": "Mountain House is a planned city in San Joaquin County, California. The county government approved the plan in 1994, and the first houses sold in 2003. Mountain House legally became a city in 2024. The number of people was about 30,000 in 2023. Mountain House was built on dry farmland in the foothills. It is made of smaller \"villages\". Each village has thousands of houses, and an elementary school in the middle. The plan for the city said it would have 44,000 people and 21,000 jobs. But there were fewer than 1,500 jobs as of 2023. The city has mostly houses and not many stores, restaurants, or other businesses. Half of the people living in Mountain House are Asian-American. == History == In the 2000s, many people bought houses in Mountain House because it was much cheaper than the San Francisco Bay Area. The California government pension fund invested over $1 billion in the Mountain House development. When the Great Recession started in 2008, the houses decreased in value. Nine out of ten houses were worth less than their mortgage. When the economy got better, many more houses started selling. As of 2023, the number of people is growing quickly. In 2024, people in Mountain House voted to incorporate it as a city. == Statistics == As of 2022, about 27,923 people lived in Mountain House. The breakdown by race or ethnicity was 50.1% Asian, 25.7% White, 6.3% Hispanic, 6.2% Black, and 5.5% two or more races. The median age was 34.3 years. About 48.3% of people there had a bachelor's degree. The median household income was $166,821. Of these households, 69.8% were owner-occupied, and 30.2% were renters. The median property value was $737,200. == Education == The public schools are run by Lammersville Unified School District. They include Mountain House High School. San Joaquin Delta College, a community college, opened a Mountain View branch in 2009. == References == == Other websites == * Lammersville Unified School District serves Mountain House * Mountain House Master Plan (First version: 1994) Category:Cities in California Category:Settlements in San Joaquin County, California",
 "title": "Mountain House, California"
}