{
 "id": "1136668",
 "text": "Andesite (/ˈændəzaɪt/) is a volcanic igneous rock with an intermediate composition. It is fine-grained (aphanitic) to porphyritic in texture, primarily composed of plagioclase feldspar (often andesine), along with pyroxene or hornblende. It is considered to be the extrusive counterpart of diorite, the plutonic equivalent. Andesite is common in island arcs and subduction zones, making it one of the dominant rock types in such environments. == Tectonic environment == Andesite is typically associated with subduction zones, where oceanic plates subduct beneath continental plates, leading to the formation of island arcs and volcanic arcs. The magma originates from the interaction between the subducting slab, which partially melts, and the overlying mantle wedge. The resulting volcanic eruptions tend to be explosive due to the viscous nature of andesitic magma, which has a high silica content and lower temperatures compared to basaltic magma.https://research-repository.st- andrews.ac.uk/bitstream/10023/8744/1/AST_2010_0550R2Cousins_forCE.pdf == Andesitic volcanism == Andesite lava is typically viscous, with a viscosity comparable to that of peanut butter, making andesitic eruptions more explosive than basaltic eruptions. This characteristic results in the formation of composite volcanoes (also called stratovolcanoes) rather than shield volcanoes, which are more common with basaltic lava. Blocky lava flows and pyroclastic materials like tuff and agglomerates are typical products of andesitic volcanism. == Formation == Andesite is mainly formed in convergent plate margins, particularly in island arc systems. Here, water-rich oceanic crust melts as it subducts beneath continental crust, generating intermediate magmas that eventually solidify to form andesite. The \"andesite line\" in the western Pacific marks the boundary between andesitic and basaltic volcanic rocks, corresponding to the subduction zone of the Pacific Plate. == Occurrence == Andesite is common in the Earth's crust, especially in subduction-related environments. It is the dominant volcanic rock in island arcs and is also found in other tectonic settings like continental volcanic arcs. Besides Earth, andesite is also believed to be a component of the crust on Mars. == Etymology == The name \"andesite\" is derived from the Andes mountains, where the rock type is abundant. The term was first applied by Christian Leopold von Buch in 1826. == Related pages == * Igneous rock * Basalt * Rhyolite * Diorite == References == Category:Igneous rocks",
 "title": "Andesite"
}