{
 "id": "1136134",
 "text": "Jonathan Harker is a character in the book Dracula by Bram Stoker. Harker is a real estate lawyer from England. == Role at the beginning of the book == He goes to Transylvania to meet a man named Count Dracula who is moving to London. While Harker is staying at Dracula’s castle, Harker notices that Dracula secretly locked all the doors from inside and kidnapped Harker. Harker tries to get out but then meets three women with sharp teeth called the Weird Sisters who want to kiss and then kill him. Then Dracula moves faster than a human can and stops them because he’s not done with Harker yet. Dracula then gives them a child he kidnapped and they eat the child. When the child’s mother comes to the castle, Dracula feeds her to wolves and Harker sees it. Harker writes a letter to his fiancée Miss Mina Murray telling her what’s happened and he gives it to Gypsies outside the window to give to her but Dracula steals the letter and burns it in front of Harker. Dracula also steals Harker’s clothes and pretends to be him. Harker sees Dracula climb walls like a lizard and thinks Dracula isn’t human. Harker notices that Dracula sleeps all day but never at night so Harker sneaks into Dracula’s room during the day. Harker hits Dracula in the head with a shovel but Dracula is so strong that it does nothing. Harker climbs out of Dracula’s window and runs away to a Romanian hospital. Harker wonders if he were hallucinating. == Return to England == Mina Murray visits Jonathan Harker in the hospital and Jonathan gives her his diary. Jonathan goes back to England with Mina and they get married. Jonathan’s boss Mr. Hawkins makes him a partner in his Law firm. Then Hawkins dies and Jonathan takes over. Later on Jonathan sees Count Dracula and is scared of him so Mina reads Jonathan’s diary and wonders if it really happened. == Joining Van Helsing == When Dr. Abraham Van Helsing asks Mrs. Harker for Jonathan’s diary she gives it to him. Dr. Van Helsing tells her that everything Jonathan said happened actually happened. So Jonathan decides to help Van Helsing find Count Dracula and kill him. == Dracula attacking Mina == Jonathan finds out which houses Dracula owns and that he’s using the name Count de Ville. Dracula attacks Mina and bites her in front of Jonathan so she can become another Vampire. Dracula also kills R.M. Renfield. Dracula starts knowing everything Mina knows and seeing everything Mina sees. Mina figures out she can make herself see everything Dracula sees and use that to find him. == Killing Dracula == When the Harkers and their friends chase Count Dracula to Transylvania, Jonathan cuts off Dracula’s head and his American friend Quincy Morris stabs Dracula through the heart. Dracula dies but he kills Quincy. == Epilogue == One year later, Jonathan and Mina have a son and name him Quincy. Six years after that, the Harkers and their friends finish making their diaries and letters into a book about what happened. Category:Characters in written fiction",
 "title": "Jonathan Harker"
}