{
 "id": "1136675",
 "text": "The beluga sturgeon (Huso huso), or great sturgeon, is a large species of sturgeon in the genus Huso. It is the biggest freshwater fish ever discovered. This giant lives in the Caspian and Black Seas. == Description == The beluga sturgeon's body is covered in lots of scutes and has a big tail. There are two pairs of barbels. This sturgeon has a long, pointy snout. The largest beluga sturgeon weighed 1,571 kg and was 7.2 m long. == Behavior == === Spawning === The beluga is anadromous and they spawn on a substrate that protects their gloopy eggs. When males are 12-16 years old, they start to get sexual maturity, and babies are 11-14 mm long. === What they eat === Great sturgeons eat other species of freshwater fish, like the common carp, sterlets, and others. In the Adriatic Sea, they ate mollusks and some cyprinids. == Its status == This sturgeon is critically endangered because it is coveted for its precious caviar. It's also been affected by overfishing, and scientists are afraid that it could be extinct any time soon. == Uses for humans == === The caviar === Beluga caviar is the caviar of the beluga sturgeon. It is banned from the United States because it is currently critically endangered. === Its meat === The sturgeon's meat is very rare across the world. == Related pages == * Kaluga – another species of Huso * Lake sturgeon == References == # Gessner, J.; Chebanov, M.; Freyhof, J. (2022). \"Huso huso\". IUCN Red List of Threatened Species. # \"Huso huso\". caspianenvironment.org. # Onara, Suciu, Paraschiv, Iani, Holostenco, Tafla (2011). \"Contributions to Understanding the Spawning Ecology of Sturgeons in the Lower Danube River, Romania\" (PDF). Danube Parks. == Other websites == * http://www.ittiofauna.org/webmuseum/pesciossei/acipenseriformes/acipenseridae/huso/husohuso/h_huso.htm Category:IUCN Red List critically endangered species Category:Acipenseriformes Category:Freshwater fish Category:Ray-finned fish",
 "title": "Beluga (sturgeon)"
}