{
 "id": "1136586",
 "text": "::::* ::::*Maryland ::::*Civil Actions - Child Sexual Abuse - Definition, Damages, and Statute of Limitations ::::*Introduced: November 16, 2022 ::::*House vote: March 20, 2023 (132–2) ::::*Senate vote: March 23, 2023 (42–4) ::::*Sponsors: ::::*Signing governor: Wes Moore ::::*Bill: HB 1 ::::*Senate version: SB 686 ::::*Text: https://mgaleg.maryland.gov/2023RS/Chapters_noln/CH_6_hb0001t.pdf The Maryland Child Victims Act is a law. The Maryland Child Victims Act is a law in 1 of the states of the United States of America, the state of Maryland. The Maryland Child Victims Act was made by the Maryland General Assembly. The MGA made the MCVA during the 445th time they met, which was in 2023. Then the Maryland Child Victims Act became a law because Governor Wes Moore signed it. The Maryland Child Victims Act does away with the law that says you can't do some things in court after some time. Those some things are saying that bad sex things were done to a child and asking for money because of it. The Maryland Child Victims Act also raises the highest money each person can ask for in some of these cases. Some of these cases means only those in which one person does this against a group which is not the government. For those cases the highest money is now $1.5 million because of the Maryland Child Victims Act. The first time someone tried to make the Maryland Child Victims Act was when James Brochin tried in 2007. Then almost the same thing was tried in the 425th, 435th, 436th, 437th, 439th, 441st, 442nd, and 445th times the MGA met. ==Before== Trying to raise the time limit for a thing began in 2015. That thing is saying someone did bad sex things and asking a court to make them give you money for it. Some of that trying worked in 2017. That means a law was made in 2017 which raised that time limit. That new time limit is the time that the person who is said to be harmed is 38. Most of that trying in 2017 did not work because other people said things against it. Those other people were the Maryland Catholic Conference. Someone looked at papers about people who talk to the MGA. They found the MCC has spent more than $1 million stop this kind of law since 2017. That $1 million includes $200,000 to hire important people. Those important people include people who used to be in the MGA and people who used to work for the government. Those important people most importantly include Robert Zirkin and Rick Abbruzzese. Rick Abbruzzese was the person who talked to the press for Martin O'Malley. The MCC hired them to talk to the MGA for them. The biggest lawyer for Pennsylvania said things to the world about the grand jury investigation of Catholic Church sexual abuse in Pennsylvania. Then in February 2019 the biggest lawyer for Maryland (Brian Frosh) was said to have done something. That thing is hiring Elizabeth Embry. She was the head of an office working for the biggest lawyer for Maryland. That office is the office that deals with crimes. She was said to have been hired to lead looking into bad sex things in the Archdiocese of Baltimore. Archbishop William E. Lori said to the world in September 2018 that the archdiocese was being looked at by the state. He also said that it had given the biggest lawyer for Maryland more than 50,000 pages of their own things dating back to 1965. The biggest lawyer for Maryland's office stopped looking into this on November 17, 2022. The office later said things in 456 pages. Those things are: naming 600 people who had bad sex things done to them; and saying that bad sex things were done by 158 Catholic priests. Those 158 include 43 who the Archdiocese had never told the world had done bad sex things. ==What this law has done== Law firms and lawyers began telling people who had bad sex things done to them that they would like to work for them. Law firms and lawyers began telling people this shortly after Moore signed the Maryland Child Victims Act. Many people have used the Maryland Child Victims Act. The MCVA began working on October 1, 2023. A few days later things were started in court against a few groups. Those groups were: the archdiocese; Maryland's juvenile justice system; and Maryland's school system. The Maryland Child Victims Act says that $890,000 is the most that a person can get from a government body for each bad sex thing.http://msmagazine.com/2023/10/11/archdiocese-catholic-baltimore- bankruptcy-child-sexual-abuse/ The Maryland Child Victims Act is being used to take the McDonogh School to court.http://www.capitalgazette.com/2024/10/18/mcdonogh-school-owings-mills- sued-child-victims-act/ The McDonogh School faces 3 problems in court about bad sex things. 3 people have used the Maryland Child Victims Act to say bad things about McDonogh School in court.http://www.baltimoresun.com/2024/10/18/mcdonogh-school-owings-mills- sued-child-victims-act/ ===BCA not paying some money=== The Maryland Child Victims Act was the biggest reason for the Baltimore Catholic Archdiocese asking a court to let it not pay some money to some people. ===Trying to stop it in court=== In November 2023, the Archdiocese of Washington asked a court to stop the MCVA.http://www.washingtonpost.com/dc-md-va/2023/11/15/maryland- child-victims-act-lawsuit/ They said it should be stopped because it is against a different law. That different law is the a part of the 2017 law that says the state may not raise the time limit above some age. Lawyers for a few people who had bad sex things done to them by Catholic clergy from the Washington archdiocese spoke against stopping it. They said that because the archdiocese's lawyers were wrong about earlier things said by a court. Those earlier things are things said by the Maryland Supreme Court. Those earlier things are about whether the MGA can change the time limit for doing thigns in court. The new biggest lawyer for Maryland was Anthony Brown. The new biggest lawyer for Maryland also spoke in court against stopping this law. The new biggest lawyer for Maryland said that if the court sided with the archdiocese that \"would be unprecedented and would go against the consensus of federal law and the reasoned opinions of many other states.\" That means stopping a law like this has never happened before and would go against the way federal and other state laws work. Prince George's County Circuit Court Judge Robin D. Gill said that the Maryland Child Victims Act was not against the constitution on March 6, 2024. That means that on March 6, 2024, Prince George's County Circuit Court Judge Robin D. Gill said that the people using the Maryland Child Victims Act could keep going in court against the Archdiocese.http://www.nbcwashington.com/investigations/judge-rejects- challenge-to-maryland-child-victims-act-in-class-action-lawsuit-against- church/3560962/ On April 1, Montgomery County Circuit Court Judge Jeannie E. Cho said that the law was against the constitution. She said that because it is against the Maryland Declaration of Rights. Someone asked the Maryland Supreme Court to disagree. On May 7, 2024 that court said yes.http://www.mdcourts.gov/sites/default/files/import/coappeals/highlightedcases/latterdaysaints/20240507sessionbriefingnotice.pdf That court later said they would talk about it on September 10. ==Making the law== ===423rd session (2007)=== The 2007 bill was brought to the MGA by state senator James Brochin of Baltimore County on February 2, 2008. The group that talks about laws about how judges do things said no to this bill. The MCC said things to them against the bill during this time. ===425th session (2008)=== The 2008 bill was brought to the MGA by state delegate Eric M. Bromwell of Baltimore County on February 6, 2008. The school that he had gone to said bad things about this bill. The school said bad things to people who give money to the school because the bill could cause much lower students to come to their school. They said much lower could mean 0. They said that that could happen because it would let some people do things to the school in court. Those some people say that two former priests who had taught at the school did bad sex things to them. They also say they had done bad sex things to at least 14 people. The school saying that caused some other people to make a lot of telephone calls to the senator's office. Some other people included Bromwell's grandmother. Those telephone calls caused Bromwell to withdraw the bill. ===435th session (2015)=== The 2015 bill was brought to the MGA by state delegate C. T. Wilson of Charles County on February 26, 2015. It was given to the group that talks about how things should work and who the Governor should hire for some jobs. There was no hearing for this bill. State delegate Aruna Miller brought a bill to the MGA that is almost the same. Miller's bill would raise the time to do things in court for bad sex thigns done to children. During hearings on Miller's bill, Wilson told some things to other people who help make the laws. Those some things were about how he had many times had bad sex things done to him and beaten by his adoptive father. Those happened between ages 9 and 15. He never did things in court against him. He said that he had not understood that what was done to him was a crime until he was 40 years old. ===436th session (2016)=== The 2016 bill was brought to the MGA by state senator Ronald N. Young of Frederick County on December 16, 2015. The same bill was brought to the MGA by delegate Wilson on February 11, 2016. The bill did not make it out of the groups that talk about how judges should do things. The MCC said things against this bill. ===437th session (2017)=== The 2017 bill was introduced by Wilson on February 1, 2017. The MCC and the head of the MGA group that talks about how judges should do things talked to each other. After that the bill was changed to raise the time to do things in court about bad sex things done to children. The time was raised until the person who says bad sex things were done to them as a child is 38 years old. However the bill was also changed to make it more hard for those over 25 years old to win money in these cases. It makes it harder by only giving them money if they can prove someone did not do all the law says they have to. This changed bill got the votes of everyone in the MGA and was signed into law by Governor Larry Hogan on April 4, 2017. The changed bill has a part that says the state may not raise the time limit above the age of 38. That part was not meant to be a part of the bill. That part was not noticed until 2019. In 2019 someone else in the MGA talked about it. She talked about it while bringing a change to a different law. That change would get rid of the look back window part of a different law. It is not known who added the part that says the state may not raise the time limit to the bill. It may have been John Stierhoff. Stierhoff is a Venable LLP lawyer. Stierhoff worked for the MCC. Stierhoff's work for the MCC included talking to the MGA. Stierhoff was one of the people talking about the changed bill.. Dumais' amendment would spark a debate among legislators on whether it would be constitutional to repeal the statute of repose. The person who brought the bill tot he MGA later said talking about the bill with the Catholic Church had been a mistake. That person said that he had \"made a deal with the devil.\" ===439th session (2019)=== The 2019 bill was brought to the MGA by Wilson on February 7, 2019. It is named the \"Hidden Predator Act\". The bill would have done away with the time limit to do things in court. It would also have made a two-year look-back window for people who say bad sex things were done to children who were unable to do things in court because of the time limit. 135 delegates voted for the bill. 3 voted against. The vote took place on March 18, 2019. The bill then moved to the Senate group which talks about courts. Both parties in that group did not like the bill. Those who said bad things about the bill included Michael Hough and Jill P. Carter. The group had a vote about whether to go ahead with this bill. The group voted 5–5. The bill did not make it out of that group. Shortly after this, the House's group that talks about courts changed a different law. That different law was Laura and Reid's Law\". That change was to rasie the age limit until the person who bad sex things were done to turns 58 years old. However, this change was taken out by the group that made the House and Senate bills the same before the bill was signed into law by Governor Larry Hogan. In February 2023, the biggest lawyer for Maryland Anthony Brown wrote something. That thing was advice. That advice was written to the MGA. That advice said that the MGA could change the state's age limit for cases about bad sex things done to children. That advice said that this would be like the MGA had done before for asbestos cases. ===441st session (2020)=== The 2020 bill was again named the \"Hidden Predator Act\". It was introduced by Wilson on February 5, 2020. The bill got every vote in the House of Delegates. The bill never got a hearing in the Senate. That happened because the 2020 MGA meeting was cut short due to the COVID-19 pandemic. ===442nd session (2021)=== Senate Judicial Proceedings chair Robert Zirkin resigned before the start of the 2021 MGA meeting. Soon after that the MCC hired him to talk to the MG. The 2021 bill was brought to the MGA. It was brought by delegate Wilson and state senator Shelly Hettleman of Baltimore County. They did that on September 30, 2020. The hearing on the bill was in February 2021. During that, Zirkin said things against the bill. He said that Wilson and other people talking about the bill made a deal with the Catholic Church. He said that that deal was that the MGA would not do anything more to change the time limit on court cases on bad sex things done to chidlren in Maryland. That made people in the MGA who didn't like say bad things about Wilson. It also made them ask if he is dishonest. Wilson withdrew the bill on March 16, 2021. He said that he believed taking his name off from the bill would give it a better chance of passing that year. ===445th session (2023)=== The 2023 bill was brought to the MGA by Wilson. He did that on November 16, 2022. It was also brought by state senator William C. Smith Jr. of Montgomery County. He did that on February 6, 2023. The MCC told the world that they want the law to be changed to do away with the time limit for cases on bad sex things done to chidlren. The MCC also told the world they will keep saying things against bills making a two-year \"look back window\" for people to start things in court saying that bad sex things have been done in the past to children. The MCVA did have such a part in it. The MCC tried to stop the bill. The history of people who talk to the MGA shows how much money the MCC spent against the bill. The MCC spent $209,939 from November 2022 to early May 2023. The people who wanted the MCVA to pass were more hopeful this time around. They thought the MCVA would pass because two of the people who are against it the most were no longer in the MGA. Those two were Robert Cassilly and Michael Hough. The bill became more likely to pass due to some things: *A thing someone told to the world. It was about bad sex things done to children in the archdiocese. It came from the biggest lawyer for the state government. *The office of the biggest lawyer for the state government changing what it said about whther the bill is against the constitution. *The 2021 appointment of Will Smith as the chair of the Senate group that talks about courts. The person in charge of the government of Maryland Wes Moore said good things about the Child Victims Act on March 3, 2023. ====Winning in the House==== The MCVA was heard in the House group that talks about courts on March 2, 2023. Everyone in that group voted for the bill on March 29. That sent the MCVA to the House floor. It was heard on the House floor the following day, during which no one tried to change the bill. Republican delegates saying things about the bill being against the constitution. The delegates voted 132–2 to pass the MCVA on March 31, 2023. ====Senate passage==== On January 20, 2023, William C. Smith Jr. told the world that the Senate group that talks about courts would talk about the MCVA. The group voted 10–1 to send the bill to the Senate floor on March 10. There was a chance that the MCVA was unconstitutional and would be overturned by the Maryland Supreme Court. The bill was heard on the Senate floor on May 14. During this time state senator Justin Ready tried to change the MCVA. He tried to do that due to the chance that state courts would say that companies do not have to pay, but would not say the same about the state government. All changes to the MCVA were voted against in near party-line votes. On March 17, 2023, the Senate voted 42–5 to pass the MCVA. The Senate then voted 42–4 to instead use the House's MCVA on April 7, 2023. ===Signing into law=== On April 11, 2023, Governor Wes Moore signed the MCVA into law. It was his first bill signing as governor in front of the world. Wilson spoke then. Wilson thanked House Speaker Adrienne A. Jones and the person heading the House group that talks about courts Luke Clippinger for helping get the bill passed. Wilson said that he \"never thought God would let me see this moment.\" ==Trying to keep the MCVA== Some people are trying to keep the MCVA.https://www.wbaltv.com/article/sex-abuse-survivors-defend-child-victims- act-maryland-supreme-court/62068875 In March 2024 Prince George’s County Circuit Judge Robert Gill Bright ruled that the MCVA is constitutional.https://www.wypr.org/wypr-news/2024-03-07/maryland-judge- upholds-law-allowing-childhood-abuse-victims-to-sue- abusershttp://www.wypr.org/wypr-news/2024-09-05/survivors-want-maryland-child- victims-act-upheld-as-it-faces-supreme-court-challenge The biggest lawyer for Maryland, Maryland Attorney General Anthony Brown is defending the constitutionality of the Maryland Child Victims Act. That means: Maryland Attorney General Anthony Brown is working to keep the Maryland Child Victims Act from being thrown away by courts.http://www.baltimoresun.com/2024/01/10/maryland-ag-defends-child- victims-act-in-constitutional-challenge-by-catholic-archdiocese-of-washington/ Some lawyers say that the Maryland Child Victims Act is lawful because it only changes the time limit, and that the MGA is allowed to change the time limit.http://wtop.com/maryland/2024/09/did-maryland-lawmakers-overstep-their- bounds-with-a-law-to-protect-abused-children/ ==Legislative history== General Assembly Short title Bill number(s) Date introduced Sponsor(s) # of cosponsors Latest status 423rd session SB 575 February 2, 2007 Sen. James Brochin (D-Baltimore County) 0 Rejected by Judicial Proceedings Committee 425th session HB 858 February 6, 2008 Del. Eric Bromwell (D-Baltimore County) 5 Referred to Judiciary Committee; withdrawn by sponsor 435th session HB 1214 February 26, 2015 Del. C. T. Wilson (D-Charles) 0 Referred to Rules and Executive Nominations Committee 435th session HB 725 February 13, 2015 Del. Aruna Miller (D-Montgomery) 1 Referred to the Judiciary Committee 436th session HB 1215 February 12, 2016 Del. C. T. Wilson (D-Charles) 0 Referred to the Judiciary Committee 436th session SB 69 July 6, 2015 Sen. Ronald N. Young (D-Frederick) 0 Referred to the Judicial Proceedings Committee 437th session HB 641 February 1, 2017 Del. C. T. Wilson (D-Charles) 17 Rejected by Judicial Proceedings Committee 437th session HB 642 February 1, 2017 Del. C. T. Wilson (D-Charles) 6 Passed the House of Delegates (140–0) Passed the Senate (47–0) Signed into law by Governor Larry Hogan 437th session SB 505 February 1, 2017 Sen. Delores G. Kelley (D-Baltimore County) 27 Passed the Senate (47–0) Passed the House of Delegates (139–0) Signed into law by Governor Larry Hogan 439th session Hidden Predator Act of 2019 HB 687 February 7, 2019 Del. C. T. Wilson (D-Charles) 13 Passed the House of Delegates (135–3) Rejected by Senate Judicial Proceedings Committee 441st session Hidden Predator Act of 2020 HB 974 February 5, 2020 Del. C. T. Wilson (D-Charles) 11 Passed the House of Delegates (127–0) 442nd session HB 263 September 30, 2020 Del. C. T. Wilson (D-Charles) 0 Referred to the Judicial Proceedings Committee; withdrawn by sponsor 442nd session SB 134 September 30, 2020 Sen. Shelly Hettleman (D-Baltimore County) 4 Referred to the Judicial Proceedings Committee 445th session The Child Victims Act of 2023 HB 1 November 16, 2022 Del. C. T. Wilson (D-Charles) 16 Passed the House of Delegates (132–2) Passed the Senate (42–4) Signed into law by Governor Wes Moore 445th session The Child Victims Act of 2023 SB 686 February 6, 2023 Sen. Will Smith (D-Montgomery) 0 Passed the Senate (42–5) Passed the House of Delegates (133–0) Signed into law by Governor Wes Moore ==References== Category:Maryland",
 "title": "Maryland Child Victims Act"
}