{
 "id": "1136933",
 "text": "Naruto Shippuden the Movie is a Japanese animated martial arts fantasy movie. It was released on August 4, 2007 in Japan. It is based on the Naruto: Shippuden manga and anime by Masashi Kishimoto. It is the first movie for Shippuden and is the fourth Naruto movie. It was written by Junki Takegami and directed by Hajime Kamegaki. It starred Junko Takeuchi, Chie Nakamura, Yōichi Masukawa, and Kōichi Tōchika. Maile Flanagan, Kate Higgins, Brian Donovan, and Steve Staley provided the English dubbed voices. The movie takes place after the events of episode 32 of Naruto: Shippuden. It is about Shion, a priestess. Naruto and Sakura of Team 7 along with Rock Lee and Neji Hyuga of Team Guy are tasked to escort her safely as she goes on a mission to defeat a man named Yoma who is trying to release the spirit of an evil demon named Mōryō so he can destroy the world. Naruto is also trying to change his future after he has a prediction about his own death from the hands of an enemy monster. == Cast == Character Japanese voice English voice Naruto Uzumaki Junko Takeuchi Maile Flanagan Sakura Haruno Chie Nakamura Kate Higgins Rock Lee Yōichi Masukawa Brian Donovan Neji Hyuga Kōichi Tōchika Steve Staley Tsunade Masako Katsuki Debi Mae West Shizune Keiko Nemoto Megan Hollingshead Kakashi Hatake Kazuhiko Inoue Dave Wittenberg Might Guy Masashi Ebara Skip Stellrecht Shikamaru Nara Showtaro Morikubo Tom Gibis Temari Romi Park Tara Platt Shion Ayumi Fujimura Laura Bailey Miroku Fumiko Orikasa Laura Bailey Taruho Yoshinori Fujita Wil Wheaton Moryo Seizō Katō Daran Norris Yomi Hidetoshi Nakamura Vic Mignogna Gitai Kishō Taniyama Dave Wittenberg Setsuna Katsuyuki Konishi Keith Silverstein Susuki Daisuke Kishio Sam Riegel Kusuna Tetsuya Kakihara Crispin Freeman Shizuku Miyuki Sawashiro Wil Wheaton ==Reception== The movie received positive reviews from critics. Critics said that they liked the animation, darker themes, soundtrack, and that the fight sequences were well animated. However, some critics also said that the darker theme like massive blood loss and characters being stabbed might scare some children who watch it. They also felt that movie felt too much like filler. The DVD was released on April 23, 2008 in Japan and did very well, ranking #5 in sales between April 30 and May 6. ==References== ==Other websites== * Category:2007 movies Category:2007 animated movies Category:2007 action movies Category:2007 adventure movies Category:2000s sequel movies Category:Japanese action movies Category:Japanese adventure movies Category:Martial arts movies Category:Naruto movies Category:Viz Media anime",
 "title": "Naruto Shippuden the Movie"
}