{
 "id": "1136919",
 "text": "Abu Sulayman Banakati (; died 1330), was a historian and poet, who lived during the late Ilkhanate era (time period). He is mainly known for his Persian world history book, the Rawdat uli al-albab fi maʿrifat al-tawarikh wa al-ansab, better known as Tarikh-i Banakati. Banakati was also associated with the court of the Ilkhanate. He himself reported that he served as the chief poet at the court of the Ilkhanid ruler Ghazan () in 1302. == Biography == Of Persian ancestry, Banakati was born in Banakat (later known as Shahrukhiya), a town in Transoxiana. His laqab (honorific name) was Fakhr al-Din Banakati. Belonging to a family of scholars, he was the son of the religious scholar Taj al-Din Abu al-Fadl Banakati, who is notable for writing a commentary on the masabih al-Sunnah by al-Baghawi (died 1122), known as the Kitab al-maysur. Banakati had a brother named Nizam al-Din Ali Banakati, who was a well known Sufi. Banakati was an educated scholar and skilled poet; according to his own reports, he served as the chief poet at the court of the Ilkhanid ruler Ghazan () in 1302. During the summer of that year, Banakati was given the title of malik al-shuʿara (King of Poets) by Ghazan. Banakati reported that he became chief poet due to his brother being the previous holder of the office. Al- Baghdadi credited Banakati with the writing of a diwan (collection of poems). A sample of Banakati's poetry is mentioned in the Tadhkirat al-shu'ara (\"Memorial of poets\"), a biographical dictionary written by Dawlatshah Samarqandi (died 1495/1507). Banakati died in 1330. == Works == Banakati is mainly known for his world history book, the Rawdat uli al-albab fi maʿrifat al-tawarikh wa al-ansab, better known as Tarikh-i Banakati. The work was completed on 31 December 1317, and is divided into nine parts: (1) the prophets and patriarchs; (2) the monarchs of ancient Iran; (3) the prophet Muhammad and the caliphate; (4) Iranian dynasties that existed in the same period as the Abbasid Caliphate; (5) the Jews; (6) the Christians and the Franks; (7) the Indians; (8) the Chinese; and (9) the Mongols. The book ends with the start of the reign of the last Ilkhanid ruler, Abu Sa'id Bahadur Khan (). The last portion of part nine, which covers information from 1304 to 1317, is thought to be the first source on the reign of Öljaitü (). Banakati stated that most of the work is a shortened version of the world history book Jami' al-tawarikh by Rashid al-Din Hamadani (died 1318). As reported by some scholars, Banakati was able to add important information to his work due to his well known position at the Mongol court. Regardless of the shortness of the book, it is considered both unbiased and valuable, as well as one of the most reliable sources of its time. The Tarikh-i Banakati was first published in 1678, when its eighth part (\"The History of the Chinese\") was translated into Latin as Abdallae Beidavaei historia Sinensis by the German sinologist , who mistook it as a work by the Persian scholar Qadi Baydawi (died 1319), probably due to a copyist including it as another work by Baydawi. The Latin translation of the book was later translated into English by Stephen Weston and released in London in 1820. The French writer Quatremère de Quincy (died 1849) included the work in his book, the Histoire des Mongols de la Perse. Dawlatshah claimed that no other historian has written as much about China, India, the Jews and the Byzantines as Banakati has. By including some of his own words, Banakati noticeably portrayed Ghazan as a more pious figure, which testifies to the amalgamation of Mongol and Islamic ideas that was taking place at the time. Similar to other poets, Banakati utilized both Iranian and Central Asian notions and titles of kingship. He referred to the Mongol ruler as Pādshāh, the Khusrav, and the Ṣāḥib-Qirān, but also as Khaqan (Qa’an) and Khan of Khans. == References == == Sources == * * Category:13th-century births Category:1330 deaths Category:14th-century Iranian people",
 "title": "Abu Sulayman Banakati"
}