{
 "id": "1136112",
 "text": "Jackie Appiah was born on December 5, 1983, in Canada and is from Ghana. She is an actress who has won several awards. She got the Best Actress in a Leading Role award at the 2010 Africa Movie Academy Awards and the Africa Movie Academy Awards for Best Actress in a Supporting Role in 2007. She was also nominated for Best Actress in a Leading Role and Best Upcoming Actress in the 2008 Africa Movie Academy Awards. In 2023, she won the Excellence in Creative Art Award at the Ghana Women of the Year Honors. Jackie is also a movie producer, fashion model, and helps with charity work. == Early life == Jackie Appiah was born on December 5, 1983, in Toronto, Canada. She is the youngest of five children. She lived in Canada as a child and moved to Ghana with her mother when she was 10 years old. She is well-known by her last name, Appiah. Jackie married Peter Agyemang in 2005 and has one son. Her father is Kwabena Appiah, who is the younger brother of the late Joe Appiah, a well- known lawyer in Kumasi. He now lives in Toronto, Ontario, Canada. == Career == Jackie Appiah is a well-known actress from Ghana who has had a successful career in Ghanaian and Nigerian films for over twenty years. She started acting in the late 1990s, appearing in various TV shows and movies. Her big break came in 2003 with the Ghanaian film \"Princess Tyra.\" This role made her famous and established her as a leading actress in West Africa. After \"Princess Tyra,\" she appeared in many other films from Ghana and Nigeria, becoming one of the top actresses in the region. Besides acting, Jackie is involved in charity work, supporting causes like education and healthcare in Ghana. She has received many awards for her work in film and her humanitarian efforts. Jackie's screen career became more regular when she was cast by Edward Seddoh Junior in Things We Do For Love, playing Enyonam Blagogee. She also acted in other TV series like Tentacles, Games People Play, Sun-city and other TV series She remembers being very shy on her first film set for Divine Love, where she played Kate, the protagonist. She felt nervous and thought she did not do well, but others didn’t notice. Despite this, she managed to impress everyone. Jackie’s favorite role was in Mummy’s Daughter, where she played Princess. She was very happy with her performance in that film. She believes that the local film industry has improved over time and is confident about its future success. Jackie Appiah is seen as one of the most successful and influential actresses from Ghana and Nigeria, with a career spanning over twenty years. === Nollywood breakthrough and success === Appiah was already known to Nollywood through her many successful Ghanaian films including Beyoncé - The President Daughter, Princess Tyra, Passion of the Soul, Pretty Queen, The Prince's Bride, The King is Mine and The Perfect Picture. Her notable Nollywood films include Black Soul and Bitter Blessing, alongside Nollywood actor Ramsey Nouah and My Last Wedding, alongside Nollywood actor Emeka Ike. In 2013, she won the Best International Actress award at the Papyrus Magazine Screen Actors Awards (PAMSAA) 2013. which was held in Abuja, Nigeria. Jackie Appiah was already famous in Nollywood because of her many successful Ghanaian films, such as Beyoncé - The President Daughter, Princess Tyra, Passion of the Soul, Pretty Queen, The Prince's Bride, The King is Mine and The Perfect Picture. She also starred in Nollywood films like Black Soul and Bitter Blessing with actor Ramsey Nouah, and \"My Last Wedding\" with actor Emeka Ike. In 2013, she won the Best International Actress award at the Papyrus Magazine Screen Actors Awards (PAMSAA) in Abuja, Nigeria. === Promotional work === Jackie’s face appears on many billboards and TV commercials in Ghana. She has been featured in a GSMF ad about protection against HIV AIDS. She also became the face of U.B in a promotion and is currently the face of IPMC for commercials and billboards. Her first TV commercial was for GSMF. == Personal life == Jackie Appiah married Peter Agyemang in 2005, and they had one son named Damien Agyemang. They divorced after three years. In 2020, there were rumors that Jackie was pregnant by the Liberian president, George Weah. Jackie denied the rumors on her Instagram, saying that laughter can put an end to lies and false stories. == Filmography == == Awards and nominations == Year Event Prize Recipient Result 2007 3rd Africa Movie Academy Awards Best Supporting Actress Beyonce:The President's Daughter 2010 6th Africa Movie Academy Awards Best Actress Leading Role The Perfect Picture 2010 Ghana Movie Awards Best Actress 4 plays City People Entertainment Awards Best Ghanaian Actress 2011 2011 Ghana Movie Awards Best Actress Leading Role (English) Reason To Kill 2011 Nigeria Entertainment Awards Pan African Actress Of The Year 2012 2012 Ghana Movie Awards Best Actress Leading Role Grooms Bride Ghana National Youth Achievers Awards Performing Arts African Women Of Worth Awards Best Actress 2013 2013 Africa Magic Viewers Choice Awards Best Actress In Drama The Perfect Picture 2013 Ghana Movie Awards Best Actress Leading role Cheaters Glits Magazine favorite actress Nafca Best Actress Diaspora Turning Point Pyprus Magazine Screen Actors Awards Best International Actress The F.A.C.E List Awards (USA) Achievement In Africa Entertainment 2014 2014 Africa Magic Viewers Choice Awards Best Actress Comedy Role Cheaters 2014 Ghana Movie Awards Best Actress Leading Role Sisters At War Favorite Actress 2015 2015 Africa Magic Viewers Choice Awards Best Actress In Comedy A Letter From Adam 2015 Ghana Movie Awards Favorite Actress == References == == Other websites == * * Category:1983 births Category:Living people Category:Ghanaian actors",
 "title": "Jackie Appiah"
}