{
 "id": "1136303",
 "text": "Charlie Wall-Andrews is an Assistant Professor in Creative Industries at Toronto Metropolitan University and the Executive Director of the SOCAN Foundation. She is known for her work in advocating for diversity, equity, and inclusion in the arts. == Early life and education == Wall-Andrews holds a PhD from Toronto Metropolitan University, a Master of Arts in Ethnomusicology from York University, and an MBA from the Ivey Business School. She received the prestigious Pierre Elliott Trudeau Foundation Scholarship to conduct research on equity creation in highly inequitable settings. == Career == Wall-Andrews began her career as a music creator and has become a leader in Canada's cultural and creative industries. She has been the Executive Director of the SOCAN Foundation, where she has led various programs aimed at supporting diversity and inclusion in the arts. These include the Her Music Awards, the Equity X Production Program, the Creative Entrepreneur Incubator, and the Indigenous Music Residency Program. == Research and advocacy == Wall-Andrews is a strong advocate for diversity, equity, and inclusion within the arts. She has written numerous papers and articles on the topic and has been involved in various initiatives aimed at promoting equity in creative industries. In her role at SOCAN, she has overseen several programs that support underrepresented groups in the music industry. == Awards and recognition == Wall-Andrews has been recognized for her work in nonprofit management, education, and advocacy. She has been named one of Canada's Top 100 Most Powerful Women and was included in Corporate Knights' Top 30 Under 30. In 2024, she was honored as one of Billboard Canada's Women in Music Honourees and served as a judge for the 2024 CBC National Searchlight Competition. == Board memberships and leadership roles == Wall-Andrews is a Legacy Fellow of the Edmond de Rothschild Foundations and serves as Vice-Chair of Music Canada's Advisory Council. She is also a board member of the Canada Council for the Arts, where she is serving a four-year term. == References == Category:Living people Category:Academics Category:Canadian people Category:Music industry",
 "title": "Charlie Wall-Andrews"
}