{
 "id": "113607",
 "text": "Staphylococcus aureus (also S. aureus, from the Greek σταφυλόκοκκος, “grape- cluster berry”, Latin aureus, “golden”) is a gram-positive, round shaped bacterium appearing in grape-like clusters, often living on the skin or in the nose of a person, as well as in the lower reproductive tract of women. It is anaerobic, which means that it can grow without an oxygen atmosphere. Although S. aureus lives as a normal inhabitant on the human body, it can become an opportunistic pathogen. This means that if people have a weakened immune system, they can become ill from S. aureus infections. It causes a variety of illnesses, from skin and joint infections to respiratory infections. Some of the diseases caused can be life threatening, like meningitis, bacteremia and toxic shock syndrome. S. aureus is a very common cause of infection in hospitals. S. aureus infections can spread both in and out of hospital, from people through skin-to-skin contact, or contact with objects touched by an infected person, and through contact with pus from an infected wound. It can also live on surfaces or in non-sterile breathing tubes. As symptoms begins to show, the patient is contagious for 2 weeks, with the illness lasting overall a few weeks. If untreated, the infection can be deadly. To avoid S. aureus infections, hygiene measures such as daily showers or baths and frequent hand washing with soap are advised. Some strains of S. aureus have become increasingly resistant to antibiotic treatment, for example methicillin- resistant S. aureus (MRSA). No vaccine for S. aureus has been developed. S. aureus was discovered in 1880 by a Scottish surgeon, Alexander Ogston. He called it Staphylococcus because of its round, grape-like appearance under a microscope. In 1884, Friedrich Julius Rosenbach identified the Staphylococcus aureus strain from a related bacterium. Before 1940, infections with this pathogen were fatal. However, as penicillin was developed, doctors found that it could cure S. aureus infections. By the end of the decade, S. aureus became widely resistant to penicillin. The evolution of S. aureus enabled it to be carried in human hosts without causing infections, allowing it to be widespread among the population. There are many health factors that affect this, which may include age, sex, diabetes and smoking, alongside genetic variations. Therefore, whether strains of S. aureus become invasive depends on human factors. == References == Category:Gram-positive bacteria",
 "title": "Staphylococcus aureus"
}