{
 "id": "1136506",
 "text": "Azerbaijan Railway Museum () is a railway museum in Baku, Azerbaijan. The museum was opened in 2019. The museum is in the historic building of the former Sabunchu Railway Station in the city center of Baku, on Jafar Jabbarli Square and near the 28 May metro station. ==History== The Azerbaijan Railway Museum was officially opened on November 19, 2019, by President Ilham Aliyev. However, the museum was closed in February 2020 during the COVID-19 pandemic, and reconstruction works were carried out and was enriched with new exhibits, it started welcoming visitors on December 28, 2023. The historic Sabunchu Railway Station, is one of the three buildings that are part of the historical station complex of the Baku railway station. This building was opened to service on July 6, 1926, the day of the opening of the first electrified railway in Azerbaijan. Sabunchu Railway Station in Baku was the first station building to receive electric trains. The building was built based on the national architectural styles of Azerbaijan, particularly the Palace of the Shirvanshahs, due to its appearance and architectural style. The museum has two exhibition halls, a cinema hall, and halls for organizing cultural and corporate events. Events such as book signing days, reading hours, book and art exhibitions, meetings with public figures are held here. In the halls, many interesting exhibits related to the development stages of the railway sector of Azerbaijan, including photo and video materials showing the history of the creation of the railway in the 19th century, and train models are shown. Also, a photo corner was created to show the services of President Heydar Aliyev in the development of railways in Azerbaijan. == Gallery == Railway Museum in Baku - 1.jpg| Railway Museum in Baku - 2.jpg| Railway Museum in Baku - 3.jpg| Railway Museum in Baku - 4.jpg| Railway Museum in Baku - 5.jpg| Railway Museum in Baku - 6.jpg| Railway Museum in Baku - 7.jpg| Railway Museum in Baku - 8.jpg| Railway Museum in Baku - 9.jpg| == Related pages == * List of museums in Baku == References == == Other websites == * * * Category:2019 establishments in Asia Category:2019 establishments in Europe Category:21st-century establishments in Azerbaijan Category:Buildings and structures in Baku Category:Museums in Azerbaijan",
 "title": "Azerbaijan Railway Museum"
}