{
 "id": "1136679",
 "text": "The High Speed Rail Authority (HSRA) is a department of the Australian government. It is responsible for giving advice on and planning a high-speed rail line along the east coast of Australia. It is also responsible for being the manager of builders and owners of that line. It was part of a promise of the Labor political party and its party leader Anthony Albanese. The promise was to build a high-speed rail line from Sydney to Newcastle, with the possibility of extending the line to Melbourne and Brisbane. It started to operate on 13 June 2023, and its chief executive officer was named on 11 January 2024. A previous department, the National Faster Rail Agency, finished on 13 June 2023. A case for the Sydney to Newcastle section is being developed, with AU$500 million promised for the development of that case. The companies responsible for the development of the case were named in June 2024. Geotechnical investigations started and companies were advised on progress in August 2024. Development of the case is expected to finish in December 2024. == Start and previous departments == Anthony Albanese gave a speech on 2 January 2022 in Newcastle. At that speech, a promise was made to build a high- speed rail line between Sydney and Newcastle. AU$500 million was promised for purchasing land, planning and early works. Another promise was to start a department to build that line, and possibly extending the line to Melbourne and Brisbane. A similar promise was made by the Labor Party in 2019 and 2021. In September 2022, a bill to start the department was introduced to federal parliament. The bill was passed on 24 November 2022. The bill became law on 12 December 2022. The department started on 13 June 2023 and its chief executive officer (CEO) Tim Parker was named on 11 January 2024. === National Faster Rail Agency === In the 2019-20 financial year, the National Faster Rail Agency (NFRA) was started. It was a department that investigated making some rail lines faster. Five rail lines in total were investigated: * Sydney to Wollongong * Sydney to Parkes (via Bathurst and Orange) * Melbourne to Albury- Wodonga * Melbourne to Traralgon * Brisbane to the Gold Coast On 13 June 2023, the National Faster Rail Agency ended operations. Some people working for the Agency were moved to the Authority. == Board of directors == The board of directors is based on the laws governing the Authority. The board is made up of the chairperson and four directors, who are: * Jill Rossouw (chairperson) * Gillian Brown (director) * Ian Hunt (director) * Dyan Perry OBE (director) * Neil Scales OBE (director) == Planning == === Sydney to Newcastle line === ==== January to June 2024 ==== In January 2024, AU$78.8 million was set aside for developing the case for the Sydney to Newcastle line. In March 2024, a request for companies to share in eight parts of work was made. These parts of work included: * Project controls * Rail operations planning * First Nations participation and discussions * Development of commercial buildings, project methods, and industry discussions. The companies sharing in these parts of work were announced on 13 June 2023. These companies included Ernst & Young, KPMG and Arcadis among others. ==== July 2024 to present ==== Geotechnical investigations started on 26 August 2024. The adviser, David Och, said that the land along the proposed line had all sorts of rocks, including valleys, faults and dykes. Och said that they were \"the main [base]\" of the geotechnical investigations. == References == Category:Rail transport in Australia",
 "title": "High Speed Rail Authority"
}