{
 "id": "1136203",
 "text": "David Nweze Umahi (born January 1, 1964) is a Nigerian engineer, politician, and the current Minister of Works. He is well-known for his tenure as the Governor of Ebonyi State, serving from 2015 to 2023. Before his governorship, Umahi held several leadership roles in the private sector, including co- founding Norman Engineering & Construction Nigeria Ltd and leading Brass Engineering & Construction Nigeria Ltd. == Early Life and Education == Umahi was born in Uburu, Ohaozara Local Government Area of Ebonyi State. He completed his early education in Ebonyi and later attended the Enugu State University of Science and Technology (ESUT), where he earned a degree in Civil Engineering in 1987. His early career spanned various engineering roles, including stints with major firms like Saipem and SCC Nigeria Limited. == Political Career == Umahi entered politics in 2007, when he became the Acting Chairman of the People's Democratic Party (PDP) in Ebonyi State. He later served as the state's PDP Chairman and was elected Deputy Governor in 2011, under Governor Martin Elechi. In 2015, despite internal party conflicts, Umahi secured the PDP's gubernatorial ticket and was elected Governor of Ebonyi State. He was re-elected in 2019. During his tenure as governor, Umahi oversaw extensive infrastructure development, particularly road construction and the establishment of the King David University of Medical Sciences. His administration also prioritized agriculture, transforming Ebonyi into a leading rice-producing state. In 2020, Umahi defected to the All Progressives Congress (APC), citing dissatisfaction with the PDP's treatment of the Southeast geopolitical zone. He later expressed interest in running for the presidency in 2023, although his political focus shifted towards securing a senatorial seat. == Controversies == In 2021, allegations surfaced that he transferred state funds to his private company, Brass Engineering & Construction Nig. Ltd., a claim that led to legal battles. He also faced criticism for his decision to introduce a new tax regime and his expenditure on government facilities. == Personal Life == David Umahi is married to Rachel Umahi. He is known for his philanthropic work, particularly through the Engr. Dave Umahi Education Foundation, which provides scholarships to students. == Appointment == Following his governorship, Umahi was appointed Minister of Works in 2023 by President Bola Tinubu. This role continues to keep him at the forefront of national infrastructure development. ==References== Category:1963 births Category:Living people Category:Nigerian people Category:Nigerian politicians",
 "title": "David Umahi"
}