{
 "id": "1137327",
 "text": "Noor-un-Nisa Inayat Khan GC (1 January 1914 - 13 September 1944) was a British secret agent during World War II. She was the first female wireless operator to be sent into Nazi-occupied France. She was captured and executed by the Gestapo. == Early life and education == Noor-un-Nisa (Arabic: “Light of Women”) Inayat Khan was born in Moscow to an Indian father and American mother. She was the eldest of four children. Her father, Hazrat Inayat Khan, was a musician and religious teacher with noble ancestry, which made Noor Inayat Khan a princess. Her mother Ameena Begum was from New Mexico. The family lived in Moscow because of the fathers music career. When Noor Inayat Khan was four months old the family moved to London. This was right before the outbreak of the World War I. In 1920 they moved to Paris. When France was occupied by Nazi Germany in 1940, Khan fled to England. There she joined the WAAF (Women's Auxiliary Air Force). She proved herself as a skilled wireless radio operator and had the advantage of being fluent in both French and English. She was assigned to work in Operation Prosper, a network of spies working for Britain in Paris. == Espionage in France == In June 1943 she traveled to France, where she worked as a radio operator in Paris. After landing in the field, she located radio equipment after 72 hours, making it the fastest response time of any agent in the landing field. Many of the operators were arrested shortly after she arrived, but she chose to stay in Paris. Moving from place to place to send messages back to London while trying to not get captured. The average time for a radio operator to be detected was six weeks, but Khan managed to stay active for five months. == Capture and imprisonment == In October 1943 She was betrayed by a French woman and arrested by the Gestapo. She was interrogated but refused to give any information, but she had kept copies of her secret codes sent to England. So the Germans could imitate her by using her radio to trick England to send more agents straight into the Germans hands. On November 25. She escaped the SD headquarters with another SOE agent: John Renshaw Starr, but they got caught before they could get away. To avoid another attempt the Germans sent her to Pforzheim in Germany, where she was shackled at her hands and feet and tortured. She stayed there for 10 months before getting sent to Dachau, where she was shot and killed. == Awards == She was awarded the George cross in 1949 for her bravery in World War II == References == Category:1914 births Category:1944 deaths Category:Spies",
 "title": "Noor Inayat Khan"
}