{
 "id": "1137098",
 "text": "use both this parameter and |birth_date to display the person's date of birth, date of death, and age at death) --> | death_place = | death_cause = | body_discovered = | resting_place = | resting_place_coordinates = | burial_place = | burial_coordinates = | monuments = | nationality = Indian | other_names = Danu | siglum = | citizenship = Indian | education = Law education | alma_mater = Manipur University | occupation = actress, model, social activist | years_active = | era = | employer = | organization = Miss Universe India (MUI) | agent = | known_for = appearing in beauty pageants | notable_works = | style = | height = | television = Impact Tv | title = | term = | predecessor = | successor = | party = | otherparty = | movement = | opponents = | boards = | criminal_charges = | criminal_penalty = | criminal_status = | spouse = | partner = | children = | parents = | mother = Khuraijam Tarunibala | father = Birendra Singh Kangjam | relatives = | family = Kangjam | callsign = | awards = Best Actress Award for music video \"Khoidajei\" | website = | module = | module2 = | module3 = | module4 = | module5 = | module6 = | signature = | signature_type = | signature_size = | signature_alt = | footnotes = }} Danube Kangjam, shortly known as Danu, is an Indian model and actress. She is native to Imphal, Manipur. She is the title holder of the 18th Sunsilk Miss Mega Northeast beauty pageant in 2021. She is an activist for social issues with cybercrime, LGBT rights, body positivity and self-acceptance. She was the winner of the \"Graceful Walk\" title in the Miss Spring contest in the second edition of Shirui Lily Festival. Danube represents her state Manipur in the Miss Universe India 2024 beauty pageant. == Early life == Danube Kangjam was born to Birendra Singh Kangjam and Khuraijam Tarunibala. She belongs to Imphal West district of Manipur. Besides being a law student, she also worked as an anchor at ImpactTv. Before she started her modeling career, she was a fencing player and had represented Manipur at the National Games. == Education == Danube is a student of law education. She is a BA LLB from Vishal Law Institute, under Manipur University. She did her schooling from Shishu Nistha Niketan and Rajkumari Sanatombi Devi Vidyalaya. == Career == Danube got her inspiration from Mega Miss North East 2015 winner Jessica Marbanian. Upon winning the 18th Sunsilk Miss Mega Northeast beauty pageant in 2021, she said, Danube Kangjam was a judge of the Miss Phek 2023 at the Phek District Beauty Pageant 2023 held at Phek town on August 25 under the aegis of Vogue Entertainment Nagaland (VEN). She achieved the title of \"Graceful Walk\" in the Miss Spring contest in the second edition of Shirui Lily Festival. She stands in for her home state Manipur in the Miss Universe India 2024 beauty pageant. == Awards == Danube was awarded the the Best Actress SIFF-2019 for a Meitei language music video named Khoidajei (My secret love) in the SKG International Film Festival (SIFF-2019) held from 29th May to 2nd June 2019 at Ahmedabad, India. == Filmography == Danube acted in a Meitei language music video named Khoidajei (My secret love) directed by Roziit Chongtham and produced by Joychand Moirangthem. The music video was the winner of the Best Music Video Award of SKG International Film Festival (SIFF-2019) held from 29th May to 2nd June 2019 at Ahmedabad, India. == References == Category:Meitei people",
 "title": "Danube Kangjam"
}