{
 "id": "1137601",
 "text": "Krishnaism refers to a collection of Hindu traditions (sampradayas) that focus on the worship of Krishna as the Svayam Bhagavan (the Supreme God), considered the source of all reality, as opposed to being merely an avatar of Vishnu. This term is often used in academic discussions to distinguish Krishna- centered worship from other forms of Vaishnavism, such as Sri Vaishnavism, Ramaism, or Radhaism. == History and Origins == Krishnaism is believed to have originated in the late centuries BCE through the followers of the heroic deity, Vāsudeva Krishna. Over time, this tradition amalgamated with the worship of the \"divine child\" Bala Krishna and the Gopala-Krishna traditions, giving rise to the monotheistic school known as Bhagavatism. During the early centuries CE, these non-Vedic traditions aligned with Vedic practices to gain recognition from the orthodox establishment. The teachings of the Bhagavad Gita are often considered one of the first expressions of Krishnaite theology. == Key Scriptures == The key scriptures that guide Krishnaism include: * Bhagavad Gita * Bhagavata Purana * Harivamsa (an appendix to the Mahabharata) * Brahma Vaivarta Purana * Garga Samhita These texts emphasize the devotional worship (bhakti) of Krishna, the supremacy of Krishna as God, and the pursuit of a personal relationship with the deity. == Distinction from Vaishnavism == Krishnaism differs from other Vaishnava traditions, which generally regard Krishna as an avatar of Vishnu. In Krishnaism, Krishna is seen as the original, highest form of God, or Svayam Bhagavan. Krishnaites, therefore, do not necessarily subscribe to the Vishnu-centric view found in other Vaishnava traditions such as Sri Vaishnavism and Ramaism. == Bhakti Movement == Krishnaism gained momentum during the Bhakti movement in medieval India. Bhakti poets like Meera Bai expressed their devotion to Krishna in personal and emotive ways, often disregarding formal religious institutions. == Forms of Worship == Worship within Krishnaism is centered on: * Devotion to Krishna as the Supreme Being * Practices of bhakti yoga (devotion through love and service) * Worship of Krishna in various forms: as a child (Bala Krishna), as a youthful lover (Gopala), or as the charioteer of Arjuna in the Bhagavad Gita. == Related pages == * Vaishnavism * Bhagavata Purana * Bhakti movement * Meera Bai * Radha-Krishna == References == == Other websites == * Krishna.com – Official website for Krishna-related content * Smithsonian Institution's collection of Krishna art Category:Hinduism",
 "title": "Krishnaism"
}