{
 "id": "1137099",
 "text": "The Gerando Líderes Institute was founded in late 2023 by businessman and customer service specialist Sanger Santos, with the aim of training young people for the job market and developing leadership skills. The organization stands out for being run by young people themselves, promoting participatory and innovative management. == History == Since its creation, the Institute has been dedicated to offering mentoring and training programs. In April 2024, the founding board was sworn in, and since then, the Institute has carried out several initiatives aimed at youth development. One of the important milestones was the partnership with the company HIPED, where classes I and II received specialized mentoring. === Purpose === The Institute is a group of young, inspiring leaders with a purpose to serve others. They adopt the habit of going above and beyond, always seeking excellence in their actions. The motto \"Eagle flies with eagle\" reflects the philosophy that strong leaders come together to achieve great goals. == Levanta Juventude Program == Between July 1st and 5th, the Gerando Líderes Institute, with the support of the Youth Secretariat (Sejuv), will hold the 'Levanta Juventude' program in Campo Grande . This program is aimed at training young people for the job market and expects to bring together 300 participants, who will receive a 20-hour certificate at the end of the event. 'Levanta Juventude' offers five days of immersion, with activities focused on: *Leadership and Innovation *Personal Marketing *Diction and Oratory *Entrepreneurship *Financial Education *Emotional Intelligence In addition to lectures and workshops, the event will feature urban dance performances, rock band concerts, and a job and internship desk aimed at high school students. Since 2017, Levanta Juventude (then led by SEJUV) has served more than 20 thousand young people, providing opportunities for personal and professional growth. == References == Category:Organizations",
 "title": "Instituto Gerando Líderes"
}