{
 "id": "1137424",
 "text": "The 2028 Philippine Senate election will be the 36th election of members to the Senate of the Philippines for a six-year term. It will be held on Monday, May 8, 2028, within the 2028 general elections. == Term-limited incumbents == The following are serving a successive six-year and are barred from seeking reelection. # Win Gatchalian (NPC) #:Gatchalian is speculated to be a candidate for president. He is a potential vice presidential candidate. # Risa Hontiveros (Akbayan) #:Hontiveros is interested to be a candidate for president. She is also a potential vice presidential candidate. # Joel Villanueva (Independent) # Juan Miguel Zubiri (Independent) #: On April 1, 2024, Zubiri announced that he will not run for any public office in 2028. ==Political parties== Parties in the Senate at the end of the 20th Congress of the Philippines Party Current seats Bloc membership Political affiliation Up Total Majority Minority Other 2025 2028 4 2 colspan=\"2\" 1 3 colspan=\"2\" PDP 1 2 colspan=\"2\" 1 0 colspan=\"2\" 0 1 colspan=\"2\" 0 1 colspan=\"2\" 0 1 colspan=\"2\" 1 0 colspan=\"2\" 4 2 colspan=\"4\" Total 12 12 24 / 24 == Candidates == === Declared candidates === The following have declared their intent to run in the election: Independent # Name Party Party Gender Ref Raffy Tulfo ♂ === Potential candidates === Nationalist People's Coalition # Name Party Party Gender Ref JV Ejercito ♂ Chiz Escudero ♂ Loren Legarda ♀ Nacionalista # Name Party Party Gender Ref Mark Villar ♂ Partido Demokratiko Pilipino # Name Party Party Gender Ref Robin Padilla PDP ♂ Partido Lakas ng Masa # Name Party Party Gender Ref Luke Espiritu ♂ Pwersa ng Masang Pilipino # Name Party Party Gender Ref Jinggoy Estrada ♂ Independent # Name Party Party Gender Ref Alan Peter Cayetano ♂ Heidi Mendoza ♀ Vico Sotto ♂ ==Results== The Commission on Elections, sitting as the National Board of Canvassers, is expected to proclaim the winners at least a week after election. 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 17 16 18 19 20 21 22 23 24 Before election Senate bloc colspan=\"5\" Independent bloc colspan=\"7\" Minority bloc colspan=\"9\" colspan=\"3\" Before election Party ‡ ‡ ‡ ‡ ‡ ‡ ‡ Election results Up Not up Up Not up Up Not up Up After election Party Senate bloc Key: ‡ Seats up * Gained by a party from another party √ Held by the incumbent \\+ Held by the same party with a new senator ===Per party=== ==Sources== Category:2028 elections Category:2028 in the Philippines Category:2020s elections in the Philippines",
 "title": "2028 Philippine Senate election"
}