{
 "id": "1137693",
 "text": "Joseph Lyle Menéndez (born January 10, 1968) and Erik Galen Menéndez (born November 27, 1970), are American brothers and convicted murderers. They were both convicted for first-degree murder after they killed their parents José and Mary Louise \"Kitty\" Menéndez in 1989. ==Murder== On August 20, 1989, Lyle and Erik entered their mansion and shot their parents to death while they were watching television. They used 12-gauge shotguns; shooting their father José six times and their mother Mary ten times. After the murders, the brothers would answer police questions and tell them that they went to a movie theatre to see Batman and attended the \"Taste of L.A.\" festival. They would spend a lot of money on expensive luxury items and vacationed in many different countries. The brothers would eventually be caught after Erik confessed to the murders to his psychologist. Lyle would be arrested first on March 8, 1990 and Erik would later turn himself into police on March 11 after arriving in Los Angeles from Israel. ==Trials== The first trial happened in 1993 and was very popular on television channel CourtTV at the time. Their lawyer Leslie Abramson said that their father José was a pedophile that was both mentally and sexually abusive towards them. Abramson also said their mother was an alcoholic, drug addicted enabler and that these factors were why the Menendez brother murdered their parents. Two cousins Andy Cano and Diane Vander Molen both supported the claims. The lawyer for the prosecution said that Lyle and Erik murdered their parents for financial gain and their parent's large inheritance. The jury would deadlock twice and it was announced that the brothers would be retried. In the second trial, the claims of sexual abuse were only allowed limited testimony by Judge Stanley Weisberg. The jury was also not allowed to vote for charges of manslaughter instead of murder. On July 2, 1996, The second trial would end with the judge convicting Lyle and Erik Menéndez of two counts of first-degree murder and conspiracy to murder. They would end up being sentenced to life in prison without the chance of parole. They were both separated and sent to two different prisons. On April 4, 2018, the two were reunited for the first time in 20 years when Lyle was moved to the R.J. Donovan Correctional Facility in San Diego where Erik was incarcerated. On October 24, 2024, Los Angeles District Attorney George Gascón announced that he was asking the court to resentence the case. ==References== Category:1968 births Category:1970 births Category:Living people Category:1980s murders in the United States Category:American murderers Category:American people convicted of murder Category:Crime in California Category:Criminals from California Category:Criminals from New York City Category:Sibling duos",
 "title": "Lyle and Erik Menéndez"
}