{
 "id": "1137008",
 "text": "Clancy is the seventh studio album by the American musical duo Twenty One Pilots. It was released on May 24, 2024, through Fueled by Ramen and Elektra Records. It is a concept album. The album is named after the protagonist introduced in the band's fifth studio album, Trench (2018). The album received positive reviews. It debuted at number two and three on the UK Albums Chart and Billboard 200 respectively. The album is supported by the Clancy World Tour, which started in Denver in August 2024. == Promotion == On February 15, 2024, the album covers for Vessel (2013), Blurryface (2015), Trench (2018) and Scaled and Icy (2021) on streaming platforms were partially covered with red tape. On February 19, the band's new logo was displayed on many billboards and posters. On February 22, the band released a video on their social media platforms. The video, narrated by Clancy, goes through the events of the previous three albums and his multiple escape attempts from Dema. He ends the video by stating he would be \"returning to Trench\". Clancy was announced for release on its initial date of May 17, 2024, on February 29. The album's first single, \"Overcompensate\", was released on the same day. The second single, \"Next Semester\", was released on March 27. The third single, \"Backslide\", was released on April 25. The fourth single, \"The Craving\", was released on May 22. This version was subtitled \"(Single Version)\" instead of the album's \"(Jenna's Version)\". Both songs have different instrumentation and production. On March 18, it was announced that every song in the album would have a music video. They would be released together with the album. However, this caused the album's release date to be pushed back by one week to May 24. This was due to the need for more time to finish the production of the music videos. On the album's release day, ten music videos were released through a livestream held on the band's YouTube channel. The release did not include the ones for the singles and for \"Paladin Strait\". It was released later on June 21. == Tour == A concert tour in support of the album, the Clancy World Tour, was announced when \"Next Semester\" was released. The tour began at Ball Arena in Denver, Colorado on August 15, 2024, and finished at The O2 Arena in London on May 14, 2025. Before the tour started, five small-scale concerts were held in various locations. The concerts were titled \"An Evening with Twenty One Pilots\". The first one took place at the Bowery Ballroom in New York City on May 2, 2024, the second at the Metropol in Berlin on May 7, the third at the Electric Ballroom in London on May 9, the fourth at the Lunario del Auditorio Nacional in Mexico City on May 14, and the fifth at the Newport Music Hall in Columbus, Ohio on May 24. On August 9, New Zealand alt-pop band Balu Brigada was announced to be the opening act for the US leg of the tour. They had also opened for the Australia & New Zealand, Latin American and the European tour legs. == Commercial performance == Clancy debuted at number three on the Billboard 200, making the biggest sales week for any rock album in 2024. This marks the band's fourth consecutive top three album on the chart. It also debuted at number two on the UK Albums Chart, behind The Tortured Poets Department (2024). ==Critical reception== On Metacritic, Clancy has an average score of 78 out of 100 based on five reviews, indicating \"generally favorable reviews\". == Track listing == Sample credits * \"Overcompensate\" contains an interpolation (recycled melody) of the song \"Bandito\", from their 2018 album, Trench. The song was written by Joseph and Meany and performed by Twenty One Pilots. Note * \"The Craving\" has two versions. They are respectively subtitled \"(Jenna's Version)\" and \"(Single Version)\" and feature different production and instrumentation from each other. == Charts == === Weekly charts === Weekly chart performance for Clancy Chart (2024) Peak position Argentine Albums (CAPIF) 4 Croatian International Albums (HDU) 4 Japanese Digital Albums (Oricon) 27 Japanese Hot Albums (Billboard Japan) 79 Lithuanian Albums (AGATA) 6 Swedish Physical Albums (Sverigetopplistan) 12 US Top Rock & Alternative Albums (Billboard) 2 === Year-end charts === Year-end chart performance for Clancy Chart (2024) Position Australian Vinyl Albums (ARIA) 42 Belgian Albums (Ultratop Flanders) 196 == References == Category:2024 albums Category:Concept albums",
 "title": "Clancy (album)"
}