{
 "id": "1137506",
 "text": "This article is about the notable events, related to Shumang Kumhei (), also known as Shumang Leela (), a traditional Meitei theatrical art form, happened in 2020s. == Events == === 2020 === * COVID-19 pandemic === 2021 === * 6 July: Manipur Government planned to use ‘Shumang Leela’ theatre to spread public awareness against COVID-19, by showing a play titled ‘Keidoubagi Kidoino’ (), directed by Sangeet Natak Akademi award winner Sougrakpam Hemanta to stop misinformation on the virus. * 11 July: The premier show of Shumang Kumhei “Keidoubagi Kidoino”, a COVID-19 awareness media advocacy campaign, produced by Directorate of Information & Public Relations (DIPR), Manipur under the initiative of Chief Minister, was organized at Iboyaima Shumang Leela Shanglen, Palace Compound in Imphal. * 20 August: The blessing ceremony for Shumang Leela titled \"Mei Iklaba Thamoi\" based on the life story of Tokyo Olympics Silver Medallist, Saikhom Mirabai Chanu, was organized at Iboyaima Shumang Leela Shanglen at Palace Compound in Imphal. * 22 September: A Shumang Leela play called \"Mei Iklaba Thamoi\" (), based on the life and work of Tokyo Olympics medallist Saikhom Mirabai Chanu was shown in Imphal. * 20 October: Manipur Governor inaugurated All Manipur Shumang Leela Festival 20-21 in Imphal. === 2022 === * 4 January: The premier show of the Sumang Lila titled 'Ima Macha' was performed by Time Star Artists Union at Langmeidong Maning Awang Leikai in Kakching district. * 13 April: Manipur State Shumang Leela Council (MSSLC) gave the Thokchom Iboyaima Award 2022 to director, producer and artist Moirangthem Bhorot Singh, during the observance of 22nd Shumang Leela Day held at Iboyaima Shumang Leela Shanglen in Imphal. * 30 August: The 50th All Manipur Shumang Leela Festival 2021-2022 started at Iboyaima Shumang Leela Shanglen at Palace Compound in Imphal. * 11 September: Sangai Artist Association performed Laklaroi Amuk Hanna Yeningtha at 50th State Kala Academy Sumang Leela Festival at Iboyaima Shumang Leela Shanglen, Palace Compound in Imphal. * 12 September: Sanaleibak Nachom Artist Association performed 'Wakhal Eronba' at 50th State Kala Academy Sumang Leela Festival at Iboyaima Shumang Leela Shanglen, Palace Compound, Imphal. * 29 October: Tributes were paid to Shumang Leela female artist, Late Namoijam Lata Leima from Maharabi Awang Leikai, Imphal West district. * 29 November: International Shumang Leela Festival, 2022, organized as a part of the Manipur Sangai Festival, was concluded at Iboyaima Shumang Leela Shanglen, Palace Compound, Imphal East district. * 29 December: Sanaleibak Nachom Artist Association performed \"Khunai Mai Taba\" at 19th Shumang Leela Ningtham Kumhei at Iboyaima Shumang Leela Shanglen, Palace Compound, Imphal from 24th December 2022 to 04th January 2023. === 2023 === * 10 February: 51st All Manipur Shumang Leela Festival 2022-23 started at Iboyaima Shumang Leela Shanglen in Imphal. === 2024 === * 18 January: The month-long workshop cum production on women's Shumang Leela folk play \"Haoba Konu\", organized by Yangam Leirak Nupi Leela Association, Heirangoi-thong, Imphal West district, was concluded at Iboyaima Shumang Leela Shanglen, Palace Compound, Imphal. * 5 March: Shumang Leela actor and director Oinam Thoiba, passed away at the age of 70. * 12 April: After a long gap of nearly a year due to the ethnic crisis in Manipur, the Shumang Leela traditional art form, was resumed with the performance of the play “Mutlaroidaba Machu” by the Peace Maker Artists’ Association, as a part of the 24th Shumang Leela Day at the Iboyaima Shumang Leela Shanglen in Imphal East district. * 7 July: Management Committee of the Manipur State Shumang Leela Council announced the newly elected executive members for the term 2024-28. == Related pages == * 2024 in Meitei culture * 2023 in Meitei culture * 2022 in Meitei culture * 2021 in Meitei culture == References == Category:2020s Category:Theatres Category:Meitei culture",
 "title": "2020s in Shumang Kumhei"
}