{
 "id": "1137030",
 "text": "Icom IC-V82 Technical data Frequency range 136–174 MHz Frequency steps 2.5–50k Hz Emission power 7 W (H), 4 W (M), 0.5 W (L) PEP modulation FM No. of channels 207 channels with 6 scans + 1 call consumption Reception: 20 mA, Emission: 1 A max. Operating voltage 6 – 10.3 V, nominal voltage 7.2 V Measurements and weight high 139 mm width 54 mm depth 36.7 mm weight approx. 390 grams More information Manufacturer COM Scope of application radio amateurs, (semi)professional users The Icom IC-V82 transceiver is a VHF band device designed for radio amateurs and professionals who require reliable, high-quality communication. Although it's a little outdated, (launched in 2004 and discontinued in 2014), the IC-V82 stands out for its robustness, ease of use and a number of advanced features that make it ideal for various applications, as the ability to be converted into a digital device. == Features == It is a portable VHF transceiver with coverage in the two-meter band (144–146 MHz) and a maximum output power of 7 watts. It was manufactured and sold by Icom from 2004 to 2014. * frequency : VHF 136-174 MHz * output power : 7 W (high), 4 W (medium), 0.5 W (low) * modulation : FM (Frequency Modulated) * channel memory : 207 channels * screen : LCD with backlight * battery : BP-222N (Ni-Cd) or BP-227 (Li-Ion) === Digital Module === One of the most outstanding features of the IC-V82 is the ability to convert it into a digital device using an additional module sold by Icom. This module allowed the incorporation of a DMR trunking protocol, which added advanced digital communication and encryption capabilities. == History == In June 2022, United Against Nuclear Iran, a U.S. advocacy organization, identified the Icom IC-V82 as being used by Hezbollah, a U.S. designated Foreign Terrorist Organization. It sent a letter to Icom outlining its concerns about the radios' dual-use capability of the transceiver and regarding Icom's business ties to Power Group (Icom's representatives in Lebanon) and Faza Gostrar, which claims to be the \"Official ICOM representative in Iran\".\"Risky Business: Icom's Two-Way Radios Landing In The Hands Of Hezbollah\", United Against Nuclear Iran, 11 July 2022.Christiaan Triebert and Aric Toler (18 September 2024. \"The device blasts on Wednesday may have involved more explosives than Tuesday's, a Times analysis suggests\", The New York Times. Many of the devices purchased by Hezbollah that later played a role in the 2024 Lebanon radio device explosions, killing at least 25 people and wounding over 708, were reported as being IC-V82s.Christiaan Triebert and Aric Toler (18 September 2024. \"The device blasts on Wednesday may have involved more explosives than Tuesday's, a Times analysis suggests\", The New York Times. Icom opened an investigation into the case on September 19, 2024, while a sales executive at the company's U.S. subsidiary said the devices involved appeared to be counterfeit units. === Counterfeit models and controversy === After Icom discontinued the IC-V82 in 2014, counterfeit models emerged in China. In addition, another counterfeit model was sold to Hezbollah, and many of the devices used by this group, they were exploded on September 18, 2024. Having ceased its production, Icom issued an advisory warning about counterfeit transceivers, including the IC-V82. In October 2018, the company issued a cease-and-desist order against a Chinese manufacturer suspected of producing counterfeit Icom products; it also noted that this was not the first time it had taken such steps. == Accessories and options == The IC-V82 has a variety of accessories that improve its functionality and ease of use: * Antenna : High gain antenna to improve reception and transmission. * Belt Clip : For comfortable and safe transport. * Optional batteries : Available in different capacities and technologies (Ni-Cd, Li-Ion). == References == == Other websites == * World official website (in English) * Old information from Icom Archived (in English) * Complete list of all radio amateur equipment manufactured by Icom Category:Radio Category:Electronics",
 "title": "Icom IC-V82"
}