{
 "id": "1137140",
 "text": "200px|thumb|Azalea in Sydney; Australia, August 2015.|alt=Iggy Azalea This is the videography of Australian rapper Iggy Azalea. == Music videos == === As a performer === ==== As lead artist ==== List of music videos as lead artist, showing other performer(s), director(s), album and year released Title Other performer(s) Director(s) Album Year Ref. \"Pu$$y\" rowspan=\"3\" Falkon Ignorant Art 2011 \"My World\" Alex/2Tone \"The Last Song\" Bell Soto 2012 \"Murda Bizness\" T.I. 3 Little Digs Glory Alex/2Tone \"Bac 2 Tha Future (My Time)\" rowspan=\"4\" Bell Soto TrapGold \"Work\" Jonas & François The New Classic 2013 \"Slo.\" Rankin TrapGold \"Bounce\" BRTHR The New Classic \"Change Your Life\" T.I. Jonas & François \"Fancy\" Charli XCX Director X 2014 \"Black Widow\" Rita Ora Director X Iggy Azalea \"Trouble\" Jennifer Hudson Reclassified 2015 \"Pretty Girls\" Britney Spears Cameron Duddy Iggy Azalea rowspan=\"6\" \"Team\" rowspan=\"2\" Fabien Montique 2016 \"Mo Bounce\" Lil Internet 2017 \"Switch\" Anitta Thom Kerr \"Savior\" Quavo 2018 Colin Tilley \"Kream\" Tyga Survive the Summer \"Sally Walker\" rowspan=\"2\" In My Defense 2019 \"Started\" \"Fuck It Up\" Kash Doll \"Lola\" Alice Chater Thom Kerr Iggy Azalea Wicked Lips \"Dance Like Nobody's Watching\" (Lyric video) Tinashe The End of an Era 2020 \"Sip It\" Tyga 2021 \"Brazil\" (Visualizer) \"I Am The Stripclub\" Thom Kerr Iggy Azalea \"Money Come\" Christian Breslauer Iggy Azalea 2023 ==== As featured artist ==== List of music videos as featured artist, showing other performer(s), director(s), album and year released Title Other performer(s) Director(s) Album Year Ref. \"I Think She Ready\" FKi Diplo Alex/2Tone Transformers n the Hood 2012 \"Beat Down\" Steve Aoki Angger Dimas Wonderland (Remixed) \"Problem\" Ariana Grande Jones Crow My Everything 2014 Nev Todorovic \"No Mediocre\" T.I. Director X Paperwork \"Booty\" Jennifer Lopez Hype Williams \"Pretty Girls\" Britney Spears Cameron Duddy Iggy Azalea 2015 === Cameo appearances === List of cameo appearances in music videos, showing performer(s), director(s), album and year released Title Performer(s) Director(s) Album Year Ref. \"Otis\" (Remix) YG Reem Riches Kenneth Wynn 2011 \"Hot Wheels\" T.I. Travis Porter Young Dro Alex Smith F*ck Da City Up 2012 \"Mr. Taxi\" (Remix) Steve Aoki Punit Dhesi == Filmography == List of films, showing year released, role, director(s) and selected notes Title Year Role Director(s) Notes Ref. Furious 7 2015 Female Racer Cameo appearance == Television == === Appearances as herself === List of television shows, showing appearance year, channel and selected notes Title Year Channel Notes Ref. Tracks 2012 Arte Mini-documentary Iggy Azalea's Hottest Club Joints 2013 4Music Host; special countdown The Show with Vinny MTV Episode #1.9 MTV News Interviewer; World War Z Premiere Segment Never Mind the Buzzcocks BBC Two Competitor; Episode #27.4 MTV Video Music Awards MTV Presenter MOBO Awards BBC Three MTV Europe Music Awards MTV Studio 10 Network Ten Episode \"13 November 2013\" MTV Movie Awards 2014 MTV Presenter This Is Hot 97 VH1 Episode #1.8: \"The Turn Up\" Jimmy Kimmel Live! ABC Skit: \"New Lyrics for Old People\"; Episode #12.73 Billboard Music Awards Presenter Chelsea Lately E! Episode #8.79 Dave Skylark's Very Special VMA Special MTV Guest Interview Saturday Night Live NBC Skit: \"Halloween Party\"; Episode #40.4: \"Jim Carrey/Iggy Azalea\" Today 2015 Nine Network Episode \"17 June 2015\" The Late Late Show with James Corden CBS Carpool Karaoke; Episode #1.46 Lip Sync Battle Spike Competitor; Episode #1.16: \"Iggy Azalea vs. Nick Young\" Today Nine Network Episode \"19 August 2015\" The Project Network Ten Good Morning America 2016 ABC Episode \"23 March 2016\" Watch What Happens Live Bravo The Ellen DeGeneres Show CBS Episode \"8 April 2016\" Late Night with Seth Meyers NBC Episode \"28 April 2016\" Wild 'n Out MTV Competitor; Episode #8.2: \"Iggy Azalea/Travis Mills\" The X Factor Australia Seven Network Judge; Season 8 Extra 2017 Syndicated Universal Studios interview; Episode \"22 May 2017\" Watch What Happens Live Bravo Episode \"21 May 2017\" The Late Late Show with James Corden CBS Flinch; Episode #3.125 Premios Juventud Univision Presenter Dare to Live MTV Episode #1.5 Total Request Live 2018 Episode \"15 February 2018\" Hollywood Medium E! Episode \"14 March 2018\" Watch What Happens Live Bravo Episode \"18 March 2018\" Extra Syndicated Universal Studios interview; Episode \"11 July 2018\" Access Live Episode \"11 July 2018\" Hip-Hop Houdini Fuse Episode #1.3 iHeartRadio Music Festival The CW Presenter Overserved with Lisa Vanderpump 2021 E! Episode #1.3 The Celebrity Dating Game ABC Episode #1.2 === As a performer === List of television shows, showing performance year, channel and performed song(s) Title Year Channel Performed song(s) Ref. BET Hip Hop Awards 2012 BET Grand Hustle Cypher (with T.I., B.o.B, Chip and Trae tha Truth) VH1 Divas VH1 \"Groove Is in the Heart\" (with Natasha Bedingfield and Bootsy Collins) Britain & Ireland's Next Top Model 2013 Sky Living \"Work\" The Sound of Change Live NBC \"Work\"; \"Bounce\" Nikki & Sara Live MTV \"Work\" Smells Like Friday Night Channel 4 \"Bounce\" 106 & Park BET \"Change Your Life\" (with T.I.) Trending 10 Fuse \"Change Your Life\" Trending 10. 4 October 2013. Fuse Alan Carr: Chatty Man Channel 4 MOBO Awards BBC Three \"Change Your Life\"; \"Work\" Wake Up Network Ten \"Change Your Life\" Wake Up. 13 November 2013. Network Ten MTV Europe Music Awards MTV \"Blurred Lines\" (with Robin Thicke) The Late Show with David Letterman CBS \"Change Your Life\" (with T.I.) mtvU Woodie Awards 2014 mtvU \"Fancy\" (with Charli XCX) Late Night with Seth Meyers NBC Good Morning America ABC Jimmy Kimmel Live! Billboard Music Awards \"Fancy\" (with Charli XCX); \"Problem\" (with Ariana Grande) Dancing with the Stars \"Fancy\" (with Charli XCX) BET Awards BET \"No Mediocre\" (with T.I.); \"Fancy\" ESPY Awards ESPN \"Fancy\" iHeartRadio Ultimate Pool Party The CW \"Bounce\"; \"Work\"; \"Fancy\"; \"Problem\" (with Ariana Grande) iHeartRadio Ultimate Pool Party. 9 July 2014. The CW The Today Show NBC \"Work\"; \"Fancy\" MTV Video Music Awards MTV \"Black Widow\" (with Rita Ora) The Ellen DeGeneres Show CBS Saturday Night Live NBC \"Fancy\"; \"Black Widow\" (with Rita Ora); \"Beg for It\" (with MØ) American Music Awards ABC \"Fancy\" (with Charli XCX); \"Beg for It\"; \"Booty\" (with Jennifer Lopez) The Tonight Show Starring Jimmy Fallon NBC \"Beg for It\" Dick Clark's New Year's Rockin' Eve with Ryan Seacrest ABC \"Fancy\" (with Charli XCX) People's Choice Awards 2015 CBS \"Beg for It\" The Tonight Show Starring Jimmy Fallon NBC \"Trouble\" (with Jennifer Hudson) Nickelodeon Kids' Choice Awards Nickelodeon iHeartRadio Music Awards NBC American Idol Fox Billboard Music Awards ABC \"Pretty Girls\" (with Britney Spears) MTV Video Music Awards MTV \"Cool for the Summer\" (with Demi Lovato) The Tonight Show Starring Jimmy Fallon 2016 NBC \"Team\" iHeartRadio Music Awards TBS The Ellen DeGeneres Show CBS Late Night with Seth Meyers NBC Good Morning America ABC \"Team\"; \"Black Widow\"; \"Fancy\" Wild 'n Out MTV \"Team\" The Tonight Show Starring Jimmy Fallon 2017 NBC \"Switch\" (with Anitta) MTV Millennial Awards MTV Latin \"Mo Bounce\"; \"Switch\" The Late Late Show with James Corden CBS \"Switch\" iHeartRadio Much Music Video Awards Much Premios Juventud Univision The Late Late Show with James Corden 2018 CBS \"Savior\" Jimmy Kimmel Live! 2019 ABC \"Sally Walker\" International Music Award P7S1 \"Lola\" (with Alice Chater) == Web == List of web appearances, showing year, streaming service and selected notes Title Year Service Notes Ref. GGN: Snoop Dogg's Double G News Network 2011 YouTube Holiday special Close To! 2012 Ofive.tv (Play TV) Mini-documentary Vevo Lift 2013 Vevo Campaign; web series House of Style 2014 MTV.com Host; web series Vevo Certified SuperFanFest Vevo Performer TIDAL X: Mercedes Iggy Azalea 2017 Tidal TIDAL X Brooklyn Droppin' Cash: Los Angeles 2018 Complex Web series ET Live Entertainment Tonight PEOPLE Now People BUILD Series NYC 2019 AOL Get Ready With Me Vogue Paris Get Ready With Me | Vogue Paris – YouTube RuPaul WOW Presents 'RuPaul' with Iggy Azalea! – YouTube The X Change Rate Build Series The X Change Rate: Iggy Azalea – YouTube Fan Vs Artist Trivia iHeartRadio Episode: \"Iggy Azalea Goes Head to Head With Her Biggest Fan\" Fan Vs Artist Trivia – YouTube Expensive Taste Test Cosmopolitan Episode: \"Iggy Azalea Has Fancy Taste and Isn't Sorry About It\" Expensive Taste Test – YouTube Disgustingly Healthy Men's Health Episode: \"Iggy Azalea Eats Kangaroo and Talks New Playboi Carti Album\" Disgustingly Healthy | Men's Health – YouTube Wired Autocomplete Interview 2024 Wired Episode: \"Iggy Azalea Answers The Web’s Most Searched Questions\" Most Prized Possessions InStyle Episode: \"Iggy Azalea's Most Prized Possesions\" Know Their Lyrics Variety Episode: \"Does Iggy Azalea Know the Lyrics to Her Most Famous Songs?\" == Commercials == List of commercials, showing company, campaign, year and director(s) Company Campaign Year Director(s) Ref. Adidas Unite All Originals 2013 Colin Solal Cardo Samsung Milk Music 2014 Warren Fu Forever 21 Unwrap Style Bonds BONDS100 2015 Monster Products Super Bowl LII 2018 Bjorn Ruhmann Postmates IGGY100 OnlyFans Hotter Than Hell 2023 Josh Farias Sam Brave == Notes == == References == == Other websites == * * Iggy Azalea videography at MTV.com Videographies Azalea, Iggy",
 "title": "Iggy Azalea videography"
}