{
 "id": "1137081",
 "text": "Hyloxalus insulatus is a frog. It lives in Peru. ==Body== The adult male frog can be as big as 22.2 mm long from nose to rear end and the adult female frog can be as big as 26.0 mm long. The skin of the frog's back is red-brown in color with four darker brown marks in the middle of the back. The mouth and parts of the front legs are white in color. There are disks on the toes of all four feet for climbing. The rest of the front legs are brown with gray-white color. The sides of the body are gray and brown in color with white stripes. The tops of the back legs are brown with darker brown marks. The rest of the legs have white marks. The throat is gray in color with two black spots. The belly is white in color. The bottoms of the back legs are gray in color with some orange spots. The iris of the eye is bronze in color with some black marks. The male frog's male organs are white in color. ==Home== Scientists saw this frog in rocky streams with many cactus plants nearby. They also saw it next to roads if there was water there. They were on mountains in the Cordillera Central and Cordillera Occidental. Scientists saw this frog in the Río Marañón valley between 1260 and 2600 meters above sea level and in a few other places. ==Young== Scientists believe the female frog lays her eggs on the ground and that, after the eggs hatch, the adult frogs carry them to water. At one point in its life, the tadpole can be 13.0 mm long without the tail and 38.8 mm long with the tail. It has a round body, and the eyes are on the tops and sides of its head. The iris of the eye is light bronze in color. The body is olive brown in color and the tail is brown with olive-brown spots. ==Danger== Scientists believe this frog is in some danger of dying out because people keep changing the places where it lives: people start fires to make the land ready for farms. Farmers take water away from streams for their farms, so there are fewer places for the tadpoles to grow. Pollution can also hurt this frog. Because scientists saw the frogs next to roads, they think this frog is good at living in places that human beings have changed. Scientists also think the fungal disease chytridiomycosis could have killed many of these frogs. They think climate change could also hurt this frog because it could change the streams of water where the frog lives. ==First paper== * ==References== Category:Frogs of South America",
 "title": "Hyloxalus insulatus"
}