{
 "id": "1137428",
 "text": "Lucy Westenra is a character in the book Dracula by Bram Stoker. She’s Mina’s best friend. ==Proposals== An American named Quincy Morris, a psychiatrist named Dr. John Seward and an aristocrat named Arthur Holmwood each asked her to marry him on the same day. She said no to Dr. Seward and to Quincy but yes to Arthur. Seward then decided to focus on studying his patient R.M. Renfield. == Sleepwalking == When Lucy and her friend Mina were walking near a Church at night, a Bat flew from near the Church’s Cemetery and bit Lucy. Then Lucy started sleepwalking. == Sickness == Lucy’s mother Mrs. Westenra was dying and Lucy knew that. So when Lucy started to get very sick she didn’t want her mother to know. When Lucy’s fiancé Arthur noticed, he wrote to his friend Dr. John Seward asking him for help. When Dr. Seward started treating her, he didn’t tell Lucy’s mother what was happening since Lucy asked him not to tell her. Dr. Seward realized that since he was a psychiatrist he couldn’t save her, Seward wrote to his teacher, Professor Abraham Van Helsing and asked Van Helsing for his help. == Blood Transfusions == Dr. Abraham Van Helsing told Lucy to sleep with Garlic by her bed and to keep the Window closed at night but didn’t tell Lucy’s mother Mrs. Westenra. Mrs. Westenra thought the room smelled bad so she took away the garlic and opened the window. Lucy had a dream about a Mist coming through her window and turning into a bat. Van Helsing told Mrs. Westenra that the garlic and open window are a medical treatment. Then a bat flew to Lucy’s window at night and hypnotized her into opening it and taking away the garlic and Lucy woke up thinking it was a dream. Van Helsing and Dr. Seward realized Lucy lost a lot of blood so they kept her alive with blood transfusions taking the blood from themselves and Quincy and Arthur. Then a wolf broke into Lucy’s house and Lucy’s mother died of a Heart attack. Then Lucy died of not having enough blood. == The Bloofer Lady == Dr. Van Helsing asked Dr. Seward to cut off Lucy’s head and put garlic in her mouth. Dr. Seward said no. After Lucy was buried, a lot of children showed up wounded at hospitals and said that they were attacked by a Bloofer Lady who turned into a Big Bad Wolf like in Little Red Riding Hood. Van Helsing noticed that when the children were asked what the Bloofer Lady looked like, they said she looked a lot like Lucy but with darker hair and sharper teeth. A lot of children also ended up in hospitals because they were bitten by a vampire bat. Van Helsing told Dr. Seward that the only living things to get sick the way Lucy did were animals that were bitten by vampire bats. Seward asked if the same bat who bit her were biting the children. Seward said that Lucy was the vampire bat who was biting the children and also the wolf who attacked them. Van Helsing said that Lucy was an Undead being called a Nosferatu and that, unless they killed her, everyone she bit would become Nosferatu when they died. == Second Death == Van Helsing convinced Dr. Seward to break into Lucy’s grave with him and show him she wasn’t there. Seward said it was because of grave robbery. When they broke in again during the day and she was there, Seward assumed it was because the robber moved her body even though she didn’t look like she was dead. Later on Seward and Van Helsing saw Lucy leave her grave at Sunset and turn into a vampire. So Seward and Van Helsing told her fiancé Arthur she wasn’t dead and he assumed that she was buried alive. Seward and Van Helsing took Arthur and Quincy with them to Lucy’s grace at night and Van Helsing surrounded it with Catholic wafers so vampires couldn’t get in or out. Lucy flew there with a child she kidnapped but couldn’t get in so she dropped the child. Lucy saw Arthur and tried to get him to kiss her but also threatened the child so Arthur stabbed her with a stake through her heart and killed her. Then she turned from a vampire to a dead human and looked peaceful. To make sure it worked, Van Helsing cut Lucy’s head off and put garlic in her mouth before burying her again. == Later impact on the plot == Van Helsing says that since she died while the children she bit were alive, they won’t turn undead. He says they still have to find the Vampire who bit her and kill him otherwise everyone he’s bitten will become vampires after they die the same way that Lucy did. Category:Characters in written fiction",
 "title": "Lucy Westenra"
}