{
 "id": "1137089",
 "text": "A United States presidential debate is held every four years, and is only held close to a United States presidential election. Its topics include controversial topics, economics, inflation, and immigration, most of which are organized by the Commission on Presidential Debates (CPD) since 1988, with the exception of 2024, when former president and presumptive Republican nominee Donald Trump and incumbent president and presumptive Democratic nominee Joe Biden criticized and rejected the CPD's schedule and date, and instead debated on CNN and ABC, after President Biden withdrew from the election, Vice President Kamala Harris replaced him and was nominated by the Democratic Party, debating on ABC. == Viewership == === 1960 debates === The first debate for the 1960 U.S. presidential election attracted more than 66 million viewers out of a total population of 179 million, making it one of the most watched broadcasts in American television history. === 1980 debates === The 1980 debates for the 1980 U.S. presidential election drew 80 million viewers out of a national population of 226 million, making it one of the highest-rated presidential televised debates until 2016. === 2016 debates === The 2016 presidential debate between then-Republican candidate Donald Trump and Secretary of State and also Democratic candidate Hillary Clinton attracted an audience of more than 84 million out of a then-327 million viewers in the United States, making it the most-watched presidential debate ever, beating the record set in 1980. == List == Notes: * D = Democratic * R = Republican * I = Independent * * = Incumbent president at that time. * ** = Incumbent vice president at that time. Election Debate Presidential debates Sponsor Location Moderators Television Viewership Source 1960 First debate Richard Nixon (R) John F. Kennedy (D) ABC, CBS, and NBC WBBM-TV studios Chicago, Illinois Howard K. Smith of CBS 66.4 million Second debate Richard Nixon (R) John F. Kennedy (D) WRC-TV studios Washington, D.C. Frank McGee of NBC 61.9 million Third debate Richard Nixon (R) John F. Kennedy (D) Split-screen telecast with Nixon and panelists in ABC studios in Los Angeles and Kennedy in ABC studios in New York Bill Shadel of ABC 63.7 million Fourth debate Richard Nixon (R) John F. Kennedy (D) ABC studios New York City, New York Quincy Howe of ABC 60.4 million 1976 First debate Gerald Ford*(R) Jimmy Carter(D) League of Women Voters Walnut Street Theater Philadelphia, Pennsylvania Edwin Newman of NBC 69.7 million Second debate Gerald Ford*(R) Jimmy Carter(D) Palace of Fine Arts San Francisco, California Pauline Frederick of NPR 63.9 million VP Debate Bob Dole (R) Walter Mondale (D) Alley Theatre Houston, Texas James Hoge of the Chicago Sun- Times 43.2 million Third debate Gerald Ford*(R) Jimmy Carter(D) Phi Beta Kappa Memorial Hall at W&M; Williamsburg, Virginia Barbara Walters of ABC 62.7 million 1980 First debate Ronald Reagan (R) John B. Anderson (I) Baltimore Convention Center Baltimore, Maryland Bill Moyers of PBS Second debate Jimmy Carter* (D) Ronald Reagan (R) Public Music Hall Cleveland, Ohio Howard K. Smith of ABC 80.6 million 1984 First debate Ronald Reagan* (R) Walter Mondale (D) Kentucky Center for the Performing Arts Louisville, Kentucky Barbara Walters of ABC 65.1 million VP debate George H. W. Bush** (R) Geraldine Ferraro (D) Philadelphia Convention Hall and Civic Center Philadelphia, Pennsylvania Sander Vanocur of ABC 56.7 million Second debate Ronald Reagan* (R) Walter Mondale (D) Music Hall, Municipal Auditorium Kansas City, Missouri Edwin Newman 67.3 million 1988 First debate George H. W. Bush** (R) Michael Dukakis (D) Commission on Presidential Debates Wait Chapel at Wake Forest University Winston-Salem, North Carolina Jim Lehrer of PBS 65.1 million VP debate Dan Quayle (R) Lloyd Bentsen (D) Omaha Civic Auditorium Omaha, Nebraska Judy Woodruff of PBS 46.9 million Second debate George H. W. Bush** (R) Michael Dukakis (D) Pauley Pavilion at UCLA Los Angeles, California Bernard Shaw of CNN 67.3 million 1992 First debate George H. W. Bush* (R) Bill Clinton (D) Ross Perot (I) Field House at Washington University in St. Louis St. Louis, Missouri Jim Lehrer of PBS 62.4 million VP debate Dan Quayle** (R) Al Gore (D) James Stockdale (I) Theater for the Arts at Georgia Tech Atlanta, Georgia Hal Bruno of ABC 51.2 million Second debate George H. W. Bush* (R) Bill Clinton (D) Ross Perot (I) Robins Center at University of Richmond Richmond, Virginia Carole Simpson of ABC 69.9 million Third debate George H. W. Bush* (R) Bill Clinton (D) Ross Perot (I) Wharton Center for Performing Arts at MSU East Lansing, Michigan Jim Lehrer of PBS 66.9 million 1996 First debate Bill Clinton* (D) Bob Dole (R) Mortensen Hall at The Bushnell Center for the Performing Arts Hartford, Connecticut Jim Lehrer of PBS 46.1 million VP debate Al Gore** (D) Jack Kemp (R) Mahaffey Theater St. Petersburg, Florida 26.6 million Second debate Bill Clinton* (D) Bob Dole (R) Shiley Theater at University of San Diego San Diego, California 36.3 million 2000 First debate Al Gore** (D) George W. Bush (R) Clark Athletic Center at University of Massachusetts Boston, Massachusetts Jim Lehrer of PBS 46.6 million VP debate Joe Lieberman (D) Dick Cheney (R) Norton Center for the Arts at Centre College Danville, Kentucky Bernard Shaw of CNN 28.5 million Second debate Al Gore** (D) George W. Bush (R) Wait Chapel at Wake Forest University Winston-Salem, North Carolina Jim Lehrer of PBS 37.5 million Third debate Al Gore** (D) George W. Bush (R) Field House at Washington University in St. Louis St. Louis, Missouri 37.7 million 2004 First debate George W. Bush* (R) John Kerry (D) Convocation Center at University of Miami Coral Gables, Florida Jim Lehrer of PBS 62.4 million VP debate Dick Cheney**(R) John Edwards (D) Veale Center at Case Western Reserve University Cleveland, Ohio Gwen Ifill of PBS 43.5 million Second debate George W. Bush* (R) John Kerry (D) Washington University in St. Louis St. Louis, Missouri Charles Gibson of ABC 46.7 million Third debate George W. Bush* (R) John Kerry (D) Grady Gammage Memorial Auditorium at ASU Tempe, Arizona Bob Schieffer of CBS 51.1 million 2008 First debate John McCain (R) Barack Obama (D) University of Mississippi Oxford, Mississippi Jim Lehrer of PBS 52.4 million VP debate Sarah Palin (R) Joe Biden (D) Washington University in St. Louis St. Louis, Missouri Gwen Ifill of PBS 69.9 million Second debate John McCain (R) Barack Obama (D) Belmont University Nashville, Tennessee Tom Brokaw of NBC 63.2 million Third debate John McCain (R) Barack Obama (D) Hofstra University Hempstead, New York Bob Schieffer of CBS 56.5 million 2012 First debate Barack Obama* (D) Mitt Romney (R) University of Denver Denver, Colorado Jim Lehrer of PBS 67.2 million VP debate Joe Biden** (D) Paul Ryan (R) Centre College Danville, Kentucky Martha Raddatz of ABC 51.4 million Second debate Barack Obama* (D) Mitt Romney (R) Hofstra University Hempstead, New York Candy Crowley of CNN 65.6 million Third debate Barack Obama* (D) Mitt Romney (R) Wold Performing Arts Center at Lynn University Boca Raton, Florida Bob Schieffer of CBS 59.2 million 2016 First debate Hillary Clinton (D) Donald Trump (R) Hofstra University Hempstead, New York Lester Holt of NBC 84 million VP debate Tim Kaine (D) Mike Pence (R) Longwood University Farmville, Virginia Elaine Quijano of CBS 36 million Second debate Hillary Clinton (D) Donald Trump (R) Washington University in St. Louis St. Louis, Missouri Anderson Cooper of CNN Martha Raddatz of ABC 66.5 million Third debate Hillary Clinton (D) Donald Trump (R) Thomas & Mack Center at University of Nevada, Las Vegas Paradise, Nevada Chris Wallace of Fox 71.6 million 2020 First debate Donald Trump* (R) Joe Biden (D) Health Education Campus Samson Pavilion Cleveland, Ohio Chris Wallace of Fox 73.1 million VP debate Mike Pence* (R) Kamala Harris (D) Kingsbury Hall at University of Utah Salt Lake City, Utah Susan Page of USA Today 57.9 million Second debate Donald Trump* (R) Joe Biden (D) ~~Arsht Center~~ ~~Miami, Florida~~ Steve Scully of C-SPAN Debate cancelled Third debate Donald Trump* (R) Joe Biden (D) Belmont University Nashville, Tennessee Kristen Welker of NBC 63 million 2024 First debate Joe Biden* (D) Donald Trump (R) CNN, ABC, CBS (for VP debate) Techwood Turner Campus, Studio D Atlanta, Georgia Jake Tapper of CNN Dana Bash of CNN 51.3 million Second debate Kamala Harris**(D) Donald Trump (R) National Constitution Center Philadelphia, Pennsylvania David Muir of ABC Linsey Davis of ABC 67.1 million VP debate Tim Walz (D) JD Vance (R) CBS Broadcast Center New York City, New York Margaret Brennan of CBS Norah O'Donnell of CBS 43 million == Notes == == References == Category:United States presidential campaigns Category:United States presidential elections Category:2024 United States presidential election Category:2024 United States presidential campaigns",
 "title": "United States presidential debates"
}