{
 "id": "1138028",
 "text": "Princess Heledd of Powys (original birth name unclear; born before 640 in the Kingdom of Powys; death date unclear) was a mid seventh-century Welsh princess, writer, poet, and the survivor of the massacres of Welsh people committed by English Mercian officers. Heledd wrote a poetic memoir named Canu Heledd (first published in 1410) about her wartime experience (with the English Kingdom of Mercia), the massacres of the Welsh officers, soldiers, and even civilians, and about the siege of Pengwern in 655, her home city. == Heledd's life and biography before the war and the massacres of her people == Heledd was born before 640 in the Kingdom of Powys as the biological daughter of King Cyndrywyn the Stubborn of Powys. Heledd's original birth name is unclear; when Heledd would have written her memoir, Canu Heledd, she used the pseudonym \"Heledd\" to describe what grief she was feeling because of the war and the massacres of her family members and the Welsh people, perpetrated by the English Mercian officers and soldiers. In the Old Welsh language, Heledd's name means \"salt pit\" or \"salt pool\", which would be something related to feelings of grief and sorrow, at the time of seventh century Wales, which Heledd lived in, so it is already obvious that Heledd is not her real name at birth, and she was obviously not called by that name before the war and massacres by the Mercians started. Anyways, Heledd's family members were royal members of the House of Powys. Heledd had three brothers and eight sisters. Her three brothers are named: Cynan, Cynddylan, and Cynwraith, and her eight sisters are named: Gwladus, Gwenddwyn, Ffreuer, Meddwyl, Meddlan, Gwledyr, Meisir, and Ceinfryd. When Heledd was older than two years, her father Cyndrywyn had died highly likely during the Battle of Maserfield of 642, in which he and his army would had fought the Kingdom of Northumbria, during a invasion. After Cyndrywyn's death and burial in 642, the invasion between the Kingdom of Powys and the Kingdom of Northumbria would have ultimately ended, and Heledd's much elder brother, King Cynddylan of Powys, would take the throne and succeed his father as King of Powys after his death. Heledd (and her younger siblings) would have been therefore raised by a single mother and her elder brothers and sisters. Heledd probably lived a happy life for more than fifteen years, before the war between the Welsh and the English, and the massacres of her people, by the English Mercian officers and soldiers. == Biography and war crimes/massacres committed by the English Mercians == By 655 AD, Heledd lived in the Welsh Kingdom of Powys with her royal family, and her elder brother King Cyndyllan of Powys was the king of Powys, at the time, with her family being members of the House of Powys. In 655, the Welsh Kingdom of Powys invaded and attacked the English Kingdom of Mercia, so obviously they attacked and invaded them back. The Kingdom of Mercia, had a sizeable military and army soldiers, so they presumably quickly occupied and annexed most of the Kingdom of Powys. In retaliation because the kingdom of Powys invaded and attacked their country, the English launched a massacre of Welsh soldiers, officers, and even civilians, attacking them in a brutal way. Many had died due to the heinous assaults and atrocities committed by the English Mercian officers, against not only the military (but obviously also civilians). Heledd's \"ardent brothers\" were among the many Welsh people slaughtered by English officers, during their massacres, and Heledd \"laments for them in her memoir\". The siege, shortage of food and other supplies, the Mercian occupation of the Kingdom of Powys, and the massacres of so many innocent Welsh people, allowed Heledd and other Welsh survivors of the massacres, to fall ill, desperate, and hungry. It was so difficult to flee the heavily damaged Mercian occupied Kingdom of Powys, and flee to somewhere far safer, so Heledd and most other Welsh survivors had to stay behind, in the very heavily damaged towns and areas of Powys perpetrated by the English Mercians, for a while, before evacuation from most areas would start. After the siege of Pengwern, the start of occupation, and massacres, Heledd and her maidens and possibly even servants (who survived the war and massacres with her) were fortunately and ultimately given permission to join a evacuation march with other Welsh survivors who left Pengwern, and headed on that evacuation march for \"the hills\". On those \"hills\", Heledd and the other survivors would establish a temporary refugee camp, before settling elsewhere. Obviously from memory of the horrific experience, Heledd (which as mentioned earlier is not her real name) used a pseudonym \"Heledd\" (which means \"salt pit\" or \"salt pool\" in the Old Welsh language, she spoke and wrote in, so this is obvious that Heledd is not her real name) and chose this as her pseudonym when she wrote a poetic memoir titled \"Canu Heledd\". Presumably, she chose that pseudonym and decided to write the memoir as a way to cope with the grief and shock of atrocities and wartime trauma of seeing the atrocities placed upon innocent Welsh civilians, by the very cruel English Mercian officers. == Memoir and theories == Heledd's memoir, Canu Heledd, was unfortunately not known to be first published (or widely known) for several centuries. Copies of the poetic memoir was ultimately rediscovered and published in 1410, more than five and a half centuries later, in Middle Welsh, and not Old Welsh, the dialect of the language which Heledd and the Welsh would have spoken and written at the time, because Old Welsh was long extinct by 1410 and would have transformed into Middle Welsh. When the poetic memoir, Canu Heledd, was first published in 1410, the book publishers (of the time) would have translated the dialect of Heledd's memoir, into something more \"modern\", and not extinct, and it is unknown where those publishers would have gotten a copy of Heledd's memoir, which would have been made before 1410. Heledd originally wrote her memoir in Old Welsh, but obviously her memoir was never known to be published in this dialect. Historian Jenny Rowland suggests that Heledd's memoir, Canu Heledd, was first published around AD 800 to 900 in the Old Welsh language, and not around 1410 in the Middle Welsh language, but that the copies from this period, were lost and gone missing due to the fact that a lot of books, written several centuries ago had gone missing. This is just a theory since no copies or probably even mention of Heledd's memoir were found before 1410, so this can obviously not be proven. The original manuscript in which Heledd would have written her memoir, around 655 AD, is obviously also lost and can not be found, along with \"supposed unconfirmed Old Welsh-language copies of Heledd's memoir made around AD 800 to 900\". Copies of Heledd's memoir, which were edited and published between 1410 and the modern 21st century, are the only surviving copies of Heledd's memoir. Category:7th-century births Category:Welsh writers Category:Princes and princesses",
 "title": "Princess Heledd of Powys"
}