{
 "id": "1138230",
 "text": "Alireza Jahanbakhsh is an Iranian soccer player who plays for the Iranian national team. He is known for being a good attacker. In 2014, he was named one of the best young players in a Dutch league. In 2018, he became the first Asian player to be the top scorer in a major European league. Jahanbakhsh has played for Iran in many international tournaments, including the World Cup and the Asian Cup. == Club career == === Damash === Alireza Jahanbakhsh spent most of his youth playing in Rasht and Persian Qazvin before joining the Damash Tehran youth academy in 2008. He began his career with Damash Tehran in the second division, which was linked to Damash Gilan. In 2011, at 17 years old, he returned to Gilan and made his debut for Damash Gilan in the Iran Pro League against Mes. On 15 January 2012, he scored his first goal in a 1–0 win over Fajr. Over 42 league matches with Damash, he scored 10 goals. === NEC === ==== 2013–14 Season ==== In 2013, Jahanbakhsh joined Dutch club NEC on a three-year deal after a medical and visa clearance. He debuted on 3 August 2013 against Groningen and scored his first goal in an 8–0 win in the KNVB Cup. On 1 December 2013, he scored twice and assisted another goal in a 3–2 win over AZ Alkmaar. Jahanbakhsh's two late goals on the final day of the season helped NEC avoid automatic relegation. He was voted runner-up for Eredivisie's best young talent, behind Memphis Depay. ==== 2014–15 Season ==== In the 2014–15 season, Jahanbakhsh excelled in the Jupiler League, scoring goals, providing assists, and being named NEC’s Player of the Season. He scored 12 goals and provided 18 assists, helping NEC win promotion to Eredivisie. He was voted the league's best player. === AZ === ==== 2015–16 Season ==== In 2015, Jahanbakhsh signed a five-year deal with AZ Alkmaar. He made his Eredivisie debut on 12 September and scored his first goal for AZ against his former club, NEC, in January 2016. ==== 2016–17 Season ==== Jahanbakhsh switched his jersey number to 7 and performed well in the 2016–17 season. He scored his first European goal in a Europa League match against Lyon and was named the best winger of the season in the Dutch League. ==== 2017–18 Season ==== Jahanbakhsh had an outstanding 2017–18 season, scoring 21 goals and providing 12 assists, becoming the first Asian player to finish as the top scorer in a top European league. === Brighton & Hove Albion === ==== 2018–19 Season ==== In 2018, Jahanbakhsh joined Premier League club Brighton & Hove Albion for a record fee. He debuted on 11 August but struggled in his first season, failing to score or assist in 25 matches. ==== 2019–20 Season ==== Jahanbakhsh scored his first Brighton goal in December 2019 against Bournemouth. On 1 January 2020, he scored a stunning bicycle kick against Chelsea, which was voted Premier League Goal of the Month. ==== 2020–21 Season ==== Jahanbakhsh scored two goals in the EFL Cup and played a key role in Brighton's comeback 3–2 victory over Manchester City in May 2021. === Feyenoord === In July 2021, Jahanbakhsh joined Feyenoord on a three-year deal. He debuted on 29 July in a UEFA Europa Conference League match and scored his first two goals for the club on 12 August in a win over FC Luzern. === SC Heerenveen === On 6 November 2024, Jahanbakhsh signed with Dutch Eredivisie club SC Heerenveen until the end of the season. ==References== ==Other websites== * *Alireza Jahanbakhsh at PersianLeague.com *Voetbal International profile *Alireza Jahanbakhsh at Iran Brands Review Category:1993 births Category:Living people Category:Brighton & Hove Albion F.C. players Category:Persian Gulf Pro League players Category:Premier League players Category:2014 FIFA World Cup players Category:2018 FIFA World Cup players Category:2019 AFC Asian Cup players Category:2022 FIFA World Cup players",
 "title": "Alireza Jahanbakhsh"
}