{
 "id": "1138224",
 "text": "Transformers One is a 2024 sci-fi action movie that was released in theatres on September 20, 2024. It is the first 3D computer-animated movie in the Transformers franchise, and is a prequel that shows how Optimus Prime and Megatron went from best friends to sworn enemies. The film stars Chris Hemsworth, Brian Tyree Henry, Scarlett Johansson, and Keegan-Michael Key as the four protagonists, along with other cast members such as Steve Buscemi, Laurence Fishburne, and Jon Hamm as supporting characters. ==Plot== The first Transformer, Primus, sacrificed his life to transform himself into the planet Cybertron. He created the Primes, a team of noble warriors that ruled the planet, and the Matrix of Leadership, which allowed energon (the planet's life source) to freely flow throughout the planet. However, a race of aliens known as the Quintessons would invade, killing all of the Primes except for Sentinel Prime and causing the Matrix of Leadership to be lost. The bots who live on Cybertron would hide away in an underground city called Iacon while Sentinel Prime searches across the surface to look for the Matrix and defeat the Quintessons. 50 cycles later, Orion Pax, a bot who cannot transform (bots need transformation cogs to transform, and only Sentinel Prime has one) and works as an energon miner, sneaks into an archive to watch a documentary on the Primes so he can learn the location of the Matrix of Leadership. Orion is caught by two guards, but after a chase, his best friend D-16 saves him by hiding him in a minecart. The two go to work at the mines, where they collect energon from underground, when a vein of unstable energon bursts. When evacuating, another miner (Jazz) gets trapped; Orion disobeys orders and goes back to rescue him, which accidentally ends up in a large amount of damage. Elita-1, the miners' boss, is blamed for the incident by Darkwing and is demoted to waste management duty. Later that day, Sentinel Prime announces that he still has not found the Matrix, but that a race would be held tomorrow. The next day, Orion leads D-16 into a secret spot above the starting line. D-16 thinks that they'll get to watch the race from there, but Orion puts jetpacks on D-16 and himself; he made a plan to enter the race to prove that miners are \"more than meets the eye\". They improvise during the race due to not being able to transform, and almost come in first. They are overtaken by every racer right before the finish line. After the race, Sentinel talks to Orion and D-16 saying he loved their stunt, promising that they will be rewarded due to mining production increasing because of it. When Sentinel leaves, Darkwing, angry that the two miners made him lose, traps the two in a garbage incineration room that is ten layers below how many the miners thought there were. They meet B-127, a bot who got the same punishment a long time ago. They find a hologram with the location of Alpha Trion, one of the Primes, in the trash that B-127 didn't scrap. The three escape through a trash chute and sneak onto the surface via a train. They encounter Elita-1 along the way, and persuade her to come with him. Eventually, the four find the cave that the Primes were killed in. They resurrect an offline Alpha Trion, who tells them the truth about Sentinel; he killed all of the Primes to try and get the Matrix of Leadership, which disappeared due to him not being worthy of using it. In addition, they witness Sentinel working with the Quintessons, who made a deal with Sentinel where he can rule Iacon in exchange for energon. The four feel betrayed, but D-16 is the most angry; he says that he wants to kill Sentinel for lying to everyone. Trion gives the Primes' transformation cogs to the four, allowing them to transform. Trion then tasks them with returning to Iacon with evidence of Sentinel's lies to reveal the truth to everyone. On their way back, the four are captured by a group of freedom fighters called the High Guard, lead by Starscream. D-16 beats up Starscream and takes control of the High Guard, with a cannon appearing on his right arm. Just as Orion becomes worried about D-16, Sentinel's forces find them all and capture most of them except for Orion and Elita. The evidence is destroyed in the attack, but a pep talk from Elita convinces Orion to rally the remaining members of the High Guard to keep going and attack Sentinel's forces. They return to Iacon, with Orion convincing his former co-workers to join the fight. After a long battle, they broadcast Arachnid's (Sentinel's second-in-command) memories of Sentinel's lies across the entire city. Despite this, D-16 still tries to kill Sentinel; Orion jumps in the way of D-16's cannon to save Sentinel from being shot. D-16 saves Orion from falling into the planet's core at first, but quickly lets him go. D-16 rips Sentinel in half and takes his transformation cog, renaming himself \"Megatron\". Meanwhile, the spirits of Alpha Trion (who was previously killed by Sentinel) and the Primes fix an unconscious Orion and give him both the Matrix of Leadership as well as the name \"Optimus Prime\". The rebuilt Transformer is blasted back up to the surface and fights Megatron. Optimus wins by slicing Megatron's cannon in half and banishes him and the High Guard from Iacon. Optimus later forms the Autobots and warns the Quintessons to stay away, while Megatron renames the High Guard to the Decepticons. ==Voice cast== ==References== == Other websites == * * Category:2024 animated movies Category:2024 action movies Category:2024 science fiction movies Category:2020s computer-animated movies Category:American animated movies Category:American adventure movies Category:American action movies Category:American science fiction movies Category:Paramount Pictures movies Category:Transformers (movie series) Category:Movies based on TV series",
 "title": "Transformers One"
}