{
 "id": "113808",
 "text": "Linux Mint is a Linux distribution for desktop computers based on and compatible with Debian and Ubuntu. While at the core Linux Mint is mostly based on Ubuntu, the design of the desktop and user interface are very different. These differences include a unique desktop theme, a custom Linux Mint menu and the MintTools, a collection of system tools designed to make managing the computer easier for users. == Releases == Originally, Linux Mint did not follow a predictable release cycle. The project first defined the goals for the next release, and when all the goals are achieved a beta version is released and a date is announced for the stable release. Recently however, it has been decided that Linux Mint will release with the 6 month Ubuntu release cycle. Version Code name Release date Support status 1.0 beta Ada 2006-08-27 Obsolete since April 2008. Linux Mint Web site, download page linking to all Linux Mint versions, page updated as new versions are released Unstable. 2.0 Barbara 2006-11-13 Obsolete since April 2008. 2.1 Bea 2006-12-20 Obsolete since April 2008. 2.2 Bianca 2007-02-20 Obsolete since April 2008. 3.0 Cassandra 2007-05-30 Obsolete since October 2008. 3.1 Celena 2007-09-24 Obsolete since October 2008. 4.0 Daryna 2007-10-15 Obsolete since April 2009. 5 LTS Elyssa 2008-06-08 Long-term support release (LTS), obsolete since April 2011. 6 Felicia 2008-12-15 Obsolete since April 2010. 7 Gloria 2009-05-26 Obsolete since October 2010. 8 Helena 2009-11-29 Obsolete since April 2011. 9 LTS Isadora 2010-05-18 Long-term support release (LTS), obsolete since April 2013. 10 Julia 2010-11-12 Obsolete since April 2012. 11 Katya 2011-05-26 Obsolete since October 2012. 12 Lisa 2011-11-26 Obsolete since April 2013. 13 LTS Maya 2012-05-23 Long-term support release (LTS), obsolete since April 2017. 14 Nadia 2012-11-20 Obsolete since May 2014. 15 Olivia 2013-05-29 Obsolete since January 2014. 16 Petra 2013-11-30 Obsolete since July 2014. 17 LTS Qiana 2014-05-31 v2 \"respin\" 2014-06-29 Long-term support release (LTS), obsolete since April 2019. 17.1 LTS Rebecca 2014-11-29 First of 17.x series of releases, Long-term support release (LTS), obsolete since April 2019. 17.2 LTS Rafaela end of May 2015 Second of 17.x series of releases, Long-term support release (LTS), obsolete since April 2019. 17.3 LTS Rosa 2015-12-04 Third of 17.x series of releases, Long-term support release (LTS), obsolete since April 2019. 18 LTS Sarah 2016-06-30 Long-term support release (LTS), obsolete since April 2021. 19 LTS Tara 2018-06-29 Long-term support release (LTS), obsolete since April 2023. 19.1 LTS Tessa 2018-12-19 19.2 LTS Tina 2019-08-02 19.3 LTS Tricia 2019-12-18 20 LTS Ulyana 2020-06-27 Long-term support release (LTS), supported until 2025. 20.1 Ulyssa 2021-01-08 20.2 Uma 2021-07-08 20.3 Una 2022-01-07 21 LTS Vanessa 2022-07-31 Long-term support release (LTS), supported until 2027. 21.1 LTS Vera 2022-12-20 21.2 LTS Victoria 2023-07-16 21.3 LTS Virginia 2024-01-12 22 LTS Wilma 2024-07-25 Long-term support release (LTS), supported until 2029. 22.1 LTS Xia 2025-01-16 == Comparison with Ubuntu == Linux Mint is based on Ubuntu and both distributions have a lot in common. Both distributions use the same software repositories. For instance, release 2.2 (“Bianca”) uses the package pools of Ubuntu “Edgy Eft” (6.10). Most packages are the same on both distributions and the two systems behave almost identically. Most differences are on the desktop. Ubuntu and Linux Mint both focus on usability, but Linux Mint offers a different user experience, and it includes a number of applications that are not available in Ubuntu (see aforementioned Mint Tools). Many popular multimedia codecs are installed by default in Linux Mint. Ubuntu, and many other gratis GNU/Linux distributions, do not distribute these codecs with the initial install media due to patent encumberment issues. Ubuntu has a vastly larger support community than Linux Mint. However, the majority of Ubuntu help and advice is also applicable to Linux Mint. Ubuntu supports more languages from the Live CD, and comes with better localization. == Linux Mint Debian Edition (LMDE) == Linux Mint Debian Edition, also known as LMDE, is a version of Linux Mint that is based on Debian. The reason it is developed is to make sure Linux Mint gives the same experience if Ubuntu disappears. It also helps test software made by Mint's developers to make sure they are compatible outside of Ubuntu. LMDE is designed to look and have the same experience as the normal versions of Linux Mint, without Ubuntu, with packages being provided by Debian instead. ==Related pages== * Linux * Debian * Ubuntu * Getdeb * Super OS (formerly: Super Ubuntu) == References == == Other websites == * Official Linux Mint Web Site * Official Linux Mint Wiki * Official Linux Mint Blog * Official Linux Mint Forum * Linux Mint on Distrowatch Category:Ubuntu (operating system) derivatives",
 "title": "Linux Mint"
}