{
 "id": "113841",
 "text": "Gary Edward Smith (born February 4, 1944) is a Canadian retired professional ice hockey goaltender, was born in Ottawa, Ontario. Gary is a son of Des Smith and brother of Brian Smith, both former National Hockey League (NHL) players. Gary played for numerous clubs, including the Chicago Black Hawks, Oakland Seals, Toronto Maple Leafs, Vancouver Canucks, Washington Capitals and Winnipeg Jets. He was the co-winner of the Vezina Trophy in the 1971–72 NHL season. ==Playing career== Gary Smith won a Memorial Cup with the junior Toronto Marlboros in 1964. Entering the NHL with the Toronto Maple Leafs in 1965, and was one of five goalies who played for the Maple Leafs during the 1966–67 regular season, their last Stanley Cup season.[Cox] He eventually earned the nickname \"Suitcase\" Smith because of the large number of teams he played for. After playing with the not very good California Golden Seals from 1967 to 1971, where he set records in 1970–71 for both the most games played in a single season and most losses in a single season, his first success was sharing the 1971–72 Vezina Trophy with Tony Esposito while with the Chicago Black Hawks. One year later, Smith and Esposito would help the Black Hawks to the Stanley Cup final. In 1974–75, he also had a good season with the Vancouver Canucks, with 72 games played and six shutouts. Smith later played in the World Hockey Association, and was a teammate of Wayne Gretzky while playing for the Indianapolis Racers.[Cox], pg. 79 He would be part of the Winnipeg Jets' 1979 Avco World Trophy championship. Gary Smith’s last coach in Winnipeg was Tom McVie, who coached Smith the previous season while both were with the Washington Capitals.[Willes], pg.240 The Jets played the Edmonton Oilers, led by Wayne Gretzky. When Wayne Gretzky went to his first game at Maple Leaf Gardens, Gary Smith was one of the goalies in the game.[Willes], pg. 241 The Maple Leafs played the California Seals and Smith was the Seals' goalie. Gary Smith gave up the last goal in WHA history to Dave Semenko. ===Career statistics=== Season Team League GP W L T MIN GA SO GAA SV% 1965–66 Toronto Maple Leafs NHL 3 0 2 0 118 7 0 3.56 .899 1966–67 Toronto Maple Leafs NHL 2 0 2 0 115 7 0 3.65 .892 1967–68 Oakland Seals NHL 21 2 13 4 1129 60 1 3.19 .907 1968–69 Oakland Seals NHL 54 21 24 7 2993 148 4 2.97 .905 1969–70 Oakland Seals NHL 65 19 34 12 3762 195 2 3.11 .913 1970–71 California Golden Seals NHL 71 19 48 4 3975 256 2 3.86 .885 1971–72 Chicago Black Hawks NHL 28 14 5 6 1540 62 5 2.42 .911 1972–73 Chicago Black Hawks NHL 23 10 10 2 1340 79 0 3.54 .887 1973–74 Vancouver Canucks NHL 66 20 33 8 3632 208 3 3.44 .894 1974–75 Vancouver Canucks NHL 72 32 24 9 3823 197 6 3.09 .895 1975–76 Vancouver Canucks NHL 51 20 24 6 2864 167 2 3.51 .882 1976–77 Minnesota North Stars NHL 36 10 17 8 2090 139 1 3.99 .881 1977–78 Minnesota North Stars NHL 3 0 2 1 180 9 0 3.00 .867 1977–78 Washington Capitals NHL 17 2 12 3 980 68 2 4.16 .907 1978–79 Indianapolis Racers WHA 11 0 10 1 664 61 0 5.51 .848 1978–79 Winnipeg Jets WHA 11 7 3 0 626 31 0 2.97 .889 1979–80 Winnipeg Jets NHL 20 4 11 4 1073 73 0 4.08 .873 ==References== * * * Category:1944 births Category:Canadian ice hockey goaltenders Category:Chicago Blackhawks players Category:Ice hockey people from Ottawa Category:Living people Category:Minnesota North Stars players Category:Oakland Seals players Category:Toronto Maple Leafs players Category:Vancouver Canucks players Category:Washington Capitals players Category:World Hockey Association players",
 "title": "Gary Smith"
}