{
 "id": "1138889",
 "text": "The Kobe child murders happened on March 16 and May 27, 1997 in Suma, Kobe, Japan. Shinichiro Azuma would murder two children Ayaka Yamashita (10), and Jun Hase (11). He would also attack two other girls with a hammer. He was known by his alias \"Seito Sakakibara\" and as \"Boy A\" by police and media because he was underage when he had committed the murders. This case, along with the Sasebo slashing, would cause the Diet of Japan to lower the age where people are responsible for criminal acts from 16 to 14 in 2000. ==Events== He would torture animals such as cats, slugs, and birds when he was younger but he would grow tired of this and decided to move on to humans. On 10 February 1997, Sakakibara would be walking through Kobe and come across two girls. He would end up attacking the two with a hammer while they ran away. They would survive the attack. On March 16, he would be walking through a park in Kobe when he came across a 10-year-old girl named Ayaka Yamashita. He would ask her if she knew a place where he could wash his hands and she took him to a school. He would ask her to turn around and then he would end up attacking her with a hammer before running away. Ayaka would be very injured in the attack and would end up dying in the hospital. Sakakibara would admit to the murder in his diary. On May 25, Sakakibara would run into an 11-year-old boy named Jun Hase. Hase knew Sakakibara because he was a friend of his brother. He would ask Hase if he wanted to see a turtle and would lead him up to a shack in a secluded area of a trail. At the shack, Sakakibara would end up strangling Hase to death with a shoelace and hid his body under the shack. He left and came back with a hand saw and garbage bag. He would cut off his head, took the head back home and then put it in front of the main gates to the Tomogaoka Junior High School. On the morning of May 27, Base's head and the bodies of two cats were found. In his mouth, Sakakibara placed a note which said it was the \"beginning of a game\" and that he felt a thrill killing people. On the note was broken English and cryptic symbols which seemed to have been inspired by the Zodiac Killer. == Arrest and aftermath == On June 28, Sakakibara would be arrested by police. He was a minor at the time of the crimes so he was referred to as \"Boy A\". His name would eventually be leaked to reporters and public. Police had suspected Sakakibara because of his connection to animal cruelty and because he had known Hase before the murder. His lawyers tried to argue that he was too illiterate to write the complex words in the notes that were found and that he was also right-handed while the person who committed the murders was left-handed. He would admit to his crimes when his mother visited and asked him if he did it.一橋文哉 『未解決 —封印された五つの捜査報告—』 新潮文庫、2011年11月1日。. p.378 He was sentenced to six and two-thirds years in the Kanto Medical Juvenile Training School. In March 2003, he would be paroled. This caused anger from the victim's families. On March 11, 2004, he was released. This would further anger the families of the victims and public. This also came shortly after another event called the Sasebo slashing. Sakakibara would release in autobiography titled Zekka. In the book, he would say that he had felt bad about what he had done and described the murder in detail. Hase's family would try to block the release of the book because they didn't want him profiting from the murders but it released anyways. Zekka would become a number-one best seller in Japan. Sakakibara would later set up a website where he posted updates about his life and drawings he made including a photoshop of his naked body fused with a scorpion. In response to this, Shūkan Post would publicate Sakakibara's real name, location and job at the time. ==References== Category:1997 Category:1990s crimes in Asia Category:Events in Japan Category:Kobe Category:Murder in Asia Category:Murder in the 1990s",
 "title": "Kobe child murders"
}