{
 "id": "1138340",
 "text": "Heaven Is a Place on Earth is a song by American singer Belinda Carlisle from her second studio album, Heaven on Earth (1987). Written by Rick Nowels and Ellen Shipley, the song was released as the lead single from the album on September 14, 1987. It became Carlisle's most successful single, reaching number one on both the Billboard Hot 100 chart in the United States and the UK Singles Chart. == Background and release == \"Heaven Is a Place on Earth\" was written by Rick Nowels and Ellen Shipley. It was released on September 14, 1987, as the lead single from Belinda Carlisle's second studio album, Heaven on Earth. The song became her signature hit and the most successful single of her career. == Critical reception == The song received positive reviews from critics, with particular praise for its powerful chorus and uplifting lyrics. In 1988, the song was nominated for the Grammy Award for Best Female Pop Vocal Performance, but it lost to Whitney Houston's \"I Wanna Dance with Somebody (Who Loves Me)\". In 2017, ShortList named the key change in \"Heaven Is a Place on Earth\" as one of \"the greatest key changes in music history\". == Commercial performance == In the United States, \"Heaven Is a Place on Earth\" reached number one on the Billboard Hot 100 on December 5, 1987, becoming Carlisle's only number-one hit on the chart. The song also reached number one in the United Kingdom, where it topped the UK Singles Chart for two weeks in January 1988. In Australia, it peaked at number two. == Music video == The music video for \"Heaven Is a Place on Earth\" was directed by Diane Keaton and features imagery of planets, children, and Carlisle singing on a carousel. The video contributed to the song's popularity and received heavy rotation on MTV. == 2015 re-recording == In 2015, Carlisle re-recorded the song as an acoustic ballad, which was included on her 2017 album Wilder Shores. This album combined acoustic tracks with world beats and traditional Sikh chants. == Track listings == === 7-inch single === # \"Heaven Is a Place on Earth\" – 3:53 # \"We Can Change\" – 3:45 === 12-inch single === # \"Heaven Is a Place on Earth\" (12-inch version) – 5:59 # \"We Can Change\" – 3:45 # \"Heaven Is a Place on Earth\" (7-inch version) – 3:53 == References == == Other websites == * \"Heaven Is a Place on Earth\" music video on YouTube * AllMusic – \"Heaven Is a Place on Earth\" Category:1987 songs Category:Billboard Hot 100 number one songs",
 "title": "Heaven Is a Place on Earth"
}