{
 "id": "113854",
 "text": "The \"Te Deum\" is a Christian hymn. Its original text was in Latin. It is named after the first few words, \"Te Deum laudamus\" (We praise thee, O Lord). It was probably written around the 4th or 5th century. Most say that either Augustine of Hippo or Ambrose wrote it. Some say it was by Nicetas, bishop of Remesiana. Others have said that the hymn was taken from two (or more) earlier hymns: one to God the Father and another to God the Son. After this idea, the second hymn begins with the phrase \"Tu rex gloriae, Christe\". The petitions at the end of the hymn (beginning \"Salvum fac populum tuum\") are from verses from the book of Psalms, added to the original hymn later on. Te Deum is close in theology to the Apostles' Creed. It has both a poetic view of the heavenly liturgy with a declaration of faith. \"God\" is named from the start of the song. The hymn then names all people who praise and respect God, from the hierarchy of heavenly creatures, to Christians who are already in heaven, to the Church in all the world. Te Deum then returns to its creedal formula, singing about Christ and remembering His birth, suffering, and glorification. Then the hymn stops singing about praise, both the Church in general and the singer himself, and asks for mercy on past sins, protection from future sin, and the hope to be reunited with Christians in Heaven. == Music == Many people have written music for the text, including Anton Bruckner, Giuseppe Verdi, Hector Berlioz, Antonín Dvořák, Joseph Haydn, Benjamin Britten, and Wolfgang Amadeus Mozart, just naming a few. Antonio Vivaldi wrote a setting of the Te Deum (RV 622), but it is now lost. The prelude to Charpentier's setting (H.146 in Hugh Wiley Hitchcock's catalogue) is well known in Europe because it is used as the theme music for the European Broadcasting Union, most notably the Eurovision Song Contest. Sir William Walton's Coronation Te Deum was written for the coronation of HM Queen Elizabeth II in 1952. Other English Te Deums have been written, such as the ones by William Byrd, Thomas Tallis, Henry Purcell, three by George Frideric Handel (Utrecht Te Deum, Dettingen Te Deum and Queen's Te Deum) and that of Edward Elgar, his Op. 34. A version by Father Michael Keating is popular with Charismatics. Mark Hayes recently wrote his own version of Te Deum, and British composer John Rutter has composed two, one of them is just titled the traditional \"Te Deum,\" the other \"Winchester Te Deum.\" Igor Stravinsky set the first 12 lines of the text as part of The Flood in 1962. == Latin and English Text == Latin text English translation of the Book of Common Prayer (1662) :Te Deum laudamus: :te Dominum confitemur. :Te aeternum Patrem :omnis terra veneratur. :Tibi omnes Angeli; :tibi caeli et universae Potestates; :Tibi Cherubim et Seraphim :incessabili voce proclamant: :Sanctus, Sanctus, Sanctus, Dominus :Deus Sabaoth. :Pleni sunt caeli et terra :maiestatis gloriae tuae. :Te gloriosus Apostolorum chorus, :Te Prophetarum laudabilis numerus, :Te Martyrum candidatus laudat exercitus. :Te per orbem terrarum :sancta confitetur Ecclesia, :Patrem immensae maiestatis: :Venerandum tuum verum et unicum Filium; :Sanctum quoque Paraclitum Spiritum. : :Tu Rex gloriae, Christe. :Tu Patris sempiternus es Filius. :Tu ad liberandum suscepturus hominem, :non horruisti Virginis uterum. :Tu, devicto mortis aculeo, aperuisti :credentibus regna caelorum. :Tu ad dexteram Dei sedes, in gloria Patris. :Iudex crederis esse venturus. :Te ergo quaesumus, tuis famulis subveni: :quos pretioso sanguine redemisti. :Aeterna fac cum sanctis tuis in gloria numerari. : :Salvum fac populum tuum, :Domine, et benedic hereditati tuae. :Et rege eos, et extolle illos usque in aeternum. :Per singulos dies benedicimus te; :Et laudamus Nomen tuum in saeculum, et in saeculum saeculi. :Dignare, Domine, die isto sine peccato nos custodire. :Miserere nostri domine, miserere nostri. :Fiat misericordia tua, :Domine, super nos, quemadmodum speravimus in te. :In te, Domine, speravi: :non confundar in aeternum. :We praise thee, O God :we acknowledge thee to be the Lord :All the earth doth worship thee :the Father everlasting. :To thee all angels cry aloud :the heavens and all the powers therein. :To thee cherubim and seraphim continually do cry :Holy, Holy, Holy, :Lord God of Sabaoth; heaven and earth :are full of the majesty of thy glory. :The glorious company of the apostles praise thee. :The goodly fellowship of the prophets praise thee. :The noble army of martyrs praise thee. :The Holy Church :throughout all the world doth acknowledge thee; :the father of an infinite majesty; :thine honourable true and only Son; :also the Holy Ghost the comforter. : :Thou art the King of Glory, O Christ. :Thou art the everlasting Son of the Father. :When thou tookest upon thee to deliver man, :thou didst not abhor the Virgin's womb. :When thou hadst overcome the sharpness of death, :thou didst open the kingdom of heaven to all believers. :Thou sittest at the right hand of God in the glory of the Father. :We believe that Thou shalt come to be our Judge. :We therefore pray thee, help thy servants, :whom thou hast redeemed with thy precious blood. :Make them to be numbered with thy saints in glory everlasting : :O Lord save thy people :and bless thine heritage. :Govern them and lift them up for ever. :Day by day we magnify thee; :and we worship thy name, ever world without end. :Vouchsafe, O Lord to keep us this day without sin. :O Lord, have mercy upon us, have mercy upon us. :O Lord, let thy mercy lighten upon us, as our trust is in thee. :O Lord in thee have I trusted let me never be confounded. Category:Christian hymns Category:Christian prayers",
 "title": "Te Deum"
}