{
 "id": "1138933",
 "text": "The Meitei people (), also called Manipuri people (), is one of the minority ethnic groups in Nagaland state. They are living in the region before the formation of the Indian state of \"Nagaland\". == History == After losing Meitei influence in the Naga hills for some time due to the Manipuri-Burmese military conflicts, Meitei King Raja Gambhir Singh (), also known as Chinglen Nongdrenkhomba (), the ruler of Manipur Kingdom conquered the whole Naga Hills with his military power of Manipur Levy. He defeated the Angami Naga tribes of Kohima. To mark his victory over the Naga people, the historic Kohima Stone Inscription () was erected in 1833 CE as a mark of Meitei conquest and supremacy over the Naga Hills in 1832 CE. In 1896 CE, James Johnstone noted in his documents that the Meiteis (alias Manipuris) were highly respected and warmly welcomed as special and honoured guests by the Naga people in almost every village, during the time when Britishers couldn't go inside the Naga realm without having the risk of being killed. He also noted that the Meiteis (Manipuris) used to collect tributes from the Naga villages, as a mark of rule over them. In case if a Meitei was attacked or killed by the Nagas, the particular village was immediately attacked and destroyed, besides taking huge taxes for the deed. Many Naga people knew the Meitei language (alias Manipuri language). The Naga villages had both Meitei language as well as their local language names. == Geographical distribution == Meitei people live in Phom Colony, Y Zhimo Colony, Matha Colony, West Yard Manipuri Colony, Manipuri Colony near Samaan Ghat, Half Nagarjan, Burma Camp, and Ghorapatti villages in Dimapur district of Nagaland. == Language and literature == Historically, most Naga villages had names in both Meitei language (alias Manipuri language) as well as their local languages. Many Naga people knew the Meitei language. Nagaland's St Joseph University annually organises \"Manipuri poetry day\" on full-moon day of the lunar month 'Mera' according to the Meitei calendar. The event helps in the development of Meitei language poems, promoting Meitei literature, to a certain extent. == Culture == === Clothing === The Meitei people of Nagaland produced a unique \"Meetei waistcoat\" () for showing the Meitei ethnic identity, among the rest of the people of the state, in 2022. It was led by the Dimapur Meetei Council. == Notable people == In the High School Leaving Certificate (HSLC) Examination, 2022 conducted by Nagaland Board of School Education, a Meitei girl named Delphi Oinam () became the topper of the entire Nagaland, by getting 595 marks out of the total of 600, which is 99.17 percent. She was a student of Don Bosco Higher Secondary School, Dimapur. == Bad treatments == === Negligence by the government === Meitei people have no land ownership rights. They also face difficulty in getting documents such as OBC, PRC and domicile certificates. They cannot get state government jobs except for driver and technical posts. They have no alternative except private jobs or doing businesses for their living. === Banning of Meitei owned vehicles === In 2016, there were incidents of banning transportation of vehicles owned by Meiteis (Manipuris) in Nagaland. Regarding this issue, the Manipur State Police DGP talked to the Nagaland State Police DGP to look into the matter. The latter assured that he would take care of it. == Associations and organizations == * Dimapur Meetei Council * Dimapur Meitei Union == Related pages == * Meitei people in Assam * Meitei people in Bangladesh * Meitei people in Meghalaya * Meitei people in Myanmar * Meitei people in Tripura == References == == Other websites == Category:Meitei people Category:Nagaland Category:History of India Category:Ethnic groups in India Category:Discrimination",
 "title": "Meitei people in Nagaland"
}