{
 "id": "1138532",
 "text": "Philip Richard Gries (born February 2, 1943) is an American cinematographer known for his work on over one thousand union (IATSE Local 600) and non-union projects, including documentaries, commercials, advertising, and adult films. His work spans over four decades including the Emmy Award-winning documentary Vermeer: Master of Light (2001), the PBS Frontline documentary 88 Seconds in Greensboro (1983), the PBS series The World of Ideas with Bill Moyers (1988), and the 13-part documentary series Mafia's Greatest Hits (2012). ==Early life and education== Gries was born in Jewish Hospital in Brooklyn, New York, to Nathan Gries (b. 1902) and Lillian K. Gries (b. 1905). Gries earned a bachelor's degree in film production from the City College of New York and a master's degree in fine arts in Film and Television from the University of California, Los Angeles (UCLA). == Career == Gries' photographed 183 documentary productions over a period of twenty years with the British Broadcasting Corporation. He has worked on documentary projects for PBS, including \"The World of Ideas with Bill Moyers,\" \"Frontline,\" and \"American Masters.\" Gries is the founder and owner of Archival Television Audio, Inc., which was accredited by Guinness World Records in 2002 for approaching 1 million visitors. Gries has appeared over 35 times on TV CONFIDENTIAL. ==Selected filmography== * Vermeer: Master of Light (2001) * Ginevra’s Story * The World of Ideas with Bill Moyers (series) * The Story of English with Robert MacNeil (pilot) * Biography * 20/20 * Mister Abbott’s Broadway * Showboat Story * Television Makers * Oscars (series) * Carols for Christmas * Britain at War * The Search for Mind * Bogart: The Untold Story * The Survivors of the Shoah (Claude Lanzmann interviews for PBS) * American Masters (including Maurice Sendak: Mon Cher Papa and Placido Domingo: A Musical Life) * Frontline (including \"Secret File\" and \"88 Seconds in Greensboro\") ==References== == Other websites == Category:1943 births Category:American cinematographers Category:American television directors",
 "title": "Philip Richard Gries"
}