{
 "id": "1138098",
 "text": "On 17 September 2024, gunmen attacked several locations across Bamako. Bamako is the capital of Mali. The locations included police stations and military installations. At least 77 people were killed and more than 255 others were injured. The Jama'at Nusrat al-Islam wal Muslimin (JNIM), an Islamist militant group affiliated with al-Qaeda, claimed responsibility. == Background == Mali has been in a state of conflict since 2012. Diffent groups fight for control and influence. Some of these groups are linked to Al-Qaeda or the Islamic State. Others are Tuareg rebels, or self-declared defence forces. Still others are simple bandits. In an effort to resolve the situation, the Malian Armed Forces ousted the civilian government in a 2020 coup and resorted to allowing Russian mercenaries, after expelling French forces. Bamako itself had largely been unaffected by the fighting,. The last related incident had been an attack on the Radisson Blu hotel in 2015 that killed 20 people. == Attacks == The attacks began in the early morning of 17 September 2024 at around 05:00. Gunmen attacked several locations across Bamako including the Banankabougou neighbourhood, the Faladie military police school housing elite units of the Malian gendarmerie in the southeast of Bamako, and the nearby military airport, which the JNIM claimed to have fully taken. After the attacks, the Modibo Keita International Airport was closed. The civilian airport is right next to the military one. Clashes were also reported from a police station which contros access to one of the airports. The JNIM claimed to have destroyed six aircraft, including several fighter planes, and a drone, and opened fire at a drone platform and the presidential hangar of the military airport. An aircraft used for humanitarian work by the World Food Programme was also damaged on the ground, according to its owner, the South African–based National Airways Corporation, adding that its crew and staff were secured in a safe house. The attacks were also said to have set fire to several buildings and infrastructure. The attacks lasted for about nine hours before being finally put down by Malian government forces later in the day, with the Chief of General Staff of the Armed Forces, Major General Oumar Diarra visiting the Faladie school and stating that all the \"terrorists\" who attacked the facility had been \"neutralised\". == Casualties == No official numbers of casualties were released by authorities. As such, estimates of the casualties vary. The death toll is between 77 and more than 100. 255 others were injured. Among the dead were 50 military police students who were buried on 19 September. At least 20 militants were captured, while the JNIM acknowledged the loss of a few dozen of its fighters while inflicting \"hundreds\" of casualties, including on members of the Wagner Group. One security person of the United Nations was also injured. In the aftermath of the attack, one person was set on fire by residents on suspicion of being a militant. == Reactions == Mali’s military government downplayed the incident with officials stating the situation was “under control” and the attack had been repelled. Officials later admitted the military had suffered casualties. The attacks were condemned by many countries and organisations including the United Nations, the African Union, ECOWAS, Senegal, France and the United Kingdom. The World Food Programme said the loss of one of its aircraft at Bamako Airport \"reduces our humanitarian response capacity\", noting that the plane was used to \"transport aid workers and provide emergency humanitarian aid in remote areas of Mali\". The freedom of expression in Mali is severely limited. For this reason, there were only very few critical reactions from Mali itself. A few media outlets such as the Senegalese newspaper Nouvel Horizon, wrote that it was \"time to apportion blame at all levels\". On 19 September, Abdoulaye Coulibaly, the governor of Bamako, ordered the indefinite closure of seven livestock markets in the city for \"reasons of public order\", raising concerns that it was being used to target members of the Fulani ethnic group, who run most of the markets and are accused of supporting Islamist militants due to high membership rates in the said groups. On 24 September, Mali's military leader Assimi Goïta held a meeting with the country's defence establishment. The idea was to review security arrangements and \"adjust strategy\". Goita also paid tribute to the victims of the attack, adding that it showed \"the imperative need to remain vigilant and maintain an exemplary operational stance in all circumstances\". Jean-Herve Jezequel, Sahel project director at the International Crisis Group, said that one possible reason for the attack could be that \"the jihadists are trying to send a message to the Malian authorities that they can hit them anywhere and therefore that the big cities must also be protected\". He said the militants may want to force Mali to concentrate its resources in areas where more people live and deploy fewer troops in rural areas where the jihadists have their strongholds. == References == Category:Pages with unreviewed translations Category:2020s murders in Africa Category:Mass murder in 2024 Category:2020s mass shootings in Africa Category:2024 in Africa Category:2020s in Mali Category:Bamako Category:Islamic terrorist incidents in Africa Category:Islamic terrorist incidents in the 2020s Category:September 2024 events",
 "title": "2024 Bamako attacks"
}