{
 "id": "1138514",
 "text": "Saliha Canfeda Hatun (; \"the devoted one\" and \"soul\"; died ) was a lady-in- waiting to Nurbanu Sultan and Sultan Murad III of the Ottoman Empire. == Career == Canfeda Hatun was an ally of Nurbanu Sultan. Nurbanu Sultan brought her from the Old Palace. She was employed as a housekeeper for the concubines of the Imperial Harem and she was also known as (kedbanu-yi-harem and Kethüda Hatun and Kahya Kadin). And under Nurbanu she trained the concubines of the Imperial Harem. She was also an ally of Gazanfer Agha. Gazanfer Agha was the Agha of the Imperial Harem. She was also an ally of Lala Mustafa Pasha. Lala Mustafa Pasha was a rival of the Grand Vizier, Sokollu Mehmed Pasha. On her deathbed in 1583, Nurbanu tried to keep Canfeda as the head of the Imperial Harem. And so, after Nurbanu died, Canfeda took charge of the Imperial Harem. During the reign of Murad III, Canfeda, along with the financial concubine Raziye Hatun, the poet Hubbi Hatun, and other musahibs (beloveds) seem to have been very powerful and influential. She was able to gain the trust of her opponents, and even had a great deal of influence in palace matters to protect them. The women of the dynasty were paid large bribes to establish close relationships with her. She amassed extraordinary wealth and as a result, she became part of the high administration and the enemy of the commandant of the Janissary corps. In 1593, the Janissaries revolted due to delayed payment of their salaries. The disgruntled soldiers demanded the beheading of the Grand Vizier, the Chief Defterder, and the Canfeder. Through great effort, Murad was able to pacify the rebels and save their lives. == Charities == Canfeda used part of his wealth to establish his charitable foundation. She built a mosque and a fountain in Istanbul. In 1584, the mosque was built at an estimated cost of two million espers, which also housed a primary school, a public drinking fountain and a water pump. In 1593, Canfeda also built another mosque and a public bathhouse in the village of Beykoz. She also received permission from Sultan Murad to repair and expand an aqueduct built by Sultan Bayezid II. At the time of his retirement, Canfeda's stipend was 100 esper per day, but it was doubled as she wanted to work for the public. Her mosques were built after Nurbanu's death. == Personal Life == Canfeda Hatun was of Circassian origin. She had two brothers, Mahmud Pasha, who was Beylerbey of Haleb in 1594, and Divan Ibrahim Pasha. She always protected her brothers. They had come to Constantinople as slaves from the slave trade in Crimea.Inventory of Ottoman Turkish documents about Waqf preserved in the Oriental Department at the St. St. Cyril and Methodius National Library / ed. Evg Radushev, Svetlana Ivanova, Rumen Kovachev. — Narodna biblioteka Sv. sv. Kiril i Metodiĭ, 2003. — P. 115—116, 217—218. — 350 p. When Canfeda lost her power, her two brothers died. Canfeda had a garden in Findikli. == Last years and death == After Murad's death in 1595, Canfeda and all the rest of Murad's harem women were sent to the old palace. The new sultan Mehmed III dismissed her from her position, after which she borrowed food from the Venetians to procure goods for the harem. She was not on the new sultan's side because he decided to protect Sultan Murad's second son, Prince Mustafa, but when Mehmed ascended the throne, Mustafa and his 18 brothers were killed. She died in 1600. == In popular culture == In the 2011-2014 TV series Muhteşem Yüzyil, Canfeda Hatun is portrayed by Turkish actress Kubra Kıp. ==References== ==Sources== * * * * * * * * * * Category:1600 deaths Category:Slavery in the Ottoman Empire Category:Slaves Category:Ottoman people",
 "title": "Canfeda Hatun"
}