{
 "id": "1138301",
 "text": "α-Ketoglutaric acid is a dicarboxylic acid involved in several important biological processes. (Dicarboxylic acid have two carboxyl groups, instead of only one.) α-Ketoglutaric acid exists primarily as its conjugate base, α-ketoglutarate. α-Ketoglutaric acid is a dicarboxylic acid involved in several important biological processes. It exists primarily as its conjugate base, α-ketoglutarate, in physiological conditions, as it loses two protons to form this negatively charged molecule. Other names of the acid: The IUPAC name is, 2-oxopentanedioic acid. == Biological Role == α-Ketoglutarate is a key intermediate in the citric acid cycle (also known as the Krebs cycle or TCA cycle), which is critical for cellular energy production. It plays a central role in cellular respiration, providing cells with energy. Additionally, α-ketoglutarate is involved in amino acid metabolism, acting as a substrate or product in the synthesis of amino acids, and plays a role in regulating levels of carbon, nitrogen, and ammonia within cells. It is also essential for reducing reactive oxygen species (ROS) levels, protecting cells from oxidative damage. == Metabolic Functions == α-Ketoglutarate is also linked to other metabolic pathways, such as: * The synthesis of neurotransmitters, including gamma-aminobutyric acid (GABA). * Modulating immune function by supporting the differentiation of immature T cells into mature ones. * Regulating glucose tolerance and supporting muscle function, especially in response to resistance exercise. == Health Implications == Studies suggest α-ketoglutarate has a role in aging, cancer development, and the response to inflammation. It is also involved in regulating kidney function and may help in reducing muscle atrophy and obesity. == Chemical Properties == α-Ketoglutaric acid has the chemical formula CHO and a molar mass of 146.098 g/mol. It has a melting point of 115°C (239°F). The molecule contains two carboxylic acid groups and a ketone functional group, making it a versatile compound in both biological and chemical reactions. == Related pages == * Citric acid cycle * Amino acid metabolism * Reactive oxygen species == References == * Category:Biochemistry Category:Organic compounds",
 "title": "Α-Ketoglutaric acid"
}