{
 "id": "1138317",
 "text": "Childhood disintegrative disorder, also known as Heller's syndrome, disintegrative psychosis or dementia infantilis is a rare disorder where children—usually between the ages of 2 to 10—lose the skills that they previously learnt, such as speech, motor skills, social skills, etc. It is different from autism with regression because a child with CDD loses skills much later than a child with regressive autism would. It is also much more severe and obvious. == Symptoms == The main characteristic of Childhood disintegrative disorder is that a child loses skills they have already learnt. In 75% of cases, they have a 'prodrome.' This is anxiety and terror that comes before the regression, but it doesn't always happen. The most apparent symptom is that skills are lost. Symptoms and severity can vary from child to child, but some symptoms include: * Loss of speech (a child who could say a sentence may suddenly lose their speech, only saying parts of the words and sometimes losing speech altogether) * Loss of cognitive skills (a child who had good memory may forget things, or they may not be able to understand simple questions that were asked to them) * Loss of motor skills (a child may lose the ability to grasp things, perform certain movements or even walk) * Loss of social skills (a child may lose the ability to have a conversation or understand social cues, such as eye contact and responding to others appropriately) * Loss of bladder and bowel control (a child who was toilet- trained may suddenly have accidents) * Loss of play skills (a child may lose the ability to play with other children, use their imagination and pretend, or they may suddenly engage in repetitive play) * Loss of self-care skills (a child who could feed themself, bathe, or get dressed on their own may not be able to anymore—this might be because the child has forgot how to take care of themself, or they do not have the motor function to do so) Some other symptoms to note are: * Aggression (a child may start hitting, kicking, or biting themself or others) * Behaviour changes (a child may seem hyperactive or show unusual repetitive behaviours, such as rocking or flapping their hands, which is similar to autism) * Special interests (a child may show unusual special interests; they can focus on one topic for a long period of time, which is similar to autism) Children usually stop regressing around the age of 10. The symptoms of CDD may come abruptly (quickly) or gradually (over a long period of time). Not all children with CDD have the same symptoms. It can be mild or severe. A child who lost their ability to talk and take care of themselves, but still retained their bladder control and motor skills still meets the criteria for CDD. A child who lost all their skills—speech, play, etc—also meets the criteria for CDD. For a child to be diagnosed, they need to display 2 out of 6 symptoms. == Causes == Doctors do not know what causes CDD as a whole, but it is thought to be caused by: * Lipid Storage Diseases (where fats excessively build up in the brain and nervous system) * Panencephalitis (infection of the brain caused by measles; causes brain inflammation and nerve cell death) * Tuberous Sclerosis (where non-cancerous tumours grow in the brain) * Leukodystrophy (where myelin sheaths do not develop correctly, which causes white matter in the brain to not work properly) * Encephalitis (inflammation of the brain caused by viral or bacterial infection) * Genetics (there are many genes linked to autism, such as CHD8, ADNP, ANK2, CTNND2, etc.) It is linked to epilepsy, since patients with CDD have a higher chance of seizures, but doctors do not know if it has anything to do with the disorder as a whole. A child who has language regression and seizures would fit more with the criteria of Landau-Kleffner Syndrome. It is important to rule out any other disorders such as mercury poisoning, lead poisoning, hypothyroidism, brain tumours, HIV, childhood schizophrenia, etc. before diagnosing CDD. == Treatment == Children diagnosed with CDD have a treatment plan similar to children with autism. They might need speech therapy to help them communicate and occupational therapy to work on adaptive living skills. Sensory integration therapy—therapy that helps with sensory issues—may be used to stabilise the sensory systems. However, children with CDD exhibit a unique regression that is different from what doctors see in other developmental disorders. They may not respond well to therapy and it does not always guarantee that they will progress. Children with CDD often experience a severe loss of receptive and cognitive skills which may limit how they respond to therapy, if at all. In such a case, they might need to take medicine. Medicine such as Risperidone, Olanzapine, or Cerebrolysin may be used to help with aggression and mental decline, but it is highly experimental. IVIG and other neuroinflammatory medicines can help with neuroinflammation if it is present. Educating parents about CDD is also important; it's necessary to give parents counselling to help them navigate the disorder, since the diagnosis can be traumatic for both the child and parents involved. == Prognosis == The prognosis (outcome) for this disorder is not good. Children that have CDD will need special support all their lives. They can still go to school, but they may need a helper or have to go to a separate school for disabilities altogether. Adults with CDD will need support services such as carers. Life expectancy (how long someone lives) is normal. In 20% of cases, it is possible to regain speech, but very few children regain all their skills. == Related pages == * Autism spectrum * Pervasive developmental disorder not otherwise specified * Childhood schizophrenia == References == Category:Autism Category:Disability Category:Pervasive developmental disorders",
 "title": "Childhood disintegrative disorder"
}