{
 "id": "1138928",
 "text": "Vienne-le-Château () is a commune in the Marne department in north-eastern France. ==History== The village existed in the 6th century, when the Bishop of Verdun owned it. A castle stood on a hill in the west of the town. It was destroyed in 959 by Count Grandpre. It was rebuilt several times, and only ruins remain. In the 12th century, the area was purchased by Count of Bar. The village was destroyed during World War I. ==Culture and heritage== ===Church=== L'église Saint-Pierre-Saint-Paul is a church built during the 16th century. It was built in the style of a Latin cross. The choir and the crossing were repaired between 1680 and 1690. More work was done from 1740 to 1744 and 1785 to 1788 when the facade, pillars in the nave, vaults and steeple were changed. During World War I, the church was a first-aid station. It was badly damaged, with the northern transept destroyed and the steeple had collapsed. The church was repaired from 1925 and opened again for worship in 1930. It became a protected monument in 1922. ===Castle=== There was a castle here in the middle of the 11th century. It was owned by the Count of Grandpré, and in the 13th century by the Count of Bar. In the 14th century, it became the property of the king of France. It was destroyed in 1810. All that remains is the site with a moat and a motte and the courtyard. ===Places related to World War I=== Le Camp de la Vallée Moreau Around 3 km north of the town, is the site of a German Camp called the \"West Moreau Valley\". Soldiers were held in reserve there during World War One. It was occupied from February 1915 until September 1918. In 1997, work started to reconstruct the camp. La Nécropole Nationale de La Harazée This military cemetery was created in 1915 during the Battle of Argonne. It has bodies that were removed from two other cemeteries. It has become larger over the years, first in 1924 then again in 1935 and 1936. It has the graves of 1,672 French soldiers from World War One and one from World War Two. The last renovation of the site occurred in 1963. L'ossuaire de La Gruerie The ossuary houses the remains of around 10,000 unnamed soldiers. It was created in 1923. The site was officially opened on 7 July 1929. A stone wall, with the inscription Aux Morts de la Gruerie 1914-1918 stands over the ossuary. A niche in the wall holds a female statue with folded wings representing Victoria. With the face of Marianne and wearing a Phrygian cap, she holds the flame of remembrance in her right hand while her raised left arm and hand symbolise the collection of the dead. A basement lies below with a gallery with plaques to the dead. The statue is by Raoul Lamourdedieu. ==Gallery== File:Church - Vienne-le-Chateau.jpg| File:Camp de la Vallée Moreau2.jpg| ==Related pages== *Communes of the Marne department ==References== Category:Communes in Marne",
 "title": "Vienne-le-Château"
}