{
 "id": "113819",
 "text": "The World Hockey Association () was a professional ice hockey league that operated in North America from 1972 to 1979. It was the first major competition for the National Hockey League (NHL) since the end of the Western Hockey League after the 1925-26 WHL season. Although the WHA was not the first league since that time to attempt to challenge the NHL's hold as the top league, it was by far the most successful. ==Hockey Hall of Famers== List of WHA players and executives inducted into the Hockey Hall of Fame, for achievements in their hockey career. *Andy Bathgate, Vancouver Blazers *Gerry Cheevers, Cleveland Crusaders *Mike Gartner, Cincinnati Stingers *Michel Goulet, Birmingham Bulls *Wayne Gretzky, Indianapolis Racers, Edmonton Oilers *Gordie Howe, Houston Aeros, New England Whalers *Bobby Hull, Winnipeg Jets *Dave Keon, Minnesota Fighting Saints, Indianapolis Racers, New England Whalers *Rod Langway, Birmingham Bulls *Frank Mahovlich, Toronto Toros, Birmingham Bulls *Mark Messier, Cincinnati Stingers, Indianapolis Racers *Bernie Parent, Philadelphia Blazers *Jacques Plante, Edmonton Oilers *Bud Poile, WHA Executive Vice-President *Marcel Pronovost, Coach-Chicago Cougars *Maurice Richard, Coach-Quebec Nordiques *Glen Sather, Edmonton Oilers *Norm Ullman, Edmonton Oilers ==Trophies and Awards== This is a list of the trophies and awards handed out annually by the World Hockey Association. *Avco World Trophy - Awarded to the playoff champion *Gary L. Davidson Award / Gordie Howe Trophy - Most valuable player of the regular season *Bill Hunter Trophy - Leading scorer of the regular season *Lou Kaplan Trophy - Rookie of the year *Ben Hatskin Trophy - Best goaltender *Dennis A. Murphy Trophy - Best defenseman *Paul Deneau Trophy - Most gentlemanly player *Howard Baldwin Trophy / Robert Schmertz Memorial Trophy - Coach of the year *WHA Playoff MVP - Most valuable player in the playoffs ==Timeline of teams== Three Canadian teams completed all seven WHA seasons based in the same city, and were the same three Canadian teams that ultimately joined the NHL. The other WHA team to enter the NHL, the Whalers, were the only other WHA team to play all of its home games over seven seasons within a relatively small geographical area. Of the original 12 WHA franchises, only the Winnipeg Jets remained for all seven seasons without relocating, changing team names, or folding. Franchise Cities/Names Years Fate Alberta/Edmonton Oilers Alberta Oilers 1972–1973 Joined NHL, 1979, as Edmonton Oilers Alberta/Edmonton Oilers Edmonton Oilers 1973–1979 Joined NHL, 1979, as Edmonton Oilers Chicago Cougars Chicago Cougars 1972–1975 Folded, 1975 Cincinnati Stingers Cincinnati Stingers 1975–1979 Folded, 1979 Calgary Broncos Cleveland Crusaders Minnesota Fighting Saints Calgary Broncos (never played) 1972 Folded, 1977 Calgary Broncos Cleveland Crusaders Minnesota Fighting Saints Cleveland Crusaders 1972–1976 Folded, 1977 Calgary Broncos Cleveland Crusaders Minnesota Fighting Saints Minnesota Fighting Saints 1976–1977 Folded, 1977 Denver Spurs Ottawa Civics Denver Spurs 1975–1976 Folded, 1976 Denver Spurs Ottawa Civics Ottawa Civics 1976 Folded, 1976 Dayton Arrows Houston Aeros Dayton Arrows (never played) 1972 Folded, 1978 Dayton Arrows Houston Aeros Houston Aeros 1972–1978 Folded, 1978 Indianapolis Racers Indianapolis Racers 1974–1978 Folded, 1978 Los Angeles Aces Los Angeles Sharks Michigan Stags Baltimore Blades Los Angeles Aces (name changed after San Francisco moved) 1972 Folded, 1975 Los Angeles Aces Los Angeles Sharks Michigan Stags Baltimore Blades Los Angeles Sharks 1972–1974 Folded, 1975 Los Angeles Aces Los Angeles Sharks Michigan Stags Baltimore Blades Michigan Stags 1974–1975 Folded, 1975 Los Angeles Aces Los Angeles Sharks Michigan Stags Baltimore Blades Baltimore Blades 1975 Folded, 1975 Minnesota Fighting Saints Minnesota Fighting Saints 1972–1976 Folded, 1976 New England Whalers New England Whalers 1972–1979 Joined NHL, 1979, as Hartford Whalers (now Carolina Hurricanes) New York Raiders/Golden Blades Jersey Knights San Diego Mariners New York Raiders 1972–1973 Folded, 1977 New York Raiders/Golden Blades Jersey Knights San Diego Mariners New York Golden Blades 1973 Folded, 1977 New York Raiders/Golden Blades Jersey Knights San Diego Mariners Jersey Knights 1973–1974 Folded, 1977 New York Raiders/Golden Blades Jersey Knights San Diego Mariners San Diego Mariners 1974–1977 Folded, 1977 Ottawa Nationals Toronto Toros Birmingham Bulls Ottawa Nationals 1972–1973 Folded, 1979 Ottawa Nationals Toronto Toros Birmingham Bulls Toronto Toros 1973–1976 Folded, 1979 Ottawa Nationals Toronto Toros Birmingham Bulls Birmingham Bulls 1976–1979 Folded, 1979 Miami Screaming Eagles Philadelphia Blazers Vancouver Blazers Calgary Cowboys Miami Screaming Eagles (never played) 1972 Folded, 1977 Miami Screaming Eagles Philadelphia Blazers Vancouver Blazers Calgary Cowboys Philadelphia Blazers 1972–1973 Folded, 1977 Miami Screaming Eagles Philadelphia Blazers Vancouver Blazers Calgary Cowboys Vancouver Blazers 1973–1975 Folded, 1977 Miami Screaming Eagles Philadelphia Blazers Vancouver Blazers Calgary Cowboys Calgary Cowboys 1975–1977 Folded, 1977 Phoenix Roadrunners Phoenix Roadrunners 1974–1977 Folded, 1977 San Francisco Sharks Quebec Nordiques San Francisco Sharks (never played) 1972 Joined NHL, 1979, as Quebec Nordiques (now Colorado Avalanche) San Francisco Sharks Quebec Nordiques Quebec Nordiques 1972–1979 Joined NHL, 1979, as Quebec Nordiques (now Colorado Avalanche) Winnipeg Jets Winnipeg Jets 1972–1979 Joined NHL, 1979, as Winnipeg Jets (now Arizona Coyotes) ==WHA All-Star Game== Every season of the World Hockey Association had an All-Star game, but the format had changed with regularity. * 1972-73 Eastern Division vs Western Division contest. * 1973-74 Eastern Division vs Western Division contest. * 1974-75 Eastern Division vs Western Division contest. * 1975-76 Canadian-based teams (5) vs US-based teams (9). * 1976-77 East played West. * 1977-78 AVCO Cup champion (Quebec Nordiques) vs WHA All-Star team. * 1978-79 WHA All-Star team vs Dynamo Moscow in a three game series. ==References== ==Other websites== *Internet Hockey Database - standings and statistics *http://whauniforms.com Category:1972 establishments in North America Category:1979 disestablishments in North America Category:World Hockey Association",
 "title": "World Hockey Association"
}