{
 "id": "1138566",
 "text": "Plaxton was a builder of bus and coach bodies, They was founded in 1907 in Scarborough, North Yorkshire, England by Frederick William Plaxton. ==History== === Founded === Plaxtons was founded in 1907 in Scarborough, North Yorkshire as a joinery workshop. From 1908 to 1918, they were a building contractor and they built buildings in Scarborough. After World War I they started to build automobile bodies for Rolls-Royce, Sunbeam, Daimler and Crossley chassis. In the 1920s to 1930s, they stopped making automobile bodies and started making coach bodies. === Henlys === In 1989, Plaxtons bought Henlys. Henlys owned 34 motor dealers, and they owned Coleman Milne who were makers of hearses and limousines.Plaxton in Henlys Group mega deal Commercial Motor 8 June 1989 In 1989, the company was renamed from Plaxtons to Plaxton Group plc.Companies House extract company no 435086 Henlys Group plc formerly Plaxton Group plc formerly Plaxton plc formerly Plaxtons (Scarborough) Limited In May 1992, the Plaxton Group plc had replaced all of their management and renamed the company from Plaxton Group plc to Henlys Group. In 1995, Henlys Group purchased bus body maker Northern Counties for £10 million. Buses were still made with the Plaxton name. In August 2000, Henlys and Mayflower Corporation joined together, Mayflower Corporation were owners of Dennis and Alexander (Dennis made buses, fire engines, lorries and dustcarts. Alexander made bodies of buses and coaches).Mayflower and Henlys burst past rivalry to merge UK bus building The Independent 2 August 2000 The joint venture was called TransBus International. Buses were made with the Transbus and Plaxton name. ===Independent again=== On 31 March 2004, TransBus International went into administration.Update: re Administration Mayflower Corporation 22 April 2004 On 17 May 2004, the Plaxton business was sold in a management buyout and they started trading as Plaxton Limited.Companies House extract company no 5101150 Plaxton LimitedMBO heralds TransBus deal by end of this week The Scotsman 17 May 2004 In May 2005, Plaxton announced its return to the bus market and they announced a new body of a bus called the Centro, the Centro was built on the VDL SB120 chassis, VDL SB200 chassis, MAN 14.220 chassis and Volvo B7RLE chassis. ===Purchase by Alexander Dennis=== In May 2007, Plaxton was purchased by Alexander Dennis.Plaxton bought by ADL Bus & Coach Professional 14 May 2007Alexander Dennis buys Plaxton The Herald 15 May 2007 Buses were made with the Alexander Dennis name and Coaches were made with the Plaxton name. In March 2024, Alexander Dennis announced it was going to start making battery electric buses, they also announced that Plaxton coaches would stop being made until 2026. == Products == === Current === ==== Coaches ==== , the following models are being made: * Cheetah XL minicoach * Elite luxury coach * Elite i inter-deck coach * Leopard entry-level coach * Panorama double-decker coach * Panther mid-spec coach * Panther Cub short-wheelbase coach * Panther LE low-entry intercity service coach ==== Buses ==== After the Centro, Primo and Pronto was stopped being made, Plaxton do not make any of their own buses. the Plaxton factory at Scarborough does currently make the Enviro200 MMC and Enviro400 MMC buses for parent company Alexander Dennis. === Past === * Type A * D Series * Type F * Type J * K Series * L Series * M Series * Q2 * Envoy * Venturer I, II, III * Crusader Mk I, Mk II * Consort Mk I, Mk II, Mk III, Mk IV * Highway – (single deck bus) * Panorama * Embassy I, II, III, IV * Panorama I and Panorama II * Panorama Elite, Elite Express * Panorama Elite II, Elite Express II * Panorama Elite III, Elite Express III * Panorama IV (For Bedford SB and VAS) * Derwent, Derwent II (single deck bus) * Supreme I, II, III, IV, V, VI (1st version of Supreme for *Bristol LHS & Bedford PJK was to be known as Panorama Supreme) * Viewmaster * Bustler – (single deck bus) * Paramount 3200, 3500, 4000, Mk I, Mk II, Mk III * Plaxton Expressliner (Paramount III for National Express) * Derwent 3000 – (single deck bus) * Plaxton 321 (1989 version of the Duple 320 after takeover) * Plaxton 425 * Verde – for rear engined Dennis Lance, Volvo B10B and Scania N113 single-deck bus chassis * Excalibur – for Volvo B10M and Volvo B12T chassis * Premiere – for Volvo B10M, Scania K93, Dennis Javelin chassis and others * Prima – for Volvo B7R, DAF SB3000 chassis * Prestige – left hand drive coach sold to France and Italy on Volvo B12R * Prestige – single-deck bus based on Northern Counties design * President – double-deck bus * Beaver / Beaver 2 / Beaver 3 – minibus for Mercedes-Benz van chassis * Pointer / Pointer 2 – for Dennis Dart/Dart SLF and Volvo B6/B6LE chassis * Paragon – for Volvo B10M, B12M and B12B, Dennis R-Series, MAN 18.310 and Irisbus EuroRider * Profile (10m and 12m) – for Volvo B7R and Dennis Javelin chassis * Primo / Primo 2 – midibus based on the frame of Enterprise Bus Plasma * Centro – for VDL SB120, VDL SB200, MAN 12.240, MAN 14.220 and Volvo B7RLE single-deck bus chassis * Cheetah – for Mercedes-Benz Vario van chassis ==References== * Brown, Stewart J (2007). Plaxton 100 Years: A Centenary of Innovation 1907 – 2007. Ian Allan. * Townsin, Alan (Editor) (1982). Plaxtons The Great British Coach Builders. Transport Publishing Company. ==Other websites== * * * Plaxton Body Styles 1946–1960 (John Kaye SCT'61) * Plaxton Body Styles 1960–1975 – Lightweights (John Kaye SCT'61) * Plaxton Body Styles 1960–1975 – Heavyweights (John Kaye SCT'61) Category:Alexander Dennis Category:Coaches (bus) Category:1907 establishments in England Category:North Yorkshire Category:British transport companies",
 "title": "Plaxton"
}