{
 "id": "1139000",
 "text": "PlaceAVote.com is a grassroots American organization founded in 2014, headquartered in Los Angeles, CA. The platform provides a peer-to-peer framework to review, discuss, and vote on every issue before the United States Congress. PlaceAVote aims to serve as a boundary-free, non-partisan forum where the collective will of the people can be communicated to their United States Congressional Representatives. The organization’s mission is to facilitate democracy and combat government corruption, both in the United States and abroad. == History == PlaceAVote was founded in 2014 by Luke Arrigoni, Ben Colman, and Job Melton. The platform was designed as a response to the growing disconnect between elected representatives and the will of their constituents. By using technology, PlaceAVote aimed to provide a direct means of representation, allowing voters to have their say on every issue before Congress. The guiding principle of PlaceAVote is to create a forum for the people to express their views on legislative matters. The results of these discussions and votes would then be communicated to elected officials, ensuring representation based on voter consensus. Since its launch, the platform gained significant traction, and over 50 candidates across the United States expressed an interest in running on the PlaceAVote platform during the 2014 primaries. == 2014 Congressional elections == In the 2014 Congressional elections, two candidates ran on the PlaceAVote.com platform, leveraging technology to fully represent their constituents. Job Melton, a Democrat running in California's 16th District, and John Catano, a Republican running in California's 22nd District, both utilized PlaceAVote to engage, educate, and interact with their constituencies. The candidacies of Melton and Catano reflected the non-partisan nature of PlaceAVote. To emphasize this, both candidates switched their lifelong political party affiliations to match the constituency of their districts, demonstrating a commitment to represent the majority consensus. == Related pages == * Direct democracy == References == Category:Organizations based in California Category:2014 establishments in California",
 "title": "PlaceAVote.com"
}