{
 "id": "1139040",
 "text": "Professor Abraham Van Helsing, M.D., Phd, D.Litt is a character in the book Dracula by Bram Stoker. Dr. Van Helsing trained Dr. John Seward in Amsterdam. == Role in the Book == When Dr. Seward isn’t sure how to treat Lucy Westenra, he writes to his Dutch teacher Dr. Abraham Van Helsing and asks for help. Dr. Van Helsing comes from Holland to England and notices that Lucy lost a lot of blood so he keeps her alive with Blood transfusions. Van Helsing doesn’t know how Lucy got so sick. Van Helsing figures out that, even though he’s never heard of people getting sick with what Lucy has, animals that get bitten by bats called vampires get sick with it all the time. Van Helsing tries to find out if there were ever humans who were bitten by vampire bats and he learns that there are legends about people being bitten by vampire bats, dying, and becoming Undead monsters called Nosferatu. Van Helsing gives Lucy garlic and keeps her window closed since he’s afraid that a Nosferatu will find her. When Lucy dies, Van Helsing tries to convince Dr. Seward to cut her head off so she won’t become a Nosferatu but he says no. Then Lucy becomes a Nosferatu and bites a lot of children. When Van Helsing convinces Dr. Seward and his friends that this happened, they attack and kill Lucy. Van Helsing cuts her head off so she will stay dead. Van Helsing says since they killed her while the children she bit were alive, the children won’t become Nosferatu. Van Helsing also says that if they had killed the Nosferatu who bit her before she died, then Lucy would never have become a Nosferatu. After meeting Jonathan and Mina Harker, Van Helsing finds out that the Nosferatu who bit Lucy is the same man who kidnapped Jonathan in Transylvania, whose name is Count Dracula. Van Helsing also thinks that Dracula is Vlad the Impaler and that he became a Nosferatu after he died because when he was alive, he went to the Scholomance and learned Magic from The Devil. Van Helsing looks up everything they need to know about vampires. Dr. Seward’s patient R.M. Renfield begs him to let him go but Dr. Seward doesn’t so Renfield invites Dracula into Seward’s house and Dracula bites Mina without her knowing. When Dracula finds out that Van Helsing and the others are chasing him, he bites Mina in front of Jonathan and he kills Renfield. Van Helsing decides that they can’t trust Mina anymore because Dracula can use her to spy on them but then Mina convinces him that they can use her to spy on Dracula. Van Helsing and the others chase Dracula to Transylvania and three female Nosferatu attack Van Helsing and Mina so Van Helsing draws a circle around Mina and surrounds it with Wafers and Garlic so that they can’t get into it. Mina starts to turn into a Nosferatu. Then the Sun comes up so the three women teleport into their graves and fall asleep. Then Van Helsing stabs each one of them through the heart and cuts their heads off. Category:Characters in written fiction",
 "title": "Abraham Van Helsing"
}