{
 "id": "1139028",
 "text": "Colorectal surgery is a type of medicine that deals with problems of the rectum, anus, and colon. Doctors who work in this field are called colorectal surgeons or proctologists. == Scope of the specialty == Colorectal surgical disorders include: * Swollen and inflamed veins in the rectum and anus (hemorrhoids) * Cracks or tears in the anus (anal fissures) * Abnormal passages between the rectum and the skin (fistulas) * Severe constipation * Loss of control over bowel movements (fecal incontinence) * The rectum's walls pushing out through the anus (rectal prolapse) * Birth defects like an imperforate anus (where the anus is blocked or missing) * Treatment for severe digestive problems like Crohn's disease * Colon and rectum cancer (colorectal cancer) * Fixing the rectum if it falls out of place * Cancer of the anus * Injuries to the anus * Removal of objects stuck in the anus * Performing tests to check the colon (colonoscopies) * Surgery to remove hemorrhoids (hemorrhoidectomies) == Surgical treatment and diagnostic procedures == Surgical treatments for these conditions include removing part of the colon (colectomy), creating an opening in the colon or small intestine (ileo/colostomy), removing polyps (polypectomy), widening narrow areas in the intestines (strictureplasty), and removing hemorrhoids in severe cases (hemorrhoidectomy). Other operations include minimally invasive surgery, surgery of the anus-anoplasty-and more, depending on the need of the patient. Tests like a colonoscopy are very important for colorectal surgery because they help the doctor understand the condition and decide on the right surgery. Colorectal doctors conduct other tests which include proctoscopy, defecating proctography, and sigmoidoscopy. Now, the ratio of laparoscopic surgery is gaining more because of its lesser risks, quicker recoveries, and cuts due to special instruments used in this method. == Mechanical bowel preparation == Mechanical bowel preparation (MBP) is a process where the bowel is cleared of stool before surgery. This is usually done using sodium phosphate. But there is little evidence in medical research to show that it is necessary or helpful. == References == Category:Surgery",
 "title": "Colorectal surgery"
}