{
 "id": "113964",
 "text": "Kowloon (; ) is one of the 3 main parts of Hong Kong. It comprises the Kowloon Peninsula and New Kowloon. With a population of 2.1 million in 2011. It is the most populous area in Hong Kong. ==Geography and History== Kowloon is north of Hong Kong Island and south of the mainland part of the New Territories. The size of Kowloon is about 47 km² (18 sq mi). In law, Kowloon refers to the area south of Boundary Street and Stonecutters Island, leased to the United Kingdom by the Qing dynasty in 1860. In 1898, the Qing dynasty leased the New Territories to the United Kingdom for 99 years. New Kowloon, the area north of Boundary Street, is officially part of the New Territories. In modern culture, however, New Kowloon is part of Kowloon. Kowloon was developed largely in the 20th century, after Kowloon Wharf and Kowloon-Canton Railway were built. Airplanes used to fly above Kowloon to and from Kai Tak Airport until 1998, so buildings there are usually lower than the ones on Hong Kong Island because they had height restrictions. The height restrictions were lifted after the opening of the new Hong Kong International Airport in 1998. ==Name== The name Kowloon means \"nine dragons\" (九 – nine, 龍 – dragon). This refers to eight mountains and a Chinese emperor: Kowloon Peak, Tung Shan, Tate's Cairn, Temple Hill, Unicorn Ridge, Lion Rock, Beacon Hill, Crow's Nest and Emperor Bing (Song Dynasty). ==Demographics== 2,108,419 people lived in Kowloon in 2011. 94.2% of Kowloon's residents are Chinese. Smaller groups include Indonesians (1.8%), Filipinos (1.5%), Indians (0.5%), Nepalese (0.4%), and White people (0.3%). 86% of the people in Kowloon usually speak in Cantonese, 2.3% use English and 1.2% use Mandarin. ==Districts== Kowloon is divided into the following districts: *Kowloon City *Kwun Tong *Sham Shui Po *Wong Tai Sin *Yau Tsim Mong == Education == The Hong Kong Polytechnic University, Open University of Hong Kong, and City University of Hong Kong are all located in Kowloon. There are also many primary and secondary schools as well. Category:Geography of Hong Kong",
 "title": "Kowloon"
}