{
 "id": "1139240",
 "text": "Megatron, also known as formerly Delta Hexadecaon or Dee-Sixteen (D-16) and currently Galva Megatron, Super Megatron or Ultra Megatron or simply Galvatron, Supertron or Ultratron, is a major character from Transformers. He is the main villain of the franchise, the leader of the Decepticons and the archenemy of Ultra Magnus. He is named after a megatron, which is a disc-seal tube for lighthouses or submersibles. ==Creation== Hasbro didn't want him to be called Megatron since they thought the name was scary. The series' writer reminded them he was the villain. ==History== ===Television show=== In the show The Transformers, Megatron was played by Frank Welker. In The Transformers: The Movie, Megatron was turned into a more powerful robot called Galvatron, who was played by Leonard Nimoy. ===Comics=== In the Marvel Comics version of Transformers and in the animated television show from the 1980s, Megatron killed Sentinel Prime so that he could become dictator of the planet Cybertron and started a civil war which lasted for millions of years. Then Megatron and his followers called The Decepticons went to space and crashed into prehistoric Earth and went to sleep for millions of years but were woken up by a Volcano. Megatron wanted to take over the Earth but his sidekick Starscream wanted to rule the Decepticons instead of him and accidentally woke up their enemies the Autobots who tried to stop Megatron. The comics later gave Megatron an origin story where he thought the government on Cybertron was corrupt so they had him enslaved and forced to work as a miner. Then Megatron escaped and became a gladiator, overthrew Sentinel Prime, took over as dictator of Cybertron and started a war. Those who supported Megatron were called Decepticons and those who fought for Optimus Prime against Megatron were called Autobots. ===Live-action movies=== In the movie Transformers, Megatron is played by Hugo Weaving. He starts the war so he can steal the AllSpark, a magic cube that brings technology to life. He crashes into the North Pole in the 1940s and is frozen, later being captured by the government until the Decepticons rescue him in 2007. Megatron then tries to kill Optimus Prime and take over the world, but Sam Witwicky ends up killing Megatron. ==References== Category:Fictional characters introduced in 1984 Category:Fictional robots Category:Fictional dictators Category:Fictional mass murderers Category:Supervillains Category:Transformers (franchise) Category:Video game bosses",
 "title": "Megatron (character)"
}