{
 "id": "1139785",
 "text": "Bernie Ashman (born November 24, 1947) is an American astrologer, writer, teacher, and lecturer. He is the author of eleven astrological books. He currently mentors astrology students and astrologers across the United States and in other countries. == Early life and education == Ashman was born on November 24, 1947, in Springfield, Massachusetts. He graduated with a B.A. in Political Science from the University of Florida in 1971. While attending the University of Florida, Ashman took coursework with Sidney Jourard, Ph.D., author of The Transparent Self. Jourard was a leader in humanistic psychology. He began studying astrology in 1973 after encountering The Astrology of Personality written by French astrologer Dane Rudhyar. == Career == Ashman began his journey in astrology by offering free chart readings in 1974 to gain experience. He secured his first book contract in 1984 with ACS Publications, releasing Astrological Games People Play in 1987, edited by astrologer Maritha Pottenger. His second book, RoadMap to Your Future, focusing on predictive astrology, was published by ACS in 1994 and later reprinted by the American Federation of Astrologers. In 1999, Ashman signed a contract with Llewellyn to write his third book, SignMates, which explores sign comparisons and relationship fulfillment. He also contributed a chapter titled \"The Psychology of Terrorism\" to the 2001 publication Civilization Under Attack following the events of September 11. Ashman's later works continued his focus on astrology's application to life patterns and relationships. In 2010, Llewellyn published Sun Signs & Past Lives, which used birth charts to explore past life influences. His 2016 book, How To Survive Mercury Retrograde, gathered media attention, and in 2020, he released Sun Sign Karma, addressing past life patterns. Astrologer Carmen Turner-Schott praised Ashman’s work on past lives, earning him a reputation for identifying these patterns. His books have been translated into multiple languages, and his career has expanded into teaching, lecturing, and consulting worldwide. == Books == Following is the list of books he authored:https://www.amazon.com/Books-Bernie- Ashman/s?rh=n%3A283155%2Cp_27%3ABernie+Ashman * Sun Sign Karma: Resolving Past Life Patterns with Astrology (June 8, 2021) * How to Survive Mercury Retrograde (February 8, 2016) * Sun Signs & Past Lives: Your Soul’s Evolutionary Path (December 8, 2010) * Astrology, Psychology, and Transformation (June 23, 2022) * Sign Mates: An Astrological Guide to Love & Intimacy (September 8, 2000) * Your Sun Sign Intuition: The Magical and Creative Sky Within (October 25, 2022) * Roadmap to Your Future: Progressions and Transits (April 26, 2017) * Astrological Games People Play (January 1, 1987) == References == Category:1947 births Category:People from Springfield, Massachusetts Category:Living people Category:Astrologers Category:Writers from Massachusetts",
 "title": "Bernie Ashman"
}