{
 "id": "1139051",
 "text": "Giannis Klearchou Xenakis (also known as Yannis or Iannis Xenakis; , ; 29 May 1922 – 4 February 2001) was a Greek, French, and Romanian composer and architect == Early Life == Giannis Klearchou Xenakis was born in Brăila, Romania. He was born to Klearchos Xenakis, a businessman from Euboea, and Fotini Pavlou from Lemnos, a pianist. He had two brothers named Jason and Kosmas. His parents were both interested in music, and wanted Xenakis to learn more about it.Matossian, 13. He would learn music at a boarding school and the National Technical University in Athens. In college, Xenakis fought for the National Liberation Front. He later graduated from college. Matossian, pp. 18–27.Varga, pp. 14–19. Xenakis left Greece for Paris as a refugee.Varga, p. 47. He was sentenced in absentia to death in Greece. He came back many years later, once the sentence was ended.Harley, p.92. == Works == Xenakis wrote many musical compositions. This includes thirty two pieces for voice, two ballets, and seventeen solo instrumental pieces. == References == ==Additional sources== * * * * * * * * == Further reading == * Amagali, Rosemary Tristano. (1975). \"Texture as an Organizational Factor in Selected Works of Iannis Xenakis\". M.M. Thesis, Indiana University. * * * Bardot, Jean-Marc. (1999). \"Cendrées de Xenakis ou l'émergence de la vocalité dans la pensée xenakienne.\" Undergraduate thesis (equivalent). Saint-Etienne: Université Jean Monnet. * Biasi, Salvatore di. (1994). Musica e matematica negli anni 50–60: Iannis Xenakis. Bologna. Università degli Studi di Bologna. * Boivin, Jean. 1995. La Classe de Messiaen. Paris: Christian Bourgois. * Clark, Philip. (2009). \"Xenakis\", in The Wire Primers: A Guide To Modern Music, 191–198. London and New York: Verso. . * Kitsikis, Dimitri. (2014). Περί Ηρώων: Οι ήρωες και η σημασία τους για τον σύγχρονο ελληνισμό (On Heroes.: Heroes and Their Importance for Contemporary Hellenism). Athens: Herodotos. (Chapter \"Iannis Xenakis: Souvenirs from Paris, by D. Kitsikis, Xenakis's Intimate Friend\"). * * * Paland, Ralph, and Christoph von Blumröder (eds.). (2009). Iannis Xenakis: Das elektroakustische Werk. Internationales Symposion. Tagungsbericht 2006. Signale aus Köln. Beiträge zur Musik der Zeit 14. Vienna. Der Apfel. . * * * * Woodward, Roger (2014). \"Iannis Xenakis\". Beyond Black and White. HarperCollins. pp. 353-399. ISBN 9780733323034 ===Obituaries=== * == Other websites == * xenakis.musicportal.gr from the Institute for Research on Music and Acoustics, Athens (Greece) – in Greek and English with many score and audio examples * Iannis-Xenakis.org by the Friends of Xenakis * Medieval.org: Modern Music: Xenakis * Luque, Sergio. 2009. \"The Stochastic Synthesis of Iannis Xenakis.\" Leonardo Music Journal (19): 77–84 * Works catalogue 70-page PDF from Xenakis's publisher Éditions Durand-Salabert-Eschig * Iannis Xenakis @ Boosey & Hawkes Publisher * Iannis Xenakis: the aesthetics of his early works by Markos Zografos * Iannis Xenakis Bibliography and Discography compiled by James Harley for Leonardo/ISAST * Two articles by Grant Chu Covell (2006) documenting then-recent Xenakis recordings and books about Xenakis: Part 1 and Part 2 * Interview with Iannis Xenakis, 25 March 1997 Category:1922 births Category:2001 deaths",
 "title": "Iannis Xenakis"
}