{
 "id": "1139553",
 "text": "Francis Anthony Nixon (December 3, 1878 – September 4, 1956) was an American small business owner and the father of U.S. president Richard Nixon. == Early life == Nixon was born in Elk Township, Vinton County, Ohio, the son of Samuel Brady Nixon, who was from Smith Township, Washington County, Pennsylvania, and Sarah Ann (née Wadsworth), a native of Hocking Township, Fairfield County, Ohio. Nixon's family ancestry included colonial Pennsylvania Quakers. He was raised Methodist, however, but converted to Quakerism when he married Hannah Milhous. Sarah Nixon died in January 1888, leading Francis to live with an uncle during his father's struggle to avoid poverty and to cope with the loss of Sarah. After Francis' father remarried, Francis moved away. Biographer Jonathan Aitken cited Francis' disliking of his new stepmother as his reason for leaving. Nixon proceeded to have multiple jobs during the next fourteen years. Throughout his youth, Nixon idolized U.S. Presidents Thomas Jefferson and Andrew Jackson. Biographer Stephen E. Ambrose wrote that Nixon stopped favoring the Democratic Party by the age of 17. During the campaign for the 1896 United States presidential election, Nixon had an meeting with presidential candidate William McKinley, who asked him how he was going to vote, Nixon replying, \"Republican, of course!\" Ambrose cited the encounter as completing Nixon's switch to favoring the Republican Party. == Career == Nixon moved to California at the end of the century after having been frostbitten working as a motorman in an open streetcar in Columbus, Ohio. After working as a farmhand and oil field roustabout, he attempted to grow lemons outside Los Angeles. Francis' son Richard also tested the waters of the citrus business. Shortly after finishing from law school, Richard started the Citra-Frost Company which tried to produce and sell frozen orange juice. Richard aimed to follow in his father's footsteps, successfully raising money from a number of investors for the new company. Richard, a future president of the United States, worked with the company and did much of the grunt work. In addition to his administrative responsibilities as president of the Citra-Frost Company, he was also in charge of cutting and squeezing the oranges to make the juice. This work did not pay off as the company went bankrupt after just 18 months. After his son Richard was born, Nixon gave up the lemon grove, and the family moved to the Quaker community of Whittier, California. Nixon worked the family business, a store that sold groceries and Atlantic Richfield gasoline, but the family remained poor. Nixon's life was marked by the deaths of two of his sons, Arthur and Harold, from tuberculosis. He has been described as a \"restless, frustrated, and angry man, an [angry] person who psychologically abused his five sons and sometimes beat them.\" However, Richard always spoke well of his parents. He often spoke lovingly of his mother as a \"Quaker saint\", and began his memoirs with the words \"I was born in a house my father built\". Writer Jessamyn West, a cousin of the Nixons, was in Frank's Sunday school class for some time. She later described him as \"a fiery persuasive teacher\", and wrote that Frank Nixon's version of the social gospel made her favor socialism.West, Jessamyn. Double Discovery: A Journey New York: Harcourt Brace Jovanovich, 1980; p. 125. By the time of his later adulthood, Nixon often discussed his political opinions with strangers, his son Don remembering his father as being willing to debate anyone he encountered in the family market and having an intolerance of Democrats.Ambrose, pp. 34-36. Nixon voted for Woodrow Wilson in the 1916 United States presidential election, Warren G. Harding in the 1920 presidential election, Robert Lafollette in the 1924 presidential election, Herbert Hoover in both the 1928 and 1932 presidential elections, and Franklin Roosevelt in the 1936 election. Aitken described these as odd voting habits that displayed changing political loyalties in the early life of his son Richard.Aitken, pp. 44-45. After his son Arthur's death in 1925, Nixon often thought about and was haunted by the possibility of God allowing the death as a form of punishment directed toward him, his actions afterward being never again to open the family store on Sundays and having the family listen to sermons every evening. Nixon favored Robert P. Shuler, Billy Sunday, and Aimee Semple McPherson, taking his sons once a week to hear either Shuler or McPherson at Trinity Methodist Church.Aitken, pp. 49-56. In 1938, Francis' son Richard met Pat Ryan, who Frank developed a \"playful relationship\" with and spared the same criticisms he had given his children. During the controversy concerning Richard's alleged bad behaviour relating to a fund started by his investors to pay back to him for his political expenses, Frank was \"reduced to sobs\" in hearing of the story and angered by his son's taking of any funds. The elder Nixons cared for their granddaughters Julie and Patricia while Vice President Nixon was involved with activities relating to the 1956 Republican National Convention. Francis experienced a broken abdominal artery in the latter part of the month from which he was not expected to recover, resulting in the vice president stopping his public appearances to help his father, who advocated that his son return to San Francisco and work with the convention; Vice President Nixon refused. On September 3, Nixon was visited by Richard, who he told upon the latter leaving, \"Good night Dick, but I don't think I'll be here in the morning.\"Aitken, p. 286 The next day, Francis Nixon died, his funeral being carried out three days later at the East Whittier Friends Meeting House.Ambrose, pp. 407-408. == Personal life == On 25 June 1908, he married Hannah Milhous and had five sons, one of whom died as a baby: *Harold Samuel Nixon (June 1, 1909 – March 7, 1933) *Richard Milhous Nixon (January 9, 1913 – April 22, 1994) *Francis Donald Nixon (November 23, 1914 – June 27, 1987) *Arthur Burdg Nixon (May 26, 1918 – August 10, 1925) *Edward Calvert Nixon (May 3, 1930 – February 27, 2019) Nixon died on September 4, 1956, in La Habra, California, U.S. == In popular culture == He was played by actor Tom Bower in Oliver Stone's movie Nixon. == References == == Other websites == * Nixon Fun Facts via Nixon Foundation Category:1878 births Category:1956 deaths Category:People from Whittier, California Category:People from Ohio Category:Businesspeople from California Category:Quakers Category:Businesspeople from Ohio",
 "title": "Francis A. Nixon"
}