{
 "id": "1139757",
 "text": "The following are the football (soccer) events of the year 1938 around the world. ==Events== ===May=== *May 7: Manchester City lose 1-0 against Huddersfield Town, and are relegated to the Football League Second Division. This makes Manchester City the only team in history to be relegated the year after becoming English champions. ===June=== *June 19: The 1938 FIFA World Cup Final is played. beat 4–2 at the Stade Olympique de Colombes in Paris, France. ===July=== *July 3: Hannover 96 wins their first German football championship. ==Tournament Winners== ===International=== Tournament Confederation Host Country(s) Winner Runner-Up Finals Stadium 1937–38 British Home Championship Home Nations - 1938 Baltic Cup Baltic states - 1938 Bolivarian Games ODEBO - 1938 FIFA World Cup FIFA Stade Olympique de Colombes, Paris ===Continental=== Tournament Continent Previous Winner Winner Runner-Up Finals Stadium 1938 Mitropa Cup Europe Ferencváros (1937) Slavia Prague Ferencváros 2-legged final 1938 Copa Aldao South America River Plate (1937) Independiente Peñarol Estadio Centenario, ===Europe=== Nation League Champion Cup Winner Runner-Up 1937–38 Austrian football championship Rapid Wein 1937–38 Austrian Cup Schwarz-Rot Wien Wiener Sport-Club 1937–38 Belgian First Division Beerschot No Cup No Cup No Cup 1937–38 Bulgarian National Football Division Ticha Varna 1938 Bulgarian Cup FK 13 Sofia Levski Ruse 1937–38 Czechoslovak First League Sparta Prague No Cup No Cup No Cup 1937–38 Cypriot First Division APOEL 1937–38 Cypriot Cup Enosis Neon Trust AEL 1937–38 Danish Championship League Boldklubben 1903 No Cup No Cup No Cup 1937–38 Football League First Division Arsenal 1937–38 FA Cup Preston North End Huddersfield Town 1937–38 Football League First Division Arsenal 1938 FA Charity Shield Arsenal Preston North End 1937–38 Estonian Football Championship JS Estonia Tallinn 1938 Estonian Cup VS Sport Tallinn Tallinna Jalgpalliklubi 1938 Mestaruussarja HJK Helsinki No Cup No Cup No Cup 1937–38 French Division 1 Sochaux 1937–38 Coupe de France Olympique Marseille Metz 1937–38 Gauliga 16 Teams 1938 Tschammerpokal Rapid Wein FSV Frankfurt 1938 German football championship Hannover 96 1938 Tschammerpokal Rapid Wein FSV Frankfurt 1937–38 Panhellenic Championship Olympiacos No Cup No Cup No Cup 1937–38 Nemzeti Bajnokság I Ferencváros No Cup No Cup No Cup 1938 Úrvalsdeild Valur No Cup No Cup No Cup 1937–38 Serie A Ambrosiana-Inter 1937–38 Coppa Italia Juventus Torino 1938 Latvian Top League Olimpia Liepaja 1938 Latvian Football Cup Rīgas Vilki ASK 1937–38 LFF Lyga KSS Klaipėda 1938 Lithuanian National Olympics KSS Klaipėda LGSF Kaunas 1937–38 Luxembourg National Division CA Spora Luxembourg 1937–38 Luxembourg Cup Stade Dudelange National Schifflange 1937–38 Maltese Premier League Sliema Wanderers 1937–38 Maltese FA Trophy Floriana Sliema Wanderers 1937–38 Netherlands Football League Championship Feyenoord 1937–38 KNVB Cup VSV AGOVV 1937–38 Irish League Belfast Celtic 1937–38 Irish Cup Belfast Celtic Bangor 1937–38 League of Norway Fredrikstad 1938 Norwegian Football Cup Fredrikstad Mjøndalen 1938 Ekstraklasa Ruch Chorzów No Cup No Cup No Cup 1937–38 Campeonato da Liga Benfica 1937–38 Campeonato de Portugal Sporting CP Benfica 1937–38 League of Ireland Shamrock Rovers 1937–38 FAI Cup St James's Gate Dundalk 1937–38 Divizia A Ripensia Timișoara 1937–38 Cupa României Rapid București CAM Timișoara 1937–38 Scottish Football League Celtic 1937–38 Scottish Cup East Fife Kilmarnock 1938 Soviet Top League Spartak Moscow 1938 Soviet Cup Spartak Moscow Elektrik Leningrad 1937–38 Allsvenskan IK Sleipner No Cup No Cup No Cup 1937–38 Nationalliga FC Lugano 1937–38 Swiss Cup Grasshopper Club Zürich Servette 1937–38 Istanbul Football League 1937–38 Çukurova Football League 1937–38 Eskişehir Football League Güneş S.K. Adana İdman Yurdu Eskişehir Demirspor 1937–38 Istanbul Shield Fenerbahçe Beşiktaş 1938 Turkish National Division Güneş S.K. 1937–38 Istanbul Shield Fenerbahçe Beşiktaş 1937–38 Yugoslav Football Championship HAŠK Zagreb 1938 Yugoslav Cup Građanski Zagreb BSK Belgrade No League No League 1937–38 Welsh Cup Shrewsbury Town Swansea Town ===North America=== Nation League Champion Cup Winner Runner-Up 1938 Primera División de Costa Rica Orión No Cup No Cup No Cup 1938 Campeonato Nacional de Fútbol de Cuba Deportivo Centro Gallego No Cup No Cup No Cup 1938 Canadian National Soccer League Montréal Royal Victoria Hospital No Cup No Cup No Cup 1937–38 Ligue Haïtienne Racing CH 1937–38 Coupe Vincent AS Capoise Unknown 1938 Liga Capitalina Tipografía Nacional No Cup No Cup No Cup 1938 Salvadoran Football Championship Club Deportivo 33 1937-38 Copa Presidente Unknown Unknown 1937–38 Primera Fuerza Necaxa 1937–38 Copa Mexico Club América Club España 1937–38 American Soccer League Scots-Americans (Metropolitan Division) Providence S.C. (New England Division) 1938 National Challenge Cup Sparta Garden City St. Mary's Celtic ===South America=== Nation League Champion Cup Winner Runner-Up 1938 Argentine Primera División Independiente 1938 Copa Ibarguren Independiente Rosario Central 1938 Primera División de la L.P.F.A. Unknown No Cup No Cup No Cup 1938 State championships 22 winners No National Cup No National Cup No National Cup 1938 Primera División de Chile Magallanes 1938 Campeonato de Apertura Colo-Colo Audax Italiano 1938 Paraguayan Primera División Club Olimpia No Cup No Cup No Cup 1938 Peruvian Primera División Deportivo Municipal No Cup No Cup No Cup 1938 Uruguayan Primera División Peñarol No Cup No Cup No Cup 1938 Venezuelan Primera División Dos Caminos 1938 Copa Venezuela Unión Dos Caminos ===Asia & Oceania=== Nation League Champion Cup Winner Runner-Up No League No League 1938 Football SA Federation Cup 1938 Dockerty Cup 1938 Challenge Cup and Shield Birkalla Rovers Nobels Victoria Park Kingswood Unknown Unknown British Malaya No League No League 1938 Malaysia Cup Selangor Singapore No League No League 1938 Rovers Cup Bangalore Muslims 2nd Battalion, Argyll and Sutherland Highlanders No League No League 1938 IFA Shield East Yorkshire Regiment Mohammedan 1938 Inlandsche Stedenwedstrĳden VIJ Batavia No Cup No Cup No Cup No League No League 1937–38 Lebanese FA Cup Al Nahda Hilmi- Sport 1937–38 Hong Kong First Division League South China B 1937–38 Hong Kong Senior Challenge Shield South China A South China B 1938 Tehran Province League Tehran Club No Cup No Cup No Cup No League No League 1938 Emperor's Cup Waseda University Keio University League interrupted due to an Arab revolt League interrupted due to an Arab revolt 1938 Palestine Cup Hapoel Tel Aviv Maccabi Tel Aviv ===Africa=== Nation League Champion Cup Winner Runner-Up French Algeria 1937-1938 Algiers Championship 1937-1938 Constantine Championship 1937-1938 Oranie Championship AS Boufarik CS Constantine CDJ Oran No Cup No Cup No Cup 1937–38 Alexandria Zone League 1937–38 Cairo League 1937–38 Canal Zone League El Ittihad Alexandria Al Ahly Al-Masry 1937–38 Egypt Cup Zamalek Al Ahly 1937–38 Alexandria Zone League 1937–38 Cairo League 1937–38 Canal Zone League El Ittihad Alexandria Al Ahly Al-Masry 1937–38 Sultan Hussein Cup Al Ahly Unknown French Morocco 1938 Moroccan football league OM Rabat 1938 Coupe Djebari US Marocaine SA Marrakech French North Africa 1938 North African Championship JAC Bône No Cup No Cup No Cup French Tunisia 1937–38 Tunisian National Championship Savoia de la Goulette 1937–38 Tunisian Cup Sporting Club Racing Club de Tunis ==Clubs== ===Clubs Founded=== Date Founded Club Country Current League Notes January 31 Fluminense Esporte Clube Campeonato Brasileiro Série D Campeonato Piauiense February 20 Esporte Clube São Luiz Campeonato Brasileiro Série D Campeonato Gaúcho April 14 VfL Bochum II (formerly) Folded in 2015 Reserve team of VfL Bochum June 21 Blauw Geel '38 Derde Divisie B July 5 Goiânia Esporte Clube Campeonato Goiano July 10 Associação Olímpica de Itabaiana Campeonato Brasileiro Série D Campeonato Sergipano August 21 Operário Futebol Clube Campeonato Brasileiro Série D Campeonato Sul-Mato-Grossense August 30 Independiente de Cañete Copa Perú October 17 Olímpico Clube Campeonato Amazonense (last known league) November 1 Moreirense F.C. Primeira Liga 1938 S.U. 1º Dezembro Liga 3 Sport club originally founded in 1880 1938 AS Central Sport () Tahiti Ligue 1 1938 Beith Juniors F.C. West of Scotland Premier Division 1938 Sport Dili e Benfica (formerly) (formerly) LFA2 1938 VfL Bergen (formerly) Landesliga Mecklenburg-Vorpommern Nord 1938 Bethlehem Hungarian Folded in 1939 1938 NK Bled (formerly) Upper Carniolan League 1938 C.D. Euzkadi Folded in 1939 Basque Country national team competiting in the Primera Fuerza 1938 Chelmsford City F.C. National League South Reformation of Chelmsford F.C. 1938 Cork City F.C. Folded in 1940 Not to be confused with the current club named Cork City F.C. 1938 FK Crvena Stijena (formerly) (formerly) Montenegrin Third League 1938 Dahle IL Norwegian Third Division 1938 S.F. Damaiense Liga BPI Women's football club 1938 Debed FC (formerly) Folded in 1993 1938 Defence Force S.C. Ethiopian Premier League 1938 NK Dekani (formerly) Slovenian Second League 1938 Deveronvale F.C. Highland League 1938 AS Dragons (formerly) Linafoot Ligue 2 1938 FC Chikhura Sachkhere (formerly) Liga 4 1938 FC Meshakhte Tkibuli (formerly) Liga 3 1938 FK Vardar Negotino (formerly) Macedonian Second League 1938 Hapoel Ra'anana A.F.C. (formerly) Liga Leumit 1938 Kénitra AC French Protectorate in Morocco (formerly) Botola 2 1938 Kırıkhanspor Folded in 2022 1938 NK Krajišnik Velika Kladuša (formerly) Second League of FBiH – West 1938 Merelinense F.C. Campeonato de Portugal 1938 Moulins Yzeure Foot Championnat National 3 Group J Founded as AS Yzeure 1938 Nadroga F.C. Fiji Premier League 1938 Newton Abbot Spurs A.F.C. South West Peninsula League Premier Division East 1938 F.C. Oliveira do Hospital Liga 3 1938 Paget Rangers F.C. Midland League Division One Reformed in 2011 1938 Perst Tabanan (formerly) Liga 3 1938 Pike Rovers F.C. Limerick & District League 1938 Pilkington F.C. North West Counties League Premier Division 1938 FC Porto Taibesse (formerly) (formerly) Liga Futebol Amadora Primeira Divisão 1938 Prestwich Heys A.F.C. North West Counties League Premier Division 1938 FK Radnički Svilajnac (formerly) (formerly) Serbian League East 1938 Réveil Sportif () Martinique Promotion d'Honneur 1938 Rothes F.C. Highland League Founded as junior team in 1907 1938 Rutgers Scarlet Knights men's soccer Big Ten Conference College soccer team 1938 Spartak Chernihiv () Folded, date unknown Existed as late as 1965 1938 Sporting Clube de Timor (formerly) (formerly) Liga Futebol Amadora Primeira Divisão 1938 Stal Stalowa Wola I liga 1938 FC Steel Trans Ličartovce (formerly) Folded in 2005 Merged with 1. FC Košice to form FC VSS Košice 1938 SV Trupial Aruban Division Uno (last known league) 1938 CS Tiligul-Tiras Tiraspol (formerly) Folded in 2009 1938 F.C. Tirsense Campeonato de Portugal Serie A 1938 Trojans F.C. Northern Ireland Intermediate League (last known league) 1938 Tromsdalen UIL 2. divisjon 1938 Ümraniyespor TFF First League 1938 FK Varnsdorf (formerly) Czech National Football League 1938 NK Vrapče (formerly) Treća HNL West ===Clubs Folded=== Date Folded Date Founded Club Country Note April 14 1906 Germania Bochum Forced to merge into VfL Bochum April 14 1908 TuS Bochum Forced to merge into VfL Bochum 1938 1893 Bathgate Played their last match in 1932 1938 1921 Cork FC Founded as Fords F.C. 1938 1924 Enosis Neon Trust British Cyprus 1938 June 10, 1913 Colțea București 1938 1933 Güneş SK 1938 1909 Hakoah Vienna Reformed in 1945 1938 1931 Stix, Baer and Fuller ==Births & Deaths== ===Births=== ====January–June==== Date of Birth Player Nationality Played For Managed Date of Death Other Notes January 2 Nodar Akhalkatsi Lokomotivi Tbilisi Lokomotivi Tbilisi Dinamo Tbilisi January 24, 1998 January 5 Piet Kruiver PSV Eindhoven Feyenoord DWS March 18, 1989 1965–66 Eredivisie top scorer January 8 Bobby Ferguson Newcastle United Derby County Cardiff City Barry Town Newport County Barry Town Newport County Ipswich Town Al-Arabi March 8, 2018 January 13 Tord Grip Degerfors AIK KB Karlskoga KB Karlskoga Örebro Malmö FF Campobasso Young Boys Assistant manager to Sven-Göran Eriksson (1998-2009, 2010) January 15 Chuni Goswami Mohun Bagan April 30, 2020 January 20 Derek Dougan Distillery Blackburn Rovers Aston Villa Peterborough United Leicester City Wolverhampton Wanderers June 24, 2007 January 21 Romano Fogli Torino Bologna AC Milan Catania Reggiana Foggia Livorno Siena September 21, 2021 Member of the Italian Football Hall of Fame January 22 Altair Fluminense Fluminense (interim) August 9, 2019 February 1 Heinz Steinmann Schwarz-Weiß Essen 1\\. FC Saarbrücken Werder Bremen March 18, 2023 February 7 Cayetano Ré Cerro Porteño Elche Barcelona Espanyol Eldense AD Almería Onteniente Córdoba Guaraní Cerro Porteño Club Necaxa Real Betis November 26, 2013 1964–65 La Liga top scorer February 9 Park Jong- hwan Korea Tungsten Company Seoul City Ilhwa Chunma Daegu FC October 7, 2023 February 17 Saul Malatrasi SPAL Fiorentina AS Roma Internazionale AC Milan Legnago Salus Pescara 2-time European Cup winner (1964–65, 1968–69) 3-time Intercontinental Cup winner (1964, 1965, 1969) February 20 Mahmoud El- Gohary Al Ahly Al-Ittihad Al Ahly Al-Sharjah Al-Ahli Jeddah Zamalek Al Wahda August 31, 2012 2-time African Cup of Nations winner (1959, 1998) 2-time African Cup of Champions Clubs winner (1982, 1993) March 6 Nikolai Manoshin Torpedo Moscow CSKA Moscow CSKA Moscow (assistant) February 10, 2022 March 8 Milan Galić Partizan Standard Liège Stade de Reims September 13, 2014 Gold medalist at the 1960 Summer Olympics 1960 European Nations' Cup runner-up 1965–66 European Cup runner-up Top scorer at the 1960 Summer Olympics and 1960 European Nations' Cup Finished 8th in the 1962 Ballon d'Or March 14 Árpád Orbán Győri ETO FC April 26, 2008 1964 Summer Olympics gold medalist March 16 Carlos Bilardo San Lorenzo Deportivo Español Estudiantes Estudiantes Deportivo Cali San Lorenzo Sevilla Boca Juniors 3-time Argentine Primera División winner (1959, 1967 Metropolitano, 1982 Metropolitano) 3-time Copa Libertadores winner (1968, 1969, 1970) 1968 Intercontinental Cup winner 1986 FIFA World Cup winner 1990 FIFA World Cup runner-up Gold medalist at the 1959 Pan American Games March 17 Adolf KnollWir trauern um Helmut Köglberger, Adolf Knoll und Alois Weinrich Wiener Sport-Club Austria Wien September 21, 2018 March 23 Bertie Auld Celtic Birmingham City Partick Thistle Hibernian Hamilton Academical November 14, 2021 1967 European Cup Final winner Member of the Scottish Football Hall of Fame April 19 Stanko Poklepović RNK Split RNK Split Solin Hajduk Split Budućnost Podgorica Borac Banja Luka APOEL Persepolis Publikum Celje Osijek Ferencváros December 24, 2018 April 22 Henk Groot Ajax Feyenoord May 11, 2022 May 5 Adolf Scherer CH Bratislava/Slovnaft Bratislava VSS Košice Nîmes Olympique Olympique Avignonais July 22, 2023 Finished second at the 1962 FIFA World Cup May 24 Jean-Claude Suaudeau FC Nantes FC Nantes May 29 Guy Calleja Bordeaux Gazélec Ajaccio Gazélec Ajaccio AS Cannes August 29, 2023 June 1 Dieter Klaußner Karlsruher SC FC Phönix Bellheim June 7 Armando Tobar Santiago Wanderers Universidad Católica Huachipato O'Higgins Audax Italiano Rangers de Talca Everton Santiago Wanderers November 18, 2016 Finished third at the 1962 FIFA World Cup June 7 Ian St John Motherwell Liverpool Hellenic Motherwell Portsmouth March 1, 2021 Member of the Scottish Football Hall of Fame June 15 Chus Pereda Real Madrid Sevilla Barcelona Mallorca Xerez CD September 27, 2011 1957–58 European Cup winner 1964 European Nations' Cup winner 1964 European Nations' Cup top scorer June 22 Virginio De Paoli Varese Pisa Venezia Brescia Juventus August 24, 2009 June 29 József Gelei MTK Vasas SC Tatabánya Tatabánya 1964 Summer Olympics gold medalist Finished third at the 1964 European Nations' Cup June 29 Giampaolo Menichelli AS Roma Sambenedettese Parma Juventus Brescia Cagliari June 30 Mike Hellawell Queens Park Rangers Birmingham City Sunderland Huddersfield Town July 18, 2023 ====July–December==== Date of Birth Player Nationality Played For Managed Date of Death Other Notes July 2 Marcel Artelesa AS Troyes-Savinienne AS Monaco Marseille Nice September 23, 2016 July 3 Sjaak Swart Ajax 3-time European Cup winner (1971, 1972, 1973) 1972 Intercontinental Cup winner July 6 Marquitos II Plus Ultra Cádiz Excelsior Rotterdam Blauw-Wit Amsterdam July 20, 2019 Brother of Marquitos July 6 Oleh Bazylevych Dynamo Kyiv Chornomorets Odesa Shakhtar Donetsk Desna Chernihiv Shakhtar Donetsk Dinamo Minsk Pakhtakor CSKA Moscow Slavia Sofia October 16, 2018 July 6 Uli Maslo Rot-Weiss Essen Racing Club Heemstede Schalke 04 Borussia Dortmund Eintracht Braunschweig Bahrain Riffa Club Qatar SC FC St. Pauli Fortuna Düsseldorf July 8 Vojtech Masný Jednota Trenčín First Vienna Silver medalist at the 1964 Summer Olympics July 12 Lin Shllaku Partizani Tirana Partizani Tirana (assistant) Besëlidhja August 8, 2016 July 18 John Connelly Burnley Manchester United Blackburn Rovers Bury October 25, 2012 1966 FIFA World Cup winner July 20 Roger Hunt Liverpool Bolton Wanderers September 27 2021 1965–66 Football League First Division top scorer 1966 FIFA World Cup winner July 24 José Altafini (Mazzola) Palmeiras AC Milan Napoli Juventus Chiasso Mendrisiostar 1958 FIFA World Cup winner 1962–63 European Cup winner July 28 Luis Aragonés Plus Ultra Real Betis Atlético Madrid Atlético Madrid Real Betis Barcelona Espanyol Sevilla Valencia Mallorca Fenerbahçe February 1, 2014 1974 Intercontinental Cup winner UEFA Euro 2008 August 2 Friedhelm Konietzka Borussia Dortmund 1860 Munich FC Winterthur FC Zürich BSC Young Boys Grasshoppers Hessen Kassel Bayer Uerdingen Borussia Dortmund FC Luzern March 12, 2012 August 9 Otto Rehhagel TuS Helene Altenessen Rot-Weiss Essen Hertha BSC 1\\. FC Kaiserslautern Saarbrücken Kickers Offenbach Werder Bremen Borussia Dortmund Arminia Bielefeld Fortuna Düsseldorf Bayern Munich 1\\. FC Kaiserslautern Hertha BSC UEFA Euro 2004 winning manager August 14 Bennie Muller Ajax SVV Scheveningen January 17, 2024 August 28 Đorđe Pavlić Vojvodina MSV Duisburg Schwarz-Weiß Essen May 9, 2015 September 2 John Angus Burnley June 8, 2021 September 8 José Torres Benfica Vitória Setúbal Estoril Estoril Estrela Amadora Varzim Boavista Portimonense September 3, 2010 1964–65 European Cup top scorer Finished third at the 1966 FIFA World Cup September 28 Peter Grosser Bayern Munich 1860 Munich Austria Salzburg SpVgg Unterhaching March 2, 2021 October 1 Les Scheinflug Sydney Prague Marconi Fairfield Western Suburbs Adelaide City Blacktown City Member of the Football Australia Hall of Fame October 7 Carlos Contreras Universidad de Chile Antofagasta Portuario Ferroviarios Deportes Aviación Rangers de Talca Unión La Calera Santiago Morning April 17, 2020 Finished third at the 1962 FIFA World Cup October 7 Mal Lucas Leyton Orient Norwich City Torquay United Gorleston March 2024 October 10 Pierre Mwana Kasongo Saint-Éloi Lupopo RCS Verviétois Gent SC Imana SC Imana Saint-Éloi Lupopo TP Mazembe US Bilombe SM Sanga Balende January 13, 1986 1968 African Cup of Nations winner October 23 Eugenio Fascetti Bologna Juventus Messina Lazio Savona FBC Varese Lecce Lazio Torino Hellas Verona Lucchese Bari Fiorentina Como October 18 Guy Roux Auxerre Limoges Auxerre Lens 2000 UEFA President's Award winner October 22 Alan Gilzean Dundee Tottenham Hotspur July 8, 2018 Member of the Scottish Football Hall of Fame October 22 César Luis Menotti Rosario Central Racing Club Boca Juniors New York Generals Santos Huracán Barcelona Boca Juniors Atlético Madrid River Plate Peñarol Independiente Sampdoria Rosario Central Club Puebla May 5, 2024César Luis Menotti obituary 1978 FIFA World Cup winner November 13 Rolando Serrano Cúcuta Deportivo América de Cali Unión Magdalena Millonarios Atlético Junior Cúcuta Deportivo June 13, 2022 November 18 Giancarlo Danova AC Milan Torino Catania Atalanta Fiorentina June 15, 2014 November 29 Johnny Crossan Derry City Sparta Rotterdam Standard Liège Sunderland Manchester City Middlesbrough KSK Tongeren December 2 Luis Artime Atlanta River Plate Independiente Palmeiras Nacional Fluminense Atlético Tucumán Atlanta 1971 Copa Libertadores winner 1971 Intercontinental Cup winner 1967 South American Championship top scorer December 9 Nikola Kotkov Lokomotiv Sofia Levski Sofia June 30, 1971 1964 Bulgarian Footballer of the Year 2-time A Group winner (1963–64, 1969–70) ===Deaths=== Date of Death Player Nationality Played For Managed Notable For January 9 David Calderhead Notts County Lincoln City Chelsea January 10 Jimmy Hampson Nelson Blackpool 1930–31 British Home Championship winner January 17 Eduard Garonne Grasshopper Club Zurich 1904–05 Swiss Serie A winner January 18 Luis Carvallo Colo-Colo 1933 Primera División de Chile top scorer January 28 Jack Sharp Aston Villa Everton Also played 3 Cricket test matches for the England cricket team February 6 Giuseppe Collino Juventus February 9 Gustaf Bergström Örgryte IS Brother of Swedish Olympic footballer Erik Bergström February 13 Enrico Bottazzi Reggiana March 7 Henry Jameson St. Rose Parish Bronze medalist at the 1904 Summer Olympics March 7 Robert Ogilvie Upton Park Clapham Rovers 1879–80 FA Cup winner March 17 Alfredo France Estrella del Mar Gold Cross March 27 Charlie Shaw Queens Park Rangers Celtic New Bedford Whalers New Bedford Whalers April 12 Karl-Erik Roslund HIFK Fotboll April 16 Steve Bloomer Derby County Middlesbrough Britannia Berlin 92 Derby County Real Unión Member of the Football League 100 Legends Member of the English Football Hall of Fame April 22 James Reid Airdrieonians 2-time Scottish Division One top scorer (1912–13, 1913–14) April 25 Giuseppe Lubatti Internazionale Torino Torinese May 17 Wilhelm Brekke Mercantile 1907 Norwegian Football Cup winner May 17 William Quash Upton Park Gold medalist at the 1900 Summer Olympics May 21 Frank Jefferis Southampton Everton Preston North End Southport 1914–15 Football League First Division winner May 22 Víctor Morales Colo-Colo Played at the 1928 Summer Olympics May 23 Gordon McDonald Galt F.C. Gold medalist at the 1904 Summer Olympics June 24 Tommy Dunn Wolverhampton Wanderers Burnley Thames Ironworks July 16 Trygve Aasen Moss August 21 Adolf Fischera () Wiener AC Wiener AF Borussia Neunkirchen First Vienna Borussia Neunkirchen August 26 Colin Veitch Newcastle United Bradford City 3-time Football League First Division winner (1904–05, 1906–07, 1908–09) 1909–10 FA Cup winner September 2 Ángel Arocha Tenerife Barcelona Atlético Madrid 1929 La Liga winner September 14 Dionys Schönecker () Rapid Wien Wiener Sport-Club Rapid Wien 12-time Austrian Bundesliga winner 3-time Austrian Cup winner (1918–19, 1919–20, 1926–27) 1930 Mitropa Cup winner September 19 Floriano Internacional Grêmio Fluminense Santos Atlético Mineiro Atlético Mineiro 1925 South American Championship runner-up 1937 Torneio dos Campeões winner September 23 Ernst-Alfred Thalmann FC Basel Member of the Grand Council of Basel-Stadt (1911–1937) October 27 Ingolf Olsen Mjøndalen IF October 30 Esteban Cifuentes FC Barcelona Levante RCD Espanyol Strasbourg Nîmes Olympique November 10 Santos Iriarte Racing Montevideo Peñarol 1930 FIFA World Cup winner November 16 Agustín Ojeda Club América Played at the 1928 Summer Olympics November 28 Svend Aage Castella KB 5-time Landsfodboldturneringen winner Silver medalist at the 1912 Summer Olympics December 9 Paul Eichelmann BFC Germania 1888 Union 92 Berlin December 9 Albert Eschenlohr FC Wacker München Tennis Borussia Berlin FSV Frankfurt Dresdner SC SV Polizei Lübeck Phönix Lübeck December 27 Ferruccio Corradino Squarcia Ascoli Awarded the Medal of Military Valor during the Spanish Civil War 1938 Juan Carlos Bertone Montevideo Wanderers Americano Comercial-SP 1938 Isidor Gansl Wiener AF Ferencváros Hakoah Vienna US Tunisienne 3-time Tunisian championship winner (1929–30, 1930–31, 1932–33) ==References==",
 "title": "1938 in association football"
}