{
 "id": "1140929",
 "text": "MCA DiscoVision, Inc. was a division of entertainment giant MCA (Music Corporation of America), established in 1969 to develop and sell an optical videodisc system. DiscoVision was the original name for what would later be known as the LaserDisc format. The format was intended as a home video distribution system using reflective optical discs.https://www.nytimes.com/1982/07/01/business/video-games-to-to- hollywood.html == History == MCA DiscoVision launched in Atlanta, Georgia, in 1978, with discs pressed in Carson and Costa Mesa, California. The company released titles from major studios, including Universal Pictures, Paramount Pictures, Warner Bros. Pictures, and Disney. There were also agreements with Columbia Pictures and United Artists, though no discs were released under the DiscoVision label from these studios. Eventually, several of these companies began releasing titles under their own labels. The first to do so was Paramount Home Video, which released a dozen films on the format in the summer of 1981. DiscoVision's quality issues with disc pressings led to a partnership between MCA and IBM to form DiscoVision Associates (DVA), aiming to improve the quality of the product. However, significant improvements were never realized. In 1981, responsibility for the LaserDisc format was sold to Pioneer Electronic Corporation. This partnership included the establishment of disc pressing plants in Japan and the creation of the Pioneer PR-7820 player, the first industrial model of a DiscoVision player, launched in 1978. == Decline and Legacy == In the same year (1981), MCA discontinued the DiscoVision branding, as the format was rebranded to LaserDisc under Pioneer’s ownership. MCA's LaserDisc releases were now produced by Pioneer under the new \"MCA Videodisc\" banner, which was later unified with VHS releases under the \"MCA Home Video\" name. Some of DiscoVision's technical staff later went on to form MCA Video Games, which focused on producing video game cartridges. == Films Released == DiscoVision released a number of films from major studios, including: * Jaws (1975) * The Godfather (1972) * Saturday Night Fever (1977) * The Four Seasons (1981) * And many more... == References == == Other websites == * DiscoVision Archive - Comprehensive history and discography of DiscoVision titles. Category:1969 establishments",
 "title": "DiscoVision"
}