{
 "id": "1140664",
 "text": "A Minor Civil Division (MCD) is a term used by the United States Census Bureau for primary governmental and/or administrative divisions of a county or county-equivalent, typically representing a municipal government such as a city, town, or civil township. MCDs are used for statistical purposes by the Census Bureau and do not necessarily reflect the primary form of local government. They range from non-governing geographical areas to municipalities with varying powers of self- government.https://www.census.gov/geo/reference/gtc/gtc_cousub.html == Overview == MCDs serve as subdivisions of counties and are primarily used by the Census Bureau for data collection. While some MCDs represent actual municipalities with significant governing authority, others may simply be geographic survey areas with little to no governing power. MCDs exist in 29 states, the District of Columbia, and Puerto Rico. In states where MCDs are not utilized, the Census Bureau uses Census County Divisions (CCDs) for similar purposes. == History == Before the 2010 census, 28 states used MCDs. However, in 2008, the state of Tennessee shifted from using CCDs to MCDs, bringing the total number of states utilizing MCDs to 29. == Structure == MCDs encompass various types of entities: * Townships – These are often found in states like Illinois and Iowa, and may either govern local affairs or exist as non-governing entities. * City – In states like New York, cities can function as MCDs, though some cities may span multiple counties, such as Chicago. * Parish – In Louisiana, the equivalent of MCDs are parish governing authority districts. * Villages – In some states like New Jersey, villages and boroughs act as MCDs. == Unorganized Territories == In some states, where state-defined MCDs are absent or incomplete, the Census Bureau creates unorganized territories to account for such regions. These are assigned special FIPS codes for statistical tracking. For example, when state boundaries extend into ocean areas (e.g., the Great Lakes), but MCDs are not defined, unallocated water areas are assigned the FIPS county subdivision code 00000 and an ANSI code of eight zeroes. == See also == * United States Census Bureau * Administrative division == References == Category:United States Census",
 "title": "Minor civil division"
}