{
 "id": "1140931",
 "text": "Octane Fitness, LLC v. ICON Health & Fitness, Inc. (572 U.S. 545) is a United States Supreme Court decision issued on April 29, 2014, which dealt with the standard for awarding attorney's fees in patent litigation under 35 U.S.C. § 285. The Court made it easier for courts to require the losing party to pay the attorney's fees of the prevailing party in cases deemed \"exceptional,\" which includes frivolous lawsuits. == Background == In the underlying lawsuit, ICON Health & Fitness, the company behind brands like NordicTrack and ProForm, sued Octane Fitness, a smaller manufacturer of elliptical machines, for patent infringement. ICON claimed that Octane's elliptical machines violated its patents. However, Octane Fitness argued that its products did not infringe ICON's patent, and the district court ruled in favor of Octane Fitness on summary judgment. After prevailing, Octane moved for reimbursement of its attorney's fees under 35 U.S.C. § 285, which allows courts to award fees in \"exceptional cases.\" The district court denied this motion, stating that ICON’s claims were not objectively baseless, even though they lost the case. == Supreme Court Decision == The United States Court of Appeals for the Federal Circuit affirmed the district court’s decision, and Octane Fitness appealed to the Supreme Court. The Supreme Court unanimously reversed the lower courts’ rulings. Writing for the Court, Justice Sonia Sotomayor held that the previous standard for awarding attorney's fees under § 285 was too rigid and imposed an unnecessarily high burden on prevailing parties. The Court stated that district courts should have discretion to determine whether a case is \"exceptional\" based on the totality of the circumstances, without needing to show that the losing party’s claims were \"objectively baseless.\" The ruling made it easier for courts to award attorney's fees in patent litigation, providing more leeway to deter frivolous or unreasonable lawsuits, often associated with so-called patent trolls. == Impact == The decision had a significant impact on patent litigation, especially concerning patent assertion entities (PAEs), which are often referred to as patent trolls. PAEs acquire patents primarily to profit from enforcement through litigation, rather than for developing or manufacturing products. The Court's ruling added a new risk for PAEs: the possibility of paying the other party's legal fees if their claims are deemed frivolous. The ruling also complemented another Supreme Court decision issued the same day, Highmark Inc. v. Allcare Health Management Systems, Inc., which clarified that appellate courts should review attorney fee awards for abuse of discretion rather than de novo. == Related pages == * Patent troll == References == == Other websites == * Full text of the opinion from the Supreme Court of the United States Category:United States Supreme Court cases",
 "title": "Octane Fitness, LLC v. ICON Health & Fitness, Inc."
}