{
 "id": "1140565",
 "text": "Catherine of York (14 August 1479 – 15 November 1527) was the sixth daughter of King Edward IV of England and his queen consort Elizabeth Woodville. After her father’s death and her uncle Richard III's usurpation of the throne, Catherine and her siblings were declared illegitimate. To protect her children, their mother moved them to Westminster Abbey for sanctuary. They lived there for about a year before returning to the royal palace. When Richard III died and Henry Tudor became King, the law declaring the children of Edward IV illegitimate was repealed. Henry VII then married Elizabeth of York, Catherine’s eldest sister, making Catherine a valuable diplomatic asset. Marriage plans were made for Catherine with John, Prince of Asturias, and later with James Stewart, Duke of Ross. Neither marriage took place. In 1495, Catherine married William Courtenay, the son and heir of the Earl of Devon, who supported Henry VII. In 1502, William was suspected of being involved in a conspiracy related to the Yorkist pretender Edmund de la Pole. He was arrested and lost his property and rights. Catherine, supported by her sister, was able to stay safe. After Henry VII’s death in April 1509, the new king forgave William and returned his estates. William’s father soon died. In May 1511, he regained the title of Earl of Devon. However, he died a month later from pleurisy. Catherine was now a widow at the age of 31. She took a vow of celibacy. In 1512, she received the right to manage her late husband’s possessions in Devon. Her ten-year-old son, Henry Courtenay, inherited the title of Earl of Devon. After her husband's death, Catherine rarely attended court, except for the christening of Princess Mary, daughter of Henry VIII, in 1516, where she served as godmother. Catherine was the head of a powerful family in Tiverton. She owned a large estate, allowing her to live comfortably. She died at Tiverton Castl at the age of 48. She was buried with great ceremony in the nearby parish church of St. Peter. Of all Edward IV's grandchildren, Catherine's children became the only ones who inherited claims to the English throne from the House of York. Category:English royalty Category:1479 births Category:1527 deaths Category:House of York Category:English princesses",
 "title": "Catherine of York"
}