{
 "id": "1140033",
 "text": "William \"Bill\" Conti (born April 13, 1942) is an American composer and conductor. He is best known for his scores in movies. == Early life == Conti was born in Rhode Island, and began studying piano at age seven. He received a Bachelor of Music degree from Juilliard School of Music in New York, followed by a master's. == Career == He composed his first musical score for a movie called Candidate for Killing. Conti playing piano was part of the score for the 1971 Oscar-winning Best Foreign Language Film, The Garden of the Finzi- Continis. Conti arrived in California in 1974, and started working as a music composer in Hollywood. He scored Harry and Tonto, which got him national attention. Soon after, he composed the score for Rocky (1976). https://www.laphil.com/musicdb/artists/1213/bill-conti He went on to score Rocky II (1979), Rocky III (1982), Rocky V (1990), Rocky Balboa (2006), The Karate Kid I (1984), The Karate Kid Part II (1986), The Karate Kid Part III (1989), The Next Karate Kid (1994), For Your Eyes Only (1981), Dynasty (and its sequel The Colbys), and The Right Stuff (1983), which earned him an Academy Award for Best Original Score. He also received nominations in the Best Original Song category for \"Gonna Fly Now\" from Rocky and for the title song of For Your Eyes Only. He was the musical director at the Academy Awards a record nineteen times. Conti is known for his collaborations with director John G. Avildsen, having scored fourteen movies for Avildsen, beginning with Rocky (1976), starring Sylvester Stallone, and ending with Inferno (1999), starring Jean-Claude Van Damme. Their collaboration included such pictures as the first three films in The Karate Kid franchise (1984–1989), Slow Dancing in the Big City (1978), The Formula (1980), and Neighbors (1981). The recipient of various accolades, including an Academy Award, five Emmy awards, https://www.laphil.com/musicdb/artists/1213/bill-conti and three Golden Globe nominations, his compositions have sold in excess of eight million albums.https://www.laphil.com/musicdb/artists/1213/bill-conti For his contributions to the entertainment industry, Conti received a star on the Hollywood Walk of Fame in 1989. In 1995, the American Society of Composers, Authors and Publishers (ASCAP) awarded Conti the Golden Soundtrack Award for lifetime achievement in film and television.https://www.laphil.com/musicdb/artists/1213/bill-conti == Personal life == Conti has said regarding his influences growing up, “In the 1950s and ’60s, the composers I grew up listening to, and who made the greatest impression on me, were Miklos Rozsa – and the soundtracks to his big brass-led Roman picture scores – and Lalo Schifrin who was an excellent composer. So I always wanted to write the big loud stuff”. https://www.gigslutz.co.uk/interview-bill-conti-always-wanted-play-big-loud- stuff/ Conti lives in a home built in 1924 in the Hancock Park section of Los Angeles.https://www.laphil.com/musicdb/artists/1213/bill-conti == References == Category:1942 births Category:American composers Category:People from Rhode Island Category:American conductors",
 "title": "Bill Conti"
}