{
 "id": "1140935",
 "text": "Williams v. Mississippi, 170 U.S. 213 (1898), was a landmark United States Supreme Court case that upheld the constitutionality of Mississippi’s voter registration provisions, which included a poll tax, literacy test, and the grandfather clause for voter eligibility. The plaintiff, Henry Williams, an African American man convicted of murder by an all-white jury, challenged the validity of these provisions under the Equal Protection Clause of the Fourteenth Amendment. == Background == In 1890, Mississippi adopted a new state constitution that included a number of provisions aimed at disenfranchising African American voters. These provisions included a poll tax, literacy tests, and a grandfather clause that allowed illiterate whites to vote if their grandfathers had voted before the American Civil War. The laws disproportionately affected African Americans, who, due to generations of inequality, were more likely to be poor and illiterate than whites. Williams was convicted of murder by an all-white jury, and he argued that his indictment was invalid because African Americans had been systematically excluded from jury service through the state's discriminatory voter registration laws. Under Mississippi's laws, only registered voters could serve on juries, and because African Americans were effectively disenfranchised, they were excluded from juries as well. == Legal argument == Williams' appeal claimed that the state’s voting laws violated the Fourteenth Amendment, as they were designed to disenfranchise African Americans and deny them equal protection under the law. He argued that because African Americans were excluded from voter rolls, they were also excluded from jury service, making his trial by an all-white jury inherently biased. == Decision == On April 25, 1898, the U.S. Supreme Court ruled unanimously against Williams in a 9–0 decision. Writing for the Court, Justice Joseph McKenna held that Mississippi’s voting laws were not discriminatory on their face and did not violate the Fourteenth Amendment, even if they resulted in the exclusion of African Americans from voting and jury service. McKenna noted that the laws could apply to all races equally, and any discrimination that occurred was the result of local officials' application of the laws, not the laws themselves. McKenna wrote: \"The constitution of Mississippi and its statutes do not on their face discriminate between the races, and it has not been shown that their actual administration was evil; only that evil was possible under them.\" == Aftermath == The Court’s decision allowed states across the South to continue using Jim Crow laws and voter registration requirements to disenfranchise African Americans. It was not until the passage of the Voting Rights Act of 1965 that these practices were finally overturned. == See also == * Jim Crow laws * Voting Rights Act of 1965 * Fourteenth Amendment to the United States Constitution * Literacy test * Poll tax == References == == Other Website == * Oyez: Williams v. Mississippi Category:United States Supreme Court cases",
 "title": "Williams v. Mississippi"
}