{
 "id": "1140642",
 "text": "France Nuyen Vannga (born ) was a French war survivor, stage and film actress, psychotherapist, and artistic model. Vannga immigrated to the United States in 1956, at the age of 16, and she was discovered by a film director. She decided to became a actress. Vannga starred in a number of multiple films, Liat (1958 film), In Love and War (1958 film), The Last Time I Saw Archie (1961 film), Satan Never Sleeps (1962 film, Diamond Head (1963 film), A Girl named Tamiko (1963 film), The Man in the Middle (1963 film), Dimension 4 (1965 film), Ah Toy, One More Train to Rob (1970 film), Slingshot (1971 film), The Big Game (1972 film), Colonization of the Planet of Apes (1973 film), Il blancho, il giallo, il nelo (1975 film), China Cry: A True Story (1990 film), Write to Kill (1991 film), The Joy Luck Club (1993 film), A Passion To Kill (1994 film), Angry Cafe (1995 film), A Smile Like Yours (1997 film), and The Battle of Shakher Heights (2003 film). == Biography == France Nyugen Vannga was born on in the city of Marseille, France, to parents Louis Vannga and Julie Vannga (née Mazaut). Her maternal family were French-born Romani people. World War II broke out in 1939 with the German, Slovak, and Soviet invasion of Poland. The Germans invaded and occupied northern France in 1940, but southern France became a collaborator to the Nazis, so they did not invade and occupy that part, and southern France became the famous independent Vichy France. The Germans and Vichy officers lost to the Allies their occupation in northern Africa, so the Germans feared that the Allies would gain control of Vichy France. As a result, the Germans quickly invaded and occupied Vichy France in November 1942. The Germans persecuted, deported, and murdered the Jews and Slavic peoples, as well as the Romani population, and so Vannga's mother was actually a Romani Holocaust survivor. Vannga herself was a war survivor, and she was well aware of war and hunger by age 6. Vanga left school aged 11, and immigrated to the United States in 1956, at the age of 16, and she was discovered by a film director. She starred in a number of multiple films, and was a successful actress. She also later became a psychotherapist, and a model. Category:French actors Category:1939 births Category:French models",
 "title": "France Nuyen Vannga"
}