{
 "id": "114045",
 "text": "Thomas the Tank Engine & Friends (otherwise referred to as Thomas & Friends, Thomas the Tank Engine or Thomas for short) is a British children's television series. It was first broadcast on CITV in September 1984. It is based on The Railway Series books by the Rev. W. Awdry and his son, Christopher. The main character is Thomas the Tank Engine, a tank engine that is painted blue. The show takes place on the made-up island of Sodor. There are some route systems there. One of them is a standard-gauge heritage railway run by Sir Topham Hatt known as the North Western Railway. Thomas runs on that route system. == Characters == The show is mainly about the locomotives, other machines, humans and other animals who populate the fictional Island of Sodor in the United Kingdom. Since 2004, the show has had eight main characters: * Thomas the Tank Engine * Edward the Blue Engine * Henry the Green Engine * Gordon the Big Engine * James the Red Engine * Percy the Small Engine * Toby the Tram Engine * Emily the Emerald Engine ==History== The first attempt to adapt Awdry's stories for television came in 1953, when the editor of the Railway Series books, Eric Marriott, was approached by the BBC, who wished to use live-action model trains to re-create two stories from Awdry's first book, The Three Railway Engines. 00 gauge Hornby Dublo models appeared on sets that reflected the style of the original illustrations. The first episode (based on \"The Sad Story of Henry\") was broadcast live on the evening of Sunday 14 June 1953 from Lime Grove Studios. The live broadcast did not fare well: a failure to switch the points caused the model of Henry to derail and it had to be replaced on the rails by one of the operators. The models moved jerkily, and all effects and music had to be superimposed. News of the broadcast hit the front pages of The Daily Telegraph and the Daily Mail. Awdry branded the episode \"unprofessional\", and the point-switching debacle an \"elementary mistake\". As a result, the second episode scheduled for 28 June 1953 was put on hold, and then later cancelled. The BBC offered Awdry and the Railway Series publishers greater creative control over the production, but the publishers declined, preferring to focus on publishing new books for the series. Nearly twenty years later, the BBC featured Awdry's stories in the television story-telling show Jackanory. Fourteen years before Thomas and Friends was aired, Ted Ray (sitting in a stationmaster's office) read five Railway Series books in episodes that aired between 20 September to 2 October 1970. ==Cast== ===Voices=== Current voices Actor Region Role(s) John Hasler UK Thomas (The Adventure Begins onwards) UK/US Rheneas (Season 20 onwards) Joseph May US Thomas (The Adventure Begins onwards) Christopher Ragland US Percy (Series 19 onwards) and Trevor (Season 20 onwards) UK/US Troublesome Trucks (The Adventure Begins onwards), a Passenger Tim Bain UK/US Aiden, Madeleine's Father, some Passengers and some Workmen (UK/US) David Bedella US Victor and The Mayor of Sodor UK/US Victor (Blue Mountain Mystery onwards) and The Cuban Man Sanjeev Bhaskar UK/US Shankar Sheena Bhattessa UK/US Noor Jehan and Charubala Hugh Bonneville UK/US Merlin Darren Boyd UK/US Theo Jonathan Broadbent UK/US Bill & Ben, and A Slip Coach Jamie Campbell Bower UK/US Skiff Chipo Chung UK/US Hong-Mei and Dr. Kim Flamina Cinque UK/US Ester and Dam Bella Nathan Clarke UK/US Alfie Olivia Colman UK/US Marion Sophie Colquhoun UK/US Frankie Laura Cucurullo UK/US Cassia, a Batucata Musician and Marcia Tina Desai UK/US Ashima and The Indian Fashion Designer Jonathan Forbes UK/US Connor Anna Francolini UK/US Gina, some Italian Children, and some Italian Passengers Teresa Gallagher UK Emily, Rosie, Mavis, Lady Hatt, Stephen Hatt (Diesel's Special Delivery), Bridget Hatt, The Duchess of Boxford, Bridget Hatt's Friends, The Teacher, The Laundry Lady, The School Children, The Girl in Red Dress, The Blond-hair Boy and Some Passengers UK/US Belle, Mavis (Series 17 onwards), Annie & Clarabel, Lady Hatt (Series 17 onwards), Judy and The Lady with the Big Hat Bob Golding UK/US Stephen, Sidney, Baz and Some Dock Workers Mike Grady UK/US Sir Robert Norramby Rasmus Hardiker UK/US Philip William Hope US Edward, Toby, Whiff, Bash, Rocky, Stephen Hatt, Farmer McColl, The Duke of Boxford, The Maithwaite Stationmaster (Double Trouble and Wonky Whistle only), Farmer Trotter, The Dock Manager, and The Wellsworth Station Worker UK/US Bert (Series 16 onwards) and A Railway Inspector Jim Howick UK/US Hurricane Siu-see Hung UK/US An An and the Chinese Women Togo Igawa UK/US Hiro Shane Jacobson UK/US Shane Rufus Jones UK/US Flying Scotsman Jules de Jongh US Emily, Rosie, Mavis (Hero of the Rails - Blue Mountain Mystery), Lady Hatt, Bridget Hatt, The Duchess of Boxford, Bridget Hatt's Friends, The Teacher, The Laundry Lady, The Blond-haired Boy and The School Children UK/US Alicia Botti Harriet Kershaw UK/US Jenny Packard and Darcy Steven Kynman UK Porter, Jack, and The Dock Manager (Tale of the Brave only) US Butch (Series 17 onwards) and a Child UK/US Duck, Peter Sam, Dart (Series 17 onwards), Paxton, A Slip Coach, and A Railway Inspector Francisco Labbe UK/US Gustavo and a Batucata Musician Michael Legge UK/US Luke Dan Li UK/US Yong Bao and Chinese Railway Inspector Windson Liong UK/US Yin-Long and the Chinese Men Montserrat Lombard UK/US Mia and some Italian Passengers Monica Lopera UK/US Gabriela Antoino Magro UK/US Stefano, the Italian Stationmaster, and some Italian Workmen Clive Mantle UK/US Gator David Menkin US Porter and Jack Genevieve McCarthy UK/US Aubrey Matt McCooey UK/US Kenji Ian McCue UK/US Tiger Hunter #1 and The Crown Thief 1 Colin McFarlane UK/US Bulgy and Beresford Rachael Louise Miller UK/US Rebecca Joe Mills UK/US Donald (Sodor's Legend of the Lost Treasure and The Great Race only), Douglas, Oliver, Toad, Skiff and The Welsh Bird Watcher Lucy Montgomery UK/US Lexi, Hannah and Carly Vincenzo Nicoli UK/US Lorenzo, Beppe, An Italian Workman, and some Italian Passengers Rebecca O'Mara UK/US Caitlin and A Slip Coach Maggie Ollerenshaw UK/US Henrietta Nikhil Parner UK/US Rajiv, the Indian Friendly Stationmaster, the Indian Grumpy Stationmaster, and the Indian Troublesome Trucks Rosamund Pike UK/US Duchess Nigel Pilkington UK Trevor Gabriel Porras UK/US Emerson and Fernando Miranda Raison UK/US Millie and The Knapford Station Speaker (Missing Gator) Rob Rackstraw UK/US Donald (Season 20 onwards), Bradford, Monty and Flynn (Season 19 onwards, excluding Toad and the Whale) UK Toby (season 19 onwards) US James (The Adventure Begins onwards) and Stanley (Season 20 onwards) Eddie Redmayne UK/US Ryan John Schwab UK/US Vinnie Peter Andre UK/US Ace Yvonne Grundy UK/US Nia Kerry Shale US Henry, Gordon, James (Hero of the Rails - Season 18), Dash, Scruff, Harold, Kevin, Sir Topham Hatt (Hero of the Rails - Season 18), Mr. Percival, Sir Lowham Hatt, The Maithwaite Stationmaster (Time For a Story and A Blooming Mess only), A Railway Inspector, The Railway Coal Inspector, The Zoo Keeper, and Workmen UK The Zoo Keeper (Not Now, Charlie! only) UK/US Diesel (UK, Season 13 onwards, US, season 19), 'Arry, Bert (Series 14 - 15), Max, Beau, and Some groaning passengers (Calm Down Caitlin) Tom Stourton UK/US Duncan, Rex and Terence Federico Trujillo UK/US Raul, a Batucada Musician, a Brazilian Workman and Marcio Tim Whitnall UK The Deputy Minister UK/US Timothy, Mike, Oliver (Excavator), Jerome, Duke and Reg Keith Wickham UK Edward, Henry, Gordon, James, Percy, Whiff, Dash, Harold, The Mayor of Sodor, The Thin Controller, Sir Lowham Hatt, Mr. Bubbles, The Railway Coal Inspector, The Man at the Fire, The Wellsworth Station Worker, The Wellsworth Stationmaster, Some Workmen, Some Passengers, Gator's Driver, A Steamworks Worker, A Groundsman, and A Postman UK/US Harvey, Skarloey, Sir Handel, Bert (Arlesdale Railway), The Fat Controller (UK, Season 13, US, The Adventure Begins onwards), Salty, Den, Norman, Stafford, Bertie (Series 17 onwards), Captain, Dowager Hatt, A Railway Inspector, The Great Composer, The Maron Station Speaker, The Fat Controller's Assistant, Thomas' Guard, The Grumpy Passenger, and Father Christmas Robert Wilfort UK/US Samson Matt Wilkinson UK Spencer, Stanley, Charlie, Bash, Scruff, Victor (Hero of the Rails - Series 16), Rocky, Cranky, Butch (Series 16 onwards), Kevin, Stephen Hatt, Farmer McColl, The Duke of Boxford, The Photographer, The Maithwaite Stationmaster, Farmer Trotter, The Knapford Stationmaster, The Bird Watcher, The Dock Manager, A Railway Inspector, Some Dock Workers, The Island Inspector, The Sodor Search & Rescue Centre Manager, The Blue Mountain Quarry Workman, and The Zoo Keeper UK/US Diesel 10, Rusty, Winston, and Merrick Glenn Wrage US Spencer, Charlie (Series 13 - 15), Ferdinand, Cranky, Butch (Series 15 - 16), The Sodor Search & Rescue Centre Manager, Gator's Driver, and A Steamworks Worker Former voices Actor Region Role(s) Martin Sherman US Thomas (Hero of the Rails - Series 18), Percy (Hero of the Rails - Series 18), Diesel (King of the Railway - Series 18), and some children (Toby and Bash) Ben Small UK Thomas (Hero of the Rails - Series 18), Toby (Hero of the Rails - Series 18), and Ferdinand (Misty Island Rescue - Series 16) US Stanley (Series 15 - 18) and Charlie (Series 16 - 18) UK/US Rheneas (Blue Mountain Mystery - Series 18), Flynn (Series 17, only), Troublesome Trucks (Series 16 - 18) and Owen (Blue Mountain Mystery - Series 18) Michael Brandon US Diesel (Series 13 - Blue Mountain Mystery), Mr. Bubbles (Series 13 - 15), and The Knapford Stationmaster (Series 13 only) Rupert Degas UK Butch (Series 15 only) UK/US Diesel 10 (Misty Island Rescue; original cut only), Dart (Series 15 - 16), Flynn (Series 15 - 16), and Bertie (Series 15 - 16) ===Narrators=== ====United Kingdom==== * Ringo Starr (Series 1-2, 1984-1986) * Michael Angelis (Series 3-16, 1991-2012) * John Hasler (Series 22-24, in-character as Thomas, 2018-2021) ====United States==== * George Carlin (Series 1–4, 1984-1995) * Alec Baldwin (Series 5–6, 1998-2002) * Michael Brandon (Series 7-16, 2003-2012) * Joseph May (Series 22-24, in- character as Thomas, 2018-2021) ====Both==== * Pierce Brosnan (The Great Discovery, 2008) * Mark Moraghan (Series 17-21, 2013-2017) ==Notes== ==References== == Other websites == * * Category:British children's television series Category:Thomas and Friends Category:Cartoon Network series Category:Channel 5 (UK) television programmes Category:English-language television programs Category:Internet memes Category:Television series about friendship Category:1984 television series debuts Category:1980s British television series debuts Category:1980s British television series Category:1980s animated television series Category:1990s British television series Category:1990s animated television series Category:2000s British television series Category:2000s animated television series Category:2010s British television series Category:2010s animated television series Category:2020s British television series Category:2020s animated television series Category:2020s British television series endings Category:2021 television series endings",
 "title": "Thomas & Friends"
}