{
 "id": "1140431",
 "text": "Michael Marcotte (born 1971) is an American businessperson, security expert, and government advisor. He co-founded the National Cybersecurity Center, an agency that works with governments and companies on computer security. == Early life == He grew up in Colorado and attended The Denver School for the Gifted and Creative, now called The Logan School for Creative Learning. == Career == In 2006, he became Global CIO at EchoStar, a company that launches satellites for communications. The company is part of the Fortune 500. EchoStar owns Hughes, Sling TV, Dish, Dish Mexico and other companies that provide television, Internet and mobile services. He stood down from the role in 2014. He also served as Global Chief Digital Officer at EchoStar and President of Hughes Cloud Services. In 2010, he served on the transition team of Senator John Hickenlooper when he was elected governor of Colorado. He was also chairperson of the Colorado Technology Association. In 2016, he co- founded the National Cybersecurity Center in Colorado Springs, Colorado. It works with companies and governments to improve national security and computer security. He was chairperson of the organisation's Rapid Response Center, which responds to emergency computer security threats. Between 2010 and 2017, he was a board member at the Office of Economic Development and International Trade. In 2023, he founded computer security company artius.iD. He is known for his views on computer hacking by Russia and China, computer security threats from artificial intelligence, and deepfakes. He has spoken about computer attacks on human resources, banks, hospitals, transport systems, and insurance. He has influenced computer security policies in the United States. He joined the Board of anti-trafficking non-profit More Too Life in 2024. He has won the NASA Award for Engineering Excellence twice and the United States Air Force Award of Engineering Excellence. == References == Category:1971 births Category:Living people Category:American chief executives Category:Businesspeople from Denver Category:American company founders",
 "title": "Michael Marcotte"
}