{
 "id": "1140250",
 "text": "Children in Sub-Saharan Africa are sometimes accused of witchcraft. They are called witch children. People believe that some of these children can use bad spells of witchcraft from birth. There have been a number of such cases that got international attention in the first decade of the 21st century. The phenomenon of witch-hunts in Sub-Saharan Africa is ancient. In these countries there are many charismatic churches, which combine the belief of the people in animism and witchcraft with Christianity. The problem is \"on the rise\", due to preachers such as Helen Ukpabio. Other factors that add to the problem,are \"urbanization, poverty, conflict and fragmenting communities\". == Targets == Criteria that show someone is a witch child are almost the same across all of Subsaharan Africa: * Children born before the regular duration of pregnancy of nine months * Chrildren who aren't born head first * Children born with teeth, or who get their first teeth before they are eight months old * Children who start walking early, at 7 or 8 months * Children born with birth defects, or a mental retardation * Children behaving in strange ways * Multiple births (twins and triplets), or albinos == Practice == Recent reports by UNICEF, United Nations High Commissioner for Refugees, Save the Children and Human Rights Watch have also highlighted the violence and abuse towards children accused of witchcraft in Africa. Accusations of witchcraft in Africa are a very serious matter: the witch is culturally understood to be repsonible for all evil and the cause of all misfortune, disease and death. Consequently, the witch is the most hated person in African society and subjected to punishment, torture and even death. The victims of witchcraft accusations in African societies have usually been the elderly, the disabled, albinos and anyone who was considered different. In recent years due to the impact of rapid urbanisation, economic decline, as well as the HIV/AIDS pandemic, children have become more and more the victims of witchcraft accusations, especially orphans. Other factors of the rise of accusations include the rise of charismatic preachers, generational social conflicts and the deterioration of education systems. Religiously-inspired movies also legitimize beliefs about children witches. Child victims of witchcraft accusations are more vulnerable than adult victims as they cannot defend themselves as they are confronted with physical and psychological abuse from their family and community. Children accused of witchcraft may be subjected to violent exorcism rituals by African Pentecostal-Charismatic pastors who mix Christianity with African witchcraft beliefs. Such exorcism may include incarceration, starvation, being made to drink hazardous substances or even being set on fire with gasoline. In other cases accused children are expelled and end up living on the streets, are trafficked and in some instances they are killed. == Spread to the UK == Research by Leo Ruickbie has shown that the problem of child witchcraft accusations is spreading from Africa to areas with African immigrant populations. In some cases this has led to ritualised abuse and even murder, particularly in the UK with such high-profile cases as that of Kristy Bamu in 2010. == References == Category:Child abuse",
 "title": "Witch child"
}