{
 "id": "1140930",
 "text": "A patent holding company (PHC) exists to hold patents on behalf of one or more other companies. Unlike operating companies, PHCs typically do not manufacture products or provide services based on the patents they hold. Their main function is patent ownership, which can be used for licensing purposes or strategic management of intellectual property. == Purpose == Patent holding companies may be formed for several reasons: * Tax considerations: Some companies use PHCs to benefit from tax advantages. For example, a company might transfer ownership of patents to a subsidiary in a jurisdiction with favorable tax laws. * Licensing management: PHCs may manage the licensing of patented technologies. They sometimes organize patent pools, which provide a single source for companies to license multiple patents from different holders. This is common in industries like telecommunications and electronics, where complex technologies rely on numerous patents. == Patent Assertion Entities (PAEs) == Patent holding companies that aggressively enforce their patents through litigation or threats of litigation are referred to as patent assertion entities (PAEs). These entities typically do not manufacture products or provide services themselves but focus solely on enforcing patent rights. PAEs have been criticized for engaging in what is commonly known as patent trolling. == Criticism and Patent Trolling == Patent trolls are companies or individuals that acquire patents primarily to profit from enforcing them against alleged infringers, rather than for developing or marketing the technology themselves. On June 4, 2013, the National Economic Council and the Council of Economic Advisers in the United States released a report entitled \"Patent Assertion and U.S. Innovation,\" which found that PAEs harm the economy by hindering innovation and imposing significant legal costs on companies. The report made several recommendations to curb the negative effects of PAEs. In the same year, President Obama expressed criticism of companies that do not produce anything but instead leverage others' inventions to extract payments through patent claims. He stated that such behavior stifled innovation and entrepreneurship. == Examples of Patent Holding Companies == Some well-known examples of patent holding companies or PAEs include: * Intellectual Ventures – One of the largest patent holding companies, focused on acquiring and licensing patents. * Acacia Research Corporation – A company that partners with patent owners to license and enforce their intellectual property rights. == See also == * Patent troll * Patent pool * Patent law * Intellectual property == References == == Other Webistes == * United States Patent and Trademark Office (USPTO) – Official site for U.S. patents. * Obama White House Archive on Patent Assertion Category:Companies",
 "title": "Patent holding company"
}