{
 "id": "1140724",
 "text": "Ekkehard Franz Knobelspies (born July 10, 1967, in Konstanz, Germany) is a German entrepreneur and consultant. He is best known for ranking the \"World's 101 Best Steak Restaurants.\" == Early Life == Ekkehard Knobelspies was raised in a conservative, Catholic, entrepreneurial, and sports-oriented family in Radolfzell, located on Lake Constance. He is the great-grandson of August Kratt and also related to Barbara Rockefeller, married to Margarete Knobelspies (née Pohlig), a great-great-granddaughter of Professor Julius Pohlig, the world’s leading cable car engineer at the beginning of the 20th century. Knobelspies played tennis when he was young. He trained with important coaches like Nick Bollettieri and Harry Hopman. He was the runner-up in the Baden Youth Championships and a finalist in the German International Championships (Sport Scheck Youth Cup). He competed in several tournaments as part of the ITF World Juniors Tour in Switzerland and Florida, playing against notable opponents including Boris Becker and Thomas Muster, both of whom later achieved the world number one ranking in tennis. After completing his secondary education, Knobelspies pursued language studies in Paris and Valencia through an exchange program. He later participated in a college tennis exchange at Houston Baptist University in Texas before returning to Germany to complete his military service at the Bundeswehr site in Pfullendorf. == Career == Knobelspies began his professional career in international five-star hospitality, training as a hotel manager at the InterContinental Hotel Düsseldorf. He eventually left the hotel industry as Sales Director of the Excelsior Hotel Ernst in Cologne, a member of the Leading Hotels of the World. After this, he worked for leading brand communications companies. His client portfolio includes brands like Mercedes- Benz, Deutsche Bank, and Coca-Cola. He then moved to London and worked with FTSE500 companies like HSBC, Allianz, and Jaguar Land Rover. Knobelspies is the founder of the \"World's 101 Best Steak Restaurants\" list and now works as a consultant for many companies in the hospitality and real estate industry. His clients have included family offices, A-list celebrities, and blue chip companies. He has worked with ultra high net-worth individuals such as Countess Heidi Horten, Alexander Chesterman and fashion model Naomi Campbell. He currently is writing a book titled So Rich and Yet So Poor, planned to be released next year. Knobelspies has been described by Monocle Magazine as a multifaceted, successful, and versatile entrepreneur and personality. == Personal Life == Knobelspies is involved in helping protect endangered animals, is a passionate hunter and conservationist, he advocates for biodiversity in both rural and urban areas, guided by his personal motto: \"We must eat what we want to protect.\" He currently resides with his wife in London and the South of France. == References == Category:1967 births Category:Living people Category:German businesspeople",
 "title": "Ekkehard Knobelspies"
}