{
 "id": "1140246",
 "text": "Mathias Honsak (born December 20, 1996 in Vienna) is an Austrian football player. He plays as midfielder for 1. FC Heidenheim in the German Bundesliga. ==Career == Honsak began his football career at Floridsdorfer AC. In 2007 he moved to the youth department of FK Austria Wien. He went on to FC Stadlau. There he was also used in the first team. In 2014 he moved to FC Liefering. In January 2016 he was loaned to the Bundesliga club SV Ried. FC Red Bull Salzburg After the loan ended he was promoted to the FC Red Bull Salzburg squad. He also continued to play for FC Liefering as a cooperation player. In his first game after returning, he scored the winning goal to make it 2-1 in Lieferinger's game against Kapfenberger SV. Bundesliga.at In August 2017 he was loaned to league rivals SCR Altach. In July 2018 he was loaned to second division club Holstein Kiel in Germany until the summer of 2019. The striker did not return to Austria for the 2019/20 season. He moved to the German second division club SV Darmstadt 98. On August 4, 2019, he made his debut in the 2-0 home win against Holstein Kiel transfermarkt.deIn his first season in Darmstadt he made 24 appearances and two goals. In the next season he was used in 30 games. He scored five times. In the 2022/23 season, the team achieved second place and was promoted to the Bundesliga. Honsak ended the 2023/24 season with SV Darmstadt in a relegation zone and the club was relegated back to the 2nd Bundesliga. In the summer of 2024, Honsak moved to Bundesliga club 1. FC Heidenheim. ==International== Mathias Honsak was in the Austrian U19 national team squad. He made his debut on September 5, 2014 in a friendly against Switzerland. In March 2017 he made his debut for the U21 team against Australia. Ralf Rangnick called the 26-year-old into the senior national team squad for the first time in March 2023. However, due to injury, he was unable to follow the call-up. ÖFB ==References== Category:1996 births Category:Living people Category:Austrian footballers Category:Association football midfielders Category:FC Liefering players Category:Austrian football midfielders",
 "title": "Mathias Honsak"
}