{
 "id": "1140000",
 "text": "Lee M. Russell was an American Democratic party politician who served as governor of Mississippi from 1920 to 1924. Prior to this, he graduated from the University of Mississippi in 1901 and enrolled in the university’s law school. He completed the course in 1903 and launched a political career while practicing law.[Lee Maurice Russell (1875–1943) Fortieth Governor, 1920–1924 by David G. Sansing, University of Mississippi] He later served in both the Mississippi House of Representatives and State Senate.Encyclopedia of Mississippi by Nancy Capace, 2001, P.128 During his time as a member of the state legislature he introduced a bill aimed at prohibiting secret and exclusive societies at the public institutions of higher learning, which was enacted into law. This law remained in effect for 14 years.[Lee Maurice Russell (1875–1943) Fortieth Governor, 1920–1924 by David G. Sansing, University of Mississippi] From 1916 to 1920 he served as lieutenant governor under Theodore G. Bilbo.Encyclopedia of Mississippi by Nancy Capace, 2001, P.128 Bilbo backed Russell as his handpicked successor,The Ku Klux Klan in Mississippi A History By Michael Newton, 2009, P.68 who then ran for the position of governor himself and won the general election without opposition.Encyclopedia of Mississippi by Nancy Capace, 2001, P.128-129 Various reforms were carried out during Russell's time as governor.Mississippi A History by Westley F. Busbee, P.220Title: Labor Legislation of 1920 : Bulletin of the United States Bureau of Labor Statistics, No. 292, P.51Title: Labor Legislation of 1922 : Bulletin of the United States Bureau of Labor Statistics, No. 330, P.23-24American labor legislation review v.11-12 1921-1922, P.237American labor legislation review v.11-12 1921-1922, P.243 Russell re-established his law practice after stepping down from office.Encyclopedia of Mississippi by Nancy Capace, 2001, P.129 ==References == Category:Governors of Mississippi Category:20th-century American politicians Category:Democratic Party (United States) politicians",
 "title": "Lee M. Russell"
}