{
 "id": "1141320",
 "text": "The Meitei diaspora, also known as the Manipuri diaspora, comprises individuals of Meitei ethnicity (or Manipuri people), who have migrated from their ancestral homeland in Manipur, a state in northeastern India, to various regions across the world. Historically, movements of Meitei populations have occurred due to political, economic, and educational factors, as well as regional instability, most significantly during the Seven Years' Devastation of Manipur Kingdom. Notable Meitei communities exist in neighboring countries such as Myanmar and Bangladesh, as well as in more distant locations including the United Kingdom, the United States, Australia, Canada, Korea and the Gulf states. The diaspora maintains varying degrees of cultural, linguistic, and social ties to Manipur, while also adapting to the contexts of their host societies. == Geographical distribution == The Meitei diaspora is geographically dispersed across several countries. In Australia, they are primarily concentrated in the cities of Sydney and Melbourne. In Bangladesh, a significant number reside in the Sylhet division. In Canada, notable communities are established in Montreal of Quebec, and Toronto of Ontario. In Myanmar, Meitei populations are found mainly in the eastern states of Kachin and Shan, as well as in the Yangon, Sagaing, and Ayeyarwaddy administrative divisions. South Korea hosts a visible Meitei presence in the city of Anseong, near Seoul. In the United Kingdom, Meitei individuals are present in regions including Kent, Worcester, Nottingham, Hertfordshire, and Sheffield. In the United States, the diaspora was initially more widely dispersed, with smaller populations in states such as New Jersey, Illinois, Texas, Pennsylvania (notably in Philadelphia), North Carolina, Washington, D.C., and California,Routledge Handbook of Asian Diaspora and Development. United Kingdom: Taylor & Francis, 2021. p. 107-121 but later settled in Virginia, Maryland, North Carolina, Texas, New Jersey, Massachusetts, Connecticut, Ohio, Indiana, Illinois, Michigan, Missouri, Tennessee, Alabama, and Florida. == Clothing == == Dance and music == Khamba Thoibi Jagoi dance (), also known as Thoibi Jagoi (), is performed in Bangladesh, the United Kingdom, among others. Leima Jagoi () is performed by the Meitei diaspora community in Canada, the United States, among others. Maibi Jagoi dance () is performed in Australia, Bangladesh, among others. Pung Cholom dance () is performed by the Meitei diaspora community in Canada, among others. Thabal Chongba dance (), also known as Thabal dance (), is performed by the Meitei diaspora community in Bangladesh, Canada, Korea, the United States, among others. == Festivals == Cheiraoba (), or Sajibu Cheiraoba (), is celebrated by Meitei diaspora diaspora community in Australia, Korea, the United States, among others.Routledge Handbook of Asian Diaspora and Development. United Kingdom: Taylor & Francis, 2021. p. 107-121 Lai Haraoba in Bangladesh and Lai Haraoba in Myanmar are notable celebrations of Lai Haraoba () outside India. In Bangladesh, it was celebrated with the help of the UNESCO and the Government of Bangladesh in 2025. Ningol Chakouba () or Ningol Chakkouba () is celebrated by Meitei diaspora diaspora community in Australia, Bangladesh, Canada, Korea, the United Kingdom, the United States, among others.Routledge Handbook of Asian Diaspora and Development. United Kingdom: Taylor & Francis, 2021. p. 107-121 Yaoshang or Yaosang () is celebrated by Meitei diaspora diaspora community in the United States, among others.Routledge Handbook of Asian Diaspora and Development. United Kingdom: Taylor & Francis, 2021. p. 107-121 == Language == Meitei language (also known as Manipuri language) is the common linguistic identity of all the diaspora members belonging to the Meitei ethnicity (or the Manipuri people) living across the globe. In Bangladesh, the Meitei language may disappear in the next generation because many Meitei people are now speaking Bengali more fluently than their own language. In Myanmar, most Meiteis still speak their native language. However, some younger Meiteis have stopped speaking it after converting to Buddhism, as Burmese language is more socially accepted in the Buddhist society in their country. Second-generation and third-generation Meitei people in the United States may have limited proficiency in Meiteilon (Manipuri language) and are typically more comfortable with English.Routledge Handbook of Asian Diaspora and Development. United Kingdom: Taylor & Francis, 2021. p. 107-121 == Associations and organizations == * Association of Meiteis in the Americas (AMA) * Bangladesh Manipuri Sahitya Sangsad * European Manipuri Association (EMA) * Korea Manipuri Association (KMA) * Manipuri Association of Canada (MAC) * Meithei/Kathe Ethnic Literature and Culture Association * North American Bangladesh Manipuri Society * North American Manipuri Association (NAMA)Routledge Handbook of Asian Diaspora and Development. United Kingdom: Taylor & Francis, 2021. p. 107-121 * United Meitei Language and Cultural Group == Related pages == * Burmese–Meitei relations ** Chahi Taret Khuntakpa ** Meitei–Shan relations * Ahom–Meitei relations * Meitei monuments in Bangladesh * Meitei people in Assam * Meitei people in Karnataka * Meitei people in Maharashtra * Meitei people in Meghalaya * Meitei people in Nagaland * Meitei people in Tripura * Meitei people in West Bengal == Bibliography == * Manipuri Diaspora Identity And Culture In India And Various Countries == References == Category:Meitei people Category:Immigration",
 "title": "Meitei diaspora"
}