{
 "id": "114163",
 "text": "Aude is a department in the region of Occitanie in southern France. It is named after the Aude river. The inhabitants of the Aude are known, in French, as Audois (women: Audoises). ==History== Aude was created in 1790 during the French Revolution, when the whole of France was divided into departments, replacing the old provinces. Aude was formed with part of the old province of Languedoc. It was divided in six districts: Castelnaudary, Carcassonne, Narbonne, Lagrasse, Limoux and Quillan, with Carcassonne as is capital. In 1800, with the creation of the arrondissements in France, the six districts were changed into four arrondissements: Carcassonne, Castelnaudary, Limoux and Narbonne. On 10 September 1926, the arrondissement of Castelnaudary was eliminated. ===Early forms of habitation=== A skull was found, and named Homme de Tautavel (Tautavel Man). It was found in a cave on the site called Caune de l'Arago, near Tautavel. The fossils are between 300.000 and 450.000 years old. There are over 80 fragments; the skull belonged to a man in his twenties. He was about 1.65 m, and weighed around 45–55 kg. Other remains are two mandibles, belonging to a woman in her fifties, and to a man, about 20 to 25 years old. It looks like they did not know how to use fire yet. It also looks like they might have been cannibals, or that they preferred to scavenge for food, rather than hunt. Some bones of rhinoceros, horses, wild sheep (called Mouflon), Tahrs (resemble wild goats), Muskox (a type of bovine), deer, and reindeer were found in the cave. There is an ongoing debate if this hominian is directly related to the Neanderthal. If they are not they would be Homines erecti (currently they are classified as H. erectus Tautavelensis). If they are direct predecessors of the Neanderthals, they would be Homo heidelbergensis. ==Geography== Aude has an area of . It is surrounded by the departments of Pyrénées-Orientales, Ariège, Haute-Garonne, Tarn, and Hérault, with the Gulf of Lion (Mediterranean Sea) on the east. The main river in the department is the Aude river which gives its name to the department. Other important rivers are Fresquel and Orbieu; these two rivers are tributaries of the Aude river. The highest point in the department is the Pic de Madrès (), in the French Pyrenees; it is high. ==Administration== The département is managed by the Departamental Council of Aude in Carcassonne. Aude is part of the region of Occitanie. ===Administrative divisions=== There are 3 arrondissements (districts), 19 cantons and 436 communes (municipalities) in Aude. INSEE code Arrondissement Capital Population (2014) Area (km²) Density (Inh./km²) Communes 111 Carcassonne Carcassonne 161,442 2,668.1 207 112 Limoux Limoux 44,467 1,780.9 147 113 Narbonne Narbonne 159,569 1,690.0 82 The following is a list of the 19 cantons of the Aude department (with their INSEE codes), following the French canton reorganisation which came into effect in March 2015: # La Piège au Razès (1101) # Carcassonne-1 (1102) # Carcassonne-2 (1103) # Carcassonne-3 (1104) # Le Bassin chaurien (1105) # Les Basses Plaines de l'Aude (1106) # Les Corbières (1107) # Le Lézignanais (1108) # La Région Limouxine (1109) # La Malpère à la Montagne Noire (1110) # Narbonne-1 (1111) # Narbonne-2 (1112) # Narbonne-3 (1113) # La Haute-Vallée de l'Aude (1114) # Le Haut-Minervois (1115) # Le Sud-Minervois (1116) # Les Corbières maritimes (1117) # La Montagne d'Alaric (1118) # La Vallée de l'Orbiel (1119) ==Demographics== The Aude department has a population, in 2014, of 365,478, for a population density of inhabitants/km2. The arrondissement of Carcassonne, with 161,442 inhabitants, is by far the largest. The other two arrondissements, Limoux and Narbonne, have respectively 44,467 and 159,569 inhabitants. Evolution of the population in Aude Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:375000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:25000 start:0 ScaleMinor = gridcolor:lightgrey increment:12500 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2008 text:2008 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 278323 bar:1975 from:0 till: 272366 bar:1982 from:0 till: 280686 bar:1990 from:0 till: 298712 bar:1999 from:0 till: 309770 bar:2008 from:0 till: 349237 bar:2014 from:0 till: 365478 PlotData= bar:1968 at: 278323 fontsize:S text: 278,323 shift:(-12,5) bar:1975 at: 272366 fontsize:S text: 272,366 shift:(-18,5) bar:1982 at: 280686 fontsize:S text: 280,686 shift:(-18,5) bar:1990 at: 298712 fontsize:S text: 298,712 shift:(-18,5) bar:1999 at: 309770 fontsize:S text: 309,770 shift:(-18,5) bar:2008 at: 349237 fontsize:S text: 349,237 shift:(-18,5) bar:2014 at: 365478 fontsize:S text: 365,478 shift:(-18,5) The main cities in the department are: City Population (2014) Arrondissement Narbonne 52,855 Narbonne Carcassonne 45,941 Carcassonne Lézignan-Corbières 11,248 Narbonne Castelnaudary 11,096 Carcassonne Limoux 10,275 Limoux Coursan 5,916 Narbonne Port-la-Nouvelle 5,635 Narbonne Sigean 5,473 Narbonne Trèbes 5,498 Carcassonne ==Gallery== File:Coursan, l'Aude.jpg|The Aude river at Coursan File:Carcassonne JPG01.jpg|Carcassonne File:Narbonne Cathedrale Saint Just et Saint Pasteur.jpg|Narbonne cathedral File:Castelnaudary bassin canal.jpg|Castelnaudary ==Related pages== * Arrondissements of the Aude department * Communes of the Aude department ==References== ==Other websites== * General council website * Prefecture website * Aude official tourism website * Photos of the Aude Department",
 "title": "Aude"
}