{
 "id": "114159",
 "text": "Ariège (; ) is a department in the region of Occitanie in southern France; it is named after the Ariège river that flows through the department. Its capital is the city of Foix but the city with the largest population is Pamiers. ==History== The department was inhabited in prehistoric times, as evidenced by the presence of caves with cave paintings and dolmens. In historical times it was inhabited by Basque people; they settled on the northern side of the Pyrenees and in the valleys below. In 415 it became part of the kingdom of the Visigoths, until their defeat at the hands of the king of the Franks in 507. Ariège was created in 1790 during the French Revolution, when the whole of France was divided into departments, replacing the old provinces. Ariège was created combining the countiesIn this case, \"county\" () means \"land under a count (the British earl)\". of Foix (Languedoc) and Couserans (Gascogne). ==Geography== Ariège is part of the Occitanie region and has an area of . The department is surrounded by the French departments of Haute-Garonne to the west and north, Aude to the east, and Pyrénées-Orientales in the southeast, as well as Spain (Lleida) and Andorra in the south. ===Natural regions=== There are three main natural regions in the department: # The Ariège plain. The north of the department consists of plains, small hills and low valleys where agriculture is an important activity. Two major rivers, the Ariège and the Lèze, flow through the plain from south to north. # The Pyrenean foothills. This area includes the small mountains and hills below . # The Ariége high country. The geography is dominated by the Pyrenees mountains exceeding above sea level which form the border between France and Spain. The highest mountain in the department is the Pica d'Estats () that is high and is on the Spain- France border. Other high mountains are the peak of Montcalm (3,077 m) and the Pic de Sotllo (3,072 m). The main river is the Ariège river, a tributary of the Garonne river. Another important river is the Lèze, a tributary of the Ariège. ===Climate=== Two main types of climate are found in Ariège: *Mediterranean – particularly visible in the vegetation of the foothills and of the valley of the Ariège river towards Tarascon, and in the Sault country *Continental – in the Pyrenean valleys, with many storms and big differences of temperature between day and night Temperatures are mild in the foothills, e.g. at the city of Foix (400 metres) the average is 5 °C in January and 19 °C in July. However, they decline rapidly with elevation, e.g. at l'Hospitalet- près-l'Andorre (1,430 m) it is 0 °C in January and 14 °C in July. ==Administration== The department is managed by the Departamental Council of the Ariège in Foix. Ariège is part of the region of Occitanie. ===Administrative divisions=== There are 3 arrondissements (districts), 13 cantons and 332 communes (municipalities) in Ariège. INSEE code Arrondissement Capital Population (2014) Area (km²) Density (Inh./km²) Communes 091 Foix Foix 51,473 2,077.8 135 092 Pamiers Pamiers 73,702 1,315.0 115 093 Saint-Girons Saint-Girons 27,399 1,497.2 82 Foix vieille ville.JPG|The \"old city\", Foix Cathédrale Saint-Antonin de Pamiers (09).JPG|Cathedral of Saint-Antonin at Pamiers Saint-Girons (Ariège) - Église Saint-Girons - 20070625.jpg|St Girons' Church by the Salat river The following is a list of the 13 cantons of the Ariège department (with their INSEE codes), following the French canton reorganisation which came into effect in March 2015: # Haute-Ariège (0901) # Arize-Lèze (0902) # Couserans Est (0903) # Couserans Ouest (0904) # Foix (0905) # Mirepoix (0906) # Pamiers-1 (0907) # Pamiers-2 (0908) # Pays d'Olmes (0909) # Portes d'Ariège (0910) # Portes du Couserans (0911) # Sabarthès (0912) # Val d'Ariège (0913) ==Demographics== The inhabitants of Ariège are known, in French, as ariègeois (women: ariègeoises). Ariège has a population, in 2014, of 152,574, for a population density of inhabitants/km2. The arrondissement of Pamiers, with 73,702 inhabitants, is by far the one with more inhabitants. The other two, Foix and Saint-Girons, have respectively 51,473 and 27,399 inhabitants. Evolution of the population in Ariège Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:180000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:20000 start:0 ScaleMinor = gridcolor:lightgrey increment:10000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2008 text:2008 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 138478 bar:1975 from:0 till: 137857 bar:1982 from:0 till: 135725 bar:1990 from:0 till: 136455 bar:1999 from:0 till: 137205 bar:2008 from:0 till: 150201 bar:2014 from:0 till: 152574 PlotData= bar:1968 at: 138478 fontsize:S text: 138,478 shift:(-13,5) bar:1975 at: 137857 fontsize:S text: 137,857 shift:(-18,5) bar:1982 at: 135725 fontsize:S text: 135,725 shift:(-18,5) bar:1990 at: 136455 fontsize:S text: 136,455 shift:(-18,5) bar:1999 at: 137205 fontsize:S text: 137,205 shift:(-18,5) bar:2008 at: 150201 fontsize:S text: 150,201 shift:(-22,5) bar:2014 at: 152574 fontsize:S text: 152,574 shift:(-22,5) About 25% of the population lives in the four communes with 6,000 or more inhabitants. The 10 most important cities in the department are: City Population (2014) Arrondissement Pamiers 15,518 Pamiers Foix 9,721 Foix Saint-Girons 6,284 Saint-Girons Lavelanet 6,245 Foix Saverdun 4,658 Pamiers Mazères 3,810 Pamiers Varilhes 3,328 Pamiers Tarascon-sur-Ariège 3,322 Foix Mirepoix 3,148 Pamiers La Tour-du-Crieu 3,071 Pamiers == Economy == Agriculture is an important activity in Ariege. Only a small part of its territory is used by farmers; only , 27% of its total area, are used for agriculture in the Ariege. The Ariège plain is the most fertile area of the department; here farmers grow maize, wheat, sunflower and other crops. The other natural regions are not good for agriculture and are covered with forests or are used for pastures for sheep, cattle and horses. In the Ax valleys, the mining of talc is the most typical activity. This industry is supplemented by tourism for winter sports. Hydroelectric production is about one-fifth of the production in the Pyrenees. The hydroelectric plant at Aston has the largest annual production capacity in the Pyrenees. ==Gallery== File:Cathédrale Saint-Lizier - Saint-Lizier 01.jpeg|Cathedral of Saint-Lizier. File:MaisonDesConsuls.jpg|Covered shopfronts at Mirepoix. File:Valier.JPG|Mont Valier seen from the road to Port d'Aula in the Haut Couserans. File:Nickel de Vives.jpg|A Mérens horse File:Chateau Lagarde 020.jpg|The Château de Lagarde. File:Saint-Lizier - Cloître de la cathédrale - 20110308 (1).jpg|The cloister in the Saint-Lizier Cathedral. File:Massif de Tabe 280.jpg|The Massif of Tabe. ==Related pages== * Arrondissements of the Ariège department * Communes of the Ariège department ==Notes== ==References== ==Other websites== * Departamental Council of the Ariège * Ariège 2020 - agenda 21 * Prefecture website * The Ariège Pyrenees * Ariege Pyrenees Tourism * Pays des Portes d'Ariège-Pyrénées * Histariège - Histoire et Patrimoine de l'Ariège",
 "title": "Ariège (department)"
}