{
 "id": "1141441",
 "text": "Vijay (born Joseph Vijay Chandrasekhar on June 22, 1974) is a famous Indian actor, playback singer, and dancer. He works primarily in Tamil cinema. He is one of the most popular and highest-paid actors in India. He has a huge fan following. His fans often call him \"Thalapathy,\" which means \"commander\" in Tamil. As of February 2024, Vijay has announced his retirement from movies and his entry into politics with the launch of Tamilaga Vettri Kazhagam. == Early life == Vijay was born in Chennai, Tamil Nadu. His father, S. A. Chandrasekhar, is a movie director. His mother, Shoba Chandrasekhar, is a playback singer. Vijay studied at Balalok Matriculation Higher Secondary School in Chennai. He later attended Loyola College but did not complete his degree because he wanted to focus on acting. == Movie career == Vijay started his acting career as a child artist in a few movies directed by his father. His first lead role as an adult was in the movie Naalaiya Theerpu (1992). Though his early movies did not do very well, he gained success with movies like Poove Unakkaga (1996), which made him popular. He became a big star with hit movies like Kadhalukku Mariyadhai (1997), Thulladha Manamum Thullum (1999), and Ghilli (2004). Over the years, Vijay has acted in many blockbuster movies, including Thuppakki (2012), Mersal (2017), Sarkar (2018), Bigil (2019), and Master (2021). His movies often include a mix of action, romance, and social messages, which appeal to a wide audience. == Style and impact == Vijay is known for his action-packed roles and charismatic screen presence. He is also praised for his dance skills and has performed in many popular songs. He often plays the role of a common man fighting against corruption and injustice, which has made him a favorite among his fans. == Music and singing == In addition to acting, Vijay is a talented playback singer. He has sung songs in many of his movies, including hits like \"Google Google\" and \"Selfie Pulla.\" == Personal life == Vijay is married to Sangeetha Sornalingam. They have two children, Jason Sanjay and Divya Saasha. Vijay keeps his personal life private, but he is known to be a loving family man. == Awards and recognition == Vijay has received several awards for his performances, including Tamil Nadu State Film Awards and Filmfare Awards South. He is also one of the most influential actors in Tamil cinema, and his movies often do well at the box office. == Philanthropy == Vijay is involved in several charity activities. He runs the Vijay Makkal Iyakkam, a social welfare organization. He helps people through his organization, especially in times of need, such as during natural disasters. Category:Actors from Chennai Category:Bollywood playback singers Category:Indian dancers Category:1974 births Category:Living people",
 "title": "Vijay (actor)"
}