{
 "id": "1141102",
 "text": "HSBC Tower is a 45 floor skyscraper in Canary Wharf, London. The building is the global headquarters of HSBC Holdings. It houses around 8,000 people, including staff and officials. The tower was designed by the architectural team Sir Norman Foster. Construction began in 1999 and was completed in 2002. There are 42 floors in the 200 meters (656 ft) tall tower, the third largest in the United Kingdom (along with the Citigroup Centre) after the neighboring One Canada Square (popularly known as the Canary Wharf Tower) and The Shard. In April 2007, it became the first building in Britain to be sold for more than £1 billion. The tower was sold to the Spanish property company Metrovacesa. On December 5, 2008, HSBC Holdings took back ownership of its headquarters in Canary Wharf from Metrovacesa for £838 million, with a loss of £250 million for the Spanish company. ==Floors == The building has 45 above ground floors and 4 basement floors: Floor Use 43–44 Lighting system for the building's crown, which also functions as the air intake/exhaust for the air- handling units on this level. 40–42 Audiovisual facilities for presentations, videos, and conference calls. 9–39 Floors 9 through 39 are occupied by offices and conference rooms, with the exception of floors 15, 25, and 34, which are \"transfer floors\" used to transfer between the four elevator banks. 8 The central equipment room (CER) on this floor is the building's main IT hub, containing necessary equipment for building operations, including local computers and networking gear. It also houses exchanges for the building's telephone extensions. Each floor has satellite equipment rooms (SER) for communication wiring, with over 700 IT cabinets on this floor requiring extensive cabling. 7 Air handlers, gas-fired boilers for generating domestic hot water, serving the level 5 gym changing facilities and the level 6 and level 1 kitchens and Uninterruptible power supply units. These units ensure an instant standby electrical supply for the eighth floor. 6 Client dining rooms 5 Gym with around 120 machines and partially used for trading as well. 2–4 Trading operations, including treasury, capital markets, and equities trading. 1 850-seat Staff Restaurant that serves around 2,500 meals daily. Ground Lobby and Reception B1 Canada Place Mall/HSBC UK Branch B2–B4 Parking ==Renovations== In early 2013, the tower underwent significant renovation work relating to the installation of new signage, replacing both the embedded lettering and hexagons within the glass panels across all four sides. This work was carried out by contractors Tara Signs, who engineered and installed the new signage. The project was finished in late 2014. The now current signage uses a specially formulated LED enhancing Polycarbonate, giving the appearance of black lettering during the day, and illuminated white during the night. Lighting behind the tiles were also replaced from fluorescent tube lighting to LED, although rarely used. As of 2018, the HSBC logo installed on the tower is now out-of-date, displaying the previously used font and positioning of the hexagon. It is assumed that the signage will not be updated in the near future due to the bank's intention to vacate the premises in 2027. == References == Category:Skyscrapers in the United Kingdom Category:Buildings and structures in the London Borough of Tower Hamlets Category:2002 establishments in Europe Category:HSBC",
 "title": "HSBC Tower"
}