{
 "id": "1141903",
 "text": "Duple Metsec was a builder of bus bodies. They were founded in West Midlands in England in the United Kingdom. They made bus bodies for bus companies in Singapore. == Models == === Duple Metsec \"R\" bodywork === The Duple Metsec \"R\" was a single-decker body of a bus. It had a step-entrance. It had 2 axles. It was built from 1988 to 1995. It was built for different types of bus chassis such as the Volvo B10M chassis and Mercedes-Benz O405 chassis. ==== Gallery ==== File:DennisDart-SBST-Ext.JPG|SBS Transit's Dennis Dart with Duple Metsec bodywork File:MBo405 sbs423p 268.jpg|SBS Transit's Mercedes-Benz O405 with Duple Metsec bodywork File:SBS0823T on 16.jpg|SBS Transit's Volvo B10M Mark III with Duple Metsec bodywork === Duple Metsec \"W\" bodywork === The Duple Metsec \"W\" was a double-decker body of a bus. It had a step-entrance. It had 2 axles. It was built from 1970s to 1998. It was built for different types of bus chassis such as; * Daimler/Leyland Fleetline chassis * Leyland Atlantean chassis * Dennis Jubilant chassis * Leyland Victory Mark 2 chassis * Dennis Dominator chassis * Dennis Dragon chassis * Dennis Condor chassis. ==== Gallery ==== File:DC9328.jpg|A Dennis Dominator with Duple Metsec-bodywork operated by KMB, Hong Kong. File:Evers Dennis Jubilant HK KMB.JPG|A Dennis Jubilant with Duple Metsec-bodywork operated by KMB, Hong Kong. ==== Duple Metsec Dragons and Condors ==== The Duple Metsec \"W\" was a double-decker body of a bus. It had a step-entrance. It had 3 axles. It was built from 1982 to 1996. It was built for the Dennis Dragon chassis and Dennis Condor chassis. It was made for China Motor Bus and Kowloon Motor Bus. ===== Gallery ===== File:GH469.jpg|A Dennis Dragon with Duple Metsec-bodywork operated by Citybus, Hong Kong. File:802 CTB 10(Back side).jpg|A Dennis Dragon with Duple Metsec- bodywork rear operated by Citybus, Hong Kong. === Duple Metsec DM3500 === Duple Metsec DM3500 was a single-decker body of a bus. It had a step-entrance. It had 2 axles. It was built from 1997 to 2000. It was built on the Volvo B10M chassis for SBS Transit . ==== Gallery ==== File:SBS Transit B10M Mk4, S2006.JPG|SBS Transit's Volvo B10M Mark IV with Duple Metsec DM3500 bodywork File:SBS903X.JPG|SBS Transit's Volvo B10M Mark IV with Duple Metsec DM3500 bodywork === Duple Metsec DM5000 === Duple Metsec DM5000 was a double-decker body of a bus. It had a low-floor. It had 3 axles. It was built for the Dennis Trident 3 chassis. New World First Bus, Citybus, Kowloon Motor Bus of Hong Kong and SBS Transit of Singapore ordered Trident 3s with Duple Metsec DM5000 bodies. The Duple Metsec DM5000 was made until 2002. ==== Gallery ==== File:JC1611.jpg|KMB's Dennis Trident 3 with Duple Metsec DM5000 bodywork File:Sgtrident.JPG|SBS Transit's Dennis Trident 3 with Duple Metsec DM5000 bodywork ==References== ==Other websites== *Duple Metsec Category:Low-floor buses Category:British transport companies Category:Defunct companies of the United Kingdom Category:1980s establishments in the United Kingdom Category:2000s disestablishments in England",
 "title": "Duple Metsec"
}