{
 "id": "1141323",
 "text": "Meitei martial arts are traditional combat practices originating from the state of Manipur in northeastern India. These arts encompass a variety of techniques that combine both armed and unarmed forms of fighting, focusing on skill development, physical conditioning, and tactical strategy. They are deeply embedded in the cultural and historical fabric of the Meitei people, with roots in warfare, self-defense, and spiritual discipline. Over time, these martial practices evolved not only as means of protection but also as a way to preserve cultural identity and values. Today, Meitei martial arts are practiced to maintain physical fitness, promote mental focus, and honor the regional and ethnic cultural heritage. == History == Meitei martial arts reached its golden age during the rule of King Khagemba (1597-1652 CE). The Chainarol manuscript, written in the 16th and 17th centuries, explains the war rules of the time. It says that if an unarmed person was challenged, they could get weapons and decide when to fight. If someone got a wound and blood was shed during the fight, that person lost. Afterward, the fighters would share food and wine provided by their wives. The winner would then cut off the loser's head and, if asked, cremate the body. The winner often kept the head as a trophy.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 After losing the Anglo-Manipuri War of 1891, Manipur was taken over by the British, who banned people in Manipur to own weapons and to practise the Meitei martial arts, including Thang Ta. Thus, these martial art forms went underground and was kept alive by a few experts. When India became independent in 1947, Manipur joined India in 1949 and became a state in 1972. Slowly, these martial art forms started to come back.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 == Styles == === Cheibi === Cheibi, also known as Cheibi Gad-Ga, is a classical Meitei traditional martial art form, originated from the Ancient Kangleipak (present day Manipur state). It is practised using sticks and shields. \"Cheibi\" itself is the name of the stick used in the martial art form. To decide who wins, points are earned during the duel. The points are given based on a combination of the participant's skill and the amount of force they use. === Huiyen Lallong === Huiyen Lallong martial art form has two forms, which are Thang Ta and Sarit Sarak. ==== Thang Ta ==== Thang Ta () is a classical Meitei traditional martial art form, originated from the Ancient Kangleipak (present day Manipur state). It is practised using weaponry. It is considered as the sibling of Sarit Sarak, which uses no weapons. Thang-Ta is made up of four main parts: the spear dance (Ta-khousarol), sword fighting (Thanghairol), unarmed combat (Sarit-Sarat), and the art of touch and call (Thengkourol).Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 ==== Sarit Sarak ==== Sarit Sarak or Sharit Sharak is a classical Meitei traditional martial art form, originated from the Ancient Kangleipak (present day Manipur state). It is practised without using any weaponry. It is also defined as \"hand to hand combat.\" It is considered as the sibling of Thang Ta, which uses weapons. === Mukna === Mukna is a traditional Meitei form of wrestling from Manipur, India. It is a significant part of the Meitei martial arts and involves various techniques of grappling, throws, and holds. It is often performed during traditional Meitei festivals and has been an important aspect of the Meitei culture for centuries. == Related pages == * Meitei traditional weapons == References == == Other websites == *https://archive.org/details/dli.language.1332 Category:Meitei culture Category:Martial art techniques",
 "title": "Meitei martial arts"
}