{
 "id": "1141537",
 "text": "Gorilla Tag is a 2022 virtual reality (VR) game developed and published by Another Axiom. The game has you play as gorillas (without legs). == Gameplay == In Gorilla Tag, players play as gorillas, or \"monkes\". The player can climb, jump, and dash on trees as the gorilla. Techniques players use include pinch climbing,wall climbing,wall running and wall bouncing. A grip button allows the player to hold on to objects. The game has several maps, such as the Forest, Cave, and Canyon. Voice chat is also enabled by default. Clothes and other cosmetic items can be bought using the virtual currency called \"Shiny Rocks\" which can be accumulated by playing the game or purchased with real-world money. A match is formed through queues of three types: default, competitive, and minigame, the last of which allows for matches with custom rules. The game has multiple modes, which are subject to change. The Infection and Casual game modes are always available, and other game modes are temporarily available. Temporary game modes include: Guardian, Freeze Tag, Hunt, Paintbrawl, Ambush, and Ghost Tag. == Development == Gorilla Tag was originally developed as a solo-project by Kerestell Smith, also known as Lemming or LemmingVR. He got inspiration from another VR game called Echo Arena. == Releases == Gorilla Tag was first released for the Oculus Quest line (now Meta Quest) via SideQuest and for SteamVR in February 2021. It later got released on the App Lab section of the Oculus Store for Quest. The game officially debuted on the Meta Quest Store (previously the Oculus Store) on December 15, 2022, and finally left early access on Steam on January 1, 2023. == Reception == PC Gamer wrote that its \"misleadingly simple\" gameplay was the most appealing part of the game, with controls that were \"easy to toy with but tricky to master.\" In 2021, Gorilla Tag was awarded \"Best Competitive Multiplayer Game\" by UploadVR, for its innovation on tag and physical immersion not present in flatscreen games. Android Central said how the game was aided by \"the physics-based simplicity\" and how players can still enjoy the game despite the low-res graphics and unwelcoming player behavior (toxicity). TechRadar noted the game for its focus on simple fun over winning or losing, despite mentioning the potentially nauseating controls and describing how an in-game menu would be convenient for reporting or muting players. Mark Delaney of GameSpot called the game the \"preferred virtual hangout\" for Generation Alpha due to its supposedly large child audience. The popularity of the game also led to various knock-offs of Gorilla Tag. == References == == Other websites == * Official website Category:2022 video games Category:Early access video games Category:Meta Quest games Category:Multiplayer online games Category:Social casual games Category:Virtual reality games",
 "title": "Gorilla Tag"
}