{
 "id": "1141087",
 "text": "Middle Mongol is a Koine from Old Mongol spoken in Mongolian Empire. ==Definition and historical predecessors== The term \"Middle Mongol\" is somewhat misleading, as what would generally by language naming rules be termed \"Old Mongolian\" in this terminology is actually Proto-Mongolic. The existence of another (\"old\") Mongol clan federation in Mongolia during the 12th century is historical, but there is no language material from this period.For further reading on this matter, see de Rachewiltz 1999 According to Vovin (2019), the Rouran language of the Rouran Khaganate was a Mongolic language and close, but not identical, to Middle Mongolian. Juha Janhunen (2006) classified the Khitan language into the \"Para-Mongolic\" family, meaning it is related to the Mongolic languages as a sister group, rather than as a direct descendant of Proto-Mongolic.Janhunen 2003b: 391–394 Alexander Vovin has also identified several possible loanwords from Koreanic languages into Khitan. He also identified the extinct Tuyuhun language as another Para- Mongolic language. ==Corpus== The temporal delimitation of Middle Mongol causes some problems as shown in definitions ranging from the 13th until the early 15thRybatzki 2003: 57 or until the late 16th century.Poppe 1964: 1 This discrepancy arises from the lack of documents written in the Mongolian language from between the early 15th and late 16th centuries. It is not clear whether these two delimitations constitute conscious decisions about the classification of e.g. a small text from 1453 with less than 120 wordsCleaves 1950 or whether the vaster definition is just intended to fill up the time gap for which little proper evidence is available. Middle Mongol survived in a number of scripts, namely notably ʼPhags-pa (decrees during the Yuan dynasty), Arabic (dictionaries), Chinese, Mongolian script and a few western scripts.Rybatzki 2003: 58 Usually, the Stele of Yisüngge is considered to be its first surviving monument. It is a sports report written in Mongolian writing that was already fairly conventionalized then and most often dated between 1224 and 1225.e.g. Γarudi 2002: 7 However, Igor de Rachewiltz argues that it is unlikely that the stele was erected at the place where it was found in the year of the event it describes, suggesting that it is more likely to have been erected about a quarter of a century later, when Yisüngge had gained more substantial political power. If so, the earliest surviving Mongolian monument would be an edict of Töregene Khatun of 1240de Rachewiltz 1976 and the oldest surviving text arguably The Secret History of the Mongols, a document that must originally have been written in Mongolian script in 1252,Atwood 2007 but which only survives in an edited version as a textbook for learning Mongolian from the Ming dynasty, thus reflecting the pronunciation of Middle Mongol from the second half of the 14th century.de Rachewiltz 2004: xxix–xxxiv, xl–lix == References == Category:Mongolic languages",
 "title": "Middle Mongol"
}