{
 "id": "1141916",
 "text": "{{Infobox artifact | name = Thaomei | native_name = | native_name_lang = mni | image = ꯃꯦꯂꯥ ꯊꯥꯎꯃꯩ ꯊꯥꯟꯄ.jpg | image_size = | alt = | image_caption = Lighting of a Thaomei during the traditional Meitei month of \"Mera\" in a ceremony called \"Mera Thaomei Thaanba\" in the Mera Hou Chongba festival | image2 = Mera Thaumei, A lamp tied to a tall green bamboo pole was lighted and installed during Mera Hou Chongba festival.jpg | image2_size = | alt2 = | image2_caption = Mera Thaomei, a lamp tied to a tall bamboo pole being lighted during Mera Hou Chongba festival | type = lamp | material = | size = | height = | width = | weight = | long = | writing = Meitei | symbols = | created = Antiquity | location = Manipur | classification = | culture = Meitei culture | map = | website = }} Thaomei (), also spelled as Thaumei (), is a traditional Meitei lamp. The Meitei language word \"Thaomei\", is derived from \"Thao\" (), meaning \"oil\" and \"Mei\" (), meaning \"fire\". Lighting thaomei lamps for devotion (lai thaomei thaba) is a highly fashionable duty to be performed by the Meitei woman in every households. == Types == === Khoiru Thaomei === In Meitei language, khoiru thāomei () refers to a \"lamp of wax.\" Khoi‑ru () refers to bee, which is a significant part of the term. It symbolises the source of light or energy. === Mera Thaomei === In Meitei language, merā thāomei () refers to a \"night lamp\" that is lit and hung from a pole in the courtyard during the Meitei calendar month of Mera as part of a religious practice observed by Meitei people. Merā () refers to the seventh month of the Meitei calendar, which is significant for the religious observance. This month corresponds roughly to the period of mid-September to mid-October, and during this time, the night lamp is lit as part of the cultural tradition. === Mingsel Thaomei === In Meitei language, mingsel thāomei () refers to a \"lantern\" used for lighting, combining the idea of glass and an oil-based fire source, which was commonly used for illumination before the widespread use of electric lights. Mingsel () means glass. This part of the word suggests that the lantern or lighting device have a glass enclosure, much like how traditional lanterns often use glass to protect the flame. == In Meitei folktales == === Ita Thaomei === Ita Thaomei, also known as Eta Thaomei (), or Eta Thangmei (), is a Meitei folktale from Manipur. It is the story of a lonely old woman, her lamp () and a thief.Bricolage: Contemporary Quodlibets in Literature. N.p.: Literatureslight Publishing, 2024. p. 17Datta, Bīrendranātha. Folkloric Foragings in India's North-East. India: Anundoram Borooah Institute of Language, Art, and Culture, 1999. p. 163Folk-lore. India: Indian Publications, 1990. p. 66 == In traditional Meitei religion == === Worship of household deities === Thaomei (a lamp) plays an important role in the daily religious practices of the Meitei people. It is used in the worship of deities like Lainingthou Sanamahi and Leimaren Sidabi. When worshipping Lainingthou Sanamahi, the god of the household and protector of the family, the Thaomei is lit to show respect and to ask for blessings of protection and prosperity. Similarly, in the worship of Leimaren Sidabi, the goddess, the Thaomei is also used to honor her and seek her divine blessings. In both practices, the Thaomei symbolizes light, energy, and spiritual connection, making it an essential part of the daily rituals that bring divine blessings into the home. == In Meitei festivals == === Mera Thaomei Thaanba === During the Mera Hou Chongba and Mera Chaorel Houba festivals, one important ritual is lighting thaomei lamps at the end of bamboo poles, called “Mera Thaomei Thaanba.” This act symbolizes safety for the community. Throughout the festival, the Meitei people light thaomei lamps in their courtyards every evening. The lights represent safety and divine blessings. The main celebrations happen at the Kangla Palace and Sana Konung Palace in Imphal, where large festivals and rituals are held to celebrate the festival’s importance. The lighting of lamps is a key part of this tradition. == References == == Other websites == Category:Meitei culture Category:Lamps",
 "title": "Thaomei"
}