{
 "id": "1141844",
 "text": "Mary Loi Yves Kipte Ricalde (born May 27, 2002), known professionally as Maloi (), is a Filipino singer under Star Music. She is one of the main vocalists of the Filipino girl group Bini. == Early life and education == Mary Loi Yves Ricalde was born in Lemery, Batangas, Philippines, to a family of four siblings. Her family originally lived in Lemery but moved to General Trias, Cavite. She attended Japan Philippine Institute of Technology in Bulacan as a scholar, where she graduated along with her co-member Colet in 2024. Maloi started singing at the age of three. While in school, she took part in different activities like being on the swimming and badminton varsity teams, serving as a majorette, and joining the school chorale group. She was part of the chorale group when they won three gold medals as the Philippines' representative in a choral competition in Malaysia in 2018.\"SHE ATE AND LEFT NO CRUMBS: 8 STARTER-FACTS ABOUT BINI MEMBER MALOI\". == Career == In 2018, Maloi tried out for Star Hunt Academy (SHA) in Laguna and was chosen as a trainee in early 2019. On October 10, 2020, she was one of the last eight trainees to graduate and was officially announced as a member of an idol group. In November 2020, Maloi officially joined the Filipino girl group Bini, which made its debuted on June 11, 2021. == Discography == === As a lead artist === List of singles, showing year released and associated albums Title Year Album \"Here With You\" (with Gwen Apuli) 2024 What's Wrong with Secretary Kim? Original Soundtrack == Filmography == In 2023, Maloi appeared in Rob Deniel's music video for the song \"RomCom\", where she recreated a scene from the Filipino romantic comedy A Very Special Love. After this, in 2024, she was cast in the music video for the song \"Dilaw\" (Yellow) by Maki. == Awards == Award Year Recipient(s) Category Result Stats Polls Awards 2024 Most Influential Filipina Celebrity Maloi == Related pages == * ABS-CBN == References == == Other websites == * * Category:Living people Category:People from Batangas Category:2002 births Category:Articles with hCards Category:Articles with hAudio microformats Category:Date of birth not in Wikidata",
 "title": "Maloi (singer)"
}