{
 "id": "1141052",
 "text": "The Battle of Kotli was a key engagement during the Indo-Pakistani War of 1947–1948. It took place in Kotli, a strategically located town in Jammu and Kashmir. The battle involved Indian forces attempting to defend Kotli from an invasion by Pakistani tribal militias and the Azad Kashmir forces. == Background == After the partition of British India in 1947, the princely state of Jammu and Kashmir faced pressure to join either India or Pakistan. When the Maharaja of Kashmir, Hari Singh, acceded to India, tribal militias from Pakistan, backed by the Azad Kashmir forces, launched an invasion to capture key areas in the region. The control of Kotli was particularly significant, as it was essential for maintaining supply routes, making it a focal point of military engagement during the war. Kotli, located near Poonch and Mirpur, was crucial for controlling access routes into the Kashmir Valley. It was important for India to defend Kotli in order to secure supply lines and communications between Indian-held territory and the Kashmir Valley. === The Battle === In late 1947, Indian forces stationed in Kotli, commanded by Lt. Col. Sukhdev Singh and Brigadier Paranjape, came under siege by tribal militias and Azad Kashmir forces. Despite being heavily outnumbered, the Indian garrison made several attempts to repel the attackers and break the siege. However, the strategic situation extended beyond just Kotli. The Indian strategy led the Pakistani forces to believe that the main attack would focus on the Naushera-Kotli-Poonch axis. This suggests that Indian forces engaged in deception operations to mislead the Pakistani military about their true intentions, leading the Pakistanis to expect a major offensive in that area. In reality, the Indian main attack was a two-pronged advance: * 19 Brigade advanced along the Rajouri-Bhimbhar Gali-Mendhar-Topa axis. * 5 Brigade advanced on the same line but on a different flank (the right of 19 Brigade). Additionally, the Rajouri Column was tasked with securing the left flank of the main attack by capturing Ramgarh Fort, ensuring the advancing forces were protected from being attacked from an exposed position. While the 50 Para Brigade was tasked with linking up from the south via Naushera, Jhangar, and Kotli, the Southern force advanced toward Kotli against stiff resistance. On 26 November, this column entered Kotli and raised the siege. Meanwhile, the Northern force began its advance on 20 November but encountered difficulties near Kahuta, where a bridge was demolished by its own besieged garrison, which mistook its own column for the enemy. Consequently, only a battalion under Lt. Col. (later Brig.) Pritam Singh was able to push through to Poonch. The planned link-up was called off, and the Southern force was ordered to fall back and ‘firm in’ at Jhangar. On 27 November 1947, Kotli was abandoned by Indian forces, marking a moment in the battle for the region. The decision to evacuate came after intense fighting and sustained pressure from tribal militias and Azad Kashmir forces, == Aftermath == Kotli’s capture marked a significant territorial gain for Pakistan during the 1947–1948 war. The town remains part of Pakistan-administered Kashmir following the United Nations- brokered ceasefire in 1948.Kotli’s fall had long-term implications for the territorial boundaries in the Kashmir conflict. == References == Category:1947 Category:20th-century battles",
 "title": "Battle of Kotli"
}