{
 "id": "1141859",
 "text": "The 1983 Pacific typhoon season was a series of meteorological events in the North-Western Pacific Ocean from June 1983 to December 1983. It was the latest start of a Pacific typhoon season on record. 32 tropical depressions occurred this year, of which only 23 turned into tropical storms and were assigned a name by the Joint Typhoon Warning Center. Of the 23 tropical storms, one started in June, three started in July, five started in August, two started in September, six started in October, five started in November, and one started in December. The Japan Meteorological Agency stated that ten storms got to typhoon intensity, and of that number, four got to super typhoon strength. Fifteen of the tropical storms reached land, with six moving through the Philippines, six reaching China, six moving into Vietnam, and three moving into Japan. Vera, Wayne, Kim, and Lex led to over half of the deaths from tropical cyclones during this season. Forrest became the fastest-developing tropical storm on record for the western Pacific Ocean, with a pressure drop of 92 hectopascals (2.7 inHg) in a 24‑hour time. == Systems == ===Tropical storm Sarah=== When Tropical Storm Sarah started in the South China Sea on June 24, it became the latest start of a western Pacific season since 1973. The first tropical change happened south of Guam on June 16. By June 19, a low level rotation was created as the system moved westward. As a tropical change, the low went through the Philippines with light winds. The system finally turned into a tropical depression and then a tropical storm on June 25. Sarah moved west-northwestward across the South China Sea, making landfall in Central Vietnam before going away on June 26. Damage across the Philippines was equal to 2.77 billion Philippine Pesos (1983 pesos), or US$249.3 million (1983 dollars). ===Typhoon Tip (Auring)=== === Typhoon Vera (Bebeng) === === Typhoon Wayne (Katring) === Category:Pacific typhoon seasons Category:1980s in weather Category:1983",
 "title": "1983 Pacific typhoon season"
}