{
 "id": "1141116",
 "text": "Karina Garcia (born 1985/1986) is an American political activist, educator, organizer and politician. She is currently running for Vice President of the United States under the Party for Socialism and Liberation as the running mate for Claudia De la Cruz's presidential campaign in the 2024 presidential election. An activist, Garcia identifies as a socialist and has worked with many organizations that supports immigrants, abortions and actions against climate change. She was also a mathematics high school teacher in New York City and a trainer for activists. == Early Life == Garcia was born in Southern California. Her father immigrated to the United States from Mexico, which is a main reason why Garcia became involved in politics. She was raised in California and New York City. She became politically active at the age of 17, she founded a women’s rights organization at her high school. Garcia studied at Columbia University. During her time in college, she went on a speaking tour, talking to students across about politics in California. Also during her time at Columbia, Garcia was a student journalist and activist who founded the activist group Lucha at Columbia. == Career and activism == Garcia is known for her feminist and pro-immigration activism. She identifies as a socialist. She helped train activists to fight for reproductive rights and to help Latina activists across the United States. She was an organizer for the Women Organized to Resist & Defend (WORD) and attended several anti-war rallies in Washington, D.C.. Garcia has been critical of the two-party system in the United States and of the policies of both Republican and Democratic Parties. She also advocated against landlord abuse, police brutality, wage theft and supported student financial aide. After graduating from Columbia University, Garcia became a math teacher in New York City. Garcia is a founder of the Justice Center en El Barrio in New York City. She is a member of the Central Committee of the Party for Socialism and Liberation. In 2012, she became a political organizer and began working for the National Latina Institute for Reproductive Justice where she trained immigrant women and working-class Latina activists in New York, Texas, Virginia and Florida. === 2024 vice presidential campaign === In September 2023, Garcia announced her candidacy for Vice President of the United States as the running mate of activist Claudia De la Cruz's presidential campaign. In January 2024, Garcia was officially confirmed as the Party for Socialism and Liberation's nominee for Vice President of the United States in the 2024 presidential election. The De la Cruz-Garcia campaign promises to support reparations for African Americans, push for a single-payer healthcare system, end all U.S aid to Israel, forgive all student loan debt, fully recognize Native American sovereignty, cut the U.S. military budget by 90%, take control of the 100 largest corporations, expand public transportation, and use taxation to end billionaires. In July 2024, Garcia campaigned for De la Cruz in Tucson, Arizona where she spoke out against nuclear war and supported actions against climate change. == References == ==Other websites== * 2024 presidential campaign website * Karina Garcia on C-SPAN * Presidential and vice presidential campaign launch Category:Living people Category:Educators from California Category:American political activists Category:2024 United States vice-presidential candidates Category:Politicians from California Category:American socialists Category:Politicians from New York City Category:Educators from New York City Category:1980s births Category:American feminists",
 "title": "Karina Garcia"
}