{
 "id": "1141959",
 "text": "Ting Ting Chaoro () is a traditional Meitei language song. It is usually sung by mothers while bathing their children. It is also sung by the maibis (traditional Meitei priestesses) during Lai Haraoba festival. == Song == Lyrics Romanisation English translation Note(s) Ting ting Chaoro Grow fast grow fast Short Essays on Women and Society: Manipuri Women through the Century. N.p.: FSP Media Publications, 2018. p. 21Northeast India Through the Ages: A Transdisciplinary Perspective on Prehistory, History, and Oral History. India: Taylor & Francis, 2022. p. 191, 192 Epa machum taro Let the qualities of the father be there in you Epu machum taro Let the qualities of the grandfather be there in you Thabina karingei kahouro Let you grow like the cucumber Numitna wanglingei wanghouro Let you rise as the sun rises. == Significance == It is believed that children inherit traits and behaviors from their grandparents. Singing the Ting Ting Chaoro song is thought to pass down the natural and cultural qualities of ancestors, along with their unique values. It also helps preserve cultural heritage through traditions and social-religious practices. == In later versions == The modern song Ting Ting Chaoro is the second track of the album Ema Gi Wari, having two parts. The first part talks about the struggles and lives of Meitei people in the Barak and Surma Valleys, caused by a disaster. The \"hey-hey heya-hey\" chant sounds like a call used during hard work in the fields. The backing vocals create a feeling of unity and hope. This part of the song shows the start of a new civilization, from building homes by the river to opening a market. The second part is a traditional Meitei rhyme about raising a child. It stands for hope, a fresh start after disaster, and new beginnings after tragedy. == Related pages == * Tha Tha Thabungton * Te Te Tenawa == References == == Other websites == Category:Meitei literature Category:Meitei religion Category:Meitei folklore Category:Children's songs",
 "title": "Ting Ting Chaoro"
}