{
 "id": "1141432",
 "text": "Kadhalukku Mariyadhai is a 1997 Indian Tamil-language romantic drama film directed by Fazil. It stars Vijay and Shalini (in her first Tamil film) in the lead roles. It is a remake of the Malayalam film Aniyathipravu, also directed by Fazil, and also starring Shalini. It released on 19 December 1997 to positive reviews and became a box-office blockbuster. == Plot == The story is about a young couple, Jeevanandham, also known as Jeeva (played by Vijay), and Mini (played by Shalini). Jeeva and Mini fall in love while studying in college, but their families are against their relationship due to differences in their background and status. Despite their strong feelings for each other, they struggle with family opposition. Both Jeeva's and Mini's families want to arrange marriages for them with different people. The film shows how Jeeva and Mini handle the pressure from their families and whether their love can overcome the obstacles. In the end, the couple realizes that respecting their families' wishes is important. When their families see their maturity and deep love for each other, they eventually give their blessing for the couple to marry. == Cast == * Vijay as Jeevaanandham \"Jeeva\", a rich young MBA student who falls in love with Mini yet is initially misunderstood and disliked by her brothers. * Shalini as Mini, a young woman raised with Christian beliefs who falls in love with Jeeva. She is devoted to her family even after all the misunderstandings that went on with her and Jeeva. * Srividya as Lakshmi, Jeeva's Jeeva's caring and protective mother who loves her son unconditionally. * Sivakumar as Rajasekhar, Jeeva's strict father who initially wants him to settle down with a girl of his parents' choosing. * Manivannan as Kalingeyan, Kesavan's father, the leader of a fisherman hamlet who takes in Jeeva, Mini, and their friends and tries to get them married. * Charle as Kesavan, one of Jeeva's friends who attends the same MBA program as him. * Dhamu as Raghavan, another one of Jeeva's friends who attends the same program as him. * Radha Ravi as James, a doctor and one of Mini's three brothers who dislikes Jeeva. * Thalaivasal Vijay as Stephen, a police officer and another one of Mini's brothers who roughly beats up the trio. * Shaji Khan as Thomas, the youngest of Mini's brothers who also beats up the trio. * KPAC Lalitha as Mariam Joesph, Mini's mother * Kaka Radhakrishnan as Major Thangaraj, a mad and retired army officer with whom Jeeva, Kesavan and Raghavan stay during their MBA. * K. R. Vatsala as Anitha, James's wife. * Sasikala Shree as Stella, Stephen's wife * Poornima as Latha, Mini's friend * Saranya Mohan (child artist) == References == Category:1997 movies Category:1990s Tamil movies",
 "title": "Kadhalukku Mariyadhai"
}