{
 "id": "1141437",
 "text": "Alai Payuthey or Alaipayuthey is a 2000 Indian Tamil-language romantic drama film directed by Mani Ratnam. It stars R. Madhavan and Shalini in the lead roles. The film became very popular for its fresh take on love and relationships, as well as its beautiful music by A. R. Rahman. It released on April 14, 2000 coinciding with Tamil New Year and it received positive reviews and became a blockbuster. It was also considered a breakthrough film for R. Madhavan. It was remade in Hindi as Saathiya in 2002, starring Vivek Oberoi and Rani Mukerji. == Plot == The movie is about the love story of Karthik (played by Madhavan) and Shakthi (played by Shalini). They meet and fall in love with each other, but their families are against their relationship. Despite their families' objections, Karthik and Shakthi get secretly married. However, after marriage, their relationship goes through many challenges. The movie shows how their love is tested through misunderstandings, arguments, and the struggles of living as a married couple. It focuses on the difference between the excitement of love before marriage and the realities of life after marriage. The story also shows how important family approval and understanding are for a successful relationship. == Cast == * R. Madhavan as Karthik Varadharajan * Shalini as Dr. Shakthi * Jayasudha as Saroja * Swarnamalya as Poorni * Vivek as Sethu * Pyramid Natarajan as Varadharajan * Raviprakash as Selvaraj * Sriranjani as Karthik's sister-in-law * Venu Arvind as Arumugam * K. P. A. C. Lalitha as Karthik's mother * Sukumari as Sakthi's aunt * Azhagam Perumal as Nayar * Hari Nair as Raghuraman * Karthik Kumar as Shyam * Medha Raghunath as Karthik's colleague * R. Sundaramoorthy as Nadar * Kumar Natarajan as Ganesh * Prema as Prema * Chitra as Chitra * Raj Naveen as Raj * Arvind Swamy as Ram (guest appearance) * Khushbu as Meena Ram (guest appearance) * Sophiya Haque (special appearance in the song \"September Madham\") * Rangammal (special appearance in the song \"Yaaro Yaarodi Unnoda Purushan\") Category:2000 movies Category:Tamil-language movies Category:2000 Tamil movies",
 "title": "Alai Payuthey"
}