{
 "id": "1141745",
 "text": "The 1928 Great Britain–Germany–France women's athletics match was an international women's athletics competition on 14 August 1928 in London, United Kingdom between United Kingdom, Germany and France. The match took place two weeks after the 1928 Summer Olympics. The competition was won by the United Kingdom with 50 points ahead of Germany with 41 points and France with 15 points. ==Competition format== The competition consisted of 9 events: 100 metres, 800 metres, 4x 100 metres relay, high jump and discus throw. Two athletes per country could competed in the individual events. The overall classification is a nation's classification. The winner of the each received for the nation a certain amount of points. For the overall classication all points from each country are added together. ==Results== === 100 yards=== Place Athlete Nation Time (s) 1 Daisy Ridgley 11.4 2 Leni Schmidt 3 Marguerite Radideau 4 Muriel Gunn Rose Drieling === 200 metres === Place Athlete Nation Time (s) 1 Daisy Ridgley 25.6 2 Ilse Drieling 3 Lucienne Velu 4 Annelies Gerhardt === 800 metres === Place Athlete Nation Time (min) 1 Ivy Barber 2:28.6 2 Lilian Styles 3 Marcelle Neveu 4 Elfriede Wever Käthe Martin === 4 × 100 metres relay === Place Athlete Nation Time (s) 1 Ilse Drieling Rose Drieling Annelies Gerhardt Leni Schmidt 50.0 2 Daisy Ridgley Fanny Rosenfeld Rose Thompson Myrtle Cook 3 Georgette Gagneux Lucienne Velu Lucienne Laudré Marguerite Radideau === High jump === Place Athlete Nation Height (m) 1 Marjorie Clark 1.50 2 1.47 3 Hilda Hatt 1.44 Anneliese Jacke === Long jump === Place Athlete Nation Distance (m) 1 Muriel Gunn 5.43 2 Georgette Gagneux 5.35 3 Eva von Bredow 5.19 Leni Schmidt === Shot put === Place Athlete Nation Distance (m) 1 Grete Heublein 11.72 2 Mary Weston 10.25 3 Anneliese Jacke 9.78 4 Lucienne Velu === Discus throw === Place Athlete Nation Distance (m) 1 Grete Heublein 35.80 2 Florence Birchenough 31.26 3 E. Bell 31.09 Anneliese Jacke === Javelin throw === Place Athlete Nation Distance (m) 1 36.56 2 Ethel Catherwood 3 Anneliese Jacke ==Overall classification== Rank Nation Points 1 50 2 41 3 15 ==References== Category:1928 in women's athletics Category:Sport in London Category:1928 in Europe Category:1920s in the United Kingdom",
 "title": "1928 Great Britain–Germany–France women's athletics match"
}