{
 "id": "1141288",
 "text": "Houdong (), sometimes spelled as Haudong, appears frequently in Meitei mythology and Meitei folktales of the Meitei folklore of Ancient Kangleipak (early Manipur). == Houdong Lamboiba And Pebet == === Hiding the truth === In the Meitei folktale of \"Houdong Lamboiba And Pebet\" (), a clever cat, who fancied himself a monk cat (), saw a mother pebet bird with her newly borne children. He had a secret desire to eat the chicks but had to win the mother's trust first. He went to the mother pebet and asked, \"Am I not the most handsome cat you've ever seen?\" The mother pebet, aware of his true goals and his lack of real beauty, knew she had to answer carefully. She replied, \"Oh, you are as beautiful as the red flowers of the bamboo plants.\" Satisfied with her praising response, he left, feeling pleased. However, he couldn't wait returning again and again to hear more such words. Each time, the mother pebet compared him to the most beautiful elements of nature, and each time, he left with the same happy smile, his secret aims temporarily forgotten.Bharucha, Rustom. The Theatre of Kanhailal: Pebet & Memoirs of Africa. India: Seagull Books, 1992. === Telling the truth === Many times passed, and the Houdong Lamboiba () saw the pebet children growing up. One day, he went to mother pebet with his usual question, hoping for a nice answer. But this time, mother pebet looked at him sharply. \"You are ugly,\" she said, comparing his face to the bottom of a black pot. Her strong words hurted him, and she even scolded him for coming again and again too much. === Twist of fate === The Houdong Lamboiba was surprised by Mother Pebet's sudden change in behavior. His surprise quickly turned to anger, and he decided to eat Mother Pebet and her children. As he prepared to jump on them, Mother Pebet told her children to fly away. They all took to the air, but the youngest was caught by him. Thinking about saving her child, Mother Pebet used her clever mind. She told him that the best way to eat a pebet bird was to wash it thoroughly and then let it sunbathe on a banana leaf. He, foolishly believing her, obeyed her words. Once the young pebet was dry and stronger from the sun, Mother Pebet told her to fly. The freshened pebet flew away quickly, escaping his hands. In a twist of fate, the young pebet left a poop in his hands as she flew off. Without thinking, he ate the poop, thinking that if it tasted good, the bird itself would be even better. Meanwhile, Mother Pebet and her children escaped safely, leaving the Houdong Lamboiba to wonder about them foolishly. == Houdong Sekpi marup ani == In the Meitei folktale of \"Houdong Sekpi marup ani\" (), a cat and a bat were good friends, living together in a forest. They were always there for each other, offering help and honesty in times of need. One tragic day, a wild elephant trampled the bat's five babies. Heartbroken, the bat wept until the cat arrived. \"Why are you crying?\" asked the cat. The bat recounted the devastating loss and pleaded with the cat to avenge her babies. She promised a feast of fish curry and fried rat if the cat could kill the elephant. Moved by the bat's sorrow, the cat vowed to help. As he roamed the jungle, he encountered a beehive and sought the bees' assistance in fulfilling his promise. The bees agreed and soon found the elephant in a dense part of the forest, where they attacked and killed it. The cat, eager to share the news and enjoy the promised feast, returned to the bat. However, the bat, overwhelmed with shame for not preparing the feast, flew away to hide. She perched upside down on a tree, and it is said that bats hang this way to avoid facing cats. == Haudonggi Lamchat == In the Meitei folktale of \"Haudonggi Lamchat\" (), a mischievous cat caused trouble for everyone. However, one particular house bore the brunt of his antics. Every day, like clockwork, he would sneak into this house to pilfer fish, milk, and other delicious treats. The homeowner decided it was time to teach the cat a lesson. One day, he hid in a corner, waiting for the cat to arrive. After a long day of chasing and harassing little birds, the cat was exhausted and thirsty. The thought of cold, sweet milk filled his mind. He made his way to the house, moving stealthily towards the milk vessel. The owner, ready and waiting, grabbed a nearby stick and struck the cat. As a punishment, he then placed a necklace made of lai-tharoi (a type of small and elongated snails) around the cat's neck. The cat limped out of the house, burdened by the heavy necklace. Suddenly, he spotted a holy man approaching with a walking stick. Having just been beaten with a stick, the cat was bewildered to see another person carrying one. The cat felt a wave of relief upon realizing that the holy man had no ill intentions. The holy man then said, \"I have renounced all worldly pleasures.\" Hearing this, the cat felt a deep sense of shame. However, it is often said that a cat's good manners are like a stain on its fur—it can simply lick it away, and soon everything is forgotten. So, as soon as the holy man departed, the cat wandered off to another house, searching for fish and milk. == Related pages == * Yenakha Paotabi * Pebet * Lai Khutsangbi * Khambrangchak * Keibu Keioiba == References == == Other websites == Category:Meitei folklore Category:Animals in culture",
 "title": "Houdong"
}