{
 "id": "114155",
 "text": "Hautes-Alpes () is a department in southeastern France, in the Provence-Alpes- Côte d'Azur region. It is named after the Alps mountain range and its prefecture (capital) is Gap. ==History== The department of the Hautes-Alpes was one of the 83 original departments created during the French Revolution on 4 March 1790 with the southeastern part of the old province of the Dauphiné. It was divided in four districts: Briançon, Embrun, Gap and Serres, with Chorges as its capital but during that same year the capital was moved to Gap. In 1800, with the creation of the arrondissements in France, the four districts were changed into three arrondissements: Gap, Briançon and Embrun. On 10 September 1926, the arrondissement of Embrun was eliminated. After the Battle of Waterloo in 1815, the department was occupied by troops from Austria and of the Kingdom of Sardinia. During World War II, the department was occupied by the fascist Italy. ==Geography== Hautes-Alpes is part of the Provence-Alpes-Côte d'Azur region. It has an area of . The department is surrounded by the Piedmont region (Italy) and four departments in two regions: * Provence-Alpes-Côte d'Azur region ** Alpes-de-Haute-Provence (south) * Auvergne-Rhône-Alpes region ** Isère (north) ** Savoie (northeast) ** Drôme (west) Hautes-Alpes is in the Alps mountain range. The average elevation is over . The third highest commune in all of Europe is the village of Saint- Véran. Gap and Briançon are the highest prefecture and subprefecture in France. The highest point is Barre des Écrins (), in the commune of Pelvoux; it is high. The lowest point is in the valley of the Buëch river, with an altitude of . The main rivers in Hautes-Alpes are the Durance, a tributary of the Rhône river, Buëch and Drac. ===Climate=== The Köppen climate classification type for the climate at Embrun is an \"Oceanic climate\" (also known as Marine West Coast Climate) and of the subtype \"Cfc\". The average amount of precipitation for the year in Embrun is . The month with the most precipitation on average is May with of precipitation. The month with the least precipitation on average is July with an average of . The average temperature for the year in Embrun is . The warmest month, on average, is July with an average temperature of . The coolest month on average is January, with an average temperature of . ==Administration== Hautes-Alpes is managed by the Departmental Council of Hautes-Alpes in Gap. The department is part of the Provence-Alpes-Côte d'Azur region. ===Administrative divisions=== There are 2 arrondissements (districts), 15 cantons and 167 communes (municipalities) in Hautes-Alpes. Arrondissements of the Hautes-Alpes INSEE code Arrondissement Capital Population (2014) Area (km²) Density (Inh./km²) Communes 051 Briançon Briançon 35,752 2,138.1 37 052 Gap Gap 104,131 3,410.5 130 The following is a list of the 15 cantons of the Hautes- Alpes department (with their INSEE codes), following the French canton reorganisation which came into effect in March 2015: # L'Argentière-la-Bessée (0501) # Briançon-1 (0502) # Briançon-2 (0503) # Chorges (0504) # Embrun (0505) # Gap-1 (0506) # Gap-2 (0507) # Gap-3 (0508) # Gap-4 (0509) # Guillestre (0510) # Laragne-Montéglin (0511) # Saint-Bonnet-en-Champsaur (0512) # Serres (0513) # Tallard (0514) # Veynes (0515) ==Demographics== The inhabitants of Hautes-Alpes are known, in French, as Haut-Alpins (women: Haut- Alpines). Hautes-Alpes had a population, in 2013, of 139,883, for a population density of inhabitants/km2. The arrondissement of Gap, with 104,131 inhabitants, is the arrondissement with more inhabitants. Evolution of the population in Hautes-Alpes Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:160000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:20000 start:0 ScaleMinor = gridcolor:lightgrey increment:10000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2006 text:2006 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 91790 bar:1975 from:0 till: 97358 bar:1982 from:0 till: 105070 bar:1990 from:0 till: 113300 bar:1999 from:0 till: 121631 bar:2006 from:0 till: 130752 bar:2014 from:0 till: 139883 PlotData= bar:1968 at: 91790 fontsize:S text: 91,790 shift:(-12,5) bar:1975 at: 97358 fontsize:S text: 97,358 shift:(-18,5) bar:1982 at: 105070 fontsize:S text: 105,070 shift:(-18,5) bar:1990 at: 113300 fontsize:S text: 113,300 shift:(-18,5) bar:1999 at: 121631 fontsize:S text: 121,631 shift:(-18,5) bar:2006 at: 130752 fontsize:S text: 130,752 shift:(-18,10) bar:2014 at: 139883 fontsize:S text: 139,883 shift:(-18,5) The communes in the department with more inhabitants are: City Population (2014) Arrondissement Gap 40,225 Gap Briançon 12,392 Briançon Embrun 6,150 Gap Laragne-Montéglin 3,480 Gap Veynes 3,151 Gap Chorges 2,791 Gap La Bâtie-Neuve 2,468 Gap Guillestre 2,323 Briançon L'Argentière-la-Bessée 2,317 Briançon Tallard 2,061 Gap Saint-Bonnet-en-Champsaur 2,034 Gap ==Gallery== File:Gap018.jpg|Gap File:Collégiale Notre-Dame-et-Saint-Nicolas de Briançon.jpg|Briançon File:Lac des Hautes-Alpes.JPG|Lake of Serre-Ponçon. File:Saint-V%C3%A9ran-Hiver-Queyras.jpeg|Saint-Véran-en-Queyras File:Chateau- Queyras 01.jpg|Fort Queyras. ==Related pages== * Arrondissements of the Hautes-Alpes department * Communes of the Hautes-Alpes department ==References== ==Other websites== * Departmental Council website * Prefecture website * Hautes-Alpes tourism",
 "title": "Hautes-Alpes"
}