{
 "id": "1141218",
 "text": "Puthiba (), also known as Lai Puthiba,Studies in the Economic History of North East India. India: Har-Anand Publications, 1994. p. 46Proceedings of North East India History Association. India: The Association, 1986. p. 50 Lainingthou Puthiba, Iputhou Puthiba, Ibudhou Puthiba, is a deity of traditional Meitei religion, mainly worshipped in the Indian states of Manipur and Tripura. He is one of the most important traditional Meitei deities, honored by the Meitei people in Tripura. He is one of the Umang Lai deities in the Meitei pantheon. \"Puthiba\" is also another name of god Khoriphaba, who is another Meitei deity.Encyclopaedia Of Manipur (3 Vol.). India: GPH, 2011. p. 681 == History == According to the Loiyumpa Silyel, an 11th-12th century Meitei language written Constitution, god Puthiba was used to be worshipped by the Meitei people of the \"Puthem\" family.Manipur: Treaties & Documents. India: Mittal Publications, 1993. p. 4Proceedings of the North East India History Association. India: The Association, 1982. p. 34 In 1684, a ritual dedicated to God Lai Puthiba was conducted at ancestral shrines in times of insufficient rainfall, rituals. During the reign of Meitei king Marjit Singh in Manipur Kingdom (1813–1819), Meitei princess Sija Chandrakala Devi married Tripuri king Raja Borothakur Krishnakishwor, becoming his first queen. During her tenure, the shrine of the god Puthiba was established at Abhoinagar in Tripura, alongside the construction of several other Meitei temples in the region. == Cult == Puthiba is an Umang Lai deity worshipped in the Phayeng region of Manipur. The local community observes the Lai Haraoba festival dedicated to Puthiba during the Meitei lunar month of Hiyangei (November–December). This is distinct from the Lai Haraoba held in the month of Mera (October–November), which is dedicated to the deity Koubru. Puthiba is a deity venerated in times of insufficient rainfall, rituals were performed to seek divine intervention. He is worshipped with the intention of seeking protection for cattle from natural calamities. Following the observance of a ritual, cattle owners customarily refrain from allowing their livestock to roam freely within the village.Kirti Singh, Moirangthem. Folk Culture of Manipur. India: Manas Publications, 1993. p. 227 == Festivals == In January 2022, the five-day Laining-thou Puthiba Lai Haraoba festival concluded at Puthiba Devata Bari in Abhoynagar, Agartala. The closing ceremony was attended by Tripura Chief Minister Biplab Kumar Deb and Tribal Welfare Minister Mevar Kumar Jamatia. The event was organized by the Puthiba Lai Haraoba Committee. During the event, Chief Minister Biplab Kumar Deb and Tribal Welfare Minister Mevar Kumar Jamatia noted the historical and cultural connections between Tripura and Manipur, stating that festivals such as Laining-thou Puthiba Lai Haraoba serve to reinforce inter-state relations. == See also == * Poireiton * Panam Ningthou * Ningthou Puthiba * Pureiromba == References == Category:Meitei religion",
 "title": "Puthiba"
}