{
 "id": "1142636",
 "text": "Romano Christian Schmid (born January 27, 2000 in Graz) is an Austrian football player. The midfielder plays for Werder Bremen in the German Bundesliga. He also plays for the Austria national football team. ==Career == Schmid began his career at USV Vasoldsberg. In 2009 he moved to SK Sturm Graz. After playing in the academy, he made his debut for SK Sturm Graz II in the regional league in March 2016. He was in the starting line-up against Annabichler SV . Schmid moved to the professional squad for the 2016/17 season. He made his Bundesliga debut in May 2017. He came in as a substitute for Fabian Koch in the 75th minute on matchday 36 of that season against Wolfsberger AC. Through that effort, Schmid became the first player in the Bundesliga to be born after January 1, 2000. With his goal in a 3-2 win against FK Austria Wien in July 2017, he also became the first player to score a goal in the Bundesliga who was born this date.SKY Sport Austria (German) In January 2019, Schmid moved to the German Bundesliga club Werder Bremen. Werder Bremen also announced that they wanted to loan him out immediately for 18 months. In February 2019 he was loaned out to the Austrian Bundesliga club Wolfsberger AC for six months.Wolfsberger AC After the season, the midfielder remained in Wolfsberg after extending his loan contract for another year. During the one and a half year loan he made 37 appearances in the Bundesliga and scored three goals. For the 2020/21 season, Schmid joined Bremens Bundesliga squad.Werder Bremen He made his Bundesliga debut on December 6, 2020 (10th matchday) in the 1-2 defeat in the home game against VfB Stuttgart. ==International == Schmid played for an Austrian youth national team for the first time in November 2014. In September 2015 he made his first appearance for the U16 team. In March 2016 he made his debut for the Austrian U17 team against Iceland. In April 2017 he played for the U18 team for the first time. In August 2017 he made his debut for the U19 team against Norway. He scored his first goal for them in August 2018 in a friendly against Cyprus. In March 2019 he played for the U20 for the first time against Norway. In September 2019 he made his debut against Andorra for the U21 team. He played 16 times until 2022. In September 2022, Schmid was called up to the senior national team squad for the first time.ÖFB.at He then made his debut in the same month against France in the UEFA Nations League. In May 2024 he was named to Austria's preliminary squad for the 2024 European Championship. He made it into the final squad.ÖFB.at ==References == Category:2000 births Category:Living people Category:Austrian footballers Category:FC Red Bull Salzburg players Category:FC Liefering players Category:Players of the Austrian national football team Category:Austrian football champions Category:Austrian football midfielders Category:Bundesliga players Category:Werder Bremen players Category:UEFA Euro 2024 players",
 "title": "Romano Schmid"
}