{
 "id": "1142196",
 "text": "Los Alamos National Laboratory (often shortened as Los Alamos and LANL) is one of the sixteen research and development laboratories of the United States Department of Energy (DOE). It is located near the northwest area of Santa Fe, New Mexico. It is best known for its key role in helping develop the first atomic bomb. LANL is one of the world's largest and most advanced scientific institutions. Los Alamos was created in 1943 as Project Y, a top-secret site for designing nuclear weapons under the Manhattan Project during World War II.\"50th Anniversary Article: Oppenheimer's Better Idea: Ranch School Becomes Arsenal of Democracy\". Los Alamos National Laboratory. Archived from the original on 20 April 2011. J. Robert Oppenheimer helped convince General Leslie Groves to pick Los Alamos, New Mexico as the site of the lab because of a ranch school in the nearby mesa and Oppenheimer spent his youth in New Mexico. The lab brought together some of the world's most famous scientists, among them numerous Nobel Prize winners. The town of Los Alamos, directly north of the lab, grew during this period. After World War II ended in 1945, Project Y was made public, and it became known as Los Alamos. In 1952, the Atomic Energy Commission formed a second design lab under the direction of the University of California, Berkeley. The two labs competed on creating bomb designs during the Cold War. Los Alamos currently focuses on research in fields such as national security, space exploration, nuclear fusion, renewable energy, medicine, nanotechnology, and supercomputing. The laboratory is almost forty square miles and has almost 900 individual facilities, thirteen nuclear facilities, 8.4 million square feet in buildings, and a $39.1 billion replacement plant value. Several buildings that had connections to the Manhattan Project at Los Alamos were declared a National Historic Landmark in 1965. ==References== Category:1943 establishments in the United States Category:World War II Category:University of California",
 "title": "Los Alamos National Laboratory"
}