{
 "id": "1142660",
 "text": "Christoph Baumgartner (born August 1, 1999 in Horn) is an Austrian football player. He plays as midfielder for RB Leipzig in the German Bundesliga. He also plays for the Austria national football team. ==Career == Baumgartner began his career at SV Horn. Then he moved to the Football academy of St. Pölten. There he played in all age groups. For the 2017/18 season he moved to Germany to join the U-19 team of TSG 1899 Hoffenheim. www.achtzehn99.de In August 2017 he was in the Hoffenheim second team squad for the first time against TSV Schott Mainz. In the same month he made his debut for Hoffenheim in the A-Junior Bundesliga against 1. FC Heidenheim. He also scored his first goal in this game. He ended the season with the club as champion of the South/Southwest group and took part in the championship finals. They were eliminated in the first round against FC Schalke 04. For the 2018/19 season, Baumgartner moved into the Hoffenheim second team squad. In January 2019 he was promoted to Hoffenheim's professional squad.Sky Sport Austria In May 2019 he made his debut for Hoffenheim in the Bundesliga against Werder Bremen. In the following 2019/20 season became an important player for the team. He scored seven goals and six assists in 28 matches. Baumgartner was voted TSG player of the season in August 2020 He played 138 games for Hoffenheim in the Bundesliga, DFB Cup and UEFA Europa League. There he scored 30 goals and assisting 22 goals. https://www.transfermarkt.de Baumgartner moved to RB Leipzig for the 2023/24 season. RB Leipzig ==Internationall == Baumgartner played 51 matches and scored 17 goals for an Austrian youth national team (U15 - U21). 2016 he took part in the European Championships with the U-17 national team, where they reached the quarter-finals. In August 2020 he was called up to the senior national team squad for the first time. öfb.at In September 2020, he was in the starting line-up in the UEFA Nations League against Norway and made his debut for the national team. In May 2021, he was named to the squad for the 2021 European Championship. He made it to the round of 16. In a friendly on March 23, 2024, he set a new world record for the fastest goal ever scored in an international match. After 6.3 seconds he scored 1-0 against Slovakia. ORF.at (german) In May 2024, he was named to the squad for the 2024 European Championship. ==References == Category:1999 births Category:Living people Category:Association football midfielders Category:Austrian footballers Category:Bundesliga players Category:RB Leipzig players Category:Austrian football midfielders Category:UEFA Euro 2024 players",
 "title": "Christoph Baumgartner"
}