{
 "id": "1142065",
 "text": "Rémi Royer (born February 12, 1978) is a Canadian former professional ice hockey defenceman. He played a total of 18 games in the National Hockey League (NHL), all with the Chicago Blackhawks. ==Career== Before playing in the NHL, Royer played parts of five seasons in the Quebec Major Junior Hockey League (QMJHL). He played for the Victoriaville Tigres, Saint-Hyacinthe Laser, and the Rouyn-Noranda Huskies. Royer also played 15 games over two seasons for the Indianapolis Ice of the International Hockey League (IHL). Royer was drafted 31st overall by the Chicago Blackhawks in the 1996 NHL Entry Draft. On October 10, 1998, Royer would make his NHL debut in a 2–1 win against the New Jersey Devils. In the game, Royer recieved a 5-minute major for fighting with Devils right winger Sasha Lakovic. Royer would then split his time between Chicago and their AHL farm team Portland Pirates. On July 20, 2000, the Blackhawks traded Royer to the Florida Panthers in exchange for Nolan Baumgartner. He never played a game with them and instead played 18 games with their AHL- affiliate Louisville Panthers. On March 3, 2001, the Panthers traded Royer to the Washington Capitals in exchange for David Emma. Other major teams he played for were Diables Rouges de Briançon of the Ligue Magnus and EC Red Bull Salzburg of the Erste Bank Eishockey Liga (EBEL). Royer would retire from playing professional ice hockey in 2012. In 2023, Royer accepted a job to become an assistant coach for the Victoriaville Tigres. ==References== == Other websites == * Category:1978 births Category:Living people Category:Canadian ice hockey defencemen Category:Chicago Blackhawks players Category:Houston Aeros (1994–2013) players Category:Ice hockey people from Quebec Category:Louisville Panthers players Category:Portland Pirates players Category:Providence Bruins players Category:Quebec Citadelles players Category:Rouyn-Noranda Huskies players Category:Victoriaville Tigres players Category:ECHL players Category:International Hockey League (1945–2001) players",
 "title": "Rémi Royer"
}