{
 "id": "1142687",
 "text": "The 1922 France–Czechoslovakia women's athletics match was an international women's athletics match where a national team of French athletes competed against a national team of Czechosolvak athletes. It took place on 21 May 1922 at Stade Pershing in Paris, France. It was the second international match organized by the F.S.F.S.F. after the 1921 France–Great Britain women's athletics match, and was the first international women's athletcs match between France and Czechoslovakia. The match was attended by among others the Czechoslovak Minister in Paris Štefan Osuský together with his wife. Tickets for the event were between 2 Granc and 10 Franc (2 F, 3 F, 5 F and 10 F). The match started in the afternoon at 14:15pm. Next to the athletics match a special demonstration of 2kg shot put was performed and a Czech Handball match was played, consisting of 2 half of 25 minutes played by two Czechoslovak teams. The competition was won by Czechoslovakia with 41 points ahead of France with 34 points. The Czechoslovak team received the artistic cup offered by the Minister of War. Individual prizes were rewarded to each competitor and the FSFSF offered each member of the Czechoslovak delegation a medal engraved with their name. == Background == The event took place in the early era of international women's athletics with the first women’s international tournaments being held from 1921. The event was held in the same year as the 1922 Women's World Games that took place in the same vanue in Paris. == Format== In each individual event two athletes of each nation competed and one team of four athletes in the relay event. The first athlete in the individual events scored 5 points, the number two 3 points, number three 2 points and the number four 1 point. The country that won the relay event scored 6 points and the other country 3 points. For the overall classification all the points scored by each country are added together. == Competition == === 80 metres === Place Athlete Time Points Note 1 11.0 sec 5 2 3 3 2 4 1 === 83 metres hurdles === Place Athlete Time Points Note 1 14.4 sec 5 2 3 3 15.4 sec 2 4 1 === Shot put === The score was the total of a throw with both arms. Place Athlete Distance Points Note 1 15.84 (or 16.84) m 5 2 15.02 m 3 3 14.53 (or 14.73) m 2 4 13.97 m 1 === High jump === Place Athlete Height Points Note 1 1.35 m 5 2 1.33 m 3 3 1.32 m 2 4 1.29 m 1 === 200 metres === Place Athlete Time Points Note 1 28.6 sec 5 2 3 3 2 4 1 === Long jump === Place Athlete Distance Points Note 1 4.61 m 5 2 4.55 m 3 3 4.39 m 2 4 2.285 m 1 === 4 x 100 metres relay === 4x 100 metres relay Place Team Time Points 1 Marie Mejzlíková II 53.2 sec 6 2 54.6 sec 3 == Overall classification == Rank Athlete Points 80m 80m H SP HJ 200m LJ Rel 1 41 6 3 8 3 7 8 6 2 34 5 8 3 8 4 3 3 == References == Category:1922 in women's athletics Category:Sport in France Category:Sport in Czechoslovakia Category:1922 in Europe Category:1920s in France",
 "title": "1922 France–Czechoslovakia women's athletics match"
}