{
 "id": "1142242",
 "text": "The Swiss Brethren () are a branch of Anabaptism that originated in Zürich in 1525 and spread to nearby regions. Today, the Swiss Mennonite Conference can trace its roots back to the Swiss Brethren. == Origins == In 1525, prominent reformers Felix Manz, Conrad Grebel, and George Blaurock, along with other radical evangelical figures, broke away from the teachings of Ulrich Zwingli in Zürich. They were dissatisfied with the pace of the Reformation and its inability to fully align with their interpretation of scripture. The Swiss Brethren's primary distinction was their rejection of infant baptism. Based on the Sola Scriptura doctrine, they argued that since the Bible does not explicitly endorse infant baptism, it should not be practiced. This theological position was in direct opposition to Zwingli's views, leading to a public debate. The Zürich city council ultimately sided with Zwingli, further solidifying the Swiss Brethren's stance and resulting in their persecution by other reformers and the Catholic Church. == Persecution and migration == Due to religious persecution, many Swiss Brethren were forced to flee Switzerland. Their beliefs spread across neighboring countries, and the movement laid the foundation for modern-day Mennonites and Amish communities. Following a major split in 1693, led by Jacob Amman and Hans Reist, the Swiss Brethren became identified as Mennonites. == Schleitheim Articles == One of the key documents in Swiss Brethren history is the Schleitheim Articles, written in 1527 by Michael Sattler. This was the first formal Anabaptist confession of faith, containing seven articles on essential topics for the Swiss Brethren: * Believer's baptism * Church discipline * Lord's Supper * Separation from the world * Selection and role of pastors * Nonviolence (nonresistance) == Beliefs == The Swiss Brethren were characterized by their adherence to: * Believer's baptism: Only those who consciously chose to follow the Christian faith were baptized, rejecting infant baptism. * Nonviolence (Nonresistance): Swiss Brethren advocated for peaceful resistance and rejected the use of force in religious or political matters. * Separation from the world: They believed in maintaining a clear distinction between the church and the secular world. == Legacy == Today, the Swiss Brethren's legacy lives on through various Anabaptist denominations, including the Mennonites and the Amish, many of whom can trace their origins to this movement. The Swiss Mennonite Conference is a direct descendant of the original Swiss Brethren. == Related pages == * Anabaptism * Mennonites * Amish == References == == Other websites == * Swiss Brethren - Global Anabaptist Mennonite Encyclopedia Online Category:Anabaptism Category:Swiss culture",
 "title": "Swiss Brethren"
}