{
 "id": "1142800",
 "text": "Meetei Erol Eyek Loinasillol Apunba Lup (), shortly known as the MEELAL (), is a group that works for the development of Meitei language (officially known as Manipuri language) and Meitei script (officially known as Meetei Mayek). == Standardisation of 27 letter system == MEELAL () promotes the usage of 27 letter system of Meitei script, with the following goals: (1) banning all attempts to prevent the use of 27-letter Meetei Mayek script. (2) any organisation found violating the resolutions will be regarded as public enemy. (3) for the government to consult experts and take up requisite steps for promotion of the 27 letters of the Meetei Mayek script. == Script educationalization movement == MEELAL had a long journey of protesting against the government of Manipur for not making Meitei script an academic writing system for Meitei language in the educational institutions of the state. After countless agitations, their goal was achieved in 2006. MEELAL organises coaching camps for teaching Meitei script, and also distribute related books, across Manipur and other Manipuri populated areas. == Script officialization movement == MEELAL pressurized the government of Manipur to make Meitei script an official writing system for the state's official language, Meitei language, in place of the Bengali script. They proposed that the wording, \"written in Bengali Script' in the Manipur Official Language Act 1979, should be corrected and replaced with \"written in Meetei Mayek script\". == Standardisation of the official name of Meitei script == MEELAL objected the proposal of the government of Manipur to rename the official name of Meitei script from \"Meetei Mayek\" to \"Manipuri Mayek\", stating that Roman script isn't renamed as \"International script\", and Hindi language's Devanagari script isn't renamed as Hindi script. == Script publicity movement == MEELAL worked for the inclusion of printings in Meitei script, alongside the predominantly used Bengali script in Meitei language newspapers, especially in Manipur. == Movement to include Meitei script in Indian currency == The Meetei Erol Eyek Loinasillol Apunba Lup () works for the movement of inclusion of Meitei script in the currency notes of India, by pressuring the government authorities to do it. == Script proficiency programs == === Script proficiency workshops === MEELAL and other groups organise Meetei Mayek script proficiency 10 day long workshops for teachers of Manipuri (MIL) and Elective Manipuri for Classes XI and XII, in Manipur. === Script proficiency examinations === Every year, MEELAL conducted Meitei script proficiency examination widely across numerous districts in Manipur, participated by 10,000 students in different centers. === Script proficiency competitions === Every year, MEELAL also organised state level Meetei Mayek competition for students of class 1 to class 10 in Manipur. == Script diploma programs == === Script diploma classes === MEELAL organises Meitei script diploma classes for the 1st, 2nd and 3rd year courses, in Manipur. === Script diploma competitions === MEELAL organises Meitei Mayek diploma competitions in different places, including Kakching, for the promotion of the writing system. == Conventions on Meitei script == In 2022, MEELAL organized a meeting in which they had three goals: (1) banning all attempts to prevent the use of 27-letter Meetei Mayek script. (2) any organisation found violating the resolutions will be regarded as public enemy. (3) for the government to consult experts and take up requisite steps for promotion of the 27 letters of the Meetei Mayek script. == Monitoring schools == MEELAL looks after the manner of teaching Meetei Mayek in the CBSE schools and catholic schools in Manipur. == Language purification movement == MEELAL works for the maintaining of Meitei language to be linguistically pure and free from foreign words. It checks if there are presence of inappropriate borrowed words or loan words from other languages, in Meitei language suspected books and other publications, as well as even in movies, and music. If non native elements are found, they take actions like banning the publications or productions, and giving them chances of correction. == Classical language status movement == MEELAL demanded that Meitei language should be declared as a classical language of India. They requested the government of Manipur to do whatever is necessary to the central government. MEELAL investigated and exposed that the Manipur government didn't take adequate steps due to which the official recognition of Meitei language as a classical language is delayed, when other counterparts were already declared. == Opposing imposition of other languages == MEELAL opposed the policy of government of India to make Hindi a compulsory subject for the students of all the 8 Northeast Indian states, upto class 10. It was seen as an imposition, with a threat to the existence of Meitei language and script. == Language day observations == Every year, MEELAL organises the celebration of Manipuri language day, remembering the recognition of Manipuri language (Meitei) as a scheduled language of India. == Related pages == * Meitei language in Assam * Meitei language in Bangladesh * Meitei language in Tripura == References == == Other websites == Category:Organizations based in Manipur",
 "title": "Meetei Erol Eyek Loinasillol Apunba Lup"
}