{
 "id": "1142350",
 "text": "or () is a thing the Panamanian government is doing. Operativo \"Flujo Controlado\" is happening along the Darién Passage. Operativo \"Flujo Controlado\" is happening along the Panama–Colombia border.http://programamesocaribe.iom.int/es/noticia/naciones-unidas-visita-el- operativo-flujo-controlado-implementado-por-panam-en-el-dari-n Operativo \"Flujo Controlado\" was made by the Panamanian government in 2015. ==Why is Operativo \"Flujo Controlado\" needed?== People who break the law to help others break the law by traveling through Panama quickly start moving people again when anything goes wrong.http://www.nytimes.com/2024/03/02/world/americas/migration-darien-gap- south-america.html The Panamanian government is doing Operativo \"Flujo Controlado\" to make people safer. The Panamanian government is doing Operativo \"Flujo Controlado\" to make people healthier.http://www.hrw.org/news/2023/10/10/how-treacherous-darien-gap- became-migration-crossroads-americas The Panamanian government is doing Operativo \"Flujo Controlado\" because the government of the United States of America told them they have to.http://www.ecampus.iom.int/pluginfile.php/14566/block_html/content/manual_- _panama.pdf In 2023, over 520,000 people passed through the Darién Route on their way to the United States of America. In 2024, Operativo \"Flujo Controlado\" thinks there will be over 800,000 people passing through the Darién Route on their way to the United States of America.http://www.prensa- latina.cu/2024/05/23/crece-transito-de-migrantes-irregulares-por-panama/ Many people drown in the river trying to cross the Darién–Colombia border.http://www.washingtonpost.com/nation/interactive/2024/immigration- journey-venezuela-trump-harris-election/ People who cross the Darién–Colombia border do not have a choice whether to cross the Darién–Colombia border. People who cross the Darién–Colombia border are forced to cross the Darién–Colombia border by abuses done to them in other countries.http://www.hrw.org/report/2023/11/09/hell-was-my-only-option/abuses- against-migrants-and-asylum-seekers-pushed-cross Some people from the Caribbean try to immigrate to the United States. For those people the Darién Gap is a common route.http://www.unav.edu/web/global-affairs/salta-el-tapon- del-darien-y-la-migracion-a-eeuu-pasa-a-ser-continental Panama's government needs to do Operativo \"Flujo Controlado\" to stop the crisis in Darién. That crisis is about health and security.http://www.radiosantafe.com/2016/08/18/panama-bloqueara-trochas-en- el-tapon-del-darien-para-frenar-ingreso-de-migrante-procedentes-de-colombia/ Panama's government needs to do Operativo \"Flujo Controlado\" to prevent the deaths of people while traveling in the Darién Gap. An example of those deaths happened in February 2023. That example was the deaths of 40 people while traveling in the Darién Gap.http://mirsav.com/40-muertos-en-el-accidente-de- un-autobus-con-migrantes-que-se-precipito-por-un-barranco-en-panama/ ==How does Operativo \"Flujo Controlado\" work?== Operativo \"Flujo Controlado\" is headed by the Public Security Minister.https://web.archive.org/web/20240617084020/http://www.minseg.gob.pa/wp- content/uploads/2017/12/memoria-2016-parte5.pdf is a copy of http://www.minseg.gob.pa/wp-content/uploads/2017/12/memoria-2016-parte5.pdf Operativo \"Flujo Controlado\" takes care of the human rights of the migrants.http://www.telemetro.com/nacionales/2016/10/05/panama-flujo- controlado-emigrantes-bethancourt/1372865.html is a thing that UNHCR is doing. Confía en el Tucán is in English. Confía en el Tucán makes people know things. Those things are ways to be safe while traveling through Darién.http://reliefweb.int/report/colombia/confia-en-el-tucan-trust-toucan- results-report-april-june-2024http://help.unhcr.org/brazil/es/materiales- informativos/confiaeneltucan/ Confía en el Tucán posts on social medias.http://www.tiktok.com/@confiaeneltucanhttp://www.facebook.com/ConfiaEnElTucan UNHCR makes Confía en el Tucán post on 1 social media because UNHCR found that 31% of people learn from that social media before traveling through Darién. UNHCR makes Confía en el Tucán post on a different social media because UNHCR found that 25% of people learn from that social media before traveling through Darién.http://www.acnur.org/noticias/avisos/confia-en-el-tucan-un-ano-de- combate-contra-la-desinformacion-sobre-la-peligrosa-selva-de-darien Another official of UNHCR found that 38% of people learn from 1 social media before traveling through Darién. The other official of UNHCR found that 10% of people learn from other social media before traveling through Darién.http://www.critica.com.pa/nacional/migrantes-deben-confiar-en-el- tucan-650996 The Public Security Minister said :\"Los migrantes han recibido alimentación, atención médica y protección para que puedan continuar con su travesía, y ellos se costean sus propios gastos.\" That means Operativo \"Flujo Controlado\" helps the migrants with food, health and safety so they can keep going in their travel.http://historico.elsalvador.com/historico/197639/panama- ha-atendido-a-9000-migrantes-ilegales-en-operativo-flujo-controlado.html Operativo \"Flujo Controlado\" helps most people who are in Panama against the law to get to Costa Rica so they can more easily get to the United States of America.http://www.france24.com/es/minuto-a-minuto/20210806-panamá-y-colombia- buscan-acuerdo-para-evitar-crisis-migratoria In 2016, Operativo \"Flujo Controlado\" helped 9,000 immigrants to reach Costa Rica on their way to the United States of America.http://www.14ymedio.com/internacional/panama- migrantes-ilegales-operativo-controlado_1_1060980.html In 2016, Operativo \"Flujo Controlado\" helped 19,847 people to do something. Those people were people who had entered Panama's border. That something was leaving Panama to travel to the United States of America.http://www.critica.com.pa/sucesos/solo- quedan-61-migrantes-460232 In the year up to 13 June 2024 Operativo \"Flujo Controlado\" helped 181,447 people to safely pass through Panama from the Panama–Colombia border.http://www.migracion.gob.pa/flujo-controlado-13-de- junio-de-2024/ In the year up to 28 June 2024 Operativo \"Flujo Controlado\" helped over 197,000 people to safely pass through Panama from the Panama–Colombia border.http://www.migracion.gob.pa/operacion-flujo-controlado- mas-197000-personas-en-el-2024/ Operativo \"Flujo Controlado\" helps immigrants at 2 Migrant Reception Stations: Lajas Blancas and San Vicente.http://www.migrationpolicy.org/article/darien-gap-migration-crossroads Operativo \"Flujo Controlado\" takes immigrants from the Migrant Reception Stations to the Temporary Attention Centre for Migrants in Costa Rica every day.http://dtm.iom.int/reports/panama-flow-monitoring-migrant-population- darien-may-2024 Operativo \"Flujo Controlado\" helps immigrants at a camp in Nicanor.http://www.migracion.gob.pa/ministro-bethancourt-presento-informe-en- la-comision-de-gobierno-sobre-inmigrantes-ilegales/ In January–November 2023 Operativo \"Flujo Controlado\" helped more than 400,000 people go into Costa Rica from Panama.http://www.nytimes.com/es/2023/11/08/espanol/costa-rica- panama-autobuses-estados-unidos.html ===Who is Operativo \"Flujo Controlado\" helping?=== Most people coming through the Darién Passage are Venezuelans.http://www.granma.cu/mundo/2024-05-23/aumenta-flujo-de-migrantes- irregulares-por-panama From January-August 2024, 150,000 Venezuelans went through the Darién Passage to get to the United States of America.http://www.france24.com/es/minuto-a-minuto/20240801-vamos-hasta-el- final-claman-venezolanos-en-panam%C3%A1-contra-maduro Some people coming through the Darién Passage are Cubans. Some people coming through the Darién Passage are Haitians.http://www.laestrella.com.pa/panama/nacional/9-000-panama-atendido- migrantes-DILE109093http://www.refugeesinternational.org/reports-briefs/after- the-darien-aid-and-pathways-for-migrants-in-panama-and-costa-rica/ Operativo \"Flujo Controlado\" found that 80% of people entering Darién from Colombia in 2016 were Haitians.http://cubanosporelmundo.com/2016/08/10/pies-afuerapies- adentro-panama-migrantes/ Some people helped by Operativo \"Flujo Controlado\" are Africans who are trying to go to the United States of America.http://www.elnuevoherald.com/noticias/america-latina/cuba- es/article226228390.html ==Other things that are like Operativo \"Flujo Controlado\"== After going through the Darién Passage most immigrants try to go to the United States of America through Costa Rica.http://www.refugeesinternational.org/reports-briefs/after-the-darien-aid- and-pathways-for-migrants-in-panama-and-costa-rica/ There is a person who speaks for some people. Those people are some of the people who are in Colombia against the law. Those people are Cubans. Some people are trying to go to Panama. Some people are trying to go through the Darién Passage. Some people are trying to get to the United States of America. That person asked the Colombian government to give them a part of Chocó. That person asked the Colombian government to make that part of Chocó a \"humanitarian territory.\" That means that person asked the Colombian government to make that part of Chocó a place where those Cubans would be safe and may stay.http://www.elnuevosiglo.com.co/trochas-ilegales-en-darien-seran-cerradas- por-panama On 29 September 2023 the government of Costa Rica made the . This is also named . This Declaration makes Costa Rica's National Commission of Emergency Prevention use more buses to move migrants who pass through Darién to Costa Rica's northern border. This Declaration makes Costa Rica's National Commission of Emergency Prevention help migrants who passed through Darién more.http://www.pgrweb.go.cr/scij/Busqueda/Normativa/Normas/nrm_texto_completo.aspx?nValor1=1&nValor2;=100350&nValor3;=0 Haitians often pay a person to smuggle them from Costa Rica into Nicaragua. That person is called a coyote. That person smuggles people.http://imumi.org/attachments/2020/A-Journey-of-Hope-Haitian-Womens- Migration-to%20-Tapachula.pdf Some Cubans who want to immigrate to the United States of America will do a thing. That thing is staying in places in Panama's capital. Those places belong to organizations other than Panama's government.http://www.14ymedio.com/internacional/cubanos-llegando-panama- refugian-iglesias_1_1060943.html ==References== ==Other websites == * http://x.com/migracionpanama/status/1833161970192703849 Category:Panama Category:2015 establishments Category:Establishments in South America",
 "title": "Operativo Flujo Controlado"
}