{
 "id": "1142709",
 "text": "Gernot Trauner (born March 25, 1992 in Linz) is an Austrian football player . He plays as central defender for Feyenoord Rotterdam in the Eredivisie. He also plays for the Austria national football team. ==Career == Trauner began his career at SV Kematen. He started playing football in 1997 and remained in the club's various youth teams until 2006. He then moved to the Linz Football Academy. There he played through all teams from the U15 to the U19. After a good first half of the season with the Linz Academy's U19s, he was signed by LASK in February 2010. Trauner played for the LASK Juniors in the Upper Austrian league. In the 2010/11 season, Trauner was brought into the Linz first team. He made his debut in the Bundesliga on July 31, 2010 in the Upper Austria derby against SV Ried. http://www.austriasoccer.at In the summer of 2012 he moved to Bundesliga club SV Ried. He made his debut in a 0-1 home defeat against SK Sturm Graz on September 1, 2012. http://www.austriasoccer.at In 2013 and 2014 he was thrown back by injuries. But gradually he establish himself as a regular player for Ried. Gernot Trauner scored his first Bundesliga goal on March 7, 2015 in the match against SV Grödig (2-1). http://www.austriasoccer.at After Rieder was relegated to the second division, he returned to Bundesliga club LASK for the 2017/18 season. In four years at LASK he made a total of 158 appearances. From the 2018/19 season he was also captain of the team. In July 2021, Trauner moved to Feyenoord Rotterdam . == International == Trauner played for Austrias U18, U19 and U21 team 14 matches and scored 2 gols. In October 2018 he was called up to the senior national team squad for the first time. In the same month he made his debut in a friendly against Denmark. 2024 he was in the squad for the 2024 European Championship. He scored his team's first goal in this tournament in a 3-1 win against Poland (1-0). Sportschau.de ==Honours == *Dutch Champion: 2023 * Dutch Cupː 2024 ==References == == Other websites == * Category:Living people Category:1992 births Category:Association football defenders Category:Players of the Austrian national football team Category:Austrian football defenders Category:UEFA Euro 2024 players",
 "title": "Gernot Trauner"
}