{
 "id": "114299",
 "text": "Sesame Street is an American children's television series with many Muppets (puppet characters) and non-Muppet characters (human characters). There are also many animated characters. The show deals with issues like music, song, alphabet, numbers, and teaching children basics in learning, as well as more serious issues like death, divorce, HIV/AIDS, autism, and foster care. Part of the profits go to an international project for children's schools. The show has been on TV since November 10, 1969. Jim Henson made the Muppets and a lot of writers and puppeteers worked together to make the show. The Muppets were used afterwards in a different show called The Muppet Show. Sesame Street has been on TV in 120 countries all over the world. More than 4,000 episodes have been made over 50 seasons. One unique feature of the show is that the episode number appears at the start of each episode. For most of its history, Sesame Street had been shown on PBS in 1970. In 2015, new episodes began airing on PBS in January 2016, but those episodes would be shown on PBS nine months. In 2020, Sesame Street aired on PBS for the last time. After five seasons on PBS, the show returns to PBS as its first-run program, for the newer episodes, starting with the 51st season. ==The Muppets== * Big Bird is a 8-foot-tall yellow dino-bird. He was the first Muppet to appear on Sesame Street. His best friend is Snuffleupagus, a reddish-brown mammoth with no tusks. He was assumed to be imaginary by the rest of the cast until the creators revealed him due to hearing about reports of sexual abuse cases of children. He was performed by Caroll Spinney (1969–2018) and Matt Vogel (2009–present). * Oscar the Grouch is a green alien who lives in a garbage can with his pet worm Slimey and his pet elephant Fluffy. He is always in a bad mood and he loves everything that other people hate: mud, dirt, etc. He has a girlfriend named Grundgetta. He was performed by Caroll Spinney (1969–2018) and Matt Vogel (2009–present). * Bert and Ernie are two roommates. Ernie is more active and always ready to play a game or make a mess. Bert is an often boring grouch who likes to read; he likes things to be clean, neat and loves pigeons. * Zoe is a female yellowish-orange alien. She has a rock named Rocco and loves ballet. She is also Elmo's best friend. * Rosita is a bilingual turquoise female alien who is from Mexico and speaks both English and Spanish. She also plays the guitar. She is performed by Carmen Osbahr. * Count von Count (The Count) is a number- counting lavender vampire. * Prairie Dawn is a driven young girl who loves to write and direct pageants featuring her friends. * Elmo is a small red alien who has a falsetto voice and lives with his goldfish named Dorothy. He speaks in third person and got his own Sesame Street segment, Elmo's World, in 1998. Other Muppets for Sesame Street include a girl fairy named Abby Cadabby, Murray, his lamb named Ovajita, Juila, and the Two-Headed Monster. Not only Muppets play in the show but also a diverse cast of human characters who live with the Muppets. == Related pages == *Sesame Workshop ==Notes== ==References== ==Other websites== * Muppet Central Category:1969 American television series debuts Category:1969 television series debuts Category:1960s American television series Category:1970s American children's television series Category:1980s American children's television series Category:1990s American children's television series Category:2000s American children's television series Category:2010s American children's television series Category:2020s American children's television series Category:English-language television programs Category:Learning Category:Sesame Street",
 "title": "Sesame Street"
}