{
 "id": "1142839",
 "text": "Vizzini is a town and comune in the Metropolitan City of Catania, on the island of Sicily, in southern Italy. ==History== The area has been settled since the Bronze Age. Then came the Greeks and Romans. In those days, it was called Bidis. Later, the Byzantines and then the Arabs ruled it. In 1693, a strong earthquake hit the town. https://www.italythisway.com/places/articles/vizzini-history.php ==Demographics== In 2022, the population was 5,717. It has been declining for at least two decades. https://www.tuttitalia.it/sicilia/85-vizzini/statistiche/popolazione- andamento-demografico/ ==Economy== Vizzini is well-known for its cheese production.https://www.balarm.it/news/un-borgo-siciliano-e-la-citta-del- formaggio-2024-il-tour-nel-paese-delle-cento-essenze-144972 Ricotta cheese is the best-known product of the town.https://www.citymapsicilia.it/en/structure/vizzini/ Livestock raising and tourism are also significant in the economy. https://www.italythisway.com/places/articles/vizzini-history.php ==Festivals== * Festival of ricotta and cheese in Vizzini https://www.enjoysicilia.it/en/enna-villa-del-casale/vizzini/ * Feast of the Madonna dei Campi in Vizzinihttps://www.enjoysicilia.it/en/enna-villa-del- casale/vizzini/ ==Famous people== * Giovani Verga, the father of Italian realism was born in Vizzini. https://www.enjoysicilia.it/en/enna-villa-del- casale/vizzini/ ==Archaeology== Archaeological research has uncovered what is left of an upper-class Roman house near Vizzini. The building has a mosaic floor from the 2nd-4th centuries A.D. https://www.finestresullarte.info/en/archaeology/sicily-a-roman-village-of- well-to-do-people-discovered-in-vizzini-there-was-also-a-domus-with- mosaicshttps://stilearte.it/importante-scoperta-archeologica-a-vizzini- sicilia-emerge-sconosciuto-villaggio-romano-15-ettari-resti-di-splendidi- palazzi-mosaici-e-ceramiche-pregiate/ ==References== Category:Towns in Italy Category:Settlements in the Metropolitan City of Catania",
 "title": "Vizzini"
}