{
 "id": "1142847",
 "text": "Phillipp Mwene (born January 29, 1994 in Vienna) is an Austrian-Kenyan footballer. He plays as defender for 1. FSV Mainz 05 in the German Bundesliga. He also plays for the Austrian national football team. ==Career == Phillipp Mwene started playing for FK Austria Wien. In 2010 he moved from Austria to the youth academy of VfB Stuttgart. After playing in the U-17 and U-19 teams, he debuted on April 20, 2013 forVfB Stuttgart II versus Wacker Burghausen. On June 26, 2013, Mwene signed a contract with VfB Stuttgart that runs until June 2016.VfB Stuttgart Homepage At the end of the 2015-16 season VfB II was relegated. So he left the club. Phillipp Mwene moved to the second division club 1. FC Kaiserslautern. He scored his first second division goal on February 21, 2018 in the against SV Darmstadt 98. He scored the 2-0 in the 61st minute of the game.Kicker.de On the last matchday of the season he scored two goals and added the third goal in a 3-1 away win against FC Ingolstadt.Kicker.de After FCK was relegated, Mwene joined 1. FSV Mainz 05. In total, he played 30 Bundesliga games for Mainz. He scored one goal. He rejected a new contract offer from the club in May 2021.Mainz 05 He then moved to PSV Eindhoven in the Netherlands. In two years at PSV he made 73 competitive appearances. 44 were in the Eredivisie. With Eindhoven he won the Cup twice and the Super Cup three times. In August 2023, Mwene returned to Mainz. He made his comeback for Mainz 05 on matchday 1 of the 2023/24 season against Eintracht Frankfurt. After suffering a knee injury in September and October, Mwene then earned a regular place for the rest of the season. ==International == Mwene went through all Austrian youth national teams from U-16 to U-21. He was named to Austria's provisional squad for the European Championships in May 2021.ÖFB.at He did not make it into the final squad. In September 2021 he finally made his debut for the senior national team in the World Cup qualifiers against Israel. In May 2024 he was again appointed to Austria's provisional squad for the 2024 European Championship. This time he made it into the final squad.ÖFB.at ==References == Category:Living people Category:1994 births Category:Association football defenders Category:Players of the Austrian national football team Category:Austrian football defenders",
 "title": "Phillipp Mwene"
}