{
 "id": "1142959",
 "text": "Meitei ethnicity (also known as Manipuris) in Myanmar have two main ways of dressing. == Men's clothing == When Meitei men go out, they wear a longyi. Men sometimes cover their heads with a cloth and tie a knot on the left side. Men wear a white dhoti (pheijom) for ceremonies, and boys wear a white dhoti too. Men also wear white vests without sleeves and hang a cloth around their necks during ceremonies. Most Myanmarese Meitei men wear longyis. However, if someone living by the Ningthi River wears a longyi, they may be mocked because it looks like a woman wearing a sarong. But recently, some men have started wearing longyis. === Groom's dresses === The groom wears a white dhoti (pheijom) and a sacred thread (lugun). He doesn’t wear a shirt but covers his upper body with a white cloth. He also wears a white turban, which is different from the one worn by Meitei people in India. The groom’s turban is the same as the one worn by a drummer. === Military uniforms === In the late 18th century, a Meitei man, served as a general in the Myanmarese army, would wear a dhoti (pheijom), a turban, and a Myanmarese shirt. Cavalrymen wore a kokyet kangdrum (turban) tied under their chin with cloth. == Women's clothing == Women wear a striped sarong, which they tuck in on the left side. Women also wear long-sleeved blouses, and sometimes wear a sarong over or under the blouse. There is not much difference in clothing between girls and married women. Girls from the Bamon Khunjao group wear a pale pink sarong called pumngou phanek for ceremonies. Wearing pumngou phanek in Mandalay is a new tradition. === Married women's clothing === Married women do not usually wear a sarong over their chest during prayers, but they do wear it while bathing. Married women have a tradition of tying a knot of hair at the back of their heads, which is often decorated with white flowers. They wear earrings and gold necklaces. There is no tradition of wearing extra gold bangles. === Bride's dresses === The bride wears a fancy sarong (phanek) called 'achiek' and a long-sleeved blouse. She is covered with a thin white cloth, and her head is decorated with jewelry and white jasmine flowers. In some areas near the Ningthi River, women wear embroidered sarongs at weddings. Girls getting their ears pierced and brides wear similar clothing and jewelry. Brides don’t wear an innaphi (wrapper). Nowadays, many girls and women in Mandalay wear needle-worked sarongs with designs on the borders. Girls who dance at a mandav (a structure for ceremonies) wear mayek naiba sarongs. === Religious dressings === During the Lai Haraoba festival in Gaave (Yekyi pauk), Meitei girls in Mandalay wear mayek naiba sarongs and extra-weft-designed wrappers. Traditionally, Meitei women in Mandalay wore 'pumthet phanek' sarongs with embroidered borders, but they don’t wear them anymore. A Meitei priestess (maibi) wears a striped sarong high on her chest without a shirt and covers her head with a thin cloth. Girls at the Lai Haraoba festival wear striped sarongs, blouses, and jasmine garlands on their heads. == Textiles == Meiteis made many types of clothes using different looms like khwang-iyong, pan-iyong, and fly-shuttle. Until 1990, the tradition of khwang-iyong continued. There was a market called 'Zecho' that sold only Meitei products. The word 'Zecho' means a market for both luxury and cheap items. In Myanmar, silk fabrics are divided into four types: # Bala # Achiek or Lun # Gaik # Sat Bala fabric has horizontal color stripes. The other three fabrics have designs between the stripes. The Achiek or Lun fabric was introduced by the Meiteis near the Patodas Pagoda near Amarapura in 1775, during the reign of King Alungpaya. The word \"Iun\" means spool. Achiek or lun is called \"lun taya,\" which means \"one hundred\" in Myanmarese. This is because 100 spools are used to make an achiek cloth. Before achiek, during King Pagan's reign, a cloth with zigzag designs was made with three shuttles, using silk from China. Now, silk from Thailand and Bangladesh is also used. Myanmarese people do business with Manipur and like the high-quality raw silk from there. Silk worms were found in the Kabo Valley, and Manipur grew many silk plants, according to a report from 1882. Silk production started in Manipur in the second century. Myanmarese Meitei women are skilled at making silk textiles. During King Mindon's reign (1852-1878), achiek was made using 120 light shuttles. Later, the number of shuttles used to weave achiek increased to 300 (lun thone-ya) from 200 (lun hanaya). Lun taya and achiek are high-quality silk fabrics. The designs in achiek inspired other weavers. Weavers in Gangaw, Arakan, Inle Lake, Chithei near Prome, and Thabyei Auk in Mandalay started making similar cloths. Lun taya and achiek are now considered Myanmar's national clothes. The achiek longyi or sarong was worn by royalty in the past, and common people were not allowed to wear it. Only the king could wear green and red achiek. Pink achiek was only for the women of the royal family. Other nobles and the rich could wear achiek, but it had to be of lower quality. Classical dancers and married women also wear achiek sarongs. The word \"achiek\" means to connect with others. Some think the patterns on achiek are zig-zags or loops. It doesn't have vertical designs and is not embroidered, mostly based on flowers. The design of achiek is like a small rainbow with five to eleven layers. Meitei women weavers in Amarapura call it \"thouri-mayek\" (hind-pin-kyo in Myanmarese). The design was inspired by flowers on water waves. === Types of achiek === The design of achiek can be divided into two types: # A rainbow- like design. # A rainbow-like design placed upside down next to each other, with the middle connected by a hook. This middle design comes from the khoi- mayek pattern, which has been used since ancient times in Manipur. It was first used on the borders of phanek (sarongs) during King Yanglou Keiphaba’s reign (969-984) and has also been used in jewelry. Achiek is woven horizontally with flower designs like orchids, roses, and jasmines on the top and bottom. During King Mindon’s reign, achiek had designs of flower vases and orchids. The Meiteis have been weaving for 230 years, and over time, new designs were added to achiek on all sides. Old designs used on sarong borders and other Meitei products are no longer used. When Meitei women moved to Myanmar, they brought their textile skills, beauty ideas, and concepts, which are reflected in achiek. The smallest area of achiek is 2 cm, and the biggest is 11 cm. Achiek is made by repeating designs next to each other. The layers, colors, and spaces follow odd numbers. This tradition still continues today. Odd numbers stand for life, while even numbers stand for death. Using odd numbers is believed to bring long life and good health. Meitei weavers follow a color tradition. For example, if red is used, yellow naturally comes next to it. There are two types of achiek. The first type uses 8,533 yarns and is 1.12 meters wide. It uses 100 to 300 small boat-like pangatems, and two women weavers sit together to make it manually. The second type uses 5,783 yarns (with silk yarn) and is 1.17 meters wide. The pangatem (shuttle) moves automatically when touched by hand. === Production of achiek === The production process has two steps: # The weft threads for the design are connected by hand. # An extra weft is added to make the design. The second type does not produce many achiek. The underside of achiek is shown when used and is covered during weaving to protect it from dust. Both sides of the achiek look the same. The second type cannot create the lower design. The warp is stretched at a 14° angle from the weaver's waist. For plain cloths, it is stretched at a 10° angle. Female weavers usually make handcrafted achiek, and male weavers use machines for achiek and other plain cloths. == Related pages == * Meitei festivals * Meitei martial arts == References == == Other websites == Category:Meitei clothing Category:Myanmar",
 "title": "Meitei clothing in Myanmar"
}