{
 "id": "1142961",
 "text": "The traditional dresses worn by the Bangladeshi Meitei people (also known as Manipuris), reflect their culture and traditions, adapted to fit the local life in Bangladesh. The clothing includes special fabrics, designs, and accessories that are important to the Meitei tradition. == Men's clothing == Meitei men in villages typically wear a traditional loincloth called khudei at home. Male Meitei elders who are Hindus remove their shirts and place them aside when attending community feasts and the annual sharada ceremony. === Hygiene === In some villages, men must bathe and wash their clothes after using the toilet, as part of the tradition. === Religious dresses === During the Umang Lai Haraoba festival, men wear white dhotis (pheijom). === Groom's dresses === A Meitei groom wears a white dhoti and a white shirt with full sleeves, without a collar. He does not wear a turban. A folded white cloth crosses the groom’s chest from the lower right side to the left shoulder. == Women's clothing == Meitei women wear a mekhala (phanek) at home, and when they go outside, they wear a mekhala and an innaphi (wrapper) or a sari. For village ceremonies, women wear a special mekhala called mayek naiba, which is embroidered at the top and bottom with horizontal colors. An innaphi is used as a sari. Meitei widows wear a white mekhala called pumngou phanek at weddings and annual rituals for the dead. === Hygiene === In some villages, women must bathe and wash their clothes after using the toilet, as part of the tradition. === Religious dresses === During the Umang Lai Haraoba festival, girls wear phanek mapan naiba (a mekhala with needlework) under their chest, wrapped in a thin moirang-phi (a patterned indigenous cloth). Married women also wear phanek mapan naiba over their chest with a moirang-phi. === Respect in front of male elders === During local festivals and in the presence of male elders, married women cover their heads with cloth, as they do before their brothers-in-law. === Bride's dresses === A Meitei bride wears a potloi, a special marriage dress with red applique designs on the border. She wears a short-sleeved shirt and is covered with a thin white cloth. Kajenglei, a traditional Meitei headdress, is placed on her head. === Textile production === Handloom products like chadar, sari, bed sheets, and pillow covers made by Bangladeshi Meitei women are popular in Bangladesh and abroad. After Bangladesh's independence in 1971, Meitei women began selling these products in markets. Initially, the products were made for home use, with only surplus items sold. Textile products from different districts have unique textures and designs. Meitei women in Sylhet district use khwang-iyong (loin-loom), while women in other districts use pan-iyong (throw shuttle loom). Before Bangladesh's independence, Meitei women in Sylhet used back-strap leno weaving. In 1981, they started weaving chadar with uncoiled woolen thread from imported woolen clothes and later switched to two-ply woolen thread in 1997. The use of two-ply woolen thread allowed more Meitei women to produce chadars, helping their households economically. They also made lashing-phi, which was once made from cotton but is now made with four-ply woolen threads. To prepare for weaving, poles are set up in available space at home. The phirubok (ped warping) technique, invented in 1990, uses six poles fixed to a piece of wood, allowing weaving in any free area. Phirubok is not used for weaving lashing- phi, where warping happens in the same place as weaving. When preparing the warp for a loin-loom, the woman weaver places the tpu kanaibi (breast-bar) on her lap while sitting. The sanam (back-strap) is placed on her back and fixed to the yetpu kanaibi (breast-bar). To weave, the sunachei (heald bar), utong (bamboo), and yetpu (front bar) are arranged in order. The bobbins are placed on the right side of the weaver, who passes the yarn to a second woman. The second woman hooks the yarn on the yetpu (front bar) and returns it to the weaver. Today, chadar weaving is not done in a fixed place. It was once done on the manggol (verandah) of a house, but due to limited space, it may now take place in the kitchen or on a bed, used for both sleeping and weaving. Meitei women use pan-iyong (throw-shuttle loom) to make items like inaphi, peech, and sari. These products are made for both household use and the market. ==== Leno Weaving ==== Meitei people who settled in Bangladesh used back-strap leno weaving for both domestic use and the market. During the warping stage, the weaver wears a back-strap 30 cm above the ground, keeping it parallel to the opposite warp-bar. The foot-rest is made from split bamboo and connected to a bamboo roller with a rope. Most tools used in leno weaving and loin-loom weaving are similar, but bamboo reeds are used in leno weaving with khwang-iyong. ==== Technique of Khwang-iyong ==== Two types of cloth are made using the khwang-iyong (loin-loom) technique in Bangladesh. The first is chadar, made from woolen thread or simple cotton yarn, and the second is made from rolled cotton. The technique can use up to 1600 warp yarns for weft-based designs. Only one cloth can be woven at a time. A chadar measures 2.23 meters in length and 0.83 meters in width, with 20 threads in the well and 11 threads in the warp for every 1.3 square cm. ==== Extra-Woven Design ==== For extra- woven designs, an average of 5 extra threads are used. In cotton cloth, for every 1.3 square cm, 35 threads are used in the weft, 16 threads in the warp, and 10 additional threads are needed for the design. The warp is set at 40 degrees for regular cloth and 45 degrees for cotton cloth-lashing \"phi.\" In the khwang-iyong technique, the weaver sits with her legs stretched and the sanam (back-strap) placed on her hip. She stretches the warp yarn by placing her feet against a block of wood or bamboo. There are four main techniques for weft-woven designs: # Shedding motif # Picking motif # Design insert # Beating motif The weaver uses her left hand to hold the shuna-chei (heald bar) and her right hand to push the utong (bamboo bar). The pangatem (shuttle) is thrown by the right hand and caught by the left hand. The tem (weft beater) is then pushed through and moved vertically to widen the gap. For extra weft design, the nayet-chei (weaving rod) is pulled down with the left hand and placed near the utong. The right hand adds extra threads to the weft. The right side of the weft-woven cloth is used, and the left side is not considered. The designs are visible only on the right side. Weaving a lashing-phi is similar to weaving a weft-design cloth on khwang-iyong. The difference is the horizontal movement of the pangatem shuttle one or two times, followed by pressing with the tem. A 30 cm long wachet (bamboo-split) is inserted, encircled by a four- ply wool thread, and substitutes the rolled cotton. A bamboo stick called singkap (temple) is fixed at the borders to maintain tautness. ==== Technique of Pan-iyong ==== The Meitei people use the pan-iyong (throw shuttle loom) to weave cloths like inaphi, sari, pillow covers, and peech. There are two main weaving techniques. The first technique uses a warp with 3,120 yarns to create a moirang-thokpa design along the border. This design is connected to the main weft threads using a shuttle. The second technique involves picking up each thread with fingers and inserting the design along the cloth's borders. Both sides of the cloth appear similar. In the pan-iyong technique, two weavers sit together on a bench. They use three pangatem (shuttles). The weavers on the left and right sides use smaller moirang-thokpa shuttles, while the main weft uses a larger shuttle. The right-side weaver passes the shuttle to the left after hooking the moirang-thokpa shuttles inside the main weft. The left-side weaver connects the threads to the moirang-thokpa design. The weaver then places her legs on the bamboo khongnet (treadle) and uses a samchei (reed) to beat the cloth. For inaphi or sari, the cloth has 22 threads in the warp and 27 threads in the weft for every 1.3 square cm. A singkap (temple) made of bamboo or wood is used along the border to keep the weft tight. The finished cloth is rolled around a konnaba (wooden beam), and a small hanglakchei (split bamboo) is used to prevent it from loosening. ==== Use of Design ==== The designs on khwang-iyong and pan-iyong looms are mostly geometric, created by connecting one design to the next. Some common designs found on wool chadars are: # Karot mana # Khuji # Khuji-phaibok # Kheiroithek # Likli mayek # Joho mayek # Maloti lei mayek # Joypuri mayek # Nga maku or warol mil # Ngakha mamit # Moirang-thokpa # Yensin mayek The moirang-thokpa design is usually placed along the borders of saris and inaphi. Since 1990, it has been used on saris, but before that, it was only used on sarongs and inaphi. Some Meitei weavers in Bangladesh mistakenly confuse the kewa-mana mayek design with moirang-thokpa from Manipur (India). The kewa-mana or moirang-thokpa design measures 9 cm in width and 17.5 cm in height. These designs are produced by Meitei weavers in Bangladesh, although moirang-thokpa (yarong design) is also used in Manipur (India) on inaphi and sarong. ==== Warping ==== Warping for leno weaving differs from warping for loin loom cloths. In leno weaving, the weaver wears a sanam (back-strap) with a yetpu-kanaibi (breast bar) positioned 30 cm from the ground, parallel to the warp bar. The karan-chei (weaving rod) is attached to a bamboo or wooden khongnet (treadle) by rope. Leno weaving typically uses a 60 cm wide weft. The tools used in leno and loin-loom weaving are similar, but samjet (reed) is used in leno weaving, while it is not used in loin-loom weaving. To prepare a 100-meter-long warp for lashing-phi on a loin loom, two weavers are needed. The first weaver attaches the sanam to the yetpu-kanaibi (breast bar), and the second weaver connects the thread to the yetpu (front bar). After this, the shuna-chei (heald bar) and utong (bamboo) bar are placed, and the warping continues. For weaving a chadar on khwang- iyong, a wooden tool called phirubak (ped warping) is used. It is 1.25 meters long, 11 cm wide, 4 cm thick, and 40 cm high, with a slight curve. The phirubak has five or six poles fixed to it and is placed in front of the weaver. Next to the phirubak is a keirak (creel), with two 45 cm long legs connected by a 35 cm horizontal wooden base. The first pole is the yetpu- kanaibi, followed by the shuna-chei, utong-chei, nachei, and yetpu. To prepare the warp, two threads are pulled from the bobbins, knotted around the yetpu- kanaibi, and then passed through the shuna-chei. The shuna (heald) threads are hooked and lifted. The threads are twisted over the utong-chei, and the warp threads are then passed to the yetpu (front bar), where the process repeats to complete the warping. ==== Pan-iyong Warping ==== In the past, the na-chei (weaving rod) was fixed to the ground to prepare the warp for the pan-iyong (throw-shuttle loom). Today, a tool called the \"drum\" is used instead. The konnaba (warp beam) is placed above the pan-iyong. The warp threads are pulled down and passed through the shuna and samjet. Two people work together to pull the threads using a kochi (clasp). == National recognition == On July 17, 2023, Prime Minister Sheikh Hasina of Bangladesh received sarees made from banana plant fibers. These sarees were designed using traditional Meitei techniques and were named as \"Kalabati sarees\". Yasmin Parveen Tibriji, the Deputy Commissioner of Bandarban district, gave three sarees and two jewelry boxes to the Prime Minister. This was the first time sarees using Meitei designs and banana plant fibers were made in Bangladesh. Radhabati Devi, a Meitei designer from Moulavibazar, created the sarees with Meitei designs. Anjali Devi and Dutta Singh also made the other sarees given to the Prime Minister. == Gallery == Manipuri Rash Leela Festival.jpg Being gopi is a prestigious honor in their society.jpg The story of Manipuri folk dance.jpg Three gopis posing for a picture.jpg == Related pages == * Meitei clothing in Myanmar * Meitei monuments in Bangladesh == References == == Other websites == Category:Meitei clothing Category:Bangladesh",
 "title": "Meitei clothing in Bangladesh"
}