{
 "id": "1142832",
 "text": "Chad Joseph Doreck (born November 19, 1978) is an American actor, voice actor, singer, and dancer. He is the voice of Crackle for Rice Krispies and the voice of the supporting role of Brad on the Nickelodeon series, My Life as a Teenage Robot. In 2007, he was one of the final 12 contestants on Grease: You're the One That I Want!, a televised competition to choose the leads for the revival of Grease by Kathleen Marshall. ==Filmography== ===Film=== Year Title Role Notes 1991 All I Want for Christmas Choir 2007 Death Without Consent Chris Carrington 2007 A New Tomorrow Agent 2020 A Recipe for Seduction Billy Garibaldi III Short film ===Television=== Year Title Role Notes 1986 The Judge Christopher Bragg Episode: \"The Terrorist Tot\" 1988 Newhart Michael Harris Jr. Episode: \"A Midseason's Night Dream\" 1989 Family Medical Center Donny Episode: \"Family Medical Center\" 1994-1995 Aladdin Hakim 86 episodes 1999 The Pretender Duppy Demetrius Episode: \"Angel's Flight\" 1999 Touched by an Angel Teen Lonnie Episode: \"The Occupant\" 2001 The Andy Dick Show Pathos Papadopolis Episode: \"Faces of the Future\" 2001-2002 House of Mouse Hakim 3 episodes 2001 NYPD Blue Tom Burris Episode: \"Puppy Love\" 2002 State of Grace Nick Hanson Episode: \"Driving Miss Ida\" 2002 The Brady Bunch in the White House Greg Brady Television film 2003 Greetings from Tucson Pizza Guy Episode: \"The Breakup\" 2003–2007 My Life as a Teenage Robot Brad Carbuckle / Various characters 38 episodes 2003 Rocket Power Centola Episode: \"Reggie's Big (Beach) Break\" 2004 NCIS Leo Episode: \"One Shot, One Kill\" 2004 All of Us Male Nurse Episode: \"Thirty Candles\" 2004 100 Reasons the 90s Ruled Narrator Television film 2005 Escape from Cluster Prime Brad / Drab / French Citizen Television film 2008 The Emperor's New School Manila's Fan#1 Episode: \"The Emperor's New Show/Too Many Malinas\" 2009 iCarly Stewart Butler Episode: \"iMove Out\" 2013 Untitled Murder Project 2.0 Landon 36 episodes 2015 The Slice Max Rabinowitz Television film 2018 General Hospital Dr. Shawn 2 episodes 2020 Westworld Shop Clerk Episode: \"The Mother of Exiles\" 2020 Hollywood John 2 episodes 2020 Saved by the Bell Male Senior #1 Episode: \"The Fabulous Birchwood Boys\" 2021 Call Me Kat Kyle Episode: \"Gym\" 2023 Dead Ringers Max Episode: \"One\" 2025 1923 Bernard Anthony Episode: \"Only Gunshots to Guide Us\" ===Video games=== Year Title Role Notes 2004 Grand Theft Auto: San Andreas Pedestrian / Radio Commercial Voice 2009 Infamous Male Pedestrian 2013 Disney Infinity Hakim / Art 2013 Grand Theft Auto V The Local Population 2023 Marvel's Spider-Man 2 Cletus Kasady / \"The Flame\" Voice and motion capture ==Other websites== * * Grease: You're the One That I Want! from NBC.com * Chad Doreck Category:1978 births Category:Living people Category:American movie actors Category:American musical theatre actors Category:American television actors Category:American video game actors Category:American voice actors Category:American child actors Category:Actors from California Category:Participants in American reality television series Category:University of Southern California alumni Category:Orange County School of the Arts alumni",
 "title": "Chad Doreck"
}