{
 "id": "1142770",
 "text": "Ska Studios is an indie games studio founded by James Silva in 2007. It was founded as a result of winning a contract to publish The Dishwasher: Dead Samurai to Xbox Live Arcade. Ska Studios has released four Metacritic- aggregated console games since then, more than any similarly-sized studio. The studio is well known for their art style, which is described as cartoonish, grim, and gory, and their games \"tight controls.\" Many of the studio's games are highly inspired by modern action games such as Devil May Cry, Ninja Gaiden Black, and Dark Souls. == Games == Year Title Platform Developers Metacritic Score 2009 ZP2K9 XBLIG James Silva 2009 The Dishwasher: Dead Samurai XBLA James Silva 75 2009 I Made a Game with Zombies in It! XBLIG James Silva 2010 ZP2KX XBLIG James Silva, Dustin Burg 2011 The Dishwasher: Vampire Smile XBLA/PC James Silva, Dustin Burg 81 2012 Z0MB1ES (on ph0ne) WP7 James Silva 2013 Charlie Murder XBLA/PC James Silva, Michelle Juett Silva 78 2014 TIME VIKING!!!!!ANDSPACERAPTOR XBLIG James Silva, Michelle Juett Silva 2016 Salt and Sanctuary PS4/PC/PS VITA/Switch/XB1 James Silva, Michelle Juett Silva 85 2022 Salt and Sacrifice PS5/PS4/PC/Switch James Silva, Shane Lynch 72 == History == James Silva began making games as a hobby in 2001, starting with Zombie Smashers X, a River City Ransom-style beat-em'-up game, however this game wasn't successful, it sold less than 100 units. James went on to develop more similarly unsuccessful titles, including Blood Zero, Zombie Smashers X2, and Survival Crisis Z, but never got anywhere until 2009's The Dishwasher: Dead Samurai. == Development == All of Ska Studios' games are made using the XNA framework or its open-source cross platform counterpart, MonoGame. When Xbox One launched with no XNA support, Ska Studios made the switch to PlayStation 4, with Salt and Sanctuary being the studio's first title available on a non-Microsoft console. Regarding the change, James said: > \"The engineering side of it was an issue. All of our code is .NET/XNA, and, > even though XNA support has ended, .NET games can use open source wrappers > like MonoGame and FNA to carry the torch. But Xbox One has no .NET support. > PS4 does, with titles like Towerfall: Ascension and Transistor using > MonoGame in one form or another to deploy to PS4.\" == References == == Other websites == * Category:Video game companies of the United States Category:Companies based in Seattle",
 "title": "Ska Studios"
}