{
 "id": "1142666",
 "text": "The Wild Robot is a 2024 American animated science fiction movie produced by DreamWorks Animation. == Plot == A Universal Dynamics cargo ship loses six robots during a typhoon, which arrive at an island uninhabited by humans, and only one survives the collision in the middle of the coast. Upon sinking, a family of sea otters inspect the robot, and it is activated by wildlife: Unit ROZZUM 7134, nicknamed \"Roz\", attempts to advertise its services to the animals, but only succeeds in terrifying them. Roz spends several days translating the animals' language, but she still can't find anyone who requires her help. She decides to signal to her makers to retrieve her, then to be still as she had been struck by lightning and leaves her unconscious, when she wakes up a herd of raccoons attack her taking pieces of her and then after chasing them away she is chased by the grizzly bear Thorn and accidentally crushes a goose nest, leaving only one egg. After Roz defends the egg from a hungry fox, it hatches, and the goose imprints itself with it and breaks its long-range transponder. Pinktail, an opossum, orders Roz to raise the goose until it can migrate. The fox, Fink, realizes that he can benefit from Roz and helps her find food and build a shelter, as he is grateful that she removed the quills from a porcupine. Roz names the goose Brightbill. Once Brightbill grows up, Roz and Fink begin teaching him how to swim. He meets the other geese on the island, who make fun of him for his size and his relationship with the \"monster\" that killed his family. Angry at not knowing the truth, Brightbill despises Roz and leaves. She returns to the crash site of the craft to learn more about its purpose and replaces her transponder with one from another ROZZUM. The leader of the goose flock, Longneck, encourages Roz not to give up on Brightbill, and recruits the Thunderbolt hawk to help Brightbill learn to fly. Brightbill masters flight just as the geese depart for migration. Roz, distraught over Brightbill's departure and unsure of her purpose, reactivates her transponder but turns it off just as the signal reaches Universal Dynamics headquarters. A thunderstorm forces the geese to temporarily take shelter inside a Universal Dynamics greenhouse, where hostile RECO robots attack them. Realizing that Brightbill's familiarity with Roz makes him the least frightened of the geese, Longneck orders him to lead the flock to safety before sacrificing himself. Roz wakes up in her shelter and finds Fink hiding from a heavy snowstorm. He rescues and brings as many animals as he can to the shelter, draining his batteries. Before Roz shuts down, she and Fink urge the prey and predators to stop fighting until spring. Roz wakes up months later to find the animals that are still looking for peace and the returning geese, who hail Brightbill as a hero. Before she can meet him, a Universal Dynamics landing craft arrives to retrieve it. Vontra, a recovery robot, tries to lure Roz to the ship, but Roz flees. Vontra sends an army of RECO to retrieve it. All of the animals band together to defend themselves from the RECO, but Vontra captures Roz and causes a forest fire by ordering them to self-destruct. Brightbill leads the island's birds to attack the landing craft while the other animals work to extinguish the fire, but discovers that Vontra has already cut off Roz's power and erased her memories. However, Roz's systems are reactivated and restored by her love for Brightbill, and the two destroy Vontra and escape the landing craft before it explodes. Although victorious, Roz chooses to leave anyway to protect the island from future attacks, promising the animals that their makers can't take away her sentience and that she will find a way back. Months later, Roz is working in a greenhouse, apparently having been reset to factory settings. Brightbill sneaks in and approaches Roz, who reveals that she still has her memories, and the two embrace. In a post-credits scene, Fink and Paddler, the beaver, are planting a tree, as they leave, a squirrel appears and Fink throws an acorn at him. == Reception == === Critical response === According to Rotten Tomatoes, The Wild Robot is \"a simple tale told with great sophistication. It is wondrous entertainment that dazzles the eye while filling your heart to the brim.\" == References == == Other websites == * Category:DreamWorks Animation movies Category:2024 movies Category:Science fiction movies Category:Survival movies",
 "title": "The Wild Robot"
}