{
 "id": "1142272",
 "text": "Pizza came to the United States in the early 1900s when many Italian immigrants moved there, especially to big cities like New York, Philadelphia, Boston, and Baltimore. After World War II, when American soldiers came back from Italy, pizza and pizza places became popular.Stradley, Linda. \"Pizza - History & Legends of Pizza\". What's Cooking America. N.p., n.d. Web. January 28, 2014. In the second half of the 1900s, pizza became a very popular food in the United States. Many different kinds of pizza were created, and some of them look quite different from the original Italian version. Pizza is a popular fast food item, and you can find it at many small restaurants as well as big pizza chains. In 2015, the pizza restaurant industry in the U.S. was worth $37 billion. == History == The first pizzeria in the U.S. was Lombardi's, which opened in New York City's Little Italy in 1905. They made a special kind of pizza called Neapolitan-style pizza. The word \"pizza\" was added to English in the 1930s. Before that, it was often called \"tomato pie.\" Some places still use that name for pizza today. In the 1900s, different kinds of pizza styles were created in various regions. Some of these styles are Buffalo, California, Chicago, Detroit, Greek, New Haven, New York, and St. Louis. Each style has its own features, like deep-dish, stuffed, pockets, turnovers, rolls, and pizza-on-a-stick. Each of these styles have several combinations of sauce and toppings. Every day, thirteen percent of Americans eat pizza. There are many places to get pizza, like restaurants, food stands, and big chains like Domino's and Pizza Hut. Pizza is also available at grocery stores, either frozen or ready to bake at home. This makes it easy for everyone to enjoy pizza, whether they eat out or cook at home. == Ingredients == Common toppings for pizza in the United States include pepperoni, sausage, salami, ground beef, ham, bacon, olives, mushrooms, onions, peppers, anchovies, chicken, tomatoes, spinach, and pineapple. American pizza, especially thin-crust, is made with a special type of flour that has a lot of gluten (13–14% protein). This gluten helps the dough stretch really thin without breaking. Unlike Italian pizza, American pizza often has vegetable oil or shortening mixed into the dough. The amount of oil can be small, like in New York-style pizza, or much larger in recipes for Chicago-style deep-dish pizza. Tomato sauce is very common. Some dishes, like white pizza, don't use it at all. Instead, they might use garlic and olive oil, or other sauces made from vegetables, like pesto. == References ==",
 "title": "Pizza in the United States"
}