{
 "id": "114331",
 "text": "The University of Manchester is a public university in Manchester, England. From 2007 to 2008, it had over 40,000 students studying 500 academic programmes, and more than 10,000 staff and an annual income of £637 million. It is the largest single-campus University in the United Kingdom. The university was formed in 2004 by joining together the Victoria University of Manchester (founded 1851) and UMIST (founded 1824) and since then some of the buildings have been demolished and new ones built instead. The former UMIST buildings are in the Sackville Street Campus and those of the former University of Manchester in the Oxford Road Campus. There is a residential campus further south in the suburb of Fallowfield. The earliest buildings of the university date from 1872 (west of Oxford Road) and they were occupied by Owens College in 1873. Since the 1950s the facilities for science and technology have occupied an area east of Oxford Road and the medical school was relocated there in the early 1970s. ==Faculties== *Faculty of Biology, Medicine and Health **School of Medical Sciences **School of Biological Sciences **School of Health Sciences *Faculty of Science and Engineering **School of Engineering **School of Natural Sciences *Faculty of Humanities **School of Arts, Languages and Cultures **School of Environment, Education and Development **School of Social Sciences **Alliance Manchester Business School ==Institutions == * Jodrell Bank Observatory * Whitworth Art Gallery * Manchester Museum, established in 1867, the museum is sited on Oxford Road among the Gothic Revival buildings of the university. It holds about six million items which come from all the continents and serves both as a resource for academic research and teaching and as a regional public museum. * Manchester University Press * Contact Theatre ===Library=== The John Rylands University Library is the library and information service for the university. It was formed in July 1972 from the merger of the library of the Victoria University of Manchester with the John Rylands Library.Guardian, The (London); Jul. 20, 1972Manchester Evening News; Jul. 19, 1972 On 1 October 2004 it joined the library of the University of Manchester Institute of Science & Technology (UMIST) on the merger of the two universities. The main library is on the Oxford Road Campus of the University and the special collections are in the John Rylands Library, Deansgate, in the city centre. The Library is a National Research Library (an award of the Higher Education Funding Council for England): the only one in the north of England. == Notes == == Other websites == * http://www.manchester.ac.uk/ - Official page of the University of Manchester University of Manchester Category:2004 establishments in England",
 "title": "University of Manchester"
}