{
 "id": "114326",
 "text": "Super Mario Bros. 3 is a 1988 platform game made by Nintendo for the Nintendo Entertainment System game console. It was a big hit and sold 40 million copies, and it is often said by critics to be the best game on the NES. It preceded Super Mario Bros. 2 (1988) and was followed by Super Mario World in 1990. It is one of the games in Super Mario All-Stars. ==Plot== Bowser has taken over the Mushroom Kingdom again. This time he and his seven children, called the Koopa Kids, have each taken over one of the worlds, so Princess Toadstool asks Mario and Luigi to help again. ==Gameplay== This game goes back to the original platform conventions of Super Mario Bros. Like that game, Mario jumps, runs, and hits enemies. However, he does not touch a flag or reach a castle. At the end of the level, he hits a spinning block, which will yield a flower, a mushroom, or a star block. When he gets three blocks, he will be rewarded. Three stars will result in five lives. If he gets a mix, he will get one extra life. A new item is a box. The box enables Mario or Luigi to store items that they acquire. Before entering the level, Mario or Luigi can select the item and use it. One such item is the Starman. It will make them super strong and everything they touch will die, for a short time. Another item is the anchor. All seven bosses float around in large ships. If Mario tries to beat them and loses, the ship will move around the world. If Mario uses the anchor, however, the ship will stay still and not move. == Enemies == ===Boomerang Bro=== The Boomerang Bro is a Hammer Bro that throws boomerangs instead of hammers. The Boomerang Bro first appeared in this game. It had green skin and black shells. It is listed in IGN's Mario's Best Enemies. Category:1988 video games Category:Mario platform games Category:Multiplayer and single-player video games Category:Nintendo Entertainment Analysis and Development games Category:Nintendo Entertainment System games Category:Pack-in video games Category:Side-scrolling platform games Category:Video game sequels Category:Video games about raccoons Category:Video games developed in Japan Category:Virtual Console games Category:Virtual Console games for Wii U",
 "title": "Super Mario Bros. 3"
}