{
 "id": "1143404",
 "text": "Zaho Balili (October 3,1951-October 3,2001) was an Albanian poet, writer, rhapsodist, and author of iso-polyphonic songs. == Biography == Early life and education Zaho Balili was born in Rexhin,Tepelenë on October 3,1951. He completed elementary and high school education in Tepelenë. He began writing at a very young age and is the author of several volumes, including Drithërimet e pranverës, Paskan çelur manushaqet, Brengat e shpirtit, Lot kurbeti and Kur dy zemra dashurohen. His songs have been performed by many iso-polyphony groups, such as the groups from Vlorë, Gjirokastër, and Tepelenë, with the main group being Hormova’s group, which he led in the 1980s. With this group, he won first prize at the Gjirokastër Folklore Festival in 1985 with the song Flaka mbuloi fshanë. One of his most famous songs is Balada e Nënës (Mother's Ballad), sung by the group from Vlorë in 1997. This song has been performed by many other singers. In 2001, he created the group Lotë Kurbeti in Athens, which published three albums of his songs. During this period, he was also elected chairman of the patriotic association Labëria in Athens, and chairman of the Albanian Writers’ Association in Greece. He published several writings and poems in Athens' newspaper. == Books == * Paskan çelur manushaqet – Poetry, published in (1997) * Drithërimet e pranverës – Poetry, published in (1998) * Brengat e shpirtit – Poetry, published in (2001) * Puth ballin tënd Shqipëri – Poetry, published in (2002) * Lotë Kurbeti – Poetry, published in (2003) * Kur dy zemra dashurohen – Prose, published in (2011) == Awards and recognitions == # First Prize at the Cultural Meeting of the enterprises in Tepelenë (1980), with the amateur group of S.M.T. # First Prize at the Gjirokastër Folklore Festival (1988) with the song \"Flaka mbuloi fshanë\", sung by Hormova's group. # Special Recognition at the Gjirokastër Folklore Festival (1988) with the song \"13 male me këmbë\", sung by the youth group from Rexhin. # Special Recognition at the Gjirokastër Folklore Festival (2000) with the song \"Ballad for the Commissioner Arben Zylyftari\", sung by Hormova's group. # In 2002, the Gjirokastër County Council awarded him the title \"Distinguished Personality in the Field of Art and Culture\" as a distinguished singer of the southern region’s iso-polyphony songs. # On 16 July 2012, the President of the Republic of Albania, Mr. Bamir Topi, awarded him the Silver \"Naim Frashëri\" Medal with the citation: \"For outstanding contribution to the development of Tepelenë’s folklore, particularly with the Hormova group, as a distinguished leader and rhapsodist.\" # On 31 October 2014, the Tepelenë Municipal Council and Mayor Tërmet Peçi awarded him the title \"Honorary Citizen\", with the citation: \"For valuable contributions to the development of Tepelenë’s folklore, particularly with the Hormova group, as a leader and rhapsodist.\" # On 24 October 2015, the Vatra Labe Association, Athens, awarded him the title \"Certificate of Honor\" posthumously, with the citation: \"For preserving, strengthening, developing, and spreading Lab iso-polyphony, and for his great contribution to folklore and polyphony through his creativity.\" # First Prize at the Eighth International Albanian Polyphony Festival \"Bylis\" (22 September 2018) with the song \"Atje kemi Labërinë\", sung by the group Lotë Kurbeti. == Death == Zaho Balili died in Athens on his birthday, 3 October 2001, due to a cerebral hemorrhage. Three of his volumes were published posthumously. == Notes == == References == == Other websites == * * Category:1951 births Category:2001 deaths",
 "title": "Zaho Balili"
}