{
 "id": "1143576",
 "text": "Holocaust inversion Distortion of the Holocaust refers, inter alia, to: occurs when comparisons of Jews or Israel to Nazis or Nazi Germany are made. * Wistrich, Robert Solomon. 2017. Antisemitism and Holocaust Inversion. In Antisemitism Before and Since the Holocaust. Altered Contexts and Recent Perspectives, ed. Anthony McElligott, and Jeffrey Herf, 37–49. Cham: Palgrave Macmillan. https://doi.org/10.1007/978-3-319-48866-0_3. * * * ==Examples== The World Jewish Congress (WJC) lists the following as examples of Holocaust inversion: * * Major \"Anti-Semitic Motifs in Arab Cartoons\" . An Interview with Joël Kotek. Jewish Council for Public Affairs. Post-Holocaust and Anti- Semitism. No. 21. 1 June 2004. * ==Academic views== Holocaust inversion is antisemitic under the Working Definition of Antisemitism of the International Holocaust Remembrance Alliance (IHRA). IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. This definition has been adopted by many Jewish, EuropeanThe European Commission is the primary executive arm of the European Union (EU). and British parties and other bodies worldwide. Holocaust inversion is a form of Holocaust trivialization, or Holocaust distortion, * * * sometimes considered offensive due to its ahistorical implication that Jews are somehow guilty for their own genocide in the same manner as the Holocaust's perpetrators, a rhetoric employed by some bad actors as a vehicle for their antisemitism. ===Bernard-Henri Lévy=== French philosopher Bernard-Henri Lévy believed that the prevalence of Holocaust inversion had encouraged violence against Jews: * * * ===Yossi Klein Halevi=== Author Yossi Klein Halevi believed that the comparison demonized Jews: ===Alexandria Fanjoy Silver=== Jewish historian Dr. Alexandria Fanjoy Silver believed that many of those engaging in Holocaust inversion were motivated by secondary antisemitism, a special form of postwar antisemitism \"rooted in the psychological process of guilt-deflection\", reportedly common in countries with a long history of antisemitism and strong nationalism. * * * * * * Dr. Silver added that Holocaust inversion, and the gaslighting of Jews who faced antisemitic abuses, showed secondary antisemitism to be a systemic issue in Western society, making it hard for Jews to discuss their lived experiences. For instance, many Jews faced allegations of \"talking too much about the Holocaust\", being \"anti- Palestinian\" or \"ignoring Islamophobia\" for raising awareness about Hamas' atrocities on October 7, 2023, despite Jews having suffered 68% of religion- based hate crimes in the United States (US) in 2023 as per FBI data, * * * * * while 46% of the world's adult population (around 2,200,000,000 people) were found to hold deeply entrenched antisemitic views as of January 2025. * * * * Dr. Silver considered those accusing Jews of being \"genocidal\" as being motivated by secondary antisemitism given that the accusers were \"so uncomfortable in its immorality\" that they had to \"twist it into an expression of morality.\" She also highlighted that secondary antisemitism was statistically the highest in Europe as of 2022 in relation to Holocaust memory, education and commemoration. * * * ===Clemens Heni=== Jewish political scientist Dr. Clemens Heni maintained that secondary antisemitism often involved Holocaust inversion, in whose relevant propaganda tends to single out Israeli Jews for perceived wrongdoings. Dr. Heni found that a common theme of those propaganda features the exaggeration of German suffering from Allied bombing operations, such as the Dresden bombing in February 1945, and false accusations of Israeli Jews \"weaponizing\" the Holocaust to \"extort\" from present Germans, which he classified as \"soft-core Holocaust denial\" – a synonym for Holocaust distortion. * * * * * * Those who distributed such propaganda include German author Jörg Friedrich, Martin Walser and sociologist Wolfgang Sofsky, whose ideas contributed to a false claim by far-right National Democratic Party's parliamentarians at a Saxon State Parliament (Landtag) session that \"the British committed a bombing Holocaust against the Germans in Dresden.\" The post-war expulsion of ethnic Germans from Eastern Europe was also phrased by the \"soft-core\" deniers as an expulsion Holocaust, some of whom are academic leftists, such as Ward Churchill, Robert Kurz, Noam Chomsky and John Mearsheimer. Such academic leftists are said to have a history of accusing Jews of \"controlling\" America's government to support Israel – with tropes like \"US-Jewish leaders\" and \"Israel lobby\" – and \"American capitalism\" of having \"caused the Holocaust\" based on the unfounded claim that the Auschwitz was \"the utmost consequence of Fordism.\" ==References== Category:Racism Category:21st century Category:Antisemitism Category:The Holocaust Category:Discrimination Category:Antisemitism in Europe Category:21st century in Europe Category:21st century in the United States",
 "title": "Holocaust inversion"
}