{
 "id": "1143642",
 "text": "Erna Pröschold (born 19 April 1902) was a German javelin thrower during the 1920s, during the early era of women's athletics. She was a member of TV Jahn Minden and from 1924 of SC Preußen Münster. During the early 1920s, she was national champion, had international successes and was among the best javelin throwers worldwide. ==Biography== During the early 1920s Germany (as a national team) didn't compete yet at the international women's athletics competitions that existed. At the earliest international club-organized women's competitions with German competititors, Pröschold won events in 1923 and 1924. In 1923 she competed at the 1923 Twente–Westphalia athletics competition in Enschede, the Netherlands where she won the javelin throw with 33.60 meters; over eight meters better than the number two. The following year she participated at the 1924 Westphalia–Twente athletics competition in Münster where she won the javelin throw with 33.60 metres ahead of the German Büsing with 29.10 metres. While Germany didn't compete at international competitions, Pröschold was among the best javelin throwers worldwide with her performances. In 1922 and again in 1923 she was ranked second worldwide. In 1922 her best performance was 27.70 meters, and was ranked second behind American Kathryn Agar. In 1923 her best performance was 28.11 meters at a competition in Frankfurt on 18 August and was ranked second behind Estonian Rosine Peek. In 1924 she was ranked fourth worldwide and in 1926 fourteenth. Pieper won at the German Athletics Championships the silver medal in the javelin throw in 1922 behind Maria Grehl. In 1923 she became German national champion with a score of 33.73 metres, ahead of Nelly Bald. In 1924 she won at the national championships the bronze medal behind Wally Wittmann and Margarete Riewe. ==References== Category:1901 births Category:Javelin throwers Category:Year of death missing Category:German athletes",
 "title": "Erna Pröschold"
}