{
 "id": "1143917",
 "text": "Sebastian Prödl (born June 21, 1987 in Graz) is a former Austrian football player. == Career == Prödl started playing for SV Kirchberg and SV Feldbach. In 2002 he moved to SK Sturm Graz. He made his debut for Sturm in the Austrian Bundesliga on December 9, 2006 in the 0-1 away defeat against SV Mattersburg. Five months later he scored his first Bundesliga goal for Sturm Graz. Prödl became an integral part of Sturm Graz's central defense in the 2007/08 season . For the 2008/09 season he moved to Germany to Werder Bremen. On August 16th he made his Bundesliga debut in the away game in Bielefeld. In the last game of the first half of the season in 2008 against VfL Wolfsburg, the Austrian injured his ankle. On March 18, 2009, he scored his first competitive goal for Werder in the round of 16 of the UEFA Cup. In the Bundesliga he made 22 appearances by the end of the season. He won the 2008/09 DFB Cup with Werder Bremen, playing the full time in the final against Bayer 04 Leverkusen. After his contract ednde, Prödl moved to FC Watford in the Premier League for the 2015/16 season. Watford FC He made his debut on August 8, 2015 (1st matchday) in the 2-2 draw in the away game against Everton FC. In January 2020 he moved to Italy to Udinese Calcio in February 2020. However, he never played in Udine, partly due to injuries. After almost a season without a club, Prödl announced the end of his career in June 2022 at the age of 34. Laola1.at == International == Prödl made his first appearance for the senior national team on May 30, 2007 in a friendly against Scotland. ÖFB.at Players profile Between June and July 2007 he took part in the 2007 Junior World Championships in Canada as captain of the Austrian U-20 national team. Prödl took part in the 2008 European Championships in Austria and Switzerland. He also was included in Austria's squad at the 2016 European Football Championship in France. ==References == Category:1987 births Category:Living people Category:Austrian footballers Category:Players of the Austrian national football team Category:Austrian football defenders Category:Association football defenders Category:Bundesliga players Category:Watford F.C. players Category:Werder Bremen players",
 "title": "Sebastian Prödl"
}