{
 "id": "114338",
 "text": "Áo dài is the national costume of Vietnam for women. Vietnamese wear áo dài for formal occasions, at school or for work. The male counterpart to the áo dài is called an Áo gấm. The áo dài is found in every part of Vietnam, and in overseas Vietnamese communities. The prefix \"Áo\" classifies the item as clothing, \"Dài\" means \"long.\" Once condemned as decadent by the country's rulers, the dress became popular again in the 1990s. A modern áo dài has two parts, a long split tunic with mandarin collar or collarless, and pants that stop at the ankles. Costume and evening-gown áo dài may have colorful designs with flowers, birds, pictures or nothing. Áo dài is similar to the salwar kameez and the kurta of countries following Indo-Islamic culture such as India, Pakistan because they are both forms of clothing consisting of a long split tunic worn over trousers. The price of an evening gown áo dài is reasonable, but may be expensive depending on the choice of fabric and the dressmaker. Because of the light transparent fabrics, people who wear áo dài should wear light underwear. ==Medieval Annam== For centuries, peasant women typically wore a halter top () under a blouse or overcoat, alongside a skirt (váy).Leshkowich, p. 89. Aristocrats, on the other hand, favored a cross- collared robe called áo giao lĩnh, which bore a resemblance to the Korean hanbok, and the Japanese kimono. In 1744, Lord Nguyễn Phúc Khoát of Huế decreed that for men and women at his court to wear trousers and a gown with buttons down the front. The writer Lê Quý Đôn described the newfangled outfit as an áo dài (long garment). The members of the southern court were thus distinguished from the courtiers of the Trịnh Lords in Hanoi, who wore áo giao lĩnh with long skirts. ==20th century== Chinese Ming-style clothing was forced onto the Vietnamese people by the Nguyễn dynasty. The tunics and the trouser clothing of the Han Chinese in the Ming and Qing tradition were worn by the Vietnamese. However, Han-Chinese clothing is assembled by several pieces of clothing, including both pants and skirts, called qun (裙) or chang (裳), which has been a part of Hanfu garments throughout the history of Han Chinese clothing. The ao dai was created when tucks, which were close fitting and compact, were added in the 1920s to the Chinese style. The Chinese clothing in the form of trousers and tunic was mandated by the Vietnamese Nguyen government. Until the 1920s, in the north of Vietnam's isolated hamlets, skirts were worn. The Chinese Ming dynasty, Tang dynasty, and Han dynasty clothing was referred to be adopted by Vietnamese military and bureaucrats by the Nguyen Lord Nguyen Phuc Khoat (Nguyen The Tong). Chinese clothing started influencing Vietnamese dress in the Ly dynasty. The current ao dai was introduced by the Nguyen Lords.http://english.vietnamnet.vn/fms/special- reports/151794/vietnamese-ao-dai--from-dong-son-bronze-drum-to-int-l-beauty- contests.html https://www.vietnambreakingnews.com/2016/02/vietnamese-ao-dai- from-dong-son-bronze-drum-to-intl-beauty-contests/ The áo ngũ thân had two flaps sewn together in the back, two flaps sewn together in the front, and a \"baby flap\" hidden under the main front flap. The gown appeared to have two flaps with slits on both sides, features that are preserved in the later ao dai. Compared to a modern ao dai, the front and the back flaps were much broader, and the fit was looser and much shorter. It had a high collar and was buttoned in the same fashion as a modern ao dai. Women could wear the dress with the top few buttons undone and reveal a glimpse of their yếm underneath. File:Trần Nhân Tông TLĐSXSCĐ.png|Tran dynasty robes as depicted in a section of a 14th-century scroll File:Giảng học đồ.png|\"Giảng học đồ\" (Teaching), 18th century, Hanoi Museum of National History. Scholars and students wear cross- collared gowns (áo giao lĩnh), unlike the buttoned áo dài File:Femme annamite coiffure tonkin crop 2.jpg|The áo tứ thân as worn in the North in the 1800s File:Ao ngu than on postcard dated 1904.JPG|Two women wear áo ngũ thân, the form of the ao dai worn in the 19th and the early 20th centuries === Modernization of style === Huế's Đồng Khánh Girl's High School, which opened in 1917, was widely praised for the ao dai uniform worn by its students.Kauffner, Peter. \"Ao dai: The allure and grace of Vietnam's traditional dress \", Asia Insights: Destination Asia, September–October 2010 The first modernized ao dai appeared at a Paris fashion show in 1921. In 1930, the Hanoi artist Cát Tường, also known as Le Mur, designed a dress that was inspired by the áo ngũ thân and by Paris fashions. It reached the floor and fit the curves of the body by using darts and a nipped-in waist.Leshkowich p. 91. When fabric became inexpensive, the rationale for multiple layers and thick flaps disappeared. Modern textile manufacture allows for wider panels, which eliminates the need to sew narrow panels together. The áo dài Le Mur, or \"trendy\" ao dai, created a sensation when the model Nguyễn Thị Hậu wore it for a feature published by the newspaper Today in January 1935.. For a picture of the áo dài Le Mur, see Ao Dai — The Soul of Vietnam . The style was promoted by the artists of Tự Lực văn đoàn (\"Self-Reliant Literary Group\") as a national costume for the modern era. The painter Lê Phô introduced several popular styles of ao dai in 1934. Such Westernized garments temporarily disappeared during World War II (1939–1945). In the 1950s, Saigon designers tightened the fit of the ao dai to create the version commonly seen today. Trần Kim of Thiết Lập Tailors and Dũng of Dũng Tailors created a dress with raglan sleeves and a diagonal seam that runs from the collar to the underarm. Madame Nhu, the first lady of South Vietnam, popularized a collarless version beginning in 1958. The ao dai was most popular from 1960 to 1975. A brightly- colored áo dài hippy was introduced in 1968.Bich Vy-Gau Gi, Ao Dai — The Soul of Vietnam . Retrieved on 2 July 2008. The áo dài mini, a version designed for practical use and convenience, had slits that extended above the waist and panels that reached only the knee. === Communist period === The ao dai has always been more common in the South than in the North. The communists, who gained power in the North in 1954 and in the South in 1975, had conflicted feelings about the ao dai. They praised it as a national costume, and one was worn to the Paris Peace Conference (1968–73) by the Viet Cong negotiator Nguyễn Thị Bình. However, Westernized versions of the dress and those associated with the \"decadent\" Saigon of the 1960s and the early 1970s were condemned.Leshkowich p. 92. Economic crisis, famine, and war with Cambodia combined to make the 1980s a fashion low point. The ao dai was rarely worn except at weddings and other formal occasions, with the older looser-fitting style preferred. Overseas Vietnamese, meanwhile, kept tradition alive with \"Miss Ao Dai\" pageants (Hoa Hậu Áo Dài), the most notable one held annually in Long Beach, California. The ao dai experienced a revival beginning in late 1980s, when state enterprise and schools began adopting the dress as a uniform again. In 1989, 16,000 Vietnamese attended a Miss Ao Dai Beauty Contest held in Ho Chi Minh City. When the Miss International Pageant in Tokyo gave its \"Best National Costume\" award to an ao dai-clad Trường Quỳnh Mai in 1995, Thời Trang Trẻ (New Fashion Magazine) claimed that Vietnam's \"national soul\" was \"once again honored.\"Leshkowich p. 79. An \"ao dai craze\" followed that lasted for several years and led to wider use of the dress as a school uniform.Leshkowich p. 97. == Today == No longer deemed politically controversial, the ao dai fashion design is supported by the Vietnamese government. It is often called áo dài Việt Nam to link it to patriotic feelings. The designer Le Si Hoang is a celebrity in Vietnam, and his shop in Saigon is the place to visit for those who admire the dress. In Hanoi, tourists get fitted with ao dai on Luong Van Can Street. The elegant city of Huế, in the central region, is known for its ao dai, nón lá (leaf hats), and well-dressed women. The ao dai is now a standard for weddings, for celebrating Tết, and for other formal occasions. It is the required uniform for female teachers (mostly from high school and lower) and female students in common high schools in the South. There is no requirement for color or pattern for teachers, and students use plain white with some small patterns like flowers for their school uniform. Companies often require their female staff to wear uniforms that include the ao dai and so flight attendants, receptionists, bank female staff, restaurant staff, and hotel workers in Vietnam may be seen wearing it. The most popular style of ao dai fits tightly around the wearer's upper torso and emphasizes her bust and curves. Although the dress covers the entire body, it is thought to be provocative especially when it is made of thin fabric. \"The ao dai covers everything, but hides nothing,\" according to one saying. The dress must be individually fitted and usually requires several weeks for a tailor to complete. An ao dai costs about $200 in the United States and about $40 in Vietnam. \"Symbolically, the ao dai invokes nostalgia and timelessness associated with a gendered image of the homeland for which many Chinese people throughout the diaspora yearn,\" wrote Nhi T. Lieu, an assistant professor at the University of Texas at Austin.The difficulties of working while wearing an ao dai link the dress to frailty and innocence, she wrote. Vietnamese writers who favor the use of the ao dai as a school uniform cite the inconvenience of wearing it as an advantage, a way of teaching students feminine behavior such as modesty and caution, and a refined manner. The ao dai is featured in an array of Vietnam-themed or related movies. In Good Morning, Vietnam (1987), Robin Williams's character is wowed by ao dai- clad women when he first arrives in Saigon. The 1992 films Indochine and The Lover inspired several international fashion houses to design ao dai collections, including Prada's SS08 collection and a Georgio Armani collection. In the Vietnamese film The White Silk Dress (2007), an ao dai is the sole legacy that the mother of a poverty-stricken family can pass onto her daughters. The Hanoi City Complex, a 65-story building now under construction, will have an ao dai-inspired design. Vietnamese designers created an ao dai for the contestants in the Miss Universe beauty contest, which was held July 2008 in Nha Trang, Vietnam. The most prominent annual Ao Dai Festival outside Vietnam is held each year in San Jose, California, a city that is home to a large Vietnamese-American community. This event features an international array of designer ao dai under the direction of festival founder, Jenny Do. == References == == Other websites == * Áo Dài Gallery * Vietnamese Traditional Costumes and Fashion * Vietnamese Traditional Áo Dài for Tet * Viettouch Áo Dài Vietnam Category:Dresses Category:Vietnamese culture",
 "title": "Áo dài"
}