{
 "id": "1143417",
 "text": "Operation Reinhard or Operation Reinhardt was Nazi Germany's secret plan to kill every Jew in Nazi-occupied Poland during the Holocaust. (In German, it was called Aktion Reinhard or Einsatz Reinhard.) It lasted from March 1942 to November 1943. Operation Reinhard was a detailed plan for how the Nazis could murder several million Jews in an organized and methodical way. To kill as efficiently as possible, the Nazis built three \"murder factories\" - the Belzec, Sobibór, and Treblinka extermination camps.p.161 During Operation Reinhard, the Nazis deported at least 2,000,000 people to these death camps, where they murdered at least 1,700,000 of them. Most were Jews, but some were Poles, Roma people, or prisoners of war from the Soviet Red Army. The death camps made Operation Reinhard the deadliest part of the Holocaust. == Background == In 1939, both Nazi Germany and the Soviet Union invaded (and took over) parts of Poland. The Nazis called their part the General Government. Around 2,284,000 Jews lived in this area.p.69 In January 1942, at the Wannsee Conference, the Nazis officially decided on the Final Solution - a plan to kill all the Jews in Europe. To accomplish this in Poland, they created Operation Reinhard. They named it after Reinhard Heydrich, a Nazi leader who Czech resistance fighters had tried to assassinate. == The secret plan == Operation Reinhard was the Nazis' secret plan to: * Build three killing factories designed for mass murder (the Bełżec, Sobibór, and Treblinka death camps) * Gather all of the Jews in the General Government into ghettos * Deport them all to the death camps * Murder them in the death camps * Dispose of their bodies * Steal their property * Cooperate to accomplish these goals (for example, by working with local police) == The death camps == Also see: Extermination camp As part of Operation Reinhard, the Nazis built the Bełżec, Sobibór, and Treblinka extermination camps. These were \"murder factories\" whose purpose was to kill Jews as quickly and efficiently as possible.p.161 Each camp had permanent gas chambers where the Nazis could kill hundreds of people at a time. At Bełżec, the Nazis experimented on prisoners to find the most efficient ways to mass-murder them. In cattle cars and on trains, the Nazis deported massive groups of Jews to the death camps to be murdered. An unknown number died along the way, since the trains had no heating and people were given no food or water.p.100 Once they arrived at the death camps, most people were sent straight to the gas chambers. Killing people in the gas chambers took as few as 20 minutes. These three camps were not the only ones where Jews died during Operation Reinhard. Around that time, the Nazis also built gas chambers at Majdanek concentration camp. Auschwitz concentration camp already had gas chambers, but the Nazis built larger ones there which could kill 2,000 people at a time - 12,000 per day. === Resistance === Operation Reinhard was a secret plan. However, word spread that the Nazis were deporting people to death camps. People fought back in various ways: > [People made] dramatic attempts to organize the resistance, obtain arms and > prepare for fighting ... Revolts were breaking out in ghettos, especially > uprisings in the Warsaw ghetto (April 19, 1943) and Białystok ghetto (August > 15, 1943) ... [People tried to begin] revolts in the Lvov ghetto (June 1943) > and in Częstochowa (June 1943). Apart from that prisoners of the death camps > in Treblinka (August 2, 1943) and Sobibór (October 14, 1943) rose in > rebellion. In the Sobibór uprising, around 300 people escaped the camp after Jewish prisoners killed \"nine SS men [and] two guards\". Most were recaptured or killed, but around 60 survived World War II. == End == According to the State Museum at Majdanek: \"It was largely due to the Jewish resistance that [Heinrich] Himmler ordered the final ending\" of Operation Reinhard.By the end of November, the Nazis had \"liquidated\" all three of the Operation Reinhard death camps. \"Liquidation\" meant that the Nazis killed everyone left alive in the camp, then destroyed it. They also murdered over 42,000 Jews in two days at Majdanek concentration camp. The Nazis consistently tried to hide proof of their crimes. At many camps, they destroyed documents, buildings, and other evidence showing what they had done. Describing Sobibor on November 23, 1945, Kazimierz Schnierstein wrote: > The gas chamber was blown up, […] the barracks were burnt down or > disassembled and shipped out; the ashes and bone fragments from the cremated > bodies were scattered in shallow ditches and covered with sand. […] Only the > skeletons of residential buildings remain on site (used by the Gestapo and > guards), as the windows, doors and what furniture remained inside have been > [taken] by local residents. == Victims == During Operation Reinhard, the Nazis deported as many as 2,000,000 Jews to Bełżec, Sobibór, and Treblinka. There, they killed at least 1,700,000 people. According to Yad Vashem, around 850,000 people were murdered at Treblinka; 600,000 at Belzec; and 250,000 at Sobibor. Most deportations happened between August and September of 1942. In August alone, the Nazis killed over 300,000 Jews at Bełżec and Sobibór, and another 300,000 at Treblinka. Most victims were from Nazi-controlled Poland. However, Jews were also sent to these death camps from Germany, Austria, Czechoslovakia, Holland, France, Greece, the Soviet Union (Ostland), and Yugoslavia.p.177 The Nazis also murdered an unknown number of non-Jewish Poles, Roma people, and Soviet Red Army prisoners of war at the Operation Reinhard death camps. Often, when people were sent straight from the trains to the gas chambers, the Nazis did not record their names or their deaths. For this reason, it is impossible to say exactly how many people died at each camp. === \"Hyperintense kill rate\" === In just 100 days between late July and early November of 1942, the Nazis killed 1,470,000 people as part of Operation Reinhard. This was a \"hyperintense kill rate\" that was 83% higher than the Rwandan Genocide, which also happened in just 100 days. Overall, throughout Europe, the Nazis killed 2,000,000 Jews in four months between July and October 1942. (This number includes all Jews killed during this time, not just people who died in Operation Reinhard). In recorded history, there has never been another genocide where so many people were killed so quickly. == References == Category:The Holocaust Category:History Category:Genocides in Europe Category:World War II Category:War crimes Category:Crimes against humanity Category:Crimes against prisoners of war",
 "title": "Operation Reinhard"
}