{
 "id": "1143895",
 "text": "Tuileries Garden () is a public garden located between the Louvre Museum and the Place de la Concorde in the 1st arrondissement of Paris. Created by Catherine de' Medici in 1564 as the garden of the Tuileries Palace, it was opened to the public in 1667 and became a public park after the French Revolution. Covering an area of 55 hectares (136 acres), it is one of the most iconic parks in Paris. == History == The garden was originally commissioned in 1564 by Catherine de' Medici, who wanted a space near the Tuileries Palace that resembled the gardens she grew up with in Italy. The name \"Tuileries\" comes from the tile factories (tuileries) that previously occupied the site. In 1664, the renowned landscape architect André Le Nôtre redesigned the garden into a formal French garden, with meticulous lawns, geometric paths, and ornamental lakes. Le Nôtre’s redesign turned the garden into a masterpiece of classical French landscape design, which heavily influenced other European gardens of the era. During the French Revolution, the Tuileries Garden became a place for political gatherings and demonstrations. After the destruction of the Tuileries Palace in 1871, the garden became a standalone public space, further enhanced by additional sculptures and fountains. == Design and layout == The garden is laid out in a formal style typical of French classical gardens, with symmetrical paths, well-manicured lawns, and reflecting pools. It is divided into two large sections: * The Grand Carré (Great Square), a formal area with ornamental ponds, surrounded by perfectly aligned trees and flower beds. * The Grand Couvert, a more wooded section offering shaded paths for strolling. Several major landmarks are visible from the garden, including the Louvre Museum, the Arc de Triomphe, and the Place de la Concorde. The central axis of the garden aligns perfectly with the historical axis of Paris, running from the Louvre to the Axe historique. == Notable monuments and statues == The Tuileries Garden is home to numerous statues and fountains, created by some of the most renowned sculptors in history: * The Arc de Triomphe du Carrousel, built by Napoleon Bonaparte in 1808, stands at the eastern entrance. * Sculptures by artists such as Auguste Rodin, Aristide Maillol, and Henry Moore are scattered throughout the garden. * The Grand Bassin, a large pond surrounded by chairs, offers a serene setting where visitors often relax and admire the view. * The Musee de l'Orangerie, located at the southwest corner of the garden, houses works of impressionist and post- impressionist artists, including Claude Monet’s famous water lilies. == Events and cultural significance == The Tuileries Garden has been a site for many significant historical events, from royal ceremonies to revolutionary gatherings. Today, it is used for: * Paris Fashion Week runway shows. * Annual fairs and public art installations, including contemporary sculpture exhibitions. * Leisure and relaxation, where visitors and locals alike enjoy walking, sunbathing, or picnicking. == Access == The Tuileries Garden is centrally located and accessible by several Paris Métro stations, including Tuileries on line 1 and Concorde on lines 1, 8, and 12. Entry to the garden is free, and it is open year-round. == Related pages == * Louvre Museum * André Le Nôtre * French Revolution * Place de la Concorde * Axe historique == References == * * Category:Buildings and structures in Paris Category:Gardens",
 "title": "Tuileries Garden"
}