{
 "id": "1143707",
 "text": "The Odessa massacre (Romanian: Masacrul de la Odesa; Ukrainian: Голокост в Одесі) was a massacre of Jews in Odessa, Ukraine between October 22 and 24, 1941. 30,000–100,000 Jews are estimated to have been killed within two weeks by the occupation forces of Romania, then-allied with Nazi Germany under the rule of Ion Antonescu. The massacre was part of the Holocaust. * International Commission on the Holocaust in Romania. Final Report. President of the commission: Elie Wiesel. Edited by Tuvia Friling, Radu Ioanid, and Mihail E. Ionescu. Iași: Polirom, 2004. * Ioanid, Radu. The Holocaust in Romania: The Destruction of Jews and Roma under the Antonescu Regime, 1940–1944. Second edition. Published in association with the United States Holocaust Memorial Museum. Lanham, MD: Rowman & Littlefield, 2022. * Kruglov, Aleksander, and Kiril Feferman. “Bloody Snow: The Mass Slaughter of Odessa Jews in Berezovka Uezd in the First Half of 1941.” Yad Vashem Studies 47, no. 2 (2019): 15. * Solonari, Vladimir. A Satellite Empire: Romanian Rule in Southwestern Ukraine, 1941–1944. Ithaca, NY: Cornell University Press, 2019. * Zipperstein, Steven J. The Jews of Odessa: A Cultural History, 1794–1881. Stanford, CA: Stanford University Press, 1985. ==Background== ===History of Jews in Romania=== ====Classical antiquity==== Jews have been living in Romania since the Roman times, mainly along the Black Sea coast, when Romania belonged to the Roman province of Dacia.* * * ====Middle Ages==== More Jews moved to Romania in the 14th century when the Kingdom of Hungary expelled Jews, many of whom became merchants running the trade route between the Ottoman Empire and Polish–Lithuanian Commonwealth. ====Early modern period==== Later Jewish immigration due to expulsion from Spain and Moldova scattered Jews across Romania, who survived there until the 20th century despite centuries of pogroms, while facilitating Romania's industrialization. ====Interwar period==== Romania's WWI victory as one of the Entente powers expanded her territory and Jewish population, when some Jews previously under Russian and Austro-Hungarian rule became Romanians, but antisemitism worsened in Romania. Adolf Hitler's takeover of Germany in 1933 catalyzed fascism in Europe to which Romania was not immune. Laws were passed in the Romanian parliament to restrict Jews from every part of society, while Jewish members no longer existed in the parliament. Right before WWII, over 43,500 Jews lived and 146 synagogues existed in Iași. As of August 2024, only 326 Jews and two synagogues remained, a 99.3% drop in Iași's Jews in comparison. ===World War II=== During WWII, after occupying much of Western Europe and the Balkans, Nazi Germany and some of her Axis alliesItaly, Hungary, Finland and Slovakia. launched the Operation Barbarossa on 22 June 1941 to invade the Soviet Union as part of Hitler's plan to colonize Eastern Europe. They made initial success by capturing most of Ukraine, Belarus and knocking on the gates of Moscow within four months. On 16 October 1941, Romanian forces took over Odessa, when 70,000–120,000 Jews were trapped in the city, some of whom were Jewish refugees from Bessarabia. The massacre was preceded by escalating violence towards Jews by the antisemitic IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. Romanian troops. On 22 October 1941, the Romanian military headquarters in Odessa was blown up mysteriously. Jews were blamed together with communists by Antonescu, who ordered the massacre. ==Massacre== Within two days, at least 5,000 Jews had been hanged, while another few thousand were deported to the nearby village of Dalnyk. The victims were confined to barns, sheds and warehouses, which were later sprayed with machine gunfire and set ablaze. Jews who tried to escape met their fate immediately, while some buildings with Jews were blown up by Romanian troops, causing thousands to perish instantly. Thousands more were slain in mass shootings, some of whom were also burned alive in artillery warehouses. Around 25,000 Jews who had not been killed were deported to a ghetto in Odessa's neighborhood Slobidka, where they endured cold and hunger for the remainder of the war. Holocaust experts estimated the death toll at Dalnyk alone was at least 20,000. ===Death march=== By the end of October 1941, 25,000–30,000 Jewish deportees were forced on a death march to the Bogdanovka concentration camp, where the deportees were crowded in pigsties. Almost all of them were also slain in subsequent mass shootings or burned alive * * * * Ancel, J. 2003. Transnistria. 1941–1942. The Romanian Mass Murder Campaigns. Tel-Aviv: Goldstein-Goren Diaspora Research Center. * Achim, V. 2009. “Die Deportation der Juden nach Transnistrien im Kontext der Bevölkerungspolitik der Antonescu- Regierung.” In Holocaust an der Peripherie. Judenpolitik und Judenmord in Rumänien und Transnistrien 1940 – 1944, edited by W. Benz, and B. Mihok, 151–61. Berlin: Metropol. * Desbois, P. 2018. Broad Daylight. The Secret Procedures behind the Holocaust by Bullets. La Vergne: Arcade Publishing. by the end of January 1942, when the Soviets pushed back the Axis invaders from the outskirts of Moscow. Meanwhile, Romanian forces burned the Jewish corpses to destroy evidence of the genocidal massacre. By autumn 1942, over 90% of pre-war Odessa's Jews had already perished. ===Nazi German involvement=== Despite Romanian forces having carried out most of the atrocities in Odessa, they were backed up by the Nazi German SS Einsatzgruppe D, who shot some Jews from the Fontans'ka Street prison and were hunting down Jews until November 1941, whose inflicted death toll numbered in thousands. It is recorded that ethnic Germans in Odessa formed the militias Selbstschutze to facilitate the Holocaust in the area. ==Aftermath== ===Survivors=== Around 1,000 Karaite Jews survived the war as Hitler designated them as \"Turks\" and spared them from death. A handful of other Jews, who were either forced laborers or hiding under false identities, also survived. Vera Bakhmutskaia, an Odessan Jew who survived the war by hiding in the house of a gentile friend, said, The Soviets retook Odessa on 10 April 1944 and conducted a census within two months, finding that Jews in Odessa had fallen from the pre-war level of 200,000 to 2,640, a 98.7% drop. ===Trial=== Together with Ion Antonescu, other instigators including Gheorghe Alexianu,Former Romanian fascist governor of Transnistria. were sentenced to death in 1946. ===Gentiles who saved Jews=== Dozens of gentiles in Odessa who saved Jews have been recognized by the Yad Vashem as the Righteous Among the Nations. * * * * * ===Denial=== ====Communist age (1947 – 1989)==== Under Nicolae Ceaușescu's communist rule, Romania's role in the Holocaust was officially denied. It was blamed entirely on the German and Hungarian fascists. Romanians were taught about the \"heroic anti-fascist resistance\", emphasizing the anti-Nazi battles following Romania's defection to the Allies. Many former subordinates of Ion Antonescu served in the secret police of Nicolae Ceaușescu and to help him oppress Romanians. Meanwhile, Nicolae Ceaușescu reportedly believed lies about Jews, including The Protocols of the Elders of Zion, and defined Jew as a \"money- changer\" and an \"extortionist\" in an official English–Romanian dictionary. ====Post-communist age (1989 – )==== Since the fall of Ceaușescu's communist regime, a systematic effort to whitewash the war criminals, especially Ion Antonescu, has been observed by scholars. Antonescu is praised by some so- called historians as a hero who waged a \"holy war against Bolshevism.\" Acts of Holocaust denial Distortion of the Holocaust refers, inter alia, to: by politicians occurred from time to time, notable of whom include Ion Iliescu, the former President of Romania (2000 – 2004). He made similar claims to those of Ceaușescu that there was \"no Holocaust within Romania\" and that the Poles, Jews and communists \"were treated equally\", while denying the Romanian role in the Holocaust and the verified Romanian Jewish death toll. ====Countermeasures==== An international inquiry, led by Romanian-American Jewish writer Elie Wiesel, identified all the evidence of Romania's role in the Holocaust. The Elie Wiesel National Institute for Studying the Holocaust in Romania (Romanian: Institutul Național pentru Studierea Holocaustului din România „Elie Wiesel”, INSHR), a state-funded Holocaust research center, was also founded in 2005. In November 2021, the Romanian parliament passed a law, by a large majority, to require the teaching of the Holocaust and Jewish history from 2023. The only group opposing it was the nationalist party Alliance for the Union of Romanians (AUR). The AUR was condemned by the INSHR. Since September 2023, the Holocaust and Jewish history have become part of the high school curriculum in Romania. ==Related pages== * Babi Yar * Iași pogrom * Kristallnacht * Jedwabne pogrom * Rhineland massacres ==References== Category:Nazism Category:Racism Category:Ukraine Category:Romania Category:Massacres Category:War crimes Category:Antisemitism Category:20th century Category:World War II Category:The Holocaust Category:1940s in Europe Category:History of Europe Category:Antisemitism in Europe",
 "title": "Odessa massacre (1941)"
}