{
 "id": "1143327",
 "text": "Minyobates steyermarki (old name: Dendrobates steyermarki) is a frog in Dendrobatidae group. It lives in Cerro Yapacana in Venezuela. People call it the demonic poison frog, demonic poison-arrow frog, and Yapacana's little red frog. It is the only species in the genus Minyobates. ==Body== Minyobates steyermarki is a small frog. From nose to rear end, it can be as big as but it is usually shorter than . It has a wide head with a short nose. The front legs are long and thin, and the toes of all four feet have disks on the toes for climbing, but the disks on the front feet are bigger. The skin of the frog's back is red or red-brown in color. It has many black spots. The legs can be red or pink in color. There are dark marks on the belly. ==Home== The frog lives in tepui forests on mountains. Minyobates steyermarki lives on the ground in wooded areas with trees high. People see it on rocks that have moss on them. The frog's young live in bromeliad plants. Scientists saw it in only one place: Cerro Yapacana in Venezuela. Cerro Yapacana is a tepui. This is a piece of land shaped like a table. It comes up from the Orinoco and Ventuari Rivers. It is as high as . The nearby rainforest is above sea level. The plateau is in Yapacana National Park. There is a lot of rain on this tepui. The temperature changes between . ==Young== The frog's young live in bromeliad plants. when humans keep the frogs, they see female frogs lay 3 to 9 eggs at a time. They lay them in hidden places with lots of water in the air. The male frogs watch the eggs. After the eggs hatch, they carry the tadpoles to water in bromeliad plants. These tadpoles swim and grow there. ==Danger== The International Union for Conservation of Nature says assessed Minyobates steyermarki is in big danger of dying out. This is because all of its home is only in size. There were many frogs living on the tepui in 1999, but there are not as many now. Wildfires could kill many frogs, and people dig big holes to get gold. This can change the way the rivers move and make bad chemicals. Some of these mines are legal and some are against the law. ==References== Category:Frogs of South America",
 "title": "Minyobates steyermarki"
}