{
 "id": "1143481",
 "text": "This is a tours and television performances by British singer and songwriter Charli XCX. ==Headlining tours== Title Dates Associated album(s) Continent(s) Shows Gross Attendance Girl Power North America Tour – 25 October 2014 Sucker North America 20 Charli and Jack Do America Tour – 10 October 2015 Sucker Strange Desire North America 13 Number 1 Angel Tour – 22 April 2017 Number 1 Angel North America, Europe 4 Pop 2 Tour – 23 October 2018 Pop 2 North America, Europe, Oceania 5 Charli Live Tour – 9 February 2020 Charli North America, Europe, Oceania 46 How I'm Feeling Now Tour – 24 October 2021 How I'm Feeling Now North America, Europe 3 Crash: The Live Tour – 2 March 2023 Crash North America, Europe, Asia, Latin America, Oceania 69 Sweat (co-headlined with Troye Sivan) – 23 October 2024 * Brat (Charli XCX) * Something to Give Each Other (Troye Sivan) North America 22 ==Supporting tours== Title Dates Artist Continent(s) Shows Gross Ref. Show Us Yours Tour 2011 The Ting Tings Europe Terror Tour 2012 Sleigh Bells North America Mermaid Ball Azealia Banks North America 1 Mylo Xyloto Tour Coldplay Europe / North America 13 $42,740,908 Europe box score: * * * * The Halcyon Days Tour 2013 Ellie Goulding Europe The Lonely Hearts Club Tour Marina and the Diamonds North America The Self-Titled Tour Paramore Europe 7 Prismatic World Tour 2015 Katy Perry Europe 20 $3,518,983 Europe box score: * * Hopeless Fountain Kingdom Tour 2017 Halsey North America 26 $7,328,715 Nostalgic for the Present Tour Sia Oceania 3 $5,531,210 Styles, Aja. \"Sia brings first Australian tour in five years to Melbourne, Sydney only\", The Sydney Morning Herald, 28 May 2017 Reputation Stadium Tour 2018 Taylor Swift North America, Europe, Oceania, Asia 53 $345,700,000 Totals 123 $404,819,816 ==Television performances== Program Year Songs Notes JBTV 2013 *\"You (Ha Ha Ha)\" *\"Grins\" *\"Take My Hand\" *\"You're the One\" *\"Lock You Up\" *\"What I Like\" Late Night with Seth Meyers 2014 *\"Fancy\" Performed alongside Iggy Azalea Jimmy Kimmel Live! *\"Fancy\" Performed alongside Iggy Azalea Billboard Music Awards *\"Fancy\" Performed alongside Iggy Azalea MTV Video Music Awards *\"Boom Clap\" Pre-show 4Music * \"Boom Clap\" MTV Europe Music Awards *\"Boom Clap\" *\"Break the Rules\" American Music Awards *\"Boom Clap\" *\"Break the Rules\" *\"Fancy\" \"Fancy\" was performed alongside Iggy Azalea Saturday Night Live * \"Boom Clap\" * \"Break the Rules\" Le Grand Journal 2015 *\"Boom Clap\" *\"Break the Rules\" BBC Radio One Live Lounge * \"Doing It\" * \"Shake It Off\" MTV Movie Awards *\"Famous\" *\"Drop That Kitty\" \"Drop That Kitty\" was performed alongside Ty Dolla Sign and Tinashe triple j *\"On Fire\" Performed alongside Carmada Sunday Brunch 2017 * \"Boys\" (acoustic) Jimmy Kimmel Live! * \"After the Afterparty\" * \"Bounce\" Like a Version * \"Boys\" triple j series BBC Radio One Live Lounge 2018 * \"IDGAF\" Performed alongside Dua Lipa, Zara Larsson, MØ, and Alma The Tonight Show Starring Jimmy Fallon * \"1999\" Performed with Troye Sivan Taylor Swift: Reputation Stadium Tour * \"Shake It Off\" Performed with Taylor Swift and Camila Cabello BBC Radio One Live Lounge 2019 * \"Gone\" * \"TOOTIMETOOTIMETOOTIME\" \"Gone\" was performed with Christine and the Queens The Jonathan Ross Show * \"Gone\" Performed with Christine and the Queens The Tonight Show Starring Jimmy Fallon * \"Gone\" Performed with Christine and the Queens The Tonight Show Starring Jimmy Fallon 2021 * \"Good Ones\" Saturday Night Live 2022 * \"Beg for You\" * \"Baby\" ==Web performances== Program Year Songs Notes Perez Hilton TV 2013 * \"Superlove\" ==References== * XCX, Charli",
 "title": "List of Charli XCX live performances"
}