{
 "id": "1143955",
 "text": "The 1921 France–Great Britain women's athletics match was an international women's athletics competition where a national team of female French athletes competed against a national team of France. It took place at Stade Pershing in Paris, France on 30 October 1921. In 1921 the irst international women's athletics competitions were held. It was the second match of France, after the 1921 Belgium–France women's athletics match on 28 August. The match was won by Great Britain with 48 points versus France with 38 points. During the event also an international women's football match between France and Great Britain was played. ==Competition format== The competition consisted of 6 individual events and a relay event. The overall classification is a nation's classification. The winner of each event received 5 points, the number two received 3 points, followed by 2 points and 1 point. The winner of the relay received five points, with the number two receiving two points. For the overall classication, all points scored by the athlete from each country are added together. ==Entrants== Names and events in italics or ~~striked~~ are differenced between the entry and athletes competing in the events. France Name Event Cecile Maugars 100 yards High jump Long jump Relay Andree Paturaud 100 yards Relay (R. Long jump) ~~Raymonde Canolle~~ ~~300 metres~~ Therese Renaut 300 metres Lucie Bréard 1000 metres ~~(R.~~ 300 metres~~)~~ (R. Relay) Juliette Petit 1000 metres Yvonne De Wynne Relay Therese Micault 100 yards hurdles Helene Rillac 100 yards hurdles Relay Bréhon High jump M. Fausse Javelin throw Merhand Javelin throw Evelyne Welker Long jump Reserves Reserves Lucie Cadiès (R. 1000 metres) Canus (R. 100 yards hurdles) Georgette Guellier (R. High jump) Jeanne Janiaud (R. Javelin throw) Puissais (R. 100 yards) Germaine Robin (R. Relay) Great Britain Name Event 300 metres Relay (R. 100 yards) Agnes Garton 100 yards Relay (R. 300 metres) Mary Lines 100 yards 300 metres Long jump Relay (R. Javelin throw) 100 yards hurdles Javelin throw Relay (R. 100 yards) Violet Courtney 1000 metres Collins 1000 metres Hilda Hatt 100 yards hurdles High jump Long jump (R. relay) Florence Birchenough High jump Javelin throw (R. Relay) ==Competition== ===100 yards=== Place Athlete Time Points Note 1 11.8 sec 5 2 3 3 2 4 1 ===Javelin throw=== The score was made by a trow by each arm. Place Athlete Distance Points Note 1 37.47 m 5 2 34.33 or 34.23 m 3 3 31.80 m 2 4 30.38 m 1 ===High jump=== Place Athlete Total Height Note 1 1.35 m 5 2 1.33 or 1.32 m 3 3 1.28 m 2 4 1.20 or 1.25 m 1 ===300 metres=== Place Athlete Time Points Note 1 43.8 sec 5 WR 2 3 3 2 4 1 ===100 yards hurdles=== Place Athlete Distance Points Note 1 13.6 or 15.6 sec 5 2 3 3 2 4 / DNF 1 fallen ===Half mile relay=== Place Team Time Points Note 1 1:53 6 2 Cecile Maugars Andree Paturaud Yvonne De Wynne Helene Rillac 1:58 m 3 https://bases.athle.fr/asp.net/athletes.aspx?base=selections&seq;=475251484950475249505049 ===1000 metres=== Place Athlete Distance Points Note 1 3:27.8 5 2 +10 m 3 3 2 4 1 ===Long jump=== Place Athlete Distance Points Note 1 4.56 m 5 2 4.47 m 3 3 4.45 m 2 4 4.33 m 1 ==Overall classification== Rank Athlete Points 1 48 2 38 ==References== ==Other websites== *images of the event Category:1920s in women's athletics Category:Sport in France Category:1921 in sports Category:1920s in France Category:20th century in France Category:Paris Category:1921 in Europe",
 "title": "1921 France–Great Britain women's athletics match"
}