{
 "id": "1143157",
 "text": "The Alexander Dennis Enviro200 MMC (short for Major Model Change) is a single- decker bus. It has a low floor. It has been made from 2014 to the present day. It is built by Alexander Dennis. == Enviro200 MMC == From 2014 to the present day, Alexander Dennis make a single-decker bus called the Enviro200 MMC. The Enviro200 MMC has different lengths, the lengths are; 8.9 metres, 9.7 metres, 10.8 metres, 11.5 metres and 11.8 metres. The Enviro200 MMC replaced the Enviro300. In 2018, It replaced the Enviro200. === Gallery === File:2017 Alexander Dennis Enviro 200 MMC - 52812031128.jpg|Arriva London Enviro200 MMC in 2023 File:DXE 30286 at Morden Station.jpg|RATP Group London Enviro200 MMC with double doors (doors in the middle) in London in 2024 File:Exeter Bampfylde Street - Stagecoach 37440 (SN16ORX) rear.JPG|Stagecoach South West Enviro200 MMC rear in 2019 File:2501 NWFB 63 03-09-2018.jpg|New World First Bus Enviro200 MMC with air-conditioning in Hong Kong in 2018 File:Enviro200-BusExpo2016-P1390377 (30138343813).jpg|Trentbarton Enviro200 MMC at the Euro Bus Expo in 2016 == Enviro200 XLB == In 2017, Alexander Dennis made a 3-axle bus called the Enviro200 XLB, It was made for the New Zealand market. Ritchies Transport ordered twenty-eight Enviro200 XLBs, and Birkenhead Transport ordered twenty-five Enviro200 XLBs. === Gallery === File:RT1098.jpg|Ritchies Transport Enviro200XLB at Constellation bus station in 2017 File:Auckland School Bus 075.jpg|Ritchies Transport Enviro200XLB in November 2023 == Enviro200AV == From 2019 to the present day, Alexander Dennis make a driverless bus called the Enviro200AV In 2019, Alexander Dennis made a Enviro200 MMC autonomous bus with driverless software. It was tested at Stagecoach Manchester's Sharston bus depot, It did tasks such as driving to the bus washing station, driving to a petrol pump in the depot and then parking up at a parking space in the depot on its own. After this test Alexander Dennis called the bus the Enviro200AV (short for Autonomous Vehicle). In 2023, Stagecoach East Scotland ordered five Enviro200AVs for a park-and-ride route across the Forth Road Bridge. It starts from Ferrytoll and ends at Edinburgh Park station. The bus has 'safety drivers' who are in the drivers cab, they monitor the driverless technology and can still control the bus. The bus also has 'bus captains', they help passengers getting on and off the bus. One Stagecoach Enviro200AV was exported to Dubai for trials with Roads and Transport Authority. === Gallery === File:Stagecoach autonomous E200 MMC trial.jpg|Stagecoach Manchester Enviro200AV in 2019 File:Stagecoach Autonomous Bus (62003, YX69 NUP) at Edinburgh Park.jpg|Stagecoach East Scotland Enviro200AV at Edinburgh Park in 2023 File:Stagecoach - Autonomous Bus - Jun 13, 2022.jpg|Stagecoach East Scotland Enviro200AV rear prototype at Edinburgh Park in 2022 == References == == Other websites == *Enviro200 MMC online product description Enviro200 MMC",
 "title": "Alexander Dennis Enviro200 MMC"
}