{
 "id": "1143377",
 "text": "Carlo Maria Viganò (born January 16, 1941) is an Italian Archbishop of the Roman Catholic Church, currently under excommunication (he is forbidden from receiving or administering the sacraments). He was excommunicated due to his public opposition to the authority of Pope Francis and his refusal to submit to the Church’s teachings. Viganò served as the Apostolic Nuncio to the United States from 2011 until 2016 and has been a highly controversial figure within the Church. == Early life and ordination == Viganò was born in Varese, Italy. He was ordained as a priest on March 24, 1968, by Luigi Cardinal Traglia. After completing his education at the Pontifical Ecclesiastical Academy, he entered the Vatican diplomatic service in 1973. == Diplomatic career == Viganò held various diplomatic posts throughout his career. In 1992, he was appointed Apostolic Nuncio to Nigeria and was consecrated as a bishop by Pope John Paul II on April 26, 1992. == Apostolic Nuncio to the United States == In 2011, Pope Benedict XVI appointed Viganò as Apostolic Nuncio to the United States. One of his roles was overseeing the investigation of sexual abuse cases within the U.S. Church, specifically regarding former Cardinal Theodore McCarrick. == Criticism of Pope Francis and excommunication == After retiring in 2016, Viganò became a critic of Pope Francis. In 2018, he published a letter accusing Pope Francis of knowing about the allegations of sexual abuse against Cardinal Theodore McCarrick and failing to act. Viganò's letter called for Pope Francis’ resignation, accusing him of complicity in covering up McCarrick’s abuses. His refusal to retract these accusations and submit to the authority of the Holy See resulted in his formal excommunication in 2024, which means he is no longer allowed to participate in the sacramental life of the Church. == Related pages == * Roman Catholic Church * Theodore McCarrick * Pope Benedict XVI == References == == Other websites == * Catholic-Hierarchy: Archbishop Carlo Maria Viganò Category:1941 births Category:Living people Category:Catholic Church sexual abuse scandals Category:Italian Roman Catholic bishops Category:People excommunicated by the Catholic Church Category:People from Varese Category:Diplomats of the Holy See",
 "title": "Carlo Maria Viganò"
}