{
 "id": "1143984",
 "text": "On 23 October 2024, five people were killed and 22 injured in a terrorist attack on the headquarters of Turkish Aerospace Industries (TAI) in Kahramankazan, Ankara. The two suspects were later killed. == Background == TAI is a Turkish company that works on defense and aviation. One of its main projects is the TAI TF Kaan, Turkey's first home-built combat plane. The attack happened as a big trade fair for defense and aerospace in Istanbul. Ukrainian foreign minister Andrii Sybiha was visiting a weapons exhibition at the time. The attack happened one day after Devlet Bahçeli, the leader of a far-right party and an ally of President Recep Tayyip Erdoğan, suggested that Abdullah Öcalan, the jailed leader of the Kurdistan Workers' Party (PKK), could get parole if he agreed to stop violence and disband his group. == Attack == The attack happened at around 16:00 TRT on the headquarters of Turkish Aerospace Industries in Kahramankazan, from Ankara. It took place during a shift change. The attackers came in a taxi, set off a bomb, fired guns, and entered the building. A large fire started later. Security footage showed one attacker with a backpack and a rifle, and one was a woman. Staff were evacuated, and emergency teams arrived. There were also clashes in a nearby parking lot, and some hostages were taken. Seven people died, including two attackers, while 22 others were injured. == Victims == The victims were named as: * Cengiz Coşkun, a quality control officer * Zahide Güçlü, a mechanical engineer * Hasan Hüseyin Canbaz, a TAI employee * Atakan Şahin Erdoğan, a security guard * Murat Arslan, the driver of the taxi The perpetrators were a man and a woman. == Perpetrators == The Turkish government said the perpetrators of the attack were members of the PKK. One of them was a man named Ali Orek, who had the codename \"Rojger\" and was born in 1992 in Beytüşşebap, Şırnak Province. They used AKS-74U weapons, which are used by the PKK. == Aftermath == Ebubekir Şahin, Chairman of the Radio and Television Supreme Council (RTÜK), announced that a broadcast ban was put on the attack, and social media platforms like X, Instagram, Facebook, and YouTube were slowed down and restricted. the Turkish military also launched strikes on 47 Kurdish rebel positions—29 in northern Iraq and 18 in northern Syria. The next day, the Syrian Democratic Forces said Turkey's attacks killed 12 civilians, injured 25 others, and hit two train stations. Security checks were tightened at TAI headquarters and Istanbul's airports. Funerals for some victims were held on 24 October. == Reactions == Interior Minister Ali Yerlikaya called it a \"terrorist attack\" and said, \"Sadly, we have martyrs and injured people\". Ankara metropolitan mayor Mansur Yavaş said he was \"deeply saddened\" by the news. Justice Minister Yılmaz Tunç announced an investigation into the attack. Transport minister Abdulkadir Uraloğlu and opposition leader Özgür Özel also condemned the attack. TUSAŞ general manager Mehmet Demiroglu left a defense fair to return to the headquarters. Mark Rutte, secretary-general of NATO, showed support for Turkey after the attack. == References == Category:2024 crimes in Europe Category:2020s building bombings Category:2020s in Turkey Category:Building bombings in Europe Category:October 2024 events",
 "title": "2024 Turkish Aerospace Industries headquarters attack"
}