{
 "id": "1143178",
 "text": "Annalisa Scarrone (born 5 August 1985), also known as Annalisa or Nali, is an Italian singer-songwriter and record producer. Annalisa has been in the Sanremo Music Festival many times. She has gotten many awards for her songwriting and music. An asteroid was named after her in 2024. == Early life == Scarrone grew up in Carcare. When she was thirteen, she was a bartender and musician. Scarrone went to the University of Turin. She graduated with a degree in physics in 2009. == Personal life == On June 29, 2023 in Assisi, Scarrone married Francesco Muglia, the Vice President of Global Marketing of Costa Crociere. == Music career == === 2011–2013: Nali, Mentre tutto cambia and Non so ballare === In 2011, Annalisa was in the Italian talent show Amici di Maria De Filippi. She was in second place. In March 2011, her first album was let out. It was called Nali. It reached number two in the Italian album chart. Nali was given platinum. Annalisa made her first single. It was called \"Diamante lei e luce lui\". It reached number nine in the Italian single chart in 2012. It was given gold. Her second single, \"Giorno per giorno\" was released on 27 May 2011. In 2013, she was in the Sanremo Music Festival and was ninth place. She sang the single \"Scintille\". She later showed for Italy at International Song Contest: The Global Sound with \"Scintille\". In November, she won. === 2014–2016: Splende and Se avessi un cuore === On April 1, 2014, Annalisa was on Incredibile. On April 14, 2014, it was said that the single \"Sento solo il presente\" would make the let out of her next studio album. \"Sento solo il presente\" was let out in Italy on May 5, 2014. It reached seventh place in the Italian single chart. In September 2014, Annalisa let out the single \"L'ultimo addio\".On December 14, 2014, Annalisa was in the Sanremo Music Festival 2015. She sang the song \"Una finestra tra le stelle\". She was fourth place. On May 8, 2015, \"Una finestra tra le stelle\" was given platinum. Annalisa was at the Sanremo Musical Festival 2016. She sang \"Il diluvio universale\". She was eleventh place. On 15 April 2016, the singer let out a single called \"Se avessi un cuore\". \"Se avessi un cuore\" was later given gold. === 2017–2021: Bye Bye and Nuda === On August 30, 2017, Annalisa said she was working on her next album. On October 13, the first single was let out. On February 16, 2018, she let out the album Bye Bye. The album was at number two of FIMI's chart. \"Bye Bye\" was given platinum. Annalisa took part at the Sanremo Music Festival for the fourth time. She was third place. She sang the song \"Il mondo prima di te\". The song was number three on the Italian singles chart. In 2018, she let out two more singles. They are called \"Bye Bye\" and \"Un domani\". Annalisa made these songs with Mr. Rain. On April 13, 2020, she let out \"Houseparty\". On May 28, 2021 \"Movimento lento\" was let out. The song was at number eight on the FIMI Singles Chart. It was given platinum in Italy. === 2022–present: E poi siamo finiti nel vortice === On March 31, 2023, Annalisa let out the single \"Mon amour\". On May 25, 2023, Annalisa let out the single \"Disco Paradise\". \"Disco Paradise\" was number three on the Italian singles chart. \"Disco Paradise\" was given platinum in Italy. In June 2023, Annalisa said that her next album would be let out soon. The album is called \"E poi siamo finiti nel vortice\". On August 30, 2023, Annalisa showed the cover of E poi siamo finiti nel vortice. Annalisa said that it would be let out on September 29, 2023. On 4 September 2023, Annalisa announced the album's third single, \"Ragazza sola\", would be released on 8 September 2023. The song was at number twenty-four on the Italian singles chart. It was given platinum in Italy. E poi siamo finiti nel vortice was number one on the Italian albums chart. The album was given platinum. On 17 November 2023, \"Euforia\" was let out. Annalisa was in the Sanremo Music Festival 2024. She sang the song \"Sinceramente\". She was third place. \"Sinceramente\" was number two on the Italian singles chart. \"Sinceramente\" was also given platinum. On 14 February 2025, the fourth night of the Sanremo Music Festival 2025, Giorgia sang a cover of \"Skyfall\" with Annalisa; the song won the night. == Filmography == === Television === Year Title Role Notes 2010–2011 Amici di Maria De Filippi Contestant Runner-up (season 10) 2013 Sanremo Music Festival 2013 Contestant Annual music festival 2015 Sanremo Music Festival 2015 Contestant Annual music festival 2015–2019 Tutta colpa di… Host Scientific information program 2016 Sanremo Music Festival 2016 Contestant festival 2018 Sanremo Music Festival 2018 Contestant Annual music festival 2021 Sanremo Music Festival 2021 Contestant Annual music festival 2023 Drag Race Italia Special guest Season 3; Episode: \"Express Yourself\" 2024 Sanremo Music Festival 2024 Contestant Annual music festival === Film === Year Title Role Notes 2015 Babbo Natale non viene da Nord India Acting debut == References == Category:1985 births Category:Italian pop singers Category:Italian singer-songwriters Category:21st-century Italian singers Category:21st-century Italian songwriters Category:Living people Category:People from Savona Category:Synth- pop singers Category:Italian record producers",
 "title": "Annalisa"
}