{
 "id": "114322",
 "text": "Wii Sports is a sports game made by Nintendo for the Wii system in late 2006. It was bundled with the Wii (except in Japan). (This means that when people bought a Wii, they would also get a copy of Wii Sports). The game has five sports which can be played - tennis, golf, baseball, bowling, and boxing. The rules for each sport are simplified to make them easier for new players. Although its main criticism is its lack of detail, its motion sensing gameplay and accessibility had a big impact on the video game market. Wii Sports was well received and got lots of awards. It sold over 82 million copies by the end of 2017. This makes it the best selling single-platform game of all time, and fourth best overall. == Gameplay == Wii Sports is a collection of five separate sports games: tennis, baseball, bowling, golf, and boxing. The games use the motion-sensing Wii Remote in different ways. When playing the games, the player moves the Wii Remote in a similar way to how the games are played in real life. They can hold and swing the Wii Remote like a golf club, baseball bat or bowling ball. Some parts of the gameplay are computer controlled. For example, in tennis, the players movement is controlled by the Wii, and the swinging of the racket is controlled by the player. Baseball uses batting and pitching, with all of the fielding controlled by the Wii. The characters in the game are Miis. Wii Sports is the first Wii game to use Miis. Players can choose which Mii they want to play as. Miis saved on the Wii will be in the crowd during bowling games and as team members in baseball. The non- player characters in the game were also created using the Mii Channel. After a game, a player gains or loses skill points based on how well they played compared to the computer's skill level. Some games do not calculate points if the player is playing with other people (multiplayer) and not with a computer (single-player). The game keeps track of points by putting them on a graph. The more skill points a player has, the more people will be in the crowd during some games like Tennis and Boxing. If a player gets 1000 skill points, they get the \"Pro\" rank. The \"Pro\" rank gives the player some new features, such as a shiny bowling ball when playing Bowling. If a player gets the \"Pro\" rank, the game will put a message on the Wii Message Board. Wii Sports also has a fitness test that calculates a player's fitness age (from 20 to 80 years old, 20 being the best possible). The test uses the player's performance in three randomly chosen challenges in each test from the training mode. The fitness test can only be taken once a day for each Mii. Fitness age takes into account a player's balance, speed, and stamina. Fitness age results are graphed over one, two, or three months, with daily results on the Wii Message Board. == Development == Wii Sports was made by Katsuya Eguchi, who managed a software development group at Nintendo. The aim of the Wii was to appeal to people who had not played video games before. To do this, they needed a game that let both experienced and new players play in a fun way. Nintendo also wanted people to use the Wii daily, so they wanted to make Wii Sports a flagship game. This is why Wii Sports has such simple graphics and gameplay. Eguchi needed a widely familiar theme for the game, so he chose sports. Instead of having professional athletes or realistic graphics, the game was designed to be easy so complicated gameplay was left out. Motion-sensing actions used the Wii Remote's accelerometer to interpret movements, and Nintendo focused on actions like hitting to make them very realistic. Nintendo did not think players would buy the Wii just to play Wii Sports, so they bundled it with the console, which helped it to sell a lot of copies. == Reception == Overall, Wii Sports was received well by critics for its basic pick-up and play style, even though it was criticised for lacking in graphic quality and not having much depth. It received awards such as 6 BAFTA Gaming awards in 2007. In 2009, it outsold Super Mario Bros to become the bestselling video game of all time. In fact, it had sold 60.67 million copies worldwide by the end of 2009, which has now increased to 82.88 million copies, making it Nintendo's highest sold game. Wii Sports has been featured on television in Wii commercials, news reports, and other programming. Many competitions and social gatherings have been held by players of all ages to play it. It is even used in some care homes so that elderly people can exercise. == Sequels == A sequel, Wii Sports Resort, was released in 2009. This was released with the Wii Motion Plus accessory. The game has 12 sports. Golf and Bowling, which were in Wii Sports, are also in this game. A high-definition remake of the game, Wii Sports Club, was released in 2013 for the Wii U. In February 2022, Nintendo announced a sequel to the game for the Nintendo Switch. This sequel is called Nintendo Switch Sports. It was released on April 29, 2022. Tennis and bowling, which were in Wii Sports, are playable in the game. A third game from Wii Sports, Golf, was added in Fall 2022. == References == Category:2006 video games Category:Baseball video games Category:Bowling video games Category:Boxing video games Category:Casual games Category:Golf video games Category:Multiplayer and single-player video games Category:Multiple-sport video games Category:Nintendo Entertainment Analysis and Development games Category:Nintendo video games Category:Pack-in video games Category:Sports video games Category:Tennis video games Category:Video games developed in Japan Category:Wii games Category:Wii-only games",
 "title": "Wii Sports"
}