{
 "id": "1143848",
 "text": "Racism in Poland has been a subject of research, especially in the field of modern history, for the past three decades. Ethnic minorities had formed a sizeable proportion of Poland's population ‒ from the early Polish state to the Second Polish Republic ‒ until the Holocaust happened. * * * * After World War II, Polish government statistics found that 94% of the population identified as Polish.Główny Urząd Statystyczny, Wyniki Narodowego Spisu Powszechnego Ludności i Mieszkań 2011 , Warszawa 2012, pp. 105-106Polish population census 2002 nationalities tables 1 or 2 ==Recent trend== As per the Office for Democratic Institutions and Human Rights (ODIHR) of the Organization of Security and Co-operation in Europe (OSCE), hate crimes recorded by the Police of Poland dropped between 2018 and 2020, but rose steadily until 2022, reaching a level higher than 2018 (table below). Of the 440 prosecuted hate crimes, 268 (61%) were racist and xenophobic hate crimes, seconded by 87 (20%) antisemitic hate crimes, while only 6% were allegedly anti-Muslim hate crimes (25). Year Hate crimes recorded by police Prosecuted Sentenced 2022 1,180 440 312 2021 997 466 339 2020 826 374 266 2019 972 432 597 2018 1,117 397 315 ==Jews== ===Middle Ages=== King Casimir III the Great brought Jews to Poland during the Black Death when Jewish communities were persecuted across Europe. ===Modern period=== By mid-16th century, 80% of world Jewry lived in Poland.\"Poland – Virtual Jewish History Tour\" at Jewish Virtual Library via Internet Archive.\"Polish Jews History\", at PolishJews.org via Internet Archive. During the 15th century, radical Catholics in Kraków incited pogroms in 1469. In 1485, Jewish elders were forced to stop trading in Kraków. After the 1494 Kraków fire, pogroms happened again. King John I Albert forced the Jews to move to Kazimierz.The Torah Ark in Renaissance Poland: A Jewish Revival of Classical Antiquity, Ilia M. Rodov, Brill, pages 2-6 From 1527, Jews were no longer admitted into the city walls of Warsaw. ===20th century=== ====Interwar period==== In the Second Polish Republic (1918–1939), the government restricted Jews from civil service and licence acquisition. From the 1930s, the restrictions extended to college admission and almost all professions. In 1921-22, 25% of college students were Jewish and the proportion fell to 8% by 1939, but the fringe far-right Endecja (National Democracy) party continued organizing boycotts of Jews. After Polish Prime Minister Józef Piłsudski's death in 1935, the fringe Endecja doubled down by vowing to \"remove Jews from all spheres of social, economic, and cultural life in Poland\". The government relented and organized the Obóz Zjednoczenia Narodowego (OZON, English: Camp of National Unity) to take over the Polish parliament in 1938. Laws against Jews were subsequently drafted. American historian Timothy Snyder claimed that the pre-1939 Polish leadership ====World War II==== By the start of WWII, 12% of Polish population were Jewish, who were all but eliminated in the Holocaust. Notable wartime pogroms in Nazi- occupied Poland included the 1941 Jedwabne pogrom, where a small number of ethnic Poles killed as many as 1,600 Jews in a village. * * * * * * * ====Post-war period==== Instances of post-war antisemitic violence, including the Kraków pogrom on August 11, 1945 and Kielce pogrom on July 4, 1946, also happened, which are claimed to have been caused by lawlessness and the Żydokomuna (\"Jewish communism\") myth believed by some Poles. * * * * * * * * * * * * Polish anthropologist Joanna Tokarska-Bakir estimated that 50 pogroms happened in Hungary, Poland, Slovakia and Ukraine between 1944 and 1948.Tokarska-Bakir, “Postwar Violence against Jews in Central and Eastern Europe,” p. 74. Dozens of anti-Jewish incidents happened in the Polish- Ukrainian borderlandsAdam Kopciowski, “Anti-Jewish Incidents in the Lublin Region in the Early Years after World War II,” Zagłada Żydów. Studia i Materiały (2008): pp. 177–205, specifically p. 177; Kwiek, Nie chcemy Żydów u siebie, pp. 214–5. to the extent that Holocaust survivors were advised not to speak Yiddish in public. Thomas Blatt, a Holocaust survivor, recounted:Philip Bialowitz, oral history interview, August 22, 1997, VHA. Some Holocaust survivors also hesitated to return to their original homes over reports of pogroms.Audrey Kichelewski, “To Stay or to Go? Reconfigurations of Jewish Life in Post-War Poland, 1944–1947,” in Seeking Peace in the Wake of War: Europe, 1943–1947, ed. Stefan-Ludwig Hoffman, et al. (Amsterdam: Amsterdam University Press, 2015), pp. 189, 194. The state-sponsored antisemitic campaigns * * * Etinger, Iakov (1995). \"The Doctors' Plot: Stalin's Solution to the Jewish Question\". In Yaacov Ro'i, Jews and Jewish Life in Russia and the Soviet Union. London: Frank Cass. , pp. 103–6. * * * * * * * under the Soviet Union and its puppet regimes in Soviet-occupied Eastern European states also made it harder for perpetrators of antisemitic violence to be put on trial. * Smilovitskiy, Yevrei Belarusi, pp. 136–7. * Exeler, “The Ambivalent State,” pp. 606–29; Penter, “Local Collaborators on Trial,” pp. 341–64; Melnyk, “Stalinist Justice as a Site of Memory,” pp. 223–48. * On antisemitism among Communist power organs after 1944, see Gross, Strach, pp. 257–274; Tokarska- Bakir, Pod klątwą, pp. 134–47; Bożena Szaynok, “Problematyka żydowska w polityce komunistów w latach 1949–1953,” in Nusech Pojln: Studia z dziejów kultury jidysz w powojennej Polsce, ed. Magdalena Ruta (Kraków: Austeria, 2008), pp. 9–26; Gross, Upiorna dekada, p. 82; Mitsel, Evrei Ukrainy v 1943–1953 gg., p. 26; Bemporad, Legacy of Blood; Skibińska, “Powroty ocalałych,” p. 573; Aleksiun, Dokąd dalej?, p. 98. Freda Dymbort, another survivor, said:Freda Dymbort (born Guterman), oral history interview, June 11, 1996, VHA. ===21st century=== In 2022, the American civil rights group Anti- Defamation League (ADL) conducted a global survey on antisemitism, which found 35% of Poland's people to have \"harbour[ed] antisemitic attitudes\", the second highest among the 10 European states surveyed, despite the percentage significantly lower than the previous survey. * * Whereas, the Czulent Jewish Association, a Polish Jewish group, reported in 2023 that 488 antisemitic incidents had been recorded in 2022, 86% of which involved online harassment and insults. It noted that \"Jew\" was often used to smear a perceived enemy as \"disloyal, an outsider and unpatriotic.\" * * * Comments peddling antisemitic tropes and blaming all Jews for the Gaza War are also common in Reddit's subreddit r/Poland.Examples: * * * In June 2023, Polish-Canadian historian Jan Grabowski held a seminar on Poland's history of antisemitism in Warsaw. Far-right MP Grzegorz Braun forced its cancellation by smashing Grabowski's microphone. * * * * * During the 2023 Hanukkah, the same MP put out a menorah with a fire extinguisher in the Polish parliament. He was expelled by the parliament and charged with hate crimes. His behavior caused a global uproar, * * * * * while being praised by pro-Palestinian users in Reddit's subreddit r/Poland who claimed to be \"only anti-Israel\". Despite Grzegorz Braun's actions, he was elected to the European Parliament in June 2024. * * * On 1 May 2024, the Nożyk Synagogue in Warsaw was hit with three firebombs by a 16-year old. Poland's President Andrzej Duda condemned the attack. * * * ==Roma== In June 1991, a riot broke out in the Polish town Mława after a Romani teenager drove into three Poles in a crosswalk, killing one Polish man and permanently injuring another, before fleeing the scene. A mob attacked wealthy Romani settlements in the town. Both the Mława police chief and University of Warsaw sociology researchers claimed the riot to have been caused by class envy, while the town's mayor and townsfolk believed it to have been racially motivated. It is claimed that the riot's news coverage comprised anti-Roma stereotypes.Anna Giza-Poleszczuk, Jan Poleszczuk, Raport \"Cyganie i Polacy w Mławie - konflikt etniczny czy społeczny?\" (Report \"Romani and Poles in Mława - Ethnic or Social Conflict?\") commissioned by the Centre for Public Opinion Research, Warsaw, December 1992, pp. 16- 23, Sections III and IV \"Cyganie w PRL-u stosunki z polską większością w Mławie\" and \"Lata osiemdziesiąte i dziewięćdziesiąte\". ==Africans== The most common word in Polish for a Black person is Murzyn, often deemed neutral in the past but a slur nowadays. In Communist Poland, translations of the Uncle Tom's Cabin were widely circulated due to the communist regime's perception of the book's \"anti-capitalist\" nature, despite it having reinforced anti-Black stereotypes. ==Footnotes== ==References== Category:Racism Category:History of Poland",
 "title": "Racism in Poland"
}