{
 "id": "1143847",
 "text": "The Brazil-nut poison frog (Adelphobates castaneoticus) is a frog. It lives in Colombia. ==Body== This is one of the smallest poison frogs. The adult frog is 18-23 mm long from nose to rear end. The female frog is bigger than the male frog. The skin of the frog's back is black in color with white or yellow spots or marks. There are bright orange or yellow spots where the legs meet the body Scientists think this color confuses animals that want to eat the frog. ==Name== Scientists named this frog \"Brazil-nut poison frog\" because the tadpoles swim in empty skins from Brazil nuts. First the Brazil nut falls off the tree. Then another animal, for example an agouti, eats the nut. Then rain falls and the skin is full of water. Then insects and frogs and toads put their young in the water. Any of the tadpoles can eat the insects or other tadpoles. ==Home== Scientists see this frog on the dead leaves on the ground in tropical rainforests where liana plants and Brazil nut trees grow. Many of the places this frog lives are protected parks, for example Floresta Nacional de Altamira, Floresta Nacional do Tapajós, Parque Estadual Cristalino II, Parque Nacional da Serra do Pardo, and Reserva Extrativista Riozinho do Anfrisio. ==Food== This frog eats insects and other animals with their bones on the outside. It eats ants and termites. ==Young== The female frog lays eggs on the ground. She can lay as many as 12 eggs at a time but usually 2-6 eggs. After the eggs hatch, the male frog carries the tadpoles to water, for example water in pools, in bromeliad plants, or in the shells of Brazil nuts or palm plants. The tadpoles try to eat any other animal or plant they find in the water. The young frogs become adults 5-7 months later. ==Danger== Scientists say this frog is not in danger of dying out. But people cut down the forests where it lives to make farms and to get wood to build with. Fires also burn forests. ==First paper== * ==References== Category:Frogs of South America",
 "title": "Adelphobates castaneoticus"
}