{
 "id": "1143508",
 "text": "The ISIS committed a genocide against the Yazidis * * * * * in Iraq and Syria between 2014 and 2017. The ISIS killed as many as 5,000 men, and sold as many as 10,000 Yazidi women as slaves. * * * Some boys were also enslaved by the ISIS. * ==Overview== In November 2015, the Simon-Skjodt Center for the Prevention of Genocide of the United States Holocaust Memorial Museum (USHMM) issued the first legal analysis to conclude that the ISIS was committing a genocide against the Yazidis. The USHMM recorded extensive accounts of mass rape, torture, displacement, kidnapping and forced conversions targeting the Yazidis. The number of Yazidis displaced by ISIS's genocidal campaign totalled over 800,000. Despite ISIS's campaign constituting a genocide, it has not received much attention from left-wing scholars in the West, who have substantial influence in academia and history writing. * Lappin, Shalom (2006), ‘How Class Disappeared from Western Politics’, Dissent, Vol. 51, No. 1, pp. 73-78. * * * * Kirsch, Adam (2024), On Settler Colonialism: Ideology, Violence, and Justice, W.W. Norton and Company, New York and London. * * * * ==Reactions== ===Iraq=== ====Kurdistan Regional Government==== On August 3, 2024, the Kurdistan Regional Government commemorated the 10th anniversary of the Yazidi genocide. The Kurdistan Regional Government said that it supported the United Nations Investigative Team to Promote Accountability for Crimes Committed by Da'esh/ISIL (UNITAD) to bring the perpetrators to justice. ====Free Yezidi Foundation==== Pari Ibrahim of the Iraqi Kurdistan-based Free Yezidi Foundation said to the Voice of America (VOA): ===Germany=== The German parliament voted in January 2023 to recognize the Yazidi genocide, followed by a speech from the Foreign Minister Annalena Baerbock confirming the German government's recognition of the Yazidi genocide. ===United States=== The United States Department of State recognized the Yazidi genocide twice in 2016 and 2017 respectively. On March 14, 2016, the United States House of Representatives voted unanimously by 393-0 that ISIS's war crimes against the Yazidis, Syriac Christians, Shias and other groups constituted acts of genocide. ===United Kingdom=== The UK Government acknowledged the Yazidi genocide in August 2023. ===United Nations=== The Office of the United Nations High Commissioner for Human Rights (UNHCR) stated in March 2015 that ISIS's war crimes against the Yazidis constituted a genocide. ==Related pages== * Katyn massacre * Bosnian genocide * Volhynia massacre * 7 October 2023 attack on Israel * Yugoslav massacres of Kosovo Albanians during the Kosovo War ==Footnotes== ==References== Category:Islam Category:Yazidis Category:Genocide Category:Islamism Category:History of Asia",
 "title": "Yazidi genocide"
}