{
 "id": "1143823",
 "text": "Zio ( ) is an antisemitic slur widely condemned by civil rights groups, including but not limited to the World Jewish Committee (WJC), American Jewish Committee (AJC) and the British Labour Party. * * * ==Origin== The use of \"Zio\" was first recorded by the 1990 edition of the American Jewish Yearbook as in the term \"Zionazi\", spray-painted on the campus of SUNY-Binghamton. The website WikiZio, run by former grand wizard of the Ku Klux Klan (KKK) David Duke used \"Zio\" to refer to Jews based on the fact that Zionism holds such widespread appeal among Jews that it has become a core part of the modern Jewish identity, especially in the US, where 85% American Jews believed in the importance of the United States supporting Israel, and the United Kingdom, where 80% British Jews identified as Zionist. Ben Samuels, writing for the progressive newspaper Haaretz, concurred that the slur was invented by David Duke and popularized by antisemitic radical leftists. ==Proliferation== In 2016, the British Labour Party released a report, stating that In 2017, the organizers of the Chicago Dyke March faced accusations of antisemitism after their use of \"Zio tears\" on Twitter. * * * In April 2017, Terry Couchman, an election candidate of the British Labour Party, was suspended over his use of \"ZioNazi\". Tony Greenstein, another member of the British Labour Party, was expelled from the party in 2018 for using the term \"Zios\" among other allegations. ==Reception== In July 2024, Meta made the controversial decision to impose restrictions on the use of the term. This decision was welcomed by the American Jewish Committee, while 73 self-identified organizations sent a letter to the Meta claiming that such a policy \"will also encourage the incorrect and harmful conflation of criticism of the acts of the state of Israel with antisemitism.\" ==Related pages== * Antiziganism * Dehumanization * Antisemitism in Europe ==References== Category:Slurs Category:Racism Category:Pejoratives Category:Antisemitism Category:English profanity",
 "title": "Zio (slur)"
}