{
 "id": "1143326",
 "text": "Majdanek concentration camp (Konzentrationslager Lublin in German) was a Nazi German concentration camp and death camp during World War II. It was located in Lublin, a city in Nazi-occupied Poland. ==Overview== The Nazis opened Majdanek in October 1941, and the Soviet Red Army freed the camp on July 23, 1944. By that time, the Nazis had added 11 sub-camps (like Trawniki) around the main camp. Majdanek was an important part of the Holocaust and the Final Solution. At least 80,000 men, women, and children died there - perhaps as many as 360,000. This included at least 60,000 Jews. == Location == Majdanek (pronounced Muh-DON-ek in Polish) was named after a suburb of Lublin called Majdan Tatarski. This was in a part of Poland that the Nazis had occupied. Many Jewish people lived in this suburb. According to the Jewish Virtual Library: > Local residents were very much aware of [the camp's] existence ... People > driving past [it] had a completely [clear] view, [and could] see the tall > brick chimney of the crematorium wafting smoke ... and the gas chamber > building which is very close to the street. == Beginnings == === Context === In 1939, both Nazi Germany and the Soviet Union invaded and took over Poland. They divided Poland between them. Lublin was originally in Soviet-controlled Poland. In June 1941, the Nazis began Operation Barbarossa, their invasion of the Soviet Union, and quickly gained control of Lublin. As the invasion continued, the Nazis took control of Soviet-controlled Poland. Millions of Jews and Polish Communists (who openly opposed the Nazis) lived in this area. The Nazis now had power over all of these people. === Beginnings === In July 1941, Nazi leader Heinrich Himmler visited Lublin. He ordered a forced labor camp to be built “for 25-50,000 inmates who would be used to work in SS and police workshops and at construction sites.\" In October 1941, the Nazis opened Majdanek as a prison camp and a forced labor camp. Then in January 1942, the Nazis officially began the Final Solution: their plan to kill all the Jews in Europe. After that, they turned Majdanek into a death camp for Jews. == The death camp == The first Jews deported to the new death camp were from Bohemia and Moravia (now in the Czech Republic). Next Jews from Nazi-controlled Poland, the Netherlands, and Greece arrived. Majdanek eventually became one of the largest Nazi camps: it had around 227 buildings, seven gas chambers, two gallows, and (after September 1943) a crematorium with five ovens. It also had mass execution ditches and cremation pits. At first, the Nazis killed groups of prisoners by shooting them in a forest near the camp. However, they soon began using gas chambers. Early on, they poisoned prisoners with carbon monoxide; later, they used Zyklon-B (hydrogen cyanide). Many people also died on the cattle cars and trains the Nazis used to deport prisoners to Majdanek. These transports were extremely crowded, and the Nazis did not give people any food or water; an unknown number died along the way. The Soviet Red Army freed Majdanek in late July 1944. Before they arrived, the Nazis evacuated Majdanek and burned evidence of their crimes. When the Red Army liberated the camp, only a few hundred prisoners were left alive. == Prisoners and guards == At first, prisoners of war from the Soviet Red Army were sent to Majdanek. Most of them died from starvation, typhus epidemics, terrible living conditions, and abuse. After the Nazis started the Final Solution, they began deporting Jews to Majdanek - first from Slovakia, then from the Czech Republic, then from Nazi-occupied Poland. According to the State Museum at Majdanek: > Prisoners [eventually] came from nearly 30 countries. The former citizens of > Poland [were the biggest group] (mainly Polish Jews and Poles) but there > were also many prisoners from the Soviet Union, Slovakia, and the > Protectorate of Bohemia and Moravia. Apart from Poles and Jews, the > Russians, Belarusians, and Ukrainians [were] the largest groups of inmates. > [There were] smaller numbers of inmates from France, Belgium, Germany, > Norway, Italy ... [but] the greatest number of victims [were] the Jews from > various countries (about 60,000), Poles, Belarusians, Ukrainians, and > Russians. The Nazis also imprisoned people who opposed and resisted them. Sometimes, when partisans were fighting the Nazis in a certain area, the Nazis would deport entire settlements of people (including children) to Majdanek as a punishment. Most guards at Majdanek were German SS members. However, others were ethnic Germans (including people from Romania, the former Yugoslavia, Belarusia, Ukraine, and Russia). There was also a Lithuanian police battalion at Majdanek, and some Soviet prisoners of war agreed to work as guards there. == Deaths == Around 80,000 deaths were officially recorded at Majdanek. However, when people were sent to the gas chambers as soon as they arrived, the Nazis did not record their names or deaths. For this reason, historians disagree about the exact number of people who were deported to Majdanek and the number of deaths there. The State Museum at Majdanek says that at least 150,000 people were sent to the camp, and at least 80,000 died there (including 60,000 Jews). However, the Encyclopedia Britannica says that \"according to the most reliable estimates,\" 500,000 people were deported to Majdanek, and of these, 360,000 died there. The Encyclopedia of the Holocaust agrees with this estimate. Starvation, abuse, torture, or disease caused about six out of every ten deaths at Majdanek. Guards once beat 200 prisoners to death in a single execution. The rest of the camp's prisoners were murdered by firing squads or in gas chambers. ==Related pages== * Genocides by the Soviet Union * Jasenovac concentration camp * List of Nazi concentration camps == References == Category:History Category:The Holocaust Category:Nazi Germany Category:Nazi concentration camps in Poland",
 "title": "Majdanek concentration camp"
}