{
 "id": "1143338",
 "text": "PUBG Mobile is a free-to-play online battle royale game for mobile devices. It was made by LightSpeed & Quantum Studio and PUBG Studios. The game is based on PUBG: Battlegrounds. The game first released on March 19, 2018, for Android and iOS. Different companies publish the game in different places, including Krafton, Tencent, and VNG Games. By December 2022, the game had been downloaded 1.3 billion times and made over $9 billion. It is one of the most- played mobile games ever. In 2021, an Indian version called Battlegrounds Mobile India was released, along with a separate game in the PUBG Universe called New State Mobile. ==Gameplay== In PUBG Mobile, up to 100 players compete in a battle royale, where the last person or team still alive wins. Players can join the match alone, in pairs, or in teams of up to four people. Each match begins with players jumping out of a plane onto one of the game’s maps. Players must decide when and where to parachute down. Once on the ground, they search buildings and areas for weapons, vehicles, and gear. The equipment is placed randomly across the map, with some high-risk areas offering better gear. Players who are defeated can have their items taken by others. The game can be played from a first-person or third-person view. As the match goes on, the playable area of the map gets smaller, forcing players to move toward a safe zone. Those outside this zone take damage and can be eliminated if they do not enter the safe area in time. Random parts of the map are also bombed during the match, making them dangerous. Players are warned in advance to find safety. Sometimes, supply crates with special items are dropped by planes, which often lead to more fights as players rush to grab them. A match lasts about 30 minutes. The mobile version includes features like login bonuses, missions, crew recruiting, and an auto-loot system. It also has more robot players than the PC or console versions to make the game easier for new players. ==Development== PUBG Mobile is a mobile version of PUBG: Battlegrounds. The original PC and console game was made by Brendan Greene (also known as PlayerUnknown) and released in 2017. After its success, Tencent Games teamed up with PUBG Studios to create a mobile version, which was developed using an improved version of Unreal Engine 4. The goal was to optimize the game for mobile devices while keeping good performance and graphics. Development of PUBG Mobile took four months, with teams from around the world working on the project. The game was released in March 2018, becoming very popular globally. A smaller version for low-end Android devices, called PUBG Mobile Lite, was released in Thailand in January 2019 and later expanded to other regions. ==Release== Tencent and PUBG Corporation released two mobile versions of the game in China in February 2018: PUBG: Exhilarating Battlefield and PUBG: Army Attack. The first was a smaller version of the original game, and the second had more arcade-style features. Both were free- to-play and available on Android and iOS. Together, the games had 75 million pre-registrations in China and topped the iOS charts upon launch. In March 2018, PUBG Mobile was released worldwide, starting with a soft launch in Canada. Versions specific to Korea, Japan, and Vietnam followed in 2018 and 2019. In China, however, the game did not receive official approval from the government, and could only be played as a test version. Due to restrictions, Tencent later re-released the game in China as Game for Peace in May 2019, which removed violent content to meet local laws. A lighter version for lower- end devices, PUBG Mobile Lite, was launched in July 2019. It supports high FPS gameplay and is designed for up to 60 players on a smaller map. Due to various issues, including government restrictions, the Tencent version of the game was banned in India on October 31, 2020. Shortly after, PUBG Corporation, a part of Krafton, announced a new Indian version called Battlegrounds Mobile India (BGMI). Pre-registrations for BGMI began in May 2021, with the game launching soon after. == References == ==Other websites== * Category:2018 video games Category:Android (operating system) games Category:Battle royale games Category:Free-to-play video games Category:IOS games Category:Multiplayer online games Category:Video games developed in China",
 "title": "PUBG Mobile"
}