{
 "id": "1143055",
 "text": "The 1923 France–Great Britain women's athletics match was an international women's athletics match where a national team of French athletes competed against a national team of British athletes. It took place on 23 September 1923 at Stade Pershing in Paris, France. 10 British and 14 French athletes (excluded reserves) competed in the match. It was the second international match between France and Great Britain with the 1921 France–Great Britain women's athletics match. Great Britain broke two world records in the relay and 250 metre and France broke the world record in the shot put. Great Britain also ran in the 100 yards the same time as the world record and was a new British record. Next to these results France ran a national record in the 250 metres and in the relay and Great Britain ran a national record in the 1000 metres. == Background == The event took place in the early era of international women's athletics with the first women's international tournaments being held from 1921. == Format== In each individual event two athletes of each nation competed and one team of four athletes in the relay event. The first athlete in the individual events scored 5 points, the number two 3 points, number three 2 points and the number four 1 point. The country that won the relay event scored 6 points and the other country 3 points. For the overall classification all the points scored by each country are added together. ==Entrants== The members of the teams were puslished on 23 September 1923. Names and events in italics differences between the entry and athletes competing in the events. Great Britain Name Event Florence Birchenough Javelin throw Shot put (R. High jump) Eileen Edwards 250 metres 4 x 220 yards relay (R. 100 yards) (R. 100 yards hurdles) (R. Javelin throw) Sophie Elliott-Lynn 100 yards Javelin throw ~~High jump~~ Shot put ~~(R.~~ 100 yards hurdles~~)~~ (R. Long jump) Gladys Elliott Long jump 4 x 220 yards relay (R. Shot put) Hilda Hatt 100 yards hurdles High jump Long jump (R. Javelin throw) (R. 4 x 220 yards relay) Gladys Lane 1000 metres Ivy Lowman ~~100 yards hurdles~~ ~~(R.~~ High jump~~)~~ (R. 250 metres) (R. 4 x 220 yards relay) Vera Palmer 250 metres 4 x 220 yards relay (R. 100 yards) (R. Long jump) Rose Thompson 100 yards 4 x 220 yards relay Edith Trickey 1000 metres (R. Shot put) (R. 250 metres) France Name Event Marguerite Chansardon 100 yards hurdles Jeanne Collet 100 yards 250 metres High jump 4 x 220 yards relay 4 x 220 yards relay (R. 250 metres) Marguerite Drouard ~~(R.~~ 4 x 220 yards relay~~)~~ Yvonne Gancel Javelin throw Long jump Georgette Lenoir 1000 metres Lionel Long jump Violette Morris Shot put Marcelle Neveu 1000 metres Louise Noeppel 100 yards Javelin throw (R. Shot put) Lucie Petit Shot put (R. High jump) 250 metres 4 x 220 yards relay (R. 100 yards) 100 yards hurdles Reserves Reserves Louise Ausset (R. Javelin throw) Lucie Bréard (R. 1000 metres) Simone Chapoteau (R. Shot put) Andréé Darreau (R. 250 metres) (R. 4 x 220 yards relay) ~~Georgette Gagneux~~ ~~100 yards~~ ~~4 x 220 yards relay~~ Georgette Guellier (R. High jump) Lucienne Laudré (R. Long jump) Raymond (R. Long jump) Vibert (R. 100 yards hurdles) === Other entrants === Next to the country match, some other events were scheduled during the meeting. * Javelin throw: Swiss entered to try to break the record. * Discus throw: Lucie Petit, Yvonne Tembouret, Théry and Lucienne Vellu * Large costumed velveteen: Members of Fémina Sport directed by M. Paysse * 10 x 100 metres relay: Team of Fémina Sport and a mixed French team == Competition == The match started in the afternoon at 14:30pm. === Javelin throw === Place Athlete Distance Points Note 1 40.72 m 5 2 36.61 m 3 3 34.50 m 2 4 29.93 m 1 === 100 yards hurdles === Place Athlete Time Points Note 1 11.0 sec 5 2 3 3 2 4 1 === High jump === Place Athlete Height Points Note 1 1.4? m 5 2 1.43 m 3 3 1.40 m 2 4 1.35 m 1 === 100 yards === Place Athlete Time Points Note 1 11.25 sec 5 =WR, NR 2 3 3 2 4 1 === Shot put === The score was the total of a throw with both arms. Place Athlete Distance Points Note 1 21.01 m 5 WR 2 16.985 m 3 3 16.76 m 2 4 15.80 m 1 === 250 metres === Place Athlete Time Points Note 1 35.4 sec 5 WR 2 3 3 36.4 sec 2 NR 4 1 === Long jump === Place Athlete Distance Points Note 1 4.665 m 5 2 4.64 m 3 3 4.60 m 2 4 4.455 m 1 === 1000 metres === Place Athlete Time Points Note 1 3:22 5 NR 2 3 3 2 4 1 === 4 x 220 yards relay === Place Team Time Points Note 1 Rose Thompson Eileen Edwards Gladys Elliott Vera Palmer 1:52.4 6 WR 2 Jeanne Collet Marguerite Drouard 1:56.8 3 NR In this relay race the British team also broke the 4 x 200 metres world record with a time of 1:51.6+. == Overall classification == Rank Athlete Points JT 100y H HJ 100y SP 250m LJ 1000m Rel 1 60 5 8 8 8 3 8 6 8 6 2 37 6 3 3 3 8 3 5 3 3 == References == Category:1923 in women's athletics Category:Sport in France Category:Sport in the United Kingdom Category:1923 in Europe Category:1920s in France",
 "title": "1923 France–Great Britain women's athletics match"
}