{
 "id": "1143626",
 "text": "Cantabil is an Indian clothing company that designs, manufactures, and sells apparel for men, women, and children. The company operates under the legal name Cantabil Retail India Limited and was founded in 1989. Its headquarters is in New Delhi, India. Cantabil has over 460 stores in more than 220 cities across India. == History == Cantabil started in 1989 under the name Kapish Sales Pvt. Ltd. as a distributor for zippers and buttons. In 2000, the company shifted to apparel retailing and opened its first store in Rajouri Garden, New Delhi. Since then, Cantabil has expanded its range to include clothing for men, women, and children, becoming a popular brand in India. == Operations == Cantabil manages its production in a facility in Bahadurgarh, Haryana, covering an area of 1.5 lakh sq. ft.. The facility has the capacity to produce about 1.5 million garments per year. Cantabil operates an integrated business model, which includes designing, manufacturing, and retailing, allowing for greater control over quality and costs. == Financial Information == Cantabil is a publicly traded company, listed on the Bombay Stock Exchange (BSE) and the National Stock Exchange (NSE) under the ticker symbol CANTABIL. For the financial year ending March 2024, Cantabil reported a revenue of ₹6.16 billion, which represents an 11.52% growth from the previous year. According to analysts, demand is expected to pick up in the second half of the year, driven by improvements in retail strategies. == Awards == Cantabil received the Delhi Udyog Ratan Award in 2008 for its contribution to the retail industry. == Geographical Presence == Cantabil has a presence in over 220 cities across 19 states, with its retail footprint mostly in the northern, eastern, and western regions of India. The company is actively expanding in Tier 2 and Tier 3 cities. It aims to achieve a 15% volume growth in the fiscal year 2025. == References == Category:Companies of India Category:Clothing companies Category:Fashion",
 "title": "Cantabil"
}