{
 "id": "1143649",
 "text": "The Jedwabne pogrom refers to a massacre of Jews in Jedwabne, Poland on July 10, 1941 during the Holocaust. As many as 1,600 are estimated to have been killed, ranging from women and children to elderly, many of whom were burned alive. 40+ ethnic Poles participated in the pogrom with the help of Nazi German military police (Feldgendarmerie). * * * * * * * * ==Aftermath== The pogrom was not well-known until the early 2000s, when the film Neighbors: The Destruction of the Jewish Community in Jedwabne, Poland was released in 2001. The Institute of National Remembrance, Poland's state research agency that prosecutes Nazi and Soviet war crimes, conducted a forensic investigation in 2000–2003, confirming that the perpetrators were ethnic Poles, shocking the nation and the world.Adam Michnik, In Search of Lost Meaning: The New Eastern Europe, Chapter 10: \"The Shock of Jedwabne\", p.204-, University of California Press (2011) ==Legacy== It is said that the pogrom was conducted with exceptional brutality. Not only was an entire village burned alive, but also women were raped before slain, men and children were stabbed to death with knives, pitchforks, axes, hatchets. No compassion was seen by any witnesses who later testified in war crimes trials. Historians found that the pogrom's Polish perpetrators were motivated by grievances towards the prior Soviet occupation, which had been projected onto Jews, as some Poles believed the Żydokomuna (\"Jewish Communism\") myth and sought revenge on the Jews they had mistaken for being responsible for the brief Soviet oppression between October 1939 and June 1941. ===Denial=== Despite the abundant evidence, many in Polish society are reluctant to acknowledge the pogrom. * Robert Rozett, “Competitive Victimhood and Holocaust Distortion,” The Israel Journal of Foreign Affairs, XVI (2022); “Distorting the Holocaust and Whitewashing History: Toward a Typology,” XIII: 1 (2019); Yehuda Bauer, “Creating a “Usable” Past: On Holocaust Denial and Distortion,” XIV: 2 (2022); and Jan Grabowski, “The Holocaust and Poland's 'History Policy'” X: 3 (2016). * Joanna Beata Michlic, “The Politics of the Memorialisation of the Holocaust in Poland: Reflections on the Current Misuses of the History of Rescue,” Jewish Historical Studies—Transactions of the Jewish Historical Society of England, LIII: 1 (2022); Piotr Forecki, Po Jedwabnem: Anatomia pamięci funkcjonalnej (Kraków, 2018); Jan Gross, Neighbors: The Destruction of the Jewish Community in Jedwabne (Princeton, 2001). * Piotr Forecki, “Domestic ‘Assassins of Memory’: Various Faces of Holocaust Revisionism in Contemporary Poland,” presentation at a symposium in honor of Professor Antony Polonsky called “The Holocaust in Eastern Europe: sources, memory, politics,” March 16, 2021, UCL, London. * * Antony Polonsky and Joanna Beata Michlic (eds.), The Neighbors Respond: The Controversy over the Jedwabne Massacre in Poland (Princeton, 2009) and Laurence Weinbaum, “Amnesia and Antisemitism in the ‘Second Jagiellonian Age,’” Anti-Judaism, Antisemitism, and Delegitimizing Israel, Robert Wistrich (ed.) (Lincoln, 2016). * * Some scholars said that such denial was going mainstream * * * amid the rise of nationalism across Europe, where Jews were sometimes equated with the disliked Soviet communists against whom the Holocaust was considered \"a reaction\". * * * Some described the phenomenon with the concept mnemonic politics, where nationalist governments distorted the Holocaust by framing their ethnic majority as the victims rather than the Jews or Roma.Kónczal, Kornelia, and Moses, A. Dirk. 2022. “Patriotic Histories in Global Perspective.” Journal of Genocide Research 24 (2): 153–157. CrossRef Google Scholar Such distortion is sometimes rooted in the conspiracy theory that the mainstream Holocaust historiography's focus on Jews is an EU plot to suppress national identitySoroka, George, and Krawatzek, Félix. 2019. “Nationalism, Democracy, and Memory Laws.” Journal of Democracy 30 (2): 157–171. CrossRef Google Scholar and promote \"cosmopolitanism\" and \"multiculturalism\".Ray, Larry, and Kapralski, Sławomir. 2019. “Introduction to the Special Issue – Disputed Holocaust Memory in Poland.” Holocaust Studies 25 (3): 209–219. CrossRef Google Scholar ==Related pages== * Babi Yar * Iași pogrom * Kristallnacht * Odessa massacre * Rhineland massacres ==Footnotes== ==References== Category:Pogroms Category:Massacres Category:The Holocaust Category:History of Poland Category:Antisemitism in Europe",
 "title": "Jedwabne pogrom (1941)"
}