{
 "id": "1144947",
 "text": "Theodor Robert Lohrmann (7 September 1898 in Heidelberg- 4 September 1971) was a German football goalkeeper. ==Career == Theodor Lohrmann was a goalkeeper. He began his career at SV Waldhof Mannheim. There he played until 1920. Then he moved to SpVgg Fürth. On August 19, 1920, Lohrmann made his first appearance for the Clovers in a friendly against Guts Muts Dresden. Christoph Bausenwein, Stuhlfauths Zeiten, Die goldenen Jahre des Fußballs, Verlag Die Werkstatt GmbH, Göttingen 2017, ISBN 978-3-7307-0322-9, Seite 29 f. With Fürth, Lohrmann won the title in southern Germany in 1923. In the final round of the German championship, Fürth lost in the semi-finals against Union Oberschöneweide. In 1923 Lohrmann moved to the Wiener Amateur SV, later Austria Wien. There he played until 1929 .1930 he ended his career at Wiener AC. With Austria he won the championship and the cup in 1924 and 1926. In 1925 he became runner-up and cup winner with Austria. Because he was a professional player in Vienna, he was no longer used in the DFB team. Lohrmann was not just a good footballer, he was an incredibly all-round athlete. He also played rugby, tennis, handball and water polo with well above average performance. He also won the Austrian championship in water polo. ==International == On October 24, 1920 Lohrmann made his first appearance for the German national football team in the international match against Hungary. He only made three international appearances in his career. ==Manager == After the end of his active career he managed SV Hamborn 07, SSVg Barmen, TuS 48/99 Duisburg, Schwarz-Weiß Essen, Preußen Krefeld, Thyssen/Westende Hamborn, Krupp Rheinhausen, Rot-Weiß Oberhausen, KSG Oberhausen and FC Zürich. Kleeblatt- Chronik Players profile (German) ==References == Category:1898 births Category:German footballers Category:German football managers Category:Austrian football champions Category:Association football goalkeepers Category:German association football goalkeepers",
 "title": "Theodor Lohrmann"
}