{
 "id": "1144599",
 "text": "The Protocols of the Elders of Zion is an antisemitic IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. forgery published in 1903. It claimed that a \"Jewish plot\" existed for \"world domination\". * * * In 1921, British newspaper The Times proved that it was false. It had been plagiarized from the unrelated book The Dialogue in Hell Between Machiavelli and Montesquieu instead. * * * ==Background== The Russian Empire promoted The Protocols of the Elders of Zion to make the Bolsheviks look bad by equating them with Jews. They accused the Jews of being a horrible group that was trying to destroy the Empire. * * * * * After the White Russians lost the Russian Civil War to the Bolsheviks, some White Russian refugees brought the forgery to Europe. ==History== ===Interwar period=== Alfred Rosenberg, a Baltic German who became the Nazi Party's chief propagandist, used the forgery's ideas in Nazi propaganda. In the United States, well-known industrialist Henry Ford paid to have the theory reprinted and included its ideas into his anti-Jewish text The International Jew: The World's Foremost Problem. * * * * * Barsalina, the Latin Patriarch of Jerusalem, circulated copies of the forgery's Arabic translation within his church. === The Great Depression === Many everyday Germans accepted the ideas in the Protocols. These ideas allowed them to blame the Jews for their hardships during the Great Depression and the Nazis' rise to power. Many of these people already had anti-Jewish views and helped the Nazis rise to power. World War II and the Holocaust resulted. During this period, translations of Protocols began circulating in other countries. ===Post-war period=== Malcolm X, a famous Black American activist who was assassinated on February 21, 1965, * * * * * believed Protocols was true. He introduced it to the Nation of Islam (NOI), a Black nationalist religious movement. * * * * * * * The NOI also influenced a non-Muslim religious movement called the Black Hebrew Israelites (BHI). Both movements promote disproven conspiracy theories: that \"Jews ran the Atlantic slave trade\" and that \"European Jews descended from the Khazars\". In several of his speeches, Malcolm X accused Jews of being \"bloodsuckers [...] perfecting the modern evil of neocolonialism\". * * * * * He also engaged in Holocaust denial Distortion of the Holocaust refers, inter alia, to: by blaming Jews for having \"brought it upon themselves\". In 1961, he spoke at an NOI rally along with the American Nazi Party's leader, George Lincoln Rockwell. Rockwell claimed that Black nationalism and White supremacy shared a common vision. NOI's popularity helped these antisemitic tropes to become more mainstream among academics and Black Americans. This helped to cause deep- rooted antisemitism in American society. As per a 2016 survey by the American civil rights group Anti-Defamation League (ADL), 23% of Black Americans held negative beliefs about Jews. A 2023 survey showed that one-eighth of Black Americans doubted whether the Holocaust really happened. ==Variants== ===Judeo-Masonic conspiracy theory=== See the main article: Judeo-Masonic conspiracy theory The Judeo-Masonic conspiracy theory is similar to the ideas in Protocols. The myth was created by opponents of the French Revolution in 1789. It says that a secret Jewish–Freemason group controls world affairs to harm humanity. This myth is popular among antisemites worldwide and often appears in their propaganda, which tends to equate Jews with the Freemasons. * * * ===Zionist Occupation Government conspiracy theory=== The forgery's ideas have given rise to the Zionist Occupation Government (ZOG) conspiracy theory. It accuses Jews of \"controlling Western governments\" to benefit themselves and Israel. It also says that Jews \"control\" the media and the music industry. * * * * * * * Norman Kelly (2005) \"Notes on the political economy of black music\", in R&B;, Rhythm and Business: The Political Economy of Black Music (), Norman Kelly (Ed.), 2005, Akashic Books, pp 12–13. * Like the Judeo-Masonic conspiracy theory, it is popular among Neo-Nazis, White supremacists, Black nationalists, Islamists, and other antisemities around the world.* * * * At an anti-Israel rally in December 2023 Jenny Leong, an MP of the New South Wales who belongs to the Australian Greens, claimed that an all-powerful \"Jewish lobby\" existed in Australia. She compared its \"influence\" to \"tentacles\".* * * * * * ==Reception== In one of his books, German-American Jewish historian Walter Laqueur said that the forgery was popular in Germany because it allowed German right-wingers to blame the WWI defeat on an \"outside enemy\" – the Jews – to free themselves of their responsibility. ==Related pages== * Khazar myth * Holocaust denial * Secondary antisemitism * Antisemitism in the Soviet Union * Roman Catholics and antisemitism in the 21st century ==References== Category:Forgeries Category:Plagiarism Category:Antisemitism Category:Disinformation Category:History of Europe Category:Conspiracy theories",
 "title": "The Protocols of the Elders of Zion"
}