{
 "id": "1144535",
 "text": "The Maratha Mysore war (1682-1686) is a series of Conflicts Between the Maratha Empire under Sambhaji supported by Tanjavur Marathas and thier tributaries Golocnda Sultanate and Keladi Kingdom and Mysore Kingdom under Chikka Dev Raya supported by Mughal Empire and Madurai Nayak Tho initially successful in repulsing Marathas at Banavar, he was later defeated at Trichinopoly he was forced to Surrender and pay tribute of 1 crore. After a few years Sambhaji invaded Mysore again in 1686 as Chikka Dev Raya failed to pay tribute and completey crushed Chikka Dev Raya and captured 120 places in Karnataka. ==Background== Sambhaji's grandfather, Shahaji, conquered territories in Karnataka, earning the title of Jagir of Bangalore from Mohammed Adil Shah, marking the Marathas' entry into Southern India. Shivaji had previously established Maratha control in the region during his campaign from 1676 to 1678. The Marathas and the Mysore kingdom were rivals, with hostilities escalating after the Marathas' failed attack on Srirangapatna in 1681. Sambhaji sought to form an alliance against the Mughal Emperor Aurangzeb, while Mysore's Chikkadevaraya allied with Aurangzeb, leading to the execution of key Maratha generals. Enraged, Sambhaji launched an attack on Mysore in June 1682, joining forces with the Qutb Shahi dynasty and the Nayakas of Ikkeri, reaching Banavar later that month. ==Battle of Banavar== Chikkadevaraya led 15,000 expert archers from Mysore to counter the allied army at Banavar, launching an attack before they could settle. Realizing the allies lacked archers, he positioned his forces in a semicircular formation, inflicting heavy casualties on the Marathas. Despite reinforcements, the Marathas struggled to respond effectively. After a night break, Sambhaji chose to retreat to Thanjavur to avoid further losses. ==Battle of Trichinopoly== Sambhaji rested near Thanjavur for 20 days, receiving reinforcements from Hukkeri and Golconda, along with his uncle Ekoji I. Recognizing the strength of Mysore forces, he aimed to draw them away from their stronghold and decided to attack Tiruchirapalli, where the weakened Nayaka of Madurai, Chokkanatha Nayak, resided. To counter the superiority of Mysore archers, Sambhaji had leather arrow-proof jackets made for his army and gathered war elephants from the region. On the day of the attack, the Marathas crossed the Kaveri river by boat, surprising the Mysore defenders. The leather jackets effectively protected them from arrows as the elephants broke through the city gates, leading to a fierce battle. By evening, the Marathas had captured the city, but the Mysore army still held the Rock Fort. After Chokkanatha Nayak's death, Sambhaji laid siege to the fort with 10,000 men. Using similar tactics, Maratha archers struck an ammunition depot, causing a massive explosion that breached the fort walls. The Marathas then captured the fort and sacked Tiruchirapalli. Historian Sadashiv Shivde noted this victory as a testament to Sambhaji's military intelligence. ==Maratha Invasion of 1686== Sambhaji haven't recieved tribute from Chikka Dev Raya for so long also Chikka Dev Raya was helping Aurangzeb in his anti Maratha activities.In order to teach Chikka Dev Raya a lesson Sambaji started invading Mysore and devastating it. However Chikka Dev Raya claimed his victory over Sambhaji but according to Historian B.Muddarachari this is a baseless claim as Sambhaji came with a huge army supported by some local chiefs and inflicted crushing defeat on Chikka Dev Raya. Robert Orme gives a brief account on this Invasion noting that Sambhaji didn't face any strong resistance from Mysore also noting of capture of 120 places in Karnataka by Sambhaji. == References == Category:Pages created with the Article Wizard from 2024 Category:India",
 "title": "Maratha–Mysore War"
}