{
 "id": "1144854",
 "text": "Jane Annabelle Apsion (born 17 September 1960 in Hammersmith, London) is an English actress best known for playing Monica Gallagher in the television comedy-drama Shameless (2004-2013), Joy Wilton in Soldier Soldier (1991-1995), and Violet Buckle in Call the Midwife (2015-Present). ==Personal life== Apsion is a former student of Godalming College, Surrey and the University of Wales. She is also co-founder and practitioner of the Rosen Method Bodywork in the UK .\"Shameless actress Annabelle Apsion on the Rosen Method\" ==Filmography== ===Film=== Year Title Role Notes 1990 The Widowmaker Kathy TV film 1995 Out of My Head Miss Multi Personality Direct-to-video Killing Me Softly Billi TV film 1996 Hillsborough Jenni Hicks TV film 1997 Lolita Mrs. Leigh 1998 Goodnight, Mister Tom Mrs. Beech TV film 1999 This Year's Love Hostess The War Zone Nurse 2001 From Hell Polly Nichols 2002 About a Boy Amnesty International Worker Tough Love DI Karen Irving TV film Darwin's Daughter Emma Darwin TV film 2004 Carrie's War Older Carrie TV film May 33rd Jenny TV film Lighthouse Hill Honey Frances Tuesday Christy West TV film 2005 Peace & Quiet Mrs. Wooley Short film 2006 Driving Lessons Trendy Mum 2011 Ironclad Maddy 2018 Torvill & Dean Betty Calloway TV film ===Television=== Year Title Role Notes 1988 Emmerdale Lucy Dowling 2 episodes 1990 Casualty Carrie Potter Episode: \"Say It with Flowers\" 1991 Screen One Marie Episode: \"Alive and Kicking\" 1991-1995 Soldier Soldier Joy Wilton Series regular, 30 episodes 1992 Framed Susan Jackson Mini-series, 4 episodes 1996 My Good Friend Betty Series regular, 7 episodes 1998 Big Women Alice Mini-series, 4 episodes The Bill Sarah Ryman Episode: \"Love's Labours Lost\" 1999 Sunburn Susan Armitage Episode: \"Series 1, Episode 4\" The Lakes Beverly Fisher Recurring role, 8 episodes Midsomer Murders Jane Cavendish Episode: \"Dead Man's Eleven\" 2000 The Mrs Bradley Mysteries Mona Bunting Episode: \"Death at the Opera\" The Sleeper Claire Moon Mini-series 2001 My Uncle Silas Queenie White Episode: \"The Wedding\" 2001-2002 Micawber Emma Micawber Series regular, 4 episodes \"Micawber Learns the Truth\" , \"Micawber and the Theatre\" , \"Micawber Meets the Americans\" , \"Micawber and the Aristocracy\" 2002 In Deep Lianne Episode: \"Abuse of Trust\" Helen West Kim Perry Episode: \"Deep Sleep\" Coronation Street Patricia Hillman 4 episodes 2003 The Second Coming Fiona Morris Mini-series, 2 episodes Spooks Bridget Sands Episode: \"I Spy Apocalypse\" Rockface Jo Episode: \"Series 2, Episode 7\" Silent Witness Jayne Rooke Episode: \"Fatal Error\" Foyle's War Kate Farley Episode: \"The Funk Hole\" 2004 Family Business Mrs. Bartlett Episode: \"Series 1, Episode 4\" Murder City Celia Farrell Episode: \"Happy Families\" Outlaws Elaine Ross Series regular, 12 episodes 2004-2005 The Bill Margaret Barnes Recurring role, 20 episodes 2004-2013 Shameless\" Appeared in The Bill as Margeret Barnes [2004]Chatsworth Spouse is Off\" Monica Gallagher Series regular, 40 episodes 2006 Wild at Heart Eileen Chapman Episode: Series 1, Episode 5\" Midsomer Murders Ellen Barker Episode: \"Death in Chorus\" 2009 Hotel Babylon Alexis Warren Episode: \"Series 4, Episode 6\" 2010 Lewis Babs Temple Episode: \"Dark Matter\" 2011 In with the Flynns Theresa Episode: \"Santorini\" The Body Farm Jo Fields Episode: \"Series 1, Episode 4\" Moving On Maggie Episode: \"Tour of Duty\" 2012 A Mother's Son Kay Mullary Mini-series, 2 episodes Doctors Mrs. Dallison Episode: \"Party Time\" 2012-2014 Holby City Jean Rimini Recurring role, 3 episodes 2013 Doc Martin Jennifer Cardew Recurring role, 6 episodes 2013-2014 The Village Margaret Boden Series regular, 12 episodes 2014 Suspects Annette Walker Episode: \"Hard Target\" 2015-present Call the Midwife Violet Buckle Series regular, 46 episodes 2017 The Halcyon Lillian Hobbs Series regular, 8 episodes 2019 Treadstone Bentley's Mother Episode: \"The Bentley Lament\" 2020 Father Brown Beattie May Episode: \"The Queen Bee\" ===Theatre=== Year Title Role Venue Notes 1987 Camille Marguerite The Old Red Lion, London 1988 The Bacchae Bacchae Lyric Theatre, London with Shared Experience 1989 Heartbreak House Ellie Dunn Riverside Studios, London with Shared Experience City Sugar Nicola The Brewhouse Theatre & Arts Centre, Taunton with Century Theatre Abingdon Square Marion Soho Poly Theatre, London & Cottesloe Theatre, London 1992 Anna Karenina Anna Arkadyevna Karenina Theatre Royal, Bath also, UK tour Richard III Lady Anne Swan Theatre, Stratford-upon-Avon with Royal Shakespeare Company 1993 A Handful of Dust Lady Brenda Theatre Royal, Bath with Cambridge Theatre Company 1994 The Editing Process Tamara Dell Fuego Royal Court Theatre, London 1995 The Blue Ball Sylie/Gina Cottesloe Theatre, London 1998 Trade Mam Royal Court Theatre, London 1999 Remember This? Victoria Lyttelton Theatre, London 2005 The Seagull Nikolayevna Arkadina Bristol Old Vic, Bristol 2011 A Streetcar Named Desire Eunice Liverpool Playhouse, Liverpool ==References== ==Other websites== * Category:1960 births Category:Living people Category:People from Hammersmith Category:English movie actors Category:English television actors",
 "title": "Annabelle Apsion"
}