{
 "id": "1144979",
 "text": "Auchterarder is a small town in Perth and Kinross, Scotland, located around 13 miles (21 km) southwest of Perth and 48 miles (77 km) northeast of Glasgow. Known as \"The Lang Toun\" due to its mile-and-a-half-long High Street, Auchterarder boasts a rich history, scenic surroundings, and notable attractions, including the world-renowned Gleneagles Hotel and golf courses. == History == Auchterarder’s history dates back to at least the 12th century, when it was granted a royal charter by King Malcolm IV of Scotland. Its strategic location on key trade routes contributed to its growth as a market town. The town was partially destroyed during the Jacobite rising of 1715 when it was burned down by Jacobite forces, but it was gradually rebuilt and flourished again in the following centuries.https://web.archive.org/web/20130124115814/http://www.royalsoced.org.uk/cms/files/fellows/biographical_index/fells_indexp2.pdf The High Street, historically one of Scotland’s longest at over a mile, earned Auchterarder the nickname \"The Lang Toun\" (meaning \"The Long Town\" in Scots).https://www.scotsman.com/news/obituaries/obituary-andrew-fairlie-much- loved-chef-and-restaurateur-who-earned-two-michelin-stars-148260 == Economy == Auchterarder’s economy has traditionally been based on agriculture and local trade. In recent years, it has developed a reputation as a tourist destination, largely thanks to the nearby Gleneagles Hotel, which attracts visitors from around the world. The Gleneagles Hotel is renowned for its golf courses and luxurious accommodations and has hosted international events such as the 2005 G8 summit and the 2014 Ryder Cup. Auchterarder also benefits from small local businesses along the High Street, including shops, cafes, and galleries, contributing to local employment and economic growth. == Landmarks and attractions == Auchterarder offers several notable attractions and scenic surroundings: * Gleneagles Hotel and Golf Courses: Located just outside Auchterarder, this luxury hotel and resort is famous for its world-class golf courses. It hosted the Ryder Cup in 2014 and offers a range of recreational activities, including horse riding, shooting, and spa services. * The High Street: Known as \"The Lang Toun,\" Auchterarder’s High Street is one of the longest in Scotland, offering a vibrant mix of traditional shops, cafes, and boutiques. * St Kessog’s Church: Named after Saint Kessog, this church holds historical significance as one of the oldest religious sites in the town. == Community and culture == Auchterarder has a close-knit community, with annual events and gatherings that draw both locals and visitors. The town is served by primary and secondary schools, including the Auchterarder Community School, which provides education to students in Auchterarder and nearby areas. Local community groups, sports clubs, and cultural organizations are active and contribute to the vibrant local culture. Notable events include the Auchterarder Music Festival, which showcases local talent and celebrates traditional Scottish music. == Transport == Auchterarder is well-connected by road and rail. The nearby A9 provides easy access to cities such as Perth and Stirling. Though Auchterarder itself does not have a railway station, the nearby Gleneagles railway station offers regular services to major Scottish cities including Glasgow, Edinburgh, and Inverness. == Related pages == * Gleneagles * Perth and Kinross * Highland Games * Trossachs National Park == References == Category:Towns in Scotland Category:Perth and Kinross",
 "title": "Auchterarder"
}