{
 "id": "1144745",
 "text": "Marathas under Raghuji Bhonsle Invaded Bhisnupur twice during their Invasion of Bengal 1742 and 1751? Respectively and minor Raids continued till 1764 eventually leading to Famine in 1770 putting and end to Bishnupur Raj. ==Invasion of Bhaskar Pandit== Marathas under Bhaskar Pandit Invaded Bhisnupur on approach of Marathas Gopal Singh Deva locked himself in the fort and started to pray to Mallu (Lord Vishnu) according to a legend Lord Vishnu in the from of Mallu came to save them and blew cannons on Marathas blowing their hands off but this is just a legend seeing the strong fortification Marathas retreated due to lack of heavy artillery and plundered the surrounding area. ==Invasion of Raghuji== Around 1748-1750 after death of Gopal Singh Deva and succession of Chaitanya Singh Deva, cousin brother of Chaitanya i.e Raghunath Singh Deva rebelled against his brother for the throne. He invited Raghuji Bhonsle to Invade Bishnupur, viewing this as an opportunity he Invaded Bengal with huge army. According to another local legend as soon as Marathas entered Bishnupur they started Plundering the area and devastating the country. Accordingly Marathas attack an temple of Mallu (Vishnu) and to save the idol Chaitnya ran barefoot holding the idol in his hand being chased by Marathas. However this is just a boon to the Invasion, in reality Marathas Invaded with a huge army and Plundered the whole region unable to bear the Onslaught of Marathas, he sued for peace becoming tributary to Marathas paying annual tribute of 12 lakhs. ==Atrocities== Marathas under Raghuji Bhonsle did worst crimes in Bengal, plundered the whole country, masscared the innocents irrespective of their religion. During the reign of Chaitanya Singh Deva when Marathas Invaded Bhisnupur it is claimed that they plundered the temple of Mallu (Vishnu) and tried to destroy the Idol of Mallu(Vishnu) which was saved by Chaitnya Singh Deva , however there is no source supporting this claim it is just a local legend among people. ==Aftermath== A Peace treaty was signed between Raghuji Bhonsle and Nawab of Bengal, a period of peace was created in Bengal till the death of Nawab. As soon as death of Nawab Marathas under Sheo Bhatt Sathee again carried out devastating raids in Bengal till 1764. In 1764 British made peace with Marathas and agreed to pay the chauth. Due to Maratha raids and aftermath famine caused an end to royal era of Mallabum Kingdom and in order to survive they accepted the vassalage of British. == References == Category:Maratha Empire",
 "title": "Maratha Raids in Bishnupur"
}