{
 "id": "1144738",
 "text": "The Karkota dynasty (625−855 CE) was an Indian dynasty that ruled the Kashmir valley and parts of northern India during the 7th and 8th centuries. The dynasty was founded by Durlabhavardhana, who ruled during the 7th century. Their rule marked a period of political growth, economic success, and the rise of Kashmir as a centre of culture and learning. The Karkota rulers were traditionally Hindus who were tolerant of the local faiths of the region, such as Buddhism. The dynasty reached its peak during the reign of Lalitaditya Muktapida, who is credited with extensive conquests by the 12th-century Kashmiri poet Kalhana. The dynasty was overthrown by Avantivarman, who established the Utpala dynasty in 855 CE. == History == === Durlabhavardhana === He was also called Prajnaditya and donated many villages to Brahmins. The Rajatarangini does not mention any military activities during his rule. If Xuanzang visited Kashmir twice during his reign, Durlabhavardhana likely ruled over a large region, including present-day Kashmir, Punjab, and Khyber Pakhtunkhwa. === Durlabhaka === Durlabhaka ruled for 50 years (662−712). He had a brother named Malhana and was married to Narendraprabhā, who had previously been married to Nona, a wealthy merchant from outside Kashmir. Durlabhaka had three sons: Chandrapida, Tarapida, and Lalitaditya, listed in order of age. === Chandrapida === Chandrapida ruled from 712/13 to 720 and was also known by the name Vajraditya. He is also known from the Tangshu under the name Zhentuoluobili. Kalhana describes the ruler as kind and good, telling two stories to show this. In 713, Emperor Xuanzong of Tang received a visit from an embassy sent by Chandrapida, asking for help against Arab invasions. These diplomatic exchanges resulted in an alliance between the Tangs and the Karakotas. In 722, after the Tangs defeated Tibet, the Chinese court praised Kashmir for providing plenty of food to their troops stationed in Gilgit. Kalhana mentions that he was assassinated by his brother, Tarapida. === Tarapida === Not much is mentioned about his rule in the Rajatarangini, except that he was cruel and mistreated the Brahmins. === Lalitaditya Muktapida === Lalitaditya Muktapida (724/725−760/761) is credited by Kalhana with conquering large areas of India, Afghanistan, and Central Asia. He is also said to have defeated Yashovarman and taken control of Kannauj. Kalhana lived about four centuries after Lalitaditya, and by that time, popular imagination seems to have exaggerated Lalitaditya's achievements. Lalitaditya is also mentioned in the Tangshu During his reign, many Brahmin immigrants, including the ancestors of Abhinavagupta, came to Kashmir. A rich culture and strong focus on learning grew during this time. === Kuvalayapida === Kuvalayapida was the son of King Lalitaditya and Queen Kamaladevi. He ruled for a short time, only one year and half a month. His rule was troubled by a fight for power with his half- brother. The only record of his reign comes from the Rajatarangini, who described him as a good king. Kuvalayapida was betrayed by his minister. Realizing that power was not important, he left his throne and went to live in a holy forest, where he is believed to have found spiritual peace. === Vajraditya === Jayapida was the son of King Lalitaditya and his second queen, Chakramardika. He was also known as Bappiyaka. There is no other record of his rule except in the Rajatarangini. Kalhana described his seven-year reign as cruel. === Prithivyapida I === According to Kalhana, he ruled for four years and one month. He was overthrown by Samgramapida I, who ruled for only seven days. Although Tribhuvanapida was the eldest, he had given up the throne. Kalhana did not provide any more details but believed that neither of them was fit to rule. === Jayapida === Jayapida ruled for 31 years and carried out many military campaigns in distant regions, possibly to surpass Muktapida. However, Kalhana's account is considered highly exaggerated. Since no other historical sources confirm these events across such a large area, the accuracy of these conquests is uncertain. During Jayapida's reign, Brahmin immigrants from the Indus and Dravida regions were settled in Kashmir. Kshemendra's great-great- grandfather, Narendra, served as a minister in his court. While on a conquest, Jayapida married Kalyanadevi, the daughter of King Jayanta of Cooch Behar. When he returned to Kashmir, he discovered that his brother-in-law, Jajja, had taken the throne. Jayapida fought and defeated him to reclaim his rule. Jayapida had two sons—Lalitapida (from Durga) and Samgramapida II (from Kalyanadevi). === Lalitapida === Kalhana criticizes Lalitapida for being a careless and extravagant ruler. His court was full of courtesans, concubines, and entertainers, and he didn’t support education or learning. He ruled for twelve years and gave land grants to Brahmins. === Sangramapida II === Lalitapida was succeeded by his step-brother Samgramapida II, also known as Prithivyapida II. He had at least one son, Anangipida, and ruled for seven years. === Cippatajayapida === Cippatajayapida also known as Brhaspati was crowned in 837/8. However, since he was very young, real power was held by the five brothers of his mother, Jayadevi,namely Padma, Utpala, Kalyana, Mamma, and Dharma. While they followed Jayadevi's orders, they were responsible for serious mismanagement of the kingdom. == Decline == After Cippatajayapida was murdered around 840, having ruled for twelve years, the five brothers gained power but fought each other for control of the empire. They set up puppet kings from the Karkota family. Utpala made Tribhuvanapida's son, Ajitapida, king right after Cippatajayapida's death. A few years later, Mamma defeated Utpala and put Anangipida on the throne. Three years later, Utpala’s son, Sukhavarman, rebelled and placed Utpalapida, a son of Ajitapida, as king. Under Utpalapida, merchants in the outer regions of the empire declared independence. Sukhavarman then tried to take the throne for himself but was killed by a relative. Eventually, his son Avantivarman overthrew Utpalapida around 855 with the help of minister Sura, starting the Utpala dynasty, thus ending the Karkotas. == References == Category:Former empires Category:Empires in Asia Category:7th-century establishments in India",
 "title": "Karkota dynasty"
}