{
 "id": "1144667",
 "text": "Qualifying for the UEFA Euro 2000 final tournament, took place between 1998 and 1999. Forty-nine teams were divided into nine groups. All teams played against each other within their groups on a home-and-away basis. The winner of each group and the best runner-up qualified automatically for the final tournament. The rest of the runners-up played an additional set of playoff matches amongst each other. Both Belgium and the Netherlands qualified automatically as the co-hosts of Euro 2000. ==Qualified teams== Team Qualified as Qualified on Previous appearances in tournament 3 (1972, 1980, 1984) 5 (1976, 1980, 1988, 1992, 1996) Group 9 winner 4 (1960, 1976, 1980, 1996) Group 2 winner 0 (debut) Group 5 winner 1 (1992) Group 6 winner 5 (1964, 1980, 1984, 1988, 1996) Group 1 winner 4 (1968, 1980, 1988, 1996) Group 3 winner 7 (1972, 1976, 1980, 1984, 1988, 1992, 1996) Group 4 winner 4 (1960, 1984, 1992, 1996) Group 7 winner 2 (1984, 1996) Group 8 winner 4 (1960, 1968, 1976, 1984) 2 (1984, 1996) 5 (1964, 1984, 1988, 1992, 1996) 5 (1968, 1980, 1988, 1992, 1996) 0 (debut) 1 (1996) ==Qualification seeding== The draw occurred on 18 January 1998, in Ghent, Belgium. The 49 participating teams were divided into five drawing pots based on the newly-introduced 1997-edition of the UEFA national team coefficient ranking. The rankings calculated an average of the team's points per game achieved combined in the Euro 1996 and 1998 World Cup qualifiers. The seeding list was however subject to some modifications: * Germany were seeded first and not fifth as the defending champions (title holders). * Netherlands (ranked 11th) and Belgium (ranked 18th) were not seeded, as they did not participate in the qualifying tournament due to already having qualified automatically for the final tournament as hosts. Consequently, all teams ranked below them moved up one or two seeding places higher than their rankings. Nine groups were formed by drawing one team from each of the five pots. The remaining four teams from pot five were later randomly drawn into four of the groups. This meant that the four groups with six teams featured two teams from pot five. {| class=\"wikitable\" Team (title holders) 2.35 1 2.60 2 2.45 3 2.39 4 2.37 5 2.30 6 2.30 7 2.28 8 2.22 9 Note: The UEFA national team coefficient ranking automatically had taken into account in its ranking calculation, that France automatically qualified as hosts for the 1998 FIFA World Cup, meaning that the coefficient for France only factored their UEFA Euro 1996 qualifying record. Similarly, the coefficient considered only the 1998 FIFA World Cup qualification record for England, FR Yugoslavia, and Bosnia and Herzegovina. England automatically qualified as hosts of UEFA Euro 1996 while FR Yugoslavia were suspended due to UN sanctions. Bosnia and Herzegovina made their European qualification debut. Andorra made their qualification debut after being admitted to UEFA in November 1996. ==Summary== Group 1 Group 2 Group 3 Group 4 Group 5 Group 6 Group 7 Group 8 Group 9 ==Tiebreakers== If two or more teams finished level on points after completion of the group matches, the following tie-breakers were used to determine the final ranking: # Higher number of points obtained in the matches played among the teams in question; # Superior goal difference in matches played among the teams in question; # Higher number of goals scored away from home in the matches played among the teams in question; # Superior goal difference in all group matches; # Higher number of goals scored in all group matches; # Higher number of away goals scored in all group matches; # Fair play conduct in all group matches (1 point for a single yellow card, 3 points for a red card as a consequence of two yellow cards, 3 points for a direct red card, 4 points for a yellow card followed by a direct red card). ==Groups== ===Group 1=== ===Group 2=== ===Group 3=== ===Group 4=== ===Group 5=== ===Group 6=== ===Group 7=== ===Group 8=== ===Group 9=== ===Ranking of second-placed teams=== The best runner-up of the entire group phase qualified automatically for the final tournament. To determine the best runner-up, a comparison was made between all of them. As some groups had five teams and others had six, matches played against fifth and sixth placed teams were discarded, despite the fact that only discarding matches against sixth-place teams would have been sufficient. After the best runner-up was found, all the others entered a random playoff to determine the last four qualifiers. Portugal qualified as best runner-up, beating Turkey on goal difference. ==Play-offs== The remaining eight runners- up entered a random playoff, disputed in two legs, home and away. |} ==References== ==Other websites== * UEFA Euro 2000 at UEFA.com Category:UEFA Euro 2000",
 "title": "UEFA Euro 2000 qualifying"
}