{
 "id": "1144090",
 "text": "Gonçalo Lobo Pinheiro (born April 4,1979) is a Portuguese photojournalist and documentary photographer. He has lived in Macau, China, since 2010. Over his career, he has won several awards and held many photography exhibitions, both on his own and as part of groups. In 2023, he won first place in the series category at the Paraty em Foco International Photography Festival in Brazil. He was also one of the winners of the 8th edition of the Open Call Poster Mostra in Lisbon, Portugal, in the same year. ==Biography== Gonçalo completed high school at Escola Secundária Gil Vicente. He started studying Geological Engineering at Universidade Nova de Lisboa in 1997 but later switched to Communication Sciences with a focus on Journalism at the Autonomous University of Lisbon. He finished this degree in 2005. He also has a master’s degree in Documentary Photography from LABASAD in Barcelona. Gonçalo began working with photography in 2000. In 2002, he started a professional internship at the news agency Intermeios. For six years, he worked as a photographer for the newspaper A Bola. He also worked with other newspapers like Público, Correio da Manhã, Diário de Notícias, Expresso, The Guardian, BBC, and The Washington Post. From 2004 to 2010, he was the official photographer for Brazilian singer Daniela Mercury in Portugal. After moving to Macau, he worked at the newspaper Hoje Macau from 2010 to 2014 as a writer, photojournalist, and editor. He was the photography coordinator for Macau magazine from 2011 to 2021 and worked as a multimedia journalist and editor for Plataforma Media from 2018 to 2021. He joined Ponto Final newspaper as a photojournalist and editor until mid-2023, and since November 2022, he has collaborated with Lusa News Agency and the European Pressphoto Agency. Gonçalo has supported many charity projects and organizations, especially those focused on social and human rights causes. He joined the Italian collective Perimetro for the “United Photographers for Ukraine” and “Prints for Gaza” campaigns. His work is represented by Icon Artes Galeria in Brazil and Galeria Amagao in Macau. His photographs are part of the contemporary collection of the Museum of Avant-garde in Switzerland, which will open in 2025. His books can be found in libraries around the world, including the National Library of Portugal, the Library of Congress in the U.S., the National Library of France, the National Library of Germany, and the Central Library of Macau. ==Publications== ===Publications by Pinheiro=== *2015: Macau 5.0 | 澳門 5.0 | Macao 5.0. Macao. . *2019: Myanmar: o retrato de um povo. Rui Cunha Foundation, Macao. . *2021: Desvelo • 關愛 • Zeal. Ipsis Verbis, Macao. *2021: Tonle Sap. Artisan Raw, Brazil. *2022: O que foi, não volta a ser.... Ipsis Verbis, Macao. . *2023: Um vislumbre de luz • 一瞥光亮 • A glimpse of light. Ipsis Verbis, Macao. *2024: Close to Me, Ipsis Verbis, Macau ===Publications with others=== *2012: The Harmony of Disability, edição coletiva - Associação de Fotógrafos de Imprensa Desportiva, Macau *2013: Antologia Luso-Brasileira de Fotografia Contemporânea – Volume IV – 'Essência e Memória', edição coletiva, Chiado Editora, Portugal *2020: Cidades vazias com gente dentro - Volume II, edição coletiva, Almalusa e iNstantes, Portugal *2020: Everydaycovid. Diários fotográficos em estado de emergência, edição de autor coletiva, Portugal *2020: The Other Hundred - Healers, edição coletiva - Global Institute For Tomorrow, Hong Kong *2021: #ICPConcerned: Global Images for Global Crisis, edição coletiva, International Center of Photography and G Editions (Glitterati Editions), EUA *2021: Narratives in the Oriente, edição coletiva, Fundação Oriente, Macau *2021: Era uma vez Jorge Sampaio - Histórias e imagens, edição coletiva, Tinta-da-China, Portugal *2022: The Year Time Stopped: The Global Pandemic In Photos, edição coletiva, HarperCollins, EUA == Awards == *2007: 1st place, Liberty Best Moment category, Liberty Seguros Photojournalism Awards *2009: 2nd place, Liberty Best Moment category, Liberty Seguros Photojournalism Awards *2018: 3rd place, Portrait category, Chromatic Photography Awards *2018: 2nd place, Architecture category, Chromatic Photography Awards *2018: Silver, One Eyeland Photography Awards *2019: 3rd place, Architecture category, Fine Art Photography Awards *2019: Finalist and Editors' favorite submission, National Geographic Travel Photos Contest *2019: Winner, Latin American Fotografía 8, American Illustration and American Photography (AI-AP) *2020: Winner, series category, \"Macau 2020 - A Time for Introspection\", Macau Closer *2021: Bronze, Press/Sports category, Px3|Prix de la Photographie, Paris (PX3) *2021: Winner and \"Best of Best\", Photography Masterprize Award - Architecture Masterprize *2022: Bronze, Moscow International Foto Awards, International Awards Inc. *2022: 2nd place, MonoVisions Photography Awards *2022: Silver, Prix de la Photographie, Paris (PX3) *2022: Gold, People / Family category, Budapest International Foto Awards, International Awards Inc. *2023: 8th edition Open Call winner, Poster Mostra *2023: Bronze, Prix de la Photographie, Paris (PX3) *2023: 1st place, winner essay category, Festival Internacional de Fotografia Paraty em Foco *2023: 3rd place, Special/Other category, International Photography Awards (IPA) *2023: 1st place, editorial/other and architecture/cityscape categories, Neutral Density Photography Awards (ND) *2023: Bronze, Editorial / Photo Essay category, Budapest International Foto Awards, International Awards Inc. *2024: Silver, Editorial/Photo Essay category, Tokyo International Foto Awards, International Awards Inc. *2024: Award of Excellence, POY Asia - Pictures of the Year Asia 2024 *2024: Silver, The Prix de la Photographie Paris (PX3) ==References== ==Other websites== * *Gonçalo Lobo Pinheiro on Visura *Gonçalo Lobo Pinheiro on Macau Memory Project Category:Living people Category:Photographers Category:Portuguese photographers Category:People from Lisbon Category:1970 births Category:Photojournalists",
 "title": "Gonçalo Lobo Pinheiro"
}