{
 "id": "1144125",
 "text": "Anthony's poison arrow frog (Epipedobates anthonyi) is a frog. It lives in Ecuador and Peru. ==Body== The adult male frog is 19-24.5 mm long from nose to rear end and the adult female frog is 17.0–21.0 mm long. When tadpoles first become frogs, they are 11 mm long from nose to rear end. The frog has short, strong back legs. The skin of the frog's back is red in color with yellow or white stripes. Frogs that live with humans can live to be four years old. ==Home== This frog is awake during the day. It lives in forests near streams. People have also seen it in cacao farms and banana farms and near roads. Scientists saw the frog between 150 and 1770 meters above sea level. Two of the places this frog lives are protected parks: Reserva Biológica Buenaventura and Bosque Petrificado de Puyango. ==Food== The frog eats ants, beetles, spiders, and other animals with bones on the outside. ==Young== The male frogs choose good places for eggs. The female frog lays eggs on the dead leaves on the ground. She lays 15 to 40 at a time. The male frog watches the eggs until they hatch. He stops them from drying out. The male frog fights other frogs that come near the eggs. After the eggs hatch, the male frog carries the tadpoles to streams where they swim and grow. People have seen male frogs carrying fourteen tadpoles at the same time. Frogs that live with humans become adults eleven months after they stop being tadpoles. ==Chemicals== This frog has chemicals in its skin that are poison. It has less poison than frogs in Phyllobates or Dendrobates. E. anthonyi's poison can stop pain. Scientists think the frog gets the poison from something it eats. They think this because frogs that live with humans do not have poison. ==Danger== Scientists from the International Union for the Conservation of Nature say this frog is in some danger of dying out: near threatened. The government of Peru also says this frog is near threatened in Peru. The government of Ecuador says it is not in danger of dying out in Ecuador. People cut down many trees to make farms, to make farms against the law, to get wood to build with, and to make towns. Bad chemicals that people use to make crops grow and kill insects that eat crops can also kill this frog. People also catch this frog to sell as a pet, but scientists do not know if this is a danger to the frog or not. In the 1970s and 1980s people would catch this frog to use in laboratories. Scientists studied the chemicals in the frog's skin. People passed laws to make this harder to do. ==References== Category:Frogs of South America Category:Poison dart frogs",
 "title": "Anthony's poison arrow frog"
}