{
 "id": "1144396",
 "text": "Arik Ben Marshall (born February 13, 1967) is an American guitarist, singer, songwriter, poet, and author, best known as a member of the Red Hot Chili Peppers in 1992-93. == Early life == Arik Ben Marshall is the third of five children born to an African-American father and a Jewish mother. == Musical beginnings == After performing around Los Angeles with a variety of musicians, Marshall began getting work as a session musician, appearing on recordings for artists such as Tone Loc, Etta James, and Sting. In 1988, he and his brother Lonnie Marshall formed a band they called Marshall Law. They signed a development deal with Island Records and recorded a demo for them. The band broke up having only released two tracks on a Ska Parade compilation. After the breakup, Lonnie formed Weapon of Choice. Marshall continued to perform locally in Los Angeles and briefly led his own band, Alpha Jerk, before disbanding it to join the Red Hot Chili Peppers in 1992. Marshall Law reunited in 2006 and released an album, another X-cuse. == Red Hot Chili Peppers == Marshall joined the Red Hot Chili Peppers in 1992 to replace lead guitarist John Frusciante, who quit in the middle of the band's worldwide Blood Sugar Sex Magik Tour. He toured extensively with the band during his tenure as their guitarist and played the Lollapalooza festival of that year. Singer Anthony Kiedis later praised Marshall for being \"a quick study\" and never letting them down onstage. == Film and television appearances == Marshall appeared on Saturday Night Live and The Rosie O'Donnell Show with Macy Gray. He performed at the 1992 MTV Video Music Awards and the 1993 Grammy Awards shows with the Red Hot Chili Peppers. He appeared on The Simpsons episode \"Krusty Gets Kancelled\" as part of the Red Hot Chili Peppers' cameo appearance. He appeared in 2002's Spider-Man movie in a cameo appearance with Macy Gray. He acted in and wrote the soundtrack to an Academy Award-winning USC student film, Peace & Quiet. In an interview in 2007, Marshall said of the film, \"I played a mulatto punk-rocker who destroys this old guys suburban home...right in front of him! I wore a Mohawk and a Funkadelic t-shirt...\" Marshall appeared as the guitarist in the wedding scene of the 2009 movie The Hangover. == References == Category:1967 births Category:Living people Category:American guitarists Category:Red Hot Chili Peppers members",
 "title": "Arik Marshall"
}