{
 "id": "1144958",
 "text": "The Place is a dance venue and school in London, England. Established in 1969, it serves as a hub for contemporary dance, offering a range of classes, performances, and professional development opportunities. The Place houses the famous London Contemporary Dance School and is operated by the Contemporary Dance Trust. == History == The Place was founded in 1969 by Robin Howard, an influential figure in British contemporary dance. His vision was to create a space dedicated to nurturing talent in the field of contemporary dance. Initially in a small building on Duke's Road, The Place expanded over the years to become one of the most important centers for dance education and performance in the UK. == Facilities == The Place is located at 17 Duke’s Road and features a 288-seat theatre known as the Robin Howard Theatre, named in honor of its founder. The facility includes multiple studios, rehearsal spaces, and administrative offices that support both the London Contemporary Dance School and other dance-related programs and activities. == London Contemporary Dance School == The London Contemporary Dance School (LCDS), housed within The Place, is one of the leading institutions for dance education in Europe. Offering undergraduate and postgraduate programs in contemporary dance, LCDS attracts students from around the world and is known for its rigorous training and emphasis on innovation in dance. == Performances and Programs == The Place is home to numerous performances and festivals throughout the year. It hosts both emerging and established artists, providing them with a platform to showcase contemporary dance works. Key programs include: * Resolution Festival: An annual festival showcasing new choreographers and emerging dance companies. * Summer Dance Courses: Intensive training sessions open to dancers of all levels. * Professional Classes: Regular classes aimed at professional dancers looking to maintain and develop their skills. == Community Engagement == The Place is committed to community engagement and offers a range of outreach programs, including dance workshops for young people, adults, and individuals with disabilities. Its outreach initiatives aim to make dance accessible and foster a deeper appreciation for contemporary dance within the local community. == Notable Alumni == Over the years, The Place and its school have trained numerous notable dancers and choreographers who have gone on to achieve international acclaim, including: * Richard Alston * Siobhan Davies * Hofesh Shechter == Location and Accessibility == The Place is centrally in London, close to Euston Station and within easy reach of public transportation. The facility is fully accessible, with services and accommodations for visitors with disabilities. == Related pages == * Sadler's Wells Theatre * Contemporary Dance * London Contemporary Dance School == References == == Other websites == * Official website * London Contemporary Dance School at The Place Category:Schools in London Category:1969 establishments in the United Kingdom",
 "title": "The Place, London"
}