{
 "id": "1145500",
 "text": "Suzanne Guéry with marriage name Loth (9 July 1897 — 19 March 1991) was a French athletics competitor during the late 1910s and early 1920s, during the earliest era of women's athletics. She was specialized in the middle-distance (1000 metres) but also competed in sprint events and in cross country running. She was national champion and reprsented France internationally. ==Biography== Suzanne Guéry was born on 9 July 1897 in Bourg-la-Reine. She was the daughter of bank messenger Edouard Clément Guéry and Marie Lupart.According to document no. 28 in the civil registry of the town of Bourg-la-Reine, birth in 1897. Guéry was a member of Académia in Paris. She was specialized in the 1000 metres, but also competed in the 60 metres, 250 metres, 300 metres, 4 x 200 metres relay and cross-country running. Guéry became at the 1919 French Athletics Championships national champion in the 1000 metres. In this distance she finished in 1920 third behind Suzanne Porte and Angèle Bertojo and at the 1921 national championships second behind Porte. At the 1919 French championships she also won the silver medal in the 300 metres behind Suzanne Liebrard and in 1920 third behind Raymonde Canolle and Antonia Mignon. Guéry also competed in cross-country running and finished fourth at the national championships in 1919. Guéry competed at the first international women's competition, the 1921 Women's Olympiad in Monte Carlo in March 1921. She participated in the 60 metres event, 250 metres event and 4 x 200 metres event. Later the year she was also selected to represent France at the 1922 France–Belgium women's athletics match where she finished third in the 1000 metres. In 1930 she married Arthur Loth in Montmorency. They had three children together.Paris-Midi of December 23, 1941, mother and sportswomen. She died in Saint-Cloud on 19 March 1991 at the age of 93 years. ==References== Category:1897 births Category:French athletes Category:1991 deaths Category:Middle-distance runners Category:French sprinters Category:People from Hauts-de-Seine",
 "title": "Suzanne Guéry"
}