{
 "id": "1145803",
 "text": "The David Geffen School of Medicine at UCLA (DGSOM) is the medical school of the University of California, Los Angeles (UCLA). It is in Los Angeles, California. It was founded in 1951. It has grown to become one of the leading medical schools in the United States, recognized for its research, medical education, and healthcare services. == History == The school was established in 1951 as part of the University of California system. In 2002, entertainment executive and philanthropist David Geffen donated $200 million to the school, which was subsequently renamed the David Geffen School of Medicine at UCLA. Geffen's donation marked one of the largest gifts to a medical school in the United States at the time. == Academics == DGSOM offers a wide range of academic programs, including the Doctor of Medicine (MD) degree, the MD/PhD program, and various dual-degree programs such as the MD/Master of Public Health (MPH) and MD/Master of Business Administration (MBA). The school is affiliated with UCLA Health and various hospitals throughout Los Angeles, providing students with extensive clinical training opportunities. === Research === DGSOM is known for its research programs in areas like neuroscience, oncology, cardiology, and genomics. The school receives significant funding from the National Institutes of Health (NIH) and conducts groundbreaking research that contributes to advancements in medical science and patient care. == Campus == The main campus is located within the UCLA campus in Westwood, Los Angeles. DGSOM includes multiple research centers and is affiliated with the Ronald Reagan UCLA Medical Center, one of the top hospitals in the United States. Facilities on campus include state-of-the-art labs, teaching hospitals, and the Geffen Hall, which houses medical education and administrative offices. == Admissions == Admissions to DGSOM are highly competitive. The school seeks candidates with strong academic backgrounds, a commitment to medicine, and leadership qualities. It also emphasizes diversity and inclusion, aiming to train physicians who can serve a wide array of communities. == Related pages == * University of California, Los Angeles * Ronald Reagan UCLA Medical Center == References == * David Geffen School of Medicine at UCLA Official Website * \"Geffen's $200 Million Gift to UCLA Med School\", Los Angeles Times, May 15, 2002. * UCLA Newsroom – About David Geffen School of Medicine == Other websites == * Official website * UCLA Health Category:University of California, Los Angeles Category:Medical education in the United States Category:1951 establishments in the United States",
 "title": "David Geffen School of Medicine at UCLA"
}