{
 "id": "1145075",
 "text": "The Volhynia massacre refers to a series of mass murders targeting the Polish minority in Volhynia (), Eastern Galicia, between 1943 and 1945.* * * The massacre was committed by the Ukrainian Insurgent ArmyUkrainian: Українська повстанська армія (УПА) (UPA) between July and August 1943, * * Grzegorz Motyka, Od rzezi wołyńskiej do akcji \"Wisła, Kraków 2011, , s.447, Ewa Siemaszko estimates victims to be 133,000 in Stan badań nad ludobójstwem dokonanym na ludności polskiej przez Organizację Ukraińskich Nacjonalistów i Ukraińską Powstańczą Armię, Bogusław Paź (ed.), Ludobójstwo na Kresach południowo-wschodniej Polski w latach 1939–1946, Wrocław 2011, , s.341. * as many as 133,000 Poles were reportedly killed. ==Background== Eastern Galicia was historically part of the Polish–Lithuanian Commonwealth, which was divided between the Kingdom of Prussia, the Austrian Empire, and Russian Empire in 1795. Volhynia came under Russian rule and bordered Austrian Poland. When Poland became independent again in 1918, she fought two years of war with the Soviet Union. During the first year, there was a parallel conflict with the short-lived Ukrainian People's Republic (UPR), which lost Eastern Galicia to Poland. ==Prelude== ===Interwar period=== Prior to World War II, Ukrainian speakers reportedly made up 68% of Volhynian residents. Around 17% were Polish speakers; 10% spoke Yiddish; 2% spoke German; 2% spoke Czech; and 1% spoke Russian. Some historians said that the Polish government treated Eastern Galacia's Ukrainians badly. The Organization of Ukrainian Nationalists (OUN) was formed and fought for Ukrainian independence in the 1930s. They wanted to take back land that including the Soviet-occupied eastern Ukraine, whose population was suffering under the Holodomor. This was a man-made famine created by Joseph Stalin that killed as many as 7,000,000 Ukrainians. * * * * * * * * * 81 years on, the Holodomor is still denied or downplayed by most Western progressives: * * * * * * * Reportedly, 190 Ukrainian Orthodox churches in Volhynia had been destroyed by 1937, with another 150 converted into Roman Catholic churches. Polish citizens were also encouraged to move to Volhynia. Soon 17,700 Polish citizens were living in Volhynia in 3,500 new settlements. This influx of immigrants caused racial tension and sectarian violence,Lidia Głowacka, Andrzej Czesław Żak, Osadnictwo wojskowe na Wolyniu w latach 1921–1939 w swietle dokumentów centralnego archiwum wojskowego (Military Settlers in Volhynia in the years 1921–1939), PDF, pp. 143 (4 / 25 in PDF), 153 (14 / 25 in PDF). worsened by communist agitation, paving the way for the atrocities later on. ===World War II=== In September 1939, Nazi Germany and the Soviet Union invaded Poland. Poland was split in two, placing Volhynia under Soviet rule. When the Nazis invaded the Soviet Union in June 1941, around 200,000 Poles had already been deported to Siberia. After Nazi Germany took over Volhynia from the Soviets, the OUN-Banderite faction (OUN-B) launched a series of antisemitic pogroms. The deadliest were the Lviv pogroms, where at least 5,000 Polish Jews were killed. Some OUN-B commanders sought to eliminate the local Poles in addition to the Jews. Contrary to popular belief, there is no evidence that the OUN-B leader Stepan Bandera, who was not released from the Sachsenhausen concentration camp until September 1944, was involved in any of such pogroms. ==Events== The first case of mass murder, known as the Parośla I massacre, was committed on February 9, 1943 by a UPA group disguised as Soviet partisans. The second mass murder was committed during the 1943 Holy Week, killing 600 Poles. The mass murder peaked in July–August 1943. As many as 11,000 Poles were killed during UPA's attacks on 520 Polish villages. In revenge, the Polish Home Army (Polish: Armia Krajowa, AK) reportedly killed 2,000 Ukrainians. The series of mass murders continued until spring 1944, when Nazi troops withdrew from Ukraine to escape the invading Soviets. British historian Norman Davies wrote about the massacre: ===Death toll=== Between July and August 1943, as many as 133,000 Poles were reportedly killed. British-American historian Niall Ferguson estimated that 60,000‒80,000 were killed. German-Polish historian Grzegorz Rossoliński-Liebe estimated 70,000–100,000.G. Rossolinski-Liebe. Celebrating Fascism and War Criminality in Edmonton. The Political Myth and Cult of Stepan Bandera in Multicultural Canada. Kakanien Revisited. 29 December 2010. Swedish-American historian Per Anders Rudling put the toll at 40,000–70,000. Meanwhile, American historian Timothy Snyder said that the UPA might have killed as many Ukrainians as it killed Poles due to UPA's perception that Ukrainians who did not follow its form of nationalism were traitors. ==Aftermath== The Volhynia massacre is a controversial issue in the study of Eastern European history. It is considered the Achilles' heel of Poland–Ukraine relations, which has prevented Ukraine from joining the European Union (EU). * * * ===Responsibility=== According to prosecutor Piotr Zając, Poland's Institute of National Remembrance considered three scenarios in its 2003 investigation: # Ukrainian nationalists had planned to remove the Poles, but events got out of hand over time # The decision to wipe out the Poles came directly from the OUN-UPA headquarters # The decision to wipe out the Poles can be attributed to some of the OUN-UPA leaders during an internal dispute The IPN concluded that the second scenario was the most likely. ===Genocide question=== Since the end of WWII, people have asked themselves if the Volhynia massacre was a genocide or an ethnic cleansing. The Polish establishment classified the massacre as a genocide, while the European Network Remembrance and Solidarity (ENRS) deemed it a \"genocidal ethnic cleansing\". On the other hand, Holocaust historian Jared McBride said in 2016 that most scholars agreed that the Volhynia massacre was an ethnic cleansing rather than a genocide. German-Polish historian Grzegorz Rossoliński-Liebe shared this view. ==Related pages== * Yazidi genocide * Katyn massacre * Bosnian genocide * 7 October 2023 attack on Israel * Yugoslav massacres of Kosovo Albanians during the Kosovo War ==References== Category:Pogroms Category:Massacres Category:History of Poland Category:History of Ukraine",
 "title": "Volhynia massacre"
}