{
 "id": "1145913",
 "text": "Melissa Lantsman (born April 8, 1984) is a Canadian politician and public relations executive. She has served as the Member of Parliament (MP) for Thornhill since 2021. A member of the Conservative Party, she is co-deputy leader of the party and the Official Opposition, alongside Tim Uppal. Lantsman is the first openly gay and first Jewish woman elected as a Conservative MP. When Pierre Poilievre became Conservative leader, he appointed Lantsman as one of two deputy leaders. Lantsman worked as a communications advisor to several cabinet members in Prime Minister Stephen Harper's government. She was also a senior advisor to the Progressive Conservative Party of Ontario and served as its chief spokesperson during the 2018 Ontario provincial election. Before becoming an MP, she was the national vice president of Public Affairs at Enterprise Canada, a strategic communications firm. In 2020, when Peter Kent retired from Parliament, Lantsman announced she would run for the federal Conservative nomination in Thornhill. She won the nomination on March 17, 2021, defeating Gila Martow, the sitting Progressive Conservative MPP for the area. Lantsman was elected to Parliament on September 20, 2021, and officially took office on October 28. In November, she was named the Opposition critic for transport in Erin O'Toole's Shadow Cabinet. She was also elected vice- chair of the Parliamentary Standing Committee on Transport and Infrastructure and currently serves on the Special Committee on Canada–China Relations. == Career == As a teenager, Lantsman volunteered for Conservative candidates in local elections. During the 2008 federal election, she became a senior communications advisor when the Conservative Party won a minority government. She was then appointed as director of communications for the Ministry of Foreign Affairs, working under Ministers Lawrence Cannon and John Baird from 2008 to 2011. From 2011 to 2012, Lantsman was communications director for the Office of the Prime Minister, joining Stephen Harper on domestic and international trips. She briefly worked as a senior public affairs advisor at Coca-Cola before returning to government in 2014 as director of communications for Finance Minister Joe Oliver. After the Conservatives lost the 2015 election, Lantsman joined the private sector as a senior director at CIBC Capital Markets. == References == Category:1984 births Category:Canadian politicians Category:People from Toronto",
 "title": "Melissa Lantsman"
}