{
 "id": "1145713",
 "text": "Raajhorshee De is an Indian movie director and screenwriter known for his work in Bengali cinema.https://www.telegraphindia.com/entertainment/raajhorshee-de- on-abbar-kanchanjanghas-international-recognition/cid/1883122 == Career == While working as a Programming Head at 92.7 BIG FM, De was actively involved in Kolkata's Bengali professional theatre circuit. He performed in various productions, including Rudhha Sangeet and was a founding member and Secretary of Kalindi Bratyajon. In 2010, De joined Zee Entertainment Enterprises Limited as part of the creative team for Zee Bangla. He launched Zee Bangla Cinema, the first 24x7 Bengali cinema channel. Additionally, he led the launch of Zee Bangla Cinema Originals, overseeing the production of 22 original Bengali films. In 2016, he joined Viacom 18, where he produced Big Boss Bangla season 2 with Jeet as the host. De subsequently shifted focus to his filmmaking career and went on to direct multiple films.https://www.telegraphindia.com/entertainment/film-maker-raajhorshee-de- writes-about-binodini-opera-and-sudipta-chakraborty/cid/1941886 ==Filmography== === As a writer === Filmography (writer) Year Title Role IMDb Rating In Production Shubho Nababorshohttps://www.anandabazar.com/entertainment/nusrat-jahan-swastika- mukherjee-srabanti-chatterjee-and-many-more-stars-are-in-raajhorshee-de-back- to-back-two-films-dgtlx/cid/1522568 Writer (as Rajorshi Dey) In Production Birpurush Writer (as Rajorshi Dey) 2024 Sada Ronger Prithibi Writer 8.3 2023 Mayaa Writer 8.5 2022 Abbar Kanchanjangha Writer 6.3 2019 Purbo Paschim Dakkhin Uttor Ashbei Writer (as Rajorshi Dey) 8.4 2017 Curzoner Kalom Idea (as Rajorshi Dey) 6.9 2010 Terrorist Script (as Rajorshi Dey) 7.3 2008 ...And There Wasn't Everafter... Additional Dialogue (as Rajorshi Dey) === As a director === Filmography (director) Year Title Role In Production Shubho Nababorsho Director (as Rajorshi Dey) In Production Birpurush Director (as Rajorshi Dey) 2024 Sada Ronger Prithibi Director 2023 Mayaa Director 2022 Abbar Kanchanjangha Director 2021 A Separate Skyhttps://www.telegraphindia.com/my-kolkata/lifestyle/international-honours- for-raajhorshee-des-a-separate-sky/cid/1841042 Director 2019 Purbo Paschim Dakkhin Uttor Ashbei Director (as Rajorshi Dey) === As an actor === Filmography (actor) Year Title Role 2023 Ektu Sore Boshun Actor 2021 Unicorn Actor (as Rajorshi Dey) 2018 Pornomochi Actor (as Rajorshi Dey) 2014 Chotushkone Subroto (as Rajorshi Dey) 2010 Terrorist Man 1 (as Rajorshi Dey) ==References== == Other websites == Category:Indian movie directors",
 "title": "Raajhorshee De"
}