{
 "id": "1145285",
 "text": "This is a list of federal conservative party leaders in Canada after Confederation == List of Tory leaders in Canada since Confederation == This is a list of leaders of Canada’ Conservative parties (1867–present) and prime ministers from those parties since Confederation. === Conservative (1867-1942) === Name From To Riding as leader Notes Sir John A. Macdonald July 1, 1867 June 6, 1891 Kingston, ON (1867–18, 1887–91); Victoria, BC (1878–82); Carleton, ON (1882–88) 1st Prime Minister Sir John Abbott June 16, 1891 November 24, 1892 Senator for Inkerman, QC 3rd Prime Minister Sir John Sparrow David Thompson December 5, 1892 December 12, 1894 Antigonish, NS 4th Prime Minister Sir Mackenzie Bowell December 21, 1894 April 27, 1896 Senator for Hastings, ON 5th Prime Minister Sir Charles Tupper May 1, 1896 February 6, 1901 Cape Breton, NS 6th Prime Minister Sir Robert Laird Borden February 6, 1901 July 10, 1920 Halifax, NS (1900–04, 1908–17); Carleton, ON (1905–08); Kings, NS (1917–21) 8th Prime Minister Arthur Meighen July 10, 1920 September 24, 1926 Portage la Prairie, MB (1908–21, 1925–26); Grenville, ON (1922–25) 9th Prime Minister Hugh Guthrie (interim leader) October 11, 1926 October 12, 1927 Wellington South R. B. Bennett October 12, 1927 July 7, 1938 Calgary West, AB 11th Prime Minister Robert Manion July 7, 1938 May 14, 1940 London, ON Resigned after lost seat in 1940 election Richard Hanson (interim leader) May 14, 1940 November 12, 1941 York—Sunbury, NB Arthur Meighen November 12, 1941 December 9, 1942 Senator for St. Marys, Ontario Resigned after failed attempt to enter the House of Commons in the York South by-election. === Progressive Conservative Party of Canada (1942–2003) === Picture Name Term start Term end Riding as leader Notes John Bracken December 11, 1942 July 20, 1948 Neepawa Former Premier of Manitoba George Drew October 2, 1948 November 29, 1956 Carleton Former Premier of Ontario William Earl Rowe November 29, 1956 (Interim) December 14, 1956 Dufferin—Simcoe Interim leader until 1956 leadership convention John Diefenbaker December 14, 1956 September 9, 1967 Prince Albert 13th Prime Minister of Canada Robert Stanfield September 9, 1967 February 22, 1976 Halifax Former Premier of Nova Scotia Joe Clark February 22, 1976 February 19, 1983 Rocky Mountain, Yellowhead 16th Prime Minister of Canada Erik Nielsen February 19, 1983 (Interim) June 11, 1983 Yukon Interim leader until 1983 leadership convention Brian Mulroney June 11, 1983 June 13, 1993 Central Nova, Manicouagan, Charlevoix 18th Prime Minister of Canada Kim Campbell June 13, 1993 December 14, 1993 Vancouver Centre 19th Prime Minister of Canada Jean Charest December 14, 1993 April 2, 1998 Sherbrooke Former Premier of Quebec Elsie Wayne April 2, 1998 (Interim) November 14, 1998 Saint John Interim until 1998 leadership election Joe Clark November 14, 1998 May 31, 2003 Kings—Hants, Calgary Centre His second tenure as leader Peter MacKay May 31, 2003 December 7, 2003 Central Nova Final leader of the Progressive Conservative Party; merged the PC Party with Stephen Harper's Canadian Alliance in 2003, cofounding the new Conservative Party of Canada. === Conservative Party of Canada (2003–present) === Leader Term start Term end Constituency Notes — 20 March 2004 Senator for Grandville, Quebec Interim leader, served concurrently as Senate Opposition Leader. 1st Stephen Harper 20 March 2004 Acting: 19 October 2015 – 4 November 2015 Calgary Southwest, Alberta First official leader of the modern Conservative Party of Canada; Served as Leader of the Official Opposition from 2004–2006, and Prime Minister from 2006–2015. — Rona Ambrose 5 November 2015 27 May 2017 Sturgeon River—Parkland, Alberta Interim leader and served as Leader of the Official Opposition 2nd Andrew Scheer 27 May 2017 24 August 2020 Regina—Qu'Appelle, Saskatchewan Served as Leader of the Official Opposition from 2017 to 2020. He resigned on December 12, 2019, but stayed as leader until his successor was chosen on August 24, 2020. 3rd Erin O'Toole 24 August 2020 2 February 2022 Durham, Ontario Served as Leader of the Official Opposition from 2020 to 2022. He was removed by the Conservative caucus on February 2, 2022. — Candice Bergen 2 February 2022 10 September 2022 Portage—Lisgar, Manitoba Interim leader and served as Leader of the Official Opposition in 2022. 4th Pierre Poilievre 10 September 2022 Incumbent Carleton, Ontario Serves as current Leader of the Official Opposition. Category:Canadian politicians Category:Political parties in Canada Category:Lists of politicians",
 "title": "Leader of the Conservative Party of Canada"
}