{
 "id": "1145006",
 "text": "The marbled poison frog or marbled poison-arrow frog (Epipedobates boulengeri) is a frog. It lives in Colombia and Ecuador. ==Body== The adult male frog is 15.0–20.0 mm long from nose to rear end and the adult female frog is 17.0–21.0 mm long. The skin of the frog's back is a dark pink color or coffee color, with darker marks. The belly and bottoms of the feet are cream-white in color. The sides of the body are black in color with a white or yellow line on each side. The iris of the eye is dark or black in color. ==Home== This frog lives on the ground. People have seen it on the dead leaves on the ground, rocks, and small leafy plants. It lives in rainforests where the trees are close together. People also see them in gardens, banana farms, coconut tree farms, train tunnels, and other places that people have changed. Scientists saw the frog between 0 and 1500 meters above sea level. Many of the places this frog lives are protected parks: Reserva Ecológica Cayapas-Mataje, Parque Nacional Mache Chindul, Reserva Ecológica Cotacachi-Cayapas, Reserva Ecológica Los Illinizas, Parque Natural Isla Gorgona, Reserva Natural Biotopo, and Reserva Natural Indígena La Nutria. ==Young== The female frog lays eggs on the ground. She lays 9 to 14 at a time. After the eggs hatch, the male frog carries the tadpoles to streams where they swim and grow. People have seen male frogs carrying six tadpoles at the same time. ==Danger== Scientists say this frog is not in danger of dying out. They say it is good at living in places that human beings have changed. However, it can be in some danger if people change its forest, making it too dry. People cut down many trees to make farms, to make farms against the law, to get wood to build with, and to make towns. People also brought fish from other parts of the world. Scientists have found the fungus Batrachochytrium dendrobatidis on this frog. B. dendrobatidis causes the fungal disease chytridiomycosis, which kills frogs. However, the scientists did not find frogs that were very sick. People also catch this frog to sell as a pet, but scientists do not know if this is a danger to the frog or not. ==References== Category:Frogs of South America Category:Poison dart frogs",
 "title": "Marbled poison frog"
}