{
 "id": "1145009",
 "text": "Totally Accurate Battle Simulator (TABS) is a video game. In TABS, players create custom battles. The game is made by \"Landfall\", an indie game studio. TABS is priced at $15.49. It has its own physics engine and artstyle. It has two game modes, Campaign and Sandbox. There are dozens of different soldiers called \"units\" that the player can use to create custom battles. As of October 27, 2024, there were 2815 players playing TABS. == Physics == Half of the fun of playing TABS is watching the physics based battles. For example, units can go flying and faceplant on the ground. They can also miss their swings so badly that they trip. They can be hit so hard that they do cartwheels. The units in the game are low poly mannequins with googly eyes with their skin the color of their team (red or blue). There is cartoonish combat where no blood is spilled. Chris Clark a game reviewer at peermag.org said that the combat is similar to looney toons. Rick Lane, a game reviewer at Bit-gamer, said the combination of physics, grunts and squeals from the units and lack of battle tactics turned the game into on demand comedy. \"Making your own custom battles is incredibly fun, and with the dozens of units to choose from, the possibilities are endless.” \"Unlike the local pub bore banging on about why Richard the Lionheart would definitely beat a World War 1 Tank (he wouldn’t), TABS does not try to take its patently absurd question seriously. Regardless of what historical era or myth they derive from, every combatant in TABS is represented as a goggle-eyed, flaccid-limbed mannequin that, depending on which side it's on, is coloured either red or blue. There’s equally no attempt to replicate authentic battle strategy or combat tactics. Instead, every sword-swing and cannon-shot is powered by the game’s highly elastic physics engine.\" == Absurd Units == The other half of the fun playing TABS is watching the absurd soldiers in action. For example the renaissance faction has units called balloon archers that shoot arrows rigged with ballons. If the physics engine allows it (won't work on heavy units), the unit will be lifted into the sky. The ballon will then break sending them plummeting to their death. Units like ninjas and hwachas throw projectiles very fast. Sometimes entire factions are made of absurd units (example: the farmer faction). == References == * * * Category:2021 video games Category:Early access video games Category:Multiplayer and single-player video games Category:Nintendo Switch games Category:PlayStation 4 games Category:Sandbox games Category:Simulation video games Category:Strategy video games Category:Video games developed in Sweden Category:Windows games Category:Xbox One games",
 "title": "Totally Accurate Battle Simulator"
}