{
 "id": "1145531",
 "text": "Luis Felipe Monti (15 May 1901 – 9 September 1983) was an Italian Argentine footballer who played as a midfielder and an Olympian. Monti has the distinction of having played in two FIFA World Cup final matches with two different national teams. He played the first of these finals with his native Argentina in 1930, which was lost to Uruguay; and the second with Italy as one of their Oriundi in 1934, thanks to his Romagnol descent. This second time Monti was on the winning side in a 2–1 victory over Czechoslovakia. Monti was known for his extremely effective style of play. In the tactical system of the time, he played the role of a central midfielder, responsible not only for constructing his team's actions, but also for making life difficult for the opponent. He fulfilled his tasks in a ruthless way, usually played on the verge of a foul, but in almost every match he was able to dominate the midfield. He was known by the nickname Doble ancho (Double wide). Considered as one of the best defensive midfielders of all time. ==Club career== In his native country, Luisito began his career with Club Atlético Huracán, before joining the mythical Boca Juniors. He only really made his mark in Argentina at his third and last Argentine club, San Lorenzo (with whom he won three championships and the Rioplatense Cup of Dr. Ricardo C. Aldao (against the Uruguayan champion) in 1923 and 1927). Monti then crossed the Atlantic to play in Italy, his home country. In 1930 Monti was signed by the Italian club Juventus, as he had Italian citizenship. As he was overweight and out of condition, he had a month's solitary training. Monti was back to top form helping Juventus to four consecutive Serie A titles (1932 to 1935), also serving as the club's captain. Monti went on to play 225 matches and scored 19 goals in Italy. During the 1930s, he formed a formidable and successful defensive trio at the club, along with full-backs Virginio Rosetta and Umberto Caligaris, who played behind him. In 1935, Monti succeeded Virginio Rosetta and became the third captain in the history of the bianconero club (and the first foreign-born captain), until 1938. Nicknamed \"L'uomo che cammina2 (in English: the man who walks), he has played a total of 225 games with 19 goals in the Italian Serie A. ==International career== With the Argentine national team, he won three cups against Uruguay (the Lipton Cup in 1928 and the Newton Cup three times in 1924, 1927 and 1928). His playing is considered to be particularly \"rough\". In 1930, he was described as \"the most dangerous and the strongest defensive midfielder that world football has known\" by the newspaper L'Équipe3. He was also one of the main players in the \"Battle of Highbury\" on 14 November 1934 against the British. During the 1934 World Cup, in the quarter-finals against Spain, his physical game earned him the nickname \"butcher\" from a French journalist (he injured José Iraragorri, Crisant Bosch and Chacho in two games). His physical impact also proved decisive in the semi-finals when he injured the Austrian Matthias Sindelar, the best striker in the world at the time. Uniquely, he played in two World Cup finals for two different countries. He had a total of sixteen caps for the Argentine national team, from 1924 to 1931 (five goals, including two in the 1930 World Cup (one in the final)), as well as eighteen caps for the Italian national team from 1932 to 1936 (one goal). Despite its reputation, it has one of the most beautiful pre-war world records. ==Coaching career== Once his playing career was over, Monti started as a coach (with the clubs of Triestina, Juventus, Varese, Atalanta, Vigevano, Huracán and Pisa). He arrived on the bench of Juventus in place of Giovanni Ferrari in 1941, the club that made him famous as a player. He took charge of his first match on 8 February 1942 in a 1–0 win over Padua in the cup, and won his first trophy (the Coppa Italia in 1942) in his one and only bianconera season (where he won a total of 10 wins in 19 games). ==Death== He died in 1983 aged 82 in his hometown in Argentina. ==Honours== === Player === Club ;Huracán * Argentine Primera División (1): 1921 ;San Lorenzo * Argentine Primera División (3): 1923, 1924, 1927 ;Juventus * Serie A (4): 1931–32, 1932–33, 1933–34, 1934–35 * Coppa Italia (1): 1937–38 ===International=== ;Argentina * South American Football Championship: 1927 * Summer Olympics: Runner-up 1928 * FIFA World Cup: Runner-up 1930 ;Italy * FIFA World Cup: 1934 * Central European International Cup: 1933–35 ===Individual=== * FIFA World Cup All-Star Team (2): 1930, 1934 === Manager === Club Juventus * Coppa Italia (1): 1941–42 ==References== ==Other websites== * Detail of international appearances for Argentina and Italy, by RSSSF * Biography at Planet World Cup * * Short bio at La Gazzetta dello Sport !colspan=\"3\" style=\"background:#C1D8FF;\"| World Cup-winners status |- Category:1901 births Category:1930 FIFA World Cup players Category:1983 deaths Category:Footballers from Buenos Aires Category:Olympic silver medalists for Argentina",
 "title": "Luis Monti"
}