{
 "id": "114592",
 "text": "Bay Area Rapid Transit (BART) is a heavy rail public rapid transit system that serves the San Francisco Bay Area in northern California. It joins the cities of the East Bay, including Oakland, with San Francisco. Construction began in 1964. The first trains began running on September 11, 1972. ==Lines== As of 2022, there are five main lines on the system. There are of track (using a wider-than-normal gauge of ). There are 50 stations. Like other rapid transit systems in the world, tracks are in underground tunnels in inner cities, and on elevated viaducts in suburban areas. In some places, they are in the middle of freeways. The busiest part of the system is the Transbay Tube, a underwater tunnel under the San Francisco Bay. Almost 150,000 people pass through the tube every day. ==Fare== The fare which people pay to ride BART depends on how far they go. They first buy paper magnetic stripe cards inside the station. Then they insert this ticket into the gate, walk through the gate, and take the ticket out. They then get on board the train. Sometimes they have to change from one train to another to get to where they want to go. After they leave the train at their destination, they insert their ticket into the fare gate again to exit the station. Printed numbers on the card show how much money is left on the ticket. A passenger who enters and exits the same station will be charged an \"excursion fare\". , the fare was $6.75.. Retrieved June 24, 2024. ==Expansion== In the 2000s, BART was expanded to reach San Francisco International Airport. It now goes as far as Millbrae. Two other branch lines have opened since then. In 2014, BART opened a short line to Oakland International Airport that uses trains pulled by cables. An extension of the Pittsburg line to Antioch, which opened in 2018, uses diesel multiple units on standard gauge tracks instead of the electric, broad-gauge trains used on the main lines. A project is also going on to expand the southern main line into San Jose. The entire extension was supposed to be completed in 2018.South Bay BART KGO-TV, Friday, May 08, 2009 Instead, the first new stations were opened on June 13, 2020 after breakdowns in communication and testing with the line. ==References== ==Other websites== * Category:Rail transport in the United States Category:Transport in the San Francisco Bay Area Category:1972 establishments in California Category:Rapid transit systems in the United States",
 "title": "Bay Area Rapid Transit"
}