{
 "id": "1145248",
 "text": "Paule Augusta Florence Fercoq du Leslay de Keravegevel (12 December 1895 — 26 March 1948) was a French athletics competitor during the 1910s, during the earliest era of women's athletics. She was a member of Académia, Paris. She was in the high jump two times national champion and national record holder. Loup Odoevsky Maslov, Giovanni de Chanaz et Paule de Leslay, 12 March 2020, Chronique de Saint-Nazaire.Loup Odoevsky Maslov, Vedettes militaires et scandales dans la Jet-Set à Saint-Nazaire ou les tumultes amoureux d’un Italien et d’une Bretonne, Histoire & Patrimoine n°101, July 2021. ==Biography== Fercoq du Leslay de Keravegevel was born on 12 December 1895 in . She was the daughter of Louis Jules Marie Fercoq du Leslay de Keravegevel and Valérie Marie Poncin.According to document no. 982, in the civil status of the city of Paris, 20th arrondissement, died in 1948. At the 1918 French National Championships she became national champion in the high jump with a height of 1.29 metres ahead of Suzanne Liebrard. This height was also a French national record. She won the silver medal in the 83 metres hurdles behind Liebrard and the bronze medal in the 80 metres and shot put. In the standing long junp she finished fourth. The next year 1919 French National Championships she successfully defended her high jump national title. With a height of 1.32 metres she broke her own national record and finished ahead of Frédérique Küsel and Thérèse Brulé. In the long jump she won the silver medal behind Henriette Gorget. She didn’t have a podium finish in the 80 metres and shot put. Her national record was broken in 1920 with 1 cm by Thérèse Brulé. She died at her home in Paris on on 26 March 1948 at the age of 52 years. ==References== Category:1895 births Category:French athletes Category:1948 deaths Category:High jumpers Category:French long jumpers Category:French sprinters Category:Shot putters Category:French hurdlers",
 "title": "Paule Fercoq du Leslay"
}