{
 "id": "1145298",
 "text": "Douglas Bryan LeConte-Spink (1971–2020) was an American advocate for zoophilia known for a combination of criminal activities, including allegedly running a farm for people to practice bestiality. == Early life and education == Spink was born in Harmony, Pennsylvania on March 17, 1971 to Jack and Clair Spink. He grew up in Pennsylvania and attended a private academy. He enjoyed fox hunting and showed early interest in horse-jumping competitions. Spink earned a Bachelor of Arts in cultural anthropology from Reed College and a Master of Business Administration from the University of Chicago. In 2000, he was working toward a Doctor of Philosophy in systems science at Portland State University, where he was studying quantitative theories of consciousness. == Career == Spink began his career as analyst with Boston Consulting Group, where he consulted with Fortune 100 companies. In the mid-to-late 1990s, he helped found and support several early Internet and technology companies in Oregon. Through the sale of several small businesses, he became a multimillionaire. Despite this, he declared bankruptcy in 2002. == Criminal history == After declaring bankruptcy in 2002, Spink began smuggling cocaine and marijuana in and out of Canada for Robert Kesling, a regional drug lord. In 2005, he was apprehended when law enforcement stopped him while he was transporting nearly 375 pounds of cocaine, estimated at a value of $34 million. Because of his cooperation with investigators, he received a three- year prison sentence. After release, he was placed on parole. During the 2005 traffic stop, investigators got the first hint that Spink was practicing bestiality. They noted \"Spink was strangely protective of a female German shepherd that was with him\", with Cmdr. Steve Clopp also clarifying they \"didn't bother\" with the odd behavior due to their \"more pressing concerns,\" the most important of which was the 372 pounds of cocaine in the car. In April 2010, investigators in Tennessee contacted Spink's probation officer to inform him that Spink had become involved in the criminal proceedings against Tait, who had been convicted of trespassing in the Enumclaw horse sex case and was currently charged with bestiality. On April 14, a 19-member SWAT team raided Spink's compound for violating the parole of his 2005 arrest. While there, they arrested a man who was on the property and ultimately plead guilty to animal cruelty charges. Spink received a sentence of three years in federal prison and two years of probation under the condition that \"he shut down his websites promoting zoophilia and bestiality; and that he not possess, produce or distribute any bestiality videos or photos\". In 2013, following Spink's prison sentence, he was placed on parole with several conditions, including agreeing to regular checks of any hard drives for inappropriate pornographic material and refraining from voluntary contact with animals. Additionally, courts ordered him to \"shut down all websites owned, operated, or under his control that promote or contain zoophilia, bestiality or any sexual act with animal[s]\". Further, the hard drives that were taken during the 2010 investigation were not returned due to Spink's skill and knowledge regarding technology under the assumption that he may be able to recover deleted inappropriate files and/or encrypted data. Almost immediately, Spink returned to bestiality websites, obtained a dog, and boarded horses at a nearby farm. In 2014, he was sentenced to nine months in prison for violating parole, \"the longest sentence U.S. District Court Judge Ricardo Martinez could impose\". In a 2014 interview, Spink stated of his public crimes, \"A core precedent was set: No longer can zoophobes in this country batter and coerce people like me into silence with threats of violence.\" After his release from prison, Spink crossed the border into Canada and was arrested and jailed at least twice for entering the country and obtaining dogs, and at one point was the suspect in the disappearance of his neighbor's dog, actions disallowed by his parole. During one arrest he held a machete to his dog's throat and bit an officer's hand in a standoff with the police. == Zoophilia advocacy == Spink was outspoken about his beliefs that animals can consent to sexual activity with humans. During a 2010 court case, Spink's attorney explained, \"He believes it's a sexual orientation and that the arguments against it are the same ones once made against homosexuality or miscegenation\". Additionally, in a YouTube video, Spink discussed his 10-year romantic relationship with one of the horses on his farm. In addition to his personal actions and advocacy, Spink worked on projects against \"zoophobic bigots\" to raise legal funds for defending his fellow \"zoosexuals\". == Personal life == Spink was at one time married and had relationships with men and women. In an interview, he indicated that he had been diagnosed with Asperger syndrome. He also indicated that he was \"a lifelong (if imperfect) vegetarian\" and animal rights activist. Spink died from complications from cancer in his mother's home in Harmony on January 23, 2020. == References == == Further reading == * Category:1971 births Category:2020 deaths Category:American criminals Category:University of Chicago alumni Category:People from Washington (state) Category:Prisoners",
 "title": "Douglas Spink"
}