{
 "id": "1145804",
 "text": "David Lawrence Geffen (born February 21, 1943) is an American business magnate, record executive, film producer, and philanthropist. Known for his influence in the entertainment industry, Geffen is the founder of several major entertainment companies, including Asylum Records, Geffen Records, DGC Records, and DreamWorks SKG. He has also made substantial philanthropic contributions, particularly in the fields of health, education, and the arts. == Early Life and education == Geffen was born in Brooklyn, New York, to Jewish immigrant parents. He attended Brooklyn College, University of Texas at Austin, and Santa Monica College, though he did not complete a degree. Geffen worked in the mailroom at the William Morris Agency, where he eventually became an agent, launching his career in the entertainment industry. == Career == Geffen’s career began in the music industry, where he established himself as a talent manager and record executive. He co-founded Asylum Records in 1970, where he signed artists such as The Eagles, Joni Mitchell, and Jackson Browne. In 1980, he founded Geffen Records, signing successful artists like Aerosmith, Elton John, and Nirvana under its subsidiary label, DGC Records. In 1994, Geffen co-founded DreamWorks SKG with Steven Spielberg and Jeffrey Katzenberg, which became a major force in film, television, and animation. The studio produced films such as Saving Private Ryan, Gladiator, and the Shrek series. === Philanthropy === Geffen has donated to numerous causes in education, health, and the arts. In 2002, he gave $200 million to the David Geffen School of Medicine at UCLA, one of the largest gifts ever made to a medical school. He has also contributed to UCLA, the University of Southern California, and the Museum of Modern Art (MoMA) in New York City. His philanthropy supports scholarships, research, and medical programs. == Awards and recognition == * Inducted into the Rock and Roll Hall of Fame (2010) * Recipient of the Honorary Academy Award for contributions to the film industry * Grammy Trustees Award * Recognized by Forbes as one of the wealthiest individuals in entertainment == Personal life == Geffen is known for his private lifestyle and high-profile real estate investments. He is one of the most prominent openly gay business figures in the United States, coming out publicly in 1992. Geffen currently resides between homes in California, New York, and other locations. == Legacy == David Geffen’s impact on the entertainment industry and philanthropy is significant, with major contributions to music, film, and the arts. His business ventures have shaped modern entertainment, while his philanthropic support has extended to important initiatives in medicine and education. == Related pages == * Geffen Records * DreamWorks SKG * David Geffen School of Medicine at UCLA == References == == Other websites == * David Geffen Profile on Forbes * Rock and Roll Hall of Fame - David Geffen * David Geffen School of Medicine at UCLA Official Website Category:1943 births Category:Living people Category:American record producers Category:Movie producers from New York City Category:Businesspeople from New York City Category:American chief executives Category:LGBT people from New York City Category:LGBT producers Category:LGBT businesspeople Category:Gay Jews Category:Philanthropists from New York (state)",
 "title": "David Geffen"
}