{
 "id": "1145205",
 "text": "Henry VI (1414-1490) known as the Noble was a German nobleman and the second and final Count of Fürstenburg-Wolfach between 1419 and 1490 for over 70 years, thus making him one of the Longest-Reigning Monarchs in German history. ==Reign== He was the son of Count Conrad II von Fürstenberg and Countess Adelaide von Zweibrücken. The young Count was born as the son of Count Conrad II and Countess Adelaide in 1414 and succeeded his father in 1419 at the age of about 5. Though due to his young age he had to be placed under a regency until 1432 when he assumed full power. In February 1483, a large knight's tournament was held in Offenburg. Count Henry VI also accepted the invitation and went there with 30 horses. He was one of the most popular rulers from the House of Fürstenberg, who ruled in the Kinzig Valley. While Adelaide stayed at Wolfach, Henry VI (until 1432 under regency of his uncles of Fürstenberg) moved his capital to Hausach. After Adelaide's death in 1452 her seat at Wolfach also reverted to Henry. In 1453 he began to completely renovate his Hausach residence, the castle. His scribe Michael Spieser left behind precise records of the progress and extent of the construction work. The castle tower was completed in 1477. In 1478 the Count sponsored the construction of the Barfüßerkloster, which grew out of the foundations next to the long-standing St. Sixt Chapel. The count never married though he did have up to 80 illegitimate children. After a serious illness, Count Henry VI died on St. Andrew's Night on November 30, 1490 in Wolfach. He found his final resting place there, although there are no more references to his grave in the local church. According to his last will, \"even though he died illegitimately,\" he left his sons Christoffel, Hans and Heinrich and their mother Margretten Kueffer, his \"dear, faithful servant,\" ample property for their livelihood. With Henry VI, the Wolfach line of the Fürstenbergs died out. ==References== Category:1414 births Category:1490 deaths Category:German nobility",
 "title": "Henry VI of Fürstenburg-Wolfach"
}