{
 "id": "1145516",
 "text": "The Panama rocket frog (Colostethus panamansis) is a frog. It lives in Colombia and Panama. ==Body== The adult male frog is 18.8 - 27.1 mm long from nose to rear end and the female frog is 24.9 - 29.3 mm long. Adult male frogs have a white or white and gray throat. Frogs of other species have black throats. This is how scientists tell them apart. The skin of the frog's back is a mix of light brown and dark brown colors. The adult female frog has a brown and gray throat. The adult male frog has a light colored belly, but female frogs have different bellies from each other. There is a dark brown stripe over the eye down the body. The eardrum is dark brown. There is a white stripe in the middle of the dark brown stripe. There is yellow-gold color on part of each back leg. There is some yellow color where the front legs meet the body and on the bottoms of the back legs. ==Home== This frog is awake during the day. It lives next to streams in forests. It lives on rocky land next to streams. Scientists mostly saw the frog up to 800 meters above sea level, but they did see some about 900 meters above sea level in Colombia. Many of the places this frog lives are protected parks, for example Parque Nacional Natural Los Katios. ==Young== Male frogs fight other male frogs for good places to call to females. Female frogs fight other female frogs for good place to lay eggs. They will also fight C. pratti. The female frog lays eggs on the dead leaves on the ground. The eggs are dark brown in color and about 1.6 mm across. After the eggs hatch, the female frog carries the tadpoles to streams where they swim and grow. People saw one female frog with 40 tadpoles on her back at the same time. Scientists think she takes all the tadpoles in one trip. It can take her nine days to get to the stream. Scientists do not know what the tadpoles eat before they go to the stream. They have bags on their bodies with some stored food, but they are small. One person said he saw a male C. panamansis carrying tadpoles, but other scientists think he was wrong. Everyone else only ever saw female frogs carry tadpoles. C. panamansis, C. pratti, and C. imbricolus are the only frogs in Colostethus in which the mother frog carries the tadpoles. For the rest, the male frog carries them. In the stream, the tadpoles eat dead things in the water. They become small frogs after 4-6 months. ==Poison== This frog's poison is tetrodotoxin. It is in the frog's skin. Tetrodotoxin works by stopping sodium channels. ==Danger== Scientists say this frog is not in danger of dying out. But they do think the fungal disease chytridiomycosis is some danger. Also, people cut down trees to make farms, grow plants against the law, build towns, and get wood to build with. ==First paper== * ==References== Category:Frogs of South America Category:Poison dart frogs",
 "title": "Colostethus panamansis"
}