{
 "id": "1145769",
 "text": "Luigi Bertolini (; 13 September 1904 – 11 February 1977) was an Italian footballer who played as a midfielder. Considered as one of the greatest Italian midfielders of all time. His teammate Felice Borel said of him: \"He was idolized by the English: he was the English footballer, strong, decisive, generous\". Skilled above all in the header, he rose to prominence as a prolific center forward, and it was to fill this role that Alessandria hired him from Savona; observing him, the coach of the grays Carlo Carcano thought instead of using his peculiarity in the defensive phase and therefore deployed him in the midfield, on the left, a role in which he achieved fame. He was recognizable because, to protect himself from the blows of the ball, he wore a white handkerchief on his forehead. He is renowned for his exceptional skills as a half-back. Carlo Felice Chiesa describes him as a \"formidable midfielder, with the typical bandage on his forehead, with which he seemed to magnetize the balls, so easy and peremptory was the header\", and recalls his \"great cleanliness in closing interventions\" and his ability \"in the relaunch phase\". Carlo Moriondo remembers him as \"long, lanky, with a white handkerchief around his curly hair, unbeatable in headshots, with an exceptional compass of legs that allowed him to guarantee enormous spaces; a compendium of will and technique, strong on the physical structure\". ==Club career== Luigi Bertolini began his career in the 1920s as an attacker for the Borsalino team, at that time he still worked full-time as a steelworker in Borsalino. During this time, he was discovered by US Alessandria, a club that had a very good team but was not particularly wealthy. Therefore, in order to be able to oblige him, they promised to get him a good job, but this was not kept. At Alessandria, where Bertolini played from 1927 to 1931, he was retrained as a midfielder under coach Carlo Carcano. On 1 December 1929, he made his debut for the Italian national team against Portugal, Bertolini played a total of 26 times for Italy. At the end of the 1930–31 season, Luigi Bertolini was signed by Juventus, where he would play for six years. He played a total of 135 games for Juve, scoring five goals. He was part of the legendary Quinquennio d'Oro team that won five consecutive Italian championships between 1931 and 1935 under coach Carlo Carcano, a record that has not yet been broken. In 1937, Luigi Bertolini ended his professional career at the age of 33 and worked as a player-coach at the lower division AC Rapallo until 1940. ==International career== With the Italy national football team, Bertolini made his debut in 1929, and was a member of the teams that won the 1927-30 Central European International Cup and was runner-up at the 1931-32 Central European International Cup & winner at the 1933–35 Central European International Cup but most notably he was also a member of the team that won the 1934 FIFA World Cup. Alongside Luisito Monti and Attilio Ferraris, Luigi Bertolini made up the legendary Italian midfield established at the 1934 World Cup. In that tournament he started every game and was only rested by Pozzo in the first quarter-final encounter against Spain. Bertolini is very recognisable in the photos of the 1934 Italian World Cup-winning team by virtue of his big white bandana which he used to protect his head from the seams of the ball when attempting headers. He was also one of the 'Lions of Highbury' in the narrow loss to England in November 1934 known as the Battle of Highbury. As the story goes, during the second half he was disoriented from fatigue and with the English constantly in attack, he kept calling out for Luisito not realising that Monti was not on the field (due to a broken bone) and the midline was just himself and Ferraris. ==Coaching career== Following his retirement, Bertolini began his coaching career with Tigullia in 1938. ==Honours== ===Club=== ;Juventus *Serie A: 1931–32, 1932–33, 1933–34, 1934–35 ;Tigullia *Prima Divisione: 1937–38 ===International=== ;Italy *FIFA World Cup: 1934 *Central European International Cup: 1927–30; 1933–35; Runner-up: 1931–32 ==References== * La Gazzetta dello Sport Category:1904 births Category:1977 deaths Category:Footballers from Liguria Category:Italian football managers Category:Association football midfielders Category:Serie A players Category:Juventus FC players",
 "title": "Luigi Bertolini"
}