{
 "id": "1145916",
 "text": "The Canadian Elite Basketball League (CEBL) is a Canadian basketball league that started in 2017. As of the current season, 10 teams play in the league. The commissioner of the league (the person in charge) is Mike Morreale. == History == The CEBL was formed on October 25, 2017 by Richard Petko and Mike Morreale. The first five teams were announced later. They were the Edmonton Stingers in Edmonton, Alberta, the Guelph Nighthawks in Guelph, Ontario, the Hamilton Honey Badgers in Hamilton, Ontario, the Saskatchewan Rattlers in Saskatoon, Saskatchewan, and the Fraser Valley Bandits in Abbotsford, British Columbia. The league plays under FIBA rules and adopted these after signing an agreement to become the first division professional league for Canada Basketball. The CEBL regular season starts in May and ends in August, with each team playing 20 games. The playoffs are in a final four and are made up of the top six teams in the regular season. Beginning in 2022, the CEBL adopted Elam Ending rules which means that a team has to score a certain set score to win. == Teams == === Current === Conference Team City Venue Capacity Founded First season Head coach Eastern Conference Brampton Honey Badgers Brampton, Ontario CAA Centre 5,000 2018 2023 Sheldon Cassimy Montreal Alliance Montreal, Quebec Verdun Auditorium 4,114 2021 2022 Derrick Alston Niagara River Lions St. Catharines, Ontario Meridian Centre 4,030 2015 2019 Victor Raso Ottawa BlackJacks Ottawa, Ontario TD Place Arena 9,500 2019 2020 James Derouin Scarborough Shooting Stars Scarborough, Ontario (Toronto) Toronto Pan Am Sports Centre 2,000 2021 2022 Devan Blair Western Conference Calgary Surge Calgary, Alberta Winsport Arena 2,900 2018 2023 Tyrell Vernon Edmonton Stingers Edmonton, Alberta Edmonton Expo Centre 4,857 2018 2019 Jordan Baker Saskatchewan Rattlers Saskatoon, Saskatchewan SaskTel Centre (lower bowl) 5,898 2018 2019 Tanner Massey Vancouver Bandits Langley, British Columbia Langley Events Centre 5,276 2017 2019 Kyle Julius Winnipeg Sea Bears Winnipeg, Manitoba Canada Life Centre 15,321 2022 2023 Mike Taylor ; Notes # A star (*) denotes a franchise move. See the respective team articles for more information. ===Former teams=== Team City Last Arena Founded Dissolved Guelph Nighthawks Guelph, Ontario Sleeman Centre 2018 2022 Newfoundland Growlers St. John's, Newfoundland and Labrador Field House at Memorial University 2021 2022 Hamilton Honey Badgers Hamilton, Ontario CAA Centre 2018 2022 == CEBL Champions == Season Champions Runner-up 2019 Saskatchewan Rattlers Hamilton Honey Badgers 2020 Edmonton Stingers Fraser Valley Bandits 2021 Edmonton Stingers Niagara River Lions 2022 Hamilton Honey Badgers Scarborough Shooting Stars 2023 Scarborough Shooting Stars Calgary Surge 2024 Niagara River Lions Vancouver Bandits == References == ==Other websites== * Category:2010s establishments in Canada Category:2017 establishments in North America Category:Basketball leagues Category:Sport in Canada",
 "title": "Canadian Elite Basketball League"
}