{
 "id": "1145134",
 "text": "Magdalena Christina von Manderscheid-Blankenheim (15 March 1658-19 October 1715) was a German noblewoman and the Countess of Sayn-Wittgenstein-Hachenburg between 1661 and 1715. She was co-ruled with her brother Maximilian Joseph Ferdinand until 1675 and then as sole ruler.Vera Torunsky (Bearb.): Die Manderscheider. Eine Eifeler Adelsfamilie. Herrschaft, Wirtschaft, Kultur. Rheinland-Verlag, Pulheim 1990, ISBN 3-7927-1152-4. ==Life/Reign== She was born in 1658 as the fifth child of Countess Ernestine Salentine. She succeeded upon her death in 1661 alongside her brother. Her brother later died in 1675 without any heirs hence why she ruled as sole monarch afterwards. Ernestina Salentina Gräfin zu Sayn u. Wittgenstein in: Genealogy Database by Herbert Stoyan [retrieved 29 October 2024].Matthias Dahlhoff: Geschichte der Grafschaft Sayn., Dillenburg 1874. ==Issue== As his second wife, on 7 September 1673 she married to George Louis, Burgrave of Kirchberg (1626-1686) who was 32 years her senior. They had the following children from their Marriage: * George Louis Ernest (1675 – 1676) * Ernest Augustus Louis († 1695) * Johannetta Friederika * Wilhelmina Louisa * Elizabeth Dorothea * Christina Magdalena (probably named after her mother) * George Frederick (1683 – 1749), Burgrave of Kirchberg and Hachenburg, married to Sophia Isabel de Limburg and on 9 May 1708 to Countess Sophia Amalia von Nassau-Saarbrücken (1688 – 1753), daughter of Count Frederick Louis of Nassau-Otweiler (1651 – 1728); He succeeded his Mother as Monarch following her death in 1715. * Wilhelmina Christina * John Albert (1685 – 1691) * Ernestina Carolina (1687 – 1776); born posthumously after her father had died the previous year She later died in 1715 at the age of 57 and was the mother of 10 children. ==References== Category:1658 births Category:1715 deaths Category:German nobility",
 "title": "Magdalena Christina of Manderscheid-Blankenheim, Countess of Sayn-\nWittgenstein-Hachenburg"
}