{
 "id": "1145499",
 "text": "The Kanhoji–Portuguese conflicts is a series of Millitary engagements between Kanhoji Angre of Bhonsle Empire and Portuguese India. The Naval battles were fought in Konkan Modern day Maharashtra. Portuguese was a stable power in Indian State of Goa who had already fought with Maratha rulers like Shivaji and his son Sambhaji who nearly captured Goa in the Maratha–Portuguese war of 1683 but due to Mughal Invasion there was peace between the two, Portugese showed Neutrality in the initial phase of Deccan wars until they sided with Mughals in 1699 and fought with the Marathas but Kanhoji Angre defeated them this was the first Naval conflict between Kanhoji and Portuguese. The conflict started in the regin of Portuguese Governer,Pedro António de Meneses Noronha de Albuquerque and ended in the regin of João de Saldanha da Gama with the death of Kanhoji Angre in 1729. ==Background== ===Kanhoji Angre=== Kanhoji was born in 1677 his father was Admiral of Maratha Navy under Shivaji the first Maratha King. He was first engaged in a Millitary conflict in 1689 where under guidance of his father he defeated Siddis of Janjira . He later became the Admiral and frequently Raided and fought Naval battles with powers like Siddis, Portuguese and British. He is called as Most Daring Pirate by some historians while a Portuguese Letter compares him to Hayreddin Barbarossa. ===Portuguese India=== Portuguese first arrived in india and captured Goa making it their permanent base in November 25, 1510. It was a prominent European Power in India defeated by only few Empires. It fought various enemies like Marathas, French, East India Companyetc it remained independent till it's annexation by India on 19 December 1961. ==Conflicts== Kanhoji first fought with Portugese in the Capture of Sagargadand defeated the combined army of Portuguese Siddis and Mughals. Later he performed daring Raids in the Portuguese territory. In 1703 the Portuguese Governer send a friendly Letter to Kanhoji to return their Ship which was captured by him at Cheul. In 1710 Antonio Cardin started harassing the Angrian Village in Cheul Breaking the peace treaty between them which lasted till 1708 while according to some historians 1703. In 1710 i.e the same year a pal belonging to Portuguese Governer was captured by Kanhoji. In 1712 Kanhoji attacked Marchent ship of Portugueseand captured them. In 1713 Kanhoji Angre met with a Portugese fleet he attacked them but was compelled to retreat . In the same year Kanhoji again attacked Portugese fleet at Cheul but the result was indecsive. Due to these two victories Portugese though it was easy to defeat Angre so they started Operation Monsoon even succeeded in getting the Siddi's support the combined army attacked Koloba as Portugese got the news of Arab sailors so after 3 months of the siege Portugese were compelled to Retreat. In between 1720 after East India Company was defeated at Khanderi they made an alliance with Portugese and Siddis and attacked Vijaydurg but they were defeated and pursued by Angrian troops. In 1722 Portuguese attempted to capture fort of Kolaba under the command of Thomas Mathews but was were defeated. by Kanhoji Angre supported by Pilaji Jadhav, Shahu I and Bajirao I peace was soon made. Between this in 1721 Angrian troops attacked ex governer mention in letter as follows: == List of Conflicts == Name of Conflict(time) Outcome Capture of Sagargad(1699) Maratha Victory *Combined Portugese Mughal Siddi forces defeated Battle of Koloba (1701) Maratha Victory Capture of Merchant Ships (1703) Maratha victory Attack on Cheul 1710 Maratha Victory * Cheul captured Attack on Portugese Ships (1713) Portuguese Victory Second attack on Portugese Ship (1713) Indecisive Operation Monsoon (1713-14) Maratha victory *Combined Portugese Siddi Army defeated Battle of Koloba (1714) Maratha victory *Combined Portugese Siddi Mughal army defeated Battle of Vijaydurg (1720) Maratha Victory *Combined Portugese Siddi EIC army defeated Attack on Portugese ship(1721) Maratha victory *Execution of the ex-governor and 22 prisoner viva beheading Battle of Koloba (1722) Maratha Victory * Peace Treaty with Portugese == References == Category:Pages created with the Article Wizard from 2024 Category:India",
 "title": "Kanhoji–Portuguese Conflicts"
}