{
 "id": "1145302",
 "text": "Moana 2, also known as Vaiana 2, or Oceania 2 in some markets, is an American animated musical adventure movie produced by the Walt Disney Animation Studios for the Walt Disney Pictures. ==Production== The sequel to Moana (2016), the movie was directed by David Derrick Jr., Jason Hand and Dana Ledoux Miller (in their feature directorial debuts) and produced by Christina Chen and Yvett Merino, from a screenplay by Jared Bush and Miller. The movie stars Auliʻi Cravalho, Dwayne Johnson, Temuera Morrison, Nicole Scherzinger, Rachel House, and Alan Tudyk, all reprising their roles from the first movie, with Khaleesi Lambert-Tsuda, Rose Matafeo, David Fane, Hualālai Chung, Awhimai Fraser and Gerald Ramsey joining the cast. ===Timeline=== Development on a follow-up to Moana originally began as a long-form limited streaming series for Disney+, before it was reworked into a theatres sequel by February 2024, with Derrick confirmed as both writer and director. The involvement of Hand, Miller, Chen, and Merino was confirmed in May. A month later, Bush was confirmed to be returning as a writer. Miller later replaced Derrick as a co-writer in August. Mark Mancina and Opetaia Foa'i, the composers and co-songwriters of the first movie, returned to score and write the songs, while Abigail Barlow and Emily Bear replace Lin-Manuel Miranda as additional songwriters. ==Release== Moana 2 is scheduled to be released by Walt Disney Studios Motion Pictures in the United States on November 27, 2024. It will be Walt Disney Animation Studios's third CGI sequel. Moana 2 will be the first Disney animated movie to be released after Disney's 100th anniversary. ==Plot== Three years after the events of the first movie, Moana receives an unexpected call from her wayfinding ancestors and forms her own crew, reuniting with her friend, the demigod Maui. As they journey to the far seas of Oceania to break the god Nalo's curse on the hidden island of Motufetu, which once connected the people of the ocean, they confront old and new foes, including the Kakamora and underworld goddess Matangi. ==Cast== * Auliʻi Cravalho as Moana, the curious daughter of village chief Tui and his wife Sina, who is chosen by the ocean to break the curse on the island of Motufetu. ** Cravalho will reprise her role in the film's Hawaiian-language dubbing. * Dwayne Johnson as Maui, a strong- willed shapeshifting demigod who accompanies Moana on her journey. * Temuera Morrison as Tui, Moana's father and chief of Motunui Island. ** Morrison will reprise his role in the film's Māori-language dubbing. * Nicole Scherzinger as Sina, Moana's mother and Chieftess of Motunui. * Khaleesi Lambert-Tsuda as Simea, Moana's little sister. * Rose Matafeo as Loto, a \"brainy but quirky\" member of Moana's wayfinding crew. * David Fane as Kele, a \"grumpy farmer\" and member of Moana's wayfinding crew. * Hualālai Chung as Moni, a member of Moana's wayfinding crew and a fan of Maui's. * Rachel House as Tala, Tui's late mother and Moana's paternal grandmother, who returns as a manta ray spirit. ** House will reprise her role in the film's Māori-language dubbing. * Awhimai Fraser as Matangi, a mysterious threat to Moana and Maui. ** Fraser will reprise her role in the film's Māori-language dubbing. * Gerald Ramsey as Tautai Vasa, Moana's ancestor. * Alan Tudyk as Heihei, Moana's pet rooster. ==Notes== ==References== == Other websites == Category:2020s computer-animated movies Category:2020s English-language movies Category:2024 movies Category:2024 animated movies Category:2020s sequel movies Category:2024 comedy movies Category:2020s fantasy movies Category:2024 musical movies Category:2024 adventure movies Category:2020s buddy movies Category:Adventure comedy movies Category:American adventure movies Category:Feminist movies Category:Disney animated movies Category:American teen comedy movies Category:American sequel movies Category:American fantasy-comedy movies Category:American musical fantasy movies Category:American musical comedy movies Category:American family comedy movies Category:American buddy comedy movies Category:American children's adventure movies Category:Movies about birds Category:Movies about pigs Category:2020s 3D movies Category:American coming-of-age movies Category:Coming-of-age comedy movies Category:Movies set in Oceania Category:Movies about demons Category:Movies set on islands",
 "title": "Moana 2"
}