{
 "id": "1145928",
 "text": "The Grand and General Council () is the unicameral legislative body of the Republic of San Marino. It is one of the oldest parliamentary bodies in the world, dating back to its establishment in 1243. The Council consists of 60 members who are elected by the citizens of San Marino every five years through proportional representation. == Composition and structure == The Grand and General Council is made up of 60 members elected through proportional representation. Members are elected for a five-year term, with the aim of representing the interests of the citizens in the governance of the republic. The council is responsible for enacting laws, approving the budget, and overseeing the administration of the government. The Council operates under a multi-party system, with members from various political factions representing the diverse interests of San Marino’s population. == Leadership == The Grand and General Council is presided over by two Captains Regent (Capitani Reggenti), who are appointed as the heads of state and serve a six-month term. The Captains Regent are responsible for ensuring that the council functions smoothly and that the legislative process is upheld in accordance with San Marino’s constitutional principles. The current Captains Regent are Filippo Tamagnini and Gaetano Troina, who assumed office on April 1, 2023. == Responsibilities and functions == * Enacting laws and legislative measures. * Approving the national budget and overseeing financial expenditures. * Establishing and supervising governmental agencies. * Representing San Marino in international and regional affairs. * Ensuring that the rights and liberties of San Marino’s citizens are upheld. == Election system == Members of the Grand and General Council are elected through a system of proportional representation, which ensures fair representation for multiple political parties. Elections are held every five years, with citizens voting for representatives who align with their political preferences. This proportional representation system allows for a multi-party system within the Council, fostering a diversity of perspectives in the legislative process. == Historical background == The origins of the Grand and General Council date back to the early 13th century, with its establishment traditionally traced to 1243. As one of the oldest legislative bodies in the world, the Council has played a central role in preserving San Marino’s independence and democratic values. Over the centuries, the council has evolved to adapt to the changing political landscape while maintaining its commitment to democratic governance and the sovereignty of San Marino. == Location == The Grand and General Council meets at the Palazzo Pubblico, the historic town hall located in the City of San Marino. The Palazzo Pubblico is a symbol of the republic’s independence and houses various government offices, including the meeting chambers of the council. == Related pages == * Politics of San Marino * Captains Regent == References == Category:Politics of San Marino Category:National legislatures Category:Unicameral legislatures",
 "title": "Grand and General Council"
}