{
 "id": "1145552",
 "text": "The 1923 Belgium–France women's athletics match was an international women's athletics competition where a national team of female French athletes competed against a national team of Belgium. It took place at Duden Park in Brussels, Belgium on 29 July 1923. It was the third annual women's match between Belgium and France. The match was won by Belgium with 52 points versus France with 44 points. During the meeting also some other national events were contested. ==Competition format== The competition consisted of 7 individual events and a relay event. The overall classification is a nation's classification. The winner of each event received 5 points, the number two received 3 points, followed by 2 points and 1 point. The winner of the relay received sixpoints, with the number two receiving three points. For the overall classication, all points scored by the athlete from each country are added together. ==Entrants== The members of the teams were published on 27 and 29 July 1923. Names and events in italics or ~~striked~~ are differenced between the entry and athletes competing in the events. Belgium Name Event Flore Bertels 80 metres Claessens Javelin throw Ida Degrande 1000 metres Antoinette Gallemaers 250 metres 4 x 200 metres relay Louise Gits 250 metres 4 x 200 metres relay Yvonne Ibis Shot put Henriette Van Daelen 83 metres hurdles Van Mechelen High jump Walburga Van Steenlandt 1000 metres Elise van Truyen 80 metres ~~250 metres~~ High jump Long jump 4 x 200 metres relay Georgette Vandyck Javelin throw Sidonie Verschueren 83 metres hurdles Long jump Shot put 4 x 200 metres relay France Name Event Marguerite Chansardon 83 metres hurdles (R. Long jump) Simonne Chapoteau Long jump Shot put 4 x 200 metres relay (R. High jump) 83 metres hurdles ~~~~~~4 x 200 metres relay~~ (R. 80 metres) (R. 250 metres) (R. 83 metres hurdles) 250 metres 4 x 200 metres relay (R. 80 metres) (R. 83 metres hurdles) ~~Dupont~~ ~~1000 metres~~ Georgette Gagneux 80 metres (R. High jump) Yvonne Gancel Javelin throw Georgette Guellier High jump Hachard 80 metres 250 metres 4 x 200 metres relay Georgette Lenoir 1000 metres High jump 4 x 200 metres relay Marcelle Neveu 1000 metres ~~Pattoillet~~ ~~High jump~~ (R. Long jump) Paulette Puisais Shot put Javelin throw Suzanne Réveillé Long jump Reserves Reserves Madeleine Braquemond ~~(R. 1000 metres)~~ (R. 83 metres hurdles) ==Competition== ===80 metres=== Place Athlete Time Points Note 1 11 sec 5 2 +1 m 3 3 2 4 1 ===250 metres=== Place Athlete Time Points Note 1 37.4 sec 5 2 +0.2 m 3 3 2 4 1 ===1000 metres=== Place Athlete Time Points Note 1 3:17.4 5 2 +20 m 3 3 2 4 1 ===4 x 200 metres relay=== Place Athlete Time Points Note 1 Elise Van Truyen Antoinette Gallemaers Louise Gits Sidonie Verschueren 1:56.4 6 2 Hachard Germaine Darreau Simonne Chapoteau Georgette Lenoir +5 m 3 ===Shot put=== Place Athlete Distance Score 1 Score 2 Total Note 1 16.24 m 5 2 8.77 m 7.175 m 15.945 m 3 3 15.62 m 2 4 7.53 m 6.80 m 14.33 m 1 ===Javelin throw=== Place Athlete Distance Score 1 Score 2 Total Note 1 26.94 m 13.67 m 40.61 m 5 NR 2 36.09 m 3 NR 3 17.94 m 14.62 m 32.56 m 2 3 15.62 m 1 ===High jump=== Place Athlete Total Height Note 1 1.38 5 2 1.37 m 3 3 1.30 m 2 4 1.25 m 1 ===Long jump=== Place Athlete Total Height Note 1 5.01 5 NR 2 4.75 m 3 3 4.62 m 2 4 4.25 m 1 ===83 metres hurdles=== Place Athlete Distance Points Note 1 14.2 sec 5 2 +0.7 m 3 3 2 4 1 ==Overall classification== Rank Athlete Points 1 52 2 44 ==National events == ===800 metres handicap=== Place Athlete Club Time Note 1 Evrard Brussels Femina Club 2:34.2 2 Jeanne van Kesteren Olympic Fémina Club +5 m 3 Van Putten Union Athletique Innovation 4 Mayaert Fr. R.R. 5 Lucienne Renaux Olympic Fémina Club 6 Desmedt Brussels Femina Club ===4 x 200 metres relay (2nd category)=== Place Athlete Time Note 1 Brussels Femina Club Callebaut Desmedt Evrard Denis 2:05 2 Olympic Fémina Club Andry Cools Coruil Lucienne Renaux +12 m 3 Sports et Gymnastique de Forest 4 Union Athletique Innovation ===80 metres=== Semi-final 1 Place Athlete Club Note 1 Lisette Pétré Brussels Femina Club 2 Denis Brussels Femina Club 3 Lois Brussels Femina Club 4 Van Heymbeek Brussels Femina Club Semi-final 2 Place Athlete Club Time Note 1 Geminckx Olympic Fémina Club 2 Silem Brussels Femina Club 3 Pinnel Brussels Femina Club 4 Vain Forest Final Place Athlete Club Time Note 1 Geminckx Olympic Fémina Club 10.7 sec 2 Lisette Pétré Brussels Femina Club +1 m 3 Silem Brussels Femina Club +0.5 m 4 Denis Brussels Femina Club 4 Lotz Brussels Femina Club 4 Pinnel Brussels Femina Club ==References== Category:1923 in women's athletics Category:Sport in Belgium Category:1920s in France Category:1920s in Belgium Category:Brussels Category:1923 in Europe",
 "title": "1923 Belgium–France women's athletics match"
}