{
 "id": "1145688",
 "text": "Nazmun Munira Nancy is a Bangladeshi singer. She won National Film Award For Best Female Playback Singer for her playback in the film Projapoti (2011). She received Meril Prothom Alo Awards for Best Female Singer Award for six times. == Career == Nancy start her career in 2002. She has sung several jingles for television. She became an enlisted artist at Bangladesh Betar in 2002 as a Nazrul, modern and folk singer. She released her first album Bhalobasha Odhora in 2009. == Discography == * Bhalobasha Odhora (2009) * Rong (2012) * Dushtu Chhele (2015) * Amar Priyotomo (2016) * Bhalobashbo Bolei (2016) == Personal life == In 2006, Nancy married a businessman named Abu Syed Sourob and has a three-year-old daughter, Rodela. On 4 March 2013, Nancy married Nazimuzzaman Zayed, for the second time. On 8 January 2014, Nancy gave birth to a daughter, Nyla. . Her father, Niamul Haque, died on 10 August 2020 at the age of 65. Nancy married lyricist Mohsin Mehedi, the chief operating officer (COO) of Yoga Anupam Music, in 2021 after courtship due to the song. On 13 January 2022, Nancy announced her pregnancy with her third child, Mehenaz. On 26 August 2024, in an interview on Bangla Vision, Nancy revealed how she has suffered politically, how it hampered her career, personal life and social status. == Awards and nominations == Year Award Title Category Film/Song Result 2009 Meril Prothom Alo Awards Best Female Playback Singer Third Person Singular Number (Dwidha) won 2010 Meril Prothom Alo Awards Best Female Playback Singer Shishir Bheja won 2011 National Film Awards Best Female Playback Singer Projapoti won Meril Prothom Alo Awards Best Female Playback Singer Pagol Tor Jonno Re won 2012 Meril Prothom Alo Awards Best Female Playback Singer Bhalobasi Tomay won 2013 Meril Prothom Alo Awards Best Female Playback Singer Akash Hote Chai won 2013 Bioscope Borsho-sera Best Singer (Female) Jole Jole Jonaki... won 2014 Meril Prothom Alo Awards Best Female Playback Singer - won 2015 Meril Prothom Alo Awards Best Female Playback Singer - won 2014 CJFB Performance Award 2014 Best Singer (Female) == References == == Other websites == * Category:Living people Category:Year of birth missing (living people) Category:Bangladeshi singers",
 "title": "Nazmun Munira Nancy"
}