{
 "id": "1146414",
 "text": "The Quito rocket frog or waterfall rocket frog (Colostethus jacobuspetersi) is a frog. It lives in Ecuador. ==Body== The adult male frog is 19.3–25.1 mm long from nose to rear end and the adult female frog is 22.3–29.5 mm long. The skin of the frog's back is light brown with some green color and dark red-brown marks. There is a white line down each side of the body and another white line on the top of the mouth. The belly is pinkish orange in color with white spots or a pattern. The throat and chest are light orange with white marks. The bottoms of the legs and feet are light pink. The male frog's male organs are white. ==Name== Scientists named this frog for amphibian scientist and explorer James Peters, of the Smithsonian Museum. ==Home== This frog is awake during the day. It lives in forests high in hills and mountains and in open places that people have made. People have seen them next to canals and other water places that human beings have made. Scientists saw the frog between 1500 and 3800 meters above sea level. Scientists are sure they saw the frog in 1990 in Cashca Totoras Protective Forest. They think the frog lives or used to live in some of these protected parks: Reserva Ecológica Los Illinizas, Reserva Geobotánica Pululahua, and Reserva de Producción Faunística Chimborazo. ==Young== The female frog lays eggs on the ground. After the eggs hatch, the male frog carries the tadpoles to streams, where they swim and grow. Scientists saw one male frog with four tadpoles on his back at the same time. ==Danger== Scientists are sure they saw the frog in 1990 in Cashca Totoras Protective Forest. In 2019, some scientists heard the frog singing and saw tadpoles and young frogs. Scientists say this frog is in very big danger of dying out. Humans cut down the forests to make farms and to make places for people to live. There is no forest at all where the frog used to live. The fungal disease chytridiomycosis may also have killed many frogs, but scientists are not sure. In 2015, the volcano Volcan Cotopaxi started throwing fire and hot rocks again. This could kill the frog too. ==References== Category:Frogs of South America Category:Poison dart frogs",
 "title": "Colostethus jacobuspetersi"
}