{
 "id": "1146917",
 "text": "Nonna Bannister (), was a American writer of Jewish origins from Eurasia who survived the Holocaust in Ukraine with her mother at age 9, when she began writing her diary. She was a famed Holocaust survivor. During her time in the labor camp, she wrote papers documenting various kinds of atrocities. When she immigrated from Germany to the U.S. in 1950, she had her papers published as a memoir in 2009. == Biography == Nonna Bannister was born on . Yevgeny died during the outbreak of war, and brother Anatoly was never seen again after arriving in Riga, to avoid being drafted into the war. In 1942, Bannister and her mother Anna Ljachsova had little choice but to volunteer on a Ostarbeiter transport that left for work in Germany. By 1943, Bannister worked in a prison hospital treating war prisoners. During this time, Bannister began writing papers of her experiences in the labor camp, which she kept hidden in a ticking pillow cloth strapped to her back, during WWII. Meanwhile, in search for his family, brother Anatoly had returned back home to Santurinowka and died under aerial bombardment of the village. Bannister believed her mother perished in Flossenbürg village. Actually, she did survive, but the two never met again. Some of her family members back home survived the war. After Bannister boarded a ship, and arrived in the United States, she attended university. During her time in the university, she met her husband H.Bannister. They later had three children together. Nonna spent time translating her papers, and editing them for publication, and she died in Jackson, Tennessee, on from hallucinations. Some of her family relatives had her memoir published as a book, Secret Holocaust Diaries: The Untold Story of Nonna Bannister in April of 2009. It was published by Tyndale House. The publication helped Bannister's children connect with her surviving family relatives and their descendants in eastern Ukraine. Category:1927 births Category:2004 deaths Category:American writers Category:Holocaust survivors",
 "title": "Nonna Bannister"
}