{
 "id": "1146405",
 "text": "Google Wallet (or sometimes called Wallet) is a digital wallet platform made by Google, it works on Android, Wear OS and Fitbit OS. It was announced in May 2022 by Google I/O Keynote and released on July 18, 2022. ==History== Google Wallet is a brand name used in first name of company mobile payment In 2011 Google Wallet launched and there only worked in United States. In 2016 Android Pay started in Google I/O 2015 Keynote in 2018 Google Pay was replaced by Android Pay, there is two new countries, India and Singapore. On June 4, 2024 Google Pay no longer worked in the United States, two countries India and Singapore are still working. ==Features== Google Wallet allows users to store items in payment card via Google Pay such as loyalty cards, digital keys, digital identification cards, transit passes, tickets, and health passes Google Wallet has a new features that kids to tap to pay in-store and use with Google Family Link app, which limits screen time for child safety. Digital car keys in the Google Wallet can work even screen is off or the battery is dead. ==Financial services== ===Google Pay=== Google Pay is a service within Google Wallet that allows users to select banks and card networks, currently works in all the same countries Wallet works in 85 countries. ===QR Payment=== QR Payment allows users to pay using QR Code in Brazil for devices without NFC. The services was works in VISA, Mastercard and Elo network also as within Pix. == Availability == === Supported countries === , Google Wallet is available in 97 countries worldwide for both Android & Wear OS. ==== Countries that used for payment and storing passes ==== * * *^ * * * * * * * * *^ * * * * * * * * * * * * * * * * * * * * * * * * * * *^ * * * *^ * * *^ * * * * ** * * * * * * * * * * * * * * * * * * * *^ * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * (includes )^ * (includes , , , and ) * *^ * *^ * * ==== Countries that used for storing passes only ==== * * * * * * * * * * *^ * * * * * * * * * = Not available for Fitbit OS ** = Google Pay functionality available through Google Pay app ^ = Google Wallet website unavailable ==== Upcoming ==== * * * * * ==== Region locking ==== Google Wallet prohibits FeliCa-based payment, transit, and loyalty functionality (e.g. Suica, PASMO, WAON, etc.) from being accessed on non-Japanese devices by restricting the initialization of the required third-party Osaifu-Keitai middleware apps on both Android & Wear OS. However, users have discovered ways to enable the functionality on non-Japanese models of Pixels via rooting. This behavior is in contrast to other wallets such as Apple Wallet, which allow users with any regional device model (iPhone 7 or later) to add FeliCa-based cards. In turn, users with Japanese devices cannot access North American & European transit cards such as SmarTrip and Pop, though there is a workaround via previewing a route in Google Maps that uses the desired fare payment method, and selecting the banner that offers to add said card to Wallet. Campus IDs are also locked to devices bought in the United States of America, Canada, and Australia. Google claims support for international devices is \"coming soon,\" though this has been promised for several years as of 2024. In addition, UWB functionality for car keys is limited to regions that allow the frequency to be broadcast in personal mobile devices by law. === Supported loyalty programs === These programs are conveyed through NFC through Google Wallet's Smart Tap feature. Some of these can be added through the Google Wallet app directly, while others must be added through the respective retailer's app or website. Programs that support One Tap are conveyed at the same time as a payment card stored in Google Wallet. Conversely, Two Tap programs are redeemed in a sequential manner, where a loyalty pass is scanned first, and then payment can be presented. Country Retailer One Tap/Two Tap Dan Murphy's My Dan's Woolworths' Everyday Rewards Two Tap Nando's Nando Card Two Tap d Point Two Tap Rakuten Point Card Two Tap Woolworths' Everyday Rewards Two Tap OPEN POINT One Tap Nando's Nando Card Two Tap Texaco's Star Rewards Two Tap Valero's SaveUP Rewards Coca-Cola's Vending Pass One Tap Dave & Buster's Power Card One Tap Jimmy John's Freaky Fast Rewards One Tap Walgreens' myWalgreens Two Tap Yogurtland's Real Rewards One Tap === Supported public transport systems === Due to the open nature of the Android platform, some transit cards are only available through other Android-based mobile wallets or via their apps (e.g. Navigo for Samsung Wallet or TAP for Android). Transit cards that support direct provisioning can be issued within the Google Wallet app itself, without needing to download a separate third party application. Some public transport systems listed here support skipping verification with Google Pay on Android, wherein the only requirement for transmitting a payment or transit card is to have the screen awake. This is not supported on Google Pay for Wear OS or Fitbit OS, however. Users with watches must open the Wallet app time each time they scan their fare payment method (except FeliCa-based fare methods). All FeliCa-based cards require separate apps to be used and managed by Wallet. Suica and PASMO require the Osaifu-Keitai app, and Octopus requires the Octopus app. All these cards are region-locked and cannot be added by foreign tourists. Transit loyalty cards are passes that can be linked to one payment card in a user's Wallet. Similarly to a transit card, it will keep track of rides made on the system and offer fare caps. However, there is no standalone balance. All funds are pulled directly from the linked payment card. Country Area Skip verification Direct provisioning Wear OS support Stored via Fare Payment Method(s) Payment cards Payment cards Host Card Emulation Myki (only MetrôRio) Payment cards (only SPTrans) Payment cards (TTC, GO Transit, Brampton Transit, MiWay, Oakville Transit and UP Express.) Host Card Emulation PRESTO Payment cards- VISA, Mastercard and American Express accepted. UP Express also accepts Interac debit cards. Payment cards Athens Payment cards (pilot program at the airport -- buses X93, X95, X96, X97) Countrywide Secure Element via Octopus app Octopus Countrywide Secure Element via Osaifu-Keitai app Suica Secure Element via Osaifu-Keitai app PASMO (only Mexico City Metrobús and Mexico City Metro) Payment cards Countrywide Payment cards Countrywide Host Card Emulation Ubian Host Card Emulation Tarjeta Transporte Público (in public beta) Countrywide Secure Element iPASS Payment cards- VISA and Mastercard accepted. New Taipei Metro Payment cards- Mastercard are accepted by Ankeng and Danhai light rail. Taichung Metro Payment cards- VISA accepted. Taoyuan Airport MRT Payment cards- VISA and Mastercard accepted. Payment cards Brighton and Hove Transit loyalty card connected to payment card Payment cards Payment cards Payment cards Host Card Emulation Pop Host Card Emulation Swift rowspan=\"2\" Host Card Emulation Ventra Payment cards Payment cards Host Card Emulation Contactless ticket Payment cards Transit loyalty card connected to payment card Payment cards rowspan=\"2\" Host Card Emulation Hop Fastpass Payment cards Host Card Emulation Clipper Seattle Host Card Emulation ORCA Host Card Emulation SmarTrip ==== Upcoming ==== Country Area Wear OS support Stored via Fare Payment Method(s) Dubai nol Los Angeles Transit Access Pass Philadelphia SEPTA Key === Supported car keys === These car models can be unlocked and started via NFC with select devices running Android 12/Wear OS 5 or later, most notably the Pixel 6 or later. In addition, certain car models that support operation via UWB (AKA \"passive entry\") require an UWB compatible device, such as the Pixel Fold, Pro models of Pixel 6 and later devices, or the Pixel Watch 3, for enhanced functionality. === Supported government-issued identifications === These territories permit their residents to save their government-issued identification credentials in Google Wallet. Mobile IDs in Google Wallet support three personal identification standards: ISO 18013-5, ISO 23220-4, and NIST 800-63. Users have a choice whether to present their ID via NFC or QR. Once the credential is read, the ID holder must confirm the personal information they wish to share (full name, age, etc.) The transmission to the reader device will be completed over BLE after the presentation is fully verified. Google has also announced plans for added credentials to be able to be requested by apps to present virtually in the future. Available for devices running Android 9 or later. Country Type State ID ID ID ID ID ID ==== Upcoming ==== Country Type State/Territory ID ID ID ID ID ID ID ID ==== Other non-government issued identifications ==== These are ID passes issued by Google that utilize information from an individual's government-issued ID, but the digitized pass itself is not considered to be \"government-issued.\" Country Type Passport === Device- specific & region-locked features === Some features in Wallet are locked to certain devices that have additional hardware or software that are not included in other Android/Wear OS devices, such as secure elements or licenses for certain region-specific middleware. ==== Car keys ==== Some devices may need Android OS or Play System updates before being worked. The Pixel Watch 3 must be paired with a worked Pixel phone to use digital keys. Brand Model UWB availability Google Pixel 6a Pixel 6 Pixel 6 Pro Pixel 7a Pixel 7 Pixel 7 Pro Pixel 8a Pixel 8 Pixel 8 Pro Pixel Fold Pixel 9 Pixel 9 Pro Pixel 9 Pro Fold Pixel Watch 3 Motorola Moto Edge 50 Ultra Razr 50 Ultra OnePlus 11 Open 12 Oppo Find N3 Find N3 Flip Xiaomi 12 12 Pro 13 13 Pro 13 Ultra 13T 13T Pro 14 14 Ultra 14T 14T Pro ==== Transit cards ==== Transit card Requirement(s) iPASS Phones: Xiaomi 14T, Xiaomi 14T Pro Wearables: Fitbit Sense or later, Fitbit Versa 2 or later, Fitbit Charge 4 or later Google Account region must be set to Taiwan Octopus Phones: Android 12 or later with NFC Must install Octopus Wallet app (which requires a Hong Kong phone number to sign up for) PASMO Phones: Japanese models of select phones Must install Osaifu-Keitai app Google Account region must be set to Japan Suica Phones: Japanese models of select phones Must install Osaifu-Keitai app Wearables: Japanese models of Google Pixel Watch or later Japanese models of Samsung Galaxy Watch6 or later, Galaxy Watch Ultra Google Account region must be set to Japan ==== e-Money cards ==== e-Money card Requirement(s) Edy Phones: Japanese models of select phones Must install Osaifu-Keitai app nanaco WAON ==References== ==Other websites== * wallet Category:Software Category:2022 establishments in the United States Category:2018 establishments in the United States Category:Mobile payments",
 "title": "Google Wallet"
}