{
 "id": "1146271",
 "text": "Habib Wahid is a Bangladeshi music composer and singer.He became popular with his debuted album Krishno in 2003, which was an instant hit at that time. Throughout his career, Habib Wahid has released numerous hit singles and albums including, Shono (2008) and Moina Go (2005), establishing himself as one of the leading figures in the Bangladeshi music industry. He won Bangladesh National Film Award for Best Music Director for the film Projapoti (2011) and has won a record 5 times Bangladesh National Film Award for Best Male Artist. ==Early life and education== Habib Wahid was born and brought up in Dhaka, Bangladesh to Ferdous Wahid, a Bangladeshi pop singer, and Roksana Wahid. His ancestral home is in south paiksha in Srinagar of Munshiganj (Bikrampur). He attended South Breeze School in Dhanmondi. Wahid attended YWCA and Radiant International School. At Radiant International School, his principal was Sabina Yasmin's eldest sister. He went to England in pursuit of higher education and studied music & audio engineering at the School of Audio Engineering at London, UK in 1999. ==Career== ===Debut with Krishno=== Wahid started working with other Asian music producers such as Karsh Kale while in the UK. Wahid was already working as a music producer, however he needed a vocalist to develop his new album. While living in London, he found the vocalist Kaya, a Sylheti restaurant owner, who would collaborate with him on the album. In 2003, Wahid released his first album Krishno, a collaborative effort with Wahid producing the music while Kaya sang. The album proved to be a success in Britain and Bangladesh. The album Krishno was a fusion of folk and modern Ektaar Music Ltd, introducing a new genre to the Dhaka music arena. ==Personal life== Wahid married Lubyana in 2003, and they divorced later that year. He married Rehana Chowdhury in 2011, and together they have a son. They divorced in 2017. In January 2021, Wahid announced that he had recently married Afsana Chowdhury Shifa. They have a son. ==Discography== === Solo albums === Year Name Label Reference 2005 Moina Go Ektaar Music 2006 Shono Laser Vision 2008 Bolchi Tomake Sangeeta 2011 Ahoban! Deadline Music 2012 Shadhin === Collaborative albums === Year Name Other Artists Label Reference 2003 Krishno Kaya Ektaar Music 2004 Maya Kaya & Helal 2007 Panjabiwala Shireen Jawad Laser Vision 2008 O Bosheshe Ferdous Wahid Sangeeta 2011 Somorpon Aurthohin & Warfaze Deadline Music 2012 Rong Nancy === Compilation albums === Year Name Label Reference 2009 Obosheshe Sangeeta ===Singles=== Year Name Label Notes Reference 2015 \"Hariye Fela Bhalobasha\" Sangeeta Feat.Peya Bipasha \"Mon Ghumay Re\" Multisourcing Ltd 2016 \"Tomar Akash\" Robi Yonder \"Moner Thikana\" Multisourcing Ltd Feat. Sarlina; Lyrics by Riddhi \"Beporawa Mon\" Unlimited Audio Video Feat. Tanjin Tisha \"Meghe Dhaka Shohor\" (with Nirjhor) CD Choice Featured in the 2015 TV serial Meghe Dhaka Shohor; Lyrics by Zahid Akbar \"Tumi Amar\" (with Nancy) From the soundtrack Sultana Bibiana \"Ei Bangla Ei Manush\" Sangeeta Released for the World Bank's End Poverty Day; Lyrics by Sharmin Sultana Sumi From Chirkutt 2017 \"Tumi Hina\" HW Productions Lyrics by Minar Rahman \"Mitthe Noy\" Dhruba Music Station Lyrics by Shafiq Tuhin \"Ghum\" Sangeeta Feat. Rafiath Rashid Mithila; Lyrics by Shuhrid Sufiyan \"Golaper Din\" (featuring Nancy) HW Productions Lyrics by Shuhrid Sufiyan \"Tor E Janalay\" (with Nancy) 2018 \"Cholo Na\" Gaanchill Music Music composed by Fuad ;Feat. Sarlina Hossain 2022 \"Beni Khule\" (with Muza) Qinetic Music Feat. Aabir Khan, Farjana Mahbub Poly, Joyshree Debi, Sadia Ethila, Saiful Islam Sabbir, Suporno Chakraborty, Tisa Rema, Sazz Enrique, Anila Iqbal, Ridy Sheikh, Ishrat Zaheen Ahmed, Sadiya A. Suchita, Shanaya Shahnaz, Farzana Faiza Bushra, TJ Faiza, Abrar Zahin Music composed by Russell Ali, Muza & Fuad Lyrics by Fuajia Sultana & Muza == Awards == |- | 2006 |\"Valobashbo Bashbo Re\" from Hridoyer Kotha |Best Singer (Male) |Meril Prothom Alo Awards | | | |- | 2008 |Bolchi Tomake |Best Singer (Male) |Meril Prothom Alo Awards | | | |- |2009 |\"Dwidha\" from Third Person Singular Number |Best Singer (Male) |Meril Prothom Alo Awards | | | |- |2010 | \"Projapoti\" from Projapoti |Best Singer (Male) |Meril Prothom Alo Awards | | | |- |2011 |Projapoti |Best Music Director |National Film Awards | | | |- |2012 |Shadhin |Best Singer (Male) |Meril Prothom Alo Awards | | | ==References== ==Other websites== * Category:Living people Category:Bangladeshi musicians Category:Bangladeshi singers",
 "title": "Habib Wahid"
}