{
 "id": "1146233",
 "text": "The Arab conquest of Egypt was led by the army of 'Amr ibn al-'As.Sijpesteijn 2007, p. 440. It took place between 639 and 642 AD and was overseen by the Rashidun Caliphate. It marked the end of the seven-century Roman period in Egypt, which began in 30 BC, and also the end of the Greco-Roman period that lasted around a thousand years. Before the conquest, the Byzantine Empire was having trouble because Egypt had been taken over by the Sasanian Empire for ten years, from 618 to 629. Later, the Byzantine emperor Heraclius got Egypt back. The Caliphate took advantage of Byzantines' exhaustion to invade Egypt. In the 630s, the Romans had already lost the Levant and their allies in Arabia to the Caliphate. Losing the rich province of Egypt and their battles made the Byzantine Empire much weaker, leading to even more losses in land in the future. == Background == In 640, Heraclius was the emperor of the Byzantine Empire. Cyrus of Alexandria was the governor of Egypt and also the church leader there. Theodore was in charge of the Byzantine army in the area. After Muhammad died in 632 AD, the Arab armies of the Rashidun Caliphate started to expand into Sasanian Persia and the Byzantine Empire.James Lindsay. Daily Life in The Medieval Islamic World. (Westport, CT: Greenwood Press,1957) Pg 3 Neither of the two former empires was prepared for the fast expansion of the Arab forces, as both underestimated the rising support of Islam. This is shown by how confused the Byzantines were and how slowly the Sasanians reacted.Khalil I. Semaan. Islam and the Medieval West. (Albany, NY: State University of New York Press, 1980) Pg 4 After defeating the Byzantines at Yarmuk (636) and the Persians at Qadisiyah (637), Arab generals focused on the wealth of Byzantine Africa. After the Siege of Jerusalem, Amr ibn al-As proposed invading Egypt to the Caliph. He was familiar with Egypt's wealth from his visits as a merchant and from leading a mission to Gaza in 637. He told the Caliph, \"The conquest of Egypt will give great power to the Muslims and will be a great aid to them, for it is the wealthiest land and the weakest in fighting and war power.\" After Amr convinced Caliph Umar to go ahead with the invasion, Umar is said to have changed his mind at the last minute, but it was too late to stop it. This part of the story shows that Umar was worried about giving too much power to a general. However, this detail might have been added later because of Amr's reputation for being very independent as a governor. == Rashidun invasion of Egypt == === Crossing the Egyptian border === In December 639, 'Amr ibn al-'As set out for Egypt with 4,000 troops, mainly from the Arab tribe of 'Ak, although about a third were from the tribe of Ghafik. Some Roman and Persian converts to Islam also joined them. However, Caliph 'Umar worried that conquering Egypt with only 4,000 soldiers was unwise. He wrote a letter to 'Amr instructing him to quickly return to the Caliph's court to join new campaigns. However, the letter emphasized that it was 'Amr's responsibility was to protect his troops. If he was already in Egypt when he received the letter, the Caliph would allow him to decide how to move his forces, to avoid overburdening them. The messenger, 'Uqbah ibn 'Amr, caught up with Amr near Rafah, close to the Egyptian border. Suspecting what might be in the letter, Amr told the army to speed up. He informed 'Uqbah that he would receive the caliph's letter after they set up camp for the night. 'Uqbah, not knowing what the letter contained, agreed and continued with the army. They stopped for the night at Shajratein, a small valley near El Arish, which was beyond the Egyptian border.Al-Maqrizi, Mawaiz wa al-'i'tibar bi dhikr al-khitat wa al-'athar. Amr read Umar's letter and discussed it with his companions about what to do next. Everyone agreed that since they received the letter while on Egyptian soil, they were allowed to move forward. When 'Umar got the reply, he decided to keep an eye on what was happening and gather more troops in Madinah to send to Egypt for help. On Eid al-Adha, the Muslim army marched from Shajratein to El Arish, a small town without any soldiers. The town did not fight back, and the people agreed to support them. == References == Category:History of Egypt",
 "title": "Arab conquest of Egypt"
}