{
 "id": "1146445",
 "text": "Adam D'Angelo (born August 14, 1984) is an American internet entrepreneur. He is best known as the co-founder and CEO of Quora. == Early years == D'Angelo is of Jewish ancestory was born on August 14, 1984 in Redding, Connecticut. He went to Phillips Exeter Academy for high school. There, he developed the Synapse Media Player (a music suggestion software) along with Mark Zuckerberg and others. He attended California Institute of Technology, where he graduated with a B.S. in Computer science. == Career == In 2004, while in college, D'Angelo created the website BuddyZoo, which allowed users to upload their AIM buddy list and compare them with those of other users. The service also generated graphs based on the buddy lists. D'Angelo joined Facebook in 2004, and worked as its chief technology officer (CTO) from 2006 to 2008, and also worked as its vice president of engineering, until 2008. In 2009, he started Quora. In 2012, he invested $20 million of his own money into Quora as part of their Series B round of financing. Apart from Quora, his notable investments include Instagram before it was bought by Facebook for $1 billion, Asana, a work management platform co-founded by Facebook co-founder, Dustin Moskovitz, and Lunchclub, a networking platform using AI. D'Angelo is also the founder of an AI startup, Poe. D'Angelo was an advisor to and investor in Instagram before it was bought by Facebook in 2012. In 2018, he joined the board of directors of OpenAI. In 2023, D'Angelo voted to remove Sam Altman from his role as CEO of OpenAI. When Sam Altman returned to OpenAI, the other three board members involved in Altman's ouster resigned. D'Angelo kept his position making him the only original board members on the eve of the ouster still in office. == Achievements == In 2001, he was placed 8th at the USA Computing Olympiad and won a silver medal at the 2002 International Olympiad in Informatics. ACM International Collegiate Programming Contest (ICPC): California Institute of Technology Beavers (team of 3), World Finalists 2003, 2004; North American Champions 2003; World Finals Silver Medals 2004; World Finals co-coach 2005. In 2005, he was one of the top 24 finalists in the Algorithm Coding Competition of the Topcoder Collegiate Challenge. In Fortune magazine, D'Angelo was a runner-up in its \"Smartest people in tech\" article in 2010. == Reference == D’Angelo, Adam D’Angelo, Adam D’Angelo, Adam",
 "title": "Adam D'Angelo"
}