{
 "id": "1146242",
 "text": "Sambhaji Bhonsle was the eldest son of Shivaji from his first wife Saibai. He was born in 1657 at Purandar and became the second Chhatrapati of Maratha Empire after the death of Shivaji. He was executed after series of torture by Aurangzeb in 1689 at Tulapur. ==Millitary Career== ===Sack of Bhuranpur=== In 1681 Sambhaji sacked the city of Bhuranpur of Mughal Empire and looted it completely Routing the enemies. ===Siege of Ramsej (1682)=== Mughals laid siege to Fort of Ramsej the killedar put up a considerable defend while Sambhaji providing necessary supplies atlast the Mughals captured the Fort through negotiation with the new killedar and was captured after a Siege of 6-7 years. ===Siege of Janjira(1681-82)=== Sambhaji laid siege to Fort of Janjira tho initially successful he have to leave the siege in between to go fight with Mughals he gave the command to dadaji Raghunath but he failed miserably. ===Battle of Kalyan Bhiwandi=== In 1682 Mughals captured the Fort of Kalyan. Tukoji tired to repulse him but failed and was killed. Sambhaji along with Hammbirrao Mohite, Manaji Moré and Rupaji Bhosale attacked the grassion and defeated them at Kalyan Bhiwandi on 1683 with heavy casualties on both sides. ===Mughal Invasion of Konkan=== Mughal Under command of Shah Alam the son of Aurangzeb Invaded Konkan with army of one lakh but were defeated and buy Sambhaji with army of 60,000 the Mughals fled for life. ===Maratha Invasion of Goa=== Sambhaji Maharaja invaded Goa of Portugese in 1683 various sirkimish were fought, Goa was almost captured but due to Mughal threat Peace treaty was signed between the two. ===Maratha Mysore war=== In 1682 Sambhaji invade Mysore tho initially unsuccessfulhe defeated Mysore ruler Chikka Dev Raya at Trichinopoly and later in 1686. ==Death== In 1689 Sambhaji was captured by Mughal Subedar Muqqrab Khan (Shaikh Nizam) with the help of traitors named Kanhoji Shirke and Ganoji Shirke (close relatives of Sambhaji) he was tortured badly and killed along with his friend Kavi Kalash. Some historians says that he was cut into pieces and fled to dogs, while some says his body was flown into the river. He was succeeded by his brother Rajaram ==Family== Sambhaji was born to Shivaji and Saibai. He was married to Yesubai from whom he got two children namely Shahu and Bhawani Bai. Bhawani Bai was married to Son of Hiraji Mahadik and had 2 sons namely Durgoji and Arjoji. She committed Sati after death of her husband in 1727. While Shahu became the 5th Chhatrapati of Maratha Empire. Massir e alamgiri mentions another wife of Sambhaji who was in Mughal camp during his desertion to Mughals. Another Wife with 3 issues is mention Madansingh Madhosingh and a daughter who was married to a muslim gond. However this claim doesn't have any historical evidence hence we can say that the wives mentioned could have been concubines. == See also== *Dharmarakshak Mahaveer Chhatrapati Sambhaji Maharaj: Chapter 1 == References == Category:Pages created with the Article Wizard from 2024 Category:1657 births Category:1689 deaths Category:Indian monarchs",
 "title": "Sambhaji I"
}