{
 "id": "1146446",
 "text": "Arthur Wilton Brown (born 24 June 1942) is an English singer-songwriter. He is best known for his flamboyant performances, eclectic, his operatic voice, and his high pitched banshee screams. He is also known for his extreme facepaint and a burning helmet. He is best known for The Crazy World of Arthur Brown's 1968 single \"Fire\", reaching number one in the UK Singles Chart and Canada, and number two on the US Billboard Hot 100. After the success of the single \"Fire\", the press would call Brown \"The God of Hellfire\".Unterberger, Richie. Urban Spacemen and Wayfaring Strangers, p. 46. Brown has been named as an inspiration for many singers such as Alice Cooper,Marshall 2005, pp. 85 and 153. David Bowie, Peter Gabriel,Marshall 2005, p. 175. Marilyn Manson, George Clinton,Marshall 2005, p. 172. Kiss, King Diamond, and Bruce Dickinson of Iron Maiden.Marshall 2005, p. 103. ==Songs== * 1965 – \"You'll Be Mine\" (The Diamonds) b/w \"You Don't Know\" (Arthur Brown with The Diamonds) (Reading Rag Record LYN 770/771 UK) * 1967 – \"Devil's Grip\" b/w \"Give Him a Flower\" (The Crazy World of Arthur Brown) (Track Records 604008 UK) * 1968 – \"Fire\" b/w \"Rest Cure\" (The Crazy World of Arthur Brown) (Track 604022 UK), (Atlantic Records 2556 US), (Polydor 541012 Can) * 1968 – \"Nightmare\" b/w \"Music Man\" (aka \"What's Happening\") (The Crazy World of Arthur Brown) (Track 604026 UK)(Polydor 541022 Can / #68 Canada) * 1968 – \"I Put a Spell on You\" b/w \"Nightmare\" (The Crazy World of Arthur Brown) (Track 2582 US) * 1971 – \"Eternal Messenger\" b/w \"I.D. Side to be B Side the C Side\" (Kingdom Come) (Polydor Records 2001 234 UK) * 1973 – \"Spirit of Joy\" b/w \"Come Alive\" (Polydor 2001 416 UK) * 1974 – \"Gypsies\" b/w \"Dance\" (Gull Records GULS 4 UK) * 1975 – \"We've Gotta Get Out of This Place\" b/w \"Here I Am\" (Gull GULS 13 UK) * 1976 – \"Ooh, It Takes Two to Tango \" b/w \"Rocking the Boat\" (Arthur Brown & Aliki Ashman) (Electric INT 111.352 GER) ==References== ==Other websites== * Arthur Brown Official website * The God of Hell Fire Official website * * * Arthur Brown's YouTube channel Category:1942 births Category:Living people Category:English singer-songwriters Category:English rock singers Category:Writers from Yorkshire",
 "title": "Arthur Brown (musician)"
}