{
 "id": "1146258",
 "text": "A two-round system is a system of voting, or choosing one of many options. When people choose among many candidtes it is likely that no candidate will get the number of votes needed; very often, this means that less than half the people who voted, voted for this candidate. The idea is then to do another vote, but to eliminate those candidates very few people voted for. Commonly, in the second round, it will be a vote between the two candaudates who got the most votes. == Problems == Whiöe it is commonly used, the system also has its problems: * The system is made to elect one candidate; it is not possible to rank candidates * Candidates who represent minorities only get very few votes, they will not be among the two 'best' ones * Two candidates who have similar views may get a similar result in the vote * The question of how to select who gets to run for the second round can be difficult to solve. * Scenarios can be constructed where the two candidates that get admitted to the second round do not have the majority of votes together.(As an example: one candidate gets 30% of the votes, the second one has 15%, and there are a number of candidates that get beteeen 5 and 10% of the vote) * There is no way to model alliaces between candidates == Origins == The French system of ballotage was first established as part of the reforms of the July Monarchy, with the term appearing in the Organic Decree of 2 February 1832 of the French government, which mandated a second-round election \"when none of the candidates obtains an absolute majority\". The rule has since gained substantial popularity in South America, Eastern Europe, and Africa, where it is now the dominant system. Some variants of the two-round system use slightly different rules for eliminating candidates in the first round, allowing more than two candidates to proceed to the second round in some cases. Under such systems, it is sufficient for a candidate to receive a plurality of votes (more votes than anyone else) to be elected in the second round. ==References== Category:Voting systems",
 "title": "Two-round system"
}