{
 "id": "114630",
 "text": "The Kassite dynasty was ruled by the Kassites. They were an obscure mountain tribe who came to power in Babylon after the collapse of the First Dynasty of Babylon in 1595 BC following a Hittite sack of the city, and became rulers of northern Babylonia. == The Kassites == The Kassites (Persian: کاسی‌ها) were an ancient people from Zagros mountains. Kassites were a federation of several nomadic tribes living in the Zagros mountains, in modern Loristan (Iran). In the 18th century BCE, the Kassites started to infiltrate Mesopotamia, which was ruled by the successors of the famous king Hammurabi of Babylon (1792–1750). Kassites threatened Babylonia, which they captured in 1750 BC. The Kassite dynasty dominated Mesopotamia from the 16th to the 12th century BC. == Importance of this empire == By turning southern Mesopotamia into a state, instead of a group of temple-cities, the Kassites made Babylonia an international power. They ruled Babylonia almost without interruption for about four hundred years — the longest rule by any dynasty in Babylonian history.Boardman J. et al. (eds) 1982. Cambridge Ancient History, vol III Pt 1 (2nd Ed). Cambridge University Press. Kassite kings established trade and diplomacy with Assyria, Egypt, Elam and the Hittites. The Kassite royal house intermarried with their royal families. There were foreign merchants in Babylon and other cities. Babylonian merchants traded from Egypt (a source of Nubian gold) to Assyria and Anatolia. Kassite weights and seals, the tools of trade, have been found in Thebes in Greece, in southern Armenia, and even in a shipwreck off the southern coast of today's Turkey. The Kassite kings set up a network of provinces administered by governors. Nippur, a formerly great city, had been virtually abandoned. It was rebuilt in the Kassite period, and became the most important provincial center. Under the Kassite government, the governor of Nippur ruled as a secondary (lesser) king. Some 13th century BC Kassite kings even took the title 'Governor of Nippur' for themselves. The Elamites conquered Babylonia in the 12th century BC, thus ending the Kassite state. The last Kassite king, Enlil-nadin-ahi, was taken to Susa and imprisoned there, where he died. However, Kassites survived as a distinct ethnic group in the mountains of Lorestan long after the Kassite state collapsed. == References == == Other websites == *Richard Hooker, \"The Kassites: 1530-1170 The Kassite Interregnum\" Category:Eurasian nomads Category:History of Iran Category:History of Iraq Category:Mesopotamia Category:Royal dynasties Category:2nd millennium BC",
 "title": "Kassite dynasty"
}