{
 "id": "1146639",
 "text": "Eraldo Monzeglio (; 5 June 1906 – 3 November 1981) was an Italian association football coach and player, who played as a defender, in the position of full- back. He was an elegant full-back who knew how to adapt to the WM formation that had imposed itself in the early 30s. Renowned as a great man-marker with his ability to anticipate every ball possessions. Widely regarded as one of the best defenders in the 1930s. At club level, he stood out especially in the golden age of Bologna, at the time nicknamed \"the team that makes the Earth tremble\". Monzeglio is considered one of the ten greatest idols and the best defender the club has ever had. He also stood out for Roma, being inducted into the Italian Football Hall of Fame in 2013. On the other hand, critics point out that Monzeglio would have been called up to the World Cups due to his friendship with Benito Mussolini's family. ==Club career== Monzeglio started at the modest Casale in 1923, heading in 1926 to Bologna. He won the Italian championship in the 1928–29 season, the second in the club's history. Also in 1929, the defender and the felsinei took part in a tour of South America. etween the 1930-31 and 1934-35 seasons, Juventus won an unprecedented fifth championship, naturally forming the basis of selection. Monzeglio and Bologna, in turn, won in 1932 and 1934 the Mitropa Cup, a tournament considered a precursor to the UEFA Champions League. Thus, he ended up called up for the 1934 FIFA World Cup, being, alongside striker Angelo Schiavio, one of the two representatives of the rossoblù in the Azzurri's starting lineup, dominated by Juventus. ==International career== His debut for the Italian national team would come when he returned, on May 11, 1930, in a 5–0 victory over Hungary inside Budapest. In the Cup, Monzeglio entered from the second match, replacing the then captain Virginio Rosetta in the defensive duo with Luigi Allemandi, remaining in the starting lineup until the end. Monzeglio left Bologna after the 1934–35 season, joining Roma. Even at the end of his career, he continued, as a Roma player, called up by the national team, being called up to the 1938 FIFA World Cup to offer experience, being 32 years old at the time in a very renewed and rejuvenated squad, in contrast to the average age close to 30 years old configured in the Azzurri in the 1934 edition. Monzeglio had lost speed for marking, but had gained experience in the sense of placement, being seen as a luxury reserve. His last international appearance was in his World Cup debut, in a 2–1 win over Norway in Marseille. He teamed up with Pietro Rava, being replaced during the tournament by Alfredo Foni. ==Coaching career and death== Monzeglio continued to work at Roma, as an assistant coach. Afterwards, he began a long career as a coach. In it, he won the 1949-50 Serie B with Napoli. He also managed Sampdoria and Juventus. He ended his coaching career in football in 1973, when he coached Chiasso. He died in Turin at the age of 75, and his body is buried in Casale Monferrato, next to the tomb of his former teammate Umberto Caligaris, with whom he had played for Casale between 1923 and 1926. ==Honours== ===Player=== ====Club==== ;Bologna *Serie A: 1928–29 *Mitropa Cup: 1932, 1934 ====International==== ;Italy * FIFA World Cup: 1934, 1938 * Central European International Cup: 1927–30, 1933–35; Runner-up: 1931–32 ===Manager=== ;Napoli *Serie B: 1949–50 ===Individual=== *FIFA World Cup Team of the Tournament: 1934 *Seminatore d'oro: 1959–60 *Italian Football Hall of Fame: 2013 (Posthumous) ==References== ==Other websites== *Eraldo Monzeglio at Enciclopediadelcalcio.it Category:1906 births Category:1981 deaths Category:Footballers from Piedmont Category:Italian football managers Category:Association football defenders",
 "title": "Eraldo Monzeglio"
}