{
 "id": "1146428",
 "text": "The Saudi-led intervention in Yemen is a military operation that began on March 26, 2015, involving a coalition of countries led by Saudi Arabia.https://www.reuters.com/article/us-yemen-security-prison- idUSKCN0PA2JZ20150630 The intervention was launched in response to the ousting of Yemeni President Abdrabbuh Mansur Hadi by Houthi forces, who took control of Sanaa, Yemen's capital, in 2014. The conflict is part of the larger Iran–Saudi Arabia proxy conflict and involves multiple Middle Eastern and North African countries.https://www.reuters.com/article/us-yemen-security- idUSKBN0NK0N020150429 == Background == In 2014, the Houthis, a Zaidi Shia militant group backed by Iran, began protests against the Yemeni government, eventually seizing control of Sanaa and declaring a new administration. The Houthi takeover led to clashes with forces loyal to President Hadi, who fled to Saudi Arabia. This event set the stage for the Saudi-led coalition's intervention.http://www.foxnews.com/world/2015/10/28/doctors-without-borders- says-saudi-led-airstrikes-bomb-yemen- hospital/https://www.independent.co.uk/news/world/middle-east/yemen-air- strike-bomb-kills-140-saudi-arabia-usa-white-house-a7352386.html == Objectives and operations == The coalition began its intervention under the codename Operation Decisive Storm (Arabic: عملية عاصفة الحزم) with initial airstrikes and a full blockade aimed at weakening the Houthis. After claiming to have achieved initial objectives, the coalition announced a shift to Operation Restoring Hope on April 22, 2015. This operation includes a combination of military action and diplomatic efforts to restore stability in Yemen. == Involvement of other nations == Alongside Saudi Arabia, coalition forces include Egypt, Morocco, Jordan, Sudan, and the United Arab Emirates, with each providing air or ground support. Other countries, including the United States, United Kingdom, and France, have provided logistical support, intelligence, and arms. == Humanitarian impact and criticism == The intervention has been widely criticized for its humanitarian impact, with thousands of civilians killed and infrastructure severely damaged. The Yemen Data Project reports over 8,000 civilian deaths due to coalition airstrikes. The United Nations estimates that the conflict has contributed to over 377,000 deaths, including indirect causes such as famine and lack of healthcare. == Recent developments == In 2022, Saudi Arabia declared a unilateral ceasefire to facilitate peace negotiations. In April 2023, most restrictions on commercial goods were lifted following Oman-mediated talks between Houthi and Saudi officials. Although open hostilities have largely decreased, ongoing peace talks have been complicated by recent Houthi attacks on shipping routes in the Red Sea. == Related pages == * Iran–Saudi Arabia proxy conflict * Yemeni Civil War (2014–present) * Houthis * Abdrabbuh Mansur Hadi == References == == Other websites == * United Nations * Yemen Data Project Category:21st-century conflicts Category:Saudi Arabia Category:Houthi Movement Category:21st century in Yemen",
 "title": "Saudi-led intervention in the Yemeni civil war"
}