{
 "id": "1146754",
 "text": "Jerry Yang (born November 6, 1968) is an American internet entrepreneur and investor. He is best known as the co-founder of Yahoo! Inc., one of the earliest and most popular internet services and search engines. Yang served as Yahoo's CEO and Chief Yahoo and played a crucial role in the development and growth of Yahoo in the early days of the internet. == Early Life and Education == Jerry Yang was born as Yang Chih-Yuan in Taipei, Taiwan. He immigrated to the United States with his family when he was ten years old and settled in San Jose, California. Although he spoke only a single word of English when he arrived in the U.S., Yang quickly excelled in his studies. Yang attended Stanford University, where he earned both a Bachelor of Science and a Master of Science in electrical engineering. During his time at Stanford, he met David Filo, with whom he would later co-found Yahoo. == Career == === Founding Yahoo! === In 1994, Yang and David Filo created a website called \"Jerry and David's Guide to the World Wide Web,\" which was a directory of other websites organized by categories. The site quickly became popular, leading them to rename it \"Yahoo!\" in March 1995. Yahoo grew rapidly, evolving into a web portal with a wide range of services and becoming one of the most popular websites in the world by the late 1990s. Yang served as Yahoo’s CEO from 2007 to 2009. During his tenure, he declined a $44.6 billion acquisition offer from Microsoft, a decision that was widely discussed and scrutinized. Yang stepped down from the CEO role in 2009 but remained active in the company’s operations until his departure in 2012. === Investment and Board Roles === After leaving Yahoo, Yang turned his attention to investing and supporting technology startups. In 2012, he co-founded AME Cloud Ventures, an investment firm focused on seed and early-stage investments in technology companies. Through AME Cloud Ventures, Yang has invested in various companies including Evernote, Docker, and Wish. Yang has also served on several corporate and advisory boards, including Alibaba Group, where he played a significant role in facilitating Yahoo's early investment in the Chinese e-commerce giant. == Personal Life == Yang is married to Akiko Yamazaki, a Japanese-American philanthropist and conservationist. The couple met at Stanford University and has been active in supporting educational, cultural, and environmental causes. They have donated to various institutions, including Stanford University, where they helped establish the Jerry Yang and Akiko Yamazaki Environment and Energy Building. == Recognition and Awards == * Induction into the Asian Hall of Fame * Being listed on the Forbes list of \"Top 100 Tech Moguls\" * Honorary doctorate from Pepperdine University == Legacy and Impact == As one of the pioneers of the internet, Yang’s contributions to the industry have had a lasting impact. Yahoo paved the way for internet portals and set standards for web services and advertising that would later be expanded by companies like Google and Facebook. His early investments in companies such as Alibaba highlight his influence on global e-commerce and technology. == See Also == * Yahoo! * AME Cloud Ventures * David Filo * Alibaba Group == References == == Other Websites == * AME Cloud Ventures website * Stanford University website Category:American businesspeople",
 "title": "Jerry Yang"
}