{
 "id": "1146531",
 "text": "The State of Brazil was a colony of the Portuguese Empire created in 1548 by the King John III. The goal of the State of Brazil was turn the portuguese colony (Brazil) more centralized and efficient. Since the beginning, the Brazil was a weak administration because the \"Hereditary Captaincies\". The King unified all the capitanies in 1572 and created only two Brazilian states, the north and the south, until 1577 In 1621 the state of Brazil was divided again when the State of Maranhão and Grão-Pará was created, with capital in the city of São Luís, later Belém. The rest of the state of Brazil had the capital in Salvador. This was division of the State of Brazil until the 19th Century, when the north state (Maranhão and Grã-Pará) was annex by the Independent Brazil. The leader of the state of Brazil was the governor- general. the first governor-general of the State of Brazil was Tomé de Sousa. The capital of the state of Brazil was moved to the city of Rio de Janeiro in 1763. The State of Brazil was dissolved in 1815, after the defeat of Napoleon Bonaparte, when Prince Regent John VI created turned the State of Brazil into a Kingdom, like Portugal. == Governor-General == When the State of Brazil used the system of hereditary captaincies, only two colonies was working On December 17, 1548, João III created the role of governor-general of Brazil. Portugal wanted to make a strong colony (Brazil) due to the need to transform Portuguese America into a rich colony, like the Spanish America. == Division into two states == In 1572, the governor-general Mem de Sá was quited from the role, during the reign of Manuel, Portugal noticied Brazil was problems in your government, so he divided the Brazil in two states: # The north state was from Porto Seguro to Maranhão (northeast region, plus the north of Minas Gerais, Federal District, the northeast of Pará, and the east of Tocantins and Goiás), with the capital in Salvador, in the Captaincy of Bahia. # the south state started in the captaincy of Espírito Santo and annexed and expanded to south of Brazil, respecting the limits of Tordesillas, the capital of the south state was Rio de Janeiro, next to Captaincy of São Vicente == Kingdom of Brazil == In 1815, John VI turned the state of Brazil in a kingdom, being called Kingdom of Brazil and forming a United Kingdom with the kingdoms of Portugal and Algarves . ==References== == Other websites == * Tables of Administrative Structures of Portuguese Brazil * The construction of governability in the State of Brazil: social profile, political dynamics and governmental networks of the general government (1642-1682), by H Araújo, PhD Thesis in Social History, 2018 Category:Former countries in South America Category:History of Brazil Category:States and territories disestablished in the 19th century Category:1540s establishments in South America Category:Former Portuguese colonies",
 "title": "State of Brazil"
}