{
 "id": "1146027",
 "text": "Fighter is a 2024 Indian movie directed by Siddharth Anand. It stars well- known Bollywood actors Hrithik Roshan, Deepika Padukone, and Anil Kapoor in the lead roles. The movie is a mix of action and drama and features a story about the Indian Air Force. == Plot == The story of Fighter is about the bravery and dedication of Indian Air Force pilots. Hrithik Roshan and Deepika Padukone play the roles of pilots who fight against enemies and protect their country. The movie is expected to show thrilling air battles and intense action scenes. == Cast == * Anil Kapoor as Group Captain Rakesh \"Rocky\" Jaisingh, Commanding Officer of Air Dragons Unit * Hrithik Roshan as Squadron Leader Shamsher \"Patty\" Pathania * Deepika Padukone as Squadron Leader Minal \"Minni\" Rathore * Karan Singh Grover as Squadron Leader Sartaj \"Taj\" Gill * Akshay Oberoi as Squadron Leader Basheer \"Bash\" Khan * Rishabh Sawhney as Azhar Akhtar * Sanjeeda Sheikh as Saachi Gill, Taj's wife * Ashutosh Rana as Abhijeet Rathore, Minni's father (special appearance) * Geeta Agrawal as Usha Rathore, Minni's mother * Talat Aziz as Mr. Pathania, Patty's father * Sharib Hashmi as Wing Commander Varthaman, Ilyushin Il-76 Pilot * Ramon Chibb as Air Commodore Abhinder \"Abhi\" Bali, Chief Instructor, Air Force Academy * Sanjeev Jaiswal as Majeed Khan * Baveen Singh as Squadron Leader Sukhdeep \"Sukhi\" Singh * Mahesh Shetty as Squadron Leader Rajan \"Unni\" Unnithan * Seerat Mast as Squadron Leader Naina \"NJ\" Jaisingh, Rocky's sister and Patty's deceased fiancée * Sanjiv Chopra as Air Marshal Rohan Rawal, AOC in C Western Air Command * Nishan Khanduja as Flying Officer Manoj \"Birdie\" Bhardwaj * Karan Sharma as Flying Officer Ajeet \"Jeet\" Deshpande * Chandan K Anand as Wing Commander Harish \"Nauty\" Nautiyal * Harnam Singh Sandhu as Squadron Leader Sanjay Mathur * Indhu Reddy as Flight Lieutenant Rajshree Mehta * Aditi Sandhya Sharma as Flight Cadet Neha \"NJ\" Jaiswal[citation needed] * Hrushi Poddar as Flight Cadet Sunil * Mushtaq Kak as Maulana Maqsood Abrar * Vinay Varma as Air Commodore Debyajyoti \"Debu\" Biswas, AOC, Air Force Station, Srinagar * Lokesh Batta as Squadron Leader Sandeep \"Sandy\" Kumar * Himani Sahani as Squadron Leader Tanya Aggarwal * Harish Khatri as Prime Minister of India * Chandra Shekhar Dutta as RAW agent Yafeth Salim a.k.a. Zareena Begum * Samvedna Suwalka as Bela Unnithan, Unni's wife * Geeta Sodhi as Mrs. Gill, Taj's mother * Gurmeet Chawla as Chief of the Air Staff Category:2024 movies Category:2020s Indian movies",
 "title": "Fighter (movie)"
}