{
 "id": "1146584",
 "text": "The University of Mumbai, informally known as Mumbai University (MU), is a public state university in Mumbai, Maharashtra, India. Established in 1857, it is one of the oldest universities in India and was one of the first three universities founded in India. Known for its sprawling campuses, the university offers undergraduate, postgraduate, and doctoral programs in fields such as science, commerce, arts, management, engineering, law, and social sciences. It is affiliated with the University Grants Commission (UGC) and has received a top grade from the National Assessment and Accreditation Council (NAAC). == History == The University of Mumbai was established on 18 July 1857 by Dr. John Wilson, following a petition by the Bombay Association to the British colonial government. Originally founded as an affiliating and examining body, the university's purpose was to encourage higher education in the Bombay Presidency. In 1904, it was restructured to provide a more robust system of teaching and research. Over the years, it evolved into a prominent university, contributing to the development of higher education in India. == Campuses == * Fort Campus - in South Mumbai, housing administrative offices and the examination section. * Kalina Campus - in Santacruz (East), this campus hosts various postgraduate programs and research facilities. * Thane Sub-Campus - Serves as an extended learning and research center in the city’s northern region. == Academics == * Faculty of Arts * Faculty of Commerce * Faculty of Science * Faculty of Technology * Faculty of Law * Faculty of Management Studies == Affiliated Colleges == * Narsee Monjee College of Commerce and Economics == Research and Innovation == The university promotes research through its various departments and research centers. It also has multiple collaborations with national and international academic bodies. Areas of significant research include economics, social sciences, chemical technology, and engineering. Its dedicated research programs are supported by funding from the University Grants Commission, Council of Scientific and Industrial Research (CSIR), and other organizations. == Rankings == The University of Mumbai has consistently ranked among the top universities in India, particularly in the fields of commerce and science. In recent years, the university has received favorable evaluations from the National Institutional Ranking Framework (NIRF) and QS World University Rankings. == Notable Alumni == The university has an extensive alumni network, with many graduates going on to become leaders in politics, business, science, and the arts. Notable alumni include: * Dr. B.R. Ambedkar * Mukesh Ambani * Anil Kapoor * Sunita Williams * Kishore Kumar == References == == Other websites == * Official website Category:Education in Asia Category:Education in India",
 "title": "University of Mumbai"
}