{
 "id": "1146061",
 "text": "Iași pogrom (Romanian: Pogromul de la Iași) was an antisemitic pogrom that happened in Romania under the rule of the pro-Nazi dictator Ion Antonescu between 28 and 30 June 1941. The pogrom, which killed 13,266 Jews, was part of the Holocaust in Romania. * * * ==Background== ===History of Jews in Romania=== ====Classical antiquity==== Jews have been living in Romania since the Roman times, mainly along the Black Sea coast, when Romania belonged to the Roman province of Dacia.* * * ====Middle Ages==== More Jews moved to Romania in the 14th century when the Kingdom of Hungary expelled Jews, many of whom became merchants running the trade route between the Ottoman Empire and Polish–Lithuanian Commonwealth. ====Early modern period==== Later Jewish immigration due to expulsion from Spain and Moldova scattered Jews across Romania, who survived there until the 20th century despite centuries of pogroms, while facilitating Romania's industrialization. ====Interwar period==== Romania's WWI victory as one of the Entente powers expanded her territory and Jewish population, when some Jews previously under Russian and Austro-Hungarian rule became Romanians, but antisemitism worsened in Romania. Adolf Hitler's takeover of Germany in 1933 catalyzed fascism in Europe to which Romania was not immune. Laws were passed in the Romanian parliament to restrict Jews from every part of society, while Jewish members no longer existed in the parliament. Right before WWII, over 43,500 Jews lived and 146 synagogues existed in Iași. As of August 2024, only 326 Jews and two synagogues remained, a 99.3% drop in Iași's Jews in comparison. ===World War II=== In 1940, Ion Antonescu became the Prime Minister of Romania as an Iron Guard member and began the Holocaust in Romania alongside Adolf Hitler. ====Iron Guard==== The Iron Guard (Romanian: Garda de Fier) was a pro-Nazi militant group founded by Romanian ultranationalist Corneliu Zelea Codreanu. * * * * * * * * By appealing to widespread antisemitism with mystical Christian nationalism, * * * the Iron Guard attracted a huge public following and Romanian Orthodox Church's backing. * * * * In 1937, the Iron Guard became the third-largest party in Romania's parliament. Between 1938 and 1941, it was outlawed twice due to the violent extremism of its members, especially in their January 1941 Bucharest pogrom, which killed 125+ Jews, * * * and their rebellion against Ion Antonescu, who then cracked down on the Iron Guard, resulting in the imprisonment of 9,000 members. Many imprisoned members were later released to join the Iași pogrom and the broader Holocaust in Romania. ==Massacre== Aided by Romanian civilians, who included recently released Iron Guard's members, German and Romanian troops killed 13,266 Jews across Iași between 28 and 30 June 1944. Many Romanian soldiers reportedly believed that all the Jews were communists or Freemasons who deserved their fate. A former professor, a priest and a railroad worker sacrificed when they were shot by Romanian soldiers for trying to save Jews under attack. When shooting the former professor, a Romanian soldier reportedly yelled, 4,300 Jews were deported elsewhere by train, 2,600 of whom died on the way. ==Aftermath== ===Odessa massacre=== The Holocaust in Romania intensified after the Iași pogrom. Four months later, Romanian troops, also under Ion Antonescu's order, killed as many as 100,000 Jews in Romanian-occupied Odessa, causing Odessa to lose 98.7% of her pre-war Jews. * International Commission on the Holocaust in Romania. Final Report. President of the commission: Elie Wiesel. Edited by Tuvia Friling, Radu Ioanid, and Mihail E. Ionescu. Iași: Polirom, 2004. * Ioanid, Radu. The Holocaust in Romania: The Destruction of Jews and Roma under the Antonescu Regime, 1940–1944. Second edition. Published in association with the United States Holocaust Memorial Museum. Lanham, MD: Rowman & Littlefield, 2022. * Kruglov, Aleksander, and Kiril Feferman. “Bloody Snow: The Mass Slaughter of Odessa Jews in Berezovka Uezd in the First Half of 1941.” Yad Vashem Studies 47, no. 2 (2019): 15. * Solonari, Vladimir. A Satellite Empire: Romanian Rule in Southwestern Ukraine, 1941–1944. Ithaca, NY: Cornell University Press, 2019. * Zipperstein, Steven J. The Jews of Odessa: A Cultural History, 1794–1881. Stanford, CA: Stanford University Press, 1985. Between 1941 and Ion Antonescu's overthrow in the 23 August coup in 1944 led by King Michael I, as many as 400,000 Romanian Jews were killed, amounting to 52.8% of pre-war Romanian Jews. * * * ===War crimes trials=== 57 persons, includung Ion Antonescu for which he was executed, were convicted of war crimes for their role in the Iași pogrom, most of whom were sentenced to life in jail, while some were acquitted in 1997 under the democratic Romanian government.Roni Stauber, Routledge, 2010, Collaboration with the Nazis: Public Discourse after the Holocaust, p. 260. ===Revisionism under communism (1947 – 1989)=== Under Nicolae Ceaușescu's communist rule, Romania's role in the Holocaust was officially denied. It was blamed entirely on the German and Hungarian fascists. Romanians were taught about the \"heroic anti-fascist resistance\", emphasizing the anti-Nazi battles following Romania's defection to the Allies. Many former subordinates of Ion Antonescu served in the secret police of Nicolae Ceaușescu to help him oppress Romanians. Meanwhile, Nicolae Ceaușescu reportedly believed lies about Jews, including The Protocols of the Elders of Zion, and defined Jew as a \"money-changer\" and an \"extortionist\" in an official English–Romanian dictionary. ===Revisionism in post-communist age (1989 – )=== Since the fall of Ceaușescu's communist regime, a systematic effort to whitewash the war criminals, especially Ion Antonescu, has been observed by scholars. Antonescu is praised by some so-called historians as a hero who waged a \"holy war against Bolshevism.\" Acts of Holocaust denial Distortion of the Holocaust refers, inter alia, to: by politicians occurred from time to time, notable of whom include Ion Iliescu, the former President of Romania (2000 – 2004). He made similar claims to those of Ceaușescu that there was \"no Holocaust within Romania\" and that the Poles, Jews and communists \"were treated equally\", while denying the Romanian role in the Holocaust and the verified Romanian Jewish death toll. ====Countermeasures==== An international inquiry, led by Romanian-American Jewish writer Elie Wiesel, identified all the evidence of Romania's role in the Holocaust. The Elie Wiesel National Institute for Studying the Holocaust in Romania (Romanian: Institutul Național pentru Studierea Holocaustului din România „Elie Wiesel”, INSHR), a state-funded Holocaust research center, was also founded in 2005. In November 2021, the Romanian parliament passed a law, by a large majority, to require the teaching of the Holocaust and Jewish history from 2023. The only group opposing it was the nationalist party Alliance for the Union of Romanians (AUR). The AUR was condemned by the INSHR. Since September 2023, the Holocaust and Jewish history have become part of the high school curriculum in Romania. ==Related pages== * Babi Yar * Kristallnacht * Jedwabne pogrom * Szczuczyn pogrom * Rhineland massacres ==Footnotes== ==References== Category:Pogroms Category:The Holocaust Category:Antisemitism in Europe",
 "title": "Iași pogrom"
}