{
 "id": "1146165",
 "text": "Christmas horror is a fiction genre and a movie genre. It combines stories with a Chrismas theme with horror stories. == Origins and history == Since prehistoric times, there were celebrations of the the winter solstice in Britain. The genre blends into these traditional celebrations. Hollywood Reporter said it was part of an early tradition of associating the death of winter with the coming rebirth of spring, citing Shakespeare's 1623 The Winter's Tale as a precursor to the genre. Charles Dickens' 1843 A Christmas Carol is an early example of the genre in fiction. The story is very well known today. According to the British Film Institute this story \"forever tied the festive season to the genre\". Dickens also wrote other ghost stories with holiday settings, such as the 1866 \"The Signal-man\". M. R. James wrote ghost stories in the early 1900s which he read aloud to friends at Christmas time as part of a tradition of such holiday entertainments. In 1954 the American EC Comics published an edition of Vault of Horror titled \"...And All Through the House\" which featured a killer dressed as Santa. Horror was present in Christmas-themed movies from the early 1900s. Early examples include Wladyslaw Starewicz's Christmas Eve (1913), Victor Sjostrom's The Phantom Carriage (1921), and Christian-Jaque's Who Killed Santa Claus (1941). In the 1970s, the BBC broadcast an annual A Ghost Story for Christmas based on James' short stories. It later produced Christopher Lee's Ghost Stories for Christmas in which Lee played James reading his stories aloud, and then a reboot of Ghost Story for Christmas, both series airing in the early 2000s. The movie genre fully emerged in the 1970s and generated controversy. Early examples of the modern Christmas horror genre in film are 1971's Whoever Slew Auntie Roo? and the 1972 Silent Night, Bloody Night. 1972's _Tales from the Crypt_ was adapted from the Vault of Horror \"...And All Through the House\" and was the first movie to feature a killer dressed as Santa. 1974's Black Christmas is considered an influential classic of the genre. According to Stephen Thrower it is generally regarded as an influence on the 1978 Halloween. The genre faded for a few years. There were more slasher films in the late 1970s and early 1980s . It was revived by Gremlins and Silent Night, Deadly Night, both in 1984, and revived from the late 80s through at least the late 2010s.: == Conventions == Usually, the genre takes elements of horror stories and puts them into the stories told around Christmas, which focus on peace and kindness. The settings are Christmas-themed. Common motivers include snow, nicely decorated homes, building and streets and twinkling lights. This is done to make people experience a sense of peace, before telling a story which makes them feel afraid. Christmas horror novels and movies are sometimes based on horror elements from different Christmas storytelling traditions. These inclode Krampus and Perchta of Central Europe and Icelandic folklore's Gryla. These characters punish people who behaved in bad way, sometimes together with Santa Claus; other characters are the Kallikantzaroi of Southeastern Europe, who create general mayhem during the season. Examples of the genre in which a killer is disguised as Santa are common, while those in which an actual Santa commits violence are rare but exist. == Popularity == Paste wrote that the genre was popular because it puts settings of violence and fear in a seson which is usually marked by calm and kindness: People are expected to treat one another with kindness. That way, Paste wrote: \"Setting a bloodbath against the pristine, jealously guarded specter of Christmas, on the other hand, has always been angling for a certain level of purposeful offense, because there have always been folks who take the defense of the holiday’s image very seriously. Perhaps tearing down that institution (or at least gently ribbing it) is simply too tempting to resist.\" The Hollywood Reporter speculated that the genre's appeal was a reflection that \"Christmas isn’t the happiest time of the year for everyone\" and that it provided \"a means to conquer and control some of the less delightful aspects that seep into the holiday\". NPR said the relatability of the genre seemed obvious: \"It's not too hard to make the case that Christmas stories can be scary ... that large man sneaking into your home at midnight after watching you all year. No wonder there's an entire genre of Christmas-themed horror movies\". Matthew DuPée, author of A Scary Little Christmas: A History of Yuletide Horror Films, wrote that filmgoers \"seeking an exhilarating alternative to the sickly sweet, feel-good Christmas movies found on the Hallmark Channel\" explained the genre's popularity. == Controversy == The genre is controversial. Many critics denigrated the horror genre and in particular the slasher genre. Silent Night, Deadly Night's 1984 appearance, despite the release of other movies including the same year's Don't Open till Christmas, led to protests. These protests were started by promotional material, which featured a killer Santa with the tagline: \"He knows when you've been naughty!\" Six versions of the television commercial for the movie were submitted to the Motion Picture Association's advertising code administration before it was approved. The movie also was unusual in that it fully integrated Christmas, and in particular Santa Claus, into the plotline. According to Fangoria editor Michael Gingold, the movie, \"in scene after scene, demonstrates a hatred for Christmas\". According to Going to Pieces: The Rise and Fall of the Slasher Film, a 2006 documentary, the movie \"became the flashpoint, igniting protests across the nation\". The film was released in the East Coast and Midwest in November 1984 by TriStar Pictures, but the protests and their national coverage led to the film's removal from distribution a week later. Some theaters continued to run it, including in Buffalo and Boston.The movie was eventually rereleased by Aquarius Film Releasing with promotional materials that focussed on the film having been so outrageous that \"parents everywhere\" had \"tried to ban it\" and no images of Santa or references to Christmas. == References == == Books == * Category:Slasher movies Category:Christmas movies Category:Movie genres Category:Pages with unreviewed translations",
 "title": "Christmas horror"
}