{
 "id": "1146425",
 "text": "Albanian Stars of the Diaspora () is an Albanian talent show that highlights the talents of young Albanians or people of Albanian origin living abroad. == Format == The talent show includes a variety of performance categories where contestants can showcase their skills. The main categories are: * Dance * Acting/Performance * Music * Singing * Other Art Forms Contestants are required to submit an application, which includes their personal details and a 60-second video performing in the category they choose.After the audition phase, where new talents from the Albanian Diaspora are selected, the public chooses the semifinalists through online voting. Meanwhile, a jury composed of well-known Albanian public figures selects the new talents who advance to the final stage of the program. == Contestants and Performances == Below is a list of contestants and their performances in each episode. The competition features a diverse range of talents, including singing, dancing, and other artistic expressions. === Episode 1 – Rome === Contestants and Performances Contestant Performance Type Giulia Muça Dance Alesia Hamzollari Singing Denzel & Zhizel Ndreka Dance Uendi Shaqiri Singing Nika Tuçi Dance Arvin Khorsandi Dance Marsel Meta Folklore === Episode 2 – Rome === Contestants and Performances Contestant Performance Type Sara Bishani Singing Greis Prenga Dance Kevin Kometa Singing Enida Nuredini Dance Alesio Lulaj Singing Giulia Vuksani Dance Ema Kapidani Singing === Episode 3 – Rome === Contestants and Performances Contestant Performance Type Kimberly Beu Dance Isabela Shabi Singing Enart Bakiasi Singing Erika Shalla Dance Emili Mankolli Comedy Alked Kuçi Dance Ana Qyra Singing == Audition Process == The initial stage of the competition is the application process. Participants apply online by providing their personal information and submitting a short video clip (60 seconds) that demonstrates their talent. These videos are reviewed by the show's producers to select contestants for the televised rounds. == Filming Locations == The show is filmed in multiple cities, including: * Rome * Dortmund * Skopje * Pristina * Basel * Milan These locations allow for a broad reach, connecting with Albanian audiences living outside Albania. == Production == \"Albanian Stars of the Diaspora\" is produced by Top Channel Albania. The production involves filming in various international locations, allowing contestants from diverse backgrounds to participate and showcase their talent. The executive producer and screenwriter of the show is Ledja Liku. Author,creator and presenter is Albanian coreographer Ilir Shaqiri. == Collaborators and Support == The television program organized by Dritan Hoxha Media Foundation\"and supported by MEKI (the Ministry of Economy, Culture, and Innovation) has been filmed in various cities across Europe and the United States, reaching a wide audience within the Albanian diaspora. == Impact and Objectives of the Program == The program has contributed to promoting Albanian culture and preserving cultural identity among younger generations in the diaspora. Participants from the Albanian diaspora have had the opportunity to present ideas and projects to a global audience, showcasing their talents and achievements beyond the borders of Albania, Kosovo, and the Albanian Diaspora. This inclusion has allowed them to feel more connected to their roots and to contribute to the development of their country of origin. == Broadcast == The show airs on Top Channel Albania, one of the leading television networks in Albania. It reaches a large viewership within Albania and also attracts viewers from the Albanian diaspora through satellite and online streaming options. == References == Category:Television programs Category:Albanian culture",
 "title": "Albanian Stars of the Diaspora"
}