{
 "id": "1146964",
 "text": "Medieval Europe, also known as the Middle Ages, was a period in European history that lasted from the fall of the Western Roman Empire, in the 5th century, to the beginning of the Renaissance and of the Age of Discovery, in the late 15th century. The thousand-year era is often divided into three periods: the Early, High, and Late Middle Ages. The era ended with the Renaissance, a cultural rebirth that celebrated humanism and secular knowledge and drew Europe into the modern age. == Periodization == === Early Middle Ages === From the 5th to the 10th centuries, the Roman Empire declined, various peoples migrated, and Christianity spread. === High Middle Ages === Between the 11th and the 13th centuries, there was population growth and economic expansion. Powerful kingdoms rose, and the Catholic Church was influential. === Late Middle Ages === Between the 14th and the 15th centuries, Europe experienced challenges like the Black Death, the Hundred Years' War, and economic hardships. However, the period also included the early stirrings of the Renaissance. == Society and economy == The feudal system structured medieval society. The system had lords grant lands to vassals in exchange for loyalty and service. Meanwhile, the majority of the population were serfs who worked the land. The manorial system was the basic economic structure. Estates (manors) provided food for the lord’s household and the local population. Trade and commerce began to revive in the High Middle Ages, especially in cities like Venice, Florence, and Paris. == Religion == The Catholic Church was a unifying force throughout medieval Europe. It played a central role in daily life by providing spiritual guidance and governing morality. Monasteries were centers of learning, and the Pope had considerable influence over political matters. The church's authority often extended into secular affairs, which led to conflicts with rulers over issues such as investiture. == Culture and learning == Medieval European culture was a blend of classical, Christian, and Germanic influences. Education was primarily conducted in monastery and cathedral schools. Most teaching was done in Latin. In the 12th century, universities were established in cities like Bologna, Oxford, and Paris, which marked the beginnings of higher education in Europe. Key intellectual movements, such as Scholasticism, aimed to reconcile Christian theology with classical philosophy, particularly the works of Aristotle. == Art and architecture == There were several distinctive artistic styles in the Middle Ages such as Romanesque and Gothic architecture. The Romanesque style (11th–12th centuries) featured thick walls, rounded arches, and small windows. The Santiago de Compostela Cathedral is an example of this style. The Gothic style (12th–16th centuries) is known for its pointed arches, ribbed vaults, and flying buttresses. This style created towering cathedrals like Notre-Dame de Paris and Chartres Cathedral. == Military and Warfare == The Middle Ages were marked by frequent conflicts, such as: * The Crusades: Religious wars initiated by European Christians aiming to reclaim the Holy Land from Muslim rule. * The Hundred Years' War (1337–1453): A long conflict between England and France that shaped both kingdoms’ political and cultural identities. == Notable figures == Medieval Europe was shaped by prominent leaders and thinkers. One was Charlemagne (747-814), the King of the Franks, who became the first Holy Roman Emperor in 800, which began the Carolingian Empire. Thomas Aquinas (1225–1274) was a Dominican friar and philosopher whose works combined Aristotelian thought with Christian doctrine. His writings became very important in Christianity. Joan of Arc (1412-1431) was a peasant girl who led the French forces during the Hundred Years' War and became a national heroine of France. She was burned at the stake in 1431 and canonized in 1920. == Legacy == Medieval Europe set the foundations for the modern Western world by shaping law, culture, religion, and philosophy. It was a period of cultural transformation and adaptation, influenced by ancient traditions, the spread of Christianity, and the emergence of national identities. == Related pages == * Feudalism * Byzantine Empire * Holy Roman Empire * Reconquista * Renaissance * Medieval philosophy == References == Category:Middle Ages",
 "title": "Medieval Europe"
}