{
 "id": "1147774",
 "text": "The Mughal Conquest of Deccan are a number of Millitary Engagements between Ahmadnagar Sultanate and Mughal Empire. Mughal emperor Jahangir sent his army towards Deccan to subdue Ahmednagar Sultanate commanders Malik Ambar and his Maratha lieutenants who recapture the area captured during the reign of Akbar in 1605. Initially Man Singh along with Khan-i-Khana, Bharju Rathore, Ramadas Kachhwa and Pheroz Jung were sent but they failed and were compelled to retreat to Buharanpur. Hostiles were continued from 1612 in 1617 Emperor sent peace truce to Malik Ambar, Malik Ambar realising that they were outnumbered by Mughals accepted the treaty. Soon after the treaty Malik Ambar again started his activities even attacking Shah Jahan who locked himself in the Fort of Ahmadnagar. Marathas of Malik Ambar went as far as Mandu. But Jahangir himself with his commadars like Jai Singh I and Dadu Rao Chandrawat attacked them at Khirki, Shahaji tackled them and defend his army even killing Dadu Rao Chandrawat but he had to retreat due to the outnumbered Army of Mughals. In 1621 Peace treaty was signed between Mughals and Ahmadnagar were Malik Ambar ceded the territories captured after 1617 and becoming their tributaries for a brief period however Mughals weren't able to capture Deccan as they planned out. ==Battle== Jahangir, like his father Akbar, wanted to expand the Mughal Empire and control all of India. Akbar had treated the north and south as one united country, and Jahangir aimed to conquer the Dakhin (Deccan) region. By 1605, the Mughals controlled parts of Khandesh and Ahmadnagar, but Jahangir wanted to take the rest of Ahmadnagar and the independent states of Bijapur and Golkonda. In 1608, Jahangir sent Khan Khana and Man Singh with 12,000 troops to conquer the Dakhin, but he faced strong resistance from Malik Ambar, the prime minister of Ahmadnagar, who used clever Maratha guerrilla tactics. Khan Khana's efforts failed, and other Mughal commanders, including Prince Parwez, couldn’t make much progress either. Malik Ambar Maratha lieutenants Maloji and Lakhuji harassed the retreating Mughals. In 1611, the Mughals tried to surround Ahmadnagar from multiple directions, but their plan failed when one commander, Abdulla Khan, rushed ahead and was defeated by Ambar’s forces. Jahangir replaced Abdulla Khan with Khan Khana, but the Mughals continued to struggle. In 1616, Jahangir sent his son Prince Khurram (later Shah Jahan) to lead the Dakhin campaign. Khurram forced Malik Ambar into a peace deal in 1617, and Ambar gave up some land to the Mughals. However, this was more of a temporary truce, and Ambar quickly formed an alliance with Bijapur and Golkonda to attack again. In 1621, Shah Jahan finally defeated Ambar and signed a peace treaty with the Dakhin states, who agreed to pay tribute to the Mughals. This boosted Shah Jahan’s reputation. However, Shah Jahan’s rise to power was helped by the death of his older brother, Prince Khusrav, whom he had secretly killed in 1621. Shah Jahan reported that Khusrav died of illness, and Jahangir did nothing about it, allowing Shah Jahan to become the next in line for the throne. == References == Category:India",
 "title": "Mughal wars in Deccan"
}