{
 "id": "1147216",
 "text": "Rajaram was the third Chhatrapati of the Maratha Empire. He was younger son of Shivaji and half–brother of Sambhaji I. He ruled from February 1689 to March 1700. He ascended the throne of Chhatrpati after the execution of Sambhaji by Aurangzeb. His 11 years of rule was marked with Struggle with Mughals under Aurangzeb. He died in 1700 in Sinhagd and was succeeded by his 5 year old son Shivaji II and his wife Tarabai as a reagent. ==Early Life== Rajaram, born on 24 February 1670 to Chhatrapati Shivaji and Soyarabai, was the younger brother of Sambhaji. After Shivaji's death in 1680, Rajaram was briefly crowned king at the age of 10, but Sambhaji claimed the throne. Following Sambhaji's death in 1689, Rajaram was informally crowned Chhatrapati and vowed to avenge his brother's murder. Rajaram married three times, first to Jankibai, daughter of Prataprao Gujar; then to Tarabai, daughter of Hambirrao Mohite; and finally to Rajasbai of the Ghatge family. He had three sons: Raja Karna (d. 1700), Shivaji II, and Sambhaji II. ==Struggle against Mughals== After Coronation of Rajaram, Zulfiqar Khan laid siege to the Fort of Raigad Rajaram escaped to Gingee Fort and made it his new captial. In 1689 after the capture of Raigad Fort Santaji Ghorpade tried to recapture it but failed. He then carried a daring raid on Mughals looted them but was compelled to retreat. Meanwhile another Noble Commander Dhanaji Jadhav had defeated Mughals in 5 consecutive battles. In 1690 Zulfiqar khan laid siege to the new capital Gingee Fort. A battle took place between Santaji, Dhanaji and Muqqrab Khan(Saikh Nizam) the one who captured Sambhaji I at Sangrameshwar. In this Shaikh Nizam was defeated and he fled to Kolhapur. At Kolhapur he was again defeated by Shankarji Naryan. Meanwhile the first Phase of the Siege of Gingee Fort failed. In 1694 Shankarji recaptured Raigad Fort and all others forts captured by Mughals. While the Third phase of siege of Gingee Fort was going on Zulfiqar khan carried an Expedition to Tanjore he was able to Subdue the Tanjavur Marathas leader Shahaji II but failed to capture Paramkota Fort. The Marathas were constantly defeating Mughals in Major and Minor Battles. Santajirao and Dhanaji were the prominent ones. In 1698 Zulfiqar khan finally captured Gingee Fort but Rajaram and his family escaped with the help of Ganoji Shirke who was a Mughal Commandar that time. Rajaram died in Sinhagd in 1700 and was succeeded by his son Shivaji II. ==Death and Legacy == Rajaram died on 3 March 1700 at Sinhgad due to Tuberculosis he was succeeded by Shivaji II. During Rajaram's regin the Marathas showed and excellent Resistance that no one in India did. A British letter called Rajaram as the \"King of India\". Some says Rajaram was a great Diplomat, not in Millitary engagements but in diplomacy He surpassed Sambhaji I as well as Shivaji. == References == Category:India",
 "title": "Rajaram I"
}