{
 "id": "1147548",
 "text": "Changan Automobile Co., Ltd.Chana > Contact Us > Dealer Application Chana Official Site (Web Archive) (CCAG) is a Chinese automobile manufacturer, headquartered in Jiangbei, Chongqing. The company founded in 1862 as military supply factory, the Shanghai Foreign Gun Bureau. In 1959 factory was repurposed to manufacture Changjiang Type 46 jeep. The company produces and sells vehicles under its own branding, such as Changan, Deepal, Avatr, Kaicene, as well as under foreign-branded joint ventures such as Changan Ford and Changan Mazda. In 2021, its own brands contributed 76% of its sales (1.75 million, including 1.2 million passenger vehicles). Its principal activity is the production of passenger cars, microvans, commercial vans and light trucks. == History == ===Beginnings=== In 1862, in Shanghai at the initiative of Li Hongzhang the Shanghai Foreign Gun Bureau was established, dealing with the import of weapons from foreign markets, which in the 1870s moved its headquarters to Suzhou, and then - to Nanjing. There, the name was changed to Jialing Machinery Manufacturing Bureau, where during the Sino-French War and First Sino-French War of 1884–1885, the plant specialized in producing military equipment for the Chinese army. Half a century later, as a result of the Second Sino-Japanese War the headquarters was once again moved away from the front lines, to Chongqing in central China. In the post-war period and the communist takeover, the enterprise retained its military equipment manufacturing character under a new name - 456. Central General Armaments Administration Plant. In the 1950s, thanks to parts obtained from captured military equipment, the Chongqing factory began small-scale production of copies of the American Willys. In 1957, it was replaced by a modified, original iteration called Changjiang 46, building about 1.4 thousand units of the vehicle until 1963, and then returned to the production of military equipment. Following the social and political unrest resulting from the Cultural Revolution, the company began producing civilian cars for the first time in its history in the early 1980s. To this end, an agreement was reached with Japan's Suzuki to begin licensed production of the Carry microvan in 1984 as the Changan Minivan. In the 1990s, Changan's corporate structure began to be built, resulting in the formation of the first joint-venture Changan Suzuki in June 1993. In 1999, Changan launched production of its first modern model, again a twin licensed variation on another genre of Suzuki Carry - the Star microvan. ===Development=== The first decade of the 21st century saw the development of Changan's business, both in its own car production sector and in cooperation with foreign partners. In 2001, another joint venture Changan Ford Mazda was concluded, and in 2006 the first passenger car developed from scratch by Changan debuted - the city hatchback Changan BenBen. In the second decade of the 21st century, the portfolio was intensively expanded, presenting new passenger models, as well as minivans and delivery vehicles separated into a separate brand Chana. Starting with the CS35 model introduced in 2012, the company came to build a wide range of SUVs and crossovers, which gradually dominated Changan's portfolio. In 2017, after the first experiments with the modified combustion model E30, the company also increased its spending on electrification of its model range. In 2018, Changan's annual sales exceeded 1 million units, and in 2023, thanks to further investments in hybrid and electric models, as well as the Avatr and Deepal brands that were created in the meantime, annual sales of vehicles with such a drive will exceed 470 thousand units. In the meantime, in 2020, it began producing a car for a large, foreign car company for the needs of external markets for the first time. As a result of the partnership with Peugeot, the Landtrek pickup truck was created, a derivative of the Chinese model Kaicene F70 designed by Changan. In 2024, another major foreign manufacturer used Changan's technology, building the Mazda EZ-6 model, a derivative of the Chinese sedan Deepal SL03. ===Market reach=== As early as the mid-2000s, Changan began expanding into its first overseas markets, in 2006, under its sister brand Chana, starting to export the Star microvan to Brazil and South Africa. In 2009, under the parent name Changan, the company expanded its reach to another South American country, Chile and the East Asia region starting with Malaysia. A year later, the company unified its naming convention on foreign markets, withdrawing from the Chana brand outside China. In the second decade of the 21st century, Changan continued to develop its global operations, starting distribution in key foreign markets in the following years: in 2013 in Russia, and in 2016 in the Middle East. After an unsuccessful debut in 2007, In 2020, Changan relaunched its sales in the Philippines, and a year later the range was expanded to include another large Latin American market - Mexico. == Products == === Current models === Image Models Chinese name Introduction Generation Vehicle description City car Changan Lumin 长安Lumin 2022 1st City car, BEV Sedan Changan Eado 长安逸动 2012 3rd Compact sedan, the third generation is renamed from Changan Lamore, ICE/BEV Changan Raeton Plus 长安锐程PLUS 2023 2nd Mid-size sedan Changan UNI-V 长安UNI-V 2022 1st Compact sedan, ICE/PHEV SUV Changan CS35 Plus 长安CS35 PLUS 2018 1st Subcompact SUV Changan CS55 Plus 长安CS55 PLUS 2017 2nd Compact SUV Changan CS75 Plus/CS75 长安CS75 PLUS/长安CS75 2013 4th (CS75 Plus) Compact SUV, ICE/PHEV Changan CS85 Coupe 长安CS85 Coupe 2019 1st Mid-size coupe SUV Changan CS95 长安CS95 2017 1st Mid-size SUV Changan UNI-K 长安UNI-K 2021 1st Mid-size SUV, ICE/PHEV Changan UNI-T 长安UNI-T 2020 1st Compact SUV, ICE/PHEV Changan UNI-Z 长安UNI-Z 2021 1st Compact SUV, rebadged from Oshan Z6, ICE/PHEV Changan UNI-S 长安UNI-S 2017 2nd Compact SUV Changan X5 Plus 长安X5 PLUS 2020 1st Compact SUV, rebadged from Oshan X5 Changan X7 Plus 长安X7 PLUS 2019 1st Mid-size SUV, rebadged from Oshan X7 Pickup truck Changan F70 长安F70 2019 1st Mid-size pickup Changan Hunter 长安猎手 2024 1st Mid-size pickup, ICE/PHEV(EREV) Changan Lantuozhe 长安览拓者 2023 1st Mid-size pickup, ICE/PHEV == Discontinued models == Image Models Production period Generation Vehicle description City car \\---- Changan BenBen \\----Changan BenBen E-Star 2013-2019 \\----2020-2023 2nd City car \\----BEV variant Sedan Changan Alsvin 2009–2021 2017–present (export) 3rd Subcompact sedan Changan Alsvin V3 2012-2017 1st Subcompact sedan Changan Alsvin V7/ Eado DT 2014-2022 2nd Subcompact sedan, renamed from Alsvin V7 to Eado DT Changan Eado XT/XT RS 2013-2020 2nd Compact hatchback variant of Changan Eado Changan Raeton 2012-2019 1st Mid-size sedan \\---- Changan Z-Shine/CX30 \\----Changan CX30 2008-2012 \\----2010-2012 1st Compact sedan \\----Compact hatchback variant SUV Changan CS35 2012-2022 1st Subcompact SUV Changan CS15 2016-2023 1st Subcompact SUV MPV Changan CX20 2010-2016 1st MPV Changan CM7 2003-2015 1st MPV Changan CM8 2004-2015 1st MPV Changan Eulove 2013-2018 1st MPV Changan Joice 2007-2009 1st MPV Changan Linmax 2017-2020 1st MPV == References == Category:Automobile companies of China",
 "title": "Changan Automobile"
}