{
 "id": "1147826",
 "text": "Michael George Glen Waltz (born January 31, 1974) is an American politician and a colonel in the United States Army who was the 29th United States National Security Advisor from January 2025 until May 2025. He was the U.S. representative for Florida's 6th congressional district from 2019 until 2025. Waltz is a member of the Republican Party. In November 2024, President-elect Donald Trump nominated Waltz to serve as his national security advisor. He took office on January 20, 2025, replacing Jake Sullivan. In May 2025, following the government group Signal chat leaks, Trump announced he would remove Waltz as his national security advisor to nominate him as the next U.S. Ambassador to the United Nations. ==Early life== Waltz was born in Boynton Beach, Florida, and grew up in Jacksonville, Florida. He studied at the Virginia Military Institute and became a second lieutenant in the U.S. Army. Waltz worked in the Pentagon as a defense policy director for secretaries of defense Donald Rumsfeld and Robert Gates. He went on to serve in the White House as the vice president's counterterrorism advisor. ==U.S. House of Representatives== Waltz ran for Florida's 6th congressional district in 2018 to replace Republican Ron DeSantis, who was elected governor of Florida. He ran against Democrat Nancy Soderberg in the general election. Waltz won with 56.31% of the vote to Soderberg's 43.69%. He would be re-elected in 2020, 2022 and 2024. In December 2020, Waltz was one of 126 Republican members of the House of Representatives to sign an amicus brief in support of Texas v. Pennsylvania, a lawsuit filed at the United States Supreme Court that did not support the results of the 2020 presidential election. On May 19, 2021, Waltz voted against legislation to create a January 6 commission meant to investigate the storming of the U.S. Capitol. Waltz was a strong critic of China, saying, \"We are in a Cold War with the Chinese Communist Party.\" In 2021, he was the first member of Congress to call for a full U.S. boycott of the 2022 Winter Olympics in Beijing over what he described as the CCP's genocide and internment of Chinese Uyghur populations. He compared the 2022 Olympics to the 1936 Summer Olympics held in Nazi Germany. In 2024, he called China an \"existential threat to the US with the most rapid military build-up since the 1930s\", and supported significant investments in the US Navy. Waltz resigned from Congress on January 20, 2025 to become the U.S. National Security Advisor in the second Trump administration. ==National Security Advisor== In November 2024, President-elect Donald Trump nominated Waltz to serve as his national security advisor. He took office on January 20, 2025, shortly after Trump was inaugurated. On May 1, 2025, it was reported that Waltz, along with Deputy National Security Advisor Alex Wong, would leave their jobs following group chat leaks on messaging platform Signal. The same day, President Trump announced that he planned to nominate Waltz as U.S. ambassador to the UN. ==Ambassador to the United Nations== Waltz was nominated to serve as the United States Ambassador to the United Nations on May 1, 2025. ==Personal life== Waltz has a teenage daughter and is married to Julia Nesheiwat. Waltz and Nesheiwat also have a child together. They live in St. Johns County. Waltz wrote \"Warrior Diplomat: A Green Beret’s Battles from Washington to Afghanistan.\" ==References== ==Other websites== * Congressman Michael Waltz official U.S. House website *Michael Waltz for Congress * Category:1974 births Category:Living people Category:United States representatives from Florida Category:Military people from Florida Category:Republican Party (United States) politicians Category:Politicians from Jacksonville, Florida Category:United States National Security Advisors",
 "title": "Mike Waltz"
}