{
 "id": "1147534",
 "text": "Preference falsification is the act of misrepresenting a preference under perceived public pressures. It occurs when people publicly express a different preference than they have. People frequently tell each other different preferences than they hold ptrivately.. Only when they have a cover such as anonymity,will they tell their real preference ni surveys such as opinion surveys. Pollsters can use techniques such as list experimentsDefinition of list experiments to uncover preference falsification. The term preference falsification was coined by Timur Kuran in a 1987 article, \"Chameleon voters and public choice.\" On controversial matters that lead to preference falsification, he showed there, widely disliked policies may appear popular. The distribution of public preferences, which Kuran defines as public opinion, may differ greatly from private opinion, which is the distribution of private preferences known only to individuals themselves. Kuran developed the implications of this observation in a 1995 book, Private Truths, Public Lies: The Social Consequences of Preference Falsification. This book argues that preference falsification is not only ubiquitous but has huge social and political consequences. It provides a theory of how preference falsification shapes collective illusions, sustains social stability, distorts human knowledge, and conceals political possibilities. Collective illusions is an occurrence when most people in a group go along with an idea or a preference that they don't agree with, because they incorrectly believe that most people in the group agree with it. == References == == Further reading == * Chapkovski, Philipp; Max Schaub (2022). \"Solid support or secret dissent? A list experiment on preference falsification during the Russian war against Ukraine.\" Research & Politics 9(2): 1-6. * Cook, Philip; Heilmann, Conrad (2013). \"Two types of self-censorship: Public and private.\" Political Studies. 61(1): 178–196. * Crabtree, Charles; Kern, Holger L.; Siegel, David A. (2020). \"Cults of personality, preference falsification, and the dictator’s dilemma.\" Journal of Theoretical Politics, 32(3): 409-434. * Duffy, John; Lafky, Jonathan (2021). \"Social conformity under evolving private preferences.\" Games and Economic Behavior. 128: 104–124. * Frank, Robert (1996). \"The political economy of preference falsification.\" Journal of Economic Literature. 34(1):115–123. * Jiang, Junyan; Yang, Dali L. (2016). \"Lying or believing? Measuring preference falsification from a political purge in China.\" Comparative Political Studies. 49 (5): 600–634. * Kalinin, K. (2018). \"Linking preference falsification and election fraud in electoral autocracies: The case of Russia.\" Political Studies, 66(1), 81-99. * Loury, Glenn C. (1994). \"Self- censorship in public discourse: A theory of 'political correctness' and related phenomena.\" Rationality and Society. 6 (4): 428–461. * Rose, Todd (2022). “Collective Illusions: Conformity, Complicity, and the Science of Why We Make Bad Decisions.” Hachette Book Group. ISBN 978-0306925689 * Valentim, Vicente. “Political Stigma and Preference Falsification: Theory and Observational Evidence.” The Journal of Politics. https://doi.org/10.1086/729966. Category:Psychology",
 "title": "Preference falsification"
}