{
 "id": "1147749",
 "text": "Bradford Lee Smith is an American lawyer and corporate executive who serves as the President and Vice Chairman of Microsoft Corporation. Known for his expertise in technology policy, intellectual property law, and digital privacy issues, Smith has been a key figure in Microsoft's legal and public policy strategies, especially in advocating for human rights and ethical AI standards. == Early Life and Education == Brad Smith was born in the United States. He attended Princeton University, where he earned a Bachelor of Arts degree in 1981. Following his undergraduate studies, Smith attended Columbia Law School, graduating with a J.D. in 1985.http://www.ohchr.org/EN/NewsEvents/Pages/DisplayNews.aspx?NewsID=21620&LangID;=E == Career == === Early Career === After completing his education, Smith began his legal career in Washington, D.C., working as an associate attorney for Covington & Burling, where he specialized in corporate and technology law.https://www.washingtonpost.com/news/innovations/wp/2017/07/11/microsoft- wants-to-bring-2-million-americans-online-by-2022/ === Microsoft === In 1993, Smith joined Microsoft as a corporate lawyer, where he quickly rose through the ranks due to his expertise in intellectual property law and technology policy. By 2002, he became Microsoft's General Counsel, later assuming the role of President in 2015. As President, Smith has been instrumental in shaping Microsoft's approach to issues such as privacy, cybersecurity, and human rights. Under Smith's leadership, Microsoft has taken stances on pressing global issues, including advocating for ethical AI use, supporting privacy laws like the GDPR, and fighting for human rights protections online. Smith also helped establish the Defending Democracy Program to protect elections from cyber threats. == Awards and Recognition == * Named among Fortune magazine's \"World’s 50 Greatest Leaders\" * Recognized by the American Academy of Arts and Sciences as a member in the field of public affairs == Publications == * Tools and Weapons: The Promise and the Peril of the Digital Age (2019) == References == == Other websites == * Brad Smith at Microsoft News * Microsoft Corporation official website Category:American businesspeople Category:Living people",
 "title": "Brad Smith (American lawyer)"
}