{
 "id": "1147700",
 "text": "Suhasini Maniratnam (born 15 August 1961) is an Indian actress, film director, producer, and screenwriter known for her work in the Tamil film industry, Over the years, Suhasini has played a range of iconic roles and has also been a filmmaker and producer. == Early Life and Education == Suhasini was born on 15 August 1961 in Chennai, Tamil Nadu, India. She is the daughter of veteran actor and director Charuhasan and Shanthidevi. She completed her schooling in Chennai and later pursued a degree in literature. == Career == Suhasini began her acting career in the early 1980s. She debuted in Tamil cinema with the film Nenjathai Killadhe (1980), directed by A. Bhimsingh. She went on to appear in numerous films, especially in the Tamil and Telugu film industries. === Acting === Suhasini's acting career spans more than four decades, during which she starred in a variety of roles, from strong supporting characters to leading roles. Some of her notable films include: * Mudhugauv (1983) – Tamil * Thevar Magan (1992) – Tamil * Kshana Kshanam (1991) – Telugu * Pelli Sandadi (1996) – Telugu * Rajashri (1989) – Malayalam === Direction and production === In addition to acting, Suhasini also ventured into film direction and production. Her directorial debut came with the Tamil film Indira (1995), where she not only directed but also produced the film. == Personal Life == Suhasini Maniratnam is married to filmmaker Mani Ratnam. The couple married in 1988, and they have one son, Nandin. == Filmography == Year Film Role Language 1980 Nenjathai Killadhe Rukmini Tamil 1983 Mudhugauv Tamil 1986 Mouna Ragam Divya Tamil 1991 Kshana Kshanam Priya Telugu 1992 Thevar Magan Meenakshi Tamil 1996 Pelli Sandadi Telugu 2005 Rajashri Malayalam 2019 Kalyanam Tamil == Awards and Recognition == * Tamil Nadu State Film Award – Best Actress for Mouna Ragam (1986) * Filmfare Award South – Best Actress (Tamil) for Thevar Magan (1992) * Nandi Award – Best Actress for Kshana Kshanam (1991) == References == Category:Movie actors Category:Movie directors Category:Indian movie actors Category:1961 births",
 "title": "Suhasini Maniratnam"
}