{
 "id": "114736",
 "text": "Italian cultural and historic presence in Dalmatia is about the Italian influence in Dalmatia. Dalmatia is now divided between Croatia, Herzegovina and Montenegro. ==Historical Influence== The historical influence from the Italian peninsula in Dalmatia started with the Roman conquest of Illyrian Dalmatia. Theodore Mommsen stated in his book History of Rome that all Dalmatia was fully Romanised and Latin speaking by the 4th century. Dalmatian people may trace their origins back to the Romanised Illyrians during the \"Barbarian Invasions\" of the fifth and sixth centuries when Avars with some Slavs invaded Illyria. This invasion opened the way to the settlement of different Slavic tribes (mainly the Croats). During those years the original Latin population took refuge in the coastal cities and in the islands. Others migrated to the mountains (they were later called \"Morlachs\"). In the early Middle Ages, the coastal area of Dalmatia still had its original Latinized culture, mainly on the islands and cities such as Zara, Spalato, Ragusa and Cattaro. These cities during the Middle Ages were called Dalmatian maritime neolatin cities. They had deep cultural and commercial links with the Italian mainland, thanks to intense commerce through the Adriatic sea.http://www.1911encyclopedia.org/Dalmatia#Population_and_National_Characteristics Starting from the 10th century the Republic of Venice imposed its influence on Dalmatia. It gradually assimilated the neolatin Dalmatians while the local Slavs maintained their language. The Republic of Venice controlled most of Dalmatia from 1420 to 1797. During that period, part of its Slavic population was Italianised. The Venetian possessions were called \"Venetian Dalmatia\". They had an economic bonanza with huge development of the arts and culture. Dalmatia was greatly influenced by the Italian Renaissance. Many buildings, churches and cathedrals were done in those years, from Zara and Spalato to Sebenik and Ragusa. In these centuries the Venetian language became the \"lingua franca\" of all Dalmatia. It assimilated the Dalmatian language of the Romanised Illyrians. it influenced the coastal Croatian language (\"Chakavian\") and the Albanian language.Bartoli, Matteo. Le parlate italiane della Venezia Giulia e della Dalmazia Zara was the capital of Venetian Dalmatia. During WWII it was the capital of the Italian \"Governatorato di Dalmazia\". In those centuries, the most southern area of Dalmatia was called Albania veneta. Now it is called coastal Montenegro. After the fall of the Republic of Venice in 1797 to Napoleon's armies, Dalmatia was made part of the \"Napoleonic Kingdom of Italy\" from 1805 to 1809. Following the ideals of the French Revolution the Italian language was the official language in the schools. When Austria occupied Dalmatia there was a revival of the Slav people inside Dalmatia. The Italian (Venetian speaking) population, that was (according to the Italian linguist Bartoli) nearly one third of the Dalmatians in the second half of the 18th century decreased from 22% in 1816 to 12.5% in 1853 and only 2.9% in 1910 according to the Austrian census. After WWI, by the Treaty of London, Italy obtained Zara and some northern Dalmatian islands (Cherso and Lussino). During WWII the Kingdom of Italy annexed, to the newly created Governatorato di Dalmazia, most of Dalmatia. In 1942 there were 4020 Italians in these newly annexed areas: 2220 in Spalato (Split), 300 in Sebenico (Sibenik), 500 Cattaro (Kotor) and 1000 Veglia (Krk). Furthermore there were in the Governatorato 10000 Italians who took the Yugoslav citizenship after WWI, in order to remain there and be accepted without problems by the new Yugoslavian regime after the fall of the Austro-Hungarian Empire. After WWII Italy lost all the territories in Dalmatia, and more than 22000 Dalmatian Italians exiled mainly in Italy. There are still some Dalmatian Italians in Dalmatia: 300 in Croatia and 500 in Montenegro. In Zara the small Dalmatian Italian community only in September 2012 has been allowed to have a kindergarten for Italian speaking children That means that in only one hundred years (from the 1850s to the 1950s) the Dalmatian Italians decreased from 45000 in the 1857 Austrian Census to less than one thousand in the last Croatian and Montenegrin Census. ==Cultural Influence== The cultural influence from the Italian peninsula has been extremely important in Dalmatia since the Roman times. During the times of the Republic of Venice and the Italian Renaissance it dominated the area. The \"British Encyclopedia\" states that: \"the monuments left in Dalmatia by the Romans are numerous and precious. They are chiefly confined to the cities; for the civilization of the country was always urban, just as its history is a record of isolated city-states rather than of a united nation. Beyond the walls of its larger towns, little was spared by the barbarian Goths, Avars and Slavs; and the battered fragments of Roman work which mark the sites of Salona, near Spalato, and of many other ancient cities, are of slight antiquarian interest and slighter artistic value. Among the monuments of the Roman period, by far the most noteworthy in Dalmatia, and, indeed, in the whole Balkan Peninsula, is the Palace of Diocletian at Spalato. Dalmatian architecture was influenced by Constantinople in its general character from the 6th century until the close of the tenth. The oldest memorials of this period are the vestiges of three basilicas, excavated in Salona, and dating from the first half of the 7th century at latest. Then from Italy came the Romanesque. The belfry of S. Maria, at Zara, erected in 1105, is first in a long list of Romanesque buildings. At Arbe there is a beautiful Romanesque campanile which also belongs to the 12th century; but the finest example in this style is the cathedral of Trail. The 14th century Dominican and Franciscan convents in Ragusa are also noteworthy. Romanesque lingered on in Dalmatia until it was displaced by Venetian Gothic in the early years of the 15th century. The influence of Venice was then at its height. Even in the relatively hostile republic of Ragusa the Romanesque of the custom-house and Rectors' palace is combined with Venetian Gothic, while the graceful balconies and ogee windows of the Prijeki closely follow their Venetian models. In 1441 Giorgio Orsini of Zara, summoned from Venice to design the cathedral of Sebenico, brought with him the influence of the Italian Renaissance. The new forms which he introduced were eagerly imitated and developed by other architects, until the period of decadence - which virtually concludes the history of Dalmatian art - set in during the latter half of the 17th century. Special mention must be made of the carved woodwork, embroideries and plate preserved in many churches. The silver statuette and the reliquary of St Biagio at Ragusa, and the silver ark of St Simeon at Zara, are fine specimens of Italian jewellers' work, ranging in date from the 11th or 12th to the 17th century\". In the 19th century the first Dalmatian newspaper started in Zara. It was edited in Italian and Croat. It was called Il Regio Dalmata - Kraglski Dalmatin. It was founded and published by the Italian Bartolomeo Benincasa in 1806. It was printed in the typography of Antonio Luigi Battara. it was the first done in Croat language. The cultural influence from Italy is clearly seen in the planning of the main Dalmatian cities in the XIX/XX centuries. One of the best examples is Split/Spalato. In 1880 Antonio Bajamonti (the last Dalmatian Italian Mayor of Spalato under Austrian rule) made a plan centered on the \"Riva\", a seaside walkway full of palms based on the Italian Riviera. Even today the Riva (with cafe bars) is used by the locals to stroll in a typical Italian way from the \"Palace of Diocletian\" toward an old square called locally \"Pjaca\" (or square in venetian). Even in music the Italian influence was very strong in Dalmatia ==Perasto: an enduring example== An enduring example of the Italian cultural and historic presence in Dalmatia is the small town of Perast in coastal Montenegro. Perast was at its peak in the 18th century under the Republic of Venice, when it had four active shipyard. There was a fleet of around one hundred ships, and 1,643 residents. At that time the most beautiful buildings arose in this fortified town. Many ornate baroque palaces and magnificent dwelling-houses decorated the town of Perast. It was full of typical Venetian architecture.Citizens of the venetian Perasto (in that period the city had 1,600 citizens) became privileged in the Venetian Republic. They were allowed to trade with large ships and to sell goods without tax on the Venetian market, which made them very rich. As an example of the wealth of people from Perasto, at the end of 18th century they managed to collect 50,000 Venetian gold coins (about 200 kg of gold) in order to pay the famous Venetian constructor Giuseppe Beati to build them the highest campanile (55 m) on the East-Adriatic coast. Right in front of Perasto there are two small islands. St George with its small church from the 12th century and the artificial island \"Gospa od Skrpjela\" (in venetian Madonna dello Scarpello) with a very interesting legend. On the reef whose top was 1m above the surface of the water, people from Perasto had been throwing rocks and sinking old shipwrecks for 200 years, thus creating a plateau of 3,030 square meters, which they then built a church on. Along with the impression that the island gives with its architecture, for centuries the church received many gifts and now it is a type of gallery and treasury of various objects. Beside 68 oil on canvas works done by Tripo Cocolia (the most talented baroque painter on the East-Mediterranean coast during the 17th century), on the church walls there are 2,500 golden and silver votive tablets which people from the Cattaro area donated to the church, in order to avoid various human disasters. Perast had the privilege to keep the war-flag of the Venetian Navy in peace time (it was called \"La fedelissma Gonfaloniera\") . The sailormen of Perast were involved in the last battle of the Venetian navy, fought in Venice in 1797 . At the fall of the \"Serenissima\" Perast was the last city of the Repubblic to lower the Venetian flag. On 12 May 1797, the Republic of Venice ended. A few places in the Albania veneta for several months still remained loyal to the Venetian Republic: Perast was the last place of the Republic to surrender. On 22 August 1797 the Count Giuseppe Viscovich, Captain of Perast lowered the Venetian war-flag of the Lion of Saint Mark. He said the farewell words in front of the crying people of the city and buried the \"Gonfalon of Venice\" under the altar of the main church of Perast. The population has since decreased to 430 in 1910 and around 360 today. According to the \"Comunita' nazionale italiana del Montenegro\", in Perast there are 140 persons who still speak at home the original venetian dialect of Perasto (called \"veneto da mar\"), and call themselves in the census \"Montenegrins\". ==References== ==Further reading== * Diehl, Charles. La Repubblica di Venezia. Newton & Compton Ed. Rome, 2004 * Durant, Will. The Renaissance. MJK Books. New York, 1981. * Lane, Frederick. Storia di Venezia, Einaudi. Torino, 1978 * Manno, Antonio. I tesori di Venezia. Mondadori. Vercelli, 2004 * Martin, John Jeffries. Venice Reconsidered. The History and Civilization of an Italian City-State, 1297–1797. Johns Hopkins UP. New York, 2002. * Norwich, John Julius. A History of Venice. Vintage Books. New York, 1989. * Zorzi, Alvise. La Repubblica del Leone. Storia di Venezia Euroclub Ed. Milano, 1991 ==Related pages== * Dalmatia * Dalmatian Italians * Dalmatian maritime neolatin cities * Istrian-Dalmatian exodus * Italian language in Croatia * List of Italian place names in Dalmatia * Venice and Dalmatia * Albania veneta * Cattaro (Italian province) * Spalato (Italian province) * Zara (Italian province) * Italian irredentism in Dalmatia == Other websites == * * Disappearing of Italians in Dalmatia * Comunità Nazionale Italiana: official site * Società dalmata di storia patria (in Italian) * Fondazione scientifico culturale Eugenio Dario e Maria Rustia Traine (in Italian) * The article on Dalmatia from the British Encyclopedia of 1911 * Old postcards of Dalmatia Category:History of Italy Category:Dalmatia Category:Montenegro",
 "title": "Italian cultural and historic presence in Dalmatia"
}