{
 "id": "1147606",
 "text": "Liam Patrick Aiken (born December 24, 1989), is an American actor. He has starred in films such as Stepmom (1998), Road to Perdition (2002), and Good Boy! (2003), and played Klaus Baudelaire in Lemony Snicket's A Series of Unfortunate Events (2004), based on the series of books. He also starred in the films Nor'easter (2012), Ned Rifle (2014), The Bloodhound (2020), and Bashira (2021). == Filmography == ===Film=== Year Title Role Notes 1997 Henry Fool Ned 1998 Montana Kid 1998 Nathan 1998 Stepmom Ben Harrison 2000 I Dreamed of Africa Emanuele Gallmann (age 7) 2001 Sweet November Abner 2001 The Rising Place Emmett Wilder 2002 Road to Perdition Peter Sullivan 2003 Good Boy! Owen Baker 2004 Lemony Snicket's A Series of Unfortunate Events Klaus Baudelaire 2006 Fay Grim Ned Grim 2010 Johnnie Pappas 2012 Electrick Children Mr. Will 2012 Girls Against Boys Tyler 2012 Nor'easter Boy/Josh Green 2013 Munchausen Son Short film 2013 How to Be a Man Bryan 2014 Ned Rifle Ned 2015 The Frontier Eddie 2015 Weepah Way for Now Reed 2015 Let Me Down Easy Hezekiah Short film 2016 Like Lambs Charlie Masters 2017 The Emoji Movie Ronnie Ram Tech Voice The Honor Farm Sinclair 2020 The Bloodhound Francis 2021 Bashira Andy 2022 A Soldiers Heart Short film TBA Montauk J.R. previously called Kingfish it was slated to be released in 2021, but it hasn't been released ===Television=== Year Title Role Notes 1998, 2007 Law & Order Jack Ericson/Tory Quinlann 2 episodes 2002, 2009 Law & Order: Criminal Intent Robbie Bishop/Jason 2011 Milo 2013 Mad Men Rolo Episode: \"The Quality of Mercy\" 2018 I'm Dying Up Here Howard Episode: \"Plus One\" ===Stage=== Year Title Role Notes 1997 Bobby Helmer Belasco Theatre ===Video games=== Year Title Role Notes 2004 Lemony Snicket's A Series of Unfortunate Events Klaus Baudelaire Voice ==Awards and nominations== Year Award Category Result Work Notes 1999 Young Artist Award Best Performance in a Feature Film - Young Actor Age Ten or Younger Stepmom 2003 Young Artist Award Best Performance in a Feature Film - Supporting Young Actor Road to Perdition 2004 Young Artist Award Best Performance in a Feature Film - Leading Young Actor Good Boy! 2005 Young Artist Award Best Performance in a Feature Film - Leading Young Actor Lemony Snicket's A Series of Unfortunate Events Critics Choice Award Best Young Actor ==References== ==Other websites == * * * Category:1989 births Category:American movie actors Category:American stage actors Category:American television actors Category:Living people",
 "title": "Liam Aiken"
}