{
 "id": "114739",
 "text": "The Italian language is the third most spoken language (after Croatian and Serbian) in the Republic of Croatia today. It is an officially recognized minority language in Istria County (where it is spoken by 7.69% of the population). ==Speaker Population== The 2001 census in Croatia reported 19,636 ethnic Italians in the country (some .44% of the total population). Ethnologue reported 70,000 speakers in 1998: 40,000 ethnic Italians and 30,000 ethnic Croats and Istrian people. Native Italian speakers are largely concentrated along the Adriatic coast. In addition, roughly 120,000 Italian tourists visit Croatia each year, so many in the service and tourist industries have some knowledge of the language.As the 3/4 of the Italian community is concentrated in Istria, according to Ethnologue's estimates ( 70.000 ), at least 20% of the population of Istria is Italian mother tongue, although many simply declare themselves as Istrian. Historically, the language had a much larger population than it does now. Italians have lived on the Adriatic coast for hundreds of years, and Istria was part of the Kingdom of Italy from 1919 until 1947. However the Istrian exodus after the Second World War and Yugoslavian ethnic cleansing in the form of the Foibe massacres forced the greater part of the Istrian Italians to flee to Italy. During the Italian exodu, about 350000 people left Istria, Dalmatia and the isles of Croatia. ==Italian in Use== Government services are provided in Italian and Croatian in Istria County, including the official government website (which is also available in English). There are four Italian-language schools in Istria: primary schools in Buje (Buie) and Novigrad (Cittanova) and secondary schools in Pula (Pola) and Rovinj (Rovigno). == Related pages == * Dalmatian Italians * Italian cultural and historic presence in Dalmatia * Istrian-Dalmatian exodus * List of Italian place names in Dalmatia ==References== *Ethnologue Report for Italian *Region of Istria Official Website *Republic of Croatia Central Bureau of Statistics Category:Languages of Croatia",
 "title": "Italian language in Croatia"
}