{
 "id": "1147659",
 "text": "The murder of the Faruqis took place on May 27, 1986, at their home in Wyncote, Pennsylvania, United States. Isma'il Raji al-Faruqi, an important Muslim thinker, and his wife, Lois Lamya' al-Faruqi, an art teacher known for studying music, were both killed in an attack that brought much notice. Alt URL Their daughter, Anmar el-Zein, who was eight months with child, lived through stab wounds and was able to call for help. She said the attacker was a strong man with a black cloth tied in a \"cowboy-robber\" way. Ismail al-Faruqi was a well-known professor of religion at Temple University. He was known for his works in Islamic studies and his efforts to encourage talks between different faiths. Lois Lamya al-Faruqi was an expert on Islamic art and music. She co-wrote The Cultural Atlas of Islam with her husband and made important contributions to studying Islamic music. Their work helped many students and teachers in their field. James Zogby, who studied under al-Faruqi, said al- Faruqi loved deep conversations, often staying up late into the night discussing important topics. Because al-Faruqi was well-known, the Cheltenham Township Police, with help from the FBI, looked into the case. The event started talks about reasons, from political payback for al-Faruqi's strong words on the Israeli-Palestinian conflict to personal anger. ==Crime and investigation== On the night of May 26, 1986, Ismail al-Faruqi went to a meal to break the day’s fast. He went with a group from the Muslim Students Association (MSA). He came back home around 11:00 PM. Early on May 27, 1986, al-Faruqi and his wife were found with many knife wounds in their home. Alt URL Al-Faruqi’s body was found in his bedroom. His wife, Lois Lamya, was found at the bottom of the stairs. Their daughter, Anmar el-Zein, was 27 years old and eight months into having a baby. She was also hurt with a knife but was able to call for help. She needed 200 stitches for cuts on her chest and arms. A 15-inch knife was found near al-Faruqi's body. Police said this was the knife used. The place showed signs of a break-in. There were signs of a fight, too. The Cheltenham Township Police led the investigation into the case. The FBI helped because al-Faruqi was well-known. Anmar el-Zein said the attacker was a strong black man. He had a \"big belly\" and wore a black cloth on his head. At first, people thought the killings might have been for political reasons. Al-Faruqi was known for strong words on the land fight between Israel and Palestine. He also worked with a group to help Arabs in America. Hafez Malik, a teacher and friend of al-Faruqi, said that al-Faruqi often spoke of danger. “He told me he was sure of it,” Malik said. “His life was always in danger.” ==Legal proceedings== ===Arrest and charges=== In January 1987, Joseph Louis Young was named the main suspect. He was also known as Yusuf Ali. Police found a bloody glove at the crime scene. His fingerprint was on the glove. This led to his arrest. Police also found a stolen 1986 grey Honda Accord LX. There were bloodstains in the car. These stains gave more proof. This proof linked the crime to Young. Detectives in Montgomery County got a phone call, but the caller did not say their name. They told the detectives about fingerprints. There were fingerprints at the crime scene. The caller said to check them. They suggested matching them with Young’s fingerprints. The fingerprints were checked and they matched Young's fingerprints. This made Young a suspect. According to a police source, Young's statement to police indicated that the slaying of al-Faruqi may have been politically or religiously motivated rather than a random act of violence. The source stated that Young believed al-Faruqi was \"not doing the right thing for the Muslim religion.\" Young reportedly knew al-Faruqi through the Islamic community at Temple University and had been planning the murder \"for some time.\" Young, who had a criminal history and knew the al-Faruqi family, confessed to the crime during questioning by Philadelphia detectives, providing information that matched the evidence. He repeated his confession in the presence of Montgomery County police officers. ===Trial=== The trial of Joseph Louis Young started in July 1987. At the trial, the prosecution showed strong proof. They linked Young to the crime. His fingerprints were on a glove found at the scene. The only living witness, Anmar el-Zein, told about the terrible night. The defense said Young’s confession was forced. They suggested he may have had help. They argued he was very upset. This raised questions about his mind at the time of the crime. On July 10, 1987, the jury found Joseph Louis Young guilty. He was charged with two counts of first-degree murder for killing Isma'il and Lois Lamya al-Faruqi. The jury also found him guilty of attempted murder, burglary, trespassing, and serious assault. After a separate sentencing hearing, the jury decided on death for each murder conviction. They said the serious factors were stronger than any reasons to lessen the sentence. ===Appeals and resentencing=== Young's first appeal kept his convictions but sent the case back for resentencing because of problems with the original sentencing instructions. In 1990, a resentencing hearing was held. Again, the jury gave a death sentence for each murder conviction, agreeing there were four serious factors. ==Funeral and burial== On May 30, 1986, nearly 4,000 people, including international dignitaries, gathered at the Masjid Muhammad mosque in West Philadelphia to honor al-Faruqi and his wife, Lois. Speakers remembered al-Faruqi as a significant figure in the community. Imam Shamsud-din Ali led the funeral prayers. The mosque was attended by friends, associates, and community members, many in traditional attire. The service included Arabic sayings, prayers, and readings from the Qur'an. Many students and local community members were present. Following the prayer service, the Faruqis were buried together at Forest Hills Cemetery in Lower Moreland Township, Pennsylvania. ==Aftermath== Young died in prison in 1996 before he could be executed. People still debated the reasons for the murders. Some believed it was a political killing due to al-Faruqi’s work, while others thought it was a personal act. The case received much media attention, and the National Council of Churches' Committee on Christian-Muslim Relations expressed \"great sorrow\" over the deaths, sending condolences to the Faruqi family and the global Muslim community. A year after the murders, the rest of the Faruqi family sold their home and moved away. In 2011, the house was put up for sale again, and people talked about its violent past. Al- Faruqi's work still shapes Islamic studies and talks between faiths. His writings are an important part of talks on Muslim identity and rights in the U.S. His support for Palestinian matters and his part in groups like the American-Arab Anti-Discrimination Committee have had a lasting effect on how Islam is discussed in schools and politics in America and other places. At a meeting at the International Islamic University Malaysia in 2008, it was shared that al-Faruqi's father had prayed for him to become a great teacher and to die as a martyr, which came true. ==References== Category:Assassinations in the United States Category:American murder victims Category:1986 deaths",
 "title": "Murder of the Faruqis"
}