{
 "id": "1147736",
 "text": "Attilio Ferraris (; 26 March 1904 - 8 May 1947) was an Italian footballer who played as a defensive midfielder. Known for his incredible athleticism and combative qualities on the pitch with his ability to man-mark opponents. Regarded as one of the greatest defensive midfielders of all time. ==Club career== He began his career in Fortitudo, on the field of the Pius IX Institute, in Castel Sant'Angelo, under the guidance of Brother Porfirio. On July 22, 1927, from the merger of Fortitudo itself with the Alba Audace and Roman clubs, AS Roma was born, and Ferraris became the first captain in its history. He was always a protagonist by fielding elegant plays accompanied by competitive malice, without ever going off the rails of fairness and sportsmanship. Beloved by the fans, once, when he got hurt, so many people came that the doorman of the building put up a sign where the floor where Ferraris was written, and a fan at the entrance had to be in charge of regulating the traffic of visitors in and out. In total with the Giallorossi he played 198 games, scoring twelve goals, playing as a wing-back, full-back or even as a midfielder. Together with his friend Fulvio Bernardini he formed an unforgettable couple of the Roma of Campo Testaccio. The words with which he decided to give him the captain's armband remained famous: \"A Fu' tu sei er mejio: er capitano fallo tu ...\", also testimony to his temperament as a true Roman as well as a Roma supporter. He had a character not very inclined to discipline, he was a man of refined tastes, refined in dress, a lover of women, a lover of high-powered cars and, above all, with a relentless habit of gambling. A game that sucked in him, without remorse on his part, much of the money earned with football. \"If I still had the money I lost at poker, horses and dogs, but you know how much money I would still play!!\", he often said with laughter. His habits were not very reconciled with the role of footballer; he often skipped training. President Sacerdoti often had to protect him from the outbursts of the Roma coaches; He even helped him open a pool bar in his neighborhood. Then, when he showed up late for the umpteenth time to a league match, the measure was full and Ferraris IV was put out of the squad. At 30, his career as a footballer seemed seriously compromised and the indomitable \"Tilio\" started on the boulevard of sunset. He was relieved of that smoky and anonymous whirlpool by the coach of the national team who went to look for him personally in his bar, finding him with a billiard cue in his hand and yet another cigarette in his mouth. He snatched from him the promise to stop smoking and try to prepare for the World Cup. He succeeded: he trained with a zeal and dedication that had never been recognized before and with the national team he became World Champion. His unexpected rebirth at the 1934 FIFA World Cup relaunched his career and Lazio president Gualdi wanted him so strongly that he offered 150,000 lire to wear him in blue and white. Roma accepted the money and so Attilio went by surprise to Lazio, where he played 39 games. However, the Biancocelesti period was short and after two years he was sold to Bari. With the Apulians he signed 54 appearances in two seasons, then in 1938 he returned to his Roma, and finally ended his professional career in Catania, where he was hired in winter signings, also holding the role of coach when the Hungarian coach György Orth resigned. Later he wore the Elettronica jersey, playing until the age of forty. His famous oath that, before entering the field, he imposed on the new Giallorossi. With the ball in their hands they had to recite with him: \"Chi da' 'a lotta desiste, fa 'na fine mooorto triste, chi desiste' da' 'a lotta è 'n gran fijo de 'na mignotta!\". ==International career== He was the first Roma player to wear the Italian national team shirt: he made his debut in 1926, on the occasion of Italy-Switzerland (3-2). Also in 1928 he was part of the team that won the bronze medal at the Olympic Games in Amsterdam. His unruly life, dedicated to cigarettes and gambling, had caused his exit from the blue circle and also from his club team, undermining his qualities as a great fighter. Surprisingly, when he was already mentally and athletically a former player, the Commissioner of the national team Vittorio Pozzo, who knew his qualities, gave him confidence and called him up for the 1934 World Championship to be held in Italy. So, fished out and refurbished thanks to the ferocious application, he showed up at the training camp on Lake Maggiore in dazzling physical condition, becoming one of the bulwarks of the Italian team. Initially started as a reserve, he was called into question in the replay of the quarter-final match against Spain to replace (then playing until the end of the tournament) Pizziolo, who in the first game had fractured his leg (from the same game they had come out battered and exhausted and Schiavio and Ferrari also did not play in the replay). Deployed in the role of inside right, he was the protagonist of a great performance, dragging his teammates with his competitive charge. He never left the starting eleven, reaching the final in Rome where he became world champion. In November 1934 he was among the \"Lions of Highbury\" most praised by the British press in the post-World Cup match in the London stadium, lost by the Azzurri 2-3 against the \"English masters\". At the end of the first half, with the team down 0-3 and outnumbered by Monti's injury, Ferraris, with the charisma that was his usual one, spurred his teammates to bring out their grit and pride. In the second half, together with Meazza, he dragged the Azzurri into a comeback that was not completed by a whisker. ==Death== He died in Montecatini on May 8, 1947, on a football field, during a match between old glories. His tomb at the monumental cemetery of Verano bears the tombstone of Attilio Ferraris – World Champion. At the funeral on his coffin there was the shirt of Bernardini's national team: in vain they looked for one of Attilio's, and not finding it it was his fraternal friend who handed his own. ==Honours== Italy *FIFA World Cup: 1934 *Central European International Cup: 1927–30; Runner-up: 1931–32 *Summer Olympics: Bronze Medal 1928 Individual *FIFA World Cup Team of the Tournament: 1934 *A.S. Roma Hall of Fame: 2013 ==References== ==Other websites== * Category:1904 births Category:1947 deaths Category:Association football players who died while playing Category:Footballers from Rome Category:Italian footballers Category:Association football midfielders Category:AS Roma players Category:SS Lazio players",
 "title": "Attilio Ferraris"
}