{
 "id": "1147949",
 "text": "Lorenzo Fernández (May 20, 1900 – November 16, 1973), nicknamed El Gallego (The Galician), was a Spanish-born Uruguayan footballer. During his career, he played for Capurro, River Plate, Montevideo Wanderers FC and C.A. Peñarol. Fernández also played 31 times and scored 4 goals for the Uruguay national football team, with which he won the 1930 FIFA World Cup, the gold medal at the 1928 Summer Olympics, and the 1926 and 1935 Copa Americas. A center-half in the 2–3–5 footballing system, he once replaced Pedro Cea as an inside-left forward against Peru during a match in 1929 South American Championship and went on to score a hat-trick. The 1.73-metre-tall Fernández, known as el Gallego and el Patrón, was a very defensively strong, but technically endowed, powerful and mentally strong player, who was mainly at home in the midfielder position. Luciano Álvarez describes Fernández as a son of the port, where he worked as porters with his father and numerous brothers. He was someone who didn't understand much fun, had no sense of humour and played football just as seriously as he lived. In addition, he is described as spirited, courageous but also a bit simple and naïve. The masseur of Nacional, Juan Kirschberg, once said that whenever he massaged Fernández, he had the impression that he was massaging a lamppost. Fernández's legs were like muscle masses braided from iron. Considered as one of the best world's half-backs in his prime. Known for his power, leadership, bravery and courage on the field, as well as his enormous energy. ==Club career== Fernández started at Capurro, a team created by his family, joining the adult team in 1915. His muscles and indomitable spirit developed in the work of dockworker (also adopted by his brothers) in the port of Montevideo, a trade that for the time required greater physical strength, with a lot of manual activity. He and his family lived on the outskirts of the port to be in readiness for the need for service, earning an extra five cents an hour at night. Capurro was provisionally dissolved and in 1918 Fernández played for the first Uruguayan River Plate, dissolved in 1925. He returned to Capurro, playing from 1919 to 1922. In 1923, he played for Montevideo Wanderers, as part of the 1923 Uruguayan champion campaign of the alvinegros, but soon returned to Capurro. Capurro would only debut in the Uruguayan elite in 1927, but Fernández debuted for the Uruguayan national team in 1925. In 1927, he was loaned to Nacional for a tour of Central and North America, which included victories over the Mexican national team (3-1 and 9-0, in which he scored a goal) and also over the Spanish national team (8-1). Still as a Capurro player, he played in the 1928 Olympics. After the Olympics, Fernández joined rival Peñarol, the club of his heart. There he formed from that year on a trio of midfielders called Cortina Metálica, along with Gildeón Silva and Álvaro Gestido. Along with Gestido, he would be the only black and white starter of the national team in the final of the 1930 FIFA World Cup, the same number of players provided by Bella Vista. Peñarol had sparked a schism in the 1920s, withdrawing from the Uruguayan association recognized by FIFA. The schism lasted until 1926, but black and white players were deprived of the national team for some time. The trio with Silva and Gestido was formed in 1928, when Fernández arrived as a starter, as a central midfielder. The team was champion, in addition to drawing 1-1 with Barcelona, with Fernández being the only one of the three present. He was also the top scorer. In 1929, with him as a starter, the Uruguayan championship was obtained twice and also the Río de la Plata Cup, in a tie with the Argentine champion, defeating Huracán, where Guillermo Stábile played, 3-0. Fernández played more offensively, playing in the right midfield, and scored two goals. The Cortina Metálica trio lasted until 1932. Of the championships in dispute held until then, Peñarol was only not champion in 1931. In 1932, the Uruguayan title campaign included Peñarol's victory in the first classic with Nacional of the professional era. El Gallego scored the first goal, in a 2-0 victory. The goal came in a strong low shot, with Fernández breaking away from the marking in a table with Luis Mata. With five minutes to go, the play was reversed, with Mata shooting hard after receiving from Fernández, in a pass that left Mata in a good position in front of goal. Peñarol was also a finalist in 1933, when Silva was no longer part of it and with Gestido starting to compete for the position of central midfielder with Fernández; Ereb Zunino had replaced Silva on the right flank, while the left was alternated between Nicolás Riccardi and Galileo Chanes. Rival Nacional finished champion. The situation was repeated in 1934, with the same lineup of the trio of midfielders and the title being the rival's. Gestido established himself in the position of central midfielder in 1935, the year in which Fernández was definitively removed from the squad due to disagreements with the directors. Despite the controversy and economic difficulties, Peñarol was champion again. Fernández joined the new Uruguayan River Plate, created in 1932 through the merger of the \"family club\" Capurro with Olimpia. El Gallego played for River on the team's tour of France, initially stopping playing at the end of the trip. He returned in 1938, for two more seasons, this time at Defensor. ==International career== Fernández made his debut for the Uruguayan national team on 18 July 1925, the date of a 1–0 loss to Paraguay in Montevideo for the Bossio Cup. He was still a player for Capurro, a club founded by his family, and the debut came even though the team only debuted in the first division in 1927. Uruguay missed the 1925 Copa América, returning to participate in the tournament in the 1926 edition, in which Fernández only played in the 2–0 win over Chile. The country was champion. In the 1927 edition, Uruguay was runner-up, but with Fernández in the starting lineup. The runner-up was enough to qualify La Celeste for the 1928 Olympics. Still as a Capurro player, Fernández was part of the squad called up for the Olympics. However, he had to miss the second final against Argentina, necessary after a 1-1 draw in a first game, after 90 minutes and extra time. This initial match was marked by a bitter duel of their own between Fernández and Argentine captain Luis Monti. In the end, Fernández could only walk and was ruled out for the second game. His place was taken by Juan Píriz, but his absence was initially not credible by the Argentines, who, imagining that the news was untrue and part of a psychological plot in favor of the Uruguayans, even used spies to confirm it. When their absence was confirmed, the Albiceleste would have thought they were already champions. A year later, Fernández played in the 1929 Copa América, this time with the Uruguayans finishing runner-up to the Argentines. The midfielder stood out especially in a 4-1 win in Paraguay, in which he scored the first three goals. They were enough to make him the second top scorer in the competition. In his time with the national team, El Gallego scored only one other time. That same year, the two-time Olympic champion country was chosen by acclamation to host the following year's first FIFA World Cup. In the competition, Fernández was considered the Uruguayan player who took his most seriously, which inspired several jokes from his own teammates in the concentration. There were so many that at one point El Gallego, exhausted, even packed his bags to leave, being dissuaded from the idea of the occasion when he was surrounded by his companions. He gave up leaving, which did not stop him from protesting against the mockery. During the break for the break of the final, in which the Uruguayans were losing 2-1, he would have said to his teammates: \"if we lose this final, I'll kill you all\", to which captain José Nasazzi would have added \"El Gallego kills them and I bury them\". In the second half, La Celeste won 4-2. Fernández was considered exactly the ideal complement to Nasazzi, who led the defense while Fernández led the midfield. Another interaction between them became famous, in another final against the Argentines, in the 1935 Copa América. It was the first edition of the Copa América held since 1929, also marking the first reunion between the main players of Argentina and Uruguay since the breakdown of relations that occurred due to the final of the 1930 World Cup. In the final game between them in 1935, Fernández would be sore stretched out on the pitch, at which Nasazzi approached him and asked him: \"what are you going to say in Montevideo when you know that El Gallego was a coward?\" Fernández then soon got up to continue playing. The Uruguayans did not have a good start to the championship, unlike their rivals, who, however, ended up losing 3-0 in the final game. It was this episode that gave rise to the mystical expression of the \"garra charrua\" to refer to moments of overcoming Uruguayan football. Curiously, the celestial color on that occasion had given way to the red shirt, accompanied by white shorts, a combination that would become a traditional reserve uniform of the national team. The result uncontrolled opponent Herminio Masantonio, the competition's top scorer, who exchanged punches with several Uruguayans, especially Fernández. Both would later reconcile, with Fernández traveling in 1953 to visit him on the deathbed of Masantonio, who had contracted tuberculosis, asking him \"you, who have never slackened, do not go slack me now!\". That 1935 final was fought on 27 January of that year, in what was Fernández's farewell to the national team. There were a total of 31 matches and four goals scored. The previous year, La Celeste had refused to participate in the 1934 FIFA World Cup in Italy, in retaliation for the long absence of European teams in the 1930 edition. To this day, it was the only time that the champion of the previous tournament did not defend the title. ==Honours== * Atlético Wanderers ** Federación Uruguaya: 1923 * Peñarol ** Uruguayan Primera División: 1928, 1929, 1932 & 1935\\. ** \"La Tribuna Popular\" Trophy: 1932 ** José Piendibene Cup: 1929 ** Mirurgia Cup: 1928 ** Ricardo Pittaluga Cup: 1928 ** Copa Aldao: 1928 ===International=== * Uruguay ** South American Championship: 1926 Winner, 1935 Winner ** FIFA World Cup: 1930 Winner ** 1928 Summer Olympics: 1928 Gold Medal ** Copa Newton: 1929 & 1930 Winner ** Copa Lipton: 1927 & 1929 Winner ===Individual=== * IFFHS Uruguayan Men's Dream Team (Team B) ==References== ==Other websites== * 1928 Summer Olympics Final * * National Appearances * Part of Uruguays \"Iron Curtain\" Defence * Category:1900 births Category:1973 deaths Category:Footballers from Redondela Category:Uruguayan men's footballers Category:Uruguay men's international footballers",
 "title": "Lorenzo Fernández"
}