{
 "id": "1147206",
 "text": "The Federal Detention Center (FDC) in Miami, Florida is an administrative- security federal prison. It is operated by the Federal Bureau of Prisons (BOP). Its address is 33 NE 4th Street in downtown Miami. The prison mainly has male and female inmates waiting for trial or sentencing. It also has inmates who are serving short sentences. ==Facility overview== Security Level: Administrative, accommodating inmates of all security levels. Population: Approximately 1,086 inmates. Management: Operated by the BOP, a division of the U.S. Department of Justice. Programs and Services: Educational Programs: Mandatory literacy, GED, and English-as-a-Second Language (ESL) courses. High school diplomas and post-secondary degrees are available through paid correspondence programs. Health Services: Comprehensive medical care, including sick calls, dental services, and emergency treatment. Psychology Services: Crisis intervention, individual counseling, and specialized programs addressing mental health needs. Recreation: Various recreational activities, including organized sports, wellness programs, and hobby crafts. ==Visitation information== Visiting Hours: Visitation schedules vary based on the inmate’s housing unit. Generally, visitation is available on weekends and federal holidays between 7:00 a.m. and 9:00 p.m. Procedures: Visitors must be approved and are subject to security protocols, including dress codes and identification requirements. ==Notable incidents== In June 2018, a guard was sentenced for his role in a $9 million fraud scheme involving contraband smuggling. In November 2017, an inmate was sentenced for orchestrating a $9 million fraud scheme from within the facility. In June 2024, residents of a nearby apartment complex reported disturbances due to the facility’s proximity, including noise and inappropriate behavior from inmates. For more detailed information, including inmate services and contact details, please visit the official BOP website. ==References== Category:Prisons in the United States",
 "title": "Federal Detention Center, Miami"
}