{
 "id": "1147051",
 "text": "Indian is a 1996 Indian Tamil-language movie directed by S. Shankar. The movie stars Kamal Haasan in a double role, playing both a freedom fighter named Senapathy and his son, Chandru. The story is about Senapathy, a former soldier in the Indian freedom struggle, who becomes a vigilante fighting against corruption in modern-day India. The movie also stars Manisha Koirala, Urmila Matondkar, and Goundamani. A. R. Rahman composed the music, which became very popular. In the movie, Senapathy uses traditional martial arts to bring justice to people and punishes corrupt officials. Meanwhile, his son, Chandru, is also involved in some illegal activities. This creates a conflict between father and son, which becomes a key part of the story. Indian was a big success at the box office and won several awards, including three National Film Awards. Kamal Haasan won the National Film Award for Best Actor for his role. The film's story, action scenes, and music were praised by critics and audiences. The movie was partially reshot in Hindi as Hindustani. It became popular not only in Tamil Nadu but also across India. It spawned two sequels Indian 2 which released in 2024 and Indian 3 which is set to release in 2025. == Cast == * Kamal Haasan as Senapathy (Indian) and Chandrabose (Chandru) * Manisha Koirala as Aishwarya (Voice dubbed by Rohini) * Urmila Matondkar as Sapna (Voice dubbed by Bhanupriya) * Sukanya as Amrithavalli * Manorama as Kuppamma ** Aruna Irani as Gulabo (Hindi version only) * Goundamani as Subbaiah * Senthil as Panneerselvam * Nedumudi Venu as Krishnaswamy IPS (Voice dubbed by Nassar) * Kasthuri as Kasturi * Nizhalgal Ravi as a corrupt doctor * Ajay Rathnam as a freedom fighter * Ponnambalam as \"Kada\" Kumar * Bala Singh as Treasury department officer * Chokkalinga Bhagavathar * Omakuchi Narasimhan as a lorry driver * Crazy Mohan as Parthasarathy * Vikram Dharma * Kovai Senthil as a customer * Mahanadi Shankar * S. V. Venkatraman in a special appearance Category:Indian movies Category:Tamil-language movies Category:1996 movies",
 "title": "Indian (1996 movie)"
}