{
 "id": "1147250",
 "text": "On 8 November 2024, a series of organized antisemitic attacks * * * * * * * * * happened in Amsterdam, the capital of the Netherlands, following an UEFA Europa League match between the Israeli club Maccabi Tel Aviv and AFC Ajax. ==Events== Hundreds of people, many of whom were Jewish Maccabi fans, were attacked across Amsterdam on 8 November 2024. * * * * * Some victims were chased with knives, tossed into the canal or run over by vehicles. * * * The Washington Post released a video of a man being chased by rioters outside the Amsterdam Central Station, while the Amsterdam police confirmed that hit-and- run assaults on Israelis occurred across Amsterdam. * * * Before the attacks, Maccabi fans purportedly came into conflict with local Muslims when some of them were accused of taking down Palestinian flags and chanting slogans alleged to be anti-Arab. * * * Accusations of Israeli Maccabi provocations were predominantly reported by the Qatari state-affiliated media Al Jazeera * * * * * * and Middle East Eye. * * * * * Multiple videos surfaced, one of which showed a victim lying unconscious while being kicked repeatedly by rioters. * * * * Another video showed a victim being tossed into the canal and called a kankerjood (Dutch: \"Cancer Jews\"). Rioters were also filmed shouting \"Jewish, Jewish, IDF, IDF\" when they allegedly identified Israelis in public. * * * ==Aftermath== At least 30 persons were injured, while 62 suspects were arrested. * * * * * Amid international condemnation, the Amsterdam mayor announced a three-day ban on demonstrations.* * * * * Riot police were seen patrolling various locations. Of all the arrestees, only four remain in custody, who were charged with assault against an \"unknown person\" or police. The police called on the public to supply evidence and anyone involved to turn himself or herself in. As per the Netherland's National Coordinator for Security and Counterterrorism (NCTV), the riot appeared to have been preplanned on Telegram, * * * * * * contrary to claims that the riot was caused by Israeli misbehavior. Some Israelis hid in the Holland Casino during the riot, whose internal investigation found one of its security guards to have been active in a relevant Telegram group. Due to safety concerns over reports of taxi drivers collaborating with rioters, Rabbi Akiva and Taiby Camissar of the Hasidic Jewish group Chabad in Amsterdam organized cars to bring Israelis to their hotels or the airport for boarding repatriation flights. ===Post-riot events=== A pro-Palestinian group tried to protest in central Amsterdam on 10 November 2024 in defiance of the three-day demonstration ban, with several members being arrested. * * * * * On 11 November 2024, pro-Palestinian groups clashed with riot police in central Amsterdam. Antisemitic slurs like kanker joden (Dutch: \"Cancer Jews\") were reportedly heard and a tram was set on fire. De Telegraaf, a Dutch newspaper, said that a bystander was grabbed from his bike and beaten, while the police claimed to have arrested over 50 people. Simultaneously, the Belgian police arrested five people who reportedly called for similar acts in Antwerp. ==Reactions== ===Domestic=== ====Government==== Dick Schoof, the Dutch prime minister claimed to be \"horrified by the antisemitic attacks on Israeli civilians.\" Schoof also said that he would skip the COP29, a climate summit to be held in Azerbaijan, due to the attacks' \"major social impact\". Femke Halsema, the Amsterdam mayor, described the riot as a \"terrible moment\" for Amsterdam. * * * * * * Peter Holla, the Amsterdam police chief, said that Israelis had been \"outrageously abused\", but that his colleagues had difficulty acting against \"flash moments [that] spread throughout the city\". The Dutch government was investigating whether prior warnings had been ignored. * * * ====Monarch==== Willem-Alexander, the King of the Netherlands, reportedly said: ====Civil society==== In an article in The Jewish Chronicle, Uri Rosenthal, a Dutch political scientist, believed the riot to be a \"final wake-up call\" that the Dutch government had been too weak on anti-Jewish hate crimes. Despite the controversy surrounding the cause of the riot, there has yet to be sufficient evidence that the victims were the same individuals responsible for the alleged provocations. In addition, the Amsterdam police have been criticized for insufficient policing. ===International=== ====Israel==== Benjamin Netanyahu, Prime Minister of Israel, classified the riot as a \"pogrom\" comparable to the Kristallnacht that erupted in Nazi Germany and Nazi-occupied Austria on 9 November 1938, * * * * * * asking for swift actions against the rioters. The Kristallnacht comparison was echoed by media and advocacy groups. * * * * * * * * * * * ====European Union==== Ursula von der Leyen, President of the European Commission, emphasized that the riot constituted \"vile attacks\" and that \"antisemitism has absolutely no place in Europe.\" Annalena Baerbock, the German Foreign Minister, called the riot \"horrific and deeply shameful.\" ====United Kingdom==== Sir Ephraim Mirvis, Chief Rabbi of the UK and Commonwealth, called the rioters \"hateful mobs\". The Sky News deleted a report claiming Israeli fans to be \"notorious for their racism and physical violence\" amid criticism. Its editors said that they \"could not independently verify all of the footage\". ====United States==== Joe Biden, President of the United States (POTUS), condemned the riot as \"antisemitic\", \"despicable\" and \"echo[ing] dark moments in history when Jews were persecuted\". * * * * * ====Palestine==== Sami Abu Zuhri, a Hamas official, considered the riot in Amsterdam as spontaneous repercussions of Israel's continued \"massacres\" in Gaza in which international interventions were insufficient. ====Advocacy groups==== Several media and advocacy groups compared the riot to the Kristallnacht that erupted in Nazi Germany and Nazi- occupied Austria on 9 November 1938, despite differences in severity. The Yad Vashem expressed deep concern and solidarity with the victims. The United States Holocaust Memorial Museum (USHMM) also strongly condemned the attacks as \"vicious\", \"antisemitic\" and \"outrageous\". The statement also highlighted that the riot came right before the 86th anniversary of the Kristallnacht, \"when Jews throughout Nazi Germany were systematically attacked [...] fellow citizens looked on.\" The World Jewish Congress (WJC) strongly condemned the violence towards the Jewish Maccabi fans, while the European Jewish Congress (EJC) condemned the riot as \"horrific\", demanding \"all necessary measures to protect Jews and Israelis\". ====Others==== In an article in The Atlantic magazine, writer Franklin Foer called the riot \"a textbook example of a pogrom\" based on the presence of \"mobs chasing Jews down city streets, goons punching and kicking Jews\". In an article in The New Statesman magazine, progressive journalist Tanya Gold called the riot the \"first anti-Jewish riot in Western Europe of the 21st century\". In an article in The Jewish Chronicle, Marc Cave, Director of Britain's National Holocaust Centre and Museum, objected to classifying the riot as a \"pogrom\" on the following grounds: * Nobody lost his or her life * It would be offensive to the memory of Nazi Germany's victims * It has not resulted in an ethnic cleansing * Exaggeration does not help combat antisemitism In contrast, influential * * * Marxist platforms Socialist Worker and World Socialist Web Site (WSWS) blamed the Israelis for the riot, denied the presence of antisemitism and accused Western government officials of \"backing the Zionist regime\". ==Related pages== * Pogrom * Anti-Zionism * Antisemitism * Islamophobia * Israel–Hamas war * Arab- Israeli conflict ==References== Category:2020s in the Netherlands Category:2020s riots Category:2024 in Europe Category:Antisemitism Category:Football Amsterdam attacks Category:Racism Category:Riots in Europe Category:Violence in sports",
 "title": "November 2024 Amsterdam attacks"
}