{
 "id": "1147446",
 "text": "The Mughal–Uzbek Wars is a series of Millitary engagements between the Timurid Empire, Later Mughals supported by Safavid Empire till 1512 and the Khanate of Bukhara. It Began in 1497 with Babur desire to conquer his ansectoral land of Samarkandin which he was somewhat successful but the suffered heavy reverses first by Sultan Shaibani of Khanate of Bukhara and then by Sultan Ubaid-Ulahb Khan of Khanate of Bukhara even tho getting support from Safavid Empire both were unsuccessful in crushing Khanate of Bukhara. In 1588 Sultan Abdullah Khan II attacked the Mughal territory of Herat and captured it. Akbar himself laid his army at Kabul to face Abdullah Khan after a Siege of a year Akbar and Abdullah Khan signed a Peace treaty according to which Herat was secured to Mughals tho Balkh remaind with Uzbeks. In 1646 Shah Jahan launched a campaign to Central Asia with his son Aurangzeb and commanders like Jai Singh and Murad Baksh to recapture territories lost during the reign of Akbar. He successfully defeated the Uzbeks and annexed Balkh and Badakhasthaninto Mughal Land for a brief period of time. It was only recaptured by Uzbeks after the end of their war with Mughals in 1648 during the Mughal–Safavid wars during the reign of Shah Jahan were Uzbeks supported Safavid Empire. ==Under Babur (1497-1512)== Babur, the ruler of Farghana, had long dreamed of ruling from the throne of his ancestor Timur in Samarqand. When his uncle died in 1494, Babur seized the opportunity to take the city in 1497. However, after just 100 days, he was forced to abandon it due to illness and a rebellion in Farghana.Despite his attempts to regain control, Babur was left with almost nothing. For years, Babur wandered with only a few hundred followers, briefly regaining Farghana in 1498, only to lose it again in 1500. In 1501, he managed to take Samarqand from the Uzbek ruler Shaibani Khan, but was soon defeated by Shaibani Khan in 1502 and forced to leave once again. To secure his release, Babur gave his sister in marriage to Shaibani Khan. For the next three years, he lived as a fugitive, enduring hardship and often begging for food. Despite his misfortune, Babur maintained a hopeful and cheerful spirit. Babur eventually settled in Afghanistan, though he still harbored ambitions to reclaim Samarqand, his ancestral homeland. In 1507, he visited his cousins in Herat, seeking their help to defeat Shaibani Khan, but returned disappointed. In 1510, Babur learned that Shaibani Khan had been killed by Shah Ismail of Iran. Seizing the opportunity, Babur took Samarqand, Bukhara, and Khurasan with Shah Ismail’s support. His kingdom expanded to include Tashkent, Qunduz, Hisar, Samarqand, Bukhara, Farghana, Kabul, and Ghazni. However, after Shah Ismail withdrew, the Uzbegs returned and defeated Babur in 1512, forcing him to retreat once again to Kabul. One factor in Babur's defeat was his adoption of Shia Islam, which alienated the Sunni population of Trans-Oxiana. Ultimately, Babur abandoned his quest to rule Samarqand and kept only Badakhshan, which he gave to his cousin. As the ruler of Kabul, he struggled with constant rebellions and the difficult task of collecting taxes from the Afghan people. ==Under Akbar (1588-1589)== In 1588-1589; During the regin of Akbar, Sultan Abdullah Khan II of Khanate of Bukhara captured Balkh and Samarkhand then attacked the Mughal city of Herat and captured it. Akbar himself arrived at Kabul to fight off the Ubzek army and after a Siege of a year both parties decided for a peace treaty in which Herat was restored to Mughals but Balkh was lost. ==Under Shahjahan (1646)== Shah Jahan dispatched a formidable force of 60,000 men under the leadership of Prince Murad Bakhsh, launching the campaign from Kabul, where the Emperor remained to closely oversee the operation. Officially, Shah Jahan informed his advisor, Nazr Muhammad, that the purpose of the invasion was simply to restore order in the Turkic provinces of Balkh and Badakhshan. However, Nazr Muhammad, fully aware of the deep-rooted animosity between the Mughals and the Uzbek Turks, recognized the looming threat and decided to flee Balkh as the Mughal army approached. Prince Murad Bakhsh’s march began in June 1646, and by July 2, he reached Balkh. The city surrendered to the Mughal forces with little resistance, and the army entered in a grand display of military might. Nazr Muhammad was pursued and eventually driven into Khurasan, while his treasury in Balkh, worth 12 million rupees, was seized by the Mughals. Despite the inhospitable and frigid terrain, which posed a challenge to the Rajput and other Indian troops, the Mughal forces successfully secured their conquest. ==List of Conflicts== Name Of Conflict (Time) Timurid/Mughal Commander Uzbek commander Outcome Capture of Samarqand (1497-1511) Babur Sultan Shaibani Uzbek Victory Siege of Samarqand (1497-1498) Babur Sultan Shaibani Uzbek Victory Battle of Sar- I-Pul(1501) Babur Kasim Beg Sultan Shaibani Uzbek Victory Battle of Akhsikanth(1503) Babur Sultan Muhammad Sultan Ahmad Mirza Sultan Shaibani Uzbek Victory Battle of Herat (1507) Mirza Zunnin Sultan Shaibani Uzbek Victory Battle of Maruchak (1507) Dhu'l-Nun Sultan Shaibani Uzbek victory Battle of Kandahar (1508) Babur Nasir Mirza Mukim Khan Timurid victory Battle of Pul-i-Sanghin (1511) Babur Ismail I Sultan Taimur Timurid victory Battle of Kul-i-Malik (1512) Babur Ismail I Ubaid Khan Uzbek victory Battle of Ghujduwan (1512) Babur Najm-i Thani Ubaid khan Sheikhein Mirza Uzbek Victory Siege of Herat (1588-1589) Akbar Abdullah khan II Peace treaty Battle of Balkh (1646) Shah Jahan Nazr Muhmmad Mughal victory == References == Category:Mughal Empire",
 "title": "Mughal-Uzbek Wars"
}