{
 "id": "1147151",
 "text": "Peanut ( 2016 or 2017 ), was a tamed eastern grey squirrel and Instagram celebrity who was captured and euthanized, alongside a raccoon named Fred, by the New York State Department of Environmental Convention (NYSDEC), after being taken from his owners Mark Longo and his spouse. His death caused public backlash, outrage, and disquietness online. Prior to his capture, Peanut and Fred resided with his owners in the small bustling town, Pine City, New York, just three miles away from the Pennsylvania border. However, in New York, it is illegal to keep squirrels and raccoons and Longo never even attempted to obtain a license to legally own Peanut and Fred. Alternatively even if they had the license they could only have kept the animals for a short time. Only being allowed to keep them till they could be released back into the wild. Had the Longo's gotten the license they would have followed the proper procedures and Peanut would not have come back. Bottle feeding allowed Peanut to imprint on the Longos. Peanut was rescued by Mark Longo in 2017 in New York City, after Peanut's mother was killed by a taxi driver, riding in a taxi car. After Longo failed to find a animal shelter who would accept taking Peanut in, Peanut was brought by Longo and his wife brought him to live with them in their house in Connecticut. In 2023, after leaving Connecticut, Peanut and his owners resided in Pine City, New York, where his owners founded a animal sanctuary, without obtaining a lisence, as stated above. Peanut became a famous Instagram celebrity, with Longo recording him doing tricks online, and posting them. Doing his tricks, Peanut got many views online, while Longo did pornography online, drawing in over $800,000 in just a month. Multiple New York licensed wildlife rehabilitators reported the fact that Longo kept a squirrel and raccoon as pet, to the New York State Department of Environmental Convention. Longo was contacted in January by NYSDEC and was informed that keeping the squirrel without a license was illegal. At that time Longo reported that he had released the squirrel into the wild. Reports kept coming in and after a quick look at Longo's social media accounts NYSDEC began planning to raid the property. Shortly after, on 30 October 2024, the authorities arrived to confiscate both Peanut and Fred. According to Longo, the authorities were in Longo's house and property for five hours, and they put them under interrogation. After Peanut and Fred were taken away from their owners, they were held by authorities for at least 2 days, before being killed to be tested for rabies, after Peanut allegedly bit a staff member's finger. When Longo and his spouse discovered that their animals were killed, and their bodies were tested, they were left in \"grief\", and it caused public backlash and outrage online. Longo and his spouse were also blamed, for not attempting to obtain license, or getting their pets out of New York. Category:Squirrels",
 "title": "Peanut (squirrel)"
}