{
 "id": "1147409",
 "text": "The sacking of Burhanpur (31 January - 2 February 1681) occurred when Maratha ruler Sambhaji, along with Sersenapati Hambirrao Mohite, led an attack on the wealthy city of Burhanpur in Madhya Pradesh. The Maratha forces plundered the city for three days, gaining a large loot before evading Mughal forces and returning to Raigad. Following this, they also sacked Aurangabad. This event prompted Mughal Emperor Aurangzeb to shift his focus to the Deccan, leading to the eventual capture and execution of Sambhaji. ==The Sack== In 1680, Prince Mu'azzam (Shah Alam), the eldest son of Emperor Aurangzeb, was recalled from his post as Viceroy of the Deccan to assist his father in the campaign against the Rajputs. To replace him, Kha-i-Jahan (Bahadur Shah) was appointed Subahdar of the Deccan for the second time, arriving in May 1680. In July, he laid siege to Ahivant, a fort controlled by the Marathas, but his attempt to capture it failed as the Marathas mounted a strong defense. In August 1680, the Marathas dealt a significant blow to the Mughals by seizing twenty-five guns near Sholapur that were being transported under Khan-i-Jahan’s orders. These guns were captured, and as a result, the officers in charge of the transport—Ali Aqa Rumi, Jagat Singh Hada, and Raja Jaswant Singh Bundela—lost their mansabs and were ordered to compensate for the loss. Meanwhile, Shambhu (Shivaji's son, Sambhaji) sent a defiant message to Khan-i-Jahan, declaring he would fight the Mughals in open battle after the monsoon. According to Khafi Khan, at the time, the Subahdar of Burhanpur was Khan-i-Jahan Bahadur, but his deputy, Kakkar Khan, was away collecting the jizya tax. Taking advantage of the absence of a Mughal force capable of resisting them, Sambhaji's army, numbering around 20,000, raided the Khandesh region before advancing to Burhanpur, located about 70 miles away. The Marathas attacked the suburbs of Burhanpur, which were poorly defended, consisting of just 250 men. Kakkar Khan, returning to Burhanpur, was too intimidated to engage the Marathas in battle, choosing instead to retreat. For three days, the Marathas ransacked the suburbs, looting shops and homes, uncovering hidden treasures, and even attempting to scale the fort’s walls with ladders, though they were repelled. They carried off a staggering amount of loot, estimated at 2 crores. The residents of Burhanpur, devastated by the plundering, appealed to the Emperor, demanding assurances for their safety and security. In response to these events, the local Muslim population threatened to stop attending Friday prayers unless their lives and honor were guaranteed in the future. To prevent further attacks, a protective wall was erected around the city's old quarter (Kuhna), a section built by the Mughal government, distinct from the suburbs (puras) built by local nobles. == References == Category:India",
 "title": "Sack of Burhanpur"
}