{
 "id": "114702",
 "text": "An ASBO, or an Antisocial behaviour order, is a British legal term for an order that is sometimes served on people who often behave badly and have many complaints made against them because of their behaviour. The order is designed to stop them from being anti-social, which means causing distress or alarm (among other things) to other people that do not live in the same place as themselves, according to the Crime & Disorder Act. 1998. ASBO's were ended and replaced with \"Injunctions\" in 2015 Some types of anti-social behaviour are: *Hurting people *Damaging things/Graffiti *Using bad words, sometimes directed at minorities *Dropping rubbish *Hanging around *Being very drunk *Dealing drugs *Stealing *Being noisy *Scaring and threatening people (attempting to produce fear) *Starting fires *Spitting *Streaking *Going places where you're not allowed to go An ASBO prohibits people from doing certain things, in certain times, in certain places. For instance, it might ban a person from gathering with certain friends in the park after 8 o'clock if that group of people have previously caused trouble together. There is also something called an ABC, which stands for an Acceptable Behaviour Contract, and are often used to make sure people try to be \"nice\". It is flexible, and can be used in serious situations as well as low key ones. Sometimes the ASBO can seem quite unusual when it is used to stop certain people from doing things, for example: *Wearing a hat anywhere in England and Wales *Sitting on the top deck of a bus *Saying the words grass and crippleHome Affairs - Written Evidence: 19. Memorandum submitted by Napo, House of Commons, 22 March 2005. URL accessed on 18 June 2006. *Wearing one golf glove *Playing Band Aid's \"Do They Know It's Christmas?\", stomping and dropping objects *Being sarcastic *Attending meetings that deal with anti-social behaviour == References == Category:Law enforcement in the United Kingdom",
 "title": "Anti-social behaviour order"
}