{
 "id": "114725",
 "text": "Istrian-Dalmatian exodus was the diaspora or forced migration of ethnic Italians from Istria, Fiume, and Dalmatia, after World War II. Those territories had been ethnically mixed since the Middle Ages. Most people were Italians, but there were also Slovenian, Croatian, Serbian and other communities. National Memorial Day of the Exiles and Foibe is Italian celebration in memory of all exiles and victims in the massacres of Foibe. ==Characteristics== Istria including Fiume (Rijeka) and parts of Dalmatia including Zara (zadar), had been annexed to Italy after World War I. At the end of World War II the former Italian territories in Istria and Dalmatia became part of Yugoslavia by the Paris Peace Treaty (1947), with the only exception being the communes of Muggia and San Dorligo della Valle. Italian sources claim that about 350,000 ethnic Italians had to leave the areas after the conflict. Official data shows that between 1948 and 1961 (the exodus started in 1943 in Dalmatia and in 1945 in the rest of the territory) the numbers of ethnic Italians living in Slovenia - almost exclusively in Slovenian Istria and along the Italian border - decreased by nearly 87% (from 25,451 to 3,072). The data for the Former Yugoslavia shows a decrease in the same years from 113,278 to 25,615. According to Slovenian historian Matjaž Klemenčič, \"in 1953 only 36,000 (Italians) lived in the region of former Yugoslavia, i.e. 16% of the Italian population before World War II. Italians also emigrated in later decades (most of them to Australia, Canada, South America or the USA). Therefore their population declined in each subsequent census until 1981. We have to emphasize that the data of the Yugoslav census are unreliable in relation to the real number if Italians, since many members of the Italian minority, for various reasons, chose 'Nationality Undeclared' or their regional identity (most as 'Istrians'). In the 1991 census there was a relatively large increase of Italians, (19,213 in the Regions of autochthonous settlements of Italians in Croatia) compared to 1981 census (15,132). Many Italians who in previous census did not declare as such, declared themselves 'Italians' in 1991 because they counted on the help of Italy in forthcoming crises in the region\". In some municipalities in Croatia in Slovenia, census data shows that there are still many Italians living in Istria, such as 66% of the population of Grisignano (519 Italians), 41% at Bertoniglia (652 Italians) and nearly 40% in Buie (2,118 Italians).See census data from Croatia at http://www.dzs.hr/default_e.htm --> released data --> census 2001 --> tables --> population by mother tongue by towns/municipalities --> (scroll down) County of Istria == Overview == The Italians in coastal Slovenia and Croatia were mostly an indigenous population (in 1910 they accounted for more than a third of the local inhabitants, while in Istria they were nearly 55%), bolstered by new arrivals or the so called regnicoli, never well liked by the slavs by the indigenous Venetian-speaking Istrians, who arrived between 1918-1943, when Istria, Fiume, part of Dalmatia, and the islands of Cres (Cherso), Lussino, Lagosta, and Pelagosa (Palagruža) were part of Italy. The Austrian 1910 census indicated about 182,500 people who listed Italian as their language of communication in what is now the territory of Slovenia and Croatia: 137,131 in Istria, 28,911 in Fiume/Rijeka (1918), 11,487 in Zara/Zadar, 5,000 in Dalmatia,O.Mileta Mattiuz, Popolazioni dell'Istria, Fiume, Zara e Dalmazia (1850-2002). Ipotesi di quantificazione demografica, ADES 2005, pp. 57, 128, 159, 169 while the Italian 1936 censusVIII. Censimento della popolazione 21. aprile 1936. Vol II, Fasc. 24: Provincia del Friuli; Fasc. 31: Provincia del Carnero; Fasc. 32: Provincia di Gorizia, Fasc. 22: Provincia dell’Istria, Fasc. 34: Provincia di Trieste; Fasc. 35: Provincia di Zara, Rome 1936. Cited at http://www.cliohres.net/books/7/26.pdf indicated about 230,000 people who listed Italian as their language of communication in what is now the territory of Slovenia and Croatia, then part of the Italian state (ca. 194,000 in today’s Croatia and ca. 36,000 in today’s Slovenia). From the end of World War II until 1953, according to various data, between 250,000 and 350,000 people emigrated from these regions. Some thousands were Slovenes and Croats who opposed the Communist government in Yugoslavia,Matjaž Klemenčič, The Effects of the Dissolution of Yugoslavia on Minority Rights: the Italian Minority in Post-Yugoslav Slovenia and Croatia. See http://www.cliohres.net/books/7/26.pdf while most were ethnic Italians, the so-called optanti emigrants who were living permanently in this region on 10 June 1940 and who expressed their wish to obtain Italian citizenship and emigrate to Italy. The emigration of Italians greatly reduced the total population of the region and totally altered its ethnic structure. In 1953, officially, only 36,000 Italians lived in Yugoslavia, 16% of the Italian population before World War II. In its 1996 report on 'Local self-government, territorial integrity and protection of minorities' the Council of Europe's European Commission for Democracy through Law (the Venice Commission) put it that \"a great majority of the local Italians, Italianites (of Slavic and other origin), many thousands of Slovenes and of nationally undefined bilingual 'Istrians' used their legal right from the peace treaty to 'opt out' of the Yugoslav controlled part of Istria. In several waves they moved to Italy and elsewhere (also overseas) and claimed Italian or other citizenship. The mass exodus of the optanti (or esuli as they were called in Italy) from 'godless communist Yugoslavia' was actively encouraged by the Italian authorities, Italian radio and the Roman Catholic bishop of Trieste. After this huge drain, the numerical strength of the remaining Italian minority became stable\". == History == ===Ancient times=== Evidence of Italic people living alongside those from other ethnic groups on the eastern side of the Adriatic as far north as the Alps goes back at least to the Bronze Age. A 2001 population census counted 23 languages spoken by the people of Istria. Istria and Dalmatia were fully latinized at the fall of the Roman empire in the fifth century. From the Middle Ages onwards numbers of Slavic people near and on the Adriatic coast were increasing, due to their expanding population and due to pressure from the Turks pushing them from the south and east.http://www.demog.berkeley.edu/~gene/migr.html. See also http://www.istra-istria.hr/index.php?id=860 This led to Italic people becoming ever more confined to urban areas in Dalmatia, while the countryside was populated by Slavs, with certain isolated exceptions.\"While most of the population in the towns, especially those on or near the coast, was Italian, Istria’s interior was overwhelmingly Slavic – mostly Croatian, but with a sizeable Slovenian area as well\". See http://www.transdiffusion.org/emc/intertel/features/the_olive_grove.php But Istria remained fully Italian until the Ottoman invasion in the sixteenth century. The original majority Italian population suffered economic and political disadvantages, which gradually increased with the Austro-Hungarian empire in the 19th century. This created emigration: in Dalmatia the Dalmatian Italians were 25% in 1815, but a century later in 1915 they were only 2%. === World War I and the Post-War Period === In 1915, the Italians attacked the Austro-Hungarian Empire leading to bloody conflict mainly on the Isonzo and Piave fronts. Britain, France and Russia had been \"keen to bring neutral Italy into World War One on their side. Italy however drove a hard bargain, demanding extensive territorial concessions once the war had been won\". In a deal to draw Italy into the war, under the London Pact, Italy was granted Trentino, Trieste, (the German-speaking) South Tyrol, and Istria including large non-Italian communities. But Dalmatia was excluded, as was Rijeka. In Dalmatia, not granted to Italy by the London pact, Italy gained the city of Zadar and some islands. After World War I, under the Treaty of Rapallo between the Kingdom of Serbs, Croats and Slovenes (later Kingdom of Yugoslavia) and the Kingdom of Italy (12 November 1920), Italy obtained all of Istria with Trieste, the exception being the island of Krk and part of Kastav commune, which went to the Kingdom of Serbs, Croats and Slovenes. By the Treaty of Rome (27 January 1924) the Free state of Fiume was split between Italy and Yugoslavia. ===World War Two=== After the Wehrmacht invasion of Yugoslavia (6 April 1941), the Italian zone of occupation was further expanded.http://www.ibiblio.org/hyperwar/ETO/East/Balkans/maps/AG/AG- Balkans-3.jpg Italy annexed large areas of coastal Yugoslavia (including most of coastal Dalmatia) and Slovenia (including its capital Ljubljana).Its brutal repression of Partisan activities and the killing and imprisonment of thousands of Yugoslav civilians in concentration camps (such as the Rab concentration camp) in the newly annexed provinces, and in Italy proper, fed the anti-Italian sentiments of the Slovenian and Croatian subjects of Fascist Italy. During the Italian occupation until their capitulation in September 1943, the population was subjected to atrocities, described by Italian historian Claudio Pavone as “aggressive and violent. After the Second World War, there were large-scale movements of people choosing to move to Italy rather than live in Yugoslavia. In Yugoslavia, the people who left were called optanti, which translates as 'choosers', while they call themselves esuli or exiles. Their motives for leaving may have been fear of reprisals and murders, economic motives, or ethnically based. === The foibe massacres === When the Fascist regime collapsed in 1943 reprisals against Italian fascists and civilians (even Italian communists) took place. At least 200 Italians were killed by Tito's resistance movement in September 1943; some had been connected to the fascist regime, while others were victims of personal hatred or the attempt of the partisan resistance to get rid of its real or supposed enemies. These events took place in central and eastern Istria, as well as in Slovenian Primorska. The second wave of anti-Italian violence took place after occupation of Slav army in May 1945. This was known as the foibe massacres; actually it was a repeat of what had been already begun in 1943 but in larger scale. Many Italian sources claim that these killings were ethnic cleansing and genocide: Italian people were forced to mass migration by Tito supporters. The mixed Italian-Slovenian Historical Commission, established in 1995 by the two governments to investigate the matters, described the 1945 killings: The number of victims is not certain. The Italian historian Raoul Pupo suggests 4,500 were killed (including the events of 1943), mostly Italians, but many bodies wearing Partisan uniforms were found as well, so the number is subject to many interpretations. Other sources suggest numbers reaching up to 30,000 killed or missing. == Exodus == Economic insecurity, ethnic hatred and the international political context that led to the Iron Curtain resulted in about 350,000 people, mostly Italians, choosing to leave the region. The London Memorandum of 1954 gave to the ethnic Italians the choice of either opting to leave (the so-called optants) or staying. These exiles were to be given compensation for their loss of property and other indemnity by the Italian state under the terms of the peace treaties. Following the exodus, the areas were settled with Yugoslav people. === Periods === The exodus took place between 1943 and 1960; Italians allege that most of their numbers left in * 1943 * 1945 * 1947 * 1954 The first period took place after the surrender of the Italian army and the beginning of the first wave of anti-fascist violence. The second period was soon after the end of the war and approximately around the time of the second wave of anti-fascist violence. The Wehrmacht was engaged in a front-wide retreat from the Yugoslav Partisans, along with the local collaborationist forces (the Ustaše, the Domobranci, the Chetniks, and units of Mussolini's puppet Italian Social Republic). The third period took place after the Paris peace treaty, when Istria was assigned to the Socialist Federal Republic of Yugoslavia, except for a small area in the northwest part that formed the independent Free Territory of Trieste. The fourth period took place after the Memorandum of Understanding in London. It gave provisional civil administration of Zone A (with Trieste), to Italy, and Zone B to Yugoslavia: in 1975 the Treaty of Osimo finally divided the former Free Territory of Trieste. === Estimates === Several estimates of the exodus by historians: * Vladimir Žerjavić (Croat), 191,421 Italian exiles from Croatian territory. * Nevenka Troha (Slovene), 40,000 Italian and 3,000 Slovene exiles from Slovenian territory. * Raoul Pupo (Italian), about 250,000 Italian exiles * Flaminio Rocchi (Italian), about 350,000 Italian exiles The mixed Italian- Slovenian Historical Commission verified 27,000 Italian and 3,000 Slovene migrants, but only from Slovenian territory. ===Famous exiles=== In the list are persons who worked in other places before the war and are also considered exiles due to their properties being confiscated by the communist dictatorship under Josip Broz. Famous postwar exiles from territories include: * Mario Andretti from Motovun (then Montona d'Istria), race driver * Laura Antonelli, actress * Lidia Bastianich from Pula (then Pola), chef * Nino Benvenuti from Izola (then Isola d'Istria), boxer: three times professional world's champion and olympic gold medalistArticle in Italian (scroll down for Benvenuti): Mi hanno cacciato dal mio paese quando avevo tredici anni. Si chiamava Isola d'Istria, Oggi è una cittadina della Slovenia (I was expelled from my country when I was thirteen. It was called Isola d'Istria, today is a town in Slovenia) * Enzo Bettiza from Split, novelist, journalist and politician * Gianni Cucelli, tennis player * Sergio Endrigo from Pula (then Pola), singerSelf-biografy of Sergio Endrigo in Italian. Endrigo stated: Sono nato a Pola (I was born in Pola) - Stavo partendo per andare a passare tre anni in un collegio per profughi giuliani e dalmati a Brindisi (nel 1947 la regione dell’Istria è stata riconosciuta alla Jugoslavia e tutti gli italiani lì residenti furono costretti ad espatriare) (I was starting to go to spend three years in a college for giuliano-dalmati refugees in Brindisi - in 1947 the region of Istria was recognized to Yugoslavia and all Italians living there were forced to expatriation) * Guido Miglia from Pula (then Pola), journalist and writerMiglia was the last director (until the great exile in 1947) of L'Arena di Pola, the Italian newspaper of Pola. Link in italian. Miglia stated: Stavamo tutti invecchiando in esilio (We were all ageing in exile) * Ottavio Missoni from Zadar (then Zara), stylist and former Sindaco (Mayor) del Comune di Zara in Esilio, an association of exiles Dalmatian ItaliansArticle from the Italian newspaper Il Corriere della Sera. Missoni stated: \"Io, esule da Zara...\" (I'm exile from Zadar) * Abdon Pamich, race walker: world's champion and olympic gold medalist * Orlando Sirola, tennis player * Agostino Straulino, sailor: four times world's champion and olympic gold medalist * Fulvio Tomizza from Materada (a small village near Porec, then Parenzo), poet and writerArticle in Italian from the newspaper La Repubblica. Tomizza stated: Mi sono sempre sentito esule (I feel myself exileArticle in Italian from Il Corriere della Sera: Tomizza, poi esule... (Tomizza, then exile). Tomizza asks justice for the foibe massacres * Leo Valiani, politician and journalist * Alida Valli, actress * Valentino Zeichen from Rijeka (then Fiume), poet and writer * Lidia Bastianich, chef * Mario Gasperini, painter * Luigi Donorà, composer === Property reparation === On February 18, 1983 Yugoslavia and Italy signed a treaty in Rome. Yugoslavia agreed to pay US$110 million for the compensation of the exiles' property which was confiscated after the war in the Zone B of Free Territory of Trieste. The Teaty of Osimo (1975) Up to its breakup in 1991, Yugoslavia had paid US$18 million. Slovenia and Croatia, two Yugoslav successors, agreed to share the remainder of this debt. Slovenia assumed 62% and Croatia the remaining 38%. Italy did not want to reveal the bank account number so in 1994 Slovenia opened a fiduciary account at Dresdner Bank in Luxembourg, informed Italy about it and started paying its US$55,976,930 share. The last payment was due in January 2002. Until today, the solution of the matter between Croatia and Italy has been delayed. None of the refugees from the Free Territory of Trieste saw a single penny so far. === Historical debate === It has been established that Foibe massacres were been used by Slav communists for ethnic-political cleansing. In fact, foibe massacres and exodus were described as a democide and an ethnic-political cleansing by Italian president Giorgio Napolitano. Slovenian historian Darko Darovec writes: For the mixed Italian-Slovenian Historical Commission: ==Related pages== * Foibe massacres * National Memorial Day of the Exiles and Foibe * Free Territory of Trieste * Italian Social Republic * Ethnic cleansing * Istria * Dalmatia * Dalmatian Italians * Italian cultural and historic presence in Dalmatia * Venice and Dalmatia ==References== ==Bibliography== * Arcipelago Adriatico. Ethnic map of Istria in the 1920s () * * * * ==Further reading== * The Effects of the Dissolution of Yugoslavia on Minority Rights: the Italian Minority in Post-Yugoslav Slovenia and Croatia by Matjaž Klemenčič * Site of an association of Italian exiles from Istria and Dalmatia. * Slovene-Italian Relations 1880-1956 Report 2000 * Relazioni Italo-Slovene 1880-1956 Relazione 2000 * Slovensko-italijanski odnosi 1880-1956 Poročilo 2000 * Italians mark war massacre * Massacres and Atrocities of World War II == Other websites == * Official site of exiles Italian and English * * A Brief History of Istria by Darko Darovec * Perlasco Foundation on Istrian-dalmatian exodus (in italian) * Italian documentary Category:Dalmatia Category:20th century in Italy Category:World War II Category:Istria",
 "title": "Istrian–Dalmatian exodus"
}