{
 "id": "1148580",
 "text": "Sarah Frey (born July 24, 1976) is an American farmer, writer and businesswoman. She is the CEO and owner of Frey Farms. She founded the company at age sixteen. ==Personal life== Frey was born on July 24, 1976. In her memoir, Frey wrote that at age seven she was sexually abused by a farmhand. At 15, she moved out of her parents' house. Frey went to Frontier Community College in Fairfield, Illinois while also going to high school. Frey is divorced with two sons. ==Business career== At 16, she borrowed $10,000 to buy a used truck and took over a melon route, quickly increasing her family farm's client list from 12 to 150. She bought her family farm, near Mount Vernon, Illinois, at age 18. Frey has been called \"the Pumpkin Queen of America\". She grows more pumpkins than any other farmer in the United States. In 2016, Frey sold around five million pumpkins. In 2018, Frey created another company called Sarah's Homegrown that focused on agua frescas and fresh produce. Frey is on the United Fresh Government Relations Council and the National Watermelon Promotion Board. She is also a member of the Illinois Agriculture Coalition committee. == Politics== In 2019, some Republican congress officials wanted Frey to run for office to replace Republican Representative John Shimkus after he announced his retirement but decided not to run. In November 2024, it was reported that President-elect Donald Trump was thinking about nominating Frey to serve as the United States Secretary of Agriculture for his second administration. ==Written works== *For the Love of Pumpkins: A Visual Guide to Fall Decorating with Pumpkins and Ornamentals (2007) *The Growing Season: How I Built a New Life--and Saved an American Farm (2020) ==References== ==Other websites== * Category:Living people Category:Businesspeople from Illinois Category:American chief executives Category:Writers from Illinois Category:American autobiographers Category:1976 births Category:Republicans (United States)",
 "title": "Sarah Frey"
}