{
 "id": "1148485",
 "text": "3BM Television was an independent British television production company. It was founded in October 1995 by Jeremy Bennett, Simon Berthon, Marion Milne, and Malcolm Brinkworth. The company specialized in producing documentaries, focusing on historical, current affairs, popular science, and human interest topics. == History and Operations == 3BM Television operated with offices in London and Bath. The company gained recognition for its high-quality factual programming and documentaries. One of its notable productions was the four- part television series \"Warlords,\" which aired on Channel 4 in 2005. This series, accompanied by a book of the same name, provided a detailed examination of World War II through the perspectives of key figures such as Churchill, Hitler, Stalin, and Roosevelt. == Notable Productions == 3BM Television was involved in producing several acclaimed documentaries and series: # Secrets of the Dead series: The company produced episodes for this long-running documentary series, including \"Catastrophe! Part 1: The Day the Sun Went Out,\" which aired on May 15, 2000. # \"The Berlin Airlift\": A documentary produced by Jeremy Bennett and directed by Marion Milne. # \"Nuremberg: Goering's Last Stand\": This production won the BAFTA Huw Wheldon award. # \"Secret History\": A long-running documentary series for Channel 4. == Key personnel == Simon Berthon, one of the founding partners, served as the Chief Executive of 3BM Television. Berthon had a long career in the television industry, working as an executive producer, producer, director, and writer. He later became Vice-Chair of Directors UK from 2007-11. == Acquisition == In 2004, 3BM Television was acquired by Zinc Media, marking a significant change in its ownership and operational structure. Throughout its existence, 3BM Television contributed significantly to the landscape of independent television production in the UK, particularly in the realm of factual programming and documentaries. ==References== Category:Companies of the United Kingdom",
 "title": "3BM Television"
}