{
 "id": "1148995",
 "text": "W.M.J. \"Wim\" Denie (21 July 1946 – 12 November 2024) was a Dutch politician. He was a member of the Labour Party. He was mayor of several municipalities between 1999 and 2011. He received a lot of criticism after the . ==Biography== Denie was an alderman in the Ubbergen municipality before being appointed mayor of Graft-De Rijp in North Holland in the summer of 1991. Eight years later, in May 1999, he was appointed mayor of Swalmen. He remained mayor there until that municipality was abolished in 2007. In July 2008, Denie became mayor of the Moerdijk municipality. On 3 January 2011, he announced that he would step down as mayor of Moerdijk as of 1 July 2011. He made this unexpected decision next to his health, also because of the so-called Vendrik effect: civil servants who continue working after the age of 65 receive considerably less pension than civil servants who stop before that age. On 5 January 2011 there was a major fire in Moerdijk in the chemical company . The mayor of Breda took the coordination during the fire, as he was chairman of the safety region and the Regional Policy Team. Denie received a lot of criticism. During a conversation with the Queen's commissioner Wim van de Donk on 14 January 2011, Denie decided to bring forward his announced departure and decided to resign from office on 1 February 2011. As a reason, Denie mentioned his the physical and mental health required by the aftermath of the fire. During the New Year's speech of the Queen's Commissioner he praised the mayor of Breda, but didnt mention Denie. In an interview with Omroep Brabant, the Queen's Commissioner stated that Denie's departure was due to a lack of professionalism and vitality. His departure would be the best for the municipality of Moerdijk because Denie was not the best person for that position. Denie died on 12 November 2024, at the age of 78 from the consequences of Parkinson's disease. ==References== Category:Dutch politicians Category:Dutch mayors Category:Aldermen of the Netherlands Category:1946 births Category:2024 deaths Category:Place of death missing",
 "title": "Wim Denie"
}