{
 "id": "1148331",
 "text": "The Gauliga Donau-Alpenland 1944/45 was the seventh season of the Gauliga Donau-Alpenland in annexed Austria. Due to the war, a championship with exclusively Viennese clubs took place. SC Rapid Oberlaa, who failed in the promotion game, took SK Amateure Steyr's place. Due to the course of the war, the championships were gradually stopped in all classes. The Gauliga was limited to nine games in the fall of 1944, after which the championship could not be continued due to the war. Austria Soccer ==Table (status when the competition was canceled) == Austria Soccer Pl. Name M W D L P 1\\. SK Rapid Wien 11 7 2 2 16 2\\. First Vienna FC 10 6 2 2 14 3\\. SC Wacker Wien 10 6 2 2 14 4\\. Floridsdorfer AC 11 6 2 3 14 5\\. FC Wien 10 5 2 3 12 6\\. SK Admira Wien 10 4 1 5 9 7\\. Wiener Sport-Club 10 3 1 6 7 8\\. Wiener AC 11 3 1 7 7 9\\. FK Austria Wien 12 3 1 8 7 10\\. KSG Oberlaa/Felten Rapid Oberlaa and BSG Felten merged in the winter of 1944/45 due to war. 11 2 0 9 4 ==Matches == Austria Soccer ===Round 1=== Date Team 1 Team2 10 September 1944 Floridsdorfer AC First Vienna FC 4-3 Not verified after protest from Vienna. 10 September 1944 Wiener AC SC Rapid Oberlaa 4-1Not verified after protest from Oberlaa. 3 December 1944 Wiener Sport-Club SC Wacker Wien 2-8 10 December 1944 SK Admira Wien SK Rapid Wien 2-2 10 December 1944 FK Austria Wien FC Wien 0-1 10 December 1944 Floridsdorfer AC First Vienna FC 2-5 10 December 1944 Wiener AC SC Rapid Oberlaa 3-1 ===Round 2=== Date Team 1 Team2 16 September 1944 FC Wien SK Admira Wien 3-0 17 September 1944 SC Rapid Oberlaa FK Austria Wien 1-5 17 September 1944 SK Rapid Wien Floridsdorfer AC 3-1 17 September 1944 First Vienna FC Wiener Sport-Club 2-2 17 September 1944 SC Wacker Wien Wiener AC 2-2 ===Round 3=== Date Team 1 Team2 16 September 1944 FC Wien SK Admira Wien 3-0 17 September 1944 SC Rapid Oberlaa FK Austria Wien 1-5 17 September 1944 SK Rapid Wien Floridsdorfer AC 3-1 17 September 1944 First Vienna FC Wiener Sport-Club 2-2 17 September 1944 SC Wacker Wien Wiener AC 2-2 ===Round 4=== Date Team 1 Team2 30 September 1944 SC Rapid Oberlaa Floridsdorfer AC 1-3 1 October 1944 FK Austria Wien SK Admira Wien 0-2 1 October 1944 FC Wien Wiener Sport-Club 3-0 1 October 1944 SK Rapid Wien SC Wacker Wien 2-3 1 October 1944 First Vienna FC Wiener AC 1-0 ===Round 5=== Date Team 1 Team2 8 October 1944 Floridsdorfer AC FK Austria Wien 1-0 8 October 1944 First Vienna FC SK Rapid Wien 0-5 8 October 1944 SC Wacker Wien FC Wien 1-0 8 October 1944 Wiener AC SK Admira Wien 2-3 8 October 1944 Wiener Sport-Club SC Rapid Oberlaa 2-3 Musial and Vita, who were excluded in the 80th minute, continued to fight. This led to a general scuffle.The game was abandoned. Shared fault was determined, and the game ended with 0 goals and 0 points for both teams. ===Round 6=== Date Team 1 Team2 15 October 1944 SK Admira Wien Floridsdorfer AC 1-2 15 October 1944 FK Austria Wien SK Rapid Wien 0-3 15 October 1944 FC Wien First Vienna FC 1-3 15 October 1944 SC Rapid Oberlaa SC Wacker Wien 2-1 15 October 1944 Wiener Sport-Club Wiener AC 4-5 ===Round 7=== Date Team 1 Team2 29 October 1944 SK Admira Wien Wiener Sport-Club 3-2 29 October 1944 SK Rapid Wien FC Wien 1-1 29 October 1944 First Vienna FC SC Rapid Oberlaa 11-1 29 October 1944 SC Wacker Wien FK Austria Wien 2-1 15 October 1944 Wiener AC Floridsdorfer AC 0-6 ===Round 8=== Date Team 1 Team2 12 November 1944 FC Wien Wiener AC 3-1 12 November 1944 Floridsdorfer AC SC Wacker Wien 2-2 12 November 1944 SC Rapid Oberlaa SK Rapid Wien 1-7 12 November 1944 FK Austria Wien Wiener Sport-Club 2-3 12 November 1944 First Vienna FC SK Admira Wien 5-3 ===Round 9=== Date Team 1 Team2 26 November 1944 SK Admira Wien SC Wacker Wien 1-4 26 November 1944 FC Wien SC Rapid Oberlaa 8-1 Replay match- On November 19th, 1944 weren't enough Oberlaas players present. 26 November 1944 SK Rapid Wien Wiener AC 9-3 26 November 1944 Wiener Sport-Club Floridsdorfer AC 1-0 12 November 1944 FK Austria Wien First Vienna FC 1-6 ===Round 10=== Date Team 1 Team2 18 March 1945 FC Wien FK Austria Wien 1-1 18 March 1945 KSG Oberlaa/Felten Wiener AC 3-2 18 March 1945 SK Rapid Wien SK Admira Wien 3-1 18 March 1945 First Vienna FC Floridsdorfer AC 3-3 18 March 1945 SC Wacker Wien Wiener Sport-Club Verified for Wiener Sport-Club 0-0 ===Round 11=== Date Team 1 Team2 25 March 1945 FK Austria Wien KSG Oberlaa/Felten 5-0 25 March 1945 Floridsdorfer AC SK Rapid Wien 2-1 ===Round 12=== Date Team 1 Team2 2 April 1945 FK Austria Wien Wiener AC 0-6 == References == Category:Football in Austria Category:Football seasons Category:1944 in sports Category:1945 in association football Category:1945 in Austria",
 "title": "1944-45 Austrian football championship"
}