{
 "id": "1148309",
 "text": "David Lincoln Rabinowitz is an American astronomer and planetary scientist notable for his significant contributions to the discovery of trans-Neptunian objects and dwarf planets. Rabinowitz has played a key role in the discovery of celestial objects such as Eris, Sedna, and many Kuiper Belt Objects (KBOs). == Early Life and Education == He pursued his studies in astronomy at the University of Arizona, where he obtained his degrees and developed a keen interest in observational astronomy, particularly in the study of distant objects within our solar system. == Career == Rabinowitz has worked extensively in the field of astronomy and planetary science, contributing to both academic research and observational advancements. He is currently a researcher at Yale University, where his work focuses on the development of telescopic instruments and methods for the detection of near-Earth objects (NEOs) and other distant bodies within the solar system. === Major Discoveries === Rabinowitz is credited with the discovery and co-discovery of several notable celestial bodies: * Eris – A dwarf planet that is one of the largest known objects in the Kuiper Belt. * Sedna – A distant, reddish object with a highly eccentric orbit, believed to be part of the inner Oort cloud. * Quaoar – A large Kuiper Belt Object notable for its size and influence in the study of outer solar system dynamics. These discoveries have contributed to our understanding of the solar system's structure and the distribution of objects beyond the orbit of Neptune. == Research Focus == * Development of sensitive telescopic detectors and software for celestial observation. * Detection and characterization of near-Earth and trans-Neptunian objects. * Studying the orbits, compositions, and physical properties of distant solar system bodies. == Awards and Recognition == Rabinowitz has been recognized by the scientific community for his contributions to astronomy, specifically in the field of trans-Neptunian and near-Earth objects. His work on distant celestial objects has paved the way for further exploration and understanding of the solar system's outer regions. == Related pages == * List of trans-Neptunian objects * Dwarf planet * Planetary Science == References == == Other websites == * Profile at Yale University * IAU - International Astronomical Union * Category:Living people Category:Year of birth missing (living people) Category:American astronomers",
 "title": "David L. Rabinowitz"
}