{
 "id": "1148116",
 "text": "The Indian National Satellite System or INSAT in short is a series of many geostationary satellites. They were launched by the Indian Space Research Organisation (ISRO) for multiple purposes like telecommunications, broadcasting, meteorology, and search and rescue operations. INSAT was commissioned in 1983. It is the largest domestic communication system in the Indo-Pacific region. The satellites are made possible by the Department of Space, Department of Telecommunications, India Meteorological Department, All India Radio and Doordarshan. The operations of the INSAT system are handled by the Secretary-level INSAT Coordination Committee. INSAT satellites provide transponders used for communication to serve the television and communication needs of India. Some of the satellites also have devices like VHRR, CCD cameras to take weather pictures. The satellites also help in receiving distress alert signals to help in search and rescue missions in South Asia and the Indian Ocean, as ISRO is a member of the Cospas-Sarsat program. == INSAT system == INSAT started with the launch of INSAT-1B in August 1983. INSAT-1A, the first satellite with 'A' in its name, was launched before 1B in April 1982 but it did not work. INSAT system helped improve television, radio, phone services and weather forecasting in India, even in remote areas and islands. Some of the INSATs also carry instruments for meteorological observation and data relay for providing meteorological services. KALPANA-1 satellite is used specially only for weather. The satellites are controlled by Master Control Facilities that exist in Hassan and Bhopal. == List of INSAT satellites == Satellite Date of launch Launch vehicle Status INSAT series INSAT-1A 10 April 1982 Delta 3910 / PAM-D No More Used INSAT-1B 30 August 1983 Space Shuttle / PAM-D No More Used INSAT-1C 21 July 1988 Ariane 3 No More Used INSAT-1D 9 July 1992 Delta 4925 No More Used INSAT-2A 22 July 1993 Ariane 44L H10 No More Used INSAT-2B 12 June 1990 Ariane 44L H10+ No More Used INSAT-2C 6 December 1995 Ariane 44L H10-3 Still Used INSAT-2D 3 June 1997 Ariane 44L H10-3 No More Used INSAT-2DT 26 February 1992 Ariane 44L H10 No More Used INSAT-2E 2 April 1999 Ariane 42P H10-3 Still Used INSAT-3A 9 April 2003 Ariane 5G Still Used INSAT-3B 21 March 2000 Ariane 5G Still Used INSAT-3C 23 January 2002 Ariane 42L H10-3 Still Used INSAT-3D 25 July 2013 Ariane 5 ECA Still Used INSAT-3DR 8 September 2016 GSLV Mk II Still Used INSAT-3DS 17 February 2024 GSLV Mk II Still Used INSAT-3E 21 December 2003 Ariane 5G No More Used INSAT-4A 27 September 2005 Ariane 5GS No More Used INSAT-4B 11 March 2007 Ariane 5 ECA No More Used INSAT-4C 10 July 2006 GSLV Mk I FAILED INSAT-4CR 2 September 2007 GSLV Mk I No More Used INSAT-4D - GSLV Mk I CANCELLED INSAT-4E 27 August 2015 GSLV Mk II Still Used INSAT-4F 29 August 2013 Ariane 5 ECA Still Used INSAT-4G 20 May 2011 Ariane 5 ECA Still Used Category:Satellites Category:Indian Space Research Organisation",
 "title": "Indian National Satellite System"
}