{
 "id": "1148887",
 "text": "Karoline Claire Leavitt (born August 24, 1997) is an American political spokesperson and aide serving as the 36th White House press secretary under the second administration of President Donald Trump since 2025. She is youngest White House press secretary in history. Leavitt was a presidential writer and assistant press secretary during the first Trump administration. In 2022, she ran for congress in New Hampshire's 1st congressional district but lost the general election to incumbent Chris Pappas. She was a spokesperson for MAGA Inc., a pro-Trump Super PAC, and she served as the national press secretary for Donald Trump's 2024 presidential campaign. ==Congressional campaign== In 2022, she ran for the U.S. House of Representatives in New Hampshire's 1st congressional district, becoming the second member of Generation Z to win a congressional primary. She lost the general election to incumbent Chris Pappas. She decided not to run again in 2024. ==Press secretary== ===Trump 2024 campaign=== In January 2024, Leavitt began working as the national press secretary for Donald Trump 2024 presidential campaign. She appeared on several news channels defending Trump and in one case was removed from CNN for arguing with the debate moderators. She was on short leave in July 2024 because her son was born, but she quickly returned to work after seeing the attempted assassination of Donald Trump on July 13. ===White House secretary=== On November 15, 2024, President-elect Trump chose Leavitt to be his White House press secretary. She took office on January 20, 2025. At age 27, she is the youngest White House press secretary ever appointed. Leavitt delivered her first White House press conference on January 28, 2025, during which she announced that independent journalists and influencers would also be able to apply for press conferences in the future. ==Personal life== Karoline Claire Leavitt was born in Atkinson, New Hampshire to a Catholic family. She studied at Saint Anselm College During her education at Saint Anselm College, Leavitt interned at Fox News. Leavitt is a Roman Catholic. In 2025, Leavitt married Nicholas Riccio, a real estate developer 32 years older than her. They announced their engagement in December 2023 and were married in a private ceremony. She gave birth to their son on July 10, 2024. ==References== ==Other websites== * Category:1997 births Category:Living people Category:Politicians from New Hampshire Category:Republican Party (United States) politicians Category:White House Press Secretaries",
 "title": "Karoline Leavitt"
}