{
 "id": "1148829",
 "text": "Microsoft Surface is a series of touchscreen personal computers, tablets, and interactive whiteboards made and developed by Microsoft, most of them running the Windows operating system. It comprises several generations of hybrid tablets, 2-in-1 detachable notebooks, a convertible desktop all-in-one, an interactive whiteboard, and many accessories, many with unique form factors. The majority of devices in the Microsoft Surface lineup are based on Intel processors and running with Windows 10 or Windows 11. == Devices == The Surface family currently has a ten main lines of devices: * The Surface Go line of compact-sized hybrid tablets, with optional detachable keyboard accessories and optional digital pen. * The Surface Pro line of hybrid tablets, slightly larger and more powerful than Surface Go, with similar, optional detachable keyboard accessories and optional digital pen. * The Surface Laptop, a classic notebook with a 13.5-inch or 15-inch touchscreen aimed at students. For example: ** The Surface Laptop Go, marketed as a more cheaper alternative to the brand's premium laptops. ** The Surface Laptop SE, an cheapest laptop targeted at the education market, designed to be easier to repair by service partners for on-site repair. ** The Surface Laptop Studio, a notebook with dual-pivoting screen to change into tablet mode. * The Surface Book, a notebook with a detachable tablet screen. Some variants of the base include discrete graphics. * The Surface Studio, a 28-inch all-in-one desktop that adjusts into a digital drafting table with stylus and on-screen Surface Dial support. * The Surface Hub, a touch screen interactive whiteboard designed for collaboration. * The Surface Duo, a dual-screen foldable smartphone, running Android unlike the other Surface devices. Operating system support Model Release Support Line Surface OS Date Final OS Ended Lifespan Surface Surface RT Windows RT October 26, 2012 Windows RT 8.1 Update 3 January 10, 2023 10 years, 2 months Surface 2 Windows RT 8.1 October 22, 2013 Windows RT 8.1 Update 3 January 10, 2023 9 years, 2 months Surface 3 Windows 8.1 Update May 5, 2015 Windows 10 version 22H2 October 14, 2025 9 years, 6 months Surface Go Surface Go Windows 10 version 1709 August 2, 2018 Windows 10 version 22H2 October 14, 2025 6 years, 3 months Surface Go 2 Windows 10 version 1809 May 12, 2020 Latest Windows Active 4 years, 6 months Surface Go 3 Windows 11 version 21H2 October 5, 2021 Latest Windows Active 3 years, 1 month Surface Go 4 Windows 11 version 22H2 October 3, 2023 Latest Windows Active 1 year, 1 month Surface Pro Surface Pro X (1st) Windows 10 version 1903 November 5, 2019 Latest Windows Active 5 years Surface Pro X (2nd) Windows 10 version 2004 October 13, 2020 Latest Windows Active 4 years, 1 month Surface Pro 7+ Windows 10 version 2004 January 11, 2021 Latest Windows Active 3 years, 10 months Surface Pro 8 Windows 11 version 21H2 October 5, 2021 Latest Windows Active 3 years, 1 month Surface Pro 9 Windows 11 version 22H2 October 25, 2022 Latest Windows Active 2 years Surface Pro 10 Windows 11 version 23H2 April 9, 2024 Latest Windows Active 7 months Surface Pro (11th generation) Windows 11 version 24H2 June 18, 2024 Latest Windows Active 4 months Surface Laptop Surface Laptop Windows 10 version 1703 June 15, 2017 Windows 10 version 22H2 October 14, 2025 7 years, 5 months Surface Laptop 2 Windows 10 version 1709 October 16, 2018 Latest Windows Active 6 years, 1 month Surface Laptop 3 Windows 10 version 1809 October 22, 2019 Latest Windows Active 5 years Surface Laptop 4 Windows 10 version 20H2 April 20, 2021 Latest Windows Active 3 years, 6 months Surface Laptop 5 Windows 11 version 22H2 October 25, 2022 Latest Windows Active 2 years Surface Laptop 6 Windows 11 version 23H2 April 9, 2024 Latest Windows Active 7 months Surface Laptop (7th generation) Windows 11 version 24H2 June 18, 2024 Latest Windows Active 5 months Surface Book Surface Book Windows 10 version 1507 October 26, 2015 Windows 10 version 22H2 October 14, 2025 9 years Surface Book with Performance Base Windows 10 version 1607 November 10, 2016 Windows 10 version 22H2 October 14, 2025 8 years Surface Book 2 Windows 10 version 1703 November 16, 2017 Windows 10 version 22H2 October 14, 2025 7 years, 1 month Latest Windows Active 7 years, 1 month Surface Book 3 Windows 10 version 1903 May 21, 2020 Latest Windows Active 4 years, 5 months Surface Studio Surface Studio Windows 10 version 1607 December 15, 2016 Windows 10 version 22H2 October 14, 2025 7 years, 11 months Surface Studio 2 Windows 10 version 1803 October 2, 2018 Latest Windows Active 6 years, 1 month Surface Studio 2+ Windows 11 version 22H2 October 25, 2022 Latest Windows Active 2 years Surface Hub Surface Hub Windows 10 Team version 1507 June 1, 2015 Latest Windows Active 9 years, 5 months Surface Hub 2S Windows 10 Team version 1703 April 17, 2019 Latest Windows Active 5 years, 6 months Surface Hub 3 Windows 11 version 22H2 October 3, 2023 Latest Windows Active 1 year, 1 month Surface Duo Surface Duo Android 10 September 10, 2020 Android 12.1 September 10, 2023 3 years Surface Duo 2 Android 11 October 5, 2021 Android 12.1 October 21, 2024 3 years, 1 month ==References== == Other websites == *",
 "title": "Microsoft Surface"
}