{
 "id": "1148359",
 "text": "Wilmarth Sheldon Lewis (June 29, 1895 – October 7, 1979) was an American scholar, collector, and the preeminent authority on the English writer and politician Horace Walpole. Known as W.S. Lewis, he dedicated much of his life to collecting Walpole's writings, letters, and related artifacts, ultimately founding the Lewis Walpole Library at Yale University in Farmington, Connecticut. == Early Life and Education == Wilmarth Sheldon Lewis was born on June 29, 1895, in Alameda, California. He attended Yale University, where he became enamored with eighteenth-century British history and literature, with a particular interest in Horace Walpole. He graduated in 1918 and later pursued a lifelong interest in Walpole’s work and the cultural milieu of eighteenth- century Britain. == Career == Lewis began his career as an author and editor, contributing to various publications. However, his major scholarly work focused on Horace Walpole, an English writer, art historian, and antiquarian best known for his correspondence and his Gothic novel The Castle of Otranto. Lewis’s research led him to collect a vast archive of Walpole's letters, manuscripts, and other materials, which he meticulously organized and annotated over the years. == The Lewis Walpole Library == In 1917, Lewis began collecting Walpole materials, which grew into one of the most extensive collections of eighteenth-century British history in the world. In 1930, he and his wife, Annie Burr Auchincloss Lewis, established their residence in Farmington, Connecticut, where he continued expanding the collection. Lewis ultimately donated his collection to Yale University, leading to the establishment of the Lewis Walpole Library. Today, the library remains a renowned research center for the study of eighteenth-century Britain, housing over 45,000 volumes and 300,000 prints, drawings, and manuscripts. == Publications == Throughout his career, W.S. Lewis published numerous works related to Horace Walpole and his era. His most significant contribution was editing and publishing The Yale Edition of Horace Walpole's Correspondence, a comprehensive 48-volume set that documented Walpole's extensive letters. === Selected Works === * The Yale Edition of Horace Walpole's Correspondence (48 volumes) * Collector’s Progress – an autobiography detailing Lewis’s journey as a collector and scholar * Horace Walpole’s Library – a study on the organization and significance of Walpole's collection == See Also == * Lewis Walpole Library * Horace Walpole * Yale University Library == References == == Other websites == * Lewis Walpole Library at Yale University * Yale University Press Category:1895 births Category:1979 deaths Category:American writers Category:American politicians",
 "title": "Wilmarth Sheldon Lewis"
}