{
 "id": "1148128",
 "text": "The Wami River is a major river in Tanzania that flows through the eastern part of the country and empties into the Indian Ocean. It spans approximately 570 kilometers (350 miles), traversing several regions including the Morogoro and Pwani regions, before reaching its delta at the Saadani National Park along the coastline. == Geography == The Wami River originates in the Eastern Arc Mountains in Tanzania. Its course travels eastward, providing a critical water source for various ecosystems and communities along its banks. As it reaches the coast, the river widens and eventually forms a delta within Saadani National Park, where it meets the Indian Ocean. == Ecology == The Wami River basin encompasses diverse habitats, ranging from montane forests in the highlands to mangroves and coastal ecosystems in its lower reaches. The river supports numerous species, including fish, reptiles, and mammals. The lower basin and delta regions are known for populations of hippos and crocodiles. Additionally, the river provides vital freshwater habitats for aquatic species and serves as a migratory route for various bird species. == Human Impact == The Wami River basin is an important water source for agriculture, particularly for rice and other crops. Its waters are also used for livestock and domestic purposes in surrounding communities. However, increased agricultural activities, deforestation, and population growth have raised concerns over the depletion and contamination of the river's water, which may threaten the river’s ecosystems and biodiversity.https://www.crc.uri.edu/download/wami_profile_tagged_final_Nov08.pdf == Conservation == Sections of the Wami River and its surrounding ecosystems are protected under the Saadani National Park. Conservation efforts focus on safeguarding the habitats for wildlife and maintaining water quality to support both biodiversity and local communities. Some initiatives involve collaborations between the Tanzanian government, NGOs, and international conservation organizations.https://web.archive.org/web/20120322201351/http://www.gwclim.org/presentations/session5/kalugendo.pdf == See also == * List of rivers of Tanzania * Saadani National Park * Indian Ocean == References == Category:Rivers",
 "title": "Wami River"
}