{
 "id": "1148255",
 "text": "Lee Sun-mi (; born Sun Mi, May 2, 1992), known by her first name, Sunmi, is a South Korean singer and dancer. She is also a songwriter and record producer. She made an album in 2007 as a part of South Korean girl group Wonder Girls. Sunmi left the group in 2010 to go after her education. After three years, Sunmi went back to her job as a singer. == Early life == Sunmi was born on May 2, 1992 in South Korea. She went to Dongguk University. Sunmi revealed on a 2018 episode of Talkmon that she first decided to become famous when she was 12. Sunmi went to Seoul to try out and was a JYP Entertainment trainee at 14. Her father died three months before she was a part of the Wonder Girls. Sunmi later used her stepfather's last name Lee while in university. She put it together with her first name and last name. This made her new name Lee Sun-mi. == Career == === 2006–2012: Debut with Wonder Girls and break === In May 2006, Sunmi was the fourth member of Wonder Girls. Wonder Girls was a girl group run by JYP Entertainment. The group made the single \"Irony\", on February 10, 2007. The Wonder Girls later made their hits \"Tell Me\", \"So Hot\" and \"Nobody\" within two years. Sunmi and the Wonder Girls went on tour with the Jonas Brothers. Sunmi used the nickname Mimi. In January 2010, JYP said that Sunmi would be leaving the Wonder Girls to go after her education. Sunmi would continue until February. On January 13, 2012, JYP Entertainment said that there were no plans for Sunmi to return to singing and come back as a member of Wonder Girls. === 2013–2016: Solo debut with Full Moon, Wonder Girls return === In August 2013, Sunmi had come back to her music career. Sunmi's single, \"24 Hours\" , was let out on August 26, 2013. It shortly was an all-kill on music charts. Her extended play, Full Moon, was let out on February 17, 2014. The song was at number two on the Gaon Digital Chart and at number three on Billboard's K-pop Hot 100. Sunmi was said to have gotten a classy role of \"sexy\". On June 24, 2015, JYP Entertainment said that Sunmi would be part of the Wonder Girls again after leaving in 2010. Sunmi played the bass. In August, the group's album Reboot was let out. Sunmi partly wrote and produced three of its tracks. === 2017–2021: Wonder Girls final end, Warning, tour, and 1/6 === On January 26, 2017, it was said that Wonder Girls were to end after problems with Yeeun and Sunmi. Wonder Girls let out their last single, \"Draw Me\", on February 10, 2017. The song was also a celebration for their tenth anniversary. In March, Sunmi signed with Makeus Entertainment. In August, she let out her single \"Gashina\". It was produced by Teddy Park of The Black Label. The song was at number 2 on the Gaon Digital Chart. Gashina was named the Third Best K-pop Song of 2017 by Billboard. Sunmi made a single named \"Heroine\" on January 18, 2018. On September 4, Sunmi let her second extended play. It was called Warning. Sunmi also let out the lead single, \"Siren\". \"Siren\" was an all-kill on six local music charts. Warning was named the third best K-pop album of 2018 by Billboard and Bravo. From February to June 2019, Sunmi held her first world tour. It was called Warning. Tickets for the concert in Seoul sold out in five seconds after opening. On March 4, 2019, Sunmi let out a single called \"Noir\". After ending her world tour, she let out her single \"Lalalay\" on August 27, 2019. Sunmi let out her third extended play 1/6 (one sixth) on August 6, 2021. The lead single, \"You Can't Sit with Us\", was let out on the same day. On October 11, Sunmi let out the new digital single \"Go or Stop?\". === 2022–present: \"Heart Burn\" and tour === On June 8, 2022, Sunmi's agency said that she would make a new single called \"Heart Burn\" on June 29. On June 30, 2022, the agency said that Sunmi would be having an world tour called \"Good Girl Gone Mad\". It was held in Europe and America. == Personal life == Sunmi has borderline personality disorder. Sunmi wrote about it in her song \"Borderline\". \"Borderline\" was let out in August 2021. == Discography == Extended plays * Full Moon (2014) * Warning (2018) * 1/6 (2021) == Videography == === Music videos === Title Year Director Ref. \"24 Hours\" 2013 Naive Creative Production \"Full Moon\" 2014 \"Gashina\" 2017 Choi Yongseok (Lumpens) \"Heroine\" 2018 \"Siren\" \"Noir\" 2019 \"Lalalay\" \"Gotta Go\" 2020 NOVVKIM (NOVV) \"Pporappippam\" Ziyong Kim (Fantazy Lab) \"BORDERLINE\" NEWSTONE (KAK STUDIO) \"When We Disco\" Naive Creative Production \"Tail\" 2021 Paranoid Paradigm (VM Project Architecture) \"You Can't Sit with Us\" Seong Wonmo (Digipedi) \"Go or Stop?\" Pixelzero (PXZO) \"Heart Burn\" 2022 Seong Wonmo (Digipedi) \"Stranger\" 2023 \"Balloon in Love\" 2024 Kim Min-jae == Filmography == === Television series === Year Title Role Notes 2015 The Producers Herself Cameo (Episode 3) === Web series === Year Title Role Notes 2018 YG Future Strategy Office Herself Cameo (Episode 4) 2020 XX Customer Cameo (Teaser) === Television shows === Year Title Role Notes 2014 Fashion King Korea Contestant (Season 2) 2018 Secret Unnie Cast with Kang Seul-gi (Ep. 3–9) with Kim Hyo-yeon and Han Chae-young (Ep. 9) with Han Chae-young, Kang Seul-gi and Kim Ye-ri (Ep. 16) 2020 Running Girls Cast member with Hani, YooA, Chungha and Chuu 2020–present Sing Again Judge Season 1–3 2021 Girls Planet 999 Mentor 2023 Boys Planet Star master Episode 2 === Web shows === Year Title Role Notes 2020 RReal World Regular host with her two brothers 2022–2023 Sunmi's Show! Interview Host YouTube SBS == Concerts and tours == === Sunmi the 1st World Tour: Warning === Tour dates Date City Country Venue February 24, 2019 Seoul South Korea Yes24 Live Hall March 6, 2019 San Francisco United States Regency Ballroom March 7, 2019 Los Angeles The Fonda Theatre March 10, 2019 Seattle Showbox SoDo March 11, 2019 Vancouver Canada Vogue Theatre March 13, 2019 Calgary The Palace Theatre March 15, 2019 New York City United States The Town Hall March 16, 2019 Toronto Canada Queen Elizabeth Theatre March 18, 2019 Washington, D.C. United States Lincoln Theatre March 21, 2019 Mexico City Mexico Auditorio Blackberry April 13, 2019 Hong Kong China KITEC Star Hall May 10, 2019 Taipei Taiwan Taiwan University Sports Centre May 23, 2019 Tokyo Japan Tsutaya O-East May 30, 2019 London United Kingdom Indigo at The O2 June 2, 2019 Warsaw Poland Progresja June 4, 2019 Amsterdam Netherlands Q-Factory June 6, 2019 Berlin Germany Huxley's Neue Welt June 7, 2019 Paris France La Cigale June 15, 2019 Seoul South Korea Yes24 Live Hall === 2022 Sunmi Tour: Good Girl Gone Mad === Tour dates Date City Country Venue Attendance August 14, 2022 Warsaw Poland Progresja — August 17, 2022 Madrid Spain Palacio Vistalegre — August 19, 2022 Offenbach Germany Capitol Theater — August 21, 2022 London United Kingdom Troxy 3,000 August 23, 2022 Amsterdam Netherlands Melkweg — August 26, 2022 Paris France Salle Pleyel — August 28, 2022 Helsinki Finland Kulttuuritalo — September 2, 2022 Chicago United States Riviera Theatre — September 4, 2022 New York City Terminal 5 3,000 September 6, 2022 Toronto Canada Massey Hall — September 8, 2022 Atlanta United States Tabernacle — September 10, 2022 Seattle Showbox SoDo — September 12, 2022 Los Angeles Wiltern Theatre — September 13, 2022 San Francisco Warfield Theatre — September 15, 2022 Vancouver Canada Queen Elizabeth Theatre — October 8, 2022 Seoul South Korea Yes24 Live Hall — === Online concerts === * Good Girl Gone Mad (2021) === Listicles === Name of publisher, year listed, name of listicle, and placement Publisher Year Listicle Rank Forbes 2018 Korea Power Celebrity 29th 2019 24th == Notes == == References == == Other websites == * Category:1992 births Category:JYP Entertainment artists Category:K-pop singers Category:South Korean singer-songwriters Category:South Korean record producers Category:Synth-pop singers",
 "title": "Sunmi"
}