{
 "id": "1148067",
 "text": "The reconquista of the Southwestern United States of America – \"taking back by force\" of the Southwestern United States of America – is a thought some people have. The reconquista of the Southwestern United States of America is the plan that the Southwestern United States of America should be part of Mexico again. Some people think the reconquista of the Southwestern United States of America must be done in laws. Some people think the reconquista of the Southwestern United States of America must be done in culture. The reconquista of the Southwestern United States of America is a thought about taking back what is rightfully someone else's. The reconquista of the Southwestern United States of America is also known as advocating a Greater Mexico. Many people want the reconquista of the Southwestern United States of America to happen because the Southwestern United States of America was said to be under the law of other countries for hundreds of years. Those other countries were: Spain; then Mexico. Mexico said some parts of the Southwestern United States of America were under their rule from 1821–1845. Mexico said some parts of the Southwestern United States of America were under their law from 1821–1848.https://www.bloomsbury.com/9781608195046 ==Things that happened in the past== Those parts of the United States of America with the most Mexican things are the same as the parts of the United States of America which were parts of Mexico until the 19th century. Those Mexican things are: immigration; culture.https://global.oup.com/academic/product/speaking- american-9780190232603 ==What people who write about culture think of the reconquista of the Southwestern United States of America== ===What Mexican writers think of the reconquista of the Southwestern United States of America=== There is an article written in 2001. This article is on Terra. Terra is a Latin American web portal. This article is called \"Advancement of the Spanish language and Hispanics is like a Reconquista (Reconquest).\" This article is written by Elena Poniatowska. Elena Poniatowska says: This means Elena Poniatowska says: Carlos Fuentes gave a speech. The speech was in 2003. The sppech was the important speech at the begining of something. That something was a gathering of experts. In that speech Carlos Fuentes said: That means Carlos Fuentes said: In another part of his speech, Carlos Fuentes briefly talked again about his idea of \"reconquista\": That means Carlos Fuentes said: ===Nationalist Front of Mexico=== There is a group with unusual beliefs. That group is a group that says things about politics. That group is a group that believes things about politics. That group is named the Nationalist Front of Mexico. The Nationalist Front of Mexico says that the culture of the United States of America is Anglo culture. The Nationalist Front of Mexico dislikes Anglo-United States of American culture. The Nationalist Front of Mexico does not think a treaty is real. That treaty is the treaty which gave parts of Mexico to the United States of America. The Nationalist Front of Mexico thinks the United States of America is occupying those parts. That means the Nationalist Front of Mexico thinks the United States of America is holding those parts by military force. That means the Nationalist Front of Mexico thinks the United States of America is holding those parts for a short time. That means the Nationalist Front of Mexico thinks the United States of America will stop holding those parts at some timwe in the future. That means the Nationalist Front of Mexico thinks the people in those parts want the United States of America to stop holding those parts. On the Nationalist Front of Mexico's website, the Nationalist Front of Mexico says: That means the Nationalist Front of Mexico says: ===Charles Truxillo=== Charles Truxillo was a Chicano activist. Charles Truxillo was an adjunct professor of the University of New Mexico (UNM). Charles Truxillo thought about a new country. That new country would be named the República del Norte in the Spanish language. (The República del Norte would be \"Republic of the North\" in the English language.) The República del Norte would break apart from the United States of America and from Mexico. The República del Norte would have the southwestern United States of America and the northern part of Mexico.The República del Norte would be the Chicano nation state. Charles Truxillo wanted the southwestern United States of America to secede from the United States of America. That means Charles Truxillo wanted the southwestern United States of America to break apart from the United States of America. Charles Truxillo wanted the southwestern United States of America to become a new Chicano nation. Charles Truxillo said that the Articles of Confederation make the states of the United States of America have all control of their own laws. Charles Truxillo said that the Articles of Confederation give the states of the United States of America the right to break away from the United States of America. Charles Truxillo taught at the University of New Mexico's Chicano Studies Program. The University of New Mexico's Chicano Studies Program asked Charles Truxillo to work for them before each year began. They did not hire him forever. Someone interviewed Charles Truxillo. In the interview, Charles Truxillo said that: That means that in the interview, Charles Truxillo said that: Charles Truxillo said that Hispanic Americans who are \"enjoying the benefits of assimilation\" are most likely of all Americans to be against the Reconquista of the southwest United States of America. \"Enjoying the benefits of assimilation\" means being in power or some having some other good things from being part of normal Americans. Charles Truxillo then said: Charles Truxillo meant: Charles Truxillo believed that the República del Norte will be brought into being by \"any means necessary.\" However, Charles Truxillo believed that it will likely not be made by civil war. Charles Truxillo believed that it will likely be made by the rising number of votes of a group of people. That group of people is the Hispanic–Americans in the southwestern United States of America. Charles Truxillo believed that, in years to come, that number of votes will rise high enough to make the República del Norte. Charles Truxillo believed that that number of votes will rise high enough to make the República del Norte because the Hispanic–Americans in the southwestern United States of America will be most of the people in the southwestern United States of America.Tancredo Praises Cuesta's Book Exposing Hispanic Autonomy Arising From Immigration , Prleap.com (reprinted on Wexico.com), 30 April 2007. Charles Truxillo added that he believed he morally had to help build a \"cadre of intellectuals\" to think about how the República del Norte could become a real thing. That means: Charles Truxillo added that he believed he morally had to help build a \"group of thinkers who will fight with thoughts as if they are in a war\" to think about how the República del Norte could become a real thing. In 2007, the University of New Mexico decided to not hire Charles Truxillo for the next year. Charles Truxillo said that they did not hire him any more because of his far out beliefs. Charles Truxillo said \"Tenure is based on a vote from my colleagues. Few are in favor of a Chicano professor advocating a Chicano nation state.\" That means: Charles Truxillo said \"Whether I get to be hired by the University of New Mexico is based on a vote from those who teach at the University of New Mexico. Few of those who teach at the University of New Mexico want a Chicano university teacher who says he wants a special country for Chicanos.\" ===José Ángel Gutiérrez=== José Ángel Gutiérrez is a teacher at the University of Texas at Arlington. José Ángel Gutiérrez teaches about politics. José Ángel Gutiérrez also speaks for the reconquista of the southwestern United States of America. José Ángel Gutiérrez talked with In Search of Aztlán on 8 August 1999. José Ángel Gutiérrez said: That means José Ángel Gutiérrez said: ==What the reconquista of the Southwestern United States of America is doing to cultures== The refusal of the United States of America to officially recognize immigrant languages betrays the United States of America's identity as a nation of immigrants.http://heinonline.org/hol-cgi- bin/get_pdf.cgi?handle=hein.journals/gjicl36&section;=10 Some international organizations push the government of the United States of America to recognize immigrant languages.http://www.aljazeera.com/news/2023/7/24/indigenous-groups- say-they-are-left-out-of-us-immigration-debate ===Rise of the Spanish culture in the United States of America=== The amount of Spanish culture in the United States of America is going up because of immigration. The number of people speaking the Spanish language in the United States of America is going up because of immigration. ===Rise of the Nahuatl culture in the United States of America=== Activists could make the number of Nahuatl speakers in the United States of America go up. Activists could make people think of Mexico and the United States of America as the same Nahuatl culture.Nahuatl across Borders: Mexican Transnationalism in the United States. Magnus Pharao Hansen. http://doi.org/10.1093/oso/9780197746158.003.0007 Pages 221–256. Published: August 2024. The amount of Nahua culture in the United States of America is going up because of immigration. ===Rise of the Mayan culture in the United States of America=== The amount of Mayan culture in the United States of America is going up because of immigration.http://www.kut.org/news/2015-11-05/as-mayan-speakers-immigrate- their-ancient-language-is-often-lost-in-translation ===Rise of the Zapotec culture in the United States of America=== The amount of Zapotec culture in the United States of America is going up because of immigration. ===Rise of the Mixtec culture in the United States of America=== The amount of Mixtec culture in the United States of America is going up because of immigration. ===Rise of the P'urepecha culture in the United States of America=== The amount of P'urepecha culture in the United States of America is going up because of immigration.Díaz de León-Martínez et al., 2020 and Caxaj et al., 2020 say good things about this paper: http://journals.sagepub.com/doi/10.1177/0002716219848342 ===Rise of the Hñañus culture in the United States of America=== The amount of Hñañus culture in the United States of America is going up because of immigration.http://www.migrationpolicy.org/article/hidden-plain-sight- indigenous-migrants-their-movements-and-their-challenges ==The reconquista of the southwest United States of America is happening now== In 2001, a former county commissioner of El Paso, Texas said to the world \"We are all Mexicans in this valley.\" In 2009, an article in Foreign Policy magazine said that \"Demographically, socially, and culturally, the reconquista (re-conquest) of the Southwest United States by Mexican immigrants is well underway.\" That means that the Reconquista of the southwest United States of America was already happening strongly by 2009.http://foreignpolicy.com/2009/10/28/the- hispanic-challenge/ People are becoming more interested in the reconquista of the southwest United States of America.http://doi.org/10.4324/9781315642918-8 ===Mexican–American gentrification=== The changes the way the Reconquista of the southwest United States of America happens. That means: The change in attitudes of Mexican–Americans to become more like the attitudes of rich people changes the way the Reconquista of the southwest United States of America happens. The gentrification of Mexican–Americans changes which parts of the United States of America Mexican–Americans live in. That means: The change in attitudes of Mexican–Americans to become more like the attitudes of rich people changes which parts of the United States of America Mexican–Americans live in.http://borderlessmag.org/2022/03/01/making-mexican- chicago-little-village-pilsen-immigrants-gentrification/ ===Latino–Americans not becoming just like other Americans=== Latino–Americans not becoming just like other Americans is also named Latino–American rejection of assimilation. Latino–Americans not becoming just like other Americans is also named Latino–Americans not assimilating.http://www.npr.org/transcripts/1087164013http://www.nbcnews.com/news/latino/racism- not-lack-assimilation-real-problem-facing-latinos- america-n974021http://www.nbcnews.com/news/latino/bicultural-latinos-embrace- dual-identities-shun-pressure-assimilate- rcna2149http://www.aspeninstitute.org/blog-posts/the-invisible-latino-in- america/ ===Illegal immigrant ineligibility for welfare=== It is almost always against the law for those in the United States of America against the law to get public assistance benefits. Not being allowed to use welfare is often a worry for Mexican–Americans.http://www.nilc.org/resources/overview- immeligfedprograms/ These laws are enforced by DHS.http://michiganimmigrant.org/sites/default/files/what-immigrants-need-to- know-about-snap-fap-english.pdf ==See also== *Manifest Destiny *MEChA *Mexica Movement *Plan Espiritual de Aztlán ==References== Category:Mexican irredentism Category:Demographics of the United States Category:Hispanic and Latino demographics in the United States Category:Immigration to the United States",
 "title": "Reconquista (Mexico)"
}