{
 "id": "1148153",
 "text": "Pietro Rava (; 21 January 1916 – 5 November 2006) was an Italian football defender and coach, who played as a full-back. He won the 1936 Summer Olympics and the 1938 FIFA World Cup with the Italy national team. Defined by the then coach of the Italian team, Vittorio Pozzo, as \"the most powerful full-back in the world\", he is remembered for having formed with the aforementioned Foni one of the most famous defensive pairs expressed by Juventus and, more generally, by Italian football in its history. Described by Carlo Felice Chiesa as \"physically handsome, strong with his head, capable of hitting with both feet, skilled in anticipation\" he was a full-back \"dry in gesture, quick in his entries, agile in offensive incursions but always with the hastiness of a vocation interdictor\". In 1938, in Calcio Illustrato, Ettore Berra compared Rava's \"momentum\" to that of Umberto Caligaris: his entrances were spectacular (\"he faces the opponent impetuously with that irruptive enthusiasm of his so beautiful and suggestive\"), his powerful shot (\"the leg stretches out in the rebound to reach maximum shooting power\") and he frequently allowed himself offensive incursions \"trumpeting the midfielders and reaching the sector advanced\". Berra himself highlighted the differences with his teammate Foni, whose style of play was \"more composed, more controlled\": in his opinion, \"the skills of the two players complemented each other\". Usually regarded as one of the best left-backs of all time. ==Club career== Rava appeared at Juventus in 1935. The Turin team had just completed, in the middle of that year, a series of five consecutive victories in the Italian Football Championship, between the 1930-31 and 1934-35 seasons; Rava was not part of the final conquest of 1934-35, but the following year he was able to be part of the Italian team that won the gold medal in football at the 1936 Summer Olympics, when such competition was still restricted to amateur athletes. Before the fifth championship, then something unprecedented in the tournament and only surpassed by the sixth championship of the same club between 2012 and 2017, Juve had only two titles in Serie A, having one more than rivals Torino and the same two of Internazionale and Bologna, and less than the three of Milan, the seven of Pro Vercelli and the nine of the then record holder Genoa. The series of achievements helped the club become the most popular in the country. However, exactly from the moment Rava was integrated into the club, the achievements in Serie A ceased for fifteen years.[citation needed] Between 1935 and 1950, the team was able to be champion twice, but in the Italian Cup. They were the team's first titles in this competition. The first was in the 1937-38 season, immediately preceding the 1938 FIFA World Cup, and was obtained in the final precisely against rival Torino. The other came in the 1941-42 season and served to surpass Toro in number of victories in the tournament. In the Italian league, in turn, Bologna and Internazionale (Ambrosiana) alternated in the titles in the second half of the 1930s; and the 1940s were marked by the interruption caused by the Second World War and the dominance of Grande Torino, with the rival also obtaining a fifth consecutive championship.[citation needed] After the war, Rava initially played for Alessandria, scoring five goals, all from the penalty spot, in the 1946–47 season, returning to Juventus the following season. Rava only managed to become Italian champion in his last season with Juve, in 1950, in the edition following Torino's last consecutive victory, which in 1949 had again had one less title (six against seven) than the Vecchia Signora. The 1949-50 title was the eighth in the club's history, also isolating it ahead of Pro Vercelli as the second most champions, leaving Juventus one achievement below the then record holder Genoa. For Rava, it served to make him the only athlete to, along with teammates Alfredo Foni and Ugo Locatelli, win this competition and also the Italian Cup, the Olympics and the World Cup. After the conquest, he continued his career at Novara, retiring in 1952. ==International career== Rava made his debut for the Italian national team at the 1936 Olympics, on August 3 of that year, in a 1–0 victory over the United States in Berlin. The Azzurri won gold and Rava was integrated into the senior team - the Olympics were still restricted to amateurs. And they faced Norway in the opening of the 1938 FIFA World Cup, in which the score was curiously the same as the Olympic final, at 2-1. Before the Cup, Rava had won the 1937–38 Coppa Italia with Juventus, in the final against rivals Torino, in Juventus' first win in that competition. In addition to Rava, his Juventus defensive duo Alfredo Foni and striker Ugo Locatelli were other parts of the victorious Olympics integrated into the senior team, which was rejuvenated and greatly altered from the 1934 FIFA World Cup-winning squad, with only Giuseppe Meazza and Giovanni Ferrari remaining in the starting lineup. The 1938 team was considered even better than the 1934 team, with the duo of Rava and Foni being seen as safer. They were precisely the only two Juventus players who started for the national team in that Cup. Rava was the last of the 1938 champion starters to pass away, still alive at the time of 2005. Rava was in all the matches, remaining even after a disappointing debut against the Norwegians, with him and the entire defensive sector having a great performance especially in the half hour of the final, in which Hungary was most of the time losing by only 3-2 until Silvio Piola closed the score at 4-2. After the World Cup, Rava played fifteen more times for the Azzurri, twelve of them until 1940, another two in 1942 and a final one on 1 December 1946, in a 3–2 victory over Austria in Milan. In the last match, Rava already played as a player for Alessandria. There were no matches for the national team between 1942 and 1945, as a result of World War II - a conflict that also prevented Rava from eventually playing in the hypothetical World Cups of 1942 and 1946, for which Italy was one of the teams most capable of winning. ==Honours== ===Club=== ;Juventus * Serie A: 1949–50; Runner-up: 1937–38, 1946–47 * Serie A-B Runner-up: 1945–46 * Coppa Italia: 1937–38, 1941–42 ===International=== ;Italy * Olympic Gold Medal: 1936 * FIFA World Cup: 1938 ===Individual=== * 1938 FIFA World Cup All-star Team ==References== ==Further reading== *Player bio - www.tifonet.it - Retrieved November 2006. *Rava's statistics at Juventus - www.myjuve.it - Retrieved November 2006. *Pietro Rava - International Appearances - www.rsssf.com - by Roberto Di Maggio, RSSSF. * \\---- is stated as fact: website FIFA in November 2009 introduced some changes in date of birth the player's instead 21 January 1916 (originally written) wrote 12 January 1916 !colspan=\"3\" style=\"background:#C1D8FF;\"| World Cup-winners status |- Category:1916 births Category:2006 deaths Category:Accidental deaths from falls Category:Italian footballers Category:Italy men's international footballers Category:Association football defenders Category:US Alessandria Calcio 1912 players Category:Juventus FC players Category:Novara FC players",
 "title": "Pietro Rava"
}