{
 "id": "1148152",
 "text": "Conquest of Kujula Kadphises is a the millitary conquest of Kushan Empire’s King Kujula Kadphises, in which he completely defeated the Four Yuezhi Kingdoms and Indo-Parthian Kingdom along with his commerical relations with Roman Empire. These conquests by Kujula Kadphises probably took place between AD 45 and 60 and laid the basis for the Kushan Empire which was rapidly expanded by his descendants. ==Conquest== ===Defeat of Yuezhi Kingdoms=== Not much detail is available on this conquest but Kujula Kadphises of Kushan Empire said to have defeated and overthrown Four Yuezhi Kingdoms. ===Conquest of Anxi=== Kujula Kadphises' conquests are recorded in Chinese historical texts and seen in his coins and inscriptions from 122 and 136 CE. After defeating local rulers, he invaded Parthia (referred to as \"Ansi\") and took control of the kingdoms of Kao-fu, Pu-ta, and Ki-pin. \"Ansi\" likely refers to the Parthian dynasty in the east, to which Gondophernes (or Guduvhara) belonged. Kujula is called a prince or Kumāra in 103 CE, which could correspond to the 26th year of Gondophernes’ reign. Coins of other Parthian rulers like Abdagases and Pacores have been found in areas such as western Punjab and Kandahar, suggesting the region was still influenced by Parthian kings. Coins of both Pacores and Wima Kadphises were discovered together at Sirkap, alongside coins of Guduvhara, showing Greek and Kharoshthi inscriptions. By Gondophernes' time, governors' loyalty to their suzerains was weakening, and there is no evidence of a strong Parthian presence in northwestern India after Guduvhara. Some scholars also link the 1st-century ruler Phraotes of Taxila to Gondophernes, based on the similarity of their names. ===Conquest of Kabul and Taxila=== Kujula Kadphises likely defeated the Parthian king Gondophernes and took control of the Kabul region, possibly between A.D. 45 and A.D. 64. Coins from Gondophernes, Pacores, and Kujula Kadphises found in Sirkap suggest he conquered Taxila from Pacores' weak successor. The Taxila Silver Scroll (A.D. 136-78) mentions \"Mahārāja Rājātirāja Deva-putra Kushana,\" likely referring to Kujula Kadphises. He probably first conquered the western part of Gondophernes' empire before A.D. 122, with Gondophernes' successors likely becoming vassals. Abdagases’ attempt to claim the title of Mahārāja Rājātirāja may have led to his downfall, as the Kushan empire expanded to Taxila. Later records from the Hou-Han-Shu also suggest Kujula Kadphises conquered regions like Taxila, and neighboring areas. Scholars now believe these regions refer to Gandhara, not Kashmir. ==Relations with Roman Empire== The Kushan ruler, after conquering Parthia and Kabul, likely had closer contact with the Romans. Some of his coins imitate the bust of Hermaeus with a Greek inscription, and others resemble a Roman emperor's bust. Scholars debate which emperor is imitated—many think it's Augustus, but some, like Allan, suggest Claudius due to the design on the reverse. Prof. Basham notes Kujula's coins resemble both Augustus’s and Claudius’s. This imitation likely reflects trade, as Roman coins were used by Western merchants, influencing the Kushan coinage. == References == Category:1st- century conflicts Category:Ancient India Category:Wars involving Asia Category:Kushan Empire",
 "title": "Conquests of Kujula Kadphises"
}