{
 "id": "1148882",
 "text": "Michael Andrew Jace (born July 13, 1962) is an American former actor best known for his role as Officer Julien Lowe on the FX television series The Shield. His acting career came to an abrupt end in 2014 when he was convicted of murdering his wife, April Jace. == Early Life == Michael Jace was born on July 13, 1962, in Paterson, New Jersey, United States. Details about his early life and education remain sparse. Before embarking on an acting career, he was reportedly involved in theater. == Acting Career == Jace began his acting career in the early 1990s, appearing in minor roles in television and film. His breakout role came in 2002 when he was cast as Officer Julien Lowe, a deeply religious and conflicted LAPD officer, in the FX crime drama series The Shield. He appeared in the series throughout its entire run (2002–2008). * Forrest Gump (1994) – Black Panther member * Boogie Nights (1997) – Jerome * Planet of the Apes (2001) – Major Frank Santos * CSI: Crime Scene Investigation – Guest role * ER – Guest role Jace's career included a mix of guest roles on television and supporting roles in films. Despite his talent, he was largely recognized for his role in The Shield. == Legal Issues == In 2014, Michael Jace was arrested and later charged with the murder of his wife, April Jace. The incident occurred on May 19, 2014, at their Los Angeles home, following a domestic dispute. April Jace, a financial aid counselor and mother of two of Jace's children, was shot multiple times. During his trial, Jace admitted to the killing but claimed it was not premeditated. He was found guilty of second-degree murder in 2016 and sentenced to 40 years to life in prison. == Personal Life == Michael Jace was married twice. His first marriage, to Jennifer Bitterman, ended in divorce in 2002. He married April Jace in 2003, with whom he had two sons. Following April Jace's death, their children were placed under the care of relatives. == Filmography == === Film === * Forrest Gump (1994) – Black Panther member * Boogie Nights (1997) – Jerome * Planet of the Apes (2001) – Major Frank Santos === Television === * The Shield (2002–2008) – Officer Julien Lowe * CSI: Crime Scene Investigation – Guest role * ER – Guest role * NYPD Blue – Guest role == References == == Other websites == * Category:American actors Category:American people convicted of murder Category:1962 births Category:Living people",
 "title": "Michael Jace"
}