{
 "id": "1148721",
 "text": "After the creation of Pakistan in 1947, among the various opinions on the question of the state language, many recommended Arabic to be the state language of Pakistan, Which was later supported and repeated by many, but the proposal ultimately did not gain the public support and popularity it had hoped for. == Proposals == === From Mohammad Shahidullah === According to Badruddin Umar, this proposal was first made by Muhammad Shahidullah on behalf of the East Pakistan Arabic Language Association in December 1949. Muhammad Shahidullah believed that Bengalis could learn Urdu as well as English, and he also believed that: \"The day Arabic becomes the state language of Pakistan, the creation of the state of Pakistan will be justified.\" Therefore, in December 1949, he assumed the presidency of the East Pakistan Arabic Language Association for this purpose, and approved a draft memorandum to be presented to the People's Assembly, recommending that Arabic be made the state language of Pakistan and requesting the government to provide 'Darse Quran' or Quran education in various city centers and districts. === Ayub Khan === Ayub Khan emphasized in his education plan the adoption of Urdu and English as the primary state languages of Pakistan and Arabic as a secondary language. === Rajshahi college === On January 18, 1950, some students of Rajshahi College called a meeting demanding that Arabic be made the state language. === East Pakistan Muslim League Council === In January 1950, the East Pakistan Muslim League Council adopted a proposal to make Arabic the state language. The proposal was moved by Chowdhury Moazzem Hossain (Lal Niya), a member of the Gana Parishad from East Bengal. === State Bank Governor Zahid Hossain === 3 State Bank Governor Zahid Hossain proposed to make Arabic the state language, and this proposal was supported by Syed Akbar Shah, then a member of the Sindh Legislative Council and Vice-Chancellor of Sindh Arabic University. === Sultan Muhammad Shah Aga Khan === On 1 February 1951, at the World Muslim Conference in Karachi, the leader of the Ismaili community, Aga Khan, said that making Arabic the official language of Pakistan would establish common communication between Muslims in the Arab world, North Africa and Indonesia.ред == Opposition == On February 10, 1951, Rabindranath Burmi, Secretary of the Pakistan Buddhist League, issued a statement opposing these proposals to make Arabic the state language, in which he supported Urdu instead of Arabic. == Results == These proposals to make Arabic the state language did not gain much support in any part of Pakistan. However, according to Badruddin Umar, since this demand is related to the question of the development of Islamic culture, it indirectly strengthens the demand in some quarters for the introduction of Arabic script in the state language Urdu and Bengali. == See more == * Arabic language in Islam * Arabization * Islamization * Bengali writing in Arabic script * Romanization of Bengali * Bengali Language Movement * Language Movement of East Bengal and politics of the time * Modern Standard Arabic * Quranic Arabic * Arabic grammar * Interpretation * Roman Urdu * Romanization of Arabic * Devanagari transliteration * Maltese language - a Romanized form of Ancient Arabic * Fiji Hindi - a Romanized form of Hindi == References == Category:Bengali Language Movement Category:Arabic language Category:Pakistan Category:Islam and Politics Category:Arabization Category:Islamization",
 "title": "Proposal for Arabic as state language of Pakistan"
}