{
 "id": "1148305",
 "text": "Tim Uppal (born November 14, 1974) is a Canadian politician, banker, and former radio host. He is the Member of Parliament (MP) for Edmonton Mill Woods. Before this, he was the Conservative MP for Edmonton—Sherwood Park from 2008 to 2015. On July 15, 2013, Uppal changed roles from Minister of State for Democratic Reform to Minister of State for Multiculturalism. Uppal's original riding was removed before the 2015 election, so he decided to run in the new riding of Edmonton Mill Woods. He lost to the Liberal candidate Amarjeet Sohi in 2015 but won the seat back from Sohi in the 2019 election. Uppal was re- elected in 2021. In 2022, Uppal was made Deputy Leader of the Opposition and Deputy Leader of the Conservative Party. == Early life == Uppal was born on November 14, 1974, in New Westminster, British Columbia, and grew up in Edmonton, Alberta. His family were Sikh immigrants from Punjab, India. From 1992 to 1997, he hosted a radio show on CKER in Edmonton. In 2004, he became a mortgage manager at TD Canada Trust. Uppal founded the South Edmonton Youth Group and has been part of the Capital Health Community Health Council since 2001. He was active in the Sherwood Park Chamber of Commerce, Sherwood Park Rotary Club, and helped start the Edmonton Police Community Advisory Council. == Member of parliament == In the 2000 federal election, Uppal ran for the Canadian Alliance in Edmonton Southeast, narrowly losing by under 5,000 votes. He ran again in 2004, losing by just 134 votes. In 2008, he won the Edmonton–Sherwood Park seat, becoming an MP for Alberta. In 2011, Uppal became Minister of State for Democratic Reform, making him the first turban-wearing Sikh in Canada’s cabinet. He worked on adjusting federal riding borders to balance populations. In 2013, he became Minister of State for Multiculturalism in a cabinet shuffle. == References == Category:Canadian politicians Category:1974 births Category:Politicians from Edmonton Category:Members of the House of Commons of Canada",
 "title": "Tim Uppal"
}