{
 "id": "1148990",
 "text": "South East (Fujian) Motor Co., Ltd., trading as Soueast, is a Chinese automobile manufacturer based in Fuzhou, Fujian, operating since 1995. Originally, is a joint venture between China Motor Corporation (25%), Fujian Motor Industry Group (50%) and Mitsubishi Motors (25%) before it was acquired by Chery in March 2024.Lagging far behind, Mitsubishi looks to new joint partnership chinadaily.com.cn, 2010-11-15Affiliated Companies - China Motor Corporation Yulon Group Official SiteMitsubishi Motors to invest in South East (Fujian) Motor Co., Ltd. of China Mitsubishi Official Site, April 12, 2006Activities by Region, Asia, 2009 Mitsubishi Official SiteAffiliated Companies - South East (Fujian) Motor Co., Ltd. Yulon Group Official Site == History == ===The Mitsubishi Era=== In May 1995, the joint-venture Soueast (Fujian) Automobile Industry was established, in which cooperation was established between the Chinese concern Fujian Motor Industry Group and the Taiwanese China Motor Corporation, a manufacturer of locally modified, licensed models of Mitsubishi. W ten sposób, Soueast również pozyskało prawa do lokalnej produkcji modeli japońskiej firmy pod własną marką, w 1996 roku przechodząc do wytwarzania vana Delica. Tuż po nim ofertę poszerzył odpowiednik tajwańskiego Veryca pod marką Soueast, a na początku XXI wieku ofertę chińskiej marki poszerzyły kolejne modele na czele z kompaktowym minivanem Freeca. After a decade of Soueast's operations, in April 2006 Mitsubishi Motors decided to enter the company directly as the third shareholder. In this way, in addition to the licensed and visually modified derivatives of the older products of the Japanese company under the Soueast brand, the production of selected, newer models with the Mitsubishi logo was also started in Fujian. In 2008, Soueast Motors exported a batch of 5,700 Delica minivans for the first time, winning a tender in Iran. In the meantime, in 2007, under an agreement with the American concern Chrysler, the Chinese Soueast plants launched the production of cars of two more brands, this time the twin minivans Chrysler Grand Voyager and Dodge Grand Caravan, which received other Mitsubishi-designed drive units for the needs of the local market. The second decade of the 21st century brought Soueast's independence in the area of its own brand products, gradually moving away to models directly derived from older Mitsubishi models. The compact sedan V5 Lingzhi presented in 2012 retained the technical components of the Japanese partner, but gained its own styling design. In the middle of the decade, Mitsubishi gradually limited its interest in the Soueast company, not introducing new models. In response, Soueast in 2016 undertook a major modernization of the range towards the increasingly popular SUVs and crossovers using Mitsubishi technology and an independent project commissioned by the Italian studio Pininfarina. The first were the DX7 and DX3, and in 2019 - the DX5. In the meantime, production of all Mitsubishi models came to an end, and the only classic sedan remained the A5. ===Chery Era=== Despite the intensive expansion of the offer at the turn of the second and third decade of the 21st century, Soueast sales collapsed in 2019 due to the general crisis of the new car market in China. Although in 2017 the company sold 85 thousand cars there annually, in 2019 the values first decreased to the level of 30 thousand units, a year later 14 thousand, and in 2021 - only 8 thousand cars. This crisis prevented the introduction of the flagship SUV model DX9, and the final period of Soueast Motors in its current form was sealed by Mitsubishi's complete withdrawal from the joint-venture company in 2021. In 2022, the company began cooperation with the Chinese concern Chery Automobile, as a result of which the Soueast offer was enriched by Soueast DX8 - a twin of one of the conglomerate's models, Jetour X70. Cooperation with Chery quickly reached an advanced stage, ending in 2023 with the company buying back 80% of Soueast's shares and investing in the modernization of production plants. In the same year, production of all previous models came to an end, starting a transition period that ended with Chery taking full control of Soueast in March 2024. Thus, after almost 30 years of operation, the company changed its status from a joint venture to one of the divisions of the Chery group. The new owner changed the character of the brand, making it closely related to the Jetour brand - all of the 3 new Soueast models presented in the fall of 2024 were twin derivatives of its SUVs. The subsidiary changed its character, disappearing from the Chinese market and going on sale in export markets as a diversification of the Chery brand portfolio. First, the revitalized Soueast debuted in Russia and Uzbekistan ==Products== ===Currently models=== *Soueast S06, rebadged Jetour Dashing *Soueast S07, rebadged Jetour X70 Plus *Soueast S09, rebadged Jetour X90 Plus === Discontinued models === *Soueast Veryca microvan (2008) *Soueast C1 Xiwang microvan (2011) *Soueast Delica minibus (1996) *Soueast Freeca (2001) *Soueast Lioncel (2003) *Soueast V3 Lingyue sedan (2008) *Soueast V5 Lingzhi sedan (2012) *Soueast V6 Lingshi hatchback (2013) *Soueast A5 Yiwu (2019) *Soueast DX3 (2016) *Soueast DX5 (2019) *Soueast DX7 Bolang SUV (2015) *Soueast DX8 (2018) *Soueast DX9 (2020) *SEM Delica/ Soueast EV500, rebadged King Long Kairui File:Soueast Veryca China 2012-04-28.JPG|Soueast Veryca File:Soueast C1 Xiwang 01 China 2017-03-30.jpg|Soueast C1 Xiwang File:SOUEAST DELICA (15).jpg|Soueast Delica File:2005 Soueast Freeca (facelift, front).jpg|Soueast Freeca File:Meter Taxi in Vientiane 01.jpg|Soueast Lioncel File:Soueast V3 Lingyue Facelift IV Sanming 01 2022-08-07.jpg|Soueast V3 File:Soueast V5 Lingzhi Plus 003.jpg|Soueast V5 File:Soueast V6 Lingshi front.jpg|Soueast V6 File:Soueast V6 Lingshi Cross 02 Auto China 2014-04-23.jpg|Soueast V6 Cross File:Soueast A5 Yiwu 01 China 2019-03-20.jpg|Soueast A5 File:SOUEAST DX3 (2).jpg|Soueast DX3 File:Soueast DX5, front 20200610.jpg|Soueast DX5 File:Soueast DX7 Xingyue 001.jpg|Soueast DX7 File:Soueast DX8S 01 China 2023-04-06.jpg|Soueast DX8S ===Mitsubishi-badged=== Soueast produces the following models under the Mitsubishi marque: *Lancer *Lancer EX *Lancer Fortis *Galant *Zinger ===Dodge marque=== *Dodge Caravan == References == == Other websites == * Official website * Official website Category:Automobile companies of China",
 "title": "Soueast"
}