{
 "id": "1149456",
 "text": "The Scottish Courts and Tribunals Service (SCTS) is an independent body responsible for managing Scotland's courts and tribunals. It was established in 2010 under the Judiciary and Courts (Scotland) Act 2008 to support the Scottish judiciary and ensure the efficient administration of justice. ==Overview== The SCTS provides services for the Court of Session, High Court of Justiciary, Sheriff Court, Justice of the Peace Court and various tribunals.http://legislation.gov.uk/asp/2008/6 ==Duties== * Managing court buildings and facilities * Maintaining the security of courts in partnership with Police Scotland * Providing administrative support to all courts and tribunals in Scotland * Ensuring access to justice for all individuals, including accommodations for persons with disabilities * Supporting the judiciary, including the Lord President of the Court of Session, who also serves as the head of the SCTS Board ==Governance== The SCTS is governed by a board chaired by the Lord President of the Court of Session, the most senior judge in Scotland. Other board members include judicial representatives, tribunal members and lay members with expertise in finance, business and public administration. The Chief Executive, Eric McQueen, oversees daily operations and implements the board's strategic vision.http://legislation.gov.uk/asp/2007/6 ==Court network== * Superior Courts: Court of Session and High Court of Justiciary * Justice of the Peace Courts: Handle minor criminal offenses * Sheriff Courts: Scotland's primary local courts for civil and criminal cases * Tribunals: Including the Lands Tribunal for Scotland and the Housing and Property Chamber ==Digital transformation== * Digital case management systems * Online payment systems for fines and fees * Remote hearing technology, especially during the COVID-19 pandemic ==Budget== For the financial year 2022–2023, the SCTS had an allocated budget of £153 million for court operations, facilities and staff salaries. ==Independence== Although the SCTS works closely with the Scottish Government, it operates independently to ensure judicial impartiality and uphold the rule of law in Scotland within the constitutional framework of the United Kingdom. ==Related pages== * Devolution * Sheriff Court * Court of Session * High Court of Justiciary * Justice of the Peace Court * Supreme Court of the United Kingdom ==Other websites== * Judiciary of Scotland * Official website of the SCTS ==References== Category:Europe Category:Scotland Category:United Kingdom Category:Organisations based in Scotland",
 "title": "Scottish Courts and Tribunals Service"
}