{
 "id": "1149025",
 "text": "In Arizona, abortion is allowed until the baby can live outside the mother's body, around 24 weeks of pregnancy. This is because of a rule called Arizona Proposition 139. == History == A long time ago, in 1864, Arizona made a law that banned abortion. This law stopped being used in 1973 because of a U.S. Supreme Court decision called Roe v. Wade. But in 2022, the Supreme Court changed the rules with a new decision, Dobbs v. Jackson. This allowed the old Arizona law to come back. For a while in 2022 and 2023, Arizona courts went back and forth on whether the old law could be used again. In 2024, Arizona’s leaders voted to end the old law, and Governor Katie Hobbs agreed. The old ban officially ended in September 2024. == History of Abortion Laws in Arizona == In 1973, the U.S. Supreme Court's Roe v. Wade decision made it illegal for states to ban abortion during the first three months of pregnancy. Before this, Arizona had a strict law that banned all abortions unless it was necessary to save the mother's life. This law, from 1864, said anyone who helped with an abortion could go to jail for 2 to 5 years. After Roe v. Wade, this law could not be enforced, but Arizona never officially removed it. Over time, Arizona passed other rules about abortion. For example: * In 2012, abortions were banned after 20 weeks of pregnancy, but this rule was blocked by the courts and never enforced. * By 2019, Arizona required women to wait 24 hours and get counseling before having an abortion. Doctors also had to collect and report detailed information about the procedure to the state. * In 2022, the U.S. Supreme Court's Dobbs v. Jackson decision overturned Roe v. Wade. This allowed states, including Arizona, to make stricter abortion laws again. Arizona's old 1864 abortion ban became a major legal issue. Some courts said it could be used, while others blocked it. * In 2024, Arizona lawmakers voted to officially end the 1864 ban. Governor Katie Hobbs signed the repeal into law, and it became official in September 2024. == 2024 Proposition 139 (Right to Abortion Initiative) == In 2024, a group called Arizona for Abortion Access worked to add a new proposal to the November ballot. They wanted to protect the right to abortion in Arizona’s State Constitution. To do this, they needed to collect enough signatures from voters. By July 2024, they had collected 823,685 signatures—much more than the 383,923 required to get the proposal on the ballot. On November 5, 2024, Arizona voters said yes to Proposition 139, a new rule that adds abortion rights to the state’s constitution. It allows abortions until about 24 weeks of pregnancy. After that, abortions are only allowed if a doctor says it’s needed to protect the person’s life or health. == References == Category:U.S. abortion laws by state Category:Abortion in the United States",
 "title": "Abortion in Arizona"
}