{
 "id": "1149467",
 "text": "A major battle took place in Malwa, where a local Gupta ruler named Bhanugupta was in charge, likely as a governor. According to the Bhanugupta Eran inscription, his army fought in a big battle at Eran in 510 CE, but suffered heavy losses. It is believed that Bhanugupta was defeated by Toramana in this battle, which led to the western Gupta region of Malwa being taken over by the Hunas. ==Battle== According to the 6th-century CE Buddhist text Manjusri-mula- kalpa, Bhanugupta lost the region of Malwa to the powerful Shudra ruler Toramana, who then continued his campaign towards Magadha. This forced Narasimhagupta Baladitya to retreat to Bengal. Toramana, described as a mighty leader with a formidable army, went on to conquer the city of Tirtha in the Gauda region (modern-day Bengal). The text also mentions that Toramana installed a new king in Benares, named Prakataditya, who is depicted as the son of Narasimhagupta. After defeating the Guptas and taking control of the Malwa region, Toramana is prominently mentioned in a renowned inscription found in Eran, affirming his rule over the area. The Eran Boar Inscription, located in Eran (about 540 km south of New Delhi in Madhya Pradesh), dates to his first regnal year and confirms his dominion over eastern Malwa. The inscription, which is written in Sanskrit using the Brahmi script, spans 8 lines and is engraved beneath the neck of a boar. The opening line introduces Toramana as Mahararajadhiraja (\"The Great King of Kings\"): On his gold coins minted in India in the style of the Gupta Emperors, Toramana presented himself confidently as: The Alchon Huns issuance of gold coins, such as the Toramana issue, alongside their silver and copper currency, indicates that their empire in India was both wealthy and influential. However this victory was temporary as he was defeated and drown away by Gupta–Aulikara alliance in 515 CE. == References == Category:India Category:Gupta Empire",
 "title": "First Battle of Eran"
}