{
 "id": "1149687",
 "text": "Fair Isle, sometimes known as Fairisle, is the southernmost Shetland island. Fair Isle is known for its bird observatory, shipwrecks, music, and knitting. The island has been owned by the National Trust for Scotland since 1954. == History == Fair Isle has been occupied since Neolithic times. There are two known Iron Age sites: a fort at Landberg, and foundation of a house. Fair Isle was bought by the National Trust for Scotland in 1954 from George Waterston. The island houses a series of high-technology relay stations carrying vital TV, radio, telephone and military communication links between Shetland, Orkney and the Scottish mainland. Many television signals are relayed from Orkney to Shetland.See reference at Fairisle.org.uk . === Wartime military role === During the Second World War, the Royal Navy built two radar stations on top of Ward Hill, which played an important role in finding German bombers on 8 and 10 April 1940. A narrow gauge railway still lies disused, once to send supplies. On 17 January 1941, a German bomber, crashed on the island. The wreckage remains on the crash-site. Two of the crew died, and the rest of them survived. == Geography == Fair Isle is roughly equidistant from Sumburgh Head, some to the northeast on the Mainland of Shetland\"Unknown: Atlantic\" Canmore. and North Ronaldsay, Orkney, some to the southwest. Fair Isle is long and wide. It has an area of . Ward Hill is at and is the highest point of the island. === Climate === Fair Isle experiences a climate with cool summers and mild winters. On 19 July 2022, the maximum temperature of was registered in Fair Isle. The lowest temperature recorded in recent years was in February 2010. Rainfall was at under . == Economy == Over the centuries the island has changed hands many times. The rent paid was in butter, cloth and fish oil. Fishing is an important industry for the island. Fair Isle is famous for its woollen jumpers, with knitting giving an important source of income for the women of the islands. In January 2004, Fair Isle was given the Fairtrade Island status. == Bird life == Many rare species of bird have been found on the island, with at least 27 species found on the island that were the first British records. Fair Isle has been designated an Important Bird Area (IBA) by BirdLife International because it supports large colonies of seabirds and waterbirds, as well as being a stop-over site for migrating land birds. === Bird observatory === In 1948, George Waterston created a bird observatory on the island, and was very important. In 2010 the building was built, and it accommodated around 30 people. In 2019, it was destroyed by a fire, and rebuilt, costing around £7.4m. == Infrastructure == Other than the restaurant of the bird observatory, and its small bar, there are no other pubs or restaurants on the island. There is one shop, one school and a community hall used for meetings and social events. There is no police station on the island; the main station is Lerwick and a section station is located in the village of Brae. To get to the island, service is provided by SIC Ferries on the ship Good Shepherd IV or by a passenger aeroplane from an airport near Lerwick. === Electricity supply === Fair Isle is not connected to the National Grid; electricity is provided by the Fair Isle Electricity Company. From the 1980s, power was generated by two diesel generators and two wind turbines. In October 2018, they finally had a 24-hour electricity supply. === Communication === Fair Isle is home to two GSM 900 MHz base stations operated by Vodafone and O2. === Emergency services === Fair Isle has a fire station equipped with a single fire appliance, and staffed by a retained fire crew of local volunteers. The first purpose-built fire engine was stationed to the island in 2002.History of the service and the appliance recorded in The Scotsman newspaper. A contract for the construction of a £140,000 purpose-built fire station was awarded to Shetland company Ness Engineering,Contract award and value recorded in The Shetland Times newspaper. who completed the construction and equipping of the fire station, including its connection to the island power and water supplies, and the installation of a rainwater harvesting system within the building.Construction and design outlined by Ness Engineering . The new fire station was officially opened on 14 March 2013.Link to photographs of the opening ceremony . There is a small Coastguard cliff- rescue team on the island. Like the fire service, the Coastguard is a retained (volunteer) emergency service.Photographs of Fair Isle Coastguard team members receiving long-service awards. There are no emergency medical services on Fair Isle. Routine medical care is provided by a community nurse. In the event of accident and emergency the community nurse provides first aid until casualties can be removed to Shetland Mainland. == Transport == === Air === Fair Isle Airport serves the island with flights to Tingwall Airport near Lerwick, and weekly to Sumburgh Airport, both on Shetland Mainland. There is a small terminal building providing limited services. There are two helipads on the island; one at the South Fair Isle lighthouse and used by Northern Lighthouse Board and HM Coastguard helicopters, and the other at the North Fair Isle lighthouse. === Sea === There are two main harbours, north harbour and south harbour; both formed naturally, being sheltered by the headland of Bu Ness. The north harbour is the main route for goods, provisions, and Royal Mail postal services arriving at and departing from the island. In summer only, the ferry also runs from Lerwick once every two weeks. === Road === A road connects the populated areas of the island, along its full length. == Education == Fair Isle has one primary school, with two classrooms. There is a full-time head teacher, and a part-time assistant teacher.School website . The number of pupils varies over time, but has generally been between five and ten. Islanders of secondary school age are generally educated off-island. == Religion == Christianity is the only formally organised religion on Fair Isle. There are two churches, one Methodist, and one Church of Scotland (Presbyterian). The Methodist Church was constructed in 1886.Date referenced at Undiscovered Scotland . The Church of Scotland church was built in 1892. The congregation's minister is Reverend Charles H. Greig. == Conservation designations == Most of the island is designated by NatureScot as both a Site of Special Scientific Interest (SSSI) and a Special Area of Conservation (SCA). The seas around Fair Isle are designated as a Marine Protected Area (MRA). == Notable people == * Ewen Thomson (born 1971 in Fair Isle), a Scottish luthier, specialising in violins, violas and cellos * Inge Thomson (born 1974 in Fair Isle), a singer and multi-instrumentalist * Chris Stout (born 1976), a Scottish fiddle/violin player from Shetland; grew up in Fair Isle == Gallery == File:Good_Shepherd_IV_at_Fair_Isle.jpg|Good Shepherd IV at Fair Isle File:North_Haven,_Fair_Isle_1974_-_geograph.org.uk_-_871058.jpg|North Haven, Fair Isle, 1974 File:Da_Sherriff_-_geograph.org.uk_-_344962.jpg|Da Sherriff File:100kW_Aerogenerator,_Fair_Isle_-_geograph.org.uk_-_9129.jpg|100 kW Aerogenerator, Fair Isle File:Fair_isle_station.jpg|Fair isle fire station File:Fair_Isle_Kirk_interior_-_geograph.org.uk_-_893323.jpg|Fair Isle Kirk interior File:Burkle,_Fair_Isle_-_geograph.org.uk_-_3151098.jpg|Burkle, Fair Isle - Croft houses == Related pages == * List of lighthouses in Scotland * List of Northern Lighthouse Board lighthouses * Foula * List of Shetland islands == References == == Other websites == * Fair Isle community website * Fair Isle Blog * Fair Isle bird observatory * Latest bird sightings * Fair Isle Electricity Company Ltd * Details of its airport * Photographic tour of the island * NPR Story on Fair Isle * Northern Lighthouse Board Category:Shetland",
 "title": "Fair Isle"
}