{
 "id": "1149353",
 "text": "Oliver Blackburn Shallenberger (May 7, 1860 – January 23, 1898) was an American electrical engineer and inventor best known for his invention of the first practical alternating current (AC) watt-hour meter, a critical innovation in the commercial development of AC power systems. == Early life and education == Shallenberger was born on May 7, 1860, in Rochester, Pennsylvania. He attended the United States Naval Academy in Annapolis, Maryland, graduating in 1880. Following his naval service, he developed a keen interest in electrical engineering, which was emerging as a transformative field. == Career == After leaving the Navy, Shallenberger joined the Westinghouse Electric Corporation under the leadership of George Westinghouse. He became involved in the development and implementation of alternating current systems, a technology competing with Thomas Edison’s direct current (DC) systems during the \"War of Currents.\" In 1888, Shallenberger made his most significant contribution by inventing the AC watt-hour meter. This device measured the consumption of electrical energy in AC systems, enabling utility companies to charge customers based on usage. His invention was both simple and reliable, making it a cornerstone of modern electrical metering. == Death and legacy == Shallenberger died on January 23, 1898, at the age of 37, due to complications from lead poisoning, likely related to his work with electrical components. Despite his early death, his contributions to electrical engineering had a lasting impact, solidifying AC power as the dominant system in the world. == Recognition == * In 1893, Shallenberger received the Elliott Cresson Medal from the Franklin Institute for his invention of the AC watt- hour meter. * He is honored as one of the pioneers of electrical engineering in the U.S., with his work influencing the design of modern power systems. == References == Category:1860 births Category:1898 deaths Category:American inventors",
 "title": "Oliver B. Shallenberger"
}