{
 "id": "1149434",
 "text": "Rebecca Michelle \"Mikie\" Sherrill ( ; born January 19, 1972) is an American politician, former U.S. Navy helicopter pilot, attorney, and former federal prosecutor. She is the U.S. representative for since 2019. She is a member of the Democratic Party. She is running for Governor of New Jersey in the 2025 gubernatorial election. == Early life and education == Sherrill was born in Alexandria, Virginia. She was raised in Reston, Virginia. In 1994, she earned her B.S. from the United States Naval Academy. In 2003, Sherrill graduated from the London School of Economics. In 2004, she studied at the American University in Cairo. In 2007, Sherrill earned a Juris Doctor from Georgetown University Law Center. == Military career == Sherrill wanted to be a pilot from a young age because of her grandfather's service in World War II. She was a U.S. Navy helicopter pilot. Sherrill flew missions throughout Europe and in the Middle East. In 2000, she was based in Corpus Christi, Texas. Sherrill served on active duty in the United States Navy for nine years, the final five in the rank of Lieutenant.Ballotpedia, Encyclopedia of American Politics, Bio of Mikie Sherrill. Retrieved July 1, 2020. In 2003 Sherrill was nominated for promotion to the rank of Lieutenant Commander. She left the Navy in 2003. == Law career == In 2007, while earning her Juris Doctor degree from Georgetown University Law Center, Sherrill was a summer associate at Kirkland & Ellis. After leaving Kirkland & Ellis, Sherrill joined the United States Attorneys' Office. In 2015, Sherrill became an assistant United States Attorney for the District of New Jersey. She left that office in 2016. == U.S. House of Representatives == On May 11, 2017, Sherrill announced her campaign for New Jersey's 11th congressional district in the United States House of Representatives. Her campaign was supported by The New York Times. In June 2018, Sherrill won the Democratic primary with 77% of the vote. On November 6, Sherrill beat Republican Jay Webber with 56.8% of the vote to Webber's 42.1%. Sherrill is the first Democrat to win this seat since 1984. She would be re- elected in 2020, 2022 and 2024. Following her election, Sherrill joined the moderate New Democrat Coalition. She also joined the Blue Dog Coalition, a caucus of moderate and conservative House Democrats. In 2019, Sherrill was against the first impeachment of President Donald Trump at first, but she changed her mind in September after it was revealed that Trump pressured Ukrainian President Volodymyr Zelensky to investigate then-former Vice President Joe Biden. She supported a second impeachment of Trump after the 2021 United States Capitol attack. On July 9, 2024, Sherrill became the seventh House member to publicly support President Joe Biden to drop out of the 2024 United States presidential election after his debate against former President Trump. ==2025 gubernatorial election== On November 12, 2024, Sherrill announced her candidacy for the Democratic nomination for governor in the 2025 gubernatorial election. == Personal life == Sherrill is married to Jason Hedberg. The couple has lived in Montclair with their four children since 2010. Sherrill is Roman Catholic. ==References== ==Other websites== * Congresswoman Mikie Sherrill official U.S. House website *Mikie Sherrill for Congress * Category:1972 births Category:Living people Category:United States representatives from New Jersey Category:Lawyers from New Jersey Category:Lawyers from Virginia Category:Politicians from Alexandria, Virginia Category:Democratic Party (United States) politicians Category:Military people from New Jersey Category:Military people from Virginia Category:People from Montclair, New Jersey",
 "title": "Mikie Sherrill"
}