{
 "id": "1149881",
 "text": "Extinction vortex is a set of words used for understanding what does and does not threaten survival of groups of living things. More than 1 extinction vortex are named \"extinction vortices.\" A group of living things may or may not be in an extinction vortex at any time. To know whether a group of living things is or is not in an extinction vortex at any time, it helps to know what genes the group of living things has. To know whether a group of living things is or is not in an extinction vortex at any time, it helps to know how many members the group of living things has. To know whether a group of living things is or is not in an extinction vortex at any time, it helps to know what kind of environment the group of living things is in. Extinction vortices are also an idea in mathematics. Extinction vortices may be studied in a way that is only ideas and imagined numbers. Thinking about extinction vortices that are not real at all helps people to learn about extinction vortices. Thinking about extinction vortices that are not real at all helps people to learn about other things that threaten the survival of groups of living things. Thinking about extinction vortices that are not real at all helps people to learn about things that help groups of living things to not die. Thinking about extinction vortices that are not real at all helps people to learn about groups of living things. Thinking about extinction vortices that are not real at all helps people to learn about genes in groups of living things. Thinking about extinction vortices that are not real at all helps people to learn about environments. Thinking about extinction vortices that are not real at all helps people to learn about mathematics. Those people include students. Those people include experts. Those people include people who help groups of living things to survive.This is an expert opinion: https://onlinelibrary.wiley.com/doi/10.1111/j.1365-294X.2007.03399.x This expert says good things about McGinnity et al., 2003. This is McGinnity et al., 2003: http://doi.org/10.1098/rspb.2003.2520http://doi.org/10.1371/journal.pbio.0040415http://doi.org/10.1034/j.1600-0706.2002.960301.x ==References== Category:Extinction",
 "title": "Extinction vortex"
}