{
 "id": "1149090",
 "text": "Slosh (also known as/ slang for Russian pool/ billiards, Indian pool, Indian billiards, and toad-in-the-hole) is a cue sport played on a snooker table. The game has seven balls. They are different colours. The colours are white (for the ), yellow, green, brown, blue, pink and black. Points are scored for or playing and off . The game is played to a score of 100 points, or on a 30 minute timer. Russian Pool was invented by Sam Mussabini in London in 1902, the Billiards Association acquring the rights to the rules in 1904. ==History== Slosh is a derivative of Russian Pool/ billiards. Russian Pool was invented by Sam Mussabini in 1902 in London. It is unknown why it was called Russian billiards, it being invented in London. Slosh is likely to have been invented around the early 20th century. Slosh being used as slang for Russian Pool was being used in the 1920s. It was made as a mix between the cue sport of snooker/ billiards from the game of black pool, played with the same balls and table. The game is sometimes known as Indian billiards or Indian pool. These names are sometimes mistaken to a table carrom game. Other names for the game include toad-in-the-hole (not to be confused with Toad in the hole or the food of the same name) and Russian pool, although it is unknown why these names are used. ==Rules== The game is played with seven balls. They are each a different colour. These are a white , yellow, green, brown, blue, pink and black. The game is made for two to four players. The first shot must be played towards the black ball. Points are scored for either pocketing the object ball, or playing shots and pocketing the cue ball. Points may only be scored by pocketing into certain pockets for each individual coloured ball. Slosh is played to a total of 100 points. A player can continue to stroke after completing any legal or carom. Different points are awarded for each ball. Two points for a pot on the yellow, three for the green, four for the brown, five for the blue, six for the pink and seven for the black. Playing a (hitting two object balls) is worth two points. To win, the player must finish on exactly 100 points, or be on the highest number of points after 30 minutes of play. If the shooter exceeds 100, the score is reduced to 50, but the player can continue their . Foul shots, such as potting a ball in the incorrect pocket, or playing an results in points being either deducted from the player's points, or awarded to their opponent. ==References== ==Citations== * * * * * * * * Category:Cue sports",
 "title": "Slosh (cue sport)"
}