{
 "id": "1149578",
 "text": "Apple Pay is a mobile payment service developed by Apple Inc. It was started on October 20, 2014. It allows people to make payments in person and works with iPhone, iPad, Apple Watch, Mac and Vision Pro. ==Service== ===Device Works=== The service works with iPhone 6 and newer, iPad Air 2 and newer, Macs with Touch ID and Apple Watch Series 1 and newer. In iOS 17 or later, the number of cards that can be added depends on the secure element capacity, which varies by device. ===Apple Cash=== Apple Cash, formerly Apple Cash Pay is a feature in Apple Pay that allows to transfer of money from one user to another user via iMessage. When users get a payment, the money will be added to their apple cash card and can be used right away in the store that accepts Apple Pay, This will work only United States. It was required to people with 18 years old or older. If they are under 18, they are required to have an Apple Cash family app. ==Availability== ===Worked countries=== thumb|498x498px|Worldwide card works of Apple Pay Apple Pay can be worked with any EMV contactless terminal worldwide as long as the people are using a working card. There is at least one card and bank in each of these 86 countries and regions issued these cards. Date launched Worked for payment cards Issued in (except & other unincorporated territories) (except British Overseas Territories) (in-app and online payments only) (Suspended on March 25, 2022) (All Parts) (except ) November 2, 2021 Costa Rica January 18, 2022 Armenia March 15, 2022 December 6, 2022 July 18, 2023 April 16, 2024 August 6, 2024 September 24, 2024 November 5, 2024 ===Worked payment networks and card schemes=== * Visa (worldwide. Japanese Visa cards in Apple Pay also function as FeliCa-based QUICPay or iD cards in addition to EMV contactless cards, although some issuers do not support EMV contactless in Apple Pay, meaning such cards will only function as QUICPay or iD cards.) * Visa Electron (worldwide) * V Pay (only in Europe) * Mastercard (worldwide. Japanese Mastercard cards in Apple Pay also function as FeliCa-based QUICPay or iD cards in addition to EMV contactless cards, although some issuers do not support EMV contactless in Apple Pay, meaning such cards will only function as QUICPay or iD cards.) * Maestro (worldwide) * American Express (worldwide. Japanese American Express cards in Apple Pay also function as FeliCa-based QUICPay cards in addition to EMV contactless cards.) * Discover Card (only in the United States) * U.S. Debit (only in the U.S. CDCVM may not be supported, requiring the customer to enter their PIN on the terminal.) * Diners Club International (only in Japan. Only function as FeliCa-based QUICPay cards and do not support the global EMV contactless standard.) * JCB (worldwide. Japanese JCB cards in Apple Pay also function as FeliCa-based QUICPay or iD cards in addition to EMV contactless cards, although some issuers do not support EMV contactless in Apple Pay, meaning such cards will only function as QUICPay or iD cards.) * Cartes Bancaires (CB) (only in France) * Hyundai Card (only in South Korea) * Interac (only in Canada) * EFTPOS (only in Australia) * China UnionPay (only in China, Hong Kong and Macau) * China T-Union (select cities in China) * Dankort (only in Denmark) * Suica, PASMO, ICOCA, iD, QUICPay, WAON, and nanaco (only in Japan. FeliCa-worked iPhone and Apple Watch models only.) * SPTC transit card (only in Shanghai) * Yikatong (only in Beijing) * mada (only in Saudi Arabia) * Clipper (only in San Francisco Bay Area, California, United States) * Hop Fastpass (only in Portland, Oregon, United States) * SmarTrip (only in Washington, D.C., United States) * TAP (only in Los Angeles, California, United States) *Navigo (only in Île-de-France, France) * Ventra (only in Chicago, Illinois, United States) * Elo (only in Brazil) * Octopus (only in Hong Kong. FeliCa-supported iPhone and Apple Watch models only.) * girocard (only in Germany) * Mir (only in Russia, suspended as of March 26, 2022) * Bancontact (only in Belgium) ==== Upcoming ==== * BankAxept (only in Norway) * Meeza (only in Egypt) * NAPAS (only in Vietnam) * T-money (only in South Korea) == Notes == == References == == Other websites == * Category:Software Category:Apple software Category:2014 establishments in the United States Category:Mobile payments",
 "title": "Apple Pay"
}