{
 "id": "1149560",
 "text": "Habib Bank Limited is a Pakistani commercial bank headquartered in Karachi, Pakistan. == History == HBL is the first commercial bank in Pakistan, having been founded in 1941 by the Habib Family. Its first overseas location opened in Colombo, Sri Lanka, in 1951. The Aga Khan Fund for Economic Development obtained a majority stake and administrative control in the bank when it was nationalized by the government in 1974 and then privatized in 2004. The Aga Khan Fund for Economic Development (AKFED), headquartered in Geneva, Switzerland, owns a significant stake in HBL. HBL branches also exchange foreign currency, initiate SWIFT and FEDWIRE transfers, and facilitate RAAST real-time money transfer transactions. Habib Bank Limited was established as a public limited company in Bombay in 1941 by the Habib family, previously engaged in internal trade and private banking. In early 1947, the bank's headquarters were relocated to Karachi on August 7, 1947, just before the Partition of India. The Habib family owned and managed the bank until the Pakistan government nationalised it on 1 January 1974. The Habib family received compensation of PKR 36.31 per share from the Government of Pakistan and subsequently the bank was delisted from the Karachi Stock Exchange. In 2002, Pakistan's Privatisation Commission announced that the Government of Pakistan would grant the Aga Khan Fund for Economic Development (AKFED), a subsidiary of the Aga Khan Development Network, majority ownership of HBL against AKFED's investment in the bank. In 2003, the Government of Pakistan granted AKFED rights to 51% of the shareholding in the bank against an investment of PKR 22.409 billion (US$389 million).History HBL Retrieved 27 December 2011 In 2004, the Government of Pakistan handed over management control of Habib Bank to AKFED. In 2013, the bank acquired Citibank Pakistan consumer business for . In 2015, the bank acquired Barclays's Pakistan operations. In 2016, HBL received a Licence to operate a subsidiary in Ürümqi, Xinjiang. In 2020, HBL was designated one of the domestic systemically important banks (D-SIB) of the year by the State Bank of Pakistan. == Corporate governance == Board of Directors Name Position Sultan Ali Allana Chairman of the board Moez Ahamed Jamal Director Shafiq Dharamshi Director Salim Raza Director Najeeb Samie Director Saba Kamal Director Khaleel Ahmed Director === List of CEOs === * R. Zakir Mahmood (2000 – September 28, 2012) * Nauman K. Dar (September 28, 2012 – December 31, 2017) * Rayomond Kotwal - Interim CEO (December 31, 2017 – April 30, 2018) * Muhammad Aurangzeb (April 30, 2018 – 11 March 2024) * Muhammad Nassir Salim (11 March 2024 – ) == References == == Related links == * Habib Bank Category:Banks of Pakistan __NEWSECTIONLINK__ Category:Financial organizations",
 "title": "Habib Bank Limited"
}