{
 "id": "1149094",
 "text": "Princess Irina of Romania (born 28 February 1953) is the third daughter of King Michael I of Romania and Queen Anne. == life == Irina was born on 28 February 1953, at Clinique Montchoisi in Lausanne, Switzerland, the third daughter and child of King Michael I and Queen Anne; She has two elder sisters Margareta (b.1948), Princess Elena (b.1951) and two younger sisters, Princess Sophie (b.1957) and Princess Maria (b.1964). Irina spent her childhood at her family homes in Lausanne, Switzerland and in the United Kingdom at Ayot House, St Lawrence, Hertfordshire. During holidays she and her sisters spent time with their grandparents, Helen, Queen Mother in Florence, Italy at Villa Sparta and in Denmark with Princess Margaret and Prince Rene. As a young girl, Irina and her sisters were told “fascinating tales of a homeland they couldn’t visit” by their father. Her teenage years were spent in Europe with her family, where she and her sisters received primary and secondary education. In her mid-twenties, as her two elder and two younger sisters went away to work and study, Irina stayed with her parents at their family home in Switzerland and later moved to the United Staes to work. During the 1970s Irina worked for a year as a specialist appraiser at Christie’s auction house in Geneva, Switzerland. ==Marriages and divorce== On 4 October 1983 Irina married John Kreuger (born in Solna, Sweden 3 August 1945) son of Torsten Kreuger and his wife Diana Blanchefleur Hedberg (nee Beve) in Scottsdale, Maricopa Country, Arizona, in a civil ceremony and on 11 February 1984 in a religious ceremony at Holy Trinity Church in Phoenix. The ceremony was attended by the Royal family including her grand-aunt Princess Ileana, John's parents and family, and friends of the couple. On 24 November 2003 the couple divorced after 20 years of marriage. Irina and John have 2 children, a daughter-in-law, a son- in-law and three grandchildren: -Michael Torsten (born 25 February 1984), at Bay Area Hospital in Coos Bay, Oregon married to Tara Marie Littlefield in 2011 -Kohen (born 28 March 2012) -Angelica Margareta Bianca (born 29 December 1986), at Bay Area Hospital in Coos Bay, Oregon married in 2009 (divorced in 2018) to Richard Knight -Courtney Bianca (born 31 May 2007) -Diana (born 2011) On 10 November 2007 Irina married a second time to John Wesley Walker (b.in Douglas, Missouri on 30 December 1945). ==Titles, styles and honours== === Titles and styles === * 28 February 1953 – 10 May 2011: Her Royal Highness The Princess Irina of Romania, Princess of Hohenzollern-Sigmaringen * 10 May 2011 – 29 October 2014: Her Royal Highness The Princess Irina of Romania * 29 October 2014 – 6 September 2020: Irina de Roumanie * 6 September 2020 – present: Her Royal Highness The Princess Irina of Romania ===Honours=== ===Dynastic=== * House of Romania: Knight Grand Cross of the Order of the Crown of Romania (30 December 2011) * House of Romania: Knight, Special Class of the Royal Decoration of the Custodian of the Crown of Romania (1 October 2021) ===Ecclesiastical=== * Order of Our Lady of Prayer (Romanian Orthodox Church)Romania Regala ==References== ==Other websites== * Official website of the Romanian royal family * Official blog of the Romanian royal family Category:Living people Category:House of Romania",
 "title": "Princess Irina of Romania"
}