{
 "id": "1149345",
 "text": "As I Lay Dying is an American metalcore band from San Diego, California. Formed in 2000 by vocalist Tim Lambesis, the band's first full lineup (including Lambesis' Point of Recognition bandmate Jordan Mancino) was completed in 2001. The band has released eight studio albums, one split album, and two compilation albums. As I Lay Dying's fourth studio album An Ocean Between Us peaked at No. 8 on the Billboard 200, and No. 1 on the Top Rock chart. The band has performed at festivals such as Wacken Open Air, With Full Force, Soundwave Festival, Warped Tour, Bloodstock Open Air and Taste of Chaos. In 2007, As I Lay Dying won the \"Ultimate Metal God\" award from MTV2 at the first annual \"All That Rocks\" special; was named \"Artist of the Year\" at the San Diego Music Awards in 2005, 2007 and 2008; and was nominated for a 2008 Grammy Award for the song \"Nothing Left\". Their fifth studio album The Powerless Rise was written over a three-year period, and was released in May 2010 to widespread critical acclaim. Their last studio album before their hiatus, Awakened, was released on September 25, 2012. ==Musical style and influences== As I Lay Dying is considered a prominent metalcore band, and more specifically as melodic metalcore, Christian metal (though the band has recently dropped the term), death metal, and thrash metal. Additionally, the band has utilized many elements of melodic death metal throughout their career. As I Lay Dying's influences include In Flames, Living Sacrifice, Iron Maiden, Slayer, At the Gates, Pantera, Megadeth, Fear Factory, Cannibal Corpse, Thin Lizzy, Shai Hulud, Dark Tranquillity, Metallica, Judas Priest, and Earth Crisis. ==Discography== ;Studio albums * Beneath the Encasing of Ashes (2001) * Frail Words Collapse (2003) * Shadows Are Security (2005) * An Ocean Between Us (2007) * The Powerless Rise (2010) * Awakened (2012) * Shaped by Fire (2019) * Through Storms Ahead (2024) ==References== Category:2000 establishments in the United States Category:2014 disestablishments in the United States Category:2017 establishments in the United States Category:Metalcore bands Category:Thrash metal bands Category:Christian metal bands Category:American musical groups",
 "title": "As I Lay Dying (band)"
}