{
 "id": "1149166",
 "text": "Madhavrao I led Four Expedition into the Carnatic against the Kingdom of Mysore of Hyder Ali and Tipu Sultan. In which he was successful enough to inflict a crushing defeated on Hyder Ali who sued for peace agreeing to pay tribute and ceded the territories upto to Tungabhadra river to the Maratha Empire. ==Background== The Maratha expeditions to northern India and their conflict with the Nizam between 1760-63 significantly weakened the Marathas, creating an opportunity for Haidar Ali to rise in Mysore. In 1759, a Marathi newsletter suggested that Mysore, already torn by internal strife, could easily be conquered. However, the Marathas were focused on their northern campaign, leaving Mysore largely unchallenged. After the defeat at Panipat, Visaji Pant, who had been assisting the Marathas, retired with a large sum of money, allowing Haidar to take full control of Mysore and push the Marathas out of the region. Haidar also refused to honor his promise to give up Baramahal to the Marathas after the battle, as they were too weakened to protest. Haidar Ali began aggressively expanding his territory, first forming an alliance with Basalat Jang, the Nizam's brother, who sought to establish his own power in the Carnatic. Together, they captured Sira, Hoskote, and other Maratha-held territories in 1761. Haidar cleverly manipulated Basalat Jang, convincing him to grant Haidar the title of Nawab of Sira, even though the region had not yet been fully conquered. Haidar then continued to expand southward, capturing key territories like Chik Balapur and forcing local rulers to submit. His military successes significantly disrupted Maratha control over the region, cutting off crucial supplies and tribute. By early 1762, Haidar’s conquests had deprived the Marathas of about 50 lakhs of rupees in tribute. Following a peace agreement with the Nizam, the Marathas sent an expedition to the Carnatic, led by Raghunath Rao and the young Peshwa. The Peshwa, who had distinguished himself in the previous campaigns, continued to gain experience in warfare, diplomacy, and governance. Haidar’s rise in Mysore was made possible by the Marathas’ weakened state, and his aggressive expansion reshaped the balance of power in southern India. ==Carnatic Expeditions== ===First and Second Expeditions=== In 1763, Haidar Ali, the ruler of Mysore, expanded his territory, conquering regions like Bidnur and Sonda, while the Marathas were bogged down by internal strife and financial difficulties. The Marathas, led by Peshwa Madhav Rao, initially struggled to respond but eventually launched an offensive to retake lost territories. The English in Bombay, despite their treaty with the Marathas, sought to secure Haidar’s friendship, providing him with arms and ammunition. Haidar's strategy was to fortify his northern frontier against Maratha advances, including annexing key regions like Savanur. However, despite initial setbacks, Haidar faced fierce Maratha resistance. In 1764, after several skirmishes, the Marathas surrounded Haidar’s forces. At one point, Haidar's army was forced into a defensive position, and although the Marathas had the upper hand, Haidar's forces held out for some time, even after suffering heavy losses. As the conflict dragged on, the Marathas, under Peshwa Madhav Rao, continued to advance. By late 1764, the Marathas had taken important forts like Dharwar, forcing Haidar to retreat to Bidnur. Although Haidar attempted peace talks, he was unable to secure favorable terms, and hostilities continued until early 1765. Despite his desperate situation, Haidar avoided direct confrontation with the Marathas and ultimately negotiated a peace settlement, agreeing to pay tribute and return some territories. However, the treaty left some areas unresolved, especially Bankapur, which Haidar refused to surrender. The treaty was seen as a compromise, given Haidar's weakened position, and it marked the beginning of a more cooperative relationship between Haidar and the Marathas, particularly with Raghunath Rao, the Peshwa's uncle, who played a crucial role in the negotiations. ===The Third Expedition=== After the Second Carnatic Expedition, Madhav Rao returned to Poona, leaving Gopal Rao to defend Maratha territories from Haidar Ali. Gopal Rao, assisted by Murar Rao, secured tribute from regions like Chitradurg and Bellary. Meanwhile, the Peshwa sought to ally with the Nizam to fight Haidar Ali, offering him territories worth 15 lakhs. Though no formal agreement was made, they agreed to cooperate against Haidar. Haidar Ali, aware of these talks, tried to form an alliance with the English, suggesting their combined forces could defeat the Marathas and Nizam. The English proposed a treaty, seeking peace and trade privileges, but Haidar was reluctant to accept terms restricting his actions. The English, however, were more focused on countering Maratha power and securing territories in the Deccan, which caused friction with the Marathas. In December 1766, the Peshwa marched into the Carnatic to confront Haidar’s forces, capturing several key territories, including Sira in February 1767. Haidar, unable to resist the Marathas, sought peace. A treaty was signed in April 1767, with Haidar agreeing to pay 31 lakhs to the Peshwa and 6 lakhs to the Nizam. The Nizam, initially hesitant and slow to act, joined the campaign late. Though he advanced towards Madgiri, he failed to make significant progress. After the treaty with Haidar, tensions between the Peshwa and Nizam grew, as the Peshwa refused to give the Nizam a larger share of the spoils. Ultimately, the alliance between the Peshwa and Nizam proved unstable, as both had competing interests. ===The Fourth Expedition=== After the Marathas defeated Janoji Bhonsle in 1769, Madhav Rao planned a new campaign against Haidar Ali, who had failed to pay tribute and was taxing Maratha allies. Despite initial progress, the Peshwa struggled with logistical issues and a lack of support from his commanders, forcing him to return to Poona. Haidar took advantage of this and resumed his aggressive actions. The Marathas continued to press Haidar for tribute and the surrender of his ally, Mir Reza, but Haidar resisted. The Peshwa’s forces, though large, faced internal struggles, including the death of Gopal Rao and the Peshwa’s declining health, which weakened their position. In early 1771, Haidar prepared for a final confrontation in Seringapatam. Trimbak Rao, leading the Marathas after Gopal Rao's death, advanced towards Seringapatam but was met by Haidar's forces at the Battle of Moti Talab in March 1771. Haidar and his son Tipu tried a surprise attack but was discovered. The Marathas eventually overwhelmed Haidar’s army, forcing him to retreat to Seringapatam. The Marathas captured Haidar’s artillery, treasure, and many of his troops, winning a decisive victory. Haidar escaped in disguise, but the battle marked a major loss for him. The British East India Company, caught between supporting Haidar (with whom they had a treaty) or the Marathas, chose to stay neutral, not wanting to anger either side. Throughout the conflict, the Marathas struggled with internal issues and Haidar, though weakened, resisted. In 1772, the Marathas eventually negotiated peace with Haidar, ending the fighting in which Haider agreed to pay tribute. All the territories till Tungabhadra river were ceded to Marathas and it remained the boundary till 1795. This period of uncertainty, marked by British hesitation, contributed to Haidar's eventual alliance with the Marathas, setting the stage for the Second Anglo-Mysore War. ==List of Conflicts== Name Of Conflict Maratha Commander Mysore Commadar Outcome Siege of Hostoke (1761) Mukunda Sripant Hyder Ali Mysore Victory Siege of Sira (1761) Unknown Hyder Ali Faizulla Mysore Victory Capture of Bidnur (1762) Madhavrao Raghunath Rao Hyder Ali Maratha victory Capture of Bidnur and Sunda (1763) Unknown Hyder Ali Mysore Victory Capture of Dharwar and Shrihati (1763) Unknown Faizulla Mysore victory Capture of Manoli and Hubli (1764) Madhavrao Gopal Rao Unknown Maratha victory Battle of Rattihalli (1764) Madhavrao Gopal Rao Naroshankar Hyder Ali Tipu Faizulla Maratha victory Siege of Dharwar (1764) Gopal Rao Anand Raste Faizulla Maratha victory Battle of Jadi Hanwati (1764) Madhavrao Hyder Ali Ismail Khan Faizulla Maratha victory Siege of Sira (1767) Madhavrao Raghunathrao Mir Reza Faizulla Maratha victory Siege of Madgiri (1767) Madhavrao I Gopal Rao Unknown Maratha victory Battle of Ooscota (1768) Murari Rao Ghorpade Hyder Ali Maratha victory Siege of Talpula (1768) Rakhmaji Bhonsale Hyder Ali Faizulla Mysore victory Recapture of lost territories (1770) Madhavrao I Hyder Ali Maratha victory Night attack on Gopal Rao's Camp Gopal Rao Pathvardan Hyder Ali Mysore victory Capture of Devarayagad (1770) Naryanrao Trimbakrao Unknown Maratha victory Siege of Nijgal (1770) Naryanrao Trimbakrao Unknown Maratha victory Siege of Gurramkonda (1770) Trimbakrao Pethe Saidu Man Maratha victory Capture of Chik Balapur Gopal Rao Patwardhan Chandroji Balaji Syed Maratha victory Capture of Canara (1771) Trimbak Suryaji Hyder Ali Maratha victory Battle of Moti Talab (1771) Trimbakrao Vaman Rao Anandrao Sakharam Hari Sayaji Gaekwad Hyder Ali Tipu Mir Reza Ali Jami Khan M.Hughel Maratha victory Battle of Vijaydurg (1771) Janoji Dhulap Raghuji Maratha victory Attack on Bidnur (1772) Trimbakrao Pethe Hyder Ali Maratha victory Attack on Dhol Balapur (1772) Trimbakrao Pethe Hyder Ali Maratha victory == References == Category:Maratha Empire",
 "title": "Madhavrao Carnatic Expedition"
}