{
 "id": "1149316",
 "text": "Ernesto Alberto Mascheroni Castiglioni (; 21 November 1907 – 3 July 1984) was a footballer from Uruguay. Born in Montevideo, Ernesto was a defender. He played as a left-back. Mascheroni was a complete left-back with his ability to man-mark opponents with success, he was known for his leadership and fine technique. Widely considered as one of the best left-backs of all time. ==Club career== At the time, Mascheroni played for Olimpia, being the only one that this club ceded to the Uruguayan national team for any FIFA World Cup. The team had been fifth in the Uruguayan championship of 1929 and was extinguished in 1933, when it merged with the Capurro club to form the current Uruguayan River Plate. After the World Cup, Mascheroni went to play for Peñarol. There was no Uruguayan championship in 1930 due to the World Cup. In 1931, Mascheroni was not yet a starter, with the black and white defense duo being composed of Adhemar Canavesi and Alberto Noguéz. The team did not have a good championship and even failed to perform in the final two rounds, in a tournament won by Montevideo Wanderers. The starting XI came in 1932, in a duo with Noguéz. This time, the title came, in what was the first professional championship in Uruguayan football. In 1933, the team came close to a new title, only defined after several shootouts with archrival Nacional, held the following year. The black and white even complained that this was only possible due to the cancellation of a legitimate goal in the last regular round, against Sud América. Mascheroni was an absolute starter, with the other flank of the defense being alternated between Noguéz and Lorenzo Fernández. Mascheroni also defended Peñarol in a few games in 1934, the year in which he went to play briefly in Argentine football for Independiente. His place at Peñarol, again runners-up to arch-rivals in 1934, was taken by Héctor Cazenave, later a player for the French national team at the 1938 FIFA World Cup. From Independiente, Mascheroni went to Italy to play for Internazionale, at the time called Ambrosiana. The Milan team had acquired at the time another Uruguayan from Independiente, Roberto Porta, and already had another Uruguayan player, Faccio. The three even defended the Italian national team. Despite twice defending the Azzurri, Mascheroni did not stand out much among the most successful Uruguayans in calcio. Many foreign players of Italian origin had left the country with the outbreak of the Second Italo-Ethiopian War in 1935, fearful of being drafted into the Italian Armed Forces. Mascheroni returned to Uruguay in 1937, returning to Peñarol. That same year, he was Uruguayan champion, although the starting defensive duo was Jorge Clulow and Mario Barradas. The achievement was repeated the following year, this time with Mascheroni starting alongside Clulow, in what was a fourth consecutive championship for Peñarol, who in the same year stood out for a 7–2 victory over Estudiantes de La Plata in the Rio-Pratense Night Tournament. The defender stopped playing in 1940, still as a black and white player, although he had lost the position; Barradas, Clulow and Agustín Prado were the defenders who took turns in the starting lineup the most in 1939 and 1940. ==International career== Mascheroni was in the 1929 Copa América, but did not play, in the reserve of Pedro Arispe and José Nasazzi, the starting defensive duo in the second Olympic championship in 1924 and 1928. His debut for the Uruguayan national team only took place on July 21, 1930, in the middle of the 1930 FIFA World Cup, in the second match. From then on, he started the rest of the tournament, in a duo with Nasazzi. Although his last game for Uruguay took place on February 12, 1939, he played only thirteen times for the country. He was throughout the 1930s for foreign teams (Independiente and Internazionale) and only in the 1970s would the national team start to admit calling up those who played abroad - the coach of the change, curiously, was Roberto Porta. While playing for Inter, Mascheroni twice played for the Italian national team, also defended by Porta himself. The two matches for the Azzurri took place in 1935. They beat France 2-1 in a friendly in Rome, in a lineup that also included Argentines Enrique Guaita and Alejandro Scopelli, on February 17; and won 2–0 against Austria for the Dr. Gerö Cup, again alongside other South Americans: Uruguayan Ricardo Faccio and Argentinians Enrique Guaita, Atilio Demaría and Raimundo Orsi. Uruguay would refuse to take part in the 1938 FIFA World Cup, officially still in retaliation for the large absence of the European powers in the 1930 edition. The date of February 12, 1939, when Mascheroni last defended the national team, was valid for the last commitment of the Celeste in the Copa America that year. The title went to the host Peru, due to the direct clash in the last round. ==After football== In times of less profitable professionalism of the activity of a soccer player, Mascheroni, specialized in elevator mechanics, freely chose not to become a coach but an elevator operator. To the Brazilian press, fifty years after the 1930 FIFA World Cup title, he pointed out that, similarly, José Nasazzi \"cut marble, helping to constitute the Legislative Palace\" and that José Pedro Cea \"made a living loading and unloading ice. They were giants, believe me\". About not having followed a path as a technician, he justified: \"for what, if I already drove elevators? Then, technician, just technical to have the portrait in the newspapers, what good is it? I want to see the coach training players, discovering talents. Do you know why talents are so lacking these days? Because technicians are incapable of revealing them, of discovering them. Do you know anyone who does this as it was done in the past? I bet not.\" At the time of 1980, when he made the above statements, he was famous as the last Uruguayan still alive of the 1930 champion team. Two other survivors that the first World Cup still had, the Peruvian Antonio Maquilón and the Brazilian Oswaldo Barros Velloso, joined him in a tribute held on the occasion of the decision of the 1980 Mundialito de futebol. It was Mascheroni who kicked off the final. By the time of his death in July 1984, at the age of 76, he was the last surviving member of Uruguay's 1930 World Cup winning team; though it would be another 26 years before the death of the last surviving participant of that World Cup.\"Last surviving player from first World Cup final dies.\" BBC News, 31 Aug. 2010. 22 March 2011. ==Honours== Peñarol * Primera División (AUF): 1936, 1937, 1938 ===International=== Uruguay * FIFA World Cup: 1930 * South American Championship: Runner-up 1939 ;Italy * Central European International Cup: 1933-35 ==References== Category:1907 births Category:1930 FIFA World Cup players Category:FIFA World Cup–winning players Category:1984 deaths Category:Uruguayan footballers Category:Italian footballers",
 "title": "Ernesto Mascheroni"
}