{
 "id": "1149449",
 "text": "Sir David Falconer of Newton (1640 – 15 December 1685) was a Scottish judge and legal scholar who served as the Lord President of the Court of Session from 1682 until his death. He was also a member of the Scottish Parliament, representing the County of Forfar. == Early life == David Falconer was born in 1640, the second son of Sir David Falconer of Glenfarquhar, a Commissary of Edinburgh, and Margaret Hepburn. His elder brother was Sir Alexander Falconer of Glenfarquhar. The Falconer family was closely linked to Scottish nobility, with his paternal grandfather being a brother of Sir Alexander Falconer, 1st Lord Falconer of Halkerton. He studied law under the guidance of his father and became an advocate on 3 July 1661. == Legal career == * 24 May 1676: Nominated as a Lord of Session. * 2 March 1678: Appointed a Lord of Justiciary. * 5 June 1682: Promoted to Lord President of the Court of Session. Falconer also served in the Scottish Parliament in 1685, representing the County of Forfar. During this time, he was elected to serve as a Lord of the Articles and participated in commissions on trade, church organization, and judicial reforms. == Published works == Falconer is remembered for compiling the decisions of the Court of Session from November 1681 to 9 December 1685. These records were later published in 1705 by John Spottiswood, contributing significantly to Scottish legal literature. == Death and legacy == Falconer passed away in Edinburgh on 15 December 1685 following a brief illness. He was buried in Greyfriars Kirkyard, where a monument was erected in his memory. The monument remains at the outer north-east corner of the church. * His daughter, Catherine Falconer, married Joseph Home of Chirnside and was the mother of David Hume, the renowned philosopher and historian. * His son, Alexander Falconer, inherited his father's title but left no direct heirs. == Family == Falconer married Anne Lindsay, the only child of John, 9th Lord Lindsay of the Byres. They had a daughter, Agnes, who married George Ogilvy, 2nd Lord Banff. == Related pages == * Court of Session * David Hume == References == == Other websites == * Greyfriars Kirkyard website Category:1640 births Category:1685 deaths Category:Scottish judges",
 "title": "David Falconer"
}