{
 "id": "1149692",
 "text": "Scott Kenneth Homer Bessent (; born August 21, 1962) is an American investor, philanthropist, hedge fund manager and Republican donor. Bessent has been the 79th United States Secretary of the Treasury since 2025 during the second Donald Trump administration. He is the founder of Key Square Group, an investment firm.“Life and Money Management,” Yale Alumni Magazine, Sept/Oct 2015 In November 2024, President-elect Donald Trump nominated Bessent to be his Treasury Secretary for his second administration. He was confirmed by the United States Senate to the office on January 27, 2025 by a vote of 68–29. Bessent is the second openly gay man to serve in the Cabinet of the United States and the fourth openly gay man to serve in a cabinet-level office. He is also the highest-ranking openly LGBT person in American history. == Early life and education == Bessent was born in Conway, South Carolina to Barbara McLeod and Homer Gaston Bessent Jr..\"Meet The Hedge Fund Superstar George Soros Just Hired To Take Over His $25 Billion Fund,\" Business Insider, September 19, 2011 He graduated from Yale University in 1984.\"Ex-Soros Trader Bessent Returns to $25 Billion Firm as CIO,\" Bloomberg, September 19, 2011 ==Business career== Bessent joined Soros Fund Management (SFM) in 1991 and was a partner there during the 1990s.\"Soros appoints new CIO to family office,\" Financial Times, September 19, 2011“Soros’s Investment Chief to Depart,” Wall Street Journal, August 4, 2015 “Soros’ CIO to Start Own Hedge Fund with $2 Bln,” Reuters, August 4, 2015 After resigning from SFM in 2000, Bessent founded a $1 billion hedge fund.“Soros’ European Investment Head Bessent Leaves,” Bloomberg, June 8, 2000 The fund closed in 2005. Bessent has said he learned that he shouldn’t change his style or the construct of the firm because of investor preferences. He was also a senior investment advisor at fund-of-funds Protégé Partners.\"Soros Aide Wins Kudos for Japan Bets,\" Wall Street Journal, February 14, 2013 In 2011, Bessent returned to SFM as Chief Investment Officer.“George Soros’ Protégé Just Nailed One of the Biggest Hedge Fund Launches Ever,” Business Insider, January 5, 2016 Bessent was SFM's CIO until 2015, when he left to begin a new firm, Key Square Group. From 2006 to 2011, he taught economic history at Yale University. He is also a philanthropist who donates money to restore historic buildings in South Carolina and to children's hospitals. Bessent founded Key Square Group in 2015.“Ex-Soros’s Bessent Raises $4.5 Billion For New Hedge Fund Firm,” Bloomberg, January 5, 2016 == Political fundraising == In 2000, Bessent hosted a fundraiser for Vice President Al Gore's 2000 presidential campaign at his East Hampton, New York, home.Dao, James (Aug 6, 2000). \"THE 2000 Campaign: The Vice President; Gore's Theme-a-Day Tour Will Start With a No. 2 Pick\". The New York Times. In 2016, Bessent donated $1 million to Donald Trump's 2017 first presidential inaugural committee.Kight, Stef (April 19, 2017). \"The big $$$ donors to Trump's Inaugural Committee\". Axios. In 2024, Bessent hosted many fundraisers for Trump's 2024 campaign.Kim, Soo Rin; Ibssa, Lalee (February 21, 2024). \"Trump brings in more than $6.8 million from Greenville, South Carolina, fundraiser ahead of primary\". ABC News.\"Trump Campaign Says $50.5 Million Haul Doubled Biden's Fundraiser\". Newsweek. April 6, 2024. In July 2024, Bessent became an economic advisor to Trump. ==U.S. Secretary of the Treasury== ===Nomination=== After Trump was elected president in 2024 presidential election, he was seen as a possible candidate for United States Secretary of the Treasury in a second Trump administration. On November 22, 2024, President-elect Trump named Bessent as his pick for Secretary of the Treasury. Bessent appeared before the Senate Committee on Finance on January 16, 2025. During the hearing, Bessent defended plans to add tariffs, supported tax cut extensions, and called for tougher economic policies on China and Russia. The Senate Committee on Finance confirmed his nomination in a 16-11 vote on January 21, 2025. The United States Senate Committee on Finance advanced his nomination to the floor of the United States Senate in a 16-11 vote on January 21, 2025. The Senate voted 68-29 to approve his nomination on January 27. ===Tenure=== On January 31, Bessent gave Elon Musk and his Department of Government Efficiency team access to the Treasury Department's payment system, which sends out $6 trillion annually in payments from federal agencies and has millions of Americans' personal tax information. On February 3, 2025, Bessent was concurrently named the acting director of the Consumer Financial Protection Bureau, replacing Zixta Martinez, who had been serving as acting director of the Consumer Financial Protection Bureau since the firing of Rohit Chopra on February 1. Bessent immediately ordered the agency to halt all work. On February 3, Bessent, with acting United States Secretary of Commerce Jeremy Pelter, was tasked with implementing a United States Sovereign Wealth Fund. == Personal life == Bessent lives in Charleston, South Carolina. Bessent and his husband, lawyer John Freeman, have two children. ==References== ==Other websites== * Steven Drobny, \"The Stock Operator: Scott Bessent,\" Inside the House of Money |- |- Category:Living people Category:1962 births Category:LGBT businesspeople Category:Republican Party (United States) politicians Category:Gay men Category:Businesspeople from Charleston, South Carolina Category:American philanthropists Category:Politicians from Charleston, South Carolina Category:American LGBT politicians Category:United States Secretaries of the Treasury",
 "title": "Scott Bessent"
}