{
 "id": "1150547",
 "text": "iCar Ecological Technology Co., Ltd., trading as iCar (stylized as iCAR) is a Chinese manufacturer of electric passenger cars owned by Chery. == History == The name \"iCar\" was originally used by Chery several times in the second decade of the 21st century, including for the Karry brand's low-cost pickup model, the platform on which the Arrizo 7 sedan was based, and the Chery New Energy electric car service system. Finally, in April 2023, at the international auto show in Shanghai, iCar debuted as a separate, new brand of small, avant-garde styled electric cars within the Chery Automobile group. The profile of the new subsidiary was defined as aimed at young residents of Chinese metropolises, wanting to distinguish its cars, among other things, with a specific design. The first series product of the subsidiary was the compact crossover iCar 03, and in parallel, a demonstration study of the electric roadster iCar GT was presented. Pre-sale of 03 started in the Chinese domestic market in November 2023, and the official market debut of the new brand was inaugurated in February 2024. While the iCar brand has retained its local character, the 03 model also debuted in May 2024 in the export market specification under the sister brand Jaecoo as the Jaecoo J6. In the meantime, in April of the same year, two more models were launched, heralding the expansion of the future iCar range. At the same time, the pre-production, small SUV V23 made its debut at the international fair in Beijing along with the X25 prototype, a variation on the theme of a minivan and an SUV. The serial V23 went on sale on the Chinese market in autumn 2024, contrary to earlier speculations having nothing to do with the automotive venture Xiaomi Auto. == Products == === Current models === * iCar 03 (2024–present), compact SUV, BEV * iCar V23 (upcoming), compact SUV, BEV * iCar X25 (upcoming), compact off-road MPV, BEV/REEV File:ICAR 03 001.jpg|iCar 03 File:2024 iCar V23 (China) front view.png|iCar V23 File:2024 iCar X25 (China) side view.png|iCar X25 === Concept car === * iCar GT File:ICAR GT 001.jpg|iCar GT ==References== ==Other websites== * Official website Category:Automobile companies of China",
 "title": "ICar (marque)"
}