{
 "id": "1150393",
 "text": "Azul Brazilian Airlines (also called Azul) is a Brazilian airline. It is based in Barueri, a city near São Paulo, Brazil. Azul was founded in 2008 by David Neeleman, who also started the airline JetBlue in the United States. The airline’s goal is to offer affordable flights to places in Brazil that other airlines do not fly to often The name \"Azul\" means \"blue\" in Portuguese. Azul has 166 planes and flies to 162 destinations. It is one of the biggest airlines in Brazil, with many flights both inside Brazil and to other countries. The airline is listed on the Brazilian stock exchange. ==History== Azul Brazilian Airlines was started by David Neeleman, who also founded JetBlue. Azul began flying in Brazil on December 15, 2008. It started with flights between Campinas and three cities: Rio de Janeiro, Salvador, and Porto Alegre. At first, the airline had three Embraer 195 planes and two Embraer 190 planes. By January 2009, they added more planes to fly to Vitória and Curitiba. In May 2012, Azul bought TRIP Linhas Aéreas, Brazil's largest regional airline. The two airlines started working together in December 2012. In 2014, the merger was completed, and TRIP no longer existed. All TRIP flights became part of Azul. In 2014, Azul started flying internationally, with its first international flights to Fort Lauderdale and Orlando in the United States. In 2015, Azul ordered new planes, including Airbus A320neo and Embraer E195-E2 planes. The airline also got big investments from the Chinese HNA Group and United Airlines. In 2019, Azul tried to buy Avianca Brasil's assets to grow even more. In 2020, Azul bought the airline TwoFlex, which helps Azul with smaller flights. ==Fleet== Azul Brazilian Airlines Fleet Aircraft In service Orders Passengers Notes B E E Total Airbus A320neo 48 7 -- -- 174 174 Airbus A321neo 6 5 -- -- 214 214 Airbus A330-200 4 2 27 -- 222 249 2 sold to Brazilian Air Force for Airbus A330 MRTT conversion. Airbus A330-900 5 7 34 -- 264 298 ATR 72-600 40 3 -- -- 70 70 Embraer E195 43 -- -- -- 118 118 Embraer E195-E2 17 58 -- -- 136 136 Azul Cargo fleet Airbus A321-200/P2F 1 1 Cargo Deliveries from October 2024 Boeing 737-400SF 2 -- Cargo Total 167 83 ==References== Category:Airlines of Brazil *[B]: Business Class *[E]: Economy Class *[Cargo]: No Seats, Cargo Configurations",
 "title": "Azul Linhas Aereas"
}