{
 "id": "1150860",
 "text": "Battle of Bali Strait or also known as Banyuwangi Bali Operation Strait was an Indonesian first amphibious warfare occured in 5 April 1946 in Bali Strait.The Battle Involved Indonesian Navy and Dutch Navy the battle resulted into indonesian victory. == Background == Dutch and Allied forces was come to Indonesia in 2 March 1946 they Landed to Recaptured Java as center goverment but before recaptured java they landing in small island like Bali and Lesser Sunda Islands. Situation in Bali and any places get occupied by Dutch Forces with an increase the Soldier into 2.000 Soldiers. With this Situation make the Urge in Main Base of Indonesian Soldier in Yogyakarta to instructed the Operation in Java-Bali to keep the Indonesian independence from the colonizer. The created forces of this operation was M forces (under Captain Markadi command), Captain Albert Warokka forces in Banyuwangi, and the Indonesian Soldier in Bali under Lieutenant Colonel I Gusti Ngurah Rai command. Of the three companies Captain Markadi forces was selected to perform this operation, and Markadi splits his forces into 4 Division:3 Division to focus on the combat and 1 Division to collect the Information. ==Incident in Bali Strait and the Operation== After feeling ready to prepare the forces they launched the Operation they troed to cross the Blockade of Dutch Navy but the heavy rain comes and make them difficult to attack the Dutch. 2 Indonesian Ships was nearly get spotted by the Dutch Navy Markadi give the order to acting like a fisherman to distract the Dutch. After the Dutch LCM was closed to his ships he was drowning himself with the grenades, The Dutch countered the attack with the machine gun but the machine gun not effective to attack the ships. Markadi and his forces throw the grenades into a Dutch LCM ad make heavy casualties into Dutch sides. After this Battle Markadi and his forces joining the Lieutenant Colonel I Gusti Ngurah Rai forces in Bali, they landed in Bali with the good reception by the civilian and soldiers. ==References== Category:20th- century battles Category:1946 Category:1940s conflicts",
 "title": "Battle of Bali Strait"
}