{
 "id": "1150699",
 "text": "https://scholar.google.com/scholar?hl=ar&as;_sdt=0,5&cluster;=9416657642661832394Definition of Tama: Some archaeologists, including Arkell, believe that the Tama are the remnants of the Tamhu, one of the ancient Libyan tribes. The Libyan origin of the Tama tribes (Bazama \"Bidoon\", pp. 42, 43), and (Mohamed Saleh, 2010, p. 40) The word Libya means the geographical region directly west of the Nile River and all that is known from the African continent. (Bulqama, 2001, p. 15) They are tribes of Libyans with blue skin, eyes, and red hair (Abbas, 1968, p. 96). He goes in the same direction that the Zaghawa call the Tama the word Tamara, which in their language means: the man with red hair. As for the popular Tama stories, they mention that they used to live in the Bir al-Natron area, which is now a barren desert, but now they live in northwest Darfur (Mohamed Saleh, 2010, p. 28) and that the Tama tribe consists of more than ninety clans. Tama areas: The Tama people are distributed in the area extending from the Kabkabiya area in northwestern Darfur to the city of Gereida in northeastern Chad (McMichael, 2013, translated by: Deedan, p. 112). They take several names, including: Tama and Eringa. The Tama home is located south of Dar Qamar and on the northern border of Wadi and Dar Masalit (Awad, 2013, p. 269). To the west, the Zaghawa are an influential tribe in the events of central Sudan (Abu Salim, 1992, p. 222). They are also a large tribe in Darfur with their own history, and their ruler is called Sultan. They are famous in Kordofan for the manufacture of iron (maloud). They are called in Kordofan by several names: Tama, Tema, and Tumam. Their home is shared by a number of Arab tribes, including the Mahriya, Awlad Zaid, Awlad Rashid, Awlad Kulayb, Al-Ariqat, Al-Shaqirat, and Awlad Sufyan. And the sons of Ghanem (Muhammad Salih, 2010 AD, pp. 45-49). Tama language: The Tama language belongs to the Eastern Sudanese Tama linguistic group of Nilo-Saharan (Abu Manga, 2011, p. 18), and (Khair El Sayed, 2013, p. 111), the number of its speakers is about 200,000 people, its code: ISO 639-3 TMA Linguasphere 05-PEA-AA, (- Wikipedia, the free encyclopediawww.google.com) which is spoken by the Tama group located in western Sudan and eastern Chad, and is spread in areas, the most important of which are Kabkabiya, Gereida, Barak, Manjoura, Saliah, Jebel Moon, and Hajar Tama, Sirba and Abu Suruj, Serf Jadad, Bir Daqiq, Kandabi, Aqar, and it is a language that has not been studied yet, (Yahya, Othman Ibrahim, 2015, p. 179) and the Tama language consists of four dialects: the Tama dialect, and the Eringa dialect which is similar to the language of Tama and Arainga, the Mararit dialect (Abu Sharb), and the Misseriya Jabal dialect, or the Mon (Mohammed Salih, 2010, p. 46), and the Mon are small groups compared to the Arainga tribes, residing north of the city of Geneina (McMichael, 2013, translated by: Deedan, p. 112), and the last dialect is the Qamar dialect, the Abu Joukh branch, which speaks the Tama language (Mohammed Salih, 2010, p. 69), and they do not have a dialect of their own that they communicate with other than it according to historical sources, so we included it among the Tama dialects (McMichael, 2013, translated by: Deedan, p. 112), and it is one of the languages threatened with extinction according to the UNESCO report (Tama in the Language Cloud. www.google.com). Category:Libya",
 "title": "Dar Tama"
}