{
 "id": "1150225",
 "text": "Princess Sophie of Romania (born 29 October 1957) is the fourth daughter of King Michael I of Romania and Queen Anne. Sophie is a professional photographer and is also a patron of the arts in Romania. == Life == Sophie was born on 29 October 1957, at Tatoi Palace in Decelea, Kingdom of Greece, she shares the same day and month of birth with her paternal great-grandmother Queen Marie, who was also born on a 29 October. She was baptized in the Romanian Orthodox Church; her godmother and namesake is her father's first cousin Princess Sophie of Greece and Denmark, later Queen of Spain. She was educated in Switzerland where her family lived and in the United Kingdom. She has three elder sisters, Margareta (b.1948), Princess Elena (b.1951) and Princess Irina (b.1953), as well as a younger sister, Princess Maria (b.1964). Sophie spent her childhood at her family homes in Lausanne, Switzerland and in the United Kingdom at Ayot House, St Lawrence, Hertfordshire. During holidays she and her sisters spent time with their grandparents, Helen, Queen Mother in Florence, Italy at Villa Sparta and in Denmark with Princess Margrethe and Prince Rene. As a young girl, Sophie and her sisters were told “fascinating tales of a homeland they couldn’t visit” by their father. Her teenage years were spent in Europe with her family, where she and her sisters received primary and secondary education. ==Education== Sophie studied at the University of North Carolina in Asheville, US, where she studied Fine Arts and Photography for a couple of years. Later she studied to obtain a bachelor’s degree in graphic design and a master’s degree in photography at Corcoran College of Arts and Design in Washington, D.C. ==Marriage== Princess Sophie has a daughter from her former marriage to Alain Michel Leonce Biarneix \"de Laufenborg\" (b. Nancy, France on 10 July 1957). They married on 29 August 1998 in a civil ceremony in Neuilly-sur-Seine, France. Later they divorced in 2002. -Elisabeta-Maria de Roumanie Biarneix (b. Argenteuil, France on 15 August 1999). ==Titles, styles and honours== === Titles and styles === * 29 October 1957 – 10 May 2011: Her Royal Highness The Princess Sophie of Romania, Princess of Hohenzollern-Sigmaringen * 10 May 2011 – present: Her Royal Highness The Princess Sophie of Romania ===Honours=== ===Dynastic=== * House of Romania: Knight Grand Cross of the Royal Order of the Crown * House of Romania: Knight, Special Class of the Royal Decoration of the Custodian of the Crown of Romania ===Ecclesiastical=== * Order of Our Lady of Prayer (Romanian Orthodox Church)Romania Regala ===Award=== * -United Nations Philanthropy International Organization and Saned International Organization: Recipient of the Kotinos International Award, Certificate of Excellence Archived 3 September 2018 at the Wayback Machin ==References== ==Other websites== * Official website of the Romanian royal family * Official blog of the Romanian royal family Category:Living people Category:House of Romania",
 "title": "Princess Sophie of Romania"
}