{
 "id": "1150892",
 "text": "Eric Scott Turner (born February 26, 1972) is an American businessman, motivational speaker, Republican politician, and former professional football player who has been the 19th and current United States Secretary of Housing and Urban Development since 2025 under the second Donald Trump administration. Turner was the executive director of the White House Opportunity and Revitalization Council during the first Donald Trump administration. Turner was a member of the Texas House of Representatives from 2013 to 2017. Before entering politics, Turner was an American football cornerback who played in the National Football League (NFL) for nine seasons between 1995 and 2003. In November 2024, President-elect Trump announced his plans to name Turner as the Secretary of Housing and Urban Development in his second administration. He was confirmed by the United States Senate in February 2025. ==Early life== Turner was born in Richardson, Texas and grew up in the Dallas area.Batheja, Aman (December 17, 2014). In Bid for Speaker, Turner Looks to Beat the Odds. Texas Tribune. He played football and ran track in high school. Turner studied at the University of Illinois.Xavier, Diane (October 9, 2021). Former NFL athlete gives back to communities that helped him along the way. The Dallas Examiner. In football, he played as a wide receiver and became a cornerback later on. He earned All-Big Ten honors,Football (March 10, 2006). Catching Up with Former Illini Gridder and Sprinter Scott Turner. University of Illinois. He graduated in 1995. ==Football career== Turner was drafted in the seventh round of the 1995 NFL draft by the Washington Redskins.Zimmerman, Lisa (2016). Former DB Scott Turner’s post-NFL accomplishments are vast and impressive. NFL Enterprises. He played cornerback for the Redskins from 1995 to 1997. He then played four seasons, from 1998 to 2002, for the San Diego Chargers. Turner signed with the Denver Broncos in 2003. A leg injury in 2004 during training camp ended his professional football career. ==Texas House of Representatives== After his football career, Turner worked as an intern for Congressman Duncan Hunter. He later worked full-time in the congressman's office. In 2006, he ran for the U.S. House of Representatives in California during a special election to replace Duke Cunningham. He lost the election. After losing the election, Turner moved back to Frisco, Texas. In 2012, Turner successfully ran for the Texas House of Representatives as a Republican. Scott Turner (E. Scott Turner. Legislative Reference Library of Texas. He unsuccessfully ran for speaker of the state house in 2015. He decided not to run for re-election in 2016. After leaving the state house, President Trump hired Turner as the director of the White House Opportunity and Revitalization Council.Hon. Scott Turner. Executive Director, White House Opportunity and Revitalization Council, WHITE HOUSE. U.S. Department of Justice. ==Business career== From 2007 to 2023, Turner worked at Systemware, a software company. Turner is the founder and president of Community Engagement & Opportunity Council (CEOC), which helps children who are living in poverty.JPI (June 7, 2023) JPI ANNOUNCES APPOINTMENT OF SCOTT TURNER AS CHIEF VISIONARY OFFICER. Turner and his wife, Robin Turner, own Statesman Clothiers, a custom men’s clothing company.Pearson, Mike (February 25, 2017). Illini legends, lists & lore: Scott Turner. The News-Gazette. ==U.S. Secretary of Housing and Urban Development== On November 22, 2024, President-elect Donald Trump picked Turner to be his Secretary of Housing and Urban Development for his second administration. Turner appeared before the Senate Committee on Banking, Housing and Urban Affairs on January 16, 2025. The committee approved his nomination in a 13-11 vote on January 23. He was confirmed by the United States Senate on February 5, 2025 by a 55 to 44 vote. He was sworn in by Justice Clarence Thomas that same day. ==Personal life== Turner married Robin Turner in 1995, having met in college. The couple raised his nephew, Solomon, together. Solo Turner. University of Illinois Athletics. Turner is an associate Baptist pastor.Prestonwood Baptist Academy (October 9, 2024). From the NFL to the White House | The Life of Scott Turner | The Journey Podcast (transcript). Youtube. ==References== ==Other websites== * 2006 campaign website *House profile * Category:1972 births Category:Living people Category:American football cornerbacks Category:Washington Redskins players Category:San Diego Chargers players Category:Denver Broncos players Category:American football wide receivers Category:State legislators of the United States Category:Businesspeople from California Category:Politicians from California Category:Sportspeople from California Category:Politicians from Dallas Category:Businesspeople from Dallas Category:Sportspeople from Dallas Category:Republican Party (United States) politicians Category:United States Secretaries of Housing and Urban Development",
 "title": "Scott Turner (politician)"
}