{
 "id": "115068",
 "text": "The Munich Agreement, was an agreement between France, Italy, Germany and Britain. Germany threatened an invasion of the Sudetenland in Czechoslovakia. The British and French prime ministers tried to get Adolf Hitler to agree to not use his military in return for taking the land. After Hitler agreed, most people thought that the agreement was a success. However, Germany invaded the rest of Czechoslovakia in 1939. Later that year, the Second World War started after Germany invaded Poland. == Background == Czechoslovakia was an independent country since it had been formed in 1918. After the First World War this was done by international agreement. Adolf Hitler wanted Lebensraum (meaning \"living space\") to have all Germans in Czechoslovakia united with Germany. As most German speakers in Czechoslovakia were in the Sudetenland, Hitler set his sights there first. He knew that was the main industrial strength of Czechoslovakia. Britain, France and the Soviet Union had all agreed to support Czechoslovakia if it was invaded. == Crisis == On September 12, 1938, Hitler told the Sudeten Germans that he would support them. On the 15th, Neville Chamberlain met with Hitler in a last-ditch attempt to stop the war. Hitler moderated his demands and said he was interested only in part of Czechoslovakia. Chamberlain thought that was reasonable and that Hitler would be satisfied. However, on the 22nd, Hitler changed his demands and now said that he wanted all of the Sudetenland. The British Navy mobilised, and war seemed imminent. Benito Mussolini persuaded Hitler to attend a four-power peace conference in Munich on 29 September. The conference was held between four leaders: Hitler for Germany, Mussolini for Italy, Chamberlain for Britain and Édouard Daladier for France. The Soviet Union and Czechoslovakia were not invited. At the conference, Mussolini put forward a plan, which had really been written by the German Foreign Office, for the Sudetenland was to become part of Germany immediately. The German Army was to march into the Sudetenland the following day and to claim it as German territory. Czechoslovakia had not been even consulted, and the Soviet Union attacked the idea. Chamberlain returned to Britain to receive a hero's welcome, as he had achieved \"peace for our time\" with his policy, and people feared another world war. The same cheering happened for Daladier in France. ==Aftermath== Edvard Beneš, the Czechoslovak president, resigned. He felt betrayed since Britain and France had promised to help his country. However, he displeased his army by telling it not to fight Germany since he thought that his country would be destroyed by air strikes. On October 1, Germans walked into the Sudetenland, and Hungary and Poland also grabbed land in Czechoslovakia with had Hungarians and Poles. Germany invaded Prague in March 1939 and Poland in September. Britain and France declared war on Germany and so the Second World War started ==Other websites== * The Munich Agreement - Text of the Munich Agreement on-line * British Pathe newsreel (includes Chamberlain's speech at Heston aerodrome) *Peace: And the Crisis Begins from a broadcast by Dorothy Thompson, October 1, 1938 Category:1938 in Germany Category:20th century in Munich Category:World War II Category:1930s treaties Category:Czechoslovakia",
 "title": "Munich Agreement"
}