{
 "id": "1150873",
 "text": "Brooke Leslie Rollins (born April 10, 1972) is an American lawyer and Republican politician who has been the 33rd and current United States Secretary of Agriculture since 2025. She was the president and CEO of the America First Policy Institute. She was the acting director of the United States Domestic Policy Council under President Donald Trump. Rollins was also part of the White House Office of American Innovation. In November 2024, President-elect Trump picked Rollins to be his secretary of agriculture under his second administration. She was confirmed by the U.S. Senate in February 2025, making Rollins the second woman to hold his role in the department's history. ==Early life== Rollins was born in Glen Rose, Texas. She studied at Texas A&M; University. While at Texas A&M;, Rollins was the first woman to be elected student body president. Rollins graduated with a Juris Doctor from the University of Texas School of Law. After graduating from law school, Rollins worked as a lawyer in Dallas. Rollins was president and CEO of the Texas Public Policy Foundation from 2003 through 2018. She also worked for Texas Governor Rick Perry as an advisor and general counsel. ==First Trump administration== In February 2018, Rollins became President Donald Trump's assistant for intergovernmental and technology initiatives. She later became a member of the Office of American Innovation. In May 2020, President Trump named Rollins acting director of the United States Domestic Policy Council. When she became acting director, the country was experiencing the massive protests after George Floyd was killed. She said she wanted \"all sides of the table to figure out how we can move forward together.\" After Donald Trump's lost in the 2020 presidential election, Rollins and Larry Kudlow created a new nonprofit organization focused on continuing Trump's ideas. Rollins became the president and CEO of the America First Policy Institute in 2021. ==U.S. Secretary of Agriculture (2025–present)== On November 23, 2024, President- elect Trump nominated Rollins to serve as his secretary of agriculture for his second presidency. She appeared before the Senate Committee on Agriculture on January 23, 2025. The committee advanced her nomination in a unanimous vote on February 3. On February 13, 2025, the Senate confirmed Rollins as the secretary of agriculture in a 72-28 vote. She is the second woman to hold the position, after Ann Veneman. ==References== ==Other websites== *Brooke Rollins at Ballotpedia * Category:1972 births Category:Living people Category:Lawyers from Austin Category:Politicians from Austin, Texas Category:Republican Party (United States) politicians Category:United States Secretaries of Agriculture",
 "title": "Brooke Rollins"
}