{
 "id": "1150591",
 "text": "The Kia Cadenza is a full-size sedan made by the South Korean car manufacturer Kia. It was first introduced in 2010. It was sold until 2021. In South Korea, it is also known as the Kia K7. The Cadenza replaced the Kia Opirus. == First generation (VG; 2009–2016) == The first generation of the Kia Cadenza was produced from 2009 to 2016. It was designed by Peter Schreyer, who was also known for designing cars at Audi. The car was manufactured in South Korea and Kazakhstan. It was available with several engine options, including a 2.4L 4-cylinder engine and a 3.5L V6 engine. Some markets also offered a version with an LPG engine. The Cadenza used a front-wheel drive system. It had a 6-speed automatic transmission. The car had features such as leather seats, a navigation system, and a sunroof, which are common in luxury vehicles. In the United States, the Cadenza was compared to other luxury sedans. == Second generation (YG; 2016–2021) == The second generation of the Kia Cadenza was launched in 2016. This model featured a new design and updated features. It was available with updated engines, such as a 2.5L Smartstream engine and a 3.3L V6 engine. The car also had a 8-speed automatic. In 2019, the Cadenza received a facelift. This update included a redesigned front grille, new bumpers, and a larger infotainment touchscreen. == Markets == The Kia Cadenza was sold in several countries since its launch it was sold in South Korea, the United States, Canada, China, Colombia, Brazil, Chile, and many countries in the Middle East. == Discontinuation == The Kia Cadenza was discontinued in Canada after the 2019 model year. It was discontinued in the United States after the 2020 model year. This was because of the growing demand for SUVs and crossovers over large sedans. Production of the Cadenza ended in January 2021. It was replaced by the Kia K8. == References == Category:2010s automobiles Category:2020s automobiles Cadenza Category:Sedans",
 "title": "Kia Cadenza"
}