{
 "id": "1150995",
 "text": "The Toyota Mirai is a hydrogen Fuel cell vehicle (FCV) made by Toyota. It is the first mass-produced FCV. The car was introduced in 2014, and it uses hydrogen to produce electricity for its motor. The Mirai is one of Toyota's hydrogen fuel cell vehicles, and It has been sold in various countries, including the United States, Japan, and parts of Europe. ==First generation (2014-2020)== The first generation of the Toyota Mirai was produced from December 2014 to 2020. The first generation of the Mirai was produced from December 2014 to 2020 and was one of the first commercial vehicles to use Toyota's fuel cell technology. The car was built to be efficient, with a range of up to 312 miles (502 km) on a full tank of hydrogen. It used a front- wheel-drive layout and had a 113 kW electric motor powered by hydrogen. The first generation of the Mirai was sold in several markets, including the United States, Japan, and Europe. File:Toyota Mirai – Frontansicht, 11. November 2018, Düsseldorf.jpg File:Toyota Mirai – Heckansicht, 11. November 2018, Düsseldorf.jpg File:2015 Toyota MIRAI ZBA-JPD10 Cockpit.jpg ==Second generation (2020-present)== The second generation of the Toyota Mirai was introduced in December 2020 and is built on a new platform with rear-wheel drive. This generation offers improved fuel efficiency and a longer driving range, reaching up to 402 miles (647 km) on a full tank of hydrogen It also includes new features such as Toyota's 'Teammate' driver assistance system, which provides driving and parking support. The second generation is also equipped with a new infotainment system introduced in 2023. File:Toyota Mirai (JPD20) Auto Zuerich 2023 1X7A1145.jpg File:Toyota Mirai (JPD20) Classic-Gala 2021 1X7A0174.jpg File:The interior of Toyota MIRAI Z\"Executive Package\" (ZBA- JPD20-CEDHS(E)) with factory-installed option (2).jpg ==References== Category:Toyota automobiles Category:Sedans Category:2020s automobiles",
 "title": "Toyota Mirai"
}