{
 "id": "1150055",
 "text": "Rezvani Motors is an American company that designs and builds high-performance sports cars. It is based in Irvine, California. The company was founded in 2013 by Ferris Rezvani. Rezvani Motors is known for creating powerful cars, like the Rezvani Beast and Rezvani Tank. == History == Rezvani Motors was founded in 2013 by Ferris Rezvani. The company’s cars are made in a factory in Santa Ana, California. In 2015, Rezvani introduced the Rezvani Beast, which is a lightweight sports car based on the Ariel Atom. The company also became famous for making the Rezvani Tank, a special military-style vehicle for the road. The Tank has features like bulletproof glass and armored body panels. Some famous people who own Rezvani cars include Chris Brown, Enrique Iglesias, and Jamie Foxx. == Products == === Beast === The Rezvani Beast is a small, fast sports car. It is based on the Ariel Atom, but it has a new carbon fiber body. The car is light and powerful, weighing only around 1,650 pounds. The Beast has a six-speed manual transmission and is designed for high performance. === Beast X === The Beast X is a more powerful version of the Beast. It weighs 1,850 pounds and has 700 horsepower. It can reach 60 mph (96 km/h) in 2.5 seconds. Only 5 Beast X cars were made. === Beast Alpha === In November 2016, Rezvani introduced the Beast Alpha. as an upcoming version. The Alpha will include Rezvani's newly patented \"Sidewinder doors\", This version of the Beast includes new features like Sidewinder doors, which open sideways. The car also comes with a hardtop, power windows, power locks, airbags, and climate control. === Beast Alpha X === In February 2018, Rezvani unveiled the Beast Alpha X, also known as the \"Blackbird\". This version is inspired by the Lockheed SR-71 Blackbird and is the most performance-oriented car in the lineup. The Beast Alpha X has a 700-horsepower 2.5-liter turbocharged engine, allowing it to go from 0-60 mph (0-96 km/h) in just 2.9 seconds. It also has a reduced body weight of 2,150 pounds. The car is designed to offer extreme performance while still being street legal. ===Tank=== The Rezvani Tank revealed in 2017 is a special car designed like a military vehicle. It can be ordered with bulletproof armor, run-flat tires, and other features. ===Hercules=== The Rezvani Hercules revealed in November 2020 is a 6x6 pickup truck. It is built using the Jeep Gladiator body and comes with powerful engine options, including a 1,300 horsepower supercharged V8. ===Vengeance=== The Rezvani Vengeance is an off-road SUV. It has different engine options and can come with a Military Package, which includes bullet-resistant windows and body armor. == References == Category:American automobile companies",
 "title": "Rezvani Motors"
}