{
 "id": "1150524",
 "text": "In the year of 1350 Majapahit and his Prime Minister Gajah Mada led a naval invasion on Samudra Pasi Sultanate of Sumatra. They defeated Sultan Ahmad Malik. The reason for this Invasion was for the cruelty of the Sultan, daughter of Hayam Wuruk was in love with son of Sultan Ahmad Malik named Tun Abdul Jalil. When Sultan Ahmad Malik came to know about this he became furious and executed his son. On the other hand the princess committed Sucide when she came to know about the death of her future husband. When Hayam Wuruk and Gajah Mada came to know about this act they became so angry that they planed a Naval Invasion on the Sultanate. In which later was defeated and Majapahit captured the Sultanate of Samudra Pasai for a brief period of time. ==Background== Sultan Ahmad Malik's violent behavior resurfaced when his second son, Tun Abdul Jalil, began a romantic relationship with Raden Galuh Gemerencang, a princess from the Majapahit Kingdom. This could have been a chance to strengthen ties with Majapahit, as the kingdom was entering a prosperous era under King Hayam Wuruk. With the powerful Gajah Mada serving as prime minister, Majapahit was on the rise. However, instead of fostering peace, Sultan Ahmad Malik chose to create conflict. The Sultan, taken by the beauty of Raden Galuh Gemerencang, wanted her for himself and decided to stop her from marrying his son, Tun Abdul Jalil. He planned a cruel fate for the prince, just as he had done with his eldest son. Tun Abdul Jalil was killed, and his body was thrown into the sea. Meanwhile, Raden Galuh Gemerencang arrived in Samudera Pasai, only to learn of her fiancé’s tragic death. Heartbroken and devastated by the news, the princess was so grief-stricken that she threw herself into the sea, where Tun Abdul Jalil’s body had been discarded. Her guards returned to Java and reported the tragic events to King Hayam Wuruk and Gajah Mada, who would learn of Sultan Ahmad Malik’s cruel actions. ==Battle== Both the armies prepared for battle the troops clashed fiercely, and many were killed or wounded. After each battle, both sides retreated to their defenses. This continued for about three months, with no clear victor, as the Javanese forces were reinforced regularly. Frustrated, the Senapati blamed his commanders and decided to lead his own warriors into battle, bringing about a thousand men. He also ordered the entire armada to disembark and prepare for battle. Sultan Ahmad gathered his top captains and warriors, including well-known champions and leaders from various places, and assembled elephants, horses, and countless soldiers. At dawn, the another battle was fought. The bloodshed was immense, and reinforcements continued to arrive for the Majapahit troops. The battle lasted for three days and nights, leaving countless leaders, warriors, and soldiers dead. The Sultan was told of the heavy losses, and he mourned, wishing his son Beraim Bapa was there to lead the fight, as he believed no army could defeat his son. In response, Tun Perpateh Tulus Agong Tukang Sukara recited a verse. Sultan Ahmad left his palace with his family and valuables and went to Menduga, a place fifteen days' journey from Pasai. After three days of fighting, the soldiers from Pasai were defeated and ran in all directions. The Majapahit army took control of Pasai's defenses and the palace, taking many treasures and prisoners. While staying in Pasai, both soldiers and civilians enjoyed feasts. After the Java troops occupied Pasai, the Senapati ordered the boats to be filled with loot and prisoners, and they sailed back triumphantly. Stopping at Jambi and Palembang, both places became vassals of Majapahit. Upon returning to Java, the Senapati presented the loot, prisoners, and hostages to the Emperor, who ordered the booty to be divided among himself, the Senapati, and the troops. The Pasai prisoners were allowed to settle freely in Java, leading to the many holy places from that time, as the story goes. == References == Category:Indonesia",
 "title": "Majapahit conquest of Pasai"
}