{
 "id": "1150898",
 "text": "Janette Nesheiwat is an American physician, commentator and politician. Nesheiwat was as an assistant medical director of CityMD. She is a medical contributor on Fox News. In November 2024, President-elect Donald Trump nominated Nesheiwat to be the United States surgeon general under his second administration. Her nomination was withdrawn by President Trump in May 2025. ==Early life== Nesheiwat was born in Carmel, New York. Her parents are Christian Jordanian immigrants. Her sisters are Julia Nesheiwat, Jaclyn Stapp, Dina Nesheiwat, and Daniel Nesheiwat. In 1982, Nesheiwat's family moved to Umatilla, Florida. She earned a Bachelor of Science in Biology from University of South Florida in 2000. She also studied at Stetson University. Nesheiwat graduated from the American University of the Caribbean School of Medicine and at University of Arkansas for Medical Sciences in 2009. ==Medical career== Nesheiwat began her career in family medicine in Arkansas. She was also the host of Family Health Today. In 2012, she was awarded the Red Cross community partner hero award. She was known for her medical work, local television reporting, and international relief efforts in Haiti. Nesheiwat later moved to New York City, where she became a medical director for CityMD. In March 2020, she was hired by Fox News as a medical commentator. She talked about the COVID-19 pandemic during her time with Fox. Nesheiwat wrote a book Beyond the Stethoscope: Miracles in Medicine, which was released in 2024. She also sells her own brand of dietary supplements, called BC Boost. ==U.S. Surgeon General== On November 22, 2024, President-elect Donald Trump nominated Nesheiwat to serve as the United States surgeon general for his second administration. On May 7, 2025, Trump withdrew the nomination after investigative reporting revealed that Nesheiwat lied about her medical education and lied about being commissioned as an army officer. Hours later, Trump announced that he would instead nominate Casey Means as surgeon general. ==References== ==Other websites== * Official website * Category:1976 births Category:Living people Category:American physicians Category:Fox News people Category:Politicians from New York (state) Category:Politicians from Florida Category:Politicians from Arkansas Category:American television news anchors Category:Journalists from Florida Category:Journalists from New York (state) Category:Journalists from Arkansas Category:Writers from New York (state) Category:Writers from Florida Category:Writers from Arkansas",
 "title": "Janette Nesheiwat"
}