{
 "id": "1150803",
 "text": "The Acura ZDX is a mid-size luxury Crossover SUV developed by Honda for its premium brand, Acura. The first-generation ZDX was introduced in 2009 as a 2010 model and was sold until 2013. It was notable for its unique design, featuring a sloping rear roofline. The second generation of the ZDX, launched in 2024, marks the brand’s first electric vehicle and is co-developed with General Motors using the Ultium platform. == First Generation (2009-2013) == The first-generation ZDX was designed with a coupe-like roofline and was based on the Honda Pilot and Acura MDX. It was powered by a 3.7-liter V6 engine, producing 300 hp and paired with a six-speed automatic transmission. It offered all-wheel drive and featured several luxury features, such as leather upholstery, a panoramic roof, and advanced safety systems. Despite its innovative design, the ZDX was discontinued in 2013 due to poor sales, with just over 7,000 units sold in North America. == Second Generation (2024-Present) == {{Infobox automobile | name = Second generation | image = 2024 Acura ZDX Type S in Cosmic Black Metallic, front right, 2024-11-06.jpg | caption = 2024 Acura ZDX Type S | manufacturer = | aka = | production = March 2024 – present | assembly = United States: Spring Hill, Tennessee (Spring Hill Manufacturing) | designer = | layout = | platform = GM BEV3 | related = | motor = Permanent magnet motor | battery = 102 kWh Ultium lithium-ion | powerout = | electric_range = Up to EPA | charging = {{unbulleted list | 190 kW (DC) }} | wheelbase = | length = | width = | height = | weight = }} The second-generation ZDX debuted in 2023 as an electric vehicle (EV), marking a significant shift for Acura. It shares components with the Cadillac Lyriq and Chevrolet Blazer EV, including its powertrain and platform. The ZDX offers three powertrain options: a single-motor rear-wheel drive with 358 hp, an all-wheel drive with 490 hp, and the high-performance Type S variant with 500 hp. All versions are powered by a 102 kWh Ultium battery, providing an electric range of up to 313 miles. The ZDX features cutting-edge technology, including Google Built-in and the AcuraWatch 360+ system, with hands-free driving capabilities. == Markets == The Acura ZDX is sold only in the North American market. == References == Category:Sport utility vehicles Category:2000s automobiles Category:2010s automobiles Category:2020s automobiles Category:Acura automobiles",
 "title": "Acura ZDX"
}