{
 "id": "1150796",
 "text": "Willie D. Spears Jr. known as Willie Spears is an American motivational speaker, author, coach, and licensed minister. He is an award-winning teacher and has worked as a radio personality and national columnist. Through his business, The Willie Spears Experience, he speaks to schools, companies, sports teams, churches, and prison inmates. == Early Life & Coaching == Willie Spears was born in Panama City, Florida. He is the great-great-grandson of Jose Massalina, who was the first black man to settle in Panama City. Willie is also the great-great-grandson of Hawk Massalina, who fought in the Civil War for both the Union and the Confederacy and lived to be 107 years old. He has written two children's books about his ancestor \"Who was Hawk Massalina?\" (2020) and \"George and Hawk's Big Adventure\" (2023). Willie graduated from Rutherford High School and attended Gulf Coast State College and Florida State University. Willie later transferred to Northwestern Oklahoma State University (NWOSU), where he was a starting wide receiver for the Rangers football. He led the team in catches and helped them win 31 games in a row. In the 1999 NAIA National Championship, helped NWOSU win against Georgetown College, 34-26, after being down 20-0 at halftime. Willie began his first head football coaching job at Jefferson County High School in Monticello, Florida. He was recognized as Coach of the Year by several organizations, including the Florida Athletic Coaches Association and the Tallahassee Democrat. After that, he worked as the head football coach for two seasons at Suwannee High School and two seasons at Escambia High School. During his two seasons at Escambia High School, Willie led the Gators to a record of 14 wins and 8 losses, and they won one district title. In 2014, he was fired by Escambia County School Superintendent Malcolm Thomas due to his involvement in recruiting violations in Florida High School Athletics. However, Spears was later cleared of these charges. A few months after his firing, he was hired as a morning show host on Blad TV in Pensacola, Florida, with a positive recommendation from Thomas. That same year, the Bay County Branch of the National Association for the Advancement of Colored People recognized him for his achievements. In the following six years, Willie worked at several places, including Florida A&M; University, Northwestern Oklahoma State University (NWOSU), Vernon High School in Florida, and G.W. Carver and Bullock County high schools in Alabama. In 2020, Willie was the coach for the first football season at Valiant Cross, a school that was established 2015. == Speaking == Willie started speaking and providing professional development services part-time in 2006. He began focusing on his work fill-time in 2020. As the founder of the \"Willie Spears Experience\", he has worked with various organizations, including The Southern Company, State Farm, and the Allen and Jean Miller Centre in Alberta, Canada. Willie has appeared on several television networks, including CNN, FOX, HBO, and ESPN, as well as regional stations. He participated in a debate with Stephen A. Smith on ESPN. == References == Category:Writers Category:American people Category:Football coaches Category:Teachers",
 "title": "Willie D. Spears Jr."
}