{
 "id": "1150101",
 "text": "Place Name- Madriu-Perafita-Claror Valley Country- Andorra Type- Cultural Description- The Madriu-Perafita-Claror Valley stretches through the parishes of Andorra la Vella, Escaldes-Engordany, Encamp and Sant Julià de Lòria. The Madriu-Perafita-Claror Valley stretches through the parishes of Andorra la Vella, Escaldes-Engordany, Encamp and Sant Julià de Lòria. The valley is a glacial landscape, with high pastures, craggy cliffs, and steep wooded valleys. It is bounded by mountain ridges to the south, east and west, with the southern edge running along the border with Spain, and by an escarpment which drops away into the Valira valley to the north. It is isolated from the rest of Andorra, and can only be reached by tracks passable on foot. Dwellings, field terraces, tracks, and the remains of ironworking demonstrate the ways that the natural resources of the high Pyrenees were used by the local inhabitants over a period of over 700 years, through changes in climate,[dubious – discuss] economic prosperity, and social structures. History- The Madriu-Perafita-Claror Valley is a microcosm that illustrates the way in which man has harvested the mountain resources over the past millennia. It also reflects the persistence of an ancient communal system of land management – four communities own land within the property. Threats- On 21 July 2015, major gravel (rocky ground of small pebbles and soil) erosion took place due to an episode of torrential rains on the Claror river’s wastelands, specifically on certain very steep slops with little vegetation. As a result, the Claror river (tributary of the Madriu river) was muddied significantly, making the Escaldes-Engordany parish’s water unfit for human consumption for several days. With the area already in a fragile state, later there were less intense rains recorded that resulted in episodes of exceptional muddying, which caused potable water supplies to be cut again. HISTY GIRLY 2024 All Rights Reserved November 22 2024 Category:Andorra",
 "title": "Madriu Perafita Claror Valley"
}