{
 "id": "1150920",
 "text": "Uruguay is a presidential republic in which the president is both the head of state and head of government. The following is a list of all the people who have held the office of President of Uruguay since 6 November 1830. == Governors of Uruguay as a province == === Oriental Province (1814–1817) === Province part of the United Provinces of the Río de la Plata. No. Portrait Name (Birth–Death) Term of office Notes (1) Nicolás Rodríguez Peña (1775–1853) 9 July 1814 25 August 1814 Governor. Appointed by Gervasio Antonio de Posadas, Supreme Director of the United Provinces of the Río de la Plata. (2) Miguel Estanislao Soler (1783–1849) 25 August 1814 25 February 1815 Governor. (3) (1774–1831) 26 February 1815 July 1815 Governor. Appointed by José Gervasio Artigas. (4) (1789–1848) July 1815 20 January 1817 Governor. Appointed by José Gervasio Artigas. === Cisplatine Province (1817–1828) === After the Portuguese conquest of the Banda Oriental the Oriental Province became a province of the United Kingdom of Portugal, Brazil and the Algarves and a province of the Empire of Brazil after 1822. No. Portrait Name (Birth–Death) Term of office Notes /1/ Carlos Frederico Lecor (1764–1836) 20 January 1817 3 February 1826 Governor. /2/ (1769–1847) 3 February 1826 27 August 1828 Governor. === Oriental Province (1825–1828) === In the Congress of Florida the Oriental Province declared independence from the Empire of Brazil and reunited with the United Provinces of the Río de la Plata. No. Portrait Name (Birth–Death) Term of office Notes (5) Juan Antonio Lavalleja (1784–1853) 19 September 1825 5 July 1826 Governor. Appointed by the Congress of Florida. (6) Joaquín Suárez (1781–1868) 5 July 1826 12 October 1827 Governor. (7) Luis Eduardo Pérez (1774–1841) 12 October 1827 27 August 1828 Governor. Appointed by Juan Antonio Lavalleja. == Heads of state of Uruguay as an independent country == === Government and Provisional General Captaincy of the Oriental State of Uruguay (1828–1830) === After the Preliminary Peace Convention the Oriental Province gained effective independence from the Empire of Brazil and the United Provinces of the Río de la Plata. No. Portrait Name (Birth–Death) Term of office Notes -1- Luis Eduardo Pérez (1774–1841) 27 August 1828 1 December 1828 Governor and Provisional Captain General. Appointed by Juan Antonio Lavalleja. -2- Joaquín Suárez (1781–1868) 2 December 1828 22 December 1828 Governor and Provisional Captain General. Appointed by the General Constituent Assembly. -3- José Rondeau (1775–1844) 22 December 1828 17 April 1830 Governor and Provisional Captain General. Appointed by the General Constituent Assembly. Resigned. -4- Juan Antonio Lavalleja (1784–1853) 17 April 1830 28 June 1830 Governor and Provisional Captain General. Appointed by the General Constituent Assembly. === Oriental State of Uruguay (1830–1919) === The Constitution of 1830 comes into force. No. Portrait Name (Birth–Death) Term of office Party Party Elected Notes -5- Juan Antonio Lavalleja (1784–1853) 28 June 1830 24 October 1830 — — Governor and Provisional Captain General. Appointed by the General Constituent Assembly. =1= Luis Eduardo Pérez (1774–1841) 24 October 1830 6 November 1830 — — President of the Senate exercising the Executive Power. 1 Fructuoso Rivera (1784–1854) 6 November 1830 24 October 1834 — 1830 1st Constitutional President, elected by the General Assembly. Resigned. =2= Carlos Anaya (1777–1862) 24 October 1834 1 March 1835 Colorado — President of the Senate exercising the Executive Power. 2 Manuel Oribe (1792–1857) 1 March 1835 24 October 1838 National 1835 2nd Constitutional President, elected by the General Assembly. Resigned. =3= Gabriel Antonio Pereira (1794–1861) 24 October 1838 1 March 1839 Colorado — President of the Senate exercising the Executive Power. 3 Fructuoso Rivera (1784–1854) 1 March 1839 1 March 1843 Colorado 1839 3rd Constitutional President, elected by the General Assembly. \\- Manuel Oribe (1792–1857) 16 February 1843 8 October 1851 National — Self-proclaimed president of the Gobierno del Cerrito, during the Uruguayan Civil War. =4= Joaquín Suárez (1781–1868) 1 March 1843 15 February 1852 Colorado — President of the Senate exercising the Executive Power. President of the Gobierno de la Defensa, during the Uruguayan Civil War. \\- =5= Bernardo Prudencio Berro (1803–1868) 15 February 1852 1 March 1852 National — President of the Senate exercising the Executive Power. 4 Juan Francisco Giró (1791–1863) 1 March 1852 25 September 1853 National 1852 4th Constitutional President, elected by the General Assembly. Ousted from office by a coup d'état. \\- Venancio Flores (1808–1868) 25 September 1853 12 March 1854 Colorado — Triumvirate. Fructuoso Rivera and Juan Antonio Lavalleja died in office. Fructuoso Rivera (1784–1854) 25 September 1853 13 January 1854 Colorado Juan Antonio Lavalleja (1784–1853) 25 September 1853 22 October 1853 — 5 Venancio Flores (1808–1868) 12 March 1854 10 September 1855 Colorado 1854 5th Constitutional President, elected by the General Assembly. Resigned. \\- Luis María Lamas (1793–1864) 29 August 1855 10 September 1855 Conservative — Self-proclaimed president after the . =6= Manuel Basilio Bustamante (1785–1863) 10 September 1855 15 February 1856 Colorado — President of the Senate exercising the Executive Power. =7= (1794–1869) 15 February 1856 1 March 1856 Colorado — President of the Senate exercising the Executive Power. 6 Gabriel Antonio Pereira (1794–1861) 1 March 1856 1 March 1860 Colorado 1856 6th Constitutional President, elected by the General Assembly. 7 Bernardo Prudencio Berro (1803–1868) 1 March 1860 1 March 1864 National 1860 7th Constitutional President, elected by the General Assembly. =8= Atanasio Cruz Aguirre (1801–1875) 1 March 1864 15 February 1865 National — President of the Senate exercising the Executive Power. Resigned after the Brazilian invasion. =9= Tomás Villalba (1805–1886) 15 February 1865 20 February 1865 National — President of the Senate exercising the Executive Power. Resigned after the Brazilian invasion. ·1· Venancio Flores (1808–1868) 20 February 1865 15 February 1868 Colorado — De facto president after the Brazilian invasion. Assumed power as Provisional Governor for 3 years. =10= Pedro Varela (1837–1906) 15 February 1868 1 March 1868 Colorado — President of the Senate exercising the Executive Power. 8 Lorenzo Batlle (1810–1887) 1 March 1868 1 March 1872 Colorado 1868 8th Constitutional President, elected by the General Assembly. =11= Tomás Gomensoro Albín (1810–1900) 1 March 1872 1 March 1873 Colorado — President of the Senate exercising the Executive Power. 9 José Eugenio Ellauri (1834–1894) 1 March 1873 22 January 1875 Colorado 1873 9th Constitutional President, elected by the General Assembly. Resigned. 10 Pedro Varela (1837–1906) 22 January 1875 10 March 1876 Colorado — 10th Constitutional President, appointed by the General Assembly after the resignation of Ellauri. Ousted by a coup d'état. ·2· Lorenzo Latorre (1844–1916) 10 March 1876 1 March 1879 Colorado — Assumed power as Provisional Governor. 11 1 March 1879 15 March 1880 1879 11th Constitutional President, elected by the General Assembly. Resigned. 12 Francisco Antonino Vidal (1825–1889) 15 March 1880 1 March 1882 Colorado — 12th Constitutional President, appointed as president by the General Assembly to finish the presidential period 1879–1883. Resigned. 13 Máximo Santos (1847–1889) 1 March 1882 1 March 1886 Colorado — 13th Constitutional President, appointed by the General Assembly for a term of 4 years. 14 Francisco Antonino Vidal (1825–1889) 1 March 1886 24 May 1886 Colorado 1886 14th Constitutional President, elected by the General Assembly. Resigned. =12= Máximo Santos (1847–1889) 24 May 1886 18 November 1886 Colorado — President of the Senate exercising the Executive Power. Resigned. 15 Máximo Tajes (1852–1912) 18 November 1886 1 March 1890 Colorado — 15th Constitutional President, appointed as president by the General Assembly to finish the presidential period 1886–1890. 16 Julio Herrera y Obes (1841–1912) 1 March 1890 1 March 1894 Colorado 1890 16th Constitutional President, elected by the General Assembly. =13= Duncan Stewart (1833–1923) 1 March 1894 21 March 1894 Colorado — President of the Senate exercising the Executive Power. 17 Juan Idiarte Borda (1844–1897) 21 March 1894 25 August 1897 Colorado 1894 17th Constitutional President, elected by the General Assembly. Assassinated. =14= Juan Lindolfo Cuestas (1837–1905) 25 August 1897 10 February 1898 Colorado — President of the Senate exercising the Executive Power. ·3· 10 February 1898 15 February 1899 De facto president following a self-coup. Resigned. =15= José Batlle y Ordóñez (1856–1929) 15 February 1899 1 March 1899 Colorado — President of the Senate exercising the Executive Power. 18 Juan Lindolfo Cuestas (1837–1905) 1 March 1899 1 March 1903 Colorado 1899 18th Constitutional President, elected by the General Assembly. 19 José Batlle y Ordóñez (1856–1929) 1 March 1903 1 March 1907 Colorado 1903 19th Constitutional President, elected by the General Assembly. 20 Claudio Williman (1861–1934) 1 March 1907 1 March 1911 Colorado 1907 20th Constitutional President, elected by the General Assembly. 21 José Batlle y Ordóñez (1856–1929) 1 March 1911 1 March 1915 Colorado 1911 21st Constitutional President, elected by the General Assembly. 22 Feliciano Viera (1872–1927) 1 March 1915 1 March 1919 Colorado 1915 22nd Constitutional President, elected by the General Assembly. === Oriental Republic of Uruguay (1919–present) === The Constitution of 1918 comes into force. According to the Constitution, the president is elected by direct popular election for a term of five years. He may be re-elected any number of times, but is ineligible for immediate re-election. No. Portrait Name (Birth–Death) Term of office Party Party Elected Notes Vice President 23 Baltasar Brum (1883–1933) 1 March 1919 1 March 1923 Colorado 1919 23rd Constitutional President, elected by the General Assembly. The President served as part of the executive alongside the National Council of Administration, headed by a President: *1 March 1919 – 1 March 1921: Feliciano Viera *1 March 1921 – 1 March 1923: José Batlle y Ordóñez rowspan=5 24 José Serrato (1868–1960) 1 March 1923 1 March 1927 Colorado 1922 24th Constitutional President, elected by the citizens. The President served as part of the executive alongside the National Council of Administration, headed by a President: *1 March 1923 – 1 March 1925: Julio María Sosa *1 March 1925 – 1 March 1927: Luis Alberto de Herrera 25 Juan Campisteguy (1859–1937) 1 March 1927 1 March 1931 Colorado 1926 25th Constitutional President, elected by the citizens. The President served as part of the executive alongside the National Council of Administration, headed by a President: *1 March 1927 – 16 February 1928: José Batlle y Ordóñez *6 February 1928 – 1 March 1929: Luis Caviglia *1 March 1929 – 1 March 1931: Baltasar Brum 26 Gabriel Terra (1873–1942) 1 March 1931 31 March 1933 Colorado 1930 26th Constitutional President, elected by the citizens. The President served as part of the executive alongside the National Council of Administration, headed by a President: *1 March 1931 – 1 March 1933: Juan Pedro Fabini *1 March 1933 – 31 March 1933: Antonio Rubio Pérez ·4· Gabriel Terra (1873–1942) 31 March 1933 18 May 1934 Colorado — De facto president following a self-coup. ·4· Gabriel Terra (1873–1942) 18 May 1934 19 June 1938 Colorado — Provisional president elected by the 3rd National Constituent Convention. Alfredo Navarro 27 Alfredo Baldomir (1884–1948) 19 June 1938 21 February 1942 Colorado 1938 27th Constitutional President, elected by the citizens. César Charlone – Alfredo Baldomir (1884–1948) 21 February 1942 1 March 1943 Colorado — De facto president following a self-coup. César Charlone 28 Juan José de Amézaga (1881–1956) 1 March 1943 1 March 1947 Colorado 1942 28th Constitutional President, elected by the citizens. Alberto Guani 29 Tomás Berreta (1875–1947) 1 March 1947 2 August 1947 Colorado 1946 29th Constitutional President, elected by the citizens. Died in office. Luis Batlle Berres 30 Luis Batlle Berres (1897–1964) 2 August 1947 1 March 1951 Colorado — 30th Constitutional President. Vice-president under Berreta, assumed the presidency after his death. Alfeo Brum 31 Andrés Martínez Trueba (1884–1959) 1 March 1951 1 March 1952 Colorado 1950 31st Constitutional President, elected by the citizens. The post of President was replaced by the National Council of Government. Alfeo Brum 1 National Council of Government 1952–1955 1 March 1952 1 March 1955 Colorado — The National Council of Government was headed by a President for the remaining of the 1951–1955 period: *1 March 1952 – 1 March 1955: Andrés Martínez Trueba rowspan=4 2 National Council of Government 1955–1959 1 March 1955 1 March 1959 Colorado 1954 The National Council of Government was headed by a President rotating every year: *1 March 1955 – 1 March 1956: Luis Batlle Berres *1 March 1956 – 1 March 1957: Alberto Fermín Zubiría *1 March 1957 – 1 March 1958: Arturo Lezama *1 March 1958 – 1 March 1959: Carlos Fischer 3 National Council of Government 1959–1963 1 March 1959 1 March 1963 National 1958 The National Council of Government was headed by a President rotating every year: *1 March 1959 – 1 March 1960: Martín Echegoyen *1 March 1960 – 1 March 1961: Benito Nardone *1 March 1961 – 1 March 1962: Eduardo Víctor Haedo *1 March 1962 – 1 March 1963: Faustino Harrison 4 National Council of Government 1963–67 1 March 1963 1 March 1967 National 1962 The National Council of Government was headed by a President rotating every year: *1 March 1963 – 1 March 1964: Daniel Fernández Crespo *1 March 1964 – 7 February 1965: Luis Giannattasio *7 February 1965 – 1 March 1966: Washington Beltrán *1 March 1966 – 1 March 1967: Alberto Héber Usher 32 Óscar Diego Gestido (1901–1967) 1 March 1967 6 December 1967 Colorado 1966 32nd Constitutional President, elected by the citizens. Died in office. Jorge Pacheco Areco 33 Jorge Pacheco Areco (1920–1998) 6 December 1967 1 March 1972 Colorado — 33rd Constitutional President. Vice-president under Gestido, assumed the presidency after his death. Alberto Abdala 34 Juan María Bordaberry (1928–2011) 1 March 1972 27 June 1973 Colorado 1971 34th Constitutional President, elected by the citizens. Jorge Sapelli ·5· Juan María Bordaberry (1928–2011) 27 June 1973 12 June 1976 Colorado — 1973 Uruguayan coup d'état, start of the dictatorship between 1973 and 1985. Ousted from office. rowspan=5 ·6· Alberto Demicheli (1896–1980) 12 June 1976 1 September 1976 Colorado — Appointed by the Armed Forces. Ousted from office. ·7· Aparicio Méndez (1904–1988) 1 September 1976 1 September 1981 National — Appointed by the Armed Forces for a term of 5 years. ·8· Gregorio Álvarez (1925–2016) 1 September 1981 12 February 1985 Military — Appointed by the Armed Forces. Resigned. :1: Rafael Addiego (1923–2014) 12 February 1985 1 March 1985 Civic Union — President of the Supreme Court, appointed by the Armed Forces. 35 Julio María Sanguinetti (born 1936) 1 March 1985 1 March 1990 Colorado 1984 35th Constitutional President, elected by the citizens. First democratic President after the 1973-1985 dictatorship. Enrique Tarigo 36 Luis Alberto Lacalle (born 1941) 1 March 1990 1 March 1995 National 1989 36th Constitutional President, elected by the citizens. Gonzalo Aguirre Ramírez 37 Julio María Sanguinetti (born 1936) 1 March 1995 1 March 2000 Colorado 1994 37th Constitutional President, elected by the citizens. Hugo Batalla 37 Julio María Sanguinetti (born 1936) 1 March 1995 1 March 2000 Colorado 1994 37th Constitutional President, elected by the citizens. Hugo Fernández Faingold 38 Jorge Batlle (1927–2016) 1 March 2000 1 March 2005 Colorado 1999 38th Constitutional President, elected by the citizens. Luis Antonio Hierro López 39 Tabaré Vázquez (1940–2020) 1 March 2005 1 March 2010 Broad Front 2004 39th Constitutional President, elected by the citizens. Rodolfo Nin Novoa 40 José Mujica (1935–2025) 1 March 2010 1 March 2015 Broad Front 2009 40th Constitutional President, elected by the citizens. Danilo Astori 41 Tabaré Vázquez (1940–2020) 1 March 2015 1 March 2020 Broad Front 2014 41st Constitutional President, elected by the citizens. Raúl Sendic Rodríguez 41 Tabaré Vázquez (1940–2020) 1 March 2015 1 March 2020 Broad Front 2014 41st Constitutional President, elected by the citizens. Lucía Topolansky 42 Luis Lacalle Pou (born 1973) 1 March 2020 1 March 2025 National 2019 42nd Constitutional President, elected by the citizens. Beatriz Argimón 43 Yamandú Orsi (born 1967) 1 March 2025 Incumbent Broad Front 2024 43rd Constitutional President, elected by the citizens. Carolina Cosse == References == * Uruguay",
 "title": "List of presidents of Uruguay"
}