{
 "id": "1150257",
 "text": "== Background == The battle occurred during the First Iraqi–Kurdish War, as Kurdish forces sought to seize strategic highlands in the Rawandiz area. In mid-1965, the Iraqi army intensified operations against Kurdish strongholds in Zozk, Handren, and the Diyana Plain. In response, Kurdish leadership planned an ambitious offensive to take Mount Korek and Gali Ali Beg valley. == Preparations == Kurdish forces, under the direction of Mustafa Barzani, planned coordinated artillery strikes and ground attacks on six Iraqi military bases. Commanders like Mullah Amin and Fakir Mergasuri played central roles in mobilizing the Akoyan, Communist, Betwata, and Balakayety battalions. The shelling began at 5:30 PM on August 6, targeting bases in Rawandiz, Khalifan, Diyana, and others. == Battle == The main assault began at 9:00 PM. Early successes included the capture of two outposts. However, the strategically critical Kapka Qalawi outpost on Mount Korek resisted all attacks under Major Qahtan’s leadership. Although Iraqi forces suffered at least 40 casualties, they held Gali Ali Beg. On the Maltokri front, Peshmerga forces took control after Iraqi soldiers retreated. In Diyana, fierce resistance from jash militias resulted in Kurdish casualties. A mortar strike on Mount Korek killed 27 Kurdish fighters during rest. == Aftermath == Despite inflicting damage and capturing some positions, Kurdish forces failed to achieve their main goals. Barzani ordered a shift to defensive tactics. The Iraqi government responded with heavy shelling and air raids, killing civilians near Haji Omeran. == Legacy == The battle is remembered for its complex coordination and the sacrifices of Kurdish fighters. Though it did not yield strategic victories, it showcased Kurdish resistance and the leadership of Mustafa Barzani. == References == * Barzani, Massoud. Barzani and the Kurdish Liberation Movement. * Partipedia - The Battle of Rawandiz (1965)",
 "title": "Battle of Rawandiz"
}