{
 "id": "1150839",
 "text": "Marguerite Patouillet (13 June 1899 — 8 May 1950) was a French track and field athlete. She was specialized in the high jump and long jump but also competed in the 80 meters. She was active during the 1920s, during the early era of women's athletics. She had multiple international victories. Next to that she was four times national champion and national record holder in the high jump. ==Biography== ===Career=== Patouillet represented France at international competitions between 1923 and 1926. After competing at the 1923 France–Great Britain women's athletics match (4th in high jump) and at the 1924 France–Belgium women's athletics match (4th in long jump) she won the high jump at the 1924 France–Czechoslovakia women's athletics competition and finished at this meeting second in the long jump event behind Czech Marie Mejzlíková II. She won the high jump event at the 1925 Belgium–France women's athletics match in a new national record of 1.50 meter, ahead of Belgian Elise van Truyen. At the 1926 France–Belgium women's athletics competition she won the high jump event ahead of Van Truyen. In 1926 she competed in the 80 metres and high jump at the 1926 Brussels Femina Club international women's athletics meeting and in high jump at the 1926 Paris international women's athletics meeting. At the 1924 National Athletics Championships she became national champion in the high jump and long jump. The next year at the 1925 championships she won again the national title in high jump and became also national champion in the standing long jump. She improved three times the French national record in the high jump. The first time was on 14 July 1924 with a height of 1.45 meters. The next year she improved it to 1.47 meters on 7 June 1925 and later to 1.50 meter on 2 August 1925. Her record was broken in August 1926. ===Personal life=== Patrouillet was born in the 14th arrondissement of Paris on 13 June 1899. Her father Edmond Louis Patouillet was a butcher and her mother Camille Rosa Louet a giletière.Civil status Act. number 4568 of the of the city of Paris, 14th arrondissement; birth in the year 1899 She didn’t marry. She died at home in the 17th arrondissement on on 8 May 1950 at the age of 50 years old.Civil status Act. number 940 of the of the city of Paris, 17th arrondissement; died in the year 1950 ==References== Category:1899 births Category:French athletes Category:High jumpers Category:Long jumpers Category:French sprinters Category:1950 deaths Category:Sportspeople from Paris",
 "title": "Marguerite Patouillet"
}