{
 "id": "1150689",
 "text": "Boana platanera is a tree frog in the family Hylidae. In English, people call it the banana tree dwelling frog. It lives in Venezuela, Colombia, Panama, and Trinidad and Tobago. Scientists wrote the first paper about Boana platanera in 2021. Before that, scientists thought this was the same frog as Boana crepitans or Boana xerophylla. == Name == In Spanish, people call Boana platanera rana platanera. People also call Boana pugnax rana platanera. The name platanera comes from this Spanish name. It means \"from the plantain.\" This name is for the banana trees where people see the frogs during the day. A plantain is a fruit like a banana. == Taxonomy == Boana platanera is closely related to Boana xerophylla. Until 2021, scientists thought they were the same species. Both frogs live in Venezuela, but Boana platanera lives north of the Orinoco river and Boana xerophylla lives south of it. Before 2017, scientists thought both Boana platanera and Boana xerophylla were both the same frog as Boana crepitans,a different frog that lives in Brazil. == Body == The frog can change its color. It is awake at night. During the day, it has a light cream- white color. At night, it has a different color. These colors are between yellow and tan and light brown. At night, the frog has brown marks, which can be irregular or in the shape of an X. Male and female Boana platanera frogs look different from each other. Females are larger than males. Females are long from nose to rear end, and males are long. The ribbit of Boana platanera is complex and has about five notes. The call lasts 200−451 milliseconds. File:Boana_platanera_153385855.jpg|Day coloration File:Hypsiboas_crepitans01b.jpeg|Night coloration == Home == Boana plantanera lives in parts of Venezuela, Colombia, Panama, and Trinidad and Tobago. In Venezuela, it is common, but it only lives north of the Orinocco River. Boana plantanera lives at many different distances above sea level. It has been recorded from sea level to altitudes of . Boana platanera can also live in many different kinds of places, including places that humans have changed a lot. Many of the places the frog lives are protected parks. ==Danger== Scientists say this frog is not in danger of dying out because it lives in a large place, because the frog is good at living in many different kinds of places, and because there are many of these frogs alive now. It is in some danger because people change the places where it lives. For example, people cut down forests to make places for cows to eat grass, to make farms, to get oil out of the ground, to dig for coal and nickel, and to make towns. Bad chemicals can also hurt this frog. These frogs can get sick from the fungus Batrachochytrium dendrobatidis, which causes the disease chytridiomycosis. But one scientist founds that the frogs can also get better, even when the temperature is perfect for making the fungus grow. == References == Category:Frogs of South America Category:IUCN Red List least concern species Category:Poison dart frogs",
 "title": "Boana platanera"
}