{
 "id": "1151473",
 "text": "The history of American football can be traced back to early versions of rugby. Both sports have their origins in varieties of football played in England in the mid-19th century. American football is the result of successive divergences from rugby, most notably the rule changes made by Walter Camp, considered the \"Father of American Football\". Among the main changes are the introduction of the line of scrimmage and down rules. In the late 19th and early 20th centuries, the evolution of the game by college coaches such as Eddie Cochems, Amos Alonzo Stagg, Knute Rockne, and Glenn \"Pop\" Warner helped take advantage of the newly introduced \" forward pass \". The popularity of college soccer grew and it became the dominant version of the sport in the United States in the first half of the 20th century. The origins of professional American football date back to 1892, with the $500 contract signed by William \"Ponch\" Heffelfinger to play a game for the Allegheny Athletic Association against the Pittsburgh Athletic Club. In 1920, the American Professional Football Association was formed. This championship changed its name to the National Football League (NFL) two years later, and ended up becoming the main American football league in the world. A rival league to the NFL, the National Football League (NFL), began in 1960, but the pressure it put on the senior league led to a merger between the two leagues and the creation of the Super Bowl, which has become the most watched annual television event in the United States. == First games == Although there are references claiming that Native Americans were already playing a ball game, modern American football has its origins in Europe. Traditional recreational activities in villages and schools on the old continent were already practised many centuries before America was colonised by Europeans. The first games resembled the traditional ‘mob football’, a variety of football played in medieval England, especially on Shrove Tuesday. The matches remained largely unorganised until the 19th century, when intramural football games began to take place on university campuses. Each institution developed its own variety of football. Princeton students played a sport called ‘ballown’ in 1820. A Harvard tradition known as ‘Bloody Monday’ began in 1827, consisting of a collective ball game between the freshmen and sophomore classes. Dartmouth had its own version, called ‘Old division football’, whose rules were first published in 1871, although the game dates back to the 1830s. All these games, and others, shared some similarities. They remained largely ‘crowd’ style games, with a large number of players trying to advance the ball into a goal area, often by any means necessary. == Other sources == * * * * * * * * * * * * * * * * == Bibliography == * * * * * * == Other websites == * Football Almanac * Professional Football Researchers Association * National Football Foundation * College Football Hall of Fame * Pro Football Hall of Fame Category:American football",
 "title": "History of American Football"
}