{
 "id": "1151385",
 "text": "The history of New Spain spans three centuries, beginning with the Spanish conquest of the Aztec Empire in 1521 and ending with the Mexican War of Independence in 1821. This period marks a significant transformation, as Indigenous societies came under Spanish rule, blending cultures, expanding territories, and eventually moving toward independence. In 1521, Hernán Cortés led the Spanish forces to victory over the Aztec Empire, marking the beginning of Spanish rule. With this victory, Spain established institutions like the Council of the Indies and the Audiencia to govern the vast new colony. One of the early goals of Spanish control was the forced conversion of Indigenous populations to Catholicism, which profoundly reshaped cultural and religious practices in the region. Over time, Indigenous traditions and Spanish culture began to merge, creating a unique colonial identity. During the 16th and 17th centuries, New Spain became an essential part of the Spanish Empire. Spanish settlers founded major cities, such as Mexico City, which was built on the ruins of the Aztec capital of Tenochtitlan. Other cities like Puebla and Guadalajara flourished, serving as hubs of administration and trade. The discovery of silver in areas like Zacatecas and Guanajuato boosted the economy, turning the region into a global supplier of precious metals. However, the economic boom also led to conflicts, such as the Chichimeca War, where Indigenous groups resisted Spanish expansion and exploitation. As Spain extended its reach into northern territories, it established missions and presidios to secure its control. These outposts served as centers for converting Indigenous peoples and consolidating Spanish influence in what is now the Southwestern United States. The 18th century brought significant changes with the Bourbon Reforms, introduced by the Spanish crown to modernize and strengthen the colonial administration. These reforms included the creation of intendancies, increased military presence, and greater centralization of power. The expulsion of the Jesuits, who had been influential in education and mission work, was also part of these efforts. The crown encouraged economic societies and other initiatives to improve efficiency and revenue. However, growing dissatisfaction with Spanish rule set the stage for the colony’s eventual decline. By the early 19th century, resentment over economic exploitation, social inequalities, and political control sparked the Mexican War of Independence. The revolution began in 1810, when Miguel Hidalgo y Costilla issued the Cry of Dolores, rallying Mexicans to fight for freedom. Over the next eleven years, insurgent forces clashed with royalist armies. In 1821, an alliance between Agustín de Iturbide, a royalist officer, and Vicente Guerrero, a revolutionary leader, led to the successful campaign for independence. With the signing of the Treaty of Córdoba, Spanish rule ended, and New Spain became the independent nation of Mexico, bringing three centuries of colonial dominance to a close. This period left a lasting legacy, shaping the cultural, political, and social foundations of modern Mexico. == Sources == * * * * * Category:New Spain Category:History of New Spain Category:Colonial Mexico",
 "title": "History of New Spain"
}