{
 "id": "1151316",
 "text": "In 1760, the peace of Peshwa government was broken by a rising of Kolis under their Naik Javji Bamble. Javji with drew to the hills and organised a series of gang robberies, causing widespread terror and misery throughout the country. For twenty years he held out bravely, defeating and killing the generals the Peshwa's Government sent against him. At last he was so hotly pursued that, on the advice of Dhondo Gopal, the Peshwa's governor at Nasik, he surrendered all his forts to Tukoji Holkar and, through Holkar's influence, was pardoned and placed in military and police charge of a district of sixty villages with powers of life and death outlaws. In 1798, a fresh disturbance took place among the Kolis. The leader of this outbreak was Ramji Naik Bhangria, who was an abler and more daring man than his prede cessors, and succeeded in baffling all the efforts of the Government officers to seize him. As force seemed hopeless, the Government offered Ramji a pardon and gave him an important police post. In 1763, the Peshwa Raghunathrao had appointed Abha Purandare who was an anti koli as Sarnaik, due to which the Chivhe Kolis revolted against the Peshwa and captured Purandar and Sinhagad forts because the Kolis did not like Abha Purandare, so Abha removed the Kolis from the fortification and posted new Kiledars, due to which the Kolis attacked and captured the forts on 7 May 1764. Five days later, Rudramal fort was also captured and presented a challenge to the Prime Minister of the Maratha Empire, Peshwa Raghunathrao. A few days later the Peshwa came to the fort to worship the deity inside the Purandar fort but the Peshwa got caught up by the Kolis. The Kolis looted all the belongings and weapons of the Peshwa and took him prisoner but released after some time. After this the Kolis started collecting revenue from the surrounding area. After this, the chief of the Kolis, Kondaji Chivhe, sent a letter to the Peshwa, in which it was written 'What now sir, what is the condition, how is the government doing, be in fun'. After reading this letter, the Peshwa felt a bit humiliated and in a fit of rage ordered the Maratha army to attack but the army could not do anything because the Kolis himselves were Subedar and had fortified the forts well and the Peshwa faced failure. the humiliated Peshwa started taking the Kolis of Chivhe clan as captive. All those Chivhe kolis who were living in the territory of Peshwa were declared as rebels and started making captives. After this the Chivhe Kolis sent a letter to Madhavrao and explained whole matter, after this the Kolis handed over the forts to Madhavrao and the Chivahe Kolis were again handed over the fortifications. In the year 1776, a large number of the Shelkande Kolis of Otur village, raised against Peshwa because of their hereditary land rights and as the Peshwa refused to do them. Kolis assembled a revolutionary army of Shelkande and Kokate Kolis and commenced plundering the surrounding villages and doing other violent activities in the hope of obtaining redress. In response, The Peshwa sent Maratha troops from Pune against rebel kolis and surprised them, killed and wounded many of them. The Koli leaders were consequently forced to disperse the rebels. The government officers learned that Sattu Shelkande, chief of the insurgents, was hiding in the neighboring jungle. The better to ensure this, they obliged him to enter into the Sunkli zamin or chain security (one Patil going security for two or three cultivators, another Patil for five or six poorer Patils, and a Deshmukh for a number of the Patils). Hearing of the measures the government officers were adopting, moved off to another place; this was partly for their own safety, and partly to save their friends from being harassed and punished for not fulfilling their promise of apprehending them. After the troops retired from the jungles, the Kolis recommenced their operations. Several seasons were passed in this way; however when Javji Bamble was appointed as Mansabdar of Rajur he was ordered by Peshwa to prevent the rebellious activities by rebels. Kolis did not wish to fight with Bumble because he was also a Koli by caste. Kolis remained quiet for of four years but Kolis went again to the jungles because his hereditary rights have not been fulfilled. The troops employed against the Shelkande Kolis and again forced them to disperse and the chiefs went to Aurangabad. Kolis had taken an oath that they would cut off the head of Patil of Otur, unless Peshwa afforded them redress. Nana Phadnavis who was minister in Maratha Empire declared that he would not pardon the Kolis again, as they were such a turbulent race and as no faith could be reposed in them. Nana Fadnavis detached few Brahmins disguised as Gusai, who gained information of the hiding place of Kolis and a detachment that marched to apprehend them was so fortunate as to bring them all prisoners to Junnar, where the five Kolis were executed. Balwantrao, brother-in-law to Nana Fadnavis, was subedar of the district at the time, and it is asserted Balwantrao became very unhappy after the execution of these kolis. Therefore, in the hope of reestablishing the happiness that he had enjoyed, he erected a temple near river in Junnar, in which was placed as the object of worship a Punah Lingh, or five stones representing the five Kolis who were executed. == References == Category:Koli people",
 "title": "Koli rebellion against Maratha empire"
}