{
 "id": "1151588",
 "text": "Park Bing-ae (Royal Noble Consort Gyeong), who had been a lady-in-waiting to Prince Sado's grandmother, so his relations with her were considered to breach the incest taboo. When Yeongjo found out, he berated his son and Sado eventually jumped down a well to attempt drowning himself, but a guard pulled him out. Lady Hyegyŏng had, by this point, managed to have Bing-ae hidden in the home of Sado's sister, Princess Hwawan. In 1761 Sado beat and stabbed secondary consort Bing-ae, who had birthed several of his children, in a fit of rage while getting dressed. He left her on the floor, where she died of her injuries. Lady Hyegyŏng prepared her body for the funeral rites, but, on his return, Sado reportedly said nothing about Bing-ae's death. Although King Yeongjo was displeased with his daughter-in-law, who was a lowly court lady, he seems to have viewed Bing-ae's character well. Everyone kept quiet about Crown Prince Sado's murder of Bing-ae, so King Yeongjo did not know about it. However, later, through Na Gyeong-eon's complaint, Yeongjo also learned that Crown Prince Sado murdered Bing-ae. \"You fell in love with the mother of the royal family so much at first that you almost fell into a well. Why did you finally kill her? That person was very upright. would have suffered\" \\- King Yeongjo Crown Prince Sado was not relieved by beating Bing-ae to death, he threw Bing-ae's son , Eun-jeon, who was just over one year old at the time, into the pond. Fortunately, the guards of his step-grandmother, Queen Jeongsun, saved him and he drowned. I was able to escape and barely survive. ==CHILDREN== # Princess Cheonggeun (청근옹주; 1758–1835), third daughter # Yi Chan, Prince Eunjeon (은전군 이찬; 14 August 1759 – 26 August 1778), fifth son After her death, her children are presumed to have been raised by her concubines, but their lives were as unfortunate as their mother's. Prince Eunjeon was caught up in a treasonous plot and was executed by his half- brother King Jeongjo at the age of 20. Princess Cheonggeun lived the longest among Crown Prince Sado's children, but was unable to have any children and had to adopt. == References == Category:Royalty",
 "title": "Lady Park Bing-ae"
}