{
 "id": "1151381",
 "text": "The Spanish conquest of Guatemala was part of the larger conquest of the Americas. Before the Spanish arrived, Guatemala was home to many powerful Maya city-states, like K'iche', Kaqchikel, and Mam. These groups had rich cultures, but they were often at war with each other. This made it easier for the Spanish to take control. The Spanish arrived in Central America in the early 16th century. They wanted land, gold, and to spread Christianity. Many Spanish soldiers, called conquistadores, used alliances with rival Maya groups to help defeat their enemies. == Arrival of Pedro de Alvarado == Pedro de Alvarado was one of Hernán Cortés' top captains. He was sent to conquer the Maya lands after the conquest of Mexico. Alvarado arrived in Guatemala in 1524 with a small army of Spanish soldiers and many indigenous allies from Mexico. His forces included horses, firearms, and steel weapons, which were new and terrifying to the Maya. == The Conquest of K'iche' and Kaqchikel == Alvarado first targeted the K'iche', one of the strongest Maya groups. He fought and defeated them in the Battle of Quetzaltenango. The K'iche' king, Tecún Umán, was killed in this battle, and he later became a Maya hero and symbol of resistance. After defeating the K'iche', Alvarado moved against the Kaqchikel. At first, they made an alliance with the Spanish to fight other Maya groups. However, when the Kaqchikel realized the Spanish were taking over their land, they rebelled. The rebellion was crushed, and their city, Iximche, was taken over by the Spanish. == Resistance and Challenges == Not all Maya groups gave up easily. The Mam and other Maya people in the mountains fought back fiercely. They used ambush tactics and knew the terrain well. However, Spanish weapons and diseases like smallpox weakened them. Over time, the Spanish built forts and towns to control the region. == Final Conquests == The last independent Maya kingdom, in the Petén region, remained unconquered for over a century. The Spanish finally defeated the Itza Maya in 1697, marking the end of organized Maya resistance in Guatemala. This was one of the longest-lasting conquests in the Americas. == Aftermath == The Spanish established colonial rule over Guatemala. They forced the Maya to work on farms, in mines, and to adopt Christianity. Many Maya traditions survived but were blended with Spanish influences. The conquest led to the decline of the Maya civilization but also shaped the culture of modern Guatemala. Category:History of Mesoamerica Category:16th-century conflicts Category:17th-century conflicts Category:Wars involving Spain",
 "title": "Spanish conquest of Guatemala"
}