{
 "id": "1151667",
 "text": "The Sunderland Talmudical College (Hebrew: ישיבת שארית הפליטה נצח ישראל), commonly known as Sunderland Yeshiva, is a yeshiva located in Gateshead, United Kingdom. As of 2024, there are about 80 students, mainly from England, but also from Switzerland, Belgium, and the USA. == History == The yeshiva was started in Sunderland in October 1946 by Rabbi Aryeh Leib Grossnass and Rabbi Zushe Waltner, with the help of Rabbi Eliyahu Eliezer Dessler. It began at 2 Kensington Esplanade and had around 30 students who came from displaced persons camps. In the 1950s, the yeshiva welcomed students from Morocco and later from other North African countries. In November 1952, the yeshiva moved to 1 The Cedars Road in Sunderland and then relocated to Gateshead in June 1988, but it kept its original name. In 2021, the yeshiva expanded its building to add a new dining room, shiur rooms, and dormitories. Today, it has about 100 students, with 60 in the yeshiva and 40 in the Kibbutz. == Staff == The first head of the yeshiva was Rabbi Zushe Waltner, who was followed by Rabbi Shammai Zahn in 1952. Rabbi Zechariah Gelley joined him in 1965 and stayed until 1987. After Rabbi Zahn passed away in 2003, Rabbi Yankel Ehrentreu became the current head of the yeshiva. His brother, Rabbi Avrohom Ehrentreu, leads the Kibbutz. The teaching staff includes several members from the Ehrentreu and Zahn families, such as: * Rabbi Avrohom Chaim Zahn, morning Maggid Shiur of Shiur Alef * Rabbi Shlomo Klyne, afternoon Maggid Shiur of Shiur Alef * Rabbi Shmuel Wolf, morning Maggid Shiur of Shiur Beis * Rabbi Yankel Rubenstein, afternoon Maggid Shiur of Shiur Beis * Rabbi Dovid Zahn, morning Maggid Shiur of Shiur Gimmel * Rabbi Chaim Roberts, Rosh Chabura of Shiur Gimmel There are also a few question-and-answer teachers like Rabbi Yaki Cohen, Rabbi Chaim Goldkin, and Rabbi Yisroel Meir Hirsch. The mashgiach position is currently empty due to Rabbi Moshe Salomon's illness. == The Kibbutz == The Kibbutz, which is a group of top students from other yeshivas, was established in 1996 by Rabbi Yechezkel Ehrentreu. Rabbi Avrohom Ehrentreu leads the Kibbutz and is also one of the chief rabbis of Gateshead. The mashgiach of the Kibbutz is Rabbi Ephraim Shmuel Zahn. The Kibbutz students have a separate dormitory and study together with the younger students. In September 2023, Rabbi Yechezkel Ehrentreu was promoted to a leadership position in the Kibbutz, after being a teacher in the yeshiva. == Notable alumni == One of the known graduates is Rabbi Pesach Eliyahu Falk, who is a respected teacher, lecturer, and author. == References == Category:Schools in England Category:Gateshead",
 "title": "Sunderland Talmudical College"
}