{
 "id": "1151460",
 "text": "The BYD Seal (Chinese: 比亚迪海豹; pinyin: Bǐyàdí Hǎibào) is a battery-electric mid-size fastback Sedan manufactured by BYD Auto. It is part of the brand's \"Ocean Series\" and follows the BYD Dolphin hatchback. Built on the e-Platform 3.0, the Seal features an 800-volt electrical system platform and offers various electric powertrains and battery configurations. It was first announced in May 2022 and launched in China in August 2022. == History == The BYD Seal was officially revealed as part of BYD's continued expansion into the electric vehicle market. Its design was previewed by the BYD Ocean-X Concept in 2021, and the car debuted in China in August 2022. The Seal is sold in multiple international markets, including Europe, Southeast Asia, and Brazil, with various configurations and trims offered depending on the region. == Features == The Seal is available in multiple trims and battery sizes, with configurations including rear-wheel-drive (RWD) and all-wheel-drive (AWD) versions. It is powered by either a 61.4 kWh or an 82.5 kWh LFP Blade battery, offering ranges between 460 and 570 kilometers (286–354 miles) on a full charge, depending on the model and driving conditions. The Seal’s powertrain includes a 150–390 kW motor, offering performance options such as the Performance AWD variant, which reaches 0–100 km/h in 3.8 seconds. == Markets == ===China=== The Seal went on sale in China in August 2022 and was initially offered with multiple variants, including standard and performance models. ===Europe=== The Seal became available in several European countries starting in September 2023, targeting the D-segment. ===Southeast Asia=== Markets such as Thailand and Singapore began selling the Seal in September 2023, with further expansion into Indonesia, Malaysia, Vietnam, and the Philippines in 2024. ===Brazil=== The Seal was launched in Brazil in August 2023, with the dual-motor AWD version being the only variant available. ===Australia=== The Seal launched in Australia in October 2023, with trims matching those of Thailand and Singapore. ===South Africa=== The Seal debuted in South Africa in October 2024, offering both RWD and AWD variants. == Sales == Year Sales Total production China Australia Thailand Brazil Indonesia Malaysia 2022 51,200 51,200 2023 62,079 471 1,810 1,040 84,277 2024 17,528 6,393 5,156 3,524 4,828 2,958 60,607 == References == Seal Category:2020s automobiles Category:Sedans Category:Chinese automobiles",
 "title": "BYD Seal"
}