{
 "id": "1151166",
 "text": "Ice Age 6: The Extinction Event is an upcoming American animated adventure comedy film produced by 20th Century Animation and distributed by 20th Century Studios. It will serve as a sequel to Ice Age: Collision Course (2016), the seventh overall installment in the Ice Age film series. Ray Romano, John Leguizamo, Denis Leary, Simon Pegg, and Queen Latifah will reprise their roles from the previous films. It will be the first theatrical Ice Age film not to be produced by Blue Sky Studios, following its closure on April 10, 2021. Ice Age 7: The Extinction Event is scheduled to be released in the United States on December 18, 2026. == Cast == * Ray Romano as Manny, a woolly mammoth and the leader of the Herd. * John Leguizamo as Sid, a ground sloth and the founder of the Herd. * Denis Leary as Diego, a saber-toothed cat and the co- leader of the Herd. * Queen Latifah as Ellie, a female woolly mammoth and Manny's wife. * Simon Pegg as Buck, a one-eyed weasel and a dinosaur hunter. == Production == On the possibility of a potential sequel to Ice Age 5: Collision Course in June 2016, co-director Galen T. Chu said that there were some ideas for the sixth, seventh installment of the Ice Age series. In July 2016, Bustle noted that the potential of Ice Age 7: The Extinction Event being produced was relatively high even though it could mostly depend on the box office performance of the fifth film. In February 2017, PopWrapped commented on the subject of a sequel, pointing out the fifth film's poor reception and how the sequels \"do not quite connect on an emotional level like the original\", suggesting that the sixth film should return to its roots by reintroducing the humans from the first film. In February 2022, producer Lori Forte discussed the possibility of a sequel while promoting Ice Age 6: Adventures Of Buck Wild: The Ice Age 6: Adventures of Buck Wild, saying, \"I think it's a little premature. We hope that people will respond to this, and that will promote us to be able to do another movie. If the audiences want it, we've got plenty of ideas. There's no end to ideas and adventures and characters, so we're ready if they're ready.\" In September 2024, John Leguizamo, the voice of Sid in the Ice Age films, revealed that the sixth film was in development. By November 2024, during D23 in Brazil, the film was officially announced to be in production with Ray Romano, Leguizamo, Denis Leary, Simon Pegg, and Queen Latifah reprising their roles from the previous films. === Music === Batu Sener confirmed on his X account that he will compose the film's score, after having previously scored The Ice Age Adventures of Buck Wild and Ice Age: Scrat Tales.[better source needed] == Release == Ice Age 7: The Extinction Event is scheduled to be released in the United States on December 18, 2026 Category:Upcoming movies Category:2020s sequel movies Category:English-language movies",
 "title": "Ice Age 6"
}