{
 "id": "1151957",
 "text": "The Conservative Revolution (German: Konservative Revolution), also called the German neoconservative movement; . or new nationalism,; . was a political movement in Germany and Austria from 1918 to 1933, between World War I and the rise of the Nazis. It was a national-conservative and ultraconservative movement that opposed modern ideas and wanted a different future for Germany. The people in this movement, called conservative revolutionaries, rejected traditional Christian conservatism, democracy, and equality. They felt lost in the modern world and looked to older ideas from the 19th century. These included Friedrich Nietzsche’s dislike of Christian values and democracy, the anti-modern ideas of German Romanticism, the nationalist beliefs of the Völkisch movement, and the strong military traditions of Prussia. Many were also influenced by their experiences of war and comradeship during World War I. The Conservative Revolution had a complicated connection with Nazism. Some historians see it as a form of early fascism, though it was not exactly the same as Nazism. Unlike the Nazis, it did not always focus on race, but it shared anti-democratic ideas that helped prepare German society for Nazi rule. When Hitler took power in 1933, the movement lost its influence. One of its key thinkers, Edgar Jung, was killed by the Nazis in 1934. Some members later opposed parts of Nazi rule, except for figures like Carl Schmitt. Since the 1960s and 1970s, the Conservative Revolution has influenced right-wing political movements in Europe, especially in France and Germany. It has also helped shape the modern European Identitarian movement. == Name and meaning == Although conservative writers from the Weimar Republic, like Arthur Moeller van den Bruck, Hugo von Hofmannsthal, and Edgar Jung, called their political movement the \"Conservative Revolution,\" the term became popular again after Armin Mohler's doctoral thesis in 1949. Mohler's post-war ideas about the \"Conservative Revolution\" have faced a lot of criticism, but many scholars now accept the concept of a \"neo-conservative\" or \"new nationalist\" movement that was active during the Weimar years (1918–1933).; . This period sometimes includes the 1890s to 1910s and is seen as different from the 19th-century \"old nationalism.\" Some modern historians find the term \"Conservative Revolution\" confusing and suggest using \"neo-conservative\" instead. Sociologist Stefan Breuer suggested the term \"new nationalism\" to describe a dynamic and inclusive cultural movement that was distinct from the previous century's nationalism, which mainly aimed to maintain German institutions and their global influence.; . Despite seeming contradictions, Moeller van den Bruck's writings justify the connection between \"Conservative\" and \"Revolution\" by defining the movement as a desire to keep enduring values while also adapting ideals and institutions to address the challenges of modern life. Historian Louis Dupeux, who studies the Conservative Revolution, viewed the movement as a thoughtful effort with its own clear logic. This effort aimed for 'intellectual power,' using modern techniques and ideas to promote conservative and revolutionary beliefs against liberalism, equality, and traditional conservatism. This shift in view, compared to 19th-century conservatism, is called 'affirmation' by Dupeux: Conservative Revolutionaries embraced their time as long as they could revive what they saw as 'eternal values' in modern society. Dupeux acknowledged that the Conservative Revolution was more of a counter-culture than a real philosophical idea, relying on 'feelings, images, and myths' rather than scientific reasoning. He also recognized the need to identify different views within its various beliefs.; . :Conservative Revolutionaries are, indeed, as politically reactive as their predecessors, but they display optimism—or at least a strong will—towards the modern world. They no longer fear the masses or technology. This change in attitude has led to significant effects—replacing past regrets with youthful energy—and has sparked broad political and cultural actions.— Louis Dupeux, 1994 Political scientist Tamir Bar-On describes the Conservative Revolution as a mix of extreme German nationalism, support for close-knit communities, modern technology, and a changed version of socialism. It saw workers and soldiers as examples for a new authoritarian state, moving beyond the perceived decline caused by liberalism, socialism, and traditional conservatism. == Origin and development == The Conservative Revolution is part of a bigger movement against the French Revolution of 1789, shaped by early 19th-century Romanticism's dislike for modern ideas and reason. This is seen especially in Germany and Prussia, where there was a strong military, authoritarian nationalism that opposed liberalism, socialism, democracy, and international cooperation. Historian Fritz Stern described these people as confused thinkers caught in deep 'cultural despair'; they felt lost in a world controlled by what they considered 'middle-class reasoning and science'. Stern notes that their anger at modernity led them to mistakenly believe that all these modern problems could be solved by a 'Conservative Revolution'. Terms like Konservative Kraft ('conservative power') and schöpferische Restauration ('creative restoration') became common in German-speaking Europe from the 1900s to the 1920s. The Konservative Revolution ('Conservative Revolution') became a recognized idea in the Weimar Republic (1918–1933) thanks to writers like Arthur Moeller van den Bruck, Hugo von Hofmannsthal, Hermann Rauschning, Edgar Jung, and Oswald Spengler. Alfred Hugenberg started the Alldeutscher Verband (\"Pan-German League\") in 1891 and the Jugendbewegung (\"youth movement\") in 1896. These helped the rise of the Conservative Revolution in the years that followed. Moeller van den Bruck was the main leader of this movement until he took his own life on May 30, 1925.; . His ideas were first shared through the Juniklub he created on June 28, 1919, the day the Treaty of Versailles was signed. Conservative Revolutionaries often called German philosopher Friedrich Nietzsche their mentor and saw him as the main thinker behind their movement.; ; see for instance: Oswald Spengler, \"Nietzsche und sein Jahrhundert\" (speech of October 1924), in Reden und Aufsiitze, 3rd ed. (Munich: Beck, 1951), pp. 110–24 (pp. 12–13); Even though Nietzsche's ideas are often misunderstood or misused by these thinkers,; . they kept his dislike for Christian morals, democracy, modern ways, and equality as key parts of their beliefs. Historian Roger Woods says that Conservative Revolutionaries created a version of Nietzsche who supported bold actions, strong self- assertion, conflict over peace, and trusting instincts more than reason. Many thinkers in the movement were born in the late 1800s and saw WWI as a key event that shaped their political ideas. Their harsh experiences on the front line made most of them look for meaning in what they went through during the war. Ernst Jünger is a key figure in the Conservative Revolution, which aimed to maintain military values in peacetime and believed that the brotherhood among soldiers showed the real spirit of German socialism.; ; see . == Main thinkers == As noted by Armin Mohler and other sources, key figures in the Conservative Revolution were: * Oswald Spengler; ; . * Edgar Julius Jung; ; . * Carl Schmitt; ; see also * Thomas Mann (until 1922);; ; . * Ernst Jünger and his brother Friedrich Georg Jünger; . * Arthur Moeller van den Bruck; . * Stefan George * Ernst Niekisch; . * Martin Niemöller * Wilhelm Stapel; . * Hans Freyer; . * Othmar Spann; . * Hugo von Hofmannsthal and the Lensch-Cunow- Haenisch group; . * Ernst von Salomon * Ludwig Klages * August Winnig * Georg Quabbe * Hans Zehrer * Werner Sombart; . * Hermann Rauschning; . * Gottfried Reinhold Treviranus * Julius Evola (Italian) * Martin Heidegger; . * Gottfried Benn; . * Fiedrich Hielscher * Karl Haushofer * Alfred Baeumler * Paul Ernst * Paul Lensch * Mathilde Ludendorff * Sigrid Hunke * Jakob Wilhelm Hauer * Hans Grimm * Ernst Forsthoff * Werner Best * Hans Blüher == Ideology == The German Conservative Revolution, as explained by historian Roger Woods' idea of the \"conservative dilemma,\" can be characterized by its opposition to: * the traditional conservative values of the German Empire (1871–1918), which include Christian equality; the push to restore the old Wilhelmine empire along its past political and cultural lines; * the political system and business culture of the Weimar Republic; and democracy in general, because the national community should go beyond the usual left-right divide; * the class ideas of socialism, defending an anti-Marxist \"socialist revisionism,\" which Oswald Spengler called the \"socialism of the blood\" and was inspired by the brotherhood seen in World War I. === New nationalism and morality === Oswald Spengler, who wrote The Decline of the West, represented a cultural pessimism that partly defined the Conservative Revolution. Conservative Revolutionaries believed their nationalism was different from earlier forms of German nationalism or conservatism. They criticized traditional Wilhelmine conservatives for being backward and not fully grasping new ideas of the modern era, like technology, cities, and the working class. Moeller van den Bruck described the Conservative Revolution as the intention to keep a set of values connected to a Volk (people). These lasting values could endure through changing times due to innovations in how they are organized and understood. Unlike the rigid reactionaries, who don’t create anything, and the pure revolutionaries, who only destroy, the Conservative Revolutionary aimed to shape things in a lasting way that ensures their survival: :Conserving is not just about passing down what we received, but about updating the structures and ideas to stay rooted in strong values, even with ongoing historical challenges. In an age of uncertainty, opposing the past is not enough; we must create new security by embracing the same risks that come with it. — Arthur Moeller van den Bruck Edgar Jung rejected the idea that true conservatives wanted to \"stop history.\"; see . The life they wanted to create, according to Oswald Spengler, was not based on any moral rules, but on \"a clear, natural morality from good upbringing.\" This morality wasn't developed through thought, but was more like an instinct that has its own reasoning. Conservative revolutionaries viewed moral values as natural and timeless, and they believed these were reflected in rural life. Spengler argued that this rural way of life was threatened by the city's artificial nature, which required theories and ideas to understand life, either from liberal democrats or scientific socialists. The goal of Conservative Revolutionaries was to bring back what they viewed as natural laws and values in the modern world: :We call Conservative Revolution the return of essential laws and values, without which humans lose their ties to Nature and God and can't create real order. — Edgar Jung, 1932 Influenced by Nietzsche, many opposed Christian ideas of helping each other and equality. Although a lot of Conservative Revolutionaries identified as Protestant or Catholic, they believed Christian principles forced the strong to help the weak when it should be a choice.; . On a global level, movement thinkers imagined a world where nations would ignore moral rules in their dealings with each other, following only their own interests. :Let thousands, even millions, die; how does their suffering matter compared to a state that absorbs all the worries and desires of the German identity! — Friedrich Georg Jünger, 1926. The Völkischen were part of a racial and occult movement from the mid-19th century that affected the Conservative Revolution. They focused on opposing Christianity and wanted to return to a (reconstructed) German pagan belief or change Christianity to remove non- German (Semitic) influences.; . === Volksgemeinschaft and dictatorship === Thomas Mann thought that during World War I, Germany's military resistance to the West was stronger than its spiritual resistance. He believed this was mainly because the character of the German national community couldn't easily express itself in words, which made it hard to effectively challenge the strong arguments from the West. Since German culture was seen as a matter of the soul, not just something the mind could understand, Mann believed the authoritarian state was what the German people naturally wanted. He argued that politics was always tied to democracy and therefore did not fit the German spirit. :There is no real democratic or conservative politician. You are either a politician or you are not, and if you are, you are a democrat. — Thomas Mann, 1915 Some scholars have argued whether these ideas are artistic and idealistic, or if they are a serious effort to analyze the politics of the time. Young Mann's writings have strongly influenced many Conservative Revolutionaries. In 1922, the right criticized Mann for softening his undemocratic views after he removed parts from his book, Betrachtungen eines Unpolitischen ('Reflections of a Nonpolitical Man'), first published in 1918.; In a speech in the same year, 'On the German Republic', Mann openly supported the Weimar Republic and criticized figures linked to the Conservative Revolution, like Oswald Spengler, whom he called dishonest and immoral. In 1933, he called National Socialism the 'political reality of that Conservative Revolution.' In 1921, Carl Schmitt wrote his essay Die Diktatur ('The Dictatorship'), where he examined the basics of the newly created Weimar Republic. He compared the strong and weak parts of the new constitution and pointed out that the role of the Reichspräsident was important, mainly because Article 48 gave the president the power to declare a state of emergency, which Schmitt quietly supported as a dictatorial power. : If a state's constitution is democratic, then any rejection of democratic rules and any use of state power without the majority's approval can be seen as dictatorship.— Carl Schmitt, 1921Die Diktatur § XV p. 11. Schmitt argued in Politische Theologie (1922) that a legal system cannot work without a supreme authority. He described sovereignty as the ability to declare a \"state of emergency,\" which means setting aside the usual laws: \"If there is someone in a government who can completely pause the law and then use outside legal means to restore order, that person is the sovereign in that government.\" He believed that every government should have in its rules the power to act quickly and effectively without needing long discussions in parliament. In 1934, he referenced Adolf Hitler to explain the actions taken during the Night of the Long Knives, stating: Der Führer schützt das Recht ('The leader defends the law'). === Front-line socialism === Socialists generally agreed on getting rid of the worst parts of capitalism., quoting \"Die nationale Revolution\", Deutsches Volkstum, 11 August 1929, p. 575. Jung said that, while the economy should stay private, the greed of capital needs to be kept in check, and a community based on shared interests should be created between workers and employers. Another reason for dislike of capitalism was the profits made from war and inflation. Finally, many Conservative Revolutionaries were from the middle class, which made them feel trapped in the struggle between the wealthy capitalists and the threatening masses. Even though they rejected communism as just a dream, many relied on some Marxist terms in their writings. For example, Jung highlighted the 'inevitable history' of conservatism replacing the liberal age, similar to the historical materialism of Karl Marx. Spengler discussed the decline of the West as an unavoidable trend, but he aimed to offer readers a 'new socialism' that would help them understand the meaninglessness of life, unlike Marx's vision of a paradise on earth. Mostly, the Conservative Revolution was influenced by vitalism and irrationalism, not materialism. Spengler believed Marx's materialist view came from nineteenth- century science, while the twentieth century would focus on psychology. :We don't believe reason has power over life anymore. We think life is what controls reason.— Oswald Spengler, 1932 Ernst Niekisch, along with Karl Otto Paetel and Heinrich Laufenberg, was a key supporter of National Bolshevism, a small part of the Conservative Revolution seen as the 'left-wing of the right.' They promoted an extreme form of nationalism mixed with socialism, rejecting all Western influences on German culture, including liberalism, democracy, capitalism, Marxism, the middle class, the working class, Christianity, and humanism. Niekisch and the National Bolsheviks were even willing to team up temporarily with German communists and the Soviet Union to destroy the capitalist West.; see for instance: Lt. Richard Scheringer, \"Revolutionare Weltpolitik\", Die sozialistische Nation: Blatter der Deutschen Revolution, 6 June 1931. == Currents == In his PhD thesis guided by Karl Jaspers, Armin Mohler identified five groups within the Conservative Revolution: the young conservatives, the national revolutionaries, the folkish group, the leaguists, and the rural people's movement. Mohler noted that the last two groups focused more on action than on theory, with the rural movement providing direct resistance through protests and tax boycotts. French historian Louis Dupeux identified five divisions within the Conservative Revolutionaries. Small farmers differed from cultural pessimists and 'pseudo- moderns', mainly from the middle class. Supporters of an 'organic' society were different from those favoring an 'organized' society. A third division separated those who wanted major political and cultural changes from those who wanted a quick social revolution, even at the expense of economic freedom and private property. The fourth division focused on the 'drive to the East' and how to view Bolshevik Russia, debating Germany's position between a 'declining' West and a 'young and barbaric' East. The last division was a strong disagreement between the Völkischen and pre-fascist thinkers. In 1995, historian Rolf Peter Sieferle talked about five groups in the Conservative Revolution: the 'völkischen', the 'national socialists', the 'revolutionary nationalists', the 'vital-activists', and a smaller group called the 'biological naturalists'. Using earlier research by Mohler and Dupeux, French political scientist Stéphane François outlined the three key trends in the Conservative Revolution, which is the most common division among those studying the movement: * the \"young conservatives\" (Jungkonservativen);; . * the \"national revolutionaries\" (Nationalrevolutionäre);; }. * the Völkischen (from the Völkisch movement).; . === Young conservatives === \"Young conservatives\" were greatly affected by 19th-century ideas and styles like German romanticism and cultural pessimism. Unlike older Wilhelmine conservatives, the Jungkonservativen wanted to help bring back important and basic values—authority, the state, the community, the nation, and the people—while also being in tune with their time. Moeller van den Bruck attempted to solve the issue of Kulturpessimismus by opposing decline to create a new political system. In 1923, he published the important book Das Dritte Reich ('The Third Reich'), where he moved from theory to propose a practical plan to improve the political situation: a 'Third Reich' that would bring all classes together under a strict government that mixed right-wing nationalism and left-wing socialism. The Jung Conservatives rejected both a nation-state made up of one group of people and an imperial system based on various ethnic groups. ; .Their goal was to achieve the Volksmission (\"mission of the people\") by creating a new Reich, meaning \"the uniting of all peoples in a larger state, led by one guiding principle, under the main control of just one people,\" according to Armin Mohler. Edgar Jung summarized this in 1933: : The idea of the nation-state is moving personal beliefs from people to the state itself. [...] The super-state (the Reich) is a type of government that operates above the people and can keep them separate. However, it does not aim to be completely controlling and will acknowledge local powers and independence.— Edgar Jung, 1933, quoting: Edgar Julius Jung, Sinndeutung der deutschen Revolution. In: Schriften an die Nation, Band 55. Oldenburg 1933, pp. 78, 95. Even though Moeller van der Bruck took his own life in May 1925 due to despair, his ideas still affected people of his time. One of them was Edgar Jung, who pushed for a corporatist state without class struggles or parliamentary democracy, aiming to bring back the spirit of the Middle Ages with a new Holy Roman Empire in central Europe. The idea of returning to medieval values and styles among 'young conservatives' came from a Romantic love for that time, which they saw as simpler and more united than today.; see also Joachim H. Knoll, \"Der Autoritare Staat. Konservative Ideologie und Staatstheorien am Ende der Weimarer Republik,\" in Lebendiger Geist, 1959. pp. 200-224. Oswald Spengler admired medieval chivalry as the right way to stand against the decline of modern times. Jung viewed this change as a slow process, much like the Protestant Reformation of the 16th century, rather than a sudden uprising like the French Revolution. === National revolutionaries === Other conservative revolutionaries were influenced by their experiences during the First World War. Unlike the 'young conservatives' who worried about culture, Ernst Jünger and the national revolutionaries fully accepted modern techniques and used tools like propaganda and mass groups to overcome modern challenges and create a new political system.; . This system would be based on real life rather than just ideas, built on natural and structured communities, and led by a new group of capable leaders.; see also Historian Jeffrey Herf called this idea 'reactionary modernism', which means having excitement for modern technology while rejecting Enlightenment ideas and liberal democracy. :That time is only worth wasting. But to waste it, you must understand it first. [...] You had to fully commit to the method, by mastering it in the end. [...] The tool itself was not worthy of praise — that was the risky part — it just needed to be used.— Franz Schauwecker, 1931 Jünger supported the rise of a new group of young intellectuals that would come from the trenches of WWI, ready to challenge capitalist society and represent a fresh nationalist revolutionary spirit. In the 1920s, he wrote over 130 articles in different nationalist magazines, mainly in Die Standarte or, less often, in Widerstand, the publication linked to Ernst Niekisch. However, as Dupeux noted, Jünger wanted to use nationalism as something powerful but not final, allowing the new order to develop on its own. The connection between Jünger and the Conservative Revolutionaries is still debated among scholars. Germany joined the League of Nations in 1926, which helped push the revolutionary side of the movement to become more extreme in the late 1920s. This was viewed as a sign of Western influence in a country that Conservative Revolutionaries imagined as the future Empire of Central Europe. === Völkischen === The word völkisch comes from the German idea of Volk (similar to the English word folk), which includes meanings of 'nation', 'race', and 'tribe'.James Webb. 1976. The Occult Establishment. La Salle, Illinois: Open Court. . pp. 276–277 The Völkisch movement started in the mid-1800s and was influenced by German Romantic ideas. It was based on the idea of Blut und Boden ('blood and soil') and was about race, popular feelings, farming, romantic nationalism, and antisemitism from the 1900s. Armin Mohler said that the Völkischen wanted to fight against 'desegregation' that was seen as a threat to the Volk by helping people become aware of their identity. Inspired by writers like Arthur de Gobineau, Georges Vacher de Lapouge, Houston Stewart Chamberlain, and Ludwig Woltmann, the Völkischen developed a view of races that put Aryans (or Germans) at the top of the 'white race'. They used phrases like 'Nordic race' and 'Germanic peoples', but their idea of Volk could also mean a 'common language'Georg Schmidt-Rohr: Die Sprache als Bildnerin. 1932. or an 'expression of a landscape's soul', according to geographer Ewald Banse. The Völkischen romanticized the idea of an 'original nation', which they believed could still be found in rural Germany, structured as a form of 'primitive democracy led by their natural leaders.' For the Völkischen, the idea of 'people' (Volk) became a living and eternal being, similar to how they might write about 'Nature', instead of just a sociological group. The political unrest after WWI created a good environment for the comeback of various Völkisch groups that were common in Berlin then. The Völkischen became important by the number of groups during the Weimar Republic, even though they did not have many followers. Some Völkischen aimed to bring back what they thought was a true German religion by bringing back the worship of ancient German gods. Different occult movements like Ariosophy were linked to Völkisch ideas, and there were also many artists among them, such as painters Ludwig Fahrenkrog and Fidus. By May 1924, Wilhelm Stapel saw the movement as able to unite the entire nation: he believed the Völkischen had a vision to promote instead of a political plan, and they were led by 'heroes' not 'calculating politicians.'Wilhelm Stapel, \"Das Elementare in der volkischen Bewegung\", Deutsches Volkstum, 5 May 1924, pp. 213–15. Mohler mentioned these people as part of the Völkisch movement: Theodor Fritsch, Otto Ammon, Willibald Hentschel, Guido von List, Erich Ludendorff, Jörg Lanz von Liebenfels, Herman Wirth, and Ernst Graf zu Reventlow. == Relationship to Nazism == Even though they share significant intellectual ideas, this separate movement cannot be directly compared to Nazism. Their anti-democratic and militaristic views definitely helped make the idea of an authoritarian government accepted by some educated middle-class people and youth,; . but the writings of Conservative Revolutionaries did not strongly shape National Socialist beliefs. Historian Helga Grebing points out that whether people were open to National Socialism is not the same as understanding its roots and ideas. This unclear connection has led some experts to describe the movement as a kind of 'German pre-fascism' or 'non-Nazi fascism'.; . In the 1920s to early 1930s, as the Nazi Party became powerful, some thinkers, as historian Roger Woods notes, failed to see the true nature of the Nazis. Their political problems and inability to clearly describe a new German government meant there were no strong alternatives from the right, leading to little resistance against the Nazis taking control. Historian Fritz Stern adds that many conservative revolutionaries, even with doubts about Hitler's tactics, viewed him as their only chance to succeed. However, after Hitler's rise, many of Moeller's supporters lost faith, and the twelve years of the Third Reich showed a split between conservative revolution and national socialism. A few months after their big election win, the Nazis rejected Moeller van den Bruck and claimed he was not a predecessor of National Socialism. They called his ideas 'unrealistic' and said in 1939 that they had 'nothing to do with actual history or practical politics' and that Hitler 'was not Moeller's heir.' Conservative Revolutionaries often had mixed feelings about the Nazis, but many turned against Nazism and the Nazi party after they took power in 1933.; . Some opposed its totalitarian and antisemitic nature, while others would have preferred a different kind of authoritarian regime. Stern summed up the relationship like this: :But we must ask, could there have been another 'Third Reich'? Can we reject reason, praise force, foresee the time of the empire's dictator, and condemn all current systems, without paving the way for the success of irresponsibility? The German critics did all this, showing the serious risks of politics based on cultural hopelessness.— Fritz Stern, 1961 === Opponents === Many Conservative Revolutionaries opposed liberalism and supported the idea of a 'strong leader,' but they did not agree with the totalitarian or antisemitic aspects of the Nazi regime. Martin Niemöller, who initially backed Adolf Hitler, opposed the Nazis’ control over German Protestant churches in 1934 and their Aryan Paragraph.Martin Stöhr, „...habe ich geschwiegen“. Zur Frage eines Antisemitismus bei Martin Niemöller Although he made some comments about Jews that some scholars view as antisemitic, he led the anti-Nazi Confessing Church. :We chose to stay quiet. We are not innocent, and I keep thinking, what if in 1933 or 1934—there must have been a chance—14,000 Protestant pastors and all Protestant groups in Germany had stood up for what was right until the end? What if we had spoken out then, saying it was wrong for Hermann Göring to put 100,000 Communists in concentration camps to let them die?— Martin Niemöller, 1946 Rudolf Pechel and Friedrich Hielscher openly challenged the Nazi government, while Thomas Mann fled in 1939 and sent anti-Nazi speeches to Germany through the BBC during the war. Ernst Jünger turned down a position in the Nazi Reichstag both in 1927 and 1933, hated the \"blood and soil\" idea, and his home was searched multiple times by the Gestapo. Hermann Rauschning and Gottfried Reinhold Treviranus found safety abroad to continue opposing the regime. Georg Quabbe refused to work with the Nazis as a lawyer. Just before he died in 1936, Oswald Spengler predicted that \"in ten years, a German Reich probably won’t exist anymore.\" In his private writings, he strongly criticized Nazi anti-Semitism. :Anti- Semitism often hides a lot of jealousy towards what others can do that one can't. [...] When someone would rather ruin businesses and education than accept Jews in those areas, they are being extreme, which is harmful to society. Foolish.— Oswald Spengler Others like Claus von Stauffenberg stayed in the Reichswehr and later the Wehrmacht to quietly plot the July 20th attempt to remove Hitler in 1944. Fritz Stern noted that it showed the real spirit of the conservative movement that the conditions of the Third Reich led many of them to oppose it, sometimes quietly, often openly and at great cost. [...] In the last attempt against Hitler in July 1944, a few former conservative revolutionaries risked and lost their lives, becoming martyrs for the true beliefs they once had. === Competitors === Some Conservative Revolutionaries did not completely disagree with the fascist rule of the Nazis, but they wanted a different kind of strict government. Many of them were killed or put in prison for not following Hitler's leadership rule or Führerprinzip. Edgar Jung, an important leader of the Conservative Revolution, was killed during the Night of the Long Knives by Heinrich Himmler's SS. The SS wanted to stop other nationalist ideas from challenging Hitler. After this event, many Conservative Revolutionaries stopped having mixed feelings about the Nazis. Jung believed that nations were like living beings, criticized individualism, and supported war and strong military power. He also wanted to fully use people and industries and liked modern ideas, similar to Italian Fascism.Griffin, Roger (ed). 1995. \"The Legal Basis of the Total State\" – by Carl Schmitt. Fascism. New York: Oxford University Press. pp. 108–109. Ernst Niekisch did not like Jews and supported a strong government, but he was against Hitler because he thought Hitler was not truly socialist. Instead, he admired Joseph Stalin's leadership. Because he criticized the government, he was sent to a concentration camp from 1937 to 1945.Philip Rees, Biographical Dictionary of the Extreme Right Since 1890, 1990, p. 279 August Winnig first supported the Nazis in 1933 but later opposed them because of his neo-pagan beliefs. In 1937, he wrote an essay that defended fascism and included antisemitism, but it did not fully match Nazi ideas about race. Since he remained quiet during Hitler’s rule, the Nazis mostly ignored him. === Collaborators === Known as the main lawyer of the Third Reich, Carl Schmitt did not regret his part in making the Nazi state even after 1945. While he thought Adolf Hitler was too crude, Schmitt took part in burning books by Jewish writers, celebrating the destruction of things he saw as un-German and anti-German, and asking for a bigger cleanup that included writers influenced by Jewish ideas.Claudia Koonz, The Nazi Conscience, p. 59 Hans Freyer was the leader of the German Institute for Culture in Budapest from 1938 to 1944. Along with Nazi historian Walter Frank, Freyer created a racist and anti- Jewish history during this time.The Oxford History of Historical Writing: Volume 4: 1800–1945, by Stuart Macintyre, D. Daniel R. Woolf, Andrew Feldherr, 2011, p. 178. Wilhelm Stapel joined the Deutsche Christen in July 1933 and strongly opposed the anti-Nazi Confessing Church led by Martin Niemöller and Karl Barth. He also supported the introduction of the Aryan paragraph in the Church. At the same time, Stapel worked with Reichsminister of Church Affairs Hanns Kerrl as his advisor. However, due to pressure from the Nazi leaders in 1938, he had to stop publishing his monthly magazine Deutsches Volkstum. == Study and debate == The early study of the Conservative Revolution began with the French historian Edmond Vermeil, who wrote an essay in 1938 called Doctrinaires de la révolution allemande 1918–1938 (\"Doctrinarians of the German Revolution 1918–1938\"). In the years right after WWII, many of the political thinkers who focused on the Conservative Revolution were far-right individuals strongly influenced by thinkers like Armin Mohler and Alain de Benoist. It wasn't until the 1980s and 1990s that research on this movement started to gain more attention across different political views, mainly because of its links to Nazism and its impact on the post-war European New Right. === Post-war revival after Armin Mohler === The modern idea of a \"Conservative Revolution\" was formed after WWII by philosopher Armin Mohler in his 1949 doctoral thesis, titled Die Konservative Revolution in Deutschland 1918–1932, supervised by Karl Jaspers. Mohler referred to Conservative Revolutionaries as the \"Trotskyites of the German Revolution\" and has often been accused of trying to reshape a pre-WWII far-right movement to fit a post- fascist Europe by downplaying the role of these thinkers in the rise of Nazism.; ; see also Eberhard Kolb, Dirk Schumann: Die Weimarer Republik (= Oldenbourg Grundriss der Geschichte, Bd. 16). 8. Auflage. Oldenbourg, München 2013, p. 225. The work was called \"a handbook\" and, according to historian Roger Griffin, was meant as a guide for those wanting to keep their values in today's world. Mohler thought the \"Conservative Revolution\" project had just been delayed by the Nazis taking power. At that time, he was also the secretary for Ernst Jünger, a key figure in the movement. In the 1970s, thinkers from the Conservative Revolution influenced new radical right movements, like the French Nouvelle Droite, led by Alain de Benoist. Some scholars, mainly in West Germany, started to question Mohler's work due to his political ties to the idea. The reactionary and anti-modern aspects of the 'Conservative Revolution' were mainly highlighted during that decade, and many viewed the movement as just a breeding ground for Nazism, sharing similar totalitarian views.; see for instance: Jean-Pierre Faye, Languages totalitaires, Paris, 1972; Johannes Petzold, Konservative Theoretiker des deutschen Faschismus, Berlin-Ost, 1978. German-American historian Fritz Stern used the term \"Conservative Revolution\" in his 1961 book The Politics of Cultural Despair to describe the life and ideas of Arthur Moeller van den Bruck. He highlighted the feelings of disconnection and \"cultural despair\" these writers had in the early modern world, which pushed them to share radical ideas. However, Stern placed Moeller van den Bruck within a bigger \"Germanic ideology\" that included earlier thinkers from the late 19th century like Paul de Lagarde and Julius Langbehn. === Academic research since the 1980s === In a 1981 meeting called \"Conservative Revolution and Modernity\", French historian Louis Dupeux noted that what Mohler called the \"Conservative Revolution\" was not really reactionary or completely against modern ideas (some were even hopeful about the modern world). Three years later, American historian Jeffrey Herf backed this up in his book Reactionary Modernism, which showed that conservative thinkers of that time accepted modern techniques but rejected liberal democracy.; . Dupeux also pointed out that Conservative Revolutionaries opposed both forms of progressivism, which were liberalism and Marxism, and the cultural pessimism of reactionaries and conservatives. They tried to solve this by suggesting new types of reactionary governments that could fit into the modern world. In his 1993 book Anatomy of the Conservative Revolution, German sociologist Stefan Breuer rejected Mohler's definition of \"Conservative Revolution\". He defined \"conservatism\" as wanting to keep the feudal structures of Germany, which were already dying during the Weimar period. Breuer saw Mohler's idea of the \"Conservative Revolution\" as a reflection of a new modern society aware of the problems of a simple modernity based only on science and technology. While he recognized the complexity of classifying that time intellectually, Breuer said he would have preferred the term \"new nationalism\" to describe a more engaging and complete version of German right-wing movements, as opposed to the \"old nationalism\" of the 19th century, which mainly focused on preserving traditional institutions and German influence globally. In 1996, British historian Roger Woods recognized that the idea was valid, but he emphasized that the movement was diverse and had trouble agreeing on a common plan, a political standstill he called the \"conservative dilemma.\" Woods described the Conservative Revolution as \"ideas that can't be simply explained as a political program, but are more like expressions of tension.\" About the unclear connection with Nazism, which Mohler minimized in his 1949 thesis and 1970s analysts highlighted, Woods said that \"even with some Conservative Revolutionary critiques of the Nazis, there remains a strong commitment to action, leadership, hierarchy, and a disregard for political programs. [...] Ongoing political issues lead to activism and a focus on hierarchy, which means there can be no strong opposition to the National Socialist rise to power.\" Historian Ishay Landa has explained that the Conservative Revolution's idea of \"socialism\" is actually very capitalist. Landa indicates that Oswald Spengler's \"Prussian Socialism\" was strongly against labor strikes, trade unions, higher taxes on the wealthy, shorter workdays, and any government help for sickness, old age, accidents, or job loss. While rejecting any social welfare policies, Spengler praised private property, competition, imperialism, wealth gathering in the hands of the few elites, and capital growth. Landa describes Spengler's \"Prussian Socialism\" as working a lot for the least pay but being satisfied with it. Landa also describes Arthur Moeller van den Bruck as a \"socialist supporter of capitalism\" who valued free trade, active markets, the creativity of entrepreneurs, and the capitalist division of labor, aiming to replicate British and French imperialism. Landa points out that Moeller's criticism of socialism shares similarities with those of neoliberals like Friedrich von Hayek and states that \"Moeller's writing is far from being against the capitalist spirit; it is full of it.\" == Later influence == The movement affected modern thinkers outside of German-speaking Europe. One notable figure is the Italian philosopher Julius Evola, who is linked to the Conservative Revolution.; . The Nouvelle Droite, a French far-right group formed in the 1960s, aimed to adapt traditional and ethnically focused politics to post-WWII Europe and to separate itself from older far-right movements like fascism, mainly through a shared European nationalism. This group has been greatly shaped by the Conservative Revolution and its German counterpart, the Neue Rechte. The ideas and framework of the Identitarian movement are largely influenced by the Nouvelle Droite, the Neue Rechte, and through them, the Conservative Revolution. == References == ===Primary sources=== * * * * * * * * * (trans. as \"The Führer Protects Justice\" in Detlev Vagts, Carl Schmitt's Ultimate Emergency: The Night of the Long Knives (2012) 87(2) The Germanic Review 203.) * * === Bibliography === * * * * * * * * * * * * * * * * * * * * * * * * * * < * Category:Political movements",
 "title": "Conservative Revolution"
}