{
 "id": "1151898",
 "text": "Lviv during the medieval period was a key cultural, political, and trade hub in Eastern Europe. Founded in the mid-13th century by King Danylo Romanovych of the Galician-Volhynian State, the city became a strategic center due to its position on important trade routes, including the Silk Road extensions leading to Krakow and further west. == Historical development == === Foundation and early growth === Lviv was first mentioned in 1256 in the Galician-Volhynian Chronicle. King Danylo established the city and named it after his son, Leo I of Galicia. By the late 13th century, Lviv had become the capital of the Galician-Volhynian State, replacing older centers like Halych. === Integration into Poland === In 1349, Lviv came under Polish control and became part of the Kingdom of Poland. This led to significant urban development, including the construction of city walls and gothic-style churches. The introduction of Magdeburg Law in 1356 granted the city self-governance, further promoting trade and economic growth. === Economic and cultural flourishing === By the 15th and 16th centuries, Lviv was a multi-ethnic and multi-religious center with a mix of Ukrainian, Polish, Armenian, and Jewish communities. Key industries included trade, craftsmanship, and printing, with Lviv housing one of the first printing presses in Ukraine. == Fortifications and architecture == The city developed a sophisticated system of fortifications, including the High Castle on Castle Hill and defensive walls surrounding the medieval core. Gothic and Renaissance architectural styles flourished, as seen in landmarks like the Latin Cathedral and Armenian Cathedral of Lviv. == Legacy == Medieval Lviv remains a vital part of Ukraine’s cultural heritage. Its architectural and historical significance earned it recognition as a UNESCO World Heritage Site in 1998. Modern Lviv preserves many medieval elements, including its urban layout and historic landmarks. Category:History of Ukraine",
 "title": "Medieval Lviv"
}