{
 "id": "1151706",
 "text": "Arriva Sapphire was a luxury brand used by different Arriva bus companies in the United Kingdom. ==History== In February 2013, Arriva UK Bus announced that it would launch a luxury service called Sapphire for its bus services in the United Kingdom. Arriva launched the Sapphire brand on four routes: *Arriva Buses Wales' route 1 Wrexham to Chester *Arriva Midlands' route 31/31a Oadby to Leicester this route now uses any vehicles *Arriva North East's route 7 Darlington to Durham *Arriva Shires & Essex's route 280 Aylesbury to Oxford From 2014 to 2015, seventeen routes were added to the Sapphire brand In 2017, the Arriva Sapphire logo and bus livery was improved. In 2018, the Arriva Sapphire logo was improved again. In 2019, Arriva Midlands routes 1, 2, 2E from Walsall to Cannock/Huntington were changed to normal buses. Many routes around the country have been removed from the Sapphire brand. In 2022, Arriva started to remove the Sapphire brand, the buses were painted into the normal Arriva livery or they were replaced with new buses. ==Routes== As of July 2024, there were 29 Arriva Sapphire routes. Service no. Route start Route end Arriva Buses Wales 1 Wrexham Chester 12/X12 Rhyl Llandudno 10/10A Connah's Quay / Flint Chester Arriva North East 1/5/5A/X1 Darlington Bishop Auckland, Crook and Tow Law 3/X3/X3A/X4 Middlesbrough Lingdale, Skelton, Loftus and Whitby 7 Darlington Durham Arriva Shires & Essex 5/6 Lakes Estate Wolverton 133 Colchester & Braintree Stansted Airport Arriva Southern Counties 480 Temple Hill Gravesend 490/491 Gravesend Valley Drive or Riverview Park Arriva Yorkshire 110 Leeds Wakefield 163 Leeds Castleford via Garforth and Kippax 168 Leeds Castleford via Woodlesford 229 Leeds Huddersfield via Birstall and Heckmondwike 231/232 Wakefield Huddersfield via Lepton, Flockton, Overton and Horbury 415 York Selby via York Designer Outlet ===Former services=== Service no. Route start Route end Notes Arriva North East 5/5A Middlesbrough Easington Route removed from the Sapphire brand in 2022, buses were painted into normal livery. 6 Durham Bishop Auckland and Cockfield Route removed from the Sapphire brand in 2022, buses were painted into normal livery. 22 Durham Sunderland Route removed from the Sapphire brand in 2022, buses were painted into normal livery. 23 Sunderland Hartlepool Route removed from the Sapphire brand in 2022, buses were painted into normal livery. 24 Durham Hartlepool Route removed from the Sapphire brand in 2022, buses were painted into normal livery. X21/X22 Newbiggin and Ashington Newcastle-upon-Tyne Route removed from the Sapphire brand in 2022, buses were painted into normal livery. 43 Morpeth Newcastle-upon-Tyne Route removed from the Sapphire brand, buses were painted into normal livery. 44/45 Dinnington Newcastle-upon-Tyne Route removed from the Sapphire brand, buses were painted into normal livery. Arriva North West 38 Crewe Macclesfield Arriva North West stopped operating service in April 2023, route now operated by D&G; Bus 362 Chorley Wigan Arriva North West stopped operating the route in September 2023, now operated by Go North West under the Bee Network franchising system. Buses branded for this route were sent to Wythenshawe Depot and Hemel Hempstead, and can be seen operating various Arriva routes in South Manchester and Hertfordshire. 575 Wigan Bolton Arriva North West stopped operating the route in September 2023, now operated by Go North West under the Bee Network franchising system. Buses branded for this route were sent to Wythenshawe Depot and Hemel Hempstead, and can be seen operating various Arriva routes in South Manchester and Hertfordshire. 263 Manchester Altrincham Route removed from the Sapphire brand in September 2023, buses were withdrawn from service and replaced by a variety of Sapphire and non-Sapphire buses from the Bolton Depot, which has been shut down due to the introduction of the Bee Network. Arriva Yorkshire 166 Leeds Castleford Route withdrawn and replaced in part by revised routes 163 and 164. 167 Leeds Castleford Route withdrawn and replaced in part by revised route 168. Arriva Midlands 31/31A/31E Haymarket Bus Station, Leicester Oadby Grange & Coombe Rise Services 31/31E now operated by standard buses. Service 31A was ceased in March 2020 until January 2023 when it was reinstated X3 Leicester City Centre Market Harborough Frequency reduced and Sapphire buses moved elsewhere in 2021. X84 St Margaret's Bus Station Rugby via Lutterworth Mainly being used on normal buses, however sometimes Sapphire branded buses are used. 38 Derby Bus Station Sinfin Vehicles repainted into standard Arriva livery in early 2022. 110 Tamworth Birmingham Route removed from the Sapphire brand in 2022, with the repaint of existing buses into standard livery. 158 Leicester Hinckley-Nuneaton via Earl Shilton & Barwell Vehicles are being repainted from January 2023. Arriva The Shires 320 Hemel Hempstead Rickmansworth Withdrawn on 17 April 2022 and replaced by new route 20 and extended route 321. 321 Luton Watford Buses repainted into Arriva Standard Livery throughout 2021 and route declassified. 280 Aylesbury Oxford Route replaced by routes X7 and X8. X7/X8 Aylesbury Oxford Routes withdrawn in July 2024. Arriva Southern Counties 101 Gillingham Maidstone Buses repainted into Arriva Journey Mark. 470 Dartford Gravesend Route withdrawn and replaced by the revised route 480 480A Gravesend Riverview Park Route renumbered to 491 490A Gravesend Singlewell, Valley Drive Route renumbered to 490 700 Bluewater Chatham Buses repainted into Arriva Journey Mark, route now uses any suitable vehicle. ==Buses== Buses had leather seats, free WiFi, power ports, and a blue livery.The first routes operated with old double deck buses and new VDL SB200s with Wright Pulsar bodywork . New routes were added and new buses had been ordered for the new routes, the buses were Alexander Dennis Enviro400s, Wright StreetLites and Wright StreetDecks. Some Wright Pulsar and Wright Pulsar 2 buses had been painted into Sapphire livery. In 2020 some Optare Versas in Yorkshire were painted into the new Arriva Sapphire livery. ==Related pages== *Arriva Max ==References== ==Other websites == * * Category:2013 establishments in the United Kingdom Category:2022 disestablishments in the United Kingdom",
 "title": "Arriva Sapphire"
}