{
 "id": "1151817",
 "text": "Ancient Armenian translated literature consists of works translated into Armenian between the 5th and 18th centuries. This tradition began during a cultural renaissance in Armenia, closely tied to the invention of the Armenian alphabet by Mesrop Mashtots in the early 5th century. Translation was seen as a way to preserve and enrich Armenian identity during periods of foreign domination. == Historical context == Origins: In 387 CE, Armenia was divided between the Roman Empire and Persia, leading to cultural and religious suppression. The invention of the Armenian alphabet allowed Armenians to translate religious, historical, and philosophical texts, promoting cultural unity and resilience. Golden Age of Translations: The 5th century, known as the \"Golden Age\" of Armenian literature, produced translations of the Bible and Greek classics. These works laid the foundation for Armenian literary and spiritual development. == Key features == * Languages translated: The majority of works were translated from Greek, followed by Syriac and later Persian and Arabic. * Genres: Translated texts included religious scriptures, philosophical treatises, historical chronicles, and scientific works. * Style: Early translations adhered closely to the original text, creating a \"Greek- influenced Armenian language\" used primarily by scholars. == Notable contributions == Religious Texts: The Armenian Bible, translated by Mesrop Mashtots and his disciples, is considered one of the finest translations of the era. Greek Influence: The works of philosophers like Aristotle and Plato were studied and translated, influencing Armenian intellectual traditions. == Legacy == The translated literature helped Armenia maintain its cultural and spiritual heritage despite centuries of external pressures. Institutions like the Matenadaran, a repository of ancient manuscripts in Yerevan, continue to preserve and study these texts. Category:Literature of Armenia Category:Translation Category:Ancient Armenia",
 "title": "Ancient Armenian translated literature"
}