{
 "id": "1151730",
 "text": "Artificial general intelligence (AGI) is when a computer can do many different kinds of tasks as well as a human, or even better. Currently some tasks can only be done by humans, who can use learning, thinking, and planning to take actions. AGI is when computers can handle many types of tasks, such as solving problems, understanding new information, or learning new skills, at a level similar to humans. AGI is different from \"narrow\" Artificial Intelligence (narrow AI). Narrow AI is built to do a specific task well, like recognising a face, or playing a game of chess. AGI would be able to do many tasks that it wasn’t specifically programmed to do. Building on AGI is the idea of Artificial superintelligence (ASI), where computers could be much smarter than humans. People working at companies such as OpenAI and Meta are trying to develop computers that can solve general problems. They say that making AGI is an important goal. == History == In 2020, a study found 72 AGI research and development projects were being worked on in 37 countries. People have different ideas about when computers could reach AGI skill levels. In 2023, some experts predicted AGI could be reached within decades, while others thought it might take over a century—or never happen at all. Geoffrey Hinton, an expert in machine learning, is very worried about how fast progress is happening. He thinks AGI could be created much sooner than most people expect. People have different ideas about the definition of AGI. Some researches claimed that computer systems that we have now (GPT-4) could be an early form of AGI. AGI is a common idea in science fiction stories and in studies about what the future might be like. There is a debate about how dangerous AGI could be. Some think AGI could be very dangerous, while others think people are worrying too much or too soon. Many AI experts believe it is important to address the risk that AGI could cause humanity to no longer exist. They think it is important for people around the world to work together to address this risk. Others think that making computers that can reach AGI level will not happen soon and say it is not a risk to humans. ==References== Category:Artificial intelligence",
 "title": "Artificial general intelligence"
}