{
 "id": "1151710",
 "text": "The Battle of Nahrawan took place in July 658 CE between the army of Caliph Ali and a rebel group called the Kharijites. The Kharijites were once allies of Ali but split from him after he agreed to negotiate with Mu'awiya, the governor of Syria, following the Battle of Siffin. They believed this was against the teachings of the Qur'an. After failed attempts to bring them back, Ali fought them near the Nahrawan Canal, close to modern-day Baghdad. Of the 4,000 rebels, about 1,200 accepted amnesty, while the rest, around 2,800, were killed in the battle. Some sources say the number of rebel casualties was between 1,500 and 1,800. The battle caused a permanent divide between the Kharijites and the rest of the Muslims, who the Kharijites called apostates. Even though they were defeated, the Kharijites kept attacking towns for years. Ali was eventually killed by a Kharijite in January 661. ==Background== After Uthman, the third Caliph, was assassinated in 656, Ali ibn Abi Talib, Muhammad's cousin and son-in-law, became the new Caliph. However, his leadership was challenged by Muhammad's widow A'isha and some of his companions, including Talha and Zubayr. Mu'awiya, the governor of Syria and a relative of Uthman, also opposed Ali, demanding justice for Uthman's death. Ali defeated Talha and Zubayr in the Battle of the Camel but faced a stalemate against Mu'awiya at the Battle of Siffin in 657, leading to an arbitration process to resolve the conflict. The arbitration created division within Ali's army. A group of soldiers, later known as the Kharijites, criticized Ali for agreeing to arbitration, believing only God should decide the matter. About 12,000 soldiers defected and camped near Kufa at Harura. After some time, Ali persuaded them to return to Kufa, but they demanded that the war against Mu'awiya resume after six months, which Ali agreed to, though he refused to reject the arbitration. In March 658, Ali's delegation continued with the arbitration talks. The Kharijites, angered by Ali's decision, left his army and went to Nahrawan, where they formed a separate group. They were called Kharijites, meaning \"those who left.\" == Prelude == The Kharijites rejected Ali as caliph, called him and his followers infidels, and chose their own leader. They also declared it was okay to kill those they considered infidels. Meanwhile, the arbitrators in the conflict said Uthman’s death was unjust, which made Mu'awiya's supporters stronger. Ali disagreed with the decision and wanted to fight Mu'awiya again. He asked the Kharijites to join him, but they refused unless he admitted he was wrong. Ali decided to go to Syria without them. The Kharijites began killing people who disagreed with them, including a farmer and his pregnant wife. Ali, learning of their violence, sent someone to investigate, but the Kharijites killed him too. Ali’s soldiers, worried for their families, asked him to deal with the Kharijites, so he moved his army to Nahrawan to confront them. ==Battle== Ali asked the Kharijites to surrender the murderers and accept peace. If they did, he promised to leave them alone and focus on fighting the Syrians. The Kharijites rejected this offer, claiming that all of them were responsible for the killings. After more exchanges, the Kharijite leaders urged their followers to prepare for martyrdom. Ali offered amnesty to those who would join him or return to Kufa, stating that only the murderers would be punished. About 1,200 Kharijites took this offer, leaving only 2,800 to fight. Ali's army included cavalry, archers, and foot-soldiers. He positioned his cavalry in front, with archers between them and the foot-soldiers. The Kharijites attacked fiercely, breaking through Ali's cavalry, but were surrounded and overwhelmed by arrows, cavalry, and infantry. Most of the Kharijites were killed, including their leader, Ibn Wahb. Around 2,400 Kharijites died, and 400 wounded were sent back to Kufa. Ali's side lost between seven and thirteen men. == References == Category:Pages created with the Article Wizard from 2024 Category:Battles",
 "title": "Battle of Nahrawan"
}