{
 "id": "1151760",
 "text": "Arriva Max was a premium brand used by different Arriva bus companies in the United Kingdom. ==History== In September 2014, Arriva launched the Max brand on two routes: Arriva North East's X10 and X11 from Newcastle to Blyth.Arriva goes Max Coach & Bus Week 1 September 2014Maximum Impact: Max comes to Northumberland Arriva 2 September 2014Arriva North East launches first MAX route Bus & Coach Buyer 5 September 2014 In 2015, Arriva Buses Wales, Arriva Shires & Essex and Arriva Southern Counties's routes were given the Max brand. Arriva North East and Arriva Yorkshire added more routes to the Max brand.Sapphire on Deeside Coach & Bus Buyer 20 March 2015Max - new interurban express services from Arriva ArrivaTitan the robot entertains crowds at Arriva bus route event Yorkshire Evening Post 26 March 2015Arriva Max brand launches in Leeds RouteOne 1 April 2015More Arriva Max in Yorkshire Bus & Coach Buyer 1 April 2015Titan takes bus travel to the Max The Northern Echo 29 April 2015 In 2022, Arriva started to remove the Max brand, the buses were painted into the normal Arriva livery or they were replaced with new buses. ==Routes== As of July 2024, there were 8 Arriva Max routes. ===Arriva North East=== * X12 - Middlesbrough to Newcastle via Durham * X26/X27 - Darlington to Richmond and Catterick * X46 - Durham to Crook * X66 - Darlington to Middlesbrough * X75/X76 - Darlington to Barnard Castle * 306 - Newcastle to Whitley Bay via Tynemouth * X66/X67 - Darlington to Middlesbrough ===Arriva Yorkshire=== * 202/203 - Leeds to Huddersfield via Dewsbury ==Former routes== ===Arriva Southern Counties=== * 5 - Southend to Basildon,Arriva’s new look in Southend Bus & Coach Buyer 9 December 2015 withdrawn in September 2016 due to a lack of patronage, existing First Essex routes replaced itBus Passenger News September/October 2016 Essex Highways * 34/35 - Guildford to Camberley via Westfield, Mayford and Sutton Green, Upgraded to Arriva Sapphire. ===Arriva The Shires=== * 60/X60 - Milton Keynes to Aylesbury * 150 - Milton Keynes to Aylesbury via Leighton Buzzard * 300 - Aylesbury to High Wycombe via Princes Risborough * 800/850 - High Wycombe to Reading ===Arriva North East=== * X1 - Darlington to Crook via Bishop Auckland, removed from the MAX brand with buses now carrying the Arriva logo in its place. * X7/X8 - Newcastle to Blyth via Quorum Business Park, removed from the MAX brand with buses now carrying the Arriva logo in its place. * X9/X10/X11 - Newcastle to Blyth via Cramlington, removed from the MAX brand with buses now carrying the Arriva logo in its place. * X14 - Newcastle to Thropton via Morpeth, removed from the MAX brand following delivery of new buses in the standard livery. * X15/X18 - Newcastle to Berwick via Morpeth and Alnwick, removed from the MAX brand following delivery of new buses in the standard livery. * X16 - Newcastle to Kirkhill Estate via Morpeth, withdrawn and replaced in part by an extended route 2. * X20 - Newcastle to Alnwick via Ashington, removed from the MAX brand following delivery of new buses in the standard livery. * X67 - Darlington to Middlesbrough, withdrawn and replaced with revised route X66. * X93/X94 - Middlesbrough to Scarborough via Whitby, removed from the MAX brand following refurbishment and rebrand of existing vehicles and is now a part of the sapphire brand. * 308 - Newcastle to Blyth, following a change in vehicle allocation, the initial vehicles (Wright Gemini 2-bodied Volvo B5LHs) were transferred to Arriva Yorkshire, in return for unrefurbished Wright Gemini 2-bodied VDL DB300s which were later refurbished to the new standard Arriva livery and specification. ===Arriva Yorkshire=== * 415 - York to Selby, upgraded to Arriva Sapphire. * 229 - Leeds to Huddersfield, upgraded to Arriva Sapphire. * 444 - Leeds to Wakefield * 268 /268A - Wakefield/Dewsbury to Bradford ==Buses== Max branded buses had leather seats, free WiFi and a different livery, some also had charging points, some buses also had air conditioning. Arriva North East and Arriva Yorkshire used the following buses: VDL DB300s with Wright Gemini 2 bodywork, Scania OmniCity, Alexander Dennis Enviro400, Wright StreetLites and Volvo B9TLs. Arriva Herts & Essex used Mercedes-Benz Citaros Arriva Buses Wales used VDL SB200s with Wright Pulsar bodywork. ==Related pages== *Arriva Sapphire ==References== Max Category:Bus transport brands Category:Luxury brands Category:2014 establishments in the United Kingdom Category:2022 disestablishments in the United Kingdom",
 "title": "Arriva Max"
}