{
 "id": "1151686",
 "text": "The Battle of Oshakan took place on August 17 (29), 1827, during the Russo- Persian War (1826–1828). It occurred near the village of Oshakan, in modern- day Aragatsotn Province, Armenia. The battle ended with the Russian forces lifting the siege of the Etchmiadzin Monastery by the Persian army. == Background == === Conflict Context === The war began due to territorial disputes between Russia and Persia, with Persia aiming to regain control over regions in the South Caucasus, including Etchmiadzin and Yerevan. The Persian forces, led by Abbas Mirza, sought to counter Russian advances in the region. === Russian Position === Russia aimed to solidify its presence in the Caucasus, utilizing its Caucasian Corps led by General Ivan Paskevich. Despite the harsh summer climate and outbreaks of disease, the Russian forces advanced into Persian-held territories. == Battle == === Forces involved === * Russian Army: Commanded by Colonel Ivan Krasovsky, the detachment consisted of approximately 2,000 infantry and cavalry supported by artillery. * Persian Army: Commanded by Abbas Mirza, the Persian forces significantly outnumbered the Russians and included cavalry and artillery. === Key Events === ==== Skirmishes in the gorge==== Russian forces repelled Persian attacks while advancing through narrow terrain. Artillery played a decisive role in breaking enemy formations. Defense of Etchmiadzin: Russian troops successfully defended the monastery, lifting the Persian siege after intense fighting on the surrounding plains. == Aftermath == The battle secured Russian control over Etchmiadzin and boosted morale. This victory paved the way for further Russian advances, including the eventual capture of Yerevan later in 1827. The Persian forces suffered heavy losses and retreated. == Legacy == The victory is commemorated in Armenia and Russia. A monument was erected in Oshakan in 1834, and a memorial complex was inaugurated in 2011. The battle is remembered as a key moment in the Russo-Persian War, symbolizing the decline of Persian influence in the Caucasus. Category:Battles in Armenia Category:Battles involving Russia Category:Battles involving Iran",
 "title": "Battle of Oshakan"
}