{
 "id": "1151246",
 "text": "Giuseppe Peano (August 27, 1858 – April 20, 1932) was an Italian mathematician and language expert. He wrote over 200 books and papers and was a pioneer in mathematical logic and set theory. He introduced important symbols still used in math today and created the Peano axioms, which describe natural numbers. He also worked on mathematical induction, a key tool in proving mathematical statements. Most of his career was spent teaching at the University of Turin. Peano even invented a simple version of Latin called Latino sine flexione (\"Latin without inflections\"). == Life == === Early life and education === Peano grew up on a farm in Spinetta, a small town in northern Italy. He attended high school in Turin and entered the University of Turin in 1876. He graduated with top honors in 1880 and began working as an assistant at the university, first with Enrico D'Ovidio and later with Angelo Genocchi. When Genocchi’s health declined, Peano began teaching calculus classes himself. In 1884, Peano published his first major book, a calculus textbook called Calcolo differenziale. A few years later, he wrote a book introducing new ideas in mathematical logic, including the first use of symbols for set union and intersection. === Family and career milestones === In 1887, Peano married Carola Crosio, whose father was a famous painter. Around this time, he began teaching at the Royal Military Academy in addition to the university. By 1889, he became a full professor and published the Peano axioms, which formed a solid foundation for understanding natural numbers. In 1890, Peano introduced the Peano curve, the first example of a \"space-filling curve.\" This showed that a one-dimensional line could fill a two-dimensional area, a concept now linked to fractals. He also founded the journal Rivista di Matematica and started the Formulario Project, which aimed to create an encyclopedia of all known mathematical formulas. === Involvement in international mathematics === Peano was active in international conferences. At the First International Congress of Mathematicians in 1897, he presented a paper on mathematical logic. At the second congress in 1900, he met the famous mathematician Bertrand Russell and inspired Russell with his innovative mathematical symbols. === Later work and language projects === By 1901, Peano’s career peaked, and he had made major contributions to logic, calculus, and differential equations. However, his focus shifted heavily to the Formulario Project, and his teaching began to suffer. He was eventually removed from the Royal Military Academy but kept his position at the University of Turin. In 1903, Peano introduced Latino sine flexione, a simplified version of Latin meant to be an international language. He used it in many of his books and speeches. In 1908, he published the final version of his Formulario, containing 4,200 formulas. However, it received little attention because it was outdated by then. === Later years and death === Peano continued teaching and working on educational materials, including a math dictionary. He also promoted auxiliary languages and participated in the international language movement. In 1925, he shifted his focus to a new field called Complementary Mathematics, which better matched his evolving interests. Peano taught at the University of Turin until his death from a heart attack in 1932, the day after his final lecture. == Key contributions == * Developed the Peano axioms for natural numbers. * Introduced important mathematical symbols. * Created Latino sine flexione, a simplified version of Latin. * Pioneered mathematical logic and set theory. * Peano’s work continues to influence mathematics and linguistics today. Category:1858 births Category:1932 deaths Category:People from Cuneo Category:People from the Kingdom of Sardinia Category:Italian mathematicians Category:Italian philosophers Category:Linear algebraists Category:Constructed language creators Category:Linguists from Italy",
 "title": "Giuseppe Peano"
}