{
 "id": "1151205",
 "text": "Louis Couturat (born January 17, 1868 – died August 3, 1914) was a French thinker who worked on logic, mathematics, philosophy, and languages. He is best known for helping create the planned language Ido. == Life == === Early life and education === Couturat was born in Paris. In 1887, he began studying philosophy and mathematics at a top school in France, the École normale supérieure. Later, he taught philosophy at the University of Toulouse (1895) and the University of Caen Normandy (1897). There, he supported the use of transfinite numbers, which are a type of math dealing with infinity. He also studied the writings of the famous philosopher Gottfried Wilhelm Leibniz in Hanover, Germany. In 1905, he became an assistant to Henri-Louis Bergson, a well-known philosopher, at the Collège de France. === Career Highlights === Couturat promoted symbolic logic, a system that uses symbols to express logical ideas. This field grew before World War I, influenced by thinkers like Charles Sanders Peirce, Giuseppe Peano, and Bertrand Russell (a close friend of Couturat). Couturat believed symbolic logic could improve both math and the philosophy of math. He disagreed with Henri Poincaré, who criticized his views. Couturat’s ideas aligned with Russell's logicism, while Poincaré leaned towards intuitionism, a different approach to math. === The Ido Language === In 1907, Couturat helped create Ido, a new language inspired by Esperanto. He believed it should be a logical and easy-to-learn international language. Ido borrowed words from European languages and followed ideas similar to Leibniz’s dream of a universal symbolic language. === Death === Couturat was a strong believer in peace. Tragically, he died in a car accident when his car collided with another carrying urgent military orders at the start of World War I. == His writings == * 1896: De Platonicis mythis Thesim Facultati Litterarum Parisiensi proponebat Ludovicus Couturat, Scholae Normalae olim alumnus. Parisiis: Felix Alcan Bibliopola. 120 p. * 1896: De l'Infini mathématique. Republished 1975, Georg Olms. * 1901: La Logique de Leibniz. Republished 1961, Georg Olms. Donald Rutherford's English translation in progress. * 1903: Opuscules et Fragments Inédits de Leibniz. Republished 1966, Georg Olms. * 1903: (with Léopold Leau) Histoire de la langue universelle. Paris: Hachette. Republished 2001, Olms. * 1905. Les Principes des Mathématiques: avec un appendice sur la philosophie des mathématiques de Kant. Republished 1965, Georg Olms. * 1905: L'Algèbre de la logique. 1914: P. E. B. Jourdain translator, The Algebra of Logic, Open Court, from Project Gutenberg. * 1906: ¨Pour la langue internationale, Päris * 1907: (with Léopold Leau) Les nouvelles langues internationales. Paris: Hachette, republished 2001, Olms. * 1910: Étude sur la dérivation dans la langue internationale. Paris: Delagrave. 100 p. * 1910: (with Otto Jespersen, R. Lorenz, Wilhelm Ostwald and L.Pfaundler) International Language and Science: Considerations on the Introduction of an International Language into Science, Constable and Company Limited, London. * 1915: (with Louis de Beaufront) Dictionnari Français-Ido. Paris: Chaix, 586 p. == Cultural Impact == Couturat appears as a character in A Curable Romantic, a 2010 novel by Joseph Skibell. == References == == Other websites == * * * Auteur Couturat on French Wikisource * * Category:1868 births Category:1914 deaths Category:People from Ris-Orangis Category:Linguists from France Category:French logicians Category:French mathematicians Category:19th-century French philosophers Category:20th-century French philosophers Category:École Normale Supérieure alumni Category:Ido Category:Constructed language creators Category:Logicians Category:Road incident deaths in France Category:French writers Category:Philosophers of language",
 "title": "Louis Couturat"
}