{
 "id": "1151256",
 "text": "Caroline Agnes Brady (October 3, 1905 – November 5, 1980) was an American expert in languages, known for her studies of Old English and Old Norse literature. She wrote a book called The Legends of Ermanaric in 1943, based on her Ph.D. research, and wrote three important articles about the Anglo-Saxon poem Beowulf. Brady taught at several top universities, including the University of California, Berkeley, the University of Pennsylvania, Johns Hopkins University, and Harvard University. == Life == === Early life and education === Brady was born in Tientsin, China, but she was an American citizen. As a child, she moved around a lot, living in Los Angeles, California; British Columbia, Canada; and Austin, Texas. She studied at the University of California, where she earned her bachelor’s, master’s, and Ph.D. degrees, finishing in 1935. === Career highlights === After completing her Ph.D., Brady became an English instructor at the University of California’s College of Agriculture. From 1941 to 1946, she worked as an assistant professor at UC Berkeley. She then spent three years teaching at the University of Pennsylvania. At the end of 1949, she moved to teach at Central Oregon Community College, but she left a few months later because of health problems. In 1952–53, Brady received a fellowship from the American Association of University Women, known as the Marion Talbot Fellowship. During this time, she published two articles. However, she did not publish any more academic work for 25 years. Her last two articles were released in 1979 and after her death in 1983. === Her work === The Legends of Ermanaric: Brady argued that the Gothic king Ermanaric was part of two different traditions. This earned her praise for her careful and independent research. Critics noted her ability to challenge traditional ideas. Studies on Beowulf: Brady’s three papers on Beowulf were considered important studies of the poem. According to scholar Katherine O'Brien O'Keeffe, Brady’s work explored the detailed meanings of the words used in Beowulf. Brady argued that the poet was a skilled artist who carefully chose words and phrases, not someone simply following formulas or clichés. Brady’s work remains important for understanding Old English literature and Beowulf in particular. == Publications == === Books === * * === Articles === * * * * * * * * * * * * === Reviews === * * * Category:1905 births Category:1980 deaths Category:Educators from Tianjin Category:20th-century American philologists Category:Women philologists Category:University of California, Berkeley faculty Category:University of Pennsylvania faculty Category:University of California, Los Angeles alumni Category:University of California, Berkeley alumni Category:Anglo-Saxon studies scholars Category:Writers from Tianjin Category:American expatriates in China",
 "title": "Caroline Agnes Brady"
}