{
 "id": "1151430",
 "text": "Otto Jespersen (1860–1943) was a Danish linguist who made important contributions to the study of language. He focused on grammar, language history, phonetics (how sounds are used in speech), and language teaching. Jespersen also played a key role in creating international languages and supported language reforms to make communication easier. == Life == === Early Life and Education === Jespersen was born in Denmark and became interested in language at a young age. He studied English, French, and Latin at the University of Copenhagen, where he developed a passion for understanding how languages work and change over time. Later, he became a professor of English grammar at the same university. === Contributions to Linguistics === Jespersen helped develop the modern study of linguistics. His theories included the idea that grammar should describe how people actually use language, not just strict rules. He wrote many books, including The Philosophy of Grammar and Modern English Grammar on Historical Principles, which have influenced the way people study language today. He was also involved in phonetics, studying how people pronounce words and sounds. His work included creating systems like \"Nexus grammar,\" which focuses on the relationship between subjects and actions in sentences. === International Language Projects === Jespersen was interested in creating languages that could help people from different countries communicate. He supported Ido and later designed his own auxiliary language called Novial, which aimed to be simple and easy to learn. == Legacy == Otto Jespersen's work had a lasting impact on linguistics, language education, and constructed languages. His ideas are still studied and used by language researchers and teachers worldwide. == Other websites == * \"Otto Jespersen\", by Niels Haislund, in: Englische Studien 75 (1943), pp. 273–282 (reprinted in: Thomas A. Sebeok, Portraits of Linguists, vol. 2, Bloomington & London: Indiana U.P. 1966 , pp. 148–57). * Otto Jespersen Online Bibliography * Otto Jespersen in University of Warwick ELT Archive * Otto Jespersen in Encyclopædia Britannica Category:1860 births Category:1943 deaths Category:Linguists Category:Ido Category:Alumni of the University of Oxford",
 "title": "Otto Jespersen"
}