{
 "id": "1151753",
 "text": "The Continental Marines were the amphibious infantry of the American Colonies (and later the United States) during the American Revolutionary War. == History == The Continental Congress established the Corps on November 10, 1775, and it was dissolved in 1783. Although their function was multifaceted, their primary responsibility was to defend a ship's captain and his officers as aboard security troops. Marine sharpshooters were positioned on the battle tops of a ship's masts to shoot the enemy's officers, naval gunners, and helmsmen during naval engagements, in addition to serving alongside the ship's crew at the cannons. The initial Marine barracks were in Philadelphia, and Captain Samuel Nicholas was the only commandant of the Continental Marines, having been commissioned on November 28, 1775. Historian Edwin Simmons speculates that it was more likely a tavern run by the Nicholas family, even though folklore placed its earliest recruitment post at Tun Tavern. In June 1776, Robert Mullen, whose mother owned Tun Tavern, was commissioned as a captain and probably utilized it as a recruiting location. During the American Revolution, the US employed Marines to conduct amphibious invasions and raids. On the inaugural tour in the Caribbean, Marines accompanied Commodore Esek Hopkins of the Continental Navy's first squadron. To seize naval supplies from the British, they made two landings in Nassau, Bahamas. The squadron took four tiny prize ships and sailed back to Rhode Island. On April 8, 1776, the squadron returned with four injured and seven dead marines. == Timeline == ; 1775, October 13 : Second Continental Congress convenes and directs the acquisition, fitting out, and manning of two vessels for the Continental Navy. Since marines are a normal part of warship's complement, this is the first (albeit indirect) authorization for the enlistment of Continental Marines. ; 1775, November 10 : The Continental Marines are created. ; 1775, December : Five companies of about 300 Marines were raised. While armed, they were not equipped with uniforms. They headed South for the Caribbean where the five companies joined Commodore Esek Hopkins of the Continental Navy's first squadron on its first cruise. ; 1776, March : Nicholas' Marines land on New Providence Island, Bahamas. In 13 days they secure 2 forts, occupy Nassau, control the Government House, seize 88 guns, 16,535 shells and other supplies. Returning from the raid, they encountered a British ship. Marines engaged the ship with muskets and assisted in manning the broadside cannon. Commodore Hopkins ignored his ambitious orders to sweep the southern seas of British ships, and instead raided the Bahamas for gunpowder for Washington's army. Nicholas' Marines made an opposed landing and marched on Nassau Town, on the island of New Providence, seizing shot, shells and cannon. However, a failed attempt at a surprise attack the day before had warned the defenders, who sent off their stock of gunpowder in the night. Sailing back to Rhode Island, the squadron captured four small prize ships. The squadron finally returned on April 8, 1776, with 7 dead Marines (including Lt. John Fitzpatrick), and four wounded. Though Hopkins was disgraced for failing to obey orders, Nicholas was promoted to major on June 25 and tasked with raising 4 new companies of Marines for 4 new frigates then under construction. Among the newly commissioned Marines was Captain Robert Mullan. ; 1776, April : John Martin's enlistment to serve on in Philadelphia in April gave him the role as the first black Marine. ; 1776, October : Sergeants William Hamilton and Alexander Neilson become the first recorded Marine mustangs when they are promoted to lieutenant. ; 1776, December : Marines were tasked to join Washington's army at Trenton to slow the progress of British troops southward through New Jersey. Unsure what to do with the Marines, Washington added the Marines to a brigade of Philadelphia militia, also dressed in green. Though they were unable to arrive in time to affect the battle of Trenton, they assisted in the decisive American victory at Princeton. Later that spring, Washington incorporated some of the Marines into artillery units of his reorganized Army. ; 1778, January : A Marine detachment sails down the Mississippi River and secures New Orleans to keep British traders out. Continental Marines landed and captured Nautilus Island and the Majabagaduce peninsula in the Penobscot Expedition. A group under Navy Captain James Willing left Pittsburgh, traveled down the Ohio and Mississippi Rivers, captured a ship and in conjunction with other Continental Marines brought by ship from the Gulf of Mexico raided British Loyalists on the shore of Lake Pontchartrain. ; 1785, June : After the end of the American Revolutionary War (January 1783), the Alliance is sold. The last official act of the Continental Marines was to escort a stash of French silver crowns on loan from Louis XVI, from Boston to Philadelphia, to enable the opening of the Bank of North America. The Continental Marines and the Continental Navy are disbanded. == Continental Marine uniforms == The uniform requirements for the Continental Marines were released by the Naval Committee on September 5, 1776. These regulations called for green coats with white facings (coat lining, lapels, and cuffs) and a leather high collar to keep a man's head upright and prevent cutlass slashes. The nickname \"Leatherneck\" and the high collar on Marine dress uniforms serve to maintain its remembrance. == References == == Sources == * United States Marine Corps, Report on Marine Corps Duplication of Effort between Army and Navy December 17, 1932. Contains a very detailed account of almost all the actions of the Continental Marines and USMC until 1932. It is available in scanned TIFF format from the archives of the Marine Corps University. * George E. Buker, The Penobscot Expedition: Commodore Saltonstall and the Massachusetts Conspiracy of 1779, Naval Institute Press, 2002. Category:American Revolutionary War Category:1775 establishments in the Thirteen Colonies",
 "title": "Continental Marines"
}