{
 "id": "1151293",
 "text": "F.C. Dynamo-2 Kyiv is former reserve team Dynamo Kyiv, formed in 1946 on the basis of \"Dynamo\" children's and youth school, which at that time was managed by Mykola Fominykh. Since 1965, she has played in competitions among masters and in the USSR championships for backup teams. From 1992 to 2016, she played under the name Dynamo-2 in the First League of Ukraine. == History == === Soviet period === Held the first official match in 1946. Until 1965, it played in the city championship, in 1950-1951 and 1956-1959 also in the championship of the Ukrainian SSR, but the team played in the final tournaments without much success. On April 11, 1965, in Ivano-Frankivsk, Kyiv's Dynamo-2 made its debut in Class B of the USSR championship, losing 0-3. That year, Dynamo-2 took 13th place among 16 teams. The team's top scorers: Pavlo Bohodelov - 9, M. Buznytskyi - 6 goals. === Ukrainian period === A new revival of the team took place in 1992, when Dynamo-2 was included in the competition of the first national championship of Ukraine among the teams of the first league. Kyiv took 7th place in Group A. The first success came to Kyiv in the 1996/97 season, when Dynamo won silver medals in the championship, and Kyiv forward Oleksii Antiukhin became the championship's top scorer. At the end of the season, Dynamo won a ticket to the top league, as the regulations of the time did not prohibit it, but common sense prevailed and Mariupol's Metalurg, which was the third prize-winner of the championship that season, joined the top league. The following season, Dynamo-2 repeated their success, and in the 1998/99, 1999/2000, and 2000/01 seasons they won the first league. The team's successes since the second half of the 1990s are primarily due to the specifics of the regulations. For quite a long time, it allowed the first-team players to play in the form of the second team, and sometimes even the club's third team, which caused fair complaints from other competitors. Be that as it may, F.C. Dynamo-2 Kyiv became three-time champions of Ukraine: Viacheslav Kernozenko, Oleksandr Radchenko, Oleh Venglinskyi, Andrii Nesmachnyi, Serhii Konovalov, Serhii Fedorov, Vasyl Kardash, Oleksii Herasymenko, Volodymyr Yezerskyi, Serhii Serebrennykov, Dmytro Mykhailenko, Artem Yashkin, Vitalii Lysytskyi. All of them were members of the Ukrainian national team, while Gerasimenko was a member of the Russian national team. In 2004, the PFL finally decided to impose certain restrictions on the exchange of players between clubs. At first, a “base” was allowed to delegate a maximum of four players to a subsidiary team, and starting in 2005, after the introduction of double-team competitions, football officials allowed movement in only one direction - from the bottom up. In Ukrainian Cup, F.C. Dynamo-2 Kyiv players played 19 matches: 6 wins, 6 draws, 7 losses, goal difference 28-32. In 2016, the team stopped existing. == Records == * Serhii Fedorov played the most matches in Kyiv — 191 match, Artem Butenin — 171, Oleg Venglinskyi — 168, Vyacheslav Kernozenko — 164, Dmytro Kushnirov — 142.АЛЕКСАНДР АЛИЕВ — ЮБИЛЕЙНЫЙ МАТЧ В ПЕРВОЙ ЛИГЕ! * The best scorers of the team: Oleg Venglinskyi — 64 goals, Oleksandr Aliyev — 53, Andriy Husin — 36, Vitaly Samoilov — 35, Dmytro Vorobei — 33, Oleksandr Kosyrin — 28, Andriy Zavyalov — 25, Dmytro Mykhaylenko — 22, Ihor Kostyuk — 22, Oleksiy Antyukhin — 22, Serhii Serebrennikov — 21 balls. * Record holder for the season: Oleksiy Antyukhin — 22 goals (1996/97). * The best scorers in the Cup of Ukraine: Andriy Shevchenko — 5, Viktor Belkin — 3 balls. * The best performance in the Cup of Ukraine: reaching the 1/8 finals, where they lost to Shakhtar Donetsk — 0:2 in extra time (1995/96). * In the Cup of Ukraine: the biggest victory over \"Dnipro \"Dnipropetrovsk\" with a score of 3:1; the biggest defeat over Odesa \"Chornomorets\" — 0:4. * In the first league of Ukraine: == Achievements == Winner of Ukrainian First League: 1998/99, 1999/2000 and 2000/01 == References == Category:Ukrainian football clubs Category:Organizations based in Kyiv Category:1946 establishments in Europe Category:1940s establishments in Ukraine",
 "title": "F.C. Dynamo-2 Kyiv"
}