{
 "id": "1151827",
 "text": "Medieval Estonia spans the period from the 13th century to the mid-16th century, when the territory was part of Livonia. This era began with the Northern Crusades, during which Estonia was subjugated by foreign powers, including the Danish Kingdom, the Livonian Order, and various bishoprics. == Northern Crusades and Conquest == In the early 13th century, Estonia was invaded during the Northern Crusades. Local Estonians fiercely resisted but faced superior military forces and lacked centralized leadership. Key events include: * The Battle of Lyndanisse (1219), where Danish forces, led by Valdemar II, established control over northern Estonia, founding Tallinn (then called Reval). * In 1227, the Livonian Order conquered the islands of Saaremaa and Hiiumaa, completing the subjugation of Estonian lands. By 1238, Estonia was divided among the Danish crown, the Livonian Order, and various bishoprics under the Terra Mariana confederation. == Livonian Confederation == From the 13th century to 1561, Estonia was part of Livonia, a confederation comprising: * The Livonian Order, * The Archbishopric of Riga, * Bishoprics such as Dorpat (modern Tartu) and Oesel-Wiek. This governance system combined military, religious, and feudal authority, heavily influenced by Germanic knights and clergy. == Social and economic changes == Under foreign rule, Estonians became serfs, with limited rights. German-speaking elites dominated the social and political systems. Key economic activities included agriculture and trade through the Hanseatic League, with Tallinn serving as a vital port. == Rebellions and decline == Local uprisings, such as the St. George's Night Uprising (1343–1345), showcased Estonian resistance to feudal oppression, but they were ultimately unsuccessful. By the mid-16th century, internal conflicts and external pressures, including the Livonian War, weakened the region, leading to its eventual partition among neighboring powers. == Legacy == The medieval period shaped Estonia’s linguistic, cultural, and social structures. Many medieval castles, churches, and towns, particularly in Tallinn, remain as historical landmarks today. Category:History of Estonia Category:13th-century conflicts",
 "title": "Medieval Estonia"
}