{
 "id": "1151142",
 "text": "The Harbour School (THS) is an international school located in Ap Lei Chau, Hong Kong. Founded in 2007, the school teaches students from kindergarten to high school. It follows the American curriculum and serves over 300 students from more than 25 nationalities. == History == The Harbour School started in 2007 with 7 students in Kennedy Town. By 2009, it moved to a larger campus with 75 students. In 2013, the school was accredited by the Western Association of Schools and Colleges. The first Ap Lei Chau campus, \"The Garden\", opened in 2015 with 14 classrooms. In 2017, a second campus called \"The Grove\" was opened. In 2021, THS won awards for Best School - Humanities and Social Studies, and Best Technology Program. In 2022, it won the ISC International School Awards for Best Teaching and Learning. In 2024, THS partnered with Ocean Park Conservation Foundation Hong Kong to promote sustainability education. == Curriculum == The school follows the American Common Core curriculum. It offers an experiential learning approach and programs like the Advanced Placement (AP) for high school students. Students graduate with a U.S. high school diploma. The Social Impact and Sustainability Program (SISP) focuses on the Sustainable Development Goals and provides service-learning opportunities. == Facilities == The Harbour School operates two campuses in Ap Lei Chau: * The Garden – This campus serves high school students and is equipped to meet their educational needs. * The Grove – A 6,000m² facility designed to support the school's interdisciplinary and experiential learning approach. It includes: Marine Science Centre: A dedicated facility focusing on ocean literacy and marine science education. The Foundry: A maker space that encourages hands-on learning and creativity. Black Dolphin: A sailboat used as part of the marine science program, providing students with practical, real-world experiences. In addition, the school is undertaking the e.a.r.t.h. project (Eco, Art & Culture, Revitalisation, Technology, and Heritage) in partnership with the Tai Tam Tuk Raw Water Pumping Station Staff Quarters Compound. This project aims to: * Establish a school for nature-based early childhood education. * Provide teacher training programs focused on sustainability education. * Offer after- school experiential learning programs for children. The e.a.r.t.h. project is expected to be completed by 2028 and will provide approximately 150 places for children aged 3–8 (from PN to K3). == References == Category:Schools in Hong Kong Category:Buildings and structures in Hong Kong",
 "title": "The Harbour School"
}