{
 "id": "1151042",
 "text": "Beyond-armour effect is a term coined by Försvarets Fabriksverk (FFV), a semi- governmental Swedish defense firm, while developing the AT4 anti-tank weapon. The expression is now essentially common place in contemporary military jargon.Hewish, Mark \"FFV's Lightweight AT4, first of a new family of Swedish anti-armour weapons\", International Defense Review, 5/1982, p. 70Not to be confused with Behind-the-armor effect or After-armour effect which is a term sometimes used to describe the effects of armour piercing shells fired by tanks, antitank cannons and naval warships that have a small high explosive charge in the rear of the projectile that explodes after penetrating the armour plating == History == Almost all armies began using man-portable antitank weapons with shaped charge warheads, or HEAT bullets as they are more widely known today, during World War II. The benefit of these warheads is that they are unaffected by the velocity of the projectile. They break through armor by detonating an explosive charge that is attached to a cone-shaped or, more accurately, ogive-shaped liner.(solid shot AP projectiles also strike other items inside the vehicle and transfer very large amounts of kinetic energy to the object(s) struck) Shaped charge warheads have the drawback of having a deeper ogive-shaped liner, which allows the warhead to penetrate more deeply but creates a smaller hole—smaller holes are linked to less damage within armored vehicles than bigger ones.A rule of thumb for infantry antitank weapons is that if a HEAT warhead has to use more than two-thirds of its official penetration capability, it will have less effect on the interior of the vehicle. Several M24 Chaffee light tanks had been dismantled and flown in by France during the siege of Dien Bien Phu in 1954. Only 25.4 mm of armor was the thickest they had. The vintage 2.36-inch American bazooka from World War Two, which was taken from Nationalist Chinese forces and provided by Communist China, served as the primary infantry antitank weapon for the Viet Minh. The French used the M24 to back their men in counterattacks during the siege. Portable rocket launchers were far from perfect tank-killers, as one Chaffee fought on after taking seven hits from 2.36-inch bazookas.John Keegan, \"Dien Bien Phu\", page 110, Ballantine Books, 1974 The U.S. Army also discovered that in combat, with rare exceptions, more than one hit by the M72 LAW rocket was required to disable or kill the North Vietnamese PT-76 light tank.William R. Phillips, Night of the Silver Stars, pg 80, Naval Institute Press, 1997 == References and notes == Category:Explosives",
 "title": "Beyond-armour effect"
}