{
 "id": "1151464",
 "text": "The Buick Velite 6 (Chinese: 微蓝) is a compact station wagon or \"multi-activity vehicle\" (MAV) produced by SAIC-GM under the Buick brand, exclusively sold in China. The Velite 6 is offered in both electric vehicle (EV) and plug-in hybrid (PHEV) variants, providing a range of options. ==History== The Buick Velite 6 was first previewed with the Velite concept car in 2016. Production models were unveiled in April 2018, including both an electric and a plug-in hybrid variant. The car officially debuted at the 2019 Shanghai Auto Show. Initially available only as an all-electric vehicle with two battery size options, the plug-in hybrid version was launched in July 2020. The Velite 6 has been available in three trim levels: Entry, Middle, and Luxury, and it features three driving modes: standard, sport, and economy. Additionally, it has three levels of energy regeneration for varying driving needs. ==Resources== The Velite 6 is powered by either a 1.5L gasoline engine (PHEV) or electric motors, with power outputs ranging from 85 kW (114 hp) to 130 kW (174 hp). The battery options vary by model: the PHEV version comes with a 9.5 kWh battery, while the electric-only versions have 35 kWh (standard), 52.5 kWh (Plus), or 61.1 kWh (EV) batteries. The range depends on the model, with the EV offering up to 518 km (322 mi) on a full charge, while the PHEV version can travel 60 km (37 mi) electrically, with a total range of 780 km (480 mi). The charging time for the Velite 6 varies: AC charging takes 6–8 hours, while DC fast charging can replenish the battery to 80% in approximately 40 minutes. ===Velite 6 Plus and Velite 6 EV=== The Velite 6 Plus was introduced in October 2019 with a larger 52.5 kWh battery and a range of 410 km (250 mi) on the NEDC cycle. It offers 110 kW (148 hp) of power and 350 N⋅m of torque. In November 2021, Buick introduced the Velite 6 EV, which further upgraded the battery to 61.1 kWh, increasing the range to 518 km (322 mi). The updated model features a more powerful 130 kW (174 hp) motor, an updated eConnect infotainment system, and a redesigned front grille and bumper. ==Powertrain== PHEV version: Combines a 1.5L gasoline engine with an 80 kW electric motor, offering 135 kW (181 hp) total power. It has a 9.5 kWh battery with an electric-only range of 60 km (37 mi). Electric version: Offers a choice of 35 kWh, 52.5 kWh, or 61.1 kWh battery packs, depending on the variant, with ranges between 301 km (187 mi) to 518 km (322 mi). ==References== Velite 6",
 "title": "Buick Velite 6"
}