{
 "id": "1151797",
 "text": "Black Hebrew Israelites (BHI) is a movement founded on the pseudoscientific belief that African Americans are the \"real descendants\" of ancient Israelites.* * * * * Some factions of the movement also see Native and non- white Latino Americans as the descendants of ancient Israelites. ==Overview== ===1990s=== A 1999 FBI terrorism risk assessment report found that \"violent radical fringe members\" of the Black Hebrew Israelite movement hold \"beliefs bear[ing] a striking resemblance to the Christian Identity * * * * * theology practiced by many white supremacists\". The assessment concluded that \"the overwhelming majority of [Black Hebrew Israelites] are unlikely to engage in violence.\" ===2000s=== In 2008, American civil rights group Southern Poverty Law Center (SPLC) published the findings that \"the extremist fringe of the Hebrew Israelite movement\" has a Black supremacist outlook. Those classified as Black supremacist include but not limited to the Israelite School of Universal Practical Knowledge, the Nation of Yahweh and the Israelite Church of God in Jesus Christ. ===2010s=== As of December 2019, 144 Black Hebrew Israelite organizations have been classified hate groups due to their antisemitism and anti-white beliefs\". ==Extremism== Alberta Williams King, the mother of Martin Luther King Jr., was shot and killed on June 30, 1974 at the age 69 by Marcus Wayne Chenault, a 23-year-old Black man from Ohio subscribed to the theology of a BHI preacher called Hananiah E. Israel of Cincinnati. The assassin had reportedly shown interest in a group called the \"Hebrew Pentecostal Church of the Living God\". Israel, Chenault's mentor, castigated Black civil rights activists and Black church leaders as being evil and deceptive, but claimed in interviews not to have advocated violence. Chenault did not draw any such distinction, and first decided to assassinate Rev. Jesse Jackson in Chicago, but canceled the plan at the last minute. The BHI have also been involved in domestic terrorism towards American Jews since the 1970s, the most recent of which include but not limited to the 2019 Jersey City shooting (7 dead and 3 injured) and the Monsey Hanukkah stabbing (1 dead and 4 injured). * * * * * * ===Motivations=== Experts believe that those attacks are motivated by their belief in antisemitic conspiracy theories, * * * * * such as \"Jews ran the Atlantic slave trade\" and \"European Jews descended from the Khazars\", which are shared by the Nation of Islam (NOI), a prominent Black nationalist group led by Louis Farrakhan. ===BHI and NOI: common beliefs about Jews=== In an article, historian Dr. Eunice G. Pollack outlined their common beliefs about Jews held by the BHI and NOI: * Judaism is a \"dirty religion\" * All Jews are \"imposter Jews\" * Jews \"ran the Atlantic slave trade\" * European Jews \"descended from the Khazars\" * Black Americans are the \"real Jews\", who \"cannot be antisemitic\" towards \"themselves\" no matter what they think about Jews ===BHI and NOI: differences in beliefs about Jews=== Name Beliefs Black Hebrew Israelites (BHI) * Jesus was Black rather than Jewish * Black people are the \"real chosen people\" * Judaism was \"invented by KenitesDescendants of Cain. 2,000 years ago\" * Jews \"infiltrated the Levite tribe\" to \"rewrite the Torah\" for \"creating pagan converts\" * Jews \"stole the identity of the BHI to serve Satan\" Nation of Islam (NOI) * Jews are \"servants of Satan\" * Islam is the \"real Judaism\" * Jews \"originated from Europe 4,000 years ago\" * Jews \"changed the Torah\" to \"justify the enslavement of Black people\" ==Overall influence== Both the BHI and NOI have a considerable level of popularity among Black Americans, * Lappin, Shalom (2006), ‘How Class Disappeared from Western Politics’, Dissent, Vol. 51, No. 1, pp. 73-78. * * * * Kirsch, Adam (2024), On Settler Colonialism: Ideology, Violence, and Justice, W.W. Norton and Company, New York and London. * * * * * * which contributed to the mainstreaming of those antisemitic conspiracy theories, or antisemitic tropes, among the broader community and academics. In American society, such antisemitic tropes were normalized over the decades and engendered a form of new antisemitism, where Jews are accused of being the \"beneficiaries\" of \"White privilege\" that \"controlled\" Western governments to \"support Israel at the expense of Palestinians\" and \"colonise oppressed peoples\". * * * * * As per a 2016 ADL survey, 23% Black Americans held negative beliefs about Jews, while a 2023 survey reportedly showed that one- eighth of Black Americans doubted whether the Holocaust really happened. ==Academic criticism== Fran Markowitz, a professor of cultural anthropology at the Ben-Gurion University of the Negev, wrote that the BHI's view on the African slave trade conflicts with historical accounts, as does the BHI's belief that Socrates and William Shakespeare were black. Most BHI factions were classified as hate groups by at least two civil rights groups, including but not limited to the SPLC and Anti-Defamation League (ADL). The ADL noted, On the other hand, political observer Ralph Lenoard further analyzed the BHI, ===Antisemitic factions=== Antisemitic BHI factions include the Israelite School of Universal Practical Knowledge (ISUPK), House of Israel (HOI), Nation of Yahweh (NOY), Israelites Saints of Christ, True Nation Israelite Congregation and The Israelite Church of God in Jesus Christ (ICGJC). ===Antisemitic slurs=== The ADL documented some antisemitic slurs used by the BHI: ==Related pages== * The Holocaust * Supersessionism * Cultural appropriation ==References== Category:Cults Category:Racism Category:Terrorism Category:Religions Category:Neo-Nazism Category:Antisemitism Category:United States Category:Social movements Category:20th century in the United States Category:21st century in the United States Category:20th-century establishments in the United States",
 "title": "Black Hebrew Israelites"
}