{
 "id": "1151459",
 "text": "The Huawei Mate 40, Huawei Mate 40 Pro, Huawei Mate 40 Pro Plus and Huawei Mate 40 RS Porsche Design are high-end Android smartphones by Chinese company huawei. It is run EMUI 11 with skin of Android 10 for the first time and runs new operating system to EMUI 13 with skin of Android 12. All the Huawei Mate 40 Series were launched on October 22, 2020, at the Huawei Online Event Launch. ==Specification== ===Hardware=== ====Battery and Charging==== All Huawei Mate 40 Series comes with the 90W wired charger, 44W wireless charger, and 5W Reverse Wireless charger. Huawei Mate 40 has a 4200 mAh battery capacity and Huawei Mate 40 Pro and Huawei Mate 40 Pro Plus 4400 mAh battery capacity. ====Performance==== Huawei Mate 40 Pro uses HiSilicon Kirin 9000 chipset. All Huawei Mate 40 Series has zero lag, stutters, or hangs. ====Memory==== In terms of storage, Huawei Mate 40 has 128GB or 256GB, While Huawei Mate 40 Pro and 40 Pro Plus have 256GB and Huawei Mate 40 Pro RS Porsche Design has 512 GB. In June 2022, Huawei Mate 40 Series storage up to 512GB. Huawei Mate 40, 40 Pro and 40 Pro Plus gets 8GB RAM, while Huawei Mate 40 RS Porsche Design and Huawei Mate 40 Plus gets 12GB RAM. ====Camera and video recording==== Huawei Mate 40 Pro has a camera, for main camera: 50 MP, for ultrawide camera of 20 MP, telephoto camera of 12 MP, and video recording is 4K@30/60FPS. for sefile camera it has a 13 MP and 4K@30/60FPS. All Huawei Mate 40 Series have a camera. ====Screen==== Huawei Mate 40 has a 6.5 inch FHD+ OLED 90Hz refresh rate screen, While Huawei Mate 40 Pro has a 6.76 inch OLED 90Hz refresh rate screen and Huawei Mate 40 Pro Plus has a 6.76 inch OLED 90Hz refresh rate screen. ====Connectivity==== Huawei Mate 40 Pro Plus had Network including GSM, HSPA and LTE. And Connectivity 5G, Bluetooth 5.2, WiFi 6 Plus and NFC, While Huawei Mate 40 Pro supports Network including GSM, HSPA and LTE and Connectivity 5G, Bluetooth 5.2, WiFi 6 Plus and NFC and Huawei Mate 40 had Network including GSM, HSPA and LTE and Connectivity 5G, Bluetooth 5.2, WiFi 6 Plus, and NFC. ===Software=== All the Huawei Mate 40 Series ran EMUI 11 with skin of Android 10. Due to U.S. government regulations that restricted Google services in 2019, these devices do not come with Google Services globally. Instead, Huawei Mobile Services can switched to the Google Services in 2019, Huawei AppGallery serves as the main app store for the Huawei Mate 40 Series. Huawei Mate 40 Series run new operating System to Harmony OS 2.0 in China. The Huawei Mate 40 Series runs new operating system to EMUI 13 In the worldwide. ==References== ==Other websites== * Mate 40 * Mate 40 Pro * Mate 40 Pro+ * Mate 40 Porsche Design Category:Android smartphones Category:Mobile phones introduced in 2020 Category:Mobile phones with multiple rear cameras Category:Mobile phones with 4K video recording Category:Huawei mobile phones",
 "title": "Huawei Mate 40"
}