{
 "id": "1151372",
 "text": "Jamieson Lee Greer (born March 4, 1979) is an American trade official, lawyer and politician who has been the 20th United States Trade Representative since 2025. He is a partner in international trade at King & Spalding. He was the chief of staff to Trade Representative Robert Lighthizer from 2017 to 2021. In November 2024, Greer was nominated by President-elect Donald Trump to be the United States Trade Representative under his second administration. He was confirmed by the U.S. Senate in February 2025. ==Early life== Greer graduated from Paradise High School in Paradise, California, in 1998. He spent two years on mission in Brussels. He studied at Brigham Young University. He later went to the University of Virginia School of Law. Greer served in the United States Air Force Judge Advocate General's Corps. He served in Kansas and Turkey. He was sent to Iraq where he was chief of military justice. ==Career== Greer worked in private law firms focusing in trade law, including Skadden, Arps, Slate, Meagher & Flom LLP. He represented U.S. Steel in a lawsuit against China. He is a partner in international trade at King & Spalding. During the first administration of Donald Trump, Greer was the chief of staff to trade representative Robert Lighthizer between 2017 and 2021. ==U.S. Trade Representative== On November 26, 2024, President-elect Donald Trump named Greer as his United States trade representative for his second administration. The Senate Committee on Finance voted 15–12 to approve his nomination on February 12, 2025 for a full Senate vote. His nomination was confirmed by the U.S. Senate on February 26 with a 56 to 43 vote. He is the first Mormon Cabinet-level official since Mike Leavitt served as Secretary of Health and Human Services in 2009. ==References== ==Other websites== Category:Living people Category:Lawyers from California Category:Politicians from California Category:Lawyers from Washington, D.C. Category:Politicians from Washington, D.C. Category:Republican Party (United States) politicians Category:Politicians from Maryland Category:Lawyers from Maryland Category:1979 births",
 "title": "Jamieson Greer"
}