{
 "id": "1151891",
 "text": "The historical maps of Stockholm and its surroundings date back to the early 17th century, showcasing the city's evolution through time. The earliest known map, from the 1620s, depicts Stockholm before major urban regulations were implemented. Over the centuries, cartography became essential for urban planning and military strategy in Sweden, especially during the country's era as a great power.Cultural Heritage Maps of Stockholm. City of Stockholm. Retrieved November 28, 2024. == Notable maps == * Ambrosius Thomas’ Spy Map (1564): Created for military purposes, this early map documented Stockholm’s surroundings during the Northern Seven Years’ War. Although not entirely accurate, it helped outline the region’s geography for strategic planning.Pålsundet: Arkeologiska studier av en sörmländsk kustmiljö, s. 17–18, läst 2011-06-11. * Petrus Tillaeus’ Map (1733): This was Stockholm’s first printed map, featuring street names and a more structured depiction of the city's layout. It served as an official reference for urban development during the 18th century.Historical Maps at Riksarkivet. National Archives of Sweden. Retrieved November 28, 2024. * Gripenhielms Mälarkarta (1689): This map, ordered by King Charles XI, presented a highly detailed view of Lake Mälaren and Stockholm. It combined cartographic precision with artistic elements, such as illustrations of landmarks, making it one of Sweden’s most celebrated historical maps.Maps of Stockholm. Stockholm Visitors Board. Retrieved November 28, 2024. * Lundgren’s Map (1885): Considered one of Stockholm’s first modern maps, this work highlighted both existing and future urban planning projects. It provided insights into how the city would evolve while preserving its historical context. == Urban development == The maps reflect significant transformations in Stockholm’s landscape, including the extensive urban planning of Norrmalm and the preservation of medieval street patterns in Södermalm. They also document major architectural changes, such as the construction of public buildings and the development of transportation networks. Cultural and Practical Use These historical maps are now preserved in institutions like the Royal Library of Sweden and are studied for their artistic, historical, and urban significance. They provide insights into Stockholm's changing geography and the cartographic advancements of their respective periods. == References == Category:Stockholm Category:Cartography Category:Urban planning",
 "title": "Historical maps of Stockholm"
}