{
 "id": "1151805",
 "text": "Mantis is a character in the Marvel Cinematic Universe (MCU), portrayed by actress Pom Klementieff. Based on the Marvel Comics character of the same name, she first appears in Guardians of the Galaxy Vol. 2, which was released in 2017. Mantis is presented as a member of the Guardians of the Galaxy, and her character has a unique ability to sense and manipulate the emotions of others, which plays a significant role in various interactions throughout the film. == Fictional character biography == Mantis is introduced as a servant of Ego the Living Planet, who is actually a villain in the story. She eventually joins Star-Lord (Chris Pratt), Gamora (Zoe Saldaña), Drax (Dave Bautista) , Rocket (Bradley Cooper), and Groot (Vin Diesel) in their quest to confront Ego. Mantis' empathic abilities allow her to help the Guardians, particularly in handling Ego and the emotional turmoil surrounding the group. Mantis has a distinct appearance, characterized by her green skin, antennae, and a unique fighting style that combines her combat proficiency with her empathetic powers. Following her debut in Guardians of the Galaxy Vol. 2, she also appears in Avengers: Infinity War (2018) and Avengers: Endgame (2019), where her powers contribute to the team's efforts against Thanos. == Reception == The character has been well-received by fans, thanks in part to Klementieff's performance, which brings a mix of humor, innocence, and strength to Mantis. In the upcoming projects, she is expected to continue her journey within the MCU, contributing to the overall narrative established by the Guardians and the larger universe. == Appearances == === Movie appearances === Year Movie Portrayed by 2017 Guardians of the Galaxy Vol. 2 Pom Klementieff 2018 Avengers: Infinity War 2019 Avengers: Endgame 2022 Thor: Love and Thunder 2023 Guardians of the Galaxy Vol. 3 === Television appearances === Year Television series and specials Portrayed by 2022 The Guardians of the Galaxy Holiday Special Pom Klementieff Category:Marvel Cinematic Universe characters Category:Marvel Comics movie characters",
 "title": "Mantis (Marvel Cinematic Universe)"
}