{
 "id": "1152197",
 "text": "Princess Angela of Liechtenstein, Countess of Rietberg (born Angela Gisela Brown; February 3, 1958) is a Panamanian-American fashion designer and member of the Liechtenstein royal family. She became the first woman of African descent to marry into a European royal family. She married Prince Maximilian of Liechtenstein in January 2000 and the couple has a son, Prince Alfons. == Biography == === Early life and education === Angela Gisela Brown was born on February 3, 1958, in Bocas Town, Bocas del Toro, Panama, to Javier Francisco Brown and Silvia Maritza Burke. Her father is a businessman while her mother is a homemaker. Brown and her family moved to New York City, when she was five years old. After high school, Brown studied fashion at Parsons School of Design, where she received the Oscar de la Renta Gold Thimble Award and graduated in 1980. She was a stylist for three years, the partnered with a firm in Hong Kong to create her own fashion label named \"A. Brown\". She became a creative director for the fashion brand Adrienne Vittadini until September 1999. === Marriage and family === Brown met Prince Maximilian of Liechtenstein, the second son of Hans-Adam II, Prince of Liechtenstein, at a private party in New York in 1997. In 1999, the engagement was officially announced of Prince Maximilian to Brown. She married Prince Maximilian civilly on January 21, 2000, in Vaduz, Liechtenstein. A week later, she married him religiously on January 29, 2000, at the Church of St. Vincent Ferrer in New York City. She wore a wedding dress that she designed herself and a tiara, an heirloom kept inside the House of Liechtenstein since 1870. The couple has one son named Prince Alfons, who was born in May 2001, in the United Kingdom. == Countess of Rietberg == Since her marriage, Princess Angela participates in ceremonial events often with her son. In 2006, she and her husband attended the wedding of Countess Elisabeth d'Udekem d'Acoz, the sister of Queen Mathilde of Belgium and Margrave Alfonso Pallavicini. In 2015, she gave an interview about Panama tourism. Angela and her family also spent time in Pedasí, Panama. == Titles and styles == Angela became a princess of Liechtenstein and Countess of Rietberg upon her marriage to Prince Maximilian. She was soon granted the style of Serene Highness. == References == Category:1958 births Category:Living people Category:Panamanian people Category:Liechtenstein-related lists Category:Princesses by marriage",
 "title": "Princess Angela of Liechtenstein"
}