{
 "id": "1152684",
 "text": "The tenth series of the British school drama series Waterloo Road was shown on BBC One, In February it moved to BBC Three. It aired from 15 October 2014 to 9 March 2015. It is the last series to be set at the old Greenock Academy building in Greenock, Scotland. In 2015, BBC announced they were going to stop making Waterloo Road. In 2015, the old Greenock Academy building was demolished, In 2024 the building was replaced with houses. == The series == The show follows the lives of the teachers and the pupils at Waterloo Road, a failing comprehensive school. The school has a lot of problems such as split families, cybercrime, adultery, illiteracy, domestic violence, nervous breakdown, anger management issues, drug overdose, test anxiety, assault, poverty, starvation, photo manipulation, video game addiction, cyberbullying, anorexia nervosa and borderline personality disorder. ==Cast and characters== ===Staff=== * Neil Pearson as Vaughan Fitzgerald; headteacher (20 episodes) * Laura Aikman as Lorna Hutchinson; Deputy headteacher and Science teacher (10 episodes) * Richard Mylan as Simon Lowsley; Deputy Headteacher and English teacher (9 episodes) * Laurie Brett as Christine Mulgrew; Head of English (20 episodes) * Victoria Bush as Sonya Donnegan; School secretary (20 episodes) * Georgie Glen as Audrey McFall; Head of History (20 episodes) * Melanie Hill as Maggie Budgen; Home Economics teacher and Housemistress (20 episodes) * Angus Deayton as George Windsor; Head of Modern Foreign Languages (13 episodes) * Pooky Quesnel as Olga Fitzgerald; Geography teacher (12 episodes) * Vanessa Hehir as Sue Lowsley; Science teacher (10 episodes) * Leon Ockenden as Hector Reid; Head of Physical Education (10 episodes) * Nicola Stephenson as Allie Westbrook; Head of Art (10 episodes) * Regé-Jean Page as Guy Braxton; Trainee teacher in Graphics & Product Design (8 episodes) * Stefano Braschi as Marco D'Olivera; newly qualified teacher in Science (8 episodes) * Zöe Lucker as Carol Barry; Canteen assistant (3 episodes) ===Pupils=== * Max Bowden as Justin Fitzgerald (20 episodes) * Zebb Dempster as Leo Fitzgerald (20 episodes) * Caitlin Gillespie as Lisa Brown (20 episodes) * Joe Slater as Lenny Brown (20 episodes) * Mark Beswick as Darren Hughes (19 episodes) * Rebecca Craven as Rhiannon Salt (19 episodes) * Je'Taime Morgan Hanley as Shaznay Montrose (19 episodes) * Charlotte Beaumont as Kenzie Calhoun (10 episodes) * Leo Flanagan as Floyd Westbrook (10 episodes) * Holly Jack as Bonnie Kincaid (10 episodes) * Tommy Lawrence Knight as Kevin Chalk (10 episodes) * Tahirah Sharif as Carrie Norton (10 episodes) * Andrew Still as Scott Fairchild (10 episodes) * Kane Tomlinson-Weaver as Harley Taylor (10 episodes) * Armin Karim as Abdul Bukhari (9 episodes) * Sammy Oliver as Tiffany Westbrook (9 episodes) * Finlay MacMillan as Dale Jackson (9 episodes) * Naomi Battrick as Gabriella Wark (7 episodes) * Brogan Ellis as Kacey Barry (7 episodes) ===Others=== ====Recurring==== * Ian Aspinall as Hassan Bukhari; Abdul's adoptive father (7 episodes) * Robin Laing as Ronnie Fairchild; Scott's father (5 episodes) * Judith Barker as Grace Drummond; An elderly woman who befriends Darren and Rhiannon (4 episodes) * Nadine Marshall as Steph Norton; Guy and Carrie's mother (4 episodes) * Gareth David-Lloyd as Rob Hutchinson; Lorna's abusive husband (3 episodes) * Nicola Grier as Selina Wilson; Director of the Waterloo Road and Havelock High merger (3 episodes) * Emma Cunniffe as Ailsa Calhoun; Kenzie's mother (2 episodes) * David Michaels as Colin Bond; Headteacher of Havelock High (2 episodes) * Andy Rush as Danny Spencer; Dale's cycling coach (2 episodes) ====Guest==== * Nigel Betts as Ray Stewart; Local shopkeeper (1 episode) * Claire Cage as Sophie Mitchell; Abdul's social worker (1 episode) * Robert Cavanah as Jackson Whittaker; Owner of Wiredata (1 episode) * Nathalie Cox as DI Murray; Detective Inspector investigating the cyberattack on Wiredata (1 episode) * Ayesha Dharker as Yasmeen Khan; Abdul's biological mother (1 episode) * Keeley Forsyth as Sammy Hughes; Darren's mother (1 episode) * Peter F. Gardiner as Mr. Dunbar; Headteacher of Havelock High (1 episode) * Terence Harvey as Ted Black; Grace's former lover (1 episode) * Connie Hyde as Amelia Wark; Gabriella's mother (1 episode) * Nimmy March as Miriam Hurlock; Head of the PTA (1 episode) * Abby Mavers as Dynasty Barry; Ex-pupil (1 episode) * Bobby Rainsbury as Mandy Ruskin; Mental health patient who befriends Leo (1 episode) * Hugh Ross as Mr. Carmichael; Elderly member of the community (1 episode) * Maarten Stevenson as Mickey McArthur; Pupil at Havelock High (1 episode) ==Episodes== Autumn Term No. Title Directed by Written by Original air date Spring Term ==References== Category:2014 British television seasons Category:2015 British television seasons Category:Waterloo Road (TV series)",
 "title": "Waterloo Road (series 10)"
}