{
 "id": "1152121",
 "text": "The origins of Kamianets-Podilskyi are surrounded by historical debate and multiple hypotheses. The city, located in modern-day Ukraine, is notable for its strategic position on the Smotrych River and its historical significance as a fortified settlement. Historians propose several theories about who founded the city and when, with estimates ranging from ancient times to the medieval period. == Key hypotheses == * Dacian-Roman Hypothesis: This theory suggests that the city was established by the Dacians and later fortified by the Romans. Evidence includes references to \"Clepidava,\" a possible ancient name for Kamianets, mentioned in historical texts and a 17th-century engraving depicting the city's fortifications. Critics argue that there is insufficient archaeological evidence to fully support this claim. * Old Rus’ Hypothesis: According to this perspective, Kamianets was founded during the times of Kievan Rus', based on mentions in the Kyiv Chronicle and the Galician- Volhynian Chronicle. Archaeological findings in the Old Town area, including remnants of early medieval fortifications, provide some support for this view. * Lithuanian Hypothesis: Another view attributes the city’s foundation to the rule of the Grand Duchy of Lithuania in the 14th century. This theory highlights architectural features and administrative records from the Lithuanian period, suggesting significant urban development during their control. * Armenian Hypothesis: A less commonly accepted theory posits that Armenian merchants or settlers played a central role in the city's early development. However, this view has been largely dismissed due to a lack of concrete evidence. == Historical context == Kamianets-Podilskyi is first mentioned in historical records from the 12th and 13th centuries, during the rule of Kievan Rus’. The city later became a key administrative and military center under Lithuanian and Polish control, contributing to its complex historical narrative. == Modern significance == Today, Kamianets-Podilskyi is a prominent cultural and architectural landmark. The city's medieval fortress and Old Town are part of the National Historical and Architectural Reserve, recognized for their historical value and well-preserved structures. Category:Hypotheses Category:History of Kamianets-Podilskyi Category:Chronology by city",
 "title": "Hypotheses on the Founding of Kamianets-Podilskyi"
}