{
 "id": "1152676",
 "text": "The third series of the British school drama series Waterloo Road was shown on BBC One, It was shown from 11 October 2007 to 13 March 2008.. == The series == The show follows the lives of the teachers and the pupils at Waterloo Road, a failing comprehensive school. The school has a lot of problems such as death, running away from home, prostitution, child grooming, HIV/AIDS, child abuse, homosexuality, Asperger syndrome, deportation, activism, blackmail, plagiarism and assault. ==Cast and characters== ===Staff=== * Jason Merrells as Jack Rimmer; headteacher (7 episodes) * Neil Morrissey as Eddie Lawson; Deputy headteacher and Maths teacher (20 episodes) * Jason Done as Tom Clarkson; Head of Pastoral Care and English teacher (20 episodes) * Philip Martin Brown as Grantly Budgen; Head of English (20 episodes) * Christine Tremarco as Davina Shackleton; Teaching Assistant (19 episodes) * Shabana Bakhsh as Jasmine Koreshi; English teacher (19 episodes) * Chris Geere as Matt Wilding; Head of Music and Drama (18 episodes) * Denise Welch as Steph Haydock; Head of French (18 episodes) * Jacqueline Kington as Bridget Morley; School secretary (16 episodes) * Eva Pope as Rachel Mason; Jack’s replacement as headteacher (14 episodes) * Kay Purcell as Candice Smilie; Senior Canteen Assistant (9 episodes) * Craig Fitzpatrick as Lewis Seddon; Canteen Assistant (8 episodes) ===Pupils=== * Lauren Drummond as Mika Grainger (20 episodes) * Katie Griffiths as Chlo Grainger (19 episodes) * Tachia Newall as Bolton Smilie (19 episodes) * Tom Payne as Brett Aspinall (17 episodes) * Lauren Thomas as Aleesha Dillon (17 episodes) * Lucy Dixon as Danielle Harker (17 episodes) * Adam Thomas as Donte Charles (16 episodes) * Chelsee Healey as Janeece Bryant (16 episodes) * Ellie Paskell as Maxine Barlow (16 episodes) * Jessica Baglow as Karla Bentham (11 episodes) * Zeriozha Burtt-Skeete as Celine Dixon (9 episodes) * Thomas Milner as Paul Langley (8 episodes) * Zaraah Abrahams as Michaela White (4 episodes) ===Others=== ====Recurring==== * Silas Carson as Stuart Hordley; Investor and Rachel's blackmailer (9 episodes) * Chris Finch as Colin Scott; Matt's fiancé (5 episodes) * Robert Angell as Nigel Hinchcliffe; Chair of Governors (4 episodes) * Joel Goonan as Dominic Hammond; Pupil (4 episodes) * Naveed Choudhry as Shahid Kapoor; Pupil (3 episodes) * Maria Lennon as Ria Cheetham; School governor (3 episodes) * Lorraine Cheshire as Fleur Budgen; Grantly's wife (2 episodes) * James Rawlings as Wilson Bingham; Supply teacher (2 episodes) * Fiona Wade as Sameen Azizi; Pupil (2 episodes) * Sean Wilson as Darren Briggs, Sr.; Darren's father (2 episodes) * Lee Worswick as Darren Briggs, Jr.; Pupil (2 episodes) ====Guest==== * Tara Berwin as Sally Froggart; Pupil (1 episode) * Antony Edridge as Claude Legard; Investor (1 episode) * Sally Ann Matthews as Alison Lawson; Eddie's ex-wife (1 episode) * Steve Money as Clarence Charles; Donte's father (1 episode) * James Varley as Ben McNulty; Pupil (1 episode) ==Episodes== Autumn Term No. Title Directed by Written by Original air date Spring Term ==DVD release== Three different box sets of the third series were released. The first ten episodes were released on 2 March 2009, episodes 11–20 were released on 11 May 2009. All twenty episodes were later released together as a complete six-disc set on 24 May 2009. It has episodes such as: Autumn Term Scrap Book, Pupil Reports, Teacher Evaluation and a Spring Term Scrap Book. All box sets for the third series were released with a \"12\" British Board of Film Classification (BBFC) certificate (meaning people under the age of 12 years shouldn't watch it). ==References== Category:2007 British television seasons Category:2008 British television seasons Category:Waterloo Road (TV series)",
 "title": "Waterloo Road (series 3)"
}