{
 "id": "1152537",
 "text": "The status of a city (miasto) in contemporary Poland is defined by legal and administrative regulations. Cities are municipalities with urban characteristics and are granted city status by a decision of the Polish government. As of 2024, there are over 900 cities in Poland, varying widely in population, size, and regional importance.Municipal Statistics from Główny Urząd Statystyczny (Polish Central Statistical Office), 2023. == Criteria for city status == A settlement can be granted city status if it meets specific criteria, including: * Urban infrastructure: Features such as streets, water systems, and public facilities. * Economic role: Centers of commerce, industry, or administration. * Population density: Higher than in rural areas. * Historical tradition: A history of being a city prior to losing that status, often during administrative changes in the 20th century. == City governance == Cities in Poland are governed as urban gminas (municipalities). Larger cities, such as Warsaw, also hold the status of powiat (county). The local government is headed by a mayor (burmistrz or prezydent miasta), elected by residents during local elections.Polish Government: Local Governance Structure. == Types of cities == * Major urban centers: Cities like Warsaw, Kraków, and Gdańsk are economic and cultural hubs with populations exceeding 500,000. * Medium-sized cities: Examples include Tarnów or Koszalin, which serve as regional administrative and economic centers. * Small towns: Settlements with populations below 20,000 often serve as local trade or cultural hubs. == Changes in city status == City status can be granted or revoked. In recent years, several settlements regained city status after meeting legal criteria or appealing based on historical significance. For example: * Reinstated cities: Towns that lost city status during the 19th or 20th centuries, such as Józefów nad Wisłą (restored in 2020). == Challenges == Urbanization trends and administrative reforms have led to debates about granting city status to small settlements with declining populations or limited infrastructure. Meanwhile, metropolitan areas face issues related to overpopulation and urban sprawl. == References == Status",
 "title": "Status of cities in contemporary Poland"
}