{
 "id": "1152661",
 "text": "A posture cane (also known as a walking cane, cane, walking staff, or staff) is a device used primarily to aid walking, provide postural stability or support, or assist in maintaining a good posture. == History == A walking staff became a necessary item for any European gentleman's wardrobe in the 17th or 18th century. == Usage == When using a walking support, it is generally advised that the stick's length be such that, when standing with arms hanging and wearing the appropriate footwear, the top of the handle reaches the wrist joint. Both Western and Eastern Christian churches utilize a variety of office staffs that are developed from walking sticks or staffs. == Types == Sticks are rated according to the weight they can bear; this is not just a matter of the weight of the user but depends upon whether the stick is used for light balance and support, or with a great deal of weight placed on the stick. Canes made of carbon fiber or aluminum are stronger than those of the same weight and made of other materials such as hardwood. * Ashplant a British or Irish walking stick made from the ash tree. In the Royal Tank Regiment, officers carry an ashplant walking stick in reference to World War I when they were used to test the ground's firmness and suitability for tanks. * Blackthorn An Irish walking stick, or shillelagh, usable as a weapon, made from the blackthorn (Prunus spinosa) * Campbell posture cane Ronald Bruce Campbell defines Posture Cane that utilizes Campbell Handle Technology; a Biomechanical Functionality. * Kebbie A rough Scottish walking stick, similar to an Irish shillelagh, with a hooked head. * Whangee Charles Sumner of Massachusetts chastised Andrew Butler of South Carolina and Stephen A. Douglas of Illinois for the Kansas–Nebraska Act in the U.S. Congress in 1856. After learning of it, Andrew Butler's relative Preston Brooks believed Sumner's actions warranted revenge and struck him senselessly on the Senate floor with a gutta-percha walking cane.The Caning of Senator Charles Sumner at United States Senate history page. == References == Category:Tools",
 "title": "Posture cane"
}