{
 "id": "1152394",
 "text": "Die Forelle ( op. 32 / D 550, translates as the trout) is one of the most famous art songs by Franz Schubert . The text was written by Christian Friedrich Daniel Schubart . There are five dfifferent versions of the song. It was coposed between November 1816 and July 1817. Most of the differences are the indication of the tempo, or speed, at which the song should be performed. The original version of the song is for high voice in D flat major, the time signature is 2/4. The piano accompaniment is always characterized by sextuplets. This gives the impression of the cheerful, lively trout through the tempo indication “Somewhat lively”. The melody of the singing voice is almost consistently cheerful, only three bars briefly convey the impression of sadness or pity on the part of the singer, with the melody falling back into a major key shortly afterwards. The text is based on a poem, which was written a generation earlier. The poem has four stanzas, but Schubert only used three of them. Franz Schubert probably knew about the meaning of the poem a generation later and composed the song in such a way that the fourth stanza was not set to music and could not be added due to the composition : The first two stanzas, which tell of the observation of a trout in the clear stream and the angler's futile wait, consist of a reprise of the main motif, the third stanza is then divided into a dramatic part in which the stream is muddy and the trout is caught, and another reprise that contains the observation of this act and the observer's interpretation. Thus, the song forms a closed compositional form A–B–A′, which prevents an extension by the existing fourth verse. The song was popular at the time. Schubert was asked to write a piece of chamber music, based on this song. This resulted in the Trout Quintet (D. 667), in which a set of variations of \"\" are present in the fourth movement. On Samsung's clothes washers and dryers, a short rendition of the basic melody of this song is an indicator that the machine's cycle has completed. == References == Category:Compositions",
 "title": "Die Forelle"
}