{
 "id": "1152277",
 "text": "Fragile Bard (Cantonese: 易碎君) is a YouTuber from Hong Kong now living in the United States. He went to King's College in Hong Kong. At 15, he was investigated by the Hong Kong Police Force National Security Department for his online posts making fun of Xi Jinping and the Chinese Communist Party. The police took his computer and phone. He shares his opinions on YouTube and Discord. His name comes from the song \"Fragile\", which talks about how sensitive Little Pink and ultranationalist groups are to criticism. == History == In 2021, Fragile Bard started high school and took the \"Citizenship and Social Development\" course. This inspired him to make jokes about Xi Jinping online. In February 2022, five police officers searched his home and questioned him about his YouTube account and its links to Ruters. They took his devices and pressured him to name others in Ruters. In August 2022, he left Hong Kong with his brother’s help. After arriving in the U.S., he was detained for over three months but eventually got legal residency. His family later moved to the United Kingdom. In March 2024, he helped a 14-year-old boy, Ah-Loong who faced doxxing for creating an anti-communist group on Roblox. The boy got asylum in Canada with Fragile Bard’s help. In September 2024, he started university in the U.S., studying computers. He also helps others like Yuen Hong Tam, who joined the Great Translation Movement and sought asylum in the U.S. Fragile Bard continues to support Hong Kong democracy, takes part in campaigns, and hopes to return to Hong Kong if it becomes free. Fragile Bard joined an international campaign supporting the \"47 Pro-Democracy Activists Case\" and shared that one of the defendants was his classmate’s father from Hong Kong. After the verdict, his classmate called him, upset and frustrated. Fragile Bard said, \"My friend is just a teenager, and his father only wanted to help the community. What did they do wrong to deserve being separated for so many years?\" He criticized the government, saying it wasn’t just punishing the 45 people on trial but also silencing the many citizens who voted in the primary election and wanted fair representation. He called it a direct attack on democracy. == References == Category:Human rights activists Category:Chinese human rights activists Category:YouTubers Category:Living people Category:Year of birth missing (living people)",
 "title": "Fragile Bard"
}