{
 "id": "1152538",
 "text": "The list of manuscripts of Dream of the Red Chamber catalogs handwritten copies of the Chinese literary classic Dream of the Red Chamber (红楼梦), written by Cao Xueqin during the Qing dynasty. Before the novel was first printed in 1791, numerous manuscript versions circulated. These manuscripts are critical for understanding the novel's development, as they often include annotations, alternate endings, and differences in chapter structure. == Main manuscripts == The manuscripts can be categorized into two major groups: the Rouge Versions (脂本) and the Cheng-Gao Versions (程高本). === Rouge Versions === These copies, named after the Rouge Inkstone (a pseudonym of an early commentator), are considered closer to Cao Xueqin's original draft. They include: * Jiaxu Copy (甲戌本): Dated 1754, it contains 80 chapters with annotations by Rouge Inkstone. It is one of the earliest known manuscripts. * Gengchen Copy (庚辰本): Written in 1760, this version contains many marginal notes by early readers and commentators. * Jimao Copy (己卯本): Another key version with fewer alterations, offering insight into Cao's intended narrative. === Cheng-Gao Versions === These versions were edited and expanded by Cheng Weiyuan and Gao E in the late 18th century. The Cheng-Gao versions extend the original 80 chapters to 120 by adding a conclusion, though some scholars dispute its authenticity. == Importance of the manuscripts == The various manuscripts provide a window into the novel's original form and its interpretations over time. Rouge Versions are especially valued for preserving Cao Xueqin's authentic style and commentary, while the Cheng-Gao versions reflect efforts to standardize the text for publication. == Modern studies == Scholars continue to analyze the manuscripts to reconstruct Cao Xueqin's original intentions. Comparisons among different versions reveal: * Changes in character development and plot. * Additions or omissions of poetry and prose. * Variations in moral and philosophical themes. Modern editions of Dream of the Red Chamber often combine insights from both major groups of manuscripts. Category:Chinese novels",
 "title": "List of manuscripts of Dream of the Red Chamber"
}