{
 "id": "1152076",
 "text": "Tikėjimo žodis (\"Word of Faith\") is an independent evangelical Christian community in Lithuania. It was founded on October 2, 1988, in Vilnius by a group of Christians from various denominations, including Pentecostals, Evangelical Baptists, and Catholic Charismatics. Initially, the community operated in secrecy during the late Soviet period. The organization was officially registered in 1991 as a Bible Center, uniting evangelical churches throughout Lithuania. In 1990, Giedrius Saulytis became the first pastor (he led the community until 2014).Neteisėtos meilės kaina: „Tikėjimo žodžio“ pastorius neteko pareigų. Delfi.lt. Nuoroda tikrinta 2024-05-18. == Beliefs == The community believes that the Bible, both the Old and New Testaments, is divinely inspired and provides a complete revelation of God's will. Members adhere to universal Christian creeds, such as the Apostles’, Nicene, and Athanasian creeds, aligning with traditional evangelical doctrines. == Mission and vision == The organization emphasizes: # Worshiping Jesus Christ and spreading His gospel. # Instilling Christian values in society. # Providing charitable services to those in need. Their vision focuses on knowing Christ and sharing that knowledge with others, inspired by biblical teachings from the Apostle Paul. == Development and modern structure == By 2001, Tikėjimo žodis was renamed the Christian Community \"Word of Faith,\" encompassing 34 evangelical churches in Lithuania. In 2018, its name changed to the Association of Evangelical Churches in Lithuania. It remains one of the prominent evangelical networks in the country, fostering theological education and community support. == Cultural contributions == The group published a newsletter titled Tikėjimo žodis during its early years, spreading its teachings and providing commentary on Christian life. It also played a role in translating and distributing the Bible in Lithuanian, contributing to Lithuania’s broader religious and cultural revival. == References == Category:Protestantism Category:Christianity in Lithuania",
 "title": "Tikėjimo žodis"
}