{
 "id": "1152162",
 "text": "The Mercedes-Benz CLA is a small luxury car made by Mercedes-Benz. It was first introduced in 2013. The CLA is known for its design, which looks like a four-door coupe. It shares its platform with the A-Class and the B-Class. == First generation (C117; 2013-2019) == The first-generation Mercedes-Benz CLA, produced between 2013 and 2019, is a compact luxury car designed as a four- door fastback coupe. It was based on the Concept Style Coupe, which Mercedes- Benz revealed in 2012 at the Avant/Garde Diaries event in Los Angeles and showcased at other events like Auto China. The CLA was built on the same platform as the W176 A-Class and W246 B-Class compact models. The production version was officially unveiled at the 2013 North American International Auto Show, with sales beginning in September of the same year. In 2017, the CLA underwent a facelift, which included updated headlights, taillights, and LED lighting features. The CLA lineup also included a high-performance AMG variant, the Mercedes-AMG CLA 45. This model featured a 2.0-liter four- cylinder twin-scroll turbocharged engine, producing up to 375 hp and 475 Nm of torque, allowing for a 0–100 km/h acceleration time of just 4.1 seconds. The AMG CLA also included distinctive styling elements like a front fascia, AMG sports seats, and a sport-tuned suspension. == Second Generation (2019–present) == The second-generation Mercedes-Benz CLA (C118) was introduced in January 2019 at the Consumer Electronics Show and is based on the Modular Front Architecture (MFA2) platform, shared with the A-Class, B-Class, GLB, and GLA. The C118 maintains the fastback shape and features updated design elements inspired by the larger CLS model. Compared to its predecessor, the C118 is longer, wider, and has a slightly lower height, with a 30 mm longer wheelbase. The vehicle's underbody is nearly flat, contributing to a low drag coefficient of 0.23. The CLA uses MacPherson struts in the front and either a twist beam or multi-link rear suspension, with optional adaptive dampers. Inside, the CLA includes the MBUX infotainment system, with options for dual 7-inch or 10.25-inch displays and advanced driver assistance features such as adaptive cruise control and active brake assist. The CLA Shooting Brake variant was launched in 2019 and offers increased cargo capacity. It has a drag coefficient of 0.26 and is not available in the U.S. or Australia. High-performance AMG models, including the AMG CLA35 and CLA45 S, are equipped with all-wheel drive, advanced dual-clutch transmissions, and specific driving modes. The CLA 250 e plug-in hybrid, available in coupe and estate forms, was introduced in 2020. ==Markets== The second-generation Mercedes-Benz CLA is sold in many global markets, including Europe, Asia, and the Middle East. and The CLA's high-performance AMG models, including the CLA35 and CLA45 S, are also marketed worldwide, with availability in regions like Europe, Asia, and North America. The CLA 250 e plug-in hybrid variant, is available as both a coupe and a Shooting Brake in select markets. == References == Category:2010s automobiles Category:2020s automobiles Category:Mercedes-Benz automobiles",
 "title": "Mercedes-Benz CLA-Class"
}