{
 "id": "1152104",
 "text": "Captain Tushar Mahajan (Hindi pronunciation: [tʊʃar məhɑd͡ʒan]; 20 April 1989 – 21 February 2016) was an officer of the Indian Army who was martyred during the 2016 Pampore stand-off in Jammu and Kashmir. He attained supreme sacrifice on 21 February 2016 while leading his team in a counter-terrorism operation, showcasing exceptional bravery and dedication to the nation. == Early years == Captain Tushar Mahajan hailed from Udhampur in J&K; and was born on 20 April 1989. Son of Shri Dev Raj Gupta and Smt Asha Gupta, he had an elder brother Nikhil as his sibling. He always nurtured the dream of becoming a soldier for taking on terrorists and eliminating them. Before getting selected forNational Defence Academy training, he had completed his schooling from Little Flowers Convent School up to class VIII and later Happy Model Higher Secondary School up to Class 12. == Military Career == Capt. Tushar Mahajan, according to close friends, had joined the Indian Army against the wishes of his parents. His father wanted him to become an engineer like his elder brother but he followed his passion and became an officer in the army. He got commissioned into the famed Parachute Regiment and joined the elite 9 Para(SF). Capt. Tushar was one of the two officers and ten other soldiers to join 9 Para(SF) in 2010 out of 100 probationers. Capt. Tushar loved the adventurous life and took great pride in being a commando from the prestigious Special Forces unit, known for its daredevil operations. In 2012-2013, he served in Ladakh and became part of many reconnaissance and surveillance operations. Many a times he assumed the role of a covert operative and gathered valuable information about terrorists activities, the terrain, the demography, needed to conduct various military operations. He also became a combat diver after successfully completing the three-month tough course at INS Venduruthy. As a diver and leader he thereafter undertook many underwater rescue operations in J&K; region. === Pampore Operation (J&K;) === During the year 2016, Captain Mahajan’s unit was deployed in J&K; region and was undertaking counterinsurgency operations on a regular basis. On 20 Feb 2016, the LeT militants attacked a convoy of CRPF in Pampore when they were returning from a search operation. A total of 11 CRPF Jawans got wounded in the attack and then the militants entered the nearby multistoried Entrepreneurship Development Institute (EDI) at Pampore in Pulwama district, about 15 km south of Srinagar city. The police and security forces evacuated more than 100 people, including students and EDI employees, from the building before cordoning off the area. Initially CRPF and the nearby Rashtriya Rifles battalion took charge of the operation but as the situation demanded more combat resources, 10 Para(SF) was rushed in to deal with the threat. However after Captain Pawan Kumar of 10 Para(SF) was martyred in the exchange of fire, the operation was transferred to 9 Para(SF) along with other elements of the security forces. 9 Para(SF) decided to launch a well- coordinated commando operation to neutralize the hardcore militants. Capt. Tushar Mahajan was tasked to lead, plan and execute the building intervention operation to eliminate the terrorists. EDI was a modern building sprawling over 10,000 sq feet and having four floors with tens of offices, rooms and halls. Capt. Tushar carried out a reconnaissance of the building and laid out an effective plan to execute the mission. His plan included placing snipers all around targeting the windows, so that the assault team could enter the building with minimum attrition. The plan was to enter the building from both sides after blasting the front doors, to confuse the terrorists. As planned, the two teams under the leadership of Capt. Tushar entered the building using their combat skills and began securing it floor by floor and room by room. It was a very risky operation as the well-positioned terrorists in the stairwell could easily target the forces on the lower floors and quickly change their positions too. Undeterred, the first squad sanitized the first floor and signaled the others to move to the second floor. Lance Naik Om Prakash was the leading scout of the second squad, which moved to the second floor. During the sanitization of the second floor, Lance Naik Om Prakash's squad drew heavy fire from the third floor. Realizing the immediate threat to his comrades, Lance Naik Om Prakash returned the fire at the cost of exposing himself to the terrorists. Consequently he too received a gunshot, injuring him seriously. Despite pain and blood loss, Lance Naik Om Prakash continued to engage with the terrorists and eliminated one terrorist, before being shot again. After having ensured the safety of his comrades, he painfully extricated himself to a safer place. Capt. Tushar Mahajan's squad while approaching the third floor, came under attack from one of the rooms. Undeterred, Capt. Tushar lobbed grenades and cleared the room. As the squad was advancing further, it was pinned down by fire from another room. Realizing the gravity of the situation, Capt. Tushar advanced further while firing and lobbing grenades simultaneously. However while dong so, he was struck by a hail of fire in his legs. Despite being wounded and bleeding profusely, he returned fire wounding the terrorist. He was shot again in the process, injuring him severely. Displaying remarkable courage and gallantry, Capt. Tushar even in that injured state charged at the terrorist and eliminated him instantly before collapsing. He was evacuated for medical treatment, but he succumbed to his injuries and was martyred. Lance Naik Om Prakash too was evacuated, but he also lost the battle for life in the hospital. Capt. Tushar Mahajan displayed exceptional courage and fighting spirit during the operation and led from the front like a true military leader. His sacrifice paved the way for subsequent coordinated assault wherein all the militants were successfully neutralized. Capt. Tushar Mahajan was given the gallantry award “Shaurya Chakra” for his bravery, unyielding fighting spirit, and supreme sacrifice. == Awards and Decorations == Shaurya Chakra Special Service Medal Sainya Seva Medal High Altitude Medal === Shaurya Chakra Citation === \"Captain Tushar Mahajan was the architect of the Pampore building intervention operation wherein he formulated the plan, sited the fire bases and led the building clearance operation at Pulwama district of Jammu and Kashmir from 20 to 22 February. As the operation progressed, Capt Tushar risked himself to extricate the grievously wounded Lance Naik Om Parkash under fire. While approaching the third floor his squad drew terrorist fire from a room. Undeterred, the officer lobbed grenades and cleared the room that had caught fire. Emerging into the corridor they were pinned down by heavy fire from a room further ahead. Seeing his men threatened, Capt Tushar advanced forward, firing and lobbing grenades simultaneously. The hail of terrorist fire caught Capt Tushar in his legs, swinging him midway. Bleeding profusely, the officer overcame excruciating pain and returned fire, wounding the terrorist. Shot again in the arm, Capt Tushar, displaying unparalleled resilience, aggression and raw courage charged and killed the terrorist instantly before collapsing and succumbed to his wounds during evacuation. His supreme sacrifice while safeguarding his men galvanised them into clearing the building and recovering bodies of three terrorists. Captain Tushar Mahajan displayed indomitable courage, gallantry, inspiring leadership and self sacrifice while eliminating one terrorist and evacuating his wounded comrade.\" == Legacy == The Government of India in 2023 passed an order approving the renaming of Udhampur railway station to “Martyr Captain Tushar Mahajan Railway Station”, in honour of the braveheart. == References == Category:Indian Army Officer Category:Shaurya Chakra Recipient",
 "title": "Captain Tushar Mahajan"
}