{
 "id": "1152367",
 "text": "Uhniv (Ukrainian: Угнів) is a city in Ukraine in Lviv Oblast, Chervonograd Raion, until February 15, 1951 in Tomaszów County, Lublin Voivodeship in Poland (before 1939 in Rawa County, Lviv Voivodeship). A private noble town founded in 1462, it was located in the 16th century in Bełz province. == Position == Uhnów now lies about 3 km from today's border with Poland in a straight line. The town is less than 22 km from the Hrebenne crossing. The town is about 35 kilometers from Czerwonogrod (formerly Krystynopol), and about 75 kilometers from Lviv (82 kilometers from the city center). Uhnów is located nearly 530 km from Kyiv. The Sołokija River flows through the city. == History == * the first mention of Uhnowo appears in 1360 * in 1462 Uhnów received the privilege of city law from the Polish King Casimir IV Jagiellon * 1470 – the beginning of the Catholic parish and the construction of a wooden church founded by the standard-bearer of Płock, Zygmunt of Radzanów * 1621 – Tatar invasion * 1624 – plague air (plague) * 1632 – city fire * mid- 17th century – Cossack attacks on the city * 1695 – construction of a new brick defensive church (the previous wooden one burned down) founded by the Dunin family * 1772 – first partition of Poland; Uhnów under Austrian rule * in the interwar period in Poland the city was located in the Lviv voivodeship, in the Rawa district * On July 1, 1934, the area of the abolished Zastawie commune was incorporated into Uhnowo * September 17, 1939 as a result of the Soviet aggression against Poland, occupied by the USSR, in 1940–1941 and 1944 the seat of the Uhniv district * from June 1941 German occupation, the city was significantly destroyed during World War II * In 1942–1943, the Germans and the Ukrainian Auxiliary Police murdered all the Jews, some on the spot and some in extermination camps. * In the years 1943–1946, Ukrainian nationalists from the OUN - UPA murdered 101 Poles here, including the commune mayor Jan Piroszyn and several militiamen and soldiers of the 7th Infantry Regiment of the 3rd Infantry Division. * since 1944 – not classified as a city – belonged to Poland (Uhnów commune, Tomaszów county, Lublin voivodeship, also the seat of Tarnoszyn commune) * On February 15, 1951, as part of the agreement on the exchange of borders, it was incorporated into the Ukrainian SSR. There were rich deposits of hard coal in the vicinity of Uhnów. * In 1989 it had 1,161 inhabitants.Всесоюзная перепись населения 1989 г. Численность городского населения союзных республик, их территориальных единиц, городских поселений и городских районов по полу.Угнев // Большой энциклопедический словарь (в 2-х тт.). / редколл., гл. ред. А. М. Прохоров. том 2. М., „Советская энциклопедия”, 1991. стр.516. * Since 1991, Uhniv has been part of the Republic of Ukraine. The city has a monument dedicated to the Ukrainian Insurgent Army (UPA). The city's population back in 1890 was estimated at 4.7k. Since then it has steadily declined: 4.5k in 1900, 3.9k in 1939, 1.9k in 1959, 1.5k in 1970, and 1,021 in 2001. Since 2004, on the initiative of the parish priest of nearby Dyniska, Rev. Wieslaw Mokrzycki, a pilgrimage to Uhnow (before the war Dyniska belonged to the parish in Uhnów) has been held annually in June, attended by many former Polish residents from Uhnow and their descendants scattered throughout Poland == Monuments == * Church of Assumption of the Blessed Virgin Mary , Catholic, brick (defensive) from 1695, built on the site of the previous wooden one which burned down. Architect Wojciech Lenartowicz. One of the church towers was destroyed in 1915 during German shelling of the city. The church was restored in the interwar period. Destroyed during the times of the Ukrainian SSR, it is now in complete ruin. The church bell tower remains seriously damaged, the main gate is devastated * a brick church from the 19th century, renovated in 1893 and rebuilt at the beginning of the 20th century. Before World War II, it was one of the most beautifully painted Orthodox churches in Lesser Poland. The artist Damian Horniatkiewicz was the creator of this work in the years 1933–1936. * a Jewish brick synagogue from the beginning of the 20th century (currently the locals have set up a small factory there) * cheder building (Jewish school) * old mill building * local cemeteries: Christian and Jewish Before World War II, under the Republic, there was an old market square in Uhnów surrounded by rows of wooden buildings with arcades. Today there is no trace left of the old buildings. == Born in Uhniv == * Paweł Kukiz – mayor of Uhnowo in the 1930s 1894–1897, great-grandfather of singer and politician Paweł Kukiz. * Myrosław Onyszkewycz – UPA colonel, responsible for the murders of the Polish population. * Edward Żuk – starosta of Tomaszów County in the years 1998–2006. == References == == Bibliography == * Janusz Z. Piekut, Uhnów Postal Agency from \"those listed\" in 1951 areas ; in: \"Filatelisty\" no. 12/1996, p. 616–617, Wroclaw 1996. == Other websites == * Category:Cities in Lviv Oblast",
 "title": "Uhniv"
}