{
 "id": "1152521",
 "text": "Holly McKeever Cairns (born 4 November 1989) is an Irish politician. She has been the leader of the Social Democrats party since March 2023. She has been a Teachta Dála (TD) for Cork South-West since 2020. She was a member of Cork County Council for the Bantry local electoral area from 2019 to 2020. Cairns was born in Cork and worked on her family farm which made organic seeds. She volunteered in many charity organisations in Malta and Romania before starting her political career in Ireland. She became active in politics because she supported LGBT rights and abortion rights. She joined the Social Democrats in 2018. Cairns ran in the 2020 general election as a candidate in the Cork South West constituency. During her time in the Dáil Éireann, she focused on the agricultural businesses of Cork. As a TD, Cairns is known for criticizing the government of Taoiseach Micheál Martin. She did not support the government's response to the Commission of Investigation Records about Mother and Baby Homes not releasing personal data to victims. In March 2023, Cairns became leader of Social Democrats, replacing Róisín Shortall and Catherine Murphy. During her time as leader, she has shown support for Palestine while criticizing the Irish government and European Union for their support of Israel. She has also refused to merge the Social Democrats with the Labour Party. Cairns supports solutions to fight climate change and homelessness in Ireland. Cairns led the party through the 2024 general election, in which the party gained seats in the Dáil Éireann. == Early life == Holly McKeever Cairns was born on a farm in Cork, Ireland. She studied in organic horticulture from University College Cork. Her mother, Madeline McKeever, was a Green Party politician. Cairns worked on the family farm, Brown Envelope Seeds, making organic seeds. During the 2010s, Cairns lived outside of Ireland, spending some time working in an orphanage in Romania, before moving to Malta for four years. In Malta, Cairns worked for a charity organisation called INSPIRE which gives educational services to children and adults with disabilities. == Local politics== Cairns first entered politics as an activist interested in LGBT rights and abortion rights. Cairn joined the Social Democrats in 2018. She was one of the founding members of the West Cork branch of the party. Cairns was elected to Cork County Council for the Bantry local electoral area in 2019, winning the last seat by a single vote. During the campaign, she was against the creation of a plastics factory in Skibbereen. During her time as a councillor, she created the Inside the Chamber podcast about local government. In 2019, she proposed a motion for councillors to receive documents three days before voting, which was passed. She was a member of the executive committee of Carbery Housing Association until her election to the Dáil. ==TD (2020–present)== Cairns ran in the 2020 general election as a TD candidate in the Cork South West constituency. She was the youngest Social Democrats candidate, being 30 years old. She ran against her then-boyfriend, Christopher O'Sullivan of the Fianna Fáil party. She was elected, taking the third and final seat, winning 4,696 (10.59%) of the vote. Cairns was the only female TD elected in all of Cork City and county. She then became the Social Democrat Spokesperson for Agriculture, Food and the Marine; Further and Higher Education; and Disability. In March 2020, Cairns was criticized by farmers for her \"lack of support\" for the dairy business in Cork. That same month, she supported the creation of a task force to support the fishing business. In October 2020, Cairns criticised the Commission of Investigation (Mother and Baby Homes and certain related Matters) Records for not giving access to survivors of the institutions to their personal data. Cairns was also worried about the sealing of the archive in the Dáil. She did not support government's role in not taking any of the amendments from the oppositions. After the Dáil voted in favour of the legislation, she said that she was \"sick to my stomach that the State has let the survivors down yet again ... The amount of emails, phone calls, and letters I have had on the Mother and Baby Homes Records is overwhelming. People want justice and accountability for the survivors of these horrific institutions.\" After the bill was passed, Taoiseach Micheál Martin promised Cairns that survivors would be able to get access to their records. In November 2020, Cairns was against a parliamentary motion to give state funding to the greyhound racing industry. Wayne McCarthy, a board member of Greyhound Racing Ireland, called her an \"ignorant little girl\" on Twitter. McCarthy's comments were called sexist and offensive by many politicians. Speaking in the Dáil, Cairns said that she did not want to use her Dáil speaking time to talk about, what she called \"everyday sexism\", but that it cannot be ignored. She invited McCarthy to a public debate about funding the greyhound racing industry. Despite this, in 2021 the government gave €19.2 million in taxpayer money to funding greyhound racing. In April 2021, Cairns called on the government to increase funding for national treatment for eating disorders after a constituent went to Cairns asking for help. In May 2021, she questioned Taoiseach Micheál Martin, after he publicly supported an appeal against the construction of a €140 million cheese factory in County Kilkenny. Cairns said that the factory would be a way for the Dutch to keep making money from dairy products while cutting their herd numbers to meet environmental standards. Cairns also said that Martin had told Cairns it was not right for government members to be part in planning issues when she talked about the idea of creating a mother and baby home in County Cork. ===Leader of the Social Democrats=== Cairns announced on 26 February 2023, that she would run for leader of Social Democrats. No one else ran in the leadership election, so Cairns became the new leader. She took over leadership of the party on 1 March 2023. After taking office, Cairns said that the Social Democrats have no plans in merging with the Labour Party. The first poll taken after she was elected leader showed that the party's support had more than doubled to 9%. Cairns is a supporter for an \"Irish NHS\" to fix the problems of the current healthcare system in Ireland. She supports action to fight climate change, calling it a threat that cannot be ignored. Cairns has called housing in Ireland a \"national crisis\" and supports policies to fix the housing shortage. Cairns has also talked about against false information about asylum seekers and believes in showing support for them instead. As leader of the Social Democrats, Cairns has showed support for Palestine. She also said that Israel has done war crimes against Palestine and called on Western leaders for a ceasefire. After Israeli invaded the Gaza Strip in 2023, the Social Democrats called for the removal of the Israeli ambassador to Ireland, with Cairns saying the European Union's response to the war in Gaza as \"despicable\". In November 2024, Cairns led the party into the 2024 general election, in which the party won five seats more seats in the Dáil Éireann while winning an increased 4.8% of the vote. She was the only woman elected in any Cork constituency at that election. ==Personal life== Cairns was in a relationship with Cork TD Christopher O'Sullivan of Fianna Fáil but the couple ended their relationship in 2020. In January 2023, Cairns said that for six months the year before, she was harassed by an online stalker. The stalker eventually showing up at her home in West Cork many times. She said this after many Irish women in politics such as Jennifer Carroll MacNeill said that they had been harassed for being women. In June 2024, Cairns announced that she and her partner, Barry Looney, were expecting a baby girl. She said that she was happy since she had two miscarriages the year before. Cairns became the first Irish party leader to have been pregnant in the Dail. She announced that the Social Democrats' deputy leader, Cian O'Callaghan, would lead the party during her maternity leave. She gave birth to a girl on 29 November 2024, the day of voting in the general election. ==References== ==Other websites== *Social Democrats profile Category:1989 births Category:Living people Category:Politicians from Cork (city) Category:Members of Dáil Éireann Category:Podcasters Category:Social Democrats (Ireland) politicians Category:Irish activists",
 "title": "Holly Cairns"
}