{
 "id": "1152480",
 "text": "The attorney general of New Jersey is a member of the executive cabinet of the state and is in charge of the Department of Law and Public Safety. The office is appointed by the governor of New Jersey, confirmed by the New Jersey Senate, and term limited. ==List== # Picture Attorney General Term in office Party affiliation Appointed by 1 William PatersonWilliam Paterson, Biographical Directory of the United States Congress. Accessed December 1, 2006.(1745–1806) 1776 – 1783 Federalist Elected by the legislature 2 Joseph Bloomfield (1753–1823) 1783 – 1792 Anti-Administration Elected by the legislature 3 Aaron WoodruffPolitical Graveyard: Aaron Dickinson Woodruff, accessed August 27, 2006. 1792 – 1811 Federalist Elected by the legislature 4 Andrew S. Hunter 1811 Democratic- Republican Elected by the legislature 5 Aaron Woodruff 1812 – June 26, 1817 Federalist Elected by the legislature 6 Theodore Frelinghuysen February 6, 1817 – March 4, 1829 Federalist Elected by the legislature 7 Samuel L. SouthardSamuel Lewis Southard, Biographical Directory of the United States Congress. Accessed December 1, 2006. 1829 – 1833 National Republican Elected by the legislature 8 John Moore White 1833 – 1838 Elected by the legislature 9 Richard Stockton FieldRichard Stockton Field, Biographical Directory of the United States Congress. Accessed August 25, 2007. 1838 – 1841 Republican Elected by the legislature 10 George P. Mollesson 1841 – 1844 Elected by the legislature 11 Richard P. Thompson 1844 – 1845 Daniel Haines 12 Abraham Browning 1845 – 1850 Democratic 13 Lucius ElmerLucius Quintius Cincinnatus Elmer, Biographical Directory of the United States Congress. Accessed August 20, 2007. 1850 – 1852 Democratic 14 Richard P. Thompson 1852 – 1857 George Franklin Fort 15 William L. DaytonWilliam L. Dayton, Biographical Directory of the United States Congress. Accessed November 11, 2006. 1857 – 1861 Republican William A. Newell 16 Frederick Theodore FrelinghuysenFrederick Theodore Frelinghuysen, Biographical Directory of the United States Congress. Accessed December 1, 2006. 1861 – 1867 Republican Charles Smith Olden 17 George M. RobesonGeorge Maxwell Robeson, Biographical Directory of the United States Congress. Accessed December 1, 2006. 1867 – 1870 Republican Marcus Lawrence Ward 18 Robert Gilchrist Jr. 1870 – 1875 Democratic Theodore Fitz Randolph 19 Joel ParkerNew Jersey State Library biography for Joel Parker, New Jersey State Library. Accessed July 11, 2007. 1875 Democratic Joseph D. Bedle 20 Jacob Vanatta 1875 – 1877 21 John P. StocktonJohn Potter Stockton, Biographical Directory of the United States Congress. Accessed December 1, 2006. April 8, 1877 – April 5, 1897 Democratic 22 Samuel H. GreyNew Jersey: State Attorneys General, The Political Graveyard. Accessed April 24, 2007. 1897 – 1902 John W. Griggs 23 Thomas N. McCarter 1902 – 1903 Republican Franklin Murphy 24 Robert H. McCarter 1903 – 1908 Republican 25 Edmund Wilson Sr. 1908 – 1914 Republican John Franklin Fort 26 John Wesley Wescott 1914 – 1919 Democratic James F. Fielder 27 Thomas F. McCran 1919 – 1924 Republican Walter Evans Edge 28 Edward L. Katzenbach 1924 – 1929 George S. Silzer 29 William A. Stevens 1929 – 1934 Morgan F. Larson 30 David T. Wilentz 1934 – 1944 Democratic A. Harry Moore 31 Walter D. Van Riper 1944 – 1948 Republican Walter Evans Edge 32 Theodore D. Parsons February 4, 1948 – 1954 Alfred E. Driscoll 33 Grover C. Richman Jr. 1954 – 1958 Robert B. Meyner 34 David D. Furman 1958 – 1962 35 Arthur J. Sills January 6, 1962 – 1970 Richard J. Hughes 36 George Francis Kugler Jr. 1970 – 1974 William T. Cahill 37 William F. Hyland 1974 – 1978 Democratic Brendan Byrne 38 John J. Degnan January 17, 1978 – March 5, 1981 Democratic 39 James R. Zazzali 1981 – 1982 Democratic 40 Irwin I. Kimmelman January 19, 1982 – January 21, 1986 Republican Thomas Kean 41 W. Cary Edwards January 21, 1986 – January 19, 1989 Republican 42 Peter N. Perretti Jr. February 14, 1989 – January 16, 1990 43 Robert Del Tufo January 16, 1990 – August 24, 1994 Democratic Jim Florio 44 Deborah Portiz January 18, 1994 – July 10, 1996 Republican Christine Todd Whitman 45 Peter Verniero July 10, 1996 – May 15, 1999 Republican 46 John Farmer Jr. June 3, 1999 – January 15, 2002 Republican 47 David Samson January 15, 2002 – February 15, 2003 Jim McGreevey 48 Peter C. Harvey February 15, 2003 – January 30, 2006 Democratic 49 Zulima Farber January 30, 2006 – August 31, 2006 Democratic Jon Corzine Acting Anne Milgram\"Hello to a new day\" , The Star-Ledger, June 22, 2007. Accessed July 11, 2007. August 31, 2006 – September 26, 2006 Democratic 50 Stuart Rabner September 26, 2006 – June 29, 2007 Democratic 51 Anne Milgram June 29, 2007 – January 18, 2010 Democratic 52 Paula Dow January 18, 2010 – January 10, 2012 Democratic Chris Christie 53 Jeffrey S. Chiesa January 10, 2012 – June 6, 2013 Republican Acting John Jay Hoffman June 10, 2013 – March 14, 2016 Republican Acting Robert Lougy March 14, 2016 – June 21, 2016 54 Christopher Porrino June 21, 2016 – January 16, 2018 Independent 55 Gurbir Grewal January 16, 2018 – July 19, 2021 Democratic Phil Murphy Acting Andrew Bruck July 19, 2021 – February 14, 2022 Democratic Acting Matt Platkin February 14, 2022 – September 29, 2022 Democratic 56 Matt Platkin September 29, 2022 – present Democratic ==References== *",
 "title": "Attorney General of New Jersey"
}