{
 "id": "1152507",
 "text": "The history of Bulgaria goes back to the first people living in the area that is now Bulgaria and its rise as a country. The oldest signs of human life found in Bulgaria are from at least 1.4 million years ago. Around 5000 BC, a developed civilization was already there that made some of the world's first pottery, jewelry, and gold items. After 3500 BC, the Thracians came to the Balkan Peninsula. In the late 6th century BC, eastern Bulgaria was part of the Persian Achaemenid Empire. In the 470s BC, the Thracians established the strong Odrysian Kingdom, which lasted until 46 BC, when the Roman Empire took over. Over time, some Thracian tribes came under the rule of ancient Macedonians, Greeks, and Celts. Later, the Slavs came and settled permanently in the area after 500 AD. In 632, the Bulgars created an independent state north of the Black Sea called Great Bulgaria, led by Kubrat. Pressure from the Khazars caused Great Bulgaria to break apart in the late 7th century. One of Kubrat's successors, Asparuh, moved some Bulgar tribes to the Danube delta, conquered Scythia Minor and Moesia Inferior from the Byzantine Empire, and expanded his kingdom into the Balkan Peninsula. The important Battle of Ongal in 680, the peace treaty with Byzantium in 681, and the founding of a permanent capital at Pliska south of the Danube marked the start of the First Bulgarian Empire. This new state combined local Byzantine people and incoming Early Slavs under Bulgar rule, starting a slow process of blending cultures. Over the coming centuries, Bulgaria grew into a strong empire, controlling the Balkans through its fierce military traditions, which led to a unique ethnic identity. Its diverse people came together under a shared religion, language, and alphabet, maintaining the Bulgarian national identity despite outside attacks and influences. In the 11th century, the First Bulgarian Empire fell apart due to many attacks and wars from the Rus' and Byzantines and became part of the Byzantine Empire until 1185. Later, a big uprising led by two brothers, Asen and Peter, brought back the Bulgarian state, creating the Second Bulgarian Empire. After its peak in the 1230s, Bulgaria began to decline due to various reasons, especially its location which made it open to attacks from many sides. A peasant revolt, one of the few successful ones ever, made the swineherd Ivaylo a Tsar. His short rule was important for partially restoring the Bulgarian state. A relatively good period followed after 1300, but ended in 1371 when division caused Bulgaria to break into three small Tsardoms. By 1396, they were conquered by the Ottoman Empire. The Turks removed the Bulgarian nobility and ruling clergy, and Bulgaria stayed part of the Ottoman Empire for the next 500 years. After 1700, as the Ottoman Empire weakened, signs of change appeared. The Bulgarian nobility disappeared, resulting in a society of equal peasants and a small growing middle class in towns. By the 19th century, the Bulgarian National Revival became important for the fight for independence, leading to the unsuccessful April Uprising in 1876, which triggered the Russo-Turkish War of 1877–78 and Bulgaria's later freedom. The first Treaty of San Stefano was turned down by the Great Powers, and the next Treaty of Berlin reduced Bulgaria's area to Moesia and Sofia. This left many ethnic Bulgarians outside the new state's borders, shaping Bulgaria's strong military stance in regional matters and its support for Germany in both World Wars. After World War II, Bulgaria became a Communist country, and Todor Zhivkov was the leader of the Bulgarian Communist Party for 35 years, during which the economy grew quickly. The Communist system fell apart in the 1980s, and many issues in the 1990s harmed Bulgaria's farming and other industries. A time of relative stability started when Simeon Saxe- Coburg-Gotha was elected prime minister in 2001. Bulgaria joined NATO in 2004 and the European Union in 2007. Category:History of Bulgaria",
 "title": "History of Bulgaria"
}