{
 "id": "1152502",
 "text": "Jassa Singh Ramgarhia (1723–1803) was a prominent Sikh leader during the period of the Sikh Confederacy. He was the founder of the Ramgarhia Misl. He led numerous military campaigns against the Mughal Empire and Afghan forces, securing significant victories and cementing his place as one of the most influential figures in Sikh history. ==Early life== Jassa Singh Ramgarhia was born into a Sikh family, in 1723. According to W. H. McLeod, his birthplace was the village of Ichogil, near Lahore, whilst H. S. Singha refers only to Lahore and Purnima Dhavan mentions origins in either Guga or Sur Singh, both near Amritsar. His father name was Bhagwan Singh, who was the son of Hardas Singh. There is agreement among the sources that he was of TarkhanSikhs and Sikhism, WH Mcleod, pg102 origin and was originally named Jassa Singh Thoka (Jassa Singh the Carpenter). Khushal Singh, Mali Singh, and Tara Singh - and became head of the family when his father, Giani Bhagwan Singh, died.Warrior- diplomat: Jassa Singh Ramgarhia - Harbans Singh Virdi In 1753, Moin-ul-Mulk's death led to chaos in the region, and the Sikhs saw an opportunity to rebuild the Ram Rauni fort, which was renamed Ramgarh in honor of Guru Ram Das. Jassa Singh Thokah, worked tirelessly to construct a stronger fort, earning him the title \"Ramgarhia.\" ==Military Campaign== In 1758, Adina Beg gathered a large army and hired many workers to cut down the forests where the Sikhs usually hid during difficult times. He then surrounded the Sikh fort of Ram Rauni, defended by Jassa Singh Ramgarhia, Jai Singh Kanhaiya, and Amar Singh Kingra. The Sikhs launched a daring counterattack, using matchlocks and arrows, and despite being breached, they responded with a fierce counterattack after a prolonged effort, Mir Aziz finally managed to breach the fort's defenses under the cover of night. The Sikhs launched a bold counterattack, bursting out of the fort, but unfortunately, many of them fell in battle or were captured by the enemy, In 1758, after the death of Adina Beg, Jassa Singh Ramgarhia worked with Jai Singh Kanhaiya to captured Sri Hargobindpur and Miani, He made Sri Hargobindpur his headquarter. ===Rift with Jai Singh Kanhaiya=== In 1763, Jassa Singh Ramgarhia sacked Kasur along with Jai Singh Kanhaiya and Hari Singh Dhillon, The Ramgarhia and Kanhiyas collaborated and split their spoils 50/50. But this time, Jassa Singh took all the treasure for himself. This led to bad blood between the two leaders. ===Qazi Nur Muhammad calls him a Lion. 1765=== In 1765, Ahmad Shah Durrani attacked India for the seventh time. But the Sikhs fought back hard. They had a big fight near Rupar, by the Satluj River. The Afghans, led by Durrani, were surprised by the Sikhs just 3 kilometers from the river. Durrani stood in the middle with his men. Qazi Nur Muhammad said Jassa Singh Thoka was very brave and strong like a lion. Ramgarhia led his own group with a special flag and drum.Singha, Bhagata (1993). A History of the Sikh Misals. Patiala, India:Publication Bureau, Punjabi University. ===1770: Jassa Singh Ramgarhia Conquers Northern Hills=== In 1770, Jassa Singh Ramgarhia defeated Ghamand Chand, he became a tributary. Soon after, the other hill rajas also accepted Jassa Singh’s overlordship, agreeing to pay him an annual tribute of about two lakhs of rupees. ===Jassa Singh Ahluwalia captured and released. 1775=== In 1776, while on his way to a fair at Achal near Batala, Jassa Singh Ahluwalia encountered Mali Singh, a commander of the Ramgarhia Misl and brother of Jassa Singh Ramgarhia, who was leading a detachment from Sri Hargobindpur to Batala. The two groups clashed, leading to a bloody battle. Many of Jassa Singh Ahluwalia's soldiers were killed, and he himself suffered two injuries. He fell from his horse and lost consciousness. Mali Singh helped by placing him in a palanquin and taking him to Sri Hargobindpur for treatment. Although Jassa Singh Ramgarhia managed the situation, Jassa Singh Ahluwalia, known as the \"Emperor of the Panth\" or \"Jathedar Sultan-Ul-Qaum,\" felt deeply insulted by the attack. He stayed in Sri Hargobindpur for two days, refusing to eat, drink, or speak to anyone. On the third day, leaders like Jai Singh Kanhaiya, Gujjar Singh Bhangi, and others visited him, urging him to take revenge on the Ramgarhias. On the third day, Jassa Singh Ramgarhia arranged for Jassa Singh Ahluwalia to leave for Fatehabad with full honors and an escort. Despite these diplomatic efforts, Jassa Singh Ahluwalia vowed to take revenge and expel the Ramgarhias from Punjab. In September 1778, the Ramgarhia Misl and the Kanhaiya Misl clashed over the revenue of certain areas, as their territories overlapped in the Upper Bari Doab and Upper Jullundur Doab districts. In this conflict, Jai Singh Kanhaiya had the support of Jassa Singh Ahluwalia. Backed by an Ahluwalia force, Jai Singh and Haqiqat Singh Kanhaiya attacked Jassa Singh Ramgarhia's headquarters in Sri Hargobindpur. Despite strong resistance from Jassa Singh Ramgarhia, he was eventually forced to retreat from the Trans- Sutlej area. At the same time, Batala, under the control of Jassa Singh's brother Mali Singh, was besieged by Gurbaksh Singh Kanhaiya. Mali Singh was infamous for his cruel rule, which alienated the local population. Frustrated with his tyranny, the locals sided with the attackers and allowed the Kanhaiyas to enter the city. After Mali Singh retreated, the Kanhaiyas took over Batala, and Gurbaksh Singh was appointed the new administrator. Prominent figures like Raja Singh, Diwan Singh, Mansabdar Qanungo, and the Brahmin Tara Chand assisted Gurbaksh Singh in governance. Following these victories, the combined Kanhaiya and Ahluwalia forces advanced towards Kalanaur, which was controlled by Tara Singh Ramgarhia, another brother of Jassa Singh Ramgarhia. Tara Singh was defeated and killed, and Haqiqat Singh Kanhaiya took over Kalanaur. This led to the Kanhaiyas and Ahluwalias capturing the entire Ramgarhia territory in the Trans-Sutlej region. Afterwards, Bhag Singh Ahluwalia was assigned to Mahtabkot, near the Satluj River. Jassa Singh Ahluwalia instructed him not to block the Ramgarhia retreat across the river or interfere with their escape. Despite this defeat, Jassa Singh Ramgarhia, did not give up. He gathered a large force of irregular cavalry on the other side of the river and, with the support of the Phulkian leader Amar Singh of Patiala, took up a position in the Hisar region. ===In the Delhi Red Fort, 1783=== In March 1783, Dal Khalsa, led by Jassa Singh Ahluwalia and Baghel Singh, attack on Delhi, targeting areas like Malka Ganj, Sabzi Mandi, and Mughalpura mohalla, resulting in significant loss of life. They then broke through the Ajmeri Gate, ravaging the Hauz Qazi area, and stormed the Red Fort. In a dramatic turn of events, Jassa Singh Ahluwalia was proclaimed Badshah Singh, but Jassa Singh Ramgarhia contested this move, and Ahluwalia swiftly declined the honour, ===In the Ganga Doab. 1784=== A army of 30,000 Sikh soldiers, led by Jassa Singh Ramgarhia and Karam Singh, arrived in Sultanpur in late January 1784. They then attacked Sarsawa, prompting a response from Zabita Khan Rohilla's troops but failed to stop Sikhs. Representatives of Zabita Khan Rohilla met with the Sikh leaders to discuss terms. The Sikhs demanded 50,000 rupees to withdraw from the area. An agreement was reached, with Zabita Khan Rohilla paying 10,000 rupees and committing to an annual payment. Sikhs then moved to various locations, causing damage and taking goods from villages. By the end of February, they had reached Sardhana and then moved to Barnawa, After crossing the Jamuna River at Barari Ghat, the Sikh army returned home. Jassa Singh Ramgarhia stored the taken goods in Tosham. ===Sack of Chandausi, 1785=== In January 1785, Sikh army led by Baghel Singh, Gurdit Singh, and Jassa Singh Ramgarhia, swept through the upper Ganga Doab region, leaving destruction in their wake. They razed villages, including Barsi and Mahmudpur, and initially planned to attack Moradabad, but changed course when they learned of the city's Friday prayer gathering. Instead, they targeted Chandausi, a wealthy city, and looted it for two days, loading their spoils onto horses and camels before setting the town ablaze. ===Jassa Singh Ramgarhia's recovery of his territories=== In 1785, a dispute started between Jai Singh Kanhaiya and Maha Singh regarding the plunder of Jammu. due to which Maha Singh sought help from Jassa Singh Ramgarhia and Sansar Chand who were enemies of Jai Singh. In February 1785, A battle was fought near Batala in which Jai Singh's son Gurbaksh Singh was killed, Jassa Singh regained all his lost territory. ===Battle of Batala (1787)=== Jai Singh Kanhiya was deeply upset by the defeat and the loss of Batala. He skillfully gained the support of Mahan Singh and Bhag Singh Ahluwalia. With their help, he launched an attack on Batala. Jassa Singh, however, put up a determined defense, and after 21 days of intense fighting, the attackers were forced to lift the siege. ==Death and legacy== Jassa Singh Ramgarhia died in 1803 at the age of 80 In honour of his achievements and contribution to the Sikh faith, an equestrian statue of Sardar Jassa Singh Ramgharia has been installed in Amritsar, Punjab. ==References== Category:1723 births Category:1803 deaths Category:Mughal Empire Category:18th century in India Category:People from Lahore",
 "title": "Jassa Singh Ramgarhia"
}