{
 "id": "1152075",
 "text": "The Papacy during the Middle Ages spans from the time of Pope Gregory I (590–604) to the end of the Great Schism in 1417. This period saw the significant growth of both spiritual and temporal power for the Papacy. The pope was not only the head of the Catholic Church but also a major political figure, often acting as a mediator in European conflicts and influencing monarchies. Events like the formation of the Papal States and the Crusades highlighted the central role of the Papacy in shaping medieval Europe. == Key developments == Formation of the Papal States: The establishment of the Papal States in the 8th century was a turning point. Pope Stephen II allied with Frankish King Pepin the Short, who granted lands around Rome to the pope, marking the beginning of the church’s temporal rule. This arrangement laid the foundation for the pope's dual authority as both a spiritual leader and a secular ruler. The Investiture Controversy: The struggle between church and state reached its peak during the Investiture Controversy (11th–12th centuries), primarily involving Pope Gregory VII and Emperor Henry IV. The pope asserted his right to appoint bishops, challenging the emperor's influence over the church. The conflict ended with the Concordat of Worms (1122), establishing the pope's authority in spiritual matters. The Crusades: The Papacy initiated the Crusades, a series of military campaigns aimed at reclaiming the Holy Land from Islamic rule. These campaigns solidified the pope's role as the unifying figure of Christendom, although they also led to significant political and economic consequences across Europe. The Avignon Papacy and Great Schism: From 1309 to 1377, the Papacy moved to Avignon, France, under the influence of French kings. This period, known as the Avignon Papacy, weakened the church's authority. The subsequent Great Schism saw multiple claimants to the Papacy, dividing Europe until the schism's resolution at the Council of Constance in 1417. == Legacy == The medieval Papacy left a lasting impact on European politics, culture, and religion. It centralized the church's authority, shaped the relationship between church and state, and laid the groundwork for reforms in later centuries. Medieval theologians, such as Thomas Aquinas, also emerged during this period, influencing Christian doctrine for generations. == References == * Category:Middle Ages",
 "title": "Papacy in the Middle Ages"
}