{
 "id": "1152636",
 "text": "The BMW 7 Series is a full-size luxury sedan made by the German car company BMW. It has been produced since 1977 and is the successor to the BMW E3 \"New Six\" sedan. The 7 Series is BMW`s flagship car and is currently in its seventh generation. == First generation (E23; 1977) == The E23 is the first generation of the BMW 7 Series and was produced from 1977 to 1987. It was designed as a 4-door sedan with 6-cylinder engines and replaced the E3 sedans. From 1983 to 1987, a turbocharged 6-cylinder engine was offered in some markets. The E23 was known for introducing many new electronic features for BMW. These included an onboard computer, a service interval indicator, a \"check control panel\" that used warning lights to show system issues to the driver, a dictaphone, and advanced climate control systems. It was also the first BMW model to feature an anti-lock braking system (ABS), a driver's airbag, and double-link front suspension. == Second generation (E32; 1986) == The E32 is the second generation of the BMW 7 Series, produced from 1986 to 1994. It was initially offered with a straight-six or V12 engine, making it the first German passenger car with a V12 engine since World War II. In 1992, V8 engines were also introduced. The E32 introduced several new features for BMW, such as Electronic Damper Control, V12 and V8 engines, double glazing, and the CAN bus electronic protocol. It was also the first BMW to have Xenon headlamps, traction control, and dual-zone climate control. The E32 750i was notable for being the first BMW to follow the company’s self-imposed speed limit of 250 km/h (155 mph). The 'iL' models marked the first time BMW offered a long- wheelbase version. ==Third Generation (E38) (1994)== The E38 is the third generation of the BMW 7 Series, produced from 1994 to 2001. It was available in both standard length and long-wheelbase (\"iL\" models) sedan versions. The available petrol engines included straight-six, V8, and V12 options. The E38 was the first 7 Series to offer a diesel engine, starting with a turbocharged straight-six, and later a twin-turbocharged V8 in 1999. The E38 was the first car to have curtain airbags. It was also the first European car to offer satellite navigation and the first BMW with an in-built television. In 1999, the E38 received a facelift. ==Fourth Generation (E65/E66/E67/E68 2001)== The E65/E66/E67/E68 is the fourth generation of the BMW 7 Series, produced from 2001 to 2008. It was available in both standard length and long-wheelbase (\"Li\" models) sedan versions. This generation introduced several new features for BMW. It was the first to include the iDrive system, \"flame-surfacing\" exterior styling, active anti-roll bars, a 6-speed automatic transmission, an electronic smart key (eliminating the traditional metallic key), and night vision. The 760i model was notable for being the first production V12 engine to use direct injection. ==Fifth Generation (F01/F02/F03/F04 2008)== The F01/F02/F03/F04 is the fifth generation of the BMW 7 Series, produced from 2008 to 2015. It was available in both standard length and long-wheelbase (\"Li\" models) sedan versions. The F01 was the first BMW to offer a hybrid drivetrain called \"ActiveHybrid 7,\" an 8-speed automatic transmission, and a turbocharged V12 engine. It was also the first 7 Series to come with a turbocharged petrol engine and all-wheel drive (xDrive). In 2013, the F01/F02/F03/F04 models received a minor styling facelift. ==Sixth Generation (G11/G12 2015)== The G11/G12 is the sixth generation of the BMW 7 Series, which began production in 2015. It was first revealed on June 10, 2015, at BMW's headquarters in Munich, and had its public debut at the 2015 International Motor Show Germany. The G11 refers to the short-wheelbase model, while the long-wheelbase version is known as the G12 and includes an additional \"L\" designation. The G11/G12 is the first BMW lineup built on the modular OKL platform (Oberklasse, meaning luxury class). This platform uses carbon-fiber-reinforced polymer in its structural chassis, a technology first seen in BMW i models. As part of BMW’s strategy to offer plug-in hybrid options for all future models, both the short and long-wheelbase versions became available with hybrid powertrains, designated 740e and 740Le, starting in 2016. A facelifted version, known as the LCI model, was introduced in 2019 and featured a larger grille. ==Seventh Generation (G70 2022)== The BMW G70 debuted in April 2022 and includes both traditional and electric models. The electric variant, known as the BMW i7, was introduced alongside it. The G70 lineup features the Inline 6 740i and V8 760i models. It also adopts horizontally split headlight units, similar to those on the X7 LCI, which was launched in April 2022 as well. While engine options include a 3.0-liter Inline 6 and a 4.4-liter V8, the G70 does not offer a V12 engine. ===BMW i7=== The BMW i7 is the electric version of the 7 Series, unveiled in April 2022. The i7 xDrive60 features two electric motors producing a combined output of 536 hp (400 kW; 543 PS) and 553 lb⋅ft (750 N⋅m) of torque. It can accelerate from 0 to 60 mph (0–97 km/h) in 4.5 seconds and has an estimated EPA range of 300–318 miles (483–512 km). ==Markets== The BMW 7 Series is sold worldwide and is a popular choice in many markets. The car is sold in many places such as Europe, North America, and China. ==References== Category:BMW automobiles Category:Sedans",
 "title": "BMW 7 Series"
}