{
 "id": "1152432",
 "text": "Night of the Zoopocalypse (originally titled as Night of the Zoombies) is a 2024 animated Canadian-Belgium-French comedy horror film directed by storyboard artists Ricardo Curtis and Rodrigo Perez-Castro, written by James Kee and producer Steven Hoban, and inspired by a concept by Clive Barker. The film follows a group of animal survivors in a zoo where a meteor virus turns various zoo creatures into slobbering mutant zombies. It premiered at the 57th Sitges Film Festival on October 7, 2024 and will release in the United States and Canada by Viva Pictures and Elevation Pictures on March 7, 2025. == Plot == In the Colepepper Zoo, Gracie, a young timber wolf, lives with her pack and her paranoid Gramma Abigail. Abigail prepares the pack and trains them for upcoming \"disaster\" and to never trust the other animals in the zoo, especially as a new animal is transported into a nearby enclosure as the zoo closes. In space, a meteorite crashes into a satellite as a charged up piece of it crashes into the zoo through the wolf’s den and into the \"Kuddle Korner\" petting zoo, where a curious bunny eats it and gets infected with an alien virus, incubating it in a purple pod. Thanks to the damage done by the meteor, Gracie escapes her enclosure and investigates the pod in the barn, only for a gummi-like arm to emerge from it and attempt to grab her. She escapes, only to encounter Dan, a wild mountain lion and the new animal, and both are tranquilized by a zookeeper who puts them in the vet station before leaving the zoo, unaware of the situation. Meanwhile, the pod back in the barn opens to reveal the bunny being turned into a \"Gum-beast\"; a grotesque, indestructible gummi-like mutant zombie able to survive even when dismembered. It then proceeds to infect the other animals by biting them as they leave the barn to infect almost every animal in the zoo aside from Gracie, Dan, and alongside four other animals; Xavier, a red ruffed lemur who constantly injures himself and fakes illness to be taken to the veterinary office to watch late night movies, Felix, a pompous, self-sufficient and arrogant proboscis monkey, Frida, a feisty capybara, and Ash, a sarcastic ostrich. After almost being attacked by an infected gorilla named Fred that Felix left behind to save himself, the team splits up as Felix, Frida, Ash, and Xavier escape out the backroom and eventually make it to the gift shop to barricade themselves in while Gracie makes a deal with Dan to give him the zoo key to let him escape back into the wild if he escorts her to her pack and enclosure. After escaping more of the Gum-beasts, including the original infected rabbit, dubbed Bunny Zero, Gracie and Dan find the only remaining uninfected animal; a young pygmy hippo named Poot in a ball pit that Gracie has her join them by her promise of her and Dan eating Poot if they get hungry. However, upon making it to the wolf enclosure, Gracie is horrified to see her entire pack having been turned into Gum-beasts. A despondent Gracie argues with Dan before the others accidentally power on the attractions from the gift shop and the duo are attacked by a horde of gum-beasts. As Gracie and Dan end up decapitating the infected Fred in the cable car, Felix abandons the others to get the key in order to escape, leaving the door open to inadvertently allow an infected kangaroo and her joey inside to attack them as Gracie, Dan, and Poot come face to face with Fred, who has been amalgamated with a giraffe into a twisted monster that has the key attached to its leg. During the fight, Dan is infected and attacks Gracie before they fall into the security office. There, in the ensuring chaos, Dan falls into a sink overflowing with soap and water and, to Gracie's surprise, appears to be cured by the soap. Wanting to save the zoo, Gracie and Dan butt heads again as Dan leaves with the key after being called a coward. At the gift shop, Gracie and Poot rally Ash, Frida, and Xavier (who all survived the kangaroo attack) to cure the Gum-beasts while Felix steals the key from Dan, only to be swarmed by infected tree frogs and rescued by Dan (though, he only did so to get the key back). Felix tries to talk Dan into tagging along to the wild, causing Dan to have a change of heart and leave Felix with the key to save his friends, the latter attempting escape and just about able to, only to be swarmed and infected by the tree frogs. Gracie and the others manage to lure Bunny Zero and the Gum-beasts to an enclosure, using an infected elephant to topple a water tower and with Dan's help, fill the enclosure's moat to cure them all. However, it's revealed that all the Gum-beasts have instead combined into a large amalgamated monster, with Bunny Zero in control, and absorbs and infects the others. With Dan and Gracie being the only ones left, the monster tries to escape the zoo and wreak havoc on the world before the infected Poot, having fallen off, activates a snow globe in the destroyed giftshop and turns back to normal. Gracie remembers the radio was on during the earlier confrontation and realizes that music is the cure for the virus and not soap and water as she thought before. Before they could act, Dan gets absorbed by the amalgam, leaving Gracie to force the clock tower in the middle of the zoo to 7 o'clock and initiate the song while Poot distracts the monster. Gracie succeeds just before she's attacked by the infected Felix and the released animals join in by singing as every animal, including Bunny Zero, are turned back to normal. With reunions occurring and new friendships forged, Dan leaves the zoo and returns to the wild, but leaves the key for Gracie in case she decides to join him as she soon goes back to her pack and her new friends. == Voice cast == *Gabbi Kosmidis as Gracie, a young quirky wolf *David Harbour as Dan, a gruff mountain lion *Scott Thompson as Ash, a sarcastic, fabulous ostrich *Heather Loreto as Freia, a feisty capybara *Paul Sun-Hyung Lee as Felix, an egotistical monkey == Production == In 2015 Steven Hoban announced that Clive Barker's short story \"Zoombies\" had been optioned for a feature film. The film was initially to be animated by Tangent Animation, however production was shifted to L'Atelier Animation and Mac Guff after the studio's shutdown. Storyboard and pre-production was provided at House of Cool. == Music == Dan Levy was assigned to compose the score for the film. ==Release== Night of the Zoopocalypse had its premiere on 57th Sitges Film Festival on October 7, 2024 and will release in the United States and Canada by Viva Pictures and Elevation Pictures on March 7, 2025. === Marketing === The first teaser dropped on November 21, 2024. ==Premieres == Country Release Date Title in country January 23, 2025 Ночь в зоопарке January 29, 2025 Une nuit au zoo February 28, 2025 Zoopocalypse March 7, 2025 Night of the Zoopocalypse April 25, 2025 Una Noche en Zoopils September 25, 2025 Zoopocalipse - Uma Aventura Animal == References == ==Other websites== * Category:Movies about animals Category:2024 animated movies Category:2020s family movies Category:2020s computer-animated movies",
 "title": "Night of the Zoopocalypse"
}