{
 "id": "1152674",
 "text": "The first series of the British school drama series Waterloo Road was shown on BBC One, It was shown from 9 March 2006 to 27 April 2006. It has 8 half-hour episodes. It was created by Ann McManus and Maureen Chadwick. It is the first series to be filmed at the old Hill Top Community Primary School building in Rochdale, England. == The series == The show follows the lives of the teachers and the pupils at Waterloo Road, a failing comprehensive school. The school has a lot of problems such as drink driving, underage driving, bullying, homosexuality, marital problems, exclusion, Huntington's disease, teenage pregnancy, abortion, bereavement, sexual harassment, mental illness and suicide. ==Cast== ===Staff=== * Jason Merrells as Jack Rimmer; Headteacher (8 episodes) * Jamie Glover as Andrew Treneman; Deputy Headteacher and English teacher (8 episodes) * Angela Griffin as Kim Campbell; Head of Pastoral Care and Art teacher (8 episodes) * Jason Done as Tom Clarkson; English teacher (8 episodes) * Camilla Power as Lorna Dickey; English teacher (8 episodes) * Jill Halfpenny as Izzie Redpath; Head of Drama and English teacher (8 episodes) * Denise Welch as Steph Haydock; Head of French (8 episodes) * Philip Martin Brown as Grantly Budgen; Head of English (8 episodes) * Judith Barker as Estelle Cooper; School secretary (8 episodes) ===Pupils=== * Adam Thomas as Donte Charles (8 episodes) * Katie Griffiths as Chlo Grainger (8 episodes) * Lauren Drummond as Mika Grainger (7 episodes)Drummond was uncredited in episode six, thought she did appear. * Chelsee Healey as Janeece Bryant (7 episodes) * Craig Fitzpatrick as Lewis Seddon (6 episodes) * Rhea Bailey as Yasmin Deardon (4 episodes) * Daisy Wignall as Holly Tattersall (4 episodes) ===Others=== ====Recurring==== * Steve Money as Clarence Charles; Donte's father (6 episodes) * David Crellin as Jimmy Grainger; Izzie's ex-husband and Chlo and Mika's father (4 episodes) * Anna Wilson-Jones as Heather Davenport; LEA inspector (3 episodes) * Josh Hanlon as Rory Brears; Pupil (2 episodes) * Shane Zaza as Ahmed Patel; Pupil (2 episodes) ====Guest==== * Robert Angell as Nigel Hinchcliffe; Chair of Governors (1 episode) * Sherry Baines as Brenda Brears; Rory's mother (1 episode) * Claire Cooper as Zoe Ramsden; Pupil (1 episode) * Scott Kay as Zak Walker; Pupil (1 episode) * Kris Mochrie as Craig Harris; Father of Zoe's baby (1 episode) * Jordan Murphy as Hadleigh Flynn; Pupil (1 episode) * Jeff Merchant as Brian Vaisey; Former Headteacher * Marc Silcock as Anthony Sugden; Pupil (1 episode) ==Episodes== No. Title Directed by Written by Original air date ==DVD release== The first series of Waterloo Road was released on DVD in the UK on 26 March 2007. == Notes == ==References== Category:2006 television seasons Category:Waterloo Road (TV series)",
 "title": "Waterloo Road (series 1)"
}