{
 "id": "1152789",
 "text": "Bhag Singh Ahluwalia (1747-1801) was a prominent Sikh leader and the successor of Jassa Singh Ahluwalia. ==Early life== Jassa Singh Ahluwalia had a son born in 1747, but unfortunately, the child passed away. He had two daughters, one of whom was married to Mohar Singh from Fatahabad, and the other to Murar Singh from Sultanwind. Since Jassa Singh Ahluwalia did not have a brother, his second cousin Bhag Singh, who was the son of Ladha Singh and born in 1747, succeeded him. ==Military campaign== In 1785, a fierce battle erupted in Amritsar between the Bhangis and Mahan Singh Sukerchakia. Mahan Singh found himself trapped with no way out, but Bhag Singh, in a show of goodwill, allowed Mahan Singh to escape through his Katra. Despite being pursued by the Bhangis, Bhag Singh sent his forces to chase them down, ultimately ensuring Mahan Singh's safety. That same year, Bhag Singh demonstrated his magnanimity by assisting Jassa Singh Ramgarhia, helping him recover his lost territories. In 1789, Bhag Singh allied with the Kanhaiyas to take Batala from the Ramgarhias. During this conflict, Man Chand, the younger brother of Raja Samar Chand Katoch of Kangra, came to assist Jassa Singh, but Bhag Singh intercepted him, forcing him to flee. In 1792, during a pilgrimage to Jawalamukhi, Bhag Singh met Raja Sansar Chand Katoch. The two leaders exchanged turbans as a gesture of friendship, and their sons, Fatah Singh Ahluwalia and Anurodh Chand, also followed suit to strengthen the bond between the families. After Jai Singh Kanhiya's death in 1793, his widow, Sada Kaur, took control of the Kanhiya misl. Seeking revenge for her husband's death, she allied with her son-in-law, Ranjit Singh, and Bhag Singh Ahluwalia. Together, they besieged Jassa Singh Ramgarhia in the Mianil fort by the River Beas, but their efforts were interrupted by a flood that thwarted their plans ==Death== In 1798, Bhag Singh dispatched his general, Hamir Singh, to attack Jassa Singh Ramgarhia, but Hamir Singh was repelled and forced to retreat. Three years later, in 1801, Bhag Singh launched an attack on Jassa Singh Ramgarhia's son, Jodh Singh Ramgarhia, at Phagwara. During the battle, Bhag Singh fell from his horse and lost his life. ==References== Category:1747 births Category:1801 deaths Category:Sikhism",
 "title": "Bhag Singh Ahluwalia"
}