{
 "id": "1152264",
 "text": "Rukoilevaisuus (\"the Prayer Movement\") is a Finnish Lutheran revival movement that emerged in the 18th century. It is one of the oldest revivalist movements in Finland, emphasizing deep personal prayer, humility, and strict moral discipline. The movement continues to have followers, primarily in western Finland, particularly in the Satakunta region. == Origins == === Pietism influence === The movement arose under the influence of Pietism, a religious reform movement that stressed personal faith and devotion over formal church rituals. Finnish pastors and laypeople embraced these ideas, particularly in rural areas where access to formal religious education was limited. === Antti Achrenius’ Leadership === Antti Achrenius (1706–1769), a clergyman in Satakunta, is considered a key figure in the movement. He promoted fervent prayer meetings and strict adherence to Lutheran teachings, inspiring many followers. == Beliefs and practices == * Prayer and Humility: Followers emphasize heartfelt prayer and self-reflection as central to spiritual life. * Moral Discipline: The movement advocates strict living, avoiding vices such as drinking and gambling. * Communal Worship: Group prayer meetings and hymn singing are common practices, often held in homes or small chapels. == Challenges == * Criticism from the Church: Early on, the movement faced opposition from the official Evangelical Lutheran Church of Finland, which viewed it as overly emotional and disruptive. * Modern Decline: While still active, the movement has fewer followers today due to societal changes and urbanization. == Legacy == The Prayer Movement remains an important part of Finland's religious heritage. It has influenced Finnish hymnody and spiritual practices, with some of its traditions incorporated into mainstream Lutheran worship. Communities tied to Rukoilevaisuus continue to hold prayer meetings and preserve the movement’s teachings. Category:Christianity in Finland * Category:Lutheran revival movements",
 "title": "Rukoilevaisuus"
}