{
 "id": "1152795",
 "text": "Sir Thomas Sutherland, ( 16 August 1834 – 1 January 1922) was a Scottish banker and politician, initially elected to represent the Liberal Party and then as a Liberal Unionist Party. He founded The Hongkong and Shanghai Banking Corporation which was the founding member of HSBC Group and directed the P&O; Company. ==Career== Sutherland got his start clerking in the London office of the Peninsular and Oriental Steam Navigation Company (P&O;). Soon after, P&O; promoted Sutherland to superintendent, assigning him to British Hong Kong to manage the firm's Asian operation. In 1863 he became the first chairman of the Hong Kong and Whampoa Dock. In order to help finance the burgeoning trade between China and Europe, and explore the potential for China—United States trade, Sutherland established The Hongkong and Shanghai Banking Corporation in 1865 and became its first vice-chairman. He was appointed member of the Legislative Council of Hong Kong from 1865 to 1866. In 1872 he was appointed Managing Director of P&O.;Debretts Guide to the House of Commons 1886 In November 1884, Sutherland was elected at a by-election as the Member of Parliament (MP) for Greenock. A Liberal, he was re-elected in 1885, but when the Liberals split over Irish Home Rule he joined the breakaway Liberal Unionist Party. He was re-elected as a Liberal Unionist in 1886, but lost the seat at the 1892 general election. However, he was reinstated when his opponent was unseated on petition, and held the seat until he stood down at the 1900 general election. ==References== Category:1834 births Category:1922 deaths Category:British bankers Category:Scottish businesspeople Category:Members of the British House of Commons for Scottish constituencies Category:UK MPs 1880–1885 Category:UK MPs 1885–1886 Category:UK MPs 1886–1892 Category:UK MPs 1892–1895 Category:UK MPs 1895–1900 Category:Hong Kong businesspeople Category:Knights Grand Cross of the Order of St Michael and St George",
 "title": "Thomas Sutherland"
}