{
 "id": "1152903",
 "text": "Tara Singh Ghaiba (1710–1807) was a key Sikh leader and military commander, known for his role in the resistance against Afghan invasions and his leadership of the Dallewalia Misl, He controlled significant territories on both sides of the Sutlej River. ==Early life== Tara Singh Ghaiba came from a poor background and worked as a goat herder. He had about one hundred goats, which he would guide across the swollen Bein stream using ropes. This clever method earned him the nickname \"Ghaiba,\" which means someone who uses clever tricks. His life took a turn when a notorious robber named Sulaiman stole his goats, and other thieves took his few belongings. In despair, Tara Singh Ghaiba left his village, converted to Sikhism, and turned to a life of banditry. His bravery and bold actions soon gained him many follower ==Military Campaign== In March 1757, when Tara Singh was going to Amritsar with karora Singh Singh, he came to know that Timur Durrani had taken the treasure looted by Ahmad Shah Abdali from Delhi to transport to Kabul. They attacked the Afghan guards in the darkness of the night and looted a considerable amount of treasure and then left for Amritsar. In 1760, Tara Singh Ghaiba seized control of the Dharamkot and Fatahgarh. He gave Fatahgarh to his cousins, Dharam Singh and Kur Singh, while keeping Dharamkot for himself. He continued his conquests in the Jalandhar Doab, capturing. He also occupied Nawanshahar Doaba and seized Rahon. he made rahon his headquarter.Singha, Bhagata (1993). A History of the Sikh Misals. Patiala, India:Publication Bureau, Punjabi University. In March 1763, when Tara Singh was on his way to Anandpur to celebrate Hola Mahila, he plundered a convoy belonging to Shailendra that was heading to Sirhind, In May 1763, he obtained a large amount of booty from the sack of Kasur, In April 1775, the Sikhs, led by Rai Singh Bhangi, Tara Singh Ghaiba Dallewalia, and Baghel Singh Karorasinghia, gathered their forces near Karnal and crossed the Yamuna River. Zabita Khan, in charge of the region, retreated from his stronghold at Garhi Duhtar to Ghausgarh as the Sikhs advanced. They first attacked Lakhnauti, then moved on to Gangoh, where they plundered Rs. 60,000 from the locals. They also demanded Rs. 5,000 from Ambahta, accepting only Rs. 2,000 before moving on. After burning Nanautah, they besieged Deoband, where they broke into the town using tunnels and tortured the local officer, eventually forcing the residents to pay Rs. 12,000 as tribute. The Sikhs continued their campaign, moving to Ghausgarh, where Zabita Khan, realizing he couldn't resist, paid them Rs. 50,000 and formed an alliance against the Mughal Emperor Shah Alam II. The Sikhs then raided villages on their way south to Delhi, plundering areas like Shamli, Kairana, Kandhla, and Meerut, before crossing back over the Yamuna. Their disturbances near Delhi were noted in a letter warning of the threat they posed. The Sikhs continued their raids for several months, burning areas like Paharganj and Jaisinghpura. After facing resistance and suffering casualties, they reached Khurja but were defeated by Najaf Khan at Meerut, forcing them to retreat. By late July, they crossed the Yamuna near Sonipat and Panipat. In March 1783, Tara Singh Ghaiba was part of a Sikh contingent in Delhi, where he took two cannons from the Red Fort and brought them to Rabon. Additionally, he assisted Baghel Singh in building seven Gurdwaras in Delhi. In April 1789, Rane Khan and Ali Bahadur led their forces across the Jamuna River to collect tribute from the Cis-Satluj Sikh chiefs. Baghel Singh sent letters to the Sikhs across the Satluj River, asking for help against Rane Khan. Rane Khan marched to Shahabad and was joined by Diwan Nanumal from Patiala. Nanumal attempted to settle the tribute issue by offering four lakh rupees annually and two lakh rupees for the army's expenses. However, Rane Khan demanded six lakh rupees and two lakh for expenses. Nanumal agreed but wanted Rane Khan to drive out about 12,000 Sikhs who were camped near Patiala's borders. Rane Khan quickly realized that Nanumal was seeking help from across the Satluj, so he decided to collect the tribute before any outside help arrived. He advanced towards Patiala, but the Sikhs from Jullundur and Bari Doabs were already in the region to oppose him. As the Maratha forces under Baluji Ingle and Kashi Rao approached, they were attacked by Tara Singh Ghaiba on April 15, 1789, The battle resulted in approximately 250 casualties, with both sides suffering losses. Expecting an attack from the trans-Satluj Sikhs, Rane Khan quickly made peace and withdrew. ==Death== In 1807, Tara Singh Ghaiba was killed during the attack on Naraingarh. Maharaja Ranjit Singh launched an assault and took control of all the Dallevalia territories, including Rahon, incorporating them into his empire. ==References== Category:1710 births Category:1807 deaths Category:Indian people Category:Sikhism",
 "title": "Tara Singh Ghaiba"
}