{
 "id": "1152791",
 "text": "The Hongkong and Shanghai Banking Corporation Limited (), commonly abbreviated as HSBC and formerly known as HongkongBank (; styled Wayfoong by the bank), is the Hong Kong–based Asia-Pacific subsidiary of the HSBC banking group, for which it was the parent entity until 1991. The largest bank in Hong Kong, HSBC operates branches and offices throughout the Indo-Pacific region and in other countries around the world. It is also one of the three commercial banks licensed by the Hong Kong Monetary Authority to issue banknotes for the Hong Kong dollar. ==Hong Kong banking== Under the HSBC brand, the bank maintains a network of around 220 branches throughout Hong Kong, from which it offers a wide range of financial products and services. For some time in the late 1980s and early 1990s, the bank was known by the name HongkongBank in its native city, although it now trades as HSBC. During that period, it also adopted the idiosyncratic practice of calling its ATMs Electronic Teller Card (ETC) machines. ===Headquarters=== The HSBC Hong Kong headquarters building is located in No 1 Queen's Road Central in the Central district on Hong Kong Island.\"Contact Us.\" HSBC. Retrieved on 12 September 2011. \"The Hongkong and Shanghai Banking Corporation LtdThe Hongkong and Shanghai Banking Corporation - Hong Kong Address:GPO Box 64, Hong Kong, 1 Queen's Road Central, Hong Kong SAR, China\" It was also home to HSBC Holdings's headquarters until the latter firm's move to London to meet the requirements of the UK regulatory authorities after the acquisition of the Midland Bank in 1992. It was designed by British architect Norman, Lord Foster, and was the most expensive building in the world based on usable floor area at the time it was built. ===Hong Kong dollar bank notes=== HSBC is one of the three commercial banks which are authorised to issue banknotes for Hong Kong - the other two being the Bank of China (Hong Kong) and Standard Chartered Bank (Hong Kong).Note-issuing Banks from HKMA website. Retrieved 2018-06-03 Of the total notes in circulation measured by value, HSBC is the most prolific issuer, its notes representing 67.7% of those in issue. Hong Kong is unusual in that it is one of the few countries or territories where commercial banks are still permitted to issue their own banknotes. === Closure of bank accounts === In June 2023, it was reported that HSBC had closed the bank accounts of the pro-democracy League of Social Democrats (LSD), and had refused to give reasons for its decision. ==References== Category:Companies of Hong Kong Category:Banks of Asia",
 "title": "HSBC (Hong Kong)"
}