{
 "id": "1152113",
 "text": "Matiullah Jan is a senior Pakistani journalist and YouTuber. On the evening of 27 November 2024, Matiullah Jan, who had been investigating casualties from the PTI do-or-die protest, and his colleague Saqib Bashir were abducted by men in black uniforms from the parking lot of the Pakistan Institute of Medical Sciences (PIMS) in Islamabad. They were blindfolded and forced into a vehicle. Bashir recounted, \"We were collecting data on the casualties.\" Some suggest that Jan’s abduction might be linked to a controversial interview he conducted with a man who allegedly claimed to be the brother of one of the five security officials killed during the PTI protest. In the interview, the man asserted that the police and security forces were responsible for the deaths, rather than the PTI protestors. However, a video released by the government reportedly showed a local PTI protestor in a V8 vehicle carrying out the attack. Hours before his abduction, Jan had appeared on a TV program where he read from what he claimed were hospital records contradicting the government's denial that live ammunition was used by security forces or that any protesters were killed during the dispersal. Bashir was released on a street three hours later, while Jan was subsequently charged with terrorism and possession of narcotics. A First Information Report (FIR) alleged that he was found with 246 grams of methamphetamine at a vehicle checkpoint in Islamabad's E-9 area. The case was registered at 3:20 a.m., nearly an hour after the reported incident. As of November 28, his whereabouts remain unknown, according to another colleague Asad Ali Toor. ==Background== Jan has worked for several media outlets in Pakistan. He is known for his criticism of the Pakistani government. Due to his criticism on establishment he has been allegedly threatened many times. Matiullah Jan was sacked from Waqt News, where he was working as an anchor. This was allegedly due to pressure from security agencies. He currently runs his own YouTube channel. ==See also== *List of kidnappings *List of solved missing person cases ==References== Category:Living people Category:Pakistani journalists Category:2010s missing person cases Category:July 2020 crimes in Asia Category:Formerly missing people Category:Missing person cases in Pakistan Category:Kidnapped Pakistani people Category:Kidnappings in Pakistan Category:Year of birth missing (living people)",
 "title": "Matiullah Jan"
}