{
 "id": "1152266",
 "text": "Antti Achrenius (1706–1769) was a Finnish Lutheran clergyman and a key figure in the Rukoilevaisuus (Prayer Movement), one of the oldest revivalist movements in Finland. His leadership and teachings had a lasting impact on Finnish religious life, particularly in the Satakunta region. == Early life and education == Achrenius was born in 1706 in Suonenjoki, Finland. He studied theology at the Royal Academy of Turku, the leading educational institution in Finland at the time. After completing his studies, he was ordained as a priest in the Evangelical Lutheran Church of Finland. == Role in the Prayer Movement (Rukoilevaisuus) == * Spiritual leadership: Achrenius became a pastor in Huittinen, where he introduced practices emphasizing deep prayer, personal piety, and strict moral discipline. These ideas aligned with the broader Pietism movement, which stressed heartfelt faith over formal rituals. * Prayer meetings: He organized prayer meetings and hymn singing, encouraging laypeople to engage actively in their faith. These gatherings became central to the Rukoilevaisuus movement and attracted followers from across the region. * Preaching style: Achrenius was known for his passionate sermons, which focused on repentance and spiritual renewal. His teachings inspired devotion but also faced criticism from more traditional church authorities. == Challenges and legacy == Achrenius faced opposition from some leaders of the Lutheran Church, who viewed his practices as overly emotional and disruptive to established norms. Despite this, his influence spread, and the Rukoilevaisuus movement continued to grow. His legacy is preserved in Finnish religious history as a reformer who brought new energy and focus to spiritual life in rural Finland. Many of his hymns and teachings remain part of Finnish Lutheran tradition. == Family == Achrenius's wife in 1776 was Kristina Katarina, the daughter of the royal secretary Abraham Sahlstedt. They had ten kids. Anders Johan Achrenius (1778–1819) was the mayor of Naantali. His son Otto Jonathan Achrenius (1782–1849) graduated high school but had mental health issues.Ylioppilasmatrikkeli 1640–1852: Otto Johathan Achrenius Their daughter Kristina Katarina (1786–1856) married Lieutenant Gustaf Reinhold Finckenberg, who rented the Nyynäinen farm in Lemu from 1801 to 1823..Ylioppilasmatrikkeli 1640–1852: Gustaf Reinhold Finckenber == References == Category:Born in 1745 Category:Died in 1810 Category:Evangelical Lutheran Church of Finland Category:Christianity in Finland",
 "title": "Antti Achrenius"
}