{
 "id": "1152957",
 "text": "The Chrysler 200 is a mid-size sedan produced by Chrysler from 2011 to 2017 across two generations. The car was available in four-door sedan and two-door convertible (first generation only) body styles. ==First Generation (2011–2014)== The first-generation Chrysler 200 was produced from 2010 to 2014 and was based on the Chrysler JS platform, shared with the Dodge Avenger and Dodge Journey. It was manufactured at the Sterling Heights Assembly in Michigan and launched in December 2010. ===Features=== The first-generation 200 featured a 2.4 L I4 engine producing 173 hp and a 3.6 L Pentastar V6 with 283 hp. The V6 engine was available in a flex-fuel version. ===Convertible Model=== A two-door convertible version of the Chrysler 200 was available in early 2011, and This model maintained the same engine options as the sedan. ===Trim Variants and Special Editions=== The 200 offered trims such as LX, Touring, Limited, and S. The 200 S Special Edition was introduced in 2013 and was made in collaboration with Carhartt. and The 200 Super S followed as a performance-oriented model, equipped with mechanical enhancements like a cold- air intake and coil-over suspension. ===Lancia Flavia=== In Europe, the Chrysler 200 Convertible was rebranded as the Lancia Flavia from 2012 to 2014. This variant was only available in left-hand drive markets and was not sold in the UK or Ireland. ==Second Generation (2015–2017)== The second-generation Chrysler 200 debuted at the 2014 North American International Auto Show and was produced from 2014 to 2016. It was based on the Fiat Compact US Wide (CUSW) platform, shared with the Dodge Dart and Jeep Cherokee. The new generation was available only as a sedan and was intended to compete with other mid-size sedans like the Toyota Camry, Honda Accord, and Ford Fusion. ===Features=== The 2015 model featured a modern, dial-based gear shift and came with two engine options a 2.4 L TigerShark I4 producing 184 hp and a 3.6 L Pentastar V6 generating 295 hp. The V6 engine was available with an all- wheel-drive system that could disconnect when not needed The 200 also included a stop/start system for the 2.4 L engine. ===Trims and Upgrades=== Initial trims included LX, Limited, 200S, and 200C. In 2016, Chrysler introduced new trim levels like the Touring, Limited Platinum, and 200C Platinum, which replaced the previous trims. The 200S Alloy Edition was also added to the lineup. ==Markets== The Chrysler 200 was primarily sold in the United States, with limited availability in select other regions. It was positioned to compete with other mid-size sedans in North America, but did not reach the same sales success as rivals like the Toyota Camry or Honda Accord. ==Discontinuation== Production of the Chrysler 200 ceased on December 2, 2016. FCA CEO Sergio Marchionne cited the car's poor financial returns as a primary reason for discontinuation, stating that it was one of the least profitable products in the company's lineup. Marchionne noted that while the car had its merits, including high sales in its segment, it did not meet profitability targets for FCA. Marchionne also commented on a design flaw, criticizing the rear-seat entry as inadequate due to the car's roof slope, a characteristic shared with the Hyundai Sonata, which Chrysler had taken inspiration from. Despite these issues, some industry experts point to FCA's shift toward SUVs and trucks as the main factor behind the decision to end the 200’s production. The company's focus shifted to more profitable segments, such as the Jeep and Ram models. In 2017, Marchionne explained that the decision was also part of FCA's strategy to allocate production capacity to more lucrative vehicle segments. The production of the Ram pickup was moved to the Sterling Heights plant, where the 200 was once manufactured. ==Notes== ==References== Category:Chrysler automobiles",
 "title": "Chrysler 200"
}