{
 "id": "115292",
 "text": "Social Darwinism refers to any way of thinking that tries to apply biological evolution to human societies. Social Darwinists believe that some people are superior to others. They think that people should be treated differently because of this. Social Darwinism was used to support racism, eugenics, fascism, and Nazism. Evolution by natural selection is a biological theory created by Charles Darwin. This theory says that in nature some individuals will be more successful than others. The successful individuals will live longer and produce more offspring. This is sometimes called “survival of the fittest”. The offspring will have the traits that made their parents successful, causing the species to have more of these traits over time. Darwin’s On the Origin of Species did not discuss human evolution. The Descent of Man did, but Darwin opposed racism and generally did not believe that natural selection was acting in modern society. Darwin did not create social Darwinism. In the late 1800s and early 1900s, people started using the idea of “survival of the fittest” or evolution on humans. Early social Darwinists include Herbert Spencer and Francis Galton. Social Darwinists use evolutionary theory in different ways. Some argued that people who were superior (smarter or stronger) should have more wealth and power. Other people argued that different races or nations were less advanced than others. == Proponents == === Herbert Spencer === Herbert Spencer believed in evolutionary progressivism. This means that all human societies go through the same stages of progress. In The Social Organism (1860), Spencer compares society to a living organism and argues that society evolves and increases in complexity the same way biological organisms evolve. He believed that European societies were more advanced than other ones. Spencer was inspired by Thomas Malthus. He followed Lamarck’s theory of evolution instead of Darwin’s natural selection. Spencer's major work, Progress: its law and cause (1857), was released two years before the publication of Darwin's On the Origin of Species. However, his later theories were influenced by Darwin and he created the phrase “survival of the fittest”. In many ways, Spencer's theory of social evolution has more in common with Auguste Comte's positivism than with Darwin. == Eugenics == Social Darwinism is part of the basis for the eugenics movement of the 20th century. Eugenicists wanted to use genetics to improve humanity. They thought that “good” genes could be identified. Good genes included traits like higher intelligence or being healthier. If people with good genes had children together, then the children would gain those good traits. This would lead to society becoming better overall. Francis Galton is the creator of eugenics. He proposed selective breeding programs in which humans with good traits would be matched together for marriage. In the United States many people were inspired by Galton’s ideas. Eugenics in the US was focused on negative eugenics, or removing “bad” traits instead of trying to increase good traits. They considered disability, being poor, breaking the law, or having sex outside of marriage to be bad traits. 30 states had laws that forced certain people to be sterilized against their will. Over 64,000 American citizens were forcibly sterilized in the 1920s and 1930s. Most of these people were poor, disabled, or minorities. Eugenics and social Darwinism became less popular in America after the 1940s because of their importance to the Nazi party during World War 2. Scientists also began finding evidence against social Darwinism at this time. == References == Category:Evolutionary biology",
 "title": "Social darwinism"
}