{
 "id": "1152824",
 "text": "There are direct links between Hinduism and Zoroastrianism. Many analysts of Hinduism claim that Hinduism embraces elements of all contemporary religions, Hence scriptures of Hinduism such as Vedas and Puranas, along with Buddhism, Jainism and Sikhism, have incorporated and adopted significantly elements from the Avesta of Greek religion and Zoroastrianism: Asura from Ahura, Deva from Daeva, Hindu monotheism from Ahura Mazda, Varuna, Vishnu and Garuda from Agni, the heavenly juice from the drink called Soma-Haoma, the contemporary Indian and Persian war of Devasuras from Arya, Arya from Mithra, Mitra from Mithra, Dyaushpita and Jupiter from Jupiter, Yagya to Yagya, Narasanga to Narasangasa, Indra, Gandharva to Gandharva, Vajra, Vayu, Mantra, Yama, Ahuti, Hamta to Sumati etc. ==Cognate terms== The following is a list of cognate terms that may be gleaned from comparative linguistic analysis of the Rigveda and Avesta. Both collections are from the period after the proposed date of separation (c. 2nd millennium BC) of the Proto-Indo-Iranians into their respective Indic and Iranian branches. Vedic Sanskrit Avestan Common meaning āp āp \"water,\" āpas \"the Waters\" Apam Napat, Apām Napāt Apām Napāt the \"water's offspring\" aryaman airyaman \"Arya-hood\" (lit:** \"member of Arya community\") Asura Mahata/Medha (असुर महत/मेधा) Ahura Mazda \"The Supreme Lord, Lord of Wisdom\" rta asha/arta \"active truth\", extending to \"order\" and \"righteousness\" atharvan āθrauuan, aθaurun Atar \"priest\" ahi azhi, (aži) \"dragon, snake\", \"serpent\" daiva, deva daeva, (daēuua) a class of divinities manu manu \"man\" mitra mithra, miθra \"oath, covenant\" asura ahura another class of spirits sarvatat Hauruuatāt \"intactness\", \"perfection\" Sarasvatī (Ārdrāvī śūrā anāhitā, आर्द्रावी शूरा अनाहिता) Haraxvati/Haraxvaitī (Ārəduuī Sūrā Anāhitā) a controversial (generally considered mythological) river, a river goddess sauma, soma haoma a plant, deified svar hvar, xvar the Sun, also cognate to Greek helios, Latin sol, Engl. Sun Tapati tapaiti Possible fire/solar goddess; see Tabiti (a possibly Hellenised Scythian theonym). Cognate with Latin and several other terms. Vrtra-/Vr̥tragʰná/Vritraban verethra, vərəθra (cf. Verethragna, Vərəθraγna) \"obstacle\" Yama Yima son of the solar deity Vivasvant/Vīuuahuuant yajña yasna, object: yazata \"worship, sacrifice, oblation\" Gandharva Gandarewa \"heavenly beings\" Nasatya Nanghaithya \"twin Vedic gods associated with the dawn, medicine, and sciences\" Amarattya Ameretat \"immortality\" Póṣa Apaosha \"demon of drought\" Ashman Asman \"sky, highest heaven\" Angira Manyu Angra Mainyu \"destructive/evil spirit, spirit, temper, ardour, passion, anger, teacher of divine knowledge\" Manyu Maniyu \"anger, wrath\" Sarva Sarva \"Rudra, Vedic god of wind, Shiva\" Madhu Madu \"honey\" Bhuta Buiti \"ghost\" Mantra Manthra \"sacred spell\" Aramati Armaiti \"piety\" Amrita Amesha \"nectar of immortality\" Amrita Spanda (अमृत स्पन्द) Amesha Spenta \"holy nectar of immortality\" Sumati Humata \"good thought\" Sukta Hukhta \"good word\" Narasamsa Nairyosangha \"praised man\" Vayu Vaiiu \"wind\" Vajra Vazra \"bolt\" Ushas Ushah \"dawn\" Ahuti azuiti \"offering\" púraṁdhi purendi bhaga baga \"lord, patron, wealth, prosperity, sharer/distributor of good fortune\" Usij Usij \"priest\" trita thrita \"the third\" Mas Mah \"moon, month\" Vivasvant Vivanhvant \"lighting up, matutinal\" Druh Druj \"Evil spirit\" Ahi Dasaka Azhi Dahaka \"biting serpent\" ==References== Category:Hinduism Category:Zoroastrianism",
 "title": "Hinduism-Zoroastrianism relations"
}