{
 "id": "1152447",
 "text": "Kashyap \"Kash\" Patel (born February 25, 1980) is an American lawyer, politician and writer who has been the 9th and current Director of the Federal Bureau of Investigation since 2025. Patel was a U.S. National Security Council official, senior advisor to the acting Director of National Intelligence, and chief of staff to the acting United States secretary of defense during the first Donald Trump presidency. Patel is a member of the Republican Party. He was a senior aide to congressman Devin Nunes. He began his career as a federal public defender and worked for the United States Armed Forces. Patel had an important role in helping Republicans during investigations into Trump and Russian interference in the 2016 election. In November 2024, President-elect Donald Trump named Patel as his nominee for director of the Federal Bureau of Investigation to replace Christopher A. Wray. He was confirmed by the U.S. Senate in February 2025. ==Early life== Patel was born on February 25, 1980, in Garden City, New York. His parents are Indian Gujaratis who immigrated to the United States. Patel was raised as a Hindu. Patel studied history and criminal justice at the University of Richmond. He then went to Pace University School of Law. He also studied at the University College London. ==Early career== After law school, Patel moved to Florida and spent eight years as a public defender. He represented clients charged with felonies including international drug trafficking, murder, firearms violations, and money smuggling. In 2017, Patel was appointed senior counsel on counterterrorism at the House Intelligence Committee. In April 2017, Patel became the senior committee aide to House Intelligence Committee chair Devin Nunes. Patel played an important role in the Republican reponse to the investigations into Donald Trump and Russian interference in the 2016 election. After Democrats took control of the U.S. House of Representatives in January 2019, Patel worked for about a month as a senior counsel at the House Reform and Oversight Committee. ==First Trump presidency== Patel was hired in February 2019 as a staffer for President Donald Trump's National Security Council (NSC) and in July 2019 became Senior Director of the Counterterrorism Directorate. He led a secret mission to Damascus in early 2020 to negotiate the release of American hostages being held by the Syrian government. In February 2020, Patel moved to the Office of the Director of National Intelligence (ODNI), becoming a Principal Deputy to Acting Director Richard Grenell. Trump proposed Patel as a possible leader for either the FBI or CIA in early 2021 after the 2020 United States presidential election. Trump wanted Patel to be either CIA Deputy Director or Acting Director, which would have led to the firing of then-Director Gina Haspel. Many politicians, including from Attorney General William Barr, were against the idea. In November 2020, Trump named Patel chief of staff to Acting Secretary of Defense Christopher C. Miller, after Trump's firing of Secretary of Defense Mark Esper. Patel reportedly argued that Esper was not loyal to Trump by not wanting to use military troops to Washington to stop the George Floyd protests. After the November 2020 election, Patel blocked some Department of Defense officials from helping the Joe Biden administration transition. ==Post-First Trump presidency== Patel has been called a \"Trump loyalist\". In April 2022, Patel became a member of the board of directors for the Trump Media & Technology Group. Patel is the author of a children's picture book, titled The Plot Against the King, that spread information about the investigations into Russian interference in the 2016 United States elections. == Director of the FBI == === Nomination === On November 30, 2024, Trump named Patel as his nominee for director of the Federal Bureau of Investigation to replace Christopher A. Wray. Following his nomination, Patel was targeted by Iranian hackers, who accessed some of his communications. His nomination hearing was held on January 30, 2025, at the U.S. Senate Judicial Committee. On February 13, 2025, the Senate Judiciary Committee voted 12-10 along party lines to recommend Kash Patel's nomination to serve as FBI director. On February 18, 2025, the Senate voted 48-45 along party lines to forward Patel's nomination for a full vote in the Senate. He was confirmed by the U.S. Senate on February 20 with a 51-49 vote. Republican Senators Susan Collins, Lisa Murkowski and Mitch McConnell voted against the nomination, joining all Democratic senators. ===Tenture=== On February 21, 2025, U.S. Attorney General Pam Bondi swore Patel in as the 9th director of the Federal Bureau of Investigation. He is the youngest and first Asian-American to fill the position. On February 24, 2025, Patel was sworn in as the Acting chief of the Bureau of Alcohol, Tobacco, Firearms and Explosives (BATFE). The move came just several days after Patel was sworn in as Director of the FBI. ==Personal life== Patel lives in Washington, D.C. ==References== ==Other websites== * * Category:1980 births Category:Living people Category:Lawyers from Washington, D.C. Category:Lawyers from New York (state) Category:Lawyers from Florida Category:Politicians from Washington, D.C. Category:Politicians from New York (state) Category:Politicians from Florida Category:Republican Party (United States) politicians Category:Writers from Washington, D.C. Category:Writers from New York (state) Category:Writers from Florida Category:American children's writers Category:Lawyers from Nevada Category:Politicians from Nevada Category:Writers from Nevada Category:Directors of the Federal Bureau of Investigation",
 "title": "Kash Patel"
}