{
 "id": "1152778",
 "text": "Giulio Cesare Andrea 'Julius' Evola (Italian: [ˈɛːvola]; 19 May 1898 – 11 June 1974) was an Italian far-right thinker. Evola saw his beliefs as traditional, upper-class, warlike, and imperial. He was a strange thinker in Fascist Italy and had connections to Nazi Germany. After the war, he guided the Italian neo- fascist and militant Right. == Early life == Giulio Cesare Andrea Evola was born in Rome on 19 May 1898. His family were strong Roman Catholic aristocrats, and he is sometimes called a baron. Evola didn’t talk much about his early life, and he hid some details of his personal life. He chose the name \"Julius\" to connect himself to ancient Rome. Evola rebelled against his Catholic background. He studied engineering at the Istituto Tecnico Leonardo da Vinci in Rome, but he did not finish his studies. He later said that he did not want to be known for academic titles like “doctor” or “engineer.” As a teenager, he became interested in painting, which he thought was one of his natural talents. He also enjoyed reading, especially the works of Oscar Wilde and Gabriele d'Annunzio. He was introduced to philosophers such as Friedrich Nietzsche and Otto Weininger. Other early influences on his thinking included Carlo Michelstaedter and Max Stirner. Evola was drawn to the avant-garde, and for a short time, he joined Filippo Tommaso Marinetti's Futurist movement during his time at university. However, in 1916, he broke with Marinetti because he disagreed with Marinetti's extreme nationalism and support for industry. During World War I, Evola served as an artillery officer on the Asiago plateau. Even though he was not sure that Italy was fighting on the right side, as he admired Germany for its discipline, he volunteered in 1917 and saw some frontline service in 1918. After the war, he became a painter in the Dadaist movement in Italy. He called his paintings \"inner landscapes\" and wrote poetry in French, which he recited in cabarets with classical music. Through his art and poetry, he became a well-known representative of Dadaism in Italy. However, in 1922, he gave up painting and poetry because he thought avant-garde art had become commercialized and too academic. Evola was also a passionate mountaineer, which he saw as a way to have spiritual experiences. Evola went through a \"spiritual crisis\" where he felt unhappy with regular life and wanted to go beyond normal human activities. He experimented with drugs and magic, which he said almost drove him mad. In 1922, when he was 23 years old, he thought about suicide. However, he avoided it after reading a Buddhist text that talked about shedding all identities and reaching a higher state of being. Evola later wrote about this in his book The Cinnabar Path. Evola also published a book called The Doctrine of Awakening, which he saw as a way to repay his debt to Buddhism. His interests then turned to spiritual studies, transcendental ideas, and things beyond regular reason. He began reading esoteric texts and became more interested in the occult, alchemy, magic, and Eastern teachings, especially Tibetan Tantric yoga. Evola’s thoughts and feelings were similar to other intellectuals who were lost after World War I, but his ideas were more extreme and reactionary. == Written works == Julius Evola wrote more than 36 books and 1,100 articles. In some of his 1930s writings and works about magic, he used different names, including \"Ea\" (from a Babylonian god), \"Carlo d'Altavilla,\" and \"Arthos\" (from Arthurian legend). === Christianity === In 1928, Evola wrote a book called Pagan Imperialism, which attacked Christianity and suggested that Fascism should follow the values of Ancient Rome and Western esotericism. He wanted to bring back the old caste system and an aristocratic society. Although he used the word \"fascism,\" both Benito Mussolini's government and the Vatican criticized him.citation needed Some scholars believe that Mussolini used Evola’s ideas to warn the Vatican about \"anti-clerical fascism.\" Richard Drake wrote that Evola often attacked the Catholic Church. In April 1928, a Catholic journal called Revue Internationale des Sociétés Secrètes accused him of being a Satanist. In The Mystery of the Grail (1937), Evola rejected Christian ideas about the Holy Grail and said it was a symbol of an ancient spiritual force. He believed that the Ghibellines, who fought the Guelphs in 13th-century Italy, kept alive pre- Christian traditions. He thought the Guelphs' victory led to the decline of the warrior caste.135 He also connected the book to the Protocols of the Elders of Zion, a widely discredited document used in antisemitic conspiracy theories.. Evola saw Christianity as a cause of decline because its values of equality and accessibility went against the Roman ideals of \"duty, honor, and command.\" === Buddhism === In The Doctrine of Awakening (1943), Evola wrote that the Pāli Canon represented the true teachings of Buddhism. He believed that Buddhism had an \"Aryan\" origin and had been misunderstood. His ideas were influenced by Friedrich Nietzsche, but he disagreed with Nietzsche’s rejection of asceticism. Evola said that the Pali Text Society supported his book, and it was published by an important Orientalist publisher.T. Skorupski. The Buddhist Forum, Volume 4. Routledge, 2005, pp. 11–20 However, some scholars, like Giuseppe Tucci, argued that Buddhism teaches universal kindness, which contradicts Evola’s ideas. Other experts, like Arthur Versluis, believed that Evola distorted Buddhism to fit his own theories. Despite this, the book inspired the Buddhist monk Ñāṇavīra Thera to take up a monastic life. === Modernity === Evola’s book Revolt Against the Modern World (1934) described an ideal Golden Age that had been lost over time. He argued that traditional societies were led by warriors who also had spiritual power. He believed that Western civilization was superior to the Eastern world and that intellectual questioning had weakened traditional values. Evola believed that only \"nonmodern\" ways of life could bring true renewal. His book was praised by Mircea Eliade, a historian of religion who supported the Iron Guard, a Romanian far-right group. Revolt Against the Modern World later became a cult classic among the far-right. His last major work, Ride the Tiger (1961), argued that it was impossible to restore traditional society because the world had fallen too far into the Kali Yuga, an age of decline in Hindu cosmology. Instead of politics, he suggested a personal way to survive modernity, using everything from modern music to hallucinogenic drugs for spiritual growth. By the 1960s, Evola believed that right-wing movements could not stop modern decay. However, he still supported violent action when the right moment came. === Other writings === Evola wrote for the fascist magazine Critica Fascista and edited the cultural page of Il Regime Fascista, a radical newspaper run by Roberto Farinacci. He also contributed to La Vita Italiana, an antisemitic magazine. In his 1945 essay American \"Civilization\", Evola criticized the United States as a place of \"vacuous individualism\" and consumer culture. He also wrote about war as a spiritual experience in his posthumous book Metaphysics of War.Lennart Svensson. Ernst JüngerA Portrait. Manticore Books, 2016. p. 202. Evola translated works by Oswald Spengler and José Ortega y Gasset into Italian. == References == Notes Works cited * Aprile, Mario (1984), \"Julius Evola: An Introduction to His Life and Work,\" The Scorpion No. 6 (Winter/Spring): 20–21. * * * Coletti, Guillermo (1996), \"Against the Modern World: An Introduction to the Work of Julius Evola,\" Ohm Clock No. 4 (Spring): 29–31. * * De Benoist, Alain. \"Julius Evola, réactionnaire radical et métaphysicien engagé. Analyse critique de la pensée politique de Julius Evola,\" Nouvelle Ecole, No. 53–54 (2003), pp. 147–69. * * * Drake, Richard H. (1988), \"Julius Evola, Radical Fascism and the Lateran Accords,\" The Catholic Historical Review 74: 403–419. * Drake, Richard H. (1989), \"The Children of the Sun,\" in The Revolutionary Mystique and Terrorism in Contemporary Italy (Bloomington: Indiana University Press, ), 114–134. * * * * * * * * * * * * * * Griffin, Roger (1985), \"Revolts against the Modern World: The Blend of Literary and Historical Fantasy in the Italian New Right,\" Literature and History 11 (Spring): 101–123. * Griffin, Roger (1995) (ed.), Fascism (Oxford University Press, ), 317–318. * Hans Thomas Hakl, \"La questione dei rapporti fra Julius Evola e Aleister Crowley\", in: Arthos 13, Pontremoli, Centro Studi Evoliani, 2006, pp. 269–289. * Hansen, H. T. (1994), \"A Short Introduction to Julius Evola,\" Theosophical History 5 (January): 11–22; reprinted as introduction to Evola, Revolt Against the Modern World, (Vermont: Inner Traditions, 1995). * Hansen, H. T. (2002), \"Julius Evola's Political Endeavors,\" introduction to Evola, Men Among the Ruins, (Vermont: Inner Traditions). * * * * * * * * Rees, Philip (1991), Biographical Dictionary of the Extreme Right Since 1890 (New York: Simon & Schuster, ), 118–120. * * * * * * * Stucco, Guido (1992), \"Translator's Introduction,\" in Evola, The Yoga of Power (Vermont: Inner Traditions), ix–xv. * Stucco, Guido (1994), \"Introduction,\" in Evola, The Path of Enlightenment According to the Mithraic Mysteries, Zen: The Religion of the Samurai, Rene Guenon: A Teacher for Modern Times, and Taoism: The Magic, the Mysticism (Edmonds, WA: Holmes Publishing Group). * * * * Wasserstrom, Steven M. (1995), \"The Lives of Baron Evola,\" Alphabet City 4 + 5 (December): 84–89. * * * * Category:1898 births Category:1974 deaths Category:Italian esotericists Category:Writers from Rome",
 "title": "Julius Evola"
}