{
 "id": "1152442",
 "text": "Govinda III of the Rashtrakuta Empire led two Campaigns in the south first one from 798–804 in which Shivamara II titled Muttarasa of Western Ganga dynasty and Dantivarman of Pallava dynasty were defeated and Gangawadi and Kanchipuram district was captured from them. The Western Ganga dynasty King Shivamara II was made Prisoner while the Pallava dynasty king Dantivarman surrendered to the Rashtrakutas. The Second Campaign was led by Govinda III during the Monsoon of 808 , the Dravidian kings had made an alliance against the Rashtrakuta Empire, to crush this alliance Govinda III led the Second Southern Campaign. The Dravidian kings were completely defeated, they were forced to surrender and pay the tribute. Their territories were either captured or they were made tributaries by Govinda III of Rashtrakuta Empire. ==Southern Campaign== ===First Southern Campaign=== ====War with Pallavas and Western Gangas==== Stambha governed Gangawadi during his father's lifetime, so it is likely that the main focus of the campaign against him was in southern Karnataka. After Stambha's defeat, Govinda launched an expedition against the Ganga ruler, Muttarasa, who had been imprisoned by the Rashtrakutas. Muttarasa may have allied with Stambha, hoping to regain his kingdom once Stambha became emperor. However, Govinda easily defeated him, and the Ganga kingdom was annexed to the Rashtrakuta empire by 798 AD. Stambha was reappointed as the Ganga viceroy until at least 802 AD. After his rule, Chakirāja succeeded him by 814 AD. Meanwhile, Charuponnera of Nolambawadi recognized Govinda's suzerainty. An inscription from Karshnapalle mentions a ruler named Banaras, who governed the Ganga Six-thousand province during the reign of Rashtrakuta king Govinda III. After Nandivarman's death, his son Dantivarman likely became king around 795 and ruled for over 51 years. During his reign, he clashed with Govinda III, who became king in 794. Govinda III invaded Pallava territory, captured Kanchi, and defeated Dantivarman, forcing him to pay tribute. By 804-805, Govinda III withdrew to his camp near the Tungabhadra River. Another inscription from Hulibidu mentions a hero named Sirigoppa, who died fighting against Dantivarman's army in Chikurambavi. This suggests Dantivarman may have attacked the village, which was controlled by the Rattas, allies of the Rashtrakutas. This could explain why Govinda III temporarily took control of Kanchi. ===Second Southern Campaign=== Govinda led a campaign to the south to defeat a coalition of Dravidian kings, including rulers from Gangawadi, Kerala, Pandya, Chola, and Pallava. He defeated all of them, with many of the Ganga army killed. Kanchi was retaken, and the Chola and Pandya kingdoms were conquered. The king of Ceylon, fearing the fate of these states, sent his own statue and that of his minister to Govinda as a sign of submission. Govinda sent them to Malkhed to be placed in front of a Shiva temple as victory columns. The southern campaign began after the monsoon in 808 A.D. and likely lasted until 810 or 811 A.D. By the end of his reign, Govinda, aging and near death, focused on ensuring the succession of his son, Amoghavarsa, who was born in 808 A.D. == References == == Other websites == * example.com Category:Rashtrakuta Empire",
 "title": "Govinda III's Southern Campaign"
}