{
 "id": "1152386",
 "text": "The 2024 FIA Formula 2 Championship is a motor racing championship for Formula 2 cars sanctioned by the Fédération Internationale de l'Automobile (FIA). ART Grand Prix entered the championship as the reigning Teams' Champions, having secured their title at the final race of the 2023 season in Abu Dhabi. The championship is the fifty-eighth season of Formula 2 racing and the eighth season run under the FIA Formula 2 Championship moniker. The category is run in support of selected rounds of the 2024 Formula One World Championship. == Entries == Entrant Driver name Rounds ART Grand Prix 1 Victor Martins 1–14 2 Zak O'Sullivan 1–11 Luke Browning 12–14 Prema Racing 3 Oliver Bearman 1, 3–11, 13 Gabriele Minì 12, 14 4 Andrea Kimi Antonelli 1–13 Enzo Fittipaldi 14 Rodin Motorsport 5 Zane Maloney 1–13 Leonardo Fornaroli 14 6 Ritomo Miyata 1–13 Juan Manuel Correa 14 DAMS Lucas Oil 7 Jak Crawford 1–14 8 Juan Manuel Correa 1–12 Dino Beganovic 13-14 Invicta Racing 9 Kush Maini 1–14 10 Gabriel Bortoleto 1–14 MP Motorsport 11 Dennis Hauger 1–12 Richard Verschoor 13-14 12 Franco Colapinto 1–10 Oliver Goethe 11–14 Van Amersfoort Racing 14 Enzo Fittipaldi 1–12 John Bennett 13 Amaury Cordeel 14 15 Rafael Villagómez 1–14 Hitech Pulse- Eight 16 Amaury Cordeel 1–13 Arvid Lindblad 14 17 Paul Aron 1–14 Campos Racing 20 Isack Hadjar 1–14 21 Pepe Martí 1–14 Trident 22 Richard Verschoor 1–12 Max Esterson 13 Zak O'Sullivan 14 23 Roman Staněk 1–11 Christian Mansell 12–14 PHM AIX Racing (1–3) AIX Racing (4–13) 24 Joshua Dürksen 1–14 25 Taylor Barnard 1–10 Niels Koolen 11–12 Cian Shields 13 Sami Meguetounif 14 Source: === Team changes === After Rodin Cars became Carlin's majority shareholder in 2023 and rebranded the team as Rodin Carlin, the Carlin family departed the team, with Rodin taking full ownership and renaming the team Rodin Motorsport. Rodin became the championship's first team ever to run under a non-European nationality. Following the partnership that saw Invicta Watch Group become Virtuosi Racing's title sponsor in 2023, the company purchased an ownership stake in the team and entered the 2024 season under the Invicta Racing guise. DAMS became DAMS Lucas Oil following a strengthened sponsorship deal with American oil company Lucas Oil. PHM Racing now operated independently of Charouz Racing System, after the latter co-ran the team during the 2023 season. Ahead of the season, PHM also announced the AIX Investment Group as a new title sponsor, changing the team's name to PHM AIX Racing. The AIX Investment Group completed its acquisition of PHM Racing ahead of the fourth round of the season and rebranded the team to AIX Racing. === Driver changes === Reigning champion Théo Pourchaire left ART Grand Prix and the series, moving to Japan to compete in the Super Formula Championship with Team Impul. Williams Driver Academy member Zak O'Sullivan replaced him, having finished second in the previous year's FIA Formula 3 season with Prema Racing. Prema Racing saw 2023 runner-up Frederik Vesti leave the championship to join Cool Racing to compete in the LMP2 class of the European Le Mans Series. Vesti was replaced by Andrea Kimi Antonelli, who skipped over FIA Formula 3 after securing the Formula Regional European Championship title in 2023. Rodin Motorsport replaced VAR-bound Enzo Fittipaldi with reigning Super Formula Champion Ritomo Miyata, who switched to racing in Europe to prepare for his endurance racing efforts with Toyota. DAMS saw both their drivers leave F2, with Ayumu Iwasa returning to Japan to compete in the Super Formula Championship with Team Mugen and Arthur Leclerc moving to the Italian GT Championship. The team fielded an all-American driver lineup in 2024, consisting of Jak Crawford, who moved over from Hitech Pulse- Eight after coming 13th in the championship in 2023, and Juan Manuel Correa, who left Van Amersfoort Racing after coming 19th in his first year since returning after his accident in 2019. Invicta Racing also had an all-new driver lineup, after Amaury Cordeel and Jack Doohan departed the team, with the former joining Hitech Pulse-Eight and the latter focusing on his reserve driver work for Alpine in Formula One. Invicta's 2024 lineup consisted of reigning FIA Formula 3 Champion and McLaren junior Gabriel Bortoleto, partnered by Alpine junior Kush Maini, who switched from Campos Racing after coming eleventh with the team last season. MP Motorsport saw Jehan Daruvala leave the team ahead of the 2023 season finale as he left the series after four seasons to join Maserati MSG Racing for Season 10 of the Formula E World Championship. The team fielded Williams Driver Academy member Franco Colapinto during the final round of 2023, and he stayed at the team for his first full- time F2 season, graduating after coming fourth with the team in FIA Formula 3. Both Van Amersfoort Racing drivers moved to other teams, with Juan Manuel Correa signing for DAMS and Richard Verschoor joining Trident. VAR enlisted Enzo Fittipaldi, who left Rodin to embark on his third full season in the championship. Rafael Villagómez partnered him, graduating from the team's FIA F3 outfit after three seasons in that championship that culminated in him finishing his 2023 campaign in 25th. Hitech Pulse-Eight also saw both their drivers switch teams, with Jak Crawford moving to DAMS and Isack Hadjar switching to Campos Racing. They were replaced by Paul Aron, who already made his debut at the final round of 2023 with Trident after coming third in the 2023 FIA Formula 3 Championship, and Amaury Cordeel, who left Invicta Racing to embark on his third season in the championship after previously finishing 17th and 20th. Campos Racing driver Ralph Boschung ended his racing career after seven seasons in Formula 2, while his 2023 teammate Kush Maini moved to Invicta for his sophomore season. The Spanish team had an all-Red Bull junior lineup in 2024, consisting of Pepe Martí, who graduated from the outfit's FIA Formula 3 team after coming fifth in 2023, and Isack Hadjar, who moved over from Hitech Pulse-Eight after coming 14th in 2023. Trident saw Richard Verschoor return to the team for his fourth F2 campaign after last racing for them in 2022. He replaced Clément Novalak, who had already left the team ahead of the 2023 final to focus on competing in the 2024 European Le Mans Series with Inter Europol Competition. PHM AIX Racing saw another long-term F2 driver leave the series, with Roy Nissany stepping away from the championship after six years of competition. He was replaced by Joshua Dürksen, who mirrored Antonelli in stepping up directly from the Formula Regional European Championship, albeit after two seasons of competing there and taking a single podium. Josh Mason did also not return to the team, with Taylor Barnard being named as his replacement. He graduated to Formula 2 after a race-winning campaign with Jenzer Motorsport in FIA Formula 3, where he finished tenth in the championship. ==== Mid-season changes ==== Taylor Barnard, who was the reserve and development driver for McLaren in Formula E, was promoted as a full time driver for the 2024–25 season and subsequently left AIX Racing. He was replaced by Indy NXT driver Niels Koolen for the Monza and Baku rounds. Similarly, Franco Colapinto was promoted to the Williams F1 Team ahead of the Italian Grand Prix to replace Logan Sargeant for the rest of the season, abruptly ending his rookie Formula 2 campaign with four rounds to go. He was replaced at MP Motorsport by Oliver Goethe, a Red Bull Junior Team driver graduating from the FIA Formula 3 Championship. Three driver changes took place for round 12 at the Baku City Circuit: Oliver Bearman missed the round to replace the race-banned Kevin Magnussen at Haas in Formula One. He was replaced by FIA Formula 3 runner-up Gabriele Minì. Roman Staněk left Trident after being unhappy with the team's performance. He was replaced by Christian Mansell, who finished the FIA Formula 3 season in fifth. ART Grand Prix driver Zak O'Sullivan announced his departure from the team, citing funding issues. He was replaced by fellow Williams Academy Driver Luke Browning for the remainder of the season. Four drivers left the series ahead of the penultimate round in Qatar. Juan Manuel Correa was replaced by Ferrari junior Dino Beganovic at DAMS Lucas Oil, Enzo Fittipaldi left Van Amersfoort Racing and was replaced by 2024 GB3 runner up driver John Bennett, and Dennis Hauger prioritised preparing for his upcoming Indy NXT campaign and left MP Motorsport. Richard Verschoor departed Trident to join MP Motorsport in place of Hauger, with Max Esterson replacing him at Trident and making his Formula 2 debut after coming 21st in FIA Formula 3 earlier in the year. AIX Racing signed Cian Shields, who finished 30th in FIA Formula 3, to contest the final two rounds in the No. 25 entry previously piloted by Barnard and Koolen. Zane Maloney will depart Rodin Motorsport ahead of the final round at Yas Marina as he graduates to Lola Yamaha ABT in Formula E, which starts its 2024–25 season at the same weekend. Reigning FIA Formula 3 Champion Leonardo Fornaroli will replace him ahead of a full-time graduation in 2025 with Invicta Racing. == Race calendar == Round Circuit Sprint race Feature race 1 Bahrain International Circuit, Sakhir 1 March 2 March 2 Jeddah Corniche Circuit, Jeddah 8 March 9 March 3 Albert Park Circuit, Melbourne 23 March 24 March 4 Imola Circuit, Imola 18 May 19 May 5 Circuit de Monaco, Monaco 25 May 26 May 6 Circuit de Barcelona-Catalunya, Montmeló 22 June 23 June 7 Red Bull Ring, Spielberg 29 June 30 June 8 Silverstone Circuit, Silverstone 6 July 7 July 9 Hungaroring, Mogyoród 20 July 21 July 10 Circuit de Spa-Francorchamps, Stavelot 27 July 28 July 11 Monza Circuit, Monza 31 August 1 September 12 Baku City Circuit, Baku 14 September 15 September 13 Lusail International Circuit, Lusail 30 November 1 December 14 Yas Marina Circuit, Abu Dhabi 7 December 8 December Source: === Calendar changes === * The Formula 2 Championship returned to Imola after the round in 2023 was cancelled as a result of mass flooding, which affected the region. * Formula 2 will make its debut in Qatar, supporting the Qatar Grand Prix at the Lusail International Circuit. * The round at Circuit Zandvoort, supporting the Dutch Grand Prix, was removed from the calendar. == Season report == === Round 1: Bahrain === Kush Maini set the fastest qualifying time for the opening round at Bahrain International Circuit, but was later disqualified from the results for a technical infringement. Gabriel Bortoleto therefore inherited feature race pole position. Jak Crawford qualified tenth to start the reverse-grid sprint race from first place. ART Grand Prix drivers Victor Martins and Zak O'Sullivan gained places to run second and third in the opening laps, but would later drop outside the podium positions. In the following laps, eighth-place starter Zane Maloney made overtakes to take second place by lap six, and passed Crawford for the lead two laps later. Maloney held the position for the remainder of the race to claim his first Formula 2 race win. The podium was completed by Crawford and Pepe Martí, who started eleventh and claimed a podium finish on his Formula 2 debut. Pole-sitter Bortoleto immediately fell to third place at the start of the feature race behind Isack Hadjar and Maloney, who improved from third to first. Bortoleto then collided with Hadjar at the first corner, causing Bortoleto to lose further positions and to take a penalty. Hadjar was then hit by Enzo Fittipaldi, eliminating both drivers from the race and necessitating the deployment of the safety car. The safety car was later deployed again to recover Victor Martins's broken-down car. Maloney maintained his lead during the restarts to claim victory in consecutive races. Martí and Paul Aron, both of whom started outside the top ten, finished second and third respectively. Maloney's double victory placed him first in the Drivers' Championship at the end of the round, 12 points ahead of second- placed Martí. === Round 2: Saudi Arabia === Oliver Bearman set the fastest qualifying time at the Jeddah Corniche Circuit, but later withdrew from the round to replace Carlos Sainz Jr. at Ferrari for the remainder of the Saudi Arabian Grand Prix. Kush Maini inherited feature race pole position as the second-fastest qualifier. Paul Aron started the sprint race from first place and maintained his position at the start. The safety car was deployed on the opening lap when Victor Martins hit the wall and retired. Aron was overtaken for the lead by Richard Verschoor on lap 8, and again by Dennis Hauger for second place with three laps remaining. Verschoor crossed the line first, but was later disqualified from the results along with Trident teammate Roman Staněk for a technical violation, promoting Hauger to victory and Enzo Fittipaldi to the podium. Championship leader Zane Maloney, who had qualified 15th, improved to fourth in the race. At the start of the feature race, pole- sitter Maini held his lead, and a poor start from third-placed Martins allowed Fittipaldi to move up into the podium positions. The safety car was deployed shortly afterwards to recover the collided cars of Pepe Martí and Roman Staněk. Fittipaldi gained a place on Jak Crawford during the early pit stops, and later overtook Maini for the net race lead. On lap 16, damage from contact with the wall forced Franco Colapinto into retirement. The resultant safety car allowed Amaury Cordeel, who started 20th, to make his pit stop and retain his position at the front. He held on to a podium position until the final corner of the final lap, when fifth-placed Hauger passed him and Crawford to claim third. Fittipaldi's victory was his second in the category, and promoted him to second in the Drivers' Championship, 15 points behind leader Maloney. === Round 3: Australia === Dennis Hauger took his first pole position in Formula 2 in Melbourne ahead of Andrea Kimi Antonelli and Richard Verschoor. At the start of the sprint race, a collision between Isack Hadjar, Pepe Martí and Gabriel Bortoleto immediately off the start line eliminated the latter two. Hadjar then took the lead from sprint pole-sitter Roman Staněk at the first corner before the safety car was deployed. After racing resumed, a group of cars challenged Staněk for second place before Antonelli and Verschoor both spun out and Paul Aron damaged his front wing, causing another safety car period. Hauger, who started tenth, overtook Kush Maini on the penultimate lap to claim the final podium position. Hadjar crossed the finish line first but was later judged to have caused the first-lap crash. He received a 10-second time penalty, promoting Staněk to the top step of the podium, which marked his first win and podium finish in Formula 2. Antonelli overtook Hauger for the lead of the feature race on the opening lap, but Hauger reclaimed the position shortly afterwards. Maini, who started fourth, soon passed both drivers to claim first place. Most of the top ten then made pit stops to shed their soft- compound tyres, with the exception of Maini, who started on the harder compound, and eighth-placed Hadjar. Pole-sitter Hauger crashed on his lap out of the pits, causing a safety car deployment. This allowed Hadjar to make his pit stop and emerge ahead of all drivers who had pitted. Hadjar took the lead when Maini made his pit stop and claimed his first victory of the season, with the podium completed by Aron and Maloney, who made overtakes after their pit stops. Maloney held his lead of the Drivers' Championship, 15 points ahead of Aron. === Round 4: Italy (Imola) === After three consecutive race retirements, Gabriel Bortoleto took pole position at Imola Circuit ahead of Oliver Bearman and Isack Hadjar. Amaury Cordeel started the sprint race from first place. On the first lap, Paul Aron took the lead from his teammate as a collision between Franco Colapinto, Roman Staněk, and Hadjar into the first corner led to several other incidents and eliminated the latter two, as well as Dennis Hauger, Enzo Fittipaldi, and Joshua Dürksen, necessitating the deployment of the safety car. Cordeel was overtaken for second place by Colapinto on lap 7, and again by Zane Maloney for the final podium position with three laps remaining. Aron held on to first place until the final lap, where he was passed by Colapinto around the outside at Tamburello corner. Colapinto claimed the fastest lap and his first Formula 2 race win. A slow start from pole- sitter Bortoleto dropped him to fourth place at the start of the feature race behind Bearman, Hadjar and Dürksen. During the early pit stops, race leader Bearman stalled and dropped outside of the points, and Bortoleto regained a position from Dürksen. Later in the race, Cordeel and Pepe Martí were eliminated after their wheels were fitted improperly and detached in the pit lane. Hadjar crossed the finish line to win a second consecutive feature race. He was followed by Bortoleto, who claimed his first Formula 2 podium, and Dürksen, who achieved his team's first points finish since . Maloney retained the lead of the Drivers' Championship, with his advantage cut to five points over Aron. === Round 5: Monaco === Richard Verschoor took his maiden pole position in Formula 2 at the Circuit de Monaco, and Victor Martins set the fastest time in the second group to qualify second. Taylor Barnard started the sprint race from first place. Two safety car periods were called in the early laps; firstly when contact broke Martins's front wing at the first corner, causing him to hit the wall, and secondly when Pepe Martí crashed on lap six. With six laps remaining, contact involving championship leader Maloney, Zak O'Sullivan and Juan Manuel Correa caused Maloney to spin and Kush Maini to stall in avoidance, blocking the track and causing the race to be red-flagged. Barnard maintained his lead through both safety cars and after the race was resumed to take his first victory and points finish in Formula 2. Pole-sitter Verschoor led at the start of the feature race and a slow start from Martins allowed Hadjar and Aron into second and third, respectively. Verschoor reported power issues on lap 19 and began to lose positions before eventually retiring. In the closing laps, 15th-place starter O'Sullivan was the only driver yet to pit in anticipation of a safety car. A virtual safety car came with two laps remaining when Joshua Dürksen collided with Maloney whilst exiting the pits, allowing O'Sullivan to change tyres and emerge ahead of Hadjar to claim his first Formula 2 victory. Podium finishes for Hadjar and Aron promoted them ahead of Maloney in the Drivers' Championship, with Aron leading by two points. === Round 6: Spain === Paul Aron, the championship leader at the time, achieved his first Formula 2 pole position in qualifying at the Circuit de Barcelona-Catalunya, followed by Jak Crawford and Franco Colapinto. Kush Maini started the sprint race from first place. Off the start line, Maini dropped positions and allowed Victor Martins into the lead, and Ritomo Miyata improved from fourth to second. Martins led the rest of the race distance to achieve his first podium finish of the season. Miyata received a time penalty during the race for track limit violations, demoting him from the podium and promoting Maini and Juan Manuel Correa to second and third, respectively. Post-race, seven more drivers, including Correa, were issued track limit penalties, allowing Aron to take the final podium place. On lap one of the feature race, a collision between Martins and Dennis Hauger eliminated both drivers, which brought out the safety car. Pole-sitter Aron maintained his lead at the start and safety car restart ahead of Crawford and Colapinto, but was overtaken by Crawford shortly after the pit stop phase and lost further positions from a mistake that caused him to go through the gravel. Joshua Dürksen's car, which now led the race by virtue of having yet to pit, then broke down, causing a virtual safety car period and allowing Correa into the lead. After all drivers made their pit stops, Crawford claimed his first feature race victory in Formula 2, followed by Colapinto. The podium was completed by Correa, who made overtakes after his pit stop and passed Aron for third place to achieve his first Formula 2 podium finish since . At the end of the round, Aron had extended his Drivers' Championship advantage to nine points over Isack Hadjar. === Round 7: Austria === Dennis Hauger set his second pole position of the season in qualifying at the Red Bull Ring, ahead of Joshua Dürksen and Gabriel Bortoleto. Kush Maini started on pole position in the sprint race, but lost positions to Oliver Bearman and Pepe Martí at the start. Paul Aron, who started sixth, made his way into third place by lap 21. Bearman finished first to claim his first win and podium of the season, followed by Martí and Aron. Maini, Jak Crawford and pole-sitter Hauger stalled on the formation lap prior to the feature race, leaving Dürksen as the first driver on the grid. Dürksen was overtaken by Bortoleto and Franco Colapinto in the early laps. Martí, who started eighth, illegally made his pit stop under virtual safety car conditions and emerged in front of Bortoleto, but was overtaken by Bortoleto and Hadjar and later was penalised for the pit stop infringement. Colapinto pitted for soft-compound tyres late in the race and used them to make his way up to second place. Bortoleto took his first Formula 2 victory and was joined on the podium by Colapinto and Hadjar. After the round, Aron's championship advantage had increased to 11 points over Hadjar. === Round 8: United Kingdom === Isack Hadjar put it on pole, with Martins and Hauger in second and third. The top three starters for the sprint race consisted of Andrea Kimi Antonelli, Maloney, and Maini. They maintained those positions until the end of the race, despite Maini getting overtaken by teammate Bortoleto on the last lap, for which the latter was penalised as he completed the overtake off-track. Victor Martins fought for a podium during the race, but he retired after being spun by his teammate Zak O'Sullivan. Antonelli set a winning margin of 8 seconds on the way to his first win of the season in heavy rain. Championship contenders Aron and Hadjar both crashed out of the race on lap 8. Hadjar had a bad start off the line in the feature race, with Victor Martins and Oliver Bearman overtaking him. Contact on lap 1 between Antonelli and Maini led to a safety car, as well as a collision between Joshua Dürksen and Paul Aron, for which the latter was penalised. During the pit stop sequence, Jak Crawford received a 5-second time penalty for an unsafe release, which led to him being relegated from first position on track to third, with Hadjar and Maloney inheriting first and second place at the flag, respectively. Hadjar's win promoted him to the championship lead, 16 points ahead of Aron, who failed to score points in a round for the first time this season. === Round 9: Hungary === Paul Aron took pole position, with Fittipaldi and Hadjar qualifying in second and third, respectively. Richard Verschoor started the sprint from first place. In the sprint race, Verschoor briefly lost the lead to Andrea Kimi Antonelli, but he regained it after a mistake from Antonelli to take his fourth win in Formula 2, ahead of Maini and Victor Martins. However, Verschoor was disqualified due to his car's plank being thinner than allowed by the regulations. Therefore Kush Maini inherited the win. In the feature race, Aron lost first place due to making a mistake going into turn one. Victor Martins took the advantage to take the lead. Soon after, Antonelli passed Maloney but then a safety car was brought out after the latter was hit by Paul Aron. Antonelli took advantage of this safety car period to make his mandatory pit stop, putting him into the lead. Later in the race, another safety car was brought out due to Amaury Cordeel hitting the barrier, which gave Antonelli another chance to pit for fresh tyres. With this tyre advantage, Antonelli cruised to his first feature race victory of the season. === Round 10: Belgium === Aron took his third pole position of the season at the Circuit de Spa-Francorchamps, in front of Bortoleto and Hadjar. The sprint race was set back by four hours from its original starting time because of heavy rain on the circuit. Just three laps into the race, Pepe Martí stopped on the circuit, bringing out the Safety Car for two laps and a red flag. The race was not resumed, and reverse pole sitter O'Sullivan won the race by default. As only three racing laps had been completed, the points awarded were reduced; this meant only the top five finishers - O'Sullivan, Hauger, Verschoor, Maloney and Crawford - scored points in the race. At the start of the feature race, Maloney, Bearman and Martí were involved in a multi-car collision, forcing the latter two to retire from the race and bringing out the safety car. Franco Colapinto also retired on the first lap due to an engine issue, ending his last race in his rookie Formula 2 season before he would go up to compete in Formula One with Williams for the rest of the season. Briefly after racing resumed on lap four, Victor Martins and Rafael Villagómez crashed, once again deploying the Safety Car for another three laps. On the final lap, Aron suffered a mechanical issue and stopped on track, dropping him out of the points. Hadjar went on to win his fourth feature race of the year, with Bortoleto and Crawford finishing second and third. This would also be the last round that race winner Taylor Barnard participated in as he would vacate his slot at AIX Racing in preparation for a switch to Formula E. == Results and standings == === Season summary === Round Circuit Pole position Fastest lap Winning driver Winning team 1 SR Bahrain International Circuit Enzo Fittipaldi Zane Maloney Rodin Motorsport Report FR Gabriel Bortoleto Dennis Hauger Zane Maloney Rodin Motorsport 2 SR Jeddah Corniche Circuit Paul Aron Dennis Hauger MP Motorsport Report FR Kush Maini Enzo Fittipaldi Enzo Fittipaldi Van Amersfoort Racing 3 SR Albert Park Circuit Isack Hadjar Roman Staněk Trident Report FR Dennis Hauger Jak Crawford Isack Hadjar Campos Racing 4 SR Imola Circuit Franco Colapinto Franco Colapinto MP Motorsport Report FR Gabriel Bortoleto Victor Martins Isack Hadjar Campos Racing 5 SR Circuit de Monaco Andrea Kimi Antonelli Taylor Barnard AIX Racing Report FR Richard Verschoor Dennis Hauger Zak O'Sullivan ART Grand Prix 6 SR Circuit de Barcelona-Catalunya Ritomo Miyata Victor Martins ART Grand Prix Report FR Paul Aron Andrea Kimi Antonelli Jak Crawford DAMS Lucas Oil 7 SR Red Bull Ring Ritomo Miyata Oliver Bearman Prema Racing Report FR Dennis Hauger Franco Colapinto Gabriel Bortoleto Invicta Racing 8 SR Silverstone Circuit Andrea Kimi Antonelli Andrea Kimi Antonelli Prema Racing Report FR Isack Hadjar Franco Colapinto Isack Hadjar Campos Racing 9 SR Hungaroring Gabriel Bortoleto Kush Maini Invicta Racing Report FR Paul Aron Andrea Kimi Antonelli Andrea Kimi Antonelli Prema Racing 10 SR Circuit de Spa-Francorchamps Zak O'Sullivan Zak O'Sullivan ART Grand Prix Report FR Paul Aron Paul Aron Isack Hadjar Campos Racing 11 SR Monza Circuit Victor Martins Oliver Bearman Prema Racing Report FR Zane Maloney Kush Maini Gabriel Bortoleto Invicta Racing 12 SR Baku City Circuit Richard Verschoor Joshua Dürksen AIX Racing Report FR Richard Verschoor Gabriel Bortoleto Richard Verschoor Trident 13 SR Lusail International Circuit Report FR Paul Aron 14 SR Yas Marina Circuit Report FR === Scoring system === Points are awarded to the top eight classified finishers in the sprint race, and to the top ten classified finishers in the feature race. The pole-sitter in the feature race also receives two points, and one point is given to the driver who set the fastest lap in both the feature and sprint races, provided that driver finished inside the top ten. If the driver who set the fastest lap is classified outside the top ten, the point is given to the driver who set the fastest lap of those inside the top ten. No extra points are awarded to the pole-sitter in the sprint race as the grid for it is set by reversing the top ten qualifiers. ; Sprint race points Points are awarded to the top eight classified finishers, excluding the fastest lap point which is given to the top ten classified finishers. Position 1st 2nd 3rd 4th 5th 6th 7th 8th FL Points 10 8 6 5 4 3 2 1 1 ; Feature race points Points are awarded to the top ten classified finishers. Bonus points are awarded to the pole-sitter and to the driver who set the fastest lap and finished in the top ten. Position 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th Pole FL Points 25 18 15 12 10 8 6 4 2 1 2 1 === Drivers' Championship standings === {| class=\"wikitable\" style=\"font-size: 85%;\" Driver BHR JED ALB IMO MON CAT RBR SIL HUN SPA MNZ BAK LUS YMC Points SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR 1 Gabriel Bortoleto 6 5P 10 Ret Ret Ret 6 2P 2 8 5 10 4 1 4 6 16 4 10 2F 8 1 5 4F 169.5 2 Isack Hadjar 4 Ret 15† Ret 6F 1 Ret 1 8 2 6 5 13 3 Ret 1P 3F 18 9 1 10 11 12 14 165 3 Zane Maloney 1F 1 4 7 10 3 3 11 Ret 10 20 7 17 Ret 2 2 13 Ret 4 6 5 2P 10 15 135 4 Paul Aron 5 3 2F 10 18 2 2 6 7 3 3 4P 3F 5 Ret 12 6 RetP 18 16†P 20 Ret 6 6 P 135 5 Jak Crawford 2 Ret 5 4 9 10F 14 7 13 Ret 4 1 6 10 6 3 9 17 5 3 6 9 2 8 116 6 Andrea Kimi Antonelli 14 10 6 6 Ret 4 10 4 4F 7 15 12 15 13 1F Ret 14 1F 6 9 18 4 7 3 113 7 Franco Colapinto 18 6 11 Ret 4 DSQ 1F 5 5 13 18 2 11 2F 5 4F 5 13 8 Ret 96 8 Victor Martins 11 Ret Ret 11 7 8 12 9F Ret 9 1 Ret 10 11 Ret 5 2 2 12 Ret 2F 6 4 2 93 9 Dennis Hauger 8 8F 1 3 2 RetP Ret 12 3 6F 12 Ret 5 12P 7 9 4 6 2 12 8 Ret 14 9 85.5 10 Richard Verschoor 10 14 DSQ 8 Ret 6 7 10 16 RetP 13 18† 20 Ret 11 13 DSQ 3 3 5 14 3 17 1P 81 11 Kush Maini 13 7 8 2P 3 12 8 14 Ret 17 2 6 7 17 3 19 1 7 13 15 11 15 9 DSQ 74 12 Enzo Fittipaldi 17 Ret 3 1F 12 17 Ret 17 9 12 16 11 14 4 13 8 21 5 14 Ret 7 10 13 11 61 13 Joshua Dürksen 15 11 9 12 17 Ret Ret 3 18 18† 10 Ret 8 6 16 Ret 18 19 19 10 3 5F 1F 5 61 14 Zak O'Sullivan 7 4 16† Ret 8 Ret 9 13 10 1 9 15 9 9 Ret 11 19 14 1 4 Ret 13 59 15 Oliver Bearman 16 15 WD WD 14 9 5 19 11 4 21 14 1 Ret Ret 7 10 15 7 Ret 1 7 50 16 Pepe Martí 3 2 7 Ret Ret 13 16 Ret Ret 14 11 9F 2 15 Ret 10 17 12 Ret Ret 4 12 19 Ret 43 17 Juan Manuel Correa 12 Ret Ret 14 11 14 15 8 12 5 8 3 16 14 12 20 8 16 17 11 17 Ret 15 Ret 31 18 Amaury Cordeel Ret Ret Ret 5 16 11 4 Ret 14 Ret 14 8 18 7 15 15 20 Ret 11 8 12 18 18 12 29 19 Ritomo Miyata 9 9 12 15 5 5 13 15 17 15 7F 13 22 Ret 10 17 12 8 15 7 13 14 Ret 13 29 20 Taylor Barnard Ret 16 13 13 13 16 DSQ 20 1 11 19 Ret 12 8 9 14 7 9 16 13 18 21 Roman Staněk Ret 13 DSQ Ret 1 15 Ret 18 6 16 22 17 21 18 8 18 15 11 20 14 15 17 14 22 Rafael Villagómez 19 12 14 9 15 7 11 16 15 Ret 17 16 19 16 14 16 11 10 21 Ret 16 8 16 Ret 13 23 Gabriele Minì 3 Ret 6 24 Luke Browning 11 7 4 25 Christian Mansell 8 10 2 26 Oliver Goethe Ret 16 21 Ret 0 27 Niels Koolen 19 19 20 Ret 0 – Dino Beganovic 0 – Max Esterson 0 – John Bennett 0 – Cian Shields 0 Driver SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR Points BHR JED ALB IMO MON CAT RBR SIL HUN SPA MNZ BAK LUS YMC Notes: * – Driver did not finish the race, but was classified as he completed more than 90% of the race distance. {| class=\"wikitable\" style=\"font-size: 85%;\" Team BHR JED ALB IMO MON CAT RBR SIL HUN SPA MNZ BAK LUS YMC Points SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR 1 Invicta Racing 6 5P 8 2P 3 12 6 2P 2 8 2 6 4 1 3 6 1 4 10 2F 8 1 5 4F 243.5 13 7 10 Ret Ret Ret 8 14 Ret 17 5 10 7 17 4 19 16 7 13 15 11 15 9 DSQ 2 Campos Racing 3 2 7 Ret 6F 1 16 1 8 2 6 5 2 3 Ret 1P 3F 12 9 1 4 11 12 14 208 4 Ret 15† Ret Ret 13 Ret Ret Ret 14 11 9F 13 15 Ret 10 17 18 Ret Ret 10 12 19 Ret 3 MP Motorsport 8 6 1 3 2 RetP 1F 5 3 6F 12 2 5 2F 5 4F 4 6 2 12 8 16 14 9 181.5 18 8F 11 Ret 4 DSQ Ret 12 5 13 18 Ret 11 12P 7 9 5 13 8 Ret Ret Ret 21 Ret 4 Prema Racing 14 10 6 6 14 4 5 4 4F 4 15 12 1 13 1F 7 10 1F 6 9 1 4 3 3 169 16 15 WD WD Ret 9 10 19 11 7 21 14 15 Ret Ret Ret 14 15 7 Ret 18 7 7 Ret 5 Rodin Motorsport 1F 1 4 7 5 3 3 11 17 10 7F 7 17 Ret 2 2 12 8 4 6 5 2P 10 13 164 9 9 12 15 10 5 13 15 Ret 15 20 13 22 Ret 10 17 13 Ret 15 7 13 14 Ret 15 6 Hitech Pulse-Eight 5 3 2F 5 16 2 2 6 7 3 3 4P 3F 5 15 12 6 RetP 11 8 12 18 6 6 P 164 Ret Ret Ret 10 18 11 4 Ret 14 Ret 14 8 18 7 Ret 15 20 Ret 18 16†P 20 Ret 18 12 7 ART Grand Prix 7 4 16† 11 7 8 9 9F 10 1 1 15 9 9 Ret 5 2 2 1 4 2F 6 4 2 156 11 Ret Ret Ret 8 Ret 12 13 Ret 9 9 Ret 10 11 Ret 11 19 14 12 Ret Ret 13 11 7 8 DAMS Lucas Oil 2 Ret 5 4 9 10F 14 7 12 5 4 1 6 10 6 3 8 16 5 3 6 9 2 8 147 12 Ret Ret 14 11 14 15 8 13 Ret 8 3 16 14 12 20 9 17 17 11 17 Ret 15 Ret 9 Trident 10 13 DSQ 8 1 6 7 10 6 16 13 17 20 18 8 13 15 3 3 5 14 3 8 1P 97 Ret 14 DSQ Ret Ret 15 Ret 18 16 RetP 22 18† 21 Ret 11 18 DSQ 11 20 14 15 17 17 10 10 PHM AIX Racing (1–3) AIX Racing (4–13) 15 11 9 12 13 16 Ret 3 1 11 10 Ret 8 6 9 14 7 9 16 10 3 5F 1F 5 79 Ret 16 13 13 17 Ret DSQ 20 18 18† 19 Ret 12 8 16 Ret 18 19 19 13 19 19 20 Ret 11 Van Amersfoort Racing 17 12 3 1F 12 7 11 16 9 12 16 11 14 4 13 8 11 5 14 Ret 7 8 13 11 74 19 Ret 14 9 15 17 Ret 17 15 Ret 17 16 19 16 14 16 21 10 21 Ret 16 10 16 Ret Team SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR SR FR Points BHR JED ALB IMO MON CAT RBR SIL HUN SPA MNZ BAK LUS YMC * – Driver did not finish the race, but was classified as he completed more than 90% of the race distance. * Rows are not related to the drivers: within each team, individual race standings are sorted purely based on the final classification in the race (not by total points scored in the event, which includes points awarded for fastest lap and pole position). == Notes == ==References== Category:Pages with unreviewed translations",
 "title": "2024 Formula 2 Championship"
}