{
 "id": "1152688",
 "text": "The thirteenth series of the British school drama series Waterloo Road was shown on BBC One and BBC iPlayer, It was shown from 2 January 2024 to 26 February 2024. It is the last series to be set at the old St Ambrose Barlow Roman Catholic High School building in Swinton, Greater Manchester, England. == The series == The show follows the lives of the teachers and the pupils at Waterloo Road. It has stories such as Changing the school into an academy, grief, catfishing, truancy, cultural identity, teen pregnancy, cancer, child abuse, planning for the future, theft, isolation, student-teacher crushes, abortion, family conflict, and relationship issues. == Cast and characters == === Main cast === * Angela Griffin as Kim Campbell; Headteacher * James Baxter as Joe Casey; Deputy Head and languages teacher * Ryan Clayton as Sergeant Mike Rutherford; School security officer * Jo Coffey as Wendy Whitwell; PA to Headteacher * Neil Fitzmaurice as Neil Guthrie; History teacher * Vincent Jerome as Lindon King; Deputy Head and science teacher * Rachel Leskovac as Coral Walker; Head of English * Kym Marsh as Nicky Walters; School canteen worker * Katherine Pearce as Amy Spratt; Early career English and drama teacher * Shauna Shim as Valerie Chambers; Music teacher * Adam Thomas as Donte Charles; School caretaker * Jamie Glover as Andrew Treneman; Chief executive officer of Lowry Community Academies Trust and a former colleague of Kim's === Pupils === * Noah Valentine as Preston Walters * Priyasasha Kumari as Samia Choudhry * Adam Ali as Kai Sharif * Alicia Forde as Kelly Jo Rafferty * Francesco Piacentini-Smith as Dean Weever * Liam Scholes as Noel McManus * Lucy Eleanor Begg as Caz Williams * Summer Violet Bird as Tonya Walters * Scarlett Thomas as Izzy Charles * Thapelo Ray as Dwayne Jackson * Inathi Rozani as Zayne Jackson * Chiamaka Ulebor as Shola Aku * Hattie Dynevor as Libby Guthrie * Zak Sutcliffe as Schumacher \"Schuey\" Weever * Tillie Amartey as Stacey \"Stace\" Neville * Maisie Robinson as Portia Weever * Aabay Noor Ali as Mollie 'Mog' Richardson * Zanele Nyoni as Jess Clarke * Teddy Wallwork as Declan Harding === Recurring === * Sonia Ibrahim as Jamilah Omar, School social worker * Hollie-Jay Bowes as Debs Rafferty, Kelly Jo's mother * Marie Critchley as Barbara Rafferty, Nicky and Debs' mother * Tom Wells as Marc Todd, Maths teacher * Kerry Howard as Serena Michelle Davies, Deputy Chief Executive Officer / Acting Chief Executive Officer of Lowry Community Academies Trust * William Fox as Pete Weever, Schuey and Portia's father === Guest === * Lauren Drummond as Mika Grainger (episode 8) == Episodes == == References == Category:2024 British television seasons Category:Waterloo Road (TV series)",
 "title": "Waterloo Road (series 13)"
}