{
 "id": "1152954",
 "text": "The Chrysler Pacifica is a Minivan produced by Chrysler, a brand owned by Stellantis. It was introduced in 2016 as the replacement for the Chrysler Town & Country. The Pacifica has both gasoline and plug-in hybrid versions. ==History== Chrysler announced in 2013 that it would create a new generation of its Town & Country minivan. The production was set to start in 2015, and the vehicle would be released as the 2017 model. In 2015, FCA CEO Sergio Marchionne confirmed a $2 billion investment to develop the new minivan and improve the Windsor Assembly Plant in Canada. The new model debuted at the 2016 North American International Auto Show. It was named Pacifica instead of Town & Country to show that it was different from previous models. ==Features== The Chrysler Pacifica comes in different versions ===Gasoline- only version=== The Gasoline-only version is Powered by a 3.6 L Pentastar V6 engine. ===Plug-in hybrid version=== The plug-in hybrid version Has a 16 kWh battery that allows the vehicle to drive up to 33 miles (53 km) on electric power alone. This version qualifies for tax credits in the United States and other incentives. In 2020, an all-wheel drive (AWD) option was added to the gasoline models. The Pacifica is the only minivan in North America to offer a traditional AWD system. ===Autonomous version=== In November 2017, Waymo, a self-driving technology company, began testing driverless vehicles using the Pacifica plug-in hybrid. ===Chrysler Voyager=== Starting in 2020, lower-end trim levels of the Pacifica were sold under the name Chrysler Voyager in the United States. The Voyager name had not been used since 2016. The Voyager is only available to fleet buyers and has fewer features than the Pacifica. ==Markets== The Chrysler Pacifica is mainly sold in North America, including the United States, Canada, and Mexico. It is also available in some other regions but is primarily focused on the North American market. ==Notes== ==References== Category:Chrysler automobiles",
 "title": "Chrysler Pacifica (minivan)"
}