{
 "id": "1152579",
 "text": "The National Archives of Kazakhstan (Kazakh: Қазақстан Республикасының ұлттық мұрағаттары) is a place that keeps historical, cultural, and political documents (like texts, pictures, agreements, etc.) and information about Kazakhstan and its people. == Central State Archive of Film and Photo Documents and Sound Recordings == === History === The Central State Archive of Film and Photo Documents holds all important film and photo documents about politics, history, and culture made in the republic. At the end of 1957, due to changes in the central archive system, the archive of the OM KFFD from the Kazakh SSR became part of the Central State Archive of the Kazakh SSR. After Kazakhstan became a republic in 1992, the archive was renamed the Central State Archive of Film, Photo Documents, and Sound Recordings of the Republic of Kazakhstan. == Main State Store for Scientific and Technical Documentation == The Central State Archive of Scientific and Technical Documentation started on March 1, 1974. The archives of Kazakhstan hold unique materials that are vast in quantity and content, providing important information. These documents are valuable for learning about the history of Kazakhstan. == Almaty Central State Archive == In 1981, Almaty City became an official administrative center, and because many documents were being created in city institutions, organizations, and businesses that needed to be stored by the state, there was a need to create the Almaty City State Archive. On December 9, 1981, following the Resolution of the Kazakh SSR Council of Ministers No. 442-r from December 2, 1981, and the Order of the Main Archives Department No. 95 from December 3, 1981: a plan was proposed to create a Central State Archive in the city with 18 staff members, directly under the Executive Committee of the Almaty City Council and the Main Archives Department of the Kazakh SSR. === Activities === To greatly improve the quality and information in the archive of Almaty, the focus was on copying documents about the history of Almaty and the Semirechye region from foreign archives and research centers. The workers from the Almaty Central State Archive worked together with the Council of Scientists from the Institute of History and Ethnology and the Institute of Oriental Studies of the Ministry of Science and Education of Kazakhstan. They organized trips to archives and libraries in Russia, China, France, Turkey, and Great Britain. As a result, we received 600 copies of unique documents that are not available in Kazakhstan's archives. Since it started, the archive's staff has increased from 18 to 73, or 151, when including district archives. The archive now offers research help, information, and consulting services. == East Kazakhstan region archives == East Kazakhstan Oblast State Archives - After East Kazakhstan Oblast, with Ust-Kamenogorsk as its center, became a separate administrative region in October 1939, the archive's construction started in 1940. On April 17, 1940, N.I. Chichievsky was appointed Head of the East Kazakhstan Oblast Archives by the Deputy Head of the Archives Department of the Kazakh SSR's Internal Affairs, and he was also in charge of managing the state's archives for the region. == Karaganda Region State Archive == The state archive of the Karaganda region now holds 5 thousand collections, which contain 2.5 million cases. The history of archival services in the Karaganda region started on December 19, 1937. This was when the Karaganda Executive Committee decided to set up the Karaganda State Archive Department and to organize the archival materials from local government, businesses, collective and state farms, and village councils. == Kostanay Region State Archive == On December 21, 1923, the Kostanay Provincial Executive Committee decided to create the Kostanay Region State Archive. The archive was located in a small room of the Provincial Executive Committee that was not suitable. All tasks were handled by one manager, as only one employee was on the staff list. === Activities === Currently, the State Archive of Kostanay Region has 1,393 archival funds with 615,387 storage units. In addition to administrative records and personnel documents, the regional state archive keeps scientific and technical records from local institutions and organizations (5,820 storage units), half of which includes documents from major organizations like the Kostanay Forestry Association of the Ministry of Forestry of the Kazakh SSR, the Kostanay branch of the Tselingiprozem design institute, the Department of Agriculture and Food, and the Zarechny Experimental and Production Farm. == Almaty Region State Archive == The Almaty Regional State Archive started as the regional archive fund, although the exact start date is unclear. It began work in 1919. On January 25, 1921, it was officially added to the Central Archives Department of the People's Commissariat of Education of the Turkestan ASSR. Document collection and storage continued in Semirechye until the revolution. In October 1924, as Central Asia and Kazakhstan formed their own states, Semirechye province joined the Kazakh ASSR. The provincial archive of Semirechye (initially Almaty district) was given to the Central Regional Archive of the Kazakh ASSR and stayed there until late 1929, specifically until December 1933. On October 26, 1933, a regional archive department was created as part of the Almaty regional government. == Pavlodar Region Central State Archive == The history of archives in the Pavlodar region started on June 30, 1925, when the role of junior archivist was created at the Central State Archive of Pavlodar region by the Pavlodar Executive Committee. == Main State Archive of Akmola Region == The Akmola region was formed on October 14, 1939, and on December 22, 1939, the State Archive of the Akmola region was created by order No. 1875 from the People's Commissariat of Internal Affairs of the Kazakh SSR. When the Tyn region was formed in 1960, the archive's name changed several times: Tyn regional state archive, Tselinograd regional state archive, and since July 1992, it has been called the Akmola regional state archive. The last full official name was the State Archive of the Akmola region. This archive keeps documents mainly from the Soviet period (main collections from 1919 to 1990) and the early years of independent Kazakhstan (1991-2011). Pre-revolutionary documents are kept in a separate file. Records from institutions in the Tyn region (1961-1965) are also kept separately. The documents from the Tyn region were moved to the state archive in Astana when the regional center moved to Kokshetau. == South Kazakhstan Regional Archive == On October 1, 1926, the Syrdarya Archival Bureau was set up. This Syrdarya province, which included what is now the Turkestan region, was formed in 1924 with Shymkent as its center. The Southern State Archive of Kazakhstan was given only 4 shelves where 1 manager and 1 archivist worked. This marked the beginning of the State Archive of the Turkestan region. Since then, the archival service has grown and developed. At the time of creation, there were 13 collections on 4 shelves, which have now increased to 3,850 collections and 1.5 million documents. These important documents, starting from 1917, show the region's history at every stage. They cover the creation of the Provisional Government in 1917, the October Revolution, the formation of the Soviet Union, state planning in Central Asia and Kazakhstan in 1924-1925, the organization of cooperatives, construction of major industrial sites, the development of Myrzachol, repression events, World War II, recovery of the economy, the building of Bogen and Shardara reservoirs, independence, and many social and political changes. The archive is housed in a building that covers 4,264 square meters in the regional center. This building is among the few in the CIS countries. == Main State Archive of Aktobe Region == The State Archive of the Aktobe region, first named the Aktobe Provincial Archive Bureau, was created on September 15, 1923. It mainly holds documents from the Aktobe district executive committee of the provincial-Soviet national economy, which was the first collection at that time. From 1928 to 1935, changes in administrative divisions led to new rules and structures for archive operations. Between 1935 and 1938, inter-district state archives were set up. In 1964, the regional state archive moved to a standard building of 545 square meters at 2 Lachugin Street. In October 1991, after the Communist Party of Kazakhstan ended its activities, it was moved to the Aktobe regional archive institution, now located in a main building of 2167.4 square meters at 255 Agayindy Zhubanovtar Street. The state archive of Aktobe region keeps documents about the region's history from different times. This includes records from the Aktobe district's committee about the start of Soviet rule in 1917-1918, changes in local agriculture, the formation of cooperatives and partnerships, the bravery of Aktobe people during World War II, as well as information on public education and health care. Big industrial sites in Aktobe include plants for ferroalloy, chromium alloy, agricultural machinery, X-ray devices, the S.M. Kirov chemical factory, and papers from oil and geological studies that began in the 1930s and 1950s. Additionally, a collection of notable local figures is being created, including the well-known historian Sh. Bersiev, Soviet Union heroes S.V. Vavilov, M. Bokenbayev, local historian Elamanov, and others. == References == Kazakhstan Category:Kazakhstan",
 "title": "National Archives of the Republic of Kazakhstan"
}