{
 "id": "1152035",
 "text": "\"Militancy in the name of Islam: discussed and non-discussed reasons\", mainly Islam er Name Jongibad: Alochito O Onalochito Karonsomuho (ইসলামের নামে জঙ্গিবাদ: আলোচিত ও অনালোচিত কারণসমূহ) is a 2016 bengali language book by Khandaker Abdullah Jahangir which explains the political aspects of Islam and the spread and conspiracy of militancy in the name of Islam according to the Quranic Hadith. The book was first published in August 2006. The book is very popular among Bengali Salafi-Ahl al-Hadith communities. Many bengali scholars has prescribed the book as authentic and reliable including Abubakar Muhammad Zakaria. == Contents == According to Khandaker Abdullah Jahangir, the reasons for the spread of 'Militism or Terrorism' is the Western conspiracy against Islam, Israel, imperialism, oil and religion, killing of Muslims worldwide, suppression of Islam in Muslim countries, unemployment, depression, etc. https://www.kalerkantho.com/print-edition/islamic-life/2019/03/01/742347 In the book, he says that irreligion and secularism are not the same. https://www.jugantor.com/todays-paper/features/islam-and- life/440807/%E0%A6%A7%E0%A6%B0%E0%A7%8D%E0%A6%AE%E0%A6%A8%E0%A6%BF%E0%A6%B0%E0%A6%AA%E0%A7%87%E0%A6%95%E0%A7%8D%E0%A6%B7%E0%A6%A4%E0%A6%BE-%E0%A6%A7%E0%A6%B0%E0%A7%8D%E0%A6%AE%E0%A6%B9%E0%A7%80%E0%A6%A8%E0%A6%A4%E0%A6%BE-%E0%A6%A8%E0%A7%9F He also says in the book that the term \"militant\" is often used indiscriminately by Islamophobic media outlets to refer to Muslims.https://m.dailyinqilab.com/article/27890/%E0%A6%87%E0%A6%B8%E0%A6%B2%E0%A6%BE%E0%A6%AE%E0%A7%87%E0%A6%B0-%E0%A6%B8%E0%A6%BE%E0%A6%A5%E0%A7%87-%E0%A6%9C%E0%A6%99%E0%A7%8D%E0%A6%97%E0%A6%BF%E0%A6%AC%E0%A6%BE%E0%A6%A6%E0%A7%87%E0%A6%B0-%E0%A6%95%E0%A7%8B%E0%A6%A8%E0%A7%8B-%E0%A6%B8%E0%A6%AE%E0%A7%8D%E0%A6%AA%E0%A6%B0%E0%A7%8D%E0%A6%95-%E0%A6%A8%E0%A7%87%E0%A6%87 ===Criterion of Validity in Leadership: Permitting Prayer=== Abdullah Jahangir in his book Militancy in the Name of Islam states that the hadith forbids opposing the ruler's authority as long as they pray and/or allow public prayer. ===Sufi-Salafi relation=== Abdullah Jahangir about Sufi-Salafi (Wahhabi) relationship, regarding their political philosophy and its misuse and misinterpretation in the Western world, says in his book \"Militancy in the Name of Islam\", === Kharijite === According to some Muslim writers, extremism within Islam begins with the Kharijites in the 7th century. Originally from their political position, they developed extreme doctrines that set them apart from mainstream Sunni and Shia Muslims alike. The Kharijites were particularly well known for their radical approach to takfir, where they declared other Muslims to be infidels and therefore deemed worthy of killing. Scholars refer to a hadith of the Muhammad regarding the emergence of Kharejids. Abdullah Jahangir quotes the above hadith in his book Militancy in the Name of Islam,http://www.hadithbd.com/books/link/?id=6896 Abdullah Jahangir said about one of the characteristics of the Kharejis: (1) To consider one's own understanding as final in understanding the guidance of Islam or the Qur'an. In this case, denying the importance of the opinions of the Companions. (2) Denying the importance of the practical actions and methods of Rasulullah (SAW) in matters of discussion and debate, even if the hadith is accepted. (3) Calling a Muslim a Kafir because of his sins. (4) Claiming the legality of the killing of infidels. (5) Denying the Shariah importance of state loyalty. (6) Declaring the state as a kafir state due to the sins of the head of state and the state administration. (7) Calling citizens who obey such a head of state as infidels. (8) To declare the bearing of arms against such infidel states and citizens as lawful. (9) Claiming that Jihad is an obligatory law, a major obligation and a pillar of religion. (10) Punishment in the name of enjoining justice and prohibiting injustice. (11) To despise all the scholars who are against their opinion. ==References== ==Other websites== * Full Book in Unicode on Bangla Hadith Website Category:Islam",
 "title": "Militancy in the name of Islam"
}