{
 "id": "1153698",
 "text": "Ameerega pepperi is a frog. It lives in Peru. ==Body== In one study, scientists caught two adult male frogs that were both 28.6 mm long from nose to rear end and the female frogs were 30.8 - 34.4 mm long. The skin of the frog's back is black with red, orange, or yellow color. There is more color near the head and less near the rear end. There are two yellow stripes that go from each eye to the rear end. There are two more yellow stripes on the face, starting at the nose. The belly is dark blue with some black. The legs are black or dark green in color. There are stripes on the back legs. The iris of the eye is black in color. Other than that, these frogs can be different colors depending on where they live. Frogs from further south have more red on their backs and frogs from further north have more yellow and orange on their backs. ==Name== Scientists named this frog for Mark Pepper, who studied poison frogs. ==Home== This frog lives in forests that human beings have not changed. It can live in forests that have never been cut down and forests that have been cut down and are growing back. People see the adult frogs hiding next to big rocks next to streams. Scientists saw the frog between 380 and 1000 meters above sea level. The frog lives in at least one protected park, Parque Nacional Cordillera Azul. ==Young== The male frog sits on a big rock next to a stream and calls to the female frogs. The female frog lays eggs on the dead leaves on the ground. She lays 22-44 eggs at a time. The male frog watches the eggs. People see the tadpoles in places where the stream water moves in circles and in pools next to streams, but this is because the tadpoles are trapped there when the water in the stream goes down. Sometimes the tadpoles take only five weeks to become frogs. ==Danger== Scientists say this frog is in some danger of dying out. People change the places where the frog lives, especially in Huallaga. People cut down forests to make farms, for example coffee and banana farms and to grow coca. People keep this frog as a pet, but scientists say this is not a danger to wild frogs. It is legal for people to grow the tadpoles in buildings. ==First paper== * ==References== Category:Frogs of South America Category:Poison dart frogs",
 "title": "Ameerega pepperi"
}