{
 "id": "1153153",
 "text": "Dr. Zaher Ihssan Baadarani (Arabic: زاهر إحسان بعدراني) is a Syrian-American political leader and human rights advocate. He is [the President of the Syrian Future Movement(SFM), a political group created during the Syrian revolution. == Early life and education == Zaher Ihssan Baadarani was born in Damascus, Syria. His father, Dr. Sheikh Ihsan Baadarani, was a well-known Islamic scholar and religious advisor to President Bashar al-Assad. His father also led prayers at the Murabet Mosque in Muhajreen, Damascus, a mosque visited by Presidents Hafez al-Assad and Bashar al-Assad. Zaher Baadarani has a Ph.D. in Islamic media studies. == Political career == Baadarani became politically active because he opposed the Assad government, and fought for the human rights of Syrian people. He is a member of the Free Syrian Gathering, an Istanbul-based group that works for women's rights and their role in politics. He helped found this group with others, including Bahia Mardini. == Syrian Future Movement == In 2012, Baadarani started the Syrian Future Movement(SFM) to support the goals of the Syrian revolution. The group works for civil peace, political reforms, and rebuilding Syria after the war. The SFM also focuses on education. It has set up Tawad Educational Schools in northern Syria and training centers to help young people prepare for rebuilding the country. == Leaving Syria == Baadarani and his family left Syria because they opposed the Assad government. His father was attacked by Syrian security forces after giving a speech against government corruption. The family received threats and decided to move to the United States. Baadarani continues his work there with the Syrian diaspora. == Views and controversies == Baadarani is a strong critic of the Assad government and its allies. He has criticized pro-Assad figures like Sheikh Muhammad Saeed Ramadan Al-Bouti for supporting the regime's violence. He also opposes Hezbollah's role in Syria and its leader, Hassan Nasrallah, for encouraging Shiite militias to join the conflict. In 2023, Baadarani left the \"Syrian Democratic Meeting\" in Berlin. He criticized the event for excluding key political figures and for poorly representing women and youth. == References == Category:Living people Category:Syrian politicians Category:People from Damascus",
 "title": "Zaher Baadarani"
}