{
 "id": "1153946",
 "text": "The Geely CK is a Subcompact car produced by the Chinese automaker Geely Auto. It was made from May 2005 to January 2016. The car was known by different names in different markets, such as Ziyoujian in China, which means Freedom Ship or Free Cruiser. In Russia, it was sold as the Geely Otaka,Geely Otaka. Wroom.ru. and it was also called the Geely Echo in Turkey and Gleagle CK in China. == History == The Geely CK was first shown at the 2005 Frankfurt Motor Show and was the first Chinese car displayed at an American auto show. Geely planned to sell it in Puerto Rico in 2007 and later in the United States, but these plans were stopped after failing safety tests. In 2008, Geely released an updated version of the CK called the CK II, which had changes to the headlights and bumpers. The pre-facelift model had a look similar to the Mercedes-Benz S-Class, while the facelifted version resembled the Mercedes- Benz C-Class. == Markets == The Geely CK was sold in various countries around the world. In China, it was marketed under the name Ziyoujian or Gleagle CK. The car was also available in Russia as the Geely Otaka and in Turkey as the Geely Echo. Additionally, the CK was exported to countries such as Cuba,four other Geely models.Cuba: Lada, Hyundai, Geely & vintage Americans dominate. Best Selling Cars, December 14, 2010.Israel, Esteban, Russian Lada gets Chinese rival on Cuban roads. Reuters, 2009-09-29. and the Geely CK was used by government officials and police, replacing older Lada 2105 vehicles. The cars were also available for rent. While the CK was seen as an improvement over the old Ladas, it had a reputation for being unreliable. In Colombia, the Geely CK was sold as the CK Work model with a 1.3 L engine and was used as a taxi. The car was also produced and assembled in other countries, including Ukraine and Uruguay, where it was made for local and export markets. == Discontinuation == The production of the Geely CK ended in 2016 after a final facelift in 2015 and was replaced by Geely MK. == References == Category:Chinese automobiles Category:Sedans",
 "title": "Geely CK"
}