{
 "id": "1153861",
 "text": "On 7 December 2024, Syrian opposition Southern Operations Room forces entered the Rif Dimashq region from the south. They were within of the capital Damascus. The Syrian Arab Army left from multiple points near the city. At the same time, opposition Tahrir al-Sham and the Syrian National Army in the north launched an offensive into Homs, while the Syrian Free Army entered the capital from the southeast. On 8 December, rebel forces entered the city's Barzeh neighborhood. According to multiple reports, President Bashar al-Assad left Damascus on plane to Moscow where he was granted political asylum. == Reactions == * : China's Foreign Ministry stated that it \"is closely following the development of the situation in Syria and hopes that Syria returns to stability as soon as possible\" and urged all parties to ensure the safety of Chinese citizens in Syria. * : Foreign Minister Sheikh Mohammed bin Abdulrahman Al Thani criticized Assad for failing to use the previous lull in fighting to address Syria's underlying problems, stating \"Assad didn't seize this opportunity to start engaging and restoring his relationship with his people.\" * : Following Russia's call for its citizens to leave Syria, the Russian Embassy reported that all its staff members were safe following the fall of Damascus. Russia's Foreign Ministry stated that it was in contact with \"all groups of the Syrian opposition\", but played no role in negotiations. * : U.K. deputy prime minister Angela Rayner said that the government welcomed the fall of Bashar al-Assad. * : U.N. Special Envoy for Syria Geir Pedersen called for urgent talks in Geneva to ensure an \"orderly political transition\" and the implementation of Security Council Resolution 2254. * : The White House reported that \"President Biden and his team are closely monitoring the extraordinary events in Syria and staying in constant touch with regional partners.\" ==References== Category:December 2024 events Category:2024 in Syria Category:History of Damascus",
 "title": "Fall of Damascus"
}