{
 "id": "1153176",
 "text": "Island Line is a railway line on the Isle of Wight. It goes along the island’s east coast, connecting Ryde with Shanklin. ==Route== The line starts at the sea end of Ryde Pier, at Ryde Pier Head station. People can get a ferry here to Portsmouth, meaning there is a direct connection to the rest of the South Western Railway network. Trains go from here to the land end of the pier, where Ryde Esplanade station is. It is the most used station in the town and provides connections to hovercrafts to Portsmouth, and Ryde bus station. From there, trains go underground through a tunnel before going back up to the surface and stopping at Ryde St. John’s Road station. The line’s depot is near there. They then leave Ryde and, if the Isle of Wight Steam Railway is operating that day, trains will stop at Smallbrook Junction. It is unique on the network because there’s no public access except for interchanges. Trains then continue to Brading, a small town in the countryside, before arriving at Sandown. After stopping at a small residential town called Lake, the line stops at Shanklin. == Services == Trains run every 30 minutes in each direction, stopping at every station, unless the Isle of Wight Steam Railway isn’t operating that day, in which case they will skip Smallbrook Junction. == Passenger Numbers == Annual passengers tend to be around 1.5 million. Ever since 2012, passenger numbers have been steadily decreasing. == History == A line from Ryde St. John’s Road to Shanklin was opened by Isle of Wight railway in 1864. It was extended to Ventnor in 1866. In 1880, the London and South Western Railway and London, Brighton and South Coast Railway opened a line north from Ryde St. John’s Road, which they both owned. The line reached Ryde Pier Head. In 1921, all of the Isle of Wight’s railways became owned by Southern Railway. In 1948, Southern Railway became part of British Railways (later British Rail). In 1966, the line from Shanklin to Ventnor closed. The whole line closed later the same year, but reopened the next year with a new third rail electrical system. In 1980, British Rail was split into different sectors - the line became part of the Network SouthEast sector. Services on the line were now branded as Ryde Rail. Lake railway station opened in 1987 In 1989, the line was named Island Line. Smallbrook Junction opened in 1991. In 1994, the line was officially given its name. Stagecoach Group gained rights to the franchise in 1996. In 2006, Island Line was designated a community railway. In 2007, the franchise was merged with South West Trains. Stagecoach gained rights to this expanded franchise, but South Western Railway took over the franchise in 2017. As of 2020, works have been ongoing to improve the line. == Future == A number of suggestions have been made to improve the line. Some have suggested total closure, replacing the trains with guided buses, light rail or trams, while others have suggested that the line be extended to Ventnor or Newport. == Rolling Stock == The line was notable for using old London Underground trains - Class 483, Class 485, and Class 486. In November 2021, the line gained new Class 484 trains. Category:Railway lines of England Category:Isle of Wight",
 "title": "Island Line, Isle of Wight"
}