{
 "id": "1153210",
 "text": "Daniel Patrick Driscoll (born 1985/1986) is an American Army veteran, politician, and businessman who has been the 26th and current United States Secretary of the Army since 2025. He was a Republican candidate for North Carolina's 11th congressional district in the 2020 election. In December 2024, President-elect Donald Trump nominated Driscoll to serve as the Secretary of the Army under his second administration. He was confirmed by the U.S. Senate in February 2025. == Early life == Driscoll was raised in Banner Elk, North Carolina. He earned a Bachelor of Science degree in business administration from University of North Carolina at Chapel Hill. He earned a Juris Doctor from Yale Law School. He was a Yale classmate and friend of Vice President JD Vance, former National Security Advisor Jake Sullivan, and the son of Sen. Richard Blumenthal, D-Conn. Driscoll is a “third generation soldier” whose father was an infantryman in the Vietnam War and whose grandfather served in World War II. ==Career== Driscoll was in the United States Army for three and a half years. He was an armor officer between August 2007 and March 2011 and a cavalry scout platoon leader with the 10th Mountain Division at Fort Drum, New York. He deployed to Iraq for nine months in October 2009. Driscoll earned his Ranger tab at U.S. Army Ranger School and Combat Action Badge. Driscoll later interned for the Senate Committee on Veterans Affairs and worked at an investment bank in Charlotte, North Carolina. Driscoll ran for the Republican nomination to represent North Carolina's 11th congressional district in the 2020 election. He lost the primary to another veteran, Madison Cawthorn. ==Secretary of the Army== On December 4, 2024, President-elect Donald Trump announced that he would nominate Driscoll to be the Secretary of the Army for his second administration. Driscoll had his Senate confirmation hearing on January 30, 2025. His first test came 12-hours before his hearing, when an Army HH-60 collided with American Eagle Flight 5342 killing all 67 people involved. On February 25, 2025, the U.S. Senate confirmed Driscoll to the position of secretary of the Army on a 66-28 vote. On April 9, 2025, President Donald Trump announced Driscoll would replace FBI Director Kash Patel as the acting director of the Bureau of Alcohol, Tobacco, Firearms and Explosives. == Personal life == Hailing from Boone, NC, Dan is married to his high school sweetheart, Dr. Cassie Driscoll, a plastic surgeon. They have two children, Daniel Jr. and Lila, both of whom he has nudged to join the Army someday making the line of national service four generations long. ==References== Category:Living people Category:Republican Party (United States) politicians Category:Politicians from Charlotte, North Carolina Category:Military people from North Carolina Category:Businesspeople from Charlotte, North Carolina Category:1980s births",
 "title": "Daniel P. Driscoll"
}