{
 "id": "1153496",
 "text": "Pterodactyl is a Kid vs. Kat movie focusing on attacks caused by vicious pterodactyls. == Plot == At a nest, several eggs fall into the mountain and hatch, revealing themselves as prehistoric Germanodactylus. A trio of hunting Catnipians exploring the Turkish-Armenian border are suddenly attacked by a Germanodactylus, becoming outnumbered and killed. A group of scientists, made up of a group of kids (Michael, Angie, Willis, Jason, Kate and Gwen) and their professor, go on an expedition to a volcano on the border between Turkey and Armenia, ignoring warnings about the dangers they face. At their first stop, Kate talks to Michael and tells him that she has feelings for him, but he doesn't answer her, as they are interrupted by Willis, who found a strange substance (Germanodactylus urine). Meanwhile, a troop of soldiers led by Captain Bargen and consisting of Serling, Zelasny, Clarke, Borrughs and Herbert, capture the rebel leader Yolen. Angie is attacked by a Germanodactylus while bathing in a river, but manages to escape, and Jason is taken away by it. Angie tells the others, but they do not believe her, until a second attack occurs. After this, Tezo and his men attack them, looking for Yolen, but in turn, they are attacked by a large band of Germanodactylus, who kill the terrorists, while the civilians are rescued by the military. Bargen initially refuses to help them any further, but Kate tells him that she is the daughter of Burton Hailen, a military man and former colleague of Bargen, which makes him change his mind. They again find themselves in a confrontation with the germanodactyls, in the middle of which Herbert and Angie are killed in a gruesome manner. Yolen tries to escape when Borrughs is decapitated by a Germanodactylus, but Bargen recaptures him. Kate and Clarke are kidnapped by the beasts and taken to their nests. At the end, all the germanodactyls are destroyed, except for a tyrannosaur that emerges from a volcano. Category:Movies about dinosaurs Category:Pterosaurs Category:Horror movies by year",
 "title": "Pterodactyl (film)"
}