{
 "id": "115305",
 "text": "Compulsory sterilization is a term used for laws that force certain groups of people to be sterilized so that they can no longer make babies. Often, this is done against their will, or at a time when they cannot consent. It has also been done for the following reasons: * Some people had the idea that they wanted to make the human race better. In the same way than breeding animals, this would be done by picking those people that would be allowed to have children. The others would be sterilized. This movement was especially present during the first half of the 20th century. * Some children that are born are neither clearly male, nor clearly female. Doctors then pick one of the two genders at birth, or shortly afterwards. Surgery is then done to make the child look either male or female. Usually, this means that the person will not be able to bear children. Very often, this is done without the parents knowing or consenting to the operation, shortly after birth. For this reason, some countries do no longer require assigning a sex in the birth register. * In some cases, compulsory sterilizations are done to mentally ill people who are not able to handle a pregnancy on their own.Report of UN Hun Rights Council (A/HRC/22/53)) para 57-70 and this repport also says that sterilization required for transgender is medical abuse also violation of integrity * In China, compulsory sterilization is part of family planning. The International Criminal Court considers compulsory sterilization for a \"crime against humanity\". Transgender persons are often obliged to undergo sterilization for legal rocognition of legal status depite the Principle 3 of the Yogyakarta Principles. == By country == === United States === In 1907, Indiana passed a law allowing forced sterilization.Ruth Clifford Engs: The Progressive Era's Health Reform Movement. A Historical Dictionary. Westport 2003, S. 111. It was the first in the world. Forced sterilization was legal in the U.S. until 1981. Untils 2013, U.S. prisoners were often sterilized. Women of indigenous people in the U.S. were often sterilized. Most of these cases occurred in the 1960s and 1970s. === Sweden === In 1921, the State Institute for Racial Biology opened, at Uppsala University. Between 1935 and 1976, about 58.000 people underwent forced sterilization in Sweden. The Swedish laws did not call this process forced sterilization, but talked about sterilizations without consent. Doctors were told to dissipate doubts, in relevant cases.Jean-Philippe Ernst: Zwangssterilisation. Ein aktuelles medizinethisches Thema? In: Medizin im Dienst der „Erbgesundheit“ Beiträge zur Geschichte der Eugenik und „Rassenhygiene“ (Hg. Westermann, Kühl, Groß). Berlin 2009, S. 254. This was also the case in other Scandinavian countries.Corinna Horban: Gynäkologie und Nationalsozialismus. Die zwangssterilisierten, ehemaligen Patientinnen der 1. Universitätsfrauenklinik heute - eine späte Entschuldigung. München 1999, S. 105. === United Kingdom === In the United Kingodm, forced sterilization was used against homosexuals, until the 1950s. Alan Turing was a well-known victim of these laws. The foreign aid programme of the United Kingdom supports a forced sterilization plan in India, for reasons of protection against climate change. === Germany === ==== Until the end of the Second Word War ==== In 1933, Germany passed a law \"zur Verhinderung erbkranken Nachwuchses\" (this law is called Law for the Prevention of Hereditarily Diseased Offspring in English). With thia law, about 400.000 people were sterilized, between 1934 and 1945.Reichsärztekammer (Hrsg.): Richtlinien für Schwangerschaftsunterbrechung und Unfruchtbarmachung aus gesundheitlichen Gründen. Bearbeitet von Hans Stadler. J. F. Lehmanns Verlag, München 1936 (mit Zitat aus Mein Kampf von Adolf Hitler auf dem Vorblatt: „Der völkische Staat hat das Kind zum kostbarsten Gut eines Volkes zu erklären. Er muß sich als oberster Schirmherr dieses köstlichsten Segens fühlen.“) Those sterilized were not only people who were physicallly disabled, or mentally ill, but also other patients at psychiatric hospital, and people suffering from alcoholism. About 5.000 people died because of this operation. Germany lost the First World War, and had to agree to an Occupation of the Rhineland. Some children of black soldiers with white German women were knowen as Black Horror on the Rhine, during the Weimar Republic. The were called Rhineland bastards. During the rule of the Nazi pparty, they were sterilized in 1937. This did not happened based on the law cited above.Christine Knust: Kontinuität der Stigmatisierung von \"Mischlingskindern\" und \"Farbigen\" am Beispiel der Rheinlandbastarde. In: Medizin im Dienst der „Erbgesundheit“ Beiträge zur Geschichte der Eugenik und „Rassenhygiene“ (Hg. Westermann, Kühl, Groß). Berlin 2009, S. 120f. Women in labor camps were sometimes sterilized, and forced to have an abortion.Ute Vergin: Die nationalsozialistische Arbeitseinsatzverwaltung und ihre Funktionen beim Fremdarbeiter(innen)einsatz während des Zweiten Weltkriegs. Osnabrück 2008, Volltext, PDF. In KZ Auschwitz, people looked at ways to do mass sterilizations. Carl Clauberg did experiments with injeting corrosive substances into the cervices of women; Horst Schumann did experiments with radiation. ==== After the War ==== There are estimation that until the respective laws were amended in 1992, about 1.000 mentally ill girls were sterilized in Western Germany, each year.Anke Engelmann: Wenn zwei sich lieben. In: Publik-Forum, Nr. 12, 2009 (; PDF; 2,1 MB) In 2004, there were 187 applications for a compulsory sterilization, under the new law. 184 of them were done. Until a decision by the Bundesverfassungsgericht in 2011, transsexuals, with a same-sex orientation either had to get married, or they had to undergo a sex-change operation (which would result in their sterilization) and enter a same-sex union. The court found this la was against personality laws, and therefore repealed it. Since then, transsexuals can enter a same-sex union, without the obligation for sterilization. === Other countries === From about 1870,Christian Koller: Identität aus den Genen. In: DAMALS. Das Magazin für Geschichte. Nummer 6, 2018, ISSN 0011-5908, Seite 23. forced sterilzation, based on the idea of Eugenics, also occurred in Switzerland. In 1929, the Canton Vaud, was the first entity in Europe to pass sterilization laws based on Eugenics. In Alberta, Canada, a law was passted in 1928; this law allowed to sterliize mentally ill people. Denmark passed such laws in 1929. Until 1938, Sweden, Norway, Finland, Latvia and Iceland followed. Some indigenous people from Mexico had to undergo a compulsory sterilization. == References == Category:Contraception Category:Human rights abuses Category:Eugenics",
 "title": "Compulsory sterilization"
}