{
 "id": "115308",
 "text": "Malthusianism is a set of ideas developed by Reverend Thomas Robert Malthus. Malthus was an economist who lived during the industrial revolution. In 1798, Mathus published a book, called An Essay on the Principle of Population. In it, he describes his Malthusian growth model. He wrote that the growth of the population is exponential, but the growth of the food supply is only arithmetical. This means if there are no limits to the growth of the population, it will not be possible to produce food for all of them. Malthus was read by Charles Darwin. It showed Darwin that the survival of a species was something which needed explaining. The Tory party had paternalistic ideas such as charity for the poor. Malthus said this would not work, and it would only lead to increased numbers of the poor. The theory was developed into Whig economic ideas such as The Poor Law Amendment Act of 1834. Its opponents described the act as \"a Malthusian bill designed to force the poor to emigrate, to work for lower wages, to live on a coarser sort of food\". Adrian J. Desmond, The Politics of Evolution: Morphology, Medicine, and Reform in Radical London (1989): 126. The act brought the construction of workhouses despite riots and arson. By that time the ideas were widespread in progressive social circles. One supporter was the novelist Harriet Martineau who also knew Charles Darwin. The ideas of Malthus were a significant influence on the development of Darwin's ideas. Though Malthusianism has since come to be identified with the issue of general over-population, the original Malthusian concern was more specifically with the fear of over-population by the dependent poor.http://www.umbc.edu/history/CHE/InstPg/RitDop/Discovery-of- poverty-Malthusianism.htm One of the earliest critics of Malthusian theory was Karl Marx who referred to it. Many people today believe that Malthus was right about human population growth getting out of hand. ==Sources == *Adrian Desmond and James Moore, Darwin (London: Michael Joseph, the Penguin Group, 1991). *Marx's footnote on Malthus from Capital ==References== == Other websites == * *Antony Trewavas, \"Malthus foiled again and again,\", Nature, August 8, 2002 Category:Economic history Category:Human population planning",
 "title": "Malthusianism"
}