{
 "id": "1153420",
 "text": "A Perfect Month is a month where the days are arranged in a shape of a rectangle. This means a perfect month starts on the first day of the week and the number of days in the month is evenly divisible by the number of days in a week. Since there are 7 days in a week, the number of days in the month must be divisible by 7. Therefore, only February in a common year can be a perfect month since it is the only month that has a total number of days that is divisible by 7. In a common year, February has 28 days while the other months have either 30 or 31 days, both of which are not divisible by 7. February cannot be a perfect month in a leap year since it has 29 days, meaning the number of days in that month is no longer divisible by 7. In addition, February must start on the first day of the week. Since the month of January has 31 days, it always starts three days of the week earlier than February. Therefore, in Sunday-first calendars, the year must be a Common year starting on Thursday, with the most recent such year being 2015 and the next one being 2026. In Monday-first calendars, the year must be a Common year starting on Friday, with the most recent such year being 2021 and the next one being 2027. This phenomenon occurs once every six years and twice every eleven years consecutively. (e.g. 1981, 1987, 1998, 2009 in Sunday-first calendars and 1993, 1999, 2010, and 2021 in Monday-first calendars). In the Gregorian calendar, the years 1700, 1800, and 1900 are not leap years. Therefore, there were Sunday-first perfect months in 1693, 1699, 1705, and 1711 with spacing of six years in between each, 1789, 1795, 1801, and 1807 also with spacings of six years in between each, and 1891 and 1903 with a spacing of twelve years. Likewise, there were Monday-first perfect months in 1694, 1700, and 1706 with spacings of six years between each, 1790 and 1802 with a spacing of twelve years, and 1897 and 1909 also with a spacing of twelve years. In each 400-year cycle in a Gregorian calendar, there are 44 perfect months in Sunday-first calendars and 43 perfect months in Monday-first calendars. In the Julian calendar, the 6-11-11 year sequence always holds as years divisible by 4 are always leap years, and there are three perfect months in Sunday-first calendars and three perfect months in Monday-first calendars in each 28-year cycle. Category:Months",
 "title": "Perfect month"
}