{
 "id": "1153582",
 "text": "Congratulations is the second studio album by the band MGMT. It features more of a psychedelic sound, unlike their previous album, Oracular Spectacular, which featured more of a synth-pop sound. Congratulations debuted at number two on the US Billboard 200 with 66,000 copies sold in its first week. In the UK, it debuted at number four on the UK Albums Chart, selling 17,000 copies in its first week. The band recorded the album for 2 1/2 years in February 2008 through January 2010 the band debuted date tracks on The Oracular Spectacular Tour Between January and June 2009 MGMT first confirmed the new song for 2010 On October 8, 2008, October 7, 2009 MGMT has new song out Flash Deilrium ==Background== Speaking to Spin magazine on January 12, 2010, VanWyngarden declared that the album was finished, saying, \"It's mixed and mastered, and now we're just working on presenting it to the world\". On January 18, MGMT stated that they would prefer not to release any singles from the album. In an interview with NME, Goldwasser explained, \"We'd rather people hear the whole album as an album and see what tracks jump out rather than the ones that get played on the radio – if anything gets played on the radio!\" He also said, \"There isn't a 'Time to Pretend' or a 'Kids' on the album. We've been talking about ways to make sure people hear the album as an album in order and not just figure out what are the best three tracks, download those and not listen to the rest of it\". ==Singles== Despite the band's pledge to not release singles, the album's lead single, \"Flash Delirium\", was made available as a free download on their website on March 9, 2010, before being generally released on March 23. \"Siberian Breaks\", the second single, was released on April 17. \"It's Working\" was released on June 26 as the third single. The album's title track was also released as the fourth and final single from the album on November 26. ==Artwork== The cover art was designed by Anthony Ausgang, known for his kitschy lowbrow art style. The artwork depicts a hedgehog-like animal on a surfboard, surfing on a wave that is anthropomorphized as a cat about to swallow the creature. Commenting on the composition of the artwork, Ausgang stated that he tried to \"use bright colors and get across ideas that are slightly dark.\" ==Release== In February 2008 the band began recording. In January 2010, VanWyngarden said that they would prefer not to release any singles from the album. The band On December 13, 2009, the group announced there was a new album coming out In Early 2010 for the album to kick new futuristic decades kick off New Year new single form after recovering 2 1/2 year hiatus from releasing their 2007 debut album Oracular Spectacular for Drama The album was announced twice On January 26, 2010, On January 4, 2010 - February 18, 2010, MGMT unveil the album artwork for their album for year On November 3, 2007, that weekend the group was playing At The Austin Texas festival called fun fun fun festival or 2007 MGMT played were wrreoicndgn the album April 23, 2009, the lamb I still in the works not too long in 2007 - early 2008 MGMT released their first album Oracular Spectacular the second album is a departure from their 2007 debut album Oracular Spectacular October 16, 2009, the group's new songs are in 2010 by March 2010 MGMT special concerts to promote the stream release of their second album Congratulations Goldwasser explained in an interview with NME, \"We'd rather people hear the whole album as an album and see what tracks jump out rather than the ones that get played on the radio – if anything gets played on the radio!\" He also said, \"There isn't a 'Time to Pretend' or a 'Kids' on the album. We've been talking about ways to make sure people hear the album as an album in order and not just figure out what are the best three tracks, download those and not listen to the rest of it\". From February 27, 2008, to Mid 2010 the band all the songs from this album In October 2007 the group premiered their first album Oracular Spectacular On June 12, 2009, MGMT officially first discussed the albu. On March 8, 2008, when he was in Austin Texas for the SXSW festival 2008 the band played all the songs for the first time and the group discussed the new album In April 2010 On January 17, 2009, MGMT did recording demo album the album was smelled for 2010 before their 2013 album MGMT (Album) On October 3, 2008, the group saying they are going to still play new song Elvis for their April 2010 album On October 5, 2008, just following 2 days later their next album In April 2010 is going to have a David Bowie song on it for their album tribute After the 2004-2007 working wetting recordings the band was still recording their 2nd album at their January 2009 shows on their Oracular Spectacular Tour On January 11, 2009 Despite the band saying they wouldn't release singles, Flash Delirium was made available as a free download on March 9, 2010. Siberian Breaks and It's Working later got singles, and also the title track, Congratulations === ARTIST === MGMT === RELEASED === April 13, 2010 Mid-2010 - late 2013 ( Radio Release) === RECORDED === Early 2008 - Early 2010 === LENGTH === 43:53 === LABEL === Columbia === PRODUCER === MGMT • Sonic Boom No. Title Length 1 It's Working 4:06 2 Song for Dan Treacy 4:09 3 Someone's Missing 2:29 4 Flash Delirium 4:15 5 I Found a Whistle 3:40 6 Siberian Breaks 12:09 7 Brian Eno 4:31 8 Lady Dada's Nightmare 4:31 9 CongratulationsSound and Vision (David Bowie cover) 3:55 iTunes Store pre-order bonus track No. Title Length 10 Inbetween the Liners 6:35 Japanese re-release bonus tracks No. Title Length 10 Flash Delirium (BBC Radio 1 Session) 4:16 11 \"Brian Eno\" (BBC Radio 1 Session) 4:29 12 \"It's Working\" (BBC Radio 1 Session) 4:10 13 \"It's Working\" (Air Remix) 4:35 14 \"Brian Eno\" (Cornelius Remix) 4:20 15 \"Flash Delirium\" (music video) 4:23 16 \"It's Working\" (music video) 4:09 ==References== Category:2010 albums",
 "title": "Congratulations"
}