{
 "id": "115311",
 "text": "Sir Francis Galton FRS (Birmingham, 16 February 1822 – Surrey, 17 January 1911), half-cousin of Charles Darwin, was an English scientist. His main field of work was human biology and inheritance of mental characteristics. Galton was a polymath: an anthropologist, a eugenicist, a tropical explorer, geographer, inventor, meteorologist, proto-geneticist, psychometrician, and statistician. He was knighted in 1909. Galton produced over 340 papers and books in his lifetime. He created the statistical concepts of normal distribution, correlation and regression toward the mean. He was the first to apply statistical methods to the study of human differences and inheritance of intelligence. He was the first person to do twin studies. His method was to trace twins through their life-history, making many kinds of measurement. Unfortunately, though he knew about monozygotic (identical twins) and dizygotic twins, he did not appreciate the real genetic difference.Bulmer M. 2000. Francis Galton, pioneer of heredity and biometry. Johns Hopkins, Baltimore MD. p67Galton F. 1875. The history of twins, as a criterion of the relative powers of nature and nurture. J. Anthropological Inst. 5, 329–348. Twin studies of the modern kind did not appear until the 1920s. He also introduced the use of questionnaires and surveys to collect data on human communities. He needed such data for genealogical and biographical works and for his anthropometric studies. He was a pioneer in eugenics, coining the very term itself and the phrase \"nature versus nurture\". As an investigator of the human mind, he founded psychometrics (the science of measuring mental faculties) and differential psychology. Galton created a method for classifying fingerprints that proved useful in forensic science. As the initiator of scientific meteorology,Galton F. 1863. Meteorographica. Macmillan, London. he devised the first weather map,Francis Galton, meteorologist proposed a theory of anticyclones, and was the first to establish a complete record of short-term climatic phenomena on a European scale.Francis Galton (1822-1911) - from Eric Weisstein's World of Scientific Biography He also invented the Galton Whistle for testing differential hearing ability. == Books by Galton == *1853 Narrative of an explorer in tropical South Africa. *1855. The art of travel, or shifts and contrivances available in wild countries. Murray, London. *1863. Meteorographica. Macmillan, London. *1869 [2nd ed 1892]. Hereditary genius: its laws and consequences. Macmillan, London. *1874. English men of science: their nature and nurture. *1883. Inquiries into human faculty and its development. Macmillan, London. *1884. Record of family faculties. Macmillan, London. *1889. Natural inheritance. Macmillan, London. *1892. Fingerprints. Macmillan, London. *1893. Decipherment of blurred finger prints. *1895. Fingerprint directories. *1909. Memories of my life. Macmillan, London. *1909. Noteworthy families. Murray, London. ==References== Category:1822 births Category:1911 deaths Category:English biologists Category:English geneticists Category:British geographers Category:British meteorologists Category:People from Birmingham",
 "title": "Francis Galton"
}