{
 "id": "1153616",
 "text": "U.S. President Ronald Reagan has been seen in popular culture since he was elected president in 1980. Reagan also appeared many times in popular fiction. ==Culture depiction== ===Movies=== In the 1991 crime/thriller movie Point Break, a face mask of Reagan is worn by the leader (Patrick Swayze) of the \"Ex-Presidents\", a gang of robbers who wear face masks of former Presidents during bank robberies. In the 2000 psychological horror movie American Psycho, Reagan was discussed towards the end of the movie as to whether he is a psychopath or an innocent old man in regards to the Iran-Contra affair. In 2001, Richard Crenna played Reagan in the Oliver Stone television movie The Day Reagan Was Shot. In 2007, the edited version of his diary was published entitled The Reagan Diaries. It became the New York Times Best Seller. In March 2018, it was confirmed that actor Dennis Quaid would play Reagan in a biographical movie based on Reagan's life. David Henrie was cast to play a younger Reagan in the movie. The movie was released in August 2024. In 2014, Reagan was played by British actor Alan Rickman in Lee Daniels' The Butler. In 2015, Bill O'Reilly published Killing Reagan, the fifth book of his Killing series. It covers the assassination attempt on Reagan in March 1981. A year later, National Geographic Society announced they were making a television movie based on the book. Killing Reagan was premiered on National Geographic on October 16, 2016, with actor Tim Matheson playing Reagan. In late 2015, actor Bruce Campbell played Reagan in the second season of Fox's criminal suspense drama series Fargo. ===Television=== Voice actor Hank Azaria voiced Reagan three times (1993, 1994, and 2012) in The Simpsons. Harry Shearer said that Simpsons character Mr. Burns is inspired by Reagan. Seth MacFarlane voiced Reagan in American Dad! and on Family Guy for special episodes. During the history of Saturday Night Live, Reagan has been played by Phil Hartman, Randy Quaid and Robin Williams. In a 2010 short comedy video, Presidential Reunion, actor Jim Carrey played the spirit of Reagan trying to speak to Barack Obama about bank companies and the media. ==Other== In October 2018, the Reagan library began showing three Reagan holographs: one where Reagan is in the Oval Office, one where he is in a train during his 1984 campaign and one at his Rancho del Cielo. Old footage of Reagan and his likeness was used for the 2020 first-person shooter video game Call of Duty: Black Ops Cold War. ==Comics== Ronald Reagan met Captain America in Marvel Comics, would become. He even was shown as the star of the Solsons' Comics series Reagans Raiders, in 1987. Marvel Transformers UK Annual 1985 had a story called \"Plague of the Insecticons\". Optimus Prime lead Prowl and Warpath to a meeting with President Ronald Reagan in Washington D.C. to open a talk between the Autobots and the US government. In 1986, Ronald Reagan made an appearance in volume 1, issue 8, of the DC Comics series Booster Gold. ==Postage stamps== After Reagan's death, the United States Postal Service made a President Ronald Reagan commemorative postage stamp in 2005. ==Related pages== * What would Reagan do? ==References== Category:Ronald Reagan Category:Culture",
 "title": "Cultural depictions of Ronald Reagan"
}