{
 "id": "1153526",
 "text": "Maung Maung Aye (; born 1962) is a Burmese army general in the military of Myanmar (also known as the Tatmadaw). He holds the military rank of general and has served in various important positions within the Myanmar Armed Forces. He is currently serving as the Joint Chief of Staff of Myanmar’s military. == Early life and education == Maung Maung Aye was born in Thanlyin, Myanmar and attended Defence Services Academy, where he trained to become an officer. He later joined the Myanmar Army, where he began his career and rose through the ranks. == Military career == Maung Maung Aye's military career has been marked by his leadership in several roles. He has held key positions within the armed forces, especially in operations related to counter-insurgency and national defense. His career includes significant involvement in military campaigns against ethnic armed groups in Myanmar, particularly in the states of Kachin, Shan, and Rakhine. Maung Maung Aye's notable rise within the Myanmar military includes his promotion to Joint Chief of Staff in 2021. He succeeded General Mya Tun Oo, who was appointed to a civilian role in the cabinet of Myanmar's military-led government. == Role in the 2021 Myanmar military coup == Maung Maung Aye played a crucial role during the 2021 Myanmar military coup, which resulted in the removal of the civilian government led by Aung San Suu Kyi and the National League for Democracy (NLD). The coup took place on February 1, 2021, and Maung Maung Aye was one of the military leaders who supported the takeover. The coup was widely condemned internationally, with many governments calling for the release of elected leaders and the restoration of democratic rule. The military, led by Senior General Min Aung Hlaing, took control of the country after accusing the civilian government of election fraud, although no evidence was provided. During the coup, Maung Maung Aye was involved in the military's control of the country's security forces controversies. Maung Maung Aye, like many senior officers in the Myanmar military, has been involved in controversial military actions. His career has been linked to the military’s violent response to protests and armed resistance following the 2021 coup. Reports from human rights organizations have accused the military of using excessive force against demonstrators and ethnic minorities in Myanmar. These aced to international criticism and calls for accountability. Additionally, Maung Maung Aye’s role in the military’s long-standing operations against ethnic armed groups has also drawn criticism. Many ethnic minorities in Myanmar accuse the military of human rights abuses and war crimes, including forced displacement, torture, and extrajudicial killings. == Personal life == Not much is known about Maung Maung Aye’s personal life, as he keeps a low profile outside of his military duties. Like many high-ranking military officers in Myanmar, he is focused on his career and has avoided public discussion of his personal affairs. == References == Category:1962 births Category:Living people Category:Burmese generals Category:Prime Ministers of Myanmar Category:Current national leaders Category:Pages created with the Article Wizard from 2024",
 "title": "Maung Maung Aye"
}