{
 "id": "1153758",
 "text": "Farewell to Tarwathie (Fareweel Tae Tarwathie) is a song written by George Scroggie (1826-1907). Scroggie was a Scottish poet-peasant who lived in Aberdeenshire in the north-east of Scotland, on Tarwathie farm. According to some he lived around Crimond (Creemond), about from the coast, while others claimed him to be a miller who lived near Aberdeen, in Fedderate, New Deer. ==Origins and lyrics== The piece is part of the collection The Peasant's Lyre, preserved in the Library of Congress, published in 1857 in Aberdeen, in which the poem Farewell to Tarwathie appears with 16 stanzas.George Scroggie, The Peasant's Lyre, A Collection of Miscellaneous Poems (Strichen, Aberdeenshire, printed by William Bennett, 1857, p. 73) Some scholars noted kinship between the Scroggie family and the Cardno. The latter had more affinity with the sea and were whale fisherman. The poem is the protagonist's paean to his beloved homeland, shortly before leaving for Greenland on a whaling ship. The poet is sad because he has to leave his home to undertake the long and dangerous journey, but he is hopeful of returning richer. In that period, whaling became attractive, due to the introduction of steamboats. However, the Whaler Tay, which was the first in the world to mount a steam engine, set sail from the port of Dundee in 1857: so it is assumed that the whaler on which the protagonist will embark, was a sailing ship. Bob Dylan, in retracing the sequences of the composition of Farewell, Angelina, stated that Scroggie's song was inspired by the old traditional ballad Wagoner's Lad, dating back to the 18th century.Farewell, Angelina by Joan Baez, SongFacts, 2022 The protagonist is sad because he has to leave his home to undertake the long and dangerous journey, but he is hopeful of returning richer. In the period in which the poem was written, it corresponds to the new impetus given to whaling, with the introduction of steamboats. However, the Whaler Tay, which was the first in the world to mount a steam engine, had set sail from the port of Dundee in 1857: so it is assumed that the whaler, on which the protagonist will embark, was still a sailing ship. ==Recordings== *1966, Gordon McIntyre, A Wench, a Whale and a Pint of Good Ale (album) *1971, Ewan MacColl sang the song on The Critics Group album As We Were A-Sailing *1972, Judy Collins in the album Colors of the Day *1973 Fungus (band) – Farewell To Tarwathie *1975, Liam Clancy – Farewell To Tarwathie (album), Plainsong Records – PS 1001, Canada *2008, \"Fareweel Tae Tarwathie\" by Bounding Main released on their 2008 album Going Overboard. ==References== Category:Folk songs Category:Scottish folk songs",
 "title": "Farewell to Tarwathie"
}