{
 "id": "1153458",
 "text": "Dhruva Dharavarsha had big political goals and worked hard to expand the Rashtrakuta empire. In northern India, he defeated the rulers of Kanyakubja. In central India, he fought and won against Vatsaraja of the Gurjara Pratihara Empire and Dharmapala of the Pala Empire, who both wanted to rule Kanyakubja. These victories made him famous and brought him wealth, but he did not gain any lasting land. However, one historian suggests that Dhruva's empire stretched from Ayodhya in the north to Rameshwaram in the south. ==Prelude== ===Reason of the Campaign=== After punishing his southern neighbors for supporting his older brother, Dhruva focused on Northern India. It was once believed that Dhruva went on a northern campaign to help Dharmapala of Bengal, who had married a Rashtrakuta princess, Rannadevi, the daughter of King Parabala. They were thought to be allies against their common enemy, Vastaraja, the ruler of the Gurjara-Pratihara. However, this idea is no longer supported. The Sanjan plates of Amoghavarsha I, published recently, clearly mention that Dhruva also fought against the Gauda ruler in his northern campaign. It now seems that Dhruva's true reason for the northern expedition was to punish Vastaraja, who had supported Govinda II. Later, Dhruva may have attacked Dharmapala because Dharmapala might have tried to stop him, seeing him as a rival for control over northern India, which Dharmapala also wanted to rule. ===Pratihara–Pala Conflict=== The history of northern India during this period is complex, but key facts are important. A Gwalior inscription reveals that Vatsaraja of the Gurjara-Pratihara dynasty took control of the empire from the Bhandi family around 783 AD, defeating Indrayudha, the ruler of Kanauj. Indrayudha likely remained a puppet ruler under Vatsaraja for some time. Meanwhile, Dharmapala of Bengal, seeking power in northern India, supported Chakrayudha, a relative of Indrayudha. Dharmapala initially faced setbacks, but Vatsaraja's victory over the Gaudas is mentioned in inscriptions. Dharmapala’s forces later fought in the Ganges-Yamuna region against the Gurjara-Pratihara. ==Campaign== Dhruva became involved in northern Indian politics when Dharmapala, a ruler from Bengal, gathered his forces and moved into the Doab region to capture Kanauj. Around 789 A.D., Dhruva probably attacked his neighbor, Vastaraja. Vastaraja was likely focused on defending against Dharmapala’s second invasion, which allowed Dhruva to win and take back two white umbrellas that Vastaraja had previously taken from him. This defeat of Vastaraja led to a conflict between Dhruva and Dharmapala, who was already in the Doab. Both rulers likely saw each other as obstacles to their goals of expanding their empires. The exact details of the battles are unknown, but the Sanjan plates of Amoghavarsha I confirm that Dhruva defeated the Gauda king in the Ganges-Jumna Doab. This is also mentioned in the Surat plates of Karka Suvarṇavarsha, where Dhruva and the god Shiva are described in a way that hints at his victory in the Ganges valley. The term used could refer to both Dhruva’s victory over the Ganga ruler and his campaign in the Ganges region, where his large army might have blocked the river while crossing or bathing in it. The Baroda Plates of Karka Suvarņavarsha should now be understood as referring to Dhruva taking control of the area between the Ganges and Jumna rivers. The poet suggests that Dhruva’s ascent to heaven, mentioned later in the verse, was because he controlled the holy rivers, the Jumna and the Ganges. Prinsep's earlier idea that the verse refers to Dhruva drowning himself at the confluence of these rivers is no longer accepted. == References == Category:India Category:Battles involving the Pala Empire",
 "title": "Dhruva's Campaign of North India"
}