{
 "id": "1153648",
 "text": "Pasteur Bizimungu is a Rwandan politician who served as the third President of Rwanda, holding office from 19 July 1994 until 23 March 2000. Bizimungu had previously held several positions under President Juvenal Habyarimana throughout the 1980s. On 7 June 2004 he was sentenced to 15 years in prison for attempting to form a militia, inciting violence, and embezzlement. President Pasteur Bizimungu, a moderate Hutu and member of the- (mainly Tutsi) RPF has been in power since the then-guerrilla RPA took Kigali in July, 1994. His family and political supporters suffered at the hands of extremist Hutus during the events of April, 1994. The RPF-led coalition government has brought a large measure of stability to the country. The USG has supported the current government. We have given over $600 million in emergency and humanitarian aid to the sub-regioni AID- has given substantial sums in development aid, DOD has provided humanitarian assistance and IMET trainingi various agencies have contributed money and personnel to efforts to ready the International Tribunal and Rwandan court system to try those suspected of crimes against humanity, including genocide. We have also supported the Rwandan government at the UN, including support for lifting the arms embargo against Rwanda. European governments believe that the USG is L---------~especially credible with the GOR. Despite considerable progress under very difficult circumstances, President Bizimungu's government has encountered several significant problems since taking power. The judicial system was decimated in 1994. There are over 55,000 prisoners in Rwandan jails in horrific conditions, most arrested since Bizimungu took office. Members of Congress, NGOs and the international community are concerned about this problem, and the GOR's apparent lack of response to it. Zaire has given Rwanda and the UNHCR until December 31 to show substantial progress on repatriating the one million Rwandans in Zaire, at which time Zaire threatens to repatriate them involuntarily, as they started to do in August. Rwandan troops have committed atrocities in April at Kibeho and again in September near Gisenyi, resulting in the deaths of several hundreds. Both incidents were promptly investigated with the full participation of the government (the investigation into the September incidents is not yet complete). The Government of Rwanda is keenly interested in receiving further development aid and diplomatic/political support from the USG. They have indicated an interest in obtaining non-lethal military equipment from DOD stocks. President Bizimungu has met with Defense Secretary Perry, AID Administrator Atwood, and Assistant Secretary of State George Born: 1950 (age 74 years), Gisenyi Province Presidential term: July 19, 1994 – March 23, 2000 Education: University of Rwanda, Strasbourg University Previous office: President of Rwanda (1994–2000) Descendants: Carine Cyuzuzo, Nicole Tamara, Alexander Tabera Category:Rwandan politicians",
 "title": "Pasteur Bizimungu"
}