{
 "id": "1153256",
 "text": "Jassa Singh Ahluwalia (3 May 1718 – 23 October 1783) was a Sikh leader during the period of the Sikh Confederacy, being the supreme leader of the Dal Khalsa. He was also Misldar of the Ahluwalia Misl . This period was an interlude, lasting roughly from the time of the death of Banda Singh Bahadur in 1716 to the founding of the Sikh Empire in 1801. He founded the Kapurthala State in 1772. ==Early life== Jassa Singh was born on 3 May 1718 CE in a jatt Sikh family in the Ahlu village near Lahore, Punjab. Originally known as Jassa Singh he styled himself as Ahluwalia after his ancestral village. Jassa Singh is described sometimes as a member of the Kalal or wine distiller caste,due to intermarriage connection s During the period of Kharak Singh of Kapurthala (r. 1870-1877) a Bhatti Rajput origin story was also created. According to this tradition, one of the Bhatti Rajputs Rana Har Rai had to leave the throne of Jaisalmer for refusing to marry his niece to the Mughal emperor Akbar. However, there is virtually no evidence of this account. According to this account, Har Rai migrated to Punjab, where his descendants married with the Jats, and gradually they became Jats. Starting with Sadhu Singh (also called Sadho or Sadda Singh), they married with Kalals, and the family came to be known as Ahluwalia . British administrator Lepel Griffin, who wrote an account of the rulers of Punjab, dismissed this tradition as fictitious. According to the dynasty's account, Sadhu's Singh's great-grandson Badar Singh and his wife remained childless for a long time, and sought blessings from Guru Gobind Singh. As a result, Jassa Singh was born to them. ==Military Campaign== Jassa Singh took control of his uncle’s group at age 13 after his uncle’s death. He became famous shortly after for raiding a merchant caravan and stealing valuable horses ===Head of the Dal Khalsa=== Jassa Singh Ahluwalia played a key role after Nadir Shah’s invasion in 1739. He helped recover treasure stolen by Nadir Shah. Jassa Singh later built Dallewal Fort on the Ravi River. In 1743, he seized a large government treasure and killed Jaspat Rai. In 1747, he became the leader of the Sikhs with Nawab Kapur Singh’s help. In 1748, Jassa Singh became the head of the Dal Khalsa, the Sikh military. When Nawab Kapur Singh fell ill in 1753, he handed over the complete command of Dal Khalsa to Jaisal Singh Ahluwalia before his death. In 1755, Jassa Singh defeated Adina Beg at Kaddur, forcing him to give up Fatehbad, which became his headquarters until 1780. ===Explosion of Afghan, 1757=== In 1757, Abdali appointed his son, Timur Shah Durrani, as the governor of Punjab and Jahan Khan as his deputy, a quarrel arose between Jahan Khan and Adina Beg Khan, forcing Adina Beg Khan to hide in the hills due to Jahan Khan’s harsh rule. Additionally, Jahan Khan targeted Sodhi Wadbhag Singh of Kartarpur. In response, Adina Beg Khan allied with Jassa Singh Ahluwalia, and together with the Sikhs, they defeated the Afghans in the Battle of MahilpurIn 1758 Adina with help of Sikhs and Marathas drove out the Durranis, Timur Shah and Jahan Khan, escaped to Afghanistan. In 1761, Jassa Singh Ahluwalia defeated Khwajah Mirza Khan, the former governor of Lahore. In July 1761, he defeated and expelled Afghan commanders from the Jalandhar Doab. The Sikhs then attacked Sirhind and looted the city. However, they faced strong resistance from Bhikhan Khan of Malerkotla. Unable to maintain their siege, they turned to Malerkotla, where fierce opposition from its Nawab led to significant destruction and plundering of the surrounding area. ===Jassa Singh Issued the First Sikh Coin in Lahore, November 1761=== In November 1761, following the Diwali celebrations in Amritsar, Jassa Singh Ahluwalia led the Dal Khalsa in an attack on Lahore. The Sikhs besieged the fort, defeated Khwajah Abed, and killed him. After his death, the Sikhs proclaimed Jassa Singh as their \"Padshah.\" and issued coins bearing his name ===The Wadda Ghallughara=== In early 1762, Ahmad Shah Durrani invaded India to crush Sikhs power Ahmad Shah Durrani with his Soldiers reached Malerkotla, west of Sirhind, then attacked a 20,000 Sikh army escorting 40,000 women and children, along with the elderly. In one of their worst defeats—known as Vadda Ghalughara—the Sikhs lost perhaps 5–10,000+ soldiers and had 20,000 civilians massacred. The Afghan forces of Ahmad Shah Durrani came out victorious with the night ambush on the large convoy. ===The Resilience of the Sikhs=== In just three months Sikhs managed to recover from their heavy losses In May 1762, Sikhs defeated Zain Khan Sirhindi and forced him to pay Rs 50,000 tribute and destroyed Muslim tombs and converted mosques into stables for their horses in return for the destruction of their gurudwaras On October 1762, The Sikhs had gathered Amritsar to celebrate Diwali. Abdali attacked them, The Sikhs attacked the Afghans so vehemently and didn't care about their own lives at all. The battle was fought under the grey light of a total solar eclipse. The battle raged furiously from early morning till late night. They both decided to stop for the night and fight the next day. During the night Ahmad Shah Abdali and his forces had retreated to Lahore. Inconclusive ===At Anandpur, 1763=== When Jassa Singh Ahluwalia was celebrating the Hola Mahila festival with Dal Khalsa in March 1763, Sikhs complained that they were facing injustice from the local rulers. After hearing this, Jassa Singh Ahluwalia started a campaign against the local rulers and established a military post there to keep an eye on them. On his way back, he also captured Kot Isa Khan, further consolidating his power in the region. ===Conquest of Sarhind, 1764=== In January 1764, the Dal Khalsa, led by Jassa Singh Ahluwalia, launched an attack on Sirhind. Zain Khan, the governor of Sirhind, was defeated and killed in the battle. After the victory, the Sikhs looted the town without mercy, and the region of Sirhind was divided among the various Sikh misls and the Phulkian states. Jassa Singh Ahluwalia took control of 24 villages in the Ludhiana district, ===Jassa Singh's Conquest of Naraingarh and Surrounding Areas=== After capturing Sirhind, Jassa Singh moved towards Naraingarh, where local leaders gave him a warm welcome. Bulaqi Mal, the Diwan of Raja Kirat Prakash of Nahan, gifted him a horse and Rs. 10,000. Other local leaders also gave tributes, such as Muhammad Baqar, the Mir of Garhi Kotaha, who presented him with an elephant and some rupees. Rae Hoshiar Singh from Rani ka Raepur gave him a horse and Rs. 1,000, and Gharib Das from Manimajra offered Rs. 25,000. ===Ganga Doab, 1764=== In February 1764, Sikhs led by Jassa Singh Ahluwalia, along with leaders such as Khushhal Singh, Baghel Singh, Karora Singh, Sham Singh, and Tara Singh Ghaiba, crossed the Yamuna River at Buriya and entered the Yamuna-Gangetic Doab region. They looted and plundered towns like Shamli, Kandhla, Ambli, Miranpur, Deoband, Muzaffarnagar, and others. They also attacked villages in Bijnor, an area known for its powerful Sayyid families. The Sikhs seized wealth, including gold, coins, and jewels, destroyed villages, and took captives for ransom. Najib-ud-Daulah, who was already worn out from his recent war with Suraj Mall Jat of Bharatpur, did not feel strong enough to confront the Sikhs directly. Instead, he paid them eleven lakh rupees to convince them to leave the area by the end of February. The Sikhs returned with a large amount of loot from the Ganga Doab and Rohilkhand regions. Jassa Singh used one-tenth of the loot to repair the Harmandir Sahib, which had previously been destroyed by Abdali. ===Hill States Forced to Pay Tribute=== In September 1758, after the death of Adina Beg, Jassa Singh Ahluwalia, as the leader of the Dal Khalsa, collected tribute from Kangra and Mandi. In 1763, he also collected tribute from the states of Nalagarh and Bilaspur. In 1765, Raja Ranjit Dev of Jammu paid tribute to Ahmad Shah Durrani, which angered the Sikhs. In response, the Sikh Dal Khalsa, led by Jassa Singh Ahluwalia, attacked Jammu. They imposed a fine of 3.75 lakh rupees on Ranjit Dev and made him subordinate to the Dal Khalsa. This victory boosted Jassa Singh Ahluwalia's power and influence in the area ===Ahmad Shah Durrani's Final Invasion of the Punjab=== In 1766, Ahmad Shah Durrani invaded India for the eighth time. While crossing the Beas River, the Sikhs blocked his way. In January 1767, Ahmad Shah Durrani sent letters to the Jassa Singh Ahluwalia, and other sardars. In the letters, he offered them the choice to join his service if they wanted, but if they had plans to fight him, he challenged them to meet him in battle. The Sikhs, however, refused his offer. Frustrated by their rejection, Ahmad Shah Durrani returned to Afghanistan ===The Rivalry Between Jassa Singh Ahluwalia and Jassa Singh Ramgarhia=== In 1776, while on his way to a fair at Achal near Batala, Jassa Singh Ahluwalia encountered Mali Singh, a commander of the Ramgarhia Misl and brother of Jassa Singh Ramgarhia, who was leading a detachment from Sri Hargobindpur to Batala. The two groups clashed, leading to a bloody battle. Many of Jassa Singh Ahluwalia's soldiers were killed, and he himself suffered two injuries. He fell from his horse and lost consciousness. Mali Singh helped by placing him in a palanquin and taking him to Sri Hargobindpur for treatment. Although Jassa Singh Ramgarhia managed the situation, Jassa Singh Ahluwalia, known as the \"Emperor of the Panth\" or \"Jathedar Sultan-Ul-Qaum,\" felt deeply insulted by the attack. He stayed in Sri Hargobindpur for two days, refusing to eat, drink, or speak to anyone. On the third day, leaders like Jai Singh Kanhaiya, Gujjar Singh Bhangi, and others visited him, urging him to take revenge on the Ramgarhias. On the third day, Jassa Singh Ramgarhia arranged for Jassa Singh Ahluwalia to leave for Fatehabad with full honors and an escort. Despite these diplomatic efforts, Jassa Singh Ahluwalia vowed to take revenge and expel the Ramgarhias from Punjab. In September 1778, the Ramgarhia Misl and the Kanhaiya Misl clashed over the revenue of certain areas, as their territories overlapped in the Upper Bari Doab and Upper Jullundur Doab districts. In this conflict, Jai Singh Kanhaiya had the support of Jassa Singh Ahluwalia. Backed by an Ahluwalia force, Jai Singh and Haqiqat Singh Kanhaiya attacked Jassa Singh Ramgarhia's headquarters in Sri Hargobindpur. Despite strong resistance from Jassa Singh Ramgarhia, he was eventually forced to retreat from the Trans-Sutlej area. At the same time, Batala, under the control of Jassa Singh's brother Mali Singh, was besieged by Gurbaksh Singh Kanhaiya. Mali Singh was infamous for his cruel rule, which alienated the local population. Frustrated with his tyranny, the locals sided with the attackers and allowed the Kanhaiyas to enter the city. After Mali Singh retreated, the Kanhaiyas took over Batala, and Gurbaksh Singh was appointed the new administrator. Prominent figures like Raja Singh, Diwan Singh, Mansabdar Qanungo, and the Brahmin Tara Chand assisted Gurbaksh Singh in governance. Following these victories, the combined Kanhaiya and Ahluwalia forces advanced towards Kalanaur, which was controlled by Tara Singh Ramgarhia, another brother of Jassa Singh Ramgarhia. Tara Singh was defeated and killed, and Haqiqat Singh Kanhaiya took over Kalanaur. This led to the Kanhaiyas and Ahluwalias capturing the entire Ramgarhia territory in the Trans-Sutlej region. Afterwards, Kanwar Bhag Singh Ahluwalia was assigned to Mahtabkot, near the Satluj River. Jassa Singh Ahluwalia instructed him not to block the Ramgarhia retreat across the river or interfere with their escape. Despite this defeat, the Ramgarhia Misaldar, Jassa Singh Ramgarhia, did not give up. He gathered a large force of irregular cavalry on the other side of the river and, with the support of the Phulkian leader Amar Singh of Patiala, took up a position in the Hissar region. ===The Occupation of Kapurthala in December 1779=== Rae Ibrahim Bhatti was the ruler of Kapurthala. He had to pay ₹100,000 as tribute to Jassa Singh but stopped paying after 1770. This caused a debt of ₹400,000 to build up. Jassa Singh called him to Fatehabad, but even then, he did not pay the tribute, making the situation worse. In 1771, Jassa Singh captured one of Rae Ibrahim Bhatti's forts. In 1773, Jassa Singh attacked Rae Ibrahim, who surrendered all his villages except Kapurthala and 27 nearby villages. In 1777, Mohar Singh, Jassa Singh's son-in-law, was killed by forces from one of Rae Ibrahim's forts. Rae Ibrahim apologized to show he was not involved, but Jassa Singh demanded the guilty person. The culprit was never found. Jassa Singh decided to take control of Kapurthala. In 1780, he attacked Kapurthala. Rae Ibrahim tried to stop him by sending gifts, but it did not work. In the end, Rae Ibrahim surrendered and was allowed to leave safely with his family. Kapurthala then became part of Jassa Singh Ahluwalia's territory. ===The Conquest of Delhi and the Clash of Egos=== In March 1783, the Dal Khalsa, led by Jassa Singh Ahluwalia, advanced upon Delhi and was joined by Jassa Singh Ramgarhia on March 10. The following day, the Dal Khalsa entered the Red Fort and, in a symbolic gesture, placed Jassa Singh Ahluwalia on the imperial throne in the Diwan-e-Am, giving him the title \"Badshah Singh.\" However, this act sparked a dispute between Ahluwalia and Ramgarhia, who challenged his claim to the title. The disagreement escalated, and both leaders drew their swords, but the confrontation was averted when Ahluwalia renounced the honor, stepping down to maintain unity. ==Death and legacy== Jassa Singh Ahluwalia died on 23 October 1783 in Amritsar. Nawab Jassa Singh Ahluwalia Government College (NJSA Government College) in Kapurthala State, established in 1856 by Raja Randhir Singh of Kapurthala is named after him. A commemorative postage stamp on Jassa Singh Ahluwalia was issued by Government of India on 4 April 1985. ==References== Category:1718 births Category:1783 deaths Category:18th century in India",
 "title": "Jassa Singh Ahluwalia"
}