{
 "id": "1153310",
 "text": "Hari Singh Dhillon (died 1765) was a Sikh warrior. He was the leader of the Bhangi Misl group. When the Dal Khalsa army was formed, he became the leader of the Taruna Dal group. ==Early life== Hari Singh Dhillon was the nephew and adopted son of Bhuma Singh, After Bhim Singh's death, Hari Singh, took over as the leader of the Bhangi Misl. Hari Singh's father, Bhoop Singh, was a landowner in the village of Patoh, near Wadni. Under Hari Singh's leadership, the Misl grew in power and prominence. ==Military Campaign== Ahmad Shah Durrani attacked the Sikhs in the Battle of Kup on February 5, 1762. He stayed in Punjab until December 12, 1762. After he left, Hari Singh attacked Khwajah Saeed Ka Kot and took many arms. On April 10, 1763, the Sikhs gathered in Amritsar to celebrate Baisakhi. During the festival, some Brahmans from Kasur asked for help against Usman Khan, who had taken a Brahmin’s wife, forced her to convert to Islam, and treated her badly. Hari Singh Bhangi decided to help them immediately. Sikhs attack Kasur, In the battle, Usman Khan and 500 of his men were killed. The woman was returned to her husband, and the Afghan homes were looted. In 1764, Hari Singh Bhangi and his sons, Jhanda Singh and Ganda Singh, along with Hari Singh Nakkai marched towards Multan, they caused severe destruction in Multan. He crossed the Indus River and collected tribute from the Baloch leaders in the areas of Muzaffargarh, Dera Ghazi Khan, and Dera Ismail Khan. On his way back, he demanded tribute from the local rulers of Pind Dadan Khan. He then captured Jhang, Chiniot, and Sialkot. Afterward, he attacked Jammu and made Ranjit Dev pay tribute. ==Death== In 1765, Hari Singh and other leaders of the Dal Khalsa marched to Patiala to punish Ala Singh for accepting Ahmad Shah Abdali as his overlord. During the battle, Hari Singh was killed, which relieved both Ala Singh and Jassa Singh Ahluwalia. According to historian Lepel Griffin, Ahluwalia was jealous of Hari Singh's power. As a result of his various military actions, Hari Singh made the Bhangi Misl the most powerful of all the Misl groups. ==References== Category:1765 deaths Category:People from Punjab, India Category:Indian people",
 "title": "Hari Singh Dhillon"
}