{
 "id": "115312",
 "text": "Herbert Spencer (27 April 1820 – 8 December 1903) was an English philosopher, and a prominent liberal political and social theorist of the Victorian era. ==Works== Spencer developed an all-embracing conception of evolution. He saw evolution as the progressive development of the physical world, biological organisms, the human mind, and human culture and societies. Spencer never married; he remained a bachelor. He contributed to a wide range of subjects, including ethics, religion, politics, philosophy, biology, sociology, and psychology. Like Charles Darwin and Alfred Russel Wallace, he read Malthus' Essay on the principle of population, and was deeply impressed by its argument.Stevenson, Leslie and Haberman, David L. 2009. Ten theories of human nature. 5th ed, Oxford University Press, Oxford and New York. p207 Malthus said that sooner or later population growth gets checked by famine and disease, and there are then many deaths.Petersen, William. 1979. Malthus. Heinemann, London. 2nd ed 1999 So, he was prepared for Darwin's idea of natural selection, which he preferred to call \"survival of the fittest\". He did this in Principles of Biology (1864), after reading Charles Darwin's On the Origin of Species. :\"This survival of the fittest, which I have here sought to express in mechanical terms, is that which Mr. Darwin has called ‘natural selection’, or the preservation of favoured races in the struggle for life.\" Spencer's term does strongly suggest natural selection, yet as he extended evolution into realms of sociology and ethics, Spencer made use of Lamarckism rather than natural selection, so it seems he was not a Darwinian after all. Others took up his social ideas, and drew the conclusion that it was useless to try and help the poor, and that competition without limits was the way society should go. Darwin himself did not accept these ideas,In The Descent of Man, Darwin said: \"Important as the struggle for existence been... the moral qualities are advanced much more through the effects of habit, the reasoning powers, instruction, religion, etc., than through natural selection.\". p404 but they were quite widespread in the United States at the end of the nineteenth century. ==References== Category:1820 births Category:1903 deaths Category:19th-century English philosophers Category:British feminists Category:Libertarians",
 "title": "Herbert Spencer"
}