{
 "id": "1153233",
 "text": "The Ibans or Sea Dayaks are an Austronesian ethnic group. They mostly live in northwestern Borneo. The Ibans are also known as Sea Dayaks. the title Dayak was given by the British and the Dutch to a lot of ethnic groups in Borneo Island. They speak the Iban language and Malay or Indonesian language. The Ibans live in the state of Sarawak in Malaysia, Brunei, and the province of West Kalimantan in Indonesia. They traditionally live in longhouses called rumah panjai. In West Kalimantan, the longhouses are called betang (trunk). == History == === Early origins === According to native myths and legends, they came from Kapuas River in Kalimantan (Indonesian Borneo). They slowly moved to Sarawak due to tribal issues. The ancient Iban legend is also being supported by several modern-day linguistic studies by Asmah Haji Omar (1981), Rahim Aman (1997), Chong Shin and James T. Collins (2019) and material cultures by M. Heppell (2020). They trace the Iban language and culture originated from the upper Kapuas. === The period of great migration === Based on the research from Benedict Sandin (1968), the period of Iban migrations from the Kapuas Hulu Range were determined to begin from the 1750s.Shin, Chong (2021). These people entered Batang Lupar and set a settlement near to Undop River. In the period of five generations, they expanded towards west, east and north. There, they found new settlements around Batang Lupar, Batang Sadong, Saribas and Batang Layar. By the 19th century, the Ibans started to migrate towards the basin of Rejang. They went there through Katibas River, Batang Lupar and Saribas River. From 1870s, it was recorded that a huge population of Ibans have lived near Mukah and Oya River. The settlers arrived to Tatau, Kemena (Bintulu) and Balingan by the 1900s. In the turn of twentieth century, the Iban expanded to the Limbang River and Baram valley in the northern Sarawak. == Language == The Iban language (jaku Iban) is spoken by the Iban. The language belongs to Malayic languages. The Malayic languages is a Malayo- Polynesian branch of the Austronesian language family. It is thought that the homeland of the Malayic languages is in western Borneo, the place where the Ibanic languages remain. == Religion == For hundreds of years, the Iban's ancestors practiced their own traditional custom and pagan religious system. After the arrival of James Brooke, the Ibans began to convert to Christianity. Although they are now mostly Christian; many continue to practise both Christian and traditional pagan ceremonies. Some ancestral practices such as 'Miring' are still prohibited by certain churches. After being Christianized, the majority of Iban people have changed their traditional name to a Hebrew- based \"Christian name\" followed by the Iban name such as David Dunggau, Joseph Jelenggai, Mary Mayang, etc. In Brunei, 1,503 Ibans have converted to Islam from 2009 to 2019 according to official statistics. Many Bruneian Ibans intermarry with Malays and convert to Islam as a result. Nevertheless, most Iban in Brunei are devout Christians similar to the Iban in Malaysia. Bruneian Ibans also often intermarry with the Murut or Christian Chinese beacause of their shared faith. == Citations == Category:Ethnic groups in Indonesia Category:CS1 Malay-language sources (ms)",
 "title": "Iban people"
}