{
 "id": "1153822",
 "text": "Nawab Kapur Singh (1697 – 9 October 1753) was a prominent Sikh leader who played an important role in the development of the Sikh community in the early 18th century. He led the Sikhs during a period of significant challenges and change. Kapur Singh is most famous for organizing the Sikh Confederacy and leading its strong military group, the Dal Khalsa. ==Early life== Kapur Singh was born in 1697 in the village of Faizullahpur, near Amritsar. In 1721, he and his father Dalip Singh, along with his brother Dan Singh, converted to Sikhism by taking the pahul ceremony from Bhai Mani Singh. They were members of the Virk Jat community. Kapur Singh became a Sikh during a period when the community was under severe persecution. Despite these challenges, he remained hopeful and had strong faith in the future of the Khalsa. Zakariya Khan, the viceroy of Punjab from 1726 to 1745, initially tried to suppress the Sikhs with harsh measures. However, this approach failed, and he shifted to a policy of peace. As part of this change, Zakariya Khan offered the Sikhs a jagir, which included Chak Guru (Amritsar) and 12 villages. He sent Subeg Singh, a Sikh who spoke Persian, to deliver the offer. Subeg Singh suggested adding gifts and honors to the proposal, which Zakariya Khan agreed to. As a result, Kapur Singh was given the title of Nawab, along with a robe of honor and a bag of gold coins. ==Kapur Singh Becomes Nawab== In 1733, Zakariya Khan, the Mughal governor of Punjab, tried to make peace with the Sikhs. He sent Subeg Singh, a trusted officer, to offer them a jagir, a title, and gifts. The Sikhs, led by Darbara Singh, were initially hesitant to accept the offer. Darbara Singh rejected the proposal outright, but the Sangat, a gathering of Sikh leaders, persuaded Kapur Singh to accept the offer. Kapur Singh was given the title of Nawab, along with a khilat, a bag of gold, and a jagir. The jagir included the lands of Dipalpur, Kanganwal, and Jhabal, with a combined revenue of one lakh rupees. Kapur Singh was also exempted from attending the court or capital of the Mughals Once they accepted the offer, the Sikhs were able to settle peacefully in their sacred city, Amritsar. After years of constant struggle and warfare against the Mughal forces, they finally found a period of rest and tranquility. ===Division of the Khalsa and Confiscation of the Jagir=== In 1733, the Sikhs settled in Amritsar, near the holy temple and tank, after accepting an offer from the Mughal governor. Nawab Kapur Singh was put in charge of managing the langar, stores, and stables for the horses, which was a difficult task given the large number of people and animals to feed. While there was enough grain and pulses, supplies like milk, ghee, and meat were sometimes scarce. Darbara Singh, responsible for maintaining order, died in 1734, leaving Kapur Singh to shoulder the leadership. This led to dissatisfaction among the younger Sikhs, who complained about the unfair distribution of food and supplies. The conflict grew due to a generational divide, with the younger Sikhs, feeling free from the control of their elders, clashing with the older leaders. To resolve the issue, Kapur Singh divided the Sikhs into two groups: the Budha Dal for the older members and the Taruna Dal for the younger ones. Each group was further divided into five sub-groups, each with its own leader, derah, and resources. The younger Sikhs grew frustrated with their life of dependency and some engaged in illegal activities, causing tensions with the Mughal government. In response, Zakariya Khan, the Mughal governor, suggested that the young Sikhs join the Mughal army, but Kapur Singh declined. Zakariya Khan then proposed that the Sikhs become peaceful farmers in exchange for tax exemptions, but Kapur Singh did not agree. As a result, by the end of 1735, Zakariya Khan confiscated the jagir given to the Sikhs. ==Nadir Shah's Invasion of India== Nadir Shah's invasion of India in 1739 had a devastating impact on the region. He was in Punjab and Delhi for five months, from January to May, during which time the administrative machinery collapsed. Cities like Wazirabad, Eminabad, and Gujrat were reduced to ashes, and big villages were also destroyed. The situation was chaotic, with every person taking advantage of the situation to plunder and pillage. Thousands of robbers roamed the public roads, making it difficult for people to travel safely. Shaikh Ali Hazin, who was traveling from Lahore to Sarhind at the time, described the province as being in \"complete revolution\". Kapur Singh, the leader of the Sikhs, saw an opportunity to gather booty and punish their enemies. He organized small parties of Sikhs to block roads and pathways, and they plundered large parts of the country. They even built a small fort at Dallewal to store their booty. The Sikhs also targeted individuals who had informed the government about their whereabouts. Kapur Singh kept himself engaged in organizing these small parties of Sikhs, who were determined to take advantage of the chaotic situation. After Nadir Shah left, Zakariya Khan took control of Punjab, only to find the region in ruins. He immediately targeted the Sikhs, destroying their fort at Dallewal and executing many of them at Shahid Ganj. As a result, the Sikhs were forced to flee Punjab and move to Malwa. According to Ratan Singh Bhangu, the Sikhs from the Majha area were pushed out by the Brars. In the Sarhind region, the Sikhs took over several villages, placing them under the leadership of Daranat Shah. Emperor Muhammad Shah intervened by sending Azim-ud-Din Khan to deal with the Sikhs. Despite this, the Sikhs were forced to retreat into the Lakhi Jungle. Zakariya Khan's rule ended with his death on July 1, 1745. After his death, weak leaders like Abdullah, Yahiya Khan, and Shahnawaz took over. During this period, many young Jats from the Majha region were drawn to Sikhism, seeking a better life free from the hardships of farming. Kapur Singh, a Sikh leader, organized these new recruits into 25 bands, each with about 100 young men led by a commander. These bands united under their shared faith and common goals, forming a confederation for defense and offensive actions. ==Foundation of the Dal Khalsa== Kapur Singh recognized that the situation was urgent. He thought Ahmad Shah Durrani, despite his previous defeat, would likely attack again. This was because Durrani needed money to solidify his control in Afghanistan, where the people were very poor, and so he would need to invade India to get the funds. Kapur Singh also realized that the Mughal Empire was weak, a fact he had observed when he was in Delhi under Nadir Shah. Moreover, he knew that Muin-ul-Mulk was known for his strict and harsh rule. To safeguard the Sikhs from these threats, Kapur Singh decided it was necessary to unite his people under a strong and younger leader. On March 29, 1748, Sikh leaders met in Amritsar and formed the Dal Khalsa, which was divided into eleven misls (groups), each led by Jassa Singh Ahluwalia. The misls were then split into two main divisions: the Budha Dal and the Taruna Dal. The Budha Dal included six misls: Ahluwalia, Dallewalia, Faizullahpuria, Karora Singhia, Nishanwala, and Shahid. The Taruna Dal had five misls: Bhangi, Kanhiya, Nakai, Ramgarhia, and Sukarchakia. ==Founder of the Singhpuria Misl== Kapur Singh was one of the eleven leaders of the Sikh misls. He came from the village of Faizullahpur, which led to his nickname Faizullahpuria. Later, he renamed his misl to Singhpuria. During Ahmad Shah Durrani's second invasion of India in 1749-1750, Kapur Singh saw an opportunity to strike at Lahore. Muin-ul-Mulk had moved his army to the Chenab River to stop the invader, leaving the capital unprotected. Kapur Singh, along with the Dal Khalsa led by Jassa Singh Ahluwalia, attacked Lahore. The city was looted, and its surrounding areas were set on fire. Kapur Singh took control of the city, sitting on the Kotwali platform to manage its revenue. However, when Muin-ul-Mulk's army returned, Kapur Singh withdrew from Lahore. Over time, he gained control of several villages on both sides of the Sutlej River, which brought in two lakh rupees annually. Kapur Singh's force, consisting of 2,500 horsemen, was known for its courage, daring, and fierceness. According to Latif, this group was the most feared and formidable among all Sikh soldiers. ==Death== Before his death, Kapur Singh entrusted the steel mace of Guru Gobind Singh to Jassa Singh Ahluwalia. This act symbolized Jassa Singh's leadership of the Khalsa and honored the wishes of Mata Sundari. Kapur Singh died in October 1753. His tomb is located near the Baba Atal temple in Amritsar, standing as a tribute to his contributions to the Sikh community. ==References== Category:1697 births Category:1753 deaths Category:People from Punjab, India",
 "title": "Nawab Kapur Singh"
}