{
 "id": "115360",
 "text": "Transcription is when RNA is made from DNA. The DNA sequence is copied by a special enzyme called RNA polymerase to make a matching RNA strand. :\"All living things, with their myriad variations, use an almost identical microscopic machine to read their genes. This machine – RNA polymerase – is responsible for a process called transcription, which by producing RNA from DNA, takes the first step in reading the blueprint of life that is encoded in all of our genes\".UCL 'Featured Research'. The matching RNA strand is a 'pre- messenger RNA'. Next, the non-coding introns are stripped out by a spliceosome. The remaining exons are put together to make a messenger RNA. The product is called messenger RNA (mRNA) because it carries a genetic message from the DNA to the protein-making machinery of the cell. Transcription is the first step that leads to the expression of the genes. The stretch of DNA that is transcribed into an RNA molecule is called a transcription unit. This contains: # sequences which regulate the protein synthesis # sequences which do not code: introns # sequences which do code for amino acid sequences in the protein. They are called exons. As in DNA replication, only one of the two DNA strands is transcribed. This strand is called the template strand, because it provides the template for ordering the sequence of nucleotides in an RNA transcript. The other strand is called the coding strand. Its sequence is the same as the newly created RNA transcript (except for thymine being substituted for uracil). The DNA template strand is read 3' → 5' direction by RNA polymerase and the new RNA strand is synthesized in the 5'→ 3' direction. RNA polymerase binds to the 3' end of a gene (promoter) on the DNA template strand and travels toward the 5' end. Roger D. Kornberg won the 2006 Nobel Prize in Chemistry \"for his studies of the molecular basis of eukaryotic transcription\". == Related pages == *RNA splicing *Intron *Oncogene *Protein biosynthesis *Transcription factor *Translation (genetics) *Reverse transcriptase == References == Category:Cell biology Category:Molecular biology Category:DNA",
 "title": "Transcription (genetics)"
}