{
 "id": "1153963",
 "text": "The Northern Counties Palatine was a double-decker body of a bus. It had a step-entrance. It was made from 1988 to 1999 by Northern Counties. Northern Counties were bought by Plaxton in 1995, Plaxton stopped making the Palatine and replaced it with the low-floor Plaxton President in 1999. == Northern Counties Palatine/Countybus == The Northern Counties Countybus was a double- decker body of a bus. It had a step-entrance. It was built from 1988 to 1998 by Northern Counties. From 1990 to 1998, the bus name was changed from Countybus to Palatine. The Palatine I body was built on the following chassis: * Leyland Olympian chassis * Volvo Olympian chassis * Dennis Dominator chassis * Volvo Citybus chassis (also called Volvo B10M) * Scania N113DRB chassis Some Palatines had rectangle front headlights and some had circle headlights === Orders === ==== London ==== London General and London Central ordered 159 Volvo Olympians with Palatine I bodies, and 38 Volvo Citybus's with Palatine I bodies. Capital Citybus and Ensignbus, also used Palatine Is on the Dennis Dominator chassis and the Volvo Olympian chassis. ==== United Kingdom ==== Yorkshire Rider, Busways Travel, Merseybus and GM Buses ordered Leyland Olympians, Volvo Olympians and Scania N113s with Palatine I bodies. GM Buses ordered two Volvo D10Ms with Palatine I bodies, they were made with wheelchair lifts. Maidstone & District, Kentish Bus, Southend Transport and West Riding Buses ordered Leyland Olympians and Volvo Olympians on Palatine I bodies. In 1994, Stagecoach (Cleveland Transit) ordered five Volvo Olympians with Palatine I bodies, In 1995, Kingston upon Hull City Transport ordered three Volvo Olympians with Palatine I bodies. In 1992, Bristol Cityline ordered thirty Leyland Olympians with Palatine I bodies. From 1990 to 1998, East Yorkshire Motor Services ordered Leyland Olympians and Volvo Olympians with Palatine I bodies. Finglands Coachways ordered five Palatine I bodies. From 1989 to 1990, Isle of Man Transport ordered thirteen Leyland Olympians with Palatine I bodies. In 1992, Keighley & District and Yorkshire Coastliner ordered Volvo Olympian with Palatine I bodies. === Gallery === File:Stagecoach in Newcastle bus 14670 Leyland Olympian Northern Counties H670 BNL City Sightseeing half open t.jpg|Open top City Sightseeing Newcastle Leyland Olympian with Northern Counties Palatine I bodywork in 2009 File:Southern Vectis 643 K743 ODL 2.JPG|Open top Southern Vectis 'Island Breezer' Leyland Olympian with Northern Counties Palatine I bodywork in 2009 File:Bryans of Enfield NV44 N544 LHG.jpg|Ex-London Central Volvo Olympian with Northern Counties Palatine I bodywork with double doors (doors in the middle) in 2012 == Northern Counties Palatine II == The Northern Counties Palatine II was a double-decker body of a bus. It had a step-entrance. It was built from 1993 to 1999 by Northern Counties. From 1993 to 1999, Northern Counties made the same body of a bus but called it the Countybus The Palatine II body was built on the following chassis: * Leyland Olympian chassis * Volvo Olympian chassis * DAF DB250 chassis * Dennis Arrow chassis === Orders === ==== London ==== Capital Citybus ordered one Leyland Olympian with Palatine II bodywork and they ordered some Volvo Olympians and Dennis Arrow's with Palatine II bodies. In 1996, CentreWest Buses ordered 15 Volvo Olympians with Palatine II bodies. In 1996, The Cowie Group ordered 13 DAF DB250s with Palatine II bodies in January. London General, Armchair Passenger Transport, Harris Bus and London Suburban ordered Palatine II bodies. ==== United Kingdom ==== In 1996, MTL Trust Holdings ordered 36 Palatines. In 1998 they ordered 22 Palatine II bodies. In 1994, Northumbria Motor Services ordered eight Palatine II bodies. In 1995, East Yorkshire Motor Services ordered six Palatines II bodies. Eastbourne Buses ordered one DAF DB250 with Palatine II bodywork. === Gallery === File:Long Rock 2019 - First 34137 (L637SEU).JPG|First Kernow 'Atlantic Coaster' Volvo Olympian with Northern Counties Palatine II bodywork in 2019 File:Southern Vectis 614 N14 WAL.JPG|Southern Vectis 'Island Breezer' DAF DB250 with Northern Counties Palatine II bodywork in 2009 File:First Manchester Dennis Arrow P407 PLE.jpg|First Manchester Dennis Arrow with Northern Counties Palatine II bodywork in 2011 File:Southern Vectis 4862 R362 LGH at Newport Quay 2016.jpg|Ex-London General Volvo Olympian with Northern Counties Palatine II bodywork with double doors (doors in the middle) in in 2016 ==Exports== From 1996 to 1998, Northern Counties made 3-axle Palatines for Hong Kong, they were badged as Plaxtons. Citybus ordered 55 3-axle Volvo Olympians with Northern Counties bodywork, The front of the buses were the same as the Alexander RH bus bodies. Kowloon-Canton Railway Corporation ordered 15 3-axle Palatines. The front of the buses were the same as the Alexander RH bus bodies. Hong Kong Air Cargo Terminals Limited ordered two 3-axle Volvo Olympians with Northern Counties bodywork. === Gallery === File:CTB 609 - Flickr - megabus13601.jpg|Citybus Hong Kong Volvo Olympian with Northern Counties Palatine I bodywork in Hong Kong in 2006 File:(VA66) HP7107 on 680X (21722854430).jpg|New World First Bus Volvo Olympian with Northern Counties Palatine I bodywork, showing the Plaxton logo in 2013 File:MTR 228 (5646486452).jpg|Kowloon-Canton Railway Corporation (KCRC) Volvo Olympian with Northern Counties Palatine I bodywork in 2008 File:493 CTB 107(Back side) 23-04-2006.jpg|Citybus Hong Kong Volvo Olympian with Northern Counties Palatine I bodywork rear in 2006 ==References== ==Other websites== Palatine Category:Double-decker buses",
 "title": "Northern Counties Palatine"
}