{
 "id": "115393",
 "text": "Gothic Revival architecture is architecture that has been made to look as if it is from medieval times, but is really much later. This architectural style began in the late 1740s in England.Aldrich, Megan 2005. Gothic Revival. London: Phaidon Press. ISBN 978-0-714-83631-7 Its momentum grew in the early 19th century. Serious and learned admirers of neo-Gothic styles sought to revive medieval Gothic architecture.Clark, Kenneth 1983. The Gothic Revival: an essay in the history of taste. London: John Murray. ISBN 978-0-719-53102-6 The Gothic style of architecture was built in Europe between about 1140 and about 1550. Beginning in late 18th century Europe, through the 19th century and into the early 20th century in Europe and elsewhere there was a fashion to build in the Gothic style. In this period architects and their patrons had various different styles to choose from. There were also revivals of Classical and Renaissance styles. Since medieval Gothic buildings vary so much, some architects often copied selectively from medieval buildings and some adapted the style to the needs of their own period. The \"Gothic Revival\" style was most commonly used for churches,Stamp, Gavin 1995. The Victorian kirk: Presbyterian architecture in nineteenth century Scotland. in C. Brooks (ed) The Victorian Church: architecture and society. Manchester: Manchester University Press. ISBN 0-7190-4020-5. cathedrals, universities, town halls and sometimes houses. Gothic Revival buildings have features that are like real Gothic buildings. They often have: * Pointed arches round the doors and windows * Arched stoned roofs called \"vaults\" * Towers and sometimes also spires on top of towers * Many stone-carvings around the doors and fireplaces * Stained glass windows == Famous Gothic Revival examples == * Strawberry Hill at Twickenham, near London, was one of the first houses designed in the Gothic Revival style. * The Houses of Parliament, London * Sydney University * São Paulo Cathedral, Brazil * The campus of Yale University and the University of Chicago == References == Category:Architectural styles",
 "title": "Gothic Revival architecture"
}