{
 "id": "1153508",
 "text": "Amoghavarsha I of Rashtrakuta Empire raided the North Eastern India ruled by the Palas at that time, he was successful in defeating the Pala rulers i.e successfully raiding and devastating their territories. ==Raid== Around 866 A.D., after 860 A.D. (the year of the Konnur inscription), Amoghavarsha, the Rashtrakuta king, raided northeastern India. This happened shortly after the death of Devpala, a Pala king. At that time, three Pala provinces—Anga, Vanga, and Magadha—were broken up, which meant they no longer matched Amoghavarsha's rule. Vigrahapala-I and Surapala were two Pala kings who ruled different parts of the empire at the same time. Surapala was likely a weak ruler, as no military actions are mentioned in his records, only religious sacrifices. He might have been defeated by Amoghavarsha and later overthrown by Vigrahapla I. Vigrahapala I was probably the king of Anga. He faced defeat from the Rashtrakutas around 865 A.D. and then stepped down, handing over the throne to his son Narayanapala. Dr. H.C. Ray suggested that even though Vigrahapala I might have been peaceful like the ancient king Bimbisara's son Ajatasatru, it doesn't mean he didn't show respect to Amoghavarsha. ==Result== *According to some Pala inscriptions, Narayanapala defeated a Dravidian king who tends to be Amoghavarsha of the Rashtrakuta Empire. According to Historian AS Atllekar there were Indecisive skirmishes between Pala Empire and Rashtrakuta Empire. Both sides claim victory over each other. *According to Historian Bindeshwari Prasad, Rashtrakuta Ruler Amoghavarsha Successfully raided North Eastern India defeating Vigrahapala I and Sarupala (According to some scholars Sarupala is none other than Narayanapala) the contemporary Ruler of Pala Empire. Dr.HC Raya mentions the same. *According Sailendra Nath Sen Amoghavarsha of Rashtrakuta Empire successfully defeated Narayanapala of Pala Empire. * R.C Majumdar also states that Narayanapala of Pala Empire was defeated by Amoghavarsha of Rashtrakuta Empire. == References == Category:India",
 "title": "Amoghavarsha Conflicts with Palas"
}