{
 "id": "1153553",
 "text": "Ameerega yoshina is a frog. It lives in Peru. ==Body== The adult frog is 26 - 35 mm long from nose to rear end. This frog has small front feet for a frog its side. There are yellow stripes from the eyes to the rear end. Other than that, these frogs can be different colors depending on where they live. Frogs that live near Contamana have brick-red or orange backs and green-gold or yellow-green bellies. Frogs from Callanayacu can have orange or red backs but are usually orange and they have blue bellies with black marks on them. In both groups of frogs, the legs can be black, light olive green, or any color in between. ==Name== Scientists named this frog yoshina for the word yoshin, which means \"evil spirit\" in the Panoan language. They named it this because the frog is hard to see and because its voice sounds strange. ==Home== People have seen this frog in two places, one in Serranía de Contamana and the other in Cordillera Azul. It lives in forests that human beings have not changed. People have seen it near streams. People see the adult frogs under logs or under dead leaves on the ground. Scientists saw the frog between 230 and 600 meters above sea level. The frog lives in at least one protected park, Cordillera Azul National Park. It also lives just outside Sierra del Divisor National Park. ==Young== The male frog sits on the dead leaves on the ground and calls to the female frogs. The tadpoles swim in pools of water that are not deep and are in the forest. ==Danger== Scientists say this frog is in danger of dying out. People change the places where the frog lives, especially near Río Huallaga. People cut down forests to make farms, for example palm oil, coffee, and banana farms. In Seirra del Divisor, people change the places the frog lives by building roads, building pipes to move oil, digging good rocks out of the ground and digging oil out of the ground. People also come into the forest to get wood to build with but this is against the law. ==First paper== * ==References== Category:Frogs of South America Category:Poison dart frogs",
 "title": "Ameerega yoshina"
}