{
 "id": "1154600",
 "text": "Linguistic relativity (also called the Sapir-Whorf Hypothesis) is a term used by linguists to describe the way that language influences thought. According to linguistic relativity, the language that you know affects the way you think. There are many languages in the world and each one uses different words. This means that people who speak different languages use different words and concepts to think about the world around them. Because of this people think differently from those who speak different languages. == History == Linguistic relativity is based on the work of two linguists named Edward Sapir and Benjamin Whorf. Edward Sapir was a German anthropologist and linguist who worked with Franz Boas. While Sapir was working with Boas he became interested in the connection between language, culture and thought. Jakobson, Roman; Boas, Franz (1944). \"Franz Boas' Approach to Language\". International Journal of American Linguistics. 10 (4): 188–195. doi:10.1086/463841. S2CID 144088089. Sapir studied North American indigenous languages. With Boas, Sapir used comparative linguistics (a type of linguistics that focuses on comparing different languages). He helped prove that indigenous languages were not primitive compared to European languages. Boas published an academic article titled “On Alternating Sounds” in 1889 based on this research.Boas, Franz. 1889. “On Alternating Sounds.” American Anthropologist 2(1): 47–54. http://www.jstor.org/stable/658803. “On Alternating Sounds” became very important to linguistics, especially phonology. Benjamin Whorf was a student of Edward Sapir. He studied the language of the Hopi, a tribe of Native Americans from northwest Arizona. Whorf added to and proposed the Sapir-Whorf Hypothesis based on the connection between language, culture, and thought that Sapir had researched. == Examples == The Himba are a tribe of people from South Africa. The language that the Himba speak does not have a word for the color blue. As part of a study, linguists showed a group of Himba many different colors. The Himba people told the linguists that the color called “blue” in English is a shade of green in their language. The color did not change, but in one language it is called blue and in another it is called green. This means that people who speak English see the sky and think “the sky is blue”. People who speak the Himba language see the sky and think “the sky is green”. Both of the people are correct.Levinson, Stephen C. 1998. “Studying Spatial Conceptualization Across Cultures: Anthropology and Cognitive Science.” Ethos 26 (1): 7–24. In Guugu Yimithirr, a language spoken by an indigenous tribe of Australia, compass directions like North, South, East, and West are used instead of Left, Right, in front of, or behind . A linguist named John Haviland found that people who speak Guugu Yimithirr are able to know which direction they are facing without a compass. People who speak English were not able to tell whether they were facing north, south, east, or west.Haviland, John B. 1998. “Guugu Yimithirr Cardinal Directions.” Ethos 26 (1): 25–47. == References == Category:Pages created with the Article Wizard from 2024 Category:Linguistics",
 "title": "Linguistic relativity"
}