{
 "id": "1154271",
 "text": "Video nasty is a word to describe movies that contained violent content and were criticized by people for it. The word \"video nasty\" became popular after the National Viewers' and listeners' Association used it. Video nasties are typically horror movies. These movies' releases were not rated by the British Board of Film Classification. Video nasties were allowed to be sold in shops. This made many parents worry that children may be able to view these films. Mary Whitehouse made a campaign against these movies. People selling these movies started to be punished by the law. The Director of Public Prosecutions made a list of 72 movies that contained content that went against the rules of the Obscene Publications Act 1959. Some of the movies in the list had earlier been considered to not be breaking the obscenity law or already had been rated and approved by the BBFC. A second list was made that included 82 movies. These didn't break any laws. However the movies in the second list could still be confiscated. Because of the confusion people had about what made a movie \"Obscene\", Parliament created a new law; Video Recordings Act 1984. This law made it so that any videos released had to get a certification from the BBFC The law made censorship on videos stricter then on cinema. Many movie studios had their videos banned. Recently, videos have been allowed to have content that was banned. Many of the films considered video nasties are now allowed to be sold. Some of the videos contain all the same content. Some videos had to cut out certain content to be sold. == Obscenity and video == When home video recorders were first sold, there were no laws for videos except the Obscene Publications Act 1959. This law had been changed in 1977 to cover sexual films. Popular film distributors were worried about selling videos. They feared people would pirate their films. Lots of low budget horror films were sold during this time. Some of the movies sold were passed by the British Board of Film Censors. Some movies were not. The movies that weren't accepted couldn't be shown. The Obscene Publications Act defined obscenity as that which may \"tend to deprave and corrupt persons who are likely, having regard to all relevant circumstances, to read, see or hear the matter contained or embodied in it\". However, many people are confused by the meaning. Many people do not know what is and what isn't obscene. If the Director of Public Prosecutions thought a movie broke the law, they could prosecute the people who made it. The act said that cops could take away videos from sellers if they thought the movie broke rules. In the early 1980s, the amount of cops searching video stores increased. The movies they took seemed to be random. They took movies which didn't break rules. For example, they took the musical The Best Little Whorehouse in Texas because they thought it was a porn film. The Video Retailers Association asked the DPP to make guidelines so sellers could know what was allowed and what wasn't allowed. The DPP understood their issues and created a list of movies. This list became known as \"video nasties\". == DPP list == The first list was made public in June 1983. The list was modified monthly. 72 movies had appeared on the list. Some of these movies may have been removed later. 39 movies were prosecuted. However, some of them were allowed to be sold after being edited. === Section 1: Prosecuted films === # Absurd (original title: Rosso Sangue, also known as Monster Hunter, Anthropophagus 2, and Horrible) – Originally passed with cuts for cinema. Released uncut in 2017. The film is classified at 18. # Anthropophagous: The Beast (original title: Antropophagus, also known as Anthropophagous, Antropofago, The Grim Reaper, Man Beast, Man-Eater, and The Savage Island) – Released with approximately 8 minutes of pre-edits as The Grim Reaper in 2002. Complete version passed uncut in June 2015. # Axe (also known as Lisa, Lisa and California Axe Massacre) – Originally passed with cuts for cinema. Released with 19 seconds cut in 1999. Released uncut in 2005 with an 18 certificate. # A Bay of Blood (original title: Reazione a Catena, also known as Twitch of the Death Nerve, Blood Bath and Bay of Blood) – Originally refused a cinema certificate in 1972. Released with 43 seconds cut in 1994. Re-released uncut in 2010. # The Beast in Heat (original title: La Bestia in Calore, also known as SS Hell Camp) – No UK re-release. # Blood Feast – Released with 23 seconds cut in 2001. Re-released uncut in 2005. The Best UK Video Nasties Of All Time – Flickering Myth # Blood Rites (also known as The Ghastly Ones) – No UK re-release. # Bloody Moon (original title: Die Säge des Todes) – Originally passed with cuts for cinema. Released with 1 minute 20 seconds cut in 1993. Released uncut November 2008. # The Burning – Originally passed with cuts for cinema. Released with 19 seconds cut in 1992. Re-released uncut in 2001. # Cannibal Apocalypse (original title: Apocalypse Domani, also known as Invasion of the Flesh Hunters) – Released with 2 seconds of animal cruelty cut in 2005. # Cannibal Ferox (also known as Make Them Die Slowly) – Released with approximately 6 minutes of pre-cuts plus an additional 6 seconds cut to a scene of animal cruelty in 2000. Re-released with 1 minute 55 seconds of animal cruelty cuts in 2018. # Cannibal Holocaust – Released in 2001 with 5 minutes 44 seconds cut to remove most animal cruelty and rape scenes. Re- released with 15 seconds cut to one animal cruelty scene in 2011. # The Cannibal Man (original title: La Semana del Asesino) – Released with 3 seconds cut in 1993. # Devil Hunter (original title: El Canibal) – Released uncut in November 2008. # Don't Go in the Woods – Released uncut in 2007 with a 15 rating. # The Driller Killer – Released with 54 seconds of pre-cuts in 1999. Re-released uncut in 2002. # Evilspeak – Released with 3 minutes 34 seconds cut in 1987. Re-released uncut in 2004. # Exposé (also known as House on Straw Hill) – Originally passed with cuts for cinema. Released with 51 seconds cut in 1997. # Faces of Death – Released with 2 minutes 19 seconds cut to animal cruelty in 2003. # Fight for Your Life – Originally refused a cinema certificate in 1981. No UK re-release. # Flesh for Frankenstein (also known as Andy Warhol's Frankenstein) – Originally passed with cuts for cinema. Released with 56 seconds cut in 1996. Released uncut in 2006. # Forest of Fear (also known as Toxic Zombies and Bloodeaters) – No UK re-release. # Gestapo's Last Orgy (original title: L'ultima orgia del III Reich, also known as Last Orgy of the Third Reich and Caligula Reincarnated As Hitler) – Refused a video certificate in 2021. # The House by the Cemetery (original title: Quella villa accanto al cimitero) – Originally passed with cuts for cinema. Released with over 4 minutes cut in 1988. Re-released with 33 seconds cut in 2001. Released uncut in 2009. # The House on the Edge of the Park (original title: La casa sperduta nel parco) – Originally refused a cinema certificate in 1981. Released with 11 minutes 43 seconds cut in 2002, and re-released with 42 seconds cut in 2011. Passed uncut in May 2022. # I Spit on Your Grave (also known as Day of the Woman) – Released with 7 minutes 2 seconds cut in 2001. Re-released in a longer re-edited format in 2003 which reframed the rape scenes but was cut by 43 seconds to the second rape scene by the BBFC. The original print was released again with 3 minutes cut in 2010, and the film again received 1 minute 41 seconds of cuts for the 2020 Blu-ray release. # Island of Death (original title: Ta Pedhia tou dhiavolou, also known as Devils in Mykonos and A Craving For Lust) – Originally passed with cuts for cinema. Refused a video certificate in 1987 under the title Psychic Killer II. Re- released with 4 minutes 9 seconds cut in 2002. Released uncut September 2010. # The Last House on the Left – Originally refused a cinema certificate in 1974 and again in 2000. Also refused a video certificate in 2001. Passed with 31 seconds cut in 2002. Released uncut on 17 March 2008. # Love Camp 7 – Refused a video certificate in 2002. Refused a certificate for streaming in 2020. # Madhouse (also known as There Was a Little Girl) – Released uncut in 2004. # Mardi Gras Massacre – Passed uncut in March 2022. # Nightmares in a Damaged Brain (also known as Nightmare) – Originally passed with cuts for cinema. Released with approximately 3 minutes of pre-edits in 2005. Re-released uncut in November 2015. # Night of the Bloody Apes (original title: La Horripilante bestia humana) – Originally passed with cuts for cinema. Released with approximately 3 minutes of pre-cuts in 1999. Re-released uncut in 2002. # Night of the Demon – Released with 1 minute 41 seconds cut in 1994. Released uncut in 2022. # Snuff – Passed uncut in 2003 but no UK release to date. # SS Experiment Camp (original title: Lager SSadis Kastrat Kommandantur, also known as SS Experiment Love Camp) – Released uncut in 2005. # Tenebrae (original title: Tenebre, also known as Unsane) – Originally passed with cuts for cinema. Released with 5 seconds cut in 1999. Re-released uncut in 2003. # The Werewolf and the Yeti (original title: La Maldicion de la Bestia, also known as Night of the Howling Beast) – No UK re-release. # Zombie Flesh Eaters (also known as Zombie and Zombi 2) – Originally passed with cuts for cinema. Released with 1 minute 46 seconds cut in 1992. Re-released with 23 seconds cut in 1999. Released uncut in 2005. === Section 2: Non Prosecuted films === # The Beyond (original title: E Tu Vivrai Nel Terrore ‒ L'Aldilà, also known as Seven Doors of Death) — Originally passed with cuts for cinema. Released with approximately 2 minutes cut in 1987. Re-released uncut in 2001. # The Bogey Man (also known as The Boogeyman) ‒ Originally passed uncut for cinema. Released with 44 seconds cut in 1992. Re-released uncut in 2000. # Cannibal Terror (original title: Terreur Cannibale) ‒ Released uncut in 2003. # Contamination ‒ Released uncut in 2004 with a 15 rating. # Dead & Buried ‒ Originally passed uncut for cinema. Released with 30 seconds cut in 1990. Re- released uncut in 1999. # Death Trap (also known as Eaten Alive and Starlight Slaughter) ‒ Originally passed with cuts for cinema. Released with 25 seconds cut in 1992. Re-released uncut in 2000. # Deep River Savages (original title: Il paese del sesso selvaggio, also known as Man From Deep River) ‒ Originally refused a cinema certificate in 1975. Eventually released with 3 minutes 45 seconds of animal cruelty cuts in 2003, and re-released with 3 minutes of similar cuts in 2016. # Delirium (also known as Psycho Puppet) ‒ Released with 16 seconds cut in 1987. Released uncut in February 2022. # Don't Go in the House ‒ Originally passed with cuts for cinema. Released with 3 minutes 7 seconds cut in 1987. Re-released uncut in December 2011. # Don't Go Near the Park ‒ Released uncut in 2006. # Don't Look in the Basement (also known as The Forgotten) ‒ Originally passed with cuts for cinema. Released uncut in 2005 with a 15 rating. # The Evil Dead ‒ Originally passed with cuts for cinema. Released with approximately 2 minutes cut in 1990. Re-released uncut in 2001. # Frozen Scream ‒ No UK re-release. # The Funhouse ‒ Originally passed uncut for cinema. Released uncut in 1987. Re-classified 15 in 2007. # Human Experiments ‒ Originally passed uncut for cinema. No UK re-release. # I Miss You, Hugs and Kisses (also known as Drop Dead Dearest) ‒ Released with 1 minute 6 seconds cut in 1986. # Inferno ‒ Originally passed with cuts for cinema. Released with 20 seconds cut in 1993. Re-released uncut in September 2010. # Killer Nun (original title: Suor Omicidi) ‒ Released with 13 seconds cut in 1993. Re-released uncut in 2006. # Late Night Trains (original title: L'ultimo treno della notte, also known as Night Train Murders) ‒ Originally refused a cinema certificate in 1976. Released uncut in 2008. # The Living Dead at the Manchester Morgue (original title: Non si deve profanare il sonno dei morti, also known as Let Sleeping Corpses Lie and Don't Open the Window) ‒ Originally passed with cuts for cinema. Released with 1 minute 53 seconds cut in 1985. Re-released uncut in 2002. # Nightmare Maker (also known as Night Warning and Butcher, Baker, Nightmare Maker) ‒ Refused a video certificate in 1987 under the title The Evil Protege. Released uncut in 2024 # Possession ‒ Originally passed uncut for cinema. Released uncut in 1999. # Pranks (also known as The Dorm That Dripped Blood and Death Dorm) ‒ Released with 10 seconds cut in 1992. # Prisoner of the Cannibal God (original title: La montagna del dio cannibale, also known as Mountain of the Cannibal God and Slave of the Cannibal God) ‒ Originally passed with cuts for cinema. Released with 2 minutes 6 seconds of animal cruelty cuts in 2001, and re-released with 2 minutes of similar cuts in 2018. # Revenge of the Bogey Man (original title: Boogeyman II) ‒ Released in re-edited form with additional footage in 2003. # The Slayer ‒ Released with 14 seconds cut in 1992. Re-released uncut in 2001. # Terror Eyes (also known as Night School) ‒ Originally passed with cuts for cinema. Released with 1 minute 16 seconds cut in 1987. # The Toolbox Murders ‒ Originally passed with cuts for cinema. Released with 1 minute 46 seconds cut in 2000. Re-released uncut in 2017. # Unhinged ‒ Originally passed uncut for cinema. Released uncut in 2004. # Visiting Hours ‒ Originally passed with cuts for cinema. Released with approximately 1 minute cut in 1986. Passed uncut in 2017. # The Witch Who Came From the Sea ‒ Released uncut in 2006. # Women Behind Bars (original title: Des diamants pour l'enfer) ‒ Passed uncut in 2017. # Zombie Creeping Flesh (also known as Hell of the Living Dead, Night of the Zombies and Virus) ‒ Originally passed uncut for cinema in an edited version. Full version released uncut in 2002. === Section 3: Video Nasties === These movies couldn't be prosecuted, but could still be taken by cops and could be destroyed. # Abducted (a.k.a. Schoolgirls in Chains) – No UK re- release. # The Aftermath (a.k.a. Zombie Aftermath) – Passed without cuts in 1988 on the Goldcrest video label. # The Black Room – Originally passed uncut for cinema. No UK re-release. # Blood Lust (a.k.a. Mosquito the Rapist) – Passed with heavy cuts for cinema. No UK re-release. # Blood Song – Re- released as Dream Slayer. # Blue Eyes of the Broken Doll – No UK re-release. # Brutes and Savages – No UK re-release. # Cannibal (a.k.a. Ultimo Mondo Cannibale and Last Cannibal World) – Originally passed with heavy cuts for cinema. Released with 2m 46s of cuts in 2003. # Cannibal World (a.k.a. Mondo Cannibale and The Cannibals) – No UK re-release. # The Chant of Jimmie Blacksmith – Passed uncut for cinema in 1978. Released without cuts in 1987. # The Child – Passed uncut for cinema. Released uncut in 2006. # Christmas Evil (a.k.a. You Better Watch Out) – Released uncut in 2012 with a 15 rating. # Communion (a.k.a. Alice Sweet Alice) – Passed uncut for cinema. Passed with 8s of cuts in 1998. Released uncut in 2014. # Dawn of the Dead – Originally passed with heavy cuts for cinema. Passed with cuts for video in 1989 and 1997. Released uncut in 2003. # Dawn of the Mummy – Passed with 27s of cuts for cinema. Passed with 1m 43s of cuts for video in 1987. Released uncut in 2003. # Dead Kids (a.k.a. Strange Behavior) – Passed with 27s of cuts in 1993 and 2008. # Death Weekend (a.k.a. The House by the Lake) – Passed with cuts for cinema. No UK re-release. # Deep Red (a.k.a. Profondo Rosso) – Passed with 11s of cuts in 1993. The extended version was passed uncut in 2010. # Demented – Released with 1m 19s of cuts in 1987. # The Demons (a.k.a. Les Démons) – A composite version was passed uncut in 2008 and the original version was passed uncut in 2017. # Don't Answer the Phone – Passed with cuts for cinema. An edited version was released without further cuts in 2005. # Eaten Alive! – Passed with heavy cuts for cinema. Passed with heavy cuts for animal cruelty in 1987 and 1992. # Enter the Devil (a.k.a. Disciples Of Death) – No UK re- release. # The Erotic Rites of Frankenstein – Released uncut in the U.K. on 22nd Jan, 2018, with an \"18\" certificate. # The Evil – No UK re-release. # The Executioner (a.k.a. Massacre Mafia Style) – No UK re-release. # Final Exam – Released uncut in 1986. # Foxy Brown – Passed in edited form for cinema. Passed with 2m 48s of cuts in 1987. Released with previous cuts waived in 1998. # Friday the 13th – The R-rated version was released without cuts in 1987. The full unrated version (previously released for cinema) was released uncut in 2003. # Friday the 13th Part 2 – The R-rated version was passed uncut in 1987. Downgraded to an uncut 15 certificate in 2008. # GBH (a.k.a. Grievous Bodily Harm) – No UK re-release. # Graduation Day – Passed uncut in 1986. Downgraded to an uncut 15 certificate in 2003. # Happy Birthday to Me – Passed uncut for cinema. Also passed uncut for video in 1986. Downgraded to an uncut 15 certificate in 2004. # The Headless Eyes – No UK re-release. # Hell Prison (a.k.a. Escape from Hell) – No UK re-release. # The Hills Have Eyes – Passed with cuts for cinema. Passed with 2s of cuts for video in 1987. Released uncut in 2003. # Home Sweet Home – Released uncut in 2004. # Honeymoon Horror – No UK re-release. # Inseminoid – Passed uncut for cinema. Also passed uncut for video in 1987. Downgraded to a 15 certificate in 2005. # Invasion of the Blood Farmers – No UK re-release. # The Killing Hour (a.k.a. The Clairvoyant) – Originally passed uncut for cinema. Passed with 1m 19s of cuts in 1986. # The Last Horror Film (a.k.a. Fanatic) – Passed with cuts for cinema. An edited version was released in 2003. # The Last Hunter – Passed uncut for cinema. Passed with 8s of cuts in 1988. Released uncut in 2002. # The Love Butcher – No UK re-release. # Mad Foxes – No UK re-release. # Mark of the Devil – Passed with heavy cuts for cinema. Passed with cuts in 1998 and 2003. Released uncut in 2013. # Martin – Passed uncut for cinema. Also passed uncut for video in 1994. # Massacre Mansion (a.k.a. Mansion of the Doomed) – Passed uncut for cinema. Also passed uncut for video in 1992. Downgraded to an uncut 15 certificate in 2000. # Mausoleum – Released uncut in 1987. # Midnight – Passed uncut for cinema. An edited version was released in 1993. Full version passed uncut in 2011. # Naked Fist (a.k.a. Firecracker) – Passed with 3m 53s of cuts for cinema. No UK re-release. # The Nesting – Passed uncut in 1986. # The New Adventures of Snow White (a.k.a. Grimm Fairy Tales for Adults) – No UK re- release. # Nightbeast – Passed uncut in 1996. # Night of the Living Dead – Passed with cuts for cinema. Released uncut in 1987. Downgraded to a 15 certificate in 2007. Now in the public domain. # Nightmare City (a.k.a. City of the Walking Dead) – Passed with 3m 5s of cuts in 1986. Released uncut in 2003. # Oasis of the Zombies – Passed uncut in 2004 with a 15 certificate. # Parasite – Passed uncut for cinema. Also passed uncut for video in 1993. # Phantasm – Passed uncut for cinema. Also passed uncut for video in 1989. Downgraded to a 15 certificate in 2005. # Pigs (a.k.a. Daddy's Deadly Darling) – Released by 88 Films in 2016. Unknown if cut. # Prey – Passed with 11s of cuts for cinema and video. A print shortened for dialogue was passed uncut in 2004. # Prom Night – Passed uncut for cinema. Also passed uncut for video in 1987. # Rabid – Passed uncut for cinema. Also passed uncut for video in 1992. # Rosemary's Killer (a.k.a. The Prowler) – Passed with cuts for cinema. Released uncut in 2007. # Savage Terror (a.k.a. Primitives) – No UK re- release. # Scanners – Passed uncut for cinema. Also passed uncut for video in 1987. # Scream for Vengeance! – No UK re-release. # Shogun Assassin – Passed with cuts for cinema. Released uncut in 1999. # Street Killers (a.k.a. Beast with a Gun) – No UK re-release. # Suicide Cult (a.k.a. The Astrologer) – No UK re-release. # Superstition (a.k.a. The Witch) – Passed uncut for cinema. Also passed uncut for video in 1986. # Suspiria – Passed with cuts for cinema. Released uncut in 1998. # Terror – Passed with cuts for cinema. Released uncut in 1997. # The Texas Chain Saw Massacre — Refused a cinema certificate in 1975. Passed uncut in 1999. # The Thing – Passed uncut for cinema. Also passed uncut for video in 1987. # Tomb of the Living Dead (a.k.a. Mad Doctor of Blood Island) – Passed with cuts for cinema. Released with 42s of animal cruelty cuts in 2003. # The Toy Box – No UK re-release. # Werewolf Woman – Passed with cuts for cinema. No UK re-release. # Wrong Way – No UK re-release. # Xtro – Passed uncut for cinema. Also passed uncut for video in 1987. Downgraded to an uncut 15 certificate in 2007. # Zombie Holocaust – Passed uncut in 2000. # Zombie Lake – Passed uncut in 2004. ==References== Category:Movie ratings",
 "title": "Video nasty"
}