{
 "id": "1154796",
 "text": "The Roman Catholic Diocese of Cochin is a diocese located in the city of Cochin in the Ecclesiastical province of Verapoly in India. The Roman Catholic Diocese of Cochin is a diocese located in the city of Cochin in the Ecclesiastical province of Verapoly in India. The territory of the diocese of Cochin covers 235 square kilometers in the state of Kerala. It is situated between the Arabian Sea in the west, the Archdiocese of Verapoly in the north and in the east, and the Diocese of Alleppey in the south. The Diocese's Cathedral church and thus, seat of its Bishop, is Santa Cruz Basilica, Fort Cochin. The current Bishop of Cochin is Bishop Joseph Kariyil, appointed by Pope Benedict XVI on May 8, 2009. Historical Summary The Diocese of Cochin, now diminutive in size due to successive bifurcations in the course of time, once used to be the Mother Diocese of many a bishopric in the Sub-continent. The erstwhile Mother Diocese extended in the west coast from Malabar, down south to Cape Comorin (the present Kanya Kumari and still further down, Ceylon (now, Sri Lanka) and stretched along the east coast all the way up, encompassing Nepal, Bangladesh and beyond Burma (now, Myanmar) and still further east to Hong Kong, Malacca and Macau. The Bishop's House, Fort Cochin == History == The chief religions professed in Malabar at the arrival of the Portuguese were: Hinduism, Christianity (the Christians of St. Thomas or Nestorians), Islam, and Judaism, the last represented by a large colony of Jews. From these the Catholic community was recruited, mostly from the Nestorians and the Hindus. Islam also contributed a fair share, especially when Portugal was supreme on this coast; among the Jews conversions were rare. To Portugal belongs the glory of having begun regular Catholic missionary work in India, and Cochin has the honour of being the cradle of Catholicism in India. The first missionaries to India were eight Franciscan friars, who set sail from Lisbon on the fleet of Pedro Alvarez Cabral, 9 March, 1500: Father Henrique de Coimbra, Superior; Fathers Gaspar, Francisco da Cruz, Simao de Guimaraens, Luiz do Salvador, Masseu, Pedro Netto, and Brother João da Vitoria. Three of them were slain at Calicut in the massacre of 16 November, 1500. The survivors arrived at Cochin on or about the 26th of that month, and settled there (except the superior, who went back with the fleet to obtain more help for the mission), thus laying the foundation of the Diocese of Cochin (Histor. Seraf. Chron. da Ordem de S. Francisco na Provincia de Portugal, III, 489, 494, 495). They were followed by large contingents of zealous missionaries, who worked from the city of Cochin as a centre. The harvest of souls was rich, the Christians multiplied along the coast and in the interior, and in course of time a bishop was assigned to them The Nestorian Christians in the vicinity of Cochin naturally attracted the attention of the missionaries, and Fathers Simao de Guimaraens and Luiz do Salvador were soon occupied in refuting their errors and reforming their discipline and customs (Hist. Seraf., III, 497). These two missionaries were the pioneers of the Faith among the Nestorian Christians. Members of the same order continued this missionary work till the middle of the sixteenth century, when these missions were handed over to the Jesuits, who continued the good work with such earnestness and zeal that most of the Nestorian Christians were converted before 1600. The chief public record of their conversion is to be found in the Process of the Synod of Diamper (of Udiamperur), held in June, 1599, by Alexio de Menezes, Archbishop of Goa, Metropolitan and Primate of the East (\"Bull. Patron. Por. reg.\", a collection of papal and royal documents pertaining to the Portughese missions in India, App. tom. I, 147 sqq.; see also \"Subsidium ad Bull. Patr. Por.\", Alleppi, 1903). In December, 1502, the Nestorian or Syrian Christians (they used the Syrian language in their liturgy) presented to Vasco da Gama, who had arrived at Cochin, the sceptre of their former kings, and applied to him for assistance against their Mohammedan neighbours. Gama formally accepted the sceptre in the name of the King of Portugal. The Syrian bishop of those Christians promised obedience to the pope through the Franciscan missionaries and two Nestorian priests accompanied Gama to Lisbon en route for Rome. Thus began the protectorate of the Portuguese over the Syrian Christians, a protectorate which lasted for 160 years (cf. João de Barras, \"Asia\", Dec. I, bk. V, ch. viii; also \"Historia Serafica\"). Till 1542 the Franciscans were the only regular missionaries in India, though they had the cooperation of some secular priests, as Father Pedro Gonsalves, Vicar of Santa Cruz church in the city of Cochin, and father Miguel Vaz, a zealous preacher of the Faith, as well as of some isolated members of other religious communities, who had come out as chaplains to the fleets (\"Commentarios do Grande Affonso d'Albuquerque\", 3d ed., 1774, I, ch. v, 19-20), and \"Ethiopia Oriental\", II, bk. II, ch. i). Among the pioneer priests of Cochin mention should be made of the Franciscans João d'Elvas and Pedro d'Amarante, who till 1507 preached the Gospel at Vypeen, Palliport, Cranganore, and other important places; Father Manuel de S. Mathias with his eleven companions, who laboured for the conversion of the pagans at Porroead, Quilon, Trivellam, and elsewhere. Father Vincent de Lagos, who in 1540 established the college of Cranganore to train the Nestorian Christians in the purity of Catholic Faith, a college highly praised by St. Francis Xavier, and the first built in India. In 1542 it had eighty students (Amado, Hist. da Egreja em Portugal e colonias, Vol. VII, pt. II, 117-21). After St. Francis Xavier's arrival in India, 6 May, 1542, the Society of Jesus quickly spread over India, and the members were always most successful in the missions under their charge. St. Francis often visited Cochin, where the citizens gave him the church of Madre de Deus, and asked him to establish in the city a residence of the Society. It was accordingly founded by Father Balthazar Gago, S.J., in 1550. In the same year Father Nicolao Lancelot, S.J., built the residence and college of Quilon, and Affonso Cipriano, S.J., the residence of Mylapore, soon after the residence and college of Punicail were established, and the residence of Manar. In 1560 the King of Portugal built for the Society of Jesus the college of Cochin, and in 1562 a novitiate of the Society was established there. In 1601 the Jesuit Province of Malabar was founded, and Cochin was made the residence of the provincial. Among the early Jesuits must be mentioned in addition to St. Francis Xavier, foremost of missionaries, Fathers Mansilha, Criminal, B. Nunes, H. Henriques, F. Peres, F. Rodrigues; Brothers Adam Francisco, N. Nunes. Later, the Dominicans, Augustinians, and other orders followed the Society of Jesus to India. The Dominicans built their monastery and college at Cochin in 1553; some years later their example was followed by the Augustinians, and still later by the Capuchins. Cochin thus became the stronghold of the Faith, and it was the missionaries of Cochin who carried the Gospel throughout all Southern India and Ceylon, everywhere establishing missions, and building churches, charitable and educational institutions, all of which were endowed by the kings of Portugal. Apart from the heroic zeal of the priests, the most powerful element in the propagation of the Faith was the protection the Portuguese Government always accorded to the converts. It provided them with good situations, employing them in civil offices, freed them the molestations of their masters, elevated them in the social scale, exempted them from the operation of Hindu law, appointed for them a judicial tribunal composed of Catholics, which in rural districts was presided over by the local priest. It induced the rajahs to treat the converts kindly, and obliged them to allow their converted subjects all the civil rights, e.g. of inheritance, which their Hindu relatives enjoyed. (\"Collecçaode Tractados\", treaties made with the rajahs of Asia and East Africa, passim in the first thirteen vols; also \"Archivo Portuguez Oriental\" Nova Goa, 1861, Fasc. III, parts I and II passim; \"Oriente Conquistado\", Bombay reprint, 1881, I, II, P. Jarric, S.J., \"Thesaurus Rerum Indicarum\", Cologne, 1615, I, III, on the Malabar Missions of the Society.) The above- mentioned Bull of Paul IV, by which the diocese was constituted, raised the collegiate church of the Holy Cross (Santa Cruz), the parish church of Cochin, to the dignity of cathedral of the diocese, and established therein a chapter consisting of five dignitaries and twelve canons. At the same time the pope gave the patronage of the new diocese and see to the kings of Portugal (Bull. Patr. Port. Reg., I, 194). Until 1506 Hindu law, which was rigorously observed, forbade the use of lime and stone in other constructions than temples. Hence the early Portuguese, to avoid displeasing the rajah, built their houses of wood. Finally the viceroy, Francisco de Almeida, induced the Rajah of Cochin to permit him the use of lime and stone, and on 3 May, 1506, the first stone for the fortress and city was laid by the viceroy with great pomp. It was the feast of the Finding of the Holy Cross, which thus became the patronal feast of the city, and gave to the parish church its title. The church of the Holy Cross (Santa Cruz) was begun in, or rather before, 1506, for in 1505 we find Portuguese soldiers contributing towards the construction of the church of Cochin 1000 xerafins (about $150 a large sum four hundred years ago), the result of an auction of the rich booty of a naval combat (Gaspar Correa, \"Lendas da India\", I, 522; II, 182). Some years later this church was raised to collegiate rank, endowed by the king, and provided with a vicar and six beneficed ecclesiastics. It was a magnificent buildings the mother church of the ancient Diocese of Cochin, which the Malabar, Coromandel and Fishery boasts, and Ceylon once obeyed and under whose teaching and discipline they flourished. There are now not less than eleven bishoprics in the territory of the original Diocese of Cochin. The first Bishop of Cochin was Dominican, Father Jorge Tremudo, an illustrious missionary on this coast. The Brief \"Pastoralis officii cura nos admonet\" of Gregory XIII, 13 Dec., 1572, permitted the Bishop of Cochin, on occasion of the vacancy of the See of Goa, to take possession of that see and administer it till the Holy See provided for the vacancy. This is why many bishops of Cochin were appointed archbishops of Goa. In 1577 Brother João Gonsalves, S.J., engraved at Cochin, for the first time, the Malealam type, from which was printed the first Malealam book, \"Outlines of Christian Doctrine\", written in Portuguese by St. Francis Xavier for the use of children. In 1578 Fr. João de Faria, S.J., engraved at Punicail the Tamil type, with which the \"Flos Sanctorum\" was printed in Tamil for the Fishery Coast (Paulinus a S. Bartholomaeo, \"India Orient. Christiana\" Rome, 1794, 179 sqq.; \"Oriente Conquistado\", Vol. I, Pt. I, Cong. I, Div. I, section 23). Cochin was taken, 6 Jan. 1663, by the Dutch, after a siege of six months. The city was reduced in size; the clergy were expelled; the monasteries and colleges, bishop's palace and 2 hospitals, 13 churches and chapels, were razed to the ground. The church of St. Francis of Assisi, belonging to the Franciscan monastery was spared by the conquerors and converted to their religious use. When the English expelled the Dutch, 20 October, 1795, they kept this church for the same purpose; it stands today a witness to the events of the past four centuries, and is considered the oldest existing church in India. The magnificent cathedral was turned by the Dutch into a warehouse for merchandise. In 1806 it was blown up by the English. From 1663 until the diocese was reorganized in 1886, the bishops of Cochin resided at Quilon. In 1896 work was begun on the Cathedral of the Holy Cross of Cochin by Bishop Ferreira amid great sacrifices. In April, 1897, when almost complete, the building collapsed, entailing a heavy loss. Bishop Ferreira died at Goa, 4 May, the same year. Bishop Oliveira Xavier took charge of the diocese in March, 1898, removed the debris of the fallen building and successfully carried the work to completion. The cathedral was opened for Divine Worship, 9 August, 1903. Brother Moscheni, the famous Italian painter of India, belonging to the Jesuit mission of Mangalore, was secured to decorate the church, but hardly finished the sanctuary when he died, 14 November, 1905. The cathedral was consecrated 19 November, 1905, by Bishop Pereira of Damaum, Archbishop ad honorem of Cranganore. == Religious conditions == The Church of Cochin has suffered some rigorous persecutions. The most severe was that of 1780, commenced by Nagam Pillay, Dewan of Travancore, in which 20,000 converts fled to the mountains, to escape his cruelties, and many died as martyrs. Father João Falco S.J., was the only priest left to console the sufferers. There were other less severe persecutions in 1787, 1809, and 1829 (Paulinus a S. Bartholomaeo, \"India Orient. Christiana\", 165 sqq.: also \"Church History of Travancore\", Madras, 1903, Introduction, 55). In a general way there has always been a kind of mild persecution or animosity on the part of Hindu Governments and authorities against Christians. The growth of the Catholic Church is at present affected especially by the \"Law of Disability\" in force in the Native States of Malabar, by which a convert becomes a stranger to his family, and forfeits all rights of inheritance. The government schools, in which the young are reared in religious indifferentism, form also a remarkable hindrance to conversions, especially among the higher classes. == Ordinaries == Sl.no Ordinary Year of appointment Last year of service 1 Dom Giorgio Temudo O.P 1557 1567 2 Dom Henrique De Tavora O.P 1576 1578 3 Dom Antonio De Baja 1578 1578 4 Dom Matheus De Medina O.S.A. 1579 1588 5 Dom Andrea De Sant Maria O.F.M 1588 1610 6 Dom Sebastianos A Santa Pedro O.A. 1615 1624 7 Dom Luiz De Britto A Menezes O.S.A. 1628 1629 8 Dom Francesco Baretto 1630 1630 9 Dom Miguel Da Cruz Rangal O.P 1633 1646 10 Dom Antonio Da Serpa 1647 1647 11 Dom Joao Celo 1650 1650 12 Dom Fabio Dos Reis 1668 1668 13 Dom Fernando Da santa Maria 1672 1672 14 Dom Antonio Da Santo Dionysio O.S.A. 1676 1685 15 Dom Pedro Da Silva O.S.A. 1688 1691 16 Dom Antonio Da Santa Teresa 1692 1692 17 Dom Pedro Pachecco O.P. 1694 1713 18 Dom Francesco Pedro Dos Martyres 1717 1717 19 Dom Francesco De Vasconselo 1722 1742 20 Dom Antonio De Conceisao 1745 1745 21 Dom Clement Jose Colocao Leita S.J 1745 1776 22 Dom Sebastiao Da Costa 1777 1777 23 Dom Manuel De Santa Catherina O.C.D. 1778 1785 24 Dom Jose De Soledad O.C.D. 1785 1818 25 Dom Tomas De Noronha E Britto O.P. 1819 1819 26 Dom Joakim De Santa Rita Boethello 1832 1832 27 Dom Joao Gomez Ferreira 1887 1897 28 Dom Matheas De Oliveiro Xavier 1898 1908 29 Dom Jose Bento Martin Rebeiro 1909 1931 30 Dom Abilio Agusto Vas Das Neves 1934 1939 31 Dom Jose Vieira Alvarnaz 1942 1951 32 Rt. Rev. Dr. Alexander Edezhath 1952 1975 33 Rt. Rev. Dr. Joseph Kureethara 1975 1999 34 Rt. Rev Dr. John Thattumkal 2000 2008 35 Rt. Rev Dr. Joseph Kariyil 2009 2024 == Parishes == The Diocese Of Cochin is blessed with fifty one independent parishes with resident priests under six ecclesiastical districts as follows FIRST DISTRICT – FORT COCHIN FORANE FIRST DISTRICT – FORT COCHIN FORANE FIRST DISTRICT – FORT COCHIN FORANE IMAGE NAME OF THE PARISH YEAR ESTABLISHED Santa Cruz Cathedral Basilica Fort Kochi 1505 Our Lady Of Life Church Mattancherry 9th century Our Lady Of Hope Church Vypeen 1605 SS Peter and Paul Church Amaravathy 1857 Holy Family Church Nazareth 1901 Stella Maris Church Willington Island 1955 St Joseph's Bethlehem Church Chullicakal 1974 St Mary's Church Kochery 2016 SECOND DISTRICT – KANNAMALY FORANE St Antony's Forane Church Kannamaly 1873 St Louis Church Mundamvely 9th century St Sebastian's Church Chellanam 1832 St Joseph's Church Cheriyakadavu 1968 St Francis Assisi Church Kattiparambu 1980 St Thomas Apostle Church Santhome 1990 St John The Baptist Church Anjilithara 2019 THIRD DISTRICT – EDAKOCHI FORANE St Lawrence Church Edacochin 9th century St Sebastian's Church Thoppumpady 1833 Santa Cruz Church Perumpadappu 1965 St Joseph's Church Chirackal 1965 St Mary's Church North Edakochi 1978 St Lawrence Church Palluruthy 1986 St Thomas More Church Palluruthy 1991 St Joseph's Church Maduracompany 2012 Santa Maria Church Perumpadappu 2018 FOURTH DISTRICT – KUMBALANGHI FORANE St George Church Pazhangad 1869 St Peter's Church Kumbalanghi 1875 St Joseph's Church North Kumbalanghi 1967 Immaculate Conception Church Ezhupunna 1977 St Sebastian's Church Neendakara 1977 Sacred Heart Church Kumbalanghi 1994 St Martin De Porres Church Kallencherry 1996 Holy Maris Church Azhikakam 2014 San Jose Church Ettumkal 2014 FIFTH DISTRICT – AROOR FORANE St Augustine's Church Aroor 1901 St Francis Xavier Church Eramallore 1843 St Joseph's Church Kumbalam 1977 St Antony's Church Arookutty 1978 St Joseph's Church Vallethode 1986 Our Lady Of Fatima Church Kodamthuruth St Mary's Church Chandiroor 2004 St Sebastian's Church Karunyapuram 2013 Little Flower Church Perumbalam 2013 St Jude Church Eramallor Queen Of Peace Church Ezhupunna 2024 SIXTH DISTRICT – THANKEY FORANE St Mary's Forane Church Thankey 1832 Our Lady Of Assumption Church Poomkavu 1860 St George Church Arthumkal 1866 St Francis Xavier Church Vayalar 1936 St Sebastian's Church Areeparambu 2016 St George Church Arasupuram 2017 St Antony's Church Pathirapally == References == Cochin",
 "title": "Roman Catholic Diocese of Cochin"
}