{
 "id": "1154128",
 "text": "Marxist archaeology is a way of thinking about archaeology that shows the field’s political impact. Marxist archaeologists take a lot of their ideas from Karl Marx, who wrote about the effects of capitalism on modern society, and other Marxist thinkers. Marxist archaeology has changed over the years. It began in the Soviet Union and was used by the government to help their political goals. Nowadays, Marxist archaeologists want to use archaeology for social justice, to create work that will lead to political change. They also think it is impossible for an archaeologist to not be politically neutral in their work. To them, no explanation of history can be free of someone’s opinions about the world. A lot of ways of thinking and doing archaeology have focused on making broad theories about past human cultures. Marxist archaeology is different because it is about making social issues such as inequality the main focus of the work. ==Main Ideas== Marxist archaeologists think that knowledge comes from social and political history. A person’s thoughts on archaeology are influenced by many things in their culture and personal lives. Marxist archaeologists think that no belief about history is value-free, meaning that it is always influenced by a person’s values. Many Marxist archaeologists also think that it is important to use their work to help social and political movements. A lot are involved in social justice. To Marxist archaeologists, it is important to know history from different perspectives and elevate the voices of groups of people who have been treated unfairly in history. ==History== ===Beginnings in Soviet Union=== The government of the Soviet Union viewed science as a way to progress the country’s economy and fight the religious superstition that had been around during the Russian Empire. Social sciences like archaeology were important in advance the ideas that the Soviet government wanted its citizens to believe in. In 1919, Vladimir Lenin created the Russian Academy for the History of Material Culture (RAIMK) in Petrograd. After the Soviet Union was founded in 1922, RAIMK became the State Academy for the History of Material Culture (GAIMK). GAIMK oversaw all archaeology done in the Soviet Union. A lot of money was put into the advancement of archaeology and many archaeological institutions and museums were established. Lenin introduced the New Economic Policy. Part of this policy was forgiving towards the intelligentsia, educated individuals such as writers, professors, artists, and scientists, many of whom were archaeologists who did not support the Bolshevik Revolution. This angered strict revolutionaries, since the intelligentsia were in control of the production of knowledge as long as they did not oppose the Soviet government. These early Soviet archaeologists made sense of archaeological data using a direct historical approach, which means to make conclusions about past cultures using information on current cultural groups that archaeologists think are closely related. They also thought that theories about change needed to be made using empiricism. These non-Marxist approaches to archaeology made the early Soviet archaeology practice vulnerable to change. ===Archaeology under Stalin=== Vladimir Lenin died in 1924, which led to Joseph Stalin taking control of the government. Stalin reversed the changes made by the New Economic Policy and began the first of the Five-Year Plans. He forced the intelligentsia to follow strict party rule, which was part of his plan to bring all parts of Soviet society in line with Marxism. Many non-Marxist intelligentsia and organizations were purged. From 1930 onward, contact between Soviet and archaeologists from other countries was not allowed. A group of communist students had been established in GAIMK around the time of Stalin’s changes. In 1929, they began to criticize the old archaeologists that did not support Marxism. One of these students was Vladislav Ravdonikas. He became a leader among the new generation of archaeologists in the Soviet Union. Although the Soviet government did not know much about archaeology and how it should look in order to support the state’s goals, they had the power to correct anything they believed did not follow their political messaging. ===Spread to Europe and the U.S.=== Archaeologist Vere Gordon Childe visited the Soviet Union in 1935 and his thoughts on archaeology changed. He disagreed with some of the beliefs of the Soviet archaeologists, but combined parts of Soviet Marxist archaeology with his own beliefs. Childe brought these ideas to a broader audience in western Europe and America. After World War II, Childe began to move away from Soviet archaeology because he began to question the quality of work done under Stalin’s rule. He then returned to reading Marx and his ideas changed again. Marxist archaeology was repressed by the U.S. government because of the Red Scare that was a product of the Cold War. Meanwhile, Marxist ideas were talked about and spread in Europe. Despite the political repression, Marxist archaeologists continued to criticize American anthropology in the 1960s. At the same time, processual archaeology became popular under Lewis Binford, who thought archaeology should embrace the scientific method. Processualism became the main way to think about archaeology, but it had people who disagreed with it. Some of the people who disagreed with processualism were Marxist archaeologists. ===Post- processualism=== British archaeologist Ian Hodder came up with post-processual archaeology in the 1980s in reaction to processualism, structuralism, and Marxism. He believes that making sense of the archaeological record is up to each archaeologist. According to post-processualists, there is no final answer to the questions that archaeologists ask. Instead, there is a cycle of getting a better understanding of an archaeological subject. ===Spread to Latin America=== Archaeology in Latin America had been heavily influenced by American archaeologists. This began to change in the early twentieth century. The countries of Latin America, despite being politically independent, were economically dependent on America and Europe. Reactions to this came in the form of populist nationalist revolutions. Conservative governments took control of the countries in Latin America. This was followed by a wave of Marxist revolutions, starting in 1959 with the Cuban Revolution. The rise of Marxism during this time led to the introduction of Marxist archaeology. By the middle of the 1970s, the revolutions had been put down and leftist intellectuals were punished. ==Marxist Archaeologists== ===Vladislav Ravdonikas=== Vladislav Ravdonikas was a Soviet archaeologist and early Marxist archaeologist. He and his fellow archaeologists wanted to make their archaeological knowledge valuable to the Marxist view of history. They wanted their data to prove patterns of history that are accurate to Marxism. In the 1930s he explored a burial ground on Oleny Island, Karelia, studied rock carvings at Lake Onega and the White Sea and medieval burial mounds near Lake Ladoga, and excavated in Staraya Ladoga, a very old settlement on the Volkhov River. ===Luis Lumbreras=== Luis Guillermo Lumbreras was a very influential Peruvian Marxist archaeologist. He is credited with creating the concept of a distinct Latin American archaeology. He focused on social and political processes, rather than focusing only on remains. He challenged the idea that archaeology is a neutral field and wanted to connect the practice with social and political goals. ===Vere Gordon Childe=== Vere Gordon Childe was important in making Marxist archaeology visible to Western archaeologists. He visited the Soviet Union for the first time in 1935. He was impressed by the government’s generous support for archaeology there. Childe was interested in how Soviet archaeologists explained change in past societies through internal processes and materialism. He did not accept everything that the Soviet archaeologists believed in, so he combined his own experiences and opinions on archaeology with some Marxist archaeological ideas. He focused more on cultural evolution and wanted to correct his belief that the economy was the main cause of cultural change. Childe believed that strict religions and political hierarchies could slow or stop social and economic change. He pointed out the differences between progressive and conservative societies. To Childe , progressive societies have good relationships between the means of production, social institutions, and religion, as opposed to conservative societies, where social and political factors prevent change. He brought these ideas and others to the rest of the field that had been cut off from the Soviet Union. Childe is famous for being important in changing how archaeology was done in American and western Europe and has inspired many archaeologists that came after him. ===Randall McGuire=== Randall McGuire is a very important American Marxist archaeologist. In A Marxist Archaeology he focuses on the importance of considering the politics of archaeology. McGuire considers how knowledge about the world is made and the consequences of making and sharing that knowledge. He also says that Marxism can have many meanings to different thinkers. ==Impact== The Soviet Union’s practice of Marxist archaeology promoted an emphasis on how people in the past lived, which was a big contribution to the rest of archaeology. Soviet Marxist archaeology also encouraged archaeologists to explain changes in the archaeological record as a result of internal social development. Since Soviet archaeologists were interested in social change, they revived interest in the evolution of culture at a time when diffusionism, or the concept of ideas spreading within or between cultures, was more popular in America and Europe. ==References== Category:Archaeology Category:Marxism",
 "title": "Marxist archaeology"
}