{
 "id": "1154769",
 "text": "Escaped Chasm is a free game developed by Temmie Chang, who also designed the art for the game Undertale. As a test project, it was released on April 2, 2019 for free on the website Itch.io. The game is set in an abandoned house and follows an unnamed girl whose parents never come back. Chang used the game as a way to practice using the RPG Maker MV engine. == Gameplay and plot == The player controls an unnamed girl who lives alone in her parents' house. Without her parents, she can freely roam the house and advance through the game by writing down events in a diary. Sleeping lets the player watch a dream and continue to the next day. On the second day, the unnamed girl meets a man with a demonic look named Zera, who warns her that the house is slowly falling into chaos. As time continues, the house falls apart. Zera tells the girl that her parents are gone and offers the opportunity to save them by taking the girl to another world. Despite knowing she will lose memories of her parents, the girl accepts Zera’s offer. == Development and release == Escaped Chasm was Chang's first attempt at using the RPG Maker MV engine. Chang also had some other people help with additional music and sound design, with James Roach providing the supporting music. Her first goal was to build a story-line and practice game development to make better projects in the future. Escaped Chasm was then released on April 2, 2019 for free on Itch.io. On July 10, 2020, Chang released Dweller's Empty Path, an RPG Maker game that takes place within Escaped Chasm universe. == Reception == People liked Escaped Chasm for its animation, visuals, music, and themes. Fraser Brown of PC Gamer called the game \"short but striking\" and noted the graphics as \"lonely and often unsettling\". Rock Paper Shotgun Dominic Tarason called it as heartfelt and liked the odd mixture of red and blue color schemes in one of the game's cutscenes. Tarason said that it made the story feel \"too real and harsh\" and didn't go well with the game's pixel art. Reviewers commended Fox's music and compared the game to Undertale from its similar themes and writing. == References == == Other websites == * on Itch.io Category:2019 video games Category:Adventure games Category:Art games Category:Freeware games Category:Indie video games Category:MacOS games Category:RPG Maker games Category:Single-player video games Category:Video games about dreams Category:Video games developed in the United States Category:Windows games",
 "title": "Escaped Chasm"
}