{
 "id": "1154799",
 "text": "Kazuto Kirigaya (born Kazuto Narusaka) is the main character from the light novel and anime series Sword Art Online. He is also known by his user name Kirito. He was created by Reki Kawahara. Kirito is a teenager and was one of 1,000 people chosen to take part in a closed beta to test the video game Sword Art Online. Kirito is voiced by Yoshitsugu Matsuoka in Japanese and by Bryce Papenbrook in English. Kirito has appeared in many movies and video games for the series. He has also appeared in a crossover episode of the anime Eromanga Sensei with Matsuoka voicing him. ==Biography== Kirito is a teenager. When he was young, his parents died and he was adopted by his aunt and uncle. Growing up, Kirito trained in kendo with his cousin but decided to drop it because he wanted to focus more on computers. He was physically abused by his grandfather for this choice. Kirito would be accepted to become a tester in a closed beta for the first Virtual Reality Massively Multiplayer Online Role-Playing Game (VRMMORPG), Sword Art Online. He was successful in it and was able to make it to the 10th floor in the game before the testing was closed. When the full game was released, Kirito would play it and met a man named Klein who he taught how to fight and survive. The two were teleported to the town square and were told by the Game Master Kayaba Akihiko that Sword Art Online did not have a option to logout. He mentioned that the player would die in real life if they take off their NerveGear VR headset or die in-game. He also said the only way to leave is to beat the game. Kirito would go to a meeting where players were discussing how to defeat the first boss and met a girl named Asuna with whom he formed a two-person party with. Kirito, Asuna, and the rest of the party defeated the boss and Kirito was rewarded with the Cost of Midnight.He then was accused by a member of the party for keeping information from them. Kirito then created and led a group called Beaters, which were a group of former beta play testers. He did this to try and bring peace between the testers and regular players. During the course of their journey together, Kirito and Asuna grew closer and would end up marrying each other. During a raid on a boss, Kirito attacks his party member Heathcliff. It is revealed that Heathcliff was actually the Game Master Akihito Kayaba in disguise. Kayaba challenged Kirito to a one-on-one battle and said that he would safely log everybody out of the game if he won. During their fight, Kirito loses his mind and almost died but is saved by Asuna who sacrifices herself. Kirito then stabs Kayaba with Asuna's sword and wins. Even though most players have been logged out, a certain amount of players including Asuna have not. In the real world, Kazuto goes to visits Asuna in the hospital but finds her still unconscious. Kazuto is told that a character similar to Asuna's was seen in another video game called Alfheim Online. Kazuto enters the game and eventually rescues Asuna and the rest of the trapped players. ==Reception== Since his introduction, Kirito has become a very popular and well liked character. He has often been placed on polls of Best or Most Popular Anime Characters. Kirito and Asuna have also been placed on Best Couple polls. However, Kirito has also been criticised by both critics and fans. Some view Kirito as a Mary Sue character. Kirito's Italian voice actor Alessio De Filippis was nominated for his performance in Sword Art Online Progressive: Scherzo of Deep Night at the 8th Crunchyroll Anime Awards. ==References== Category:Anime characters Category:Fictional characters introduced in the 2000s Category:Fictional Japanese people Category:Fictional orphans",
 "title": "Kirito (Sword Art Online)"
}