{
 "id": "1154367",
 "text": "The Kia Telluride is a mid-size SUV produced by Kia since 2019 it is the largest vehicle kia has produced in the United States the vehicle is positioned above the Kia Sorento. == History and Features == The Kia Telluride made its debut as a production model at the 2019 North American International Auto Show in January 2019. Before this, a unique version of the vehicle was showcased at New York Fashion Week in September 2018, designed in collaboration with fashion designer Brandon Maxwell and reflecting a Texas- themed collection. The Kia Telluride also shares many parts with the Hyundai Palisade the Telluride is also the first Kia made mainly for The American market and was designed at the Kia design Center in irvine, the vehicle is powered by a 3.8-liter Lambda II V6 Atkinson cycle gasoline engine of 291 hp and equipied with a 8 speed automatic transmision and also have front-wheel drive (fwd) or all wheel drive (awd) versions In 2023 it received a facelift the facelift has features such as a 12.3 inch instrument panel with changes on the headlights front grille and front bumper. File:0 Kia Telluride 1.jpg|2023 Kia Telluride == Concept == The Kia Telluride concept was shown at the North American International Auto Show in 2016. It was built using a modified Kia Sorento chassis and had a 3.5-liter V6 engine with 270 horsepower, plus an electric motor with 130 horsepower, giving the concept a total of 400 horsepower. The car had a boxy design and was painted in dark pyrite color. It had 22-inch wheels, a big tiger nose grille, and LED headlights, following Kia's design style of 2016. The concept had suicide doors that opened 90 degrees in opposite directions, Some interior parts were made using 3D printing, which was new for Kia. The concept was designed by Tom Kearns from the Kia Design Center America. == Markets == The Kia Telluride was made mainly for the American market it is also sold in Canada Mexico and Middle East it is not sold in South Korea instead its sister model the Hyundai Palisade is sold there. == References == Telluride Category:Sport utility vehicles",
 "title": "Kia Telluride"
}