{
 "id": "115488",
 "text": "Al-Andalus () was the Muslim-ruled area of the Iberian Peninsula. The term is used by modern historians for the former Muslim states in modern Spain and Portugal. At its greatest geographical extent, it occupied most of the peninsula and a part of present-day southern France, Septimania (8th century). For nearly 100 years, from the 9th century to the 10th, al-Andalus extended its presence from Fraxinetum into the Alps with a series of organized raids.Some authors mention bands penetrating as far north as Sankt Gallen, where they sacked the monastery in 939. Cf. Ekkehard, Casus S. Galli, IV, 15 (pp. 137f); Lévi-Provençal (1950:60); Reinaud (1964:149f). The name describes the different Muslim states that controlled these territories at various times between 711 and 1492. These boundaries changed constantly as the Christian Reconquista progressed,\"Para los autores árabes medievales, el término Al- Andalus designa la totalidad de las zonas conquistadas – siquiera temporalmente – por tropas arabo-musulmanas en territorios actualmente pertenecientes a Portugal, España y Francia\" (\"For medieval Arab authors, Al- Andalus designated all the conquered areas – even temporarily – by Arab-Muslim troops in territories now belonging to Spain, Portugal and France\"), García de Cortázar, José Ángel. V Semana de Estudios Medievales: Nájera, 1 al 5 de agosto de 1994, Gobierno de La Rioja, Instituto de Estudios Riojanos, 1995, p. 52. eventually shrinking to the south and finally to the Emirate of Granada. Following the Muslim conquest of Spain, al-Andalus, then at its greatest extent, was divided into five administrative units, corresponding roughly to modern Andalusia; Castile and León; Navarre, Aragon, Catalonia; Portugal and Galicia; and the Languedoc-Roussillon area of Occitania. As a political domain, it successively constituted a province of the Umayyad Caliphate, initiated by the Caliph al-Walid I (711–750); the Emirate of Córdoba (–929); the Caliphate of Córdoba (929–1031); the taifa kingdoms that succeeded the Caliphate of Córdoba (1009–1110); the Almoravid Empire (1085–1145); the second taifa period (1140–1203); the Almohad Caliphate (1147–1238); the third taifa period (1232–1287); and ultimately the Nasrid Emirate of Granada (1238–1492). This civilization was quite advanced at architecture and urban planning. The Moors were very wealthy because they controlled the gold trade from the Ghana Empire in West Africa. They built many beautiful buildings in all the land they controlled. Many of their large buildings still stand in cities in Andalusia, such as in Seville, Granada, and Cordoba. Muslim Spain was multicultural and comparatively tolerant; Jews, Christians and Muslims lived side by side. There was also a saqaliba population (the descendants of European slaves) near the Mediterranean coast. Though these people were at first brought in to be slaves, some of them became generals (as did some Mamluks in another caliphate) and some generals became rulers of their own cities (taifas) for a short time. In 1236, the Reconquista (gradual Christian reconquest) under the forces of Ferdinand III of Castile progressed as far as the last remaining Islamic stronghold, Granada. Granada was reduced to a vassal state to Castile for the next 256 years, until January 2, 1492, when Boabdil surrendered complete control of Granada to Ferdinand and Isabella. ==Related pages== * Umayyad Caliphate * Islamic Golden Age * History of Islam * History of Spain * Berber people * Andalusia * Moors ==Notes== == Footnotes == == Bibliography == An Islamic History of Europe . video documentary, BBC 4, August 2005. * Stavans, Ilan. 2003. The Scroll and the Cross: 1,000 Years of Jewish-Hispanic Literature. London: Routledge. * Wasserstein, David J. 1995. Jewish élites in Al-Andalus. In Daniel Frank (Ed.). The Jews of Medieval Islam: Community, Society and Identity. Brill. == Movies == * Cities of Light: The Rise and Fall of Islamic Spain (Unity Productions Foundation documentary) == Other websites == * Paper by Georg Bossong evaluating proposals for the etymology of \"al-Andalus\". In German. * Photocopy of the Ajbar Machmu'a, translated by Lafuente 1867 * The routes of al-Andalus (from the UNESCO web site) * Muslim contributions to Andalus * History and influences of Andalusian music * The Library of Iberian Resources Online * Al-Andalus Chronology and Photos Category:Al-Andalus",
 "title": "Al-Andalus"
}