{
 "id": "1154829",
 "text": "A particulate air filter is a device composed of fibrous, or porous materials which removes particulates such as smoke, dust, pollen, mold, viruses and bacteria from the air. Filters containing an adsorbent or catalyst such as charcoal (carbon) may also remove odors and gaseous pollutants such as volatile organic compounds or ozone. Air filters are used in applications where air quality is important, notably in building ventilation systems and in engines. Some buildings, as well as aircraft and other human-made environments (e.g., satellites, and Space Shuttles) use foam, pleated paper, or spun fiberglass filter elements. Another method, air ionizers, use fibers or elements with a static electric charge, which attract dust particles. The air intakes of internal combustion engines and air compressors tend to use either paper, foam, or cotton filters. Oil bath filters have fallen out of favor aside from niche uses. The technology of air intake filters of gas turbines has improved significantly in recent years, due to improvements in the aerodynamics and fluid dynamics of the air-compressor part of the gas turbines. == Automotive cabin air filters == The cabin air filter, also known in the United Kingdom as a pollen filter, is typically a pleated-paper filter that is placed in the outside-air intake for the vehicle's passenger compartment. These filters can be particulate filters, or they can be a combination filter with activated carbon to adsorb odors and gases. It is typically located behind the glove box, under the dashboard, or within the engine compartment. Some of these filters are rectangular and similar in shape to the engine air filter. Others are uniquely shaped to fit the available space of particular vehicles' outside-air intakes. The first automaker to include a disposable filter to keep the ventilation system clean was the Nash Motors \"Weather Eye\", introduced in 1940. A reusable heater core filter was available as an optional accessory on Studebaker models beginning in 1959, including Studebaker Lark automobiles (1959-1966), Studebaker Gran Turismo Hawk automobiles (1962-1964) and Studebaker Champ trucks (1960-1964). The filter was an aluminum frame containing an aluminum mesh and was located directly above the heater core. The filter was removed and installed from the engine compartment through a slot in the firewall. A long, thin rubber seal plugged the slot when the filter was installed. The filter could be vacuumed and washed prior to installation. == References == Category:Auto parts",
 "title": "Air filter"
}