{
 "id": "11542",
 "text": "Chad (; , officially called the Republic of Chad), is a landlocked country in Central Africa. The capital is N'Djamena. It was a French colony until 1960. It suffers from poverty, illness, drought, and armed conflicts. In 2011, the population of Chad was 11,535,000. Arabic and French are the official languages. Islam and Christianity are the most widely practiced religions. Chad has one of the highest levels of hunger in the world. Food insecurity is common in the country. 80% live in total poverty on less than a dollar a day, and 90% are unemployed in Chad. Chad has a low life expectancy. Life expectancy is 54 years old in Chad. Chad is home to 134 kinds of mammals, 141 bird species, 52 kinds of reptiles, 30 amphibians and 130 kinds of fish. Many animals such as elephants, hippopotamuses, rhinoceroses, warthogs, giraffes, antelopes, lions, leopards, and cheetahs live in Chad. ==Geography== Chad is the world's 21st-largest country. It is slightly smaller than Peru and slightly larger than South Africa.\"Chad\", The World Factbook.\"Rank Order – Area\" To the north is Libya, to the south is the Central African Republic, to the east is Sudan, and to the west are Cameroon, Nigeria, and Niger. The country's capital is from the nearest seaport Douala, Cameroon.\"Chad\",Encyclopædia Britannica.\"Chad\". United Nations Commission on Human Rights. Due to this distance from the sea and the country's largely desert climate, Chad is sometimes called the \"Dead Heart of Africa\".D. Botha, \"S.H. Frankel\" Lake Chad is the largest wetland in Chad and the second largest in Africa. Lake Chad was 7000 years ago. Now it is . Chad's highest peak is the Emi Koussi in the Sahara. The region's tall grasses and large amount of marshes make it good for birds, reptiles, and large mammals. Chad's major rivers are the Chari and Logone. ==Regions== Since 2002, the Republic of Chad has been divided into regions. It was previously divided into prefectures, and then departments. Below is a list of the 23 regions as of 2012. No. Region Pop. (2009) Capital Departments 1 Batha Ati Batha Est, Batha Ouest, Fitri 22 Chari- Baguirmi Massenya Baguirmi, Chari, Loug Chari 23 Hadjer-Lamis Massakory Dababa, Dagana , Haraze Al Biar 5 Wadi Fira Biltine Biltine, Dar Tama, Kobé 2 Bahr el Gazel Moussoro Barh El Gazel Nord, Barh El Gazel Sud 3 Borkou Faya- Largeau Borkou, Borkou Yala 8 Ennedi-Est Am-Djarass Am-Djarass, Wadi Hawar 12 Ennedi-Ouest Fada Fada, Mourtcha 9 Guéra Mongo Abtouyour, Barh Signaka, Guéra, Mangalmé 13 Kanem Mao Kanem, Nord Kanem, Wadi Bissam 14 Lac Bol Mamdi, Wayi 11 Logone Occidental Moundou Dodjé, Guéni, Lac Wey, Ngourkosso 7 Logone Oriental Doba La Nya, La Nya Pendé, La Pendé, Kouh-Est, Kouh-Ouest, Monts de Lam 15 Mandoul Koumra Barh Sara, Mandoul Occidental, Mandoul Oriental 6 Mayo-Kebbi Est Bongor Kabbia, Mayo-Boneye, Mayo-Lémié, Mont d'Illi 10 Mayo-Kebbi Ouest Pala Lac Léré, Mayo-Dallah 19 Moyen-Chari Sarh Barh Kôh, Grande Sido, Lac Iro 4 Ouaddaï Abéché Abdi, Assoungha, Ouara 17 Salamat Am Timan Aboudeïa, Barh Azoum, Haraze-Mangueigne 18 Sila Goz Beïda Djourf Al Ahmar, Kimiti 20 Tandjilé Laï Tandjilé Est, Tandjilé Ouest 21 Tibesti Bardaï Tibesti Est, Tibesti Ouest 16 N'Djamena (capital) N'Djamena 10 dawāʾir or arrondissements ad since 2012 ==Cities== The largest cities in Chad are: #N'Djamena - 704,200 #Moundou - 136,900 #Sarh - 100,100 #Abéché - 72,500 #Kélo - 41,500 #Koumra - 35,400 #Pala - 34,600 #Am Timan - 28,200 #Bongor - 27,100 #Mongo - 27,100 ==Languages== Chad's official languages are Arabic and French, but over 100 languages and dialects are spoken. Due to the important role of Arab traders and merchants, Chadian Arabic has become a lingua franca, a language for all to use. ==Education== Attending primary school is required in Chad, though only about 50% of children attend school. Adult literacy is only 35%. The University of N'Djamena gives higher education. == References == ==Other websites== * * Category:French-speaking countries Category:Least developed countries Category:Members of the Organisation of Islamic Cooperation Category:1960 establishments in Africa",
 "title": "Chad"
}