{
 "id": "1154141",
 "text": "Thirty Seconds to Mars is an American rock band from Los Angeles, California that formed in 1998. \"A Beautiful Lie\", the fourth single from the second album, was nominated for \"Best Video\" at the Kerrang! Awards and wins for \"Video Star\" at the MTV Asia Awards, \"Playlist Generation\" at the TRL Awards and at the MTV Europe Music Awards, and it received the \"MTV Gold Video Plays Award\" from MTV International. 30 Seconds to Mars' songs and albums have received recognition at the Kerrang! Awards, the MTV Europe Music Awards, the MTV Australia Awards, the MTV Video Music Awards, the Fuse Awards and other many. \"The Kill (Bury Me)\" is the second single from the band's second album A Beautiful Lie. The song was awarded the \"Best MTV 2\" award from the MTV Video Music Awards, the \"Video Inspired By Film\" award from the Fuse Fangoria Chainsaw Awards, the \"Best Video Woodie: Live Action\" award from the MTVu Woodie Awards, the \"Video of the Year\" and \"Best Rock Video\" awards from the MTV Australia Video Music Awards and the \"Best Single\" award from the Kerrang! Awards. The band itself has received awards including \"Rock Out\" at the MTV Europe Music Awards in 2007 and 2008, \"Best International Band\" at the Kerrang! Awards, \"Mejor Artista Rock Internacional\" at the MTV Video Music Awards Latinamerica, \"Best International Breakthrough\" at the Bandit Rock Awards, \"Fuse Best of 2007\" at the Fuse Awards and \"Best New Artist\" at the TRL Awards. == MTV Video Music Awards == The MTV Video Music Awards were established in 1984 by MTV to celebrate the top music videos of the year. 30 Seconds to Mars has received one award from two nominations. |- |rowspan=\"2\"|2006 ||rowspan=\"2\"| \"The Kill (Bury Me)\" || Best MTV 2 || |- | Best Rock Video || == Fuse Fangoria Chainsaw Awards == The Fuse Fangoria Chainsaw Awards were established by the television channel Fuse TV. It proposes the 30 Seconds to Mars among the best rock artists. They won all the nominations. |- |rowspan=\"2\"|2006 || Jared Leto || Prince of Darkness || |- | \"The Kill (Bury Me)\" || Video Inspired By Film || == Fuse Awards == The Fuse Awards are an enclosure to the Fuse Fangoria Chainsaw Awards. They wins for \"Fuse Best of 2007\". |- |2007 || 30 Seconds to Mars || Fuse Best of 2007 || == Hollywood Life's Breakthrough of the Year Awards == The Hollywood Life's Breakthrough of the Year Awards they recognizes the most beloved people of Hollywood. In 2006 Jared Leto wins for \"Crossover Artist\". |- |2006 || Jared Leto || Crossover Artist || == MTVu Woodie Awards == The MTVu Woodie Awards were established in 2005 by MTV, which they say recognizes the music voted best by college students. |- |2006 || \"The Kill (Bury Me)\" || Best Video Woodie: Live Action || == TRL Awards Italia == The TRL Awards were established in 2006 by MTV Italy, to celebrate the most popular artists and music videos in Italy. |- |2007 ||rowspan=\"3\"| 30 Seconds to Mars || Best New Artist || |- |rowspan=\"2\"|2008 || Best Band || |- | Best Riempipiazza || |- |2009 ||\"A Beautiful Lie\" || Playlist Generation || == MTV Australia Awards == The MTV Australia Awards is an annual awards ceremony established in 2005 by MTV Australia. 30 Seconds to Mars has won two award. |- |rowspan=\"2\"|2007 ||rowspan=\"2\"| \"The Kill (Bury Me)\" || Video of the Year || |- | Best Rock Video || == Kerrang! Awards == The Kerrang! Awards is an annual awards ceremony held by Kerrang!, a British rock magazine. It proposes the 30 Seconds to Mars among the best new rock artists. 30 Seconds to Mars has won three awards from six nominations. |- |rowspan=\"2\"|2007 || \"The Kill (Bury Me)\" || Best Single || |- |rowspan=\"3\"| 30 Seconds to Mars || Best International Newcomer || |- |rowspan=\"4\"|2008 || Best International Band || |- | Headliner || |- | \"A Beautiful Lie\" || Best Video || |- | \"From Yesterday\" || Best Single || == Festivalbar == The Festivalbar is an annual awards Italian ceremony were established in 1964. 30 Seconds to Mars has received one nomination for \"Festivalbar Digital\". |- |2007 || 30 Seconds to Mars || Festivalbar Digital || == TMF Awards == The TMF Awards is an annual television awards show broadcast live on The Music Factory. 30 Seconds to Mars has received two nominations. |- |rowspan=\"2\"|2007 || 30 Seconds to Mars || Best Rock || |- | \"From Yesterday\" || Best Video || == MTV Video Music Awards Latin America == The MTV Video Music Awards Latinamerica were established in 2002 by MTV. 30 Seconds to Mars has received one awards from three nominations. |- |2007 ||rowspan=\"3\"| 30 Seconds to Mars ||rowspan=\"2\"| Mejor Artista Rock Internacional || |- |rowspan=\"2\"|2008 || |- | Mejor Fan Club || == MTV Europe Music Awards == The MTV Europe Music Awards is an annual awards ceremony established in 1994 by MTV Europe. 30 Seconds to Mars has received three awards from four nominations. |- |rowspan=\"2\"|2007 ||rowspan=\"3\"| 30 Seconds to Mars || Rock Out || |- | Inter Act || |- |rowspan=\"2\"|2008 || Rock Out || |- | \"A Beautiful Lie\" || Video Star || == Bandit Rock Awards == The Bandit Rock Awards is an annual television awards show broadcast live on S4C. 30 Seconds to Mars has received one awards. |- |2008 || 30 Seconds to Mars || Best International Breakthrough || == MTV Asia Awards == The MTV Asia Awards is an annual awards ceremony established in 2002 by MTV Asia. 30 Seconds to Mars has received one awards. |- |2008 || \"A Beautiful Lie\" || Video Star || == MTV International == MTV International rewards at the end of every year the individual more performed in the 48 world channels of MTV. 30 Seconds to Mars win in 2009 for \"A Beautiful Lie\" for 2008. |- |2009 || \"A Beautiful Lie\" || MTV Gold Video Plays Award || == Poll == Year Poll Nominated work Award 2007 Top on Rock 30 Seconds to Mars Top Artist of 2007 A Beautiful Lie Top Rock Album \"From Yesterday\" Top Rock Song Top Rock Video Jared Leto Top Rock Frontman Top Rock Screamer Echelon/Mars Army Top Rock Fans 2008 Poll My Coke Fest 30 Seconds to Mars Band line up My Coke Fest I can't wait to see My Coke Fest Best performance at My Coke Fest Rock on Request Magazine's Top Modern Rock Artist Top Alternative Artist Jared Leto Top Rock Frontman \"A Beautiful Lie\" Top Rock Video Top Rock Song 30 Seconds to Mars\\A Beautiful Lie European Tour Top Rock Tour Rock Sound Reader's Poll 30 Seconds to Mars Headliner 2009 KROQ Poll \"Stronger\" What's up with the Kanye covers Kerrang! Rock 100 \"The Kill\" Greatest Videos In The Universe! == Notes == == References == == Other websites == * 30 Seconds to Mars official website * A Beautiful Lie web Category:Thirty Seconds to Mars Thirty Seconds",
 "title": "List of awards and nominations received by Thirty Seconds to Mars"
}