{
 "id": "1154935",
 "text": "The Northern Counties Motor & Engineering CompanyCompanies House extract company no 308576 The Northern Counties Motor & Engineering Company was a maker of bus and coach bodies. ==History== Northern Counties Motor & Engineering Company was founded in Wigan in 1919 by Henry Lewis. The Lewis family remained owners of the company until it was bought out over seventy years later. === 1990s === In May 1991, Northern Counties went in administration.The story of Northern Counties, the Wigan based bodybuilder Commercial Motor 9 January 1992 It survived the administration and it carried on making bus and coach bodies. In May 1995, Northern Counties was bought for £10 million by the Henlys Group, owner of Plaxton. In 1999, Northern Counties name was replaced with the Plaxton name, the Northern Counties plant in Wigan still carried on making bus and coach bodies for Plaxton. === 2000s === In 2000, Henlys and Mayflower Corporation (owners of Alexander and Dennis) joined together, The joint venture was known as TransBus International, and buses used the TransBus name.Mayflower and Henlys burst past rivalry to merge UK bus building The Independent 2 August 2000 On 31 March 2004, TransBus International went into administration.Update: re Administration Mayflower Corporation 22 April 2004 On 21 May 2004, TransBus International was bought by a merchant banker named Noble Grossart, and businessmen David Murray and Brian Souter.Murray and Souter join forces to buy TransBus The Scotsman 21 May 2004 the Transbus International name was replaced with Alexander Dennis. On 26 January 2005, the Northern Counties plant in Wigan was closed after it finished making the Plaxton President bodies.Bob's life on the buses Wigan Evening Post 8 September 2006 ==Products== *Palatine (double-decker) *Paladin (single-decker) *Prestige (low-floor single-decker) *President (low-floor double-decker) ==Gallery== File:Foden-NC.jpg|Potteries Motor Traction Foden NC with Northern Counties bodywork File:Keighley_%26_District,_Leyland_Olympian,_906_K6_YCL_-_Flickr_- _Danny%27s_Bus_Photos.jpg|Keighley & District Leyland Olympian with Northern Counties Palatine bodywork File:Stagecoach in Newcastle bus 20258 Volvo B10M Northern Counties Paladin barrel style R558 RPY in Newcastle.jpg|Stagecoach in Newcastle Volvo B10M with Paladin bodywork in May 2009 File:Arriva North West 3313 R313WVR (8511424568).jpg|Arriva North West Volvo Olympian with Northern Counties Palatine II bodywork in February 2013 ==References== *Ogden, Eric; (1976). Northern Counties of Wigan. The Transport Publishing Company. . *Booth, Gavin (1983). The British Bus Today and Tomorrow. Ian Allan Ltd. *Townsin, Alan (1985). The British Bus Story - The 'Sixties - Turbulent Times. The Transport Publishing Company. ==Other websites== * * A very useful listing of all bodies built from 1956 to 2005 *Detailed history of the development of the SELNEC standard Category:British transport companies Category:Bus manufacturers Category:1900s establishments in England Category:2005 disestablishments in England Category:Wigan",
 "title": "Northern Counties"
}