{
 "id": "1155733",
 "text": "The iPhone 15 and iPhone 15 Plus are smartphones developed and made by Apple Inc. They were announced on September 12, 2023. They were began pre-order on September 15, 2023. They were released on September 22, 2023. Apple changed Lighting connector to USB Type C to follow the rules of the European Union. iPhone 15 Plus has a 6.7 Inch bigger 460ppi OLED screen, and iPhone 15 has a 6.1 Inch 460ppi OLED screen. They have a Apple A16 Bionic chipset. They have 60hz refresh rate screens. Along with the iPhone 15 Pro and iPhone 15 Pro Max, they were announced at an Apple event on September 12, 2023. They were successors to the iPhone 14 and iPhone 14 Plus. They have bigger battery than iPhone 14. ==History== In September 2023, European commission started looking into a plan to make all devices in the European Union such as iPhone to use USB-C chargers. They are the first iPhone to use USB-C. == Sales == In the third quarter of 2024, the iPhone 15 reached 3% of 1.22 billion smartphone sold, making it one of best-selling smartphone in the world. ==Problems== ===Temperature=== Some people using iPhone 15 or iPhone 15 Plus said they were getting hot during use. It was reported that apps like Uber and Instagram could be making the phone get hot. Apple said they would fix this during update to iOS 17. ==Design== They are first big design changes looks like the iPhone 12. They have a Dynamic Island, they have a ceramic shield that is hard to break if dropped. They comes with five colors such as blue, pink, yellow, green and black. Colors Name Blue Pink Yellow Green Black ==Features== ===Hardware=== iPhone 15 Plus has 6.7 Inch Super Retina XDR OLED 60hz refresh rate screen and iPhone 15 has a 6.1 inch Super Retina XDR OLED 60hz refresh rate screen, Dynamic Island, True Tone flashlight, They has a 6GB RAM, they also has 128GB, 256GB and 512GB storage options, iPhone 15 Plus has a 4383mAh battery capacity and iPhone 15 has a 3,349mAh battery capacity, they has 12MP wide selfie camera, 12MP ultra wide back camera and 48MP wide back camera, 20W wired charger and 15W wireless charger, they has Apple A16 Bonic chipset, 4K video recording at 24fps/25fps/30fps/60fps, 1080P HD at 25fps/30fps/60fps and 720P at 30fps, the digital zoom of photo camera up to 10x, 2x optical zoom in, 2x optical zoom out, 4x optical zoom and digital zoom of video recording camera up to 6x, they has Bluetooth 5.3, WiFi 6, GPS, Face ID, USB-C, Nano-SIM works for other countries, also, eSIM works for worldwide. ===Software=== They runs iOS 17.0 for the first time, they can runs other version like iOS 18 when came out. == Reviews == === Business Insider review === Business Insider review the iPhone 15 Plus, it has a good reviews, such as bigger 6.7 Inch screen, longer battery life and features look like a iPhone 15, it has a bad reviews such as no 120hz refresh rate screen, some people might not like a bigger sizes and The USB Type C is not faster than lightning connector. === CNET review === CNET reviews the iPhone 15 and iPhone 15 Plus, they has a good reviews such as better USB Type C charging ports, colorful design, changes camera that take a pet and people pictures by itself, and better dynamic island, they has a bad reviews such as no always display, Find My Friends only works with other iPhone 15 phones, cheaper iPhone 14 Pro may better deal and Samsung Galaxy S23 has a more zoom options than iPhone 15 and iPhone 15 Plus, The reviews ratings 8.9 of 10. === The Verge review === The Verge reviews the iPhone 15 and iPhone 15 Plus, they has a good reviews such as easier to hold, strong performance, very good battery life for iPhone 15 Plus, useful camera features, Dynamic Island enjoy and useful, and USB-C charger port, they has a bad reviews such as display does not have a new features like an always on screen and 120hz refresh rate, USB-C transfer data slowly, and ultrawide camera is the same, and no real telephoto. === Wired review === Wired reviews the iPhone 15 and iPhone 15 Plus, they has a good reviews such as USB-C charging port, very nice display, Dynamic Island and SOS calling for help in emergencies, they has a bad reviews such as camera feel small or slow, USB-C is useful sometimes, sometimes are harder to switch, the iPhone 14 Pro is the better phone and Apple has take it out of the product, The review ratings is 7 of 10. === The Guardian review === The Guardian review the iPhone 15, it has a good reviews such as faster phone, good camera, good screen with dynamic island, great phone size, USB-C charging port, longer battery life, longer updates and Face ID, it has a bad reviews such as no telephoto camera, slower than others and iPhone 15 Pro. no always on screen, boring colors, easier to fix but limited in software. ==Related pages== *iPhone 15 Pro ==References== ==Other websites== * Category:IPhone Category:Mobile phones introduced in 2023 Category:Mobile phones with 4K video recording Category:Mobile phones with multiple rear cameras",
 "title": "IPhone 15"
}