{
 "id": "1155807",
 "text": "Syed Ali Nasir Saeed Abaqati Musavi, known as Roohul Millat and Agha Roohi, is a Shia cleric from Lucknow, India. == Family background == Syed Ali Nasir Saeed Abaqati popularly known as Agha Roohi is a Shia scholar from Lucknow, India and comes from the family of Syed Mir Hamid Hussain Musavi. He belongs to the lineage of Syed Mohammad Quli Khan.Leader of Heaven No. 18Roots of North Indian Shi‘ism in Iran and Iraq Religion and State in Awadh, 1722–1859 , by J. R. I. Cole, UNIVERSITY OF CALIFORNIA PRESS Berkeley · Los Angeles · Oxford His ancestral town is Kintoor, Barabanki, Uttar Pradesh and he traces his lineage to Muhammad via Imam Musa al-Kazim, hence the name \"Musavi\". == His majalis (religious lectures) == He is an exponent of Tabarra, openly curse the enemies of Hussainiyat, the killers of Imam Hussain. Agha Roohi recites the ashra-e-majalis (religious lecture to commemorate the Martyrdom of Imam Hussain, spanning ten days) at Shia PG College (at Victoria Street in Nakhas) in morning and at Afzal Mahal in evening.Old city immersed in Moharrum solemnity, 24 February 2004 He also addresses a majlis at Karbala Talkatora, where procession of taboot, to signify the mortal remains of Maula Ali culminates on 21 of the month of Ramadan every year since the earlier ban order was revoked in 1999. Apart from majalis in Lucknow he often was invited in other cities too, e.g., Allahabad. == Involvement in community matters, demonstrations and rallies == * He has been involved in issues related to the Mazar-e-Shahid Salis, Agra.Shia ulema at odds over shrine control, HT Correspondent, Lucknow, 10 April 2006 * He has been involved in political activism related to affairs of Shia community for long. In 1969, he alongside Moulana Dr. Kalbe Sadiq addressed a press conference alongside Jana Sangh's leader Nanaji Deshmukh, when they were ′invited to tell the world the sufferings their sect had undergone′. In 1993 when he was President of the All India Shia Husaini Council he joined political party BJP. * In 2002, he organised 'Anti Terrorism Week' which included demonstrations, burning of effigies of Osama bin Laden, Mulla Omar, Pervez Musharraf and the Pakistan flag. * In 2006, he was removed from the board of Shia College, Lucknow.Shia clerics at dispute over Shia college, Masoodul Hasan, Lucknow, 19 December 2006 * In May 2006, he opposed 'new model nikahnama' for the Shia community issued by All India Shia Personal Law Board, headed by Maulana Mirza Mohammed Athar.Now, a model nikahnama only for Shias, M. Hasan, Hindustan Times, 29 May 2006. * He held al-Qaeda responsible for 2006–2007 destruction of the Al- Askari Mosque in Samarra, Iraq.Sadiq, Jawad blame US; Abaqati puts it on Qaeda, Article from: The Hindustan Times, 15 June 2007. * In 2009, the Law Commission's report on bigamy resulted in opposition from All India Muslim Personal Law Board, Agha Roohi suggested Law Commission to talk to clerics over this issue.Keep off, clerics tell law panel; to meet PM, M. Hasan, Hindustan Times, Lucknow, 7 August 2009 * On 14 November 2010, he and fellow cleric Kalbe Jawad tried to stop the annual meeting of the board of trustees at Shia Post Graduate Degree College because it was being held on a Sunday. The men were taken into preventive custody but were released when violent protests broke out.Cleric detained, supporters go on rampage in Lucknow, Express news service, 15 November 2010. * On 19 June 2014, he organised a demonstration to protest killing of innocents by Islamic State of Iraq and Syria at Dargah Hazrat Abbas, Lucknow. Addressing the crowd, he said, > \"ISIS is a great threat not only to Islam but the entire humanity and what > must be understood by Muslims across the globe is that these brutal attacks > on Holy Shrines clearly smells of conspiracy which must be countered by > remaining united.\" * In April 2017, he issued a statement vowing to end cow slaughter. * In 2019, he alongside other Shia clerics like Imam-e-Juma of Asafi Mosque Maulana Kalbe Jawad, president of the Shia Moon Committee Maulana Saif Abbas, academician and cleric Maulana Kalbe Sibtain Noori, spokesperson of All India Shia Personal Law Board Maulana Yasoob Abbas, etc. signed the memorandum demanding the maintenance of sanctity and religious fibre of 235-year-old Bara Imambara precincts. * In 2020, he alongside other Shia clerics Maulana Kalbe Sadiq, Maulana Kalbe Jawad, Maulana Yasoob Abbas, Maulana Abbas Irshad, Maulana Saif Abbas, etc. requested Archaeological Survey of India for immediate assessment and time-bound restoration of the centrally protected monument Imambara Sibtainabad. == Family == His elder son Maulana Syed Abbas Nasir Saeed Abaqati (b. 1986), a PhD student in Shia theology, fought against the Islamic State in Iraq and Syria (ISIS, or IS) while he was studying at Najaf University (Al-Hawza al-'Ilmiyya fi al-Najaf al-Ashraf Islamic seminary) in July 2014 when clashes with the ISIS broke out in Iraq he joined it. Apart from other majalis he now addresses majlis at Shia College during first 10 days of Muharram. He is president of Anjuman Moinuzzaireen which manages Mazaar-e-Shaheed-e-Saalis while his younger brother Syed Murtaza Nasir Saeed is secretary and his uncles (half-brothers of Agha Roohi) Maulana Syed Sajjad Nasir Saeed Abaqati and Syed Husain Nasir Saeed are patron and Mutawalli respectively.'' == References == == Other websites == * Shia Sunni clash in Lucknow during Muharram, 18 December 2010 – 11:04 pm Category:Living people Category:Year of birth missing (living people) Category:Indian Islamic religious leaders Category:People from Lucknow",
 "title": "Agha Roohi"
}