{
 "id": "1155977",
 "text": "Autobiography is the debut studio album by American pop-rock singer and actress Ashlee Simpson. Released on June 20, 2004, it was mostly well recieved by critics and a commercial success, peaking at #1 on the Billboard 200 and having spent four weeks there. The album is certified triple platinum. Three singles were released- \"Pieces of Me\", \"Shadow\", and \"La La\", and the title track was used as the theme song to Simpson's MTV reality TV show \"The Ashlee Simpson Show\". == Promotion == === Singles === (Main articles: \"Pieces of Me\", \"Shadow\", \"La La\") Simpson released the lead single, \"Pieces of Me\", on May 17, 2004. It was a success, peaking at #5 on the Billboard Hot 100. The second single, \"Shadow\", was released on September 14, 2004. It peaked at #57 on the Billboard Hot 100. In the U.K., however, Shadow was not the second single, instead, \"La La\" was released as the second single from the album. It peaked at #11 on the U.K. singles chart. \"La La\" was the third (and final) U.S. single, released on November 8, 2004. It peaked at #86 on the Billboard Hot 100. === Tour === (Main article: \"The Autobiography Tour\") In 2004, Simpson embarked on a tour, \"The Autobiography Tour\", in support of the album. The tour was a success, as many dates of the tour sold out. It began on February 16, 2005, at The Grove of Anaheim in Anaheim, California, and ended on April 20, 2005, at Texas Trust CU Theatre in Grand Prarie, Texas. The bands Pepper's Ghost and The Click Five opened for Simpson. == Billboard/U.K. Chart Positions == Country Chart Date of Peak Peak Weeks On Chart United States of America Billboard 200 August 7, 2004 #1 40 United States of America Top Album Sales August 7, 2004 #1 40 Canada Billboard Canadian Albums January 22, 2005 #8 2 United Kingdom Offical Albums Chart October 16, 2004 #31 11 United Kingdom Offical Physical Albums Chart October 16, 2004 #31 11 Scotland Offical Scottish Albums Chart October 2, 2004 #23 14 ==References== Category:2004 albums",
 "title": "Autobiography (album)"
}