{
 "id": "115534",
 "text": "Simon John Pegg (né Beckingham; born 14 February 1970) is an English actor, comedian, director, producer and screenwriter. His best known roles are Spaced, Shaun of the Dead, Hot Fuzz, Paul and the Ice Age franchise. He is also known for working with Nick Frost. ==Personal life== Pegg married Maureen McCann on 23 July 2005. On 21 February 2009, Pegg said his wife was five months pregnant with the couple's first child. Their daughter Matilda was born early July 2009. Pegg has said on his personal Twitter feed that he is an atheist.Twitter Simon Pegg's Twitter Feed Along with Jonny Buckland, Pegg is godfather to Apple, daughter of close friends Chris Martin and Gwyneth Paltrow. In return Martin is godfather to Pegg's daughter. Pegg's parents and sister briefly appeared in Spaced. His mother was in both Shaun of the Dead and Hot Fuzz. Pegg was awarded an honorary fellowship by the University of Gloucestershire on 4 December 2008. ==Filmography== ===Television=== Year Title Role Notes 1995 Six Pairs of Pants Various Characters Also co-writer 1996 Asylum Simon Also co-writer 1996 Faith in the Future Jools 1997 I'm Alan Partridge Steve Bennett 1 episode: \"Watership Alan\" 1997 We Know Where You Live Various Roles 1998 Is It Bill Bailey? Various Roles 1998 Big Train Various Roles Nominated—British Comedy Award for Best Male Comedy Award (also for Spaced) 1999 Spaced Tim Bisley Also co-writer Nominated—BAFTA TV Situation Comedy Award (shared with Edgar Wright, Nira Park and Jessica Hynes) Nominated—British Comedy Award for Best Male Comedy Newcomer (also for Big Train) 1999 Tube Tales Clerk Segment: \"Steal Away\" 1999 Hippies Ray Purbbs 2000 Randall & Hopkirk (Deceased) Justin Pope 1 episode: \"Paranoia\" 2001 Brass Eye Gerard Chote 1 episode: \"Paedophilia Special\" 2001 Band of Brothers First Sergeant William Evans 2 episodes 2001 Dr. Terrible's House of Horrible Angus 1 episode: \"Curse of the Blood of the Lizard of Doom\" 2002 Look Around You Sleeping Queen's Guard 1 episode: \"Maths\" 2002 Linda Green Jay 1 episode: \"Dark Side of the Moon\" 2003 Final Demand Colin Taylor 2004 Sex & Lies Radio DJ 2004 Black Books Evan 1 episode: \"Manny Come Home\" 2004 I Am Not an Animal Kieron the Cat 2005 Look Around You Handsome Man 1 episode\" \"Health\" 2005 Spider-Plant Man Frank Matters 2005 Doctor Who The Editor 1 episode\" \"The Long Game\" 2005 Doctor Who Confidential Narrator 2006 Big Nothing Gus 2009 Robot Chicken Paul McCartney/George Harrison/Ringo Starr (voice) 2012 Star Wars: The Clone Wars Dengar (voice) 1 episode: \"Bounty\" 2012 L.A. Noir Hecky Nash Pre- Production ===Films=== Year Title Role Notes 1999 Guest House Paradiso Mr. Nice 2001 The Parole Officer Deflated Husband 2002 24 Hour Party People Paul Morley 2004 Shaun of the Dead Shaun Riley Also co-writer Bram Stoker Award for Best Screenplay (shared with Edgar Wright, tied with Michel Gondry, Charlie Kaufman, and Pierre Bismuth) British Independent Film Award for Best Screenplay (shared with Edgar Wright) Chainsaw Award for Best Actor Chainsaw Award for Best Screenplay (shared with Edgar Wright) Peter Sellers Award for Comedy Nominated—Chlotrudis Award for Best Original Screenplay (shared with Edgar Wright) Nominated—Empire Award for Best British Actor Nominated—London Film Critics' Circle ALFS Award for British Screewriter of the Year (shared with Edgar Wright) Nominated—Online Film Critics Society Award for Best Original Screenplay (shared with Edgar Wright) 2005 The League of Gentlemen's Apocalypse Peter Cow 2005 Land of the Dead Photo Booth Zombie Cameo 2006 Mission: Impossible III Benji Dunn 2006 Big Nothing Gus 2006 Free Jimmy Odd Also writer 2007 Grindhouse Cannibal Segment \"Don't\" 2007 The Good Night Paul 2007 Hot Fuzz PC/Sergeant/Chief Inspector Nicholas Angel Also co-writer Nominated—Empire Award for Best Actor 2007 Run Fatboy Run Dennis Doyle Also co-writer 2007 Diary of the Dead Voice-over Cameo 2008 How to Lose Friends and Alienate People Sidney Young 2009 Star Trek Montgomery \"Scotty\" Scott Nominated—Broadcast Film Critics Association Award for Best Cast Nominated—Scream Award for Best Ensemble 2009 Ice Age: Dawn of the Dinosaurs Buck (voice) Nominated—Visual Effects Society Award for Outstanding Animation in an Animated Feature Motion Picture (shared with Peter de Sève) 2010 Burke and Hare William Burke 2010 The Chronicles of Narnia: The Voyage of the Dawn Treader Reepicheep (voice) 2010 Fable III Ben Finn (voice) Video game 2011 Spare Parts Con-Rad (voice) Video game 2011 Paul Graeme Willy Also co-writer 2011 Scrat's Continental Crack-up Buck (voice) Short 2011 The Adventures of Tintin Thompson 2011 Mission: Impossible – Ghost Protocol Benji Dunn 2012 A Fantastic Fear of Everything Also executive producer 2013 Star Trek Into Darkness Montgomery \"Scotty\" Scott Post-production 2013 The World's End Also co-writer; pre-production ==References== ==Other websites== * Category:1970 births Category:Living people Category:Actors from Gloucestershire Category:British atheists Category:English comedians Category:English movie actors Category:English movie directors Category:English movie producers Category:English screenwriters Category:English television actors Category:English television writers Category:English voice actors Category:Writers from Gloucestershire",
 "title": "Simon Pegg"
}