{
 "id": "1155305",
 "text": "Resilient foods refers to food sources which are able to maintain functionality during global catastrophes, even when normal food sources cease to function. Resilient foods are relevant in two primary catastrophic scenarios: == Abrupt Sunlight Reduction Scenario (ASRS) == This scenario involves events such as volcanic eruptions that release particles into the atmosphere, blocking sunlight and causing global temperature decreases. The primary challenge in ASRS is the reduced energy input into agricultural systems, as solar radiation is significantly diminished. == Global Catastrophic Infrastructure Loss (GCIL) == GCIL describes situations where global electrical infrastructure is compromised or destroyed, potentially due to events like severe geomagnetic storms. While solar energy remains available, the loss of infrastructure affects critical agricultural inputs including fertilizers, pesticides, and mechanized farming capabilities. == Resilient Food Categories == Based on their suitability for these scenarios, resilient foods can be classified into three main categories: === ASRS- Exclusive Foods === These foods can maintain production during reduced sunlight but require functional infrastructure. Industrial foods, particularly single-cell proteins produced in bioreactors using methane as an energy source, exemplify this category. These proteins can be processed into flour- like substances suitable for food enrichment. === GCIL-Exclusive Foods === Foods in this category maintain production without complex infrastructure but require normal sunlight levels. Greenhouse cultivation of traditional crops represents a primary example, requiring only basic materials like transparent sheets and scaffolding. === Dual-Scenario Foods === Some food sources demonstrate resilience to both ASRS and GCIL conditions. Seaweed serves as a notable example, thriving with minimal sunlight requirements while being cultivatable using traditional, low-technology methods that have persisted for millennia. == Further reading == * Alliance to Feed the Earth in Disasters * Nuclear winter == References == Category:Foods",
 "title": "Resilient food"
}