{
 "id": "115532",
 "text": "Apollo 13 was the seventh mission of NASA's Project Apollo. It was the third lunar-lander mission with a crew. Jim Lovell commanded Apollo 13. The other astronauts were Jack Swigert and Fred Haise. The craft launched successfully toward the Moon, but two days after launch a faulty oxygen tank exploded. It damaged the Service Module. It lost oxygen and electrical power. There was a very large chance that the astronauts would die before they could return to Earth. They were very short on oxygen. Oxygen is not just used to breathe; on the Apollo spacecraft it was used in a device called a Fuel cell to generate electricity. So they saved their remaining air by turning off almost all their electrical equipment, for example heaters. It became very cold in the spacecraft. The astronauts also had to move into the Apollo Lunar Module to survive and use it as lifeboat. When they approached the Earth they were not sure that their parachutes, needed to slow the Command Module down, would work. The parachutes were thrown out by small explosive charges that were fired by batteries. The cold could have made the batteries fail, so the parachutes would not work and the Command Module would hit the ocean so fast that all aboard would be killed. == The flight == Apollo 13 launched on April 11, 1970 at 19:13 UTC from Cape Canaveral and went into temporary low Earth orbit. Two hours later they fired the rocket motor again to go towards the Moon. They wanted to land at Fra Mauro. Despite the hardships, the crew made it back to Earth. Though the crew did not land on the Moon, the flight became very well known. Some people thought it was a failure because they did not land on the Moon. However, others thought it was possibly the National Aeronautics and Space Administrations' (NASA's) greatest accomplishment in returning three men in a very damaged spacecraft back to Earth safely. Coming up to re-entry, it was thought that the electrical equipment would short circuit because the water in the astronauts' breath had turned back into a liquid all over the computers. However, the electronics were fine. Books were written about the event, for example one by Jim Lovell, the commander of the mission. A movie was also made about it, directed by Ron Howard and starring Tom Hanks. == Related pages == * Apollo program * NASA == References == == Other websites == Category:Apollo program Category:1970s in spaceflight Category:1970 in the United States",
 "title": "Apollo 13"
}