{
 "id": "1155788",
 "text": "Nabiji is an unfinished novel by Bangladeshi fiction writer Humayun Ahmed based on the biography of the Islamic prophet Muhammad. It was the last literature or swan song by Humayun Ahmed. ==Context== On October 21, 2011, Humayun Ahmed first revealed the subject of this novel in an interview given to Emdadul Haque Milon in Kaler Kantho's weekly arrangement Shilalipi. He said that the Maulana who prayed during the inauguration of a new sales center of Anyaprakash publication in Banglabazar requested Humayun Ahmed to write the biography of the Islamic prophet Muhammad as his long cherished dream. Humayun Ahmed agreed and in preparation collected the Sirat of Maulana Muhyuddin Khan and initially consulted him. The other day he asked Masum Rahman, the chief editor and illustrator of the newspaper, to make a cover for the novel and Masum Rahman made the cover for him. After writing a few lines, he decided to start writing after seeing Muhammad in his dream. For this purpose, Muhammad went to Mohiuddin Khan and collected the book according to his dream and started acting accordingly. A few days later, when he was diagnosed with cancer, he took this book with him and went to New York for treatment, where he regularly studied this book as well as the Sirat books and prayed five times a day to write the novel. While undergoing treatment in America, he woke up one night, took a shower, resumed writing the novel, and died while writing it. He also discussed writing the novel with Muhyuddin Khan as well as Mustafa Zaman Abbasi. ==Summary== Humayun Ahmed begins the text by describing the then customary Arab custom of burying his daughter Shama alive by Auj. Then he clarifies the theme of the novel by explaining the topic of paying off the religious debt by writing the biography of Muhammad, who was revealed by the Qur'an with the first few verses of Surah Takbeer. Then he described the image of Arabia at that time. He gave a brief account of various events including tribal wars, fights, riots, looting, killing of daughters. He referred to this as a common image of that time. He then narrated the birth of Muhammad. He mentions many controversies about the date of birth. Dada then mentions his naming by Abdul Motalib. The unfinished work then concludes with a description of his upbringing in the house of Dudh Ma Halima and his shadowing by a cloud as a child. ==Characters == * Auz * Shama * Shama's mother * Hubal * Amina * Abdullah * Muhammad * Abdul Muttalib * The slave girl Suwaybah * Abu Lahab * Ruqayyah bint Muhammad * Umme Kulsum bint Muhammad * Utbah Ibn Abu Lahab * Utaybah ibn Abi Lahab * Umme Jameel * Ibn Abbas * Priest Bahira * Umme Aiman * Zayed Ibn Haresa * Thuaiba * Halima * Banu Sa'd tribe * Ibn Ishaq * Foster btother Abdullah * Shaima * Atiya * Huzafa ==Publication== The writing was published in 2013 in the Eid issue of Anyandin newspaper and in 2014 in Humayun Ahmed's unpublished collection of works \"Lilabatir Mrittyu\". ==Opinion == The writer Khorshed Mukul said about the novel in an article, \"In this unfinished text, he has introduced an extraordinary prose style. History comes back to life in neat words, small sentences. This text becomes Bangmai in the aesthetic composition of words and the style of storytelling. Ardhaformer ('Death of Lilabati' in the book) Collected, which was published after his death) this unfinished text is a strong read in the mind of the reader able to awaken.\" Author Hasan Shawon said, \"Humayun Ahmed has not written a novel based on history. Middayhan, Matal Hawa, Deyal, Badshah Namdar - testify to this. The 'Nabiji' of this writer, who is enthusiastic about reading on a wide range of topics, could have been excellent if he had written and published it. A literary work. Humayun Ahmed describes the context of the Nabi (PBUH) instead of devotion In the explanation of the economy and social structure of the time, the story of the attempt to save the life in the gray desert is evident. At the beginning, the story of the daughter being buried in the well is touching. ] brings out the meaning of Surah Takbir.... Humayun Ahmed at one stage of writing He wrote, \"All people have a debt to their parents. If we make a mistake, we ask forgiveness from the Most Merciful. He is there to forgive us.\" I am doing it to the Prophet (PBUH). He also has an ocean of forgiveness.\"...Maestro Humayun Ahmed could not finish 'Nabiji' due to the deadly cancer. Readers are deprived of an incomparable Sirat book. Which Humayun started in his own style of story telling. Humayun Ahmed was not only the artist of the rain of youth, but he will surely be recognized as a benefactor of the universe one day. Wait until then.\" ==References== Category:Biographies of Muhammad in Bengali language Category:Humayun Ahmed's Novels",
 "title": "Nabiji (novel)"
}