{
 "id": "1155641",
 "text": "GSC Game World is a Ukrainian video game developer. Founded in 1995 in Kiev, Ukraine, closed in 2012 and reopened in 2014, it has published titles such as Cossacks: European Wars, American Conquest, Alexander, S.T.A.L.K.E.R.: Shadow of Chernobyl, S.T.A.L.K.E.R.: Clear Sky and S.T.A.L.K.E.R.: Call of Pripyat. In 2004, GSC Game World founded the publishing arm GSC World Publishing. GSC Game World's most successful series is S.T.A.L.L.K.E.R., a survival shooter that was in development for seven years, released in March 2007. They are also known for the Cossacks series. Most of their titles have been published in Europe by CDV Software Entertainment. == Development == GSC Game World has its own graphics engine, the X-Ray Engine, used in the S.T.A.L.K.E.R. series. After initial reports in 2011, it was indicated that their next project, S.T.A.L.K.E.R. 2, had been cancelled. GSC tweeted a complete denial of the cancellation, as well as rumors denying that the studio had closed its doors. However, they later deleted the tweet and later, official comment would be made on December 12, 2011. It was stated, \"We will do our best to continue. However, at this time, nothing is certain.\" On December 23, 2011, it was revealed that S.T.A.L.K.E.R. 2. is still in development. On May 15, 2012, a Russian blog published an interview with one of executives of GSC Game World, which revealed that GSC Game World is not closed and that the S.T.A.L.K.E.R. brand still belongs to GSC. The same day during a live interview it was revealed that S.T.A.L.K.E.R. 2. On December 21, 2014, the return of GSC Game World to the world of video games was announced. This time, they claimed to be working on a new project. == List of games developed by GSC Game World == * 2001 — Codename: Outbreak * 2001— Cossacks: European Wars * 2002 — Cossacks: Art of War * 2002 — Cossacks: Back to War * 2003 — Hover Ace * 2003 — American Conquest * 2003— American Conquest: Fight Back * 2004 — Alexander * 2004 — Firestarter * 2005 — Cossacks II: Napoleonic Wars * 2006 — Cossacks II: Battle for Europe * 2006 — Heroes of Annihilated Empires * 2007 — S.T.A.L.K.E.R.: Shadow of Chernobyl * 2008 — S.T.A.L.K.E.R.: Clear Sky * 2009 — S.T.A.L.K.E.R.: Call of Pripyat * 2016 — Cossacks 3 * 2024 — S.T.A.L.K.E.R. 2 == Xbox 360 Development Rights == In November 2007 GSC acquired the Xbox 360 development rights. In September 2009 GSC announced that they will port S.T.A.L.K.E.R. 2 to Xbox 360 and PlayStation 3 consoles, however, due to lack of staff, they planned to start with the release of S.T.A.L.K.E.R. 2. which, however, was later cancelled. == Notes == == References == == Other websites == * Category:Video game companies",
 "title": "GSC Game World"
}