{
 "id": "1155088",
 "text": "Albien Van Holsbeeck (6 January 1946 – 10 December 2024) was a Belgian athletics competitor and politician. Van Holsbeeck was specialized in long distance running and cross-country. He won medals at Belgian Athletics Championships between 1966 and 1969 and represented Belgium internationally at the International Cross Country Championships. ==Biography== Van Holsbeek was born in in Affligem on 6 January 1946. During his youth he started practicing athletics and was a member of SC Anderlecht. Albien became for the first time national champion in the cross-country in 1962 in the youth category. In 1965 he was selected to compete at the International Cross Country Championships in the junior category and finished second behind . In 1964 and 1965 he became again national cross country champion. In 1966 he also became national champion in the 1500 metres. As an elite athlete Van Holsbeeck was selected to represent Belgium at the International Cross Country Championships at the 1967 Championships in Barry (Wales), 1968 Championships in Tunis (Tunesia) and 1969 Championships in Clydebank (Scotland). At the Belgian Athletics Championships he won the silver medal in 1966 in the 10,000 metres behind Olympic champion Gaston Roelants. Two years later he won again the silver medal in the 10,000 metres. This time behind Eugene Allonsius. In 1968 he also won the bronze medal in the 3000 metres steeplechase behind Eddy Van Butsele and Miel Puttemans. Van Holsbeeck won his last medal at the national championships in 1969 in the 5000 metres. He won the bronze medal behind Roelants and Willy Polleunis. Van Hosbeeck became a member of AC Hekelgem and ended his athletic career in the 1970s. After his athletics career, Van Holsbeeck became active in local politics from 1976. He was a member of the Christen-Democratisch en Vlaams. He served as an alderman (in Belgium called schepen), municipal councilor and was chairman of the Public Centre for Social Welfare (OCMW). Van Holsbeeck worked at the National Bank of Belgium. He also has been a member for years of the Young Christian Workers and . He was married to Denise Steppe. They had three children and two grandchildren. Van Holsbeeck died in Aalst on 10 December 2024, at the age of 78 years old. ==References== Category:Belgian athletes Category:Long-distance runners Category:Belgian politicians Category:1946 births Category:2024 deaths Category:People from Flemish Brabant",
 "title": "Albien Van Holsbeeck"
}