{
 "id": "115547",
 "text": "The North American video game crash of 1983 was a major event in the history of video games where the North American video game industry had crashed. Many makers of home computers and video game consoles went bankrupt. The crash lasted for several years, and many business analysts thought that the video game industry would not last. However, the Japanese company Nintendo introduced the Nintendo Entertainment System in 1985, which became very popular in 1987 and ended the crash. There were several reasons for the crash, but the main reason was that companies were making many consoles and hundreds of games, most of which were low quality. The video game version of ET: The Extra Terrestrial is often blamed for the crash. ==Background== Through the 1970s, many companies, most notably Coleco and Atari, released video game consoles. The video game industry became a big thing, and it seemed like video games were the next cool thing. However, soon, companies tried to take advantage. For example, if you mailed to a dog food company, they'd send you a video game. The market became flooded with low-quality video games, with the final straws being Pac-Man and ET: The Extra Terrestrial for the Atari 2600. Consumers lost confidence in video games and stopped buying them, and Atari and many other video game companies began to lose money. Most companies of the time left the video game market, leading most experts to claim that the video game market was dead and that video games were nothing more than a fad. The crash was notable for being more bad for the companies, as consumers themselves were happy that games were overall much cheaper. The crash would last until 1985, when Nintendo released the Nintendo Entertainment System. This became successful, in part because it tried to separate itself from being just a video game system, which nobody wanted anything to do with after the crash. For example, the design of the console was more similar to a VCR than to video game consoles that came before it, and it avoided many of the common terms that video games were typically using. In fact, the packaging of the system never even mentioned the phrase \"video game\" once. Cartridges were instead called \"Game Paks\" and had images from the games on their covers to show off the console's arcade-like graphics. This was important, as arcades were not affected by the crash and became popular again because of the crash. Category:1983 in North America",
 "title": "North American video game crash of 1983"
}