{
 "id": "1155056",
 "text": "Otzma Yehudit is a religious Zionist party in Israel, founded on November 13, 2012 by former Members of Knesset (Israel's parliament) Aryeh Eldad and Michael Ben-Ari, with the former being a secular Jew and the latter an Orthodox Jew. ==Overview== Due to the party's strong defense of Zionism, many accuse the party of being \"far-right\" and \"anti-Arab\". * * * * * * Critics say that the Otzma Yehudit is a successor to the Kach party banned in Israel, one of whose famous followers was American-Israeli Baruch Goldstein, * * * * * * who was responsible for the 1994 Cave of the Patriarchs shooting in which 30 (including Goldstein) were killed and 125 wounded. The current leader of the Otzma Yehudit is Itamar Ben-Gvir (Hebrew: אִיתָמָר בֶּן גְּבִיר), a Kurdish Jew serving as the Minister of National Security of Israel. * * * * * ==Ideology== The Otzma Yehudit believes some of these ideas: * Israeli Jewish children shall be taught to love Israel * Jews shall settle in every region of the Land of Israel * Compromises shall not be made with the enemies of Israel * Israeli Jewish children shall be educated on Jewish history, heritage and tradition * The national defence policy shall be moved from the defensive to the offensive to crush the enemies of Israel * Diaspora Jews shall be encouraged to immigrate to Israel (aliyah, Hebrew: עלייה) to keep the Jewish majority of Israel's population ==Election results== Election Leader Votes % Seats +/– Status 2013 Aryeh Eldad 64,782 1.76 2 2015 Michael Ben-Ari Part of the Yachad Part of the Yachad – April 2019 Michael Ben-Ari Part of the Union of Right-Wing Parties (URWP) Part of the Union of Right-Wing Parties (URWP) – September 2019 Itamar Ben-Gvir 83,609 1.88 – 2020 Itamar Ben-Gvir 19,402 0.42 – 2021 Itamar Ben-Gvir Part of the Religious Zionist Party (RZP) Part of the Religious Zionist Party (RZP) 1 2022 Itamar Ben-Gvir Part of the Religious Zionist Party (RZP) Part of the Religious Zionist Party (RZP) 5 ==Leaders== Leader Took office Left office Aryeh Eldad 2012 2013 Michael Ben-Ari 2013 2019 Itamar Ben-Gvir 2019 Incumbent ==Controversies== Michael Ben-Ari once called left-wing NGOs \"traitors that must be oppressed at any cost [...] internal bacteria [...] enemies of Israel\". Itamar Ben-Gvir is accused of hanging a picture of Baruch Goldstein in his living room, and disrespecting the victims of the Cave of the Patriarchs shooting. Ben-Gvir rejected the accusations: In a consultation with Israel's President Isaac Herzog, Ben-Gvir rejected accusations of racism: On March 23, 2025, Ben-Gvir said in his capacity as Israel's national security minister that Hamas' food reserves and power supply should be bombed due to their failure to release all surviving hostages. He added that there should be no negotiations with Islamist terrorists. ==Related pages== * Likud * New Right * Menachem Begin * Revisionist Zionism * United Torah Judaism * Conservative Judaism ==Footnotes== ==References== Category:Israel Category:Nationalism Category:History of Israel Category:Politics of Israel Category:Political parties in Asia",
 "title": "Otzma Yehudit"
}