{
 "id": "115519",
 "text": "Knocked Up is a 2007 American romantic sex comedy movie. It was directed by Judd Apatow, and stars Seth Rogen as Ben Stone and Katherine Heigl as Alison Scott. She becomes pregnant unintentionally due to a one-night stand with him. == DVD released == Knocked Up: Unrated cut edition DVD is in September 30, 2008. == Music == Strange Weirdos: Music From and Inspired by the Film Knocked Up, an original soundtrack album, was composed for the film by folk singer- songwriter Loudon Wainwright III and Joe Henry. However, the movie's lead song \"Daughter\" was written by Peter Blegvad. In addition to Wainwright's tracks, there were approximately 40 songs featured in the motion picture that were not included on the official soundtrack on Concord Records.'SoundtrackINFO: Knocked Up soundtrack'. Soundtrackinfo.com. September, 2007. Retrieved September 29, 2007. Some of the songs featured in Knocked Up are: *\"We Are Nowhere and It's Now\" – Bright Eyes (feat. Emmylou Harris) *\"All Night\" by Damien Marley *\"Stand up tall\" by Dizzee Rascal *\"Rock Lobster\" by The B-52's *\"Gives You Hell\" by The All-American Rejects *\"Police On My Back\" by The Clash *\"Biggest Part of Me\" by Ambrosia *\"Smile\" by Lily Allen *\"Girl\" by Beck *\"King without a Crown\" by Matisyahu *\"Toxic\" by Britney Spears *\"Santeria\" by Sublime *\"Tropicana\" by Ratatat *\"Shimmy Shimmy Ya\" by Ol' Dirty Bastard *\"Love Plus One\" by Haircut One Hundred *\"Rock You Like a Hurricane\" by Scorpions *\"Reminiscing\" by Little River Band *\"Ashamed\" by Tommy Lee *\"Swing\" by Savage (featured in the menu section of the DVD) *\"Shame on a Nigga\" by Wu- Tang Clan (used in the film's trailer) *\"Grey in LA\" by Loudon Wainwright III *\"End of the Line\" by Traveling Wilburys (used in the film's trailer) ==References== ==Other websites== * Movie website * * Category:2007 romantic comedy movies Category:2000s sex comedy movies Category:American romantic comedy movies Category:American sex comedy movies Category:2000s English- language movies Category:Movies about couples Category:Movies about drugs Category:Movies about sisters Category:Movies set in Los Angeles Category:Pregnancy movies Category:Universal Pictures movies Category:Movies directed by Judd Apatow",
 "title": "Knocked Up"
}