{
 "id": "1155958",
 "text": "The orange-striped poison frog, three-striped arrow frog, or three-striped arrow poison frog (Ameerega trivittata) is a frog. It lives in Guyana, Venezuela, Colombia, Peru, Bolivia, Suriname, and Brazil. Scientists think it could also live in French Guiana and Ecuador. ==Body== These frogs are about 35 mm long from nose to rear end. The biggest male frogs are 42 mm long and the biggest female frogs are 50 mm long. This is one of the biggest frogs in Dendrobatidae. This frog has no teeth. The legs are yellow-green to green- brown in color. The back legs have black spots. The backs of the back legs are black with blue spots. The belly is black with some green or blue marks. All four feet are green with blue spots. The four legs are dark green. This frog has two stripes on each side of its body. One stripe is green to yellow in color and goes from the nose to the back legs. The other stripe is white- yellow in color and goes from the eye to the back legs. The iris of the eye is dark brown in color. ==Home== This frog is awake during the day. The frog can live in different kinds of places. Scientists have seen it on the ground in forests that have never been cut down and forests that were cut down and are growing back. They have seen it in grassland forests too. Scientists saw the frog between 20 and 680 meters above sea level in some places and between 500 and 1300 meters above sea level in other places. One of the places the frog lives is a protected parks: Parque Nacional Cordillera Azul. ==Young== The adult male frogs fight over good places and the female frogs do not. The female frog lays her eggs on the dead leaves on the ground. The male frog watches the eggs. The frogs take 14 to 17 days to hatch. After the eggs hatch, the male frogs carry the tadpoles to pools of water that dry up for part of the year. The tadpoles take 41 to 54 days to become frogs. Younger frogs have two green-yellow stripes and big spots where the legs meet the body. ==Danger== Scientists say this frog is not in danger of dying out. Humans do cut down trees to get wood to build with. People also catch this frog to sell as a pet. ==References== Category:Frogs of South America Category:Poison dart frogs",
 "title": "Ameerega trivittata"
}