{
 "id": "1155564",
 "text": "The Cadillac XLR is a two door Sports car made by Cadillac from 2003 until 2009 it was known for many resources like its roof that can be folded and automatically interior parts designed by Bulgari it was Cadillac`s main car the XLR made its debut on the North American International Auto Show in 2003 and started being produced as a 2004 model it was inspired in the 1999 concept Evoq The XLR was the first Cadillac to have radar-based adaptive cruise control (ACC). It was also the first Cadillac to offer both heated and cooled seats. http://www.prnewswire.com/news-releases/delphis-adaptive-cruise- control-technology-featured-on-cadillac-xlr-71376412.html Delphi's Adaptive Cruise Control Technology Featured On Cadillac XLR The XLR also had a special feature which is a power retractable hardtop, which could fold down automatically. In 2004, the XLR was nominated for the North American Car of the Year award. == Features == The XLR was sold as a luxury sports car and had many features, including: A touchscreen GPS with AM/FM radio, CD player, XM Satellite Radio, and voice control. A Bose audio system. Adaptive cruise control. Bulgari-designed instrument panel. OnStar (a car help service). HID front headlights. Luxury leather seats that could be adjusted, heated, and cooled. The driver's seat had a memory system. Carpet floor mats with \"XLR\" logos. Aluminum wheels. Wood interior trim. The XLR had an adaptive suspension system and The system used special fluid in the shock absorbers that could change quickly to adjust to the road. This system, called Magnetic Ride Control, used sensors to measure the road and adjust the suspension almost instantly. the XLR also had a 4.6L V8 engine, which could be supercharged in the XLR-V model. It had either a five-speed or six-speed automatic transmission. The XLR produced 320 horsepower and 310 lb-ft of torque in the standard version. Some optional features included different wheels, colors, and interior trims. The XLR had a front grille with a silver-painted \"Egg Crate\" design or chrome wire mesh in the XLR-V model. This design was similar to grilles used on cars in the 1930s. In 2009, the XLR got a new front and rear design, and chrome side vents. The inside was updated with a new headliner made of Alcantara, a soft material, and new dashboard trim. When it was first sold, the base price of the XLR was $75,385, which is about $121,547 today. By the end of production, the price increased to $86,215, or about $122,007 today. ==Similarity== Some people think the Cadillac XLR is just a version of the Chevrolet Corvette C6, because both were made at GM's Bowling Green factory. However, the XLR actually came out a year before the Corvette C6. Both cars share the same GM Y platform and have similar frame and body construction. But they are different in many ways, such as their engines, bodies, interiors, and suspension settings. ==XLR-V== The Cadillac XLR-V is a high-performance version of the XLR. It was part of the first generation of Cadillac’s V-Series cars. The XLR-V was first shown to the public in a Super Bowl commercial on February 6, 2005. It was officially introduced at the 2005 New York International Auto Show. The XLR-V had a supercharged Northstar LC3 V8 engine, similar to the engine in the STS-V. This engine produced 443 horsepower (330 kW) and 414 lb-ft (561 N⋅m) of torque. The car also had a six- speed automatic transmission, larger brakes from the Corvette Z51, and 19-inch wheels. The XLR-V could go from 0 to 60 mph (97 km/h) in 4.6 seconds, according to tests by Car and Driver. It could reach 100 mph (160 km/h) in 11.3 seconds and run a quarter mile in 13.0 seconds at 110 mph (180 km/h). Its top speed was electronically limited to 155 mph (249 km/h). ==Markets== The Cadillac XLR was sold mainly in North America however it was also sold in Europe Middle East Australia and Japan. ==Discontinuation== The Cadillac XLR was discontinued in 2009 after six years of production. The production of the XLR ended on March 31, 2009, and the car was no longer sold after that date. Cadillac stopped making the XLR because the sales were lower than expected, and the company decided to focus on other models. ==References== Category:Cadillac Automobiles",
 "title": "Cadillac XLR"
}