{
 "id": "115536",
 "text": "Ratatouille (; French: ) is a 2007 animated movie directed by Brad Bird. It stars Patton Oswalt, Lou Romano, Peter Sohn, Brad Garrett, Janeane Garofalo, Ian Holm, Brian Dennehy and Peter O'Toole. The movie is about a rat who wants to become a chef. He befriends a human who works at a restaurant in Paris. It was made by Pixar Animation Studios and it was distributed by Walt Disney Pictures. Jad Pinkava actually wrote the original ideas in 2001, but in 2005 Brad Bird was asked to direct the movie instead. He and some crew members also visited France to get some new ideas. The crew consulted (took advice of) chefs from France and the United States. It premiered on June 22, 2007 at the Kodak Theater. It was generally shown in other theaters on June 29 2007. It earned $623.7 million at the box office and got good reviews. It won the Academy Award for Best Animated Feature. ==Plot== Remy, a young rat, lives in the French countryside on the outskirts of Paris with his father, Django, his brother, Emile, and a clan of rats, in the attic of the house of an old retired lady. Unlike his family members, Remy is a great admirer of French cuisine. Thanks to its very fine sense of smell, the young rat instinctively knows the ingredients to add to dishes to make them better and more subtle. That's why he sneaks into the kitchen in the evening to read a cookbook by Michelin-starred chef Auguste Gusteau, who died recently after losing one of his stars to a food critic, Anton Ego, who opposed Gusteau's fundamental idea that \"anyone can cook.\" One evening, Remy, accompanied by his brother, is concocting a recipe when the owner of the house catches them in the act and forces them to flee. Separated from his family and alone in the sewers, Remy talks in a dream with Gusteau, who consoles him and guides him to his restaurant. He runs into Alfredo Linguini, a young kitchen assistant who has been in charge of the garbage since Skinner, the new chef, learned that he was the son of Gusteau's girlfriend. While Linguini accidentally spills a soup while mopping, he tries to catch it and is about to ruin it, Remy infiltrates the kitchen to save the dish using his talent, but Linguini sees him and locks him under a colander. Skinner in turn notices Linguini next to the soup and then comes to reprimand him: he should not be in charge of preparing the dishes, as he has no training as a cook. A few minutes pass, and the soup is served to Solène Leclerc, a food critic. Skinner, noticing that the soup served was the one that Linguini had modified, tries to intercept it, but fails. He is about to fire the young commis when the critics, delighted by the appetizing soup, send the chef their congratulations. Linguini was then assigned to the preparation of soups. Meanwhile, Remy, who has managed to escape from the colander, is captured and locked in a jar by cooks. It is Linguini who is charged with the task of getting rid of it. But as he is about to throw him into the Seine, he realizes that the rat understands his words and that he can help him. They then agreed to work together. Colette, a young cook, is in charge of Linguini's apprenticeship but Skinner, still determined to get rid of him, asks the latter to prepare a soup again, certain that the clerk will not succeed. The next day, the rat trains himself to direct Linguini, pulling his hair, hidden under his chef's hat. The clerk, succeeding in his tasks, is seized with the desire to reveal his secret to Colette, but the little rat opposes it and forces him to kiss him instead. Linguini and Colette then realize thanks to Remy that they are in love with each other and start a relationship. Remy discovers by chance that Linguini is Gusteau's son and manages to barely recover the evidence of this filiation from Skinner's clutches. Linguini then becomes the legitimate chef of the restaurant and decides to reveal his secret to the other cooks. Shocked that he owes his talent to a rat, everyone decides to leave him, including Colette, the same evening that the horrible critic Anton Ego visits them. Distraught, Linguini doesn't know what to do. But Remy's family, who owed him a debt, came to lend him a hand. In the restaurant's kitchens, many little rats share the tasks of preparing the dishes, while Linguini provides service. Remy decides to prepare a ratatouille (Confit byaldi) for the critic. During the tasting, the profusion of flavors brings back the memory of the ratatouille of his childhood. Captivated, he wants to thank the chef, but Linguini admits that it was a rat who prepared the dish. The day after the meal, the critic published a laudatory article about Linguini and his mysterious little cook without revealing the exact nature of the meal. But the hygiene services, warned by Skinner of the presence of rats in the establishment, close the restaurant and Ego loses his job and his credibility as a food critic. With the help of Colette, who in the meantime had read Auguste Gusteau's book Tout le monde peut cuisiner, Linguini opened a new restaurant called La Ratatouille, in honor of the one served to Ego. He takes care of the service, leaving the kitchen to Colette and Remy. The film ends with Ego being served, very happy to come back to eat in this new restaurant and patiently waiting for the chef to prepare a dessert that will surprise him as he wishes, while outside, an imposing queue of people wait in front of the new restaurant. ==Characters== *Alfredo Linguini - A chef. *Colette Tatou - A chef. ==Cast== * Patton Oswalt as Remy * Ian Holm as Jonah Robert Skinner * Daniel Butler as Alfredo Linguini * Brian Dennehy as Django * Peter Sohn as Emile * Peter O'Toole as Anton Ego * Brad Garrett as Auguste Gusteau * Janeane Garofalo as Colette Tatou * Will Arnett as Lucien Horst * Will Smith as Lalo Salamanca * Jack Black as John Larousse * Brian Ray Norris as Mustafa * Teddy Newton as Talon Labarthe, the lawyer * Tony Fucile as Health Inspector/Patrick Pompidou * Julius Callahan as Francois * Jake Steinfeld as Git * Brad Bird as Ambrister Minion * Lou Romano as Health Inspector * Stéphane Roux as Narrator * Jack Bird as a Teen Rat * Andrea Boerries as a Street Woman * Marco Boerries as Food Snob #3 * Lindsey Collins as an Abusive Girlfriend * Thomas Keller as Food Snob #1 * Brad Lewis as an Abusive Boyfriend * Lori Richardson as Food Snob #2 * James Remar as Henry Sylvio * Carlos Alazraqui as Chef #2 * Bob Bergen as Food Snob #4 * Debi Derryberry as Solene LeClaire * Sherry Lynn as Customer #2 * Jason Marsden as Chef #1 * Mickie McGowan as Food Snob #5 * Frank Welker as Chef #3 * John Ratzenberger as Costomer #3 == Soundtrack == # Le Festin by Camille # That's Amore by Dean Martin # Non, je regrette rien by Édith Piaf # A New Day Has Come by Celine Dion # Excuse My French by 2Be3 == References == ==Other websites== * Category:2007 computer-animated movies Category:Movies about animals Category:Movies composed by Michael Giacchino Category:Movies directed by Brad Bird Category:Movies set in Paris Category:Movies that won the Best Animated Feature Academy Award Category:Pixar movies",
 "title": "Ratatouille (movie)"
}