{
 "id": "11557",
 "text": "The Passion of the Christ is the title of a movie that was produced and directed by Mel Gibson based on sister Catherine Emmerich's visions. It was released in 2004. The movie shows the last 24 hours in the life of Jesus of Nazareth (called by his followers Jesus Christ) as told in the Gospel accounts contained in the New Testament that Christians regard as a part of the Holy Bible. The Passion of the Christ was unusual and controversial for many reasons. All of the speech was in three languages that were spoken at the time of Jesus: Latin, Greek and Hebrew. The movie spent a lot of time showing details of the suffering and death of Jesus, with lots of violent scenes. Mel Gibson said that this was a realistic showing of what happened, though others thought it showed too much violence. Jewish groups and Christians objected to the movie because it showed the Jewish leaders arranging to have Jesus killed. There were also other depictions in the film of Jews that many Jews and Christians felt was controversial. They said that this would cause people to think that modern-day Jews were guilty because of this and increase antisemitism and inaccurate beliefs of Jews. The movie makers said that this was not their intention, however criticism from both sides continued and still persists to this day. Mel Gibson was unable to get support from movie studios for this movie, and so supplied the money for it (around $25 million) mostly himself. The movie made much more money than expected -around $370 million. ==References== == Other websites == * Category:2004 drama movies Category:2000s epic movies Category:2000s historical movies Category:American drama movies Category:American epic movies Category:Fiction set in the past Category:Movies set in Ancient Rome Category:Movies set in Jerusalem Category:Movies based on the Bible Category:Movies about capital punishment Category:Multilingual movies Category:Movies directed by Mel Gibson Category:Movies set in the 1st century Category:Controversies",
 "title": "The Passion of the Christ"
}