{
 "id": "1155944",
 "text": "S.T.A.L.K.E.R. is a series of FPS games developed by GSC Game World since 2007. == Video games == Year Title Platforms 2007 S.T.A.L.K.E.R.: Shadow of Chernobyl Windows, Xbox One, PlayStation 4, Nintendo Switch 2008 S.T.A.L.K.E.R.: Clear Sky Windows, Xbox One, PlayStation 4, Nintendo Switch 2009 S.T.A.L.K.E.R. Call of Pripyat Windows, Xbox One, PlayStation 4, Nintendo Switch 2024 STALKER 2: Heart of Chornobyl Windows, Xbox Series X/S == Plot == The game is set in a 30-kilometer “Zone” included in the vicinity of Chernobyl' after the related disaster in Ukraine. In a post-apocalyptic future a strange new phenomenon affects the area making it more contaminated than before. The army surrounds the zone of alienation, preventing all access. However, many still settle in despite the dangers: some in search of fortune, some to escape the world, and some to take advantage of the situation and plunder. These individuals are generically referred to as S.T.A.L.K.E.R. The name, the same as in the series, means “Scavengers Trespassers Adventurers Loners Killers Explorers Robbers” (“jackals transgressors lonely adventurers murderers explorers robbers”). There are various unexplained anomalies in this area, which are becoming more and more widespread toward the center. These anomalies produce, for example, perpetual fires, changes in gravity and pressure, electric shocks originating out of nowhere, etc., flanked by a very high level of radiation. In addition to this there are also plants, animals and even mutated people, which are very often dangerous. Within the territory, various factions of Stalkers begin to form with various goals in mind; in addition, small groups of scientists and military personnel are established in the Zone, attempting to regain control. It is in this context that the plots of the titles in the series take place, where the player takes control of a character (different for each title) and gets to learn about and explore the Zone and its events. == Characteristics == The first title and consequently the subsequent ones were partly loosely inspired by Andrei Tarkovsky's 1979 film Stalker, itself a free interpretation of the short story Picnic by the Roadside, written by the two Russian brothers Arkadij and Boris Strugackij in 1972, which deals with “Zones” in which strange phenomena and anomalies mysteriously appear. Many of the settings were produced based on the actual areas of the city of Chernobyl' from its power plant and surrounding areas such as the Red Forest. Part of the development team physically traveled to the site for this. The titles possess many of the characteristics of first- person shooters: a value of life, curable through medical kits or other items, precision or crosshair aiming, typical shooter combat. Many elements, on the other hand, are peculiar to role-playing and adventure video games: presence of an inventory with a limited maximum weight, equipment with armor and other miscellaneous items, money management and buying and selling, multiple-choice character dialogues, management of additional values inherent in character health such as radiation, burn, telepathic, electrical, toxic and hemorrhagic damage levels. The character impersonated by the player possesses almost total freedom to roam the game's large maps, sometimes being able to choose to carry out side missions or simply explore the terrain freely. A vast arsenal of firearms and grenades is available in the three chapters. The three developed products make use of the X-Ray graphics engine, which handles volumetric light and environmental effects, among other things. There are also atmospheric effects, such as rain, and low reflections produced by sun. == References == == Other websites == * Category:Post-apocalyptic video games Category:Windows games Category:Survival horror video games",
 "title": "S.T.A.L.K.E.R."
}