{
 "id": "1155110",
 "text": "Oasis is a proof of concept that seeks to recreate the look and gameplay of the 2011 video game Minecraft, using generative artificial intelligence. The project, whose development began in 2022 between artificial intelligence company Decart and computer hardware startup Etched, was released by Decart to the public on 31 October 2024. The game was released to a huge audience, and the website hosting the game almost crashed within 24 hours of its release. However, reactions were overwhelmingly mixed, as the game seemed to show no coherent logic in its actions or scenario. Some argued that the unpredictability of the AI made the game fun to watch and play. == Creation and gameplay == The \"proof-of-concept\" demo version of the game was created by San Francisco- based Israeli artificial intelligence developer Decart and Silicon Valley computing hardware startup Etched, and funded by a $21 million grant from Israeli-American billionaire Oren Zeev and New York-based firm Sequoia Capital. The idea for the project originated from Harvard University graduate and Etched co-founder Robert Wachen and Israel Institute of Technology graduate and Decart co-founder Dean Leitersdorf after they met in 2022 and shared a common interest in the uses of OpenAI 's GPT-3. The game is named after the science fiction novel and film Ready Player One. It was announced and released to the public for free on October 31, 2024 by Decart, and claimed to be the first AI-playable open-world model game. The game aimed to replicate the gameplay style of the 2011 sandbox game Minecraft by using exclusively generative artificial intelligence, without using coding in the process. The AI that runs the game was trained by watching millions of hours of online Minecraft gameplay footage. This collected information was used to run \"next frame prediction\", which attempts to anticipate what the players next action will be from keyboard and mouse inputs based on previous video, in an attempt to simulate real-time gameplay and the game's physics and controls. == References == == Other websites == * * Official Demo Category:Minecraft Category:Generative artificial intelligence Category:2024 video games Category:Articles with unsourced statements",
 "title": "Oasis (artificial intelligence)"
}