{
 "id": "1155886",
 "text": "Pauk Ko Taw (; , also known as Ashin Ariawuntha (; ) is a Buddhist monk from Myanmar. He is involved in both religious and political movements and is a member of Ma Ba Tha, an organization advocating for Buddhist causes in Myanmar. His activities and views have received differing reactions from various groups. == Early life and ordination == Pauk Ko Taw was born in Myanmar and adopted the monastic name Warthawa early in his religious life. Details about his early years and training remain limited, as he is primarily recognized for his later public and political roles. == Involvement with Ma Ba Tha == Pauk Ko Taw is an active member of Ma Ba Tha, an organization promoting the protection of Buddhism in Myanmar. While some supporters praise its efforts to preserve Buddhist culture, others criticize its rhetoric for potentially fostering religious divisions. Reports from organizations such as Frontier Myanmar and Burma Human Rights Network discuss the group’s impact on Myanmar’s socio-political landscape. == Support for the military Junta == After the 2021 military coup in Myanmar, Pauk Ko Taw publicly supported the military government. This position has drawn support from pro-military groups but criticism from human rights organizations and other observers who highlight the military’s alleged human rights abuses. International organizations like Progressive Voice Myanmar and Amnesty International have voiced concerns about the broader implications of his alignment with the junta. == Connections to Pyu Saw Htee militias == Pauk Ko Taw has been linked to Pyu Saw Htee militias, which are pro-military paramilitary groups. These militias have been accused of involvement in violence and human rights abuses. Human rights groups such as Burma Human Rights Network and Frontier Myanmar have criticized these associations, arguing that they contribute to ongoing conflicts. == Influence and criticism == Pauk Ko Taw is a notable but divisive figure in Myanmar. His supporters commend his dedication to Buddhist values, while critics view his stances as exacerbating religious and ethnic tensions. Organizations such as Al Jazeera and the International Crisis Group have raised concerns over his influence in Myanmar’s political and humanitarian crises. == References == Category:Burmese people Category:Buddhist monks Category:Living people Category:Year of birth missing (living people) Category:Pages created with the Article Wizard from 2024",
 "title": "Pauk Ko Taw"
}