{
 "id": "1155491",
 "text": "Short n' Sweet is the sixth studio album by American singer Sabrina Carpenter. Released on August 23, 2024, it contains the US Billboard Hot 100 number one hit \"Please Please Please\" and the lead single \"Espresso\". It is Carpenter's most successful album to date. On June 3, 2024, Carpenter announced the release of her sixth studio album Short n' Sweet via Instagram. On August 23, 2024, the album was released. It was accompanied by the premiere on YouTube of Carpenter's third single from the album, \"Taste\". The album was critically acclaimed, with music critic website Pitchfork awarding it with a score of 8.0 out of 10. The album reached number one on Billboard 200, spending four weeks on top of the chart. It was most praised for its wit and sense of humor, whether it be at Carpenter's own expense, such as shown in the lyrics of Please Please Please-- \"I know I have good judgement, I know I have good taste / It's funny and it's ironic that only I feel this way\", or sneaky innuendos, such as within the lyrics of the album's foruth single, Bed Chem-- \"Come right on me, I mean camraderie\". Each single performed well, granting Carpenter her first, second and third UK number ones with \"Espresso\", \"Please Please Please\" and \"Taste\" and allowing her to score her second, third and fourth Billboard Pop Airplay number ones with the same three songs. == Short n' Sweet Tour == On June 18, 2024, Carpenter revealed that she would be embarking on a tour to support the album. The Short n' Sweet Tour's setlist contained many songs from the album, such as Espresso, Bed Chem, and the ever-controversial Juno. During the tour, Carpenter faced backlash due to the subject of Juno, which discusses craving sex and being 'knocked-up'. The song references the 2007 Elliot Page/Michael Cera movie of the same name, as well as the scandalous sexual position Carpenter would mimic to the lyric, \"Have you ever tried this one?\", which was changed every night of the tour as a tradition. On social media, Carpenter faced a fair amount of backlash for these positons, commonly referred to by fans as the \"Juno positions\". == References == Category:2024 albums Category:Sabrina Carpenter",
 "title": "Short n' Sweet"
}