{
 "id": "1156085",
 "text": "Anna Volodymyrivna Sedokova (born 16 December 1982) is a Ukrainian singer, actress, and television presenter. She is known for being a member of the girl pop group Nu Virgos. She played Diana in the 2011 Russian comedy movie The Pregnant. ==Personal life== Sedokova was born in Kiev, Ukrainian SSR, Soviet Union (now Kyiv, Ukraine) in 1982. She studied at Kyiv National University of Culture and Arts. She continued her studies while also hosting television shows. Sedokova married Belarusian footballer Valyantsin Byalkevich in 2004. The couple divorced in 2006. They had one daughter. Sedokova was married to businessman Maxim Chernyavsky from February 2011 to February 2013. They had one daughter. In May 2017, Sedokova was engaged to businessman Artyom Komarov. They had a son. In August 2017, Sedokova announced that she had ended her relationship with Komarov. In September 2020, she married Latvian professional basketball player Jānis Timma. In late 2024, Sedokova filed for a divorce from Timma. On 16 December, Timma committed suicide on Sedokova's 42nd birthday. In December 2010, Sedokova came out as bisexual. ==Singles== List of singles as lead artist, with selected chart positions, showing year released and album name Title Year Peak chart positions Album CIS countries UKR RUS \"Moyo serdtse\" 2006 — — — rowspan=\"13\" \"Samaya luchshaya devochka\" 2007 — — — \"Privykayu\" 2008 13 61 1371 \"Mesyats may\" 2009 — — — \"Tango\" — — — \"Drama\" 123 512 1122 \"Love U\" 2011 174 84 443 \"Taxi\" 2012 225 732 766 \"Chto ya nadelala\" 167 37 420 \"Nebezolasno\" 2013 — — — \"Udali\" — — — \"Samyy luchshiy\" 158 47 1266 \"Mezhdu nami\" 158 95 538 \"Serdtse v bintakh\" — — — Lichnoe \"Dotron'sya\" 2014 168 70 808 rowspan=\"2\" \"Piranyi\" — — — \"Tishe\" 2015 — — — Zvuchit \"Poka, milyy\" — — — \"O tebe\" 2016 195 446 1529 Lichnoe \"Ya budu\" 155 645 318 \"—\" denotes items which were not released in that country or failed to chart. ==Notes== ==References== ==Other websites== * Category:1982 births Category:Living people Category:Actors from Kyiv Category:Ukrainian movie actors Category:Ukrainian television actors Category:Ukrainian voice actors Category:Television news anchors Category:Television personalities Category:Ukrainian models Category:Pop singers Category:LGBT singers Category:LGBT actors Category:LGBT models Category:Bisexual people",
 "title": "Anna Sedokova"
}