{
 "id": "1156952",
 "text": "Genesis Motor LLC commonly known as Genesis is a Korean Luxury car brand owned by Hyundai it was launched as a model named Hyundai Genesis in 2015 it became a independent brand and its first model the Genesis G90 was launched in 2017. == History == Hyundai revealed the Concept Genesis in 2003 and the Hyundai Genesis was introduced in 2007 as a \"progressive interpretation of the modern rear-wheel drive sports sedan\". the design of the body took 3 years the total cost of the program of development was 500 million dollars. The reliabillity was tested and it reached 800.000 miles. It Also existed a internal debate about whether if the Genesis should be sold as a Hyundai or become a independent brand either as a separate dealership or through Hyundai stores and the Genesis was launched as a Hyundai car in North American International Auto Show in 2008. In 2015 Hyundai`s United States spokesman Chris Horsford cited three main reasons to make Genesis a independent brand: * Hyundai Genesis experienced success in seven years in the luxury car market * it ranked among the top 3 segment sellers * Customers showed a interest in a independent genesis division In December 2015 Genesis Motor launched its first car the G90 that is sold in South Korea as the Genesis EQ900. in the United States Genesis was launched in 2016 with the G80 and G90. And in May 2021 it was launched in Europe alongside the launch of the Genesis G70 Shooting Brake. == Models == Model Current generation Note Global sales (2021, by units) Image Name Introduction ( year) Introduction ( year) Model code G70 2017 2017 IK 19,937 G80 2016 2020 RG3 Successor to the Hyundai Genesis. 64,182 Electrified G80 2021 2021 RG3 EV 1,384 G90 2015 2021 RS4 Successor of the Hyundai Equus. Marketed as the Genesis EQ900 until 2019. 7,216 GV60 2021 2021 JW Based on the Hyundai E-GMP platform shared with Hyundai Ioniq 5 and Kia EV6. 1,214 GV70 2020 2020 JK1 59,410 Electrified GV70 2022 2022 JK1 EV – GV80 2020 2020 JX1 48,072 ==Concept Models== Genesis concept vehicles Car Image Debut Class Show Production Vision G 2015 Coupe Pebble Beach G90 New York 2016 Sedan New York G70 GV80 2017 Luxury SUV New York GV80 Essentia 2018 Grand tourer (S) New York — Mint 2019 City car New York — X 2021 Coupe/GT Los Angeles — X Speedium Coupe 2022 Coupe/GT New York — X Convertible 2022 Convertible Los Angeles - Genesis X Gran Berlinetta 2023 Coupe/GT Gran Tursimo World Final 2023 - Neolun 2024 Full-size crossover SUV New York - Genesis X Gran Racer 2024 Coupe/GT Busan International Mobility Show 2024 - == References == Category:Automobile brands Category:Automobile companies",
 "title": "Genesis Motor"
}