{
 "id": "1156856",
 "text": "On 20 December 2024, a man drove a car into a crowd at a Christmas market in Magdeburg, Germany. At least two people were killed and 68 were injured. The driver of the car was arrested, shortly afterwards. After the attack, the Chrismas market was terminated, earlier than expected. As of 21 December 2024, five victims have reportedly died and 200 have been injured, * * * * * while the motivations for the attack remain unclear. ==Events== On 20 December 2024, a suspected terrorist attack happened in Magdeburg, Germany when a black BMW drove into a crowd at a Christmas market. At least two people were killed and 68 wounded. * * * * * The car had been rented. ==Aftermath== ===Suspect=== ====Background==== Local officials reported that the suspect was a doctor of Saudi Arabian origin, who has been staying in Germany since 2006.* * * * * The attack has been the worst mass casualty event in Germany since the Berlin truck attack on 19 December 2016. * * * ====Career==== So far, no known extreme religious affiliations have been linked to the suspect. The suspect is reportedly a psychiatrist, who provided mental healthcare to prisoners, and alleged to be strongly opposed to Islam. * * * The Saudi Arabian government reportedly warned Germany of the suspect. ====Alleged crimes==== The suspect is accused by the Saudi Arabian government of terrorism and human trafficking. He was offered asylum in Germany. Germany declined Saudi Arabian government's repeated extradition requests over human rights concerns in Saudi Arabia. ===Analysis=== A similar attack happened in Berlin on 19 December 2016. Experts criticized the security setup at the location by saying that road blocks were usually placed around where such events were held to prevent car entry and that similar arrangements had not been made for that Christmas market in Magdeburg. ==Motivation== When he was asked after being arrested, the driver said that he was disappointed how the German government handled immigrants from Saudi Arabia. On the day after the attack, the prosecutors said that what the suspect had said about the attack was \"mostly incoherent\" (eher wirr). It was therefore likely that the attacker did not have a political motivation. There also seem to have been cues that point towards psychological problems or a mental illness of the attacker. ==Related pages== * Far-right politics * 2018 Strasbourg shooting ==References== Category:2024 crimes in Europe Category:2024 in Germany Category:December 2024 events Category:Transport disasters in Europe Category:Terrorist incidents in Germany Category:Terrorist incidents in the 2020s Category:Magdeburg",
 "title": "2024 Magdeburg attack"
}