{
 "id": "1156622",
 "text": "Good Night is a Brazilian film by actor and director Paulo Le達o. It was set in 2023. It is entirely in black & white and without dialogue. This is Le達o's first attempt at the horror genre. == Synopsis == During the night, strange sounds surround the home. The homeowner must deal with the situation. They will also face the possible results. == Launch and career == Released in 2023, in a reduced version at the Festival Internacional do Minuto. In 2024, the extended version of the film Good Night was selected for the official selection of the Black & White Film Festival in Toronto, Canada. It won the Award for Best Horror Film. Also in 2024, still in Canada, Good Night was awarded The Best of South American Films at the Toronto SCI-FI/Fantasy Festival. == Production and Cast == The production of Good Night follows the independent film style widely used by director Paulo Le達o, where he combines the roles of actor, director, and screenwriter. Official Selections: * International One Minute Festival 2023 - Brazil * Black & White Film Festival 2024 - Canada * Toronto Fantasy/SCI-Fi Film & Screenplay Festival 2024 - Canada * Lift-Off Sessions 2024 - United Kingdom * Shortverse 2024 - Short Film Platform streaming * Hollywood North International Film Festival 2025 Canada * Lift-Off Filmmakers Sessions 2025 == Awards and nominations == Year Award Category Position Result Ref 2024 Black & White Film Festival - March 2024 Best Horror Film Award Finalist Black & White Film Festival - March 2024 Best Horror Film Award Finalist Toronto SCI-FI/Fantasy Festival - April 2024 Audience Awards Finalist Toronto SCI-FI/Fantasy Festival - April 2024 Best of South American Films Finalist 2025 Hollywood North International Film Festival Best Director - Public Choice Award Finalist ==References== == Other websites == * Category:2024 horror movies Category:Black-and-white movies Category:Brazilian movies Category:Independent movies Category:Movies directed by Paulo Le達o",
 "title": "Good Night (movie)"
}