{
 "id": "1156545",
 "text": "The Chupada rocket frog or sapito ninera del Brasil (Brazilian caretaker frog) (Allobates brunneus) is a frog. It lives in Bolivia, Brazil, and Colombia. Scientists think it could also live in Peru. ==Body== The adult male frog can be 14.8-18.3 mm long from nose to rear end and the adult female frog can be 15.8-19.8 mm long. The skin of the frog's back can be light gray or orange- brown in color. Sometimes there are marks in the shape of a triangle, rhombus, or hourglass. The tops of the front legs are orange-brown in color. The tops of the back legs are gray in color. There are dark stripes on the legs. The male frog has a yellow-green throat and yellow chest and belly with dark spots. The female frog has a white throat with only some yellow color and a white chest and belly. There is a light brown or orange brown stripe down each side of the body. There is a white stripe from the eye to where the back legs meet the body. Part of the iris of the eye is gold in color with black marks. The rest of the iris of the eye is brown in color. ==Home== In Brazil, this frog lives in places where the Buritizais plants grow. This is a type of forest that has buriti palm trees in it, and it is inside Cerrado swamps. In other places, the frog lives near lakes and pools of water that does not move in rainforests. Scientists saw the frog between 140 and 380 meters above sea level. This frog lives in at least two protected parks, Parque Nacional Chapada dos Guimarães and Area de Proteção Ambiental (APA) da Chapada dos Guimarães. Scientists think it could also live in Area de Proteção Ambiental Municipal Aricá-açu. ==Young== The female frog lays her eggs on living leaves that are close to the ground. Sometimes she lays them on new dead leaves on the ground. After the eggs hatch, the adult frog carries the tadpoles to water. The tadpoles are gray-brown in color with brown and silver marks. ==Danger== Scientists say this frog is in danger of dying out. People change the places where the frog lives to make farms (for example big soybean farms), make places for animals to eat grass, and to get wood to make charcoal with, even though taking this wood is against the law. Fires also change the forests. One of the places this frog lives was flooded when people built the Manso Hydroelectrical Plant human-made lake. In some places, people cut down forests to make towns. ==References== Category:Frogs of South America Category:Poison dart frogs",
 "title": "Allobates brunneus"
}