{
 "id": "1156242",
 "text": "Satellite Girl and Milk Cow () is a South Korean animated movie written and directed by Hyeong-yoon Jang. It was released in South Korea on February 20, 2014 and in North America on June 2, 2018 by GKIDS. == Plot == Kyung-chun, an ordinary college student who dreams of becoming a musician, loses his mind when everything in his life, including music and love, doesn't go well. One day, Kyung-chun is transformed into a spotted cow by an unknown magical power, and is chased by Master Oh, who aims for the liver of a human who has lost his mind and turned into an animal, and an incinerator who wants to burn the human who has turned into an animal. Our Star No. 1, which had spent its lifespan in space and was wandering alone with no communication with Earth, becomes interested in the song Kyung-chun was singing and comes down to earth in search of the person who sang the song. However, in the process of coming to Earth, she is accidentally transformed into a woman by the magic of Merlin, a wizard who has become a toilet paper. Afterwards, Kyung-chun, who became a spotted cow, Il-Ho, a human satellite, and Merlin all meet together in Kyung- chun's rooftop room, and the strange cohabitation of the three begins. == Cast == Character Original Actor Dub Actor Kyung-chun/Milk Cow Yoo Ah-in Daniel J. Edwards Il-Ho/KITSAT-1 Jung Yu-mi Ryan Bartley Merlin Donyong Lee Kirk Thornton Mr. Oh Cho Young-bin Cam Clarke Witch of the North Hwang Seok-jeong Julie Ann Taylor Eun-jin Jo Eunseon Shelly Shenoy Landlady Jo Tae-im Jean Brownwell Mr. Byun ¿? Doug Stone ==Features of the work== Jang Hyung-yoon is a graduate of the Korean Academy of Film Arts (KAFA) and is one of the most widely known directors in the Korean independent animation industry, along with Yeon Sang-ho, and is the person who founded the studio 'Now or Never'. Jang Hyung-yoon’s work “has a calm atmosphere and a sweet love story with somewhat awkward-looking pictures and content, and an unpredictable sense of comedy added to it.” He is building his own unique world of work, and in terms of content and characters, this work can be seen as an extension of that. In particular, in this work, Our Star No. 1, Korea's first national satellite, appears as the female protagonist. Regarding the reason for setting Our Star No. 1 as the female protagonist, director Jang Hyeong-yoon said, “Our Star No. 1 is in her early 20s in human terms, weighs about the same as a human, and is a satellite that has lost communication with the Earth and continues to look at the Earth. “I liked that it existed and that I could fly,” he said. The name of the main character, Gyeongcheon, was taken from music director Go Gyeongcheon. Not only the name but also the musician setting is the same. As a work that reflects the lives of modern Korean youth, it is also notable that real-life backgrounds such as the streets of Hongdae, Seoul Tower, and the banks of the Han River appear. ===Relevance to director Jang Hyung-yoon’s previous works=== The setting of a satellite turning into a person is similar to the setting of Jin Young-yeong, the main character in the director's previous work, 'The Private Life of the Murim Ilgum', who takes the form of a vending machine and can transform into a person whenever he wants. In addition, the subject matter of the love story between a satellite that became a human and a person that became a spotted cow is similar to the love story between unusual beings that director Jang Hyung-yoon showed in 'Tea Time' and 'The Private Life of the Murim Ilgum'. In addition, in this work, you can see that various settings, expressions, and characters that appeared in director Jang Hyung-yoon's previous works were brought in. Meanwhile, among Jang Hyeong-yoon's short stories, the 2008 work 'Oh! In the 'Indie Full Film Festival Trailer', a situation setting very similar to the scene in this work appears, and in the 2009 film 'Tomorrow Will Be Ordinary', similarities can be seen in the overall characters, setting, and content. ==OST== 'Beautiful Memories', which was used as the ending song of the movie, is the theme song for the male protagonist Gyeong-cheon, and 'Wait' is the theme song for the female protagonist Il-ho. == References == == Other websites == *",
 "title": "Satellite Girl and Milk Cow"
}