{
 "id": "1156504",
 "text": "The Hungarian Workers' Party (hungarian: Magyar Munkáspárt) is a communist, marxist, leninist political party in Hungary, which is the successor of the Hungarian Socialist Workers' Party. == History == The history of the Hungarian Workers’ Party is closely connected to the political changes after 1989. During this time, Hungary moved from a communist system to a democratic political system. The Hungarian Socialist Workers’ Party (MSZMP), which was the ruling party, dissolved in 1989. Reformist members of the MSZMP created the Hungarian Socialist Party (MSZP), which followed democratic socialism.„Grósz (...) úgy gondolja, hogy a Nyers-féle MSZP formálódását nem szabad megakadályozni, mert így legalább egy »baloldali« párt van. Nyíltan vállalja, hogy 30 napig nem szervez ellenpártot.” In: Thürmer Gyula - Az elsikkasztott ország. 164. oldal. However, some members of the MSZMP wanted to continue the communist ideology. They formed the Hungarian Workers’ Party on December 17, 1989. This new party aimed to represent the working class and preserve the values of state socialism. ===1990s: A New Start and Challenges=== After the transition, the Hungarian Workers’ Party became a small and less influential political force. In the 1990 elections, the party did not enter parliament and remained a marginal group. Its support was mainly from older people and those who felt disadvantaged by the transition to capitalism. ===2000s: Struggle for Survival=== The party has been led by Gyula Thürmer since its foundation in 1989. During this time, the party strongly criticized capitalism and globalization. They campaigned for social justice and better conditions for low-income people, but they could not gain significant public support. ===2010s: Decline in Support=== In the 2010s, the Hungarian Workers’ Party lost even more supporters. Many left-wing voters moved to other political groups like the Democratic Coalition. Despite this, the party continued to participate in elections but failed to win parliamentary seats. === 2020s: Attempts to Modernize === Today (2024), the Hungarian Workers’ Party still exists but remains a minor political force. The party tries to attract new supporters through social media and criticizes neoliberal policies. However, their ideology does not appeal to most young people, making their future uncertain. ==References== Category:Eurosceptic parties Category:Communist parties Category:Political parties in Hungary",
 "title": "Hungarian Workers' Party"
}