{
 "id": "1156931",
 "text": "The Montenegrin–Ottoman War (referred to as the \"Great War\" in Montenegro) was fought between Montenegro and the Ottoman Empire from 1876 to 1877. In 1878 Montenegro won the war. It defeated the Ottoman Empire in the larger Russo- Turkish War of 1877–1878. There were six big battles and 27 small battles, including the important Battle of Vučji Do. A rebellion in nearby Herzegovina sparked a series of rebellions against the Ottomans in Europe. Montenegro and Serbia decided to fight against the Ottomans on June 18, 1876. The Montenegrin people formed an alliance with the Herzegovians. One of the most important battles for the conquest of Montenegro was the Battle of Vučji Do in 1877. Montenegrins fought a fierce battle on the border between Herzegovina and Albania. Prince Nicholas of Montenegro led a counterattack against Ottoman forces from the north, south, and west. He captured Nikšić (24 September 1877), Bar (10 January 1877). 1878), Ulcinj (20 January 1878), Grmožur (26 January 1878), Vranjina and Lesendro (30 January 1878). The war ended when the Ottomans signed an armistice with Montenegro at Edirne on January 13, 1878. Russian troops pressured the Ottomans into signing the peace treaty when On March 3, 1878, this treaty recognized the independence of Montenegro along with the independence of Romania and Serbia. Montenegro's territory also expanded from 4,405 km to 9,475 km. Montenegro captured the cities of Nikšić, Kolašin, Špuz, Podgorica, Žabljak and Bar and was granted access to the sea. ==Background== In October 1874, an important Ottoman official, Jusuf-beg Mučin Krnjić, was murdered in Podgorica, which was then an Ottoman town near the Montenegro border. It is believed that he was killed by a relative of vojvoda Marko Miljanov, a Montenegrin general who likely encouraged the murder. In response, the Ottomans attacked the local population and Montenegrin citizens at the farmers' market in Podgorica, killing an estimated 17 unarmed Montenegrins. This event became known as the \"Podgorica's slaughter\" (Podgorički pokolj), and it worsened relations between Montenegro and the Ottoman Empire. These tensions grew further after the Herzegovina uprising in 1875. Montenegro supported the rebels by giving them military and financial aid and advocating for their cause to the Ottoman government. Montenegro also asked for part of Herzegovina to be given to them, but the Ottomans refused. As a result, Montenegro declared war on June 18, 1876 (or June 30), and soon after, its ally, the Principality of Serbia, joined in. ==War== At the start of the war, when Miljanov arrived in Kuči, a region near the Ottoman border, the Kuči people revolted and attacked the Ottomans. The Ottomans stationed soldiers in several forts, including Medun, Fundina, Koći, Zatrijebač and Orahovo. The Piperi and Kuči tribes joined forces to attack Koći, killing some Ottomans. They also found Ottomans in tower houses and tried to destroy them using wooden cannons. An epic poem about the war describes how Abdi Pasha, a Cherkessian leader with 20,000 soldiers from the Sanjak of Scutari, was sent by the sultan to attack the Kuči and Piperi tribes. The poem describes how part of his army advanced on Koći and fought in Zatrijebač and Fundina. During the Montenegrin-Ottoman War, the Montenegrin army managed to capture some areas and settlements along the border but faced strong resistance from Albanians in Ulcinj and a combined Albanian-Ottoman force in the Podgorica- Spuž and Gusinje-Plav regions. As a result, Montenegro’s territorial gains were limited. \"What one sees over the course of the first ten years after Berlin was a gradual process of Montenegrin (Slav) expansion into areas that were still exclusively populated by Albanian-speakers. In many ways, some of these affected communities represented extensions of those in the Malisorë as they traded with one another throughout the year and even inter-married. Cetinje, eager to sustain some sense of territorial and cultural continuity, began to monitor these territories more closely, impose customs officials in the villages, and garrison troops along the frontiers. This was possible because, by the late 1880s, Cetinje had received large numbers of migrant Slavs from Austrian-occupied Herzegovina, helping to shift the balance of local power in Cetinje's favor. As more migrants arrived, what had been a quiet boundary region for the first few years, became the center of colonization and forced expulsion.\" ; p.254. footnote 38. \"throughout the second half of 1878 and the first two months of 1879, the majority of Albanian-speaking residents of Shpuza and Podgoritza, also ceded to Montenegro by Berlin, were resisting en masse. The result of the transfer of Podgoritza (and Antivari on the coast) was a flood of refugees. See, for instance, AQSH E143.D.1054.f.1 for a letter (dated 12 May 1879) to Dervish Pasha, military commander in Işkodra, detailing the flight of Muslims and Catholics from Podgoritza.\" Some Muslims and Albanians living near the southern border were expelled from Podgorica and Spuž and moved to Shkodër city and nearby areas. ==Notable battles== *Battle of Vučji Do (18 July 1876) *Battle of Fundina (2 August 1876) ==References== ==Sources== * *Спиридон Гопчевић, „Црногорско- турски рат 1876. до 1878. године\". Београд 1963 *",
 "title": "Montenegrin–Ottoman War (1876–1878)"
}