{
 "id": "1156579",
 "text": "Shreya Ghoshal is an Indian playback singer. She is famous for singing songs in many Indian languages like Hindi, Tamil, Telugu, Kannada, and Bengali. She is one of the most popular and successful singers in India. == Early Life == Shreya Ghoshal was born on March 12, 1984, in Murshidabad, West Bengal, India. Her family later moved to Rawatbhata, Rajasthan. Shreya started learning music when she was four years old. Her mother taught her to sing, and she later learned Indian classical music. When Shreya was sixteen, she won the TV singing competition Sa Re Ga Ma. This gave her the chance to become a playback singer in Bollywood. == Career == Shreya Ghoshal's first big break came in 2002 when she sang in the movie Devdas. Her songs \"Dola Re Dola\" and \"Bairi Piya\" became very popular. She won many awards for her performance, including the National Film Award. Since then, Shreya has sung thousands of songs for movies and albums. Some of her famous songs are: * \"Dola Re Dola\" from Devdas * \"Barso Re\" from Guru * \"Deewangi Deewangi\", \"Main Agar Kahoon\", and \"Dhoom Thana\" from Om Shanti Om * \"Teri Ore\" from Singh Is Kinng * \"Deewani Mastani\" from Bajirao Mastani * \"Samjhawan\" from Humpty Sharma Ki Dulhania * \"Tum Kya Mile\" and \"Ve Kamleya\" from Rocky Aur Rani Ki Prem Kahani * \"Ghar More Pardesiya\" from Kalank * \"Sunn Raha Hai Tu\" from Aashiqui 2 * \"Param Sundari\" from Mimi She is known for her sweet and melodious voice. Shreya has worked with many top music directors and composers. == Awards == Shreya Ghoshal has won many awards, including: * National Film Awards * Filmfare Awards * IIFA Awards She has also been honored by several states in India and international organizations for her contribution to music. == Other Work == Shreya has performed in concerts all over the world. She is also a judge on TV singing shows like Indian Idol and Voice of India. She has her wax statue in the Madame Tussauds Museum in Delhi. :) == Personal Life == Shreya Ghoshal is married to Shiladitya Mukhopadhyaya. They got married in 2015. In 2021, they had a son named Devyaan. == Legacy == Shreya Ghoshal is one of India’s most loved singers. Her voice and talent have inspired many young singers. She continues to sing and make beautiful music for her fans.",
 "title": "Shreya Ghoshal"
}