{
 "id": "1156078",
 "text": "In the early modern period, between about 1400 and 1775, around 100.000 people in Europe and British America were accused of witchcraft. The accused were persecuted, and between 40.000 and 60.000 of them were executed. According to the witch-cult hypothesis, these people were targeted because they practiced a pagan religion that had survived the Christianization in Europe. Supposedly, members of this \"witch cult\" gathered on theWitches' Sabbath to perform rites, and also worshiped a horned god of fertility and the underworld. Christian persecutors identified this with the Devil. This theory has since been proven false. However, some people still believe in the witch-cult hypothesis. == History == === Creating the hypothesis === Two German scholars, Karl Ernst Jarcke and Franz Josef Mone, were the first to write about the theory in the early nineteenth century. French historian Jules Michelet, American feminist Matilda Joslyn Gage, and American folklorist Charles Leland later adopted it in that century. The hypothesis became most famous when British Egyptologist Margaret Murray adopted it and presented her version of it in The Witch-Cult in Western Europe (1921). She later wrote about the hypothesis in books (like The God of the Witches in 1931) and in her contribution to the Encyclopædia Britannica. The \"Murrayite theory\" was popular among parts of academia and the general public in the early and mid-twentieth century. However, it was never accepted by specialists in the witch trials, who publicly disproved it through in-depth research during the 1960s and 1970s. === Criticism === Contemporary experts in European witchcraft view the 'pagan witch cult' theory as pseudohistorical. Mainstream academics believe that the people accused of witchcraft (and executed for it) did not share any particular witch religion, pagan or otherwise. Critics also point out other flaws with the theory. It rested on highly selective use of evidence from the witch trials, which heavily misrepresented the events and the actions of both the accused and their accusers. It also mistakenly assumed that claims made by accused witches were truthful, and not distorted by coercion and torture. Further, despite claims that the 'witch cult' was a pre-Christian survival, there is no evidence of such a 'pagan witch cult' throughout the Middle Ages. === Influence === The witch-cult hypothesis has influenced literature. It was adapted into fiction in works by John Buchan, Robert Graves, and others. The theory greatly influenced Wicca, a new religious movement of modern Paganism. It emerged in the mid-twentieth century in Britain and claimed to be a survival of the 'pagan witch cult'. Since the 1960s, Carlo Ginzburg and other scholars have argued that surviving elements of pre-Christian religion in European folk culture influenced Early Modern stereotypes of witchcraft, but scholars still debate how this may relate, if at all, to the Murrayite witch- cult hypothesis. == References == Category:Witchcraft",
 "title": "Witch-cult hypothesis"
}