{
 "id": "1156027",
 "text": "Syed Abbas Irshad Naqvi, known as Khateeb-e-Inqilab, is a Shia orator (Zakir) from Lucknow, India. == Social activities == === Opposition to Homosexuality === In 2009, Abbas Irshad Naqvi participated in a special discussion organized by City Montessori School to express his views on the Delhi High Court's judgment legalizing homosexual behavior. Religious leaders from various faiths collectively criticized the judgment and urged the Supreme Court of India, the Central Government, and state governments to review and reconsider the decision. While addressing the media, Naqvi remarked, \"Homosexual relations will undermine the traditional bonds that we cherish, but we should explore alternative ways to address this issue.\" ==== Opposition to Photo Shoots at Bara Imambara Complex ==== In 2019, Naqvi, along with Shia clerics such as Maulana Kalbe Jawad (Imam-e-Juma of Asafi Mosque), Maulana Agha Roohi, Maulana Saif Abbas (President of the Shia Moon Committee), Maulana Kalbe Sibtain Noori, and Maulana Yasoob Abbas (Spokesperson of the All India Shia Personal Law Board), signed a memorandum demanding the preservation of the sanctity and religious significance of the 235-year-old Bara Imambara complex. ==== Restoration of Imambara Sibtainabad ==== In 2020, Naqvi, alongside other Shia clerics, including Maulana Kalbe Sadiq, Maulana Agha Roohi, Maulana Kalbe Jawad, Maulana Yasoob Abbas, and Maulana Saif Abbas, asked the Archaeological Survey of India (ASI) to conduct an immediate assessment and undertake a time- bound restoration of the Imambara Sibtainabad, a centrally protected monument of historical and cultural importance. == Religious activities == He is a zakir and recites the majalis (religious lectures to commemorate the Martyrdom of Imam Hussain) not only in India but globally, especially in Lucknow, Hyderabad, Kolkata, Bangalore, etc. He is also joint-secretary of All India Shia Personal Law Board. He has written a book on comparative religion titled Aitrafat Sahih Bukhari in Urdu published in 2005. == Related pages == * Islamic scholar * Kalbe Jawad * Kalbe Sadiq * Kalbe Rushaid * Agha Roohi == References == Category:Living people Category:Year of birth missing (living people) Category:Indian Islamic religious leaders Category:Shia Islam",
 "title": "Abbas Irshad"
}