{
 "id": "1156241",
 "text": "The Inseparables is a 2023 computer-animated adventure comedy film produced by nWave Pictures, written by Bob Barlen and Cal Brunker and directed by Jérémie Degruson. It is based on an original story by Joel Cohen and Alec Sokolow. == Synopsis == This animated buddy movie follows the misadventures of Don, a runaway puppet with a boundless imagination, and DJ Doggie Dog, an abandoned stuffed animal toy in need of a friend, as they cross paths in Central Park and pair up against all odds for an adventure of friendship in New York City. The feature is set to be a journey between reality and fantasy, delivering an uplifting message about the emancipating power of imagination and friendship. == Cast == * Monica Young as Dee * Danny Fehsenfeld as Dragon * Olivier Paris as Pat * Jordan Baird as DJ Doggy Dog * Art Brown as Morty the Pigeon * Dakota West as Don * Donte Paris as Alfonso == Production == === Development === In May 2022, nWave Pictures president and CEO Matthieu Zeller announced that A Contracorriente was co-producing nWave's new animated feature film The Inseparables based on a story created by Joel Cohen and Alec Sokolow. Its screenplay, on the other hand is the work of Bob Barlen and Cal Brunker. Matthieu Zeller confirmed that nWave Pictures and Scanbox had closed a deal making Scanbox the only distributor for Scandinavian countries for nWave's three next movies: “We’re proud to bring our collaborations with trustworthy European distributors one step further through this multi-year agreement with our Scandinavian partner Scanbox”. On October 25, 2022, Variety published the first production still of The Inseparables. The picture shows the two main protagonists, Don and DJ Doggie Dog. The article also announced that nWave Pictures had officially launched international sales for the project at the American Film Market with a five-minute promo reel. The teaser for The Inseparables was released online on April 28th, 2023, in both English and French on all of nWave Pictures' social media platforms. The studio also unveiled the film's official poster on which both main protagonists can be seen back to back admiring Manhattan's night sky. On the same day, it was announced that the film would be having its world premiere at the 2023 edition of the Annecy International Animation Film Festival following its selection in the event’s official competition under “Feature Film” category. Furthermore, The Inseparables was chosen to compete in the \"Animated Feature Film\" division of the Shanghai International Film Festival (SIFF), which held its 25th edition between June 9 and June 19, 2023. === Music === The pop-rock trio Puggy composed the score for the film, continuing their collaboration with nWave Pictures after The Son of Bigfoot, Bigfoot Family and Chickenhare and The Hamster of Darkness. == References == == Other websites == * Official website * Information on the movie * The Inseparables at IMDb. Category:2023 animated movies Category:2023 adventure movies Category:2023 comedy movies Category:French adventure movies Category:French comedy movies Category:Belgian adventure movies Category:Belgian comedy movies Category:Spanish adventure movies Category:Spanish comedy movies",
 "title": "The Inseparables (2023 film)"
}