{
 "id": "1156353",
 "text": "Spooky Month is an animated web series created by David Axel Cazares Casanova, commonly known as Sr Pelo Episodes air on YouTube and Newgrounds. The Spooky Month series follows the misadventures of two kids, Skid and Pump, who are obsessed with Halloween. Cazares started Spooky Month with the 2018 video, titled \"It's spooky month\". However, Spooky Month 2, titled \"The Stars\", would start the huge popularity of the series. The video started more surreal and horror aspects to the series, rather than just comedy. ==Premise== Spooky Month revolves around the misadventures of two children, Skid and Pump, who are obsessed with Halloween. The series' format usually has Skid and Pump go during the night and meet demons and other dangerous entities. Every episode has two post-credits scenes. One for YouTube and one for Newgrounds. ==Characters== ===Main characters=== ====Skid==== Skid (originally known as Skidd) is one of the main protagonists of the Spooky Month series. He is a cheerful, naive, and very optimistic child. He always wears his Halloween costume in the episodes, however, he has been shown without his costume in various pictures around his house. He and Pump are so obsessed with Halloween that they insist that it happens all year round. ====Pump==== \"Pump\" Wonder is one of the two main protagonists of the Spooky Month series. He is best friends with Skid. His real name starts with \"Wil\", however, Cazares has stated that it is not \"Will\". Like Skid, he is obsessed with Halloween to the point he insists that it is year-round. ====Lila==== Lila is Skid's mother. Lila is a caring mother who enjoys celebrating Spooky Month with her child and his friend. However, she often gets in danger due to the kid's antics. ===Secondary characters=== ====Frank==== Frank is a kidnapper who Skid and Pump often talk to, oblivious to his intent. Frank doesn't do anything to Skid and Pump, however. ====Ooga Booga==== The Ooga Booga is a woman who makes a lot of appearances in horror films. Her catchphrase is \"Ooga booga!\". ====Kevin==== Kevin is a worker at CandyClub who hates his job and is often annoyed by Skid and Pump. ====John and Jack==== John and Jack are two police officers who work in the area. John, specifically, is the sheriff. ====Susie Wonder==== Susie Wonder is the sister of Pump. She is implied to be very interested in Hell and demons in general. ===Mr. Wonder=== Mr. Wonder is Pump and Susie's grandfather. ===Streber=== Streber is a worker at a haunted house. \"Spooky Short - Streber's Rehearsal\" is a short about him. ===Antagonists=== ====Cultists==== The Cultists are the main antagonists of the Spooky Month series. Not much is known of them, however, they are affiliated with Skid's father. ====The Eyes of the Universe==== The Eyes of the Universe is the main antagonist of \"Spooky Month 2 - The Stars\". They watch over the sky, spying on Skid and Pump. ====Moloch==== Moloch is a demon that Skid summons in \"It's spooky month\". He is also the main antagonist of \"Spooky Month 3 - Unwanted Guest\". he is also based of off the demon Moloch from the Bible, he also does child sacrifice, as seen by in \"Spooky month 6 - Hollow Sorrows\", where he makes an illusion of Dexter Erotoph, telling the Priest to give him the children, he was going to use the children for a sacrifice, where he was most likely going to put them into the furnace near his pelvic area. He is later defeated at the end of the episode by the priest where he is turned to stone inside of Skid's attic. ====Bob Velseb==== Bob Velseb is a killer that attacks Lila in \"It's spooky month\" and also the main antagonist of \"Spooky Month 5 - Tender Treats\". ====Dexter Erotoph/Happy Fella==== Dexter Erotoph is an exterminator who gets possessed and killed by the demon known as Moloch, and possesses a Happy Fella doll afterwards. He is also the main antagonist of \"Spooky Month 4 - Deadly Smiles\". He later appears in \"Spooky Month 5 - Tender Treats\" in a missing advert at the timestamp 3:45. He also has brief time in \"Spooky Month 6 - Hollow sorrows\", as an illusion created by Moloch, along with being shown as an image inside a pendant from his mother. At the time of \"Spooky month 6 - Hollow Sorrows\" he is stuck inside of a bucket inside of skid's attic, as he is seen watching the people entering the attic. ====Gregor Raquel==== Gregor Raquel also known as Father Gregor or The Priest, Is the antagonist of \"Spooky Month 6 - Hollow Sorrows\". ====The Hatzgang==== The Hatzgang is a group of teenagers that are bullies to Skid and Pump. =====Roy===== Reynold, often shortened to Roy, is the leader of the Hatzgang. He is the Son of Carmen and Richard. And was implied to be a victim of his Uncle's illegal actions. =====Ross===== Ross is another member of the Hatzgang who is the son of Lila's friend, Jaune. Ross has been in episodes 2-6 of the Spooky Month series. =====Robert===== Robert is another member of the Hatzgang. He is the younger Brother of Radford, and nephew of John. ==Elements== ===Spooky dance=== The Spooky dance is a dance that Skid and Pump do to celebrate Halloween. ===Happy Fella=== Happy Fella is a doll that makes multiple appearances throughout the series. It's purpose is to be a vessel/trap for ghosts. This can be seen in \"Spooky Month 4 - Deadly Smiles\" where the character, Dexter Erotoph gets trapped inside one. ==Episodes== ===Short=== ===Merch promotions=== ==References== ==Other websites== * Category:Web series Category:2020 American television series debuts",
 "title": "Spooky Month"
}