{
 "id": "1156917",
 "text": "The Norman invasions of Albania in the 11th century were a series of military campaigns conducted by Norman forces from Sicily against the Byzantine Empire's territories in the region. These invasions were part of a broader Norman expansion in the Mediterranean, which saw the establishment of Norman rule in Southern Italy and Sicily. The campaigns in Albania primarily took place between 1081 and 1107, with the Normans aiming to expand their influence into the Balkans, particularly through the territory of Albania, which formed the western frontier of the Byzantine Empire. ==Norman Invasions of Albania== The Norman invasions of Albania happened in the 11th century. These were military attacks by the Normans from Sicily against the Byzantine Empire in the Balkans. The Normans wanted to expand their power, and Albania, as a western border of the Byzantine Empire, became a key target. These invasions took place mainly between 1081 and 1107, but the Normans failed to keep control over Albania in the long term. ==Background== In 1071, the Byzantine Empire lost control of Southern Italy and Sicily to the Normans, led by Robert Guiscard. After this victory, the Normans aimed to take more Byzantine land, focusing on Albania because of its strategic importance as a gateway to the Balkans. ==The Invasions== === First Norman Campaign (1081)=== In 1081, Robert Guiscard and his son Bohemond attacked Albania. They captured several cities, including Vlora, Kanina, Orikum, and Butrint. Their main goal was Durrës, a key fortified city. The Byzantine Emperor Alexios I Komnenos sent reinforcements to defend Durrës. The Normans besieged the city but were eventually stopped in October 1081 when the Byzantines strengthened their defenses. === Byzantine Counterattack=== After the Norman attacks, the Byzantines launched a counteroffensive. With help from local Albanians, they pushed the Normans out of most of the territories. By 1082, the Normans lost their initial gains, though Bohemond tried to maintain their presence in the area. Albanian fighters played an important role in resisting the Normans. === Second Norman Campaign (1107)=== In 1107, the Normans attacked Albania again under William II. This time, they faced stronger Byzantine forces and local resistance. The Byzantines successfully defended the region, forcing the Normans to retreat. Over the years, Byzantine control of Albania grew stronger, and Norman influence in the region faded. ==Legacy== The Norman invasions caused tension between the Normans and the Byzantines. Although the Normans won some early battles, they failed to take control of Albania permanently. The campaigns showed how important Albania was as a defense point for the Byzantine Empire. The local Albanians played a big part in stopping the Normans, helping the Byzantines with both military support and resistance. ==References== Category:History of Albania",
 "title": "Norman Invasions of Albania"
}