{
 "id": "1156245",
 "text": "Trash (also known as The Castaways) is a 2020 Italian animated movie directed by Francesco Dafano and Luca della Grotta. == Plot == The protagonists of the movie are Slim, a worn cardboard box, and Bubbles, a dented and half-deflated soda bottle. Both find themselves on the floor of a market, destined to end up in the garbage can, but, unlike Slim, Bubbles is not resigned to no longer having a purpose: in fact, she firmly believes in the legend of the \"magic pyramid\", a magical portal that can give all waste a new life. So, the two set off, and encounter Spark on their path, a \"bearer\", that is, a box with its original contents still inside (in this case a toy). Their lives take a turn and the two friends decide to help the boy find his way home. To escape the \"suckers\", dangerous machines that sweep waste, the three find themselves wandering the streets of the city. Here, however, they encounter \"predators\", waste who do not want to accept their condition as rubbish and distance themselves from the idea of the pyramid, mixing and reassembling themselves until they become monstrous piles of rubbish. They also meet Smag, a small ramshackle chest of drawers who promises the three friends to take them safely to \"sunset alley\", a kind of waste amusement park. During a show at the amusement park they meet other waste who soon joins the group: Jet, a small jar, and the singer Bliss, a beautiful and fascinating glass bottle who will help their friends escape from predators, who in fact want to kidnap Sparks and take him to their boss, an old computer who wants to steal the solar batteries inside it, so as to have the energy necessary to reactivate itself again. During the journey Bubbles decides to go back to get Bliss, with whom he has fallen madly in love. The friends' paths diverge and Slim and Sparks continue their journey to find Sparks' house, the toy shop. Unfortunately, the evil predatory waste manages to kidnap Sparks and take him to the big PC, but luckily Slim, aided by the tin can Pat, manages to save the little one and destroy the evil computer. The two friends reunite with Bubbles and Bliss and together they manage to reach the shop where little Sparks came from, finally home. At the same time they also realize that they are right in front of the \"Magic Pyramid\", a large structure for collecting and sorting waste. Bubbles and Bliss say goodbye to their friends and enter the pyramid. Slim also decides to enter it, but just as he is about to do so, a sucker arrives and threatens to suck up the box. Spark manages to save his friend Slim and get him into the pyramid. Slim then wakes up in an elegant shop, and realizes that he is no longer a ruined box, but a new and elegant package, one of the many boxes that live in the shop, which is located right in front of Spark's. The two friends manage to say goodbye once again through the shop window, aware that they both have a home and a purpose again. == Cast == Character Italian Voice Actor English Voice Actor Spark Alessandro Carloni Jordan Cole Bubbles Roberto Stocchi Marc Thompson Slim Christian Iansante Billy Bob Thompson Smug Luca Dal Fabbro Tyler Bunch Sticky Andreas Pirolli Abe Goldfarb Snoop ? Eddy Lee Healer Dario Penne David Wills Oily ? Justin Anselmi Kudo Emanuela Rossi Bobbi Hartley Bliss Giò Giò Rapattoni Rossy de Palma Pat Barbara De Bortoli Maggie Politi Stiggers Vitrio Roberto Draghetti Andrew Watts === Additional Voices === * Rory Max Kaplan == Production == Trash is an entirely Italian digital animation movie and the first feature movie produced by the movie production company Al One, with the contribution of MiBAC. The movie is dedicated to the memory of Roberto Draghetti, his last movie role, who voices Vitrio. == Distribution == The movie was part of the official selection at the Shanghai International Film Festival (SIFF Animation), at CINEKID 2020, at the Silk Road Film Festival in Xi'an and at the Rome Film Festival in the Alice nella città section. The movie was released in Italian cinemas starting from 16 October 2020 by Notorious Pictures. == Soundtrack == The music is by Matteo Buzzanca, but one of the songs ( Per noi ) is by Raphael Gualazzi. == References == == Other websites == * Trash on CineDataBase * Trash on MYmovies.it (Italian) * Trash on The world of dubbers * Trash on IMDb * Trash on FilmAffinity * Trash on Box Office Mojo",
 "title": "Trash (2020 film)"
}