{
 "id": "1156620",
 "text": "A major battle took place on 17 December 1772 at Purana Qila, Delhi, between Emperor Shah Alam II and the Marathas, led by Visaji Krishna and Tukoji. The Emperor's forces included European-trained soldiers and artillery led by Rene Madec. However, the Marathas won due to their better leadership. After the battle, the Marathas looted Ghazi-ud-din's mansion, taking valuable goods, about 40 horses, and a few elephants. They also captured two elephants near Delhi Gate and looted Sadullah Khan's market. ==Prelude== In 1772, the Ruhelas allied with Shuja for protection, angering the Marathas. While Tukoji wanted war, Visaji sought peace. The Marathas tried to break Zabita Khan’s alliance with Shuja by offering him forgiveness and the position of chief Bakhshi. However, Emperor Shah Alam II, wary of British power, rejected their plans to attack Oudh and Bihar or appoint Zabita as chief Bakhshi. ==Battle== This upset the Marathas, who were already unhappy as the Mughal emperor Shah Alam, had not paid them money promised in the 1771 treaty. Shah Alam, in turn, was angry with the Marathas because they had taken most of the treasures, especially cash and jewels, during their recent campaign in Rohilkhand. These disagreements led to a battle near Purana Qila, outside Delhi, on December 17. The emperor's forces, led by Najaf Khan and a French officer named Madec, were defeated and forced to retreat. After this defeat, Shah Alam II had no choice but to sue for peace with the Marathas. He agreed to their demands, which included making Zabita Khan the chief of the army, returning Zabita’s family estate, and giving the Marathas control of the Kora and Allahabad districts. An important result of this victory was the collapse of Najaf Khan’s personal army. Najaf then submitted to the Marathas and joined their army in the Deccan, earning a salary of 3,000 rupees per day. ==Aftermath== The Mughal emperor decided it was no longer unwise to allow an invasion of Oudh and Bihar. After a new peace agreement, he ordered Munir, who was in charge of Kora and Allahabad, to hand these areas over to the Marathas. On February 2, 1773, the Maratha forces, led by Visaji and Tukoji, left Delhi and entered the Doab region. They sent messages to the Rohillas, asking for the payment they had promised in January 1771, and to Shuja, requesting the transfer of Kora and Allahabad. == References == Category:1772 Category:Maratha Empire",
 "title": "Battle of Purana Qila"
}