{
 "id": "1156943",
 "text": "{{Infobox company | name = Voyah Automotive Technology Co., Ltd. | native_name = 岚图汽车科技有限公司 | module = | type = State-owned Subsidiary | industry = Automotive | foundation = 2019 | founder = | location_city = Wuhan, Hubei | location_country = China | num_locations = | area_served = China, Russia, Israel, Turkey, Belarus, Norway | key_people = {{Unbulleted list | You Zheng (Chairman) | Lu Fang (CEO) }} | revenue = | operating_income = | net_income = | assets = | equity = | owner = Dongfeng Motor Corporation | num_employees = | divisions = | website = }} Voyah is a Chinese luxury brand owned by Dongfeng Motor Corporation, a Chinese state-owned manufacturer. It was founded in April 2019 and it makes luxury electric cars. == History == In July 2020, Dongfeng showed the Voyah brand and its logo for the first time in Wuhan. In September 2020, Beijing auto show, the Voyah brand was officially launched showing two Concepts named Free and I-Land and the Free Concept preview, the Voyah Free that was launched in 2021. Both Concepts designs were co-made with the help of Italdesign which is a Italian design house. The Concepts also previewed the next Voyah cars in the next years and Voyahs cars are made in a Dongfeng platform named Essa Electric. In December 2020, the first Voyah car the Free was launched. On January 2024 Voyah formed a strategic coorperation agreement with Huawei a Chinese technology brand and both companies will work together on the development of Huawei Inside Model. In April 2024, the 100.000th car of Voyah which is a Voyah Dream was rolled off. == Models == * Voyah Passion (2023–present), midsize sedan, BEV/PHEV * Voyah Free (2021–present), midsize SUV, BEV/REEV * Voyah Courage (2024-present), compact SUV, BEV * Voyah Dream (2022–present), full-size MPV, BEV/PHEV File:Voyah Free facelift 001.jpg|Voyah Free File:2022 Voyah Dreamer.jpg|Voyah Dream File:Voyah Zhiguang 001.jpg|Voyah Passion File:Voyah Courage 003.jpg|Voyah Courage ==Markets== Outside China Voyah currently sells its cars in Norway since June 2022, Israel since april 2023, and Belarus since July 2023. in January 2024 Voyah started its expansion in Southern Europe with plans to enter Portugal and Spain, In April 2024 it entered the Italian market. And In August 2024 in Lebanon the Voyah brand was launched alongside M-Hero. == References == Category:Automobile companies of China",
 "title": "Voyah"
}