{
 "id": "1156021",
 "text": "Jumba la Mtwana is the site of archaeological relics on the Indian Ocean coast of Kenya, lying close to the Mtwapa Creek, north of Mombasa. It dates back to the fourteenth century. ==Description== The archaeological site includes three mosques built of coral stone, a tomb and eight houses. The territory was added to the list of national monuments of Kenya on June 4, 1982. The excavations were carried out by James Kirkman in 1972. There are no written historical records about the city, but the Chinese ceramics found make it possible to trace the dating back to the fourteenth century. The city was located close to fresh water sources and was protected from attack from the ocean. The architectural style is made in the Arabic style using coral blocks. ==Peculiarities== The House with Many Doors is notable for its Gothic-style door. The house is divided into apartments that can accommodate several visitors. The Mosque by the Sea is the best preserved ruin. The tomb contains a funerary stele made of coral. A passage from the Koran is carved on it, but the epitaph is illegible. ==Gallery== Jumba la Mtwana-mosque on the beach- detail-2.jpg|Mosque on the beach, detail Jumba la Mtwana-house of the many doors-1.jpg|House of the many doors Jumba la Mtwana-house of the many doors-2.jpg|House of the many doors, detail Jumba la Mtwana-grave.jpg|Grave ==In popular culture== The ruins of Jumba la Mtwana are described and repeatedly mentioned in Andrei Gusev's story \"Consummation in Mombasa\". The final events in the story take place in Mtwapa (located next to the ruins), where the main characters go after their wedding in Mombasa. Review of \"Consummation in Mombasa\" — on the site of public fund \"Union of writers of Moscow\", 2020 “Consummation in Mombasa” — in Lady’s Club, 2017 «Консуммация в Момбасе» by Andrei Gusev, 2017 ==See also== *Ruins of Gedi *Mnarani ruins ==References== Category:Kenya Category:Archaeological sites in Kenya",
 "title": "Jumba la Mtwana"
}