{
 "id": "1156337",
 "text": "The 2007-08 Austrian football championship was the 97th season of the top league in Austria. SK Rapid Wien won the 32nd title. The telecommunications company T-Mobile was the main sponsor of the league. ==Mode == The Bundesliga was contested by 10 teams. They met four times throughout the entire season. In addition to newly promoted team LASK Linz, SK Austria Kärnten is playing in Austria's top division for the first time. The Carinthians are the successor club to FC Pasching, from which the southern Austrians bought the license. Champions became SK Rapid Wien in the 35th round. FC Wacker Innsbruck was relegated. ==Final table== Pl. Name M W D L P 1\\. SK Rapid Wien 36 21 6 9 69 2\\. FC Red Bull Salzburg 36 18 9 9 63 3\\. FK Austria Wien 36 15 13 8 58 4\\. SK Sturm Graz 36 15 11 10 56 5\\. SV Mattersburg 36 13 14 9 53 6\\. LASK 36 14 11 11 53 7\\. SV Ried 36 10 8 18 38 8\\. SCR Altach 36 8 12 16 38 9\\. SK Austria Kärnten 36 8 10 18 33 10\\. FC Wacker Innsbruck 36 6 11 19 29 Austria Soccer ==Matches == Austria Soccer ===Round 1=== Date Team 1 Team2 10 July 2007 LASK SK Austria Kärnten 1-0 11 July 2007 FC Red Bull Salzburg SCR Altach 4-1 Patrick Jezek's goal to make it 1-0 after 10 seconds is an absolute first league record. 11 July 2007 SK Rapid Wien FC Wacker Innsbruck 3-1 11 July 2007 SV Ried SV Mattersburg 1-2 11 July 2007 SK Sturm Graz FK Austria Wien 2-2 ===Round 2=== Date Team 1 Team2 14 July 2007 FK Austria Wien LASK 1-1 14 July 2007 SCR Altach SV Ried 2-3 14 July 2007 FC Wacker Innsbruck SK Sturm Graz 0-0 15 July 2007 SK Austria Kärnten FC Red Bull Salzburg 1-0 25 July 2007 SV Mattersburg SK Rapid Wien 3-2 ===Round 3=== Date Team 1 Team2 20 July 2007 SK Sturm Graz LASK 4-0 22 July 2007 SK Austria Kärnten SV Ried 0-3 22 July 2007 FK Austria Wien FC Red Bull Salzburg 2-2 22 July 2007 FC Wacker Innsbruck SV Mattersburg 2-2 1 August 2007 SCR Altach SK Rapid Wien 0-1 ===Round 4=== Date Team 1 Team2 27 July 2007 SV Ried FK Austria Wien 0-1 28 July 2007 FC Red Bull Salzburg LASK 2-1 28 July 2007 SV Mattersburg SK Sturm Graz 2-2 29 July 2007 SCR Altach FC Wacker Innsbruck 2-1 8 August 2007 SK Rapid Wien SK Austria Kärnten 4-0 ===Round 5=== Date Team 1 Team2 3 August 2007 FC Wacker Innsbruck SK Austria Kärnten 1-1 4 August 2007 SK Sturm Graz FC Red Bull Salzburg 0-0 5 August 2007 LASK SV Ried 1-0 5 August 2007 SK Rapid Wien FK Austria Wien 0-0 5 August 2007 SV Mattersburg SCR Altach 4-1 ===Round 6=== Date Team 1 Team2 10 August 2007 FK Austria Wien FC Wacker Innsbruck 6-1 11 August 2007 SK Austria Kärnten SV Mattersburg 1-1 11 August 2007 FC Red Bull Salzburg SV Ried 2-0 11 August 2007 SK Sturm Graz SCR Altach 3-1 12 August 2007 LASK SK Rapid Wien 2-0 ===Round 7=== Date Team 1 Team2 17 August 2007 SCR Altach SK Austria Kärnten 4-1 18 August 2007 FC Wacker Innsbruck LASK 1-2 19 August 2007 SK Rapid Wien FC Red Bull Salzburg 1-0 19 August 2007 SV Mattersburg FK Austria Wien 0-1 19 August 2007 SV Ried SK Sturm Graz 5-3 ===Round 8=== Date Team 1 Team2 25 August 2007 FK Austria Wien SCR Altach 1-0 25 August 2007 FC Red Bull Salzburg FC Wacker Innsbruck ' 3-1 25 August 2007 LASK SV Mattersburg 0-2 25 August 2007 SV Ried SK Rapid Wien 0-3 26 August 2007 SK Sturm Graz SK Austria Kärnten 1-3 ===Round 9=== Date Team 1 Team2 31 August 2007 SCR Altach LASK 2-2 2 September 2007 FK Austria Wien SK Austria Kärnten 1-0 2 September 2007 SV Mattersburg FC Red Bull Salzburg 1-1 2 September 2007 SK Sturm Graz SK Rapid Wien 1-0 2 September 2007 FC Wacker Innsbruck SV Ried 0-1 ===Round 10=== Date Team 1 Team2 15 September 2007 FC Red Bull Salzburg SV Mattersburg 2-1 15 September 2007 LASK SCR Altach 2-0 15 September 2007 SK Rapid Wien SK Sturm Graz 1-5 15 September 2007 SV Ried FC Wacker Innsbruck 0-0 16 September 2007 SK Austria Kärnten FK Austria Wien 2-1 ===Round 11=== Date Team 1 Team2 21 September 2007 SV Mattersburg SV Ried 5-1 22 September 2007 SK Austria Kärnten LASK 1-4 23 September 2007 FK Austria Wien SK Sturm Graz 1-0 23 September 2007 SCR Altach FC Red Bull Salzburg 1-1 23 September 2007 FC Wacker Innsbruck SK Rapid Wien 1-1 ===Round 12=== Date Team 1 Team2 26 September 2007 FC Red Bull Salzburg SK Austria Kärnten 3-0 26 September 2007 LASK FK Austria Wien 1-1 26 September 2007 SK Rapid Wien SV Mattersburg 1-0 26 September 2007 SV Ried SCR Altach 3-0 26 September 2007 SK Sturm Graz FC Wacker Innsbruck 1-1 ===Round 13=== Date Team 1 Team2 29 September 2007 LASK SK Sturm Graz 2-2 29 September 2007 SK Rapid Wien SCR Altach 0-2 29 September 2007 SV Mattersburg FC Wacker Innsbruck 3-1 29 September 2007 SV Ried SK Austria Kärnten 3-1 30 September 2007 FC Red Bull Salzburg FK Austria Wien 0-1 ===Round 14=== Date Team 1 Team2 5 October 2007 SK Sturm Graz SV Mattersburg 0-0 7 October 2007 SK Austria Kärnten SK Rapid Wien 1-2 7 October 2007 FK Austria Wien SV Ried 2-1 7 October 2007 LASK FC Red Bull Salzburg 4-1 24 October 2007 FC Wacker Innsbruck SCR Altach 0-1 The match was cancelled on October 6th. The reason for this was security deficiencies in the European Championship stadium. The safety of the visitors could not be adequately guaranteed. The new Tivoli Stadium was expanded for EURO 2008ː ===Round 15=== Date Team 1 Team2 20 October 2007 SK Austria Kärnten FC Wacker Innsbruck 2-0 20 October 2007 FC Red Bull Salzburg SK Sturm Graz 4-1 20 October 2007 SCR Altach SV Mattersburg 0-0 20 October 2007 SV Ried LASK 3-0 21 October 2007 FK Austria Wien SK Rapid Wien 2-2 ===Round 16=== Date Team 1 Team2 26 October 2007 SK Rapid Wien LASK 4-4 27 October 2007 SCR Altach SK Sturm Graz 0-0 27 October 2007 SV Mattersburg SK Austria Kärnten 5-2 27 October 2007 SV Ried FC Red Bull Salzburg 2-0 28 October 2007 FC Wacker Innsbruck FK Austria Wien 2-0 ===Round 17=== Date Team 1 Team2 30 October 2007 FC Red Bull Salzburg SK Rapid Wien 2-1 31 October 2007 SK Austria Kärnten SCR Altach 1-1 31 October 2007 FK Austria Wien SV Mattersburg 2-2 31 October 2007 LASK FC Wacker Innsbruck 5-0 31 October 2007 SK Sturm Graz SV Ried 5-0 ===Round 18=== Date Team 1 Team2 3 November 2007 SK Austria Kärnten SK Sturm Graz 0-0 3 November 2007 SK Rapid Wien SV Ried 4-0 3 November 2007 SCR Altach FK Austria Wien 1-0 3 November 2007 FC Wacker Innsbruck FC Red Bull Salzburg 3-1 4 November 2007 SV Mattersburg LASK 0-0 ===Round 19=== Date Team 1 Team2 9 November 2007 LASK FC Red Bull Salzburg 1-1 10 November 2007 SK Rapid Wien SV Mattersburg 3-1 10 November 2007 SCR Altach FC Wacker Innsbruck 1-1 10 November 2007 SV Ried SK Sturm Graz 0-0 11 November 2007 SK Austria Kärnten FK Austria Wien 0-1 ===Round 20=== Date Team 1 Team2 24 November 2007 FC Red Bull Salzburg SK Austria Kärnten 1-1 24 November 2007 SV Mattersburg SV Ried 1-1 24 November 2007 SK Sturm Graz SCR Altach 6-1 24 November 2007 FC Wacker Innsbruck LASK 2-0 25 November 2007 FK Austria Wien SK Rapid Wien 0-0 ===Round 21=== Date Team 1 Team2 30 November 2007 SK Austria Kärnten FC Wacker Innsbruck 0-2 1 December 2007 SK Rapid Wien FC Red Bull Salzburg 1-3 1 December 2007 SCR Altach LASK 0-0 1 December 2007 SK Sturm Graz SV Mattersburg 2-1 2 December 2007 SV Ried FK Austria Wien 1-1 ===Round 22=== Date Team 1 Team2 7 December 2007 FC Red Bull Salzburg SV Ried 2-0 8 December 2007 LASK SK Austria Kärnten 4-0 8 December 2007 SV Mattersburg SCR Altach 3-3 8 December 2007 FC Wacker Innsbruck SK Rapid Wien 1-1 9 December 2007 FK Austria Wien SK Sturm Graz 1-2 ===Round 23=== Date Team 1 Team2 14 December 2007 SV Mattersburg FK Austria Wien 1-1 15 December 2007 SCR Altach SK Austria Kärnten 0-1 15 December 2007 SV Ried FC Wacker Innsbruck 0-0 15 December 2007 SK Sturm Graz FC Red Bull Salzburg 1-1 16 December 2007 SK Rapid Wien LASK 2-0 ===Round 24=== Date Team 1 Team2 15 February 2008 FC Red Bull Salzburg SV Mattersburg 4-0 16 February 2008 SK Austria Kärnten SK Rapid Wien 0-2 16 February 2008 FK Austria Wien SCR Altach 1-1 16 February 2008 FC Wacker Innsbruck SK Sturm Graz 1-0 17 February 2008 LASK SV Ried 1-0 ===Round 25=== Date Team 1 Team2 22 February 2008 SK Sturm Graz LASK 1-2 23 February 2008 FK Austria Wien FC Red Bull Salzburg 3-1 23 February 2008 SV Mattersburg FC Wacker Innsbruck 2-1 23 February 2008 SV Ried SK Austria Kärnten 1-0 24 February 2008 SCR Altach SK Rapid Wien 2-1 ===Round 26=== Date Team 1 Team2 26 February 2008 SK Austria Kärnten SK Sturm Graz 0-2 27 February 2008 FC Red Bull Salzburg SCR Altach 4-0 27 February 2008 LASK SV Mattersburg 2-1 27 February 2008 SK Rapid Wien SV Ried 4-0 27 February 2008 FC Wacker Innsbruck FK Austria Wien 1-2 ===Round 27=== Date Team 1 Team2 1 March 2008 SV Mattersburg SK Austria Kärnten 1-0 1 March 2008 SV Ried SCR Altach 3-1 2 March 2008 SK Sturm Graz SK Rapid Wien 0-2 5 March 2008 FK Austria Wien LASK 0-0 5 March 2008 FC Red Bull Salzburg FC Wacker Innsbruck 2-0 ===Round 28=== Date Team 1 Team2 7 March 2008 SK Rapid Wien SK Sturm Graz 2-1 8 March 2008 SK Austria Kärnten SV Mattersburg 1-0 8 March 2008 LASK FK Austria Wien 2-1 8 March 2008 SCR Altach SV Ried 3-2 9 March 2008 FC Wacker Innsbruck FC Red Bull Salzburg 1-2 ===Round 29=== Date Team 1 Team2 14 March 2008 SV Mattersburg SK Rapid Wien 1-0 15 March 2008 FK Austria Wien SK Austria Kärnten 0-1 15 March 2008 SK Sturm Graz SV Ried 2-0 15 March 2008 FC Wacker Innsbruck SCR Altach 1-1 16 March 2008 FC Red Bull Salzburg LASK 4-0 ===Round 30=== Date Team 1 Team2 18 March 2008 SK Rapid Wien FK Austria Wien 2-0 19 March 2008 SK Austria Kärnten FC Red Bull Salzburg 0-0 19 March 2008 LASK FC Wacker Innsbruck 3-3 19 March 2008 SCR Altach SK Sturm Graz 1-2 19 March 2008 SV Ried SV Mattersburg 0-0 ===Round 31=== Date Team 1 Team2 22 March 2008 FK Austria Wien SV Ried 2-0 22 March 2008 LASK SCR Altach 3-0 22 March 2008 SV Mattersburg SK Sturm Graz 1-1 22 March 2008 FC Wacker Innsbruck SK Austria Kärnten 0-0 23 March 2008 FC Red Bull Salzburg SK Rapid Wien 0-7 ===Round 32=== Date Team 1 Team2 29 March 2008 SK Austria Kärnten LASK 2-1 29 March 2008 SK Rapid Wien FC Wacker Innsbruck 4-1 29 March 2008 SCR Altach SV Mattersburg 2-0 29 March 2008 SK Sturm Graz FK Austria Wien 1-2 30 March 2008 SV Ried FC Red Bull Salzburg 1-2 ===Round 33=== Date Team 1 Team2 4 April 2008 SK Austria Kärnten SCR Altach 1-1 5 April 2008 FK Austria Wien SV Mattersburg 0-0 5 April 2008 FC Red Bull Salzburg SK Sturm Graz 3-0 5 April 2008 FC Wacker Innsbruck SV Ried 1-0 6 April 2008 LASK SK Rapid Wien 1-2 ===Round 34=== Date Team 1 Team2 11 April 2008 SK Rapid Wien SK Austria Kärnten 2-1 12 April 2008 SV Mattersburg FC Red Bull Salzburg 3-2 12 April 2008 SV Ried LASK 1-1 12 April 2008 SK Sturm Graz FC Wacker Innsbruck 2-0 13 April 2008 SCR Altach FK Austria Wien 0-4 ===Round 35=== Date Team 1 Team2 20 April 2008 SK Austria Kärnten SV Ried 0-0 20 April 2008 FC Red Bull Salzburg FK Austria Wien 2-0 20 April 2008 LASK SK Sturm Graz 1-2 20 April 2008 SK Rapid Wien SCR Altach 3-0 20 April 2008 FC Wacker Innsbruck SV Mattersburg 0-5 ===Round 36=== Date Team 1 Team2 26 April 2008 FK Austria Wien FC Wacker Innsbruck 2-1 26 April 2008 SCR Altach FC Red Bull Salzburg 1-1 26 April 2008 SV Mattersburg LASK 1-0 26 April 2008 SV Ried SK Rapid Wien 0-1 26 April 2008 SK Sturm Graz SK Austria Kärnten 3-1 ==Champion squad== SK Rapid Wien Mario Bazina, Mate Bilic, Branko Boskovic, Fabiano Da Lima, Andreas Dober , Hannes Eder, Georg Harding, Raimund Hedl , Markus Heikkinen, Martin Hiden, Erwin Hoffer, Steffen Hofmann, Markus Katzer, Veli Kavlak,Ümit Korkmaz, Stefan Kulovits, Stefan Maierhofer , Stephan Palla, Jürgen Patocka, Helge Payer, Mario Sara, Christian Thonhofer, Mario Tokic, Coachː Peter Pacult Source: Austria Soccer ==Top scorer== Name Club Goals Alexander Zickler FC Red Bull Salzburg 16 Mario Haas SK Sturm Graz 14 Ivica Vastić LASK 13 Austria Soccer ==References== Category:Football in Austria Category:Football seasons Category:2007–08 in European football",
 "title": "2007-08 Austrian football championship"
}