{
 "id": "1156576",
 "text": "Shankar Mahadevan is an Indian singer and composer. He is famous for singing in many Indian languages and creating music for movies. He is part of the music trio called Shankar-Ehsaan-Loy, which also includes Ehsaan Noorani and Loy Mendonsa. Together, they make music for Bollywood films and other projects. == Early Life == Shankar Mahadevan was born on March 3, 1967, in Chembur, Mumbai, India. He grew up in a Tamil family. From a young age, Shankar loved music. He learned classical music and played the veena, a traditional Indian instrument. He also studied Western classical music and jazz. Shankar went to school in Mumbai and later studied software engineering. He worked as a software engineer before deciding to follow his passion for music. == Career == Shankar became popular in 1998 with his song \"Breathless.\" The song was unique because it sounded like it was sung in one breath. It became very famous and made him a star. In 1999, Shankar teamed up with Ehsaan Noorani and Loy Mendonsa to form the music trio Shankar-Ehsaan-Loy. They composed music for many Bollywood movies like: * Kandukondain Kandukondain (2000) * Dil Chahta Hai (2001) * Kal Ho Naa Ho (2003) * Taare Zameen Par (2007) * Rock On!! (2008) * Zindagi Na Milegi Dobara (2011) Their music is known for mixing Indian and Western styles. Shankar is also a playback singer. This means he sings songs that actors lip-sync to in movies. He has sung many hit songs in Hindi, Tamil, Telugu, and other languages. == Awards == Shankar Mahadevan has won many awards for his music, including: * National Film Awards * Filmfare Awards * IIFA Awards He is loved by fans for his powerful voice and creative music. == Other Work == Shankar Mahadevan also started the Shankar Mahadevan Academy. It is an online music school where people can learn Indian music from anywhere in the world. He teaches both beginners and advanced students. == Personal Life == Shankar is married and has two sons. His son Siddharth Mahadevan is also a singer and composer. == Legacy == Shankar Mahadevan is one of India’s most talented and respected musicians. He continues to inspire people with his songs and dedication to music. Category:Indian composers Category:1967 births Category:Living people",
 "title": "Shankar Mahadevan"
}