{
 "id": "1157729",
 "text": "Kayleigh Rose Amstutz (born February 19, 1998), known professionally as Chappell Roan ( ), is an American singer-songwriter. Her music is inspired by 1980s synth-pop and 2000s pop songs. ==Career== Following a short break, she released a several songs independently in 2022. Her debut album, The Rise and Fall of a Midwest Princess, was released through Island Records in 2023. The album became a \"sleeper hit\" and was nominated for Album of the Year at the 67th Grammy Awards. Its single \"Pink Pony Club\" reached number one in the UK in 2025. Roan was a supporting act on Olivia Rodrigo's Guts World Tour. Her producer, Dan Nigro, is also known for his work with Rodrigo. Roan released the single \"Good Luck, Babe!\" in 2024, which went on to reach number one in Ireland and the top five in the UK, US, and Canada. Roan also starred in label-mate Sabrina Carpenter's Netflix Christmas special, A Nonsense Christmas (2024), in which the two sang a cover of Wham!'s \"Last Christmas\". In February 2025 at the 67th Grammy Awards, Roan won her first Grammy Award for Best New Artist. ==Personal life== Kayleigh Rose Amstutz was born in Willard, Missouri, on February 19, 1998, the oldest of four children. Roan took her stage name from her late grandfather, Dennis Chappell, and his favorite song, \"The Strawberry Roan\". Roan is openly a lesbian. In the Apple TV+ special A Carpool Karaoke Christmas (2024), Roan revealed to the host, New Zealander DJ Zane Lowe, that her strict Christian upbringing caused her to feel \"like [she] was going to hell no matter how good of a person [she] was or how much [she] loved God, for being gay.\" == Filmography == Year Program Role Notes 2024 A Nonsense Christmas Self; guest Sabrina Carpenter Netflix special A Carpool Karaoke Christmas Apple TV+ special ==References== ==Other websites== * Category:1998 births Category:Living people Category:American pop singers Category:Singers from Missouri Category:Singers from Los Angeles Category:Singer-songwriters from California Category:Writers from Los Angeles Category:Writers from Missouri Category:LGBT people from Los Angeles Category:Lesbians Category:LGBT singers Category:American Grammy Award winners",
 "title": "Chappell Roan"
}