{
 "id": "1157409",
 "text": "Miguel Morayta y Sagrario (September 3, 1834 - January 18, 1917) was a Spanish professor of classical history, journalist and republican politician, considered by historians to be a most prominent personality in the Masonic order in the history of Spain. == Short Biography == He was born in 1834 in Madrid. He became Professor of Spanish and Pangkalahatang Kasaysayan at the Universidad Central de Madrid (Central University of Madrid in Spain, editor of periodicals in Madrid such as El Eco Universitario (1851), La República Ibérica (1869-1870) and Gente Vieja (1902), as well as the director of La Reforma (1868) and Revista Ibérica; and published the La Publicidad de Barcelona or El Popular de Málaga. Besides those, Miguel Morayta was the professor of José Rizal at the Universidad Central de Madrid. Morayta also founded the organization, Asociacion Hispano-Filipino in Madrid and was a close friend of his student, José Rizal. He died in his home city in 1917 and was buried in the civil cemetery of Madrid. Miguel Morayta y Sagrario is respected and recognized in the history of the Philippine nation headed for its independence. == Freemasonry == Morayta held a high position in Freemasonry in Spain, where he united the various lodges by establishing the Gran Oriente Español in 1889, and became its first Grand Master. He held this highest office from 1889 to 1901, and became Sovereign Grand Commander of the Ancient and Accepted Scottish Rite in Spain. Filipinos in Spain also entered Freemasonry in Spain in their advocacy towards reforming the administration of the Philippine colony. Among them were the patriots Graciano Lopez Jaena, Galicano Apacible, and the brothers Antonio Luna at Juan Luna, and José Rizal, in lodges named Solidaridad (Solidarity) and the radical Revolucion (Revolution). == The Propaganda Movement == Among the colonies of the Spanish Empire, the Philippines in particular, revolutionary sentiments began growing in 1872 after three Catholic priest activists were executed on false accusations. The mass exodus of Filipino patriots to Spain starting 1872, encouraged a community of expatriate reformers. This community of of Ilustrados (enlightened ones), notably sons and daughters of wealthy Filipino families developed as a society of intellectuals. Their aim was to seek representation in the legislature of Spain for political reforms in the Philippines. Famous among them are Marcelo H. del Pilar, Graciano Lopez Jaena, Mariano Ponce, and their noble fellow-Mason (33° degree) Dr. Jose Rizal — and their advisor, the Sovereign Grand Commander Miguel Morayta y Sagrario — who collectively published the newspaper, \"La Solidaridad\" (the Solidarity). The publication inspired what became known as the Propaganda Movement effectively led by Jose Rizal. ==References== Category:1834 births Category:1917 deaths Category:People from Madrid Category:Freemasons",
 "title": "Miguel Morayta y Sagrario"
}