{
 "id": "1157582",
 "text": "Jovan Radonjić (1748 – 8 July 1803), also known as Jovo or Joko, was the governor of Montenegro from 1764 to 1803. ==Time as guvernadur== ===Sava III=== Jovan Radonjić was elected guvernadur of Montenegro in 1764. He had great influence and was consulted by the Venetians, Ottoman officials, and local leaders. In 1770, Montenegrin leaders, including Jovan, sent a letter criticizing the Venetians for opposing Montenegro's relationship with Russia. The letter was signed by guvernadur Jovan Radonjić, serdar Vukale Vukotić, serdar J. Đurašković, serdar Jovo Petrović, and serdar M. Plamenac. In 1769, Russian Empress Catherine ordered the planning of an uprising in the Balkans, with Georgije Dolgorukov sent to Montenegro. Orlov was during this Russo- Turkish war mostly in Italy, so that he was unable to assist Dolgorukov. In 1773, after the death of Šćepan Mali, the Ottomans attacked the Kuči and Bjelopavlići but were defeated. After the Russo-Turkish war, the Treaty of Küçük Kaynarca in 1774 did not mention Montenegro, but Jovan sent a petition to Russia in 1775 to remind them of the Montenegrins. In 1775–76, there were conflicts between Montenegro and the Republic of Ragusa, and Jovan suggested peace. In 1779, Jovan and others thanked the Austrian Emperor for gifts, including a portrait, which they saw as a symbol of protection. ===Petar I=== Jovan Radonjić and the Metropolitan were the two main leaders in Montenegro—Jovan was the actual ruler, while the Metropolitan had spiritual authority. They disagreed on how Montenegro should be governed, with Jovan wanting control over both secular and spiritual matters, and the Metropolitan focusing on religious leadership. Their political views also differed: the Metropolitan supported Russia, while Jovan favored Austria. This led to two opposing factions, one pro-Russian and the other pro-Austrian, especially during the Austro-Turkish War (1787–91) and Russo-Turkish War (1787–92). During this time, Montenegro was divided into districts, governed by both Jovan and the Metropolitan, with the help of various officials, creating ongoing tension between secular and religious authorities. In 1785, when Kara Mahmud Pasha attacked Montenegro, Jovan fled to Venetian territory after burning down his house. Kara Mahmud Pasha eventually withdrew after a series of conflicts with local tribes. In 1788–89, Jovan sent letters to Russia requesting help, including the appointment of Sofronije Jugović as leader of Montenegro, hoping to replace the Petrović family and secure power for himself. In 1789–90, Jovan traveled to Austria with a delegation, seeking Austrian support. However, despite some aid in the form of supplies, Austria was reluctant to intervene directly. In 1796, Jovan played a key role in defeating Kara Mahmud Pasha at the Battle of Martinići and later at the Battle of Krusi, where Kara Mahmud Pasha was killed. Afterward, Jovan wrote to Austria requesting compensation for his burnt house, and the Austrians sent him money and materials to repair it. ===Last years=== Before his death, Jovan bought a printing press in Vienna and planned to teach the Montenegrins how to use it. However, Metropolian Petar I accused him of bringing an Austrian spy and of attempting to sell Montenegro to Austria. As a result, Jovan abandoned the printing project and sold the press to a merchant in the Bay of Kotor. Several years later, Petar II Petrović-Njegoš brought the same press back to Montenegro. ==References== ==Sources== * * * * * Category:1748 births Category:1803 deaths Category:Montenegrin people",
 "title": "Jovan Radonjić"
}