{
 "id": "1157748",
 "text": "Street harassment is a form of harassment. ==Overview== It most cases, street harassment comes in the form of sexual harassment. It usually consists of unwanted sexualised comments, provocative gestures, honking, wolf whistles, indecent exposures, stalking, persistent sexual advances, and touching by strangers, in public areas such as streets, shopping malls and public transportation. Other than actions or comments that have a sexual connotation, it often includes homophobic and transphobic slurs, and hateful comments about race, religion, class, ethnicity and disability. The practice is about power and control. It is often about discrimination. People have said that it may come from the fact that other people did not have the opportunities to express interest or affection. This may be because these people find it difficult to interact with other people. ==Academic views== People of both genders are targeted. Commonly, women are victims more often than men. According to Harvard Law Review (1993), street harassment is considered harassment done primarily by male strangers to females in public places. == History == There is no definitive beginning of street harassment. === Street harassment in history === In the 19th century London, street harassment came into the spotlight as a social issue. In London, new shopping districts were created near the West End. This caused many middle-class women to walk through traditionally male-dominated neighborhoods to purchase the latest goods. Women sometimes found themselves questioned and followed by men who worked in the area. The men's behaviors resembled contemporary working-class courtship rituals. In such rituals, a young man would show his preference for a woman by \"glad-eyeing\" her in the street, and the woman would respond by slowing down her pace. According to Walkowtiz, the public's perception of street harassment was shaped by the middle-class women who were the new subjects of this courtship practice,. This practicer was seen to be far too casual and informal to be proper. The experience of these women was given a greater weight by the society than those of working class women. Leading ladies' journals of the era contained advice on how to avoid being \"spoken to\" by men when going about their business. === Modern anti-street-harassment movements === The modern discussion regarding the subject began in 1944 with the rape of Recy Taylor. Rosa Parks was commissioned to investigate the crime: Taylor, a black woman, was kidnapped and gang-raped in Abbeville, Alabama. Parks responded by starting what was later dubbed the \"strongest campaign for equal justice to be seen in a decade.\" == Prevalence == Worldwide: * 80% of women endure at least occasional street harassment * 45% (at least monthly) avoids going alone to public spaces after dark * 50% (at least monthly) have to find alternate routes to their destinations * 9% have had to switch careers to escape the area in which harassment occurred. * 80% (at least monthly) feel the need to be constantly alert when traversing local streets This problem affects people of all identities, races and ages regularly. == References == Category:Feminism Category:Articles containing Japanese-language text",
 "title": "Street harassment"
}