{
 "id": "1157617",
 "text": "The 2028 United States presidential election will be the 61st quadrennial presidential election. The election will be held on Tuesday, November 7, 2028, along with other state and federal elections. It will be the last presidential election to use population information from the 2020 census. Voters will elect a president and vice president to a four-year term. The winners of the election will be inaugurated on January 20, 2029. Donald Trump won the 2016 and 2024 elections and cannot run for re-election to a third term due to the Twenty-second Amendment. Trump's second term expires at noon on January 20, 2029. Vice President JD Vance and Governors Ron DeSantis, Brian Kemp and Glenn Youngkin are potential contenders for the Republican presidential nomination. Former Vice President Kamala Harris, Governors Andy Beshear, Roy Cooper, Wes Moore, Gavin Newsom, JB Pritzker, Josh Shapiro, and Gretchen Whitmer are potential contenders for the Democratic presidential nomination. == Background == Donald Trump and JD Vance won the 2024 presidential election. Trump, who was elected president in 2016, but lost the election in 2020 to then-former vice president Joe Biden. Trump defeated incumbent vice president Kamala Harris, who began her campaign following Biden's drop out of the race. Republicans secured control of the Senate and retained a House majority. == Eligibility and requirements == Article II, Section 1, Clause 5 of the constitution states for a person to serve as president must: * be a natural- born citizen of the United States. Foreign-born American citizens who met the age and residency requirements at the time the Constitution was adopted were also eligible for the presidency. However, this allowance has since become obsolete. * be at least thirty-five years old. * be a permanent resident in the United States for at least fourteen years. == Electoral map == In the Electoral College, this results in major-party candidates primarily focusing their campaigns on swing states, which can swing between parties from election to election. These states are critical for a presidential candidate's path to victory. For 2028, the expected swing states are Pennsylvania, Wisconsin, and Michigan. The others include Arizona, Georgia, Nevada, and North Carolina, which all were won by Trump in 2024. == Republican Party == === Potential candidates === ==== Ron DeSantis ==== Ron DeSantis has been the governor of Florida since 2019 and recently ran for the Republican nomination in 2024. He appeared in a debate with California governor Gavin Newsom hosted by Fox News' Sean Hannity in November 2023, in what was viewed by NBC News as a potential 2028 presidential bid. ==== Brian Kemp ==== Brian Kemp has been the governor of Georgia since 2019. Kemp has been seen as a potential candidate as being term-limited as governor. New sources believe Kemp will either run for U.S. Senate in 2026 or for president in 2028. ==== JD Vance ==== JD Vance has been the Vice President of the United States since 2025. He was elected vice president after winning the 2024 election as Trump's running mate. Vance is the frontrunner in the primary election, according to The New York Times. He has been dubbed the \"MAGA heir-apparent\" or \"heir apparent of Trumpism\" according to USA Today. The Hill stated that Vance's debate performance against Minnesota Governor Tim Walz in October 2024 improved his status as a presidential contender. ==== Glenn Youngkin ==== Glenn Youngkin has been the governor of Virginia since 2022, and cannot run for re-election by the state's constitution to a second consecutive term. Youngkin has been reported as a possible candidate by Politico. According to The Washington Post, he is prepping for a 2028 presidential bid. == Democratic Party == === Potential candidates === ==== Andy Beshear ==== Andy Beshear has been the governor of Kentucky since 2019. He was recently on the shortlist to be the vice presidential nominee for the 2024 election, and was seen as a potential replacement for President Joe Biden before he withdrew from the race. In October 2024, Beshear headlined an event for the New Hampshire Democrats, a key early primary state, where he promoted both himself and Vice President Kamala Harris to attendees, signaling his future aspirations. In response to ongoing speculation about his political ambitions, Beshear has stated in an interview with WDKY-TV that he will \"see what the future holds\", without actually ruling out a potential presidential run. ==== Roy Cooper ==== Roy Cooper served as the governor of North Carolina from 2017 to 2025. He was considered a potential contender to be the vice presidential nominee for the 2024 election but removed himself from consideration. The New York Times mentioned that Cooper could be a contender for the Democratic party’s 2028 nomination. Politico has also referred to Cooper as a potential contender for the 2028 Democratic Party's presidential nomination. ==== Kamala Harris ==== Kamala Harris was the vice president of the United States from 2021 to 2025. She became the nominee for president in the 2024 presidential election after Biden withdrew his bid, losing to Donald Trump. Harris, who has the largest donor network in the Democratic Party, may run for the presidency again in 2028 according to The New York Times and Politico. Her her loss in the last election could be seen as a disadvantage. In November 2024, Politico reported that Harris is considering running for president in 2028 or for California governor in 2026. ==== Wes Moore ==== Wes Moore has been the governor of Maryland since 2023. Moore has been mentioned by Politico after Trump's victory as one of the Democrats positioning themself for a potential presidential run in 2028. It was also reported by The Baltimore Sun that if Moore is a force campaigning for Democrats in the upcoming midterm cycle, he could position himself as a national voice that would be in talks for the presidency in 2028. ==== Gavin Newsom ==== Gavin Newsom has served as the governor of California since 2019. Newsom has been viewed as a contender for the 2028 presidential election by The New York Times, Politico, and The Washington Post after he garnered national attention by December 2023. He was seen as a potential replacement for Biden after his withdrawal from the 2024 election by The New York Times. According to The New York Times, Newsom was considering a bid for the presidency by September 2023. In November 2023, he appeared in a debate with Florida Governor Ron DeSantis hosted by Fox News' Sean Hannity. The debate was seen as a potential presidential bid by NBC News. ==== Dean Phillips ==== Dean Phillips has served as the representative of Minnesota's 3rd congressional district since 2019. Phillips ran a campaign against Biden in the 2024 Democratic presidential primaries. Phillips received the second-highest number of delegates of any candidate in the primaries, but was unsuccessful. In an interview with CBS Minnesota, Phillips was asked about his future political aspirations. He ruled out a bid for the U.S. senate or the governor's office in 2026 but said, \"never say never\" regarding another presidential campaign in 2028. The HuffPost reported that after the election, Phillips said of his White House bid, “I would do it a thousand times again.” JB Pritzker has been the governor of Illinois since 2019. Pritzker is a potential Democratic contender, according to Chicago Sun-Times. With Newsom, he donated to Middleton. ==== Josh Shapiro ==== Josh Shapiro has been the governor of Pennsylvania since 2023. Shapiro has been seen as a critical figure in Pennsylvania by Democratic strategists and officials, according to Politico and as a politician who could gain votes from white working-class voters, according to CNN. He was said to be a front-runner in the primary by The Philadelphia Inquirer. According to The New York Times, Shapiro was seen as a potential replacement for Biden. ==== Gretchen Whitmer ==== Gretchen Whitmer had been the governor of Michigan since 2019. Whitmer has been discussed as a contender in 2028, although she distanced herself from speculation in an interview with Lulu Garcia-Navarro of The New York Times Magazine in June 2024. She disavowed a movement to replace Biden. == Declined to be candidates == The following individuals stated that they would not run for president: * John Fetterman, U.S. Senator from Pennsylvania (2023–present) and 34th Lieutenant Governor of Pennsylvania (2019–2023) * Mark Cuban, billionaire businessman, co-owner of the Dallas Mavericks, and co-founder of 2929 Entertainment * Donald Trump Jr., businessman and son of incumbent president Donald Trump. == Opinion polling == ===Republican primary=== ==== Aggregate ==== Aggregator Updated JD Vance Donald Trump Jr. Ron DeSantis Nikki Haley Vivek Ramaswamy Macro Rubio Robert F. Kennedy Jr. Other Lead Race to the WH May 29, 2025 47.4% 18.4% 8.8% 5.1% 4.0% 5.3% 5.7% 5.3% Vance +29.0% ==== Nationwide ==== Poll source Date(s) administered Sample size Ted Cruz Ron DeSantis Nikki Haley Robert F. Kennedy Jr. Vivek Ramaswamy Marco Rubio Donald Trump Donald Trump Jr. JD Vance Other Undecided Echelon Insights March 10–13, 2025 450 (LV) 5% 7% 7% 7% 3% 4% — — 46% 5% 16% McLaughlin & Associates February 11–18, 2025 468 (LV) — 6% 3% — 4% 3% — 17% 37% 10% 22% Echelon Insights February 10–13, 2025 466 LV 4% 10% 8% — 5% 4% — — 39% 10% 20% McLaughlin & Associates January 22–27, 2025 453 (LV) — 8% 2% — 3% 3% — 21% 27% 11% 24% January 20, 2025 Second inauguration of Donald Trump McLaughlin & Associates December 11–16, 2024 463 (LV) — 9% 4% – 4% 2% — 21% 25% 9% 24% Morning Consult December 6–8, 2024 994 (RV) — 9% 6% 5% 5% 1% — 30% 30% 19% — Emerson College November 20–22, 2024 420 (RV) 1% 5% 2% 2% 3% 1% 23% — 30% 9% 28% Echelon Insights November 14–18, 2024 483 (LV) 5% 8% 9% — 9% 5% — — 37% 9% 18% November 5, 2024 2024 United States presidential election held. Echelon Insights July 19–21, 2024 456 (LV) 4% 14% 9% — 10% 2% — 25% 16% 21% Echelon Insights January 16–18, 2024 832 (RV) — 27% 19% — 18% — — 1% 18% 17% ==== Statewide ==== ===== Florida ===== Poll source Date(s) administered Sample size JD Vance Ron DeSantis Undecided Fabrizio February 26–27, 2025 600 LV 47% 33% 20% === Democratic primary === ==== Aggregate ==== Aggregator Updated Kamala Harris Pete Buttigieg Gavin Newsom Cory Booker Alexandria Ocasio-Cortez Tim Walz Josh Shapiro Other Lead Race to the WH May 29, 2025 28.4% 13.7% 6.4% 7.7% 11.1% 4.4% 4.8% 23.5% Harris +14.7% ==== Nationwide ==== Poll source Date(s) administered Sample size Pete Buttigieg Mark Cuban Kamala Harris Gavin Newsom Alexandria Ocasio-Cortez Josh Shapiro Tim Walz Other Undecided Morning Consult March 14–16, 2025 10% 4% 36% 5% 5% 4% 5% 23% 13% Echelon Insights March 10–13, 2025 457 (LV) 10% 3% 33% 7% 7% 2% 5% 21% 15% SurveyUSA February 13–16, 2025 835 (RV) 11% 7% 37% 9% 7% 6% 0% 20% — McLaughlin & Associates February 11–18, 2025 418 (LV) 8% — 36% 4% 3% 3% 4% 20% 23% Echelon Insights February 10–13, 2025 447 (LV) 10% 3% 36% 6% 5% 3% 9% 21% 10% McLaughlin & Associates January 22–27, 2025 414 (LV) 9% — 33% 7% 6% 3% 3% 23% 22% January 20, 2025 Second inauguration of Donald Trump McLaughlin & Associates December 11–16, 2024 428 (LV) 12% — 35% 7% 3% 5% 5% 18% 19% Emerson College November 20–22, 2024 400 (RV) 4% — 37% 7% 1% 3% 1% 16% 35% Echelon Insights November 14–18, 2024 457 (LV) 6% — 41% 8% 4% 7% 6% 12% 16% Morning Consult November 15–17, 2024 1,012 (V) 9% — 43% 8% 4% 5% 7% 23% — November 5, 2024 2024 United States presidential election held. Morning Consult/Politico May 28–29, 2024 3,997 (RV) 10% — 21% 10% — 3% — 12% 41% Echelon Insights January 16–18, 2024 499 (RV) 13% — 33% 11% — 2% — 12% 29% ==== Statewide ==== ===== California ===== Poll source Date(s) administered Sample size Cory Booker Pete Buttigieg Kamala Harris Amy Klobuchar Gavin Newsom Josh Shapiro Gretchen Whitmer Other Undecided Capitol Weekly February 6, 2025 681 V 5% 15% 15% 6% 27% 6% 6% 20% — === General election === Poll source Date(s) administered Sample size Donald Trump JD Vance Kamala Harris Gavin Newsom Barack Obama Josh Shapiro Gretchen Whitmer Undecided Poll source Date(s) administered Sample size Undecided Change Research March 10, 2025 42% 49% 9% January 20, 2025 Second inauguration of Donald Trump On Point/SoCal Strategies December 23, 2024 656 (A) 41% 43% 16% On Point/SoCal Strategies December 23, 2024 656 (A) 37% 34% 29% On Point/SoCal Strategies December 23, 2024 656 (A) 37% 34% 29% On Point/SoCal Strategies December 23, 2024 656 (A) 40% 33% 26% American Pulse Research & Polling December 17–20, 2024 661 (LV) 46% 47% 7% == Notes == == References == Category:2028 elections Category:United States presidential elections Category:2020s elections in the United States",
 "title": "2028 United States presidential election"
}