{
 "id": "1157986",
 "text": "John Boswell Cobb Jr. (February 9, 1925 – December 26, 2024) was an American theologian, philosopher, and environmentalist. He was seen as an important academic in process philosophy and process theology.Roland Faber, God as Poet of the World: Exploring Process Theologies (Louisville: Westminster John Knox Press, 2008), 35; C. Robert Mesle, Process Theology (St. Louis: Chalice Press, 1993), 126; Gary Dorrien, \"The Lure and Necessity of Process Theology,\" CrossCurrents 58 (2008): 316; Monica A. Coleman, Nancy R. Howell, and Helene Tallon Russell, Creating Women's Theology: A Movement Engaging Process Thought (Wipf and Stock, 2011), 13. Cobb was the author of more than fifty books.Process and Faith, \"John B. Cobb Jr.\" http://processandfaith.org/misc/john-b-cobb-jr ==Early life== John Cobb was born in Kobe, Japan, on 9 February 1925, to parents who were Methodist missionaries.David Ray Griffin, \"John B. Cobb Jr.: A Theological Biography,\" in Theology and the University: Essays in Honor of John B. Cobb Jr., ed. David Ray Griffin and Joseph C. Hough Jr. (Albany: State University of New York Press, 1991), 225. Until age 15, he lived in Kobe and Hiroshima. In 1940, Cobb moved back to the United States, settling in Georgia to finish high school. Cobb studied at Oxford College of Emory University in Oxford, Georgia and then at the University of Chicago. In 1947, Cobb married Jean L. Cobb. ==Career== In 1971, he wrote the first single-author book in environmental ethics, Is It Too Late? A Theology of Ecology, where he talked about why it was important to have religious thought involved in the ecological crisis.The Center for Environmental Philosophy, \"History of Environmental Ethics for the Novice,\" http://www.cep.unt.edu/novice.html In 1989, he co-authored the book For the Common Good: Redirecting the Economy Toward Community, Environment, and a Sustainable Future. Cobb is the co-founder and co-director of the Center for Process Studies in Claremont, California.The Center for Process Studies, \"About the Center for Process Studies,\" During his career, Cobb was a visiting professor at Harvard Divinity School, University of Chicago Divinity School, Vanderbilt Divinity School, Iliff School of Theology, Rikkyo University in Japan, and the University of Mainz in Germany.The Center for Process Studies, \"John B. Cobb's CV,\" http://www.ctr4process.org/about/CoDirectors/cobb_cv.pdf, Claremont School of Theology, \"CST to Award Cobb Honorary Doctorate at Commencement,\" In 2014, Cobb was elected to the American Academy of Arts and Sciences. ==Death== Cobb died on December 26, 2024 at the age of 99. ==References== ==Other websites== *The Center for Process Studies *Process and Faith *Institute for the Postmodern Development of China *International Process Network *Progressive Christians Uniting *Claremont School of Theology *Living Earth Movement Category:1925 births Category:2024 deaths Category:American theologians Category:American philosophers Category:American environmentalists Category:American Methodists Category:Academics from Chicago Category:Academics from Georgia (U.S. state) Category:Writers from Georgia (U.S. state) Category:Writers from Chicago Category:People from Hyōgo Prefecture Category:People from Hiroshima Category:University of Chicago faculty Category:University of Chicago alumni Category:Emory University alumni Category:American editors",
 "title": "John B. Cobb"
}