{
 "id": "1157124",
 "text": "Kara Mahmud Pasha was an Ottoman-Albanian leader in the 18th century. He became the Pasha of Scutari (modern-day Shkodra) and led military campaigns against Montenegro and the Venetian Republic. His conflicts with both local and Ottoman forces marked his rise to power. Kara Mahmud's leadership significantly influenced Albania's political landscape and resistance against foreign influence. His actions helped shape the history of the Balkans during his time. == Life == === Early Life and Military Service Under His Father and Brother === Kara Mahmud Pasha was born in 1749 into the Bushati family, a prominent Albanian family in the Ottoman Empire. He grew up in the Pashalik of Scutari and began his military career under his father, who was also a powerful leader. After his father’s death, Kara Mahmud took over military responsibilities and continued under the leadership of his brother. === First War with the Pashalik of Berat === Kara Mahmud engaged in his first conflict with the Pashalik of Berat, a neighboring Ottoman region. The war was mainly about control over territories and the growing influence of the Bushati family. === First War with the Montenegrins and Venetians === In 1785, Kara Mahmud led a campaign against the Montenegrins, who had been resisting Ottoman rule. This war also involved the Venetians, who had interests in the region. Kara Mahmud’s forces captured key locations, including Podgorica, and devastated several Montenegrin tribes. === Second War with the Pashalik of Berat === After securing his position in Scutari, Kara Mahmud fought against the Pashalik of Berat again. This conflict was marked by political and military struggles to assert control over the western Balkans. === First War with the Ottomans === Kara Mahmud’s rise to power eventually led to tensions with the Ottoman central government. In his first war with the Ottomans, he fought to maintain his independence from the empire’s direct control. The Ottomans saw Kara Mahmud as a challenge to their authority. === Conflicts with the Tosk Pashas === Kara Mahmud also faced challenges from the Tosk Pashas, rivals in the south. These conflicts were largely about regional power struggles and control over territories in Albania. === Second War with the Ottomans === Kara Mahmud’s power and defiance led to another war with the Ottomans. This conflict marked the peak of his resistance to the Ottoman Empire and had long-lasting effects on his position in the region. === Second War with the Montenegrins === Kara Mahmud fought against the Montenegrins again in a second war. This time, his forces aimed to assert more control over Montenegro, but his military efforts faced strong resistance from the Montenegrins. Kara Mahmud Pasha's life was defined by his military strategies, territorial expansion, and the constant power struggles he faced from both within and outside the Ottoman Empire. His leadership significantly shaped the political and military landscape of the western Balkans during his time.Babinger, Franz. The Ottoman Empire and the Balkans. Cambridge University Press, 2019. Jelavich, Barbara. History of the Balkans: Eighteenth and Nineteenth Centuries. Cambridge University Press, 1983. Anastas, Peter. \"Kara Mahmud Pasha\". Encyclopedia of Albanian History. Stamatović, Aleksandar. \"The Politics of Kara Mahmud Pasha Bushati Towards Montenegro in the 1780s\". Osmanlı Mirası Araştırmaları Dergisi, 2022. https://www.osmanlimirasi.net/dergi/the-politics-of-kara-mahmud-pasha-bushati- towards-montenegro-in-the-1780s-pp-485-50120221125043229.pdf \"Kara Mahmud Bushati\". Wikidata. https://www.wikidata.org/wiki/Q2586846 \"The Illyrian Confederation or Konfederata Ilire (1785-1789) founded by Kara Mahmud Pasha\". Balkan Academia, 2023. https://balkanacademia.com/2023/09/06/the-illyrian- confederation-or-konfederata-ilire-1785-1789-founded-by-kara-mahmud-pasha/ \"Kara Mahmud Pasha - Spouse, Children, Birthday & More\". Playback.fm. https://playback.fm/person/kara-mahmud-pasha \"File:Kara Mahmud Pasha (portret).jpg\". Wikimedia Commons. https://commons.wikimedia.org/wiki/File:Kara_Mahmud_Pasha_(portret).jpg \"How to pronounce Kara Mahmud Pasha\". HowToPronounce.com. https://www.howtopronounce.com/kara-mahmud-pasha \"Kara Mahmud Pasha\". Wikipedia. \"Kara Mahmud Pasha\". Encyclopedia of Albanian History. \"Kara Mahmud Pasha\". Encyclopedia of Albanian History. \"Kara Mahmud Pasha\". Encyclopedia of Albanian History. \"Kara Mahmud Pasha\". Encyclopedia of Albanian History. \"Kara Mahmud Pasha\". Encyclopedia of Albanian History. \"Kara Mahmud Pasha\". Encyclopedia of Albanian History. == References == Category:1749 births Category:Albanian people Category:Ottoman Empire Category:18th century in Asia",
 "title": "Kara Mahmud Pasha"
}