{
 "id": "1157193",
 "text": "A Vaginal yeast infection is an infection caused by too much growth of yeast in the vagina. This causes a discharge and irritation. It is also called candidal vulvovaginitis and vaginal thrush. The fungus Candida albicans is a microscopic fungus that usually causes yeast infections. It is not a sexually transmitted infection. Vaginal yeast infections are not common before a girl menstruates or after menopause. The vagina has a normal growth of bacteria and yeast. But when too much yeast grows, irritation usually happens. Sometimes the medicine used to treat the infection stops working. == Signs and symptoms == A yeast infection is uncomfortable. It can feel like burning. It causes itching. A vaginal yeast infection can cause vaginal discharge. The vaginal discharge can be like water. Sometimes the discharge can be thick, white, and chunky. A woman may have painful sex. It may be painful to urinate. A vaginal yeast infection usually causes the vagina and vulva to become itchy and red. == Risk factors and causes == If the body has a weak immune system this makes it more likely that a woman will get a vaginal yeast infection. Taking certain types of medicine like antibiotics increases the risk of having a vaginal yeast infection. Medications are one cause of a vaginal yeast infection. These are antibiotics, steroids, and chemotherapy. The risk is higher if a woman is are pregnant or who has diabetes. The risk is greater if a woman douches or uses sprays in her vaginal area. == Treatment == To find out whether or not a woman has a vaginal yeast infection, a doctor may: * Ask many questions about the woman's health, * Do an examination of the vulva and vagina, * Look for vaginal discharge, its color, qualities, and odor, * Study a sample of vaginal fluid under a microscope, * Order some more tests. Yeast infections are usually treated with cream or with medicine that is put inside your vagina. a There are medicines that can be bought without a prescription. == See also == * Vaginal flora == References == Category:Diseases and disorders of the female reproductive system Category:Fungal diseases",
 "title": "Vaginal yeast infection"
}