{
 "id": "1157830",
 "text": "Richard M. Vogel is an American hydrologist and environmental engineer. He is a Professor Emeritus in the Department of Civil and Environmental Engineering at Tufts University. ==Education and career== He earned his bachelor of Science in Engineering Science and Systems from the University of Virginia in 1976. He went on to earn his Master of Science in Environmental Science and Hydrology in 1979 and his Ph.D. in Water Resource Systems from Cornell University in 1984. He began his career at Tufts University in 1984 and developed courses and programs related to water resource engineering. He established courses at the undergraduate, master’s, and Ph.D. levels. Additionally, he was instrumental in the creation of the interdisciplinary graduate program Water: Systems, Science, and Society, which involves students from various disciplines across Tufts, excluding the Dental School. In 2016, after 33 years of service, he transitioned to Professor Emeritus. His research has centered on statistical hydrology, hydrologic risk management, and water resource systems. His work has involved developing stochastic watershed models, improving hydrologic design methods, and examining the impact of climate change on water resources. He led a project for the Boston Groundwater Trust to assess groundwater recharge methods in the city. In recent years, his research has focused on the effects of climate change on water resource systems, helping to develop better methods for risk-based planning in the context of climate change. Vogel is also a writer, having authored publications on statistical methods in hydrology. He has written over 150 articles in refereed journals as well as book chapters. He contributed chapters to handbooks, including the Handbook of Hydrology and ASCE Handbooks. In 2021, he was named a Distinguished Member of the American Society of Civil Engineers (ASCE). He received the Ven Te Chow Award from ASCE in 2020, and in 2017, he was elected a Fellow of the American Geophysical Union. ==Selected publications== * * * * ==References== Category:American engineers Category:American academics",
 "title": "Richard M. Vogel"
}