{
 "id": "1157659",
 "text": "Jews have been living in France since the Roman times as one of the oldest diasporas in Europe. * * * * * ==Overview== As France became Christianized in the late antiquity, Christian antisemitism shaped the region's culture and led to over 1,500 years of persecutions of Jews in France. Despite the end of the Holocaust in 1945, antisemitism is still common in 21st century France. ==Middle Ages== Under the Germanic Frankish Merovingian dynasty between the 5th and 8th century, Jews were banned from working as public servants. A succession of ecumenical councils also banned Jews from socializing with Christians or observing the shabbat over the unfounded fear that Judaism (the Jewish ethnoreligion) would influence Christians. ===11th century=== Systematic persecutions of Jews intensified in the 11th century under the Capetian dynasty, when the King of France Robert the Pious tried to kill all Jews who rejected Christian conversion. Jews across the France were assaulted, tortured or burned at stakes. The persecutions coincided with the destruction of the original Church of the Holy Sepulchre in Jerusalem by the Fatimid Caliph Al-Hakim bi-Amr Allah in 1009, which was exploited by French Benedictine monk Rodulfus Glaber to spread rumors about Jewish \"involvement\" in the destruction. ====First Crusade==== When the First Crusade happened in 1096, Jews were massacred by the crusaders across the Kingdom of France. The events were seen by some historians as a series of genocidal massacres. * * * * * The massacres all happened with Roman Catholic Church's tacit approval. Between the 1182 and 1394, at least 13 expulsions of Jews were ordered by the French monarchy, during which dozens of Black Death-associated massacres of Jews happened. ==Modern period== Between the 15th century and 18th century, antisemitism in France waxed and waned. Voltaire (1694–1778), a famous French philosopher, held bias against Jews that contributed to the legitimization of antisemitism in Western academia. * * * * * * One of the instances of Voltaire's antisemitism was his insertion of an insult into his Dictionnaire philosophique for Jewish readers: Despite this, he was regarded as the champion of Enlightenment by Western leftists. ===19th century=== Antisemitism was widespread in 19th century France. It was present across the political spectrum, with ancient stereotypes being phrased differently and perpetuated by their respective audience. Jews were targeted for their otherness, observance of Judaism and alleged lack of loyalty or assimilation. Among the French far left, Jews were accused of being regressive agents of capitalism exploiting the French proletariat. Among the French far right, Jews were accused of being subversive agents of communism undermining the traditional Catholic culture. Meanwhile, both the far left and far right saw Jews as undesirable under French nationalism, which prioritized national unity over minority existence. * * * ====1880s==== Between 1882 and 1885, three antisemitic publications existed in France: L'Anti-Juif, L'Anti-Sémitique, and Le Péril sociale. In 1886, French politician Edouard Drumont published the 1,200-page tract La France juive (\"Jewish France\"), accusing Jews of masterminding capitalism, and calling for a race war between non-Jewish \"Aryans\" and Jewish \"Semites\". The tract was very popular in France and reprinted for 140 times within the first two years of publication. ====1890s==== The wave of antisemitism peaked in the deeply divisive Dreyfus affair in 1894, when Alfred Dreyfus, an Alsatian Jewish artillery officer, was falsely convicted of treason. Dreyfus was not vindicated until 1906. ==20th century== ===World War II=== On 22 June 1940, France surrendered to Nazi Germany upon military defeat and was partitioned into the German-occupied zone, Italian-occupied zone and Vichy France – a rump state in southern France managed by pro-Nazi French collaborators. * * * * * Under Vichy France's leaders Philippe Pétain and Pierre Laval, the Statut des Juifs (\"Jewish Statute\") – modelled after the Nazi German Nuremberg Laws – was passed between October 1940 and June 1941 to ban Jews from all jobs. Just as in Nazi Germany, such legal persecution escalated to the deportation of Jews to extermination camps, one of the worst instances of which was the Vel' d'Hiv Roundup on 16–17 July 1942 voluntarily conducted by the Vichy French police. In total, 77,000 (33%) Jews living in France were killed in extermination camps. * * * * * ===Post-war period=== Antisemitism in post-war France mainly took the form of Holocaust denial and radical anti-Zionism. Pierre Guillaume, an ultra-left anarcho-Marxist activist, published books denying the Holocaust, calling it a \"distraction from class struggle\" that \"played into the hands of Zionism and Stalinism\". * * * ====Influence==== Despite being left-wing, Guillaume's views were adopted by the French far right, who have trivialized the Holocaust by comparing the Holocaust to the Judean massacres of the Canaanites or the Native American genocide, and accused Jews of exploiting the Holocaust to extort compensations from European countries. A number of influential French Holocaust deniers emerged, such as Claude Autant-Lara, Maurice Bardèche, Louis-Ferdinand Céline, Paul Rassinier, François Duprat, Serge Thion, Robert Faurisson, * * * and Dieudonné M'bala M'bala. ==21st century== Antisemitism is still common in 21st century France, * * * * * with Jews and synagogues regularly attacked. A report by Tel Aviv University and the ADL found a spike in antisemitic incidents from 436 in 2022 to 1,676 in 2023, 74% of which happened following 7 October 2023. As per the Statista, 57.4% of 2023 antisemitic incidents happened in Paris. One of the most serious antisemitic incidents involved a 12-year-old Jewish girl being gang-raped by several boys hurling antisemitic insults and death threats. * * * * * Some French Jews said that they had to adopt fake names and wear keffiyehs in order to stay safe. ==Related pages== * Spanish Inquisition * Antisemitism in Europe * Antisemitism in Ireland ==References== Category:Racism Category:Jewish history Category:History of France Category:Antisemitism in Europe",
 "title": "Antisemitism in France"
}