{
 "id": "1157974",
 "text": "In 1788 Lambros Katsonis launched his Aegean campaign. For Katsonis this was a personal win because his wife was imprisoned in the castle of Kastelorrizo as the legend goes, he quickly set his eyes on Kastelorrizo. He moved there where he finally entered the dedoconease islands after destroying a fleet east of Karpathos and liberating most of the dedoconease except Rhodes and he went south surprising the Turks after landing on the island. The locals helped as the turks retreated to the castle as the castle gets surrounded after the rest of the island surrenders as Katsonis bombarded the castle with artillery they stole from the port, with much less forces he was forced to bombard as he launched an assault as the castle fell after multiple artillery strikes and the first charge the castle fell as Katsonis felt merciful and let the 500 go back to Anatolia meanwhile he looted the Muslim sector burning down the mosque. The locals joined in despising the Muslim hierarchy and multiple joined Katsonis' ranks. Katsonis' victory scared the Sultan as he sent an offer to the Greeks after massive defeat as Katsonis disliked him so much he did not even respond beggining the battle of Tinos next year after winter time as an Archbishop at gunpoint was forced to write a letter to the Greeks of the Aegean against \"Shenanigan and Pirate\" Lamabros Katsonis. This was a massive turning point in the fate of the Balkans as the first actual modern revolt was the orlov revolt but the first one to succeed was Lambros Katsonis' revolt as Lambros Katsonis was named as \"prince of Mani\" as Mani peninsula stayed fiercely independent until the revolution began when it became Greek. ==References== 2.https://www.tromaktiko.gr/155745/san-simera- to-1789-o-lampros-katsonis-nika-ton-tourkiko-stolo-exo-apo-tin- tino/#google_vignette Category:18th-century conflicts Category:18th century in Asia Category:Aegean Region Category:Ottoman Empire",
 "title": "Siege of Kastelorrizo"
}