{
 "id": "1157277",
 "text": "Petar I Petrović-Njegoš (1748–1830) was the Prince-Bishop of Montenegro from 1784 to 1830 and a key leader of the Serbian Orthodox Church in the region. He was the most popular leader from the Petrović family. During his long rule, Petar united the often-conflicting tribes, strengthened his control over Montenegro, and introduced the first laws in 1798. His leadership laid the foundation for modern systems in Montenegro, including taxes, schools, and businesses. Petar was later canonized as Saint Peter of Cetinje by the Serbian Orthodox Church. He was described as tall, handsome, talented, and highly respected. ==Time as Prince-Bishop== Petar I Petrović-Njegoš was made a bishop on October 13, 1784, by Mojsije Putnik. Afterward, he met important leaders like Russian chancellor Potemkin and Austrian general Zorić. In 1785, he was forced to leave St. Petersburg, and Montenegro faced threats from Kara Mahmud Pasha, who attacked in 1785. Despite heavy losses, the Montenegrins managed to hold their ground. Petar I and Jovan Radonjić were the two main leaders in Montenegro, but they often disagreed. Jovan wanted to rule alone and sought support from Austria, while Petar I favored Russia. Their rivalry split Montenegro into two factions: \"Russophiles\" and \"Austrians.\" In 1796, Petar I led the Montenegrin army to victory over Kara Mahmud Pasha at the Battle of Martinići. This victory expanded Montenegro’s territory, bringing more tribes into the state. Petar also worked to end the long-standing feud between the Njeguši and Ceklin tribes in 1797, which helped unite Montenegro. In 1799, Russia guaranteed support for Montenegro, strengthening its position. During the First Serbian Uprising (1800–1809), Petar I cooperated with Serbian leader Karađorđe and planned a revolt against the Ottomans with Russian help. In 1806, he helped drive back French forces, but political changes led to a shift in control of the Bay of Kotor. By 1819, Petar I had led successful campaigns against Ottoman forces, and Montenegro gained recognition for its sovereignty. He succeeded in uniting several tribes into the Montenegrin state, which officially became known as \"Black Mountain (Montenegro) and the Hills\" by 1820. ==References== Category:1748 births Category:1830 deaths Category:Eastern Orthodox bishops Category:Montenegrin people Category:Christian saints",
 "title": "Petar I Petrović Njegoš"
}