{
 "id": "1157922",
 "text": "The Unitarian Church of Transylvania (also called the Hungarian Unitarian Church) is a Hungarian Christian denomination in Transylvania with its center in Cluj-Napoca (Kolozsvár). == History == The Unitarian Church was founded by Ferenc Dávid as a continuation of the Reformation. The church's founding year is considered to be 1568, when the Diet of Torda declared freedom of conscience and religion. This made Unitarianism an officially recognized faith alongside Catholicism, Lutheranism, and Calvinism. John II Sigismund, Prince of Transylvania, was a strong supporter of the church. At the Diet of Marosvásárhely (now Târgu Mureș) in 1571, he reaffirmed the decision of the Diet of Torda. The prince also allowed Ferenc Dávid to use the printing press in Gyulafehérvár (Alba Iulia) to spread Unitarian teachings. After the death of John II Sigismund, the Catholic Báthory princes supported the Counter- Reformation in Transylvania. Báthory Kristóf forbade Ferenc Dávid from preaching and imprisoned him in the fortress of Déva (Deva), where he later died. To stop the spread of the Reformation, Báthory brought Jesuits into the country. After Ferenc Dávid's death, György Enyedi became the protector of the Unitarian faith. Among the princes of Transylvania, besides John II Sigismund, Mózes Székely, born in Székelyudvarhely (now Odorheiu Secuiesc), was also Unitarian. In 1605, István Bocskai, elected Prince of Transylvania, expelled the Jesuits from the region and restored the Unitarians' confiscated churches and their college.The Habsburg rule brought a period of decline for the Unitarian Church, as it did for other historic Protestant churches. Under the Habsburgs, Protestants faced disadvantages in all areas compared to Catholics. The Unitarians lost many of their churches during this time. Maria Theresa even took important churches from the Unitarians, such as the main square church in Székelykeresztúr (now Cristuru Secuiesc), considered a Unitarian stronghold. These actions were carried out regardless of the actual number of believers, often forcing Protestant congregations in predominantly Protestant towns to give up their churches for the benefit of small Catholic communities. The Edict of Toleration eventually reduced the discrimination faced by Protestants in the country, although it did not create equal conditions. While it allowed Protestants to practice their religion freely under regulated circumstances, it still ensured the absolute dominance of Catholics in all areas. For example, in mixed marriages, the edict stated that only the sons of Protestant fathers could remain Protestant, while all children of Catholic fathers would be Catholic. Despite these remaining disadvantages, the edict helped slow the decline of Protestant populations within the empire. The First World War brought significant losses for Unitarians, and the Treaty of Trianon placed the majority of their members in a minority position, also dividing the church. Most Unitarians ended up in Romania, while a smaller group (a few thousand people) remained citizens of Hungary. Despite this division, an official institutional separation did not happen for a long time. In 1968, the part of the church located in Hungary became independent and operated as a separate church under the name Unitarian Church of Hungary, with its own leadership. This arrangement continued until 2010. The anti-church stance and atheist propaganda of communism caused significant damage to churches, and the Unitarian Church, due to its strong Hungarian identity, was especially affected. As a result, it suffered more severe losses compared to larger historical churches. In 1948, the communist government nationalized church properties and institutions. This was when the church lost its most important institutions, including its two most significant colleges (the Kolozsvár and Székelykeresztúr Unitarian colleges). These institutions were only re- established after the change of regime, and it took many more years for the buildings to be returned. On November 22, 2010, after 42 years, the unity of the Unitarian Church was restored. The Unitarian Church of Transylvania reunited with the Unitarian Church of Hungary, and the newly united church was named the Hungarian Unitarian Church. The center of the united church is in Cluj-Napoca (Kolozsvár), and its bishop is István Kovács. In the 2011 census, there were 57,686 Unitarians in Romania and 6,266 in Hungary. == Educational institutions == * Unitarian Faculty of the Protestant Theological Institute – Cluj * Mózes Berde Unitarian High School - Cristuru Secuiesc * János Zsigmond Unitarian High School - Cluj * Unitarian Kindergarten - Cluj ==References== Category:Transylvania Category:Unitarianism",
 "title": "Unitarian Church of Transylvania"
}