{
 "id": "1157380",
 "text": "Scott Fellows is an American television screenwriter and the Creator of Ned's Declassified School Survival Guide, Big Time Rush, Johnny Test, 100 Things to Do Before High School and Supernoobs. Fellows was born in Connecticut in 1965. == Early Work for Nickelodeon == In 1993, Fellows started writing for a Nickelodeon puppet show called Weinerville starring Marc Weiner. Then Fellows started writing for another Nickelodeon show called U2U and for a sketch comedy show called All That. Then, in 1995, Scott Fellows had the idea for a show about Mad scientist twin sisters who test things on their little brother Johnny and called the show Johnny Test. Fellows got someone named David Straiton to help him convince Nickelodeon to make the show but Nickelodeon said no because they thought it was too much like Dexter's Laboratory. Then, in the year 2000, Fellows asked Warner Bros to make Johnny Test but they said no. Then Fellows started writing for a show called 100 Deeds of Eddie McDowd and he also wrote episodes of Doug. == Nickelodeon == Then Fellows started working as a writer for the Disney Channel show Recess. Then, in 2001, Fellows started working as a writer for The Fairly OddParents. In 2003-2004, Fellows became an executive producer for The Fairly OddParents. == Ned’s Declassified == Then Nickelodeon asked Fellows and some other writers for The Fairly OddParents if they had any ideas for live action shows. Fellows then came up with a show about a group of kids in Middle school trying to write a book about how to be in middle school called Ned's Declassified School Survival Guide. Nickelodeon liked the idea and made the show. == Big Time Rush == After Ned’s Declassified School Survival Guide ended, Nickelodeon asked Fellows if he had ideas for other shows. Fellows told them he could create a spin-off called Ned’s Declassified High School Survival Guide which would be about High school. Nickelodeon said no because they wanted shows about music. So Fellows said he could make a show about “the worst Boy band ever” and have it be a Sitcom. Nickelodeon liked that idea, so Fellows wrote a Pilot episode and he made the band Big Time Rush to be in the show, which he also called Big Time Rush. == Johnny Test == After that, Cartoon Network agreed to make Johnny Test and Fellows wrote a lot of episodes of it. David Straiton sued Fellows for plagiarism since Straiton said he was also a Creator of Johnny Test. == Fairly Odd Movie == Fellows helped write the screenplay for the Fairly Odd Parents live-action movie (which was also written by Butch Hartman.) == 100 Things to do Before High School == After Big Time Rush ended, Fellows created a show called 100 Things to Do Before High School about a girl in middle school trying to do 100 different things that she won’t be able to do in high school. == Supernoobs == After 100 Things to Do Before High School, Fellows made a show called Supernoobs. == Rocky and Bullwinkle == Fellows then became an executive producer for a remake of Rocky and Bullwinkle. == Outside Websites == 1) Scott Fellows Trivia at IMDB 2) David Straiton complaint against Scott Fellows to the California Superior Court 3) Do You Think Nickelodeon Made the Right Decision to Reject Johnny Test? Reddit discussion thread 4) Scott Fellows’s page on The Fairly OddParents Wiki 5) Ned’s Declassified Adult Survival Guide Plot Revealed Episode 20, Podcast Interview with Scott Fellows 6) A Fairly Odd Movie: Grow up, Timmy Turner Writing Credits at IMDB 7) 100 Things to do Before High School Series Writing Credits at IMDB 8) Supernoobs Writing Credits at IMDB 9) The Adventures of Rocky and Bullwinkle Production Credits at IMDB",
 "title": "Scott Fellows"
}