{
 "id": "1157382",
 "text": "Ireland has been predominantly Catholic throughout history. * * * * * Just as other Catholic countries, antisemitism IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. * * * * * * is deep-rooted in Ireland. ==Modern period== As per specialized historians, Irish Catholics played an active role in the Catholic Spanish Inquisition's persecution of Jews (1478–1834), * * * killing as many as 300,000 Jews by false convictions of \"crypto-Judaism\", * * * * * * * * * * a charge slapped on Jews who were forcibly converted to Christianity under Catholic Spanish rule. ==20th century== Throughout the 1930s and 1940s, pro-Nazi sentiment was common among the Irish due to their dislike of the United Kingdom, * * * * * * which was fighting Nazi Germany. In July 1940, the Irish Republican Army (IRA) praised Nazi Germany as the \"friends and liberators of the Irish people\" in a statement, with little to no opposition from the Irish public. * * * * * Meanwhile, the IRA worked with Nazi spies to plot attacks on British troops in Northern Ireland and circulated materials accusing Éamon de Valera's neutral Irish government of being owned by \"Jews and Freemasons\". As per declassified MI5 documents, IRA leading figures Seán Russell and James O'Donovan – both veterans of the Irish War of Independence – were the main Irish contacts with Nazi Germany. They got Nazi weapons, plotted joint attacks on British troops and discussed with Hitler a possible German invasion of Northern Ireland to facilitate Irish \"reunification\". As per Kurt Haller, an anti-Nazi German diplomat who testified in the Nuremberg Trials, As per Erwin von Lahousen, a Nazi German general who also testified, After Adolf Hitler's death on April 30, 1945, Éamon de Valera, the Prime Minister of Ireland, mourned the death of Hitler * * * * * with backing from the Irish parliament. De Valera also denied reports of the Bergen-Belsen concentration camp as \"anti-national propaganda\", reportedly out of refusal to acknowledge that the Jews could have suffered more than the Irish. ==21st century== Since 2013, * * * * * * * * * * a baseless theory, which claims that \"Irish slaves\" existed in 17th century North America before the arrival of African slaves, has been made popular by Neo-Nazis and Holocaust deniers in both Ireland and the United States. The theory is sometimes called the \"Irish slaves myth\". The myth reportedly originated from the book To Hell Or Barbados: The Ethnic Cleansing of Ireland written by Irish journalist Seán O'Callaghan (1918–2000) and published by The O'Brien Press in Dublin, Ireland. The myth has been widely condemned by scholars as a far-right conspiracy theory downplaying the suffering of African Americans in history, who were enslaved until 1865, segregated until 1965 and systemically discriminated against until now. * * * * * Despite To Hell Or Barbados: The Ethnic Cleansing of Ireland promoting the widely condemned far- right myth, the book is still on sale in the Sinn Féin Bookshop run by the Irish nationalist Sinn Féin party. * * * * * In spring 2024, antisemitism in Ireland reportedly worsened with the escalation of the Israel–Hamas war, where antisemites felt justified to harass Jews under the guise of supporting Palestine, and some Irish Jewish community leaders were doubtful if Ireland was still safe * * * for the approximately 2,700 Jews – 0.054% of the 2023 Irish population – in Ireland. In November 2024, it was revealed that textbooks teaching that * the Jews \"killed Jesus\" * Israel was \"uniquely aggressive\" * Judaism \"believed that violence and war are necessary\" * the Auschwitz was a \"prisoner of war camp\" rather than an extermination camp were widely circulated in Irish schools * * * * * and shaping children's mind. The findings were confirmed by the European Jewish Congress (EJC). Meanwhile, the Government of Ireland has not responded to the matter, nor have any strong reactions been seen from the Irish public. ===Critique=== David Collier, an Irish researcher in Middle East affairs, noted that antisemitism among contemporary Irish is derived from * Religious antisemitism: Classic Christian belief that \"Christians are the new Jews\" as \"the Jews killed Jesus\" * Political antisemitism: ** Popularity of the Irish nationalist Sinn Féin party whose founders promoted conspiracy theories about Jews ** Projection of anti- British sentiment onto Israel * * * * * due to the belief that \"Britain gave the Jews Israel\" is similar to the British settler colonialism in the history of Ireland. * * * * * * * * * * ==References== Category:Racism Category:Ireland Category:Antisemitism Category:Discrimination Category:Antisemitism in Europe",
 "title": "Antisemitism in Ireland"
}