{
 "id": "1158152",
 "text": "Gupta was the founder of the Gupta dynasty. He is believed to be the same as King Che-li-ki-to, whose name is thought to be the Chinese transcription of Shri-Gupta. According to the 7th-century Chinese Buddhist monk I-tsing, Gupta built a temple near a place called Mi-li-kia-si-kia-po-no (Mṛgaśikhāvana) for Chinese pilgrims. This temple was located in eastern India. Based on different interpretations of its location, modern scholars place Gupta's territory in either present-day eastern Uttar Pradesh or the Bengal region. == Name and Date == Gupta is not known from any inscriptions or coins of his own. The earliest mention of Gupta comes from the Prayagraj Pillar Inscription of his great-grandson, Samudragupta. This description is repeated word-for-word in several later records of the Gupta dynasty. Some earlier scholars thought that the founder of the dynasty was named Shri-gupta, as Gupta does not seem like a personal name. However, it is now widely accepted that Shri is an honorific title and not part of the king's name. Gupta was the actual name of the ruler. The Vishnu Sahasranama includes Gupta among the 1008 names of Vishnu, showing that it could be used as a personal name. The name Gupta comes from the word gup, which means to protect. Gupta most likely ruled in the second half of the 3rd century, although the exact dates of his reign cannot be determined with certainty based on the available evidence. == Territory == Some scholars, like D. C. Ganguly and R. C. Majumdar, have interpreted I-tsing's description to suggest that the temple was located more than 40 yojanas east of Nalanda, along the Ganga river, and have identified its location in the present-day Bengal region. Majumdar believed that the name \"Mi-li-kia-si-kia-po-no\" was a transcription of Mriga-sthapana, the name of a stupa located in the historical Varendra region of Bengal. According to Ganguly, this suggests that the Gupta dynasty originated in Bengal, while Majumdar argued that it only shows that Bengal was part of Gupta's kingdom. Other scholars, such as B. P. Sinha and Jagannath Agrawal, interpret Yijing's account of \"Mi-li-kia-si-kia-po-no\" as a transcription of Mriga-shikha-vana and identify it with Mrigadaya (Deer Park) in Sarnath, which is in present-day eastern Uttar Pradesh. Ashvini Agrawal argues that \"Mi-li-kia-si-kia-po-no\" is not a perfect transcription of Mriga- sthapana, but rather closer to Mriga-shikha-vana, and suggests that a different interpretation of Yijing's writings places it in Sarnath. Sinha further theorizes that Hwui-lun mistakenly mentioned its location as being east of Nalanda. These historians propose that the Gupta dynasty likely originated in eastern Uttar Pradesh. == References == Category:India Category:Gupta Empire Category:Ancient India",
 "title": "Gupta (King)"
}