{
 "id": "115847",
 "text": "The Atlantic Coast Conference (ACC) is one of the major college sports conferences in the United States. It was formed in 1953 by a group of seven colleges and universities that left the Southern Conference. == Members == In the 2023–24 school year, the only sport in which the conference's members were split into groups—the Atlantic and Coastal Divisions—was baseball. The Atlantic–Coastal split was also used in football before the 2023 season. The ACC has not announced whether a divisional split will continue in 2024–25 after the arrival of two new baseball members (California and Stanford; the other 2024 arrival, SMU, does not have a baseball team). Notre Dame does not play football in the ACC; in that sport, it remains an \"independent\" school that does not play in a conference. However, it has agreed to play five of its 12 regular-season games each year against other ACC schools. Syracuse does not have a baseball team; Notre Dame takes its place in the Atlantic Division for that sport. Amid a major NCAA conference realignment in the early 2020s, the ACC announced on September 1, 2023 that it would add three new members for the 2024–25 school year. Two left the Pac-12 Conference, which collapsed at the end of the 2023–24 school year, and the other left the American Athletic Conference. School Location Founded Type (affiliation) Nickname Joined ACC Boston College Chestnut Hill, Massachusetts 1863 Private (Catholic) Eagles 2005 Berkeley, California 1868 Public Golden Bears 2024 Clemson University Clemson, South Carolina 1889 Public Tigers 1953 Duke University Durham, North Carolina 1838 Private (nonsectarian) Blue Devils 1953 Florida State University Tallahassee, Florida 1851 Public Seminoles 1991 Georgia Institute of Technology (Georgia Tech) Atlanta, Georgia 1885 Public Yellow Jackets 1979 Louisville, Kentucky 1798 Public Cardinals 2014 MiamiUniversity of Miami Coral Gables, Florida 1925 Private (nonsectarian) Hurricanes 2004 North CarolinaUniversity of North Carolina at Chapel Hill Chapel Hill, North Carolina 1789 Public Tar Heels 1953 North Carolina State University Raleigh, North Carolina 1887 Public Wolfpack 1953 Notre DameUniversity of Notre Dame South Bend, Indiana 1842 Private (Catholic) Fighting Irish 2013 PittsburghUniversity of Pittsburgh Pittsburgh, Pennsylvania 1787 State-related Panthers 2013 (SMU) Dallas, Texas 1911 Private Mustangs 2024 Stanford University Stanford, California 1891 Private Cardinal 2024 Syracuse University Syracuse, New York 1870 Private (nonsectarian) Orange 2013 VirginiaUniversity of Virginia Charlottesville, Virginia 1819 Public Cavaliers 1953 Virginia Polytechnic Institute and State University (Virginia Tech) Blacksburg, Virginia 1872 Public Hokies 2004 Wake Forest University Winston-Salem, North Carolina 1834 Private (nonsectarian) Demon Deacons 1953 ===Former members=== Two schools have left the ACC: School Location Founded Type (affiliation) Joined Left Current conference Nickname College Park, Maryland 1801 Public 1953 2014 Big Ten Conference Terrapins Columbia, South Carolina 1801 Public 1953 1971 Southeastern Conference Gamecocks ==Sports== As of the 2024–25 school year, the ACC holds championships in 28 sports. Thirteen of these are men's sports and 15 are women's sports. One sport, fencing, has separate ACC men's and women's team championships, but has a single coeducational (men's and women's) NCAA team championship. * Baseball (men only) * Basketball (both) * Cross country (both) * Fencing (coeducational) * Field hockey (women only) * Football (men only) * Golf (both) * Gymnastics (women only) * Lacrosse (both) * Rowing (women only) * Soccer (both) * Softball (women only) * Swimming and diving (both) * Tennis (both) * Track and field, indoor (both) * Track and field, outdoor (both) * Volleyball (women only) * Wrestling (men only) ==References== *",
 "title": "Atlantic Coast Conference"
}