{
 "id": "1158882",
 "text": "The first church was originally constructed by Saint Thomas Christians (Syriyans) of Maanaanjery (Maanaanjery is a village near Thuruthoor) near the Arabian Sea in the 9th century (AD 800's). The church was dedicated to St. Mary. The church was located 4km from south-west location of today's St. Michael's church Maanaassery. Today this place is popularly known as Maanaassery. At that time there were only three parishes in West Kochi: north- east side Mattanchery Our Lady Of Life Church, east side Edakochi St. Lawrence Church and Our Parish church. In the 14th century the church was destroyed the sea erosion and still is now under water. In AD 1498 Portuguese missionaries are arrived in the land. They built a new church and they changed the name to \"St. Louis\" It was the second Parish church of Mundamveli. In 17th century the church was again destroyed by the sea erosion. In 1605 these Syrian Churches like Edakochi, Mattanchery and Mundamveli were converted to Latin Rite. In the 19th century another church was established near the Arabian Sea but in 1808 it was burned by the soldiers of the king of Kochi. After that incident, in 1850 parishioners built a small church in Cemetry. This is the fourth church this church is presently using as the cemetry church. At that time the parish vicar was very confused about the continued flood and these kind of incidents and he was suffered how to overcome the situation. In his mind it was very difficult to find a place to built a new church. At that time the government offered the land to build a new church in Mundamveli farm. The 5th parish church was inaugurated on 20 June 1868, as the fifth church. In 1997, the church was renovated for its 130th anniversary. In earlier years before St. Louis Parish were the biggest parish in West Kochi because: * Chellaanam St. Sebastians' (1832) * Thoppumpady St. Sebastian's (1833) * Maanaassery St. Michael's (1870) * Kannamaly St. Antony's (1877) * Cheriyakadavu St.Joseph's (1965) * Chirackal St.Joseph's (1968) * Kaattiparambu St. Francis Assisi's (1980) * Santhome St. Thomas (1990) These parishes were separated from Mundamveli parish. ==References== Category:Churches in India",
 "title": "St Louis Church, Mundamveli"
}