{
 "id": "1158936",
 "text": "The floods in Santa Fe in 2003 were a meteorological event that occurred between April 29 and May 3 of that year that affected Santa Fe, Argentina and also surrounding towns due to unprecedented growth at that level of the Salado River plus intense rainfall. that had been brewing for about five days before. It was one of the most important catastrophes in the country due to its magnitude, which occurred during the government of Carlos Reutemann. In the following months there were cases of scabies, mycosis, pediculosis, diarrhea, acute respiratory symptoms, hepatitis, leptospirosis (a disease that is not fatal, but cases of deaths due to it have been reported) and even chickenpox. Many people suffered from high blood pressure and nervous breakdowns. There were also a large number of psychotic breaks and people addicted to narcotics with withdrawal symptoms. ==Overview== At the end of April 2003, several days of heavy rainfall caused some major rivers in the Santa Fe area to rise as much as 50 cm in 12 hours. The water level of the Salado River (which flows through the north of the province and empties into the Paraná) rose by almost two metres in just three hours. On 28 April, the Salado overflowed its margins and flooded large sections of Santa Fe.Argentina: Santa Fé Province Floods Information Bulletin No. 01/03 ReliefWeb About 100,000 people had to be evacuated, 154 people died, and 28,000 houses were damaged or destroyed. A dyke had to be blown up in order for ease the flow of the floodwaters out of the city. In this key area for the agricultural and ranching industries, over 30,000 km2 of farmland were destroyed. The flood hit the capital hardest, but many other communities were also affected. ==Warnings== Months before the tragedy, various media broadcast news that the Salado River was rising at an exceptional rate and that an extraordinary flood was brewing: * On March 17, the newspaper La Nación (Buenos Aires) published a note, from its Santa Fe correspondent, warning of an \"exceptional\" flood of the Salado. * On March 18, deputy Juan Domingo Demaría declared to the newspaper El Litoral (from Santa Fe) that there were areas in the province \"that are very bad, like Villa Saralegui, where there are evacuees, the roads are cut off and the liquid mass that \"If it moves towards the Salado, it will take time to drain away.\" * On April 30, the newspaper Página/12 (from Buenos Aires) published a note, in which it said that since mid-March the Salado River had been rising at a rate that was already considered exceptional. ==References== Category:21st century in Argentina Category:2023 in South America Category:2023 in weather Category:2023 floods Category:Natural disasters in Argentina",
 "title": "2003 Santa Fe flood"
}