{
 "id": "1158135",
 "text": "The Bawarij Attack in Oman also referred as the Bawarij Attack in Basrah, was a naval assault carried out by the Bawarij Pirates from India against the Ibadi state of Oman in the ninth century. During this naval attack, the pirates caused the deaths of fifty people in Basrah. == Background == In the beginning of the ninth century, The Abbasid Caliphate had dispatch a naval invasion to conquer the Ibadi state. However the Abbasid forces were defeated and the Ibadi state mantained independence. Soon, the Ibadi state under the reign of Imam Ghassan had become an unfeigned naval power in Arabia yet his reign was disrupted by raids by the pirates from India. These pirates were known as the Bawarij. ==Raids== During this period of time, Maritime raids into the Arabian sea and the Arabian gulf was a problem. On March 27, 865 CE, ten deepwater ships called bawarij sailed from al-Basrah. Each of these ten vessels was crewed by a ship's captain, three sailors who hurled fire onto enemy ships, a carpenter, a baker, and thirty-nine rowers and warriors. As a result, each vessel had a total crew of forty-five individuals. That night, the bawarij pirates arrived at the island facing the palace of Ibn Tahir, and later they reached the Shammasiyyah area. The bawarij pirates on the vessels fired upon the Turks, causing them to relocate their camp from the low-lying area of al-Shammasiyyah to Abū Ja'far's garden near the bridge. It then became apparent to the Turks that they needed to retreat even higher, to a location above their previous camp, in order to escape the fire being thrown at them. Imam Ghassan had received a letter from Munir, an Ibadhi missionary from Basra. In the letter, Munir deplores the attacks in the Indian Ocean and the Arabian Gulf carried out by the Bawarij pirates from India. In particular, Munir also strongly deplores the killing of fifty people by the Bawarijs during their attack. ==Aftermath== As a response to the problem caused by Bawarij pirates, Imam Ghassan moved to Sohar for 5 years. During his stay in Sohar, he established the first naval force of Oman. This was done to protect the coastal communities and ships of Oman from attacks by Indian pirate raiders known as al-bawārijs, or Bawarijs. == References == Category:Battles involving India Category:860s Category:History of Pakistan",
 "title": "Bawarij Attack in Oman"
}