{
 "id": "1158206",
 "text": "This is a list of association football related deaths in 2024: ==January== *January 1: ** Mario Boljat (72), footballer (Hajduk Split, Schalke 04, Yugoslavia). ** Ries Coté (77), footballer (Elinkwijk, FC Utrecht). ** Óscar Ortubé (79), referee (Bolivian Primera División, Copa Libertadores, Copa América). *January 2: ** Ángel Castellanos (71), footballer (Sabadell, Granada, Valencia). ** Alberto Festa (84), footballer (Tirsense, FC Porto). ** Bobby Hoy (73), footballer (Huddersfield Town, Halifax Town, York City, Rochdale). *January 3: ** Sebastian Brodrick (85), footballer (Lagos ECN, Bendel Insurance, Nigeria), played at the 1968 Summer Olympics. ** Bernard Ducuing (73), footballer (Red Star, Stade de Reims, Montpellier). *January 4: ** Keith Lamb (77), chartered accountant and football Chief Executive (Middlesbrough). ** Leonid Tkachenko (70), footballer (Baltika Kaliningrad, Spartak Zhytomyr, Metalist Kharkiv) and manager (Metalist Kharkiv, Ukraine, Temp Shepetivka, Baltika Kaliningrad, Sokol Saratov, Anzhi Makhachkala, Dynamo Saint Petersburg, Petrotrest St. Petersburg, Sever Murmansk, Volga Tver). ** Tomonobu Yokoyama (38), footballer (Kawasaki Frontale, Cerezo Osaka, Omiya Ardija, Hokkaido Consadole Sapporo). *January 5: ** Vinod Patel (84), businessman, politician, and football administrator (Ba F.C.). ** Mário Zagallo (92), footballer (Flamengo, Botafogo, Brazil) and manager (Botafogo, Brazil, Fluminense, Flamengo, Kuwait, Al-Hilal, Vasco da Gama, Saudi Arabia, Bangu, United Arab Emirates). Won the FIFA World Cup four times. *January 6: ** Zahirul Haque (89), footballer (Police AC, Mohammedan SC, East Pakistan, Pakistan). *January 7: ** Franz Beckenbauer (78), footballer (Bayern Munich, New York Cosmos, Hamburger SV, West Germany) and manager (West Germany, Olympique Marseille, Bayern Munich). 2-time FIFA World Cup winner and 2-time Ballon d'Or winner. ** Bohdan Shershun (42), footballer (Dnipro Dnipropetrovsk, CSKA Moscow, Arsenal Kyiv, Kryvbas Kryvyi Rih, Volyn Lutsk, Ukraine) and assistant manager. *January 8: ** Frans Janssens (78), footballer (Turnhout, Lierse, Belgium). *January 9: ** Vazgen Manasyan (65), footballer (Pamir Dushanbe, Zenit Saint Petersburg, Vorskla Poltava, Tajikistan), assistant manager (Volochanin-Ratmir Vyshny Volochyok, Tajikistan), and manager (Volochanin-Ratmir Vyshny Volochyok, Chernomorets Novorossiysk, Lokomotiv Tashkent). *January 10: ** Peter Johnson (84), businessman, football investor (Tranmere Rovers), chariman (Everton), and club president (Tranmere Rovers). *January 11: ** Mel Blyth (79), footballer (Scunthorpe United, Crystal Palace, Southampton, Cape Town City, Millwall, Bulova SA) ** Salvatore Mazzarano (58), footballer (Fasano, Casarano, Ancona, Taranto, Castrovillari) *January 12: ** Luis (77), footballer (Deportivo La Coruña, Getafe Deportivo) ** Azzedine Meguellatti (63), manager (FCM Aubervilliers, Istres, Red Star, AS Poissy, Racing Club de France) and scout (Toulouse) *January 13: ** Keith Davies (90), footballer (Tranmere Rovers) ** Tony Formosa (86), footballer (St. Patrick FC) and manager (Hamrun Spartans, Malta, Valletta, Floriana, Sliema Wanderers) ** Bertin Ollé Ollé (62), footballer (Tonnerre Yaoundé, RC Bafoussam, Cameroon) ** Laureano Rubial (76), footballer (Langreo, Plus Ultra, Pontevedra, Real Zaragoza, Terrassa) *January 14: ** Ricardo Alós (92), footballer (Valencia Mestalla, Sporting Gijón, Valencia, Real Murcia, Spain B) ** Denis Connaghan (79), footballer (Celtic, St Mirren, Baltimore Bays, Morton, Clyde). Father of former Scottish footballer Denis Connaghan. *January 15: ** Georgios Darivas (97), footballer (Olympiacos, Greece) and manager (Olympiacos, Fostiras, Vyzas, Ilisiakos, Apollon Kalamarias, Panegialios, Trikala). Played at the 1952 Summer Olympics. ** Jorge Griffa (88), footballer (Newell's Old Boys, Atlético Madrid, Espanyol, Argentina) ** Dror Kashtan (79), footballer (Hapoel Petah Tikva, Hapoel Kfar Saba, Israel) and manager (Hapoel Kfar Saba, Hapoel Lod, Israel U-21, Beitar Jerusalem, Maccabi Haifa, Hapoel Ramat Gan, Maccabi Petah Tikva, Hapoel Haifa, Maccabi Tel Aviv, Hapoel Tel Aviv, Hapoel Petah Tikva, Israel, Bnei Yehuda) *January 16: ** Klaus Wunder (73), footballer (Arminia Hannover, MSV Duisburg, Bayern Munich, Hannover 96, SV Werder Bremen, West Germany). Played at the 1972 Summer Olympics. *January 17: ** Bennie Muller (85), footballer (Ajax, Holland Sport, Blauw-Wit Amsterdam, Netherlands) ** Alex South (93), footballer (Brighton & Hove Albion, Liverpool, Halifax Town) *January 18: ** Ray Henderson (86), footballer (Middlesbrough, Hull City, Reading) and manager (Halifax Town, Southport) ** John Hurst (76), footballer (Everton, Oldham Athletic), coach (Everton), and scout (Manchester City). Member of the Gwladys Street's Hall of Fame. ** Giuseppe Ticli (44), footballer (Internazionale, Padova, Arezzo, Reggiana, San Marino Calcio, Monza, AC Milan, Lanciano, Pro Patria) *January 19: ** Len Choules (91), footballer (Crystal Palace, Romford) - [Death announced on this date] ** Toru Kawashima (53), footballer (Gamba Osaka, Otsuka Pharmaceutical) *January 20: ** Eugeniusz Lerch (84), footballer (Ruch Chorzów, ROW Rybnik, Maribyrnong Polonia), assistant manager (Ruch Chorzów) and manager. *January 21: ** Moktar Hasni (71), footballer (US Silana, EM Mahdia, UBS Auvelais, La Louviéroise, RRC Tournai, Calais RUFC, ROC Charleroi, Tunisia) *January 22: ** Tommy Baldwin (78), footballer (Arsenal, Chelsea, Millwall, Manchester United, Seattle Sounders, Brentford) ** Gigi Riva (79), footballer (Legnano, Cagliari, Italy) and technical director (Italy). ** Per Sønstabø (82), footballer (Vard, Norway) *January 23: ** Giuliano Musiello (70), footballer (SPAL, Atalanta, Juventus, Avellino, AS Roma, Genoa, Hellas Verona, Foggia, Novara, Ravenna, Cuneo, Savona) ** Jean Petit (74), footballer (AS Monaco, France), assistant manager (AS Monaco), and caretaker manager (AS Monaco) *January 24: ** Serhiy Rozhok (38), footballer (Dynamo-2 Kyiv, CSKA Kyiv, Kharkiv, Desna Chernihiv, Obolon Kyiv, Kryvbas Kryvyi Rih, Chornomorets Odesa, Minsk, Belshina Bobruisk, Neman Grodno, Vitebsk, Gomel). Died in the Russian invasion of Ukraine. *January 25: ** Deodoro (74), footballer (Portuguesa, Juventus-SP, Vasco da Gama, Guarani, Coritiba, Nacional) and manager (São Caetano). *January 26: ** Iosif Lereter (90), footballer (Energia Oțelu Roșu, Politehnica Timișoara, UTA Arad, Romania) and manager (Constructorul Timișoara, CSP UM Timișoara) *January 27: ** Stuart Gray (50), footballer (Celtic, Greenock Morton, Reading, Rushden & Diamonds, Oxford United) and actor (The Damned United). Son of former Scottish footballer (Eddie Gray, nephew of former Scottish footballer Frank Gray, and cousin of Scottish footballer Andy Gray. *January 28: ** Víctor Luna (64), footballer (Atlético Nacional, América de Cali, Colombia) and manager (Once Caldas, Independiente Medellín, Barcelona Guayaquil, Macará). ** Lenny Piper (46), footballer (Wimbledon, Gillingham, St Albans City, Farnborough, Dagenham & Redbridge, Fisher Athletic, Beckenham Town) and caretaker manager (Fisher Athletic). ** Luis Tejada (41), footballer (Tauro, Plaza Amador, Deportes Tolima, Envigado, Al Ain, Once Caldas, Real Salt Lake, América de Cali, Millonarios, Juan Aurich, Deportivo Toluca, Veracruz, Universidad César Vallejo, Universitario, Sport Boys, San Francisco) *January 29: ** Héctor Sanabria (78), footballer (UNAM Pumas, Mexico) and manager (UNAM Pumas, Deportivo Toluca, Veracruz) ** Ally Shewan (83), footballer (Aberdeen, Elgin City) and manager (Elgin City) *January 30: ** Orazio Schena (82), footballer (Anderlecht, RFC Liège, Tilleur, RAAL La Louvière) *January 31: ** Leif Eriksen (83), footballer (Vålerenga, Eidsvold Turn, Norway) and manager (Eidsvold Turn, Vålerenga, Jevnaker IF, Skeid) ** Heinz Simmet (79), footballer (Borussia Neunkirchen, Rot-Weiss Essen, 1. FC Köln, West Germany B) ** Alexey Spirin (72), referee (Soviet Top League, UEFA, FIFA) ==February== *February 1: ** Burkhard Pape (91), footballer (Hannover 96, VfR Neumünster, FSV Frankfurt) and manager (Sierra Leone, Uganda, Zamalek, Egypt, Sri Lanka, Indonesia, Thailand, Papua New Guinea, Tuvalu, Tanzania). ** Jeannot Schaul (75), footballer (Jeunesse Esch, Luxembourg). *February 2: ** Luciano Alfieri (87), footballer (AC Milan, Siracusa, Lecco, Treviso, Italy). Played at the 1960 Summer Olympics. ** Osvaldo Domínguez Dibb (83), politician, businessman, and club president (Club Olimpia). Father of CONMEBOL president and FIFA vice- president Alejandro Domínguez. ** Francisco Jara (82), footballer (Guadalajara, Mexico). ** Louis Lambert (92), footballer (Royal Antwerp). ** Xavier Robson (37), footballer (Brasil de Pelotas, Peñarol, Esportivo, Tacuarembó). ** Stefan Yanev (84), footballer (Spartak Varna, Cherno More), journalist, writer, and commentator. *February 3: ** Ángel Franco Martínez (85), referee (Segunda División, La Liga). ** Jan Højland (72), footballer (B.93, 1860 Munich, KB, Denmark). *February 4: ** Kurt Hamrin (89), footballer (AIK, Juventus, Padova, Fiorentina, AC Milan, Napoli, Sweden). ** Giacomo Losi (88), footballer (AS Roma, Italy) and manager (Piacenza, Nocerina, Juve Stabia). Member of the AS Roma Hall of Fame. *February 6: ** Gheorghe Iamandi (66), footballer (Delta Tulcea, Olt Scornicești, Dinamo București, Petrolul Ploiești) and manager (Delta Tulcea). ** Miguel Ángel (76), footballer (Real Madrid, Castellón, Spain). ** Abd Mohd Khalid Mohd Ali (66), footballer (Selangor FA, Kuala Lumpur FA, Malaysia). Brother of Malaysian footballer and manager Zainal Abidin Hassan. *February 7: ** Claus Kreul (79), footballer (FC Karl-Marx-Stadt, BSG Wismut Aue) and manager (BSG Wismut Gera, BSG Energie Cottbus, 1. FC Magdeburg, Hansa Rostock). *February 8: ** Mohd Azraai Khor Abdullah (71), footballer (Kedah FA, Kilat Kedah, Malaysia) and manager (Kedah FA, TNB Kelantan FC, Harimau Muda A, Negeri Sembilan FA, Perak FA, Sabah FA). ** João Oliveira Pinto (52), footballer (Sporting CP, Atlético Clube de Portugal, Vitória Guimarães, Estoril, Gil Vicente, Braga, Farense, Marítimo, Académica de Coimbra, Amora). ** Guy Van Sam (88), footballer (Montpellier, Racing Club de France, Toulon, France). *February 9: ** Norman Cooley (83), cricketer and footballer (Bedford Town). ** Roland Grip (83), footballer (IFK Östersund, AIK, IK Sirius, Sweden) and manager. ** Peter Handyside (49), footballer (Grimsby Town, Stoke City, Barnsley, Northwich Victoria ** Klaus Zink (88), footballer (Wismut Karl-Marx-Stadt) ** Ian Lawson (84), footballer (Burnley, Leeds United, Crystal Palace, Port Vale) *February 10: ** Jimmy McDonald (91), footballer (Dumbarton, Gillingham, Morton). *February 11: ** Peter Leigh (84), footballer (Manchester City, Crewe Alexandra). *February 12: ** Mounir Hamoud (39), footballer (Lyn, Bodø/Glimt, Strømsgodset). ** Zdenko Morovic (57), footballer (Deportivo Miranda, Marítimo, Caracas, Venezuela). *February 13: ** Law Pak (90), footballer (Eastern, KMB, Yuen Long, Rangers, Republic of China/Taiwan) and manager (Yuen Long, Chinese Taipai, Flying Camel, Eastern). Gold medalist at the 1958 Asian Games. ** Dieter Pauly (81), referee (Bundesliga, UEFA, FIFA). *February 14: ** Diego Chávez (28), footballer (Veracruz, Juárez, Necaxa, Salamanca, Toluca, Carlos A. Mannucci). *February 16: ** Ian McMillan (92), footballer (Airdrieonians, Rangers, Scotland, Scottish Football League XI) and manager (Airdrieonians). Member of the Scottish Football Hall of Fame. ** Jan Sørensen (68), footballer (Frem, Club Brugge, Twente, Feyenoord, Excelsior, Ajax, Portimonense), manager (Portimonense, Walsall), and sporting director (Hvidovre IF). ** Jorge Toro (85), footballer (Colo-Colo, Sampdoria, Modena, Hellas Verona, Unión Española, Deportes Concepción, Audax Italiano, Deportes La Serena, Chile) and manager (Unión La Calera, Santiago Wanderers, San Antonio Unido, Deportes Iquique, Cobreloa). ** Hryhoriy Varzhelenko (73), footballer (Kolos Nikopol) and manager (Metalurh Nikopol, Elektrometalurh-NZF Nikopol, FC Nikopol). *February 17: ** Eddie Mitchell (69), sports executive, club owner (Dorchester Town, Poole Town, Bournemouth), and club chairman (Bournemouth) *February 20: ** Andreas Brehme (63), footballer (1. FC Saarbrücken, 1. FC Kaiserslautern, Bayern Munich, Inter Milan, Real Zaragoza, West Germany/Germany) and manager (1. FC Kaiserslautern, SpVgg Unterhaching). 1990 FIFA World Cup winner. ** Roberto Pérez (63), footballer (Real Santa Cruz, Guabirá, Bolívar, Club Destroyers, Blooming, Club San José, Oriente Petrolero, Bolivia) ** Charles Swini (38), footballer (ESCOM United, Silver Strikers, UD Songo, Civo United, Malawi). *February 21: ** Charlie Strutton (34), footballer (Chalfont St Peter, AFC Wimbledon, Maidenhead United, Braintree Town, Slough Town). *February 22: ** Paul Bradshaw (67), footballer (Blackburn Rovers, Wolverhampton Wanderers, Vancouver Whitecaps, West Bromwich Albion, Bristol Rovers, Newport County, Peterborough United). - [Death announced on this date] ** Artur Jorge (78), footballer (Porto, Académica, Benfica, Belenenses, Rochester Lancers, Portugal) and manager (Vitória Guimarães, Belenenses, Portimonense, Porto, Racing Club de France, Portugal, Paris Saint-Germain, Benfica, Switzerland, Tenerife, Vitesse, Al-Nassr, Al-Hilal, Académica, CSKA Moscow, Cameroon, MC Alger). ** Harry Melrose (88), footballer (Dunfermline Athletic, Aberdeen, Berwick Rangers and manager (Berwick Rangers, Dunfermline Athletic). *February 23: ** Brian Grundy (78), footballer (Wigan Athletic, Bury, Bangor City, Morecambe, Northwich Victoria) and manager (Glossop North End, Mossley). ** Rui Rodrigues (80), footballer (Académica, Benfica, Vitória Guimarães, Portugal) and manager (Leça, Beira-Mar, União de Coimbra, Primeiro de Maio, Benfica (youth), Camacha). *February 24: ** Stan Bowles (75), footballer (Manchester City, Bury, Crewe Alexandra, Carlisle United, Queens Park Rangers, Nottingham Forest, Leyton Orient, Brentford, England) ** Ulrik le Fevre (77), footballer (Vejle, Borussia Mönchengladbach, Club Brugge, Denmark) ** Chris Nicholl (77), footballer (Halifax Town, Luton Town, Aston Villa, Southampton, Grimsby Town, Northern Ireland). Cousin of former Northern Irish footballer Jimmy Nicholl. *February 25: ** Carlos Espinoza (95), footballer (Everton de Viña del Mar, Santiago Wanderers, Chile). *February 26: ** Salah Larbès (71), footballer (JS Kabylie, Algeria). *February 27: ** Jean Carlos (50), footballer (Bangu, Guarani, Juventude, Paulista, Palmeiras, São Caetano, Ituano, Bahia, Santo André). ** Osvaldo Cunha (80), footballer (Guarani, São Paulo, Corinthians, América Mineiro). *February 28: ** Presley Carson (55), footballer (Platense, Motagua, Victoria, Honduras). ==March== *March 1: ** Farhan Khan (23), footballer (Masha United, SNGPL, Pakistan Air Force). *March 3: ** Alexandre Baptista (83), footballer (Sporting CP, Portugal). ** Roberto Fleitas (91), footballer (Liverpool, Uruguay) and manager (Progreso, Central Español, Uruguay, Nacional, Peñarol, Liverpool). ** Brian Honeywood (74), footballer (Colchester United, Chelmsford City) and manager (Chelmsford City, Braintree Town) *March 4: ** Kees Rijvers (97), footballer (NAC Breda, Saint-Étienne, Stade Français, Feyenoord, Netherlands), assistant manager (Willem II), manager (Twente, PSV Eindhoven, Beringen, Netherlands), and technical director (Twente). *March 5: ** Sonia Hoey (44), women's footballer (Peamount United, Dundalk City). ** Siphiwe Mkhonza (45), footballer (Bloemfontein Celtic, Ria Stars, Lamontville Golden Arrows, Kaizer Chiefs, SuperSport United, AmaZulu, South Africa). *March 7: ** Jean-Baptiste Bordas (86), footballer (Saint-Étienne, Le Havre, AS Béziers, Arago Sport Orléanais, France) and manager (Arago Sport Orléanais, US Orléans, USM Montargis). Played at the 1960 Summer Olympics ** Jean-Paul Colonval (84), footballer (White Star Brussels, Royal Racing White, Tilleur, Daring Club Molenbeek, Standard Liège) and manager (Racing Jet de Bruxelles, Charleroi, Víkingur Reykjavik). ** Minervino Pietra (70), footballer (Belenenses, Benfica, Portugal) assistant manager (Boavista, Belenenses, Alverca, Estoril, Benfica), and manager (Alverca, Juventude de Évora, Estoril, Barreirense). *March 8: ** Milan Arnejčič (81), footballer (Železničar Maribor, Maribor, Red Star Belgrade, Grazer AK). *March 9: ** Jimmy Husband (76), footballer (Everton, Luton Town, Memphis Rogues). Member of the Gwladys Street's Hall of Fame. ** Georgi Popov (79), footballer (Botev Plovdiv, Bulgaria) and manager (Botev Plovdiv, Maritsa Plovdiv). *March 10: ** Steve Maxwell (59), soccer player (Adelaide City, Marconi Stallions, Australia). *March 11: ** Mohammed Barakat (39), footballer (Ittihad Khanyounis, Al Wehdat, Al Shoalah, Palestine). *March 12: ** Rolf Blättler (81), footballer (Grasshoppers, Lugano, Basel, St. Gallen, Luzren) and manager (Locarno, Switzerland U23, Switzerland U21). *March 13: ** Stefan Abadzhiev (89), footballer (Levski Sofia, Wiesbaden, Bulgaria) and manager (Borussia Neunkirchen). Played at the 1960 Summer Olympics. ** Tommy Duncan (87), footballer (Airdrieonians, Newport County, Falkirk) and manager (Queen's Park). - [Death announced on this date] ** Steve Smith (77), footballer (Huddersfield Town, Bolton Wanderers, Halifax Town) and manager (Huddersfield Town, Bradford City). ** Gerry Summers (90), footballer (West Bromwich Albion, Sheffield United, Hull City, Walsall), manager (Oxford United, Gillingham), and coach (Derby County, Leicester City). *March 14: ** Ted Immers (82), footballer (VSV, Telstar, SC Gooiland) and manager (FC Eindhoven, SC Heerenveen, HFC Haarlem, Koninklijke HFC). ** Mal Lucas (85), footballer (Leyton Orient, Norwich City, Torquay United, Wales) and manager (Gorleston). ** Léon Semmeling (84), footballer (Standard Liège, Belgium) and manager (Standard Liège). *March 17: ** André Van Maldeghem (86), footballer (Deinze, Zulte Waregem, Kortrijk) and manager (Zulte Waregem, Kortrijk, Harelbeke, Mouscron). *March 18: ** Ron Baynham (94), footballer (Luton Town, England). ** Peter Kunter (82), footballer (Freiburger FC, Eintracht Frankfurt). *March 19: ** Ersen Martin (44), footballer (1. FC Nürnberg, Beşiktaş, Göztepe, Denizlispor, Ankaraspor, Trabzonspor, Recreativo de Huelva, Sivasspor, Kasımpaşa, Eyüpspor, Turkey national football team). Brother of Turkish footballer Erkan Martin. *March 20: ** Billy Kellock (70), footballer (Cardiff City, Norwich City, Millwall, Chelmsford City, Kettering Town, Peterborough United, Luton Town, Wolverhampton Wanderers, Southend United, Port Vale, Halifax Town). ** Dumitru Macri (92), footballer (Rapid București, Romania) and manager (RC Kouba, Rapid București, Algeria, Viitorul Scornicești, Olt Scornicești). ** António Pacheco (57), footballer (Torralta, Portimonense, Benfica, Sporting CP, Belenenses, Reggiana, Atlético Clube de Portugal, Estoril, Portugal) and manager (Atlético Clube de Portugal, Portimonense). *March 21: ** Orlando Aravena (81), footballer (Magallanes, Deportes La Serena, Palestino, Colo-Colo, Ñublense, Chile) and manager (Chile U20, Colo-Colo, Ñublense, Universidad Católica, Unión Española, O'Higgins, Rangers, Everton de Viña, Palestino, Chile U23, Chile, Magallanes, Santiago Morning). ** David Jackson (77), footballer (Wrexham, Marine, Bradford City, Tranmere Rovers, Halifax Town, Altrincham, Hyde United). Son of former English footballer Peter Jackson, and brother of former English footballer Peter Jackson. *March 22: ** Peter Bennett (77), footballer (West Ham United, Leyton Orient, St. Louis Stars). Father of professional golfer Warren Bennett. *March 23: ** Serhiy Shevchenko (66), footballer (Krystal Kherson, Sudnobudivnyk Mykolayiv, Grănicerul Glodeni, Zaria Bălți, Meliorator Kakhovka) and manager (Meliorator Kakhovka, Krystal Kherson, Naftovyk-Ukrnafta Okhtyrka, Ihroservice Simferopol, Sevastopol, TSK Simferopol, Tavriya Simferopol). *March 24: ** Saravuth Parthipakoranchai (76), footballer (Bangkok Bank, Customs United, Thailand). Played at the 1968 Summer Olympics. *March 25: ** Ambrogio Pelagalli (84), footballer (AC Milan, Atalanta, AS Roma, Taranto, Piacenza). Played at the 1960 Summer Olympics. ** Awuley Quaye (69), footballer (Accra Great Olympics, Ghana). Father of former Ghanian footballers Abdullah and Lawrence Quaye. *March 26: ** Lamine Bangura (59), footballer (Diamond Stars, Real Republicans, Horoya AC, AS Kaloum, ASEC Mimosas, ES Sahel, Sierra Leone) and manager (AS Kaloum, Diamond Stars, Central Parade, Santoba, Ports Authority, Sierra Leone U17, Sierra Leone U20). ** Michael Collins (86), footballer (Luton Town, Chelmsford City, Bedford Town, Cambridge City) and manager (Dunstable Town). ** André Van Herpe (90), footballer (ARA La Gantoise, Racing Club de Bruxelles, Racing White, Stade Kortrijk, Belgium). *March 27: ** Choi Dae-shik (59), footballer (Daewoo Royals, Lucky-Goldstar/LG Cheetahs, Oita Trinita, South Korea) and manager. *March 28: ** Larry Lloyd (75), footballer (Bristol Rovers, Liverpool, Coventry City, Nottingham Forest, Wigan Athletic, England, League of Ireland XI) and manager (Wigan Athletic, Notts County). *March 29: ** Habib Benmimoun (66), footballer (MC Oran, USM Bel Abbès, Algeria) and manager (MC Oran). ** Péter Juhász (75), footballer (Újpesti Dózsa, Tatabanyai Banyasz, Borsodi Volán SC, Hungary). Silver medalist at the 1972 Summer Olympics. ** Iain McChesney (79), footballer (Queen of the South). ** Preto (37), footballer (Ceará, Ipatinga, Icasa, Mirassol, CRB, Cuiabá, São José, Guarany de Sobral, Águia Negra, Atlético Cearense, Atlético de Alagoinhas, Anapolina, Goianésia). *March 30: ** Víctor Legrotaglie (86), footballer (Gimnasia y Esgrima, Chacarita Juniors, Argentino de Mendoza, Juventud Alianza). ** Alex McGregor (73), footballer (Ayr United, Shrewsbury Town, Aldershot). *March 31: ** Paul Bence (75), footballer (Brighton & Hove Albion, Reading, Brentford, Torquay United) and manager (Wycombe Wanderers). Member of the Brentford F.C. Hall of Fame. ==April== *April 1: ** Alejandro Semenewicz (74), footballer (Morón, Independiente, Atlético Nacional, Argentina). *April 2: ** Göran Hagberg (76), footballer (Landskrona BoIS, Östers IF, AIK Fotboll, Sweden). *April 3: ** Luke Fleurs (24), footballer (Ubuntu Cape Town, SuperSport United, Kaizer Chiefs, South Africa U23). Played at the 2020 Summer Olympics. ** Sándor Müller (75), footballer (Vasas, Royal Antwerp, Hércules, Hungary). *April 4: ** Danny O'Donnell (85), footballer (Brentford, Dumbarton, Brechin City, Tonbridge). - [Death announced on this date] *April 5: ** Péter Schumann (69), footballer (Újpesti Dózsa, Pécs, Váci Izzó, Tatabányai Bányász). *April 6: ** Anestis Afentoulidis (82), footballer (Aris Kastoria, PAOK). Father of former Greek footballer Dimitrios Afentoulidis. ** Dickie Rooks (83), footballer (Sunderland, Middlesbrough, Bristol City) and manager (Scunthorpe United, Zanzibar). ** Gerhard Welz (79), footballer (1. FC Saarbrücken, 1. FC Nürnberg, 1. FC Köln, Preußen Münster, Tennis Borussia Berlin, VfB Stuttgart, Fortuna Köln, Rot-Weiß Oberhausen, West Germany B). *April 7: ** Joe Kinnear (77), footballer (Tottenham Hotspur, Brighton & Hove Albion, Republic of Ireland), assistant manager (Al-Shabab), manager (India, Nepal, Doncaster Rovers, Wimbledon, Luton Town, Nottingham Forest, Newcastle United), and club director (Newcastle United). *April 8: ** Bright Esieme (31), footballer (ABS, Enyimba, Enugu Rangers, Nigeria). ** Ron Lord (94), footballer (Auburn, Sydney Prague, Australia). Played at the 1956 Summer Olympics and member of the Football Australia Hall of Fame. *April 9: ** Moisés Barack (80), footballer (Centro Iqueño, Universitario) and manager (Sport Boys, Deportivo Municipal, Unión Huaral, Atlético Torino, Peru, Club Bolívar, Alianza Lima, The Strongest, Deportivo Wanka). ** Dave Mehmet (63), footballer (Millwall, Tampa Bay Rowdies, Charlton Athletic, Gillingham, Fisher Athletic, Maidstone United, Alma Swanley, Barnet, Erith & Belvedere, Bromley, Greenwich Borough) and manager (Fisher Athletic, Croydon, Beckenham Town). ** Terto (77), footballer (Santa Cruz, São Paulo, Botafogo-SP, Ferroviário, Fortaleza). *April 11: ** Anton Flešár (79), footballer (Partizán Bardejov, Dukla Prague, Lokomotíva Košice, VSŽ Košice, Czechoslovakia). ** Shigeharu Ueki (69), footballer (Fujita Industries, Japan) and manager (Bellmare Hiratsuka, Montedio Yamagata, Thespa Kusatsu). ** Milan Žurman (63), footballer (Maribor, SVL Flavia Solva, Rudar Velenje, SV Wildon) and manager (Kapfenberger SV). *April 14: ** Frank O'Neill (70), footballer (Cobh Ramblers, Cork Celtic). *April 15: ** Joseph Boum (34), footballer (Mersin İdmanyurdu, Antalyaspor, Zira). - [Death announced on this date] ** Abdoulaye Diawara (43), footballer (Beveren, KSK Hasselt, Paris FC). ** Mouncif El Haddaoui (59), footballer (AS Salé, Académica de Coimbra, Marítimo, Moreirense, Morocco). ** Willie Limond (45), footballer (Albion Rovers) and boxer. ** Bernd Hölzenbein (78), footballer (Eintracht Frankfurt, Fort Lauderdale Strikers, Memphis Americans, West Germany). 1974 FIFA World Cup winner. *April 16: ** Dave Moyes (68), footballer (Berwick Rangers, Livingston, Dunfermline Athletic). ** Boško Prodanović (80), footballer (Sarajevo, Radnički Kragujevac, Yugoslavia) and manager (Napredak Kruševac, Obilić). *April 17: ** Per Henriksen (72), footballer (Viking FK, Norway). ** Gerd Roggensack (82), footballer (Borussia Dortmund, Arminia Bielefeld, 1. FC Kaiserslautern, DJK Gütersloh), assistant manager (Arminia Bielefeld), and manager (Arminia Bielefeld, Eintracht Braunschweig, SG Wattenscheid 09, 1. FC Kaiserslautern, Preußen Münster, Fortuna Köln, SpVgg Unterhaching, VfL Wolfsburg, FC Stukenbrock). *April 19: ** Leighton James (71), footballer (Burnley, Derby County, Queens Park Rangers, Swansea City, Sunderland, Bury, Newport County, Wales) and manager (Gainsborough Trinity, Morecambe, Accrington Stanley, Llanelli, Aberaman Athletic). ** Siegfried Kirschen (80), referee (DDR-Oberliga, Bundesliga, UEFA, FIFA). ** Marcos Rivas (76), footballer (Atlante, Leones Negros Guadalajara, Mexico). *April 20: ** Jan Ørke (92), footballer (Viking FK, Norway). ** György Tatár (71), footballer (Diósgyőri VTK, Castellón, Hungary). *April 21: ** Luis Gil (48), footballer (Mallorca, Logroñés, Gimnàstic de Tarragona, Real Murcia, Sevilla, Polideportivo Ejido, Elche, Tenerife, Alicante, Alcoyano). ** Haim Levin (87), footballer (Hapoel Petah Tikva, Maccabi Haifa, Maccabi Tel Aviv, Beitar Jerusalem, Maccabi Netanya, Hapoel Jerusalem, Israel). *April 22: ** Charlie Hurley (87), footballer (Millwall, Sunderland, Bolton Wanderers, Republic of Ireland) and manager (Republic of Ireland, Reading). *April 23: ** George Baker (88), footballer (Plymouth Argyle, Shrewsbury Town, Barry Town United). ** Florin Oprea (76), footballer (Universitatea Craiova). *April 24: ** Wolfgang Schüler (66), footballer (Karlsruher SC, SC Freiburg, Darmstadt 98, Borussia Dortmund, Blau-Weiß Berlin, Stuttgarter Kickers, 1. FC Saarbrücken). *April 25: ** Bob Appleby (84), footballer (Middlesbrough, Hereford United, Carlisle United). ** Marek Czakon (60), footballer (Odra Opole, Górnik Zabrze, Olimpia Poznań, Ilves, Frem, Eintracht Trier, Union Berlin, Waldhof Mannheim, SV Elversberg, US Hostert). *April 27: ** Boudewijn de Geer (68), footballer (ADO Den Haag, HFC Haarlem, Molde, Lillestrøm, Hércules, De Graafschap, Brisbane Lions) and manager. Grandson of Dutch politician Dirk Jan de Geer and father of former footballer Mike de Geer. *April 28: ** Heinz Binder (81), footballer (Austria Wien, Wacker Innsbruck, DSV Leoben, Grazer AK, Austria) and manager (Wacker Innsbruck, DSV Leoben, Grazer AK). ** Gilberto Noletti (82), footballer (AC Milan, Lazio, Juventus, Sorrento, Casertana, Grosseto). Played at the 1960 Summer Olympics. *April 29: ** Mykhaylo Fomenko (75), footballer (Spartak Sumy, Zorya Luhansk, Dynamo Kyiv, Soviet Union) and manager (Frunzenets Sumy, Desna Chernihiv, Kryvbas Kryvyi Rih, Guria Lanchkhuti, Al-Rasheed, Iraq, Avtomobilist Sumy, Dynamo Kyiv, Guinea, CSKA-Borysfen Kyiv, Metalist Kharkiv, CSKA Kyiv, Tavriya Simferopol, Salyut Belgorod, Ukraine). Bronze medalist at the 1976 Summer Olympics. ** Luis Mendoza (78), footballer (Deportivo Italia, Deportivo Galicia, Portuguesa, Venezuela) and manager (Mineros de Guayana). ==May== *May 1: ** Danilo Dončić (54), footballer (Rudar Ljubija, Napredak Kruševac, Čukarički, Beograd, Valletta, Lokomotiv Sofia, Imortal DC, Sliema Wanderers) and manager (Floriana, Sliema Wanderers, Mosta, Al-Najma, Ethnikos Achna, Valletta, Lokomotiv Sofia). ** Terry Medwin (91), footballer (Swansea Town, Tottenham Hotspur, Wales) and manager (Cheshunt). ** Ian Mellor (74), footballer (Manchester City, Brighton & Hove Albion, Chester City, Sheffield Wednesday, Bradford City). Father of former English footballer Neil Mellor. *May 2: ** Derek Forster (75), footballer (Sunderland, Vancouver Royals, Charlton Athletic, Brighton & Hove Albion). ** Bobby Tait (85), footballer (Aberdeen, Elgin City, Notts County, Barrow, Chesterfield). *May 3: ** Jim Rodger (90), footballer (Rangers, St Mirren, Newport County, Heart of Midlothian, Queen of the South, East Fife). *May 4: ** Dagoberto Fontes (80), footballer (Nacional, Defensor Sporting, Puebla, Tigres UANL, Uruguay). ** Karl Ringel (91), footballer (SpVgg Fürth, Borussia Neunkirchen, 1. FC Saarbrücken, Saarland, West Germany). *May 5: ** Phil Hoadley (72), footballer (Crystal Palace, Leyton Orient, Norwich City). ** César Luis Menotti (85), footballer (Rosario Central, Racing Club, Boca Juniors, New York Generals, Santos), manager (Newell's Old Boys, Huracán, Argentina, Argentina U20, Barcelona, Boca Juniors, Atlético Madrid, River Plate, Peñarol, Mexico, Independiente, Sampdoria, Rosario Central, Puebla, Tecos), and director (Argentina). 1978 FIFA World Cup winner. ** Ngoy Nsumbu (51), footballer (Germinal Ekeren, Waregem, Royal Cappellen, Genk, Verbroedering Geel, Maccabi Petah Tikva, Zaire/DR Congo). *May 6: ** Steve Harney (73), footballer (Bradford City, Guiseley). *May 7: ** Martin Cearns (79), football executive and club chairman (West Ham United). ** Paul Holmes (56), footballer (Doncaster Rovers, Torquay United, Birmingham City, Everton, West Bromwich Albion). Son of former English footballer Albert Holmes). ** Leo Kogeldans (93), footballer (VV Ajax, SV Voorwaarts, VVV-Venlo, Suriname). Father of former Dutch-Surinamese footballer and Surinam Airways Flight 764 victim Ruben Kogeldans. *May 8: ** Viv Busby (74), footballer (Wycombe Wanderers, Luton Town, Newcastle United, Fulham, Norwich City, Stoke City, Sheffield United, Tulsa Roughnecks, Blackburn Rovers, York City) and manager (Hartlepool United, York City). Brother of former English footballer Martyn Busby. - [Death announced on this date] *May 9: ** Ibrahim Babangida (47), footballer (Stationery Stores, Katsina United, Volendam). *May 10: ** Kostas Chatzimichail (92), footballer (AEK Athens, Egaleo), player-manager (Prasina Poulia), assistant manager (AEK Athens), and manager (AEK Athens Academy, AEK Athens, Doxa Drama, Niki Volos, Veria, Kalamata). ** Frank Sibley (76), footballer (Queens Park Rangers) and manager (Queens Park Rangers, Walsall). *May 11: ** Rudolf Kučera (84), footballer (TJ Gottwaldov, Dukla Prague, Czechoslovakia). ** Jajang Paliama (39), footballer (PS Mojokerto Putra, Persid Jember, Gresik United, Semen Padang, Persepam Madura Utama, Persatu Tuban, Persik Kediri, Hizbul Wathan, Indonesia). *May 12: ** Tapiwa Kumbuyani (41), footballer (Chapungu United, CAPS United, How Mine, Zimbabwe). *May 14: ** Fabián Cancelarich (58), footballer (Ferro Carril Oeste, Belgrano, Newell's Old Boys, Millonarios, Huracán, Talleres, Platense, Central Córdoba, Argentina). Played at the 1988 Summer Olympics. *May 15: ** Washington Rodrigues (87), football color commentator and manager (CR Flamengo). *May 16: ** John Brown (76), footballer (Preston North End, Stockport County, Wigan Athletic, Macclesfield Town). *May 17: ** Graham Cox (65), footballer (Brentford, Margate, Wokingham Town, Addlestone & Weybridge Town, Aldershot, Slough Town) and assistant manager (Slough Town). ** Aminur Rahman (69), footballer (Rahmatganj MFS, Sadharan Bima CSC, Team BJMC, Bangladesh). *May 18: ** Ivan Mráz (82), footballer (Slovan Bratislava, Spartak Praha Sokolovo, Dukla Prague, Sparta ČKD Praha, MVV, Czechoslovakia) and manager (Sparta Prague, Alajuelense, Costa Rica, UCR). Silver medalist at the 1964 Summer Olympics. *May 19: ** Ian Hamilton (73), footballer (Chelsea, Southend United, Aston Villa, Sheffield United, Minnesota Kicks, San Jose Earthquakes). *May 20: ** Gerry Collins (69), footballer (Stranraer, Albion Rovers, Ayr United, Hamilton Academical, Partick Thistle), and manager (Falkirk, Partick Thistle). ** Fran Rooney (67), footballer (Shamrock Rovers, Home Farm, St Patrick's Athletic), manager (Republic of Ireland women's), sports executive, and CEO (Football Association of Ireland) ** Karl-Heinz Schnellinger (85), footballer (1. FC Köln, Mantova, AS Roma, AC Milan, Tennis Borussia Berlin, West Germany). *May 21: ** Vladimir Agapov (90), footballer (Spartak Moscow, CDKA/CSKA Moscow, Zvezda Serpukhov, Soviet Union) and manager (CSKA Moscow). ** Gary Willard (64), referee (The Football League, Premier League, FIFA). *May 22: ** Othon (79), footballer (Botafogo), assistant manager (Botafogo), and manager (Botafogo, Al-Shabab, Al Hilal, Al Wahda, América Mineiro, Al Jazira, Fluminense, Joinville Esporte Clube, São José, Goiás, Goiânia, Atlético Goianiense, Al-Ettifaq). Played at the 1964 Summer Olympics. ** Petri Sulonen (60), footballer (PPT, TPS FC Jazz, Finland). *May 24: ** Christian Rudzki (77), footballer (Deportivo Español, Estudiantes, Hannover 96). *May 26: ** Goran Stanisavljević (60), footballer (Budućnost Podgorica, SAK Klagenfurt, SV Ried, Austria Lustenau) and manager (Austria Lustenau). *May 30: ** Trevor Edwards (87), footballer (Charlton Athletic, Cardiff City, Sydney Hakoah, Marconi, Wales) *May 31 ** Amaral (69), footballer (Guarani, Corinthians, Santos, Club América, Leones Negros UdeG, Brazil). ** Elvedin Begić (63), president of the Football Association of Bosnia and Herzegovina (2012–2021) and vice chairman of the UEFA Stadium and Security Committee (2015–2023) ==June== *June 2: ** Wensley Bundel (75), footballer (Transvaal, Suriname) and manager (House Of Billiards, Suriname, Transvaal). *June 3: ** Lee Chun-seok (65), footballer (Daewoo Royals, Sangmu), coach (Yonsei University, South Korea), and assistant manager (Daewoo Royals, Anyang LG Cheetahs). *June 4: ** Ngoy Bomboko (47), footballer (TP Mazembe, Gabala, DR Congo). *June 6: ** Glan Letheren (68), footballer (Leeds United, Scunthorpe United, Chesterfield, Swansea City, Blackpool, Scarborough, Bangor City, Llanelli Town). Father of former Welsh footballer Kyle Letheren. *June 7: ** Jean-Kasongo Banza (49), footballer (AS Vita Club, Gençlerbirliği, Jeonnam Dragons, VfL Wolfsburg, MSV Duisburg, CS Sfaxien, Olympique Béja, Zaire/DR Congo) *June 9: ** William (90), footballer (Atlético Mineiro, America, Cruzeiro, Villa Nova, Brazil). *June 10: ** Willie Carlin (83), footballer (Liverpool, Halifax Town, Carlisle United, Sheffield United, Derby County, Leicester City, Notts County, Cardiff City). *June 11: ** Terry Allcock (88), footballer (Bolton Wanderers, Norwich City) and cricketer. Member of the Norwich City F.C. Hall of Fame. ** Barry Butler (62), footballer (Chester City, Barrow, Altrincham). ** Orest Lenczyk (81), footballer (Sanoczanka Sanok) and manager (Karpaty Krosno, Siarka Tarnobrzeg, Wisła Kraków, Śląsk Wrocław, Ruch Chorzów, Igloopol Dębica, Widzew Łódź, GKS Katowice, Pogoń Szczecin, Zagłębie Lubin, Cracovia). ** Bernd Schmidt (80), footballer (Hessen Kassel, Werder Bremen, FSV Frankfurt). *June 12: ** T. K. Chathunni (80), footballer (Vasco) and manager (Salgaocar, Mohun Bagan, Churchill Brothers, Chirag United Club Kerala). *June 13: ** Tommy Banks (94), footballer (Bolton Wanderers, Altrincham, Bangor City, England). *June 14: ** Eugene Davis (70), footballer (Shamrock Rovers, Athlone Town, St Patrick's Athletic, UCD, Bohemians, Bray Wanderers). ** Dendê (71), footballer (Bahia, Atlético de Alagoinhas, Flamengo, Vitória, Catuense, Leônico). *June 15: ** Kevin Campbell (54), footballer (Arsenal, Leyton Orient, Leicester City, Nottingham Forest, Trabzonspor, Everton, West Bromwich Albion, Cardiff City, England B), sports television pundit, and commentator. ** Frank D'Arcy (77), footballer (Everton, Tranmere Rovers). ** John McClelland (89), footballer (Manchester City, Lincoln City, Queens Park Rangers, Portsmouth, Newport County). ** Matija Sarkic (26), footballer (Aston Villa, Livingston, Wolverhampton Wanderers, Shrewsbury Town, Birmingham City, Stoke City, Millwall, Montenegro). Son of current Montenegrin ambassador to the European Union Bojan Šarkić and brother of current English-Montenegrin footballer Oliver Sarkic *June 16: ** Willy Dullens (79), footballer (RKSV Sittardia, Netherlands). *June 17: ** Armand Fouillen (91), footballer (Saint-Étienne, Valenciennes, Toulouse, Red Star, Stade Rennais, AS Cherbourg) and manager (Brest). ** Brian Makepeace (92), footballer (Doncaster Rovers, Boston United). - [Death announced on this date] *June 18: ** Billy Abercromby (65), footballer (St Mirren, Partick Thistle, Dunfermline Athletic, East Stirlingshire). - [Death announced on this date] ** Franjo Vladić (73), footballer (Velež Mostar, AEK Athens, Yugoslavia) and manager (Zrinjski Mostar). *June 20: ** Gerhard Aigner (80), footballer, referee, UEFA General Secretary (1989–1999), and UEFA Chief Executive (1999–2003). ** Drosos Kalotheou (79), footballer (Omonia, Cyprus). Father of former Cypriot footballer Yiannos Kalotheou. ** Diego Orejuela (62), footballer (Espanyol, Figueres, Sabadell, Palamós). Cousin of former Spanish footballer Antonio Orejuela. ** Dylon Powley (27), soccer player (Calgary Foothills, FC Edmonton, Atlético Ottawa). ** Andy Rowland (69), footballer (Bury, Swindon Town). *June 23: ** Stathis Chatzilampros (26), footballer (Levadiakos, P.A.O. Rouf). ** Angelo Paina (75), footballer (AC Milan, Padova, Triestina, Taranto, SPAL, Atalanta). ** Hugo Villanueva (85), footballer (Universidad de Chile, UES, Chile). *June 24: ** Humberto Horacio Ballesteros (80), footballer (River Plate, Lanús, Universitario, Millonarios, Sport Boys, Deportivo Municipal). ** Len Roe (92), footballer (Brentford). *June 25: ** Mohamed Arif (38), footballer (Island FC, VB Sports Club, Club Valencia, New Radiant SC, Victory, Club Eagles, Maziya, Kanbawza, Club Green Streets, United Victory, Maldives). ** Tony Macedo (86), footballer (Fulham, Montreal Concordia, Colchester United, Durban City, Highlands Power). ** José Antonio Urtiaga (81), footballer (Valencia Mestalla, Valencia, Atlético Madrid, Real Sociedad). *June 27: ** Manuel Fernandes (73), footballer (CUF, Sporting CP, Rochester Lancers, New England Tea Men, Vitória Setúbal, Portugal) and manager (Vitória Setúbal, Estrela da Amadora, Ovarense, Tirsense, Santa Clara, Sporting CP, Penafiel, Atlético Aviação, Leiria). ** Landry Nguémo (38), footballer (Nancy, Celtic, Girondins de Bordeaux, Saint-Étienne, Akhisarspor, Kongsvinger, Cameroon) and manager. ** Jack Petchey (98), businessman, philanthropist, club director (West Ham United), and club owner (Watford). ** Alan Westwater (78), footballer (Stirling Albion, Pan Hellenic, Australia). *June 28: ** Dudu (84), footballer (Ferroviária, Palmeiras, Sevilla, Confiança, Brazil) and manager (Palmeiras, Desportiva Ferroviária). ** Yves Herbet (78), footballer (Sedan, Anderlecht, Red Star Saint-Ouen, Stade de Reims, Nancy, Avignon, Martigues, France) and manager (Martigues, Le Havre, FC Sète, Dijon, SO Châtellerault, FUS Rabat, Bahrain, Angers). *June 29: ** Pål Enger (57), footballer (Vålerenga, Mercantile) and art thief (Love and Pain, The Scream). *June 30: ** Ion Ionescu (88), footballer (Politehnica Timișoara, Știința București), assistant manager (Politehnica Timișoara, UTA Arad), and manager (Politehnica Timișoara, CFR Timișoara, Jiul Petroșani, UTA Arad, CSM Reșița, Aurul Brad, Corvinul Hunedoara, Sportul Studențesc, Progresul București). ** Justin Shonga (27), footballer (Nkwazi, Orlando Pirates, Cape Town City, Ismaily SC, Sekhukhune United, FC Gagra, Zambia). ==July== *July 1: ** Thor Spydevold (79), footballer (Greåker IF, Sarpsborg FK, Fredrikstad FK, Norway). Son of former Norwegian footballer Bjørn Spydevold. *July 2: ** Germán Gutiérrez de Piñeres (67),footballer (Millonarios). ** Comunardo Niccolai (77), footballer (Torres, Cagliari, Italy). Runner-up at the 1970 FIFA World Cup. ** Jeff Whitefoot (90), footballer (Manchester United, Grimsby Town, Nottingham Forest). *July 3: ** Dudley Roberts (78), footballer (Coventry City, Mansfield Town, Scunthorpe United). *July 4: ** Raúl Dos Santos (57), footballer (Basáñez, Defensor Sporting, Albacete, Villarreal, Club Bolívar, Progreso, Uruguay). ** Cas Janssens (79), footballer (NOAD Tilburg, FC Wageningen, NEC Nijmegen, Nîmes Olympique, OC de Charleroi, Groningen, US Nœux-les-Mines). ** Zoran Vorotović (65), footballer (Sutjeska Nikšić, Budućnost Podgorica, Red Star Belgrade, Sarıyer, Spartak Subotica). *July 5: ** Serge Ducosté (80), footballer (Aigle Noir AC, Haiti). *July 6: ** Ahmed Refaat (31), footballer (ENPPI, Zamalek, Al Ittihad, Al Masry, Modern Future, Al Wahda, Egypt). *July 11: ** Niall Hopper (88), footballer (Queen's Park, Scotland amateurs, Great Britain). ** Willi Koslowski (87), footballer (FC Schalke 04, Rot-Weiss Essen, West Germany). ** Stanley Tshabalala (75), footballer (Kaizer Chiefs, Orlando Pirates), manager (Orlando Pirates, Mamelodi Sundowns, South Africa, AmaZulu), and technical director (Kaizer Chiefs). *July 12: ** Marcel Zagoli Golié (63), footballer (Bouaké FC, Africa Sports National, Ivory Coast) *July 13: ** Tobias (75), footballer (Guarani, Sport Recife, Corinthians, Bangu, Fluminense, Rio Negro, Campinense, Paranavaí). ** Iliya Valov (62), footballer (Botev Vratsa, CSKA Sofia, Lokomotiv Sofia, FC Berlin, Austria Wien, Karşıyaka, Denizlispor, Bulgaria), manager (Botev Vratsa), and goalkeeping coach (Cherno More, CSKA Sofia). Father of former Bulgarian footballer Valentin Iliev. *July 15: ** Juan Ricardo Faccio (87), footballer (Nacional, Fénix, River Plate Montevideo, Liverpool Montevideo) and manager (Peñarol, River Plate Montevideo, El Salvador, Club Puebla, Coyotes Neza, Club León, Independiente Santa Fe). Son of Uruguayan-Italian footballer Ricardo Faccio and nephew of Uruguayan footballer Abdón Porte and Uruguayan-Italian footballer Roberto Porta. ** Ken Jenkin (92), footballer (Grimsby Town). *July 16: ** Mikhail Viarheyenka (74), footballer (Dinamo Minsk), assistant manager (Dinamo Minsk), and manager (Dinamo Minsk, Belarus). Father of former Belarussian footballer Aleksey Vergeyenko. *July 17: ** José Cerveró (74), footballer (Valencia Mestalla, Valencia) and manager (Alzira ** Björn Friberg (75), footballer (Malmö FF). ** Waldo Ramos (80), manager (Palamós, CD Málaga, Girona, Figueres). *July 19: ** Béla Melis (64), footballer (Budapest Honvéd, Békéscsaba, Rába ETO, Debreceni MVSC, Vasas). ** Ron Stockin (93), footballer (Wolverhampton Wanderers, Cardiff City, Grimsby Town). *July 20: ** Moacir (54), footballer (Atlético Mineiro, Corinthians, Atlético Madrid, Sevilla, Portuguesa, Tokyo Verdy, Ituano, Brazil). *July 22: ** Luiche (83), footballer (Oliva, Calvo Sotelo, Ibiza, Eldense, Villarreal) and manager (Santa Pola, Almansa, Eldense, Albacete, Yeclano, Alcoyano, Villarreal, Castellón, Sabadell, Cartagena). *July 23: ** Fred Potter (83), footballer (Aston Villa, Doncaster Rovers, Burton Albion, Hereford United). *July 26: ** Geir Karlsen (75), footballer (Odd, Rosenborg, Dunfermline Athletic, Vålerenga, Norway) and manager (Odd). ** Erwin Stein (89), footballer (Eintracht Frankfurt, Darmstadt 98, West Germany). *July 27: ** Carlos Alvarado (96), footballer (Alajuelense, Club América, América de Cali, Costa Rica). ** Luis Galarza (73), footballer (The Strongest, Always Ready, Club Bolívar, San José, Jorge Wilstermann, Independiente Petrolero, Blooming, Bolivia), manager (The Strongest, Real Potosí, Club Bolívar, Blooming, Aurora), and goalkeeping coach (Always Ready). Half-brother of former Paraguayan footballer Ramón Mayeregger and father of former Bolivian footballer Sergio Galarza *July 28: ** Nail Galimov (58), footballer (FK Khujand, Lokomotiv Chita, Luch Vladivostok) and assistant manager (Chita). ** Armando Larrea (81), footballer (LDU Quito, CD Everest, Deportivo Quito, Universidad Católica, Ecuador). *July 30: ** Tommy Clish (91), footballer (Darlington). ** Bruno Garzena (91), footballer (Juventus, Alessandria, Lanerossi Vicenza, Modena, Napoli, Ivrea, Italy). ==August== *August 1: ** Tommy Cassidy (73), footballer (Glentoran, Newcastle United, Burnley, APOEL, Northern Ireland) and manager (APOEL, Gateshead, Glentoran, Ards, Sligo Rovers, Workington, Newcastle Blue Star, Whitby Town, Blyth Spartans). ** Zdeněk Prokeš (71), footballer (Bohemians Prague, 1860 Munich, Czechoslovakia). ** Craig Shakespeare (60), footballer (Walsall, Sheffield Wednesday, West Bromwich Albion, Grimsby Town), assistant manager (Everton, Watford, Aston Villa, England), and manager (Leicester City). ** Daniel Wansi (42), footballer (ES Sahel, Inker Zaprešić, Al-Nasr, Dynamo Dresden, Shenzhen Kingway, RAEC Mons, Budućnost Podgorica, El Gouna). *August 2: ** Sergio Codognato (80), footballer (Inter Milan, Alessandria, Salernitana, Ravenna, Torres, Cosenza, Trento) and manager (Cosenza, Trento). *August 3: ** Roald Muggerud (90), footballer (Lyn, Norway). ** Kalin Stepanyan (69), footballer (Spartak Oryol, Spartak Ordzhonikidze, Avtodor Vladikavkaz), assistant manager (Avtodor Vladikavkaz, Volgar-Gazprom Astrakhan), and manager (Vityaz Krymsk, FC Abinsk, FC Astrakhan). ** Dimitris Theofanis (91), footballer (Athinaikos, Panathinaikos, Greece) and manager (Doxa Vyronas, Panegialios, Ethnikos Piraeus). *August 4: ** Jim Doherty (65), footballer (Kilmarnock, Clyde, Queen of the South). ** Valentin Ioviță (40), footballer (Gloria Buzău, Sportul Studențesc, Dunărea Galați). ** Juan Ramón Martínez (76), footballer (Municipal, Águila, Juventud Olímpica, Alianza, Once Municipal, El Salvador). Played at the 1968 Summer Olympics. *August 5: ** Adílio (68), footballer (Flamengo, Coritiba, Barcelona SC, Itumbiara, Alianza Lima, Barreira, Brazil) and manager (Flamengo). ** Russell Blake (89), footballer (Colchester United). ** George Herd (88), footballer (Inverness Thistle, Queen's Park, Clyde, Sunderland, Vancouver Royals, Hartlepool United, Scotland, Scottish Football League XI) and manager (Queen of the South). ** Sérgio Lopes (83), footballer (São Paulo, Internacional, Grêmio, Athletico Paranaense, Portuguesa, Figueirense, Brazil) and manager (Figueirense, Cascavel, Avaí, Toledo, Santa Cruz, Paulista, Athletico Paranaense, Fortaleza, ABC). ** Daniel Mañó (92), footballer (Valencia Mestalla, Valencia, Ontinyent). ** Tibor Szabo (64), footballer (Bradford City, Macclesfield Town, Mossley, Gainsborough Trinity, Mossley, Morecambe, Accrington Stanley). *August 6: ** Bobby Thomson (87), footballer (Aston Villa, Birmingham City, Stockport County). *August 8: ** Chato González (80), footballer (Real Madrid B, Rayo Vallecano, Real Madrid, Real Murcia, Xerez, Spain amateur) and manager (Rayo Vallecano, Alcalá, Real Ávila, Real Murcia, Getafe, Córdoba). ** Issa Hayatou (77), sports executive, athlete, and football administrator. Former president of the Confederation of African Football (1988–2017), vice-president (1992–2017) and acting president (2015–2016) of FIFA, and member of the International Olympic Committee (2001–2024). ** Alex Kinninmonth (82), footballer (Dundee, Dunfermline Athletic). ** Alan Little (69), footballer (Aston Villa, Southend United, Barnsley, Doncaster Rovers, Torquay United, Halifax Town) and manager (York City, Southend United, Halifax Town). ** Zoran Petrović (72), referee (Yugoslav First League, J.League, UEFA, FIFA). ** Jorge Rodríguez (56), footballer (Deportivo Toluca, Santos Laguna, Mexico). ** Dženan Uščuplić (48), footballer (Sarajevo) and manager (Sarajevo). *August 9: ** Brian Marjoribanks (82), footballer (Hibernian), actor, and presenter. *August 10: ** Liam Munroe (90), footballer (Shamrock Rovers, RCF Paris, Ards, Bristol City, Dundalk, Republic of Ireland, League of Ireland XI). *August 11: ** Alan Kell (75), footballer (Darlington). *August 12: ** Ramiro Blacut (80), footballer (Club Bolívar, Ferro Carril Oeste, Bayern Munich, Melgar, The Strongest, Bolivia) and manager (Club Bolívar, Oriente Petrolero, Bolivia, The Strongest, Blooming, Aucas, Deportivo Cuenca, Bolivia U20). ** Marc Bourrier (89), footballer (Montpellier, Lens, Toulon), assistant manager (France), and manager (Avignon, France U21, Olympique Marseille, Sète 34, Olympique Alès). ** Cédric Daury (54), footballer (Stade de Reims, Angers, Le Havre, Cannes, Châteauroux) and manager (Châteauroux, Le Havre, Auxerre). ** Roy Greaves (77), footballer (Bolton Wanderers, Seattle Sounders, Rochdale). ** Willi Lemke (77), manager (Werder Bremen), and former United Nations official. *August 13: ** Sid Ahmed Belkedrouci (73), footballer (RCG Oran, GC Mascara, MC Oran, USM Bel-Abbes, Algeria). ** Charles Hughes (91), coach (England amateurs, Great Britain) and author. ** Paul Stehrenberger (85), Luzern, Grasshoppers, Switzerland), player-manager (FC Wettingen), and manager (FC Aarau, Young Fellows Zürich). *August 15: ** Ivair (79), footballer (Portuguesa, Corinthians, Fluminense, America-RJ, Toronto Metros-Croatia, Brazil). ** Imre Komora (84), footballer (Szombathelyi Haladás, Budapest Honvéd, Hungary) and manager (Budapest Honvéd, Hungary, Olympiacos). Gold medalist at the 1964 Summer Olympics. ** Jim McLaughlin (83), footballer (Derry City, Shrewsbury Town, Swansea Town, Dundalk, Northern Ireland) and manager (Dundalk, Shamrock Rovers, Derry City, Drogheda United). *August 16: ** Domingo Pérez (88), footballer (Rampla Juniors, River Plate, Nacional, Uruguay). *August 17: ** Hans Eijkenbroek (84), footballer (Hermes DVS, Sparta Rotterdam, Willem II, Netherlands) and manager (AZ '67, Roda JC, Haarlem). *August 18: ** Ronny Borchers (67), footballer (Eintracht Frankfurt, Arminia Bielefeld, Grasshoppers, Waldhof Mannheim, FSV Frankfurt, Kickers Offenbach, West Germany) and manager (SV Bernbach, Kickers Offenbach, FSV Frankfurt, Viktoria Aschaffenburg, Wormatia Worms, FSV Fernwald). ** Toussaint Natama (41), footballer (ÉF Ouagadougou, Al Ittihad Alexandria, Westerlo, Burkina Faso). ** Franciszek Smuda (76), footballer (Odra Wodzisław Śląski, Ruch Chorzów, Stal Mielec, Piast Gliwice, Hartford Bicentennials, Legia Warsaw, Los Angeles Aztecs, SpVgg Fürth) and manager (Altay, Konyaspor, Stal Mielec, Widzew Łódź, Wisła Kraków, Legia Warsaw, Omonia, Odra Wodzisław Śląski, Zagłębie Lubin, Lech Poznań, Poland, Jahn Regensburg, Górnik Łęczna). *August 20: ** Humberto Maschio (91), footballer (Racing Club, Bologna, Atalanta, Inter Milan, Fiorentina, Argentina, Italy) and manager (Argentina, Racing Club, Costa Rica, Independiente, LDU Quito, Blooming). *August 21: ** Paquito (86), footballer (Real Oviedo, Valencia, Spain) and manager (Alzira, Real Valladolid, Castellón, Hércules, Valencia, Cádiz, Las Palmas, Racing Santander, Rayo Vallecano, Osasuna, Villarreal). ** Rodney Smithson (80), footballer (Arsenal, Oxford United) and player-manager (Witney Town). ** Hans Weiner (73), footballer (Tennis Borussia Berlin, Hertha BSC, Bayern Munich, Chicago Sting, West Germany B). *August 22: ** Granville Smith (87), footballer (Bristol Rovers, Newport County). *August 23: ** Christian Obi (57), footballer (Julius Berger FC, Nigeria) and manager (Heartland). Played at the 1988 Summer Olympics. *August 24: ** Christoph Daum (70), footballer (Eintracht Duisburg, 1. FC Köln II) and manager (1. FC Köln, VfB Stuttgart, Beşiktaş, Bayer Leverkusen, Austria Wien, Fenerbahçe, Eintracht Frankfurt, Club Brugge, Bursaspor, Romania). ** Mickey (76), footballer (Caxias, Fluminense, Grêmio, Junior Barranquilla, Deportivo Cali, Bahia, São Paulo, Ceará, Avaí). *August 26: ** Sven-Göran Eriksson (76), footballer and manager (IFK Göteborg, SL Benfica, AS Roma, Fiorentina, Sampdoria, Lazio, England, Manchester City, Mexico, Ivory Coast, Leicester City, Guangzhou R&F;, Shanghai SIPG, Shenzhen, Philippines). ** Oleg Rydny (57), footballer (Shakhtar Donetsk, Mashuk Pyatigorsk, Dynamo Stavropol, Kiskőrösi Petőfi Spartacus, Lokomotiv Nizhny Novgorod, Daugava Rīga, Lokomotiv-Taim Mineralnye Vody, Spartak-Orekhovo Orekhovo-Zuyevo), assistant manager (Mashuk-KMV Pyatigorsk), and manager. *August 27: ** Juan Izquierdo (27), footballer (Cerro, Peñarol, Montevideo Wanderers, Atlético San Luis, Nacional, Liverpool Montevideo). *August 28: ** Adolf Antrich (83), footballer (Schwarz-Weiß Bregenz, Austria Klagenfurt, Austria Salzburg, Rapid Wien, Austria). *August 29: ** Adolfo Calisto (80), footballer (Barreirense, SL Benfica, Portugal) and manager (Alcains). ** Derek Draper (81), footballer (Swansea Town, Bradford Park Avenue, Chester City). *August 31: ** Sol Bamba (39), footballer (Paris Saint- Germain, Dunfermline Athletic, Hibernian, Leicester City, Trabzonspor, Leeds United, Cardiff City, Middlesbrough, Ivory Coast) and manager (Adanaspor). ==September== *September 1: ** Abel Alonso (89), businessman, shoemaker, and football administrator. President of Unión Española and the Asociación Nacional de Fútbol Profesional (1979–1982, 1989–1993). ** Sergio Rivero (60), footballer (Real Santa Cruz, Oriente Petrolero, Bolivia). *September 2: ** Mick Cullen (93), footballer (Luton Town, Grimsby Town, Derby County, Scotland). ** Edgardo Luis Paruzzo (70), footballer (Quilmes, Tigre, Atlético Bucaramanga). *September 3: ** Clive Freeman (61), footballer (Swansea City, Altrincham, Doncaster Rovers) and coach. ** Alberto Jorge (74), footballer (Racing Club, Club León, Atlante, Oaxtepec) and manager (Racing Club, Toluca, Xelajú). *September 4: ** David Rose (81), club securatary (Ipswich Town). *September 6: ** Gaetano Salvemini (82), footballer (Alessandria, Venezia, Mantova, Inter Milan, Como, Empoli, Siena) and manager (Empoli, Reggina, SPAL, Ternana, Bari, Cesena, Palermo, Genoa, Cremonese, Monza). ** Horst Weigang (83), footballer (Lokomotive Leipzig, Turbine Erfurt, Rot-Weiß Erfurt, East Germany). Bronze medalist at the 1964 Summer Olympics. ** Bent Wolmar (87), footballer (AGF, Denmark). ** Ron Yeats (86), footballer (Dundee United, Liverpool, Scotland) and player-manager (Tranmere Rovers, Barrow). *September 7: ** Darcy (69), footballer (Guarani, América-SP, XV de Jaú, Sport Recife, Portuguesa). ** Cesare Poli (79), footballer (Lanerossi Vicenza, Inter Milan, Cagliari). *September 9: ** Cecília Gáspár (39), women's footballer (Zbrojovka, TSV Crailsheim, SGS Essen, Hungary). - [Death announced on this date] *September 10: ** Roberto Chale (77), footballer (Centro Iqueño, Universitario, Defensor Lima, Sporting Cristal, Universidad Católica, Deportivo Municipal, Peru) ** Eligio Martínez (69), footballer (Club Bolívar, The Strongest, Jorge Wilstermann, Bolivia). ** László Mészáros (47), footballer (Hajdúszoboszlói SE, Fortuna Sittard). - [Death announced on this date] *September 11: ** Ehab Galal (57), footballer (El Shams, Ismaily, Al Masry), manager (Kahraba Ismailia, Al Hammam, Kafr El Sheikh, El Makkasa, Zamalek, Al Ahli, Al Masry, Ismaily, Pyramids, Egypt), and sporting director (Al Masry, Ismaily). ** Malick Touré (28), footballer (Club Africain, MO Béjaïa, ES Sétif). *September 12: ** Santi Coch (64), footballer (Gimnàstic) and manager (Pobla Mafumet). Uncle of Spanish footballer Aleix Coch. *September 14: ** Toshen Bora (74), footballer (Assam, India). ** Kamel Ouejdide (44), footballer (Caen, Göztepe, Fortuna Düsseldorf, ASOA Valence, Sète, Clermont Foot, Cannes, Racing Ferrol, Boussu Dour Borinage). *September 15: ** Gheorghe Mulțescu (72), footballer (Jiul Petroșani, Dinamo București, Romania), player-manager (Jiul Petroșani, UTA Arad, Rapid București), and manager (UTA Arad, Dinamo București, Samsunspor, Kayserispor, Adanaspor, Ankaragücü, Gaziantepspor, Politehnica Timișoara, Jiul Petroșani, U Cluj, Al Taawoun, Astra Giurgiu, Gaz Metan Mediaș, Al-Ettifaq, Universitatea Craiova). Father of Romanian footballer Cătălin Mulțescu. *September 16: ** Daniel Cordier (82), footballer (Valenciennes, Dunkerque, Troyes). ** Steve Hardwick (68), footballer (Chesterfield, Newcastle United, Detroit Express, Oxford United, Huddersfield Town). ** Anwar Jassam (77), footballer (Sikak Al-Hadeed) and manager (Sikak Al-Hadeed, Al-Zawraa, Iraq, Al-Naft, Iraq U20, Al-Wehdat, Al-Talaba). Managed Iraq at the 1980 Summer Olympics. ** István Juhász (79), footballer (Ferencváros, San Diego Sockers, Hungary). Gold medalist at the 1968 Summer Olympics. ** Gary Shaw (63), footballer (Aston Villa, KB, SK Austria Klagenfurt, Shrewsbury Town). *September 17: ** César (68), footballer (America-RJ, Benfica, Grêmio, Palmeiras). ** Paul Imiéla (81), footballer (Amiens, France amateurs). *September 18: ** Pierre Alonzo (84), footballer (Red Star, Cannes, Menton) and manager (Paris Saint-Germain, Nice). ** Zbigniew Kociołek (79), assistnat manager (Legia Warsaw) and manager (Lechia Gdańsk, Wisła Płock). ** Sam Malcolmson (77), footballer (Falmouth Town, Portadown, Albion Rovers, Wellington United, Stop Out, New Zealand). ** Salvatore Schillaci (59), footballer (Messina, Juventus, Inter Milan, Júbilo Iwata, Italy). *September 19: ** Bimal Kar (87), footballer (Victoria SC, Chittagong Mohammedan, Shadhin Bangla). *September 22: ** Ralph Cann (89), footballer (Mansfield Town). ** Andrzej Głownia (72), footballer (Lechia Gdańsk). ** Viktor Nozdrin (72), footballer (Metallurg Lipetsk, Lokomotiv Moscow, Spartak Moscow, Spartak Nalchik, Spartak Kostroma) and manager (Spartak Kostroma, Volga Tver, Nara-ShBFR Naro-Fominsk, Znamya Truda Orekhovo- Zuyevo). *September 23: ** Thadée Polak (92), footballer (Lens, Le Havre, Sedan, Olympique Lyon). *September 26: ** Sören Börjesson (68), footballer (Örgryte IS, Djurgårdens IF, Sweden) and manager (Örgryte IS). Nephew of former Swedish footballer Rune Börjesson. *September 27: ** Fabián Caballero (46), footballer (Estudiantes (LP), Cerro Porteño, Arsenal, Sol de América, Dundee, Club Nacional) and manager (Sportivo Ameliano). *September 28: ** Barry Lloyd (75), footballer (Chelsea, Fulham, Brentford, Houston Hurricane) and manager (Yeovil Town, Worthing, Brighton & Hove Albion). - [Death announced on this date] ** Jacques Teugels (78), footballer (Anderlecht, Union Saint-Gilloise, Racing White, RWD Molenbeek, La Louvière, Belgium). *September 29: ** Andrea Capone (43), footballer (Cagliari, Treviso, Vicenza). ** Alton Meiring (48), footballer (Hellenic, Cape Town Spurs, Mother City, Mamelodi Sundowns, AmaZulu, Manning Rangers, Golden Arrows, South Africa). ** Gordon Revel (96), footballer (Mansfield Town). ** Marko Valok (97), footballer (Partizan, Yugoslavia) and manager (Burma, Partizan, Sloboda Užice, Budućnost Titograd, Yugoslavia, Philadelphia Fury, Vojvodina, Borac Banja Luka, Adana Demirspor). *September 30: ** Giel Haenen (90), footballer (Roda JC, MVV, Fortuna Sittard, Netherlands). ==October== *October 1: ** Denílson (81), footballer (Madureira, Fluminense, Rio Negro, Vitória, Brazil) and manager (Vitória). ** Luis Olivares (84), footballer (Universidad Católica). *October 2: ** Modou Jadama (30), footballer (Colo-Colo, Tulsa Roughnecks, Portland Timbers, Portland Timbers 2, FC Tulsa, Hartford Athletic). *October 3: ** Lino Falzon (83), footballer (Mosta, Sliema Wanderers, Malta). *October 4: ** Chazom Chazom (76), footballer (Hapoel Petah Tikva, Hapoel Ramat Gan Givatayim, Hapoel Yehud). ** Willi Giesemann (87), footballer (VfL Wolfsburg, Bayern Munich, Hamburger SV, West Germany). ** Daniel Guimarães (37), footballer (América Mineiro, Mogi Mirim, América de Natal, Nacional). ** Anatoliy Konkov (75), footballer (Shakhtar Donetsk, Dynamo Kyiv, Soviet Union) and manager (Tavriya Simferopol, Shakhtar Donetsk, Zenit Leningrad, Ukraine U21, Ukraine, Vorskla Poltava, Stal Alchevsk, Inter Baku). Bronze medalist at the 1976 Summer Olympics. *October 5: ** Maksim Samoylov (43), footballer (Dynamo Izhevsk, Gazovik-Gazprom Izhevsk/SOYUZ-Gazprom Izhevsk, Volga Ulyanovsk). *October 6: ** Sefedin Braho (71), footballer (Luftëtari, Partizani, Albania). ** Johan Neeskens (73), footballer (RCH, Ajax, Barcelona, New York Cosmos, Netherlands), assistant manager (Netherlands, Australia, Barcelona, Galatasaray), and manager (FC Zug, NEC, Netherlands B, Mamelodi Sundowns). *October 8: ** Omar Palma (66), footballer (Rosario Central, Colón, River Plate, Veracruz) and manager (Rosario Central, Central Córdoba). ** Artyom Yenin (48), footballer (Spartak Kostroma, Shinnik Yaroslavl, Neftyanik Yaroslavl, Dynamo Vologda, CSKA Moscow, Spartak Nalchik, Ural Yekaterinburg, Spartak Lukhovitsy, Russia). *October 9: ** George Baldock (31), footballer (Milton Keynes Dons, Oxford United, Sheffield United, Panathinaikos, Greece). ** Dieter Burdenski (73), footballer (Schalke 04, Arminia Bielefeld, Werder Bremen, West Germany). ** Arild Gulden (82), handball player and footballer (Lyn, Grasshoppers, Norway). Father of former Norweigan footballer and Adidas CEO Bjørn Gulden, and grandfather of former Norweigan footballer Henrik Gulden. *October 10: ** Peter Cormack (78), footballer (Hibernian, Toronto City, Nottingham Forest, Liverpool, Bristol City, Scotland, Scottish Football League XI) and manager (Partick Thistle, Anorthosis Famagusta, Botswana, Greenock Morton). *October 11: ** Branko Rašović (82), footballer (Budućnost Titograd, Partizan, Borussia Dortmund, Yugoslavia). *October 13: ** Peter Fregene (77), footballer (Stationery Stores, Lagos ECN, Nigeria). Played at the 1968 Summer Olympics. ** Jim Liddle (66), footballer (Cowdenbeath, Forfar Athletic, Hamilton Academical). ** Vyacheslav Nikiforov (58), footballer (Baltika Kaliningrad) and administrator (Baltika Kaliningrad). *October 15: ** Belaïd Lacarne (83), referee (Algerian Championnat National, CAF, FIFA). Refereed at the 1980 Summer Olympics. ** Jean-Jacques N'Domba (70), footballer (Étoile du Congo, Olympique Marseille, Le Puy, Olympique Lyon, Chamois Niortais, Congo). *October 16: ** Casimir Nowotarski (91), footballer (Le Havre, Bordeaux, Lille, Strasbourg, Racing Besançon) and manager (Strasbourg, Gueugnon). ** Roald Poulsen (73), manager (OKS, B 1913, Odense Boldklub, Viborg FF, Zambia, Al-Rayyan, Al-Arabi, Engen Santos, Dalum IF). *October 18: ** Heinz Aldinger (91), referee (Bundesliga, UEFA, FIFA) *October 19: ** José Aveiro (88), footballer (Valencia, Valencia Mestalla, Elche, Ontinyent, Paraguay). *October 22: ** Bernd Bauchspieß (85), footballer (BSG Chemie Zeitz, BSG Chemie Leipzig, East Germany). Bronze medalist at the 1964 Summer Olympics. ** Dmytro Bohachov (32), footballer (PFC Sumy, Viktoriya Sumy, FC Sumy). ** Tonhão (55), footballer (Palmeiras, Nacional-SP, Athletico Paranaense, Internacional, Goiás, Arsenal Tula, América-SP, Cerezo Osaka). *October 24: ** Abdelaziz Barrada (35), footballer (Paris Saint-Germain B, Getafe B, Getafe, Al Jazira, Olympique Marseille, Al-Nasr, Morocco). Played at the 2012 Summer Olympics. ** Michel Lafranceschina (85), footballer (Grenoble, Lens, Lille, Sochaux, Limoges) and manager (Grenoble). ** Joseph Magiera (85), footballer (FC Nancy, Valenciennes, Nancy). ** Tomislav Milićević (84), footballer (Napredak Kruševac, Red Star Belgrade, Chicago Mustangs, Maribor, Gazélec Ajaccio). ** Gerd Peehs (82), footballer (Borussia Neunkirchen, Borussia Dortmund). ** Dieter Timme (68), footballer (Hertha BSC) and manager (Hallescher FC). *October 25: ** Tommy Callaghan (79), footballer (Dunfermline Athletic, Celtic, Scottish Football League XI) and player-manager (Galway Rovers). Brother of former Scottish international footballer Willie Callaghan, nephew of former Scottish footballer Patrick Flannigan, father of former Scottish footballer Tommy Callaghan, and uncle of former Scottish footballer Willie Callaghan Jr). ** Walter Schmidt (87), footballer (Eintracht Braunschweig, West Germany B). Father of German-American musician and journalist DJ Pari. ** Zé Carlos (56), footballer (São José, Nacional-SP, São Caetano, Portuguesa, Juventude, São Paulo, Grêmio, Joinville, Brazil). *October 26: ** Asrat Haile (72), manager (Ethiopia, EEPCO, Ethiopian Insurance). - [Death announced on this date] ** Holden Trent (25), soccer player (Carolina Dynamos, Philadelphia Union II). *October 27: ** Alec Brader (82), footballer (Grimsby Town), schoolteacher, and youth athletics coach. *October 28: ** Tonči Gabrić (62), footballer (RNK Split, Čelik Zenica, Hajduk Split, HNK Rijeka, PAOK, Croatia). Father of Croatian footballer Drago Gabrić. ** Cesare Gussoni (90), referee (Serie A, UEFA, FIFA). Member of the Italian Football Hall of Fame. *October 30: ** Pedro Sarmiento (68), footballer (Atlético Nacional, América de Cali, Colombia), assistant manager (América de Cali, Colombia, Independiente Medellín, Atlético Nacional), and manager (Independiente Medellín, Deportivo Cali, Santa Fe, Cúcuta Deportivo, Deportivo Pereira, Envigado, Once Caldas). ** Peter Wall (80), footballer (Shrewsbury Town, Wrexham, Liverpool, Crystal Palace, St. Louis Stars, California Surf) and manager (California Surf, Los Angeles Lazers). *October 31: ** Trevor Whymark (74), footballer (Ipswich Town, Sparta Rotterdam, Vancouver Whitecaps, Grimsby Town, Southend United, England). ==November== *November 2: ** Len Green (88), footballer (Darlington). *November 4: ** Miguel Ledo (34), footballer (SD Logroñés). *November 6: ** John Dempsey (78), footballer (Fulham, Chelsea, Philadelphia Fury, Republic of Ireland), player-manager (Serbian White Eagles, Dundalk), and manager (Maidenhead United). ** Maximilian Heidenreich (57), footballer (Hannover 96, 1860 Munich, Eintracht Frankfurt, FC Basel, SC Freiburg, VfL Wolfsburg) and manager (Freiburger FC, SV Weil, FC Denzlingen). *November 8: ** Jesús Ares (90), footballer (Racing Ferrol, Celta Vigo, Atlético Madrid, Málaga, Salamanca, Langreo). ** Rumen Ivanov (51), footballer (Etar Veliko Tarnovo, Botev Plovdiv, Levski Sofia, Young Boys, Aarau, Waldhof Mannheim). ** Rachid Mekhloufi (88), footballer (Saint-Étienne, Servette, Bastia, France, FLN, Algeria) and manager (Bastia, Algeria, AS Marsa, Nejmeh). *November 9: ** Hassan Akesbi (89), footballer (FUS Rabat, Nîmes, Stade de Reims, AS Monaco, Morocco) and manager (FUS Rabat, Hassania Agadir). ** José Garrido (64), footballer (Gil Vicente, Chaves, Benfica, Boavista, Famalicão, Aves) and manager (Tirsense, Aves, Lousada, Vizela, Sabah, Kazma, Qadsia, Al-Riffa, Al-Nasr, Gabon, Al Batin). *November 10: ** Abdelkader Lecheheb (70), footballer (USM Oujda, MC Oujda, Wydad Casablanca, Morocco) and diplomat. Formerly the Moroccan ambassador to Canada (1998–2003), Japan (2003–2008), and Russia (2008–2019). *November 11: ** Marco Angulo (22), footballer (Independiente Juniors, Independiente del Valle, FC Cincinnati, LDU Quito, Ecuador). ** Coşkun Taş (89), footballer (Beşiktaş, 1. FC Köln, Bonner SV, Turkey). *November 12: ** Gift Atulewa (38), footballer (Bayelsa United, Ocean Boys, Warri Wolves). ** Kalambay Otepa (76), footballer (TP Mazembe, Zaire). *November 13: ** Luis Ernesto Tapia (80), footballer (Alianza, Deportiva Galcasa, UES, Juventud Olímpica, Panama). *November 14: ** Andrzej Sykta (84), footballer (Wisła Kraków, Motor Lublin, Cambrai, Créteil, Poland). *November 15: ** Graham Bailey (104), footballer (Huddersfield Town, Sheffield United). ** Trygve Bornø (82), footballer (Harstad IL, Skeid, Norway). ** Michael Osei (53), footballer (Okwawu United, Asante Kotoko, Vorwärts Steyr, Caracas, Mainz 05, Ghana), assistant manager (FSV Frankfurt II, Asante Kotoko), and manager (Asante Kotoko, Liberty Professionals, Bibiani Gold Stars). Cousin of former Ghanian footballer Tony Yeboah. ** Dick Packer (90), soccer player (Uhrik Truckers). Played at the 1956 Summer Olympics. ** Frank Schäffer (72), footballer (Borussia Mönchengladbach). *November 16: ** Tommy Andersson (60), footballer (Halmstads BK). ** Hamid Merakchi (48), footballer (CR Témouchent, ES Mostaganem, Gençlerbirliği, MC Alger, WA Tlemcen, MC Oran, Algeria). ** Vladlen Naumenko (77), footballer (Avanhard Ternopil, Sudnobudivnyk Mykolaiv, Zvezda Tiraspol, Krystal Kherson), assistant manager (Sudnobudivnyk Mykolaiv) and manager (FC Evis Mykolaiv, MFC Mykolaiv-2). ** Hans Nilsson (83), footballer (IFK Stockholm, Djurgårdens IF, IK Sirius, IF Brommapojkarna, Sweden) and manager. *November 17: ** Bernard Chiarelli (90), footballer (Valenciennes, Lens, Lille, Sedan, Le Havre, France) and manager. ** Artur Sarnat (54), footballer (Wawel Kraków, Cracovia, Wisła Kraków, Diyarbakirspor, Polonia Warsaw) and goalkeeper coach (Garbarnia Kraków). ** Hugo Villaverde (70), footballer (Colón, Independiente, Argentina). *November 18: ** Jan Keizer (84), referee (Eredivisie, UEFA, FIFA). Refereed the gold medal match at the 1984 Summer Olympics. ** Zakaria Pintoo (81), footballer (Dhaka Wanderers, Mohammedan SC, East Pakistan, Pakistan, Bangladesh) and manager (Bangladesh). *November 19: ** Don Cowan (93), footballer (Darlington). ** Lucas Moripe (74), footballer (Caroline Hill, Orlando Pirates). ** Henk van Rooy (76), footballer (Roda JC, NAC, Willem II, KV Mechelen). *November 20: ** Rino Hansen (54), footballer (Moss, Fredrikstad, Sparta Sarpsborg). ** Malkhaz Makharadze (61), footballer (Dinamo Tbilisi). Father of Georgian footballer Kakhi Makharadze. ** Dahir Mohammed (51), soccer player (Long Island Rough Riders, New England Revolution, Connecticut Wolves, Staten Island Vipers, MetroStars) and manager (Brooklyn Knights). *November 21: ** Vicente de la Mata (80), footballer (Independiente, Necaxa, Veracruz, O'Higgins, Argentina). Son of former Argentine footballer and 3-time South American Championship winner Vicente de la Mata. ** Ray Smith (90), footballer (Hull City, Peterborough United, Northampton Town). *November 22: ** Kenny Aird (77), footballer (St Mirren, St Johnstone, Heart of Midlothian). ** Norman Bodell (86), footballer (Rochdale, Crewe Alexandra, Halifax Town) and manager (Barrow). *November 25: ** Odd Flattum (82), footballer, politician (Labour Party), editor-in-chief, mayor of Modum (1991–2007), and president of the Norwegian Football Federation. (1992–1995). *November 26: ** Jan Furtok (62), footballer (GKS Katowice, Hamburger SV, Eintracht Frankfurt, Poland) and manager (GKS Katowice). *November 27: ** Tor Fosse (59), footballer (Bryne FK). ** Bengt-Arne Strömberg (70), manager (GAIS, IF Elfsborg, IFK Norrköping). *November 28: ** Raymond Maffiolo (86), footballer (Servette, Switzerland). ** John McNamee (83), footballer (Celtic, Hibernian, Newcastle United, Blackburn Rovers) and player-manager. *November 29: ** Josef Jelínek (83), footballer (Dukla Prague, VTŽ Chomutov, Go Ahead Eagles, Bohemians, Czechoslovakia). *November 30: ** Pepe Pinto (95), footballer (Girona, Condal, Barcelona, Real Valladolid) and manager (Manresa, Girona, Olot, Figueres, Badalona Futur). ==December== *December 2: ** Lucjan Brychczy (90), footballer (Piast Gliwice, Legia Warsaw, Poland) and manager (Legia Warsaw). ** Helmut Duckadam (65), footballer (UTA Arad, Steaua București, Romania). ** Yevgeni Kryukov (61), footballer (Torpedo Rubtsovsk, Kuzbass Kemerovo, Rostselmash Rostov-on-Don, Zhemchuzhina Sochi), youth team coach (Zhemchuzhina Sochi), goalkeeper coach (FC Sochi), and manager. *December 3: ** Rafał Piotrowski (50), footballer (Pogoń Szczecin, Stal Mielec, Lech Poznań) and manager. *December 4: ** John Docherty (84), footballer (Brentford, Sheffield United, Reading) and manager (Brentford, Cambridge United, Millwall, Bradford City). ** Roly Horrey (81), footballer (Bishop Auckland, Blackburn Rovers, York City, Cambridge United). ** Trần Anh Khoa (33), footballer (SHB Đà Nẵng). ** Lucien Kassi-Kouadio (61), footballer (Stade d'Abidjan, Cannes, ASEC Mimosas, Ivory Coast). ** Dante Mircoli (77), footballer (Independiente, Platense, Sampdoria, Estudiantes (LP), Lecco, Racing Club) and manager. ** Tony Young (71), footballer (Manchester United, Charlton Athletic, York City). *December 5: ** Hiroshi Kagawa (99), footballer. Member of the Japan Football Hall of Fame. Brother of former Japanese footballer Taro Kagawa. ** István Stefanov (60), footballer (Csepel SC, Kispesti Honved FC). *December 8: ** Nikos Sarganis (70), footballer (Ilisiakos, Kastoria, Olympiacos, Panathinaikos, Athinaikos, Greece). *December 9: ** Joel Mendes (78), footballer (Coritiba, Santos, Portuguesa, Vitória, Bahia, Santa Cruz, Colorado-PR, Nacional-SP). *December 10: ** Mahieddine Khalef (80), footballer (KAC Kenitra, IZ Khemisset, JS Kabylie) and manager (JS Kabylie, Algeria, Al Ain, IR Tanger, MC Oujda, ES Sahel). ** Pat McBride (81), soccer player (St. Louis Stars, United States) and manager (St. Louis Steamers, Kansas City Comets). Member of the National Soccer Hall of Fame. ** José Antonio Naya (90), footballer (Deportivo La Coruña) and manager (Cultural Leonesa, Alcalá, Todelo, Real Madrid Aficionados, Cádiz, Getafe, Ourense, Burgos, Deportivo La Coruña, Real Murcia, Levante, Recreativo, Castellón, Alavés, Granada, Xerez, Real Burgos, Sabadell). ** Serhiy Ralyuchenko (62), footballer (Zirka Kirovohrad, SKA Kyiv, Shakhtar Donetsk, Metalist Kharkiv, Stal Mielec, Torpedo Zaporizhzhia, Temp Shepetivka, Vorskla Poltava, Naftovyk Okhtyrka) and assistant manager (Metalist-2 Kharkiv, Metalist Kharkiv, Metalist 1925 Kharkiv). *December 11: ** Sandrino Castec (64), footballer (Universidad de Chile, Audax Italiano, Cruz Azul, Chile). ** Alex Edwards (78), footballer (Dunfermline Athletic, Hibernian). ** Vladimir Skočajić (70), footballer (Lokomotiva Zagreb, Velež Mostar, Apollon Kalamarias) and manager (Zrinjski Mostar). *December 12: ** Youcef Bouzidi (67), assistant manager (CA Bordj Bou Arréridj, NA Hussein Dey) and manager (JSM Skikda, NA Hussein Dey, Olympique Médéa, MO Béjaïa, ASO Chlef, RC Relizane, JS Kabylie, USM Bel Abbès, MO Béjaïa, US Biskra, MC Oran). ** Vic Gomersall (82), footballer (Manchester City, Swansea City, Chelmsford City). - [Death announced on this date] *December 13: ** Dimitrios Grafas (87), footballer (Ethnikos Piraeus, Greece). ** Freddie Strahan (85), footballer (Shelbourne, St Patrick's Athletic, Republic of Ireland) and manager (Shelbourne). *December 14: ** Frans Körver (87), footballer (Sittardia, MVV) and manager (Tongeren, Wageningen, Fortuna Sittard, Roda JC, MVV, Helmond Sport, FC VVV, De Graafschap). *December 18: ** Tony Bentley (84), footballer (Stoke City, Southend United). ** Dietmar Constantini (69), footballer (SWW Innsbruck, LASK, Kavala, Wiener SC), assistant manager (Wiener SC, Al-Ittihad, Rapid Wien, Austria, Austria Wien), and manager (Austria, LASK, Admira Wacker, Tirol Innsbruck, Mainz 05). *December 20: ** George Eastham (88), footballer (Ards, Newcastle United, Arsenal, Stoke City, Hellenic, England) and manager (Stoke City). 1966 FIFA World Cup winner. *December 21: ** Martin Dechev (34), footballer (CSKA Sofia, Cherno More, Montana, Oborishte, Slavia Sofia). ** Walter Pearson (85), footballer (Alajuelense, Águila, Olimpia, Costa Rica). *December 22: ** Dieter Lindner (85), footballer (Eintracht Frankfurt). *December 23: ** Mieczysław Kolasa (101), footballer (Prokocim Kraków, Cracovia) and manager (Cracovia, Prokocim Kraków, Kabel Kraków). *December 24: ** Edwin Gastanes (66), lawyer, and football administrator. Secretary general of the Philippine Football Federation (2013–2023) and Philippine Olympic Committee (2019–2023). *December 26: ** Ruslan Solyanyk (40), footballer (Lokomotiv Moscow, Vorskla Poltava, Tavriya Simferopol, llychivets Mariupol, Zhetysu, Chornomorets Odesa, Tytan Armiansk) ** Sergei Toporov (53), footballer (Zarya Leninsk-Kuznetsky, Irtysh Omsk, Gazovik-Gazprom Izhevsk, Tobol Kurgan), assistant manager (Kuzbass Kemerovo), and manager (Shakhta Raspadskaya Mezhdurechensk). *December 27: ** Mickey Bullock (78), footballer (Birmingham City, Oxford United, Leyton Orient, Halifax Town) and manager (Halifax Town, Ossett Town). Brother of former English footballer Peter Bullock. ** Stavri Lubonja (89), footballer (Dinamo Tirana) and manager (Flamurtari, Dinamo Tirana) ** Svetozar Šapurić (64), footballer (Vrbas, Vojvodina, APOEL, Anorthosis Famagusta), manager (APOEL, Olympiakos Nicosia, Ethnikos Achna, Apollon Limassol, Changchun Yatai, Cangzhou Mighty Lions), and sporting director (Vojvodina, APOEL). *December 28: ** Émile Lejeune (86), footballer (RFC Liège, Belgium). ** Charlie Wright (86), footballer (Workington, Grimsby Town, Charlton Athletic, Bolton Wanderers) and manager (York City, Bolton Wanderers). *December 29: ** Aleksei Bugayev (43), footballer (Torpedo Moscow, Tom Tomsk, Lokomotiv Moscow, Krasnodar, Russia). *December 30: ** Wolfgang de Beer (60), footballer (MSV Duisburg, Borussia Dortmund) and goalkeeping coach (Borussia Dortmund). ** Michael Newberry (27), footballer (Víkingur, Linfield, Cliftonville). ** Hugo Sotil (75), footballer (Deportivo Municipal, Barcelona, Alianza Lima, Independiente Medellín, Peru) and manager (Deportivo Municipal). *",
 "title": "2024 in association football deaths"
}