{
 "id": "1158266",
 "text": "The Hungarian Pentecostal Church is a Pentecostal Christian denomination. == History == In 1900, a young Methodist pastor in the United States, Charles F. Parham, deeply studied the Acts of the Apostles and Paul's letters, seeking the miraculous signs of early Christianity. He concluded that there was a spiritual secret lost to modern churches. In Topeka, Kansas, he established a Bible school to investigate this. After studying the Acts, students identified speaking in tongues as evidence of the baptism of the Holy Spirit. On New Year’s Eve 1900, Agnes N. Ozman spoke in tongues, marking the start of modern Pentecostalism. W.J. Seymour an African American pastor, preached about the outpouring of the Holy Spirit in a small Los Angeles church. After one of his sermons, he was invited to continue preaching in a woman’s home. On April 9, 1906, during one of these gatherings, attendees experienced the baptism of the Holy Spirit, praying and singing in tongues. This event marked the beginning of the Azusa Street Revival, a pivotal moment in the Pentecostal movement. The building at 312 Azusa Street became the most famous site of the Pentecostal movement. During the revival, which lasted over three years, countless people experienced the grace of the Holy Spirit's outpouring. Simultaneously, Pentecostal awakenings independently ignited worldwide in other places, including the Armenian Presbyterian Church, India, and Chile. In Chile, the movement started within the Methodist Church through the efforts of Pastor W.C. Hoover. These events marked the global expansion of Pentecostalism. === The establishment of the church in Hungary === In Hungary, the Pentecostal movement's early pioneers included returning prisoners of war from World War I and emigrants coming back from the United States. Among the Hungarian soldiers captured during the war, some encountered Spirit-filled believers while in captivity, bringing these spiritual experiences back to their homeland. The founding conference of the Pentecostal church in Hungary was held from February 5 to February 9, 1928, in Kispest at Villany Street 6. Representatives from eight congregations adopted the founding principles, electing leaders for a year, with Dávid F. Rároha chosen as president. Over the following years, more congregations joined the movement, growing from 15 in 1929 to 70 by 1932. That year, the organization's name changed to the \"Assemblies of God Association in Hungary,\" with long-term leadership provided by István Siroky, József Tomi, and József Fábián. On December 2, 1939, the Hungarian Royal Minister of the Interior issued a decree (No. 363.500/1939. VII.a) titled \"Termination of Activities of Sects Endangering National Defense Interests.\" This decree banned Pentecostal church services, along with several other small denominations. From then until the end of World War II, Pentecostal congregations operated under the protection of Lutheran, Baptist, and Methodist churches. After World War II, Pentecostal congregations continued under various denominations, including the Evangelical Pentecostal Church, Evangelical Christian Congregations, and the Ancient Christian Denomination. In 1962, the Evangelical Pentecostal Church merged with the Evangelical Christians to form the Evangelical Pentecostal Community. On April 9, 2011 the Evangelical Pentecostal Community decided to change its name to the Hungarian Pentecostal Church, which remains its official name today. ==References== Category:Pentecostalism",
 "title": "Hungarian Pentecostal Church"
}