{
 "id": "1158433",
 "text": "Astro Bot is a video game series of platform and augmented reality games developed by Team Asobi (formerly a division of Japan Studio). == Gameplay == All of the games are demonstrating use of PlayStation accessories, as well as featuring the same characters (bots). The Playroom (PlayStation 4) and Astro's Playroom (PlayStation 5) are both tech-demos that were pre-installed on their consoles. == Games == Title Platform Release date Description The Playroom PlayStation 4 November 15, 2013 Pre-installed on every PlayStation®4, THE PLAYROOM is available straight out of the box. Get your PlayStation Camera and DUALSHOCK 4 wireless controller ready and enter a world of ground-breaking augmented reality gaming experiences anyone can enjoy. The Playroom VR PlayStation 4 (PSVR) October 10, 2016 As a huge thank you for buying PlayStation®VR, we have a very cool present for you – a free digital download of THE PLAYROOM VR. Packed with six exciting games, this is the perfect way to explore and discover all the magic of virtual reality. Astro Bot Rescue Mission PlayStation 4 (PSVR) October 2, 2018 Captain ASTRO needs your help for a daring mission! Grab your PS VR headset to blast off on an epic adventure to rescue his spaceship’s lost crew-bots. Explore vibrant and immersive worlds PACKED with enemies to fight, secrets to discover, bots to save… and huge bosses to face. Astro's Playroom PlayStation 5 November 12, 2020 From the team behind the original PLAYROOM and the critically acclaimed ASTRO BOT Rescue Mission, comes a brand new platformer preloaded on your PS5™ console. Take control of ASTRO and feel the world through your DualSense™ Wireless Controller: every step you take, every jump you make, and every enemy you defeat are felt in a whole new way thanks to the immersive haptic feedback technology. On your way, use new power ups that show the potential of the dynamic adaptive triggers, motion sensor, touchpad and integrated speaker working together to deliver a totally new gameplay experience. Take time to enjoy the many hidden references to PlayStation® history and collect timeless artefacts to display in your beloved PlayStation Labo. Astro Bot PlayStation 5 September 6, 2024 JOIN ASTRO ON A SUPERSIZED SPACE ADVENTURE When the PS5® mothership is attacked by ASTRO’s long-standing galactic nemesis, scrambling its wires and scattering the crew throughout space, only ASTRO can make things right! Setting off on his biggest mission yet, he needs your help to rescue the stranded crew and rebuild the mothership. Make the most of ASTRO’s new power-ups, handcrafted to level up your immersion: from springy punches and rockets all the way to a giant sponge! Buckle up for some epic PlayStation® camaraderie, join forces with your favourite PlayStation icons and show the universe that small is mighty in this fresh new ASTRO adventure, exclusive to PS5 consoles! == Reception == The original game didn't get a rating according to Metacritic. Astro Bot (94/100) and Astro Bot Rescue Mission (90/100) were the highest rated. == Notes == == References == Category:Video game series",
 "title": "Astro Bot (series)"
}