{
 "id": "1158628",
 "text": "The Bodydonnas were a professional wrestling tag team that are best known for their time in the World Wrestling Federation (WWF) from 1995 until 1996. The members of the team were Skip, Sunny, and Zip. The members of the team were portrayed as people that were obsessed with exercising. They would insult fans for being out of shape, as well as, do jumping jacks and push ups during their matches. Skip was in a feud after losing many times to jobber Barry Horowitz. This led to Rad Radford wanting to join the team and become a Bodydonnas. Radford would team with them for a short while. He was kicked out of the team on the December 23, 1995 episode of Superstars after a loss to The Smoking Gunns (Bart & Billy Gunn). Skip and Sunny were joined by Skip's cousin Zip later on. The newly-formed Bodydonnas formed after Zip interfered in the match between Skip and Rad Radford, hitting Radford with an elbow drop. At WWF In Your House 5: Season's Beatings, The Bodydonnas teamed with Isaac Yankem DDS & Yokozuna in a dark eight-man tag team match but lost to Barry Horowitz, Hakushi & The Smoking Gunns. The team made their official television debut on the January 20, 1996 episode of Superstars defeated Chaz Warrington & Glen Ruth. At the Royal Rumble, the Bodydonnas challenged the Smoking Gunns for the WWF Tag Team Championship but lost. After Bart Gunn suffered a neck injury, the championships were stripped. A tournament was announced to crown the new Tag Team Champions. The Bodydonnas entered the tournament. They defeated Savio Vega & Steve Austin in the semi-final and The Bushwhackers (Butch & Luke). At WrestleMania XII, the Bodydonnas defeated The Godwinns (Henry O. Godwinn and Phineas I. Godwinn) in the finals to win the tournament and become the new WWF Tag Team Champions. They would successfully defend the titles for many weeks after. At a house show on May 19, 1996, the Bodydonnas lost the championships to The Godwinns. Sunny left the Bodydonnas after to join the Godwinns. The team was joined by a transvestite named Cloudi (also spelled Kloudi) for a short while before the team broke up when Skip got injured then left the company to join Eastern Championship Wrestling (ECW). Chris Candido, who portrayed Skip, died on April 28, 2005 after suffering acute pneumonia. == Championships and accomplishments == * World Wrestling Federation ** WWF Tag Team Championship (1 time) ** WWF World Tag Team Championship tournament (1996) ==References== == Other websites == *The Bodydonna's Online World of Wrestling profile Category:WWE teams and stables",
 "title": "Bodydonnas"
}