{
 "id": "1158959",
 "text": "The attorney general of North Carolina is a statewide elected office in the U.S. state of North Carolina. The incumbent attorney general, Jeff Jackson, taking office on January 1, 2025. ==List of attorneys general== === Elected by the legislature === Attorneys General Attorney General Term in office Source 1 Thomas McGuire 17671776 2 Waightstill Avery 17771779 3 James Iredell 17791782 4 Alfred Moore 17821791 5 John Haywood 17921795 6 Blake Baker Jr. 17951803 7 Henry Seawell 18031808 8 Oliver Fitts 18081810 9 William Miller 1810 10 Hutchins Gordon Burton 18101816 11 William P. Drew 18161824 12 James F. Taylor 18251828 13 Robert H. Jones 1828 14 Romulus Mitchell Saunders 18281834 15 John Reeves Jones Daniel 18351841 16 Hugh McQueen 18411842 17 Spier Whitaker 18421846 18 Edward Stanly 18461848 19 Bartholomew F. Moore 18481851 20 William Eaton Jr. 18511852 21 Matt Whitaker Ransom 18531855 22 Joseph B. Batchelor 18551856 23 William Henry Bailey 1857 24 William A. Jenkins 18571862 25 Sion Hart Rogers 18631868 === Popularly elected === Attorneys General Attorney General Term in office Party Source 26 William M. Coleman 18681869 Republican 27 Lewis P. Olds 18691870 Republican 28 William Marcus Shipp 18701873 Democratic 29 Tazewell L. Hargrove 18731877 Republican 30 Thomas S. Kenan 18771885 Democratic 31 Theodore F. Davidson 18851893 Democratic 32 Frank I. Osborne 18931897 Democratic 33 Zeb V. Walser 18971900 Republican 34 Robert Dick Douglas 19001901 Republican 35 Robert D. Gilmer 19011909 Democratic 36 Thomas Walter Bickett 19091917 Democratic 37 James S. Manning 19171925 Democratic 38 Dennis G. Brummitt 19251935 Democratic 39 Aaron A. F. Seawell 19351938 Democratic 40 Harry McMullan 19381955 Democratic 41 William B. Rodman Jr. 19551956 Democratic 42 George B. Patton 19561958 Democratic 43 Malcolm B. Seawell 19581960 Democratic 44 T. Wade Bruton 19601969 Democratic 45 Robert Burren Morgan 19691974 Democratic 46 James H. Carson Jr. 19741975 Republican 47 Rufus L. Edmisten 19751985 Democratic 48 Lacy Thornburg 19851993 Democratic 49 Mike Easley 19932001 Democratic 50 Roy Cooper 20012017 Democratic 51 Josh Stein 20172025 Democratic 52 Jeff Jackson 2025–present Democratic ==References== *",
 "title": "North Carolina Attorney General"
}