{
 "id": "1158278",
 "text": "Jay Robert Pritzker (born January 19, 1965) is an American businessman and politician serving as the 43rd governor of Illinois since 2019. Pritzker was managing partner and co-founder of the Pritzker Group, a private investment firm that operates middle-market service and industrial companies and invests in digital technology companies. He has a net worth of around $3.4 billion. This makes Pritzker the richest governor in the United States. He became the Democratic nominee for governor in the 2018 election after winning the primary election. He defeated Republican incumbent Bruce Rauner in the election on and took office on January 14, 2019. Pritzker was reelected in 2022. ==Early life== Pritzker was born and raised in Atherton, California. He is a member of the Pritzker family. His older sister is Penny Pritzker, the former U.S secretary of Commerce. He studied at Milton Academy and graduated from Duke University. In 1993, he earned his Juris Doctor from Northwestern University. ==Governor of Illinois== On April 6, 2017, Pritzker announced his candidacy for the Democratic nomination for governor of Illinois. He was supported by Illinois Secretary of State Jesse White, Illinois Congressman Luis Gutiérrez, former Illinois Congressman Glenn Poshard, more than a dozen members of the Illinois General Assembly, 21 local labor unions, and the Illinois AFL–CIO. On August 10, 2017, Pritzker announced that his running mate would be State Representative Juliana Stratton. Pritzker had spent $42million of his own money on his campaign without receiving funding from any other source. On March 20, 2018, he won the Democratic primary by a large margin, receiving 45.13% of the vote and defeating five opponents. On November 6, 2018, Pritzker beat incumbent Republican governor Bruce Rauner in the general election, receiving 54.53% of the vote to Rauner's 38.83%. Pritzker was inaugurated as Illinois's 43rd governor on January 14, 2019. With an estimated net worth of $3.6 billion in January 2019, he became the richest politician in the U.S. He won the June 28 Democratic primary and defeated Republican nominee Darren Bailey in the November 8 general election, 54.91% to 42.37%. Pritzker's re- election victory had the highest vote share for any Democratic governor in more than 60 years. His second term in office began on January 9, 2023. ==National politics== In 2023, Pritzker did not want to speak with U.S. Representative Dean Phillips about his plans to try to convince him to run against President Joe Biden in the Democratic presidential primary. In 2024, Pritzker was mentioned as a possible running mate for Kamala Harris in her 2024 presidential campaign, but Minnesota Governor Tim Walz was chosen instead. Harris lost the general election. ==Personal life== In 1993, Pritzker married Mary Kathryn \"M. K.\" Muenster, whom he had met in Washington, D.C., when she worked as an aide to U.S. Senator Tom Daschle. She is one of three children of Theodore and Karen Muenster. Her father unsuccessfully ran for the U.S. Senate in 1990. They live in Chicago's Gold Coast neighborhood with their two children. They also reside in the Illinois Governor's Mansion in Springfield. According to Forbes, in 2024 Pritzker had a net worth of $3.7 billion. == References == ==Other websites== *Governor JB Pritzker official government website *JB for Governor campaign website * Category:1965 births Category:Living people Category:Governors of Illinois Category:Philanthropists from Chicago Category:Businesspeople from California Category:People from Atherton, California Category:Lawyers from Chicago Category:Lawyers from Illinois Category:Lawyers from California Category:Democratic Party (United States) politicians",
 "title": "JB Pritzker"
}