{
 "id": "1158245",
 "text": "A greeting card is a card which is sent as a greeting or to get special attention. There are cards for different occasions, such as a birthday, or Christmas, ther birth, or baptizing of a child, being successful at an exam, etc. There are different designs of these cards. The simples one is that of a postcard: one side contains a photo, or an illustration, the other side has space for the address of the recipient, and a personalized message. Another designs uses bigger cards, which are folded, and which are sent inside an envelope: in this case, the 'inside' of the card is for the personal message, and the rescipient and postage stamp are put on the envelope. == History == The custom of sending greeting cards can be traced back to the ancient Chinese who exchanged messages of good will to celebrate the New Year, and to the early Egyptians, who sent their greetings on papyrus scrolls. By the early 15th century, handmade paper greeting cards were exchanged in Europe. The Germans are known to have printed New Year's greetings from woodcuts as early as 1400, and handmade paper Valentines were being exchanged in various parts of Europe in the early to mid-15th century. The oldest Valentine in existence is in the British Museum. The card was written to Bonne of Armagnac by her husband, Charles Duke of Orleans, who was imprisoned in the Tower of London at the time. Not surprisingly, its message is rather downbeat. Its opening reads: ‘I am already sick of love / my very gentle Valentine.’ By the 1850s, the greeting card had been transformed from a relatively expensive, handmade and hand-delivered gift to a popular and affordable means of personal communication. Aadvances in printing, mechanization, and a reduction in postal rates with the introduction of the postage stamp made this possible. This was followed by new trends like Christmas cards. The first Christmas cards appeared in published form in London in 1843 when Sir Henry Cole hired artist John Calcott Horsley to design a holiday card that he could send to his friends and acquaintances. In the 1860s, inventor Hugh Pierce Jr., inspired by the Christmas card, invented the Birthday card. Companies like Marcus Ward & Co, Charles Goodall & Son, and Charles Bennett began the mass production of greeting cards. They employed well-known artists such as Kate Greenaway and Walter Crane as illustrators and card designers. The extensive Laura Seddon Greeting Card Collection from the Manchester Metropolitan University gathers 32,000 Victorian and Edwardian greeting cards and 450 Valentine's Day cards dating from the early nineteenth century, printed by the major publishers of the day. Technical developments like color lithography in 1930 propelled the manufactured greeting card industry forward. Humorous greeting cards, known as studio cards, became popular in the late 1940s and 1950s. In the 1970s, Recycled Paper Greetings, a small company needing to establish a competing identity against the large companies like Hallmark Cards, began publishing humorous, whimsical card designs with the artist's name credited on the back. This was away from what was known as the standard look (sometimes called the Hallmark look.) During the 1980s, reduced costs of small batch printing and die cutting together with a growing taste for handmade cards made it economically possible for smaller niche companies to set up in competition with the large established brands. Innovative companies such as Nobleworks and Meri Meri grew from their foundation in the 1980s to becoming significant influencers in the industry. A thriving market was established for what were now called \"alternative\" greeting cards. The name stuck even though these \"alternative\" cards grew to embrace a vast range of styles and ultimately changed the look of the industry. The largest recorded number of greeting cards sent to a single person went to Craig Shergold, a beneficiary/victim of chain letters and later chain emails. == References == Category:Holidays",
 "title": "Greeting card"
}