{
 "id": "115827",
 "text": "Sir Lewis Carl Davidson Hamilton MBE (born 7 January 1985 in Stevenage, Hertfordshire, England) is a British Formula One racing driver, currently racing for the Scuderia Ferrari HP team. As a seven-time World Champion, he is often regarded as one of the greatest F1 drivers in history. Hamilton won the British Formula Renault, Formula Three Euroseries, and GP2 championships as his racing career advanced. He became an F1 driver for McLaren-Mercedes in , making his Formula One debut (first race) 12 years after his first meeting with Ron Dennis. Hamilton comes from a mixed-race background, with a black father and white mother. He is often labelled one of \"the first black driver in Formula One\". In his first season in Formula One, Hamilton set many racing records. He finished second in the 2007 FIA Formula One World Championship, just one point behind Kimi Räikkönen. He won his first World Championship the next season by one point ahead of Felipe Massa, overtaking Timo Glock on the final lap in Brazil. He signed for Mercedes at the end of 2012 to race for them in the 2013 season. Hamilton has gone on to win five more World Championships, all with the Mercedes team, becoming the most successful British driver in Formula One history. On 1 February 2024, Hamilton and Mercedes announced that they would be parting at the end of the season. Hamilton would sign a multi-year contract to drive for Scuderia Ferrari starting in 2025. He has 105 wins, 104 poles and 202 podium finishes, and 67 fastest laps, with his last win at the 2024 Belgian Grand Prixbecause of the disqualification of George Russell after the race. == Personal life == Hamilton was born at Lister Hospital in Stevenage, England, He was named after American sprinter Carl Lewis. His mother, Carmen Larbalestier (now Carmen Lockhart) is British. His father's parents emigrated from Grenada to the United Kingdom in the 1950s. Hamilton's parents separated when he was two. At first he lived with his mother. When Hamilton was twelve, he started living with his father, Anthony. Hamilton was raised Roman Catholic. Hamilton's first taste of racing came at radio-controlled cars. His father bought him one in 1991, and Hamilton did well. Hamilton started kart racing when he was six. His father bought him his first go-kart as a Christmas present.Nuts Magazine: \"20 things you don't know about Lewis Hamilton\", 22–28 June 2007, Nuts Magazine, 2007 His father said he would support his racing as long as he worked hard at school. To support his son Anthony had to take extra jobs, but he found enough time to attend all of Hamilton's races. In October 2007, Hamilton announced his intention to live in Switzerland. He said this was to avoid the media scrutiny in the United Kingdom. Hamilton later admitted on the television show Parkinson, that taxation was part of the reason for his decision. Hamilton was publicly criticised by UK MPs, including Liberal Democrat MP Bob Russell, for avoiding UK taxes. He settled in Luins in Vaud canton on Lake Geneva. On 18 December 2007, Hamilton was suspended from driving in France for one month. He had been caught speeding at on a French motorway. His Mercedes-Benz CLK was also impounded. Two days before the Australian Grand Prix, Victoria Police witnessed Hamilton \"deliberately losing traction\" in his silver Mercedes, and impounded the car for 48 hours. Hamilton immediately released a statement of apology for \"driving in an over-exuberant manner\". In May 2010, Hamilton was charged with intentionally losing control of a vehicle. Hamilton was awarded an MBE by the Queen in the 2009 New Year Honours. == Early career == === Karting === Hamilton began karting in 1993 at the age of eight. He quickly began winning races and class championships. At the age of ten he approached McLaren F1 team boss Ron Dennis for an autograph. He told him, \"Hi. I'm Lewis Hamilton. I won the British Championship and one day I want to be racing your F1 cars.\" Dennis wrote in his autograph book, \"Phone me in nine years, we'll sort something out then.\" Hamilton made good progress through the karting ranks. Ron Dennis signed Hamilton to the McLaren driver development program. This contract included an option of a future F1 seat. Hamilton would become the youngest ever driver to secure a contract which led in an F1 racing position. Hamilton continued his progress in karting. In the top level of karting, his team mate was Nico Rosberg. Rosberg would later drive for the Williams and Mercedes GP teams in Formula One. Following his karting successes the British Racing Drivers' Club made him a ‘Rising Star’ Member in 2000. In 2001, Michael Schumacher made a one-time return to karts and competed against Hamilton along with other future F1 drivers Vitantonio Liuzzi and Nico Rosberg. Hamilton ended the final in seventh, four places behind Schumacher. Although the two saw little of each other on the track Schumacher praised the young Briton (see quote box). === Formula Renault and Formula Three === Hamilton began his car racing career in the 2001 Formula Renault UK Winter Series. He finished fifth overall in the winter series. This led to full Formula Renault UK seasons in 2002 and 2003. Hamilton finished 2002 in third place. In 2003 he won the championship with ten wins and 419 points. Since he had enough points to win the championship, Hamilton missed the last two races of the season. He made his debut in the British Formula Three Championship at the season finale. He did show his speed at both the Macau Grand Prix and Korea Super Prix. In Korea, he qualified on pole position in his first visit to the track. It was only his fourth F3 race. Hamilton made his debut in the Formula 3 Euro Series in 2004. Hamilton ended the year fifth in the championship. He first tested for McLaren in late 2004 at Silverstone. Hamilton moved to the Euro Series champions ASM for the 2005 season. He dominated the championship, winning 15 of the 20 rounds. He also won the Marlboro Masters of Formula 3 at Zandvoort. === GP2 === With his success in Formula Three, Hamilton moved to GP2 for the 2006 season. He won the GP2 championship at his first attempt, beating Nelson Piquet, Jr. and Timo Glock. His 2006 GP2 championship happened at the same time there was a vacancy at McLaren. Juan Pablo Montoya left Formula on to race in NASCAR, and Kimi Räikkönen left to join Ferrari. Hamilton was confirmed as the team's second driver. He would be paired with defending champion Fernando Alonso for the season. He was told of McLaren's decision on 30 September. The news was not made public until 24 November. McLaren was afraid the news would be overshadowed by Michael Schumacher's retirement announcement. == Formula One career == ===McLaren (2007–2012)=== Hamilton's first season in Formula One saw him partner two-time and defending World Champion Fernando Alonso. Hamilton is the first and, , the only black driver to race in the series. After finishing on the podium in his debut, Hamilton went on to set several records as he finished runner-up in the World Drivers' Championship to Kimi Räikkönen by one point, including those for the most consecutive podium finishes from debut (9), the joint most wins in a debut season (4) and the most points in a debut season (109). Throughout the season, Hamilton and Alonso were involved in a number of incidents which resulted in tensions between both drivers and the team, culminating in Alonso and McLaren terminating their contract by mutual consent in November. Following a successful first season at McLaren, Hamilton signed a multi-million-pound contract to stay with the team until 2012. Hamilton's success continued in 2008 as he amassed five victories and ten podium finishes. As the season reached its conclusion in Brazil, it became a clear two-way fight for the title between the home favourite Felipe Massa and the young Briton. Hamilton won his first title in dramatic fashion in the last race of the season, the 2008 Brazilian Grand Prix, overtaking Timo Glock for fifth position in the final corners of the last lap to become the then- youngest Formula One World Champion in history and to deny race-winner Massa the title by one point. This made Hamilton the first British driver to win the World Championship since Damon Hill in 1996. In his last four years with McLaren, Hamilton continued to score podium finishes and race victories. Hamilton entered the final round of the season with a chance of winning the title, but ultimately finished fourth as Sebastian Vettel won the race to take his maiden drivers' crown. The following year was the first season he had been out-scored by a teammate, as Jenson Button finished runner-up to champion Sebastian Vettel, during a year in which distractions in his private life and run-ins with FIA officials saw Hamilton finish a lowly fifth in the standings, after which he vowed he would return to form for 2012. Hamilton achieved four race-wins in the season as he finished fourth in the standings. Before the end of the year, Hamilton announced, to much surprise, that he would be joining Mercedes for the season, replacing the retiring Michael Schumacher. ===Mercedes (2013–2024)=== ====2013–2016: Teammates with Rosberg==== Upon signing with Mercedes in , Hamilton was reunited with his childhood karting teammate, Nico Rosberg. The move was met with surprise by pundits and the public, with some describing the move to Mercedes, a team with no recent history of success, as a gamble. In his first season with the Silver Arrows, Hamilton secured a sole race victory, winning the , where he converted an unexpected pole position into a winning margin of over 11 seconds ahead of second-place finisher Kimi Räikkönen, alongside a number of podium finishes and pole positions, finishing fourth in the standings once again, the third time in five years. Changes to regulations for the season, which mandated the use of turbo-hybrid engines, contributed to the start of a highly successful era for Hamilton. That year saw Mercedes win 16 of the 19 races that season, 11 of those secured by Hamilton as he prevailed in a season-long duel for the title against teammate Rosberg. Clinching his second drivers' title, and eclipsing the victory tally of all British drivers before him, Hamilton declared over team-radio after the final race in Abu Dhabi: \"This is the greatest day of my life.\" New driver number regulations brought in for 2014 allowed drivers to pick a unique car number to use for their entire career, and so Hamilton elected to drive under his old karting No. 44 for the remainder of his career. Before the start of the season, Hamilton announced he would not be exercising his option of switching his car number to 1, as was his prerogative as reigning World Champion, and would instead continue to race with his career No. 44. It was the first season since , when Alain Prost retired from the sport following his fourth and final World Drivers' Championship title in , that the field did not contain a car bearing the No. 1. Hamilton dominated the season, winning ten races finishing on the podium a record seventeen times as he matched his hero Ayrton Senna's three World Championships titles. The rivalry between him and Rosberg intensified, climaxing in a heated battle at the US Grand Prix where Hamilton won in an action-packed, wheel-to-wheel battle with his teammate to clinch the title with three races to spare. That year, Hamilton extended his contract with Mercedes for three additional years in a deal reportedly worth more than £100 million, making him one of the best-paid drivers in Formula One, as well as allowing Hamilton to retain his own image rights, which is considered unusual in the sport, and keep his championship-winning cars and trophies. Despite recording more pole positions and race wins than any other driver in , Hamilton lost the drivers' title by five points to his teammate, Rosberg. The team's policy of letting the pair fight freely led to several acrimonious exchanges both on and off the track, culminating in Hamilton defying team- orders at the season finale in Abu Dhabi and deliberately slowing to back Rosberg into the chasing pack at the end of the race in an unsuccessful bid to encourage other drivers to overtake his teammate, which would have allowed him to win the title. Ultimately, a succession of poor starts from Hamilton early in the season and a crucial engine blowout in Malaysia meant Rosberg took the title, which he successfully secured before announcing his shock retirement from the sport immediately after beating his rival. ====2017–2020: Four titles in a row==== Following Rosberg's retirement, Ferrari's Sebastian Vettel became Hamilton's closest rival as the pair exchanged the championship lead throughout in a tense title fight. Hamilton registered 11 pole positions that season as he took the record for the all-time most pole positions, and his consistency (finishing every race in the points), as well as a lack of a serious challenge from his new teammate Valtteri Bottas, saw him record nine race victories and secure his fourth World Drivers' title as he overturned a points deficit to Vettel in the first half of the season, ultimately wrapping the title up in Mexico with two races to spare. The season was the first time that two four-time World Champions, Hamilton and Vettel, would be competing for a fifth title and was billed as the \"Fight for Five\" by journalists and fans. As with the season before, Ferrari and Vettel appeared to have the upper hand for much of the season, topping the standings until the half-way point. However, Vettel's season unravelled with a number of driver and mechanical errors, while Hamilton's run of six wins in seven in the latter half of the season saw Hamilton clinch the title in Mexico for a second year running as he set a new record for the most points scored in a season (408). During the season, Hamilton signed a two-year contract with Mercedes, reported to be worth up to £40 million per year, making him the best-paid Formula One driver in history. Having signed a contract with Mercedes that lasted until 2020, it was confirmed Hamilton would defend his title in . Hamilton led the drivers' standings for the majority of the season, fending off title challenges from team-mate Bottas, the Honda-powered Red Bull of Verstappen and Ferrari's recently promoted Leclerc, to clinch his sixth drivers' crown at the 2019 United States Grand Prix with two races remaining. After scoring his sixth career grand slam in the final race of the season, Hamilton ended the season with 11 wins (matching his previous best in 2014 and 2018) and 17 podiums (matching the all-time record for a fourth time) as well as achieving 5 pole positions. His total of 413 points for the season was a new all-time record, seeing the Briton finish 87 points clear of second-placed Bottas. Hamilton won his seventh drivers' title in , equalling the record set by Schumacher, in a season heavily impacted by the COVID-19 pandemic. Over the shortened seventeen-race season, Hamilton took 11 wins (equalling his previous personal best, but in fewer races) including one in Portugal to break Schumacher's record of 91 wins. He also took 14 podiums and 10 pole positions. Hamilton missed the 2020 Sakhir Grand Prix after contracting COVID-19 and replaced to Mercedes test driver George Russell, originally planned replace to Stoffel Vandoorne or Jack Aitken, his first race absence since his debut in 2007. Hamilton clinched the title at the 2020 Turkish Grand Prix with three rounds to spare and ended the season 124 points clear of his team-mate, Bottas, who finished second in the standings. Amid Formula One's We Race as One campaign and growing global support for the Black Lives Matter movement, Hamilton took the knee ahead of every race he entered and wore t-shirts bearing the Black Lives Matter slogan. Hamilton and Bottas' W11 cars also sported a black livery as a statement of Mercedes' commitment to diversity.name=\"blacklivery\"> ====2021 season: Title battle vs. Verstappen and century of wins==== Early on in the season, Hamilton and Red Bull's Max Verstappen emerged as title favourites. The pair frequently exchanged the championship lead throughout the season—often sparring (and occasionally coming together) on track—and entered the last race in Abu Dhabi level on points. In Abu Dhabi, Verstappen overtook Hamilton on the final lap of the race, denying Hamilton his eighth title. During the season, Hamilton became the first driver to surpass 100 pole positions and 100 race wins, respectively. The season finale was marred by controversy over race director Michael Masi's decision to instruct only the lapped cars separating Verstappen and Hamilton to un-lap themselves under the safety car, which eliminated any gap between the pair and allowed the Dutchman, running newly fitted soft tyres, to enter the final lap immediately behind Hamilton on his worn hard tyres. Four days after the race, the FIA announced that it would conduct an internal investigation into the incident. Masi was subsequently removed from his role as race director, with the FIA World Motor Sport Council report finding that \"human error\" resulted in the failure to follow Formula One Sporting Regulations concerning the withdrawal of the safety car, but also that the final standings \"are valid, final and cannot now be changed.\" Notwithstanding the controversy in Abu Dhabi, BBC Sport's Andrew Benson described the season as \"one of the most intense, hard- fought battles in sporting history\", with Hamilton and Verstappen having \"been head and shoulders—and a lot more—clear of every other driver on the grid.\" ====2022 season==== Hamilton is partnered by George Russell for , in place of the departing Bottas. The season saw significant changes in technical regulations which sought to utilise ground effect to generate downforce. During pre-season testing in Bahrain, Mercedes introduced its \"zero sidepod\" car design, which was radically different to that of its competitors. The Mercedes W13 suffered with extreme porpoising early in the season which limited the car's potential; at the Saudi Arabian Grand Prix, Hamilton deemed the car \"undrivable\". == 2020 == Hamilton won 4 out of 6 races so far in the Spanish Grand Prix. === Records === Hamilton has matched or set the following records in Formula One: * Most consecutive podiums from debut race: 9 – Australian GP 2007 – British GP 2007 (previous record was 2 by Peter Arundell – Monaco GP 1964 – Dutch GP 1964) * Most consecutive podiums for a British driver: 9 – Australian GP 2007 – British GP 2007 (tied with Jim Clark – Belgian GP 1963 – South African GP 1963) * Youngest driver to lead the World Championship: 22 years, 4 months, 8 days – at the Bahrain GP 2007 (Previous record was 23 years, 7 months, 22 days by Fernando Alonso at the Malaysian GP 2005) * Most wins in a debut season: 4, Canadian, USA, Hungarian and Japanese GPs 2007 (equalling Jacques Villeneuve, European, British, Hungarian and Portuguese GPs 1996) * Most pole positions in a debut season: 6, Canadian, USA, British, Hungarian, Japanese and Chinese GPs 2007 (Previous record was 3 held jointly by Jacques Villeneuve () and Juan Pablo Montoya ()) * Most points in a debut season: 109 * Second youngest F1 World Champion : 23 years and 300 days. Sebastian Vettel is now the youngest champion. In his debut season, Hamilton took the record of Youngest World Drivers' Championship runner-up, at 22 years and 288 days, previously held by Kimi Räikkönen at 23 years and 360 days. In 2009, this record was taken by Sebastian Vettel, who was 22 years and 122 days when he secured runner-up position in the championship. Hamilton is the first driver of black heritage to compete in Formula One (although Willy T. Ribbs tested an F1 car in 1986). He is the first driver of black heritage to win a major race at Indianapolis Motor Speedway in any discipline. In addition, he is the third youngest driver to achieve an F1 pole position, and the fourteenth F1 driver to achieve a podium finish on his debut. ==Racing record== ===Career summary=== Season Series Team Races Wins Poles F/Laps Podiums Points Position 2001 Formula Renault UK Winter Series Manor Motorsport 4 0 0 0 0 48 7th 2002 Formula Renault UK Manor Motorsport 13 3 3 5 7 274 3rd 2002 Formula Renault 2000 Eurocup 4 1 1 2 3 92 5th 2003 Formula Renault UK Manor Motorsport 15 10 11 9 13 419 1st 2003 British Formula 3 Championship 2 0 0 0 0 0 NC 2003 Formula Renault 2000 Masters 2 0 0 0 1 24 12th 2003 Formula Renault 2000 Germany 2 0 0 0 0 25 27th 2003 Korea Super Prix 1 0 1 0 0 N/A NC 2003 Macau Grand Prix 1 0 0 0 0 N/A NC 2004 Formula 3 Euro Series Manor Motorsport 20 1 1 2 5 69 5th 2004 Bahrain Superprix 1 1 0 0 1 N/A 1st 2004 Macau Grand Prix 1 0 1 0 0 N/A 14th 2004 Masters of Formula 3 1 0 0 0 0 N/A 7th 2005 Formula 3 Euro Series ASM Formule 3 20 15 13 10 17 172 1st 2005 Masters of Formula 3 1 1 1 1 1 N/A 1st 2006 GP2 Series ART Grand Prix 21 5 1 7 14 114 1st 2007 Formula One Vodafone McLaren Mercedes 17 4 6 2 12 109 2nd 2008 Formula One Vodafone McLaren Mercedes 18 5 7 1 10 98 1st 2009 Formula One Vodafone McLaren Mercedes 17 2 4 0 5 49 5th 2010 Formula One Vodafone McLaren Mercedes 19 3 1 5 9 240 4th 2011 Formula One Vodafone McLaren Mercedes 19 3 1 3 6 227 5th 2012 Formula One Vodafone McLaren Mercedes 20 4 7 1 7 190 4th 2013 Formula One Mercedes AMG Petronas F1 Team 19 1 5 1 5 189 4th 2014 Formula One Mercedes AMG Petronas F1 Team 19 11 7 7 16 384 1st 2015 Formula One Mercedes AMG Petronas F1 Team 19 10 11 8 17 381 1st 2016 Formula One Mercedes AMG Petronas F1 Team 21 10 12 3 17 380 2nd 2017 Formula One Mercedes AMG Petronas Motorsport 20 9 11 7 13 363 1st 2018 Formula One Mercedes AMG Petronas Motorsport 21 11 11 3 17 408 1st 2019 Formula One Mercedes AMG Petronas Motorsport 21 11 5 6 17 413 1st 2020 Formula One Mercedes-AMG Petronas F1 Team 16 11 10 6 14 347 1st 2021 Formula One Mercedes-AMG Petronas F1 Team 22 8 5 6 17 387.5 2nd 2022 Formula One Mercedes-AMG Petronas F1 Team 22 0 0 2 9 240 6th 2023 Formula One Mercedes-AMG Petronas F1 Team 22 1 4 6 234 3rd 2024 Formula One Mercedes-AMG Petronas F1 Team 20 2 0 2 4 189* 6th* * Season still in progress ===Complete Formula 3 Euro Series results=== (key) (Races in bold indicate pole position; races in italics indicate fastest lap) Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 DC Points 2004 Manor Motorsport Dallara F302/049 HWA-Mercedes HOC 1 HOC 2 EST 1 EST 2 ADR 1 ADR 2 PAU 1 PAU 2 NOR 1 NOR 2 MAG 1 MAG 2 NÜR 1 NÜR 2 ZAN 1 ZAN 2 BRN 1 BRN 2 HOC 1 HOC 2 5th 68 2005 ASM Formule 3 Dallara F305/021 Mercedes HOC 1 HOC 2 PAU 1 PAU 2 SPA 1 SPA 2 MON 1 MON 2 OSC 1 OSC 2 NOR 1 NOR 2 NÜR 1 NÜR 2 ZAN 1 ZAN 2 LAU 1 LAU 2 HOC 1 HOC 2 1st 172 ===Complete GP2 Series results=== (key) (Races in bold indicate pole position; races in italics indicate fastest lap) Year Entrant 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 DC Points 2006 ART Grand Prix VAL FEA VAL SPR IMO FEA IMO SPR NÜR FEA NÜR SPR CAT FEA CAT SPR MON FEA SIL FEA SIL SPR MAG FEA MAG SPR HOC FEA HOC SPR HUN FEA HUN SPR IST FEA IST SPR MNZ FEA MNZ SPR 1st 114 ===Complete Formula One results=== (key) (Races in bold indicate pole position; races in italics indicate fastest lap) Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 Points Vodafone McLaren Mercedes McLaren MP4-22 Mercedes FO 108T 2.4 V8 AUS MAL BHR ESP MON CAN USA FRA GBR EUR HUN TUR ITA BEL JPN CHN BRA 2nd 109 Vodafone McLaren Mercedes McLaren MP4-23 Mercedes FO 108V 2.4 V8 AUS MAL BHR ESP TUR MON CAN FRA GBR GER HUN EUR BEL ITA SIN JPN CHN BRA 1st 98 Vodafone McLaren Mercedes McLaren MP4-24 Mercedes FO 108W 2.4 V8 AUS MAL CHN BHR ESP MON TUR GBR GER HUN EUR BEL ITA SIN JPN BRA ABU 5th 49 Vodafone McLaren Mercedes McLaren MP4-25 Mercedes FO 108X 2.4 V8 BHR AUS MAL CHN ESP MON TUR CAN EUR GBR GER HUN BEL ITA SIN JPN KOR BRA ABU 4th 240 Vodafone McLaren Mercedes McLaren MP4-26 Mercedes FO 108Y 2.4 V8 AUS MAL CHN TUR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU BRA 5th 227 Vodafone McLaren Mercedes McLaren MP4-27 Mercedes FO 108Z 2.4 V8 AUS MAL CHN BHR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU USA BRA 4th 190 Mercedes AMG Petronas F1 Team Mercedes F1 W04 Mercedes FO 108F 2.4 V8 AUS MAL CHN BHR ESP MON CAN GBR GER HUN BEL ITA SIN KOR JPN IND ABU USA BRA 4th 189 Mercedes AMG Petronas F1 Team Mercedes F1 W05 Hybrid Mercedes PU106A Hybrid 1.6 V6 t AUS MAL BHR CHN ESP MON CAN AUT GBR GER HUN BEL ITA SIN JPN RUS USA BRA ABU 1st 384 Mercedes AMG Petronas F1 Team Mercedes F1 W06 Hybrid Mercedes PU106B Hybrid 1.6 V6 t AUS MAL CHN BHR ESP MON CAN AUT GBR HUN BEL ITA SIN JPN RUS USA MEX BRA ABU 1st 381 Mercedes AMG Petronas F1 Team Mercedes F1 W07 Hybrid Mercedes PU106C Hybrid 1.6 V6 t AUS BHR CHN RUS ESP MON CAN EUR AUT GBR HUN GER BEL ITA SIN MAL JPN USA MEX BRA ABU 2nd 380 Mercedes AMG Petronas Motorsport Mercedes AMG F1 W08 EQ Power+ Mercedes M08 EQ Power+ 1.6 V6 t AUS CHN BHR RUS ESP MON CAN AZE AUT GBR HUN BEL ITA SIN MAL JPN USA MEX BRA ABU 1st 363 Mercedes AMG Petronas Motorsport Mercedes AMG F1 W09 EQ Power+ Mercedes M09 EQ Power+ 1.6 V6 t AUS BHR CHN AZE ESP MON CAN FRA AUT GBR GER HUN BEL ITA SIN RUS JPN USA MEX BRA ABU 1st 408 Mercedes AMG Petronas Motorsport Mercedes AMG F1 W10 EQ Power+ Mercedes M10 EQ Power+ 1.6 V6 t AUS BHR CHN AZE ESP MON CAN FRA AUT GBR GER HUN BEL ITA SIN RUS JPN MEX USA BRA ABU 1st 413 Mercedes-AMG Petronas F1 Team Mercedes AMG F1 W11 EQ Performance Mercedes M11 EQ Performance 1.6 V6 t * Season still in progress. Did not finish, but was classified as he had completed more than 90% of the race distance. Half points awarded as less than 75% of race distance was completed. ==References== == References == == Other websites == * Official website Category:1985 births Category:Living people Category:Black British sportspeople Category:English Formula One drivers Category:Formula One current Category:GP2 Series drivers Category:People from Stevenage Category:Sportspeople from Hertfordshire Category:People with dyslexia",
 "title": "Lewis Hamilton"
}