{
 "id": "1158292",
 "text": "The Khatri‌ people‌ or Kirar Baniya which symbolically used to exegete the weaker section of such epithetic varna based society and facetiously affronted by an inbreeded criminal background. == Caste segment == The caste of Khatris, which traditionally categorised as proletarian Vaishya Jati, due to their confinement under Other Backward class (OBC) and socio-economic standardised deprivation during the early stage of 1901 consensus which laterally held by British-Raj scribers. except some spinning boundaries. which centrally lies between the commuted zone of Punjabi and Delhi, where they segmentally concluded under General restitution by central authority of Indian government. However sometimes they aboriginally decanted as mercantile (trading) collision which further; devastated as credentialed weaver refuging in the state of India and some midstream parts of Ganga Basin, which episodically determined by Brahmin men with redundant _Shudra wives_ , who immensely tried to claim higher status in order to priming them within\"Kshatriya\" manifestations to enhance their caste profiling or oppressive status similar to Kayastha hegemonic prosperity but theologically it doesn't get acceptance outside of the generic sociality whereas it reflecting to the complexities of caste dynamics. == Identity crises == In mid 20th century, for their upward liberation, over the time, they were still able to evaluated within the Vaishya or merchant caste, making this grouping significantly weakly laddered bellow the Jat caste which social , while another theory was that they did not fit into such unicorn society or might've rejected the Priestly Brahminical order and diverged greatly from the feudal elites of the warrior confederacy. == Caste formation == === Scholar Opinion === However due to diversified contentions solidified origin of Khatri is still topic of debate and some assimilative theories suggest they notably doesn't coexist within the original Indian varna system and gas-lighted their newly reformed identity with the helpful soughting of Arya Samaj movement whereas in resultant now they able respawn status of divija from outcaste wether they perform ceremonial practice advocated by Sarawat Brahmin,Over the predated eventing some of this seeking huber adjoined the Arya Samaj extremism. == Under Mughal Empire == > Therefore, even since the Punjabi Khatri become Proto-bureaucrat's and > largely aquatinted for clerking under Mughal officialdom and often recruited > as advisory's for their strategic ministry for interacting within lahore > darbar but after sometimes later some of this == Related Pages == * Vaishya * Khatri Chhetri * Refugee == References == Category:Castes Category:Tribes of Pakistan Category:Social groups of Punjab Category:Social groups of India Category:Ethnic groups in India Category:Community",
 "title": "Khatri (caste)"
}