{
 "id": "1158734",
 "text": "Canal 9 Litoral, is an Argentine free-to-air television channel affiliated with El Trece that transmits from the city of Paraná. The channel can be seen in a large part of the Entre Ríos Province and surrounding areas through repeaters. It is mainly operated by the Neomedia Group. ==History== On May 23, 1984, the Federal Broadcasting Committee, through Resolution 419, authorized the provincial government to install a repeater in the city of Paraná, capital of the province of Entre Ríos, to retransmit the state ATC signal. The channel was operated by the provincial government. In addition, it broadcast its own programming for a few hours. The license began its regular broadcasts on April 22, 1985 as LRI 450 TV Canal 9 of Paraná. At that time, the province still did not have its own television channel and depended on the Santa Fe or Buenos Aires channels. With the endorsement of then-governor Sergio Montiel (1983-1987), the station was organized and launched, with Reynaldo Adrián Puig as its first director. Víctor González, Alfredo Pintos (head of news), Jano Colcerniani, Eduardo Camargo, Raúl Galanti, Santiago Rinaldi and Inés Ghiggi were the first presenters of the channel, with Rubén Noble as technical manager and Tati Vieyra as commercial manager. Its first broadcasts were made from two rooms equipped on the 4th floor of the Retirement Fund building and the transmission plant at the Paraná Seminary. In the first years, viewers in the city of Victoria had to point their VHF antennas towards the capital of Entry to be able to receive the signal – of poor quality – from Channel 9, until the station installed a repeater in the town of Febre. On November 25, 1997, the Australian company Prime Television Ltd. announced the purchase of the Channel 9 network and its stations (including Channel 9 of Paraná) for approximately USD 150 million. This transaction was complete the following month. By January 1998, 50% of the network had passed into the hands of Tournaments and Competitions, while, by March 1999, TyC was co-owner of said percentage together with Atlántida Comunicaciones through the company AC Inversora. On January 3, 2014, The channel began broadcasting programming in HD. On March 31, 2015, the Federal Authority for Audiovisual Communication Services, through Resolution 236, assigned Channel 9 to Channel 35.1 to broadcast regularly (in HD format) on Digital Terrestrial Television. For 2021, the city of Victoria, Entre Ríos has a repeater located on the property of the Victoria Rural Society, assigning it to channel 10.",
 "title": "Canal 9 Litoral"
}