{
 "id": "1159666",
 "text": "Sati, or suttee, is an old practice where a Hindu woman, after her husband dies, burns herself alive. Sometimes she does it willingly, but sometimes she is forced. People argue about whether it is written in early Hindu books, but it has been connected to other customs in India that have taken away women’s rights, like owning property. A different kind of sati is when widows are ignored or treated badly, which has happened for a very long time. Ancient Greek writings around 300 BCE talk about sati, but it became more common as a fire sacrifice among Rajput groups in northwestern India during the medieval times and later spread. During the Mughal period (1526–1857), sati was mostly seen among rich Rajput families in western India. The Muslim Mughals banned it, and this became a difference between them and the Hindu Rajputs. In the early 1800s, when the British East India Company was gaining power in India, they also tried to stop it. William Carey, a British Christian preacher, reported 438 cases near Calcutta in 1803, even though the practice was banned in the city. Between 1815 and 1818, the number of cases in Bengal doubled. People like Carey and a Hindu reformer, Raja Ram Mohan Roy, opposed sati. Because of their efforts, Lord William Bentinck, the British Governor-General, passed the Bengal Sati Regulation in 1829, making it a crime to burn or bury Hindu widows alive. More laws followed, including ones to allow widow remarriage and stop other forms of violence against women. In the late 1900s, some cases of sati still happened. In response, the Indian government made the Sati (Prevention) Act in 1987 to punish anyone helping or praising sati. Even so, as of 2020, there were still about 250 sati temples in India. People pray there to honor a goddess who burned herself after her father insulted her husband and also to the idea of women burning themselves on their husband’s funeral fire. == Etymology and usage == The word \"sati\" comes from the name of the Hindu goddess Sati. She is said to have burned herself because she could not bear the shame her father Daksha brought on her and her husband Shiva. The word \"sati\" first meant \"chaste woman.\" In Hindi and Sanskrit writings, \"sati\" means \"good wife.\" English writers in India often used the word \"suttee.\" Originally, \"sati\" was about the woman, not the burning act. Some other related words are: * Sativrata is a rare word for a woman who promises to protect her husband while alive and die with him when he dies. * Satimata means a respected widow who performed sati. Words for the act of burning are: * Sahagamana means \"going with,\" and sahamarana means \"dying with.\" * Anvarohana means \"rising\" or \"climbing\" onto the fire, and satidaha means the burning process. * Satipratha refers to the custom of burning widows alive. The Indian law called the Sati (Prevention) Act, 1987, Part I, Section 2(c), defines \"sati\" as the act or ritual itself. The spelling \"suttee\" comes from old English writing, while \"satī\" is a modern way of writing the Sanskrit word using the Latin alphabet system. == Origin and spread == The beginning and spread of sati are complicated and have been discussed a lot, with no clear agreement. Some people think that the idea of burning or sacrificing widows might be very old, from prehistoric times. Archaeologist Elena Efimovna Kuzmina found similar burial customs between the Andronovo cultures (about 1800–1400 BCE) of Central Asia and the Vedic Age in India. She believes sati was mostly a symbolic act, like a double burial or double burning, in both cultures, but it was not strictly followed. === Vedic symbolic practice === In the Vedic times, Romila Thapar says that when clans changed to caste systems, wives had to take part in many rituals but had little power. One Vedic ritual allowed an important widow to do a \"symbolic self-burning\" when her husband died, and later she could marry his brother. Later, people used this ritual as a reason for real sati, where a widow was expected to burn with her husband.Thapar, Romila (2002), The Penguin History of Early India. From the Origins to AD 1300, Penguin Anand A. Yang says the Rig Veda talks about a \"copying ritual\" where a widow lay on her husband’s funeral fire but was taken off by a male family member before the fire was lit. He notes that the word agre meaning \"to go forth\" was wrongly changed to agneh, meaning \"into the fire,\" in about the 16th century to make it seem like the Vedas approved of sati. === Early medieval origins === The start and spread of sati are complicated and debated, with no clear answers. People believe widow burning began before 500 CE, in the time before the Gupta period.Thapar, Romila (2002), The Penguin History of Early India. From the Origins to AD 1300, Penguin Vidya Dehejia says Hindu customs forced it into society, becoming common after 500 CE. Ashis Nandy notes that it started from Vedic traditions, faded by the 17th century, and returned in Bengal during the 18th century because of British involvement.Nandy, Ashis (1980). Sati: A Nineteenth Century Tale of Women, Violence and Protest in the book \"At the Edge of Psychology\". Oxford University Press. p. 1. Roshen Dalal thinks it grew from the 5th to 7th century, becoming a custom around 1000 CE, mainly among upper classes like the Rajputs. The Mahabharata mentions Madri's suicide by sati, but this might have been added later as it does not match other verses. Dehejia says sati began with Kshatriya (warrior) groups and stayed mostly with them. Thapar links it to new Kshatriyas who followed texts too literally, turning a symbolic act into a real burning of widows. She also points to patriarchy, kinship changes, and control over women as reasons for its rise. === Medieval spread === Sati spread when people wanted to copy royal and warrior customs to gain status, known as Sanskritisation. Islamic invasions, widow suffering, and Brahmin involvement helped its spread, though Brahmins were originally forbidden from practicing it. It also became tied to preserving women's honor, similar to jauhar,Jogan Shankar (1992). Social Problems And Welfare In India. Ashish Publishing House. where women chose death to avoid capture in war. Rajputs practiced jauhar, and Brahmins later copied them, turning the idea of a brave woman into the ideal of a \"good woman.\" From there, sati spread to other castes. David Brick from Yale says sati was rejected in Kashmir by Brahmins at first but spread later, as seen in the Vishnu Smriti (700–1000 CE), likely written in Kashmir. By the 12th century, Brahmins across India knew of sati. Anand Yang notes it appeared in Bengal by the 12th century, starting with Kshatriyas and later spreading to Brahmins and lower castes. Julia Leslie says Bengali Brahmins practiced sati more between 1680 and 1830 after widows gained inheritance rights. === Colonial era revival === In the colonial period, sati rose again in Bengal. Three reasons were: belief that Hindu texts supported it, neighbors encouraging it to steal widows' property, and poverty driving women to escape a hard life. Daniel Grey says colonial views distorted the history of sati to promote \"problem Hindu\" ideas. Lata Mani writes that British debates on sati described a \"golden age\" of women before Muslim rule, framing British efforts as saving Hindus from Islamic rule.Mani, L. (1998). Contentious traditions: the debate on Sati in colonial India. Berkeley: University of California Press.pg 193 British missionaries studied Hindu texts and tried to show that sati was not required by Hinduism to persuade people against it. == References == === Citations === Category:Death customs Category:Hinduism",
 "title": "Sati (practice)"
}