{
 "id": "115935",
 "text": "The structure of the Earth is divided into layers. These layers are both physically and chemically different. The Earth has an outer solid layer called the crust, a highly viscous layer called the mantle, a liquid layer that is the outer part of the core, called the outer core, and a solid center called the inner core. The shape of the earth is an oblate spheroid, because it is slightly flattened at the poles and bulging at the equator. The boundaries between these layers were discovered by seismographs which showed the way vibrations bounced off the layers during earthquakes. Between the Earth's crust and the mantle is a boundary called the moho. It was the first discovery of a major change in the Earth's structure as one goes deeper. #The crust is the outermost layer of the Earth. It is made of solid rocks. It is mostly made of the lighter elements, silicon, oxygen, aluminium. Because of this, it is known as sial (silicon = Si; aluminium = Al) or felsic. #The mantle is the layer of the Earth right below the crust. It is made mostly of oxygen, silicon and the heavier element magnesium. It is known as sima (Si for silicon + ma for magnesium) or mafic. The mantle itself is divided into layers. ##The uppermost part of the mantle is solid, and forms the base of the crust. It is made of the heavy rock peridotite. The continental and oceanic plates include both the crust proper and this uppermost solid layer of the mantle. Together this mass makes up the lithosphere. The lithosphere plates float on the semi- liquid aesthenosphere below. ##Upper aesthenosphere: magma ##Lower aesthenosphere ##Lower mantle #The Earth's core is made of solid iron and nickel, and is at about 50006000 °C. which is about the temperature of the photosphere of the Sun. ##Outer core is a liquid layer below the mantle. ##Inner core is the very center of the Earth. A full explanation of these effects is not yet clear. It seems that the high temperature and pressure cause changes in the crystallization of minerals, so that the composition might be a kind of changing mixture of liquid and crystals. == The moho == The moho, properly called the Mohorovičić discontinuity, is the boundary between the Earth's crust and the mantle. It was discovered by Croatian seismologist Andrija Mohorovičić in 1909. He discovered that seismograms of earthquakes showed two kinds of seismic waves. There is a shallow slower wave which arrives first, and a deep faster wave which arrives second. He reasoned that the deeper wave changed speed as it got just below the mantle. The reason it went faster was that the material of the mantle was different from that of the crust. The discontinuity lies 3040 km below the surface of continents, and less deep below the ocean floors.Levin H. 2006. The Earth through time. 8th ed, New York: Wiley. Chapter 7, p184. === Drilling holes === Geologists have been trying to get at the Moho for decades. During the late 1950s and early 1960s Project Mohole did not get enough support, and was cancelled by the United States Congress in 1967. Efforts were also made by the Soviet Union. They reached a depth of over 15 years, the world's deepest hole, before abandoning the attempt in 1989. Reaching the discontinuity is still an important scientific target. One proposal considers a self-descending tungsten capsule. The idea is that the capsule would be filled with radioactive material. This would give off enough heat to melt the surrounding rock, and the capsule would be pulled down by gravity. The Japanese project Chikyū Hakken (\"Earth discovery\") plans to use a drilling shop to drill down through the thinner ocean crust. On 6 September 2012 Scientific deep sea drilling vessel Chikyu set a new world record by drilling down and obtaining rock samples from deeper than 2,111 metres below the seafloor off the Shimokita Peninsula of Japan in the northwest Pacific Ocean.A report on the findings does not appear to be published yet. The following link is to the planning proposal, April 30 2012. === Macquarie Island === Macquarie Island, off Tasmania, is at the meeting-point of two huge oceanic plates: the structureoftheearth Indo-Australian Plate. The island is made of material pushed up from deep in the Earth's mantle. It is thought that the green ophiolite rock was formed at the moho,That is, the junction between the bottom of the Earth's crust and the top of the Earth's mantle. and was brought up by a mid-oceanic ridge. Now it comes to the surface because the two plates are scrunching together. It is the only place on Earth where this is happening at present.Macquarie Island - UNESCO World Heritage Centre. Whc.unesco.org. Retrieved on 2013-07-16. There are other places where ophiolite is found, but they were brought up many millions of years ago. Ophiolites are found in all the major mountain belts of the world.Ben-Avraham Z. et al 1982. The emplacement of ophiolites by collision. Journal of Geophysical Research: Solid Earth (1978-2012) 87 (B5) 3861-3867. == References == Category:Earth Category:Structure of the Earth",
 "title": "Structure of the Earth"
}