{
 "id": "1159789",
 "text": "The Thiruthani Murugan Temple is a prominent Hindu temple dedicated to Lord Murugan, located in the town of Thiruthani in Tamil Nadu, India. It is one of the Arupadai Veedu, the six sacred abodes of Murugan, and holds great religious and cultural significance. The temple is situated on a hill with 365 steps, symbolizing the days of the year. == History == According to Hindu mythology, Thiruthani is the site where Lord Murugan, after defeating the demon Surapadman at Tiruchendur, came to attain peace and self-realization. It is also believed that this is where Lord Murugan married Deivanai, the daughter of Indra, the king of the gods. The temple is mentioned in several ancient Tamil texts, including the Tirupugal by the saint Arunagirinathar. Historical records indicate that the temple has been a site of worship for centuries and was patronized by various Tamil dynasties, including the Cholas and Pallavas. == Architecture == The Thiruthani Murugan Temple is an excellent example of Dravidian architecture. The temple is built on a hill, and devotees must climb 365 steps to reach the sanctum, each step representing a day of the year. The temple features intricate carvings, a beautifully sculpted rajagopuram (gateway tower), and various shrines dedicated to Lord Murugan and his consorts, Valli and Deivanai. The main sanctum houses an idol of Lord Murugan in a standing posture, holding a spear (Vel). The temple complex also includes shrines for Vinayagar (Ganesha) and other deities. == Spiritual Significance == The temple is believed to bring mental peace, prosperity, and family harmony to devotees. Pilgrims visit the temple to seek Lord Murugan's blessings for success, good health, and the fulfillment of wishes. Many consider a visit to the temple as a way to overcome personal and spiritual challenges. == Festivals and Rituals == The temple celebrates several festivals throughout the year, drawing large crowds of devotees: * Thaipusam: This festival commemorates the day Lord Murugan received the spear (Vel) from his mother, Goddess Parvati. * Aadi Krittikai: Celebrated during the Tamil month of Aadi (July-August), it is an auspicious time for devotees to worship Lord Murugan. * Panguni Uthiram: This marks the celestial wedding of Lord Murugan and Deivanai. * Skanda Sashti: Observed over six days, this festival celebrates Lord Murugan’s victory over the demon Surapadman. Daily rituals include Panchamrutha Abhishekam, where the deity is bathed with a mixture of honey, milk, ghee, sugar, and banana. == Legends and Myths == One of the legends associated with the temple is that Lord Murugan blessed the gods and sages at this location after his victory over Surapadman. Another legend states that the divine marriage of Murugan and Deivanai took place here, making it a site of divine union and harmony. == Accessibility == The Thiruthani Murugan Temple is well-connected by road and rail: * By road: Thiruthani is approximately 70 km from Chennai and 40 km from Tirupati. Buses and private vehicles are easily available. * By rail: Thiruthani has a railway station with frequent trains from Chennai and other nearby cities. * By air: The nearest airport is the Chennai International Airport, about 80 km away. == Nearby attractions == * Tirupati Temple: A famous pilgrimage site dedicated to Lord Venkateswara, located approximately 40 km away. * Nagari Hills: Known for their scenic beauty and trekking opportunities. * Veerakaveriraya Swamy Temple: Another historic temple located nearby Category:Hindu temples Category:Temples in Tamil Nadu Category:Religious places",
 "title": "Thiruthani Murugan Temple"
}