{
 "id": "115915",
 "text": "Betta is a genus of fish. Betta splendens is a common species of this genus. Other species of betta are rarer. Betta are very brightly coloured and can often be purchased in pet stores. Other species of betta are more rare. Males often show their aggression towards both male and female bettas by flaring at one another. Betta are surface breathers and are found in small bodies of water which are full of fallen leaf litter and peat. This gives the betta many places to hide. == Mating == Male bettas breathe air from the surface to make a bubble nest to attract a female for mating. To get a female betta to lay her eggs in the nest, a male betta shows his fins and dances around her. After that, the male betta continues to annoy and bully the female betta. This shows that the male is stronger than the female, and makes the female betta fish tired. A healthy and strong female betta lays eggs several days after a male starts to pursue her. At that time, the male helps the female by pressing on her belly to squeeze out the eggs. It takes several days to lay all of the eggs. Once the female Betta lays her eggs in the nest, the male Betta will fertilize them by releasing his sperm over the eggs. == Types of betta fish == There are long-fin and short-fin betta fish. Many types of betta fish have not yet been found, and many people breed bettas to create entirely new breeds. Some are colorful, but others have just one or two colors. == Diet == In the wild, betta fish eat brine shrimp, mosquito larvae, small fly larvae, and common water fleas (Dapnia). As pets, bettas can be fed worms, brine shrimp, or fruit flies. They enjoy some human foods, including chicken, fresh raw seafood, and fruits like mangos, bananas, and melons. == Conditions in captivity == Pet betta fish need 20-cubed tanks for a living. If male bettas are put in the same tank, they will fight until one of them dies. Female bettas can live in the same tank. == References == Category:Teleosts Category:Freshwater fish",
 "title": "Betta"
}