{
 "id": "1159050",
 "text": "Loukas Patsoulas (; born 10 May 1966 ) is a former Dutch-born Greek speed skater. Patsoulas was the first speed skater who represented Greece internationally. While not being an elite athlete, he received a lot of media attention for participating at the 1989 World Allround Speed Skating Championships. During these championships he was disqualified by the International Skating Union (ISU) due to his poor performances. To prevent similar participations, the ISU started introducing limit times for international championships. Patsoulas was given permission by the IOC to participate at the Olympic Games, but due to contracting infectious mononucleosis he couldn’t participate. ==Biography== Patsoulas was born in the Netherlands. He had a Greek father and Dutch mother and had one sister. He lived since he was born in Schiebroek (Rotterdam), the Netherlands. He had a Greek passport, spoke Greek and attended a Greek school in the Netherlands. As of 1989 he was engaged with a woman of Indonesian descent. Patsoulas started with speed skating when he was fourteen years old at the speed skating club in Rotterdam. After foundation of the “Greek Ice Skating Federation” he became a member of it. After asking about the possibilities to represent Greece at international competitions within a few years, the president Christos Chatziathanasassiou of the Greek federation registered him directly for the 1989 European Allround Speed Skating Championships in Gothenburg and the 1989 World Allround Speed Skating Championships in Oslo. The registration for the European Championships was too late, but he participated at the World Championships. Patsoulas took a month's leave from his job at the Port of Rotterdam to train and prepare for the World Championships, while he had limited training opportunities at the local ice rink. While he was trained by the local ice club by trainer Nico Slegtenhorst and his friend Nikos Lanser who studied history in Leiden, he didn’t have a trainer with high level speed skating expertise. A big reception was organized for him upon his return in the Netherlands. At the World Championships he skated the 500 meters in 51.12 seconds and the 5000 metres over three minutes behind the winner in 10 minutes and 15.11 seconds. The International Skating Union (ISU) considered his performance to be too poor he became the first participant at an international speed skating tournament to be disqualified by regulations stating that a participant must appear well prepared at the start. Patsoulas received before and after the championships a lot of media attention. The next season he competed at the first round of the 1989–90 ISU Speed Skating World Cup in Berlin in November 1989. To prevent participation from low level speed skaters at international championships, the ISU announced in February 1990 to introduce limt times. Patsoulas was given permission by the IOC to participate at the Olympic Games. However, due to contracting infectious mononucleosis he couldn’t compete at the Winter Olympics. Next to speed skating, Patsoulas put himself forward for election as lijstduwer for GreenLeft in 1991. After his speed skating career he started working for his speed skating sponsor, airline Transavia. Later he moved to KLM. ==References== ==Other websites== * * * Category:1966 births Category:Speed skaters Category:Greek sportspeople Category:Living people Category:People from Rotterdam",
 "title": "Loukas Patsoulas"
}