{
 "id": "1159187",
 "text": "The University Belt is a de facto subdistrict in Manila, Philippines, describing a network of interlinking roads lined with universities, colleges and other institutions of learning in the city. Manila's districts of Sampaloc, San Miguel and Quiapo comprise the acknowledged areas of the University Belt. Other clusters of schools along the southern bank of the Pasig River, mostly in the districts of Intramuros and Ermita and the southernmost part of Malate near the city limits, are mentioned. == Early History == Manila was the center of higher education since Spanish colonial times. The first schools in Manila's Intramuros district were the Real Colegio de Santa Potenciana founded in 1589,Perez Dasmarinas, Luis. Letters from Luis Perez Dasmariñas to Felipe II. In The Philippine Islands, 1493-1898. Ohio: A.H. Clark Company, 1903-9. Vol. 9 the Universidad de San Ignacio in 1590,The First Hundred Years of the Ateneo de Manila Ateneo de Manila University website May 1, 2012 the San Jose Seminary in 1601, the University of Santo Tomas in 1611, the Colegio de San Juan de Letran in 1620, the Santa Isabel College Manila in 1632, the Universidad de San Felipe de Austria in 1640, and the Ateneo de Manila in 1859. Today, only San Juan de Letran, Santa Isabel, Santo Tomas and the Ateneo remain of those seminal institutes of learning. ==American Period to the present== During the period of American colonization, the city planner, Daniel Burnham envisioned Manila's educational hub in Santa Mesa Heights, the area north of Sampaloc, Manila in what is now present-day Quezon City. However, the American government preferred all institutions close to Rizal Park as the center, with institutions lining Calle Rizal (present-day Taft Avenue) surrounding it. Among the educational institutions of the American regime were the University of the Philippines Manila and the De La Salle University. Likewise, other colleges and universities sprung in the more populous districts of Manila, that became knaown as the \"University Belt\"; stretching from the government center of San Miguel, through the mercantile districts of Quiapo and Santa Cruz; concluding at the campus of the Pontifical and Royal University of Santo Tomas in Sampaloc which moved in 1927 from its original campus in Intramuros. By the early 1900s, nine new institutions were founded in the area: Holy Ghost College (San Miguel), San Beda University (San Miguel), La Consolacion College (San Miguel), Centro Escolar University (San Miguel), San Sebastian College (Quiapo), Santa Rita College (Quiapo), Manila Law College (Santa Cruz), the University of Manila (Sampaloc) and National University (Sampaloc). == References== Category:History of the Philippines Category:Colleges and universities in Manila",
 "title": "University Belt"
}