{
 "id": "1159168",
 "text": "Best Friends were a professional wrestling tag team and stable that are best known for their time in All Elite Wrestling (AEW) from 2019 until 2024. The members of the team were Chuck Taylor, Trent Beretta, Orange Cassidy, Kris Statlander, and Wheeler Yuta. They were sometimes managed by Danhausen. The members of the team were legitimate best friends. While teaming, Taylor was the more comedic member of the team with Beretta acting as the more serious partner. The team has also competed in Pro Wrestling Guerrilla (PWG), Ring of Honor (ROH), New Japan Pro-Wrestling (NJPW), and multiple independent promotions. ==Career== ===All Elite Wrestling=== On February 7, 2019, the Young Bucks introduced Beretta and Taylor as the newest members of the All Elite Wrestling (AEW) roster at press conference. The two made their AEW in- ring debut at Double or Nothing, defeating the team of Angélico and Jack Evans. At All Out, Orange Cassidy joined the team after saving the team from a beatdown by The Dark Order. On the October 30 episode of Dynamite, the three made their trios debut defeating Alex Reynolds, John Silver, and Q. T. Marshall. On the Double or Nothing pre-show, Best Friends defeated Private Party (Isiah Kassidy and Marq Quen) to become the number one contenders for the AEW World Tag Team Championship. On Night 1 of Fyter Fest, Best Friends challenged Kenny Omega and Adam Page for the AEW World Tag Team Championship but lost. The trio began to feud with the Inner Circle after Santana and Ortiz destroyed Taylor's mom Sue's van. On the September 16 episode of Dynamite, they defeated Santana and Ortiz in a Parking Lot Brawl. In 2021, the trio began a feud with Kip Sabian, Penelope Ford, and Miro. During the feud, Beretta ended up tearing his pectoral muscle and was out of action for months. On the March 31 episode of Dynamite, Beretta returned to help Taylor and Cassidy defeat Miro and Sabian. During the match, Kris Statlander joined the team and helped take out Penelope Ford. Beretta again had to leave the group for a while because he needed to get spinal fusion surgery. While he was away, Wheeler Yuta joined the team. The team joined the New Japan Pro-Wrestling stable CHAOS after being invited by Rocky Romero. On the December 8 episode on Dynamite, Beretta returned from injury and helped save the team from a beatdown by The Elite. At Beach Break, Cassidy defeated Adam Cole in an Unsanctioned Lights Out match. During the match, Danhausen made his AEW debut and helped distract Cole. He then began to manage the team. Beretta was not happy with the addition of Yuta to the team. On the April 8 episode of Rampage, Yuta lost a competitive match against Jon Moxley. After the match, Yuta left Best Friends to join William Regal and the Blackpool Combat Club. Statlander had to miss many months of action after she suffered a completely torn ACL and lateral meniscus in her right leg. On the October 12 episode of Dynamite, Cassidy defeated Pac to win the AEW All-Atlantic Championship. It was also Cassidy's first championship in AEW. On the April 3, 2024 episode of Dynamite, Best Friends faced the Young Bucks in a semi-final match of the AEW World Tag Team Championship tournament but lost. Best Friends went for their three-post hug after the match but Baretta ran and hit Cassidy with a knee, turning heel and leaving the group. At Double or Nothing, Cassidy defeated Beretta. Statlander also left the group after turning heel after attacking Willow Nightingale and joining Stokely Hathaway. The group was broken up shortly afterwards. == Championships and accomplishments == * All Elite Wrestling ** AEW International Championship (2 times) – Cassidy ** AEW TBS Championship (1 time) – Statlander ** 2023 Casino Tag Team Royale – Cassidy and Danhausen ** Dynamite Award (1 time) *** Hardest Moment to Clean Up After (2021) – (Best Friends vs Santana and Ortiz) – Dynamite (September 16) * Pro Wrestling Guerrilla ** Dynamite Duumvirate Tag Team Title Tournament (2014) – Trent and Taylor * Pro Wrestling Illustrated ** Most Popular Wrestler of the Year (2020) – Cassidy * DDT Pro-Wrestling **Ironman Heavymetalweight Championship (1 time) – Cassidy * Revolution Eastern Wrestling ** REW 24/7 Championship (1 time) – Cassidy * Wrestling Observer Newsletter ** Best Gimmick (2020) – Cassidy * Ring of Honor ** ROH Pure Championship (1 time) – Yuta ==References== Category:All Elite Wrestling teams and stables Category:New Japan Pro-Wrestling teams and stables Category:Ring of Honor teams and stables",
 "title": "Best Friends (professional wrestling)"
}