{
 "id": "1159408",
 "text": "Nude calendars are a type of wall calendar with nude models. These models appear in different scenes and locations. Predominantly in the United Kingdom, nude calendars are produced to raise money for charity. ==Types== There are different types of these calendars: * Calendars with pin-up models . These kinds of calendars started in the 19th century. These calendars often have pictures of pin-up models. Usually they are paid for by product placement in the pictiures. They may also have logos and a special in-house style. Calendars with female nudes become common in workplaces were mostly men worked, for example garages or car dealerships. Today, many empolyers have banned or restricted their display, because they think the calendars are a form of sex discrimination. An example for such a calendar is the Pirelli Calendar. * Sports nude calendars. Some sports teams have produced nude calendars. They do this either to get more funding or to raise the visibility of their team. Examples include the Australian women's football team prior to the 2000 Summer Olympics in Sydney, the Canadian cross-country ski team in 2001 and 2002, and a group of Canadian women biathletes in 2008. * Charity nude calendars. A group of middle-aged Englishwomen who were members of a local branch of the Women's Institute made the first such calendar. They were posing nude to raise funds for Leukaemia Research. The calendar was released in 1999, and became an international sensation; it also inspired the movie Calendar Girls. After this success more nude calendars were made for charity in the 2000s. The earnings are usually donated to various health or social causes. Participants include artists, celebrities, sportsmen and sportswomen, firefighters, military forces, the police, or members of a group such as farmers, Women's Institute members who wish to raise funds for a chosen charity. The women's rugby match Oxford and Cambridge, which was played at Twickenham in 2015, was publicised by the Oxford team making a nude calendar. ==Related pages== * Fundraising * Nude photography * Depictions of nudity ==Other websites== * Warwick University Rowing Club's nude calendar * Warwick Rowers men's calendar * Naked Business: 9 Charity Calendars in the Nude * - one of the most famous nude calendars in Poland - the Olmet calendar (Silesian Pirelli), 2019 edition ==References== Category:Nudity Category:Popular culture",
 "title": "Nude calendar"
}