{
 "id": "1159046",
 "text": "Yukti Thareja (born 6 January 2000) is an Indian model and actress. In 2019, she participated in the reality shows MTV Supermodel of the Year. She also appeared in the films Rangabali and Marco. ==Early life== Yukti Thareja was born on 6 January 2000 in Karnal, Haryana. She began her modeling career with \"Oppo Delhi Times Fresh Face 2017\", while pursuing her graduation from Sri Guru Gobind Singh College of Commerce, Delhi. == Career == In 2019, she participated in MTV Supermodel of the Year, where she was evicted at the 4th position. In 2020, she participated in MTV Ace The Quarantine. In 2021, Thareja appeared opposite Emraan Hashmi in T-Series music video \"Lut Gaye\", sung by Jubin Nautiyal. It has received more than 1.1 billion views on YouTube. In 2023, she made her Tollywood film debut with Rangabali, opposite Naga Shaurya. The same year, she was chosen as the female lead for Devil: The British Secret Agent starring alongside Nandamuri Kalyan Ram. Later, she was replaced with Samyukhta Menon. In 2024, she joined Unni Mukundan's Marco making her debut in Malayalam cinema. Thareja will next be seen in JioHotstar's musical drama series Hai Junoon! Dream. Dare. Dominate.. She is slated to appear in Telugu films KJQ opposite Dheekshith Shetty and K-Ramp opposite Kiran Abbavaram. == Filmography == === Films === Year Title Role Language Ref. 2023 Rangabali Dr. Sahaja Reddy Telugu 2024 Marco Maria Malayalam TBA Untitled next Kannada KJQ Telugu K-Ramp === Television === Year Title Role Notes Ref. 2019 MTV Supermodel of the Year Contestant 4th place 2020 MTV Ace The Quarantine 2023 Suma Adda Episode 25 === Web series === Year Title Role Ref. 2025 Hai Junoon! Dream. Dare. Dominate. Hindi === Music videos === Year Title Singer(s) Ref. 2020 Ik Supna Prabh Gill 2021 Sasarvadi Rajneesh Patel 2021 Lut Gaye Jubin Nautiyal 2024 Galti Vishal Mishra == Awards == Year Award Category Work Result Ref. 2023 South Indian International Movie Awards Best Debut Actress Rangabali == References == == Other websites == * * Category:2000 births Category:Living people Category:Indian movie actors Category:Indian television actors",
 "title": "Yukti Thareja"
}