{
 "id": "1159564",
 "text": "On November 5, 2024, in Hazari Lane, Chittagong, a Muslim person posted hurtful words on Facebook, calling the Hindu group ISKCON a \"terrorist group.\" This made the local Hindu people very angry. They went to the shop of the person who made the post and surrounded it. The army and police came together to stop the trouble. There were quarrels between the security people and the Hindu protesters. Twelve security people and many Hindu protesters got hurt. The security people hit the Hindu crowd with sticks and beat them. Afterward, 600 Hindus were blamed in a case for attacking the security people, and 80 Hindus were taken to jail. == Background == Like most cities in Bangladesh, most people in Chittagong are Muslims. About 150 Hindu people sell jewelry at Mia Shopping Center in Hazari Lane. Hindus are a small group of people, but Hazari Lane, where the event happened, has mostly been a Hindu area. In 2011, Chittagong's people were 86.74% Muslim and 11.64% Hindu. At the end of October, the Hindu people had a meeting at Laldighi Maidan in Chittagong with eight demands to stop anti-Hindu violence. They asked to punish those who attack on minorities, give payments to the victims, and make new laws to protect minorities. In October 2024, Volker Türk, a top United Nations official, also spoke about attacks on minorities in Bangladesh. After the meeting in Laldighi Maidan, Mahmudur Rahman, the editor of Dainik Amar Desh, gave a speech in Dhaka. He said, Groups like ISKCON and RAW had a big meeting in Chittagong. ISKCON has bad people from Chhatra League and Jubo League. But Charu Chandra Das Brahmachari, the leader of ISKCON Bangladesh, said ISKCON is a peaceful and non-political group. Some local Muslims also made posts on social media against ISKCON. One Muslim businessman from Hazari Lane shared a similar post. == Incident == A Muslim businessman named Osman Ali wrote on Facebook calling ISKCON a \"terrorist group.\" This made the local Hindus very angry. A group of Hindus went to Mia Shopping Center in Hazari Lane, asking Osman Ali to say sorry for the post. On the evening of November 5, 2024, the tension lasted for many hours. Later, protesters surrounded Osman Ali inside his shop. The crowd stayed in front of the shop to protest. The police and army together saved Osman Ali and took him to the police station. The crowd tried to stop them and threw bricks at the police and army. To control the crowd, the joint forces fired shots into the air. At a press meeting, Lt. Col. Ferdous Ahmed, the joint force spokesperson, said that acid from jewellery work and bricks were thrown at the security team, hurting five army members and seven police officers. At about 8:30 p.m., the joint forces went back to Hazari Lane and hit many local Hindus. They also went into houses and broke or turned off all CCTV cameras in Hindu jewellery shops. They closed all the shops. Charu Chandra Das Brahmachari, ISKCON Bangladesh's General Secretary, told Deutsche Welle: \"We want a proper investigation to find the real wrongdoers. Until then, we want fair law. We saw videos of the joint forces breaking CCTV cameras. Why would they do that? It means they wanted no evidence. This is not fair law.\" Kajol Banik, Joint Secretary of the Chittagong Jewellery Association, said: \"On Tuesday night, the joint forces came into Hazari Lane and hit everyone they found. They beat people badly. They also went into houses. All the shop owners here are Hindus. Each jewellery shop had two or three CCTV cameras, and they broke them all. If they want to arrest the person who threw acid, we won’t stop them. We heard that before breaking the gate, the joint forces shouted, 'One, two, three, open the door, or we will shoot.' Someone then threw acid from the shop.\" On November 8, police with a magistrate went to Hazari Lane and opened the closed shops. The Hindu shopkeepers said the police took the CCTV hard disks and made them sign papers saying, \"The shops were not damaged.\" On November 8, Hefazat-e- Islam Bangladesh, an Islamist group, held a rally after the Hazari Lane event at Anderkilla Shahi Jame Mosque square in Chittagong. After Friday prayers, speakers at the rally in the mosque yard asked the government to ban ISKCON in Bangladesh. They spoke against the attack on Osman Ali’s shop in Hazari Lane and the attack and acid-throwing on the joint forces. Hefazat speakers called ISKCON an \"anti-Hindu militant group\" at the rally. Quamrul Islam Quasemi, a Hefazat leader, said at the rally: \"Our clear view on ISKCON is that ISKCON is not a religious group. It is an international militant group. ISKCON is already banned in some countries. So, ISKCON is not a Sanatana religious group. It is a militant group created by Jews and Christians. ...\" Some people linked with Hefazat-e-Islam gave a strong warning. They said if the government does not ban ISKCON, they will make the ground of Bangladesh holy by killing ISKCON followers wherever they see them to clear the country of Hindus. == Reactions == Randhir Jaiswal, the spokesperson for the Indian Ministry of External Affairs, spoke against the attack on Hindus in Chittagong. He asked the temporary government to keep the Hindu community safe in the country. == References == === Citations === Category:2024 crimes Category:Riots Category:Bangladesh Category:Attacks on buildings and structures",
 "title": "Hazari Lane violence"
}