{
 "id": "1160880",
 "text": "Ottawa Nishnaabemwin, Daawaamwin Native to Canada, United States Region Ontario, Michigan, Oklahoma Ethnicity 60,000 OdawaOttawa dialect at Ethnologue (25th ed., 2022) Native speakers Total: 1,135 US: 965 (2009-2013 language survey)\"Detailed Languages Spoken at Home and Ability to Speak English\". www.census.gov. Retrieved 2017-11-17. Canada: 220 (2021 census)Government of Canada, Statistics Canada (2022-08-17). Language family Algic *Algonquian ** Ojibwe-Potawatomi *** Ojibwe **** Ottawa Language codes ISO 639-3 `otw` Glottolog `otta1242` ELP Ottawa Linguasphere `(Odawa) 62-ADA-dd (Odawa)` Places with Ottawa people in Ontario, Michigan and Oklahoma. Reserves/Reservations and communities are red. Ottawa is classified as Severely Endangered by the UNESCO Atlas of the World's Languages in Danger This article contains IPA phonetic symbols. Without proper rendering support, you may see question marks, boxes, or other symbols instead of Unicode characters. For an introductory guide on IPA symbols, see Help:IPA. Ottawa or Odawa is a dialect of the Ojibwe language spoken by the Odawa people in southern Ontario in Canada, and northern Michigan in the United States. The first recorded meeting of Ottawa speakers and Europeans occurred in 1615 when a party of Ottawas met explorer Samuel de Champlain on the north shore of Georgian Bay. Ottawa is written in Latin letters. The dialect is known to its speakers as \"speaking the native language\" or \"speaking Ottawa\". People who speak Ottawa are concerned that their language is endangered because the use of English increases and the number of speakers declines. == Usage == Most Ottawa speaking groups are in Ontario. Places in Ontario where Ottawa is spoken include Walpole Island near Detroit, and Wikwemikong on Manitoulin Island in Lake Huron.Significant publications include Bloomfield, Leonard, 1958; Piggott, Glyne, 1980; Rhodes, Richard, 1985; Valentine, J. Randolph, 1994; Valentine, J. Randolph, 2001 Places in Michigan where Ottawa is spoken are Peshawbestown, Harbor Springs, Grand Rapids, Mount Pleasant, Bay City, and Cross Village. Some children of Ottawas who moved to Kansas and Oklahoma speak Ottawa. Only three older people spoke Ottawa in Oklahoma in 2006.Rhodes, Richard and Evelyn Todd, 1981, p. 54, Fig. 2Rhodes, Richard, 1985, pp. x–xi One study said that there are about 8,000 speakers of Ottawa in the northern United States and southern Ontario.Gordon, Raymond, 2005. See online version of same: Ethnologue entry for Ottawa. Retrieved September 14, 2009 == See also == * Ojibwe language * Algonquian languages == References == == Further reading == * Cappel, Constance. 2007, The Smallpox Genocide of the Odawa Tribe at L'Arbre Croche, 1763: The History of a Native American People, Edwin Mellen Press. * Norris, Mary Jane. 1998. Canada's Aboriginal languages. Canadian Social Trends (Winter): 8–16 * Rhodes, Richard A. 1979. \"Some aspects of Ojibwa discourse.\" W. Cowan, ed., Papers of the 10th Algonquian Conference, pp. 102–117. Ottawa: Carleton University. ISBN 0-7709-0059-3 * Rhodes, Richard A. 1980. \"On the semantics of the instrumental finals in Ojibwa.\" W. Cowan, ed., Papers of the 11th Algonquian Conference, pp. 183–197. Ottawa: Carleton University. ISBN 0-7709-0076-3 * Rhodes, Richard A. 1981. \"On the Semantics of the Ojibwa Verbs of Breaking.\" W. Cowan, ed., Papers of the 12th Algonquian Conference, pp. 47–56. Ottawa: Carleton University. ISBN 0-7709-0116-6 * Rhodes, Richard A. 1982. \"Algonquian Trade Languages.\" W. Cowan, ed., Papers of the 13th Algonquian Conference, pp. 1–10. Ottawa: Carleton University. ISBN 0-7709-0123-9 * Rhodes, Richard A. 1983. \"Some Comments on Ojibwa Ethnobotany.\" W. Cowan, ed., Actes du 14e Congrès des Algonquinistes, pp. 307–320. Ottawa: Carleton University. ISBN 0-7709-0126-3 * Rhodes, Richard A. 1984. \"Baseball, Hotdogs, Apple Pie, and Chevrolets.\" W. Cowan, ed., Papers of the 15th Algonquian Conference, pp. 373–388. Ottawa: Carleton University. ISBN 0-7709-0165-4 * Rhodes, Richard A. 1985. \"Metaphor and Extension in Ojibwa.\" W. Cowan, ed., Papers of the 16th Algonquian Conference, pp. 161–169. Ottawa: Carleton University. ISSN 0831-5671 * Rhodes, Richard A. 1988. \"Ojibwa Politeness and Social Structure.\" W. Cowan, ed., Papers of the 19th Algonquian Conference, pp. 165–174. Ottawa: Carleton University. ISSN 0831-5671 * Rhodes, Richard A. 1991. \"On the Passive in Ojibwa.\" W. Cowan, ed., Papers of the 22nd Algonquian Conference, pp. 307–319. Ottawa: Carleton University. ISSN 0831-5671 * Rhodes, Richard A. 1998. \"The Syntax and Pragmatics of Ojibwe Mii.\" D. H. Pentland, ed., Papers of the 29th Algonquian Conference, pp. 286–294. Winnipeg: University of Manitoba. ISSN 0831-5671 * Rhodes, Richard. 2002. \"Multiple Assertions, Grammatical Constructions, Lexical Pragmatics, and the Eastern Ojibwe-Chippewa-Ottawa Dictionary.\" William Frawley, Kenneth C. Hill, & Pamela Munro, eds., Making Dictionaries: Preserving Indigenous Languages of the Americas, pp. 108–124. Berkeley: University of California Press. 108-124. ISBN 978-0-520-22996-9 * Rhodes, Richard A. 2004. \"Alexander Francis Chamberlain and the language of the Mississaga Indians of Skugog.\" H.C. Wolfart, ed., Papers of the 35th Algonquian Conference, pp. 363–372. Winnipeg: University of Manitoba. ISSN 0831-5671 * Rhodes, Richard. 2005. \"Directional pre-verbs in Ojibwe and the registration of path.\" H.C. Wolfart, ed., Papers of the Thirty-sixth Algonquian Conference, pp. 371–382. Winnipeg: University of Manitoba. 371-382. ISSN 0831-5671 * Toulouse, Isadore. 2008. Kidwenan: An Ojibwe language book. Third Edition. Southampton, ON: Ningwakwe Press. ISBN 978-1-896832-96-8 * Williams, Shirley I. 2002. Gdi-nweninaa: Our sound, our voice. Peterborough, ON: Neganigwane. ISBN 0-9731442-1-1 == Other websites == * * Anishnaabemdaa, made by the Little River Band of Ottawa Indians * The revitalization of the Nishnaabemwin (Ottawa) Language project at Trent University * Parts of the Book of Common Prayer in Ottawa * OLAC information about the Ottawa language * An online Nishnaabemwin (Ottawa) Dictionary Category:Language articles citing Ethnologue 25 Category:Endangered languages Category:Native Americans",
 "title": "Ottawa dialect"
}