{
 "id": "1160827",
 "text": "Pandacan is a district in Manila, Philippines, known in recent history for the Pandacan oil depot that supplies the majority of oil exports in the country. ==Etymology== Pandacan is a corrupted term derived from its older designation, Pandanan. The name is rooted in the word pandan (Pandanus amaryllifolius), referencing a tree that was once abundant in the area. ==Profile== In 2020, Pandacan was reported to have a total population of 84,769. The original residents of the district were Tagalog migrants from the nearby province of Bulacan. When the district grew and progressed as a manufacturing center for Manila, several ethnic groups from other parts of the country migrated into the district after the Second World War. The district is bounded to the north and northeast by the Pasig River, the Estero de Pandacan to the west and south and the district of Santa Ana to the southeast. Socio-economically, the majority of of Pandacan residents range from lower to middle class gainfully employed as blue-collar workers in the nearby factories and oil depots, with smatterings of upper middle class property owners. Pandacan was originally established as the industrial center for the city of Manila during the turn of the 20th century. Oil depots which service more than half of the fuel requirement of the country were established along the banks of the Pasig River in the district. ==Landmarks== ===Churches=== Four of the leading Christian religious dominations in the Philippines established their presence in the district. For Roman Catholics, there is the Santo Niño Parish along Jesus Street. The Iglesia ni Cristo and the United Methodist Church both have a church along Quirino Avenue, and the Philippine Independent Church has a church (Parish of Sto. Niño) at the corner of Central and Labores Streets. ===Romualdez House=== Former First Lady Imelda Romualdez Marcos claims Pandacan as her ancestral home in Manila. Since marrying former President Ferdinand Marcos in the 1960s, caretakers have been constantly maintaining her home. The house serves to validate Mrs. Marcos as a resident of Manila, despite her family's political bailiwick in the Leyte province of Visayas. ==References== *By Sword and Fire: The Destruction of Manila in World War II, 3 February-3 March 1945 by Alphonso J. Aluit (1994) Bookmark, Inc. © 1994 National Commission for Culture and the Arts Category:Settlements in Manila Category:Districts of Manila",
 "title": "Pandacan"
}