{
 "id": "1160296",
 "text": "Homixide Gang is an American hip-hop duo signed to Playboi Carti's Opium record label. The group consists of Homixide Beno! and Homixide Meechie, both known for their unique vocal styles, high-energy delivery, and dark, atmospheric production. Emerging as part of the underground Atlanta rap scene, Homixide Gang gained significant attention as protégés of Playboi Carti, contributing to the growing popularity of the Opium label and its distinct sound. == Background == Homixide Gang originates from Atlanta, Georgia, and is heavily influenced by the city's trap culture. The name \"Homixide\" comes from the Atlanta street gang they are apart of with the same name. They often use their music to portray their raw emotions and life stories, blending introspection with brash confidence. Their music often has disses to their rival gang or member of the gang known as Henxhmen. Both members were affiliated with Playboi Carti before officially signing to Opium Records, where they began receiving significant exposure within the underground rap community. == History == Homixide Gang officially joined Opium in 2021, becoming part of the label's roster alongside artists like Ken Carson and Destroy Lonely. Their sound —defined by distorted 808 drums, experimental beats, and ad-lib-heavy flows–– has drawn comparisons to Playboi Carti's Whole Lotta Red, while maintaining its own distinct identity. The duo gained attention with singles like \"5Ways\" and \"Knights,\" which showcase their aggressive yet melodic style. In December 2022, Homixide Gang released their debut project, \"Homixide Lifestyle\", featuring standout tracks like \"TF!\" and \"Uh Huh\". The album was praised for its cohesive sound and encapsulated the duo's high-energy, punk-inspired aesthetic. Critics and fans noted the project as a defining moment in the emerging Opium sound. The group often collaborates with other Opium artists and producers, creating a collective vibe that resonates with fans of the label's edgy, rebellious image. == Musical Style and Influences == Homixide Gang's music is characterised by its heavy bass lines, experimental production, and energetic flows. Their lyrical content often touches on themes of street life, loyalty, and the pursuit of success. Influenced by Atlanta's trap pioneers like Gucci Mane and Future, the duo also draws inspiration from Playboi Carti's avant-garde approach to hip-hop. Their music often blurs the line between trap and punk aesthetics, incorporating distorted beats and raw vocal performances. == Reception == Homixide Gang has garnered a loyal fanbase, often referred to as the \"Homixide Army,\" through their high-energy performances and social media presence. Their unapologetic style and alignment with Playboi Carti's Opium label have solidified their reputation within the underground scene and beyond. The duo has also been praised for their ability to balance individuality with the cohesive identity of the Opium collective. == Social Media and Online Presence == Homixide Gang maintains an active presence on social media, with Beno! and Meechie frequently engaging with fans through platforms like Instagram and X (formerly Twitter). They also connect with their audience through their official YouTube channel, where they share music videos and behind-the-scenes content. The group's dedicated subreddit, r/homixidegang, serves as a hub for fans to discuss their music and share updates. == Discography == === Albums === * Homixide Lifestyle (2022) * Snot or Not (2023) * 5TH AMNDMNT (2023) * i5u5we5 (2024) === EPs === * Snotty World (2021) === Singles === * \"SSN\" (2021) * \"'DAMN'\" (2021) * \"NoEvi\" (2022) * \"BBY GRL\" (2022) * \"Puttem On\" (2022) * \"Stuck in My Ways\" (2022) * \"ADHD (2023) * \"What It Is?!\" (with Pi'erre Bourne (2023) * \"HI-VOLTAGE\" (2024) * \"R50\" (2024) * \"Free Agents\" (2025) == Legacy == As rising stars of the Opium label, Homixide Gang represents the next generation of Atlanta's ever-evolving hip-hop scene. Their bold, uncompromising approach to music and their alignment with Playboi Carti's vision has positioned them as key figures in the underground movement. With their growing influence, the duo continues to push boundaries and redefine what it means to be part of Atlanta's trap culture. == Other websites == * Official Website * Homixide Gang on Spotify * Homixide Gang on Apple Music * Homixide Gang on YouTube * Instagram: Homixide Meechie and Homixide Beno * X: Homixide Meechie and Homixide Beno == Refrences == Category:Rap music groups Category:Rappers from Atlanta Category:Rappers from Georgia (U.S. state)",
 "title": "Homixide Gang"
}