{
 "id": "1160681",
 "text": "XXXXY syndrome, sometimes called Fraccaro syndrome, is a very rare genetic disorder. Normally, a male will have one X chromosome and one Y chromosome, but people with XXXXY syndrome will have three extra X chromosomes, or four in total. They have a total of 49 chromosomes instead of 46. This condition causes various physical and mental issues. It occurs in about 1 in every 85,000 to 100,000 males and was first diagnosed in 1960. == Symptoms == The symptoms of XXXXY syndrome often vary from person-to-person. The symptoms are often similar to Klinefelter syndrome and XXXY syndrome (other conditions where a male has extra X chromosomes), but are more severe. === Reproductive === People with XXXXY syndrome are infertile because they do not produce sperm. They usually have underdeveloped genitalia, such as a small penis. Their testes are usually undescended, meaning they are in the lower abdomen instead of outside the body in the scrotum. Puberty is often delayed or incomplete. It may also be absent. === Physical === People with XXXXY syndrome usually have problems with their skeleton. These problems include genu valgum (bent knees that touch each other), pes cavus (feet with high arch), clinodactyly (bent or curved finger, usually the fifth finger), and radioulnar synostosis (connection of the radius and ulna bones in the arm). Other physical symptoms that are common include hypotonia (low muscle weight), hypertelorism (widely spaced eyes), epicanthic folds (skin that covers the inner corner of the eyes), and dental issues. Issues with the hamstring muscles in the thigh and spinal conditions like scoliosis and kyphosis can increase with age. People with XXXXY syndrome are also usually shorter than average males, though height can increase in adolescence. Gynecomastia (larger breasts in males) and a lack of body hair can appear during adolescence. === Mental === The mental effects of XXXXY syndrome vary widely. People with the syndrome usually have issues with speech and behavioral issues. People with the syndrome are usually shy and friendly, but can be irritabile and aggressive behavior. People with the syndrome usually have a lower cognitive (mental) level than other people their age. Anxiety is also common and can start in preschool. Mild to moderate intellectual disability with learning disabilities are also common. The IQ in people with XXXXY syndrome ranges from 20 to 60. == Pathophysiology == Males are born with one X chromosome and one Y chromosome. People with XXXXY syndrome have four X chromosomes and one Y chromosome. They have 49 chromosomes in total instead of the usual 46. The condition is sometimes called a variant of Klinefelter syndrome (where a male only has one extra X chromosome), but is usually considered as a separate condition due to their differences. Although the condition is genetic, it is not hereditary. Mosaicism is common, especially 49,XXXXY/48,XXXX. This means the person with the condition has some cells that have four X chromosomes and one Y chromosome, while other cells only have four X chromosomes with no Y chromosome. == Diagnosis == XXXXY syndrome is diagnosed through karyotyping. This is when geneticists examine someone's chromosomes and makes a map of all the chromosomes they have. This test will show if someone has four X chromosomes instead of one. Some people may have karyotypes of their children done if they see issues like an abnormal face. == Treatment == Because XXXXY syndrome is genetic and affects someone's chromosomes, it cannot be cured. However, some of the symptoms can be treated. One 10-month old boy in Iran with the syndrome had patent ductus arteriosus (a condition affecting the heart) and had surgery to correct it. An adult with the syndrome used medical help to help solve infertility. Testosterone therapy can improve the cognitive skills like speech and motor skills in people with XXXXY syndrome. Males with XXXXY syndrome can benefit from having multiple doctors, such as physical therapists, neurologists, and geneticists. Early intervention can help improve mental issues. == References == Category:Genetic disorders",
 "title": "XXXXY syndrome"
}