{
 "id": "1160439",
 "text": "Earth's spin means how the Earth turns around its own middle line. This middle line is called an axis. Earth also moves differently in space as it spins. Earth spins to the east. If you look from the star called Polaris at the North Pole, Earth turns to the left, or counterclockwise. The North Pole is where Earth's axis touches the top side of Earth. People also call it the Geographic North Pole. It is different from the north magnetic pole. The South Pole is the place where the axis touches the bottom side of Earth, in a land called Antarctica. Earth spins one full time in about 24 hours when looking at the Sun. But compared to faraway stars, Earth spins in 23 hours, 56 minutes, and 4 seconds. Earth’s spinning is getting slower over time because the Moon pulls on Earth. Long ago, a day was shorter. Today’s day is about 1.7 milliseconds longer than 100 years ago. Scientists use special clocks to measure this and change time by adding leap seconds. Since the 8th century BCE, a day has grown longer by about 2.3 milliseconds every 100 years. In 2020, Earth started spinning faster after spinning slower for many years. On June 29, 2022, Earth finished one spin 1.59 milliseconds quicker than 24 hours. This was the fastest spin ever recorded. Because of this, experts are thinking about new ways to measure time, like using a negative leap second. The faster spinning could happen for different reasons. Earth’s soft, liquid core moves. The oceans and air also move. The Moon and other things in space pull on Earth. Ice at the North and South Poles is melting because of climate change. Ice melting makes Earth’s shape change. Earth is not a perfect ball; it is wider in the middle. When less ice pushes down at the poles, Earth becomes rounder, and the weight moves closer to the center. A rule called conservation of angular momentum says that when mass moves closer to the center, spinning becomes faster. == References == === Citations === Category:Earth Category:Earth sciences Category:Solar System Category:Solar System planets",
 "title": "Earth's spin"
}