{
 "id": "116057",
 "text": "The Big East Conference is a college sports conference in the United States which sponsors many sports, but does not play football. The league has its roots in the original Big East Conference, which was founded in 1979 as a basketball-focused league by a group of schools in the Eastern U.S. That league added football in 1991, leading to years of conflict between schools that played top-level football and those that did not. In July 2013, the original league split along football lines. The seven schools that did not play FBS (top-level) football—often called the \"Catholic 7\" because all are run by the Catholic Church—bought the \"Big East\" name and formed a new Big East. The FBS schools joined with several new members and stayed in the original Big East structure under the new name of American Athletic Conference (The American). Although the current Big East was not founded until 2013, it claims the 1979 founding date of the original Big East. Both the current Big East and The American claim the pre-split history of the old Big East. == Members == The 10 schools that formed the current Big East are private schools. All of these are also Catholic except for Butler, which was started by Protestants but has never been run by any church. UConn (Connecticut) became the Big East's first public school in July 2020. School Location Founded Type (affiliation) Nickname Joined Big East Butler University Indianapolis, Indiana 1855 Private (nonsectarian) Bulldogs 2013 Creighton University Omaha, Nebraska 1878 Private/Catholic (Jesuit) Bluejays 2013 DePaul University Chicago, Illinois 1898 Private/Catholic (Vincentian) Blue Demons 2005 Georgetown University Washington, D.C. 1789 Private/Catholic (Jesuit) Hoyas 1979 Marquette University Milwaukee, Wisconsin 1881 Private/Catholic (Jesuit) Golden Eagles 2005 Providence College Providence, Rhode Island 1917 Private/Catholic (Dominican) Friars 1979 Saint John'sSt. John's University New York City, New York 1870 Private/Catholic (Vincentian) Red Storm 1979 Seton Hall University South Orange, New Jersey 1856 Private/Catholic (Diocesan) Pirates 1979 (UConn) Storrs, Connecticut 1881 Public Huskies 1979, 2020 Villanova University Villanova, Pennsylvania 1842 Private/Catholic (Augustinian) Wildcats 1980 Xavier University Cincinnati, Ohio 1831 Private/Catholic (Jesuit) Musketeers 2013 ===Associate members=== The Big East has six \"associate members\" that play either one or two sports in the conference. School Location Founded Type (affiliation) Joined Sport Current main conference Nickname AkronUniversity of Akron Akron, Ohio 1870 Public 2023 Men's soccer MAC Zips DenverUniversity of Denver Denver, Colorado 1864 Private (nonsectarian) 2013 (men) 2016 (women) Men's and women's lacrosse The Summit Pioneers Liberty University Lynchburg, Virginia 1971 Private (nondenominational) 2016 Field hockey CUSA Lady Flames Old Dominion University Norfolk, Virginia 1930 Public 2013 Field hockey Sun Belt Monarchs Quinnipiac University Hamden, Connecticut 1929 Private (nonsectarian) 2016 Field hockey MAAC Bobcats Temple University Philadelphia, Pennsylvania 1884 Public/private hybrid 2013 Field hockey American Owls === Former members === No full member of the Big East has left for another conference. However, eight associate members have left the Big East in one or more sports, with five entirely leaving the Big East. Two schools that were associate members in the 2013–14 school year left to join conferences that play the sports that they housed in the Big East. Five women's lacrosse members left after the 2017–18 school year when the American Athletic Conference, full-time home to three of those schools, started a women's lacrosse league. Two of these schools, Temple and UConn, stayed in the Big East in field hockey, and UConn returned to the Big East full-time in July 2020. At the same time, Old Dominion moved its women's lacrosse team from the Big East to The American. This kept both conferences at six women's lacrosse members, the number needed to ensure that their conference champions would receive places in the NCAA Division I tournament. ODU is still a Big East member in field hockey. School Location Founded Type Joined Left Sport(s) Current main conference Current conference in former Big East sport(s) Nickname LouisvilleUniversity of Louisville Louisville, Kentucky 1798 Public 2013 2014 Field hockey, women's lacrosse ACC ACC Cardinals Rutgers University New Brunswick, New Jersey 1766 Public 2013 2014 Field hockey, men's & women's lacrosse Big Ten Big Ten Scarlet Knights CincinnatiUniversity of Cincinnati Cincinnati, Ohio 1819 Public 2013 2018 Women's lacrosse Big 12 American Bearcats FloridaUniversity of Florida Gainesville, Florida 1853 Public 2014 2018 Women's lacrosse SEC American Gators Temple University Philadelphia, Pennsylvania 1884 Public/private hybrid 2013 2018 Women's lacrosse American American Owls UConnUniversity of Connecticut (UConn) Storrs, Connecticut 1881 Public 2013 2018 Women's lacrosse Big East Big East Huskies Vanderbilt University Nashville, Tennessee 1873 Private (nonsectarian) 2014 2018 Women's lacrosse SEC American Commodores Old Dominion University Norfolk, Virginia 1930 Public 2018 2020 Women's lacrosse Sun Belt American Monarchs ==References== *",
 "title": "Big East Conference"
}