{
 "id": "1160131",
 "text": "== list == ===king=== Portrait Name Reign from Reign until Fa Ngum ພຣະເຈົ້າຟ້າງຸ້ມມະຫາຣາຊ 5 January 1353 1372 Samsenethai ສາມແສນໄທ (Oun Huan) ອຸ່ນເຮືອນ 1372 1416 Muang Sua, Lan Xang Aged 60 Lan Kham Deng ພະເຈົ້າລ້ານຄຳແດງ 1417 1428 Muang Sua, Lan Xang Aged 41 Phommathat ພະຍາພົມມະທັດ 1428 1429 Muang Sua, Lan Xang Yukhon (Meunsai) 1429 1430 Phadao, Lan Xang Khon Kham 1430 1432 Kokrua, Lan Xang Kham Tam Sa (Kham Teun, Khamtum) 1429(?); 1432 Pak Houei Luang, Lan Xang Lusai 1432 1433 Palace Gardens, Muang Sua, Lan Xang Khai Bua Ban 1433 1436 Kham Keut (Kham-Kert, Kham Keul) 1436 1438 Muang Sua, Lan Xang Nang Keo Phimpha ນາງແກ້ວພິມພາ 1438 Pha-Dieo, Muang Sua Aged 95 Interregnum (1438–1441, rule by Sena and members of Sangha)(Simms, 99; Manich, 71) Chakkaphat Phaen Phaeo (Sai Tia Kaphut or Xainyachakkaphat) 1441 1479 Souvanna Banlang 1479 1485 Xieng-Thong, Lan Xang Aged 30 La Sen Thai (La Sen Thai Puvanart) 1486 1495 Xieng-Thong, Lan Xang Aged 33 Somphou 1495 1500 Visoun (also Vixun or Visunarat) 1500 1520 Vientianne, Lan Xang Aged 55 Photisarath I (also Phothisarath, Phothisarat, or Potisarat)ພະເຈົ້າໂພທິສະລາດ 1520 8 August 1548 Xieng-Mai Nhotnakorn Palace, Vientiane, Lan Xang Aged 43 Setthathirath ເສດຖາທິຣາດ (also Xaysettha, Chaiyachettha, Chaiyaset or Jayajestha) ໄຊເສດຖາ 8 August 1548 1571 Muang Ong-Kan, Attapeu, Lan Xang Aged 37 Nokeo Koumane 1571 Vientianne, Lan Xang 1571 Sen Soulintha (also Saen Surintha or Sen Sourintha, born Chane Tian) 1572 1575 Voravongsa I 1575 1579 Keng Chane pass, Vientiane, Lan Xang Sen Soulintha (also Saen Surintha or Sen Sourintha, born Chane Tian) 1580 1582 Vientianne, Lan Xang Aged 71 Nakhon Noi 1582 1583 Interregnum (1583–1591) Nokeo Koumane 1591 1596 Aged 25 Voravongsa II (Thammikarath) 1596 1621 Oupagnouvarath 1621 1622 Aged 25 Photisarath II 1622 1627 Aged 75 Mon Keo (Mongkeo) 1627 1633 Tone Kham 1633 1637 Vichai 1637 1638 Souligna Vongsa (Sourinyavongsa) ສຸຣິຍະວົງສາທັມມິກຣາດ 1638 1694 Vientiane, Lan Xang Aged 76 Tian Thala 1694 1695 Nan Tharat 1695 1698 Vientiane, Lan Xang Setthathirath II ພຣະເຈົ້າໄຊອົງເວ້ (Sai Ong Hue; Ong Lo; Trieu Phuc) ໄຊອົງເວ້ 1698 1706 Kingkitsarat (Kitsarat) ເຈົ້າກິງກິດສະຣາດ 1706 1713 Setthathirath II ພຣະເຈົ້າໄຊອົງເວ້ (Sai Ong Hue; Ong Lo; Trieu Phuc) ໄຊອົງເວ້ 1707 1730 Royal Palace, Vientiane Aged 45 Ong Kham 1713 1723 Inthasom (Thao Ang) ເຈົ້າອິນທະໂສມ 1723 1749 Vietnamese invasion repelled (1749) Inthaphom (Intharavongsa) 1749 1749 Sotika Koumane ເຈົ້າໂຊຕິກະ 1749 1764 Ong Long ເຈົ້າອົງລອງ 1730 1767 Burmese invasion (1764/65, aided by Vientiane), Luang Prabang becomes Burmese vassal state, 1765–1771 Sotika Koumane ເຈົ້າໂຊຕິກະ 1764 1768/1771 Surinyavong II ເຈົ້າສຸລິຍະວົງສາທີ່ສອງ 1771 1779/1788 Ong Boun ອົງບຸນ (Siribunyasarn)(Ong Bun Setthathirath III) Phrachao Siribounyasan ພຣະເຈົ້າສິຣິບຸນຍະສາຣ 1767 1779 Interregnum (1778–1780). Phraya Supho appointed governor by Siamese, led by General Taksin. Vientiane falls and is sacked by the Siamese (1779) Luang Prabang becomes Siamese vassal state, 1779-1792 Luang Prabang is administered by Siamese appointed governors during detention of the Royal Family at Bangkok (1788-1792) Surinyavong II ເຈົ້າສຸລິຍະວົງສາທີ່ສອງ 1779 1788 Ong Boun ອົງບຸນ (Siribunyasarn)(Ong Bun Setthathirath III) Phrachao Siribounyasan ພຣະເຈົ້າສິຣິບຸນຍະສາຣ 1780 28 November 1781 Lanchang Nanthasen ພຣະເຈົ້ານັນທະເສນ 28 November 1781 January 1795 Anourouth ເຈົ້າອານຸຣຸດທະ 3 February 1792 1817 Intharavong ເຈົ້າອິນທະວົງສ໌ (Intharavong Setthathirath IV) 2 February 1795 7 February 1805 Vientiane Mantha Tourath ເຈົ້າມັນທາຕຸຣາດ 1817 1825 Anouvong ເຈົ້າອານຸວົງສ໌ (Anouvong or Anurath, Setthahirath V) 7 February 1805 19 December 1828 Luang Prabang is administered by Siamese officials (1825-1826) Mantha Tourath ເຈົ້າມັນທາຕຸຣາດ 1826 1836 Provinces of Luang Phrabang in rebellion against Siam (1835-1838) Soukha Seum ເຈົ້າສຸຂະເສີມ 1838 1850 Tiantharath ເຈົ້າຈັນທະຣາດ 23 September 1850 1 October 1868 The Pra Bang is returned to Luang Pra Bang by King Chulalongkorn of Thailand having been brought to Bangkok during the destruction of Vientiane in 1828. Until 1865, Thai King Chantharath ruled Luang PraBang, and relinquished the power to Laos King Oun Kham. Transition occurred during/after the French Auguste Parvie visits. Oun Kham ເຈົ້າອຸ່ນຄຳ 1 October 1868 15 December 1895 Kham Souk (Sakharine, Sackarindr) ພຣະບາທສົມເດັຈພຣະເຈົ້າມະຫາຊີວິຕສັກຣິນທຣ໌ 15 December 1895 25 March 1904 Sisavang Vong ພຣະບາທສົມເດັຈພຣະເຈົ້າມະຫາຊີວິຕສີສວ່າງວົງສ໌ 26 March 1904 1945 Sisavang Vong September 15, 1945 20 October 1945 Phetsarath Rattanavongsa October 20, 1945 23 April 1946 Sisavang Vong April 23, 1946 29 October 1959 Sisavang Vatthana October 30, 1959 2 December 1975 === Kingdom of Champasak (Bassac) (1713–1904) === The Kingdom of Champasak declared itself independent from the Kingdom of Vientiane in 1713. The Kingdom of Champasak comprised the area south of the Xe Bang River as far as Stung Treng together with the areas of the lower Mun and Xi rivers on the Khorat Plateau (now the Isaan area of modern Thailand). The Kingdom was annexed by Siam in 1829 following the Chao Anouvong Rebellion, and subsequent kings were confirmed in Bangkok. From 1893 French took administrative control over parts of the kingdom, in 1904 the kingdom was reduced to a provincial governorship but still included the political involvement of the Na Champasak royal family. From 1941 to 1945 Thailand exploited France's weakness during World War II to acquire Champasak and other Lao lands on the right bank of the Mekong. In 1946 Champasak was ceded back to France and Chao Boun Oum remitted all claims to an independent kingship in order to unify Laos. The Kingdom of Laos (1946–75) was then formed under the Luang Prabang line of kingship. ; Kings Name Portrait Reign from Reign until Relationship with predecessors Nokasad (Soysisamut Phutthangkun) 1713 1738 Khorat Plateau Aged 45 Grandson of Sourigna Vongsa Sayakumane (Pha Photi Chao) 1738 1791 Champa Nagapurisiri Aged 81 Son of Nokasat Fay Na (Vichaiyarat Khattiyawongsa) 1791 1811 Not of royal descent No Muong 1811 1811 Son of Sayakumane 1811 – 1813 Interregnum Manoi 1813 1820 Nephew of Sayakumane Nho 1820 1827 Son of Anouvong, King of Vientiane 1829–93 Siam annexes Champasak following the Chao Anouvong Rebellion and confirms subsequent kings Huy 1827 1841 Himlot, Champassak Aged 61–63 Great grandson of Nokasad Nark 1841 1851 Bangkok, Siam Aged 76 Brother of Huy Boua 1851 1853 Bangkok, Siam Son of No Muong and Cousin of Nark Interregnum (1853–1855) Prince Suriya, Uparaja, acted as Regent. He died at 1855. Kham Nai 1856 1858 Himlot, Champassak Aged 28 Son of Huy Interregnum (1858–63) Kham Souk 1863 28 July 1900 Bassac, Champassak Aged 62 Son of Huy and Brother of Kham Nai Ratsadanay (Nhouy) 28 July 1900 19 September 1904 Son of Kham Souk Boun Oum – – Son of Ratsadanay === Kingdom of Luang Prabang (1707–1893) & French Protectorate of Laos (1893–1947) === Name Portrait Reign from Reign until Kingkitsarat (Kitsarat) ເຈົ້າກິງກິດສະຣາດ 1706 1713 Ong Kham 1713 1723 Inthasom (Thao Ang) ເຈົ້າອິນທະໂສມ 1723 1749 Vietnamese invasion repelled (1749) Inthaphom (Intharavongsa) 1749 1749 Sotika Koumane ເຈົ້າໂຊຕິກະ 1749 1764 Burmese invasion (1764/65, aided by Vientiane), Luang Prabang becomes Burmese vassal state, 1765–1771 Sotika Koumane ເຈົ້າໂຊຕິກະ 1764 1768/1771 Surinyavong II ເຈົ້າສຸລິຍະວົງສາທີ່ສອງ 1771 1779/1788 Luang Prabang becomes Siamese vassal state, 1779-1792 Surinyavong II ເຈົ້າສຸລິຍະວົງສາທີ່ສອງ 1779 1788 Luang Prabang is administered by Siamese appointed governors during detention of the Royal Family at Bangkok (1788-1792) Anourouth ເຈົ້າອານຸຣຸດທະ 3 February 1792 1817 Mantha Tourath ເຈົ້າມັນທາຕຸຣາດ 1817 1825 Luang Prabang is administered by Siamese officials (1825-1826) Mantha Tourath ເຈົ້າມັນທາຕຸຣາດ 1826 1836 Provinces of Luang Phrabang in rebellion against Siam (1835-1838) Soukha Seum ເຈົ້າສຸຂະເສີມ 1838 1850 Tiantharath ເຈົ້າຈັນທະຣາດ 23 September 1850 1 October 1868 The Pra Bang is returned to Luang Pra Bang by King Chulalongkorn of Thailand having been brought to Bangkok during the destruction of Vientiane in 1828. Until 1865, Thai King Chantharath ruled Luang PraBang, and relinquished the power to Laos King Oun Kham. Transition occurred during/after the French Auguste Parvie visits. Oun Kham ເຈົ້າອຸ່ນຄຳ 1 October 1868 15 December 1895 Kham Souk (Sakharine, Sackarindr) ພຣະບາທສົມເດັຈພຣະເຈົ້າມະຫາຊີວິຕສັກຣິນທຣ໌ 15 December 1895 25 March 1904 Sisavang Vong ພຣະບາທສົມເດັຈພຣະເຈົ້າມະຫາຊີວິຕສີສວ່າງວົງສ໌ 26 March 1904 1945 Sisavang Vong September 15, 1945 20 October 1945 Phetsarath Rattanavongsa October 20, 1945 23 April 1946 Sisavang Vong April 23, 1946 29 October 1959 Sisavang Vatthana October 30, 1959 2 December 1975 === Principality of Xiang Khouang (Muang Phuan) (1707–1899) === The Muang of Xiang Khouang was a semi-autonomous region in Laos in what is now Xiang Khouang province. The Phuan (Pu’on) monarchy claims descent from Khun Borom and were part of the Lan Xang mandala. Geographic isolation and frequent warfare produced periods where the Phuan kings tried to assert more authority, but the region remained only a key vassalage for surrounding kingdoms. The region features prominently in the 18th and 19th century as valuable coalition piece for the rival kingdoms of Vientiane and Champasak. Xiang Khouang was a trade frontier, and also a frequent point of invasion, and so has more cultural influences from China and Vietnam. ; Kings Name Birth Reign from Reign until Death Relationship with predecessors Notes Kham Sanh 1651 1688 Kam Lan 1688 1700 Son of Kham Sanh Kham Sattha 1723 1751 Grandson of Kam Lan Tributary to Vietnam, Luang Prabang, and Vientiane) Ong Lo 1751 1779 Somphou 1779 1803 Noi (Southaka Souvanna Koumar) 1803 1831 1829 Nephew of Somphou Executed by Emperor Minh Mạng of Vietnam Xiang Khuoang annexed as Tran Ninh province in Vietnam (1832) Po 1848 1865 Son of Noi Vassal to Siam and Vietnam Ung 1866 1876 Haw pirates invade Xiang Khouang in 1874 Khanti 1876 1880 Son of Ung Vassal to Siam Kham Ngon 1880 1899 French protectorate ends autonomy === Kingdom of Laos (1947–1975) === Name Portrait Birth Death Succession right Sisavang Vong 23 April 1946 – 29 October 1959 14 July 1885 Luang Phrabang 29 October 1959 Luang Phrabang aged 74 Son of Zakarine Sisavang Vatthana 29 October 1959 – 2 December 1975 13 November 1907 Luang Phrabang 13 May 1978 Xam Neua aged 70 Son of Sisavang Vong ==References== Monarchs Lan Xang Lan Xang Monarchs Monarchs Category:Kingdom of Laos Category:1975 disestablishments in Laos",
 "title": "List of monarchs of Laos"
}