{
 "id": "1160460",
 "text": "==Etymology== The name Malate is derived from a corruption of the Tagalog word maalat (\"salty\"). The name likely referred to the brackish waters, where the river estuary (in today's Malate Estero) meets the bay. The Spanish historian Antonio de Morga wrote in his book, Sucesos de las Islas Filipinas (trans:Events in the Philippine Islands), published 1609, that \"Manila has two drives for recreation. One is by land, along the point called Nuestra Señora de Guia. It extends for about a legua along the shore and is very clean and level. Thence it passes through a native street and settlement, called Bagunbayan, to a chapel, much frequented by the devout, called Nuestra Señora de Guia, and continues for a goodly distance further to a monastery and mission-house of the Augustinians, called Mahalat.\" The Spaniards pronounced this later as \"Malate\". == History == During the Spanish colonial period, Malate was an open space with a small fishing village where the chief Tagáls settled after losing their fort, \"Maynila\" (now Intramuros), to the colonizers in 1571 — among them the ancient noble families of Raja Matanda and Raja Soliman. The Malate Church became its focal point of community activity, dedicated to Our Lady of Remedies. After the United States of America annexed the islands in 1898 as a consequence of the Spanish–American War, American urban planners envisioned Malate as the exclusive residential area for American families and old Spanish mestizo families. In 1901, with the chartering of the city of Manila, Malate became a district after the city's borders were extended outside Intramuros. At the end of the Second World War, many homes of the affluent were still standing. As such, the displaced wealthy families who evacuated their houses during wartime returned and re-built their private villas and kept the whole district exclusively residential until the onset of extensive commercialization in the 1970s. ==Education and scholarly activity== Education in Malate is mostly provided by private schools. Several educational institutions which are part of the University Belt extend towards Malate via Taft Avenue, such as the De La Salle University, the De La Salle – College of Saint Benilde, Philippine Christian University, Philippine Women's University, St. Paul University Manila and St. Scholastica's College Manila. Prominent secondary schools in Malate are the Jesus Reigns Christian Academy, Jose Abad Santos Memorial School and the Malate Catholic School. The Doña Aurora Quezon Elementary School is the only public school in the district. ==Gallery== File:Malate Church, Manila, Mar 2024.jpg|Malate Church File:Remedios_Circle,_Malate,_Manila.jpg|Remedios Circle File:Rajah Sulayman Monument, Malate, Manila.jpg|Rajah Sulayman Monument File:Rajah Sulayman Park (Malate, Manila; 02-06-2021).jpg|Plaza Rajah Sulayman File:De La Salle University, archway.JPG|De La Salle University, archway ==References== Category:Settlements in Manila Category:Districts of Manila",
 "title": "Malate, Manila"
}