{
 "id": "1160968",
 "text": "Harlind Libbrecht (26 October 1959 – 8 January 2025) was a Belgian musician and academic. He was co-founder and member of Kadril. He was an academic in the field of landscape architecture. ==Biography== ===Academic career=== Already from young ange he had a great interest in nature and landscape. He graduated at the Horticultural Institute Melle in 1981. He later studied Monuments and Landscape Conservation at the Artesis Plantijn University College of Antwerp and earned his Master' degree. In 1989 he became a landscape architecture teacher the University College Ghent in 1989 and was involved in landscape research on Chateau parks of Ypres Salient during World War I. From 2012 he was guest teacher at the Cracow University in Poland and of the Juana de Vega Foundation in A Coruña, Spain. He was a founding member of the Le Notre Institute for interdisciplinary landscape studies. He was co- author on multiple works. ===Music career=== On 29 December 29 1976, Libbrecht together with a group of high school students who knew each other from the youth and nature movement (currently the founded the music group Kadril. Within the group he was \"the musician with a moustache and a ponytail\". Libbrecht wrote song lyrics and played mandolin, dulcimer, slide guitar and sang. He made important contributions to the certain programme establishments of the band, including \"La Paloma Dorada\". Most memorable for him were according to his brother the international festivals and Nekka night at Sportpaleis Antwerpen where they were the central music group. ===Personal life and death=== Libbrecht was born on 26 October 1959 as the second child in a family of 4 children. He grew up in Kluisbergen and later lived in Ghent. Libbrecht was married and had children. In November 2018 he suffered a cerebral hemorrhage. Two years later Kadril made the song De Gouden Duif in honor to him. His health continued to deteriorate. He moved with his family to La Coruña in Spain, where he was cared for by his family for several years. Libbrecht died there in early January 2025, at the age of 66 years old. There will be a farewell ceremony in Belgium with his burial being in Spain. ==References== Category:Belgian musicians Category:Belgian academics Category:1959 births Category:2025 deaths Category:People from East Flanders Category:Place of death missing",
 "title": "Harlind Libbrecht"
}