{
 "id": "116084",
 "text": "Wenedyk (in English: Venedic) is a made-up language. Jan van Steenbergen, a linguist and translator from the Netherlands, made it in 2002. The idea behind it is this: what would have happened if the Polish language had developed from Latin instead of Old Slavic? Wenedyk is a possible answer to that question. It is a Romance language, so almost all words are family of words in French, Italian, Romanian, and so on. But they look very different and much more like Polish. The rules for spelling and pronunciation are completely based on Polish. Other parts of the language, like grammar and sentence structure, are a mixture of Polish and Romance. Together with other made-up languages like Brithenig (which does the same thing with Welsh), Wenedyk is part of the group of so-called \"alternative languages\", languages that could have existed if history had been different. With Brithenig, it is the best known example of this sort of languages. Wenedyk became known in Poland after it was written about on the Internet and in the monthly paper Wiedza i Życie (\"Knowledge and Life\"). Wenedyk is used in Ill Bethisad, a made-up world in which the Roman Empire was stronger than in real history. It is the most important language of the Republic of the Two Crowns, a country similar to the Polish-Lithuanian Commonwealth, but not broken up by partitions like Poland was. == Spelling and pronunciation == Wenedyk uses the same letters as Polish does: :A Ą B C Ć D E Ę F G H I J K L Ł M N Ń O Ó P R S Ś T U W Y Z Ź Ż Also, there are seven sounds written by two letters: :Ch Cz Dz Dź Dż Rz Sz Wenedyk is pronounced just like Polish. Stress almost always falls on the second-last syllable. A preposition and a pronoun are treated as one word, so when the pronoun has only one syllable, the preposition is stressed. == Grammar == Wenedyk does not have articles, words like \"a\" and \"the\". This is an important difference with the other Romance languages and also with made-up languages like Esperanto and Ido. The reason is that Polish and most other Slavic languages do not have those words, and even in Vulgar Latin they were not so strong yet. Words in Wenedyk can have many forms. English words have only a few (cat, cat's, cats; work, working, works, worked), but in Wenedyk a lot of forms exist where English would have used other words, like prepositions or modal verbs. In the case of nouns, pronouns and adjectives these forms are called \"cases\". Wenedyk has three cases: * the direct case: used for both the subject and the direct object of a sentence. In the sentence: Miej poterz leże libier \"My father reads a book\", Miej poterz \"my father\" and libier \"a book\" are both in the direct case. * the genitive: used when English uses 's or of, for example: siedź potrze \"my father's chair\", rzejna Anglie \"the queen of England\". * the dative: used when English uses (or can use) to, for example: Da mi ił libier \"Give me that book\", Da mi łu \"Give it to me\". Wenedyk also has a vocative (used for calling someone). Often it has the same form as the direct case, but not always: O potrze! \"Oh father!\" There are three genders and four declensions (different ways of making forms). They are very much like the declensions in Latin: * the first declension are all words on -a, almost all of them are feminine; * the second declension are mostly masculine and neuter words ending with a consonant. It is a mixture of the second and fourth declension in Latin; * the third declension are mostly feminine words ending with a soft consonant; * the fourth declension are words on -ej, it matches the Latin fifth declension. Here is a chart of the pronouns (words like I, you, we, they, and so on) in Wenedyk: Pronouns singular (one) plural (more than one) first second third first second third men women things men women things English I me mine to me thou (old), you (modern) thee, you thine, yours to thee, to you he him his to him she her hers to her it it its to it we us ours to us you you yours to you they them theirs to them Wenedyk jo mie miej mi ty cie ciej ci ił łu łu li ła łą lej lej łu łu łu li nu nosz nosz nów wu wosz wosz wów li łosz łór lew le łasz łar lew le le łór lew Verbs have a lot of forms, too. Every pronoun has its own form: :jemu – I love :jemasz – you love :jema – he/she loves :jemamy – we love :jemacie – you love :jemą – they love Most tenses have special forms: :jemar – to love :jemu – I love, I am loving :jemawa – I loved :jemie – I have loved :joru jemar – I will love, I will be loving :jemaru – I will have loved :jemarsi – I would love, I would have loved :jem – love! :jemęć – loving :jematy – beloved == Word list == The word list of Wenedyk, made public on the internet, has more than 4000 words. This chart of 30 words shows what Wenedyk looks like when compared to other Romance languages: Ten Romance languages compared English Latin Portuguese Spanish French Italian Rhaeto-Romance Romanian Brithenig Wenedyk arm brachium braço brazo bras braccio bratsch braţ breich brocz black nĭger negro negro noir nero nair negru nîr niegry city, town cīvĭtas cidade ciudad cité città citad oraş ciwdad czytać death mŏrs morte muerte mort morte mort moarte morth mroć dog canis cão perro chien cane chaun cîine can kań ear auris orelha oreja oreille orecchio ureglia ureche origl urzykła egg ovum ovo huevo œuf uovo ov ou ew ów eye ŏcŭlus olho ojo œil occhio egl ochi ogl okieł father pater pai padre père padre bab tată padr poterz fire ignis, fŏcus fogo fuego feu fuoco fieu foc ffog fok fish pĭscis peixe pez, pescado poisson pesce pesch peşte pisc pieszcz foot pĕs pé pie pied piede pe picior pedd piedź friend amīcus amigo amigo ami amico ami prieten, amic efig omik green vĭrĭdis verde verde vert verde verd verde gwirdd wierdzi horse ĕquus, cabăllus cavalo caballo cheval cavallo chaval cal cafall kawał I ĕgo eu yo je io jau eu eo jo island īnsŭla ilha isla île isola insla insulă ysl izła language, tongue lĭngua língua lengua langue lingua linguatg, lieunga limbă llinghedig, llingw lęgwa life vīta vida vida vie vita vita viaţă gwid wita milk lac leite leche lait latte latg lapte llaeth łoc name nōmen nome nombre nom nome num nume nôn numię night nŏx noite noche nuit notte notg noapte noeth noc old vĕtus velho viejo vieux vecchio vegl vechi gwegl wiekły school schŏla escola escuela école scuola scola şcoală yscol szkoła sky caelum céu cielo ciel cielo tschiel cer cel czał star stēlla estrela estrella étoile stella staila stea ystuil ścioła tooth dĕns dente diente dent dente dent dinte dent dzięć voice vōx voz voz voix voce vusch voce gwg wucz water aqua água agua eau acqua aua apă ag jekwa wind vĕntus vento viento vent vento vent vînt gwent więt == Sample == The Lord's Prayer: :Potrze nostry, kwały jesz en czałór, sąciewkaty si twej numię. :Owień twej rzeń. :Foca si twa włątać, komód en czału szyk i sur cierze. :Da nów odzej nostry pań kocidzany. :I dziemieć nów nostrze dziewta, komód i nu dziemiećmy swór dziewtorzór. :I nie endycz nosz en ciętaceń, uta liwra nosz dzie mału. :Nąk twie są rzeń i pociestać i głurza, o siąprz. Amen. == References == *Dorota Gut: Now@ Mow@ (\"New Language\"), Wiedza i Życie, February 2004. *Tilman Berger: Vom Erfinden Slavischer Sprachen . *Ziemowit Szczerek: Świat, gdzie Polska nie jest Polską , Interia.pl, 26 September 2008. == Other websites == *Wenedyk *The Republic of the Two Crowns *Romance glossary (a list of common words in all Romance languages, also Wenedyk and Brithenig) Category:Constructed languages",
 "title": "Wenedyk"
}