{
 "id": "1160383",
 "text": "The voiceless upper-pharyngeal plosive or stop is a rare consonant. Pharyngeal consonants are usually pronounced at two parts of the pharynx, upper and lower. The lower part is epiglottal, so the upper part is usually shortened to just 'pharyngeal'. In languages around the world, the upper pharynx makes a voiceless fricative and a voiced sound that can be a fricative or (more commonly) approximant, . The epiglottal part makes the plosive and also sounds like the fricative and trill . Because the fricative and trill are usually trilled and rarely just fricative, these consonants are simply called pharyngeal, and are labelled as plosive, fricative/approximant and trill.John Esling (2010) 'Phonetic Notation', in Hardcastle, Laver & Gibbon (eds) The Handbook of Phonetic Sciences, 2nd ed., p. 695. == Examples == No language is known to have a phonemic upper pharyngeal plosive. Some say the Nǁng language (Nǀuu) has an upper pharyngeal place of articulation in its click consonants— clicks in Nǁng have a closing in the back that is said to sometimes be uvular and sometimes be upper pharyngeal, depending on the click type.Miller, Amanda L., Johanna Brugman, Bonny Sands, Levi Namaseb, Mats Exter, and Chris Collins. 2009a. 'Differences in airstream and posterior place of articulation among Nǀuu clicks.' Journal of the International Phonetic Association 39(2): 132. However, if the place was actually pharyngeal, they could not also exist as nasal clicks, which they do. Besides that, upper pharyngeal plosives are only known from disordered speech. They can be found in the speech of some children with cleft palate, so they can back their stops so they don't have to nasalise them. The extIPA has the letter (a small-capital ) for this sound.Duckworth et al. (1990) Extensions to the International Phonetic Alphabet for the transcription of atypical speech. Clinical Linguistics & Phonetics 4: 4 p. 275 == Related pages == * Voiced upper-pharyngeal plosive == References == Category:Consonants",
 "title": "Voiceless upper-pharyngeal plosive"
}