{
 "id": "1160910",
 "text": "Indian philosophy includes the different thinking traditions from the Indian subcontinent. These philosophies are often called darśana, meaning \"to see\" or \"looking at.\" Another term, ānvīkṣikī, means \"critical inquiry\" or \"investigation.\" Ancient Indian thinkers like Chanakya used ānvīkṣikī to describe Indian philosophies. There are two main groups of Indian philosophies: # Āstika: These schools accept the Vedas (ancient texts) as a source of knowledge. # Nāstika: These schools do not accept the Vedas. The āstika group believes in: * Vedas as a valid source of knowledge. * Concepts of Brahman (universal soul) and Atman (individual soul). * The existence of an afterlife and gods (Devas). The main āstika schools are: * Nyaya * Vaisheshika * Samkhya * Yoga * Mīmāṃsā * Vedanta The nāstika group does not follow the Vedas. Major nāstika schools include: * Jain * Buddhist * Ajivika * Ajñana * Charvaka These philosophies were mainly developed between 500 BCE and the later centuries of the Common Era. Some schools like Jainism, Buddhism, Yoga, Śaiva, and Vedanta survived, while others like Ajñana, Charvaka, and Ājīvika did not. Ancient Indian philosophical texts discuss many topics, including: * Ontology (study of being and existence) * Epistemology (study of knowledge) * Axiology (study of values) == Hindu traditions == The Upanishads, written between 1000 and 500 BCE, are some of the oldest Indian philosophical texts. They keep the ideas of Brahmanism alive. Indian philosophies are often grouped by their connection to the Vedas, which are ancient texts. Jainism is a bit of a mystery. Scholars can't agree on its origins. Some think it started before the Vedic period, others believe it developed at the same time as the Vedic civilization or even after it. One of its early figures, Parshvanatha, lived in the 9th century BCE. Buddhism began at the end of the Vedic period. Many traditions that are now part of Hinduism came about after the Vedic period. Indian philosophies are classified into two main groups based on their view of the Vedas: # Orthodox (Āstika): These accept the authority of the Vedas. # Heterodox (Nāstika): These do not accept the authority of the Vedas. Nāstika schools include Buddhism, Jainism, Ajivika, and Charvaka. The terms \"orthodox\" and \"heterodox\" are later scholarly terms, and not everyone agrees on what they mean. Some people think orthodox means believing in gods, and heterodox means not believing in gods. Other sources say certain systems, like Shaiva tantra, are heterodox because they differ from the Vedas. The six main orthodox schools of Hindu philosophy are: # Sāṃkhya: Believes in two realities - Puruṣa (consciousness) and Prakṛti (matter). # Yoga: Similar to Sāṃkhya, but includes belief in a personal god and focuses on yogic practices. # Nyāya: Focuses on logic and knowledge. It has four valid ways of knowing: perception, inference, comparison, and testimony. # Vaiśeṣika: Related to Nyāya, it focuses on the metaphysics of substance and believes in atoms. It accepts perception and inference as valid ways of knowing. # Pūrva-Mīmāṃsā: Focuses on interpreting the Vedas and Vedic rituals. # Vedānta: Interprets the philosophy of the Upanishads, especially ideas about the soul (Atman) and the universe (Brahman). These six schools are sometimes grouped into three pairs: Nyāya- Vaiśeṣika, Sāṃkhya-Yoga, and Mīmāṃsā-Vedānta. Each school also has different sub-schools. For example, Vedānta has sub-schools like: * Advaita (non- dualism) * Visishtadvaita (qualified non-dualism) * Dvaita (dualism) * Dvaitadvaita (dualistic non-dualism) * Suddhadvaita (pure non-dualism) * Achintya Bheda Abheda (inconceivable oneness and difference) Different schools interpreted the Vedas and Upanishads differently, but they all shared a common foundation. There are other Hindu philosophical systems too, like: * Paśupata: A Shaivism school founded by Nakulisa. * Shaiva Siddhanta: A theistic and dualistic Shaivism school. * Pratyabhijña: Part of Kashmir Shaivism, it supports idealistic monism. * Pāṇini Darśana: Focuses on Sanskrit linguistics and grammar. * Raseśvara: An alchemical school that uses mercury for enlightenment. ==References== Category:Philosophy",
 "title": "Indian philosophy"
}