{
 "id": "1160083",
 "text": "Paco, formerly known as Dilao, is a district of Manila, Philippines, located south of the Pasig River and San Miguel, west of Santa Ana, southwest of Pandacan, north of Malate, northwest of San Andres Bukid, and east of Ermita. ==Origin== Paco was known as Dilao because of the Amaryllis plants that were once plentiful in this district. Dilao or dilaw is a Tagalog word for the color yellow. Although, some sources say, it was named Dilao or \"Yellow Plaza\" by the Spanish settlers because of the Japanese migrants who lived there, describing their physiognomy. Spanish Franciscan missionaries founded the town of Paco as early as 1580. Until 1901, it was a town of the province of Tondo (later renamed Manila in 1859). The name \"Dilao\" was used for the town until 1791, when the name was extended to San Fernando de Dilao, honoring Ferdinand III of Castile. It was again renamed in the 19th century to San Francisco de Dilao, after the Franciscan missionaries who founded the parish there; which came to be nicknamed as Paco de Dilao, a dimunitive of \"Francisco\". Finally, the parish and locality became simply known as Paco, as it is today. The parish church itself retains its ancient name of San Fernando de Dilao Church. ==Modern History== Paco was incorporated in 1901 as a district of the newly chartered city of Manila. Onwards, from 1907 until 1949, Paco became part of the 2nd congressional district of Manila. Reapportionment of districts after the Second World War made Paco part of the 4th district from 1949 to 1972. The rechartered 1987 Philippine Constitution caused to Paco to split into the 5th and 6th congressional districts of the city, with the former covering the southern half and the latter covering the northern areas. According to the 2020 census, the entirety of Paco has a combined population of 79,839 people. ==Landmarks== File:San_Fernando_de_Dilao_Church,_Paco_historical_marker_(English)_(cropped).jpg|Paco Church historical marker File:PacoDilaoChurchjf0094_01.JPG|Paco Parish Church File:05663jfSaint Pius X Parish Church Parochial School Onyx Paco Manilafvf 10.jpg|Paco Catholic School File:Paco_Public_Market_façade.jpg|Paco Public Market File:WTMP A-trio a19 1.JPG|Façade of the Paco railway station File:Pius_XII_Catholic_Center,_Paco,_Manila_(entrance).jpg|Pius XII Catholic Center File:09324jfErmita_Paco_Manila_Buildings_Avenues_Bridges_Landmarksfvf_15.jpg|Paco Sikh Temple File:View_from_the_pathway_at_Paco_Park.JPG|Paco Park and Spanish colonial period cemetery ==References== Category:Settlements in Manila Category:Districts of Manila",
 "title": "Paco, Manila"
}