{
 "id": "1160300",
 "text": "From February 26 to March 9, 2025, members of the Liberal Party of Canada voted on a replacement for Justin Trudeau after he announced his plans to resign as the party leader and Prime Minister of Canada. Mark Carney, the former governor of the Bank of Canada, won the election with over 85% of the vote as well as a majority in all 343 ridings. This margin of victory passed Justin Trudeau's 2013 leadership victory margin in vote share, points, and ridings. Carney was sworn in as prime minister on March 14, the first prime minister in Canadian history to not have previously held elected office. Carney later called a snap federal election on March 23, where he ran and won in Nepean. ==Candidates== ===Approved=== Candidate Experience Candidacy Policies Campaign Ref. Frank Baylis MP for Pierrefonds—Dollard(2015–2019) : Announced: January 6, 2025 : Approved: January 23, 2025 : Campaign slogan: Prosperity for all Canadians : Campaign slogan (French): La Prospérité pour tous les Canadiens * Limit senators to one 10-year term and MPs to 10-year terms with a \"prolonged period\" in-between. * Create a second House of Commons chamber for debate. * Redistribute power to MPs instead of party leaders. * Invest in Canadian universities, businesses, and incubators. * Decrease government debt. * Recognize Palestine and invest in rebuilding in Gaza. * Establish two west–east pipelines to transport Albertan natural gas to Europe and Asia. * Invest in Canada's electrical power transmission grid, the Small Modular Reactor Action Plan, and research and development for renewable energy. * Work with provinces to modernize healthcare using artificial intelligence. * Spend 2% of GDP on defence (the NATO target), by investing in research, growing military through increasing troop wages and benefits, and increasing number of peacekeepers. * Supports a CANZUK economic bloc. * Refuse to offer Trump concessions for tariffs. * Invest in large projects like social housing, rail projects, and expanded public transit to create jobs. * Tie number of new immigrants to housing availability. * Incentivize local governments to achieve housing development targets. * Modify National Building Code to streamline approvals of modular homes. * Eliminate the budget deficit by increasing productivity. * Increase amount allowed in First Home Savings Accounts. * Scrap capital gains tax increase. EndorsementsWebsite Mark Carney Governor of the Bank of Canada(2008–2013)Governor of the Bank of England(2013–2020) : Announced: January 16, 2025 : Approved: January 22, 2025 : Campaign slogan: It's Time to Build. : Campaign slogan (French): Bâtissons l'avenir. * Replace consumer carbon tax with an incentive program to reward green choices, while keeping tax on large industrial emitters. * Introduce a \"carbon border-adjustment\" to penalize high-polluting foreign imports. * Spend 2% of GDP on defence (the NATO target) by 2030, by investing in Canadian-made defence equipment and strengthening Canada's Arctic presence through dual-use infrastructure (e.g. deepwater ports, runways). * Scrap capital gains tax increase and cut taxes for middle class. * Cut red tape on building projects and interprovincial trade. * Supports \"the concept\" of a west–east oil pipeline. * Run a small deficit to invest in Canada's economy, while balancing operational spending (e.g. government programs, federal transfers, debt service charges) over three years. * Impose dollar-for-dollar retaliatory tariffs on the U.S. * Expand Canada's energy infrastructure to be less dependent on foreign suppliers. * Double the pace of new housing construction over a decade. * Scrap GST on new homes worth up to $1 million for first-time buyers. * Cap immigration until it returns to pre-pandemic trends. * Create two new Arctic military bases. EndorsementsWebsite Chrystia Freeland Deputy Prime Minister of Canada(2019–2024)Minister of Finance(2020–2024)Minister of Intergovernmental Affairs(2017–2020)Minister of Foreign Affairs(2017–2019)Minister of International Trade(2015–2017)MP for University—Rosedale(2015–present)MP for Toronto Centre (2013–2015) : Announced: January 17, 2025 : Approved: January 22, 2025 : Campaign slogan: Fight for Canada : Campaign slogan (French): Défendre le Canada * Replace carbon tax with a system collaboratively developed with the provinces and territories. * Scrap capital gains tax increase. * Implement automatic leadership reviews at permanent biennial conventions. * Spend 2% of GDP on defence (the NATO target) by 2027, in part by enlarging military and increasing troop wages by 50%. * Cut second income tax bracket rate from 20.5% to 19%. * Cap profit margins on essential goods and make shrinkflation illegal. * Scrap GST on new homes worth up to $1.5 million for first-time buyers. * Cap credit card interest rates at 15%, working toward 10%. * Build 100,000 more $10-a-day childcare spots by requiring new or renovated federal offices to include daycare. * Cap Cabinet at 20 ministers. * If Trump tariffs happen, offer Canadian doctors in the U.S. $200,000 and nurses $100,000 to return to Canada. * Scrap trade barriers on agriculture, transportation and alcohol. * Enhance tax incentives for critical minerals workers. * Tie number of new immigrants to housing availability. * Bring back rent-to-own programs. * Give renters credit for on-time rent payments. * Build more modular housing factories and affordable housing. * Eliminate the Research and Analysis Division of the Canada Revenue Agency. * Impose dollar-for-dollar retaliatory tariffs on the U.S., and 100% tariffs on Teslas. * Export liquefied natural gas to Canada's allies. * Ask Mark Carney to serve as finance minister. EndorsementsWebsite Karina Gould Leader of the Government in the House of Commons(2023–2025) Minister of Families, Children and Social Development(2021–2023)Minister of International Development(2019–2021)Minister of Democratic Institutions(2017–2019)MP for Burlington(2015–present) : Announced: January 18, 2025 : Approved: January 23, 2025 : Campaign slogan: Meet the Moment : Campaign slogan (French): Rencontrez le moment * Cancel April carbon tax increase and create a viable alternative. * Scrap capital gains tax increase. * Permanently remove GST for children's clothing, diapers, strollers, and car seats. * Reduce GST to 4% for one year. * Increase corporate tax rate from 15% to 17% on companies that make over $500 million profits per year. * Offer a $2,000 tax credit on the provincial land transfer tax and interest-free loans worth up to 50% of the home's purchase price to first-time homebuyers. * Spend 2% of GDP on defence (the NATO target) by 2027, by increasing troop wages and improving procurement. * Widen eligibility for employment insurance, \"modernize\" EI, and bolster supports for seniors and disabled people. * Introduce a universal basic income program. * Exempt supply management from future trade negotiations. * Bolster Competition Bureau's powers to better investigate price gouging and overpricing. * Expand cooperative housing and accelerate modular housing construction. * Supports a citizens' assembly on electoral reform, but wants a referendum on any plan. EndorsementsWebsite === Declined === * Anita Anand, Minister of Transport and Internal Trade (2024–present), MP for Oakville (2019–present) * François- Philippe Champagne, Minister of Innovation, Science and Industry (2021–present), MP for Saint-Maurice—Champlain (2015–present) *Christy Clark, Premier of British Columbia (2011–2017), Deputy Premier of British Columbia (2001–2004) * Sean Fraser, Minister of Housing, Infrastructure and Communities (2023–2024), MP for Central Nova (2015–present) * Mélanie Joly, Minister of Foreign Affairs (2021–present), MP for Ahuntsic-Cartierville (2015–present) *Dominic LeBlanc, Minister of Finance (2024–present), Minister of Intergovernmental Affairs (2020–present), MP for Beauséjour (2000–present) * Steven MacKinnon, Minister of Employment, Workforce Development and Labour (2024–present), MP for Gatineau (2015–present) *Marc Miller, Minister of Immigration, Refugees and Citizenship (2023–present), MP for Ville-Marie–Le Sud-Ouest–Île-des-Sœurs (2015–present) * Jonathan Wilkinson, Minister of Energy and Natural Resources (2021–present), MP for North Vancouver (2015–present) ==References== Category:2025 elections in North America Category:2025 in Canada",
 "title": "2025 Liberal Party of Canada leadership election"
}