{
 "id": "116182",
 "text": "Sir Ronald Aylmer Fisher FRS (17 February 1890 – 29 July 1962) was an English statistician, evolutionary biologist, and geneticist. He was described as \"a genius who almost single-handedly created the foundations for modern statistical science\". Richard Dawkins described him as \"the greatest of Darwin's successors\". == Professional years == In 1915, he invented the infinitesimal model. This is also known as the polygenic model. It is named this because it says traits are influenced by many genes. He defined the term \"variance\" for the first time in his paper, published in 1918. In 1919 Fisher started work at Rothamsted Experimental Station at Harpenden, Hertfordshire. Here he started a major study of the extensive collections of data recorded over many years. This resulted in a series of reports under the general title Studies in crop variation. This began a period of great productivity. Over the next seven years, he pioneered the principles of the design of experiments and elaborated his studies of the analysis of variance. He studied the statistics of small samples. Perhaps even more important, he began his systematic approach of the analysis of real data as the springboard for the development of new statistical methods. He began to pay particular attention to the labour involved in the necessary computations, and developed practical methods. In 1925, his first book was published: Statistical methods for research workers.Box, Joan Fisher 1978. R.A. Fisher: The life of a scientist. New York: Wiley. pp93–166 This went into many editions and translations in later years, and became a standard reference work for scientists in many disciplines. In 1935, this was followed by The design of experiments, which also became a standard. His work on the theory of population genetics made him one of the three great figures of that field, together with Sewall Wright and J.B.S. Haldane. He was one of the founders of the neo-Darwinian modern evolutionary synthesis. In addition to founding modern quantitative genetics with his 1918 paper, he was the first to use diffusion equations to attempt to calculate the distribution of gene frequencies among populations. He pioneered the estimation of genetic linkage and gene frequencies by maximum likelihood methods. His 1950 paper on gene frequency clines is notable as the first application of a computer to biology.Gene frequencies in a cline determined by selection and diffusion, R.A. Fisher 1950. Biometrica 6, 353–361 Fisher had a long and successful collaboration with E.B. Ford in the field of ecological genetics. The outcome of this work was the recognition that the force of natural selection was often much stronger than had been appreciated. Many ecogenetic situations (such as polymorphism) were not selectively neutral, on the contrary, they were maintained by the force of selection. Fisher was the original author of the idea of heterozygote advantage, which was later found to play a frequent role in genetic polymorphism.Fisher R. 1930. The genetical theory of natural selection. The discovery of indisputable cases of natural selection in nature was one of the main strands in the modern evolutionary synthesis. === Fisher's genetical theory and eugenics === Fisher was an ardent promoter of eugenics, and he held the Chair in Eugenics at University College London from 1933 until he moved to Cambridge University as Professor of Genetics in 1943. Between 1929 and 1934 the Eugenics Society campaigned hard for a law permitting sterilisation on eugenic grounds. They believed that it should be entirely voluntary, and a right, not a punishment. They published a draft of a proposed bill, and it was submitted to Parliament. Although it was defeated by a 2:1 ratio, this was viewed as progress, and the campaign continued. Fisher played a major role in this movement, and served in several official committees to promote it.Fisher was a member of the UK Government Committee on Mental Deficiency. Kevles D.J. 1985. In the name of eugenics: genetics and the uses of human heredity. Harvard. note on p344.Report of the Committee on Mental Deficiency, being a Joint Committee of the Board of Education and the Board of Control. 3 vols. 1929, HMSO, London; also Report of the Departmental Committee on Sterilisation 1934. In 1934, Fisher moved to increase the power of scientists within the Eugenics Society, but was ultimately thwarted by members with an environmentalist point of view, and he, along with many other scientists, resigned. == Fisher's books == Fisher wrote three books of great significance. === The Genetical Theory of Natural Selection === His book The Genetical Theory of Natural Selection was started in 1928 and published in 1930, with a second edition in 1950. He developed ideas on sexual selection, mimicry and the evolution of dominance. He showed that the probability of a mutation increasing the fitness of an organism decreases proportionately with the magnitude of the mutation. He also proved that larger populations carry more variation and have a larger chance of survival. He set forth the foundations of what was to become known as population genetics. About a third of the book concerned the applications of these ideas to humans, and presented the data available at that time. He presented a theory that attributed the decline and fall of civilizations to the fertility of the upper classes being low. Using the census data of 1911 for Britain, he showed that there was an inverse relationship between fertility and social class. This was partly due, he believed, to the rise in social status of families who were not capable of producing many children but who rose because of the financial advantage of having a small number of children. Therefore he proposed the abolishment of the economic advantage of small families by instituting subsidies (he called them allowances) to families with larger numbers of children, with the allowances proportional to the earnings of the father. He himself had two sons and six daughters. According to Yates and Mather, \"His large family, reared in conditions of great financial stringency, was a personal expression of his genetic and evolutionary convictions\". The book was reviewed, among others, by physicist Charles Galton Darwin, a grandson of Charles Darwin's. After his review, C.G. Darwin sent Fisher his copy of the book, with notes in the margin. The marginal notes became the food for an exchange of letters running at least three years.Fisher R.A. 1999. The genetical theory of natural selection. Complete variorum edition. Oxford University Press. Appendix 2. Fisher's book also had a major influence on W.D. Hamilton and the development of his theories on the genetic basis for kin selection. === Statistical Methods for Research Workers === Statistical Methods for Research Workers () is a classic 1925 book on statistics by Fisher. It is one of the 20th century's most influential books on statistical methods. According to Conniffe,Conniffe, Denis 1991. R.A. Fisher and the development of statistics—a view in his centenary year. Journal of the Statistical and Social Inquiry Society of Ireland. 26 (3): pp. 55–108. > Ronald A. Fisher was \"interested in application and in the popularization of > statistical methods... his early book Statistical Methods for Research > Workers, published in 1925, went through many editions and influenced the > practical use of statistics in many fields of study. === Design of Experiments === Fisher's Design of Experiments (1935) was \"also fundamental, [and promoted] statistical technique and application... The mathematical justification of the methods was not stressed and proofs were often barely sketched or omitted altogether .... [This] led H.B. Mann to fill the gaps with a rigorous mathematical treatment in his treatise\". == References == Category:1890 births Category:1962 deaths Category:English biologists Category:English mathematicians Category:English evolutionary biologists Category:Eugenics Category:Fellows of the Royal Society Category:English geneticists Category:Scientists from London Category:British statisticians",
 "title": "Ronald Fisher"
}