{
 "id": "1161462",
 "text": "Calls for the destruction of Israel refer to expressions that call for the physical elimination of Israel as a modern country, many forms of which have been considered by scholars and officials as hate speech inciting genocide against Jews due to Israel's Jewish-majority population. ==Overview== Such calls have been noted since the 1940s. In 1947, Arab League's leader Azzam Pasha said in the well-known Azzam Pasha quotation that he hoped for the Arabs not to be \"forced into a war of extermination\" if a Jewish state was to be founded. This statement has been regarded by scholars and officials as a threat to commit genocide against Jews. Before the Six-Day War in 1967, there was reportedly a full consensus among Arab states that Israel needed to be destroyed. Egyptian president Gamal Abdel Nasser repeatedly called for the destruction of Israel. Palestinian terrorist groups, including the Hamas, Houthis and Palestinian Islamic Jihad (PIJ), have called for the destruction of Israel.: \"Defenders of the phrase [from the river to the sea...] often say that the line refers to a one-state solution to the conflict between Israelis and Palestinians over that tract of land between the Jordan River and the Mediterranean Sea, in which Arabs and Jews could have equal voting rights. But the U.S. and U.N. position is that Israel has a right to exist as a Jewish state and that the conflict should be solved with a “two-state solution,” one country for each group\". ==History== ===20th century=== Before and after modern Israel was founded in 1948, Arab leaders in the Middle East made several statements calling for the physical elimination of Israel. ====Government of Saudi Arabia==== In late 1947, King Ibn Saud of Saudi Arabia told U.S. President Harry S. Truman: ====Azzam Pasha quotation==== In October 1947, in response to the United Nations Special Committee on Palestine (UNSCOP) report, Arab League's Secretary-General Abdul Rahman Hassan Azzam said, ====Arab Women's Organization==== In 1948, Matiel Mughannam, the leader of the Arab Women's Organization, remarked, ====Government of Egypt==== Egyptian president Gamal Abdel Nasser called for the destruction of Israel repeatedly. At the United Nations General Assembly in September 1960, Nasser argued that \"the annulment of Israel's existence\" was the only solution to the Israel–Palestine conflict. Nasser repeated in 1964,Sachar, Howard M. (1976, 2007) A History of Israel from the Rise of Zionism to Our Time. New York: Alfred A. Knopf. ISBN 0-394-48564-5. pp. 615–16 In 1965, Nasser threatened, ===21st century=== ====Government of Iran==== Since the Islamists took over Iran in 1979, opposition to the existence of Israel has been the state policy of Iran, with the two countries in a constant state of conflict. In 2000, Iran's Supreme Leader Ali Khamenei said, In 2001, Ali Khamenei stated, During the Israel–Hamas war, Ali Khamenei said on May 24, 2024, ==Academic views== Some of those calling for the end of the current State of Israel claimed that they wanted a \"free and democratic state of Palestine\" within the current boundaries. Academics have different views on this. ===Efraim Karsh=== Efraim Karsh, an Israeli and British historian who is the founding director and emeritus professor of Middle East and Mediterranean StudiesProfessor Efraim Karsh, King's College London Research Portal at King's College London, commented on the matter: ==Related pages== * Antisemitism * Holocaust inversion ==Footnotes== ==References== Category:Antisemitism Category:Political violence Category:History of the Middle East",
 "title": "Calls for the destruction of Israel"
}