{
 "id": "1161345",
 "text": "This is a list of television channels broadcasting regularly programmes in Russian language. == State-owned == === TV channels === Name Owner Established Channel One Russia Rosimuschestvo (state-owned) and Roman Abramovich 1991 Channel One International Channel One Russia 1999 First Baltic channel Baltic Media Alliance 2002 Russia-1 All-Russia State Television and Radio Broadcasting Company 1991 Russia-K (ex Kultura) All-Russia State Television and Radio Broadcasting Company 1997 RTR-Planeta (International version of Russia 1 and Russia K) All-Russia State Television and Radio Broadcasting Company 2002 Match TV (ex Russia-2) All-Russia State Television and Radio Broadcasting Company 2003 Russia-24 (ex Vesti) All-Russia State Television and Radio Broadcasting Company 2006 Carousel Channel One Russia and All-Russia State Television and Radio Broadcasting Company 2010 Carousel International (based on Telenyanya and Bibigon) Channel One Russia and All-Russia State Television and Radio Broadcasting Company 2010 TV Tsentr Government of Moscow 1997 TVCI (International version of TV Tsentr) Government of Moscow 2003 NTV Gazprom-Media 1993 NTV Plus Gazprom-Media 1996 TNT Gazprom- Media 1998 NTV Canada NTV Canada Inc. 2006 Telekanal Zvezda Ministry of Defence 2005 MIR 10 states from CIS 1992 StarWorld Gazprom-Media 2001 2003 (as Fox Fun) SD and HD only Fun (2001-2003), Fox Fun (2003-2015), Star Fun (2015-2018) CineMax Gazprom-Media 2011 SD and HD only Cinema Max (2011-2017) CineMax 1 Gazprom-Media 2020 SD and HD only RT (in English, International) ANO TV Novosti 2005 RT Arabic (in Arabic) ANO TV Novosti 2007 RT en Español (in Spanish) ANO TV Novosti 2009 RT America (in English, US) ANO TV Novosti 2010 RT UK (in English, UK) ANO TV Novosti 2014 RT France (in French, France) ANO TV Novosti 2017 RTD (in English) ANO TV Novosti 2011 3ABN Russia Three Angels Broadcasting Network 1992 Petersburg – Channel 5 NMG (National Media Group) 1938 REN TV NMG (National Media Group) 1997 CTC TV CTC Media 1996 Domashny CTC Media 2005 TV Rain private investors 2010 Muz-TV UTV Russia Holding 1995 MTV Russia Prof-Media(under license Viacom) 1998 VH1 Russia Prof-Media(under license Viacom 2006 2×2 (TV channel) Prof-Media 1989 TV3 Russia Prof-Media 1994 RBC TV RBC-TV Moskva 2003 Discovery Channel Russia Discovery Networks EMEA 2006 Discovery Science Russia Discovery Networks EMEA 2006 Investigation Discovery Russia Discovery Networks EMEA 2009 National Geographic Russia National Geographic Partners 2006 BRIDGE TV (music channel) Bridge Media Group 2005 Russian Travel Guide Bridge Media Group 2009 Russian Music Box (music channel) Bridge Media Group 2010 Disney Channel Russia Walt Disney Company 2010/2012 Disney Junior Walt Disney Company 2013 Nickelodeon Russia ViacomCBS International Media Networks 2010 Nick Jr Russia ViacomCBS International Media Networks 2010 Nicktoons ViacomCBS International Media Networks 2010 TV1000 Modern Times Group 2003 TV1000 Russkoe Kino Modern Times Group 2005 TV1000 Action East Modern Times Group 2008 Viasat History Modern Times Group 2004 Viasat Explore Modern Times Group 2003 Viasat Sport East Modern Times Group 2006 Viasat Nature Modern Times Group 2010 Universal Channel Russia NBC Universal International 2010 SyFy Universal Russia NBC Universal International 2008 Diva Universal Russia NBC Universal International 2010 Ru.TV RMG (RussianMediaGroup) 2006 O2TV private investors 2004 A-One private investors 2005 RTVi private investors 2002 Kaleidoskop TV private investors 2015 Cyber- Game.TV private investors 2012 Golf TV 2018 == Russia == ==Other countries== Country Name Owner Notes Abkhazia Abaza TV Beslan Butba Not aligned with either the government or the opposition of Abkhazia. The station broadcasts twice a day in Russian and has a news roundup once a week. Belarus Belarus TV The Stas Nationality Television and Radio Company China CGTN Russian China Global Television Network Cyprus RTCY Russian Television Cyprus EU Euronews Euronews SA EU Eurosport TF1 Group Estonia, Latvia ETV+ TV3+ Viasat India Zee Russia Essel Group Israel Channel 9 Alexander Levin Saudi Arabia Quran Hidayah Russian Quran Hidayah International Network Turkmenistan Turkmenistan (TV channel) Turkmenistan Government USA, Czech Republic Current Time TV (Настоящее Время) RFE/RL, VOA www.currenttime.tv Independent mass media channel, financed by the USA Congress via Broadcasting Board of Governors. By US law this channel is required to provide to the viewers and readers truthful, objective and professionally prepared materials. The US government representatives, including the head of Committee for U.S. International Broadcasting cannot influence the work of the Current Time TV. ==See also== *Lists of television channels ==References== Category:Russian culture Russia",
 "title": "Television in Russia"
}