{
 "id": "1161998",
 "text": "Mathilde Collin, born on April 20, 1989, is a French business leader, head of the Californian company Front, which she created in 2013 and which became a unicorn in 2022. == Biography == === Family and education === Mathilde Marie Anne-Sophie Collin was born on April 20, 1989 in France. Her father is an engineer, her mother an executive assistant; her grandparents are farmers on the one hand and bricklayers on the other.Comment Mathilde, la bonne élève de banlieue, a monté une start-up à plus d’un milliard d’euros After completing preparatory studies at the private college Notre-Dame-du-Grandchamp in Versailles, she was admitted to all the schools she applied to. She chose HEC Paris and specialized in entrepreneurship.Front, la nouvelle licorne française HEC Paris During a gap year, she discovered the startup Shopcade where she really liked the atmosphere and financial management of Bouygues, which she did not like.La Française Mathilde Collin, coqueluche des Américains She married a fiction writer, is the mother of two children, the second born in January 2023. She plays tennis and football and enjoys climbing and cycling.Dans les pas de Mathilde Collin, CEO de Front, la «licorne» française qui invente le futur de l'e-mail === Professional career === After graduating from HEC in 2012, she worked for 9 months at Concord, a contract management startup.Mathilde Collin, la Française qui bouscule la Silicon Valley In 2013, with the financial support and advice of entrepreneur Thibaud Elzière, she created Front in Paris with Laurent Perrin, who is in charge of the technology. Front markets a SaaS software that brings together in a single folder all the messages sent/received by a correspondent, regardless of the transmission method (email, SMS, WhatsApp, etc.). The product interacts with different messaging tools such as Slack, Asana or Salesforce. The boss presents it first as a new email software and then as \"a customer communication platform\".«Il y a des choses plus importantes dans la vie que mon entreprise» The company had five employees when Mathilde Collin decided to move it to San Francisco to take advantage of Y Combinator. After raising a Series D fund in 2022, it is valued at $1.7 billion, giving it unicorn status.Front devient une licorne et part à la chasse de plus gros clients She seeks to achieve a good working environment in her company, which is ranked by Fortune as the 13th best place to work in a mid-size company in 2022. On this topic, she even says that the pursuit of employee happiness motivated her to create a company.Mathilde Collin, la PDG qui veut être à la pointe de l'équilibre entre travail et vie privée She is involved in the financing of other startups, including Loom, Inc. in 2020.Who is the CEO of Front? Mathilde Collin’s Bio == Awards == * Inspiring Fifty France (2016) * Forbes 30 Under 30 == References == Category:1989 births Category:Living people Category:Alumni of HEC Paris Category:French chief executives",
 "title": "Mathilde Collin"
}