{
 "id": "1161914",
 "text": "Uttara Model Town or simply Uttara (Bengali: , romanised: Uttora) is a neighbourhood of Dhaka, the capital of Bangladesh. The name derives from the Bengali word uttor () meaning \"north\". It lies on the road to Gazipur, and adjoins Hazrat Shahjalal International Airport. == History == === Planning === In 1966, Dhaka Improvement Trust planned to build a satellite town under North Satellite Town project in Dhaka District. In 1980, DIT changed the project name into Uttara Residential Model Town Project. === First phase === RAJUK completed the first phase of the project in 1992. In this phase, Uttara had 6,000 plots. The total land for these plots was 950 acres. Completed sectors in 1st phase are Sector 1, Sector 2, Sector 3, Sector 4, Sector 5, Sector 6, Sector 7, Sector 8, Sector 9, and Sector 10. === Second phase === New phase started after the completion of first phase. Second phase took 6 years to complete. Completed sectors in 2nd phase are Sector 11, Sector 12, Sector 13, and Sector 14. === Third phase === During the course of the third phase circa 2,150 acres (8.7 km2) of land were acquired. About 10,000 residential plots and 225,512 apartments including amenities and urban facilities were provided. The estimated cost of third phase is Tk 23.16 billion. The deadline of the extension project was extended to June 2022. Planned sectors in 3rd phase are Sector 15, Sector 16, Sector 17, and Sector 18. == Demographics == At the 2011 Bangladesh census, Uttara had a population of 179,907. According to 2011 figures, males constitute 56.33% of the population and females 43.67%, and about 80% of the Uttara's population are adults. Uttara has an average literacy rate of 90.49% (7+ years). == Administration == Uttara is divided into administrative and geographical divisions named \"Sectors\". There are 18 sectors in Uttara. Every sector is under a sector welfare association. Uttara Association is the combination of these sector-wise associations. The Suburb of Uttara is under two wards (Ward no. 1 and Ward no. 51) of DNCC. Politically this area is under Dhaka-18 constituency. == Geography == === Inner Uttara === * Sector 1 * Sector 2 * Sector 3 * Sector 4 * Sector 5 * Sector 6 * Sector 7 * Sector 8 * Sector 9 * Sector 10 * Sector 11 * Sector 12 * Sector 13 * Sector 14 * Sector 15 * Sector 16 * Sector 17 * Sector 18 == Economy == Uttara is a planned city and one of the elite suburbs in Dhaka. For that reason, and many other attractive features, Uttara is one of the most desirable residential areas in Dhaka. According to a survey conducted by B-property in 2019, Uttara is the first choice of Dhaka residents for living. Mr Nuswardi is a Chief Executive of the property website named B-Property. He said to BBC Bangla that this planned satellite town is an important place in the capital of Bangladesh which has all necessary amenities and services the residents need. In the future, more and more people will start living in Purbachal, which is located adjacent to the area so it is a plus point. Uttara is a popular destination for shooting Bangladeshi dramas. == Parks and recreation == Uttara Model Town has a total of 8 parks. Sectors 1, 2, 5, 8, 9 and 10 have no parks. There are numerous lakes in Uttara except in sectors 1, 2, 6, 8, 10 and 12. There is a children amusement park in sector 15 named Fantasy Island. It has Uttara Lake and Khidir Canal. == Tourist attractions == * Diabari * Mugdho Mancha * Uttara Lake == Gallery == File:2_poient_pespective,_Uttara,_Dhaka.jpg|Chowrasta in Uttara File:Bangladesh_DSC_0472_(3943550199).jpg|Alaul Avenue File:রবীন্দ্র_সৃজনকলা_বিশ্ববিদ্যালয়ের_ক্যাম্পাস_ভবন.jpg|Shah Makhdum Avenue File:Beauty_of_Dia_Bari,_Uttara,_Dhaka_(34617346975).jpg|Sector 15 lake File:Dhaka_City_View_02.jpg|Skyline of Uttara File:Dhaka_City_View_03.jpg|Road in Uttara File:Uttara_House_Building.jpg|House building at night File:Uttra,Dhaka_উত্তরা_ঢাকা.jpg|A lake in Uttara File:North_Tower,_Uttara_(50).jpg|North Tower, Uttara File:Uttara_Dhaka_at_night.jpg|Night view of Uttara File:PitzaRooftop.jpg|A commercial building in Uttara File:Rooftop_View_of_PITZA_Restaurant_Uttara_Dhaka.jpg|A rooftop restaurant in Uttara ==Notes== == References ==",
 "title": "Uttara"
}