{
 "id": "1161786",
 "text": "Wii Karaoke U by Joysound (also known as Karaoke Joysound for Wii U) is a karaoke video game for the Wii U eShop. It was made by TOSE Software and released by Nintendo. The game is a sequel to the Wii game Karaoke Joysound, using the same Joysound online song library. The game was free to download but required the purchase of a karaoke ticket to sing songs, as well as an internet connection. The service ended on March 31, 2017 for Europe and June 30, 2023 for Japan. == Gameplay == The game gives players access to a large selection of songs, releasing with over 90,000 songs in Japan and just 1,500 songs in Europe, with more added over time with updates. Users can sort through the song library by genre, artist, popularity, among other filters. The Wii U GamePad is used to browse and select songs, as well as create playlist and adjust settings. Players can either use a USB microphone or the microphone on the Wii U Gamepad to sing along to the music. The game was released with the Wii U microphone, an official USB microphone from Nintendo. Lyrics are shown on the TV screen, with visuals to assist with timing. The GamePad also can be used to show lyrics, allowing a singer to look at it instead of the TV. After a song, a singer can be given a score based on pitch, timing, and accuracy. Players can sing alone, as a group, or compete against others. The game allows players to connect online, competing for higher online rankings and in the karaoke battle modes. Songs are sung on stage by Miis, who can wear different costumes to suit the mii and the performance. Similarly, the stage can be changed to add band members, dancers, and other decorations. Despite being a free download, the game used on a ticket system that allows people to subscribe to a service to sing the songs for whatever amount of time they wanted. == Controversy == Shortly after its launch in Europe, Nintendo Life broke a story revealing that Wii Karaoke U did not censor any of the songs in the Joysound library. This led to concerns as the title granted access to songs with inappropriate content without telling them. In response, Nintendo announced a warning on Wii Karaoke U's eShop page as well as in the app itself. == Reception == Official Nintendo Magazine UK gave the game 68%. They said Wii Karaoke U was a good karaoke game but criticized the heavy use of cover songs. Italian Eurogamer gave the game 7/10, complaining that there were not enough social aspects of the game. == References == == Other websites == * Wii Karaoke U at GameFAQS * Wii Karaoke U by JOYSOUND Official Nintendo Site Category:Free-to-play video games Category:Wii U games Category:Multiplayer and single-player video games Category:Video games developed in Japan Category:Nintendo video games Category:2012 video games Category:CS1 Italian-language sources (it) Category:CS1 Spanish-language sources (es) Category:CS1 Portuguese-language sources (pt) Category:Articles using Video game reviews template in single platform mode",
 "title": "Wii Karaoke U"
}