{
 "id": "1161022",
 "text": "Spermophilus is a genus of ground squirrels in the squirrel family. In the past, this genus included many kinds of squirrels living in Europe, Asia, and North America. But scientists found that some squirrels in this genus were more closely related to prairie dogs, marmots, and antelope squirrels, which are clearly different. Because of this, all the Spermophilus squirrels in North America were moved to other genera. Now, only the European and Asian squirrels are true Spermophilus, except for two types in Asia called Urocitellus. Some kinds of these squirrels are sometimes called susliks (or sousliks). The word suslik comes from the Russian word суслик. In some languages, similar words are used, like suseł in Polish. The scientific name Spermophilus means \"seed-lovers.\" It comes from the Greek words sperma (seed) and philos (friend or lover). == Habitat and behavior == Spermophilus are ground squirrels. They live in open places like grassy fields, meadows, dry plains, and semideserts. They eat low plants and make burrows where they sleep and hide.Kryštufek, B.; B. Vohralík (2012). \"Taxonomic revision of the Palaearctic rodents (Rodentia). Part 1 (Eutamias and Spermophilus)\". Lynx, N. S. (Praha). 43: 17–111. They are active during the day and mostly live in groups, but some live alone. They can be found in both low and high areas. They sleep through cold months (up to about 8 and a half months in some kinds). In dry places, they may also rest during hot times in summer or fall. Different types usually live apart, often divided by big rivers, but in some places, up to three types can live close together. Rarely, two types may even share burrows, and some types mix to create hybrids where they meet. == Appearance == Spermophilus are yellowish, light orange, light brown, or grey. Many have soft spots or marks, but they do not have strong patterns. One kind, S. suslicus, has brown fur with clear white spots. Their size depends on the type. They are about from head to body. The biggest S. fulvus can weigh up to before winter, and S. major can weigh nearly . Other types are much smaller, often less than even when ready for hibernation. Their tails are short, about 10–45% of their head-and-body length. == Relationship with humans == Ground squirrels may carry fleas that spread diseases like the Black Death. They also cause damage by digging tunnels under buildings. == Species == In 2007, scientists used a method called phylogenetic analysis with a special gene called cytochrome b to study Spermophilus. This led to dividing Spermophilus into eight groups, along with prairie dogs, marmots, and antelope squirrels, which were placed in numbered groups (clades). The exact relations between these groups are not completely clear. Some species found only in Palearctic areas are kept under the strict name Spermophilus sensu stricto. A 2024 genetic study divided the genus into four main groups that split apart in the Late Miocene. Spermophilus sensu stricto, Old World ground squirrels * East Asian group ** Alashan ground squirrel, Spermophilus alashanicus ** Daurian ground squirrel, Spermophilus dauricus * Asia Minor/European group ** European ground squirrel, Spermophilus citellus ** Podolian souslik, Spermophilus odessanus ** Speckled ground squirrel, Spermophilus suslicus ** Taurus ground squirrel, Spermophilus taurensis ** Asia Minor ground squirrel, Spermophilus xanthoprymnus * Pygmaeus group ** Caucasian Mountain ground squirrel, Spermophilus musicus ** Little ground squirrel, Spermophilus pygmaeus * Colobotis group ** Brandt's ground squirrel, Spermophilus brevicauda ** Red- cheeked ground squirrel, Spermophilus erythrogenys ** Yellow ground squirrel, Spermophilus fulvus ** Russet ground squirrel, Spermophilus major ** Pallid ground squirrel, Spermophilus pallidicauda ** Spermophilus ralli ** Relict ground squirrel, Spermophilus relictus ** Spermophilus selevinus ** Spermophilus vorontsovi === Prehistoric species === Scientists found a very well-preserved Eurasian ground squirrel fossil that helped them learn more about their skull structure. This led to new ideas about their relations. Three Pleistocene species that were once part of Urocitellus were moved to Spermophilus: * †Spermophilus nogaici * †Spermophilus polonicus * †Spermophilus primigenius There are also three extinct species from Europe: * Spermophilus citelloides lived from the Middle Pleistocene to early Holocene in central Europe. It is closely related to S. suslicus. * Spermophilus severskensis lived in the late Pleistocene in Ukraine and was a specialized grazer, related to S. pygmaeus. * Spermophilus superciliosus lived from the Middle Pleistocene until possibly the early 1900s across much of Europe. It was similar in size to S. major and likely an ancestor of S. fulvus. == References == === Citations === Category:Mammals of North America Category:Mammals of Asia Category:Rodents",
 "title": "Spermophilus"
}