{
 "id": "1161225",
 "text": "Hans Prakke (4 March 1949 – 7 January 2025) was a Dutch journalist. ==Biography== After high school, Prakke attended in Utrecht and studied afterwards law at the Vrije Universiteit Amsterdam, with a major in Constitutional Law. During his studies, he works for the hospital radio station of the in Amsterdam. Through that hospital radio station, he started working at Radio North Sea International and gave sports contributions from the broadcasting ship, including the 1973 Tour de France and 1974 Tour de France. In 1975 he made his debut for the broadcaster NOS at the 1975 UCI Road World Championships in Belgium. Due to his freelance work for NOS and AVRO, he temporarily stop studying law. After his freelance years at NOS, AVRO and Radio Stad he became a permanently ampoyer of AVRO in 1977 as an editor- reporter at AVRO's Radiojournaal. From 1978 he worked as a political reporter for the AVRO in The Hague. He did reports of the Tour de France in 1977, 1978 and 1979 in the together with Theo Koomen and Heinze Bakker. He made a daily \"Kneetstory\" with Gerrie Knetemann. Prakke had a lot of cycling knowledge and had good contact with the cyclists. In 1983 Prakke left the radio and went to television. He worked as a political reporter for NOS Journaal until 1989. Prakke continued his studies at the university and graduated. From 1989 to 1994 he moved back to the radio. Together with Kees Sorgdrager he had the daily radio programme Met het oog op morgen. In 1990, 1991 and 1992 he was again active as a reporter for . In 1994 he became Head of Public Relations for the Labour Party (PvdA) assisting Prime Minister and party leader Wim Kok; personal spokesperson for party chairman Felix Rottenberg and faction chairman Jacques Wallage. From 1997 to April 2009 Prakke head of the Public Relations Department and spokesperson for the Social and Economic Council (SER). In 2010 he started his own company \"JMP PR en Voorlichting\", focussing on journalism, media consultancy, media training and lectures on politics, sports and socio- economic themes. He wrote the book De Kneetstory about Gerrie Kneteman. He was into cycling until older age. Prakke, together with partner Alice Prakke, owned a monumental building in Zwollle and sold it in 2008. He died in Zwolle on 7 January 2025, at the age of 75. ==References== ==Other websites== * Hans Prakke at beeldengeluid.nl Category:Dutch journalists Category:1949 births Category:2025 deaths Category:People from Gelderland Category:Place of death missing",
 "title": "Hans Prakke"
}