{
 "id": "1161690",
 "text": "Christmas seals are stickers that look like postage stamps. People buy them and stick them on mail during Christmas to help raise money and let others know about charity programs. Christmas seals are mostly linked with lung diseases like tuberculosis and with helping children. The first Christmas seals were made in Denmark in 1904. Sweden and Iceland started making them in the same year. After that, they became very popular, and 130 countries made their own. Sometimes people confused Christmas seals with postage stamps. Because of this, the US Post Office made a rule that seals had to be put on the back of letters or postcards. But this rule was not popular, many people ignored it, and it was later canceled. There are many different kinds of Christmas seals. The most famous ones were made by the Red Cross and later by the National Tuberculosis Association, with a red double-cross symbol on them. Other groups, like state governments, religions, and social organizations, also made seals. Some governments made special stamps that raised money for the Red Cross or other charities. From the start, Christmas seals were loved by many people and became popular with collectors and postal historians. Today, their value as collectibles can be very different. == Danish origin == At the start of the 1900s, tuberculosis was a very scary disease, and it hurt children the most. In 1904, Einar Holbøll, a Danish mail worker, thought of adding a special stamp to Christmas cards to raise money. The money would help children who were sick with tuberculosis. The Postmaster and the King of Denmark, Christian IX, liked the idea and approved it. Before he died in 1927, Holbøll was made a knight by the king for his work in fighting tuberculosis and connecting Christmas with helping the sick. Other countries, like the United States, also honored him. The first Christmas seal was made in Denmark in 1904. It showed a picture of the Danish Queen, Louise of Hesse-Kassel, and the word \"Julen\" (Christmas). More than 4 million seals were sold in the first year for DKK 0.02 each, raising over $18,000—a lot of money at the time. The next year, even more money was raised for the fight against tuberculosis. In six years, enough money was collected to build a Christmas Seal Sanatorium in Kolding, which opened in 1911. That same year, the sanatorium became part of the Danish National Association to Combat Tuberculosis, so resources wouldn’t be wasted by having two groups working on the same goal. Fundraising with Christmas seals continued to be successful for many years. The Danish Christmas Seal Committee, now called Julemærkefonden (the Christmas Seal Fund), decided to use all future money to build and run recovery homes for children. In 1958, there was a disagreement about a Christmas seal showing Santa Claus. A clergyman from Copenhagen, Rev. Paul Nedergaard, called Santa Claus a \"pagan goblin\" and told people not to buy the seal. He said they should find other ways to give money for fighting tuberculosis. However, most people in Denmark ignored him and kept buying the Christmas seals with Santa Claus. == United States == At the start of the 1900s, the United States had a serious problem with tuberculosis, a deadly disease. The only way to treat it was to send sick people to special hospitals called sanatoriums. Many sanatoriums had no money and were about to close. One of these was in Brandywine, Delaware. A doctor there, Joseph Wales, asked his cousin Emily Bissell for help. Emily was good at raising money. She looked for ways to collect the $300 needed to keep the hospital open. In Europe, Christmas seals were already successful. Jacob Riis, a Danish journalist and friend of President Roosevelt, wrote about them, which inspired Emily Bissell. In 1907, she made the first U.S. Christmas seal to raise money for her cousin’s sanatorium. The first year, the seals brought in $3,000. By 1909, they made $250,000. The Red Cross saw how successful the seals were and worked with the National Tuberculosis Association to sell them together. In 1920, the Red Cross let the Association handle the seals alone. By 1955, sales had reached $26 million. The first U.S. Christmas seals were sold in post offices starting December 7, 1907, for one penny each. They raised money to fight tuberculosis. From 1908 to 1918, the Red Cross and the Tuberculosis Association split the money. After 1919, the Tuberculosis Association used a special red double- cross on every seal. During World War I in 1918, seals were only given to Red Cross members to avoid competing with other war fundraisers. From 1920 to 1973, the Tuberculosis Association issued the seals. In 1973, it became the American Lung Association. The seals have helped with lung disease and tuberculosis, which is still a serious disease. In 1987, the American Lung Association trademarked \"Christmas Seals\" to protect their fundraising efforts. Christmas seals often had different printers, and since 1926, a small mark on the sheet showed which printer made them. Local seals were also made alongside national ones. The first U.S. Christmas seal to show real people was in 1938, honoring those who fought tuberculosis. By 1975, sheets had fewer seals, and designs changed to look like puzzles showing a big picture. Promotions helped sell seals, like a contest in 1954 where Saranac Lake, New York, won a movie premiere. The NAACP started their own seals in 1927 to raise awareness about racial issues. In 1919, seals were sold like bonds for larger donations. Today, Christmas seals still support the American Lung Association. Though tuberculosis declined, it remains a major disease worldwide. Many organizations, like a Philadelphia dispensary in 1907, have made local seals in addition to the national ones. == Canada == By 1908, the Christmas seal campaign reached Canada. People in Toronto and Hamilton, Ontario, started using seals to raise money for hospitals called sanatoriums, which treated tuberculosis. A newspaper, the Toronto Globe, helped by writing daily front- page stories about the campaign. Each story had a holly border so readers could find it easily. One story said children from 58 schools in Toronto sold 10,000 Christmas seals. Another story told how the Regina Leader newspaper in Saskatchewan sold seals and sent the money to help build a sanatorium in Muskoka. In Saint John, New Brunswick, Rev. G. A. Moore wrote that he and other volunteers would sell 8,500 seals and send the money to Toronto. In that first year, Toronto raised $7,358.65 (worth almost $200,000 today), and Hamilton raised $1,244.40. Each year, more cities across Canada used Christmas seals to raise money and teach people that tuberculosis could be controlled. In 1927, it was decided that Christmas seals would be the official way for tuberculosis associations to ask for public donations. A national seal was created. Christmas seal campaigns became important for public health. At first, the money was used to build more sanatoriums. Later, it paid for tuberculosis prevention, including chest X-rays and tuberculin tests for millions of Canadians. Many cases of tuberculosis were found early, stopping the disease from spreading. The Canadian Lung Association's Christmas seals still show how everyday Canadians helped fight tuberculosis. == Europe == Soon after Denmark made the first Christmas seal, Sweden and Iceland did the same. Seals then spread to all of Scandinavia and many countries in Europe, where they are still liked today. Hundreds of groups, both national and local, in Asia, Africa, North and South America, and Australia have made Christmas seals. Most tuberculosis seals since then have been made at Christmas time and show the Cross of Lorraine, the international symbol against tuberculosis. === Semi-postals === Many governments have also made semi-postal stamps to raise money for the Red Cross and the fight against tuberculosis. Countries like France, Spain, and Belgium have created hundreds of these stamps. During World War I, France began making semi-postal stamps to help the Red Cross care for many wounded people. Later, even French colonies made these stamps. The idea of using semi-postal stamps for fundraising spread to many countries hurt by the war. More than 230 semi-postals were made by 47 countries. Spain and its colonies made about 150 semi-postals, almost as many as France. France began making stamps with the red cross symbol in 1918 to raise money for the Red Cross. Belgium started making semi-postals in 1914, with part of the cost going to charity. Other countries in Europe, like Finland, Germany, Italy, and the Netherlands, also made semi-postal stamps for the Red Cross and tuberculosis groups. == Other countries == Nearly one hundred lung health groups around the world make Christmas seals. Many countries, cities, states, and regions have their own seals. Collectors use Green’s Catalog to tell if a seal is from a whole country or a local area. Many of the groups making tuberculosis seals are part of the International Union Against Tuberculosis and Lung Disease, which holds a contest each year for the best seal design at its World Conference on Lung Health. In Korea, after much work to raise money to fight tuberculosis, the first Christmas seal was made in 1933. The Korean Medical Missionary Association formed a group with members of different religions and backgrounds. They got help from the Church of England, the United Church of Canada, and health groups in Korea. Mexico, through the National Committee to Fight Tuberculosis, made its first Christmas seal in 1943 to help fight the disease. == Usage == Since 1907, people have sometimes used Christmas seals in place of real postage stamps. By 1911, the U.S. Post Office made a rule that seals could not be put on the same side of a postcard or envelope as the address. After 1930, this happened less often. Before 1930, most Christmas seals in the U.S. were used on Christmas postcards. Postcards only needed one penny for postage, while Christmas cards with envelopes did not exist yet. Today, postcards with seals and postmarks from the same year as the seal are rare and valuable. == Other types == Many other seals were made at Christmas to raise money for charity. Religious, patriotic, and civic groups made these seals, but they were not for fighting tuberculosis, so they do not have the Cross of Lorraine symbol, created in 1902 at the International Conference on Tuberculosis in Berlin. Between 1937 and 1943, the Danish Nazi Party made seals with Christmas designs like holly, but they also showed the Nazi swastika. Since they were not connected to fighting tuberculosis, they are not listed in Green’s Catalog. The Holy Childhood Association, approved by the Vatican in 1843, helps schools and churches. It makes its own Christmas seals to raise money, sold at Catholic churches and schools. Dictatorships often stop Christmas seals from being made. This happened in Korea under Japanese rule, in China under communism, and in Argentina under Eva Perón. == Collecting == When Christmas seals first came out in the early 1900s, many people liked them. Stamp collectors were especially interested. The price of Christmas seals can be very low or very high, depending on how rare they are, how they look, and their condition. Like stamps and coins, their value usually goes up over time. For example, in 1935, a Christmas seal from 1915 was worth 25 cents. By 1983, it was worth $4, and in 2014, it was worth $9. Seals that have been used, have no glue, or have a straight edge on one side are usually worth half as much as unused seals in good condition. If a Christmas seal is stuck next to a postage stamp and has a postmark from the same year, it can be worth more than seals that are loose or removed from mail. A group of four seals still together is often rare and worth more than four separate seals. On December 4, 2014, a postcard with a rare 1911 Christmas seal sold for $3,433.83 on eBay. It was postmarked on December 20, 1911, in Los Angeles and sent to Fort Wayne, Indiana. Another rare Christmas seal from 1919 sold at auction for a very high price of $3,872,533. Since 1936, Santa Claus, Indiana, is often called the \"official\" first place where Christmas seals are released in the U.S. Special envelopes with the seals were made in batches of 500 to 2,000. Joe Wheeler and Jerry Grigaitis, members of the Christmas Seal and Charity Stamp Society, kept track of these. In 1936, the Santa Claus postmaster did not let seals be marked with a postmark, but sometimes it happened, and those are worth much more. The Christmas Seal and Charity Stamp Society, started in 1931, is one of the oldest groups for seal collectors. It is part of the American Philatelic Society. The society gives information to collectors, prints a journal called Seal News four times a year, and has a big catalog of books about seal collecting. It also holds auctions in its journal. == References == Category:1904 establishments in Europe Category:Christmas",
 "title": "Christmas seal"
}