{
 "id": "116179",
 "text": "Forensic science (or forensics) is when science works to answer questions a lawyer might ask. Most often, forensics is about proving that someone was present at a place where a crime was committed. Specialists take samples which are later analyzed in a laboratory. Most forensic tests can take from 1 hour to one year, and investigators need to double (and triple) check the answer, so they know that the answer is the right answer. If a forensics team made a mistake the wrong person could be jailed, or they could get into trouble themselves. Samples commonly taken include fingerprints. People also look for other things that could be used, for example a few hairs (or pieces of skin) and autopsy if dead. Samples like hair or skin can be use for DNA testing, which allows to tell the gender of the person the hair is from, amongst others. When someone is accused of committing the crime, these pieces of evidence can then be matched up. Then, if they are correct, the person is charged. == Subdivisions == * Forensic accounting is the study and interpretation of accounting evidence * Forensic anthropology is the application of physical anthropology in a legal setting, usually for the recovery and identification of skeletonized human remains. * Forensic archaeology is the application of a combination of archaeological techniques and forensic science, typically in law enforcement. * Computational forensics concerns the development of algorithms and software to assist forensic examination. * Criminalistics applies various sciences to answer questions relating to examination and comparison of biological evidence, trace evidence, impression evidence (such as fingerprints, footwear impressions, and tire tracks), controlled substances, ballistics, firearm and toolmark examination, and other evidence in criminal investigations. In typical circumstances evidence is processed in a crime lab. * Forensic dactyloscopy is the study of fingerprints. * Digital forensics is the application of proven scientific methods and techniques in order to recover data from electronic / digital media. Digital Forensic specialists work in the field as well as in the lab. * Forensic document examination or questioned document examination answers questions about a disputed document using a variety of scientific processes and methods. Many examinations involve a comparison of the questioned document, or components of the document, with a set of known standards. The most common type of examination involves handwriting, whereby the examiner tries to address concerns about potential authorship. * Forensic DNA analysis takes advantage of the uniqueness of an individual's DNA to answer forensic questions such as paternity/maternity testing and placing a suspect at a crime scene, e.g. in a rape investigation. * Forensic engineering is the scientific examination and analysis of structures and products relating to their failure or cause of damage. * Forensic linguistics deals with issues in the legal system that requires linguistic expertise. * Forensic pathology applies the medical methods and principles of pathology, including autopsy, to determine a cause of death or injury in the context of a legal inquiry. * Forensic psychology is the study of the mind of an individual, using forensic methods. Usually it determines the circumstances behind a criminal's behavior. * Forensic toxicology is the study of the effect of drugs and poisons on/in the human body. * Forensic Podiatry is an application of the study of feet footprint or footwear and their traces to analyze scene of crime and to establish personal identity in forensic examinations.",
 "title": "Forensic science"
}