{
 "id": "1161544",
 "text": "Conventional war is a kind of war where countries fight each other using conventional weapons and battle plans. The armies on both sides are clear and use weapons mainly to attack the other side’s soldiers. It does not use special weapons like chemical, biological, radioactive, or nuclear weapons. The main goal of normal war is to make the other side’s army weaker or destroy it so they cannot fight back. But sometimes, one or both sides may use different, unexpected ways of fighting to win. == History == === Formation of state === The idea of a state started with Plato, but it became more popular when the Roman Catholic Church gained power. Later, European kings became powerful as the Catholic Church lost its control, and kings ruled by claiming their power came from God. In 1648, European leaders signed the Treaty of Westphalia. This treaty ended wars caused by religion and began the idea of modern states, where governments ruled based on politics, not religion. In this system, only the state and its leaders could have weapons and start wars. War was seen as something only between countries. Kings made this a law. Before, nobles could start wars, but during the Napoleonic Wars, kings took control of the armies. === Clausewitzian ideas === Prussia built a strong army. One of its officers, Carl von Clausewitz, wrote a book called On War. It focused on wars between countries and ignored other types of fights, like rebellions. He later noticed that people could also fight wars, not just states, and called this idea \"the people in arms.\"Smith, M.L.R. \"Guerrillas in the mist: reassessing strategy and low intensity warfare\". Review of International Studies. Vol. 29, 19–37. 2003 Old practices like raiding and family feuds were now seen as crimes. This new way of thinking influenced the modern world, where armies became large, expensive, and advanced, built to fight other similar armies. Clausewitz also talked about reasons for war, called casus belli. Wars were often fought for social, religious, or cultural reasons. Clausewitz said war is just \"politics by other means,\" where countries fight for their interests, like money or safety, when they cannot agree peacefully. ==== How common is normal war? ==== Most wars today use normal weapons and methods. Since 1945, no country has used biological weapons, and chemical weapons have only been used a few times, like in the Syrian Civil War. Nuclear weapons were used only once, when the U.S. bombed Hiroshima and Nagasaki in Japan in 1945. === Since World War II === During the 20th century, states and Clausewitz's ideas were most important during the World Wars. But nuclear weapons changed everything. In the Cold War, powerful countries avoided direct fights because they knew nuclear war would be very dangerous. Instead, they fought indirectly through smaller wars, military buildups, and diplomacy. No two nuclear-armed countries have fought a big war directly, except for small clashes, like the 1969 Sino-Soviet conflict and the 1999 Kargil War between India and Pakistan. However, normal wars have happened between countries without nuclear weapons, like the Iran–Iraq War and Eritrean–Ethiopian War, or between a nuclear country and a weaker non-nuclear one, like the Gulf War and the Russo-Ukrainian War. == References == === Citations === Category:Military tactics Category:Military",
 "title": "Conventional warfare"
}