{
 "id": "1161578",
 "text": "The Lalish temple was occupied and converted into a Quranic school, causing great distress among the Yazidis. In 1890, the Ottoman leadership sent their general, Omar Wahbi Pasha, to the Yazidi region of Sheikhan in what is now northern Iraq to force the Yazidis, considered “infidels,” to convert to Islam. Omar Wahbi Pasha mobilized Kurdish tribes, including the leader of the Hamidiye cavalry and numerous Kurdish-Muslim tribes in northern Iraq, to launch a military campaign against the Yazidis. == History == Between 1891 and 1893, a bloody conflict erupted between the Ottoman-Kurdish attackers and Yazidi fighters. Omar Wahbi Pasha issued an ultimatum to Mir Ali Beg, the future secular leader of the Yazidis: either he and his people convert to Islam, or they would be killed. The attackers besieged the Yazidis, who were poorly equipped and vastly outnumbered. While Mir Ali Beg refused to surrender, many Yazidi tribes, facing the threat of imminent attack and witnessing the massacres of Yazidi villages, converted to Islam under duress. The Yazidi community suffered a particularly severe blow in 1892 with the annexation of the Lalish Valley. Under the leadership of the Ottoman forces, Kurdish tribes attacked the sacred Lalish temple, seizing full control of it. They looted and damaged mausoleums of Yazidi saints, and the central temple was converted into a Quranic school. This occupation lasted for twelve years, during which a Kurdish mullah and hundreds of his students occupied the temple, protected by the Ottoman administration in Mosul. The destruction extended beyond Lalish, affecting nearby Yazidi villages like Bashiq and Bahzan. Numerous smaller pilgrimage sites in the region were also destroyed. Mir Ali Beg was captured and detained in Kastamonu. The occupation of Lalish caused widespread outrage among the Yazidis. In Shingal, the second traditional homeland of the Yazidis in northern Iraq, Yazidi tribal leader Hamo Shero mobilized additional tribes and fighters to resist the Ottomans and Kurds. Ultimately, the occupation of the Lalish Valley sparked a broader Yazidi rebellion in Shingal and Sheikhan against the Ottomans and their Kurdish allies. == References == Category:18th-century conflicts Category:Yazidis Category:Ottoman Empire",
 "title": "Ottoman-Yazidi Conflict (1891-1893)"
}