{
 "id": "1161307",
 "text": "The Treaty of Mungi-Shevgaon was signed on March 6, 1728, between Bajirao I of the Maratha Empire and Asaf Jah I, the Nizam of Hyderabad, in Shevgaon. Under the treaty, the Nizam allowed the Marathas to collect a tax called Chauth from the six provinces in the Deccan region. The treaty also recognized Shahu I as the ruler of the Maratha Empire. In return, the Marathas agreed not to take action against Sambhaji II, who had joined forces with the Nizam against Shahu I. == Background == The origins of this conflict can be traced back to 1713 when Maratha king Shahu I appointed Balaji Vishwanath as his Peshwa (Prime Minister). By 1724, Mughal authority had weakened, and Asaf Jah I, the first Nizam of Hyderabad, declared independence from Mughal rule, founding his own kingdom. The Nizam wanted to weaken the growing power of the Marathas and took advantage of the rivalry between Shahu and Sambhaji II, both of whom claimed to be King. He supported Sambhaji II, which upset Shahu. The Nizam also stopped paying the tax, which landowners in the Deccan had agreed to pay the Marathas in 1719. == Palkhed Campaign == In 1725 and 1726, Bajirao’s campaigns in the Carnatic region angered the Nizam of Hyderabad, who then began preparing to confront the Marathas. The Nizam persuaded several Maratha nobles, such as Chandrasen Jadhav, Udaji Chavan, and Rao Rambha Nimbalkar, to join his side. He also attempted to create a divide between the two Maratha leaders, Shahu and Sambhaji. To plan against the Marathas without them knowing, the Nizam moved his capital from Aurangabad to Hyderabad, a more distant and secure location. When Bajirao demanded taxes like chauth and sardeshmukhi, the Nizam responded by questioning whether Shahu or Sambhaji was the true king of the Marathas. Sambhaji allied with the Nizam, forcing Bajirao to respond. On August 27, 1727, Bajirao launched attacks on several of the Nizam's territories, including Jalna, Burhanpur, and Khandesh. Seizing the opportunity, the Nizam suddenly attacked Pune and declared Sambhaji as the Maratha king. However, he had to retreat from the city, leaving Fazal Beg to defend it, as he needed to deal with Bajirao, who was plundering his lands along the Godavari River. The two armies finally met near Palkhed, about 20 miles from Daulatabad, where the Nizam was forced to seek peace and surrender. == Treaty == After the Battle of Palkhed, the Nizam had to make the following promises: * He accepted Shahu as the only true ruler of the Marathas. * He agreed that Shahu could collect chauth and sardeshmukhi taxes in the Deccan region. * The Maratha tax collectors who had been removed could return to their jobs. * The Nizam agreed to pay the unpaid chauth and sardeshmukhi taxes. == References == Category:Maratha Empire Category:Nizams of Hyderabad Category:18th-century treaties Category:18th century in India",
 "title": "Treaty of Mungi-Shevgaon"
}