{
 "id": "1161669",
 "text": "On 11 January 2025, an explosion and subsequent fire occured at a restaurant in Most, Czech Republic. It killed seven people and injured seven others, two critically. == Explosion and fire == On 11 January 2025, around 23:15 (local time) an explosion and subsequent fire occured at a restaurant U Kojota on Františka Halase Street in Most, Czech Republic. The accident was probably caused by an overturned gas heater on the restaurant's terrace, which led to the explosion of a propane-butane cylinder and the subsequent fire. According to witnesses there was a rapid spread of the fire after the explosion. After the fire department was called at 23:17, they arrived at the scene within six minutes. One person was saved out of the restaurant in critical condition. A total of 90 firefighters from 19 units went to the scene. Around thirty people were evacuated from the restaurant and a neighboring house. There were high flames, and during the fire several other propane-butane cylinders exploded. The fire was under control shortly after 01:00am the next morning. The restaurant's wooden terrace, which was damaged, was demolished. A facade of a neighbouring house was also damaged. The fire brigade went back to their base during the evening on 12 January 2025. ==Victims== Seven people died and seven people were injured. One member of the volunteer unit was injured. Six patients were moved to specialized hospitals, three of them in critical condition. A special Disaster Victim Identification team (DVI) consisting of anthropologists, geneticists and other experts was needed to identify the victims. The 7th victim died in hospital 3 days later.https://zpravy.aktualne.cz/domaci/pozar-most-sedma- obet/r~565fea8ed31111efb589ac1f6b220ee8/ ==Investigation== According to witnesses and the fire department, the gas heater was mishandled, which caused the explosion and the rapid spread of the fire. The police started an investigating into the incident as a general threat due to negligence. Criminal investigators investigated the scene. The intersection of František Halas and Zdeněk Fibich Streets remained closed throughout the day. A terrorist attack was ruled out. ==Aftermath== In the morning of 12 January 2025, Interior Minister Vít Rakušan, visited the disaster scene. He described the event as \"devastating\". Governor Richard Brabec of the Ústí nad Labem Region announced that there will be inspection of gas heaters in public places in the region to prevent similar accidents. The city of Most and the Ústí nad Labem Region are preparing financial assistance. == References == Category:2020s in the Czech Republic Category:2020s explosions Category:January 2025 events Category:2025 disasters in Europe Category:Explosions in Europe Category:Building and structure fires in Europe Category:Ústí nad Labem Region",
 "title": "2025 Most restaurant explosion"
}