{
 "id": "1161430",
 "text": "The Marikina River is a waterway in eastern Metro Manila, Philippines. It is the largest tributary of the Pasig River, with headwaters in the Sierra Madre mountain range in what was known as Montalban, presently the municipality of Rodriguez, Rizal. The Marikina River was an important transport route during the Spanish colonial era, but its importance as a transport route was diminished at the onset of the Philippines' national highway system. The dearth of river boat traffic and deforestation of the upland areas in what is now the Upper Marikina River Basin Protected Landscape (UMRBPL) contributed to the river's siltation, which reduced its value as a transport route. ==The Marikina River system== In the Pamitinan Protected Landscape located in Sitio Wawa, Brgy. San Rafael, in Rodriguez, the Marikina River is dammed by Wawa Dam, a structure built during the early 1900s to provide water for Manila. From Rodriguez, the river flows through San Mateo then to its namesake city of Marikina. In Pasig, the river meets the gates of the Manggahan Floodway, a controlled waterway used to prevent flooding in Manila during heavy rains by diverting most of the water of the Marikina towards Laguna lake instead of the Pasig River. Located downstream is the confluence of the Marikina and Pasig rivers. The river's depth ranges from and spans from . It has a total area of nearly and is long.The riverbank has an elevation of 8 meters above sea level at the boundary of San Mateo and Marikina. This slowly falls to an elevation of around before the Malanday and Santo Niño boundary. The lowest elevation is along Calumpang which above sea level. ==Ecology== Due to neglect and uncontrolled industrial waste, rising pollution of the river had caused alarm that national and local administrations seek to repair. The Marikina River is on a verge of ecological imbalance as a strange species of fish has dominated its ecosystem. Since the late 1990s, the Marikina River has been dwelt by janitor fish. Before, the river was thriving with the local species martiniko, ayungin and biya. The growing fish population had prompted the city government to launch a new program to control their number. The city issued Ordinance 004, series of 2007, launching the Janitor Fish Eradication Drive in the city of Marikina, granting cash incentives to participants, appropriating annually for this purpose. A scientific study of the species found in five locations in the Laguna de Bay tributary system, including the Marikina River, revealed that the specimen of janitor fish previously reported as Hypostomus plecostomus actually belongs to the genus Pterygoplichthys, family Loricariidae. The collected specimens for this study consisted of two species: Pterygoplichthys disjunctivus and Pterygoplichthys pardalis. Both species were collected from the Marikina River. Only the species disjunctivus was collected from the Pasig River. == References== Philippines *",
 "title": "Marikina River"
}