{
 "id": "116192",
 "text": "Conference USA, officially abbreviated CUSA, is a group of college sports teams that play each other on the NCAA Division I level. It was formed in 1995 when the Great Midwest Conference and Metro Conference merged, and has added several members since then. Most of the new members have come from either the Western Athletic Conference or the Sun Belt Conference (SBC). From 2005 to 2014, it also lost many members, mostly to the original Big East Conference and its football-playing offshoot, the American Athletic Conference (The American). In a later wave of conference changes in the early 2020s, CUSA lost three members to the SBC in 2022 and six to The American in 2023. CUSA responded to these later moves by adding seven new members, with four joining in July 2023, one joining in July 2024, and two to join in July 2025. One school will leave in 2026. The conference sends several teams to bowl games every year, including the Liberty Bowl and New Orleans Bowl. Memphis (now a member of The American) has been the most successful men's basketball team in the conference, reaching the national championship game in 2008. (However, the NCAA later took Memphis's wins from that season away because a Memphis player, namely Derrick Rose, had not been eligible to play.) ==Members== Conference USA now has 10 \"full members\" which play most of their sports in the league; Liberty (which joined in 2023) is the only private school. Future member Delaware (joining in 2025) is defined as a \"privately governed, state- assisted\" school. Before 2022, the schools were split into East and West Divisions for some sports, most notably football; this allowed the football division winners to play a conference championship game. The divisional split ended with the loss of three members to the SBC. The football championship game now features the top two teams in the conference standings. School Location Founded Type (affiliation) Nickname Joined (FIU) Miami, Florida 1965 Public Panthers 2013 Jacksonville State University Jacksonville, Alabama 1883 Public Gamecocks 2023 Kennesaw State University Kennesaw, Georgia 1963 Public Owls 2024 Liberty University Lynchburg, Virginia 1971 Private Flames & Lady Flames 2023 Louisiana Tech University Ruston, Louisiana 1894 Public Bulldogs & Lady Techsters 2013 Middle Tennessee State University Murfreesboro, Tennessee 1911 Public Blue Raiders 2005 New Mexico State University Las Cruces, New Mexico 1888 Public Aggies 2023 Sam Houston State University (Sam Houston) Huntsville, Texas 1879 Public Bearkats 2023 (UTEP) El Paso, Texas 1914 Public Miners 2005 Western Kentucky University (WKU) Bowling Green, Kentucky 1906 Public Hilltoppers & Lady Toppers 2014 ===Future members=== CUSA will add two members in 2025. School Location Founded Type (affiliation) Nickname Joining Former conference Newark, Delaware 1746 Private–public hybrid Fightin' Blue Hens 2025 CAA Missouri State University Springfield, Missouri 1905 Public Bears & Lady Bears 2025 MVC ===Associate members=== CUSA now has 12 \"associate members\"—schools that are full members of another conference who play select sports in CUSA. One plays baseball, four play women's beach volleyball, six others compete in bowling (which the NCAA runs only for women), and one competes in both beach volleyball and bowling. Most of these schools became associate members in 2023, when CUSA expanded its beach volleyball membership and added bowling as a sponsored sport. CUSA added bowling by absorbing the Southland Bowling League, a single-sport conference founded by, but separate from, the all-sports Southland Conference. One of the current associates, Missouri State, will become a full member in 2025. School Location Founded Type Nickname CUSA Sport(s) Joined Main Conference Arkansas State University Jonesboro, Arkansas 1909 Public Red Wolves Bowling 2023 Sun Belt Dallas Baptist University Dallas, Texas 1898 Private Patriots Baseball 2022 Lone Star Florida Atlantic University Boca Raton, Florida 1961 Public Owls Beach volleyball 2023 American Missouri State University Springfield, Missouri 1905 Public Beach Bears Beach volleyball 2023 MVC Stephen F. Austin State University (Stephen F. Austin) Nacogdoches, Texas 1923 Public Ladyjacks Bowling 2023 Southland Tarleton State University (Tarleton) Stephenville, Texas 1899 Public Texans Beach volleyball 2023 WAC Tulane University New Orleans, Louisiana 1834 Private Green Wave Beach volleyball 2022 American Tulane University New Orleans, Louisiana 1834 Private Green Wave Bowling 2023 American (UAB) Birmingham, Alabama 199 Public Blazers Beach volleyball 2023 American Valparaiso University Valparaiso, Indiana 1859 Private Beacons Bowling 2023 MVC Vanderbilt University Nashville, Tennessee 1873 Private Commodores Bowling 2023 SEC Wichita State University Wichita, Kansas 1895 Public Shockers Bowling 2024 American Youngstown State University Youngstown, Ohio 1908 Public Penguins Bowling 2023 Horizon ;Notes: ===Former full members=== No fewer than 23 schools have left CUSA since it was founded. Of these schools, 11 are now members of the American Athletic Conference. Three others had been in The American before joining the Big 12 Conference in 2023, and another left The American for the Atlantic Coast Conference in 2024. School Location Founded Type Nickname Joined Left Current Conference (Charlotte) Charlotte, North Carolina 1946 Public 49ers 1995, 2013 2023 Cincinnati, Ohio 1819 Public Bearcats 1995 2005 Big 12 DePaul University Chicago, Illinois 1898 Private Blue Demons 1995 2005 Big East East Carolina University Greenville, North Carolina 1907 Public Pirates 2001 2014 Florida Atlantic University Boca Raton, Florida 1961 Public Owls 2013 2023 Houston, Texas 1907 Public Cougars 1996 2013 Big 12 Louisville, Kentucky 1798 Public Cardinals 1995 2005 ACC Marshall University Huntington, West Virginia 1837 Public Thundering Herd 2005 2022 Sun Belt Marquette University Milwaukee, Wisconsin 1881 Private Golden Eagles 1995 2005 Big East Memphis, Tennessee 1912 Public Tigers 1995 2013 Denton, Texas 1890 Public Mean Green 2013 2023 Old Dominion University Norfolk, Virginia 1930 Public Monarchs 2013 2022 Sun Belt Rice University Houston, Texas 1912 Private Owls 2005 2023 Saint Louis University St. Louis, Missouri 1818 Private Billikens 1995 2005 Atlantic 10 (SMU) University Park, Texas 1911 Private Mustangs 2005 2013 ACC Tampa, Florida 1956 Public Bulls 1995 2005 Hattiesburg, Mississippi 1910 Public Golden Eagles 1995 2022 Sun Belt (TCU) Fort Worth, Texas 1873 Private Horned Frogs 2001 2005 Big 12 Tulane University New Orleans, Louisiana 1834 Private Green Wave 1995 2014 Tulsa, Oklahoma 1894 Private Golden Hurricane 2005 2014 (UAB) Birmingham, Alabama 1969 Public Blazers 1995 2023 (UCF) Orlando, Florida 1963 Public Knights 2005 2013 Big 12 (UTSA) San Antonio, Texas 1969 Public Roadrunners 2013 2023 ==Former associate members== In addition to the former full members, 21 other schools have been associate members in the past, but have moved their CUSA sports elsewhere. Most notably, the United States Military Academy, more often called \"Army\" in a sports context, was a football member from 1996 to 2005 (final CUSA season in 2004). ==References== * Category:1995 establishments in the United States",
 "title": "Conference USA"
}