{
 "id": "1161651",
 "text": "The 2012-13 Austrian football championship was the 102nd season of a top Austrian league and the 39th under the name Bundesliga. The league was played by ten teams. They determined the Austrian football champions in four rounds. In the 2012-13 season, as in previous years, ten clubs competed against each other in a total of 36 rounds. Each team played twice at home and away against every other team. FK Austria Wien secured the championship title for the 24th time. The Bundesliga was sponsored by the sports betting provider tipp3 as the main sponsor. The subsponsor is the mobile phone provider T-Mobile Austria. The official league name is tipp3-Bundesliga powered by T-Mobile. ==Final table== Pl. Name M W D L P 1\\. FK Austria Wien 36 25 7 4 82 2\\. FC Red Bull Salzburg 36 22 11 3 77 3\\. SK Rapid Wien 36 16 9 11 57 4\\. SK Sturm Graz 36 13 9 14 48 5\\. Wolfsberger AC 36 12 11 13 47 6\\. SV Ried 36 13 7 16 46 7\\. SC Wiener Neustadt 36 9 9 18 36 goal difference -28 8\\. FC Wacker Innsbruck 36 11 3 22 36goal difference -34Even with a better goal difference, Wacker Innsbruck would have been behind Wiener Neustadt because of the abandonment of the game against Sturm Graz in the 17th round. 9\\. FC Admira Wacker Mödling 36 9 8 19 33goal difference -21 10\\. SV Mattersburg 36 9 8 19 33goal difference -31 Austria Soccer ==Matches == Austria Soccer ===Round 1=== Date Team 1 Team2 21 July 2012 SK Rapid Wien FC Wacker Innsbruck 4-0 21 July 2012 SV Mattersburg SC Wiener Neustadt 2-0 21 July 2012 SK Sturm Graz FC Red Bull Salzburg 0-2 22 July 2012 Admira-Wacker Mödling SV Ried 0-2 25 July 2012 Wolfsberger AC FK Austria Wien 0-1 ===Round 2=== Date Team 1 Team2 28 July 2012 FK Austria Wien' SK Sturm Graz 0-1 28 July 2012 FC Red Bull Salzburg SV Mattersburg 3-2 28 July 2012 SC Wiener Neustadt SK Rapid Wien' 0-1 29 July 2012 SV Ried Wolfsberger AC 0-2 29 July 2012 FC Wacker Innsbruck Admira-Wacker Mödling 1-2 ===Round 3=== Date Team 1 Team2 4 August 2012 SV Mattersburg SK Sturm Graz 3-1 4 August 2012 Wolfsberger AC FC Red Bull Salzburg 0-2 5 August 2012 Admira-Wacker Mödling SC Wiener Neustadt 4-0 5 August 2012 SK Rapid Wien FK Austria Wien 0-3 5 August 2012 SV Ried FC Wacker Innsbruck 2-0 ===Round 4=== Date Team 1 Team2 11 August 2012 SK Sturm Graz Wolfsberger AC 4-1 11 August 2012 FC Wacker Innsbruck SV Mattersburg 2-1 12 August 2012 FK Austria Wien Admira-Wacker Mödling 1-0 12 August 2012 FC Red Bull Salzburg SK Rapid Wien 0-2 12 August 2012 SC Wiener Neustadt SV Ried 2-3 ===Round 5=== Date Team 1 Team2 18 August 2012 Admira- Wacker Mödling FC Red Bull Salzburg 4-4 18 August 2012 SK Rapid Wien SK Sturm Graz 3-0 18 August 2012 FC Wacker Innsbruck SC Wiener Neustadt 2-3 18 August 2012 Wolfsberger AC SV Mattersburg 0-1 19 August 2012 SV Ried FK Austria Wien 0-1 ===Round 6=== Date Team 1 Team2 25 August 2012 FK Austria Wien FC Wacker Innsbruck 2-0 25 August 2012 FC Red Bull Salzburg SC Wiener Neustadt 1-1 25 August 2012 SV Mattersburg SV Ried 2-1 25 August 2012 SK Sturm Graz Admira- Wacker Mödling 3-2 26 August 2012 Wolfsberger AC SK Rapid Wien 1-0 ===Round 7=== Date Team 1 Team2 1 September 2012 Admira-Wacker Mödling Wolfsberger AC 1-1 1 September 2012 SC Wiener Neustadt FK Austria Wien 0-2 1 September 2012 SV Ried SK Sturm Graz 0-1 1 September 2012 FC Wacker Innsbruck FC Red Bull Salzburg 0-4 2 September 2012 SK Rapid Wien SV Mattersburg 3-0 ===Round 8=== Date Team 1 Team2 15 September 2012 FC Red Bull Salzburg SV Ried 1-1 15 September 2012 SK Rapid Wien Admira-Wacker Mödling 0-0 15 September 2012 SK Sturm Graz FC Wacker Innsbruck 3-0 15 September 2012 Wolfsberger AC SC Wiener Neustadt 6-0 16 September 2012 SV Mattersburg FK Austria Wien 2-4 ===Round 9=== Date Team 1 Team2 22 September 2012 FK Austria Wien FC Red Bull Salzburg 0-1 22 September 2012 Admira-Wacker Mödling SV Mattersburg 5-1 22 September 2012 SC Wiener Neustadt SK Sturm Graz 1-1 22 September 2012 FC Wacker Innsbruck Wolfsberger AC 0-1 23 September 2012 SV Ried SK Rapid Wien 0-2 ===Round 10=== Date Team 1 Team2 29 September 2012 FK Austria Wien Wolfsberger AC 1-1 29 September 2012 SC Wiener Neustadt SV Mattersburg 0-0 29 September 2012 SV Ried Admira-Wacker Mödling 1-1 29 September 2012 FC Wacker Innsbruck SK Rapid Wien 0-2 30 September 2012 FC Red Bull Salzburg SK Sturm Graz 3-2 ===Round 11=== Date Team 1 Team2 6 October 2012 Admira-Wacker Mödling FC Wacker Innsbruck 4-1 6 October 2012 SV Mattersburg FC Red Bull Salzburg 1-3 6 October 2012 Wolfsberger AC SV Ried 2-5 7 October 2012 SK Rapid Wien SC Wiener Neustadt 1-1 7 October 2012 SK Sturm Graz FK Austria Wien 1-1 ===Round 12=== Date Team 1 Team2 20 October 2012 FC Red Bull Salzburg Wolfsberger AC 4-1 20 October 2012 SC Wiener Neustadt Admira-Wacker Mödling 2-1 20 October 2012 SK Sturm Graz SV Mattersburg 0-0 20 October 2012 FC Wacker Innsbruck SV Ried 1-0 21 October 2012 FK Austria Wien SK Rapid Wien 2-0 ===Round 13=== Date Team 1 Team2 27 October 2012 Admira-Wacker Mödling FK Austria Wien 4-6 27 October 2012 'SV Ried SC Wiener Neustadt 3-1 27 October 2012 SV Mattersburg FC Wacker Innsbruck 1-2 28 October 2012 SK Rapid Wien FC Red Bull Salzburg 2-0 27 November 2012 Wolfsberger AC SK Sturm Graz 1-1The original game from October 27, 2012 was abandoned in the 62nd minute due to rain. ===Round 14=== Date Team 1 Team2 3 November 2012 FC Red Bull Salzburg Admira-Wacker Mödling 5-0 3 November 2012 SV Mattersburg Wolfsberger AC 1-1 3 November 2012 SK Sturm Graz SK Rapid Wien 2-1 3 November 2012 SC Wiener Neustadt FC Wacker Innsbruck 0-1 4 November 2012 FK Austria Wien SV Ried 6-1 ===Round 16=== Date Team 1 Team2 17 November 2012 FK Austria Wien SC Wiener Neustadt 3-0 17 November 2012 SV Mattersburg SK Rapid Wien 0-3 17 November 2012 SK Sturm Graz SV Ried 3-1 17 November 2012 Wolfsberger AC Admira-Wacker Mödling 1-1 18 November 2012 FC Red Bull Salzburg FC Wacker Innsbruck 2-0 ===Round 17=== Date Team 1 Team2 24 November 2012 FK Austria Wien SV Mattersburg 3-1 24 November 2012 SC Wiener Neustadt Wolfsberger AC 2-1 24 November 2012 SV Ried FC Red Bull Salzburg 3-1 24 November 2012 FC Wacker Innsbruck SK Sturm Graz 0-1 The game was abandoned in the 91st minute after objects were thrown at the linesman from the spectators and this continued despite the interruption. On 24 November 2012 verified with a 0:3. 25 November 2012 Admira-Wacker Mödling SK Rapid Wien 0-2 ===Round 18=== Date Team 1 Team2 1 December 2012 SK Rapid Wien SV Ried 4-3 1 December 2012 SV Mattersburg Admira-Wacker Mödling 3-0 1 December 2012 SK Sturm Graz SC Wiener Neustadt 3-1 1 December 2012 Wolfsberger AC FC Wacker Innsbruck 0-0 2 December 2012 FC Red Bull Salzburg FK Austria Wien 0-0 ===Round 19=== Date Team 1 Team2 8 December 2012 Admira-Wacker Mödling SV Ried 0-3 8 December 2012 SV Mattersburg SC Wiener Neustadt 1-0 8 December 2012 SK Sturm Graz FC Red Bull Salzburg 1-1 8 December 2012 Wolfsberger AC FK Austria Wien 3-6 9 December 2012 SK Rapid Wien FC Wacker Innsbruck 2-1 ===Round 20=== Date Team 1 Team2 15 December 2012 FC Red Bull Salzburg SV Mattersburg 7-0 15 December 2012 SC Wiener Neustadt SK Rapid Wien 1-0 15 December 2012 FC Wacker Innsbruck Admira-Wacker Mödling 3-1 16 December 2012 FK Austria Wien SK Sturm Graz 3-1 20 February 2013 SV Ried Wolfsberger AC 1-1 ===Round 21=== Date Team 1 Team2 16 February 2013 Admira-Wacker Mödling SC Wiener Neustadt 1-2 16 February 2013 SV Mattersburg SK Sturm Graz 0-0 16 February 2013 SV Ried FC Wacker Innsbruck 3-0 17 February 2013 FK Austria Wien SK Rapid Wien 1-2 6 March 2013 Wolfsberger AC FC Red Bull Salzburg 1-1 ===Round 22=== Date Team 1 Team2 23 February 2013 FK Austria Wien Admira-Wacker Mödling 4-0 23 February 2013 SC Wiener Neustadt SV Ried 0-0 23 February 2013 SK Sturm Graz Wolfsberger AC 1-3 23 February 2013 FC Wacker Innsbruck SV Mattersburg 2-0 24 February 2013 FC Red Bull Salzburg SK Rapid Wien 3-3 ===Round 23=== Date Team 1 Team2 27 February 2013 SK Rapid Wien SK Sturm Graz 1-1 27 February 2013 SV Ried FK Austria Wien 1-3 27 February 2013 FC Wacker Innsbruck SC Wiener Neustadt 1-0 13 March 2013 Admira-Wacker Mödling FC Red Bull Salzburg 1-1 13 March 2013 Wolfsberger AC SV Mattersburg 1-0 ===Round 24=== Date Team 1 Team2 2 March 2013 FK Austria Wien FC Wacker Innsbruck 4-0 2 March 2013 FC Red Bull Salzburg SC Wiener Neustadt 3-1 2 March 2013 SV Mattersburg SV Ried 1-0 2 March 2013 SK Sturm Graz Admira-Wacker Mödling 1-2 3 March 2013 Wolfsberger AC SK Rapid Wien 2-1 ===Round 25=== Date Team 1 Team2 9 March 2013 Admira-Wacker Mödling Wolfsberger AC 0-1 9 March 2013 SK Rapid Wien SV Mattersburg 2-2 9 March 2013 SC Wiener Neustadt FK Austria Wien 0-0 9 March 2013 SV Ried SK Sturm Graz 1-2 10 March 2013 FC Wacker Innsbruck FC Red Bull Salzburg 2-3 ===Round 26=== Date Team 1 Team2 16 March 2013 FC Red Bull Salzburg SV Ried 2-2 16 March 2013 SK Rapid Wien Admira-Wacker Mödling 1-1 16 March 2013 SK Sturm Graz FC Wacker Innsbruck 3-2 16 March 2013 Wolfsberger AC SC Wiener Neustadt 1-1 17 March 2013 SV Mattersburg FK Austria Wien 0-4 ===Round 27=== Date Team 1 Team2 30 March 2013 Admira-Wacker Mödling SV Mattersburg 1-0 30 March 2013 SC Wiener Neustadt SK Sturm Graz 1-0 30 March 2013 SV Ried SK Rapid Wien 3-2 30 March 2013 FC Wacker Innsbruck Wolfsberger AC 2-3 31 March 2013 FK Austria Wien FC Red Bull Salzburg 1-1 ===Round 28=== Date Team 1 Team2 6 April 2013 FK Austria Wien Wolfsberger AC 0-4 6 April 2013 SC Wiener Neustadt SV Mattersburg 0-0 6 April 2013 SV Ried Admira-Wacker Mödling 4-1 6 April 2013 FC Wacker Innsbruck SK Rapid Wien 1-1 7 April 2013 FC Red Bull Salzburg SK Sturm Graz 3-0 ===Round 29=== Date Team 1 Team2 13 April 2013 Admira-Wacker Mödling FC Wacker Innsbruck 4-3 13 April 2013 SK Rapid Wien SC Wiener Neustadt 2-0 13 April 2013 SV Mattersburg FC Red Bull Salzburg 1-2 13 April 2013 Wolfsberger AC SV Ried 1-3 14 April 2013 SK Sturm Graz FK Austria Wien 1-1 ===Round 30=== Date Team 1 Team2 20 April 2013 FC Red Bull Salzburg Wolfsberger AC 6-2 20 April 2013 SC Wiener Neustadt Admira-Wacker Mödling 3-0 20 April 2013 SK Sturm Graz SV Mattersburg 2-2 20 April 2013 FC Wacker Innsbruck SV Ried 2-0 21 April 2013 FK Austria Wien SK Rapid Wien 2-2 ===Round 31=== Date Team 1 Team2 27 April 2013 SK Rapid Wien FC Red Bull Salzburg 1-3 27 April 2013 SV Mattersburg FC Wacker Innsbruck 1-2 27 April 2013 SV Ried SC Wiener Neustadt 2-1 27 April 2013 Wolfsberger AC SK Sturm Graz 3-0 28 April 2013 Admira-Wacker Mödling FK Austria Wien 0-2 ===Round 32=== Date Team 1 Team2 4 May 2013 FK Austria Wien SV Ried 3-1 4 May 2013 FC Red Bull Salzburg Admira-Wacker Mödling 2-1 4 May 2013 SC Wiener Neustadt FC Wacker Innsbruck 2-2 4 May 2013 SV Mattersburg Wolfsberger AC 3-1 5 May 2013 SK Sturm Graz SK Rapid Wien 0-2 ===Round 33=== Date Team 1 Team2 11 May 2013 Admira-Wacker Mödling SK Sturm Graz 3-0 11 May 2013 SK Rapid Wien Wolfsberger AC 0-0 11 May 2013 SV Ried SV Mattersburg 1-1 11 May 2013 FC Wacker Innsbruck FK Austria Wien 0-3 12 May 2013 SC Wiener Neustadt FC Red Bull Salzburg 0-6 ===Round 34=== Date Team 1 Team2 18 May 2013 FK Austria Wien SC Wiener Neustadt 3-1 18 May 2013 FC Red Bull Salzburg FC Wacker Innsbruck 3-1 18 May 2013 SV Mattersburg SK Rapid Wien 2-0 18 May 2013 Wolfsberger AC Admira-Wacker Mödling 0-0 19 May 2013 SK Sturm Graz SV Ried 3-1 ===Round 35=== Date Team 1 Team2 22 May 2013 FK Austria Wien SV Mattersburg 4-0 22 May 2013 SV Ried FC Red Bull Salzburg 2-2 22 May 2013 Admira-Wacker Mödling SK Rapid Wien 0-2 22 May 2013 SC Wiener Neustadt Wolfsberger AC 2-0 22 May 2013 FC Wacker Innsbruck SK Sturm Graz 2-1 ===Round 36=== Date Team 1 Team2 26 May 2013 FC Red Bull Salzburg FK Austria Wien 3-0 26 May 2013 SK Rapid Wien SV Ried 3-0 26 May 2013 SV Mattersburg Admira-Wacker Mödling 0-1 26 May 2013 SK Sturm Graz SC Wiener Neustadt 0-3 26 May 2013 Wolfsberger AC FC Wacker Innsbruck 2-3 == Champion squad == (Matches/goals) * Roland Linz and Georg Margreitter left the club during the season. ==Top scorer== Name Club Goals Philipp Hosiner FK Austria Wien 32 Jonathan Soriano FC Red Bull Salzburg 26 Sadio Mané FC Red Bull Salzburg 16 Austria Soccer ==References== Category:Football in Austria Category:Football seasons",
 "title": "2012-13 Austrian football championship"
}