{
 "id": "1161674",
 "text": "Cees Bakker also written as Kees Bakker (1939 – 10 January 2025) was a Dutch politician. He was a member of the Christian Democratic Appeal. He was mayor from 1978 to 2004. ==Biography== Bakker, grew up near the mill complex in Streefkerk. On 1 January 1956 he started working at the municipal secretariat of Streefkerk and became eleven years later municipal clerk. In October 1978 he was appointed mayor and municipal secretary of the municipalities of Ameide and Tienhoven as successor of Dirk Wessels, who had died a year earlier. From September 1982 he was also acting mayor of Giessenburg and Schelluinen. On 1 January 1986, after several municipal reorganisations, Tienhoven and Ameide merged with several other municipalities to form the municipality of Zederik while Giessenburg and Schelluinen merged with several other municipalities to form the municipality of Giessenlanden. Bakker became the mayor of the municipality of Giessenlanden. On 1 March 2004 he retired there and became acting mayor of Liesveld, until Gert-Jan Kats became the mayor later the year. Bakker joined the board of the \"Foundation for the Maintenance of Mills in the Alblasserwaard and Vijfheerenlanden\" Stichting tot Instandhouding van Molens in de Alblasserwaard en de Vijfheerenlanden (SIMAV) in 1972. From 1982 was the chairman for several decades. He was also chairman of the \"Stichting Boerderij & Erf\" (Farm & Yard Foundation) for thirteen years, to preserve (historical) farms in the region. For his works for the mills in the Alblasserwaard and Vijfheerenlanden, millers presented him a bench in 2013 near a mill in Streefkerk. Bakker also received the highest provincial award of South Holland, the \"Gouden Lis\". Bakker died on 10 January 2025, at the age of 85. ==References== ==Other websites== *Bakker at Historical Society Ameide and Tienhoven Category:1939 births Category:2025 deaths Category:Politicians from South Holland Category:Place of death missing Category:Dutch mayors",
 "title": "Cees Bakker"
}