{
 "id": "1161748",
 "text": "India, officially the Republic of India is a country in South Asia, consisting of 28 states and eight union territories. All Indian states and some of the union territories have their own elected government and the union territories come under the jurisdiction of the Central Government. India has its own national symbols. Apart from the national symbols, the states and union territories have adopted their own seals and symbols including Festivals listed below. == Statewide festivals == List of Indian state festivals State Common name Binomial name Image IUCN category Andhra Pradesh Ahobilam Paruveta Utsavam Ahobilam Paruveta Utsavam Arunachal Pradesh Losar festival Tibetan New Year Assam Bihu Assamese festival Bihar Chhath Puja Chhath Puja/Bihari festival Chhattisgarh Bastar Dussehra Bastar Dussehra/Chhattisgarhi festival Goa Novidade Novidade/Konnos Gujarat Kavant Mela Kavant Mela Haryana Vaisakhi Jathera worship (Jathera Pujan) Vaisakhi Himachal Pradesh Spring festival (India) Vasantotsava/Pipal Jatra Jharkhand Bhagta Parab Bhagta Parab Karnataka Mysore Dasara Mysore Dasara/Kannadiga festival Kerala Onam Onam/Malayali festival Madhya Pradesh Bhagoria Haat Bhagoria Haat Maharashtra Dahi Handi Gopal Kala/Utlotsavam Manipur Yaosang Yaoshang/Thabal chongba Meghalaya Mawkynting Mawkynting Mizoram Chapchar Kut Chapchar Kut/Mizo festival Nagaland Hornbill Festival Naga-Hornbill festival Odisha Ratha Yatra Ratha Yatra Punjab Lohri, Jathera Pujan Lohri/Punjabi festival Rajasthan Gangaur Gangaur Sikkim Losar Losar/Sikkimese festival Tamil Nadu Pongal (festival) Pongal/Tamil festival Telangana Bathukamma Bathukamma Tripura Buisu Buisu festival Uttar Pradesh Ramlila Ramlila festival Uttarakhand Phool Dei Phool Dei West Bengal Durga Puja Durga Puja == Union territories == List of Indian state festivals (Union territories) Union territory Common name Binomial name Image IUCN category Andaman and Nicobar Islands Chandigarh Delhi Basant-festival Basant- festival Kite-flying Lakshadweep Puducherry ==References== State Festivals Indian state festivals State Festivals Festivals Festivals",
 "title": "List of Indian state festivals"
}