{
 "id": "1161288",
 "text": "Santa Mesa is a district in Manila, Philippines. It is surrounded by the Pasig River on the southwestern side, and by the San Juan River on its southern and eastern side. Land borders include the districts of San Miguel to the west and Sampaloc to the north; and to the northeast is Quezon City. Santa Mesa was formerly a part of the Sampaloc district, from which it was partitioned and separated after having its own parish in 1911. The parish is now known as Old Sta. Mesa, which extends from Victorino Mapa Street (old name: Calle Santa Mesa) to Magsaysay Boulevard (old name: Santa Mesa Boulevard). ==Etymology== The district's name was coined by the Jesuits, who christened the area 'Hermandad de Santa Mesa de la Misericordia' (trans: \"Brotherhood of the Holy Table of Mercy\"). The matriarch of the Tuason family, Doña Albina Tuason, who owned vast tracts of land of Santa Mesa during the Spanish colonial period (1521–1898) offered an 'obra pía' (trans:\"pious work\"), and donated the area where the district's parish church now stands. Affluent families where attracted to Santa Mesa's cooler climate and the picturesque streets that were lined with ylang-ylang trees along Santa Mesa Boulevard. The abundance of these trees started a perfume industry in Santa Mesa — as flowers were harvested, pressed, and their fragrant oil exported in great quantities to perfumeries in France. == History == Up until the early American colonial period (1898–1946), Santa Mesa was one of the barrios that comprised Sampaloc, which was a town of the defunct province of Manila before it was absorbed by the City of Manila upon its chartering in 1901. In 1911, Santa Mesa became a separate religious district out of Sampaloc when the first and oldest parish in the Philippines in honor of its titular patron, the Sacred Heart of Jesus, was established. The created parish is known today as the Old Santa Mesa. The neighborhood was a wealthy enclave of aristocratic Spanish and Filipino families who built summer houses, examples of which are the Sociego Mansion, former home of the Tuason family; and the Carriedo Mansion (currently known as the Antique House), former home of Governor General Francisco Carriedo y Peredo who spearheaded the clean water system of the City of Manila. When the congressional districts of Manila were created, Santa Mesa was effectively separated from Sampaloc, falling to the jurisdiction of the 6th District. The Philippines' national census, however, still considers Santa Mesa as a part of Sampaloc for statistical purposes. == References== Category:Settlements in Manila Category:Districts of Manila",
 "title": "Santa Mesa"
}