{
 "id": "1161571",
 "text": "Obstructed hemivagina and ipsilateral renal anomaly (OHVIRA or OHVIRA syndrome), also known as Herlyn–Werner–Wunderlich syndrome, is a very rare genetic disorder. ==Overview== The OHVIRA affects the way women develop their genitalia. People with OHVIRA have two vaginas, two uteruses, and one kidney. Symptoms include pain in the abdomen and pelvis, and issues with menstrual cycles or fertility. About one in one million women have OHVIRA and it is usually diagnosed during puberty. ==Symptoms== The symptoms of OHVIRA are broad and vary. There is no general criteria for a diagnosis. Most of those with the disorder have pains in their abdomen or pelvis. This pain often comes during menstruation. They may have issues with urination and have discharge (liquid substance) coming out of the vagina. Issues with fertility are common. Unusual menstrual cycles, such as bleeding too much or too little, is also common. Many people with OHVIRA have more painful menstrual cycles. Some may also have vomiting, constipation, or fevers. People with OHVIRA who get pregnant usually have high-risk pregnancies. They may have bleeding in their genitals and need to be hospitalized. ==Diagnosis== Most people with OHVIRA are diagnosed in puberty when symptoms, such as pain with menstrual cycles, begin. An ultrasound or MRI is usually used to look at their uterus and vagina. ==Treatment== Many of those with OHVIRA will get a vaginoplasty. This is a surgery that fixes and repairs the vagina. Another type of surgery is laparoscopic hemi hysterectomy. This surgery removes one of the two uteruses. This type of surgery is usually safer and more effective. If someone is diagnosed late and does not get treatment right away, then they may develop problems like infertility, endometriosis, pyometra, or pelvic inflammatory disease. ==Prevalence== About one in one million females are estimated to have OHVIRA. ==References== Category:Syndromes Category:Genetic disorders",
 "title": "OHVIRA"
}