{
 "id": "1161684",
 "text": "Balaji Vishwanath Bhat (1 January 1662 – 12 April 1720) was the first Peshwa from the Bhat family. He started a line of Peshwas who became powerful leaders of the Maratha Empire in the early 1700s. Balaji Vishwanath helped King Shahu, a young Maratha ruler, strengthen his rule over the kingdom. The kingdom had been weakened by a civil war and attacks from the Mughal emperor Aurangzeb. Balaji Vishwanath is also known as the Second Founder of the Maratha State. == Early life == Balaji Vishwanath Bhat was born into a Marathi Chitpavan Brahmin family. He left home to find work in the upper regions of the Western Ghats. He worked as a mercenary soldier for different Maratha generals. He joined the Maratha administration during the rule of Sambhaji or during the time his brother Rajaram was regent. Later, he became an accountant for Dhanaji Jadhav, a Maratha general, at Janjira. == Early Career == After Shivaji's death, his sons Sambhaji and Rajaram carried on the Maratha struggle against the Mughal Empire. In 1686, Emperor Aurangzeb came to the Deccan, determined to crush the growing Maratha state. He spent the next 27 years fighting nonstop battles with the Marathas. During this time, Sambhaji was executed, and Rajaram died young. However, Rajaram's widow, Tarabai, continued the fight, even though Sambhaji's young son, Shahu, had been captured and held by the Mughals. Aurangzeb passed away in Ahmednagar in 1707 at the age of 88. By then, the Mughal army was worn out, and the empire’s treasury was empty. After his death, a war broke out over who would succeed him, and his son, the elderly Prince Mu'azzam, eventually became the new emperor, taking the title Bahadur Shah. Tarabai sent Maratha general Dhanaji Jadhav to attack Shahu, but Dhanaji's aide, Balaji Vishwanath, secretly met Shahu and convinced Dhanaji to support him. At Khed in Pune District, Dhanaji declared Shahu the rightful Maratha ruler. After Dhanaji Jadhav’s death in 1708, Shahu made Chandrasen Jadhav Senapati. However, Chandrasen’s rivalry with Balaji Vishwanath led him to ally with Tarabai and attack Balaji, who fled to Pandavgad and sought Shahu’s help. When summoned by Shahu, Chandrasen defied him and joined Tarabai in 1711. With his generals defecting and his position weak, Shahu turned to Balaji Vishwanath, who raised a new army and was honored with the title of Senakarte on August 20, 1711. == Selection as the Peshwa == During the conflict between Tarabai and Shahu, Kanhoji Angre took the chance to free himself from their control. He captured Kalyan and nearby forts like Rajmachi and Lohagad. Shahu sent Peshwa Bahiroji Pingale to stop him, but Kanhoji defeated Pingale, imprisoned him, and moved toward Satara. Shahu then sent Balaji Vishwanath to handle Kanhoji. Instead of fighting, Balaji negotiated with Kanhoji at Lonavala and convinced him to join Shahu’s side as the admiral of the Maratha navy. Together, they attacked the Siddis of Janjira, capturing much of the Konkan coast, including Balaji’s birthplace, Shrivardhan. Impressed by Balaji’s success, Shahu dismissed Pingale and made Balaji the Peshwa on 16 November 1713. == Death == Balaji Vishwanath returned to Satara from Delhi, freeing Shahu’s mother Yesubai, wife Savitribai, and half-brother Madan Singh from Mughal captivity. Tired and unwell, he retired to Saswad near Pune in October 1719. He passed away on 12 April 1720 and was succeeded as Peshwa by his son, Bajirao I. == References == Category:Maratha Empire Category:17th-century births Category:18th-century deaths",
 "title": "Balaji Vishwanath"
}