{
 "id": "1161384",
 "text": "The Adventures of Little Brown Bear () is a French animated children's television series loosely based on the 1975 children's book Little Brown Bear by Danièle Bour and Claude Lebrun. The series ran between 20 October 2003 to 12 January 2004 and aired on France 5, each contains 52 episodes with the series aimed at 3-to-7-years-old children. ==Premise== The series is about Little Brown Bear, who experiences his very first adventures with the little ones and learns lessons on the way. ==Characters== ===Major=== * Little Brown Bear (voiced by Antoine Bonnaire in French, Jules de Jongh in North America, and Regina Candler in the UK) is a 3-year-old French-accented brown cub who indeeds to have fun and causes misunderstanding. He has brown eyes with black pupils, he wears a red sweater with blue pants and green shoes. * Mr. Brown Bear (voiced by Tony Clarke Hill in English and Pierre Forest in French) is Brown Bear's father. He has brown eyes with black pupils, he wears a yellow sweater, orange pants, yellow socks, and orange shoes. * Mrs. Brown Bear (voiced by Joanna Ruiz in English and Ivana Coppola in French) is Brown Bear's mother. She has blue eyes with black pupils, she wears a yellow collared shirt, blue dress, and red slippers. ===Others=== * Baby Gray Bear is an infant cub. He has gray eyes with black pupils and wears bluish colored clothes. * Bertha Bear is a female gray bear and preschool teacher. * Black Bear * Little Gold Bear (voiced by Jules de Jongh in English) is Brown Bear's boyfriend. He has brown eyes with black pupils, he wears a green collared shirt, blue pants, orange socks, and lime socks. * Little Gray Bear (voiced by Jules de Jongh in English) is Brown Bear's girlfriend. She has blue eyes with black pupils, she wears a purple sleeved shirt with white lace and blue overalls, white socks, and blue shoes. * Mrs. Gray Bear (voiced by TBA) is a gray female bear. She has gray eyes with black pupils, she wears an orange shirt, purple pants, and blue shoes. * Narrator (voiced by Isabelle Giami in French and Joanna Ruiz in English) is a female narrator who narrates each episode. ==Broadcast== The series aired on France 5 on 20 October 2003 to 12 January 2004 with reruns airing until 26 August 2022, in the series Les Zouzous then in the programs Ludo Zouzous, Zouzous and Okoo, but also on France 3 in the series France Truc on July 5, 2005 and Playhouse Disney and Disney Junior. In acquiring broadcast, in Quebec (September 13, 2004 on Télé- Québec), the Arab world (January 25, 2008 on Toyor Al-Janah, 2009 on Baraem, and 2017 on Gulli Bil Arabi). On May 17, 2021, the English YouTube channel is founded. ==Reception and controversy== On September 28, 2024, the once- completely obscure The Adventures of Little Brown Bear has receiving heavy bashing aimed over an age 13 towards YouTube audiences hosted by VP Awesome, SnipeSnap, The Cartoon Movement, and Matt Neff. The critics alike, the titular character always misbehaved and whining throughout the series by notable clips: * Wants a Cake: He complains for wanting a cake at the bakery, his mother refuses then leaves and she gives a supper tonight. * Argues with his Mommy: He works to plant some flowers in the backyard, refusing to change his clothes and calling his mother \"horrible\". However, it changes when she deserves an ass-whooping. After he got dressed, later turns out to be good and he rewards an apple pie until the rain stops. This theme about upsetting each other. Little Brown Bear reveals a brattiness worse than Caillou from the titular series, Dora Winifred Read from Arthur, and Horrid Henry with Perfect Peter from Horrid Henry. On November 1, 2024, GoAnimate and Vyond video maker XanMan is formed as a troublemaker cub called \"Little Brown Brat\" on YouTube. ==References== Category:2000s French animated television series Category:2000s French children's television series Category:2000s French television series Category:2003 French television series debuts Category:2003 television series debuts Category:2004 French television series endings Category:2004 television series endings Category:Animated television series Category:Children's television series Category:French animated television series Category:French children's television series Category:French television series Category:Internet memes Category:Television series about animals Category:Television series about brothers Category:Television series about families Category:Television series about friendship Category:Television series about siblings Category:Television series about sisters Category:Television series by Disney",
 "title": "The Adventures of Little Brown Bear"
}