{
 "id": "1161428",
 "text": "Leydig cell hypoplasia (LCH), also known as leydig cell agenesis, is a very rare genetic disorder that affects the endocrine system. It only affects people with an XY chromosome pair (people who are genetically male). About one in one million people have it. In this condition, the body cannot respond to the luteinizing hormone. This is a sex hormone that causes someone's testes to produce Leydig cells, which help the body make testosterone and androgens. People with LCH may have underdeveloped genitalia, or may have fully female genitalia. They are usually taller and have issues with their skeleton. The usually need hormone therapy to have puberty. == Symptoms == LCH can affect someone's genitalia. Some people with LCH may have female genitalia (like a vagina and vulva) even though they are genetically male. Others may have ambiguous (traits of male and female genitalia) or underdeveloped male genitalia. This can include a micropenis (small penis), hypospadias (where the urethra is not at the top of the penis), and undescended testes (where the testicles are in the lower abdomen instead of outside the body). People with LCH may identify as female. People with LCH usually have hypergonadotropic hypogonadism, a condition where the gonads (testes or ovaries) cannot produce as much sex hormones. They will usually have a late or absent puberty that may not be complete. They may be less fertile or entirely infertile. They may also be taller than normal and have weaker bones, and as a result may have osteoporosis (a condition causing weak and thin bones). There are two types of LCH. Type I is more severe and causes no puberty, ambiguous genitalia, and low hormone levels. Type II is less severe and causes underdeveloped genitalia. == Cause == LCH is caused by a mutation in LHCGR (luteinizing hormone/choriogonadotropin receptor). This is a gene in the body that makes luteinizing hormones (LH). LH helps the testicles make Leydig cells. Leydig cells produce sex hormones like testosterone and androgens. In people with LCH, the Leydig cells do not work or may not be in the body because of the mutation in the LHCGR gene. As a result, their testosterone and androgen levels are lower. This causes the symptoms of the condition. In the more severe cases of LCH, puberty may not happen because there are no Leydig cells. == Diagnosis == If someone with LCH has ambiguous or underdeveloped genitalia, they will get diagnosed shortly after birth. If they do not, then they usually get diagnosed at adolescence when they have issues with puberty. Most people with LCH get diagnosed in their adolescence. LCH is done through a biopsy (where cells are removed to be inspected) of the testes. This will show that the testes have underdeveloped or no Leydig cells. The inside of the testes may be gray and mucous. More testing may be done on the LHCGR gene to find a mutation. == Treatment == People with LCH may have hormone replacement therapy (HRT), where they will have medications that give them more sex hormones. This will help people with the disorder have puberty. Some people with LCH may use HRT to get more androgens and have a male puberty. However, some people with LCH may appear more female. They may get estrogens instead and have a female puberty. Sometimes, orchidopexy, a type of surgery that moves undescended testes from the abdomen to outside the body, may be needed. == References == Category:Genetic disorders Category:Syndromes",
 "title": "Leydig cell hypoplasia"
}