{
 "id": "1161474",
 "text": "Kumbh Mela is a big festival and pilgrimage in Hinduism. On February 4, 2019, it had the largest gathering of Hindus ever seen. This festival happens about every 12 years when Jupiter finishes one round in the sky. Kumbh Mela takes place in four main cities by rivers: Prayagraj (where Ganges, Yamuna, and Saraswati meet), Haridwar (Ganges), Nashik (Godavari), and Ujjain (Shipra). Since 2022, a fifth place was added at Bansberia Tribeni Sangam in West Bengal at the meeting of the Hooghly and Saraswati rivers. This event was stopped 700 years ago but has now restarted. People celebrate Kumbh Mela by bathing in rivers, believing it washes away sins and makes up for past wrongs. It also has fairs, teachings by saints, large gatherings of monks, and entertainment.Williams Sox (2005). Lindsay Jones (ed.). Encyclopedia of Religion, 2nd Edition. Vol. 8. Macmillan. pp. 5264–5265 The 8th-century Hindu saint Adi Shankara is believed to have started this festival to encourage learning and discussion among Hindus. However, the name \"Kumbh Mela\" has been recorded only since the 19th century. Earlier, a similar event called Magha Mela existed, where people gathered for holy dips in rivers. Some scholars say the modern Kumbh Mela grew during British rule after the 1857 rebellion. The festival happens at each site every 12 years, based on the positions of Jupiter, the sun, and the moon in the Hindu calendar. In Prayagraj and Haridwar, a smaller festival called Ardha (half) Kumbh Mela takes place every 6 years. The timing of Ujjain and Nashik Kumbh Melas has been debated, but they usually happen about 3 years after Prayagraj’s festival. In other parts of India, smaller versions of this event are called Magha Mela or Makar Mela. For example, Tamil Nadu has a festival at Kumbakonam every 12 years. Similar events also happen in Kurukshetra, Sonipat, and Nepal. The Kumbh Mela lasts from one to three months, with three main dates when most pilgrims come. The largest gatherings happen in Prayagraj and Haridwar. More than 200 million people attended the 2019 Kumbh Mela, with 50 million on the busiest day. It is one of the biggest peaceful gatherings in the world and is recognized by UNESCO as an important cultural event. On February 10, 2013, 30 million people attended in one day, and on February 4, 2019, 50 million came on a single day. ==See also== Maha Kumbh (Prayagraj) 2025 == References == === Citations === Category:Uttarakhand Category:West Bengal Category:Hindu festivals Category:India",
 "title": "Kumbh Mela"
}