{
 "id": "1162072",
 "text": "The Münchhausen trilemma is a thought experiment in epistemology. It shows the problem of trying to fully prove any statement as absolutely true. Even in fields like logic or mathematics, it seems impossible to prove something without relying on some starting points (or assumptions) that are not themselves proven. When someone asks “How do we know a statement is true?” we usually offer proof. But then we can ask the same question about that proof, and the proof of that proof, and so on. The Münchhausen trilemma says there are only three ways to end this chain of questions: * A circular argument, where the proof of the statement assumes the statement is true in the first place * An endless chain of proofs, where each proof needs another proof forever * A dogmatic argument, which rests on some basic assumption that is simply accepted but not proven According to Karl Popper, this trilemma cannot be solved in a final way, so he suggested using guesswork (conjectures) and constant checking (criticism) instead. == Name == The name Münchhausen- Trilemma was coined by the German philosopher Hans Albert in 1968. He was referring to \"dogmatism versus infinite regress versus psychologism,\" a set of ideas used by Karl Popper.Dogmatismus – unendlicher Regreß – Psychologismus Albert, Traktat über kritische Vernunft, 1968, p. 11, cited after Westermann, Argumentationen und Begründungen in der Ethik und Rechtslehre, 1977, p. 15. It is connected to the idea of \"bootstrapping,\" based on the story of Baron Munchausen pulling himself and his horse out of a mire by his own hair. Because he has no solid ground to push against, he cannot really lift himself. Similarly, any attempt to justify all knowledge seems to start from “no knowledge” and cannot progress without assuming something. In modern epistemology: * People who support coherentism usually choose the “circular” approach. * Foundationalists rely on basic assumptions called axioms. * Infinitism is the idea that the chain of proofs can go on forever. Sometimes, the Münchhausen trilemma is also called Agrippa's trilemma or the Agrippan trilemma. This name refers to a similar argument reported by Sextus Empiricus, which he said came from Agrippa the Skeptic. Diogenes Laërtius also mentioned Agrippa. (Agrippa’s version actually had five steps, not three.) == Fries's trilemma == In his book Logic of Scientific Discovery, Karl Popper did not mention Sextus or Agrippa. He credited the trilemma to the German philosopher Jakob Friedrich Fries. Some people call it Fries's trilemma.Robert Nola, \"Conceptual and Non-Conceptual Content\", in: Karl Popper: A Centenary Assessment vol. 2, 2006, p. 15 Fries said any statement can be accepted in one of three ways:J. F. Fries, Neue oder anthropologische Kritik der Vernunft (1828 to 1831). * By simply believing it (dogmatically) * By going into an endless chain of proofs * By relying on sensory experience (psychologism) Fries rejected the first two, so he chose the third way. Karl Popper said we might avoid the trilemma by mixing some dogmatism, some infinite regress, and some perceptual experiences.Karl Popper, \"The Logic of Scientific Discovery\", p. 87 == Albert's formulation == Hans Albert explained the trilemma like this: any attempt to find “certain” knowledge must fail for one of three reasons: * If we keep proving each new proof, we end up with infinite regression, which can never finish. * If we use a circular argument, we do not actually gain new knowledge because we assume what we want to prove. * If we stop at something we call self-evident or a basic principle, we have given up on finding a full proof. Albert also said the trilemma affects all kinds of proofs, not just logical or deductive ones. It applies to inductive arguments, causal arguments, transcendental arguments, and more. Since we cannot have “certain” justification, Albert said we can stop the chain of questioning anywhere we like. However, we must remain open to criticism if someone challenges our chosen stopping point. This idea raises the old problem of justification in the theory of knowledge. The Münchhausen trilemma suggests we cannot prove anything for sure, but that does not mean we should become relativists. People like Karl Popper and Hans Albert used fallibilism, which says we aim to get closer to truth, even though we can never be 100% certain. Albert also pointed out that the statement “It is impossible to prove any certain truth” is itself based on some logical assumptions. To prove this statement would again raise the trilemma. However, he believed we should tentatively accept it until someone shows a certain truth that is truly proven beyond all doubt. == References == == Further reading == * Hans Albert, Treatise on Critical Reason, Princeton University Press, 1985, chapter I, section 2. * More of Hans Albert’s articles: List of Publications at opensociety.de == Other websites == * PhilPapers: Epistemic Regress Category:Epistemology",
 "title": "Münchhausen trilemma"
}