{
 "id": "1162057",
 "text": "Ryan Reaves (born January 20, 1987) is a Canadian professional ice hockey right winger. He currently plays for the Toronto Maple Leafs of the National Hockey League (NHL). He has also played for the St. Louis Blues, Pittsburgh Penguins, Vegas Golden Knights, New York Rangers, and Minnesota Wild. ==Career== Before playing in the NHL, Reaves played parts of 3 seasons with the Brandon Wheat Kings of the Western Hockey League (WHL). During his time with the Wheat Kings, Reaves served as one of their alternate captains. He was drafted 156th overall overall by the St. Louis Blues in the 2005 NHL Entry Draft. On October 11, 2010, Reaves made his NHL debut in a 5-1 win against the Anaheim Ducks. During the game, Reaves fought Kyle Chipchura and received a game misconduct. On January 12, he scored his first NHL goal in a 7-4 loss against the Anaheim Ducks. On June 23, 2017, the Blues traded Reaves along with a second-round pick to the Pittsburgh Penguins in exchange for Oskar Sundqvist and a first-round pick. During his time with the Penguins, Reaves scored 4 goals for them. On February 23, 2018, the Penguins traded Reaves to the Vegas Golden Knights in a three-way trade that also included the Ottawa Senators. Reaves was successful in Vegas. He helped the team reach for the 2018 Stanley Cup Finals after scoring the series-winning goal against the Winnipeg Jets. On July 29, 2021, the Golden Knights traded Reaves to the New York Rangers in exchange for a third-round draft pick. On November 23, 2022, the Rangers traded Reaves to the Minnesota Wild in exchange for a fifth-round draft pick. On July 1, 2023, Reaves signed a three-year, $4.05 million contract to join the Toronto Maple Leafs. On November 16, 2024, Reaves illegally checked Edmonton Oilers defenseman Darnell Nurse in the head and was given a five-game suspension. ==References== == Other websites == * Category:1987 births Category:Living people Category:Black Canadian sportspeople Category:Brandon Wheat Kings players Category:Canadian ice hockey right wingers Category:Minnesota Wild players Category:New York Rangers players Category:Peoria Rivermen (AHL) players Category:Pittsburgh Penguins players Category:Ice hockey people from Manitoba Category:Sportspeople from Winnipeg Category:St. Louis Blues players Category:Toronto Maple Leafs players Category:Vegas Golden Knights players",
 "title": "Ryan Reaves"
}