{
 "id": "116239",
 "text": "The Mid-American Conference (MAC) is a college sports conference whose full members are located in the Great Lakes region of the United States. It sponsors 11 men's sports and 12 women's sports at the NCAA Division I level. In football, the MAC is one of 10 conferences that play in the top-level Football Bowl Subdivision (FBS). The MAC was founded in 1946 by five schools in Indiana, Michigan, and Ohio, but only one of the founding members, Ohio University, is still in the conference. All but two of its current full members are in those three states. == Sports sponsored == * Baseball (men only) * Basketball (both men and women) * Cross country (both men and women) * Field hockey (women only) * Football (men only) * Golf (both men and women) * Gymnastics (women only) * Lacrosse (women only) * Soccer (both men and women) * Softball (women only) * Swimming and diving (both men and women) * Tennis (both men and women) * Track and field, indoor (both men and women) * Track and field, outdoor (both men and women) * Volleyball (women only) * Wrestling (men only) == Members == === Full members === Currently, the MAC has 12 full members, all public schools, each of which competes in at least 15 MAC sports. Every member of the conference competes in football, baseball, men's and women's basketball, and the following women's sports: cross country, soccer, softball, indoor and outdoor track and field, and volleyball. For many years the conference was split into East and West Divisions in many sports, but the only sport now using divisions is women's tennis. The sport that most recently eliminated divisions is football, which started using a single league table in 2024. School Location Founded Type Nickname Joined MAC Akron, Ohio 1870 Public Zips 1992 Ball State University Muncie, Indiana 1918 Public Cardinals 1973 Bowling Green State University Bowling Green, Ohio 1910 Public Falcons 1952 Buffalo, New York 1846 Public Bulls 1998 Central Michigan University Mount Pleasant, Michigan 1892 Public Chippewas 1971 Eastern Michigan University Ypsilanti, Michigan 1892 Public Eagles 1971 Kent State University Kent, Ohio 1910 Public Golden Flashes 1981 Miami University Oxford, Ohio 1809 Public RedHawks 1977 Ohio University Athens, Ohio 1804 Public Bobcats 1948 Northern Illinois University DeKalb, Illinois 1895 Public Huskies 1975, 1997 Toledo, Ohio 1872 Public Rockets 1950 Western Michigan University Kalamazoo, Michigan 1903 Public Broncos 1947 === Future full members === The MAC will add UMass, which had been a football-only MAC member from 2012 to 2015, as a full member in 2025. School Location Founded Type Nickname Joining MAC (UMass) Amherst, Massachusetts 1863 Public Minutemen & Minutewomen 2025 ===Associate members=== The MAC has 16 \"associate members\" that play one or two sports in the conference, with three more set to join in the near future. A major recent change in associate membership happened in 2019 when the MAC absorbed the Eastern Wrestling League, a single-sport conference that had existed since 1975. All seven of the EWL's final members thus became MAC associates. A more recent change to associate membership took place on July 1, 2020 when the MAC added three members in the new conference sport of women's lacrosse, along with one former wrestling member dropping the sport. SIU Edwardsville (SIUE), in full Southern Illinois University Edwardsville, left the MAC men's soccer league in 2021 to return to its former soccer home of the Missouri Valley Conference. It remains a MAC member in wrestling. Another change in associate membership was announced in June 2020. Bellarmine University, which started a transition from NCAA Division II to Division I that July, joined the MAC field hockey league in July 2021. At the same time Bellarmine joined in field hockey and SIUE left in wrestling, Georgia Southern University and Georgia State University joined MAC men's soccer, and Missouri wrestling left to become a single-sport member of its former all-sports home of the Big 12 Conference. The next changes in associate membership took place in July 2022. First, West Virginia University men's soccer left the MAC. WVU planned to move the sport to Conference USA, but changed its plans amid the larger conference realignment of the early 2020s. WVU instead moved men's soccer to the Sun Belt Conference. The MAC replaced WVU with Chicago State University, which was leaving the Western Athletic Conference at that time. However, the MAC would shut down its men's soccer league after the 2023 season. Also in 2022, the MAC added the University of Illinois Chicago (UIC) as a men's swimming & diving member. In 2023, UIC added men's tennis to its MAC membership. More changes to associate membership came in July 2024. First, James Madison University joined the MAC for field hockey. Second, the Missouri Valley Conference, which had been the main home to five of the MAC's seven men's swimming & diving schools, announced it would start sponsoring the sport. The MAC merged its men's swimming & diving league into the new MVC league. When UMass becomes a full member in July 2025, the MAC will add women's rowing as a sponsored sport. Full members Eastern Michigan, Toledo, and UMass will be joined by new associates Delaware, High Point, and Temple. ;Current associate members School Location Founded Joined Type Sport(s) Current main conference Nickname Appalachian State University Boone, North Carolina 1899 2017 Public Field hockey Sun Belt Mountaineers Bellarmine University Louisville, Kentucky 1950 2021 Private Field hockey ASUN Knights Binghamton University Vestal, New York 1946 2014 Public Men's tennis America East Bearcats Bloomsburg University of Pennsylvania Bloomsburg, Pennsylvania 1839 2019 Public Wrestling PSAC (NCAA Division II) Huskies (Clarion) Clarion, Pennsylvania 1867 2019 Public Wrestling PSAC (NCAA Division II) Golden Eagles Cleveland State University Cleveland, Ohio 1964 2019 Public Wrestling Horizon League Vikings Detroit, Michigan 1877 2020 Private Women's lacrosse Horizon League Titans (Edinboro) Edinboro, Pennsylvania 1857 2019 Public Wrestling PSAC (NCAA Division II) Fighting Scots George Mason University Fairfax County, Virginia 1957 2019 Public Wrestling Atlantic 10 Patriots James Madison University Harrisonburg, Virginia 1906 2024 Public Field hockey Sun Belt Conference Dukes Lock Haven University of Pennsylvania Lock Haven, Pennsylvania 1870 2019 Public Wrestling PSAC (NCAA Division II) Bald Eagles Longwood University Farmville, Virginia 1839 2014 Public Field hockey Big South Lancers Rider University Lawrenceville, New Jersey 1865 2019 Private Wrestling MAAC Broncs Robert Morris University Moon Township, Pennsylvania 1921 2020 Private Women's lacrosse Horizon League Colonials Southern Illinois University Edwardsville Edwardsville, Illinois 1957 2018 Public Wrestling Ohio Valley Cougars (UIC) Chicago, Illinois 1859 2023 Public Men's tennis Missouri Valley Flames Youngstown State University Youngstown, Ohio 1908 2020 Public Women's lacrosse Horizon League Penguins ;Future School Location Founded Joining Type Sport(s) Current main conference Nickname Newark, Delaware 1743 2025 Public Women's rowing CAA Fightin' Blue Hens High Point University High Point, North Carolina 1924 2025 Private Women's rowing Big South Panthers Temple University Philadelphia, Pennsylvania 1884 2025 Public Women's rowing American Owls ==References== * Category:1946 establishments in the United States",
 "title": "Mid-American Conference"
}