{
 "id": "116231",
 "text": "The Sun Belt Conference (SBC) is a group of college sports teams that play each other on the NCAA Division I level. The conference was formed in 1976, and started playing football in 2001. All 14 full members (those playing most of their sports in the league) play football in the top-level Division I FBS. The conference's full members are scattered through the southern United States. == Members == School Location Founded Type (affiliation) Nickname Joined SBC Appalachian State University Boone, North Carolina 1899 Public Mountaineers 2014 Arkansas State University Jonesboro, Arkansas 1909 Public Red Wolves 1991 Coastal Carolina University Conway, South Carolina 1954 Public Chanticleers 2016 (2017 in football) Georgia Southern University Statesboro, Georgia 1906 Public Eagles 2014 Georgia State University Atlanta, Georgia 1913 Public Panthers 1976, 2013 James Madison University Harrisonburg, Virginia 1908 Public Dukes 2022 LouisianaUniversity of Louisiana at Lafayette (Louisiana) Lafayette, Louisiana 1898 Public Ragin' Cajuns 1991 Louisiana MonroeUniversity of Louisiana at Monroe Monroe, Louisiana 1931 Public Warhawks 2001 (football only) 2006 (all sports) Marshall University Huntington, West Virginia 1837 Public Thundering Herd 2022 Old Dominion University Norfolk, Virginia 1930 Public Monarchs 1982, 2022 South AlabamaUniversity of South Alabama Mobile, Alabama 1963 Public Jaguars 1976 (Southern Miss) Hattiesburg, Mississippi 1910 Public Golden Eagles 2022 Texas State University San Marcos, Texas 1899 Public Bobcats 2013 Troy University Troy, Alabama 1887 Public Trojans 2004 (football only) 2005 (all sports) ===Associate members=== At different times, the SBC has had \"associate members\" that play only a few sports, usually one, in the league. As of the 2023–24 school year, it has eight associate members. Four are in men's soccer, a sport that the SBC resumed playing after a one-year absence, and the others are in beach volleyball, a women's sport added for 2022–23. Most associate members in league history no longer compete in the SBC. The first school to abandon single-sport membership was Utah State, which played Sun Belt football in 2003 and 2004 before joining the Western Athletic Conference (WAC) in 2005. The Aggies have been members of the Mountain West Conference since 2013. Idaho and New Mexico State were involved in the league at two different times. New Mexico State first joined the Sun Belt as a full member in 2000, and brought its football team into the Sun Belt the next year. Also in 2001, Idaho joined only for football. Both left in 2005 to join the WAC. During the early 2010s, NCAA Division I went through a major phase of conference changes, with most leagues gaining or losing multiple members. The WAC was one of the most affected conferences, going through a nearly complete membership turnover that left Idaho and New Mexico State as the league's only football schools. In 2014, both placed their football programs in the Sun Belt. The conference announced in 2016 that its agreements for Idaho and New Mexico State to play football in the league would not be renewed when they ended after the 2017 season. NJIT (the New Jersey Institute of Technology) was another victim of this realignment; it was forced to become an independent (not in a conference) when its former league, the Great West Conference, collapsed. Its men's soccer team joined the Sun Belt in 2014, a year before the school found a home in the ASUN Conference. Although the ASUN sponsors men's soccer, NJIT kept that team in the Sun Belt until 2016, honoring its two-year contract to play in that league. Another recent change involved Hartwick, which had long competed in Division I men's soccer despite otherwise being in NCAA Division III. In 2018, Hartwick aligned completely with Division III, moving its men's soccer team to its full-time home of the Empire 8. A more recent change came in 2021, when the Sun Belt shut down its men's soccer league after it dropped below the number of members needed to keep the automatic berth its champion received in the NCAA tournament. However, conference realignment would lead to the return of men's soccer after a single season. Of the four schools that were announced as new members in 2021, three sponsor men's soccer—James Madison, Marshall, and Old Dominion. All were originally intended to join the SBC in 2023. With current members Coastal Carolina, Georgia Southern, and Georgia State also fielding men's soccer teams, the SBC announced it would reinstate men's soccer in 2023. However, the return of men's soccer would be moved forward to 2022 after the expansion plan changed. The revived SBC men's soccer league started with Kentucky, South Carolina, and West Virginia as single-sport members. SBC men's soccer added another member in 2023 with the arrival of UCF, which left the American Athletic Conference (which runs a men's soccer league) for the Big 12 Conference (which does not). UCF's move united its men's soccer team with that of West Virginia, the only other current Big 12 member with a men's soccer team. The SBC added beach volleyball for the 2022–23 school year with eight members, with full members Coastal Carolina, Georgia State, Southern Miss, and ULM joined by four affiliates. ==== Current ==== School Location Founded Type (affiliation) Nickname Joining SBC sport Primary conference (Charleston) Charleston, South Carolina 1770 Public Cougars 2022 Beach volleyball CAA Lexington, Kentucky 1865 Public Wildcats 2022 Men's soccer SEC Mercer University Macon, Georgia 1833 Private Bears 2022 Beach volleyball SoCon Columbia, South Carolina 1801 Public Gamecocks 2022 Men's soccer SEC Stephen F. Austin State University (Stephen F. Austin or SFA) Nacogdoches, Texas 1923 Public Ladyjacks 2022 Beach volleyball Southland (UCF) Orlando, Florida 1963 Public Knights 2023 Men's soccer Big 12 (UNCW) Wilmington, North Carolina 1947 Public Seahawks 2022 Beach volleyball CAA West Virginia University Morgantown, West Virginia 1867 Public Mountaineers 2022 Men's soccer Big 12 ==== Former ==== School Location Founded Type (affiliation) Nickname Joined Left SBC sport Current conference in former SBC sport Conway, Arkansas 1907 Public Bears 2019 2021 Men's soccer ASUN Hartwick College Oneonta, New York 1797 Private Hawks 2014 2018 Men's soccer Empire 8 (Division III) Howard University Washington, D.C. 1867 Private Bison 2014 2018 Men's soccer Northeast IdahoUniversity of Idaho Moscow, Idaho 1889 Public Vandals 2001 2014 2005 2018 Football Big Sky New Mexico State University Las Cruces, New Mexico 1888 Public Aggies 2014 2018 Football Conference USA (NJIT) Newark, New Jersey 1881 Public Highlanders 2014 2016 Men's soccer America East Utah State University Logan, Utah 1888 Public Aggies 2003 2005 Football Mountain West ==References== * Category:1976 establishments in the United States",
 "title": "Sun Belt Conference"
}