{
 "id": "116272",
 "text": "Charizard (known as Lizardon in Japan) is a Pokémon species. Known as the Flame Pokémon,Pokédex: Charizard flies around the sky in search of powerful opponents. It breathes fire of such great heat that it melts anything. However, it never turns its fiery breath on any rival weaker than itself. Charizard can use Fire-type attacks such as Flamethrower which can melt anything. Charizard is also the version mascot of Pokémon Red and FireRed versions, and makes an appearance on the boxarts of many other Pokémon games. During an interview, Pokémon Company president Tsunekazu Ishihara said that they knew Charizard would be popular with North Americans, because they like strong, powerful characters. The creator of this Pokémon is Atsuko Nishida. Ash Ketchum, one of the main characters in the Pokémon anime series, owns a Charizard. == Characteristics == Charizard is an orange dragon-like Pokémon with two wings that are teal-blue on the front, and orange on the back. Its belly and soles are cream-colored, while their eyes are light blue. Some PokéDex entres say that Charizard's wings can bring it to 4,600 feet in the sky,Pokédex: Its wings can carry this Pokémon close to an altitude of 4,600 feet. It blows out fire at very high temperatures. which is even higher than the Burj Khalifa—the tallest building in the world. Charizard can breathe very hot flames that can melt anything, although it will never torch a weaker opponent.Pokédex:A Charizard flies about in search of strong opponents. It breathes intense flames that can melt any material. However, it will never torch a weaker foe. Charizard also fight using their claws. Charizard are honorable Pokémon, flying proudly around the sky and always looking for powerful enemies to battle with. If a Charizard is angry, the flame at the tip of its tail can be a whitish-blue color.Pokédex: If Charizard becomes furious, the flame at the tip of its tail flares up in a whitish-blue color. Because of their crazy behavior, Charizard are also known to cause wildfires by accident.Pokédex: It spits fire that is hot enough to melt boulders. Known to cause forest fires unintentionally. == Games == Charizard has appeared many times in the Super Smash Bros. (series). Charizard first appears as a non- playable character in Super Smash Bros. and Super Smash Bros. Melee, as one of the Pokémon that come if a player uses a Poké Ball. In Super Smash Bros. Brawl Charizard is now playable, under the command of the Pokémon Trainer. The Trainer also has a Squirtle and an Ivysaur, that you can swich from at any time. It can use Flamethrower and Rock Smash. It also uses Fly and has the ability to glide. Charizard is a Heavyweight and attacks with many physical attacks. It uses Fire Blast in Pokémon Trainer's Final Smash, Triple Finish. ==Reception and legacy== Described by the media as \"a lean, ferocious, fire- breathing dragon [...] sleek, powerful, and utterly destructive\", Charizard has been noted as one of the franchise's most popular characters. People who sell toys have noted that the high sales of merchandise related to the character to the popularity of the character's dragon-like design with children. Interviewed children have stated similar; they attributed its appeal to its \"cool looking\" appearance and associating the character with the concepts of stubbornness and power. GamesRadar described Charizard as \"hands- down one of the coolest Pokémon out there\", heavily praising its character design and calling it \"one of the coolest\" designs of the entire series. IGN editor \"pokemonofthedaychick\" called Charizard \"certainly the most popular and perhaps the most well-balanced of any of the current starting Pokémon\". The book Pikachu's Global Adventure: The Rise and Fall of Pokémon cited Charizard as popular with older male children who tend to be drawn to \"tough or scary\" characters, and compared the character's evolution from Charmander into Charizard with the loss of \"cuteness\" as one leaves childhood. The book Rebuilding Attachments With Traumatized Children said psychiatrists used the character as an empowered character traumatized children who were fans of the Pokémon series could relate to. In 2005, search engine Yahoo! reported Charizard as one of the top Pokémon-related web searches. Due to Charizard's appeal, it has been featured in lines of soft toys and action figures in the Pokémon franchise, made by Hasbro, and Tomy.\"Recall of Pokémon plush toys \" Cpsc.org'.' Retrieved 12 July 2006. In 2004, the \"Charizard Medium Plush\" was part of a major recall of 13 plush toys due to a manufacturing fault where tips of needles were being found with the stuffing. This caused Tomy to replace the toys with compensation or replacements. Charizard appears often in the Pokémon Trading Card Game, most notably in the series' initial release. Cards featuring the character have been stated to be the most desired of the series, quickly rising to high prices among collectors and retailers. These cards were extremely powerful and knocked out opponents in one hit. == References == Category:Fictional characters introduced in 1996 Category:Pokémon species Category:Fictional dragons",
 "title": "Charizard"
}