{
 "id": "1162664",
 "text": "XYYY syndrome is a very rare genetic disorder. Usually, a male will have one X chromosome and one Y chromosome, but people with XYYY syndrome have three Y chromosomes. They have 48 chromosomes instead of the usual 46. The symptoms vary, but they usually include mild intellectual disability, small issues with the skeleton, and infertility. There have only been sixteen cases seen in medicine. Of these cases, twelve are non-mosaic and four are mosaic. == Symptoms == The symptoms for XYYY syndrome vary. It is also not known if some people have a mild case of the disorder and have not been diagnosed. === Physical === People with XYYY syndrome may have small problems with their skeleton. Common problems are clinodactyly (where the finger is very curved or bent), radioulnar synostosis (where the ulna and radius in the arm are connected), and problems with the teeth. These problems are common in other disorders where someone has an extra X or Y chromosome. People with XYYY syndrome may be tall or very tall. === Reproductive === Many people with XYYY syndrome have low testosterone. Every person seen with non-mosaic (meaning every cell in the body had one X chromosome and three Y chromosomes instead of just some) XYYY syndrome had azoospermia. This is when a male does not produce any sperm. This means they are infertile. Some people with mosaic (meaning some cells have one X chromosome and three X chromosomes but others do not) XYYY syndrome do produce sperm. Some people with XYYY syndrome may have aggressive or impulsive behaviors related to sex. Others may not have any interest in having sex. One peson with XYYY syndrome had gender dysphoria. People with XYYY syndrome may also have severe acne. === Mental === Borderline to mild intellectual disability is common in XYYY syndrome. The average IQ for someone with XYYY syndrome is around 70–85. People with XYYY syndrome can do things like washing themselves, using the bathroom, dressing themselves, and eating. However, it may take them longer to learn how to do these things. It is also common for someone with XYYY syndrome to take longer to learn how to talk. Some people with XYYY go to special schools or institutions because they are aggressive. However, it is believed that they are aggressive because of an abusive childhood rather than the disorder. People with XYYY syndrome are usually insecure, immature, and shy. People with XYYY syndrome usually want to have relationships and be part of society. Two men with XYYY syndrome married and had jobs. == Causes == XYYY syndrome is caused when a male has one X chromosome and three Y chromosomes instead of one X chromosome and one Y chromosome as usual. This happens because of nondisjunction. Nondisjunction is when chromosomes in gametes (sperm and eggs) do not split right. This leads to people having more chromosomes. == Diagnosis == XYYY syndrome is diagnosed through a karyotype. This is when geneticists test and examine someone's DNA to look at their chromosomes. This would find that someone has three Y chromosomes instead of just one. == Prevalence == XYYY syndrome is very rare. There have only been twelve non-mosaic cases. Non-mosaic means every cell in the body has the same chromosomes. There have also been four mosaic cases. This means some cells in the body have one X chromosome and three Y chromosomes, but other cells have different chromosomes. For example, someone can have cells that have one X chromosome and three Y chromosomes, but also have cells that have one X chromosome and one Y chromosome. it is not known if there are mild cases of XYYY syndrome that have not been diagnosed. == History == XYYY syndrome was first found by doctors in 1965. A five-year-old boy had a borderline intellectual disability and had tests done which showed he had two extra Y chromosomes. The next time XYYY syndrome was found was in 1972. == References == Category:Genetic disorders Category:Syndromes",
 "title": "XYYY syndrome"
}