{
 "id": "1162353",
 "text": "Ajey Nagar (born 12 June 1999), better known as CarryMinati, is an Indian YouTuber, streamer and rapper.* He is known for his roasting videos, comedic skits and reactions to many online topics on his channel CarryMinati. His other channel CarryisLive is dedicated to gaming and live streams. With over 43 million subscribers as of September 2024, he is the most-subscribed people YouTuber in Asia. * * * * * In May 2020, his roast video titled \"YouTube vs TikTok: The End\" caused controversy on YouTube. The video was removed by YouTube for violations against the platform's terms of service, citing reasons such as cyberbullying and harassment. == Early life and education == Ajey Nagar was born on 12 June 1999 in Faridabad, India. He attended Delhi Public School, Faridabad and dropped out to pursue his YouTube career; skipping his Class-XII Board examination because of his nervousness about passing the economics exam. He later completed his schooling through long-distance learning. Nagar's elder brother, Yash, is a music producer and composer who has collaborated with him as Wily Frenzy. == Career == Ajey Nagar is based in Faridabad, a city near India's national capital New Delhi. Popularly referred to as CarryMinati, Nagar is mainly involved in creating Hindi-language roasting and comedy videos, diss songs, satirical parodies, apart from live gaming. Nagar and his team produce videos out of his home in Faridabad. Nagar began posting videos on YouTube at the age of 10, uploading football tutorial videos on his first YouTube channel STeaLThFeArzZ. His main YouTube channel has been active since 2014. In 2014, the channel's name was AddictedA1 and Nagar would upload recorded video game footage along with his reactions to the game. In 2015, he changed the channel's name to CarryDeol, uploading gameplay footage of Counter-Strike: Global Offensive while mimicking Sunny Deol. The channel was subsequently renamed to CarryMinati. He became the first Indian YouTuber ever to surpass the milestone of 30 million subscribers in May, 2021 and 40 million subscribers in August, 2023. Beyond India, he also currently has the highest number of subscribers in the Asia region. In early 2017, Nagar created an additional YouTube channel called CarryIsLive, where he live- streams himself playing video games. He has hosted live-streams on this channel, raising funds for victims of Kerala floods in 2018. cyclone Fani in Odisha, Assam floods, Bihar floods and Shaheed's of Pulwama attack in 2019, Bushfires in Australia, COVID’19 and the flooding in Assam and Bihar in 2020. On 4 June, Nagar hosted a four-hour charity live-stream for the victims of 2023 Odisha train collision. The live-stream generated INR 11,87,611.64 with ₹1.5 lakh personal contributions; all the funds were donated to the Chief Minister's relief funds - Government of Odisha. In January, 2023 Nagar created another YouTube channel CarryMinati Productions Official, where he uploads vlogs and behind the scenes videos. === Music === In January 2019, Nagar released a Diss Track called \"Bye PewDiePie\" in which he criticized PewDiePie, which garnered 22 million views since the release of five month. Same year he released another track \"Trigger\" in a collaboration with his elder brother Wily Frenzy. This was followed by \"Zindagi\", \"Warrior\" and the Diss Track \"Yalgaar\" in 2020, \"Vardaan\" in 2021. === Homophobic video incident === In May 2020, Nagar published a controversial YouTube video titled \"YouTube Vs TikTok–The End\", in response to a video shared on Instagram by TikTok user Amir Siddiqui who berated YouTube creators for roasting TikTok users. It was taken down by YouTube citing violations of its terms of service, based on multiple complaints of harassment and cyberbullying. A large number reports had been made by LGBTQ+ activists, on account of homophobic or transphobic abusive language in the video. Many of Nagar's fans were critical of YouTube's actions, and the removal led to several new trending hashtags mentioning his name. As a result, the video received several million views, and there was a concerted effort to review bomb TikTok at Google Play Store. Other fans of Nagar spoke out in favor of YouTube's decision to remove the video. In June 2020, Nagar uploaded the music video \"Yalgaar\" as a further response, with renewed criticism of Siddiqui. === Other work === In year 2020, Nagar collaborated with music composer duo Salim–Sulaiman for the music video Date kar Le. Nagar rap single \"Yalgaar\" with music by Wily Frenzy, served as the theme song in 2021 film The Big Bull. He had a cameo appearance as himself in the 2022 movie Runway 34. In February 2023, Nagar bought a 10% stake in esports firm Big Bang Esports with business partner Deepak Char. == Media == In 2019, Nagar was listed at the 10th position in the Next Generation Leaders' 2019 by Time magazine, which is an annual list of ten young people who construct innovative careers. In April 2020, Nagar was featured in Forbes 30 Under 30 Asia list. In 2021, Nagar was featured On the top 50 list of India Today's High & Mighty powerful personalities in India. In March 2022, Nagar was featured in the Hindustan Times brunch cover story. == Filmography == === Films === Year Title Role Notes Ref. 2022 Runway 34 Himself Cameo appearance === Web series === Year Title Role Notes Ref. 2017 Press Start to Play Ajey 2021 Me Boss and Lockdown Ajey, Rockstar Dhindora Himself Special appearance in title track 2022–2023 Playground Mentor 2 seasons == Discography == === Singles and collaborations === Year Title Artist(s) Notes Ref. 2019 Bye Pewdiepie CarryMinati Diss track Trigger CarryMinati, Vibgyor Single 2020 Zindagi CarryMinati, Wily Frenzy Single Warrior Yalgaar Remade in 2021 for the film The Big Bull Date Kar Le CarryMinati, Romy, Salim–Sulaiman 2021 Vardaan CarryMinati, Wily Frenzy Single 2023 Jalwa CarryMinati, Wily Frenzy, Vartika Jha Single == Awards and recognition == === Awards === Year Award Category Work Result Ref. 2022 Lokmat Stylish Awards Most Stylish Youth Icon (Male) 2023 Bollywood Hungama Style Icons Most Stylish Digital Entertainer (Male) 2024 Bollywood Hungama Style Icons Most Stylish Digital Star of the Year === Honours === * 2019 – Time 10 Next Generation Leaders #10 * 2020 – Forbes 30 Under 30 Asia == Related pages == * List of Indian comedians == Notes == == References == == Other websites == * * Category:1999 births Category:Living people Category:Indian people Category:YouTubers",
 "title": "CarryMinati"
}