{
 "id": "1162225",
 "text": "The Noakhali genocide were violent attacks with killings, rapes, and kidnappings, along with stealing and burning of Hindu homes. These acts were done by Muslim mobs in Noakhali, a district in the Chittagong Division of Bengal (now in Bangladesh), during October and November 1946, one year before India became free from British rule. The violence happened in areas under the Ramganj, Begumganj, Raipur, Lakshmipur, Chhagalnaiya, and Sandwip police stations in Noakhali, and also under Hajiganj, Faridganj, Chandpur, Laksham, and Chauddagram police stations in Tipperah. This covered over 2,000 square miles. The killing of Hindus began on 10 October, the day of Kojagari Lakshmi Puja, and continued without stopping for about a week. Around 50,000 Hindus were trapped in these areas controlled by Muslim radicals, where the government had no power. Mahatma Gandhi stayed in Noakhali for four months, traveling through the district to bring peace and harmony. Meanwhile, the Indian National Congress leaders started to accept the idea of dividing India. As a result, peace efforts and relief camps were stopped. Most survivors moved to West Bengal, Tripura, and Assam. == Cause == In 1937, elections were held in India’s provinces, and Muslims got power in Bengal. But under British rule, Hindus had been in charge as zamindars (local rulers). Hindus were also better educated and richer. Some Muslims had old anger against Hindu zamindars and wanted to express it. They got their chance when British rule was ending. Muslims tried to stop Hindus from getting jobs. Muslims were poor in provinces where Hindus were the majority. The partition of Bengal and actions by the Muslim League also caused problems. The relationship between Hindus and Muslims was very weak. The Noakhali riots were mainly because Muslims were angry at Hindus as British rule ended, and because of killings of Muslims in Calcutta. There were also rumors that the zamindar of Ramganj, Rajendra Lal Chowdhury, wanted to sacrifice a Muslim boy instead of a goat. This rumor triggered the riots, which began on 11 October 1946. == Prelude == Tensions between Muslims and Hindus in Noakhali grew after the Calcutta Riots. At first, it was quiet, but the tension increased. Six weeks before the trouble began, the Eastern Command headquarters in Kolkata got reports of unrest in Noakhali and Chittagong villages. Village poets and singers made anti-Hindu songs and poems, sharing them in markets and public places.Mukherjee, Kali Prasanna (2003). দেশ বিভাজনের অন্তরালে [Behind The Partition Of The Country] (in Bengali). Kolkata: Vivekananda Sahitya Kendra. p. 36. === Eid al-Fitr Violence === On 29 August, during Eid al-Fitr, violence broke out. A rumor spread that Hindus had hidden weapons. A group of Hindu fishermen fishing in the Feni River was attacked with deadly weapons. One fisherman died, and two were badly hurt. Another group of nine Hindu fishermen from Charuriah was attacked. Seven needed hospital care.Ghosh Choudhuri, Haran C. (6 February 1947). Proceedings of the Bengal Legislative Assembly (PBLA). Vol. LXXVII. Bengal Legislative Assembly. Devi Prasanna Guha, the son of a Congressman from Babupur village under Ramganj police station, was killed. His brother and a servant were attacked. The Congress office near their house was burned. Chandra Kumar Karmakar of Monpura was killed near Jamalpur. Jamini Dey, a hotel worker, was killed near Ghoshbag. Ashu Sen of Devisinghpur was badly beaten at Tajumiarhat in Char Parvati. Rajkumar Choudhury of Banspara was badly hurt on his way home. Six or seven Hindu families in Kanur Char lost their belongings to looters. In Karpara, a Muslim group with deadly weapons broke into Jadav Majumdar’s house and stole property worth Rs. 1,500. Nakul Majumdar was beaten. Looting also happened at the homes of Prasanna Mohan Chakraborty in Tatarkhil, Nabin Chandra Nath in Miralipur, and Radha Charan Nath in Latipur. Five members of the Nath family in Latipur were injured. The family temple of Harendra Ghosh in Raipur was defiled: a calf was killed and thrown inside. The Shiva temple of Dr. Jadunath Majumdar in Chandipur was also defiled. Household shrines of Nagendra Majumdar and Rajkumar Choudhury in Dadpur were defiled, and idols were stolen. Durga images of Ishwar Chandra Pathak in Kethuri, Kedareshwar Chakraborty in Merkachar, Ananta Kumar De in Angrapara, and Prasanna Mohan Chakraborty in Tatarkhil were broken. === Communal Propaganda === In 1937, Gholam Sarwar Husseini, from a Muslim Pir family, was elected to the Bengal Legislative Assembly as a Krishak Praja Party member. But in the 1946 elections, he lost to a Muslim League candidate. Husseini’s father and grandfather were religious Muslims, and their family were khadims (caretakers) at the Diara Sharif in Shyampur, respected by both Muslims and Hindus. After the Direct Action Day riots in Kolkata, Husseini gave fiery speeches, telling Muslims to take revenge for the Kolkata riots. In some areas, Hindu shops were boycotted. Muslim boatmen in Ramganj and Begumganj refused to take Hindu passengers. In early September, Muslims looted Hindu shops in Sahapur market. Hindus traveling home from Kolkata for puja holidays were harassed. From 2 October, killings, thefts, and looting became common. == Events == Governor Burrows said the riots started when a market in Ramganj was looted after a big meeting where Gholam Sarwar Husseini gave a fiery speech. Businesses belonging to Surendra Nath Bose and Rajendralal Roy Choudhury, a Hindu leader, were attacked. === Violence === On 10 October, during Kojagari Lakshmi Puja, Bengali Hindus were busy with puja when Ghulam Sarwar led a Muslim crowd to Sahapur market. Another Muslim leader, Kasem, brought his private army, Kasemer Fauz. On 11 October, Gholam Sarwar’s army, Miyar Fauz, attacked Rajendralal Roychowdhury’s home. He was the president of Noakhali Bar and the Hindu Mahasabha. Swami Tryambakananda of Bharat Sevashram Sangha was a guest in his house. Roychowdhury defended his home with a rifle from his terrace all day. At night, he sent his family and the swami to safety. The next day, the mob attacked again, and Roychowdhury’s severed head was brought to Gholam Sarwar on a platter. Sucheta Kriplani said Roychowdhury became a martyr, like Shivaji and Guru Gobind Singh, defending his faith and honor. Acharya Kripalani, a believer in non-violence, said Roychowdhury’s defense was the closest example to non-violence. ==== Nandigram ==== In Nandigram, Gholam Sarwar Husseini's private army burned the Nag family’s house, the post office, and the school built by Ramanikanta Nag. Hindus from nearby areas had taken shelter in the Nag residence. The police first protected them and stopped the attackers, but then the attackers began looting the village. On 13 October at noon, 200 to 250 Muslims with deadly weapons attacked Hindus in Changirgaon. They burned 1,500 maunds of paddy and destroyed all the temples. Hindu women were stripped of their shankha and sindur, and men were forced to perform namaz.Nayyar, Pyarelal (1966). Mahatma Gandhi: The Last Phase. Vol. I (2) (2nd ed.). Ahmedabad: Navajivan Publishing House. pp. 91–92. OCLC 773250180. ==== Ramganj Police Station ==== On 14 October, Jogendra Chandra Das, the M.L.A. from Chandpur, wrote to Jogendra Nath Mandal, saying that thousands of Scheduled Caste Hindus were attacked in the Ramganj area of Noakhali. Their homes were looted and burned with petrol, and they were forced to become Muslims.Biswas, Bipad Bhanjan (2003). Bharat Bibhajan: Jogendranath O Dr. Ambedkar (in Bengali). p. 44. In Sandwip, an island without motor cars, petrol was brought from the mainland to burn houses. Rakesh Batabyal noted that using petrol and kerosene showed the attacks were planned and organized. Freedom fighter Lalmohan Sen was killed when he tried to stop a Muslim mob from killing Hindus. The violence began in Ramganj on 10 October 1946. It spread to Raipur, Lakshmipur, Begumganj, and Sandwip in Noakhali and to Faridganj, Hajiganj, Chandpur, Laksham, and Chudagram in Tipperah. Gandhian Ashoka Gupta reported that at least 2,000 Hindus were forced to become Muslims, six women were forced into marriage, and one person was killed. The official report put the number at 200. ==== Forcible Conversions ==== When reports of killings and forced conversions appeared in the news, Star of India, a newspaper supported by the Muslim League, denied them. But Huseyn Shaheed Suhrawardy, answering a question in the assembly, said there were 9,895 forced conversions in Tipperah. The exact number in Noakhali was unknown but was in the thousands. Edward Skinner Simpson reported 22,550 forced conversions in Faridganj, Chandpur, and Hajiganj in Tipperah. Dr. Taj-ul-Islam Hashmi concluded that many more women were raped or converted than people were killed. Justice G. D. Khosla stated that all Hindus in Noakhali lost their possessions and were forced to become Muslims. === Official Developments === On 13 October, Kamini Kumar Dutta, a leader of the Indian National Congress in the Bengal Legislative Council, went to Noakhali on his own. He spoke to Abdullah, the District Superintendent of Police. On 15 October, he met the Minister of Civil Supplies on his way to Noakhali. After returning, he contacted the Home Department of the Interim Government. He asked for strong action and said it was too dangerous for outsiders to enter the troubled areas. He also said the authorities were trying to hide the truth. No forces were sent to the area until 14 October. Huseyn Shaheed Suhrawardy, the Prime Minister of Bengal, held a press conference in Kolkata on 16 October. He admitted Hindus in Noakhali were forced to convert and their property was looted. He claimed the violence had ended but did not know why it started. He explained that troops could not move in because canals were blocked, bridges were broken, and roads were damaged. He suggested dropping warnings from airplanes instead of sending soldiers. On 18 October, Frederick Burrows, the Governor of Bengal, Suhrawardy, and the Inspector General of Police flew over the affected areas after visiting Feni. Later, the Government of Bengal sent a team to Noakhali and Tipperah. The team included Jogendra Nath Mandal, the Law Minister in the Interim Government; Shamsuddin Ahmed, the Labour Minister; Abul Hashim, Secretary of the Bengal Muslim League; Fazlur Rahman; Hamidul Huq Choudhury; Moazzem Hossain; A. Malik; and B. Wahiduzzaman. On 19 October, Jivatram Bhagwandas Kripalani, the president-elect of the Indian National Congress, Sarat Chandra Bose, a member of the Interim Government, and others, including Sucheta Kripalani, Major General A. C. Chatterjee, and the editor of Anandabazar Patrika, flew to Chittagong after Mahatma Gandhi suggested it. They stopped in Comilla, where many Hindus told them about the violence. In Chittagong, Governor Burrows told them Suhrawardy claimed everything was peaceful. He also made a statement that rape and molestation of Hindu women were \"natural\" because they were more attractive than Muslim women. On 21 October, Arthur Henderson, the Under- Secretary of State for India and Burma, read a report from the Governor of Bengal in the House of Commons. It said that the number of deaths would likely be in the hundreds. Sarat Chandra Bose disagreed, saying 400 Hindus were killed in one attack at landlord Surendranath Bose’s house. On 25 October, at a meeting in New Delhi led by Suresh Chandra Majumdar, a resolution was passed to demand the removal of the Governor of Bengal, dismissal of the Muslim League ministry, and action from the central government. On 26 October, Lieutenant General F. R. R. Bucher, the Eastern Command leader, told a press conference in Kolkata it was hard to say how long it would take to regain the people’s trust in the government. == References == === Citations === Category:Attacks on Hindu temples in Bangladesh Category:Religious riots in Bangladesh Category:Anti-Hindu violence in Bangladesh Category:Partition of India Category:Bangladesh Category:India Category:1946",
 "title": "Noakhali genocide"
}