{
 "id": "1162865",
 "text": "==History== The first Pasig River Lighthouse tower was erected and later lit on September 1, 1846 — at the site of a light station installed in 1642 by the Philippines' Spanish colonial government.\"El Archipielago Filipino\", p.531. Washington: Imprenta del Gobierno, 1900. From its location at the mouth of the historic Pasig River, which divides Manila into north and south sections, the light was a welcoming beacon for all mariners of inter-island vessels entering the Pasig River and bringing their vessels up for berthing along its busy wharves. In 1870, the light apparatus of the lighthouse was replaced with a new fixed red light with a shorter visibility because of its color, but easily distinguishable from the other lights of the city than the former white. The 1877 almanac, \"Anuario Filipino para 1877\", noted that the color of the lighthouse was changed from white to yellow (amarillo) and was manned by two lighthouse keepers. ==The white Lighthouse Tower== The first Pasig River Light constructed in 1846 was a white 5-storey, 49-foot (15 m) tower with four tangent cylindrical lower levels, and a gallery-lantern room centered above the fourth level.\"5 Tangent Circles\". Clip Art Etc. Retrieved on 2014-10-31. The white tower had an effective focal point height of above sea level and sat at the end of the north jetty at the Pasig River mouth. Its original light was a fixed white light visible for . ==The yellow Lighthouse Tower== A replacement tower painted yellow was built in 1870 on the foundation of the original tower, constructed with reinforced concrete. The lighthouse had a conical structure with a focal plane of 43 feet (13 m) above water and a tower height of 46 feet (14 m), slightly shorter than the old tower at 49 feet (15 m). ==Coast Guard Station== The Philippine Coast Guard Station of Manila located itself adjacent to the lighthouse; as all lighthouses in the Philippines and other aids to navigation are maintained by the Maritime Safety Services Command division of the Philippine Coast Guard. In 1992, the legacy Pasig River Lighthouse was demolished without explanation despite its historical significance, and replaced with a modern structure. ==References== ==Other websites== * Spanish Lighthouses of the Philippines * Images of the new lighthouse from Backpacking Philippines and Asia. * Maritime Safety Services Command Category:Lighthouses of the Philippines",
 "title": "Pasig River Lighthouse"
}