{
 "id": "1162576",
 "text": "\"A Question of Lust\" is a 1986 song by Depeche Mode and is the second single from their fifth studio album Black Celebration. It went to number 28 in the United Kingdom, number 13 in Ireland, number 8 in Germany, number 19 in the Netherlands, number 17 in Sweden, number 15 in Finland, number 12 in Switzerland and number 32 in Belgium. ==Track listings== All songs written by Martin L. Gore, except \"Christmas Island\", written by Gore and Alan Wilder, and \"If You Want\", written by Wilder. * 7\" single: Mute / 7Bong11 (UK) # \"A Question of Lust\" – 4:29 # \"Christmas Island\" – 4:51 * The single version is basically the album version but without the cross-fade from the previous track (\"Fly on the Windscreen\"). * 12\" single: Mute / 12Bong11 (UK) # \"A Question of Lust\" – 4:29 # \"Christmas Island (Extended)\" – 5:37 # \"People are People (Live)\" – 4:21 # \"It Doesn't Matter Two (Instrumental)\" – 2:49 # \"A Question of Lust (Minimal)\" – 6:49 * Released on CD in Germany by Intercord: INT 826.841 (1986) * Cassette single: Mute / CBong11 (UK) # \"A Question of Lust (Flood Mix)\" – 5:07 [*] # \"Christmas Island\" – 4:51 # \"If You Want (Live)\" – 5:16 # \"Shame (Live)\" – 4:13 # \"Blasphemous Rumours (Live)\" – 5:25 * This format came in a 7\" card envelope with an insert and a badge. * Released on 12\" in Germany by Intercord: INT 126.844 (L12Bong11) (1986). This was the only vinyl release of the UK Mute CBONG11 cassette * Released on CD in France by Virgin: 30167 (1986). This was the only, very rare CD release of the CBONG11 cassette. * Alan Wilder is quoted as saying that when Flood eventually delivered his remix of \"A Question of Lust\", the band were surprised to hear that half of the sounds had been omitted. They were understandably annoyed therefore when it emerged that Mute Records had not actually sent him both the multi-track tapes. * CD single: Mute / CDBong11 (UK) # \"A Question of Lust\" – 4:29 # \"Christmas Island\" – 4:51 # \"Christmas Island (Extended)\" – 5:37 # \"People Are People (Live)\" – 4:21 # \"It Doesn't Matter Two (Instrumental)\" – 2:49 # \"A Question of Lust (Minimal)\" – 6:49 * The CD single was released in 1991 as part of the singles box set compilations * 7\" single: Sire / 7-28697-DJ (US) # \"A Question of Lust (Robert Margouleff Remix)\" – 3:45 # \"A Question of Lust\" [Edit] – 4:14 [*] * The Edit version of \"A Question of Lust\" on the US commercial 7\" single is not actually labelled as such. The only difference between the \"Edit\" and the normal single version is that it is faded about 20 seconds earlier. * 12\" single: Sire / 0-20530 (US) # \"A Question of Lust (Minimal)\" – 6:49 # \"Black Celebration (Live)\" – 6:05 # \"A Question of Time (Extended Remix)\" – 6:38 # \"Something to Do (Live)\" – 3:50 * \"A Question of Lust (Minimal)\" is titled \"A Question of Lust (Extended Version)\" * Double A-side with \"A Question of Time\" ==References== Category:1986 songs Category:Depeche Mode songs Category:Synth-pop songs",
 "title": "A Question of Lust"
}