{
 "id": "1162273",
 "text": "Nawaf Abdallah Salim Salam (born 15 December 1953) is a Lebanese politician, lawyer and academic. He has been the prime minister-designate of Lebanon since 2025. Before, he was the President of the International Court of Justice from 2024 to 2025. == Early Life and Background == Nawaf Salam was born in Lebanon, Beirut in 1953. He grew up in a well-known Sunni Muslim household and his family have played a significant part in Lebanese political life since the Ottoman rule over the region. His grandfather, Salim Ali Salam, was a key leader in the Beirut Reform Movement, aimed at modernizing and decentralizing the Ottoman Empire. Salim also represented Arab interests against Ottoman rule and French Colonial influence in the First Arab Congress in Paris. His uncle, Saeb Salam, was elected Prime Minister four times from 1952 until 1973. His cousin, Tamman Salam, also was elected as Prime Minister in 2014. === Education and Beginning of Legal Career === In 1974, Salam got his degree from the School of Advanced Studies in Social Sciences. In 1979, he earned a PhD in history from Sorbonne University, where he would go on to teach Middle Eastern History until 1981. After receiving a bachelor’s degree in law from Beirut University in 1984. Here, he began his legal career the following year at Takla Law Firm. In the following years, he took on a research position at Harvard Law School, where he would also receive a master’s degree in Law in 1991. During this time, he also worked as a foreign legal consultant for Edwards & Angell LLC. In 1992, he earned a PhD in Political Science at Science Pol University. Salam continued his work at Takla Law Firm from 1992 onwards, alongside teaching International Law and International Relations at the American University of Beirut. == Career == === Government Work & United Nations === Salam worked as a member of Lebanon’s National Electoral Commission, and as a member of the Lebanese National Commission of UNESCO. On top of that, he worked on the Socio-Economic Council of Lebanon. In 2007, Salam began his career as ambassador and permanent representative of Lebanon in the United Nations. At the start of his career, he called for a halt of Israeli violence in Lebanese territories, and worked towards the implementation of U.N Security Council Resolution 1701. Salam also chaired meetings for the U.N Security Council, from 2010 to 2011. At the time, Lebanon had non-permanent membership on the U.N Security Council. === International Court of Justice === In 2017, Salam was elected to the International Court of Justice. He was the second Lebanese judge to be elected in the court's history. Here, he would later be elected as the president of the ICJ in 2024, which happened at the same as South Africa's genocide case against Israel. Salam resigned from his position as President on the 14th of January 2025 even though his term was due to end on the 5th of February 2027. === Premiership === Salam first became a candidate for premiership in 2022, but lost in the Lebanese election to Najib Mikati, who took over as Caretaker Prime Minister. He became Lebanon's Prime Minister on the 8th of February 2025 after winning two thirds of the parliamentary votes. This marked the first complete Lebanese government since 2022. Backed by President, Joseph Aoun, was well-recieved by many, including Christian and Sunni groups. However, his appointment was met with some criticism from the Iranian-backed Shi'a militant group Hezbollah. Salam's premiership is described as many as a move towards political reform and reduced influence of Hezbollah, compared to his competitor Najib Mikati. == Personal Life == Salam's wife, Sahar Baassiri, is a journalist and Lebanon's ambassador to UNESCO. Together they have two sons named Abdullah and Marwan. ==References== Category:1953 births Category:Living people Category:Prime ministers of Lebanon Category:Academics Category:Judges Category:Lawyers Category:People from Beirut",
 "title": "Nawaf Salam"
}