{
 "id": "1162745",
 "text": "In chemistry, the degree of substitution of a chemical compound is the number of substituents - more complex pieces of a large molecule - which have replaced parts of a simpler molecule to which the compound is related. == Alkanes and alkyl compounds == In alkanes, compounds containing only carbon and hydrogen, each carbon atom is assigned a degree of substitution based on the number of bonds it has to other carbon atoms: * A carbon atom bonded to a single other carbon atom is a primary carbon (1°). These are normally the \"ends\" of carbon chains. The carbon atom in methane is also considered a primary carbon by convention. * A carbon atom bonded to two other carbon atoms is a secondary carbon (2°). Most alkanes are mostly made up of secondary carbons. * A carbon atom bonded to three other carbon atoms is a tertiary carbon (3°). Isobutane is the simplest compound containing a tertiary carbon. * A carbon atom bonded to four other carbon atoms is a quaternary carbon (4°). Neopentane is the simplest compound containing a quaternary carbon. Alkyl groups and some alkane derivatives like alcohols are sometimes named by the degree of the carbon where it connects to the rest of the molecule. For example, there are four isomers of butanol, but only one of them has the hydroxyl group connected to a tertiary carbon, so that specific isomer is called tert-butyl alcohol (short for tertiary butyl alcohol). == Amines == Amines have their degree based on the number of carbon atoms attached to the nitrogen atom: * A primary amine (1°) has one carbon atom and two hydrogen atoms. Methylamine is the simplest primary amine. * A secondary amine (2°) has two carbon atoms and one hydrogen atom. Dimethylamine is the simplest secondary amine. * A tertiary amine (3°) has three carbon atoms all bonded to the hydrogen atom. Trimethylamine is the simplest tertiary amine. Much like ammonia () can gain a hydrogen atom to become ammonium (), it is possible for organic nitrogen to be attached to a fourth carbon atom in a polyatomic cation. These compounds are known as quaternary ammonium cations. == References == Category:Organic chemistry Category:Chemical nomenclature",
 "title": "Degree of substitution"
}