{
 "id": "1162953",
 "text": "The Goyim Defense League (GDL) is one of the most active American Neo-Nazi groups as of February 2025. ==Background== The GDL has been led by Neo-Nazi agitator Jon Minadeo II since its founding in 2018. On the internet, the GDL is active on social media, operating a television called the GoyimTV. In real life, the GDL regularly harasses American Jews by holding violent marches and dropping antisemitic flyers over Jewish neighborhoods. ===Support for Islamist groups=== The GDL supports the Hamas, Houthis, Hezbollah and Iranian theocracy. * * * * * The GDL celebrated the October 7 massacre in 2023 and attended pro-Palestinian events to recruit new followers and adopt anti- Zionist rhetoric to expand their influence. While some critics expressed confusion over this, often due to the popular perception that Neo-Nazis are anti-Muslim, it is not a historical anomaly. Collaboration between Nazis and Islamists happened during the Holocaust * * * * * * * * * * and in post-war America, * Evanzz, Karl, The Judas Factor, The Plot to Kill Malcolm X, pp. 205–206, Thunder's Mouth Press, NY, 1992; Marable, Manning, Along the Color Line , reprinted in the Columbus Free Press, January 17, 1997. * Rolinson, Mary, Grassroots Garveyism, p. 193, UNC Press Books, 2007. * Washington Post, May 6, 1967, p. E-15, July 2, 1967, January 30, 1975, p. B7; Hakim Jamal, From the Dead Level, pp. 247–48; Louis Lomax To Kill a Black Man, pp. 108–09; Karl Evanzz, The Judas Factor, pp. 284–86, The Messenger, p. 303. * \"The Messenger Passes\", Time, March 10, 1975. * * * * * despite the relative lack of coverage in history textbooks. * Lappin, Shalom (2006), ‘How Class Disappeared from Western Politics’, Dissent, Vol. 51, No. 1, pp. 73-78. * * * * Kirsch, Adam (2024), On Settler Colonialism: Ideology, Violence, and Justice, W.W. Norton and Company, New York and London. * ==Activities== ===2018=== ====Name the Jew tour==== GDL member Patrick Little ran on a Republican Party ticket in the 2018 United States Senate election in California for Dianne Feinstein's seat. The California Republican Party later condemned and removed Little from their convention in San Diego. Little stomped on an Israeli flag in response: Afterwards, Little toured the country from July to August 2018 with placards alleging that \"Jews Rape Kids\", \"Jews Killed 30 Million\" and \"The Holocaust is a Lie.\" He accused Israel of having planned the September 11 attacks, controlled the Atlantic slave trade and killed Jesus. Despite having been removed from the convention, Little received 62,830 votes (1.4%). Little refused to admit defeat by alleging that he was a victim of voter fraud by \"the Jewish supremacists and the Zionists\". ===2019=== Little moved to Idaho to run for one of two vacant seats in the 2019 Garden City Council election. He came in last with 126 votes (3.7%). ===2023=== In June 2023, the GDL put antisemitic flyers into mailboxes across Plainview, New York, blaming Jewish lawmakers for gun control. In August 2023, the GDL did it again in Fairfax County, Virginia. ====Antisemitic hate crimes in the Netherlands==== GDL member Robert Wilson was arrested in Poland to be extradited to the Netherlands for allegedly projecting an antisemitic message onto the Anne Frank House. Other GDL members did the same in the U.S., especially at the Florida-Georgia football game in Jacksonville, Florida. ====March of the Red Shirts==== On September 2, 2023, GDL teamed up with the Neo-Nazi group Blood Tribe to march in Altamonte Springs, Florida, during which they waved Nazi flags, made Nazi salutes and shouted \"Heil Hitler.\" ====Support for the October 7 massacre==== When the October 7 massacre happened in 2023, Minadeo cheered the massacre in a live episode, Just as the GDL, the Traditionalist Worker Party (TWP) – a Neo-Nazi party seeking to build a \"national socialist\" ethno-state for White people – endorsed the October 7 massacre by adopting the anti-Zionist Islamist rhetoric in their antisemitic propaganda: Meanwhile, the Neo-Nazi group National Socialist Front (NSF) Florida, also known as the Natsoc Florida, took a step further by selling T-shirts that featured Hamas paragliders and rifles alongside the slogan \"F*** Israel\" – a popular image among Islamists since October 7, 2023. ====Antisemitic hate crimes in Tennessee, United States==== In July 2024, the GDL teamed up with several pro- Palestinian Neo-Nazi groups to hand out antisemitic flyers across Tennessee. They asked passer-bys if they were Jewish and disrupted a city council meeting in Nashville, Tennessee. The Jewish Federations of North America of Greater Nashville held a 400-person march in response. ==Related pages== * Ku Klux Klan * Nation of Islam * Holocaust inversion * Holocaust trivialization * Black Hebrew Israelites * Calls for the destruction of Israel * Roman Catholics and antisemitism in the 21st century ==References== Category:Nazism Category:Racism Category:Fascism Category:Islamism Category:Neo-Nazis Category:Neo-Nazism Category:Antisemitism Category:United States Category:Discrimination Category:21st-century establishments in the United States",
 "title": "Goyim Defense League"
}