{
 "id": "1162559",
 "text": "The Honda Fit is a subcompact car made by Honda since 2001. == First Generation (2001-2008) == The Honda Fit debuted for the first time in Japan in 2001 and later in Europe (as the Honda Jazz) and other regions. The North American version was shown at the North American International Auto Show in 2006 in The United States and Canada. It debuted in 2006 as a 2007 model. The First Generation had a 1.2 (available in Europe only), 1.3, and 1.5 liter petrol engines, as well as a 5-speed both manual and automatic CVT transmissions. == Second Generation (2007-2014) == The Second Generation of the Fit was launched at the Tokyo Motor Show in 2007 the second gen is bigger than the first Gen and won The Car Of The Year Japan. It has a 1.2 (available in Europe only), 1.3, and 1.5 liter petrol engines. A hybrid version combining a 1.3 liter petrol engine with a electric motor was launched in 2010. The car also has a 5-speed and 6-speed manual transmissions. A 5-speed automatic transmission and a 6-speed manual automated CVT transmission. The Fit also has a electric version called Fit EV first shown as a concept and then mass produced the production version was shown at the Los Angeles Auto Show in 2011. it was facelifted in 2011. == Third Generation (2013-2020) == The third Generation was introduced in 2013 and retains the same concept as the previous generations. The third gen Fit also shares its platform with the Honda HRV. It has a 1.2, 1.3, and 1.5 liter petrol engines, as well as a 1.5 liter turbo diesel engine (only available in India ) with a 5-speed and 6-speed manual transmissions. Like the previous generation, the third generation has a hybrid version combining a 1.5 liter petrol engine with a electric motor, and has a 7-speed DCT transmission. The hybrid version was sold only in Japan and Malaysia, and the third generation got facelifted in 2017. == Fourth Generation (2020-present) == The fourth Generation was shown at the Tokyo Motor Show and in Amsterdam, Netherlands in 2019. This generation isn't sold in North America due to weak sales of the previous generation, and was discontinued in other markets. The Fit has a 1.3 liter (available in Japan only), and 1.5 liter petrol engines, as well as a hybrid version with a CVT transmission and a e-CVT (in hybrid version only); it was later facelifted. == Markets == The Honda Fit is currently sold in Japan, Europe (where is available as a hybrid only), South Africa, Brunei, China, Singapore, New Zealand, Taiwan, and Hong Kong. In Latin America and many Southeast Asian countries, it was replaced by the Honda City hatch, and was discontinued in North America due to weak sales of subcompact cars. == References == Category:Honda automobiles Category:2000s automobiles Category:2010s automobiles Category:2020s automobiles",
 "title": "Honda Fit"
}