{
 "id": "1162482",
 "text": "XXYY syndrome is a rare genetic disorder. Usually, a male will have one X chromosome and one Y chromosome, but people with this disorder have two of each. They have 48 chromosomes instead of the usual 46. There are many different symptoms this disorder causes, such as mental issues and problems with the reproductive system. About 1 in every 18,000 to 40,000 males have XXYY syndrome. == Symptoms == === Physical === People with XXYY syndrome are usually very tall. The average height for people with this disorder is 193 cm (6 ft 4 in). People with XXYY syndrome may also have problems with their skeleton. These problems include clinodactyly (very curved or bent fingers), radioulnar synostosis (where the ulna and radius bones in the arm are connected), and flat feet. It is also common for people with XXYY syndrome to have problems with their teeth. People with XXYY syndrome have a higher chance of having other conditions. Examples include asthma, type 2 diabetes, seizures, and strabismus. === Mental === Nearly every person with XXYY syndrome has a learning disability, but some people's learning disability may be more severe than someone else's. It is also common for someone with this disorder to have an intellectual disability. The average IQ in people with XXYY syndrome is around 60 to 80 (the average is around 90 to 109). People with XXYY syndrome are usually shy. However, they may be more aggressive, hyperactive, and impulsive. People with XXYY syndrome may have dyspraxia. This means they may be clumsy, trip often, and have troubles walking up stairs. People with XXYY syndrome have a higher chance of getting mental disorders. Examples include autism, attention-deficit hyperactivity disorder (ADHD), generalized anxiety disorder, and depression. === Reproductive === People with XXYY syndrome usually have a smaller penis and testes. The testes in people with XXYY usually do not make enough testosterone. If this is not treated, then people with XXYY syndrome may not have body hair and they also have low energy. Gynecomastia, a condition where a male's breasts are larger, could also happen. Azoospermia is common. This is a condition where a male cannot produce sperm. Becaues of this, many people with XXYY syndrome are infertile (cannot have kids). == Diagnosis == XXYY syndrome is diagnosed by a karyotype. This is when geneticists examine and test someone's DNA to look at their chromosomes. This test would find that a male has two X chromosomes and two Y chromosomes instead of one of each. == Treatment == Many people with XXYY syndrome struggle with having low testosterone levels. Because of this, some people with the disorder will take medications that give them more testosterone. This can improve the strength of their bones and muscles and improve their mental abilities. Many people with XXYY may see an endocrinologist (a doctor who helps with hormones in the endocrine system) regularly. People with XXYY syndrome usually struggle with talking. They may need help with speech, even into adulthood. Adults with XXYY syndrome usually need help learning how to do daily tasks. == Prognosis == People with XXYY syndrome have a normal life expectancy. However, they usually need regular medical checkups. == Prevalence == About 1 in 18,000 to 40,000 males have XXYY syndrome. == History == XXYY syndrome was first found in 1960 in Manchester, England. A 15-year-old boy with an intellectual disability and symptoms of Klinefelter syndrome (where a male has only one extra X chromosome) and was tested. However, it was found he had two X chromosomes and two Y chromosomes. Because XXYY syndrome is similar to Klinefelter syndrome, it was originally thought to be a variant of Klinefelter syndrome. However it has since been considered to be a separate disorder. == References == Category:Genetic disorders Category:Syndromes",
 "title": "XXYY syndrome"
}