{
 "id": "1162606",
 "text": "Ferdinand II (9 July 1578 (NS: 19 July 1578) — 19 February 1637) was the Holy Roman Emperor, King of Bohemia, Hungary, and Croatia from 1619 to 1637 He was the son of Charles II Francis of Austria and Maria Anna of Bavaria. He was succeeded by his son Ferdinand III, Holy Roman Emperor. He was the cousin (1st cousin, once removed) of his predecessors Matthias, Holy Roman Emperor and Rudolf II, Holy Roman Emperor, and because they had no children he became the Holy Roman Emperor. ==Issue== Name Main title Birth Death Notes By Maria Anna of Bavaria (married 23 April 1600) died 8 March 1616 By Maria Anna of Bavaria (married 23 April 1600) died 8 March 1616 By Maria Anna of Bavaria (married 23 April 1600) died 8 March 1616 By Maria Anna of Bavaria (married 23 April 1600) died 8 March 1616 By Maria Anna of Bavaria (married 23 April 1600) died 8 March 1616 Archduchess Christine none 25 May 1601 12/21 June 1616 Died very young Archduke Charles none 25 May 1603 25 May 1603 Died at childbirth Archduke John-Charles none 1 November 1605 26 December 1619 none Ferdinand III Holy Roman Emperor 1637 — 1657 13 July 1608 2 April 1657 married in: * 1631 Maria Anna of Spain * 1648 Maria Leopoldine of Austria * 1651 Eleanor Gonzaga , had issue Archduchess Maria Anna of Austria Electress Consort of Bavaria 1635 — 1651 Electress Palatine 1635 — 1648 13 January 1610 25 September 1665 married in 1635 Maximilian I, Elector of Bavaria, had issue Cecilia Renata of Austria Queen consort of Poland 1637 — 1644 16 July 1611 24 March 1644 married in 1637 Władysław IV of Poland, had issue Archduke Leopold Wilhelm of Austria military (Holy Roman Empire) 1640 — 1656 5 January 1614 20 November 1662 didn’t marry By Eleanora Gonzaga (married 2 February 1622) By Eleanora Gonzaga (married 2 February 1622) By Eleanora Gonzaga (married 2 February 1622) By Eleanora Gonzaga (married 2 February 1622) By Eleanora Gonzaga (married 2 February 1622) no issue no issue no issue no issue no issue ==Ancestry== ==Male-line family tree== ===Gallery related to Ferdinand II, Holy Roman Emperor=== Portrait of Ferdinand II, Holy Roman Emperor (Kunsthistorisches Museum, Wien).jpg|Ferdinand II as an archduke, Jan van den Hoecke - Portrait of Emperor Ferdinand III.jpg|Ferdinand III, Holy Roman Emperor, Ferdinand's son Joachim von Sandrart - Erzherzogin Maria Anna (1610-1665), Kurfürstin von Bayern.jpg|Archduchess and Electress Maria Anna of Austria, Ferdinand's daughter ==Regnal titles== |- |} ==References== ==Other websites== Category:Holy Roman Emperors Category:1578 births Category:1637 deaths Category:People from Graz Category:Habsburg Dynasty Category:Kings and queens Category:Archdukes and Archduchesses of Austria",
 "title": "Ferdinand II, Holy Roman Emperor"
}