{
 "id": "1162770",
 "text": "The Honda Freed is a mini MPV made by Honda since 2008 it replaced the first generation Honda Mobillio in Japan. == First Generation (2008-2016) == The first generation Honda Freed was launched in 2008 this gen shares its platform with the Fit/Jazz it has the same engine from the Fit and the Honda City which is a 1.5 liter petrol engine with a 5-speed automatic CVT transmission. the Freed also has a hybrid version this version combines a 1.5 liter petrol engine with a electric motor. Honda also released a \"soul twinbrother\" of the MPV called Freed Spike this version was sold only in Japan.New Honda Freed Spike \"Lifestyle\" Minivan Debuts in Japan and the Freed was later facelifted in 2011. == Second Generation (2016-2024) == The Second Generation of the Honda Freed was shown in June 2016 later in September it was launched in Japan.Honda Begins Sales in Japan of All-New Freed and Freed+ Compact Minivan the Freed has the same design as the previous gen but it has updated grills and lights and there's also the Freed X a five-seater version that replaced the Freed Spike. the second generation has also a 1.4 liter petrol engine with a hybrid version and a CVT transmission and a 7-speed automatic transmission (availiable only in the hybrid version) it was facelifted in 2019.「FREED/FREED+」の改良モデルをホームページで先行公開 == Third Generation (2024-present) == The Third generation was shown in May 2024 and launched in June 2024. like the previous gens it also has petrol and hybrid versions and has two versions which are:the air and a rugged crossover-style version called the Crosstar the air comes with a three-row 6 seating while the Crosstar has a two-row 5 seating the third generation won the Japan car of the year in 2024 and 2025. == Markets == The Honda Freed is sold only in the Japanese market it was previously sold in Thailand Malaysia Singapore and Hong Kong in Indonesia starting 2009 the first generation was sold and produced locally there in Karawang the Freed was then discontinued in the Indonesian market in 2014 due to weak sales. == References == Category:Honda automobiles Category:Minivans Category:2000s automobiles Category:2010s automobiles Category:2020s automobiles",
 "title": "Honda Freed"
}