{
 "id": "1162019",
 "text": "Ta Mok (Khmer: តាម៉ុក; 1924–March 1926 – July 21, 2006) was a Cambodian military officer and soldier. He was one of the most important members of the Khmer Rouge. They were the group that committed the Cambodian genocide from 1975 to 1979. Ta Mok became known as the \"Butcher\" because of the mass murders he caused during the Cambodian genocide. He was arrested in 1999 and died in 2006 while waiting for a trial for crimes against humanity. ==Early life== Ta Mok was born to a fairly wealthy family in the village of Pra Keep in the district of Takéo. He had Chinese heritage.Jurisdictional and Definitional Issues Jurisdictional and Definitional Issues , Bora Touch, Khmer Institute It is not known when he was born. Sources put his birth from 1924 to March 1926. His real name is also not known. Sources vary and say it is Ung Choeun, Chhit Choeun, or Ek Choeun. He became a Buddhist monk in the 1930s but left when he was 16. ==Career== Ta Mok was against the French and Japanese rule over Cambodia in the 1940s. In 1952, he joined Khmer Issarak, a political party for people who were against French colonialism. He then joined the Communist Party of Kampuchea, whose members were called the Khmer Rouge. By the late-1960s, Ta Mok had become very powerful in the party. Pol Pot, the leader of the Khmer Rouge, chose for Ta Mok to become the leader of the army for Democratic Kampuchea. In 1973, Ta Mok had captured parts of Cambodia during the Cambodian civil war. In March 1974, he and Ke Pauk had 20,000 civilians murdered or enslaved after capturing Oudong, a large city in Cambodia. On 17 April 1975, the Khmer Rouge fully captured Cambodia and the Cambodian genocide began. Ta Mok earned the nickname \"Butcher\" because of the mass executions he ordered during the Cambodian genocide. For example, he once ordered 30,000 people to be killed in the district of Angkor Chey. In December 1978, Vietnam invaded Cambodia due to the Cambodian genocide. In January 1979, the Khmer Rouge's rule was ended and the genocide ended. However, Ta Mok kept fighting. He led many guerillas (small groups that fight against a government's army) against the new Cambodian government. In the early-1980s, he lost his leg in a landmine. In 1997, the Khmer Rouge split into two groups because of political disagreements. Ta Mok led one group while Pol Pot led the other. Ta Mok arrested Pol Pot and put him under house arrest because he was scared that Pol Pot may execute him. This was because Pol Pot ordered the execution of another important Khmer Rouge member, Son Sen, in June. Pol Pot died on 15 April 1998. Ta Mok said, \"It is good that Pol Pot is dead. I feel no sorrow,\" and, \"I hope he suffers after death.\" ==Imprisonment and death== On March 6, 1999, Ta Mok was arrested by the Royal Cambodian Armed Forces. In February 2002, he was charged with crimes against humanity. Ta Mok was kept in solitary confinement. He only left for hospital visits because of respiratory (lung) problems. On 21 July 2006, Ta Mok went into a coma and died of heart issues because of how stressed he was over the trial. Since his death in 2006, Ta Mok's house has become a small tourist site. ==References== Category:1924 births Category:2006 deaths Category:Cambodian genocide",
 "title": "Ta Mok"
}