{
 "id": "1162736",
 "text": "CapCut, known in China as JianYing () formerly ViaMaker, is a chinese video editing app. It was created by ByteDance, the Company that owns TikTok. == History == CapCut was first released in China in 2019. At first, it was only available for iPhone and Android. In 2020, it was renamed to CapCut (from ViaMaker). It also became available around the world. CapCut was later released to Mac and Windows devices. In 2022, CapCut had 200 million active users. In March 2023, it was the second-most downloaded app in the US, behind the store Temu. CapCut has over 1 billion downloads on the Google Play Store. == Features == The free version of CapCut has many features. They include speeding up and slowing down clips, and the Auto Captions tool that can be used to generate video captions. CapCut supports basic video editing functions. These include editing, trimming, and splitting clips. It allows the addition of new clips to projects but is limited to single-layer editing. However, the app supports overlay options that enable additional effects, including multi-layer editing. Users can also use many types of effects such as trending, opening and closing, nightclub, retro, glitch and distortion, vlog 3D, cartoon, dark and split. Users can export or save completed projects directly to different social media platforms. == CapCut Pro == CapCut Pro was released in 2023. It features things like Pro Effects, Pro tools, and other things included with Pro at the time not a lot of things were using a pro. In the middle of 2024, people started removing the app. This is because much of the app's features were pro. This angered many people. CapCut lost half of its users because of this problem. == CapCut for Business == Some businesses use CapCut for making ads for their business, along with TikTok to promote and post their ads. The new features come with AI in CapCut. By using AI technology business owners can make AI-generated ads for their businesses. CapCut has options for businesses as well as using business mode which comes with business sounds to avoid copyright from using them for commercial use. Businesses use CapCut to normally edit as well. With such a free and easy editor their edits will help them boost popularity. This is why CapCut adores business. == TikTok and CapCut ban == On January 18 around 7:30-7:50, CapCut was made unavailable due to a ban signed by president (at the time) Joe Biden. There was a message saying \"CapCut is temporarily unavailable\" with a note on the bottom. This ban would mean businesses would not be able to create edits, ads, or use AI to design products. This decision got many bad reactions but it did not take long for the main app ban the bill had tried banning, TikTok, to follow up being removed at around 8:30, an hour after CapCut's ban. On January 19 around 8:00 am, CapCut returned after president Donald Trump said he would extend the removal date by 75 days. Users could then see a message about how they are back online with media covering about it. == References == == Other websites == *https://www.socialmediatoday.com/news/capcut-launches-commerce- pro-package-retail-promotions/731955/ *https://www.fastcompany.com/91264338/capcut-ban-update-bytedance-video- editor-is-back-for-u-s-users-but-its-still-not-in-apple-and-google-app-stores Category:Video",
 "title": "CapCut"
}