{
 "id": "1163465",
 "text": "Larry Schmittou (born July 19, 1940) is an American entrepreneur, former Minor League Baseball team owner, and former college baseball team coach. He owns L&S; Family Entertainment LLC, a business that has bowling alleys in Tennessee, Kentucky, Ohio, and Indiana. ==Biography== Schmittou was the head coach of Vanderbilt University's baseball team from 1968 to 1978. He owned Minor League Baseball teams from 1978 to 1996. The teams he owned were the Daytona Beach Islanders, Eugene Emeralds, Greensboro Hornets, Huntsville Stars, Nashville Sounds, Salem Redbirds, Salt Lake City Gulls, Wichita Wranglers, and Winston-Salem Spirits. He also owned a minor league ice hockey team and minor league basketball team. Many people came to see the Nashville Sounds baseball team play while Schmittou was responsible for the team. More people came to watch the Sounds' games in Nashville, Tennessee, in their first year (1978) than any other Minor League Baseball teams. They had the highest attendance in the Southern League for each of the seven years they played in that group of teams. The Sounds won an award for having the best promotions in 1978, 1980, and 1981. Schmittou won an award for being the best executive in the Southern League in 1978. He won the awards for being the best executive in the American Association, another baseball league, in 1987 and 1989. Schmittou was inducted into the Tennessee Sports Hall of Fame in 2006. He was placed in the Southern League Hall of Fame in 2016. Schmittou worked for the Texas Rangers, a Major League Baseball (MLB) team, from 1983 to 1986. His job was to get many people to go to their games, like he had done with the Sounds. He was also in charge of a group that tried to get an MLB team to start playing in Nashville in 1993. They were not successful in getting a team. ==References== Specific General * ==Other websites== *A 2018 audio interview with Schmittou Category:1940 births Category:Living people Category:Businesspeople from Tennessee Category:Sportspeople from Nashville, Tennessee",
 "title": "Larry Schmittou"
}