{
 "id": "1163533",
 "text": "ION Exchange (India) Ltd. is a company from India. The company specializes in providing solutions for water and environment management. Founded in 1964 as a subsidiary of UK-based Permutit, it became completely Indian-owned in 1985 and has since expanded its footprint across different countries across the globe. == History == ION Exchange (India) Ltd. was established in 1964 as a subsidiary of Permutit, which was based in the United Kingdom. In 1965, the company started to make ion-exchange resins in India. In 1978, it introduced the Reverse Osmosis technology for the first time in India. == Operations == Across the globe, there are manufacturing facilities and assembly points where Ion Exchange (India) Ltd. operates. These can make ion exchange resins, industrial chemicals, and membranes; they can also fabricate and assemble water and waste water systems. == Research and development == The business of the creating of sustainable water and environmental products and technologies is the focus of the research and development centers in India run by the company. == Products == Ion Exchange (India) Ltd. has a variety of products and solutions for different industries, such as: * Air Purification * Water Treatment * Wastewater Treatment * Solid Waste Management This product line is called the INDION, which contains ion exchange resins, membranes, specialty chemicals, as well as water quality monitoring instrumentation. == Market segments == A diverse range of clients globally are served by ION Exchange India Ltd. including various private industries, government bodies, households and neighborhoods. Water and environmental matters prevalent in sectors such as the automotive sector, pharmaceuticals sector, food processing and manufacturing sector, power generation sector, among others, are the various issues that this company addresses through its solutions. They recently bagged a 700Cr+ project from IOCL == Corporate social responsibility (CSR) == ION Exchange (India) Ltd. emphasizes office social responsibility via the Ion Foundation that exists to empower marginalized populations by means of training, health, and hygiene interventions. Moreover, it backs sustainable projects that lead to social improvement and resilient societies’ development. In addition, they have been known to donate water treatment systems as well as services which help people living in areas affected by natural disasters. ==References== Category:Companies of India Category:1964 establishments in Asia",
 "title": "Ion Exchange (India) Ltd"
}