{
 "id": "1163083",
 "text": "Máriapócs is a town in the Nyírbátor district of the Szabolcs-Szatmár-Bereg County. Based on its population, it is the smallest town in the county. == Setting == Máriapócs is located in the southern part of Szabolcs-Szatmár-Bereg County in Hungary. It is approximately 280 kilometers from Budapest, the capital of Hungary, and about 30 kilometers from Nyíregyháza, the county seat. == Culture == Máriapócs is famous for its Greek Catholic basilica, which is a major pilgrimage site due to the miraculous weeping icon of the Virgin Mary housed there. This icon, known as the Weeping Madonna, has drawn pilgrims from all over the world since it first wept in 1696. The town is in a flat area known for its agricultural activities, with fields of wheat, corn, and sunflowers common in the landscape. The climate here is continental, with hot summers and cold winters. Besides its religious significance, Máriapócs has a rich cultural heritage with local festivals celebrating both religious and secular traditions. The town also features several historical buildings that reflect its past, including old churches and traditional Hungarian architecture. Máriapócs is also well-connected by road, making it accessible for visitors who wish to explore more of the northeastern part of Hungary, including nearby thermal spas and historical sites. == Politics == === List of Mayors === The current mayor of Máriapócs is Bertalan Papp (Fidesz-KDNP). Mayor Party Term of office Lajosné Palóczy Independent 1990-2002 György Nagy Independent 2002-2006 Lajos Elekné Palóczy Independent 2006-2010 Bertalan Papp Fidesz-KDNP 2010-present == Population == In 2001, 96% of the town's population declared themselves to be Hungarian, and 4% to be Gypsy.A 2001-es népszámlálás nemzetiségi adatsora During the 2011 census, 89.6% of the residents identified themselves as Hungarian, 9% as Gypsy, 0.2% as German, 0.3% as Romanian, and 2% as Ruthenian.Máriapócs Helységnévtár In 2022, 91.1% of the population declared themselves Hungarian, 6.4% Gypsy, 3.7% Ruthenian, 0.7% Ukrainian, 0.3% Romanian, 0.2-0.2% Greek, Slovak and Germans, 0.1-0.1% for Croatians and Poles, 1.8% for other, non-domestic nationalities.Máriapócs Helységnévtár == Sister cities == * Turin, Italy == Sights == Máriapócs is world-renowned thanks to the fame of the Greek Catholic Shrine. Another notable attraction is the Basilian Collection, housed in the birthplace of Miklós Dudás, a Greek Catholic bishop. The town also features a Turul statue. == References == Category:Towns in Hungary Category:Szabolcs-Szatmár-Bereg County",
 "title": "Máriapócs"
}