{
 "id": "1163640",
 "text": "The Koli is a peasant caste of Gujarat which is 24% of the total population of the state. After Kolis, Patidar are 13% in Gujarat. Here are a complete list of clans (गोत्र) of Koli caste in Gujarat. All of the Koli clan's information is taken from the book name Koli Culture: A profile of the Culture of Talpad Vistar which is written by famous writer Dr. Shibani Roy and The Thakors of North Gujarat books. #Kathechia Koli #Kobia Koli #Kumbhani Koli #Kukadia Koli #Karelia Koli #Kihela Koli #Kararia Koli #Kagadia Koli (Kagadiya Koli) (Kagadia Kolis ruled over Umrala town in Gujarat. The Umrala was named after Koli king Uma Koli (Umo Kagadia) who was Umrala's founder and last ruler. #Katudia Koli #Kokia Koli #Keraria Koli #Kadwani Koli #Kambad Koli #Kunkawa Koli #Kamaria Koli #Keshwara Koli #Karogadia Koli #Kantaria Koli #Khorani Koli #Khamani Koli #Khasia Koli (Khasia Kolis ruled over Khas village of Gujarat during the time of Koli ruler Dhan Mer of Dhandhuka) #Khambnani Koli #Khorawa Koli #Gabu Koli #Gohel Koli (Gohil Koli) #Gobani Koli #Gunadia Koli #Godia Koli #Grambadia Koli #Gangani Koli #Gangadi Koli #Gujariya Koli (Gujaria Koli) #Gadnagara Koli #Gadhiya Koli #Gareja Koli #Ghodakia Koli #Gharsanda Koli #Chauhan Koli (Chouhan Koli, Chohan Koli) (Chauhan Kolis married with poor Rajput & lower Rajput girls in Gujarat) #Chawda Koli (Chawada Koli, Chavda Koli, Chavada Koli) #Chuda #Chudasama Koli (Chudasma Koli) #Chakhad Koli #Japadia Koli #Yadav Koli (Jadav Koli) #Jograjia Koli #Jada Koli #Jinjoria Koli #Jamod Koli #Jatadra Koli #Jambukia Koli #Jidia #Jalia Koli (Zalia Koli, Jolia Koli, Zolia Koli) (Jalia Kolis ruled over Dahewan town of Gujarat and the last Koli ruled of Dahewan was Jalim Jalia) #Jolapra Koli #Jambucha Koli #Jarawaria Koli #Jethwa Koli (Jethawa Koli, Jethva Koli, Jethava Koli) #Jhodia Koli #Jinjhuwadia Koli (Jhinjhuwadia Koli, Zinjuwadia Koli, Zhinjuwadia Koli, Jinjuvadia Koli, Jhinjhuvadia Koli) (Jinjhuvadia Kolis ruled over Jhinjhuwada town of Gujarat so they came to be known as Jhinjhuwadia Koli) #Jhora Koli #Jhala Koli (Jala Koli, Zala Koli, Zhala Koli) (Jhala Kolis ruled over several regions of Gujarat) #Timbalia Koli #Derwadia Koli #Dabhi Koli (Dabhi Kolis married with poor Rajput and lower Rajput girls in Gujarat during reign of Gujarat Kshatriya Sabha) #Denia Koli #Dangar Koli #Dodia Koli (Dodia Kolis married with poor Rajput and lower Rajput girls in Gujarat) #Donashia Koli #Daki Koli #Talsania Koli #Tauia Koli #Dudhreja Koli (Dudreja Koli) #Dumadia Koli (Dumadiya Koli) #Derwaria Koli (Derwariya Koli, Dervaria Koli, Dervariya Koli) #Detroja Koli #Degama Koli #Diora Koli (Deora Koli) #Dhoraria Koli #Dalwania Koli (Dalwaniya Koli, Dalvania Koli, Dalvaniya Koli) #Dhoria Koli (Dhoriya Koli) (Dhoria Kolis ruled over Dhoria village in North Gujarat and adopted the Dhoria as their clan (Gotra)) #Dhokadia Koli #Dharajia Koli #Dhandhukia Koli (Dhandukia Koli, Dhandhukiya Koli, Dhandhukia Koli) (Dhandhukia Kolis ruled over Dhanudhuka town of Gujarat and the last Koli ruler of Dhandhuka was Dhan Mer Koli and Dhandhuka town was founded by Koli chief Sonang Mer who was father of Dhan Mer) #Thadwi Koli (Thadawi Koli, Thadavi Koli, Thadvi Koli) #Nakiya Koli (Nakia Koli) #Nagani Koli #Nagdakia Koli (Nagadakia Koli, Nagdakiya Koli, Nagdakia Koli) #Parmar Koli (Paramar Koli, Purmar Koli, Puramar Koli) (Parmar Kolis married with poor Rajput and lower Rajput girls in Gujarat during reign of Gujarat Kshatriya Sabha) #Padaua Koli #Parvatani Koli #Padhaya Koli #Pachara Koli #Padhani Koli #Padharia Koli #Patadia Koli (Patadiya Koli) #Panaria Koli (Panariya Koli) #Pahar Koli #Parihar Koli (Purihar Koli, Padiyar Koli, Padhiar Koli, Padhiyar Koli) (Parihar Kolis of Gujarat and Rajasthan married with poor Rajput and lower Rajput girls) #Padaliya Koli #Bavalia Koli (Bavaliya Koli, Bawalia Koli, Bawaliya Koli, Bavadia Koli, Bavadiya Koli, Bawadia Koli, Bawadiya Koli) (Bavalia Kolis ruled over Babariawad region of Gujarat and Babariawad was named after Babaria Kolis) #Berani Koli #Baria Koli (Baraiya Koli, Bariya Koli) (Baria Kolis ruled over Baria Devgad town of Gujarat and later married with poor Rajput and lower Rajput girls in Gujarat) #Bambania Koli (Bambhania Koli, Bambaniya Koli, Bambhaniya Koli) #Bardhiya Koli (Bardhia Koli) #Barod Koli #Barolia Koli #Barad Koli #Balas Koli #Vala Koli (Wala Koli) (Vala Kolis ruled over Valabhipur town of Gujarat, Valabhipur was under the rule of Ebhal Vala but Ebhal Vala was defeated by Koli ruler Dhan Mer of Dhandhuka. After that Dhan Mer annexed the Vallabhipur in Dhandhuka and after that Kolis used the Vala clan. #Bolania Koli #Baroua Koli #Bhalia Koli (Bhaliya Koli) Bhalia Kolis ruled over Bhal region of Gujarat and came to be known as Bhalia Koli) #Bhojani Koli #Bhadhania Koli #Bushadia Koli #Balagamdia Koli (Balagamdiya Koli) #Balada Koli #Bhesjadia Koli (Bhesjadiya Koli, Bheshjadia Koli, Bheshjadiya Koli) #Bheda Koli #Dhapa Koli #Bhil Koli (Bheel Koli) #Bharoda Koli #Bhadarka Koli #Bhutia Koli (Bhutiya Koli) #Bhuva Koli #Bhowani Koli (Bhovani Koli) #Matadia Koli (Matadiya Koli) #Malakia Koli (Malakiya Koli) #Menia Koli (Meniya Koli) #Majothia Koli (Majothiya Koli) #Mer Koli (Mair Koli, Mehr Koli, Maihr Koli, Mehd Koli) (Mer Kolis of Gujarat ruled over Dhandhuka and Dhandalpur towns of Gujarat. Koli chief Sonang Mer founded the Dhandhuka Dhandalpur town and Khant dynasty of Kolis, Rajputs of Guajrat married their daughters to Mer Kolis of because Mer Kolis were more powerful and and Koli ruler Dhan Mer defeated the Ebhal Vala of Vallabhipur. #Meghani Koli #Makwana Koli (Makawana Koli, Makvana Koli, Makavana Koli, Mukwana Koli, Mukawana Koli, Mukavana Koli, Mukvana Koli) (Makwana Kolis ruled over several regions of Gujarat and married with poor Rajput and lower Rajput girls in Gujarat. #Mithapara Koli (Mithapra Koli, Mithpara Koli) #Morwada Koli #Matudia Koli (Matudiya Koli) #Mayani Koli #Mewada Koli (Mevada Koli) #Mewasia Koli (Mewasiya Koli, Mevasia Koli, Mevasiya Koli, Mewasi Koli, Mevasi Koli, Mehwasia, Koli, Mehwasiya Koli, Mehvasia Koli, Mehvasiya Koli) (Mewasia Kolis were most dangerous and were famous for rebellious activities against Marathas, Mughals and other Britishers. Mewasi Kolis often plundered the villages to collect the revenue.) #Mahawadia Koli (Mahavadia Koli, Mahavadiya Koli, Mahawadia Koli) #Motani Koli #Mori Koli #Maurya Koli (Morya Koli, Mourya Koli) #Monaliya Koli (Monalia Koli) #Mimakia Koli (Mimakiya Koli) #Malam Koli #Mokaria Koli (Mokariya Koli) #Rangpara Koli (Rangpra Koli) #Rathore Koli (Rathor Koli, Rathod Koli) (Rathod Kolis of Gujarat married with poor Rajput and lower Rajput girls. In marriage relationship, Always Kolis pay the dowry to Rajput girls and their family and Kolis gave their lands to poor and lower Rajput family because of marital relationships.) #Raghawani Koli (Raghavani Koli, Raghwani Koli, Raghvani Koli) #Rajapara Koli (Rajpra Koli, Rajpara Koli) #Rojasra Koli (Rojasara Koli) #Rajani Koli #Rajola Koli #Modi Koli (Kolis whose forfathers belong to Modera city of Gujarat from old days known as Modi Koli) #Rakhsia Koli #Raneshwara Koli #Ramani Koli #Limbadia Koli (Kolis whose forfathers belong to Limbadi city of Gujarat from old days known as Limbadia Koli) #Luria Koli #Wasani Koli #Watia Koli (Vatia Koli) #Wadher Koli (Vadher Koli) #Wabadia Koli (Vabadia Koli) #Wanadiya Koli (Wanadia Koli, Vanadia Koli, Vanadiya Koli) #Waghbla Koli (Vaghbal Koli) #Waghela Koli (Vaghela Koli) (Waghela Kolis of Gujarat ruled over several villages in North Gujarat) #Waswelia Koli (Vaswelia Koli, Vaswelia Koli, Vasvelia Koli) #Waghani Koli (Vaghani Koli) #Sanghani Koli (Sanghani Koli ruled over Sanghani village of Gujarat) #Wadadaria Koli (Wadadariya Koli, Vadadaria Koli, Vadadariya Koli) #Wegad Koli (Vegad Koli) #Waja Koli (Vaja Koli, Waza Koli, Vaza Koli) #Wawedia Koli (Wawediya Koli, Vawedia Koli, Vawediya Koli, Vavedia Koli, Vavediya Koli, Wavedia Koli, Wavediya Koli) #Wans Koli (Wansh Koli, Vans Koli, Vansh Koli) #Wagrolia Koli (Vagrolia Koli, Wagroliya Koli, Vagrolyia Koli) #Warsadia Koli (Warsadiya Koli, Varsadia Koli Varsadiya Koli) #Watukia Koli (Watukiya Koli, Vatukiya Koli, Vatukia Koli) #Wadhiya Koli (Wadhia Koli, Vadhiya Koli, Vadhia Koli) #Wasan Koli (Vasan Koli) #Sarvaiya Koli (Sarwaiya Koli, Sarviya Koli, Sarwiya Koli, Sarvia Koli, Sarvaiyya Koli, Sarwaiyya Koli) (Sarvaiya Kolis ruled over several villages in North Gujarat and married with poor Rajput and lower Rajput girls but always Kolis paid the dowry and land, farms to Rajput families despite Kolis marrying their boy to Rajput girl.) #Sorani Koli (Sodani Koli) #Sosa Koli #Savaria (Sabadiya Koli, Sabadia Koli, Sawadia Koli, Savadia Koli, Savariya Koli, Sawaria Koli, Sawariya Koli) #Sakaria Koli (Sakariya Koli, Sakria Koli, Sakriya Koli) #Saradia Koli (Saradiya Koli) #Seikh Koli (Sheikh Koli, Shaikh Koli) #Sapra Koli (Sapara Koli) #Satwani Koli (Satvani Koli) #Sasakia Koli (Sasakiya Koli) #Sodamia Koli (Sodamiya Koli, #Soramia Koli, Soramiya Koli) #Surami Koli #Sadadiya Koli (Sodadia Koli) #Sumgada Koli #Solanki Koli (Soulanki Koli, Saulanki Koli) (Solanki Kolis ruled over several villages in Gujarat and married with poor Rajput and lower Rajput girls during the reign of Gujarat Kshatriya Sabha) #Surela Koli #Sewalia Koli (Sevalia Koli, Sevaliya Koli, Sewaliya Koli) #Singad Koli #Sankhad Koli #Sauya Koli #Saparia Koli (Sapariya Koli) #Sagarka Koli (Sagaraka Koli) #Handa Koli #Odakia Koli (Odakiya Koli) #Utedia Koli (Utediya Koli) #Ahalgamad Koli (Ahalgamd Koli) #Ajadia Koli (Ajadiya Koli) #Aniyadia Koli (Aniyadiya Koli) #Otradi Koli #Endnani Koli #Agresa Koli #Palaria Koli (Palariya Koli) #Gidiya Koli (Gidia Koli) #Vallani Koli #Lumbani Koli (Lumbania Koli, Lumbaniya Koli) #Kansagra Koli (Kansagara Koli) #Agaria Koli (Agariya Koli) #Koladra Koli (Koladara Koli) #Kordia Koli (Kordiya Koli) #Masen Koli #Idaria Koli (Idariya Koli) (Idaria Kolis ruled over Idar princely state in Gujarat. The first Koli ruler of Idar was Hathi Sord (Hathi Sora) and last Koli ruler of Idar was Samaliya Sord) #Balolia Koli (Baloliya Koli) #Santola Koli #Kuretia Koli (Kuretiya Koli) #Sarla Koli #Sarwala Koli (Sarvala Koli) #Barania Koli (Baraniya Koli) #Vadhlegia Koli (Vadhlegiya Koli, Waghlegia Koli, Waghlegiya Koli) #Unatia Koli (Unatiya Koli) #Wadesa Koli (Vadesa Koli) #Rodatala Koli (Rodatla Koli) #Khawadia Koli (Khawadiya Koli, Khavadia Koli, Khavadiya Koli) #Ranavadia Koli (Ranavadiya Koli, Ranawadia Koli, Ranawadiya Koli) #Nandesalia Koli (Nandesaliya Koli) #Khokhalia Koli (Khokhaliya Koli) #Khokhani Koli (Khokani Koli) (Khokani Kolis of Gujarat fought against British government in Kheda district of Gujarat.) #Maliwad Koli (Malivad Koli) (Maliwad Kolis of Gujarat fought against British government in Gujarat under their Koli ruler Surajmal of Khanpur jagir. #Katosna Koli (Katosana Koli) (Katosna Kolis rules over Katosan town in Gujarat and got their clan (Gotra) as Katosana.) #Udesa Koli #Dudhrecha Koli (Dadhrecha Koli) #Vastapra Koli (Vastapara Koli) #Ugjrejia Koli (Ugjrejiya Koli) #Sitapara Koli (Sitapra Koli) #Shial Koli (Sial Koli, Shiyal Koli) (Shial Kolis were notorious pirates of Gujarat and Shial bet island was their stronghold, Shial Kolis defeated and captured the Shial island from Portuguese India and make it their stronghold along with Chanch but later they were defeated by Nawab of Janjira and Jafrabad. during the World War I, they were enlisted as soldiers in British Indian Army by British Indian government.) #Charavadia Koli (Charvadia Koli, Charavadiya Koli, Charvadiya Koli, Charawadia Koli, Charawadiya Koli, Charwadia Koli, Charwadiya Koli) (The Charavadia Kolis originated from Bokadthamba village and in 2019, Their population was 700 only and the Bokadthamba village is inhebited by only Charavadia clan of Kolis. Around 1500 A. D., The ruler of Wankaner Princely state gave the Bokadthamba village to four Chunvalia Koli brothers and now Charavadias are descendants of those Koli brothers.) #Jora Koli #Valakiya Koli (Valakia Koli) (Valakiya Kolis ruled over Valak village in Kamrej tehsil of Surat & the Valak village was named after Valakiya Kolis. == References == Category:Koli",
 "title": "Koli clans of Gujarat"
}