{
 "id": "1163656",
 "text": "Shuttlecock-H is a 2019 adult bullet hell shooter video game. It was developed by Inlet Pipe Productions. It was released first for Windows PCs before being ported to Nintendo Switch in 2023. The ported version is published by Eastasiasoft. == Gameplay == A \"dodge 'em up\" shooter, Shuttlecock-H involves the player driving an unarmed spaceship while avoiding enemy projectiles and arrangements. At the same time, the player must collect as many hearts as possible. There are a total of 30 levels. There is a temporary magnet ability that assists in collecting the hearts. At the start of the game, the player chooses one of three female characters as a companion, each of which are voiced in Japanese. With every progressing stage, the girl loses more clothes, and eventually ends up in an animated sex scene.https://ricedigital.co.uk/shuttlecock-h-physical-release/ Only genitals are covered in all versions. == Release == Shuttlecock-H was released on May 24, 2019, distributed on Steam. A port to Nintendo Switch was released on February 9, 2023, distributed on the Nintendo eShop. A physical version for Switch was released by Funbox Media in Europe, which includes \"exclusive\" nude content. On September 10, 2019, Inlet Pipe Productions released a second game on Steam called Shuttlecock-H: Covered Rematch. This new game features 21 \"completely new\" levels and removing the adult content making it suitable for all ages.https://store.steampowered.com/app/1140350/ShuttlecockH_Covered_Rematch/ Completing the main game in the Nintendo Switch version unlocks the CR Levels, which are the levels in Covered Rematch, and remain censored. == Reception == German magazine MANiAC in its review scored the game 54%, writing that the difficulty becomes significantly high halfway through the game, and the digital controls of the game make it frustrating to succeed through the high difficulty. Pete Davison, of Rice Digital, wrote that Shuttlecock-H is a great, \"genuinely enjoyable game\", giving praise to gameplay, art, erotic animations and the soundtrack, but was disappointed with the lack of good unlockable content. == References == Category:Nintendo Switch games",
 "title": "Shuttlecock-H"
}