{
 "id": "1163832",
 "text": "Elaine Stewart (born Elsy Henrietta Maria Steinburg May 31, 1930 - June 27, 2011) was an American actress and model. == Life == Stewart was born in Montclair, New Jersey. Her parents were Maria Hedwig (Hanssler) and Ulrich E. Steinburg. Her father's family which was largely Frisian, was from Aurich, Niedersachsen. Her mother was from Göppingen, Baden-Württemberg. She was one of five children born to German immigrant parents. Her father was a police sergeant. She was a teenager when she signed a contract with the Conover modeling agency and changed her name. Soon after, the movie producer Hal Wallis offered her $200 a week to play a nurse in the Dean Martin-Jerry Lewis comedy Sailor Beware. She beat out hundreds of young models in 1952 to earn a photo layout in See Magazine, winning the title of “Miss See.” Stewart was a Democrat who was supportive of Adlai Stevenson's campaign during the 1952 presidential election. In 1961, she married actor Bill Carter. They divorced in 1964, and she married television producer Merrill Heatter on December 31, 1964. They had a son, Stewart, and a daughter, Gabrielle. == Modeling == Stewart made her debut by winning Miss See in See Magazine in 1952, with measurements 34–25–36. She was in many magazines such as Playboy and Photoplay. == Film == Stewart had a supporting role in The Bad and the Beautiful (1952), as Lila, a starlet who has a romantic fling with a producer played by Kirk Douglas. She was featured as Julie, the love interest of Sgt Ryan, played by Richard Widmark, in Take the High Ground! (1953) and co- starred with Mickey Rooney in a 1953 comedy, A Slight Case of Larceny. She appeared in other films, such as Brigadoon, Night Passage, Code Two, The Rise and Fall of Legs Diamond, and The Adventures of Hajji Baba. Stewart had a small but key role, as Anne Boleyn, in 1953's Young Bess. She co-starred with Jeff Chandler in the film noir The Tattered Dress (1957), with Victor Mature in the western Escort West (1958) and shared top billing with John Derek in a 1958 adventure film, High Hell, before turning to television. == Television == Stewart guest-starred in TV series such as Bat Masterson and Burke's Law, both starring Gene Barry. In her last acting appearance on TV, she played Irene Grey in the Perry Mason episode \"The Case of the Capering Camera\" in 1964. Stewart was a co-hostess on two 1970s game shows, Gambit with Wink Martindale: 377 and the nighttime edition of High Rollers with Alex Trebek, both produced by her husband, Merrill Heatter. == Death == On June 27, 2011, Stewart died at her home in Beverly Hills, California, at the age of 81. She was survived by her husband and two children. Upon her death, she was promptly cremated. == Other websites == *https://www.nytimes.com/2011/06/29/movies/elaine-stewart- sultry-1950s-actress-dies-at-81.html *http://www.briansdriveintheater.com/elainestewart.html *https://www.theguardian.com/film/2011/jul/08/elaine-stewart-obituary *https://www.hollywoodreporter.com/movies/movie-news/elaine-stewart-glamorous- star-brigadoon-205909/ Category:1930 births Category:2011 deaths Category:Actors from New Jersey Category:Models from New Jersey",
 "title": "Elaine Stewart"
}