{
 "id": "1163373",
 "text": "The Gujarat Kshatriya Sabha was a social organisation in the Indian state of Gujarat which was initiated to get together the Kolis and Rajputs of the state. Gujarat Kshatriya Sabha was started by a Koli Jagirdar Natvarsinh Solanki and a Rajput Mahendrasinh Mahida to resolve the problems faced by both communities and to be in power at political level. The Gujarat Kshatriya Sabha was most important for Rajputs to be in power at political level because they were only 4% of the total population of Gujarat while Kolis were largest caste cluster comprising the 24% of total population of state. Before the Independence of India, Gujarat Kshatriya Sabha leaders asked the Government of Bombay to recruit the Kolis and Rajputs in police department and British government recruited the 1,500 Kolis and Rajputs. The Government of India set up the first Backward Classes Commission (Kalelkar Commission) in 1954 under the chairmanship of Kaka Kalelkar and Sabha submitted a memorandum to this commission but this demand was rejected because the Kolis has earlier were powerful and seem to be Kshatriya by other castes of Gujarat. The Kshatriya Sabha consistently demanded the recognition of 'Backward Class' for Rajputs and Kolis. GKS often requested the Government of Gujarat to start a military school for free education and other facilities for Kolis and Rajputs. In 1976, the Bakshi Commission was appointed by the state government and Kolis were recognised as Socially and Educationally Backward Classes and Kolis were single largest caste of state comprising 24% of total population of state. In 1980, government appointed the Mandal commission with recognising the Kolis as Other Backward Class in state. The Kolis of Saurashtra didn't joined the Gujarat Kshatriya Sabha because they thinks that Rajputs are not our allies and Patidars were not koli's adversaries so Gujarat Kshatriya Sabha was not much influenced in Saurashtra and limited in Central and North Gujarat. same with Rajputs, a very minor number of Rajputs who were prosperous and highly wealthy, didn't joined the Gujarat Kshatriya Sabha because they think that Kolis are inferior to Rajputs. == Slogan == The slogan of the Koli Kshatriyas of Kshatriya Sabha was Jai Somnath (the victory of god Somnath). It was started to create a sense of brotherhood between Kshatriya Kolis and Rajputs. They were advised to great each other whenever they met with slogan Jai Somnath. == History == The Gujarat Kshatriya Sabha was started as Charotar Kshatriya Koli Samaj by Natvarsinh Solanki who was a Koli elite in Charotar district in 1930 but after years in 1947, It was renamed as Kutch, Kathiawar and Gujarat Kshatriya Sabha to vaste as a hug organisation. The word Kshatriya was useful umbrella label to bracket the Rajputs and Kolis together. In fact, Gujarat Kshatriya Sabha was good example for way castes and both of the communities had same enemy viz Patidars. Several taboos were abolished and Rajputs and Kolis of Kshatriya Sabha shared meals and there was marital relations between poor Rajputs and rich Kolis because poor Rajputs were not able to pay hug burden of Dowry so they married their daughters to rich Koli families and same with kolis because Kolis were accepted as Kshatriya by Rajputs. The Kolis were more benefited by Kshatriya Sabha which created the boarding schools, grants, loan system etc. The Patidars of Central and North Gujarat were agricultural labour on the lands of Koli landlords or Koli chieftains but after Independence of India, Patidars enchraoched the lands of Kolis through land ceiling act of Independent India and reduced the Kolis in social status. after that, Kolis thought that they ruled the area but have no rights, so Kolis often plunders the Patidar villages in midnight in gangs. The Rajputs of Gujarat strongly allied with Kolis because Rajputs also were against Patidars because of their land rights. In central and north Gujarat, the Kolis had several battles with the Patidars on the issue of land tenancy, land rights and use of common village resources. It may be mentioned here that in order to win the elections in 1962 and 1967 the Gujarat Swatantra Party, dominated by the Patidars, won over some of the Koli leaders of the Gujarat Kshatriya Sabha and Sabha was dominated by Kolis of North Gujarat . The Party evolved a strategy referred to by the acronym PKASH; that is the 'party of Patidars and Koli Kshatriyas.' Party nominated a large number of the Kolis as party candidates and also gave them positions within the party organization. But that alliance did not last. The party and the Kshatriya Sabha's Koli leaders could not resolve ground-level conflicts between the Koli peasants and well Patidar peasants. The grievances of Patidar were resolved by Gujarat Kshatriya Sabha by several time meetings but it was not enough because Kolis were double in number of population if Gujarat and Patidars often targeted by influenced Kolis. most of the Patidar's children were engaged in collage study but Kolis not and it was a big beneficial point of Patidars. == Political activities == In 1948-49, leaders of Sabha thought about launching a new political party for Kshatriyas but it was impossible. In 1950, Gujarat Kshatriya Sabha demanded the more candidate tickets from Indian National Congress party but Congress was unable to do this because party was mostly supported by Patidars who were enemy for both communities. In 1962 elections, Kshatriya Sabha supported the Swatantra Party to encounter the Congress and there was a challenge for congress because Swatantra Party raised as leading opposition party in Gujarat because Kolis were 24% and Rajputs were 4%. In the elections of 1967, Congress party changed his theory of vote bank and gave tickets to the members of Kshatriya Sabha and won the majority of seats. in 1981, Koli candidates were 21% in Congress (i). In the assembly elections of 1957, Swatantra Party won the 26 seats out of 154 seats but before the 1962 elections, Gujarat Swatantra Party openly associated himself with Gujarat Kshatriya Sabha to get support from Kshatriya Kolis and Rajputs and launched a Strategy named PKSHA to get together of Kolis, Rajputs and Patidars and won the 67 seats out of 168 seats. PKSHA was not much effective at ground level because Patidars always threatened by Kolis belong to Kshatriya Sabha. In the Central Gujarat and North Gujarat, the Kshatriya Kolis had several battles with Patidar on land rights and land tenancy. In the elections of 1962 and 1967, Swatantra Party won the Kshatriya leaders and announced the PKSHA for peace between Patidars and Kshatriya and Kolis received the position in Party but at ground level Swatantra Party and Kshatriya leaders was unable to stop the battles against patidars. == Impacts == *Because of the Gujarat Kshatriya Sabha, Rajputs of Gujarat were more powerful at political level *Because of Gujarat Kshatriya Sabha, There were Marital relations between rich rich Kolis and poor Rajputs of Gujarat *Because of Gujarat Kshatriya Sabha, The Kshatriya Kolis associated with Sabha was used to be called as Koli Darbar Saheb by other castes *Because of Gujarat Kshatriya Sabha, Kolis of Gujarat were accepted as a Kshatriya caste by Rajputs because Kolis were accepted as Kshatriya by other caste only Rajputs were not in favour of Kshatriya status for Kolis before the formation of Gujarat Kshatriya Sabha == Letup == In order to penetrate the Koli Kshatriya base of Indian National Congress, the Bhartiya Janta Party under the leadership of a Koli named Shankarsinh Vaghela created a new organisation named Gujarat Kshatriya Mahasabha in 1980 equal to the Gujarat Kshatriya Sabha which paralyzed the Gujarat Kshatriya Sabha. In the elections of 1985, BJP nominated a large number of Kolis and other backward castes. The Kshatriya Mahasabha initiated by BJP was not able to capture Koli vote bank of Gujarat Kshatriya Sabha because after some time Shankarsinh Vaghela left the BJP and joined the Indian National Congress party but the power of Gujarat Kshatriya Sabha was weakened. == References == == Other websites == *The Cambridge Companion to Modern Indian Culture by Vasudha Dalmia and Rashmi Sadana *Caste and Democratic Politics in India by Ghanshyam Shah Category:Kshatriya Category:Political parties in India Category:Gujarat",
 "title": "Gujarat Kshatriya Sabha"
}