{
 "id": "1163229",
 "text": "Christy Marx is an American scriptwriter, author, and game designer. She has written on many television series, for example, Jem, Teenage Mutant Ninja Turtles, Conan the Adventurer, G.I. Joe, Hypernauts, and Captain Power. She is also known for her work on comic books. She made a comic book series known as Sisterhood of Steel. She has also worked on Conan, Red Sonja, and Elfquest. Marx has written many biographies and books about history. == Career == The Red Sonja comic series has of some of the earliest comics Marx has shown to the public. The first video game she worked on was Conquests of Camelot in 1990. She worked as a writer and designer. She also worked on the sequel Conquests of the Longbow. She started working at Zynga in late 2010. She worked on Hidden Chronicles and other games. She stopped working at Zynga in 2017.Interview: The creator of the Conquests adventures on what made them special She wrote the character Amethyst, Princess of Gemworld in the 2012 comic series Sword of Sorcery. The series was based on an earlier comic series with the same name. It was released in August 2013. She also wrote a guide for writing, Writing for Animation, Comics, and Games. == Personal life == Marx's first husband, Peter Ledger. was an illustrator. His art is in the computer game Conquests of Camelot and the graphic novel Sisterhood of Steel. == Awards == * Marx won the Animation Writers Caucus Animation Award from the Writers Guild of America in 2000. She won the award for her work in animation writing. * Best Computer Adventure game 1990, by Video Games and Computer Entertainment Magazine, for Conquests of Camelot: The Search for the Holy Grail * Best Adventure game 1991, by Computer Game Review and Enchanted Realms, for Conquests of the Longbow: The Legend of Robin Hood * Marx was part of the team that won a 2006 Distinguished Achievement Award from the Association of Educational Publishers. The team won the award for the Harcourt Achieve Steck- Vaughn IMPACT Graphic Novels series == Publications == === Books === * Life in the Ocean Depths (Life in Extreme Environments) 2003 * Watson and Crick and DNA (Primary Sources of Revolutionary Scientific Discoveries and Theories) 2005 * The Great Chicago Fire of 1871 (Tragic Fires Throughout History) 2004 * Jet Li (Martial Arts Masters) 2002 * Writing for Animation, Comics, and Games 2007 === Comics === * Sword of Sorcery Volume 1: Amethyst, 2013 \"SWORD OF SORCERY VOL. 1: AMETHYST\" . DC. 8 April 2013. * Birds of Prey #27, 2014 * Convergence: Zero Hour Book 1, published in 2015 == Filmography == === Television === (series where she is head writer are in bold) * The New Fantastic Four (1978) * Spider-Man (1981-1982) * Spider-Man and His Amazing Friends (1981-1982) * G.I. Joe: A Real American Hero (1985) * Jem (1985-1988) * Captain Power and the Soldiers of the Future (1988) * Teenage Mutant Ninja Turtles (1988) * Dino-Riders (1988) * The Twilight Zone (1989) * G.I. Joe: A Real American Hero (1990) * Bucky O'Hare and the Toad Wars! (1991) * Conan the Adventurer (1992-1993) * Babylon 5 (1994) * Mighty Max (1994) * Darkstalkers (1995) * Hypernauts (1996) * Captain Simian &amp; the Space Monkeys (1997) * ReBoot (1997) * Pocket Dragon Adventures (1998) * Beast Wars: Transformers (1998) * Shadow Raiders (1998-1999) * Roswell Conspiracies: Aliens, Myths and Legends (1999) * Kong: The Animated Series (2000) * X-Men: Evolution (2001) * Ultimate Book of Spells (2001) * Stargate Infinity (2002) * He-Man and the Masters of the Universe (2003) * Alien Racers (2005) * Zorro: Generation Z (2006) * Legend of the Dragon (2006) * Biker Mice from Mars (2006) * Dork Hunters from Outer Space (2008) === Film === * What Waits Below (1984) * 20,000 Leagues Under the Sea (2002) * Jem and the Holograms (2015) == Video games == * Conquests of Camelot: The Search for the Grail (1990) * Conquests of the Longbow: The Legend of Robin Hood (1991) * The Legend of Alon D'ar (2001) * Tao Feng: Fist of the Lotus (2003) * CSI: Hard Evidence (2007) * The Lord of the Rings: War in the North (2011) == References == == Other websites == * * * Christy Marx at MobyGames Category:Year of birth missing (living people) Category:Screenwriters from Illinois Category:People from Danville, Illinois Category:Living people Category:American video game designers Category:American television writers Category:American comics writers",
 "title": "Christy Marx"
}