{
 "id": "1163540",
 "text": "Lake of Fire \"Lake of Fire\" is a song originally written and performed by the alternative rock band Meat Puppets. It was first released on their 1984 album Meat Puppets II. The song gained widespread attention after it was covered by Nirvana during their iconic MTV Unplugged in New York performance on November 18, 1993. The live version was later released on Nirvana's MTV Unplugged in New York album in 1994. == Nirvana's Version == Nirvana's acoustic rendition of \"Lake of Fire\" introduced the song to a broader audience, showcasing the raw emotional depth of the lyrics and Kurt Cobain's haunting vocal delivery. The performance featured the Meat Puppets' members, Curt and Cris Kirkwood, joining Nirvana onstage to play guitar and bass. This collaboration highlighted the influence of the Meat Puppets on Nirvana and the broader grunge movement. The song's inclusion in MTV Unplugged in New York was praised for its stripped-down arrangement, which underscored its dark, existential themes. Cobain's interpretation of the song captured the melancholic and introspective tone that characterized much of Nirvana's work. == Themes and Lyrics == \"Lake of Fire\" explores themes of despair, mortality, and existential questioning, with a repetitive and hypnotic chorus: \"Where do bad folks go when they die? They don't go to heaven where the angels fly.\" The song's vivid imagery and introspective tone resonate with the grunge ethos, making it a natural fit for Nirvana's acoustic performance. == Legacy == Nirvana's performance of \"Lake of Fire\" remains one of the standout moments from their MTV Unplugged session, contributing to the song's enduring popularity. It is often regarded as a powerful example of how the band could reinterpret and recontextualize existing songs, bringing new emotional layers to the music. == Credits == * Original Songwriters: Curt Kirkwood (Meat Puppets) * Nirvana's Version Performers: Kurt Cobain (vocals, guitar), Krist Novoselic (bass), Dave Grohl (drums, backing vocals), Curt Kirkwood (guitar), Cris Kirkwood (bass). * Album: MTV Unplugged in New York (Nirvana, 1994).",
 "title": "Lake of Fire"
}