{
 "id": "1163244",
 "text": "San Andres is a district of Manila, Philippines. San Andres shares the Estero Tripa de Gallina as its western and northern border with the districts of Malate and Paco, and to the east with the district of Santa Ana. It borders the city of Makati in the south. The area is under the jurisdiction of the Manila's 5th Congressional District, and includes the Manila South Cemetery, an exclave of the city surrounded by land administrated by Makati. ==Etymology== San Andres is commonly known among locals by its longer name, San Andres Bukid. The first part of the name comes from Spanish for Saint Andrew, the patron saint of Manila; while the second part comes from Tagalog bukid, meaning a \"rice field\", which the area once was. ==History== What is now San Andres Bukid was carved from the pre-World War II district of Singalong, as well as parts of the Hacienda de San Pedro Macati (as of 1851 purchase by the Zobel de Ayala family), Santa Ana, Malate, and Paco. Singalong district is largely absorbed into San Andres and is commemorated by a namesake street that runs perpendicular to Quirino Avenue and parallel to Taft Avenue. The street lies west of what is now the western section of San Andres. Elderly residents of Singalong believe that the area's name was derived from a Tagalog word for a cup fashioned from bamboo. In the Spanish colonial era, Spaniards awarded the area to members of the Capuchin missionaries who thereafter converted the native population to Christianity. In the aftermath of the Second World War, the southern section of Manila was devastated as with most of the city. San Andres was then mostly open space, and it was repopulated by migrants from nearby provinces and the Visayas regions. ==Gallery== Image:Old_House_in_San_Andres,_Manila.JPG|Heritage house in San Andres Image:Manila-san-andres-2012-01.jpeg|South Luzon Expressway overlooking San Andres Image:San_Andres_Bukid,_Skyway_Stage_3_(Manila;_02-23-2022).jpg|Metro Manila Skyway Stage-3 overlooking San Andres == References== Category:Settlements in Manila Category:Districts of Manila",
 "title": "San Andres, Manila"
}