{
 "id": "1163548",
 "text": "Dai shogi is a board game similar to Chu shogi and modern Shogi. The board is slightly larger than Chu shogi in size, which is 15x15 instead of 12x12. The game is invented in the 13th century. There are more pieces than Chu shogi and modern Shogi due to the size of board being really big. Most pieces can promote like in Chu shogi and modern shogi except for some major pieces. ==Pieces== The game setup will be from the least powerful to the most powerful piece. ===Game setup=== *15 Pawns *two Stone generals *two Go-betweens *two Knights *two Iron generals *two Cat swords *two Angry boars *two Copper generals *two Evil wolves *two Silver generals *two Gold generals *two Ferocious leopards *one Kirin *one Phoenix *two Blind tigers *one Drunk elephant *one King *two Flying dragons *two Violent oxen *one Lion *two Lances *two Reverse chariots *two Side movers *two Vertical movers *two Bishops *two Dragon horses *two Rooks *two Dragon kings *one Queen (Free king) ===Normal pieces=== These are the pieces that appear in the setup during the game and these pieces will be in order from the least powerful to the most powerful piece. *Pawn: Moves one square directly forward and just like in modern shogi, the pawn captures the same way as they move. *Stone General: Moves one square diagonally forward. *Go-Between: Moves one square vertically. *Knight: Moves like the Knight in chess, but it cannot sideways or backwards. *Iron General: Moves one square forward in any direction. *Cat Sword: Moves one square diagonally in any direction. *Angry Boar: Moves one square in a straight line in any direction. *Copper General: Moves one square vertically or one square diagonally forward. *Evil Wolf: Moves one square forward in any direction or move one square sideways. *Silver General: Moves one square diagonally in any direction or one square directly forward. *Gold General: Moves one square in any direction except diagonally backwards. *Ferocious Leopard: Moves one square in any direction except sideways. *Kirin: Moves one square diagonally in any direction or jump two squares in a straight line in any direction. *Phoenix: Moves one square in a straight line in any direction or jump two squares diagonally in any direction. *Blind Tiger: Moves one square in any direction except directly forward. *Drunk Elephant: Moves one square in any direction except directly backward. *King: Moves like the King in chess. *Flying Dragon: Moves up to two squares diagonally in any direction. *Violent Ox: Moves up to two squares in a straight line in any direction. *Lion: Moves or jumps within the 5x5 area and it can move twice in one turn (only if it moves to an adjacent square on its first move). It can also jump if it moves two squares or an L shape away from its starting square. *Lance: Moves any number of squares forward. *Reverse Chariot: Moves any number of squares vertically. *Side Mover: Moves any number of squares sideways or one square vertically. *Vertical Mover: Moves the same as the Reverse Chariot, but it can also move one square sideways. *Bishop: Moves like the Bishop in chess. *Dragon Horse: Moves the same as the Bishop, but it can also move one square in any direction. *Rook: Moves like the Rook in chess. *Dragon King: Moves the same as the Rook, but it can also move one square in any direction. *Queen (Free King): Moves like the Queen in chess. ===Promoted pieces=== Promotion happens when a piece enters the promotion zone which is the last five rows (opponent's side). There are some existing promoted pieces at the setup of the game, but there are some pieces that do not exist in the setup and can only appear by promotion. If you decide not to promote when a piece enters the promotion zone, you can not promote that piece until you leave then re-enter the promotion zone or capture a piece in the promotion zone. Once a piece is promoted, that piece cannot go back to its original form and pieces can only promote once only. The king, queen and lion do not promote into a different piece. ====Existing pieces during promotion==== *Gold General: Promoted Pawn, Stone General, Knight, Iron General, Cat Sword, Angry Boar, Evil Wolf, Flying Dragon and Violent Ox *Drunk Elephant: Promoted Go-Between *Side Mover: Promoted Copper General *Vertical Mover: Promoted Silver General *Rook: Promoted Gold General *Bishop: Promoted Ferocious Leopard *Lion: Promoted Kirin *Queen (Free King): Promoted Phoenix *Dragon Horse: Promoted Bishop *Dragon King: Promoted Rook ====New pieces during promotion==== *Flying Stag (promoted Blind Tiger): Moves the same as the Vertical Mover, but it can also move one square diagonally in any direction. *Prince (promoted Drunk Elephant): Moves the same as the King, it is also a second king and their opponent need to capture both the King and Prince in order to the win the game. *White Horse (promoted Lance): Moves any number of squares vertically or any number of squares diagonally forward. *Whale (promoted Reverse Chariot): Moves any number of squares vertically or any number of squares diagonally backward. *Free Boar (promoted Side Mover): Moves any number of squares in any direction except vertically. *Flying Ox (promoted Vertical Mover): Moves any number of squares in any direction except sideways. *Horned Falcon (promoted Dragon Horse): Moves any number of squares in any direction, but it uses its lion movement directly forward (but not moving off the directly forward direction). *Soaring Eagle (promoted Dragon King): Moves any number of squares in any direction, but it uses its lion movement diagonally forwards (but not moving off the diagonal forwards direction). ==Related pages== *Chu shogi *Shogi Category:Chess variants",
 "title": "Dai shogi"
}