{
 "id": "1163755",
 "text": "Beverley Diane Parken \"Bev\" Longstaff (born: 18 June 1946) is a Canadian former politician. ==Biography== Longstaff was born on 18 June 1946 in Calgary where she grew up. She attended Queen Elizabeth High School. She started working after she graduated in 1964. In the early 1970s she returned to Calgary and attended the Southern Alberta Institute of Technology (SAIT) and received her Engineering Graphic Technology diploma in 1978. After working in the fiels of engineering drafting in private industry she returned to SAIT to become an instructor in the Engineering Drafting Department. She was involved in community service and was president of the Hillhurst-Sunnyside Community Association, vice-president of the Federation of Calgary Communities and president of the Coalition of NW Communities. Her political career started after the 1989 Calgary municipal election where she was elected as alderman (Ward) of the Calgary City Council. After this period she was re-elected three times and was a member of the Calgary City Coundil to 22 October 2001. Longstaff was involved in transportation and was a member of forty committees of Calgary. She was a proponent of Calgary Transit with a priority of community safety. She wanted to use the light metro (LRT) to reduce the amount of cars, to reduce the pollution and to get people easily downtown. Longstaff also served as the director of Enmax from 1997 to her resignation in 2001. At the 2001 Calgary municipal election she ran for mayor and received the support of former mayor Al Duerr. However, she was narrowly defeated by Dave Bronconnier. She became Calgary Office director for the 28th G8 summit in 2002 in Kananaskis and became director of the Calgary Airport Authority in 2002. Later she became chair of the Government and Public Affairs Committee and a member of the SAIT Board of Governors (2005-2008). The West Hillhurst pedestrian bridge that she helped created, was named after her in 2024. ==References== Category:Canadian politicians Category:1946 births Category:Politicians from Calgary Category:Living people",
 "title": "Bev Longstaff"
}