{
 "id": "1163539",
 "text": "Juma Khalil Ibrahim, known as Bavê Teyar (kurdish باڤێ تەیار; born 1957 in Qamishli, in the Kurdish region of Rojava in Syria; died 19 January 2025) was a renowned Kurdish actor, comedian, and cultural icon celebrated for his contributions to Kurdish theatre and music. His stage name, Bave Teyar,\" translates to \"Father of Teyar\" in Kurdish. ==Early Life and Career== Born in Qamishli, a city in northeastern Syria, Juma Khalil Ibrahim developed a passion for the performing arts early in life. Over a career spanning more than three decades, he became a pivotal figure in Kurdish theatre, known for his humor and patriotism. His performances often addressed societal issues, blending comedy with poignant commentary on Kurdish identity and resilience. ==Musical Contributions== In addition to his theatrical work, Bavê Teyar was an accomplished musician. His discography includes singles such as \"Cirane,\" \"Laye Apemın,\" and \"Mewlud,\" which showcase his versatility and commitment to Kurdish culture, traditional themes and contemporary issues. His music is available on platforms like Spotify, Apple Music, and Amazon Music, allowing his influence to reach a global audience. ==Activism and Death== In January 2025, Bavê Teyar joined a peaceful sit-in protest at the Tishreen Dam in northern Syria, advocating against Turkish and Turkish-backed militia attacks on the region. On 18 January 2025, during this protest, he was critically injured in an airstrike attributed to Turkish forces. Despite receiving medical attention, he succumbed to his injuries on 19 January 2025. ==Selected Discography== * Cirane (2024) * Laye Apemın (2024) * Mewlud (featuring Helimo) * Çavexwe Vek (2024) * Mamoste (2024) * Kahf Mezıno (2024) ==Filmography== Bavê Teyar also starred in a series of Kurdish comedy films, which remain popular among Kurdish-speaking audiences. A collection of these films is available on YouTube, showcasing his talent in bringing humor and social commentary to the screen. Bavê Teyar's contributions to Kurdish culture through his art and activism have left an indelible mark, ensuring his memory will be cherished for generations to come. == References == Category:1957 births Category:2025 deaths Category:People from Qamishli Category:Kurdish actors Category:Kurdish-language actors of Syria Category:Syrian Kurdish people Category:Living people",
 "title": "Bave Teyar"
}