{
 "id": "1164253",
 "text": "Battle of Kalabakan was a surprise attack by the Indonesian National Army (TNI) and Indonesian Marine Corps (IMC) on the camp of the Third Battalion of the 3 RAMD in Kalabakan. ==Overview== The attack was led by Serda Rebani, Sabah on 29 December 1963. This attack took place during the Indonesia- Malaysia Confrontation (1963–1966). ==Background== On December 16, 1963, a group of KKO soldiers conducted reconnaissance of the Sabah Rangers Post in Kalabakan and discovered that the post was very strong. Then a commander named Rebani decided to attack Kalabakan on December 30, 1963. ==Battle== On the night of 29 December 1963 at 11:35 pm, Indonesian forces consisting of the KKO, TNKU launched an attack on the Malaysian security force positions in Kalabakan. The first attack was carried out by a detachment led by Sergeant Benny of the KKO, which attacked the RAMD-3 Post from a hilltop. In this attack, one officer and seven RAMD-3 personnel were killed, while 18 others were injured. Ten minutes later, the second group attacked the Kalabakan Police Station. However, poor coordination in the attack gave the Police and Home Guard forces a chance to defend themselves. They managed to kill one Indonesian and injure four others. The fighting lasted for four hours before the Indonesian troops retreated north of Kalabakan. The attack in Kalabakan was known as the Fiery Night in Kalabakan by the locals due to the intensity of the fighting. The RAMD-3 and police forces were supported by the Scout Troop and elements of the A 2 Reconnaissance Squadron replay troop which were deployed to assist. ==Aftermath== On 2 January 1964, a 1/10 Gurkha troop led by Lieutenant Colonel Burnett was sent to Kalabakan to assist the 3rd Royal Malay Regiment (RAMD) in a search operation in the area. On 27 January, a patrol from Company B under the command of Second Lieutenant Ishar Bin Sham (12221) encountered an encampment of invading soldiers, which resulted in a clash. In the incident, one Indonesian soldier was killed and two rifles, 12 grenades, and a number of bullets were recovered. On 28 January, Platoon 6 led by Second Lieutenant Abdul Aziz Shaari (12178) managed to kill three Indonesian soldiers after being involved in a fierce battle at Merotai Estate. As of 10 February, 29 Indonesian soldiers had been killed, 33 captured, and 22 surrendered. The success was the result of quick action by the Malaysian military, which obtained assistance from the Gurkha forces and the Australian military, in addition to cooperation with the Home Guard in efforts to track and locate the North Kalimantan National Army (TNKU) into the jungle around Kalabakan. Sergeant Rebani was also recorded as having died in the hunt due to lack of food and drink and also the difficult terrain. For his services, Sergeant Rebani was promoted to the rank of Sergeant Major posthumously. ==Reference== Category:1960s conflicts Category:History of Malaysia Category:History of Indonesia",
 "title": "Battle for Kalabakan"
}