{
 "id": "1164785",
 "text": "Operation Wetback was a plan to deport illegal Mexican immigrants from the United States. It was created by Joseph Swing, a retired United States Army lieutenant general and head of the United States Immigration and Naturalization Service (INS). It started in June 1954 and led by U.S. Attorney General Herbert Brownell. The operation used military planning to remove Mexican immigrants. Some people deported were American citizens. Millions of Mexicans were in the United States legally before the operation. Some came in to work with the help of United States government. Others were native to the land where they lived. Operation Wetback was planned to send them to Mexico. == Background == === Migration and work before World War II === Mexico began tell its people not to move to the United States in the early 1900s. This started with President Porfirio Díaz. The Mexican government said that if workers moved to the United States, they would not help the economy of Mexico.Hernandez 2006, p. 425. Cheap work was important for Mexico because it was the main thing that improved its economy and helped farming. The growing number of farms in United States needed more workers. Starting in the 1920s, Mexicans began to be used as the main workers on farms in the United States, especially in the Southwest. Every year in the 1920s, about 62,000 workers entered the United States legally. Over 100,000 illegally entered. Mexican farm owners began to ask United States farms to return Mexican workers. The small number of Mexican workers caused crops to rot in Mexican fields because many left to work in the U.S. American farm owners kept illegal Mexican workers to help with the growing amount of work on farms. === The Bracero Program (1942–1964) === During World War II, the Mexican and American governments made the Bracero Program. This gave permission to Mexican workers to work in the United States for a little time. For the United States, it gave permission to increase the security of the border and to deport Mexicans staying illegally. The program started on September 27, 1942 when the first braceros entered the United States. The program called for braceros to be given pay, housing, food, and not to be used in the United States military. However, Mexico said that only healthy young men with farming skills could be in the program. Workers who did not have skills were not able to get papers to work in the United States. === Illegal migration after 1942 === American farm owners kept using illegal Mexican immigrants as workers during the Bracero program. The program did not allow enough Mexican workers enter. Many who could not work as a bracero entered illegally into the United States. They wanted better pay and lives. About 70% of people who tried entering the United States were not allowed. This is because they were not wanted because they were too old, were not a man or other reasons. The Mexican Constitution allowed citizens to leave the country with work papers. However, the work papers could not be made in the United States until a person had already left their country. Thismade it difficult for Mexicans to legally enter the United States. INS also made it difficult to enter. This is because they made Mexicans take reading tests and pay money. == Operation Wetback (1954) == The Bracero program gave about 309,000 Mexican workers permission to work in the United States. Operation Wetback was used to send many of these workers back to Mexico. In June 1954, teams of 12 Border Patrol agents were created to deport Mexicans. The first part of the operation had: * 750 officers and investigators * 300 jeeps, cars and buses; and * 7 airplanes The teams had to be quick. People in the planes would talk to people on the ground on how to catch and move people into Mexico. Those caught were given to Mexican officials. The officials then sent those people into central Mexico. This is where workers were needed. The operation mainly happened in Texas and California.Ngai 2004, p. 156. This is because it is near Mexico. The operation also happened in Los Angeles, San Francisco, and Chicago. The United States government said people were sent into Mexico 1,074,277 times in the first year of Operation Wetback. == See also == * Emigration from Mexico * Mexican Repatriation * Operation Aurora * Wetback (slur) == References == === Sources === * * * * * * * * * * * * === More reading === * * * * * Category:Immigration to the United States Category:Dwight D. Eisenhower",
 "title": "Operation Wetback"
}