{
 "id": "1164987",
 "text": "Shady XV (pronounced ''shady fifteen') is a hip hop compilation album made by various singers of Shady Records. The double disc album was released on November 24, 2014, by Shady Records and Interscope Records. == Track listing == ;Notes * signifies a co-producer. * signifies an additional producer. ;Sample credits * \"Vegas\" interpolates \"Versace\" written and performed by Migos * \"Fine Line\" interpolates \"Melody\" by Luis Resto *\"Shady XV\" contains elements of \"My Kinda Lover\", written and performed by Billy Squier. Contains elements of \"Fack\" and \"The Monster\" performed by Eminem. *\"Die Alone\" interpolates \"Just So You Don't Die Alone\", written and performed by Luis Resto. *\"Down\" contains elements of \"Going Down\", written by Don Nix and performed by Freddie King. *\"Twisted\" contains elements of \"Synthetic Substitution\", written by Herb Rooney and performed by Melvin Bliss. *\"Detroit vs. Everybody\" contains elements of \"Funky Drummer\", written and performed by James Brown, and \"Static on the Frequency\", written by Peter Beveridge, Andy James and Jon Trotti and performed by Peter Beveridge. *\"I Get Money\" contains elements of \"Top Billin'\", written by Kirk Robinson and performed by Audio Two. *\"Cry Now\" contains elements of \"Blind Man\", written by Joseph Scott and Don Robey, and performed by Bobby \"Blue\" Bland. *\"Hammer Dance\" contains elements of \"Falling Away from Me\", written by Jonathan Davis, Reginald Arvizu, James Shaffer, David Silveria and Brian Welch, and performed by Korn. *\"Wanna Know\" contains elements of \"It Couldn't Be Me\", written by William Jones and Dennis Webber and performed by Power of Zeus. ==Charts== ===Weekly charts=== Chart (2014–15) Peak position Australian Compilation Albums (ARIA) 1 Italian Compilation Albums (FIMI) 3 US Compilation Albums (Billboard) 1 ===Year-end charts=== Chart (2015) Position Canadian Albums (Billboard) 32 US Billboard 200 104 US Top R&B;/Hip-Hop Albums (Billboard) 13 US Rap Albums (Billboard) 10 ==Certifications== ==References== Category:2014 albums Category:Eminem albums Category:Shady Records albums Category:Hip hop albums",
 "title": "Shady XV"
}