{
 "id": "1164671",
 "text": "Marriza (; , born Thein Zaw (; born 20 October 1967 - 23 January 2025) was a Burmese rock singer-songwriter, recognized for his contributions to the rock music scene in Myanmar. He was known for his original music in a time when most musicians in Myanmar performed cover songs. He gained recognition for composing and performing his own original music, standing out in an era when cover music was prevalent in Myanmar's music industry. On 23 January 2025, Marriza passed away at the age of 57 due to kidney disease. His death was widely reported by major Burmese news outlets, including NP News, Radio Free Asia, and Dawei Watch, and received significant attention on social media. Many Burmese musicians and celebrities expressed their grief, highlighting his influence on Myanmar's music scene. Marriza was particularly noted for his contributions to rock music, especially for his original compositions at a time when cover songs were prevalent in the industry. His passing was seen as a major loss to the country's music community. == Early life == Marriza was born in Minhla Township, Magway Province, Myanmar (formerly Burma). He was the eldest of two children. In 1993, he moved to Yangon to start his music career. == Music career == Marriza worked with the Burmese rock band Iron Cross and became known for his original songs. His song \"Long Hair, Tall Height, My Lover\" became very popular. He focused mostly on rock music, and his albums gained a loyal audience. Some of his famous albums include: # Pon Yait Mai Ga Yit Phyit (1993) # Mait Sar A Twet Ga Yu Nar # Myor Lint Chin La Min # Ga Mie Bar Moe Kyoe # Ko Yote Soe # Pyar Yae Myint # Ka Oo Nar # Shwe Yaung Kaung Kin # A Chit Nget Thar Kaung # Shwe Yati (2002) # Zet Paung (2004) # Tay Char Par Tel # A Chain A Kar (2016) # Oo Dan (2019) == Death == Marriza passed away on 23 January 2025 at the age of 57 from kidney disease. He died in Bahosi Hospital in Yangon and was buried at Yayway Cemetery. == Personal life == Marriza was married to San San Win, and they had two daughters, Lu Lu and Ye Ye. == References == Category:Pages created with the Article Wizard from 2025 Category:20th-century singers Category:20th-century Burmese musicians Category:21st-century Burmese musicians Category:21st-century singers Category:1967 births Category:2025 deaths Category:Burmese singer-songwriters Category:Burmese singers",
 "title": "Marriza (singer)"
}