{
 "id": "1164055",
 "text": "Lyodra Margareta Ginting (born 21 June 2003) is an Indonesian singer and female actor from Medan, North Sumatra. He is the winner of the A3 category (aged 13-15 years) in the 2017 Sanremo Junior international solo singing competition for children in Sanremo City, Italy, as well as the champion of the tenth season of Indonesian Idol. == Early life and education == Lyodra is the eldest of two children, from Simar Ginting and Natalia Johanna Tarigan. His father is an entrepreneur while his mother is a mental health nurse. == Career == Lyodra started her career as a national child singer at the 2014 Kirana Semen Indonesia event, He also advanced to the final in Jakarta, along with 28 other finalists from 28 cities in Indonesia. In the final round at the national level which was held on March 31 2014 at Djakarta Theater XXI, Central Jakarta, Lyodra finished in the top four and took home the first place prize. == Discography == === Album studio === List of studio albums with selected details Tittle Album Detail note. Lyodra *Release: 16 July 2021 * Label: Universal Music Indonesia * Format: CD, digital download Melangkah *Release: 11 October 2024 * Label: Universal Music Indonesia * Format: digital download === Television show === Year Tittle Role Notes 2022 The Voice: All- Stars Guest star First season; episode: \"Knockout Episode 6\" Rising Star Dangdut First season; episode: \"Final Stage 3 Besar\" X Factor Indonesia Third season; episode: \"Final Countdown & Result Show\" Idola Cilik Companion jury Sixth season; 3 episode 2022, 2023 The Indonesian Next Big Star Guest star First and second seasons; 2 episode 2023 Indonesia's Next Top Model Cycle 3; episode 18: \"Gadis yang Menikmati Waktu Minum Teh\" 2024 X Factor Indonesia Fourth season; episode: \"Grand Final\" == Awards == During his career, Lyodra has received 39 awards from 71 nominations, including 4 Indonesian Music Awards, 2 Indonesian Music Awards, and 5 Bandung Music Awards and received 7 special awards. In her career as a child singer, she won the 2017 Indonesian Music Award in the Best Female Children's Solo Artist category with the song \"Dear Dream\". After his debut as an adult singer, he received an award from the Dahsyatnya Awards as the Most Powerful Newcomer. Lyodra received his first nomination for an international award at the 2021 MTV Europe Music Awards in the Best Southeast Asian Act category. The first international music award he won was the 2021 Mnet Asian Music Awards as Best New Asian Artist Indonesia, followed by the 2022 Asia Artist Awards—specifically the Asia Celebrity music category. Apart from music awards, in January 2021 Lyodra's name was included in the list of nine women who won the Indonesia's Beautiful Women award held by HighEnd magazine. In February 2022, he was also included in the annual Forbes Indonesia 30 Under 30 list in the Young Achievers and Game Changers category. == References == Category:Living people Category:2003 births Category:Indonesian singers Category:Indonesian people Category:Indonesian actors",
 "title": "Lyodra Ginting"
}