{
 "id": "1164918",
 "text": "Bradley Michael Hunt (born August 24, 1988) is a Canadian professional ice hockey defenceman. He currently plays for the Hershey Bears of the American Hockey League (AHL). He has also played for the Edmonton Oilers, St. Louis Blues, Nashville Predators, Vegas Golden Knights, Minnesota Wild, Vancouver Canucks, and Colorado Avalanche of the National Hockey League (NHL). ==Career== Before playing in the NHL, Hunt played parts of 3 seasons with the Coquitlam Express of the British Columbia Hockey League (BCHL) and 4 years with the Bemidji State Beavers. With the Express, Hunt was named the team's Most Outstanding Defenceman twice and was named to the BCHL All-Star Game in 2007. Hunt was also successful in his time with the Beavers. He was named to CHA All-Tournament Team and helped them win the College Hockey America (CHA) tournament. By winning the tournament, the Beavers entered the 2009 NCAA Division I Men's Ice Hockey Tournament as the lowest seeded team. As the underdogs, the Beavers went on to defeat the Notre Dame Fighting Irish and Cornell Big Red to make it to the Frozen Four. The team eventually lost to the Miami RedHawks but Hunt was named to the NCAA Midwest Regional All-Tournament Team, All-CHA Rookie Team, All-CHA First Team, and was awarded the CHA Rookie of the Year. Hunt ended his time at Bemidji State as the team's all-time leader in defenceman scoring and defenceman power play goals. He was not drafted by an NHL team but signed a amateur tryout contract with the Chicago Wolves of the American Hockey League (AHL). Hunt was named to the 2013 AHL All-Star Game. On July 7, 2013, Hunt signed a two-year entry-level contract with the Edmonton Oilers. He was sent down and played most of his time with their AHL-affiliate Oklahoma City Barons. On January 3, 2014, Hunt made his NHL debut in a 5-2 loss against the Anaheim Ducks. On October 11, Hunt scored his first NHL goal in a 5-4 shootout loss against the Vancouver Canucks. On July 2, 2016, Hunt signed a one-year, two-way contract with the St. Louis Blues but only played 9 games with them. He was then placed on waivers and picked up by the Nashville Predators on January 16, 2017. On July 1, 2017, Hunt signed a two-year, one-way contract with the Vegas Golden Knights. He played 58 games with them. On January 21, 2019, the Golden Knights traded Hunt along with a sixth-round pick to the Minnesota Wild in exchange for a fifth- round pick in the 2019 NHL Entry Draft. On June 24, 2019, Hunt signed a two- year, $1.4 million extension to stay with the Wild. On July 28, 2021, Hunt signed a one-year, $800,000 contract with his home province Vancouver Canucks. He played 1 season with them. On July 15, 2022, Hunt signed a two-year, two- way contract with the Colorado Avalanche. He split time between the Avalanche and their AHL-affiliate Colorado Eagles. He was named to the AHL All-Star Classic but decided to instead play with the Avalanche. On August 2, 2024, Hunt signed a one-year contract with the Hershey Bears of the American Hockey League (AHL). ==References== == Other websites == * Category:1988 births Category:Living people Category:Bakersfield Condors players Category:Canadian ice hockey defencemen Category:Chicago Wolves players Category:Colorado Avalanche players Category:Colorado Eagles players Category:Edmonton Oilers players Category:Hershey Bears players Category:Ice hockey people from British Columbia Category:Minnesota Wild players Category:Nashville Predators players Category:Oklahoma City Barons players Category:People from Maple Ridge, British Columbia Category:St. Louis Blues players Category:Vancouver Canucks players Category:Vegas Golden Knights players",
 "title": "Brad Hunt (ice hockey)"
}