{
 "id": "1164628",
 "text": "The Cebu Metropolitan Cathedral is the ecclesiastical seat of the Metropolitan Archdiocese of Cebu in Cebu City, Philippines.Metropolitan Archdiocese of Cebu, Philippines The church is dedicated to the Blessed Virgin, under her title, Our Lady of the Immaculate Conception and to Saint Vitalis of Milan. Before its status as a \"primatial church\", it was one of the first Roman Catholic places of worship in the Philippines dedicated to Saint Vitalis of Milan. ==History== The diocese in Cebu was established on August 14, 1595, and its status was elevated to become a metropolitan archdiocese on April 28, 1934. Its eclesiastical jurisdiction reached far, with the dioceses of Dumaguete, Maasin, Tagbilaran and Talibon as suffragans. The Spanish conquistadors led by Miguel Lopez de Legazpi, Fray Andrés de Urdaneta and Fray Diego de Herrera had the cathedral erected, neighboring their fort in April 1565.Astrid Sala-Boza, “The Contested Site of the Finding of the Holy Child: Villa San Miguel or San Nicolas (Cebu El Viejo),” Philippine Quarterly of Culture Society 34, (2006): 232. www.jstor.org/stable/29792595 Construction of the cathedral took many years due to frequent interruptions, brought about by lack of funds and other unexpected events.\"Cebu Cathedral\" The architecture of the church was typical of Spanish colonial churches in the Philippines — squat, and with thick and low walls to withstand typhoons and other natural calamities. The façade featured a trefoil-shaped pediment, decorated with carved relief of floral motifs, IHS inscriptions and griffin gargoyles. The Spanish Royal Coat of Arms is emblazoned in low relief above the main entrance, perhaps reflecting the contribution of the Spanish monarch to its construction. ==Word War II and after== During World War II, much of the cathedral was destroyed by Allied bombings of the city. Only the belfry (built in 1835), the façade, and the walls remained. It was rebuilt in the 1950s during the incumbency of Archbishop Gabriel Reyes, with the architect Jose Ma. Zaragosa.\"Cebu Cathedral\" In 1982, a mausoleum was built at the back of the sacristy at the behest of Cardinal-Archbishop Julio Rosales.http://cebuheritage.net Today, it serves as a final resting place for the remains of Cebu's bishops and clergy. Rosales, who died three months after inauguration of the mausoleum, was interred there along with Archbishop Manuel Salvador, a coadjutor archbishop of Cebu, Archbishop Mariano Gaviola, the archbishop of Lipa (1981–1993), and most recently, Rosales' successor, Ricardo Vidal. The remains of Bishop Juan Bautista Gorordo, the first Filipino and Cebuano bishop of Cebu, are also interred there. ==Gallery== File:Cebu_Metropolitan_Cathedral_20180628l.jpg File:Cebu_Metropolitan_Cathedral_mmersed_in_greenery.jpg The_Metropolitan_Cathedral_of_the_Most_Holy_Name_of_Jesus_and_of_St._Vitales_02.JPG ==References== Category:Roman Catholic cathedrals in the Philippines Category:Cathedrals in the Philippines",
 "title": "Cebu Metropolitan Cathedral"
}