{
 "id": "1164890",
 "text": "India, officially the Republic of India is a country in South Asia, consisting of 28 states and eight union territories. All Indian states and some of the union territories have their own elected government and the union territories come under the jurisdiction of the Central Government. India has its own national symbols. Apart from the national symbols, the states and union territories have adopted their own seals and symbols including vegetables listed below. == States == List of Indian state vegetables State Common name Binomial name Image IUCN category Andhra Pradesh Brinjal Solanum melongena Arunachal Pradesh Raja Mircha Capsicum chinense Assam Indian-snake gourd/Chichinga Trichosanthes cucumerina Bihar Indian-sponge gourd Luffa acutangula Chhattisgarh Golden beetroot Beta vulgaris Goa Red pumpkin Cucurbita maxima Gujarat Indian-Bitter gourd Momordica charantia Haryana Chameleon melon (cucumber) Cucumis callosus/Cucumis pubescens Himachal Pradesh Himachali Lingri Diplazium esculentum Jharkhand Cassava Manihot esculenta Karnataka Udupi Mattu Gulla Solanum melongena Kerala Indian drumstick Moringa oleifera Madhya Pradesh Indian garlic Allium sativum Maharashtra Ivy gourd Coccinia grandis Manipur Water spinach Ipomoea aquatica Meghalaya Tree-tomato Cyphomandra betacea Mizoram Mizo-mustard greens/Hlabok Brassica juncea rugosa Nagaland Naga Viper pepper/Ghost pepper Capsicum frutescens Odisha Bristly- Balsam pear Momordica dioica Punjab Indian-Bitter gourd Momordica charantia Rajasthan Guar Cyamopsis tetragonoloba Sikkim Long-Green onion Allium fistulosum Tamil Nadu Indian calabash Lagenaria siceraria Telangana Tomato Solanum lycopersicum Tripura Long-Green onion Allium fistulosum Uttar Pradesh Potato Solanum tuberosum Uttarakhand Stinging nettle Urtica dioica West Bengal Pointed gourd Trichosanthes dioica == Union territories == List of Indian state vegetables (Union territories) Union territory Common name Binomial name Image IUCN category Andaman and Nicobar Islands Andaman potato Ipomoea batatas Chandigarh Indian-Bitter gourd Momordica charantia Delhi Indian-Bitter gourd Momordica charantia Lakshadweep Taro Colocasia esculenta Puducherry Tromboncino Cucurbita moschata/Tromboncino ==References== State Vegetables Indian state vegetables State Vegetables Vegetables Vegetables",
 "title": "List of Indian state vegetables"
}