{
 "id": "1164977",
 "text": "D12 World is the second and final studio album by American hip-hop group D12. It was released on April 27, 2004. The album sold 544,000 copies in its first week on the U.S. Billboard 200. The album is also the last D12 release to feature Proof before his death in 2006, and the second D12 album to feature Bugz on a track. ==Track listing== Notes * signifies an additional producer. * signifies a co-producer. *\"Bugz\" is taken from the song \"Desperados\", performed by DJ Butter, Eminem, Proof, Bugz & the Almighty Dreadnaughtz. *\"Just Like U\" does not appear on the clean version of the album. *\"Leave Dat Boy Alone\" features additional vocals by 50 Cent. *\"Get My Gun\" is an unlockable song in the 2006 open-world game Scarface: The World Is Yours. *\"Barbershop\" can be found on the Barbershop 2: Back in Business soundtrack. *The clean version of the album allows \"ass\" to be uncensored but few uses of the word \"hell\", some references to alcohol use, most references to drugs, sexual content, and violence are edited out, although all sound effects remain intact. *\"6 in the Morning (Come on In)\" was leaked in the bootleg mixtape Straight From The Lab Sample credits *\"Git Up\" contains a sample from \"The Name Game\" by Shirley Ellis *\"Just Like U\" contains a sample from \"Sir Galahad\" by Rick Wakeman. *\"U R the One\" contains a sample from \"Girl Callin'\" by Chocolate Milk *\"Good Die Young\" contains a sample from \"Screen Kiss\" by Thomas Dolby *\"Keep Talkin'\" contains samples from \"Tortuga\" by Starwood and \"Halftime\" by Nas ==Personnel== * B-Real – guest appearance * Steve Baughman – mixing * Rondell Beene – skit * Bizarre – skit * Joe Borges – assistant * Bugz – skit * Tony Campana – engineer * Richard Castro – skit * Larry Chatman – project coordinator * Mike \"Chav\" Chavarria – engineer * D12 – group * Dr. Dre – producer, mixing * Mike Elizondo – keyboards * Eminem – producer, executive producer, mixing, skit * Essman – producer * 50 Cent – skit * Brian \"Big Bass\" Gardener – mastering * Richard Hunt – engineer * Steven King – bass, guitar, engineer, mixing, skit * Kuniva – skit * Night and Day – producer * Red Spyda – keyboards, producer * Luis Resto – keyboards, producer * Michael Strange – engineer * Obie Trice – guest appearance * Sacha Waldman – photography * Young Zee – skit * Kanye West – producer * Paul Williams – songwriter * J.R. Rotem – keyboards, songwriter ==Charts== ===Weekly charts=== Weekly chart performance for D12 World Chart (2004) Peak position Australian Albums (ARIA) and 1 Australian Urban Albums (ARIA) 1 Canadian Albums (Billboard) 1 Canadian R&B; Albums (Nielsen SoundScan) 1 Japanese Albums (Oricon) 2 Spanish Albums (PROMUSICAE) 17 US Billboard 200 1 US Top R&B;/Hip-Hop Albums (Billboard) 1 ===Year-end charts=== Year-end chart performance for D12 World Chart (2004) Position Australian Albums (ARIA) 34 Belgian Albums (Ultratop Flanders) 61 Dutch Albums (Album Top 100) 59 German Albums (Offizielle Top 100) 34 Swiss Albums (Schweizer Hitparade) 64 UK Albums (OCC) 62 US Billboard 200 30 US Top R&B;/Hip-Hop Albums (Billboard) 17 Worldwide Albums (IFPI) 18 ==Certifications== ==References== ==Other websites== * AllMusic review * Category:2004 albums Category:D12 albums Category:Shady Records albums",
 "title": "D12 World"
}