{
 "id": "1164768",
 "text": "Foreign Terrorist Organization (FTO) is a title given by the United States government to groups outside of the United States said to be involved in what the government says are terrorist activities. The United States secretary of state uses section 219 of the Immigration and Nationality Act of 1965 (INA) to give this title. Most groups on the list are Islamist extremist groups. The rest are nationalist/separatist groups or Marxist militant groups. == Groups called FTOs == the groups are called Foreign Terrorist Organizations: FTOs Date added Name Region Area of operations Notes October 8, 1997 Abu Sayyaf Group (ASG) Asia Philippines 62 FR 52650 Hamas (Islamic Resistance Movement) Middle East Palestinian Territories Harakat ul-Mujahidin (HUM) Asia Pakistan Hezbollah Middle East Lebanon Kongra-Gel (formerly Kurdistan Workers' Party) (KGK) Turkey, Iraq, Iran, Syria Formerly PKK, KADEK. 62 FR 52650. Liberation Tigers of Tamil Eelam (LTTE) Asia Sri Lanka, India 62 FR 52650 National Liberation Army (ELN) South America Colombia Palestine Liberation Front (PLF) Middle East Palestinian Territories Islamic Jihad Group Popular Front for the Liberation of Palestine (PFLP) PFLP-General Command (PFLP-GC) Revolutionary People's Liberation Party/Front (DHKP/C) Turkey Shining Path (Sendero Luminoso, SL) South America Peru October 8, 1999 al-Qa'ida Worldwide Afghanistan, Pakistan, Saudi Arabia 64 FR 55112 September 25, 2000 Islamic Movement of Uzbekistan (IMU) Asia Uzbekistan, Afghanistan May 16, 2001 Real Irish Republican Army (RIRA) Europe Ireland, United Kingdom Associated with 32 County Sovereignty Movement (32CSM) December 26, 2001 Jaish-e-Mohammed (Army of Mohammed) (JEM) Asia Pakistan Lashkar-e Tayyiba (Army of the Righteous) (LET) Later amended to include the Milli Muslim League. March 27, 2002 Al-Aqsa Martyrs' Brigades Middle East Palestinian Territories Asbat an-Ansar Lebanon al-Qa'ida in the Islamic Maghreb Africa, Middle East Algeria, Mali, Niger (formerly GSPC) August 9, 2002 Communist Party of the Philippines/New People's Army (CPP/NPA) Asia Philippines October 23, 2002 Jemaah Islamiyah (JI) Indonesia Also in Brunei, Malaysia, Thailand, Philippines, Singapore January 30, 2003 Lashkar i Jhangvi Pakistan March 22, 2004 Ansar al-Islam Middle East Iraq July 13, 2004 Continuity Irish Republican Army (CIRA) Europe Ireland, United Kingdom December 17, 2004 Islamic State of Iraq and the Levant (formerly Al-Qaeda in Iraq aka Tanzim Qa'idat al-Jihad fi Bilad al-Rafidayn (QJBR)) Worldwide Iraq, Syria, Libya, Nigeria Before were the Jama'at al- Tawhid wa'al-Jihad, JTJ, al-Zarqawi Network. Al-Nusra Front is said to be a different name of Al-Qaeda in Iraq June 17, 2005 Islamic Jihad Union (IJU) Asia Uzbekistan March 5, 2008 Harkat-ul-Jihad al-Islami (HUJI-B) Bangladesh March 18, 2008 Al-Shabaab Africa Somalia, Yemen, Mozambique May 18, 2009 Revolutionary Struggle Europe Greece July 2, 2009 Kata'ib Hezbollah Middle East Iraq January 19, 2010 al-Qa'ida in the Arabian Peninsula (AQAP) Saudi Arabia August 6, 2010 Harkat-ul-Jihad al-Islami (HUJI) Asia Bangladesh September 1, 2010 Tehrik-i-Taliban (TTP) Pakistan November 4, 2010 Jaish ul- Adl (formerly Jundallah) Iran May 23, 2011 Army of Islam (Palestinian) Middle East Palestinian Territories September 19, 2011 Indian Mujahideen (IM) (India) Asia India Jamaah Ansharut Tauhid (JAT) Indonesia May 30, 2012 Abdullah Azzam Brigades Middle East Iraq September 19, 2012 Haqqani Network (HQN) Asia Afghanistan, Pakistan March 22, 2013 Ansar Dine (AAD) Africa Mali November 14, 2013 Boko Haram Nigeria Ansaru December 19, 2013 al-Mulathamun Brigade Algeria January 13, 2014 Ansar al-Shari'a in Benghazi Libya Ansar al-Shari'a in Darnah Ansar al-Shari'a in Tunisia Tunisia April 10, 2014 ISIL Sinai Province (formerly Ansar Bayt al-Maqdis) Africa, Middle East Egypt May 15, 2014 Al- Nusra Front Middle East Syria August 20, 2014 Mujahideen Shura Council in the Environs of Jerusalem Africa, Middle East Egypt September 30, 2015 Jaysh Rijal al-Tariq al Naqshabandi (JRTN) Middle East Iraq January 14, 2016 ISIL-Khorasan Asia Afghanistan May 19, 2016 ISIL-Libya Africa Libya June 30, 2016 Al-Qa'ida in the Indian Subcontinent Asia Bangladesh, India, Pakistan August 16, 2017 Hizbul Mujahideen Kashmir February 28, 2018 ISIS-Bangladesh Bangladesh ISIS- Philippines Philippines ISIS-West Africa Africa Maghreb and West Africa May 23, 2018 ISIS-Greater Sahara Maghreb and West Africa July 11, 2018 al-Ashtar Brigades (AAB) Asia Bahrain September 6, 2018 Jama'at Nasr al-Islam wal Muslimin (JNIM) Africa Maghreb and West Africa April 15, 2019 Islamic Revolutionary Guard Corps Asia Iran Part of Iran's military. January 3, 2020 Asa'ib Ahl al-Haq Iraq March 10, 2021 ISIS-Democratic Republic of the Congo Africa Democratic Republic of the Congo ISIS-Mozambique Mozambique December 1, 2021 Segunda Marquetalia South America Colombia Revolutionary Armed Forces of Colombia – People’s Army (FARC-EP) January 20, 2025 Mara Salvatrucha (MS-13) Central America Mexico, California, and Texas Placed by Executive Order of POTUS. Tren de Aragua South America Venezuela, Colombia, Brazil, Peru, Ecuador, Bolivia, Panama, Costa Rica, Chile, Mexico, Trinidad and Tobago and United States January 22, 2025 Ansarallah Middle East, Asia Yemen Placed again by President Donald Trump in his second term. He first placed them on the list in January 11, 2021. The Biden government took them off the list on February 16, 2021. == FTOs removed from list == The groups below have been removed the list as of December 1, 2021. This is because they quit or are no longer active. FTOs removed Date added Date removed Name Region Area of operations Notes October 8, 1997 October 8, 1999 DFLP-Hawatmeh Faction (DFLP) Middle East, Asia Palestinian Territories 62 FR 52650 Khmer Rouge Asia Cambodia Manuel Rodríguez Patriotic Front – Dissidents (FPMR-D) South America Chile October 8, 2001 Japanese Red Army (JRA) Asia Japan Tupac Amaru Revolution Movement (MRTA) South America Peru Revolutionary Nuclei Europe Greece October 15, 2010 Armed Islamic Group (GIA) Maghreb, Africa Algeria September 28, 2012 Mujahedin-e Khalq (MEK) Middle East, Asia Iraq, Iran October 11, 2005 May 28, 2013 Moroccan Islamic Combatant Group (MICG) Maghreb, Africa Morocco September 10, 2001 July 15, 2014 United Self-Defense Forces of Colombia (AUC) South America Colombia October 8, 1997 September 3, 2015 Revolutionary Organization 17 November Europe Greece 62 FR 52650 March 27, 2002 December 9, 2015 Libyan Islamic Fighting Group (LIFG) Maghreb, Africa Libya October 8, 1997 June 1, 2017 Abu Nidal Organization (ANO) Middle East Palestinian Territories 62 FR 52650 October 8, 1997 November 30, 2021 Revolutionary Armed Forces of Colombia (FARC) South America Colombia 62 FR 52650 August 20, 2014 May 20, 2022 Mujahidin Shura Council in the Environs of Jerusalem (MSC) Middle East Palestinian Territories October 8, 1997 Kahane Chai (Kach) Israel Gama’a al- Islamiyya (Islamic Group – IG) Egypt Basque Fatherland and Liberty (ETA) Europe Iberian Peninsula Aum Shinrikyo (AUM) Asia Japan == References == Category:United States Department of State",
 "title": "United States Department of State list of Foreign Terrorist Organizations"
}