{
 "id": "1164059",
 "text": "The Buick GL8 is a luxury Minivan made by Buick since 1999. == First Generation (1999-2016) == The Buick GL8 started being produced in 1999. It is available in versions called LT, CT1, CT2, CT3 and the GT (available in first land only). The regular version is known as the GL8 2.5 and the long wheelbase version is called GL8 First Land. The first generation GL8 has 2.4 liter 2.5 and 3.0 liter V6 petrol engines and 4 and 6-speed automatic transmissions. It was improved in 2005 and 2010. It was made until 2016. == Second Generation (2010-present) == The Second generation was introduced in 2010 as a 2011 model. The design is inspired by the concept Buick Business. It was developed by Pan-Asia Technical Automotive Center. It has 2.0 liter turbo engines and a 2.4 liter (used until 2015) a 2.5 liter engine (used in 2017 only) and a 3.0 liter V6 petrol engine (used until 2017) and a 6-speed automatic transmission (used until 2019). Currently it is a 9-speed automatic transmission. After the launch of the third generation it was called Business Edition. The reason is to differentiate them. The second gen is still made and received improvements in 2020 and 2022. == Third Generation (2016-present) == The third generation was launched in 2016. It is nicknamed GL8 ES and is sold alongside the previous generation. It has a 2.0 liter turbo petrol engine with a 6-speed automatic transmission (used until 2019) and a 9-speed automatic transmission. It was improved in 2020 and 2022. Like the previous gen, it is still made. The car has Hybrid and Plug-in hybrid versions launched in 2024 as an improved version. The versions have a 1.5 liter petrol engine combined with an electric motor. == Fourth Generation (2022-present == The fourth generation debuted in 2022 as the GL8 Century or the Century. The minivan has three versions: Base, the normal version, Avenir the mid-range version, and Flagship, a more luxuorious version. The seven-seater version was then launched in August 2023. This gen is a mild-hybrid having a 2.0 liter petrol engine combined with an electric motor with a 9-speed automatic transmission. == Markets == The Buick GL8 is currently sold exclusively in the Chinese market but from 2001 to 2006 it was exported to Philipines under the Chevrolet brand as the Chevrolet Venture. == References == GL8 Category:1990s automobiles Category:2000s automobiles Category:2010s automobiles Category:2020s automobiles Category:Minivans",
 "title": "Buick GL8"
}