{
 "id": "1164894",
 "text": "India, officially the Republic of India is a country in South Asia, consisting of 28 states and eight union territories. All Indian states and some of the union territories have their own elected government and the union territories come under the jurisdiction of the Central Government. India has its own national symbols. Apart from the national symbols, the states and union territories have adopted their own seals and symbols including fruits listed below. == States == List of Indian state fruits State Common name Binomial name Image IUCN category Andhra Pradesh Banganapalle (mango) Benishan/Mangifera indica Arunachal Pradesh Himalayan-Kiwi Vine Actinidia callosa Assam Kaji Nemu Citrus jambhiri Bihar Bihar Langra Mangifera indica Chhattisgarh Sakhua fruit Shorea robusta Goa Cashew-Nut Anacardium occidentale Gujarat Indian mango Mangifera indica [[[Haryana]] Sapote Manilkara zapota Himachal Pradesh Lal Ambri Malus domestica Vulnerable Jharkhand Butter Honey- tree Madhuca longifolia Karnataka Badami Mango Kannada Alphonso Kerala Coconut tree Cocos nucifera Madhya Pradesh Kuttiattoor mango Mangifera indica Maharashtra Alphonso mango Mangifera indica Manipur Lengthei pineapple Ananas comosus Meghalaya Bayberry Myrica esculenta Mizoram Asiatic banana Musa sapientum Nagaland Tamarillo/Tree-tomato Solanum betaceum Odisha Jackfruit Artocarpus heterophyllus Punjab Dasheri mango Mangifera indica Rajasthan Indian jujube Ziziphus mauritiana Sikkim Tart cherry Prunus cerasus Tamil Nadu Jackfruit Artocarpus heterophyllus Telangana Himayat mango Mangifera indica Tripura Pineapple Ananas comosus Uttar Pradesh Benarasi Langra Benarasi Langra Uttarakhand Bayberry Myrica esculenta West Bengal Himsagar Mangifera indica == Union territories == List of Indian state fruits (Union territories) Union territory Common name Binomial name Image IUCN category Andaman and Nicobar Islands Andaman Kokum Garcinia dhanikhariensis Chandigarh Dasheri mango Mangifera indica Delhi Dasheri mango Mangifera indica Lakshadweep Coconut tree Cocos nucifera Puducherry Jungle jalebi Pithecellobium dulce ==References== State Fruits Indian state fruits State birds Fruits Fruits",
 "title": "List of Indian state fruits"
}