{
 "id": "1164032",
 "text": "Karan Veer Mehra is an Indian television actor. He started his career with the show, Remix in 2005. He was also seen play the lead role in Sony SAB TV, Biwi aur Main. He has also worked in Bollywood movies such as Ragini MMS 2, Mere Dad Ki Maruti, Blood Money, Badmashiyaan and Amen. He is recently the winner of Fear Factor: Khatron Ke Khiladi 14 and Bigg Boss 18.http://movies.indialivetoday.com/2017/01/13/karan-veer-mehra-spreads-road- safety-awareness-in-mumbai/ India Today == Early and personal life == Karan Mehra was born in Delhi. He studied in a boarding school in mussoorie : Wynberg Allen School and Delhi Public School (DPS). He did graduation in Advertising & Sales Promotion from Delhi College of Arts & Commerce (Delhi University).https://socialmantra.co.in/pavitra-rishta-karan-veer-mehra-age- biography-wife-name-family-height-weight-wiki-hot-images-affairs-girlfriend/ Socialmantrahttp://www.bollywoodshaadis.com/articles/fairytale-love-story-of- karanveer-mehra-and-devika-mehra-6527 Bollywoodshaadis == Filmography == === Movies === Year Title Role 2008 Pathan Drona 2009 Aage Se Right Rocky 2013 Bloody Isshq Rahul Mere Dad Ki Maruti Raj 2014 Ragini MMS 2 Maddy 2015 Badmashiyaan Pinkesh 2021 Choices Tarun === Television === Year Title Role Notes 2005 Remix Aditya Saath Rahega Always Soham 2006 Sati...Satya Ki Shakti Rajdeep Sikand Twinkle Beauty Parlour Lajpat Nagar Rocky Shanno Ki Shaadi Kunnu Ssshhhh...Phir Koi Hai Karan/Kunal Episode 12/32 2007–2008 Virrudh Vedant Raisinghania 2008 Pari Hoon Main Karan 2008–2009 Hum Ladkiyan Yuvraj Goel 2010–2011 Behenein Karan Rajvnash 2011 Surya – The Super Cop Inspector Rajhans 2012–2013 Amrit Manthan Yug 2013–2014 Pavitra Rishta Naren Karmarkar 2015 Rishton Ka Mela Karan Singh Gurjar 2017 TV Biwi Aur Main Rajeev 2020 Carry On Alia Rohit 2021–2022 Ziddi Dil Maane Na Abhay Mehra 2022–2023 Woh Toh Hai Albelaa Dr. Vikrant Desai 2023–2024 Baatein Kuch Ankahee Si Vaibhav Joshi 2024 Pukaar – Dil Se Dil Tak Gautam Rathore Fear Factor: Khatron Ke Khiladi 14 Contestant Winner 2024–2025 Bigg Boss 18 === Web series === Year Title Role Notes 2010 Amen Harry Short film 2018 It's Not That Simple Jayes 2020 Poison 2 Jaiveer === Music videos === Year Title Singer(s) Ref. 2024 Kehna Galat Galat Jyoti Nooran, Javed–Mohsin == References == ==Other websites== * Category:Year of birth missing (living people) Category:Living people Category:Date of birth not in Wikidata Category:1978 births Category:Indian actors Category:People from Delhi",
 "title": "Karan Veer Mehra"
}