{
 "id": "1164439",
 "text": "Marin Pongracic (born September 11, 1997 in Landshut, Germany) is a Croatian football player. He plays as a central defender for AC Fiorentina. ==Career == Pongracic began his club career in his hometown at SpVgg Landshut. 2010 he went to FC Bayern Munich. At the beginning of his training at FC Bayern, he played as a striker, then moved into defensive midfield in the U15 and finally into central defense in the B youth team. In his second B youth year he moved to FC Ingolstadt 04. In the summer of 2016 played for the second team of TSV 1860 Munich in the fourth-class Bavarian Regional League for the first time in a men's team. At the same time, Pongracic was on the field for the second division team for the full playing time in each of the last six league games. This was followed by relegation for 1860 Munich. Because the third division license was granted, they had to compete in the 4th level The defender did not go to the fourth division. He moved to the Austrian Bundesliga for the 2017/18 season to FC Red Bull Salzburg. With Salzburg he became national champion in his first season. He also played in the European Cup for the first time and reached the semi-finals of the Europa League. Alongside André Ramalho he was a regular in central defense in his second season in Salzburg and remained undefeated with the team in all games in which he was on the field. At the end of his season he played his part in winning the championship again and winning the cup. In the winter of 2020 he went to VfL Wolfsburg. Due to a personnel shortage in the defense, league rivals Borussia Dortmund signed the defender on loan until the end of the season in the 2021/22 season. Borussia Dortmund (German) After he came back to Wolfsburg a loan deal was made with the Italian Serie A team US Lecce at the end of August 2022. VfL Wolfsburg After the season, Lecce signed him permanently without a return to Wolfsburg. In July 2024 he moved to Fiorentina. Kicker.de ==International == Pongracic made his debut for the Croatia U21 team in August 2017 against Moldova. By November 2018 he had made a total of three appearances. In November 2020, he made his debut for the Croatian national team in a friendly match against Turkey. ==Honours == *Austrian champion: 2018, 2019 *Austrian Cup winner: 2019 ==References == Category:1997 births Category:Living people Category:FC Red Bull Salzburg players Category:Borussia Dortmund players Category:Bundesliga players Category:UEFA Euro 2024 players Category:Austrian football champions Category:Croatian footballers Category:Association football defenders Category:Association football full-backs",
 "title": "Marin Pongracic"
}