{
 "id": "1164016",
 "text": "Ricardo López (born January 14, 1972 – September 12, 1996) was a Uruguayan- American man who became notorious for stalking singer Björk in the mid-1990s. López's obsession with Björk culminated in a failed assassination attempt and his eventual suicide, making his case one of the most infamous examples of celebrity stalking. == Early life == Ricardo López was born in Montevideo, Uruguay, and moved to Lawrenceville, Georgia when he was young. Living in Miami, Florida, López led a relatively quiet life, working various jobs, including as a janitor. He had a limited social circle and developed a growing interest in music, particularly the work of Icelandic singer Björk, whose music he encountered in the mid-1990s. == Obsession with Björk == López’s obsession with Björk began in 1996, after he first encountered her music. His admiration quickly morphed into an unhealthy fixation, which led him to believe that they were meant to be together. He began following her career closely and fantasized about forming a romantic relationship with her. López became increasingly irrational and delusional in his beliefs about Björk. López's obsession grew more intense, and he began writing her letters, as well as creating a series of videotapes in which he discussed his feelings for her and his growing anger towards her relationships with other men. These videos became part of what would later be known as the \"Bjork Stalking Case.\" == Letter bomb plot == In late 1996, López decided to act on his obsession. He devised a plan to kill Björk by mailing her a letter bomb. López created a device that he intended to send to her, hoping it would detonate when she opened it. The bomb was concealed within a package containing a letter in which López detailed his intentions. However, López’s plans were foiled when the package was intercepted before it reached Björk. The singer, who was living in London at the time, was unaware of the imminent danger. The bomb never reached its intended target. == Arrest and death == In the aftermath of his failed attempt to harm Björk, López’s life took a tragic turn. He filmed a final video in which he detailed his actions and expressed his intention to end his life. On September 12, 1996, López died by suicide in his apartment in Hollywood, Florida. The police, who had been monitoring López's activities, discovered his body and the video tapes that chronicled his obsessive behavior. These tapes revealed the full extent of his delusions and his dangerous intentions. The videos were later used as evidence in legal proceedings and were widely circulated in media reports about the case. Category:1972 births Category:1996 deaths Category:American criminals Category:People from Miami",
 "title": "Ricardo López (stalker)"
}