{
 "id": "1164248",
 "text": "Roztocze National Park () is a national park in Lublin Voivodeship, Poland. It protects important natural areas in the middle part of the Roztocze hills. The park is in size. Forests cover 81.02 km2, and 8.06 km2 are strictly protected. The park's office is in Zwierzyniec. ==History== Nature protection in this region started in 1934, when the Bukowa Góra Preserve was created. It is now a strictly protected area. In 1938, for the first time in Poland, a law protected prey birds on the Zamoyski family estate. The park was made from State Forests in Kosobudy and Zwierzyniec, which belonged to the Zamoyski estate. Roztocze National Park started in 1974. At first, it was 48.01 km2. The park office is in a restored building from the Zamoyski estate in Zwierzyniec. ==Geography== The park is in the Roztocze Środkowe area, in the upper valley of the Wieprz river. This area separates the Lublin Upland (Polish: Wyżyna Lubelska) from the Sandomierz Dale (Polish: Kotlina Sandomierska). Two small rivers start here: the Szum (2.5 km) and the Świerszcz (7.5 km). Roztocze National Park has very old and special trees. Over 400 trees are called \"nature monuments.\" The park also has some of the tallest fir trees in Poland, up to 50 meters high. Visitors can use five walking trails or a trail for bicycles. ==Wildlife== The park is home to many animals, like red deer, roe deer, boar, red fox, grey wolf, and eurasian badger. In 1979, European beavers were brought back to the park, and now they live well in the Wieprz valley. In 1982, Polish ponies were also brought to the park. There are about 190 types of birds, such as eagles, storks, and woodpeckers. Reptiles in the park include lizards, common European adders, grass snakes, and the rare European pond terrapin. The park also has more than 2000 kinds of insects. ==Gallery== ==Related pages== * State Forests (Poland) ==References== ==Other websites== * Official website Category:National parks in Europe Category:Geography of Poland Category:Forests of Europe Category:Lublin Voivodeship Category:1974 establishments in Europe Category:1970s establishments in Poland",
 "title": "Roztocze National Park"
}