{
 "id": "116477",
 "text": "The mugger crocodile (Crocodylus palustris) is also known as the marsh crocodile, broad-snouted crocodile and mugger. It lives in the Indian subcontinent and nearby countries. In Pakistan's coastal regions of the Makran and delta marshlands of Sindh, it is known as the Indus crocodile. The name \"Mugger\" is a corruption of the Hindi word magar which means \"water monster\". It is one of three crocodilians in India, the others are the saltwater crocodile (C. porosus) and gharial (Gavialis gangeticus). Mugger crocodile hatchlings are pale olive with black spots. Adults are dark olive to grey or brown. The head is rough without any ridges. The mugger crocodile is a medium- sized crocodilian. It has a strong tail and webbed feet. It has good sense of smell, sight and hearing. Adult female muggers are 2 to 2.5 m (6 ft 7 in to 8 ft 2 in) on average. Adult male muggers are 3 to 3.5 m (9 ft 10 in to 11 ft 6 in). They rarely grow up to 5 m (16 ft 5 in). The largest known muggers measured 5.63 m (18 ft 6 in). == Distribution and habitat == The mugger crocodile can be found in southern Iran, Pakistan, Nepal, India and Sri Lanka, but is probably extinct in Bangladesh. It lives in freshwater lakes, rivers and marshes. It prefers slow-moving, shallow water bodies. It is also known to live in artificial reservoirs and irrigation canals. == Behaviour == The mugger crocodile is a very strong swimmer that uses its tail and hind feet to move forward, change direction and go under the water. Its belly touches the ground at the bottom of waterbodies and on land. During the hot dry season, it walks over land at night to find better wetlands. It spends most of the day under the water. During the cold season it basks on riverbanks and they tolerate one another during this period. They are more aggressive during the mating season. The mugger crocodile has an optimal body temperature of 30 to 35 °C (86 to 95 °F). It will die of freezing or hyperthermia when exposed to temperatures below 5 °C (41 °F) or above 38 °C (100 °F). It digs burrows to get away from extreme temperatures. Burrows are between 0.6 and 6 m (2.0 and 19.7 ft) deep. Temperatures inside the burrows keep constant. == References == Category:Reptiles of Pakistan Category:National symbols of Pakistan Category:Crocodilians of Asia",
 "title": "Mugger crocodile"
}