{
 "id": "1164856",
 "text": "Bagatao Island Lighthouse is a historic lighthouse located on Bagatao Island on the eastern side of the entrance to Sorsogon Bay, in the province of Sorsogon in the Philippines. The white cylindrical iron tower is situated on the rocky headland that forms the southern point in the western end of the Island, giving the total light elevation of . The light not only marks the entrance to the bay, but also assists ships in navigating the bend around Ticao Island of Masbate province as they manage through the San Bernardino Strait towards the Pacific Ocean.U.S. Coast and Geodetic Survey, \"United States Coast Pilot, Philippine Islands Part 1\", p.103. Washington Government Printing Office, 1919. == History == A masterplan entitled \"Plan General de Alumbrado de Maritimo de las Costas del Archipelago de Filipino\" or the \"Masterplan for the Lighting of the Maritime Coasts of the Philippine Archipelago\" was drafted in 1857 by the Spanish government in the Philippines, undertaking to erect 70 lighthouses throughout the Philippines. — which included Bagatao Island to locate a light proposed to assist ships navigating Ticao Pass towards San Bernardino StraitPor Algunos Padres De la Misíon de la Compañía de Jesús en Estas Islas (Filipinas), \"El Archipiélago Filipino, Colección de Datos\", p.527. Washington: Imprenta del Gobierno, 1900. — to protect the increasing maritime trade in the advent of the Manila-Acapulco Galleon Trade. Other proposed lights were a Capul Island Lighthouse at the strait of San Bernardino; and a Bugui Point Lighthouse in northern Masbate. Pre-fabricated steel parts from France, known as \"Tourelle\", were imported for local assembly. The enormity of the masterplan disadvantaged Bagatao, and only in 1904 was work undertaken for the Bagatao Island Lighthouse — by the Bureau of Lighthouse Construction of the newly-arrived United States colonial government sometime in 1903-1904. The tower was one of several lighthouse towers bought by Spain from France which were turned over to the Americans. A working party was assigned to Sorsogon Bay to assemble the light station on Bagatao island, build a pier of masonry for landing supplies, and construct a service road from the pier to the tower site. Other engineering works included a concrete storehouse and oil room, frame dwelling for the lightkeepers and a cistern of steel reinforced concrete.Bureau of Insular Affairs, U.S. War Department, \"Fifth Annual Report of the Philippine Commission\", Washington Government Printing Office, 1905. The Bagatao Island Lighthouse (\"Luz de Isla Bagatao\") stands to this day; with a modern solar-powered lamp installed by the Philippine Coast Guard. ==References== Category:Sorsogon Category:Lighthouses of the Philippines",
 "title": "Bagatao Island Lighthouse"
}