{
 "id": "1165805",
 "text": "Jonathan Sheffer is an American composer and conductor known for his work in classical music, opera, film, and television. He founded the Eos Orchestra, which received a Grammy nomination and the ASCAP Adventurous Programming Award. He has conducted for the New York City Opera, American Ballet Theatre, and various film scores, including works by Danny Elfman and Elliot Goldenthal. His compositions include operas such as The Mistake and Blood on the Dining Room Floor, orchestral works like The Conference of the Birds, and film scores for Darkman, The Omen IV, and Bloodhounds of Broadway. His works have been performed at institutions such as Lincoln Center, the Guggenheim Museum, and the Cabrillo Festival, as well as at festivals including Ravinia, Spoleto, and Aspen. He has also conducted for films such as Batman Returns, Alien 3, and Across the Universe. == Early life and education == Sheffer was born in New York City and raised in Westport, Connecticut. He attended Harvard University, where he studied under composer Leonard Bernstein. While at Harvard, Sheffer co-composed the score for the 1974 Hasty Pudding Theatricals production Keep Your Pantheon, written by humorist Mark O'Donnell. After Harvard, he pursued further studies at the Juilliard Extension and the Aspen School of Music, studying with notable figures such as Michael Czajkowski, Renée Longy, and John Corigliano. == Career == During the late 1970s and early 1980s, Sheffer gained recognition as a composer and lyricist for theatrical works. While attending the BMI Musical Theatre Workshop, he collaborated with Mark O'Donnell to write the revue Caught in the Act, which debuted in 1977 at the Spoleto USA Festival. Sheffer also worked with lyricist Alan Poul on the revue New Tunes, which was staged at the Manhattan Theatre Club. Other notable works from this period include the musical Ladies in Waiting (written with Patricia Resnick), Going Hollywood (with David Zippel), and songs for Diamonds, written with lyricist Howard Ashman. In 2011, a revival of Diamonds appeared off-Broadway in the show Hundreds of Hats. Sheffer composed scores for PBS American Playhouse films, including The Rise and Rise of Daniel Rocket, On Valentine's Day, Courtship, Bloodhounds of Broadway, In a Shallow Grave, and others. Additionally, Sheffer completed the score for Danny Elfman's Darkman, and contributed to films such as The Omen IV, Pure Luck (with Elfman), and Encino Man. As a conductor, Sheffer worked on numerous recordings for composers Danny Elfman and Elliot Goldenthal, including Alien 3, Batman Returns, Interview with the Vampire, Batman Forever, Heat, Batman & Robin, Sphere, In Dreams, Titus, and Across the Universe. His recent film scores include The Decent One and After Louie. In 1995, Sheffer founded the Eos Ensemble (later known as Eos Orchestra), which performed 75 concerts in New York and on tour, including a performance at the White House in 2000. The orchestra was also featured in the 2000 PBS American Masters portrait of composer Aaron Copland. Eos Orchestra recorded for major labels such as RCA Red Seal, BMG, and Telarc, receiving a Grammy nomination and winning the ASCAP Adventurous Programming Award in 1999. In addition to his work with the Eos Ensemble, Sheffer led Red (an orchestra) in Cleveland for six seasons. He has also served as a guest conductor at institutions such as the New York City Opera, American Ballet Theatre, Mark Morris Dance Group, and at festivals including Ravinia, Lincoln Center, and Spoleto (Italy). Sheffer leaded the New York State Council on the Arts (appointed by Governor Andrew Cuomo), the New York City Opera, and he has represented the New York City Council on the Board of Lincoln Center. == Composer == Sheffer's compositional work spans both opera and classical music. One of his major works is the one-act opera The Mistake, with a libretto by Stephen Wadsworth, which premiered at the Central City Opera. He also composed Blood on the Dining Room Floor, based on a novel by Gertrude Stein, which was produced off-Broadway in 2000. The production earned him the Richard Rodgers Production Award from the American Academy of Arts and Letters and was featured in the Guggenheim Works & Process series. Other major works include The Conference of the Birds, which was performed at the Cabrillo Festival under the direction of Marin Alsop, and the series Four 10-Minute Operas (comprising Camera Obscura, HBP, Owl Creek Bridge, and The Pat & Jerry Show). The operas were recorded by the Royal Scottish National Orchestra and released in 2024. == Awards and recognition == * Richard Rodgers Production Award from the American Academy of Arts and Letters for the opera Blood on the Dining Room Floor. * ASCAP Adventurous Programming Award in 1999 for his work with the Eos Orchestra. * Grammy Nomination for the Eos Orchestra. == References == Category:Living people Category:American composers Category:People from New York City",
 "title": "Jonathan Sheffer"
}