{
 "id": "1165295",
 "text": "Throw Throw Burrito is a card game made by the creators of the Exploding Kittens game. Their draw is put face-down. All players draw five cards from their draw pile and keep them hidden from others and only shown to themselves. There are two community decks in the middle of the table. All players must race to get three of the same card. Any card that cannot have three same cards, must discard the current card that cannot be matched to the another player's draw pile. Three same cards are worth one point and burrito cards are worth two points. Players are trying to throw burritos to other players if a burrito card is played. If a player gets hit by a burrito, then they lose the battle. If a player catches a burrito, then the person who threw it loses the battle. If a player loses a battle, then they must take one burrito bruise token. Burrito bruise tokens are worth minus one point. The round ends if there are no more burrito bruise tokens left, then the player with the most points gets the Fear Me Badge and if the player with the Fear Me Badge wins the second round, they win the game. If somebody wins the second round while the other player has the Fear Me Badge, then those two player must battle each other in order to tell who is the winner of the game. ==Burrito cards== *Burrito Brawl: The player to your left and right must battle with burritos. *Burrito War: All players except the player who played the card must battle with burritos (The first two that grabbed the burritos must battle). *Burrito Duel: Choose any two players that you want battle with burritos (including yourself). ==Special rules== *If two or more players starts any battle at the same time, then all players must battle with burritos. *If a tie is between two players, they must do the Burrito Duel to tell who is the winner of the round. *If a tie is between three or more players, then reshuffle the deck and flip the top card of the pile until you get a Burrito War card. Then all players must battle to tell who is the winner of the round. ==Similar games== *Throw Throw Avocado: Throw Throw Avocado has the same rules as the burrito version, but burritos are replaced with avocados. ==References== Category:Card games",
 "title": "Throw Throw Burrito"
}