{
 "id": "116584",
 "text": "In geometry, an equilateral triangle is a triangle where all three sides are the same length and all three angles are also the same and are each 60°. If an altitude is drawn, it bisects the side to which it is drawn, in turn leaving two separate 30-60-90 triangles == Other websites == * MathWorld - the construction of an equilateral triangle ==Principal properties== Denoting the common length of the sides of the equilateral triangle as a, we can determine using the Pythagorean theorem that: * The area is A=\\frac{\\sqrt{3}}{4} a^2 * The perimeter is p=3a\\,\\\\! * The radius of the circumscribed circle is R = \\frac{a}{\\sqrt{3}} * The radius of the inscribed circle is r=\\frac{\\sqrt{3}}{6} a or r=\\frac{R}{2} * The geometric center of the triangle is the center of the circumscribed and inscribed circles * And the altitude (height) from any side is h=\\frac{\\sqrt{3}}{2} a. Denoting the radius of the circumscribed circle as R, we can determine using trigonometry that: * The area of the triangle is \\mathrm{A}=\\frac{3\\sqrt{3}}{4}R^2 Many of these quantities have simple relationships to the altitude (\"h\") of each vertex from the opposite side: * The area is A=\\frac{h^2}{\\sqrt{3}} * The height of the center from each side, or apothem, is \\frac{h}{3} * The radius of the circle circumscribing the three vertices is R=\\frac{2h}{3} * The radius of the inscribed circle is r=\\frac{h}{3} In an equilateral triangle, the altitudes, the angle bisectors, the perpendicular bisectors and the medians to each side coincide. ===Equal cevians=== Three kinds of cevians are equal for (and only for) equilateral triangles: * The three altitudes have equal lengths. * The three medians have equal lengths. * The three angle bisectors have equal lengths. ===Coincident triangle centers=== Every triangle center of an equilateral triangle coincides with its centroid, which implies that the equilateral triangle is the only triangle with no Euler line connecting some of the centers. For some pairs of triangle centers, the fact that they coincide is enough to ensure that the triangle is equilateral. In particular: * A triangle is equilateral if any two of the circumcenter, incenter, centroid, or orthocenter coincide. * It is also equilateral if its circumcenter coincides with the Nagel point, or if its incenter coincides with its nine-point center. ===Six triangles formed by partitioning by the medians=== For any triangle, the three medians partition the triangle into six smaller triangles. * A triangle is equilateral if and only if any three of the smaller triangles have either the same perimeter or the same inradius. * A triangle is equilateral if and only if the circumcenters of any three of the smaller triangles have the same distance from the centroid. ===Points in the plane=== * A triangle is equilateral if and only if, for every point P in the plane, with distances p, q, and r to the triangle's sides and distances x, y, and z to its vertices, ::4(p^2+q^2+r^2) \\geq x^2+y^2+z^2. ==References== Category:Polygons",
 "title": "Equilateral triangle"
}