{
 "id": "1165572",
 "text": "The Chivhe Koli, or Chive Koli is a clan of Koli caste found in the Indian state of Maharashtra. Chivhe Kolis were Naiks of Purandar fort served in Maratha Empire of Shivaji. Chivhe Kolis were soldiers, cultivators and Vatandar in Maratha Empire and also in Bidar Sultanate and received the title of Sarnaik from Bidar Badshah. == Rebellion == The Chivhe Kolis of Purandar revolted against the Peshwa government because of the appointing of new Sarnaik named Abhaji Purandare who was a Brahmin by caste. Chivhe Kolis were not in favour of Abhaji Purandare because they were Vatandar and Purandare was controlling their rights on land. Thereupon, Abhaji Purandare dismissed all of them and appointed fresh fortkeepers. After that 400 Chivhe Kolis entered and captured the fort by killing officers and took control of garrison. a duty imposed on the surrounding villages. they brought out their weapons and proceeded to seize control of the fort on 7 May 1764. Five days later they took the fort of Rudramal. Interestingly, they appointed a Brahman, Visaji Kesava to superintend affairs within the fort. They also began to appropriate the state and private property in the fort for safe-keeping. Peshwa Raghunathrao had went to fort to worship the temple but there peshwa was captured by them. Finally, the garrison despatched horsemen and began to collect tribute from adjoining regions. Reproved for this, Kondaji Naik Chivhe wrote to the Peshwa: ‘Then how is the master’s fort to be safeguarded by us on empty stomachs?’; and demanded a years’ pay and pro visions. The infuriated Raghunathrao despatched Maratha troops to punish the insurgents Kolis but Maratha army was unable to enter the fortresses controlled by Chivhe Kolis. Peshwa began seizing the families of the insurgents (Chivhe Kolis), beating and maltreating the women and children, and burning villages.The insurgents were quite aware of the tensions between Raghunathrao and his nephew, and sent a delegation with protestations of loyalty to the camp of Madhavrao, then on the Mysore frontier. Raghunathrao’s attempts for repression also failed to the insurgents, who had ‘taken the tiger- hunters’ oath’, and he now decided to win over the garrison to his side by reinstating them. == References == Category:Koli clans",
 "title": "Chivhe Kolis of Maharashtra"
}