{
 "id": "1165059",
 "text": "Lynn Ban ( May 27, 1972 – January 20, 2025) was a Singaporean-American jewelry designer and reality television personality. She was known for her unique designs. She appeared in Bling Empire: New York, a reality show on Netflix. People who hired Ban to design their jewelry include Rihanna and Beyoncé. Other musical artists who wore her jewelry included Billie Eilish, Cardi B, Doja Cat, Kendrick Lamar, Lady Gaga, Madonna, Megan Thee Stallion, Nicki Minaj, and Post Malone. Vogue called her jewelry collection as \"a favorite of pop icons\" because of its \"unique rebellious and rock-and-roll vibe\". Her designs included ancient armor, beetles, bullets, crosses, handcuffs, razors, thorns, and sickle blades. == Early life == Ban was born in Singapore. She first moved to the United States at the age of four. Her father, David Ban, was a banker at Chase Manhattan Bank. Her mother, Patricia Ban, was a former secretary. She also had a younger sister. Their family moved many times and lived around the world. They returned to Singapore for a short time when Ban was a teenager. Ban said that her mother helped her discover her love for fashion at a young age. They would go on shopping trips to Bloomingdale's and Club 21. She studied art history and literature at New York University. She also studied French literature and art history at Cornell University. She also spent two years at Sorbonne University in Paris. == Career == After graduating, Ban opened a Genki Sushi restaurant in Manhattan with Jett Kain, her future husband, as her business partner in 1998. During this time in the late 1990s, she collected both vintage and contemporary fashion. She sold her restaurant after the September 11 attacks. ===Jewelry and fashion designing=== Ban started her designing career in fashion as a curator for Barneys New York. In 2002, she started Lynn Ban Vintage at Barneys, selling products from Chanel, Valentino, and Yves Saint Laurent. She also did pop-ups of Lynn Ban Vintage in London and Tokyo. In 2011, Lynn Ban created her jewelry company, that shared her name. Her first collection was sold by Barneys, Dover Street Market, Matches Fashion, Maxfield, and Net-a-Porter. Club 21 in Singapore started selling her jewelry pieces in 2012. One of her most well known pieces had the silver Armor ring, worn to look like armour. Another well known piece was her Gash cuff made of black rhodium with diamonds inside to look like a flesh wound. Ban became well known when Rihanna wore a cuff designed by her while performing on American Idol in 2012. Rihanna was seen wearing Ban's jewelry designs many times in her music videos, tours, and in public appearances. Ban was later hired to create jewelry for Rihanna to wear in her W magazine photo shoot in 2016. She designed a claw armor ring that she compared to a weapon. Ban created special-made jewelry for Rihanna's Fenty x Puma collection in 2016. In February 2018, The Adventurine called Fenty x Puma for \"the coolest jewelry\" at New York Fashion Week. Rihanna and Ban became close friends with Rihanna called her as her \"fairy godmother\". In return, Ban called Rihanna an inspiration, saying, \"She's my type: empowered, strong, and dangerous.\" Ban's jewelry was seen in Beyoncé's 2013 album cover, Beyoncé. Other pieces designed by Ban included rings worn in \"Haunted\" and \"Superpower\". Beyoncé wore Ban's rings again in the music videos for the singles \"Formation\" (2016) and \"Spirit\" (2018). Ban released her products of handbags in 2018. One of the first handbags she made was a limited-edition minaudière with gold bullion bar. During the COVID-19 pandemic, she started to make less jewelry for the public and more for private clients. Other musical artists who wore her jewelry included Billie Eilish, Cardi B, Doja Cat, Kendrick Lamar, Lady Gaga, Madonna, Megan Thee Stallion, Nicki Minaj, and Post Malone. ===Bling Empire=== In 2021, television producer Jeff Jenkins wanted Ban to appear in Bling Empire: New York. It was a spin-off of the Netflix hit reality TV series Bling Empire. She agreed to join the cast. At first, she did not want to appear, but then she told Women's Wear Daily that she agreed to appear to \"represent Asian career women\" and to go against the \"stereotype of Crazy Rich Asians\". She filmed for the show between January and March 2022 and recorded everything that Ban did. == Personal life and death == Ban was married to MTV producer Jett Kain. He was her business partner. They had a son. She lived in Tribeca in Manhattan. Ban was in a skiing accident at a resort in Aspen, Colorado on December 24, 2024. She had an emergency craniotomy after a CT scan showed a brain bleed. On December 30, 2024, she shared photos of herself in the hospital on Instagram. She said she had \"face planted\" on a ski slope while wearing a helmet. Ban died on January 20, 2025 in New York City at the age of 51. Her husband found her dead body that afternoon at their home. ==References== ==Other websites== * Official website * Category:1973 births Category:2025 deaths Category:Deaths from surgical complications Category:Singaporean businesspeople Category:Television personalities from New York City Category:Businesspeople from New York City Category:Naturalized citizens of the United States Category:Deaths from intracranial hemorrhage",
 "title": "Lynn Ban"
}