{
 "id": "116557",
 "text": "Louis VI (16 April 1080 — 1 August 1137), nicknamed the Fat (French: le Gros), or the Fighter (French: le Batailleur) was the King of France from 1108 until his death in 1137. He was the second child and the only son of King Philip I of France and his first wife, Bertha of Holland. Louis was a great warrior king. He fought against King Henry I of England at the Battle of Brémule. Even though Louis lost the battle, he was still very active fighting in battles. He would spend most of his 29 year reign fighting and even though in his later years he became very fat and heavy for his horse to carry, he was still active in battles. His got his nickname \"the Fat\" because of how fat he was. But because he was very active in fighting, he also got the nickname, \"the Fighter\". Louis died in 1137 due to dysentery at the age of 57. He was succeeded by his 17-year-old son, Louis VII. Louis was undoubtedly one of France's greatest kings. He became one of the first great, strong, and powerful king of France since Charlemagne. He made France a military power and bought stability to France. The economy grew and that he managed to avoid English domination in France unlike under the reign of his successor, Louis VII where King Henry II of England would dominate over France forming the Angevin Empire. ==Marriages and children== He married in 1104: 1) Lucienne de Rochefort — the marriage was cancelled. *Their child: **1) Isabelle (c.1105 – before 1175), married (ca 1119) William of Vermandois, seigneur of Chaumont He married in 1115: 2) Adélaide de Maurienne (1092–1154) *Their children: **# Philip (1116 – October 13, 1131), King of France (1129–31), not to be confused with his brother of the same name; died from a fall from a horse. **# Louis VII (1120 – November 18, 1180), King of France **# Henry (1121–75), archbishop of Reims **# Hugues (born ca 1122) **# Robert (ca 1123 – October 11, 1188), count of Dreux **# Constance (ca 1124 – August 16, 1176), married first Eustace IV, count of Boulogne and then Raymond V of Toulouse. **# Philip (1125–61), bishop of Paris. not to be confused with his elder brother. **# Peter of France (ca 1125–83), married Elizabeth, lady of Courtenay Category:1081 births Category:1137 deaths Category:Kings of France Category:People from Paris",
 "title": "Louis VI of France"
}