{
 "id": "1165624",
 "text": "is a manga series written and illustrated by Kiyohiko Azuma. It was serialized from February 1999 to May 2002 in the monthly magazine Dengeki Daioh by MediaWorks. Three more chapters were published in Shogakukan's Monthly Shonen Sunday magazine in May 2009 to celebrate the manga's tenth anniversary. The manga was first released in English by ADV Manga. It was later re-issued by Yen Press. ==Premise== Azumanga Daioh follows the daily life of six girls in an unnamed Japanese high school: Child prodigy Chiyo Mihama, who struggles to fit in with her five years older friends; Reserved Sakaki, who has an obsession with cute animals but certain ones seems to hate her; Ayumu \"Osaka\" Kasuga who has a skewed perspective on the world; Koyomi \"Yomi\" Mizuhara, who is irritated by an annoying best friend; Tomo Takino, who's energy is rivaled only by her lack of sense; Sporty Kagura, who has a one-sided rivalry with Sakaki in athletics. The Secondary characters include their class teacher Yukari Tanizaki, her friend Minamo \"Nyamo\" Kurosawa the PE teacher and the creepy classical literature teacher Kimura. ==Production== There is no specific meaning of the title of the series in relation to the story. \"Azumanga\" combines the author's last name, \" Azuma\", and \"manga\". \"Daioh\" is derived from the magazine where the manga first appeared, Dengeki Daioh. \"Azumanga\" is also used to refer to other comics and illustrations of Kiyohiko Azuma., a commentary by Hideki Satomi contained in Azumanga Recycle. Two previous collections of Azuma's works, including official tie-in comics for Pioneer animations, were published as Azumanga in 1998 and Azumanga 2 in 2001. Azumanga Daioh was later re-released in a smaller edition called Azumanga Recycle. ==Media== ===Manga=== Azumanga Daioh was created by Kiyohiko Azuma, primarily in a four-panel (yonkoma) format. It was serialized by MediaWorks in the monthly magazine Dengeki Daioh from February 1999 to May 2002, with the unnumbered chapters later compiled into four tankōbon volumes. Each volume covers approximately one year in the lives of the characters. To celebrate the manga's 10th anniversary, Shogakukan released a new edition consisting of three volumes. The first volume, which details the characters' first year of high school, was published on June 11, 2009. This reprint also includes three additional 16-page chapters that were serialized in Monthly Shōnen Sunday starting in May 2009, titled Azumanga Daioh: Supplementary Lessons (あずまんが大王·補習編, Azumanga Daiō Hoshūhen) ===Anime=== The animated series, Azumanga Daioh: the Animation, was produced by J.C.Staff and broadcasted from April 8, 2002 to September 30, 2002. The series was broadcast on TV Tokyo, TV Aichi, TV Osaka, and AT-X, and every weekend it was shown in five-minute segments, then repeated on the weekend as a 25-minute compilation. In total, 130 five-minute segments were collected in 26 episodes. The compilation episodes used the opening and ending themes and \"Raspberry Heaven\", performed by Oranges & Lemons. These were the only episodes to show the title and credits. They came out on 6 DVDs in 2003 and 9 Universal Media Discs from 2005 to 2006, published by Starchild Records. A complete DVD box set of all the episodes was released on June 24, 2009. (Note Google translate API) ===Video Games=== Three video games based on Azumanga Daioh were made: * Azumanga Donjyara Daioh, a puzzle game like mahjong, was released by Bandai for PlayStation on April 18, 2002. * A crossover game with Puzzle Bobble, called Azumanga Daioh Puzzle Bobble, developed by Moss and published by Taito. It was only released in Japan for arcade machines on December 13, 2002. * Azumanga Daioh Advance, a card-playing game for the Game Boy Advance was released on April 25, 2003. ===Art Books=== Two art books for the anime were released named () and (). They came out on August 26, 2002, and December 10, 2002, published by MediaWorks. ==Reception== Both the manga and anime have received praise for their humor, which stems from their eccentric characters. Azuma is recognized as a \"master of the four-panel form\" for his art style and comic timing. In 2002, the Azumanga Daioh manga was awarded a jury recommendation at the sixth Japan Media Arts Festival. In 2006, it was recognized as one of the top 25 manga at the 2006 Japan Media Arts festival. == References == Category:Anime series based on manga",
 "title": "Azumanga Daioh"
}