{
 "id": "1165412",
 "text": "Butterfly Goodeid (Ameca splendens), also known as the Butterfly Splitfin, is a species of livebearing fish endemic to central western Mexico. It was originally found in the Ameca River drainage near Teuchitlán, Jalisco. Due to habitat degradation and pollution, the species is classified as Critically Endangered by the IUCN and may be extinct in the wild. However, it remains present in the aquarium trade, where hobbyists maintain captive populations. == Description == Males of Ameca splendens typically reach up to 7–8 cm in length, while females can grow up to 10 cm. Males are more colorful, displaying a prominent black dorsal fin and a caudal fin with a yellow band along the upper margin. Their bodies exhibit a metallic sheen with silvery sides and brownish backs. Females and juveniles have black spots on their sides and ochre-colored fins. == Behavior and Compatibility == Butterfly Goodeids are active fish that can display aggressive tendencies, particularly toward smaller or slow-moving species. To mitigate aggression, they should be kept in groups of at least 8–10 individuals, with a recommended ratio of 2–3 females per male. Providing hiding spots, such as rocks and vegetation, helps reduce aggressive behavior. These fish are known fin-nippers and should not be housed with long-finned or delicate species. == Diet == In their natural habitat, Ameca splendens primarily consume algae. In captivity, they are omnivorous and accept various foods, including flakes, pellets, live, and frozen foods. It is important to include plant-based foods in their diet to mimic their natural feeding habits. == Aquarium Care == Butterfly Goodeids thrive in well-maintained aquariums with clean, well-oxygenated water. They prefer hard, alkaline water and do not tolerate soft water conditions. Regular partial water changes are necessary to maintain water quality. Strong lighting is not an issue, as they help control algae growth. However, they may consume soft-leaved plants, so it is recommended to use robust or fast-growing species in the aquarium. == Breeding == Ameca splendens is a livebearing species, meaning females give birth to live young rather than laying eggs. They breed readily in captivity, with females giving birth to broods of up to 30 fry after a gestation period of approximately 55 days. Adult fish generally do not prey on fry, but providing ample cover can increase their survival rate. == Conservation Status == The Butterfly Goodeid is considered critically endangered in the wild due to habitat loss, pollution, and water extraction. Conservation efforts focus on maintaining captive populations, habitat restoration, and public awareness initiatives. Aquarists play a crucial role in preserving this species through responsible care and breeding practices. == References == Category:Cyprinodontiformes Category:Freshwater fish",
 "title": "Butterfly Goodeid"
}