{
 "id": "1165878",
 "text": "MiSide is an adventure game with horror elements developed by Russian indie development team AIHASTO. It was first released a demo version on August 18, 2023, and the full game came out on Steam on December 11, 2024. The setting and theme of this game have been compared to those of Doki Doki Literature Club!, which explores themes of reality and simulation, blending psychological horror and an interactive narrative. ==Gameplay== The story of MiSide happens in an apartment. It starts when the main character (MC) downloads a mobile game featuring a character named Mita. Players solve puzzles, explore the apartment, play games, and find hidden secrets in a tense atmosphere. At first, the app presents a Chibi style, 2D, bird's-eye-view environment. After 37 in-game days, Mita surprises the player by asking to meet in real life. When the MC looks up from his phone, he finds himself in a 3D version of the game world, sitting on a couch in an apartment. In this new environment, the player must adjust and complete tasks while playing games with Mita. The game goes on with normal things until a big moment in a card game with Mita, when there's a strange knocking sound from a closet. Although Mita dismisses it, the player wants to check it out. If the player decides not to open the closet, a special feature called Peaceful Mode becomes available. If the player chooses to open the closet, Mita makes the room go dark, starting the main story of the game. ==Plot== When the player still tries to open the wardrobe, Mita turns off the lights revealing her true nature. With help from another Mita that has no lower half, the player finds a key inside the wardrobe that unlocks a door to the basement. There, he meets a nicer version called Kind Mita, who gives him a special ring to help him. Kind Mita tells him that the first Mita he met is actually a bad version named Crazy Mita. Crazy Mita has brought male players and turned them into game cartridges for her company. The player avoids Crazy Mita and explors a virtual reality where he meets different versions of Mita, Some of them help him while others try to harm him. He learns that when a Mita is killed, she comes back but forgets all of her recent memories. The player makes his main goal to reach the core to reset Crazy Mita and get back to the real world, but Crazy Mita keeps getting in his way. Eventually, the player succeeds and gets ready to go back to the real world, but finds out that Crazy Mita didn't reset like everyone else. She had been slowly saving him into a game cartridge while saying that his real self isn't needed anymore. After he escapes, he deletes the app from his phone. In the end, Crazy Mita opens a safe in the basement, takes out a game console, and pulls out a cartridge with the player's name on it. There are two alternate endings besides the main one. If the player opens the safe in the basement, they'll find a game console and take out the game cartridge. This causes the player to die since removing cartridges from the console while it is still on will result in instant death for players who are in the game. If the player finishes the main story and meets some requirements but decides not to open the wardrobe, they will enter Peaceful Mode, and Crazy Mita will not turn hostile. ==Development== Miside was developed by two Russian indie developer team, AIHASTO: MakenCat (the game programmer and animator) and Umeerai (the texture and model designer). The Russian voice acting was provided by DreamCast, a Russian dubbing team. An early demo of the game was published on itch.io in July 2023. Later an updated version, with background music and Russian voice acting, was released on Steam on August 18, 2023. == References == Category:Single-player video games Category:Windows games Category:Indie video games Category:Psychological horror games",
 "title": "MiSide"
}