{
 "id": "1165511",
 "text": "The 2026 FIA Formula One World Championship is a planned motor racing championship for Formula One cars which will be the 77th running of the Formula One World Championship. It is recognised by the Fédération Internationale de l'Automobile (FIA), the governing body of international motorsport, as the highest class of competition for open-wheel racing cars. The championship will be contested over twenty-four Grands Prix held around the world. Drivers and teams are scheduled to compete for the titles of World Drivers' Champion and World Constructors' Champion respectively. == Entries == The following constructors and drivers are under contract to compete in the 2026 World Championship. All teams are due to compete with tyres supplied by Pirelli. Each team is required to enter at least two drivers, one for each of the two mandatory cars. Entrant Constructor Power unit Race drivers No. Driver name BWT Alpine Formula 1 Team Alpine-Mercedes Mercedes 10 Pierre Gasly TBC TBA Aston Martin Aramco Honda Aston Martin Aramco-Honda Honda 14 Fernando Alonso 18 Lance Stroll Audi F1 Team Audi Audi 5 Gabriel Bortoleto 27 Nico Hülkenberg Cadillac Formula 1 Team Cadillac-Ferrari Ferrari TBC TBA TBC TBA Scuderia Ferrari HP Ferrari Ferrari 16 Charles Leclerc Scuderia Ferrari HP 44 Lewis Hamilton MoneyGram Haas F1 Team Haas-Ferrari Ferrari 31 Esteban Ocon 87 Oliver Bearman McLaren Formula 1 Team McLaren-Mercedes Mercedes 4 Lando Norris 81 Oscar Piastri Mercedes-AMG Petronas F1 Team Mercedes Mercedes 12 Andrea Kimi Antonelli Mercedes-AMG Petronas F1 Team 63 George Russell Visa Cash App Racing Bulls F1 Team Racing Bulls-Red Bull Ford Red Bull Ford TBC TBA TBC Racing Bulls-Red Bull Ford TBA Oracle Red Bull Racing Red Bull Racing-Red Bull Ford Red Bull Ford 22 Yuki Tsunoda 33 Max Verstappen Atlassian Williams Racing Williams-Mercedes Mercedes 23 Alex Albon 55 Carlos Sainz Jr. == References == Category:Formula One seasons Category:2026 in sports Category:2020s in motorsport",
 "title": "2026 Formula One World Championship"
}