{
 "id": "1165325",
 "text": "Colin Blackwell (born March 28, 1993) is an American professional ice hockey center. He currently plays for the Dallas Stars of the National Hockey League (NHL). He has also played for the Nashville Predators, New York Rangers, Seattle Kraken, Toronto Maple Leafs, and Chicago Blackhawks. ==Career== Before playing in the NHL, Blackwell played parts of 4 years with the Harvard Crimson of the National Collegiate Athletic Association (NCAA). He helped the Crimson win the ECAC Tournament Championship. He was drafted 194th overall by the San Jose Sharks in the 2011 NHL Entry Draft. He only played for their AHL- affiliate San Jose Barracuda. On November 2, 2017, Blackwell signed a contract with the Rochester Americans. On July 3, 2018, Blackwell signed a two-year, two-way contract with the Nashville Predators. On January 19, 2019, Blackwell made his NHL debut in a 4-2 loss against the Florida Panthers. On December 23, Blackwell recorded his first point in the NHL, assisting on a Roman Josi goal in a 3-2 win against the Arizona Coyotes. On January 9, 2020, Blackwell scored his first NHL goal in a 5-2 win against the Chicago Blackhawks. On October 9, 2020, Blackwell signed a $725,000; two-year contract with the New York Rangers. During the 2021 NHL Expansion Draft, the newly formed Seattle Kraken selected Blackwell. He played 39 games with them. On March 20, 2022, the Kraken traded Blackwell along with Mark Giordano to the Toronto Maple Leafs in exchange for a second and third-round pick. Blackwell scored one goal and two points in the playoffs during the First Round but the Leafs eventually lost to the Tampa Bay Lightning. On July 13, Blackwell signed a two-year, $2.4 million contract with the Chicago Blackhawks. The Blackhawks named Blackwell as their nominee for the Bill Masterton Memorial Trophy. On July 2, 2024, Blackwell signed a one-year, $775,000 contract with the Dallas Stars. ==References== == Other websites == * Category:1993 births Category:Living people Category:American ice hockey centers Category:Chicago Blackhawks players Category:Dallas Stars players Category:Harvard University alumni Category:Milwaukee Admirals players Category:Nashville Predators players Category:New York Rangers players Category:People from Lawrence, Massachusetts Category:Rochester Americans players Category:San Jose Barracuda players Category:Seattle Kraken players Category:Toronto Maple Leafs players",
 "title": "Colin Blackwell"
}