{
 "id": "1165480",
 "text": "Yashwantrao Martandrao Mukne (also known as Patangshahji Mukne) (V) (Dada Saheb) (11 December 1917 - 4 June 1978) was a Koli Maharaja of Jawhar State, a flight lieutenant in the Royal Indian Air Force, politician, social worker and a former Member of Parliament from Bhiwandi for the 3rd Lok Sabha and Dahanu for the 4th Lok Sabha as a member of the Indian National Congress. Maharaja Mukne supported the revolutionaries directly or indirectly against British Rule in India. He established a factory to manufacture pistols and other firearms in Nepal Kingdom in 1907. In 1970, Yashwantraoji Mukne published a book written by him about his family and forefathers named Jayaba. == History == Maharaja Mukne's father, Vikramshah Pantangshah, was Koli Raja of Jawhar, a princely state in the Thane district of what was then Bombay Presidency. A benevolent ruler who served in World War I and was granted a nine-gun salute, he died at the age of 42, around 1928, having succeeded his father as ruler in 1917. He had a son and a daughter, the former of whom succeeded him. Yashwantrao Martandrao Mukne was too young to assume control at the time of his accession, so his mother, Rajmata Saguna Bai Mukne, acted as regent. When he came of age in 1938, he assumed full ruling powers. He did good works such as by expanding development activities, encouraging the chemical, paper, textile, dyeing and printing liquor and starch industries. He provided free primary education and medical relief, He ran both middle and high schools, a central library and museum, hospital and maternity home. He provided touring dispensaries for rural areas of state. At the outbreak of World War II, He volunteered for services and served as Flight lieutenant for four years in Royal Indian Air Force. Jawhar State acceded to the newly independent India in 1947, after which Mukne was no longer ruler and entered politics. As a member of the Indian National Congress, he was elected to the 1st Lok Sabha from the Thane, which was a seat reserved for candidates from the Scheduled Tribes. He was subsequently elected to the 3rd Lok Sabha from Bhiwandi and to the 4th Lok Sabha from Dahanu, which was also a reserved constituency. ==Education== Born on 11 December 1917, Mukne was educated at Rajkumar College, Rajkot, and at Old Blundell's School and the Middle Temple in England. He was married to Her Highness Priyamvada Raje, a princess of Jath State, and had one son and two daughters. He lived at Jai Vilas Palace, Jawhar, in Thane district. == Gallery == ==References== Category:1917 births Category:1978 deaths Category:People from Maharashtra Category:Indian Hindus",
 "title": "Yashwantrao Mukne of Jawhar State"
}