{
 "id": "1165056",
 "text": "Taco Cat Goat Cheese Pizza (also known as TCGCP) is a card game made by Dolphin Hat Games. It was released in 2017 and it became more popular during the COVID-19 pandemic. ==How to play== The dealer gives all the cards evenly and cards are put face down and they are not allowed to look at their cards. The first player flips their card away from themselves and puts on a discard pile and they say the word \"Taco\". The second player does the same but they say the word \"Cat\". The third player says the word \"Goat\", the fourth player says \"Cheese\" and the fifth says \"Pizza\", then those words repeat until there is a match (when a player says \"Cat\" while they discard a card that says \"Cat\") or a special card is played. When player gets a match, all players must slap the discard pile and the last player to slap must take all the discard pile cards and adds the cards to the bottom of their card pile. If a player looks through their cards during the game, flips their card the wrong way (toward themselves), says the wrong word (the next player says Taco while the word is Goat), forgetting the current word to say (if the current player says Cheese but the next player forgets the word), not noticing it is their turn, mistakenly slaps at the wrong time or about to slap mistakenly, then the player who did it must collect all the cards from the discard pile to their card pile. If a player runs out of cards, that player still says the current word without flipping the cards until there is a match or a special card played. The goal of the game is to get rid all of the cards in their and correctly slap the match or special card on the discard pile. ===Special cards=== If a player flips a special card, all players must do the correct action then slap the discard pile or else the last player to slap must take all the cards (including the special card) from the discard pile and add them to the bottom of their draw pile. *Groundhog: All players knocks on the table with both hands. *Gorilla: All players beat their chest. *Narwhal: All players put their hands together above their head. Category:Card games",
 "title": "Taco Cat Goat Cheese Pizza"
}