{
 "id": "1165240",
 "text": "Amalric (French: Amaury; circa 1130 – July 11, 1174) or known as Amalric I, was a King of Jerusalem from 1163 until his death in 1174. He is notable for his role in the Kingdom of Jerusalem, said to be one of the bravest crusader kings by muslim opponents. == Early Life == Amalric was born around 1130, the son of Fulk of Jerusalem and Melisende, the heiress of the Kingdom of Jerusalem. Fulk, a former Count of Anjou, became King of Jerusalem in 1131, while Melisende was the daughter of Baldwin II, King of Jerusalem. After his father’s death, Amalric's mother, Melisende, at first served as co-ruler with him, but political struggles between them would mark his early reign. == King of Jerusalem == Amalric became King of Jerusalem in 1163 after the death of his father. His reign was defined by both military engagements and attempts at consolidating control over the diverse factions within the kingdom. One of the key events during his early reign was his marital alliance with Agnes of Courtenay, which helped to solidify his political position in the kingdom. === Military Campaigns and Expansion === Amalric sought to maintain and expand the Crusader territories in the Holy Land. His most notable military activity was his campaigns against the Zengid dynasty and the Fatimids in Egypt. In 1167, Amalric launched an expedition against Egypt, attempting to gain control of the region, a key strategic goal for the Crusader states. Although he initially captured the city of Damietta, the campaign ultimately failed as Amalric was forced to withdraw due to logistical challenges and local resistance. In addition to his efforts in Egypt, Amalric also participated in several skirmishes and confrontations with the forces of the Muslim leader Nur ad-Din, including defending Jerusalem from various military threats. Despite these challenges, Amalric managed to maintain the stability of the Crusader Kingdom of Jerusalem for much of his reign. === Internal Struggles and Politics === Amalric’s reign was marked by internal tensions, particularly with the noble families of the kingdom. The relationship between the monarchy and the barons was often contentious, and Amalric struggled to balance the competing interests of the various factions. His attempts to strengthen royal authority were met with resistance, especially from the powerful House of Ibelin and other influential families. Amalric's foreign policy was also impacted by the complicated relationships with the neighboring Christian and Muslim states. His marriage to Agnes of Courtenay, although politically advantageous, was marred by family disputes. Eventually, Amalric divorced Agnes in 1170 and remarried Agnes of the Byzantine Empire, though this union did not have a lasting impact on the politics of Jerusalem. === Death and Legacy === Amalric died unexpectedly in 1174, leaving behind a kingdom facing significant challenges. His death led to the ascension of his son Baldwin IV, who was only a young child at the time. Baldwin IV’s reign was complicated by his early struggles with leprosy and the growing military threat from the Muslim forces under Saladin, the famous Sultan of Egypt and Syria. Despite these challenges, Baldwin IV would go on to lead the Kingdom of Jerusalem through some of its most crucial battles, including the Battle of Montgisard in 1177. Amalric’s legacy is marked by his attempts to maintain the Crusader presence in the Holy Land despite significant internal and external pressures. His reign exemplified the military and political challenges facing the Kingdom of Jerusalem during the 12th century, as Crusader states struggled to survive in a region increasingly dominated by Muslim powers. == Notes == == References == * \"The Crusader Kingdom of Jerusalem\" by Joshua Prawer * The History of the Crusades by Steven Runciman * The Kingdom of Jerusalem and the Crusaders by Michael Angold Category:1130s births Category:1174 deaths Category:Kings and queens",
 "title": "Amalric of Jerusalem"
}