{
 "id": "116558",
 "text": "Louis VII ( 1120 — 18 September 1180) nicknamed the Young or the Younger (French: le Jeune) was the King of France from 1137 until his death in 1180. He was the second son of King Louis VI of France and his second wife, Adélaide de Maurienne. As the second son, he was never expected to become king. However, in 1131, Louis' older brother Philip died, Louis became the Dauphin of France. After his father's death in 1137, the 17-year-old prince became king. Shortly after his accession, he married the 15-year-old, Eleanor of Aquitaine who would become one of the most wealthiest and mosf powerful woman in Medival Europe. He was crowned on Christmas day in 1137. He was a successful king like his father. He fought in the Second Crusade in 1147 in attempt to take Jerusalem from the Muslims. However, he was defeated. In 1152, his marraige with Eleanor of Aquitaine ended as Eleanor grew tired of Louis' Crusade. She then got remarried to the 19-year-old Henry, Duke of Normandy the future King Henry II of England. After Henry became the King of England, Henry's kingdom dominated over France forming the Angevin Empire. Because of the English domination over France and losing battles in the Second Crusade, Louis was proved to be a weak king. However, despite all of this, Louis was still a good king. Because during his reign, the Notre-Dame de Paris was built. Also he strengthened the authority of the royal court, went on the Second Crusade despite losing, and repelled the aggressions of King Henry II of England. He was undoubtedly one of France's greatest kings just like his father, King Louis VI. He died on 18 September 1180 in Paris and was buried the next day at Barbeau Abbey. His remains were moved to the Basilica of Saint-Denis in 1817 by his descendant Louis XVIII. ==Ancestors== Louis VII of France Father: Louis VI of France Paternal Grandfather: Philip I of France Paternal Great-grandfather: Henry I of France Paternal Great-grandmother: Anne of Kiev Paternal Grandmother: Bertha of Holland Paternal Great-grandfather: Floris I, Count of Holland Paternal Great-grandmother: Gertrude of Saxony Mother: Adelaide of Maurienne Maternal Grandfather: Humbert II of Savoy Maternal Great-grandfather: Amadeus II of Savoy Maternal Great-grandmother: Joan of Geneva Maternal Grandmother: Gisela of Burgundy Maternal Great-grandfather: William I, Count of Burgundy Maternal Great-grandmother: Stephanie ==Marriages and Children== Louis married three times. By Eleanor of Aquitaine, he had: *Marie, married Henry I of Champagne *Alix, married Theobald V of Blois By Constance of Castile: *Marguerite of France (1158–97), married (1) Henry the Young King; (2) King Béla III of Hungary (1172–96) *Alys (4 October 1160 – c. 1220), engaged to Richard I of England; she married William III Talvas, Count of Ponthieu By Adele of Champagne: *Philip II Augustus (August 22, 1165 – 1223) *Agnes of France (1171–1240), who was betrothed to Alexius II Comnenus (1180–83) but married (1) Andronicus I Comnenus (1183–85); (2) Theodore Branas (1204) Category:Kings of France Category:1120 births Category:1180 deaths",
 "title": "Louis VII of France"
}