{
 "id": "1165978",
 "text": "CBA was one of the most significant Hungarian retail chains, its main profile being the sale of food and simple household goods. It currently has stores in Hungary, Poland, Slovakia, Bulgaria, the Czech Republic, Croatia and Romania. == History == ===Hungary=== CBA was founded in 1992 in Hungary when 10 businessmen joined together to buy a network of grocery stores. Initially starting with 17 stores, it expanded to become one of the largest supermarket chains in Hungary, growing through franchising and acquisitions. By 2005, CBA had shifted to a franchise system and opened its first logistics center in Alsónémedi. It operates its units with larger floor space, higher quality appearance and higher-level offerings under the name Príma.Bucsky Péter - A CBA nevet hanyagolva hasít az egyik CBA-vezető cége (G7, 2018.10.17.) ===Romania=== The Romanian CBA began in 2002 when the Hungarian CBA registered its local subsidiary in Romania. It started with 150 franchise stores and became a market leader in the northwest part of Romania. The network expanded through franchise agreements, focusing on regions mainly in Transylvania. ===Slovakia=== CBA Slovakia was established in 2003 by Marián Šufliarsky under a franchise agreement with the Hungarian CBA, allowing it to use the same logo and branding. It started as a chain of supermarkets focusing on smaller convenience stores, mainly in rural areas and smaller towns in western and central Slovakia. By 2018, CBA Slovakia was acquired by the Polish private equity firm Enterprise Investors, aiming to modernize and expand the chain's operations, but it kept the CBA brand for market recognition. ===Czech Republic=== The Czech CBA, known as Družstvo CBA CZ, was established in 2005 when members of the cooperative, especially representatives of MO Partner a.s., signed a Master Franchise Agreement with CBA International from Hungary. This allowed them to use the CBA logo and branding in the Czech Republic, focusing on modernizing and strengthening the position of independent retailers within a franchise system. The cooperative's aim is to foster a community of competitive and modern independent retailers under the CBA brand. ===Croatia=== The Croatian CBA, known as NTL (Narodni Trgovački Lanac), was formed through a merger of the hungarian CBA International and the croatian NTL Group in the early 2000s. This merger created a significant retail chain in Croatia, combining the strengths of both groups to offer a wide network of stores under the unified CBA and NTL branding. The collaboration aimed to enhance their market position by reducing procurement costs and improving the competitiveness of their retail offerings. ===Bulgaria=== The Bulgarian CBA was established on June 23, 2003, founded by 25 retail chains with 86 outlets across the country. The partnership with CBA International from Hungary enabled the use of the CBA brand and logo, aiming to expand the network of supermarkets and convenience stores in Bulgaria through a franchise model. ===Poland=== The \"Nasz Sklep\" (which means \"Our Shop\" in Polish), was formed in 2000 when CBA International partnered with local Polish retailers. The name \"Nasz Sklep\" was chosen to resonate with Polish consumers, providing a sense of local ownership and familiarity. ==References== == Other websites == * CBA Hungary * CBA Slovakia * CBA Romania * CBA Czech Republic * CBA Bulgaria * NTL Croatia * Nasz Sklep Poland Category:Supermarkets of Hungary",
 "title": "CBA (supermarket)"
}