{
 "id": "116561",
 "text": "One of the most amazing architecture made during the Renaissance was built in Italy by a man called Filippo Brunelleschi. Brunelleschi made the Santa Maria del Fiore cathedral in Florence, Italy. It took him 16 years to create and used mainly only two materials, marble and brick. The cathedral started its construction on 9 September 1296. Many experts do not understand the logic of how it was built. But what we do know is that Brunelleschi invented many new techniques to produce such an amazing cathedral. The Basilica di Santa Maria del Fiore or Florence Cathedral is the cathedral church of Florence, Italy. The basilica was designed by Arnolfo di Cambio with the dome by Filippo Brunelleschi. The bell tower was designed by Giotto. The outside is decorated with marble panels in green and pink bordered by white. The building was begun in 1296 and was finished in 1469, except for the decoration. The facade (the main front) was decorated between 1876 and 1903. The dome, which is built of bricks with stone ribs, is one of the biggest in the world. ==Statues== From about 1464 the members of the Wool Guild wanted to have twelve statues of people from the Old Testament of the Bible carved for the Florence Cathedral. These statues were to go on the buttresses all around the outside walls, high up near the roof. *Joshua in terracotta by Donatello 1410 *Hercules in terracotta by Agostino di Duccio 1463 *David In marble. This is the statue of David by Michelangelo 1501-1504. On 12 November 2010, a fiberglass replica of the David was installed on the roofline of Florence Cathedral, for one day only. Photographs of the installation reveal the statue the way the Operai who commissioned the work originally expected it to be seen. Image:'David' by Michelangelo Fir JBU002.jpg|Original David by Michelangelo File:David sullo sperone del duomo di firenze 04.JPG|Fiberglass replica of David at Florence cathedral seen from the north ==References== == Other websites == * L'Opera del Duomo, Firenze * * * *Rick Edmondson's Unfinished Buildings Category:Roman Catholic cathedrals Category:Cathedrals in Italy Category:Buildings and structures in Florence Category:1290s establishments Category:13th-century buildings and structures",
 "title": "Florence Cathedral"
}