{
 "id": "1165682",
 "text": "This is the discography of American musician Kid Cudi. ==Albums== ===Studio albums=== List of studio albums, with selected chart positions and certifications Title Album details Peak chart positions Sales Certifications US US R&B; US Rap AUS Peak chart positions for albums in Australia: *Man on the Moon: The End of Day: *Man on the Moon II: The Legend of Mr. Rager: *Indicud: *Satellite Flight: The Journey to Mother Moon: *Passion, Pain & Demon Slayin: *Entergalactic: CAN FRA GER SWI UK Peak chart positions for albums in the United Kingdom: * All except noted: * Man on the Moon: The End of Day: UK R&B; Peak chart positions for albums on the UK R&B; Albums Chart in the United Kingdom: *Man on the Moon: The End of Day: *Man on the Moon II: The Legend of Mr. Rager: *Indicud: *Man on the Moon III: The Chosen: Man on the Moon: The End of Day * Released: September 15, 2009 * Label: Dream On, GOOD, Universal Motown * Formats: CD, LP, digital download 4 5 4 85 11 56 90 56 119 8 * US: 835,025 * RIAA: 4× Platinum * BPI: Silver Man on the Moon II: The Legend of Mr. Rager * Released: November 9, 2010 * Label: Dream On, GOOD, Universal Motown * Formats: CD, LP, digital download 3 1 1 65 5 77 64 36 88 12 * US: 353,000 * RIAA: Platinum Indicud * Released: April 16, 2013 * Label: Wicked Awesome, GOOD, Republic * Formats: CD, LP, digital download 2 1 1 28 3 57 99 46 32 2 * US: 280,000 * RIAA: Gold Satellite Flight: The Journey to Mother Moon * Released: February 25, 2014 * Label: Wicked Awesome, Republic * Formats: LP, digital download 4 2 2 55 7 115 — — 67 9 * US: 125,000 Speedin' Bullet 2 Heaven * Released: December 4, 2015 * Label: Wicked Awesome, Republic * Formats: Cassette, CD, digital download 36 — — — — — — — — — * US: 30,000 Passion, Pain & Demon Slayin' * Released: December 16, 2016 * Label: Wicked Awesome, Republic * Format: CD, LP, digital download, streaming 11 5 4 88 24 119 — — — 24 * US: 49,000 Man on the Moon III: The Chosen * Released: December 11, 2020 * Label: Wicked Awesome, Republic * Format: CD, LP, digital download, streaming 2 1 1 25 2 42 — 18 26 22 Entergalactic * Released: September 30, 2022 * Label: Wicked Awesome, Republic * Format: CD, LP, digital download, streaming 13 7 — 94 20 73 — 38 95 — Insano * Released: January 12, 2024 * Label: Wicked Awesome, Republic * Format: CD, LP, digital download, streaming 13 5 4 — 24 37 29 8 77 — Insano (Nitro Mega) * Released: February 23, 2024 * Label: Wicked Awesome, Republic * Format: CD, LP, digital download, streaming — — — — — — — — — — \"—\" denotes a recording that did not chart or was not released in that territory. ===Collaborative albums=== List of collaborative studio albums, with selected chart positions Title Album details Peak chart positions Sales Certifications US US R&B; AUS CAN NZ UK UK R&B; WZRD * Released: February 28, 2012 * Label: Wicked Awesome, GOOD, Universal Republic * Format: CD, LP, digital download 3 — — 9 — — — * US: 100,000 Kids See Ghosts * Released: June 8, 2018 * Label: Wicked Awesome, GOOD, Def Jam * Format: CD, LP, digital download, streaming 2 1 4 3 3 7 2 * US: 142,000 * RIAA: Gold * BPI: Silver ===Compilation albums=== List of compilations with selected details Title Album details Peak chart positions US US R&B; CAN The Boy Who Flew to the Moon, Vol. 1 * Released: July 8, 2022 (US) * Label: Wicked Awesome, Republic * Format: CD, LP, digital download, streaming 83 36 51 ===Box sets=== List of box sets with selected details Title Box set details Man on the Moon: Trilogy * Released: November 4, 2022 (US) * Label: Wicked Awesome, Republic * Format: 6xLP ==EPs== List of extended plays with selected details Title EP details Day 'n' Nite * Released: February 12, 2008 (US) * Label: Fool's Gold * Format: CD, LP, digital download Pursuit of Happiness * Released: February 7, 2010 (UK) * Label: Island, Dream On, GOOD, Universal Motown * Format: CD, LP, digital download Prime Day Show x Kid Cudi * Released: June 17, 2021 (US) * Label: Wicked Awesome, Republic * Format: Digital download, streaming ==Mixtapes== List of mixtapes with selected details Title Mixtape details A Kid Named Cudi * Released: July 17, 2008 (US) * Label: 10.Deep, Fool's Gold * Format: CD, LP, digital download ==Singles== ===As lead artist=== List of singles as lead artist, with selected chart positions and certifications, showing year released and album name Title Year Peak chart positions Certifications Album US US R&B;/HH US Rap AUS Peak chart positions for singles in Australia: *All except \"Make Her Say\": *\"Make Her Say\": *\"Surfin'\": *\"The Adventures of Moon Man & Slim Shady\": *\"Stop Trying to Be God\": CAN FRA GER NZ SWE UK Peak chart positions for singles in the United Kingdom: *\"Day 'n' Nite\" and \"Make Her Say\": *\"Pursuit of Happiness\" and \"Erase Me\": \"Day 'n' Nite\" 2008 3 5 — 15 10 8 13 11 31 2 * RIAA: Diamond * ARIA: Gold * BPI: 2× Platinum * BVMI: 3× Gold * RMNZ: Gold Man on the Moon: The End of Day \"Make Her Say\" (featuring Kanye West and Common) 2009 43 39 11 62 78 — 85 35 — 67 * RIAA: Platinum \"Pursuit of Happiness\" (featuring MGMT and Ratatat) 2010 59 — — 41 76 2 51 — 39 64 * RIAA: Diamond * ARIA: Platinum * BPI: Platinum * BVMI: Gold \"We Are the World 25 for Haiti\" 2 — — 18 7 — — 8 5 50 \"Erase Me\" (featuring Kanye West) 22 — — 50 12 — — 22 53 58 * RIAA: 2× Platinum Man on the Moon II: The Legend of Mr. Rager \"Mr. Rager\" 77 — — — — — — — — — * BPI: Silver \"No One Believes Me\" 2011 — — — — — — — — — — Fright Night: Music from and Inspired by the Motion Picture \"Just What I Am\" (featuring King Chip) 2012 74 17 13 32 — 189 — — — — * RIAA: 2× Platinum Indicud \"King Wizard\" 91 28 24 — — — — — — — \"Immortal\" 2013 — 48 — — — — — — — — \"Girls\" (featuring Too Short) — 37 — — — — — — — — \"Confused!\" 2015 — — — — — — — — — — Speedin' Bullet 2 Heaven \"Speedin' Bullet 2 Heaven\" — — — — — — — — — — \"Frequency\" 2016 — — — — — — — — — — Passion, Pain & Demon Slayin' \"Surfin'\" — — — 77 — — — — — — \"Leader of the Delinquents\" 2020 — — — — — — — — — — rowspan=\"3\" \"The Scotts\" (with Travis Scott as The Scotts) 1 1 1 4 1 2 8 2 8 11 * RIAA: 3× Platinum * ARIA: Gold * BPI: Silver * MC: 2× Platinum * RMNZ: Gold \"The Adventures of Moon Man & Slim Shady\" 22 15 13 90 20 — — — — 44 \"Want It Bad\" 2022 — — — — — — — — — — I Know Nigo \"Stars in the Sky\" — — — — — — — — — — Sonic the Hedgehog 2 (Music from the Motion Picture) \"Do What I Want\" — — — — — — — — — — Entergalactic \"Talk About Me\" (with Dot da Genius, Denzel Curry and JID) — — — — — — — — — — \"Willing to Trust\" — — — — — — — — — — Entergalactic \"Porsche Topless\" 2023 — — — — — — — — — — Insano \"Guitar in My Room\" — — — — — — — — — — All Is Yellow \"Heaven's Galaxy\" — — — — — — — — — — \"At the Party\" — 47 — — — — — — — — Insano \"—\" denotes a recording that did not chart or was not released in that territory. ===As featured artist=== List of singles as featured artist, with selected chart positions and certifications, showing year released and album name Title Year Peak chart positions Certifications Album US For \"All of the Lights\": US R&B; US Rap AUS CAN For \"All of the Lights\": FRA GER NZ SWE UK Peak chart positions for guest appearances in the United Kingdom: *\"Welcome to the World\": *\"Memories\": *\"All of the Lights\": \"Welcome to the World\" (Kevin Rudolf featuring Kid Cudi) 2009 58 — — 42 56 — — — — 77 In the City \"Rollin'\" (Jackie Chain featuring Kid Cudi) — — — — — — — — — — The New Deal \"She Came Along\" (Sharam featuring Kid Cudi) — — — — — — — — — — Get Wild \"Can't Stop Me\" (Chip tha Ripper and The Almighty Gloryus featuring Kid Cudi) — — — — — — — — — — Can't Stop Me \"Memories\" (David Guetta featuring Kid Cudi) 2010 46 — — 3 18 5 6 4 14 15 * RIAA: Platinum * ARIA: 2× Platinum * BPI: 2× Platinum * BVMI: 3× Platinum * IFPI SWE: 2× Platinum * RMNZ: Platinum * SNEP: Gold One Love \"That Tree\" (Snoop Dogg featuring Kid Cudi) — — — — — — — — — — More Malice \"Symphonies\" (Remix) (Dan Black featuring Kid Cudi) — — — — — — — — — — UN \"All of the Lights\" (Kanye West featuring Rihanna, Kid Cudi and Fergie) 18 2 2 24 53 — 13 13 46 15 * RIAA: 7× Platinum * ARIA: 2× Platinum * RMNZ: Gold * BPI: 2× Platinum My Beautiful Dark Twisted Fantasy \"Run\" (The Knux featuring Kid Cudi) 2011 — — — — — — — — — — Eraser \"Focused\" (Wale featuring Kid Cudi) 97 — — — — — — — — — Ambition \"Ask About Me\" (Chip tha Ripper featuring Kid Cudi) — — — — — — — — — — Ask About Me \"Cudi the Kid\" (Steve Aoki featuring Kid Cudi and Travis Barker) 2012 — — — — — — — — — — Wonderland \"GloryUs\" (Chip tha Ripper featuring Kid Cudi) — — — — — — — — — — Tell Ya Friends \"Satellites\" (Tassho Pearce featuring Kid Cudi) 2014 — — — — — — — — — — G.O.O.D. Company \"Father Stretch My Hands, Pt. 1\" (Kanye West featuring Kelly Price and Kid Cudi) 2016 37 14 9 — 51 — 74 — — 54 * RIAA: 6× Platinum * BPI: Silver * IFPI Denmark: Gold The Life of Pablo \"—\" denotes a recording that did not chart or was not released in that territory. ===Promotional singles=== List of promotional singles, with selected chart positions, showing year released and album name Note: “Marijuana” is a promotional single which makes it 9 promotional singles, just forgot to include. Title Year Peak chart positions Album US US R&B; CAN FRA IRL NZ Hot Peaks on the NZ Hot Singles Chart: * \"She Knows This\": * \"Just Look Up\": * \"Love\": * \"New Mode\" and \"Somewhere to Fly\": * \"Get Off Me\", \"Wow\", \"ElectroWaveBaby\" and \"X & Cud\": UK \"Did It Again (Remix)\" (Shakira featuring Kid Cudi) 2009 — — — — 17 — 26 She Wolf \"Whatever U Want (G.O.O.D. Music Has Arrived Remix)\" (Consequence featuring Kanye West, Common, Kid Cudi and Big Sean) 2010 — — — — — — — Movies on Demand \"REVOFEV\" — — — — — — — Man on the Moon II: The Legend of Mr. Rager \"All Summer\" (with Rostam Batmanglij and Bethany Cosentino) — — — — — — — \"Going to the Ceremony\" 2013 — — — — — — — Satellite Flight: The Journey to Mother Moon \"Love\" 2015 — — — — — 7 — The Boy Who Flew to the Moon, Vol. 1 \"Wedding Tux\" — — — — — — — Speedin' Bullet 2 Heaven \"Judgmental Cunt\" — — — — — — — \"Baptized in Fire\" 2016 — 47 — — — — — Passion, Pain & Demon Slayin' \"She Knows This\" 2020 49 9 59 142 74 7 — Man on the Moon III: The Chosen \"Heaven on Earth\" 85 24 81 — — — — \"Transparent Soul (Remix)\" (Willow featuring Kid Cudi and Travis Barker) 2021 — — — — — — — rowspan=\"1\" \"Just Look Up\" — — — — — 7 — Don't Look Up \"Most Ain't Dennis\" 2023 — — — — — — — Insano \"Ill What I Bleed\" — — — — — — — Insano (Nitro Mega) \"—\" denotes a recording that did not chart or was not released in that territory. ==Other charted and certified songs== List of songs, with selected chart positions and certifications, showing year released and album name Title Year Peak chart positions Certifications Album US US R&B;/HH AUS CAN FRA IRL NZ Hot UK \"Welcome to Heartbreak\" (Kanye West featuring Kid Cudi) 2008 — — — — — — — 112 * RIAA: Gold 808s & Heartbreak \"Soundtrack 2 My Life\" 2009 — — — — — — — — * RIAA: 3× Platinum Man on the Moon: The End of Day \"Cudi Zone\" — — — — — — — — * RIAA: Platinum \"Up Up & Away\" — — — — — — — — * RIAA: 2× Platinum \"Marijuana\" 2010 54 — — 68 — — — — * RIAA: Gold Man on the Moon II: The Legend of Mr. Rager \"Scott Mescudi vs. the World\" (featuring Cee Lo Green) 92 — — 88 — — — — \"Gorgeous\" (Kanye West featuring Kid Cudi and Raekwon) — 40 — — — — — — * RIAA: Platinum My Beautiful Dark Twisted Fantasy \"Welcome to the World\" (T.I. featuring Kanye West and Kid Cudi) — — — — — — — — No Mercy \"The Morning\" (with Raekwon, Pusha T, Common, 2 Chainz, Cyhi the Prynce, D'banj and Kanye West) 2012 — 49 — — — — — — Cruel Summer \"Creepers\" — — — — — — — — \"Unfuckwittable\" 2013 — — — — — — — — Indicud \"Solo Dolo, Pt. II\" (featuring Kendrick Lamar) — — — — — — — — \"Brothers\" (featuring King Chip and ASAP Rocky) — 47 — — — — — — \"Through the Late Night\" (Travis Scott featuring Kid Cudi) 2016 — 43 — — — — — — * RIAA: 2× Platinum * ARIA: Gold * MC: Platinum Birds in the Trap Sing McKnight \"Feel the Love\" (with Kanye West as Kids See Ghosts featuring Pusha T) 2018 47 24 57 35 185 50 — 47 * RIAA: Gold Kids See Ghosts \"Fire\" (with Kanye West as Kids See Ghosts) 67 32 69 49 — 58 — — * RIAA: Gold \"4th Dimension\" (with Kanye West as Kids See Ghosts featuring Louis Prima) 42 21 46 27 — 49 1 46 * RIAA: Platinum \"Freeee (Ghost Town, Pt. 2)\" (with Kanye West as Kids See Ghosts featuring Ty Dolla Sign) 62 30 72 58 — 66 — — \"Reborn\" (with Kanye West as Kids See Ghosts) 39 18 55 30 165 48 2 48 * RIAA: Platinum \"Kids See Ghosts\" (with Kanye West as Kids See Ghosts featuring Yasiin Bey) 73 37 84 53 — 64 — — * RIAA: Gold \"Cudi Montage\" (with Kanye West as Kids See Ghosts) 69 34 89 61 — 67 — — * RIAA: Gold \"Stop Trying to Be God\" (Travis Scott featuring Kid Cudi, Philip Bailey, James Blake, and Stevie Wonder) 27 18 87 19 — — — 70 * RIAA: Platinum * ARIA: Gold * MC: Platinum * BPI: Silver Astroworld \"Beautiful Trip\" 2020 100 32 — 96 — — — — Man on the Moon III: The Chosen \"Tequila Shots\" 41 7 — 52 95 51 6 86 * RIAA: Platinum \"Another Day\" 64 16 — 70 171 — 9 — \"Dive\" 80 22 — 80 — — — — \"Damaged\" 91 28 — 87 — — — — \"Show Out\" 54 12 — 42 78 29 5 37 \"Solo Dolo, Pt. III\" 78 21 — 75 — — — — \"Sad People\" 90 27 — 83 — — — — \"Elsie's Baby Boy (Flashback)\" — 39 — — — — — — \"Sept. 16\" — 37 — — — — — — \"The Void\" — 33 — — — — — — \"Lovin' Me\" — 40 — — — — — — \"The Pale Moonlight\" — 44 — — — — — — \"Rockstar Knights\" — 35 97 — — — — — \"4 Da Kidz\" — 47 — — — — — — \"Lord I Know\" — 50 — — — — — — \"M3tamorphosis\" (Playboi Carti featuring Kid Cudi) 99 37 — 90 — — — — Whole Lotta Red \"Moon\" (Kanye West featuring Don Toliver and Kid Cudi) 2021 17 7 — 21 — — — — * MC: Gold * RIAA: Platinum Donda \"IMY2\" (Drake featuring Kid Cudi) 22 16 — 37 — — — — Certified Lover Boy \"Rock n Roll\" (Pusha T featuring Kanye West and Kid Cudi) 2022 78 25 — 67 — — 11 98 It's Almost Dry \"New Mode\" — — — — — — 30 — Entergalactic \"Somewhere to Fly\" (with Don Toliver) — — — — — — 39 — \"Looove\" (Travis Scott featuring Kid Cudi) 2023 49 23 73 40 107 — — — Utopia \"Get Off Me\" 2024 — 48 — — — — 11 — Insano \"Wow\" — — — — — — 18 — \"ElectroWaveBaby\" — — — — — — 19 — \"X & Cud\" — — — — — — 25 — \"—\" denotes a recording that did not chart or was not released in that territory. ==Guest appearances== Key Indicates soundtrack List of non-single guest appearances, with other performing artists, showing year released and album name Title Year Other artist(s) Album \"Wasting My Minutes\" 2008 88-Keys Adam's Case Files \"Embrace the Martian\" Crookers Tons of Friends \"Find a Way\" (Game & Switch Mix)/\"Lunar Camel\" Santigold Top Ranking: A Diplo Dub \"Intro\" DJ E-V SpinFest: The Mixtape 2008 \"Interlude\" \"Outro\" \"Me + My Sneakers\" A-Trak Running Man: Nike+ Original Run \"Ho' Is Short for Honey\" 88-Keys The Death of Adam \"Welcome to Heartbreak\" Kanye West 808s & Heartbreak \"Therapy\" 2009 The Alchemist, Evidence, Blu, Talib Kweli Chemical Warfare \"Take Em High\" K. Sparks & Pajozo Popular Demand \"Buggin' Out '09\" J.Period, Q-Tip, Consequence The [Abstract] Best Vol. 1 \"Sky High\" The Kickdrums Smash the System \"Boom Boom Style\" (Zuper Blahq Megamix) The Black Eyed Peas Invasion of Boom Boom Pow – Megamix E.P. \"Don't Trust Me\" (Benny Blanco Remix) 3OH!3 Want \"Switchin' Lanes\" The South Central EP (Music from Midnight Club: Los Angeles South Central) \"Everything Is Broken\" Mr Hudson Straight No Chaser \"Already Home\" Jay-Z The Blueprint 3 \"Elevatas\" Robin Thicke Sex Therapy: The Session \"Do My Do\" Mickey Factz \"Floatin' in the Sky\" N.O.R.E. \"Girls, Sounds & Colors\" Rich Hil Hippies Most Wanted Vol. 2 \"Trippy\" \"Riot Song\" (Remix) 2010 Johnny Polygon Rebel Without Applause \"Ur Killin' Me\" Cam'ron, Vado Boss of All Bosses 2.5 \"All Talk\" Chip tha Ripper, Christian Bale Independence Day \"Won't You Tell Me\" Rich Hil \"EPS\" Limosa Nostra Act 1 \"Dangerous\" \"On the Spot\" DJ Green Lantern Invasion Radio 2K10 \"GOOD Friday\" Kanye West, Big Sean, Pusha T, Common, Charlie Wilson GOOD Fridays releases \"Christian Dior Denim Flow\" Kanye West, John Legend, Pusha T, Lloyd Banks, Ryan Leslie \"The Joy\" Kanye West, Pete Rock, Charlie Wilson, Curtis Mayfield, Jay-Z \"Gorgeous\" Kanye West, Raekwon My Beautiful Dark Twisted Fantasy \"Welcome to the World\" T.I., Kanye West No Mercy \"You Can Run\" 2011 Bryan Greenberg We Don't Have Forever \"Cool Head\" Travis Barker Give the Drummer Some \"Don't Kick the Chair\" Dia Frampton Red \"On My Own\" Consequence Curb Certified \"Ride 4 You\" 2012 Chip tha Ripper, Far East Movement Tell Ya Friends \"The Ruler and the Killer\" The Hunger Games: Songs from District 12 and Beyond \"Old School Caddy\" Hit-Boy HITStory \"Pursuit of Happiness (Steve Aoki Remix)\" Project X (Original Motion Picture Soundtrack) \"Like It or Love It\" Kreayshawn Somethin' 'Bout Kreay \"The Morning\" Raekwon, Pusha T, Common, 2 Chainz, Cyhi the Prynce, D'banj Cruel Summer \"Creepers\" \"She Hates Me\" Big Boi Vicious Lies and Dangerous Rumors \"First Chain\" 2013 Big Sean, Nas Hall of Fame \"Vortex\" King Chip, Pusha T 44108 \"Guilt Trip\" Kanye West Yeezus \"Hero\" 2014 Skylar Grey Need for Speed: Original Motion Picture Soundtrack \"Scorn\" Audio Push, Hit-Boy, Kent M$ney We the Plug \"Waves\" 2016 Kanye West, Chris Brown The Life of Pablo \"Through the Late Night\" Travis Scott Birds in the Trap Sing McKnight \"The Rage\" 2018 Rampage – Original Motion Picture Soundtrack \"ASAP Forever\" (Remix) ASAP Rocky, T.I., Moby Testing \"No Mistakes\" Kanye West, Charlie Wilson, Caroline Shaw Ye \"Ghost Town\" Kanye West, PartyNextDoor, 070 Shake \"Stop Trying to Be God\" Travis Scott, Philip Bailey, James Blake, Stevie Wonder Astroworld \"Lost\" Quavo Quavo Huncho \"Dangerous\" 2019 Schoolboy Q Crash Talk \"On My Own\" Jaden Smith ERYS \"Privilege\" (Remix) The Weeknd \"A Sweeter Place\" 2020 Selena Gomez Rare \"Temptations\" Ty Dolla Sign Featuring Ty Dolla Sign \"M3tamorphosis\" Playboi Carti Whole Lotta Red \"Moon Man\" 2021 YSL Records, Young Thug, Strick Slime Language 2 / Strick Land \"8-Ball\" Pop Smoke Faith \"Peace of Mind\" Skepta, Teezee All In \"Moon\" Kanye West, Don Toliver Donda \"Remote Control, Pt. 2\" Kanye West, Young Thug \"IMY2\" Drake Certified Lover Boy \"Guns Go Bang\" Jay-Z The Harder They Fall (The Motion Picture Soundtrack) \"Rock n Roll\" 2022 Pusha T, Kanye West It's Almost Dry \"Company\" Lil Nas X \"Summertime\" 2023 Skrillex Don't Get Too Close \"Looove\" Travis Scott Utopia \"All My Life\" 1017 ALYX 9SM Compilation V1 \"Godqueen\" 2024 The Book of Clarence (soundtrack) \"Warlords\" Childish Gambino \"Gun to My Head\" ¥$ Vultures 2 (Digital Deluxe) ==Production discography== List of production (songwriting and arrangement) and sole songwriting credits (excluding guest appearances, interpolations, and samples) Track(s) Year Credit Artist(s) Album 5\\. \"Heartless\" 2008 Songwriter Kanye West 808s & Heartbreak 6\\. \"Paranoid\" Additional vocals, songwriter 8\\. \"RoboCop\" Songwriter 7\\. \"Day 'n' Nite\" 2009 Producer Kid Cudi Man on the Moon: The End of Day 8\\. \"Sky Might Fall\" Producer 5\\. \"Marijuana\" 2010 Producer Kid Cudi Man on the Moon II: The Legend of Mr. Rager 17\\. \"Trapped in My Mind\" Producer 7\\. \"You Be Killin Em\" Co-producer Fabolous There Is No Competition 2: The Grieving Music EP 9\\. \"Cool Head\" 2011 Co-producer Travis Barker Give the Drummer Some 1\\. \"No One Believes Me\" Co-producer Kid Cudi Various artists – Music from and Inspired by the Motion Picture Fright Night 3\\. \"Free\" Songwriter Natalia Kills Perfectionist 10\\. \"Murder to Excellence\" Backing vocals, songwriter JAY-Z, Kanye West Watch The Throne 13\\. \"Illest Motherfucker Alive\" 16\\. \"The Joy\" 6\\. \"Like It or Love It\" 2012 Co-producer Kreayshawn Somethin' 'Bout Kreay 2013 Producer Kid Cudi Indicud 8\\. \"Guilt Trip\" Songwriter, additional vocals Kanye West Yeezus Tracks 1, 4-10 2014 Producer Kid Cudi Satellite Flight: The Journey to Mother Moon 2015 Producer Kid Cudi Speedin' Bullet 2 Heaven Tracks 1–3, 7–15, 17-18 2016 Producer Kid Cudi Passion, Pain & Demon Slayin' 19\\. \"Lost\" 2018 Producer Quavo Quavo Huncho Tracks 2, 4-7 Producer Kids See Ghosts Kids See Ghosts 13\\. \"A Sweeter Place\" 2020 Producer Selena Gomez Rare Producer Kid Cudi Man on the Moon III: The Chosen ==See also== * List of songs recorded by Kid Cudi * Kid Cudi videography * Kids See Ghosts discography * WZRD discography * List of awards and nominations received by Kid Cudi ==Notes== ==References== ==Other websites== * * * * Category:Discographies of American artists Category:Kid Cudi",
 "title": "Kid Cudi discography"
}