{
 "id": "1165866",
 "text": "Tijuana International Airport (); officially Aeropuerto Internacional General Abelardo L. Rodríguez (General Abelardo L. Rodríguez International Airport) , is an international airport located northeast of downtown Tijuana, Baja California, Mexico. It serves Tijuana and the surrounding San Diego–Tijuana metropolitan area, home to a population of five million people. ==Airlines and destinations== ===Passenger=== {{Airport-dest-list | Aeroméxico | Mexico City Seasonal: Guadalajara | | Phoenix–Sky Harbor | | Beijing–Capital | Magnicharters | Seasonal: Guadalajara | | Mexico City–AIFA | Viva | Cancún, Culiacán, Guadalajara, Hermosillo (begins May 22, 2025), La Paz (begins May 22, 2025), León/Del Bajío, Mazatlán, Mérida, Mexico City, Mexico City–AIFA, Monterrey, Morelia, Oaxaca, Puebla, Puerto Vallarta, Querétaro (begins May 23, 2025), San José del Cabo, Tulum, Veracruz (begins May 22, 2025) | Volaris | Acapulco, Aguascalientes, Cancún, Chihuahua, Ciudad Juárez, Ciudad Obregón, Colima, Culiacán, Durango, Guadalajara, Hermosillo, Huatulco, Ixtapa/Zihuatanejo, La Paz, León/Del Bajío, Loreto, Los Mochis, Mazatlán, Mérida, Mexico City, Mexico City–AIFA, Monterrey, Morelia, Oaxaca, Puebla, Puerto Escondido, Puerto Vallarta, Querétaro, San José del Cabo, San Luis Potosí, Tapachula, Tepic, Toluca/Mexico City, Torreón/Gómez Palacio, Tuxtla Gutiérrez, Uruapan, Veracruz, Villahermosa, Zacatecas }} Notes: Viva flight to Hermosillo makes a stopover in San José del Cabo but it will be non-stop from May 2025. Viva flight to Mérida makes a stopover in Monterrey. Viva flight to Querétaro makes a stopover in San José del Cabo but it will be non-stop from May 2025. Viva flight to Tulum makes a stopover in Mexico City–AIFA. ===Cargo=== {{Airport destination list | Aeronaves TSM | Hermosillo, Querétaro | AeroUnion | Mexico City–AIFA | China Southern Cargo | Mexico City–AIFA, Shanghai–Pudong | Estafeta | Culiacán, Hermosillo | IFL Group Operated for FedEx Feeder | San Diego }} ===Destinations map=== == References == Category:1951 establishments in North America Category:1950s establishments in Mexico Category:Airports in Mexico Category:Tijuana",
 "title": "Tijuana International Airport"
}