{
 "id": "1166900",
 "text": "Kyle Henry Erovre Okposo (born April 16, 1988) is an American former professional ice hockey right winger. He played a total of 17 seasons in the National Hockey League (NHL). He played for the New York Islanders, Buffalo Sabres, and Florida Panthers. ==Career== Before playing in the NHL, Okposo played parts of 1 season with the Des Moines Buccaneers of the United States Hockey League (USHL) and 2 years with the Minnesota Golden Gophers of the National Collegiate Athletic Association (NCAA). During his time with the Buccaneers, he helped the team win the Clark Cup after they defeated the Sioux Falls Stampede. He was also named the USHL playoffs most valuable player and was the top rookie of the league. The Buccaneers name their Offensive Player of the Year Award after Okposo. On December 19, 2007, Okposo left his second year with Minnesota early to sign with the sign a three-year, entry-level contract with the Islanders. This caused some controversy, with the Islanders general manager Garth Snow saying that Minnesota's coach was not using him properly and Minnesota coach Don Lucia saying that the Islanders left him in a difficult position. He was drafted 7th overall by the New York Islanders in the 2016 NHL entry draft. On March 18, 2008, Okposo made his NHL debut in a 3-1 loss against the Toronto Maple Leafs. On March 21, Okposo scored his first NHL goal in a 3-1 win against the New Jersey Devils. On May 25, 2011, Okposo signed a five-year, $14 million contract to stay with the Islanders. On July 1, 2016, Okposo signed a seven-year, $42 million contract with the Buffalo Sabres. He had a successful year with the Sabres and was named to the 2017 NHL All-Star Game. On October 08, 2022, the Sabres named Okposo the captain of the team. On March 8, 2024, the Sabres traded Okposo to the Florida Panthers in exchange for Calle Själin and a seventh-round pick in the 2024 NHL entry draft. He won his first Stanley Cup with the team when he helped the Panthers defeat the Edmonton Oilers 4 games to 3. On September 19, 2024, Okposo announced that he was retiring from playing professional ice hockey. ==References== == Other websites == * Category:1988 births Category:Living people Category:African-American sportspeople Category:American ice hockey right wingers Category:Bridgeport Sound Tigers players Category:Buffalo Sabres players Category:Florida Panthers players Category:Sportspeople from Saint Paul, Minnesota Category:New York Islanders players Category:Stanley Cup champions",
 "title": "Kyle Okposo"
}