{
 "id": "1166716",
 "text": "Madelyne Jennifer Pryor is a fictional character in the Marvel Comics universe, primarily associated with the X-Men series. She first appeared in Uncanny X-Men #250 in 1989, created by writer Chris Claremont and artist Jim Lee. == Publication history == First appearing in The Uncanny X-Men #250 in 1989, she was created by writer Chris Claremont and artist Jim Lee. == Fictional character biography == Madelyne is notable for being a clone of Jean Grey, created by the villain Mister Sinister. She appears as a red-haired woman who bears a strong resemblance to Jean and ends up becoming the wife of Scott Summers / Cyclops after Jean's apparent death in the Dark Phoenix Saga. The character is often depicted as a complex figure, with storylines that explore themes of identity and the consequences of cloning. In the comics, Madelyne has also taken on the identity of the Goblin Queen, embracing darker powers and becoming an adversary for the X-Men. Her character has been part of some significant story arcs within the X-Men series and has developed a devoted following among fans over the years. == Powers and abilities == Her powers and abilities are derived from her genetic background and her experiences in the comics. Like Jean Grey, Madelyne possesses telepathic abilities, allowing her to read minds and communicate mentally. She can manipulate objects with her mind, moving them without physical interaction. After her transformation into the Goblin Queen, Madelyne gained access to various magical abilities, including spells and enchantments, allowing her to manipulate the forces of magic. Madelyne can create powerful illusions to deceive others, a skill she often uses in her confrontations. She has displayed the ability to levitate and fly, an ability often associated with her magical transformations. While not as physically powerful as some other mutants, Madelyne has displayed a level of superhuman strength and durability, especially when empowered by her magical abilities. She can generate and control various forms of energy, which she can use offensively or defensively. Due to her status as a clone, Madelyne's existence has been tied to themes of resurrection and identity, though these abilities are less about combat and more about her narrative significance. Madelyne Pryor's character has undergone various changes and iterations throughout her comic book history, affecting her powers and abilities. Her association with themes of dark magic and manipulation makes her a complex character within the Marvel Universe. == In other media == Jennifer Hale voices Madelyne Pryor in X-Men '97, a sequel series to X-Men: The Animated Series. Category:Fictional characters introduced in 1983 Category:Marvel Comics supervillains Category:Marvel Comics mutants",
 "title": "Madelyne Pryor"
}