{
 "id": "1166935",
 "text": "Dafne Keen Fernández (born 4 January 2005) is a Spanish and British actress. She is known for playing Laura in the superhero film Logan (2017), Lyra Belacqua in the television series His Dark Materials, and Jecki Lon in the Star Wars series The Acolyte. == Early life == Keen was born in Madrid. Her parents are English actor Will Keen, and Spanish actress and director María Fernández Ache. == Filmography == === Film === List of film roles Year Title Role Notes 2017 Logan Laura / X-23 2020 Ana Ana 2024 Deadpool & Wolverine Laura / X-23 Post-production In production === Television === List of television appearances and roles Year Title Role Notes 2015 The Refugees Ana \"Ani\" Cruz Oliver Main role 2019–2022 His Dark Materials Lyra Belacqua Lead role 2024 The Acolyte Jecki Lon Main role === Podcast === * The Battersea Poltergeist (2021) == Awards and nominations == List of awards and nominations received by Dafne Keen Award Year Category Nominated work Result British Academy Cymru Awards 2020 Best Actress His Dark Materials Chicago Film Critics Association Awards 2017 Most Promising Performer Logan Critics' Choice Awards 2018 Best Young Performer Logan Dublin Film Critics' Circle Awards 2017 Breakthrough Artist of the Year Logan Empire Awards 2018 Best Female Newcomer Logan Hollywood Critics Association Awards 2017 Best Actor or Actress 23 and Under Logan Houston Film Critics Society Awards 2017 Best Supporting Actress Logan Las Vegas Film Critics Society Awards 2017 Youth in Film Logan London Film Critics Circle Awards 2017 Young British/Irish Performer of the Year Logan MTV Movie & TV Awards 2017 Best Duo Logan Online Film Critics Society Awards 2017 Best Breakout Star Logan Online Association of Female Film Critics Awards 2017 Best Breakthrough Performance Logan Online Film and Television Association Awards 2017 Best Youth Performance Logan Best Breakthrough Performance: Female Logan Phoenix Film Critics Society Awards 2017 Best Performance by a Youth Logan Breakthrough Performance Logan Saturn Awards 2018 Best Performance by a Younger Actor Logan Seattle Film Critics Society Awards 2017 Best Youth Performance Logan Washington D.C. Area Film Critics Association Awards 2017 Best Youth Performance Logan == Notes == == References == == Other websites == * Category:2005 births Category:Living people Category:British child actors Category:British movie actors Category:British television actors Category:People from Madrid Category:Spanish child actors Category:Spanish movie actors Category:Spanish television actors",
 "title": "Dafne Keen"
}