{
 "id": "1166618",
 "text": "The French conquest of Corsica was a winning fight by French soldiers from France, led by Comte de Vaux, against Corsican soldiers led by Pasquale Paoli from the Corsican Republic. The attack started in May 1768, after the Seven Years' War. French soldiers landed on Corsica, which was ruled by the Corsican Republic. They moved inland to fight any Corsican soldiers. At first, the French lost in a surprise defeat at the Battle of Borgo. But a new leader, Comte de Vaux, took charge and strongly beat the Corsican army at the Battle of Ponte Novu in 1769, ending Corsican resistance. The Corsican soldiers, without enough strength or men to keep fighting, gave up the island. After the Corsicans lost, France took control of the island, but it took them a year to fully control it because many Corsicans ran to the hills and fought back using surprise attacks. Pasquale Paoli escaped to Great Britain, where he was very well liked and joined a famous dining club with Samuel Johnson. Corsica stayed under French control until 1794, when British and Corsican forces took the island from France and made the Anglo-Corsican Kingdom, with Paoli as its leader. On 19 October 1796, the French took back Corsica, and it became part of France again. == Background == The island of Corsica was ruled by the Republic of Genoa since 1284. In the 18th century, Corsican people started to feel proud of their own land and wanted to be free from Genoa. In 1729, the Corsican fight for freedom from Genoa began. It was first led by Luiggi Giafferi and Giacinto Paoli, and later by Paoli’s son, Pasquale Paoli. After 26 years of fighting against Genoa (plus a short attempt in 1736 to make Corsica a free kingdom under a German man, Theodor von Neuhoff, who was helped by the Dutch Republic and Great Britain, which controlled Menorca and Gibraltar in the Mediterranean), Corsica became an independent republic in 1755 under Pasquale Paoli. It stayed free until 1769. The Corsican Constitution of 1755 was written in Italian (which was the main language in Corsica until the middle of the 19th century) by Paoli. Even after 40 years of hard fighting, Corsica could not remove Genoa from the big forts in Calvi and Bonifacio. In 1767, Corsican fighters took Capraia, a small island in the Tuscan Archipelago. Tired after 40 years of war, Genoa decided to sell Corsica to France. France, which had lost the Seven Years’ War, wanted to become stronger in the Mediterranean. In 1768, with the Treaty of Versailles (1768), Genoa gave all its rights over Corsica to France. That same year, King Louis XV sent soldiers to Corsica to take full control of the island, led by Comte de Vaux, a soldier who had fought in the Seven Years’ War.Abalain, Hervé, (2007) Le français et les langues historiques de la France, Éditions Jean-Paul Gisserot, p.113 == Conquest == France's first attack failed because the first small French army had a big loss at the Battle of Borgo in October 1768. So, France sent many more soldiers, making their army on the island grow to 24,000 men, and gave a new leader the job of continuing the fight. The Corsican army was fully defeated at the Battle of Ponte Novu, and soon the French soldiers took over the island. But the Corsicans did not completely stop fighting until the next year, and small fights still happened. France made its control stronger, and in 1770 Corsica became a part of France. Under French rule, fewer people spoke Corsican (a language similar to Italian), and more people started speaking French. Italian was the official language of Corsica until 1859. == Results == The French attack caused problems in British politics, known as the Corsican Crisis. Even though Britain secretly helped the Corsicans, the British government decided not to stop France from taking the island. Paoli made a new Corsican Constitution, influenced by British ideas. He created the world’s most open voting system and tried to change education. Because Britain and France were enemies, and because Britain had helped Corsican refugees before, Paoli wanted an alliance with Britain. Britain even opened an office in Corsica, but they did not pay much attention to the island until 1768. The Corsican leader, Pasquale Paoli, escaped to Britain and stayed there until the French Revolution let him return to Corsica. British soldiers later went to Corsica between 1794 and 1796, making the Anglo-Corsican Kingdom. In 1814, they made the Treaty of Bastia, but after the Congress of Vienna, Corsica was given back to the French king. The invasion also had a big effect on France itself. Napoleon Bonaparte was born in Corsica in 1769, so he became a French citizen at birth. His parents, Carlo Maria Buonaparte and Maria Letizia Ramolino, joined the fight against France, even when Maria was pregnant with him. Napoleon grew up as a Corsican nationalist but later became loyal to all of France. He joined the French army, became the ruler of France, supported the French Revolution, and started the Napoleonic Wars, which changed Europe forever. == References == Category:1768 Category:1769 Category:18th century in France",
 "title": "French conquest of Corsica"
}