{
 "id": "1166239",
 "text": "Anton Šťastný (born August 5, 1959) is a Slovak former professional ice hockey left winger. He played parts of 9 seasons in the National Hockey League (NHL), all with the Quebec Nordiques. He also played for Slovan Bratislava of the Slovak Extraliga (SVK), as well as, Fribourg-Gottéron and Olten of the NDA. ==Career== Before playing in the NHL, Šťastný played parts of 3 seasons with Slovan ChZJD Bratislava of the Czechoslovak First Ice Hockey League (TCH). He was drafted twice. The first time was 198th overall by the Philadelphia Flyers in the 1978 NHL amateur draft. However, this drafting was ineligible because he was too young. He was then drafted 83rd overall by the Quebec Nordiques in the 1979 NHL entry draft. He became the first born and trained Slovakian to be drafted into the NHL. On October 9, 1980, Šťastný made his NHL debut alongside his brother Peter in a 5-5 tie with the Calgary Flames. The next day, he recorded his first NHL point, assisting on a Jamie Hislop goal in a 7-4 win against the Edmonton Oilers. On October 14, Šťastný scored his first NHL goal in a 4-1 loss against the Colorado Rockies. On February 20, 1981, both Anton and Peter scored hat tricks in a 9-3 win against the Vancouver Canucks. Anton and Peter set and shared a rookie points record with 8 points in a 11-7 win against the Washington Capitals on February 22. Šťastný played 9 seasons with the Nordiques. He played alongside his brother Peter and they were later joined by their other brother Marián. This made the three brother trio the third in the history of the NHL. He retired from playing professional ice hockey in 1994. ==Personal life== Anton is part of the Šťastný family. His brothers Marián and Peter, as well as, nephews Yan and Paul all played in the NHL. ==References== == Other websites == * Category:1959 births Category:Living people Category:Canadian ice hockey left wingers Category:Czechoslovak ice hockey players Category:Halifax Citadels players Category:People from Bratislava Category:Quebec Nordiques players Category:Slovak ice hockey players",
 "title": "Anton Šťastný"
}