{
 "id": "1166528",
 "text": "Kimbal Musk (born September 20, 1972 in Pretoria) is a South African-born Canadian-American entrepreneur and restaurateur. He owns several companies, runs non-profit organizations, is an agenda contributor to the World Economic Forum (WEF) and a board member of SpaceX and Tesla, Inc. == Biography == He grew up with his brother Elon Musk and his sister Tosca Musk in South Africa. His mother Maye Musk worked as a model and nutritionist, while his father was a mechanical engineer. After finishing high school in Pretoria, he emigrated to Kingston in Canada to join his brother. There he enrolled at Queen's University and graduated with a degree in Business Administration in 1995. During this time, he initially worked at Scotiabank. Musk opened a painting business, College Pro Painters, in 1995. In the same year, he founded Zip2 with his older brother Elon Musk. They marketed an online city guide that provided content for the new online versions of the New York Times and Chicago Tribune newspapers. The company was sold to Compaq in 1999 for 307 million dollars. The brothers invested the money in various technology companies. Musk then moved to New York City and trained as a chef. He founded his first restaurant in 2004 in Boulder, Colorado, where he set up The Kitchen Restaurant Group. This is a group of restaurants with alternative concepts in several US cities. He is also the co-founder and chairman of Big Green, a non- profit organization that has built hundreds of outdoor classrooms called Learning Gardens in schoolyards across the United States. Musk is also the co- founder and chairman of Square Roots, an urban farming company in Brooklyn that grows food in hydroponic, covered and climate-controlled shipping containers. He also co-founded the search engine OneRiot, which was acquired by Walmart in 2011. Musk sits on the board of Tesla Inc. and SpaceX. He is the fifth largest shareholder in Tesla. Musk married Jen Lewin, with whom he founded The Kitchen. The couple have two children and are now divorced. In April 2018, he married Christiana Wyly, an environmental activist and daughter of entrepreneur Sam Wyly. == Awards and honors == Musk was named Global Social Entrepreneur of the Year 2018 by the World Economic Forum. == Critique == === Allegation of insider trading === In November 2021, Elon Musk launched a Twitter poll and asked Twitter users to vote on whether he should sell ten percent of his Tesla shares. 58 percent of users were in favor of selling. The value of the shares plummeted as a result. Musk sold Tesla shares in a big way just one day before his brother's poll and made a profit of 108.8 million dollars within a very short space of time. It is unclear whether Musk knew about his brother's plans earlier and was therefore guilty of insider trading. == References == Category:1972 births Category:Living people Category:South African businesspeople Category:Businesspeople from Ontario Category:Businesspeople from New York City Category:Naturalized citizens of Canada Category:Naturalized citizens of the United States Category:People from Pretoria Category:Elon Musk",
 "title": "Kimbal Musk"
}