{
 "id": "116661",
 "text": "Winchester Cathedral is a mediaeval Anglican church in Winchester, Hampshire. It is the seat of the Bishop of Winchester. The cathedral has the longest nave and overall length of any Gothic cathedral in Europe. By contrast, the interior height of the nave vault at 78 feet is about half that of Beauvais Cathedral in France.Alec Clifton-Taylor 1967. The Cathedrals of England Thames & Hudson, London. == Architecture == Built between 1079 and 1532, Winchester Cathedral has had an unusual architectural history. The exterior, apart from the modified windows, gives the impression of a massive Norman building and indeed, when first completed, the Norman Cathedral was second only in size to Saint Peter's Basilica in Rome. However, the west front is now Perpendicular, with its huge window filled with fragments of medieval glass. Sadly this glass window was destroyed by the Roundheads.They also messed up the bones of some of the most important rulers. Inside, only the crypt and the transepts have retained their Norman appearance. The spectacular Perpendicular nave with its tall arcade arches and strong vertical emphasis has been literally carved out of the original Norman interior. The Very Rev. Norman Sykes wrote of it “Well might the visitor who enters … by the west door gasp with amazement\".Sykes N. A pictorial history of Winchester Cathedral. Winchester is also famous for its carved wooden fittings of many different periods.Hampshire: Winchester and the North, Nickolaus Pevsner and others , 2010 ==Events== Important events which took place at Winchester Cathedral include: *Funeral of King Harthacanute (1042) *Funeral of King William II of England (1100) *Coronation of Henry the Young King and his queen, Marguerite (1172) *Second coronation of Richard I of England (1194) *Marriage of King Henry IV of England and Joanna of Navarre (1403) *Marriage of Queen Mary I of England and King Philip II of Spain (1554) *Funeral and burial of Jane Austen (1817)Park Honan 1987. Jane Austen: her life. St. Martin's Press, New York, p407. ==Related pages== * English Gothic architecture * Romanesque architecture * Church of England == References == == Other websites == * Official website * Virtual tour * Thirty images of Winchester Cathedral with descriptions Category:Anglican cathedrals in England Category:Winchester Category:Buildings and structures in Hampshire Category:11th-century buildings and structures Category:Organisations based in Hampshire",
 "title": "Winchester Cathedral"
}