{
 "id": "1166679",
 "text": "Kent Åke Nilsson (born 31 August 1956) is a Swedish former professional ice hockey centre. He played parts of 10 seasons in the National Hockey League (NHL). He played for the Atlanta Flames, Calgary Flames, Minnesota North Stars, and Edmonton Oilers. He also played for the Winnipeg Jets of the World Hockey Association (WHA) and many different teams across Europe. Nilsson was very successful during his career. Throughout the players who have scored at least 500 points, Nilsson is recorded as having the 10th highest career NHL points-per-game average. He was nicknamed \"The Magic Man\". He was inducted into the IIHF Hall of Fame in 2000, the World Hockey Association Hall of Fame in 2010, and the Swedish Hockey Hall of Fame in 2012. ==Career== Before playing in North America, Nilsson played parts of 4 seasons with Djurgårdens IF and 1 season with AIK IF of the Hockeyettan. He was drafted twice. He was first drafted 11th overall by the Toronto Toros in the 1976 WHA amateur draft and the drafted 64th overall by the Atlanta Flames in the 1976 NHL amateur draft. He played 2 seasons with the Jets. In both seasons, Nilsson was successful and recorded over 100 points in each of them. He helped the Jets during the playoffs on their way to the finals. In the finals, the Jets defeated the Edmonton Oilers 4 games to 2 to capture back-to-back Avco Cups. It was also their last one. In 1979, Nilsson began playing for the Atlanta Flames. On October 10, 1979, Nilsson made his NHL debut in a 5-3 win against the Quebec Nordiques. During the game, he also scored his first NHL goal and assisted on 2 goals. He stayed with the team's when they moved from Atlanta to Calgary, Alberta to become the Calgary Flames. In 1980, Nilsson scored 82 assists and 131 points which set a Flames franchise record. On June 15, 1985, the Flames traded Nilsson along with a third-round pick to the Minnesota North Stars in exchange for a second-round pick in the 1985 NHL entry draft and a second-round pick in the 1987 NHL entry draft. The Flames used their pick in 1985 to draft Hockey Hall of Famer Joe Nieuwendyk. On October 11, 1986, Nilsson scored a goal in the first 10 second of the game in a 4-4 tie to the Quebec Nordiques. This set an NHL record for the fastest goal scored by a player in a season opener. On March 2, 1987, the North Stars traded Nilsson to the Edmonton Oilers in exchange for a second-round pick in the 1988 NHL entry draft. That year, Nilsson helped the Oilers reach the Stanley Cup Finals. Nilsson won his first Stanley Cup after the Oilers defeated the Philadelphia Flyers 4 games to 3. The next year, Nilsson decided to leave North America and travel to Italy to play for HC Bolzano of Serie A. In 1994, he briefly returned to NHL to play for the Oilers again but only played 6 games before returning to Europe. He retired from playing professional ice hockey in 1998. ==Personal life== Nilsson's zon Robert also played in the NHL. ==References== == Other websites == * Category:1956 births Category:Living people Category:Atlanta Flames players Category:Calgary Flames players Category:Edmonton Oilers players Category:Minnesota North Stars players Category:Stanley Cup champions Category:Swedish ice hockey centres Category:World Hockey Association players",
 "title": "Kent Nilsson"
}