{
 "id": "1166071",
 "text": "{{Infobox settlement | name = Magallanes, Sorosogon | other_name = | native_name = Parina | native_name_lang = | settlement_type = Municipality of Sorsogon province | | image_skyline = Magallanes_view.jpg | image_alt = | image_caption = | image_flag = Flag of Magallanes, Sorsogon.png | flag_size = 120x80px | image_seal = | seal_size = 100x80px | | image_map = Ph_locator_sorsogon_magallanes.png | image_map1 = | pushpin_map = Philippines | pushpin_label_position = left | pushpin_map_caption = Location within the | coordinates = | coor_pinpoint = | | subdivision_type = Country | subdivision_name = Philippines | subdivision_type1 = Region | subdivision_name1 = Bicol Region | subdivision_type2 = Province | subdivision_name2 = Sorsogon | subdivision_type3 = Municipality | subdivision_name3 = 1st district | subdivision_type4 = Barangays | subdivision_name4 = 34 | | established_title = | established_date = 1567 | founder = | seat_type = | seat = | | area_total_km2 = 150.09 | elevation_m = | elevation_max_m = 244 | elevation_min_m = 0 | elevation_max_rank = | elevation_min_rank = | elevation_footnotes = | elevation_max_footnotes = | elevation_min_footnotes = | | timezone = Philippine Standard Time | utc_offset1 = +8 | timezone1_DST = | utc_offset1_DST = | | postal_code = 4705 | area_code_type = IDD : area code | area_code = +63 (0)56 | iso_code = | website = | footnotes = }} Magallanes is a coastal municipality in the province of Sorsogon, Luzon, Philippines. The formal political and administrative creation of Magallanes began from a site known as Parina, derived from a local hardwood used in shipbuilding.Abella, D. (1954). Bikol Annals: A Collection of Vignettes of Philippine History. Manila. ==History== In 1567, on orders of King Philip II of Spain, the Order of St. Augustine in New Spain (Mexico) sent missionaries to the Philippine islands. In 1569, two Augustinian priests, Fray Alonso Jimenez and Fray Juan de Alva, accompanied by Luiz Enriquez de Guzman, a Spanish captain, reached Gibal-ong (shortened to Hibalong), a fishing village near the Ginangra River, inhabited by the Ibalong tribe.Prado, M. G. (1981). Ibalon : Ethnohistory of the Bikol Region. Legazpi City: AMS Press.Reyes, J. C. (January–February 1979). The Ibalen Epic - A Window to Bicols Pre-history. Boletin Eclesiastico de Filipinas v. 53 nos. 590-591, pp. 61-92.Dery, L. C. (1991). From Ibalon to Sorsogon : A Historical Survey of Sorsogon Province to 1905. Quezon City: New Day Publishers.Espinas, M. (1996). The Ibalong : The Bikol Folk Epic-fragment. Manila: University of Santo Tomas Publishing House. Having arrived, Fray Alonso's party built a chapel made of bamboo and nipa in a settlement called Parina;Mallari, F. (1990). Ibalon Under Storm and Siege : Essays on Bicol History: 1565-1860. Cagayan de Oro City. where was held the first Roman Catholic mass in Luzon island.The site is today identified as Sitio San Isidro of Barangay Salvacion in present-day Magallanes. Centuries into Spain's colonial rule —in 1858— Don Manuel de Castro, a Spanish settler, wrote the Governor-General of the Philippines, requesting that Parina be made into a town and expanded, which was approved in 1859. The new town was named Magallanes in honor of Ferdinand Magellan, the explorer who discovered the Philippines for Spain three centuries earlier. Magallanes was afterwards declared a municipality by the governor-general on July 16, 1860, with Manuel de Castro as its first appointed municipal governor.page 24, Tracing from Solsogon to Sorsogon, 2nd Edition (2007), It was subdivided into six headships called \"cabeseras\", each of which was supervised by a \"cebeja de barangay\" (literally,\"eyebrow\", therefore the \"overseer\").Owen, N. (1999). The Bikol blend : Bikolanos and Their History. Quezon City: New Day Publishers. In 1864 the town's first census yielded a total population of 1,400. ==Bagatao Island== Bagatao Island is situated at the mouth of Sorsogon Bay, in the municipality of Magallanes. The island, approximately 543 hectares, is two kilometers away from the Poblacion (town square) and across the Magallanes pier. It served as a major port and shipyard for Spanish ships in their route from Manila to Acapulco and back for their supplies, repairs and safe harbor. At the island and the nearby town, they awaited during storms and typhoons for fair weather before voyaging once again, across the San Bernardino Strait. The shipyard had abundant lumber that was needed for ship repairs, especially the wood of the \"parina\" tree from the inland forest, which was used extensively for its excellent quality until the species became extinct. When the shipbuilding industry made this place progressive, Magallanes became known as Visita de Parina because of numerous visitors from other places. ==Barangays== At present, Magallanes has a total population (2020) of 37,411 residents. The municipality is partitioned into 34 administrative sub-divisions, called Barangays. * Aguada Norte * Aguada Sur * Anibong * Bacalon * Bacolod * Banacud * Biga * Behia * Binisitahan del Norte * Binisitahan del Sur * Biton * Bulala * Busay * Caditaan * Cagbolo * Cagtalaba * Cawit Extension * Cawit Proper * Central * Ginangra * Hubo * Incarizan * Lapinig * Magsaysay * Malbog * Pantalan * Pawik * Pili * Salvacion * Santa Elena * Siuton * Tagas * Tulatula Norte * Tulatula Sur ==References== ==Other websites== * Municipalities of Sorsogon * Brgy. Ginangra * Ginangra River * The first mass in Luzon Category:Sorsogon Category:Settlements in the Philippines Category:Ports and harbours of the Philippines",
 "title": "Magallanes, Sorsogon"
}