{
 "id": "1166771",
 "text": "The Federal Intelligence Agency (AFI) was an intelligence agency that operated under the political and institutional leadership of the Executive Branch of Argentina. It was the highest body of the National Intelligence System (SIN) and encompasses the organizations that comprise it. Its duty was to advise the President of Argentina and the highest level officials for decision-making, within the framework of their responsibility. It was created in February 2015 to replace the Intelligence Secretariat and was dissolved on July 15, 2024 by Javier Milei. ==Creation== The agency was created by Law 27,126CREACIÓN DE LA AGENCIA FEDERAL DE INTELIGENCIA, promulgated 3 March 2015 on infoLeg amending the National Intelligence Act entering into force 120 days after enactment of the Act. According to regulations shall govern all communication by the Director General or Deputy Director General any interaction being punished by the members of the AFI any action or relationship regulated by the law establishing the Federal Intelligence Agency. In turn AFI officials should make affidavits without distinction of degrees. ==Recruitment of new agents== The course is held at the National Intelligence School (ENI) where students study subjects such as intelligence doctrine, legislation, intelligence cycle, information analysis and security measures. At the same time, they attend special conferences on the new paradigms of intelligence in South America, drug trafficking, human trafficking, arms trafficking, money laundering, terrorism, cybersecurity and crimes against the constitutional order, to train as intelligence agents. Students are selected in a joint work of the Agency with the main universities in the country, which are in charge of referring students or graduates with outstanding academic performance. ==References== Category:Intelligence agencies Category:Government of Argentina Category:2015 establishments Category:2024 disestablishments",
 "title": "Federal Intelligence Agency"
}