{
 "id": "1166026",
 "text": "Since the 1949 founding of the United Nations Relief and Works Agency for Palestine Refugees in the Near East, abbreviated as UNRWA, there have been many controversies with the organization. These include the use of its facilities to hide weapons and hold civilian hostages, UNRWA staff who belong to militant groups like Hamas, antisemitic school materials that incite violence, and evidence that UNRWA staff very likely took part in the 7 October 2023 attack on Israel. ==Hidden weapons and tunnels== Multiple times, weapons and tunnels have been found hidden within and underneath UNRWA buildings: * In 2014, UNRWA found rockets hidden in one of its schools in Gaza. * In 2015, a UN inquiry found that Palestinian militant groups used three UNRWA schools for hiding weapons. The inquiry also said that rockets were \"probably\" fired at Israel from these UNRWA buildings. * In 2017, UNRWA found a tunnel under the Maghazi Prep B Boys School, an elementary school for boys in Gaza. UNRWA said that it complained to Hamas about the tunnel. * In 2020, a hand grenade and a military vest were found in one of UNRWA's schools in the Gaza Strip. UNRWA removed the items, and told authorities in Israel and Gaza. The organization claimed that it did not have enough money to guard all its schools, but that it did inspections of its premises to be sure they were only being used for humanitarian purposes. * In 2024, after the Hamas-led October 7 massacre within Israeli territory in 2023, Israeli troops found firearms in the basement of an UNRWA school complex. The school complex also included a mosque and a civilian medical clinic. Weapons hidden under the clinic exploded when the Israeli military was investigating, killing three soldiers. UNRWA chief Philippe Lazzarini denied it, while Israel's 401st Armored Brigade leader Colonel Benny Aharon said that the UNRWA had been clearly aware of it. * The findings of a 2024 investigation by an Israeli non-profit organization called the Institute for Monitoring Peace and Cultural Tolerance in School Education (IMPACT-se) found that Hamas tunnels run beneath two UNRWA schools: Al-Maghazi Boys Preparatory School B and Al-Zaytun A. == UNRWA employees that are part of militant groups == In 2024, during the war between Israel and Gaza, it was found that 24 people who worked for UNRWA were a part of Hamas or Palestinian Islamic Jihad. All of these people worked in education. Most of them were principals, and some were teachers or school counselors. Records that Israel shared with the New York Times showed that sometimes UNRWA let them keep their jobs even after being told that these staff were in militant organizations. People living in Gaza said that it was known that members of Hamas worked at UNRWA, but that it was an \"open secret.\" Some of the militants who worked for UNRWA were Mustafa al-Farra, who taught in Jabalia, Ayman al-Alami, who taught in Khan Younis, and Khaled al-Masri, who is the principal of the elementary school where hidden rockets were found in 2017. In July 2024, Israeli intelligence shared a report with UNRWA that claimed that more than 10% of UNRWA's senior education staff were members of the militant groups Hamas and Palestinian Islamic Jihad. In November 2024, the Institute for Monitoring Peace and Cultural Tolerance in School Education (IMPACT-se) published the results of an investigation that found that twelve UNRWA school principals and deputy principals were active members of terrorist organizations. This included commanders in Hamas. The findings identified the principal of Al- Zaytun Boys Preparatory and Elementary Schools as a squad commander in Hamas’s Gaza City Brigade, and both the principal and the deputy principal of Al- Maghazi Boys Preparatory School B as squad commanders in Hamas’s Khan Yunis Brigade. The UN has said that it has no way to be sure that the people it hires are not members of Hamas or other militant groups. == School textbooks == Textbooks created by UNRWA and used in UNRWA schools have been strongly criticized for hateful, antisemitic content and for encouraging violence. In 2021 a report by an Israeli non-profit organization called IMPACT-se found that school materials created by UNRWA had content that was “rife with problematic content that contradicts stated UN values.” After this report, the head of UNRWA, Philippe Lazzarini, said that these materials had been published by accident. In 2022, another report by IMPACT-se again found that there was content in textbooks created by UNRWA that could fuel violence against Jews and Israelis, and that UNRWA hid the content instead of taking it out. In April 2024, the European Parliament passed a resolution that criticized educational material made by the Palestinian Authority and UNRWA. They said the content of the textbooks was \"problematic and hateful,\" and could cause violence against Israelis. The Parliament stated that it opposed content that was \"encouraging violence, spreading antisemitism and inciting hatred in Palestinian school textbooks, drafted by [European] Union-funded civil servants as well as in supplementary educational materials developed by UNRWA staff and taught in its schools.\" ==October 7 massacre== Nineteen UNRWA staff members have been accused of participating in the Hamas-led October 7 massacre in 2023. The Israeli government also said that 100 more UNRWA employees were also members of Hamas. The United Nations investigated these claims, and found enough evidence that nine UNRWA staff had participated in the October 7 massacre. Those employees were fired. However, there has been widespread denial of the nine staff's participation among those claiming to support Palestine. An elderly Israeli civilian named Ditza Heiman, who was 84 years old when she was abducted during the October 7 massacre, reported during a court testimony that the man who kept her captive was a teacher in an UNRWA school, and that he held her hostage in his home. Because of this possible connection between UNRWA staff and the October 7 massacre, the governments of several countries temporarily stopped funding UNRWA. === Faisal Ali Musalam Naami === Faisal Ali Musalam Naami was an UNRWA social worker. During the October 7 massacre, al-Naami abducted a 21-year-old Israeli man into Gaza. The Israeli government released video footage showing al-Naami loading the Israeli man's limp body into an SUV at Kibbutz Beeri. The SUV was a UN vehicle. The hostage's mother said about al-Naami, “It’s really sick. He’s a social worker, a social worker committing terror and kidnapping a citizen.” She criticized UNRWA for employing a man who behaved in an inhumane way. “A social worker for a so-called humanitarian organization kidnapped my son. How can someone working for an organization that claims to do good in this world do something so cruel and inhumane? How can the UN pay this man who dragged my son’s limp body along the ground and then picked him up as if he was a prize into Gaza. How many more lives have been ruined by this person, hauling my son like he isn’t even a human being into an UNRWA car?” === Fatah Sharif Abu el-Amin === Fatah Sharif was a top Hamas commander who was also an employee of UNRWA and the head of the UNRWA teachers' union in Lebanon. UNRWA came under pressure once it became known that he was a top Hamas commander. UNRWA was criticized for not doing enough to remove Hamas militants from its ranks. In March 2024, UNRWA learned that Sharif was part of Hamas, and suspended him. When Sharif was suspended, his fellow teachers went on strike and demanded that he be allowed to return to his job. Sharif was killed in an Israeli airstrike during the Israel-Hamas war that followed the October 7 massacre. After Sharif's death, the head of UNRWA Philippe Lazarini, denied knowing that Sharif was so high ranking in Hamas. Lazarini said, “The specific allegation at the time was that [he was] a part of the local leadership… I never heard the word commander before. What’s obvious for you today, was not obvious yesterday.” When Sharif died, Hamas praised him for his \"educational and jihadist work\" as \"a successful teacher and an outstanding principal.\" === Muhammad Abu Attawi === Muhammad Abu Attawi was a commander in Hamas who worked for UNRWA as a driver. During the October 7 massacre, Attawi commanded an attack on a bomb shelter near Re’im that involved the killing and kidnapping of people who were hiding in the shelter after fleeing attacking militants. According to the Israel Defense Forces (IDF), Attawi murdered and abducted Israelis during the October 7 massacre. In October 2024, both UNRWA and the IDF confirmed that he was killed. The IDF and the Shin Bet said that Attawi had been employed by UNRWA since July 2022. UNRWA confirmed that Attawi was one of their employees. The agency also confirmed that they had already been told by Israel Attawi was a member of Hamas, but that they did not hear back from Israel when they asked for more information, so they did not take any action. == Lawsuit by victims of October 7 Attack == In June of 2024, UNRWA was sued by victims of the October 7 massacre. More than 100 victims joined the lawsuit. They include a former hostage, survivors of the October 7 massacre, and the estates of some of the people who were killed in the attack. The plaintiffs claimed that for more than 10 years, UNRWA had helped Hamas create what it needed to carry out the attack. The lawsuit states that UNRWA did this in multiple ways, including weapons storage and letting Hamas use schools to position rocket launchers. They said that UNRWA was guilty of \"aiding and abetting Hamas' genocide, crimes against humanity, and torture,\" and that doing this went against international law and also the United States' Torture Victim Protection Act. The lawsuit said that about $1 billion from UNRWA went to Hamas, and that committing the October 7 massacre would have been harder or impossible without this money. The lawsuit also claimed that seven top UNRWA officials had known that Hamas took about $1 billion from UNRWA in order to pay for the weapons and equipment used in the October 7 massacre: Philippe Lazzarini, the commissioner-general of UNRWA; Pierre Krähenbühl, the former head of UNRWA; Leni Stenseth, Sandra Mitchell, and Margot Ellis, who were once deputy commissioners-generals of UNRWA; Greta Gunnarsdottir, the director of the UNRWA New York office; and Filippo Grandi, the U.N. high commissioner for refugees. == Use of UNRWA facilities to hold hostages == British-Israeli hostage Emily Damari, captured during the October 7 massacre, was held hostage by Hamas for 15 months. After she was released, she revealed that during some of that time, she was held at UNRWA facilities. Hamas held her in UNRWA facilities but would not give her medical treatment. As a result, UK Prime Minister Keir Starmer's office said it would consider whether the UK would continue giving $16 million to UNRWA each year. == Report claiming ethical abuses by UNRWA leadership == In 2019, a confidential report written by UNRWA's ethics agency claimed a number of ethical violations by UNRWA's leadership, including \"sexual misconduct, nepotism, retaliation, discrimination or other abuses of authority, for personal gain, to suppress legitimate dissent, and to otherwise achieve their personal objectives.\" The report said that an \"inner circle\" of top UNRWA staff was guilty of these abuses: Commissioner-General Pierre Krähenbühl (Commissioner-General), Sandra Mitchell (Deputy Commissioner-General), Hakam Shahwan (Chief of Staff), and Maria Mohammedi (Senior Adviser to the Commissioner-General). The report said this was \"an enormous risk to the reputation of the UN.\" It also claimed that the work culture at UNRWA had low morale (good feelings), \"distrust, secrecy, bullying, and marginalization,\" and that the organization's management did not function well. Pierre Krähenbühl was accused of giving a job to a woman with whom he had a romantic relationship, and travelling with her on business class flights around the world. The money to fund the role was given by the Swiss foreign ministry from March 2015 to December 2018. Krähenbühl denied the claims in the report, and said he would cooperate with a UN investigation. In November 2019, Krähenbühl resigned from his role. UNRWA's Deputy Commissioner- General, Senior Advisor to the Commissioner-General, and Chief of Staff also left the agency. Because of the report's claims, Switzerland, the Netherlands, and Belgium stopped making donations to UNRWA for a period of time. ==Related pages== * Antisemitism * Disinformation * Palestinian political violence ==References== Category:Palestine Category:Middle East Category:United Nations Category:History of the Middle East",
 "title": "Controversies about UNRWA"
}