{
 "id": "116600",
 "text": "Traditionally, tennis is played between two people in a Singles match, or four players in a Doubles match. However, popular variations allowing play between three players (of which two or three are on the court at any one time) have emerged. ;Singles:in tennis is the body of competition that features individual players competing one-on-one. There are separate singles competitions for men and women. The singles competition exists in counterdistinction to doubles. ;Doubles:one team of two players on each side (four players in total). In this version, gender does not matter. Doubles utilizes a wider court than singles matches. ;Mixed doubles: similar to the doubles game, but this version requires one man and one woman to be a team. ;American doubles:(from the UK) is generally used in training, and plays one player (playing with a singles court layout) versus two players (playing with a doubles court layout). Often the court rotates game by game taking it in turns to play on your own. ;Jordache tennis:is a game played between three players. A normal tennis game takes place between two of the three contestants. Players are awarded 5 points for a game win and the loser is awarded points based on the score achieved: 3 for deuce, 2 for 30 and 1 for 15. The winner remains in. The player replacing the loser gets to choose who serves. The first to 50 wins. Scoring is calculated continuously, so if a player is currently on 49 points at the start of a game they only have to win one point for the game to end. There is a variation invented in 2005, called \"mini-Jordache\", where the winner is the first to 25. ;Wheelchair tennis:has the same thing as both singles and doubles, however, the ball may bounce twice before hitting it, the second bounce may even be outside the field. ;Australian Doubles:is played when one player is significantly better than 2 others. Two players on one side hitting into the singles court while the better player is alone hitting into the doubles court. ;Canadian Doubles: is similar to Australian Doubles, however the single player does not have to be significantly better than the double team. ==Other websites== *http://www.sportsofworld.com/tennis/ *http://www.ballsport2u.com/tennis- games.html Category:Tennis",
 "title": "Types of tennis match"
}