{
 "id": "1166414",
 "text": "Fela Akinse is the first Nigerian inventor who pioneered the use of recycled plastic to design and make modular shoes. He is the Co-founder of Salubata, which repurposes plastic oceanic waste to produce footwear. He is the first person to conceptualise and develop a carbon decomposition shoe technology named Zero Carbon. He won the UK Government’s Department for International Trade (DIT) Hackathon competition, 2019, The British Council Entrepreneurship Award in 2019, the Princeton Africa Pitch 2020 and the Young Green Tech Award (YGT) 2022. ==Early life and education== Fela Akinse was born in Lagos State, Nigeria but hails from Ondo State. Akinse’s passion for the environment led him to study Environmental Toxicology and Pollution Management at the University of Lagos at both Bachelors and Masters levels. Nonetheless, he has always had a keen fascination of the intersection between art and science. ==Career== Fela Akinse founded SALUBATA after he resigned as a business analyst and an environmental scientist in 2017. He originally became interested in combating the issue of plastic waste from the University. His work was featured by Business of Fashion and in 2023, his startup, Salubata was accepted in the Techstars Los Angeles Accelerator. Techstars is a pre-seed investor with a mission to help entrepreneurs succeed. He currently owns two global patents in the United States and Nigeria in repurposing modular shoes from recycled plastic wastes and also for his carbon decomposition technology of shoes which trap atmospheric carbon dioxide and with each step taken, puff out breathable oxygen. He was a member of the delegation to the 2023 World Circular Economy Forum in Helsinki and he is an honorary member of the Institute of Electrical and Electronics Engineers. He has a course, \"The Silicon Valley approach: Sure win investment deck\" on Udemy. ==Speaker== Akinse has been invited to speak on stages including being a panelist at Princeton University, World Economic Forum (Davos conference), Junior Chamber International, African Union Summit, COP28 in Dubai, Lagos Innovates, ChangeNow World event, International Ecomarathon, Waves of Change, EVPA (Impact Week 2022). He is an innovator, business strategist, mentor and motivator. ==Awards and recognition== *Winner of AU YOUTH PAVILLION BIC Africa-AeTrade Business Idea Challenge *Africa 3535 Laureate (2019) Winner of the UUBO Black Friday Pitch Competition (2019) *Winner of the Princeton Africa Pitch 2020. *Winner of Orange Corners Incubation 2020. *Selected as one of the Top 25 Innovators in Africa for the Next Einstein Forum Sciencepreneur Competition 2020. *100 Meaningful Business 2020. *Masschallenge Accelerator 2022. *Global Adaptation Challenge == References == Category:Living people",
 "title": "Fela Akinse"
}