{
 "id": "1166250",
 "text": "Peter Šťastný (born 18 September 1956) is a Slovak-Canadian former professional ice hockey centre and politician. He played parts of 15 seasons in the National Hockey League (NHL). He played for the Quebec Nordiques, New Jersey Devils, and St. Louis Blues. He also played for Slovan Bratislava of the Slovak Extraliga (SVK). Šťastný was very successful during his career. He is the 34th all time in NHL points and was the second-highest goal scorer in the 1980s. He scored a total of 1,239 points in his career. He was inducted into the Hockey Hall of Fame in 1998 and the IIHF Hall of Fame in 2000. He has also been listed as one of the 100 Greatest NHL Players. During his political career, Šťastný was a member of Member of the European Parliament for Slovakia from 2004 until 2014. ==Career== Before playing in the NHL, Šťastný played parts of 5 seasons with Slovan ChZJD Bratislava of the Czechoslovak First Ice Hockey League (TCH). He was not drafted by an NHL team. Gilles Lèger, the director of personnel development for the Quebec Nordiques helped Peter and his brother Anton defect to Canada from Czechoslovakia. They defected because they did not like how their national team was run or their coach. On October 9, 1980, Šťastný made his NHL debut alongside his brother Anton in a 5-5 tie with the Calgary Flames. During the game, Peter also scored his first NHL point, assisting on a Jacques Richard goal. On October 26, Šťastný scored his first NHL goal in a 7-4 loss against the Chicago Black Hawks. On February 20, 1981, both Peter and Anton scored hat tricks in a 9-3 win against the Vancouver Canucks. Peter and Anton set and shared a rookie points record with 8 points in a 11-7 win against the Washington Capitals on February 22. Peter was awarded the Calder Memorial Trophy for Rookie of the Year in 1981. Šťastný played 9 seasons with the Nordiques. He played alongside his brother Peter and they were later joined by their other brother Marián. This made the three brother trio the third in the history of the NHL. During his time with the Nordiques, Peter was also selected for the NHL All-Star Game in 1981, 1982, 1983, 1984, 1986, and 1988. On March 3, 1990, the Nordiques traded Šťastný to the New Jersey Devils in exchange for Craig Wolanin. He played parts of 4 seasons with the Devils. In 1993, he joined the St. Louis Blues. He played 23 regular season games with them over 2 seasons. He retired from playing professional ice hockey in 1995. ==Personal life== Peter is part of the Šťastný family. His brothers Marián and Anton, as well as, sons Yan and Paul all played in the NHL. He became a Canadian citizen during his time with the Nordiques. ==References== == Other websites == * Category:1956 births Category:Living people Category:Anti-communists Category:Calder Trophy winners Category:Canadian ice hockey centres Category:Czechoslovak ice hockey players Category:Hockey Hall of Fame inductees Category:Naturalized citizens of Canada Category:New Jersey Devils players Category:People from Bratislava Category:Quebec Nordiques players Category:Slovak ice hockey centres Category:St. Louis Blues players Category:Slovak politicians",
 "title": "Peter Šťastný"
}