{
 "id": "116605",
 "text": "Valdas Adamkus (born 3 November 1926) is a Lithuanian politician and engineer. He was the President of Lithuania from 1998 to 2003 and again from 2004 to 2009. ==Life== He was born on November 3, 1926, in Kaunas, Lithuania. His birth name was Valdemaras Adamkavičius. In 1951, he married Alma Adamkienė. On 3 January 2025, Adamkus was hospitalized in Vilnius after having heart failure. ==Career== Before entering politics in Lithuania, Adamkus emigrated to the United States, having studied and lived in Chicago and Ohio. In the 1970s, he worked for the United States Environmental Protection Agency, serving as the agency's deputy administrator for the Great Lakes Region. First elected in 1998, he ended his term in office in 2003. When Rolandas Paksas, the new elected president, was impeached and removed by the Lithuanian Parliament in 2004, Adamkus was re-elected. He chose not to run for re- election during the Lithuanian presidential election in 2009. He was succeeded on 12 July 2009 by Dalia Grybauskaitė. Following the end of his term as president, Adamkus remained involved in international development, and a member of the European Academy of Diplomacy. ==References== ==Other websites== * Website of the Lithuanian President Valdas Adamkus * The Official Website of the President of the Republic of Lithuania * Videos of the President of the Republic of Lithuania * 2005 Interview with a Ukrainian journalist * Acknowledgement of lifetime achievements at the US EPA * European Voice – Mister persistent Valdas Adamkus * Institution of the President of the Republic of Lithuania Category:People from Kaunas Category:Presidents of Lithuania Category:1926 births Category:Living people Category:Civil engineers Category:American Roman Catholics Category:American military people Category:American scientists Category:Anti-communists Category:Environmentalists Category:Honorary Knights Grand Cross of the Order of the Bath Category:Ludwig Maximilian University of Munich Category:Order of Merit of the Federal Republic of Germany Category:Politicians from Chicago Category:Recipients of the Decoration for Services to the Republic of Austria Category:Recipients of the Order of the White Eagle (Poland) Category:Recipients of the Order pro merito Melitensi Category:Republicans (United States)",
 "title": "Valdas Adamkus"
}