{
 "id": "1166086",
 "text": "Jodi Nan Hildebrandt (born June 15, 1969) is an American former counselor and YouTuber who was convicted of aggravated child abuse. She co-founded ConneXions, a counseling organization, and collaborated with family vlogger Ruby Franke. ==Early Life and Education== Hildebrandt was born to Jay and Florence (née Haynie) Hildebrandt on June 15, 1969. She grew up in Tucson, Arizona, and attended Canyon Del Oro High School. Raised in a devout Latter- day Saint family, her father served as a pilot in the U.S. Air Force. In 1990, she participated in the Miss Orem pageant. ==Career== In 2005, Hildebrandt became a licensed counselor in Utah. Two years later, she founded ConneXions, a counseling and business organization based in Orem, Utah. In 2012, she served as the director of LifeStar Utah County, focusing on treating pornography and sex addiction. In 2012, Hildebrandt's counseling license was placed on 18-month probation after she disclosed confidential client information to The Church of Jesus Christ of Latter-day Saints and Brigham Young University between 2008 and 2010. Consequently, the church removed her from their Family Services' referral list. In 2022, Hildebrandt partnered with Ruby Franke, a family YouTube vlogger, to launch the ConneXions YouTube channel and the \"Moms of Truth\" Instagram account, offering parenting classes. ==Legal Issues and Conviction== On August 30, 2023, Hildebrandt and Franke were arrested in Washington County, Utah, and charged with six counts of aggravated child abuse involving two of Franke's children. Following her arrest, Hildebrandt surrendered her counseling license pending the outcome of the case. YouTube subsequently banned both Hildebrandt and Franke from the platform. On December 27, 2023, Hildebrandt pleaded guilty to four counts of aggravated child abuse. She was sentenced on February 20, 2024, to four consecutive terms of one to 15 years in prison, resulting in a total sentence ranging from four to 30 years. ==Adaptation== Hildebrandt was portrayed by Heather Locklear in the Lifetime film \"Mormon Mom Gone Wrong: The Ruby Franke Story,\" which aired in October 2024. ==References== * \"Jodi Hildebrandt and Ruby Franke sentenced to 4 consecutive terms in prison.\" February 20, 2024. * \"Miss Orem Hopefuls Prepare for Pageant.\" * Heather May. \"Porn therapist disciplined for telling church, BYU about man.\" * Mattea Bubalo. \"Ruby Franke and 8 passengers: The rise and fall of a parenting influencer.\" BBC News. September 9, 2024. * \"Jodi Hildebrandt agrees to give up counseling license amid child abuse charges.\" January 31, 2024. * Tyler Picotti. \"The Story of Ruby Franke's Chilling Spiral from Popular 'Momfluencer' to Convicted Felon.\" October 3, 2024. Category:Living people Category:1969 births Category:American YouTubers Category:People from Tucson, Arizona",
 "title": "Jodi Hildebrandt"
}