{
 "id": "1166290",
 "text": "{{Infobox settlement | name = Casiguran, Sorsogon | other_name = | native_name = | native_name_lang = | settlement_type = Municipality of Sorsogon province | | image_skyline = Casiguran_simbahan.jpg | image_alt = | image_caption = Parish Church of Casiguran, Sorsogon | image_flag = | flag_size = 120x80px | image_seal = Seal_of_Casiguran,_Sorsogon.png | seal_size = 190x140px | | image_map = Ph_locator_sorsogon_casiguran.png | image_map1 = | pushpin_map = Philippines | pushpin_label_position = left | pushpin_map_caption = Location within the | coordinates = | coor_pinpoint = | | subdivision_type = Country | subdivision_name = Philippines | subdivision_type1 = Region | subdivision_name1 = Bicol Region | subdivision_type2 = Province | subdivision_name2 = Sorsogon | subdivision_type3 = Municipality | subdivision_name3 = 1st district | subdivision_type4 = Barangays | subdivision_name4 = 25 | | established_title = Casiguran | established_date = October 7, 1600 | founder = | seat_type = | seat = | | area_total_km2 = 87.13 | elevation_m = | elevation_max_m = 162 | elevation_min_m = 0 | elevation_max_rank = | elevation_min_rank = | elevation_footnotes = | elevation_max_footnotes = | elevation_min_footnotes = | | timezone = Philippine Standard Time | utc_offset1 = +8 | timezone1_DST = | utc_offset1_DST = | | postal_code = 4702 | area_code_type = IDD : area code | area_code = +63 (0)56 | iso_code = | website = cmci.dti.gov.ph LGU=Casiguran | footnotes = }} Casiguran is a coastal municipality of Sorsogon province in the Bicol Region of the Philippines. The name is conjectured to derive from Gugurang,Espinas, M. (1996). The Ibalong : The Bikol Folk Epic-fragment. Manila: University of Santo Tomas Publishing House. after the deity of the indigenous Ibalon peoples of Bicol.Prado, M. G. (1981). Ibalon : Ethnohistory of the Bikol Region. Legazpi City: AMS Press. The settlement was Christianized by Augustinian missionaries in the 1570s.Reyes, J. C. (January–February 1979). The Ibalen Epic - A Window to Bicols Pre-history. Boletin Eclesiastico de Filipinas v. 53 nos. 590-591, pp. 61-92. ==History== In 1583, the Franciscan missionaries took over the evangelization work started by the Augustinians. Casiguran became Sorsogon's first missionary parish in 1600, when it was identified as a regional center.Dery, L. C. (1991). From Ibalon to Sorsogon : A Historical Survey of Sorsogon Province to 1905. Quezon City: New Day Publishers. The coastal town has a flat to gradually sloping terrain, with farming and fishing as the main sources of livelihood. The water supply system of Casiguran was constructed in 1932 thru a grant from the U.S government. Today, the Casiguran Water District manages the municipality's fresh water supply and coastal cleaup. In 1978, a heritage burial site was excavated in Barangay Escuela of Casiguran that unearthed pre-colonial earthenware and muti-colored whole pieces of flat-round glass beads. ==Gugurang Festival== Before being colonized, the region had an ancient religious system of deities. Gugurang, the \"god of Good\" who dwells inside of Mount Mayon is the guardian and protector of the sacred fire — which Asuang, his brother, tries to steal. When displeased, Gugurang would cause Mayon Volcano to erupt, but the lava also made the surrounding lands fertile. At some point, the name Ibalong was also used by the Spanish to refer to the entire Bicol Peninsula and, to some extent the entire island of Luzon.Abella, D. (1954). Bikol Annals: A Collection of Vignettes of Philippine History. Manila. Ancient Bikolanos performed a ritual called Atang to appease the volcano god, that becomes a festival. Casiguran, Sorsogon holds the Gugurang Festival annually in October to celebrate Gugurang, the ancient god of Bicol. Casiguran, Sorsogon at sunset.jpg Mayon Volcano eruption at Daraga Church.jpg ==Casiguran Fish Port == Casiguran Port, Plaza Escudero is Casiguran's fish port where small to medium-sized vessels dock from the waters of Sorsogon Bay — for their fresh catch to be landed, processed, stored and distributed, serving the municipality's vital fishing industry and local economy. It is also known for the port's sunset view overlooking the bay area. ==Barangays== Casiguran is politically subdivided into 25 barangays. Each barangay consists of puroks (districts) and some have sitios (sites, or locations). * Adovis (Poblacion) * Boton * Burgos * Casay * Cawit (Poblacion) * Central (Poblacion) * Colambis * Escuela | * Ponong * Inlagadean * Lungib * Mabini * Ponong * Rizal * San Antonio * San Isidro * San Juan | * San Pascual * Santa Cruz * Somal-ot (Poblacion) * Gogon * Tigbao * Timbayog (Poblacion) * Tiris * Trece Martires * Tulay (Poblacion) ---|---|--- ==References== ==Other websites== * Sorsogon Attraction Map * Gugurang Festival Video * Local Government Unit * Satellite Map Category:Sorsogon Category:Settlements in the Philippines Category:Ports and harbours of the Philippines",
 "title": "Casiguran, Sorsogon"
}