{
 "id": "1166455",
 "text": "First Lady of Colombia (First Lady of the Nation) is the title and role held by the hostess of the Casa de Nariño. This is usually the wife of the president of Colombia, during the president's term in office. Verónica Alcocer is the current first lady of Colombia, in role since August 2022 as the wife of President Gustavo Petro. == Origins and role == The first lady is not elected by the people of Colombia. There are no official jobs she is officially required to perform and she is not paid for being the first lady. The first lady is often involved in political campaigns and managements of the Casa de Nariño and participate in social causes. They also represent the president at official and ceremonial occasions and accompany the president on foreign summits and events. == Office of the First Lady == According to the Colombian legal system, the first lady is a private citizen, which prevents her from having her own office and staff. Therefore, since 1994 the office has been without functions although it continues to exist in a ceremonial manner. == Causes and initiatives == Since the 1930s, several first ladies have stood out for being promoters of social issues that have no interference in the country's political area. A staff supports her agenda. * María Teresa Londoño; Collections to the Colombian troops in the Colombo-Peruvian War * María Michelsen de López; Orphans' rights * Lorenza Villegas de Santos; Public health care * Bertha Hernández de Ospina; Women's rights and civil rights * Cecilia de la Fuente de Lleras; Child malnutrition and orphans' rights * Cecilia Caballero Blanco; Illegitimate child's rights * Nidya Quintero Turbay; Care in natural disasters * Nohra Puyana de Pastrana; Charity and care in natural disasters * Ana Milena Muñoz de Gaviria; Education and culture * Lina Moreno de Uribe; Women's reproductive health care * María Clemencia de Santos; Medical care for children * María Juliana Ruiz; Child malnutrition == References == Category:Politics of Colombia",
 "title": "First Lady of Colombia"
}