{
 "id": "1166189",
 "text": "Kurtis Gabriel (born April 20, 1993) is a Canadian former professional ice hockey right winger. He played parts of 5 seasons in the National Hockey League (NHL). He played for the Minnesota Wild, New Jersey Devils, San Jose Sharks, and Chicago Blackhawks. ==Career== Before playing in the NHL, Gabriel played parts of 4 seasons with the Owen Sound Attack of the Ontario Hockey League (OHL). With the Attack, Gabriel was named Attacker of the Week and as the alternate captain of the Attack. He was drafted 81st overall by the Minnesota Wild in the 2013 NHL entry draft. On March 3, 2014, Gabriel signed a three-year entry-level contract with the Wild. He was sent down and played most of his time with their AHL-affiliate Iowa Wild. On November 10, 2015, Gabriel made his NHL debut in a 5-3 win against the Winnipeg Jets. He was sent back down to Iowa the next day. On April 18, Gabriel was called back up and made his Stanley Cup playoffs debut in a 5-3 loss in Game 3 to the Dallas Stars. The Stars eventually eliminated the Wild four game to two. On December 7, 2016, Gabriel recorded his first NHL point, assisting on a Chris Stewart goal in a 3-2 win against the Toronto Maple Leafs. On July 10, 2017, Gabriel signed a one-year contract to stay with the Wild. On July 2, 2018, Gabriel signed a one-year, two-way contract with the New Jersey Devils. He was sent down to play with their AHL-affiliate Binghamton Devils. He was recalled to play for New Jersey and became the first player in the NHL to play a game while using Pride Tape. On February 21, 2019, Gabriel scored his first NHL goal in a 4-0 against the Ottawa Senators. On July 1, 2019, Gabriel signed a one-year, two-way contract with the Philadelphia Flyers. He only played for their AHL-affiliate Lehigh Valley Phantoms and was their ambassador for the You Can Play project. On November 2, 2020, Gabriel signed a one-year, two-way contract with the San Jose Sharks. On March 23, 2021, Gabriel along with head coach Bob Boughner were fined $3,017.24 for a cross-check to a Los Angeles Kings player during warm-ups. He was named as a finalist for the King Clancy Memorial Trophy for leadership qualities on and off the ice. The award was won by P. K. Subban. On July 28, 2021, Gabriel signed a one-year, $750,000 contract with the Toronto Maple Leafs. He only played 13 games with their AHL- affiliate Toronto Marlies. On December 9, 2021, the Maple Leafs traded Gabriel to the Chicago Blackhawks in exchange for Chad Krys. He played 2 games with them until being sent down to their AHL-affiliate Rockford IceHogs. He played 39 games with them. On September 19, 2022, Gabriel announced that he was retiring from playing professional ice hockey. ==References== == Other websites == * Category:1993 births Category:Living people Category:Canadian ice hockey right wingers Category:Chicago Blackhawks players Category:Ice hockey people from Ontario Category:Iowa Wild players Category:Lehigh Valley Phantoms players Category:Minnesota Wild players Category:New Jersey Devils players Category:Sportspeople from Newmarket, Ontario Category:San Jose Barracuda players Category:San Jose Sharks players Category:Toronto Marlies players",
 "title": "Kurtis Gabriel"
}