{
 "id": "1166001",
 "text": "is a manga series written and illustrated by Kiyohiko Azuma. It has been published in the monthly magazine Dengeki Daioh of ASCII Media Works since January of 2003. It has been collected into 15 tankōbon volumes. It depicts the daily adventures of a young girl named Yotsuba as she learns about the world around her, guided by her adoptive father, neighbors, and friends. Various characters in Yotsuba&! were previously featured in Azuma's one-shot manga \"Try! Try! Try!\". The term \"Yotsuba to\" means \"Yotsuba and,\" which is reflected in the chapter titles, many of which are formed as \"Yotsuba and [something].\" The manga was licensed for English-language distribution by ADV Manga, which released five volumes from 2005 to 2007. Volume six was originally scheduled to be released in February 2008, but was indefinitely delayed. ==Plot== Yotsuba&! focuses on Yotsuba Koiwai, a five-year- oldInitially, she claims to be six years old, but this is corrected by her father in chapter 36: girl who is energetic, cheerful, curious, odd, and quirky, so much so that even her own father calls her unusual. She is ignorant about many things that a child her age should already know, such as doorbells, escalators, air conditioners, and even playground swings.Doorbells: chapters 2 and 4; escalators: chapter 5; air conditioners: chapter 3; swings: chapter 1; in Her naïveté is the basis for the humorous stories where she learns about and often misunderstands everyday things. ==Development== In 1998, Azuma released a one-shot manga and two webcomics titled \"Try! Try! Try!\" in which Yotsuba's father, Yousuke Koiwai, Ena, Fūka, and Asagi were they first appeared. ==Media== ===Manga=== The manga is written and illustrated by Kiyohiko Azuma and published by ASCII Media Works in the monthly shounen manga magazine Dengeki Daioh since the March 2003 issue, with ongoing serialization. Chapters have been compiled into fifteen tankōbon volumes. The manga has been widely praised by critics and audiences for Azuma's artistic skills, writing, and his creation and development of the titular character. It has won several awards and received numerous nominations. In English, Yotsuba&! was originally licensed by ADV Manga, which published five volumes from 2005 to 2007 before discontinuing the license. The North American license was later acquired by Yen Press, which reprinted the first five volumes along with the sixth in September 2009. Fourteen volumes have been released since then. The series is licensed in the following countries as well: Country Publisher Malaysia Kadokawa Gempak Starz France Kurokawa Spain Norma Editorial Germany Tokyopop Germany Italy Dynit Sweden B. Wahlström Finland Punainen jättiläinen South Korea Daewon C.I. Taiwan Kadokawa Corporation Russia Palma Press Vietnam TVM Comics Poland Kotori Indonesia Elex Media Komputindo Thailand NED Comics ===Anime=== An anime spin-off based on cat versions of Azuma's character Danbo titled Nyanbo! was announced and began airing on September 26, 2016 as part of a “mini anime” program. This project did not adapt any of the Yotsuba&! manga. It was broadcast in Japan on NHK-E and simulcasted overseas on Crunchyroll. Despite the manga's popularity and the success of Azumanga Daioh, no announcements have been made regarding an anime adaptation for Yotsuba&!. In an entry on his website from May 15, 2005, Azuma stated that there were currently no plans to animate the manga. He reiterated this on December 5, 2008, stating that the stories and style of Yotsuba&! are not well-suited for animation. ==Reception== Yotsuba&! is illustrated in a full-page format, unlike the vertical four-panel strips in Azuma's earlier series, Azumanga Daioh. This gave him more artistic scope. Azuma's work on Yotsuba&! is known for its clean art, detailed backgrounds, and expressive facial expressions. He is highly praised for his joyous tone, slice-of-life storytelling, comedic writing, and eccentric yet realistic characters, especially Yotsuba herself. == References == ==Other websites== ; Official websites * ASCII Media Works website * Yotsuba Studio, Kiyohiko Azuma's studio website * * Yen Press website ;Other * * Yotsuba&! Exhibit in Tokyo Station",
 "title": "Yotsuba&!"
}