{
 "id": "1166751",
 "text": "Manila Bay is a natural harbor that serves the Port of Manila (on Luzon), in the Philippines. Strategically located around the capital city of the Philippines, Manila Bay facilitates commerce and trade between the Philippines and its neighboring countries.Jacinto, G.S., Azanza, R.V., Velasquez, I.B. and Siringan, F.P.(2006).\"Manila Bay:Environmental Challenges and Opportunities\" in Wolanski, E.(ed.) The Environment in Asia Pacific Harbours. Springer: Dordrecht, Netherlands. p309-328. It is effectively the gateway for the country's socio-economic development that began in ancient times. ==Geography== Manila Bay has an area of , and a coastline of . It is situated in the western part of Luzon island, and is bounded on the east by and Metro Manila and the province of Cavite; on the north by the provinces of Bulacan and Pampanga; and on the west and northwest by Bataan province.Jacinto, G.S., Velasquez, I.B., San Diego-McGlone, M.L., Villanoy, C.L. and Siringan, F.B.(2006).\"Biophysical Environment of Manila Bay - Then and Now\", in Wolanski, E.(ed.)The Environment in Asia Pacific Harbours. Springer: Dordrecht, Netherlands. p. 293-307. Manila Bay drains approximately of watershed area, with the Pampanga River contributing about 49% of the freshwater influx. With an average depth of , it is estimated to have a total volume of 28.9 billion cubic meters (28.9 cubic km). Passage into Manila Bay is wide and expands to a width of . This varies sometimes from at its mouth and expands to at its widest point. The islands of Corregidor and Caballo divide the Bay's entrance into two channels, about towards the North and wide on the South side. The municipality of Mariveles in the northside province of Bataan, is an \"anchorage\" at the Bay's northern entrance. On either side of the bay are volcanic peaks topped with tropical foliage: 40 km to the north is the Bataan Peninsula and to the south is the province of Cavite. Local and international ports in the bay's North and South harbors facilitate much of the country's maritime activities. The North Harbor, being smaller, is used for inter-island shipping, while the larger South Harbor is used for ocean- going vessels. ==Land conversion== The land conversion of mangrove and mudflat areas into fishponds impacted the physical features of the bay, such that what was an irregular shoreline in 1944 became linear in 1977. Shoreline retreat continued as man-made structures such as fish pens occupied the coastal areas, with \"progradation\" being dominant from 1977 to 1991. Most areas of the bay, other than those near the harbors were fishing grounds, with fisheries and aquaculture as the dominant livelihood for the coastal inhabitants. From 1990, approximately 1,200 hectares of mangroves were cleared, with the land converted for aquaculture or used as salt beds.PEMSEA. (2004) Manila Bay: Refined Risk Assessment. PEMSEA Technical Information Report No. 2004/01. Global Environment Facility / United Nations Development Programme / International Maritime Organization Regional Programme on Building Partnerships in Environmental Management for the Seas of East Asia (PEMSEA). Quezon City, Philippines. In 1993 much of the fisheries resources steadily declined due to overfishing and overharvesting. ==Beach nourishment== In the early September 2020, rehabilitation work began on Manila Bay Beach, through the process of \"beach nourishment\", a common practice in the creation of beaches around the world. However, the program came under criticism by heritage conservationists and environmentalists for the use of crushed dolomite for beachfront nourishment. Rehabilitation activities continued despite the criticism, as the Bay's seawater quality significantly improved, especially pronounced along the shoreline. The country's Department of Environment and Natural Resources reported a significant drop of fecal coliform level in the waters around the beach, from 2.2 million mpn/100ml last January 4, 2021 to 523,000 mpn/100 ml in February 2021, based on the average count from three monitoring stations. ==References== Category:Bays of the Philippines Category:Ports and harbours of the Philippines",
 "title": "Manila Bay"
}