{
 "id": "116752",
 "text": "The Palestine Liberation Organization (PLO) is a political group that advocates for the creation of a state for the Palestinian people. The group was created in 1964. It represents Palestinians in diplomatic relations to other countries.United Nations General Assembly Resolution 3236. \"Having heard the statement of the Palestine Liberation Organization, the representative of the Palestinian people, …\"Kim Murphy. \"Israel and PLO, in Historic Bid for Peace, Agree to Mutual Recognition,\" Los Angeles Times, 10 September 1993. It has held observer status at the United Nations since 1974.United Nations General Assembly Resolution 3210. \"Invites the Palestine Liberation Organization, the representative of the Palestinian people, to participate in the deliberations of the General Assembly on the question of Palestine in plenary meetings.\" Since the First Intifada, it has ran the Palestinian National Authority (PNA). Founded as a result of the oppression of the State of Israel against the Palestinian people, the PLO defended themselves by trying to liberate the Palestinian territories. It was initially founded by Ahmad Shukeiri in 1964, but thrived under the leadership of Yasser Arafat from 1969 to 2004. Under Arafat, Fatah became the largest faction of the PLO. The group became involved in Black September, the Lebanese Civil War, the First Intifada, and the Second Intifada during the Arafat years. After the First Intifada, the PLO and Israel signed the Oslo Accords, creating the PNA and transitioning the PLO into a political party. Arafat died during the Second Intifada, causing Mahmoud Abbas to become the current leader. Since the Second Intifada, Fatah has maintained control over the PLO and the group has largely avoided violent combat. The Israel Defense Forces (IDF) sometimes clash with the PLO during incursions into the West Bank, although no official war has been declared. The Popular Front for the Liberation of Palestine (PFLP) and the Democratic Front for the Liberation of Palestine (DFLP), minor factions of the PLO, went to war with Israel in 2023, but it does not represent the majority consensus of the group. == Notes == == References == Category:Politics of Palestine Category:Palestinian nationalism Category:Nationalist organizations in Palestine Category:1964 establishments in Asia Category:Arab–Israeli conflict Category:National liberation movements Category:Fatah Category:Popular Front for the Liberation of Palestine Category:Democratic Front for the Liberation of Palestine Category:Anti- Zionism Category:Social democracy",
 "title": "Palestine Liberation Organization"
}