{
 "id": "1167993",
 "text": "The Xiaomi 13, Xiaomi 13 Pro, Xiaomi 13 Ultra and Xiaomi 13 Lite are flagship Android smartphones developed and made by Xiaomi. They were announced on December 11, 2022 in worldwide. They were released on December 14, 2022 in worldwide. The phone runs android 13 with MIUI 14, they can upgrades to other versions like Android 14 with HypeOS 1.0 and Android 15 with HypeOS 2.0. == Features == === Hardware === The Xiaomi 13 has a 6.36 inch screen size, AMOLED display, 120hz refresh rate screen, Coring Gorilla Glass 5, 1900nits (peak), 1200nits (HBM), IP68 water and dust light resistant, 10MP telephoto rear camera, 12MP ultrawide rear camera, 8K 26fps (HDR) video recording rear camera, Qualcomm Snapdragon 8 gen 2 chipset, Adreno 740 GPU, 4500mAh battery capacity, 50MP wide rear camera, 128GB, 256GB and 512GB storage options, 8GB and 12GB RAM and 32MP selfle camera. The Xiaomi 13 Lite has a 6.55 inch display, AMOLED display, 1000 nits (peak), 50MP wide rear camera, 4500mAh battery capacity, 8GB RAM, 67W wired charger, 120hz refresh rate screen, Qualcomm Snapdragon 7 gen 1 chipset, 128GB and 256GB storage options, 8MP ultrawide rear camera, 2MP marco rear camera, in screen fingerprint scanner, NFC works, 8MP depth selfle camera and 32MP ultrawide selfle camera. The Xiaomi 13 Pro has a 6.73 inch screen size, LTPO AMOLED display, 4820mAh battery capacity, 8GB and 12GB RAM, 50MP telephoto and ultrawide rear camera, 50.3MP wide rear camera, Qualcomm Snapdragon 8 gen 2 chipset, Adreno 740 GPU, 128GB, 256GB and 512GB storage options, 32MP selfle camera, 120hz refresh rate, 120W wired charger, 50W wireless charger, 10W reverse wireless charger and In screen fingerprint scanner. The Xiaomi 13 Ultra has a 6.73 inch screen size, LTPO AMOLED display, 5000mAh battery capacity, Qualcomm Snapdragon 8 gen 2 chipset, 12GB and 16GB RAM, 256GB, 512GB and 1TB storage options, 50MP wide, ultrawide and telephoto rear camera, 32MP wide selfle camera, 1080P 30fps and 60fps video recording selfle camera, 8K 24fps video recording rear camera, 4K 24fps, 30fps and 60fps video recording rear camera, NFC works, 90W wired charging, 50W wireless charging, in screen fingerprint scanner, 120hz refresh rate display, 1300 nits (HBM) and 2600 nits (peak). === Software === The Xiaomi 13 series runs Android 13 with MIUI 14 for first launch. The Xiaomi 13 series can upgrade to the other version like Android 14 with HypeOS 1.0 and Android 15 with Xiaomi HypeOS 2.0 were came out. == References == == Other websites == * (Xiaomi 13) * (Xiaomi 13 Pro) * (Xiaomi 13 Ultra) * (Xiaomi 13 Lite) Category:Mobile phones introduced in 2022 Category:Mobile phones with 4K video recording Category:Xiaomi mobile phones Category:Mobile phones with multiple rear cameras Category:Mobile phones with 8K video recording",
 "title": "Xiaomi 13"
}