{
 "id": "1167129",
 "text": "Moe Aung (; ; born 1966) is a Burmese naval officer. He was the Commander-in- Chief of the Myanmar Navy from 2021 to 2024. In January 2024, he became National Security Advisor to the State Administration Council (SAC). == Early life and education == Moe Aung was born on 4 April 1966 in Myanmar (formerly Burma). He studied at the Defence Services Academy (DSA) and graduated from the 28th intake. His father, Aung Thaung, was a politician and businessman in Myanmar. His family owns United Amara Bank (UAB) and has major business interests in Myanmar. As Commander-in-Chief, Moe Aung has overseen significant modernization efforts within the Myanmar Navy. His leadership has facilitated the acquisition of advanced naval assets, including new submarines, which have been crucial in enhancing Myanmar’s maritime defense capabilities. == Military career == Moe Aung held several positions in the Myanmar Navy before becoming Commander-in-Chief in 2021. As leader of the Navy, he worked on modernizing naval forces and acquiring new submarines. He also built stronger ties with India and Russia for military cooperation. On 8 January 2024, he was appointed National Security Advisor to the SAC, replacing Lieutenant General Yar Pyae. His former Chief of Staff, Zwe Win Myint, was promoted to Commander-in-Chief of the Navy. Moe Aung is also a member of Myanma Economic Holdings Limited (MEHL) and Myanmar Economic Corporation (MEC), two military-owned companies. In 2022, the European Union (EU) imposed sanctions on him and these businesses for their role in Myanmar’s military actions. == Personal life == Moe Aung is married to Aye Khine Nyunt. They keep a private life away from public attention. In his role as National Security Advisor, Moe Aung oversees the formulation and implementation of Myanmar’s national security policies and coordinates defense strategies. == Related pages == * Tatmadaw * 2021 Myanmar coup d'état == References == == Other websites == * Myanmar Navy Official website Category:1966 births Category:Living people Category:Burmese generals Category:Current national leaders Category:Pages created with the Article Wizard from 2025",
 "title": "Moe Aung"
}