{
 "id": "1167078",
 "text": "William Peter Charles Ospreay (born 7 May 1993) is an English professional wrestler. He currently wrestles for All Elite Wrestling (AEW). Ospreay has also competed in Progress Wrestling, Revolution Pro Wrestling (RevPro), New Japan Pro-Wrestling (NJPW), Ring of Honor (ROH), and Impact/Total Nonstop Action Wrestling. He has also competed on the independent circuit for Pro Wrestling Guerrilla (PWG) and many other promotions. Ospreay has won many Championships in many different companies. In AEW, he is a two-time AEW International Champion. In New Japan, he is a IWGP one-time World Heavyweight Championship, two-time IWGP United States Heavyweight Champion, three-time IWGP Junior Heavyweight Champion, one-time NEVER Openweight Champion, the winner of the 2021 New Japan Cup, and the winner of both the 2016 and 2019 Best of the Super Juniors tournaments. ==Career== ===All Elite Wrestling=== On 8 June 2022, Ospreay made his first appearance on AEW television when he along with his Aussie Open teammates Aaron Henare, Kyle Fletcher, and Mark Davis attacked FTR and Trent Beretta on Dynamite. Ospreay was still signed to New Japan Pro-Wrestling (NJPW) at this time. He made his AEW in-ring debut on the 10 June episode of Rampage, teaming with Davis and Fletcher in a loss to Beretta and FTR. At Road Rager, Ospreay made his AEW singles debut, defeating Dax Harwood. After the AEW World Trios Championship was announced, Aussie Open entered the tournament to crown the first champions. They defeated Death Triangle in the first round but eventually lost to The Elite in the Semi Finals. Ospreay then left before returning to AEW on the 14 June 2023 episode of Dynamite and attacking Kenny Omega. He went on to defeat Omega at Forbidden Door. Ospreay went on to defeat Chris Jericho at All In in front of his hometown crowd in London. At Full Gear, AEW president Tony Khan announced that Ospreay had signed a contract to become the newest member of the AEW roster. At Revolution, Ospreay had his first match as a contracted AEW wrestler, defeating his Don Callis Family stablemate Konosuke Takeshita. Ospreay defeated Bryan Danielson in a \"dream match\" at Dynasty. The match was very well received by both critics and fans. Dave Meltzer of the Wrestling Observer Newsletter gave the match six and a half stars, the second highest rating he's ever given a match. It has been called one of the greatest professional wrestling matches of all time. On the 24 April episode of Dynamite, Ospreay won a Casino Gauntlet Match to become number one contender for the AEW International Championship. At Double or Nothing, Ospreay defeated Roderick Strong to become the AEW International Champion. It was his first championship in AEW. On the 29 May episode of Dynamite, Ospreay won another Casino Gauntlet Match to become the number one contender for the AEW World Championship. At Forbidden Door, Ospreay challenged Swerve Strickland for the AEW World Championship but lost. At Dynamite 250, Ospreay lost his AEW International Championship to MJF. At All In, Ospreay defeated MJF to win the International Championship for a second time. He lost to championship to Konosuke Takeshita in a three-way match also involving Ricochet at WrestleDream. Ospreay the entered the Continental Classic tournament. He defeated Juice Robinson, Claudio Castagnoli, Brody King, and Kyle Fletcher on his way to the finals. He lost in the finals to Kazuchika Okada at Worlds End. ==Personal life== Ospreay has dyslexia, Attention deficit hyperactivity disorder (ADHD), and believes he is autistic. == References == ==Other websites== * Category:1983 births Category:Living people Category:All Elite Wrestling people Category:English professional wrestlers Category:People on the autism spectrum Category:People with dyslexia Category:Sportspeople from London",
 "title": "Will Ospreay"
}