{
 "id": "1167387",
 "text": "Mike Smith is a Canadian actor, comedian, screenwriter, and singer-songwriter. He is best known for his role as Bubbles in the mockumentary Trailer Park Boys. He has acted in movies, television, and voice acting. Before acting, Smith started playing music. Early on, he was a member of Sandbox. The band was signed to EMI and Nettwerk. They saw success in Canada, having their songs played multiple times on MuchMusic and were nominated for Best New Group at the 1997 Juno Awards.\"Female artists garner most nominations in annual Juno race\". Vancouver Sun, February 1, 1996. Smith has also played in the band Bubbles & the Shit Rockers as his character Bubbles. He played with the likes of Alex Lifeson of Rush and Tom Wilson, as well as, American rock band Guns N' Roses during their Chinese Democracy Tour. Smith said that he made up the character Bubbles while he was goofing off in the locker room when he was playing ice hockey to entertain his teammates. He showed television producer Mike Clattenburg who he said loved it and gave the character the name Bubbles. Smith appeared as the character in the short film The Cart Boy but the character's name was Darren. The Cart Boy served as the pitch for Showcase who picked up the Trailer Park Boys for their first season and renamed his character Bubbles. Smith has also appeared in the season 3 episode of Archer titled \"The Limited\" along with his Trailer Park Boys castmates. On July 4, 2013, Smith, John Paul Tremblay, and Robb Wells bought the rights to Trailer Park Boys and revived the series through their website SwearNet. Seasons 8 to 12 were broadcast exclusively on Netflix. ==References== ==Other websites== * Category:Living people Category:Actors from Halifax, Nova Scotia Category:Canadian comedians Category:Canadian movie actors Category:Canadian rock guitarists Category:Canadian screenwriters Category:Canadian television actors Category:Canadian television writers Category:Canadian voice actors",
 "title": "Mike Smith (actor)"
}