{
 "id": "1167460",
 "text": "Charles II (6 November 1661 — 1 November 1700) was the King of Spain from 1661 to 1700. He is also known as the Bewitched (Spanish: El Hechizado). He was the last ruler of the (Spanish) Habsburgs, which ruled from 1516, he didn't have any children from the Habsburg inbreeding which ended his line. He death caused the War of the Spanish Succession. He was the son of Philip IV, King of Spain and his second wife Mariana of Austria, the daughter of Ferdinand III, Holy Roman Emperor and Philip's younger sister Maria Anna. ==Personal details== Charles was born on 6 November 1661. He was the only surviving son of King Philip IV of Spain and his niece and second wife Mariana. Whereas marriage with the extended family was (then) common, the Spanish and Austrian Habsburgs were unusual in the extent to which they followed this practice. Of eleven marriages from 1450 to 1661, the extremely big majority contained some element of consanguinity, Philip and Mariana being one of the two unions between uncle and niece. This policy may also have been driven by limpieza de sangre or \"blood purity\" rule/law enacted (passed by law) in the early 1500s, which remained in use until the 1860s. Inter-marriage (Inbreeding) made it easier to notice the so-called 'Habsburg jaw', a physical characteristic common in both Spanish and Austrian Habsburgs. One contemporary reported this was so pronounced in Charles that he swallowed his food without thoroughly chewing, leading to frequent stomach problems. A 2019 study based on an analysis of Habsburg portraits concluded this feature was likely due to a recessive trait, but in the absence of genetic material such claims remain guessing. The accurate cause of Charles' ill-health remains disputed. Based on an analysis of modern accounts, some modern researchers argue they may have been due to one or more autosomal (the gene in question is located on one of the numbered, or non-sex, chromosomes recessive disorders), others suggest an herpetic infection incurred as an infant, causing hydrocephalus. Consistent with either theory, neither his elder sister, Margaret Theresa of Spain, nor his niece, Maria Antonia, daughter of the marriage of Margaret Theresa of Spain to her maternal uncle Leopold I, had similar health issues. After his birth, he was entrusted to the royal governess Mariana Engracia Álvarez de Toledo Portugal y Alfonso-Pimentel. Under her careful supervision, he survived childhood attacks of measles, chickenpox, rubella and smallpox, any one of which was then fatal. He also had rickets, which left him unable to walk unaided until he was four and to wear leg braces until the age of five. Suggestions that he was largely uneducated until his teens appear to be incorrect; Ramos del Manzano, a professor at the University of Salamanca and legal expert, was appointed his tutor when he was six. From the age of 12, he received lessons in music from Juan del Vado, and in mathematics by Jose Zaragoza, Professor at the Colegio Imperial de Madrid. The extent of his physical and mental disabilities is hard to assess (judging or forming an opinion about something), since little is known for certain, and many claims either unproved or incorrect. While suffering from illnesses, he was extremely active physically, and contemporaries (modern) reported he spent much of his time hunting. One often cited example of his alleged mental incapacity is the period he spent sleeping with his father's disinterred body; this was in fact done under instructions from Mariana, whose doctors advised this would help him produce an heir. Although reputedly (what people say) subject to bouts of depression, his participation in government and reports from his council and foreign observers such as the French ambassador Jean-Baptiste Colbert, Marquess of Torcy, indicate his mental capacities remained intact. A report from 1691 submitted by an envoy from the Sultan of Morocco, relates that he was received by Charles himself, who played a full part in the discussions. Costanzo Operti, a Savoyard diplomat who held regular audiences with Charles during the Nine Years' War, described him as friendly and generous but shy and lacking self-confidence, characteristics noted by other foreign diplomats. ==Reign== Since Charles was a legal minor when Philip died on 17 September 1665, Mariana was appointed Queen Regent by the Council of Castile. The Spanish Empire remained an enormous global confederation, but its economic supremacy was increasingly challenged by the Dutch Republic and England, and its position in Europe less safe by the expansionist (territorial or economic) policies of Louis XIV of France. Her ability to respond effectively to the challenges facing the Empire was difficult by an ongoing power struggle with John Joseph of Austria, hereafter referred to as Don Juan, Charles's older, illegitimate half-brother. In addition, passing (law) essential reforms was complicated since Spain was a personal union between the Crown of Castile and Crown of Aragon, each with very distinct political cultures and traditions. Infighting between those who ruled in Charles's name during his regency did little to help, but it is debatable how far they can be held responsible for long-term trends predating his reign. The monarchy proved remarkably strong enough to deal with stuff, and when Charles died, remained largely intact. However, government finances were in continuing crisis, the Crown declaring bankruptcy nine times between 1557 and 1666, including 1647, 1652, 1662, and 1666. Following the policy established by her husband Philip, Mariana ruled through a \"valido\", the first being her personal confessor and fellow Austrian, Juan Everardo Nithard. His most urgent task was to end the costly wars with France and Portugal, achieved in the 1668 treaties of Aix-la- Chapelle and Lisbon. Despite acknowledging their needs, Don Juan forced Mariana to dismiss Nithard in February 1669, who replaced him with Fernando de Valenzuela. He was a member of the lower hidalgo class, so his appointment was deeply resented by the Grandees who normally filled such positions. In 1673, Spain was drawn into the Franco-Dutch War, placing additional strain on the economy, and Don Juan renewed efforts to remove Mariana as Regent. A month before Charles became a legal adult on 6 November 1675, he indicated his intention to take control of government, supported by his brother. When the Regency Council requested a two-year extension of their office on 4 November, Charles initially refused, but was later pressured into accepting. He was also forced to issue a Royal Decree ordering Don Juan to leave Madrid. Don Juan finally gained control of the government in January 1678 and exiled Valenzuela to the Philippines. His first action was to make peace with France in the 1678 Treaties of Nijmegen, with Spain giving land like Franche-Comté and areas of the Spanish Netherlands returned in 1668. Seeking to minimise future conflict between the two countries, in August 1679 Don Juan brokered a match between Charles and the 17-year-old Marie Louise of Orléans, eldest niece of Louis XIV and daughter of Philippe I, Duke of Orléans. Arranging the marriage was Don Juan's last significant act; he died shortly before it took place in November 1679. In February 1680, Juan Francisco de la Cerda, 8th Duke of Medinaceli became the new valido. He clashed with Marie-Louise over the alleged influence exerted over her by the French ambassador, Pierre de Villars, who was expelled from Madrid in 1681, badly affecting the relationship between the two. Medinaceli was further undermined by economic problems and the loss of Luxembourg following the 1683 War of the Reunions. In June 1684, he sought to bolster his support by appointing the Count of Oropesa as President of the Council of Castile, the second most powerful position in the state. However, continuing ill-health led him to resign in April 1685, with Oropesa taking over as de facto valido. He retained this position until 1690. ==Economy== The so-called \"Little Ice Age\" of the 17th century was a period of crisis throughout Europe, leading to poor harvests and economic decline. Spain was especially affected, due in part to the unsafe economic situation, particularly in Castile, where the population dropped from 6.5 million in 1600 to fewer than 5 million in 1680, whereas figures for Spain as a whole were 8.5 to 6.6 million. This was exacerbated by a series of wars with France and the need to defend the Empire, which were a constant drain on public expenditure. In 1663, Philip IV had converted state debt into government bonds, or juros, but high rates of interest meant taxes were often assigned to creditors years in advance to pay current liabilities. Although silver bullion imports from the Americas increased, the vast majority went to paying off foreign debtors. The globalisation of the Spanish trading system meant outsiders often had the most to lose from its collapse. By the 1670s, the bulk of foreign trade was controlled by Dutch and English merchants, while the domestic economy relied on French labour and imported wheat. The Marqués de Varinas, a senior colonial official, observed in 1687 that the Empire continued to exist in its present form \"only because it enables the English, Dutch and French to exploit [it] more cheaply\". In the 1680s, Spanish officials issued a series of drastic deflationary decrees (official order) revaluing the coinage at 25% of its previous value. The immediate impact was the total disruption of commerce and collapse of financial credit; in response, debtors were given three months to repay government debts using the existing rate, later extended to six months. Having stabilised the position, in 1686 the coinage was readjusted to a more favourable rate and thereafter left in original state. ==[Succession] conflict and death== Marie Louise was blamed for Charles' failure to produce an heir, while primitive fertility (a person's ability to conceive (create an embryo by fertilizing an egg) children) treatments gave her severe intestinal problems. She died in February 1689, shortly after the sudden start (of something unpleasant) of the Nine Years' War with France. On the basis of her recorded symptoms, modern doctors believe her illness was almost certainly appendicitis. A new wife was selected from a family famous for its fertility, Maria Anna of Neuburg, daughter of Philip William, Elector Palatine, and sister-in-law to Emperor Leopold. A proxy marriage took place in August 1689 before a formal ceremony in May 1690. Maria Anna also failed to produce an heir, almost certainly because Charles was by now physically incapable of doing so; his autopsy later revealed his sole remaining testicle was atrophied. His mother died on 16 May 1696, by which time Charles' health was clearly failing, making the succession increasingly urgent. Since the Crown of Spain passed according to cognatic primogeniture, it could be inherited through the female line. This enabled Charles' sisters Maria Theresa (1638–1683) and Margaret Theresa to pass their rights to the children of their marriages with Louis XIV and Emperor Leopold. However, to prevent a union between Spain and France, Maria Theresa had renounced her inheritance rights on her marriage; in return, Louis was promised a dowry of 500,000 gold (a women's family gives to the man she is marrying) écus, a huge sum that was never paid. The Nine Years' War showed France could not achieve its objectives on its own; the 1697 Treaty of Ryswick was the result of mutual (felt or done equally by both people involved) exhaustion and Louis's search for allies in anticipation of a contest over the Spanish throne. Leopold I, Holy Roman Emperor refused to sign since it left the issue unresolved; he reluctantly (not wanting to do something because you are not sure it is the right thing to do) did so in October 1697, but viewed it as a pause in hostilities. In 1685, Leopold and Margaret's daughter Maria Antonia married Maximilian II Emanuel, Elector of Bavaria; she died in 1692, leaving one surviving son, Joseph Ferdinand. In October 1698, France, England and the Dutch Republic attempted to impose a diplomatic (the activity of managing relations between different countries) solution to the Succession on Spain and Austria, by the Treaty of the Hague or First Partition Treaty. This made Joseph Ferdinand heir to the bulk of the Spanish monarchy, with France gaining the Kingdoms of Naples and Sicily and other concessions in Italy plus the modern Basque province of Gipuzkoa. Leopold's younger son Archduke Charles became ruler of the Duchy of Milan, a possession considered vital to the security of Austria's southern border. The Spanish objected to their empire being divided by foreign powers without being discussed before the decision, and on 14 November 1698, Charles II made Joseph Ferdinand heir to an independent and undivided Spanish monarchy. Maria Anna was appointed Regent during his minority, an announcement allegedly received by the Spanish councillors in silence. Joseph Ferdinand's death in 1699 ended these arrangements. It also left Louis XIV's eldest son, Louis, Grand Dauphin, heir to the Spanish throne, once again implying union between Spain and France. In March 1700, France, England and the Dutch agreed an alternative; Archduke Charles replaced Joseph Ferdinand, with Spanish possessions in Europe split between France, Savoy and Austria. Charles reacted by altering his will in favour of Archduke Charles, but once again stipulating an undivided and independent Spanish monarchy. Most of the Castilian nobility disliked Maria Anna and her German courtiers and viewed a French candidate as more likely to ensure their independence. In September 1700, Charles became ill again; by 28 September he was no longer able to eat, and Luis Manuel Fernández de Portocarrero persuaded him to alter his will in favour of Louis XIV's grandson, Philip of Anjou. He died on 1 November 1700, at age 38 probably of chronic kidney failure.https://scielo.isciii.es/pdf/urol/v62n3/en_02.pdf The autopsy records his \"heart was the size of a peppercorn; his lungs corroded; his intestines rotten and gangrenous; he had a single testicle, black as coal, and his head was full of water.\" As suggested previously, the last of these symptoms is indicative of hydrocephalus, a disease often associated with childhood measles, one of many illnesses got by Charles. Philip was proclaimed king of Spain on 16 November 1700, and the War of the Spanish Succession formally began on 9 July 1701. ==Male-line family tree== ==Ancestry== ==References== ==Notes== Category:Spanish monarchs Category:1661 births Category:1700 deaths Category:17th-century kings of Sicily",
 "title": "Charles II of Spain"
}