{
 "id": "1167947",
 "text": "The Saturn S-Series was a line of sedans, coupes, and station wagons. They were produced by Saturn, which was a part of General Motors from 1985 to 2010. They were produced from 1990 to 2002, and were sold as 1991 to 2002 model years. These Saturn cars were known for polymer body panels, a body-on-frame design not usually done for compact cars, and their mostly unique design almost completely separate from General Motors-- an unusual move for a GM brand. The Saturn S-Series came in three generations. The first generation was from 1991 to 1995. The second generation was from 1996 to 2000. The third-- and final-- generation was from 2000 to 2002, when the Saturn S-Series was then discontinued. == First Generation == From 1990 to 1995, the first generation Saturn S-Series was produced. Notable features of the first generation S-Series include: * \"Floating roof\" design (the roof does not curve back to connect to the body) * Presence of the generic \"SL\" trim level with the less powerful LK0 engine and manual transmission only * A different gauge cluster in the SC trim models (briefly) * Pop-up headlights (on the SC, then SC2 models. SC1, all SL, and all SW models never featured pop-up headlights) * Mention of an SL3 model in owners' manuals. No SL3 model would ever come out, but concept versions were made. These concept versions were speculated to have been equipped with in-house 6-cylinder engines. These inline six engines would be unique for having five valves per cylinder, producing about 250 horsepower out of 2.5 liters of displacement The first generation began sales as a 1991 year model and ended as a 1996 year model. SL and SW models entered their second generation in 1995, but the SC models remained first generation until 1996. The first generation models could be bought as: * SL (1990-1995) featured the LK0 engine, making 85 horsepower and 107 pound-feet of torque. It could only be bought with the Saturn MP2 5-speed manual transmission. It could not be bought with many of the features available on higher trim levels. It had black front and rear bumpers. * SL1 (1990-1995) featured the LK0 engine and could be be bought with the MP2 or MP6 4-speed automatic transmission. It could be bought with features like power steering, a passenger mirror, and a cassette player. It also had black front and rear bumpers. * SL2 (1990-1995) featured the LL0 engine, making 123 horsepower and 122 pound-feet of torque. It came with the MP3 5-speed manual transmission or the MP7 4-speed automatic transmission. The bumpers were body-colored, which was not the case for the SL and SL1. It also had larger wheels (15 inches.) * SW1 (1993-1995) featured the LK0 engine and could be be bought with the MP2 manual transmission or MP6 automatic transmission. It was essentially just a station-wagon version of the SL1. * SW2 (1993-1995) featured the LL0 engine. It came with the MP3 manual transmission or the MP7 automatic transmission. It had body-colored bumpers and weighed slightly more than the SL2 (generally, though it could depend on options.) * SC (1990-1993) featured the LL0 engine. It came with the MP3 manual transmission or the MP7 automatic transmission. It had two doors, pop- up headlights, and a shorter wheelbase (distance between wheels) than sedan models. These contributed to sharper handling and a more aggressive appearance. * SC1 (1994-1996) featured the LK0 engine, could be be bought with the MP2 or MP6 4-speed automatic transmission. It came with the front bumper from the SL models. Because of this, the SC1 did not have pop-up headlights. It was the lightest of the Saturn S-Series models. The 1994 Saturn SC1, according to Kelley Blue Book, weighed 2,279 pounds. * SC2 (1994-1996) featured the LL0 engine. It was a continuation of the SC in its internal components (it had the same engine and transmission options,) but had minor changes to the front bumper, making it a bit shorter than the SC. == Second Generation == From 1996 to 1999, the second generation of Saturn S-Series vehicles were produced. Changes in design include: * The end of floating roof design * A significantly more curved, less wedge-like front end * The removal of pop-up headlights from the SC2 model (like had been done to the SC1) * The discontinuing of the SL line * An increase in wheelbase length for SC models The second generation came in first for the SL and SW models, starting in 1996. For the SC models, it started in 1997. Second generation models came as: * SL1 (1996-1999) featured the L24 engine, which-- since 1995-- had multi- point fuel injection. This improved power output over the LK0, allowing the L24 to make 100 horsepower and 115 pound-feet of torque. It could be be bought with the MP2 manual transmission or MP6 automatic transmission. As a cautionary side note, some L24 engines-- between two and five percent of them-- developed cracks in the engine block, which allowed coolant and oil to mix, creating a \"milkshake\" oil that could cause overheating and chronically low coolant. * SL2 (1996-1999) featured the LL0 engine, making 123 horsepower and 122 pound-feet of torque. It came with the MP3 manual transmission or the MP7 automatic transmission. As was the case for the first generation, twin-cam models (models with \"2\" in their name) came with body-colored front and rear bumpers. * SW1 (1996-1999) featured the L24 engine. It could be be bought with the MP2 manual transmission or MP6 automatic transmission. This would be the last generation of the SW1, as third generation SW models only featured the dual overhead cam (DOHC) LL0 engine. * SW2 (1996-1999) featured the LL0 engine. Differences between first and second generation SW models were mostly minor, such as slightly different tail lights, although changes in body lines did give a different shape between the two generations. Floating roof architecture was abandoned, creating a more curved upper-half of the vehicle. It came with the MP3 manual transmission or the MP7 automatic transmission. * SC1 (1997-1999) featured the L24 engine. Its wheelbase was lengthened to match the SL and SW models. It had a full exterior redesign, giving more interior space. It could be be bought with the MP2 manual transmission or MP6 automatic transmission. 1999 model year SC1 models were equipped with a third door: a suicide door on the driver's side just behind the driver's side front door. * SC2 (1997-1999) featured the LL0 engine. It no longer featured pop-up headlights, nor did it have a shortened wheelbase anymore. Its exterior, like the SC1, became much more rounded and less angular. 1999 model year SC2 models were equipped with a third door: a suicide door on the driver's side just behind the driver's side front door. It came with the MP3 manual transmission or the MP7 automatic transmission. == Third Generation == From 1999 to 2002, the third generation of Saturn S-Series vehicles were produced. Changes in design include: * The end of black plastic bumpers; all bumpers are now body- colored * A full embrace of the three-door SC design: all SC models going forward now have a clam-shell door behind the driver's * The end of the SW1 line * Changes to the lower few inches of the S-Series' body panels The third generation would begin in late 1999, though more realistically ran from roughly 2000 to 2002. Later year 1999 models (sometimes dubbed 1999.5 models) got engine and exhaust upgrades that improved the internals of the motor and helped with remaining compliant with California emissions regulations. The third generation came in the models: *SL1 (2000-2002) featured the L24 engine. It could be be bought with the MP2 manual transmission or MP6 automatic transmission. The front bumper received a re-design, leaning more heavily into an overbite (per se) look. * SL2 (2000-2002) featured the LL0 engine. It came with the MP3 manual transmission or the MP7 automatic transmission. This was the first and only generation in which the SL1 and SL2 could not be told apart by using body-colored bumpers as a method of classification. * SW2 (2000-2001) featured the LL0 engine. Differences between first and second generation SW models were mostly minor, such as slightly different tail lights, although changes in body lines did give a different shape between the two generations. Floating roof architecture was abandoned, creating a more curved upper-half of the vehicle. It came with the MP3 manual transmission or the MP7 automatic transmission. * SC1 (2000-2002) featured the L24 engine. It could be be bought with the MP2 manual transmission or MP6 automatic transmission. As was the case for later-year second generation SC models, the SC1 now featured a third suicide door behind the driver. Headlights were also re-designed, creating a more \"aggressive\" look on the front end. * SC2 (2000-2002) featured the LL0 engine. Like the SC1, it gained a new front bumper, which changed the position of its fog lights closer to the edges of the vehicle. All third generation SC2 models were equipped with a third door: a suicide door on the driver's side just behind the driver's side front door. It came with the MP3 manual transmission or the MP7 automatic transmission. == References == Category:Saturn automobiles Category:1990s automobiles Category:2000s automobiles",
 "title": "Saturn S-Series"
}