{
 "id": "1167345",
 "text": "Project Zomboid is an isometric zombie video game created by the Indie Stone. It is set in a fictional Knox Knox County during a quarantine due to a virus called \"The Knox Event\". The game takes place on July 9th, 1993. == Game Play == While playing the game, you are given the choice to customize your character, along with this, you can pick which pre-apocalypse job you had, with each having pros and cons, and many needing negative traits (Hard of Hearing, High Thirst, etc.) to balance out the pros. Along with this, there are also positive traits to pick from, such as Fit, Runner, etc. You are given 4 spawn points to choose: * Muldraugh: Difficult to survive compared to Rosewood and Riverside, but far easier than Westpoint. * Rosewood: The easiest place to survive in, having a Police department and a Fire Station close by. * Riverside: Along with Rosewood, it is very easy to survive here. * WestPoint: Very hard to survive here, only rivaled by Louisville (can't spawn in Louisville) However, it has a Lot of Late Game loot. Recommended for Late game or Experienced Players. Each Town has its own positives and negatives, with easier towns having far less loot than harder ones, and hard towns having far more zombies than easier towns. WestPoint, Riverside, and Lousiville are real towns, although their locations are changed, while Muldraugh and Rosewood are Fictitious. Depending on Job Traits, The Players can spawn in a wide array of Spawn points. ( For Example, Police Officers Have a chance of Spawning in a Police Station If the Town Has One.) Zombies Are the main threat of the game, although the player has to handle other threats, such as food, water, Illness, Etc. You can find a wide array of tools to combat them, such as Firearms, Melees, and Makeshift tools, However, It is not Recommended to use Firearms, and Unless your Aiming skills are High, You will Likely Miss Depending on the Firearm, and Attract Attention, as \"Zeds\" Have High Hearing, and are attracted to sounds. Vehicles can be found all Throughout Knox Country, With different vehicles having Pros And Cons, Such as Vans Being Able to carry More goods, But consume More gas and Make more noise, Sports Cars, Which are Fast and Nimble, However they can't carry as much Goods as Vans And Station Wagons. Most are Found with Either No Key (Can be Hot wired Depending on profession) No Gas, or Low battery, It is Recommended to find gas once you find a Working Vehicle, as Power Will Turn Off depending on settings, and Power is used to get Gas From Gas Stations (Generators can be found, and used to turn on power in a structure) Zombies can inflict a range of damage on you: Scratches: 7% Chance of Infection Lacerations: 25% Chance of Infection Bites: 100% Chance of Infection You'll know if you are infected if: You Feel Depressed, Nauseated, or have anxiety, although There can be more symptoms. If you are Infected, Find a House Or Building to hide in; If you die and turn Outside, Your Corpse can Wander the World, Preventing you from getting your loot back on a \"New Run\" (Dying Resets Skills), it is also Recommended to find Bleach, Once you are Safe from your Corpse escaping, Make Peace With your Lord and Drink The Bleach, as Bleach as been Labeled by the PZ Community as Being \"The Only Cure\" as there is no way to prevent Zombie Infections. == Story == TBA Category:Video games",
 "title": "Project Zomboid"
}