{
 "id": "1167121",
 "text": "The Beechcraft 1900 is a U.S made twin-engine turboprop regional airliner made by Beechcraft. It is also used as a freight aircraft and corporate transport, and by several governmental and military groups. The aircraft was designed to carry passengers in all weather conditions from airports with short runways. It is capable of flying in . It is one of the most popular 19-passenger airliners in history. The 1900 first flew on September 3, 1982. The Beechcraft 1900 is a pressurized twin-turboprop aircraft designed and manufactured by Beechcraft (now part of Hawker Beechcraft). It was designed to succeed the King Air series and features a modern and advanced design. == History == The Beechcraft 1900 was designed in the 1980s by Beechcraft to meet the needs of regional airlines and corporate operators. The aircraft was first introduced in 1984 and quickly became popular among airlines and corporate operators. == Specifications == *Length: 17.62 meters (57.8 feet) *Height: 4.52 meters (14.8 feet) *Wingspan: 17.98 meters (59 feet) *Maximum Takeoff Weight: 7,670 kg (16,900 pounds) *Engines: 2 × Pratt & Whitney Canada PT6A-65B *Cruise Speed: 515 km/h (278 knots) *Range: 2,830 km (1,531 nautical miles) == Uses == Regional Airlines: The Beechcraft 1900 is used by regional airlines for passenger and cargo transportation. Corporate Aviation: The aircraft is used by corporate operators for business travel and charter flights. Military Transport: Some military forces use the Beechcraft 1900 for military transport and special missions. == Features == Modern Design: The Beechcraft 1900 features a modern and advanced design. High Performance: The aircraft has high performance capabilities, with a cruise speed of up to 515 km/h. Safety: The Beechcraft 1900 is designed with safety in mind, featuring advanced systems and a robust design. == Operators == Airlines: Many regional airlines operate the Beechcraft 1900 for passenger and cargo transportation. Corporate Operators: Corporate operators use the Beechcraft 1900 for business travel and charter flights. Military Operators: Some military forces operate the Beechcraft 1900 for military transport and special missions. == Related pages == *Beechcraft King Air ==References== == Other websites == *[Beechcraft Website] Category:Aircraft",
 "title": "Beechcraft 1900"
}