{
 "id": "1167230",
 "text": "Tarbiat Modares University is a public graduate university in Tehran, Iran. Its name means \"Professor Training University\" in Persian. Tarbiat Modares University is the 7th best university in Iran according to usnews. == Overview == Tarbiat Modares University (TMU) was founded in 1982 and is a leading graduate school in Iran. It offers Ph.D. programs in science and engineering. Currently, TMU has 171 master’s programs and 132 Ph.D. programs, with over 8,000 students and 775 faculty members. === Faculty of Agriculture === Established in 1983, this faculty focuses on solving agricultural challenges through seminars and coursework. === Faculty of Art and Architecture === This faculty offers programs in painting, animation, art studies, theatre, graphic design, visual arts, architecture, urban planning, construction, and building management. === Faculty of Basic Sciences === Originally, this faculty included Biology, Chemistry, Geology, Mathematics, and Physics. As student numbers grew, Biology and Mathematics became separate faculties. Now, it focuses on Chemistry, Geology, and Physics. * Chemistry: Covers Analytical, Inorganic, Organic, and Physical Chemistry. * Geology: Focuses on Economic Geology, Engineering Geology, Petrology, and Tectonics. * Physics: Specializes in Atomic and Molecular Physics, Condensed Matter, and Particle Physics. === Faculty of Biological Sciences === Started with Plant Sciences and Genetics, later adding Biochemistry and Biophysics. It now includes Nanobiotechnology and broader biology fields. === Faculty of Chemical Engineering === Founded in 1983, this faculty has six departments: Chemical Engineering, Petroleum Engineering, Polymer Engineering, Polymerization Processes, Biotechnology Engineering, and Biomedical Engineering. === Faculty of Civil & Environmental Engineering === This faculty provides master’s and Ph.D. programs in civil and environmental engineering. === Faculty of Electrical and Computer Engineering (ECE) === Offers M.Sc. and Ph.D. programs in biomedical engineering, computer engineering, communications, control, electronics, power systems, and IT engineering. The faculty also conducts research in optoelectronics, VLSI, satellite communications, power electronics, and power systems. == References == Category:Universities by country",
 "title": "Tarbiat Modares University"
}