{
 "id": "116805",
 "text": "== The Salem Witch Trials == The Salem Witch Trials (1692-1693) were a series of witch trials in the Massachusetts Bay Colony. This was the biggest witch hunt ever to occur in New England. Many similar witch hunts, trials and executions were carried out in Britain and elsewhere. The first accusations of witchcraft happened January 1692. The trials began the following month in February. They took place in county courts in Essex, Suffolk and Middlesex Counties of colonial Massachusetts. By May 1693, when the trials finally ended, more than 200 people had been accused of practicing witchcraft. Over 150 of them had been jailed, 20 had been executed (one by torture), and at least 5 died in prison.Reed, Isaac Ariail. “Deep Culture in Action: Resignification, Synecdoche, and Metanarrative in the Moral Panic of the Salem Witch Trials.” Theory and Society, vol. 44, no. 1, 2015, pp. 65–94. JSTOR, http://www.jstor.org/stable/43694747. Accessed 22 Apr. 2025. Eventually, several of the accusers (mostly teenage girls) admitted that their testimony and accusations were false. Today, the trials are often viewed as examples of mass hysteria and moral panic. == Beliefs about witchcraft == At this time, most New Englanders thought that witches truly existed and were a real and constant danger. Their ideas about witchcraft were closely tied to their religious beliefs: > Most ministers in New England believed that all magic was diabolical, and > that witches received powers from the Devil to [control] the weather, cause > illness, destroy crops, and harm livestock. [They believed] witches made a > covenant with the Devil that was similar to the covenant [that] church > members made, and they deserved to be punished with death because ... they > were “enemies to God, and all true religion.” The threat of witchcraft was > believed to be particularly menacing in New England due to the special > mission of Puritan colonists to create a godly society. New Englanders believed that witches could look and act just like normal people - which meant any normal person could be accused of witchcraft. The Salem trials were not the only ones to occur in New England in the 1600s. Fourteen other women and two men were executed in the Massachusetts Bay Colony and Connecticut Colony during the 17th century. == Before the accusations == At the time many Puritans lived in Salem, Masssachusetts. In 1689 , the preacher Samuel Parris was made the leader of this community. In his sermons, he often talked about the struggle between the chosen people of god and Satan. In 1691 and 1692, his daughter, Elizabeth \"Betty\" Parris, and another and his niece started to act and speak strangely. they also tried to hide under things and crawl on the floor. Parris consulted several doctors, but none of them had a medical explanation for the behaviour. A doctor called William Griggs also examined the girls. After ruling out the mental illnesses known at the time, he suggested that they could be be possessed by the devil. It was like the devil made them move in strange ways. Abigail and Elizabeth later confirmed this and they described that invisible hands were vexing them. Parris then used this explanation and said that the city was occupied by the devil. An army of small devils was redy to invade the city, he said. Elizabeth told about the fact, that Satan had approached her, but that she had refused him. Therefore, he was sending out his servants, the witches. One of the ways to fight against this was to identify and name the witches involved. The two girls, along with a few others started with naming witches: Sarah Good, a well-known beggar, daughter of a pub-owner, Sarah Osborne, an older, sick woman, Tituba, one of Samuel Parris' slaves, probably an Arawak from Guyabna. All of these were people that were socially disadvantaged, at the edge of society. The villagers, who were often threatened by Native Americans believed the accusations. == Accusers == === First accusers === The trials began after a few local women in Salem Village were accused of witchcraft by four young girls, Betty Parris (9), Abigail Williams (11), Ann Putnam Jr. (12), and Elizabeth Hubbard (17). The girls twisted themselves into strange shapes, screamed, and spoke meaningless words. A doctor concluded that witches had invaded Salem Village and were bewitching the girls. Tituba, an enslaved woman, was blamed and became the first person to be accused of witchcraft. A woman named Bridget Bishop was the next to be accused, and was the first to be executed. === Core group of accusers === Soon there was a core group of accusers, all girls and young women between the ages of 9 and 20. According to a 2025 article by Sarah Pruitt: > [They] screamed, writhed, barked and displayed other horrifying symptoms > they claimed were signs of Satanic possession... [The accusers] included > members of [important] village families, as well as domestic servants and > refugees of King William’s War, a long-running conflict that pitted English > settlers against the indigenous Wabanaki people and their French allies. === Testimonies === ==== Mary Daniel ==== Often, the accusers claimed a witch was injuring or sickening them. For example, when 16-year-old Mary Daniel testified in court that Margret Scott was bewitching her, she said: > I was taken very ill again all over & felt a great pricking in [the] soles > of my feet, and after a while I saw apparently the shape of Margret Scott, > who, as I was sitting in a chair by [the] fire pulled me with [the] chair, > down backward to [the] ground, and tormented and pinched me very much. These symptoms may have been caused by mass hysteria. ==== George Burroughs ==== In April 1692, a young woman accused Reverend George Burroughs of witchcraft. (Burroughs was a Harvard graduate who had been a minister in Salem Village in the early 1680s before moving back to Maine.) According to a 2024 research guide by Tricia Peone: > One of the [accusers] testified that she had seen “the Apparition of a > Minister who confessed to murdering and bewitching people and claimed to be > a “conjurer.” In a sinister reversal of the minister’s role, he commanded > her to sign her name in his book and give her soul to the Devil. His > accusers identified him as the leader of all the witches in northern New > England, and their testimonies [claimed he committed] other mockeries of > Puritan faith such as holding a sabbath in Rev. Parris’ pasture, taking a > sacrament of blood, and [allowing] women (witches) as deacons. Burroughs was > unable to convince the court or his fellow ministers that he was a minister > of God and not of the Devil. Burroughs was executed for witchcraft on August 19, 1692. == Trials == The Salem Witch Trials involved two kinds of trials. First, court hearings were held before local magistrates; then trials were held in county court. The trials were held in Salem, and accused witches from surrounding areas were brought to Salem to be tried for witchcraft. The best-known trials were held by the Court of Oyer and Terminer in 1692 in Salem Town. All twenty-six people who went to trial before this court were convicted. In 1693, there were also four sessions of the Superior Court of Judicature in Salem. During these court sessions, thirty-one accused witches were tried for practicing witchcraft, but only three were convicted. Sometimes, \"trials\" that sentenced people to death lasted just 15 minutes.The Salem Witch Hunt (documentary film). Created by National Geographic (2024). Full documentary available at https://www.youtube.com/watch?v=8gksEuJN04Q&t;=1349s == Victims == During the Trials, over 150 people accused of witchcraft were arrested and put in jail. Even more people were accused, but were never formally charged by the authorities. Most of the accused were women. In the Trials: * 29 people were found guilty of witchcraft, which was a capital felony, punishable by death * 19 of these people (14 women and 5 men) were hanged on Gallows Hill in present-day Salem, Massachusetts * At least 5 accused witches died in prison * Another (Giles Corey) was crushed to death under heavy stones after he refused to plead guilty or not guilty By late 1692, the trials had gotten so out of control that the accusers began to accuse prominent and well-connected individuals, including the wife of Governor William Phips. After this shift in targets, people began to think about the proceedings more critically. Increase Mather, a respected minister, published \"Cases of Conscience Concerning Evil Spirits,\" where he questioned whether spectral evidence was really reliable. This type of evidence had been central to the Salem convictions. == Explanations == Historians have proposed many explanations for Salem's sudden witch panic. === Factors related to the accusers === The accusers may have been impacted by any of these factors: * Boredom * Child abuse * Epilepsy * Mental illness like conversion disorder * Mass hysteria * Rebellion against strict gender roles (children, especially girls, were to be seen and not heard) * Family rivalries (some accusers might have been pressured to accuse members of opposing families) === Social and economic factors === According to the Salem Witch Museum: \"Perhaps the main reason for witchcraft accusations in 1692 Topsfield were generations-long border disputes with Salem Village.\" However, many other factors may have contributed, including: * Socioeconomic problems * Deliberate fraud * Unusually cold weather * Mass hysteria * Moral panic * Ergotism (a condition caused by a fungus that grows on rye and other grains) * A large increase in refugees from King William's War == Related pages == *The Scarlet Letter * Witch * Witchcraft * Witch hunt * Mass hysteria * Moral panic * Puritanism == References == Category:17th century in Massachusetts Category:1692 Category:1693",
 "title": "Salem Witch Trials"
}