{
 "id": "1168558",
 "text": "Koper (It. Capodistria) is a Town in Western Slovenia. It is the largest settlement on the Slovenian Coast with 54.252 (Municipality), the city also holds the countries largest, and only port, The port of Koper (Luka Koper). It is the countries fifth largest settlement. == History == Koper started as a roman settlement, under the name \"Aegida\" after the fall of Rome, the city was under the Patriarch of Aquileia, then the Republic of Venice, After that it was taken over by Austria. When the near by Trieste was made into a free port in the 18th century, Koper lost it's importance. Italy gained control of Koper in 1920 with the Treaty of Rapallo, and it held onto it until 1945, when the Free Territory of Trieste was created, Koper was under Zone B under Yugoslav Control. After the FTT was dissolved in 1954 it was fully annexed into Yugoslavia. Today the town is in modern day Slovenia Until the mid-late 1940s Koper (then known in italian as \"Capo d'Istria lit. Head of Istria) was a Majority Italian Town, but due to the Istrian Exile most of these Italians left for Italy (Mainly Trieste) and Slovenians moved in, turning it into a Majority Slovenian Town, although there i still a Italian minority in the town. Today the town is still Bilingual. The Old Town Core is located on a former island. it was connected to the mainland in the 20th century. In 2011 the town of Ankaran split away from the City Municipality of Koper to become it's own Municipality. == Settlements in the Municipality == * Babiči * Barizoni * Belvedur * Bertoki * Bezovica * Bočaji * Bonini * Boršt * Bošamarin * Brezovica pri Gradinu * Brežec pri Podgorju * Brič * Butari * Čentur * Cepki * Cerej * Čežarji * Črni Kal * Črnotiče * Dekani * Dilici * Dol pri Hrastovljah * Dvori * Elerji * Fijeroga * Gabrovica pri Črnem Kalu * Galantiči * Gažon * Glem * Gračišče * Gradin * Grinjan * Grintovec * Hrastovlje * Hrvatini * Kampel * Karli * Kastelec * Kolomban * Koromači–Boškini * Kortine * Kozloviči * Koštabona * Krkavče * Krnica * Kubed * Koper * Labor * Loka * Lopar * Lukini * Manžan * Marezige * Maršiči * Močunigi * Montinjan * Movraž * Olika * Osp * Peraji * Pisari * Plavje * Pobegi * Podgorje * Podpeč * Poletiči * Pomjan * Popetre * Prade * Praproče * Predloka * Pregara * Premančan * Puče * Rakitovec * Rižana * Rožar * Šalara * Šeki * Sirči * Škocjan * Šmarje * Smokvica * Socerb * Sočerga * Sokoliči * Spodnje Škofije * Srgaši * Stepani * Sveti Anton * Tinjan * Topolovec * Trebeše * Triban * Trsek * Truške * Tuljaki * Vanganel * Zabavlje * Zanigrad * Zazid * Zgornje Škofije * Župančiči Category:Municipalities of Slovenia",
 "title": "City Municipality of Koper"
}