{
 "id": "1168221",
 "text": "The Wright Axcess was a series of two single-decker bodies of buses. They had low-floors. They were made from 1995 to 2001 by Wrightbus. The Wright Axcess- Ultralow body was built on the Scania L113CRL chassis. The Wright Axcess- Floline was built on the Scania L94UB chassis. == Axcess-Ultralow == From 1995 to 1997, Wrightbus made a body of a bus called the Axcess-Ultralow. It had a low-floor. The Wright Axcess-Ultralow body was built on the Scania L113CRL chassis. In 1997, the Axcess-Ultralow was replaced with the Axcess-Floline. ===Operators=== In 1995, Rider York ordered 20 Scania L113CRLs with Wright Axcess-Ultralow bodywork for use on the York park and ride service. In 1996, First Greater Glasgow ordered Axcess-Ultralows. In 1997, FifeFirst ordered Axcess-Ultralows. In 1997, Midland Bluebird and Lowland ordered eight Axcess- Ultralows. From 1995 to 1997, Kingfisher Huddersfield, First Crosville and Eastern Counties ordered Axcess-Ultralows. In 1996, MTL Trust Holdings ordered twenty Axcess-Ultralows, In 1994, Kentish Bus ordered ten Axcess-Ultralows, these were part of an investment by Kent County Council into improving bus stops, and improved route information for route 480 from Dartford to Gravesend. In 1997, Chester City Transport ordered six Axcess-Ultralows for park and ride services, From 1995 to 1996, Nottingham City Transport ordered five Axcess-Ultralows . In 1995, Bullocks Coaches of Cheadle ordered five Axcess-Ultralows for use on route 42 from Piccadilly Gardens to Stockport bus station, == Axcess-Floline == From 1997 to 2001, Wrightbus made an improved body of a bus called the Axcess-Ultralow. It had a low-floor. The Wright Axcess-Floline was built on the Scania L94UB chassis. The improvements were that it had less steps at the back of the bus. In 2000 , the Axcess-Floline was replaced with the low-floor Scania L94UB with Wright Solar bodywork. === Operators === From 1997 to 2001, FirstBus ordered 242 Scania L94UBs with Axcess-Floline bodywork. ==References== ==Other websites== * * Category:Low- floor buses Axcess",
 "title": "Wright Axcess"
}