{
 "id": "116893",
 "text": "Falkirk is a town in Scotland. It is home to Scottish Premier League football club Falkirk F.C. Falkirk is historically in the county of Stirlingshire and is situated in the Forth Valley, approximately 23.5 miles northwest of Edinburgh and 20.5 miles northeast of Glasgow. At the 2001 UK Census, Falkirk had a population of 32,422, which increased to 34,570 by 2008. It serves as the main town and administrative center for the Falkirk council area, encompassing nearby towns like Grangemouth, Bo'ness, Denny, Camelon, Larbert, Stenhousemuir, and the Braes villages, with an overall population of 156,800. Falkirk played a significant role in the Industrial Revolution, particularly in the iron and steel industry, supported by the Carron Company in nearby Carron. While heavy industry has declined in the last fifty years, Falkirk's economy now relies on retail and tourism. The town is home to international companies like Alexander Dennis, the largest bus production company in the UK. The article mentions Falkirk's association with the publishing industry, highlighting the establishment of Johnston Press in 1846, which now produces the Falkirk Herald, the largest selling weekly newspaper in Scotland. Key attractions in and around Falkirk include the Falkirk Wheel, The Helix, The Kelpies, Callendar House and Park, and remnants of the Antonine Wall. In a 2011 poll, Falkirk was voted as Scotland's most beautiful town. The town's history is traced back to the Scottish Gaelic name \"An Eaglais Bhreac,\" meaning \"variegated church,\" which evolved into the Scots name \"Fawkirk\" and later to the modern English name \"Falkirk.\" The Latin name Varia Capella also carries the same meaning. Falkirk has a long history, with its Old Parish Church potentially founded as early as the 7th century. The Antonine Wall, similar to Hadrian's Wall, passed through Falkirk, marking the northern frontier of the Roman Empire. Evidence of Roman occupation, including a hoard of Roman coins and a tartan cloth thought to be the oldest recorded, has been found in Falkirk. The town played a crucial role in Scotland's Industrial Revolution, with significant developments in the iron-casting industry, canal construction, and early railway development. Falkirk also witnessed two important battles: the Battle of Falkirk in 1298, where William Wallace was defeated by King Edward I of England, and the Battle of Falkirk Muir in 1746, where Jacobites under Charles Edward Stuart defeated a government army. As of the mid-2020 estimate, Falkirk had a population of 35,590, with a density of 3,197/km2. The town is part of the Stirling and Falkirk council area in Scotland, United Kingdom, with the post town and postcode district being Falkirk (FK1, FK2) and the dialing code 01324. Category:Towns in Falkirk",
 "title": "Falkirk"
}