{
 "id": "1168313",
 "text": "Controlling behavior refers to the behavior of a person to control someone else.Antai, D. (2011). Controlling behavior, power relations within intimate relationships and intimate partner physical and sexual violence against women in Nigeria. BMC public health, 11, 1-11.Graham-Kevan, N., & Archer, J. (2008). Does controlling behavior predict physical aggression and violence to partners?. Journal of Family Violence, 23, 539-548. In relationships, abusers employ a range of ways, such as coercion and intimidation, to control others. Victims are often subject to physical, financial, sexual and psychological abuse. ==Characteristics== Abusers employ a range of ways to control another person, some of which look positive, making their victims less likely to know that they are being abused. ===Positive ways=== * Praise * Love bombing * Superficial charm * * * ===Negative ways=== * Threats * Guilt trip * Tangney, J., & Dearing, R. (2002). Shame and guilt. New York. The Guilford Press * Silfver, M. (2007). Coping with guilt and shame: a narrative approach, Journal of Moral Education, 36, 169-183 * Leith, K., Baumeister, R. (2008). Empathy, shame, guilt, and narratives of interpersonal conflict: guilt- prone people are better at perspective taking, Journal of Personality, 66, 1-37 * Beck, G., McNiff, J., Capp, J., Olsen, S., Avery, M., & Hagewood, J. (2011). Exploring negative emotion in women experiencing intimate partner violence: shame, guilt, and PTSD, Behaviour Therapy, 42, 740-750 * * Gaslighting* Adams Natalie, Bettis Pamela. 2003. “Commanding the Room in Short Skirts: Cheering as the Embodiment of Ideal Girlhood.” Gender & Society 17(1):73–91. * Barber Jennifer S., Kusunoki Yasamin, Gatny Heather H., Budnick Jamie. 2018. “The Dynamics of Intimate Partner Violence and the Risk of Pregnancy during the Transition to Adulthood.” American Sociological Review 83(5):1020–47. * Randles Jennifer. 2018. “‘Manning Up’ to Be a Good Father: Hybrid Fatherhood, Masculinity, and U.S. Responsible Fatherhood Policy.” Gender & Society 32(4):516–39. * Warshaw Carole, Tinnon Erin. 2018. “Coercion Related to Mental Health and Substance Use in the Context of Intimate Partner Violence: A Toolkit for Screening, Assessment, and Brief Counseling in Primary Care and Behavioral Health Settings” (https://www.sprc.org/sites/default/files/resource- program/NCDVTMH_IPV_ScreeningMH_SA_CoercionToolkit2018.pdf). * * Victim blaming * * * Harber, K. D., Podolski, P., & Williams, C. H. (2015). Emotional disclosure and victim blaming. Emotion, 15(5), 603–614. https://doi.org/10.1037/emo0000056 ==Causes== Controlling behavior can be caused by different factors. Many abusers have personality disorders they are not aware of. ==Law== ===United Kingdom=== ====England and Wales==== The Serious Crime Act 2015 created a criminal offence for controlling behavior in a family or an intimate relationship.Statutory guidance framework: controlling or coercive behaviour in an intimate or family relationship 05 Dec 2015 gov.uk\"University graduate from Poole admits controlling and coercive behaviour\" Daily Echo 27 Mar 2019 The Act requires the following criteria to be met in order for someone to be convicted:Statutory guidance framework: controlling or coercive behaviour in an intimate or family relationship 05 Dec 2015 gov.uk Text was copied from this source, which is available under an Open Government Licence v2.0. © Crown copyright. The controlling behavior must have * had a \"serious effect\" on the victim * been carried out \"repeatedly or continuously\" * caused the victim to fear violence at least twice * been carried out with the intent to control or coerce * Persuade (an unwilling person) to do something by using force or threats. Oxford Languages. * Obtain (something) from someone by using force or threats. Oxford Languages. the victim in some manner ====Scotland==== Controlling behavior is also a criminal offence in Scotland under the Domestic Abuse (Scotland) Act 2018, with largely the same criteria. ===United States=== Several states have passed laws to require those in certain professions, including doctors, teachers and caregivers, to report domestic violence against children to the authorities. Family law mostly comes under the jurisdiction of local and state governments, leading to differences in handling controlling behavior in relationships. ====Examples==== The Jennifers' Law of Connecticut is a law in the U.S. state of Connecticut including coercive control within the definition of domestic violence. The law is named after two women, both victims of domestic violence: Jennifer Farber Dulos and Jennifer Magnano, which came into effect in 2021. ==Related pages== * Extortion * Antisocial personality disorder * Borderline personality disorder * Narcissistic personality disorder ==References== Category:Psychiatry Category:Relationships",
 "title": "Controlling behavior"
}