{
 "id": "1168968",
 "text": "Aya Atassi (born October 16, 2002) is an Arab American social entrepreneur, businesswoman, public speaker, and media personality. She is the founder of several ventures, including Click Ink Media, Arab American Times (AATimes), Aya Beauty, and MeBar. She is also the Executive Vice President (EVP) of Growth & Strategy at Vurse, a rising digital media platform. == Early life and education == Aya Atassi Khanji was born in Washington, D.C., on October 16, 2002, into the prominent Atassi dynasty, a family with deep political and historical ties to Syria. She is a direct descendant of Hashim Al-Atassi, the first president of Syria and a key figure in the country’s independence movement. Her mother, Farah Al-Atassi, is a Syrian-American political activist and Middle East affairs expert. She has been involved in advocating for democracy in Syria and is a member of the Syrian High Negotiations Committee (SHNC). Khanji attended Langley High School (Class of 2021) and later pursued a double major in Entrepreneurship & Business Innovation and Marketing, with a minor in Law and Society, at The George Washington University, graduating in 2024. == Career == === Entrepreneurship and business ventures === Aya Khanji is the founder and CEO of multiple businesses in the media, beauty, and health industries: * Click Ink Media: A digital diplomacy and media firm providing advertising services to embassies, real estate companies, and government organizations. The company has expanded globally, partnering with entities in Qatar and Saudi Arabia. * Arab American Times (AATimes): A media platform that highlights the achievements of Arab Americans in various fields, including entertainment, sports, government, and technology. The platform also organizes fundraisers to support refugee aid programs in the Middle East.https://qatar.websummit.com/blog/news/day-2-talks-tech-activism- microsoft/ * Aya Beauty: A luxury, cruelty-free beauty brand offering vegan lip glosses, with a portion of proceeds supporting nonprofit organizations focused on refugee relief, climate change, and world hunger. * MeBar: A personalized nutrition bar company offering customizable supplement bars as an alternative to traditional vitamin pills. In addition to these ventures, Khanji serves as the Executive Vice President (EVP) of Growth & Strategy at Vurse, a digital media platform. Her role involves driving user acquisition, securing major influencers, and forming strategic partnerships. === Public speaking and media presence === Aya Atassi Khanji is a frequent public speaker at global conferences, including Web Summit Qatar, where she has spoken on media, technology, and activism. She has also been featured in several prominent media outlets, including Al Jazeera, Fortune, and Dose of Society.https://qatar.websummit.com/attendees/qat24/74916521-244a-4dd5-9d8c-bafdd513991c/aya- at == Legacy and personal views == While her professional work remains non- political, Khanji acknowledges her family's historical role in Syrian politics. She maintains a neutral stance in public affairs, focusing instead on entrepreneurship, social impact, and innovation. Through her ventures, she aims to foster cultural exchange, empower underrepresented communities, and redefine industry standards in media, beauty, and health. == References == == Other websites == * Instagram * LinkedIn * TikTok * Vurse Profile Category:Living people Category:2002 births",
 "title": "Aya Atassi"
}