{
 "id": "1168744",
 "text": "Marián Masný (born 13 August 1950 in Rybany) is a Slovak former football player. He played for Czechoslovakia, for which he played 75 matches and scored 18 goals. His brother Vojtech was also football player. A fast, technically equipped player with an unpredictable handle, he was even a renowned dribbler, and is considered as one of the best wingers of his time in Europe. ==Club career== He started with football in Rybany, continued in the youth of Bánovce nad Bebravou, where he scored 40 goals out of 82 in one season. During his military service, he was a player of Dukla Banská Bystrica in the Second Czechoslovak League, scoring his first two goals in the 1969/70 season in Pardubice (3:1). In the 1970/71 season, he was the third best scorer in the Second Czechoslovak League with 13 goals. He scored four goals twice in the match, against Ústí nad Labem (5:0) and Bardejov (5:1). He transferred to Slovan Bratislava, where he formed a feared attacking trio with Ján Čapkovič and Ján Švehlík for many years. He made his debut in the Czechoslovak league on August 11, 1971 against AC Nitra (2:1), he scored his first two league goals on August 16, 1971 against Sparta Prague in a high victory 6:1. He played 11 and a half seasons in the blue jersey, scoring 97 goals in 320 games. He won two championship titles at Tehelné pole, won the Czechoslovak Cup twice and the Slovak Cup four times. In the 1980/81 season, he became the king of league scorers with 16 goals. In the European Cups, Masný has a record of 14 matches, four goals. In the European Champions Cup, he scored three times in matches against Anderlecht Brussels (4:2, 1:3), scoring the winning goal against the English champion Derby County (1:0). Olympiakos Piraeus was very interested in Masný, but after the unsuccessful performance of the national team at the 1982 World Cup, he did not receive permission to transfer. In the spring of 1983, he transferred to SC Neusiedl, made his debut in the Austrian league on 19 March 1983 in a round of 16 match against VÖEST Linz (3–1), but only played nine games in the competition due to a knee injury. He continued his career in ZŤS Petržalka, in the 1983/84 season he helped the team to the championship in the SNFL and to promotion to the I. League. In Petržalka, he added another 27 league games and six goals to his statistics. The first two league goals for Petržalka were scored by Masný, similarly to the Slovan jersey of Sparta Prague, which unexpectedly lost to the newcomer 1:2. Masný thus came close to the limit of one hundred goals by one goal, which he achieved on November 4, 1984 in a match with ZVL Žilina and became a member of the League Gunners Club. Petržalka took the relegated 15th place in the 1984/85 season, Masný played another season in the SNFL, after the merger of Petržalka with Inter Bratislava, he continued in the newly established club Inter ZŤS Bratislava. In the 1986/87 season, he played six games for the club, scoring one goal. He ended his career at the age of 46 in the team of the lower Austrian competition Mönchhof. He was twice ranked in the Ballon d'Or of France Football poll, in 1976 he took ninth place, in 1978 he was ranked 18th. In the same year, he was third in the Footballer of the Year poll. He was eighth in the Footballer of the Century poll in Slovakia, and in 2018 he was inducted into the Slovak Football Hall of Fame. Marián Masný is the younger brother of Vojtech Masný, also a representative and member of the silver team from the 1964 Olympics in Tokyo. ==International career== He made his debut for the Czechoslovak national team on September 25, 1974 in Prague against the German Democratic Republic (3:1). He scored the first goal in his second national team start against Sweden (4:0). He was a member of the team that won the title of European champions in 1976. In the key match of the qualification for the final tournament in 1975, Czechoslovakia won over England 2:1, both goals were scored after Masný's crosses and headers by Zdeněk Nehoda and Dušan Galis, Kevin Keegan described Masný as \"one of the world's most skilful wingers\". At the final tournament in Yugoslavia, Masný was regarded one of the best players, he was included in the best eleven of the championship. In the final against the Federal Republic of Germany at 2:0, he had a great chance to score the third goal, but his shot narrowly missed Sepp Maier's goal. After a 2-2 draw after extra time, a penalty shootout decided the European champion, Masný was the first successful executor. The defending champion also qualified for the next European Championship in 1980 in Italy. In the qualifications, Masný was the team's top scorer with five goals, he excelled especially in the match in Sweden (3:1), when he scored two goals and added the third after his knocked shot Nehoda. Czechoslovakia won bronze medals at the 1980 European Championships, in the match for 3rd place with home Italy (1:1) a penalty shootout was again decisive, in which the Czechoslovak footballers were more successful. Interestingly, the first five elevens were kicked by the same players as in Belgrade 1976, even in the same order. Masný participated in the 1982 World Cup in Spain, where, however, due to an unhealed injury, he only made two substitutions in matches against England (0:2) and France (1:1). These were his last national team starts, he wore the most valuable jersey for 75×, the most of all Slovaks. With 18 goals, he is the second best scorer - Slovak in the Czechoslovak national team behind Adolf Scherer (22 goals). He also scored against the elite teams of Germany (3:4), Italy (3:0) and Spain (1:0). == Honours == * Czechoslovak First League: 1974 & 1975 * Slovenský Pohár: 1972, 1974, 1976, 1982, & 1983 * Czechoslovak Cup: 1974 & 1982 * Ciutat de Barcelona Trophy: 1974 * UEFA Euro: 1976 == References == * * Voted in top 10 World Player of the Year * Voted in top 20 World Player of the Year * Caps and Goals National Team * Marián Masný Profile * Voted into Slovak Team of the Century Category:1950 births Category:Slovak men's footballers Category:Czechoslovak men's footballers Category:UEFA Euro 1976 players Category:UEFA Euro 1980 players Category:1982 FIFA World Cup players",
 "title": "Marián Masný"
}