{
 "id": "1168893",
 "text": "The Wright Eclipse Gemini is a double-decker body of a bus. It has a low- floor. It has been made from 2001 to the present day by Wrightbus. == First generation (2001–2009) == From 2001 to 2009, Wrightbus made a double-decker body of a bus called the Wright Eclipse Gemini. From 2001 to 2006, the Wright Eclipse Gemini was built on the Volvo B7TL chassis. In 2007, the Volvo B7TL chassis was replaced with the Volvo B9TL chassis because the B7TL had lots of noise complaints. In 2007, Wrightbus improved the Wright Eclipse Gemini to fit the new Volvo B9TL chassis. the rear destination number was moved to the right, the registration plate was moved to the top of the bus and the rear window was smaller. From 2007 to 2009, the Wright Eclipse Gemini was built on the Volvo B9TL chassis. === Operators === ==== United Kingdom ==== ===== Volvo B7TL ===== Arriva London ordered 179 Volvo B7TLs with Eclipse Gemini 1 bodywork. London Central and London General ordered 273 Volvo B7TL Gemini 1s. From 2004 to 2007, First Glasgow, First West, First South Yorkshire, and First Leicester ordered Volvo B7TLs with Eclipse Gemini 1 bodywork. From 2004 to 2006, Travel West Midlands ordered 150 Volvo B7TL Gemini 1s. ===== Volvo B9TL ===== In 2007, First South Yorkshire and First Glasgow ordered Volvo B9TL Gemini 1s. From 2007 to 2010, First Greater Manchester ordered over 200 Volvo B9TL Gemini 1s. In 2008, Yorkshire Coastliner ordered 10 Volvo B9TL Gemini 1s. In 2007, Wessex Bus ordered seven Volvo B9TL Gemini 1s. ===== Volvo B5LH ===== In 2008, Volvo made a hybrid chassis called the Volvo B5LH. In 2009, Wrightbus made bus bodies for the Volvo B5LH chassis In 2009, Arriva London ordered 6 Volvo B5LHs Gemini 1s. ==== Hong Kong ==== ===== Wright Explorer ===== From 2003 to 2005, Wrightbus made a double-decker body of a bus called the Wright Explorer (previously called The Wright Bus). It had three-axles and it had low-floor. It was made for the Hong Kong market. The Wright Explorer body was built on the Volvo Super Olympian chassis. ====== Operators ====== In 2003, Kowloon Motor Bus ordered Volvo Super Olympians with Wright Explorer bodywork. In 2006, the Super Olympian chassis was replaced with the three-axle Volvo B9TL chassis. In 2006, Wrightbus made an improved bus body but didn't give it a name. In 2006, Kowloon ordered 64 Volvo B9TLs with the unnamed Wright bodywork. == Second generation (2008–2018) == From 2008 to 2018, Wrightbus made a double-decker body of a bus called the Wright Eclipse Gemini 2. It had a low-floor. The Wright Eclipse Gemini 2 body was built on the Volvo B9TL chassis and the hybrid B5LH chassis. === Operators === ==== United Kingdom ==== ===== Volvo B9TL ===== In 2012, First West Yorkshire ordered 47 Volvo B9TLs with Eclipse Gemini 2 bodywork. From 2011 to 2013, First Berkshire ordered six Volvo B9TL Gemini 2s for use on their Green Line 702 service. From 2009 to 2011, Lothian Buses ordered 145 Volvo B9TL Gemini 2s. In 2009, East Yorkshire Motor Services ordered 20 Volvo B9TL Gemini 2s. From 2014 to 2015, they ordered 9 more Volvo B9TL Gemini 2s. ===== Volvo B5LH ===== From 2012 to 2013, Arriva UK bus ordered 77 Volvo B5LHs with Eclipse Gemini 2 bodywork. * 44 were sent to Arriva North West * 12 were sent to Arriva Yorkshire * 11 were sent to Arriva Southern Counties * 10 were sent to Arriva North East In 2013, Oxford Bus Company ordered 19 Volvo B5LH Gemini 2s. In 2011, First West Yorkshire ordered 22 Volvo B5LH Gemini 2s for use on the Leeds guided busway. In 2013, Preston Bus ordered 8 Volvo B5LH Gemini 2s. ==== Hong Kong ==== ===== Volvo B9TL ===== In 2014, Citybus, Kowloon Motor Bus, MTR Bus and New World First Bus ordered Volvo B9TL Gemini 2s. From 2010 to 2017, SBS Transit and Land Transport Authority ordered 1,606 Volvo B9TL Gemini 2s, They were sent as knock-down kits and locally made by ComfortDelGro Engineering. == Third generation (2013–present) == From 2013 to the present day, Wrightbus make a double-decker body of a bus called the Wright Eclipse Gemini 3. It has a low- floor. The Wright Eclipse Gemini 3 body is built on the Volvo B5TL chassis and the hybrid Volvo B5LH chassis. === Operators === ==== United Kingdom ==== ===== Volvo B5TL ===== In 2014, Dublin Bus ordered over 600 Volvo B5TL Gemini 3s. In 2014, Lothian Buses ordered 25 Volvo B5TL Gemini 3s, In 2015, Yellow Buses ordered 8 Volvo B5TL Gemini 3s,. From 2015 to 2017, Delaine Buses ordered 3 Volvo B5TL Gemini 3s. ===== B5LH ===== In 2014, Stagecoach London ordered 32 Volvo B5LH Gemini 3s for use on route 53; In 2018, these were sold to Arriva London. In 2014, Metroline ordered 95 Volvo B5LH Gemini 3s. In 2015, London United ordered 28 Volvo B5LH Gemini 3s. In 2015, Tower Transit ordered 11 Volvo B5LH Gemini 3s. === 2014 improvements === In 2014, the bus was improved, it had new front headlamps, new grille, new front and rear bumpers, new rear lights and a new interior. ==== Operators ==== ===== United Kingdom ===== ====== Volvo B5TL ====== From 2015 to 2019, Lothian Buses ordered Volvo B5TL and B5LH Gemini 3s. In 2019, Lothian Buses ordered 30 open top Volvo B5TL Gemini 3s for use on City Sightseeing, Edinburgh Tour and Majestic Tour services. In 2017, Stagecoach Cumbria & North Lancashire ordered 7 open-top Volvo B5TL Gemini 3s for use on the Lakesider sightseeing service in the Lake District. In 2017, Translink ordered 10 Volvo B5TL Gemini 3s for Airport Express services, these served Belfast International Airport. ====== B5LH ====== In 2015, First Greater Manchester ordered 20 Volvo B5LH Gemini 3s for use on Vantage services. In 2016, they ordered five more Volvo B5LH Gemini 3s. ===== Hong Kong ===== In 2017, Kowloon Motor Bus ordered 200 Volvo B8Ls with Gemini 3 bodywork. In 2017, Long Win Bus ordered 10 Volvo B8L Gemini 3s. In 2017, Citybus ordered 46 Volvo B8L Gemini 3s. In 2017, New World First Bus ordered 7 Volvo B8L Gemini 3s. ===== Japan ===== In 2018, Hato Bus ordered 5 Scania K410EB Gemini 3 sightseeing buses. File:V6B1 at Jordan, West Kowloon Station (20190322115712).jpg|Kowloon Motor Bus Volvo B8L with Wright Eclipse Gemini 3 bodywork in Hong Kong File:Hato Bus 111 Eclipse Gemini 3 Open top bus (forward).jpg|Hato Bus open-top Scania K410EB with Wright Eclipse Gemini 3 bodywork in Tokyo File:(SGP-Singapore) A&S; Transit PD169L NIS 2023-12-24.jpg|A&S; Transit Volvo B8L with Wright Eclipse Gemini 3 bodywork in Singapore == References == == Other websites == *Wright Eclipse Gemini product description Category:Double-decker buses Category:Low-floor buses Eclipse Gemini",
 "title": "Wright Eclipse Gemini"
}