{
 "id": "1168640",
 "text": "The Wright Eclipse is a single-decker body of a bus. It has a low-floor. It was made from 2000 and 2019 by Wrightbus. A double-decker model of the Eclipse was also made, It was called the Wright Eclipse Gemini. A articulated model of the Eclipse was also made, It was called the Wright Eclipse Fusion. == First generation (2000–2010) == From 2000 to 2010, Wrightbus made a body of a bus called the Wright Eclipse. It had a low-floor. The Wright Eclipse body was built on the Volvo B7L chassis. In 2003, Wrightbus changed the name of the bus from Eclipse to Eclipse Metro. the interior and exterior was the same. The Wright Eclipse Metro body was still built on the Volvo B7L chassis. === Operators === From 2000 to 2010, FirstGroup ordered Wright Eclipses. === Eclipse Urban === From 2003 to 2009, Wrightbus made a body of a bus called the Eclipse Urban. It had a low-floor. It was made because sales of the Volvo B7L chassis were low because of the engine layout. The Eclipse Urban was built on the Volvo B7RLE chassis. === Eclipse Commuter === From 2004 to 2005, Wrightbus made a body of a bus called the Eclipse Commuter. It had a low-floor. The Eclipse Commuter was built on the Volvo B7RLE chassis. It was made for longer distance and intercity services. It was similar to a coach as it had storage under the floor and it had a small low floor area for passengers in wheelchairs. ==== Operators ==== In 2004, Ulsterbus ordered some Wright Eclipse Commuters. In 2005, Stagecoach West Scotland ordered two Wright Eclipse Commuters. === Eclipse SchoolRun === From 2006 to 2010, Wrightbus made a body of a bus called the Eclipse SchoolRun. It had a step-entrance. The Eclipse SchoolRun body was built on the Volvo B7R coach chassis. The Eclipse SchoolRun was made for school bus services. ==== Operators ==== From 2007 and 2008, Ulsterbus ordered 160 Eclipse SchoolRuns, From 2009 to 2010, they ordered another 61 Eclipse SchoolRuns. == Second generation (2008–2015) == From 2008 to 2015, Wrightbus made a body of a bus called the Wright Eclipse (known as the Eclipse Urban 2). It had a low-floor. The Eclipse 2 body was built on the Volvo B7RLE chassis. === Operators === In 2009, The Burnley Bus Company ordered 19 Wright Eclipse Urban 2s. In 2014, Some Wright Eclipse Urban 2s with air conditioning were sent to Malta for Malta Public Transport. == Third generation (2015–2019) == From 2015 to 2019, Wrightbus made a body of a bus called the Wright Eclipse (known as the Eclipse 3). It had a low-floor. The Eclipse 3 body was built on the Volvo B8RLE chassis. In 2017, the Eclipse 3 was improved, it had new front headlamps and rear lights, new grille, new front and rear bumpers and a new interior. === Operators === In 2015, Trentbarton ordered Wright Eclipse 3s. In 2015, Stagecoach in the Fens ordered Wright Eclipse 3s for the Cambridgeshire Busway. In 2017, East Coast Buses ordered some of the improved Wright Eclipse 3s. In 2018, Delaine Buses ordered ordered some of the improved Wright Eclipse 3s. == References == == Other websites == * Wright Eclipse Commuter product description * Wright Eclipse SchoolRun product description Category:Low-floor buses Eclipse",
 "title": "Wright Eclipse"
}