{
 "id": "116832",
 "text": "A potato chip (also known as a potato crisp in the United Kingdom) is a thin slice of potato that has been baked or fried and lightly salted or seasoned. Some popular flavors of potato chips are: salt and vinegar, ketchup, sour cream and onion. They are one of the most important snack foods in Western nations. In England, they are called \"Crisps\". In America, they are called \"Potato chips\". In the 1790s, Thomas Jefferson brought thick french fries to the United States from France. However, a customer at a restaurant at the Moon Lake Lodge in Saratoga Springs, New York, was making the chef, George Crum, angry by saying that the fries were not thin enough.King, Norman. The Almanac of Fascinating Beginnings. New York: Citadel Press, 1994Tuleja, Tad. Curious Customs. New York: Harmony Books, 1987 Panati, Charles. Panati's Extraordinary Origins of Everyday Things. New York: Harper and Row, 1987 Finally, George Crum became so angry he decided to exaggerate. He sliced the potatoes so thinly they could not even be pierced with a fork. Then he put them in ice water for 30 minutes. After he fried and salted them, he gave them to the customer - who, to his surprise, loved them. First named \"Saratoga Chips\" in 1853, it later became well known as \"potato chips\". Jones, Charlotte Foltz. Mistakes that Worked. New York: Doubleday, 1991 George Crum later opened his own restaurant that served his special potato chips. == Notes == ==References== * Choron, Sandra. The Big Book of Kids' Lists. New York: World Almanac Publications, 1985. * Caney, Steven. Steven Caney's Kids' America. New York: Workman Publishing, 1978 * Flexner, Stuart Berg. Listening to America. New York: Simon and Schuster, 1982. * Sutton, Caroline. How Did They Do That? New York: William Morrow and Co., 1987 * == Other websites == * Taquitos.net (more than 900 reviews of potato chips) * A short documentary How Do They Make Potato Chips? Category:Snack foods Category:Potato dishes",
 "title": "Potato chip"
}