{
 "id": "1168488",
 "text": "The Meitei people from Manipur use different traditional weapons for hunting, defense, and fighting. They use swords for close combat. Spears are thrown or used in battle. Shields protect warriors during fights. Arrows are shot from bows for hunting and battle. Darts are small weapons in wars. These weapons are made from materials like wood, bamboo, and animal body parts, showing the Meitei people's skill and connection to nature. Many of these weapons are used in various classical Meitei martial art forms, such as Thang Ta, Cheibi, etc.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 == Mythology == The lore of an old Meitei text named Pudin tells how the Thang (sword) and Ta (spear) were created from the body parts and bones of Tin Sidaba (also known as Pakhangba). According to the story, different parts of his body turned into weapons. The long blades of the sword, called Thangsang Kabak Thang, came from his body. The Tarung-Thang, an ancient sword, came from his right shoulder. His ribs turned into another sword called Thang Kairempa Khutphangton. His hands and fingers became smaller blades called Singtup Sangai, and a bone called Naklu Maiphangton Apik became a kitchen knife called Heijrang. His teeth turned into an iron axe.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 During a dance called Thengou (a dance with martial arts moves), Pakhangba held a sword called Tubi Cheirong-Hainaba Thang-Kaklen Yashaba, which made the sword a symbol of Pakhangba for the Meitei people.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 In another story, from the Thanglon Thangchat Puya, Tin Sidaba’s teeth became an axe called Chakhapa. Tin Sidaba’s grandson, Ngaite ngamba, was caught and died in a fish trap called Sara Lu. Various parts of his body turned into different weapons. For example, Chakot became a Thangchou, a common dao (knife). His limbs, called Yupang, created the Ta, also known as Khangsu-Ta (spear).Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 == Arambai == The Arambai was a key weapon used by the Meitei cavalry in battles. It is a dart with a sharp iron tip, like an arrowhead, and peacock feathers tied together to form a hole for a bamboo handle. There are two types: one made of wood and cane, and the other made of bamboo. The Arambai is about 2 feet long with the handle and 1.5 feet without it. It can be thrown in any direction, allowing the user to attack or retreat. It can travel 30 to 40 feet when thrown backward while retreating, and it can fly far when thrown forward. The dart’s feathers are made from 9 to 12 peacock quills, and warriors carried around 50 in quivers on their ponies. The sharp tip is often poisoned with snake venom, bee venom, or chili extract. The poison made the weapon even more deadly. The Arambai can be thrown up to 70 to 80 yards, and a throwing stick was sometimes used to increase the distance. It could be thrown one by one or in groups, depending on the situation. The Arambai was an important weapon for both defense and attack. == Arrows == In ancient Meitei language, the bow and arrow is called Waira. The use of arrows goes back a long time, as seen in old Puya manuscripts. One story, called Numit Kappa (shooting of the sun), tells how Khwai Nongchengba made a bow and arrow and used it to shoot down the elder sun, Taohuireng Ahanba. Later, Chaoba Meleiba Sangton Sanouba killed Khwai Nungjengba with an arrow at Kangla. Although arrows were mostly used in war, they were also used for other things. For example, there were arrows used in rituals, like Naowa Khoijuten (an arrow for a child’s birth ritual), Kasan Yongkap Ten (an arrow for shooting monkeys), Hangoi Taokapli (an arrow for shooting floating frogs), and Leinung Hikap Yaikap Ten (an arrow for black magic). These examples show that arrows had many uses beyond just being weapons. == Spears == In old Meitei language, the spear is called Timen. It is one of the oldest traditional weapons of the Meitei people. The spear is used in war and hunting. When in battle, the spearman uses a shield for protection, but for hunting, the spear alone is easier to use. The spear has two sharp iron tips at both ends of the handle. Different parts of the spear have special names, like Tjin (shoukhet), Mashong, Maya, Khang (Ta Machi), Takhok, Taning, and Tadon. There are different types of spears for different purposes. For example: # Lambu Ta is a large spear used to fight tigers. # Langshoi is the smallest but longest spear, used to guide elephants. # Khangnangta has a sharp arrow-like tip and is used for hunting pigs. # Sagol Ta (or Thougal Ta) is a lance used by cavalrymen. # Taronta (or Hunnata) is another spear used by cavalrymen. # Tapak has a wide tip and is used in battle against both people and animals. Each type of spear is made for a specific job, showing how skilled the Meitei people were in using these weapons. == Swords == === Swords resembling natural objects === In ancient times, swords were made to look like things in nature, such as tree leaves, grasses, birds, fish, and flowers. Old Meitei books like Miyat, Cheitharol Kumbaba, and Thanglon Thangchat mention these shapes. For example, Cheishuthang looked like a rainbow, Tarungthang was shaped like a Pongtha leaf, and Chaklai Thang looked like the leaf of the Leikham herb. Kapakthang resembled a Kabo Leiteng, and Pikanba looked like the Copella bird (Cheklaobi). Sairem Thang was shaped like the Labeo fish, and Laithang Nungthanba looked like the tip of the Leikham herb. Finally, Nungshamba resembled the Anguilla eel. These shapes show how the Meitei people connected their swords to nature. === Swords of royalties and nobles === Kings, nobles, courtiers, and high-ranking military commanders used two types of swords: Langthang (war sword) and Leiteng Thang (decorative sword). Langthang was used in battle and was heavier, longer, and thicker than the Leiteng Thang, which was used in martial shows and competitions. The Langthang had a sharp edge on the blade and at the tip of the slightly curved back. Old books like Ningthourolgi Thang, Ningthourol Lambuba, and others mention that kings had their swords specially made and gave them unique names. Some of the kings' swords and their names are: # King Urakonthouba had two swords named Soisen and Leirukhomba. # King Naothingkhong’s sword was called Ipuphaba. # King Charairongba had two swords named Khumomba and Pukanba. # King Kiyamba’s sword was named Lairenbang. # King Khagemba had four swords: Khunkhomba, Khoubomba, Loknung Lakaba, and Nongthang Yeklaba. # King Garibaniwaj’s sword was called Yakhu Yekteiba. # King Chingthangkhomb had a sword named Changlei Meiraba. # King Gambhir Singh had two swords named Khellei Meiraba and Yelei Meiraba. # King Chadrakirti’s sword was called Chenglei Meiraba. These names show how important swords were to the kings and their special value. === Swords of seven clans === Illustrations of the swords Names of the swords Romanisation Associated Meitei clans Romanisation Maximum breadth (cm) Maximum length (cm) Note(s) Chak Thaang Ningthouja (Mangang) 6.2 59.6 Tondumba Luwang 5.7 58.7 Tonkakpa Khuman 6.6 57.2 Pukak Thaang Angom 6.3 50.1 Yenbaa Matok Saaba Moirang (Moilang) 7.2 54.2 Laithaang Chinaaiba Kha Nganpa 5.9 58.6 Khunthong Thaang Sarang Leishangthem (Salang / Salai Leishangthem) 5.9 59.1 == Weapons of deities == Names of the weapons Romanisation Associated deities Purposes (if any) Note(s) Cheisu Thang Marjing walking stick/sword Thang Koiremba Koupalu (Koubru) sword (a) Thang-Kairemba Sanamahi (Asheeba) swords (b) Lukap- Thang ChapThang Atingkok (Atiya) sword Khangsu-Ta Poireiton spear == Weapons used in Thang Ta == Illustration(s) Names of the weapon(s)/performance(s) in Thang Ta Note(s) Chaina Ta + Khousalol (Khousarol) + Lan Thang Chaina Ta + Leiteng Thang Chaina Ta Khousalol (AKA Khousarol) + Chaina Ta Khousalol (AKA Khousarol) + Thang Leiteng Khousalol (Khousarol) + Lan Thang + Leiteng Thang Khousalol (Khousarol) + Thengkoulol (Thengkourol) Khousalol + Chaina Ta + Lan Thang + Leiteng Thang Lan Thang & Thang Leiteng Lan Thang + Leiteng Thang (Fig. 1) & Lan Thang + Chaina Ta (Fig. 2) Ta Khousaba (Ta Khoushaba) Ta Khousalol (Ta Khousarol) + Chaina Ta + Leiteng Thang Thengkoulol (Thengkourol) + Khousalol (Khousarol) + Leiteng Thang Thengkoulol (Thengkourol) + Ta Khousalol (Ta Khousarol) + Lan Thang Thengkoulol + Khousalol + Chaina Ta + Lan Thang Thengkoulol + Khousalol + Lan Thang + Leiteng Thang == Related pages == * Lai Haraoba == References == Category:Meitei culture Category:Weapons Category:Swords",
 "title": "Meitei traditional weapons"
}