{
 "id": "1168089",
 "text": "Cheibi, also known as Cheibi Gad-Ga, is a classical Meitei traditional martial art form. It is originated from the Ancient Kangleipak (present day Manipur state). It is practised using sticks and shields. It is related to other martial art forms of Sarit Sarak and Thang Ta. \"Cheibi\" itself is the name of the stick used in the martial art form. == Equipments == In ancient times, real swords and spears were allowed in the competition. Instead of using a sword and a leather shield, participants now use a stick wrapped in soft leather. The 'Cheibi' stick is typically around 2 to 2.5 feet in length, while the shield has a circumference of about 1 meter. == Venues == The competition happens in a circle that is 7 meters wide, set on a flat surface. Around the circle, there are two lines that are 2 meters apart from each other. == Rules == To decide who wins, points are earned during the duel. The points are given based on a combination of the participant's skill and the amount of force they use. == Groups == The All Manipur Cheibi Association organized the 1st Mangsatabam Iboyaima & Arambam Punabati Memorial and the 10th State Level Cheibi Championship 2010. The All Manipur Cheibi Association (AMCA) organized a \"Cheibi Competition,\" sponsored by the Kanglei Student Association, having two categories: Under-12 (U-12) and Under-14 (U-14), with separate events for boys and girls, in Imphal. The All Manipur Cheibi Association, along with Gem Public School, Pourabi, organized the 9th State Level Kangleipak Cheibi Yendamnaba for mini and sub-junior boys and girls. The event was sponsored by the Kangleipak Students Association (KSA) in Imphal East. The \"Cheibi Association of Tripura\" was established with the aim of preserving and promoting Cheibi, in the state of Tripura. == Further reading == * Details of Thang-Ta Game - Indian Martial Arts - Recognised by the Indian Olympic Association (IOA) == References == == Other websites == Category:Meitei culture Category:Martial art techniques",
 "title": "Cheibi"
}