{
 "id": "1168730",
 "text": "Maximilian II Emanuel (11 July 1662 — 26 February 1726), also known as Max Emanuel or Maximilian Emanuel, was the Elector of Bavaria from 1679 to 1726. He was the father of Charles Albert of Wittelsbach who later became the Holy Roman Emperor in the early 1740s and Joseph Ferdinand of Bavaria who was King of Spain Charles II's heir to the throne (Treaty of The Hague (1698)) (as he was getting ill) as he was the grandnephew the King. But he died before he could be the King. He was the son of Ferdinand Maria, Elector of Bavaria. He married Theresa Kunegunda Sobieska, a son of the King John III Sobieski of Poland. During the Habsburg Spanish Inheritance wars Max Emanuel's family became separated and the sons were held prisoners for several years in Austria. There his son Clemens August was brought up by Jesuits. Only in 1715 was the family re-united. The uncle Joseph Clemens, elector and archbishop of Cologne saw to it, that Clemens August received several appointments in Alt- Oetting, dioce Regensburg and at the Prince-Bishopric Berchtesgaden. He soon received pal conformation as bishop of Regensburg, later Cologne. ==Issue== Name Birth Death Age Notes First marriage with Maria Antonia of Austria, daughter of Emperor Leopold I, Holy Roman Emperor: First marriage with Maria Antonia of Austria, daughter of Emperor Leopold I, Holy Roman Emperor: First marriage with Maria Antonia of Austria, daughter of Emperor Leopold I, Holy Roman Emperor: First marriage with Maria Antonia of Austria, daughter of Emperor Leopold I, Holy Roman Emperor: First marriage with Maria Antonia of Austria, daughter of Emperor Leopold I, Holy Roman Emperor: Leopold Ferdinand 22 May 1689 25 May 1689 3 days Died in infancy. Anton 19 November 1690 19 November 1690 0 days Died at birth. Joseph Ferdinand 28 October 1692 6 February 1699 6 years see note 1 ([a]) Second marriage with Theresa Kunegunda Sobieska of Poland, daughter of King John III Sobieski: Second marriage with Theresa Kunegunda Sobieska of Poland, daughter of King John III Sobieski: Second marriage with Theresa Kunegunda Sobieska of Poland, daughter of King John III Sobieski: Second marriage with Theresa Kunegunda Sobieska of Poland, daughter of King John III Sobieski: Second marriage with Theresa Kunegunda Sobieska of Poland, daughter of King John III Sobieski: Stillborn child 1695 1695 None Maria Anna Karoline 4 August 1696 9 October 1750 54 years Since 1720 a nun, died unmarried and without issue. Charles Albert (of Wittelsbach) 6 August 1697 20 January 1745 47 years Elector of Bavaria, King of Bohemia and Holy Roman Emperor, marriage (∞) 1722 Maria Amalia Josepha Anna of Austria (1701–1756) Philipp Moritz Maria 5 August 1698 12 March 1719 20 years Elected bishop of Paderborn and Münster, died unmarried and without issue. Ferdinand Maria 5 August 1699 9 December 1738 39 years Imperial general Clemens August 17 August 1700 6 February 1761 60 years Grand Master of the Teutonic Order, Prince Archbishop of Cologne, Bishop of Regensburg, Paderborn, Osnabrück, Hildesheim and Münster. Wilhelm 12 July 1701 12 February 1704 2 years Died in early childhood. Alois Johann Adolf 21 June 1702 18 June 1705 2 years Died in early childhood. Johann Theodor 3 September 1703 27 January 1763 59 years Cardinal, Prince bishop of Regensburg, Freising and Liege Maximilian Emanuel Thomas 21 December 1704 18 February 1709 4 years Died in early childhood. ==Notes== ==References== Category:1662 births Category:1726 deaths Category:Nobility from Munich Category:People from the Electorate of Bavaria Maximilian II Emanuel, Elector of Bavaria Category:17th-century prince- electors of Bavaria Category:18th-century prince-electors of Bavaria Category:German Roman Catholics Category:Governors of the Habsburg Netherlands Category:Candidates for the Polish elective throne Category:German art collectors Category:18th-century art collectors Category:Imperial Army (Holy Roman Empire) people Category:People of the Great Turkish War Category:German military people of the Nine Years' War Category:German army commanders in the War of the Spanish Succession Category:Knights of the Golden Fleece Category:Burials at the Theatine Church, Munich",
 "title": "Maximilian II Emanuel"
}