{
 "id": "1168659",
 "text": "This is a list of flags that are used in Argentina. ==National flags== Flag Date Use Description 1861–present Flag of Argentina A triband, composed of three equal horizontal bands colored light blue, white and light blue with a yellow Sun of May in the center. 1812 – National flag (1812–1818). Civil flag and ensign (1812–). Ornamental flag (1818–). The flag of Argentina without the Sun of May. 1818–present Flag of Argentina (vertical). A vertical triband, composed of three equal vertical bands coloured light blue, white and light blue with a yellow Sun of May in the center. ==Provincial flags== Flag Administrative division Adopted Description Buenos Aires City 1995 The center of the flag of Buenos Aires has a coat of arms created by Spaniard Juan de Garay on October 20, 1580. Buenos Aires Province 1997 Flag of Buenos Aires Province. Catamarca Province 2011 Chaco Province 2007 A previous design from 1995 by a graphical artist was never used as it was deemed a painting and not a symbol. Chubut Province 2004 Córdoba Province 2014 A vertical tricolor of red, white and blue with the Society of Jesus sun in the center of the white stripe. Corrientes Province 1986 The flag traces its heritage to a simpler design created on December 24, 1821, by a Constituent Congress. Entre Ríos Province 1987 It was hoisted for the first time on March 1, 1815. Similar to the Artigas flag. Formosa Province 1991 Jujuy Province 1994 It features the same design as the (Spanish for \"National Flag of Our Civil Freedom\"), a flag used by Argentine military leader Manuel Belgrano. La Pampa Province 1993 A horizontal triband of blue (top and bottom) and white defaced with the Coat of arms of La Pampa Province at its center. La Rioja Province 1986 Mendoza Province 1992 Known as the flag of the Andes, it was used by Argentine patriot José de San Martín during his military campaigns in Chile and Peru. Misiones Province 1992 A triband, officially used on February 12, 1992. The red is a symbol \"for the blood spilled to sustain our freedom and independence\", the blue, \"of our decision for the Republic\", and the white, \"of our distinction and greatness\" according to José Gervasio Artigas. Neuquén Province 1989 Río Negro Province 2009 Probably based on the flag of the Kingdom of Araucanía and Patagonia. Salta Province 1997 Flag of Salta. San Juan Province 2018 Known as the \"Civic Flag\", it was first used by the IV Division of the Army of the Andes, formed by San Juan natives during the Argentine war for Independence. It is also known as the \"Cabot Flag\" as the IV Division was led by Lieutenant General Juan Manuel Cabot. It is the only flag of an Argentine province whose reverse differs from the obverse. San Luis Province 1988 The flag displays the provincial coat of arms centered on a white field. Santa Cruz Province 2000 Santa Fe Province 1986 Used unofficially since August 3, 1822, it is a vertical tricolor of red, white and blue with the provincial coat of arms in the center. Santiago del Estero Province 1985 Tierra del Fuego Province 1999 A diagonal bicolor of sky blue and orange with an albatross in the center and the Southern Cross in the fly. Tucumán Province 2010 A horizontal triband of white (top and bottom) and blue. === Historical === Flag Date Use Description 1990–2007 Flag of Chaco Province 1815–1825 Flags of Córdoba Province 2010–2014 Flag of Córdoba Province 1815 Flag of Entre Rios 1822–1824 Flag of Entre Rios 1997–2018 Flag of San Juan 1815–1821 Flag of Santa Fe 1819–1821 Flag of Santa Fe 1821 Flag of Santa Fe 1995–2010 Flag of Tucumán ==References== *",
 "title": "List of Argentine flags"
}