{
 "id": "1168489",
 "text": "Flanagan is a fictional character created by Spanish writers Andreu Martín and Jaume Ribera. He is the main character in a series of detective novels. The character’s real name is Juan Anguera, but he is known by his nickname, Flanagan. The books are very popular and have sold over two million copies. They have been translated into many languages, including Spanish, English, French, Galician, German, Italian, and Basque. == Description of the Character == Flanagan is a teenager from Barcelona who works as a private detective in his free time. He starts solving small mysteries, like finding lost diaries or discovering who wrote anonymous love letters. However, as the series progresses, he takes on more serious cases, such as child abuse, baby trafficking, theft, and even murder. Flanagan often works with different female characters throughout the series, and his personal relationships are an important part of the stories. The authors have said that they do not want the books to be labeled as \"young adult literature.\" Instead, they see the series as detective novels that can be enjoyed by readers of all ages. Many fans first read the books when they were young but have continued to follow Flanagan’s adventures as they grew older. == Books == The Flanagan series consists of 13 novels. Each book is independent, but they are connected, and the stories often mention how previous cases were resolved. The first book was published in 1988, and the most recent one, Els bessons congelats (The Frozen Twins), was released in 2015. The books were originally written in Catalan and later translated into Spanish and other languages. The books in the series include: # No demanis llobarro fora de temporada (Don’t Ask for Sea Bass Out of Season) (1987) # Tots els detectius es diuen Flanagan (All Detectives Are Called Flanagan) (1990) # No te'n rentis les mans, Flanagan (Don’t Wash Your Hands, Flanagan) (1993) # Flanagan de luxe (Flanagan de Luxe) (1994) # Alfagann és Flanagan (Alfagann Is Flanagan) (1996) # Flanagan Blues Band (Flanagan Blues Band) (1997) # Flanagan 007 (Flanagan 007) (1998) # Només Flanagan (Only Flanagan) (2000) # Els vampirs no creuen en Flanagans (Vampires Don’t Believe in Flanagans) (2002) # El diari vermell de Flanagan (The Red Diary of Flanagan) (2004) # Jo tampoc em dic Flanagan (I’m Not Called Flanagan Either) (2005) # Flanagan Flashback (Flanagan Flashback) (2009) # Els bessons congelats (The Frozen Twins) (2015) == Themes and Style == The Flanagan books mix detective stories with humor and action. The character grows and matures throughout the series, both in his detective skills and his personal life. The authors have mentioned that they were inspired by famous detectives like Sherlock Holmes and Philip Marlowe. They also include references to their favorite music, such as Creedence Clearwater Revival and Guns N' Roses. One unique book in the series is El diari vermell de Flanagan (The Red Diary of Flanagan), which explores themes of sexuality. It is a parallel story to El diari vermell de Carlota (The Red Diary of Carlota) by Gemma Lienas. Both books describe the same events but from different perspectives. == Legacy == The Flanagan series has won several literary awards and is often recommended as reading material in schools. The character has become very popular in Spain and other countries, and his adventures continue to attract new readers. Category:Fictional characters",
 "title": "Flanagan"
}