{
 "id": "1168005",
 "text": "Thang Ta () is a classical Meitei traditional martial art form. It is originated from the Ancient Kangleipak (present day Manipur state). It is practised using weaponry. It is considered as the sibling of Sarit Sarak, which uses no weapons. Thang Ta and Sarit Sarak are considered as the sub forms of Huiyen Lallong martial art form. == Word origin == In Meitei language, \"Thang\" means sword and \"Ta\" means spear. == Mythology == The story of Thang-Ta comes from the religious myths of the Meitei community. According to their myths, the limbs and bones of their ancestor, Tin Sidaba (also called Pakhangba), turned into different swords and tools, some used in Thang-Ta and others in rituals. For example, his ribs became the broad sword (thangjao) and one of his fingers became a kitchen knife (heijrang). Today, each of the seven Meitei clans has a special sword that is placed during ceremonies to honor their ancestors. The creation story, Leishemlon, says Pakhangba is the creator of Thang-Ta.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 == History == === Medieval times === Thang-Ta reached its peak during the rule of King Khagemba (1597-1652 CE). The Chainarol manuscript, written in the 16th and 17th centuries, explains the war rules of the time. It says that if an unarmed person was challenged, they could get weapons and decide when to fight. If someone got a wound and blood was shed during the fight, that person lost. Afterward, the fighters would share food and wine provided by their wives. The winner would then cut off the loser's head and, if asked, cremate the body. The winner often kept the head as a trophy.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 === Modern times === After losing the Anglo-Manipuri War of 1891, Manipur was taken over by the British. To honor the bravery of the Manipuri army, led by Major General Paona Brajabasi, the British made it illegal for people in Manipur to own weapons and banned their martial arts, including Thang-Ta. Thang-Ta went underground and was kept alive by a few experts. When India became independent in 1947, Manipur joined India in 1949 and became a state in 1972. Slowly, Thang-Ta started to come back.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 == Parts == Thang-Ta is made up of four main parts: the spear dance (Ta-khousarol), sword fighting (Thanghairol), unarmed combat (Sarit- Sarat), and the art of touch and call (Thengkourol).Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 === Ta Khousarol (Spear dance) === Ta-khousarol includes nine difficult and detailed movement sequences: Maram Nungshetpa, Maram Achouba, Maram Macha, Tangkhul, Athou Achouba, Thel, Maram Nungjrongba, Kabui, and Athou Chumthang. Each sequence has a specific order of moves, like salutation, removing stakes, watching the enemy, and fighting. The martial artist holds a spear (ta) in the right hand and a round shield (chungoi) in the left. The spear is about 150 cm (60 inches) long, made of bamboo, with blades on both sides, and decorated with colored thread. The shield is about 90 cm (36 inches) long and 45 cm (18 inches) wide, usually black with a painted design. Today, the spear dance is a popular solo performance for skilled martial artists, and Ta-khousarol techniques are often used by drama directors and choreographers in Manipur.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 === Thanghairol (sword fighting) === Thanghairol has two types of swordplay: decorative swordplay (Leiteng-thang) and combat swordplay (Yanna- thang). The skilled swordsman uses a shield (chungoi) and three swords: a right-hand sword (yet-thang), a left-hand sword (oi-thang), and an extra sword (tendon-thang) kept at the back, used in emergencies. In decorative swordplay (Leiteng-thang), the swordsman moves with one or two swords and a shield, showing skill and bravery. One common move is twirling two swords around the body in the shape of a figure eight without them touching. In combat swordplay (Yanna-thang), the swordsman learns the \"Thanglon\" language of the sword, which includes moves and footwork to defend and counterattack. The swords are about 60 cm (24 inches) long, straight or slightly curved, with handles made of brass and wood.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 === Sarit Sarat (unarmed combat) === Unarmed combat (Sarit- sarat) teaches a series of techniques that every student must learn. The training starts with somersaults and rolling on the floor, then moves to ways of defending and attacking without weapons. It focuses on using punches and kicks to protect yourself from sudden attacks and also teaches how to fight against an armed opponent without weapons. In Thang-Ta stage performances, there is a popular act where a woman defends herself from a male attacker using Sarit-sarat self-defense techniques.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 === Thengkourol === Thengkourol involves special movements that must be done in a certain order, following the pattern of a coiled snake (paphal). The martial artist connects the points of the pattern with their feet. Unlike other fighting techniques, Thengkourol is a magical practice where the movements and prayers are believed to affect the enemy or kingdom.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 The knowledge of Thengkourol is highly respected, and those who know it are considered to have the greatest understanding of warfare. However, very little is known about it because it is kept secret. Thengkourol is never shown in public, and only a few martial artists claim to know it. There are nine Thengkou forms: Akao, Leiphal, Leichai, Nongphan, Leikak, Leinet, Lankak, Akham, and Leishit. Some records mention that Thengkourol was used to win battles, such as during the reign of King Garibniwaz (1709-1748) and Rajarshi Bhagyachandra (1748-1799). To learn Thengkourol, a student must be a trusted disciple of a guru and over forty years old because it is a powerful and dangerous art. These rules ensure that the student is mature enough to use it carefully.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC- CLIO, 2010. p. 294-297 == Codes of conduct == Training in Thang-Ta follows strict traditions. It begins with an initiation ceremony called Oja Boriba (teacher acceptance). On the chosen day, the training area is cleaned, and lights are lit in front of Pakhangba's representations. The student meditates in front of Pakhangba, then bows and gives the teacher gifts like fruit, cloth (usually a khudei, a traditional Meitei clothing worn by men), betel leaves, betel nuts, candles, and a small payment of money. The teacher accepts the gifts and the student as a disciple, and the student officially starts training. There are strict rules in the training centers.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 Following are the rules for Thang-Ta training: 1\\. The student must enter the school (sindamsang) or teacher’s home without shoes. 2\\. The student must bow to the teacher and any elders present. 3\\. The training floor must be cleaned and sprinkled with water before and after each session. 4\\. Pregnant or menstruating women are not allowed on the training floor. 5\\. Before training, the student must bow to Pakhangba with respect. 6\\. The student must bow to their partner and salute them with their weapon before each session. 7\\. Before using any weapon, the student must touch it with their fingers and then touch their forehead to show respect. 8\\. The student’s feet must never touch their weapon or the partner's weapon. 9\\. If someone walks between the partners practicing, training must stop for the day. 10\\. Students must stand still when the teacher is giving instructions. 11\\. No student is allowed to come to the school drunk. 12\\. Chewing betel or smoking is not allowed in the school or around the teacher. 13\\. At the end of training, the student must bow to the teacher again.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 These rules make sure students learn in a safe and controlled way because even a small mistake can cause injury or death. Students first practice basic exercises to improve balance, flexibility, agility, endurance, and coordination. Beginners start with sticks of different sizes. After becoming skilled, they move on to practice with real weapons like swords, shields, and spears.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 == Weaponry == Thang Ta means \"The Art of the Sword and Spear.\" It combines weapons like the sword, spear, and dagger with movements that focus on control and breathing. Thang Ta is an important part of Manipur's heroic traditions. According to legends, all movements of the Meitei people are believed to have come from Thang Ta. The main focus of Thang-Ta is the \"sword.\" There are many sword drills to practice basic moves and steps. Some drills are done with a partner, while others can be done alone, especially at first. The spear moves in Thang-Ta are more complicated and are best seen to be understood. Teachers warn students that if they step incorrectly, they could hurt themselves, as the movements follow specific patterns, like the Pakhangba, a coiled serpent design, of Meitei mythology and religion. Illustration(s) Names of the weapon(s)/performance(s) Note(s) Chaina Ta + Khousalol (Khousarol) + Lan Thang Chaina Ta + Leiteng Thang Chaina Ta Khousalol (AKA Khousarol) + Chaina Ta Khousalol (AKA Khousarol) + Thang Leiteng Khousalol (Khousarol) + Lan Thang + Leiteng Thang Khousalol (Khousarol) + Thengkoulol (Thengkourol) Khousalol + Chaina Ta + Lan Thang + Leiteng Thang Lan Thang & Thang Leiteng Lan Thang + Leiteng Thang (Fig. 1) & Lan Thang + Chaina Ta (Fig. 2) Ta Khousaba (Ta Khoushaba) Ta Khousalol (Ta Khousarol) + Chaina Ta + Leiteng Thang Thengkoulol (Thengkourol) + Khousalol (Khousarol) + Leiteng Thang Thengkoulol (Thengkourol) + Ta Khousalol (Ta Khousarol) + Lan Thang Thengkoulol + Khousalol + Chaina Ta + Lan Thang Thengkoulol + Khousalol + Lan Thang + Leiteng Thang == Practices == === Lion's Posture === To start the sword drill, one should stand with their feet shoulder-width apart. One should turn to the left by pivoting on the balls of both feet, making their feet form a 45-degree angle. One should lean forward until their left foot's toes line up with their knee and chin. Their body should make a straight line from the back of their head to their right heel. This is called the \"Lion's Posture\" or basic stance. == In university education == The Department of Thang-Ta at the Manipur University of Culture teaches self-defense, skills for work, health, self-discipline, and good behavior to young people. It also studies the Meitei culture and history of Manipur and nearby states. == Influences on other performing arts == Thang-ta influenced two other traditions in Manipur: classical Manipuri dance and Nata Sankirtana, which includes drum dancers, cymbal dancers, and singers. The hand movements and footwork in Manipuri dance come from thang-ta. The basic stances in drum and cymbal dances are also inspired by this martial art.Green, Thomas A.., Svinth, Joseph R.. Martial Arts of the World: An Encyclopedia of History and Innovation. United States: ABC-CLIO, 2010. p. 294-297 == Related pages == * Gatka == Bibliography == * Brara, N. Vijaylakshmi. 1998. Politics, Society and Cosmology in India's North East. New Delhi: Oxford Publishing House. * Doshi, Saryu, editor. 1989. Dances of Manipur: The Classical Tradition. Bombay: Marg Publications. * Hodson, T. C. 1908. The Meitheis. London: David Nutt. == References == == Other websites == * Category:Meitei culture Category:Martial art techniques",
 "title": "Thang Ta"
}