{
 "id": "1168209",
 "text": "Anton \"Ton\" Pronk (21 May 1941 – 26 August 2016) was a Dutch football defender who played for Ajax in the 1960s and for FC Utrecht in the early 1970s. He was a typical \"stopper\" (the middle of the three defenders, who was positioned slightly behind the other two, the left and right back). Not much later, the \"four-two-four\" system came into vogue, which worked with two central defenders. Regarded to be one of the finest Dutch defenders of all time. Known for his exceptional man-marking abilities and defensive attributes. ==Club career== Emerging from the youth academy of Ajax Amsterdam, Pronk played in 30 of 34 games for the first team in the Eredivisie, the highest division in Dutch football, at the age of 19 and made his debut on 4 September 1960 (Matchday 3) in a goalless draw at home to PSV Eindhoven. At the end of the season, he finished second with his team - two points behind Feyenoord Rotterdam; in the competition for the KNVB Cup, he played seven games and won with his team in the final over NAC Breda 3–0. During his membership of the club until the end of the 1969–70 season, he played 337 games, in which he scored eight goals, his first on 5 November 1967 (matchday 13) in a 9–1 home win against NEC Nijmegen, scoring in the ninth minute to make it 2–0. He won the championship four times and the national club cup three times, as well as the International Football Cup, also known as the Rappan Cup, at the inaugural stage of the competition. He made 16 appearances in four appearances in the European Cup competition, only reaching the final on 28 May 1969, which they lost 4–1 to AC Milan at the Estadio Santiago Bernabéu. In the competition for the European Cup Winners' Cup, he only played the two second round matches against Újpesti Dózsa SC Budapest. In the competition for the Messestädte- Pokal, the predecessor competition of the UEFA Cup, he played only three games in his participation in 1969/70. In the competition for the Rappan Cup, he played the most in four participations with a total of 23 games. At the age of 29, he considered a change of club and made 62 appearances for league rivals FC Utrecht from 1970 to 1974, scoring two goals, and achieving the best result in the championship with sixth place at the end of the 1971/72 season. He played a single cup game for FC Utrecht; on 9 January 1972, he lost it 2–0 at HFC Haarlem in the 1st round. ==International career== He played 19 international matches for the senior national team and made his debut on 14 May 1961, in the second World Cup qualifier of Group 4 in a 1–1 draw against the GDR national team in Leipzig. In 1961, 1962 and 1963 he played eleven friendly internationals, as well as four European Championship qualifiers in 1964 and one on 4 October 1967 against the Danish national team. He played his last game as a national player on 7 May 1969 in the third World Cup qualifier of Group 8 in a 1–0 victory over the Polish national team in Rotterdam. ==Later life and death== After the active playing career, Pronk was Ajax's scout from 1976 to 1985. He then coached VV IJsselmeervogels and Ajax 2. In 1991, he was nominated by Louis van Gaal as head scout. He held this position until his retirement in 2007. Among the players he scouted were Jari Litmanen, Finidi George and Nwankwo Kanu. He was also involved in the later arrival of Zlatan Ibrahimović and Cristian Chivu. Ton Pronk died in 2016, at the age of 75 from the effects of the disease ALS. ==Honours== *International Football Cup: 1962 *Eredivisie: 1966, 1967, 1968, 1970 *KNVB Cup: 1961, 1967, 1970 *European Cup runner-up: 1969 ==References== ==Other websites== * Category:1941 births Category:2016 deaths Category:Footballers from Amsterdam Category:Association football defenders Category:Dutch men's footballers Category:Netherlands men's international footballers Category:AFC Ajax players",
 "title": "Anton Pronk"
}