{
 "id": "1169733",
 "text": "Volgren is an Australian bus and coach brand headquartered in Dandenong it was first founded in 1977 by Grenda Corporation a bus operator from Melbourne.Victorian Government Manufacturing Hall of Fame Volgren Australia Pty Ltd – 2006 Inductee Greater Dandenong Volgren used only chassis from Volvo because Grenda owned a Volvo buses dealership this continued until 1989 when the dealership was relinquished.\"Industry News\" Australian Bus Panorama 4/6 May 1989 page 5 The name Volgren is a mix of the names of the original investors which are Volvo and Grenda in December 2011 Marcopolo a Brazilian bus brand bought a 75% stake on the company.Volgren Press Release Volgren 13 December 2011 then it increased to 100% in 2014.Marcopolo acquires remaining stake in Volgren Australasia Bus & Coach 7 April 2017 making Volgren a subsidiary of Marcopolo. == Factories and Models == === Factories=== * Dandenong, Victoria (VG) completed Volgren's first bus in October 1979 * Malaga, Western Australia (VP) opened in April 1999 to fulfill a contract to body Mercedes-Benz O405NHs for Transperth * Eagle Farm, Queensland (VQ) opened in February 2010 Former factories: * Tomago, New South Wales (VT) opened in March 2010, closed July 2012 === Models === === City Buses === * Optimus * CR228 * CR227 * CR226 * CR225 * CR224 * CR222 * CR221 === Coaches === * Endura * SC222 * SC221 == Operators == Australia * ComfortDelGro Australia * Transdev Australasia * Ventura Bus Lines * Transperth * Kinetic Group Asia * Hong Kong ** Kowloon Motor Bus formerly operated 1 Volvo B9TL, 17 MAN 24.310 HOCLNR-NLs and 21 Volvo Super Olympians. ** Citybus formerly operated 1 MAN 24.350 HOCLNR-NL and 1 Scania K94UB * Singapore ** SBS Transit formerly operated 50 Volvo Super Olympians, a diesel powered Volvo B10BLE, a Scania L94UB, a Volvo Super Olympian prototype, a Mercedes-Benz O405G prototype, a Volvo B5RLEH and 12 CNG-powered Volvo B10BLEs. ** SMRT Buses formerly operated 15 Mercedes-Benz O405s, 11 Hino HS3KRKKs and a HS3KRKA, 2 Dennis Lances and 21 Mercedes-Benz O405Gs. * Malaysia, a substantial number of buses were fitted with the Volgren bodywork as well. Examples can be found in the capital Kuala Lumpur, Shah Alam and Johor Bahru, state capital of Johor. * Japan ** Nishi-Nippon Railroad bus, Toei Bus, Niigata Kotsu and Nara Kotsu currently operates Scania K360UA6×2/2LB with Optimus body. The body of these buses is 5 centimeters narrower than normal ones. == References == Category:Automobile companies",
 "title": "Volgren"
}