{
 "id": "1169529",
 "text": "The Wright GB Kite is a series of zero-emission single-deck buses. They have low-floors. They have been made from 2022 to the present day by Wrightbus. The GB Kite is made as a fuel cell electric bus called the Hydroliner FCEV, and as a battery electric bus called the Electroliner BEV. == Hydroliner FCEV == From 2022 to the present day, Wrightbus make a fuel cell electric bus called the Hydroliner FCEV. It has a low-floor. === Operators === ==== United Kingdom ==== In November 2021, Metrobus ordered 20 Hydroliner FCEVs for use on the Fastway network. ==== Germany ==== In 2024, ordered 31 Hydroliner FCEVs, In 2025, they ordered 29 more Hydroliner FCEVs. In 2023, ordered 12 Hydroliner FCEVs for service in Geilenkirchen in North Rhine-Westphalia. In 2024, Saarbahn ordered for 28 Hydroliner FCEVs for service in Saarbrücken. In 2024, ordered 46 Hydroliner FCEVs. ==== Australia ==== In May 2022, Body of buses maker Volgren ordered 2 Hydroliner FCEV chassis for the company to body. == Electroliner BEV == From 2022 to the present day, Wrightbus make a battery electric bus called the Electroliner BEV. It has a low-floor. === Operators === ==== London ==== In 2024, Abellio London ordered 12 Electroliner BEVs for service on route E7. These Electroliner BEVs had a different front end to meet TfL's Bus Safety Standard rules, In 2024, Arriva London, ordered 11 Electroliner BEVs. In October 2024, the Go-Ahead Group signed a £500 million three-year deal for Wrightbus to make over 1,200 electric buses to its bus companies; most of these buses will be from the Electroliner range. ==== United Kingdom ==== In August 2022, First Leicester ordered 68 Electroliner BEVs, In 2024, they ordered 18 more Electroliner BEVs. In August 2023, First York ordered 24 Electroliner BEVs. In January 2024, First West Yorkshire ordered 32 Electroliner BEVs. In March 2024, First Hampshire & Dorset ordered 61 Electroliner BEVs. In 2024, First Eastern Counties ordered Electroliner BEVs. while In 2023, Translink ordered 28 Electroliner BEVs. In 2023, The Oxford Bus Company ordered five Electroliner BEVs. ==References== == Other websites == * * Wrightbus Electroliner product description * Wrightbus Hydroliner product description Category:Low-floor buses GB Kite Category:Battery electric buses",
 "title": "Wright GB Kite"
}