{
 "id": "1169016",
 "text": "India, officially the Republic of India is a country in South Asia, consisting of 28 states and eight union territories. All Indian states and some of the union territories have their own elected government and the union territories come under the jurisdiction of the Central Government. India has its own national symbols. Apart from the national symbols, the states and union territories have adopted their own seals and symbols including butterflies listed below. == States == List of Indian state butterflies State Common name Binomial name Image IUCN category Andhra Pradesh Small long-brand Bushbrown Mycalesis igilia Least Concern Arunachal Pradesh Kaiser-I-Hind Teinopalpus imperialis Assam Black Tipped Archduke Lexias dirtea dirtea Bihar Common- Peacock Swallowtail Papilio bianor Chhattisgarh Asian-Common Redeye Matapa aria Goa Malabar tree nymph Idea malabarica Vulnerable Gujarat African monarch Danaus chrysippus Least Concern Haryana Striped blue crow Euploea mulciber Least Concern Himachal Pradesh Common-Blue Apollo Parnassius hardwickii Vulnerable Jharkhand Common Evening-Brown Melanitis leda Karnataka Southern Birdwing Triodes minos Kerala Malabar banded peacock Papilio buddha Madhya Pradesh Common Nawab butterfly Polyura athamas Maharashtra Blue Mormon Papilio polymnestor Least Concern Manipur Manipur jungle queen Stichophthalma sparta Endangered Meghalaya Constable Dichorragia nesimachus deiokes Mizoram Northern Jungle Queen Stichophthalma camadeva Nagaland Indian Jezebel Delias eucharis Odisha Blue-tiger butterfly Tirumala limniace Punjab Indian fritillary Argynnis hyperbius Least Concern Rajasthan Common emigrant Catopsilia pomona Sikkim Himalayan Blue Duke Bassarona durga durga Tamil Nadu Tamil yeoman Cirrochroa thais Telangana Painted sawtooth Prioneris sita Tripura Common Birdwing Troides helena Uttar Pradesh Common Silverline Cigaritis vulcanus Uttarakhand Black Swallowtail Emerald Papilio bianor polyctor West Bengal Common Lascar Pantoporia hordonia Vulnerable == Union territories == List of Indian state butterflies (Union territories) Union territory Common name Binomial name Image IUCN category Andaman and Nicobar Islands Andaman King- Crow butterfly Euploea andamanensis Vulnerable Chandigarh Delhi Common Rose butterfly Pachliopta aristolochiae Lakshadweep Blue Moon butterfly Hypolimnas bolina Puducherry ==References== Butterflies Indian state animals Butterflies Butterflies",
 "title": "List of Indian state butterflies"
}