{
 "id": "1169273",
 "text": "Samsung Wallet () is an mobile digital wallet developed and made by Samsung Electronics. It was revealed in February 9, 2022. It was came out in June 24, 2022. It was merged with Samsung Pay and Samsung Pass. == Features == The Samsung Wallet added new features to people can upload their state IDs and driver's license. On July 20, 2023, The Samsung Wallet works with the Student IDs. Peer-to-Peer payments will be added new features to Samsung Wallet in coming soon. == Availability == The Samsung Wallet currently works with the 36 countries such as Finland, Bahrain, South Korea, United Kingdom, United States, Australia, Qatar, South Africa, Denmark, United Arab Emirates, Sweden, Bahrain, Oman, Kuwait, Norway, Switzerland, Kazakhstan, Canada, Belgium, Luxembourg, Netherlands, Brazil, Taiwan, China, Hong Kong, India, Singapore, Malaysia, Egypt, Vietnam, Spain, United Kingdom, Germany, France, Saudi Arabia and Italy. ===History=== When Samsung Wallet developed in June 2022, it only works with the eight countries such as South Korea, China, Spain, United Kingdom, Germany, Italy, France and United States. in October, 2022, The Samsung Wallet works in thirteen new countries such as Finland, South Africa, Denmark, Qatar, United Arab Emirates, Sweden, Kazakhstan, Bahrain, Oman, Kuwait, Norway, Vietnam and Switzerland. in Late January 2023, The Samsung Wallet works in eight new countries such as Australia, Canada, Brazil, Taiwan, Hong Kong, India, Singapore and Malaysia. On February 7, 2025, The Samsung Wallet works in three new european countries such as Belgium, Luxembourg and Netherlands. == Worked devices == The Samsung Wallet worked with the Samsung Galaxy devices in the list. ===Mobile phones=== Samsung Galaxy S series *Samsung Galaxy S7 (no longer worked) *Samsung Galaxy S7 Edge (no longer worked) *Samsung Galaxy S8 *Samsung Galaxy S8+ *Samsung Galaxy S9 *Samsung Galaxy S9+ *Samsung Galaxy S10 *Samsung Galaxy S10e *Samsung Galaxy S10+ *Samsung Galaxy S10 5G *Samsung Galaxy S20 *Samsung Galaxy S20+ *Samsung Galaxy S20 Ultra *Samsung Galaxy S21 *Samsung Galaxy S21 FE *Samsung Galaxy S21+ *Samsung Galaxy S21 Ultra *Samsung Galaxy S22 *Samsung Galaxy S22+ *Samsung Galaxy S22 Ultra *Samsung Galaxy S23 *Samsung Galaxy S23 FE *Samsung Galaxy S23+ *Samsung Galaxy S23 Ultra *Samsung Galaxy S24 *Samsung Galaxy S24 FE *Samsung Galaxy S24+ *Samsung Galaxy S24 Ultra *Samsung Galaxy S25 *Samsung Galaxy S25+ *Samsung Galaxy S25 Ultra Samsung Galaxy Note series *Samsung Galaxy Note 8 *Samsung Galaxy Note 9 *Samsung Galaxy Note 10 *Samsung Galaxy Note 20 *Samsung Galaxy Note 20 Ultra Samsung Galaxy Z series *Samsung Galaxy Z Fold 1 *Samsung Galaxy Z Fold 2 *Samsung Galaxy Z Flip 1 *Samsung Galaxy Z Fold 3 *Samsung Galaxy Z Flip 3 *Samsung Galaxy Z Fold 4 *Samsung Galaxy Z Flip 4 *Samsung Galaxy Z Fold 5 *Samsung Galaxy Z Flip 5 *Samsung Galaxy Z Fold 6 *Samsung Galaxy Z Flip 6 ===Smartwatches=== Samsung Galaxy Watch *Samsung Galaxy Watch 6 == References == == Other websites == * Category:2022 establishments in South Korea Category:Mobile payments",
 "title": "Samsung Wallet"
}