{
 "id": "1169334",
 "text": "Castle Bravo was a nuclear test by the United States on March 1, 1954. It was part of Operation Castle, a series of nuclear tests. During the test, a thermonuclear weapon, named SHRIMP, was exploded at Bikini Atoll in the Marshall Islands. The test was the largest ever conducted by the United States. == Test == The test was part of Operation Castle, a series of high- yield nuclear tests by the U.S. Atomic Energy Commission and the Department of Defense. Castle Bravo was the first test of a \"dry\" thermonuclear bomb, meaning it used solid fuel (lithium deuteride) instead of liquid hydrogen like the earlier Ivy Mike test in 1952. This made the bomb smaller and easier to deliver. Scientists expected Castle Bravo to have a yield of 5 to 6 megatons (unit equivalent to one million tons of trinitrotoluene), but it produced 15 megatons, making it the largest U.S. nuclear explosion to ever occur. The miscalculation happened because the lithium-7 isotope, which was thought to be inactive, actually increased the power of the explosion. The explosion formed a huge mushroom cloud that reached 130,000 feet (40 km) in altitude in six minutes, and the blast left a crater 6,510 feet (1,980 m) wide and 250 feet (76 m) deep. The unexpected power of the bomb caused a high amount of radioactive fallout, which spread over 7,000 square miles (18,000 km²). Nearby atolls, including Rongelap, Rongerik, Ailinginae, and Utirik, were heavily contaminated, and many islanders were exposed to radiation. The United States did not evacuate them before they received high levels of radiation, and many suffered severe health problems in the years that followed. Fallout even reached a Japanese fishing boat, Fifth Lucky Dragon, causing one crew member to die and others to suffer serious illnesses. The contaminated fish it carried entered Japanese markets, creating public fear and damaging the fishing industry. Many people stopped buying fish because they did not know where the contaminated ones had been sold. This led to economic problems and made many in Japan angry at the United States. The incident also forced the federal government to share more information about nuclear tests, as the radioactive effects could not be kept secret. The test led to international criticism and raised concerns about nuclear testing. == Consequences and fallout == The Castle Bravo test resulted in extensive unintended radioactive contamination, made worse by poor weather conditions and shifting wind patterns. Despite the risk of fallout reaching inhabited areas, Major General Percy Clarkson and Dr. Alvin C. Graves proceeded with the detonation as planned. Following the explosion, radioactive particles were carried eastward, affecting several inhabited atolls, including Rongelap, Utirik, and Ailinginae. U.S. personnel stationed on Rongerik Atoll observing the test were also exposed to radiation. On Rongelap Atoll, radioactive fallout began falling about five hours after the detonation. The local population, not aware of the danger, was exposed to high levels of radiation, with reports of children playing in the radioactive dust. Evacuation efforts took place two days later, with residents being relocated to Majuro. Although they returned in 1957, ongoing concerns about radiation led to their evacuation once again in 1985. The fallout from Castle Bravo was detected far beyond the Pacific Ocean, with traces of radioactive material later found in Japan, India, Australia, Europe, and the United States. == References == Category:Nuclear weapons Category:Pages created with the Article Wizard from 2025",
 "title": "Castle Bravo"
}