{
 "id": "1169921",
 "text": "Phil Nana is an American professional soccer coach currently serving as Interim Head Coach of USL Super League club DC Power FC. He holds USSF and UEFA coaching licenses and has extensive experience coaching at the academy, collegiate, and professional levels. Throughout his career, he has won national, conference, and regional championships while developing top youth players in the United States. == Early Life and Education == Phil Nanahttps://www.linkedin.com/in/phil-nana-24420799/ began his coaching journey after playing soccer at the collegiate level. He pursued coaching certifications to advance his career, earning multiple United States Soccer Federation (USSF) and UEFA licenses to develop his expertise in player development and tactical coaching. == Coaching Career == D.C. United Academy (2022 –2024) Nana joined D.C. United Academy as an assistant coach for the U15 team in 2022 and quickly progressed to U17 assistant coach before being appointed head coach of the U14 team in 2023. Maryland Bobcats FC (2019 – 2021) As Head Coach of Maryland Bobcats FC, a professional team in the National Independent Soccer Association (NISA), Nana played a pivotal role in their success. His responsibilities included: * Key Achievements with Maryland Bobcats FC ** 2020/21 NISA Cup Championship Winner ** 2019/20 UPSL National Championship Winner ** UPSL Conference, Region, and Division Championship Titles Montgomery College Women’s Soccer (2015 – 2021) Nana served as the head coach for Montgomery College Women’s Soccer, leading the program to multiple NJCAA championship titles. In addition to coaching, he focused on player development, leadership training, and academic support for student-athletes. * Key Achievements with Montgomery College ** NJCAA Coach of the Year (2016, 2019) ** NJCAA Nationals Final Four (2016, 2017) ** NJCAA Conference Champions (2019, 2020) ** NJCAA Region Champions (2015, 2016, 2017) ** NJCAA Division Champions (2015, 2016, 2018) == Coaching Philosophy == Nana is known for his player-centric approach, focusing on individual technical growth, tactical awareness, and mental conditioning. His ability to develop youth talent has earned him praise from players, colleagues, and former academy directors. == Coaching Licenses & Certifications == * USSF B License (2023) * UEFA B License (2022) * USSF D License (2020) * USSF E License (2018) * USSF F License (2016) == References ==",
 "title": "Phil Nana"
}