{
 "id": "1169182",
 "text": "Herachandra () was a Meitei prince. He was the son of Maharajah Labanyachandra of Manipur kingdom. He earned secret support and admiration from the people of Manipur. E.W. Dun wrote that he defeated many small groups of the Burmese army. A.C. Bannerjee also wrote about Herachandra's victory over a Burmese force. Manipur's royal chronicle, Cheitharol Kumbaba, recorded his success under the name \"The King (Meidingu) Herachandra\" (13:216). Herachandra, with help from his cousin princes, Yumjaotaba (Pitambar Singh), defeated a large Burmese group. == Title == Herachandra was insulted by the Burmese occupation army and their puppet government, who called him a terrorist, a militant (Daku), and referred to him as a gang leader (Daku Ningthou, meaning Bandit King). Despite these negative labels, the term \"Daku-Ningthou\" became part of the Meitei language vocabulary and even appeared in the royal chronicle Cheitharol Kumbaba. Ironically, Herachandra’s title of Daku-Ningthou was eventually honored in war-torn Manipur. == Personal life == There are two stories about Herachandra becoming the king of Manipur for a short time. One story says he was king, while the other says he never wanted to be king. Herachandra had two wives, Yaikhom Chanu and Usham Chanu, and each wife had one son. However, neither of his sons had children. It is believed that Herachandra, the great hero, died in the first half of May 1821 and was cremated in an unknown place. == War tactics == On the 53rd day of the Burmese invasion, Herachandra launched an offensive against the Burmese occupation army. === In 1819 === Herachandra avoided being killed by the ruling prince by staying in the hills of Manipur. In 1819, he came down from the hills and started a guerrilla group. He gathered Manipuris who were scattered and living under the Burmese invaders. This event is recorded on the 3rd day of Sajibu, a Manipuri month, in 1819. The Cheitharol Kumbaba also mentions his secret wars, and more details are found in Pandit Chandrasing’s writing. The Burmese puppet government called him a terrorist for fighting back, but to the people of Manipur, he was a hero. Herachandra’s guerrillas didn’t have enough resources to fight the Burmese army in regular battles. Instead, they hid in tree tops and attacked small groups of Burmese soldiers. They killed them and buried their bodies. The Burmese soldiers were scared and always had to look out for attacks from the trees. Herachandra’s group, called Meitei Leima Kanba Lup, later started to fight the Burmese in semi-conventional battles in different parts of Manipur. === In 1820 === Herachandra’s first ambushes took place at Phubala, Thinungkei, and Ngangkha Lawai. On the 6th day of Kalen in 1820, the guerrillas chased the Burmese soldiers, who stopped moving. Herachandra had 50 horses, 12 guns, and 800 guerrillas. He and his cousin, Yumjaotaba, planned to trap the Burmese general Kanewoon. Yumjaotaba collected rice for the Burmese soldiers from Sekmai. The Burmese gave him 40 horses, 20 guns, and two gilded swords, thinking he had defeated Herachandra. The two princes had already killed 200 Burmese soldiers at Heiyen. The guerrillas set up positions from Uchiwa Khundon to Heiyel near Loktak Lake and killed Burmese soldiers at Chaobok. On the 4th day of Ingel, 1820, Herachandra and his guerrillas killed most of the Burmese soldiers at Kakching, near the Burma border. The guerrillas were faster and had better supplies. They destroyed the Burmese camps at Khomidok and Thoubal. The guerrillas regrouped at Moirangkhom in Imphal. Herachandra built a stockade at Singjamei on the 7th day of Ingel, 1820. He hid near Chinga Pishum hillocks to watch the Burmese. On Wednesday, he fought a group led by Amupalapa. Guerrillas, led by Moirang Labangga, scouted the route of the Burmese soldiers. Labangga’s group attacked from the front, and Herachandra’s group blocked the rear. Labangga killed the Burmese commander, Amupalapa, and captured some soldiers. On Tuesday, the 16th day of Mera, 1820, 10,000 more Burmese soldiers arrived at Kakching. Herachandra and his guerrillas fought them at Chinga hillock in Thoubal on the 20th day of Mera, 1820. The guerrillas could not defeat the much larger Burmese army. They had to retreat toward Cachar. == Legacies == The dialogue \"How has this country been ravaged?\" by Herachandra and \"Alright, we fight on\" by Yumjaotaba, as mentioned in the royal chronicle Cheitharol Kumbaba, shows the determination of the Meitei resistance against the powerful Burmese army. At that time, no leader other than Herachandra had done anything significant for Manipur when the country needed a final push to survive. Because of this, Herachandra’s name is rightfully remembered at the top of the list of freedom fighters during that crisis and in the hall of fame of patriots. Historians like R.K. Jhaljit, Gangmumei Kabui, and Sarangthem Boramani wrote about his bravery and achievements during the Burmese occupation. The Burmese army feared him and his guerrillas, calling them terrorists and militants. Herachandra and his guerrillas played a very important role in Manipur’s history. Although they were not well known at first, Pandit Moirangthem Chandrasing later wrote about them in his novel, Daku Ningthou, in 1951. The Gazetteer of Burma (1880) mentions that Herachandra’s ambushes against the Burmese happened in 1822 (vol. I, p. 327). == In popular culture == The Meitei language film Mareibak Ningba Herachandra (Herachandra the Patriot, 2023) tells the story of Herachandra. It shows his brave fight against Burma (Ava) during the Seven Years of Devastation (1819-1826) as he tried to free his kingdom. Herachandra fought hard to protect Manipur and gave his life for his country, without ever wanting to become its ruler. == References == Category:Meitei people",
 "title": "Herachandra"
}