{
 "id": "1169023",
 "text": "Soe Win (; ; born 1 March 1960) is a Burmese army general and Deputy Prime Minister of Myanmar. He was appointed on 1 August 2021 after the formation of the provisional government. He is also the Vice Chairman of the State Administration Council (SAC), Deputy Commander-in-Chief of the Myanmar Armed Forces, and Commander-in-Chief of the Myanmar Army. Soe Win is a member of Myanmar's National Defence and Security Council (NDSC). == Early life and education == Soe Win was born on 1 March 1960 in Mandalay, Burma (now Myanmar). His parents are Chit Sein and Kyin Htwe. In 1976, he joined the Defense Services Academy (DSA) as part of the 22nd intake and graduated in 1981. In 1976, he attended a cadet course at the Defense Services Academy, alongside Ye Htut, graduating with distinctions in military science and literature. He graduated as part of the 22nd intake in 1981. == Military career == After graduating from the DSA in 1981, Soe Win held various military positions. In June 2008, he became the commander of the Northern Regional Command in Kachin State. In August 2010, he was appointed Chief of the Bureau of Special Operations-6 (BSO-6), where he oversaw military operations in Chin and Rakhine States and the Magway Region. Soe Win attempted to convince the Kachin Independence Army (KIA) to transform into a Border Guard Force (BGF) under military control. Despite meetings with KIA leaders in 2009 and 2010, the KIA refused the offer. Soe Win denied the claims, saying that neither he nor anyone else in the Northern Regional Command had ordered an attack on the KIA. In September 2011, the KIA accused Soe Win of ordering attacks on their positions, which violated previous ceasefire agreements. Soe Win denied these accusations. === 2024 rumors === In April 2024, rumors spread that Soe Win was seriously injured in a drone attack on the Southeastern Command headquarters in Mawlamyine, Mon State. His absence from public events for over two weeks fueled speculation. His last public appearance was on 3 April 2024 in Ba Htoo, Shan State. However, he reappeared on state TV on 30 April 2024, visiting injured soldiers in a military hospital and meeting with officials in Kayin and Mon states. === Accusations of corruption === Soe Win has been accused of corruption and extortion during his time as commander of the Northern Regional Command from 2008 to 2010. He allegedly accepted bribes from companies involved in jade, timber, and gold in exchange for financial benefits. Reports claim he took a 150 million kyat bribe from Chinese teak businessmen to allow illegal timber trade. In March 2010, he also ordered military tax collection from jade mining companies in Hpakant, Kachin State. Despite numerous meetings between Soe Win and KIA leaders in July 2009 and August 2010, the KIA did not become a BGF. == Personal life == Soe Win is married to Than Than Nwe. == References == Category:Pages created with the Article Wizard from 2025 Category:1960 births Category:Living people Category:Prime Ministers of Myanmar Category:Burmese generals Category:Current national leaders",
 "title": "Soe Win"
}