{
 "id": "1169277",
 "text": "A Yek Salai () or a Yek () or a Salai () refers to one member group within a union of seven groups, predominantly in the traditions of the indigenous communities, originated from Kangleipak (present day Manipur). The most notable example of such a union of 7 yek salai groups is that of the Meitei confederacy (). It also exists in other ethnicities, including but not limited to Aimol, Anal, Chiru, Chothe, Inpui, Kabui, Kharam, Koireng, Kom, Lamkang, Liangmei, Mao, Maram, Maring, Moyon, Monshang, Paomai, Purum, Rongmei, Tarao, Thangal, Tangkhul and Zemei groups of people. == List of septets == === In Meitei ethnicity === Meitei sub-groups Romanisation Note(s) Ningthouja (Mangang) Luwang Khuman Angom Moirang (Moilang) Kha Nganpa Sarang Leishangthem (Salang / Salai Leishangthem) === In other ethnic groups === Ethnicities 7 sub-groups in the Yek Salai system Note(s) Anal (Anan) Murchal Masum Pasen Chantung Runlal Yasha Hrangpung Chiru Samia Ashou Achi Sonam Anam Bahai Hua Achon Chothe & Kom Yurung Thao Marim Parpa Rrangsai Makal Rakhung Inpui Riamroi Bariam Khumba Inka Bariamtak Bariampaan Balang Kabui Kammei Gangmei Golmei Lomgmei Maringmei Palmei Paomei Koireng Yaite Sonthu Leison Tumtin Tente Walbe Mikle Kharam Sheiphu Sheichel Rangla Rakhou Seilou Mareeyam Kailam Lamkang Suwngnem/ Sankhil Khular Dilbung Shilshi Tholung /Jangvei Kangten Leivon; Surte Mao Ahui Amei Sinmarei Akonglei Asus Anem Khote Lamei Anui Maram Akhanosum Soute Ahongnu Asom Luklei Lusae Hakup Maring Dalla Raj Dingthoi Chongdur Sampur Thoitak Thangnga Moyon and Monsang Ruin Wangran Chinir Numgohin Sason Hungam Songahir Khartur Nguru Langrom Sirbum Turip Bungehir Charu Poumai Alui Akhet Ahim Atao Amei Hutae Amei Hutei Aman Purum Haonam Puinae Seo Louten Hounae Haotuk Henttaogh Tangkhul Duidang Sadang Khodang Khapudang Choudang Sithudand Kingdang Tarao Akheng Lentae Atoilu Puinae Lourrei Lanchi Siru Alikleiill na Alek == Related pages == * Mangang Luwang Khuman * Apokpa * Apokpa Marup * Sanamahism == Bibliography == * * == References == Category:Meitei culture Category:Indian culture Category:History of India",
 "title": "Yek Salai"
}