{
 "id": "1169264",
 "text": "The Wright StreetCar is an articulated bus made from 2006 to 2009 by Wrightbus. The Wright StreetCar was built on the Volvo B7LA chassis. They were made to look like trams, they were used on FirstGroup's FTR services.\"StreetCar from the Wright Group\". Wrightbus. 23 September 2004.\"StreetCar creates Desire\". Wrightbus. 10 March 2005.\"First confirms orders for 39 Streetcars\". Bus & Coach Professional. 22 July 2005. == Operators == === United Kingdom === In 2006, First York ordered Streetcars for use on route 4 from Acomb to the University of York, the City of York Council had made changes to the road layout so that the Streetcars could fit.City first to use new bus fleet BBC News 22 February 2006It's the ftr of city travel The Press 24 April 2006The ftr of city travel arrives The Press 8 May 2006 In 2007, First Leeds ordered 17 Streetcars. In 2012, First York's StreetCars were withdrawn because the city council didn't want to renew the contract. In 2012, First York's StreetCars were sent to First Leeds for use on the Leeds-Bradford bus corridor. In 2015, First York's StreetCars were withdrawn. In 2008, Four spare Streetcars were sent to First Capital Connect to operate its Luton Airport Parkway railway station to Luton Airport shuttle service. In 2009, First Cymru ordered ten Streetcars for use in Swansea. In 2015, First Cymru's StreetCars were withdrawn because they were too expensive to run.Bendy buses in Swansea to be scrapped over cost BBC News 24 June 2015 === United States === In 2008 and 2009, Regional Transportation Commission of Southern Nevada ordered 50 StreetCar Rapid Transit Vehicles for use on the RTC Transit.StreetCar Breaks New Ground For The Wright Group Wrightbus 12 June 2006Wrightbus celebrates £31m deal for its new StreetCar Belfast Telegraph 8 October 2008Fifty Wrightbus New StreetCar RTV Vehicles for Southern Nevada Bus World 19 October 2008 The Streetcar was built on the Carrosserie Hess chassis. ==Gallery== File:Ftr bus in Singleton Campus square, Swansea University, 19038 (S70 FTR), 9 September 2009 cropped.jpg|A Wright StreetCar in Swansea. File:FTR Leeds bus 19017 (YJ56 EAF), 19 July 2009 (1).jpg|A Wright StreetCar in use on FirstGroup's ftr service in Leeds city centre. File:RTC Wrightbus Streetcar.JPG|Las Vegas RTC Transit Wrightbus Streetcar ==References== ==Other websites== *Wrightbus product description of Volvo B9LA model *Wrightbus product description of Hybrid model Category:Articulated buses StreetCar",
 "title": "Wright StreetCar"
}