{
 "id": "1169984",
 "text": "The PNR Metro Commuter Line was a commuter rail line operated by the Philippine National Railways. It was first inaugurated as the \"Metro Manila Commuter Service\" in 1970, and originally served the North and South Main Lines of the metropolis. It had several names in its existence, such Metrotrak and Metrotren, before its conclusive name in the late 2000s. ==History== ===Local trains=== The Manila Railroad Company (founded 1887) preceded PNR, which operated various local trains between Manila and its neighboring provinces. Trains from the Tutuban depot led to Naic, Cavite, Pagsanjan, Laguna, Montalban, Rizal, and Bulacan in the 1920s. ===Tram services=== The Manila Electric Railroad and Light Company (Meralco, founded 1903) operated electrified Tranvia services through what has now become Metro Manila. The tram system reached Malabon to the north, Pasig to the east, and Libertad (now part of Pasay) to the south — making it one of the longest in Asia in 1924. Both systems were heavily damaged during the Battle of Manila in World War II and had to be rebuilt. In 1948, Meralco began divesting its transportation businesses. ===Contemporary history=== The PNR's service declined largely from post-WW2 informal settlers along the railway easements; and natural disasters. Despite this, Manila's Metro Manila Commuter Service was started in 1970, extending from the city's Manila North Harbor and reaching the Biñan station in Laguna province. In 1976, the commuter system peaked and extended as far north as the San Fernando station in Pampanga province. In 2011, passenger services were resumed to reach Naga City after a rehabilitation program on its Main Line South. In 2015 a new project was approved by the Philippine government, called the North-South Railway Project, to revitalize the PNR. A north line analogous to PNR's existing North Main Line is the North–South Commuter Railway, a , electrified narrow gauge commuter railway. A second phase entails rebuilding the line's long-haul services to La Union province. Meanwhile, the south line includes the reconstruction of the existing Metro Commuter line from the Tutuban Depot to Calamba City including a branch line from Calamba to Batangas — as well as the rehabilitation of the South Main Line with an extension up to Matnog in Sorsogon province. ==References== Category:Rail transport in Metro Manila",
 "title": "PNR Metro Commuter Line"
}