{
 "id": "1169098",
 "text": "The Wright Pulsar Gemini is a double-decker body of a bus. It has a low-floor. It was made from 2003 to 2006 by Wrightbus. The Wright Pulsar Gemini body was built on the VDL DB250LF chassis. In 2007, the Wright Pulsar Gemini was replaced with the Wright Gemini 2. ==Pulsar Gemini HEV== From 2006 to 2007, Wrightbus made a hybrid-electric a double-decker body of a bus called the Wright Pulsar Gemini HEV (HEV means Hybrid-Electric Vehicle). The Wright Pulsar Gemini HEV body was built on the VDL DB250 chassis. Only three Pulsar Gemini HEVs were built. In 2007, the Pulsar Gemini HEV was replaced with the Wright Gemini 2 HEV. ===Production buses=== ==== Production bus 1 ==== In October 2006, The first Wright Pulsar Gemini HEV was announced by Mayor of London Ken Livingstone.Hybrid-double-decker bus unveiled BBC News 31 October 2006 In March 2007, It was shown at the Euro Bus Expo at the National Exhibition Centre in Birmingham. In March 2007, It was sent to Arriva London for trials on route 141.Arriva trials world's first double decker hybrid bus Arriva 16 March 2007Hybrid double-decker bus launched BBC News 16 March 2007Competition hots up on hybrids Bus & Coach Professional 21 November 2008 In 2008, It was sent to East Thames Buses' Mandela Way garage for six months for use on route 1. From August 2010 to February 2012, It was sent to First Somerset & Avon for use in Bath.Wrightbus double deck hybrid makes a big impression in Bath Low Carbon Vehicle Partnership 10 November 2010Civitas case study: Hybrid bus is better for Bath Clean & Better Transport in Cities ==== Production bus 2 ==== From November 2008 to 31 January 2012, The second Pulsar Gemini HEV was used by Dublin Bus of Ireland.New direction as first hybrid bus works cross-city The Herald 1 October 2008Dublin Bus puts hybrid-electric vehicle into service for test period Irish Times 16 December 2008 In 2012, It was sent to Ensignbus, On 9 June 2012, It had caught fire because of an electrical fault. ==== Production bus 3 ==== From January 2009 to 2012, The third and final Pulsar Gemini HEV was sent to London General for use on services in London. From 2017 to 2019, It was sent to Magtec Buses of Rotherham for tests and trials. == Gallery == File:Arriva bus 4764 (FJ06 ZSN), 18 August 2012.jpg|An example of Arriva Midlands' Pulsar Geminis in original livery File:Arriva Midlands 4746 FJ06 ZTO.jpg|An example of Arriva Midlands' Pulsar Geminis, this one with special vinyls advertising services 126 and 127 between Coalville, Shepshed and Leicester via Loughborough File:Arriva new corporate livery - worn by VDL DB250 Wright Pulsar Gemini 4772 (35913809393).jpg|An example of Arriva Midlands' Pulsar Geminis in Arriva's standard Journey Mark livery File:KONECTBUS - Flickr - secret coach park (2).jpg|Konectbus Wright Pulsar Gemini File:Wrights bodied VDL buses, Arriva. (7532955762).jpg|Lineup of Wright Pulsar Geminis (the two blue buses are Wright Eclipse Geminis) ==References== ==Other websites== *Wrightbus product description for Pulsar Gemini HEV Category:Double-decker buses Category:Low- floor buses Pulsar Gemini Category:Battery electric buses",
 "title": "Wright Pulsar Gemini"
}