{
 "id": "116929",
 "text": "Sivasspor is a Turkish football club founded in 1967 (57 years ago). Its stadium, the Sivas 4 Eylül Stadium is in Sivas city. Sivasspor's colours are red and white. It is called \"Yiğidolar\" in Turkey. Sivasspor became fourth in the Turkey Turkcell Super League 2007/2008 season. Sivasspor will play first match in Europe with Grbalj team to join Uefa Cup. == History == Sivasspor were originally formed on 14 May 1932 in Sivas as Sivas Gençlik. They sported Kırmızı-Beyaz (Red-White) shirts and Beyaz (White) shorts. They played many matches at the amateur level in their early years before they were allowed to play professionally. By the mid-1960s, Sivas Gençlik merged with Yolspor and Kızılırmak. They had hoped that this merger would help their push to join the professional leagues, the league closed their doors to Sivasspor once more. There were several boycotts until 1 July 1967, when Sivasspor was allowed to play professional football in Turkey. Due to there being many new clubs, the Turkish Football Federation decided to create a third league. They were permitted into the Second League along with Afyonspor, Balıkesirspor, Giresunspor, Kastamonuspor, Malatyaspor, Orduspor, Uşakspor, and Taksim GK. During their first professional season, Sivasspor finished 16th in their group, a mere four points from relegation. They also finished in the bottom half of the table the following season. They came close to promotion to the First League in 1971–72 and 1972–73 seasons but finished second behind Şekerspor and Adana Demirspor. Sivasspor would remain in the lower leagues until winning the Second League in 2005, gaining automatic promotion. The club finished 8th in their first season in the Süper Lig. Werner Lorant led the team to key victories over clubs like Beşiktaş and Gençlerbirliği. At the end of their first season in the top flight, they finished with a record of ten wins, thirteen draws, and eleven losses, totaling out to 43 points. The club then finished 4th in the 2007–08 season, finishing on the same number of points as the second and third place teams but with an inferior goal difference. Sivasspor had the championship in their sights until the penultimate match, when they were beaten 5–3 by eventual champions Galatasaray. The 2008–09 season saw them finish 2nd after leading the table for much of the season. After losing their final match of the season, they finished behind leaders Beşiktaş by 5 points. Sivasspor finished fourth in the 2019–20 Süper Lig season; hence, they qualified to the 2020–21 UEFA Europa League for the first time in their history. On 26 May 2022, Sivasspor won their first major honour, the 2021–22 Turkish Cup in a 3–2 extra-time win over Kayserispor. == Other websites == https://www.flashscoreusa.com/team/sivasspor/OvblvwLr/ https://www.transfermarkt.us/sivasspor/startseite/verein/2381 https://www.espn.com/soccer/team/_/id/3691/sivasspor https://www.foxsports.com/soccer/sivasspor-team-standings Category:Turkish football clubs",
 "title": "Sivasspor"
}