{
 "id": "1169830",
 "text": "Johann Hoffmann (* 6 January 1908; † 30 November 1974 in Vienna) was an Austrian football player He won as midfielder two championship titles with SK Rapid Wien . He played one match for the Austrian national football teamin 1929. In the 1930s he also won titles in German Bohemia and France. == Career == Hoffmann made his debut at the age of 17 in November 1925 as a center forward in Rapids team. He replaced club legend Richard Kuthan in this position. He scored nine goals in his first season. In the following two years he was also part of the main formation of the Hütteldorfer storm line,. There he played together with Ferdinand Wesely, Franz Weselik and Johann Luef. In 1927 he celebrated his first title the ÖFB Cup. From 1928 onwards, Hoffmann increasingly played in the right runner position, but had strong competition there from Josef Frühwirth and Josef Madlmayer. His number of appearances decreased. During this time he was able to win two championship titles with Rapid. After losing his place in the first team, Hoffmann moved to the second division club SC Weiße Elf Wien in 1931, but returned to Rapid in the fall. From 1932 on he played for DSV Saaz in Czechoslovakia. The Saaz team was one of the strongest teams in the German-Bohemian Association. In 1934 and 1935 the team became DSV champions and played in the 1st Czechoslovakian professional league in the 1935/36 season. They did not manage to stay in the league. Hoffmann left Saaz and moved to the French Division 1 to Racing Strasbourg, managed by Josef Blum. They reached third place in the championship in his first season. The following year the team came sixth andreached the final of the cup competition, where they were defeated by FC Sochaux 1-2. Hoffmann then switched to the final opponent and won the championship title. After his time in France, Hoffmann returned to Vienna. There he worked as a player-coach for the now third-rate Weiße Elf. ==International == He played his only match in the Austrian national football team on 17 March 1929 in a 3-3 draw versus Czechoslovakia . ÖFB Players profile ==Honours == * 2 × Austrian champions: 1929, 1930 * 1 × French champions: 1938 * 2 × German-Bohemian champions: 1934, 1935 * 1 × ÖFB Cup: 1927 * 1 × German-Bohemian Cup: 1934 * 1 match for the Austrian national football team: 1929 ==References == Category:1908 births Category:1974 deaths Category:Austrian footballers Category:Players of the Austrian national football team Category:Association football forwards Category:SK Rapid Wien players Category:Austrian football forwards Category:Austrian football champions",
 "title": "Johann Hoffmann"
}