{
 "id": "117074",
 "text": "This is a list with all the Sony Ericsson WTA Tour Awards given by the WTA Tour to players who have done or achieved something remarkable during the season or their career. ==Player of The Year== This is awarded to the player who the WTA think has played the best tennis over the year. Year Player Nationality 2007 Justine Henin 2006 Amélie Mauresmo 2005 Kim Clijsters 2004 Maria Sharapova 2003 Justine Henin 2002 Serena Williams 2001 Jennifer Capriati 2000 Venus Williams 1999 Lindsay Davenport 1998 Lindsay Davenport 1997 Martina Hingis 1996 Steffi Graf 1995 Steffi Graf 1994 Steffi Graf 1993 Steffi Graf 1992 Monica Seles FR Yugoslavia Monica Seles, originally from Yugoslavia, became a U. S. citizen in 1994. 1991 Monica Seles SFR Yugoslavia 1990 Steffi Graf 1989 Steffi Graf 1988 Steffi Graf 1987 Steffi Graf 1986 Martina Navrátilová 1985 Martina Navrátilová 1984 Martina Navrátilová 1983 Martina Navrátilová 1982 Martina Navrátilová Martina Navrátilová, originally from Czechoslovakia, became a U. S. citizen in 1981. 1981 Chris Evert-Lloyd 1980 Tracy Austin 1979 Martina Navrátilová 1978 Martina Navrátilová 1977 Virginia Wade == Doubles Team of the Year == This is awarded to the doubles team who the WTA think has played the best tennis over the year. Year Players 2007 Cara Black & Liezel Huber 2006 Lisa Raymond & Samantha Stosur 2005 Lisa Raymond & Samantha Stosur 2004 Virginia Ruano Pascual & Paola Suárez 2003 Virginia Ruano Pascual & Paola Suárez 2002 Virginia Ruano Pascual & Paola Suárez 2001 Lisa Raymond & Rennae Stubbs 2000 Serena Williams & Venus Williams 1999 Martina Hingis & Anna Kournikova 1998 Martina Hingis & Jana Novotná 1997 Gigi Fernández & Natasha Zvereva 1996 Jana Novotná & Arantxa Sánchez Vicario 1995 Gigi Fernández & Natasha Zvereva 1994 Gigi Fernández & Natasha Zvereva 1993 Gigi Fernández & Natasha Zvereva 1992 Larisa Neiland & Natasha Zvereva 1991 Gigi Fernández & Jana Novotná 1990 Jana Novotná & Helena Suková 1989 Jana Novotná & Helena Suková 1988 Martina Navrátilová & Pam Shriver 1987 Martina Navrátilová & Pam Shriver 1986 Martina Navrátilová & Pam Shriver 1985 Martina Navrátilová & Pam Shriver 1984 Martina Navrátilová & Pam Shriver 1983 Martina Navrátilová & Pam Shriver 1981 Martina Navrátilová & Pam Shriver 1980 Kathy Jordan & Anne Smith 1979 Billie Jean King & Martina Navrátilová 1978 Billie Jean King & Martina Navrátilová 1977 Martina Navrátilová & Betty Stöve == Most Improved Player == This is awarded to the player who the WTA think has improved the most over the year. Year Player Nationality 2007 Ana Ivanović 2006 Jelena Janković 2005 Ana Ivanović 2004 Maria Sharapova 2003 Nadia Petrova 2002 Daniela Hantuchová 2001 Justine Henin 2000 Elena Dementieva 1999 Serena Williams 1998 Patty Schnyder 1997 Amanda Coetzer 1996 Martina Hingis 1995 Chanda Rubin 1994 Mary Pierce 1993 Magdalena Maleeva 1992 Kimiko Date 1991 Gabriela Sabatini 1990 Monica Seles 1989 Arantxa Sánchez Vicario 1988 Arantxa Sánchez 1987 Lori McNeil 1986 Steffi Graf 1985 Helena Suková 1984 Kathy Jordan 1983 Andrea Temesvári 1982 Sabina Simmonds 1981 Barbara Potter 1980 Hana Mandlíková Hana Mandlíková became an Australian citizen in 1988 1979 Sylvia Hanika 1978 Virginia Ruzici 1977 Wendy Turnbull == Newcomer of the Year == This is awarded to the player who the WTA think has played the best tennis in their first season as a professional. Year Player Nationality 2007 Ágnes Szávay 2006 Agnieszka Radwańska 2005 Sania Mirza 2004 Tatiana Golovin 2003 Maria Sharapova 2002 Svetlana Kuznetsova 2001 Daniela Hantuchová 2000 Dája Bedáňová 1999 Kim Clijsters 1998 Serena Williams 1997 Venus Williams 1996 Anna Kournikova 1995 Martina Hingis 1994 Irina Spîrlea 1993 Iva Majoli 1992 Debbie Graham 1991 Andrea Strnadová 1990 Jennifer Capriati == Comeback Player of the Year == This is awarded to the player who the WTA think has played the best tennis after coming back from a long break from playing. Year Player Nationality 2007 Lindsay Davenport 2006 Martina Hingis 2005 Kim Clijsters 2004 Serena Williams 2003 Amélie Mauresmo 2002 Corina Morariu 2001 Barbara Schwartz 2000 Iva Majoli 1999 Sabine Appelmans 1998 Monica Seles 1997 Mary Pierce 1996 Jennifer Capriati 1995 Monica Seles 1994 Meredith McGrath 1993 Elizabeth Smylie 1992 Jenny Byrne 1991 Stephanie Rehe 1990 Elizabeth Smylie 1989 Kathy Rinaldi 1988 Pascale Paradis 1987 Bettina Bunge == Player Service == Year Player Nationality 2007 Liezel Huber 2004 Nicole Pratt 2003 Kim Clijsters 2002 Not awarded 2001 Nicole Pratt 2000 Nicole Pratt 1999 Nicole Pratt 1998 Joannette Kruger 1997 Katrina Adams 1996 Katrina Adams 1995 Marianne Werdel 1994 Marianne Werdel 1993 Pam Shriver 1992 Elise Burgin 1991 Kathy Jordan 1990 Wendy Turnbull 1989 Mercedes Paz Note: in 2002 the award was not given. == Karen Krantzcke Sportsmanship Award == Year Player Nationality 2007 Ana Ivanovic 2006 Kim Clijsters 2005 Kim Clijsters 2004 Lindsay Davenport 2003 Kim Clijsters 2002 Kim Clijsters 2001 Kim Clijsters 2000 Kim Clijsters 1999 Ai Sugiyama 1998 Yayuk Basuki 1997 Amanda Coetzer 1996 Yayuk Basuki 1995 Amanda Coetzer 1994 Kimberly Po 1993 Nicole Arendt 1992 Jill Hetherington 1991 Judith Wiesner 1990 Mercedes Paz 1989 Gretchen Magers 1988 Svetlana Parkhomenko 1987 Anne Minter 1986 Peanut Louie-Harper 1985 Peanut Louie-Harper 1984 Marcella Mesker 1983 Sharon Walsh-Pete 1982 Nancy Yeargin 1981 Diane Esfor 1980 Evonne Goolagong 1979 Chris Evert 1978 Evonne Goolagong == Tournaments of the Year == === Tier I - II === Year Tournament 2006 Indian Wells 2005 Indian Wells 2004 Miami 2003 Moscow 2002 Dubai 2001 Dubai 2000 Montréal 1999 Toronto 1998 Montréal 1997 Indian Wells 1996 San Diego 1995 Miami == Notes == == Other websites == *WTA Awards - past winners Category:Tennis",
 "title": "WTA Awards"
}