{
 "id": "1170991",
 "text": "András Fekete-Győr (born April 13, 1989, in Budapest) is a Hungarian lawyer, politician, and the founder of the Momentum Movement. He was the president of the Momentum Movement from 2016 to 2021. He became the first post-regime change member of parliament to be legally convicted of a crime committed during a demonstration, which made him unfit to serve as a member of parliament. == His family == His maternal great-grandfather was Ödön Kuncz, an internationally renowned law professor and the creator of commercial law. His maternal grandfather, József Kuncz, was a lawyer who led one of the revolutionary groups at the Hungarian National Bank in 1956. After the suppression of the 1956 uprising, he was removed from his job and the bar association, but he was rehabilitated in the 1960s. The Kuncz family originates from Transylvania. His paternal grandfather, Endre Fekete-Győr, was an agricultural engineer who worked at the Ministry of Agriculture as a rapporteur and later department head between 1948 and 1957, and served as the council president of Heves County from 1969 to 1981. His father, also named András Fekete-Győr, was the deputy managing director of the National Deposit Insurance Fund from 1993, and its managing director from 2010 to 2018. His mother, Magdolna Kuncz, is a foreign trade expert. == Political career == He believed there was no solidarity on the right and no positive vision of the nation on the left, so he set out to create a new generational political community, which would later become a new political party in Hungary. In 2015–2016, he gained experience at the European Parliament’s Committee on Legal Affairs in Brussels. Later, he won a Bundestag scholarship in Berlin, where he interned in the office of Hans-Peter Friedrich. In 2018, András Fekete-Győr was featured on the American Forbes magazine’s \"30 Under 30\" list, recognizing young politicians under 30 who have the greatest impact on European politics and public life.A Momentum elnöke Európa 30 legbefolyásosabb fiatalja között In March of that year, Euronews included him among the nominees for its \"European of the Year\" award (though he did not win). In the fall of 2018, he received a scholarship from the International Visitors Leadership Program, supported by the U.S. Department of State. == Criminal case == In December 2018, during a protest, András Fekete-Győr threw a smoke flare toward police officers, an action he later said he did not regret. On April 2, 2019, the Budapest Regional Investigative Prosecutor’s Office announced that he was questioned as a suspect for the crime of violence against an official in connection with the incident. On October 17, 2024, the Budapest-Capital Regional Court of Appeal, in a final third-instance ruling, sentenced him to a one-year prison term, suspended for two years. This made Fekete-Győr the first post-regime change member of parliament to be convicted of a crime during his term, rendering him unfit to continue as a parliamentarian. Although he stated he would not wait for the parliament’s formal incompatibility procedure and would resign voluntarily, it was ultimately the parliament that declared his incompatibility. As a result, his mandate ended. In May 2017, Origo, one of Hungary’s most well-known government-aligned disinformation news portals, published articles analyzing the Momentum Movement’s members and actions. Considering the articles defamatory and full of lies, András Fekete-Győr and a few companions entered Origo’s office without permission,Momentum Mozgalom Facebook profil: Propagandistáknál jártunk, hátha van még lelkiismeretük. 2017 május 18. recorded footage, and later made it public. ==References== Category:Hungarian politicians Category:Living people Category:1989 births Category:Momentum Movement",
 "title": "András Fekete-Győr"
}