{
 "id": "1170833",
 "text": "\"Only When I Lose Myself\" is a 1998 song by British band Depeche Mode and was taken from their greatest hits album The Singles 86>98. It topped the single charts in Denmark, Hungary and Spain. It also made number 34 in Australia, number 61 in the United States, number 17 in the United Kingdom, number 5 in Canada and number 3 in Italy. ==Track listing== All songs were written by Martin L. Gore UK and Australian CD1 # \"Only When I Lose Myself\" # \"Surrender\" # \"Headstar\" UK and Australian CD2; UK 12-inch single # \"Only When I Lose Myself\" (Subsonic Legacy remix) # \"Only When I Lose Myself\" (Dan the Automator remix) # \"Headstar\" (Luke Slater remix) UK and Australian CD3 # \"Only When I Lose Myself (Gus Gus Long Play mix) # \"Painkiller\" (Kill the Pain mix – DJ Shadow vs Depeche Mode) # \"Surrender\" (Catalan FC Out of Reach mix) # \"Only When I Lose Myself\" (Gus Gus Short Play mix) # \"World in My Eyes\" (Safar mix) UK limited-edition 12-inch single :A1. \"Only When I Lose Myself (Gus Gus Long Play mix) :B1. \"Painkiller\" (Kill the Pain mix – DJ Shadow vs Depeche Mode) :B2. \"Surrender\" (Catalan FC Out of Reach mix) UK cassette single :A1. \"Only When I Lose Myself\" :A2. \"Surrender\" :A3. \"Headstar\" :B1. \"Only When I Lose Myself\" (Subsonic Legacy remix) :B2. \"Only When I Lose Myself\" (Automator remix) :B3. \"Headstar\" (Luke Slater remix) US and Canadian maxi-CD single (grey cover) # \"Only When I Lose Myself\" (Dan the Automator remix) – 4:56 # \"Headstar\" – 4:25 # \"Surrender\" – 6:17 # \"Only When I Lose Myself\" (Subsonic Legacy remix) – 7:03 # \"Headstar\" (Luke Slater remix) – 5:47 US and Canadian maxi-CD single (green cover) # \"Only When I Lose Myself\" (Gus Gus Longplay mix) – 11:18 # \"Painkiller\" (Kill the Pain mix – DJ Shadow vs Depeche Mode) – 6:31 # \"Surrender\" (Catalan FC Out of Reach mix) – 6:54 # \"Only When I Lose Myself\" (Gus Gus Short Play mix) – 4:58 # \"World in My Eyes\" (Safar mix) – 8:30 US 2×12-inch single :A1. \"Only When I Lose Myself\" (Dan the Automator remix) – 4:56 :A2. \"Painkiller\" (Kill the Pain mix – DJ Shadow vs Depeche Mode) – 6:31 :B1. \"Headstar\" (Luke Slater remix) – 5:47 :B2. \"Surrender\" (Catalan FC Out of Reach mix) – 6:54 :C1. \"Only When I Lose Myself\" (Gus Gus Longplay mix) – 11:18 :C2. \"Headstar\" – 4:23 :D1. \"Only When I Lose Myself\" (Subsonic Legacy remix) – 7:00 :D2. \"Surrender\" – 6:18 ==References== Category:1998 songs Category:Depeche Mode songs Category:Alternative rock songs",
 "title": "Only When I Lose Myself"
}