{
 "id": "117005",
 "text": "Marie-Sophie Germain (April 1, 1776 – June 27, 1831) was a French mathematician, physicist, and philosopher who made important contributions to differential geometry and number theory. She was born in 1776 in an era of revolution. In many ways Sophie embodied the spirit of revolution into which she was born. She was a middle-class female who went against the wishes of her family and the social prejudices of the time to become a highly recognized mathematician. It took a long time for her to be recognized and appreciated for her contributions to the field of mathematics, but she did not give up. Even today, it is felt that she was never given as much credit as she was due for the contributions she made in number theory and mathematical physics because she was a woman. == Early life == Sophie Germain was born in Paris. Her family was quite wealthy. Her father was a merchant and later became director of the Bank of France. Sophie's interest in mathematics began during the French Revolution when she was 13 years old and confined to her home due to the danger caused by revolts in Paris. She initially received opposition from her parents and also the difficulties presented by the society for females to study. However, she had the opportunity to learn from books in her father’s library, so she spent a great deal of time in there. She read important scientists and one day she ran across a book in which the legend of Archimedes' death was recounted. This legend is that during the invasion of his city by the Romans Archimedes was so engrossed in the study of a geometric figure in the sand that he failed to respond to the questioning of a Roman soldier. As a result, he was speared to death. This sparked Sophie's interest. If someone could be so engrossed in a problem as to ignore a soldier and then die for it, the subject must be interesting. Sophie began teaching herself mathematics and other topics using the books in her father's library. But her parents felt that her interest was inappropriate for a female (the common belief of the middle-class in the 19th century), and they did all they could to discourage her. She began studying at night to escape them, but they went to such measures as taking away her clothes once she was in bed and depriving her of heat and light to make her stay in her bed at night instead of studying. However, their efforts failed. She would wrap herself in quilts and use candles she had hidden in order to study at night. Finally they realized that Sophie's passion for mathematics was \"incurable,\" and they let her learn. Thus, Sophie spent the years of the Reign of Terror studying differential calculus without the aid of a tutor. She was self-taught. == Work, and correspondences == In 1794, when Sophie was 18, the Ecole Polytechnique was founded in Paris. It was an academy to train mathematicians and scientists for the country, but women were not allowed to join. Sophie was able to get the lecture notes for several of the courses and study from them. This gave her the opportunity to learn from many of the prominent mathematicians of those days. Sophie was particularly interested in the teachings of Joseph Louis Lagrange. Under the pseudonym of M. LeBlanc (a former student of Lagrange's), she submitted a paper on analysis to Lagrange at the end of the term. He was quite impressed with the work and wanted to meet the student who had written it. He was amazed that the author of the work was actually a female; he recognized her abilities and became her mentor. With a male to introduce her, Sophie could enter the circle of scientists and mathematicians that she never before could. Up until this point not only had her gender been a hindrance to her, but her social status had been too, because she was not an aristocratic woman but one of the middle class. Lagrange certainly made his colleagues aware that Germain was a girl with mathematical talent and several of them wrote to her; for instance, Monge. But not everyone treated her with the respect she deserved. One case was Jérôme Lalande. She started to talk to him about Laplace's Exposition du système du monde. Lalande told her that she should not be reading such works, rather she should be reading the second edition of his book Astronomie des dames. This \"astronomy for ladies\" does not contain a single mathematical equation and Germain felt insulted by his suggestion. Lalande sent her a letter of apology but she never forgave him. However, Germain’s most famous correspondence began in 1804 with the German mathematician Carl Friedrich Gauss. She was intrigued with his work in number theory and sent him some of the results of her work. Again, she used her pseudonym to disguise her true identity; she feared being ignored because of being a woman. It was not until 1807 that Gauss found out who M. LeBlanc truly was. He was thrilled to find that his \"pen pal\" was a very gifted woman. He was not bothered but pleased. At about this time, in 1808, the French Academy of Sciences announced a contest to explain the \"underlying mathematical law\" of a German physicist's study on the vibration of elastic surfaces. Sophie was fascinated and set out to explain the law underlying Chladni's study. The Academy set a two-year deadline, and in 1811 Sophie submitted the only entry in the contest. Her lack of formal education was evident in the anonymous paper she submitted, and thus she was not awarded the prize. Lagrange corrected her errors and two years later she again entered the contest which had been extended. She received honorable mention this time. It was in 1816, when she entered for the third time and won with her paper Memoir on the Vibrations of Elastic Plates. After winning the contest, Sophie continued her work on the theory of elasticity publishing several more memoirs. Her work in the theory of elasticity would prove to be very important to the field. Among her work done during these years is what would be her most important work in number theory. In 1820, Sophie made a statement about the divisibility of solutions to Fermat’s equation, for an odd prime p. She proved that if x, y, and z are integers and if x5 \\+ y5 = z5 then either x, y, or z must be divisible by 5. The prize from the Academy, however, was of immediate importance because it introduced her into the ranks of the prominent mathematicians of the time. She became the first woman who was not a wife of a member to attend the Academy of Sciences' sessions. She was also praised by the Institut de France and was invited to attend their sessions. Sophie continued working with well-known male mathematicians in the 1820s as an \"equal collaborator\" to refine her proofs and work in number theory; and also continued to work in philosophy until her death, in 1831. == Later life == After a battle with breast cancer, Sophie Germain died at the age of 55 on June 27, 1831 in Paris. Shortly before this Gauss, one of her earliest mentors, had convinced the University of Gottingen to give Sophie an honorary degree. She died before she could receive it. ==Related pages== * Timeline of women in mathematics == References == https://www.agnesscott.edu/lriddle/women/germain.htm#:~:text=Sophie%20Germain%20was%20a%20revolutionary,also%20very%20important%20to%20mathematics. https://www.britannica.com/biography/Sophie-Germain https://mathshistory.st- andrews.ac.uk/Biographies/Germain/ https://totallyhistory.com/sophie-germain/ ==Other websites== * * Category:1776 births Category:1831 deaths Category:French number theorists Category:Differential geometers Category:French geometers",
 "title": "Sophie Germain"
}