{
 "id": "1170825",
 "text": "Mali had in 2024 and 2025 multiple gold mining disasters with dozens of victims each time. ==Background== Mali is number three gold producers of Africa. Gold is for Mali the most important export, good for 80% of the export in 2021. However, there are many artisan miners searching for gold. The local authorities struggle to regulate illegal mining activities. The artisanal miners are working ofter under hazardous conditions, leading regulary to deadly landslides, tunnel collapses or other disasters. ==January 2024 accident== In January over 70 people were killed of the around 100 people that were in a mine in the Kangaba district. ===Responses=== The president of the Mali Chamber of Mines Abdoulaye Pona visited the disaster scene. senior official at the government's National Geology and Mining Directorate Karim Berthé, stated that \"The state must bring order to this artisanal mining sector to avoid these kinds of accidents in the future\". Also the Ministry of Mines responded stating to be \"deeply regretted\" by the collapse and urged miners to \"comply with safety requirements\". ==January 2025 accident== In January a gold mine collapsed inthe Koulikoro region. A dike that was surrounding the mine gave way and water and mud entered the mine. Many people, mainly women, were engulfed killing 70 of them. ==15 February 2025== On 15 February 2025 gold mine collapsed in the village of Bilalkoto in the commune of Dabia, in the Kenieba district of the Kayes region. Mohamed Dicko, who represented the prefect of Kéniéba, stated there were 42 people killed. The death toll rose from 42 to 48 to 49Mali Retrieves 49 Bodies After Artisanal Gold Mine Collapsed to 50. Many others were injured. The 50 people who died consisted of 49 women and one man. Some victims fell into nearby water. The victems were at the location searching for gold. The gold mine was operated illegally. It is reported the disaster took place at an abandoned gold mining site were artisan miners were searching for gold. Mohamed Dicko stated the collapse was due to a landslide at the mine that was run by Chinese nationals. However, announymous witnesses stated it was caused by a Caterpillar machine falling onto the mine. ===Reactions=== The Prime Minister of Mali Abdoulaye Maiga responded the in the evening on 16 February to the accident. He statet that the government would take \"relentless'\" measures in response to the mining disaster. ==References== Category:Gold Category:Mining disasters Category:Mali Category:2024 in Africa Category:2025 in Africa Category:2024 disasters Category:2025 disasters",
 "title": "2020s Mali gold mine accidents"
}