{
 "id": "1170662",
 "text": "The Free Republic of Nias (Indonesian: Republik Nias Merdeka, German: ) was a short-lived and unrecognised state proclaimed by German prisoners on Nias Island, Indonesia, with Ernst Leo Fischer as Prime Minister and leader. The state lasted less than a month until the island was fully occupied by Japanese forces on 22 April 1942. == Background == === Sinking of the SS Van Imhoff === On 10 May 1940, Nazi Germany invaded the Netherlands. The Dutch government in the Dutch East Indies retaliated by arresting German nationals. Before the war, German nationals fled their homeland from 1930 to find protection in the Dutch East Indies. During the Second World War, they were regarded and treated as ordinary German citizens and also held in internment camps. The Dutch government on Nias, led by J.L. Plas as supervisor (Dutch liaison for indigenous peoples) of the region, began to arrest German missionaries and doctors whose predecessors had been active since the 1880s in North Sumatra. Meanwhile, north of Nias, in the town of Kutacane, Aceh, around 2,400 German men and women were imprisoned by Dutch troops. These included Basel and RMG missionaries, doctors, hospital nurses, engineers, artists and German Jews living in the Dutch East Indies. Most of them were detained in the Fort de Kock and Alas Valley camps, both on the island of Sumatra. In February 1942, Japanese troops landed at Air Bangis, Sumatra. Knowing of the impending Japanese invasion of the Dutch East Indies, the Dutch government planned to send 2300 German citizens to British Raj. The prisoners were moved to Sibolga on the north coast of Sumatra and then transported to India in groups via three KPM ships assigned for this mission, namely SS Plancius, SS Ophir, and SS Van Imhoff. SS Van Imhoff was a ship of the Dutch shipping company Koninklijke Paketvaart-Maatschappij (KPM). The ship was built twice. The first ship was sunk in 1911. The second ship of the same name was built in 1914 at Fijnenord. The SS Van Imhoff was named after the German-born Governor-General of the Indies, Gustaaf Willem van Imhoff. On 15 January 1942, the Captain of the SS Van Imhoff, M.J Hoeksema received orders from Padang to depart from Sibolga for India. On 18 January 1942, the van Imhoff departed carrying 478 German internees and 110 Dutch, 62 of whom were KNIL soldiers. The first two groups arrived in India. But on 19 January 1942, the third group, SS Van Imhoff, was attacked by Japanese bombers about 177 km off the west coast of Sumatra and badly damaged. The first two bombs exploded near the ship, but the third bomb hit the van Imhoff ship right. Captain Hoeksema panicked and ordered all the lifeboats to be released into the sea. However, one lifeboat could not be lowered and was left unattended. One of the guards asked Captain Hoeksema to put the prisoners on the lifeboat, but Captain Hoeksema refused because there was no order to release the prisoners. He also considered all prisoners to be enemies. Thus the prisoners were abandoned by the captain and crew who left in a lifeboat. Of the 478 German internees and 110 Dutch, 48 were crew and 62 of whom were KNIL soldiers, 201 survived the drowning, while 276 inmates drowned immediately. 134 survivors, who were on the raft, later drowned. Only 67 reached Nias. Among the victims were a remarkable number of German Jews and anti-National Socialists whose citizenship in Germany had been withdrawn. Among the dead were veterinarian Professor Fritz Ludwig Huber, officer of the Order of Oranje Nassau, researcher Hans Overbeck, and artist Walter Spies from Germany, and Austrian sinologist Erwin Ritter von Zach. (Archive), University of Massachusetts, 2007. Accessed 28 November 2011. After a few months, this incident reached Germany. This led the German authorities to arrest KPM employees in the Netherlands and send them to forced labour. KPM was also forced to pay 4 million guilders as compensation to the families of those who drowned on the van Imhoff. Some people managed to escape on two remaining small boats without rudders and emergency rations and some rafts and were sighted by a Dutch Navy flying boat the next day . This called the Dutch steamer Boelongan for help, which arrived at the first lifeboat at around 9.20 a.m. Albert Vehring, one of the surviving prisoners, recounted that on 20 January 1942, the ship approached their raft. From a distance of 100 metres, the captain of the Boelongan, M. L. Berveling, asked through the megaphone if there were any Dutch in the boat. the castaways responded with \"No, we are Germans.\" When his suspicions were confirmed and learned that the shipwrecked were all German civilian internees, he turned around and now headed for the bamboo rafts and the workboat, which were more than a kilometer away, without complying with the request for drinking water and food or admission on board. Berveling explained that did so as he had received the following instructions: Berveling had interpreted the orders to mean that he was not to take any German internees aboard. His stance apparently greatly angered the rest of his crew. A few minutes later, another lifeboat, two rafts and castaways were sighted in the water from the Catalina, which was supposed to protect the ship from underwater attacks. The Boelongan, which was being piloted there, was there at around 10.40 a.m., but again did not take any of the castaways on board. Shortly after the Boelongan passed the castaways' vehicles, an aircraft attack on the steamer was observed from the Y-63. The testimony of Berveling, who claimed to have been attacked several times by the Japanese plane, was not consistent with testimonies from survivors in the lifeboat and observations by the Y-63 crew, who claimed that the plane veered away after dropping a single bomb. The occupants of the boats separated from the shipwrecked on the slow rafts on January 21, 1942, in the hope of being able to send help later. == Arriving in Nias == The 67 survivors who reached Nias were divided into two groups. The first, consisting of 53 prisoners, moved parallel to the coastline. On 21 January 1942, at 09.00, they saw a small beach with a reef in front of it. Hungry and thirsty, they finally washed up on the coast of South Nias, near Muara Eho. They descended and searched for signs of life, finding a small river but no food. That afternoon, a Dominican Catholic priest named Van Stralen appeared with two bottles of wine, promised to return the next day with a doctor and food, and guided him to some locals. The indigenous people declared that they were Christians and told him that they were on Nias. On 23 January 1942, the condition of the surviving prisoners was getting worse. On 24 January, After a long walk, the second group of 14 prisoners reached Hilisimaetano, the colonial administrative centre in South Nias. One of them, Albert Vehring, saw an isolated house. Some prisoners went to the house and the owner of the house felt threatened, cutting some coconuts for the group. The incident caught the attention of nearby villagers. One of the villagers was able to communicate with the prisoners who told him about the Van Imhoff incident. After the villagers left and the survivors went to sleep, one of them, Dr Heidt, was invited by the village chief to a meeting. The next day, after temporary hospitalisation, they were taken by local authorities to Gunungsitoli, the administrative centre of Nias. As the second group marched towards Gunungsitoli, They found an oplet (local taxi), to take them to a nearby village. There, during a feast served by the locals, they were spotted by the Dutch authorities. Reluctant to treat them as prisoners, the Dutch authorities released them and let them go to Gunungsitoli on their own. The groups would then meet at a crossroads. A truk from Gunungsitoli was waiting for the prisoners and transported them to the prison guarded by 38 veldpolities (customary guards) and some Dutch soldiers. == Coup d'etat == After a few days in prison, word came that Sibolga, a city located on the mainland of Sumatra, had been occupied by the Japanese. The German prisoners convinced the bataknese native police, known as Veldpolities, to defect from the Netherlands on the grounds that Germany and Japan were winning the war. On 28 March 1942, the veldpolities revolted against their Dutch superiors. The veldpolities fired on Dutch houses and freed German prisoners. Albert Vehring states that the veldpolities emerged after the firefight had subsided. The veldpolities distributed firearms to the freed Germans from the prison armoury. The Dutch were unarmed as almost all the weapons were in the armoury: only a doctor and a Nias deputy had firearms at home. Although the German veldpolities and prisoners far outnumbered the Dutch, only one Dutchman was wounded. Shortly after the shootout, the Dutch deputy resident, superintendent and chief of police on Nias, along with five British soldiers, several Dutch priests and other Dutch residents were arrested and imprisoned. At first, the Dutch and other prisoners thought that they would be shot, but later, learnt that the rebellious veldpolities had simply separated them into male and female prisons. Until, the Dutch arsenal was finally dismantled by the German internees and the Germans managed to take over Nias Island and detained several Dutch citizens including the assistant resident, controller, head of the Dutch police, 5 British escaped soldiers, a clergy, and other Dutch citizens. == Establishment == The next day, 29 March 1942, in collaboration with Nias leaders, the former German prisoners proclaimed the \"Free Republic of Nias\" in the name of Adolf Hitler. One of them, former head of the Bosch company in the Dutch East Indies, Ernst Leo Fischer, became the first prime minister. He appointed Albert Vehring, a former manager of Emil Helfferich's tea plantation in Java, as foreign minister. The declaration of the republic was greeted with joy by the local population, as they were the first people in the Dutch East Indies to overthrow the colonial rule of the Dutch government. Although the people of Nias had high hopes for the new republic, the Germans themselves did not take the republic seriously, as some considered it as a joke. Knowing that the veldpolities would revolt if not paid, the Germans looted ƒ857,000 from the vice-resident's house and the pawnshop, consisting of three months' salary for all government employees in Nias and the residents' savings. Some of this was given to the veldpolities to ensure their loyalty, while some was kept by the Germans. Nine patrol groups were formed to guard Nias, each consisting of a German and a veldpolitie armed with carbines. The Germans also took as many weapons as possible and occupied radio stations to contact the Japanese who had captured Sumatra. The attempt failed, as the Japanese and Germans could not understand each other. == Important Events == === Dutch ship captures === On 31 March 1942, two Dutch ships, SS Sumatra and SS Salida, arrived in Gunungsitoli harbour. The Germans acted cautiously and approached with rifles. The captains, Bloemers and Flothuis, did not realise that the island was uninhabited by the Japanese and were surprised when they were held at gunpoint by German troops. Both were imprisoned by the Germans. The Germans learnt from the internees that a Dutch ship was chartered by the Japanese in Sumatra for ƒ7,000 to deliver rice from Nias. The Germans realised that the Japanese did not know they were on the island. One of the prisoners, Grasshof, used the radio to play a German military song and thus identified their presence to the Japanese troops. === Transportation of prisoners === To show their loyalty, the Germans decided to transport the Dutch and British citizens of Nias to mainland Sumatra 200km away, and hand them over to the Japanese. Along with Albert Vehring, they commandeered a ship to tow several open boats with the prisoners. On 6 April, they left Gunungsitoli for Sibolga, arriving later that day. When a small Japanese motorboat arrived, German soldiers stood to attention and greeted them with the Hitler salute, but the Japanese did not respond, as a way of demonstrating their authority. They were all investigated further in Medan. Albert Vehring suggested sending a Japanese officer and some Japanese troops to Nias but this was rejected due to suspicion on the part of the Japanese. Vehring was sent back to Nias, while the other prisoners were held by the Japanese in Sumatra. After a brief exchange of contact, the prisoners were taken away by the Japanese. On 12 April, a second wave of prisoners, accompanied by 22 Germans, travelled to Sibolga. == Dissolution == On 17 April 1942, the Japanese arrived on Nias with six ships and 120 to 200 soldiers to occupy Nias. Members of the government of the Free Republic of Nias – Leo Fischer, Albert Vehring, Dr. J.K.G Moeller, Edmund E.J.F Schroeder, Dr. Karl Heidt – and other Germans welcomed them at the harbour. The Japanese were greeted with the Nazi salute, and school children sang the Indonesian national anthem, \"Indonesia Raya\". Although the island had been officially occupied by Japan, the Germans still managed to organise a small event to celebrate Hitler's birthday. The Germans brought a portrait of Hitler, and the event ended with a triple banzai and Nazi salute. On 22 April 1942, the Japanese occupied the southern part of the island by sea. === Japanese Occupation === After the Japanese occupied the island, the remaining Europeans on the island, regardless of nationality, were transferred to Sumatra on 24 April 1942. Only one German, Dr. Karl Heidt, remained as a doctor. The Japanese force doctor Heidt to stay behind as one of the few reliable medics around. However, his deepest wish is to start a medical practice again in Sumatra. Being alone on the island, he died on 2 September 1942 after committing suicide via an overdose of sleeping pills. His headstone on Nias near Gunungsitoli reads \"Einsam aber unter Freunde gestorben\" (Lonely but deceased among friends). == Notes == == Bibliography == * * * * * * * * == References == Category:History of Indonesia Category:20th-century establishments in Indonesia Category:20th-century disestablishments in Asia Category:Former countries in Asia",
 "title": "Free Republic of Nias"
}