{
 "id": "1170812",
 "text": "Take My Breath Away is a song written by Giorgio Moroder and Tom Whitlock for the 1986 film Top Gun, performed by American new wave band Berlin. ==Release== Take My Breath Away was the second single from the soundtrack album of Top Gun, following Kenny Loggins' Danger Zone, released in 1986 as a split single along with the song Radar Radio, which was performed by Moroder featuring Joe Pizzulo. ==Performance== The song peaked at number one on the Billboard Hot 100, and also topped the charts in the United Kingdom (UK), Belgium, Ireland and the Netherlands. It later went on to win Best Original Song at the 59th Academy Awards. ==Tracklists== *7-inch single :A. Take My Breath Away – 4:13 :B. Radar Radio (performed by Giorgio Moroder featuring Joe Pizzulo) – 3:40 *UK 12-inch single :A. Take My Breath Away – 4:13 :B1. You've Lost That Lovin' Feelin' (performed by The Righteous Brothers) :B2. Radar Radio (performed by Giorgio Moroder featuring Joe Pizzulo) – 3:40 *UK 7-inch single (1990) :A. Take My Breath Away – 4:11 :AA. Danger Zone (performed by Kenny Loggins) – 3:35 *UK CD single (1990) # Take My Breath Away – 4:11 # Danger Zone (performed by Kenny Loggins) – 3:35 # Hot Summer Nights (performed by Miami Sound Machine) – 3:34 # Top Gun Anthem (performed by Harold Faltermeyer and Steve Stevens) – 4:02 *UK cassette single (1990) :A1. Take My Breath Away – 4:11 :A2. Danger Zone (performed by Kenny Loggins) – 3:35 :B1. Take My Breath Away – 4:11 :B2. Danger Zone (performed by Kenny Loggins) – 3:35 ==Charts== ===Weekly charts=== 1986 weekly chart performance for \"Take My Breath Away\" Chart (1986) Peak position Australia (Kent Music Report) 2 Europe (European Hot 100 Singles) 1 Finland (Suomen virallinen lista) 13 Italy (Musica e dischi) Select \"Singoli\" in the \"Tipo\" field, type \"Berlin\" in the \"Artista\" field and press \"cerca\". 5 South Africa (Springbok Radio) 2 Spain (Productores de Música de España) 2 US Cash Box Top 100 Singles 1 1988 weekly chart performance for \"Take My Breath Away\" Chart (1988) Peak position 1989 weekly chart performance for \"Take My Breath Away\" Chart (1989) Peak position Brazil (Pro-Música Brasil) 8 1990 weekly chart performance for \"Take My Breath Away\" Chart (1990) Peak position Europe (Eurochart Hot 100 Singles) 11 2022 weekly chart performance for \"Take My Breath Away\" Chart (2022) Peak position New Zealand Hot Singles (RMNZ) 29 ===Year-end charts=== 1986 year-end chart performance for \"Take My Breath Away\" Chart (1986) Position Australia (Kent Music Report) 6 Belgium (Ultratop 50 Flanders) 7 Canada Top Singles (RPM) 23 Europe (European Hot 100 Singles) 32 Netherlands (Dutch Top 40) 16 Netherlands (Single Top 100) 8 UK Singles (Gallup) 9 US Billboard Hot 100 27 US Adult Contemporary (Billboard) 28 US Cash Box Top 100 Singles 21 West Germany (Official German Charts) 43 1987 year-end chart performance for \"Take My Breath Away\" Chart (1987) Position Europe (European Hot 100 Singles) 67 1990 year-end chart performance for \"Take My Breath Away\" Chart (1990) Position UK Singles (Gallup) 37 ==Certifications== ==References== Category:1986 songs Category:1980s ballads Category:Synth-pop songs Category:Jessica Simpson songs",
 "title": "Take My Breath Away"
}