{
 "id": "117023",
 "text": "The Missouri Valley Conference (MVC) is a college sports conference in the United States that sponsors many sports, but has not played football since the 1984 season. The MVC has its roots in the Missouri Valley Intercollegiate Athletic Association (MVIAA), a league formed in 1907 by several schools in the Midwestern United States. The MVIAA split into two leagues in 1928. One league, made up mostly of large schools, kept the MVIAA name and years later became the Big Eight Conference. The smaller schools formed the MVC. Both groups claimed a 1907 founding date, and the same history up to the 1928 split. However, the Big Eight merged in 1996 with several schools from the collapsing Southwest Conference to form today's Big 12 Conference, which does not claim any of the Big Eight's history. Because of this, only the MVC now has a claim to any of the MVIAA's history. == Members == Following the departure of one school and the arrival of three in July 2022, the MVC has 12 members. Missouri State will leave for Conference USA in July 2025. School Location Founded Type Nickname Joined MVC Belmont University Nashville, Tennessee 1890 Private Bruins 2022 Bradley University Peoria, Illinois 1897 Private Braves 1948, 1955 Drake University Des Moines, Iowa 1881 Private Bulldogs 1907, 1956 Evansville, Indiana 1854 Private Purple Aces 1994 Illinois State University Normal, Illinois 1857 Public Redbirds 1981 Indiana State University Terre Haute, Indiana 1865 Public Sycamores 1977 Missouri State University Springfield, Missouri 1905 Public Bears 1990 Murray State University Murray, Kentucky 1922 Public Racers 2022 Cedar Falls, Iowa 1890 Public Panthers 1979 Southern Illinois University Carbondale Carbondale, Illinois 1869 Public Salukis 1975 (UIC) Chicago, Illinois 1859 Public Flames 2022 Valparaiso University Valparaiso, Indiana 1859 Private Beacons 2017 ===Associate members=== The MVC has six \"associate members\", each of which plays one sport in the conference. School Location Founded Type Joined Sport Current main conference Nickname Ball State University Muncie. Indiana 1918 Public 2024 MAC Cardinals Bowling Green State University (Bowling Green) Bowling Green, Ohio 1910 Public 2023 MAC Falcons (Little Rock) Little Rock, Arkansas 1927 Public 2013 Ohio Valley Trojans Miami University Oxford, Ohio 1809 Public 2024 MAC RedHawks Northern Illinois University DeKalb, Illinois 1895 Public 2023 MAC Huskies Western Michigan University Kalamazoo, Michigan 1903 Public 2023 MAC Broncos ==References== *",
 "title": "Missouri Valley Conference"
}