{
 "id": "1170029",
 "text": "Bessent v Dellinger is a an American court case from 2025. Many people began lawsuits against the second Trump Administration's actions to make the United States Federal government smaller, but this is the first one that went to the United States Supreme Court, which is the most powerful court in the United States. The case is about a government official called Hampton Dellinger. The Trump Administration fired him, and they did not say why. The Supreme Court was not asked to say whether the Trump Administration is allowed to fire Dellinger. They were asked to say whether the D.C. Circuit Court is allowed to let him stay in his job until his hearing. The Court ruled that the temporary restraining order could stand, so the problem went back to the regular court system. A regular judge said the firing was illegal, but then another appeals court said it was legal. Then Dellinger decided to stop his lawsuit. ==Firing== On February 7, 2025, the White House Presidential Personnel Office sent an email to Hampton Dellinger firing him. Dellinger was the head of the Office of Special Counsel. This Office is supposed to work without anyone telling it what to do. President Carter made it in the 1970s. The Office protects people who report corruption and other crime in the government. U.S. law says that the President can only dismiss its head for \"inefficiency, neglect of duty, or malfeasance in office,\" which means \"doing the job too slowly or expensively, not doing the job enough or not doing all of it, or doing something very wrong.\" The email that the Presidential Personnel Office sent to Dellinger did not say any reasons. Dellinger sued. Dellinger said that the law did not let the President fire him this way. Joe Biden made Dellinger head of the Office of Special Counsel in 2023 and the U.S. Senate agreed in 2024. Dellinger was suppost to work in this job for five years. ==Temporary order and appeal== Judge Amy Berman Jackson of the Washington D.C. District Circuit said Dellinger could keep working as head of the Office for two more weeks. Then the District Court would do a full hearing and decide whether the firing was legal. The Trump Administration said Jackson was wrong and asked the Circuit Court of Appeals to stop Jackson's decision. But the three judges on the Circuit Court of appeals voted to keep Jackson's decision. The two judges who said yes, Florence Pan and J. Michelle Childs wrote \"The question here is not whether the president is entitled to prompt review of his important constitutional arguments [...] The issue before us is whether his mere claim of extraordinary harm justifies this court's immediate review, which would essentially remove the legal issues from the district court's ambit before its proceedings have concluded.\" This means \"The president is allowed to ask us to give him an answer quickly, but just because he says something is very bad is not enough.\" The judge who voted no was Gregory Katsas. ==Supreme Court== The Trump Administration asked the Supreme Court to hear the case, even though they do not usually do this for things that only last two weeks. Dellinger's lawyers presented before the court in his favor on February 18, 2025. That week, four groups of people wrote to the Supreme Court. Twenty states wrote one letter to the court together and asked the Court to stop the temporary restraining order. The New Civil Liberties Alliance wrote to the Court and said the president has to have \"absolute removal authority,\" meaning that he must be allowed to fire whoever he wants. People who used to work for the government wrote another letter; they asked the Court to let Dellinger stay at his job and only look at the firing after the February 26 hearing because all the ideas would be clearer then: \"If the case ultimately returns to this Court, it will be with a much more solid basis with which to decide any remaining Constitutional questions.\" Some law professors who had worked in laws about banks and money wrote to the court too. They asked the court to protect the Federal Reserve and other parts of the government that work with banks and money no matter what they decided about the rest of the case. On Friday, February 21, the Court ruled that Dellinger could stay at his job until his hearing. Two justices, Sonia Sotomayor and Ketanji Brown Jackson wrote that they would also have said no to Trump's request that they stop a temporary order at all. The two justices who disagreed were Neil Gorsuch and Samuel A. Alito. ===Response=== Acting Solicitor General Sarah M. Harris, the lawyer for the Trump Administration, wrote, \"This case involves an unprecedented assault on the separation of powers that warrants immediate relief. [...] These judicial rulings irreparably harm the presidency by curtailing the president's ability to manage the executive branch in the earliest days of his administration.\" Dellinger's lawyer, Joshua A. Matz, agreed that there were big \"Constitutional questions\" but said that the Court should not answer those questions during an emergency but should take its time to think carefully instead. ==Later== On February 26, Judge Amy Berman Jackson said the temporary order could last until March 1 so that she could write a full opinion. On March 1, she wrote that Delliger could stay in his job and that the Executive Branch must \"not treat him in any way as if he has been removed.\" Judge Berman Jackson wrote that Congress had made the Office of Special Counsel independent because it could not do its job if it were not. On March 5, the Court of Appeals for the D.C. Circuit said that the Trump Administration could remove Dellinger from his job and stop him from working until at least his next hearing on March 21. Later that day, Dellinger and his lawyers said that he would not ask the Supreme Court to look at the case any more: \"I'm stopping the fight because, yesterday, circuit court judges reviewing the trial court decision in my favor granted the government's request that I be removed from office while the case continues,\" Dellinger wrote. \"This new ruling means that OSC will be run by someone totally beholden to the president for the months that would pass before I could get a final decision from the U.S. Supreme Court.\" ==References== ==Other websites== *Supreme Court Dissenting Opinion *Circuit Court of Appeals *District Court, Berman Jackson Opinion Category:Donald Trump Category:United States Supreme Court cases",
 "title": "Bessent v. Dellinger"
}