{
 "id": "1170130",
 "text": "The Tobago stream frog, Bloody Bay stream frog, Tobago poison frog or Bloody Bay poison frog (Mannophryne olmonae) is a frog. It lives on Tobago Island and Little Tobago Island in Trinidad and Tobago. ==Body== The adult male frog is 21.0 mm ± 2.4 mm long from nose to rear end and the adultfemale frog is 21.6 mm ± 2.2 mm. The skin of the frog's back is brown in color. There is a green mark in the shape of the letter X on the back. There is a mark in the shape of the letter V on the back nearer the rear end. There is a light brown and gray stripe on each side of the body. There is a yellow and gray stripe on each side of the body. The tops of the legs are light brown in color with dark marks and two yellow marks. There is yellow color on the belly. ==Home== This frog lives near streams in forests. Almost all of the forests in Tobago are secondary forests. That means they were forests long ago, then people cut them down to make cacao farms, and now they are growing into forests again. The forests in Tobago have been growing back since the early 1900s. Scientists saw the frog between 30 and 4900 meters above sea level. Scientists found the frog in one protected place, a rain reserve called Tobago Main Ridge Forest Reserve. ==Young== The male frogs sit in cracks in rocks or on piles of rocks and call to the female frogs. The female frogs lay eggs on land. The male frogs watch the eggs. After the eggs hatch, the male frogs carry the tadpoles until they can swim. People have seen male Mannophryne olmonae with as many as 19 tadpoles on their backs at the same time. The male frogs choose water near streams but not in streams. No animals that want to eat the tadpoles live in those pools. Scientists say the tadpoles probably eat dead things. The tadpoles are dark brown in color. The tadpole's body is 8.0 mm wide and 10.8 mm long. Its tail is 24.5 mm long. So the tadpole is 35.3 mm long. ==Danger== Scientists say this frog is in some danger of dying out. In 2006, scientists said this frog was in very big danger of dying out. People had changed the places where the frog lived and the fungal disease chytridiomycosis can infect this frog, though scientists are not sure if it can make the frogs sick. The Republic of Trinidad and Tobago made Environmentally Sensitive Areas to protect frogs and other living things. Now the frog is in some danger of dying out but not very big danger any more. ==First paper== * ==References== Category:Frogs of South America Category:Poison dart frogs",
 "title": "Mannophryne olmonae"
}