{
 "id": "1170609",
 "text": "The iPad Pro is a high-end tablet series from Apple, designed as the premium line of the iPad brand. It operates on iPadOS, which is a version of the iOS system tailored for tablets. Initially, the iPad Pro set itself apart with features like support for the Apple Pencil and a larger screen. However, as other iPad models adopted similar features, the latest 7th generation iPad Pro stands out due to its powerful M4 chip and its distinction as the thinnest product ever launched by Apple. The original iPad Pro was launched in September 2015, featuring iOS 9 and an A9X chip, available in two sizes: 9.7-inch and 12.9-inch, with the smaller model released in March 2016. The second-generation iPad Pro debuted at the June 2017 WWDC, introducing the more powerful A10X Fusion chip and replacing the 9.7-inch model with a 10.5-inch variant. In October 2018, the third-generation iPad Pro was revealed, showcasing an all-screen design that eliminated the home button in favor of Face ID. This model continued to offer 11-inch and 12.9-inch sizes, which have been consistent in all subsequent models. The fourth-generation iPad Pro was launched in March 2020, featuring the A12Z chip and the new Magic Keyboard for iPad. The fifth-generation model, shared in April 2021, marked a significant advancement as it incorporated Apple’s M1 processor, making it the first iPad not to use an A-series chip. The sixth-generation iPad Pro debuted in October 2022, introducing the M2 processor, Apple Pencil Hover functionality, and ProRes video capabilities. Finally, the seventh-generation iPad Pro, released in May 2024 alongside the 6th-generation iPad Air, comes equipped with the M4 processor, the new Apple Pencil Pro, a redesigned Magic Keyboard with function keys, and is notable for being the first iPad to feature an OLED display. ==History== ===First generation=== The first generation of the iPad Pro was introduced in two sizes: a larger 12.9-inch model and a compact 9.7-inch version. The 12.9-inch iPad Pro was shared on September 9, 2015, and made its debut on November 11, 2015, distinguishing itself as the largest iPad to date and the first to include LPDDR4 RAM. It initially came with iOS 9.1. The 9.7-inch variant was unveiled on March 21, 2016, and launched shortly after, based on the design of the iPad Air 2, shipping with iOS 9.3. ===Second generation=== On June 5, 2017, Apple introduced the second generation of the iPad Pro, showcasing significant upgrades such as the powerful A10X Fusion processors and storage options of 64 GB, 256 GB, and 512 GB. The new lineup included a 10.5-inch model that replaced the previous 9.7-inch version, alongside an updated 12.9-inch version. Both models featured enhanced displays with refresh rates of up to 120 Hz, improved HDR capabilities, and TrueTone white balancing for better color accuracy. Following this launch, Apple discontinued the original iPad Pro models. Notably, these second-generation models were the last in the iPad Pro series to include a Home Button and a USB-lightning connector. ===Third generation=== The third generation of the iPad Pro was unveiled on October 30, 2018, and is available in two sizes: 11-inch and 12.9-inch. The new models feature edge-to-edge displays, with the 11-inch version replacing the previous 10.5-inch model. They offer storage options of up to 1 TB and introduce Face ID technology, which can unlock the device in any orientation thanks to a new sensor array. In a move towards maximizing screen space, the home button has been eliminated, resulting in uniform bezel sizes around the display. The third generation of iPads introduced a USB-C connector, marking a significant upgrade in connectivity options. Alongside this new feature, the iPads were launched with the Smart Keyboard Folio, which is sold separately. Additionally, they are compatible with the Magic Keyboard that includes a trackpad, which was launched in early 2020. This evolution enhances the functionality and versatility of the iPad, catering to users' needs for more efficient typing and navigation. ===Fourth generation=== The fourth generation of iPad Pro was unveiled on March 18, 2020, maintaining the same screen sizes as its predecessor. This new model features a redesigned camera module and is powered by the Apple A12Z processor. It comes with a minimum storage capacity of 128 GB and includes a LiDAR Scanner for enhanced augmented reality capabilities. Additionally, it supports the new Magic Keyboard case, expanding its functionality and user experience. ===Fifth generation=== The fifth generation of the iPad Pro was unveiled on April 20, 2021, maintaining the same design and screen sizes as its predecessor. It boasts impressive features, including the powerful Apple M1 processor and 5G connectivity. The device also supports Thunderbolt 3/USB 4 connectivity, allowing data transfer speeds of up to 40 Gbit/s and the capability to connect to external displays with resolutions up to 6K. Customers can choose between 8 or 16 GB of RAM, and the 12.9-inch model features a mini-LED display known as the \"Liquid Retina XDR\" display, enhancing visual quality. ===Sixth generation=== ===Seventh generation=== ==Related pages== * Pen computing * Graphics tablet ==Notes== ==References== ==Other websites== * iPad Pro - official website Category:iPad Category:Tablet computers",
 "title": "IPad Pro"
}