{
 "id": "1170469",
 "text": "A powertrain layout is the way a vehicle is set up to use force to create motion. Usually, a powertrain layout is defined by the position of the engine and which of the wheels get power. Powertrain layouts can usually be described in shorthand by their engine's position, followed by which wheels get power. For example, a Honda Civic would be a front-engine, front-wheel-drive car. On the other hand, a (pre-2003) Volkswagen Beetle would be rear-engine, rear- wheel-drive. == Front-Engine Layouts == Vehicles that have their engine put ahead of the front axle of the car are called front-engine. While the term \"front-engine\" can also often be used as a way to say \"front-engine\" or \"front-mid-engine\", the two are not the same. The front-engine layout is the most common in the world since front-engine layouts tend to be easier to plan around, less costly of space inside the car, and less expensive to produce. === Front-Engine, Front-Wheel-Drive === Front-engine, front-wheel-drive is a common layout in small and cheap cars. This is because they tend to be less expensive to make and less intrusive to the passengers and driver in the field. These vehicles are also often thought to be relatively easy to drive compared to front-engine, rear-wheel drive vehicles because they do not have the same tendency to oversteer (lose rear traction while keeping front traction) during acceleration that rear-wheel drive vehicles do. These vehicles put out power through the front wheels only. Some examples of the front-engine, front-wheel-drive (or FF) layout are: * Honda Civic * Saturn S-Series * Chevrolet Cobalt === Front-Engine, Rear-Wheel-Drive === Front- engine, rear-wheel-drive is a layout associated with classic sports cars. The engine in these cars will put out power to the rear wheels only. Generally, this layout is seen as being better-balanced and faster than FF. This is because an accelerating car will tilt its weight backwards, giving the rear tires better grip while speeding up. In an FF layout, this means that grip goes away from the accelerating wheels and makes it more difficult to effectively use the engine's power. On the other hand, a front-engine, rear- wheel-drive (FR) layout car will gain grip on its tires being used to accelerate, so can use its engine's power more efficiently. Some examples of FR layout are: * Fiat 124 (First Generation) * Dodge Challenger (V8 trims) * Pontiac Firebird === Front-Engine, All-Wheel-Drive === Front-engine, all-wheel drive is a layout associated with off-road capable cars and luxury vehicles. The engine in these cars uses computers to use the engine's power on all four wheels, depending on which wheels can get traction at the given moment. FR advantages in acceleration can meet with the ease to drive of FF in the front- engine, all-wheel-drive layout (F4), alongside the traction advantage gained from using all four wheels for acceleration in low-grip environments. Some examples of the F4 layout are: * Mitsubishi Lancer (Lancer Evolution models only) * Subaru Impreza (although some models were FF only) * Nissan Skyline (GT-R models only) == Mid-Engine Layouts == Vehicles with their engine between the front and rear wheels are classified as mid-engine. This can come in both a front-mid-engine and rear-mid-engine variety, with front-mid-engine being often misrepresented as being the same as front-engine. == Front-Mid-Engine == Generally, front-mid-engine vehicles are sports cars or at least have some emphasis on performance. They have their engine located behind the front wheels, but in front of the driver. This creates a more even weight distribution than the regular front-engine layout would allow for. === Front- Mid-Engine, Front-Wheel-Drive === The front-mid-engine, front-wheel-drive layout (FMF) is extremely uncommon, with the most prominent example being the Citroën Traction Avant. It has also been used for the Renault 4. The layout is considered archaic in the modern day, as the FMF layout existed to solve a problem that came as a result of lacking the innovation of the transaxle, which resolved the issue of lacking proper space for a front-wheel-drive vehicle's transmission. === Front-Mid-Engine, Rear-Wheel-Drive === Considered performance-oriented, though significantly less prestigious than those rear- mid-engine sports cars, front-mid-engine, rear-wheel-drive (FMR) layout is a common vehicle architecture when it comes to muscle cars, inexpensive sports cars, and performance vehicles generally. This layout helps to bring weight slightly closer to the driven rear wheels, helping to enhance the grip-adding effects of the vehicle body shifting with acceleration. Many FMR vehicles only have two seats. Some examples of the FMR layout are: * Saturn Sky * Chevrolet Corvette (C2 to C7 generations) * Honda S2000 === Front-Mid-Engine, All-Wheel- Drive === The front-mid-engine, all-wheel-drive layout (FM4) is an uncommon architecture for vehicles, with certain model year (1990-1992) Ford Cosworth RS500 models being the posterchild for such a design. Combining the advantages stated for the F4 layout with the more balanced weight distribution of the FMR layout, the FM4 layout is both performance-oriented and relatively off-road capable. == Rear-Mid-Engine == Rear-mid-engine vehicles are usually dedicated sports cars, as they tend to have only two seats, aggressive handling, and less creature comfort than most other vehicle layouts. These tend to be, but are not necessarily always, rear-wheel-drive. === Rear-Mid-Engine, Front- Wheel-Drive === A purely hypothetical layout, the rear-mid-engine, front- wheel-drive layout (MF) has never actually been attempted, as it would be both extremely impractical and non-advantageous to construct a vehicle in such a way. Doing so would likely result in poor handling, acceleration, and cabin space, as acceleration would both have weight present over the non-driven wheels and transfer weight away from the driven wheels, as well as finding cabin space limited by the need to use space behind passengers as an engine bay. No real world cars use this layout. === Rear-Mid-Engine, Rear-Wheel-Drive === The most prestigious layout, the rear-mid-engine, rear-wheel drive layout (MR) is associated with exotic vehicles and supercars/hypercars (high performance, high cost vehicles with low practical use cases.) Brands like Ferrari and Lamborghini focus heavily on this layout, as does motorsport broadly (see Formula One.) This layout uses a more heavily rearward weight distribution to maintain rear traction better when accelerating-- even with significantly higher levels of power than even most sports car engines produce-- and help to enhance turning dynamics. Some examples of the MR layout include: * Toyota MR2 * Ferrari F50 * Chevrolet Corvette (C8 models only) === Rear-Mid-Engine, All-Wheel-Drive === The rear-mid-engine, all-wheel-drive layout (M4) is a more technologically advanced evolution of the MR layout. It combines the benefits to acceleration of the MR layout with the benefits to grip of an all-wheel-drive system, creating a generally extremely high- performance vehicle. Some examples of the M4 layout include: * Audi R8 (Type 4S only) * Bugatti Veyron * Lamborghini Diablo (VT 6.0 models only) == Rear- Engine Layouts == === Rear-Engine, Front-Wheel-Drive === A mostly conceptual layout, the rear-engine, front-wheel-drive layout (RF) exists primarily in prototypes and thought experiments. The Dymaxion car is one of the few known examples of a realized RF vehicle, but it never really came to production. This layout would generally be considered impractical and mostly without use. === Rear-Engine, Rear-Wheel-Drive === The rear-engine, rear-wheel-drive layout (RR) is a somewhat dated vehicle architecture that places the engine behind the rear axle. Companies like VW and Porsche are known largely for their uses of this layout. It combines the benefits of a further rearwards weight distribution helping for accelerating traction with the benefits to braking from theoretically being able to use both the front and rear brakes more effectively than in further frontward engine applications (due to the body of the car shifting forwards while decelerating, this means that cars with less weight already on the rear wheels will force their front brakes to do more work, as brakes cannot work better than the tires they are attempting to stop.) This layout is sometimes criticized for being very punishing to drive, with Porsche's 930 Turbo even being dubbed \"The Widowmaker\" for the perception of danger in its driving style. Some examples of the RR layout include: * Volkswagen Beetle (Before 2003) * Porsche 911 (Not all models are RR) * DMC DeLorean === Rear-Engine, All-Wheel-Drive === The rear-mid-engine, all-wheel- drive layout (R4) is usually a modernization of the RR layout, using the traction advantage of all four wheels' contribution to help smooth out some of the less desirable driving traits of the traditional rear-engine, rear-wheel drive configuration. While not necessarily common, many cars do use an R4 layout and have for decades. A prominent example is the Porsche 964, a form of Porsche 911 optioned with an all-wheel drive system. In the modern day, the Porsche 911 can be bought with all-wheel-drive as an option, but can also be bought with rear-wheel-drive. ==References== Category:Automotive technologies",
 "title": "Powertrain layout"
}