{
 "id": "1171791",
 "text": "Qa'a, also known as Qáa or Ka'a, was the last king of Egypt's First Dynasty. His name means \"his arm is raised.\" He ruled for 33 years at the end of the 30th century BC. A historian named Manetho called him Biénechês and said he ruled for 26 years. Different versions of Manetho's writings give him other names like Óubiênthis and Víbenthis. Qa'a's parents are unknown, but it is believed his father was either Anedjib or Semerkhet, the kings before him. If Manetho is correct, Semerkhet was his father. Not much is known about Qa'a's rule, but it seems he ruled for a long time, around 33 years. Evidence of a second Sed festival, which was usually held after 30 years of rule, supports this. The Palermo Stone, an ancient record, mentions his coronation and some religious events. Many ivory tags from his time describe burial offerings and the king's personal items. Several high officials from Qa'a's reign have been found, including Merka, Henuka, Neferef, and Sabef. Despite his long and successful rule, after Qa'a's death, there was a fight for the throne. In the tomb of Merka, a stone vessel with the name \"Sneferka\" was found. It is unclear if Sneferka was another name for Qa'a or a different, short-lived king. Some experts think Sneferka and another mysterious ruler, \"Horus Bird,\" fought for power. Hotepsekhemwy, who started the Second Dynasty, might have ended this fight. Evidence of grave robberies and fires in royal tombs supports this idea. Hotepsekhemwy's seals found in Qa'a's tomb suggest he might have buried Qa'a to legitimize his rule. Qa'a's tomb in Abydos is large, measuring 98.5 x 75.5 feet (30 x 23 meters). It was excavated in 1993 and contained 26 satellite burials. A seal with Hotepsekhemwy's name was found near the tomb entrance, suggesting he buried Qa'a. Qa'a's tomb stela is now displayed at the University of Pennsylvania Museum. Merka, a nobleman under Qa'a, had a tomb in Saqqara with a stele listing many titles. The second Sed festival and high-quality royal steles indicate Qa'a's reign was stable and prosperous. Year labels from his rule were found at Umm el-Qa'ab in Abydos. Qa'a is believed to have ruled around 2916 BCE. A dish with his name and titles was found in the tomb of Seth-Peribsen, a Second Dynasty pharaoh. == References == * https://penelope.uchicago.edu/Thayer/E/Roman/Texts/Manetho/History_of_Egypt/1*.html * Peter Clayton, Chronicle of the Pharaohs, Thames & Hudson Ltd, 2006 paperback p.25; the tomb is now fully published: Eva-Maria Engel: Das Grab des Qa'a: Architektur und Inventar, Wiesbaden 2017 ISBN 978-3447108768 Category:Pharaohs of the First Dynasty of Egypt",
 "title": "Qa'a"
}