{
 "id": "1171887",
 "text": "Ahmed Abu Bakar Said Al-Kaf (; born 6 March 1983) is an Omani professional football referee. He has been a full international for FIFA since 2010.FIFA. \"Oman: Referees\" . He has served as the referee of numerous matches, such as the 2016 AFC Champions League final between Jeonbuk Hyundai Motors and Al Ain FC, the second round of the 2018 AFC Champions League Final. == Early career == Ahmed Al-Kaf was born on March 6, 1983, in Oman. After receiving his FIFA license in 2010, he started officiating various international matches. Al-Kaf served as the referee of the AFC Champions League final twice. He served as the referee for the 2016 AFC Champions League final match between South Korean team Jeonbuk Hyundai Motors and Emirati team Al Ain. In the second round of the 2018 AFC Champions League Final, Al-Kaf served as the referee. Throughout his career, Al-Kaf has officiated 114 matches, and he has handed out a total of 343 yellow cards and 10 red cards. == Controversies == ===2020 AFC U-23 Championship rulings=== On 18 January 2020, Al-Kaf was questioned for several rulings he made in the 2020 AFC U-23 Championship Quarter Finals between Saudi Arabia and Thailand. He awarded Saudi Arabia a free kick in the 78th min, just outside the field. Video assistant referees later changed it to a penalty, but he didn't check the monitor himself. The Football Association of Thailand sent a letter to the Asian Football Confederation, questioning Al-Kaf's fairness during the match. ===2026 FIFA World Cup qualifier rulings=== On 10 October 2024, Al-Kaf was again questioned after he was accused of making biased decisions in the match between Bahrain and Indonesia in the 2026 World Cup qualification, including allowing the game to go on for nine additional minutes, despite six minutes originally being given. This led to Mohamed Marhoon scoring a 2-2 equalizer with only 20 seconds remaining. In response, defender Shayne Pattynama nearly started a fight with Bahraini team members, leading to the referee team being led off the field by security. Indonesian netizens challenged Al-Kaf's ruling by saying \"90+6=99\", which became an inside joke within the football community. The Football Association of Indonesia (PSSI) sent a complaint letter to FIFA, with executive member Arya Sinulingga saying \"[Al-Kaf] extended the adding time just to allow Bahrain to score an equalizer\". The Oman Football Association would later condemn the \"use of threatening and intimidating language\" towards Al-Kaf by Indonesian fans, defending the Omani referee team while claiming that the association was looking into the incident with the relevant authorities. The Indonesian FA later requested the AFC to assign referees from neutral zones for the World Cup qualifiers. == References == Category:1983 births Category:Living people Category:Omani football referees Category:2023 AFC Asian Cup referees",
 "title": "Ahmed Al-Kaf"
}