{
 "id": "117136",
 "text": "The European economy in the Middle Ages was based on the idea of manorialism (seigneurialism). The medieval economy relied mainly on agriculture. Manorialism describes how land was distributed and who profited from the land. == Overview == In medieval manorialism, a lord received a piece of land (usually from a more powerful nobleman or the King). After that, the lord owned the land - and everything that was on it. That included most of the peasants who lived on the land, including serfs. The peasants were commoners: ordinary people who had no social status. Usually, the peasants also had to work on the lord's lands for free. In return, the lord gave protection to the peasants and allowed them to live on his land. Lords had certain legal powers, like that of a police force. === Tributes === Peasants were their lord's subjects and had to pay tributes to him. The amount they had to pay varied. They could pay with money, but because they were subsistence farmers, they had no money. Peasants could pay tributes in other ways. They could do free work for their lord. They could also give the lord some of the food they grew. Typically they would give the lord a certain percentage of their harvest (for example, 10%). This method is also called sharecropping or payment in nature. ==Common features== === Classes of land === Under manorialism, there were up to three different classes of land. Not every lord had all three of these types of land on his manor. The first class of land was called demesne. The lord controlled this land and used it for himself. Villeins lived and worked on the second type of land: dependent holdings. Villeins were peasants who were allowed to live on the lord's land, but had to work for him or pay him tributes. The final class was free peasant land. Peasants in this class rented land from the lord. They paid an amount of rent that did not change over time. They were still They were still a part of the manor and had to follow its rules. However, they did not have to work for the lord or give him tributes (only rent). Sometimes the lord had a mill, a bakery, and/or a wine-press. The peasants could use these, but had to pay. Similarly, they had to pay a fee if they wanted to hunt in the lord's woodland; let pigs feed in there; or use the lord's legal system to settle disagreements. Running a large manor was expensive. Smaller manors typically had lower costs, and peasant land was less common there. === Villeins === Villeins lived on dependent holdings. They held lands based on agreements with their lords. Usually, tenancy was hereditary: when a peasant died, his land passed to a family member. However, each time another family member took control of the land, they had to pay a fee to the lord. Villeins could not abandon their land, because they had nowhere else to go and would probably starve to death. Villein land could not be passed to a non-family member, unless the lord agreed (and a fee was paid). Though not free, villeins were definitely not slaves: they enjoyed legal rights, subject to local custom, and had they could use the courts. (They had to pay, however, which added to the manor's income. Villeins might be paid for working on the demesne. This happened more and more often starting in the 13th century. Villeins often sublet their land (they rented it to another person). === Description of a manor house === This description of a manor house at Chingford, Essex in England was recorded in a document for the Chapter of St Paul's Cathedral when it was granted to Robert Le Moyne in 1265: ==Variation among manors== Feudal society was based on two principles, that of feudalism and manorialism. Not all manors had all three kinds of land: as an average, demesne accounted for roughly a third of the arable area and villein holdings rather more; but some manors had only demesne land, others had only peasant holdings. Similarly, the proportion of unfree and free tenures could vary greatly. This meant that the amount of wage labour to perform agricultural work on the demesne varied as well. The proportion of the cultivated area in demesne tended to be greater in smaller manors. The share of villein land was greater in large manors, providing the lord with a larger potential supply of labour for demesne work. The proportion of free tenements was less variable, but tended to be greater on the smaller manors. Manors varied also in their geographical arrangement. Most were not a single village. Often, parts of two or more villages belonged to the manor, or were shared between several manors. In those places, peasants living far from the lord's estate sometimes paid cash instead of working for the lord. The demesne was usually not a single plot of land. It consisted of some land around the central house and estate buildings. The rest of the demesne land was in the form of strips all around the manor. The lord might lease free tenements belonging to neighbouring manors, as well as holding other manors some distance away to provide a greater range of produce. Not all manors were held by laymen lords who did military service or paid cash to their superior. An English survey done in 1086 estimates that 17% belonged directly to the king, and more than a quarter were held by bishops and monasteries. These church manors were usually larger, with a significantly greater villein area than the lay manors next to them. The effect of circumstances on manorial economy is complex and at times contradictory: upland conditions have been seen as tending to preserve peasant freedoms (livestock husbandry is less labour-intensive and therefore less demanding of villein services); on the other hand, some such areas of Europe have been said to show some of the most oppressive manorial conditions, while lowland eastern England is credited with an exceptionally large free peasantry, in part a legacy of Scandinavian settlement. The spread of money economy is often seen as having stimulated the replacement of labour services by money payments, but the growth of the money supply and resulting inflation after 1170 initially led nobles to take back leased estates and to re-impose labour dues as the value of fixed cash payments was less in real terms. ==Historical development and geographical distribution== Today, the term is used most to refer to medieval Western Europe. A similar system was used in the rural parts of the late Roman Empire. The birthrate and population were declining. Labor was therefore the most important factor for production. Successive administrations tried to stabilise the imperial economy by freezing the social structure into place: sons were to succeed their fathers in their trade. Councillors were forbidden to resign, and coloni, the cultivators of land, were not to move from the demesne they were attached to. They were on their way to becoming serfs. Several factors conspired to merge the status of former slaves and former free farmers into a dependent class of such coloni. Laws of Constantine I around 325 reinforced both the negative semi-servile status of the coloni and limited their rights to sue in the courts. Their numbers were increased by barbarian foederati who were permitted to settle within the imperial boundaries. As the Germanic kingdoms succeeded Roman authority in the West in the fifth century, Roman landlords were often simply replaced by Gothic or Germanic ones, with little change to the situation. The process of rural self-sufficiency was given an abrupt boost in the 8th century, when normal trade in the Mediterranean Sea was disrupted. Henri Pirenne'si dea disputed by many, supposes that the Arab conquests forced the medieval economy into even greater ruralisation and gave rise to the classic feudal pattern of varying degrees of servile peasantry underpinning a hierarchy of localised power centres. ==Related pages== *Allodial title *Feudalism *Manor house *Seigneurial system of New France in 17th century Canada *Shōen (Japanese Manorialism) *Heerlijkheid (Dutch manorialism) *Junker (Prussian manorialism) == Other websites == *Archibald R. Lewis, The Development of Southern French and Catalan Society, 718–1050 *Estonian Manors Portal - the English version gives the overview of 438 best preserved historical manors in Estonia *Medieval manors and their records Specific to the British Isles. Category:Feudalism Category:Economic systems",
 "title": "Manorialism"
}