{
 "id": "117173",
 "text": "The Western Collegiate Hockey Association (WCHA) is a group of colleges and universities in the Midwestern United States that play NCAA Division I women's ice hockey against one another every season. The champion is automatically invited to the NCAA Division I women's hockey tournament. When the WCHA ran a men's league, the men's champion was also automatically invited to the Division I men's tournament. Founded in 1951 as a men's hockey league, the WCHA added a women's division in the 1999–2000 season. The league would expand far beyond its traditional Midwestern base, adding teams in Alabama, Alaska, Colorado, and Indiana at different times. The WCHA shut down its men's division after the 2020–21 season when seven of its 10 members left to start a new Central Collegiate Hockey Association. Today, eight schools are members of the now women-only WCHA. == Current members == Institution Location Founded Joined Affiliation Enrollment Nickname Main conference Bemidji State University Bemidji, Minnesota 1919 1999 (women) Public 5,198 Beavers Northern Sun (D-II) Minneapolis & Saint Paul, Minnesota 1851 1999 (women) Public 51,848 Golden Gophers Big Ten Duluth, Minnesota 1947 1999 (women) Public 11,168 Bulldogs Northern Sun (D-II) Minnesota State University, Mankato Mankato, Minnesota 1867 1999 Public 14,712 Mavericks Northern Sun (D-II) Ohio State University Columbus, Ohio 1870 1999 Public 59,837 Buckeyes Big Ten 1869 1999 (women) Public 14,615 Huskies Northern Sun (D-II) Saint Paul, Minnesota 1885 2021 Private 9,878 Tommies Summit League Madison, Wisconsin 1848 1999 (women) Public 43,820 Badgers Big Ten == Former members == === Final men's members === Ten schools were members of the WCHA men's league in its final season. Institution Location Founded Joined Affiliation Enrollment Nickname Main conference Current hockey conference Huntsville, Alabama 1950 2013 Public 9,736 Chargers Gulf South (D-II) Anchorage, Alaska 1977 1993 15,819 Seawolves Great Northwest (D-II) Independent Fairbanks, Alaska 1917 2013 7,744 Nanooks Great Northwest (D-II) Independent Bemidji, Minnesota 1919 2010 (men) 5,198 Beavers Northern Sun (D-II) CCHA Bowling Green, Ohio 1910 2013 17,357 Falcons MAC CCHA Big Rapids, Michigan 1884 2013 13,798 Bulldogs GLIAC (D-II) CCHA Sault Ste. Marie, Michigan 1946 2013 1,963 Lakers GLIAC (D-II) CCHA Houghton, Michigan 1885 1951–1981 1984 7,319 Huskies GLIAC (D-II) CCHA Mankato, Minnesota 1867 1999 14,712 Mavericks Northern Sun (D-II) CCHA Northern Michigan University Marquette, Michigan 1899 1984-1997 2013 7,612 Wildcats GLIAC (D-II) CCHA === Other former men's members === Institution Location Joined Left Nickname Next hockey conference Current hockey conference Colorado College Colorado Springs, Colorado 1951 2013 Tigers NCHC NCHC Denver, Colorado 1951 2013 Pioneers NCHC NCHC Ann Arbor, Michigan 1951 1981 Wolverines CCHA Big Ten Michigan State University East Lansing, Michigan 1951 1981 Spartans CCHA Big Ten Minneapolis & Saint Paul, Minnesota 1951 2013 Golden Gophers Big Ten Big Ten Duluth, Minnesota 1966 2013 Bulldogs NCHC NCHC Omaha, Nebraska 2010 2013 Mavericks NCHC NCHC Grand Forks, North Dakota 1951 2013 Fighting Sioux NCHC NCHC Notre Dame, Indiana 1971 1981 Fighting Irish CCHA Big Ten 1990 2013 Huskies NCHC NCHC Madison, Wisconsin 1969 2013 Badgers Big Ten Big Ten === Former women's member === Institution Location Joined Left Nickname Next hockey conference Current hockey conference Grand Forks, North Dakota 2004 2017 Fighting Hawks ==References== *",
 "title": "Western Collegiate Hockey Association"
}