{
 "id": "1171354",
 "text": "The Koli is a agriculturist caste of Gujarat and Maharashtra and categorised as Other Backward Class (OBC) by Government of India in the Indian states of Gujarat, Maharashtra, Telangana, Goa, Karnataka and the Union Territories of Daman and Diu and Dadra and Nagar Haveli. Kolis are classified as an Forward caste (General caste) in The Union Territories of Jammmu and Kashmir and the Laddakh. == Military == *Laya Patil, Fleet chief of Maratha Navy *Kuroji Naik, Koli subedar in Maratha army *Kheroji Pattikar, Koli subedar of Maratha Army *Kanhoji Angre, Admiral of Maratha Navy *Javji Bamble, Mansabdar of Bavan Maval in Maratha Empire *Arjan Koli and Hari Koli, Brave Boys of Dhari, Amreli who saved the Maharaja Sayajirao Gaekwad of Baroda state. *Gamaji Bhangre, Koli subedar of Maratha army who conquered the Trimbak fort from the Nizam of Hyderabad. == Rulers == *Jhagad Singh Negi, Koli ruper of Koligarh, Uttarakhand *Jayaba Mukne, Koli ruler of Jawhar state, founder of Mukne dynasty, Mahalaxmi temple of Dahanu and Jawhar state *Yashwantrao Mukne, Koli Maharaja of Jawhar state *Nemshah Mukane, second Koli ruler of Jawhar state *Nag Naik, Koli ruler of Kondhana fort (Sinhagad fort) who fought against Sultan Muhammad bin Tughluq for eight months. *Dhan Mer, Koli ruler of Dhandhuka who defeated and killed Rajput king Ebhal Vala of Vallabhipur and annexed the Vallabhipur in Koli kingdom. == Freedom fighters and rebels == *Krishna Sable, Koli freedom fighter from Maharashtra *Jhalkaribai, Leader of the Rebellion of 1857 and Commander-in-chief of Durga Dal of Jhansi State *Honya Kengle, freedom fighter and Robin Hood of Bomabay *Hari Makaji Naik, Koli rebel leader who led the Ramoshis of Satar *Govindas Ramdas, freedom fighter from Gujarat later became ruler of Thasra *Govind Rao Khare, Subedar of Maratha Empire and He fought against British government *Chempil Arayan, First Koli freedom fighter from South India and Koli Admiral of Travancore Navy *Bapuji Bhangare, Koli freedom fighter from Maharashtra, Patil of Deogan *Khemi Sarnaik, Koli ruler of Bavan Maval who assembled the Koli Naiks of Bavan Maval and fought against Sultan Aurangzeb. *Valoji Bhangare, Koli Patil of Deogaon who challenged the Maratha Empire. *Rama Kirve, Koli freedom fighter from Maharashtra who breakdown the British government. *Bachur Khokani, Koli freedom fighter from Gujarat who challenged the British government and Baroda state. *Raghoji Bhangre, Most celebrated Koli freedom fighter from Maharashtra wgo defeated the British troops several time. *Baburao Kokate, Baburao Kokate Koli took an active part in the 1942 August Kranti Movement known as Quit India Movement. *Chimnaji Jadhav, Koli rebel from Maharashtra who revolted against British government to re-establish the Maratha Empire. *Nana Farari, Koli revolutionary from Bombay state *Balaji Pichad, Koli rebel leader from Bombay who breakdown the British government for several years in Konkan *Rama Bama Koli, he led Chirner Jungle Satyagraha in 1930 and killed by British troops. == Pirates, Outlaws and Dacoits == *Joban Pagi, legendary dacoit from Gujarat *Bapaiya, legendary dacoit from Gujarat who killed the Bahuchara mata *Babar Deva, Koli outlaw from Gujarat who killed 24 persons and helped the Mahatma Gandhi. == Politicians == *Manorama Madhwaraj, former Cabinet minister in Government of Karnataka *Manohar Lal Panth, Minister of State (Independent charge), Uttar Pradesh Government *Shankersinh Vaghela, Former Chief minister of Gujarat who married with Rajput girl *Mahendra Munjapara, Union Minister of State for AYUSH and Minister of State for Woman and Child Development in the Second Modi ministry *Madhukar Pichad, 4 term Cabinet minister in Maharashtra government *Madhav Singh Solanki, Minister of External Affairs of India, 7th Chief minister of Gujarat *Lalit Bhati, Former minister in Government of Rajasthan *Kunwarjibhai Bavaliya, Cabinet Minister of Water Supply, Water Resource and Food Civil Supply, Animal Husbandry, Rural Housing in Government of Gujarat *Kapil Patil, Union minister of Panchayat Raj *Jagdish Thakor, President of Gujarat Pradesh Congress Committee, Member of Parliament from Patan Lok Sabha *Ishwarsinh Patel, Former minister of the ministries of Transport, Co-operation (Independent Charge), Sports (Independent Charge), Youth and Cultural activities (Independent Charge) in Gujarat government *Hukam Chand Kachwai, 4 terms Member of Parliament from Madhya Pradesh Lok Sabha *Gigabhai Gohil, Former minister in Gujarat government, He fought against Nawab of Junagadh State *Dhani Ram Shandil, Minister of Health, Labour and Employment and Social Justice and Empowerment in Himachal government *Devabhai Malam, Minister of Animal husbandry in Gujarat government *Brij Lal, Former DGP of Uttar Pradesh and Member of Parliament from Uttar Pradesh Rajya Sabha *Bihari Lal Arya, Former Minister of State for Ministry of Micro, Small and Medium Enterprises in Government of India *Bharti Shiyal, National Vice President of the Bharatiya Janata Party and Member of Parliament from Bhavnagar *Bharatsinh Madhavsinh Solanki, former President Gujarat Pradesh Congress Committee, former Cabinet minister in Government of India *Bhanu Pratap Singh Verma, former Minister of State in Ministry of Micro, Small and Medium Enterprises in Government Of India *Bahadur Singh Koli, two terms Member of Parliament from Bharatpur Lok Sabha *Balak Ram Kashyap, retired Civilian Staff Officer (Class I) from Indian Army and former Member of Parliament from Shimla Lok Sabha *Baburao Chinchansur, former Minister of Textiles, Ports & Inland Transport of Karnataka *Anita Bhadel, former minister of Child and women development department in Rajasthan government. * *Zankhana Patel, two time MLA from Choryasi assembly constituency *Virendra Kashyap, Member of Parliament from Shimla Lok Sabha *Ram Nath Kovind, former President of India == Saints == *Bhikha Bapa, a Koli saint and devotee of Hindu god Krishna. Bhikha Bapa was childhood friend of Dhirubhai Ambani who was founder of Reliance industries. Bhikha Bapa is now family deity of Ghedia Kolis of Junagadh district. *Ambigara Chowdaiya, was a Koli saint, poet and social critic in 12th century India *Velnath Thakor, Koli saint from Girnar, Junagadh, Gujarat and Koli prince of Chunval Pradesh (now known as Bahucharaji). *Kanua Baba, Koli saint from Uttar Pradesh == Sports == *Chetan Sakariya, Indian International cricketer == Social media influencer == *Prajakta Koli == Related articles == *Koli Zamidar *Koli rebellion *Koli clans and titles *Koli Chabutra *Koli Mahasabha *Koli dance *First Alcoholic ban in India *Gujarat Kshatriya Sabha == References == Category:Koli",
 "title": "List of Kolis"
}