{
 "id": "117179",
 "text": "College Hockey America (CHA) was a group of American colleges and universities that played NCAA Division I women's ice hockey against one another every season. It was founded in 1999 as a men's hockey conference, with women's teams joining in 2002. The men's side of CHA folded after the 2009–10 season. It continued as a women-only league through the 2023–24 season, after which it merged with the men-only Atlantic Hockey Association to form Atlantic Hockey America. Before the merger, CHA had close ties with the Atlantic Hockey Association. Although the conferences had separate bylaws and governing boards, they had a single commissioner and a combined office staff from 2010 to the merger. Also, three of the final CHA members housed their men's teams in the Association. ==Final members== All of the final members are now in Atlantic Hockey America. * Lindenwood University * Mercyhurst University * Pennsylvania State University (\"Penn State\") * Rochester Institute of Technology (\"RIT\") * Robert Morris University * Syracuse University Of the final members, Mercyhurst, RIT, and Robert Morris had varsity men's teams in the Association; all of that conference's final members are now in the merged AHA. Penn State has a men's varsity team that plays in the school's all-sports conference, the Big Ten. Syracuse has a men's team, but it plays at club level, outside the NCAA structure. ==Former members== ===Men's teams=== * United States Air Force Academy (\"Air Force\") (1999–2006) — now in Atlantic Hockey America * University of Alabama in Huntsville (\"Alabama–Huntsville\" or \"UAH\") (1999–2010) — was in the Western Collegiate Hockey Association (WCHA) before the team's suspension in 2021 * United States Military Academy (\"Army\") (1999–2000) — now in Atlantic Hockey America * Bemidji State University (1999–2010) — now in the Central Collegiate Hockey Association (CCHA) * University of Findlay (1999–2004) — dropped men's and women's hockey * Niagara University (1999–2010) — now in Atlantic Hockey America * Robert Morris University (2004–2010) — now in Atlantic Hockey America * Wayne State University (1999–2008) — dropped men's hockey ===Women's teams=== * University of Findlay (2002–2004) — dropped men's and women's hockey * Niagara University (2002–2012) — dropped women's hockey * Quinnipiac University (2004–2005) — now in ECAC Hockey * Wayne State University (2002–2011) — dropped women's hockey ==References== * Category:1999 establishments in the United States Category:2024 disestablishments in the United States",
 "title": "College Hockey America"
}