{
 "id": "1171062",
 "text": "The Social Democratic Party of Hungary (Hungarian: Magyarországi Szociáldemokrata Párt, MSZDP) is a Hungarian social democratic party founded on December 7, 1890. == History == The Hungarian Social Democratic Party was founded on December 7, 1890, under the leadership of Pál Gábor Engelmann (1854–1916), following the guidelines of the Second International. Its initial members came from the disintegrating General Workers' Party of Hungary. The party’s main goals included abolishing the capitalist social system, transferring the means of production to public ownership, establishing universal suffrage, and passing worker protection laws. It played a key role in creating various trade unions and educating the peasantry. The party’s search for direction is reflected in its shifting stance: before the outbreak of World War I, it pursued a pacifist, anti-war policy, but after the war ended, it justified the conflict’s legitimacy with social policy arguments aligned with its own interests. In 1917, it welcomed the Great October Socialist Revolution but did not dare to lead a similar revolution in Hungary. The party first participated in parliamentary elections in 1922, where it became the second strongest party with 17% of the vote, securing 25 seats in the National Assembly. It couldn’t repeat this success, partly due to constant changes in voting laws, but it remained a parliamentary force until 1944. In 1944, the party was forced into illegality, its leaders were arrested, many were deported to concentration camps, and several fell victim to the Arrow Cross terror. The party soon joined the Hungarian Front, which united anti- fascist forces and organized armed resistance. The party merged with the Hungarian Communist Party on June 12, 1948, and the merger resulted in the establishment of the Hungarian Working People's Party. In 1989, during the change of regime, the historic party was re-formed. The party achieved 3.55% in the 1990 Hungarian parliamentary election, thus failing to enter Parliament. The Social Democratic Party of Hungary became a \"pocket party\" of the Hungarian Socialist Party (MSZP), with its members entering parliament on MSZP lists and under MSZP colors, without forming a separate faction. Due to internal tensions in 2007 and 2008—both within the coalition and the MSZP—former MSZP members began steadily joining the MSZDP and establishing their own factions in various local governments. The sudden influx of new social democrats, driven largely by coalition conflicts, created a real opportunity for the MSZDP to form an independent faction and transform the subordinate MSZP-MSZDP relationship into a coalition partnership.Kilépnének az MSZP-ből, hogy koalíciót kössenek a szocdemek – Index, 2008. április 8. At the 2010 parliamentary election, the party ran independently. The party had 11 individual candidates and managed to field 4 regional lists.Egyéni jelöltek 2010-ben Its goals included reducing the number of local governments by half and ensuring that every village has a lower primary school.HVG magazin 2010. április 3. 51. oldal The MSZDP held its festive congress in December 2015 to celebrate the 125th anniversary of its founding. During this period, the MSZDP worked hard to regain its rightful place in the international social democratic movement. It established connections with the German SPD, the Austrian SPÖ, and the Dutch Labour Party. It formed a close partnership with the French Socialist Party’s internal new left movements, Les Nouveaux Partisans and Le Mouvement Commun, which aim to reach more people and renew the Socialist Party. The MSZDP regained its position in the Party of European Socialists (PES) and the Socialist International, and it participates as an observer in the work of the Progressive Alliance. Since the party could not participate in the 2018 or 2022 parliamentary elections, a court reclassified it as an association in the spring of 2023. However, on September 6, 2024, it managed to be reclassified as a party again. They set a goal to participate in the 2026 parliamentary elections as well.https://mszdp.hu/valasztasok/ ==References== Category:Political parties in Hungary Category:Social democratic parties Category:Liberal parties",
 "title": "Social Democratic Party of Hungary"
}