{
 "id": "1171118",
 "text": "Maerseveen was a 17th-century merchant ship of the Dutch East India Company. Being built in 1660, Maerseveen made two return voyages from the Dutch Republic via Cape of Good Hope to Batavia, the Dutch East Indies between 1660 and 1664. During her second voyage commander discovered two islands that are nowadays called Prince Edward Island and Marion Island. At the time he named the northern island \"Dina\" named the southern island (Marion Island) \"Maerseveen\"; after his ship. In 1665 the ship was involved in the Battle of Lowestoft where it burned down and sank on 13 June 1665 together with its crew. ==Ship details== Maerseveen was built in 1660 in Amsterdam for the and was put into use the same year. She was made of wood and had a loading capacity of 1210 tons. She was 170 foot long and had a beam of 39 foot. The ship's cavity was 18.25 foot. The ship had 78 guns. ==History and fate== ===1660-1661: Texel-Batavia=== On 24 November 1660 she departed from Texel for her first voyage to Batavia under command of Pieter Berkhout. She had an intermediate stop at Cape of Good Hope for thee weeks from 3 May 1661 to 21 May 1661. During the voyage to Batavia, Pieter Berkhout died. She ship arrived in Batavia on 31 July 1661. ===1661-1662: Batavia-Vlie=== After a 17-months stay, the ship returned on 23 December 1662 under command of Haan. The ship had an intermediate stop at Cape of Good Hoop from 15 March 1662 to 10 April 1662. She arrived in Vlie, Dutch Republic on 28 July 1662. ===1662-1663: Texel-Batavia=== Departing on 9 October 1662 from Texel, she started her second voyage to Batavia under command of from Bunschoten. She had an intermediate stop at Cape of Good Hope for two weeks from 4 February 1663 to 19 February 1663. Leaving Cape of Good Hoop, she sailed further south than usual. On 4 March 1663 Barend Barendszoon Lam discovered two island. He named the northern island Dina (now Prince Edward Island) and the southern island Maerseveen, after the ship, (now called Marion Island). Because the First Mate of the ship, Michiel Gerritzoon Boos, kept a journal we know that is was fine weather that day. No landing to the island was attempted but they sailed close enough to see the seacliffs of the southern island. However the wrong latitude of the islands (41° S instead of 46° S) was written down. It took over 100 years before the islands were rediscovered by the French on 13 January 1772. The ship arrived at Batavia on 11 May 1663. ===1663-1664: Batavia-Vlie=== On 21 December 1663 the ship left Batavia under command of Jan Hermansz. It was part of a as part of a fleet of 15 ships sailing to Patria. Via Cape of Good Hoop (13/03/1664 - 16/04/1664) Maerseveen arrived at Vlie on 16 April 1664. ===1665: Battle of Lowestoft (fate)=== The ship was involved during the Battle of Lowestoft under command of Jacob Janszoon Reus. While fleeing, the ship got entangled to Tergoes and the merchantman Swanenburg. The ships surrendered. After British king James had just accepted their surrender, Captain Gregory of the Dolphin, set the Dutch ships on fire. Hundreds of crew were burned alive or drowned. The three ships burned down and sank on 13 June 1665. The furious James ordered the arrest of the captain, but he had fled with ship and was never found again.Fox, The Four Days Battle of 1666, pp.97-98 ==References== Category:Ships Category:Shipwrecks Category:1660 establishments Category:1665",
 "title": "Maerseveen"
}