{
 "id": "1171636",
 "text": "Binangonan, officially the Municipality of Binangonan, is a municipality in the province of Rizal, Philippines. A thriving fish port and fishing industry is found in Binangonan, having a long coast line facing Laguna de Bay, including the western part of Talim Island. ==History== The settlement of present-day Binangonan was founded by Spanish missionaries between the years 1571–1602 as a part of a larger territory called Morong, but it was separated in 1621 to create an independent parish — and given the mythical Saint Ursula as the parish's patron. ===Ecclesiastical roots=== Binangonan was a settlement predating the Spanish colonial period, called Morong, that stretched from the Sierra Madre mountain range to the lake of Laguna de Bay. In the early Spanish conquest of Luzon, the Augustinian missionaries reached the settlement in 1574, followed by Franciscan missionaries in 1621 towards converting the Aeta natives. Indigenous Aetas are evidenced to have inhabited Binangonan until 1928, and their culture is found in Lungga Ita in Barangay Pila-pila and in Aeta words like Wawa and Ithan. The poblacion of the town was started in 1621, and a parish named after the patronage of the mythical Saint Ursula began in 1737. In 1835, the settlement seceded from the province of Laguna and was annexed to Distrito de los Mateo, renamed to Distrito Politico Militar de Morong. ===Rise of Binangonan=== At the height of the Philippine Revolution against the Spanish government, the townspeople of Binangonan rose in revolt in defiance of the Spanish authorities, as they joined the revolutionary group called Katipunan. The town's uprising was disparaged by the colonial authorities as \"Binangonan de los Perros\" (trans.: \"of the dogs\") but the ridicule did not prosper. The etymology of Binangonan (Tagalog:bangon, meaning \"to rise\") is traced to this origin, where events or people had arisen ===Municipality=== Liberation from foreign rule was shortlived however, when Americans arrived and subjugated the native population by a General Order No. 40 of March 29, 1900. On June 11, 1901, Binangonan was merged into the newly established province of Rizal, and for a brief time was brought back to the territory of Morong along with the other nearby towns of Baras and Cardona by a government Act issued on October 12, 1903, but it was spun off once again on November 6, 1903 when the Municipality of Binangonan finally acquired its own charter presided by Don Jose Ynares y Granados. ==References== Category:Settlements in Rizal",
 "title": "Binangonan"
}