{
 "id": "1171742",
 "text": "The 1911 Netherlands–Belgium women's fencing meeting was an international fencing gala assaut organized by the Ladies Fencing Club at the Verbrugge Fencing Academy in Antwerp, Belgium. It took place on 10 December 1911 with Dutch women's fencers of Salle De Vos from the Hague competing against fencers of Ladies Fencing Club from Antwerp. It was a return event of the two nations, after the 1911 Netherlands–Belgium women's fencing meeting earlier the year. The event contributed to the progress of international women's fencing and according to reports women's fencing was showing that it was closing the gap with men's fencing. ==Background== While fencing was already practiced by women during the 19th century, fencing was in this era a male-dominated sport. After pogress of women's fencing during the 1910s, it was introduced in 1924 at the Summer Olympics. This fencing competition was one of the earliest international fencing competition in the history of women's fencing; after the 1910 England–Belgium women's fencing competition and 1911 England–Holland women's fencing competitions. ==Organization== As the M. Cnoops, president of the Cercle de l'epée, couldn't attend the meeting; the event was chaired by colonel Georges Lecrecq. However, Cnoops sent a bunch of flowers to all the participants. A selection of the key people of facilitating and organizing this event were: *Albin Lambotte, president of the Ladies Fencing Club *M. M. van den Bergh, Dutch diplomat * Mrs and Miss van den Bergh *M. Pritsch, German diplomat *Mrs. von Mallinckrodt *M. C. Grisar *Mr. and Mrs. de Brockdorff *doctor and Mrs. Preetorius *Mr. and Mrs. Roggen *Mr. Pungs *Mrs. de Duve ==Event== The meeting took started at 2:30pm (local time). A total of twelve bouts were contested during the event. Bout Fencer 1 Fencer 2 1 2 3 4 5 6 7 8 9 10 11 12 In the evening the participants had a gala banquet at Paon Royal. After that the Dutch team returned home. ==Response== The Belgian media wrote very positively about the meeting. Le Matin used phrases as a \"very nice fencing session\" and a \"beautiful fencing demonstration\". L'Indépendance Belge praised the beauty of the matches and reported about the progress of women's fencing with closing the gap with men's fencing. The event was also reported positively in the Dutch media. Newspaper De Avondpost wrote about \"very nice matches\" and a \"successful assault\". ==References== Category:1910s in women's fencing Category:Sport in the Netherlands Category:Sport in Belgium Category:1911 in Europe",
 "title": "1911 Belgium–Netherlands women's fencing meeting"
}