{
 "id": "117177",
 "text": "The Central Collegiate Hockey Association (CCHA) is the name of two groups of colleges and universities, mostly in the Midwestern United States, that have organized for NCAA Division I hockey against one another every season. The first CCHA, formed in 1971, folded after the 2012–13 season. In February 2020, seven schools within the original CCHA's Midwestern footprint announced they would start play in a new CCHA in the 2021–22 season. Two other Midwestern schools joined the new CCHA, one in July 2020 and the other in July 2023. ==Original league== The first version of the CCHA was launched in 1971 by four schools—Bowling Green, Ohio, Ohio State, and Saint Louis. They would add Lake Superior State a year later, but lost the two Ohio schools in 1973. The CCHA recovered from this early blow in 1975 when Ohio State returned and Western Michigan joined for the first time. Saint Louis would stop playing hockey in 1979, but the Billikens were immediately replaced by Ferris State. In the last years of the decade, the CCHA became viewed as a major conference, and by 1980 Northern Michigan, which had joined in 1977, reached the championship game of the NCAA tournament. Later that year, another Ohio school, Miami, joined. ===1980s=== In 1981, the CCHA attracted four schools from the Western Collegiate Hockey Association (WCHA)—Michigan, Michigan State, Michigan Technological University, and Notre Dame. While Notre Dame shut down its men's hockey team in 1983, and Michigan Tech left the following year to return to the WCHA, the other two schools remained in the CCHA until the original league folded. UIC joined in 1982. The CCHA continued to gain respect, with Bowling Green becoming the CCHA's first NCAA champion in 1984. ===1990s=== The league stayed mostly stable through the 1990s. In 1992, Kent State joined, and Notre Dame brought back its hockey program and rejoined. While Kent State folded its hockey team two years later, and UIC did the same in 1996, the CCHA added three more members in that decade. Alaska joined in 1995, Northern Michigan returned the same year, and Nebraska–Omaha (now known for sports as simply \"Omaha\") joined in 1999. From that point, the league lost only one member (Nebraska–Omaha to the WCHA in 2010) before its demise. ===Demise=== The trigger for the end of the original CCHA was a large donation by energy billionaire Terry Pegula to his alma mater of Pennsylvania State University (Penn State). This donation funded the startup expenses for varsity men's and women's hockey teams at the university, plus a new arena for both teams. Once Penn State's teams took the ice in 2012–13, it gave the Big Ten Conference the six schools it needed to begin sponsoring men's ice hockey. Among these six were three of the CCHA's most important members in Michigan, Michigan State, and Ohio State. The Big Ten announced in 2011 that it would start a men's hockey league in 2013–14, and the three Big Ten members announced they would leave the CCHA at that time. Soon after the Big Ten announcement, a group of six schools—five from the WCHA plus CCHA member Miami (Ohio)—formed the National Collegiate Hockey Conference (NCHC), which began play in 2013–14. Within a few months, all of the other CCHA schools said they would also leave, with Western Michigan joining the NCHC, Notre Dame joining Hockey East, and the rest joining the WCHA. Throughout its history, the original CCHA only sponsored men's ice hockey—only one of its 11 final members had a varsity women's hockey team, namely Ohio State. The champion was automatically invited to the NCAA Division I men's hockey tournament. ===2012-13 CCHA members=== The CCHA members in its final season of 2012–13 were: * University of Alaska Fairbanks (\"Alaska\") — joined the WCHA; now a Division I independent (no conference) * Bowling Green State University (\"Bowling Green\") — joined the WCHA, and later one of the schools that revived the CCHA * Ferris State University — joined the WCHA, and later one of the schools that revived the CCHA * Lake Superior State University — joined the WCHA, and later one of the schools that revived the CCHA * Miami University (often called \"Miami (Ohio)\" to avoid confusion with the University of Miami in Florida, although that school does not play hockey) — now in the NCHC * University of Michigan — now in the Big Ten hockey league * Michigan State University — now in the Big Ten hockey league * Northern Michigan University — joined the WCHA, and later one of the schools that revived the CCHA * University of Notre Dame — moved to Hockey East, now in the Big Ten hockey league * Ohio State University — now in the Big Ten hockey league * Western Michigan University — now in the NCHC ==New CCHA== In June 2019, seven of the 10 men's members of the WCHA, all Midwestern schools, announced that they would leave that league at the end of the 2020–21 season. By this time, the men's WCHA featured these schools, plus Alabama–Huntsville, Alaska, and Alaska–Anchorage. Their announcement stated that they were considering forming a new, more geographically compact league. On February 18, 2020 these seven schools announced they would begin competing in a new CCHA in 2021–22. On July 30, 2020, St. Thomas, a Twin Cities school that would eventually start a move from NCAA Division III to Division I in July 2021 by joining the Summit League (which does not sponsor hockey), was announced as the eighth member of the new CCHA. In May 2022, Augustana University of South Dakota (not to be confused with Augustana College in Illinois) was announced as the CCHA's ninth member. Augustana joined in July 2023, the same time it started its varsity hockey team, and is playing partial CCHA seasons in 2023–24 and 2024–25 before starting full conference play in 2025–26. === Members === Institution Location Nickname Founded Enrollment Affiliation Joined Previous conference Augustana University Sioux Falls, South Dakota Vikings 1860 2,080 Private 2023 Bemidji State University Bemidji, Minnesota Beavers 1919 6,354 Public 2021 WCHA Bowling Green State University (Bowling Green) Bowling Green, Ohio Falcons 1910 20,395 Public 2021 WCHA Ferris State University Big Rapids, Michigan Bulldogs 1884 14,707 Public 2021 WCHA Lake Superior State University Sault Ste. Marie, Michigan Lakers 1946 2,637 Public 2021 WCHA Michigan Technological University (Michigan Tech) Houghton, Michigan Huskies 1885 7,270 Public 2021 WCHA Minnesota State University, Mankato (Minnesota State) Mankato, Minnesota Mavericks 1868 17,357 Public 2021 WCHA Northern Michigan University Marquette, Michigan Wildcats 1899 6,764 Public 2021 WCHA Saint Paul, Minnesota Tommies 1885 9,878 Private 2021 MIAC (Div. III) ==References== * Category:Central Collegiate Hockey Association Category:1971 establishments in the United States Category:2013 disestablishments in the United States Category:2020 establishments in the United States",
 "title": "Central Collegiate Hockey Association"
}