{
 "id": "1171700",
 "text": "RTM TV2 (stylised as tv2) is a Malaysian free-to-air public television channel owned and operated by the Radio Televisyen Malaysia, a broadcasting department of the Malaysian Government. Launched on 17 November 1969, TV2 is the second and second oldest TV station in Malaysia. The channel features mostly English, Mandarin and Tamil news and talk shows, the latter two languages were mainly produced for the dominant minority Chinese and Indian communities, whilst the English news functions for the nation's multiracial population whose dominant lingua franca or first language is the latter. It also offers some in-house, local and international entertainment programs, including reality shows, films and dramas as well as sports programming. ==Programme TV2== ===English Series On 2=== ===ABC & Freeform=== Series Season (production year) Episodes Air date End date A Million Little Things Coming Soon Alias Coming Soon Big Sky Coming Soon Castle Coming Soon Combat Hospital Designated Survivor 1 (2016–17) 21 8 September 2024 1 November 2024 Desperate Housewives Coming Soon FlashForward Coming Soon For Life Coming Soon Grey's Anatomy 1 (2005) 9 Coming Soon 2 (2005–06) 27 Coming Soon 3 (2006–07) 25 Coming Soon 4 (2007–08) 17 Coming Soon 5 (2008–09) 24 Coming Soon 6 (2009–10) 24 Coming Soon 7 (2010–11) 22 Coming Soon How to Get Away with Murder Kyle XY Coming Soon Last Resort Make It or Break It Missing No Ordinary Family Coming Soon NYPD Blue Once Upon a Time Coming Soon Pretty Little Liars Coming Soon Private Practice Coming Soon Red Widow Revenge Coming Soon Scandal Station 19 Coming Soon The Good Doctor The Nine Lives of Chloe King The River The Rookie Coming Soon The Wonder Years Coming Soon Ugly Betty Coming Soon ===AMC=== Series Season (production year) Episodes Air date End date 61st Street Coming Soon Better Call Saul Coming Soon Breaking Bad Coming Soon Dietland Coming Soon Fear the Walking Dead Coming Soon Feed the Beast Coming Soon Firebite Coming Soon Halt and Catch Fire Coming Soon Hell on Wheels Coming Soon Into the Badlands Coming Soon Lodge 49 Coming Soon Low Winter Sun Coming Soon Mad Men Coming Soon Moonhaven Coming Soon NOS4A2 Coming Soon Preacher Coming Soon Rubicon Coming Soon That Dirty Black Bag Coming Soon The Killing Coming Soon The Son Coming Soon The Walking Dead 1 (2010) 6 Coming Soon 2 (2011–12) 13 Coming Soon 3 (2012–13) 16 Coming Soon 4 (2013–14) 16 Coming Soon The Walking Dead: World Beyond Coming Soon TURИ: Washington's Spies Coming Soon ===AXN=== Series Season (production year) Episodes Air date End date The Firm Coming Soon ===BBC One=== Series Season (production year) Episodes Air date End date Merlin Coming Soon Sherlock Coming Soon ===CBC=== Series Season (production year) Episodes Air date End date Coroner Coming Soon ===CBS=== Series Season (production year) Episodes Air date End date All Rise Coming Soon Blood & Treasure Coming Soon Blue Bloods 1 (2010–11) 22 2 (2011–12) 22 3 (2012–13) 23 4 (2013–14) 22 Bull Coming Soon Close to Home Code Black Coming Soon Cold Case Coming Soon Criminal Minds Coming Soon Criminal Minds: Beyond Borders Coming Soon CSI: Crime Scene Investigation Coming Soon CSI: Cyber Coming Soon CSI: Miami Coming Soon CSI: NY Coming Soon CSI: Vegas Coming Soon Elementary Elsbeth Coming Soon FBI 1 (2018–19) 22 Coming Soon 2 (2019–20) 19 Coming Soon 3 (2020–21) 15 Coming Soon FBI: International 1 (2021–22) 21 Coming Soon 2 (2022–23) 22 Coming Soon FBI: Most Wanted 1 (2020) 14 Coming Soon 2 (2020–21) 15 Coming Soon Fire Country Coming Soon Harper's Island Hawaii Five-O (2010) 1 (2010–11) 24 2 (2011–12) 23 3 (2012–13) 24 Instinct Coming Soon Joan of Arcadia MacGyver 1 (2016–17) 21 2 (2017–18) 23 Coming Soon Madam Secretary Coming Soon Magnum P.I. 1 (2018–19) 20 Coming Soon 2 (2019–20) 20 Coming Soon Matlock Coming Soon Moonlight Coming Soon NCIS 1 (2003–04) 23 2 (2004–05) 23 NCIS: Hawai'i 1 (2021–22) 22 Coming Soon 2 (2022–23) 22 Coming Soon NCIS: Los Angeles 1 (2009–10) 24 Coming Soon 2 (2010–11) 24 Coming Soon 3 (2011–12) 24 Coming Soon NCIS: New Orleans Coming Soon Numbers 1 (2005) 13 Coming Soon 2 (2005–06) 24 Coming Soon Person of Interest 1 (2011–12) 23 2 (2012–13) 22 Coming Soon S.W.A.T. 1 (2017–18) 22 2 (2018–19) 23 3 (2019–20) 21 Salvation Coming Soon Scorpion 1 (2014–15) 22 Coming Soon 2 (2015–16) 24 Coming Soon SEAL Team 1 (2017–18) 22 Coming Soon 2 (2018–19) 22 Coming Soon Silk Stalkings So Help Me Todd Coming Soon Stalker Supergirl The Bold and the Beautiful The Good Wife Coming Soon The Guardian Coming Soon The Incredible Hulk Coming Soon The Mentalist 1 (2008–09) 23 14 July 2024 7 September 2024 2 (2009–10) 23 Coming Soon The Unit 1 (2006) 13 Coming Soon 2 (2006–07) 23 Coming Soon Three Rivers Tracker Coming Soon Under the Dome Unforgettable Coming Soon Vegas Without a Trace Coming Soon ===Channel 4=== Series Season (production year) Episodes Air date End date Humans ===Cinemax=== Series Season (production year) Episodes Air date End date Banshee ===Citytv=== Series Season (production year) Episodes Air date End date Hudson & Rex Season 1 13 13 November 2022 12 February 2023 ===CTV=== Series Season (production year) Episodes Air date End date Flashpoint Coming Soon RoboCop ===FOX=== Series Season (production year) Episodes Air date End date 9-1-1 21 Jump Street 24 Coming Soon 24: Legacy Coming Soon 24: Live Another Day Coming Soon Alert: Missing Persons Unit Coming Soon Bones Coming Soon Beverly Hills, 90210 Coming Soon Deputy Coming Soon Fantasy Island Coming Soon Fringe Coming Soon Glee Coming Soon Gotham 1 (2014—15) 22 21 February 2025 House Coming Soon Lie to Me Coming Soon Prison Break Coming Soon Rosewood Coming Soon The Chicago Code Coming Soon The O.C. Coming Soon The Resident Coming Soon The X-Files Touch Coming Soon ===FX=== Series Season (production year) Episodes Air date End date Damages Justified Legion Coming Soon Nip/Tuck Coming Soon Rescue Me Coming Soon Sons of Anarchy Coming Soon The Americans Coming Soon The Shield Coming Soon ===Global=== Series Season (production year) Episodes Air date End date Rookie Blue The Best Years Coming Soon ===HBO=== Series Season (production year) Episodes Air date End date Band of Brothers Coming Soon Boardwalk Empire Coming Soon Carnivàle Coming Soon Deadwood Coming Soon Game of Thrones 1 (2011) 10 Coming Soon 2 (2012) 10 Coming Soon 3 (2013) 10 Coming Soon 4 (2014) 10 Coming Soon House of the Dragon Coming Soon Industry Coming Soon Oz Coming Soon Six Feet Under Coming Soon The Leftovers Coming Soon The Pacific Coming Soon The Sopranos Coming Soon The Wire Coming Soon True Blood Coming Soon True Detective Coming Soon ===History Channel=== Series Season (production year) Episodes Air date End date Vikings ===ITV=== Series Season (production year) Episodes Air date End date Downton Abbey ===Lifetime=== Series Season (production year) Episodes Air date End date Drop Dead Diva Coming Soon ===MTV=== Series Season (production year) Episodes Air date End date Teen Wolf Coming Soon ===NBC=== Series Season (production year) Episodes Air date End date Aquarius Coming Soon Baywatch Blindspot 1 (2015–16) 23 Coming Soon 2 (2016–17) 22 Coming Soon 3 (2017–18) 22 Coming Soon Bonanza Coming Soon Chicago Fire 1 (2012–13) 24 Coming Soon Chicago Justice Coming Soon Chicago Med 1 (2015–16) 18 Coming Soon Chicago P.D. 1 (2014) 15 Coming Soon Chuck Crisis Season 1 13 Crossing Jordan Coming Soon ER Coming Soon Fear Itself Friday Night Lights Good Girls Coming Soon Grimm Hannibal Coming Soon Heroes Coming Soon Heroes Reborn JAG Knight Rider Las Vegas Law & Order Coming Soon Law & Order: Criminal Intent 1 (2001–02) 22 31 March 2024 14 June 2024 Law & Order: Special Victims Unit Coming Soon Manifest Coming Soon Medium Coming Soon New Amsterdam Coming Soon Nurses Coming Soon Parenthood Coming Soon Quantum Leap Coming Soon Revolution Shades of Blue Coming Soon Smash Coming Soon Taken Coming Soon Timeless Coming Soon The Blacklist Coming Soon The Night Shift 1 (2014) 8 2 November 2024 17 November 2024 2 (2015) 14 22 November 2024 27 December 2024 The West Wing Coming Soon This Is Us Coming Soon Trauma Zoey's Extraordinary Playlist Coming Soon ===Netflix=== Series Season (production year) Episodes Air date End date House of Cards Coming Soon The Punisher Coming Soon ===Paramount+ & Spike=== Series Season (production year) Episodes Air date End date Blade: The Series Coming Soon NCIS: Sydney Coming Soon ===Showtime=== Series Season (production year) Episodes Air date End date Dexter Homeland Coming Soon Ray Donovan Coming Soon ===Sky One=== Series Season (production year) Episodes Air date End date A Discovery of Witches Coming Soon Strike Back Coming Soon ===Starz=== Series Season (production year) Episodes Air date End date Camelot Da Vinci's Demons ===SundanceTV=== Series Season (production year) Episodes Air date End date The Red Road Coming Soon ===Syfy=== Series Season (production year) Episodes Air date End date Battlestar Galactica Haven ===The WB & The CW=== Series Season (production year) Episodes Air date End date 7th Heaven Coming Soon 90210 Coming Soon Angel Arrow Coming Soon Batwoman Coming Soon Beauty And The Beast Charmed Coming Soon Crazy Ex-Girlfriend Coming Soon Dynasty Coming Soon Everwood Coming Soon Felicity Gilmore Girls Coming Soon Gossip Girl Coming Soon Hart of Dixie In the Dark Coming Soon iZombie Coming Soon Legacies Coming Soon Legends of Tomorrow Coming Soon Life Unexpected Nancy Drew Coming Soon Nikita Coming Soon One Tree Hill Coming Soon Privileged Reaper Coming Soon Ringer Riverdale Coming Soon Roswell, New Mexico Coming Soon Smallville 1 (2001–02) 21 5 November 2023 24 March 2024 Superman & Lois Coming Soon Supernatural Coming Soon The 100 Coming Soon The Flash 1 (2014–15) 23 28 December 2024 16 February 2025 The Originals Coming Soon The Vampire Diaries Coming Soon ===TNT=== Series Season (production year) Episodes Air date End date Dallas Falling Skies Franklin & Bash Coming Soon Legends Leverage Coming Soon Major Crimes Coming Soon Murder in the First Coming Soon Perception Coming Soon Rizzoli & Isles Coming Soon The Last Ship Coming Soon The Librarians The Closer Coming Soon ===UPN=== Series Season (production year) Episodes Air date End date Star Trek: Enterprise Coming Soon Star Trek: Voyager Coming Soon Veronica Mars Coming Soon ===USA Network=== Series Season (production year) Episodes Air date End date Burn Notice Coming Soon Common Law Covert Affairs Fairly Legal Coming Soon Graceland Coming Soon In Plain Sight Coming Soon Monk Coming Soon Necessary Roughness Coming Soon Psych Coming Soon Royal Pains Coming Soon Suits White Collar Coming Soon The 4400 ==History== ===Setup=== The idea of a second television channel in Malaysia emerged as early as 1964. The previous year, Singapore gained two television channels (on channels 5 and 8). The plan for the second channel out of Kuala Lumpur was outlined as part of the arrival of equipment from the United Kingdom, which was set to arrive in April-May 1964. The second channel was scheduled to begin its services in June 1964. The then-Information Minister, Senu bin Abdul Rahman announced that Television Malaysia was going to start a second channel with the initial target date for its launch estimated to be on 8 February 1969. The plan was to coincide with the move of the television facilities to Bukit Puteri (Angkasapuri). The new channel would air programmes sponsored by commercial organisations. An attempt at starting an experimental broadcast was held in December 1968. The aim was not to disrupt the programming of the existing channel, which was temporarily blocked to air a Quran reading competition. The trial run of the \"second channel\" ran from 14 to 19 December and was limited to a six-day relay of the programming usually seen on the existing service. The channel broadcast on the following frequencies: * 8 (Kuala Lumpur, Penang) * 9 (Ipoh, Malacca) * 10 (Johor Bahru) * 2 (Taiping) * 6 (Kluang) The initial launch date scheduled for 8 February 1969 was ultimately scrapped, being delayed to the end of the year - initially, April was the new planned target. Recruitment for the new channel started in July in order to accelerate the process for its launch. The launch date was announced in September: 17 November, commencing its broadcasts from Angkasapuri. The existing channel would be renamed Siaran Nasional while TV2 would be \"somewhat commercialised\", according to TV Malaysia director Ow Keng Law. ===1969–1984=== TV2, then Rangkaian Kedua (Second Network) began operations on 17 November 1969, when Televisyen Malaysia (now known as TV1) bifurcated into two channels and merge with Radio Malaysia to become the present-day broadcasting department. Then, TV1 was known as Rangkaian Pertama (First Network). The channel opened at 9pm, starting with a speech by Tunku Abdul Rahman followed at 9:15pm by a special programme introducing viewers to the new television facilities. The channel closed at 10:45pm. The frequencies were the same as the \"emergency frequencies\" used by what was now Siaran Nasional in December 1968. The new channel had a \"dual role\": entertainment and goodwill coupled by a nationalistic feeling. Initially it wasn't available in the east coast, when TV Malaysia put wrestling matches on TV2 in 1970, when they were achieving its apex in popularity, viewers in the area were deprived. Like TV1, TV2 started broadcasting in colour since 28 December 1978 in Peninsular Malaysia. During its early years, it only broadcast in the evenings, with daytime broadcasts for schools under the TV Pendidikan banner from 1972 until 1999, when daytime transmission was introduced on the channel. Colour broadcasts began on 7 May 1979, with 14 hours a week of programmes in colour. In May 1982, it was announced that TV2 would start broadcasting to East Malaysia on 31 August 1983, Malaysia's Independence Day (or Hari Merdeka), enabling the channel to have total nationwide coverage. The channel's nationwide operations cost a total sum of M$ 23 million. ===Post–1984=== In March 1984, TV2 began airing Cantonese and Hokkien dramas, replacing its Wednesday evening Chinese movie slot. Such dramas, produced in Hong Kong and Taiwan respectively and contain no violence, would be sourced from a local distributor. TV2 had previously aired the TVB-produced. Cantonese drama One Plus One in December 1983, and in 1981, replacing its two Mandarin drama slots which were on \"annual leave\". The first regularly-airing Cantonese drama, Women CID, began on 7 March 1984, airing two episodes back-to-back on Wednesdays at 8:30 pm. The first locally-produced Cantonese drama, The Shell Game, began airing in January 1987. In late 1987, TV1 along with TV2 revamped their programming to compete with rival TV3 with movies, American serials and Chinese dramas. Public affairs programmes were planned to be included. Sports programming airs at 10 pm. Sign off time were now at midnight on weekdays and 1 am on weekends. English programmes and English news broadcasts airing on TV1 would move to TV2 as an effort to convert TV1 into an all-Malay channel in stages in late 1987. On 1 February 1988, TV2's English, Mandarin and Tamil news broadcasts became 25 minutes long instead of 20 minutes. TV2 began adding a weekly Chinese action drama series in late 1988 to complement the existing Chinese programmes. RTM had planned to add the series in July 1988. RTM had plans to introduce separate primetime news programmes for TV1 and TV2 in 1991. At that time, TV2 simulcast TV1's 8 pm news. The Information Ministry believes that along with TV3's news, it would provide \"a wider range of information through the electronic media\" and \"keep viewers informed of developments\" from Malaysia and abroad. In July 1992, RTM decided that TV2's news will be on local, foreign and economy. The English news broadcast would also be moved from its 11:30 pm slot. As a response to requests by viewers in states where Friday is a holiday, TV2 began adding six hours for its Friday broadcasts starting January 1992. Along with that, TV2 will start Friday-to-Sunday weekend broadcasts at the same time as TV1, which is at 8 am. TV2 began reducing the airing of Chinese programmes in 1991 to promote the production of local Chinese content that reflected the Malaysian Chinese culture, using the airtime saved from not airing action films from Hong Kong. The airtime for Chinese programmes in 1992 was at seven and a half hours, with an hour more added in 1993. In April 1993, TV2 and TV1 underwent a rescheduling of timeslots of its news broadcasts. Starting in 1994, RTM revamp TV1 and TV2 programmes by airing religion, information and educational programmes in primetime slot. TV2's English news began aired during primetime on 27 December 1994. In conjunction with RTM's 50th anniversary on 1 April 1996, TV2 began 18 hour broadcast while its sister channel, TV1 began 24 hour broadcast. As part of Ramadan, TV2 began airing the American series \"Islam And Ramadan\" on 6 January 1997 to help the non-Malay Muslim viewers learn more about Islam. In April 1998, TV1 and TV2 decided to decrease transmission hours and save RM50 million in costs. Its sister channel TV1 would lose one hour of its broadcast day, with the sign on time now at 7 am. A similar proposal made in November 1998, meant to start in January 1999, was to \"cut operating costs\" and would save RM30 million. In April 2001, in conjunction with RTM's 55th anniversary, TV2 and its sister channel, TV1 underwent restructuring on their respective scheduling time to adapt with current situation. On 1 January 2003, TV2 and its sister channel, TV1 underwent programme reschedulling in order to \"give a satisfaction\" to its viewers and to attract its advertisers. The new scheduling saw both channels airing programmes in English. In August the same year, both channels went on to reschedulling their news broadcast. Upon RTM's new logo launching in August 2004, TV2 along with TV1 launches their respective new logo and image branding. At the same time, TV2 adopt a new slogan, \"Saluran Famili Anda\" (Your Family Channel) and began to airing more variety and informative shows. In February 2005, TV2 and its sister channel, TV1 programmes began to aired on MiTV until the latter's shutdown in November 2006. On 1 April 2006, in conjunction with RTM's 60th anniversary, TV2 and its sister channel, TV1 went rebranding and reverted back to their respective 1978 brand name. Since 3 April 2006, the channel began to broadcast 24 hours a day to offer more programmes for viewers who stay up late to watch television. Its sister channel, TV1 followed suit more than 6 years later on 21 August 2012. In 2008, TV2 along with TV1 gained the increasing of viewership ratings and revenue in the last six months. On 1 January 2009, RTM2 along with its sister channel RTM1 reverted to its old primary name, which has been used since 1990, and at the same time, their respective new logo was introduced. TV2 and its sister channel, TV1 also airs programmes during the Hari Raya Aidilfitri celebration annually. On 1 April 2019, TV2 has started its HDTV broadcasting in conjunction of RTM's 73rd anniversary, and available exclusively through myFreeview DTT service on channel 102. ==Logo history== File:RTM2 1984 logo.png|TV2's first logo (1978–1987). File:RTM2 logo 1987.png|TV2's second logo (1987–1990). File:RTMTV2-1990.svg|TV2's third logo (1990–2004). File:Rtm tv2 logo 1996.png|(April 1996-19th August 2004) File:RTM TV2 logo 1996 incomplete.svg|Incomplete version (April 1996-19th August 2004) File:Rtm tv2 logo 2004.png|TV2's fourth logo (2004–2006). File:RTM2 logo 2006.png|TV2's fifth logo (2006–2008). File:Rtm tv2 logo 2009.png|TV2's sixth logo (2009–2010). File:RTM TV2 logo 2013.png|TV2's eighth and current logo (2013–present). ==Related pages== * TV1 (Malaysian TV network) ==References== ==Other websites== * Category:Television stations in Malaysia",
 "title": "TV2 (Malaysian TV network)"
}