{
 "id": "1171566",
 "text": "Bob Rosen is an American psychologist, CEO advisor, keynote speaker, and world-renowned thought leader on healthy people and healthy organizations. As a New York Times best-selling author. He is the founder and CEO of Healthy Companies, an organization dedicated to helping companies build healthy leadership and corporate environments. == Education == Rosen was a Dupont Scholar and earned his Bachelor of Arts (B.A.) in Behavioral Sciences from the University of Virginia (1973-1977) and pursued higher education in clinical psychology, obtaining a Ph.D. from the University of Pittsburgh (1978-1981). In 1991, he received a five-year grant from the John D. & Catherine T. MacArthur Foundation to further his interest in the relationship between leadership and organizational behavior. == Career == In 1988, Rosen founded Healthy Companies International, a consulting firm dedicated to enhancing leadership and organizational health. The firm has worked with some of the world’s largest and most influential companies. Over the years, Rosen has interviewed or advised over 600 CEOs globally, gaining insights into the challenges and opportunities leaders face in today’s fast-paced, complex business environments. As an organizational psychologist, Rosen’s research and consulting focus on the psychology of leadership and organizational change. He emphasizes that organizations can only be as healthy as their leaders. His approach highlights the importance of self-awareness, personal growth, and adaptability, arguing that grounded leaders can navigate modern business complexities. Rosen is a prolific keynote speaker, delivering talks on leadership, personal development and improvement, and self-awareness in life and business. His work extends beyond consulting and speaking. He has appeared on podcasts and media platforms to discuss his books and the actions needed to live a more fulfilling life. His ability to translate complex psychological theories into actionable personal and business strategies has made him a respected media commentator and a sought-after guest on various shows. Rosen has been featured in prominent publications like The New York Times, Wall Street Journal, Bloomberg, Businessweek, Fortune, Financial Times, and Time. Rosen has taught in executive education programs and served as a longtime faculty member in the Department of Psychiatry and Behavioral Sciences at George Washington University’s School of Medicine. == Bibliography == * Detach: Ditch Your Baggage to Live a More Fulfilling Life * Grounded: How Leaders Stay Rooted in an Uncertain World * Conscious: The Power of Awareness in Business and Life * Just Enough Anxiety: The Hidden Driver of Business Success * The Catalyst: How You Can Become an Extraordinary Growth Leader * Global Literacies: Lessons on Business Leadership and National Cultures * Leading People: Transforming Business from the Inside Out * The Healthy Company: Eight Strategies to Develop People, Productivity, and Profits * Leadership Journeys: Lessons from CEOs Around the World == References == Category:American company founders Category:Living people Category:Year of birth missing (living people)",
 "title": "Bob Rosen"
}