{
 "id": "1171664",
 "text": "Apostle Success Samuel Haruna (born July 24, 1976) is a Nigerian Teacher, Author, Song Writer, and Entrepreneur. He is the president of Apostle Success Ministries (ASM) and the founding shepherd of House of Bliss Intl Churches (HOBIC). ==Education== Success Samuel Haruna was born on July 24, 1976, but hails from Okpotala/Abejukolo in the Omala Local Government area, Kogi, Nigeria. He is graduate from Shalom Bible Institute and WOFBI but holds a Bachelor’s degree in Psychology from the University of Lagos, masters’ degrees (Masters in Social Psychology and Masters of International law and Diplomacy) from Unilag, and Criminology and Security Studies from the National Open University of Nigeria (NOUN), He had his PhD in Social and Personality Psychology from the University of Ibadan. ==Career== Success Samuel Haruna is a philanthropist, novelist; the author of the Christian fiction novel ‘The Phoenix’, a poet with twenty-five published poems, and a songwriter with over five hundred songs. He is an author who has published eighteen books. His sermons via the Web, are a model for young pastors in Nigeria and around the world. In 2021, he was named one of the Nigerian 10 most influential people by NBTlive. In 2022, Time Daily magazine recognized him as one of the sixth best Protestant preachers in the nation and conferred on him the title “The Nation’s Black Preachers.”. Success was cited by Yes magazine as one of the nation’s best Black preachers and he is known for a commitment to expository preaching with a strong theological grounding. In 2024, He was named by Legit among three pastors using music for evangelism. ==Publications== *WINNING THE BATTLES OF LIFE; . . *SPIRITUAL LEADERS; . *THE WOMB MAN; . *BECOMING THE BEST YOU WERE DESIGNED TO BE; . *THE PURPOSE AND POWER OF THANKSGIVING *BROKEN BUT NOT DAMAGED *HOW TO GET TO YOUR PEAK IN LIFE ==Recognition and awards== He is an awardee of JOM Charity Award, He is a licensed peace and conflictologist with the Institute of Global Peace and Conflict Management. He is a certified global peace diplomat and a doctoral fellow of the institute, a member of the Nigerian Psychology Association (NPA), and a member of the National Association of Social Psychologists (NASP). ==Personal life== Apostle Success is married to Funmilola Haruna. ==References== Category:1976 births",
 "title": "Success Samuel Haruna"
}