{
 "id": "1171526",
 "text": "The Saturn ION was a compact sedan and \"quad coupe\" made by Saturn from 2003 to 2007. It was part of the General Motors family of vehicles, using the Delta Platform. It replaced the Saturn S-Series after the year 2002. It was the last car produced in the Spring Hill, Tennessee manufacturing plant Saturn had used since 1990. Like the S-Series, it had a steel unibody underneath plastic body panels, making it relatively dent and rust-resistant, as well as relatively rigid for its class. == History == Starting in 2002, the Saturn ION began production. Initially, it could be bought in a few different options packages, called \"levels\". The base trim could be bought with no AC, CD player, power locks, and other quality-of-life features to bring the starting price just under $12,000. Trim Level 2 could be bought for under $14,000, including the previously mentioned omitted features from the base model. Like the base model, it had no power windows or cruise control, among other features. Level 3 added all previously stated features, but also now with other additions-- like remote entry, for example-- for $15,495. Any level with an automatic transmission optioned in would cost an additional $900. In 2003, Saturn sent a team to the Bonneville, Utah salt flats to break the land speed record for the G/Blown Fuel Altered Class of car using a heavily-modified Saturn ION. Its power output was heavily increased, resulting in a 700 horsepower ION which could hit over 212 MPH. This broke the previous record held by the 2001 Honda Civic by nearly 30 MPH. This Saturn ION would not be sold to the public, instead existing primarily for marketing purposes. In 2004, the Saturn ION Red Line was released to the public, which heavily increased the power and torque output from the rest of the ION's trim levels. Power was increased to-- according to official numbers-- 200 horsepower and 149 pound-feet of torque. Its 0-60 MPH time was reduced to 7.1 seconds, and suspension upgrades broadly gave the Red Line model a more \"sporty\" feel. == References == Category:Saturn automobiles Category:Automobiles Category:Coupes Category:Sedans Category:Sports cars Category:2000s automobiles",
 "title": "Saturn ION"
}