{
 "id": "1171643",
 "text": "Angel Reese (born May 6, 2002) is an American professional basketball player for the Chicago Sky of the Women's National Basketball Association (WNBA). Nicknamed \"Bayou Barbie\" and \"Chi Barbie\", she played college basketball for the Maryland Terrapins and LSU Tigers. Reese attended Saint Frances Academy in Baltimore, Maryland, where she was awarded McDonald's All-American honors in 2020 and was ranked the number two player in her class by ESPN. She joined the Maryland Terrapins as the highest-ranked recruit in program history, but her freshman season in 2020–21 was interrupted by a fractured right foot. She was named a third-team All-American by the Associated Press as a sophomore. In her junior season, Reese transferred to LSU and was a unanimous first-team All- American selection. She led LSU to its first national championship, where she was Most Outstanding Player. Reese set the NCAA single-season record in double-doubles and the SEC single-season record in rebounds. As a senior, she was named SEC Player of the Year and an All-American. Reese was selected by the Chicago Sky with the seventh overall pick in the 2024 WNBA draft. In her rookie season, she was named an WNBA All-Star and set the league single-season record in rebounds. At the international level, she helped the United States win a silver medal at the 2023 FIBA Women's AmeriCup. In 2025, she appeared on the cover of Vogue == Life == Angel Reese was born on May 6, 2002, in Randallstown, Maryland, to Angel and Michael Reese. She learned how to play basketball from her mother at a very young age and grew up playing against her brother, Julian, in their driveway. Reese competed in a recreational league in Baltimore County, where her mother also played. She emerged as one of the best players in the city and had success playing above her age group and on boys' teams. Reese played the point guard position before having two growth spurts by her first year of high school. In addition to basketball, she took part in ballet, gymnastics, swimming and track during her childhood. Reese often attended Washington Mystics games and drew inspiration from Women's National Basketball Association (WNBA) players Candace Parker and Maya Moore, as well as former National Basketball Association (NBA) player and Baltimore native Muggsy Bogues. She was coached by Ron James with Team Takeover, an Amateur Athletic Union (AAU) program based in Washington, D.C. that competes in the Nike Elite Youth Basketball League (EYBL), a national circuit. Her AAU teammates included Madison Scott, Mir McLean and Jakia Brown-Turner, all of whom were given five-star ratings by ESPN at the end of their high school careers. == Other websites == https://www.espn.com/wnba/player/_/id/4433402/angel-reese https://www.basketball-reference.com/wnba/players/r/reesean01w.html https://lsusports.net/sports/wbball/roster/player/angel-reese/ Category:2002 births Category:Living people Category:American basketball players Category:Power forwards Category:Small forwards Category:Sportspeople from Baltimore Category:Women's basketball players",
 "title": "Angel Reese"
}