{
 "id": "1171325",
 "text": "Conan (2004 – May 2017) was an English Mastiff adopted by Argentina's current president Javier Milei as a puppy in 2004, and named after the title character in the 1982 movie Conan the Barbarian. Milei, who never married and has no children, called Conan as his closest friend and confidant. Conan died from spinal cancer in 2017. In 2018, Milei cloned Conan into several other dogs. Milei reportedly speaks to his dogs and seeks political and economic advice from them. Milei's relationship with his dogs have attracted controversy and international attention since Milei's 2023 Argentine presidential election campaign. == Life == Conan was born around 2004, and Milei took him as a puppy that year and treated him as a family member. In 2018, Milei told the Argentine weekly tabloid Perfil that Conan is his \"true and greatest love\" (verdadero y más grande amor) and \"literally a son to me\". He also reportedly gave Conan champagne. In May 2017, Conan died as a result of spinal cancer. Milei then began consulting with a medium. Milei came to believe he met Conan in a previous life as a gladiator and lion who refused to fight because they knew they were destined to work together in a grand project, which he believes was a prophecy of his bid for the Argentian presidency. Of Conan's death, Milei said that he had not really died (he called it \"his physical disappearance\" and continued to call to Conan in the present tense) but gone to sit next to God to protect him, and that it was thanks to this that he had begun to have talks with God himself. == Cloning == In 2018, Milei paid American company PerPETuate, Inc $50,000 to clone Conan. The procedure resulted in six puppies. Milei said that he cloned Conan because he understands cloning as \"a way of approaching eternity\". Milei named one of the puppies Conan, which he does not distinguish from the original Conan. Four more puppies he named after Chicago School economists: Milton (named for Milton Friedman), Murray (named for Murray Rothbard), Robert and Lucas (both named for Robert Lucas Jr). These dogs he considers Conan's sons, and his own grandsons. The sixth dog, who died shortly after the procedure, was named Angelito (\"little angel\"). Milei calls the dogs as his \"four-legged children\". Milei says that he communicates with the dogs through a medium, and that he seeks advice from them. == 2023 presidential campaign == Since Milei's rise in politics, Conan and the other mastiffs cloned after him attracted international attention due to Milei's comments about them. Milei does not distinguish between the current cloned Conan and the original, considering both to be his son, and the other puppies his grandchildren. He has claimed to receive policy and campaign advice from his dogs, and thanked them after his win in the 2023 Argentine primary elections. On his inauguration as Argentina's president, Milei broke with the tradition of using an official presidential baton (Spanish: ) carved by goldsmith , choosing a design featuring Conan and his four clones carved on it. According to sources consulted by the Argentine newspaper Clarín, Milei will bring his four dogs to live with him in the Quinta de Olivos (the official presidential residence), which has caused security concerns among the staff there, as they are known to be \"problematic\". Milei announced that the presidential residence would be renovated to accommodate the four dogs, who are used to living separately. == References == Category:Individual dogs Category:Pets of world leaders Category:2004 births Category:2017 deaths Category:Cloned animals",
 "title": "Conan (Javier Milei's dog)"
}