{
 "id": "1172608",
 "text": "Jésus et Israël (1948) is a book published by French historian Jules Isaac (1877–1963) – three years after the end of WWII and his survival in the Holocaust * * * * * * * * * * * as an Auschwitz prisoner. The book was translated into English in 1971. ==Overview== The book has 600 pages, analyzing the history of antisemitism and Christianity by comparing the New Testament to Catholic and Protestant commentaries, * 2002 Consultation of the National Council of Synagogues and the Bishops Committee for Ecumenical and Interreligious Affairs. Retrieved August 22, 2016. * “A short introduction to Jules Isaac” * Carolyn Wesnousky, \"Under the Very Windows of the Pope”: Confronting Anti-Semitism in Catholic Theology after the Holocaust\" (2012), 59-60. some of which were considered by Isaac as having distorted the relationship between Jesus and the JewsSometimes referred to as Israel in his book. and led to antisemitism among European Christians. ==Content== ===Preface=== In his book's preface, Isaac wrote, ===Conclusion=== At the end of his book, Isaac asked Christians to urgently \"recognize their initial responsibility\" for anti-Judaism's evolution into antisemitism,Jules Isaac, Jesus and Israel, trans. Sally Gran, 2nd ed, (New York: Holt, Rinehart and Winston, Inc., 1971), 400. which ultimately caused the Holocaust, adding that In an Appendix to his book, Isaac included his Eighteen Points, which he deemed necessary for correcting the Christian teachings.Carolyn Wesnousky, \"Under the Very Windows of the Pope”: Confronting Anti-Semitism in Catholic Theology after the Holocaust\" (2012), 63. and Judith Rice, “Jules Isaac & Pope Benedict XVI.” At the Seelisberg Conference of Christians and Jews in 1947, his Eighteen Points became part of the Ten Points of Seelisberg adopted by the Conference. The Conference was followed by Isaac's formation of the L’Amitié Judéo-Chrétienne in 1948 for \"the promotion of Christian-Jewish understanding.\"Review of Jesus and Israel. Retrieved August 29, 2016. ==Reception== Some critics pointed out that antisemitism existed in pre- Christian times,Review of Jesus and Israel. Retrieved August 29, 2016. i.e. not unique to Christianity, when many antisemites were pagans. ==Later work== In response to critics, regardless of their intent, Isaac wrote Génése de l’Anti-Sémitisme in 1956Review of Jesus and Israel. Retrieved August 29, 2016. – translated into English as Has Anti-Semitism Roots in Christianity? in 1961 – in which he agreed that pagan antisemitism existed before Christ but made it clear: ===Teaching of Contempt=== The last book of Isaac in his life was L'Enseignement de Mépris – published in 1962.The English translation The Teaching of Contempt: Christian Roots of Anti-Semitism was published in 1964.“A short introduction to Jules Isaac” In the book's final chapter, Isaac stated two principles:Jules Isaac, The Teaching of Contempt (Holt, Rhinehart and Winston, 1964), 21-24. ====Reviews==== In his review, theologian Ray Summers (1910 – 1992) summarized Isaac's last book as such:Ray Summers, Review of The Teaching of Contempt: The Christian Roots of Anti-Semitism by Jules Isaac in Journal of Church and State Vol. 6, No. 3 (Autumn 1964), 382. ==Related pages== * Jewish deicide * Antisemitism in Europe * Secondary antisemitism ==Footnotes== ==References== Category:Books Category:Politics Category:Catholicism Category:Antisemitism Category:Jewish history",
 "title": "Jésus et Israël"
}