{
 "id": "1172781",
 "text": "Kundiman is a genre of traditional Filipino folk ballads, predominantly with romantic themes. The lyrics of the kundiman are written in classic Tagalog language. The melody is characterized by a smooth, flowing and gentle rhythm with dramatic intervals. ==Pamulinawen== The song \"Pamulinawen\" is perhaps the most well-known song in the the Philippines Ilocos region, that pre-dates the year 1521 of Spanish colonization; possibly the oldest Philippine folk song still known. It is described as the \"Regional Song of the Ilocandia\". ==Lyrical poetry== In 1872, the illustrious Franciscan poet-scholar, Joaquín de Coria wrote Nueva Gramática Tagalog Teorica-Práctica which, besides treating grammar, also enumerates the characteristics of the Tagalog language, and discusses its lyrical poetry. In the book, Coria listed the most important songs of the Tagalog people, which were Kundiman ballads and folk songs. * Diona and Talingdao (songs in the homes and in ordinary work) * Indolanin and Dolayin (songs in the streets) * Soliranin (boat songs) * Haloharin, Oyayi, and Hele-hele (lullabies) * Sambotani (songs for festivals and social reunions) * Tagumpay (songs to commemorate victory in war) * Hiliraw and Balicungcung (sweet songs) * Dopayinin (similar to Tagumpay; more serious and sincere) * Kumintang (love song; also a pantomimic \"dance song\") * Cundiman (love song; used especially in serenading) ==Harana== Kundiman became a traditional mode of harana, or serenade in the Philippines. == Structure == The kundiman emerged as an art song at the end of the 19th century and by the early 20th century, its musical structure was formalised by Filipino classical composers as they sought poetry for their lyrics, blending verse and music in equal parts. The formalized art song structure of the kundiman is characterized by moderate 3/4 time, with the piece beginning in a minor key and ending in the parallel major. ==References== Category:Indigenous Philippine music",
 "title": "Kundiman"
}