{
 "id": "1172197",
 "text": "The National Citizen Party (NCP) () is a political party in Bangladesh, officially established on 28 February 2025. It emerged from the student-led movement \"Students Against Discrimination\" and the National Citizen Committee, both of which played a crucial role in recent political transformations in Bangladesh. == History == === Formation and background === In July 2024, widespread student-led protests against Prime Minister Sheikh Hasina’s government led to her resignation.\"Bangladeshi students who led uprising that ousted ex-premier Sheikh Hasina form new political party\". Associated Press. 28 February 2025. The protests, spearheaded by Students Against Discrimination, were a response to allegations of political corruption, suppression of opposition, and undemocratic governance.\"Bangladesh student protesters form new party in political shake-up\". Financial Times. 28 February 2025. Following the success of the movement, the National Citizen Committee was formed to develop a roadmap for political reform.\"Bangladeshi students launch political party after ousting PM Hasina\". Reuters. 28 February 2025. On 28 February 2025, members of these groups formally launched the National Citizen Party (NCP), aiming to introduce a new political system in Bangladesh.\"The Super 10: The National Citizen Party\". The Daily Star. 1 March 2025. == Ideology and objectives == The National Citizen Party advocates for: * A new democratic constitution to replace the current system. * An end to the two-party dominance of Awami League and BNP. * Governance prioritizing youth leadership and citizen participation. * Transparent policies for economic and social reforms. The party aims to position itself as an alternative to Bangladesh’s traditional political entities, with a focus on democracy and inclusivity. \"Not Pro-India Not Pro-Pakistan Only Pro-Bangladesh\" == Leadership and organization == * Nahid Islam, a 26-year-old former student activist, serves as the chief convener of the party. * Akhtar Hossain serves as the general secretary. * The party is managed by a 151-member national committee, comprising regional organizers and representatives from various sectors. == Future plans == The NCP has announced plans to: * Apply for registration with the Election Commission of Bangladesh. * Contest upcoming national elections. * Advocate for a constitutional assembly to draft a new democratic charter. The party has gained substantial support among Bangladesh’s youth and civil society, who feel alienated from traditional politics. NCP leaders believe their movement can reshape Bangladesh’s governance and establish a more just and accountable political system. ==References == Category:Political parties in Bangladesh",
 "title": "National Citizen Party"
}