{
 "id": "1172513",
 "text": "Budapest’s 6th district (Hungarian: Budapest VI. kerülete) is the second smallest in area among the city’s districts. Its traditional name, also used by the district municipality, is Terézváros. The district is one of Budapest’s busiest and most vibrant areas, where elegant boulevards, historic buildings, and cultural centers meet lively urban life. The district began to develop in the late 18th century and was named after Maria Theresa, the Habsburg ruler. In the 19th century, Pest’s rapid growth made it truly significant, with the construction of boulevards and grand bourgeois apartment buildings. The district’s development is closely tied to the formation of Budapest’s historic center, and it has since played a key role in the city’s cultural life. The district is home to the Hungarian State Opera House, the Liszt Ferenc Academy of Music, and several theaters, such as the Radnóti Theater. Along Andrássy Avenue, you can find luxury shops, embassies, cafés, and restaurants. The area around the Opera House and the Oktogon Square are among the district’s busiest spots. Terézváros is rich in architectural treasures, with Andrássy Avenue and its surroundings standing out. Along Andrássy Avenue, there are 19th-century eclectic and neo-Renaissance palaces that still retain their original elegance today. == History == By the 18th century, there wasn’t enough space within Pest’s city walls, so people began settling in the areas beyond its borders. At first, the land that is now the district was covered with estates, and later with gardens and vineyards. A 1726 decree required the owners to plant trees and maintain the area as a garden, forbidding its use for plowing or growing grains. Since the crops needed protection, the owners started building homes. On August 4, 1751, Maria Theresa and Emperor Francis of Lorraine visited Pest and Buda. In memory of this, the area was named Terézváros (Theresa Town) in 1777. That same year, the Roman Catholic parish in the district began keeping its registry records. In the first half of the 19th century, the number of houses nearly doubled. This happened because new areas were used and existing ones were built up more densely. By this time, the western part of the district had many multi-story buildings, and new streets were formed as the land was divided into smaller plots and developed. This increasingly urban area, home to Jewish craftsmen and small traders, was separated by a wide strip of estates from a poorer, more rural area. When Pest, Óbuda, and Buda were united in 1873 to form Budapest, Terézváros, with its 73,760 residents, was the city’s most populous district. In 1882, Budapest’s 7th district separated from Terézváros and became known as Erzsébetváros. == Politics == The current mayor of the district is Tamás Soproni (Momentum). List of Mayors Name Party Date Tibor Seiler SZDSZ 1990–1994 György Borsányi MSZP-SZDSZ 1994–1998 György Farkas Fidesz 1998–2002 István Verók MSZP-SZDSZ 2002–2010 Zsófia Hassay Fidesz-KDNP 2010–2019 Tamás Soproni Momentum 2019– == Population == The population of the 6th district on October 1, 2022, was 35,441 people, which was 2.1% of Budapest’s total population. Since the 2011 census, the district’s population has decreased by 2,878 people. In 2022, the average number of residents per square kilometer was 14,891. The age structure of the district's population is quite unfavorable. In 2022, 8.5% of the residents were under 14 years old, while 16.6% were over 65. The life expectancy at birth in 2022 was 75.7 years for men and 79.9 years for women. The largest group by highest completed education is people with university degrees, numbering 15,285, followed by those with high school diplomas, totaling 10,727. In 2022, 91.8% of the population over 6 years old had internet access. According to the census, 49.1% of the district’s population, about 17,383 people, identified as belonging to a minority group. Among the minorities, the most common nationalities were Ukrainian, German, and Chinese. From the last third of the 19th century until 1910, the population of the district grew rapidly. Due to the economic stagnation following the 1920s, the district’s population stopped growing and began to decline. As a result of World War II, the district lost 14.3% of its population. After the war, until 1970, the population of the district remained stable. The highest number of residents, 101,519, lived in the district in 1910. From the 1970s until today, the population of the district has been decreasing, and now fewer people live there than in 1870. === Ethnic composition === Major ethnic groups Nationality Population (2022) 1423 852 647 500 374 According to the 2022 census data, the population of the district was 35,441 people, of whom 22,388 identified as Hungarian. About 49.1% of the district’s population claimed to belong to a minority group. The number of people with Hungarian citizenship who belong to a nationality was 8,593, while those without Hungarian citizenship totaled 8,790. The three largest minority groups in the district were Ukrainian (1,423 people), German (852 people), and Chinese (647 people). Over 11 years, the Ukrainian and Chinese populations grew the most significantly. Based on the census data, Terézváros had the highest proportion (24.8%) of foreign-born immigrants in Budapest. ==References== Category:Districts of Budapest",
 "title": "6th district of Budapest"
}