{
 "id": "1172574",
 "text": "The Jinnah family is an important political family in South Asia. Muhammad Ali Jinnah was Pakistan's founding father, and his sister Fatima Jinnah was a key figure in the Pakistan Movement. The family's legacy continues in Pakistani politics today. == Family History == The Jinnah family originated in the Gujarati city of Paneli in British India. The family's patriarch, Jinnahbhai Poonja, was a wealthy merchant. His wife, Mithibai, came from a well- established Ismaili Khoja family. The couple had seven children, including Muhammad Ali Jinnah (born Mahomedali Jinnahbhai). He later became a central figure in the Indian independence movement and the demand for a separate Muslim state. == Religious Background == The family initially belonged to the Ismaili Shi'a branch of Islam. Muhammad Ali Jinnah later converted to the Twelver Shia tradition, though he did not remained secular in public. Historians still discuss this shift in the family's religion. It reflected broader religious and cultural dynamics in pre-partition India. == Notable Members == === Muhammad Ali Jinnah (1876–1948) === The family's eldest son, Muhammad Ali Jinnah, trained as a barrister in London. He became a leading advocate for Muslim rights in India, and founded Pakistan in 1947. He married Emibai Jinnah (who died young) and Rattanbai Petit (a Parsi who converted to Islam, adopting the name Maryam). His daughter with Rattanbai, Dina Wadia (born 1919), married a Parsi businessman named Neville Wadia. He did not convert to Islam, and this caused conflict in the family. === Fatima Jinnah (1893–1967) === Fatima, Muhammad Ali Jinnah's closest sibling, was a dentist and an important political figure. She was known as the Mother of the Nation in Pakistan. She co-founded the All India Muslim Women Students Federation and later challenged President Ayub Khan in the 1965 elections. Her death in 1967, officially believed to be from heart failure, sparked speculation due to her political importance. === Dina Wadia (1919–2017) === Dina, Jinnah's only child, lives in India with her husband Neville Wadia. Her marriage to a Parsi caused conflict in her relationship with her father. Still, he legally acknowledged Neville Wadia his will. Dina's son, Nusli Wadia, became a notable Indian industrialist. == Legacy == The Jinnah family's influence persists in Pakistani politics. Key elements of their legacy include: * Muhammad Ali Jinnah's leadership and Fatima's advocacy, which shaped Pakistan's early governance and women's rights movements * The Quaid-e-Azam Residency in Ziarat and Jinnah Mausoleum in Karachi, which are national monuments and cultural symbols * The Jinnah House in Mumbai, which created conflict between India and Pakistan; this conflict reflected ongoing tensions between the two countries == Genealogy == A simplified family tree includes: \\- Jinnahbhai Poonja (d. 1901) and Mithibai Jinnah └── Muhammad Ali Jinnah (Emibai Jinnah, later Rattanbai Petit) └── Dina Wadia (m. Neville Wadia) └── Nusli Wadia (m. Maureen Wadia) └── Ness Wadia and Jeh Wadia └── Fatima Jinnah(never married) └── Siblings: Ahmad Ali, Bunde Ali, Rahmat Ali, Maryam, Shireen == Residences == The Jinnah House in Mumbai is a colonial-era building where many Indian and Pakistani diplomats have held discussions. The Fatima Jinnah House in Karachi is now a museum dedicated to her life and work. == Controversies == Fatima Jinnah's 1965 presidential bid and subsequent death under disputed circumstances caused controversy. So did legal battles over Jinnah's estate, particularly involving Dina Wadia and the Government of Pakistan. ==References== Category:Politics of Pakistan Category:Political history of Pakistan",
 "title": "Jinnah family"
}