{
 "id": "1172452",
 "text": "The Kavanjina Ambush was an attack that took place on 9 August 1992 near the village of Kruševo, Bosnia and Herzegovina, during the early stages of the Croat-Bosniak War. The ambush resulted in the killing of Blaž Kraljević, the commander of the Croatian Defence Forces (HOS) in Bosnia and Herzegovina, along with eight of his soldiers. The attack was carried out by the Croatian Defence Council (HVO) Military Police. == Background == During the Bosnian War, the Croatian Defence Forces (HOS), led by Blaž Kraljević, advocated for cooperation between Croats and Bosniaks in defending Bosnia and Herzegovina. However, tensions arose between HOS and the Croatian Defence Council (HVO), which supported the establishment of the Croatian Republic of Herzeg-Bosnia. On 2 August 1992, Naletilić ordered his unit to assassinate Blaž Kraljević, general of the Croatian Defence Forces and general of the Army of Bosnia and Herzegovina (ARBiH), along with eight of Kraljević's staff. Naletilić rewarded twenty of the men in the unit with 5,000 Deutschmarks each. Tuta je naredio: Poljubite Kraljevića, hsp1861.hr; accessed 14 April 2015. Kraljević had opposed attempts by Croatian president Franjo Tuđman and his Croatian Democratic Union (HDZ) party, as well as Mate Boban and Radovan Karadžić to divide Bosnia and Herzegovina. == The Ambush == On 9 August 1992, Kraljević and eight of his staff ambushed and assassinated by HVO soldiers under the command of Mladen Naletilić, who supported a split between Croats and Bosniaks, after Kraljević's HOS attacked the VRS near Trebinje. According to Manolić the order to kill Kraljević was given by Šušak and approved by Tuđman. Božidar Vučurević, the war-time mayor of Trebinje, stated he safeguarded records showing it was a \"task\" to be carried out by SDS and HDZ figures. The HOS's advance into eastern Herzegovina and occupation of Trebinje angered Boban who had affirmed to Karadžić that Croat forces were uninterested in the region. The Kruševo General Staff of HVO claimed that two vehicles with HOS members refused to stop at a police checkpoint and that HOS members first opened fire, killing HVO lieutenant Živko Bodulić. Kraljević's body and those of the eight other HOS soldiers were rushed to Split for autopsies before an investigation began and the investigating judge from Mostar only came to the scene a day later. == Aftermath == The assassination of Blaž Kraljević marked a turning point in the conflict. Following his death, HOS forces in Herzeg- Bosnia were disbanded, and many HOS fighters either joined the Bosnian Army or were integrated into HVO forces. The incident intensified tensions between Croats and Bosniaks and contributed to the eventual escalation of the Croat- Bosniak War in 1993. The circumstances surrounding the ambush remain controversial, with allegations that it was orchestrated to eliminate Kraljević due to his opposition to Herzeg-Bosnia. ==References== Category:20th-century conflicts Category:Wars involving Europe Category:History of Bosnia and Herzegovina",
 "title": "Kavanjina Ambush"
}