{
 "id": "1172543",
 "text": "Budapest’s 15th district (Hungarian: Budapest XV. kerülete) is one of the city’s larger districts in area. The district consists of three parts, Újpalota, the Soviet-style housing estate, Rákospalota and Pestújhely, which were two towns in the past. The district is a quieter, residential area compared to the busy center of Budapest, but it still has its own lively community and history. The 15th district is home to places like the Liva-mill and the Rákospalota Synagogue, which show its local character. There are also parks, such as the Kőrakás Park, where people can relax. The district has markets, small shops, and community centers that keep it active. == History == The oldest architectural remains are church ruins from around the 1200s, which form the foundation of the Roman Catholic heritage church built in 1735. The first known landowner of the area was also the first elected judge of Buda, Judge Loránd, who was one of the most respected citizens of 14th-century Hungary. Thanks to him, the area grew larger, as he gained more and more land through donations, lawsuits, and purchases. Rákospalota The was abandoned and revived several times, for example, due to the Turkish conquest and the Rákóczi War of Independence. The most likely theory is that first a village called Nyír, then one called Palota, existed in the same place, roughly on the hill next to the Szilas stream. The settlement and its lands changed owners many times, with the Károlyi Family being the last to own them in the 19th century. The local residents bought their freedom from the count’s family in 1861, and by 1923, the area turned from a village into a town, already known as Rákospalota. PestújhelyBuza Péter: Pestújhely emlékkönyve. (hely nélkül): Csokonai Művelődési Ház. 1997. 11. o. Pestújhely began in the late 1890s within Rákospalota, on land once used for farming and military training. In 1896, locals bought it and by the late 1890s, the first houses appeared. Planned as a summer retreat, it lacked roads, water, and services, causing tensions with Rákospalota over development. In 1909, residents voted for independence. Every inch was residential, with no farmland, and most people were workers or clerks. Along with several other settlements in the capital's vicinity, Rákospalota and Pestújhely were annexed to Budapest on January 1, 1950. Újpalota Újpalota was built starting in 1969 on empty land near the Szilas stream, where there used to be wheat fields and an old cemetery. The estate was made to mark 50 years since the Socialist Federative Soviet Republic of Hungary. It has 104 panel buildings with 5, 7, 11, 13, or 15 floors, holding over 15,000 apartments. Construction finished in 1978 using Soviet-Hungarian methods. Today, Újpalota is still busy, with shops like Pólus Center nearby, and it got its first church in 2008. It’s a mix of old panel blocks and modern life, connected to the city by buses and trams. == Population == On October 1, 2022, the population of the 15th district was 77,091 people, making up 4.6% of Budapest’s total population. Since the 2011 census, the district’s population dropped by 2,554 people. In 2022, the average number of people per square kilometer was 2,862. The age structure of the district is quite unfavorable. That year, 12% of the residents were under 14 years old, while 22% were over 65. In 2021, life expectancy at birth was 71.9 years for men and 78.1 years for women. The largest group by highest completed education is people with high school diplomas, numbering 27,378, followed by those with university degrees, totaling 17,315. In 2022, 87.3% of people over 6 years old had internet access. According to the census, 12% of the district’s population, about 9,217 people, identified as belonging to a minority. == Politics == The current mayor of the district is Angéla cserdiné Németh (DK). List of mayors Name Party Date Tamás Czibik SZDSZ 1990–1996 László Hajdu MSZP 1996–2010 Tamás László Fidesz 2010–2014 László Hajdu DK 2014–2018 Angéla Cserdiné Németh DK 2018- ==References== Category:Districts of Budapest",
 "title": "15th district of Budapest"
}