{
 "id": "1172307",
 "text": "Astrotalk is an Indian online astrology platform that enables users to consult with astrologers through chat and voice calls. Founded in 2017 by Puneet Gupta and Anmol Jain, the platform is headquartered in Noida, Uttar Pradesh. Astrotalk provides astrology-related services including horoscope readings, numerology, and Vedic astrology, catering to both domestic and international users. == History == === Early years === Astrotalk was founded in 2017 by Puneet Gupta after pivoting from his previous IT services company, CodeYeti. The idea emerged following a personal experience with an astrologer, which inspired Gupta to create a digital platform to connect users with verified astrologers. Initially, the platform began with 10 astrologers. By 2023, Astrotalk had expanded its network to include over 13,000 astrologers and served clients internationally. === Expansion === The company has expanded its presence into markets such as the United States, Canada, the UK, the Middle East, and Southeast Asia. It offers services in multiple languages and is working on integrating AI-driven tools for astrology consultations. === Leadership === Anmol Jain joined Astrotalk in 2021 as Chief Business Officer and played a significant role in scaling operations. In 2023, he was elevated to the position of co-founder in recognition of his contributions. == Funding == Astrotalk operated independently for several years before securing its first round of funding in 2021. In August 2021, it raised $811,000 in seed funding via QED Innovation Labs. In February 2024, it raised $20 million in a Series A round led by Left Lane Capital, followed by $9.5 million in April 2024 from Elev8 Venture Partners. == Services == Astrotalk offers a variety of astrology services, including: * Horoscope readings * Birth chart analysis * Numerology consultations * Tarot readings * Palmistry * Kundali matching * Vedic astrology consultations Astrologers listed on the platform go through a vetting process before offering consultations. == Revenue and Growth == Astrotalk's financial statements report a 2.3x rise in operating revenue to ₹651.12 crore in FY24 from ₹283.32 crore in FY23. Total expenses also grew, reaching ₹531 crore in FY24. Despite this, the company's profit increased substantially to ₹99.99 crore in FY24, an 11.8x year-over-year jump. Revenue from international markets increased more than fourfold during this period. == Key people == * Puneet Gupta – founder and CEO * Anmol Jain – Co-founder and Chief Business Officer * Siddharth Prakash Singh – Chief Technology Officer == References == == Other websites == * Official Website * Astrotalk on LinkedIn Category:Companies of India",
 "title": "Astrotalk"
}