{
 "id": "1172069",
 "text": "Arthur is a steel roller coaster at Europa-Park in Germany. It was created through a partnership between the Mack family, who run the park, and Luc Besson.. The ride was designed by architect Frédéric Pastuszak.Europa-Park builds the Kingdom of the Minimoys, article from Le Moniteur July 29, 2013 The attraction is based on the theme of the movies Arthur and the Minimoys. It officially opened at the end of . == History == Europa-Park announced the project for a new area themed around Arthur and the Minimoys in mid-November 2012.. A preview center was set up at Europa-Park to show the first designs and models of the attraction. Originally supposed to open on , the opening was delayed to spring 2014, then to late spring 2014, and finally to the early days of summer 2014.. On Wednesday , an accident occurred during tests: a train hit two workers, injuring them, with one seriously. Unfortunately, this worker died a few days later.. After several weeks of delay, public tests began from . Finally, after 4 months of delays, the attraction officially opened at the end of . The attraction was officially inaugurated in the presence of Luc Besson and Roland Mack on .. == Description == This attraction is presented by the park as a world premiere, designed and built by Mack Rides, featuring animatronics and decor from Life Formations, Heimotion. and P&P; Projects.. It is the first example of the Powered Inverted Coaster model. Visitors ride in electric-powered cars that are suspended from the tracks, which spin around; this ride is part of the suspended roller coasters, E-Powered roller coasters, and spinning roller coasters types. The track, which is 550 meters long, is mostly indoors but also has an outdoor section. The budget of 25 million euros represents the largest investment by the park for an attraction since it opened.. == Theme == The theme of the attraction is based on the movies Arthur and the Minimoys, made by French director Luc Besson. It is the first time Europa-Park has signed an agreement with an entertainment brand. It is a treasure hunt through the Kingdom of the Seven Lands with many special effects. The ride features controlled accelerations, and the suspended cars give riders the feeling of flying. The attraction is located in a new covered area themed around the Arthur and the Minimoys movie trilogy near the Enchanted Forest. This area also includes a restaurant and children’s attractions (a family drop tower from Zierer, a Jump Around ride from Zamperla, and slides from Atlantic). == Restrictions == Europa-Park has set height and age limits for Arthur: riders must be at least tall and old. ==References== == External link == *",
 "title": "Arthur (Europa-Park)"
}