{
 "id": "1172554",
 "text": "Pertevniyal Sultan (, 1812 – 5 February 1883), was a consort of the Ottoman Sultan Mahmud II and the mother of their son Sultan Abdulaziz, and was the Valide Sultan of the Ottoman Empire. == Early life == There is some dispute as to what lineage Pertevniyal Sultan was born into. She was probably of Circassian descent, but it is also said that she was of Romanian or Kurdish descent. Her birth name was Besime. She was a close friend of Hosiyar Kadin, the wife of Ibrahim Pasha of Egypt. Hosiyar Kadin was Khedive of Egypt and Sudan from 1863 to 1879, and the mother of Ismail Pasha. Pertevniyal became the wife of the Ottoman Sultan Mahmud II, and before that she worked in a hammam in Istanbul. She was later given the title \"Second Iqbal \". On 8 February 1830, she gave birth to Şehzade Abdul Aziz. In 1833, she may have given birth to her second son, Şehzade Nizameddin, but according to other sources, Nizameddin's mother was Tiriyal Hanim. Because Tiriyal Hanım was the mother of the Sultan's son, she was given the title of \"Fifth Iqbal\". == Valide Sultan == === Abdulaziz's accession === After the illness preceding the death of Sultan Abdulmecid I in 1861, rumors spread that there were enemies in the palace who wanted Murad to succeed Abdulaziz. These accusations are believed to have been unfounded. Nevertheless, they blamed Abdulaziz, and especially his mother, Pertevniyal. On the night that Abdulmecid died, the Grand Vizier Kapudan Pasha and the commander-in-chief of the army, took Abdulmecid's body in a coffin to the Dolmabahçe Palace. Pertevniyal thought they were taking Abdulmecid prisoner. They waited in the Sultan's palace until the new Sultan's enthronement ceremony was ready, and then took Abdulaziz to the Topkapi Palace, the palace of his ancestors. For the cabinet meeting, some people were not seen because their homes were across the Bosphorus. Pertevniyal stayed by Abdulaziz's side to keep himself calm. === Influence over Abdulaziz === Pertevniyal always tried to keep her son under her control. When Abdul Aziz traveled to Europe, Pertevniyal was always worried about her son. On his way home, she went to Ruse, Bulgaria to bring him back. At that time, Midhat was the governor of Bulgaria for a month to get acquainted with the Balkan countries. But the cunning and short-sighted woman named Pertevniyal asked Midhat to leave the governorship and return to her country. Although Abdul Aziz was the Sultan of Ottoman Empire, he always obeyed his mother's orders. Pertevniyal contributed to the growth of her son's rule by not playing a role in the affairs of the state. In particular, Pertevniyal's alliance with Mahmud Nedim Pasha was foolish. Because Mahmud Nedim was a flattering grand vizier, whose recklessness and incompetence created further financial chaos. There was so much opposition to Mahmud Nedim that he was finally forced to resign from power in 1876 and was replaced by Midhat Pasha, who did his best to boost the economy of the empire. A budget of 100,000 Turkish liras was not accounted for, but Midhat was able to reveal that it had been embezzled by Mahmud Nedim. Mahmud Nedim secretly revealed that the money had not been spent but had gone to the palace, probably to the Valide Sultan. Mahmud Nedim was exiled from the capital for a time. But the Pertevniyal Sultan was soon able to bring him back. Midhat's efforts at financial reform failed and he was later succeeded by Mahmud Nedim. Finally, when word of Abdul Aziz's abdication spread, Pertevniyal sent a message to Midhat through a harem agha, requesting him to prepare a document on how his son could secure his throne. Midhat carefully prepared a document that Pertevniyal supported publishing, but neither Pertevniyal nor anyone else had the opportunity to publish the document at this point, as Sultan Abdul Aziz was very angry and ignored the proposal. === Diplomacy and engagements === Although Pertevniyal did not play a role in political affairs, he played an important role in some political matters. In February 1863, he arranged for Ismail to meet Abdul Aziz privately at his palace. In the summer of 1864, Ismail's mother, Hosiyar Kadin, traveled to Istanbul to help Pertevniyal's son. She brought her grandson, Tevfik Pasha, a large sum of money, and female diplomacy to help solve the problems of Abdul Aziz's political affairs. In the spring of 1866, they played the biggest political role, where Pertevniyal played a role in the good deeds of Pertevniyal. In September 1867, Hosiyar hosted a dinner in Pertevniyal's honor at his own palace on the banks of the Bosphorus. Pertevniyal returned the hospitality by inviting Hosiyar to the Dolmabahçe Palace. In 1868, Empress Eugénie of France visited the Ottoman Empire. The Sultan took her to his mother at the Dolmabahçe Palace, but it is reported that Parthenon was outraged by the presence of a foreign woman in his harem and greeted her by slapping the empress in the face. This was seen as a rare occurrence internationally. However, the empress's visit greatly increased the popularity of harem women's clothing.Oleg Grabar: Muqarnas: An Annual on Islamic Art and Architecture In 1869, Parthenon met Princess Alexandra of Denmark, who later visited Istanbul with her husband, Prince Edward of Wales (the future Edward VII). == Charities == Pertevniyal Sultan founded Pertevniyal High School and Pertevniyal Valide Sultan Mosque in 1872. During the time when it was part of the Hejaz Empire, Pertevniyal tried to improve the health conditions of the people there. Pertevniyal built a hospital in the Harem-e Şerif and young Turkish doctors came from Istanbul to serve the people. Pertevniyal Sultan was a great philanthropist and she had the opportunity to do whatever she wanted due to the permission given by her son. She created an income system on the land known as Fasil Field. She built a fountain in front of the Katib Mosque in October 1862 and then moved the mosque from the courtyard to make it the entrance to the courtyard because it narrowed the road. She also built three fountains, one in the village of Suboyu (Bige) and two on the Karakoy Road in Sebinkarahisar. In 1864, she built a ship in Tersan for her own income. This ship was modeled after the first Ottoman warship. == Last years == When Murad V ascended the throne after the overthrow of Abdulaziz, Sultan Murad appointed his main ally Damat Nuri Pasha as Lord Pasha, following the advice of his mother Shevkefza Kadin, then Shevkefza and Damat confiscated all of Pertevniyal's hidden gold coins and jewelry in the harem of the Dolmabahce Palace. Pertevniyal's sealed apartments were opened and eight gold chests and four debentures were removed. It took eight porters to lift the chests filled with gold. It was said that these eight chests contained 5,120 okkas of gold. Midhat Pasha and other ministers assumed that the former king's mother was responsible for Hasan Bey's rebellion. So they transferred Pertevniyal to the Topkapi Palace and cut off all contact with the outside world. Pertevniyal spent three whole months in his room in Topkapi weeping and lamenting. Several times he sent messages to Şevkefza, hoping that he would help end his suffering, but Şevkefza was afraid of any trouble. Sultan Abdul Hamid II had loved Pertevniyal since childhood. He loved him more than his foster mother, Perestu Kadın, and so as soon as he became sultan, he remembered Pertevniyal's days of suffering in Topkapi Palace. He sent people to transfer Pertevniyal and his companions to a villa in Ortaköy, which pleased him and protested the injustice done to him. Sultan Abdul Hamid II visited Pertevniyal every day until the day she died. Pertevniyal was devastated after the death of his son. Her only joy and distraction was spending time training the small and beautiful Shiites, gathering them to himself and finding solace in their work and their sweet manners. Another habit of Pertovniyal Sultan was between the evening and night prayers. He would prostrate himself in prayer, weeping and shouting, \"I forgive everyone, only I want justice for the blood of my son!\" Then in his room he would recite the Quran and then place his hands on the children's heads and pray, and finally say Amen. == Death == Pertevniyal Sultan died on 5 February 1883 at the age of seventy in Ortakoy Palace in Istanbul and was buried in the Pertevniyal Valide Sultan Mosque in Aksaray, Istanbul. == Related pages == * Mahmud II * Abdülaziz * Ottoman Empire * Ottoman dynasty * Topkapi palace * Dolmabahçe Palace == References == == Sources == * * * * * Category:Turkish Muslims Category:Ottoman people Category:Consorts of Ottoman sultans Category:1812 births Category:1883 deaths Category:Mothers of Ottoman sultans",
 "title": "Pertevniyal Sultan"
}