{
 "id": "1172504",
 "text": "Yenningtha (), also known as Yeningtha (), refers to the spring season in Meitei language. It is one of the seasons in the Meitei calendar of Ancient Kangleipak (early Manipur). It plays an important role in different elements of the Meitei culture, including but not limited to Meitei festivals, Meitei folklore, Meitei folktales, Meitei history, Meitei literature, Meitei mythology, Meitei proverbs, traditional Meitei religion (Sanamahism), etc.The 10 Days - A Revelation: The Escape From Death. N.p.: N.P., 2016. Yenningtha is viewed as \"the season of new sprouts; it is symbolical of new beginnings, new hopes and dreams\". A lot of people talk about yenningtha, as the season of new beginnings. It's seen as a sign of better times ahead and is linked to positive energy (including effervescent youthful spirit). == Overview == According to \"Manipuri Language Studies,\" Yenningtha is explained as follows: == In Meitei festivals == Yaoshang, a popular Meitei festival is annually celebrated during the spring season.KANGLA LANPUNG VOLUME XII ISSUE I: Summer 2018. N.p.: RK Sanatomba Memorial Trust, Imphal, Manipur, 2018. p. 81 The precincts of a temple (not different from the annual agricultural cycle) are related to the several Rasa dance forms of the classical Manipuri dance. According to Meitei traditions, the spring season gives rise to the Basanta rasa and the autumnal to the Maha rasa.Vatsyayan, Kapila. A Study of Some Traditions of Performing Arts in Eastern India: Margi and Desi Polarities : Banikanta Kakati Memorial Lectures, 1976. India: Department of Publication, University of Gauhati, 1981. p. 60 A seven-day Manipuri Solo Dance festival “Okchari Yeningtha” was organized by the Jawaharlal Nehru Manipur Dance Academy (JNMDA), Imphal in 2021. == In Meitei literature == === The Kumdamsei === The Meitei language poem Kumdamsei has a musical rhythm. It talks about the spring season representing a new start. It shows that Earth is full of life again. The sun brings a new day and spreads light over the villages. This gives hope and inspires people to connect emotionally with the ancient Meitei way of life. Seasonal changes show the natural order of the universe. The changing seasons are like the stages of a person’s life: from birth to adulthood, old age, and death. This reminds people that death is a natural part of life. The seasons also help people learn about celestial events. This helps make a calendar for farmers. The calendar tells them when to plant their crops. Without it, farming would be hard to manage. === The Leiron === The Meitei language text Leiron talks about the spring season as follows: === Others === Yenningtha Nangna Khongdoi Hullakpasida is a Meitei language poetry book authored by Borkanya. She was honoured with the 3rd State Award for Literature, 2010 for the book. Yeningtha, published by Young Writers' Forum, Imphal, was successful in creating taste for Meitei language magazines in the intelligentsia.Kirti Singh, Moirangthem. Religion and Culture of Manipur. India: Manas Publications, 1988. p. 162The Beautiful India - Manipur. India: Ess Ess Publications, 2006. p. 219 == References == * Category:Meitei literature Category:Meitei festivals Category:Seasons",
 "title": "Yenning-tha"
}