{
 "id": "1172169",
 "text": "Josephine Siao Fong-fong (; born March 13, 1947) is a Hong Kong film star who became popular as a child actress and continued her success as a mature actress, winning numerous awards including Best Actress at the 45th Berlin International Film Festival (for Summer Snow). Since retiring from show business (partly due to her increasing deafness), she has become a writer and a psychologist, known for her work against child abuse. == Early life == Born in Shanghai, Ciao emigrated to Hong Kong at the age of 2, and began her acting career at the age of 6.https://www.avenueofstars.com.hk/en/ms-josephine-siao- fong-fong/ == Film career == In 1955, she appeared alongside Bruce Lee in An Orphan's Tragedy. Her performance in The Orphan Girl (1956) garnered the Best Child Actor Award at the 2nd Southeast Asian Film Festival.https://www.avenueofstars.com.hk/en/ms-josephine-siao-fong-fong/ Ciao subsequently became one of the biggest teen idols in Hong Kong during the late 1960s, along with frequent co-star Connie Chan Po-chu. The two were often cast in wuxia films and contemporary dramas. Colourful Youth (1966), in which they both appeared, is credited with popularising Cantonese film musicals. Siao briefly retired from acting in 1968 to attend Seton Hall University in the US. After graduating with a bachelor's degree in communications in 1970, she returned to Hong Kong, where she went on to become one of the city's most prolific actresses. In 1982, she starred in Plain Jane to the Rescue, which became one of her most famous roles.https://www.scmp.com/lifestyle/entertainment/article/3283491/who- josephine-siao-how-popular-hong-kong-actress-went-child-star-activist Siao won the Best Actress Award at the Hong Kong Film Awards twice, for The Wrong Couples (1987) and Summer Snow (1995). Her performance in the latter also won her Best Actress at both the Berlinale and the Golden Horse Awards, while Hu- Du-Men (1996) saw her named Best Actress at the Asia-Pacific Film Festival and the Golden Horse Awards.https://www.avenueofstars.com.hk/en/ms-josephine-siao- fong-fong/ Siao appeared in the critically acclaimed martial arts film Fong Sai-yuk (1993), where she played Miu Tsui-fa, the kung fu–fighting mother of the titular character, portrayed by Jet Li. She reprised her role in Fong Sai- yuk II (1993). Her other memorable martial arts films include Fist of Fury 1991 (1991) and Fist of Fury 1991 II (1992). In 2009, Siao received the Lifetime Achievement Award at the Hong Kong Film Awards.https://www.avenueofstars.com.hk/en/ms-josephine-siao-fong-fong/ == Outside acting == In 1998, Siao founded the End Child Sexual Abuse Foundation to protect young people under the age of 18 from sexual abuse. https://www.tatlerasia.com/profile/end-child-sexual-abuse-foundation https://www.ecsaf.org.hk/en-hk/about-us/ == References == Category:Hong Kong actors Category:1947 births Category:Living people",
 "title": "Josephine Siao"
}