{
 "id": "1172408",
 "text": "A Minecraft Movie is an American-Canadian Adventure Comedy movie, which is based on the hit video game Minecraft, currently owned by Microsoft and Mojang Studios. It was made by Warner Bros in collaboration with Portfolio Entertainment and Mojang with Jared Hess as the director and stars Jason Momoa, Jack Black, Emma Myers, Danielle Brooks, Sebastian Hansen, Rachel House, and Jennifer Coolidge. It released on April 4, 2025 in North America. It has gained over $826 million dollars in the worldwide box office with major fan acclaim, , such as a popular TikTok trend featuring the scene of a baby zombie riding a chicken. This scene has gained popularity due to Steve (Jack Black) exclaiming \"Chicken Jockey!\" at the sight of the unusual creature. This trend has led to massive overhauls of Gen Z into theaters, all to exclaim and react loudly when this scene comes up, even throwing food or bringing live chickens into the theater. All of these trends based on the movie have caused it to skyrocket in internet popularity. A sequel is in development. ==Overview== It was directed by Jared Hess and stars Jason Momoa, Jack Black, Emma Myers, Danielle Brooks, Sebastian Hansen, Rachel House, and Jennifer Coolidge. It is based on the 2009 video game Minecraft. ==Plot== In the movie, four people get transported to a world filled with cubic objects called the Overworld. They meet a crafter named Steve and go on an adventure to try and get back to their world, all while trying to stop evil creatures called Piglins from invading the Overworld. Principal photography for the movie started in Auckland, New Zealand in January 2024 and ended in April. == Cast == * Jason Momoa as Garrett \"The Garbage Man\" Garrison * Jack Black as Steve * Emma Myers as Natalie * Danielle Brooks as Dawn * Sebastian Hansen as Henry * Rachel House as Malgosha * Jennifer Coolidge as VP Marlene ==Sequel== On April 11, 2025, it was reported that a sequel is in early development. == In popular culture == Prior to the film's release, multiple teasers were released and circulated. These teasers included multiple notable phrases, which have cemented themselves into memes and popular culture especially on platforms such as TikTok and Instagram. Furthermore, Jack Black's Steve's Lava Chicken has garnered much attention. Several key phrases have become synonymous with the film, including but not limited to: * Chicken Jockey! * Water bucket... Release! * Big ol' red ones. * I am steve. * Coming in hot! * Flint 'n' steel. * The Nether. * This... is a crafting table. ==Other websites== * ==References== Category:Minecraft Category:2025 movies Category:IMAX movies Category:Warner Bros. movies Category:2020s fantasy movies Category:2020s comedy movies Category:Fantasy comedy movies Category:Swedish fantasy movies Category:Swedish comedy movies Category:2020s adventure movies Category:Adventure comedy movies Category:Swedish adventure movies Category:American adventure movies Category:Movies based on video games Category:2020s English-language movies Category:American fantasy-comedy movies",
 "title": "A Minecraft Movie"
}