{
 "id": "1172981",
 "text": "Weaponization of antisemitism is the claim that someone accuses others of antisemitism IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. * * * * * * for personal or political goals. ==Overview== The claim is controversial as some antisemites have adopted it as an ad hominem attack on Jews who raise awareness about antisemitism ‒ by assuming that Jews are doing it in bad faith (also known as appeal to motive). * * * * Accusations of \"Jews weaponizing antisemitism\" have been a common theme of Holocaust deniers' propaganda since the end of the Holocaust * * * ‒ a genocide led by Nazi Germany that killed at least 6,000,000 Jews in Axis- occupied territories between 1933 and 1945. * * * * * * * * * * * * The accusation of \"weaponizing antisemitism\" does not always appear in exact wording, but may present itself as accusing Jews of \"weaponizing\" the Holocaust, or any other antisemitic atrocities in history, such as the Spanish Inquisition * * * * * * * * * * and pogroms in Eastern Europe. * * * * * ==Examples== ===Pierre Guillaume=== Pierre Guillaume (1940 – 2023), a French ultra-left anarcho-Marxist activist, is said to have repeatedly accused Jews of \"weaponizing\" antisemitism and the Holocaust in his publications. * * * Guillaume based partly his accusation on his perception that the Holocaust was \"no different\" from any other racially motivated massacres in history, going as far as calling the Holocaust \"a distraction from class struggle\" that \"played into the hands of Zionism and Stalinism\". ====Influence==== Despite being left-wing, Guillaume's views were adopted by the French far right, many of whom believed that the Holocaust was \"no different\" from the alleged Judean massacres of the Canaanites or the Native American genocide. They believed that \"Jewish claims\" of the Holocaust were \"excuses for extorting compensations from European countries\". ===Institute for Historical Review=== The Institute for Historical Review (IHR), a self-declared academic group that has been promoting Holocaust denial since 1978, is noted for accusing Jews of \"weaponizing antisemitism\" in most of its publications. It is also noted for popularizing the comparison of the Holocaust to Allied bombings of Nazi Germany and Imperial Japan among antisemites worldwide. While claiming to be neutral, the IHR promotes the lie that \"the Holocaust was invented by Jews to further Jewish-Zionist interests\". The IHR also alleges that \"Nazi Germany actively supported Zionism\" by presenting relevant history without context. IHR's repeated accusations of \"Jews weaponizing antisemitism\" are shared by figures across the political spectrum. For instance, former London mayor Ken Livingstone (1945 – ), who was a British Labour Party member until 2018, made accusations that are similar to IHR's, so did PA's leader * * * * * * and American Trotskyist activist writer Lenni Brenner (1937 – ) who published a book legitimizing such an accusation among the political left. * * * * * * * * * * ===David Duke=== David Duke (1950 – ), former leader of the White supremacist group Ku Klux Klan (KKK), also has a history of accusing Jews of \"weaponizing\" antisemitism and the Holocaust. On December 11 – 13, 2006, Duke attended a Holocaust-denying conference in Iran upon invitation from Iran's regime, during which Duke accused \"Zionists [of] weaponizing the Holocaust to deny the rights of the Palestinians\". He went on to argue that \"[T]he Holocaust [...] is the pillar of Zionist imperialism, Zionist aggression, Zionist terror and Zionist murder.\" He was one of the 70 participants of the conference. ==Academic views== ===Clemens Heni=== Political scientist Dr. Clemens Heni (1970 – ) said that many of those who made accusations of \"Jews weaponizing antisemitism\" were motivated by antisemitism. Dr. Heni also found that they had a higher chance of trivializing the Holocaust by exaggerating Germans' suffering from Allied bombing operations (e.g. Dresden bombing in February 1945) and falsely accusing Israeli Jews of \"weaponizing\" the Holocaust to \"extort\" from modern Germans. Dr. Heni classified such accusations as \"soft-core Holocaust denial\" – a synonym for Holocaust distortion. * * * * * * Distortion of the Holocaust refers, inter alia, to: ===Alexandria Fanjoy Silver=== Dr. Alexandria Fanjoy Silver, sharing similar concerns to Prof. Jan Grabowski, * * * * * * said that some accusations of \"Jews weaponizing antisemitism\" were \"rooted in the psychological process of guilt-deflection\", involving a \"negation of personal responsibility\" for their own or their society's antisemitism. In addition to many Jews being accused of \"weaponizing antisemitism\", they were also accused of \"talking too much about the Holocaust\", being \"anti-Palestinian\" or \"ignoring Islamophobia\" for raising awareness about Hamas' atrocities on October 7, 2023, despite Jews having suffered 68% of religion-based hate crimes in the United States (US) in 2023 as per FBI data, * * * * * while 46% of the world's adult population (around 2,200,000,000 people) were found to hold deeply entrenched antisemitic views as of January 2025. * * * * Dr. Silver furthered that some of those making those accusations were \"so uncomfortable in its [antisemitism's] immorality\" that they had to \"twist it into an expression of morality.\" ==Related pages== * Informal fallacy * Conspiracy theory * Holocaust inversion * Holocaust uniqueness debate * Antisemitism in the Soviet Union ==References== Category:Logic Category:Racism Category:Politics Category:Antisemitism Category:Controversies Category:Discrimination Category:Critical thinking Category:Logical fallacies",
 "title": "Weaponization of antisemitism"
}