{
 "id": "1172955",
 "text": "This is a list of awards and nominations received by American actress and singer Zendaya. ==Major associations== ===Critics' Choice Awards=== The Critics Choice Association (CCA) is a Canadian American association of television, radio and online critics that each year organizes various award shows that honor the finest in cinematic or television achievement; these include the Critics' Choice Movie Awards, the Critics' Choice Television Awards, the Critics' Choice Super Awards, and the Celebration of Cinema and Television ceremony. Year Nominated work Category Result Movie Awards 2021 Malcolm & Marie Best Actress Zendaya #SeeHer Award Television Awards 2020 Euphoria Best Actress in a Drama Series 2023 Super Awards 2022 Spider-Man: No Way Home Best Actress in a Superhero Movie Celebration of Black Cinema Awards 2021 Malcolm & Marie NextGen Award (shared with John David Washington) ===Golden Globe Awards=== The Golden Globe Awards are accolades bestowed by the Hollywood Foreign Press Association (HFPA) to recognize excellence in both American and international film and television productions. Year Nominated work Category Result 2023 Euphoria Best Actress in a Television Series – Drama 2025 Challengers Best Motion Picture – Musical or Comedy Best Actress in a Motion Picture – Musical or Comedy ===Primetime Emmy Awards=== The Primetime Emmy Award is an American award bestowed by the Academy of Television Arts & Sciences (ATAS) in recognition of excellence in American primetime television programming. Year Nominated work Category Result 2020 Euphoria Outstanding Lead Actress in a Drama Series 2022 Outstanding Drama Series \"Elliot's Song\" Outstanding Original Music and Lyrics \"I'm Tired\" ===Screen Actors Guild Awards=== The Screen Actors Guild Awards are organized by the Screen Actors Guild‐American Federation of Television and Radio Artists (SAG-AFTRA). First awarded in 1995, the awards aim to recognize excellent achievements in film and television. Year Nominated work Category Result 2023 Euphoria Outstanding Performance by a Female Actor in a Drama Series ==Miscellaneous awards== ===AACTA International Awards=== The AACTA International Awards are presented annually by the Australian Academy of Cinema and Television Arts (AACTA) to recognize and honor achievements in the global film and television industry. Year Nominated work Category Result 2023 Euphoria Best Actress in a Series ===BET Awards=== The BET Awards are an American award show established by the Black Entertainment Television (BET) network to celebrate African Americans and other American minorities in music, acting, sports, and other fields of entertainment over the past year. Year Nominated work Category Result 2014 Zendaya YoungStars Award 2015 2020 Best Actress 2021 2022 2023 ===Black Reel Awards=== The Black Reel Awards are an annual American awards ceremony hosted by the Foundation for the Augmentation of African Americans in Film (FAAAF) to recognize excellence of African Americans, as well as the cinematic achievements of the African diaspora, in the global film industry, as assessed by the Foundation's voting membership. Year Nominated work Category Result 2020 Euphoria Outstanding Actress, Drama Series 2021 Malcolm & Marie Outstanding Actress Outstanding Breakthrough Performance, Female 2022 Euphoria Outstanding Actress, Drama Series \"I'm Tired\" Outstanding Original Song (shared with Labrinth and Sam Levinson) 2025 Challengers Outstanding Film Outstanding Lead Performance ===CDFA Fashion Awards=== The CDFA Fashion Awards are an annual ceremony hosted by the Council of Fashion Designers of America (CDFA). They were founded in 1980 to honor excellence in fashion design. Year Nominated work Category Result 2021 Zendaya Fashion Icon ===CinemaCon Awards=== The CinemaCon is an annual convention controlled by the National Association of Theatre Owners (NATO) which bestows various awards that honor cinematic achievements each year. Year Nominated work Category Result 2023 Zendaya Star of the Year Award ===Dorian Awards=== The Dorian Awards are film and television accolades given by GALECA: The Society of LGBTQ Entertainment Critics, founded in 2009 as the Gay and Lesbian Entertainment Critics Association. Year Nominated work Category Result 2022 Euphoria Best TV Performance ===Glamour Awards=== The Glamour Awards is an annual set of awards hosted by Glamour to honor \"extraordinary and inspirational\" women from a variety of fields, including entertainment, business, sports, music, science, medicine, education and politics. Year Nominated work Category Result 2016 Zendaya The Voice for Girls ===Gotham Awards=== The Gotham Awards are American film awards presented by the Gotham Film & Media Institute to honor the makers of independent films. Year Nominated work Category Result 2024 Challengers Best Feature Spotlight Tribute ===IGN Awards=== IGN is an American video game and entertainment media website operated by IGN Entertainment Inc. Year Nominated work Category Result 2019 Euphoria Best Dramatic TV Performance ===iHeart Radio Music Awards=== The iHeartRadio Music Awards is a music awards show that celebrates music heard throughout the year across iHeartMedia radio stations nationwide and on iHeartRadio, iHeartMedia's digital music platform. Year Nominated work Category Result 2016 Zendaya Biggest Triple Threat ===MTV Movie & TV Awards=== The MTV Movie & TV Awards is an annual award show presented by MTV to honor outstanding achievements in films. Founded in 1992, the winners of the awards are decided online by the audience. Year Nominated work Category Result 2021 Malcolm & Marie Best Performance in a Movie 2022 Euphoria Best Performance in a Show Spider-Man: No Way Home Best Kiss (shared with Tom Holland) ===NAACP Image Awards=== The NAACP Image Awards are an annual awards ceremony presented by the US-based National Association for the Advancement of Colored People (NAACP) to honor outstanding performances in film, television, music, and literature. Year Nominated work Category Result 2012 Shake It Up Outstanding Performance by a Youth 2014 Shake It Up Outstanding Performance by a Youth 2022 Malcolm & Marie Outstanding Actress in a Motion Picture 2023 Euphoria Outstanding Actress in a Drama Series Zendaya Entertainer of the Year ===Nickelodeon Kids' Choice Awards=== The Nickelodeon Kids' Choice Awards are an annual American children's awards ceremony show that is produced by Nickelodeon. Year Nominated work Category Result 2016 K.C. Undercover Favorite Female TV Star 2017 K.C. Undercover Favorite Female TV Star 2018 K.C. Undercover Favorite Female TV Star Spider-Man: Homecoming and The Greatest Showman Favorite Movie Actress 2019 K.C. Undercover Favorite Female TV Star Smallfoot Favorite Female Voice from an Animated Movie 2020 Spider-Man: Far from Home Favorite Movie Actress 2022 Dune and Spider-Man: No Way Home Favorite Movie Actress 2024 Dune: Part Two Favorite Movie Actress ===People's Choice Awards=== The People's Choice Awards is an American awards show, recognizing people in entertainment, voted online by the general public and fans. Year Nominated work Category Result 2019 Euphoria Favorite Drama TV Star of the Year Spider- Man: Far from Home Favorite Female Movie Star of the Year 2020 Zendaya Favorite Style Star of the Year 2022 Euphoria Favorite Drama TV Star of the Year ===Radio Disney Music Awards=== The Radio Disney Music Awards (RDMA) is an annual awards show operated and governed by Radio Disney, an American radio network. Year Nominated work Category Result 2013 Best Music Video (shared with Bella Thorne) 2014 Zendaya Breakout Artist Best Style 2015 Zendaya Best Style 2016 Zendaya Best Style ===Satellite Awards=== The Satellite Awards are annual awards given by the International Press Academy that are commonly noted in entertainment industry journals and blogs. Year Nominated work Category Result 2020 Euphoria Best Actress in a Drama / Genre Series 2021 Euphoria Two-Part Special Best Actress in a Miniseries or Television Film 2023 Euphoria Best Actress in a Drama / Genre Series ===Saturn Awards=== The Saturn Awards are American awards presented annually by the Academy of Science Fiction, Fantasy and Horror Films. They were initially created to honor science fiction, fantasy, and horror on film, but have since grown to reward other films belonging to genre fiction, as well as television and home media releases. Year Nominated work Category Result 2018 Spider-Man: Homecoming Best Performance by a Younger Actor 2019 Spider- Man: Far from Home Best Supporting Actress 2022 Spider-Man: No Way Home Best Actress 2025 Dune: Part Two Best Supporting Actress ===Shorty Awards=== The Shorty Awards is an annual awards show recognizing the people and organizations that produce real-time short form content across Twitter, Facebook, YouTube, Instagram, TikTok, Twitch and the rest of the social web. Year Nominated work Category Result 2020 Zendaya Best Celebrity ===Teen Choice Awards=== The Teen Choice Awards are an annual awards show that airs on the Fox television network. The awards honor the year's biggest achievements in music, film, sports, television, fashion, social media, and more, voted by viewers living in the US, aged 13 and over, through various social media sites. Year Nominated work Category Result 2014 Zendaya Choice Music Breakout Artist Choice Candie's Style Icon 2015 K.C. Undercover Choice TV Actress Comedy 2016 Choice Music R&B;/Hip-Hop Song Zendaya Choice Style Female 2017 K.C. Undercover Choice TV Actress Comedy Spider-Man: Homecoming Choice Summer Movie Actress Choice Breakout Movie Star Zendaya Choice Twit Choice Style Icon Choice Female Hottie 2018 Choice Movie Actress Drama Choice Movie Ship (shared with Zac Efron) Choice Liplock (shared with Zac Efron) Choice Collaboration (shared with Zac Efron) Zendaya Choice Style Icon 2019 Spider- Man: Far from Home Choice Summer Movie Actress ===World Music Awards=== The World Music Awards is an international award show based in Monte Carlo and presented to the world's best-selling artists in a number of categories. Year Nominated work Category Result 2014 \"Replay\" World's Best Song World's Best Video Zendaya World's Best Female Artist ===Young Artist Awards=== The Young Artist Award is an accolade presented by the Young Artist Foundation, a nonprofit organization founded in 1978 to honor excellence of youth performers. Year Nominated work Category Result 2011 Shake It Up Outstanding Young Ensemble in a TV Series 2012 Outstanding Leading Young Actress in a TV Series Outstanding Young Ensemble in a TV Series 2013 Frenemies Outstanding Leading Young Actress in a TV Movie, Miniseries or Special ==Critics associations== Year Nominated work Association Category Result 2019 Smallfoot Alliance of Women Film Journalists Best Animated Female 2020 Euphoria Online Film & Television Association Best Actress in a Drama Series 2021 Malcolm & Marie Hollywood Critics Association (Film Awards) Best Actress Euphoria Two- Part Special Hollywood Critics Association (TV Awards) Best Actress in a Limited Series, Anthology Series, or Television Movie 2022 Dune Austin Film Critics Association Best Ensemble Georgia Film Critics Association Best Ensemble San Diego Film Critics Society Best Ensemble Euphoria Hollywood Critics Association (TV Awards) Best Actress in a Broadcast Network or Cable Series, Drama Online Film & Television Association Best Actress in a Drama Series 2024 Challengers Hollywood Creative Alliance (Midseason Awards) Best Actress Florida Film Critics Circle Best Cast Dune: Part Two Hollywood Creative Alliance (Film Awards) Best Cast Ensemble San Diego Film Critics Society Best Ensemble St. Louis Film Critics Association Best Ensemble 2025 Austin Film Critics Association Best Ensemble Georgia Film Critics Association Best Ensemble ==Film festivals== Year Nominated work Festival Category Result 2021 Malcolm & Marie Santa Barbara International Film Festival Virtuoso Award ==Notes== ==References== == Other websites == * Zendaya",
 "title": "List of awards and nominations received by Zendaya"
}