{
 "id": "1172807",
 "text": "In the 4th century, Christianity went through important changes following three centuries of persecution within the Roman Empire. Christianity turned from a persecuted sect of Judaism into the state religion of the Roman Empire. ==Background== ==Events== ===Reign of Constantine the Great: 306 ‒ 337 AD=== Constantine the Great was Roman Empire's first Christian emperor. He became the emperor in 306 AD in York, Britain. He held the Council of Nicaea in 325 to make a unified Christian doctrine in response to the Arian controversy. He died in 337, seven years after he founded Constantinople (now Istanbul, Turkey). Under Constantine the Great, persecution of Christianity stopped after he rolled out the Edict of Milan in 313 to grant Christians their freedom of religion, with a closer relationship between the Christian church and the imperial state. ===Reign of Constantius II: 337 ‒ 361 AD=== Constantine the Great was succeeded by his third son Constantius II, * * Kent, J.P.C., Hirmer, M. & Hirmer, A. Roman Coins (Thames and Hudson, 1978) * who ruled from 337 ‒ 361. Constantius II was Arian, who held the heretical view that \"Jesus is not God [...] but a creature with a beginning\". ===Reign of Julian the Apostate: 361 – 363 AD=== Constantius II was succeeded by Julian the Apostate, the nephew of Constantine the Great. Under Julian's brief rule, he rejected Christianity and promoted Neoplatonic Hellenism,De Leseleuc, Anne (2013). Julien le philosophe : César des Gaules. Sagittaire. a form of Greek philosophy. Nevertheless, Christianity survived. ===Reign of Theodosius I: 379 – 395 AD=== Theodosius I, the son of Count Theodosius serving as a commander under Valentinian I (reign 364 – 375), succeeded Julian in 379. In 380, Theodosius I made Christianity the state religion. Since then, the church had become a core part of the imperial government, with government roles granted to Christian bishops across the empire. Bishops got privileges ‒ or special rights ‒ they had never had in the previous three centuries. St. Ambrose, the bishop of Milan between 374 and 397, wrote that the Christian church and the Roman Empire had become so interlinked that \"Roman\" and \"Christian\" had literally the same meaning. By 400, the patriarch of Constantinople \"enjoyed precedence at court before all civil officials. ==Monasticism== 4th century also saw the rise in popularity of Christian monasticism. Some Christians moved to deserts, become monks in monasteries, and live a form of simple life that they believed Jesus to have lived. As per Robert Louis Wilken, a historian specialized in Christian history, ===Select list of early Christian monks=== * St. Anthony (251 – 356) * St. Pachomius (c. 290 – 346) * St. John Cassian of Marseille (c. 360 – 435) * St. Basil, bishop of Caesarea Cappadociae (370 – 379) * St. Benedict of Nursia (c. 480 – 547), commonly deemed the father of Western monasticism ===Work=== Many Christian monks spent their days copying manuscripts and keeping their monasteries well-run. ==Pelagian controversy== In addition to the Arian controversy as mentioned, which led to the condemnation of Arianism and consolidation of Trinitarianism at the Council of Nicaea in 325, another notable theological controversy is the Pelagian controversy. The controversy happened when Pelagius, a British monk, believed that men were not born with the original sin but had the free will to choose to be good or bad without divine grace (the unmerited and spontaneous gift from God, such as salvation and sanctification.) St. Augustine, a North African monk, objected to Pelagius' view, followed by Pelagius' criticism of Augustine's denial of human responsibility for his or her behavior. Rather than seeking compromise, Augustine penned a series of treatises to scold Pelagius. The dispute peaked in the condemnation of Pelagius by the Council of Carthage (416), Milevis (416), and Ephesus (431). ===Later development=== ====Eastern Orthodoxy==== Though Pelagius did not win the theological dispute in the 5th century, his ideas was partly taken up by the Eastern Orthodox Church, which believed that the original sin referred to the first sin of Adam and Eve rather than something everyone was born with, i.e. everyone is merely guilty of his or her own sins. The Orthodox Church in America (OCA) gave an example to explain it: If one of your close relatvies was a convicted serial killer, you might bear the consequences of his or her action as others might avoid you. However, you are not guilty of his or her sin. ==Related pages== * Protestantism ** Baptist ** Calvinism ** Anglicanism ** Lutheranism * Eastern Christianity ** East–West Schism ** Oriental Orthodoxy * Protestant Reformation * Roman Catholic Church ==References== Category:Religions Category:Christianity Category:Roman Empire Category:Classical antiquity Category:History of Christianity",
 "title": "Christianity in the 4th century"
}