{
 "id": "1172862",
 "text": "On April 9, 1990, Atlantic Southeast Airlines Flight 2254, an airplane was flying from from Muscle Shoals, Alabama, to Atlanta, Georgia, hit another airplane, a Cessna 172, in the sky. The Cessna crashed killing both people onboard the airplane but the Embraer 120 returned and landed at the airport, saving all seven people onboard the Embraer. == Aircraft == === Embraer aircraft and crew === The Embraer 120 Brasilia was made by Embraer in 1985 and was sold to Atlantic Southeast Airlines. The plane had two Pratt & Whitney Canada PW118 engines. Captain William Query (56) and First Officer Quentin Haynes were the pilots. === Cessna aircraft === The Cessna 172 was made by Cessna in 1985 and was sold to Civil Air Patrol. The plane had one Lycoming O-320 engine. == Accident == Atlantic Southeast Airlines Flight 2254 took-off from Muscle Shoals, Alabama, for Atlanta with a planned stopover at Northeast Alabama Regional Airport in Gadsden, Alabama. The flight from Muscle Shoals to Gadsden was completed. Flight 2254 took-off from Gadsden from Runway 24. The aircraft turned left to Atlanta and started climbing to 5,000 feet. The Cessna 172 was heading west at the same altitude, with the setting sun on the Cessna's pilots eyes. The two aircraft hit each other in the sky at around 6:05 p.m. Central Daylight Time. Because of hitting each other, Flight 2254's right horizontal stabilizer broke off from the aircraft. Flight 2254 returned to the airport, saving all seven people with no injuries. The Cessna 172 crashed in a field, killing both people. The ASA crew said that they saw the Cessna seconds before the two planes hit each other, and that the captain tried to stay away from the Cessna but failed. A person who watched the two planes hit each other said they did not see either of them trying to move away from each other before it happened. == Cause == The United States National Transportation Safety Board (NTSB) said that the planes hit each other in the sky maybe because both crew on both aircraft did not look out for other planes in the sky. The setting sun was on the Cessna's pilots eyes which limited vision. == References == Category:Aviation accidents and incidents in the United States Category:1990 in the United States Category:Aviation accidents and incidents in the 1990s",
 "title": "Atlantic Southeast Airlines Flight 2254"
}