{
 "id": "1172511",
 "text": "Harleen Sethi (born 23 June 1992) is an Indian actress who primarily works in Hindi television. She is best known for her portrayal of Sameera Joshi in ALTBalaji's romantic drama Broken But Beautiful. == Early Life == Harleen Sethi was born on 23 June 1992 in Mumbai, India. She completed her schooling from Jankidevi Public School and subsequently pursued her graduation from Narsee Monjee Institute of Management Studies. Sethi dated actor Vicky Kaushal in 2018. The couple broke up in 2019. In 2024, she revealed that she had been diagnosed with PCOD. == Career == Sethi made her acting debut in 2015 as Tina in StarPlus's Gulmohar Grand. She then hosted Yarri Dosti Shaadi and India Adventures, both in 2016. She then potrayed Bani in Gabru: Hip Hop Ke Shehzaade alongside Amol Parashar in 2018. The same year, she made her web debut opposite Vikrant Massey in Broken But Beautiful, which proved to be her breakthrough role. == Filmography == === Films === Key Denotes films that have not yet been released Year Title Role Ref. 2013 Country of Bodies: Bombay in Dance Herself 2014 Mundeyan Ton Bachke Rahin 2025 Be Happy TBA Woh Ladki Hai Kahaan? === Television === Year Title Role Ref. 2015 Gulmohar Grand Tina 2016 Yarri Dosti Shaadi Host India Adventures 2018 Gabru: Hip Hop Ke Shehzaade Rapper Bani 2019 MTV Ace of Space Herself === Web series === Year Title Role Ref. 2018–2021 Broken But Beautiful Sameera Joshi 2020 Bandish Bandits Herself 2022 The Gone Game Sharmila Gupta Kathmandu Connection Tasneem 2023 Kohrra Nimrat Kaur Sultan of Delhi Preeti Ganmukh Patel 2024 Bad Cop SHO Devika Naik Doctors Dr. Nitya Vasu TBA The Test Case 2 Major Zoya Ali Untitled Netflix series === Music videos === Year Title Singer Ref. 2019 Teri Hogaiyaan Herself 2022 Dooron Dooron Paresh Pahuja == Awards == Year Award Category Work Result Ref. 2023 Filmfare OTT Awards Best Supporting Actor (Female) Kohrra rowspan=\"2\" ! 2024 Indian Film Festival of Melbourne Best Performance (Female) Series == References == == Other websites == * * Category:1992 births Category:Living people Category:Actors from Mumbai Category:Indian television actors Category:Indian movie actors",
 "title": "Harleen Sethi"
}