{
 "id": "1172503",
 "text": "Budapest's 7th district (Hungarian: Budapest VII. kerülete, Hebrew: הוא רובע 7 של בודפשט) is the smallest in area but has the highest population density. Its traditional name is Erzsébetváros. In 2010, it won the title of \"Value-Rich Settlement\" and is one of Pest's most important areas, rich in history and culture. This district is the center of Jewish heritage and lively nightlife, where old buildings mix dynamically with modern city life. The district’s history is closely tied to Budapest’s Jewish community, as it is home to the city’s famous Jewish Quarter. The quarter formed in the 19th century and, by the turn of the century, became one of Pest’s most densely populated and multicultural areas. The Dohány Street Synagogue, Europe’s largest synagogue, is one of the district’s most important buildings. == History == After the Turkish occupation, scattered farms and vineyards appeared in the area. In 1734, there were 11 houses counted, and by 1792, this number grew to 559. The layout of what later became the 7th district was shaped by the first streets that formed. In the 1870s, the construction of the Budapest's Grand Boulevard boosted the area’s development. The current 7th district was officially created in 1873 during the unification of the city. This happened because Budapest’s 6th district had become too large and overcrowded, so it was split into two parts. In December 1881, the district requested to be named Erzsébetváros (Elisabethtown) after Queen Elisabeth, the wife of Emperor Franz Joseph I. The king signed the approval on January 17, 1882, and the new name was officially adopted on February 7, 1882.Budapest VII. kerület - Erzsébetváros == Politics == The current mayor of the district is Péter Niedermüller (DK). List of mayors Name Party Date János Faragó SZDSZ 1990–1994 Karola Bakonyi MSZP 1994–1998 Zoltán Szabó MSZP 1998–2002 György Hunvald MSZP 2002–2010 Zsolt Vattamány Fidesz-KDNP 2010–2019 Péter Niedermüller DK 2019– == Population == On October 1, 2022, the population of the 7th district was 48,943 people, which was 2.9% of Budapest’s total population. Since the 2011 census, the district’s population has decreased by 7,150 people. In 2022, the average population density was 23,418 people per square kilometer. The age distribution in the district is quite unfavorable: 8% of the population was under 14 years old, while 17% was over 65. In 2022, the life expectancy at birth was 73.3 years for men and 79.4 years for women. == Sister cities == * , Safed * , Karlovac * , Nevers * , Siedlce * , Stari Grad (Belgrade) * , Thessaloniki * , Sveti Vlas * , Comrat ==References== Category:Districts of Budapest",
 "title": "7th district of Budapest"
}