{
 "id": "1172165",
 "text": "Shou Wan-por (, born July 17, 1960), known professionally as Robin Shou, is a Hong Kong-American actor, martial artist, stuntman, and filmmaker.https://www.freaksugar.com/robin-shou-earthbound-interview/ Born in British Hong Kong but raised in Los Angeles, Shou entered the Hong Kong film industry as a stuntman in the late 1980s, before transitioning to acting. Shou made over 40 Hong Kong movies before breaking into Hollywood.http://www.eurasianvogue.com/features In 1994, Shou landed his first American leading role as Liu Kang in the martial arts fantasy film Mortal Kombat (1995). Shou is widely considered one of the greatest martial arts stars in the history of cinema. == Early life and martial arts career == Shou was born in British Hong Kong and emigrated to Los Angeles. His interest in martial arts developed during his years as a University student, when he began studying Kenpō. He later transitioned to Wushu, after watching Jet Li's film Shaolin Temple (1982). This led him to win several martial arts championships, both in China and the United States. == Film career == Shou entered the Hong Kong film industry as a stuntman. His first dramatic role was in the American television film Forbidden Nights (1990) with Melissa Gilbert, in which he portrayed Liang Heng.https://kungfukingdom.com/profile-of-robin-shou/amp/ In 1994, Shou landed his first American leading role as Liu Kang in the martial arts fantasy action film Mortal Kombat (1995). He reprised the role in the 1997 sequel Mortal Kombat Annihilation. That same year, he appeared alongside Chris Farley as Gobei in the martial arts comedy film Beverly Hills Ninja. He went on to play Gen in the martial arts film Street Fighter: The Legend of Chun-Li (2009) and 14K in the Death Race film series (2008-2013). He directed the documentary film Red Trousers - The Life of the Hong Kong Stuntmen (2003). He also wrote, produced, and directed the short film Earthbound (2015), which won six international film awards. == Personal life == He is fluent in English in addition to his native Chinese. One of his favorite films is A Tree Grows in Brooklyn (1945), starring Peggy Ann Garner.http://www.eurasianvogue.com/features/a-moment-with-the-chosen-one- robin-shou == References == Category:Hong Kong actors Category:Hong Kong filmmakers Category:Martial artists Category:1960 births Category:Living people",
 "title": "Robin Shou"
}