{
 "id": "1172654",
 "text": "Naakenthaa (), also spelled as Nakentha (/nā-ken-thā/), refers to the autumn season or fall season in Meitei language.Yashwanta Singh, Chungkham. Manipuri Grammar. India: Rajesh Publications, 2000. p. 219 It is one of the seasons in the Meitei calendar of Ancient Kangleipak (early Manipur). It plays an important role in different elements of the Meitei culture, including but not limited to Meitei festivals, Meitei folklore, Meitei folktales, Meitei history, Meitei literature, Meitei mythology, Meitei proverbs, traditional Meitei religion (Sanamahism), etc. Mera, the seventh month in the traditional lunar Meitei calendar, coincides with the timing of autumn season. == Etymology == In Meitei language, \"nakentha\" () is made up of \"naa\" or \"na\" () meaning \"plant leaf\", \"ken\" () meaning \"to fall\", and \"thaa\" or \"tha\" () meaning \"season\" or \"month\". == In Meitei festivals == === A day of married women === Ningol Chakouba (), a traditional Meitei festival, in which the married daughters and sisters are invited by their parents and brothers, to dine together in their parental homes, falls during the autumn season. Aheibam Shyam Singh described the beauty of the autumn season, with relation to the festival, in the following lines: === Bamboo poles, lamps and brotherhood === Mera Chaoren Houba () on the first day of the Meitei lunar month of Mera () during the autumn season. During autumn period, traditional Meitei festivals like Mera Hou Chongba () and Mera Wayungba () are celebrated. These are ceremonially observed through the lighting of a lamp placed atop a bamboo pole in the front courtyard every night throughout the Meitei lunar month of Mera. This ritual continues until the day of Mera-Waphukpa (), when the bamboo pole is finally taken down. The origins of this lamp-lighting tradition are steeped in an ancient narrative about two brothers. One brother stayed in the hills, while the other traveled down to the valley (Imphal), referring to the Meitei people. The light served as a means of communication across distances and time. Long after the brothers' departure, their descendants continued this custom, and it is believed that the practice of lighting the lamp is deeply rooted in this historical memory. === Dance traditions === The precincts of a temple (not different from the annual agricultural cycle) are related to the several Rasa dance forms of the classical Manipuri dance. According to Meitei traditions, the autumn season to the Maha rasa.Vatsyayan, Kapila. A Study of Some Traditions of Performing Arts in Eastern India: Margi and Desi Polarities : Banikanta Kakati Memorial Lectures, 1976. India: Department of Publication, University of Gauhati, 1981. p. 60The Cultural Heritage of Manipur. United Kingdom: Manohar, 2020. == In Meitei mythology and folklore == In Meitei mythology and Meitei folklore, autumn season is related to a special lamp for lighting ceremony. It is called as the \"Autumn lamp\". The story of the Autumn Lamp signifies the ancient brotherhood of the Meitei ethnicity with a hill tribesmen community called the Tangkhul people, which primarily live in the hills of Manipur.Roy, L. Somi., Devi, Dr Thangjam Hindustani. Feathers, Fools and Farts: Folktales from Manipur. India: Penguin Random House India Private Limited, 2024. p. 2 == In Meitei literature == In Meitei literature, naakenthaa may depict the sad days of a person's life, where there is little or no joy and no beauty, and more about sorrows and melancholy. It is just opposite to the Yenning-tha (spring season). Nakentha is referred to as \"the season of shedding leaves\", and \"a time when the trees shed leaves in preparation for the coming cold winter and to prepare to turn over a new leaf in the coming spring that follows the cold dry winter.\" == In Meitei religion == The traditional Meitei religious rites as well as rituals like Mera Santuba () and Mera Kwaak Taanba (), among many, are performed for the well-being of the land and its people, during the autumn season. == In popular culture == A play named \"Nakentha-da Yening\" () was performed by the North Imphal Manipur Jatra Mandal team on January 17, 2011, in Manipur. == References == Category:Meitei culture Category:Seasons",
 "title": "Naken-tha"
}