{
 "id": "1172140",
 "text": "The 1911 Belgium–Netherlands women's fencing meeting was an international foil fencing meeting organized by Salle De Vos in The Hague, the Netherlands. It took place on 1 March 1911 with Dutch women's fencers of Salle De Vos competing against fencers of the Ladies Fencing Club from Antwerp. It was one of the earliest women's international fencing competitions and contributed to the progress of international women's fencing. The competition was won by the Belgian fencers with 46 points to 21 points. ==Background== While fencing was already practiced by women during the 19th century, fencing was in this era a male-dominated sport. Fencing was among the few sports competed by women during the 1910s. After pogress of women's fencing during the 1910s, it was introduced in 1924 at the Summer Olympics. This fencing competition was one of the earliest international fencing competition in the history of women's fencing; after the Ladies Fencing Club competed against women of the Bertrands Fencing Academy at the 1910 England–Netherlands women's fencing competition and after the 1910 Lille international women’s fencing tournament. The women of Salle De Vos would compete two weeks after this event at the 1911 England–Holland women's fencing competitions. ==Officials== The officials of the meeting consisted of: *Knight van Karnebeek *Knight de Beaufort *Knight van Panhuys *Knight Resselaer van Dril *Baron Schemmelpenninck *Count de Bylandt ==Meeting== All Belgian participants were fencer of the Ladies Fencing Club from Antwerp led by fencing master M. Verbrugge. The Dutch participants were all fencers of Salle de Vos. Each fencer competed multipe bouts against fencers from the other country and gained one point for every victory. In the reports only the results were listed of the winning team Belgium. The meeting was attended by several notable people, including M. Yvan de Petersen, Russian Minister; M. Baron Van Tuyll van Serooskerken; Mme Baron van de Poll; Mme Baron Sirtemma Crovastin; Mme Count von Limburg Stirum; M. and Mme Donker- Curtius; M. Ridder de Bakker. Fencer Matches Wins Leni Preetorius 9 8 G. Lowet 8 De Decker 7 Franckel 7 E. Illner 7 Van Leckwyck 5 Jula Preetorius 4 ===Overall classification=== Club Points 46 21 ==Aftermath == The meeting resulted in a return meeting, where the Dutch fencers of Salle De Vos went to Antwerp for the 1911 Belgium–Netherlands women's fencing meeting in December 1911. These meetings were some of the 1910s club-organized international fencing meetings that contributed to the progress of women's fencing and closing the gap between women's fencing and men's fencing. ==References== Category:1910s in women's fencing Category:Sport in Belgium Category:Sport in the Netherlands Category:1911 in Europe",
 "title": "1911 Netherlands–Belgium women's fencing meeting"
}