{
 "id": "1172252",
 "text": "Saro Grimani, (born in Naples, April 4, 1974) is a contemporary Italian artist.Artisti’23, pag 609 https://www.tripadvisor.it/Attraction_Review-g1079902-d26266672-Reviews- Saro_Grimani-Santa_Maria_di_Sala_Veneto.html He lives and works in Italy. In 2023, he was included in the Artisti’23 yearbook and participated in the Amedeo Modigliani Foundation Award.https://www.comunicati- stampa.fvg.it/lartista-veneziano-saro-grimani-al-premio-fondazione-amedeo- modigliani-a-roma-l11-novembre/ A review of one of his works was included in the book “Porto Franco: The Works Cleared by Vittorio Sgarbi.”Porto Franco le opere sdoganate da Vittorio Sgarbi, ArtNow, 2023 Socially and politically active, in 2022 he took part in the International Art Biennale of Rome.https://www.comunicati-stampa.fvg.it/saro-grimani-alla-xiv-biennale- darte-di-roma/ ==Biography== Saro Grimani was born in Naples, but after his university studies, he moved to Venice, where he developed his artistic and professional career as a designer. Saro Grimani began working as an industrial designer, creating objects for homes and commercial spaces. In 2007, he collaborated with a collective of designers and architects with the aim of creating high-quality design objects accessible to the general public. Saro Grimani is a prominent artist and designer, whose career has developed through different movements and trends. His Dadaist work and later involvement in the movement were characterized by strong irony and social critique, which deeply influenced contemporary design and art.https://www.nellanotizia.net/scheda_it_123865_Saro-Grimani-artista- Veneziano_1.html ==Artistic Practice== Saro Grimani creates Dadaist paintings focusing on socially relevant subjects.https://www.zazoom.it/news- notizia/post/513868/2022-05-23--saro-grimani-lartista-chi-non-voce--09-26/ The surface of these works is always decorated with patterns, symbols, letters, glyphs, and other types of figures, in a wide variety of forms.https://fai.informazione.it/AE024636-9DAB-4F93-BD9F-D7B9F5DBC603/L-appello- di-Saro-Grimani-alle-istituzioni-salviamo-l-arte His works aim to raise awareness among viewers about social issues such as war, gender violence, freedom, and the Holocaust.https://fai.informazione.it/5796B927-A1C2-4BEE-922E-506823950827/Venezia-27-gennaio- Saro-Grimani-ricorda-l-olocausto ==Gallery== File:War and press Freedom.jpg|War and Press Freedom by Saro Grimani File:Food War.jpg|Food War by Saro Grimani File:Stop Femminicide.jpg|Stop Femminicide by Saro Grimani File:Freedom is our illusion.jpg|Freedom is our illusion by Saro Grimani File:Loniless is a bad company.jpg|Loneliness is a bad company by Saro Grimani ==Works Exhibited in Public Spaces== Saro Grimani’s works have been exhibited in many public spaceshttp://www.labiennalediroma.com/it/editions/2022 Rome, Domitian Stadium Museumhttps://www.tripadvisor.it/ShowUserReviews-g187791-d196846-r892206981-Stadio_di_Domiziano_Navona_Square_Underground- Rome_Lazio.html Venice, Villa Farsetti, Santa Maria di Sala ==Bibliography== **Margutta 18 (Monia Formentini, Stefania Medici, Italy, Dantebus Edizioni, 2022) **Saro Grimani, beyond the border (Rosario di Vaio, Saro Grimani, Italy, 2021) **Saro Grimani, Venezianischer Künstler (S. Grimani, German, 2023) **Saro Grimani, Forme, Couleur et Art (S. Saporta, S. Grimani, French, 2022) ==References== Category:Italian artists Category:1974 births Category:Living people",
 "title": "Rosario Grimani known as Saro"
}