{
 "id": "1172203",
 "text": "Fort Simple was a fort built in Topeka, Kansas, because of Maj. Gen. Sterling Price's Missouri Raid in 1864. Topeka became the capital of Kansas in 1861, but there were no defenses against guerrilla fighters. The Lawrence Massacre in 1863 didn’t lead to building a fort, although plans were made in July 1864.Maj. Gen. Samuel R. Curtis, report, The War of the Rebellion (Washington: Government Printing Office, 1883), Series I, Vol. XLI, Part II, p. 102. == History == On October 8, 1864, Gov. Thomas Carney called the state militia to defend Kansas. The 2nd Regiment from Shawnee County went to Missouri, and 292 men stayed to guard Topeka with a cannon.Fry Giles, Thirty Years in Topeka: a Historical Sketch (Topeka: Capper Special Services, 1960), 1960 ed., p. 129. The home regiment, led by Maj. Andrew Stark, built a fence at 6th and Kansas Avenues with trenches on the east side of town. The fence was later called Fort Simple. It had a clear view of the surroundings and the temporary State Capitol was nearby.Giles, pp. 129-30; George A. Root, \"Fort Folly--Fort Simple Topeka,\" interview with Freeman Sardou, December 4, 1917, Topeka, p. 1 (from the Manuscript Div. of the Kansas State Historical Society, Topeka); \"Echoes of Price's Raid,\" The Topeka State Journal, November 2, 1934, p. 7; William C. Pollard, Jr., \"Forts and Military Posts in Kansas: 1854-1865\" (Ph.D. dissertation, Faith Baptist College and Seminary, 1997), p. 67 (a copy can be found in the Manuscript Div. of the KSHS, Topeka). The fort was round and made of logs. It had a flagpole, a cannon port on each side and a wooden gate. There was no roof.Root, p. 1; \"Once Stockade Now Busy Spot in Topeka,\" Topeka Daily Capital, August 18, 1940, p. 17B. The home battalion guarded Topeka while the 2nd Regiment fought Price's men. On October 23, news came that Union forces lost at the Battle of Westport, causing panic. However, Price was defeated.Root, p. 1; \"Once Stockade Now Busy Spot in Topeka,\" Topeka Daily Capital, August 18, 1940, p. 17B. Fort Simple was used until the Civil War's end. In 1867, it was torn down, and a bronze tablet was laid to honor it in 1929 but removed in 1995.Giles, pp. 129-30; Root, p. 87; untitled story, Topeka Weekly Leader, April 18, 1867, p. 3; \"Marker on Stockade Site,\" Topeka Journal, August 5, 1929, p. 6. == References == Simple Category:1864 establishments Category:Buildings and structures by country",
 "title": "Fort Simple"
}