{
 "id": "1172830",
 "text": "Cinecanal is a Latin American subscription television channel that began broadcasting on April 1, 1993. It is owned by The Walt Disney Company Latin America and operated by Disney Media Networks Latin America. ==History== On August 10, 1992, MVS Comunicaciones signed an agreement with United International Pictures (distributor of Paramount Pictures, Universal Pictures and MGM/UA feature films), 20th Century Fox, the Cisneros Organization (through the holding company Cablecinema C.A.) and the Argentine Sociedad Argentina de Cable, S.A. (SACSA) for the founding of a joint venture with the aim of creating a channel with Latin American coverage, which would exclusively broadcast new release films. The original investment was US$5,000,000, although the amount of participation of each entity involved was not disclosed. The company was founded as LAPTV. On April 21, 1995, after the Mexican economic crisis of 1994, the Cisneros Organization and MVS Comunicaciones sold their shares to United International Pictures because LAPTV, the company in charge of operating the channel, was suffering huge financial losses despite the fact that the channel had only been on the air for two years. The following year, the company moved its headquarters to Atlanta. Shortly after, the company's second channel, Cinecanal 2, was launched. On March 15, 1998, LAPTV signed an agreement with DreamWorks SKG to broadcast its feature films in television premieres. In 2000, MGM changed the way it distributed its films abroad and ceased to be a UIP partner company and in November 2000, it sold its shares to 20th Century Fox and Walt Disney Pictures. On July 23, 2007, SACSA sold the shares to Fox Latin American Channels and two years later, Universal Studios sold its stake to Fox. Since November 1, 2009, Cinecanal became a basic channel on Latin American television operators. On October 1, 2010, Cinecanal renewed its corporate image to further accommodate the signal as a basic subscription channel. Commercial breaks and promotions during the broadcast of movies were also added. Since June 1, 2011, Cinecanal broadcasts all its programming dubbed into Spanish, in order to reach a new segment of viewers. In addition, a new signal based in Chile was launched, called the Pacífico signal. The channel closed in Ukraine on 1 January 2011. The channel closed in South Korea on 1 October 2016 and was replaced by Nat Geo Kids. The channel was shutdown in Russia on 14 December 2020 with some content moving to Disney+. On April 1, 2022, Cinecanal arrives for the first time in Brazil, a country it had not originally reached, where it replaced the local Star Life channel that ceased broadcasting along with FXM, Disney XD, Nat Geo Wild and Nat Geo Kids. The channel closed in Germany on 30 November 2022 but it was relaunched on 17 January 2023. The channel removed from Allente in Norway and was replaced by the return of Disney XD on 29 May 2024. In Turkey, Cinecanal was shutdown and was replaced by the return of Disney Channel on 24 July 2024 while in Brazil it was shutdown for good on 1 March 2025 and later closed in Italy on 1 May 2025 while most of its content moved to Disney+. In Sweden, the channel will be replaced by the return of Disney Jr. on 29 May 2025 and later in Hungary on 1 June 2025. == References == Category:Cable television Category:The Walt Disney Company Category:Television channels in South America Category:Television channels in Europe Category:Television channels in Asia",
 "title": "Cinecanal"
}