{
 "id": "1172932",
 "text": "The 97th Academy Awards ceremony, presented by the Academy of Motion Picture Arts and Sciences (AMPAS), took place on March 2, 2025, at the Dolby Theatre in Hollywood, Los Angeles. The ceremony was televised in the United States by ABC and streamed on Hulu for the first time. ==Winners and nominees== ===Awards=== Winners are listed first, highlighted in boldface, and indicated with a double dagger (‡). * Anora – Alex Coco, Samantha Quan, and Sean Baker, producers ‡ ** The Brutalist – Nick Gordon, Brian Young, Andrew Morrison, D.J. Gugenheim, and Brady Corbet, producers ** A Complete Unknown – Fred Berger, James Mangold, and Alex Heineman, producers ** Conclave – Tessa Ross, Juliette Howell, and Michael A. Jackman, producers ** Dune: Part Two – Mary Parent, Cale Boyter, Tanya Lapointe, and Denis Villeneuve, producers ** Emilia Pérez – Pascal Caucheteux and Jacques Audiard, producers ** I'm Still Here – Maria Carlota Bruno and Rodrigo Teixeira, producers ** Nickel Boys – Dede Gardner, Jeremy Kleiner, and Joslyn Barnes, producers ** The Substance – Coralie Fargeat, Tim Bevan, and Eric Fellner, producers ** Wicked – Marc Platt, producer * Sean Baker – Anora ‡ ** Brady Corbet – The Brutalist ** James Mangold – A Complete Unknown ** Jacques Audiard – Emilia Pérez ** Coralie Fargeat – The Substance * Adrien Brody – The Brutalist as László Tóth ‡ ** Timothée Chalamet – A Complete Unknown as Bob Dylan ** Colman Domingo – Sing Sing as John \"Divine G\" Whitfield ** Ralph Fiennes – Conclave as Cardinal Thomas Lawrence ** Sebastian Stan – The Apprentice as Donald Trump * Mikey Madison – Anora as Anora \"Ani\" Mikheeva ‡ ** Cynthia Erivo – Wicked as Elphaba Thropp ** Karla Sofía Gascón – Emilia Pérez as Emilia Pérez / Juan \"Manitas\" Del Monte ** Demi Moore – The Substance as Elisabeth Sparkle ** Fernanda Torres – I'm Still Here as Eunice Paiva * Kieran Culkin – A Real Pain as Benji Kaplan ‡ ** Yura Borisov – Anora as Igor ** Edward Norton – A Complete Unknown as Pete Seeger ** Guy Pearce – The Brutalist as Harrison Lee Van Buren Sr. ** Jeremy Strong – The Apprentice as Roy Cohn * Zoe Saldaña – Emilia Pérez as Rita Mora Castro ‡ ** Monica Barbaro – A Complete Unknown as Joan Baez ** Ariana Grande – Wicked as Galinda \"Glinda\" Upland ** Felicity Jones – The Brutalist as Erzsébet Tóth ** Isabella Rossellini – Conclave as Sister Agnes * Anora – Sean Baker ‡ ** The Brutalist – Brady Corbet and Mona Fastvold ** A Real Pain – Jesse Eisenberg ** September 5 – Moritz Binder and Tim Fehlbaum; co-written by Alex David ** The Substance – Coralie Fargeat * Conclave – Peter Straughan; based on the novel by Robert Harris ‡ ** A Complete Unknown – James Mangold and Jay Cocks; based on the book Dylan Goes Electric! by Elijah Wald ** Emilia Pérez – Jacques Audiard; in collaboration with Thomas Bidegain, Léa Mysius, and Nicolas Livecchi; based on the opera libretto Emilia Pérez by Jacques Audiard and the novel Écoute by Boris Razon ** Nickel Boys – RaMell Ross and Joslyn Barnes; based on the novel The Nickel Boys by Colson Whitehead ** Sing Sing – Screenplay by Greg Kwedar and Clint Bentley; story by Greg Kwedar, Clint Bentley, Clarence Maclin, and John \"Divine G\" Whitfield; based on the book The Sing Sing Follies by John H. Richardson and the play Breakin' the Mummy's Code by Brent Buell * Flow – Gints Zilbalodis, Matīss Kaža, Ron Dyens, and Gregory Zalcman ‡ ** Inside Out 2 – Kelsey Mann and Mark Nielsen ** Memoir of a Snail – Adam Elliot and Liz Kearney ** Wallace & Gromit: Vengeance Most Fowl – Nick Park, Merlin Crossingham, and Richard Beek ** The Wild Robot – Chris Sanders and Jeff Hermann * I'm Still Here (Brazil) in Portuguese – directed by Walter Salles ‡ ** Emilia Pérez (France) in Spanish – directed by Jacques Audiard ** Flow (Latvia) – directed by Gints Zilbalodis ** The Girl with the Needle (Denmark) in Danish – directed by Magnus von Horn ** The Seed of the Sacred Fig (Germany) in Persian – directed by Mohammad Rasoulof * No Other Land – Basel Adra, Rachel Szor, Hamdan Ballal, and Yuval Abraham ‡ ** Black Box Diaries – Shiori Itō, Eric Nyari, and Hanna Aqvilin ** Porcelain War – Brendan Bellomo, Slava Leontyev, Aniela Sidorska, and Paula DuPré Pesmen ** Soundtrack to a Coup d'Etat – Johan Grimonprez, Daan Milius, and Rémi Grellety ** Sugarcane – Julian Brave NoiseCat, Emily Kassie, and Kellen Quinn * The Only Girl in the Orchestra – Molly O'Brien and Lisa Remington ‡ ** Death by Numbers – Kim A. Snyder and Janique L. Robillard ** I Am Ready, Warden – Smriti Mundhra and Maya Gnyp ** Incident – Bill Morrison and Jamie Kalven ** Instruments of a Beating Heart – Ema Ryan Yamazaki and Eric Nyari * I'm Not a Robot – Victoria Warmerdam and Trent ‡ ** A Lien – Sam Cutler-Kreutz and David Cutler-Kreutz ** Anuja – Adam J. Graves and Suchitra Mattai ** The Last Ranger – Cindy Lee and Darwin Shaw ** The Man Who Could Not Remain Silent – Nebojša Slijepčević and Danijel Pek * In the Shadow of the Cypress – Shirin Sohani and Hossein Molayemi ‡ ** Beautiful Men – Nicolas Keppens and Brecht Van Elslande ** Magic Candies – Daisuke Nishio and Takashi Washio ** Wander to Wonder – Nina Gantz and Stienette Bosklopper ** Yuck! – Loïc Espuche and Juliette Marquet * The Brutalist – Daniel Blumberg ‡ ** Conclave – Volker Bertelmann ** Emilia Pérez – Clément Ducol and Camille ** Wicked – John Powell and Stephen Schwartz ** The Wild Robot – Kris Bowers * \"El Mal\" from Emilia Pérez – Music by Clément Ducol and Camille; lyrics by Clément Ducol, Camille, and Jacques Audiard ‡ ** \"The Journey\" from The Six Triple Eight – Music and lyrics by Diane Warren ** \"Like a Bird\" from Sing Sing – Music and lyrics by Abraham Alexander and Adrian Quesada ** \"Mi Camino\" from Emilia Pérez – Music and lyrics by Camille and Clément Ducol ** \"Never Too Late\" from Elton John: Never Too Late – Music and lyrics by Elton John, Brandi Carlile, Andrew Watt, and Bernie Taupin * Dune: Part Two – Gareth John, Richard King, Ron Bartlett, and Doug Hemphill ‡ ** A Complete Unknown – Tod A. Maitland, Donald Sylvester, Ted Caplan, Paul Massey, and David Giammarco ** Emilia Pérez – Erwan Kerzanet, Aymeric Devoldère, Maxence Dussère, Cyril Holtz, and Niels Barletta ** Wicked – Simon Hayes, Nancy Nugent Title, Jack Dolman, Andy Nelson, and John Marquis ** The Wild Robot – Randy Thom, Brian Chumney, Gary A. Rizzo, and Leff Lefferts * Wicked – Production Design: Nathan Crowley; Set Decoration: Lee Sandales ‡ ** The Brutalist – Production Design: Judy Becker; Set Decoration: Patricia Cuccia ** Conclave – Production Design: Suzie Davies; Set Decoration: Cynthia Sleiter ** Dune: Part Two – Production Design: Patrice Vermette; Set Decoration: Shane Vieau ** Nosferatu – Production Design: Craig Lathrop; Set Decoration: Beatrice Brentnerová * The Brutalist – Lol Crawley ‡ ** Dune: Part Two – Greig Fraser ** Emilia Pérez – Paul Guilhaume ** Maria – Edward Lachman ** Nosferatu – Jarin Blaschke * The Substance – Pierre-Olivier Persin, Stéphanie Guillon, and Marilyne Scarselli ‡ ** A Different Man – Mike Marino, David Presto, and Crystal Jurado ** Emilia Pérez – Julia Floch Carbonel, Emmanuel Janvier, and Jean-Christophe Spadaccini ** Nosferatu – David White, Traci Loader, and Suzanne Stokes-Munton ** Wicked – Frances Hannon, Laura Blount, and Sarah Nuth * Wicked – Paul Tazewell ‡ ** A Complete Unknown – Arianne Phillips ** Conclave – Lisy Christl ** Gladiator II – Janty Yates and Dave Crossman ** Nosferatu – Linda Muir * Anora – Sean Baker ‡ ** The Brutalist – Dávid Jancsó ** Conclave – Nick Emerson ** Emilia Pérez – Juliette Welfling ** Wicked – Myron Kerstein * Dune: Part Two – Paul Lambert, Stephen James, Rhys Salcombe, and Gerd Nefzer ‡ ** Alien: Romulus – Eric Barba, Nelson Sepulveda-Fauser, Daniel Macarin, and Shane Mahan ** Better Man – Luke Millar, David Clayton, Keith Herft, and Peter Stubbs ** Kingdom of the Planet of the Apes – Erik Winquist, Stephen Unterfranz, Paul Story, and Rodney Burke ** Wicked – Pablo Helman, Jonathan Fawkner, David Shirk, and Paul Corbould ==References== Category:March 2025 events",
 "title": "97th Academy Awards"
}