{
 "id": "1172163",
 "text": "Dual-covenant theology (DCT) is a theory within the Christian theology concerning the Hebrew Bible, also known as the Old Testament in Christianity. ==Overview== The key idea of the DCT is that the Old Covenant and the New Covenant exist in parallel, with the Old Covenant staying valid for Jews while the New Covenant valid for non-Jews. ==Background== It has been a common view among Christians since ancient times that the Old Testament has been superseded by the New Covenant between God and Christians. * Summa Theologica, I-II, q. 100 * * Meanwhile, some Christians believe that the Mosaic Covenant – or the Old Covenant – is no longer valid due to the perception of Jews being guilty for the Crucifixion of Jesus. As a result, some other Christians came up with the DCT to try to improve the mutual understanding between Christians and Jews. ==Catholic views== ===Pope Eugene IV=== In the papal bull of Pope Eugene IV at the Council of Florence in 1441 AD, he maintained that The Roman Catholic Church upheld the above position until 1965 AD, when the Second Vatican Council (Vatican II) closed with the decision that Since then, the Catholic Church has become divided, ensued by the rise of the radical traditionalist Catholics, * * * * * * * * * * who are active in current American politics. * * * The Vatican II's position was supported by Pope John Paul II, when he led the Catholic Church between 1978 and 2005. However, the Catholic Church does not support the DCT. * * * ===United States Conference of Catholic Bishops (USCCB)=== On December 11, 2024, the United States Conference of Catholic Bishop (USCCB) announced the adoption of the Translate Hate: The Catholic Edition drafted together with the American Jewish Committee (AJC) in response to worsening antisemitism in America since 7 October 2023. As of February 28, 2025, the 1985 revision of the USCCB Guidelines for Catholic-Jewish Relations, which was written in response to the matter, is still in place. The General Principles of the Guidelines include but not limited to # Prayer in common with Jews should be encouraged when mutually acceptable # Proselytism, which does not respect human freedom, is carefully to be avoided # Catholic–Jewish meetings are dedicated to fostering mutual respect and eliminating misunderstandings # A commission or secretariat is recommended to be assigned to Catholic–Jewish relations in each diocese Meanwhile, the Recommended Programs under the Guidelines encourage the # Advancement of Catholic–Jewish relations on all levels # Removal of content from catechesis and homilies that blames all Jews for the Crucifixion of Jesus # Rejection of the historically inaccurate notion that Judaism was a \"decadent formalism and hypocrisy\" # Further analysis of such phrases as \"the Jews\" by St. John in modern context to erase negative undertones about Jews ==Protestant views== In 2006, Evangelical Protestant Jerry Falwell denied a report in The Jerusalem Post that he agreed with the DCT:Hagee, Falwell deny endorsing 'dual covenant', Jerusalem Post, 2006-03-02, . Retrieved 2009-10-21. ==Academic views== Daniel Goldhagen, the former Associate Professor of Political Science at Harvard University, advised the Roman Catholic Church to change its teachings by removing content that is considered antisemitic IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. * * * * * in present times. A way proposed by Goldhagen is to make it clear that \"The Jews' way to God is as legitimate as the Christian way\". ==Related pages== * Jésus et Israël * The Holocaust * Freedom of religion * Antisemitism in Europe * Black Hebrew Israelites ==References== Category:Religion Category:Theology Category:Christianity Category:Protestantism Category:Jewish people Category:Jewish history",
 "title": "Dual-covenant theology"
}