{
 "id": "1172764",
 "text": "The Constitution of the Republic of Uruguay is the supreme law of Uruguay. The highest-ranking written fundamental law of the country. Among other things, it sets the limits and defines the relationships between the powers of the State and between these and their citizens, thus establishing the bases of government and the organization of the institutions on which such powers are based. It also guarantees the people rights and freedoms. The first Constitution was approved by the General Constituent and Legislative Assembly of the State on September 10, 1829, was promulgated on June 28, 1830 and sworn by the people on July 18, 1830. It has undergone several reforms; the current text is basically that of 1967, which, in turn, had several subsequent amendments, in particular, the constitutional reform of 1997. On the website of the Legislative Branch you can see the current text, entitled \"Constitution 1967 with the amendments voted on November 26, 1989, November 26, 1994, December 8, 1996 and October 31, 2004\" ==History== ===First Constitution (1830 - 1918)=== The Constitution of Uruguay of 1830 was the first Constitution of the current Oriental Republic of Uruguay, then Oriental State of Uruguay. It was promulgated on July 18, 1830. ===Second Constitution (1918 - 1933)=== The Constitution of Uruguay of 1918 was put to a plebiscite on November 25, 1917, and came into force on March 1, 1919, after a long and complex process of reform, in accordance with the provisions of the previous Constitution of 1830. ===Third Constitution (1934 - 1942)=== Despite its criticisms, this is the great reform of Uruguayan jurisprudence, the current National Constitution is almost a literal copy of this Magna Carta. It was approved with 62% of the electorate in free elections in 1934, 30% more than the ratification in 1918, the left participated, a part of the Batllistas and Liberals abstained by their own decision to \"not ratify the coup d'état\" although it only strengthened the new regime, Gabriel Terra would say that \"they abstained from participating due to their clear lack of popular support\". The Constitution was made within the framework of the de facto Government of Gabriel Terra (1933-1934), supported by more than 70% of the Batllismo with the former presidents Claudio Williman, José Serrato, Juan Campisteguy, some of whom were constituents, and also by the Vierismo, the Riverismo and the majority sector of the National Party, led by Luis Alberto de Herrera. ===Fourth Constitution (1942 - 1952)=== The Constitution of Uruguay of 1942 was a reform of the previous Constitution of 1934. This had been created within the framework of the Terra dictatorship and, following the so-called \"good coup\" of President Alfredo Baldomir, it was decided to reform the Uruguayan Magna Carta, on the understanding that the previous one was not fully democratic. ===Fifth Constitution (1952 - 1967)=== The Constitution of Uruguay of 1952 replaced the previous Constitution of 1942 and was the result of a political pact between President Andrés Martínez Trueba, List 14 and the white Luis Alberto de Herrera, with the task of taking power away from Luis Batlle Berres. It established the collegiate executive under the name of the National Government Council. ===Sixth Constitution (1967 - present)=== The Constitution of Uruguay of 1967 restored the unipersonal Executive Power, repealing the National Council of Government in force during the previous 16 years, and the figure of the Vice President of the Republic. This Constitution is still in force, although it has suffered several amendments in plebiscites in 1989, 1994, 1996 and 2004. Although there are those who consider the 1996 amendments as a new Constitution, Parliament continues to consider them as changes to the 1967 Constitution. ===2010 reform attempt=== In 2010, during the government of José Mujica, the Uruguayan parliament proposed to carry out a new reform in order to alter the electoral calendar. Some also aimed to discuss the issue of the runoff, while others went more in-depth, and proposed changing the form of government currently in force in Uruguay, that of a presidential republic, to a parliamentary republic, and adding the figure of the prime minister. ==Current power structure== ===Executive Power=== The Executive Power is exercised by the President of the Republic, acting with the respective Minister or Ministers or with the Council of Ministers, whose members he appoints. The seat of the Executive Power is in Montevideo, located in the Executive Tower. ===Legislative Branch=== The General Assembly is the body that exercises the Legislative Power. It is composed of the Chamber of Representatives and the Chamber of Senators, which will act separately or jointly, according to the different provisions of the Constitution. It is chaired by the Vice President of the Republic and begins its sessions on March 1st of each year, meeting until December 15th, or only until September 15th, in case there are elections, when the new Assembly must begin its sessions on the following February 15th. The General Assembly meets on the indicated dates without the need for a special call from the Executive Branch. It presides over its sessions and those of the Chamber of Senators until the inauguration of the Vice President of the Republic, the first holder of the list of Senators with the most votes of the most voted party, according to the previous national election (October). The President of Uruguay can veto laws partially or totally. The legislature can override the veto with a three- fifths vote. In addition to passing laws, the legislature can dismiss ministers by a simple majority. If this occurs with less than two-thirds of the votes, the president can veto the action, which can lead to the dissolution of the chambers and the calling of early elections. The Constitution provides for the existence of a Permanent Commission, composed of four Senators and seven Representatives elected by the proportional system, each one designated by their respective Chambers. The Permanent Commission acts during the recess period of the ordinary sessions of the General Assembly. The headquarters of the General Assembly is in Montevideo, holding its sessions in the Chamber of Deputies premises of the Legislative Palace; the sessions of that Chamber are also held there, and the sessions of the Senate of the Republic are held in the same building (in a different premises). ===Judicial Branch=== The Judicial Branch is one of the branches of the Uruguayan State, whose main function is jurisdictional. The Judicial Branch is divided into Courts and Tribunals, having adopted the collegiate system for the higher bodies and the unipersonal system for the lower ones. The Judicial Branch also has its headquarters in Montevideo; the Supreme Court of Justice of Uruguay develops its activity in the building known as the Piria Palace. ==References== ==Other websites== * Constitution of Uruguay (all versions) - Parliament of Uruguay (in Spanish) Uruguay",
 "title": "Constitution of Uruguay"
}