{
 "id": "117311",
 "text": "Sir Syed Ahmed Khan (October 17, 1817– 27 March 1898) was a teacher and a politician. He was a philosopher as well. He was also a social reformer. Furthermore, he founded the school that would later become Aligarh Muslim University. In 1857, there was a rebellion in India. This is known as the First Indian War of Independence. During this time, Sir Syed Ahmed Khan kept loyal to the British; He also saved many European lives. After the rebellion, he wrote a book where he said the British were, in fact, those who caused the rebellion. To settle whether Sir Syed was a communitarian or a communalist, we need to assess the speeches and articles which he wrote. One such speech of Sir Syed, which he gave in Meerut in the year 1888, clearly shows that Sir Syed turned to arguments fielded by religious fanatics to develop a communal alliance between Indian Muslims and British Christians. He said, He was unhappy about the position of Muslims in India, as their social and economic status was declining. According to Sir Syed, Muslims had to bring a positive approach to the British and accept their ways of education. He wanted the Muslims to benefit from the British. To achieve this task, he had to bring about cooperation between the Muslims and the British. To accomplish this, he did the following things: *Wrote the loyal Muslims of India to prove that their community was not disloyal to the British and to ask the British to end their hostility. *Wrote a pamphlet “essay on the causes of the Indian Revolt” and pointed out the reasons for the outbreak of 1857. This pamphlet was circulated for free among the British officials. *Wrote Tabyin-ul-kalam to point out similarities between Islam and Christianity. *Established the British Indian Association. Sir Syed played a vital role in the educational uplift of the Muslims in India. He did the following things to improve the educational standards: *Set up a journal, Tahzib-ul-Akhlaq, which contained articles of influential Muslims who agreed with Sir Syed's approach towards education. *Founded scientific society in Ghazipur in 1863. *Opened school in Moradabad in 1859. *Opened school in Ghazipur in 1864. *Made a committee to raise funds for new schools. *Set up a Muhammadan Anglo-Oriental school in Aligarh on 24 May 1875. *Set up Muslim educational conferences in 1866 to raise the standards of education. Sir Syed also increased the political awareness of Muslims in the Sub-continent. At first, he believed in Hindu- Muslim unity, but later resolved to the two-nation theory. In 1885, the Indian National Congress was set up. It claimed to be the body of every Indian, regardless of religion. However, it later proved to be functioning only for the Hindus and tried to eradicate the Muslims. The Congress made three demands which were: #Political representation according to the population. This obviously meant Hindu domination as they were a dominant majority in India and Sir Syed opposed it. #Appointment in government should be by competitive examinations. Sir Syed opposed this because he knew that the educational standards of the Hindus were much better than the Muslims. #The next official language should be Hindi, replacing Urdu. Urdu had a special place in the Muslim hearts, and Sir Syed opposed this. The British accepted this demand. Sir Syed Ahmed Khan played a crucial role in improving the Muslim status. He worked tirelessly to restore relations between the Muslims and the British. He brought the Muslim revival through the Aligarh movement and showed the importance of education. Likewise, he brought an idea about the Two-nation theory and is hence known as “The Father of The Pakistan Movement” Category:1817 births Category:1898 deaths Category:People of British India Category:Politicians from New Delhi Category:Knights Companion of the Order of the Star of India Category:Teachers Category:Indian Muslims",
 "title": "Syed Ahmed Khan"
}