{
 "id": "117344",
 "text": "is a media franchise owned by The Pokémon Company. It is based on the concept of hatching, catching, playing with, staying with, befriending, defending, raising, trading, training and battling with hundreds of different monsters. The concept was made by Satoshi Tajiri, Pokémon's creator. Pokémon is represented in many types of media, most famously video games, a still-running anime series, manga, and a trading card game. There are eight regions in the Pokémon games. Although there are 1025 different Pokémon, most people will know of the mascot of the company, an electric Pokémon known as Pikachu. The video games have sold more copies than every other series except Nintendo's Mario series. == Video games == A number of Pokémon games have been released, mostly on Nintendo systems, with the exception of Pokémon GO as The Pokémon Company is owned by Nintendo. Most games are based on catching, training and battling Pokémon, and the player is a Pokémon trainer who does all these things. There are a number of aspects to the games. In the games, you can obtain one of three Pokémon from a Pokémon professor depending on the region. These Pokémon are called first partner Pokémon/starter Pokémon. All three of each regions starter Pokémon are Grass, Fire, and Water types. In the games, Pokémon are monsters that trainers catch (using various types of capture devices known as Poké Balls), train, battle, collect, and trade with each other. As of the ninth generation, there are 1013 of them. One of the most popular Pokémon in competitive battling is Mega Kangaskhan, because of its ability to hit the target twice with each move. Another Pokémon game is the famous Pokémon GO that can be played only on touch phones. It has a big difference from the other games but its basics are the same. This game uses Augmented Reality and the phone's GPS to give the player a very real sense of play. People walk around their neighbourhoods, explore new places and catch Pokémon which can be captured along with your surrounding environment by using the phone's camera. People can also go to special places or landmarks where there would be Poké Stops and Gyms which can be used to collect items, battle other Pokémon etc. This game has been a huge success when it was released and is widely considered as the beginning of the AR era. === Gameplay === The gameplay of the Pokémon series of role-playing video games involves the capture and training of many of fictional monsters called \"Pokémon\" and using them to battle other trainers. Each generation of games builds upon this idea by introducing new Pokémon, items, and gameplay concepts. Some of the general ideas were featured elsewhere before being introduced in the games; double battles appeared in the anime long before appearing in the games, and Pokémon abilities are similar to the Pokémon Powers first seen in the Pokémon Trading Card Game. == Anime == Not long after Pokémon Red and Blue (the first Pokémon video games) were released, a Pokémon anime was created. It was first shown in Japan in early 1997, and in the United States in late 1998. The anime started what has been called \"Pokémania\", which meant that after the anime came out, it became very popular among children, and many parents assumed it was a fad and no one would care about it in a couple years. However, it was never cancelled, and it is still running. The interesting thing about the Pokémon Anime is that when a new Pokémon game is released that is not a remake, the whole Anime focuses on that with new Pokémon and the world that is in that Pokémon game. The anime shows the adventures of Ash Ketchum, (with the exception of some special series) a ten-year-old Pokémon trainer who has many adventures, meeting many new people and Pokémon. His most famous Pokémon, and probably the most famous Pokémon, is Pikachu. A number of Pokémon films have also been made that relate to the anime. The first one was Pokémon: The First Movie (released in 1998 in Japan and 1999 in United States). There are more movies still being made. There have now been seventeen films released. == Trading card game == A Pokémon trading card game also exists. Players use Pokémon cards to battle each other and collect them by opening packs. There are also live tournaments hosted by Nintendo. Pokémon's damage is counted by \"damage counters\" or objects which are placed on the cards to keep track of damage. After you add up all of the numbers on the damage counters, you subtract it from the card's HP (health points) to find out how much HP is left. Only 60 cards are used in a player's deck, and six of these are set aside in a pile called \"prize cards.\" After one player knocks out an opponent's card, the defeater takes just one face-down prize card for non-EX Pokémon. Meanwhile, when someone makes an EX Pokémon faint, he or she gets two prize cards. There is one discard pile for each player, where fainted Pokémon go. Some ways to win are taking all of your prize cards, and/or making your opponent draw all of his or her cards. There are cards designed as various Pokémon, which usually need \"Energy\" cards to use attacks. There are also \"Trainer\" cards, which are used for additional things other than direct Pokémon attacks, like giving Pokémon more HP. Most fans of the series agree that a good deck is made of about twenty \"Pokémon\" cards, twenty \"Energy\" cards, and twenty \"Trainer\" cards. Players can evolve their Benched or Active Pokémon. The Bench is a spot that can hold Pokémon, and these Pokémon can be evolved with its evolution card. Active Pokémon can evolve too, but can also use attacks. To evolve a Pokémon, you can just put its evolution card on top of it. All Pokémon cards have types. The type affects how effective an attack is. For example, a certain Lightning-type Pikachu card can use an attack that normally deals 80 damage. If the Pikachu uses it against a Pokémon with a Weakness of +20 to Lighting, you add 20 more damage to the normal damage to make it 100. Types can also make things less effective. There is also a special kind of Pokémon in the trading card game called \"EX\" Pokémon. EX & GX Pokémon are stronger than regular ones, but when they are knocked out, the player's opponent draws two of their prize cards (with regular Pokémon it is just one.) Also, there is another special type of Pokémon in the trading card game called \"Delta Species\" Pokémon, which have types that are different than typical cards, like an Electric-type Charmander, who is usually Fire-type. In the \"Diamond & Pearl\" trading card game expansion, \"LV.X\" cards were introduced. These are a little like evolution cards, but they can only be used on Active Pokémon. In the \"HeartGold & SoulSilver\" expansion, The Pokémon Company released new cards, called LEGEND cards. LEGEND cards are two cards sold separately that when put together make one picture. They can be used only when the two cards they are made of are put together; they cannot work separately. == Criticism == The Pokémon media franchise, especially the anime, has been often criticized by organizations such as PETA. === Dennō Senshi Porygon === An episode of the anime called \"Dennō Senshi Porygon\" (\"Electric Soldier Porygon\" translated in English) was first shown in Japan on December 16, 1997. One part of the episode showed quick flashing red and blue lights. This caused 685 Japanese children to have epileptic seizures. Because of this, the anime went on a four-month break, and several laws were put in place regarding the flashing lights. Also, the previous episodes released had been toned down when Pokémon aired again. Porygon, one of the main characters in the episode, has not appeared again in the anime ever since \"Dennō Senshi Porygon\". It has two evolved forms, Porygon2 and Porygon-Z, and neither of them have appeared in the anime at all, even though it was Ash Ketchum's Pikachu that made the explosion that caused the flashing lights. An episode of The Simpsons called \"Thirty Minutes Over Tokyo\" made fun of \"Dennō Senshi Porygon\", as well as an episode of South Park called \"Chinpokomon\". === Jynx === Jynx, a species of Pokémon, was criticized because it looked like it was using blackface (an old film-making technique that makes white actors look African-American).Buffa, Chris. Top 10 Weirdest Looking Pokemon . GameDaily.com. Retrieved on June 13, 2009. It was also criticized because it looked like a drag queen (a man who dresses as a woman). This was not an issue in Japan, but it caused a lot of argument in the United States because of the United States' history of racism. Ever since then, Jynx has purple skin instead of black skin, and anime episodes featuring it were banned due to argument. === Game censorship === In Pokémon Diamond and Pearl, the Pokémon Registeel had its sprite changed in some European versions, because its pose was too similar to a Nazi salute. Another Nazi-related censorship was the trading card Koga's Ninja Trick. In this card, there are various symbols, one of them being the swastika. The swastika symbol is used in some cultures and religions. However, it is also used as a symbol of Nazism. Because of this, the symbol was changed in the English and International versions of the trading card. === Apparent low quality === The newer Pokémon games have been criticized for being very similar and not making enough changes to the gameplay, along with various technical glitches and bugs becoming noticeable starting with Pokémon Sword and Shield. Because of this, some players have stopped playing Pokémon and moved to indie games that are also monster tamer games, as they are perceived as “better” and more innovative than Pokémon. Examples of said monster tamers include Temtem, Cassette Beasts, Coromon, and Palworld. == References == 5\\. Team GO Rocket arrival to Pokemon Go generated record breaking $110 million revenue in August -AndroidNature.com- August 2019 Category:1996",
 "title": "Pokémon"
}