{
 "id": "1173587",
 "text": "Vorokhta (Ukrainian: Ворохта, Polish: Worochta, Hungarian: Vorohta, German: Worochta) is a rural settlement in the Ivano-Frankivsk Oblast, Ukraine. It lies on the eastern side of the Northeastern Carpathians, in the Prut River valley, at an altitude of 850 meters above sea level. At the time of the 2001 census, its permanent population was about 3,800 people. The town and its surroundings are inhabited by the Hutsul ethnic group, and Vorokhta is often called the capital of Hutsul Land (Hutsulshchyna). It is located 25 km from Ivano-Frankivsk. == History == The town was formed in the 17th century on land that then belonged to the Polish Kingdom. After the first partition of Poland in 1772, it came under Austrian rule. In the second half of the 19th century, sports and tourism boomed in the Carpathians, including in and around the town. A major boost came from railway construction, which connected Vorokhta to the rail network in the summer of 1884. After World War I, the village belonged to Poland again, part of the Nadwórna District in the Stanisławów Voivodeship. In the 1930s, wealthy Polish citizens built several villas and guesthouses there. During the Polish Campaign, the Soviet Red Army occupied the town, so from 1939 to 1941, it was part of the Soviet Union. From 1941 to 1944, it was under German occupation. In the summer and early fall of 1944, units of the 1st Corps of the Royal Hungarian Army also fought in the area. Since 1945, it has belonged to the Ukrainian SSR, and from 1991, to Ukraine. == Tourism == Vorokhta is a popular mountain resort in Ukraine, both in winter and summer. In 1957, a ski school opened in the town, making it a key center for Soviet skiing at the time. Today, it is one of the main hubs for Ukrainian skiing. The surrounding mountains have several ski slopes and lifts, including Bukovel near Polyanytsya, which is Ukraine’s largest ski resort. The town is known for its Hutsul wooden architecture. Two Hutsul Greek Catholic wooden churches stand out. The older one, dating back to the 17th century, is dedicated to the Virgin Mary. It was originally built in Yablunytsia and moved to its current location in Vorokhta in 1780. Its wall paintings were added in the 19th century, and it was restored in 1979. The other, younger church, named after Saints Peter and Paul, was built in the early 20th century. Among the sights of Vorohta is the impressive railway viaduct over the Prut, which was built during the local railway construction in the 19th century. It was built of stone at the end of the 19th century. The Hungarian military cemetery in Vorokhta commemorates the battles fought by Hungarian soldiers in the Northeastern Carpathians during World War II. Located on the village outskirts near the ski jump, the cemetery holds Hungarian soldiers who died at the nearby No. 124 field hospital. In October 2004, a memorial plaque listing the names of the deceased was placed in the cemetery. ==References== Category:Settlements in Ukraine Category:Ivano-Frankivsk Oblast",
 "title": "Vorokhta"
}