{
 "id": "1173922",
 "text": "Göncruszka (Slovak: Gynecká Ruská; Hebrew: גנצרוסקה) is a village in Gönc District of Borsod-Abaúj-Zemplén County. Its population in 2024 was 672. == Location == It is located 60 kilometers northeast of Miskolc, in the valley of the Hernád River. The nearest town is Gönc, 4 kilometers north, and its two other neighbors are Hejce to the southeast and Vilmány to the south. == History == Göncruszka is a settlement from the 1200s. Its name was first mentioned in the Váradi Regestrum in 1220 as Vruzca, then in 1221 as Rvzka. Over time, the village’s name changed several times (Ruzka, Ruska, Wruzka, Kornis Ruska) before becoming Göncruszka in 1700. The first Jews settled in the area at the end of the 18th century. The community was founded at the beginning of the 19th century, and a synagogue was built here. There is still a cemetery here today. In 1944, after the Nazi occupation, all the Jews were taken to a ghetto Košice, and from there, they were sent to Auschwitz. The village’s population fluctuated between 1,200 and 1,500 people during the 19th and 20th centuries. In 1977, it was merged with the town of Gönc, leading to steady decline. It became independent again in 1991. == Population == In 2022, 83.8% of the population identified as Hungarian, 15.4% as Slovak, 8.2% as Roma, and 1.3% as other non-local nationalities (7.7% did not respond; due to dual identities, the total may exceed 100%). Regarding religion, 33% were Roman Catholic, 21.3% Reformed, 1.6% Greek Catholic, 0.2% other Christian, 0.3% Lutheran, and 3.8% non-religious (39.1% did not answer).Göncruszka == Resources == * Göncruszka's website * Uzonka Bojtorné Toókos: Göncruszka, monuments ; TKM Association, Bp. , 1992 ( Small library of landscapes, eras, museums ) * Uzonka Toókos, the Bojtorné: Göncruszka. The history and social history of the village ; note. the Kazinczy Ferenc Society, Fony–Sátoraljaújhely, 2005 == Notes == Category:Villages in Hungary Category:Settlements in Borsod-Abaúj-Zemplén County Category:Gönc District",
 "title": "Göncruszka"
}