{
 "id": "1173105",
 "text": "\"Only Happy When I Rains\" is a 1995 song by alternative rock band Garbage. It was taken from their debut studio album Garbage. It went to number 55 in the United States, number 29 in the United Kingdom, number 79 in Canada, number 80 in Australia, number 38 in New Zealand, number 36 in the Netherlands, number 27 in Scotland and number 6 in Iceland. ==Track listings== Continuing their theme of collectible 7-inch vinyl releases, which had seen \"Vow\" packaged in an aluminum sleeve and \"Subhuman\" in black rubber, Mushroom packaged the 7-inch format for \"Only Happy When It Rains\" in a \"Prismaboard\" (rain-effect) die-cut card sleeve, with a hologram logo sticker on the inner jacket. The B-side of the vinyl was pressed with a double-groove, so that either \"Girl Don't Come\" or \"Sleep\" played depending on where the stylus landed; the songs were shorter on the vinyl than they were on the CD or cassette formats to accommodate both on one side of the disc. This pressing was limited to 5,000 copies. The original design for the vinyl was for the sleeve to be made from wood, or corrugated cardboard, with wing-nuts in each corner like a flower- press. The nuts were meant to be unscrewed to find the vinyl disc inside - between ten layers of different types of cardboard. *UK 7-inch single # \"Only Happy When It Rains\" – 3:58 # \"Girl Don't Come\" – 2:03 # \"Sleep\" – 1:41 *UK CD and cassette single # \"Only Happy When It Rains\" – 3:58 # \"Girl Don't Come\" – 2:33 # \"Sleep\" – 2:11 *US CD and cassette # \"Only Happy When It Rains\" - 3:58 # \"Girl Don't Come\" - 2:33 # \"Sleep\" - 2:11 *Australian CD and cassette single # \"Only Happy When It Rains\" - 3:58 # \"Driving Lesson\" - 3:47 # \"Dog New Tricks\" (The Pal Mix) \\- 4:05 *European CD maxi # \"Only Happy When It Rains\" - 3:58 # \"Dog New Tricks\" (The Pal mix) \\- 4:03 # \"Stupid Girl\" (Red Snapper mix) \\- 7:37 # \"Queer\" (Danny Saber mix) \\- 5:40 *European CD single # \"Only Happy When It Rains\" - 3:58 # \"Dog New Tricks\" (The Pal mix) \\- 4:03 ==References== Category:Alternative rock songs Category:Electronic rock songs Category:1995 songs Category:Garbage (band) songs",
 "title": "Only Happy When It Rains"
}