{
 "id": "117313",
 "text": "{{Infobox writer | name = Mirza Ghalib | native_name = | birth_name = Mirza Asadullah Beg Khan | image = Mirza Ghalib photograph 3.jpg | caption = Ghalib in 1868 | pseudonym = | birth_date = | birth_place = Kala Mahal, Agra, Maratha Confederacy | death_date = | death_place = Gali Qasim Jaan, Ballimaran, Chandni Chowk, Delhi, British India | occupation = | movement = Urdu movement | parents = Mirza Abdullah Baig (father) Izzat-ut-Nisa Begum (mother) | notablework = Diwan-e-Ghalib | citizenship = | years_active = | language = Urdu, Persian | period = Mughal era British era | genre = Ghazal, Qasida, Ruba'i, Qit'a, Marsiya | subject = Love, philosophy, mysticism | spouse = | resting_place = Mazar-e-Mirza Ghalib Tomb Near, Nizamuddin Dargah, Delhi }} Mirza Ghalib born Mirza Beg Asadullah Khan , pen-name Ghalib ġhālib means \"dominant\") and Asad Asad means \"lion\") (27 December 1796 — 15 February 1869), was a great classical Urdu and Persian poet of India. Most notably, he wrote several ghazals during his life, which have since been interpreted and sung in many different ways by different people. He is considered to be the most popular and influential poet of the Urdu language. ==Early life== He was born in 1796 in Agra, India (then under the rule of the Mughal Empire). His father was Mirza Abdullah Beg Khan and his uncle was Mirza Nasrullah Beg Khan. His father Mirza Abdullah Beg Khan was an important Mughal noble who was prominent in the Mughal court. Mirza Ghalib become orphaned when he was just 5 years old. He lived with his uncle for 4 years, when his uncle too died. He started saying sher in Agra itself. He married the daughter of Nawab Ilahi Baksh 'Maaroof' and therefore moved to Delhi, India. In Delhi he devoted his full concentration to poetry. Soon he mastered the Persian language. So that no one should call him be-ustad ( without a teacher) he fabricated a story that he had an Iranian teacher Abdul Samad who lived in house for two years to teach him Farsi. Ghalib was always proud of his Farsi poetry but he is known more by his Urdu prose and poetry. ==Later life== He always lived his life lacking money. After 1857 the support from the Royal durbar stopped. The pension from the British Government was stopped because he was suspected of supporting the rebels. He even travelled to Calcutta to restart the pension but to no avail. He went to the Nawab of Rampur, who promised him Rupees 200 if he lived in Rampur and Rs. 100 if he lived anywhere else. His pension was resumed 3 years after that, but all that money was used up for paying old debts. Ghalib died in 1869. ==Letters== Not only Urdu poetry but the prose is also indebted to Mirza Ghalib. His letters gave foundation to the easy and popular Urdu. Before Ghalib, letter writing in Urdu was highly ornamental. He made his letters \"talking\" by using words and sentences as if he is talking to the reader. According to him \" from hundred of miles talk with the tongue of the pen and enjoy the joy of meeting even when you are separated\". His letters were very informal, some times he will just write the name of the person and start the letter. He himself was very humorous and also made his letter very interesting. He said \"I want to write the lines that whoever reads those should enjoy it\". When the third wife of one of his friends died, he wrote. .\"Allah Allah, there are some among us who have been freed from the prison three times and I have for the past 50 years this rope around my neck neither this rope breaks nor it takes my life\" Some scholars say that Ghalib would have the same place in Urdu literature even only on the basis of his letters. ==Poetry== In Urdu ghazals, along with the love and beauty Ghalib added all the facets of life. Because of him the canvas of Urdu ghazal became very extended. Since Ghalib was very occupied with Persian, his earlier shers used difficult words and his flights of imagination was such that...\"either you (Ghalib) understand or the God (Khuda) understand\". Ghalib was not a philosopher but he questioned things around him. \"when there is no one besides you; then oh God why is this pandemonium?\" One also find naughtiness in his writings, he makes fun of every thing and everybody including himself. \"So that the enmity with wine and honey continue, somebody put heaven into hell!\". \"Why not merge hell with heaven, O Lord!, some more land, for strolling, be it!\" Another thing visible in his poetry is his secular outlook, \"Wafadaari ba shart e ustuwaari asl e imaa.n hai, Mare jo butkhaane me to gaaDho kaaba me brahman ko\" That is, Constant loyalty is the foundation of faith. If the Brahmin dies while praying in temple, he should be burried in the Kaaba. But Ghalib's sher not only have immediate effect on the heart but it makes you think too. ==References== Tarz-e-Nigarish \"طرز نگارش\" By Dr Abdul haq ==Other websites== Category:1796 births Category:1869 deaths Category:19th-century Indian poets Category:Urdu poets",
 "title": "Mirza Ghalib"
}