{
 "id": "1173482",
 "text": "Sergio Pablos is a Spanish cartoonist and Animator. Pablos was born in Madrid in 1970. In 1988, he went to Art School in California. After graduating in 1992, he got a job working for Hanna-Barbera. He drew blue gemstones for the movie Once Upon a Forest. He then moved to Paris and drew for an episode of a French television cartoon. Pablos then got a job working for one of Disney Television Animation’s studios in France. Pablos drew Paris for A Goofy Movie and also drew some characters. Pablos then worked on the Mickey Mouse cartoon Runaway Brain. He then started working for Walt Disney Animation Studios in Burbank, California. Pablos worked on drawing Claude Frollo for The Hunchback of Notre Dame and Hades in Hercules. Then Disney put him in charge of drawing Tantor the Elephant in Tarzan and Dr. Delbert Doppler in Treasure Planet. ==Work for Pixar, DreamWorks and DisneyToons== Pablos worked on Toy Story for Pixar and then helped DreamWorks Animation with its movies Antz and The Prince of Egypt. He also worked for DisneYToons Studios on sequels to Tarzan and to The Fox and the Hound. After helping make the movie Stuart Little 3:Call of the Wild and an Asterix movie, Pablos went back to Pixar and worked on Cars. He also worked on Cars’ spin-off movie Planes and its sequel Planes:Fire and Rescue. == SPA Studios == Pablos went back to Spain and started his own studio called SPA which worked on the movie Nocturna and a short horror movie called Alma. He also had the idea to make a movie about a supervillain who wants to take over the world because “it’s in his nature to be bad” and call it Evil Me. == Despicable Me == Pablos drew the main character in Evil Me to look like a Vampire. He also drew him popping kid’s balloons, freezing people so he wouldn’t have to stay in line for coffe and stealing things. Pablos named the villain Groo because the name sounded evil. Pablos wanted there to be characters who were as nice as Groo was mean, so he drew three Girl Scouts. Pablos thought it would be funny if Groo had to be a father to the three girls so he drew Groo adopting the girls and having no idea how to be a parent. Pablos wrote a story about Groo adopting the girls so that he could use them for his evil plan but then starting to love them and becoming nicer. Pablos then went to Chris Meledandri and convinced him to make Evil Me a movie. So Meledandri made it into a movie called Despicable Me. == References == Despicable Me Origin SPA Studios Category:Spanish cartoonists Category:People from Madrid Category:1970 births",
 "title": "Sergio Pablos"
}