{
 "id": "1173792",
 "text": "Tarusa () is a city in Kaluga Oblast, Russia, located on the left bank of the Oka River, 70 km northeast of Kaluga. ==Etymology== The name is from that of Tarusa River, a tributary of Oka. ==History== Tarusa is known to have existed since 1246. In the 16th century, it was fortified with ramparts and trenches in defense against the Crimean Tatars and Nogai Horde. Soviet power in Tarusa was established on 27 December 1917. In the following years, all the town's churches were closed and a monument to Joseph Stalin was erected on the central square. During World War II, German troops approached Tarusa and took it on their way to Moscow. The town was occupied by the Germans between October 24 and December 19, 1941. After that, the town was retaken by the Red Army which crossed the Oka River in winter under the German fire and attacked the German strongholds on the higher bank of Oka. Remnants of the town's fortifications and the town wall can still be seen today in the community park near the Peter and Paul Cathedral. During the Soviet period, Tarusa became the place where many dissidents and people repressed by the Soviet authorities used to settle. Tarusa became the home place for such famous dissident figures as Anatoly Marchenko, Larisa Bogoraz, Gleb Yakunin, Pavel Litvinov, Alexander Ginzburg, Andrey Amalrik, Sergei Kovalev, Zoya Krakhmalnikova, Lev Kopelev, and Frida Vigdorova. The book Tarusa - the 101st kilometer by Tatyana Melnikova is devoted to the lives and fates of the dissidents who lived in Tarusa. In 1961, writer Konstantin Paustovsky and poet Arkady Steinberg fought to publish the famous Tarusa Pages, which became the only book in the Soviet Union which escaped Moscow-based central party censorship and offered its pages for various free-thinking and dissident writers. After the book was published, it was declared ideologically harmful and removed from all bookstores and libraries. The director of the Kaluga publishing house was reprimanded, the editor-in-chief was fired, and other repressions were to follow. It was only Paustovsky's personal appeal to Nikita Khrushchev that stopped the wave of planned repressions. Nevertheless, the Tarusa Pages became a significant and meaningful event in the Soviet literature. The book introduced to the public such authors as Bulat Okudzhava, Vladimir Maksimov, Frida Vigdorova, Nadezhda Mandelstam, and Naum Korzhavin, who enjoyed immense popularity in the later years. ==Culture and Art== Since to its position on the grande Oka river and prolific art life and many talented painters traditionally settled and working in Tarusa, the city bears the second unofficial name of the “Russian Barbison on Oka river”. The town has a number of popular museums—the Tarusa Regional Museum of Local Lore and the Tsvetayevs Family Museum. It is also home to the Tarusa Town Picture Gallery, which is a branch of Kaluga Regional Museum of Art, boasting a rich collection of such classic Russian artists as Boris Kustodiev, Nikolay Krymov, Ivan Aivazovsky, Lev Lagorio and Vasily Polenov. During the XX century, Tarusa became the center of progressive avant-garde painters who wanted to embrace the lessons of Picasso, Braque and Kandinsky, the most notable persons are Boris Sveshnikov, Valentin Vorobyov, Eduard Steinberg, Jury Zheltov, Igor Vulokh, Ülo Sooster, Eduard Gorokhovsky, Evgeny Rukhin, Boris Zhutovsky, Ivan Chuikov, Mikhail Roginsky. ==Economy== Tarusa has an Art Ceramics factory, a section of the Russian Space Research Institute, and a milk factory. ==Cemeteries== Tarusa has two cemeteries: the Old Cemetery and the New Cemetery. Writer Konstantin Paustovsky, sculptor Vasily Vatagin, Marina Tsvetaeva's daughter Ariadna Èfron, builder Sergey Krutilin, and writer Nadezhda Krandievskaya are buried in the Old Cemetery. ==Views of Tarusa== File:Tarusa Cathedral Main part.jpg|Tarusa Cathedral Main part File:Tarusa Wedding Hall.jpg|Tarusa Wedding Hall File:Tarusa Wedding Center in Old Mansion.jpg|Tarusa Wedding Center in Old Mansion File:Tarusa House in the center in Winter.jpg|Tarusa House in Winter File:Tarusa New School.jpg|Tarusa New School File:Tarusa Kaluga oblast Komarova street 1.jpg|Tarusa street in Winter == References == Category:Cities and towns in Kaluga Oblast",
 "title": "Tarusa"
}