{
 "id": "1173867",
 "text": "Hippolyta is a character from DC Comics, best known as the queen of the Amazons and the mother of Diana Prince / Wonder Woman. Based on the Amazon queen Hippolyta from Greek mythology, she first appeared in All Star Comics #8 in 1941, created by writer William Moulton Marston and artist H.G. Peter. == Overview == In the comics, Hippolyta is often portrayed as a strong and noble leader of the Amazons, a race of warrior women who live on the island of Themyscira (also known as Paradise Island). Depending on the storyline, her origins and the story of her interactions with the Amazons may vary, but she is frequently depicted as forging a peaceful and powerful society. Hippolyta plays a crucial role in Wonder Woman's life, having raised her from clay (in some versions of the story) or as a daughter born through divine means, depending on the comic continuity. As her mother, Hippolyta embodies both strength and wisdom, serving as a mentor and guide for Wonder Woman. As the queen of the Amazons, Hippolyta is often depicted as possessing superhuman strength, agility, and combat skills, on par with many powerful characters in the DC Universe. She embodies the ideals of justice, empowerment, and female strength. == In other media == Hippolyta's character has been explored in various ways across different comic storylines, animated series, and films. Her relationships with other characters, including the gods of Olympus and the superheroes of the DC Universe, add depth to her role. Hippolyta has appeared in various adaptations outside of comics, including animated series, theatrical films, and the DC Extended Universe, where she has been portrayed by actresses such as Connie Nielsen in the Wonder Woman films. == Themes == Overall, Hippolyta is an important figure in the DC Comics universe, representing strength, wisdom, and the ideal of female empowerment. Category:DC Comics characters Category:Fictional characters introduced in 1941",
 "title": "Hippolyta (DC Comics)"
}