{
 "id": "1173715",
 "text": "Quackerz is a 3D Russian animated film directed by Viktor Lakisov at the \"RIM\" studio. The film premiered on February 14, 2016, at the \"Oktyabr\" cinema in Moscow.http://www.kinometro.ru/photo/show/album/Kryak_premiere_7653http://www.kinometro.ru/photo/show/album/Kryak_premiere_7653 It was released in Russian theaters on February 18, 2016.https://www.kinometro.ru/release/card/id/21762#ru == Plot == Russian migratory ducks were flying to vacation in Hawaii, but they lost their way and ended up on a Chinese island where mandarin ducks live. Two groups of ducks end up in conflict. The children of the main characters want to bring their parents together. Arisha, the daughter of the Russian ducks' leader, and Nick, the son of the mandarin ducks' emperor, become friends. They must save all the ducks from an evil witch named Margo, who wants to destroy the sun. == Voice Cast == * Robbie Daymond as Longwayhttps://www.behindthevoiceactors.com/movies/Quackerz/ * Andrea Becker as Erica * Enn Reitel as Emperor Peng Lee * Micheal Gross as Commander Duckmus * Alanna Ubach as Ms. Knout * Bruce Nozick as Shina * Jesse Corti as Kianga * Jimmie Wood as Policeman * Joshua J Green as Old Servant == Production == The film was produced by the Moscow animation studio \"RIM,\" with involvement from studios in Canada, Spain, Peru, and Estonia. In May 2015, the film attracted interest from foreign buyers at the 40th International Toronto Film Festival.http://thr.ru/cinema/rossijskie-filmy-i-animaciu-uvidat-v-24-stranah- po-vsemu-miru/ A significant part of the budget was invested by the Chinese company Star Alliance Media, which planned a wide release in China covering five thousand theaters. \"Quackerz\" was the first Russian project to receive financial support from China.https://www.proficinema.com/news/detail.php?ID=204119 == Box Office == The film was released in Russian theaters on February 18, 2016, and grossed 90281394 rubles (1159684 dollars) in Russia and CIS countries. On July 15, 2016, the film was released in China and was shown in 7,000 theaters, earning $2.5 million in its first three days. == References == == Other websites == * * Quackerz at Imdb Category:Animated films about birds Category:Feature-length animated films from Russia Category:2016 computer animated films from Russia Category:3D films from Russia",
 "title": "Quackerz"
}