{
 "id": "1173897",
 "text": "Lake Omszk is an artificial lake in Hungary, located in Budakalász, Pest County, just north of Budapest’s border. Due to its proximity to the capital, it has been a popular recreational spot for decades. For a long time, it had a naturist beach, and various other recreational facilities and dining options have also been established along the lake’s shore. == Location == The lake is located east-southeast of the center of Budakalász. Its shape is roughly similar to a square, with its sides almost aligned with the four cardinal directions, except for a large indentation at the northwest corner. == History == The lake was created due to gravel mining from sediment deposited here by the Danube. Gravel extraction began in the 1960s, forming the lake’s basin. The mining pit was later filled not only by seeping groundwater but also by floodwaters from the Danube during the major flood of 1965. The lake’s water surface currently covers about 15 hectares, with an average depth of 3 meters and a maximum depth of around 8 meters. In the early years, the water quality was poor, mainly because untreated sewage was discharged into the lake from several places due to the lack of a proper sewage system in the streets. After the fall of communism in Hungary, the local government improved the water quality by building a sewage system, among other measures, and eliminating problematic sewage inflows. These actions proved effective, leading to a gradual improvement in the lake’s water quality. As the water quality improved, the lake became increasingly popular among residents of Budapest, locals, and people from nearby areas looking for recreational opportunities. Temporary and then permanent dining venues opened, and investments were made in sports and recreation facilities. In 2005, a wakeboard course was built in the southeastern part of the lake. Naturists took over the northern shore and the northern part of the eastern shore, and their presence was not only tolerated but accepted by the authorities for a long time: signs marked the boundaries of the designated areas for clothing-optional sunbathing and swimming, and for years, a mobile naturist vendor operated on the beach. Later, the attitude of the authorities changed, and naturists became unwelcome at Lake Omszk. == Fishing == Since its creation, the lake has also served as a fishing spot, with the first fish stocking “carried out” by the Danube flood of 1965. For a long time, the lake had no official fisheries manager, so it was considered a free water body. Although no one conducted fish stocking, it was still relatively easy to catch fish here. Most native and non-native fish species of Hungary can thrive in the lake, including a prized sport fish, the Largemouth bass. The lake is unique on a national level because the Largemouth bass successfully reproduces here. ==References== Category:Lakes of Hungary",
 "title": "Lake Omszk"
}