{
 "id": "1173989",
 "text": "Károlyfalva (German: Karlsdorf) is a former independent village in Borsod- Abaúj-Zemplén County. It has been part of Sátoraljaújhely since 1985. Its population in 2024 was 307. == Location == It lies in the Zemplén Mountains between Sárospatak and Sátoraljaújhely, 6.3 km southwest of the centre of Sátoraljaújhely. Nearby settlements are Rudabányácska, Makkoshotyka, Hercegkút, Sárospatak, Sátoraljaújhely. == History == In the early 1750s, German Prince Leopoldus Donatus Trautsohn bought the area. His son, John William Trautsohn, saw the emptiness and lack of workers, so he brought Germans from his lands in the Black Forest region of Germany to settle there. The settlers formed three villages in the area: Rátka, Hercegkút and Károlyfalva. The 16 families who founded Károlyfalva first stayed on the slopes of Somlyód Hill near Sárospatak. Later, they moved to a more sheltered spot under the mountains, where they cleared the forest and built houses. They were exempt from state taxes for 6 years and from landlord duties for 3 years, and they started farming on the cleared land. Each family received 15 acres of land and a meadow. By 1752, they had built a tavern and a shared baking oven, and in 1777, they built a church. In 1785, more families arrived from Germany. According to the census of 1784-1787, there were 233 people (113 women and 120 men) living in the village, in 42 houses. The inhabitants were engaged in arable farming, viticulture, animal husbandry and stone mining. In 1863, they built a school, and in 1877, they replaced the small wooden-towered church with a larger stone church. The village grew nicely, even though they faced many troubles: in 1890, phylloxera destroyed the vineyards, and locusts ruined the crops. Fires struck in 1891 and 1894. With national donations and insurance, almost the entire village was rebuilt. In 1898, they bought a bell for the church. The village’s growth was due to hard work, intensive farming, and being close to two towns where they could always sell their products well. In 1925, a shop was built. In 1936 and 1937, they bought forest land from Sárospatak, which the village worked on together. In 1936, a connecting road was built, linking Károlyfalva to Rudabányácska. In 1943, electricity was introduced. At the turn of the century, many people joined the national wave and emigrated to America, hoping to improve their finances. The world wars took their toll on the village: 13 people died in the First World War, and 18 in the Second World War. The front line passed through the village in December 1944. Parties were formed: the Smallholders’ Party, the Social Democratic Party, and the Communist Party. The new local council was made up of their members. In 1950, an independent council was established. A land claim committee was also set up, and land was distributed. In 1958, the residents’ taxes were used to build a council house. The building included a doctor’s office, and later the post office moved there too. The council house had a library, and on Sunday evenings, there were movie screenings. The large hall, with a small stage, hosted village events like dances, plays, meetings, and celebrations. In 1960, a local cooperative was formed with 120 members. They built a stable, plowed the fields together, bought two tractors, and planted vineyards. However, in the 1970s and 1980s, mostly only women stayed in agriculture. Most breadwinners worked in industry and services in nearby towns. The school closed step by step, and the children now study in Sátoraljaújhely. The school building became a kindergarten. The independent council ceased to exist in 1985 and the municipality became administratively part of the town of Sátoraljaújhely. This brought the development of infrastructure. The villagers set up a German minority self-government. The minority self-government works mainly to revive and preserve the national culture by running a dance group and a choir, and organizing cultural events. In 2001, the village celebrated the 250th anniversary of its settlement. == More information == * Facebook page of the village * Website about Károlyfalva * Károlyfalva Webiste * Károlyfalva at Pincefalvak.hu ==References== Category:Villages in Hungary Category:Settlements in Borsod-Abaúj-Zemplén County",
 "title": "Károlyfalva"
}