{
 "id": "1173251",
 "text": "Miles \"Tails\" Prower is a character created by Japanese game designer Yasushi Yamaguchi. Part of Sega's Sonic the Hedgehog franchise, he is the first character to consistently appear by Sonic's side in the series, appearing in nearly every mainline and spin-off game since his debut. His role as Sonic's best friend and sidekick is the same as Luigi from the Mario series. The name \"Miles Prower\" is a pun on \"miles per hour\", a reference to the famed speed of Sonic the Hedgehog. Prower is a two-tailed anthropomorphic fox cub, hence the nickname. Tails was inspired by a kitsune, a creature from Japanese folklore that could over time grow multiple tails. Tails made his debut in November 1992 in both the 8-bit Sonic the Hedgehog 2 for the Sega Master System & Game Gear, and the separate but identically-titled 16-bit game Sonic the Hedgehog 2 for the Sega Genesis / Mega Drive. == Characteristics == The character of Tails is portrayed as a very sweet-natured, gentle, kind, comforting, and humble fox. As a longtime friend, he admires Sonic and dreams of being just like him. He wants to prove that he can be counted on, and has fought Dr. Eggman and his robots without the aid of Sonic before. He is fond of mint candy. Despite overcoming most of his fears and becoming very bold, Tails remains keraunophobic. Tails is not intended to be a selfish character and instead, is always ready and willing to help others without asking for anything in return. == Reaction == Tails has received widely positive reaction. He was awarded \"Best New Character\" in Electronic Gaming Monthly's 1992 video game awards, stating \"Not only is he as cute as Sonic, but he serves a major purpose in the game.\" IGN editor Lucas M. Thompson listed Tails as one of the Sonic the Hedgehog characters who should be in Super Smash Bros. Brawl, citing his importance in the series and his abilities. == References == Category:Sonic the Hedgehog characters",
 "title": "Tails (Sonic the Hedgehog)"
}