{
 "id": "1173097",
 "text": "RTM TV1 (stylised as tv1) is a Malaysian free-to-air public television channel owned and operated by Radio Televisyen Malaysia, a broadcasting department of the Malaysian Government. Launched on 28 December 1963, TV1 is the first and oldest TV station in Malaysia. The channel features mostly news, talk shows and documentaries and some in-house, local and international kids, drama and sports programming. ==History== ===Setup=== Speaking at his return from the Commonwealth Broadcasting Conference in New Delhi on 13 February 1960, Mr. A. T. Read said that television would soon come to Malaya, and that the existing network of microwave transmitters, with adequate modifications, would be used for television transmission. A 1963 target was set on 8 January 1962. On 8 May 1962, Mohamad Sopiee announced that the first television station would be built in Kuala Lumpur, covering the states of Selangor and Negeri Sembilan. Initial projections aimed at the installation of 20,000 television sets, compared to 9,000 in Thailand and 4,000 in the Philippines. The radio and TV licences were going to be merged, as well as an allotment for a TV test survey and the arrival of two members of the Colombo Plan by the end of the year. Early in 1963, television experts from Canada assisted in the building of the national television service, aiming to build the Kuala Lumpur station within a year. The plan was budgeted at $10 million. Programmes were scheduled to start in December a one-channel service (Singapore had two channels under Malaysian rule) covering a radius of 15 miles from the capital. The service was planned to cover all of Malaya by June 1964, with a plan for two channels like Singapore. The British-owned Pye company had been given the contract to provide equipment to the then-upcoming television service in October 1963, namely a television transmitter and a film unit. ===Single channel years=== The prime minister of the time Tunku Abdul Rahman announced on 27 November 1963 that Televisyen Malaysia would start broadcasting on 28 December 1963. The station wasn't yet equipped with an outside broadcasting van, which was due to arrive in March 1964. Studio facilities were limited, and video recording facilities were due to start after the station would be on the air. Initially it broadcast from channel 10 in Kuala Lumpur before moving to channel 5 on 16 May 1964. The new transmitter was easily susceptible to ghosting. The pilot service opened on the appointed date with Tunku delivering a speech in a 30-minute ceremony. A staff union was formed on 25 March 1964. Broadcasts were extended to Ipoh and Malacca in April 1964 followed by Penang and Johor by July. For Johor, a sub-station at Bukit Treh, Muar was being built from April, costing $80,000. The plan was shelved within more than one month. In late April, work started for another relay station at Gunong Banang in Batu Pahat. The pilot service upgraded to a regular service on 6 July 1964. At the start of the pilot service the number of weekly hours of operation was 21, increasing to 25 in April 1964, and to 40 with the start of the permanent service. Broadcasts were now from 5:45pm to 11:15pm. On Saturdays, an extra period was added running from 3pm to 5pm. This increase also came due to a demand from the government to expand the programming offer. The news now started on the hour: Tamil at 6pm; English at 7pm; Mandarin at 8pm; Malay at 9pm. The increase in broadcast hours caused concern to parents, with one parent writing to the Straits Times (which Malaysian edition would be later spun off into the New Straits Times) that the earlier start damaged children's studies, suggesting the service to start at 8pm instead. Television Malaysia said that the schedule would remain as it was since the start of the month. With an increase of staff, Television Malaysia vowed to progressively increase the quality and variety of its programmes. After delays, the transmitter at Gunong Pulai was activated on 26 November 1964, broadcasting on channel 3, enabling Singapore to receive its broadcasts via overspill. Test broadcasts were conducted in late January 1965, but wouldn't become regular for a few more weeks. An educational television pilot project, forerunner of TV Pendidikan, started on 8 June 1965. There was also the possibility of bringing television to Sabah and Sarawak, as part of the First Malaysia Plan period, including the extension of the signal to the east coast of West Malaysia by the end of 1965. On 13 July 1966, the state of Sabah approved plans for the extension of the television service, specifically in Jesselton (Kota Kinabalu) and Sandakan. In July 1968, it was calculated that the new station would take $3 million to build. Following the purchase of the land to build the station, it was projected that it would be on the air by June 1969. Effective 8 February 1969, the channel expanded its daily schedule from Thursdays to Sundays to nine hours (3pm to midnight) in order to adjust to viewers in Johor, Kedah, Kelantan, Perlis and Terengganu where Thursday was partially a weekend in those areas. The east coast station in Kuantan was set to begin in May. As of then, the service in East Malaysia was still under consideration \\- at the time, plans for the Sabah station were outlined for it to begin operations in 1970, worth $10 million. ===1969–1984=== It was the nation's sole television channel until 1969 when TV2, then Rangkaian Kedua (Second Network) began its operation and the channel became known as Rangkaian Pertama (First Network). At the same time, Televisyen Malaysia merged with Radio Malaysia to form a single broadcasting department - Radio Televisyen Malaysia. One of the plans upon the launch of the second network was for the first network to broadcast exclusively in Malay. In 1973, it was suggested that English-language programming should be phased out in favor of increased local output, with the target being 60% for both channels. Television broadcasts extended to Kuala Terengganu on 16 August 1971. Colour tests started on both channels in early January 1978. RTM TV1 started broadcasting in colour since December 1978 in Peninsular Malaysia and 1980 in Sabah and Sarawak. In 1981, it was supposed that all programmes would have made the switch to colour by 1985. At the time, the output was 80 to 85% in colour. National broadcasts to Sabah and Sarawak start an hour early at 7:30 pm Peninsular Malaysia time on 7 May 1979. ===Post–1984=== According to a viewership survey carried by Survey Research Malaysia in October 1985, TV1 was seen by people in the rural areas with 2.532 million viewers compared to urban with 1.395 million. In late 1987, TV1 along with TV2 revamped their programming to compete with rival TV3 with movies, American serials and Chinese dramas. Public affairs programmes were planned to be included. Sign off time were now at midnight on weekdays and 1 am on weekends. A report by the United Malays National Organisation organ Merdeka suggested that foreign feature films screened on the network should be dubbed in Malay, per a suggestion to convert TV1 to an all-Malay network. In local variety shows, all songs, regardless of ethnic background, would be performed in Malay. In the wake of the report, TV1 switched to an all-Malay channel in stages, beginning 31 August 1987 with the move of RTM's English news broadcast to TV2 and expected to be completed in late 1987. Programmes in English would also move to TV2. The purpose of the switch is to promote the use of Malay as a national language. The amount of Malay programming was increased to 72% instead of 55% previously. RTM had plans to introduce separate primetime news programmes for TV1 and TV2 in 1991. At that time, TV2 simulcast TV1's 8 pm news. The Information Ministry believes that along with TV3's news, it would provide \"a wider range of information through the electronic media\" and \"keep viewers informed of developments\" from Malaysia and abroad. In July 1992, RTM decided that TV1's news will be on issues of national interest. TV1 went on non-stop broadcast in conjunction with Malaysia's 35 years of independence on 30 and 31 August 1992. In April 1993, TV1 and TV2 underwent news broadcast timeslot reschedulling. Starting in 1994, RTM revamp TV1 and TV2 programmes by airing religion, information and educational programmes in primetime slot. In March 1994, TV1 started full-time morning and afternoon broadcasts along with TV3, signing on as early as 5:50 am. Its programming included children's shows, cooking programmes, news broadcasts from BBC World Service Television (which would later be removed in May), Asia Business News, CNN, documentaries and business news. However, entertainment programmes were not aired in the daytime in which the then- Information Minister, Mohamed Rahmat said that it would \"contrary to a concept of creating the hardworking society\". TV1 ended airing Jendela Dunia as a result of CNN news broadcasts. The morning broadcasts cost an additional RM 18 million a year. In April 1995, TV1 and its sister channel, TV2 facing a disruption of broadcast transmissions for two hours due to power surge after Tenaga Nasional's cables went damaged. On 31 August 1995, TV1's prime time slot was extended to 10:30 pm, half an hour more than before. Its prime time starts at 7 pm. In conjunction with RTM's 50th anniversary on 1 April 1996, TV1 began 24 hour broadcast for the first time while its sister channel, TV2 began 18 hour broadcast. Most of the local programming on TV1 in 1998 were provided by Home Video Distributors (HVD), Wayang Tinggi and Eurofine. In April 1998, TV1 and TV2 decided to decrease transmission hours and save RM50 million in costs, with TV1 in particular losing one hour of its broadcast day; its sign on time now would be at 7 am. A similar proposal made in November 1998, meant to start in January 1999, was to \"cut operating costs\" and would save RM30 million. In April 2001, in conjunction with RTM's 55th anniversary, TV1 and TV2 underwent restructuring on their respective scheduling time to adapt with current situation. On 1 January 2003, TV1 and its sister channel, TV2 underwent programme reschedulling in order to \"give a satisfaction\" to its viewers and to attract its advertisers. The new scheduling saw both channels airing programmes in English. In August the same year, both channels went on to reschedulling their news broadcast. Upon RTM's new logo launching in August 2004, TV1 along with TV2 launches their respective new logo and image branding. In February 2005, TV1 and its sister channel, TV2 programmes began to aired on MiTV until the latter's shutdown in November 2006. On 1 April 2006, in conjunction with RTM's 60th anniversary, TV1 and its sister channel, TV2 rebranded again as RTM1 and RTM2. These names were first used in 1978 prior to 1990 rebranding. In 2008, TV1 along with its sister channel, TV2 gained the increasing of viewership ratings and revenue in the last six months. On 1 January 2009, RTM1 along with its sister channel RTM2 reverted to its old primary name, which has been used since 1990, and at the same time, their respective new logo was introduced. During its early years, it only broadcast in the evenings, with daytime broadcasts for schools under the TV Pendidikan banner from 1972 until 1 March 1994 when daytime transmission was introduced on the channel. TV1 transmits 24 hours a day since 21 August 2012 (the channel had first began trial broadcast 24 hours in 2005), more than 6 years after its sister channel did so (3 April 2006). TV1 and its sister channel, TV2 also airs programmes during the Hari Raya Aidilfitri celebration annually. On 1 April 2019, TV1 has started its HDTV broadcasting in conjunction of RTM's 73rd anniversary, and available exclusively through myFreeview DTT service on channel 101. ==Logo history== File:RTM1 1984 logo.png|TV1's first logo (1978–1987). File:RTM1 logo 1987.png|TV1's second logo (1987–1990). File:RTMTV1-1990.svg|TV1's third logo (1990–2004). File:Rtm tv1 logo 1996.png|(April 1996-3rd August 2004) File:RTM TV1 logo 1996 incomplete.svg|Incomplete version (April 1996-3rd August 2004) File:Rtm tv1 logo 2004.png|TV1's fourth logo (2004–2006). File:RTM1 logo 2006.png|TV1's fifth logo (2006–2008). File:Rtm tv1 logo 2009.png|TV1's sixth logo (2009–2011). File:RTM TV1 logo 2013.png|TV1's seventh and current logo (2011–present). ==Related pages== * TV2 (Malaysian TV network) ==References== ==Other websites== * * * * Category:1963 establishments in Malaysia Category:Television stations in Malaysia Category:Television channels and stations established in 1963 Category:Malay language television stations Category:Radio Televisyen Malaysia",
 "title": "TV1 (Malaysian TV network)"
}