{
 "id": "1174538",
 "text": "Chaakluk or Chakluk (; /chaak-look/) is a Meitei traditional dish. It is common among the Meitei people (alias Manipuri ethnicity) in Manipur, Assam, Tripura of Northeast India as well as in Bangladesh and Myanmar. == Etymology == The Meitei language term Chakluk () is made from two words: \"chak\" () meaning rice and \"luk\" () meaning cooked rice. Together, they refer to a rice platter served with different dishes. The word \"luk\" comes from \"luklen\" (), which was a rice meal served on a large round tray called \"lukmai\" () in ancient Kangleipak (early Manipur). == Types == There are two types of chakluk: vegetarian and non-vegetarian. == Vegetarian Chakluk == In medieval times, there was ban on meat and alcohol with the promotion of vegetarianism in Meitei civilisation. Worship of deities involved offering a rice platter called lairuk (derived from \"lailuk\", where \"lai\" means \"God\"), served on a special plate made from layers of banana leaves and bowls made of the same material. This included the offering of lairuk as part of the worship. Over time, the tradition of maintaining temples by offering lairuk spread to the general population. These temples prepared food, mixed with lairuk and shared it with the community. This shared meal became known as the \"Vegetarian Chakluk.\" Community feasting on vegetarian chakluk also became a part of Meitei life cycle ceremonies, both mourning and festive. == Serving == === Sitting Arrangement and Etiquette of Eating === Following the instructions of the arangpham, some men lay out chakluklaa (banana leaf plates). Once the plates are set, the cooks begin serving the food. When they reach the sagolhawai, they inform the host to invite the guests to take their seats. The host bows and asks the guests to sit down and enjoy their chakluk. This tradition is called chak takpa. There is a strict seating arrangement and etiquette for eating chakluk. An elderly respected male is asked to take the first seat. The elder's row is reserved for them, and there are separate rows for men and women. After the men are seated, women can take the remaining seats in the same row. The preferred seating position is cross-legged, but some people also sit in a squatting position, as it is believed to be beneficial for health. Chakluk is traditionally meant for an individual, and sharing is allowed only among children or between an elder and a child. Only after the person in the head seat begins to eat do others follow. == Uniqueness == Meitei chakluk has a unique style of serving sets it apart. There are specific rules about how chakluk is served, such as which dishes should be placed first, and where to position them on the plate—on the front, right side, left side, etc. Up until the dish of sagol hawai, the chakluk is served as a set meal. When this dish is served, the host performs chak takpa, inviting the guests to begin their meal. Once the guests are seated, the cooks serve the dishes in courses, following a set order. Dishes with gravy are served first, and towards the end, a sweet dish, is served, followed by fruit cooked with gravy. The meal concludes with the distribution of salt. The serving of chakluk combines elements of both Service à la française (where various dishes are served at the same time in an impressive display) and Service à la russe (where dishes are served in courses). This makes the Meitei chakluk different from the traditional dishes found in other parts of the Indian subcontinent, where all the dishes are served at once. The special rules followed when serving chakluk make it a unique tradition of the Meitei civilisation. == Aesthetic appeal == Many aspects of the Meitei people's aesthetic sense, such as phajaba (beauty), ichutaba (finesse), changkhonba (grace), and chunaba (appropriateness), are reflected in their culinary culture. == Banana leaves == Banana leaves are used to serve traditional chakluk. However, the design and style of the banana plates, called chakluklaa, and bowls, are uniquely Meitei. The plate is made in a distinct shape, which is not found elsewhere. == Ingredients == The way the dishes are served also has a special aesthetic appeal. === Four essentials === There are four essential dishes in any vegetarian chakluk: ooti, iromba, champhut, and mairen thongba. These four dishes represent a balance of colors—green, reddish, white, and bright orange—arranged around the white rice on the green banana leaf plate. === Complementary === Other dishes complement this presentation. The serving of chakhao (purple rice) at the end is particularly notable, with the white pudding served over the purple rice. === Prohibitions === Some ingredients such as garlic, onion, mushroom, etc., are not used in making Chakluk, specifically made to offer to deities. == Related pages == * Singju == Further reading == * A nook filled with Manipuri treats - Rice hotels attract foodies * Good and Plenty – The Meitei Chakluk == References == Category:Meitei food Category:Rice dishes",
 "title": "Chaakluk"
}