{
 "id": "1174274",
 "text": "Art And Animation Studio (AAA Studio) is a Czech film studio that produces animated films and was founded in 1990 as one of the first private studios in the Czech Republic. The studio was founded by the couple Dagmar Doubková and Jan Sarkandr Tománek, who are experienced creators of original animated films. They have won awards at film festivals in Chicago, Hiroshima, Bilbao, and Moscow. In 2005, the studio changed its legal form from an association of individuals to a limited liability company, which was established by their son, director and artist Jan Tománek. He made the Czech 3D animated films Goat Story and Goat Story 2 in 2008 and 2012. https://filmcommission.cz/cs/director/art-and-animation-studio/ https://www.csfd.cz/tvurce/17778-dagmar-doubkova/ For the feature film Goat Story 2, the studio developed the rendering program FurryBall, which was also purchased by film studios in Hollywood and game developers. Over more than 20 years, the studio has created many animated series and standalone films. https://pcworld.cz/ostatni/jak-se-vyrabi-film-kozi-pribeh-technicke-vybaveni- tvurcu-5858 https://pctuning.tyden.cz/hardware/graficke- karty/26570-gtc-2013-den-treti-aplikace-cuda-technologie?start=3 AAA Studio's films and some series can be seen on their official YouTube channel in many languages. https://www.youtube.com/channel/UCKcEYlZX9LgHpye8d5xg8ug Since 2022, the company has also started publishing books. == Films and Series == Year Title 2013 To si piš, je to myš! (TV series) 2012 Goat Story 2 – feature 3D animated film 2008 Goat Story – feature 3D animated film 2006 Hajadla (TV series) 1999 Dobrodružství pod vrbami (TV series) 1998 Kamarádi pana Semtamťuka (TV series) 1993 Balabánci (TV series) 1989 Medvěd 09 (TV series) == Gallery of Film Posters == File:Kozi pribeh.jpg|Goat Story File:Kozi pribeh 2.jpg|Goat Story 2 File:Jan Tománek, režisér, premiéra Kozí příběh.jpg|Jan Tománek – owner and director of the films == Books == * Válka se stromy (2022) – A bitterly parodic parable about the modern world that is increasingly falling apart. (ISBN: 9788011015268) * Průvodce králičí norou (2023) – Thirty-three easy-to-understand chapters on the important connections of the time we live in. (ISBN: 9788090899001) * Kozí příběh pověsti staré Prahy and Kozí příběh se sýrem (2023) – Books based on the most successful Czech animated film (ISBN: 9788090899025 and 9788090899032) == References ==",
 "title": "Art And Animation studio"
}