{
 "id": "1174132",
 "text": "«101st kilometer» — method of political repressions in the USSR in 1920-1980s. Certain people who were subjected to it were prohibited from dwelling in and around Moscow and Leningrad, the capitals of all the union republics (Kyiv, Minsk, Tashkent, Chisinau, Riga, Vilnius, Tallinn, Baku, Yerevan, Tbilisi, Alma-Ata, Ashgabat, Frunze, Dushanbe), in large cities (Novosibirsk, Sverdlovsk, Kharkov and so on), as well as in “closed” cities with a significant share of the defense industry (Sevastopol, Dnepropetrovsk, Kuibyshev), as well as within 120-km zone from the state border. These prohibitions meant they could neither defect to the West by crossing the state border, and were effectively excluded from all social, cultural and intellectual interaction with intelligentsia of the big cities, thus being doomed to the dumbest existence possible.Applebaum, Anne (2003). Gulag: A History. Doubleday. p. 446. ISBN 978-0-7679-0056-0. pp. 280–283 In accordance to the Soviet laws, all political prisoners after release from Gulag were subject to these restrictions. According to Article 58 of the Criminal Code of the RSFSR, all members of the families of repressed were subject for expulsion from Moscow and Leningrad and other big cities and might only live beyond «101st kilometer» zone.Stalin and the Kirov Murder. (1987) New York: Oxford University Press. ISBN 978-0195055795. pp. 320–323 After the death of Stalin in 1953 and the gradual release of miliions of political prisoners that followed, the men and women who were set free from Gulag were also automatically subject to «101st kilometer» zone restrictions. Only after Khrushev’s critique against Stalin in 1956, small cohorts of those formerly repressed individuals started receiving permissions to return to their former places of dwelling, many of thos already occupied by new tenants.A. Artizov, Yu. Sigachev, I. Shevchuk, V. Khlopov under editorship of acad. A. N. Yakovlev. Rehabilitation: As It Happened. Documents of the CPSU CC Presidium and Other Materials. Vol. 2, February 1956–Early 1980s. Moscow, 2003. pp. 84–86 During summer Olympic Games of 1980 “unreliable” individuals (so called “antisocial elements” - beggars, alcoholics and rowky) were also evicted from Moscow and Leningrad. == Scope of 101st km area == 101 kilometers were not interpreted strictly geometrically in the form of a circle within 101 km radius from the center on Red Square of Moscow. Some nearest towns where it was possible to live were either farther from that radius or maybe closer. Some of the notable towns close to Moscow where the dissdents might be getting permission to dwell included Aleksandrov - called the unofficial “capital of the 101st kilometer”, Tarusa, Orekhovo-Zuevo, Zaraysk, Balabanovo, Belousovo, Pokrov.Conquest, Robert (1973) [1968]. The Great Terror: Stalin's Purge of the Thirties (Revised ed.). London: Macmillan. ISBN 978-0-02-527560-7. pp. 120–126 In each case, the 101st kilometer area for the certain repressed was specified individually. For example, in the passport of one of the surveyed within Harvard project there was a ban on accommodation “in large cities, Caucasus and in any industrial areas of the USSR».Harvard University Refugee Interview Project. Schedule A, Vol. 9, Case 118 . — Cambridge, Mass.: Harvard University Russian Research Center, 1950. — P. 5. == Notable people subject to 101st km restrictions == * Arkady Steinberg - poet, translator, painter * Boris Sveshnikov - painter * Lev Razgon - writer, human rights activist * Larisa Bogoraz - human rights activist * Gleb Yakunin - priest, human rights activist * Andrey Amalrik - philosopher, human rights activist * Felix Svetov - religious dissident, human rights activist == In popular culture == * Song \"101st kilometer\" by the group \"Lesopoval\" * Song \"101st kilometer\" by Alexander Rozenbaum * Song \"Kilimanjaro\" by the group AveNue * Play \"Stars in the morning sky\" by Alexander Galin * Book “Kilometer 101” published in 2022 in English by Russian writer Maxim Osipov, formerly a cardiologist residing and working in Tarusa. Osipov, Maxim (May 16, 2022). \"Cold, Ashamed, Relieved: On Leaving Russia\". The Atlantic. Retrieved February 11, 2023 ==Gallery of 101st km towns and life there== File:Александров Вокзал Главная.jpg|Alexandrov Railway station File:Покров Храм.jpg|Pokrov main church File:Покров.jpg|Pokrov cityscape File:Tarusa House in the center in Winter.jpg|Tarusa House in Winter File:Tarusa Cathedral Main part.jpg|Tarusa Cathedral Main part ==References and sources== ;References ;Sources * Marina Tsvetaeva: The Woman, Her World, and Her Poetry (1985). Simon Karlinsky, Cambridge University Press p18 ISBN 9780521275743 * Applebaum, Anne (2003). Gulag: A History. Doubleday. p. 446. ISBN 978-0-7679-0056-0. * Karlinsky, Simon and Appel, Alfred (1977). The Bitter air of exile: Russian writers in the West, 1922–1972. p72 University of California Press ISBN 978-0-520-02895-1 * Fleishman, Lazar (1990). Boris Pasternak: The Poet and His Politics. Harvard University Press. ISBN 978-0-674-07905-2. * Slater, Maya, ed. (2010). Boris Pasternak: Family Correspondence 1921–1960. Hoover Press. ISBN 978-0-8179-1025-9. * Osipov, Maxim (May 16, 2022). \"Cold, Ashamed, Relieved: On Leaving Russia\". The Atlantic. Retrieved February 11, 2023. * Stalin and the Kirov Murder. (1987) New York: Oxford University Press. ISBN 978-0195055795. * The Great Terror: A Reassessment. (2008) Oxford: Oxford University Press. ISBN 978-0195317008. * Figes, Orlando (2007). The Whisperers: Private Life in Stalin's Russia. London: Allen Lane. ISBN 978-0713997026. * Fitzpatrick, Sheila (2017). On Stalin's Team : The years of Living Dangerously in Soviet Politics. Princeton: Princeton University Press. ISBN 978-0691175775. * Harris, James (2017). The Great Fear: Stalin's Terror of the 1930s. Oxford University Press. ISBN 978-0198797869. * Koestler, Arthur (1940). Darkness at Noon.[ISBN missing] * Solzhenitsyn, Aleksandr I. (1973). The Gulag Archipelago, 1918–1956: In Three Volumes. New York: Harper and Row. * \"The Scale and Nature of Stalinist Repression and its Demographic Significance: On Comments by Keep and Conquest\" (PDF). Europe-Asia Studies. 52 (6): 1143–1159. doi:10.1080/09668130050143860. PMID 19326595. S2CID 205667754. * A. Artizov, Yu. Sigachev, I. Shevchuk, V. Khlopov under editorship of acad. A. N. Yakovlev. Rehabilitation: As It Happened. Documents of the CPSU CC Presidium and Other Materials. Vol. 2, February 1956–Early 1980s. Moscow, 2003. * Colton, Timothy J. (1998). Moscow: Governing the Socialist Metropolis. Belknap Press. ISBN 978-0-674-58749-6. * Conquest, Robert (1973) [1968]. The Great Terror: Stalin's Purge of the Thirties (Revised ed.). London: Macmillan. ISBN 978-0-02-527560-7. * Hoffman, David L., ed. (2003). Stalinism: The Essential Readings. Oxford: Blackwell Publishers. ISBN 978-0-631-22890-5. * Lyons, Eugene (1937). Assignment in Utopia. Harcourt Brace and Company. * Merridale, Catherine (2002). Night of Stone: Death and Memory in Twentieth- Century Russia. London: Penguin. ISBN 978-0-14-200063-2. * Tzouliadis, Tim (2008). The Forsaken: An American Tragedy in Stalin's Russia. London: Penguin. ISBN 978-1-59420-168-4. ===External links=== * * * Category:1930s in the Soviet Union Category:1940s in the Soviet Union Category:1950s in the Soviet Union Category:1960s in the Soviet Union Category:1970s in the Soviet Union Category:Joseph Stalin Category:Dictatorship Category:Soviet Union Category:History of the Soviet Union",
 "title": "101st kilometer"
}