{
 "id": "1174728",
 "text": "Axel Kicillof (Born, September 25, 1971) is an Argentine economist, politician, teacher and researcher who has served as Governor of the Province of Buenos Aires since December 10, 2019. Previously, he served as Minister of Economy of the Argentine Nation between 2013 and 2015 and as a national deputy for the City of Buenos Aires between 2015 and 2019. In 2011, he was appointed by then-President Cristina Fernández de Kirchner to the position of Secretary of Economic Policy and Development Planning at the Ministry of Economy and Public Finance. He was deputy auditor of YPF until the passage of the Hydrocarbon Sovereignty Law and since June 2012, following the company's takeover by the national government, he served as a class \"A\" regular director. He also chaired the Planning and Strategic Coordination Committee of the National Hydrocarbon Investment Plan and was a member of the Executive Committee of PROCREAR. Since July 2009, he was CEO of Aerolíneas Argentinas and since 2011, deputy general manager. Kicillof speaks English and French. ==Biography== Kicillof is the second of three children born to psychoanalyst Daniel Kicillof and psychologist Nora Barenstein, both Ashkenazi Jews. He has two children, and is married to researcher and PhD in Literature Soledad Quereilhac. From 1984 to 1989, Kicillof attended the Colegio Nacional de Buenos Aires. From 1990 to 1995, he studied at the Faculty of Economic Sciences of the University of Buenos Aires (UBA). He graduated magna cum laude, receiving a Degree in Economics with a focus on the public sector. He was the top student in his class of 122. From 1997 to 2005, he pursued graduate studies at UBA, receiving a Doctorate in Economics. His doctoral dissertation, later published as a book, was titled Génesis y estructura de la Teoría General de Lord Keynes (Genesis and Structure of the General Theory of Lord Keynes). At university, Kicillof was a prominent student leader. He was the head of the student organization Tontos pero No Tanto (TNT, Spanish for Dummies but Not That Much) and was also a member of the Kirchnerist youth group La Cámpora, now headed by Máximo Kirchner. As a student leader, he was \"acclaimed by students like a rock star.\" From 1989 to 2001, he was an outspoken critic of neoliberalism in Argentina. ==References== Category:Argentine politicians Category:Living people",
 "title": "Axel Kicillof"
}