{
 "id": "1174389",
 "text": "Asaduzzaman Noor (born 8 August 1991), known as Asad Noor, is a Bangladeshi blogger and human rights activist living outside Bangladesh. He speaks for free speech and LGBT rights and has spoken against religious extremism in Bangladesh. The Bangladeshi government has charged him many times for blasphemy and hurting religious feelings. Noor has lived outside Bangladesh since 2019. He is in danger because Islamic extremists do not like his activism and how he exposes their actions. == Career == Noor started writing on blogs and social media in 2013. After joining the 2013 Shahbag protests, religious extremists targeted him. Since 2015, he has faced threats from both the government and extremists because of his human rights work. In July 2020, Noor posted videos about the harassment of Buddhist minorities in Rangunia Upazila, Chittagong District. Because of this, a local Awami League leader sued him on 14 July 2020 under the Digital Security Act for \"hurting religious feelings\" and \"spreading false information against the liberation war.\" One of Noor's videos showed a Buddhist statue being destroyed at a monastery under construction in Rangunia. He said forest officials and a local Awami League MP supported the attack to drive the monks away. After Noor's videos, local Islamic groups protested against him and said he was harming religious unity between Muslims and Buddhists. == Legal problems == On 25 December 2017, Noor was caught by airport police at Shahjalal International Airport while trying to leave Bangladesh. He was then sent to jail. Noor stayed in jail for eight months in 2018. When he got bail in August, an Islamic extremist group called Hefazat-e-Islam Bangladesh protested and asked for his death. Later, he was arrested again for a drug case, but he says it was fake. Karin Deutsch Karlekar, a director at PEN America, said: Daniel Bastard, head of Reporters Without Borders Asia-Pacific, said: In early 2019, Noor got bail again. Fearing for his life, he secretly left Bangladesh in February. Since then, he has lived in hiding outside Bangladesh and keeps posting on Facebook and YouTube. == Family harassment == On 18 July 2020, police in plain clothes took six of Noor's family members from his hometown, Amtali in Barguna. They were taken to the police station. There, police forced his father to call Noor and tell him to delete his Facebook videos. After this, human rights groups like Human Rights Watch, Amnesty International, Asian Human Rights Commission, and Robert F. Kennedy Human Rights spoke against this act. Sultan Mohammed Zakaria from Amnesty International said: \"Harassing Asad’s family is not just a one- time thing. It is part of a bigger problem of targeting families of activists living in exile.\" He also said: \"Using family members to silence activists outside Bangladesh is shameful. This must stop now.\" UN Special Expert on Freedom of Religion, Ahmed Shaheed, said: \"We are deeply worried about the punishment and legal action against Mr. Noor for using his human right to think, believe, speak, and express himself freely.\" In 2021, during a UN Human Rights Council meeting, Lillie Ashworth from Humanists International spoke about Noor’s case. She asked for justice and criticized Bangladesh for harassing Noor’s family. She reminded Bangladesh of its duty to protect human rights activists. On 1 February 2024, a Muslim taxi driver attacked Noor at midnight. After getting injured, Noor went live on Facebook to talk about what happened. He told his followers he was safe and thanked them for their support. Online, some Islamists celebrated the attack, and some even joked about rewarding the attacker. == References == Category:Living people Category:1991 births",
 "title": "Asad Noor"
}