{
 "id": "1174640",
 "text": "The 2025 Bahia Blanca floods was a natural disaster caused by a series of rainfall resulting from a storm that affected the Bahía Blanca district, located in the Province of Buenos Aires, Argentina. This event began in the first days on March 7, 2025, causing serious material damage, the evacuation of thousands of people and the death of 16 people. ==Overview== During the first week of March 2025, a series of intense storms began to develop in the southeastern region of the province of Buenos Aires. The National Meteorological Service had issued alerts for intense rainfall, but the magnitude of the event exceeded forecasts. In just a few hours, the city of Bahía Blanca received around 300 millimeters of precipitation, a volume equivalent to the annual average of rainfall in the region. ==Meteorological conditions== For several days before the event, a very humid and hot air mass from the Amazon dominated the center and north of the country. Instability levels remained high, and various disturbances swept through the area, causing severe weather. On March 7, 2025, thunderstorms began to develop in the early hours of the morning in central La Pampa Province, rapidly evolving into strong storms. As the hours passed, these storms continued to intensify, forming a line of instability. Around 3 AM, the line of instability began to slowly advance eastward-southeastward, entering Buenos Aires Province. Minutes before reaching the town of Bahía Blanca, the line of storms slowed its advance and continued to intensify, thus becoming a cloudburst. This storm system remained practically static over Bahía Blanca (and surrounding towns) around 4 AM, and for several hours, it continuously regenerated and intensified, leaving significant precipitation and thunderstorms. It wasn't until around 10 AM that this storm system managed to continue moving, now in an east-northeast direction. The video shows radar images. Green indicates light rain, yellow indicates moderate rain and thunderstorms, and red, fuchsia, and white indicates very heavy rain, hail, and strong or severe thunderstorms. The orange lines forming polygons are the successive short-term advisories issued by the National Meteorological Service, warning of the danger of the event. ==Development== On Thursday, March 6, the day before the storm, it was decided to suspend classes and Friday activities due to the weather alert for severe storms that was in effect. The rain began minutes before 4:00 a.m. on Friday, March 7, and civil defense began the evacuation of several families. Initially, the rainfall caused the city's main canals to overflow and the Napostá and Sauce Chico streams to rise. Numerous neighborhoods were completely flooded, with streets turned into rivers and homes submerged under water. The situation worsened due to the insufficient capacity of the urban drainage system and soil saturation from the previous rains. The Dr. José Penna Interzonal Hospital was particularly affected, with leaks in several wards and the evacuation of neonatal patients due to the influx of water. The lack of electricity and drinking water complicated the care of the injured and victims. ==Consequences== The storm left a tragic toll of at least 16 fatalities, including children and the elderly. Hundreds were also injured, and at least 1,450 people had to be evacuated. Many families lost their homes and belongings, and large sections of the city were left without basic services for several days. Access routes to Bahía Blanca were also affected, with collapsed bridges and traffic disruptions. Economic activity in the region, including the port of Bahía Blanca, suffered significant disruptions. The disaster generated a strong social and political backlash. Citizens and organizations demanded concrete measures to prevent future flooding, and shortcomings in urban planning and the authorities response were pointed out. ===Reconstruction of Bahía Blanca=== Several urban planning and climate change specialists explained that extreme weather events are becoming more frequent due to global warming, underscoring the importance of mitigation and adaptation strategies. The provincial government announced plans to review and strengthen the drainage system, as well as relocation measures for families living in high-risk areas. Meanwhile, international organizations offered support for the city's recovery and the development of resilient infrastructure. ===Disappearance of the Hecker Sisters=== Sisters Delfina and Pilar Hecker, ages 1 and 5, disappeared during the flooding that affected the area. That day, the sisters and their parents left their home in Bahía Blanca, intending to escape the flooding, and took Route 3 by car to go to the home of relatives in the town of Mayor Buratovich. The flood also reached the road, and the car stopped due to water leaks near the town of Cerri and called for help. Rubén Zalazar, who was driving a work van for the Andreani mail company, tried to help them and placed the sisters in the van, but moments later they were swept away by the current. Andreani's van was found on Saturday the 8th, and Zalazar was found dead on Sunday the 9th. The parents' car was also swept away by the current. The parents survived and searched evacuation centers for their daughters, but they were unable to find them. Buenos Aires Provincial police and firefighters searched for them using kayaks, on foot, and with drones, but were unable to locate the sisters. A reconstruction of the events was conducted, and the main hypothesis is that they were swept away by the sea. Finally, on April 6, Pilar Hecker's body was found at the Puerto Belgrano Naval Base. ==Reactions== * National Government: The federal and provincial governments declared a state of emergency and mobilized security forces and relief agencies to assist the victims. Evacuation centers were set up and food, drinking water, and basic necessities were distributed. Likewise, solidarity campaigns organized by institutions and citizens throughout the country were initiated. * Various organizations, such as the Argentine Army, the Red Cross, and non-governmental organizations, participated in the rescue and relief efforts.For its part, the local community organized to help those affected and contribute to the reconstruction of damaged homes and public spaces. * Lionel Messi, renowned national soccer player, sent his condolences to those affected through his Instagram account. ===International=== * : The Holy See Press Office announced that Pope Francis has been informed of the natural disaster that has struck the city of Bahía Blanca and has expressed \"his closeness to the affected people.\" In the message, which begins with Psalm 62, urging us to trust \"in God constantly,\" the prelates express their hope that \"God will grant you comfort and sustain us all in our courage to emerge from this situation together\". * : The Prime Minister of Italy, Giorgia Meloni, expressed her \"deepest condolences to the victims of the floods that hit several cities in Argentina\" on her X account. The Italian government renews its support for the Argentine authorities committed to the relief and assistance efforts for the affected population\". * : The Israeli Prime Minister, Benjamin Netanyahu, on his X account, referred to president of Argentina, Javier Milei as a \"dear friend\" and said: \"On behalf of all Israelis, I send my sincere condolences to you and to the families of those who tragically perished in Bahia Blanca (...)\" and ended with: \"The people of Israel are with Argentina in this difficult time\". * : President Volodymyr Zelenskyy lamented the flooding during a phone call with President of Argentina, Javier Milei concerning the Russia–Ukraine war. ==References== ==External links== * Category:21st century in Argentina Category:Natural disasters in Argentina",
 "title": "2025 Bahía Blanca floods"
}