{
 "id": "117445",
 "text": "Kirby Super Star Ultra is a remake of Kirby Super Star, a collection of side- scrolling platform video games for the Super Nintendo Entertainment System. It was made for Kirby's 15th anniversary. The game was released for the Nintendo DS in 2008. ==Game modes and plot== Kirby Super Star Ultra has every game that the original Kirby Super Star has, along with new games. The original games are: *Spring Breeze: King Dedede had stolen food from the people of Dream Land. Kirby goes to his castle to stop him. A traditional Kirby platformer. This game is like a smaller version of the first Kirby game, Kirby's Dream Land. *Dyna Blade: Kirby must stop Dyna Blade, a giant bird, from disturbing Dream Land's crops. This game has five levels, two secret levels, and a mini- boss level. This game also has a world map. *Gourmet Race: King Dedede challenges Kirby to a gourmet race. A racing game where the player goes against King Dedede in a race while also eating as many food as possible. *The Great Cave Offensive: Kirby fell off a cave and explores it, discovering treasure as he finds the exit. A Metroidvania game with 60 hidden treasures. Some treasures are from other Nintendo games. *Revenge of Meta Knight: Meta Knight is unhappy with the laziness of Dream Land's people. He plans to take over Dream Land with his flying battleship, the Halberd. A story-driven game focused on Kirby's attempts to stop Meta Knight. Each level has a limited time to complete. After completing a level, the Halberd takes damage. *Milky Way Wishes: The sun and moon are fighting. Marx, tells Kirby to travel through eight planets to restore the wish granting Nova and stop the sun and moon from fighting. Kirby cannot use copy abilities. Instead, he collects \"Copy Essence Deluxes\". These allow Kirby to use copy abilities at any time. *The Arena: A boss rush mode that where the player fights every boss in the game with only one life and a free selection of abilities at the start of the game. The player can heal up to five times, and are given two random abilities between boss fights. The new games are: *Revenge of the King: A traditional Kirby platformer. It is like Spring Breeze, but harder. *Meta Knightmare Ultra: Meta Knight prepares for the \"ultimate battle\". It is a game where you play as Meta Knight and control him through various actions on the touch screen. *Helper to Hero: A version of The Arena where the player takes control of the helper characters. *The True Arena: A version of The Arena which has the bosses from Revenge of the King. It also has a new boss called Marx Soul. *Sub-games: There are three new sub-games: Snack Tracks, Kirby Swipe, and Kirby on the Draw. They use the console's touch screen and can be played with up to four players. == References == Category:2008 video games Category:Kirby Category:HAL Laboratory games Category:Cooperative video games Category:Metroidvania games Category:Nintendo DS games Category:Video game remakes Category:Video games developed in Japan Category:Virtual Console games Category:Virtual Console games for Wii U",
 "title": "Kirby Super Star Ultra"
}