{
 "id": "1174657",
 "text": "Bayezid II or Bayezid ibn Mehmed was the 8th sultan of the Ottoman Empire from December 3rd 1447 all the way until his abdication in 26th of May 1512 to his son Selim I. His reign is remembered for his consolidation of his power including his reaction to Spanish and Aragonese treatment of both Muslims and Jews after the fall of the Emirate of Granada resettling them in Ottoman lands == Early Life == Bayezid II was born in December 3rd 1447 to Mehmed II and an albainan concubine called Gülbahar Hatun. During his childhood, his grandfather Murad II was still on the throne up until his death in 1451, when his father became the sultan. While there are some sources claiming that Bayezid was the son of Sittişah Hatun, this hasn't been fully confirmed. He was born in Demotika, Bayezid II was educated in Amasya where he later served as bey for 27 years of his life == Struggle for the throne == There was a struggle for the throne between Bayezid and Cem Sultan, who claimed the throne and sought out military assistance from the Mamluk Sultanate of Egypt.The Ottoman Grand Vizier,Karamani Mehmed Pasha, informed the ottoman prince of the death of his father inviting Bayezid to ascend to the throne. Later he defeated Cem's armies leading him to seek protection from the Knights of St. John in Rhodes. But he was eventually handed over to Pope Innocent VIII(1484-1492) the Pope's plan was to drive the turks out of Europe but this never happened and Cem soon died in Naples == Reign == Following his ascension to the Ottoman throne in 1481,he became a patron of western and eastern culture.He spent most of his tenure working hard to ensure a running of domestic politics, which soon gave him the title of 'the Just'. Though not remembered for this battles, he did put notable effort into conquering many territories including Venetian held Morea Category:1747 births Category:Ottoman Empire Category:Turkish monarchs Category:Ottoman people",
 "title": "Bayezid II"
}