{
 "id": "1174995",
 "text": "Komander (born December 15, 1998) is a Mexican masked luchador (professional wrestler). He currently wrestles for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH). Komander has also competed in Lucha Libre AAA Worldwide (AAA), Lucha Memes, MDA Lucha Libre, War City Wrestling, and Game Changer Wrestling (GCW). In AAA, Komander was a one-time AAA World Cruiserweight Champion and one-time AAA World Tag Team Champion with Arez. In ROH, he has been a one-time ROH World Television Champion. ==Career== ===All Elite Wrestling=== On March 1, 2023 episode of Dynamite, Komander made his AEW debut and participated in the Face of the Revolution ladder match but lost. At Supercard of Honor, he made his Ring of Honor (ROH) debut and challenged El Hijo del Vikingo for the AAA Mega Championship but lost. On the April 5 episode of Dynamite, Komander made his AEW singles debut in a loss to Sammy Guevara. On April 19, AEW owner and co-founder Tony Khan announced that Komander had signed a contract to become a member of the AEW roster. At Double or Nothing, he competed in the 21-man Blackjack Battle Royal for the AEW International Championship but Orange Cassidy won. On the June 30 episode of Rampage, Komander challenged Claudio Castagnoli for the ROH World Championship but the match ended in a referee's decision and a loss for him. On the August 2 episode of Dynamite, El Hijo del Vikingo & Komander challenged Aussie Open (Kyle Fletcher & Mark Davis) for the ROH World Tag Team Championships but lost. On the October 7 episode of Collision, Komanader once again challenged for the ROH World Championship against Eddie Kingston this time but lost again. On the January 26, 2024 episode of Rampage, Komander won a Freshly Squeezed Four Way Match to become the number one contender for the AEW International Championship. He challenged Orange Cassidy for the championship on the January 27 episode of Collision but failed to win. At Grand Slam, Komander teamed with Private Party (Isiah Kassidy & Marq Quen) to challenge the Death Riders (Claudio Castagnoli, PAC & Wheeler Yuta) for the AEW World Trios Championships but lost. At Final Battle, Komander won the Survival of the Fittest match to become the new ROH World Television Champion. == Footnotes == == References == ==Other websites== Category:1998 births Category:Living people Category:All Elite Wrestling people Category:Mexican professional wrestlers Category:People from Tamaulipas",
 "title": "Komander"
}