{
 "id": "1174325",
 "text": "Inter-Agency Research and Analysis Network (IARAN) is an organisation founded in 2012 that focuses on strategic foresight in humanitarian and development sectors. IARAN aims to support decision-makers in planning for the future. The organisation offers various services, including training, mentoring, coaching, and guidance to assist professionals in these fields with their strategic analysis and planning efforts.Inter-Agency Regional Analyst Network (IARAN) Complementing and Empowering Humanitarian NGOs == History == IARAN was established in 2012 as a collaboration between the Institut des Relations Internationales et Stratégiques (IRIS) and Save the Children International. The organisation was created to enhance strategic planning within the humanitarian system. In its initial years, IARAN collaborated with humanitarian agencies to develop tools for decision-making. In 2014, IARAN expanded its efforts by forming a partnership with Action Contre la Faim, which led to the development of anticipatory capacities in humanitarian work. In 2019, IARAN became an independent organisation that focuses on working with others to improve the humanitarian and development sectors. It is known for its forward-looking approach, which is important in a field often affected by crises and challenges. IARAN is one of the few organisation that uses foresight to help non-profit groups plan for the future. The organisation aims to promote long term thinking and change in humanitarian and development efforts. === The Future of Aid === IARAN's work includes offering advice on strategic foresight and planning to people in humanitarian and development fields, as well as creating its own research and development fields, as well as creating its own report titled \"The Future of Aid: INGOs in 2030. This report explores the humanitarian system discusses how the aid system might change by 2030 and how humanitarian and development actors should transfer to fit for the future. IARAN is running a participative consultation in 2025 to design and publish a new Future of Aid outlook for 2040: \"Future of Aid 2040. === Community of Practitioners === Since IARAN started, the organisation has been known for bringing together humanitarian and development professionals from aroung the world, who work with various organisation related to humanitarian and development efforts. In 2024, IARAN fellowship changed into a Community of Practitioners. This is an informal group where people can share their practices and experiences about foresight and innovation in humanitarian work. The community meets every three months to discuss their experiences. == Notable Publications == • In 2022, IARAN published Strategic Planning in the Humanitarian Sector. A Manual to Foresight and Futures-Focused Thinking, a book for humanitarian practitioners and policy makers with guidelines and facilitation tips for how to apply foresight and strategy in their work. 7 Leveraging years of experience in the humanitarian world, this book drwas extensive research and facilitation workshop experience in a step-by-step guide to implement an innovative toolkit of tested and refined methods seeking to increase anticipatory capacity and transformation in the humanitarian sector. • The Future of Financial Assistance (Future of Cash) is a report created by the CALP Network and IARAN. It is based on many years of research with different groups involved in humanitarian work, innovation, and future planning. The report describes four possible scenarios for financial assistance in 2030, the main factors that could affect these changes, and what these changes might mean for humanitarian efforts. • COVID-19 Scenarios for the Humanitarian Ecosystem is a report published with Oxfam. It looks at the COVID-19 crisis, which led to lockdowns to reduce the spread of the virus. The report discusses how this crisis affects the formal humanitarian system, especially for vulnerable groups, particularly in conflict areas. It highlights that women and healthcare workers are more affected and notes the economic problems caused by rising unemployment and global food insecurity. • The Prospective Study on Sahelian Realities 2030 (PRS 2030) was conducted between 2016 and 2017. The report focused on two main topics: evaluating the potential for economic integration and development in eight Sahelo-Saharan countries by 2030, which are Burkina Faso, Ivory Coast, Mali, Mauritania, Niger, Nigeria, Senegal, and Chad. It also aimed to identify challenges and opportunities for integration in this area. The project created four different scenarios to show possible futures for the region's integration and development.PROSPECTIVE DES REALITES SAHELIENNES 2030 RAPPORT FINAL THIERRY HOMMEL (DIR.) • A Global Outlook on LGBTI Social Exclusion through 2030 is a report that examines the hidden humanitarian crisis affecting LGBTI people worldwide. It uses strategic foresight to identify the main reasons for social exclusion and predicts how these issues may change by 2030, in line with the Sustainable Development Goals (SDGs) and the United Nations' \"Leave No One Behind\" agenda. The findings are intended to help with international planning, policymaking, national strategies, and advocacy efforts to promote LGBTI equality.A Global Outlook on LGBTI Social Exclusion through 2030 • An Outlook on Hunger: A Scenario Analysis on the Drivers of Hunger through 2030 is a detailed report that looks at the main trends and uncertain factors that will affect global hunger by 2030. It focuses on women's hunger and includes issues like economic inequality, population growth, climate change, and natural disasters.INVESTMENT COSTS AND POLICY ACTION OPPORTUNITIES FOR REACHING A WORLD WITHOUT HUNGER (SDG 2) == References == Category:Humanitarians Category:2012 establishments",
 "title": "IARAN"
}