{
 "id": "1174495",
 "text": "Omid Ali Nahvi (,born 1949 – died 2008) was an Iranian musician, composer, and music teacher. He was blind from childhood but became one of the most talented musicians in Iran. He played several instruments, including the piano, accordion, oud, mandolin, and guitar. He was also an important figure in revolutionary music after the 1979 Iranian Revolution. Nahi was the founder of the first music school in Isfahan province. == Early Life == Omid Ali Nahvi was born in Khomegin, Hamedan, Iran, in 1949. When he was five years old, he lost his eyesight due to measles. After this, his family moved to Tehran, where he studied music at Roudaki Music School for the Blind. There, he trained under famous Iranian musicians like Javad Maroufi, Hossein Ali Vaziri Tabar, and Houshang Zarif. == Career == After finishing his studies, Nahvi worked as a musician in Abadan Radio and the Iranian Oil Company. Later, in 1966, he moved to Isfahan, where he became the head of choir and solfège for the Iranian Scout Organization. He also started teaching music in Isfahan schools and worked with local theater groups. === Roudaki Music Academy === In 1965, Nahvi founded Roudaki Music Academy in Isfahan. This academy became one of the most important music schools in the city, training many students who later became famous musicians. == Role in Revolutionary Music == After the 1979 Iranian Revolution, Nahvi played a major role in revolutionary and patriotic music. He worked with the Basij (volunteer militia) and the Islamic Republic of Iran Broadcasting (IRIB) in Isfahan. He composed and played patriotic songs and anthems for the revolution and for children’s programs. == Death == In 2008, Omid Ali Nahvi died from a heart attack. Even after his death, his music school continued to operate, and his students carried on his musical legacy. Today, he is remembered as a great musician, teacher, and revolutionary artist in Iran. == References == == Other websites == * Shoorangiz Music Magazine Report of Omid Ali Nahvi Category:1949 births Category:2008 deaths Category:Iranian academics Category:Iranian composers Category:People from Hamadan",
 "title": "Omid Ali Nahvi"
}