{
 "id": "1174081",
 "text": "The Fall of Tenochtitlan was the final battle between the Aztec Empire and the Spanish Empire, led by Hernán Cortés. It happened on August 13, 1521, when the Spanish and their many native allies defeated the Aztecs and took control of their capital city, Tenochtitlan. This battle was one of the most important events in the Spanish conquest of the Aztec Empire and marked the beginning of New Spain. == Background == The Aztec Empire was a powerful civilization in central Mexico. It ruled over many smaller tribes and cities. The Aztecs were strong warriors, but their way of ruling was harsh. Many people in their empire did not like them because they had to pay high taxes and provide people for human sacrifice. This made it easier for the Spanish to find allies among the native people. In 1519, the Spanish explorer and soldier Hernán Cortés arrived in Mexico. He and his men wanted gold, land, and power. The Aztec ruler, Moctezuma II, was unsure of what to do. At first, he welcomed the Spanish into Tenochtitlan, but the Spanish wanted to take control. After some fighting, the Spanish were forced to leave the city in 1520 on a night called La Noche Triste (\"The Sad Night\"). Many Spanish and their allies died. However, Cortés gathered more soldiers and native allies, including the Tlaxcalans, who were enemies of the Aztecs. With these new forces, he planned to return and attack Tenochtitlan. == Siege of Tenochtitlan == The Spanish and their allies came back in 1521. They surrounded Tenochtitlan, cutting off food and water. The Aztecs, now led by their last emperor, Cuauhtémoc, fought bravely, but they had big problems. One major problem was smallpox, a deadly disease brought by the Spanish. It spread quickly and killed many Aztecs, including their previous leader. The Spanish also had better weapons, such as steel swords, guns, and cannons, while the Aztecs fought with wooden clubs and stone weapons. The battle lasted for months. The Spanish and their allies attacked from boats on the lake and destroyed the city’s bridges and causeways. The Aztecs could not get food or fresh water. Over time, they became too weak to fight. == Fall of the city == By August 13, 1521, the Aztecs could no longer resist. The Spanish captured Cuauhtémoc as he tried to escape. The city was in ruins, with thousands of dead Aztecs lying in the streets. Tenochtitlan, once one of the largest cities in the world, was destroyed. == Aftermath == After the fall of Tenochtitlan, the Spanish built Mexico City on the ruins of the Aztec capital. The Aztec Empire was gone, and the land became part of New Spain, a colony ruled by Spain. The Spanish spread Christianity and tried to erase most aspects of the Aztec culture. However, some parts of Aztec traditions, like their language and foods, survived and are still important in Mexico today. The fall of Tenochtitlan changed history. It marked the beginning of Spanish rule in the Americas and the end of one of the most powerful civilizations in Mesoamerica. == References == Category:Aztec Category:Colonialism Category:16th century in Spain Category:History of North America Category:Spanish Empire",
 "title": "Fall of Tenochtitlan"
}