{
 "id": "1174994",
 "text": "Simon James Kippen (born 19 May 1992) is an English professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH) under the ring name Kip Sabian. He is a member of the The Patriarchy stable. Sabian has also wrestled in Ring of Honor (ROH) before it was bought by AEW. ==Career== ===All Elite Wrestling=== In February 2019, Sabian signed a contract with All Elite Wrestling (AEW). At Double or Nothing, Sabian made his AEW in-ring debut in a loss to Sammy Guevara. He also faced \"Hangman\" Adam Page at Fight for the Fallen but lost again. He began a feud with The Elite. He went on to face Kenny Omega on the December 10 episode of Dark and Cody on the January 29, 2020 episode of Dynamite but lost both times. Sabian announced that he and his real-life girlfriend Penelope Ford were going to get married and teased who his best man was going to be. The reveal was held on the 9 September episode of Dynamite and Miro was revealed as Sabian's best man. Sabian began teaming with Miro and they feuded with Best Friends. On the 28 April episode of Dynamite, the partnership between Sabian and Miro ended after Miro turned on and attacked him backstage. On the 24 August 2022 episode of Dynamite, Sabian made his return to AEW after injury and attacked Pac. At All Out: Zero Hour, Sabian challenged Pac for his AEW All-Atlantic Championship but lost. At AEW Battle of the Belts V, Sabian challenged Orange Cassidy for the All-Atlantic Championship but lost. After a confrontation at Blood & Guts, Sabian began a feud with Nick Wayne and The Patriarchy. Sabian eliminated Wayne during the Royal Rampage match. On the 23 October episode of Dynamite, Sabian turned heel and saved Christian Cage from being attacked by Hook. Sabian officially joined The Patriarchy two weeks later. == Personal life == Kippen is married to fellow professional wrestler and AEW employee Penelope Ford. They got legitimately married at Beach Break on 3 February 2021. == References == ==Other websites== Category:1992 births Category:Living people Category:All Elite Wrestling people Category:British YouTubers Category:English professional wrestlers Category:Sportspeople from Norfolk Category:Twitch (service) streamers",
 "title": "Kip Sabian"
}