{
 "id": "1174985",
 "text": "Gran Hermano is a reality show produced by the Argentine franchise Banijay, of the Dutch program Big Brother, created by John de Mol. It had eleven regular editions since 2001 and one edition with celebrities, first broadcast on Telefe until 2012, between 2015 and 2016 it was broadcast on América TV. In 2022 he returned to his original channel Telefe. It aired for the first time on March 10, 2001. The show consists of that for approximately five months, a group of participants will be isolated from society, without telephones or connections to the outside world, and will try to avoid the \"nominations\" made by themselves and overcome the eliminations that the audience periodically decides and thus win the final prize. ==History== Big Brother made its debut on Argentine television on March 10, 2001 on Telefe under the production of Endemol, who had created the format in the Netherlands. Argentina was the first Latin American country to produce the format, followed by Big Brother Brazil, Big Brother Mexico, Big Brother Colombia, Big Brother Ecuador and Big Brother of the Pacific (Ecuador, Chile and Peru). On March 3, 2022, the tenth season of the reality show was confirmed, which ended up returning to the Telefe screen for the second half of the year, thus marking the return to the channel after a decade. Officially the channel launched the announcement, promotion, and call on June 21, through Telefe Noticias and social networks. The program began on October 17, 2022. On December 7, 2023, the Chilean channel Chilevisión (owned by Paramount Global and sister channel of Telefe) announced the broadcast of the first chapter of Big Brother in Argentina that premiered on December 11 of the same year, which would go down in history for being the longest Argentine edition (6 months and 209 days in total) and the fifth longest of the entire franchise, only behind seasons 5, 6, 9 and 10 of Big Brother Germany. On December 2, 2024, the twelfth season began, with a prize of $70,000,000. == Series overview == === Episodes === == References ==",
 "title": "Gran Hermano"
}