{
 "id": "1174733",
 "text": "This is a list of movies, television specials, short movies, and digital series made by Illumination. ==Feature films== All films are co-produced and distributed by Universal Pictures, with the exceptions of Hop (co-produced with Relativity Media) and The Super Mario Bros. Movie (co-produced with Nintendo). ===Released=== Film Release date Director(s) Writer(s) Producer(s) Executive Producer(s) Composer(s) Animation service(s) Story Screenplay Despicable Me Chris Renaud Pierre Coffin Sergio Pablos Cinco Paul Ken Daurio Chris Meledandri Janet Healy John Cohen Sergio Pablos Nina Rowan Heitor Pereira (score) * * * Pharrell Williams (songs and themes) Mac Guff Hop Tim Hill Cinco Paul Ken Daurio Cinco Paul Ken Daurio Brian Lynch Chris Meledandri Michele Imperato Stabile John Cohen Christopher Lennertz Rhythm & Hues The Lorax Chris Renaud * * * Co-director: Kyle Balda colspan=\"2\" Chris Meledandri Janet Healy Audrey Geisel Ken Daurio Cinco Paul John Powell (score) * * * John Powell Cinco Paul (songs) Illumination Mac Guff Mac Guff Cinco Paul Ken Daurio Despicable Me 2 Chris Renaud Pierre Coffin Cinco Paul Ken Daurio Heitor Pereira (score) * * * Pharrell Williams (songs and themes) Illumination Mac Guff Minions Pierre Coffin Kyle Balda Brian Lynch Chris Renaud Heitor Pereira The Secret Life of Pets Chris Renaud * * * Co-director: Yarrow Cheney Cinco Paul Ken Daurio Brian Lynch rowspan=\"2\" Alexandre Desplat Sing Garth Jennings * * * Co-director: Christophe Lourdelet Garth Jennings Joby Talbot Despicable Me 3 Pierre Coffin Kyle Balda * * * Co-director: Eric Guillon Cinco Paul Ken Daurio Chris Renaud Heitor Pereira (score) * * * Pharrell Williams (songs and themes) The Grinch Scott Mosier Yarrow Cheney colspan=\"2\" Latifa Ouaou Audrey Geisel Chris Renaud Danny Elfman Michael LeSieur Tommy Swerdlow The Secret Life of Pets 2 Chris Renaud * * * Co-director: Jonathan del Val Brian Lynch Brett Hoffman Alexandre Desplat Sing 2 Garth Jennings * * * Co-director: Christophe Lourdelet Garth Jennings Dana Krupinski Joby Talbot Illumination Studios Paris Minions: The Rise of Gru Kyle Balda * * * Co-directors: Brad Ableson Jonathan del Val Brian Lynch Matthew Fogel Matthew Fogel Chris Meledandri Janet Healy Chris Renaud Brett Hoffman Heitor Pereira The Super Mario Bros. Movie Aaron Horvath Michael Jelenic * * * Co-directors: Pierre Leduc Fabien Polack colspan=\"2\" Chris Meledandri Shigeru Miyamoto Brett Hoffman Bill Ryan Yusuke Beppu Brian Tyler (score) * * * Koji Kondo (themes) Matthew Fogel Migration Benjamin Renner * * * Co-director: Guylo Homsy Mike White Benjamin Renner Mike White Chris Meledandri Joy Poirel John Powell Despicable Me 4 Chris Renaud * * * Co-director: Patrick Delage Mike White Ken Daurio Chris Meledandri Brett Hoffman Heitor Pereira (score) * * * Pharrell Williams (songs and themes) ===Upcoming=== Film Release date Director(s) Writer(s) Producer(s) Composer(s) Animation service(s) Production Status Story Screenplay Untitled The Super Mario Bros. Movie follow-up film Aaron Horvath Michael Jelenic colspan=\"2\" Chris Meledandri Shigeru Miyamoto rowspan=\"3\" Illumination Studios Paris Pre-production Matthew Fogel Minions 3 Pierre Coffin Brian Lynch Chris Meledandri Bill Ryan Additionally, an unannounced film is scheduled to be released on June 30, 2027. ===In development=== Title Notes Big Tree The Secret Life of Pets 3 Sing 3 Untitled Pharrell Williams film ==Short films== Title Release date Distribution/co-production with Animation service(s) Released with Note(s) Home Makeover Universal Studios Home Entertainment Mac Guff Despicable Me Home video release Orientation Day Banana Brad & Gary Universal Pictures Theatrical release Phil's Dance Party Universal Studios Home Entertainment Rhythm & Hues Hop Home video release Wagon Ho! Universal Studios Home Entertainment Dr. Seuss Enterprises Illumination Mac Guff The Lorax Forces of Nature Serenade Puppy Universal Studios Home Entertainment Despicable Me 2 Panic in the Mailroom Training Wheels Cro Minion Minions Competition Binky Nelson Unpacified Mower Minions Universal Pictures The Secret Life of Pets Theatrical release/Home video release Norman Television Universal Pictures Home Entertainment Home video release Weenie Gunter Babysits Sing Love at First Sight Eddie's Life Coach The Secret Life of Kyle Despicable Me 3 Yellow is the New Black Universal Pictures The Grinch Theatrical release/Home video release The Dog Days of Winter NBCUniversal Television Distribution Dr. Seuss Enterprises Trolls Holiday Television release The Grinch Home video release Santa's Little Helpers Universal Pictures Home Entertainment Super Gidget The Secret Life of Pets 2 Minion Scouts Minions & Monsters NBCUniversal Syndication Studios Minions: The Rise of Gru Television release/Home video release For Gunter's Eyes Only Universal Pictures Home Entertainment Illumination Studios Paris Sing 2 Home video release Animal Attraction Post Modern Minion Minions: The Rise of Gru Penglai Universal Pictures One and All Animation Studio Limited theatrical release Mooned Illumination Studios Paris Migration Theatrical release/Home video release Fly Hard Universal Pictures Home Entertainment Home video release Midnight Mission Benny's Birthday rowspan=\"2\" style=\"text-align:right;\" Game Over and Over Sing: Thriller Netflix Streaming release ===Compilations=== Title Release date Distribution/co-production with Animation service(s) Streaming service(s) Shorts included Minions & More 1 Universal Pictures Illumination Studios Paris Netflix Puppy, The Dog Days of Winter, Minion Scouts, Norman Television, Training Wheels, Love at First Sight, The Secret Life of Kyle, Weenie, Forces of Nature, and Santa's Little Helpers Minions & More 2 Mower Minions, Super Gidget, Yellow is the New Black, Eddie's Life Coach, Competition, Serenade, Cro Minion, Wagon Ho!, Binky Nelson Unpacified, Panic in the Mailroom, and Gunter Babysits ==Television specials== Title Release date Distribution/co- production with Animation service(s) Network(s) Shorts included Minions Holiday Special NBCUniversal Television Distribution Illumination Mac Guff NBC Santa's Little Helpers, Training Wheels, Puppy, and Minion Scouts ==Series== ===Web series=== Title Premiere date End date Network(s) Saturday Morning Minions Facebook Instagram Who's Who? TikTok YouTube Bones Story style=\"text-align:center;\" colspan=\"2\" ==Unproduced films== Title Description Emily the Strange Since 2000, Rob Reger has been trying to make a feature film adaptation of Emily. In 2005, Fox Animation went to make a live action/animated feature film, with Chris Meledandri and John Cohen producing it. Mike Richardson, of Dark Horse Entertainment, came on board as a producer in 2008. The same year it was unofficially reported that the film moved to Universal Studios' owned Illumination Entertainment, along with the studio's founders, Meledandri and Cohen. In September 2010, Universal Studios acquired the rights to the comic, and the actress Chloë Grace Moretz was cast in the role of Emily. Melisa Wallack, who wrote the script for Mirror Mirror, was hired to write the adaptation in the following year in August. Two months later it was confirmed that the film was indeed in the works at Illumination Entertainment. Kealan O'Rourke was brought to rewrite the film's script. By December 2016, Universal abandoned the project, and Dark Horse Entertainment and Amazon Studios were in negotiations to make an animated film. In October 2024, Warner Bros. Pictures Animation and Bad Robot announced their collaboration on a full-length animated feature based on Emily the Strange. The film’s screenplay is being developed by Pamela Ribon, as Bad Robot will produce the film, with Reger serving as executive producer alongside Trevor Duke-Moretz. Flanimals An animated feature film based on the Flanimals book series was in production at Illumination by April 2009. Series creator Ricky Gervais was set to be the executive producer and also lend his voice to the lead character, while Matt Selman (The Simpsons) wrote the script, but the project was later removed from the development schedule. Where's Waldo? In June 2009, Universal and Illumination acquired the rights to turn Where's Waldo? into a live-action film, was to be produced by Chris Meledandri with Classic Media's (now DreamWorks Classics) executive producer Eric Ellenbogen, but the project was later cancelled, after DreamWorks Animation bought Classic Media in 2012. Untitled cryptozoology film In December 2009, Illumination was producing an animated film based on a pitch by actor-comedian Jack Black and Jason Micallef on cryptozoology, which is the study of legendary creatures whose existence has never been confirmed (i.e. the Loch Ness Monster or Bigfoot). Black intended to produce the film alongside Ben Cooley and Chris Meledandri through his production company Electric Dynamite. Additionally, Black did not intend to provide a voice for the characters as he did with DreamWorks Animation's Kung Fu Panda. Curious George By July 2010, Illumination was developing a live-action animated film based on Curious George, with Larry Stuckey writing the script, but in November 2015 the film project was cancelled. Pluto In October 2010, Illumination Entertainment and Tezuka Productions jointly announced to develop a live-action/animated film of the Japanese manga series Pluto. The Addams Family In 2010, Universal and Illumination acquired the underlying rights to the Addams Family drawings. The film was planned to be a stop-motion animated film based on Charles Addams's original drawings. Tim Burton was set to co- write and co-produce the film, with a possibility to direct. By July 2013, the film was cancelled; had been made, this would have been Illumination's first stop-motion animated film. Eventually, Metro-Goldwyn-Mayer picked up rights to the film and an animated film was released in 2019, with Sausage Party directors Greg Tiernan and former DreamWorks Animation staff member Conrad Vernon to direct. Universal handled the international distribution rights for the film, as well as physical home media worldwide distribution rights. UglyDolls In May 2011, Illumination acquired the rights to Uglydolls to make an animated feature film, but the project never came to fruition. An animated film based on Uglydolls became the first family and animation project produced by STXfilms and was released in May 2019. Woody Woodpecker By November 2011, Universal and Illumination planned a Woody Woodpecker feature film. John Altschuler and Dave Krinsky (King of the Hill) were in talks to develop a story, but in July 2013, Illumination canceled the project. The film was eventually released as a live-action/CGI hybrid film in 2017. The Cat in the Hat In March 2012, following the financial success of The Lorax, the animated film adaptation of the book of the same name, Universal and Illumination announced plans to produce an animated adaptation of the book The Cat in the Hat. Rob Lieber was set to write the script, with Chris Meledandri as producer, and Audrey Geisel as the executive producer, but the project never came into fruition. By January 2018, Warner Animation Group was in development of an animated Cat in the Hat film as part of a creative partnership with Seuss Enterprises, which is set to be released in 2026. Clifford the Big Red Dog In May 2012, Universal and Illumination began to develop a live- action/animated feature film based on the Clifford the Big Red Dog book series. Matt Lopez was hired to write the script, while Chris Meledandri and Deborah Forte were attached to produce the film. In July 2013, Illumination dropped the project. Paramount Pictures later acquired the rights to develop the film, which was eventually released on November 10, 2021, following a number of delays due to the ongoing COVID-19 pandemic. Johnny Express In 2015, Universal and Illumination planned to adapt the South Korean CGI animated short Johnny Express into a feature-length animated film. ==Reception== ===Box office performance=== Film Budget North America Overseas gross (unadjusted) Worldwide gross (unadjusted) Opening Gross (unadjusted) Despicable Me $69 million $56.3 million $251.6 million $291.6 million $543.2 million Hop $63 million $37.5 million $108.5 million $75.8 million $184.4 million The Lorax $70 million $70.2 million $214.4 million $134.8 million $349.2 million Despicable Me 2 $76 million $83.5 million $368.1 million $602.7 million $970.8 million Minions $74 million $115.7 million $336.0 million $823.4 million $1.159 billion The Secret Life of Pets $75 million $104.4 million $368.4 million $525.9 million $894.3 million Sing $35.2 million $270.4 million $363.8 million $634.2 million Despicable Me 3 $80 million $72.4 million $264.6 million $770.2 million $1.034 billion The Grinch $75 million $67.6 million $271.5 million $255.4 million $527.8 million The Secret Life of Pets 2 $80 million $46.7 million $159.2 million $287.2 million $446.4 million Sing 2 $85 million $22.3 million $162.8 million $245.6 million $408.4 million Minions: The Rise of Gru $80–100 million $107.0 million $370.3 million $570.4 million $940.7 million The Super Mario Bros. Movie $100 million $146.4 million $574.9 million $788.4 million $1.363 billion Migration $72 million $12.5 million $127.3 million $171.4 million $298.7 million Despicable Me 4 $100 million $122.6 million $360.5 million $588.2 million $948.7 million ===Critical and public response=== Film Critical Public Rotten Tomatoes Metacritic CinemaScore Hop 41 (23 reviews) The Lorax 46 (30 reviews) The Grinch 51 (32 reviews) The Super Mario Bros. Movie 46 (53 reviews) Migration 56 (25 reviews) ==See also== * List of Universal Pictures theatrical animated feature films * List of DreamWorks Animation productions ==References== __FORCETOC__ Category:Lists of movies Category:Illumination movies",
 "title": "List of Illumination productions"
}