{
 "id": "1174471",
 "text": "The T. Eaton Company Limited (also known as just Eaton's and Eaton) was a Canadian chain of department stores that sold a variety of different products. They were headquartered in Toronto, Ontario. They had 200 stores across Canada at its peak and were one of the largest retail chains in Canada. On December 8, 1869, Timothy Eaton opened his first store on Yonge Street in Toronto, Ontario. In 1896, the company grew even more and they added more space to hold their factories and mail order division. On July 15, 1905, Eaton's expanded into western Canada and opened a store on Portage Avenue in Winnipeg, Manitoba. The 1900s saw Eaton's become the largest department store in Canada. In 1918, store employee Ivor Lewis built the Timothy Eaton statues outside the Toronto Eaton Centre and Eaton's Downtown Winnipeg stores. People passing by the statues started to run the toe on the statue's left foot for good luck. Eaton's launched the Eaton's catalogue which was one of the first to be distributed by a Canadian retail store. It had around 200,000 orders per year and was in both English and French. They stopped publishing it on January 14, 1976. Eaton's was the sponsor for the annual Eaton's Santa Claus Parade. They created the parade after holding a promotion where Santa Claus walked to the Eaton's store in Downtown Toronto from Union Station on December 2, 1904. The first one was held on December 2, 1905 and Eaton's sponsored it until 1982. Around the 1980s, an economic recession hit Canada and more competition by other stores caused Eaton's business to start to decline. Decline in the business was also caused by in-fighting between members of the Eaton's family and business mismanagement. In 1997, Eaton's filed for bankruptcy. In September 1999, Sears Canada purchased Eaton's for $30 million. Sears Canada converted the remaining Eaton's stores into Sears before they themselves went defunct on January 14, 2018. == References == Category:1892 establishments in Canada Category:1990s disestablishments in Canada Category:1999 disestablishments in North America Category:Companies based in Toronto Category:Defunct companies of Canada Category:Department stores of Canada",
 "title": "Eaton's"
}