{
 "id": "1174974",
 "text": "David Bisbal Ferre (Born, June 5, 1979) is a Spanish singer, composer and actor who rose to fame in the early 2000s by finishing second finalist in the first edition of the talent contest Operación Triunfo. In 2016, the Personality Media agency prepared a public opinion report in which he continued to obtain a high percentage of popularity among the Spanish population, being known by 97% and a rating of 6 out of 10. In November 2022, he received the quadruple diamond album award from Universal Music for the sales of 4 million copies internationally of his entire discography. As of 2019, David Bisbal has sold more than six million records in Spain and America, getting 69 platinum albums, 20 gold and two diamond. Corazón Latino and Bulería have each received an IFPI Platinum Award, the official certification of having sold over one million copies across Europe. ==Biography== ===1979-2001: Beginnings in music=== David Bisbal is the son of José Bisbal and María Ferre Montoya. He was born on June 5, 1979 in Almería and has two brothers: José María, born on March 16, 1968; and María del Mar, born on January 31. His father was a boxer and retired in 1976, leaving a record of 49 fights won, 35 lost and 9 draws, and having held the title of Spanish lightweight champion. Once he retired from boxing, he worked as a carpentry official at the Almería City Council, and his mother was a seamstress. He was educated at the Goya school in Almería, but he abandoned his studies in the 2nd year of BUP because he did not like studying. His parents enrolled him in a forestry course-workshop and he began to work in the municipal nursery of Almería under the influence of his father. In 1997, while he was singing at work, the owner of the nursery named María del Mar Martínez heard him and recommended that he audition to be the singer in the Orquesta Expresiones, where her husband was a producer. Bisbal was chosen and combined his work in the nursery with his career as a singer in the Orchestra during the summer festival season in Eastern Andalusia. ==International appeal== Internationally, Bisbal enjoys popularity in a great number of countries. *On 3 September 2003, he won the Latin Grammy for \"Best New Artist\". During the event, He sang Angels,Duet of Angels by Jessica Simpson and David Bisbal during the Latin Grammies with Jessica Simpson. He also launched a big promotional tour in Latin America with sold-out concerts in Argentina, Brazil, Mexico, Puerto Rico, Venezuela and others. *In 2008, he recorded Hate That I Love You (Odio Amarte),Rihanna video Hate That I Love You featuring David Bisbal a Spanglish version with Rihanna. He achieved European success in England, Germany, Belgium, Russia and Romania in addition to great success in Japan. *In 2009, he recorded \"Sufriras\" a Spanglish duet with singer Pixie Lott, eventually released as a platinum bonus track on the Deluxe Edition of his fourth studio album, Sin Mirar Atrás. *In 2010 David was featured in the Spanish version of the FIFA 2010 Official World Cup song Waving Flag with Somali-Canadian Musician K'naan who is the original artist of the song. *In 2010, A remix version of Miley Cyrus's When I Look At You, titled \"Te miro a ti\", was released on one of his albums in order to promote the release of The Last Song in Spain; in it, Cyrus sings her lines in English, while Bisbal's are mingled in both English and Spanish. *In 2011 David recorded a song for the TV series \"Herederos\" in Argentina. The song is called \"Herederos\" and David has sold over 300,000 copies of the cd \"Sin Mirar Atrás Tour\" in Argentina. *On 15 November 2012, he won the Latin Grammy held in Las Vegas from the category \"Best Traditional Pop Album\" for \"Una Noche en el Teatro Real\". *In 2013, Bisbal acted as himself in the TV series Jane the Virgin where he sang \"Esclavo de sus besos\" he appeared one episode. ==Personal life== He has a daughter with designer Elena Tablada. He also has a son, Mateo with Venezuelan actress and model Rosanna Zanetti, whom he married on 2 July 2018. ==References== Category:1979 births Category:Living people Category:People from Andalusia Category:Spanish voice actors",
 "title": "David Bisbal"
}