{
 "id": "1174216",
 "text": "The Sixtiers (lang.ru:Шестидесятники|Shestydesiatnyky), \"people of the 1960s\") were representatives of а new generation of the Soviet Intelligentsia, who entered the cultural and political life of the USSR during the 1950s and 1960s, after the Khrushchev Thaw. Most of them were born between 1917 and 1935, and their views were formed by years of Stalin's Great Purge repressions, which affected many of the Sixtiers' immediate families, and World War II, in which many of them had to fight. The Sixtiers were mainly distinguished by their liberal and anti-totalitarian views, and romanticism, which found vivid expressions in music and visual arts. Although many within the Sixtiers believed in Communist ideals, they were greatly disappointed with Stalin's rough regime and its repression of basic civil liberties.Applebaum, Anne (2003). Gulag: A History. Doubleday. p. 446. ISBN 978-0-7679-0056-0. pp. 147–149 The Soviet \"Sixties\" were partly close to a number of foreign representatives of the \"generation of the 1960s\", the era of beatniks and hippies: the Beatles, rock and roll, psychedelics, sexual revolution, the \"new left\", the \"civil rights movement\" and the student unrest of 1968 (see Counterculture of the 1960s). The cult figures of the Soviet Sixties generation were revolutionaries in politics and art - Vladimir Mayakovsky, Vsevolod Meyerhold, Bertolt Brecht, as well as writers Ernest Hemingway and Erich Maria Remarque. Zubok V. M. Zhivago's Children: The Last Russian Intelligentsia. — Harvard University Press, 2009. — 453 p. — ISBN 978-0-674-03344-3. pp. 210–215 ==Origins== Most of the \"Sixties\" came from the intelligentsia or party environment that formed in the 1920s. Their parents, as a rule, were convinced Bolsheviks, often participants in the Civil War. So many of the Sixties were somewhat idealistic communists, believing that they took over the baton from the older generation, who believed in pre-Stalinist socialism, which affirmed equality, freedom, and justice\". Other Sixties suffered greatly from the Stalinist \"purges\", losing their parents who were imprisoned or shot. So they couldn’t help being hidden opposition to the regime, not believing in its virtues anymore - neither in the pre-Stalin, nor in post-Stalin fashion. Yekelchyk, Serhy (20 November 2018). \"The early 1960s as a cultural space: a microhistory of Ukraine's generation of cultural rebels\". pp. 82–84 The WW2 and its aftermath became the starting point for the birth of the \"Sixties\". Contrary to the intelligentsia's mass expectations that the WW2 would bring at least some sort of democratization and humanization of the system, Stalin's regime became even harsher and more uncompromising. The fight against \"formalism\", cybernetics, genetics, \"killer doctors\", cosmopolitanism ensued, and anti-Western propaganda intensified. So the \"Sixties\" emerged only after Stalin’s death, when the gates of Gulag started to open, and the terror subsided. Therefore defining events in the life of the generation were Stalin's death and N. S. Khrushchev's report at the 20th Congress of the CPSU (1956), which criticized Stalin's activities. For most of the \"Sixties\" the 20th Congress was a catharsis that resolved a long-term ideological crisis, reconciling them with the life of the country. The democratization of public life that followed the 20th Congress, known as the \"Thaw\" era, became the context for the active work of the \"Sixties\". Bridges, David (1997). Education, Autonomy, and Democratic Citizenship: Philosophy in a Changing World. Psychology Press. ISBN 978-0-415-15334-8. pp. 14–19 In a way, the \"Sixties\" of 1960s were the Soviet remake of the Russian Empire \"Sixties\" of the 1860s, just one hundred years earlier - the democratic intelligentsia of the 1860s, who actively fought against the autocratic system, peasant slavery, inertia, and spiritual decline. A century later, the new generation of Russian people became just as opposed to the totalitarian political system and strict censorship. Merridale, Catherine (2002). Night of Stone: Death and Memory in Twentieth-Century Russia. London: Penguin. ISBN 978-0-14-200063-2. pp. 231–236 ==Literature== The \"Sixties generation\" expressed themselves most noticeably in literature. The magazine \"Yunost\" (Youth), headed by Valentin Kataev, played a major role in the early years of the \"Sixties generation\". It achieved huge circulations and was very popular among young people. The magazine relied on young and unknown writers and poets. It discovered such authors as Anatoly Gladilin, Vasily Aksyonov. The main event was the publication in 1962 of Alexander Solzhenitsyn's novella \"One Day in the Life of Ivan Denisovich\" - the first work about Stalin's camps, the publication of which became almost as pivotal and cathartic an event as the 20th Congress of the CPSU itself. * Solzhenitsyn, Aleksandr I. (1973). The Gulag Archipelago, 1918–1956: In Three Volumes. New York: Harper and Row. pp. 49–50 The \"Sixties” era was marked by poetical evenings at the Polytechnic Museum. There, too, mostly young poets performed: Yevgeny Yevtushenko, Andrei Voznesensky, Bella Akhmadulina, Robert Rozhdestvensky, Bulat Okudzhava. ==Cinema and Theatre== According to Yevgeny Yevtushenko, the Russian “Sixties generation” grew up not on Marxism, but on Italian neorealism: “There are no small sufferings, no small people – that’s what Italian neorealism taught us anew”. Alexei Yurchak (Jul 2003). \"Soviet Hegemony of Form: Everything Was Forever, Until It Was No More\". Comparative Studies in Society and History. pp. 99–101 Most of the actors of the \"golden era\" of Soviet cinema were \"Sixties\" both in age and in their way of thinking - Yevgeny Leonov, Innokenty Smoktunovsky, Oleg Tabakov, Yevgeny Yevstigneyev, Yuri Nikulin, Vasily Livanov, Yevgeny Lebedev, Mikhail Ulyanov, Stanislav Lyubshin, Inna Gulaya, Zhanna Bolotova, Marianna Vertinskaya, Andrei Smirnov, Nikolay Gubenko, Irina Miroshnichenko, Oleg Dal. It was then that such typical \"Sixties\" producers as Eldar Ryazanov, Georgy Daneliya, Mark Zakharov made their best films. The most typical example of the \"Sixties\" in the theater were Oleg Efremov's Sovremennik and Yuri Lyubimov's Taganka. ==Painting== In the late 1950s, relations between the authorities and free-thinking artists in the Soviet Union became strained. In 1962, at the Exhibition in Manezh in Moscow, Khrushchev and other Party leaders lashed harsh criticism against contemporary artists and the great Russian avant-garde titans such as Robert Falk, Vladimir Tatlin and other Knaves of Diamons members, as well as against Wassily Kandinsky, Marc Chagall, Alexander Tyshler, Boris Zhutovsky and other Cezannists and “formalist” admirers of Picasso and Western art. Since that Manege Affair, free-thinking progressive artists such as Oscar Rabin, Boris Sveshnikov, Eduard Steinberg, Jury Zheltov, Igor Vulokh, Ülo Sooster, Eduard Gorokhovsky, Evgeny Rukhin, Boris Zhutovsky, Ivan Chuikov, Mikhail Roginsky, Alexander Kharitonov, Vasily Sitnikov had to work outside of the official Soviet art framework and riske getting exciled or expelled from USSR - like it happened after the ill-famed “Bulldozer Exhibition” in 1973. Геллер, Михаил. Машина и винтики. История формирования советского человека. М.: «МИК», 1994. 336 с. ISBN 5-87902-084-3. pp. 165–168 ==Period of Stagnation and Mass Emigration from the USSR== Khrushchev's removal from power in 1964 resulted in sharp tightening of the regime inside the country and an escalation of the Cold War, which became a great tragedy for the \"Sixties\" generation. The following events became symbolically gloomy for them. Firstly, the trial of Sinyavsky and Daniel (1966) - a show trial of writers convicted not for anti- Soviet activities, but for their writigs. Secondly, the Six-Day War and the subsequent growth of the Jewish national movement in the USSR, the struggle to emigrate; thirdly, the invasion of Soviet troops into Czechoslovakia (1968) - the \"Sixties\" generation sympathized very much with the Prague Spring, seeing it as a logical continuation of the \"Thaw\". In the 1970s, many leaders of the \"Sixties\" were forced to emigrate (writers Vasily Aksyonov, Vladimir Voynovich, Anatoly Gladilin, Anatoly Kuznetsov, Alexander Galich, Georgy Vladimov, Andrei Sinyavsky, Naum Korzhavin; filmmakers Efraim Sevela, Mikhail Kalik, Mikhail Bogin; pop singers Emil Gorovets, Larisa Mondrus, Aida Vedischeva). Figes, Orlando (2007). The Whisperers: Private Life in Stalin's Russia. London: Allen Lane. ISBN 978-0713997026.. pp. 199–203 ==Perestroika== The origins of Gorbachev's perestroika ideas came from within the generation of the Sixties, who patiently, without losing hope, waited and prepared for the renewal of society. Perestroika itself was mainly ideological product of the “Sixties”, a product of those ideas, illusions, values that developed in an entire generation of Soviet intelligentsia under the influence of Stalin’s death. \"Language Policy in the former Soviet Union\". H. Schiffman. University of Pennsylvania.. pp. 302–305 The Sixties generations perceived the perestroika announced by Gorbachev with great enthusiasm — as a continuation of the “thaw,” and renewal of their confrontation with Stalinism. After two decades of inaction, they suddenly found themselves in great demand again. One after another, their books about the Stalin era came out, producing the effect of an exploding bomb: “Children of the Arbat” by Anatoly Rybakov, “Black Stones” by Anatoly Zhigulin, “White Clothes” by Vladimir Dudintsev, “Bison” by Daniil Granin. ==Notable Sixtiers== ===Philosophers=== * Merab Mamardashvili * Yuri Levada ===Poets=== * Boris Slutsky * Andrei Voznesensky * Yevgeny Yevtushenko * Arkady Steinberg * Alexander Kushner * Victor Sosnora * Bella Akhmadulina * Joseph Brodsky * Vladimir Vysotsky ===Writers and dramatists=== * Sergey Zalygin * Alexey Arbuzov * Alexander Vampilov, ===Painters and Sculptors=== * Oscar Rabin * Ernst Neizvestny ==References== ;References ;Sources * Zubok V. M. Zhivago's Children: The Last Russian Intelligentsia. — Harvard University Press, 2009. — 453 p. — ISBN 978-0-674-03344-3. * Yekelchyk, Serhy (20 November 2018). \"The early 1960s as a cultural space: a microhistory of Ukraine's generation of cultural rebels\" * Applebaum, Anne (2003). Gulag: A History. Doubleday. p. 446. ISBN 978-0-7679-0056-0. * Karlinsky, Simon and Appel, Alfred (1977). The Bitter air of exile: Russian writers in the West, 1922–1972. p72 University of California Press ISBN 978-0-520-02895-1 * Stalin and the Kirov Murder. (1987) New York: Oxford University Press. ISBN 978-0195055795. * The Great Terror: A Reassessment. (2008) Oxford: Oxford University Press. ISBN 978-0195317008. * Figes, Orlando (2007). The Whisperers: Private Life in Stalin's Russia. London: Allen Lane. ISBN 978-0713997026. * Solzhenitsyn, Aleksandr I. (1973). The Gulag Archipelago, 1918–1956: In Three Volumes. New York: Harper and Row. * \"Language Policy in the former Soviet Union\". H. Schiffman. University of Pennsylvania. * Anderson, Barbara A.; Silver, Brian D. (2019). \"Some Factors in the Linguistic and Ethnic Russification of Soviet Nationalities: Is Everyone Becoming Russian?\". In Hajda, Lubomyr; Beissinger, Mark (eds.). The Nationality Factor in Soviet Politics and Society. Routledge. pp. 95–130. ISBN 9781000303766. * Tyszka, Krzysztof (2009). \"\"Homo Sovieticus\" Two Decades Later\". Polish Sociological Review (168): 507–522. ISSN 1231-1413. * Heller (Geller), Mikhail (1988). Cogs in the Wheel: The Formation of Soviet Man. Alfred A. Knopf. pp. 27, 43, 47. ISBN 978-0394569260. Heller quotes from a 1974 book Sovetskye lyudi (\"Soviet People\"): Soviet Union is the fatherland of a new, more advanced type of Homo sapiens - Homo sovieticus. * 1917–1987: Unsuccessful and Tragic Attempt to Create a \"New Man\" Archived 2011-07-27 at the Wayback Machine. * Геллер, Михаил. Машина и винтики. История формирования советского человека. М.: «МИК», 1994. 336 с. ISBN 5-87902-084-3. * Alexei Yurchak (Jul 2003). \"Soviet Hegemony of Form: Everything Was Forever, Until It Was No More\". Comparative Studies in Society and History. * Bridges, David (1997). Education, Autonomy, and Democratic Citizenship: Philosophy in a Changing World. Psychology Press. ISBN 978-0-415-15334-8. * A. Artizov, Yu. Sigachev, I. Shevchuk, V. Khlopov under editorship of acad. A. N. Yakovlev. Rehabilitation: As It Happened. Documents of the CPSU CC Presidium and Other Materials. Vol. 2, February 1956–Early 1980s. Moscow, 2003. * Conquest, Robert (1973) [1968]. The Great Terror: Stalin's Purge of the Thirties (Revised ed.). London: Macmillan. ISBN 978-0-02-527560-7. * Hoffman, David L., ed. (2003). Stalinism: The Essential Readings. Oxford: Blackwell Publishers. ISBN 978-0-631-22890-5. * Lyons, Eugene (1937). Assignment in Utopia. Harcourt Brace and Company. * Merridale, Catherine (2002). Night of Stone: Death and Memory in Twentieth-Century Russia. London: Penguin. ISBN 978-0-14-200063-2. ===External links=== * * * Category:1930s in the Soviet Union Category:1940s in the Soviet Union Category:1950s in the Soviet Union Category:1960s in the Soviet Union Category:1970s in the Soviet Union Category:Joseph Stalin Category:Dictatorship Category:Soviet Union Category:History of the Soviet Union Category:History of Russia Category:Politics of Russia Category:Cultural generations Category:Demographics of the Soviet Union Category:Society of the Soviet Union Category:Culture of the Soviet Union Category:Culture of Russia",
 "title": "Sixtiers"
}