{
 "id": "1174999",
 "text": "is a Japanese professional wrestler. He currently wrestles for All Elite Wrestling (AEW). He is a member of the Don Callis Family stable. Takeshita has also competed in DDT Pro-Wrestling (DDT), New Japan Pro-Wrestling (NJPW), Consejo Mundial de Lucha Libre (CMLL), and on the independent circuit in Deadlock Pro-Wrestling (DPW). Takeshita has won many championships over his career. In AEW, Takeshita has been a one-time AEW International Champion. In DDT, he was a four-time Ironman Heavymetalweight Champion, five-time KO-D 6-Man Tag Team Champion, five-time KO-D Openweight Champion, four-time KO-D Tag Team Champion, and the winner of the KO-D Openweight Championship Challenger Decision Tournament in 2017, the KO-D Tag Team Championship Tournament in 2015, the D-Oh Grand Prix in 2019, 2021 II, the King of DDT Tournament in 2019 and 2021, and the Ultimate Tag League tournament in 2021 with Shunma Katsumata. In NJPW, he was a one-time NEVER Openweight Champion. ==Career== ===All Elite Wrestling=== On the April 12, 2021 episode of AEW Dark: Elevation, Takeshita made his AEW debut where he deleted Danny Limelight. He then traveled back to Japan to continue wrestling for DDT Pro- Wrestling (DDT). On the April 25, 2022 episode of AEW Dark: Elevation, Takeshita made his return to AEW and defeated Brandon Cutler. On the May 6 episode of Rampage, Takeshita faced Jay Lethal but lost because of interference from Sonjay Dutt and Satnam Singh. On the May 18 episode of Dynamite, Takeshita wrestled AEW World Champion \"Hangman\" Adam Page. While Takeshita did not win the match, it praised and was very well received. At Fyter Fest, Takeshita lost to Jon Moxley in a AEW Interim World Championship Eliminator Match. If he won, Takeshita earned a chance to challenge for Moxley's AEW World Championship in the future. At Battle of the Belts III, Takeshita challenged Claudio Castagnoli for his ROH World Championship but lost. On November 19, AEW owner Tony Khan announced that Takeshita signed a contract to become a member of the roster. At Double or Nothing, Takeshita turned heel and attacked Kenny Omega after The Elite's Anarchy in the Arena match, joining Don Callis and creating the Don Callis Family. On the May 31 episode of Rampage, Takeshita defeated Penta El Zero Miedo in qualifying match to challenge for the AEW TNT Title at Forbidden Door. At Forbidden Door, he wrestled in a ladder match for the vacant AEW TNT Championship but the match was won by Jack Perry. At All Out, Takeshita wrestled in a four-way match for Kazuchika Okada's AEW Continental Championship but Okada retained. At WrestleDream, Takeshita won a three-way match against Will Ospreay and Ricochet to win the AEW International Championship. This was Takeshita's first championship in AEW. At Revolution, Takeshita lost the title to Kenny Omega. == References == ==Other websites== Category:1995 births Category:Living people Category:All Elite Wrestling people Category:Japanese professional wrestlers Category:Sportspeople from Osaka",
 "title": "Konosuke Takeshita"
}