{
 "id": "1174654",
 "text": "The Argentine War of Independence was a conflict from 1810 to 1818 where regions of modern-day Argentina sought freedom from Spanish rule. == Background == Before the war, Argentina was part of the Viceroyalty of the Río de la Plata, which also included present-day Uruguay, Paraguay, and Bolivia. The capital was Buenos Aires. During this period, many government positions were held by officials sent from Spain, leading to tensions with local-born individuals, known as Criollos. Inspired by the American Revolution and French Revolution, the Criollos wanted more autonomy. Additionally, Spain's strict trade policies limited economic growth in the colonies. == The Revolution == In 1810, news arrived that much of Spain had been invaded by French forces. This led to the May Revolution, where local leaders questioned the legitimacy of the Spanish-appointed viceroy, Baltasar Hidalgo de Cisneros. An open cabildo (a public meeting) was held, resulting in the removal of Cisneros and the establishment of the Primera Junta, the first local government not appointed by Spain. Buenos Aires then invited other cities in the viceroyalty to recognize this new government and send representatives. == Armed conflict == === Initial campaigns === The Primera Junta organized military campaigns to assert its authority over the entire viceroyalty. However, regions like Córdoba, Montevideo, Paraguay, and Upper Peru (now Bolivia) resisted. For example, Santiago de Liniers in Córdoba attempted to challenge Buenos Aires' authority but was defeated. In Upper Peru, royalist forces loyal to Spain also opposed the new government. === Renewed offensives === After initial setbacks, patriot forces reorganized. Leaders like Manuel Belgrano and José de San Martín emerged, leading successful campaigns that shifted the momentum in favor of independence. === The march towards independence === On 9 July 1816, representatives from various provinces gathered in San Miguel de Tucumán and declared independence from Spanish rule, forming the United Provinces of the Rio de la Plata. === Army of the Andes (1814–1818) === General José de San Martín formed the Army of the Andes to liberate Chile and Peru from Spanish control. In 1817, this army crossed the Andes Mountains, a major military achievement, and played a crucial role in the independence movements of neighboring countries. == Annual commemoration == Argentina celebrates May 25 as Revolution Day (Argentina) to honor the events of the May Revolution in 1810. Additionally, July 9 is celebrated as Independence Day (Argentina), marking the formal declaration of independence in 1816. == References == Category:History of Argentina Category:Revolutions in Argentina Category:1810s conflicts Category:1810s in Argentina Category:Spanish American wars of independence Category:Viceroyalty of the Río de la Plata Independence Category:Wars involving Spain Category:19th century in Argentina Category:19th century in the Viceroyalty of the Río de la Plata",
 "title": "Argentine War of Independence"
}