{
 "id": "1174168",
 "text": "Felsődobsza is a village in Gönc District of Borsod-Abaúj-Zemplén County. Its population in 2024 was 822. == Location == It lies in the Hernád Valley, 35 kilometers northeast of Miskolc, the county seat, by road. Most of its populated area and administrative territory is on the left bank of the river, but a smaller part, about 2.5 square kilometers, is on the opposite side. One of the few Hungarian islands in the Hernád River, called Bárczay Island, is located here. A small hydroelectric power plant was built on it, in the left branch of the river’s flow. The neighboring settlements are Hernádszentandrás and Pere to the northeast, Abaújszántó and Golop to the east, Monok to the southeast, Hernádkércs to the southwest, and Csobád, which is on the right bank of the Hernád, to the northwest. To the north, the closest settlement is Ináncs, but their administrative areas almost don’t touch. == History == The area has been inhabited since prehistoric times, proven by Bronze Age findings. It is one of the most important Stone Age settlements. On a hill called Várdomb, remains of a Neolithic defensive structure, an earthen fort, are clearly visible. The name Dobsza comes from Slavic origins, suggesting that its first inhabitants, who gave it the name, were likely Slovaks. It appears in medieval documents as Doza, Dobsa, and Dompsa. In the Middle Ages, it was a royal estate (1219), with an earthen fort on one of its hills. Dobsza belonged to the Vizsoly back then.In the early 15th century, it was owned by the Dobsza family, who had 22 serf households in the village by 1427. In 1459, the village belonged to Simon Csobádi, but due to his disloyalty, it was given to Mihály Szepesi in 1482. During the Turkish occupation, the Turks looted the village. In 1715, only 2 serf and 2 tenant families lived there, but it was repopulated by the mid-18th century. A watermill is mentioned in 1720. By 1833, it had 118 houses, 907 Roman Catholic and Reformed residents, and a Reformed church. The village was known for its wine production, and its landowners were the Bárczay and Máriássy families. By 1920, the population grew to 1,347 people, and the village got electricity, a slaughterhouse, and a hydroelectric plant. Today, it is a popular vacation spot along the Hernád River. == Population == In 2022, 89.9% of the population identified as Hungarian, 23.9% as Roma, 0.2% as Serbian, 0.1% each as German, Bulgarian, Slovak, and Romanian, and 0.5% as other non-local nationalities (10.2% did not respond; due to dual identities, the total may exceed 100%). Regarding religion, 42.3% were Roman Catholic, 19.3% Reformed, 1.5% Greek Catholic, 0.2% Lutheran, and 5.4% non-religious (31.3% did not answer).Felsődobsza ==References== Category:Villages in Hungary Category:Settlements in Borsod- Abaúj-Zemplén County Category:Gönc District",
 "title": "Felsődobsza"
}