{
 "id": "1174963",
 "text": "The Argentine Navy (ARA; ), is one of the three branches of the Armed Forces, along with the Army and the Air Force. Its mission is to prepare, train, and sustain the nation's naval assets. These assets are distributed across four branches, forming the integrated naval force: the Navy, the Marine Infantry, the Naval Aviation, and the Submarine Force. In addition to its mission, the Navy participates in internal security operations alongside the Ministry of Security, participates in UN peacekeeping operations, provides logistical support for Antarctic campaigns alongside the Joint Antarctic Command, and provides humanitarian support to the community in the event of a disaster. The Navy is subordinate to the President of Argentina as Commander-in-Chief of the Armed Forces. ==Ranks== ===Officers=== Rank insignia consists of a variable number of gold-braid stripes worn on the sleeve cuffs or on shoulder-boards. Officers may be distinguished by the characteristic loop of the top stripe (in the manner of British Royal Navy officers). Combat uniforms may include metal pin-on or embroidered collar rank insignia. Rank insignia is worn on the chest when in shipboard or flying coveralls. Officers are commissioned in either the Command (line) Corps (those who attend the Escuela Naval Militar- Military Naval College) or the Staff Corps (Professional Officers who only attend a short course in the Naval Academy after getting a civilian degree, except for the Paymasters who instead attend the Naval College). The Line Corps is divided into three branches: the Naval branch (including Surface Warfare, Submarine Warfare and Naval Aviation sub-branches), the Marine Corps branch, and Executive -Engineering- branch. Line Corps' reserve officers are considered Restricted Line ( Escalafon Complementario ) officers in any of the Warfare Communities (Surface, Submarine, Marines, Aviation and Propulsion), and can only raise to OF-4 rank ( Capitan de Fragata ). All Line Corps officers wear distinctive branch/sub-branch insignia on the right breast. Some Staff Corps officers also wear specialisation badges (Aviation, Surface, Submarine and Marines). Other common insignia is the Naval War College insignia, parachute wings, etc., also worn on the right breast. Medals and Ribbons, if awarded, are worn on the left breast, just above the chest pocket. The rank insignia of Staff Corps' officers is placed over a background colour denoting the wearer's field, such as purple (Chaplains), blue (Engineers), red (Health Corps), white (Paymasters), green (Judge Advocate Officers), brown (Technical Officers, promoted from the ranks) and grey (special branch). The background colour for Command Corps officers is navy blue/black. ===Enlisted ratings and Non-Commissioned Officers=== Other ranks' insignia (not including Seamen) is worn on either shoulderboards or breast or sleeve patches. Seamen and Seamen Recruits wear their insignia on their sleeves. The shoulderboards denote the wearer's specialty. == References == === Citations ===",
 "title": "Argentine Navy"
}