{
 "id": "1174786",
 "text": "Joseph Ryan Robinson (born April 10, 1989) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH) under the ring name Juice Robinson. He is a member of the Bang Bang Gang stable. Robinson has also competed in WWE where he wrestled on their NXT under the ring name CJ Parker. Other promotions he has wrestled for are New Japan Pro-Wrestling (NJPW) and Impact Wrestling. In AEW, Robinson was the winner of the Dynamite Dozen Battle Royale in 2023. In NJPW, he was a three-time IWGP United States Heavyweight Champion, one-time IWGP Tag Team Champion, and the winner of the World Tag League with David Finlay. ==Career== ===All Elite Wrestling=== On September 28, 2022 edition of Dynamite, Robinson made his AEW debut and lost to Jon Moxley in an eliminator match for the AEW World Championship. On December 2, it was announced by AEW owner Tony Khan that Robinson had officially signed a contract with AEW to become a member of the roster. On the January 13, 2023 episode of Rampage, Robinson challenged Darby Allin for the AEW TNT Championship but lost. On the March 8 episode of Dynamite, Robinson started a feud with Ricky Starks after attacking him during a promo. On the July 1 episode of Collision, Robinson entered the Owen Hart Cup tournament but lost in the quarter finals to Ricky Starks. On the July 15 episode of Collision, Bullet Club Gold faced FTR (Cash Wheeler & Dax Harwood) in a 2-out-of-3 falls match for the AEW World Tag Team Championships but lost 2–1. The match was very well received and Dave Meltzer of the Wrestling Observer Newsletter gave it a *****1/4. Robinson took some time off of tv to deal with a back injury and receive surgery. At Double or Nothing, Robinson returned to AEW to help his Bullet Club Gold (now named Bang Bang Gang) teammates keep their Unified World Trios Championship (AEW World Trios Championship and ROH World Six-Man Tag Team Championship) by defeating Death Triangle (Pac, Rey Fénix, and Penta El Zero Miedo). He then began to team with Bang Bang Gang stablemates The Gunns (Austin & Colten Gunn). They challenged for the AEW World Trios Title twice on the July 20 episode of Collision and at All In London in a four-way London Ladder match but lost each time. == Personal life == Robinson is married to fellow professional wrestler and AEW employee Toni Storm. == References == ==Other websites== Category:1989 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:People from Joliet, Illinois Category:Sportspeople from Illinois",
 "title": "Juice Robinson"
}