{
 "id": "1174127",
 "text": "In the early 1800s, European scholars figured out how to read ancient Egyptian writing. The most important scholars were Jean-François Champollion and Thomas Young. The ancient Egyptian scripts, including hieroglyphic, hieratic, and demotic writing, had stopped being used by the 400s and 500s AD. Instead, people used the Coptic alphabet. Later, people only knew about the old scripts from Greek and Roman writers, who misunderstood them. Many believed Egyptian writing was only made up of pictures that represented ideas, not sounds. Some scholars in the Middle Ages and early modern times guessed that hieroglyphs might include sounds, but most still thought they were just symbols. This made deciphering them very hard, even in the 1700s. == The Rosetta Stone == In 1799, during Napoleon's campaign in Egypt, soldiers found the Rosetta Stone. This stone had the same text written in three scripts: hieroglyphic, demotic, and Ancient Greek. Scholars hoped they could use the Greek text to understand the Egyptian writing, especially by comparing it with the Coptic language, the last stage of the Egyptian language. Early progress was slow. Antoine-Isaac Silvestre de Sacy and Johan David Åkerblad made some discoveries. Then Young found that demotic writing came from hieroglyphs. He identified some phonetic (sound-based) symbols and figured out the meaning of several hieroglyphs, including those in a cartouche with the name of the Egyptian king Ptolemy V. However, Young wrongly believed that hieroglyphs only represented sounds when writing non-Egyptian names. In the early 1820s, Champollion compared Ptolemy's name with other cartouches. He realized that hieroglyphs combined both phonetic (sound-based) and ideographic (symbol-based) elements. Some people doubted his ideas and accused him of copying Young’s work. But over time, his discoveries were accepted. He eventually identified most phonetic hieroglyphs and worked out much of Egyptian grammar and vocabulary. Meanwhile, Young mostly deciphered demotic using the Rosetta Stone and other texts that had both Ancient Greek and demotic writing. == Later discoveries == After Young and Champollion died, progress slowed down. Then, in 1837, Karl Richard Lepsius corrected a big mistake in Champollion's work. He showed that some hieroglyphs represented two or three sounds instead of just one. Later scholars, like Emmanuel de Rougé, improved the understanding of Egyptian writing. By the 1850s, people could fully translate ancient Egyptian texts. At the same time, scholars were also deciphering cuneiform, another ancient writing system. These discoveries helped unlock many ancient texts, giving new knowledge about early human history. Category:Egyptian languages Category:Egyptian hieroglyphs Category:Egyptology Category:History of translation Category:Methods in archaeology Category:History of writing Category:Ancient languages Category:Decipherment Category:Rosetta Stone",
 "title": "Decipherment of ancient Egyptian scripts"
}