{
 "id": "1174267",
 "text": "Marthe Pungs (fl. 1910 - 1913) was a Belgian foil fencer. Pungs was among the best female fencers during the early 1910s. She was a member of the leading women's fencing club at Salle Verbrugge (Ladies Fencing Club later named Cercle d'escrime des Dames). She became chamion of the club in 1910 and 1913. She had international successes at the earliest women's international fencing meetings. She was selected to competed at the 1910 England–Belgium women's fencing competition in London where the Belgian team won. Later the year she won the second prize at the 1910 Lille international women's fencing tournament. Pungs was left-handed and was praised by her technique. ==Career== In February 1910 she became champion of the Ladies Fencing Club ahead of Leni Preetorius and Germaine Lowet, Pungs won all her nine matches. She was selected to participated at the 1910 England–Belgium women's fencing competition, the earliest women's international fencing meeting at the Bertrands Fencing Academy in London. She competed in this meeting against Millicent Hall. The Belgian team won this competition. In June 1910 she competed at the 1910 Lille international women's fencing tournament in Lille, France where she won the second prize ahead of Leni Preetorius. Her result was described as a great success in the Belgian media and she was praised for her technique. In March 1911, male fencers from Sweden came to Belgium. The members of the Ladies Fencing Club (including Pungs) also contributed to this event. The Matin wrote wrote about the women: \"Again, in this as in so many other things, woman has shown herself superior to man.\" In April 1911 she participated at the 1911 Paris international women's fencing tournament in Paris, France and was described as an \"excellent left-handed\" fencer. At a national event of the Ladies Fencing Club she won the third prize in May 1911. At the end of 1911 she participated at the 1911 Belgium–Netherlands women's fencing meeting and competed against the Dutch fencers T. van den Bergh and B. Luden. In 1913 she became champion of the Cercle d'escrime des Dames ahead of Adrienne Machiels and Leni Preetorius. ==References== Category:Year of birth missing Category:Year of death missing Category:Place of death missing Category:Belgian fencers Category:Sportspeople from Antwerp Category:Sportswomen Category:19th-century births Category:20th-century deaths",
 "title": "Marthe Pungs"
}