{
 "id": "1174775",
 "text": "John Anthony Silver (born June 4, 1990) is a American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and is a member of The Dark Order stable. Silver has also competed in Combat Zone Wrestling (CZW), Chikara, Pro Wrestling Guerrilla (PWG), and made occasional appearences in WWE. Silver has won many Championships in many different companies. In CZW, he is a one-time CZW World Heavyweight Champion, one-time CZW World Tag Team Champion, and the winner of the Best of the Best 18 tournament in 2019. In Chikara, he was a one-time Chikara Campeonatos de Parejas and the co-winner of the Tag World Grand Prix tournament with Jigsaw. In PWG, he is a one-time PWG World Tag Team Champion. ==Career== ===All Elite Wrestling=== On the October 16, 2019 episode of Dynamite, Silver made his AEW debut alongside Alex Reynolds and they lost to Santana and Ortiz. On the December 18 episode of Dynamite, both Silver and Reynolds joined The Dark Order stable. On the February 19, 2020 episode of Dynamite, Silver and Reynolds entered a 20-man Tag Team Battle Royal to determine the #1 Contenders for the AEW World Tag Team Championships but lost early in the match. On the July 2 episode of AEW Dark, Silver teamed with Dark Order members Reynolds and #5 Alan Angels to defeat Joe Alonzo, Shawn Dean & Will Hobbs in a 6 man tag team match. It was their first wins in AEW and as members of The Dark Order. On the October 21 episode of Dynamite, Silver and Reynolds competed in a four-way tag team match against The Young Bucks, Private Party, and The Butcher and the Blade but lost. At Full Gear, Silver made his AEW singles match debut, losing to Orange Cassidy. At Winter Is Coming, Silver competed in a battle royal to determine who the two wrestlers that were going going face off for the Dynamite Diamond Ring. The match was won by MJF and Orange Cassidy. At the Brodie Lee Celebration of Life memorial television special, Silver teamed with Reynolds and \"Hangman\" Adam Page to defeat The Inner Circle (MJF, Santana and Ortiz). Silver won the match after performing Brodie Lee's discus lariat as a tribute. On the March 24, 2021 episode of Dynamite, Silver challenged Darby Allin for his AEW TNT Championship but lost. During the match, Silver dislocated his shoulder after jumping over the guardrail and was out of in-ring action for a few weeks. He had also been wrestling with a torn labrum for a year. == References == ==Other websites== * Category:1991 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:American YouTubers Category:Sportspeople from New York (state) Category:Sportspeople from New York City Category:Twitch (service) streamers",
 "title": "John Silver (wrestler)"
}