{
 "id": "1174652",
 "text": "The Aztecs were a group of people who lived in central Mexico during the 14th to 16th centuries. They called themselves Mēxihcah. Their main city was Tenochtitlan, built on an island in Lake Texcoco. Today, Mexico City stands where Tenochtitlan once did. The Aztecs were known for their complex society, impressive architecture, and powerful empire. == Arrival in the Valley of Mexico == Around 1250 AD, many city-states existed in the Valley of Mexico, such as Chalco, Xochimilco, Tlacopan, Colhuacan, and Azcapotzalco. The Mexica people, later known as the Aztecs, arrived in this area as a semi-nomadic tribe. They first settled on Chapultepec Hill but were forced to leave by the Tepanecs of Azcapotzalco. In 1299, the ruler of Colhuacan allowed them to settle in Tizaapan. After some conflicts, they moved to a small island in Lake Texcoco in 1325, where they founded Tenochtitlan. According to legend, they built their city where they saw an eagle perched on a cactus, holding a snake—a symbol now on the Flag of Mexico. == Aztec Triple Alliance == In 1428, Tenochtitlan allied with Texcoco and Tlacopan, forming the Aztec Triple Alliance. This alliance became powerful, conquering many regions and collecting tribute from them. Tenochtitlan led military campaigns, expanding the empire's reach to both the Gulf of Mexico and the Pacific Ocean. === The reign of Itzcoatl (1427–1440) === Itzcoatl was the first leader of the Triple Alliance. He and his co-ruler from Texcoco, Nezahualcoyotl, expanded the empire by conquering nearby cities like Cuauhnahuac and others in the modern- day state of Morelos. === Moctezuma I and Tlacaelel (1440–1469) === Moctezuma I became the ruler in 1449. His half-brother, Tlacaelel, played a significant role in shaping the empire and its religion. They expanded the empire further, conquering regions like Huastec and Mixtec territories. Tlacaelel also reformed the Aztec religion, elevating the god Huitzilopochtli and increasing human sacrifices. === The reigns of Axayacatl (1469–1481) and Tizoc (1481–1486) === Axayacatl became ruler in 1469. During his reign, Tenochtitlan absorbed the neighboring city of Tlatelolco. He also led military campaigns westward but faced a significant defeat against the Purépecha. His successor, Tizoc, ruled briefly and faced challenges in expanding the empire, leading to his replacement. === The reign of Moctezuma II Xocoyotzin === Moctezuma II became ruler in 1502. He was a notable warrior who extended the empire's reach to regions like Soconusco and Xicallanco. Under his rule, the Aztec Empire reached its largest size. Some sources suggest that Moctezuma II believed the arriving Spanish were linked to the return of the god Quetzalcoatl. == Fall of the Aztec Empire == In 1521, Spanish conquistador Hernán Cortés, along with allied Tlaxcalan forces, conquered the Aztec Empire. They besieged Tenochtitlan, leading to widespread hunger and the spread of diseases like smallpox among the Aztecs. The last Aztec ruler, Cuauhtémoc, surrendered on August 13, 1521. This marked the end of the Aztec Empire and the beginning of New Spain, under Spanish rule. Category:Aztec Category:Valley of Mexico",
 "title": "History of the Aztecs"
}