{
 "id": "1174671",
 "text": "Ashok Chakravarti was born on August 1, 1947. He is an economist who focuses on development. Since 1980, he has been giving advice on economic policies to governments in Africa. In 2019, Ashok became a Senior Economic Adviser for the Government of Zimbabwe. He is also a member of the Monetary Policy Committee of the Reserve Bank of Zimbabwe, a position he has held since 2020. == Early life and education == Ashok lives in Harare, Zimbabwe. He studied economics at Oriel College, Oxford University, and published economic papers while he was a student in 1972. Over the past 20 years, he has visited Oxford University several times as a Research Fellow for his studies.Oxford Department of International DevelopmentAshok Chakravarti is Senior Advisor, USAID/Bearing Point South Sudan Program == Career == In the mid-1970s, Ashok became an activist against the government of Prime Minister Indira Gandhi in India. He wrote about his experiences as an activist in a book called \"The Struggle Within: A Memoir of the Emergency.\" After the 1977 elections, Ashok worked in the Ministry of Industry in the Government of India. He was part of a team that did research on policies that helped to open up the Indian economy. In 1981, he joined the United Nations as an Economic Advisor, first with UNCTAD and later with UNDP in Harare. In 2004, he became the Chief of Party for a U.S. Government program aimed at helping to build the government structures in South Sudan, which was recovering from war. He worked closely with the first President of Southern Sudan, John Garang, and his successor, Salva Kiir. After returning from South Sudan, Ashok became a Senior Visiting Lecturer at the University of Zimbabwe and held that position until he joined the government in 2019. Ashok has written many papers that have been published in international peer reviewed journals. His research mainly looks at institutional economics. He has also written two books on institutional economics book. In 2006, he wrote a book called \"Aid, Institutions and Development,\" which was published by Edward Elgar in the U.K. In 2012, he wrote another book titled \"Institutions, Economic Performance and the Visible Hand,\" which was published by Edward Elgar in the U.K. == Publications == • “Developmental Impact of International Finance Corporations Projects: 1956-71”. World Bank. 1971. • “Social Profitability of Public Sector Enterprises in India”, M. Phil. Thesis, University of Oxford. 1972. • “Bhutan: Economic Memorandum”. Planning Commission, Govt. of Bhutan. 1983. • “Aid Flows to Malawi 1986-90: An Analysis”. Department of Economic Planning, Government of Malawi. 1991. • “Malawi: Salt Marketing and Distribution Study”. Harvard Institute for International Development, Malawi. 1995. • “A Theory of Discontinuous Change”. Working Paper No. 164, Dept. of International Development, Oxford University, U.K. 2008. • “Rationality, Opportunism and Market Performance”. Working Paper No. 1/2010, Department of Economics, University of Zimbabwe. 2010. • “Liquidity Challenges in Zimbabwe”. Paper presented to ZNCC Conference. March 2014. == References == Category:Economists",
 "title": "Ashok Chakravarti (economist)"
}