{
 "id": "1175238",
 "text": "Glottocode is a special code that identifies languages and groups of languages in a big database called Glottolog. Glottolog is a collection of information about all the languages in the world. It was made by people who study languages at the Max Planck Institute in Germany. The Glottocode system started in 2011 to help people keep track of languages. Unlike other codes, like ISO 639-3, which are only for single languages, Glottocodes can be used for languages, dialects, and groups of languages. This makes them helpful for people who want to learn about languages. == What is a \"Languoid\"? == In Glottolog, a languoid is anything related to languages that people talk about. It can be: * A single language (like English). * A dialect (like how people speak English differently in different places). * A group of languages (like all the languages in one family). For example, English is a languoid with Glottocode \"stan1293\". The Austronesian language family, which has many languages from places like Southeast Asia and the Pacific, is also a languoid, with Glottocode \"aust1307\". The word \"languoid\" helps Glottolog include all these things, even if they are not connected by history. == How Glottocodes are Made == A Glottocode has eight characters. It starts with four characters that can be small letters (a to z) or numbers (0 to 9), followed by four numbers (0 to 9). Examples are \"abcd1234\" and \"b10b1234\". == How Glottocodes are Used == The Glottolog database uses Glottocodes to keep track of many languages and groups. As of March 15, 2025, it lists 8,605 languages at and 4,977 language families at , including some single languages that don’t belong to any family. People who study languages use Glottocodes to find facts easily. The codes help them know exactly which language or group they mean. Glottocodes are special because they cover more than other codes—like dialects and families—and they never change. Glottolog is free to use, and people all over the world help keep it up to date. Glottocodes work with the three-letter ISO 639-3 codes, which are just for languages, but Glottocodes cover more things like dialects and families. == Mapping Glottocodes to ISO 639-3 == Sometimes, people want to connect Glottocodes to ISO 639-3 codes. For example, the Glottocode \"stan1293\" matches the ISO 639-3 code \"eng\" for English. This is called \"mapping\". Mapping helps because ISO 639-3 codes are well-known, but they don’t include dialects or families like Glottocodes do. Glottolog keeps a list to show which Glottocodes go with which ISO codes when they match. == Related pages == * Glottolog * ISO 639-3 * Linguistics * Language family == References == == Other websites == * * Category:Linguistics Category:Language classification Category:Identifiers",
 "title": "Glottocode"
}