{
 "id": "1175274",
 "text": "The Kultur- und Sportverein Ankerbrot Montelaa is an Austrian football club based in the Vienna district of Favoriten. The Laaer Berg (In the Viennese dialectː Monte Laa) is a hill in the south of the district. In the 1951/52 season, the club played under the temporary name Favoritner SK Blau-Weiß in the Staatsliga A, the highest tier in Austrian football. ==History == The club was founded in 1936 by Hans Milanovich and Karl Großhaupt as a company association of the Vienna Ankerbrot factory. After Ankerbrot was promoted to the then second-tier Wiener Landesliga in 1948, the club renamed itself Favoritner SK Blau-Weiß to increase its appeal to the public. In 1950, Blau- Weiß qualified for the new professional Staatsliga B by finishing third in the Vienna League. The club even achieved promotion to the Staatsliga A with another third-place finish in 1950/51. After Blau-Weiß narrowly missed relegation to the B-League following the 1952/53 A-League season, they returned to their original name, Ankerbrot, in 1955. They played in the Vienna Regional League in the following years. In 1958, Ankerbrot finished first in the Vienna League . They participated in the relegation play-offs to the B-League. They won this play-off with a 4-1 and 0-2 victory over SK VÖEST Linz. After the B-League was replaced by the Regionalligas as the second tier of play in 1959, Ankerbrot was promoted to the Regionalliga Ost (Eastern Regional League), but was relegated one point behind. After Ankerbrot's relegation from the Vienna League in 1963, the former first division club began a downward spiral into the second tier. In 1983, Ankerbrot merged with FC Laaerberg (founded in 1922) to form KSV Ankerbrot-Laaerberg. In 1989 they merged with SC St. Anton-Inzersdorf to form KSV Ankerbrot-St. Anton-Laaerberg. Finally, in 1998, the club returned to the fourth-tier Vienna League as KSV Ankerbrot Montelaa. In 2006, the club was relegated to the Oberliga A, only to be promoted back to the Stadtliga in 2007 as champions of the Oberliga A. In the summer of 2006, KSV Ankerbrot Montelaa took over the former Wienerfeldplatz as its new home, which from then on was renamed the ANKER ARENA. In 2010 the club had to return to the Oberliga, and the following year they were even relegated to the 1st Class A. In 2012 they were able to return to the Oberliga as runners-up in the 1st Class A. ==Women football == In the 1970s, Ankerbrot also ran a successful women's team. In 1975, the team sensationally won the championship title in the women's league, which was then organized by the Vienna Football Association. The champions of this league are generally considered Austrian champions, but are not recognized by the Austrian Football Association (ÖFB). The women's football section was dissolved after this championship-winning season. In the 2015/16 season, the club tried to build a team, which was then dissolved a year later. Category:Austrian football clubs Category:Football clubs of Vienna Category:1936 establishments in Europe Category:1930s establishments in Austria",
 "title": "KSV Ankerbrot Montelaa"
}