{
 "id": "1175199",
 "text": "Amanda Belle Waller (née Blake) is a fictional character in the DC Extended Universe (DCEU), portrayed by actress Viola Davis. Based on the DC Comics character of the same name, she is a powerful and ruthless government official, often depicted as the director of A.R.G.U.S. and the mastermind behind the formation of Task Force X, also known as the Suicide Squad. Waller is known for her intelligence, manipulative tactics, and willingness to use extreme measures to achieve her goals, including leveraging the powers of supervillains. In the DCEU, Waller first appears in Suicide Squad (2016), where she assembles the Squad to carry out dangerous missions in exchange for reduced sentences. Her character is complex, often operating in morally gray areas, and she believes that the ends justify the means, even if that involves significant collateral damage. Waller also appears in Birds of Prey (2020) and plays a notable role in The Suicide Squad (2021), further exploring her character's motivations and ethical boundaries. She also makes an cameo appearance in Black Adam (2022) with an uncredited cameo, as well as the first season of the television series Peacemaker (2022–present). The character is integrated into the rebooted continuity of the DC Universe (DCU) media franchise, returning in both the animated series Creature Commandos (2024–present), and being set to feature in the live-action series Waller as the main protagonist. Throughout these films, Waller is depicted as a formidable antagonist who is not to be underestimated, reflecting her role as a significant figure in the DC universe Viola Davis's portrayal of Amanda Waller has been widely praised for bringing depth and strength to the character, and she has become a fan favorite in the DCEU. == Appearances == === Movie appearances === Year Movie Portrayed by 2016 Suicide Squad Viola Davis 2020 Birds of Prey 2021 The Suicide Squad 2022 Black Adam (uncredited cameo) === Television appearances === Year Television series Seasons Episodes Portrayed by 2022-present Peacemaker 1 8 Viola Davis 2024-present Creature Commandos 7 TBA Waller TBA TBA Category:DC Extended Universe characters Category:DC Comics movie characters",
 "title": "Amanda Waller (DC Extended Universe)"
}