{
 "id": "1175432",
 "text": "Gülfem Hatun (; meaning \"rose mouth\", died October– November 1561) was a lady- in-waiting in the harem of Ottoman sultan Suleiman the Magnificent (reign 1520–1566). == Life with Suleiman == When Suleiman was a prince, Gülfem was a concubine in his Manisa harem. After his accession to the throne in 1520, she came to live in the old palace in Constantinople. During Suleiman's reign, she enjoyed considerable status in the imperial harem and received a salary of 150 aspers per day. She was Hürrem Sultan's closest companion and often wrote letter to her. She would inform Hürrem Sultan about various matters through letters. She would present many humorous messages in the letters. Suleiman sent Gülfem a box of intoxicating (kolonya) sweets and some money. Gülfem unintentionally ate the entire box of sweets and became very ill. Despite attempts to cure her, she slept most of the day. When this ridiculous incident spread throughout the palace, Süleyman became the butt of laughter. This forced Gülfem Hatun to discuss the incident with Süleyman. In 1559, Hürrem's son, Prince Bayezid, rebelled against Suleiman. At Hürrem's advice, Gülfem wrote a letter to Bayezid advising the rebellious prince to accept his father's wishes. == Charities == In September 1542, she opened a soup kitchen in Üsküdar. In March 1543, she built a mosque near the soup kitchen, a \"wooden-framed mosque\", now known as the \"Gülfem Hatun Mosque\". According to local tradition, the mosque was built for women's use but was initially used only by men. The complex also included a maktab, a madrasa and a caravanserai. The mosque is still intact. == Death == She died in October–November 1561 and was buried in the courtyard of his own mosque. == In popular culture == * In the 2003 Turkish TV miniseries, Hurrem Sultan, Gülfem Hatun was played by Turkish actress Yasemin Kozanoglu. * In the 2011-2014 Turkish historical fiction TV series Muhteşem Yüzyil, Turkish actress Selen Öztürk played Gülfem Hatun. ==References== ==Bibliography== * * * * * * Category:1561 deaths Category:Consorts of Ottoman sultans Category:Ottoman people Category:Turkish Muslims Category:Concubines of Ottoman sultans",
 "title": "Gülfem Hatun"
}