{
 "id": "1175157",
 "text": "Szegi is a village in Tokaj District of Borsod-Abaúj-Zemplén County. Its population in 2024 was 250. == Location == It is located on the right bank of the Bodrog River, not far from where the river flows into the Tisza, within the Tokaj wine region. It essentially has only two neighboring settlements: Szegilong to the north-northeast and Bodrogkisfalud to the south; its outer areas also touch the border of Olaszliszka in the east. == History == Until 1913, it was part of Bodrogkisfalud. At that time, it became an independent municipality with the temporary name Pusztaszeg, and a year later, it was named Szegi. In 1950, it was merged again with Bodrogkisfalud under the joint name Bodrogszegi. Finally, in 1991, the two settlements separated once more, becoming Bodrogkisfalud and Szegi. == Politics == Mayors * 1991–1994: József Bódy (independent) * 1994–1998: József Bódy (independent) * 1998–2002: Ferencné Fekete (Zemplén Settlement Association) * 2002–2006: Ferencné Fekete (Zemplén Settlement Association) * 2006–2010: Tivadar Horányi Jr. (independent) * 2010–2014: Tivadar Horányi (independent) * 2014–2019: Csaba Gabura (independent) * 2019–2024: Andrea Trudics (independent) * 2024–: Andrea Trudics (Fidesz-KDNP) Election fraud In 2024 a big problem happened during the local election on June 9. Many people who did not live in Szegi were suddenly registered to vote there. In March, only 246 voters were listed in the village, but by June, this number jumped to 348. That’s 102 extra people, and 70 of them were added just in the week before the election. Some of these new voters were paid 10,000 forints (about 25 euros) to vote for the Fidesz candidate, Andrea Trudics. They were brought to Szegi in small buses from nearby villages like Taktaharkány. Many of them had never even been to Szegi before. They were given papers telling them who to vote for, and some even showed these papers instead of their ID cards at the voting station. The Fidesz candidate, Andrea Trudics, won the election with 153 votes, while the independent candidate, Tibor Kisvárdai, got 105 votes. But people in Szegi were angry because they felt the election was not fair. They said it was wrong that outsiders decided their village’s leader. Some villagers signed a petition, and Kisvárdai took the case to court. The Curia of Hungary agreed that the election was not fair. They said the new voters were added just to change the result. So, they canceled the election and ordered a new one for July 7, 2024. In the new election, the same problems happened again. More unknown people were brought to vote, and Fidesz's Andrea Trudics won again. Kisvárdai complained, but this time, the court said there was not enough proof of cheating, so the result stayed. Many people in Szegi were still upset, believing the election was not honest. Later, the police started investigating the case because they thought it might be a crime against the election rules. == Population == In 2022, 89.7% of the population identified as Hungarian, 0.8% as German, and 3.6% as belonging to other non-domestic nationalities (10.3% did not declare; due to dual identities, the total may exceed 100%). In terms of religion, 30% were Roman Catholic, 11.9% Reformed, 14.2% Greek Catholic, and 8.3% non-denominational (35.6% did not respond). == Notes == Category:Settlements in Borsod-Abaúj-Zemplén County Category:Villages in Hungary",
 "title": "Szegi"
}