{
 "id": "1175746",
 "text": "Julian Lee Moriarty (born June 6, 1994) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH). He is a member of the Shane Taylor Promotions stable. Moriarty has also made appearances in Game Changer Wrestling (GCW), Pro Wrestling Guerrilla (PWG), and Major League Wrestling (MLW). In ROH, Moriarty is a one-time ROH Pure Champion. ==Career== ===All Elite Wrestling / Ring of Honor === On August 17, 2021 episode of Dark, Moriarty made his AEW debut and lost to Dante Martin. On October 15, 2021, AEW owner Tony Khan announced that Moriarty had signed a contract to become a full-time member of the AEW roster. Moriarty earned his first victory in AEW after he defeated Nick Comoroto on the November 23 episode of Dark. On the December 1 episode of Dynamite, Moriarty faced CM Punk but lost. At Fyter Fest, Moriarty challenged Jonathan Gresham for his ROH World Championship but lost. On the February 10, 2023 episode of Rampage, Moriarty challenged Orange Cassidy for his AEW All- Atlantic Championship but lost. On the June 1 episode of Rampage, Moriarty challenged Katsuyori Shibata for his ROH Pure Championship but was unsuccessful. In September 2023, Moriaty was recruited by Shane Taylor to join his revived stable Shane Taylor Productions. On the December 7 episode of ROH on HonorClub, Moriarty defeated Tracy Williams for a chance to challenge for the vacated ROH World Television Championship. He fought Kyle Fletcher, Komander, Bryan Keith, Lee Johnson, and Dalton Castle in the Survival of the Fittest Finals but the match was won by Fletcher. On the July 4, 2024 episode of ROH on HonorClub, Moriarty fought Wheeler Yuta for the ROH Pure Championship which ended in a 10-minute time limit draw. In a rematch at Death Before Dishonor, Moriarty defeated Yuta to become the new ROH Pure Champion. == References == ==Other websites== * Category:1995 births Category:Living people Category:African-American wrestlers Category:All Elite Wrestling people Category:American professional wrestlers Category:Sportspeople from Pittsburgh",
 "title": "Lee Moriarty"
}