{
 "id": "1175660",
 "text": "Rao Yi (; born 1962) is a Chinese neurobiologist. A Ph.D. graduate from the University of California, San Francisco, Rao held a Helen Hay Whitney fellowship at Harvard University and was on the faculty of Washington University in St. Louis and Northwestern University before moving back to China to take up the deanship of Peking University's School of Life Sciences in 2007.https://www.hkbu.edu.hk/en/about/honorary-doctorates-and-honorary- university-fellows/rao-yi.html He is currently Director and Principal Investigator of IDG/McGovern Institute for Brain Research at Peking University. He became the President of the Capital Medical University on 25 June 2019. ==Personal life and education== Rao was born in Jiangxi in 1962. In college, he was friends with Mei Lin, who also became a neurobiologist later. In graduate school at Shanghai Medical University, Rao was roommates with , now also an eminent neurobiologist. At SMU, his interests began to turn to molecular neurobiology. In 1985, Rao became a graduate student at the University of California, San Francisco. He describes the atmosphere at UCSF as far more exciting than that in China. His advisors were Yuh-Nung and Lily Jan. He discovered the big brain gene, which is needed for a binary decision in neural development: to form a neuron or an epidermal cell. He defended his doctoral thesis on molecular and genetic analysis of intercellular communication in Drosophila neurogenesis at UCSF in 1991. ==Career and research interests== After graduating from UCSF, Rao received a Helen Hay Whitney fellowship for postdoctoral research in the Department of Biochemistry and Molecular Biology at Harvard University. There he worked on embryonic induction in vertebrates. He then joined the faculty of Washington University in St. Louis in 1994. There he started his first laboratory. He moved to Northwestern University in Chicago in 2004, and was named the university's first Elsa A. Swanson Research Professor in 2006. Other honours he received include the Esther A. and Joseph Klingenstein Fellowship in Neuroscience in 2000, and the Charles B. Wilson Brain Tumor Research Excellence Award in Neuroscience. He also served on the editorial board of The Journal of Neuroscience, Developmental Biology, Developmental Brain Research, Neuroscience Research. He moved back to China in 2007 to be the dean of Peking University's School of Life Sciences. He stepped down from the deanship in 2013. In 1997, Rao discovered that a single origin gave rise to two eyes in frog and chicken embryos. In 1999, he showed that the secreted protein encoded by the Slit gene was a repellent guidance cue for axons. He has later found that Slit could repel migrating neurons, chemotactic leukocytes and brain tumor cells. Rao has uncovered major components in the signal transduction pathways for Slit and the axon attractant Netrin.. In China, Rao switched to studies of molecular and cellular mechanisms of behaviors and has found neurotransmitters needed for aggression and courtship in Drosophila and the mouse. ==References==",
 "title": "Rao Yi"
}