{
 "id": "1175362",
 "text": "The guerrilla war in the Baltic states refers to a series of armed resistance actions led by Latvian, Estonian and Lithuanian partisans between 1944 and 1956 against the totalitarian Soviet occupation. Those who participated in the guerrilla war are commonly known as the Forest Brothers. While the Soviets cracked down on the Forest Brothers, at least 505,000 Baltic states' residents (124,000 from Estonia, 136,000 from Latvia and 245,000 from Lithuania) were deported to forced labor camps in Russian mainland.* The Baltic States. Years of dependence 1940-1990 (Romuald J. Misiunas, Rein Taagepera, University of California Press, Berkeley and Los Angeles, 1993) * * Narratives of Exile and Identity: Soviet Deportation Memoirs from the Baltic States (V. Davoliute, T. Balkelis, Central European Press, 2018) * A Soviet Story: Mass Deportation, Isolation, Return (Alain Blum, Emilia Koustova in Narratives of Exile and Identity, Central European University Press, 2018) * Soviet Mass Deportation from Latvia, briefing papers of museum of the Occupation of Latvia (Ministry of Foreign Affairs of Latvia) * The History of the Occupation of Latvia (Museum of the Occupation of Latvia) The Baltic states lost 20% of their total population as a result, including 250,000 who fled to Western countries. Soviet forced settlements for Baltic deportees Region of the Soviet Union Families People Average family size % of total deportees Amur Oblast 2,028 5,451 2.7 5.8 Irkutsk Oblast 8,475 25,834 3.0 27.3 Krasnoyarsk Krai 3,671 13,823 3.8 14.6 Novosibirsk Oblast 3,152 10,064 3.2 10.6 Omsk Oblast 7,944 22,542 2.8 23.8 Tomsk Oblast 5,360 16,065 3.0 16.9 Total 30,630 93,779 3.1 99.0 ==Overview== Some research estimated that over 50,000 partisans (10,000 in Estonia, 10,000 in Latvia and 30,000 in Lithuania) joined the resistance against Soviet occupation. The partisans resisted the Soviet occupiers until 1956, when the stronger Soviet troops and their infiltration of the partisans made armed resistance hard to continue. ==Estonia== In Estonia, as many as 15,000 men were part of the Forest Brothers between 1944 and 1953. They were most active in the counties of Võru, Pärnu, Lääne, Tartu and Viru. From November 1944 to November 1947, they killed about 1,000 Soviets. They controlled dozens of towns and villages, disrupting Soviet supply routes. August Sabbe, one of the last surviving Forest Brothers, was found by the KGB in 1978 as a fisherman. ==Latvia== Latvian partisans fought both the Nazis (1941–44) and Soviets (from 1944 onwards), aiming at restoring the Republic of Latvia.Edgars Andersons, Leonīds Siliņš \"Latvijas Centrālā padome – LCP\". Upsala 1994 As such, they were persecuted by both the Nazi and Soviet occupiers. About 40,000 Latvians were part of the Forest Brothers,Plakans, Andrejs. The Latvians: A Short History. Hoover Institution Press, Stanford, 1995. killing 1,562 Soviets. They were active in Aloja, Dundaga, Līvāni, Lubāna and Taurkalne. ==Lithuania== Among the three countries, the Forest Brothers in Lithuania were the best organized. They dominated the whole countryside until 1949. They had assorted mortars, Czech Škoda guns, light machine guns and Russian M1910 Maxim heavy machine guns.* Dundovich, E., Gori, F. and Guercett, E. Reflections on the gulag. With a documentary appendix on the Italian victims of repression in the USSR, Feltrinelli Editore IT, 2003. * * ===Composition=== The Forest Brothers in Lithuania consisted of the former members of the Lithuanian Armed Forces, Lithuanian Territorial Defense Force, Lithuanian Liberty Army and Lithuanian Riflemen's Union, followed by farmers, students and teachers. At least 30,000 Lithuanians were part of the Forest Brothers, many of whom were deported to forced labor camps in Siberia along with their relatives, with a few to no confirmed survivors. The Soviets also dumped some of their bodies at villages to scare others into obeying them. On October 15, 1956, Adolfas Ramanauskas (\"Vanagas\"), chief commander of the Union of Lithuanian Freedom Fighters, released a report to highlight the brutality of the torture some of them had suffered:Kuodytė, Dalia and Tracevskis, Rokas. The Unknown War: Armed Anti- Soviet Resistance in Lithuania in 1944–1953, 2004. ===Notable fighters=== Pranas Končius (code name Adomas) was one of the last few Lithuanian Forest Brothers, who was killed by the Soviets on July 6, 1965. He was awarded the Cross of Vytis posthumously in 2000. Benediktas Mikulis, one of the last known Lithuanian Forest Brothers to live in the forest, was kidnapped by the Soviets in the 1980s, and spent years in jail. #6 Prozariškės ==Colonization during Cold War== The Soviet regime imported millions of colonizers from other parts of the Soviet Union, changing the Baltic states' ethnic composition forever. Ethnic breakdown 1939 1970 1989 Estonians in Estonia 88% 60% 61.5% Latvians in Latvia 75% 57% 50.7% Lithuanians in Lithuania 85% 84.6% 80.6% Contrary to common Russian claims, the Baltic states were exploited subjects rather than beneficiaries from the decades-long Soviet colonization. * * * Declassified archives showed that much more money was taken from the occupied Baltic states than ever invested back, including huge Soviet spending on military infrastructure to oppress the native population. The myth of \"generous Soviet aid in developing the Baltics\" is said to be propaganda invented for justifying Soviet colonization under which the Baltic states' population went through decades of oppressive rule. Despite the Baltic people's decades-long suffering, it received little attention from left-wing scholars in the West, who have substantial influence in academia and history writing. * Lappin, Shalom (2006), ‘How Class Disappeared from Western Politics’, Dissent, Vol. 51, No. 1, pp. 73-78. * * * * Kirsch, Adam (2024), On Settler Colonialism: Ideology, Violence, and Justice, W.W. Norton and Company, New York and London. * * * * * ==Related pages== * Ruscism * Polish Underground State * Soviet persecution of Poles during World War II ==References== Category:Cold War Category:Nationalism Category:1940s in Europe Category:1950s in Europe Category:History of the Soviet Union",
 "title": "Guerrilla war in the Baltic states"
}