{
 "id": "1175293",
 "text": "Mugamoodi ( Mask), subtitled onscreen as The Superhero Within, is a 2012 Indian Tamil-language superhero movie directed by Mysskin and produced by Ronnie Screwvala and Siddharth Roy Kapur. The movie, which is dedicated to Bruce Lee, stars Jiiva, alongside Narain, Pooja Hegde (in her movie debut), Nassar, Selva and Girish Karnad. Mugamoodi was released worldwide on 31 August 2012 to mixed to positive reviews from critics with praise for its VFX, action sequences, direction, music and cast performances. The movie was a commercial success. == Plot == Anand alias Bruce Lee, a martial artist, wears a superhero costume in order to impress his girlfriend Shakthi, but Anand gets framed for his friend Viji's death and sets out to prove his innocence by becoming a real superhero called Mugamoodi. == Cast == * Jiiva as Anand alias Bruce Lee/Mugamoodi * Pooja Hegde as Shakthi, Anand's love interest * Narain as Anguchamy alias Dragon * Nasser as DCP Gaurav, Shakthi's father * Selva as Sifu Chandru, Anand's teacher * Girish Karnad as Anand's grandfather * Aadukalam Naren as Anand's father * Anupama Kumar as Roshini, Shakthi's mother * Santhanam as Anand’s friend * Aadukalam Murugadoss as Anand's friend * Kalaiyarasan as Viji, Anand's friend * Ray as Shakthi's brother * Vaishnavi as Shakthi's sister * Meesha Ghoshal as a cop's wife * Darshan as Dragon's sidekick * Manobala as doctor * Krishna Kumar as police commissioner == Music == Mugamoodi's score and soundtrack were composed by K, who had worked on Mysskin's previous movie Yuddham Sei as well. The soundtrack features eleven tracks, including a number of instrumentals. The soundtrack album was released on 1 August 2012 at Sathyam Cinemas and was presented by Vijay and received by Kannada actor Puneeth Rajkumar. The album received positive reviews from critics, praising K's composition, and lyrics. The tracks \"Vaayamoodi Summa Iru Da\" and \"Maayavi\", topped the charts and FM stations. == Release == The movie was released worldwide screens on 31 August 2012 and it would be the 100th film to be released in 2012. == References == Category:2012 movies Category:2010s Indian movies Category:2010s superhero movies",
 "title": "Mugamoodi"
}