{
 "id": "1175552",
 "text": "Madhvacharya (; ; 1199–1278 CE or 1238–1317 CE) was an Indian philosopher and theologian (person who studies theology). He was also called Purna Prajna () and Ānanda Tīrtha. He believed in the Dvaita (dualism) school of Vedanta. Madhva called his opinions Tattvavāda.This word means \"arguments from a realism viewpoint\". Madhvacharya was born at Pajaka near Udupi in 13th-century India. He became a Sanyasi (monk) when he was a teenager. When he became a monk, he joined the Brahma-sampradaya guru Achyutapreksha, of the Ekadandi order. Madhva studied Hindu philosophy. He also wrote commentaries (opinion pieces) about the Principal Upanishads, the Bhagavad Gita and the Brahma Sutras (Prasthanatrayi). He wrote 37 works that were written in the Sanskrit language. He was known to use very specific words. He did not use many words, either. His greatest work is thought to be the Anuvyakhyana. This work was written with poetic structure. In some of his works, he said that he was an avatar the Hindu god Vayu.Sabapathy Kulandran and Hendrik Kraemer (2004), Grace in Christianity and Hinduism, James Clarke, , pages 177–179 Madhvacharya criticized Adi Shankara's Advaita Vedanta and Ramanuja's Vishishtadvaita Vedanta teachings. He went through India many times. He would have debates and visit Hindu learning places. Madhva created the Krishna Mutt at Udupi with a murti created from Dwarka Gujarat in 1285 CE. Madhvacharya taught that there is a difference between the self (Atman) and reality (Brahman). He said that the self is dependent on the reality. His teachings disagreed with the monist teachings of the other schools of Vedanta. Madhvaharya said that liberation is only possible through God. Madhvacharya's Dvaita school influenced Vaishnavism. It also supported the Bhakti movement in medieval India. The Dvaita school is one of the three important Vedānta philosophies.Stafford Betty (2010), Dvaita, Advaita, and Viśiṣṭādvaita: Contrasting Views of Mokṣa, Asian Philosophy: An International Journal of the Philosophical Traditions of the East, Volume 20, Issue 2, pages 215–224 ==References== ==Sources== * * * * * * * * * == Further reading == * * * * * ==Other websites== * * Bibliography of Madhvacharya's works, Item 751 , Karl Potter, University of Washington * \"Madhva\" article in the Internet Encyclopedia of Philosophy * Madhvacharya at Encyclopædia Britannica * A Note on the date of Madhvacharya by S. Srikanta Sastri * Sri Yantrodharaka Hanuman Stotram by Sri Vyasa Rajaru *Discussion on quotations and interpretations by Madhvacharya. https://gosai.com/writings/the-divinity-of-sri-caitanya-mahaprabhu-0 Category:1238 births Category:Writers from Karnataka Category:Year of death unknown Category:13th-century writers Category:Indian writers Category:Indian philosophers Category:Indian poets Category:Indian religious leaders Category:Hindu saints Category:People from Karnataka Category:History of India Category:Hindu monks Category:Indian Hindus",
 "title": "Madhvacharya"
}