{
 "id": "1175655",
 "text": "Ozone is a six-member boy band under Sony Music Taiwan. It was formed via fan- voting of individuals, and is a group of the popular members from the idol survival show talent show Atom Boyz. The members include Zhou Zuan, Zhou Zixiang, Huang Wenting, Lin Jiachen, Lin Huanjun and Li Zheyan. Ozone announced its official debut with at the Sony Music 2022 New Boy Group Press Conference on September 13, 2022, and released its first EP Unicorn on December 23 of the same year. In June 2023, they won their first award with their EP Unicorn at the Hito Pop Music Awards. In October of the same year, they released their first group variety show Ozone Summer Go! Youth Adventure to celebrate the first anniversary of their debut. == History == === Before Atom Boyz === Zhou Zixiang trained as a trainee in South Korea for half a month before participating in the 2016 Taiwanese idol show Show Star 2, but was eliminated in the 100-person audition round. From 2016 to 2017, Lin Huanjun went to South Korea to be a trainee under SM Entertainment. In 2019, he participated in Produce Camp 2019, also known as CHUANG 2019, produced by Tencent Video in mainland China, before withdrawing due to accusations of supporting Taiwanese independence. Huang Wenting and Lin Jiachen participated in the \"Youthful Boys\" category of the 7th Eelin Brilliant Star competition in 2018, with Huang Wenting winning the championship and Lin Jiachen winning runner-up. They subsequently, with Zhou Zuan, participated in the \"Star Hunting Plan\" held by Like Music Company in the same year and were spotted by Chen Zihong, forming the trainee boy group E.M.B. (Enjoy Music Boys) with 3 other trainees under the same company, Lu Zhiyu (LCY 呂植宇), Cao Jiaqi (曹家齊), and Chen Shuifeng (陳水豐). Zhou Zixiang also participated in the \"Star Hunting Plan\" but was not chosen. In 2019, E.M.B. won the championship of the 16th Shin Kong Cup Street Dance Competition with the team \"Super Daddy,\" but lost the chance to debut the following year when Like Music announced it would debut girl group PER6IX first. In 2020, Li Zheyan participated in the \"Performing Arts\" group of the 9th Eelin Brilliant Star competition and won third place. === Atom Boyz === In 2021, Wildfire Entertainment started preparing for the boy band talent show Atom Boyz, with contestants grouped into planet teams with different concepts based on characteristic and style. Huang Wenting, Lin Jiachen, and Zhou Zuan were selected to be contestants in the \"Earth\" group, with a fresh and youthful \"boy next door\" concept. Zhou Zixiang, Lin Huanjun, and Li Zheyan were selected to be in \"Neptune,\" \"Saturn,\" and \"Mars\" respectively. The show was set to film in the latter half of 2021, but was postponed twice, due to the initial COVID-19 pandemic and the later spread of the Omicron variant in Taiwan. During the second delay, in 2022, Lin Jiachen and Li Zheyan formed the songwriting and producing group ΛTLΛNTIX (亞特蘭提斯) with four other Atom Boyz contestants, Wu Yuting (吳昱廷), Gao Youxiang (高有翔), MAX (徐彭臒), and LCY (呂植宇). == Name == === Group === The band's name Ozone is derived from the three oxygen atoms (O) that make up Ozone (O3), which symbolize origin, optimism, and originality. === Fans === Ozone announced their official fan name \"O.A.O.\" on November 1, 2022. It is an abbreviation of \"One and Only,\" and it expresses the meaning that \"fans are the one and only thing in the group Ozone and the driving force behind Ozone's progress,\" and the hope that \"Ozone can also become fans' one and only.\" == Members == Name Chinese Name English Name Birthday Place of Birth Position Zhou Zuan 周祖安 Andrew October 15, 1999 Taipei City, Taiwan Leader, eldest, lead dancer Zhou Zixiang 周子翔 Samuel November, 22, 1999 Hualien County, Taiwan Lead vocal Huang Wenting 黃文廷 Tin May 27, 2000 Taipei City, Taiwan Lead dancer, martial arts stunts Lin Jiachen 林佳辰 Summer June 5, 2000 New Taipei City, Taiwan Face of the group, main vocal, songwriter/producer Lin Huanjun 林煥鈞 Rex October 18, 2000 New Taipei City, Taiwan Main dancer Li Zheyan 李哲言 Jim December 15, 2000 Taipei City, Taiwan Maknae, main rapper, songwriter/producer == References == Category:2020s music groups Category:2022 establishments in Asia Category:2020s establishments in Taiwan Category:Boy bands Category:C-pop Category:Musical groups established in 2022 Category:Pop music groups Category:Taiwanese musical groups",
 "title": "Ozone (group)"
}