{
 "id": "1175018",
 "text": "Dru-Zod, a character from the DC Extended Universe (DCEU), is primarily represented by General Zod, a Kryptonian antagonist famously associated with Superman from DC Comics publications. The character has been portrayed notably by actor Michael Shannon in the film Man of Steel, which was released in 2013 and directed by Zack Snyder. General Zod is a military leader from the planet Krypton and has a complex and often antagonistic relationship with Superman (Kal-El). In various iterations of the DC Comics lore, Zod is often depicted as a powerful being who possesses similar abilities to Superman, including super strength, flight, heat vision, and invulnerability, due to Earth's yellow sun. In Man of Steel, Zod returns to Earth after Krypton's destruction, seeking to rebuild his home world and impose his rule on Earth. His character is driven by a strong sense of duty to his people and a desire to restore Krypton, even at the expense of Earth's inhabitants. The film explores themes of power, responsibility, and the moral dilemmas faced by both Zod and Superman. Michael Shannon's portrayal of Zod received praise for bringing depth to the character, showing him as both a ruthless warrior and a tragic figure motivated by loss and a desire to protect what remains of his race. General Zod has appeared in various forms of media beyond the DCEU, including comic books, animated series, and other Superman adaptations. He is often depicted as one of Superman's most iconic villains, embodying the conflict between duty to one's people and moral integrity. Overall, Zod's role in the DCEU contributes to the overarching narrative of Superman's journey and struggles as he navigates his identity as both a Kryptonian and a protector of Earth. == Appearances == === Movie appearances === Year Movie Portrayed by 2013 Man of Steel Michael Shannon 2016 Batman v Superman: Dawn of Justice (Credit only) 2023 The Flash Category:DC Extended Universe characters Category:DC Comics movie characters",
 "title": "Zod (DC Extended Universe)"
}