{
 "id": "1175141",
 "text": "This is a list of songs recorded by Shakira. == Released songs == Key Indicates single release Indicates promotional single release Title song Album Writer Year Ref. \"1968\" Peligro Shakira, Eduardo Paz 1993 \"23\" Shakira Shakira, Luis Fernando Ochoa 2014 \"Acróstico\" Las Mujeres Ya No Lloran Keityn, Shakira, Luis Fernando Ochoa, Lexus 2023 \"Addicted to You\" Sale el Sol Shakira, El Cata, Luis Fernando Ochoa, John Hill 2010 \"Always on My Mind\" VH1 Divas Las Vegas Johnny Christopher, Mark James, Wayne Carson Thompson 2002 \"Amarillo\" El Dorado Shakira, Luis Fernando Ochoa 2017 \"Amor (Celos de ti)\" Al Compas de un Sentimiento Pedro Flores 1996 \"Animal City\" Oral Fixation Vol. 2 Shakira, Luis Fernando Ochoa 2005 \"Antes de las Seis\" Sale el Sol Shakira, Lester Méndez 2010 \"Antología\" Pies Descalzos Shakira, Luis Fernando Ochoa 1996 \"Años Luz\" She Wolf Shakira, Jorge Drexler, Pharrell Williams 2009 \"Ask for More\" Shakira 2003 \"Ay Haiti\" (with Artist for Haiti) Carlos Jean, Dnovae 2010 \"Back in Black\" (Live) Live & off the Record Angus Young, Malcolm Young, Brian Johnson 2004 \"Beautiful Liar\" B'Day (deluxe edition) Irreemplazable Mikkel S. Eriksen, Tor Erik Hermansen, Amanda Ghost, Ian Dench, Beyoncé Knowles 2007 \"Blanca Mujer\" (Draco Rosa featuring Shakira) Vida Draco Rosa 2013 \"Boig per Tu\" Shakira (Spanish/Latin American deluxe edition) Josep Bellavista, Carlos Hernandez, Juan Clapera, Alberto Herrera 2014 \"Broken Record\" Shakira Shakira, Busbee 2014 \"Brujería\" Peligro Eduardo Paz 1993 \"Can't Remember to Forget You\" (feat. Rihanna) Shakira Shakira, John Hill, Tom Hull, Daniel Alexander, Erik Hassle, Robyn Fenty 2014 \"Cazador de Amor\" Magia Shakira 1991 \"Chantaje\" (with Maluma) El Dorado Shakira, Maluma, Kenai, The RudeBoyz 2016 \"Chasing Shadows\" Shakira (Deluxe edition) Sia Furler, Fernando Garibay, Greg Kurstin 2014 \"Ciega, Sordomuda\" Dónde Están los Ladrones? Shakira, Estéfano Salgado 1998 \"Clandestino\" (with Maluma) Shakira, Juan Luis Londoño, Edgar Barrera 2018 \"Coconut Tree\" El Dorado Shakira, Luis Fernando Ochoa 2017 \"Cohete\" (with Rauw Alejandro) Las Mujeres Ya No Lloran Shakira, David A. Sprecher, Mario Cáceres, Vicente Jiménez 2024 \"Comme moi\" (with Black M) El Dorado Diallo, Shakira, Nasti, Dadju, Dany Synthé 2017 \"Cómo Dónde y Cuándo\" Las Mujeres Ya No Lloran Alberto Meléndez, Shakira, Servando Primera, Rafa Rodríguez, Daniel Rondón 2024 \"Controlas Mi Destino\" Peligro Shakira 1993 \"Copa Vacía\" (with Manuel Turizo) Las Mujeres Ya No Lloran Shakira, Gale, DallasK, Daniela Blau, Juan Diego Medina Vélez, Julián Turizo Zapata, Manuel Turizo, Slow 2023 \"Costumes Makes the Clown\" Oral Fixation Vol. 2 Shakira, Brendan Buckley 2005 \"Cuentas Conmigo\" Magia Juanita Loboguerrero, Miguel Enrique Cubillos 1991 \"Cut Me Deep\" (feat. Magic! Shakira Shakira, Nasri Atweh, Mark Pellizzer, Alex Tanas, Ben Spivak, Adam Messinger 2014 \"Dançando\" Real Fantasia Dan Kambaiah, Davi Salles, Shakira, Joel Antonio, López Castro 2012 \"Dare (La La La)\" Shakira Shakira, Lukasz Gottwald, Mathieu Jomphe- Lepine, Max Martin, Henry Walter, Raelene Arreguin, John J. Conte Jr. 2014 \"Deja Vu\" (with Prince Royce) El Dorado Geoffrey Rojas, Shakira, Daniel Santacruz, Manny Cruz 2017 \"Despedida\" Love in the Time of Cholera Shakira, Pedro Aznar 2008 \"Devoción\" Sale el Sol Shakira, Jorge Drexler, John Hill, Sam Endicott, Gustavo Cerati 2010 \"Dia de Enero\" Fijación Oral Vol. 1 Shakira, Lester Méndez 2005 \"Día Especial\" (featuring Gustavo Cerati) Fijación Oral Vol. 1 Shakira, Gustavo Cerati 2005 \"Did It Again\" She Wolf Shakira, Pharrell Williams 2009 \"Did It Again\" (remix) (featuring Kid Cudi) She Wolf (U.S. deluxe edition) Shakira, Pharrell Williams, Kid Cudi 2009 \"Don't Bother\" Oral Fixation Vol. 2 Shakira, Scott Spock, Lauren Christy, Graham Edwards, Heather Reid, Leisha Hailey 2005 \"Don't Wait Up\" Shakira, Emily Warren, Ian Kirkpatrick 2021 \"Don't You Worry\" (with Black Eyed Peas) Elevation Allan Pineda, David Guetta, Jimmy Gomez, Johnny Goldstein, Mikkel Cox, Shakira, Tobias Frederiksen, William Adams 2022 \"Dónde Están los Ladrones?\" Dónde Están los Ladrones? Shakira, Luis Fernando Ochoa 1998 \"Dónde Estás Corazón?\" Pies Descalzos Shakira, Luis Fernando Ochoa 1996 \"Dreams for Plans\" Oral Fixation Vol. 2 Shakira, Brendan Buckley 2005 \"El Jefe\" (with Fuerza Regida) Las Mujeres Ya No Lloran Shakira, Edgar Barrera, Kevyn Mauricio Cruz, Manuel Lorente Freiré 2023 \"El Último Adiós (The Last Goodbye)\" (with various artists) Gian Marco, Emílio Estefan Jr. 2001 \"Empire\" Shakira Steve Mac, Ina Wroldsen 2014 \"En Tus Pupilas\" Fijación Oral Vol. 1 Shakira, Luis Fernando Ochoa 2005 \"(Entre Paréntesis)\" (with Grupo Frontera) Las Mujeres Ya No Lloran Shakira, Kevyn Cruz, Edgar Barrera, Yohanes Manuel, Lenin Palacios 2024 \"Eres\" Peligro Shakira 1993 \"Escondite Inglés\" Fijación Oral Vol. 1 Shakira 2005 \"Esta Noche Voy Contigo\" Magia Miguel Enrique Cubillos 1991 \"Este Amor Es Lo Más Bello del Mundo\" Peligro Eduardo Paz 1993 \"Estou Aqui\" Pies Descalzos (Brazilian edition) Shakira, Luis Fernando Ochoa 1996 \"Estoy Aquí\" Pies Descalzos Shakira, Luis Fernando Ochoa 1996 \"Eterno Amor\" Peligro Eddie Sierra 1993 \"Eyes Like Yours (Ojos Así)\" Laundry Service Shakira, Gloria Estefan, Pablo Florez, Javier Garza 2001 \"Fool\" Laundry Service Shakira, Brendan Buckley 2001 \"Gafas Oscuras\" Magia Shakira 1991 \"Girl Like Me\" (with Black Eyed Peas) Translation William Adams, Allan Pineda, Jimmy Luis Gomez, Shakira Mebarak, Brendan Buckley, Johnny Goldstein, Albert Menendez, Tim Mitchell 2020 \"Gitana\" She Wolf (Spanish/Latin American deluxe edition) Shakira, Amanda Ghost, Ian Dench, Carl Sturken, Evan Rogers, Jorge Drexler 2009 \"Give It Up to Me\" (featuring Lil Wayne) She Wolf (North American deluxe edition) Timothy Mosley, Shakira, Dwayne Carter, Amanda Ghost 2009 \"Good Stuff\" She Wolf Shakira, Pharrell Williams 2009 \"Gordita\" (featuring Residente Calle 13) Sale el Sol Shakira, Calle 13 2010 \"Gracias a la Vida\" (with Juanes, Alejandro Sanz, Laura Pausini, Miguel Bosé, Beto Cuevas and Michael Bublé) Violeta Parra 2010 \"Gypsy\" She Wolf Amanda Ghost, Shakira, Ian Dench, Carl Sturken, Evan Rogers 2009 \"Hay Amores\" Love in The Time of Cholera Shakira, Pedro Aznar 2007/2008 \"Hey You\" Oral Fixation Vol. 2 Shakira, Tim Mitchell 2005 \"Hips Don't Lie\" (featuring Wyclef Jean) Oral Fixation Vol. 2 (Reloaded edition) Wyclef Jean, Shakira, Oscar Arfanno, LaTravia Parker 2006 \"How Do You Do\" Oral Fixation Vol. 2 Shakira, Lauren Christy, Scott Spock, Graham Edwards 2005 \"I'll Stand by You\" (featuring The Roots) Hope for Haiti Now Chrissie Hynde, Tom Kelly, Billy Steinberg 2010 \"Illegal\" (featuring Carlos Santana) Oral Fixation Vol. 2 Shakira, Lester Mendez 2005 \"Aatini Al Nay\" (Intro) Oral Fixation Tour Fairuz, Rahbani BrothersPossible song writer 2007 \"Inevitable\" Dónde Están los Ladrones? Shakira, Luis Fernando Ochoa 1998 \"Islands\" Sale el Sol The xx 2010 \"Je L'Aime à Mourir\" Shakira: Live from Paris Francis Cabrel 2011 \"King and Queen\" (Wyclef Jean featuring Shakira) Carnival Vol. II: Memoirs of an Immigrant Wyclef Jean, Shakira 2007 Shakira#Collaborations and other work \"Knock on My Door\" Luis Fernando Ochoa, Shakira 2003 \"La Bicicleta\" (with Carlos Vives) El Dorado Shakira, Carlos Vives, Andrés Castro 2016 \"La Fuerte\" (with Bizarrap) Las Mujeres Ya No Lloran Thomas Bangalter, Edwin Birdsong, Shakira, Guy-Manuel de Homem-Christo, Kevyn Cruz, Alberto Meléndez, Leonardo Zapata 2024 \"La La La (Brasil 2014)\" (featuring Carlinhos Brown Shakira (International physical deluxe edition) Shakira, Lukasz Gottwald, Mathieu Jomphe-Lepine, Max Martin, Henry Walter, Raelene Arreguin, John J. Conte Jr. 2014 \"La La La (Brasil 2014) (Spanish Version)\" (featuring Carlinhos Brown Shakira (Spanish/Latin American deluxe edition) Shakira, Lukasz Gottwald, Mathieu Jomphe-Lepine, Max Martin, Henry Walter, Raelene Arreguin, John J. Conte Jr. 2014 \"La La La\" Shakira Shakira, Lukasz Gottwald, Mathieu Jomphe- Lepine, Max Martin, Henry Walter, Raelene Arreguin, John J. Conte Jr. 2014 \"La Maza\" (Mercedes Sosa featuring Shakira) Cantora 1 Popi Spatocco 2009 \"La Pared\" Fijación Oral Vol. 1 Shakira, Lester Mendez 2005 \"La Tortura\" (featuring Alejandro Sanz) Fijación Oral Vol. 1 Shakira, Luis Fernando Ochoa 2005 \"Las de la Intuición\" Fijación Oral Vol. 1 Shakira, Luis Fernando Ochoa 2005 \"Lejos de tu Amor\" Magia Pablo Tedeschi 1991 \"Lo Hecho Está Hecho\" She Wolf Shakira, Jorge Drexler, Pharrell Williams 2009 \"Lo Hecho Está Hecho\" (featuring Pitbull) She Wolf (Spanish/Latin American deluxe edition) Shakira, Jorge Drexler, Pharrell Williams, Armando Peréz 2009 \"Lo Imprescindible\" Fijación Oral Vol. 1 Shakira, Lester Mendez 2005 \"Lo Que Más\" Sale el Sol Shakira, Albert Menéndez 2010 \"Loba\" She Wolf Shakira, John Hill, Sam Endicott, Jorge Drexler 2009 \"Loca\" (featuring Dizzee Rascal) Sale el Sol Shakira, El Cata, Dizzee Rascal, Armando Peréz 2010 \"Loca\" (featuring El Cata) Sale el Sol Shakira, El Cata, Armando Peréz 2010 \"Loca por Ti\" Shakira Shakira, Josep Bellavista, Carlos Hernandez, Juan Clapera, Alberto Herrera 2014 \"Long Time\" She Wolf Shakira, Pharrell Williams 2009 \"Magia\" Magia Shakira 1991 \"Mariposas\" Sale el Sol Shakira, Albert Menéndez 2010 \"Me Gusta\" Carlos E. Ortiz Rivera, Daniel Echavarría Oviedo, Emmanuel Gazmey Santiago, Ian Lewis, Joan Antonio González Marrero, Shakira, Édgar Barrera 2020 \"Me Enamoré\" El Dorado Shakira, Rayito 2017 \"Medicine\" (feat. Blake Shelton) Shakira Shakira, Hillary Lindsey, Mark Bright 2014 \"Men in This Town\" She Wolf Shakira, John Hill, Sam Endicott 2009 \"Mi Verdad\" Cama Incendiada Fher Olvera 2015 \"Mon Amour\" She Wolf Shakira, Albert Menéndez 2009 \"Monotonía\" (with Ozuna) Las Mujeres Ya No Lloran Shakira, Ozuna, Keityn, Albert Hype, Nup, Ciey, Primo 2022 \"Moscas en la Casa\" Dónde Están los Ladrones? Shakira 1998 \"Nada\" El Dorado Shakira, Luis Fernando Ochoa 2017 \"Nassau\" Las Mujeres Ya No Lloran Shakira, Marcos Efraín Masís Fernández, Alberto Carlos Melendez, The Roommates, Aldae, Carolina Isabel Colón Juarbe, Daniela Blau, Kevyn Cruz, Taylor Monét Parks 2024 \"Necesito de Ti\" Magia Shakira 1991 \"No\" (featuring Gustavo Cerati) Fijación Oral Vol. 1 Shakira, Lester Mendez 2005 \"No Creo\" Dónde Están los Ladrones? Shakira, Luis Fernando Ochoa 1998 \"Nothing Else Matters/Despedida\" (medley) Shakira: Live from Paris James Hetfield, Lars Ulrich, Shakira, Pedro Aznar 2011 \"Nunca Me Acuerdo de Olvidarte\" Shakira Shakira, John Hill, Tom Hull, Daniel Alexander, Erik Hassle, Robyn Fenty, Jorge Drexler 2014 \"Objection (Tango)\" Laundry Service Shakira 2001 \"Obtener un Sí\" Fijación Oral Vol. 1 Shakira, Lester Mendez 2005 \"Octavo Día\" Dónde Están los Ladrones? Shakira, Lester Mendez 1998 \"Ojos Así\" Dónde Están los Ladrones? Shakira, Javier Garza, Pablo Florez 1998 \"Peligro\" Peligro Eduardo Paz 1993 \"Perro Fiel\" El Dorado Shakira, Nick Caminero, Cristhian Mena, Juan Medina 2017 \"Pés Descalços\" Pies Descalzos (Brazilian edition) Shakira, Luis Fernando Ochoa 1996 \"Pide Más\" Shakira 2003 \"Pídeme el Sol\" Shakira, Luis Fernando Ochoa 2003 \"Pienso en Ti\" Shakira, Luis Fernando Ochoa 1996 \"Pies Descalzos, Sueños Blancos\" Pies Descalzos Shakira, Luis Fernando Ochoa 1996 \"Poem to a Horse\" Laundry Service Shakira, Luis Fernando Ochoa 2001 \"Puntería\" (with Cardi B) Las Mujeres Ya No Lloran David Stewart, Shakira, Carolina Colón, Belcaliz Almanzar, Daniela Blau 2024 \"Pure Intuition\" Shakira, Luis Fernando Ochoa 2007 \"Que Me Quedes Tú\" Laundry Service Shakira, Luis Fernando Ochoa 2001 \"Que Vuelvas\" Dónde Están los Ladrones? Shakira 1998 \"Quiero\" Pies Descalzos Shakira, Luis Fernando Ochoa 1996 \"Quince Años\" Peligro Shakira 1993 \"Rabiosa\" (featuring El Cata) Sale el Sol Shakira, Pitbull, El Cata 2010 \"Rabiosa\" (featuring Pitbull) Sale el Sol Shakira, Pitbull, El Cata 2010 \"Ready for the Good Times\" Laundry Service Shakira, Lester Mendez 2001 \"Rules\" Laundry Service Shakira, Lester Mendez 2001 \"Sale el Sol\" Sale el Sol Shakira, Luis Fernando Ochoa 2010 \"Se Quiere, Se Mata\" Pies Descalzos Shakira, Luis Fernando Ochoa 1996 \"Será, Será (Las Caderas no Mienten)\" (featuring Wyclef Jean) Oral Fixation Vol. 2 (Spanish/Latin American edition) Shakira, Jerry Duplessis, Wyclef Jean 2006 \"Shakira: Bzrp Music Sessions, Vol. 53\" (with Bizarrap) Las Mujeres Ya No Lloran Shakira, Keityn, Bizarrap, Santiago Alvarado 2023 \"She Wolf\" She Wolf Shakira, John Hill, Sam Endicott 2009 \"Sing\" (Annie Lennox featuring various artists) Songs of Mass Destruction Annie Lennox 2007 \"Si Te Vas\" Dónde Están los Ladrones? Shakira, Luis Fernando Ochoa 1998 \"Si Tú No Vuelves\" (Miguel Bosé featuring Shakira) Papito Lanfranco Ferrario, Massimo Grilli, Miguel Bosé 2007 \"Soltera\" TBA Shakira, Keityn, Édgar Barrera, Bizarrap 2024 \"Sombra de Ti\" Dónde Están los Ladrones? Shakira, Luis Fernando Ochoa 1998 \"Something\" Oral Fixation Vol. 2 Shakira, Luis Fernando Ochoa 2005 \"Somos El Mundo 25 Por Haiti\" (with various artists) Michael Jackson, Lionel Richie, Emilio Estefan, Gloria Estefan 2010 \"Spotlight\" Shakira Shakira, Hillary Lindsey, Mark Bright 2014 \"Spy\" (featuring Wyclef Jean) She Wolf Shakira, Wyclef Jean 2009 \"Sueños\" Magia Shakira 1991 \"Suerte\" Laundry Service Shakira, Gloria Estefan, Tim Mitchell 2001 \"That Way\" Shakira (Deluxe edition) Shakira, Olivia Waithe, Roy Battle 2014 \"The One Thing\" Shakira Shakira, Nasri Atweh 2014 \"Te Aviso, Te Anuncio (Tango)\" Laundry Service Shakira 2001 \"Te Dejo Madrid\" Laundry Service Shakira, Tim Mitchell, George Noriega 2001 \"Te Espero Sentada\" Pies Descalzos Shakira 1996 \"Te Felicito\" (with Rauw Alejandro) Las Mujeres Ya No Lloran Shakira, Keityn, Albert Hype, Ily Wonder, Rauw Alejandro, Golden Mindz 2022 \"Te Lo Agradezco, Pero No\" (Alejandro Sanz featuring Shakira) El Tren de los Momentos Alejandro Sanz 2007 \"Te Necesito\" Pies Descalzos Shakira, Luis Fernando Ochoa 1996 \"The Day and the Time\" (featuring Gustavo Cerati) Fijación Oral Vol. 1 Gustavo Cerati, Shakira, Luis Fernando Ochoa 2005 \"The One\" Laundry Service Shakira, Glen Ballard 2001 \"Tiempo Sin Verte\" Las Mujeres Ya No Lloran Shakira, Marcos Masís, Abner Cordero, Richi López, Elena Rose, Alberto Meléndez 2024 \"Timor\" Oral Fixation Vol. 2 Shakira 2005 \"Todo Para Ti\" (Michael Jackson featuring various artists) Michael Jackson, Rubén Blades 2003 Jackson, Michael. \"What More Can I Give\" song credits. Epic Records. Grant, pp. 220–221 \"Todos Juntos\" (Dora the Explorer featuring Shakira) We Did It! Dora's Greatest Hits George R. Noriega, Joel O. Someillan 2011 \"Toneladas\" El Dorado Shakira, Luis Fernando Ochoa 2017 \"TQG\" (with Karol G) Las Mujeres Ya No Lloran Carolina Giraldo, Shakira Mebarak, Daniel Echavarría, Kevyn Cruz 2023 \"Trap\" (with Maluma) El Dorado Shakira, Juan Luis Londoño Arias, Rene Cano Rios, The Rudeboyz 2017 \"Try Everything\" Zootopia Sia Furler, Tor Hermansen, Mikkel Eriksen 2016 \"Tú\" Dónde Están los Ladrones? Shakira, Dylan O'Brien 1998 \"Tutu (Remix)\" (with Camilo and Pedro Capó) Por Primera Vez Camilo Echeverry, Jon Leone, Richi Lopez 2019 \"Tu Boca\" Sale el Sol Shakira, Jorge Drexler, Gustavo Cerati, Tim Mitchell 2010 \"Tú Serás la Historia de Mi Vida\" Peligro Desmond Child 1993 \"Última\" Las Mujeres Ya No Lloran Cristian Camilo Alvarez, Kevyn Cruz, Shakira 2024 \"Último Momento\" Peligro Eduardo Paz 1993 \"Um Pouco De Amor\" Pies Descalzos (Brazilian edition) Shakira, Luis Fernando Ochoa 1996 \"Un Poco de Amor\" Pies Descalzos Shakira, Luis Fernando Ochoa 1996 \"Underneath Your Clothes\" Laundry Service Shakira, Lester Mendez 2001 \"Vuelve\" Pies Descalzos Shakira, Luis Fernando Ochoa 1996 \"Waka Waka (Esto Es África)\" (featuring Freshlyground) Listen Up! The Official 2010 FIFA World Cup Album Shakira, John Hill, Freshlyground, Golden Sounds 2010 Shakira - \"Waka Waka\" (single) Spanish, English and K-mixes versions * * * * \"Waka Waka (This Time for Africa)\" (featuring Freshlyground) Listen Up! The Official 2010 FIFA World Cup Album Shakira, John Hill, Freshlyground, Golden Sounds 2010 Shakira - \"Waka Waka\" (single) Spanish, English and K-mixes versions * * * * \"Waka Waka (Esto Es África)\" (K-Mix) Sale el Sol Shakira, John Hill, Freshlyground, Golden Sounds 2010 Shakira - \"Waka Waka\" (single) Spanish, English and K-mixes versions * * * * \"Waka Waka (This Time for Africa)\" (K-Mix) Listen Up! The Official 2010 FIFA World Cup Album Shakira, John Hill, Freshlyground, Golden Sounds 2010 Shakira - \"Waka Waka\" (single) Spanish, English and K-mixes versions * * * * \"What More Can I Give\" (Michael Jackson featuring various artists) Michael Jackson 2003 \"What We Said\" (with Magic!) El Dorado Diallo, Shakira, Nasri Atweh, Dadju, Dany Synthé 2017 \"When a Woman\" Shakira, The Arcade, Julia Michaels, Magnus Hoiberg, Justin Tranter 2017 \"Whenever, Wherever\" Laundry Service Shakira, Gloria Estefan, Tim Mitchell 2001 \"Why Wait\" She Wolf Shakira, Pharrell Williams 2009 \"You Don't Care About Me\" Shakira Nasri Atweh, Adam Messinger, Chantal Kreviazuk 2014 \"Your Embrace\" Oral Fixation Vol. 2 Shakira, Tim Mitchell 2005 ==Other songs performed== Song Writer Live performances Year \"El Vendedor\" Juan Carlos Calderón, José María Lizar Vivan los niños 1987 \"Quinceañera\" 1988 \"Sin Él\" Marco Antonio Solís 1988 \"Chica Material\" Peter Brown, Robert Rans 1989 \"La Isla Bonita\" Madonna, Patrick Leonard, Bruce Gaitsch 1989 \"Será el Ángel\" Marco Mancilla, Richard Mancilla 1989 \"Dude (Looks Like a Lady)\" Steven Tyler, Joe Perry, Desmond Child Tour of the Mongoose 2002–2003 \"Te Olvide\" (with Joe Arroyo) Antonio María Peñaloza Oral Fixation Tour (in Barranquilla) 2007 \"En la Ciudad de la Furia\" (with Gustavo Cerati) Gustavo Cerati Concierto ALAS 2008 \"La Gota Fría\" (with Carlos Vives) Emiliano Zuleta Baquero Gran Concierto por la Paz (Charity concert) 2008 \"Higher Ground\" (Stevie Wonder & Usher featuring Shakira) Stevie Wonder Lincoln Memorial \"We Are One\" 2009 \"Santa Baby\" Joan Javits, Philip Springer, Tony Springer Christmas in Rockefeller Center 2009 \"Sólo le pido a Dios\" León Gieco Unidos Por Haití (Charity concert) 2010 \"País Tropical\" (with Ivete Sangalo) Jorge Ben The Sun Comes Out World Tour (at Rock in Rio) 2011 \"The Child Will Fly\" (Roger Waters featuring Eric Clapton, Gustavo Cerati, Pedro Aznar, Shakira) Roger Waters, Gustavo Cerati Written for the ALAS Foundation 2011 \"En Barranquilla Me Quedo\" Latin Grammy Awards 2011 Person of the Year event 2011 \"Imagine\" John Lennon United Nations General Assembly 2015 2015 \"A Sky Full of Stars\" (with Coldplay) Guy Berryman, Jonny Buckland, Will Champion, Chris Martin, Tim Bergling Global Citizen Festival Hamburg 2017 \"Ven Devórame Otra Vez\" Palmer Hernández Sabritas commercial 2023 ==Unreleased songs== *\"Africa\" *\"Anywhere Everywhere\"So, here are some song titles of shakira's unreleased songs with official source *\"Bad Weather\" *\"Blinded Speechless\" (\"Ciega, Sordomuda\" English version) *\"Classic\" *\"Confection (feat. Gwen Stefani)\" *\"Doubt\" *\"Enough Heaven to Cry\" (also referred to as \"Come Down Love\" and \"Safe and Fast\") *\"Encariñada\" *\"Entre Tus Brazos\" (\"En Tus Pupilas\" alternate version) *\"Everything I Want\" *\"Falling Down\" *\"I Could Fall in Love with You\" *\"I Don't Wanna Feel\" *\"I Am Here\" (\"Estoy Aquí\" English version) *\"If Life Is a River\" *\"Inevitable (English Version)\" *\"Libertad (ft. Calle 13)\" *\"Lo Mío\" *\"Mad about You\" (\"Boig per Tu\" English version) * \"Mad Love (with Sean Paul & David Guetta)\"(originally titled \"Temple\") *\"Make You Blue\" *\"Move Your Body\" *\"Nassau\" (English version) *\"No Joke\" *\"One\" *\"Our Image\" *\"Peace on Earth\" *\"Peça-me\" *\"Police Escort\" *\"Quiero Más\" *\"Resignación\" (Re-recorded by Spanish singer Ainhoa Cantalapiedra on her debut album Esencia natural) *\"Roll with It\" *\"Send Me an Angel\" *\"Shadows of You\" (\"Sombra de Ti\" English version) *\"She Wolf (French version)\" *\"Skrt on Me\" *\"Sunrise\" *\"Superwoman\" *\"Take Me Higher\" *\"Te Sigo\" *\"The Border\" (featuring Wyclef Jean)Shakira - The Border (Feat. Wyclef Jean), Youtube.com *\"There's a Time\" *\"Understanding\" *\"Vamos\" *\"We'll Never Know\" *\"We're Back\" *\"Western Surf\" *\"When You're Gone\" (released by Jon Secada in 2000) *\"You\" (\"Tú\" English version) ==References== ;Footnotes ==Other websites== * * Shakira",
 "title": "List of songs recorded by Shakira"
}