{
 "id": "1175817",
 "text": "Mansoor Abdul Aziz Mohamed Abdul Aziz Al-Shehail (; born November 11, 1994) is a Saudi-American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH) under the ring name Mansoor. He is one-half of the tag team MxM Collection with Mason Madden. Mansoor has also made appearances in Consejo Mundial de Lucha Libre (CMLL) and WWE. ==Career== ===All Elite Wrestling / Ring of Honor === At Death Before Dishonor: Zero Hour, Mansoor made his ROH debut alongside Mason Madden, defeating Spanish Announce Project (Angélico and Serpentico). On the July 27 episode of Collision, MxM Collection made their AEW debuts in a loss to FTR (Cash Wheeler and Dax Harwood). On the September 11 episode of Dynamite, MxM competed in a Casino Gauntlet Match to become the number one contenders for the AEW World Tag Team Championships but the match was won by The Don Callis Family (Kyle Fletcher & Will Ospreay). On the November 6 episode of Collision, MxM Collecton begam to align themselves with Johnny TV. On the December 12 episode of ROH on HonorClub, MxM challenged Grizzled Young Veterans (James Drake and Zack Gibson) but lost. On February 17, 2025 at Global Wars Australia, MxM challenged The Sons of Texas (Dustin Rhodes and Sammy Guevara) but were unsuccessful. == Other media == Al-Shehail gained early fame after attending a live streamed art instillation ran by actor Shia LaBeouf called He Will Not Divide Us. The instillation was taken over by trolls from 4Chan and Al-Shehail dressed in an eyepatch sang the song \"Snake Eater\" from the 2004 video game Metal Gear Solid 3: Snake Eater, as well as, re-enacted the opening scene to the 2012 movie The Dark Knight Rises. This earned him the names Punished Jesus or Jihadi Jesus from fans. Mansoor runs both a YouTube and Twitch channels with Madden as MxM. == References == ==Other websites== * Category:1995 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:American YouTubers Category:People from Riyadh Category:Saudi Arabian sportspeople Category:Sportspeople from California Category:Twitch (service) streamers",
 "title": "Mansoor (wrestler)"
}