{
 "id": "1175809",
 "text": "Brennan Marcel Williams (born February 5, 1991) is an American professional wrestler and former professional football offensive tackle. He currently wrestles for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH) under the ring name Mason Madden. He is one-half of the tag team MxM Collection with Mansoor. Williams is also known for his time in WWE where he wrestled under then names Dio Maddin, Mace, and ma.çé. Before becoming a professional wrestler, Williams played professional football. He played for the Houston Texans, Jacksonville Jaguars, and New England Patriots. == Career == === All Elite Wrestling / Ring of Honor === At Death Before Dishonor: Zero Hour, Williams, now known as Mason Madden, made his ROH debut alongside Mansoor and they defeated Spanish Announce Project (Angélico and Serpentico). On the July 27 episode of Collision, MxM Collection made their AEW debuts in a loss to FTR (Cash Wheeler and Dax Harwood). On the September 11 episode of Dynamite, MxM competed in a Casino Gauntlet Match to become the number one contenders for the AEW World Tag Team Championships but the match was won by The Don Callis Family (Kyle Fletcher & Will Ospreay). On the November 6 episode of Collision, MxM Collection begam to align themselves with Johnny TV. On the December 12 episode of ROH on HonorClub, MxM challenged Grizzled Young Veterans (James Drake and Zack Gibson) but lost. On February 17, 2025 at Global Wars Australia, MxM challenged The Sons of Texas (Dustin Rhodes and Sammy Guevara) but were unsuccessful. == Personal life == Williams's father is Brent Williams, a former professional football player in the National Football League (NFL). Williams is a fan of video games and anime. He used a running knee called the \"Nico Nico Knee\", a play off the phrase \"Nico Nico Nii\" used by the character Nico Yazawa from the anime Love Live!. The move made it into the video game WWE 2K22. He also did voice overs and narration for various videos, such as narrating \"Jojo's Bizarre Adventure Part 2\" by Did You Know Anime. == Other media == On February 3, 2021, Williams re-launched his YouTube channel, portraying a VTuber character named JiBo. He now runs both the YouTube and Twitch channels with Mansoor as MxM. Williams had previously appeared on many other channels such as The Third Wheel, Thrilling Intent, Stabbyness, and Super Best Friends Play. == References == ==Other websites== * * Category:1991 births Category:Living people Category:African-American wrestlers Category:All Elite Wrestling people Category:American football offensive guards Category:American football offensive tackles Category:American professional wrestlers Category:American YouTubers Category:Houston Texans players Category:Jacksonville Jaguars players Category:New England Patriots players Category:Sportspeople from Massachusetts Category:Twitch (service) streamers",
 "title": "Mace (wrestler)"
}