{
 "id": "1175749",
 "text": "Lionel Gerard Green (born November 11, 1994) is an American professional wrestler and rapper. He currently wrestles for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH) under the ring name Lio Rush. He is one-half of the tag team CRU with Action Andretti. Rush has also made appearances in Combat Zone Wrestling (CZW), Ring of Honor (ROH), WWE, New Japan Pro-Wrestling (NJPW), and Impact Wrestling. Rush has held many championships over his career. In CZW, Rush was a one-time CZW World Heavyweight Champion and two-time CZW Wired Champion. In Impact, he was a one- time Impact X Division Champion. In NJPW, he was the co-winner of the Super Jr. Tag League tournament with Yoh in 2022. In ROH, he was the winner of the Top Prospect Tournament in 2016, and in WWE, he was a one-time NXT Cruiserweight Champion and the winner of the WWE United Kingdom Championship invitational tournament in 2018. ==Career== ===All Elite Wrestling / Ring of Honor === At Double or Nothing, Rush made his debut for All Elite Wrestling (AEW). At the PPV, he made his surprise entrance as the Joker in the Casino Battle Royale. The match was won by Jungle Boy. Shortly after the match, Rush said that he was going to retire because he had separated his AC joint during the match. He decided not to go through with his plans of retirement and AEW owner Tony Khan announced on September 29 that Rush had signed a contract with AEW to become a member of the roster. He began to start teaming with Dante Martin after Martin's partner and older brother Darius Martin was out with injury. On the November 10 episode, Rush made his Dynamite debut. He teamed with Martin and they defeated the team of Lee Moriarty & Matt Sydal. On February 14, 2022, Rush became a free agent and decided to leave AEW. He then had stints in New Japan Pro-Wrestling (NJPW) and Impact Wrestling. On the May 29, 2024 episode of Dynamite, Rush made his surprise return to AEW as a member of the Casino Gauntlet Match. The match was won by Will Ospreay. On the June 21 episode of Rampage, Rush defeated Action Andretti in a qualifying match for the AEW TNT Championship at Forbidden Door. At Forbidden Door, Rush faced Jack Perry, Konosuke Takeshita, Mark Briscoe, Dante Martin, and El Phantasmo in a ladder match for the vacant AEW TNT Championship. The match and championship was won by Perry. On October 12, it was announced that Rush had officially re- signed with AEW. At Winter is Coming, Rush and Andretti defeated Top Flight (Darius and Dante Martin) to earn a shot at the AEW World Tag Team Championships in a future match. On the January 4, 2025 episode of Collision, Rush and Andretti challenged Private Party (Isiah Kassidy and Marq Quen) for their AEW World Tag Team Championships but lost. ==Discography== Solo studio albums * Ever After (2020) * The Final Match (2020) Extended plays * 11:11 (2019) * Not Found (2021) == References == ==Other websites== * Category:1995 births Category:Living people Category:African-American wrestlers Category:All Elite Wrestling people Category:American professional wrestlers Category:Rappers from Maryland Category:Sportspeople from Maryland",
 "title": "Lio Rush"
}