{
 "id": "1175247",
 "text": "Kisrozvágy is a village in Cigánd District of Borsod-Abaúj-Zemplén County. Its population in 2024 was 185. == Location == It is located on the northern edge of the Hungarian part of the Bodrogköz, right next to the Slovakian border, about 90 kilometres northeast of the county seat, Miskolc, by road. The neighbouring settlements on the Hungarian side of the border are Semjén to the east, Ricse to the south-east and Nagyrozvágy to the west. The two nearest settlements on the other side of the border, to the north, are Veľký Horeš and Malý Horeš. == History == In the early 13th century, the village was called Rozvad and was part of the Zemplén Castle estate. It was destroyed during the Mongol invasion. In 1331, Péter Rozvádi, a provost of Eger, owned part of the land here and donated his share to the Eger Chapter. In 1417, it belonged to Mátyás Pazdichy; in 1422, to Mihály Lasztóczi and Antal Rozvágyi; and in 1488, to Balázs Damoska. During the 16th and 17th centuries, it had several owners, including the Serédy, Bejczy, Sztropkói, Herczegh, Sennyey, Perényi, and Kállay families. In the 18th century, it was also owned by multiple families, such as the Perényi, Klobusitzky, Orosz, Pilisy, Sztankay, Revizky, Szirmay, Eötvös, Budaházy, and Ramocsaházy families. In the early 20th century, it belonged to Béla Miklós, who had a large, old manor house here. == Politics == === Mayors === * 1990–1994: János Muha (independent) * 1994–1998: József Simon (Hungarian Workers' Party) * 1998–2002: Sándorné Deák (independent) * 2002–2006: Tamás Petraskó (independent) * 2006–2010: Tamás Tibor Petraskó (independent) * 2010–2012: Tamás Tibor Petraskó (independent) * 2013–2014: Andrásné Verbinyecz (independent) * 2014–2019: Laura Julianna Roják (independent) * 2019–2024: Laura Julianna Roják (independent) * 2024– : Roják Laura Julianna (independent) == Population == In 2022, 92.7% of the population identified as Hungarian, 5.4% as Roma, 1% as Ukrainian, and 0.5% as belonging to other non-domestic nationalities (7.3% did not declare; due to dual identities, the total may exceed 100%). In terms of religion, 16.6% were Roman Catholic, 33.7% Reformed, 13.7% Greek Catholic, and 9.3% non- denominational (26.3% did not respond). == Notes == Category:Settlements in Borsod-Abaúj-Zemplén County Category:Villages in Hungary",
 "title": "Kisrozvágy"
}