{
 "id": "1175453",
 "text": "Sri Rama Chandra Bhanja Deo (17 December 1870 – 22 February 1912) was the Maharaja of Mayurbhanj State of India. Alt URL ==Personal life== ===Early life=== Sriram Chandra Bhanja Deo was only eleven years old when his father, Maharaja Krishna Chandra Bhanja Deo, the ruler of the Mayurbhanj State, passed away. On 29 May 1882, Sriram Chandra Bhanja Deo succeeded to the throne. At that time, the State was under the Court of Wards, governed by a British Commissioner P. Wylly, and the affairs of the state remained under the control of his grandmother, the Dowager Maharani of Mayurbhanj. On 15 August 1892, the Maharaja, having reached the age of 21, came of age and formally assumed the role of Maharaja. ===Death=== Maharaja died due to an accident, while on a hunting trip, when he was accidentally injured by the bullet fired from the gun of his brother-in-law (brother of Sucharu Devi). He was severely injured and was treated in Calcutta, but died there of his injuries. ==Work== ===Administration=== He worked for the all around development of Mayurbhanj and implemented various welfare schemes designed to help the people. He was revered as a philosopher king. He constituted the state council for administration in the state and brought about reforms in the sphere of language, health and administration. He appointed Mohini Mohan Dhar MA B.L. as the Dewan, State Adviser, State Judge, and Vice-President of the State Council in Mayurbhanj State.https://magazines.odisha.gov.in/orissareview/2015/Sept/engpdf/63-67.pdf During his reign, the scientific operation of iron mines was started for the first time and Gorumahisani mines were leased to the Tatas where Mohini Mohan Dhar played the leading role. Mohini Mihan Dhar was head of the Revenue Department, which included the Settlement, Agriculture, Zamindar, and Registration Departments. In 1903, he commissioned a narrow-gauge railway line from Rupsa to Baripada known as Mayurbhanj State Railway. During his reign 474 miles of road were built in State connecting all divisional towns with Baripada. The Baripada Municipality was constituted by him in 1905. He also started an English High School with boarding facility, a government Press, a fully equipped hospital and a leper asylum in Baripada. ==Honours== *Delhi Durbar Gold Medal – 1903. *Maharaja title bestowed upon him by Lord Minto at the 1903 Delhi Durbar, which was later made hereditary in 1910. ==References== ==Other websites== Category:1870 births Category:1912 deaths Category:People from Odisha",
 "title": "Sriram Chandra Bhanj Deo"
}