{
 "id": "1175950",
 "text": "Antonio Alberto Gasalla (9 March 1941 – 18 March 2025) was an Argentine actor, comedian, television scriptwriter, playwright, director, producer and theater teacher. Gasalla began his career as one of the pioneering figures of the \"Café-concert\" alongside Carlos Perciavalle, developing throughout the 20th century a long and distinguished career in both theater and television. ==Biography== Gasalla studied at the National School of Dramatic Arts, where he met Uruguayan actor Carlos Perciavalle, with whom he would later perform in theater shows. In 1966, he had his first hit with Help Valentino, alongside Carlos Perciavalle, Edda Díaz, and Nora Blay. The group founded the Argentine café-concert style, performing several shows. After disbanding, Gasalla and Perciavalle formed a duo, presenting shows such as La mandarina a pedal, among others. Later, in 1973, he began to stage large-scale shows, writing with Enrique Pinti plays such as Pan y circo (Bread and Circus), Gasalla y Corrientes (Gasalla and Currents), Gasalla for Export (Gasalla 77), El Maipo es el Maipo y Gasalla es Gasalla (The Maipo is the Maipo and Gasalla is Gasalla), Gasalla en terapia intensiva (Gasalla in Intensive Care), Maipo 100% Gasalla (Maipo Made in Gasalla), and Gasalla es el Maipo y el Maipo es Gasalla (The Maipo is the Maipo and Gasalla is Gasalla). In 1985, she starred in the Argentine film Esperando la Carroza, in which she played the role of \"Mamá Cora,\" alongside China Zorrilla, Enrique Pinti, Juan Manuel Tenuta, Luis Brandoni, Mónica Villa, and Betiana Blum. Also in 1988, he began her television career on ATC, the program called \"El Mundo de Antonio Gasalla.\" He remained there for thirteen years until 1990, playing the classic roles of \"La Abuela,\" \"Flora, la vendedora pública,\" \"Soledad,\" \"Inesita,\" \"Matilde,\" \"Barbara Don't Worry,\" \"Cacho,\" and \"Yolanda.\" In 1995, he won the 1994 Martín Fierro de Oro Award. ==Private life== He was a fan of Club Atlético Vélez Sarsfield. Antonio Gasalla was always extremely private about his romantic life; he was never known to have any stable relationships. Antonio Gasalla managed to forge lasting friendships with other entertainment figures, such as the one he maintained with journalist Marcelo Polino and Uruguayan actor Carlos Perciavalle. The latter, on several occasions, emphasized having a very close relationship with Gasalla, despite the fact that the press often fabricates disputes between them. Gasalla had a strained relationship with the entertainment press, even insulting journalists who were intrusive when approaching him. Regarding this, his personal friend, Carlos Perciavalle, explained: In his final moments, Gasalla showed signs of cognitive decline and remained out of the media spotlight. He died on March 18, 2025. ==Awards== The Konex Foundation awarded him the Platinum Konex Award for Best Comedian on Television and Best Variety Actor in 1981 and 1991, respectively. In 2001, he received the Diploma of Merit. ==References== ==Other websites== * Category:1941 births Category:2025 deaths Category:Argentine theatre directors Category:Argentine actors",
 "title": "Antonio Gasalla"
}