{
 "id": "1175004",
 "text": "is a Japanese professional wrestler. He currently wrestles for All Elite Wrestling (AEW). Ibushi has also competed in DDT Pro-Wrestling (DDT), New Japan Pro-Wrestling (NJPW), WWE, and Pro Wrestling Noah. He has also wore a mask and went by the ring name Tiger Mask W based on the anime. Ibushi has won many Championships over his career. In DDT, he was a one-time IMGP World Heavyweight Champion, one-time Independent World Junior Heavyweight Champion, three-time Ironman Heavymetalweight Champion, two-time KO-D 6-Man Tag Team Champion, three-time KO-D Openweight Champion, five-time KO-D Tag Team Champion, and the winner of the Go-1 Climax in 2014, the KO-D Openweight Championship Contendership Tournament in 2009, the KO-D Tag League with Daichi Kakimoto in 2015, and the DDT48/Dramatic Sousenkyo in both 2012 and 2014. In NJPW, Ibushi was a one-time and the first IWGP World Heavyweight Champion, one-time and last IWGP Heavyweight Champion, two-time and last IWGP Intercontinental Champion, three-time IWGP Junior Heavyweight Champion, one- time IWGP Junior Heavyweight Tag Team Champion, one-time IWGP Tag Team Champion, one-time NEVER Openweight Champion, as well as, the winner of the Best of the Super Juniors tournament in 2011, the G1 Climax in both 2019 and 2020, the New Japan Cup in 2015, and the Concurso in 2020. ==Career== ===All Elite Wrestling=== After multiple teases in the weeks leading up, it was revealed on the July 13, 2023 episode of Dynamite that Ibushi was going to be The Elite's partner for their Blood & Guts match. This meant that the Golden☆Lovers with Kenny Omega had reformed and the stable was called The Golden Elite. At Blood & Guts, The Golden Elite team of Ibushi, Omega, \"Hangman\" Adam Page, Matt Jackson, Nick Jackson defeated the Blackpool Combat Club team of Jon Moxley, Claudio Castagnoli, and Wheeler Yuta with Konosuke Takeshita, and Pac. On November 15, it was announced by AEW owner Tony Khan that Ibushi had signed a contract with AEW to become a member of the roster. At All In London, Ibushi teamed with The Golden Elite again but they lost to Bullet Club Gold (Jay White and Juice Robinson) and Konosuke Takeshita in a trios match. At WrestleDream, Ibushi and Omega teamed with Chris Jericho in a losing effort to The Don Callis Family (Konosuke Takeshita, Will Ospreay, and Sammy Guevara). == References == ==Other websites== * Category:1982 births Category:Living people Category:All Elite Wrestling people Category:Japanese martial artists Category:Japanese professional wrestlers Category:People from Kagoshima Prefecture",
 "title": "Kota Ibushi"
}