{
 "id": "1176849",
 "text": "The Defence of Kamalpur was a second battle fought over Kamalpur near the border between India and East Pakistan (now Bangladesh) during the Bangladesh War of Independence. Kamalpur, a hamlet on the border, was defended by 60-70 regular and paramilitary Pakistani soldiers under the command of Captain Ahsan Malik. The company-sized Pakistani unit fought against a brigade of Indian soldiers and Mukti Bahini troops as the Indian military made several unsuccessful attempts to overrun the Pakistani positions. After defending the area for 21 days, the besieged Pakistani troops were ordered by their superiors to surrender. The defending Pakistani troops suffered hardly any casualties, despite being subjected to repeated Indian artillery bombardment and air strikes. Then Indian Chief of Army Staff, General Sam Manekshaw sent a personal congratulatory message to Captain Malik, commending him for his successful defense against the odds. Maj. Gen. Gurbux Singh also wanted to meet Malik personally, but was wounded by a mine on his way to Kamalpur. ==Start of hostilities== Attacks against Pakistani border outposts in the north began in July. These were mounted by Mukti Bahini, mainly former members of East Pakistan's regular forces, but failed to make much damage. Further attacks on Kamalpur, a kilometre from the border, continued on 22 October and 14 November, the latter being carried out by the Indian Army's 13th Battalion, Brigade of the Guards (of Kler's brigade), which established blocking positions to the south. Malik was cut off and his CO, Lt. Col. Sultan Ahmed tried to relieve him and the other two outposts (Naqshi and Baromari, to the east) without success. On 29 November Major Ayub of 31 Baloch tried to resupply Malik's tiny garrison but failed. == Unsuccessful siege of Indian Army == Kler tried to take Kamalpur on the run, using Mukti Bahini troops, but failed. Later, Kler made two more attempts to overrun the Pakistani troops positions in Kamalpur, but likewise unsuccessfully. He then decided to mount an attack by the 1st Battalion, Maratha Light Infantry on the forty men and four 120 mm mortars of 83 Mortar Battery belonging to Pakistan Army. 1st Battalion of Maratha Light Infantry successfully overran them, suffering one casualty. Kler then \"decided to lay siege to Kamalpur and break down its will to resist\", according to Gen. Sukhwant Singh. After laying the siege, Kler launched a third attack on Pakistani positions in Kamalpur. However, the third attack met the same fate as previous two unsuccessful attacks. Failure of the third attack and resulting casualties had dispirited the attacking troops, and the higher command had developed second thought about Kler ability to handle live operations. Getting wary because of casualties, successive failures and demoralisation among the attacking troops, Kler decided to starve out the garrison by a prolonged siege. Sukhwant Singh knew that there was no Pakistani artillery in this sector, only two troops of mortars, but states that \"Kler was further handicapped inasmuch as one of his battalions had just been organised from an 1 (sic) battalion, raised initially for counterinsurgency with no support elements. In tackling a weak platoon post, another battalion brought out some major weaknesses of leadership under fire. The battalion reached its objective with relatively few casualties. As expected, the enemy turned artillery fire on the objective. A mortar bomb landed on a trench occupied by four men close to the commanding officer. He saw limbs fly and lost his nerve.\" == Artillery and air strike == On 4 December, Indian aircraft fired rockets and cannons on the post in three sorties. Maj. Gen. Gurbux Singh (commander of the north region) himself entered affairs by sending Capt. Malik a note via a Mukti Bahini courier: \"whatever you decide to do, we have every intention of eliminating Kamalpur post. It is to save you and our side casualties this message is being sent to you\". He sent another note after a further air strike and this was met, as had been the other messages, by increased firing by Malik's men. But it could not go on, Malik received the order by radio to surrender, which he did at 1900 that day. == Outcome == Sukhwant Singh noted, Malik \"had put up a courageous stand ... and had surrendered after holding a brigade of besiegers for 21 days ... Manekshaw sent a personal congratulatory message to Malik, commending his defiant stand\". Maj. Gen. Gurbux Singh decided to meet Malik personally but, while being driven towards Kamalpur by Kler, their jeep went over a mine and he was badly wounded. When Capt. Malik's force was taken in, it was found that his company was nearly out of ammunition, barring a few hand grenades and a few bullets each. ==Awards== * Captain Ahsan Malik, 31 Baloch of Pakistan Army, was decorated with a Sitara-e-Jurrat. == Notes == == References == * * * * Kamalpur Kamalpur Category:1971 in Asia",
 "title": "Defence of Kamalpur"
}