{
 "id": "1176727",
 "text": "The Tank Ambush at Kushtia was a significant but often over looked battle during the Indo-Pakistani War of 1971. It involved a small Pakistani force executing a highly effective ambush against a larger Indian force, leading to substantial losses and a delay in the Indian advance. == Background == The Battle of Kushtia occurred in East Pakistan (now Bangladesh) on December 9, 1971, during the Indo-Pakistani War. In the context of the war, Pakistan's Eastern Front was under significant pressure, with Indian forces advancing rapidly through East Pakistan. The Indian 2nd Corps, under the command of Lieutenant General Raina, was tasked with securing key strategic points, including Khulna, Jessore, and Kushtia. In the midst of this dire situation, a small force, including Pakistani tanks and infantry, set up an ambush that would prove to be a significant tactical success. == The Battle == On the morning of December 9, 1971, a Pakistani force, led by Major Sher ur Rahman, set up a well-coordinated ambush on the outskirts of Kushtia, utilizing a mix of light tanks, anti-tank guns, and infantry. The Indian 7th Brigade, part of the 4th Mountain Division, was advancing through the area when they unknowingly entered the kill zone. The first shot from a Pakistani Chafee light tank hit an Indian T-55 tank, setting off a series of devastating attacks. The Indian column, poorly coordinated and moving too closely together, suffered heavy casualties. Indian infantry were caught off-guard as their tanks were destroyed one by one. Within moments, most of the Indian tanks were neutralized, and the remaining forces attempted to withdraw. The Pakistani forces, despite being vastly outnumbered, displayed exceptional leadership and tactical awareness. Major Rahman’s ambush tactics led to the destruction of five Indian tanks, with only one tank managing to escape the area. Indian commanders, including Lieutenant General Raina, were caught off- guard and reacted hastily by ordering a halt to the advance. The Indian 4th Mountain Division was ordered to regroup and move back to Kushtia, which resulted in a critical delay in their offensive operations. == Losses == India suffered from 111 casualties including 6 officers, 5 out of 6 tanks destroyed. Moreover, Pakistani forces also captured 13 Indian prisoners of war, including an artillery officer, Captain R Singh. Meanwhile Pakistan lost only 1 tank and suffered from some casualties.https://www.aimh.gov.pk/wp- content/uploads/2024/02/remembering-kashmir.pdf == Aftermath == While the Battle of Kushtia was a tactical victory for Pakistan, it did not significantly alter the course of the war. The Pakistani forces withdrew during the night, and the Indian Army resumed its advance after a brief halt. The delay caused by the ambush allowed Pakistani forces some time to withdraw, but by the time reinforcements could arrive, the strategic situation for Pakistan had become untenable. ==References== Kushtia Kustia",
 "title": "Tank Ambush at Kushtia"
}