{
 "id": "117683",
 "text": "The National Football League Most Valuable Player Award is an award by different entities, most notably the Associated Press, to the player who is thought to be the most valuable player in the league. == NFL's Most Valuable Players == === The Joe F. Carr Trophy === The NFL awarded the Joe F. Carr Trophy (named for the league president, 1921-39) to the league's ABC from 1938 to 1946. Season Player Team Position 1938 Mel Hein New York Giants Center 1939 Parker Hall Cleveland Rams Halfback 1940 Ace Parker Brooklyn Dodgers Halfback 1941 Don Hutson Green Bay Packers End 1942 Don Hutson (2) Green Bay Packers End 1943 Sid Luckman Chicago Bears Quarterback 1944 Frank Sinkwich Detroit Lions Halfback 1945 Bob Waterfield Cleveland Rams Quarterback 1946 Bill Dudley Pittsburgh Steelers Halfback === As awarded by United Press International === United Press International gave an NFL MVP Award from 1948 through 1969, excepting 1949-50, and 1952. Beginning in 1970 UPI awarded separate awards for the NFC and AFC. In 1975 UPI added a Defensive Player of the Year Award for both the NFC and AFC. Season Player Team Position 1948 Pat Harder Chicago Cardinals Fullback Modesto Bee, December 17, 1948, pg. 17 1949 No Selection 1950 No Selection 1951 Otto Graham Cleveland Browns Quarterback 1952 No Selection 1953 Otto Graham (2) Cleveland Browns Quarterback 1954 Joe Perry San Francisco 49ers Fullback 1955 Otto Graham (3) Cleveland Browns Quarterback 1956 Frank Gifford New York Giants Halfback 1957 Y. A. Tittle San Francisco 49ers Quarterback 1958 Jim Brown Cleveland Browns Fullback 1959 Johnny Unitas Baltimore Colts Quarterback 1960 Norm Van Brocklin Philadelphia Eagles Quarterback 1961 Paul Hornung Green Bay Packers Halfback 1962 Y. A. Tittle New York Giants Quarterback 1963 Jim Brown (2) Cleveland Browns Fullback 1964 Johnny Unitas (2) Baltimore Colts Quarterback 1965 Jim Brown (3) Cleveland Browns Fullback 1966 Bart Starr Green Bay Packers Quarterback 1967 Johnny Unitas (3) Baltimore Colts Quarterback 1968 Earl Morrall Baltimore Colts Quarterback 1969 Roman Gabriel Los Angeles Rams Quarterback ===As awarded by the Associated Press=== Season Player Team Position 1957 Jim Brown Cleveland Browns Running back 1958 Jim Brown (2) Cleveland Browns Running back 1959 Johnny Unitas Baltimore Colts Quarterback 1960 Norm Van Brocklin Philadelphia Eagles Quarterback 1961 Paul Hornung Green Bay Packers Running back 1962 Jim Taylor Green Bay Packers Running back 1963 Y. A. Tittle New York Giants Quarterback 1964 Johnny Unitas (2) Baltimore Colts Quarterback 1965 Jim Brown (3) Cleveland Browns Running back 1966 Bart Starr Green Bay Packers Quarterback 1967 Johnny Unitas (3) Baltimore Colts Quarterback 1968 Earl Morrall Baltimore Colts Quarterback 1969 Roman Gabriel Los Angeles Rams Quarterback 1970 John Brodie San Francisco 49ers Quarterback 1971 Alan Page Minnesota Vikings Defensive tackle 1972 Larry Brown Washington Redskins Running back 1973 O.J. Simpson Buffalo Bills Running back 1974 Ken Stabler Oakland Raiders Quarterback 1975 Fran Tarkenton Minnesota Vikings Quarterback 1976 Bert Jones Baltimore Colts Quarterback 1977 Walter Payton Chicago Bears Running back 1978 Terry Bradshaw Pittsburgh Steelers Quarterback 1979 Earl Campbell Houston Oilers Running back 1980 Brian Sipe Cleveland Browns Quarterback 1981 Ken Anderson Cincinnati Bengals Quarterback 1982 Mark Moseley Washington Redskins Placekicker 1983 Joe Theismann Washington Redskins Quarterback 1984 Dan Marino Miami Dolphins Quarterback 1985 Marcus Allen Los Angeles Raiders Running back 1986 Lawrence Taylor New York Giants Linebacker 1987 John Elway Denver Broncos Quarterback 1988 Boomer Esiason Cincinnati Bengals Quarterback 1989 Joe Montana San Francisco 49ers Quarterback 1990 Joe Montana (2) San Francisco 49ers Quarterback 1991 Thurman Thomas Buffalo Bills Running back 1992 Steve Young San Francisco 49ers Quarterback 1993 Emmitt Smith Dallas Cowboys Running back 1994 Steve Young (2) San Francisco 49ers Quarterback 1995 Brett Favre Green Bay Packers Quarterback 1996 Brett Favre (2) Green Bay Packers Quarterback 1997 Brett Favre (3) Barry Sanders Green Bay Packers Detroit Lions Quarterback Running back 1998 Terrell Davis Denver Broncos Running back 1999 Kurt Warner St. Louis Rams Quarterback 2000 Marshall Faulk St. Louis Rams Running back 2001 Kurt Warner (2) St. Louis Rams Quarterback 2002 Rich Gannon Oakland Raiders Quarterback 2003 Peyton Manning Steve McNair Indianapolis Colts Tennessee Titans Quarterback Quarterback 2004 Peyton Manning (2) Indianapolis Colts Quarterback 2005 Shaun Alexander Seattle Seahawks Running back 2006 LaDainian Tomlinson San Diego Chargers Running back 2007 Tom Brady New England Patriots Quarterback 2008 Peyton Manning (3) Indianapolis Colts Quarterback 2009 Peyton Manning (4) Indianapolis Colts Quarterback 2010 Tom Brady (2) New England Patriots Quarterback 2011 Aaron Rodgers Green Bay Packers Quarterback 2012 Adrian Peterson Minnesota Vikings Running back 2013 Peyton Manning (5) Denver Broncos Quarterback 2014 Aaron Rodgers (2) Green Bay Packers Quarterback 2015 Cam Newton Carolina Panthers Quarterback 2016 Matt Ryan Atlanta Falcons Quarterback 2017 Tom Brady (3) New England Patriots Quarterback 2018 Patrick Mahomes Kansas City Chiefs Quarterback 2019 Lamar Jackson Baltimore Ravens Quarterback 2020 Aaron Rodgers (3) Green Bay Packers Quarterback 2021 Aaron Rodgers (4) Green Bay Packers Quarterback 2022 Patrick Mahomes (2) Kansas City Chiefs Quarterback 2023 Lamar Jackson (2) Baltimore Ravens Quarterback === As awarded by the Pro Football Writers of America === Season Player Team Position 1975 Fran Tarkenton Minnesota Vikings Quarterback 1976 Bert Jones Baltimore Colts Quarterback 1977 Walter Payton Chicago Bears Running back 1978 Earl Campbell Houston Oilers Running back 1979 Earl Campbell (2) Houston Oilers Running back 1980 Brian Sipe Cleveland Browns Quarterback 1981 Ken Anderson Cincinnati Bengals Quarterback 1982 Dan Fouts San Diego Chargers Quarterback 1983 Joe Theismann Washington Redskins Quarterback 1984 Dan Marino Miami Dolphins Quarterback 1985 Marcus Allen Los Angeles Raiders Running back 1986 Lawrence Taylor New York Giants Linebacker 1987 Jerry Rice San Francisco 49ers Wide receiver 1988 Boomer Esiason Cincinnati Bengals Quarterback 1989 Joe Montana San Francisco 49ers Quarterback 1990 Randall Cunningham Philadelphia Eagles Quarterback 1991 Thurman Thomas Buffalo Bills Running back 1992 Steve Young San Francisco 49ers Quarterback 1993 Emmitt Smith Dallas Cowboys Running back 1994 Steve Young (2) San Francisco 49ers Quarterback 1995 Brett Favre Green Bay Packers Quarterback 1996 Brett Favre (2) Green Bay Packers Quarterback 1997 Barry Sanders Detroit Lions Running Back 1998 Terrell Davis Denver Broncos Running back 1999 Kurt Warner St. Louis Rams Quarterback 2000 Marshall Faulk St. Louis Rams Running back 2001 Marshall Faulk (2) St. Louis Rams Running Back 2002 Rich Gannon Oakland Raiders Quarterback 2003 Jamal Lewis Baltimore Ravens Running Back 2004 Peyton Manning Indianapolis Colts Quarterback 2005 Shaun Alexander Seattle Seahawks Running back 2006 LaDainian Tomlinson San Diego Chargers Running back 2007 Tom Brady New England Patriots Quarterback 2008 Peyton Manning (2) Denver Broncos Quarterback 2009 Peyton Manning (3) Denver Broncos Quarterback 2010 Tom Brady (2) New England Patriots Quarterback 2011 Aaron Rodgers Green Bay Packers Quarterback 2012 Adrian Peterson Minnesota Vikings Running back 2013 Peyton Manning (4) Denver Broncos Quarterback 2014 Aaron Rodgers (2) Green Bay Packers Quarterback 2015 Cam Newton Carolina Panthers Quarterback 2016 Matt Ryan Atlanta Falcons Quarterback 2017 Tom Brady (3) New England Patriots Quarterback 2018 Patrick Mahomes Kansas City Chiefs Quarterback 2019 Lamar Jackson Baltimore Ravens Quarterback 2020 Aaron Rodgers (3) Green Bay Packers Quarterback 2021 Aaron Rodgers (4) Green Bay Packers Quarterback 2022 Patrick Mahomes (2) Kansas City Chiefs Quarterback 2023 Lamar Jackson (2) Baltimore Ravens Quarterback === As awarded by Newspaper Enterprise Association === This award ran from 1955 through 1996 and was a poll of NFL players. The award winner is given with the Jim Thorpe Trophy (different from the collegiate football's Jim Thorpe Award). Beginning in 1997 the Jim Thorpe Trophy was given by the Jim Thorpe Association, with the winner determined by a \"vote of NFLPA representatives\".Jim Thorpe Association Yearbook, 2007. Season Player Team Position 1955 Harlon Hill Chicago Bears End 1956 Frank Gifford New York Giants Running back 1957 John Unitas Baltimore Colts Quarterback 1958 Jim Brown Cleveland Browns Fullback 1959 Charlie Conerly New York Giants Quarterback 1960 Norm Van Brocklin Philadelphia Eagles Quarterback 1961 Y. A. Tittle New York Giants Quarterback 1962 Jim Taylor Green Bay Packers Running back 1963 Y. A. Tittle (2) Jim Brown (2) New York Giants Cleveland Browns Quarterback Running Back 1964 Lenny Moore Baltimore Colts Halfback 1965 Jim Brown (3) Cleveland Browns Running back 1966 Bart Starr Green Bay Packers Quarterback 1967 Johnny Unitas (2) Baltimore Colts Quarterback 1968 Earl Morrall Baltimore Colts Quarterback 1969 Roman Gabriel Los Angeles Rams Quarterback 1970 John Brodie San Francisco 49ers Quarterback 1971 Bob Griese Miami Dolphins Quarterback 1972 Larry Brown Washington Redskins Running back 1973 O. J. Simpson Buffalo Bills Running back 1974 Ken Stabler Oakland Raiders Quarterback 1975 Fran Tarkenton Minnesota Vikings Quarterback 1976 Bert Jones Baltimore Colts Quarterback 1977 Walter Payton Chicago Bears Running back 1978 Earl Campbell Houston Oilers Running back 1979 Earl Campbell (2) Houston Oilers Running back 1980 Earl Campbell (3) Houston Oilers Running back 1981 Ken Anderson Cincinnati Bengals Quarterback 1982 Dan Fouts San Diego Chargers Quarterback 1983 Joe Theismann Washington Redskins Quarterback 1984 Dan Marino Miami Dolphins Quarterback 1985 Walter Payton (2) Chicago Bears Running back 1986 Phil Simms New York Giants Quarterback 1987 Jerry Rice San Francisco 49ers Wide Receiver 1988 Roger Craig San Francisco 49ers Running back 1989 Joe Montana San Francisco 49ers Quarterback 1990 Warren Moon Houston Oilers Quarterback 1991 Thurman Thomas Buffalo Bills Running back 1992 Emmitt Smith Dallas Cowboys Running back 1993 Emmitt Smith (2) Dallas Cowboys Running back 1994 Steve Young San Francisco 49ers Quarterback 1995 Brett Favre Green Bay Packers Quarterback 1996 Brett Favre (2) Green Bay Packers Quarterback 1997 Barry Sanders Detroit Lions Running back 1998 Randall Cunningham Minnesota Vikings Quarterback 1999 Kurt Warner St. Louis Rams Quarterback 2000 Marshall Faulk St. Louis Rams Running back 2001 Kurt Warner (2) St. Louis Rams Quarterback 2002 Rich Gannon Oakland Raiders Quarterback 2003 Peyton Manning Indianapolis Colts Quarterback 2004 Peyton Manning (2) Indianapolis Colts Quarterback 2005 Shaun Alexander Seattle Seahawks Running back 2006 LaDanian Tomlinson San Diego Chargers Running back 2007 Tom Brady New England Patriots Quarterback == Notes == == Other websites == * NFL Most Valuable Player/Player of the Year Category:American football awards Category:Most valuable player awards",
 "title": "National Football League Most Valuable Player Award"
}