{
 "id": "1176952",
 "text": "Revisionist Zionism is a radical form of Zionism founded by Ze'ev JabotinskyBirth name: Vladimir Yevgenyevich Zhabotinsky. Hebrew: זְאֵב זַ׳בּוֹטִינְסְקִי; Yiddish: וואלף זשאַבאָטינסקי (October 17, 1880 – August 3, 1940) in the early 20th century, * Ya'akov Shavit and Joseph B. Schechtman, Encyclopaedia Judaica. * * * * * who joined Zionist activism after the Kishinev pogrom in 1903 (49 killed and 592+ wounded) * * * * to fight for equal rights in the Russian Empire, where pogroms against Jews often happened. * * * * * * * * * ==Overview== Revisionist Zionism held that a Jewish state should be set up across Ottoman Palestine and Transjordan (larger than the current boundary of the State of Israel). ==Ideology== ===Zionism=== Revisionist Zionism was based on Theodor Herzl's vision of Zionism as a political movement. Ze'ev Jabotinsky believed: Jabotinsky admired Theodor Herzl, calling him \"a fateful, chosen prophet and great leader\". He said that reviving the Hebrew language was necessary for a possible Jewish state: Revisionist Zionists – mainly consisting of Russian Jews who had supported Jabotinsky as part of the WWI British Army's Jewish Legion – saw the British Mandatory Palestine as anti-Zionist, which prevented the Balfour Declaration's promise of a Jewish state from being fulfilled no matter how much the British developed the region. ===Race=== Contrary to popular misconceptions, Jabotinsky did not support the total removal of Arabs: Meanwhile, he wrote the article On the Iron Wall in 1932, saying that a fortified military front ‒ known as the iron wall ‒ needed to be built due to his view that the Arabs would never accept the existence of a Jewish state. ===Society=== Revisionist Zionists argued that the British should make these policy changes: * land reform * protection of local industries * setup of a good fiscal system * support for private capital investment * compulsory arbitration of labor disputes * permission for mass immigration of Jews * ban on strikes and lockouts until \"state-building\" is complete Jabotinsky's support for a ban on strikes and lockouts is reportedly due to his view that \"socialism [is] not compatible with Zionism\". He also rejected the Marxist theory of class struggle, seeing national interests as more important than class interests. In addition, he opposed any police states, believing that only a system under which someone could do well was acceptable, i.e. he neither supported fascism nor communism. ==History== ===Interwar period=== ====1920s==== In the 1920s, Revisionist Zionists promoted these goals: * turning the London-based bank Jewish Colonial Trust into the main economic tool * turning the World War I (WWI) Jewish Legion into part of the British troops in Mandatory Palestine * making the British fulfil their promise under the Balfour Declaration to give Jews a Jewish state within Mandatory Palestine In 1925, Revisionist Zionists met for the first time in Paris. They had been part of the World Zionist Organization (WZO). They gained many followers from Ashkenazi Jews, who were suffering from pogroms and discrimination in their European host countries. Revisionist Zionists were a minority within the Zionist movement, with the majority being Labor Zionists. Some Labor Zionists accused Revisionist Zionists of being \"fascists\" over personal disagreements. ====1930s==== In the 1930s, Revisionist Zionists became the biggest opponents of Chaim Weizmann's leadership of the WZO in terms of policy and methods. Famous Revisionist Zionists included Jacob Cohen, Jacob de Haas, Richard Lichtheim and Robert Stricker. Revisionist Zionists had some level of support among their fellow people. Their main group Revisionist Union managed to get 600,000 Jews in 24 countries to sign a petition in 1934, which was submitted to the British king, the UK Parliament and the governments of the states to which the Jewish signees belonged. In the same year, Jabotinsky and David Ben-Gurion met in London, trying to bring the Revisionist Zionists and Labor Zionists together. Despite majority Zionist support, it was rejected by the Histadrut ‒ the largest Labor Zionist group in Mandatory Palestine. In 1935, Revisionist Zionists voted to leave the WZO and formed the New Zionist Organization (NZO) due to WZO's rejection of their proposal to finalise Zionism's goals. NZO's constituent assembly, based in Vienna, Austria, was elected by 713,000 voters. The NZO called for a Hebrew-speaking Jewish state to be founded across the Land of Israel and Transjordan, as a \"redemption for the Jewish people and its land\" based on the progressive ideas of civil liberties and social justice, when European countries fell under totalitarian regimes one by one. They laid out a ten-year plan to move in 1,500,000 Jews, who were facing the Holocaust in Europe. Despite their good intent, most Jews did not support it for fear of helping antisemitic European governments remove their Jewish citizens. The lack of Jewish support did not stop Revisionist Zionists from rescuing persecuted Jews, who made ships to smuggle thousands of persecuted Jews out of Europe to Mandatory Palestine (\"Af Al Pi Aliyah\"). ===World War II=== The NZO stopped operating in mainland Europe when Nazi Germany and the Soviet Union invaded Poland in September 1939. * DAVID ENGEL, FACING A HOLOCAUST: THE POLISH GOVERNMENT-IN-EXILE AND THE JEWS, 1943–1945, at 71 (1993) (“The German broadcast [announcing the discovery of the Katyn graves] charged that these officers had been shot by the Soviets in March 1940 . . . .”). * \"In the 1939-1941 period alone, Soviet-inflicted suffering on all citizens in Poland exceeded that of Nazi-inflicted suffering on all citizens. (...) The Soviet- imposed myth about \"Communist heroes of resistance\" enabled them for decades to avoid the painful questions faced long ago by other Western countries.\" Johanna Granville, H-Net Review of Jan T. Gross. Revolution from Abroad. * Tomasz Szarota & Wojciech Materski (2009), Polska 1939–1945. Straty osobowe i ofiary represji pod dwiema okupacjami, Warsaw: Institute of National Remembrance, (Excerpt reproduced in digital form). * In 1940, Jabotinsky persuaded the UK and US government to set up a Jewish defence force to let them join the fight against Nazi Germany. He died of a heart attack on August 3 while visiting a summer camp of the Betar, a Revisionist Zionist youth movement founded in Riga, Latvia in 1923. The group has been accused by left- wing scholars – influential in Western academia and history writing * Lappin, Shalom (2006), ‘How Class Disappeared from Western Politics’, Dissent, Vol. 51, No. 1, pp. 73-78. * * * * Kirsch, Adam (2024), On Settler Colonialism: Ideology, Violence, and Justice, W.W. Norton and Company, New York and London. * * * * * * – of being \"influnced by fascism\". Followers of Jabotinsky formed paramilitary groups in Mandatory Palestine, including the Irgun * * * * * and Haganah. * * * ====Following Ze'ev Jabotinsky's death==== Jabotinsky's party had a minor split following Jabotinsky's death. Binyamin Eliav, one of its central committee members, tried to make a deal with democratic socialist Mapai party's leaders Berl Katznelson and Eliyahu Golomb on these terms: * merger of the Irgun with the Haganah * merger of the Revisionist labor organization with Histadrut * return of Revisionist Zionists to the World Zionist Organization * founding of a Jewish state within the historical boundaries of the Land of Israel The deal failed due to David Ben-Gurion's veto. ==Revisionist Zionist paramilitary groups== ===Haganah=== ===Irgun=== ====Founding==== The Irgun was a Jewish insurgent group founded in 1931. It rivalled the Haganah and served as the military wing of the Revisionist (Zionist) Party. ====Activities==== The Irgun was labelled a terrorist organization in the 1940s due to its anticolonial insurgency against the British authorities. Not only was it involved in attacks on British military bases, but also it was important in organizing the escape of Jewish exiles from European countries, especially Nazi Germany, to Mandatory Palestine following the British publication of the British White Paper on Palestine (1939) to limit Jewish immigration. Particularly, the Irgun is noted for its bravery. Irgun members once captured the Acre prison, a fortress built in the Middle Ages reportedly unconquerable by even Napoleon. The Irgun also captured much of Jaffa (Yafo) ‒ located in present-day northwestern Israel ‒ in the final days of British rule. Irgun is well-known for the bombing of Jerusalem's King David Hotel in 1946. ====Legacy==== Irgun is seen as an early version of Ḥerut which was an Israeli political party. Irgun is also an early version of today's Likud political party in Israel.Eisenstadt, S.N. (1985). The Transformation of Israeli Society, pp. 173–174. The Irgun is tainted with the stigma of terrorism in public memory, * * * * * a phenomenon seen by some as a result of systemic bias. ===Lehi=== ==Related pages== * Antisemitism * History of Jews ==References== Category:Israel Category:Zionism Category:World War II Category:Jewish culture Category:Jewish history Category:British Empire Category:History of Israel Category:History of the Middle East Category:History of the United Kingdom",
 "title": "Revisionist Zionism"
}