{
 "id": "1176295",
 "text": "Super Bowl Year Teams Winner Score Performer(s) I 1967 Green Bay Packers vs. Kansas City Chiefs Green Bay Packers 35-10 University of Arizona and Grambling State University Marching Bands II 1968 Green Bay Packers vs. Oakland Raiders Green Bay Packers 33-14 Al Hirt, Grambling State University Marching Band III 1969 New York Jets vs. Baltimore Colts New York Jets 16-7 Carol Channing, Florida A&M; University Marching Band IV 1970 Kansas City Chiefs vs. Minnesota Vikings Kansas City Chiefs 23-7 Up with People V 1971 Baltimore Colts vs. Dallas Cowboys Baltimore Colts 17-14 Anita Bryant, Florida A&M; University Marching Band VI 1972 Dallas Cowboys vs. Miami Dolphins Dallas Cowboys 24-3 Ella Fitzgerald, Carol Channing, and others VII 1973 Miami Dolphins vs. Washington Redskins Miami Dolphins 14-7 The 5th Dimension VIII 1974 Miami Dolphins vs. Minnesota Vikings Miami Dolphins 24-7 University of Texas Longhorn Band IX 1975 Pittsburgh Steelers vs. Minnesota Vikings Pittsburgh Steelers 16-6 Mercer Ellington and the Duke Ellington Orchestra X 1976 Pittsburgh Steelers vs. Dallas Cowboys Pittsburgh Steelers 21-17 Up with People XI 1977 Oakland Raiders vs. Minnesota Vikings Oakland Raiders 32-14 Bill Conti, featuring the \"Dancing in the Streets\" XII 1978 Dallas Cowboys vs. Denver Broncos Dallas Cowboys 27-10 Tyler, Texas High School Band XIII 1979 Pittsburgh Steelers vs. Dallas Cowboys Pittsburgh Steelers 35-31 The 1979 Super Bowl Gospel Celebration XIV 1980 Pittsburgh Steelers vs. Los Angeles Rams Pittsburgh Steelers 31-19 Up with People XV 1981 Oakland Raiders vs. Philadelphia Eagles Oakland Raiders 27-10 The 1981 Super Bowl Gospel Celebration XVI 1982 San Francisco 49ers vs. Cincinnati Bengals San Francisco 49ers 26-21 Diana Ross XVII 1983 Washington Redskins vs. Miami Dolphins Washington Redskins 27-17 The 1983 Super Bowl Gospel Celebration XVIII 1984 Los Angeles Raiders vs. Washington Redskins Los Angeles Raiders 38-9 The 1984 Super Bowl Gospel Celebration XIX 1985 San Francisco 49ers vs. Miami Dolphins San Francisco 49ers 38-16 Up with People XX 1986 Chicago Bears vs. New England Patriots Chicago Bears 46-10 Disney Characters and the Chicago Bears Cheerleaders XXI 1987 New York Giants vs. Denver Broncos New York Giants 39-20 James Brown, and others XXII 1988 Washington Redskins vs. Denver Broncos Washington Redskins 42-10 Chubby Checker, and others XXIII 1989 San Francisco 49ers vs. Cincinnati Bengals San Francisco 49ers 20-16 Elvis Presto, and others XXIV 1990 San Francisco 49ers vs. Denver Broncos San Francisco 49ers 55-10 New Kids on the Block XXV 1991 New York Giants vs. Buffalo Bills New York Giants 20-19 New Kids on the Block XXVI 1992 Washington Redskins vs. Buffalo Bills Washington Redskins 37-24 Gloria Estefan and the Miami Sound Machine XXVII 1993 Dallas Cowboys vs. Buffalo Bills Dallas Cowboys 52-17 Michael Jackson XXVIII 1994 Dallas Cowboys vs. Buffalo Bills Dallas Cowboys 30-13 Janet Jackson, and others XXIX 1995 San Francisco 49ers vs. San Diego Chargers San Francisco 49ers 49-26 Tony Bennett, and others XXX 1996 Dallas Cowboys vs. Pittsburgh Steelers Dallas Cowboys 27-17 Diana Ross XXXI 1997 Green Bay Packers vs. New England Patriots Green Bay Packers 31-25 The Blues Brothers, and others II 1998 Denver Broncos vs. Green Bay Packers Denver Broncos 31-24 Big Bad Voodoo Daddy, and others XXXIII 1999 Denver Broncos vs. Atlanta Falcons Denver Broncos 34-19 Gloria Estefan, and others XXXIV 2000 St. Louis Rams vs. Tennessee Titans St. Louis Rams 23-16 Phil Collins, Christina Aguilera, and others XXXV 2001 Baltimore Ravens vs. New York Giants Baltimore Ravens 34-7 Aerosmith, NSYNC, Britney Spears, Nelly, and Mary J. Blige XXXVI 2002 New England Patriots vs. St. Louis Rams New England Patriots 20-17 U2 XXXVII 2003 Tampa Bay Buccaneers vs. Oakland Raiders Tampa Bay Buccaneers 48-21 Janet Jackson, Justin Timberlake, P. Diddy, and others XXXVIII 2004 New England Patriots vs. Carolina Panthers New England Patriots 32-29 Janet Jackson, Justin Timberlake XXXIX 2005 New England Patriots vs. Philadelphia Eagles New England Patriots 24-21 Paul McCartney XL 2006 Pittsburgh Steelers vs. Seattle Seahawks Pittsburgh Steelers 21-10 The Rolling Stones XLI 2007 Indianapolis Colts vs. Chicago Bears Indianapolis Colts 29-17 Prince XLII 2008 New York Giants vs. New England Patriots New York Giants 17-14 Tom Petty and the Heartbreakers XLIII 2009 Pittsburgh Steelers vs. Arizona Cardinals Pittsburgh Steelers 27-23 Bruce Springsteen XLIV 2010 New Orleans Saints vs. Indianapolis Colts New Orleans Saints 31-17 The Who XLV 2011 Green Bay Packers vs. Pittsburgh Steelers Green Bay Packers 31-25 The Black Eyed Peas, Usher, and Slash XLVI 2012 New York Giants vs. New England Patriots New York Giants 21-17 Madonna XLVII 2013 Baltimore Ravens vs. San Francisco 49ers Baltimore Ravens 34-31 Beyoncé XLVIII 2014 Seattle Seahawks vs. Denver Broncos Seattle Seahawks 43-8 Bruno Mars, Red Hot Chili Peppers XLIX 2015 New England Patriots vs. Seattle Seahawks New England Patriots 28-24 Katy Perry, Lenny Kravitz, Missy Elliott 50 2016 Denver Broncos vs. Carolina Panthers Denver Broncos 24-10 Coldplay, Beyoncé, Bruno Mars LI 2017 New England Patriots vs. Atlanta Falcons New England Patriots 34-28 (OT) Lady Gaga LII 2018 Philadelphia Eagles vs. New England Patriots Philadelphia Eagles 41-33 Justin Timberlake LIII 2019 New England Patriots vs. Los Angeles Rams New England Patriots 13-3 Maroon 5, Travis Scott, Big Boi LIV 2020 Kansas City Chiefs vs. San Francisco 49ers Kansas City Chiefs 31-20 Shakira, Jennifer Lopez LV 2021 Tampa Bay Buccaneers vs. Kansas City Chiefs Tampa Bay Buccaneers 31-9 The Weeknd LVI 2022 Los Angeles Rams vs. Cincinnati Bengals Los Angeles Rams 23-20 Dr. Dre, Snoop Dogg, Eminem, Mary J. Blige, Kendrick Lamar LVII 2023 Kansas City Chiefs vs. Philadelphia Eagles Kansas City Chiefs 38-35 Riahanna",
 "title": "List of Super Bowl halftime shows"
}