{
 "id": "1176984",
 "text": "Arvonne Fraser Library (formerly Southeast Library) is a public library in Minneapolis. It was designed by Ralph Rapson in 1963. The building was a credit union until 1967, when it became Southeast Library. In 2018, the library was renamed to Arvonne Fraser, after a women's rights activist, after her passing. == Timeline == The library replaced several older libraries between 1904 and 1936. === East Side Branch, 1891–1904 === The east side branch opened November 1, 1891, in an old school. It was replaced by the Pillsbury Library in April 1904. === Pillsbury Library, 1904–1967 === John Sargent Pillsbury was the eighth governor of Minnesota. He built a library at the corner of University and Central Avenue. Pillsbury died before the library opened in April of 1904. It was the most beautiful library branch, built out of marble and mahogany.Benidt, Bruce Weir (1984). In 1960, Central Library opened across the river from the Pillsbury Library. The Southeast Library later replaced the Pillsbury Library in 1967. === Seven Corners Library, 1906-1964 === A delivery station was replaced by the Seven Corners Library. The Seven Corners area was busy because of the immigrants in the area. By 1964, the library had lost most customers and was sold to the Minnesota Department of Transportation and was demolished for highway construction.Benidt, Bruce Weir (1984). == Southeast Library, 1967-2018 == In 1960, Ralph Rapson designed a building for the State Capitol Credit Union, a bank serving employees. It became Southeast Library on December 29, 1966 and reopened on December 26, 1967.Benidt, Bruce Weir (1984). The library is known for it's square concrete roof. It is supported by 16 pillars and 22 skylights.Nelson, Rick (January 24, 2020). 15 libraries were merged into the main Hennepin County Library in 2008. == Arvonne Fraser Library, 2019-present == On December 10, 2018, the library closed for a $11.6 million renovation. The next day it was voted to rename the library after Fraser. The Arvonne Fraser Library opened on Saturday January 25, 2020. The renovation doubled the library's size, adding storage and a children's area.Nelson, Rick (January 24, 2020). Arvonne Fraser and other libraries mentioned == References == Category:Coordinates on Wikidata Category:Pages using gadget WikiMiniAtlas Category:Infobox mapframe without OSM relation ID on Wikidata Category:Libraries in Hennepin County Library Category:Minnesota Category:Education in the United States",
 "title": "Arvonne Fraser Library"
}