{
 "id": "1176117",
 "text": "Goldmines Telefilms Pvt. Ltd. is an Indian movie distribution and production company based in Mumbai, Maharashtra. Founded in 2000 by producer Manish Shah, the company is best known for acquiring and dubbing South Indian movies—primarily in Tamil and Telugu—into Hindi for distribution across television, satellite channels, and digital platforms such as YouTube. Goldmines Telefilms has expanded its operations to include movie production, television channel management, and the distribution of Bollywood movies. == History == === Early years and television production (2000–2006) === Goldmines Telefilms is a movie production and distribution company established on 5 January 2000. The company began operations in 2004. Initially, the company focused on producing regional-language television soaps in Gujarati and Marathi for channels like Alpha Marathi, ETV Gujarati, and Hungama TV. During this period, Goldmines also entered the movie syndication market, acquiring rights to older Hindi movies and licensing them to broadcasters, setting the stage for its later specialization in content distribution. === Entry into movie dubbing (2007–2012) === In 2007, under the leadership of founder Manish Shah, Goldmines pivoted to dubbing South Indian movies into Hindi, capitalizing on a gap in the Hindi entertainment market for mass-oriented, action-packed cinema.https://www.livemint.com/industry/media/goldmines-manish- shah-the-man-who-spotted-the-southern-stars-11651518633492.html The company’s first dubbed project, the Telugu movie Mass (2004), was released as Meri Jung: One Man Army in 2007 and achieved TRPs exceeding 1 on Sony Max, proving the viability of dubbed content. Goldmines rapidly expanded its library, acquiring rights to Tamil and Telugu blockbusters featuring stars like Rajinikanth, Chiranjeevi, Nagarjuna, and later Allu Arjun and Jr. NTR. Movies such as Chirutha (2007), King (2008) and Magadheera (2009) became television hits, positioning Goldmines as a leader in dubbed cinema within four years. === Digital expansion and channel launch (2013–2020) === The rise of digital platforms in the 2010s prompted Goldmines Telefilms to expand beyond traditional television. In 2013, the company launched its YouTube channel, \"Goldmines\", to distribute Hindi-dubbed films directly to viewers. This move proved prescient as internet penetration grew across India, particularly in Tier 2 and Tier 3 cities where South Indian dubbed movies found a massive audience. By 2020, the channel had grown exponentially, boasting millions of subscribers and becoming a key revenue stream. In 2020, Goldmines further diversified by launching Dhinchaak TV, a free-to-air channel on the DD Free Dish platform. Aimed at rural and semi-urban Hindi-speaking viewers, Dhinchaak TV quickly became the top-rated channel in its genre, broadcasting a steady stream of dubbed South Indian movies. This period also saw Goldmines dabbling in movie production, with titles like Thuppakki (2012), Mirchi (2013), Sarrainodu (2016), DJ: Duvvada Jagannadham (2017) and Maharshi (2019), though distribution remained its core strength. === Mainstream success and movie productions (2021–Present) === In 2021, Goldmines distributed Hindi version of Pushpa: The Rise and became a huge success. In 2022, Goldmines decided to release dubbed version of Ala Vaikunthapurramuloo in theatres. Instead, they exclusively on their TV channel. This decision was followed by the reports that Kartik Aaryan threatened to walk off the set of its Hindi remake, Shehzada (2023), if the dubbed version were released theatrically. In the financial year ending 31 March 2023, Goldmines Telefilms reported an operating revenue exceeding 500 crore, with television contributing 400 crore annually. Its EBITDA surged by 258.28%, and net worth grew by 109.96%, reflecting significant growth. The company continues to acquire and distribute South Indian movies, enhancing its pan-India influence. In 2024, Goldmines Telefilms signed to produce Kanchana 4, the fifith installment in the Tamil horror- comedy Muni series directed by Raghava Lawrence. The movie stars Pooja Hegde alongside him. Announced as a pan-Indian film, Kanchana 4 marks a return to production for the company following the success of Pushpa: The Rise.https://www.bollywoodhungama.com/news/features/mega-exclusive-manish- shah-goldmine-telefilms-gets-back-producing-films-pushpa-rise-part-01-backs- kanchana-4-starring-pooja-hegde-nora-fatehi-raghava-lawrence/ Shooting began in January 2025. The movie is slated for a theatrical release in 2026, with plans for an digital release after an eight-week window, aligning with national multiplex chain requirements. == Filmography == Key Denotes movies that have not yet been released === Films produced === Year Film Director Cast Language Notes Ref Raghava Lawrence Raghava Lawrence, Pooja Hegde Tamil Filming === Notable films distributed === Notable film rights acquired by Goldmines Telefilms, later dubbed and released. * Mass (2004)https://www.livemint.com/industry/media/goldmines-manish-shah-the-man- who-spotted-the-southern-stars-11651518633492.html * Bunny (2005) * King (2008) * Kerala Varma Pazhassi Raja (2009) * Magadheera (2009) * Brindavanam (2010) * Darling (2010) * Singam (2010) * Oosaravelli (2011) * Kanchana (2011) * Gabbar Singh (2012) * Thuppakki (2012) * Baadshah (2013) * Jilla (2014) * Yevadu (2014) * Maari (2015) * Temper (2015) * Kanchana 2 (2015) * Demonte Colony (2015) * Aranmanai 2 (2016) * Sarrainodu (2016) * Katamarayudu (2017) * DJ: Duvvada Jagannadham (2017)https://scroll.in/reel/867024/allu-arjun-all- the-way-in-duvvada-jagannadham-the-hindi-dubbed-telugu-hit-on-youtube * Maari 2 (2018) * Rangasthalam (2018) * Jersey (2019) * Gaddalakonda Ganesh (2019)https://filmifryday.com/jigarthanda-movie-facts-and-its- all-3-remakes/#Gaddalakonda_Ganesh_2019 * Maharshi (2019)https://indiantelevision.com/television/tv-channels/viewership/hindi- movie-channel-dhinchaak-renamed-as-goldmines-movies-220328 * Ala Vaikunthapurramuloo (2020)https://www.hindustantimes.com/entertainment/telugu- cinema/hindi-version-of-ala-vaikunthapurramuloo-to-be-out-on-youtube-on- february-2-101675167917607.html * Pushpa: The Rise (2021)https://www.bollywoodhungama.com/news/bollywood/pushpa-rise- delivers-100-profit-manish-shah-goldmines-telefilms-makes-rs-40-crore-profit- hindi-rights/ * Jai Bhim (2021) * F3: Fun and Frustration (2022) * Leo (2023)https://www.filmcompanion.in/features/tamil-features/are-tamil-films- lagging-behind-in-the-hindi-market-leo-jigarthanda-doublex-vijay-lawrence-sj- suryah-kgf-jailer * Jigarthanda DoubleX (2023) * Captain Miller (2024) == Television channels == === Goldmines === Goldmines is an Indian Hindi language television channel owned by Goldmines Telefilms. The company launched its television channel, Dhinchaak TV, on the free-to-air DD Free Dish satellite service on 24 May 2020. Within months, it became the highest-rated channel in its genre among Hindi-speaking rural and urban viewers. On 1 April 2022, Dhinchaak TV was renamed to Goldmines. Goldmines broadcasts Hindi, Hindustani, Bhojpuri, and Awadhi dubbed versions of South Indian movies produced by the company. The company also releases Hindi dubbed versions of South Indian movies on YouTube on their Goldmines channel. Goldmines YouTube channel crossed 100 million subscribers in September 2024, and is the most subscribed YouTube movie channel and is one of the most-subscribed YouTube channel. === Goldmines Bollywood === Goldmines Bollywood is an Indian Hindi language Television channel owned by Goldmines Telefilms. The channel which initially launched under the title Dhinchaak 2 primarily airs Bollywood movies from the 1960s to the 2000s. === Goldmines Movies === Goldmines Movies is an Indian multilingual television channel owned by Goldmines Telefilms. The channel mostly shows South Indian Hindi-Bhojpuri dubbed movies. == References == == Other websites == * * * Category:Movie production companies Category:Indian movie studios Category:2000s establishments in India Category:21st-century establishments in India Category:Indian entertainment companies Category:Television networks",
 "title": "Goldmines Telefilms"
}