{
 "id": "117618",
 "text": "General Edward Lawrence Logan International Airport in the East Boston neighborhood of Boston, Massachusetts, United States (and partly in the Town of Winthrop, Massachusetts), is one of the 20 busiest airports in the U.S., with over 27 million passengers a year. The airport serves as a focus city for American Airlines, Delta Air Lines, US Airways, and JetBlue Airways. It covers 2,400 acres (10 km²), has six runways, and employs an estimated 16,000 people. The airport has service to destinations in the United States, as well as Canada, the Cape Verde Islands, the Caribbean, Europe, and Mexico. The distinctive central control tower, nearly a dozen stories high, is a local landmark with its pair of segmented elliptical pylons and a six-story platform trussed between them. Boston serves as a focus city for JetBlue Airways. Delta Air Lines and US Airways also carries out many operations from the airport, and all major airlines fly to Boston from all or the majority of their primary and secondary hubs. It is also a destination of many major European airlines, such as Lufthansa, British Airways, Norwegian Air Shuttle and Air France. The airport is a hub for regional airline Cape Air. The airport has service to destinations in the United States, as well as Africa, Canada, the Caribbean, Europe, Mexico, and South America. Japan Airlines plans to inaugurate service to Tokyo in 2012, which would add the first service to Asia since 2001. As of July 2013, the service continues to operate with great success. In 2010, it was the world's 28th busiest airport in terms of aircraft movements. The airport is also the 12th busiest airport in the U.S. based on international traffic. In 2010, it handled 3,681,739 international passengers. Logan Airport stimulates the New England regional economy by over $7 billion each year. It generates $559.4 million in state and local taxes. ==Accidents and incidents== ===Accidents=== * On October 4, 1960, Eastern Air Lines Flight 375 crashed into the sea while attempting to take off from Logan Airport. 62 people died and 10 people survived, incurring serious injuries. * On November 15, 1961, A Vickers Viscount N6592C of Northeast Airlines was written off when it collided with a Douglas DC-6 N8228H of National Airlines after landing at Logan International Airport. The DC-6 had started to take-off without receiving clearance to do so. * On July 31, 1973, Delta Air Lines Flight 723, a DC-9 airplane, crashed into a seawall at Logan Airport, causing the deaths of all 83 passengers and 6 crew members on board. One of the passengers initially survived the accident but later died in a hospital. * On November 3, 1973, Pan Am Flight 160, a Boeing 707-321C cargo aircraft, crashed on approach to Boston-Logan. Smoke in the cockpit caused the pilots to lose control. Three people died in the hull-loss accident. * On January 23, 1982, World Airways Flight 30 from Newark to Boston made a non-precision instrument approach to runway 15R and touched down past the displaced threshold on an icy runway. When the crew sensed that the DC-10-30-CF could not be stopped on the remaining runway, they steered the DC-10 off the side of the runway to avoid the approach light pier, and slid into the shallow water of Boston Harbor. The nose section separated as the DC-10 came to rest past the runway end, left of the extended centerline. Two passengers (a father and son) were never found and are presumed to have been swept out to sea. ===Incidents=== * On July 2, 1976, an unoccupied Eastern Airlines L-188 Electra parked at Boston Logan Airport was destroyed by a bomb put in the landing gears. No one was hurt. * On April 3, 1979, a portion of the south wing of Terminal E at Logan Airport was evacuated when a bathroom device triggered a blaze in a third-floor men's room. * On the morning of September 11, 2001, two of the aircraft involved in the 9/11 terrorist attacks, American Airlines Flight 11 and United Airlines Flight 175, left Logan International Airport at about 8:00 and 8:10, both bound for Los Angeles. Both planes were hijacked by terrorists associated with Al Qaeda and flown into the North and South Tower, of New York's World Trade Center on purpose, which made the towers collapse, which led the destruction of the World Trade Center. United and American Airlines have put American flags on Gates B32 and C19, the gates from which the flights left that day. * On December 22, 2001, Richard Reid attempted to blow up American Airlines Flight 63 with a bomb in his shoe over the Atlantic Ocean. The flight left Paris-Charles de Gaulle Airport and its intended destination was Miami International Airport. The flight was diverted to Boston after the passengers and crew caught Reid. One flight attendant was bitten on the thumb by Reid. * On January 7, 2013, ground crew workers noticed smoke coming out from the battery part of a parked Japan Airlines Boeing 787 Dreamliner at the gate. This fire was caused by overcharged lithium-ion batteries, which then leading to the grounding of the 787 airplanes and subsequent redesign of the battery systems. == Gallery == File:LOGAN AIRPORT-CONSTRUCTION OF NEW TERMINAL ON RIGHT BOSTON HARBOR IN BACKGROUND - NARA - 548430.tif|Boston Airport during construction of a new terminal in 1973. File:Terminal B, Logan International Airport, Boston.jpg|Terminal B at Boston. File:United in Logan Terminal C (4105917724).jpg|United Airlines check-in at Terminal C. File:Virgin America Airbus A319-100 N525VA Logan International Airport.jpg|An American Airlines plane and a Virgin America plane at the airport. == References == Category:Transport in Massachusetts Category:Buildings and structures in Boston Category:Airports in the United States",
 "title": "Logan International Airport"
}