{
 "id": "1176678",
 "text": "This is the videography of Canadian singer The Weeknd. ==Music videos== Key Denotes music videos directed or co-directed by the Weeknd Title Year Other performer(s) credited Director(s) Description \"Rolling Stone\" 2012 The Weeknd Filmed in a dimly lit studio in black and white, Tesfaye paints the relationship he has with his fans. \"Wicked Games\" Filmed in black and white, Tesfaye performs while the shadow of a model pulls him in. \"The Zone\" Drake The video features psychedelic shots of Tesfaye, Drake and several women with a plethora of balloons. \"Twenty Eight\" 2013 +IAN (Christian Yu) Tesfaye has a confrontation with a mysterious man. \"One of Those Nights\" Juicy J Sam Pilling A gunman confronts Tesfaye after robbing a bar. \"Kiss Land\" Andrew Baird Set in Japan, the video contains a lot of NSFW footage. \"Belong to the World\" Roh Sang Yoon (filmbyteam) Set in Japan, Tesfaye finds himself among the ranks of a military regime who go out for a night on the town. \"Live For\" Drake Sam Pilling Tesfaye and Drake perform in a dark studio and subway. \"Pretty\" The video revolves around Tesfaye murdering his unfaithful lover \"Gifted\" French Montana Bang Jaeyeob Tesfaye and French Montana perform in a club and in an alleyway. \"Or Nah\" 2014 Ty Dolla Sign Wiz Khalifa DJ Mustard Ryan Patrick The video features Ty Dolla Sign, Wiz Khalifa, DJ Mustard and Tesfaye performing in a horror-like setting with several women. \"Often\" Jesi Le Rae Sam Pilling Tesfaye is filmed in a hotel room surrounded by women. \"King of the Fall\" Kid Studio The video follows Tesfaye walking through his hometown of Toronto. \"Love Me Harder\" Ariana Grande NOVVKIM Grande and Tesfaye perform while withstanding natural elements. \"Earned It\" 2015 Dakota Johnson Sam Taylor-Johnson As Tesfaye performs, Johnson and several other women perform a BDSM-themed burlesque dance behind him. \"The Hills\" Sophie Dalah Rick Wilder Guzza (Kudo) Tesfaye is seen crawling out of a wrecked car that has flipped over. As he walks down the street, he is enragedly pushed by a woman, but he ignores her and the vehicle implodes. He goes into a house, walks up the stairs to a red coloredly lit up room with Wilder (representing a personification of the devil) there with two groupies on a couch. \"Can't Feel My Face\" Chanel Iman Rick Wilder Tesfaye performs at a bar to an unimpressed audience, with the exception of a seduced Iman, a woman throws a cup of unknown liquid on Tesfaye until Wilder arrives and sets him on fire by throwing a lighter on him and all the bar patrons cheer and start dancing, and Tesfaye continues performing, then leaves the club and leans into the camera and begins to melt it. \"Tell Your Friends\" Rick Wilder After burying himself in the desert, Tesfaye is approached by Wilder who Tesfaye shoots then drives away at high speed. \"The Hills\" Eminem John Travolta +IAN (Christian Yu) As a part of an advertisement for Apple Music, the video follows Tesfaye as he leaves a venue and heads for a limo, driven by Travolta, taking him to an afterparty. \"In the Night\" Bella Hadid RIGEND FLIM STUDIO The video follows Hadid as a waitress at a nightclub who kills off gangsters who were taken advantage of her. \"Might Not\" Belly Shomi Patwary Belly After Belly and Tesfaye get intoxicated at a party, the two fear that they might not make it out. \"Low Life\" 2016 Future Sveta Bilyalova Hobin The video features Future and Tesfaye performing in a prison-like setting. Belly and French Montana make cameo appearances in the video. \"Starboy\" Daft Punk Guzza (Kudo) Tesfaye reinvents himself by killing his former persona after sitting on the opposite end of a dining table wearing a mask and then ties up and suffocates the former persona with a plastic bag, and then proceeds to smash all his awards in his hills residence with a neon crucifix and then drives a red McLaren P1 with a black panther (originally a house cat) riding upfront along winding cliff roads. At the 2016 MTV Europe Music Awards, it won Best Video. \"False Alarm\" Kristine Froseth Randy Irwin OJun Kwon The video follows a bank robbery through the first- person perspective of one of the robbers. \"Party Monster\" 2017 Zoi Mantzakanis RIGEND FLIM STUDIO Tesfaye is seen driving through the desert before the psychedelics kicks in and he's transported to a whole new world. \"Reminder\" Drake Metro Boomin Bryson Tiller ASAP Rocky Travis Scott Nav French Montana Kid Studio Released on Tesfaye's 27th birthday, the video features an all-star cast of rappers. \"Some Way\" Nav RJ Sanchez Nav and Tesfaye perform whilst surrounded by women. \"I Feel It Coming\" Daft Punk Kiko Mizuhara Hong Minho (Studio Achilles) Tesfaye performs the song and meets Mizuhara on a rocky, barren planet in outer space. \"Lust for Life\" Lana Del Rey Keep Us Weird (salt film) Del Rey and Tesfaye are seen together on the top of the \"H\" on the Hollywood Sign. \"Secrets\" Black Atlass Hannah Donker Yoon Seokyoung Tesfaye wanders through mysterious anomalies in search of Donker, who is also being pursued by Black Atlass. \"A Lie\" French Montana Max B Belly Spiff TV French Montana French Montana, Max B and Tesfaye perform in various locations in New York City. \"Curve\" Gucci Mane David Helman The black and white video shows populating clones of Gucci Mane and Tesfaye. \"Try Me\" 2018 The Weeknd Originally released as an exclusive vertical video on Spotify, the video was formally released to celebrate the three-year anniversary of the release of Tesfaye's debut extended play My Dear Melancholy (2018). \"Call Out My Name\" Guzza (Kudo) Tesfaye wanders through empty streets and a desert. \"What You Want\" Belly Paranoid Paradigm (VM Project Architecture) Belly and Tesfaye drive through a prison yard. \"Lost in the Fire\" 2019 Gesaffelstein Manu Cossu Gesaffelstien and Tesfaye dance slowly in a dark setting. \"Price on My Head\" Nav Kid. Studio The video focuses on Belly and Tesfaye's hometown of Toronto being burned down. \"Power Is Power\" SZA Travis Scott Roh Sang Yoon (filmbyteam) Inspired by the television series Game of Thrones, Tesfaye, SZA and Scott take turns sitting on the throne. \"Heartless\" Metro Boomin Vikings League The video focuses on Tesfaye and Metro Boomin as they explore Las Vegas. It ends with Tesfaye licking a psychoactive toad and experiencing hallucinations. \"Blinding Lights\" 2020 Miki Hamano Beginning with Tesfaye laughing while blood drips down his face, the video shows flashbacks to decipher how he got to this gruesome end. At the 2020 MTV Video Music Awards, it won Video of the Year and Best R&B; Video. \"In Your Eyes\" Zaina Miuccia Following the events of the After Hours short film, Tesfaye chases Miuccia through different locations before she decapitates him with an axe. \"Until I Bleed Out\" The video shows a dazed Tesfaye navigating through a balloon-filled mansion in a lost and damaged manner. \"Too Late\" Ashley Smith Kenzie Harr 96wave A heavily bandaged Smith and Harr find Tesfaye's severed head on the street and transplants it onto another man's body. \"Hawái\" Maluma Yovanna Ventura Jessy Terrero The remix serves as a continuation for the original video. \"Blinding Lights\" Rosalía Dylan Coughran The video follows Tesfaye and Rosalía during a photoshoot. \"Save Your Tears\" 2021 Bianca Rojas 96wave A disfigured Tesfaye performs at a lavish nightclub. \"You Right\" Doja Cat Chris Petersen Quentin Deronzier The video is set in a majestic palace in the galaxy with heavy astrological influences. \"Better Believe\" Belly Young Thug FLIPEVIL The video features Tesfaye, Belly and Young Thug in an explosive environment. \"Take My Breath\" Shaina West 96wave Tesfaye and West dance together and exchange breaths through an oxygen tank at a pulsating nightclub, before Tesfaye's breath is literally taken away as he gets strangled in West's braids. \"Die for It\" Belly Nas James Larese Tesfaye, Nas and Belly perform in a dystopian-like world. \"Can't Feel My Face\" Camille Rowe Ricky Saiz Released to celebrate the six- year anniversary of the release of Tesfaye's second studio album Beauty Behind the Madness (2015). \"Moth to a Flame\" Swedish House Mafia Alexander Wessely The video serves as a continuation of Swedish House Mafia's previous videos for the singles It Gets Better and Lifetime. \"La Fama\" Rosalía Danny Trejo Jihye Yoon Rosalía performs at a dimly lit nightclub and seduces Tesfaye into joining her onstage. The two dance together until Tesfaye is stabbed by Rosalía with a hidden dagger. \"One Right Now\" Post Malone SL8 Tesfaye and Malone engage in a violent shootout with their respective teams. \"Die For You\" FLIPEVIL Music video released for the fifth anniversary of Starboy's release. The video pays tribute to Stranger Things and E.T. \"Tears in the Club\" FKA Twigs Amber Grace Johnson The video features Tesfaye watching FKA Twigs perform in a tank with tears in his eyes. \"Echoes of Silence\" Kurando Furuya Hajime Sorayama Music video released for the tenth anniversary of Echoes of Silence's release. \"Sacrifice\" 2022 96wave After the events of the \"Take My Breath\" music video, Tesfaye wakes up and gets abducted by some cloaked figures. He is tied up and his soul gets taken by an unknown red cloaked woman. \"Gasoline\" Tedynotbear An older version of Tesfaye finds himself trapped in a disturbing dance party. As he tries to escape, he sees a younger version of himself amongst the crowd, with tears streaming down his face. When the two meet, the younger version attacks the older version and leaves him bruised. \"Sacrifice\" Swedish House Mafia 96wave Taking place in an alternate reality, Tesfaye and Swedish House Mafia watch a ballroom scene competition. \"Out of Time\" HoYeon Jung Jim Carrey After the events of the \"Gasoline\" music video, the younger version of Tesfaye and Jung sing karaoke and begin a whirlwind romance alone in a hotel. His older version tries to reach out, but wakes up in an operating room as Carrey places a mask on his face. The video pays homage to Lost in Translation (2003). \"How Do I Make You Love Me?\" Jocelyn Charles 96wave Animation directed by Jocelyn Charles. Creative direction and concept by Cliqua. \"Is There Someone Else?\" 2023 Mackenzee Wilson 96wave Starring Tesfaye & Mackenzee Wilson. \"Creepin'\" Metro Boomin 21 Savage Diddy Mario Winans FLIPEVIL Tesfaye, Metro Boomin, Diddy and 21 Savage are surveilled by a mystery woman on a rainy night. Mario Winans, the original artist of I Don't Wanna Know, which Creepin' partially covers, makes a cameo. \"One of the Girls\" Jennie Lily-Rose Depp Boring Studio (Lee Suho) Montage of scenes featuring the Weeknd, Jennie, and Lily-Rose Depp from the television series The Idol interspersed with footage of Depp singing. \"K-Pop\" Travis Scott, Bad Bunny \"Popular\" 2024 Madonna, Playboi Carti \"Young Metro\" Future & Metro Boomin \"We Still Don't Trust You\" Hidji World, Omar Jones \"Dancing in the Flames\" \"Timeless\" Playboi Carti \"São Paulo\" \"Red Terror\" \"Open Hearts\" 2025 Guest appearances \"Headlines\" 2011 Drake La Mar Taylor Highly Alleyne Tesfaye makes a guest appearance with members of his XO record label. \"Sarah's Song\" 2013 Ricky Hil La Mar Taylor Tesfaye appears alongside Hil throughout. \"XO Tour Llif3\" 2017 Lil Uzi Vert Nav Virgil Abloh Tesfaye makes a cameo appearance with Nav. == Filmography == === Film === Title Year Role Director(s) Notes Road to Release 2013 Himself Himself Short MTV documentary Taylor Swift: The 1989 World Tour Live 2015 Jonas Åkerlund Concert film Michael Jackson's Journey from Motown to Off the Wall 2016 Spike Lee Documentary Mania Grant Singer Short film; also co-writer Uncut Gems 2019 Josh and Benny Safdie Feature film; cameo appearance After Hours 2020 Anton Tammi Short film The Show 2021 Nadia Hallgren Documentary Live at SoFi Stadium 2023 Micah Bickham Concert film Live From São Paulo 2024 Hurry Up Tomorrow 2025 Trey Edward Shults Feature film === Television === Title Year Role Notes Saturday Night Live 2015–16; 2020 Musical guest S41 E2, S42 E1, S45 E15 American Dad! 2020 Himself (voice) Episode: \"A Starboy Is Born\"; also co-writer Robot Chicken Various voices Episode: \"Endgame\" Super Bowl LV Halftime Show 2021 Himself Television special The Dawn FM Experience 2022 The Simpsons Orion Hughes, Darius Hughes (voices) Episode: \"Bart the Cool Kid\" The Idol 2023 Tedros Lead role; also co-creator, writer and executive producer == References == Videography Category:Filmographies Category:Videographies",
 "title": "The Weeknd videography"
}