{
 "id": "1176477",
 "text": "The 2026 FIFA World Cup qualifying tournament in Europe will determine the participants of the Union of European Football Associations (UEFA) for the 2026 FIFA World Cup finals, which will be held in Canada, Mexico and the United States . Europe will receive 16 places in the final stage of the tournament. == Participants == All 55 UEFA members are eligible to take part in the qualifying tournament. However, the Russian national team was suspended from participation in UEFA and FIFA tournaments in February 2022 for political reasons for an indefinite period . * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * (suspended) * * * * * * * * * * * == Format == On 25 January 2023, the UEFA Executive Committee approved the new format of the qualifying tournament at a meeting in Nyon. Due to the increase in the number of places in the final stage of the World Cup from Europe from 13 to 16 the format of the qualifying tournament has changed compared to the previous one . There will now be 12 groups in the group stage of the qualifying tournament, each of which will contain four or five teams. The winner of each group qualifies directly for the World Cup finals, while the runners-up in their groups qualify for a play-off, which will also include the four highest-ranked teams in the 2024–25 UEFA Nations League that finished lower than second in the World Cup qualifying tournament. On 28 June 2023, the UEFA Executive Committee proposed this format for consideration by FIFA.FIFA approved this format in August 2023. * First round (group stage) : 12 groups of 4 or 5 teams each will play each other in two matches (home and away). The group winners qualify for the 2026 World Cup finals. The draw for the UEFA qualifying group stage will take place in December 2024. * Second round (knockout stage) : 16 teams (12 group runners-up and four UEFA Nations League teams based on rankings) will be drawn into four 'paths' and play two single- match knockout rounds (semi-finals and final). The winners of the four \"paths\" qualify for the final stage of the 2026 World Cup. == Schedule == Below is the schedule for the UEFA 2026 World Cup qualifying tournament. In groups with five participants, the first matches will be played in March 2025 (or June 2025 if the group participants play in the quarter-finals or play-offs of the UEFA Nations League ). In groups with four participants, the first matches will be held in September 2025. Round Game day Dates Groups of 5 teams Groups of 4 teams First round (group stage) Game day 1 — March 21-22, 2025 Game day 2 24-25 March 2025 Game day 3 June 6-7, 2025 Game day 4 June 9-10, 2025 Game day 5 Game day 1 4-6 September 2025 Game day 6 Game day 2 September 7-9, 2025 Game day 7 Game day 3 9-11 October 2025 Game day 8 Game day 4 12-14 October 2025 Game day 9 Game day 5 November 13-15, 2025 Game day 10 Game day 6 November 16-18, 2025 Second round (playoff) Semi-finals March 26, 2026 Finals March 31, 2026 == Draw == The draw for the qualifying tournament took place in Zurich on 13 December 2024. == First round == === Team classification criteria === In case of equality of points between two or more teams, the following classification criteria are applied: # the highest goal difference in all group matches; # highest number of goals scored in all group matches; # the greatest number of points scored in head-to-head matches between teams; # the greatest difference between goals scored and conceded in head-to-head matches between teams; # the greatest number of goals scored in head-to-head meetings between teams; # the greatest number of goals scored in away matches in head-to-head meetings between teams; # the lowest number of fair play disciplinary points (1 point for a yellow card, 3 points for a red card, 3 points for a dismissal for two yellow cards); # draw. == Примечания == == Links == * Official website of the 2026 FIFA World Cup * Qualifying matches on the UEFA website Category:2026 in association football Category:2025 in association football",
 "title": "2026 FIFA World Cup (qualifying tournament, UEFA)"
}