{
 "id": "1176460",
 "text": "The Planetary Missions Program Office is a part of NASA that is located at the Marshall Space Flight Center. It was started in 2014 by NASA for the Discovery and the New Frontiers programs, and the Solar System Exploration Program that focused on planetary science. The Discovery and the New Frontiers were made in 1992 and 2001 and have launched 14 missions. The Solar System Exploration Program was made by NASA in late 2014, with three missions planned for launch == Programs == ===Discovery=== The Discovery program was started in the 1990 by NASA administrator Daniel Goldin. It was part of NASA's plan to make space missions faster, cheaper, and better. In this program, scientists suggest their own ideas for space missions. Experts review the ideas, and NASA chooses the best ones. Missions The following is notable missions in the Discovery Program * NEAR Shoemaker - a 1996 robotic space probe that landed on 433 Eros in 2001, first mission of the program * MESSENGER - seventh mission of the Discovery program, explored Mercury. * Dawn - a probe that was launched in 2005 and explored 1 Ceres and 4 Vesta. * Kepler - a space telescope that was launched in 2009 and discovered extrasolar planets. * InSight - a robotic lander that was launched in 2018 and landed on Mars in the same year * Lucy - thirteenth mission of the Discovery program; multiple-flyby reconnaissance of five Jupiter trojans, -launched in 2021 * Psyche (spacecraft) - launched in 2023, making it the most recent mission in this program as of March 2025. It will study 16 Psyche. * DAVINCI - a Venus atmospheric probe that will launch in 2029 * VERITAS - a Venus orbiter that will launch in 2031 === New Frontiers === The New Frontiers program is a series of space missions led by NASA to learn more about the Solar System. It was started in 2001. Currently, there are three active missions and one in development, these include: * New Horizons - launched in 2006, a probe that visited Pluto and a Kuiper belt object and 486958 Arrokoth * Juno - launched in 2011, a spacecraft that is orbiting and studying Jupiter. * OSIRIS-REx - launched in 2016, a sample- return mission that was on Bennu, currently on it's mission extension called OSIRIS-APEx that will aproach Apophis in 2029. * Dragonfly - will launch in 2028, is a mission planned by NASA to explore Saturn's moon Titan with a robotic aircraft. === Solar System Exploration === The Solar System Exploration Program is a space program made by NASA. It's first mission is called DART, an asteroid redirection mission that did impact of asteroid Dimorphos in 65803 Didymos system. In 2024 NASA launched another probe to Jupiter called Europa Clipper. The European Space Agency's JUICE probe has the NASA made Solar System Exploration Program-funded parts for studying Jupiter and its moons. As of March 2025 there are three active missions, these include: * Double Asteroid Redirection Test - launched in 2021, first mission in NASA's Solar System Exploration program; impact of asteroid Dimorphos in 65803 Didymos system. * Jupiter Icy Moons Explorer - launched in 2023, mission of the European Space Agency to explore Jupiter’s moons * Europa Clipper - launched in 2024, currently going to Jupiter to study Europa. Category:Outer space",
 "title": "Planetary Missions Program Office"
}