{
 "id": "1176824",
 "text": "Trevor Dean Mann (born October 11, 1988) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) under the ring name Ricochet. Mann has also made appearances in Chikara, Evolve, Dragon Gate USA (DGUSA), Pro Wrestling Guerrilla (PWG), Dragongate, New Japan Pro-Wrestling (NJPW), Lucha Underground, and WWE. In Lucha Underground, Mann wore a mask and went by the ring name Prince Puma. He alos wore a mask in Chikara and went by the ring name Helios. Mann has held many championships over his career. In Chikara, he was the winner of the Young Lions Cup V. In DG, he was a one-time Open the Brave Gate Champion, one-time Open the Dream Gate Champion, one-time Open the Triangle Gate ChampionshipOpen the Triangle Gate Champion, two-time Open the Twin Gate Champion, and the winner of the King of Gate tournament in 2013. In DGUSA, he was a one-time Open the Freedom Gate Champion and two-time Open the United Gate Champion. In Lucha Underground, he was a two-time Lucha Underground Champion, one-time Lucha Underground Trios Champion, and winner of The Cueto Cup tournament in 2016. In NJPW, he was a three-time IWGP Junior Heavyweight Tag Team Champion, three-time NEVER Openweight 6-Man Tag Team Champion, winner of the Best of the Super Juniors tournament in 2014, and co- winner of the Super Jr. Tag Tournament with Matt Sydal in 2015. In PWG, he was a one-time PWG World Champion and the winner of the Battle of Los Angeles tournament in both 2014 and 2017. In WWE, he was a one-time WWE Intercontinental Champion, one-time WWE United States Champion, one-time NXT North American Champion, and one-time and the first WWE Speed Champion. ==Career== ===All Elite Wrestling === On August 22, 2024, it was announced that Ricochet had signed a multi-year contract to become a member of the All Elite Wrestling (AEW) roster. At All In, Ricochet made his AEW debut and participated in the Casino Gauntlet match for a shot at the AEW World Championship in the future. The match was won by Christian Cage. On the October 2 episode of Dynamite, Ricochet challenged Will Ospreay for his AEW International Championship but the match was ruled a no contest twice; first from a double pin and second after Konosuke Takeshita interfered and attacked both wrestlers. At WrestleDream, Ricochet challenged Takeshita and Ospreay in a three-way match for the AEW International Championship but Takeshita won. At Full Gear, Ricochet once again challenged for the AEW International Championship but lost to Takeshita again. Ricochet decided to then enter the Continental Classic. He was placed in the Gold League, losing his first match to Claudio Castagnoli before earning victories over Komander, Brody King, and Will Ospreay. He fought Darby Allin to a time-limit draw before losing to Kazuchika Okada in the semi-finals. Over the course of the tournament, Ricochet started to act more heelish and cheat in matches. At Fight for the Fallen, Ricochet fully turned heel after he attacked and stabbed Swerve Strickland with a pair of scissors. At Wrestle Dynasty, Ricochet challenged Zack Sabre Jr. for the IWGP World Heavyweight Championship but was unsuccessful. At Revolution, Ricochet challenged Swerve Strickland in a number one contendership match for the AEW World championship but lost. On the March 19 episode of Dynamite, Ricochet along with \"Speedball\" Mike Bailey both won a final four-way match in an eliminator tournament for a shot at Kenny Omega's AEW International Championship. == Personal life == On January 10, 2023, Mann announced his engagement to professional wrestling ring announcer and musician Samantha Irvin. Mann and Irvin married on March 26, 2025. He has a son from a former marriage. == References == ==Other websites== * Category:1988 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from Kentucky",
 "title": "Ricochet (wrestler)"
}