{
 "id": "1176599",
 "text": "Future Italian Frescos (Italian: Futuri affreschi italiani) is a 2018 Italian film about contemporary artist Salvatore Garau. The film explores Garau's artistic vision through a poetic visual narrative, connecting classical fresco traditions with his abstract, conceptual approach to space, surface, and spirituality. == Synopsis == The film examines Garau’s reinterpretation of the fresco in a contemporary context, treating walls, voids, and silence as integral elements of artistic expression. Through evocative imagery and visual metaphors, the work presents a dialogue between Italian cultural memory and future-oriented aesthetics. An expansive and deteriorating interior—long abandoned—bears silent traces of its past. Oversized canvases, echoing the grandeur of lost altarpieces, lean against the walls. Their classical forms, displaced in time, suggest a future that never arrived. The purpose of the space is unclear: a former gallery? a forgotten studio? What remains is a lingering presence, as if the walls themselves remember. Into this charged atmosphere steps an artist, who re-inhabits the void. As he paints, he responds to the silent energy still radiating from the room. The neglected altarpieces, suspended in decay, become the true protagonists of his dialogue with absence and memory. == Festivals and Awards == Future Italian Frescos has been selected and screened at several international film festivals: * New York Film Festival * International Film Festival of India * Spain Film Festival (2021) * Winner of Brazilia Festival of Brazilian Cinema (2021) == Reception == The film has been noted for its meditative tone and innovative approach to the artist documentary format, receiving attention from both art critics and film programmers. == Related pages == * Salvatore Garau * Fresco * Contemporary art * Art film == References == == Other websites == * * Future Italian Frescos – full film on YouTube * Article from La Nuova Sardegna (2017)",
 "title": "Future Italian frescos"
}