{
 "id": "1176498",
 "text": "Brian Lee Draper (born March 21, 1990) and Torey Michael Adamcik (born June 14, 1990) are former American high school juniors who were convicted in Idaho as juveniles of the first-degree murder of Cassie Jo Stoddart on September 22, 2006, in Tyhee, Idaho. Each aged 16 when they committed the crime against their high school classmate, they received mandatory sentences of life in prison without parole. The perpetrators claimed that they were inspired to murder Stoddart by the slasher film Scream, which led to them being nicknamed \"The Scream Killers\". Adamcik and Draper recorded documentary-style videos about how they were horror movie fans, especially Scream, and wanted to reenact a similar murder in real life. They started a \"Death List\" of other potential victims the day of Stoddart's murder, following their initial plan. == Background == Brian Draper was born in Sandy, Utah before moving with his family to Pocatello, Idaho. He met Torey Adamcik when they were both students at Pocatello High School. Both boys were interested in films and started recording on their own. The victim, Cassie Jo Stoddart, also attended the same school; she and both killers were juniors. Both attackers were former Mormons who became atheist before the attack. == Murder == On the night of September 22, 2006, Stoddart was house sitting for her aunt and uncle, Allison and Frank Contreras, on Whispering Cliffs Drive in northeast Bannock County, in Tyhee, Idaho.Sumter, A.N. (2019) Murder of Cassie Jo Stoddart: 16-year-old girl was brutally killed by her classmates , Brian Lee Draper and Torey Michael Adamcik. The Criminal Journal. Retrieved April 23, 2020. The Contreras family were out of town and had hired Stoddart to come take care of their three cats and two dogs for the weekend. Stoddart was visited that evening by her boyfriend, Matt Beckham, who arrived around 6:00 p.m. Later, classmates Brian Draper and Torey Adamcik, who were both aged 16 at the time, came over to the house to \"hang out\". Stoddart gave the friends a tour of the house, including the basement. The four teens went into the living room to watch the film Kill Bill, Volume II, but Adamcik and Draper ended up leaving before the film ended, saying they \"wanted to watch a movie at their local movie theater instead.\" Stoddart and Beckham stayed behind. Stoddart was unaware that before the boys left, Draper had unlocked the basement door so that he and Adamcik could re-enter the house undetected. Some time after leaving the house on Whispering Cliffs, Draper and Adamcik returned to the neighborhood, parked down the street, got out of the car, and put on costumes consisting of dark clothing, gloves, and white, painted masks. The boys quietly entered the house through the basement door while the couple were watching television in the living room. They intentionally made loud noises in an unsuccessful attempt to lure Beckham and Stoddart downstairs \"so they could scare them.\" Next, they found the circuit breaker and turned off the power in the house, hoping the pair would come downstairs to check the breaker. When Beckham and Stoddart did not come downstairs, the boys turned some of the lights back on. Stoddart became uneasy after the temporary power outage, and Beckham noticed that one of the Contreras’ dogs kept staring down the basement stairs, periodically barking or growling. Seeing that Stoddart felt scared, Beckham called his mother to ask if he could stay the night at the house with her to ease her mind, but she denied his request – instead she offered to let Stoddart come home with Beckham and stay at their house for the night, and she would bring Stoddart back to the Whispering Cliffs house the next morning. However, Stoddart felt it was her responsibility to stay at the house as she was hired to do and care for the animals, and declined the offer from Beckham's mother. At approximately 10:30 pm, Beckham’s mother picked him up, leaving Stoddart at the house alone. Beckham called Adamcik’s cell phone to see where he and Draper were, possibly to meet up with them later. Beckham said he could barely hear Adamcik, who was whispering on the phone, and assumed the boys were in a movie theater. From the basement, Draper and Adamcik heard Beckham leave. The teens turned the lights out again at the circuit breaker and waited, hoping Stoddart would come downstairs to turn the lights back on; she did not. Eventually, the boys went upstairs. Draper was armed with a dagger-type weapon and Adamcik had a hunting knife, the weapons having been purchased at a pawn shop.STATE v. DRAPER, Leagle Draper opened and slammed a closet door at the top of the stairs to scare Stoddart, who was lying on the couch in the living room. The boys then brutally attacked her, stabbing her approximately thirty times; twelve wounds were potentially fatal. During the investigation of the murder, police found that Draper and Adamcik had recorded their plan to murder Stoddart in advance on videotape while they were at school. This video footage was shown at their trials. Therefore they were arrested. == Arrest and interrogations == Draper and Adamcik were arrested on September 27, 2006, and charged with first degree murder and conspiracy to commit first-degree murder. During the interrogations, each teen blamed the other. Draper claimed he was in the same room with Adamcik when Stoddart was killed but denied stabbing her, then later admitted to stabbing her under alleged commands from Adamcik. He led investigators to Black Rock Canyon, where the teens had disposed of the clothing, masks, and weapons they used for the murder. == Trial and sentencing == At trial, the prosecution revealed that both boys were inspired by Eric Harris and Dylan Klebold, who committed the Columbine High School massacre, aswell as the Scream horror film franchise. In a passage written by Draper that was shown in court during his trial titled \"Columbine\", it read: Draper was convicted on April 17, 2007; Adamcik was convicted on June 8, 2007. On August 21, 2007, based on being convicted of first-degree murder, each received a mandatory sentence of life imprisonment without the possibility of parole, and thirty years-to-life for being convicted of conspiracy to commit murder. Adamcik and Draper are both serving their time at Idaho State Correctional Institution, located in unincorporated Ada County, Idaho, near Kuna.\"Locations.\" Idaho Department of Correction. Retrieved June 4, 2011. \"Idaho State Correctional Institution (ISCI), 13500 S. Pleasant Valley Rd, Kuna, ID 83634\" In November 2019, Adamcik’s sentence was upheld after his appeal was denied by the Idaho Supreme Court. === Draper is a follower theory === One hypothesis put forward by professionals and Pocatello authorities is that Adamcik was the mastermind of Cassie Jo Stoddart's murder. This theory is supported by the boys' behavior in their recordings, in which Adamcik appears to dominate Draper. Adamcik tells Draper to be quiet and interrupts him to tell him he said something \"lame\" or \"gay,\" while belittling him on various issues. Throughout the footage, only Adamcik interrupts Draper, and only Draper agrees with what he says. Adamcik has long been considered by many professionals to be the epitome of juvenile psychopathy. Some believe Draper was a depressed outcast manipulated by Adamcik. == Appeals == The murderers' attorneys filed separate appeals at the Idaho Supreme Court, in September 2010 for Adamcik and in April 2011 for Draper. Draper was seeking to have his conviction vacated or to be given a limited life sentence that would allow for his release on parole (if approved) after thirty years. The first appeal for both Adamcik and Draper was denied in a 3–2 decision. The high court vacated Draper's conviction on conspiracy to commit first-degree murder, saying that jurors were given erroneous instructions on that charge, but they affirmed his conviction for first-degree murder and life sentence without parole. In July 2015, Adamcik gained a hearing for post-conviction relief with state Sixth District Magistrate Judge Mitchell W. Brown. He claimed that testimony from character witnesses could have changed the outcome of the sentencing, but that his former attorney, against his parents' wishes, chose not to call upon these witnesses. Adamcik said that his attorney believed that the prosecution would have submitted even more damaging evidence. In March 2016, Judge Brown denied his request for post-conviction relief.Shelbie Harris, \"Remembering Cassie Jo — Brother opens up on 10th anniversary of grisly murder\", Idaho State Journal, September 25, 2016. Retrieved June 9, 2017 Adamcik appealed Judge Brown's decision to the Idaho Supreme Court, which on December 26, 2017, rejected Adamcik's appeal for post-conviction relief and upheld the district court decision. Following the Idaho Supreme Court's decision, Adamcik filed a federal writ of habeas corpus in January 2018, in which he argued that the court denied his first appeal based on a theory that was not presented to the jury. Adamcik also argued that he should be entitled to a new sentencing hearing in light of the Miller and Montgomery decisions (see section US Supreme Court and mandatory life sentences below). Federal magistrate judge Candy W. Dale presided over Adamcik's writ and on November 25, 2019, she denied the writ. Adamcik is currently appealing Judge Dale's decision to the Ninth Circuit Court of Appeals with oral arguments taking place on February 7, 2022, with Jay Bybee, Morgan Christen, and James Selna (who's sitting by designation) presiding. On March 24, 2022, they upheld the sentence in an unpublished decision. == Civil suit by Stoddart family == In 2010, the Stoddart family filed a civil lawsuit against the Idaho School District, claiming that school authorities were negligent and should have known that Draper and Adamcik posed a threat to others. Both the civil court and the Idaho Supreme Court dismissed the case, saying the actions of the killers were not foreseeable. == Media == In August 2012, Shannon Adamcik, Torey's mother, self-published the book The Guilty Innocent. In September 2015, Pamela Lillian Valemont published the book Mormon Sons - Brian Draper and Torey Adamcik. On February 16, 2023, the tape recordings that Draper and Adamcik made, along with a complete transcript of the tape recordings, were obtained from the Bannock County, Idaho court system through the Idaho Public Records Act. Alt URL This case has been featured in several different television shows and programs including a February 18, 2024, episode of the popular true crime series Dateline with correspondent Keith Morrison. Draper and Adamcik were interviewed as potential suspects in the murder of Nori Jones as part of the Cold Justice episode, \"Still of the Night\", which aired in January 2015. Draper and Adamcik were featured in Lost for Life (2013), a documentary about juveniles who are serving life in prison without parole and their victims' families. == Documentaries == *MSNBC: \"In Coldest Blood\" - May 20, 2012 * Your Worst Nightmare: \"When the Lights Go Out\", S1 E2 - October 29, 2014 * CopyCat Killers: \"Scream\", S1 E1 - February 27, 2016 * Murder Among Friends: \"Stick to the Plan\", S2 E16 - July 20, 2017 * Unmasked: \"The Final Scream\", S1 E2 - October 22, 2018 * A Time to Kill: \"Evil in the Basement\", S4 E6 - August 13, 2021 * Dateline: \"The Secret in Black Rock Canyon\", S32 E28 - February 18, 2024 == U.S. Supreme Court and mandatory life sentences == In Miller v. Alabama , the United States Supreme Court ruled that mandatory sentences of life without the possibility of parole are unconstitutional for juvenile offenders, even in cases of murder, ruling that the youth of the convict had to be considered. In 2016, the Supreme Court ruled in Montgomery v. Louisiana that this doctrine had to be applied to cases retroactively, and directed a review of all such cases, potentially 1,200 to 1,500 nationwide. Given juveniles' brain immaturity, the Supreme Court ruled that there had to be an opportunity to consider mitigating factors, as well as for later review of the sentences of such inmates, with possible relief for persons who had reformed. It said that \"children who commit even heinous crimes are capable of change.\"\"Supreme Court: Life sentences on juveniles open for later reviews\", The Washington Post, January 25, 2016. Retrieved June 9, 2017 Draper and Adamcik are among the cases that the state courts will review under this ruling. Some 1,100 cases are found in the states of Pennsylvania, Louisiana, and Michigan, where state courts had ruled that the Miller v. Alabama decision was not retroactive. On October 16, 2019, the Supreme Court held oral arguments in Mathena v. Malvo, another juvenile life without parole case that could have had an effect on Adamcik's and Draper's sentences. The Supreme Court dismissed the Malvo case, but heard oral arguments in Jones v. Mississippi, another case relating to juvenile life without parole sentences, on November 3, 2020. On April 22, 2021, the Supreme Court ruled in Jones that a finding of permanent incorrigibility isn't required when sentencing a juvenile. == See also == * Columbine effect * Leopold and Loeb * Eric Harris and Dylan Klebold * Slender Man stabbing == References == Category:1989 births Category:2006 deaths Category:Murder victims",
 "title": "Murder of Cassie Jo Stoddart"
}