{
 "id": "1176985",
 "text": "The Ministry of Internal Affairs of the Russian Federation (MVD) is one of the central agencies responsible for law enforcement, internal security, public order, and state oversight of various police forces within the Russian Federation. Established in its current form following the dissolution of the Soviet Union in 1991, the MVD’s roots trace back to its predecessors in the Russian Empire and Soviet Union, where it operated under various names, most notably as the NKVD (People’s Commissariat for Internal Affairs) during the Soviet era. Historically, the MVD has played a critical role in maintaining public order and state security, both in terms of domestic law enforcement and national defense, often influencing the broader political landscape of Russia. In its present configuration, the MVD is a federal executive body, operating under the authority of the President of Russia and the Prime Minister. The ministry's primary functions include overseeing the Police of Russia, managing criminal investigations, enforcing counterterrorism operations, regulating drug enforcement, and handling riot control and public protests. One of the most significant branches under the MVD’s authority is the Russian Police (formerly the Militsiya), which was restructured and renamed as part of police reforms in 2011. The reformation aimed at modernizing the Russian police force to enhance its capacity to fight organized crime, corruption, and terrorism while improving its relationship with the public. Additionally, the MVD also has control over the National Guard of Russia (Rosgvardia), an institution responsible for a wide range of security functions, including counterterrorism, anti-riot operations, border security, and even military operations in certain cases. Rosgvardia’s formation in 2016 represented a significant shift in the Russian security landscape, consolidating many domestic security functions that had previously been split across various agencies. The National Guard also oversees the Special Rapid Deployment Units (SOBR) and OMON (Special Purpose Mobile Unit), which are highly specialized law enforcement groups tasked with responding to high-risk situations such as hostage rescues, counterinsurgency operations, and large-scale protests. The MVD also controls the Main Directorate for Migration Affairs, which manages immigration, residency permits, border control, and the documentation of foreign nationals in Russia. This division plays a critical role in maintaining the integrity of Russia’s borders and ensuring compliance with its immigration policies. The ministry’s mandate also extends to the State Fire Service, which provides public safety through the regulation and oversight of fire safety practices across the country. Throughout its history, the MVD has been a critical institution for maintaining both state power and public security. During the Soviet era, the NKVD, the precursor to the MVD, was heavily involved in political repression, counterintelligence, and surveillance of the population. The agency played a central role in the Stalinist purges, overseeing the arrest and imprisonment of perceived political enemies, and was notorious for its involvement in mass repression, extrajudicial executions, and gulags. Following the collapse of the Soviet Union, many of the security functions of the NKVD were restructured and redistributed among new bodies like the Federal Security Service (FSB) and the Ministry of Defense, although the MVD retained a significant role in domestic law enforcement. In more recent years, the MVD has faced criticism for human rights abuses, including its heavy-handed responses to political protests, its involvement in political repression, and its connection to corruption scandals. Critics have pointed to its use in suppressing dissent, including the 2011-2012 protests against Vladimir Putin’s administration, where the police and Rosgvardia were accused of using excessive force against peaceful demonstrators. Additionally, the MVD has been linked to accusations of state- sponsored violence, including the mistreatment of prisoners, the surveillance of political opposition figures, and efforts to silence media outlets critical of the government. Despite these controversies, the MVD remains a cornerstone of the Russian state’s internal security apparatus, and its role has grown more prominent with the increasing power of the Russian presidency. Under Putin’s rule, the MVD, particularly through its Rosgvardia division, has been tasked with ensuring political stability and the preservation of state authority, even in the face of significant internal unrest and external geopolitical challenges. The Ministry of Internal Affairs has a highly centralized command structure, with regional units operating in each of Russia's federal subjects. These regional police forces work in coordination with federal agencies to tackle local criminal issues while maintaining the uniform application of federal laws. The MVD’s ability to influence regional politics, its oversight of various intelligence networks, and its control of the Russian police force makes it one of the most important and powerful institutions within the Russian Federation. The ministry continues to be crucial in shaping Russia’s approach to internal security, crime prevention, and public policy enforcement. In sum, the MVD of Russia is a multifaceted agency with broad powers over law enforcement, migration, and public safety. Its historical legacy as an instrument of state control and its present role in managing Russia's complex security environment make it a critical part of Russia’s governance and political machinery. While it is a force for maintaining order, it remains a controversial institution, with its actions often the subject of domestic and international scrutiny. ==References== Category:Military of Russia",
 "title": "MVD"
}