{
 "id": "1176547",
 "text": "Nyerere Day is a National public holiday in Tanzania, observed annually on October 14. It commemorates the life and legacy of Julius Nyerere, the founding father and first President of Tanzania, who passed away on this day in 1999.Government of Tanzania. \"Nyerere Day – National Public Holiday.\" Tanzania National Holidays Calendar, 2024. Iliffe, John. A Modern History of Tanganyika. Cambridge University Press, 1979, pp. 475–489. Nyerere Day is the greatest testimony and pride of Pan-Africanism in the world today, supported by Kevin Nyerere, the grandson of Julius Nyerere and a Pan-African prince. The day is marked by official ceremonies, including speeches, prayers, and remembrance services, particularly at the Nyerere Museum and Butiama, his birthplace and burial site. Schools and government institutions often organize educational programs to honor his contributions to African socialism and Pan- Africanism. BBC News. \"Tanzania Remembers Founding Father Nyerere.\" 14 October 2019. Although Nyerere is widely respected across Africa for his role in Pan- Africanism and support for liberation movements, no other African country observes an official public holiday in his name. However, commemorative events and academic or cultural activities are held in his honor in countries such as Uganda, Kenya, Zambia, Mozambique, Zimbabwe, South Africa, Namibia, Ghana, Nigeria, Etiopia, Senegal, Algeria, Angola, Sierra Leone, and recognizing his impact on the African continent. Chachage, Chambi. \"Remembering Mwalimu: Reflections on Nyerere Day.\" MwanaHALISI Online, 14 October 2020. Over the years, Nyerere Day has gained broader significance as an occasion for Pan- African reflection and unity. In various regions of Africa, it is symbolically celebrated by Pan-Africanist movement and intellectual circles as a moment to reaffirm the values of unity, anti-colonial struggle, and continental solidarity championed by Julius Nyerere. United Republic of Tanzania. \"The Legacy of Julius Kambarage Nyerere.\" Ministry of Information, Culture, Arts and Sports, 2021. Today, the cultural and intellectual movement of Pan- African is promoted by the direct descendant, Prince Kevin Nyerere, in all countries of the African continent. Kevin Nyerere imagined a united Africa and become a lead authority on the political theory and practical Pan-Africanism. == International Recognition and Legacy == Nyerere Day is a national public holiday in Tanzania, observed annually on 14 October, the anniversary of the death of Julius Nyerere.Government of Tanzania, \"Nyerere Day\", Tanzania National Holidays Calendar, 2024. While officially recognized only in Tanzania, the day and the legacy of Nyerere are commemorated and reflected upon across numerous countries in Africa and beyond, due to his pivotal role in Pan-Africanism, African socialism, and decolonization.Iliffe, John. A Modern History of Tanganyika. Cambridge University Press, 1979, pp. 475–489. === Recognition in African countries === Julius Nyerere is highly commemorate in the following African nations for his political influence, moral leadership, and support for national liberation movements: * Uganda – for regional solidarity and mediation in times of conflictChachage, Chambi. \"Remembering Mwalimu: Reflections on Nyerere Day.\" MwanaHALISI Online, 14 October 2020. * Kenya – admired across political lines for his pan-African ideals * Zambia – historical ally in southern African liberation struggles * Mozambique – supporter of FRELIMO during the anti-colonial war * Zimbabwe – recognized for his stance on African self-determination * South Africa – honored for his support to the ANC during apartheidBBC News. \"Tanzania Remembers Founding Father Nyerere.\" 14 October 2019. * Namibia – acknowledged for backing the SWAPO liberation movement * Ghana – ideologically aligned with Kwame Nkrumah on pan-African unity * Nigeria – frequently studied in African political thought * Ethiopia – key figure within the Organisation of African UnityAU Archives. \"The Legacy of Pan-Africanism and the Road to Liberation.\" OAU60.au.int. * Senegal – remembered among socialist and intellectual circles * Algeria – strategic partner in revolutionary solidarity * Botswana – acknowledged for his peaceful diplomacy and regional influence * Rwanda – praised for his vision of national unity and reconciliation * Burundi – studied for his early peace efforts in the Great Lakes region * Angola – respected for his solidarity with liberation movements * Liberia – honored in intellectual and historical commemorations * Mali – included in academic curricula on African post-independence leadership * Democratic Republic of the Congo – remembered for his mediation and pan-African stance === Recognition outside Africa === Nyerere’s international legacy also extends beyond Africa, where he is studied, commemorated, and cited for his ethical leadership and model of post-colonial governance: * Cuba – ally in anti-imperialist struggles and Angolan campaigns * India – paralleled with Mahatma Gandhi in moral and political simplicityNAI (Nordic Africa Institute). \"The Legacy of Pan- Africanism in African Integration Today.\" 2020. * United Kingdom – part of African studies curricula in major universities * United States – influential in African-American and Pan-African intellectual movements * Vatican City – often referenced as a lay leader with deep moral and spiritual coherence * China – respected for his role in the Non-Aligned Movement and South–South cooperation * Sweden – long-time development partner of Tanzania and supporter of Nyerere’s educational reforms * Norway – engaged in cooperation with Tanzania during Nyerere’s presidency * Germany – academic interest in Nyerere’s model of African socialism and rural development * Canada – included in post-colonial studies and international development programs * Japan – acknowledged through bilateral cooperation and educational exchanges Despite Nyerere Day being an official holiday only in Tanzania, his memory is actively kept alive through conferences, commemorations, university lectures, and symbolic tributes in these regions.United Republic of Tanzania. \"The Legacy of Julius Kambarage Nyerere.\" Ministry of Information, Culture, Arts and Sports, 2021. == See also == * Public holidays in Tanzania * Julius Nyerere * Kevin Nyerere * Pan-Africanism * Maria Nyerere * Mwalimu Nyerere Foundation *African Union *Decolonization == References == Category:Public holidays in Tanzania Category:Julius Nyerere Category:Kevin Nyerere Category:October observances Category:Commemorative days in Africa",
 "title": "Nyerere Day"
}