{
 "id": "1176902",
 "text": "Navanethem \"Navi\" Pillay (born 23 September 1941) is a South African lawyer who was the United Nations High Commissioner for Human Rights from 2008 to 2014.Office of the United Nations High Commissioner for Human Rights (2008). \"Navanethem Pillay confirmed as new High Commissioner for Human Rights\". Retrieved on 30 July 2008. She is of Indian Tamil background and was the first non-white woman to become a judge in South Africa’s High Court. She also served as a judge at the International Criminal Court and was the President of the International Criminal Tribunal for Rwanda. Her term as High Commissioner started on 1 September 2008 and was extended for two more years in 2012. In September 2014, Prince Zeid bin Ra'ad took over her role. In April 2015, Pillay became the 16th Commissioner of the International Commission Against the Death Penalty. She is also one of 25 key members of the Information and Democracy Commission started by Reporters Without Borders. Pillay was born and grew up in Durban, South Africa. She studied at the University of Natal, where she earned a Bachelor of Arts degree in 1963 and a law degree in 1965. After finishing university, she became a lawyer and worked with N.T. Naicker, a well-known criminal defense lawyer, to fight against apartheid. In 1967, she opened her own law firm, becoming the first woman to do so in the Natal province. In 1981, she went to Harvard University through the Harvard-South Africa Scholarship Program and earned a Master of Law degree. She later completed her thesis and received her Doctorate in Law from Harvard Law School in 1988. In 1995, Pillay was chosen and approved to serve on the High Court of South Africa by the Judicial Service Commission, under the guidance of the bar association. Near the end of her time there, Justice Minister Abdullah Omar and President Nelson Mandela put her name forward to the U.N. Security Council to become a judge on the United Nations International Criminal Tribunal for Rwanda (ICTR). She served on the ICTR from 1999 to 2003 and became its President Judge. In 2003, she was elected as a judge of the International Criminal Court (ICC) by the Assembly of States Parties to the Rome Statue, and worked in the Appeals Chamber until 2008. That same year, UN Secretary-General Ban Ki Moon appointed her as the UN High Commissioner for Human Rights, and the UN General Assembly confirmed her appointment. She is currently working as a temporary judge at the International Court of Justice for the case between The Gambia v Myanmar. She is also the Chair of the UN Commission investigating the situation in the Occupied Palestinian Territory. In addition, she is the President of the International Commission Against the Death Penalty in Madrid, leads the Advisory Council of the International Nuremberg Principles Academy, and chairs an inquiry looking into detention practices in North Korea. == Background == === Early childhood === Navanethem Pillay was born in 1941 in a poor area of Durban, Union of South Africa, to Narrainsamy and Santhama Nadoo. Her family was of Indian Tamil background, and her grandparents came from India in the 1890s to work on sugar plantations. Her parents had an arranged marriage when they were teenagers and had eight children. Pillay was the fifth child. Her father worked as a bus driver and also fished to earn extra money, while her mother stayed at home to care for the family. They raised their children with strong Hindu values and believed in equal treatment for both boys and girls. While many girls in her area were married off young, Pillay and her sisters were sent to school like their brothers. At that time, it was hard to find a place in school because there were more children than available spots. Her mother worked hard to get all her children into school, sometimes using older siblings’ birth certificates to enroll the younger ones. She even made notebooks for the younger kids using leftover pages from the older children’s schoolbooks. === Elementary and high school === At school, Pillay found things very different from her life at home. She had to learn a new religion and speak a different language. Even though some teachers may have had personal views, they were not allowed to talk about politics, like apartheid, because they were afraid of getting in trouble with the school authorities. Pillay first dealt with the law when she was just five years old. She had to speak in court after someone stole 5 pounds from her. Her mother had given her the money to give to her father as it was his monthly salary. Although the thief was found guilty, the court didn’t give the money back to her father. ==References== Category:Living people Category:1941 births Category:People from Durban",
 "title": "Navi Pillay"
}