{
 "id": "1176543",
 "text": "Henry V the Blondell (1216 – 24 December 1281), called the Great, was the Count of Arlon from 1226 to his death, Lord of Ligny from 1240 to his death, Count of Luxembourg and Laroche from 1247 to his death, and the Marquis of Namur between 1256 and 1264 as Henry III. He was the son and successor of Waleran III, Duke of Limburg and Ermesinde, Countess of Luxembourg. In 1226, following the death of his father Waleran III, Henry inherited the county of Arlon. In 1240 Henry married Margaret, daughter of Henry II of Bar and Philippa of Dreux. Henry's marriage to Margaret brought him Ligny-en-Barrois as her dowry, though, by a clause in the marriage contract, it remained under the feudal suzerainty of the County of Bar. In contempt of this, Henry paid homage in 1256 to King Theobald II of Navarre in the latter's capacity as Count of Champagne. Henry's brother-in-law Count Theobald II of Bar took advantage of the conflict then raging between Duke Frederick III of Lorraine and the bishops of Metz. Henry V was a partisan of the duke and so Theobald took the side of the bishop. Henry was captured in battle at Prény on 14 September 1266. On 8 September 1268, King Louis IX of France arbitrated between the two counts and Henry was freed and repossessed of Ligny, but under the suzerainty of the Barrois. == Issue== From Margaret he had the following issue: *Henry VI (died 1288), Count of Luxembourg *Waleran I (died 1288), Count of Ligny & Roussy. He is the forefather and founder of what became the French branch of the House of Luxembourg, the so-called house of Luxembourg- Ligny. *Isabelle (1247–1298), married Guy of Dampierre *Philippa (1252–1311), married John II, Count of Holland *Marguerite (lady of Macheren), living 1302 *Felicitas *Jeanne (died 1310), Abbess at the Abbey of Clairefontaine He also had at least two illegitimate sons including: *Henry, bastard of Luxembourg (died 1288), married Isabelle of Houffalize, heiress of Houffalize *Baldwin All of his sons perished in the Battle of Worringen in 1288. ==References== Category:13th-century deaths Category:Monarchs in Europe Category:History of Luxembourg Category:13th century in Europe Category:Luxembourgian monarchs",
 "title": "Henry V, Count of Luxembourg"
}