{
 "id": "1176413",
 "text": "Europa Clipper (used to be called the Europa Multiple Flyby Mission) is a space probe made by NASA that will explore Europa. It is powered by solar panels, like NASA's Juno and European Space Agency's JUICE. The spacecraft launched on October 14, 2024. It did a flyby to Mars on March 1, 2025 using a Martian gravity assist. The spacecraft will reach Jupiter's moon Europa in April 2030 after two gravity assists and six years of travel. Due to the radiation from the magnetosphere of Jupiter, the spacecraft would be into an elliptical orbit and make a lot of flybys of the moon Europa. == Main goals == The main goals of the Europa Clipper are to explore Europa, find life in the moon and select a perfect landing site for the Europa Lander. This exploration is about studying the three main requirements for life: water, energy, and chemistry. == Instruments onboard Europa Clipper == E-THEMIS, an infared camera system MISE, another camera, \"near infared\" to find the building blocks of life EIS, Europa Imaging System- An optical camera system Europa-UVS- An ultraviolet spectrograph for the Europa Clipper REASON, Radar for Europa Assesment and Sounding: Ocean to Near-Surface ECM, a magnetometer for the Europa Clipper PIMS- Plasma Instrument for Magnetic Sounding MASPEX- Mass Spectrometer for Planetary Exploration SUDA- Surface Dust Analyzer Gravity & Radio Science == Journey == Europa Clipper will spend six years crusing to Jupiter, during which it will complete fly-bys of Mars and Earth. It will reach Jupiter in April 2030. The spacecraft will spend many months orbiting Jupiter, completing fly-bys of Europa to find life. == Details == Details about the Europa Clipper Launch Launch Complex 39-A Lifetime (in Jupiter's orbit) 4 years Rocket Falcon Heavy Launch date October 14, 2024 Launch time 12:06 p.m EDT == Related pages == * Jupiter Icy Moons Explorer, a probe sent by the European Space Agency ==Refrences== Category:2020s in spaceflight",
 "title": "Europa Clipper"
}