{
 "id": "1176155",
 "text": "Nicholas Wayne Finley (born July 10, 2005) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH) under the ring name Nick Wayne. He is a member of The Patriarchy stable. Wayne has also made appearances in Game Changer Wrestling (GCW) and DEFY Wrestling. In AEW, Wayne has been a one-time AEW World Trios Champion. In DEFY, he was a DEFY World Champion. In GCW, he was a one-time GCW Tag Team Champion. ==Career== ===All Elite Wrestling / Ring of Honor === At DEFY's 5th Anniversary Show, Wayne challenged Christopher Daniels for the DEFY World Championship but was unsuccessful. After the match, his friend Darby Allin came out to the ring and offered Wayne a contract to become a member of the All Elite Wrestling (AEW) roster. On the July 12, 2023 episode of Dynamite, Wayne made his AEW debut in a loss to Swerve Strickland. It was two days after Wayne had turned 18. On the July 21 episode of Rampage, Wayne took part in a Royal Rampage match to determine the number one contender for the AEW TNT Championship but the match was won by Darby Allin. On the September 21 episode of ROH on HonorClub, Wayne challenged Katsuyori Shibata for the ROH Pure Championship but lost. At WrestleDream, Wayne appeared during the two out of three falls match between Darby Allin and Christian Cage for the AEW TNT Championship. Wayne turned heel after hitting his friend Allin with the championship belt and helping Cage win the match. Wayne, Cage and other member Luchasaurus named their stable The Patriarchy and Wayne was known by the nickname \"The Prodigy\" Nick Wayne. At Holiday Bash, Cage announced that Wayne's real-life mother, Shayna, was the newest member of The Patriarchy and was named \"The Matriarch\" Mother Wayne. On the February 28, 2024 episode of Dynamite, Wayne challenged Orange Cassidy for the AEW International Championship but was unsuccessful. On the July 20 episode of Collision, The Patriarchy defeated the Bang Bang Gang (Austin Gunn, Colten Gunn and Juice Robinson) to win the vacant AEW World Trios Championships. This was Wayne's first championship in AEW and he also became the youngest wrestler to win a championship in the company. At All In London, The Patriarchy lost the championships in a four-way London Ladder match to the Blackpool Combat Club (Claudio Castagnoli and Wheeler Yuta). == Personal life == Finley is a third- generation professional wrestler. His father Buddy Wayne was an enhancement talent that made appearances for World Championship Wrestling (WCW) and World Wrestling Entertainment (WWE). His father died on June 17, 2017. His grandfather Moondog Ed Moretti made appearances in promotions around the Pacific Northwest. == References == ==Other websites== * Category:2005 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Sportspeople from Seattle",
 "title": "Nick Wayne"
}