{
 "id": "1176553",
 "text": "The Chenghua Emperor (9 December 1447 – 9 September 1487), born Zhu Jianshen and later renamed Zhu Jianru in 1457, was the ninth emperor of the Ming dynasty, reigning from 1464 to 1487. He succeeded his father, Emperor Yingzong. Born in 1447, Zhu Jianshen was the son of Emperor Yingzong. At just two years old, his father was captured by Mongols during the Tumu Crisis, leading to Yingzong’s deposition. His younger brother became the Jingtai Emperor, and Yingzong was forced into captivity and later house arrest. He was named crown prince again in 1457 after the Jingtai Emperor was overthrown. Zhu Jianshen became emperor in 1464 at the age of 16, following his father's return to the throne. Early in his reign, the Chenghua Emperor enacted tax cuts and worked to strengthen state power. However, over time, his rule was increasingly influenced by corrupt eunuchs, such as Wang Zhi and Liang Fang. These officials gained considerable power, leading to widespread corruption. The emperor's preference for favorites over qualified officials and his focus on personal pleasure weakened the state, while peasant uprisings were violently suppressed. One of the emperor's most notable relationships was with Wan Zhen'er, a palace lady who gained significant influence after bearing a child in 1464, though the child died young. Wan used her position to control the emperor’s harem, even going so far as to force abortions and reportedly poison women and children who might challenge her position. The emperor remained unaware of his actual heir, Zhu Youcheng, who was hidden until 1475. The Chenghua Emperor also focused on military reforms and achieved notable victories against the Mongols in the 1470s. These successes marked the first major victories over the Mongols since 1449. Under his reign, the Ming dynasty strengthened defenses along the Great Wall of China, particularly in Shaanxi and Shanxi. An alliance with Joseon Korea was also forged, and the Ming engaged in wars against the Jurchen tribes of Manchuria. The Chenghua Emperor died in 1487 after 23 years of rule. His son, Zhu Youcheng, succeeded him as the Hongzhi Emperor. ==References==",
 "title": "Chenghua Emperor"
}