{
 "id": "1176282",
 "text": "B-2 Unit is the second solo electronic music album by Japanese musician Ryuichi Sakamoto, released in 1980. The lead single \"Riot in Lagos\" was a highly influential cult hit, significant to the development of electro, hip hop and techno music, and considered one of the most important tracks in the history of electronic dance music. It is also one of the first albums to feature the influential Roland TR-808 drum machine, which \"Riot in Lagos\" is credited for introducing to clubs. ==Production== The then brand new Roland TR-808, prior to the drum machine's official release in 1980, was rented out to Sakamoto's band Yellow Magic Orchestra (YMO). Sakamoto's solo album B-2 Unit was one of the first albums to use the 808, while its lead single \"Riot in Lagos\" was one of the first tracks featuring the 808. Sakamoto drew inspiration from Afrobeat music, notably Nigerian musicians such as Fela Kuti and Tony Allen, reinterpreting the genre's rhythmic structures in the context of electronic music. During production, Sakamoto was travelling between Japan, England and Germany. After working at Kraftwerk's studio in Germany, Sakamoto then travelled to London where he recorded the lead single \"Riot in Lagos\" at dub reggae producer Dennis Bovell's new studio before it had been fully built. Bovell, who was a fan of Sakamoto and YMO, recalled that Sakamoto brought over various new electronic musical instruments, including a Prophet-10 synthesizer before it was officially released. Bovell also rented a 3M 24-track tape recorder and Dolby equipment from producer George Martin, who Bovell's friend knew. Sakamoto played the drum track, which he had previously written down on musical notation sheets, while telling Bovell when to start and stop recording. After recording, he then asked Bovell to \"cut it up\" and dub the track using his prior experience with dub music. The song was produced and recorded in several hours. ==Reception and impact== The album, and its lead single \"Riot in Lagos\" in particular, had a significant influence on the development of electro, hip hop and techno music in the 1980s. \"Riot in Lagos\" was a cult hit in nightclubs around the world. The track is considered an early example of electro music (also known as electrofunk), as it anticipated the beats and sounds of electro. The track is also credited with putting the influential Roland TR-808 drum machine \"in the clubs for the first time\" with \"a new body music\" that \"foretold the future\" of music according to Mary Anne Hobbs of BBC Radio 6 Music. The track was listed by The Guardian as one of the 50 key important events in the history of dance music, listing it at number six. Early electro and hip hop producers, such as Afrika Bambaataa and Kurtis Mantronik, were influenced by the album—especially \"Riot in Lagos\"—Bambaataa and Mantronik cited the track as a major influence, especially on the former's seminal \"Planet Rock\" (1982) and the latter's formation of electro hip hop group Mantronix. Sakamoto's use of squelching bounce sounds and mechanical beats was incorporated in a number of early American electro and hip hop tracks, such as \"Message II (Survival)\" by Melle Mel and Duke Bootee (1982), \"Magic's Wand\" (1982) by Whodini and Thomas Dolby, \"Electric Kingdom\" (1983) by Twilight 22, and The Album (1985) by Mantronix. Resident Advisor said the track \"Riot in Lagos\" anticipated the sounds of techno and hip hop music, and that it inspired numerous artists from cities such as Tokyo, New York City and Detroit. Peter Tasker of Nikkei Asia said it was influential on techno, hip hop and house music. \"Riot in Lagos\" was later included in Playgroup's compilation album Kings of Electro (2007), alongside other significant electro compositions, such as Hashim's \"Al-Naafyish\" (1983). Hip hop producers such as Bambaataa and Mantronix, as well as electronic producers such as Aphex Twin and Autechre, drew inspiration from the song and album. \"Riot in Lagos\" also influenced Detroit techno creators, with similarities to early Juan Atkins productions such as Cybotron's \"Clear\" (1983). British acid house and drum and bass DJ Fabio also cited \"Riot in Lagos\" as an early influence on his career, calling it \"the most incredible tune.\" In the United Kingdom, the track was sampled by drum and bass group Foul Play, as well as Denise Motto, The Shamen, M-D-Emm and Nation 12 during the 1980s to 1990s. The track \"Differencia\" has, according to Fact, \"relentless tumbling beats and a stabbing bass synth that foreshadows jungle by nearly a decade\". Some tracks on the album also foreshadow genres such as IDM, broken beat, and industrial techno, and the work of producers such as Actress and Oneohtrix Point Never. According to Pitchfork, \"B-2 Unit still sounds futuristic\" with tracks such as \"E-3A\" looking \"ahead to Mouse on Mars’ idyllic ’90s electronica.\" According to Logan Takahashi writing for Vice, \"E-3A\" is \"offering a hint of the decade to come with its IDM-leaning cut-up complexities\" and the \"main arpeggiating thumb piano also wouldn’t sound too out of place in the club today in both its sound quality and swing.\" ==Legacy== According to Rolling Stone, the album \"proved influential for the artists developing the sound of hip-hop\" in the early 1980s. According to Mojo, the album is often cited as a key text in the history of techno, demonstrating \"future directions of electronic sound that might now be recognised as Chicago footwork, Ze Records’ ‘mutant disco’ and early Warp Records.\" According to Fact and Louder Than War, the album anticipated the sounds of broken beat, industrial techno and intelligent dance music (IDM). According to NME, \"the entire album eschewed traditional song structures for atmosphere and tone, anticipating the rebellious wave of 1990s IDM and electronic music a full decade beforehand.\" According to The Baffler, the album predated Kraftwerk's Computer World (1981), Bambaataa's \"Planet Rock\" (1982) and Aphex Twin when it came to \"spinning yarns that were both descriptive and prescriptive, sketching the musical world that he alone lived in, and in the bargain, shaping the world around him into something bigger, something humming with possibility.\" According to Music Radar in 2023, \"the future-facing record sounded like nothing else at the time, and still sounds fresh and experimental four decades later.\" According to The New Yorker, the \"album sounds so current and fully electronic that you can stump people who simply will not believe that they are hearing something made forty-three years ago.\" Time Out New York listed \"Riot in Lagos\" as one of the best techno songs of all time. According to NPR, \"Riot in Lagos\" along with other Sakamoto and YMO works \"became a guiding light for the burgeoning hip-hop and techno communities.\" According to Resident Advisor, the track was \"a collection of bleeps and bloops that predicted both rap and techno\" and \"straight-up envisioned the shape of rap music to come, its series of strange, mallet-like instruments and huffing drum machines inspiring legions\" of \"artists from Tokyo, New York, Detroit and beyond.\" According to AV Club, the track was \"an early electro song that helped lay the groundwork for modern dance music.\" According to Music Radar, it was \"a visionary synth jam that influenced Afrika Bambataa and Kurtis Mantronik, helping to lay the groundwork for the birth of electro and hip-hop in the United States.\" According to Document Journal, \"Riot in Lagos\" left \"its mark on the spheres of electro and drum and bass.\" The Baffler described the track as \"Afrobeat becomes Afrofuturism becomes skittering android dancehall.\" According to Raphael Helfand and Jordan Darville of The Fader, the track \"prefigured the next 20 years of dance music.\" According to GQ in 2023, \"Riot in Lagos\" along with other Sakamoto works \"shaped the way music sounds today\" in addition to influencing art forms defined by \"blips and bloops\" including video games, computer interfaces and ringtones. According to Alexis Petridis of The Guardian, \"Riot in Lagos\" had a long-lasting impact that \"cast a considerable shadow over\" dance music, \"helped shape the sound of electro and turned the head of hip-hop producers\" while still remaining \"an astonishingly timeless and effervescent piece of electronica: if you didn’t know it and were told it was released last month, rather than 42 years ago, you’d believe it.\" ==Track listing== ==Personnel== *Ryuichi Sakamoto – music, composer, producer, arranger, engineer *Tadashi Kumihara – music *Kenji Omura – music *Andy Partridge – music *Hideki Matsutake – programmer, computer programming *Dennis Bovell – engineer *Mitsuo Koike – engineer *Yasuhiko Terada – engineer ==Charts== Chart (1980) Peak position Japanese Albums (Oricon) 19 ==References== ==Other websites== * Category:1980 albums Category:Ryuichi Sakamoto albums",
 "title": "B-2 Unit"
}