{
 "id": "1176293",
 "text": "Yellow Magic Orchestra (abbreviated to YMO) was a Japanese electronic music band formed in Tokyo in 1978 by Haruomi Hosono (bass, keyboards, vocals), Yukihiro Takahashi (drums, lead vocals, occasional keyboards) and Ryuichi Sakamoto (keyboards, vocals). The group is considered influential and innovative in the field of popular electronic music. They were pioneers in their use of synthesizers, samplers, sequencers, drum machines, computers, and digital recording technology, and effectively anticipated the \"electropop boom\" of the 1980s. They are credited with influencing the development of various electronic genres, including synth-pop, city pop, dance, electro, hip- hop, J-pop and techno. They also explored subversive socio-political themes throughout their career. == History == === 1976–1978: Early years and formation === Sakamoto first worked with Hosono as a member of his live band in 1976, while Yukihiro Takahashi recruited Sakamoto to produce his debut solo recording in 1977 following the split of the Sadistic Mika Band. Hosono invited both to work on his exotica-flavoured album Paraiso, which included electronic songs produced using various electronic equipment. The band was named \"Harry Hosono and the Yellow Magic Band\" as a satire of the idyllic perception of pacific and Hawaiian music America had been obsessed with and in late 1977 they began recording Paraiso, which was released in 1978. The three worked together again for the 1978 album Pacific, which included an early version of the song \"Cosmic Surfin\". Hosono and Sakamoto also worked together alongside Hideki Matsutake in early 1978 for Hosono's experimental \"electro-exotica\" fusion album Cochin Moon, which fused electronic music with Indian music, including an early \"synth raga\" song \"Hum Ghar Sajan\". The same year, Sakamoto released his own solo album, The Thousand Knives of Ryuichi Sakamoto, experimenting with a similar fusion between electronic music and traditional Japanese music in early 1978. Hosono also contributed to one of Sakamoto's songs, \"Thousand Knives\", in the album. While Sakamoto was working on Thousand Knives, Hosono began formulating the idea of an instrumental disco band which could have the potential to reach success in non-Japanese-language territories, and invited Tasuo Hayashi of Tin Pan Alley and Hiroshi Sato of Huckleback as participants, but they declined. Hosono, Sakamoto and Takahashi eventually collaborated again to form the Yellow Magic Orchestra and they began recording their self-titled album at a Shibaura studio in July 1978. === 1978–1983: National and international success === The band's 1978 self-titled album Yellow Magic Orchestra was successful and the studio project grew into a fully fledged touring band and career for its three members. The album featured the use of computer technology (along with synthesizers) which, according to Billboard, allowed the group to create a new sound that was not possible until then. Following the release of the album Yellow Magic Orchestra, a live date at the Roppongi Pit Inn was seen by executives of A&M; Records of the USA who were in the process of setting up a partnership deal with Alfa Records. This led to the YMO being offered an international deal, at which point (early 1979) the three members decided the group would be given priority over their solo careers. The most popular international hit from the album was \"Firecracker\", which would be released as a single the following year and again as \"Computer Game\", which became a success in the United States and Europe. Following an advertising deal with Fuji Cassette, the group sparked a boom in the popularity of electronic pop music, called \"technopop\" in Japan, where they had an effect similar to that of the Beatles and Merseybeat in 1960s Britain. For some time, YMO was the most popular band in Japan. Making abundant use of new synthesizers, samplers, sequencers, drum machines, computers and digital recording technology as it became available, as well as utilizing cyberpunk-ish lyrics sung mostly in English, they extended their popularity and influence beyond Japan. Their second album, Solid State Survivor, released in 1979, was YMO's pinnacle recording in Japan, winning the 1980 Best Album Award in the Japan Record Awards. It featured English lyrics by Chris Mosdell, whose sci-fi themes often depicted a human condition alienated by dystopic futures, much like the emerging cyberpunk movement in fiction at that time. One of the album's major singles, and one of the band's biggest international hits, was \"Behind the Mask\", which YMO had first produced in 1978 for a Seiko quartz wristwatch commercial. X∞Multiplies was followed up with the 1981 album BGM. UnderMain Magazine noted the album's significance in the early history of hip hop, describing its \"groundbreaking\" use of the Roland TR-808 drum machine, the song \"Music Plans\" as where \"the beginnings of that funky, electronic boom-bap vibe of hip-hop beats start to emerge\" and the song \"Rap Phenomena\" as \"an aural Australopithecus of electronic rap music.\" It was followed by their next album later the same year, Technodelic, which is significant for its early use of sampling and loops. They also had similar success abroad, performing to sold-out crowds during tours in the United States and Europe. The single \"Computer Game\" had sold 400,000 copies in the United States and reached No. 17 in the UK Charts. The group also performed \"Firecracker\" and \"Tighten Up\" live on the Soul Train television show. At around the same time, the 1980 song \"Riot in Lagos\" by YMO member Sakamoto from his album B-2 Unit pioneered the beats and sounds of electro music. The band was particularly popular with the emerging hip hop community, which appreciated the group's electronic sounds, and in the Bronx where \"Firecracker\" was a success and sampled in the famous Death Mix (1983) by Afrika Bambaataa. Bambaataa also cited YMO's subsequent albums along with Sakamoto's \"Riot in Lagos\" as influences. === 1984–1993: Breakup and brief reunion === The band had paused their group activities by 1984. After the release of their musical motion picture Propaganda, the three members had returned to their solo careers. Yellow Magic Orchestra released a one-off reunion album, Technodon, and credited it to 'NOT YMO' (YMO crossed out with a calligraphy X) or ~~YMO~~ in 1993. During their brief reunion in the early 1990s, they continued to experiment with new styles of electronic music, playing an instrumental role in the techno and acid house movements of the era. == Musical style and development == === Instruments === The band often utilized a wide variety of state-of-the-art electronic music equipment immediately as they were made available. The group leader Haruomi Hosono had already been using an Ace Tone rhythm machine since early in his career in the early 1970s. Yellow Magic Orchestra and Ryuichi Sakamoto's Thousand Knives were one of the earliest popular music albums to utilize the Roland MC-8 Microcomposer, which was programmed by Hideki Matsutake during recording sessions. \"Behind the Mask\" (1979) made use of synthesizers for the melodies and digital gated reverb for the snare drums. It was one of the first songs to use gated reverb, a technique that later became popular in 1980s pop music. They were also the very first band to utilize the Roland TR-808 Rhythm Composer, one of the first and most influential programmable drum machines, as soon as it was released in 1980. Hosono said the 808 is his favourite machine because \"that sound is close to the Japanese Wadaiko drum, it has a unique presence.\" === Sampling === Their approach to sampling music was a precursor to the contemporary approach of constructing music by cutting fragments of sounds and looping them using computer technology. Their 1978 hit \"Computer Game / Firecracker\", for example, sampled Martin Denny's 1959 exotica melody \"Firecracker\" and arcade game sounds from Space Invaders and Circus. According to The Vinyl District magazine, they also released the first album to feature mostly samples and loops (1981's Technodelic). Technodelic (1981) was produced using the LMD-649, a PCM digital sampler that Toshiba-EMI sound engineer Kenji Murata custom-built for YMO. Tokyosky (February 3, 2011). \"月刊ロッキンf 1982年3月号 LMD-649の記事 1982\" [Article on the LMD-649 from the March 1982 Issue of Monthly Rockin' f]. Tokyosky Webmaster's Blog Soon after Technodelic, the LMD-649 was used by YMO-associated acts such as Chiemi ManabeChiemi Manabe – 不思議・少女 , Discogs and Logic System.Logic System – Orient Express , Discogs == Legacy == === Electronic music === YMO were pioneers of synthpop, a genre which emerged at the start of the 1980s. In 1993, Johnny Black of Hi-Fi News, in a review for the record Hi-Tech/No Crime, described YMO as \"the most adventurous and influential electro-techno-dance technicians the world has produced\" and further argued that \"without them (and Kraftwerk) today's music would still sound like yesterday's music.\" The 1980 release of Sakamoto's \"Riot in Lagos\" was listed by The Guardian in 2011 as one of the 50 key important events in the history of dance music, listing at number six. YMO's success with music technology encouraged many others, with their influence strongly felt in the British electronic scene of the early 1980s in particular. They influenced many early British synthpop acts, including Ultravox, John Foxx, Gary Numan, Duran Duran, Depeche Mode, Camouflage, OMD, The Human League, Visage, and Art of Noise, as well as American rock musicians such as Todd Rundgren. The earliest use of the term \"techno\" in reference to an electronic genre is credited to YMO, who coined the term \"techno-pop\" in the late 1970s. They used the word 'techno' in a number of their works, such as the song \"Technopolis\" (1979), the album Technodelic (1981), and a flexi disc EP, \"The Spirit of Techno\" (1983). \"Technopolis\", a tribute to Tokyo as an electronic mecca that used the term \"techno\" in its title, foreshadowed concepts that Juan Atkins and Rick Davis would later have with Cybotron. When Yellow Magic Orchestra toured the United States in 1980, they described their own music as technopop, and were written up in Rolling Stone magazine. === Hip-hop === YMO had a significant influence on the development of early hip-hop music. The band was popular with the emerging hip hop community, which appreciated the group's new electronic sounds, and in the Bronx where Firecracker was a success and sampled in the famous Death Mix by Afrika Bambaataa. Bambaataa also cited subsequent YMO albums as well as Sakamoto's 1980 solo track \"Riot in Lagos\" as influences. Afrika Bambaataa's influential song \"Planet Rock\" was partly inspired by YMO. The \"terse videogame-funk\" sounds of YMO's \"Computer Game\" would have a strong influence on the emerging electro and hip hop genres. YMO as well as Sakamoto's \"Riot in Lagos\" were cited by Kurtis Mantronik as major influences on his early electro hip hop group Mantronix; he included both \"Computer Game\" and \"Riot in Lagos\" in his compilation album That's My Beat (2002) which consists of the songs that influenced his early career. The song was also later included in Playgroup's compilation album Kings of Electro (2007), alongside later electro classics such as Hashim's \"Al-Nafyish\" (1983). Sakamoto's use of squelching bounce sounds and mechanical beats was incorporated in a number of early American electro and hip hop tracks, such as \"Message II (Survival)\" by Melle Mel and Duke Bootee (1982), \"Magic's Wand\" (1982) by Whodini and Thomas Dolby, \"Electric Kingdom\" (1983) by Twilight 22, and The Album (1985) by Mantronix. Beyond early electro and hip hop acts, \"Computer Game / Firecracker\" was also sampled by a number of other later artists, including 2 Live Crew's \"Mega-Mixx II\" (1987), De La Soul's \"Funky Towel\" (for the 1996 film Joe's Apartment), Jennifer Lopez's \"I'm Real\" (2001), and the original unreleased version of Mariah Carey's \"Loverboy\" (2001). === Japan === The band has also been very influential in its homeland Japan, where they had become the most popular group during the late 1970s and 1980s. In Japan, YMO sold 4,165,000 albums and 1,123,000 singles, for a total of records sold nationwide. The band also had a significant influence on the development of city pop, with YMO influencing the genre to incorporate electronic instruments and with the YMO members themselves working on various city pop records. == Members == === Official members === * Haruomi Hosono – bass, keyboards, vocals (1978–1984; 1992–1993; 2002–2004; 2007–2012) * Yukihiro Takahashi – lead vocals, drums, percussion, occasional keyboards (1978–1984; 1992–1993; 2002–2004; 2007–2012; died 2023) * Ryuichi Sakamoto – keyboards, synthesizers, vocals (1978–1984; 1992–1993; 2002–2004; 2007–2012; died 2023) === Frequent collaborators === * Hideki Matsutake – synthesizers, sound programming, sequencers (1978–1982) == Discography == * Yellow Magic Orchestra (1978) * Solid State Survivor (1979) * ×∞ Multiplies (also known as Zoshoku, 1980) * BGM (1981) * Technodelic (1981) * Naughty Boys (1983) * Service (1983) * Technodon (credited to ~~YMO~~ , 1993) == Notes == == References == == Other websites == *YMO * * * Official Facebook website * Official MySpace website",
 "title": "Yellow Magic Orchestra"
}