{
 "id": "1176112",
 "text": "Ultras Winners 2005 is a fan group supporting Wydad Athletic Club. It was founded on November 13, 2005 by young team lovers. Ultras Winners was ranked among the best ultras in the world in 2015/2023/2022/2019 by the website \" Ultra World \" specializing in ultras news. The members of the Ultra Winners are responsible for revitalizing the grounds, whether inside or outside the city of Casablanca, with banners, flags and especially tifos; which are generally writings, drawings, images or numbers which each time refer to an important stage in the history of the club or which commemorate certain personalities or certain players of the team. An example of this is the banner that covered all sides of the Mohammed V stadium to celebrate the 70 anniversary of the club's founding, or the painting with which the Winners paid tribute to the spirit of the player Youssef Belkhoja, who died on the pitch, wearing a Wydad jersey, in addition to brandishing slogans and artistic paintings. Since its inception, Ultras Winners, like other Moroccan and even international ultras, has produced music albums containing songs and chants that praise the team, encourage the players, and are repeated during matches or meetings. == The story == === The Beginning (2005) === A group of young people from different regions and neighborhoods of the city of Casablanca and from all sectors of society decided to create an Ultras group to support the team. To this end, especially in the early summer of 2005, several meetings were held, where each participant proposed a name for the group, and the name Winners was finally chosen. The first official celebration, which appeared for the first time on the field on November 13, 2005, against the Slaouian club (which ended with a victory for Wydad), announcing the appearance of the Ultras Winners. The Ultras Winners began supporting their team, Wydad, in both internal and external matches, despite the small group at the beginning. In 2006, the competition began between them and the Ultra Green Boys, founded in the same year and in the same city. , and is the support group of Raja Sports Club, Wydad's traditional rival. The year 2006 saw the Ultras Winners capture the Ultras Green Boys banner in the 2006 Arab Champions League final against Egyptian club Enppi . As Raja fans were coming out to celebrate with their team winning the title, the Ultras Green Boys banner was taken and was then photographed by the Ultras Winners upside down, which is considered in the ultras world as a great humiliation, and according to the customs, of the ultras world, ultras whose bash (banner) is upside down are no longer allowed to use it. The core of the Rajawi faction obviously rejected this event on the grounds that the banner had been stolen and had not been taken by force or raised. upside down on the pitch but rather off it. However, this event at the time was one of the main reasons for the creation of the Ultra Eagles faction, the second largest faction supporting the rival, as it was mainly composed of some of the founders and members of the Green Boys who supported the idea of withdrawal and creation of a second group. === Expansion and conquest (2007 - 2008) === The first Winners branch outside the city of Casablanca was created in 2007, it is the Red Front branch. This branch brings together members of Winners stationed in the Rabat-Salé-Kenitra region. In 2009, the Ultras Winners Group managed to prepare a large logo that covered almost the entire side of the Mohammed V stadium during the final of the Arab Champions Clubs Cup against Espérance de Tunisie. === Attempts at division (2011-2012) === During 2011, attempts at divisions appeared between the Winners cells when members of a large neighborhood in Casablanca, fans of the Wydad team, attempted to separate from the Winners group and create a new group bearing the same name but with a change of colors. This attempt or proposal was rejected by the leaders and participants of the Ultras Winners, and clashes broke out between the two, forcing the authorities, during many matches in the 2011 and 2012 seasons, to create barriers in the stands between the Winners supporters and those who wanted to. divide. Later, a public reconciliation took place during a league match against the Meknassi club, and the supporters of separation and division gave up on their idea. === Demonstrations (2013-2014) === During the 2013–14 season, demands for the departure of then- Wydad president Abdel-Ilah Akram increased after the team finished in sixth place, losing the opportunity to participate in the African Champions League and the African Confederation Cup . At that time, the Ultras Winners led a number of protest movements, the most notable of which was raising the Tifo during a local league match against Moghreb of Fez at the Sports Complex, and the second time during the derby against Raja, where the Wydad supporters held up a large banner with the words \" Akram, out \" written in black and white, demanding that their president leave the team. The group intensified its position by deciding to boycott all Wydad matches on the pitch, which precipitated the president's departure during this year, where Wydad would be crowned league champions after a four-year absence. == Finance == The group's funding, like that of the rest of the ultras, depends on self-financing, by opening the door to annual membership to the group, and by selling products intended only for members. The group also relies on secondary sources of funding, such as periodic contributions from cells or others. In the language of Moroccan ultras, he is called \" Contribution \", in addition to the revenue from the group's official channel on the YouTube platform. == The Music == From time to time, the Ultras Winners release a song or set of songs on their official social media accounts to be sung later in the stadium during Wydad matches. One of Ultras Winners' recent songs is <عمري نسيتو معاها> \", This song is a declaration of unconditional love for Wydad, carried by united voices and catchy rhythms. It expresses eternal loyalty, promising to support the team from birth until the end of life. Each note resonates like a cry of passion, a promise engraved in the hearts of the supporters, uniting thousands of voices in a vibrant anthem of pride and devotion . == the swear words said by the winners == During intense matches, the atmosphere in the stands becomes electric. Some fans express their dissatisfaction with emotionally charged words, sometimes targeting the referee, opposing players or even their own players when the performance does not meet their expectations. These words, although sometimes harsh, reflect the unwavering passion they have for their club and their desire to see their team triumph. == Anti-hooliganism laws == After several acts of violence during the matches mainly in Casablanca, any activity related to the ultras was prohibited and a new law was born which was very severe towards the members of the ultras, these acts of violence like vandalism insults and tragedies gave a bad image of the ultras in general, it is there that a form of resistance was born among the ultras who wanted freedom in order to support their teams with loyalty, the Ultras Winners 2005 posted music to defend their rights and freedoms, the UW05 saw several loyal members of the group being incarcerated, these laws prohibiting the activities of the Winners did not prevent them from living however it put a fatal blow to the financing of the group which was deprived of selling derivative products and creating membership campaigns, the UW05 did not disappear and continued to resist repression until the end of the ban, this shows the ferocity and dedication of the UW05 who will always liven up the stadiums == tifos, banners and choreographies == Tifos and choreographies are the first things that the outside world of ultras sees, the UW05 are known for creating extraordinary and unusual tifos, the members of the UW05 show creativity and team spirit to try to create a tifo with a message behind it, most of the time intended for the players to encourage them, however these tifos are very expensive for the group, this is where the purpose of self-financing and the membership fee necessary for the work of the winners comes from, the sale of derivative products also plays an important role because the purpose of this trade is vital for the creation of choreographed tifos etc. without making profits, an example was that of the 2015 derby where the winners showed creativity by creating a banner in the form of a member of the winners using a magnifying glass looking in the opposite direction (south), at the same time the winners brandished drawings of monkeys and animals to represent what the winners see through the magnifying glass, In the same match another banner was presented by the Winners, it represents the 2 lovers from the film Casablanca released in 1942, the man with a red butterfly representing the Winners firmly holding the woman wearing a green skirt representing the supporters of Raja showing the domination of the man (Winners) over the woman (Raja). == Beyond the stadiums == Ultras around the world are known for loyally supporting a football team, the UW05 on the other hand do not limit themselves to supporting the Wydad football team, they also mark their presence during basketball and handball matches, they also demonstrate loyalty and creativity during these meetings, another characteristic of the Winners is their slogan \" Beyond the stadiums \", the UW05 organize blood donation campaigns and community aid, for example after the terrible earthquake which struck Morocco in September 2023, the Winners showed solidarity by organizing humanitarian aid and supplying the regions affected by the disaster. It is not a catastrophe that will push the UW05 to do good because helping others in need is part of their daily life, they also organize distributions of toys and food in children's hospitals, the UW05 are ultras who do not hesitate to unite for the good of everyone, they show solidarity among themselves by supporting incarcerated members, by supporting the families of deceased members and by supporting members with financial and family difficulties.",
 "title": "Ultras Winners"
}