{
 "id": "1176348",
 "text": "Hanna Serwaa Tetteh (born May 31, 1967) is a lawyer, diplomat, and politician from Ghana. Since 2025, she has been the UN Secretary General’s Special Representative for Libya and the Head of the United Nations Support Mission in Libya (UNSMIL). Earlier in her career, Tetteh was Ghana's Minister for Trade and Industry from 2009 to 2013 and Minister for Foreign Affairs from 2013 to 2017. She also served as the Member of Parliament for the Awutu-Senya West constituency. == Early life and education == Tetteh was born in Szeged, Hungary, to a Ghanaian father and a Hungarian mother. She attended Wesley Girls' High School in Cape Coast, Ghana, from 1978 to 1985. From 1986 to 1989, she studied law at the University of Ghana and earned a Bachelor of Law (LL.B) degree. She then went to the Ghana School of Law and became a lawyer in 1992. == Early career == Tetteh completed her National Service as a Legal Officer with theInternational Federation of Women Lawyers (FIDA) from 1992 to 1993. After that, she worked as a private lawyer at Ansa-Asare and Company, a law firm in Accra, Ghana. After two years as a private lawyer, Tetteh became a Legal Officer at the Commission on Human Rights and Administrative Justice. Later that same year, she joined Ghana Agro Food Company (GAFCO) as a Legal Adviser. GAFCO was a food processing company in inary products and was located in the Tema Harbour Area in Tema that produced wheat flour, animal feed, fish meal, and canned tuna. It also sold food and veterinary products. At GAFCO, she held other management roles, including Human Resources and Legal Services Manager, then Deputy General Manager for Finance and Administration. In 2000, she left to enter politics. After serving one term in Parliament, she did not run again immediately and returned to GAFCO as General Manager for Corporate, Administration, and Legal Affairs, where she worked until December 2009. == Political career == === Career in national politics === Hanna Tetteh won the Awutu Senya seat in the December 2000 parliamentary elections and served one term as a Member of Parliament for the National Democratic Congress (NDC), which was in opposition at the time. She did not run again in the next election. In 2005, she became a National Executive Member of the NDC. In 2008, she was made the party’s National Communications Director, taking over from John Dramani Mahama, who had become the NDC’s vice-presidential candidate alongside presidential candidate John Atta Mills. During the 2008 presidential campaign, she helped manage the NDC's communication strategy. This made her more well-known in politics, and she became one of the party’s main spokespersons.[citation needed] === Minister of Trade and Industry, 2009–2013 === After the NDC won the 2008 elections, Tetteh became the Spokesperson for the new government while new appointments were being made. In February 2009, President John Atta Mills chose her to be the Minister of Trade and Industry. After Parliament approved her appointment, she took on the role and served as Minister from February 2009 to January 2013. While serving as Minister of Trade and Industry, she was also part of the government’s economic management team. She was on the board of the Millennium Development Authority, helping oversee the first Millennium Challenge Corporation Compact in Ghana. She also served on the National Development Planning Commission and was the Chairperson of the Ghana Free Zones Board (GFZB). === Back to Parliament, 2013–2017 === When John Mahama became president after the death of President Atta Mills in 2012, he chose Tetteh to be the Communications Director for his 2012 election campaign. She also decided to run for Parliament again and was elected in December 2012 to represent the new Awutu Senya West constituency, after earlier serving as MP for the Awutu Senya Constituency from 2001 to 2005. She won the seat by getting 23,032 votes, which was 55.47%, beating her closest opponent, Oppey Abbey, a former MP for Awutu Senya, who got 18,487 votes (44.53%). However, she lost the seat in the 2016 parliamentary election to George Andah, who received 28,867 votes (52.27%), while she got 25,664 votes (46.87%). === Minister of Foreign Affairs, 2013–2017 === After the elections, President Mahama chose Tetteh to be the Minister for Foreign Affairs, and she officially took the role in January 2013 after Parliament approved her. While in this position, she was also part of the National Security Council and the Armed Forces Council. In March 2014, when President Mahama became the Chairman of the ECOWAS Heads of State and Government, Tetteh also became the Chairperson of the ECOWAS Council of Ministers. After leaving her position in 2017, Tetteh became a Richard von Weizsäcker Fellow at the Robert Bosch Foundation. From 2017 to 2018, she also worked as a Co-Facilitator in the IGAD-led High-Level Forum, helping to restart the peace agreement to resolve the conflict in South Sudan. === Career with the United Nations, 2018–present === In 2018, United Nations Secretary-General António Guterres appointed Tetteh as the Director-General of the United Nations Office at Nairobi, taking over from Sahle-Work Zewde. Soon after, she also replaced Zewde as the UN Special Representative to the African Union and Head of the United Nations Office to the African Union (UNOAU). After Ghassan Salamé resigned as head of the United Nations Support Mission in Libya (UNSMIL) in 2020, Secretary- General Guterres recommended Tetteh to take over the position. However, the role was eventually given to Ján Kubiš.[citation needed] In 2022, Guterres appointed Tetteh as his Special Envoy for the Horn of Africa, swapping roles with Parfait Onanga-Anyanga. In 2025, she took over from Abdoulaye Bathily as the UN Secretary-General’s Special Representative for Libya and Head of the United Nations Support Mission in Libya (UNSMIL). Tetteh is the sister of Gizella Tetteh Agbotui, who is a Member of Parliament for the Awutu Senya West Constituency—the same area Tetteh also represented in the past. == See also == * List of Mills government ministers * Awutu-Senya constituency * List of foreign ministers in 2017 ==References== == Other websites == * Profile on Ghana government website Category:1967 births Category:Living people Category:Pages with unreviewed translations",
 "title": "Hanna Tetteh"
}