{
 "id": "1176560",
 "text": "Asha Noppeney (born 1954, birth name: Lonyangamoe) is a German-Ugandan writer, disabled sports activist and nordic walking athlete. She is active in society, takes part in charity such as by doing charity runs to help people with disabilities and those in need. == Early Life == Noppeney was born in Moroto Town, Uganda. Her birth name is Lonyangamoe. Her father is Mohammed Nguku Lonyangamoe. He was a medicine man from Machakus in Kenya. Her mother, Nakenoi Zainabu. She comes from today’s South Sudan and is from the Topossa tribe, part of the Karamaojong peoples. When she was seven, she lost her right leg in a bicycle accident. == Education == Her education began in Uganda. She attended primary school in Kaabong and Kotido from 1962 to 1968 (7 years). Next, she went to senior secondary school at Bashir High School in Kampala from 1969 to 1972 (4 years). After that, she studied at Kololo High School in Kampala for 2 years, completing her A-levels from 1973 to 1974. In 1977, she traveled to Paris to take a language course at Alliance Française. At the University Sorbonne in Paris, she studied languages in preparation for further studies. However, due to financial difficulties caused by civil wars in Uganda, she could not start a degree in Paris. Later, she learned translating into English and French at the Institut Catholique in Paris. == Career == Asha Noppeney works as a manager at a doctor’s office and as a writer. Since 2005, she has been very active in disabled sports, focusing on athletics. She competed in the 2016 and 2019 New York City Marathon using Nordic walking. She also writes about her life and helps raise money for charity. == Personal Life == She holds citizenship in both Germany and Uganda. She speaks German, French, and English. She is married and resides in Eckersdorf, Germany. == Awards == In recognition of her work, Asha Noppeney received the Bavarian Order of Merit in 2021. On 4 December 2024, she was awarded the Cross of the Order of Merit of the Federal Republic of Germany. The German Federal President Frank-Walter Steinmeier recognized Noppeney for her volunteer work. She is praised for her efforts in helping people with disabilities and supporting children in need. ==Bibliography== * == References == Category:1954 births Category:Living people Category:German sportspeople with disabilities Category:Ugandan sportspeople Category:Sportspeople from Bavaria Category:Disability activists Category:Order of Merit of the Federal Republic of Germany Category:Ugandan activists",
 "title": "Asha Noppeney"
}