{
 "id": "1176403",
 "text": "Tucson Mall is known to be the biggest and most recognizable mall in Tucson. It opened in 1982, and has grown a lot since then for over 40 years. Brookfiled Properties were the original owners and management. There are two floor levels and about 163 stores in the mall, including restaurants nearby. The anchor stores include Dillard's, Forever 21, JCPenney, Macy's, and Old Navy. There is also a children's play place which is always full of families. There are always improvements happening, and openings of new stores and restaurants. In 2001, General Growth Properties bought Tucson Mall for 180 Million Dollars. The mall is located on the north side of Tucson, bounded by Oracle Road (Arizona State Route 77), Wetmore Road, Stone Avenue, and the Rillito River. Behind the Mall is a Sam's Club and other stores which are at W Stone Loop and E River Rd. == Anchor Stores == * Dillard's (197,958 square feet (18,390.9 m2) * Forever 21 (86,596 square feet (8,045.0 m2), formerly Mervyn's) * JC Penny(136,864 square feet (12,715.1 m2)) * Macy's(139,078 square feet (12,920.8 m2), formerly occupied in a 135,000 square feet (12,500 m2) originally The Broadway or Broadway Southwest the current location originally opened as Foley's in 1991; chain's Arizona locations rebranded as Robinsons-May February 2, 1997 changed to Macy's in 2006) * Old Navy(19,996 square feet (1,857.7 m2)) == Former anchors == * Diamond's(Sold to Dillard's in 1984) * Foley's (became Robinsons-May on February 2, 1997, closed sometime shortly after the chain was bought out by Macy's, reopened as Macy's in 2006) * The Broadway (became Macy's in 1996, closed in 2006, demolished in 2007) * Meryvn's(closed in 2008, became Forever 21 in 2009) * Sears(162,816 square feet (15,126.1 m2), closed in April 2020) == History == Helen Wetmore, whose husband's family had homesteaded the land in the late 1800s, came up with the idea for the Tucson Mall. During a trip to Chicago in the 1930s, she spotted a shopping center on the Skokie Highway and thought to herself, \"That's what I am going to have on my land.\" She kept the parcel of land together until 1978, and at that point plans for the mall were initiated with Forest City Enterprises. The Tucson Mall opened in 1982, with about 100 stores and five department stores, including Broadway, J. C. Penney, Mervyn’s, Diamond's and Sears. Hellmuth, Obata & Kassabuam of Dallas, Texas were the architects for the mall. Each of the five original department stores hired their own designers. Forest City Dillon Inc. was the one with the contract. Diamond's was converted to Dillard's in 1984. Beginning in 1990, the mall began an extensive expansion project. First, the Dillard's anchor was expanded and a parking garage was added next to Dillard's. On the east side of the mall, an entirely new wing was built; the original mall footprint had stopped just to the east of the center court area. The area to the southeast of the Mervyn's had been a parking lot. A new wing opened in 1991 and added over 400,000 sq ft to the mall, over 70 new stores, and a sixth anchor, Houston-based Foley's. In 1993, the food court was renewed with the addition of a carousel and Arizona Avenue. Sun Tran's Tohono Tadai Transit Center, located adjacent to the Mall, was opened in 1994. In 1996, The Broadway was changed to a Macy's after Federated Department Stores acquired Broadway. In 1997, all of Foley's locations in Arizona were rebranded as the Los Angeles–based Robinsons-May. In 2001, General Growth Properties purchased Tucson Mall. In 2003, the aging mall underwent a $15 million renewal, which was the first major renewal since it opened in 1982. The mall was given all new polished tile floors, glass railings on the upper level, new escalators and elevators where stairs had been, a new children’s play area, new and refurbished restrooms, reworked food court and Arizona Avenue, changes to fountains and a new paint scheme. In 2006, the Robinsons-May store was changed to a Macy's after Macy's acquired them in a corporate purchase. The existing Macy's on the south side of the mall was vacated. In 2007, the former Macy's store was destroyed in preparation for an extensive remodel and addition on the south side of the mall. The changes include the addition of a grand entrance hall in the location of the old anchor, extension of stores on both the east and west side of the new entrance, addition of multiple water features, complete update of facade from current Macy's to Mall Security Offices, and the addition of REI and The Cheesecake Factory on the south side of the Tucson Mall. A parking structure was also added next to the current Macy's. In 2008, GameStop, formerly an Electronics Boutique, in the bottom floor was relocated to the center as a Software ETC on the top floor, also owned by Gamestop, hyped a bigger, better Gamestop, this larger center one being the result. Mervyn's closed their store with the chain's decline. In 2009, Forever 21 opened in the approximately 80,000-square-foot (7,400 m2) space formerly anchored by Mervyn's as part of its strategy to open larger stores with a more diverse merchandise selection. == Recent Buzz == On February 6, 2020, it was announced that Sears would be closing as part of a plan to close 31 stores nationwide. The store closed in April 2020. Around Early 2024, Forever 21 Moved their Stores location leaving the location vacant for a bit. == References and Citation == http://www.propertyshark.com/mason/Property/70402857/4550-N-Oracle-Rd-Tucson- AZ-85705/ https://www.pinterest.com/pin/364017582377940027/ http://tucsoncitizen.com/morgue2/1996/12/09/225137-street-talk/ http://tucsoncitizen.com/morgue/2006/05/24/13537-federated-to-sell-macy-s-in- tucson-mall/ http://tucsoncitizen.com/morgue/2009/03/16/112220-forever-21-takes-over- tucson-mall-mervyn-s-space/ http://tucsoncitizen.com/morgue/2007/10/30/67220-demolition-begins-at-tucson- mall-s-macy-s/ http://tucsoncitizen.com/morgue2/2002/04/12/14660-tucson-mall- getting-new-look/' https://www.nytimes.com/2001/08/17/business/mall-in-tucson- is-sold.html == External Links == https://www.tucsonmall.com/en.html Aerial View Historical Aerial View Category:Malls Category:Buildings and structures in Arizona Category:Tucson, Arizona Category:Malls In Arizona",
 "title": "Tucson Mall"
}