{
 "id": "1176820",
 "text": "Cody Vance (born January 15, 1992) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH) under the ring name Preston Vance. He was also known for his time in The Dark Order stable where he performed under the ring name Preston \"10\" Vance. ==Career== ===All Elite Wrestling === On the January 7, 2020 episode of Dark, Vance made his AEW debut, teaming with Shawn Spears in a loss to Austin Gunn and Billy Gunn in a dark match. Afterwards, Vance joined The Dark Order stable under Mr. Brodie Lee and changed his ring name to Preston \"10\" Vance. On the May 5 episode of Dark, Vance earned his first victory after he defeated Ryan Pyles. On May 20, 2020, Vance made his Dynamite debut in a loss to Jon Moxley. On the April 28, 2021 episode of Dynamite, Vance challenged Darby Allin for his AEW TNT Championship but was unsuccessful. At Double or Nothing, Vance participated in the Casino Battle Royale for a shot at the AEW World Championship in the future but the match was won by Jungle Boy. On the October 27 episode of Dynamite, Vance entered the tournament to crown the new AEW World Champion. He was eliminated in the first round by Jon Moxley. On the August 26, 2022 episode of Rampage, Vance teamed with Dark Order stablemates Alex Reynolds and John Silver to defeat House Of Black (Brody King, Buddy Matthews and Malakai Black) in the first round of the AEW World Trios Championships tournament. On the October 7 episode of Rampage, Dark Order challenged Death Triangle (PAC, Penta El Zero Miedo and Rey Fenix) for their AEW World Trios Championships but were unsuccessful. On the October 21 episode of Rampage, Vance challenged Orange Cassidy for his AEW All-Atlantic Championship in a three-way match that also featured Rush but Cassidy retained. On the November 25 episode of Rampage, Vance ran-in to save Alex Silver from being beat down by La Facción Ingobernable. Vance instead attacked Silver with LFI and turned heel, throwing his mask at Brodie Lee Jr. and attacking and ripping he mask of Evil Uno while joining LFI. At Battle Of The Belts IX, Vance challenged Orange Cassidy for the AEW International Championship but was unsuccessful. On the September 26 episode of ROH on HonorClub, Vance challenged Lee Moriarty for the ROH Pure Championship but was also unsuccessful. == Personal life == Vance has battled Crohn's disease since he was young. == References == ==Other websites== * Category:1992 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Sportspeople from Michigan Category:People with Crohn's disease",
 "title": "Preston Vance"
}