{
 "id": "1177297",
 "text": "Zbigniew Zieliński (born 14 January 1965) is a Polish bishop of the Catholic Church. He is the new archbishop-elect of Poznań. Earlier, he was the bishop of the Diocese of Koszalin-Kołobrzeg (2023-2025). He was also the auxiliary bishop (helper bishop) of the Archdiocese of Gdańsk (2015-2022). ==Early life== Zbigniew Zieliński was born on 14 January 1965 in Gdańsk. His parents are Rupert and Teresa (Karczewska) Zieliński. He finished high school in 1985. He went to the seminary in Gdańsk. He became a priest on 18 May 1991. He was made a priest by Archbishop Tadeusz Gocłowski. == Career == In 1995, he went to the Academy of Catholic Theology in Warsaw. He earned a doctorate in sociology in 2004. From 1991 to 1999, he worked at the Parish of B.V.M. Addolorata in Gdańsk. Then, from 1999 to 2000, he worked at the Cathedral of the Most Holy Trinity in Oliwa, Gdańsk. From 2000 to 2008, he was the head of the Pastoral Care Department of the archdiocese. From 2007 to 2014, he led the Cathedral in Oliwa. In 2014–2015, he was the priest at the Cathedral of the Assumption of the Blessed Virgin Mary in Gdańsk. He also worked as a chaplain for men's groups. In 2005, he became a canon of the main cathedral. === Bishop === On 26 September 2015, he was named titular bishop of Medeli and auxiliary bishop of the Archdiocese of Gdańsk. He was ordinated a bishop on 24 October 2015 by Archbishop Sławoj Leszek Głódź. On 10 March 2022, Pope Francis made him coadjutor bishop of the Diocese of Koszalin-Kołobrzeg. He became the bishop of that diocese on 2 February 2023 when Bishop Edward Dajczak retired. He was the temporary leader (apostolic administrator) of the Archdiocese of Szczecin-Kamień from February to October 2024. On 19 March 2025, Pope Francis named him archbishop of Poznań. His new office will start on 1 May 2025. == Notes == == References == ==Other websites== * Archdiocese of Poznań Category:1948 births Category:Living people Category:People from Gdańsk Category:Polish Roman Catholic bishops",
 "title": "Zbigniew Zieliński"
}