{
 "id": "1177718",
 "text": "From March 11 to 15, year 2025, a group of United States national security leaders made a group chat on the Signal app about the military operations in Yemen. The members were Vice President JD Vance, White House staff, three Cabinet secretaries, and the leaders of two Intelligence Community agencies. That happened hours before the attacks. Signal-gate [and Signalgate] is another name of the controversy. Mike Waltz accidentally added Jeffrey Goldberg, the editor-in-chief for The Atlantic. Pete Hegseth, the Secretary of Defense used the group chat to share information about the airstrikes in Yemen. The kind of information that was shared (in group chat), is called concept of operation. However, some media say that war plans were leaked. ==Members== There was 19 identified officials in the group chat and a CIA officer that The Atlantic withheld at the CIA's request. # Alex Wong, Principal Deputy National Security Advisor. # Brian McCormack, Chief of Staff for the National Security Council. # Dan Katz, Chief of Staff for the Secretary of the Treasury. # Jacob, unknown # JD Vance, Vice President. # Joe Kent, Acting Chief of Staff for the Director of National Intelligence, and nominee for National Counterterrorism Center Director. # John Ratcliffe, Director of the Central Intelligence Agency. # Marco Rubio, Secretary of State. # Mike Needham, Special Adviser and Consultant on Foreign Policy Issues for the Department of State. # Mike Waltz, National Security Advisor. # Pete Hegseth, Secretary of Defense. # Scott Bessent, Secretary of the Treasury. # Stephen Miller, White House Deputy Chief of Staff for Policy. # Steve Witkoff, United States Special Envoy to the Middle East. # Susie Wiles, White House Chief of Staff. # Tulsi Gabbard, Director of National Intelligence. # Walker Barrett, professional staff member for the House Armed Services Committee Republicans. * Jeffrey Goldberg, editor-in-chief for The Atlantic. (The numbering above, has no (particular) significance.) ==People changing jobs (or positions) after the leaks== In mid-April, Dan Caldwell (advisor) was put on administrative leave and was terminated. He was one of the people, that was on group chat. Media said (in May), that Mike Waltz no longer had his job.https://www.vg.no/nyheter/i/8qAee2/cbs-trumps-sikkerhetsraadgiver-ferdig. Retrieved 2025-05-01 Earlier, Waltz said that he takes responsibility for the leak. ==Response== On April 3, the Pentagon started an investigation after a request from the United States Senate Committee on Armed Services. The Guardian says the White House information technology office had a \"forensic review\" on the leaks and discovered that Waltz's phone saved Goldberg's number as Brian Hughes. ==References== Category:United States",
 "title": "United States government group chat leaks"
}