{
 "id": "117746",
 "text": "Medical abbreviations are a shorthand way of writing and talking by medical professionals (people who work to help sick people) to hurry explanation of diseases (sickness), patients, or medicines (drugs). This shorthand can include shortening (making less lengthy) of longer disease names, by cutting the word down to its base (the Latin or Greek part that makes it). Medical professionals also create (make) words that mean something. An example of this is \"stat\", used to indicate (show) that something needs to be hurried (done faster). It is from the Latin \"base word\" statim, meaning quick. A very commonly (often) used shorthand is shortening things on order forms for patients. An example is, \"pre-op\" meaning |pre-operation| (patient who is being prepared for surgery). These can be very complicated and extensive (meaning there is a lot of them). Despite the fact that this shorthand might make it difficult for new Interns (new doctors) or recently trained nurses to get used to this unofficial language, it has been shown to improve (make better) the speed of treatment in hospitals. Medical authorities in the United Kingdom and elsewhere have questioned the use of medical shorthand; believing that it can lead to mistakes being made due to less clear communication and have advised doctors to avoid its use. ==Medications== ===How to take medications=== Medications can be given in different ways (routes). Abbreviations for the most common routes are: Abbreviation: Means the medication is taken: PO Per os - By mouth (swallowed) IM Intramuscularly - injected into a muscle INH Inhaled (breathed in) IV Intravenously (injected into a vein) PR \"Per rectum\" (placed into the rectum) SC, SQ, Sub-q \"Subcutaneous\" (injected under the skin) ===When to take medications=== Doctors use many different abbreviations to say when to take a medication. It is helpful to remember that doctors use the letter \"q\" to stand for \"every.\" For example, \"qAM\" stands for \"every AM\" (morning). Here are some of the most common: Abbreviation: This Means the Medicine Should Be Taken: qAM Every morning qPM Every evening qHS At bedtime prn As needed (the person should take the medication only when they need it) qd Once a day bid Twice a day tid Three times a day qid Four times a day qod Every other day qwk Every week qmo Every month ===Drugs & medications=== Some drugs and medications have common abbreviations. Here are some examples: Abbreviation: Stands For: Notes APAP Acetaminophen Common brand name: Tylenol ASA Aspirin \"ASA\" is short for Acetylsalicylic acid (aspirin's original name) ETOH Alcohol Stands for ethanol (drinking alcohol) MVI Multivitamin A set of vitamins in one pill NSAID Non- steroidal anti-inflammatory drug Pronounced \"en-sed\"; examples are ibuprofen and aspirin NTG Nitroglycerin Used for heart attacks and other problems; also called \"nitro\" OBC Oral birth control Birth control taken as a pill (also called OC: oral contraceptive) OTC An over-the-counter drug Can be bought without a doctor's prescription PCP Phencyclidine An illegal drug that causes hallucinations SSRI Selective serotonin reuptake inhibitor A type of antidepressant; examples are Prozac and Paxil ==About the body== Common abbreviations that have to do with the human body include: Abbreviation: Stands For: Meaning BP Blood pressure A measure of how hard the heart is working HR Heart rate How many times the heart beats in one minute O2 Oxygen Pronounced \"oh-too\" O2 sats Oxygen saturation A measure of how much oxygen a person is getting RBC Red blood cells The cells in the blood that carry oxygen RR Respiratory rate How many times a person breathes in one minute VS Vital signs A patient's blood pressure, heart rate, respiratory rate, and temperature WBC White blood cells The cells in the blood that fight infection WNL Within Normal Limits Normal for the patient's age and gender (Example: \"VS WNL\" means \"vital signs are normal for this patient\") ==Medical specialties== There are many different kinds of medical specialties. These are kinds of doctors that treat people with certain kinds of problems. Abbreviations for medical specialties include: Abbreviation: Stands For: Meaning ENT Ears, Nose, and Throat Treats problems with the ears, nose, and throat ER Emergency room Treats medical emergencies GI Gastrointestinal Treats problems with the gastrointestinal tract GU Genitourinary Treats problems with the genitals or the urinary system GYN Gynecology Treats and prevents problems with a woman's reproductive system Hem/Onc Hematology/Oncology Treats blood disorders and cancer (pronounced \"HEEM-onk\") ICU Intensive Care Unit A special hospital unit for very sick people Neuro Neurology Involves the nervous system (brain, spinal cord, and nerves) (pronounced \"NURR-oh\") OB Obstetrics The medical specialty that treats women while they are pregnant and giving birth OR Operating room Part of the hospital where surgery is done Ortho Orthopedics Treats problems with the bones, like broken bones Pedi Pediatrics Pediatric doctors (pediatricians) treat children (pronounced \"PEE-dee\") Path Pathology Helps diagnose problems based on patient specimens ==Health problems== Many health problems have common abbreviations. For example: Abbreviation: Stands For: A Problem With: Meaning/Notes A-fib Atrial fibrillation Heart A type of abnormal heartbeat where the heart beats quickly and irregularly CA Cancer A group of diseases caused by abnormal cells growing out of control CAD Coronary artery disease Heart The arteries that bring blood to the heart get blocked off and cannot bring enough blood to the heart CHF Congestive heart failure Heart The heart cannot pump enough blood to the body COPD Chronic obstructive pulmonary disease Lungs A group of chronic diseases that make it hard to breathe CVA Cerebrovascular accident Brain Stroke DM Diabetes mellitus Metabolism See also diabetes mellitus type 1 (DM1) and diabetes mellitus type 2 (DM2) DJD Degenerative Joint Disease Joints Arthritis DVT Deep vein thrombosis Blood clotting A blood clot, usually in a big vein in the leg HTN Hypertension Circulatory system High blood pressure IDDM Insulin-Dependent Diabetes Metabolism Diabetes that needs to be treated with insulin (usually type 1 diabetes) Mets Metastasis Cancer The original cancer has spread to another place in the body MI Myocardial infarction Heart Heart attack (also called AMI, for \"acute myocardial infarction\") NIDDM Non-Insulin Dependent Diabetes Metabolism Diabetes that does not need to be treated with insulin (usually type 2 diabetes) OD Overdose Taking too much medication or drugs, either accidentally or on purpose SOB Shortness of Breath Breathing Having trouble breathing TIA Transient ischemic attack Brain A small stroke that does not leave any permanent brain damage V-fib Ventricular fibrillation Heart The heart quivers and twitches, and cannot pump blood to the body V-tach Ventricular tachycardia Heart The heart beats too fast to pump blood to the body; pronounced \"V-tack\" ===Infections=== Common abbreviations for infections include: Abbreviation: Stands For: Meaning/Notes C. diff Clostridium difficile infection Bacteria attack the intestines; many antibiotics will not kill C. diff (pronounced \"SEE-diff\") HCV Hepatitis C virus A chronic infection of the liver HIV Human immunodeficiency virus The virus that causes AIDS HPV Human papillomavirus A virus that can cause cancer MRSA Methicillin-resistant Staphylococcus aureus A bacterial infection that many antibiotics will not kill (pronounced \"MURR-suh\") PID Pelvic inflammatory disease An infection of a woman's reproductive system STI Sexually transmitted infection Used to be called \"STD\" (sexually transmitted disease) TB Tuberculosis An infection of the lungs URI Upper respiratory infection An infection of the upper respiratory tract; examples are the common cold and sinus infections UTI Urinary tract infection An infection of the bladder or kidneys ===Mental health problems=== Common abbreviations for mental health problems include: Abbreviation: Stands For: Meaning/Notes ADHD Attention-deficit hyperactivity disorder Used to be called ADD (Attention-deficit disorder) ASD Autism spectrum disorder A group of disorders, including autism and Asperger syndrome GAD Generalized anxiety disorder Causes a person to feel very anxious and worried, most of the time OCD Obsessive-compulsive disorder An anxiety disorder that causes unwanted thoughts and actions ODD Oppositional defiant disorder A pattern of angry behavior, arguing, and causing trouble PTSD Post- traumatic stress disorder Caused by psychological trauma SI Suicidal ideation When a person thinks about killing themselves ==Tests & treatments== Doctors often talk about common medical tests and treatments by using abbreviations. Examples of these abbreviations include: Abbreviation: Stands For: Meaning CABG Coronary artery bypass graft Surgery to treat blocked arteries that bring blood to the heart; pronounced \"cabbage\" CBC Complete Blood Count A basic blood test that counts the number of blood cells in a person's blood CPR Cardiopulmonary resuscitation Emergency treatment done when a person's heart or breathing stops CT Computed tomography scan Uses X-rays to make a 3-D picture of the inside of the body; also called a \"CAT scan\" ECG; EKG Electrocardiogram Test of the heart's electrical activity Echo Echocardiogram Test that uses sound waves to make a picture of the heart and whether it is working normally EEG Electroencephalogram Test of the brain's electrical activity LFTs Liver function tests Tests of how well the liver is working (usually blood tests) MRI Magnetic resonance imaging Uses a very strong magnet to make a 3-D picture of the inside of the body XRT X-ray Therapy Usually means radiation therapy for cancer ==Other abbreviations== Other abbreviations used in medicine include: Abbreviation: Stands For: Meaning Hx History Example: \"Patient has a family Hx of diabetes\" means \"Patient has a family history of diabetes\" a Before Example: \"Take a 8:00\" means \"Take (this medication) before 8:00\" AMA Against Medical Advice The patient has chosen to not comply with a treatment plan (example: \"patient left the hospital AMA\") BMI Body Mass Index A measure of how much a person weighs based on their height c With Example: \"Take c food\" means \"Take (this medication) with food\" DNR Do Not Resuscitate The patient has a Do Not Resuscitate order saying they do not want to be resuscitated if their heart stops Dx Diagnosis The medical problem a person has NKDA No known drug allergies If the person has a drug allergy, we don't know about it. The person has no drug allergies we know about. NPO Nothing by mouth The patient should not swallow anything (no food, liquids, or medications) p After Example: \"Patient had pain p eating\" means \"Patient had pain after eating\" s̅ Without Example: \"Nausea s̅ vomiting\" means \"Patient was nauseous but did not vomit' Tx Treatment Example: \"Tx was administered at 8:00am\" means \"Treatment was administered at 8:00am\" ==References== Category:Medicine Category:Science-related lists Category:Glossaries",
 "title": "List of medical abbreviations"
}