{
 "id": "1177927",
 "text": "The Good Friday prayer for the Jews has been a yearly prayer in some Christian churches on Easter Friday since ancient times.Hubert Wolf: Perfide Juden? In: Papst und Teufel. Die Archive des Vatikan und das Dritte Reich. 2. Auflage. München 2009, S. 108. In the Roman Catholic Church, it is known as the Solemn Intercessions. In the Episcopal Church of the United States (US), it is known as the Solemn Collects. ==Overview== The Good Friday prayer for the Jews is done for both Christians and non-Christians, including Jews, pagans and heretics. The prayer is dated to the 8th-century liturgy book Gelasian Sacramentary. ==Background== ===Classical antiquity=== Christianity originated as a persecuted sect of Judaism in Roman Judea. * * * Early Christians were mostly Jewish before non-Jewish converts became the majority and split with Judaism over theological differences. Christianity became the Roman state religion in 380 AD. ====Early Christianity==== Since the 1st century, Jews have been blamed for the death of Jesus. * * * * * * * * Jeremy Cohen, Christ Killers: The Jews and the Passion from the Bible to the Big Screen, Oxford University Press 2007. p. 55. Several conflicts happened between Jews and Christians. Particularly, they disagreed on whether the TorahThe first five books of the Old Testament, also known as the Five Books of Moses. was still valid and whether circumcision was needed for non-Jewish converts. Paul used \"Judaizers\" to refer to Jews who demanded non-Jewish converts to have circumcision, as Paul believed that faith in Christ alone was enough for someone to be saved by God. Paul asked Christians not to follow the Old Covenant, while accusing Jews of \"turning from the [Holy] Spirit to the flesh\" to look good to God. Several Church Fathers condemned Jews for rejecting Jesus as the Messiah, including John Chrysostom who wrote the homily series Adversus Judaeos to condemn the Jews,Ancient Greek: Κατὰ Ἰουδαίων Kata Ioudaiōn, \"against the Jews\"* * * which is seen by many historians as having inspired antisemites to justify pogroms, expulsions and discrimination against Jews in the following 1,600 years,Walter Laqueur, The Changing Face of Antisemitism: From Ancient Times To The Present Day (Oxford University Press: 2006) , pp. 47–48 which peaked in the Holocaust (1933‒45), killing at least 6,000,000 Jews across Europe. * * * * * * * * * * ===Middle Ages=== A prayer for Jews was known in the daily Mass. 6th-century Roman, Milan and Gallican Liturgies, prayed for Jews, heretics and pagans only on Good Friday. It was reportedly formalized in the Carolingian church mass books in 800 AD, with the Frankish bishop justifying the prayer as follows:Amalarius von Metz: De ecclesiasticis officiis 1, 13. In: Jean Michel Hanssens: Amalarii episcopi liturgica omnia. drei Bände, Rom 1948–1950. Zitat und Übersetzung nach Jules Isaac: Genesis des Antisemitismus, Wien 1969, S. 222f. The fact that the Roman soldiers playfully bent their knees (genuflection) to mock Jesus when crucifying Him was left out of the prayer.* See p.7 in Solomon Lurie, Antisemitism v Drevnem Mire, in Russian, published by \"Byloe\", Petrograd, 1922. * * Antisemitism is said to be the motive for the distortion to make Jews look like the ones who did it. Throughout the Middle Ages, Good Friday and the Holy Week were a dangerous time for Jews in some European kingdoms due to occasional Christian violence, which often happened during Passion plays, with rocks thrown through synagogue windows and Jews assaulted. ==Roman Catholic Church== ===Tridentine version=== The form of the Good Friday prayer for the Jews used between 1570 and 1955 read as follows:; ===Modern reforms=== ====Interwar period==== In January 1928, the chairman of Benedikt Gariador wrote to Pope Pius XI to request that the words perfidis/perfidia be changed:Ralf Tooten: Augen der Weisheit. Das spirituelle Gesicht der Religionen. Herder, Freiburg im Breisgau 2002, ISBN 3-451-27011-0, S. 74. * Christians have prayed very early for the conversion of the Jews to Christ, not for their conversion to Christianity * The word perfidis was originally only related to concrete violations of the law of certain Jews, only later understood as \"complete corruption\" and was thus reinterpreted as the unchangeable character of all Jews * The alleged mocking Jewish kneeling before Jesus is unrecovened in the New Testament and a fiction added later * The Prayer is now being abused as an argument for antisemitism, which the Catholic Church itself even propagates in its services * As such perfidiam Judaicam should be replaced by plebem Judaicam (\"Jewish people\"), as stated in a manuscript of the Manuale Ambrosianum from the 11th century Pope Pius XI reportedly asked the Sacred Congregation of Rites to review it. The matter was later referred to the Dicastery for the Doctrine of the Faith (Holy Office). Marco Sales, a Dominican friar close to Pope Pius XI, who rejected the changes on the grounds of Catholic traditions: * All the criticized parts of the Jewish prayer, including the omission of the kneeling and the Amen, had already appeared in the ancient Church. As \"venerable holy liturgy, dating back to antiquity\", they escape any reformability * If such interference in this tradition were allowed to be allowed to a private association, one would not come to an end and could just as well allow the removal of offensive passages in the apostolic credo, the improvers and the curse psalms from the liturgy. These contained much harsher formulations for Jews * Perfidis always means a breach of words and contracts: This is exactly what God himself accuses the Jews in the Bible * Just as God, had only made a covenant with the Jewish people, only those who had broken this covenant and continued it constantly: therefore the word perfidis is appropriate for them, and not for the pagans ====Post-war period==== After the Holocaust, Eugenio Zolli, the former Chief Rabbi of Rome who became a Catholic, asked Pope Pius XII to remove perfidis from the prayer. French historian Jules Isaac also did so in 1949 when he met the Pope, who argued that perfidis meaned \"unbelieving\" rather than \"perfidious\", and made slight changes to the prayer: When Pope John XXIII took over, he removed faithless from the prayer with effect from July 5, 1959.Vorgrimler, H., Commentary on the Documents of Vatican II: Volume III, New York, 1968, 5. Meanwhile, defenders of the word appealed to its origin, claiming that the word's meaning had changed when classical Latin became medieval Latin.K.P. Harrington, Mediaeval Latin (1925), page 181, footnote 5 The 1959 version of the prayer became:Roman Missal, 1962 typical edition, pages 173–174 ) On the Good Friday in 1963, the canon recited the prayer that included perfidis, John XXIII signaled for it to be stopped and repeated without the word.\"The Catholic Church and the Holocaust: 1930–1965\", Michael Phayer, p. 209, Indiana University Press, 2000, The Second Vatican Council (Vatican II) was followed by changes to the prayer. The changes were strongly opposed by Arab states, which feared that Quran's teachings about the Jews would also be invalidated, and radical traditionalist Catholics. * * * * The 1965 version of the prayer became: In this prayer, the Old Covenant between God and the Jews was recognized for the blessing of all peoples (Genesis 12:3). As per the Nostra aetate, * * * further changes happened in 1970: On July 7, 2007, Pope Benedict XVI made policy changes regarding the prayer, allowing Catholic priests to use pre-1962 versions of the prayer privately. This sparked a controversy over the Catholic Church's commitment to the Vatican II. Due to the controversy, Pope Benedict XVI changed the 1970 version of the prayer:\"Trouble ahead? The future of Jewish-Catholic relations\", Commonweal, March 13, 2009 by John R. Donahue, fetched 13 September 2009 Despite this, the private use of the prayer's older versions continued among some Catholic communities, which caused Abraham Foxman, the national director of the American civil rights group Anti-Defamation League (ADL), to say: Monsignor Dennis Mikulanis, vicar for inter-religious and ecumenical affairs for the Roman Catholic diocese of San Diego, instead of acknowledging the concerns, accused the ADL of \"jumping the gun\":\"Mikulanis says ADL jumped gun, got its facts wrong\" San Diego Jewish World. Vol. 1, Number 67. July 6, 2007. Mikulanis also accused media outlets of \"erroneously contend[ing] that the letter could in effect reinstate a prayer offensive to Jews from the Good Friday liturgy of the Tridentine Mass, which dates back to 1570\".\"Pope Eases Restrictions on Latin Mass\" , New York Times, July 8, 2007. In response, Abraham Foxman repeated his position:Foxman, Abraham \"Latin Mass Cause for Concern\" Jewish Telegraphic Agency July 11, 2007. Accessed July 12, 2007. Mikulanis' view aligned with some traditionalist Catholic groups, including the Priestly Fraternity of St Peter (FSSP), which argued for the necessity of converting Jews to Christianity, and the Society of Saint Pius X (SSPX), which accused the Catholic Church of making \"superfluous and regrettable concession to representatives of Judaism\". Notably, the SSPX has a track record of promoting Holocaust denial Distortion of the Holocaust refers, inter alia, to: and conspiracy theories about Jews. Meanwhile, the American Jewish Committee (AJC) commented: ==Anglican Communion== The third of the Solemn Collects in the 1662 Book of Common Prayer of the Church of England states: As early as in 1928, the American Episcopal Church changed \"all Jews, Turks, Infidels, and Heretics\" in the prayer to \"all who know thee not as thou art revealed in the Gospel of thy Son\". In the 1979 version of the Book of Common Prayer, confirmed the changes to the prayer as such: ==Eastern Orthodoxy== In 2007, twelve Eastern Orthodox priests representing five different national churches, some resisting their leadership, called for removing all liturgical passages they considered antisemitic. ==Related pages== * Protestant Reformation * Antisemitic stereotypes * Secondary antisemitism * Anti-Judaism and antisemitism * Accusations of Jewish anti-Christianity ==References== Category:Racism Category:Catholicism Category:Antisemitism Category:History of Christianity",
 "title": "Good Friday prayer for the Jews"
}