{
 "id": "1177131",
 "text": "East Lake Library is one out of 41 libraries in the Hennepin County Library System. It was one of 15 libraries that were in the Minneapolis Public Library System before it was merged into Hennepin County Library. This library has moved into 3 different buildings. == Buildings == === First === The original East Lake Community Library opened in 1924, between the Hosmer Community Library and the Roosevelt Community Library. The building had a simple design like a store, so it was nicknamed 'The Reading Factory'. It was one of the last libraries during an expansion from 1905 and 1937. The first building was replaced in 1976. At this time, the library had 121,459 items. The library was replaced by a day care. In 1987, The building became a store.\"Hennepin County Library-East Lake\". In 2000 the building was added to the National Register of Historic Places. === Second === The second East Lake was built two blocks west of the original library. It had of space, and a meeting room.Benidt, Bruce Weir (1984). The building was part of the Minnehaha Mall, This new building also replaced the Washburn Library. In 1999, Outlook Twenty Ten gave ways of updating the library: * Option 1 Small Expansion, Price: $2.8 million. * Option 2 Large expansion of the library and purchase nearby properties. Price: $3 million. * Option 3 Repair the library. No price was given. None of the suggestions were followed. On April 30, 2005, the building was closed for moving to the third building.\"East Lake Library\". === Third === The library opened on March 10, 2007. It has a meeting room, children's area, computers, and an automated checkout system. The library was damaged on May 27, 2020 after George Floyd protests. == Programs == K-12 Homework Help is a free program for students. East Lake also hosts a monthly Mystery Book Club, and a Weekly Arts & Crafts Practice Group. == References == Category:Pages using gadget WikiMiniAtlas Category:Libraries in Hennepin County Library Category:Education in the United States Category:Minnesota",
 "title": "East Lake Library"
}