{
 "id": "1177320",
 "text": "The Battle of Fazilka was a military engagement during the Indo-Pakistani War of 1971 in the western sector, near the Indo-Pakistani border. The battle saw Pakistani forces achieve success against the Indian 67 Brigade, capturing significant territory west of Fazilka. == Battle == On the night of December 3, the Pakistani 105 Independent Infantry Brigade launched a swift and aggressive assault against the Indian 67 Infantry Brigade in the Sulaimanke sector. They advanced six miles into Indian territory within an hour, under intense artillery fire. Indian forces retreated in confusion, destroying most bridges in the area. Over the following nights, Indian troops attempted five counterattacks, but all were repelled by accurate Pakistani artillery.HRC Report, Part IV, Chapter VIII.Jahan Dad Khan, 124. The Pakistani forces captured the strategic Sulaimanke Canal Headworks, while the Indian command suffered demoralization and leadership changes. The Pakistan Air Force supported the offensive with sorties, claiming to have destroyed tanks and vehicles, though results varied. Later, Pakistan's II Corps faced delays and reduced strength due to troop diversions, with all movements frozen before a ceasefire took effect on December. Maj. J. N. Goel, \"Defending Ganganagar,\" Sainik Samachar, 20 July 1986.Lt. Col. Mukhtar Ahmad Gilani, \"Lost Opportunity - A Military Analysis 1971,\" Defence Journal, January 2003. == Aftermath == The delay in launching the II Corps offensive has remained a subject of debate among military analysts. Some argue that confusion within Pakistan’s high command led to the failure to execute the attack, while others point to a lack of promised PAF support as a major factor.Maj. Agha Humayun Amin, \"The Anatomy of Indo-Pak Wars A Strategic and Operational Analysis,\" Defence Journal, August 2001. According to one analysis, the Commander-in-Chief of the Pakistan Air Force withdrew promised air support just days before the operation was to begin. Although major hostilities ended with the ceasefire, on 26–27 December, Indian 4 Para of 51 Para Brigade conducted an assault to dislodge a small Pakistani platoon from a sand dune near Nagi village. The attack resulted in 21 Indian casualties and 60 wounded.Lt. Col. J. N. Goel, \"31 (1) Para Brigade Operations 1971,\" in Karim, 375-79. == References == Fazilka Fazilka Category:Indo-Pakistani war of 1965",
 "title": "Battle of Fazilka"
}