{
 "id": "1177311",
 "text": "Michel Ocelot was born on October 27, 1943 in Villefranche-sur-Mer. He is a French director known for his work in animated films, especially his trilogy of films about Kirikou made between 1998 and 2012. He is also the writer and director of the triptych Princes and Princesses (2000) / Tales of the Night (2011) / Ivan Tsarevitch and the Changing Princess (2016), created using Cut- out animation. He won awards for Azur and Asmar (2006) and Dilili in Paris (2018), which earned him the 2019 César for Best Animated Film. == Biography == === Early Life and Short Films (1980s) === Born in Villefranche-sur-Mer, on the French Riviera, he spent his childhood in Conakry, Guinea, and his teenage years in Angers, after Guinea gained independence in 1958. He later moved to Paris. He first studied at the Rouen School of Fine Arts, then at the National School of Decorative Arts in Paris, and finally at the California Institute of the Arts in Los Angeles. Initially, he experimented with animation as an amateur, making various short films with friends during vacations. Everyone used the techniques they preferred, resulting in a variety of creations with simple methods. He used cut-out paper, a technique he later employed in the series Ciné Si (The Factory, 1989). He aimed to create his works as simply as possible. In 1976, he directed the series The Adventures of Gédéon (based on Benjamin Rabier), followed by his first professionally produced short film, The Three Inventors, in 1979. This was produced by AAA, who also worked with Jacques Rouxel, the creator of the Shadoks. That same year, he received a BAFTA award in London for this film. In 1983, he won the César Award for Best Animated Short Film for The Legend of the Poor Hunchback, also produced by AAA. === Feature Films and Success (1990s-2000s) === In 1994, Michel Ocelot was elected president of the Association internationale du film d'animation (ASIFA) for two terms. In 1998, he released his first feature film, Kirikou and the Sorceress. Based on an African tale, the film tells the story of Kirikou, a tiny boy with great intelligence and generosity, who opposes the witch Karaba, who terrorizes the village. The film is inspired by West African cultures in its story, visuals, music, and voice acting. It was critically acclaimed, winning around thirty awards worldwide and attracting over one million viewers in French theaters. This led to books and merchandise based on the film and showcased French animation's talent globally. In 2000, he introduced a more experimental project, Princes and Princesses, which features six tales told through shadow puppetry made with cut paper. To celebrate \"World Animation Day,\" Ocelot participated in an event on October 28, 2003, demonstrating his animation techniques live at Forum des Images in Paris. In 2005, he collaborated with Bénédicte Galup on the much-anticipated sequel Kirikou and the Wild Beasts. This film tells stories that occur alongside the events of the first film. Critically, it was well-received, and its theatrical release was more widespread, achieving greater commercial success than the original. For his fourth feature, he created an original project: Azur and Asmar. With a larger budget, this film marked a shift to computer-generated imagery (CGI). Set in medieval Europe, it teaches children about tolerance, although the director does not see this as the main theme of his works. Released in 2006, it was another commercial and critical success, attracting over 1.5 million viewers in theaters.. The film won the 2007 César for Best Original Music. Also that year, Ocelot directed a music video for Björk for her song Earth Intruders from the album Volta, incorporating many traditional West African themes, similar to those in Kirikou. === Recognition (2010s) === In 2008, he received an international award, the Klingsor Prize (for his lifetime achievement) at the Bratislava Animation Biennial (BAB). Archive of BAB laureates, official site. In 2010, he created the fantasy animated series Dragons and Princesses for the Canal+ Family channel, using cut-paper techniques similar to those in Princes and Princesses. The following year, he adapted these ten episodes into a feature film titled Tales of the Night. The film only gathered about 500,000 admissions,Commin, Ganne and Brunner (2017), . but it received several nominations at Berlinale 2011. He also received the Henri-Langlois Prize that year for his entire body of work. The following year, he concluded his trilogy with Kirikou and the Men and Women. As the title suggests, this film focuses on villagers instead of animals, as in the second film. Technically, the filmmaker enhanced 2D animation with 3D technology. Originally, this project was envisioned as a six-episode animated series for France Télévisions.. At the end of 2018, he released his fifth animated feature, Dilili in Paris, about a young Kanak girl in Paris during the Belle Époque. While the film presents a visually imagined Paris with the heroine meeting notable figures of that era, it also addresses serious themes like colonialism and racism. The film attracted over 600,000 spectators. and won the César Award for Best Animated Film in 2019. == Filmography == === Film === ==== Short Films ==== * 1979: The Three Inventors * 1981: The Girls of Equality * 1982: The Legend of the Poor Hunchback * 1987: The Four Wishes * 1992: Tales of the Night: Dancing Shepherdess - The Beautiful Girl and the Sorcerer - The Prince of Jewels * 2020: Pablo Paris Satie (live-action), part of the Paris National Opera's La 3e Scène collection ==== Feature Films ==== * 1998: Kirikou and the Sorceress (won many awards) * 2000: Princes and Princesses * 2005: Kirikou and the Wild Beasts * 2006: Azur and Asmar * 2011: Tales of the Night * 2012: Kirikou and the Men and Women * 2016: Ivan Tsarevitch and the Changing Princess * 2018: Dilili in Paris * 2022: The Pharaoh, the Savage and the Princess === Television === ==== TV Series ==== * 1976: The Adventures of Gédéon * 1983: The Insensitive Princess * 1989: Ciné Si * 2010: Dragons and Princesses === Music Videos === * 2007: Earth Intruders by Björk == Awards == === Honors === * 1981 BAFTAs: BAFTA for Best Animated Film for The Three Inventors * Albi Festival 1981: Jury Special Prize for The Girls of Equality * 1983 César: César for Best Animated Short Film for The Legend of the Poor Hunchback * Bratislava Animation Biennial 2008: Klingsor Prize for his entire body of work * Henri-Langlois Prize 2011 for Animated Film and Animated Image, for his entire body of work * 2019 César: César for Best Animated Film for Dilili in Paris * Annecy International Animation Film Festival 2022: Honorary Crystal. === Decorations === * Commander of the Order of Arts and Letters: promoted to commander on .Decree of September 25, 2017, promoting nominations in the Order of Arts and Letters * Knight of the Legion of Honor: awarded knight status by decree on for 33 years of artistic work. == Notes and References == === Bibliography === * Luce Vigo and Catherine Shapira, Kirikou and the Sorceress of Michel Ocelot, Les Enfants de cinéma, collection “Carnets de notes sur…”, 2000, 40 p. * Xavier Kawa-Topor, Princes and Princesses of Michel Ocelot, Les Enfants de cinéma, collection “Carnets de notes sur…”, 2003, 40 p. * * Nathan Bonvallet, Michel Ocelot, the Poet of Shadows, Third, 2022, 200 p. == Other websites == * * Short biography on the La Fabrique website * Short biography on Arte's Court-Circuit * *",
 "title": "Michel Ocelot"
}