{
 "id": "1177146",
 "text": "Mandisa Muriel Lindelwa Maya (born 20 March 1964) is the Chief Justice of South Africa. Before this, she was the President of the Supreme Court of Appeal from 2017 to 2022. In September 2022, she became the Deputy Chief Justice of South Africa. She became a judge in May 2000 at the Transkei Division of the High Court and was promoted to the Supreme Court of Appeal in 2006. Maya was born in the Eastern Cape and started her legal career in the Transkei, where she worked as a prosecutor and legal adviser for the state. In 1994, she became an advocate. President Thabo Mbeki appointed her as a judge at the Mthatha High Court in May 2000 and later to the Supreme Court of Appeal in June 2006. She became the court's deputy president in September 2015 and its president in May 2017, taking over from Lex Mpati in both roles. She was the first black woman to be part of the Supreme Court of Appeal and also the first woman to serve as its deputy president and president. Maya was nominated to join the Constitutional Court in 2009 and 2012, but both times she was not chosen. In March 2022, President Cyril Ramaphosa chose not to appoint her as Chief Justice of South Africa, which caused some controversy. However, in September 2022, he made her the first woman to become Deputy Chief Justice, where she works under Chief Justice Raymond Zondo. From 2018 to 2023, she led the South African chapter of the International Association of Women Judges. On 1 July 2021, she also became the Chancellor of the University of Mpumalanga. In July 2024, President Ramaphosa appointed Maya as South Africa's first woman Chief Justice. She officially started the job on 1 September 2024. == Early life and education == Maya was born on 20 March 1964 in St Cuthbert's, a rural area near Tsolo in the Eastern Cape. She was the oldest of six children. Her parents, Sandile and Nombulelo Maya, were both teachers, and Xhosa was her first language. In 1966, her family moved to King William's Town after her father got a job at Radio Bantu. She went to school there until 1977, but because of the unrest caused by the Soweto uprising, she was sent to continue her schooling in Mthatha. She finished high school in 1981 at St John's College in Mthatha. == Legal education and career == When Maya joined the University of Transkei, she planned to study medicine. But on registration day, she looked through a forensic medicine textbook and changed her mind. Instead, she chose to study law and earned a BProc degree in 1986. She then went to the University of Natal and got her LLB degree in 1988. Between 1987 and 1988, she worked as a clerk at a law firm in Mthatha called Dazana Mafungo Inc. After graduating, she worked at the magistrate's court in Mthatha, first as a court interpreter and later as a public prosecutor. In 1989, Maya went to Durham, North Carolina to study at Duke University School of Law with a Fulbright Scholarship. There, she studied labour law, ways to settle disputes without going to court, and constitutional law. She later said it was an eye- opening experience to leave apartheid South Africa and study at Duke. After finishing her LLM degree in 1990, she worked as a policy adviser at the Women’s Legal Defense Fund in Washington, D. C. from 1990 to 1991. When Maya came back to South Africa, she worked as an assistant state legal adviser in Mthatha from 1991 to 1993. At the same time, she also taught part-time law classes at the University of Transkei. In 1993, she moved to Johannesburg to do her pupillage (training to become an advocate), but after she qualified in 1994, she returned to the Transkei to work as an advocate. She practiced law there for five years. Maya said that in the beginning, it was hard for her to get cases, and she mostly got work through referrals from friends, especially Nambitha Dambuza. In 1999, she was made an acting judge at the Mthatha High Court, which is the main court for the Transkei region of South Africa's High Court. She later shared that it was Dumisa Ntsebeza who encouraged her to become a judge. ==References== Category:Living people Category:1964 births Category:Pages with unreviewed translations",
 "title": "Mandisa Maya"
}