{
 "id": "1177222",
 "text": "Christopher Lindsey (born July 26, 1983) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH) under the ring name Roderick Strong. He is a member of the Undisputed Kingdom stable. Rivera has also made appearances in Ring of Honor (ROH) (before AEW's purchase), Full Impact Pro (FIP), Total Nonstop Action Wrestling (TNA), Pro Wrestling Guerrilla (PWG), Dragon Gate (DG), Pro Wrestling Noah, and WWE. Lindsey has held many championships over his career. In AEW, has has been a one-time AEW International Champion. In FIP, he was a two-time FIP Tag Team Champion and three-time FIP World Heavyweight Champion. In PWG, he was a one-time PWG World Champion, three-time PWG World Tag Team Champion, and a two-time co-winner of the Dynamite Duumvirate Tag Team Title Tournament; winning with Pac in 2007 and Jack Evans in 2008. In WWE, he was a one-time NXT Cruiserweight Champion, one-time NXT North American Champion, and two-time NXT Tag Team Champion. ==Career== ===All Elite Wrestling === On the April 26, 2023 episode of Dynamite, Strong made his AEW surprise debut after running in and helping save Adam Cole from a beatdown by the Jericho Appreciation Society. Shortly after, AEW owner Tony Khan announced that Strong had signed a contract to become a member of the AEW roster. On the May 3 episode of Dynamite, Strong made his AEW in-ring debut, teaming with Adam Cole, Bandido and Orange Cassidy to defeat Jericho Appreciation Society (Angelo Parker, Daniel Garcia, Jake Hager and Matt Menard). Strong then entered the Owen Hart Foundation Tournament but lost to Samoa Joe in the quarter finals.After the match, Strong was stretchered out of the arena with a kayfabe neck injury. Strong then entered the Grand Slam Eliminator Tournament for the AEW World Championship. He went on to defeat Trent Beretta and Darby Allin before losing to Samoa Joe in the finals and suffering yet another kayfabe neck injury. At Worlds End, Strong was revealed as one of the masked men and created the Undisputed Kingdom stable, alongside Adam Cole, Matt Taven, Mike Bennett, and Wardlow. At Revolution, Strong challenged Orange Cassidy for his AEW International Championship and was able to win both the match and the title. This was Strong's first championship in AEW. At AEW Dynasty, Strong successfully defended his championship against Kyle O'Reilly. At Double or Nothing, Strong lost the championship to Will Ospreay. On the June 5 episode of Dynamite, Strong challenged Swerve Strickland for the AEW World Championship but was unsuccessful. On the July 13 episode of Collision, Strong defeated Dalton Castle to become the number one contender for the ROH World Championship. At Death Before Dishonor, he unsuccessfully challenged Mark Briscoe for the championship. At Grand Slam, Strong challenged Hook in a FTW Rules match for the FTW Championship but lost. On the February 12, 2025 episode of Dynamite, Undisputed Kingdom challenged Death Riders (Claudio Castagnoli, PAC and Wheeler Yuta) for the AEW World Trios Championships but were unsuccessful. == Personal life == On November 7, 2018, Lindsey married Moldovan mixed martial artist and fellow professional wrestler Marina Shafir. They have 1 son together. == References == ==Other websites== * * Category:1983 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Former WWE wrestlers Category:People from Eau Claire, Wisconsin Category:Sportspeople from Wisconsin",
 "title": "Roderick Strong"
}