{
 "id": "1177061",
 "text": "In Meitei culture, fish are very important and symbolize wealth, life, and nature's balance. Fish are a key part of their food and traditional dishes. They also appear in stories, festivals, and rituals, showing their deep connection to nature and the water life of Manipur and other Meitei populated areas of Assam, Tripura as well as in Bangladesh and Myanmar. Among its numerous names, fish is commonly known as \"Nga\" (ꯉꯥ) or \"Lemlei\" (ꯂꯦꯝꯂꯩ) in Meitei language (also known as Manipuri). == Terms in Meitei language == === Words directly derived from Meitei term for \"fish\" === * Ngā maku (ꯉꯥ ꯃꯀꯨ, /ŋá mə.ku/) refers to the scale or skin of a fish. The term is derived morphologically from \"ngā\" (fish) and \"ma-ku\" (outer layer), which together emphasize its meaning as the external covering or protective layer of a fish. * Ngā marum (ꯉꯥ ꯃꯔꯨꯝ, /ŋá mə.rum/) refers to roe, which are the eggs of a fish. The term's morphological components consist of \"ngā\" (fish) and \"ma-rum\" (egg), highlighting its significance as the reproductive product of fish, often valued in culinary traditions. * Ngāmi (ꯉꯥꯃꯤ, /ŋá.mí/) refers to a fisherman, an individual whose occupation or activity involves catching fish. Morphologically, the term is derived from \"ngā\" (fish) and \"-mi\" (person), signifying a person associated with fish or fishing. * Ngā samjet (ꯉꯥ ꯁꯝꯖꯦꯠ, /ŋá sə́m.jet/) refers to a species of small, dark-colored freshwater fish. The term is morphologically derived from \"ngā\" (fish) and \"samjet\" (comb), likely alluding to specific features or characteristics associated with this fish species. * Ngākcrou (ꯉꯥꯛꯆ꯭ꯔꯧ, /ŋak.crəu/) refers to a species of fish, though specific details about its identification are not provided. * Ngākcrou mānbi (ꯉꯥꯛꯆ꯭ꯔꯧ ꯃꯥꯟꯕꯤ, /ŋak.crəu man.bi/) describes a type of bean. Morphologically, the term derives from \"ngākcrou\" (a species of fish) and \"mān-bi\" (to resemble‑nominalizer), emphasizing a resemblance to the fish. * Ngākrā (ꯉꯥꯀ꯭ꯔꯥ, /ŋa.kra/) designates a small, smooth-skinned, blackish freshwater fish, scientifically identified as Clarias batrachus. * Ngākhā (ꯉꯥꯈꯥ, /ŋá.kʰá/) refers to a type of small fish, with the morphological components \"ngā-\" (fish) and \"-khā\" (to be bitter), possibly highlighting its taste or characteristic. * Ngācang (ꯉꯥꯆꯡ, /ŋá.cə́ŋ/) denotes the quantity of fish caught within a basketlike fishing trap. Morphologically, \"ngā-\" (fish) and \"‑cang\" (to enter) describe its functional use. * Ngācik (ꯉꯥꯆꯤꯛ, /ŋá.cik/) identifies a small, smooth-skinned, blackish freshwater fish, scientifically recognized as Heteropneustes fossilis. * Ngācing (ꯉꯥꯆꯤꯡ, /ŋá.ciŋ/) pertains to crayfish, specifically from the genus Palaemon. The term's morphological construction, \"ngā-\" (fish) and \"‑cing\" (to pull), reflects the species' distinctive behavior. * Ngācou (ꯉꯥꯆꯧ, /ŋá.cəu/) refers to a variety of freshwater fish, classified under the genus Schichura. * Ngātangba (ꯉꯥꯇꯡꯕ, /ŋá.təŋ.bə/): Refers to the act of consuming fish again after a period of abstinence. Morphologically, the term combines \"ngā-\" (fish), \"tang-\" (to taste), and \"-ba\" (nominalizer). * Ngātin (ꯉꯥꯇꯤꯟ, /ŋá.tin/): Denotes a species of freshwater fish, identified scientifically as Labeo pangusia. Morphologically derived from \"ngā-\" (fish) and \"-tin\" (saliva). * Ngātup (ꯉꯥꯇꯨꯞ, /ŋá.tup/): Refers to a small freshwater fish, scientifically classified as Nemacheilus botia. The term combines \"ngā-\" (fish) and \"-tup\" (to cut completely). * Ngātek Ngānou (ꯉꯥꯇꯦꯀ ꯉꯥꯅꯧ, /ŋá.tek ŋá.nəu/): Refers to very small fresh fish. Morphologically, \"ngā-\" (fish), \"tek-\" (to be fresh), and \"ngānou-\" (to be new) highlight its characteristics. * Ngāten (ꯉꯥꯇꯦꯟ, /ŋá.ten/): Refers to a kind of freshwater fish, identified as Ompok bimaculatus. Derived from \"ngā-\" (fish) and \"-ten\" (identifier). * Ngātoi (ꯉꯥꯇꯣꯏ, /ŋá.toi/): Refers to a type of fish, scientifically named Barbus ticto. The morphological components include \"ngā-\" (fish) and \"-toi\" (to be broken). * Ngāton (ꯉꯥꯇꯣꯟ, /ŋá.tón/): Refers to a small freshwater fish, scientifically classified as Labeo angra. The term includes \"ngā-\" (fish) and \"-ton\" (identifier). * Ngāthi (ꯉꯥꯊꯤ, /ŋá.tʰí/): Denotes a type of freshwater fish, scientifically recognized as Labeo dero. Morphologically composed of \"ngā-\" (fish) and \"-thi\" (to be ugly). * Ngānam (ꯉꯥꯅꯝ, /ŋá.nəm/): Refers to the fishy smell. Morphologically derived from \"ngā-\" (fish) and \"-nam\" (to smell). The verb \"~nam-\" (/~nəm/) signifies the act of emitting a fishy odor. * Ngānam Thumnam (ꯉꯥꯅꯝ ꯊꯨꯝꯅꯝ-, /ŋá.nəm tʰum.nəm/): A verb describing a state of being savory or tasty, typically applied to cooked vegetables, meat, fish, or similar foods. Morphologically composed of \"ngā-\" (fish), \"nam\" (to be in right proportion), and \"thum-nam\" (salt-to be in right proportion). * Ngānei (ꯉꯥꯅꯩ-, /ŋá.nəi/): A verb referring to the act of catching fish with a net and a fishing basket in a large pond or similar environment. Morphology: \"ngā-\" (fish) and \"-nei\" (to stir violently). * Ngānoi (ꯉꯥꯅꯣꯏ, /ŋá.noi/): Denotes a type of freshwater fish, scientifically identified as Punitius sarana. Morphology: \"ngā-\" (fish) and \"-noi\" (to be fat). * Ngāpang (ꯉꯥꯄꯡ, /ŋá.paŋ/): Refers to a freshwater fish, scientifically known as Glyptothorax cavia. Derived from \"ngā-\" (fish) and \"-pang\" (to be blunt). * Ngāpāi (ꯉꯥꯄꯥꯏ, /ŋa.pai/): Describes a freshwater fish characterized by a small head and broad, flat body, scientifically Notopterus chitala. * Ngāprum (ꯉꯥꯄ꯭ꯔꯨꯝ, /ŋa.prum/): A species of eel with a slippery, snake-like body that inhabits swamps and ditches, scientifically Monopterus albus. Morphology: \"ngā-\" (fish) and \"-prum\" (identifier). * Ngāphak (ꯉꯥꯐꯛ, /ŋá.pʰək/): Refers to a smoked and opened fish, emphasizing preparation. Morphology: \"ngā-\" (fish) and \"-phak\" (to open with force). * Ngābemma (ꯉꯥꯕꯦꯝꯃ, /ŋa.bem.mə/): Denotes a small, blackish freshwater fish. Variant form: Ngāpemma. * Ngāyonbi (ꯉꯥꯌꯣꯟꯕꯤ, /ŋá.yon.bi/): A term referring to a fishwife, a woman engaged in selling fish. Morphology: \"ngā-\" (fish), \"yon-\" (to sell), and \"-bi\" (feminine). * Ngārak (ꯉꯥꯔꯛ, /ŋá.rək/): Represents the amount of fish caught in a single haul using a fishing net. Morphology: \"ngā-\" (fish) and \"-rak\" (to be caught). * Ngāram (ꯉꯥꯔꯝ, /ŋá.rəm/): Refers to different species or varieties of fish. Additionally, \"ngāram taret\" (/ŋá.rəm tə.ret/) describes seven distinct species of fish. Morphology: \"ngā-\" (fish), \"-ram\" (land), and \"taret\" (seven). * Ngārā (ꯉꯥꯔꯥ, /ŋa.ra/): Refers to a species of freshwater fish, scientifically Tore pituitara. Morphology: \"ngā-\" (fish) and \"-rā\" (identifier). * Ngārākpi (ꯉꯥꯔꯥꯛꯄꯤ, /ŋa.rak.pi/): Refers to the kingfisher bird. Morphology: \"ngā-\" (fish), \"-rak\" (to snatch), and \"-pi\" (nominalizer). * Ngāri (ꯉꯥꯔꯤ, /ŋá.ri/): Indicates dry, seasoned fish. Morphology: \"ngā-\" (fish) and \"-ri\" (to season). * Ngārin (ꯉꯥꯔꯤꯟ, /ŋa.rin/): A snakelike fish, scientifically Anguilla bengalensis. Variant form: Ngāril. Morphology: \"ngā-\" (fish) and \"-rin\" (snake). * Ngāruk (ꯉꯥꯔꯨꯛ, /ŋá.ruk/): Refers to a fish basket. Morphology: \"ngā-\" (fish) and \"-ruk\" (basket). * Ngārubāk (ꯉꯥꯔꯨꯕꯥꯛ, /ŋá.ru.bak/): A squarish fish basket equipped with a cover. Morphology: \"ngā-\" (fish), \"-ru\" (basket), and \"-bāk\" (to be flat). * Ngārengjei (ꯉꯥꯔꯦꯟꯖꯩ, /ŋá.reŋ.jəi/): A small wooden or bamboo rod inserted into the mouth of a fish. Morphology: \"ngā-\" (fish), \"-reng\" (to penetrate), and \"-jei\" (stick). * Ngāren (ꯉꯥꯔꯦꯟ, /ŋa.ren/): Refers to a species of fish with a large head, scientifically Bagarius bagarius. A separate meaning, \"ngā́ren\" (/ŋá.rén/), denotes a congealed fish dish. * Ngāroi (ꯉꯥꯔꯣꯏ, /ŋá.roi/): Represents a species of small freshwater fish, scientifically Crossocheilus burmanicus. Morphology: \"ngā-\" (fish) and \"-roi\" (identifier). * Ngārou (ꯉꯥꯔꯧ, /ŋa.rəu/): Refers to a piece of broiled or fried fish typically served with meals. Morphology: \"ngā-\" (fish) and \"-rou\" (to broil). * Ngāsāng (ꯉꯥꯁꯥꯡ, /ŋa.saŋ/): Refers to a species of small freshwater fish, scientifically Rasbora rasbora. Morphology: \"ngā-\" (fish) and \"-sāng\" (to be long). * Ngāseksā (ꯉꯥꯁꯦꯛꯁꯥ, /ŋa.sek.sa/): Indicates a species of small freshwater fish, scientifically Osteobrama cotio cotio. * Ngāsep (ꯉꯥꯁꯦꯞ, /ŋá.sep/): Describes a small, smooth- skinned freshwater fish, scientifically Mystus bleekeri. Morphology: \"ngā-\" (fish) and \"-sep\" (to be oblique). * Ngāhing (ꯉꯥꯍꯤꯡ, /ŋá.hiŋ/): Refers to the smell of raw fish. Morphology: \"ngā-\" (fish) and \"-hing\" (to be raw). * Ngāhei (ꯉꯥꯍꯩ, /ŋá.həi/): Denotes a type of fish. Morphology: \"ngā-\" (fish) and \"-hei\" (identifier). === Other important terms === * atekpa (ꯑꯇꯦꯛꯄ, /ə.tek.pə/) is an adjective that describes the state of being fresh and raw, typically used for vegetables, fish, and similar items. Morphologically, it is derived from \"a-\", which is an attributive prefix; \"tek,\" meaning \"to be fresh and raw\"; and \"-pa,\" a nominalizer that turns the verb into an adjective. * athongba (ꯑꯊꯣꯡꯕ, /ə.tʰoŋ.bə/) refers to a dish cooked by simmering or boiling, often made with fish or meat. Morphologically, it consists of \"a-\", the attributive prefix; \"thong,\" which means \"to cook\"; and \"-ba,\" a nominalizer that indicates the act of cooking. * ametpa (ꯑꯃꯦꯠꯄ, /ə.met.pə/) is a type of relish usually prepared with chili, salt, dry fish, and potato. Morphologically, it is formed with \"a-\", an attributive prefix; \"met,\" which means \"to press\"; and \"-pa,\" a nominalizer indicating its use as a prepared item. * arakpa (ꯑꯔꯛꯄ, /ə.rək.pə/) is an adjective describing fish or other items caught in a net. Morphologically, it is composed of \"a-\", the attributive prefix; \"rak,\" meaning \"to be caught\"; and \"-pa,\" a nominalizer that turns the verb into an adjective. * ikāngā (ꯏꯀꯥꯉꯥ, /í.ká.ŋá/) refers to fish that emerge on land during the rainy season. Morphologically, it is made up of \"i-\", meaning \"water\"; \"kā,\" meaning \"to climb\"; and \"ngā,\" meaning \"fish,\" collectively emphasizing the behavior of fish climbing from water. * in (ꯏꯟ, /ín/) is a fishing net. The associated verb \"khon-\" (/~ kʰon/) means to trawl with a fishing net, while \"cing-\" (/~ ciŋ/) refers to pulling a fishing net out of water. Morphologically, \"khon-\" comes from the idea of \"to trawl,\" and \"cing-\" implies \"to pull out water.\" * iron- (ꯏꯔꯣꯟ-, /í.ron/) is a verb meaning to prepare a hot relish made with vegetables, chili, salt, and dry fish. Morphologically, it combines \"i-\", meaning \"water\"; \"ron,\" meaning \"to mix\"; and the related noun \"ironba\" (/í.ron.bə/) refers to the final prepared dish. * isit- (ꯏꯁꯤꯠ-, /í.sit/) is a verb meaning to draw water from a pond or similar place for fishing. Morphologically, it consists of \"i-\", meaning \"water,\" and \"sit,\" meaning \"to draw out water.\" * Ukābi (ꯎꯀꯥꯕꯤ, /u.ká.bi/) refers to a diminutive, dark-colored freshwater fish identified scientifically as Anabas testudineus. The morphological breakdown of the term \"ukābi\" includes the elements \"u-\" (tree), \"kā-\" (to climb), and \"-bi\" (a nominalizing suffix), reflecting the fish's association with tree-climbing behavior, a characteristic of the climbing perch species to which it belongs. * utongngā (ꯎꯇꯣꯡꯉꯥ, /u.toŋ.ŋá/) refers to processed dry fish. Morphologically, it is composed of \"u-\", meaning \"tree/wood\"; \"tong,\" meaning \"hollow\"; and \"ngā,\" meaning \"fish,\" describing its preparation and structure. * Kharāi (ꯈꯔꯥꯏ, /kʰə́.rai/) refers to a lattice-like framework crafted from metallic wires, commonly employed in the broiling or grilling of fish and similar food items. Its structure allows for even cooking by suspending the food over heat sources, making it a practical tool in culinary preparations. * Kharung (ꯈꯔꯨꯡ, /kʰə́.ruŋ/) refers to a sizeable earthen vessel traditionally utilized for the storage of water, fermented fish, and other items. Its robust construction and capacity make it a practical choice for preserving and holding contents over extended periods, playing a significant role in culinary and household practices. * Khābak (ꯈꯥꯕꯛ, /kʰá.bək/) denotes a species of freshwater fish. This term is used to refer broadly to such aquatic creatures inhabiting freshwater ecosystems, often significant in local diets and traditional practices. * Khoi (ꯈꯣꯏ, /kʰoi/) refers to a fishhook, a tool utilized for catching fish. The associated verb \"~cop-\" denotes the act of fishing using a hook and line, derived from the morphological components \"~cop-\" meaning \"to set a hook and line.\" Additionally, \"~thā-\" (/~tʰa/) serves as a related term, directing one to the usage of \"khoi cop-\" for a comprehensive understanding of its application. * Khoijāk (ꯈꯣꯏꯖꯥꯛ, /kʰoi.jak/) refers to bait, specifically material placed on a fishhook to attract and lure fish. The morphological composition of the term includes \"khoi-\" (fishhook) and \"-jāk\" (food or cooked rice), indicating its role as sustenance used in the act of fishing. * Khoijei (ꯈꯣꯏꯖꯩ, /kʰoi.jəi/) refers to a fishing rod, an implement used to catch fish. The term is morphologically derived from \"khoi-\" (fishhook) and \"-jei\" (rod), emphasizing its function as a rod designed for attaching a fishhook in the fishing process. * Khoiri (ꯈꯣꯏꯔꯤ, /kʰoi.ri/) refers to a fish line, which is a cord or thread utilized in fishing, typically in conjunction with a fishhook. The term's morphological construction consists of \"khoi-\" (fishhook) and \"-ri\" (a length of something), highlighting its function as an essential component for setting up fishing gear. * Khon (ꯈꯣꯟ-, /kʰon/) is a verb that describes the action of dragging a fishing net beneath the water. ** The related term Khondok (ꯈꯣꯟꯗꯣꯛ, /kʰon.dok/) extends this concept to mean catching nearly all the fish in a pond or similar body of water using a fishing net. The morphological composition is \"khon-\" (to drag a fishing net under the water) and \"-dok\" (Out), emphasizing the exhaustive nature of the act. * cā- (ꯆꯥ-, /ca/) refers to the act of swimming visibly, usually said of fish. Morphologically, it derives from cā‑khat- (/ca.kʰət/), meaning \"to swim visibly‑Up,\" which describes swimming towards the water's surface. * cākhong ngāhongba (ꯆꯥꯛꯍꯣꯡ ꯉꯥꯍꯣꯡ-, /cak.hóŋ ŋá.hóŋ.bə/) refers to an instance of a very good harvest. Morphologically, it combines cāk‑hong (rice/food‑to be cheap) and ngā‑hong‑ba (fish‑to be cheap‑Nom). * tagat tagat (ꯇꯒꯠ ꯇꯒꯠ, /tə.gət tə.gət/) denotes a condition of freshness, particularly said of vegetables, fish, or similar items. Morphologically, it derives from the verb tek (/~ tek/), which means \"to be fresh.\" * tāo (ꯇꯥꯑꯣ, /tao/) refers to a small, black insect typically found in dried fish. Morphologically, the related verb tāo cang- (/~ cə́ŋ/) derives from ~ cang-, meaning \"to enter,\" describing the infestation of such worms. * tāo- (ꯇꯥꯑꯣ-, /tao/) refers to frying, while tāothok- (/tao.tʰok/) describes frying (all fish, etc.), which may be intended for later use. Morphologically, it derives from tāo‑thok-, meaning \"to fry‑Out.\" * tek- (ꯇꯦꯛ-, /tek/) describes the quality of being fresh, particularly said of vegetables, fish, and other similar items. * tharāk (ꯊꯔꯥꯛ, /tʰə.rak/) refers to a type of freshwater fish, scientifically identified as Osteobrama belangeri. * thāngji (ꯊꯥꯡꯖꯤ, /tʰaŋ.ji/) refers to dried pieces of fish or meat. * thu- (ꯊꯨ-, /tʰu/) is a verb that means to catch an animal, bird, or fish in a trap, or to carry roe or eggs internally, typically in the case of fish or snails. * thum- (ꯊꯨꯝ-, /tʰum/) refers to placing a basket-like fishing trap in water. * nungngā (ꯅꯨꯡꯉꯥ, /núŋ.ŋá/) refers to a type of fish with a body covered in soft, whitish scales. Morphologically, it derives from nung‑ngā, meaning \"stone‑fish.\" * pātsel (ꯄꯥꯠ ꯁꯦꯜ, /pát.sel/) refers to the tax paid for fishing in a lake or similar area. Morphologically, it derives from pāt‑sel, meaning \"lake‑money.\" * pātcāba (ꯄꯥꯠꯆꯥꯕ, /pát.cá.bə/) denotes a lessee of a fishery. Morphologically, it derives from pāt‑cā‑ba, meaning \"lake‑to eat‑Nom.\" * pengbā (ꯄꯦꯡꯕꯥ, /peŋ.ba/) refers to a species of freshwater fish. * porong (ꯄꯣꯔꯣꯡ, /po.roŋ/) describes a freshwater fish with a rounded body covered in fine blackish scales. * pourā (ꯄꯧꯔꯥ, /pəu.ra/) refers to a bamboo pole used as a support in a fishing net. * phādok- (ꯐꯥꯗꯣꯛ, /pʰá.dok/) describes catching nearly all birds, animals, or fish in a habitat, or separating eloped individuals. Morphologically, it derives from phā‑dok-, meaning \"to catch‑Out.\" * phābou (ꯐꯥꯕꯧ, /pʰa.bəu/) identifies a type of dry fish. Morphologically, it derives from phā‑bou, meaning \"to be disheveled‑to put something in the sun.\" * bogrā (ꯕꯣꯒ꯭ꯔꯥ, /bo.gra/) refers to a kind of small black fish. * mathā (ꯃꯊꯥ, /mə.tʰa/) denotes a small heap of vegetables or small fish, typically offered for sale. Morphologically, it derives from ma‑thā, meaning \"NM‑to place/spread.\" * maru (ꯃꯔꯨ, /mə́.ru/) refers to seed, the stone of a fruit, or the bones of fish, chicken, and similar items. Morphologically, it derives from ma‑ru, meaning \"NM‑seed/bone.\" The verb ~ tā- also describes sowing seeds, deriving from ~ tā-, meaning \"to fall.\" * marum (ꯃꯔꯨꯝ, /mə́.rum/) refers to the act of laying eggs, typically in fish or reptiles. Related terms include brooding (~ kon-) or amassing eggs (~ thu-). Morphologically, it derives from ~ kok-, meaning \"to lay.\" * masāigup (ꯃꯁꯥꯏꯒꯨꯞ, /mə.sai.gup/) refers to the fin of a fish. Morphologically, it derives from ma‑sāigup, meaning \"NM‑fin.\" * mahā (ꯃꯍꯥ, /mə́.ha/) refers to young or small fish. Morphologically, it derives from ma‑hā, meaning \"NM‑state of being young.\" * mukāngā (ꯃꯨꯀꯥꯉꯥ, /mu.ka.ŋá/) refers to a small white fish. Morphologically, it derives from mukā‑ngā, meaning \"silk‑fish.\" * mong- (ꯃꯣꯡ-, /moŋ/) describes the action of jumping out of water, usually said of fish. * rou (ꯔꯧ, /rou/) refers to a species of fish, scientifically identified as Cyprinus rohita. * lak- (ꯂꯛ-, /lə́k/) refers to the state of being caught, usually applied to fish in nets. * lu (ꯂꯨ, /lú/) refers to a type of fishing basket. Morphologically, the related verb ~ thum- describes placing such baskets into the water and derives from ~ thum-, meaning \"to place.\" * lukāihi (ꯂꯨꯀꯥꯏꯍꯤ, /lu.kai.hi/) refers to a small boat used in fishing. Morphologically, it derives from lu‑kāi‑hi, meaning \"a kind of fishing basket‑to remove‑boat.\" * lubāk (ꯂꯨꯕꯥꯛ, /lú.bak/) refers to a squarish lidded basket often used for carrying or holding fish. Morphologically, it derives from lu‑bāk, meaning \"a kind of basket‑to be broad.\" * lemlei (ꯂꯦꯝꯂꯩ, /lem.ləi/) refers to fish in general but is typically not used colloquially. * long (ꯂꯣꯡ, /loŋ/) describes a portable, rounded fishing net. * long (ꯂꯣꯡ, /lóŋ/) also refers to a fishing tool with a long handle and sharp spikes. * longup (ꯂꯣꯡꯎꯞ, /loŋ.up/) describes a cone-shaped fishing basket with a narrow opening at the top. Morphologically, it derives from long‑up, meaning \"a kind of rounded fishing net‑to cover.\" * lou- (ꯂꯧ-, /ləu/) refers to roasting fish or other similar edibles. * sareng (ꯁꯔꯦꯡ, /sə́.reŋ/) refers to a whitish, smooth-skinned freshwater fish. * sareng khoibi (ꯁꯔꯦꯡ ꯈꯣꯏꯕꯤ, /sə́.reŋ kʰoi.bi/) refers to a kind of small, smooth- skinned fish. * saroi ngāroi (ꯁꯔꯣꯏ ꯉꯥꯔꯣꯏ, /sə.roi ŋá.roi/) denotes an evil spirit or a similar entity. Morphologically, it is composed of sa‑ (animal) and ngā‑roi (fish‑to accompany), emphasizing companionship with animals or fish. * sābuk ngābuk (ꯁꯥꯕꯨꯛ ꯉꯥꯕꯨꯛ, /sá.buk ŋá.buk/) refers to something whose character or appearance is hard to define. Morphologically, it combines sā‑buk (animal‑belly) and ngā‑buk (fish‑belly). * son- (ꯁꯣꯟ-, /són/) is a verb meaning to pull a fishing net out of the water. The related term songat- (/són.gət/) refers to pulling a specific fishing net out of the water. Morphologically, it derives from son‑gat-, meaning \"to pull a fishing net out of water‑Up.\" * hanggen (ꯍꯡꯒꯦꯟ, /həŋ.gen/) refers to a frame made of bamboo to which a fishing net is attached. * hancak ngācak (ꯍꯟꯆꯛ ꯉꯥꯆꯛ, /hən.cək ŋá.cək/) refers to officiousness. Morphologically, it is composed of han‑cak (maggot‑id.) and ngā‑cak (fish‑id.). The related verb ~ sā- refers to causing officiousness and derives morphologically from ~ sā-, meaning \"to make.\" * hentāk (ꯍꯦꯟꯇꯥꯛ, /hén.tak/) refers to crushed or pulverized dried fish. == As food == === In cuisines === Meitei fish cuisines include Ngakup Thongba, Nga Taothong, Nga Toithong or Nga Atoiba Thongba (mashed fish curry), Nganam (steamed fish), and Smoked Fish (Nga Ayaiba). Common types of fish found in almost every Meitei home are Ngari (fermented fish), Hentak (fermented paste), and smoked fish. Meitei cuisine is an everyday favorite for many, showcasing dishes with fermented and smoked fish. Key dishes include: * Kangsoi: A boiled vegetable curry enriched with fermented and smoked fish. * Eromba: A chutney mixed with fermented fish, and optionally, smoked or shallow-fried fish for extra flavor. * Morok metpa/ametpa: A spicy chutney made from chili, Ngari or Hentak, topped with cilantro and onion. * Singju: A traditional vegetable salad made with fermented fish and various vegetables like cabbage, lotus roots, pea leaves, banana stem, Colocasia stem, and spring onions. Meiteis enjoy fresh fish regularly and serve diverse fish dishes during feasts, gatherings, and special events. Popular fish varieties include Indian Major Carps, Exotic Carps, Wallago attu, Clarias spp., Channa spp., and Anabas. In Meitei cooking, spices like maroi nakuppi and maroi napakmpi are commonly used to mask the fishy smell in curries. If the smell is too strong, a small amount of fermented fish (Ngari) is added to neutralize it while enhancing the flavor. == In mythology, folklore and religion == Fish is very important in all stages of life, from birth to death. It plays a key role in every Meitei ritual, celebration, and offering. === Ngaleima === Lemlei Ngaleima or Ngareima is a goddess in Meitei mythology, worshipped as the divine figure representing fish and all forms of life that live in water. Known as the \"fish goddess,\" she holds an important role in the beliefs and traditions of the Meitei people. In ancient Meitei religion, known as Sanamahism, she symbolizes the connection between the spiritual world and the life found in rivers, lakes, and seas.Devi, Lairenlakpam Bino (2002). The Lois of Manipur: Andro, Khurkhul, Phayeng and Sekmai. Mittal Publications. p. 14. ISBN 978-81-7099-849-5.The Eastern Anthropologist. Ethnographic and Folk Culture Society, U.P. 1974. p. 40. Lemlei Ngaleima is considered a sister (or a close friend) to other significant goddesses like Phouoibi, Thumleima, and Ereima, who are also important figures in Meitei culture and mythology. These goddesses are seen as companions, each playing their own special roles in the spiritual stories of the Meitei people. Through Lemlei Ngaleima, the Meitei people honor the natural world, particularly the life that thrives in water. === Loktak === Loktak Ima or Loktak Lairembi, a mother goddess, is believed to be the one who takes care of the fish in Loktak Lake. According to traditional Meitei beliefs, she is responsible for making sure that the fish population is always restored. Even if people catch a lot of fish from the lake, the fish never disappear completely. The goddess ensures that the fish population continues to grow and remain healthy. She is greatly respected and honored by the fishermen communities of the Meitei ethnicity. These communities live in and around the areas surrounding Loktak Lake, and they hold the goddess in high regard for her role in protecting and maintaining the fish population in the lake.Krishna, Sumi (2020-11-29). Agriculture and a Changing Environment in Northeastern India. Taylor & Francis. pp. 78, 79. ISBN 978-1-000-08443-6. === Ngamu === The Meetei Ngamu Thaba, also known as Ushin Shinba, is a Meitei tradition that focuses on protecting aquatic life and preserving biodiversity. Ngamu Thaba involves a fish called Ngamu (Orientalis Schneider), which represents all fish species because of its good health, long life, and energy. The fish is allowed to swim in the water during certain ceremonies, with songs or rhymes, on special dates in the lunar Meitei calendar. ==== Different Practices ==== The Meitei people practice Ngamu Thaba in three main ways: * Meetam Ngamu Thaba: During a Meetei marriage ceremony, two Ngamu fish are released into a pond or river when the bride and groom exchange blessings, wishing them a happy and peaceful life together. * Ushin Nga-Thaba: This practice involves placing a healthy, mature Ngamu fish in water to represent a sick person. The fish is believed to take away the person’s illness and bring them health and happiness. * Chahong-Ngahong Nga-Thaba: In some villages, this version of Ngamu Thaba is done to wish a person good health and a long life, similar to how fish live well in clean water. It is done with the help of a Maiba (a Meitei traditional singer) who sings special rhymes. ==== Biodiversity Conservation ==== Ngamu Thaba is not just a cultural tradition but also helps protect fish and other aquatic species, contributing to biodiversity conservation. ==== Symbolism ==== Ngamu is seen as a special fish in Meitei beliefs. It is thought to have been created by nature before humans, making it a symbol of life and the natural world. === Ngamhai === A small ngamhai fish was swimming in the river when it saw Goddess Phouoibi walking towards the riverbank. Phouoibi didn't know how deep the river was, so she asked a deer on the other side if the water was shallow. The deer lied and said the river was not deep. Phouoibi tried to cross, but she couldn’t swim and began to drown.Roy, L. Somi (2021-06-21). And That Is Why... Manipuri Myths Retold. Penguin Random House India Private Limited. ISBN 978-93-91149-65-9. The little fish noticed Phouoibi struggling and quickly swam to her rescue. It helped her reach the shore of the other riverbank. Grateful for the fish's help, Phouoibi thanked it and gave the fish a special gift. She wished that it would shine brightly like a mirror in the clear water. Phouoibi also hoped that ballad singers would always praise ngamhai fish’s silvery beauty whenever they told its story. === Shareng === In the Meitei folktale of Yenakha Paotapi, a childless couple plays a riddle game, where the winner is rewarded with a Shareng fish (Wallago attu). The husband presents a riddle about a four-spoked wheel, which the wife cannot solve. He explains the answer, and she then asks a riddle about something that cries when fed, which the husband correctly identifies as a \"kaptreng.\" As a result, the wife owes him a fish. The fish serves as a playful prize in their tradition.B. Jayantakumar Sharma; Dr. Chirom Rajketan Singh (2014). Folktales of Manipur. p. 44-50 === Holy and sacred fish === Holy and sacred fishes Associated Meitei clans (of Yek Salai/Meitei confederacy) Romanisation Note(s) Saareng Angaangba/Ngaahei Ningthouja (Mangang) Saareng Luwaoba/Ngaamu Luwang Saareng Mureinaba/Ngaatin Khuman Saareng Angouba/Ngaraa Angom Saareng Naapu Moirang (Moilang) Saareng Ngaangna Laangba Kha Nganpa Saareng Sangbaannana Laangba/Ngaaren Chenglei (Sarang / Salang / Salai Leishangthem) == In marriage ceremony == In Meitei marriage traditions, fish symbolize unity and the couple's shared journey. The ceremony starts with the groom's and bride's families releasing a pair of Ngamu (Channa spp.) into a water body. The fish swimming side by side reflects harmony and lifelong unity for the couple. However, if one fish moves away or behaves differently, it's seen as a bad sign. This ritual beautifully ties the natural world to human relationships, showcasing deep cultural values. In Meitei wedding traditions, the bride is gifted a special bamboo-woven basket called Ngarubak or Lubak, containing at least seven varieties of smoked fish. This gift marks the beginning of her new chapter. The basket usually includes Channa spp. (Ngamu), Pangio pangia (Nganap), Cirrhinus reba (Ngaton), Danio aequipinnatus (Ngasang), Lepidocephalichthys guntea (Nganap), Eutropiichthys vacha (Ngahei), Systomus sarana (Nganoi), and Amblypharyngodon mola (Muka nga). Each fish is chosen for its symbolic meaning based on its local name: * Nganap (Pangio pangia) represents lifelong togetherness. * Ngasang (Danio aequipinnatus) signifies progress. * Ngahei (Eutropiichthys vacha) stands for excellence. * Nganoi (Systomus sarana) symbolizes wealth and prosperity. These meaningful names are believed to bring blessings and good fortune to the couple. On their wedding night, the newlyweds share Nganap fish (Pangio pangia or Lepidocephalichthys guntea), a tradition symbolizing their bond of lifelong unity. This ritual beautifully intertwines food with blessings and cultural values. === Mapam Chakouba (5th Day Post-Marriage Ceremony) === After a wedding, the bride's family hosts a grand feast for the newlyweds and their families. Key dishes include fish curries made with fresh fish and Eromba (a dish with fermented fish). This event reflects the community's joy, hospitality, and their wishes for the couple's happy future. == In pregnancy and childbirth == === Tha Mapan Sareng Pijaba (Third Trimester Pregnancy Ceremony) === During the expecting mother's 9th month, her parents organize a feast at their home to ensure her well-being. The feast features Wallago attu (Meitei-Sareng), a freshwater catfish, which is exclusively prepared for the mother-to-be. Leftover bones or scraps are ceremonially buried, symbolizing respect and care for the mother and unborn child. === Eepan Thaba (Post-Birth Inaugural Ceremony) === On the 6th day after a baby's birth, a purification ceremony for both mother and child is held. It begins with offerings placed where the morning sunlight touches the floor, dedicated to Korouhanba, the Meitei sun god. Offerings include garlands of dried fish like Ngakha (Pethia ticto), Phabou (Puntius chola), meitei-thum (salt cake), and ginger. Additional offerings to Emoinu, the Meitei goddess, include raw rice, chili, fruit leaves (heibi mana), Colocasia stems (yendem), and dried Ngamu (Channa spp.). A Maibi (Meitei priestess) prepares Singju (a salad) on plantain leaves while softly uttering 'ku-ku-ku,' mimicking feeding sounds to bless the baby with a long and healthy life. === Post-Partum Dietary Practice === After childbirth, Meitei mothers avoid oil-cooked foods and consume smoked or dried fish with salt and steamed rice for up to 12 days or longer. Fermented products like Ngari are avoided, but fresh Hentak is allowed due to its shelf life and non-fermented nature. Indigenous fish species like Pethia meinganbii and Pethia manipurensis are believed to aid the mother’s healing during this period. The care for the mother reflects a belief that her skin is as delicate as her newborn’s. === Chagumba (First Food Feeding Ceremony) === This rite of passage marks an infant's first intake of solid food, usually at around six months. A priest or priestess selects an auspicious date for the ceremony. Soft rice, made with boiled rice, milk, and sugar, is prepared by the mother or grandmother. It’s a festive occasion with family, friends, and neighbors celebrating with various fish dishes. == In death ceremony == === End-of-Life Ritual (Nga Tangba) === In Meitei culture, family members follow a vegetarian diet from the time of a loved one’s death until the death ceremony, typically held on the 12th or 14th day. Following this, the Nga Tangba ceremony marks the return to non- vegetarian meals. A variety of fish dishes are prepared as part of this ritual, signifying closure and transition. == In traditional festivals == === Imoinu Iratpa === Dedicated to Imoinu (Emoinu), the goddess of wealth and prosperity, Imoinu Iratpa (also spelled as Emoinu Eratpa) festival reflects the cultural importance of fish. Sareng (freshwater catfish) or any white- colored fish and eels are the preferred offerings. Since Sareng is costly, wealthier individuals typically provide it, while others offer white or light- colored fish, showcasing the goddess's fairness and inclusivity, embracing both rich and poor. The festival is observed every year on the 12th day of the Meitei lunar month of Wakching, which usually falls in January. === Ningol Chakkouba === This annual festival strengthens the bond between married daughters (Ningol) and their paternal families. It revolves around a feast (Chakouba) featuring fish dishes, with fish curry made from premium varieties like Wallago attu and large-sized carps as the centerpiece. Fish farmers prepare for the festival by stocking ponds, while natural water bodies like Loktak Lake are often replenished with fish seeds to ensure ample supply for the celebration. === Cheiraoba === Celebrated as the New Year in the Meitei calendar, Sajibu Cheiraoba includes offering Channa orientalis (Ngamu fish) to the Meitei deities. This ritual seeks to ensure the family's well-being and protect them from misfortune, marking a fresh start to the year with hope and positivity. On Cheiraoba, the priest (Maiba) performs the Usin divination ritual with Ngamu fish in front of Lainingthou Sanamahi to protect each family member from misfortune. The fish is then released into a pond. The priest observes its movement—if the fish stays calm and swims straight, it is considered a positive sign for the individual's fortune. === Saroi Khangba (Ritual to Appease Dark Gods) === Observed during the month of Lamta (March), Meiteis believe dark gods hold stronger influence. On the first and last Saturdays of this month, women perform Saroi Khangba by offering mixed vegetable dishes like banana stem (laphu) and Colocasia stem (yendem), combined with fermented fish (Ngari) and smoked fish. The ritual takes place at the boundary of villages or colonies and serves as a symbolic act to appease the dark gods, substituting human lives and ensuring harmony and protection. == In earthquake == The Meitei people have a unique tradition tied to earthquakes. During such events, they utter the word \"chak-nga,\" which translates to \"rice-fish.\" This reflects their belief that rice and fish, essential for survival, should always be available during times of crisis. From a young age, children are taught to recite this word as a prayer to God whenever an earthquake strikes, emphasizing the cultural significance of resilience and sustenance in challenging times. It's a powerful reminder of the role food plays in their traditions and values. == In popular culture == === Emoinu Fish Fest === The Emoinu Fish Fest or Imoinu Fish Fair, held every January at Hapta Kangjeibung, offers around 80,000 kilograms (in 2025), 50,000 kg (in 2023) of fish for religious and everyday needs during the Imoinu Iratpa festival. It also provides seasonal fruits and vegetables for rituals. Popular fish like Sareng are sold at affordable prices. Celebrated on the 12th day of the Meitei lunar month of Wakching, this fair honors Emoinu (Imoinu), the goddess of wealth, while supporting traditions and local farming. == Gallery == Wooden artworks of aquatic creatures, displayed in the Joysana Retreat, a resort in Oinam town, near Nambol town, in Manipur state (Kangleipak) 02.jpg Nga Ataoba (alias Nga Atauba, Ngaa Taoba, Ngaa Tauba) - traditional Meitei oil fried fish dish - Classical Meitei cuisine 03.jpg ꯄꯦꯡꯕꯥ.jpg Ingredients for making traditional Meitei food, Eromba (alias Iromba, Eronba, Ironba) - Classical Meitei cuisine of Kangleipak.jpg Ngari aka fermented fish..JPG Nga Ataoba (alias Nga Atauba, Ngaa Taoba, Ngaa Tauba) - traditional Meitei oil fried fish dish - Classical Meitei cuisine 02.jpg Makoi Fampak, a place for ornament fish view, in the Joysana Retreat, a resort in Oinam town, near Nambol town, in Manipur state (Kangleipak) 02.jpg Smoked freshwater fish.JPG Kangla Thon 7 Thollangmei.jpg Makoi Fampak, a place for ornament fish view, in the Joysana Retreat, a resort in Oinam town, near Nambol town, in Manipur state (Kangleipak) 01.jpg Nga Ataoba (alias Nga Atauba, Ngaa Taoba, Ngaa Tauba) - traditional Meitei oil fried fish dish - Classical Meitei cuisine 01.jpg == Related pages == * Lai Haraoba * Meitei martial arts * Meitei traditional games * Meitei traditional toys * Meitei traditional weapons == References == Category:Meitei culture Category:Foods Category:Fish",
 "title": "Fish in Meitei culture"
}