{
 "id": "1177849",
 "text": "Johnny Quick is the name of several fictional characters in the DC Comics universe, primarily associated with the Crime Syndicate, an evil counterpart to the Justice League. They first appeared in The Flash #163 in 1966 and were created by writer Gardner Fox and artist Carmine Infantino. == Fictional character biography == Johnny Quick is an alternate universe version of the superhero Flash, often depicted as a villain due to his role within the Crime Syndicate, a team of supervillains that is the evil counterpart to Earth's heroes. The Crime Syndicate hails from an alternate universe known as Earth-3. == Powers and abilities == Johnny Quick possesses super-speed, which he gains through his connection to a mysterious formula known as the Speed Force. The formula allows him to reach incredible speeds, allowing him to run at light speed, perform superhuman feats, and even defy gravity. Unlike the Flash, whose connection to the Speed Force is more innate, Johnny Quick's use of the formula is more akin to a reliance on an external power source. == Personality == Johnny Quick is typically portrayed as ruthless, cunning, and egotistical, reveling in his speed and often showcasing a disregard for others. His motivations usually revolve around power, control, and dominance over heroes and society. == Appearance == He is often depicted wearing a costume that resembles that of the Flash but features darker colors, typically red or black, with lightning motifs that emphasize his speed. As a member of the Crime Syndicate, Johnny Quick often clashes with superhero versions of characters like the Flash and other members of the Justice League. The Crime Syndicate itself serves as a commentary on the morality of heroes and villains, with Johnny Quick representing the darker aspects of speed and power. == In other media == Johnny Quick has appeared in various comic storylines, including the Crisis on Infinite Earths series and the more recent Forever Evil event, where the Crime Syndicate makes a significant impact on the DC Universe. Overall, Johnny Quick serves as an interesting foil to the Flash and embodies the archetype of the villain with super-speed, mirroring the struggles and complexities of speedsters in the DC Comics canon. Category:DC Comics characters Category:Fictional characters introduced in 1966",
 "title": "Johnny Quick (Crime Syndicate)"
}