{
 "id": "1177433",
 "text": "RKO Network Inc., also known as the RKO Network and simply RKO, is an American commercial broadcast television network owned by the RKO Networks Group division of RKO Media. The network is headquartered in (at RKO Square New York), with additional production facilities in (at RKO Square Los Angeles). == History == === Origins === Throughout the mid-20th century, Radio-Keith- Orpheum sought to launch its own television network to compete with the and networks, a fight which itself was part of a larger competition with , , and . However, the company struggled to enter the television broadcasting industry due to its ownership constantly shuffling and frequent financial issues. Both DuMont and Paramount were shut down in 1956, Despite the problems Radio-Keith- Orpheum had at the time, it saw the situation as advantageous. Robert F. Parker, the chairman of the company at the time, immediately began planning to launch a television network. However, plans were delayed when Radio-Keith- Orpheum was split into RCA-Scripps and RKO Enterprises, followed by the sudden death of CEO Francis Jergens. Preparing for the oncoming network launch, RKO Enterprises launched WRKO-TV in , on January 6, 1957; it was followed not long after by the April 29, 1957 launch of KRKO-TV in , . === 1958–1966: Launch and early years === The network itself was launched on August 28, 1958, just in time for the 1958–59 television season. Its first telecast was at 8:00 pm EDT, which was a live broadcast of then-chairman of RKO Enterprises Roger F. Larson in RKO's New York studios inaugurating the network. In his 1994 book Radio- Screen-Program: The Story of the RKO Network, Larson describes the only network-wide programming as \"idents, promos showing what was to come, and some more of those idents\". In its early years, RKO was an innovative and creative network. It broadcast programs across numerous genres, many of which were produced by RKO Television Productions (now RKO Pictures Television). The network also pioneered in television shows aimed at minority audiences and featuring minority performers, which was very uncommon at the time. Among these programs were The Janice Howard Show, a talk show starring African American actress Janice Howard; The Stevie & Tommy Hour, a variety show hosted by Native American comedic duo Stephen \"Stevie\" Whitcombe and Thomas \"Tommy\" Fasthorse; and Eddie and Carlos, a sitcom starring Cuban American actor/comedian Luis Diego Gomez and Mexican-American actor Javier Derbez. In addition, it broadcast the TV version of The Tumblers' sketch comedy show. A lot of early RKO Network programming was recorded in at WGKI-TV to cut costs. As of June 1966, the network already had 143 stations nationwide, ten of which were owned-and-operated. RKO Enterprises ultimately saw it as profitable, which led to RCA-Scripps wanting its own broadcast television network. RKO Enterprises and RCA-Scripps were reportedly in talks about merging the RKO Network with RCA-Scripps' network, but in the end, nothing came out of their discussions. === 1966–1982: Rising viewership, differentiation in programming === The 1966–67 television season saw RKO experience an unexpected rise in viewership, possibly due to seven new stations joining the network. Another cited reason is the premiere of the popular sci-fi comedy series Aliens Abroad, which many sources call one of RKO's best series of all time. Now considered a \"classic\", it ran for six seasons until 1972, which at the time was considered long for an RKO show. This season also saw the premiere of the popular sitcom The Morgan Hewitt Show, starring actor and comedian Morgan Hewitt. The late 1960s and early 1970s saw an even greater expansion of its audience, caused in part by long runners such as Aliens Abroad, Southern Country (1969–1978), One Family (1969–present), The Peter Quimby Show (1970–1980), and MacArthur (1973–1983). On September 22, 1968, George Beckingham became the anchor of RKO National News, continuing his run as one of the most popular and trusted news anchors in the United States throughout his tenure. In 1970, Thomas Theodore, the President of the RKO Network since 1966, left the network; his position was left to former Vice President Kevin Levitz. According to his autobiography The Story of Me, Kevin Levitz, he sought to diversify the RKO lineup for the 1970–71 season, specifically by adding game shows, soap operas, and more variety shows. That season, RKO began airing The Five Grand Quiz, a game show; Family and Friends, a long-running daytime soap opera; and Laughs and Music, a variety show that was canceled after two seasons. During the \"Levitz era\" of the early to mid-1970s, some RKO stations in mini-major markets did away the network and became independent stations. RKO attempted to bring them back by airing during the 1975–76 season, prompting many remaining stations to \"reshuffle\" their schedules to air more news programming late at night. Overall, it created a corporate disaster that brought the entire network's ratings down and resulted in more stations leaving the network. Levitz \"left the network in shame\" in August 1976, and was replaced by John S. McLean. McLean significantly changed the network's stations' program schedule to primarily locally produced content in the morning and early evening. He was also responsible for choosing the network's new slogan, \"The One to Watch\", for the 1976–77 TV season. The campaign would also be used for the 1977–78, 1978–79, 1979–80, and 1980–81 seasons. The 1981–82 season saw the slogan change to the \"The One for You\". Ratings success continued on for the next few years, including shows such as Beginnings (1979–present). === 1982–1992: \"The '80s Network\" and subsequent reparations === In September 1982, ahead of the 1982–83 season, RKO received a major rebrand. It was given the nickname \"The '80s Network\", and the idents and promos were all \"modernized\" for the 1980s, using music and neon graphics. During this period, President John S. McLean canceled many popular shows on the network—most notably the sitcoms Roberta (1977–1982) and The Nicolsons (1979-1982), the sci-fi action series Battleship (1979–1983), and the fantasy drama Cinderella (1980–1984)—were canceled for not being \"cool\" or \"fresh\" enough for the 1980s. (Cinderella would later be renewed for a fifth and final season in , and The Nicolsons would be picked up by and run for three more seasons there.) RKO was extensively criticized for these changes, as they were often cited as misguided attempts at remaining \"relevant\". Individual shows, along with the idents and promos, were also criticized for their loud music and gaudy graphics. The situation became so severe that John S. McLean received death threats commanding him to revert the network to its previous state. The 1982–83 season saw ratings decrease significantly, in part due to trendy new shows that were \"made for the '80s\" pushing attention away from RKO and toward other networks. At this point, the network's structure was further divided, with media proprietor Lester MacGregor becoming the president of the entertainment division. Most of the network's programming was sitcoms at this point due to all the cancellations, but MacGregor sought to fix this issue by picking up more dramas, talk shows, and variety shows. MacGregor did not believe in the idea of cancelling shows the moment ratings dropped; rather, he believed moving shows' time slots could improve viewership. For example, the first season of the medical drama series Dr. Stark aired Mondays at 10:00 p.m. , and suffered from low ratings. However, the second season was broadcast Tuesdays at 9:00 p.m., where ratings skyrocketed; the show itself received critical acclaim afterward. For the upcoming 1986–87 season, MacGregor also wanted those trendy \"modern\" shows cancelled; Harvey & Eddie, one of the few McLean-era shows to be a total success, survived this culling and ran until 1995. Instead, the network saw the fall premieres of two popular shows: the science fiction series Earth Force One and the Saturday night talk show The Winston Grayson Show. This success continued into the late 1980s and early 1990s with Bernadette (1988–1997), The Potters (1990–1998), First Class (1988–1996), Legalese (1990–1997), Locally Grown (1987–1994), Vicente (1987–1991), the daytime soap opera All Day (1990–present), and the teen drama Arborville High (1988–1993), the first series in the long-running Arborville franchise. In 1986, RKO began a tradition of airing the film on , a decision made by MacGregor, who had seen the movie during its original theatrical run and was greatly moved by it. In 1988, RKO Network began broadcasting the annual Golden Note Awards show. === 1992–2005: The Barbeau era === In 1992, MacGregor left the RKO Network as the result of longtime disputes between him and chairman Alvin Kohler, who died later that year. MacGregor was succeeded by Damien Barbeau. Kohler's position was later taken by Robert Gayle III. Barbeau maintained his position for a record-breaking 13 years, leaving the network in 2005. The MacGregor-era hits were reaching the ends of their runs, which made Barbeau extremely nervous. However, not long before he left, MacGregor ordered a 22-episode first season of a sitcom called Fukunaga starring comedian George Fukunaga. Barbeau initially feared that the show would be unsuccessful because its serialized storytelling and all-Asian main cast would turn viewers away. Fukunaga mistakenly accused Barbeau of racism, but Barbeau then clarified that he was accepting of such a show and \"the viewers are the problem\". However, the series' September 1992 premiere was extremely successful; the show was among RKO's ten most-watched series during its second through eighth seasons from 1993 to 2000, with the eighth season being RKO's highest-rated scripted series during the 1999–2000 network television season. The dark fantasy drama Nightfall (1996–2003), which premiered in September 1996, was one of the network's most-watched drama series and helped inspire future vampire and werewolf fiction. The network saw further ratings success with the September 1997 premiere of the science fiction drama Enigma Beach, which emerged as one of the most-watched shows in the network's history. The pilot episode alone garnered 28.9 million viewers, and \"Conclusion\", the series finale, had an audience of 38.6 million viewers. Brandi, a Harvey & Eddie spin-off focusing on Harvey Stephens' niece Brandi, also premiered in September 1997 and became hugely successful, running until 2001. September 1998 saw the debuts of the sitcoms Shake, Rattle & Roll (1998–2006), an adaptation of the British sitcom Goodnight Sweetheart; Arborville: Senior Year (1998–2002), the third series in the Arborville franchise; The Auctioneers (1998–2006), a comedy-drama starring Stewart and Michael Kirkland as a father-and-son auctioneer duo; and Helena (1998–2003), a sitcom starring comedian Helena Stevens and taking place on the set of a fictional North Carolina morning television show, to ratings success, with the former running for eight seasons and the latter becoming the network's highest-rated sitcom by the end of its run. In September 1999, RKO premiered the sitcom South of Something, a vehicle for teen idol Rebecca Summerhayes, which became successful in the ratings and ran until 2005. Unfortunately for RKO, the end of the 1990s also brought about quite a few blunders. The sitcom Marcella—despite being heavily promoted in the weeks leading up to its January 1997 premiere—was cancelled after one 13-episode season due to \"anomalously low\" ratings. Medical drama The Docs and science fiction drama Superhuman, both of which premiered in September 1997, received full-length first seasons but were cancelled thereafter; the former drew in low ratings and the latter was too expensive to continue being produced. The sitcom Antonio's, which premiered in October 1998, garnered fluctuating viewership and caused controversy for its stereotypical portrayal of Italian Americans. It was cancelled after only 11 episodes aired, leaving two of its 13 produced episodes unaired. The action series Showdown was the least watched show among the Big Five networks—NBC, CBS, ABC, , and RKO—during the evening of its January 1999 premiere, was panned by critics, and has been labeled one of the worst TV series of the 1990s. It only ran for 13 of its 18 produced episodes, and the episodes themselves were broadcast completely out of order. Even outside of programming, the network was having problems. In May 1998, controversially acquired a 75% stake in RKO Media, the network's parent and a successor to RKO Enterprises, from then-parent company WJT Enterprises, which led to constant leadership shakeups and company leaders taking roles unannounced. In December of that year, RKO \"forcefully\" acquired the Spanish- language television network LSN for $1.6 billion. The acquisition by Microsoft was followed by constant layoffs and \"subsequent absolute chaos\". In order to prevent further internal chaos, drastic behind-the-scenes changes at RKO Media were set to take place in order to cool down tensions. Hal Glenn, owner and president of RKO Resorts & Hotels, ended up buying RKO Media by the end of September 2001, reuniting RKO General's former media and hospitality assets. Following the RKO Holdings takeover, things began to improve for the RKO Network. In September 2000, RKO's children's programming block rebranded as RKO KidShow, with the block adding both newly-created RKO Animation Studios productions and acquired programming, mainly shows from . A new slate of programming was announced for the 2001-02 season, including Order! (2001–2004), a sitcom taking place on the set of a fictional arbitration-based reality court show, and Moonshadow (2001–2005), a Nightfall spinoff. Midway through the 2002-03 season, RKO picked up a Canadian series named as a mid- season replacement. Although censored to meet a TV-14-DLSV rating, it proved to be an unexpected success for the network, often being considered a \"favorite\" series for their Friday night comedy block, and also began airing uncensored on sister cable channel RKOx. The 2003-04 season saw the debut of Commandant (2003–2009), a political drama which was one of the most successful series in RKO Network history, both ratings-wise and with critics, by the time it concluded, and the police procedural Boys in Blue (2003–2013), which launched the Boys in Blue franchise; as well as that of the teen drama Arborville: The Next Class (2003–2008), which marked several changes for the Arborville franchise, including being the first series to be produced by from the start, the first to be filmed in and the first to use a \"telenovela\" format in the summer months. The anthology crime drama Lawbreakers also reached tens of millions of viewers per episode—the highest-rated episode, \"Anthony\", hit 21.4 million viewers in its original broadcast—but saw a sharp decline in viewership after its first six seasons. For the 2004-05 season, RKO premiered three new sitcoms. The first of these, Judith Lyons' Hometown Heroes, was created and produced by Judith Lyons and made at her studio, and became an immediate success, becoming the second-highest rated show in RKO's Friday night sitcom block and running until 2012. The Royles, an adaptation of the British sitcom , was also successful, running until 2010. Finally, Pastor Sally, an adaptation of the British sitcom , was also successful, running until 2008. Around this time, the network also began broadcasting prime time coverage of games, which helped boost the popularity of their RKO Sports division and boosted the network's overall primetime ratings.",
 "title": "RKO Network"
}