{
 "id": "1177225",
 "text": "William Arturo Muñoz González (born September 29, 1988) is a Mexican luchador (professional wrestler). He currently wrestles for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH) under the ring name Rush. He is a member and the leader of the La Facción Igobernable stable. González has also made appearances in Consejo Mundial de Lucha Libre (CMLL), Major League Wrestling (MLW), Ring of Honor (ROH) (before AEW's purchase), and Lucha Libre AAA Worldwide (AAA). González has held many championships over his career. In CMLL, he was a one-time CMLL World Light Heavyweight Champion, two-time CMLL World Tag Team Champion, one-time CMLL World Trios Champion, two-time Mexican National Trios Champion, the co-winner of the Copa CMLL tournment with Marco Corleone in 2014, and co-winner of the Copa Pachuca with El Terrible in 2012. In ROH, he has been a two-time ROH World Champion. ==Career== ===All Elite Wrestling === At Double or Nothing, Rush was announced as the newest members of the All Elite Wrestling (AEW) roster by Andrade El Idolo. On the July 1, 2022 episode of Rampage, Rush made his AEw in-ring debut. He participated in the 20-man Royal Rampage match but the match was won by Brody King. On the July 6 episode of Dynamite, Rush made his singles debut and defeated Penta Oscuro to earn his first AEW victory. At Fight for the Fallen, Rush challenged Jon Moxley for the interim AEW World Championship but was unsuccessful. Rush as a member of La Facción Igobernable, alongside El Idolo and Dragon Lee, took part in the tournament to crown the first AEW World Trios Champions. The lost to The Elite (Kenny Omega, Matt and Nick Jackson) in the first round on the August 17 episode of Dynamite. At All Out, Rush participated in the Casino Ladder match for a shot at the AEW World Championship in the future but the match was won by The Joker (MJF). On the October 21 episode of Rampage, Rush challenged Orange Cassidy in a three-way match for the AEW All-Atlantic Championship but Cassidy retained. On the November 11 episode of Rampage, Rush fought Bandido in the first round of the eliminator tournament for the AEW World Championship but lost. On July 24, 2023, it was announced that Rush had signed a multi-year contract to stay with AEW. At Full Gear, La Facción Ingobernable participated in a four-way tag team ladder match for the AEW World Tag Team Championships but Ricky Starks and Big Bill retained. Rush then decided to enter the first Continental Classic and was placed in the Gold League. He went 2–3, winning against Mark Briscoe and Jay Lethal while losing to Jay White, Jon Moxley, and Swerve Strickland. On the July 5, 2024 episode of Rampage, Rush accepted an offer from Don Callis to join the Don Callis Family. At Grand Slam, Rush reformed La Facción Ingobernable alongside with his brother Dralístico and The Beast Mortos. On the October 8 episode of Dynamite, Rush and LFI were traded to Jake Roberts in exchange for Lance Archer joining the Don Callis Family. == Personal life == González's father Arturo Muñoz Sánchez was also a luchador under the ring name La Bestia del Ring. Two of his brothers Carlos and Dragon Lee are also luchadors. Carlos is known under the ring name Dralístico.They have 1 son together. == References == ==Other websites== * Category:1988 births Category:Living people Category:All Elite Wrestling people Category:Mexican professional wrestlers Category:Former WWE wrestlers Category:People from Jalisco",
 "title": "Rush (wrestler)"
}