{
 "id": "1177082",
 "text": "Kirikou and Karaba is a musical created in 2007. It is based on the animated movie Kirikou and the Sorceress by Michel Ocelot. == Background == After the success of the animated film Kirikou and the Sorceress in 1998, and its sequel Kirikou and the Wild Beasts in 2005, producer Victor Bosch (Notre-Dame de Paris) had the idea to create a musical adaptation.Kirikou vs. The Lion King, article on the Points d'actu website dated . The project began before the release of Kirikou and the Wild Beasts, at least as early as 2004, among other ideas considered around Kirikou.\"Ocelot Crafts the After-'Kirikou',\" article by Michel Roudevitch in Libération dated . Adapting an animated film into a musical with live actors was not new, as it had already been done with several Disney films, like The Lion King, which had been a lasting success on Broadway since 1997. Due to the success of Kirikou at that time, Victor Bosch had no trouble raising a budget of 4 million euros for the project.\"Kirikou is Going on Stage\", article by Caroline Andrieu in Le Parisien dated . Following the initiative of the director of Maison de la danse in Lyon, British choreographer Wayne McGregor was hired to create the show. The book and songs were written by the creator of Kirikou, Michel Ocelot. The music was composed by Christophe Minck,Artistic team page on the official musical website . with participation from Rokia Traoré and Youssou N'Dour, who had already composed part of the original soundtracks for both animated movies. The sets and costumes were made by Peter McKintosh, and the lights were designed by Lucy Carter.Page \"The Musical\" on the official Kirikou and Karaba website . Kirikou as a child is portrayed by a puppet operated by actor Legrand Bemba-Débert, who also voices the child hero and later plays adult Kirikou.Profile of Legrand Bemba-Débert on the France ô Folies website . The witch Karaba is played by Fatoumata Diawara. == Creation == Kirikou and Karaba premiered on September 11, 2007 at the Maison de la danse in Lyon. The musical then went on tour to several cities in France, including Paris, at the end of 2007 and during 2008. It was notably performed at the Casino de Paris from October 3 to December 31, 2007.\"Aurélie Konaté Plays Josephine Baker, Pookie in 'Kirikou and Karaba',\" article on Grioo.com dated . A second tour was organized starting in May 2009, with new performances at the Palais des congrès de Paris, then across France.https://web.archive.org/web/*/http://www.zoom- cinema.fr/news/2009/5/7/le-succes-de-la-comedie-musicale-kirikou-et- karaba/1389/ Between September 1, 2007 and May 1, 2009, the show welcomed 240000 spectators.https://web.archive.org/web/*/http://www.zoom- cinema.fr/news/2009/5/7/le-succes-de-la-comedie-musicale-kirikou-et- karaba/1389/ == Original soundtrack == The CD version was released with the launch of the musical in September 2007. It features the songs from the show, along with a few additional tracks. # Kirikou, The Child of the World - Angélique Kidjo & Tete # My Baby Will Come - Pookie # I Dan Soko - Oumou Sangaré & Rokia Traoré # Dance of the Fetishes - Compilation # The Water is Here - Compilation # Lullaby Kirikou - Compilation # I Am Progressing - Legrand Bemba-Debert # - Compilation # The Journey of Kirikou - Ali Boulo Santo # Sounds - Rokia Traoré # Dance of the Children - Compilation # Nagama Karaba - Boni Gnahoré & Fatoumata Diawara # I Was Made to Love - Oxmo Puccino & Youssou N'Dour # I Am Going to Adorn Your Body - Youssou N'Dour # - Compilation # Here is My Village - Fatoumata Diawara & Legrand Bemba-Debert # Liberation Percussions - Dom Farkas & Sly Johnson # Celebration - Compilation # Interlude Bambara - Ramses # Kirikou the Brave - Ali Boulo Santo & Mokobé == Notes and References == == Other websites == * Official website of Michel Ocelot * Official website of the musical (archived on Archive.org)",
 "title": "Kirikou and Karaba"
}