{
 "id": "1177946",
 "text": "The Judeo-Masonic conspiracy theory is an antisemitic IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. false claim that there is a secret Jewish–Freemason group controlling the world. * * * * * * This claim was invented by opponents of the French Revolution in 1789. It is common among antisemites worldwide and often appears in their propaganda, which tends to equate Jews with the Freemasons. The false claim formed the basis of the well- known forgery The Protocols of the Elders of Zion, which was adopted by the Nazi German regime in their propaganda to justify the Holocaust, killing at least 6,000,000 Jews across Europe. * * * * * * * * * * * ==Similar conspiracy theories== ===Zionist Occupation Government conspiracy theory=== A similar theory, the Zionist Occupation Government (ZOG) conspiracy theory, accuses Jews of \"controlling Western governments\" to benefit themselves and Israel. This theory is popular among antisemites worldwide, especially Neo- Nazis, White supremacists, Black nationalists and Islamists. * * * * Jews also \"control\" the media and music industry, according to this theory. * * * * * * * Norman Kelly (2005) \"Notes on the political economy of black music\", in R&B;, Rhythm and Business: The Political Economy of Black Music (), Norman Kelly (Ed.), 2005, Akashic Books, pp 12–13. * At an anti-Israel rally in December 2023, Jenny Leong, a New South Wales MP who belongs to the Australian Greens, claimed that an all-powerful \"Jewish lobby\" existed in Australia. She compared its \"influence\" to \"tentacles\". * * * * * * ==Related pages== * Antisemitic stereotypes * Secondary antisemitism * Anti-Judaism and antisemitism * Accusations of Jewish anti-Christianity ==Refereces== Category:Racism Category:Antisemitism Category:Discrimination Category:Disinformation Category:History of Europe Category:Conspiracy theories Category:Antisemitism in Europe",
 "title": "Judeo-Masonic conspiracy theory"
}