{
 "id": "1177889",
 "text": "On 28 March 2025 at 12:50:52 MMT (06:20:52 UTC), a 7.7–7.9 earthquake hit the Sagaing Region of Myanmar, just north of Mandalay. It was the strongest earthquake in Myanmar since 1912. About 5,390 people died in Myanmar and 39 in Thailand; one more person died of shock in Vietnam. Up to 7,860 were injured and hundreds went missing, including workers at a collapsed construction site in Bangkok. The earthquake destroyed thousands of homes, damaged hundreds of apartments in Ho Chi Minh City, and even cracked buildings in Yunnan, China. Over 8,300 monasteries, nunneries and pagodas in Myanmar were also ruined. Both Myanmar and Thailand declared states of emergency. Relief work has been made harder by Myanmar’s ongoing civil war. This was the deadliest earthquake worldwide since the 2023 Turkey–Syria earthquake. == Tectonic setting == Myanmar sits at the meeting point of four tectonic plates, the Indian, Eurasian, Sunda, and Burma plates. Off its coast, a major fault called the Sunda megathrust marks the boundary between the Indian and Burma plates. This fault can be seen from the seafloor in Bangladesh, along the Chin Hills, and up to the eastern Himalayas. Running through Myanmar is the Sagaing Fault, where the Burma and Sunda plates slide past each other at a rate of per year. This fault is the most active earthquake source in the country, passing near popular cities like Yangon, Naypyidaw, and Mandalay. Throughout history, the Sagaing Fault has produced several large earthquakes, with some events reaching magnitudes between 7.0 and 8.0. The southern part of the fault, for example, has earthquake return periods of about 100–150 years, according to studies of past events. The region has experienced powerful earthquakes for centuries. In 1762, a big earthquake with a magnitude between 8.5 and 8.8 happened along the Sunda megathrust. Deep under central Myanmar, earthquakes like the Bagan event (magnitude 7.0) happen within the subducting Indian plate. Researchers have divided the Sagaing Fault into two parts, northern and southern. The southern section, between 16.5° and 23.5° north latitude, is further split into segments with different characteristics. One segment runs under the capital, Naypyidaw, and another, the Meiktila segment, shows mostly horizontal movement with little evidence of recent large earthquakes. The effects of these earthquakes are not confined to Myanmar alone. An earthquake along this fault once caused damage in Bangkok, Thailand, even though the city is about away. Bangkok’s soft marine clay makes its buildings, especially high-rises, more vulnerable to shaking. Concerns about such risks led to the inclusion of basic earthquake safety measures in Bangkok's building codes only in 2007, leaving older structures particularly at risk. ==Impact== ===Thailand=== In Bangkok's Chatuchak district (map), a 30-storey building collapsed (map); The building was under construction for a government agency, Office of the Auditor General.https://www.bangkokpost.com/thailand/general/2990661/probe-ordered- into-shocking-building-collapse. Retrieved 2025-03-30 At least 26 people died and 90 were missing.https://www.bangkokpost.com/thailand/general/2989962/dozens-of- workers-trapped-in-collapsed-bangkok-high-rise. Retrieved 2025-03-28 ==Sources== Category:2020s earthquakes in Asia Category:March 2025 events Category:2020s in Myanmar Category:2025 disasters in Asia",
 "title": "2025 Myanmar earthquake"
}