{
 "id": "1177466",
 "text": "Lamar Hernandez-Thorpe (born 1981) is an American politician who has served as the 41st Mayor of Antioch, California, since 2020. He is a former United States Navy veteran and higher education administrator known for his contributions to public health and local governance. == Early Life and Education == Hernandez-Thorpe was born in 1981 while his mother was incarcerated. Two days after his birth, he was placed into foster care and raised by Mexican immigrant parents in East Los Angeles. His first language was Spanish. Although his foster parents attempted to adopt him, they were unable to do so because his biological mother retained her parental rights. After completing high school, Hernandez-Thorpe enlisted in the United States Navy, where he served for eight years. During his service, he was awarded the Global War on Terrorism Medal and the Global War on Terrorism Expeditionary Medal for his participation in operations following the September 11, 2001, attacks. He was stationed at the Naval Submarine Base in Groton, Connecticut, before being accepted to The George Washington University (GWU) in Washington, D.C. At GWU, Hernandez-Thorpe pursued a double major in Sociology and Women's Studies. In 2006, he was elected President of the university's Student Association, representing over 20,000 students. He later earned a Master of Arts in Women's Studies as a Presidential Administrative Fellow at GWU. == Career == In 2020, Hernandez-Thorpe was elected as the Mayor of Antioch, California, becoming the city’s 41st mayor. His responsibilities as mayor include chairing City Council meetings and representing the city at ceremonial events. He has been involved in various initiatives, including promoting economic development, improving local infrastructure, and addressing the city’s historical discrimination against Chinese immigrants. In March 2023, following the passing of his foster father, Guillermo Hernandez, he officially changed his name to Lamar Anthony Hernandez-Thorpe to honor his Mexican heritage. In 2024, Hernandez-Thorpe participated in a business delegation to China, where he sought to attract investment to Antioch, emphasizing the city’s strategic location and potential for economic growth. == References == Category:American political activists Category:21st-century American politicians",
 "title": "Lamar Thorpe"
}