{
 "id": "1177945",
 "text": "Technofeudalism is a term used to describe a modern economic system where big technology companies have power similar to feudal lords in the past. Instead of land, these companies control digital platforms, data, and online markets. People and smaller businesses rely on these platforms, just like peasants once relied on feudal lords for land and protection. == Origins of the idea == The concept of technofeudalism has been developed by several thinkers who argue that digital capitalism is shifting toward a new kind of economic control. One of the most well-known voices on this topic is Yanis Varoufakis, an economist and former Greek finance minister. He argues that companies like Google, Amazon, Facebook, and Apple do not simply compete in markets—they own and control them, just like feudal lords controlled land in medieval times. French philosopher Cédric Durand also explores this idea in his book Technoféodalisme: Critique de l’économie numérique (2020), where he describes how digital platforms extract wealth from users, workers, and businesses without true competition. He claims that today’s economy is no longer based on traditional capitalism, where businesses compete, but on a system where a few tech giants rule over digital space. Another scholar, Jodi Dean, connects technofeudalism to the rise of \"platform capitalism,\" where workers and users do not own the means of production but rely on tech companies to access work, social connections, and even basic services. These thinkers believe that rather than creating a free and open internet, digital platforms have built a system where power is concentrated in the hands of a few, making it harder for smaller players to succeed. == Key features == Technofeudalism has some similarities to old feudal systems: * Control over platforms – Large companies own and manage platforms like social media, e-commerce, and cloud computing, deciding who can participate. * Dependence on Big Tech – Businesses and workers must follow platform rules to earn money, similar to how peasants depended on lords. * Data ownership – Tech companies collect and use personal data, which gives them more power over users. * Limited competition – A few companies dominate entire industries, making it hard for smaller businesses to compete. == Examples == Som examples of technofeudalism are: * Gig workers – Drivers for ride-sharing apps or delivery services do not own their workplaces but depend on the platforms for income. * E-commerce sellers – Many small businesses sell products on major online platforms, but they must follow the platform’s rules and pay fees. * Social media users – People create content on social media, but the platforms decide who sees it and how much money creators can make. == Criticism and debate == Some experts say technofeudalism makes society less fair because a few powerful companies control most digital activity. Others argue that technology has made life easier, providing more opportunities for businesses and individuals. Governments are now considering new laws to regulate these companies and ensure fair competition. == Future of technofeudalism == Technofeudalism is still a new idea, and economists are debating whether it will replace capitalism or just change it. Some believe that stronger government rules and new technology could create a fairer system in the future. == Bibliography == * Durand, Cédric (2020) Technoféodalisme: Critique de l’économie numérique * Varoufakis, Yanis (2023) Technofeudalism: What Killed Capitalism == See too == * Gig economy * Surveillance capitalism Category:Technofeudalism",
 "title": "Technofeudalism"
}