{
 "id": "1177614",
 "text": "\"Kanimaa\" () is a 2025 Indian song and the second single in the soundtrack of the Tamil-language film Retro, directed by Karthik Subbaraj. Starring Suriya and Pooja Hegde. The track is composed by Santhosh Narayanan, who also sang the track alongside The Indian Choral Ensemble, while the lyrics for the track were written by Vivek. It was released on 21 March 2025 (released on YouTube as a lyrical video song) as the second single from the album, through T-Series. The song was also released in Telugu as \"Bujjamma\" and in Hindi as \"Anarkali\". The song is part of a 15-minute single-shot sequence in the film, blending action, drama, and dance, and has been praised for its vibrant execution and mass appeal. The hook step dance involving Suriya and Pooja Hegde – the lead actors of Retro – became popular. == Background and release == Retro's music, including \"Kanimaa,\" marks the first collaboration between Santhosh Narayanan and Suriya, and the eighth between the composer and director Karthik Subbaraj. The audio rights were acquired by T-Series. \"Kanimaa\" was released on 21 March 2025 as the second single, following the first single, \"Kannadi Poove\". The song's lyrical video, featuring Suriya and Pooja Hegde, was unveiled on YouTube by T-Series Tamil, accompanied by a promotional campaign highlighting its \"90s Kalyaana Kuthu\" (wedding dance) vibe. Choreographed by Sherif Master, the track was designed to evoke nostalgia while delivering a modern festive energy, aligning with the film's tagline, \"Love, Laughter and War.\" == Composition and lyrics == \"Kanimaa\", meaning \"sweetheart\" or \"divinity\" in Tamil, is a high-energy folk-pop song with influences from traditional Tamil wedding music. Santhosh Narayanan's composition features rhythmic beats, layered percussion, and choral backing by The Indian Choral Ensemble. The lyrics, written by Vivek, are playful and romantic, centered around a lover's call to dance and revel with their beloved. Notable lines like \"Gumma, Yemma, Summa, Kanimaa\" serve as vocalizations to enhance the song's catchy hook. The track's structure shifts dynamically, maintaining a lively tempo that complements its wedding setting in the film. Critics and fans have noted similarities to Narayanan's earlier hit \"Rakita Rakita\" from Jagame Thandhiram (2021), citing its ability to sustain energy and engage listeners. through T-Series. The song was also released in Telugu as \"Bujjamma\" and in Hindi as \"Anarkali\".https://www.eenadu.net/videos/playvideo/bujjamma-lyrical-video- retro-suriya-pooja-hegde/2/66862https://www.sakshi.com/telugu- news/movies/suriya-and-pooja-hegde-bujjamma-lyrical-video-song-retro-2407923 == Music video and sequence == The \"Kanimaa\" music video showcases Suriya and Pooja Hegde performing in a colorful wedding scene, with Hegde's fluid dance moves earning her praise as the \"Expression Queen of Kanimaa\" among fans. A notable highlight is a cameo by Santhosh Narayanan, who appears as a spirited dancer, later dubbed \"That One Drunken Uncle at Every Marriage Function\" in viral social media memes. The song is integrated into a 15-minute continuous shot in Retro, a sequence that includes action, drama, and the dance number. The sequence, shot with numerous dancers and supporting artists, has been touted as a technical highlight of the film. == Reception == Upon release, \"Kanimaa\" received positive feedback for its infectious rhythm and choreography. Pooja Hegde's performance further amplified the song’s appeal, with her dance moves drawing comparisons to her previous chartbusters like \"Butta Bomma\" and \"Arabic Kuthu\".https://www.moneycontrol.com/entertainment/pooja-hegde-flaunts- infectious-dance-moves-in-retro-s-new-song-kanimaa-watch-article-12973692.html The track quickly gained traction online, with fans posting videos of themselves recreating the hook step on social media platforms. == Notes == == References == Category:2025 songs",
 "title": "Kanimaa"
}