{
 "id": "1178740",
 "text": "BRAVE Books is a Christian right-wing childrens' series of picture books Penned by Republican members of Congress and Fox News alumni, these books starring anthromorphic animals are against transgender people, critical race theory, \"cancel culture\" and more.https://bravebooks.us/?srsltid=AfmBOopeT_4OKZWZQsaBH0rx- mOuVbA09r0mEfsYn1CHo9CFUVE- Ub9Zhttps://www.foxnews.com/video/6360993322112https://www.foxnews.com/lifestyle/lara- trump-kevin-sorbo-tout-traditional-values-childrens-books-florida-story- hours.amphttps://www.washingtontimes.com/news/2024/aug/26/kirk-camerons-see- you-at-library-draws-packed- crow/https://dailycitizen.focusonthefamily.com/kirk-cameron-and-brave-books- host-see-you-at-the-library-august-24/ There is a planned tv series adaptation called Adventures with Iggy and Mr. Kirk starring Kirk Cameron.https://bravebooks.us/pages/the-adventures-with-iggy-and-mr- kirk?srsltid=AfmBOop0LfEpS9Z0JwCDGGHWCKZ1eeu0EZBvJOW0-HgWs_duHOfi60as The books are: *Saga One: The Origins ** Brave as a Lion by Kirk Cameron (bravery) ** Little Lives Matter by Elizabeth Johnston (abortion) **The Island of Free Ice Cream by :en:Jack Posobiec (socialism) **More Than Spots & Stripes by The Hodgetwins (critical race theory) **Fame, Blame, and the Raft of Shame by Dan Crenshaw (cancel culture) **Elephants Are Not Birds by :en:Ashley St. Clair (transgenderism) **Paws Off My Cannon by :en:Dana Loesch (2nd Amendment) **Son of Truth by Graham Allen (interpreting the truth) **The Fight for Freedom Island by Trent Talbot (defending freedom) **Because You're My Family by Missy Robertson (family values) **Dawn of the BRAVE by :en:Mike Waltz (defending your country) * Saga Two: Iron Chaos **Puddin, Pirates, and the Problem With Power by :en:Robby Starbuck (the consitution) **Unmuzzle Me, Please by :en:DC Draino (free speech) **The Candy Calamity by :en:Zuby (gluttony) **Freedom Day the Asher Way by Dinesh and Debbie D'Souza (America) **Fiona's Fantastical Fort by :en:Julie Banderas (perseverance) **Surfing Past Fear by Bethany Hamilton (overcoming fear) **The Night the Snow Monster Attacked by General :en:Michael Flynn (leadership) **As You Grow by Kirk Cameron (looking to God) **The Adventures of Seymour Clues & Mr. Mouse by Sheriff :en:Mark Lamb (claiming the truth) **Chaos in the Canopy by Trent Talbot (Conservationism) * Saga Three: Tubular **The Parrots Go Bananas! by Sean Spicer (left wing media) **Joining the Amazing Club Awesome Sauce by Sara Carter (following the rules) **Hidden Headlines: A Seymour Clues Mystery by :en:John Solomon (political commentator) (importance of the truth) **Pride Comes Before the Fall by Kirk Cameron (humility) **A Town Worth Defending by David Harris Jr. (defending America) **The Treasure of Cabal Island by :en:Michael Franzese (greed) **The Test of Lionhood by Kevin Sorbo (masculanity) **Chomp Chomp Chomp - The Snapfast Challenge by :en:JP Sears (peer pressure) **The Fox, the Fair, and the Invention Scare by Kirk Cameron (competition) **Too Much Tubular! by :en:Trail Life (moderation) * Saga Four: Dom-A-Tron **The Mouse and The Sea by Heidi St. John (helping) **Happy No Snakes Day by :en:Riley Gaines (standing up) **The Never-Give-Up Pup by Lara Trump (hard work) **One Small Little Voice by Leigh-Allyn Baker (courage) **A Tale of Two Tigers by Trent Talbot (jumping to conclusions) **The Bear Essentials of Fatherhood by Kevin Sorbo (importance of fathers) **Dear Valor by Jep and Jessica Robertson (adoption) **Deep Within Doomsdome by John Amanchukwu (self control) **The Ice Heist by BRAVE Books (adaptability) **Friends Are Good... For Nothing by BRAVE Books (friendship) * Saga Five: Black Heart ** The Return of Black Heart by Brave Books (never losing hope) ** A Monumental Mistake by Julie Banderas (respecting history) ** Attack of the FoxBot! by BRAVE Books (gratitude) ** I Love Black Heart by BRAVE Books (doing what is right) ** Pip's Selfish Sip by BRAVE Books (putting others first) ==References==",
 "title": "BRAVE Books"
}