{
 "id": "1178168",
 "text": "Dhu al-Hijjah (ذو الحجة) is the twelfth and final month of the Islamic calendar. It is one of the four sacred months ( الأشهر الحرم) in Islam, during which warfare is traditionally prohibited. The name “Dhu al-Hijjah” means “Possessor of the Pilgrimage,” referring to the Hajj, the annual pilgrimage to Mecca, which is one of the Five Pillars of Islam. ==Significance== Dhu al- Hijjah is one of the holiest months for Muslims, as it includes several major religious events: Hajj (8th–12th or 13th of Dhu al-Hijjah) – Millions of Muslims from around the world travel to Mecca to perform the pilgrimage, fulfilling a religious obligation for those who are physically and financially able. Day of Arafah (9th of Dhu al-Hijjah) – Considered the most important day of Hajj, pilgrims gather on the plain of Arafat for prayers. For non-pilgrims, fasting on this day is highly recommended and believed to expiate sins of the past and coming year. Eid al-Adha (10th–13th of Dhu al-Hijjah) – Also known as the Festival of Sacrifice, this is the second major Islamic holiday. It commemorates Prophet Ibrahim’s (Abraham’s) willingness to sacrifice his son in obedience to God, and Muslims around the world perform Qurbani (animal sacrifice), distributing meat to the poor. ==Virtues and Practices== The first ten days of Dhu al-Hijjah are considered especially blessed, with many Muslims increasing their acts of worship, including fasting, prayer, and charity.It is recommended to recite Takbir (praises of God) frequently, especially from the 9th to the 13th of the month. Many Muslims perform voluntary fasting on the first nine days, particularly on the Day of Arafah. ==Islamic and Georgian Calendar Context== Dhu al-Hijjah is the last month of the Hijri (lunar) calendar, followed by Muharram, which marks the Islamic New Year. Since the Islamic calendar is lunar-based, Dhu al-Hijjah shifts by about 10–12 days earlier each year in the Gregorian calendar Category:Islamic calendar",
 "title": "Dhu al-Hijjah"
}