{
 "id": "1178265",
 "text": "The Rhineland massacres, or the German Crusade of 1096, were a series of massacres committed against Jews across the Holy Roman Empire (HRE) in 1096 AD. * * * * * * Cities where Jews were killed included Mainz and Speyer ‒ both centers of Jewish cultural life. Historians described the massacres as pogroms or genocidal massacres. ==Background== ===Jews in German lands=== Jews started living in German land in 321 AD under the Roman Empire. They formed the Yiddish-speaking Ashkenazi Jews (Hebrew: יהדות אשכנז) in the Middle Ages, * * * * * * * * who survived centuries of pogroms * * * * * * * * * * and expulsions into the 20th century. ===Systematic persecutions of Jews=== Under the Germanic Frankish Merovingian dynasty between the 5th and 8th century, Jews were banned from working as public servants. * * * * * A succession of ecumenical councils also banned Jews from socializing with Christians or observing the shabbat over the baseless fear that Judaism (the Jewish ethnoreligion) would influence Christians. Systematic persecutions of Jews intensified in the 11th century under the Capetian dynasty, when King Robert the Pious tried to kill all Jews who rejected Christian conversion. Jews across the German land were assaulted, tortured or burned at stakes. The persecutions coincided with the destruction of the original Church of the Holy Sepulchre in Jerusalem by the Fatimid Caliph Al-Hakim bi-Amr Allah in 1009, which was exploited by Benedictine monk Rodulfus Glaber to spread rumors about Jewish \"involvement\" in the destruction. These happened over the decades until the Rhineland massacres. ==Events== ===Massacres of Jews across the Holy Roman Empire=== The first massacres happened in Germanic Frankish land. Jewish historian Solomon bar Simson stated in the Hebrew Chronicles that Godfrey of Bouillon, one of the First Crusade's Catholic leaders, made their intention clear: A piece of anonymous work about the first massacres wrote: The massacres also came with looting of Jewish food and property by the Catholic Crusaders, with the Jews subject to attempts of forced conversion to Catholicism. Some Catholic Crusaders, including the Peter the Hermit, got what they wanted by extorting the Jews, some of whom barely survived the massacres by accepting forced baptism. ====Massacres of Jews in Regensburg==== Instances of forced baptism were reported in Regensburg, where some Catholic Crusaders forced the Jews into the river Danube for the baptism. American historian David Nirenberg (b. 1964), specialized in the history of antisemitism, wrote:David Nirenberg, 'The Rhineland Massacres of Jews in the First Crusade, Memories Medieval and Modern', in Medieval Concepts of the Past: Ritual, Memory, Historiography, pp. 279–310 Other massacres happened in Cologne, Saxony and Prague in Bohemia, ruled by the HRE back then. Some historians claimed that the Roman Catholic Church tried to stop the Crusaders from killing Jews, though the level of opposition to the massacres was unclear * Chazan, Robert. \"Medieval Antisemitism.\" In History and Hate: Dimensions of Anti-Semitism, ed. David Berger, 60–77. Philadelphia: Jewish Publication Society, 1986. * Chazan, Robert. God, Humanity, and History: The Hebrew First Crusade Narratives. Berkeley: University of California Press, 2000. * Franke, Daniel P. \"The Crusades and Medieval Anti-Judaism: Cause or Consequence?\" In Seven Myths of the Crusades, ed. Alfred J. Andrea and Andrew Holt, 48–69. Indianapolis: Hackett Publishing Company, 2015. * – due to widespread antisemitism in society. Catholic historiography tends to emphasize individual clergy attempts to stop the massacres. The Catholic Crusaders continued killing as they believed that those who asked them to stop had been bribed by the Jews. Hugo of Flavigny, a Benedictine monk, reportedly wrote: ====Massacres of Jews in Cologne and Mainz==== Albert of Aachen (c. 1100), a priest and the guardian of the church of Aachen, described the horror of the massacres of Jews in Cologne and Mainz: * Kenneth Stow, \"Conversion, Apostasy, Apprehensiveness: Emicho of Floheim and the Fear of the Jews in the Twelfth Century,\" Speculum, vol. 76, no. 4 (October 2001): 911–33 at 915. * Albert of Aachen, \"The Peasant’s Crusade,\" 47; Albert of Aachen does not include Drogo of Nesle in his narrative, however other histories place him there, see Conor Kostick, \"Iuvenes and the First Crusade (1096–99): Knights in Search of Glory?\" The Journal for Military History, vol. 73 (April 2009): 177–208. * Daniel P. Franke, \"The Crusades and Medieval Anti-Judaism: Cause or Consequence?\" in Seven Myths of the Crusades, 48–69, ed. Alfred J. Andrea and Andrew Holt (Indianapolis: Hackett Publishing Company, 2015), 52; Malkiel, \"Destruction or Conversion,\" 262. Albert of Aachen also noted that many Jews killed themselves, while the local Bishop fled without fulfilling his promise to protect the Jews as he blamed the Jews for his danger. Albert's narrative was shared by Jewish historian Solomon Bar Samson.Solomon Bar Samson, The Massacres of Jews, 49. Solomon Bar Samson wrote that the massacres happened before the Jews were even offered conversion. The local Bishop sent a messenger to the survivors, including Kalonymos ben Meshullam, and blamed them for their own suffering by repeating the claim that the Jews killed Jesus, asking them to convert to Christianity. Some Jews committed mass suicide instead of converting to Christianity, while some did so after forced baptism and the end of the massacres. The scale of the mass suicide remains unclear. ===Massacres of Jews in other regions=== ====Massacre of Jews in Jerusalem==== When the Catholic Crusaders took over the Muslim-ruled Jerusalem, * Kedar, Benjamin Z. \"The Jerusalem Massacre of July 1099 in the Western Historiography of the Crusades.\" The Crusades. Vol. 3 (2004) (), pp. 15–76, p. 64. Edward Peters, ed. The First Crusade. 2nd ed. University of Pennsylvania, 1998, p. 264–272. * Hamilton Alexander Rosskeen Gibb. The Damascus Chronicle of the Crusades: Extracted and Translated from the Chronicle of Ibn Al-Qalanisi. Dover Publications, 2003 (). * Saint Louis University Professor Thomas F. Madden, author of A Concise History of the Crusades in CROSS PURPOSES: The Crusades (Hoover Institute television show, 2007). most Jews were slaughtered. Many Jews were burned alive in synagogues by Crusaders who knew that they were inside. The minority of Jewish survivors were either expelled or taken hostage. The Letter of the Karaite Elders of Ascalon from the Cairo Geniza states that some important Jews kidnapped by the Catholic Crusaders were let go when Ascalon's Karaite Jews paid the cash ransom (Pidyon shevuyim).Goitein, S.D. A Mediterranean Society: The Jewish Communities of the Arab World as Portrayed in the Documents of the Cairo Geniza. Vol. V: The Individual: Portrait of a Mediterranean Personality of the High Middle Ages as Reflected in the Cairo Geniza. University of California Press, 1988 (), p. 374-379 ==Motives== The Hebrew Chronicles stated that the massacres of Jews were pre- planned by Count Emicho of Flonheim: However, other primary and secondary sources contradicted the claim, arguing that the massacres happened in chaos. Despite Roman Catholic Church's historical policy of converting Jews to Christianity, * * * which was not officially stopped until 1965 AD, some historians claimed that Albert of Aachen opposed the massacres. Albert of Aachen is said to have written: The said historians also claimed that the Crusades were not antisemitic IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. in nature by pointing to the lack of mentions of the Rhineland massacres in church historians' writings, despite unclear correlations between the two. ==Related pages== * Babi Yar * Iași pogrom * Odessa massacre * Antisemitism in Europe * The Holocaust in Croatia ==References== Category:Terrorism Category:Massacres Category:Catholicism Category:Middle Ages Category:Jewish history Category:History of Europe Category:Holy Roman Empire Category:Antisemitism in Europe Category:History of Christianity",
 "title": "Rhineland massacres"
}