{
 "id": "1178646",
 "text": "Anti-suffragism was a political movement that opposed women's suffrage in countries such as Australia, Canada, Ireland, the United Kingdom and the United States from late 19th century through the early 20th century. Anti- suffragism was associated with the traditional conservative movement that sought to keep the status quo for women, and domestic variants of conservative feminism, which is the belief that women had the right to complete freedom within the home as wives and mothers. Anti-suffragists also argued that women's roles were primarily domestic and that granting them the right to vote would disrupt the family unit and societal order. == Origins == === Key Arguments and Beliefs === ==== Women's Role: ==== Anti-suffragists strongly believed that women's place was in the home, focusing on their roles as wives, mothers, and homemakers, arguing that suffrage would distract them from their traditional roles. ==== Fear of Social Disruption: ==== Anti-suffragists feared that granting women the right to vote would lead to social chaos, a breakdown of the family unit, and a loss of women's traditional privileges and protection. ==== Moral Authority: ==== Anti-suffragists believed that women's moral authority would be undermined if they became involved in politics. ==== Lack of Political Capacity: ==== Anti-suffragists argued that women lacked the knowledge and were not capable of making rational political decisions, arguing that women would be swayed by emotion rather than logical reasoning. ==== Political Corruption: ==== Anti-suffragists argued that politics was corrupt and messy and that women should not be exposed to it or be involved in it. ==== Maintaining the Status Quo: ==== Anti-suffragists often opposed suffrage because they feared that it would lead to social change and a loss of traditional values. ==== Societal Influence: ==== Anti-suffragists believed that women could influence society through their roles as wives and mothers, rather than political participation. ==== Declining to Vote: ==== Anti- suffragists argued that most women did not want the vote, because they took care of their homes and children, and that women did not have time to vote or stay updated on politics. Opposition to Military Service: Anti-suffragists believed that if women were granted the right to vote, they would be subject to the same civic duties to be required to serve in the military, just like men, especially during times of war. Opposition to Workforce: Anti-suffragists believed if the suffrage was granted that women would be pressured to entered the workforce and work outside their homes, leading them to abandon their domestic duties as wives and mothers. == Famous anti-suffragists == Prominent anti-suffragists included Josephine Jewell Dodge, Annie Nathan Meyer, and Mary Augusta Ward, who opposed women's right to vote, often arguing for women's traditional roles and against the perceived disruption of the family unit. Josephine Jewell Dodge: Founder and president of the National Association Opposed to Woman Suffrage in 1911. Her father, Marshall Jewell, served as governor of Connecticut and U.S. postmaster general. Annie Nathan Meyer: A writer, philanthropist, and founder of Barnard College. Mary Augusta Ward: A successful author, she founded the Women's National Anti-Suffrage League in 1908. Ida Tarbell: A investigative journalist who opposed women's suffrage. Catharine Beecher: An advocate for women's education and economic advancement. == Notable anti-suffrage organization == Several organizations opposed women's suffrage in the United States, including the National Association Opposed to Woman Suffrage (NAOWS), the New York State Association Opposed to Woman Suffrage, and the Massachusetts Association Opposed to the Further Extension of Suffrage to Women. ==References== Category:Misogyny Category:Political movements Category:Political organizations Category:Antifeminism",
 "title": "Anti-suffragism"
}