{
 "id": "1178804",
 "text": "The Manipur Levy was the first standing army established in Manipur. It was formed during the Manipur national struggle against Burmese rule, which occurred during the period known as the Chahi Taret Khuntakpa (1819–1826 CE). The Manipur Levy played a critical role in the resistance against Burmese occupation and the eventual liberation of the kingdom. The army was established under the leadership of Maharaj Gambhir Singh, who is recognized as a key figure in the national movement and a significant contributor to the formation of modern Manipur. == Background == === Burmese Occupation of Manipur === The early 19th century marked a period of political instability in Manipur, primarily due to the expansionist policies of the Burmese Empire. This instability facilitated Burmese intervention in Manipur’s internal affairs, particularly during the reigns of Maharaja Bhagyachandra’s successors. During the reign of Chourjit Singh, the third successor of Maharaja Bhagyachandra, a conflict arose when his brother, Prince Marjit Singh, rebelled and fled to Ava (present-day Yangon, Myanmar). With support from the Burmese emperor Bawdawpaya, Marjit Singh invaded Manipur, defeated Chourjit Singh, and ascended to the throne with Burmese assistance. However, after six years of rule, Marjit Singh was overthrown by the Burmese, who imposed a harsh regime. He fled to Cachar along with a large number of people. In 1819, the Burmese formally occupied Manipur and established control over the kingdom for seven years. This period was marked by widespread hardship, including the forced deportation of approximately 30,000 Manipuri prisoners to Ava. The population of the valley significantly declined, with estimates suggesting that only 2,000 to 3,000 individuals remained during the height of the Burmese occupation. Many inhabitants fled to the surrounding hills, particularly the western hills of Tamenglong, seeking refuge in the safer territories of Cachar. Manipur was administered by two Burmese commanders during this period. Despite the military presence, the Burmese faced significant challenges due to the lack of local support and insufficient supplies. The Manipuri population resisted Burmese rule through organized efforts led by various local leaders, including Prince Herachandra, Prince Yumjaotaba, and Maharaj Gambhir Singh, among others. This resistance was instrumental in the eventual expulsion of the Burmese and the restoration of Manipur’s sovereignty. === Manipuri Princes in the Kingdom of Cachar === Following the usurpation of the throne of Manipur by Marjit Singh in 1813, his brothers Chourjit Singh, Gambhir Singh, and another prince sought refuge in the neighboring Kingdom of Cachar. During Marjit Singh’s invasion of Cachar in 1819, Chourjit Singh and Gambhir Singh allied with Govind Chandra, the reigning king of Cachar. After his defeat and subsequent retreat to Cachar, Marjit Singh formally relinquished his claim to the throne of Manipur, along with the symbolic royal images of Govindajee and Brindavan chandra. This gesture suggested a temporary reconciliation among the royal brothers. However, Govind Chandra was characterized as a weak and ineffective ruler. With the support of their respective followers, the three brothers divided the territory of Cachar among themselves. Raja Govind Chandra eventually fled to the British-controlled region of Sylhet, seeking protection from the East India Company, which declined his request. By 1823, Chourjit Singh established his authority in Sonaimukh, south of present-day Silchar, Marjit Singh was confined to Hailakandi, and Gambhir Singh maintained his headquarters at Bikrampur, near Badarpur. Despite the strategic advantage, the princes remained politically divided. Chourjit Singh and Marjit Singh later retreated to Sylhet, while Gambhir Singh, with the assistance of his distant cousin Nara Singh, continued to seek British support in efforts to reclaim Manipur from Burmese control. === Burmese Threat to the British India === ==== David Scott’s Strategic Response ==== Following the conquest of Manipur, Burma extended its control over Assam and the entire Brahmaputra Valley. Additionally, Burma annexed Arakan, located adjacent to the Chittagong Hills in Bengal. This territorial expansion by Burma posed a significant threat to British interests in Bengal and the northeastern frontier of British India. In response to this threat, David Scott, the Agent to the Governor-General for the North Eastern Frontier, anticipated that Burmese forces might advance from Manipur and Assam toward Cachar, with the possibility of further advancing into Sylhet and Bengal. In the political context of the time, Raja Govind Chandra of Cachar, unable to secure British protection, invited the Burmese to invade Cachar in an attempt to expel the Manipuri princes who had taken refuge there. The Burmese subsequently launched an invasion of Cachar. However, the British government soon revised its policy and initiated preparations to reclaim Assam, Cachar, and Jaintia from Burmese control. David Scott developed a strategic plan to involve the Manipuri princes in the British efforts against the Burmese. He met with the three exiled princes—Chourjit Singh, Marjit Singh, and Gambhir Singh—and proposed a political arrangement wherein Chourjit Singh would be reinstated as the Maharaja, Marjit Singh as the Jubaraj (Crown Prince), and Gambhir Singh as the Senapati (Commander). This proposal was ultimately unsuccessful. Chourjit Singh and Marjit Singh declined the offer, citing their advanced age and physical limitations. In contrast, Gambhir Singh, determined to reclaim the throne of Manipur, formed a strategic alliance with his cousin Nara Singh. Gambhir Singh and Nara Singh actively participated in the British military campaigns against the Burmese, contributing to key battles such as the Battle of Tilian, the Battle of Bikrampur, and the Battle of Dudpati. These British-led operations were successful in repelling the Burmese forces from Assam, Cachar, and Jaintia. Despite these military successes, the situation in Manipur remained complex. The kingdom continued to grapple with internal divisions and external threats, posing challenges to long-term stability and governance. === David Scott and Gambhir Singh === David Scott, serving as the British Agent to the Governor- General for the North Eastern Frontier, aimed to involve Gambhir Singh in the British-led efforts to liberate Manipur from Burmese occupation. Gambhir Singh was equally determined to participate in the campaign, seeking to restore his claim to the throne of Manipur. Scott negotiated with the exiled Manipuri princes, ultimately deciding to provide pensions to Chourjit Singh and Marjit Singh, who were residing in Sylhet. They were each granted a monthly allowance of 100 rupees, where they lived in exile until their deaths. In the course of these negotiations, Gambhir Singh was interviewed by David Scott. According to Sir James Johnstone, writing many years later, the interview was described as follows: In April 1824, David Scott assured Gambhir Singh that, following the successful liberation of Manipur, he would be reinstated as the ruler. It was also made clear that Chourjit Singh would not hold any shared authority in the governance of Manipur. Scott recognized Gambhir Singh as a bold and ambitious military leader with the potential to be an effective ally in the British campaign against the Burmese. This alliance played a significant role in the British military operations in the region, contributing to the eventual success of the campaign. == Raja Gambhir Singh Levy == By April 1824, David Scott and Raja Gambhir Singh were actively engaged in the British military operations against the Burmese. As part of this effort, a military force consisting of 500 soldiers was raised, initially referred to as the Raja Gambhir Singh Levy. By July 1824, recruitment was completed, and the soldiers received military training at Badarpur. The training was conducted under the supervision of Colonel Inns, with Gambhir Singh and his cousin Nara Singh also playing key roles in the training process. The structure of the original Levy was organized into two main units: * Cavalry: 40 soldiers ** Sirdar (Commander): 4 ** Troops: 36 * Infantry: 460 soldiers ** Subedar (Senior Officer): 5 ** Jamadar (Officer): 10 ** Havildar (Non-Commissioned Officer): 10 ** Naik (Corporal): 23 ** Sepoy (Soldier): 412 The recruitment for the Raja Gambhir Singh Levy drew primarily from the Manipuri population, with additional recruits from the Kachari community. This recruitment was facilitated by the presence of a large number of Manipuri refugees who had settled in various colonies within the Cachar Valley following the Burmese conquest of Manipur. The Levy played a significant role in the British military campaigns against the Burmese, contributing to key battles and the restoration of British authority in the region. == British Military Campaign Against the Burmese (1824–1825) == By October 1824, British forces had successfully expelled the Burmese from Cachar, with the remaining Burmese troops concentrated in the Manipur Valley and the Kabaw Valley. In response to this situation, the British Government decided to launch a large-scale military operation aimed at advancing into Manipur and potentially into upper Burma. In January 1825, a military force of 6,000 soldiers, including both cavalry and infantry, was mobilized under the command of Brigadier-General Suldham, who was appointed to oversee operations on the Eastern Frontier. The campaign required extensive logistical support, with supplies transported using camels, bullocks, and elephants. A total of 1,000 large bullocks and 4,000 bullocks were designated for this purpose. To facilitate the movement of troops and supplies, a road was constructed from Badarpur to Baskandi. General Suldham’s forces advanced from Sylhet to Dudpati, accompanied by artillery. Raja Gambhir Singh was tasked with providing cover for the pioneers engaged in constructing a pathway from Baskandi to Jiri. The region between Baskandi and Manipur presented significant geographical challenges. It consisted of a continuous range of thickly wooded hills with soft, muddy soil, which impeded the movement of supplies and troops. The transportation of provisions was further complicated by adverse weather conditions, resulting in the loss of several hundred bullocks, camels, and elephants. General Suldham’s forces required an entire month to move from Dudpati to Baskandi, facing continuous rain and difficult terrain. Upon reaching Baskandi, General Suldham concluded that advancing further into upper Burma through Manipur was impractical due to the challenging conditions. The campaign was subsequently abandoned, and the British force was disbanded. The headquarters was relocated to Dacca, while the native infantry, the Sylhet Local Corps, and the Gambhir Singh Levy were stationed in Cachar to maintain British presence and influence in the region. == Its role in the liberation of Manipur (1825) == Following the withdrawal of General Suldham’s forces in 1825, Raja Gambhir Singh proposed to liberate Manipur with the support of his own military contingent, the Manipur Levy. The British authorities approved this proposal, and Lieutenant R.B. Pemberton volunteered to accompany the Levy, with the dual purpose of assisting in the military campaign and collecting detailed information on the region’s geography, resources, and the strength of the Burmese forces. The Manipur Levy departed from Sylhet on 17 May 1825 and reached Baskandi on 23 May. The force advanced through the Western Hills of Manipur, likely via the Akhui route, as described in Pemberton’s 1835 report. The troops encountered continuous rain and challenging terrain but maintained their resolve, driven by the objective of liberating their homeland. On 10 June 1825, the Levy reached the western edge of the Manipur Valley, encountering Burmese pickets approximately 12 miles west of Imphal, the capital of Manipur. In the ensuing battle, a significant number of Burmese soldiers were killed. The Royal Chronicle of Manipur records the events as follows: On 11 June 1825, it was confirmed that the Burmese had evacuated Imphal, which was subsequently occupied by Gambhir Singh and Pemberton. The Burmese forces retreated to Andro, located 11 miles east of Imphal. Gambhir Singh advanced towards Andro, but upon arrival, it was discovered that the Burmese had abandoned the position, leaving Manipur under British and Manipuri control. Gambhir Singh and Lieutenant Pemberton returned to Sylhet, leaving behind a force of 300 infantry and 20 cavalry under the command of Nara Singh to maintain order in Manipur. Before departing, Gambhir Singh was formally crowned as the ruler of the ancient Kingdom of Manipur. Additionally, around 700 Manipuri recruits joined the military contingent, increasing the total strength of the force to 1,020 men. Upon their return to Sylhet, the British Government acknowledged the success of the Manipur Levy, a feat that had not been achieved by General Suldham’s regular army. Recognizing Gambhir Singh’s leadership, the British provided him with 1,500 muskets and ammunition to strengthen his forces further. The Levy was formally renamed the Manipur Levy, with Captain F.J. Grant and Lieutenant R.B. Pemberton appointed as its commanders. The force later returned to Manipur, where it was discovered that the Burmese had also abandoned the Kabaw Valley. The 700 local Shan forces at Tamu posed a new challenge. Gambhir Singh, along with Captain Grant and Nara Singh, proceeded to Tamu, where they engaged in a five-day battle, resulting in the destruction of the Shan stockpile. Gambhir Singh’s leadership during this campaign was notable. Captain Grant remarked: This campaign marked a significant achievement in the British military efforts in the region, with Gambhir Singh playing a pivotal role in the restoration of Manipuri sovereignty. == Its role in the Anglo-Burmese Conflict (1826–1835) == On 1 February 1826, Raja Gambhir Singh, leading the Manipur Levy, arrived at the western bank of the Ningthee (Chindwin) River, marking the natural boundary between Manipur and Burma. The Burmese forces had retreated from the region, leaving behind fleeing inhabitants, Manipuri prisoners who were allowed to escape, and livestock. Historical accounts note that the liberation of Manipur was considered complete with the occupation of the Kabaw Valley on this date. The First Anglo-Burmese War concluded with the signing of the Treaty of Yandabu on 24 February 1826. Article 2 of the treaty formally recognized Gambhir Singh’s sovereignty as the King of Manipur. Following the war, the Manipur Levy was expanded to 3,000 men and became an integral part of British military operations in the region. The force was equipped, trained, and commanded by British officers, notably Captain F.J. Grant and Francis Jenkins. The soldiers were paid by the British Government and participated in several key military campaigns, including: * Subjugation of the Hill Tribes of Manipur (1826–1829) * Defeat of the Khasi Rebels (1830) * Conquest of Kohima (Thiboma) during the Military Expeditions to the Naga Hills (1832–1833) After the death of Maharaja Gambhir Singh, the British Government altered its policy. Lord William Bentinck, the Governor-General of India, withdrew British military and financial support from the Manipur Levy. The British subsequently established the Office of Political Agent in Manipur, with George Gordon, the adjutant of the Manipur Levy, appointed as the first Political Agent. == Structure and Strength == By 1835, the Manipur Levy had grown into a substantial force. According to Lieutenant R.B. Pemberton, its composition was as follows: * Infantry: 3,000 men * Cavalry: 100 troops * Golandauz (Artillery): 100 men operating four 3-pounder cannons The infantry was organized into three battalions, each consisting of 10 companies, with command assigned to native officers. Instead of regular salaries, land grants were provided to both soldiers and officers as compensation. The arms and ammunition were supplied by the British Government. Until Maharaja Gambhir Singh’s death, ammunition was provided free of charge. The Manipur Levy played a significant role in the military history of the region, contributing to British colonial military campaigns and the consolidation of British influence in Northeast India. == Deployment == After the liberation of Manipur in 1826, the Manipur Levy was strategically deployed to maintain internal stability, secure borders, and reinforce the kingdom’s control over its territories. The deployment was organized as follows: * Six Companies were stationed in villages surrounding the area near the present residence of the Maharaja at Langthabal. These units served as the central military force for maintaining law and order in the region. * Four Companies were composed of Manipuri refugees from the Ava territory (modern-day Myanmar). These companies were assigned to guard the eastern frontier, providing security against potential external threats. * Two Battalions were distributed across various villages, with their companies under the direct command of native officers. This arrangement facilitated localized military governance and administrative control. The Manipur Levy played a key role in consolidating the kingdom’s authority following its liberation from Burmese rule. The force not only secured Manipur’s borders but also extended its influence over the hill tribes and neighboring regions. Maharaja Gambhir Singh is recognized for his leadership in establishing a stable and modern administrative structure in Manipur, with the Manipur Levy serving as a critical instrument in this process. == Memorial pillar == On May 23, 2023, the foundation stone for a memorial pillar dedicated to the Manipur Levy was laid at Manipur Levy Ground in Chandrapur, Cachar, Assam, India. The ceremony was organized by the Maharaj Gambhir Singh Memorial Committee (Chandrapur, Cachar, Assam), the Manipuri Youth Front of Assam, and the United People's Front Manipur. == Related pages == * Meitei martial arts * Meitei traditional weapons * Meitei traditional toys * Meitei traditional games * Meitei monuments in Bangladesh * Meitei clothing in Bangladesh * Meitei clothing in Myanmar == Bibliography == * * * * * == References == Category:Meitei culture Category:Manipur Category:History of India Category:History of Myanmar Category:United Kingdom Category:British Empire Category:Armies",
 "title": "Manipur Levy"
}