{
 "id": "1178947",
 "text": "Bungō Stray Dogs (often abbreviated to BSD; Japanese title: 文豪ストレイドッグス, translating to “Literary Stray Dogs”) is a manga written by Kafka Asagiri and illustrated by Sango Harukawa, and an anime animated by Bones Studios. It first went into serialization in 2012 with Young Ace magazine. It is still ongoing as of 2025. Currently, 26 volumes have been released in Japanese and 24 have been released in English translation. A new chapter is usually published early each month. == Plot == Bungō Stray Dogs centers a young man named Atsushi Nakajima, who joins a company of detectives, known as the Armed Detective Agency, after he learns he has the ability to transform into a white tiger (who is named Byakko.) The series is primarily made up of the Armed Detective Agency members battling against different criminal organizations, such as the Port Mafia, The Guild, and The Decay of the Angels. It takes place primarily in Yokohama, Japan. == Characters == Bungō Stray Dogs is a long series and has many different characters, some of the most major being: === Atsushi Nakajima === The 18 year old main protagonist of the series. He is an orphan who, after discovering he was a tiger, joined the Armed Detective Agency. He has the ability (known as The Beast Beneath the Moonlight) to transform into a tiger. He is the mentee of Osamu Dazai, and a brother-like figure to Kyōka Izumi. He has a somewhat father-son relationship with both Kunikida Doppo and Fukuzawa Yukuchi. He is heavily implied to have some form of PTSD. He is not very good at social interactions, but he is often incredibly determined and compassionate. He and Ryūnosuke Akutagawa are known to be rivals, though they do care for one another. At times, he is quick to give up. He is widely known as the “Man Eating Tiger.” === Osamu Dazai === A 22 year old detective with the Armed Detective Agency. He is Atsushi's mentor, and is partners with Kunikida Doppo. He was formerly a member of the Port Mafia(involved as an executive as a teenager), and has the ability (known as No Longer Human) to deactivate others' powers. While he was a teen, Ōgai Mori, head of the Port Mafia, was his mentor and father figure (though the Mori did not treat him well). He trained Ryūnosuke Akutagawa, though he did not train him well. He left the Port Mafia shortly after his close friend, Oda Sakunosuke, died. He is known to be very intelligent, charming, and rather manipulative. He often portrays himself as a lazy, suicidal man. In his time in the Port Mafia, he was partnered with Chūya Nakahara, whom he has a rivalry with. Despite their rivalry, they do show a great caring and trust towards one another. Osamu often fakes or hides his emotions, and those he is genuine about are often ones of extreme negativity or shock. === Ryūnosuke Akutagawa === A 20 year old mafioso known as the “Black-Fanged Hell-hound”. From the age of 14, until he was 16 years old, he was trained and abused by Osamu Dazai. He later mentored (and abused) Kyōka Izumi, as well as Ichiyō Higuchi. He is the elder brother of Gin Akutagawa. While he despises Osamu, Ryūnosuke desperately craves to prove his strength to him, due to Osamu's past abuse and criticism. While he and Atsushi have a rivalry, the two do show care for one another. He is known to be generally introverted, and somewhat aggressive. He shows little facial emotion, which often leads others to believe he is a cold person. His ability is known as Rashōmon, which configures itself as a black-and-red, shape-shifting creature, often made from Ryūnosuke's coat. == References == Category:Manga Category:Comics",
 "title": "Bungō Stray Dogs"
}