{
 "id": "1178059",
 "text": "Linden Hills Library is a public library in southwest Minneapolis, Minnesota. The library originally opened in 1911 on the first floor of a building, but was moved to its own building in 1931. The library building was designed in the Tudor Revival style. The library has also hosted groups such as children's clubs and women's organizations. The library was added to the National Register of Historic Places in 2000. The building has a glass panel above the entrance that to honor people from the past. It also has terraces and two historic fireplaces. In October 1911, a plan was made to get Linden Hills a building and 1,000 books. In 1920, a building was rented for $1,000 a year. In 1923, the price was raised to $1,200 a year and the Library Board considered moving to an old building nearby but decided to stay. In March 1928, the Library Board was notified after its contract expired. The building was rented to the U.S. Post Office until 1964. After the contract ended, the library moved upstairs from the old location. Older people had trouble getting upstairs to the new location. \"A very touching story was told of seeing an old lady looking into the old room, She was shown the removal sign, for she was deaf, shook her head and moved away\" wrote one of the librarians. The library board asked for $50,000 to build the Linden Hills building. A city meeting took place, but the request was denied. 2 years later, the $50,000 was finally accepted and plans were made on the building. The new building had over 10,000 books, the basement had a children's library, staff room and kitchen. The building cost approximately $42,000. The building was opened just before budget cuts hit Minneapolis Public Library, making it the last library built until 1968. In the 1957, there was a wave of book losses. a locker check of a local high school brought back 24 books, 20 of these books weren't checked out. On June 19, 1961 the library set a record. It checked out 1500 books, about 3 books per minute. On June 26 it almost set record again with 1,486 books checked out. On the 50th anniversary, it had 25,000 books and was open 1–9 pm on Monday and Thursday and 10–5:30 on Tuesday, Wednesday, Friday and Saturday. Rules were for the renovation were made to help keep it in budget. * The expansion should be done within the property limits * The expansion should keep the history of the library * The expansion should allow for further expansion within the property limits In 2000, the library was put on the National Register of Historic Places. The Library Board fought this because they already worked to preserve its building, and historic status could limit renovations. Librarian Sandy Purdue was named the best Children's Librarian in the July 1998, the children's area and story times were praised. In 2001, a renovation was made to add 1200 square feet and provided a better layout for customer service. The library closed on March 24, 2001 and reopened on May 18, 2002. While the library was closed, the neighborhood was served by the bookmobile. The project cost $2.3 million, and added 32,000 books and 19 public computers. In 2004, budget cuts Minneapolis Public Library, plans were made to close Linden Hills Library. A group raised money to keep Linden Hills open with reduced hours. Linden Hills was one of 14 libraries that got merged into Hennepin County Library in 2008. == References == == Notes == * Linden Hills Library Category:Coordinates on Wikidata Category:Pages using gadget WikiMiniAtlas Category:Libraries in Hennepin County Library Category:Minnesota Category:Education in the United States",
 "title": "Linden Hills Library"
}