{
 "id": "1178987",
 "text": "The early political relations between Burmese kingdom of historical Myanmar (Burma) and Meitei kingdom of erstwhile Manipur (Kangleipak) were marked by both diplomatic interactions and periods of conflict.Suresh Singh, Th. The Endless Kabaw Valley: British Created Vicious Cycle of Manipur, Burma and India. India: Quills Ink Publishing, 2014. p. 225-233 Meitei people in Myanmar are known as \"Kathe\" or \"Cassay\" or \"Cassey\" or \"Ponna\". Burmese people (of Bamar ethnicity or Burman ethnic group) are known as \"Awa\" or \"Ava\", named after one of their historical places, by the Meitei people. Both Burmese language (officially called Myanmar language) and Meitei language (officially called Manipuri language) belong to the same family, Tibeto-Burman, which is a branch of the Sino-Tibetan linguistic family.Hodson, Thomas Callan. The Meitheis. India: D. Nutt, 1908. == Relations during 15th century == Relations were notably improved during the reign of Meitei King Kyamba (1467–1508 CE), who established a matrimonial alliance with Kikhomba, the king of Pong, a historical kingdom in modern day Myanmar, around 1470 CE. This alliance facilitated a joint military campaign against the Kyang-a Shan kingdom of Kabo Valley (1470–71 CE), resulting in the collection of significant spoils of war, which were divided between the two rulers. Some Shan captives taken during this campaign were later assimilated into Meitei society. == Relations during 16th & 17th centuries == During the reign of Meitei King Khagemba (1592–1652 CE), Manipur’s territorial expansion extended southward, covering the Ango Hills and the Ningthee River. This expansion was accompanied by the capture of numerous individuals as war captives, influencing the region's demographic and cultural composition. In 1692, Meitei King Paikhomba (1667–1697) led an expedition as far as Samjok in Burma. The campaign faced resistance when the Kabos rose against him and invaded Manipur. Although he managed to repel the invaders to the Chindwin River, the conflict resulted in significant losses for his forces. Subsequent military campaigns against Mashem Lamthol and Sangang were unsuccessful. Following Meitei King Paikhomba’s death in 1697, his successor King Charairongba strengthened bilateral relations between Manipur and Burma through trade and cultural exchanges. == Relations during 18th century == In 1702, Meitei King Paikhomba arranged the marriage of his sister, princess Chakpa Makhao Ngambi, to the king of Samjok. In 1707, he successfully defeated the Tusug people, and later in his reign, he further reinforced diplomatic ties through the marriage of one of his daughters to the chief of Kabo. In 1714, Taningawe (1714–1733), the ruler of Burma, expressed his desire to marry Princess Satyamala, the daughter of Garibnawaz (1709–1748). In response, the Burmese were informed that Satyamala would be presented to him three days after the spring festival, Basanta Panchami. Taningawe then sent 300 nobles to receive the princess and escort her to the royal palace. However, upon reaching the designated location on the Yu River, they found no princess present. Instead, Garibnawaz, with his cavalry, captured the Burmese delegation and brought them to Manipur as prisoners. Following this incident, Garibnawaz initiated military campaigns to expand his territory southward. His forces, under the command of proactive generals, invaded the territories of Canda and later advanced into the Shwebo district in 1735, where they seized cattle and slaves. In 1737, they established a camp near Sagain. Garibnawaz continued his campaign towards the Burmese capital, Yewa, and succeeded in driving out the Talai king. His dominion extended from Manipur to the Irrawadi River, covering regions where his forces destroyed houses and monasteries. The campaign eventually reached Ava, the former capital of Burma. On his return journey via Samsok, Garibnawaz appointed Eu- Aujaya, a Burmese noble, as the ruler of 46 divisions of Burma conquered during his campaign. Eu-Aujaya was given the title of Aaumeiyajee, with Yewa as the capital. During Garibnawaz’s absence, a Tripuri king invaded Manipur from the west and advanced as far as Moirang in 1739. Faced with the challenge of managing two fronts, Garibnawaz negotiated peace with the Burmese king by offering his daughter, Satyamala, in marriage. He then returned to Manipur to address the situation. Historian W.S. Desai notes that during this period, raiding neighboring states was often regarded as a legitimate political strategy, generating significant economic benefits. Such practices were common, and counter-raids were considered an expected outcome of these incursions. == Burmese Aggression in Manipur == Burmese aggression against Manipur was a prolonged and recurrent phenomenon, with major raids and counter-raids documented from the 15th to the 18th century. Following the death of Garibnawaz, Manipur's political stability weakened, leading to a decline in its power and prestige. The region experienced continuous Burmese invasions, internal disputes, and succession conflicts, characterized by political intrigue, rebellion, and shifting allegiances. From 1758 to 1824, the Burmese army conducted multiple invasions, resulting in the plundering of Manipur over a span of 66 years. These invasions forced many Meiteis to flee political persecution, seeking refuge in neighboring regions such as Cachar, Tripura, East Bengal (Bangladesh), and Assam. === Key Burmese Invasions === These invasions had a profound impact on Manipur, resulting in significant loss of life, economic disruption, and political instability. The repeated invasions also led to cultural exchanges and the forced migration of Meitei populations to other regions. ==== 1755 ==== During the reign of Meitei King Moramba Gourashyam (1753–1759), Alaungpaya (also known as Alempara), the founder of the Burmese dynasty, initiated a raiding expedition against Manipur. The aim was to subdue the Meiteis, referred to as \"Cassayers.\" The Burmese forces, equipped with firearms—unfamiliar to the Meiteis—caused widespread panic. The Meitei troops, unprepared for such tactics, fled, leaving the Manipur valley largely deserted. This event is known in Manipur's history as \"Khuntak Ahaanba\" (the First Great Devastation). ==== 1758 ==== After the conclusion of a treaty with Meitei King Gourashyam, which involved the surrender of hostages from the Meitei royal family, Alaungpaya grew dissatisfied with the Manipuris. He led another expedition in 1758, advancing as far as the Ningthee River with a fleet of boats. The Burmese defeated the Meitei forces at Pallel, subsequently marching through the Aimol Pass into Imphal. The Burmese remained in Imphal for two weeks, looting the kingdom and massacring thousands of Meitei people as captives. On their return journey, they carried away thousands of Meiteis, including artisans such as Bamons, silk workers, and silversmiths. ==== 1764–1793 ==== During the reign of Meitei King Bheigyachandra (1762–1793), the Burmese, under King Hsibyushin (1763–1776), defeated the Meiteis at Kakching in 1764. Between 1764 and 1793, Bheigyachandra lost and regained the throne at least three times, reflecting the region's ongoing political instability. In 1782, he was driven from power, and he, along with his relatives and supporters, sought asylum in neighboring principalities. == Related pages == * Chahi Taret Khuntakpa * Herachandra * Manipur Levy * Meitei people in Assam * Meitei people in Bangladesh * Meitei people in Meghalaya * Meitei people in Myanmar * Meitei people in Nagaland * Meitei people in Tripura * Meitei martial arts * Meitei traditional weapons * Meitei traditional games * Meitei traditional toys * Meitei clothing in Myanmar * Meitei clothing in Bangladesh * Meitei monuments in Bangladesh == References == Category:Myanmar Category:Meitei culture Category:History of Manipur Category:History of Myanmar Category:History of India",
 "title": "Burmese–Meitei relations"
}