{
 "id": "1178108",
 "text": "Abaújszántó is a town in Gönc District in Borsod-Abaúj-Zemplén County, Hungary. The town is one of the places where wine is grown and made in the Tokaj wine region. == Location == It is located at the western base of the Zemplén Hills in the Hernád valley, next to the Szerencs stream. It is about 40 km by road from Miskolc, the county seat. The nearby places are Abaújkér to the north, Abaújalpár to the north-east, Sima and Erdőbénye to the east, Tállya to the south-east, Golop to the south, Felsődobsza to the west-south- west, Pere to the west, and Hernádbűd to the north-west. === Weather === The climate is fairly warm and dry. The average yearly temperature is 9-9.5 °C. It gets about 1900 hours of sunshine each year, and the average yearly rainfall is about 600 mm. === Connection === The main road to the town is Road 39, which you can get to from Encs and Tokaj. It connects to Halmaj and Felsődobsza via Road 3703, to Pere and Ináncs via Road 3704, and to Boldogkőváralja via Road 3714. There is also a northern border crossing on Road 3705. You can take the train on the MÁV No. 98 Szerencs-Hidasnémeti line, which has two stops here. The first stop is in the southwest part of town, near the Railway crossing on Road 3703, and the second stop is at the northern edge of town, next to Road 39. == History == Abaújszántó has been lived in since ancient times, and old bronze tools found in local vineyards show this. It is a well-known wine-growing region, first mentioned in writing in 1275 as Zamthou. Its vineyards were noted at that time, but it is likely that the main grape farms were started by Italian settlers. By the end of the 1800s, it was the most populated town in the county after Kassa (Košice), and its streets had lights by January 1904. In the years after the Treaty of Trianon, nearby Encs began to take over as the main town in the area. == Politics == The current mayor of the town is Ádám Sáfián. === Mayors === * 1990-1991: Gábor Bényey (independent) * 1991-1994 : János Kender * 1994-1998: Sándor Sóhajda (MSZP) * 1998-2001: Sándor Sóhajda (independent) * 2001-2002: Zoltán Soltész (independent) * 2002-2006: Zoltán Soltész (independent) * 2006-2010: György Madár (Independent) * 2010-2014: György Madár (Independent) * 2014-2014: István Kiss Tibor István (Independent) * 2015-2019: Ádám Sáfián (Independent) * 2019-2024: Ádám Sáfián (Fidesz-KDNP) * 2024- : Ádám Sáfián (Fidesz-KDNP) == Population == In 2022, 89.8% of people said they were Hungarian, 4.4% identified as Gypsy, 0.2% as German, 0.1-0.1% as Polish and Slovak, and 1.5% as other non-Hungarian (9.9% did not respond; because of dual identities, the total may exceed 100%). Regarding religion, 37.5% were Roman Catholic, 18.9% were Reformed, 6.5% were Greek Catholic, 0.6% were other Christian, 0.3% were Evangelical, and 3.1% were non-denominational (32.8% did not answer). == Sights == * Wine cellars - The town's wine cellars are a World Heritage Site, with 420 cellars. The longest cellar is 1600 meters long and has several exits. * Orthodox Synagogue \\- The synagogue was built in 1896, but it does not look like it used to. In 1944, most of the more than 200 Jewish families living in Abaújszántó were deported and murdered. * Patay Castle \\- The Patay Castle was built around 1820 by the Patay family in the neoclassical style. * Roman Catholic Church - The church was built in the Gothic style in the 14th and 15th centuries; its late Baroque form was added in 1804, based on the plans of Ignatz Franz. * Greek Catholic Church \\- The church was built in 1792 in late Baroque style. Copf's iconostasis was made in 1811, and its pictures were painted by József Miklóssy in 1830. * Reformed Church - The church was built in 1752 in Baroque style and rebuilt in 1865. * Evangelical Church \\- The church was built in 1798–99, in the Copf style. == Twin towns == * Vylok, Ukraine * Košice, Slovakia * Căpâlnița, Romania * Bad Schwalbach, Germany * Oberlungwitz, Germany == Notes == Category:Towns in Hungary Category:Settlements in Borsod-Abaúj-Zemplén County Category:Gönc District",
 "title": "Abaújszántó"
}