{
 "id": "1178424",
 "text": "Abadon (born 1992) is an American professional wrestler. They currently wrestle for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH). == Professional wrestling career == === All Elite Wrestling / Ring of Honor === On the March 10, 2020 episode of Dark, Abadon made their debut for All Elite Wrestling (AEW), losing to Hikaru Shida. On the June 17 episode of Dynamite, Abadon made their television debut and also earned their first victory in AEW when they defeated Anna Jay. They then went on a six-match winning streak. On Night One of New Year's Smash, Abadon challenged Hikaru Shida for the AEW Women's World Championship but was unsuccessful. Abadon then went on another winning streak, earning 14 victories. At All Out, Abadon participated in the 21-woman Casino Battle Royale for a chance at the AEW Women's World Championship in the future but the match was won by Ruby Soho. After being out with a broken collarbone, Abadon returned to AEW on the May 17, 2023 episode of Dynamite. They teamed with Skye Blue and Willow Nightingale to defeat Emi Sakura, Marina Shafir and Nyla Rose. On the October 27 episode of Rampage, Abadon earned a number one contendership for the AEW Women's World Championship after defeating Anna Jay, Skye Blue and Willow Nightingale in a four-way match. On the October 28 episode of Collision, Abadon challenged Hikaru Shida for the AEW Women's World Championship in a Fright Night Fight match but was unsuccessful. At Worlds End, Abadon challenged Julia Hart for the AEW TBS Championship but was unsuccessful. Abadon entered the tournament to crown the first ROH Women's World Television Champion. They defeated Viva Van in the first round before losing to Mercedes Martinez in the quarter finals. On the October 31 episode of ROH on HonorClub, Abadon challenged Athena in a Halloween Ring Of Horror match for the ROH Women's World Championship but was unsuccessful. == Personal life == Abadon is non-binary and uses they/them pronouns. == References == ==Other websites== * Category:1996 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:LGBT sportspeople Category:Non-binary people Category:Sportspeople from Denver",
 "title": "Abadon (wrestler)"
}