{
 "id": "117801",
 "text": "The Magic Roundabout (released in France as Pollux, le manège enchanté and in North America with a shortened form, Doogal) is an British-French animated movie based on the television series of the same name. The movie was released on February 11, 2005 in the United Kingdom and France, and on February 24, 2006 in North America. The story is about a dog named Dougal (Doogal in North America) who has to save his best friend, Florence, as well as the whole world, from being frozen by an evil spring named ZeeBad. == Synopsis == A shaggy, candy-loving dog named Dougal (Doogal in North America) along with a group of friends go on a dangerous journey in an effort to stop their enemy—the evil ice sorcerer ZeeBad. As the world is placed in danger ZeeBad wants to turn the world to ice. Dougal and his friends must recover three diamonds that are needed to stop him. == Voice cast == *Robbie Williams as Dougal *Tom Baker as ZeeBad *Jim Broadbent as Brian *Bill Nighy as Dylan *Ray Winstone as Soldier Sam *Ian McKellen as Zebedee == Soundtrack == * \"Magic\" by Pilot is used, its 3rd use in a movie soundtrack after Disney's Herbie Fully Loaded and Happy Gilmore * \"Mr. Blue Sky\", by the Electric Light Orchestra from their album Out Of The Blue is a classic '70s tune that is key to the ending of the movie. Buyers should know it is not included on the US soundtrack. * \"Sugar, Sugar\" by The Archies, number one single of 1969 is used only during the closing credits and album. #Main Titles - Mark Thomas #The Magic Roundabout - Kylie Minogue – VOCAL #Meet Doogal - James Venable #Magic – Pilot - VOCAL #You Really Got Me - Bill Nighy & Catherine Bott - VOCAL #Doogal the Mechanic - James Venable #Zeebad Escapes - Mark Thomas #Sam Marches - John M. Davis #The Magic Roundabout - Andrea Remanda and Goldust – VOCAL #Meet Zeebad - James Venable #Setting Up Camp - Mark Thomas #Spinning - Andrea Remanda and Goldust - VOCAL #Duel Of The Springs 2 - Mark Thomas #Simply Wonderful - Andrea Remanda and Goldust - VOCAL #The What-a-Snails Waltz - Mark Thomas #Zeebad Threatens - James Venable #Train's Back - Mark Thomas #Lost In The Cold - Mark Thomas #See The City - Mark Thomas #The Frozen City - Mark Thomas #Frozen Florence - John M. Davis #The End Of Zeebad - Mark Thomas # Florence Awakes - Mark Thomas #Sugar, Sugar - The Archies - VOCAL #I Love To Boogie - T. Rex - VOCAL #Lean Mean Machine - Andrea Remanda and Goldust - VOCAL #Believe Yourself - Andrea Remanda and Goldust - VOCAL (Used during the scene with Dylan fighting the skeleton guards in the UK version) #Bust This Joint - Andrea Remanda and Goldust - VOCAL == References == == Other websites == * \"Magic Roundabout\" Official website * Doogal official website * * Category:2005 adventure movies Category:2005 fantasy movies Category:2005 animated movies Category:British adventure movies Category:British family movies Category:French-language movies Category:French animated movies Category:Multilingual movies",
 "title": "The Magic Roundabout (movie)"
}