{
 "id": "1178098",
 "text": "Újszentiván (Serbian: Нови Сентиван) is a village in Szeged District of Csongrád-Csanád County. Its population in 2024 was 1935. == Location == The village is located 10 kilometers from the center of Szeged. Its administrative area is surrounded by Szeged territories to the west, north, and east, with only Tiszasziget as a different neighbor to the southwest. Its southeastern boundary runs along the southern national border for about 3-4 kilometers, beyond which lie Serbian territories. The Tisza flows roughly 5 kilometers from the village center, with about 400 meters of its left bank forming the western edge of the village’s administrative area. == History == The village was first mentioned in 1411 as Zenth Iwan. From the beginning, it was owned by smaller noble families and inhabited by Hungarian serfs until the mid-17th century, when it was destroyed during the liberation wars. As a result, by around 1700, it was listed as an abandoned area in the bishopric’s property records. In 1783, a Serbian population moved here from Tiszasziget. After World War I, Újszentiván, along with other villages, was under Yugoslav occupation from November 21, 1918, to August 21, 1921. == Population == In 2022, 92.4% of the population declared themselves as Hungarian, 3.1% as Serb, 1.3% as Gypsy, 0.4% as Romanian, 0.4% as German, 0.3% as Bulgarian, 0.1-0.1% as Slovak, Rusyn, Croatian, Slovenian and Greek, 4.3% as other non-national (7.4% did not declare; due to dual identities, the total may be higher than 100%). In terms of religion, 26.8% were Roman Catholic, 3.9% Reformed, 1.4% Orthodox, 1.1% Greek Catholic, 0.5% Evangelical, 0.1% Israelite, 1.3% Other Christian, 0.5% Other Catholic, 19.7% non-denominational (44.7% did not respond). == Twin towns == * Horgoš, North Banat District * Lutița, Harghita County * Malý Horeš, Trebišov District == Notes == == Other websites == * Official website * Official Facebook page Category:Villages in Hungary Category:Csongrád-Csanád County",
 "title": "Újszentiván"
}