{
 "id": "1178196",
 "text": "Zielinski Bridge (Hungarian: Zielinski híd) formely Millenium Bridge is a metal structure bridge in Budapest, connecting Kós Károly Promenade with Heroes' Square. == History == The bridge was built for the 1896 millennium celebrations. The design competition was announced by Ernő Dániel, the Minister of Commerce, calling for a bridge 82 meters long, with a roadway 10 meters wide plus two 3-meter sidewalks, and a load capacity of 450 kg/m². The construction cost was set at 150,000 forints. The winning designer received no monetary prize but was tasked with overseeing the construction. Submissions came from Neuschloss and Marczel, Cathry Szaléz Ferenc and his son, Feketeházy János, Zielinski Szilárd (iron structure bridge), and Zielinski-Korb Flóris- Giergl Kálmán (stone bridge). The judges chose Zielinski’s iron structure design for construction. The bridge’s foundations were built under Zielinski’s supervision, made of concrete. The piers were clad with carved limestone. The iron structure was manufactured and assembled by the Ganz Danubius factory. The roadway was paved with red pine blocks, and the sidewalks were covered with asphalt. The railings and lighting fixtures were made more decorative than originally planned, increasing the cost to 169,000 forints. By the late 1920s, the bridge needed renovation. Győző Mihailich prepared the plans, and in 1929, the roadway and sidewalks were removed, replaced with an asphalt- covered reinforced concrete deck on the strengthened bridge structure. The bridge was undamaged during World War II. The destroyed candelabras were replaced with lamps from the blown-up Chain Bridge. In the following decades, only maintenance work was done. By 1981, corrosion and increased traffic made another renovation necessary. The metal structure was reinforced, and the roadway was insulated. The work was carried out by the Bridge Construction Company, the Road Equipment Company, and the National Skilled Trades Company. In 1994, on the 70th anniversary of Zielinski Szilárd’s death, the bridge was officially named the Zielinski Bridge. Category:Bridges in Europe Category:Buildings and structures in Budapest",
 "title": "Zielinski Bridge"
}