{
 "id": "1178839",
 "text": "In chemistry, an oxoacid, also known as an oxyacid, is an acid containing oxygen. Formally, it means an acid with an structure, where E can be any element other than oxygen or hydrogen. Oxyacids are also called ternary acids, as they contain three different elements. Historically, people thought all acids contained oxygen. Antoine Lavoisier, who discovered oxygen, named it using Greek words that mean \"makes acid\". The discovery that hydrochloric acid did not contain oxygen divided acids into two categories, which were named oxoacids and hydracids. (The later Lewis acid-base theory also has some acids without oxygen or hydrogen.) Sulfuric acid, nitric acid, and phosphoric acid are important inorganic oxyacids. Carboxylic acids and alcohols are among the organic compounds that are formally oxyacids of carbon. == Acidity == Acidity of a chemical usually depends on the length of the bond to the acidic hydrogen atom. In oxyacids, the bond is always between hydrogen and oxygen, so its length is similar between different oxyacids. Instead, what determines acidity is the central atom connected to oxygen. In general, the more electronegative the central atom is, the stronger the acid. (Electronegativity measures how much an atom will pull on electrons from other atoms.) This depends both on the central atom itself, and what else it is bonded to, with more bonds to more electronegative elements or groups (especially oxygen) increasing acidity. Perchloric acid, which has the very electronegative chlorine as a central atom, with three double bonded oxygen atoms, is one of the strongest oxyacids (pKa of -10). tert-Butyl alcohol, which has a weakly electronegative carbon center bonded to three other carbons, is one of the weakest (pKa of 18). Other oxyacids can be anywhere along the spectrum. Hypochlorous acid has a very electronegative central atom (chlorine), but is only a weak acid because there's nothing else bonded to it. Perrhenic acid has a weakly electronegative central atom (rhenium), but is a strong acid because of the many bonds to oxygen. == References == Category:Acids Category:Oxygen compounds",
 "title": "Oxoacid"
}