{
 "id": "1178101",
 "text": "Hejce is a village in Gönc District in Borsod-Abaúj-Zemplén County, Hungary. In 2024, 209 people lived there. == Location == It is 60 kilometers northeast of Miskolc, in the western foothills of the Zemplén Hills. Its area is small compared to nearby places, so it has only three neighbors: it touches Fony to the east and south, Vilmány to the west, and Göncruszka to the northwest. The road distance from Vilmány is 4 km and from Göncruszka 7 km; from Fony, it is less than 4 km straight, but by road, it takes 9-10 km. The closest town is Gönc, 12 km away. == History == Hejce is one of the oldest places in Hungary, first mentioned in 1009. In the 15th century, Hussites moved to the eastern part of the village. In 1774, Count Károly Eszterházy, the Bishop of Eger, had a bishop's castle built in a unique style, using plans by Jakab Fellner. It was used by the Bishop of Eger until 1804 and then by the Bishop of Kassa (now Košice). It was fixed up in 1845, and in 1888, Bishop Zsigmond Bubics of Kassa made small changes to it. In 1945, it needed repairs due to war damage. On January 19, 2006, forty-two Slovak soldiers lost their lives in a plane crash on the nearby Borsó Hill (a location administratively belonging to Fony but geographically much closer to Hejce). The disaster had only one survivor. One year later, the Slovak Minister of Defense awarded all the residents of the village a medal for their selfless behavior during the rescue operations. Because of this, in 2010, the then mayor of the village, Géza Rohály, was awarded the Slovak-Hungarian Good Neighborliness and Understanding Award. Since the tragedy, a memorial at the site of the accident preserves the memory of the victims. == Population == In 2022, 86.5% of the people identified as Hungarian, 13.5% as Slovak, 0.5% as German, 0.5% as Rusyn, and 1.6% as other non-Hungarian (8.3% did not identify; because of mixed identities, the total may exceed 100%). Regarding religion, 44.3% were Roman Catholic, 25.5% Reformed, 3.6% Greek Catholic, 4.7% non-denominational (20.3% did not answer). == References == Category:Villages in Hungary Category:Settlements in Borsod- Abaúj-Zemplén County Category:Gönc District",
 "title": "Hejce"
}