{
 "id": "1178298",
 "text": "Boris Zhutovsky (December 14 1932, Moscow — March 8 2023, Moscow) — Soviet and Russian artist, illustrator, and writer. == Biography == His father, Losif Losifovich Zhutovsky (1904-1938), an engineer in the polar aviation detachment, died in a plane crash. He graduated from the book artists department of the Moscow Polygraphic Institute, a student of Professor Andrei Goncharov, I. Chekmazov, Dmitry Arkhangelsky.Тарханова, И.. Текстильщики. Гостевые тетради Михаила Гробмана. — М.: Барбарис, 2013. pp. 10–12 After graduating, he worked in Sverdlovsk. Since 1957 — in various publishing houses in Moscow as an illustrator and book designer.Hans-Peter Riese. Ost/West: Eduard Steinberg zwischen Moskau und Paris. Wienand Verlag, 2015, ISBN 978-3868322484. pp. 18–20 From the late 1950s to 1962, he studied at Eliy Belyutin's studio \"New Reality\". Gradually Zhutovsky won recognition with other non-conformist painters who aspired to carry on the rich traditions of Russian avant-garde and Cubism that were banned in the USSR since the end of the 1920s. Zhutovsky befriended such painters as Vladimir Veisberg, Oskar Rabin, Eduard Gorokhovsky, Mikhail Roginsky, Igor Shelkovsky, Mikhail Shvartsman. He became acquainted with the famous collector Georgy Kostaki, the future founder of “Kostaki Museum” in Saloniki in Greece. Эдик Штейнберг. Материалы биографии. Очерки визуальности. Москва, Новое литературное обозрение, 2015. ISBN 978-5-4448-0239-7. pp. 51–55 He began exhibiting in 1959. After participating in the famous exhibition \"30 Years of the Moscow Union of Artists\" in the Manezh in December 1962 and a personal scandal with N. S. Khrushchev, who threatened to \"send him to logging\", Zhutovsky was denied the opportunity to participate in exhibitions. However, after Khrushchev's resignation, Zhutovsky talked to him at his dacha, he apologized, and the artist was invited to Nikita Sergeyevich's last birthday. Applebaum, Anne (2003). Gulag: A History. Doubleday. p. 446. ISBN 978-0-7679-0056-0. pp. 103–105 In the 1970s Zhutovsky became close to a group of Moscow artists nicknamed “Sretensky Boulevard”, which included Ilja Kabakov, Viktor Pivovarov, Vladimir Yankilevsky, Erik Bulatov, Oleg Vasiliev, Ivan Chuikov, Mikhail Roginsky.Ольга Шихирева, Жан-Клад Маркаде, Морис Тухман, Александр Боровский и др. Abstraction in Russia. Catalog of exhibitions in the State Russian Museum / Anna Laks. — Sankt-Petersburg: Palace Editions, 2001. — 814 p. — (Государственный Русский музей (альманах)). — ISBN 5933320595. pp. 73-77 After Exhibition hall at Malaya Gruzinskaya street, 28, was allocated for use of non-conformist artists, he exhibited there alongside with such artists as Vladimir Nemukhin, Nikolai Vechtomov, Vladimir Weisberg, Mikhail Schwarzman, Eduard Gorokhovsky, Mikhail Roginsky, Mikhail Grobman, Igor Shelkovsky. Эдик Штейнберг. Материалы биографии. Очерки визуальности. Москва, Новое литературное обозрение, 2015. ISBN 978-5-4448-0239-7. pp. 19–23 In the 1990s and 2000s, Zhutovsky again became close to the nonconformist artists from Tarusa (Eduard Steinberg, Yuri Zheltov, Igor Vulokh, Yury Zlotnikov), with whom he had worked and exhibited since the 1960s. In 2006, 2008, 2010 he participated in joint exhibitions of the artists of the sixties in the Tarusa Art Gallery. Эдик Штейнберг. Материалы биографии. Очерки визуальности. Москва, Новое литературное обозрение, 2015. ISBN 978-5-4448-0239-7. pp. 30–33 The author of the famous portrait series of outstanding representatives of the USSR and Russia of the 20th century \"The Last People of the Empire\", many of whom he knew personally. In 2004, his book-album of portraits and memoirs \"The Last People of the Empire. 101 Portraits of Contemporaries. 1973-2003\" was published for the first time and then republished. Жутовский Борис. «Последние люди империи» ISBN 5-93085-021-6. pp. 10–12 ===Selected paintings=== File:Zhut SelfPortrait.jpg|SelfPortrait File:Zhut Окуджава Лентулов.jpg|Okudzhava and Lentulov File:Zhut Nu 1966.jpg|Nu (1966) File:Zhut Ulitsa Pobedy.jpg|Ulitsa Pobedy ==References and sources== ;References ;Sources * Жутовский Борис. «Последние люди империи» ISBN 5-93085-021-6 * Эдик Штейнберг. Материалы биографии. Очерки визуальности. Москва, Новое литературное обозрение, 2015. ISBN 978-5-4448-0239-7 * Hans-Peter Riese. “Eduard Steinberg, Heaven and Earth: Reflections in Paints”. Palace Editions, 2004. ISBN 9783938051023 * Hans-Peter Riese. “Eduard Steinberg: Monographie. Wienand Verlag, 1998. ISBN 978-3879096152”. * Hans-Peter Riese. Ost/West: Eduard Steinberg zwischen Moskau und Paris. Wienand Verlag, 2015, ISBN 978-3868322484. * Applebaum, Anne (2003). Gulag: A History. Doubleday. p. 446. ISBN 978-0-7679-0056-0. * Gerhard Lenz and Anna Lenz. “Epoche Zero”. Hatje Cantz Verlag, 2009. ISBN 978-3775716888 * Anna Lenz. Strong Women for Art: In Conversation with Anna Lenz. Hirmer Publishers, 2013. ISBN 978-3777421490. * Vladimir A. Gusev und Evgenija Nikolaevna Petrova, Kiblickij Iozef (Hrsg.), Harry N. Abrams. \"Russisches Museum : hundert Jahre nationale russische Schatzkammer. Staatliches Russisches Museum. Palace Edition, 1998. ISBN 978-3930775361. * Basner, Elena V.; Kiblickij, Iozef. “I love Petersburg. The Russian Museum in Moscow. In celebration of the tercentenary of St. Petersburg”. St Petersurg, Palace Editions, 2003. ISBN 9785933321064. * Basner, Elena; Imanse, Geurt; Frank van Lamoen; Meylac, Michael; Sigey, Sergey. “Russian Avant-Garde: The Khardzhiev Collection at the Stedelijk Museum Amsterdam”. Nai010 publishers, 2014. ISBN 978-9462081048. * Iozef Kiblickij (ed.). “Oscar Rabin - Three Lives: The Retrospective Exhibition”. Saint Petersburg, Palace Editions, 2008. ISBN 9783940761255. * Bernard Noël (ed.): “Une recherche minutieuse de la beauté éternelle, avec l'inspiration dans le cœur”. Editions Gründ, Paris, 2008. * Marianna Stachowiak-Mieszkowska: “Nowa europejska seria suprematystyczna w sztuce i rzeźbie: ambitny początek”. Wydawnictwo Uniwersytetu Śląskiego, Katowice, 2014 * Gerthrude Spencer-Bloch. “Une nouvelle ouverture arrive bientôt. Pourquoi l'immédiateté de la perception dans la sphère de l'inconnu dans l'art”. Montpelier: Vilo Edigroup Verlag, 2018 * Елизавета Кузнецова. «Проблемы кураторов: горизонты нового искусства». Санкт-Петербург, издат. «Зеленая Амфора», 2021. * Ольга Шихирева, Жан-Клад Маркаде, Морис Тухман, Александр Боровский и др. Abstraction in Russia. Catalog of exhibitions in the State Russian Museum / Anna Laks. — Sankt-Petersburg: Palace Editions, 2001. — 814 p. — (Государственный Русский музей (альманах)). — ISBN 5933320595. * Dalya Alberge, Russian painters denounced as Soviet traitors exhibit in London, The Guardian, November 30, 2010. * Одесса — Москва — Одесса. Юго-западный ветер в русской литературе. М., 2014. * Карл Аймермахер, Евгений Барабанов, Александр Боровский, Галина Маневич и др. Нонконформисты. Second Russian avant-garde, 1955—1988. Собрание Бар-Гера / Ханс-Петер Ризе. — Cologne: Wienand, 1996. — P. 92—96. — 320 p. — ISBN 3879094960. * Grobman M. About Malevich // The Avant-Garde in Russia 1910-1930: New Perspectives, Exhibition Catalogue, Los Angeles County Museum of Art, MIT Press, Cambridge, Massachusetts, 1980 * Тарханова, И.. Текстильщики. Гостевые тетради Михаила Гробмана. — М.: Барбарис, 2013. == Other websites == * http://www.kozma.ru/gallery/artists/zhutovsky.htm Борис ЖУТОВСКИЙ в Галерее Чугунного Козьмы * https://web.archive.org/web/20070930071913/http://mirakov.ru/ru/artists/0/10/picture/0/0.html Работы в галерее «Анна и Юрий Мираков» * http://news.bbc.co.uk/hi/russian/entertainment/newsid_3747000/3747700.stm Интервью Би-би-си (2004) * http://www.shender.ru/paper/text/?file=16 Интервью В. Шендеровичу (2003) * http://www.nasledie-rus.ru/podshivka/6824.php Борис Жутовский Category:1932 births Category:2023 deaths Category:Russian painters Category:Russian Jews Category:Soviet Jews Category:Soviet dissidents Category:People from Moscow",
 "title": "Boris Zhutovsky"
}