{
 "id": "1178136",
 "text": "Gregory Marasciulo (born March 30, 1987) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) under the ring name Trent Beretta. He is a member of the Don Callis Family stable. He has also made appearances in the World Wrestling Entertainment / WWE, New Japan Pro- Wrestling (NJPW), Pro Wrestling Guerrilla (PWG), Total Nonstop Action Wrestling (TNA), and Ring of Honor (ROH) (before AEW's purchase). Marasciulo has won many championship throughout his career. In Dragon Gate USA, he was a one-time Open the United Gate Champion. In NJPW, he was a four-time IWGP Junior Heavyweight Tag Team Champion, one-time NEVER Openweight 6-Man Tag Team Champion, and the winner of the Super Jr. Tag Tournament with Rocky Romero in 2016. == Professional wrestling career == === All Elite Wrestling === On February 7, 2019, Beretta and Chuck Taylor both announced that they had signed contracts with All Elite Wrestling (AEW). At Double or Nothing, Beretta would make his in-ring AEW debut. He would team with his Best Friends teammate Chuck Taylor and they defeated the team of The Hybrid2 (Angélico and Jack Evans). Best Friends would compete in a tournament to determine who would become the very first AEW World Tag Team Champions. They competed for a bye in the first round at All Out but lost to The Dark Order (Evil Uno and Stu Grayson). They would still compete in the tournament but would lose in the first round to eventual champions SoCal Uncensored (Frankie Kazarian and Scorpio Sky) on the October 16 episode of Dynamite. On the November 6 episode of Dynamite, Beretta made his AEW in-ring singles debut in a loss to Pac. At Bash at the Beach, Best Friends competed in a four-way number one contender match against The Elite (Adam Page and Kenny Omega), The Young Bucks (Matt Jackson and Nick Jackson), and The Inner Circle (Santana and Ortiz). The match was won by The Elite. They won a title shot and challenged Page and Omega for the titles on Night 1 of Fyter Fest but lost. On the April 3, 2024 episode of Dynamite, Baretta and Orange Cassidy lost a semi-final match to The Young Bucks (Matthew and Nicholas Jackson) in the tournament to crown the new AEW World Tag Team Champions. After the match, Best Friends went for their signature ringpost hug but during it, Baretta hit Cassidy with a running knee strike , turning heel, and breaking the stable up. On the May 29 episode of Dynamite, Beretta joined the Don Callis Family. On the July 13 episode of Collision, Beretta was written off television after Cassidy hit him in the back of the head with a monkey wrench. It was announced that Beretta had to have surgery to fix two broken screws in his neck. == References == ==Other websites== * Category:1987 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from New York (state)",
 "title": "Trent Beretta"
}