{
 "id": "1178420",
 "text": "Paul Soren Gruber (born October 26, 1996) is an American professional wrestler. He currently wrestles for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH) under the ring name Wheeler Yuta. He is a member of the Death Riders stable. He has also made appearances in the Chikara, Combat Zone Wrestling (CZW), and Major League Wrestling (MLW). Yuta has won many championships throughout his career. In AEW, he been a one-tine AEW World Trios Champion. In Chikara, he was a one-time Chikara Young Lions Cup winner. In CZW, he was the winner of the Dramatic Destination Series tournament in 2016 and the Trifecta tournament in 2018. == Professional wrestling career == === All Elite Wrestling / Ring of Honor === On the June 29, 2021 episode of Dark: Elevation, Yuta made his debut for All Elite Wrestling (AEW), losing to Karl Anderson. On July 6 episode of Dark, Yuta earned his first victory in AEW, defeating Ryan Nemeth. After Trent Beretta was injured, Yuta decided to join the Best Friends stable to compete alongside them in trios matches. Yuta also became a member of the Chaos stable after Rocky Romero made Best Friends into a sub-group of Chaos to represent the group in AEW. At Supercard of Honor XV, Yuta defeated Josh Woods to win the ROH Pure Championship. In the weeks after, Yuta was being courted by the William Regal-led Blackpool Combat Club stable. On the March 30, 2022 episode of Dynamite, Yuta teased leaving Best Friends to Blackpool Combat Club. On the April 8 episode of Rampage, Yuta lost to Jon Moxley. After the match, Regal offered Yuta a handshake and invitation to join their group which Yuta accepted. On the August 3 episode of Dynamite, Yuta challenged Chris Jericho to determine the number one center for the interim AEW World Championship but Jericho won. On the September 7 episode of Dynamite, Yuta lost the ROH Pure Championship to Daniel Garcia. At Final Battle, Yuta defeated Garcia to regain the ROH Pure Championship. On the February 22, 2023 episode of Dynamite, Yuta challenged Orange Cassidy for the AEW All-Atlantic Championship but was unsuccessful. On the March 8 episode of Dynamite, Yuta turned heel after helping Moxley and Claudio Castagnoli beat down \"Hangman\" Adam Page. At Supercard of Honor, Yuta lost his championship to Katsuyori Shibata. On the May 24 episode of Dynamite, Yuta and Castagnoli challenged The Lucha Brothers (Penta El Zero Miedo and Rey Fenix) for the ROH World Tag Team Championship but were unsuccessful. At Double or Nothing, Yuta helped the Blackpool Combat Club defeat The Elite (Kenny Omega, Page, Matt Jackson, and Nick Jackson) in an Anarchy in the Arena match after Yuta pinned Elite leader Omega. On the November 25 episode of Rampage, Yuta defeated Katsuyori Shibata to regain the ROH Pure Championship. At Death Before Dishonor, Yuta lost the championship to Lee Moriarty. At All In London, Blackpool Combat Club and Pac won a four-way London Ladder match the become the new AEW World Trios Champions. On the November 6 episode of Dynamite, the stable changed their name to Death Riders. == References == ==Other websites== * Category:1996 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Sportspeople from Philadelphia",
 "title": "Wheeler Yuta"
}