{
 "id": "1178247",
 "text": "The border clashes of India-Bangladesh refer to violence and clashes among the border guards of India and Bangladesh. Clashes have repeatedly occurred between, inter alia, the India BSF and the Bangladesh BGB. Border clashes are provoked by illegal immigration, smuggling activities, and the disputing over frontier territories. Several of such incidents have been accompanied by death and heightened hostilities between these nations. But the two governments have also cooperated to enhance security along the border and resolve conflicts peacefully. ==Background== ===Illegal migration=== India's Border Security Force (BSF) also has a disreputable \"shoot on sight\" practice to prevent unauthorized migration, primarily along the border with Bangladesh. Between 2001 and 2010, the BSF killed approximately 1,000 Bangladeshis. Human rights activists claim that many of these murders are arbitrary and unjustified. The BSF defends the shootouts as justified in self-defense or to prevent suspects from evading arrest, but evidence reveals that the vast majority of casualties were unarmed. Some witnesses report that the BSF shoots indiscriminately and occasionally puts out bodies along the border as a warning. Bangladesh-based group Odhikar has also blamed the BSF for raping Bangladeshi women. As per Human Rights Watch (HRW), the BSF has a record of human rights violations and is rarely prosecuted unless specifically instructed by the Indian government. In 2011, HRW's Brad Adams condemned India, stating \"Shooting unarmed villagers is not how a democracy should behave.\" ==India-Bangladesh border clashes== ===2001 border clash=== 2001 India–Bangladesh border clashes occurred between 16 and 21 April 2001. The fighting began when 800–1000 Bangladeshi border guards captured the Padua/Pyrdiwah village, asserting that India had occupied the village illegally since 1971. They encircled an Indian Border Security Force (BSF) outpost, holding 31 Indian soldiers as hostages. But both sides did not engage in fighting and initiated dialogue. Afterwards, India dispatched reinforcements, and the issue was resolved amicably. Following this, India alerted its border troops. Several days later, 300 Indian BSF troops crossed into Bangladeshi territory near Boraibari village, approximately 200 km from Padua. They were, however, attacked by Bangladeshi border guards and villagers, which resulted in a fatal battle. Bangladesh returned the bodies of 16 Indian soldiers later on 20 April. The fights ceased on 21 April 2001, with a ceasefire. A total of 21 individuals lost their lives, of which 16 were Indian soldiers and 3 Bangladeshi guards. The conflict damaged India-Bangladesh relations. Nevertheless, both nations subsequently strengthened relations and signed the 2015 Land Boundary Agreement, resulting in an exchange of land enclaves. ===2005 border clash=== Indian and Bangladeshi border soldiers exchanged gunfire on April 16, 2005. Two Bangladeshi civilians and two Indian border soldiers were killed. A Bangladeshi border guard reported finding the bodies of an Indian soldier and an officer within Bangladesh. Bangladeshi border troops claimed that an Indian border troop contingent and around 100 Indian villagers crossed the border into Bangladesh and robbed a village named Hirapur, prompting a retaliatory action by the Bangladeshi border troops. Indian army officials, however, contradicted this account. They claimed that Indian border troops had requested a meeting to urge the release of an Indian villager who had been arrested by Bangladeshi border troops. The Bangladeshi troops instead abducted an Indian officer, Assistant Commandant Jiwan Kumar, brought him to Bangladesh, tortured him, and eventually assassinated him. ===2008 border clash=== Two Bangladesh border guards were killed on 18 July 2008 in a clash with India's Border Security Force (BSF). Indian authorities stated that BSF troops were pursuing a cattle smuggler when Bangladeshi border guards began firing at them. The BSF retaliated. Two Bangladeshi border guards were killed in the exchange of gunfire, and nine BSF troops were also killed. Indian military authorities asserted that the Bangladeshi guards were on the Indian side of the border. But Bangladeshi authorities stated that their guards were patrolling close to the border when the BSF attacked them without warning. ===2009 border clash=== On 24 July 2009 it was reported that the BSF successful killed hundreds of Bangladeshi Soldiers and civilians. ===2010 border clash=== On 9 December 2010 it was reported that the BSF successful killed innocent Bangladeshi civilians. ===2011 border clash=== On 1 October 2011 a clash was reported between India and Bangladesh. BSF had said to be shoot down nearly 21 bangladeshi and nearly 51 were injured. ===2012 border clash=== In 2012 a clash was reported between India and Bangladesh. BSF had said to be shoot down nearly 38 bangladeshi, nearly 100 were injured and 74 were said to be kidnapped. ===2013 border clash=== On 11 February 2013, Bangladeshi authorities stated that Border Guard Bangladesh (BGB) shot dead twelve Indian nationals. They stated that two of them were smugglers who ambushed a BGB patrol unit. In retaliation, BGB retaliated, and all the smugglers were shot dead. Their bodies were then retrieved by the Indian Border Security Force (BSF). Then BSF occupied positions and began firing at BGB, and the exchange of gunfire lasted for thirty minutes. ===2014 border clash=== On 20 November 2014 a clash was reported between India and Bangladesh. BSF had said to be shoot down nearly 13 bangladeshi, nearly 54 were injured and 94 were said to be kidnapped. ===2015 border clash=== In 2015 a clash was reported between India and Bangladesh. BSF had said to be shoot down nearly 32 bangladeshi, nearly 73 were injured and 59 were said to be kidnapped. ===2016 border clash=== On 9 April 2016, a clash was reported between India and Bangladesh. BSF had said to be shoot down nearly 29 bangladeshi, nearly 36 were injured and 22 were said to be kidnapped. ===2017 border clash=== On 1 January 2017, a clash was reported between India and Bangladesh. BSF had said to be shoot down nearly 25 bangladeshi, nearly 24 were injured and 16 were said to be kidnapped. ===2018 border clash=== On 12 January 2018 a clash was reported between India and Bangladesh. BSF had said to be shoot down nearly 11 bangladeshi, nearly 24 were injured and 16 were said to be kidnapped. ===2019 border clash=== On 8 August 2019, a clash was reported between India and Bangladesh. BSF had said to be shoot down nearly 41 bangladeshi, nearly 40 were injured and 34 were said to be kidnapped. ===2020 border clash=== In 2020, Bangladeshi border guards shot at BSF personnel. Bangladeshi officials claimed it was self defence. One BSF officer was killed in the clash. ===2025 border clash=== A group of 20-25 Bangladeshi intruders, engaging in smuggling, crossed into Indian territory in Sepahijala district and violently attacked BSF personnel, injuring one. The incident led to a BSF jawan injuring a Bangladeshi national in self-defense. Mumbai Police also apprehended 16 Bangladeshi intruders in various operations. ==See also== *Bangladesh *India *Bangladesh Liberation War == References == Category:India Category:Bangladesh Category:Wars involving India",
 "title": "India-Bangladesh border clashes"
}