{
 "id": "1179660",
 "text": "Priscilla Zuniga (born July 14, 1991) is an American professional wrestler. She currently wrestles for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH) under the ring name Diamanté. She has also made appearances in Impact Wrestling, WWE, and Women of Wrestling (WOW). In AEW, she was the co-winner of the AEW Women's Tag Team Cup with Ivelisse in 2020. == Professional wrestling career == === All Elite Wrestling / Ring of Honor === On the January 15, 2020 episode of Dark, Diamanté made her All Elite Wrestling (AEW) debut, losing to Big Swole. On the July 21 episode of Dark, Diamanté earned her first AEW victory when she defeated KiLynn King. Diamanté decided to team with Ivelisse and enter the AEW Women's Tag Team Cup Tournament. They defeated the teams of Anna Jay and Tay Conti, Dasha and Rachael Ellering, and finally The Nightmare Sisters (Allie and Brandi Rhodes) in the finals to win the tournament. At All Out, Diamanté participated in the 21-woman Casino Battle Royale for a chance at a future AEW Women's World Championship match but the match was won by Ruby Soho. At Grand Slam, she challenged Jade Cargill for the AEW TBS Championship but was unsuccessful. On the November 1 episode of Dark, she challenged Toni Storm in a AEW Women's World Championship Eliminator Match but lost. On the April 27, 2023 episode of ROH on HonorClub, she made her Ring of Honor (ROH) debut, losing against Skye Blue. On the August 3 episode of ROH on HonorClub, Diamanté challenged Athena for the ROH Women's World Championship but was unsuccessful. In July 2023, she signed a contract to become a full-time member of the All Elite Wrestling (AEW) roster. Diamanté decided to enter the tournament to challenge for the ROH Women's World Television Championship. She defeated Kiera Hogan in the first round and lost to Billie Starkz in the quarter finals. On the October 10 episode of ROH on HonorClub, she challenged Red Velvet for the ROH Women's World Television Championship but lost by disqualification. She challenged her again for the championship, this time in a Street Fight, but lost again. == Personal life == On July 20, 2019, Zuniga announced that she was in a relationship with fellow professional wrestler Kiera Hogan. Zuniga's brother is also a professional wrestler under the ring name KC Navarro. == References == ==Other websites== * Category:1991 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Cuban sportspeople Category:LGBT people from Florida Category:LGBT sportspeople Category:Sportspeople from Florida Category:Total Nonstop Action Wrestling alumni",
 "title": "Diamante (wrestler, born 1991)"
}