{
 "id": "1179265",
 "text": "The Socialist Party of Canada (SPC) was a political party. It existed from 1904 to 1925. Their leader was E. T. Kingsley. This party wrote and published the newspaper Western Clarion. ==History== ===Establishment=== The Socialist Party of Canada was created at the Socialist Party of British Columbia's 4th convention in 1904. The people at the convention wanted to make a new political party. They saw that other socialist parties in other provinces were accepted. The party was formed and met for the first time on February 19, 1905. The party was mostly Marxist. They wanted to take over capitalism through military political actions. Because of this goal, they did not accept compromises from trade unionism and smaller political reforms. === Party manifesto and membership === The party's manifesto was their most important work.Newell, 93. The manifesto wrote about class struggle and exploitation of work. The SPC was a network of smaller organizations. The headquarters of the SPC were in British Columbia. These leaders of the SPC were also mostly British Columbians. The SPC was mostly Marxist. However, not all of the members were Marxist. There were also social democrats, trade unionists, and left-leaning people.Newell, 47-52. There were many differences in opinions. This lead to many schisms (or split-offs). This led to the creation of the Social Democratic Party of Canada and the Socialist Party of North America.Newell, 105-115. Until World War I, the SPC was the 3rd largest party in Canada.Newell, 182.Robin, Radical Politics and Canadian Labour, 98-99. ===World War I and its aftermath=== The SPC did not want Canada to enter World War I. The party was unpopular for this. They were often harassed from the government.Newell, 125-26 For example, police killed Ginger Goodwin in 1918 while trying to avoid conscription. In 1918, the Western Clarion was banned by the government.R.W.H., \"'Liberty and Peace' in Canada,' The Socialist Standard [London], vol. 15, whole number 177 (May 1919) pg. 77. On January 11, 1919, the party made a new newspaper. They called it The Red Flag. This was made to avoid the ban of the Western Clarion. The ban ended in 1920. Many SPC supporters started to believe in Bolshevism after the Russian Revolution and the Winnipeg General Strike. However, other supporters started to believe in evolutionary socialism or gradualist socialism. Some of the leaders of the Winnipeg General Strike were SPC members. After the strike, some of these leaders were put on trial. This happened to George Armstrong and William Pritchard.McKay, Reasoning Otherwise, pp. 505-17. In 1921, most of the Marxist SPC members left to join the Workers Party. In 1925, the Socialist Party of Canada was ended.Newell, 193-95. Many of the people left in the party joined the Independent Labour Party. ==Federal election results from 1904 to 1926== ===General elections=== Year SPC Candidates Votes Popular vote 1904 federal election 3 1,794 0.18% 1908 federal election 5 6,071 0.52% 1911 federal election 6 4,574 0.35% 1921 federal election 1 3,094 0.10% 1925 federal election 1 1,888 0.06% 1926 federal election 1 672 0.02% ==SPC Publications== * Socialism, Revolution and Internationalism. Gabriel Deville. 1893/1907. Also published in the SPC's Red Flag series, no. 1. * Manifesto of the Socialist Party of Canada. 1st edition, 1910. 4th edition, 1916. 5th edition, 1920. * Constitution and Bylaws of the Socialist Party of Canada. 1910. * The Proletarian in Politics. C.M. O'Brien. 1910. * The Struggle for Existence. Gerald Desmond. 1911. * Socialism and Unionism. Donald G. McKenzie. 1911. * What is Socialism? W. E. Hardenburg. 1912. * The Way to Power. J. B. Osborne. 1913. * Wage Worker and Farmer. J. Pilkington. 1914. * The Slave of the Farm. Alf Budden. 1914/1918. * Economic Causes of War. Peter T. Leckie, reprinted from The Western Clarion, March-November, 1920. ==Bibliography== * Angus, Ian. 2006. \"A Party of A New Type: The Socialist Party of Canada and the Birth of Canadian Communism.\" Marxism: A Socialist Annual 4: 66-74. * Campbell, Peter. 1992. \"'Making Socialists': Bill Pritchard, the Socialist Party of Canada, and the Third International.\" Labour/Le Travail 30: 45-63. * Campbell, Peter. 2000. Canadian Marxists and the Search for a Third Way. McGill-Queen's University Press. * Campbell, Peter. 2021. \"Let Us Rise: Dialectical Thinking, the Commodification of Labour Power, and the Legacy of the Socialist Party of Canada.\" Labour/Le Travail 87: 93-120. * Frank, David, and Nolan Reilly. 1979. \"The Emergence of the Socialist Movement in the Maritimes, 1899-1916.\" Labour/Le Travail 4: 85-92, 94-113. * Friesen, Gerald. 1976. \"'Yours in Revolt': The Socialist Party of Canada and the Western Canadian Labour Movement.\" Labour/Le Travail 1: 139-57. * Kawecki, Adam T. 1980. Canadian Socialism and the Origin of the Communist Party of Canada, 1900-1922. MA thesis. McMaster University. * Malhotra, Ravi, and Benjamin Islett. 2021. Able to Lead: Disablement, Radicalism, and the Political Life of E.T. Kingsley. UBC Press. * Martynowich, Orest T. 1977. \"The Ukrainian Socialist Movement in Canada.\" Journal of Ukrainian Studies 1: no. 1, 27-44 (Part 1); 2: no. 1, 22-31 (Part 2). * McCormack, A. Ross. 1977. Reformers, Rebels and Revolutionaries: The Western Canadian Radical Movement 1899-1919. University of Toronto Press. * McKay, Ian. 2008. Reasoning Otherwise: Leftists and the People's Enlightenment in Canada,1890-1920. Between the Lines. * Milne, J.M. (Jim). 1973. \"History of the Socialist Party of Canada.\". Socialist History Project. 39 pages. * Newell, Peter E. 2008. The Impossibilists: A Brief Profile of the Socialist Party of Canada. Athena Press. * Robin, Martin. 1968. Radical Politics and Canadian Labour. Queen's University, Industrial Relations Centre. * Troop, George R. 1922. Socialism in Canada. MA thesis. McGill University. == Footnotes == ==Other websites== * The Impossibilists — A short history with selections from the press of the Socialist Party of Canada and the One Big Union, 1906–1938 * Western Clarion () * The Red Flag (OCLC 874024291) Category:Socialist organisations Category:Political parties in Canada Category:1904 establishments Category:1900s establishments in Canada Category:1925 disestablishments in North America Category:20th-century disestablishments in Canada",
 "title": "Socialist Party of Canada"
}