{
 "id": "1179601",
 "text": "Just as many other countries, Holocaust denial Distortion of the Holocaust refers, inter alia, to: * * * * * * has been a phenomenon in Romania since the end of World War II (WWII), much of which was state-sponsored. ==Communist age (1947–1989)== Under Nicolae Ceaușescu's communist rule, Romania's role in the Holocaust was officially denied. It was blamed on the Germans and Hungarians. Romanians were taught about the \"heroic anti-fascist resistance\", emphasizing the anti-Nazi battles following Romania's defection to the Allies. Many former subordinates of Ion Antonescu served in the secret police of Nicolae Ceaușescu and to help him oppress Romanians. Meanwhile, Nicolae Ceaușescu reportedly believed lies about Jews, including The Protocols of the Elders of Zion, and defined Jew as a \"money-changer\" and an \"extortionist\" in an official English–Romanian dictionary. ==Post-communist age (1989 – )== Since the fall of Ceaușescu's communist regime, a systematic effort to whitewash the war criminals, especially Ion Antonescu, has been observed by scholars. Antonescu is praised by some so-called historians as a hero who waged a \"holy war against Bolshevism.\" ===2000s=== Acts of Holocaust denial by politicians occurred from time to time, notable of whom include Ion Iliescu, the former President of Romania (2000–2004). He made similar claims to those of Ceaușescu that there was \"no Holocaust within Romania\" and that the Poles, Jews and communists \"were treated equally\", while denying the Romanian role in the Holocaust and the verified Romanian Jewish death toll. An international inquiry, led by Romanian-American Jewish writer Elie Wiesel, identified all the evidence of Romania's role in the Holocaust. The Elie Wiesel National Institute for Studying the Holocaust in Romania (Romanian: Institutul Național pentru Studierea Holocaustului din România „Elie Wiesel”, INSHR), a state-funded Holocaust research center, was also founded in 2005. ===2020s=== In November 2021, the Romanian parliament passed a law, by a large majority, to require the teaching of the Holocaust and Jewish history from 2023. The only group opposing it was the nationalist party Alliance for the Union of Romanians (AUR). The AUR was condemned by the INSHR. Since September 2023, the Holocaust and Jewish history have become part of the high school curriculum in Romania. ==Related pages== * Holocaust inversion * Secondary antisemitism * History of Jews in Romania * Antisemitism in East Germany * Antisemitism in the Soviet Union ==References== Category:Europe Category:Racism Category:Romania Category:Marxism Category:Cold War Category:Communism Category:Antisemitism Category:The Holocaust Category:Discrimination Category:History of Europe Category:History of Romania Category:20th century in Europe Category:21st century in Europe Category:Antisemitism in Europe",
 "title": "Holocaust denial in post-war Romania"
}