{
 "id": "1179414",
 "text": "Lillian Bridget (born December 8, 2004) is an American professional wrestler. She currently wrestles for All Elite Wrestling (AEW) and their sister promotion Ring of Honor (ROH) under the ring name Billie Starkz. She has also made appearances in Game Changer Wrestling (GCW) and Major League Wrestling (MLW). In ROH, Starkz has been a one-time ROH Women's World Television Champion. == Professional wrestling career == === All Elite Wrestling / Ring of Honor === On the December 27, 2022 episode of Dark, Starkz made her All Elite Wrestling (AEW) debut in a loss to Red Velvet. On the March 9 episode of ROH on HonorClub, Starkz made her Ring of Honor debut in a loss to Trish Adora. At Battle Of The Belts VI, Starkz challenged Jade Cargill for the AEW TBS Championship but was unsuccessful. On April 11, senior producer and special advisor to talent Tony Schiavone announced that Starkz had signed a contract to become a member of the All Elite Wrestling roster. Starkz then decided to enter the Owen Hart Foundation Tournament. She ended up losing to Athena in the quarterfinals at Forbidden Door: Zero Hour. At WrestleDream: Zero Hour, Starkz earned her first victory in AEW. She teamed with Athena, Keith Lee, and Satoshi Kojima to defeat Shane Taylor Promotions (Lee Moriarty and Shane Taylor), Diamanté, and Mercedes Martinez in a eight-person mixed tag team match. At Final Battle, Starkz challenged Athena for the ROH Women's World Championship in the main event but was unsuccessful. Starkz entered the tournament to crown the first ROH Women's World Television Champion. She defeated Robyn Renegade in the first round, Diamante in the quarter final, Mercedes Martinez in the semi final, and Queen Aminata in the finals at Supercard of Honor to become the first ever ROH Women's World Television Champion. Starkz lost the title to Red Velvet at Death Before Dishonor. At Final Battle, Starkz challenged Athena for the ROH Women's World Championship in the main event but was unsuccessful. On the March 19, 2025 episode of Dynamite, Starkz challenged Mercedes Moné for the AEW TBS Championship but was unsuccessful. == References == ==Other websites== * Category:2004 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Sportspeople from Louisville, Kentucky",
 "title": "Billie Starkz"
}