{
 "id": "1179720",
 "text": "Karim Onisiwo (born 17 March 1992 in Vienna) is an Austrian professional footballer. He plays as striker for Bundesliga club FC Red Bull Salzburg . From 2015 to 2023 he also played for the Austrian national football team. ==Career == Karim Onisiwo began his career at Favoritner AC. Then he joined the youth team of SK Rapid Wien. From there, he moved to the youth academy of local rivals FK Austria Wien in March 2002. He stayed until September 2005. Between September 2004 and March 2005, he was on loan to the youth team of 1. Simmeringer SC. From Austria, he moved to the youth academy of SC Team Wiener Linien . At the age of 15, he went to First Vienna FC 1894. At the beginning of July 2011, he was transferred to TSV Neumarkt in the Regionalliga West. He then came to SV Austria Salzburg via SV Straßwalchen. Austria Salzburg At the age of 22 he moved to the second-tier Erste Liga and signed a contract with SV Mattersburg along with teammate Michael Perlak. Sportnet.at After promotion he played for the first time in the Bundesliga. On 5 January 2016, Onisiwo signed a contract with the German Bundesliga club 1. FSV Mainz 05. After nine years and 233 appearances in Mainz, Onisiwo returned to Austria at the beginning of January 2025. He joined Bundesliga club FC Red Bull Salzburg. ==International == In September 2014, Onisiwo was called up for the first time to the Austrian national football team when U-21 coach Werner Gregoritsch included him in the squad for the last two U-21 European Championship qualifiers against Bosnia-Herzegovina and Spain. He also played 25 matches in the Austrian national football team and scored one goal. ÖFB players profile He was part of the the final squad for the 2021 European Championship. He made one brief appearance during the tournament. ==References== Category:1992 births Category:Living people Category:Austrian footballers Category:Sportspeople from Vienna Category:Players of the Austrian national football team Category:FC Red Bull Salzburg players Category:Association football forwards Category:Austrian football forwards",
 "title": "Karim Onisiwo"
}