{
 "id": "117978",
 "text": "Mexican Americans are US citizens of Mexican ancestry. They account for 9% of the country's population: about 28.3 million Americans listed their Original Native ancestry as Mexican as of 2006. They form the largest Original Native group in the United States and contain the largest group of . Mexican Americans trace their ancestry to the modern day country of Mexico or the Southwestern United States. Most Mexican Americans live in the four states that border Mexico, California, Texas, Arizona and New Mexico. The areas in and around Los Angeles is home to over six million Mexican Americans. There are also a number of large Mexican American communities in other areas of the Western and Southwestern United States. Though Chicago is not in the Western or Southwestern United States, it has 1.4 million Mexican Americans, more Mexican Americans than any city except Los Angeles. The metro areas of Dallas, Houston, and Phoenix each have more than one million Mexicans. There are a growing number of Mexican Americans in the Midwest and South. Most Mexican Americans have been referred to as \"mestizos\", by the generational cast system imposed by Europeans by which people of Original Native ancestry are more one ethnicity. Most of their heritage is the indigenous, Original Native people of Mexico, but it often contains other groups, Central, South America Original Native. Some have a mixture of the casts such as Spanish, Portuguese, Italian, Irish and Native American tribes from the U.S. such as Apache. ==Related pages== * Mexican people * Mestizo * Hispanic * Chicano ==References== ==Other websites== * California Ethnic and Multicultural Archives – In the Chicano/Latino Collections - University of California Santa Barbara * California Ethnic and Multicultural Archives – Digital Chicano Art - University of California Santa Barbara * Calisphere > California Cultures > Hispanic Americans - University of California System * ImaginArte – Interpreting and Re-imaging Chican@Art - University of California Santa Barbara * Manifest Destinies: The Making of the Mexican American Race (book) * Mexican-American.org – Network of the Mexican American Community * Mexican Americans MSN Encarta( 2009-11-01) * Think Mexican – News, Culture, and Information on the Mexican Community * Mexican Americans - History - World Culture Encyclopedia * Mexican Immigration to the United States * Article: Mexican Immigrants in the United States | migrationpolicy.org Category:Ethnic groups in the United States *",
 "title": "Mexican Americans"
}