{
 "id": "1179800",
 "text": "The Soviet deportations from Bessarabia and Northern Bukovina were a series of mass deportations of Romanians from Bessarabia and Northern Bukovina between 1940 and 1951. The deportations were conducted by the Soviet Union. Historians said that Joseph Stalin (1878–1953) ordered the deportations as part of a policy to crush the opposition to his power. ==Overview== Most victims of the deportations, which happened after the Soviet occupation of Bessarabia and Northern Bukovina (northeastern Romania) in July 1940, were sent to \"special settlements\" (Russian: спецпоселения) across the Soviet Union. In June 2021, Moldovan historian Ion Varta called the deportations a \"genocide in all law\", despite it not comparable to the Holocaust. The deportations have however received little attention from left-wing scholars in the West, who have substantial influence in academia and history writing. * Lappin, Shalom (2006), ‘How Class Disappeared from Western Politics’, Dissent, Vol. 51, No. 1, pp. 73-78. * * * * Kirsch, Adam (2024), On Settler Colonialism: Ideology, Violence, and Justice, W.W. Norton and Company, New York and London. * * * * * ==Background== Due to the Molotov-Ribbentrop Pact of August 1939, the Romanian government was made to give up Bessarabia and Northern Bukovina to the Soviet Union in June 1940. The deportations started after the Soviets took over Bessarabia and Northern Bukovina. ==Events== ===1941=== On June 12–13, 1941, 29,839 members of families of \"counter-revolutionaries and nationalists\" from the Moldavian SSR, Chernivtsi of Northern Bukovina, and the Ukrainian SSR's Izmail oblasts were deported to Kazakhstan, the Komi ASSR, the Krasnoyarsk Krai, and the Omsk and Novosibirsk oblasts. Sergo Goglidze, an NKVD official close to Lavrentiy Beria, was liable for the deportations. Rudolph Rummel (1932–2014)An American political scientist, a statistician and professor at Indiana University, Yale University, and University of Hawaiʻi at Mānoa estimated that 200,000–300,000 Romanian Bessarabians were persecuted or deported to forced labor camps between 1940 and 1941.Rudolph J. Rummel, Table 6.A. 5,104,000 victims during the pre-World War II period: sources, calculations and estimates, Freedom, Democracy, Peace; Power, Democide, and War, University of Hawaii. As many as 57,000 did not survive. Some historians claimed that the declassified Soviet archives did not support Prof. Rummel's estimation however. ===1949=== On April 6, 1949, the Political Bureau of the Central Committee issued decision number 1290-467cc for the deportation of another 11,280 families from Moldavian SSR, accusing them of being \"kulaks\" and \"Nazi collaborators\". 11,239 families (35,050 persons) were deported on July 6, 1949. In an official Romanian investigation in 2009, 40,000 persons were found to have been deported by the Soviets in total. The deportations roughly ended in 1951. ==Related pages== * Holodomor * Soviet deportation of Greeks * Soviet deportation of Koreans * Soviet deportations of Chechens and Ingush * Soviet persecution of Poles during World War II ==Footnotes== ==References== Category:Racism Category:Communism Category:Deportations Category:Soviet crimes against humanity",
 "title": "Soviet deportations from Bessarabia and Northern Bukovina"
}