{
 "id": "1179727",
 "text": "The S&P; Merval () is the main index of the Buenos Aires Stock Market. Its name comes from the agreement reached with the Dow Jones Industrial Average in 2019. That same year, following the agreement reached, the methodology and composition of the Argentine stock market index were changed. In the case of the S&P; Merval index, it was now composed only of the 22 Argentine companies with the highest weighting in the index. ==Overview== This index measures the value in pesos of a portfolio of stocks listed on the Buenos Aires Stock Exchange. The selection criteria for these stocks is based on the trading volume and number of transactions in the last six months, subject to the necessary condition of trading in at least 80% of the trading sessions considered. The Merval is rebalanced quarterly. The index was developed with a base level of $0.01 on June 3, 1986. As of 30 July 2021 the constituent companies of the index include Aluar (aluminium smelter), BBVA Argentina (financial services), Banco Macro (financial services), Sociedad Comercial del Plata (holding), Edenor (electricity), Grupo Financiero Galicia (financial services), Pampa Energía (energy), Ternium (steel), Telecom Argentina (telecommunications), and YPF (oil and gas).Yahoo list == Companies participating in the leading panel == It is comprised of the following 23 companies operating in the index as of March 2025. Company Symbol Industry Capitalization (million dollars) Value share in Argentine Peso (2024) YPF BCBA:YPFD Oil 15.580 42.150 Grupo Financiero Galicia BCBA:GGAL Private Banking 10.480 6.930 Banco Macro BCBA:BMA Private Banking 6.050 10.075 Telecom Argentina BCBA:TECO2 Telecommunications 5.480 2.705 Pampa Energía BCBA:PAMP Energy 4.800 3.745 BBVA Argentina BCBA:BBAR Private Banking 4.350 7.550 Transportadora de Gas del Sur BCBA:TGSU2 Natural gas 4.290 6.060 Ternium BCBA:TXAR Steelworks 3.060 720 Central Puerto BCBA:CEPU Energy 2.010 1.410 Aluar BCBA:ALUA Aluminum 2.000 759 Edenor BCBA:EDN Electricity 1.770 2.080 Bolsas y Mercados Argentinos BCBA:BYMA Financial services 1.550 433 Loma Negra BCBA:LOMA Cement 1.410 2.515 Grupo Supervielle BCBA:SUPV Financial services 1.380 3.215 Flow BCBA:CVH Telecommunications 1.240 11.160 Transener BCBA:TRAN Mining 835 2.000 Cresud BCBA:CRES Agriculture 726 1.285 Holcim Argentina BCBA:HARG Cement 596 1.735 Sociedad Comercial del Plata BCBA:COME Financial services 493 169 Mirgor BCBA:MIRG Electronic industry 328 23.850 BCBA:TGNO4 Natural gas 280 3.390 Banco de Valores BCBA:VALO Private Banking 277 351 Agrometal BCBA:AGRO Agricultural machinery 59 53 ==References==",
 "title": "MERVAL"
}