{
 "id": "1179099",
 "text": "Thing Explainer: Complicated Stuff is a 2015 Non-fiction book created by Randall Munroe, in which the write tries to explain different hard things using only the ten hundred most used every-day words in the English language. It is made with Simple English. He thought of the book in 2012, when drawing a drawing of the Saturn V up-goer for his funny content on the service that joins the world, xkcd. == Short talk about the book == In Thing Explainer, he explains the job and workings of 54 things using only the ten hundred most used words in this language. The book covers a wide area of things, like pencils (\"writing sticks\"), cameras (\"picture takers\"), microwave ovens (\"food-heating radio boxes\"), airplane engines (\"sky boat pushers\"), and atom bombs (\"machines for burning cities\"). Other than machine things, he also explains human parts and deep things such as the table of the pieces everything is made of. The book asks for its readers to figure out what the hard name is of the things it shows, and was considered by Jack Schofield of ZDNet as a \"puzzle game.\" The book is drawn using stick figures and has a large number of jokes for people who work in different special fields. Peter Gleick wrote for The Huffington Post that people who talk about often use many not-used-often and long words when talking about hard things, and that Thing Explainer talks about \"how to explain ideas and offer information in a simpler way.\" == Beginning and making == The thought of creating Thing Explainer started in 2012, while Munroe was playing space game Kerbal Space Program. Here, he was giving the rockets he made funny names, such as \"Up Goer\" and \"Skyboat,\" and he began wondering if he could explain how a rocket works using such simple language. He drew a drawing of the Saturn V up-goer using drawings from NASA's old papers and put simple things about it on it, such as naming the boosters as the spot where \"lots of fire comes out.\" Munroe showed this drawing in xkcd under the name \"Up-Goer Five\". \"Up-Goer Five\" became the reason of Thing Explainer. In a talk with The New York Times, he stated that \"the word limit is fun, because it forces you to think about it some more.\" Placed in stores by Houghton Mifflin Harcourt (HMH) on November 24, 2015, the book was sold at first for $25 USD. Wired thought of Thing Explainer as the second part to Munroe's 2014 book What If?. HMH began working with Munroe in 2016 to put in parts of Thing Explainer in United States high school school- books. HMH's school-books about the study of the pieces that make everything up, the study of life, and the study of moving, made in 2016, have both old and new drawings, figures, and stick figures by him, as part of the HMH Science Dimensions event. == Thoughts on how good the book is == Reading the book, Naomi Alderman of The Guardian liked the full drawings in Thing Explainer, saying that it was \"a beautifully designed journey through the intricacies of daily life.\" She said that Munroe made very clear word-groups writing the book, showing ideas in a true way and in a way that makes people want to read it. However, she also noted that some of the parts in the book are harder to understand because of the not many words part, which she called \"part of the joke\", saying that the book has \"a cryptic crossword feel.\" Stephen Shankland of CNET stated that Thing Explainer is \"fun if you enjoy puzzles, annoying if you just want to learn.\" Shankland described the book as \"clever, instructive, [and] thought-provoking,\" but stated that the book can come across in a bad way if its reader does not take the book in the right spirit. Gleick stated that Munroe's words on the color of light is one of the best answers about the thing that he had seen, and that school teachers could learn from the book. Writer on the service that joins the world, Cory Doctorow, called the drawings Munroe used in the book as \"a deceptive, seductive way of presenting the inscrutable and chaotic innards of our daily world,\" and was happy at watching the \"linguistic backflips\" he goes through to talk about hard ideas used in studies, while saying good things about how clear the book can be. == Related pages== * xkcd == References == Category:Non-fiction books Category:2015 books",
 "title": "Thing Explainer"
}