{
 "id": "1179383",
 "text": "Rabia Sultan (; , \"spring\"; died 14 January 1712) was the Haseki Sultan of Sultan Ahmed II of the Ottoman Empire. She was the last woman to have the Haseki title. == As imperial consort == It is not certain where she was born, but most of the wives of the Ottoman sultans were of Christian origin, and were sold as slaves through the Ottoman slave trade and brought as servants into the Ottoman harem, and upon their arrival were converted to Islam and given new names.Peirce, Leslie (1993). The Imperial Harem: Women and Sovereignty in the Ottoman Empire. Oxford: Oxford University Press. ISBN 0-19-508677-5. Muazzez Sultan died in 1687, before his son Sultan Ahmed II ascended the throne in 1691, and Rabia, also becoming Ahmed's favorite, gained a powerful position in the royal family known as \"Senior Consort\". On 6 October 1692, she gave birth to twin sons, Şehzade İbrahim and Şehzade Selim, in the Edirne Palace. After their birth, Ahmed bought her the Bayburtlu Kara İbrahim Pasha palace in Kucukcu and presented it to Rabia. However, Şehzade Selim died in May 1693. On 11 November 1692, she was given the title \"Haseki Sultan\". Rabia was the last woman in history to receive this title. After the death of Sultan Ahmed II, the chief wives of subsequent sultans were given the title of Kadin, which was an exclusive and less prestigious title. Kara Mustafa Pasha, who was executed in 1683, left a large amount of wealth to the royal treasury. In December 1692, Rabia Sultan also received from this wealth some diamonds and fur coats and a diamond crown. In January 1694, Rabia attended the wedding of Mehmed IV's daughter Ummugulsum Sultan and Silahdar Serkes Osman Pasha. On 23 October 1694, she gave birth to her third child and only daughter, Asiye Sultan. After Asiye's birth, Ahmed gifted her a land in Aleppo. According to the Topkapi Palace archives dated 28 November 1694, Gevherhan Sultan, daughter of Sultan Ibrahim and sister-in-law of Rabia, was heavily in debt. But Rabia Sultan was the one who was most in debt. Gevherhan Sultan is said to have paid off some of Rabia Sultan's debts, as shown in the archives dated 1 December 1694. == Widowhood and death == Rabia was widowed after Ahmed's death in February 1695. On 7 March of that year, Rabia's son, Şehzade İbrahim, was sent to Valide Sultan Gülnüş, and Rabia and her daughter Asiye were sent to the Old Palace in Istanbul, where Asiye died in December 1695. Rabia Sultan died on 14 January 1712 in the Old Palace, and Rabia was buried next to Ahmed II's tomb in the Süleymaniye Mosque, built by Suleiman the Magnificent in Istanbul. Rabia's son, Prince Ibrahim, died in 1714, just two years after his mother's death. However, he was considered a future sultan. == Issue == Ahmed and Rabia had three children, twin boys and a girl: * Şehzade İbrahim (Edirne Palace, Edirne, 6 October 1692 – Topkapı Palace, Istanbul, 4 May 1714, buried in the Mausoleum of Mustafa I, Hagia Sophia), was the twin brother of Selim; * Şehzade İbrahim (Edirne Palace, Edirne, 6 October 1692 – Edirne Palace, Edirne, 15 May 1693, buried in the Mausoleum of Sultan Mustafa I, Hagia Sophia), was the twin brother of İbrahim; * Asiye Sultan (Edirne Palace, Edirne, 24 August 1694 – Old Palace, Costantinople, 9 December 1695, buried next to his parents in the Suleiman I Mausoleum, Süleymaniye Mosque). == Related pages == * Ottomam Empire * Concubine * Ottoman dynasty == References == == Sources == * * * * * Category:1712 deaths Category:Concubines of Ottoman sultans Category:Royal favourites Category:Haseki Sultan Category:Slavery in the Ottoman Empire",
 "title": "Rabia Sultan"
}