{
 "id": "1179563",
 "text": "Genocides by the Soviet Union can refer to the following atrocities committed by the Soviet Union (1922–1991): * Holodomor, * * * * * * * * * * * a man- made famine (1932–33) under Joseph Stalin (1878–1953) that killed millions of Ukrainians * Soviet persecution of Poles during World War II * * * * ** Katyn massacre, * * * * * * mass executions of captured Polish soldiers, police and members of the intelligentsia * Soviet persecution of Baltic states' population * Dunsdorfs, Edgars. The Baltic Dilemma. Speller & Sons, New York. 1975 * The Harvest of Sorrow: Soviet Collectivization and the Terror-Famine (1986) * Stephane Courtois; Werth, Nicolas; Panne, Jean-Louis; Paczkowski, Andrzej; Bartosek, Karel; Margolin, Jean-Louis & Kramer, Mark (1999). The Black Book of Communism: Crimes, Terror, Repression. Harvard University Press. . * Küng, Andres. Communism and Crimes against Humanity in the Baltic States. 1999 * * * The Baltic States. Years of dependence 1940-1990 (Romuald J. Misiunas, Rein Taagepera, University of California Press, Berkeley and Los Angeles, 1993) * * Narratives of Exile and Identity: Soviet Deportation Memoirs from the Baltic States (V. Davoliute, T. Balkelis, Central European Press, 2018) * A Soviet Story: Mass Deportation, Isolation, Return (Alain Blum, Emilia Koustova in Narratives of Exile and Identity, Central European University Press, 2018) * Soviet Mass Deportation from Latvia, briefing papers of museum of the Occupation of Latvia (Ministry of Foreign Affairs of Latvia) * The History of the Occupation of Latvia (Museum of the Occupation of Latvia) * Soviet deportations of Chechens and Ingush, * * * * sometimes called the Chechen genocide and Ingush genocide * Soviet deportations from Bessarabia and Northern Bukovina * Soviet deportation of Greeks * * * * Το πογκρόμ κατά των Ελλήνων της ΕΣΣΔ, ΕΛΛΑΔΑ, 09.12.2007 * * Soviet deportation of Koreans ==Related pages== * Great Purge * Bosnian genocide * Cambodian genocide * NKVD prisoner massacres * Antisemitism in the Soviet Union ==References== Category:Racism Category:Genocide Category:Communism Category:History of the Soviet Union Category:Soviet crimes against humanity",
 "title": "Genocides by the Soviet Union"
}